[
  {
    "headline": "Allied health workers berate consultant doctors over teaching hospital bill",
    "summarized_story": "“As a result, medical practitioners have tended to believe that it is their sole right to be appointed in such offices.\n“During his tenure as Minister of Health, the first Health Sector Reform Programme for Nigeria was developed and implemented; the National Health Insurance Scheme was launched after being on the drawing board for forty years.\n“Many health policies and legislations were formulated during his tenure, including the hotly debated National Health Bill.\nThe union urged MDCAN and other similar interests in the health sector opposed to the bill to rise above sentiment and parochialism.\nThe only permanent phenomenon in life is ‘change,’ and the change in the health sector is now,” NUAP said."
  },
  {
    "headline": "Allied health workers berate consultant doctors over teaching hospital bill",
    "summarized_story": "“As a result, medical practitioners have tended to believe that it is their sole right to be appointed in such offices.\n“During his tenure as Minister of Health, the first Health Sector Reform Programme for Nigeria was developed and implemented; the National Health Insurance Scheme was launched after being on the drawing board for forty years.\n“Many health policies and legislations were formulated during his tenure, including the hotly debated National Health Bill.\nThe union urged MDCAN and other similar interests in the health sector opposed to the bill to rise above sentiment and parochialism.\nThe only permanent phenomenon in life is ‘change,’ and the change in the health sector is now,” NUAP said."
  },
  {
    "headline": "Kaduna hands over ambulances to 17 medical facilities",
    "summarized_story": "Kaduna State Government, on Thursday, handed over new ambulances to 17 medical health facilities across the state.\nThe News agency of Nigeria reports that the ambulances were handed to the health facilities by the Permanent Secretary, Ministry of Health, Adamu Mansir, in Kaduna.\n“One of the things we are doing is to ensure that the emergency medical system and ambulance system are strengthened.\n“We have 1,095 primary health facilities, 31 secondary health facilities and two dental health facilities.\nHe listed the benefitting health facilities to include: general hospitals in Giwa, Hunkunyi, Pamegua, Doka and Kauru, Saminaka, Fadan Kagoma, Kachia, Kujama, Kurunku, and Sabon Tasha."
  },
  {
    "headline": "Kaduna hands over ambulances to 17 medical facilities",
    "summarized_story": "Kaduna State Government, on Thursday, handed over new ambulances to 17 medical health facilities across the state.\nThe News agency of Nigeria reports that the ambulances were handed to the health facilities by the Permanent Secretary, Ministry of Health, Adamu Mansir, in Kaduna.\n“One of the things we are doing is to ensure that the emergency medical system and ambulance system are strengthened.\n“We have 1,095 primary health facilities, 31 secondary health facilities and two dental health facilities.\nHe listed the benefitting health facilities to include: general hospitals in Giwa, Hunkunyi, Pamegua, Doka and Kauru, Saminaka, Fadan Kagoma, Kachia, Kujama, Kurunku, and Sabon Tasha."
  },
  {
    "headline": "2023: We Are Mobilising Women Nationwide For Tinubu/ Shetima, Says Dr Betta Edu",
    "summarized_story": "The event which was preceded by the unveiling of the Vice Presidential Candidate at the instance of the Arewa Women for Tinubu/ Shetima (AWTS) was also superintended by the National Women Leader as she spoke about the resolve of women nationwide to vote for the party.\nShe restated the readiness and commitments of women to the emergence of Asiwaju Bola Ahmed Tinubu as the president of the country.\nShe also assured the presidential flagbearer of mobilising women to deliver more than forty million votes for the APC in the 2023 presidential election.\nIn his response, Tinubu appreciated APC Women for the visit and extolled the virtues and leadership qualities of the national woman leader, Dr Betta Edu especially her dedication and commitment to the success of the party.\nIn attendance were the Deputy National women Leader Hajia Zainab Ibrahim, the Minister Of state for FCT, Dr Ramatu Tijani Aliyu, Members of the National Assembly led by Senator Grace Bent, Hon."
  },
  {
    "headline": "3 policemen sanctioned for unprofessional conduct",
    "summarized_story": "The Police Command in Lagos State has sanctioned two Assistant Superintendents of Police (ASPs) and one Inspector for alleged unprofessional conduct.\nNAN reports that the three officers were arrested after a video showing their unprofessional conduct against 24-year-old David Ogunnusi, a Youth Corps member serving in Lagos and his brother went viral.\n“They asked for our ID cards, which we showed them as Corps members even in our uniforms, that was not enough proof for them.\n“So, the police just snatched my younger brother’s phone and they zoomed off, saying we should come to their station,” Ogunnusi explained.\n“The corps member, on his part, will be prosecuted for inciting the members of the public against the Police,” he said."
  },
  {
    "headline": "Airlines to prosecute passengers who assault staff",
    "summarized_story": "The Airline Operators of Nigeria (AON), the umbrella body of all airline companies operating in Nigeria, has said that henceforth, aggrieved passengers who destroy properties belonging to any airline or assault airline staff, will be arrested and prosecuted.\nOkonkwo said that such passengers risk blacklisting and also banned from being transported by the members of the group.\n“Dana Air is currently undergoing an operational audit as ordered by the Nigerian Civil Aviation Authority (NCAA).\n” We understand that Dana Air, as a responsible member of this association, had activated its feedback mechanism to inform its passengers of the development and the cancellation of their flight.\nOkonkwo said that as an association, AON would no longer watch passengers destroy properties of its affiliate members without adequate response."
  },
  {
    "headline": "Police rescue 9 kidnap victims in Niger",
    "summarized_story": "The Police Command in Niger say security operatives have rescued the nine abducted residents of Kuchi village of Munya Local Government Area of the state.\nThe News Agency of Nigeria (NAN) reports that some gunmen abducted the victims on Thursday night.\nMr Bala Kuryas, the Commissioner of Police for the state, told NAN on Friday in Minna that a joint security taskforce, including members of the vigilante, rescued the victims unhurt.\nHe said that the victims had since been united with their loved ones.\nKuryas lauded the efforts of the security personnel for demonstrating high sense of professional conduct that led to the successful operation during and after the rescue mission."
  },
  {
    "headline": "Moment comedian, Lasisi Elenu proposes to his lover (Video)",
    "summarized_story": "Skit maker, Nosa Afolabi, popularly known as Lasisi Elenu has proposed to his girlfriend, Nonso Adika.\nThe skit maker who took to his social media page to share the news with his fans and colleagues, said revealed how he met his girlfriend and how she became the love of his life.\nHis post reads: “I had a very big laugh before writing this, Why because, I knew this day would come.\nA day where I’m faced with writing a beautiful and serious message about someone very special to me, A woman who I fell in love with and became my spark in the purest of ways words can’t describe, someone who I’m excited to share with you all even though na still “On Code” and it hit me, hope these my fans wey Dey MENT will not start saying, “Sinzu Money Shey you wan dey whyne us ni” and think this is one funny skit @ But guess what, i no Dey whyne una papa Lasisi don go love up o. I have never been more serious.”Adika an actress gained prominence in Bovi Ugboma’s YouTube drama series ‘Back To School‘ where she played the role of one of the teachers."
  },
  {
    "headline": "Only use of data, technology can fast track fight against TB – WHO",
    "summarized_story": "Only data-driven, evidence-based and enhanced technological interventions can fast-track the end of the Tuberculosis crisis in Nigeria.\nDr. Awoniyi made the assertions at an interactive webinar session with the media on ‘the Journey to End TB in Nigeria.\nMobilize adequate domestic resources and 70 per cent of the TB budget in 2021 was not funded”.\nAlthough Nigeria has been judged not on track to end TB in 2030, in accordance with the Sustainable Development Goals (SDGs) Suvanand Sahu, the Deputy Executive Director of the Stop TB Partnership, said there is still hope if it aligns with the global plan.\nThe global plan according to Sahu clearly indicates priority areas and financial resources needed to fight the disease."
  },
  {
    "headline": "Saipem: NBA asks Benchers Chairman, Wole Olanipekun to step down over partner’s probe",
    "summarized_story": "The Nigerian Bar Association (NBA) has asked legal luminary Wole Olanipekun to step down as the Body of Benchers (BOB) chairman over the Saipem saga.\nAkpata made the call following a petition against Ms. Adekunbi Ogunde, a partner at Wole Olanipekun & Co.Ogunde is accused of engaging in “conduct incompatible with her status and in flagrant disregard of rules of professional conduct”.\nAkpata informed Olanipekun that the NBA had taken the matter to the Legal Practitioners Disciplinary Committee (LPDC).\nThe LPDC is a panel under the BOB which Olanipekun, a former NBA President, heads.\nThough the firm of Henry Ajumogobia (SAN) is defending Saipem, Ogunde told the management to consider hiring Olanipekun & Co."
  },
  {
    "headline": "2023: Gov. Ugwuanyi will represent all of us in Senate – Udi people",
    "summarized_story": "The jubilant people of Udi LGA, who came with their clergy, traditional rulers, different masquerades and cultural dance troupes, said they are deeply grateful to Gov.\nLed by the PDP senatorial candidate, Engr.\nChuka Eneh, Commissioner for Chieftaincy Affairs, Dr. Charles Egumgbe, the General Manager of Enugu State Housing Development Corporation (ESHDC), Hon.\nThe people of Udi LGA, therefore, beseeched God to continue to bless Gov.\nUgwuanyi has remembered Udi LGA in so many ways and has always stood by them, disclosing: “Udi LGA is one of the foremost LGAs in Enugu State."
  },
  {
    "headline": "Recent governorship polls proved my commitment to credible elections – Buhari",
    "summarized_story": "President Muhammadu Buhari has said the outcome of recent governorship elections shows his commitment to violence-free and credible polls.\nAccording to him, the elections in Anambra, Osun and Ekiti States have proven that.\nThe President noted that his desire is to bequeath “an irreversible political process” that will be “democratic and acceptable” to Nigerians.\n“Recent elections in Anambra, Ekiti and Osun are proof of my administration’s irreversible commitment to credible and violence-free polls in Nigeria,” he said.\n“My desire for our nation is that the 2023 elections should clearly mark the commencement of the institutional strength of our electoral body in conducting acceptable, credible and violence-free elections,” he added."
  },
  {
    "headline": "ASUU strike: Kwara NLC mobilizes for national solidarity rally",
    "summarized_story": "Kwara State Council of the Nigeria Labour Congress, NLC, is mobilising unions and organisations for the impending national rally in support of the ongoing strike by the Academic Staff Union of Nigeria Universities, ASUU.\nThis is in compliance with the directive from the national headquarters of the union on the rally.\nIt said the take-off point will be the Labour House, NLC Secretariat, beside the State High Court, in Ilorin, the State capital.\nThe State NLC Chairman, Comrade Issa Ore, who inaugurated the committee, urged it to plan and organise a hitch-free rally slated for 26th and 27th of July 2022.\nThe committee is headed by Comrade Adeniran Rafiu Adebayo as chairman and Comrade Olusina Owoeye as the Secretary."
  },
  {
    "headline": "Ayade: why we're concessioning our industries The Nation Newspaper",
    "summarized_story": "Cross River State Governor Ben Ayade has said the state opted for the concessioning of industries his administration built, to ensure they remained state’s assets.\nHe spoke at the Governor’s Office, Calabar during the concession signing ceremony between Cross River and HBMSL Group.\nAccording to the terms of the agreement, HBMSL is to assume management of the industries and ensure that products from the industries are rolled out within three months.\n“I am happy to announce to you that the people of Cross River have heard your request for cooperation and we will surely cooperate.\n“We will roll out our drums in three months when these factories start manufacturing products,” said Ayade."
  },
  {
    "headline": "Abia sacks poly mgt over loss of accreditation The Nation Newspaper",
    "summarized_story": "Abia State Government has sacked Abia State Polytechnic management led by Elder John Nwangborogwu.\nOther members of the polytechnic council include Dr. Kalu Osonwa (rector), Oriaku Chinyere (registrar), Omenihu Friday (bursar), Ndulaka Chigozie (librarian) and Nwogu Jude (director of works services).\nNBTE promised to ensure that the school did not mobilise students for the mandatory National Youth Service Corps (NYSC) for the next batch stream.\nKelechi Anyanwu -member, Mrs. Love Ezema, -member and Mr. Stanley Nwankpa – member.\nThe government said it has remitted N7.1billion to the polytechnic since the inception of the current administration in 2015."
  },
  {
    "headline": "Wife to donate kidney to Eedris Abdulkareem The Nation Newspaper",
    "summarized_story": "Yetunde, wife of ailing veteran rapper Eedris Abdul Kareem, has been reported to be his kidney donor.\nOn July 6, Abdul Kareem via his Instagram revealed he’d been diagnosed with kidney failure, seeking prayers and good wishes from Nigerians.\nAccording to the statement, the “Jaga Jaga” singer is undergoing dialysis in a hospital in Lagos with the transplant date fixed for end of the month.\nThough the family member wasn’t disclosed by the singer’s team, an insider claimed the wife has opted to be the donor.\nThis is your brother and comrade Eedris Abdulkareem of “Nigeria Jaga Jaga” fame."
  },
  {
    "headline": "'Peter Obi can only win on Twitter' The Nation Newspaper",
    "summarized_story": "A former Kannywood actress, Fati Muhammad, has argued presidential candidate of Labour Party (LP) Peter Obi can win the 2023 election only on Twitter.\n“Peter Obi can only win elections on twitter simply because his supporters have knowledge of twitter forgetting that elections happen in polling unit Not in Twitter page,” she wrote.\nEmphasising her point, Muhammad in a preceding tweet insisted the former Anambra Governor’s supporters are simply good at posting on Twitter, downplaying the reality that elections take place in polling units.\n“Let mie Speak With the language that you would understand much better….. Na only for Twitter Peter Obi fii win election not for polling unit.\nBecox em people only sabi posting on twitter, forgetting na for polling unit election den de happn not in Twitter page,” she added."
  },
  {
    "headline": "NASU, SSANU reject plan to widen salary disparity in varsities The Nation Newspaper",
    "summarized_story": "The Non-Academic Staff Union of Universities (NASU) and the Senior Staff Association of Nigeria Universities (SSANU) have insisted that they will reject any salary recommendation that would cause further disparity in the university system.\nThe unions said it was yet to reach any agreement with the Nimi Briggs Committee renegotiating the 2009 agreement with all unions in the university system.\nAdeyemi said NASU and SSANU held two meetings with the Briggs Committee and during both meetings, there were no deliberations on salary increment and allowances.\nHe said: “Following the inauguration of the Committee, so far, the two Unions of NASU and SSANU had only two meetings with the Committee.\n“As JAC of NASU and SSANU, we are determined to change the status quo."
  },
  {
    "headline": "Atiku opens up on Tinubu, Obi",
    "summarized_story": "He also assured that the PDP National Chairman, Dr Iyorchia Ayu will step down if he (Atiku) wins the presidential election next year.\n“It is very difficult to expect a miracle to happen, simply because Peter Obi is in the Labour Party.\nIn the north, 90 per cent of our people are not tuned to social media,” Atiku said.\nAtiku said he picked the governor of Delta State, Ifeanyi Okowa over the governor of Rivers State, Nyesom Wike because he believes the former can ‘deliver’.\nWhen asked if he needs Obasanjo’s support, Atiku said: “Why will I not need his support?"
  },
  {
    "headline": "Aviation fuel scarcity: Expect flight cancellations, delays – Airline operators",
    "summarized_story": "By Chinelo ObogoAirline Operators of Nigeria (AON) has said passengers should expect more flight delays and cancellations as a result of the scarcity of aviation fuel.\nIn a statement by the association’s spokesperson, Prof. Obiora Okonkwo, he said the situation is foreseen but an unintended consequence of the aviation fuel scarcity in the country.\nHe pleaded for the understanding of the travelling public to bear saying efforts are currently being made to address the development and restore normal flight operations.\n“For this reason, there will be major disruptions in scheduled flight operations including cancellations and unnecessary delays across all airports in the country.\nThis is a foreseen but unintended consequence of the aviation fuel scarcity in the country."
  },
  {
    "headline": "Mike Awoyinfa at 70: Journalism, Ghana, music, sports and me",
    "summarized_story": "On this day, in 1952, Mike Awoyinfa, Nigeria’s ace writer, human angle journalism exponent and pioneer Managing Director/ Editor-in-Chief, The Sun Publishing Limited, was born into the world.\nI was going to ask you that question, whether at 70 you still jog…At 70, I cannot jog anymore.\nMy father migrated to Ghana because he was having children at home, and they were dying.\nWhen you said your father relocated to Ghana because his children were dying, did it also affect the other wife?\nI read and read and read."
  },
  {
    "headline": "Why we lost Osun guber – APC",
    "summarized_story": "From Romanus Ugwu, AbujaThe All Progressives Congress (APC), has given reasons for its poor performance in last weekend’s governorship election in Osun.\nAPC Deputy National Organising Secretary, Hon Nze Chidi Duru, made the declaration while taking a post-mortem review of the party’s loss in last weekend’s Osun governorship election.\nHis words: “We lost the election in Osun State as was proclaimed by INEC and our party has accepted the result.\n“We understand and know as a fact that the governor cleared most of the outstanding liabilities in Osun State, but then, ultimately the electorate chose otherwise.\nThe scenario again repeated itself in Osun state but we had a different result."
  },
  {
    "headline": "Kalu hails APC Chairman, Adamu at 76",
    "summarized_story": "Chief Whip of the Senate, Dr Orji Kalu has described former Governor of Nasarawa State and National Chairman of the All Progressives Congress (APC), Senator Abdullahi Adamu as a selfless statesman and consummate politician with passion for a united and indivisible Nigeria.\nKalu made these remarks in a goodwill message in commemoration of the 76th birthday anniversary of Adamu.\nHe said: “I congratulate former Governor of Nasarawa and National Chairman of the All Progressives Congress (APC) as he clocks 76.\nThe National Chairman has over the years built and sustained relationships across the nooks and crannies of Nigeria owing to his goodwill.\n“In his capacity as National Chairman of the APC, the party has been waxing strong in view of his leadership qualities."
  },
  {
    "headline": "What Babachir Lawal Must Remember – THISDAYLIVE",
    "summarized_story": "Babachir has bluntly failed to reckon with the fact that the choice of vice presidential candidate is essentially the prerogative of the presidential candidate, while working on the candid advice of the major stakeholders of the party.\nHe pointedly and passionately pleaded to the president and party hierarchy that his predecessor in office, Kassim Shettima should be chosen instead.\nHis present office as distinguished Senator is also a contributory factor to his choice as the vice presidential candidate.\nSo, where has Tinubu gone wrong in the choice of Shettima as his vice presidential candidate to have attracted this loads of vituperations from Babachir Lawal and his ilk?\nWe therefore appeal to Babachir Lawal and other mischief makers in APC to reconsider their stands in the interest of the party and henceforth, sheath their swords."
  },
  {
    "headline": "Ebubeagu and the excesses of impunity – THISDAYLIVE",
    "summarized_story": "There appears to be no love lost between Governor Hope Uzodinma and the good people of Imo State.\nMultiple attacks have been carried out in the Southeast to push a region known for its relative peace towards the precipice.\nNeither has his formation of the infamous Ebubeagu security unit which has lurched from one controversy to another since it came into existence.\nIt appears however that more than anything else, it was the activities of IPOB that panicked the South-east governors to the security summit in which Ebubeagu was formed.\nOn Sunday, 17th July 2022, the lives of seven youths in Awomama, Imo State were brutally cut short, reportedly by operatives of Ebubeagu."
  },
  {
    "headline": "Lessons from Osun – THISDAYLIVE",
    "summarized_story": "It has to be said that the political landscape in Nigeria is ever changing and with the recently passed electoral laws, it would be harder to have bad elections in Nigeria.\nI deliberately use the word bad elections because in the past elections were really bad.\nSuffice to say, the Osun elections is a testament to the fact that the BVAS technology by INEC and the transmission of results will make elections more accountable in Nigeria.\nAnother lesson is the role internal democracy plays in the affairs of a nation.\nThe Osun turnout was one of the highest, 42% of the people with PVC voted."
  },
  {
    "headline": "Afeniforo: Service in Uniform with a Difference – THISDAYLIVE",
    "summarized_story": "The first thing that struck me when I got to the station was that I met four officers at the desk.\nIt was then I realised that the person who interacted with me at the desk was the DPO.\nTo me, this was quite unusual as most protocol is that the DPO is the last person you will find at the station desk.\nI sought to know why SP Folake Afeniforo was found at the desk when I came in.\nI can only but commend SP Folake Afeniforo and her subordinates at the Mowe Police Station and I am sure her unusual approach to duties will take her to places."
  },
  {
    "headline": "Buhari Approves Appointment of Three New Permanent Secretaries – THISDAYLIVE",
    "summarized_story": "Olawale Ajimotokan in Abuja​ President Muhammadu Buhari has approved the appointment of three new Permanent Secretaries in the Federal Civil Service following the recently conducted selection process, to fill existing vacancies.\nThe Head of the Civil Service of the Federation, Dr. Folasade Yemi-Esan, made this known in a statement on Friday .\nThe statement signed by Deputy Director (Communications), Office of the Head Service of the Federation, Mohammed Ahmed Abdullahi, listed the newly appointed Federal Permanent Secretaries and their states of origin as follows:Jafiya Lydia Shehu (Adamawa),Udo Okokon Ekanem (Akwa Ibom) and Faruk Yusuf Yabo (Sokoto).\nThe statement said a date for the swearing-in and deployment of the new appointees will be announced in due course."
  },
  {
    "headline": "Alleged N109Billion Fraud: High Court Remands Suspended Nigerian Accountant-General, Idris In Kuje Prison",
    "summarized_story": "A Federal Capital Territory High Court, Abuja has ordered that the suspended Accountant General of the Federation, Ahmed Idris, be remanded in Kuje Correctional Centre pending the hearing and determination of his bail application.\nThe Economic and Financial Crimes Commission had arraigned Idris alongside three others on 14 counts of stealing and criminal breach of trust to the tune of N109, 485,572,691.9.\nOthers arraigned with him are Godfrey Olusegun Akindele, Mohammed Kudu Usman, and a firm — Gezawa Commodity Market and Exchange Limited.\nThe EFCC had accused Idris and his co-defendants of stealing and criminal breach of trust to the tune of N109.5 billion.\nMinister of Finance, Zainab Ahmed thereafter suspended Idris indefinitely without pay."
  },
  {
    "headline": "Alleged N109Billion Fraud: High Court Remands Suspended Nigerian Accountant-General, Idris In Kuje Prison",
    "summarized_story": "A Federal Capital Territory High Court, Abuja has ordered that the suspended Accountant General of the Federation, Ahmed Idris, be remanded in Kuje Correctional Centre pending the hearing and determination of his bail application.\nThe Economic and Financial Crimes Commission had arraigned Idris alongside three others on 14 counts of stealing and criminal breach of trust to the tune of N109, 485,572,691.9.\nOthers arraigned with him are Godfrey Olusegun Akindele, Mohammed Kudu Usman, and a firm — Gezawa Commodity Market and Exchange Limited.\nThe EFCC had accused Idris and his co-defendants of stealing and criminal breach of trust to the tune of N109.5 billion.\nMinister of Finance, Zainab Ahmed thereafter suspended Idris indefinitely without pay."
  },
  {
    "headline": "Peter Obi’s Labour Party Has No Structure To Win 2023 Presidential Election, Claimed To Have 1 Million Votes On Social Media For Osun Gov Election –Atiku",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party, Atiku Abubakar has said that the Labour Party lacks the structure required to win the 2023 presidential election in the country.\nPeter Obi, who was Atiku’s running mate in the 2019 presidential election is the presidential candidate of the Labour Party for the next election.\nHe said, “I really don’t expect the Labour Party to take as much votes from the PDP as people are suggesting, we have seen it in the last election in Osun State.\n“What’s the performance of the Labour Party?\nThis is a party that doesn’t have a governor, doesn’t have members of the National Assembly, and doesn’t have state assembly members."
  },
  {
    "headline": "Peter Obi’s Labour Party Has No Structure To Win 2023 Presidential Election, Claimed To Have 1 Million Votes On Social Media For Osun Gov Election –Atiku",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party, Atiku Abubakar has said that the Labour Party lacks the structure required to win the 2023 presidential election in the country.\nPeter Obi, who was Atiku’s running mate in the 2019 presidential election is the presidential candidate of the Labour Party for the next election.\nHe said, “I really don’t expect the Labour Party to take as much votes from the PDP as people are suggesting, we have seen it in the last election in Osun State.\n“What’s the performance of the Labour Party?\nThis is a party that doesn’t have a governor, doesn’t have members of the National Assembly, and doesn’t have state assembly members."
  },
  {
    "headline": "Peter Obi’s Labour Party Has No Structure To Win 2023 Presidential Election, Claimed To Have 1 Million Votes On Social Media For Osun Gov Election –Atiku",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party, Atiku Abubakar has said that the Labour Party lacks the structure required to win the 2023 presidential election in the country.\nPeter Obi, who was Atiku’s running mate in the 2019 presidential election is the presidential candidate of the Labour Party for the next election.\nHe said, “I really don’t expect the Labour Party to take as much votes from the PDP as people are suggesting, we have seen it in the last election in Osun State.\n“What’s the performance of the Labour Party?\nThis is a party that doesn’t have a governor, doesn’t have members of the National Assembly, and doesn’t have state assembly members."
  },
  {
    "headline": "NBA asks Olanipekun to drop Body of Benchers chairmanship over ‘influence peddling’ row",
    "summarized_story": "The Nigerian Bar Association (NBA) has asked Wole Olanipekun, a senior advocate of Nigeria (SAN), to recuse himself from office as chairman of the Body of Benchers.\nOgunde had, in June, admitted to sending an email to SAIPEM Contracting Nigeria Ltd, soliciting a brief.\nIn the petition, NBA asked the commission to consider whether the partners of the firm of Wole Olanipekun & Co. are not liable to be disciplined alongside Ogunde.\nReacting to the development in a letter addressed to Olanipekun, Ajumogobia said the move was in breach of essential mandatory rules.\nIn a letter dated July 22 and addressed to Olanipekun, Olumide Akpata, NBA chairman, said Olanipekun could influence the processes of the LPDC, since the committee is under the supervision of the Body of Benchers chairman."
  },
  {
    "headline": "NBA asks Olanipekun to drop Body of Benchers chairmanship over ‘influence peddling’ row",
    "summarized_story": "The Nigerian Bar Association (NBA) has asked Wole Olanipekun, a senior advocate of Nigeria (SAN), to recuse himself from office as chairman of the Body of Benchers.\nOgunde had, in June, admitted to sending an email to SAIPEM Contracting Nigeria Ltd, soliciting a brief.\nIn the petition, NBA asked the commission to consider whether the partners of the firm of Wole Olanipekun & Co. are not liable to be disciplined alongside Ogunde.\nReacting to the development in a letter addressed to Olanipekun, Ajumogobia said the move was in breach of essential mandatory rules.\nIn a letter dated July 22 and addressed to Olanipekun, Olumide Akpata, NBA chairman, said Olanipekun could influence the processes of the LPDC, since the committee is under the supervision of the Body of Benchers chairman."
  },
  {
    "headline": "Umahi not recognised as APC senatorial candidate, court rules",
    "summarized_story": "In its ruling on Friday, the court recognised Ann Agom-Eze, who came second in the May 28 senatorial primary for Ebonyi south, which was conducted by the All Progressives Congress (APC).\nAccording to NAN, the court, however, ordered INEC to conduct fresh primary within 14 days for the district.\nAdvertisementAustin Umahi, brother to the governor, was declared winner of the APC senatorial ticket for Ebonyi south.\nHowever, although the APC had listed Dave Umahi as its senatorial candidate for Ebonyi north, he was excluded when INEC published the list of candidates for the 2023 elections.\nAdvertisementThe Ebonyi governor was a presidential candidate on the APC platform at the time his brother won the senatorial primary — he, however, lost the presidential ticket."
  },
  {
    "headline": "Umahi not recognised as APC senatorial candidate, court rules",
    "summarized_story": "In its ruling on Friday, the court recognised Ann Agom-Eze, who came second in the May 28 senatorial primary for Ebonyi south, which was conducted by the All Progressives Congress (APC).\nAccording to NAN, the court, however, ordered INEC to conduct fresh primary within 14 days for the district.\nAdvertisementAustin Umahi, brother to the governor, was declared winner of the APC senatorial ticket for Ebonyi south.\nHowever, although the APC had listed Dave Umahi as its senatorial candidate for Ebonyi north, he was excluded when INEC published the list of candidates for the 2023 elections.\nAdvertisementThe Ebonyi governor was a presidential candidate on the APC platform at the time his brother won the senatorial primary — he, however, lost the presidential ticket."
  },
  {
    "headline": "Kaduna: 645 persons killed in attacks in six months",
    "summarized_story": "The Kaduna government says 645 persons were killed across the state between January and June 2022.\nAruwan said this in his remarks at a public presentation of a report on the “Southern Kaduna Pilot Peace Project on Inter-religious Harmony”.\nIn the first six months of 2022, 645 people lost their lives in such circumstances across the State; 234 of these occurred in the Southern Kaduna area.\nAdvertisement“Amidst all of these, the Kaduna State Government has remained unrelenting in its initiatives for peace and participatory security management, through the Kaduna State Peace Commission.\nRelative stability is now enjoyed in many usually turbulent communities in the Southern Kaduna area,” he said."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Netflix loses 970,000 subscribers in Q2",
    "summarized_story": "Yesterday, global streaming service Netflix announced via its Q2 2022 financial results that it lost 970,000 subscribers in the second quarter of the year.\nAccording to Netflix, over 100 million of its 222 million paying subscribers are sharing their passwords with people outside of their households.\nNetflix, however, still has the biggest share of the streaming service market with 220 million subscribers while Amazon’s Prime Video holds 200 million, while Disney+ and HBO Max hold 87.6 million and 74 million subscribers respectively.\n1 million subscribers in Q3The service also plans to keep its top spot and add 1 million subscribers to its tally by Q3.\nWhile its total number of subscribers might have declined by 970,000, its year-on-year revenue, however, increased by 9% in Q2 2022."
  },
  {
    "headline": "Hannah Subayi believes the gap between Anglophone and Francophone African startups is reducing",
    "summarized_story": "As you know anglophone Africa tends to be a bit more advanced than Arab-speaking and francophone Africa.\nHowever, we cannot deny that the operational environment remains a bit tougher to some extent in francophone Africa.\nWe see more anglophone African investors trying to invest in francophone Africa.\nHS: Historically, francophone Africa, just by virtue of the language, mainly only looked to France for funding and expansion.\nIf you look at francophone African startups, they are incorporated in Paris but that’s not any different from other startups that are incorporated in Delaware."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How to navigate delivery apps and traditional logistics companies in Lagos and Kaduna",
    "summarized_story": "This time, we’ll be talking to three business owners about their experiences with delivery and logistics in the bustling city of Lagos and the ancient Kaduna town.\nKachiThey eventually did the delivery, but that was it for me; I just went back to my individual rider companies.\nBut…I think logistics companies that focus on other forms of logistics have no business with the food business because, first off, the margins are very low.\nAt first, I was using all these normal bike logistics companies for deliveries within Kaduna.\nDelivery within Kaduna used to cost ₦500 ($1), but the people using cars were charging ₦1,000 ($2) or ₦1,500 ($3)."
  },
  {
    "headline": "Here are five alternatives to virtual dollar cards",
    "summarized_story": "Over time many individuals, businesses, and organisations have relied on Barter by Flutterwave for their virtual dollar card services in Nigeria, with shut down of the virtual card they have are left with no choice but to seek for alternatives.\nRead also: Why fintechs are shutting down virtual dollar cards in NigeriaCashbuddy virtual dollar cardFounded by Mike Rosanje, CashBuddy virtual dollar cards in Nigeria works on global platforms like Skrill, Amazon, Apple Music, Stripe, Binance, Facebook, Instagram, PayPal, Netteller, etc.\nThe platform offers the first virtual dollar card free, with a minimum of $5 and no single transaction limit.\nHowever, the dollar card comes with a limited offer that makes you earn 5 percent cashback on all qualifying purchases.\nIn addition, you can’t withdraw more than $1k daily; nor deposit more than $1000 into your virtual card daily."
  },
  {
    "headline": "Petrol subsidy nears N6.7trn as debt service exceeds revenue",
    "summarized_story": "She spoke in Abuja at the public consultation on the draft 2023-2025 Medium Term Fiscal Expenditure/Fiscal Strategy Paper, which officially commenced preparation of the 2023 budget.\nFor the full-year 2022, oil revenues were projected at N9.37 trillion, but just 39 percent of the proposed N3.12 trillion for April-January was realised.\nOther revenues amounted to N664.64 billion, of which independent revenue was N394.09 billion.\nWith these, the 2023 revenue is projected at N8.46 trillion (15.1 percent or N1.51 trillion less than the 2022 budget) but N2.12 trillion more than the earlier.\nBen Akabueze, director general, Budget Office, said from January to April, the subsidy payment exceeded the revenue generated by the NNPC."
  },
  {
    "headline": "Debiri-Erewa applauds Asisat Oshoala as she bags CAF Women Player of the Year award – Nigerian Observer",
    "summarized_story": "Debiri-Erewa applauds Asisat Oshoala as she bags CAF Women Player of the Year awardShare FacebookTwitterStumbleuponLinkedInPinterestHon.\n(Dr) Abike Dabiri-Erewa, Chairman/CEO, Nigerians in Diaspora Commission (NIDCOM) has congratulated Asisat Oshoala, the Super Falcons striker for wining the CAF Women “PLAYER OF THE YEAR” 2022.\nShe encouraged her to continue to be resilient as the whole world is watching, while wishing her greater success in her future endeavours.\nShe equally urged other youths to emulate the impactful life of Asisat on humanity as well as on the continent.\n“A hearty congratulations to you Asisat and keep bringing more glory to the Nation and the continent.”Asisat Oshoala’s victory as the CAF WOMEN PLAYER OF THE YEAR was announced in a gala held at Rabat, Morocco."
  },
  {
    "headline": "Edo Queens gets new head coach",
    "summarized_story": "The management of Edo Queens Football Club has unveiled Moses Aduku as the new Head Coach of the team.\nEdo State Deputy Governor, Rt.\nWe also worked on Edo Queens and rebranded it in line with the same standard of Bendel Insurance.”He said, “Our target is to get Bendel Insurance and Edo Queens into the capital market.\nThat is the only way the clubs will be sustainable.”Shaibu assured the new coach of the government’s support in making Edo Queens champion in Nigeria.\nHe called on Edo people to support the club, adding, “We need Edo people’s support."
  },
  {
    "headline": "Edo readies for 2nd edition of Betsy Obaseki pre-season championship – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…tourney gets FIFA accolade for focus on women footballThe Edo State Deputy Governor, Rt.\nComrade Philip Shaibu, has said plans are in top gear to host the second edition of the Betsy Obaseki Women Pre-Season Football Championship in Edo State.\nSpeaking at the inauguration of the organizing committee for the tournament, in Benin City, Shaibu said the annual tournament has improved women football in Nigeria.\nCommending the Edo State First Lady for initiating the tournament, he said, “I thank the First Lady for this initiative.\nWe want to return Edo State to the number one sporting destination in Nigeria."
  },
  {
    "headline": "Auchi Poly Matriculation: Rector Warns Against Cultism – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestRector, Auchi Polytechnic, Auchi, Dr. Shehu Umar yesterday warmed the newly admitted students of the polytechnic against cultism, examination malpractice and other vices that would be inimical to their academic progress of their lives.\nDr. Umar gave the warning during the institution’s 40th matriculation ceremony, said that the polytechnic had zero tolerance for cultism, examination malpractice and other vices.\nCultism is of no benefit to you as the school management would not hesitate to expel any student found wanting in this regard”, he emphasized.\nAccording to the rector, the polytechnic had concluded plans to enrich the academic programmes in the School of Information and Communication Technology, Engineering Technology and Business Administration.\nHe assured that the staff and management of the institution would provide the enabling environment for students to excel."
  },
  {
    "headline": "2023: Peter Obi, Kwankwaso likely to force a rerun",
    "summarized_story": "The institutes, which described Obi and Kwankwaso as a viable “third forces”, said their emergence as presidential candidates for the 2023 elections has excited many young Nigerians.\nThe statement read in part, “The 2023 elections are a departure from some of the political dynamics that defined previous polls.\nFor the first time since 2007, the presidential election will be an open contest with no incumbent.\nExtremist and sectarian violence continues to spread, banditry and criminality are endemic, separatist elements are gaining traction, and informal security forces are proliferating.\n“INEC and security forces should anticipate and plan for areas where violence may be used to suppress votes/change outcomes."
  },
  {
    "headline": "Osun: Gov Oyetola meets APC leaders after electoral defeat, calls for calm",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State governor, Adegboyega Oyetola, on Friday, met with members and supporters of the ruling All Progressives Congress (APC), the first meeting he would be hosting after losing Saturday’s governorship election to Ademola Adeleke, candidate of the People’s Democratic Party (PDP).\nGovernor Oyetola charged the APC members and supporters not to allow the outcome of the election cause dissatisfaction and division within the party, adding that the APC remains the ruling party in the state.\nHe preached peace and unity among party leaders and members across all levels, from ward to local government to state.\nThe governor also advised party members who have grievances to channel them to the appropriate quarters and stop expressing them in the social media, in the interest of the party.\nHe noted that, as the governor of Osun, he will continue to govern with fear of God and love of the people, just as he reiterated his commitment to the well-being of the people and development of the State."
  },
  {
    "headline": "VIDEO: Hollywood actress, Lupita Nyong’o, eats ants, says they taste really good",
    "summarized_story": "Lupita Nyong’o, a Hollywood actress, has said ants taste really good.\nShe expressed delight at the taste of ants after eating them.\nA viral video on social media shows the Kenyan actress eating ants and declaring that it is tasty.\nWatch video below:"
  },
  {
    "headline": "Vote APC again in 2023 for continuity, Buhari tells Nigerians",
    "summarized_story": "President Muhammadu Buhari, has appealed to the electorate to vote the All Progressives Congress (APC) in the next general elections to ensure continuity in the polity, and stability in the country and West African region.\nThe Nigerian leader made the appeal on Friday while receiving a delegation from Nasarawa State led by Governor Abdullahi Sule at the State House, Abuja.\n‘‘The forthcoming general elections will provide us with the opportunity to convince the electorate on the need for continuity to enable our party to consolidate on our achievements in the last 7 years.\n‘‘To demonstrate this admiration and appreciation to the people of Nasarawa State, I personally attended the inauguration of Governor Tanko Al- Makura on May 29, 2011.\nIn 2015 and 2019, the State remained one of the strongholds of our great party, the APC."
  },
  {
    "headline": "Nigeria’s govt generates N1.6 trillion, spends N4.7 trillion",
    "summarized_story": "The government on Thursday released the performance report which showed that the pro rata spending target for the first quarter of the year was N5.77 trillion, while the actual spending as of April 31 was N4.72 trillion.\nA breakdown of the actual spending showed that N1.94 trillion was for debt service, N1.26 trillion for personnel costs, including pensions, and as at April, N773.63 billion had been spent on capital expenditure.\nRecurrent (non-debt) spending is estimated to amount to N6.91 trillion, which is 40 percent of total expenditure, and 20 percent higher than the 2021 Budget.\nAggregate capital expenditure of N5.96 trillion is 35 per cent of total expenditure, inclusive of the capital component of Statutory Transfers, GOEs (Government-Owned Enterprises capital), and project-tied loans expenditures.\nAt N3.61trillion, debt service is 21 per cent of total expenditure, and 34 percent of total revenues."
  },
  {
    "headline": "Police Detains Peoples Gazette Staff Over Alleged Cyber Stalking",
    "summarized_story": "The Nigeria Police Force (NPF) has raided the Abuja head office of an online newspaper, Peoples Gazette, and arrested four its staff members: Ameedat Adeyemi, Grace Oke, Sammy Ogbu, and Justina Tayani.\nIn a chat with our reporter, the Managing Editor, Ogundipe, who resides outside the country, said the newspaper had made known its stand.\nHe added that though Adeyemi, Ogbu and Tayani (all non-editorial staff members) had been released, the police later returned to arrest an assistant managing editor, Mr. John Adenekan and was still holding Oke as at press time.\nReacting to the story on Friday, the Police PRO, FCT Police Command, DSP Josephine Adeh, said Ogundipe and Adenekan were wanted because an unnamed petitioner had complained of cyber-stalking by the online newspaper.\nThe PPRO also claimed that those arrested had been released on bail after taking their statements as investigation continues."
  },
  {
    "headline": "Police Detains Peoples Gazette Staff Over Alleged Cyber Stalking",
    "summarized_story": "The Nigeria Police Force (NPF) has raided the Abuja head office of an online newspaper, Peoples Gazette, and arrested four its staff members: Ameedat Adeyemi, Grace Oke, Sammy Ogbu, and Justina Tayani.\nIn a chat with our reporter, the Managing Editor, Ogundipe, who resides outside the country, said the newspaper had made known its stand.\nHe added that though Adeyemi, Ogbu and Tayani (all non-editorial staff members) had been released, the police later returned to arrest an assistant managing editor, Mr. John Adenekan and was still holding Oke as at press time.\nReacting to the story on Friday, the Police PRO, FCT Police Command, DSP Josephine Adeh, said Ogundipe and Adenekan were wanted because an unnamed petitioner had complained of cyber-stalking by the online newspaper.\nThe PPRO also claimed that those arrested had been released on bail after taking their statements as investigation continues."
  },
  {
    "headline": "Jet A1: Ibom Air Mulls Flight Cancelations As Air Peace Laments Scarcity",
    "summarized_story": "The scarcity of aviation fuel is hitting airline operators hard as Ibom Air and Air Peace, on Friday, separately hinted passengers to expect flight cancellations in the coming days.\nIn separate press statements made available to LEADERSHIP by Ibom Air and Air Peace, the two airlines said the scarcity of Jet A1 was greatly impacting their operations and might consequently lead to flight cancellations.\nIn a press statement signed by theGM Marketing and Communication, Ibom Air, Aniekan Essienette, the airline said, “this is to bring to your (customer’s) notice that the growing unavailability of aviation fuel has greatly impacted on our operations, leading to flight delays.\nThe intervention of the Nigerian government, which promised to resolve the aviation fuel scarcity, has apparently not been felt.\nThe lingering scarcity pushed airline operators to increase flight base fare to N50,000 and above since February this year, with many Nigerians criticising the move."
  },
  {
    "headline": "Jet A1: Ibom Air Mulls Flight Cancelations As Air Peace Laments Scarcity",
    "summarized_story": "The scarcity of aviation fuel is hitting airline operators hard as Ibom Air and Air Peace, on Friday, separately hinted passengers to expect flight cancellations in the coming days.\nIn separate press statements made available to LEADERSHIP by Ibom Air and Air Peace, the two airlines said the scarcity of Jet A1 was greatly impacting their operations and might consequently lead to flight cancellations.\nIn a press statement signed by theGM Marketing and Communication, Ibom Air, Aniekan Essienette, the airline said, “this is to bring to your (customer’s) notice that the growing unavailability of aviation fuel has greatly impacted on our operations, leading to flight delays.\nThe intervention of the Nigerian government, which promised to resolve the aviation fuel scarcity, has apparently not been felt.\nThe lingering scarcity pushed airline operators to increase flight base fare to N50,000 and above since February this year, with many Nigerians criticising the move."
  },
  {
    "headline": "ARTSPLIT Kicks-off Contemporary Nigerian Arts Auction",
    "summarized_story": "ARTSPLIT, the pioneering art trading platform for African art, has kicked-off the maiden edition of a MOCONA (Modern and Contemporary Nigerian Arts) Auction for two weeks from 15 to 31 July, 2022.\nThis first-of-its-kind auction, titled Ode to Mastery, will feature five prominent Nigerian artists who are key drivers of the contemporary art scene on the continent: Abiodun Olaku, Duke Asidere, Edosa Ogiguo, El-Dragg Okwoju and Oliver Enwonwu.\nThe MOCONA auction will be a split auction, followed by a lease auction of individual works from the five artists.\nThe works will also be available for physical viewing at Hourglass Gallery – 979 Saka Jojo St, Victoria Island 106104, Lagos for the duration of the auction.\nUsers can also participate in a ‘Lease Auction’ on the app to win physical custody of these split artworks for a set period."
  },
  {
    "headline": "Nollywood actors, Brymo meet Tinubu, Shettima in Abuja (Photos)",
    "summarized_story": "Some Nollywood actors have visited the All Progressives Congress (APC) Presidential candidate, Asiwaju Bola Tinubu and his running mate, Kashim Shettima.\nThe actors, under the aegis of Ambassadors of Voice of Change comprise both actors of Igbo origin, Yoruba, Hausa and others.\nAlso with the actors is singer Olawale Ibrahim Ashimi, popularly known as Brymo who had recently endorsed the candidacy of Tinubu for 2023.\nThey were led on the visit by Ahmed Bala, President, Ambassadors of Voice of Change.\nThey met with Tinubu and Shettima in Abuja to drum their support for his 2023 presidential ambition."
  },
  {
    "headline": "Airlines send strong warning to 'angry' passengers",
    "summarized_story": "Okonkwo said that such passengers risk blacklisting and also banned from being transported by the members of the group.\nThe AON said that air transport users who have issues with any operator have legally approved avenues to seek redress.\nThe statement titled: ‘AON Condemns Attack on Dana Air Property’ reads: “The Airline Operators of Nigeria (AON) condemns, in very strong terms, the attack on the property of Dana Air by passengers whose scheduled flights were affected by the grounding of the airline for operational audit.\n” We understand that Dana Air, as a responsible member of this association, had activated its feedback mechanism to inform its passengers of the development and the cancellation of their flight.\nOkonkwo said that as an association, AON would no longer watch passengers destroy properties of its affiliate members without adequate response."
  },
  {
    "headline": "Umahi Loses APC Ticket For Ebonyi South Senatorial District Election",
    "summarized_story": "A Federal High Court sitting in Abakaliki has disqualified Governor David Umahi of Ebonyi State from contesting the election for Ebonyi South senatorial district seat on the platform of his party, the All Progressives Congress (APC).\nThe younger Umahi had clinched the party’s ticket to contest the election in the senatorial district after he emerged the winner of the APC primary in the zone.\nHe later resigned to pave the way for the older Umahi to contest the Ebonyi South senatorial district election after the governor lost out in the APC Presidential Primary to former Lagos State Governor, Bola Tinubu.\nIn a swift reaction to the court’s decision, the Special Assistant to Governor Umahi on Strategy, Chris Oko, said the judge was misled by Agom-Eze.\nDispleased with the development, Governor Umahi approached the Federal High Court seeking an order for INEC to publish his name as the candidate of the ruling party for the election in the senatorial district."
  },
  {
    "headline": "(UPDATED): Woman who set husband ablaze for having child out of wedlock commits suicide",
    "summarized_story": "Wife of Bolu Bamidele, Ifeoluwa, who set her husband ablaze last Tuesday in Osogbo, the Osun State capital, for having a child out of wedlock, has committed suicide by poisoning herself.\nIfeoluwa, whose remains were brought to the mortuary of the Our Lady of Fatima Catholic Hospital, Jaleyemi, Osogbo, by policemen, was said to have decided to end it all in order not to face death sentence.\nOne of the workers at the hospital, who spoke with Tribune Online over the incident on condition of anonymity, said that she was brought dead to the hospital by the policemen and had been deposited at the morgue.\nConfirming the incident, the Public Relations Officer of the state police command, Yemisi Opatola, confirmed the development, saying she was the one that facilitated bringing the corpse of the woman to the hospital mortuary."
  },
  {
    "headline": "BREAKING: US Jury Finds Former Trump Adviser, Steve Bannon Guilty Of Contempt For Defying Congress Invitation, Faces 30 Days Minimum In Jail",
    "summarized_story": "A federal jury has found former adviser to Donald Trump, Steve Bannon guilty of contempt of Congress for defying a subpoena from the House select committee investigating the January 6 attack on the US Capitol Building.\nAfter nearly two days of hearing evidence and witness testimony, the jury reached a unanimous verdict on the two contempt charges in less than three hours.\nBefore the verdict was announced, Bannon entered the courtroom before the jury reassembled in a relatively buoyant mood.\nThe Prosecutor described it as a simple ‘A simple case’, saying Bannon is one of two uncooperative witnesses to be charged so far by the Justice Department for contempt of Congress.\nWhen the House committee was demanding his cooperation, Bannon’s lawyer claimed that Trump’s stated assertions of executive privilege prevented Bannon from testifying or producing arguments — an argument the committee roundly rejected."
  },
  {
    "headline": "Rerun likely over Obi, Kwankwaso’s emergence – US institutes",
    "summarized_story": "The 2023 presidential election may go into rerun with the emergence of Labour Party presidential candidate, Peter Obi, and candidate of the New Nigeria People’s Party, Rabiu Kwankwaso, a delegation of United States-based National Democratic Institute and International Republican Institute, said on Friday.\nThe institutes, which described Obi and Kwankwaso as a viable “third forces”, said their emergence as presidential candidates for the 2023 elections has excited many young Nigerians.\nFor the first time since 2007, the presidential election will be an open contest with no incumbent.\nExtremist and sectarian violence continues to spread, banditry and criminality are endemic, separatist elements are gaining traction, and informal security forces are proliferating.\n“INEC and security forces should anticipate and plan for areas where violence may be used to suppress votes/change outcomes."
  },
  {
    "headline": "Breaking: Super Falcons succumb to bronze-winning Zambia defeat, crumble in worst-ever AWCON outing",
    "summarized_story": "Nigeria’s Super Falcons a while ago on Friday night succumbed to Zambia 0-1 defeat in the third place match at the ongoing African Women Cup of Nations (AWCON) in Morocco.\nThis was after the Nigerian team lost in the semi-final clash against hosts Morocco few days ago.\nDetails loading…Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Zamfara PDP guber candidate congratulates Osun governor-elect",
    "summarized_story": "The Zamfara Peoples Democratic Party’s (PDP) gubernatorial candidate, Dr. Dauda Lawal, has congratulated the governor-elect of Osun State, Adeleke Nurudeen Ademola, on his victory in the just concluded election.\nBlueprint reported that Independent Electoral Commission (INEC), returning officer for the Osun governorship election, Prof, Oluwatoyin Ogundipe, on Sunday morning, declared Ademola Adeleke winner of the exercise.\nLawal in a congratulatory message issued by his media office, in Gusau, Zamfara state capital said he was confident in Adeleke’s abilities to perform to the expectations of the people of Osun state.\n“The people of Osun have made a clear choice by voting for Sen. Adeleke of the PDP.\nThe Zamfara PDP guber candidate also applauded INEC, Civil Society Organisations, and the security operatives for ensuring that the choice of the people prevailed in Osun state."
  },
  {
    "headline": "Ebuka Obi-Uchendu returns as BBNaija Season 7 host",
    "summarized_story": "Big Brother Nigeria organisers have announced Nigerian lawyer and media personality, Ebuka Obi Uchendu as the host for the 7th Season of the reality TV show.\nBBNaija took to social media to reveal that the media personality will be reprising his role in its 2022 edition.\nThe multitalented @Ebuka is bringing it all for #BBNaija season 7.\nEbuka, who participated in BBNaija’s debut season in 2006, has been hosting the show since 2017.\nIt will air from 7pm on DStv channel 198 and GOtv channel 29 with a simulcast on Africa Magic Showcase, Africa Magic Urban, and Africa Magic Family."
  },
  {
    "headline": "Obodofei, GPS collaborate to build, operate gas processing plant in Bayelsa State",
    "summarized_story": "By Ere-ebi AgedahWith the desire to complement government effort in the power and energy sector, indigenous oil and gas firm, Obodofei has collaborated with international Construction engineering company, Global Process Systems, GPS to build a gas processing plant in Bayelsa state.\nThis, Obodofei insisted that this project will bring power into the local community and equally provide job opportunities to the teaming youths in the state.\nSpeaking in Abuja, on Thursday during the signing of a Non-Disclosure Agreement between Obodofei and GPS, Executive Director Obodofei, Dr. Steven Bassey remarked that it has become eminent for indigenous firms to contribute to the national crude oil basket and this can only be achieved through collaborations between indigenous oil and gas producers and their international counterparts in the service sector.\nA delegation from Global Process Systems, GPS led by Managing Director Mr Martin Brownhill and Vice President Business Development Rajesh Shah noted that they were impressed by efforts made by the Obodofei to begin such massive project to the state.\nMartin noted that GPS was keen about doing its due diligence to ensure that the project meets international best standard adding that it will provide all necessary support, training and advice needed to build and operate the proposed gas processing plant and distribution gas turbine in Bayelsa State."
  },
  {
    "headline": "Nigachem builds capacity of over 50 mining companies on use, management of explosives",
    "summarized_story": "By Palma IleyeManufacturing giant of mining explosives, Nigachem Nigeria Limited, yesterday, organized a capacity building training of over 50 mining companies on use of explosives at their sites this is following issues on safe- mining in the solid minerals sector.\nAlso Executive Director, Sales, Nigachem Nigeria Limited, Engr Bayo Yusuf, described the capacity building workshop as reawakening training for customers.\n“These trucks carrying mining explosives are not monitored while moving on the roads.\n“I need to improve more on safe-mining because we basically focus on blasting because blasting is the most technical aspect of mining.\nAdebayo stated this when he played host to the leadership of National Association of Nigerian Students, NANS in Abuja."
  },
  {
    "headline": "Debt servicing surpasses revenue by N310bn as FG releases 4-month fiscal report",
    "summarized_story": "Cost of servicing debt surpassed the federal government’s retained revenue by N310 billion in the first four months of 2022.\nThe federal government said this in its 2022 fiscal performance report for four months released on Thursday.\nAccording to the report, the federal government’s total revenue for the period was N1.63 trillion, while debt service gulped N1.94 trillion.\n“The aggregate expenditure for 2022 is estimated at N17.32 trillion, with a prorata spending target of N5.77 at end of April,” the report reads.\nOf this amount, N1.94 trillion was for debt service, and N1.26 trillion was for personnel costs, including pensions."
  },
  {
    "headline": "CBN governor commissions N600m UNILORIN poultry farm",
    "summarized_story": "By Kayode AbdulazeezGovernor of the Central Bank of Nigeria, CBN, Godwin Emefiele on Thursday commissioned a 600 million naira poultry farm project at the University of Ilorin, Kwara State.\nTo close this gap, the Central Bank of Nigeria has introduced various Intervention Schemes focused on boosting poultry production, creating decent jobs, and fostering innovation in the poultry sub-sector.\nOne of such schemes is the Tertiary Institutions Poultry Revival Scheme that was conceptualised specifically for Tertiary Institutions to design and implement viable poultry projects.\n“Today we witness the commissioning of the first project to be funded and completed through the Scheme.\nThe SPV is Unilorin Bizface synergy Limited, a limited liability company registered with the Corporate Affairs Commission."
  },
  {
    "headline": "Bayelsa Govt Clears Air On State Of Its Airport",
    "summarized_story": "… Says Bayelsa Airport Is Not DowngradedBy Eunice Nnachi, YenagoaThe Bayelsa State Government has made a clarification that the state-owned international airport had not been downgraded, as being insinuated in some quarters.\nThe Deputy Governor, Senator Lawrence Ewhrudjakpo, gave the clarification on Wednesday when the Federated Correspondents Chapel of the Nigeria Union of Journalists, Bayelsa State Council, paid him a courtesy call in Government House, Yenagoa.\nAccording to the Deputy Governor, the D-Check is a major maintenance check to determine the air-worthiness of an aircraft after it had made commercial flights for a period of 10 years.\nI know that you are going to ask us what is happening to the Bayelsa International Airport.\nThe Bayelsa Airport has not been downgraded."
  },
  {
    "headline": "University Strikes: More Trouble As NASU, SSANU Reject Briggs Committee Report",
    "summarized_story": "The Babalakin Committee took off and was meeting with the various university to be very unfortunate and a betrayal of confidence by the Committee.\nLet it be stated clearly, that SSANU and NASU reject any salary recommendation that would cause further disparity in the University system.\nFollowing the disbandment of the Babalakin-led Committee, the Federal Government reconstituted the Committee this time around, led by Professor Munzaili Jibril.\nAfter the disbandment of the Munzali Committee, another Committee under the leadership of Professor Nimi Briggs was constituted in March 2022.\nFollowing the inauguration of the Committee, so far, the two Unions of NASU and SSANU had only two meetings with the Committee."
  },
  {
    "headline": "Umahi Loses APC Ticket For Ebonyi South Senatorial District Election",
    "summarized_story": "A Federal High Court sitting in Abakaliki has disqualified Governor David Umahi of Ebonyi State from contesting the election for Ebonyi South senatorial district seat on the platform of his party, the All Progressives Congress (APC).\nThe younger Umahi had clinched the party’s ticket to contest the election in the senatorial district after he emerged the winner of the APC primary in the zone.\nHe later resigned to pave the way for the older Umahi to contest the Ebonyi South senatorial district election after the governor lost out in the APC Presidential Primary to former Lagos State Governor, Bola Tinubu.\nIn a swift reaction to the court’s decision, the Special Assistant to Governor Umahi on Strategy, Chris Oko, said the judge was misled by Agom-Eze.\nDispleased with the development, Governor Umahi approached the Federal High Court seeking an order for INEC to publish his name as the candidate of the ruling party for the election in the senatorial district."
  },
  {
    "headline": "Alleged Fraud: Court Orders Remand Of Ex-Accountant General Idris In Kuje Prison",
    "summarized_story": "﻿A Federal High Court in Abuja has ordered that a former Accountant General of the Federation, Ahmed Idris, and three other defendants be remanded in the Kuje Correctional Facility.\nAlleged N109bn Fraud: EFCC Arraigns Ex-Accountant General IdrisEFCC Arrests Accountant-General Over N80bn FraudCounsel to Mr Idris, Chris Uche prayed the court to allow the defendant to continue enjoying the administrative bail granted to him by the antigraft agency.\nThe lawyer asked the court to permit the defendants to come back on Monday and not remand them at any correctional facility.\nInterjecting, Idris’ counsel pleaded with the court that due to the porous security nature of the Kuje correctional facility, his client should be remanded in the EFCC custody.\nJustice Ajayi however, repeatedly ordered the Senior Advocate to sit down, stressing that nobody can overturn her orders before her."
  },
  {
    "headline": "Aviation Fuel Scarcity May Lead To Flight Cancellations, Ibom Air Alerts Passengers",
    "summarized_story": "Authorities of Ibom Air have alerted their customers of the possibility of cancellation of flights amid the recent delay of scheduled flights operated by the airline.\nHe said the recent difficulty experienced by its customers was a result of the growing unavailability of aviation fuel.\nJust Wednesday, the Nigerian Civil Aviation Authority (NCAA) suspended the Air Transport Licence (ATL) and Air Operator Certificate (AOC) of Dana Air indefinitely.\nThe decision, according to NCAA Director-General, Captain Musa Nuhu, was made pursuant to Section 35(2), 3(b) and (4) of the Civil Aviation Act, 2006 and Part 1.3.3.3(a)(1) of the Nigeria Civil Aviation Regulations (Nig.CARs), 2015.\nRead the full statement by Ibom Air to its customers below:"
  },
  {
    "headline": "Alleged Professional Misconduct: NBA Asks Body Of Benchers Chairman Olanipekun To Recuse Self",
    "summarized_story": "The Nigerian Bar Association (NBA) has called on a Senior Advocate of Nigeria (SAN), Wole Olanipekun, to recuse himself from his position as Chairman of the Body of Benchers (BOB).\nThe letter which was addressed to Olanipekun was titled, RE: PETITION AGAINST MS ADEKUNBI OGUNDE BY THE NIG.\nThe brief was related to the ongoing $130 million case at the Rivers State High Court brought by the Rivers State government.\nHer firm also sent out a disclaimer that Ogunde’s letter was sent out without their authority.\nWhen contacted for his reaction to the letter, Olanipekun told Channels Television that he was on holiday outside the country and had not seen the letter or received it."
  },
  {
    "headline": "Shettima: Tinubu adamant as reactions trail fake clergies' presence -",
    "summarized_story": "The Presidential candidate of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu has remained indifferent to the reactions trailing the alleged presence of fake clergies at the unveiling of his runnung mate, Senator Kashim Shettima.\nAdvertisementThe APC and the presidential candidate had jointly denied the allegation of hiring fake bishops to the venue of the unveiling, saying they did not engage in such act.\nIn this video, Nigerians react to this development and many other stories making the headlines in national dailies.\nAdvertisement"
  },
  {
    "headline": "Uzodimma dissolves 27-man Interim Management Committee Chairmen -",
    "summarized_story": "Imo State Governor, Hope Uzodimma has dissolved the 27-man Interim Management Committee Chairmen.\nIn a Statement by the Chief Press Secretary and Media Adviser to the Governor Oguwike Nwachuku, the Governor dissolved the IMC Chairmen Thursday after a closed door meeting with them at the Sam Mbakwe Executive Chambers, Government House Owerri.\nAdvertisementAt the meeting, Governor Uzodimma thanked them for the services they rendered in their different local government areas since their appointment about two and half years ago.\nAdvertisementAdvertisementImo State Governor also told the dissolved IMC Chairmen that his government will not hesitate to engage their services in other areas they are found capable as APC members.\nResponding, Chairman of ALGON in Imo State, Willie Okoliogo, who is also the Chairman of Oru West Council, on behalf of other IMC Chairmen promised to remain loyal to the Governor and the APC."
  },
  {
    "headline": "NLC shuns FG, says no going back on national protest over ASUU strike -",
    "summarized_story": "The Federal Government has appealed to the Nigeria Labour Congress to cancel its planned protest over the prolonged strike by University workers.\nMinister of Labour and Employment, Chris Ngige, made the appeal on Thursday at a meeting with the leadership of NLC in Abuja.\nChris Ngige said the NLC, being aware of efforts by the Government to end the strike, was not expected to embark on any rally or protest.\nAdvertisementAdvertisementHe said he was mandated by the Federal Executive Council to notify them of the serious security implications of the planned protest.\nAdvertisementThe NLC assured the Government of a peaceful protest adding that infiltrators would not be allowed to participate in it."
  },
  {
    "headline": "Plateau APC guber candidate speaks on alleged post primary crisis -",
    "summarized_story": "The governorship candidate of the All Progressives Congress in Plateau State, Nentawe Yilwatda Goshwe, has described the alleged crisis within the APC family in the state as a mere conjecture.\nMr Goshwe disclosed this on Thursday while featuring on TVC News’ This Morning show.\nAdvertisementThere are reports that some APC members in the state are not happy about the conduct of the party’s governorship primary which he won.\nAdvertisementAdvertisementAlthough he urged those who may have any issue with the outcome of the primary to channel their grievances through the right quarter, the APC candidate But assured that the party in the state is more united than ever."
  },
  {
    "headline": "Nigeria’s Debt Service Hits N1.94trn, Overwhelms Revenue by N310bn",
    "summarized_story": "It also emerged on Thursday that the federal government spent more to service debt in the first quarter (Q1) of 2022, than the actual revenue it earned during the same period.\nOf this amount, N1.94 trillion was for debt service, and N1.26 trillion was for personnel costs, including pensions.\nSo, while the revenue might not be monthly, we will work on an arrangement on how this will be paid.\n“So, when they generate revenue, instead of remitting the revenue they are using part of the revenue or all of them to fund the subsidy.\n“The inflation rate is projected to average 17.16 per cent in 2023, up from the revised average of 16.11 per cent for 2022."
  },
  {
    "headline": "Nigerian Court Asks Police IG to Investigate Tinubu’s Perjury Allegation",
    "summarized_story": "The permission followed an ex-parte application argued by the group through its lawyer, Mr Ugo Nwofor.\nThe court, in a ruling, held that the ex-parte application was meritorious and subsequently granted it, fixing November 1, for hearing of the substantive suit.\nThe main suit, dated and filed on July 4 by the group, has the Nigerian Police Force and the Inspector General of Police as 1st and 2nd respondents, respectfully.\nThe applicant in its petition to the IG, claimed that Tinubu lied on oath in his form CF 001 he submitted to INEC in aid of his qualification for the governorship election in Lagos State in 1999.\nHe has also been accused of drug dealings in the US in the 90s for which he allegedly forfeited nearly half a million dollars to the US government."
  },
  {
    "headline": "In the Aftermath of Osun Poll, Wike, Ortom, Makinde Agree Not to Leave PDP",
    "summarized_story": "“I actually met with Governor Wike in London and met with my brother, the Governor of Oyo State, Makinde, and the Governor of Abia state.\nThat provided an opportunity to brainstorm on what was happening back home in our party, the PDP especially.\nOur presidential candidate has reached out to me to also further persuade Governor Wike that he’s coming to see him.\nHe said, “I believe our presidential candidate will work with Wike, once they discuss, he’s pacified, I will be pacified.\nBut in our meeting, we agreed that our brother, Governor Wike needed to be pacified and once that is done, all of us will team up together."
  },
  {
    "headline": "Nigeria Urges Labour Unions to Shelve Protest and Stop Supporting Labour Party",
    "summarized_story": "It also urged the organised labour not to mobilise support for Labour Party as it would amount to a violation of the Trade Union Act.\nFurthermore, Ngige told NLC not go ahead with plans to campaign for the Labour Party in the 2023 General election.\n“I heard when you said you are mobilising for Labour Party.\nBut, a trade union is not a political party.\nOne of the provisions is that people of like minds can organise themselves and form a political party."
  },
  {
    "headline": "Rivers’ Governor Wike Vows to Prosecute Amaechi, Cole Over Alleged Looting of State’s Assets",
    "summarized_story": "Rivers State Governor, Nyesom Wike has vowed that a former governor of the state and the immediate past Minister of Transportation, Chibuike Amaechi as well as the All Progressives Congress (APC) governorship candidate for the state, Tonye Cole must face court trial over alleged looting of state’s assets.\nWike said he was determined to safeguard the state from those who are only interested in looting the commonwealth of Rivers people.\nWhat Rivers people will hear, Rivers people will be shocked to know what the former governor of the State and Minister did in this state with his partner, Tonye Cole.\nBut we are still working within the city to change its landscape.”The Rivers State governor said alleged looters were desperate to cover their track, maintaining that Rivers people would not allow such persons who do not have the interest of the state to take over its affairs.\nWike explained that genuine lovers of the state should be the ones presenting themselves to serve the state as governor not looters."
  }
]