[
  {
    "headline": "Reps recommend N390m compensation for Customs killings in Oyo, Katsina",
    "summarized_story": "The House of Representatives has asked the Nigeria Customs Service to compensate victims of extrajudicial killings and injuries caused by its officers and men across the country with a total of N390m.\nThis is based on the recommendations in the reports by the House Committee on Customs and Excise after investigating two incidents in Oyo State and one incident in Katsina State.\n“The grand total for compensation for both the deceased and the injured is the sum of N82m only.\n“The value of total compensation is N26m only.\nThis will encourage the Nigeria Customs Service to be able to curtail smuggling with fewer casualties on their side."
  },
  {
    "headline": "Imo nurse remanded for child trafficking sent back to prison",
    "summarized_story": "A High Court in Owerri, Imo State, on Tuesday, once again denied a suspected child trafficker, Ngozi Ebuzoaju, bail.\nEbuzoaju, a nurse, who was brought to the court in handcuffs by officers of the Owerri Correctional Centre, had been in custody for some months.\nI don’t grant bail in cases that are in another court.\nThis case is, therefore, adjourned till February 18 and transferred to High Court 5 for hearing,” the judge said.\nHe advised the counsel for the accused to file their bail application before the presiding judge of the new court."
  },
  {
    "headline": "Senate moves to Establish Solid Minerals Development Bank",
    "summarized_story": "By Henry Umoru, ABUJAMOVES by the Senate to establish the Solid Minerals Development bank got a boost yesterday as a bill to that effect scaled second reading in the Senate.\nA Bill for an Act to provide for the Establishment of the Solid Minerals Development Bank and for other related Matters therein, 2020( SB.720) is sponsored by Senator Oseni Yakubu, APC, Kogi Central.\n“The bank is a financial inclusion bank whose major objective is for them to satisfy the funding needs of the solid minerals sector in this country.\n“The principal mission of the bank is to increase financial inclusion by providing access to credit finance.\n“None of the commercial banks or at least very minimal that are in the process of financing solid mineral development in Nigeria."
  },
  {
    "headline": "Deputy CEO of Geregu Power, Omodayo-Owotuga, joins FBN Holdings board",
    "summarized_story": "Julius B. Omodayo-Owotuga, the Deputy Chief Executive of Geregu Power Plc and previously Group Executive Director Finance & Risk Management of Forte Oil Plc (now Ardova Plc) has joined FBN Holdings Board as a Non-Executive Director following the approval of his appointment by the Central Bank of Nigeria, according to the notification sent by the company secretary to the NGX.\nOmodayo-Owotuga (popularly known as JB) is a finance expert with tremendous experience in Finance, Risk Management, Treasury, Internal Controls, General Administration, Procurement, and Information Technology.\nWhile at Forte, he was a member of the Executive Management Team that restructured a then moribund company into a vibrant industry player.\nBefore joining Forte Oil Plc, he was responsible for the Asset and Liabilities Management function at the Africa Finance Corporation.\nHis two decades’ work experience spans blue-chip companies such as KPMG, Standard Chartered Bank, Africa Finance Corporation (AFC), Forte Oil Plc, MBC International Bank (now First Bank of Nigeria Limited) and Geregu Power Plc."
  },
  {
    "headline": "Police arrest operator of illegal rehab center, rescue 113 inmates in Kano",
    "summarized_story": "By Bashir BelloKANO – Police operatives in Kano on Tuesday said they have arrested one Musa Safiyanu, 55-year-old, running an illegal rehabilitation center in of Naibawa ‘Yan Lemo Quarters, Kumbotso LGA, Kano State despite ban by the state government.\nConfirming the development, spokesperson of the Kano State Police Command, SP Abdullahi Haruna said about 113 inmates confined and locked up in a room have been rescued from the illegal rehab center.\nAnd that, one of the inmates named Aminu Ado, ‘m’, 22 years old, of Na’ibawa Quarters Kano was tortured to death on the 29/01/2022 by Abdulladif Musa, ‘m’, 18 years old, of Na’ibawa Wailari Quarters Kumbotso LGA, Kano State.\nThey were rushed to Murtala Mohammed Specialist Hospital Kano for treatment and handed over to Kano State Government.\n“On preliminary investigation, the suspects confessed to have been operating the centre for over ten (10) years despite the initial ban by Kano State Government."
  },
  {
    "headline": "Reps want thorough probe, justice for slain Hanifa Abubarkar in Kano",
    "summarized_story": "The House made the call while considering a motion on the subject matter presented at the plenary by Hon.\nIn his motion, Idris said “I wish to call the attention of this honourable house to a tragic incident that occurred in Kano State on the 20 of January 2021.\n“Hanifa was abducted on the 4th of December 2021 by her teacher Abdulmalik Mohammad Tanko who demanded a ransom of N6,000,000.\n“He received this money but went ahead to kill her, a devastating situation that shocked the entire people of Kano state and the nation at large.\nIt mandated its committees on Justice, Human Rights, Civil Societies & Development Partners to ensure compliance to the resolution."
  },
  {
    "headline": "Greenhorn, Alade wins APC Akure South/North Rep Bye-election",
    "summarized_story": "Dayo Johnson AkureA greenhorn, Otunba Mayokun Lawson Alade has emerged as the candidate of the All Progressive Congress Bye-election for Akure South / North Federal Constituency in Ondo state.\nThe chairman of the seven-man primary committee, who is the deputy governor for Anambra State, Nkem Okeke declared Alade the winner of the primary election held at the international Dome, Akure last night.\nOkeke said 702 delegates participated in the primary election adding that three ballots were voided.\nThe Independent National Electoral Commission INEC had slated the bye-election in Akure South/North Federal Constituency in Ondo state slated for February 26.\nAkeredolu, who declared that he is support nobody in the primary election, encouraged all delegates to vote according to their conscience."
  },
  {
    "headline": "Bill to establish Solid Minerals Development Bank passes second reading",
    "summarized_story": "The bill for seeking the establishment of a Solid Minerals Development Bank, which was sponsored by Senator Yakubu Oseni representing Kogi Central Senatorial District, on Tuesday passed its second reading in the upper legislative chamber.\nThe bank, according to Oseni, would address the lack of financing of the solid minerals sector by commercial banks in Nigeria.\nAccording to him, the bank will serve as a development finance institution that seeks to accelerate sustainable socio-economic development and boost the solid minerals sector as well as the quality of life of the people by providing financial and non-financial investments in the sector.\nThe lawmaker said: “The principal mission of the bank is to increase financial inclusion by providing access to credit finance.\nAfter contributions by senators that led to the passage of the bill, the Deputy Senate President, Ovie Omo-Agege, referred it to the Committee on Solid Minerals for further public hearing."
  },
  {
    "headline": "Some politicians behind insecurity in Zamfara – Commissioner",
    "summarized_story": "The Zamfara State Commissioner of Religious Affairs, Sheihk Sani Tukur Jangebe, has blamed the insecurity situation in the state on political stakeholders, saying that banditry will end as soon as they decide.\nThe commissioner said this while calling on the people of the state to seek religious and western education in order to become useful and productive members of their respective societies.\nJangebe made the call while delivering his sermon on the insecurity situation in the state at Muslims Foundation Jumuat Mosque, Government Reserved Area, Gusau, the state capital.\nThe commissioner pleaded with the people of the state to support the government by giving useful information to the security agencies.\nHe said that the federal and the state government have been trying their best to end banditry in the state."
  },
  {
    "headline": "Nigeria’s health system can deal with any situation on one condition – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo on Tuesday said Nigeria’s public health system can deal with any situation if well-resourced.\nOsinbajo stated this on Tuesday when he received, on a courtesy visit to the Presidential Villa in Abuja, a delegation from the Bill and Melinda Gates Foundation.\nThe delegation was led by its President, Dr Christopher Elias and accompanied by Alhaji Aliko Dangote, founder of the Dangote Foundation.\n“I am confident that our public health system is robust enough to deal with any situation so long as it is well resourced at the relevant times.\nThe VP said the Federal Government looked forward to more collaboration with partners for the benefit of the Nigerian people."
  },
  {
    "headline": "Gbajabiamila reacts to death of Lateef Shitta-Bey",
    "summarized_story": "The Speaker of the House of Representatives, Rep. Femi Gbajabiamila, has reacted to the death of a former member of the Lagos State House of Assembly, Hon.\nLateef Shitta-Bey.\nGbajabiamila noted that Shitta-Bey, a former member representing Surulere Constituency I from 2003 to 2007, worked tirelessly for his people.\nHe sent his condolences to the people of Surulere Constituency 1, especially the Shitta-Bey family, for the loss.\nSpeaker Gbajabiamila prayed Allah to reward the late Lateef Shitta-Bey with Jannatul Firdaus."
  },
  {
    "headline": "Suspend action on new Obaship law, there’ll be consequences – Ogun traditionalists to Abiodun",
    "summarized_story": "The controversy trailing the newly assented Obaship law in Ogun State is yet to subside as traditionalists have asked Governor Dapo Abiodun to put a hold on the strategic and delicate part of the process of king-making and burial, saying it may have consequences on affected towns.\nDAILY POST reported earlier that the new Obaship law has put an end to what the state government described as fetish practices in the installation and burial of traditional rulers.\nAccording to the new law, Obas can now be installed or buried according to their faith instead of the imposition of rituals by traditionalists in the affected communities.\nThe law has been generating reactions from some Yoruba elders, who accused the Ogun State Government of plans to erode culture and traditions.\nOba Ifarotimi Balogun, who is the Olu-Isese worldwide, stated that Yoruba culture has helped to sustain the land from complete foreign invasion and cultural annihilation."
  },
  {
    "headline": "U.S. begins no interview for visa renewal in Nigeria",
    "summarized_story": "It was a sweet relief yesterday for non-immigrant visa applicants in Nigeria, following the kick-off of the no-interview visa renewal regime by the United States (U.S.) Mission in Lagos.\n- Advertisement -“Your previous visa was issued in Nigeria.\nYour previous visa was a full validity, multiple entry visa.\n“Your previous visa expired within the last 24 months or will expire in the next three months from the date of application.\n“You have all your passports covering the entire period since receiving the previous visa and the passport with the most recent visa."
  },
  {
    "headline": "Wike: North can’t stop South from getting PDP ticket",
    "summarized_story": "Rivers State Governor Nyesom Wike yesterday insisted that it was the turn of the South to provide the party’s standard-bearer in the election.\nLast week, Bauchi State Governor Bala Mohammed said the party would field a candidate from the North in 2023 because the president produced by the PDP – Goodluck Jonathan – was a Southerner.\n- Advertisement -Besides Governor Mohammed, Sokoto State Governor Aminu Tambuwal, former Vice President Atiku Abubakar, former Senate President Bukola Saraki, all from the North, have indicated interest to contest for President on PDP platform.\n“That was how Chief Olusegun Obasanjo, from the South, contested the elections with Alhaji Atiku Abubakar from the north as his running mate under the PDP.\n“To which sub-region the presidency should be further zoned to in the south, is a different matter entirely."
  },
  {
    "headline": "Imo advises businessmen, producers to raise export bar",
    "summarized_story": "Imo State Government has advised businessmen and producers of export commodities to develop and package products that command international acceptance.\nIt called on the Nigerian Export Promotion Council (NEPC) to proffer solutions and ways of reviving interest in export business.\nHe called on the NEPC to proffer solutions and ways of reviving interest in export business.\n- Advertisement -The commissioner noted that besides oil, which accounts for over 90 per cent of the nation’s revenue, Nigeria does not have products that will stimulate export.\nThe workshop, which attracted the President, Imo Exporters Summit, His Royal Highness Eze George Eke and other stakeholders in the export business, featured lectures by the representative of the Executive Director/ CEO of the Nigerian Export Promotion Council, Ben Acho and Ngozi Ojekpe."
  },
  {
    "headline": "Forex turnover at official window dropped from $4.44b to $2.18b",
    "summarized_story": "Forex turnover at official window dropped from $4.44b to $2.18bNigeria recorded a 51 per cent decline in forex turnover last month, it was learnt yesterday.\nThe turnover dropped to $2.18 billion at the Investors and Exporters (I&E) forex window in January.\nForex turnover at the FMDQ OTC represents the total amount bought and sold at the official forex market in Nigeria.\n- Advertisement -The $2.18 billion forex turnover, however, represented a 90.3 per cent increase when compared to $1.15 billion recorded in the corresponding period of last year.\nManaging Director, Financial Derivatives Company (FDC) Limited, Bismarck Rewane, said the Nigerian forex market is segmented with multiple exchange rates practice."
  },
  {
    "headline": "How to end banditry, killings, by El-Rufai",
    "summarized_story": "Between Sunday and Monday, terrorists killed no fewer than 11 people in Niger communities.\n- Advertisement -Our correspondent learnt that three soldiers, four vigilantes and four villagers were killed in Mariga and Paikoro local government areas.\nEl-Rufai spoke while receiving the 2021 annual security report presented by the Kaduna Commissioner of Internal Security and Home Affairs, Samuel Aruwan.\nEl-Rufai believes the situation requires a dedicated theatre command as it is in the Northeast.\n“We will do everything to stop the killings and return normalcy to the affected communities,” he vowed."
  },
  {
    "headline": "FG Approves Resumption of Emirates Flight Operations to Nigeria",
    "summarized_story": "The federal government has given approval for Dubai-based Emirates Airlines to resume flight operations to Nigeria anytime, just as Air Peace has indicated that it would resume operations to Dubai from March 1, 2022.\nThis was contained in a letter written by the Nigerian Civil Aviation Authority (NCAA) and addressed to His Excellency, Saif Mohammed Al Suwaid, Director General, UAE General Civil Aviation Authority dated February 1, 2022 with reference: NCAA/DG/CCAA/20/16/119.\nThe letter stated, “Nigerian Civil Aviation Authority extends its compliments to the General Civil Aviation Authority of United Arab Emirates.\n“Consequently, Emirates Airlines can resume scheduled passenger flight operations to Nigeria at its convenience.\nEarlier, Nigeria and UAE had settled impasse occasioned by disagreement over conduct of COVID-19 tests, and later disagreement over flight slots."
  },
  {
    "headline": "MTN’s Public Offer Oversubscribed by 139.47%",
    "summarized_story": "Emma OkonjiThe Series 1 offer for sale of 575 million shares held by the MTN Group in MTN Nigeria (the Offer) to Nigerian investors, which held last December, has been successfully completed and was oversubscribed by 139.47 per cent, which is an additional 82.25 million MTN Nigeria shares.\nThe oversubscription raised the initial number of shares sold from 575 million to a total of 661.25 million shares.\nThe Offer was implemented by way of a bookbuild to qualified institutional investors and a fixed price offer of N169.00 per share to retail investors.\nFollowing the successful completion of the Offer, MTN Group’s shareholding in MTN Nigeria reduced by 3.25 percentage points, from 78.83 per cent to 75.58 per cent.\nIn all, 661.25 million MTN Nigeria shares were allotted."
  },
  {
    "headline": "Senate Okays Bill to Stop Advance Yearly Rent Payment",
    "summarized_story": "Sunday Aborisade in AbujaThe Senate on Tuesday passed for second reading, a bill to stop landlords in the Federal Capital Territory (FCT) from demanding yearly advance rent payment from tenants.\nAdeyemi said the bill sought to replace the current annual advance rent payment with monthly payments in arrears, in order to make life meaningful for workers who are groaning in pains to pay their rents.\nHe said the Senate would be helping poor Nigerians working and residing in Abuja if the bill was signed into law.\nHe described it as a welfare-oriented programme that would enjoy the support of Abuja workers and residents.\nHe insisted that the Senate should not dictate the rent payment modalities to the landlords when government was doing nothing to either regulate the cost of land and prices of building materials."
  },
  {
    "headline": "100 for 100 Policy: CBN Disburses N23bn to Manufacturers",
    "summarized_story": "Emefiele spoke at the formal launch of the 100 for 100 PPP scheme.\nEmefiele said the funds disbursed to beneficiaries of the 100 for 100 policy, which he stressed were loans, followed due screening of the applications received.\nHe said for this first cycle of the 100 for 100 policy, which ended yesterday, 243 applications valued at N321.06 billion, spread over key sectors, including agriculture, energy, healthcare, manufacturing, and services sectors, were submitted on the portal.\n“The selection of subsequent beneficiaries will be rolled over every 100 days with new sets of 100 companies and details of these companies will be published in the major national dailies.\nHe said, “The 100 for 100 Policy for Production and Productivity (PPP) is one of such interventions designed to fast track productive activities in priority sectors."
  },
  {
    "headline": "Buhari: My Successor will Inherit Home-grown Economy, Stable Democracy, Revamped Security Forces",
    "summarized_story": "•Nigeria facing historic transition, says ObaigbenaDeji ElumoyePresident Muhammadu Buhari yesterday disclosed that by the time he leaves office on May 29, 2023, he would have bequeathed a home-grown economy, stable democracy as well as revamped security forces to Nigeria.\n”I take this initiative to mean that you all intend to collaborate with this administration in that direction.\nBuhari, therefore, lauded the group for rising above all ethnic and religious divides for the common good, describing the feat as ‘‘fantastic’’.\nWe are doubling our efforts against all forms of insecurity, equipping our armed forces and strengthening the police.\n“What the Committee has tried to do is to develop an elite consensus on security and economy, ” he said."
  },
  {
    "headline": "BREAKING: Fear Of Another Coup As Heavy Gunfire Is Reported Near Guinea-Bissau Government Palace",
    "summarized_story": "Heavy gunfire was heard on Tuesday in the capital of Guinea-Bissau near a government compound, where a cabinet meeting was being held, a Reuters reporter said.\nA security source with contacts inside the building said people had been hit by the gunfire.\nAlso, a coup d'état was launched in Burkina Faso on January 23, 2022.\nGunfire erupted in front of the presidential residence in the Burkinabé capital, Ouagadougou and several military barracks around the city.\nSoldiers were reported to have seized control of the military base in the capital."
  },
  {
    "headline": "BREAKING: Fear Of Another Coup As Heavy Gunfire Is Reported Near Guinea-Bissau Government Palace",
    "summarized_story": "Heavy gunfire was heard on Tuesday in the capital of Guinea-Bissau near a government compound, where a cabinet meeting was being held, a Reuters reporter said.\nA security source with contacts inside the building said people had been hit by the gunfire.\nAlso, a coup d'état was launched in Burkina Faso on January 23, 2022.\nGunfire erupted in front of the presidential residence in the Burkinabé capital, Ouagadougou and several military barracks around the city.\nSoldiers were reported to have seized control of the military base in the capital."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Fighters Return To Borno Highways, Search Vehicles To Fish Out Security Personnel",
    "summarized_story": "See Also Exclusive EXCLUSIVE: Photos Of Tax Receipts Issued By Boko Haram To Farmers, Herdsmen In Borno Controlled TerritoriesSources said failure of the residents to comply with the directive attracted the death penalty.\nSee Also Boko Haram EXCLUSIVE: Boko Haram Mounts Checkpoints On Borno Highways, Now Collects ‘Taxes’ From TravellersSeveral fishermen, farmers and merchants had returned to the Lake-Chad area to engage in socio-economic activities, under the arrangement of the new ISWAP-Boko Haram leadership.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nSee Also Breaking News BREAKING: Nigerian Army Arrests Boko Haram Fighters Collecting Taxes In Borno After SaharaReporters’ StoryThe Nigerian Army has repeatedly claimed that insurgency had been largely defeated and the military frequently underplays any losses.\nThe terror group has caused over 100,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Fighters Return To Borno Highways, Search Vehicles To Fish Out Security Personnel",
    "summarized_story": "See Also Exclusive EXCLUSIVE: Photos Of Tax Receipts Issued By Boko Haram To Farmers, Herdsmen In Borno Controlled TerritoriesSources said failure of the residents to comply with the directive attracted the death penalty.\nSee Also Boko Haram EXCLUSIVE: Boko Haram Mounts Checkpoints On Borno Highways, Now Collects ‘Taxes’ From TravellersSeveral fishermen, farmers and merchants had returned to the Lake-Chad area to engage in socio-economic activities, under the arrangement of the new ISWAP-Boko Haram leadership.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nSee Also Breaking News BREAKING: Nigerian Army Arrests Boko Haram Fighters Collecting Taxes In Borno After SaharaReporters’ StoryThe Nigerian Army has repeatedly claimed that insurgency had been largely defeated and the military frequently underplays any losses.\nThe terror group has caused over 100,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "Police Arrest 6 Islamic Clerics For Torturing Student To Death In Kano",
    "summarized_story": "The police in Kano State have uncovered how an Islamic student, Aminu Ado, was tortured to death in the northwestern Nigerian state.\nThe Kano State Government has accordingly asked the police to exhume the remains of the Islamic student, known as Almajiri in common parlance, for autopsy.\n“And that, one of the inmates named Aminu Ado, ‘m’, 22 years old, of Na’ibawa Quarters Kano was tortured to death on the 29/01/2022 by Abdulladif Musa, ‘m’, 18 years old, of Na’ibawa Wailari Quarters Kumbotso LGA, Kano State.\nThey were rushed to Murtala Mohammed Specialist Hospital, Kano for treatment and handed over to Kano State Government.\n“On preliminary investigation, the suspects confessed to have been operating the centre for over ten (10) years despite the initial ban by Kano State Government,” he said."
  },
  {
    "headline": "El-Rufai seeks creation of theatre command in north-west 'to counter insurgents'",
    "summarized_story": "Nasir el-Rufai, governor of Kaduna, has asked the federal government to consider establishing a theatre command for the north-west region.\nEl-Rufai spoke on Tuesday at the presentation of the state’s 2021 security report compiled by the ministry of internal security and home affairs.\nThe people we put in uniform must never be placed in avoidable danger, outgunned or outnumbered by non-state actors.\nAdvertisement“While the security agencies keep trying their best, the peacemakers on the ground should not be discouraged.\n“We continue to emphasise that as a state government, we do not believe that there is any phenomenon like ‘repentant bandits’."
  },
  {
    "headline": "El-Rufai seeks creation of theatre command in north-west 'to counter insurgents'",
    "summarized_story": "Nasir el-Rufai, governor of Kaduna, has asked the federal government to consider establishing a theatre command for the north-west region.\nEl-Rufai spoke on Tuesday at the presentation of the state’s 2021 security report compiled by the ministry of internal security and home affairs.\nThe people we put in uniform must never be placed in avoidable danger, outgunned or outnumbered by non-state actors.\nAdvertisement“While the security agencies keep trying their best, the peacemakers on the ground should not be discouraged.\n“We continue to emphasise that as a state government, we do not believe that there is any phenomenon like ‘repentant bandits’."
  },
  {
    "headline": "'Calm has been restored' -- Guinea-Bissau president speaks on attempted coup",
    "summarized_story": "President Umaro Sissoco Embaló of Guinea-Bissau says calm has returned to the country following an attack on the presidential palace.\nThe post was accompanied by a picture of the president speaking with a military officer and another man who wore a suit.\nAdvertisementECOWAS, in a statement on Tuesday, condemned the attempted coup and urged the soldiers to return to their barracks.\n“ECOWAS condemns this attempted coup d’état and considers the military to be responsible for the safety of President Umaro Sissoco Embalo and the members of his government.\nPaul-Henri Sandaogo Damiba, who led the coup, said the country will return to constitutional order when “conditions are right”."
  },
  {
    "headline": "'Calm has been restored' -- Guinea-Bissau president speaks on attempted coup",
    "summarized_story": "President Umaro Sissoco Embaló of Guinea-Bissau says calm has returned to the country following an attack on the presidential palace.\nThe post was accompanied by a picture of the president speaking with a military officer and another man who wore a suit.\nAdvertisementECOWAS, in a statement on Tuesday, condemned the attempted coup and urged the soldiers to return to their barracks.\n“ECOWAS condemns this attempted coup d’état and considers the military to be responsible for the safety of President Umaro Sissoco Embalo and the members of his government.\nPaul-Henri Sandaogo Damiba, who led the coup, said the country will return to constitutional order when “conditions are right”."
  },
  {
    "headline": "Omicron: Almost 90m COVID cases recorded in 10 weeks, says WHO",
    "summarized_story": "The World Health Organisation (WHO) says almost 90 million COVID cases have been reported worldwide since the Omicron variant was identified.\nSpeaking on Tuesday at a virtual media briefing, Tedros Ghebreyesus, WHO director-general, said the figure is greater than the number recorded in 2020.\n“Since Omicron was first identified just 10 weeks ago, almost 90 million cases have been reported to WHO — more than were reported in the whole of 2020,” he said.\nAccording to data by WHO, 4,275,794 cases of COVID were recorded as of the last week of 2020.\n“This virus will continue to evolve, which is why we call on countries to continue testing, surveillance and sequencing."
  },
  {
    "headline": "Nestcoin raises $6.5m pre-seed to deepen crypto and Web3 adoption in Africa",
    "summarized_story": "Last year alone, crypto startups raised over $27 billion in venture capital in 2021 —slightly higher than the past 10 years combined.\nAnd just last month, despite a dip in the price of cryptocurrencies, American VC, Andreessen Horowitz’s crypto arm launched a $2.2 billion fund, one of its biggest efforts to fund crypto startups.\nOn a mission to further deepen crypto adoption in Africa is Nigerian crypto startup Nestcoin which is building out Web3 products.\nLast year, it launched Breach, a media arm to simplify complex crypto topics to a global audience.\nOther institutional investors include MSA Capital, 4DX Ventures, Raba Capital, Goat.vc, Old Fashion Research, CMT Digital, Electric Capital, Social Capital, CoinFund, gumi Cryptos Capital, DeFi Alliance, among others."
  },
  {
    "headline": "Why did Binance block over 200 accounts in Nigeria?",
    "summarized_story": "The tweet picked up momentum due to how the supposed Binance representative handled the situation—with cluelessness and threats.\nSince there was no response yet from Binance throughout Wednesday, people began to conjure different reasons as to why accounts are getting blocked.\nAt 11 a.m. on Friday, the session, hosted by Dami Odufuwa, head of public relations at Binance Africa, alongside the Binance Africa community manager Nsikan Benjamin and the company’s Africa Director Emmanuel Babalola, started and lasted for about an hour.\nNot just countries, banks are also restricting access for crypto exchange as well.\nTransactions can also be tracked on the blockchain by collaborating and discussing with other centralised exchanges,” Binance Africa told TechCabal."
  },
  {
    "headline": "Tiger Global and Greycroft lead $15m Series A round in Nigeria’s Bamboo",
    "summarized_story": "We plan to add other products and tools that offer greater access and make global investing simpler from Africa,” Bassey said.\nFor instance, nearly 75% of Bamboo users have never traded stocks before.\nIn 2021, repeat depositors made up 85% of deposits on the platform, an indication that Bamboo users are rapidly gaining confidence in trading US stocks.\nBut with the US equities market experiencing its worst January in well over a decade—since 2009—how are Bamboo users reacting to the downturn?\n“Even though they are new to stock investing, Bamboo users tend to handle their emotions like more seasoned investors,” Bassey said."
  },
  {
    "headline": "What do blockchain, NFT, DAO and crypto mean?",
    "summarized_story": "What do blockchain, NFT, DAO and crypto mean?\nHow it works: Standard databases store data in rows, columns and files, but blockchain stores data in blocks that are chained together.\nHow it works: Cryptos are digital currencies created on blockchain technology.\nHow it works: To put it simply, NFTs are digital works that exist on blockchain.\nHow Web3 works: Web3 will be built on the blockchain working independently from different parts of the world."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "With products like Originate and Decide, Indicina is providing crucial data for ethical loan recovery",
    "summarized_story": "Indicina uses a data-driven approach to help lending institutions provide credit underwriting at scale.\nAccording to Johnson, “Indicina does not have a balance sheet or compete on lending.\nWe offer API-driven software to digitise the lending business.\nHow do you expand consumer credit to under-/unbanked populations in a prudent manner while shortening time-to-decision?\n“A thriving consumer credit industry is a powerful catalyst for economic inclusion on the continent."
  },
  {
    "headline": "Nestcoin raises $6.45m pre-seed three months after launch to drive crypto adoption in Africa",
    "summarized_story": "Share this article:Venture capital activity in the global Web3, crypto, and blockchain space last year was massive.\nAccording to a Galaxy Digital Report, VCs invested more in crypto startups in 2021 than in the last seven years combined.\nThe largest portion of the funding — 41.83% — went to crypto startups offering trading, investing, and exchange services.\nSource: Galaxy DigitalThis year could be a big year for Web3 startups, especially in Africa, with the announcement of Nestcoin’s $6.45 million pre-seed round.\nIn the time Nestcoin has been operational, it has been fulfilling its mission to improve lives with crypto and Web3."
  },
  {
    "headline": "Techpoint Pitchstorm alumnus, AltSchool Africa raises $1m pre-seed to plug Africa’s shortage of entry-level talent",
    "summarized_story": "Share this article:In the past few years, the focus on tech talent development in Africa has shifted from training entry-level talent to training senior talent.\nAlso, the inability of the local education system to provide competent engineering talent has led to a gap in the market for entry-level talent.\nA side effect of this is that less attention is paid to entry-level talent.\nSo, why is AltSchool working on training entry-level talent when more established players are focusing on senior engineers?\nAs more companies are founded in Africa, and the competition for talent increasingly gets global, more engineering talent will be needed."
  },
  {
    "headline": "Obaseki harps on bye-laws to improve traffic mgt, as EDSTMA trains over 1,200 drivers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state government will introduce bye-laws and other measures to check recklessness among drivers.\nThe governor disclosed this after inspecting facilities of the Edo State Traffic Control and Management Agency (EDSTMA), including the Drivers Training Academy and Manpower Development Centre.\nWe are working very hard with experts on what to do to ease traffic congestion in the state.\nThe leading causes of traffic congestion are unwholesome practices among drivers, particularly commercial drivers and people who refuse to obey traffic signs.\nThe Managing Director, EDSTMA, Mr. Dennis Oloriegbe, said that the agency has trained over 1,200 drivers, comprising drivers apprehended for serious traffic offences and others within the civil service at the academy."
  },
  {
    "headline": "Obaseki, FG in talks over kick-off of academic activities at Ekiadolor Federal College of Education – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… says govt won’t be blackmailed by ex-staff of defunct COEBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has assured the National Commission for Colleges of Education (NCCE) of the state government’s support for the kick-off of academic activities at the Federal College of Education in Ekiadolor.\nObaseki, who noted that workers of the defunct Edo State College of Education, Ekiadolor, are not owed salaries or any entitlements, said the government will not give in to blackmails by the dissident staff of the former state-owned college of education.\n“We are trying to retool the educational system of this country and Edo State.\n“They are claiming what they didn’t work for because we have set up our own state college of education.\nWe’ve gone round the site of the college and discovered a lot of good things and we must appreciate your efforts.”."
  },
  {
    "headline": "Edo advances on smart waste mgt technology to tackle trash problems in communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nigeria Erosion and Watershed Management Project (NEWMAP) in Edo State has intensified the deployment of its newly launched smart waste management technology to address the waste crisis across the 18 local government areas in the state.\nThe mobile application, according to the Coordinator of Edo NEWMAP, Dr. Tom Obaseki, is aimed at curbing indiscriminate waste disposal, especially plastic, aluminum, and other non-degradable materials.\nThe project is rallying and sensitizing stakeholders and Community Interest Groups (CIGs) on the usage of the smart plastic waste recycling scheme to tackle trash problems in the state.\nAccording to Obaseki, “The Edo NEWMAP has continued to explore more efficient effective means to solve the problem of flood and erosion across Edo communities.\n“On the back of this, we recently launched a plastic redemption application to assist in dealing with the threat posed by plastic waste clogging stormwater drains and natural moats across communities in Edo State."
  },
  {
    "headline": "Edo to set up investment desks in Lagos, Abuja, Nigerian embassies – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has unveiled plans to set up investment desks in Lagos and Abuja as well as Nigerian embassies overseas to attract investments to the state’s industrial, agriculture, retail, tourism and power sectors.\nAccording to him, “We have to set up investment desks in Lagos and Abuja.\nThis will increase visibility of the opportunities for investment in our state.\n“The state has a 40MW power facility for investors in the industrial park provided by Ossiomo Power.\n“We want to create the investment desk so that we can advertise the opportunities available in the state to investors and get them to come and invest in our state,” he added."
  },
  {
    "headline": "Julius O. Owotuga appointed to FBN Holdings board",
    "summarized_story": "Mr.Julius Omodayo-Owotuga, Deputy Chief Executive of Geregu Power Plc, has been appointed to the FBN Holdings Board.\nOmotayo-Owotuga, who was the Group Executive Director, Finance & Risk Management of Forte Oil Plc (now Ardova Plc), joined FBN Holdings Board as a Non-Executive Director following the approval of his appointment by the Central Bank of Nigeria, the notification said.\n“Julius B. Omodayo-Owotuga is currently the Deputy Chief Executive of Geregu Power Plc.\n“While at Forte, he was a member of the Executive Management Team that restructured a then moribund company into a vibrant industry player.\nPrior to joining Forte Oil Plc, he had responsibility for the Asset and Liabilities Management function at the Africa Finance Corporation."
  },
  {
    "headline": "UNICEF Calls For Immediate Release Of Kidnapped Children In North-East",
    "summarized_story": "The United Nations Children’s Fund (UNICEF) has called for the immediate release of all conflict-affected children held in captivity across the North-East region of Nigeria.\nIn a statement made available to journalists in Abuja, the United Nations agency also welcomed the release of four girls abducted by armed groups in Borno State.\nAbout 173 of the Chibok girls are still missing.\n“UNICEF is very relieved for the released girls and their families,’’ added Peter Hawkins, UNICEF representative in Nigeria.\nIn the North-East, more than 1,000 children have been abducted since 2014, with at least 100 still missing or unaccounted for."
  },
  {
    "headline": "Buhari Launches N62bn HIV Trust Fund",
    "summarized_story": "President Muhammadu Buhari on Tuesday in Abuja launched a N62billion Trust Fund to help Nigeria end AIDS as a public health threat and place more people living with HIV on treatment annually.\nWe have continued to make good our commitment of placing more people living with HIV on treatment annually using national resources.\nPresident Buhari noted that Nigeria’s purposeful partnership with the private sector in the response to COVID-19 pandemic had provided a readily available financing solution to leverage on to sustain the HIV response.\nHe also expressed delight with the attendance in person of notable global key players in HIV response and from the private sector at the event and the pledges made.\nHe said within the last 3 years, the agency has identified and placed on treatment an additional 900,000 persons living with HIV, bringing the total number of Nigerians on HIV treatment to 1.7 million."
  },
  {
    "headline": "APC Chair: Akume Has No Corruption Case To Answer – Contact C’ttee",
    "summarized_story": "“The fact of the matter remains that, Distinguished Senator George Akume has no running battle with any anti-corruption agency.\nADVERTISEMENT“Over the span of more than 23 years, Senator George Akume has never been invited for questioning by any corruption agency.\n“If elected the next National Chairman of APC, Senator George Akume commits to respecting the Nigerian and APC Constitutions as well as all party organs and officials.\nThe statement said: “There is the endorsement of Senator George Akume by the Northern APC National Front as signed by its Convener and spokesperson, Mallam Ayuba Hassan.\n“We wish to emphasise that when elected APC National Chairman, Senator George Akume will uphold the party’s constitution as well as respect its organs and officials.”"
  },
  {
    "headline": "APC Chair: Akume Has No Corruption Case To Answer – Contact C’ttee",
    "summarized_story": "“The fact of the matter remains that, Distinguished Senator George Akume has no running battle with any anti-corruption agency.\nADVERTISEMENT“Over the span of more than 23 years, Senator George Akume has never been invited for questioning by any corruption agency.\n“If elected the next National Chairman of APC, Senator George Akume commits to respecting the Nigerian and APC Constitutions as well as all party organs and officials.\nThe statement said: “There is the endorsement of Senator George Akume by the Northern APC National Front as signed by its Convener and spokesperson, Mallam Ayuba Hassan.\n“We wish to emphasise that when elected APC National Chairman, Senator George Akume will uphold the party’s constitution as well as respect its organs and officials.”"
  },
  {
    "headline": "Why I Divorced Atiku – Ex-Wife Jennifer",
    "summarized_story": "One of the wives of former Vice President Atiku Abubakar, Jennifer (Jamila) Douglas, has confirmed her divorce to the former vice president Atiku Abubakar even she explained reasons for the action.\nAtiku was the presidential candidate of the Peoples Democratic Party (PDP) in the 2019 general election.\nIn a statement obtained by LEADERSHIP on Tuesday, Jennifer explained that she didn’t ask for divorce because the ex-VP married a new wife.\nADVERTISEMENT“That His Excellency married a new wife was never the cause of our problem as many have said.\nShe also claimed that Atiku has requested to collect an asset previously given to her, adding that the property in Dubai is a subject of litigation."
  },
  {
    "headline": "Flight Delays: Air Peace Will Never Compromise On Safety",
    "summarized_story": "By KEN EMORDILeading airline operator, Air Peace has stated that the carrier will never compromise on safety in all its operations.\nThe assurance is coming following a publication in the social media whereby the airline was labelled Air Peace a “vicious operator”.\nIt is never done out of fear.”According to the airline “No airline under the sun benefits from flight delays or cancellations.\nFlight delays emanate principally from safety considerations more than anything else.”“We wish to reiterate our resolve to zero tolerance to unsafe operations.\nWe had flight delays in Sokoto, Akure, Ibadan and Kano occasioned by bad weather."
  },
  {
    "headline": "Flight Delays: Air Peace Will Never Compromise On Safety",
    "summarized_story": "By KEN EMORDILeading airline operator, Air Peace has stated that the carrier will never compromise on safety in all its operations.\nThe assurance is coming following a publication in the social media whereby the airline was labelled Air Peace a “vicious operator”.\nIt is never done out of fear.”According to the airline “No airline under the sun benefits from flight delays or cancellations.\nFlight delays emanate principally from safety considerations more than anything else.”“We wish to reiterate our resolve to zero tolerance to unsafe operations.\nWe had flight delays in Sokoto, Akure, Ibadan and Kano occasioned by bad weather."
  },
  {
    "headline": "Image strategist, Toni Kan joins Glo as PR head",
    "summarized_story": "By CHIKA CHIMEZIEAward-winning author, revered journalist and PR strategist Toni Kan has joined telecommunications giant Globacom as head of public relations.\nDelta State-born Mr. Kan assumed office on Tuesday, hinted an insider who spoke with us anonymously.\nKan, an English Literature graduate of Unijos, had previously worked at Visafone, Ntel and Zenith Bank among others.\nBorn in 1971, Kan, also earned a master’s degree in English literature at the University of Lagos in 1999.\nAmiable and cerebral Kan is the author of the collection of short stories, Nights of a Creaking Bed among other acclaimed books."
  },
  {
    "headline": "Image strategist, Toni Kan joins Glo as PR head",
    "summarized_story": "By CHIKA CHIMEZIEAward-winning author, revered journalist and PR strategist Toni Kan has joined telecommunications giant Globacom as head of public relations.\nDelta State-born Mr. Kan assumed office on Tuesday, hinted an insider who spoke with us anonymously.\nKan, an English Literature graduate of Unijos, had previously worked at Visafone, Ntel and Zenith Bank among others.\nBorn in 1971, Kan, also earned a master’s degree in English literature at the University of Lagos in 1999.\nAmiable and cerebral Kan is the author of the collection of short stories, Nights of a Creaking Bed among other acclaimed books."
  },
  {
    "headline": "Wike: I am the most qualified to be Nigeria's President",
    "summarized_story": "Rivers State Governor, Nyesom Wike, on Tuesday said he is the most qualified to become Nigeria’s President.\nWike said he has the requisite experience to govern the country, based on his records as Minister as well as the governor of the oil-rich state.\n“For somebody of my kind and record, a governor and a minister, I don’t even see anybody who will tell me that he is much more qualified than me, I don’t think that is possible,” Wike said.\n“Assuming today I want to run for the office of the President, what quality do you think I do not have?\nI don’t think so."
  },
  {
    "headline": "President Embalo: Drug barons likely sponsored Guinea Bissau's aborted coup",
    "summarized_story": "Guinea-Bissau’s President Umaro Sissoco Embalo survived an attempted coup on Tuesday and suggested that the plotters may have been linked to drug trafficking.\nThe situation was unclear for several hours, during which the African Union and West African bloc ECOWAS condemned what they called “an attempted coup”.\nU.S. and European authorities have long suspected that some in the country’s military are involved in the drug trade.\n“I can assure you that no camp joined this attempted coup.\nPolitical instability has blighted Guinea-Bissau for decades, with nine previous coups or attempted coups since independence in 1974."
  },
  {
    "headline": "Aregbesola’s Loyalists Injured LG Chairman, Two Officials In Ikirun",
    "summarized_story": "The Caretaker Chairman, Hon Hassan Okanlawon and two officials of Ifelodun Local Government Area, Ikirun, Osun State were severely injured on Tuesday by members of The Osun Progressives in Ikirun.\nIt was gathered that the caucus within APC led by its chairman, Hon Razak Salinsile, ex-Commissioner, Hon Adelani Baderinwa were to hold a meeting beside the secretariat by the roadside without permission from the Police.\n“The officials escaped from their grip and returned to the council notifying Okanlawon.\nThe caretaker chairman returned to the scene with police but he was also attacked.”Officials of the council alleged that the TOP members used men of Civil Defence to attack them.\nWhen Hon Okanlawon was contacted, he said, “I was nearly killed today by people led by Hon Salinsile."
  },
  {
    "headline": "BREAKING : Veteran Nollywood Actor Tafa Oloyede Is Dead",
    "summarized_story": "Nollywood Actor Tafa Oloyede is dead.\nThe Osun State born actor died on Tuesday, February 1st 2022 at his residence at Arowomole, Kajola area Osogbo.\nHe ventured into acting in 1974 and has featured in many movies such as ‘Jaiyesimi’, ‘Ayanmo’, ‘Ekuro Oloja’, ‘Orogun’, ‘Akanji Oniposi’ that made him popular."
  },
  {
    "headline": "BREAKING: Atiku Pays IBB A Visit In Minna",
    "summarized_story": "Former Vice President and Peoples Democratic Party, (PDP) stalwart, Alhaji Atiku Abubakar has visited former Military President, General Ibrahim Babangida in his Uphill resience, Minna, Niger State.\nThe meeting lasted for about one hour with no disclosure from both sides on the purpose of the visit.\nHowever, it was gathered that the visit may not be unconnected with the Presidential ambition of the former Vice President of which he is still making wide consultations.\nAtiku who is yet to make a formal declaration had taken the Presidential shot twice under the platform of the People Democratic Party.\n(PDP) but failed."
  },
  {
    "headline": "Thugs vandalise Atiku’s campaign office, set PDP Secretariat on fire",
    "summarized_story": "Suspected political thugs have vandalised the campaign office of former Vice-President Atiku Abubakar, situated near Investment Quarters, about eight kilometres away from the Gombe metropolis.\nAccording to Daily Trust, the office had it windows broken, while other items like Air Conditioners were carted away.\nThe thugs also burnt the Gombe State Secretariat of the opposition Peoples Democratic Party (PDP).\nIt was gathered that the suspects stormed the party secretariat, located along Bauchi road, around 1:30am.\nAddressing newsmen, PDP Chairman, General Audu Kwaskebe (Rtd), accused Youth Leader of the All Progressives Congress (APC) in the state, Kawu Lero, of spearheading the burning of the secretariat."
  },
  {
    "headline": "Senate moves to stop annual rents in FCT as bill scales second reading",
    "summarized_story": "A bill seeking to make the annual payment of rent illegal in the Federal Capital Territory has scaled second reading in the Senate.\nTagged: “A Bill for the Regulation of Advanced Rent on Residential Apartments, Office Space” was sponsored by Senator Smart Adeyemi (Kogi West).\n“If passed, this Bill will improve the well- being and standard of living of residents and minimize corruption and immorality emanating from the oppressive tenancy system in the Federal Capital Territory.\n“The bill also seeks to provide a window for legal action for any form of oppression.\nSenators, however, voted overwhelmingly in support of the bill when the Deputy Senate President put the question for it to be read a second time."
  },
  {
    "headline": "2021: Official raises alarm as terrorists kill 1,192, kidnap 3,348 in Kaduna",
    "summarized_story": "Kaduna state lost 1,192 residents to bandits’ attacks across the state in 2021, 3,348 citizens were kidnapped, while 891 sustained various forms of injury during the attacks, Kaduna state annual security report has said.\nKaduna Central senatorial zone recorded the highest number of death at 720, followed by 406 in Kaduna South and 66 in Kaduna North.\nKaduna Central zone also lead in the area of kidnapping with 2,771 abduction from the zone, while 397 citizens were kidnapped from the Southern senatorial zone and 180 from the Kaduna North zone.\nAbout 544 residents of Kaduna Central zone sustained injury within 2021, while Kaduna South zone recorded 253 and Kaduna North zone recorded 94.\nThe 7,935 cows stolen in 2020 almost doubled to 13,788 cows rustled in 2021."
  },
  {
    "headline": "2022: See full breakdown of JAMB registration, examination days, how to make payment, other requirements",
    "summarized_story": "Following announcement by the Joint Admission and Matriculation Board (JAMB) on new 2022 UTME registration and examination, below is the timeline details.\nJAMB 2022 TimelinesUTME (Registration) begins:12th February.\nUTME (Registration) closes: 19th March UTME MOCK: 2nd of April UTME (Examination) begins : 20th April UTME (Examination) ends : 30th April Cost of Registration: ₦4,700 (e.Pin: 3,500.\nJAMB is adopting cashless policy in the registration process for the 2022 UTME.\nDirect entry (Registration): To run concurrently with the UTME registration NIN is still Compulsory for registration except the board (JAMB) says otherwise."
  },
  {
    "headline": "FG Will Honour Agreements With ASUU, Buhari Tells CAN, Sultan",
    "summarized_story": "The Federal Government will honour promises made to the Academic Staff Union of Universities (ASUU) to prevent disruptive strikes, encourage uninterrupted academic programmes and improve funding of educational institutions.\nNevertheless, we remain committed to honoring our promises,” Buhari was quoted as saying in a statement issued by his spokesman, Femi Adesina.\n“Finally, and perhaps the most contentious of issues regarding the decision to use either the Integrated Payroll and Personal Information System (IPPIS) or the University Transparency Accountability Solutions (UTAS).\nThrough IPPIS, the Federal Government was able to save over N100 billion annually from the core civil service alone.\nIn view of the resistance from ASUU we devised UTAS which is now on the table.”"
  },
  {
    "headline": "Rivers Aircraft: Wike Defends Position, Denies Putting Rivers Into Debt, Other Allegations",
    "summarized_story": "﻿Rivers State Governor Nyesom Wike has insisted that the administration of his predecessor, Rotimi Amaechi, abandoned a jet belonging to the state in Germany.\nThe governor spoke about the state-owned aircraft and other issues at a stakeholders’ meeting in Port Harcourt, the Rivers State capital on Tuesday.\nAccording to reports, George accused Governor Wike of trying to malign and attack Amaechi with his comments about the aircraft.\nGovernor Wike also dismissed that, explaining that when former President Goodluck Jonathan handed over to President Muhammadu Buhari, it was clear.\nAccording to Governor Wike, it was in 2016 that his administration started getting intelligence that the legacy jet was in Germany."
  },
  {
    "headline": "Attempted Coup In Guinea-Bissau As Gunfire Heard Near Govt House",
    "summarized_story": "Sustained gunfire was heard on Tuesday near the seat of government in the coup-prone West African state of Guinea-Bissau, AFP reporters said, as a regional bloc condemned what it called an “attempted coup”.\nHeavily-armed men surrounded the Palace of Government, where President Umaro Sissoco Embalo and Prime Minister Nuno Gomes Nabiam were believed to have gone to attend a cabinet meeting.\nREAD ALSO: Wike Debunks Rumours Of Being Atiku’s Running MateIn 2014, the country vowed to return to constitutional government, but it has enjoyed little stability since then and the armed forces wield substantial clout.\nWe have no news.”Reacting to events, the Economic Community of West African States (ECOWAS) issued a statement saying it “condemns this attempted coup” and urged soldiers to “return to their barracks”.\nTroops had been offering bribes to other soldiers “in order to subvert the established constitutional order”, armed forces head General Biague Na Ntam said on October 14."
  },
  {
    "headline": "Gunmen Abduct 29 Villagers In Katsina – Police",
    "summarized_story": "A total of 29 people were abducted by bandits who invaded Ruwan-Godiya village, police authorities in Katsina State have said.\nThe Police Public Relations Officer in the state, Gambo Isah, confirmed the figure to Channels Television on Tuesday.\nRuwan-Godiya came under an attack on Sunday evening by a group of armed men in Faskari Local Government Area of Katsina.\nAccording to sources, the gunmen armed with sophisticated weapons stormed the village on over 60 motorcycles.\nThey were said to have shot sporadically into the air to cause panic, despite the presence of military personnel in the village."
  },
  {
    "headline": "Bill To Enforce Teaching Of History In Secondary, Tertiary Schools Introduced In Senate",
    "summarized_story": "A bill seeking to enforce the teaching of Nigeria’s history across secondary and tertiary schools has been introduced in the Senate.\nIt is titled ‘Compulsory Inclusion of Nigerian History in the Curriculum of Secondary and Tertiary Institutions in Nigeria Bill, 2022”.\nOthers introduced and read the first time include Federal University of Agriculture Sabongida Lantang, Plateau State (Establishment) Bill, 2022 by the Senate Leader, Senator Yahaya Abdullahi, and Federal University of Entrepreneur Onitsha (Establishment) Bill, 2022 by Senator Stella Oduah.\nREAD ALSO: Bill To Stop Yearly House Rent In Abuja Scales Second ReadingThe two other bills are National Metallurgical Development Centre Act (Repeal) Bill, 2022 by Senator Adetokunbo Abiru, and Companies and Allied Matters (CAC) Act 2020 (Amendment) Bill, 2022 by Senator Ibrahim Oloriegbe.\n8 2014 to improve quality health care delivery through the inclusion and participation of the private sector and for other matters connected therewith, 2022 by Senator Oloriegbe."
  },
  {
    "headline": "Lawson Alade wins APC ticket for Akure South/ North Federal Constituency by-election -",
    "summarized_story": "Mayorkun Lawson Alade has been declared winner of All progressives Congress primary election for Akure South/Akure North Federal constituency by-election.\nThe chairman of the 7 man primaries committee who is the outgoing deputy governor of Anambra State Nkem Okeke said the committee did a thorough job and was transparent in its dealings.\nAdvertisementThe winner of the primary Mayorkun Lawson Alade scored 305 votes to beat seven other aspirantsThe first runner up Omowunmi Olatunji-Owovoriole had 196 VotesAdvertisementThe Independent National Electoral Commission had fixed the bye election for February 26.\nThe seat became vacant following the death of Adedayo Omolafe of the Peoples Democratic Party"
  },
  {
    "headline": "I will declare my presidential ambition in due time",
    "summarized_story": "Former Vice President, Atiku Abubakar paid a courtesy call on governor Abubakar Sani Bello at the government house in Minna.\nSpeaking to journalists after a closed door meeting with the governor he said he will declare his presidential ambition in due time.\nAdvertisementHe also empathised with the governor over the issue recent banditry attack noting that the security situation in the state calls for urgent attention."
  },
  {
    "headline": "Photos: Ondo APC holds primary for Akure South/Akure North by-election -",
    "summarized_story": "The All Progressive Congress primary for the Akure South/Akure North federal Constituency by-election is about to commence.\nSee pictures below.\nAdvertisement"
  },
  {
    "headline": "Tambuwal accepts call to commence consultation on Presidency bid -",
    "summarized_story": "Sokoto state Governor, Aminu Tambuwal has accepted call from leaders and stakeholders of the People’s Democratic Party PDP to commence a nationwide consultation on his for his presidential bid.\nLeaders and supporters of the party in the state in a stakeholders meeting called on the governor to initiate the process of consultation for the presidential bid.\nAdvertisementWhile making his intention known, the Governor said he has never taken any major political steps without consulting with political leaders and stakeholders.\nThe former lawmaker said he has accepted the call to initiate the process of consultation to contest for the president of the country.\nAdvertisement"
  },
  {
    "headline": "Atiku’s Wife Speaks on Divorce – What’s Trending",
    "summarized_story": "Former Vice President, Atiku Abubakar’s Wife, comments on their divorce and shares hopes that they can part ways amicablyFormer Governor of Lagos State, Babalola Fashola, clarifies that his statement on the infrastructure in Nigeria, was not him saying that “Nigeria is ahead of the US”.\nA representative of Fashola emphasised that part of his statement was taken out of turn for the media.\nThe UK home Office finally responded to the protest against the International English Language Testing System for Nigerians.\nThey have confirmed that Nigerians will not be exempt from this test or any other English Language tests currently in place as a requirement for those considering study, migration or work abroad."
  },
  {
    "headline": "Rochas Okorocha: Nigeria Needs a Businessman as President",
    "summarized_story": "Former Governor of Imo State, Senator Rochas Okorocha, has never hidden his desire to rule Nigeria as president.\nHowever, he jettisoned his ambition and returned to the PDP where he tried to become the national chairman of the then ruling party.\nHe was later to dump the PDP for the second time to join the All Progressives Grand Alliance, APGA, on whose platform he became the Imo State governor in 2011.\nOkorocha, still a member of the APC against the backdrop of the 2023 elections, declares his interest to contest for the presidency.\nin an interview with ARISE Okorocha says, Nigeria needs a proven businessman with track records to back their achievements in order to alienate poverty and enhance the economy."
  },
  {
    "headline": "Senator Ita Enang: We Are Fixing the Menace of Illicit Refineries",
    "summarized_story": "Petroleum industry stakeholders have called on government to implement the recommendations in the report of the National Summit on Integration of Artisanal/Modular Refinery Operations into the in-country oil refining programme of the oil and gas sector.\nAt an emergency meeting convened by the Senior Special Assistant to the President on Niger Delta Affairs, Senator Ita Enang, participants advocated for a review of the Petroleum Refining Regulations of 1974, including other relevant laws that will regulate the establishment of artisanal refineries.\nThe meeting was called to address the issues of air pollution and ongoing ecocide in Rivers State and other Niger Delta states as a result of oil theft and illicit artisanal refining in the region.\nTo lend more insight into the outcome of his recent meeting with industry stakeholders on how to address this problem, is the Senior Special Assistant to the President on Niger Delta Affairs, Senator Ita Enang."
  },
  {
    "headline": "RISE.TV HEADLINES 01-02-22 – Arise News",
    "summarized_story": ""
  },
  {
    "headline": "Nigeria: Obaigbena Inaugurates THISDAY Editorial Board",
    "summarized_story": "The Chairman THISDAY/ARISE Media Group, Nduka Obaigbena, on Monday in Abuja inaugurated the reconstituted editorial board of THISDAY newspaper.\nIn attendance were THISDAY Managing Director, Mr Eniola Bello, editorial board chairman, Olusegun Adeniyi, and other members.\nWhile thanking the members for accepting to serve on the editorial board, Obaigbena reminded them that THISDAY is founded on three cardinal principles: Democracy, free enterprise, and social justice.\nOthers were Mr Paul Nwabuikwu, Mr Peter Ishaka, Mr Gimba Kakanda, Mr Bolaji Adebiyi, Mr Francis Ndubuisi, Mr Benneth Oghifo and Mr Sonny Aragba-Akpore.\nHe is an alumnus of the National Defence College, Abuja, and a proud winner of the presidential award for best graduating participant."
  }
]