[
  {
    "headline": "Opposition mounts as N’Assembly transmits PIB to Buhari next week",
    "summarized_story": "The National Assembly may transmit the Petroleum Industry Bill, passed by both chambers of the National Assembly, to the President, Major General Muhammadu Buhari (retd.\nThe coalition said the PIB, which offers the host communities three per cent equity participation, was unacceptable and described it as a mischievous piece of legislation.\nSimilarly, the Ijaw nation has rejected the three and five per cent allocated to the host communities in the PIB.\nOkaba described the proposed three and five per cent as a Greek gift, stressing that the slashing of host communities’ percentage was ridiculous.\n), to refrain from appending his signature to the PIB until the National Assembly prescribed 10 per cent."
  },
  {
    "headline": "Lagos Assembly passes bill to ban suspects’ parade before media",
    "summarized_story": "The Lagos State House of Assembly, on Monday, passed an amended version of the Criminal Justice Law of the state barring the police from parading crime suspects before the media.\nAccording to a statement by the Chief Press Secretary to the Speaker, Eromosele Ebhomele, the bill was passed at a sitting presided over by the Deputy Speaker, Wasiu Eshilokun-Sanni, on behalf of the Speaker, Mudashiru Obasa.\nAll rights reserved.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Ndume empowers traders, farmers in Southern Borno with N40 million, 10 trucks of fertilizers, 3 trucks maize seed varieties",
    "summarized_story": "By Ndahi Marama, MaiduguriSenator representing Southern Borno, Mohammed Ali Ndume yesterday donated Cheques amounting to N40 million in support of empowering thousands of traders, farmers and students.\nNdume who is the Chairman Senate Committee on Army also distributed 10 trucks of fertilizers and 3 trucks of improved maize seed varieties to farmers across the nine Local Government Areas to boost farming activities in his senatorial district.\nUmar Usman Kadafur commended the senator for his selfless and relentless efforts geared towards promoting women and youth attain economic self-reliance in society.\n“The empowerment programmes which is in six categories comprised of farmers, students, women, youth and other vulnerable groups in the constituency”.\nHe said, “today’s ceremony is the empowerment of 1000 Farmers with 5 trucks of fertilizers and 2 trucks of maize seeds improved varieties, while another group of young farmers would be presented and empowered with 3 trucks of fertilizers and one truck of maize seeds."
  },
  {
    "headline": "Group commends Uzodimma for restoring peace, security in Imo -",
    "summarized_story": "By Nnamdi OjiegoA socio-political group, Imolites Collective, IC, has commended Imo State governor, Hope Uzodimma, for demonstrating political courage and responsibility towards restoration of peace and security in the state.\n“We are happy to note that normalcy and social life is returning to our beloved state.\n“For this reason, we commend Governor Hope Uzodimma for his very proactive steps towards the return of peace and security in the state.\n“There is no doubt the informal economy of our state was under serious injury because of the violence and criminality of past two months.\n“As professionals, we encourage the governor to retain the focus on doing whatever augurs well for sustainable development.”Vanguard News Nigeria"
  },
  {
    "headline": "IPOB wash hands off news claiming wike, Uba are complicit in its leader’s abduction",
    "summarized_story": "“We therefore, wish to dissociate IPOB abd Powerful, with the fake statement being peddled by agents of confusion.\nOur Publicity Secretary never at any time linked Senator Ifeanyi Uba or Governor Nyeson Wike, with the wicked betrayal of our leader Mazi Nnamdi Kanu.\n“For the benefit doubt, IPOB has only linked the betrayal and abduction of our leader Mazi Nnamdi Kanu to President Uhuru Kenyatta of Kenya, Nigeria’s Ambassador to Kenya, Kenyan’s Ambassador to Wilfred Machage and the Nigerian Government.\nHowever, for now, we restate that Senator Ifeanyi Uba has not been found to have any hand in it.\nHis political opponents should try other ways of settling scores with him and leave IPOB and our leader Mazi Nnamdi Kanu out of it."
  },
  {
    "headline": "Reps query Ecological Fund Office over lack of project documents",
    "summarized_story": "Order contractors to appear ThursdayBy Tordue SalemThe Ecological Fund Committee of the House of Representatives has queried Ecological Fund Office over the lack of documents of the erosion and flood control project at Kuchiako 1 District, New Hope Avenue, Kuje, Abuja.\nThe Committee directed the Ecological Fund Office (EFO) to produce the contractor handling the project and also demanded that all the details concerning the project must be made available before Thursday.\nThis followed the committee’s oversight function to projects carried out by the EFO in Abuja on Monday.\nHe said they were not on a jamboree and directed that the commissioning of the project must be put on hold.\n“Of course, the ecological office itself under the Office of the Secretary to the Government of the Federation, we have gone to several project sites and we are short of saying that the indicators are there that there is a paradigm shift totally away from what the ecological fund was known for,” he said."
  },
  {
    "headline": "Momah urges youths to indicate interest in leadership",
    "summarized_story": "Ifeanyi Chudy Momah has called upon Nigerian Youths to develop more interest in Leadership and should get more involved in deciding who leads them.\nMomah made this call at the Ground Breaking of the Nonso Nwaebili Foundation Headquarters and Grand Finale of the Nonso Nwaebili Foundation (NNF) Super Cup Tournament at Iyiowa Odekpe, Ogbaru LGA of Anambra State.\nHe regretted that the youths fail to support their fellow youths who aspire for elected office, rather most opt to be pawns in the hands of the older political class.\nNonso Nwaebili, and congratulated him for the humanity in him which birthed the laudable tournament.\nNonso Nwaebili returned all thanks to God Almighty for a successful tournament, in spite of the challenges experienced on his way."
  },
  {
    "headline": "Sunday Igboho: DSS carried out nocturnal coup – Falana",
    "summarized_story": "Human rights lawyer, Femi Falana, has described the invasion carried out on the Ibadan residence of Yoruba activist, Sunday Adeyemo, aka Sunday Igboho, last Thursday by operatives of the Department of State Services, DSS, as a “nocturnal coup”.\nDAILY POST recalls that the DSS last Thursday invaded Igboho’s residence, gunning down two of his allies.\nHe said, “You can’t have a situation where nocturnal arrests are made in a state as if you are planning a coup.\nPeople were arrested and abducted at 2am, the governor of the state wasn’t aware.\nThe governor of the state wasn’t aware?"
  },
  {
    "headline": "Abduction: Live up to your responsibility",
    "summarized_story": "Atiku Abubakar, former Vice President, has said it is high time the President Buhari-led government began to live up to its responsibilities.\nThe former Vice President said this while condemning the abduction of an unspecified number of students from Bethel Baptist High School, Damishi, Chikun local government area of the state, describing it as one too many.\nHe stated that it is time to stop pretending that all is well with Nigeria and time for the government to perform its primary responsibility which is protecting lives.\nProtection of lives and property is the primary responsibility of the government.\nAtiku , however, commended the security agencies for securing the release of some kidnapped students."
  },
  {
    "headline": "ESN members move to plant bomb in military checkpoints",
    "summarized_story": "The Imo State Police Command says it has arrested four members of the Eastern Security Network, ESN, a security wing of the proscribed Indigenous People of Biafra, IPOB for allegedly planning to plant explosives in a military checkpoint along Owerri/Orlu road in Imo State.\nThe State Commissioner of Police, Abutu Yaro who confirmed the arrest to newsmen in Owerri while parading the suspects, said the ESN members were nabbed while engaging the security operatives in a gun duel.\nAccording to him, “On 4th July 2021, some members of the prescribed ESN/IPOB Organisation, were arrested by security agencies in the state.\nThey were arrested in a futile bid to lunch improvised explosives on the Military checkpoint along Owerri Orlu Road.\nHe urged the residents to support the security operatives with relevant information on the activities of the criminal elements causing unrest in the entire state."
  },
  {
    "headline": "Open grazing ban: HURIWA hails Southern Governors over latest decision, deadline",
    "summarized_story": "Human Rights Writers Association of Nigeria, HURIWA, has told Southern Governors Forum to stand their ground and resist any attempt by President Muhammadu Buhari to take away lands belonging to Nigerians for private cow businesses.\nThe Human rights group said the essence of having a unified approach by the Governors is to ensure that the country does not slide into one man’s dictatorship.\nHURIWA’s position was contained in a statement signed by its National Coordinator, Comrade Emmanuel Onwubiko, and the National Media Affairs Director, Miss Zainab Yusuf.\nThe group hailed the Governors over their decision to give an implementable deadline for the enforcement of the ban on open grazing of cows.\nAs DAILY POST reported earlier, Southern Governors had met in Lagos on Monday and set September 21, 2021, as the deadline for the promulgation of anti-open grazing law among its member states."
  },
  {
    "headline": "NASS set to pass Electoral Act next week",
    "summarized_story": "Barring any unforeseen circumstances, the National Assembly will pass the 2010 Electoral Act (Amendment) Bill, 2021 already slated for final consideration next week.\nThe media was at the weekend awash with news that electronic transfer of results from the 8, 809 wards direct to the portal of the Independent National Electoral Commission, INEC, has been removed from provisions of the bill.\n“Let me seize this opportunity to react to insinuations being made against leadership of the National Assembly as regards the 2010 Electoral Act (Amendment) Bill 2021, which will soon be considered and passed at both chambers.\n“I want to state categorically here that presiding officers are not the ones to determine what is carried or what is not.\nAdemola Ayo Yusuf assured the leadership of the National Assembly that the commission under his leadership will be fair in ensuring critical and thorough investigation of complaints."
  },
  {
    "headline": "Sungbo Eredo heritage: Nigeria’s potential tourists’ hub",
    "summarized_story": "The project is being carried out in conjunction with educational institutions such as Obafemi Awolowo University (OAU), University of Ibadan (UI) and Augustine University, Ilara (AUI).\nThe Sungbo Eredo is a system of defensive walls and ditches built in 800 A.D. in honour of the Ijebu noblewoman, Oloye Bilikisu Sungbo.\nThe location is on Nigeria’s tentative list of potential UNESCO World Heritage Sites.\nI came to see the archaeological project tagged Sugbon Eredo Heritage being supported by both the French and United States governments.\nThrowing more light on the project, Oba Ogunsanwo said: “The Sungbo Eredo is a monument that has been in existence since the 13th Century."
  },
  {
    "headline": "Will Press Council Bill enhance or kill the media?",
    "summarized_story": "The Nigeria Press Council amendment bill was supposed to strengthen the council to reposition the Nigerian Media.\nThe Nigeria Press Council was established as a regulatory agency for the profession.\nAn attempt to amend the Press Council bill is now generating controversy.\nBut this is the position of the National Assembly.”The Executive Secretary of the Nigeria Press Council, Francis Nwosu, said the desirability of a Press Council should not be in dispute.\nIf they do, it is an instrument that the Press Council can use to regulate the print media in Nigeria."
  },
  {
    "headline": "On the gale of defection by governors",
    "summarized_story": "This same scenario goes for governors Ben Ayade and Dave Umahi of Cross-River and Ebonyi states respectively.\nGovernor Umahi even claims that other governors are on their way to joining the ruling party.\nThe ruling party is having the time of its life, it would seem.\nI remember reading somewhere and agreeing that many politicians in Nigeria do not see beyond the upcoming election cycle.\nPolitical commentators have noted several times that the top two parties, APC and PDP are birds of the same feather and I couldn’t agree less."
  },
  {
    "headline": "Ndi Igbo stand for one Nigeria",
    "summarized_story": "This is why the silent Igbo majority who are opposed to the secession of the southeast from Nigeria need to speak up.\nNdi Igbo must not let the vocal minority drown them out.\nWhile the claims of marginalisation by Ndi Igbo cannot be brushed off, Nigeria has not been all grim for the Igbo.\nIndeed, Nigeria has not been all ash and sackcloth for Ndi Igbo.\nThe silent Igbo majority need to speak up."
  },
  {
    "headline": "BREAKING: Next president must come from the South-Southern Govs",
    "summarized_story": "Southern Governors Forum has said that the 2023 presidency should be zoned to the Southern part of Nigeria.\nthe Forum rejects the proposed 3% and support the 5% share of the oil revenue to the host community as recommended by the House of Representatives;iii.\nthe forum also rejects the proposed 30% share of profit for the exploration of oil and gas in the basins;iv.\nHowever, the forum rejects the ownership structure of the proposed Nigeria National Petroleum Company Limited(NNPC).\nArakunrin OluwarotimiOdunayoAkeredolu SANGovernor, Ondo State and Chairman, Southern Governors’ ForumBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Arrest: Nnamdi Kanu’s community plans to send delegates to FG",
    "summarized_story": "“There is no way the community will feel well or okay over the arrest of Nnamdi Kanu; in any case, he is our son.\nTake for instance, from Nnamdi kanu’s house to the official residence of the Assistant Inspector General of Police (AIG) Zone 9, is about three poles.\n“The house of police commissioner of Abia Command is about three poles as well from Nnamdi Kanu’s house.\nI believe the community will go for peaceful means because they have been a peaceful people all these while and they will not change now”.\nThe most important thing is that you will go to court when you have exhausted all other peaceful means, you can then resort to court."
  },
  {
    "headline": "(UPDATED): Passed PIB satanic, unjust, embarrassing – Clark",
    "summarized_story": "• demands reversal or block IOCs from regionFrom Juliana Taiwo-Obalonye, AbujaThe leader of the Pan-Niger Delta Forum (PANDEF), Chief Edwin Clark, has described the newly passed Petroleum Industry Bill (PIB), ready for harmonization as satanic, unjust, embarrassing, and has dashed the hope of the people of the Niger Delta.\n“We want to warn seriously, that the people of the Niger Delta have had enough of this colonial and oppressive mentality of our Northern brothers and friends.\nHONOURABLE BARR FEMI GBAJABIAMILA, SPEAKER, HOUSE OF REPRESENTATIVES, ON THE DEMAND BY THE PEOPLE OF THE NIGER DELTA FOR 10% FOR THE HOST COMMUNITIES IN THE PETROLEUM INDUSTRY BILL (PIB).\nAt the Public Hearings in January 2021, representatives from the Niger Delta continued to insist on the principle of the 10% equity participation.\nA copy of this letter will be sent to all the 6 Governors of the South South zone and the delegates and other leaders of the South-South.”Funding of the Frontier Exploration FundMeanwhile, an additional 30% has been awarded to the Funding of the Exploration of Frontier Basins (Frontier Exploration Fund)."
  },
  {
    "headline": "BREAKING: Assembly Suspends Kano Anti Corruption boss for one month",
    "summarized_story": "The embattled Chairman of the Kano State Pubic Complaint and Anti- Corruption Commission, Muhuyi Magaji Rimin -Gado has been suspended by the Kano State House of Assembly.\nIt was gathered that the anti corruption boss was suspended on Monday for allegedly rejecting an accountant sent to him by the state’s Accountant General.\nDaily Sun investigation indicated that prior to this moment, the suspended anti corruption boss has been having issues with a powerful block in the state following his daring attempt to investigate some contracts awarded by the Kano State Ministry of Works.\nMeanwhile a section of the state, particularly elite who confided in Daily Sun, expressed delight at the turn of event.\nThey contended that the embattled anti corruption boss was fingered in the dislogdememt of other office holders in the state, saying it would nice if he had a taste of what others had gone through."
  },
  {
    "headline": "BREAKING! Gunmen abduct students in Kaduna",
    "summarized_story": "By Christopher OjiGunmen have abducted unspecified number of students in a Kaduna secondary school.\nIt was gathered that the bandits raided the school today and picked scores of students.\nOur source said four lucky students escaped from their abductors and raised the alarm.\nIt was gathered that security agencies and the State Government are making frantic efforts to trail the bandits and rescue the students.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Southern Govs Say Next President Must Come from South, Reject 3% Allocated to Host Communities in PIB",
    "summarized_story": "By Vanessa ObiohaFor the first time, Southern Nigerian governors have demanded that the next president should come from the South.\nArising from the meeting of their Forum in Lagos, the governors reiterated their commitment to the unity of Nigeria on the pillars of equity, fairness, justice, progress, and peaceful coexistence between and amongst its people.\nThe Forum also rejects the proposed 30% share of profit for the exploration of oil and gas in the basins,” as well as the ownership structure of the proposed Nigeria National Petroleum Company Limited (NNPC).\nOf the 17 southern governors, only Cross River and Anambra State governors were absent.\nThe governors also agreed that Lagos State will be its permanent secretariat."
  },
  {
    "headline": "Breaking: Southern Govs Say South Must Produce Next President",
    "summarized_story": "Southern Governors rose from their meeting held at the Lagos House, Ikeja Monday and resolved that the next president of Nigeria must come from the southern part of the country.\nThey also insisted that all southern states must promulgate anti-open grazing law by September 1, 2021.\nThey rejected the 3 percent proposed by the Petroleum Industry Bill and approved by the National Assembly for host communities, and asked that it should be increased to at least 5 percent.\nWhile reiterating their call for the creation of states, the governors said that when security agents come for any high profile operation in any state, the chief security officer must be informed.\nMore details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Bandits Invade Another Kaduna School, Abduct Students",
    "summarized_story": "By John ShiklamSeveral students of Bathel Baptist High School, Damishi, Kaduna, were abducted in the early hours of Monday by bandits who attacked the school.\nThe bandits were said to have stormed the school in larger number, armed with sophisticated weapons.\nMany of the students are believed to have been abducted, though the number is yet to be determined.\n“I was informed that bandits invaded the school around 2am.\nMohammad Jalige, spokesman of the Kaduna state police command, did not respond to telephone calls when contacted."
  },
  {
    "headline": "Concern Mounts over Lawmakers’ Plan to Rig 2023 Election Ahead of Time",
    "summarized_story": "The CSOs in a statement yesterday said the manipulation of Section 50(2) undermined the Independent Electoral Commission (INEC)’s efforts to improve the election results management regime.\nThe statement said: “Everyone may be aware that the National Assembly will pass the Electoral Amendment Bill (2021) this week.\nelectronic voting, financial independence of the Independent National Electoral Commission (INEC), and new timelines for submission of list of candidates.\nAlso, the new draft bill provides that the deployment of security officials for election duties must be at the instance of INEC.\nThe bill also stipulates that the commission shall only request for the deployment of the Nigerian Armed Forces for securing the distribution and delivery of election materials and protection of election officials."
  },
  {
    "headline": "PIB: Abia, Delta, Edo, Ondo Groups Demand Review of 3% Fund",
    "summarized_story": "But shortly before passage, senators reduced the trust fund for host communities to three per cent.\nOgbonna, an Itsekiri stakeholder, told THISDAY that the three per cent was not the solution to the underdevelopment in the host communities.\nHe urged that the three per cent be reviewed upwards for the sake of peace and justice for the host communities.\nThe only solution is that the National Assembly should adjust it and make it meaningful.\n“It is a bad omen for the oil communities that have been clamouring for a sense of belonging."
  },
  {
    "headline": "BREAKING: Bandits Attack Secondary School In Kaduna, Abduct Many Students",
    "summarized_story": "Gunmen suspected to be bandits have abducted many students of Bethel Baptist School located in Maraban Rido, Chikun Local Government Area of Kaduna state.\nThe development comes just hours after bandits abducted babies, female nurses and security guards from the residential quarters of the National Tuberculosis and Leprosy Centre (NTLC) in Zaria, Kaduna State on Sunday.\nSaharaReporters gathered that the bandits invaded the school at about 2am on Monday shooting sporadically into the air before kidnapping the students.\nOn March 12, bandits also abducted 39 students of the Federal College of Forestry Mechanization, Afaka in Igabi Local Government Area of Kaduna State.\nIn February 2021, gunmen struck the Government Secondary School in Kagara, Niger State, abducting school pupils, teachers and workers."
  },
  {
    "headline": "BREAKING: Bandits Attack Secondary School In Kaduna, Abduct Many Students",
    "summarized_story": "Gunmen suspected to be bandits have abducted many students of Bethel Baptist School located in Maraban Rido, Chikun Local Government Area of Kaduna state.\nThe development comes just hours after bandits abducted babies, female nurses and security guards from the residential quarters of the National Tuberculosis and Leprosy Centre (NTLC) in Zaria, Kaduna State on Sunday.\nSaharaReporters gathered that the bandits invaded the school at about 2am on Monday shooting sporadically into the air before kidnapping the students.\nOn March 12, bandits also abducted 39 students of the Federal College of Forestry Mechanization, Afaka in Igabi Local Government Area of Kaduna State.\nIn February 2021, gunmen struck the Government Secondary School in Kagara, Niger State, abducting school pupils, teachers and workers."
  },
  {
    "headline": "Alleged Defamatory Publication: US Court Sanctions Mountain Of Fire Founder, Daniel Olukoya For Misleading Court, Orders Him To Pay $7,320 To Sowore",
    "summarized_story": "SaharaReporters had earlier reported how the UK Charity Commission appointed an interim manager for the MFM in August 2019.\nThe UK charity regulator claimed it had serious concerns over MFM Chair of Trustees, Dr Daniel Olukoya, and his handling of serious incidents.\nAdmit that no member of the Mountain of Fire and Miracles church resigned from the Mountain of Fire and Miracles church due to the publication of the Challenged Statements.\nAdmit that Mountain of Fire and Miracles Ministries maintains a website that provides information about its ministry to the public.\nAdmit that Mountain of Fire and Miracles Ministries maintains a YouTube page that airs Plaintiff Daniel Olukoya’s sermons."
  },
  {
    "headline": "Alleged Defamatory Publication: US Court Sanctions Mountain Of Fire Founder, Daniel Olukoya For Misleading Court, Orders Him To Pay $7,320 To Sowore",
    "summarized_story": "SaharaReporters had earlier reported how the UK Charity Commission appointed an interim manager for the MFM in August 2019.\nThe UK charity regulator claimed it had serious concerns over MFM Chair of Trustees, Dr Daniel Olukoya, and his handling of serious incidents.\nAdmit that no member of the Mountain of Fire and Miracles church resigned from the Mountain of Fire and Miracles church due to the publication of the Challenged Statements.\nAdmit that Mountain of Fire and Miracles Ministries maintains a website that provides information about its ministry to the public.\nAdmit that Mountain of Fire and Miracles Ministries maintains a YouTube page that airs Plaintiff Daniel Olukoya’s sermons."
  },
  {
    "headline": "IPOB Reacts To Reports Linking Governor Wike, Senator Uba With Arrest Of Nnamdi Kanu",
    "summarized_story": "The media and publicity secretary of the Indigenous People of Biafra (IPOB) says he or the group has not accused Senator Ifeanyi Uba and Rivers State Governor Nyesom Wike of being involved in the arrest of their leader, Nnamdi Kanu.\nNyesom Wike of colluding with the enemies and facilitating the betrayal and abduction of our leader, Mazi Nnamdi Kanu in Kenya.\nOur Publicity Secretary never at any time linked Senator Ifeanyi Uba or Governor Wike with the wicked betrayal of our leader Mazi Nnamdi Kanu.\n“But for now, we restate that Senator Ifeanyi Uba has not been found to have any hand in it.\nHis political opponents should try other ways of settling scores with him and leave IPOB and our leader, Mazi Nnamdi Kanu out of it."
  },
  {
    "headline": "UNILORIN launches app to curb crop wastage, boost food security",
    "summarized_story": "The University of Ilorin (UNILORIN) has launched an app known as KasuwaGo to curb crop wastage and boost food security in the country.\nAdvertisementAccording to NAN, Sulyman Abdulkareem, the institution’s vice-chancellor, unveiled the app at a briefing on Monday.\nAdvertisementHe said the invention of such application was a great innovation that would help rural farmers to earn more from their farm produce and avoid food wastage in the society.\nThe app was said to have been developed specifically to facilitate the buying and selling of farm produce.\nBut speaking at the event, the VC said the app would also curb wastage of farm produce and boost food security."
  },
  {
    "headline": "JAMB: Why candidates didn’t do well in 2021 UTME",
    "summarized_story": "Ishaq Oloyede, registrar of the Joint Admissions and Matriculation Board (JAMB), says the coronavirus pandemic is responsible for the mass failure recorded during this year’s Unified Tertiary Matriculation Examination (UTME).\nThe JAMB registrar revealed that this year’s results were poorer when compared to what was obtainable in the last three years.\nAlso, in 2020, 69.82 per cent of the total candidates who sat the UTME scored 160 and above but in 2021, it reduced to 65.62 per cent,” he said.\nThey knew the point at which we were in the academic calendar before the examination was taken in 2020 and in 2021.\nBut this year, they suffered incomplete academic sessions; they had to cope with emergency online lessons and even many other disturbances like insecurity.”Copyright 2021 TheCable."
  },
  {
    "headline": "FCT school: We didn’t deny mother of pupil who died from ‘condom infection’ custody",
    "summarized_story": "The management of Premiere Academy, Lugbe in Abuja, says the mother of the 14-year-old student who died after she was allegedly abused sexually was “not denied custody of the sick daughter at any point”.\nVihimga Akpagher, the deceased’s mother, had alleged that she died from an infection after a condom was found in her private parts.\nIn its reaction on Saturday, Premiere Academy alleged that it did not refuse Vihimga custody of her child but had to follow due process.\n“The school did not refuse to grant the mother of the deceased custody of the sick daughter at any point,” the statement read.\nAfter they got to the school, an exeat was processed and she was released to her mother."
  },
  {
    "headline": "Fee hike row: Kaduna college suspends academic activities indefinitely after student’s death",
    "summarized_story": "The Kaduna State College of Education, Gidan Waya, has announced the indefinite suspension of academic activities amid students’ unrest over the hike in tuition fees.\nIt added that despite the suspension of academic activities, staff are expected to report for normal work as required.\n“To this effect, all academic activities in the college are suspended.\nAdvertisementIn April, the state government had increased tuition fees in all its tertiary institutions.\nThe management of the Kaduna State University (KASU) had last month also suspended academic activities for its undergraduate students indefinitely after a protest over the state government’s decision to increase the tuition fees."
  },
  {
    "headline": "'Oko Iyabo is meant to correct child assault'",
    "summarized_story": "Yomi Fabiyi, Nigerian actor, has reacted to the backlash that has trailed ‘Oko Iyabo‘, his latest movie on Baba Ijesha, his embattled colleague.\nAdvertisementBaba Ijesha is being tried on a six-count charge which includes sexual assault by penetration, indecent treatment of a child, and sexual assault.\nAdvertisementShortly after ‘Oko Iyabo’ was released, it started to garner negative feedback from many users on social media who questioned the motives behind such a project.\nThe actor also explained that the essence of the movie is to “correct the child abuse and assault” and not the other way round.\n“The movie is however to correct child abuse, assault, human rights abuse and other vices and to state clearly that I am not what they claim I am initially."
  },
  {
    "headline": "Tolu Michaels on how digital entrepreneurs create and sell intangible products online",
    "summarized_story": "Your business can either deal with offering physical products for sale online or providing a service online.\nI didn’t have the capital to sell physical products so I needed something I could provide people in whatever location I am,” she tells me on our Google Meet call.\nLeveraging knowledge commerceDigital products are basically online products that can’t be held, touched, or tasted.\nThis will allow the right people and the right opportunities to be attracted to you.”In the initial stage of her digital career, Michaels picked up new skills including a degree on Disruptive Strategy from Harvard Business school.\nOne would think LinkedIn could have been at the forefront of this process but, she says, in selling digital products, entrepreneurs should have their profiles on all social media platforms and utilise each platform fully."
  },
  {
    "headline": "Product partnership managers are obsessed with a product’s life cycle",
    "summarized_story": "While product managers are responsible for hand holding a product from conception to maturity, product and partnership managers go a step further by exposing the product to valuable collaborations.\nIn your years of experience working as a product partnership manager, have you ever experienced the death of a product?\nProdpad is a great resource for aspiring product partnership managers — they have a great blog and also offer online courses.\nProduct partnership managers have to be extremely patient people.\nWhat are some of the challenges product partnership managers face on the job?"
  },
  {
    "headline": "The Next Wave: Elsa Majimbo, cut soap for us",
    "summarized_story": "This edition of Next Wave will explore the current state of Africa’s creator economy and speak into the future of video-creating and sharing platforms on the continent.\nPARTNER MESSAGEThe Flutterwave Mobile app, the app that turns any smartphone into a mobile POS is now redefining commerce.\nLike most startups with an eye for the creator economy, Minly launched late last year during the thick of the COVID pandemic.\nFollow TechCabal on Twitter, Instagram, Facebook, and LinkedIn to stay engaged in our real-time conversations on tech and innovation in Africa.\n– Koromone Koroye, Managing Editor, TechCabal Share this newsletter Share Share Sign up for The Next Waveby TechCabal Sign me up"
  },
  {
    "headline": "TeamApt closes undisclosed Series B round to extend its banking services across Africa",
    "summarized_story": "Nigeria-based TeamApt, which offers agent banking services with plans to roll out consumer-focused digital banking features, has raised an undisclosed sum in a Series B round.\nTeamApt’s pivotal business at the moment is Moniepoint, a software solution that powers agent banking in Nigeria.\nBut the agent banking space is thought to include Firstmonie, Paga and OPay, the Opera-backed fintech.\nIn March 2021, TeamApt said it processed over ₦1trillion ($2.4 bn) for the first time.\nWhile Moniepoint will continue to power agent banking, TeamApt plans to build a consumer app side of it for individuals as a digital bank."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Facebook partners with Pan-African tech group to build metro fibre network in Democratic Republic of Congo",
    "summarized_story": "Pan-African technology group, Liquid Intelligent Technologies, is partnering with Facebook to build a long haul and metro fibre network in the Democratic Republic of Congo (DRC).\nAnnounced Monday, July 5 2021, the build will be funded by Facebook but owned and operated by Liquid Intelligent Technologies.\nThe network fibre is expected to improve Internet quality for 30 million people and provide regional connectivity for Central Africa.\nHowever, this isn’t Facebook’s first project aimed at bringing faster Internet connectivity to Africa.\nWhile Facebook’s partnership with Liquid Intelligence Technologies could help DRC’s Internet connectivity and affordability, its impact might not be as significant as expected."
  },
  {
    "headline": "Egyptian eCommerce startup, MaxAB, raises $40m Series A to accelerate expansion",
    "summarized_story": "After its seed round in September 2019, Egyptian MaxAB has raised $40 million in Series A round to accelerate expansion.\nThe B2B eCommerce platform serves traditional retailers, providing simple processes, transparent pricing, on-demand delivery, and a variety of value-added services.\nMaxAB’s supply chain solutions and business intelligence tools help suppliers accurately forecast, monitor, and control the impact of their strategies in real-time.\nMaxAB also plans on adding supply chain and embedded finance solutions to newly launched business verticals.\nAnd with the fund, MaxAB can provide additional scale to retailers while also providing additional economies of scale to customers."
  },
  {
    "headline": "6 ways to convert your Instagram followers into paying customers",
    "summarized_story": "Register to attend SME Clinic 2021 here.\nIf only a handful of your Instagram followers have ever patronised your business, or you do not even know how to start advertising on the platform, here are a few ways to convert your followers into paying, repeat customers.\nThis helps to get and publicly share feedback on your product/service.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business online.\nGet your ticket for SME Clinic 2021 at discounted rates now."
  },
  {
    "headline": "Market dynamics change demand for luxury residential real estate",
    "summarized_story": "For developers of luxury residential real estate, good times are underway as market dynamics have changed demand in that sub-market with growing investment interest coming from ultra-high net worth individuals (UHNWIs).\nResidential real estate investment is establishing itself as a global real estate asset class, according to this year’s Attitudes Survey conducted by Knight Frank.\nRead Also: Residential real estate offers investment opportunities amid weak Q2’21 outlookThis is coming as an aftermath of the COVID-19 pandemic, which has had significant lifestyle changes in work, home and play.\n“The high-end luxury property market in Nigeria has, however, experienced a glut, with vacancy rate averaging 40 percent at highbrow locations in Lagos and Abuja.\nThese became major occupiers of luxury market in the country, but economic sentiment and unfavourable policies have largely affected that market in recent times."
  },
  {
    "headline": "Southern governors reject 3% revenue for oil communities in PIB, insist on presidency in 2023",
    "summarized_story": "The Southern governors have rejected the three percent revenue recommended in the Petroleum Industry Bill (PIB) just passed by the National Assembly.\nThis was contained in a communiqué issued today at the end of the Governor’s meeting in Alausa, Ikeja, Lagos State.\nThe communique was signed and addressed by the Ondo State Governor Rotimi Akeredolu who was the head of the Governor’s forum.\nRead also: Southern governors meet to discuss open grazing, restructuringThe meeting was a follow-up to their last meeting in Asaba the Delta State capital.\n“In order to consolidate our democracy and strengthen the Electoral process, the Southern Governors’ Forum rejects the removal of the Electronic transmission of the election result from the electoral act; and also rejects the confirmation of exclusive jurisdiction in pre-election matters on the Federal High Court."
  },
  {
    "headline": "Nigeria’s wheat demand surges as garri, rice prices spike",
    "summarized_story": "Nigeria’s year-on-year wheat importation has risen by 47.4 percent as prices of close substitutes – garri and rice spike at a faster pace, making semolina, pasta and noodles form a regular part of meals in most urban and rural households across the country.\nData from the National Bureau of Statistics (NBS) show that the country…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Edo Refinery: Plant to source crude from Escravos line – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said the Edo Modular Refinery being developed by Edo Refinery and Petrochemical Company Limited (ERPC) with support from the state government, in Ologbo, Ikpoba – Okha Local Government Area, will source crude for processing from the Escravos Line.\nThe governor, who spoke during a recent inspection of the facility, said the crude sales agreement is being finalized in readiness for production, which is scheduled to begin in August this year.\n“What we have left now is to finalise the crude oil sales contract; these facilities have to get a certain type of crude from the Escravos line and that is being finalized.\nThe 6000bpd Edo Modular refinery is an initiative of the Governor Godwin Obaseki-led administration, which was facilitated with the release of N700 million as renewable preference shares in the Edo Refinery and Petrochemical Company.\nThe major products to be sold are Diesel, Naphtha and Low Pour Fuel Oil (LPFO) and work is ongoing to expand the plant to refine 20,000bpd."
  },
  {
    "headline": "IGR: Edo govt tasks MDAs on automation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has tasked Ministries, Departments and Agencies (MDAs) to key into the automated Internally Generated Revenue (IGR) system now operational in the state.\nThe charge was given by the Head of Service, Anthony Okungbowa Esq, at a two-day training workshop on Electronic Treasury Receipt and MDA Certificate Approval, organized by the Edo State Internal Revenue Service (EIRS) for Permanent Secretaries, Directors and Heads of Revenue drawn from various MDAs in Edo State.\nExecutive Chairman Edo State Internal Revenue Service, (EIRS), Igbinidu Inneh said the system was conceived to enable government to electronically track transactions with individuals and organizations, particularly as it relates to government applications and approvals.\nHe noted that this was to ensure that officials of government comply with the relevant tax laws to avoid being sanctioned.\nOther benefits of the electronic treasury receipts and MDA certificate approvals include the issuance of verifiable electronic documents, as well as realtime reporting of all MDA transactions, amongst others."
  },
  {
    "headline": "Gun men kill Police Escort, Driver Of APC Chieftain In Delta – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – A gang of yet to be identified gunmen on Sunday morning, killed a mobile police escort and driver of All Progressive Congress (APC), Chief Michael Johnny at the ever busy Airport Junction in Uvwie Local Government Area of Delta state.\nThe deceased mobile police identified as Inspector Samuel Arigbanmigha and the deceased driver Stephen Okhea were said be on official duty to escort their boss’s wife, Mrs. Johnny to church when the incident occurred.\nNigerian Observer, gathered that , they had dropped Mrs. Johnny off at the church and were on their way to run another errand when they were accosted at about 11;12am by their assailants who trailed after them in a yellow Lexus Jeep.\nThe deceased policeman and driver according witnesses at the crime scene , were accosted and reportedly shot at a close range on the head and stomach , killing the duo instantly.\nDivisional Police Officer (DPO), Enerhen Division, CSP Mukhtari Bello, led his men to the conduct preliminary investigations on the incident."
  },
  {
    "headline": "Acquire skills and attitudes, EdoJobs MD admonishes youths – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Managing Director of Edo State Skills Development Agency also known as EdoJobs, Hon.\nMrs. Ukinebo Dare has admonished youths seeking employment to discard the notion that their educational qualifications alone will give them employment in the job market.\nShe also used the occasion to tell the youths and job seekers in Edo state about EdoJobs which specializes in job opportunities, trainings, career development among others.\nDare urged the youths to maximize the opportunities the Agency provides as they are: “the ones to transform their circumstances”.\nShe noted that the opportunities provided by EdoJobs can be assessed by everybody resident in Edo State."
  },
  {
    "headline": "Fire erupts in building at TB Joshua’s funeral",
    "summarized_story": "ADVERTISEMENTFire erupted in a building inside the Synagogue Church Of All Nations headquarters in Lagos Monday night as the funeral ceremony of TB Joshua, the founder of the church, got underway.\nThe fire, which was noticed at about 11 p.m., affected a building that a witness said housed a store on the premises, some metres away from the church’s main auditoriumThe cause of the fire is yet to be ascertained but the witness, who did not want to be named because he was not authorised to speak, said it resulted from an electrical spark.\nAs of midnight, the fire has been largely contained by a crowd of worshippers who were using containers to scoop water from near the church and dashing to douse the flames.\nOfficials of the Lagos State Fire Service arrived at about 12:15 a.m.Mr Joshua’s weeklong funeral ceremony began on July 5 with a candlelight procession at the church’s prayer mountain in Ikotun, Lagos.\nOther activities lined up for the ceremony include a tribute service on July 6 and 7, lying-in-state on July 8, laying to rest and internment on July 9, and a thanksgiving service on July 11The popular televangelist died on June 5, according to his church, a few days before his 58th birthday."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Music Promoter, Osaghalele, Poised To Take Entertainment Industry To Next Level",
    "summarized_story": "Nigerian-born Osasogie Osaghalele is an exceptionally talented and creative showbiz personality with certified record of delivering marketing solution with innovative strategy in exporting the Nigerian music to the outside world.\nHe debuted into the promotion and exporting of Nigerian creative works outside the shores of the country, few years back with his unique strategy.\nOsaghalele has showcased a good number of artistes who needed their creative works to be seen outside the shores of the country.\nThis young showbiz philanthropist, who hails from Edo State, is not just a lover of music but supports movie practitioners alike.\nOsasogie artistically called Crisogie among his teeming followers also had a flare for comedy which has been his first passion in the entertainment world, and he is poised to take the entertainment industry to the next level."
  },
  {
    "headline": "Music Promoter, Osaghalele, Poised To Take Entertainment Industry To Next Level",
    "summarized_story": "Nigerian-born Osasogie Osaghalele is an exceptionally talented and creative showbiz personality with certified record of delivering marketing solution with innovative strategy in exporting the Nigerian music to the outside world.\nHe debuted into the promotion and exporting of Nigerian creative works outside the shores of the country, few years back with his unique strategy.\nOsaghalele has showcased a good number of artistes who needed their creative works to be seen outside the shores of the country.\nThis young showbiz philanthropist, who hails from Edo State, is not just a lover of music but supports movie practitioners alike.\nOsasogie artistically called Crisogie among his teeming followers also had a flare for comedy which has been his first passion in the entertainment world, and he is poised to take the entertainment industry to the next level."
  },
  {
    "headline": "Buhari Expresses Worry Over Incessant School Attacks",
    "summarized_story": "President Muhammadu Buhari on Monday directed the military, police and intelligence agencies to ensure safe and early release of all kidnapped victims, expressing concern over incessant attacks on Kaduna and Niger States, largely targeted at students.\nWhile noting ongoing deployment of additional security personnel to all troubled areas, the President in a statement by presidential spokesman, Garba Shehu, urged security outfits to “act swiftly” to rescue all school boys and girls in the affected states and ensure safe return.\nPresident Buhari said the disturbing incidents of kidnapping students, mostly in Northern states, was already threatening to undermine efforts in boosting school enrolments in states that were adjudged educationally backward.\nHe called on state governments to ensure compliance with UN-supported Safe Schools Programme, which the administration had adopted.\nThe President described kidnapping as cowardly and despicable, condemning it as an assault on affected families and the nation."
  },
  {
    "headline": "Buhari Expresses Worry Over Incessant School Attacks",
    "summarized_story": "President Muhammadu Buhari on Monday directed the military, police and intelligence agencies to ensure safe and early release of all kidnapped victims, expressing concern over incessant attacks on Kaduna and Niger States, largely targeted at students.\nWhile noting ongoing deployment of additional security personnel to all troubled areas, the President in a statement by presidential spokesman, Garba Shehu, urged security outfits to “act swiftly” to rescue all school boys and girls in the affected states and ensure safe return.\nPresident Buhari said the disturbing incidents of kidnapping students, mostly in Northern states, was already threatening to undermine efforts in boosting school enrolments in states that were adjudged educationally backward.\nHe called on state governments to ensure compliance with UN-supported Safe Schools Programme, which the administration had adopted.\nThe President described kidnapping as cowardly and despicable, condemning it as an assault on affected families and the nation."
  },
  {
    "headline": "Electoral Act: NASS Presiding Officers Can’t Dictate Outcome Of Amendment – Lawan",
    "summarized_story": "President of the Senate, Ahmad Lawan, has said that presiding officers of both chambers of the National Assembly are not in any position to determine the outcome of amendments to the Electoral Act (Amendment) Bill under consideration.\nHe, therefore, advised Nigerians to engage their representatives in both chambers of the National Assembly on whatever issues they feel strongly about in the Bill.\nLawan said, “The National Assembly is embarking on the amendment of the Electoral Act, probably by next week or within the next two weeks.\nEarlier, Speaker of the House of Representatives, Femi Gbajabiamila, said the Public Complaints Commission was conceived to, amongst other things, address issues of Human Rights abuses.\n“It is clear that the Public Complaints Commission is a product of necessity due to Human Rights abuses, societal victimization, high-handedness and other forms of practices of maladministration."
  },
  {
    "headline": "COMMUNIQUÉ ISSUED AT THE CONCLUSION OF THE MEETING OF THE GOVERNORS OF SOUTHERN NIGERIA AT THE LAGOS STATE GOVERNMENT HOUSE, IKEJA, LAGOS STATE,",
    "summarized_story": "COMMUNIQUÉ ISSUED AT THE CONCLUSION OF THE MEETING OF THE GOVERNORS OF SOUTHERN NIGERIA AT THE LAGOS STATE GOVERNMENT HOUSE, IKEJA, LAGOS STATE, ON MONDAY, 5TH JULY, 2021 NIGERIA.\nthe Forum rejects the proposed 3% and support the 5% share of the oil revenue to the host community as recommended by the House of Representatives;iii.\nHowever, the forum rejects the ownership structure of the proposed Nigeria National Petroleum Company Limited (NNPC).\nThe Forum unanimously chose Lagos State as its permanent secretariat and appreciated the Governor of Lagos State for the wonderful hosting of this meeting while commending him for his good work in the State.\nArakunrin Oluwarotimi Odunayo Akeredolu SANGovernor, Ondo State and Chairman, Southern Governors’ Forum"
  },
  {
    "headline": "COMMUNIQUÉ ISSUED AT THE CONCLUSION OF THE MEETING OF THE GOVERNORS OF SOUTHERN NIGERIA AT THE LAGOS STATE GOVERNMENT HOUSE, IKEJA, LAGOS STATE,",
    "summarized_story": "COMMUNIQUÉ ISSUED AT THE CONCLUSION OF THE MEETING OF THE GOVERNORS OF SOUTHERN NIGERIA AT THE LAGOS STATE GOVERNMENT HOUSE, IKEJA, LAGOS STATE, ON MONDAY, 5TH JULY, 2021 NIGERIA.\nthe Forum rejects the proposed 3% and support the 5% share of the oil revenue to the host community as recommended by the House of Representatives;iii.\nHowever, the forum rejects the ownership structure of the proposed Nigeria National Petroleum Company Limited (NNPC).\nThe Forum unanimously chose Lagos State as its permanent secretariat and appreciated the Governor of Lagos State for the wonderful hosting of this meeting while commending him for his good work in the State.\nArakunrin Oluwarotimi Odunayo Akeredolu SANGovernor, Ondo State and Chairman, Southern Governors’ Forum"
  },
  {
    "headline": "EFCC Arrests Four Suspected Internet Fraudsters in Abuja",
    "summarized_story": "EFCC Arrests Four Suspected Internet Fraudsters in AbujaEFCC Arrests Four Suspected Internet Fraudsters in AbujaThe Operatives of the Economic and Financial Crimes Commission, EFCC, on Monday, July 5, 2021 arrested four (4) suspected internet fraudsters in Kubwa and Jahi areas of Abuja.\nThe suspects are Victor Wealth, Hendrix Esimeje, Merit Bareten and Moses Owoh.\nThey were arrested following credible intelligence received by the Commission on their alleged involvement in computer-related fraud.\nItems recovered from them include 2 exotic cars and mobile phones.\nThey will be charged to court as soon as investigation is concluded."
  },
  {
    "headline": "EFCC Arrests Four Suspected Internet Fraudsters in Abuja",
    "summarized_story": "EFCC Arrests Four Suspected Internet Fraudsters in AbujaEFCC Arrests Four Suspected Internet Fraudsters in AbujaThe Operatives of the Economic and Financial Crimes Commission, EFCC, on Monday, July 5, 2021 arrested four (4) suspected internet fraudsters in Kubwa and Jahi areas of Abuja.\nThe suspects are Victor Wealth, Hendrix Esimeje, Merit Bareten and Moses Owoh.\nThey were arrested following credible intelligence received by the Commission on their alleged involvement in computer-related fraud.\nItems recovered from them include 2 exotic cars and mobile phones.\nThey will be charged to court as soon as investigation is concluded."
  },
  {
    "headline": "Kyari pushes for cut in payout to oil communities in PIB",
    "summarized_story": "Mele Kolo Kyari, the NNPC boss may have incurred the wrath of oil communities by asking the National Assembly to peg at 2.5 percent oil profit payable to host communities, according to the Petroleum Industry Bill.\nBut Kyari at a forum in Abuja on Monday, urged the National Assembly to lower the share of oil producing communities to 2.5 percent.\nBut Kyari spoke on a day that the umbrella political group for the oil producing region of Niger Delta, PANDEF, demanded 10 percent.\nChief Edwin Clark, leader of the group, whose speech was delivered in Abuja, described the PIB, satanic, unjust and embarrassing to Niger Delta.\nHe said it has dashed the hope of the people of the Niger Delta region."
  },
  {
    "headline": "Matawalle recalls 8 sacked special advisers",
    "summarized_story": "Bello Matawalle of Zamfara has approved the reappointment of eight Special Advisers who were sacked last week.\nYakubu Haidara, Permanent Secretary, Cabinet Affairs made this known on Monday.\nThose reappointed included Aminu Abdullahi-Alkali, Sustainable Development Goals; Ahmed Muktar-Mohammed, Housing and Urban Development and Junaidu Aminu-Kaura, Judicial Service and Legal Matters.\nOthers are Ibrahim Ma’aji-Gusau, Political Affairs and Inter Party Relations; Dr Aslam Aliyu, Skills Acquisition; Yusuf Abubakar-Zugu, Chieftaincy Affairs; Danyaro Abdullahi-Wuya, FADAMA III and Abubakar Musa (Mainera), Commodity Board.\nMatawalle had on July 3 sacked all his Special Advisers."
  },
  {
    "headline": "Buhari orders military, police to rescue 140 kidnapped Kaduna school students",
    "summarized_story": "By Kazeem UgbodagaPresident Muhammadu Buhari has ordered the military, police and intelligence agencies to ensure safe and early release of all kidnapped school children in Kaduna.\nBandits had stormed the Bethel Baptist High School in the south of Kaduna State overnight and abducted 140 students.\nThe attack is the 10th mass school kidnapping since December in northwest Nigeria, which authorities have attributed to armed bandits seeking ransom payments.\nHowever, Buhari, in a statement issued by his spokesman, Garba Shehu, expressed concern over attacks on Kaduna and Niger States, largely targeted at students.\nHe urged security outfits to “act swiftly” to rescue all school boys and girls in the affected states and ensure safe return."
  },
  {
    "headline": "ESN Members Move To Plant Bomb In Military Checkpoints",
    "summarized_story": "The Eastern Security Network, ESN, a security wing of the outlawed Indigenous People of Biafra, IPOB, has been arrested, according to the Imo State Police Command, for allegedly plotting to put explosives in a military checkpoint along the Owerri/Orlu route in Imo State.\nThe ESN members were apprehended while engaging security operatives in a gun duel, according to the State Commissioner of Police, Abutu Yaro, who confirmed the arrest to newsmen in Owerri while parading the suspects.\nAccording to him, “On 4th July 2021, some members of the prescribed ESN/IPOB Organisation, were arrested by security agencies in the state.\nThey were arrested in a futile bid to lunch improvised explosives on the Military checkpoint along Owerri Orlu Road.\nHe asked locals to assist security personnel by providing relevant information on criminal elements’ actions that are causing disturbance across the state."
  },
  {
    "headline": "BREAKING: Kaduna Orders Closure Of 13 Schools Over Abduction",
    "summarized_story": "The Kaduna State administration has ordered the immediate closure of 13 schools in areas classified as vulnerable to bandit attacks following the attack on the Bethel Baptist High School on Monday.\nA large number of pupils were taken from a school in the state’s Chikun Local Government Area.\nFaith Academy, along Kachia Road near to Jakaranda; Deeper Life Academy, Maraban Rido; Ecwa Secondary School, Ungwar Maje; and Bethel Baptist High School, Damishi are among the schools affected.\nSt. Peters Minor Seminary in Katari, Prelude Secondary School in Kujama, Ibiso Secondary School in Tashar Iche, and Tulip International (Boys) and Tulip International (Girls) School are among the others.\nGoodnews Secondary School, Kujama; Comprehensive Development Institution (CDI), Tudun Mare; and Adventist College, Kujama are also on the list."
  },
  {
    "headline": "BREAKING: Nigerian Minister Slumps At Official Function In Bauchi State",
    "summarized_story": "Ambassador Maryam Yalwaji Katagun, Minister of State for Industry, Trade, and Investment, fell at a formal occasion in Bauchi State on Monday.\nAccording to Daily Trust, the Minister, who was in Bauchi to inaugurate an empowerment initiative, slumped during her speech during the ceremony, which was attended by the Deputy Governor, Senator Baba Tela.\nShe was brought to the Abubakar Tafawa Balewa University Teaching Hospital’s Trauma Center (ATBU-TH).\nA witness stated, “She merely grasped her head and slumped suddenly while officials hurried her to the hospital immediately.”On Sunday, the Minister, who has been in Bauchi since Saturday, was interviewed live on Globe FM radio.\nAccording to a top government official, the Minister would be transferred to Abuja for further medical attention as soon as her condition improves."
  },
  {
    "headline": "Herdsmen: Gov Ortom Says Buhari Apologists Are Sponsoring Attacks Against Him",
    "summarized_story": "On Monday, Governor Samuel Ortom of Benue State said that some supporters of President Muhammadu Buhari are funding media attacks against him.\nNo wonder, President Muhammadu Buhari singled Governor Ortom out during his interview with Arise Television.\nWhy do they sit in Abuja to criticize the Benue State Governor?\n“Governor Zulum of Borno State may be doing well in his own right but so too, is Governor Ortom.\nUsing Governor Samuel Ortom as a scapegoat can not wish away the burden of performance regarding the promises made."
  },
  {
    "headline": "Breaking: NASS leadership meets Finance Minister over 2022-2024 MTEF/FSP",
    "summarized_story": "Femi Gbajabiamila, on Monday evening met with the Minister of Finance, Hajiya Zainab Ahmed, over the 2022-2024 Medium Term Expenditure Framework and Fiscal Strategy Paper.\nLawan in his welcome address recalled the commitment of the Ninth National Assembly towards the early passage of the nation’s annual budget.\nHe explained that the development was responsible for the 100 percent implementation of the 2020 Appropriations Act which, according to him, would be achieved also in 2021.\n“So far, we have achieved that in the 2020 budget and 2021 budget as well.\nThe Finance Minister disclosed that although the Nigerian economy experienced more revenue earnings in 2020 from non-oil sectors, other sectors such as transport still remain in the negative."
  },
  {
    "headline": "Breaking: As bandits target abduction of more students, Kaduna govt orders closure of mission, other schools",
    "summarized_story": "Hours after bandits attacked Bethel Baptist school and made unsuccessful attempt to invade Living Faith’s Academy, the Kaduna state government has ordered the immediate closure of 13 schools located in areas that have been identified as vulnerable to attacks.\nUp till the time of filling this report, the actual number of students kidnapped at the Bethel secondary school is still unknown.\nAhmed listed the names of the affected schools to include Faith Academy, along Kachia Road adjacent to Jakaranda, Deeper Life Academy, Maraban Rido, ECWA Secondary school, Ungwar Maje and Bethel Baptist High School, Damishi.\nOthers are, St. Peters Minor Seminary, Katari, Prelude Secondary School, Kujama, Ibiso Secondary School, Tashar Iche, Tulip International (Boys) School and Tulip international (Girls) School.\nAlso on the list are Goodnews Secondary School, St. Augustine, Kujama, Comprehensive Development Institution (CDI), Tudun Mare and Adventist College, Kujama."
  },
  {
    "headline": "Breaking: Organised Labour suspends strike in Nasarawa",
    "summarized_story": "The Organised Labour in Nasarawa state, Monday, suspended the industrial action declared over the partial implementation of the minimum wage and non-release of promotion of workers for over 12 years.\nChairman of the Nasarawa state chapter of the Nigeria Labour Union Comrade Yusuf Sarki Iya announced the suspension at a press conference in Lafia, the state capital.\n“The strike action is hereby, suspended and we call on all workers to go back to work effect from today Monday June 5, 2021,” he said.\nGovernor Abdullahi Sule of Nasarawa state appreciated the labour leaders for their understanding and maturity throughout the strike period.\nMembers of the organised labour in Nasarawa state comprising the Nigeria Labour Congress (NLC) and Trade Union Congress (TUC) began strike on June 15, 2021."
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "UPDATED: Nigeria’s Next President Should Emerge From The South – Southern Governors",
    "summarized_story": "Southern governors have jointly agreed that Nigeria’s next president should emerge from the southern region.\nThe governors also set September 1, 2021, as the deadline for the promulgation of anti-open grazing law among its member states.\nChairman of the Southern Governors’ Forum, Rotimi Akeredolu, said this on Monday while reading from a communique jointly signed by the governors after a closed-door meeting in Alausa, Lagos State.\nThe governors affirmed their commitment to the unity of Nigeria on the pillars of equity, fairness, justice, progress, and peaceful co-existence between and amongst its people.\nSee the FULL communique by the governors below:"
  },
  {
    "headline": "Bandits Kidnap Students From Another Kaduna School, Kill Two",
    "summarized_story": "Two persons are said to have lost their lives after bandits invaded Bethel Baptist School, a private college in Kaduna State, kidnapping an unspecified number of students.\nThis latest kidnap incident comes barely one day after gunmen suspected to be kidnappers attacked the National Tuberculosis and Leprosy Centre in Zaria, Kaduna state, abducting no fewer than seven people including nursing mothers.\nZamfara, Katsina, Niger, and Kaduna have been the most attacked by the bandits, with the situation in the latter state deteriorating at an exponential rate.\nThe governor had in September 2019, enrolled his six-year-old son, Abubakar-Sadiq into Kaduna Capital School, a public school located in the Kaduna State capital, in order to show leadership to revamp public education in the state and make it more competitive.\nThe Kaduna Governor has insisted that the state government has no money to pay bandits amid the renewed attacks by armed groups in the state."
  },
  {
    "headline": "FG Should Apologise To Igboho, Stop Pursuing Him As A Criminal – Wole Soyinka",
    "summarized_story": "Nobel Laureate Wole Soyinka has asked the Federal Government to apologise to Sunday Igboho after officials of the Department of State Services invaded his home and killed two of his associates.\nThe DSS invaded Igboho’s house in Ibadan, Oyo State, early on Thursday based on intelligence it said it had received that he was stockpiling arms to cause chaos within the region.\nIgboho, who has been declared wanted by the DSS, had recently been calling for a ‘Yoruba Nation’ over what he has described as a ‘Fulani invasion’ of the South-West.\n“If and when Igboho comes to trial, I guarantee you the government will be very embarrassed.\nAccording to the erudite professor, Nigeria’s current structure was imposed upon the people by the military."
  },
  {
    "headline": "I Am Done With Partisan Politics, Obasanjo Denies Plan To Float New Party",
    "summarized_story": "Former President Olusegun Obasanjo says he is done with partisan politics, noting that claims making the rounds in the media that he is planning to float a new political party ahead of the 2023 general elections are false.\nThe former president who stated this in Kabul, Afghanistan, as a guest of President Ashraf Ghani, warned those who want to use the back door to force him to return to partisan politics to respect his choice to remain a non-partisan statesman.\nHe insisted that he will continue to perform his role with a focus on providing counsel, support, or solutions wherever possible in Nigeria, Africa, and indeed the world.\nBelow is the former president’s full communique as sent out on Monday.\nREAD ALSO: Two Killed As Bandits Kidnap Students In Another Kaduna School"
  },
  {
    "headline": "Osaka Preparing For Olympics, Agrees To Do News Conferences",
    "summarized_story": "Tennis star Naomi Osaka said Monday she wants to be on top form at the Olympics and will take part in press conferences, after pulling out of several tournaments citing her struggles with depression and anxiety.\n“I am preparing myself little by little so I can be at the top of my game for the Olympics,” the 23-year-old wrote in a message published by the broadcaster.\nThe Japanese player had said post-match news conferences were detrimental to her mental health and likened them to “kicking people when they’re down”.\nOsaka’s agent said last month that she had withdrawn from Wimbledon to spend time with friends and family.\nBut he added that she was “excited to play in front of her home fans” at Tokyo 2020, which begins on July 23."
  },
  {
    "headline": "Lagos Assembly passes law to prohibit police from parading suspects",
    "summarized_story": "Lagos State House of Assembly has passed an amended version of the Criminal Justice Law of the State barring the police from parading suspects before the media henceforth.\nThe bill was passed at a sitting presided over by Deputy Speaker, Wasiu Eshilokun-Sanni, on behalf of Speaker Mudashiru Obasa.\nSection 9(A) of the newly passed bill states: “As from the commencement of this law, the police shall refrain from parading any suspect before the media.”The bill also stipulates the conditions under which a policeman can arrest without warrant, one of which is that a person must be reasonably suspected to unlawfully be in possession of firearms or other such dangerous instruments.\nA subsection of the bill also barred the police or any other agency from arresting a person “in lieu of any other person in a criminal matter”.\nAdvertisementThe bill adds a person who is arrested “shall be given reasonable facilities for obtaining legal advice, bail or making arrangements for defence or release."
  },
  {
    "headline": "Kaduna State Government orders immediate closure of 13 schools",
    "summarized_story": "The Kaduna State Government has ordered the immediate closure of thirteen schools located in areas prone to bandits attack.\nThe directive was issued to proprietors of private schools in the state by Umma Ahmed, the Director-General of Quality Assurance Authority, Ministry of Education, Kaduna State.\nThe closure is to take place with immediate effect.\nThis follows the recent abduction of students from Bethel Baptist college in the state by bandits on Monday."
  },
  {
    "headline": "NSCDC Commandant Zone M. Visits Zamfara Command",
    "summarized_story": "The Zonal Commander of the Nigeria Security and Civil Defence Corps (NSCDC) in charge of Zone M Mr. Sammani Mohammed Inuwa said the welfare of personnel remains the top most priority of corpZone M of the NSCDC Comprises four commands of Sokoto, Kebbi and Zamfara statesSammani stated this during his one day official visit to the Zamfara state commandHe noted that the service would not relent in its efforts in ensuring that the staff welfare is properly taken care of.\nThe Zonal Commander appeal to the personnel to redouble their efforts in the discharge of their duty, adding that service will not condone any act of lawlessness and indisciplineAdvertisement” I assured u that all outstanding arrears and allowances of officers and men will be settled in no distance time” he assuresHe commended the Zamfara state Command for establishing women response unit which is first of its kind in the zone.\n” I want to commend this Command for establishing Women response team and is the first of its kind in zone M. It is worthy of commendation” Sammani saidAdvertisementResponding, the Zamfara State Commandant, Mr. Akushie Athanasius applauded the Zonal commandant for the visit, describing it as a morale booster for the personnelHe said the Zamfara state command is ever ready to effectively discharge its constitutional responsibilities especially in the ongoing fight against bandits and other criminal elements“I am optimistic that my men are battle ready to face criminals and deal with them decisively” Athanasius saidMr. Athanasius thanked the Zamfara State Government for the cordial relationship and assistance to the command."
  },
  {
    "headline": "Nigeria’s Southern Governors Reject Removal of Electronic Transmission of Election Results",
    "summarized_story": "Governors of Nigeria’s southern region have rejected in strong terms the removal of electronic transmission of election results from the Electoral Amendment Bill 2021.\nThe governors also rejected the confirmation of exclusive jurisdiction in pre-election matters on the federal high court.\nThe seventeen governors stated this on Monday at the end of the southern governors’ forum meeting held in Nigeria’s commercial capital Lagos State.\nThe forum however supports the 5 per cent share of oil revenue to the host communities as proposed by the House of Representatives.\nBy Abel Ejikeme"
  },
  {
    "headline": "Southern Nigeria Governors Demand Next President Should Emerge From South",
    "summarized_story": "Seventeen Governors of Nigeria’s southern region are demanding that the next president of the country emerge from the south.\nThe governors stated this on Monday at the end of the southern governors’ forum meeting held in Lagos State.\nThe meeting is a follow-up to the earlier meeting in Asaba, the Delta state capital hosted by the state Governor.\nDetails LaterBy Abel Ejikeme"
  },
  {
    "headline": "Nigeria: Edwin Clark Warns of Possible Hostilities in Niger Delta, Demands Immediate Reversal, Amendment of Passed PIB",
    "summarized_story": "Leader of the Pan-Niger Delta Forum (PANDEF), Edwin Clark has warned of possible hostilities in the Niger Delta region if the recently passed Petroleum Industry Bill (PIB) is not reversed, reviewed and amended.\nHe cautioned that the “Niger Delta people may be forced to take their destiny into their own hands”.\n“It is important to state clearly here to all well-meaning Nigerians that the demand of the oil-bearing communities of the Niger Delta Region was for a minimum of 10% equity participation,” he said.\n“We want to warn seriously, that the people of the Niger Delta have had enough of this colonial and oppressive mentality of our Northern brothers and friends.\nHe demanded that the PIB be reversed, reviewed and amended to ensure that the oil-bearing communities receive not less than 10% of operating cost."
  },
  {
    "headline": "IPOB Commander Confesses To Using Girls For Rituals – Trending with Ojy Okpe",
    "summarized_story": "Yoruba activist, Sunday Adeyemo, popularly known as Sunday Igboho is demanding an apology and 500M Naira in Compensation from the federal government over the invasion of his residence by operatives of the Department of State Security.\nReactions have trailed the arrest of an alleged commander of the Eastern Security Network Benjamin Emeoyiri who over the weekend, confessed to killing, 10 young girls and used their heads to prepare charms for fortification as well as carrying out , multiple attacks in Imo state.\nIn the meantime the , spokesman of the Indigenous People of Biafra in a statement, denied claims by the alleged commander ..The spokesman Emma powerful, described the ESN commander as a mole planted by the federal government.\nKaduna state governor Nasir El Rufai has come under fire on social media for withdrawing his children from public schools in the state over fear of attacks by Bandits."
  },
  {
    "headline": "Nigeria: Former President Obasanjo Denies Floating Political Party",
    "summarized_story": "A former Nigerian President Olusegun Obasanjo has denied claims that he is floating a political party.\nMr Obasanjo who is currently in Kabul, Afghanistan, as a guest of President Ashraf Ghani, denied the report in a statement by his media aide, Kehinde Akinyemi.\n“If anything, Chief Obasanjo’s political party today is the party of Nigerians facing insecurity, unemployment, hunger, poverty, and various other challenging issues.\nIt is the party of Nigeria which must be saved, kept wholesomely united in peace, security, equity, development and progress.\n“Let those who want to use the back door to force Chief Obasanjo to return to partisan politics respect his choice to remain a non-partisan statesman."
  }
]