[
  {
    "headline": "It’s politically suicidal for APC to retain Buni as chairman –Ajulo",
    "summarized_story": "Now to your question, the decision of the Supreme Court gives a hint and the take-home is that those who have ears should hear what the court is saying.\nThat dissenting judgment of the apex court has exposed the weakness of the anomalous impact of the continued stay in office of Governor Mai Mala Buni, the chairman of the APC National Caretaker and Convention Planning Committee.\nThe opposition Peoples Democratic Party also issued a statement, berating the APC for going ahead with the ward congresses in spite of the Supreme Court decision.\nWhat I have always recommended at different fora is that the APC should put its house in order.\nThe prolonged stay of Mai Mala Buni in office smacks of unrestrained impunity and this must be addressed without any delay."
  },
  {
    "headline": "Imo varsity ex-head of department alleged of certificate forgery",
    "summarized_story": "A senior lecturer and immediate past Head of Department, Electrical Electronics Engineering, Imo State University, Owerri, Dr Michael Anumaka, is in the midst of the storm over alleged certificate forgery.\nSunday PUNCH gathered that the certificate fraud was let open when the Council for the Regulation of Engineering in Nigeria visited his department for accreditation.\nHe spoke as the Head of Electrical Engineering Department, FUTO, and a member of the Senate as of the dates the ‘qualifications’ were obtained.\nThe suspension letter, with ref: IMSU/REG/ACA/PF.0962, titled, ‘Suspension from duty,’ was signed by the varsity acting Registrar, ANcIgbojekwe.\nThe implication of this is that it is not an academic programme of the university (FUTO)."
  },
  {
    "headline": "I introduced myself as lawyer so police wouldn’t free suspected robbers I arrested – Osun farmer held for impersonation",
    "summarized_story": "The policeman came around and picked the ID card.\nWhat ID card did you have on at the time?\nThe ID card was given to me by one Odeleye, he is a lawyer based in Ibadan.\nWe were working as advocates for Justice Corruption and he did the ID card for me; I paid for it.\nOdeleye collected N100,000 from me when he gave me the ID card."
  },
  {
    "headline": "Zulum receives returnee Chibok schoolgirl",
    "summarized_story": "… Finding Ruth keeps hope alive, says ZulumBy Ndahi Marama, MaiduguriBorno State Governor Babagana Umara Zulum on Saturday in Maiduguri, received Ruth Ngladar Pogu, one of the over 200 schoolgirls abducted seven years ago at a Government Secondary School in Chibok.\nBoko Haram had attacked the school towards midnight on April 14, 2014, and abducted them.\nRuth, alongside someone she was married to during her captivity, surrendered themselves to the Nigerian military on July 28, 2021, at a location in Bama.\n“I am extremely excited both as Borno’s Governor and father of all sons and daughters of the state and also as a father to daughters.\nHe said, the people of Chibok appreciate the efforts of security establishments and the concern and support regularly shown by Governor Zulum on the plight of parents whose daughters are still missing."
  },
  {
    "headline": "Traditional worshippers bemoan cost of living, task muslims on prayer for Nigeria",
    "summarized_story": "…urge Muslims to pray for Nigeria as they celebrate HijiraBy Adeola BadruThe traditional worshippers in Oyo State have urged Muslim faithful to continue to pray for peace and an end to the current crisis that has turned the North-Eastern Nigeria to a war theater.\nThe traditionalists said only peaceful co-existence and love for one another, no matter the religion or natural differences would bring back the lost peace in the world and some part of the countryThe Traditional Worshippers Association, Oyo State Branch, in a statement signed by the state Chairman of the association, Surveyor Adefabi Fadiran and the Secretary, Dr. Fakayode Fatunde on Saturday, while congratulating Muslims across the world on the celebration of Hijra Day, maintained that the day should be used by the Muslim faithful to promote unity among themselves and other religious bodies.\nThe statement reads: “People now kidnap, kill and maim all because of money and affluence, leadership is no more by intellectual prowess and distinct qualities that will promote the society, but by crook means, these is the cause of the current situation in our country.”“Look to the North, the South, the East and the West, hunger is written on people’s faces, cost of living has gone beyond the ordinary people of this country, people are hungry but it is just because there is no more love, if we love each other, the leaders will be just, nobody will kidnap or feed his cow on a farmer’s crop, nobody will stand against anyone’s quest to get educated, we need love.”“We felicitate with our brothers and sisters in Islam on the celebration of Hijra Day, but we should use this day to reflect on the circumstances we have found ourselves in Nigeria, where love and care for others are rare to find anymore.”The traditional worshippers call on their members across the world to continue to treat others with respect and dignity, while they call for equal recognition for all religions in the country.\nVanguard News Nigeria"
  },
  {
    "headline": "Police nab fake lawyer trying to secure suspect’s release",
    "summarized_story": "…I use lawyer’s Identity card to protect myself from criminals – Suspected fake lawyer…As Police parades armed robbers in OsunBy Shina AbubakarMuhammed Aliu, who claimed to be a lawyer, has disclosed that he only uses lawyer’s Identity card to protect himself from being harmed by criminals.\n“When I was doing a programme on the radio, I met a man who promised to give me an Identity card.\n“One Odeleye who is a lawyer issued an identity card to me after collecting N100,000.\nHe promised that he will attach me with someone, which will give me opportunity to go back to school.\nHowever, the Commissioner of Police, Olawale Olokode, said the suspect was arrested when he presented himself as a lawyer at the station to secure the release of a suspect."
  },
  {
    "headline": "Benue APC senatorial candidate leads over 80,000 followers, supporters to PDP",
    "summarized_story": "BY Peter Duru, MakurdiThe Benue North East Senatorial Candidate of the All Progressives Congress, APC, in the 2019 elections, Chief Mimi Adzape-Orubibi on Saturday defected to the Peoples Democratic Party, PDP with her over 80,000 teeming followers and supporters.\nThe ceremony which was held in Adikpo, the headquarters of Kwande Local Government Area, LGA, of the state partially shutdown the North East senatorial zone of the state.\n“The Benue people have no reason to pitch tent with the APC because the party has failed to deliver democracy dividends to them.\nThe hope of Benue people lies only in our party, the PDP.\nThe Senator representing Benue North East district Sen. Gabriel Suswam, assured the new entrant and her teeming supporters of equal opportunities in the party."
  },
  {
    "headline": "Chinese loans and our sovereignty (1)",
    "summarized_story": "Pundits have criticised or condemned the terms of the Chinese loans granted for railway construction and modernisation.\nThe outcries came after a committee of the House of Representatives, while investigating our foreign loans, claimed that Nigeria’s sovereignty is being undermined as part of the terms for China’s infrastructural loans to Nigeria.\nWaiving of sovereignty or providing sovereign guarantees for loans is a standard clause in this type of foreign borrowing.\nThe “sovereign immunity” Nigeria waived does not tamper with our country’s sovereignty and independence.\nA sovereignty waiver relating to loans between nations is nothing but a guarantee or commitment to repay the loan."
  },
  {
    "headline": "Osinbajo, Jonathan, Akeredolu, Fayemi, others honour Gbenga Daniel at daughter’s wedding",
    "summarized_story": "Top political officials and other prominent Nigerians from all walks of life, on Saturday identified with the former Governor of Ogun State, Otunba Gbenga Daniel at the Holy Matrimony of his daughter, Kehinde Abioye Daniel and her husband, Adebola Tokunbo Williams.\nThe ceremony which was held at the Federal Palace Hotel, Victoria Island, Lagos, witnessed the presence of prominent Nigerians including the Vice President, Professor Yemi Osinbajo; former President, Dr Goodluck Jonathan and his wife, Patience Jonathan.\nOthers in the event include Ondo State Governor, Arakunrin Oluwarotimi Akeredolu, and Ekiti State Governor, Dr.Kayode Fayemi and others.\nPreaching during the holy matrimony, the Prelate of the Methodist Church of Nigeria, His Eminence, Dr Samuel Chukwuemeka Kanu counselled the newly wedded couple to toe the path of God in order to enjoy a successful marriage.\nOther dignitaries at the Church Service included Pastor Tunde Bakare, Hon Minister of State for Health, Sen.Olorunimbe and several others."
  },
  {
    "headline": "Plateau attacks: JNI calls for calm, insightful resolution",
    "summarized_story": "Sequel to the recent violence which occurred in some communities across three Local Government Councils of Plateau State, the Jama’atu Nasril Islam (JNI), has called for “calm and insightful resolution” to the violence.\nJNI also warned miscreants against hiding under the guise of the crises to ignite conflict in Jos North through unprovoked attacks on innocent citizens.\nThis was disclosed by JNI’s Publicity Secretary in the State, Sani Mudi, in Jos, the State Capital.\nAccording to him, “The JNI views the bloody crises in Bassa and Riyom LGs as an abominable desecration of lives which is against the teaching of Islam.\n“We, therefore, wish to appeal to all concerned to sheath the sword andembrace the path of peace and reconciliation”, he admonished."
  },
  {
    "headline": "Gov Zulum receives surrendered Chibok Schoolgirl, reunites her with family in Borno",
    "summarized_story": "Borno State Governor, Umara Zulum, on Saturday in Maiduguri, received Ruth Ngladar Pogu, one of the over 200 schoolgirls abducted seven years ago at a Government Secondary School in Chibok.\nRuth, alongside someone she was said to have married during her captivity, surrendered themselves to the Nigerian military on July 28, 2021, at a location in Bama.\nZulum’s spokesman, Malam Isa Gusau, said the governor received the Chibok girl at the Government House in the presence of the overwhelmed parents who reunited with her.\nChairman of the Chibok Girls Movement, an association of all affected parents, Yakubu Keki, expressed joy over the return of Ruth Nglari Apagu.\nHe said, the people of Chibok appreciate the efforts of security agencies and the concern and support regularly shown by Governor Zulum on the plight of parents whose daughters are still missing."
  },
  {
    "headline": "Army denies General’s alleged plan to wipe out Miango in Plateau",
    "summarized_story": "The Nigerian Army has refuted claims that Maj.-Gen. Ibrahim Ali, the General Officer Commanding, 3 Division in Rukuba, near Jos, was plotting an evil mission in Plateau.\nThe military arm clarified that Ali was born in Nasarawa Local Government Area, not in Miango chiefdom of Bassa Local Government Area of Plateau.\nMaj. Eli Lazarus, an acting Deputy Director of Army Public Relations, further debunked speculations that Ali lived with his uncle, Ja’afaru in Miango and attended Command Secondary School, Jos.\nThe reports alleged that Ali was deployed to ensure that all the people of Miango chiefdom were wiped out.\nAli attended Lebanon Primary School Kano in 1974 and proceeded to Saint Thomas Secondary School, Kano in 1980."
  },
  {
    "headline": "Sit-at-home: Police vow to tackle IPOB, as group urges citizens to ignore order",
    "summarized_story": "The Anambra State Police Command has said it would tackle members of the Indigenous People of Biafra (IPOB) over threats to citizens of the state to stay at home every Monday until its leader, Nnamdi Kanu, is released.\nIPOB is a proscribed group, what do you want me to say about them.\nMeanwhile, a group, The South East Coalition of Civil Society Organizations (SECSOs), has called on the people of the southeast to ignore IPOB and go about their duties.\nThey are not the ones who arrested Nnamdi Kanu, nor is he in their custody.\n“In conclusion, we advise all our people to go about their normal business every day of the week."
  },
  {
    "headline": "Oba of Benin’s wife delivered of quadruplets",
    "summarized_story": "By Bisi Olaniyi, Southsouth Bureau ChiefIt was four kids at a go yesterday for the Oba of Benin, Omo N’ Oba N’ Edo Uku Akpolokpolo, Oba Ewuare II.\nHis fifth wife, the Princess (Oloi) Esosa, gave birth to three princes and a princess.\nADVERTISEMENTThe traditional ruler welcomed his first prince on the throne in May 2020 from Princess (Oloi) Iyayota.\nThe Presiding Priest of the Holy Aruosa Cathedral, in Benin, Ohen-Osa Igbinoghodua Edebiri, offered prayers to God for good health, wisdom and guidance for the quadruplets, their parents and other members of the Benin royal family.\nWhile the celebration was ongoing, members of the national executive of Immaculate Conception College (ICC), Benin, the Oba of Benin’s alma-mater, also identified with the monarch and the Benin royal family on the safe delivery of the quadruplets."
  },
  {
    "headline": "IBB under fire for saying June 12 was annulled to save Abiola",
    "summarized_story": "He alleged massive pressure from within and outside the military to cause trouble on account of the outcome of the election.\nReacting to the Babangida claims, Afenifere and NADECO chieftains said the former military ruler was turning history on its head.\nHe lamented that that posturing was typical of ambitious military rulers from the North who loathed democratic transition and succession.\n“Of course, there were some ambitious men around him: people like Mark, who were not pleased with an Abiola presidency.\nThe way out is that leaders should understand Nigeria and Nigerians; use their intellect for the benefit of the people."
  },
  {
    "headline": "Who is afraid of Asiwaju Bola Tinubu?",
    "summarized_story": "By Tunde RahmanWhy do many political opponents dread the All Progressives Congress National Leader, Asiwaju Bola Ahmed Tinubu, so much so that in their wishful thinking they hope he gives way or simply quit the stage?\nThese are some of the questions that have agitated my mind following the repeated unfounded rumours about Asiwaju Tinubu’s health status.\nLeading the charge, Asiwaju Tinubu painlessly performed the seven-round tawaf and shortly after, being a Friday, it was time for Jummah.\nFirstly, some speak magisterially on the state of health of Asiwaju Tinubu.\nThe long and short of all of this is those wishing Asiwaju dead, hoping to profit from it should be very careful."
  },
  {
    "headline": "Igboho’s associates fail to meet bail conditions, remain in prison",
    "summarized_story": "ADVERTISEMENTHe said the conditions attached to the bail could not be immediately met but explained that efforts were being made to perfect the bail by Monday.\nJustice Eguatu on Wednesday granted bail to eight of them, whose bail application was not challenged by the DSS, at N5million each.\nThe judge then granted bail at N10million each, for the other four, whose application was challenged by the DSS.\nThose granted bail at N10m are: Amudat Babatunde (AKA Lady K), Okoyemi Tajudeen, Abideen Shittu and Jamiu Oyetunji.\nThe judge said they should remain in the custody of the DSS until they are able to meet the bail conditions."
  },
  {
    "headline": "MDCN: 3 doctors de-registered, others punished for professional misconduct",
    "summarized_story": "From Fred Ezeh, AbujaThe Medical and Dental Practitioners’ Disciplinary Tribunal (MDPDT) has said that the practising licences of three doctors have been withdrawn after they were convicted of gross professional misconduct that led to the death of patients or permanent injuries.\nThe names of the affected doctors were also removed from the records of the Medical and Dental Council of Nigeria (MDCN), thus bringing to an end, their medical practices.\nThe tribunal said that many other medical doctors and dentists who were convicted by the tribunal of different professional offences were made to serve different punishments including temporary suspension, while some were acquitted and others struck out for, perhaps, lack of merit.\nHe confirmed that many of the doctors who were given punishments including temporary suspension have served the punishments and have been welcomed back into the practice.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Gunmen kill husband, kidnap wife, daughter in Ekiti",
    "summarized_story": "From Priscilla Ediare, Ado-EkitiSome suspected gunmen on Friday evening attacked a family in Ekiti state, killing the man and abducting his wife and daughter.\nA source said: “The man and the family were returning to their base when they were waylaid.\n“They didn’t take the vehicle, they only left the corpse of the man and other people in the vehicle were taken away.\n“The report we got was that, the family was traveling along that route and suddenly some suspected gunmen fired gunshots at them, killing the husband and took away the wife and their daughter.\nFew months ago, the traditional ruler of Ewu-Ekiti, Oba Adetutu Ajayi, in Ilejemeje Local Government Area of Ekiti State, had a close shave with death, as he was shot by bandits on April 10, 2021."
  },
  {
    "headline": "It’s not easy coping with sexual harassment in Nollywood –Chioma Okoye",
    "summarized_story": "Fast-rising actress, Chioma Okoye has reiterated that there are limits to what she can do for the camera.\nI can’t act being naked in any form or being kissed horribly.\nAlso, I can’t act inside a coffin or allow my photo to appear on obituary posters because I am still alive,” she says.\nMs Okoye, however, lamented that her major challenges in Nollywood are sexual advances from randy producers.\n“The major challenges I have in Nollywood are sexual requests from randy producers."
  },
  {
    "headline": "Seven profitable businesses you can start with N100,000 or less",
    "summarized_story": "Four: SkincareYet another business one is sure to have a very appreciable profit margin from is the skincare business.\nYou can start with as low as N100,000 and still make over a 100 percent profit on each product sold.\nSix: Palm oil retailingPerhaps one of the most lucrative businesses that can be started with N100,000 or less is the palm oil retailing business.\n“Palm oil business is a very lucrative business.\n“Palm oil business does not have any technicality."
  },
  {
    "headline": "Anambra guber: AA candidate Etiaba unveils campaign agenda",
    "summarized_story": "From Fred Itua, AbujaThe candidate of the Action Alliance (AA) in the forthcoming November 6 Anambra State governorship election, Ben Etiaba, has unveiled his campaign agenda ahead of the polls.\nEtiaba, who spoke on Saturday in Abuja, said that if elected as governor he will deliver integrated infrastructure in the state.\nEtiaba, who recently resigned his membership of the All Progressives Congress (APC), said he would complete all abandoned infrastructure projects in the state.\nEtiaba also said he would motivate medical personnel at home and ensure that medical practitioners in the diaspora return home to practice.\nOver the years I have mentored young Nigerians If I become the governor of Anambra state."
  },
  {
    "headline": "IBB on Corruption: With the Fact on Ground Now, My Govt a Saint",
    "summarized_story": "Answering directly on the allegation that he popularised corruption, Babangida, who was head of state between 1985 and 1993, said: “Well, you can’t compare it with the fact on the ground now.\nFrom what I read, from analysis, I think we are saints when compared to what is happening under a democratic dispensation.\n“I sacked a governor for misappropriating less than N313, 000; today billions are there in the streets.\nThose who have stolen billions are in courts, and are now parading themselves on the streets.\nHe denied being anti-media, claiming that he libralised it, leading to the birth of many private media, both print and electronic."
  },
  {
    "headline": "Army Chief: We’re Set to Take Battle to Terrorists’ Enclaves",
    "summarized_story": "The Chief of Army Staff (COAS), Lieutenant-Gen Faruk Yahaya, disclosed this shortly after addressing troops at the Fort Muhammadu Buhari Forward Operating Base, Daura, Katsina State.\nWe must carry the battle to the enemies’ enclaves both here in the North-west and even in the North-east where we are conducting them.\nThe Army Chief called for effective inter-agency collaboration between civil-military and paramilitary organisations to checkmate the activities of the hoodlums within their respective areas of responsibilities in order to ward off insecurity.\nThe Chief of Army Staff explained that traditional and religious institutions had vital roles to play in the fight against insecurity in the country.\nThe emir vowed to support the Nigerian Army to achieve the desired goal in its ongoing war against insecurity in the country."
  },
  {
    "headline": "82 Yauri Students Spend Day 52 with Bandits in Forest",
    "summarized_story": "The heavily armed bandits, who came on motorcycles, entered Yauri from the neighbouring Rijau forest in Niger State, and abducted the students and staff of the school unhindered.\nSome students and staff, 12 in all, have since gained freedom, leaving 82 in captivity.\nParents of the students still with the bandits remain in anguish over the fate of their children.\nThe bandits have not made any demands from us, we wouldn’t know if they are making any demands on government.\n“The official adds: “Both the state and federal governments are working together to secure the students."
  },
  {
    "headline": "Wema Bank Mulls Acquisition or Merger, to Raise N40bn Through Rights Issue",
    "summarized_story": "Dike OnwuamaezeThe management of Wema Bank yesterday hinted that “it is considering” the acquisition of a fintech firm or a merger with another commercial bank, as part of its growth plans.\nOseni said the acquisition “is not limited to the financial sector space.”Oseni said: One of our pillars is inorganic growth.\nOseni explained that the bank would reduce its shares in issue before embarking on the rights issue to ensure enhanced growth for shareholders.\nWe just want to manage the number of shares in issue, and that will impact on our ratios.\nIt makes sense to have more efficient shares in issue before doing the rights issuance,” Oseni said."
  },
  {
    "headline": "2023: IBB Speaks on Zoning, Says Nigeria Must Know Candidates’ Qualifications, Beliefs",
    "summarized_story": "General Babangida in an interview on Arise TV, a broadcast arm of THISDAY, monitored in Minna, Niger state on Friday believes that democracy does not align with zoning or power shift.\nBabangida also said Nigerians should know the “person, his qualifications his beliefs” before such a person is voted to lead the country “regardless of where he comes from”.\nThe former military presidents also said no person can make Nigeria a one party state, insisting however that two party system of government is good for the country.\nHe added that ” two parties are still the best for this country.\nOn insecurity, the former military president believes banditry and kidnapping have continued across the country because the military which has the capability to contain the menace “Is overstretched” and faced with “obsolete equipment”."
  },
  {
    "headline": "Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of Law, Clampdown On Free Speech In Nigeria",
    "summarized_story": "WATCH VIDEO: Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of Law, Clampdown On Free Speech In NigeriaVideo of Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of LawYou may also like"
  },
  {
    "headline": "COVID-19: NYSC records 35 fresh cases in Ogun camp",
    "summarized_story": "At least 35 members of the National Youth Service Corps (NYSC) camp in Sagamu, Ogun state have tested positive for COVID-19.\n“The number of NYSC members that have tested positive for Coronavirus is 35.\nAdvertisement“The commissioner expressed concern that Ogun had continued to record increases in cases of the infection since the beginning of August with at least seven to 16 cases per day.\n“In June, there were only two cases, while in July we recorded a sharp rise to 96 cases.\n“Death toll had remained relatively static at 50 till July 15 after which we recorded seven deaths in the last two weeks."
  },
  {
    "headline": "20 housemates vie for N2m as Nigeria’s teachers reality show kicks off",
    "summarized_story": "The second edition of Teachers Naija, a Nigerian reality TV show, kicked off on Tuesday with 20 housemates poised to battle for the N2 million prize at stake.\nThe second season brings together 20 teachers — 9 males, 11 females — from around Nigeria, who will be together in a house located in Abuja from August 3 to August 22.\nAdvertisementWhile in the house, the teachers will be made to participate in activities and tasks related to entertainment and education.\nSpeaking at the opening ceremony of Teachers Naija on Monday, Enuagwuna Ubaka, the show’s convener, said the essence of the show is to reward teachers.\nAccording to him, the winner of this year’s Teachers Naija will get a 2-bedroom flat in Abuja and go home with N2m, while the first and the second runner up will get N1.5m and N1m respectively."
  },
  {
    "headline": "COVID-19: Kano records 20 positive cases at NYSC camp",
    "summarized_story": "At least 20 members of the National Youth Service Corps (NYSC) have tested positive for COVID-19 in Kano.\nAdvertisementA source at the NYSC orientation camp in the Karaye LGA of the state broke the news to TheCable Lifestyle on Wednesday.\nWhen contacted, Hajia Aisha Tata, the Kano state NYSC coordinator, denied any such situation.\nAddressing journalists, Emeka Mgbemene, deputy director in charge of press at the NYSC headquarters, said those who tested positive for COVID-19 were prospective and not yet NYSC corps members.\n“There is no person in the NYSC orientation camp nationwide who tested positive to COVID-19,” Mgbemene added."
  },
  {
    "headline": "Federal poly Nasarawa expels two students over cultism",
    "summarized_story": "The management of Federal Polytechnic, Nasarawa has expelled two students of the institution over their involvement in cult activities.\nThe statement said the expulsion of the students was to serve as deterrent to others and for the overall development of the institution.\nAdvertisementThe statement said the students were arrested by security operatives attached to the institution after which the matter was investigated.\nAdvertisementIt added that the rector’s affirmation was in line with the provision of section 204 (e) of the institution’s students’ hand book approved in 2018.\nThe institution’s management was said to have earlier vowed to deal decisively with any student found indulging in examination malpractice, drug abuse, cultism and other negative acts."
  },
  {
    "headline": "Did Maria kiss Pere after Friday’s pool party? Liquorose says it happened",
    "summarized_story": "During a conversation on Saturday morning, BBNaija housemate, Liquorose, revealed to Maria that she shared a kiss with Pere the previous night.\nAdvertisementAccording to Liquorose: “You were kissing P. You were like, ‘I just want to f**king kiss P’.\nThen you grabbed him.”This revelation came as a shock to viewers and Maria herself as it seemed Pere and Maria were on the outs.\nMaria later told Pere to stay away from her, saying, “I don’t even know how you ended up in my bed last night.\nLater that night, Pere confessed his feelings for Maria to her."
  },
  {
    "headline": "Olumide Soyombo: The journey from startup founder to investment mogul",
    "summarized_story": "The early daysAt first, being a doctor was all Soyombo wanted to be until he was given a personal computer.\nAfter his first degree, Soyombo went on to get a master’s degree in business and information technology from Aston Business school.\nSo they created Leadpath as an investment vehicle to invest in startups, at first the approach was to invest $25,000 – $100,000 in local tech startups, similar to the Y-combinator accelerator model.\nThe bitter taste of how the founder handled the first company didn’t allow Soyombo to invest in the second company.\nWhen he thinks about the future, Soyombo is excited about the fact that the African tech ecosystem is maturing."
  },
  {
    "headline": "MTN finally repatriates 2020 dividend from Nigeria after forex crisis",
    "summarized_story": "South Africa’s MTN Group has repatriated its last year’s dividend of around $280 million (R4.2 billion) from its local unit in Nigeria.\nRespite in U.S. court caseIn addition to the news from Nigeria, MTN also revealed “positive developments” in a United States court case related to the group and its subsidiaries, MTN Afghanistan and MTN Dubai.\nIn Nigeria, MTN, through its local unit, has earmarked ₦600 billion ($1.5 billion) over the next three years to expand broadband access in Africa’s most populous economy.\nMobile subscribers decline in NigeriaFor MTN Nigeria, half-year 2021 results show that service revenue increased by 24.1% year-on-year, despite the number of its mobile subscribers declining by 7.6 million (nearly 10%).\nMTN Nigeria aims to sustain “double-digit service revenue growth ahead of inflation, driving 4G and rural network expansion,” Toriola said."
  },
  {
    "headline": "Can mobile applications help solve Africa's healthcare access problem?",
    "summarized_story": "Without discovering the mobile app, he could easily have been one of the more than 400,000 Africans malaria killed in 2019.\nZuri Health mobile app.\nArthur Ikechukwu Anoke and Daisy Isiaho, co-founders of the mobile app, Zuri Health.\nGovernmental policies will help hold digital healthcare companies accountable and protect the information and data of citizens that use the technologies.\nYet it’s fundamental if we should achieve the Sustainable Development Goals,” said Daisy Isiaho, Zuri Health Co-founder and Chief Product Officer."
  },
  {
    "headline": "Inconsistent policies are killing African startups",
    "summarized_story": "On 18 December, 2015 the CBK again issued Banking Circular No 14 of 2015, which cautioned, ‘all financial institutions against dealing in virtual currencies or transacting with entities that are engaged in virtual currencies.\nFinancial institutions are expressly advised not to open accounts for any person dealing in virtual currencies such as Bitcoin.\nDigital Tax policies in South Africa, Nigeria, Uganda and KenyaSouth Africa was the first, in 2014, to tax digital services by imposing a 14% value added tax (VAT) on digital imports.\nThis same proposal for digital tax was only shut down by the Benin Government after a peaceful protest was staged by its people.\nThis has not been the case however – digital tax policies and laws have mainly been used to restrict digital activity of citizens, infringing on their digital rights."
  },
  {
    "headline": "Insurance offers survival option as MSMEs battle growing risks",
    "summarized_story": "The need for insurance protection experts say has become very critical given the role of MSMEs as major actors in the economic development of any nation particularly job creation.\nHowever, he advised insurance companies to ensure that insurance policies designed for MSMEs must meet their needs and also address the peculiarities of MSMEs.\n“The encouraging responses validate that the products meet a critical need also that the appetite for players in the MSMEs sector to succeed sustainably is high,” he said.\nYetunde Ilori, director-general of the Nigerian Insurance Association urged the MSMEs to link their businesses with insurance protection.\n“Whatever you cannot afford to lose should be insured.”Abdulrasheed Babalola speaking on the benefits of Insurance to MSMEs informed the attendees that insurance protection offers financial protection, boosting production and facilitating access to finance."
  },
  {
    "headline": "Is Slow the most exclusive restaurant in Lagos?",
    "summarized_story": "The Slow Restaurant is located inside a beautiful white building reminiscent of a beautiful Italian-style building somewhere in Star Island in Miami.\nSlow Lagos is the only restaurant I know where reservations are highly recommended.\nIs Slow Lagos the most exclusive restaurant in Lagos?\nSlow Lagos is currently the only restaurant in Lagos where it is highly recommended to make reservations before showing up.\nCould it be that Slow Lagos understood that a full restaurant and unavailability of reservations nurtures people’s curiosity about the restaurant and makes its fame?"
  },
  {
    "headline": "Explainer: How global skills partnership may change Nigeria’s brain drain to gain",
    "summarized_story": "Skills partnership is one way that may reverse its brain drain trend.\nIt has been said severally and in a multitude of ways that Nigeria is suffering a brain drain, as its youth population actively emigrates to developed economies for better work opportunities.\nIn order to solve this problem, a report titled ‘Expanding Legal Migration Pathways from Nigeria to Europe: From Brain Drain to Brain Gain,’ by the World Bank and the Centre for Global Development (CGD), outlines how the Global Skill Partnership model could be used to solve brain drain in Nigeria and shortage of skills in Europe.\nWhat the Global Skill Partnership model is all aboutIn 2012, the Global Skill Partnership model was first proposed by Michael Clemens, an American development economist.\nAlso, last year Microsoft launched a global skills initiative to train 25 million people worldwide in digital skills."
  },
  {
    "headline": "The Story of Amineru Foods and Moves to Make the Brand Every House Hold Delicacy – Nigerian Observer",
    "summarized_story": "Aneru Izuagbe, Managing Director of Amineru Enterprises Limited and his wife Amina are farmers who are calling for support and collaboration to boost their small scale food packaging business.\nWhen they started with just wheat, the response was so impressive and they saw it as a lucrative business.\nIt was initially certification for wheat, plantain and then groundnut and pepper soup and they all have the NAFDAC number.\nSpeaking with the NIGERIAN OBSERVER in their factory in Benin City, Engr.\nOn the vision of the business, he said: “We are looking at getting to the level where Amineru unripe plantain flour, Amineru garri and Amineru beans flour is available."
  },
  {
    "headline": "Customs recruitment: Edo govt charges 72 shortlisted indigenes to show up for screening – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has urged 72 shortlisted indigenes who failed to show up for the Nigeria Customs Service (NCS) final screening for its recruitment exercise, to do so tomorrow, Saturday, August 6, 2021, in Abuja, the Federal Capital Territory (FCT).\nIn a statement, the Chief of Staff to Edo State Governor, Osaigbovo Iyoha, said of 80 Edo indigenes invited for the NCS screening in Gwagwalada, Abuja, only eight (8) participated in the screening, which took place on August 2, 2021.\nHe urged the 72 other applicants yet to take part in the screening to present themselves for the exercise in Gwagwalada, Abuja on Saturday, August 6, 2021, so that the state does not lose its 72 slots in the recruitment exercise."
  },
  {
    "headline": "Edo govt partners firm to boost trade, entrepreneurship devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has finalized plans for a partnership with OZE, an international digital business firm, to boost trade and entrepreneurship development in the state.\nAccording to Uwaibi, “It was observed that the rate of default in facilities supported by OZE to MSMEs is minimal.\n“We want MSMEs in the state to improve on how to keep records of activities in their businesses, as this will benefit their business.\nWe will need them to work with us to create more opportunities for MSMEs in Edo to access facilities.\nOne of the huge challenges with the entrepreneurs in Nigeria today is having accurate records."
  },
  {
    "headline": "Oba Ewuare Welcomes Quadruplets – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- The Benin monarch, His Royal Majesty, Oba Ewuare II, has welcome Quadruplets from his fifth wife, Queen (Oloi) Esosa Ewuare II into the Benin Royal family.\nThe traditional ruler made the announcement at 4:57p.m at his palace on Friday in Benin City, amidst jubilation from guests.\nQueen (Oloi) Aisosa Ewuare II is the youngest among the wives of the Oba of Benin.\nThe brief Ceremony coincided with the visit of National executives of Immaculate Conception College, ICC, Benin City which is Oba Ewuare II Alma-mater.\nJohn Osa- Omoregie who thanked the Benin monarch for his support towards the development of the school and sued for more support."
  },
  {
    "headline": "Court sentences man to death for killing own wife",
    "summarized_story": "ADVERTISEMENTThe Jigawa State High Court in Gumel has sentenced a man to death by hanging for killing his wife.\nThe judge, Abubakar Sambo, on Wednesday, convicted Rabiu Mamman, a resident of Medin Labo village in Gagarawa Local Government Area of the state, of the crime.\nThe spokesperson of the state’s Ministry of Justice, Zainab Baba-Santali, said Mr Mamman in 2016 ambushed his wife in a bush in Mesheda and battered her to death with a stick.\nThe learned trial judge, Abubakar Sambo, ruled that the prosecution had proven its case beyond reasonable doubt for the offence of culpable homicide punishable with death.\nCourt acqiuts suspected rapistsMeanwhile, in another judgment, the State’s Chief Judge, Umar Sadiq, on Tuesday, acquitted one Rawi Suleiman accused of rape."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "U.S naval ship, USS Hershel “Woody” Williams arrives in Nigeria for maritime security engagement",
    "summarized_story": "OBINNA EZUGWUOfficers assigned to the Expeditionary Sea Base USS Hershel “Woody” Williams (ESB 4) participated in a maritime interoperability planning event with leaders from the Nigerian Navy, Aug 7, a statement from the United States Consulate, Lagos said on Saturday.\nThe naval ship is scheduled to participate in a three-day at sea training exercise with Nigerian offshore patrol vessels and members of Ghana’s Special Boat Squadron (SBS).\nChad Graham, Hershel “Woody” Williams’ commanding officer, also met with the chief of operations for the Nigerian Navy Western Naval Command (WNC), Commodore Daupreye Franklin Matthew, to discuss their shared commitment to a peaceful, well-policed Gulf of Guinea.\nUSS Hershel “Woody” Williams is the first warship permanently assigned to the U.S. Africa Command area of responsibility.\nThe ESB ship class is a highly flexible platform that may be used across a broad range of military operations."
  },
  {
    "headline": "Soludo’s knowledge power in the Anambra electoral mind",
    "summarized_story": "Prof Chukwuma Soludo, more than Alexander the Great, exemplifies knowledge power.\nThe man, an older professor of economics had read a Soludo article and marvelled at the prescription for national development.\nSoludo got cracking and soon rolled out for the Obasanjo Administration the National Empowerment And Economic Development Strategy (NEEDS).\nFor the State governments, he came up with the State Empowerment And Economic Development Strategy (SEEDS).\nNo wonder, elites and commoners across the three senatorial zones of the state are united in getting Soludo to vie for Anambra State governorship."
  },
  {
    "headline": "Ezinna Sylvester Iwu for burial Aug 14",
    "summarized_story": "BY EMEKA EJEREDetails of programme for the final funeral rites of a legendary teacher and community leader, Ezinna Syvester Ejikeemeuwa Iwu, have been announced.\nAged 85, Ezinna Iwu died in the early hours of Sunday, June 6, 2021, in his country home, Amaiyi, Amano, Obohia in Ahiazu-Mbaise L.G.A of Imo State, after an illness.\nA statement by the heir apparent, Mr. Modestus Iwu, indicates that there will be a vigil mass at his late father’s compound on Friday, August 13 by 4:30pm.\nEzinna Iwu, until his death, was a respected community leader and devout Christian of the catholic communion, who distinguished himself in church activities.\nHe will be missed by his wife, children, relatives and loved ones, including numerous sons and daughters of Mbaise, who passed through his tutelage."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Arms Control Commission And The Task Of Mopping Up Over 350m Guns",
    "summarized_story": "However, the commission regrettably did not meet the requirements of the ECOWAS Moratorium on Small Arms of which Nigeria is a signatory in streamlining all efforts of eradication of illicit arms in the West African sub-region.\nThe NCCSALW has therefore partnered with Service Chiefs of military and paramilitary agencies to combat illicit arms flows in Nigeria.\nIn response, the Chief of Defence Staff congratulated the national coordinator on his appointment and thanked him for the visit.\nHe expressed delight in the opportunity to share the art of crime control and mopping of illicit arms with the Centre.\nThe IGP acknowledged tracing and law enforcement cooperation as the primary tools that would assist in combating the proliferation of illicit arms in the society."
  },
  {
    "headline": "Troops Foil Kidnap Attempts, Rescue 6 In Kaduna",
    "summarized_story": "Troops of Operation Safe Haven said they had foiled two kidnap attempts at different locations within Jema’a local government area of Kaduna State, resulting in the rescue of six citizens.\nIn a statement issued by commissioner for Internal Insecurity and Home Affairs, Samuel Aruwan, he said according to security reports, the incident occurred along the Badde-Ungwan Ayaba-Keffi road, where bandits attempted to abduct the occupants of a commercial vehicle approaching from Abuja.\nAruwan explained that the troops responded to a distress call and on arriving the scene, recovered five abducted passengers after a search-and-rescue exercise.\nADVERTISEMENTThe five rescued are listed as: Bilkisu Umar, Maryam Usman, Abdulsalam Mohammad, Adamu Abdullahi and Nafisa Abdulmumini, who was with her infant son.”The statement added that in another incident, the troops rescued one David Danladi along the Fanock-Kyayya-Keffi road, Jema’a LGA after he had been abducted from his vehicle by bandits.\n“He was rescued with minor leg injuries and was taken to hospital for medical attention.”The Kaduna State government commended the troops for their efforts in thwarting the kidnappings, and praised their promptness in responding to the incidences."
  },
  {
    "headline": "Zulum Receives Surrendered Chibok Schoolgirl, Boko Haram Husband",
    "summarized_story": "Borno State Governor, Babagana Zulum, yesterday in Maiduguri received Ruth Ngladar Pogu, one of the schoolgirls abducted seven years ago from Government Secondary School, Chibok.\nBoko Haram had attacked the school towards midnight on April 14, 2014 and abducted them.\nChairman of the Chibok Girls Movement, an association of all affected parents, Yakubu Keki, expressed joy over the return of Ruth.\nHe said the people of Chibok appreciated the efforts of security agencies and the concern and support regularly shown by Governor Zulum on the plight of parents whose daughters are still missing.\nMeanwhile, Zulum has praised the Nigerian military and other security agencies for their recent successes against Boko Haram/ ISWAP terrorists in the Lake Chad axis and other areas of the state."
  },
  {
    "headline": "Tokyo 2020: Team Nigeria Arrives Abuja",
    "summarized_story": "Nigerian athletes who participated in the 2020 Tokyo Olympics arrived at the Nnamdi Azikiwe International Airport in Abuja on Saturday.\nThe Team Nigeria athletes arrived at the airport at about 1 pm local time.\nNigeria placed 69th on the 205-country medal table.\nNigeria clinched two medals at the games comprising a bronze in long jump and a silver in wrestling.\nADVERTISEMENTBoth medals were won by Ese Brume and Blessing Oborududu respectively."
  },
  {
    "headline": "Gov Zulum Lauds Military Over Gains Against Terrorists",
    "summarized_story": "Borno State governor, Prof. Babagana Umara Zulum, has lauded the Nigerian military and other security agencies over their recent successes recorded against Boko Haram/ISWAP terrorists in the Lake Chad region and other areas of the State.\nThe governor made this known while chairing an expanded security council meeting held on Saturday at the Government House, Maiduguri.\nSpeaking to journalists after the meeting, the Borno State Commissioner for Information, Home Affairs and Culture, Hon.\nHe said Zulum called on them to increase their efforts so that the whole state will be free and normalcy will return.\n“Meanwhile, the Deputy Governor of Borno State, Umar Usman Kadafur, under the directives of the governor has visited the victims and sympathized with them,” he added."
  },
  {
    "headline": "VIDEO: ROYAL BABIES: OBA OF BENIN WELCOMES QUADRUPLETS WITH FIFTH WIFE",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: ROYAL BABIES: OBA OF BENIN WELCOMES QUADRUPLETS WITH FIFTH WIFE",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "Borno begs insurgents to surrender, promises accommodation, rehabilitation",
    "summarized_story": "The Borno Government has expressed satisfaction with the growing number of insurgents surrendering to the military in the state.\nThe State Commissioner for Information, Alhaji Babakura Abba-Jato, disclosed this at the end of an expanded security meeting held on Saturday in Maiduguri.\nRecall that the Nigerian Army announced that over 100 insurgents surrendered with their weapons within the past two weeks in Borno.\nAbba-Jato said the government was happy with the development and the sustained military onslaught at the shores of Lake Chad and Sambisa Forest.\nHe explained that the return of relative peace to many parts of the state has led to restoration of civil authority."
  },
  {
    "headline": "Borno begs insurgents to surrender, promises accommodation, rehabilitation",
    "summarized_story": "The Borno Government has expressed satisfaction with the growing number of insurgents surrendering to the military in the state.\nThe State Commissioner for Information, Alhaji Babakura Abba-Jato, disclosed this at the end of an expanded security meeting held on Saturday in Maiduguri.\nRecall that the Nigerian Army announced that over 100 insurgents surrendered with their weapons within the past two weeks in Borno.\nAbba-Jato said the government was happy with the development and the sustained military onslaught at the shores of Lake Chad and Sambisa Forest.\nHe explained that the return of relative peace to many parts of the state has led to restoration of civil authority."
  },
  {
    "headline": "Ghanaian fraudster Tourey Ahmed Rufai extradited to the U.S.",
    "summarized_story": "By AbankulaA Ghanaian fraudster, Tourey Ahmed Rufai who fled to Ghana after he was sentenced to four years in prison, was extradited to the United States on Friday to serve his sentence.\nAudrey Strauss, the United States Attorney for the Southern District of New York, along with other officials, announced Rufai’s extradition.\nRufai, a/k/a “Joe Thompson,” a/k/a “Joe Terry,” a/k/a “Rufai A Tourey,” a/k/a “Ahmed Rufai Tourey,” was sentenced by U.S. District Judge Denise L. Cote on 12 April, 2019.\nMs. Strauss praised the outstanding investigative work of the FBI and IRS-CI in locating RUFAI in Ghana so that he could be arrested by Ghanaian law enforcement.\nAssistant United States Attorney Sagar K. Ravi is in charge of the prosecution."
  },
  {
    "headline": "Foursquare's ex-General Overseer Wilson Badejo is dead",
    "summarized_story": "By Wale OjetimiFormer Foursquare Gospel Church’s General Overseer, Dr. Wilson Badejo is dead.\nYomi Oyinloye, said in a statement that Badejo, who was the church’s G.O between 1999 and 2009, died on Saturday after a brief illness.\n“Dr Badejo served the Foursquare Gospel Church in Nigeria in several ministerial capacities, crowning his stewardship at the apex as the General Overseer of the Church from 1999 for 2009.\nAccording to him, Badejo left behind an indelible mark in the heart of everyone who came his way.\nOyinloye called for prayers for the family of the deceased and the Foursquare Gospel Church in this trying time."
  },
  {
    "headline": "BREAKING: Gov Zulum Receives Surrendered Chibok Schoolgirl, Reunites Her With Family In Borno",
    "summarized_story": "Borno State Governor, Umara Zulum, on Saturday in Maiduguri, received Ruth Ngladar Pogu, one of the over 200 schoolgirls abducted seven years ago at a Government Secondary School in Chibok.\nBoko Haram had attacked the school towards midnight of April 14, 2014, and abducted the students.\n“I am extremely excited both as Borno’s Governor and father of all sons and daughters of the state, and also as a father to daughters.\nChairman of the Chibok Girls Movement, an association of all affected parents, Yakubu Keki, expressed joy over the return of Ruth Nglari Apagu.\nHe said, the people of Chibok appreciate the efforts of security agencies and the concern and support regularly shown by Governor Zulum on the plight of parents whose daughters are still missing."
  },
  {
    "headline": "Just In: APC Chairman Abducted In Farm",
    "summarized_story": "Gunmen suspected to be bandits have abducted the Zone ‘C’ chairman of the All Progressives Congress (APC) in Niger State, Mallam Aminu Bobi in Mariga local government area.\nThe abduction occurred around 5 pm on Saturday while Bobi was supervising workers in his farm.\nEyewitnesses said 18 gunmen invaded the farm in six motorcycles, shooting sporadically.\nThey were said to have picked only Bobi, leaving his workers behind.\nEfforts to get Niger Police Spokesman DSP Abiodun Wasiu proved abortive."
  },
  {
    "headline": "Borno Government Promises Accommodation To Boko Haram Days After Demolishing Worship Centres",
    "summarized_story": "The government of Borno has urged members of the Boko Haram terror organisation to abandon their criminal activities in order to be accommodated and incorporated into society.\nAlhaji Babakura Abba-Jato, the state Commissioner for Information, said this at the end of an enlarged security meeting held in Maiduguri on Saturday.\nThis is coming days after the state government was scolded when its task force personnel, who accompanied the Borno State Geographical Information System, demolished worship centres in Maiduguri including the Ekklesiyar Yan’uwa a Nigeria (EYN) church building.\nAs it was Reported On Thursday an altercation during the demolition, causing the security personnel to shoot sporadically into the air.\nThe Nigerian Army recently announced that over 100 insurgents surrendered with their weapons within the past two weeks in Borno."
  },
  {
    "headline": "Obasanjo Travels To Benin Republic, Seeks Soft Landing For Igboho",
    "summarized_story": "He was claimed to have gone to Benin Republic to express his condolences to Nicephore Soglo, who had lately lost his wife, Roseline Soglo.\nSoglo was president of Benin Republic from 1991 to 1996.\nTheCable understands the former Beninise president and Obasanjo have maintained a warm relationship over the years.\nPerhaps to conceal his trip; he rerouted to Benin Republic,” one of the sources said.\nAn aide of Obasanjo confirmed the former president was in Benin Republic."
  },
  {
    "headline": "Pictures: How Nigerians turned out en masse, welcomed victorious 2020 Olympics medalists Blessing Oborodudu, Ese Brume, others on arrival in Abuja",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: Joy for Iheanacho, Ndidi as Leicester City lift 2021 English community shield",
    "summarized_story": "NextPictures: How Nigerians turned out en masse, welcomed victorious 2020 Olympics medalists Blessing Oborodudu, Ese Brume, others on arrival in Abuja"
  },
  {
    "headline": "VIDEO: Flooding takes over popular airport road as Abuja witnesses heavy downpour",
    "summarized_story": "The ever-busy airport road was flooded on Saturday as heavy rain sustained on the Nigeria’s capital, Abuja.\nThe downpour which began as early as 7am lasted till 1am.\nBlueprint reports that motorists and residents had herculean time trying move in and out their houses as well as the city centre."
  },
  {
    "headline": "2023: Christian Youth Group Endorses Gov Bello’s Presidential Ambition -NigPilot",
    "summarized_story": "Christian Youth Leadership Network CYLN has stressed the need for the younger generation to take the mantle of Nigeria’s leadership.\nThe Convener of the Network, Apostle Faith Eches, stated this at a forum organized by the group in Abuja at the weekend.\nAccording to him, Christian Youth Leadership Network will support the presidential ambition of the Kogi State governor, Yahaya Adoza Bello, come 2023.\nIn a remarks, the chairman of All Nigeria United for Yahaya Bello, Saidu Boboi, described the endorsement of Governor Bello by the Christian Youth Leadership Network as a welcome development.\nThe clergymen, therefore, emphasised the need for Nigerians to consider Bello for Nigeria’s number one position come 2023."
  },
  {
    "headline": "Imo, Anambra APGA pledge loyalty to Jude Okeke, disowns Victor Oye -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Crown University signs MoU with IHRC to boost education -NigPilot",
    "summarized_story": "Crown University Intl.\nVice-Chancellor and UNESCO Laureate, Prof. Sir Bashiru Aremu, signed for Crown University Intl.\nHe said the partnership shall apply to all activities arranged and carried out by a common agreement between Crown University Intl.\n“The Crown University Intl.\n“This gives the IHRC’s organization the status of an Institute or associate arm of the Crown University Intl."
  },
  {
    "headline": "Human Trafficking: IOM, NAPTIP launch tools for identification, protection of victims -NigPilot",
    "summarized_story": "Fight against human trafficking has received a boost as International Organization for Migration, IOM, in collaboration with the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, launched new tools to ensure a standardized approach to the identification, referral, and protection of Victims of Trafficking, VoTs.\nThe tools recently launched in Abuja coincided with the 2021 World Day against Trafficking in Persons, WDATIP, with the theme “Victims Voices take the Lead’.\nResearch also shows that two-thirds of Nigerian victims of trafficking are victims of domestic human trafficking.\nThe aim of the identification tools is to provide first-line officials with harmonized tools to effectively identify and refer victims of human trafficking in line with the National Referral Mechanism.\nThe long-term goal is to ensure these tools are integrated into an information management system, IMS, that all stakeholders can easily access."
  },
  {
    "headline": "Another Chibok Schoolgirl Rescued, Says Zulum",
    "summarized_story": "Another Chibok girl has been rescued from captivity, Borno State Governor Babagana Zulum said on Saturday.\nAbout 276 students of Government Girls Secondary School in Chibok, Borno State, were kidnapped on April 14, 2014 by Boko Haram terrorists.\nIn April, seven years after the abduction, Zulum pledged to safely recover the remaining girls.\nGrateful to GodAt Saturday’s brief ceremony, the Chairman of the Chibok Parents Association, Yakubu Nkeki confirmed Pogu as one of the missing students.\n“I am extremely excited both as Borno Governor and father of all sons and daughters of the state, and also as a father to daughters,” Zulum said on Saturday, as quoted in the statement signed by his spokesperson."
  },
  {
    "headline": "Resident Doctors Strike Enters Day Six As Dispute With Govt Worsens",
    "summarized_story": "Chances of an amicable and swift resolution of the dispute between striking resident doctors and the Federal Government took a hit on Friday as both sides stuck to their positions, trading accusations.\nOn Friday morning, the President of the Nigerian Association of Resident Doctors (NARD), Dr Uyilawa Okhuaihesuyi, said the striking doctors will not heed the call made by the Minister of Health a day earlier asking them to resume work.\n“The first thing you’re telling us is that we signed a document and we are not honouring it, (and) we need to resume work.\nLike the Health Minister, Dr Ngige argues that it was wrong for the doctors to have gone on strike being essential workers.\nOfficials of NARD maintain that the government left them with no other choice than to go on strike as the issues resident doctors were facing were serious ones."
  },
  {
    "headline": "Team Nigeria Return To Abuja After Tokyo Olympics",
    "summarized_story": "Nigerian athletes who participated in the Tokyo Olympics arrived at the Nnamdi Azikiwe International Airport in Abuja on Saturday.\nThe Team Nigeria athletes arrived at the airport at about 1 pm.\nBoth medals were won by Ese Brume and Blessing Oborududu respectively.\nTeam Nigeria’s appearance at the Tokyo games was marred by disqualifications, injuries and misfortune.\nHowever the duo of Brume and Oborududu was able to put some smile on the faces of many Nigerians."
  },
  {
    "headline": "Britain Tells Nationals To Leave Afghanistan Immediately",
    "summarized_story": "Britain has warned all UK nationals in Afghanistan to leave the country immediately due to the “worsening security situation” as fighting intensifies.\n“All British nationals in Afghanistan are advised to leave now by commercial means.\nIf you are still in Afghanistan, you are advised to leave now by commercial means because of the worsening security situation,” it said.\nThe foreign office warned Britons not to rely on it for emergency evacuation, saying the assistance it could provide was “extremely limited”.\nSpecific methods of attack are evolving and increasing in sophistication,” the foreign office said."
  },
  {
    "headline": "Second Phase Of COVID-19 Vaccination To Begin On Tuesday",
    "summarized_story": "The Federal Government on Saturday said it will begin to administer the second batch of COVID-19 vaccines it received this month on Tuesday.\nThe latest tranche, over four million doses of the Moderna vaccine, was donated by the US government.\n“The PSC has received over four million doses of Moderna vaccine donated by the U.S. Government to Nigeria,” Mr Bassey said.\nCovax was set up to ensure the equitable distribution of vaccines, particularly to low-income countries, and has already delivered more than 80 million doses to 129 territories.\nThe Moderna vaccines, which were approved by NAFDAC in July, are expected to boost the country’s vaccination programme."
  },
  {
    "headline": "UPDATED: Rescued Chibok girl reunites with mother",
    "summarized_story": "The Borno state governor, Professor Babagana Zulum has reunited an abducted Chibok girl with her mother.\nThe brief ceremony took place at the Borno State Government House on Saturday evening.\nThe Chibok girl identified as Ruth Ngladar Pogu returned with her husband via the Federal Government’s Operation Safe Corridor.\nThe Borno state government said it believes non kinetic approach is key to the rescue of abductees and ending the conflict.\nAdvertisementThe Chairman of the Chibok Parents Association confirmed Yakubu Nkeki confirmed the girl as one of the missing students."
  },
  {
    "headline": "Sokoto to subject U-12/U15 Handball players to COVID-19 test",
    "summarized_story": "Sokoto state Commissioner for Youth and Sports Bashir Usman Gorau said the state has finalised arrangement to conduct COVID-19 test on athletes participating in the National U-12/U15 Handball Championship taking place in the state.\nSpeaking to journalists at the sports arena venue of the championship during a facility tour, the commissioner says all COVID-19 protocol will be observed during the Championship.\nHe says adequate security arrangement had been put in place to ensure safety of athletes as the champion is going to be a closed competition where no fan will be allowed into the stadium in compliance into the COVID-19 protocol.\nTwenty nine clubs will be participating in the ten day Championship, which commences today with the arrival of participating clubs of U-12 and U-15 categories.\nSokoto state hosted the last edition of the championship in 2019 and the state government promised to host three consecutive Championship the promise they are fuddling with hosting this year’s competition as the outbreak of COVID-19 affected last year’s edition."
  },
  {
    "headline": "BREAKING: Another Chibok Girl rescued from Captivity – Gov Zulum",
    "summarized_story": "Another Chibok girl has been rescued from captivity, and that is according to the Borno State Governor Babagana Zulum.\nTvc news cannot confirm at the moment if she was rescued by the troops or turned herself inWhat we know is that the rescued girl was married to a Boko Haram fighter and returned with two kids while in captivity.\nAt the moment, the identity of the student has not been made known."
  },
  {
    "headline": "Iheanacho Penalty Gives Leicester Victory Over Man City in Community Shield",
    "summarized_story": "A late penalty from Kelechi Iheanacho was enough to ensure Leicester City beat Premier League champions Manchester City to win the 2021 Community Shield on Saturday, the second in the club’s history.\nWith the game still tied 0-0, Pep Guardiola brought on Man City’s British record signing Jack Grealish shortly after the hour mark for his first runout at his new club following his arrival from Aston Villa.\nWith the game looking like it was heading for a shootout, Iheanacho drew a foul on Man City defender Nathan Ake and the referee pointed to the spot before the Nigeria international converted his penalty for victory.\nManchester City begin their Premier League campaign on August 15 away to Tottenham Hotspur, while Leicester City host Wolves the day before."
  },
  {
    "headline": "Brazil Edge Spain in Extra-time to Win Olympic Gold in Men’s Football",
    "summarized_story": "Brazil needed an extra-time winner from Malcom to claim men’s Olympic gold with a 2-1 win over Spain on Saturday.\nBrazil are the first nation to retain their Olympic crown since rivals Argentina won consecutive gold medals in 2004 and 2008.\nBrazil claimed their first ever Olympic gold in men’s football in Rio 2016 when Neymar scored the winning penalty in the shootout against Germany.\nBrazil took the lead minutes later when Cunha took down Dani Alves’ looping cross inside the box and produced a composed finish into the corner.\nSpain made Brazil rue that missed chance and equalised after 61 minutes when Oyarzabal volleyed home from Carlos Soler’s cross."
  },
  {
    "headline": "A Beginner’s Guide to Intermittent Fasting",
    "summarized_story": "Intermittent fasting is not a diet, it is a meal timing plan.\nSo if you’re already on some type of diet plan, you can try doing it with intermittent fasting for better results.\nDuring your fasting window, you can only have water, herbal teas and black coffee (contains caffeine which is a natural appetite suppressant) without creamers or honey or sweeteners.\nWhen should you workout while intermittent fasting?\nIt can be during or after your fasting window but for better weight loss results, I’d recommend working out within your fasting window."
  },
  {
    "headline": "Tokyo Olympics: US Beat France 87-82 to Claim Fourth Straight Gold Medal in Men’s Basketball",
    "summarized_story": "Tokyo Olympics: US Beat France 87-82 to Claim Fourth Straight Gold Medal in Men’s BasketballTeam USA secured a fourth straight Olympic gold medal as they beat France 87-82 in Tokyo.\nFrance made a late, fourth-quarter run, but came up just short as the US made their shots at crucial moments to claim a seventh gold medal out of the last eight on offer.\nThe 32-year-old led by example throughout the tournament and scored 23 points in their final group game against the Czech Republic to surpass Carmelo Anthony as Team USA’s all-time leading scorer.\nI’m bonded to these guys for life.”Lauren Holiday, a two-time Olympic gold medallist in women’s football, expressed her pride as husband Jrue added to his NBA title success with Milwaukee Bucks.\nThere was also high praise for Durant from Stephen A. Smith who described him as “Team USA’s Captain America”."
  },
  {
    "headline": "In England, Hundreds of Vaccinated People Hospitalised with Delta",
    "summarized_story": "Hundreds of fully vaccinated people in England have been hospitalised with the highly contagious Delta coronavirus variant, scientists said on Friday.\nIn its latest COVID-19 update, Public Health England (PHE) also warned there were early signs that people who have been inoculated may be able to transmit the Delta strain as easily as those who have not received any jabs.\nFrom July 19 to August 2, 55.1 percent of the 1,467 people hospitalised with the Delta variant were unvaccinated, PHE said, while 34.9 percent – or 512 people – had received two doses.\n“As more of the population gets vaccinated, we will see a higher relative percentage of vaccinated people in hospital,” PHE said.\n“Some initial findings … indicate that levels of virus in those who become infected with Delta having already been vaccinated may be similar to levels found in unvaccinated people,” PHE said."
  }
]