[
  {
    "headline": "Dokpesi’s statement on Igbo Presidency illogical, unfortunate – South-East elders",
    "summarized_story": "The Council of Igbo Elders has said Ndigbo are not desperate for the presidency to warrant the outburst of Chief Raymond Dokpesi that if an Igbo man becomes president of Nigeria he will divide the country.\n“Thus an Igbo president may be compromised in protecting the political and geographic boundaries of Nigeria whilst Nigeria remains under the threat of IPOB’s secessionist activities.”But Chairman, Council of Igbo Elders, Chief Emmanuel Iwuanyanwu, in an interview with The PUNCH on Tuesday, pointed out that there were agitations for separation across the regions today.\nIwuanyanwu, while describing Dokpesi’s statement as unfortunate, said Ndigbo had supported a united Nigeria practically, making investment all over the country.\n“In the South-West, we have Oduduwa groups; in the South-East, we have pro-Biafra groups; South-South too have people agitating.\nHe added that elders should be able to talk truth to leaders so that they would be able to do what they could to unite Nigeria and make Nigeria a great country."
  },
  {
    "headline": "Two monarchs killed, others unconscious in Imo stakeholders meeting attack",
    "summarized_story": "Tragedy struck in Imo State on Tuesday evening as yet to be identified gunmen opened fire on traditional rulers, killing two of them in the process.\nThe traditional rulers were having a stakeholders’ meeting at the council headquarters at Nnenasa in the Njaba Local Government Area of the state when the gunmen struck.\nThe affected monarchs were Eze E. A Duruebure, who is the Obi of Okwudor; and Eze Sampson Osunwa of Ihebinowere autonomous community.\nOur correspondent learnt that other traditional rulers were left with broken heads and hands.\nRead Also Imo monarchs lament incessant abduction of judgesAs of the time of filing this report, the council headquarters was in a state of panic."
  },
  {
    "headline": "SON gets set for Standards Day, calls for stakeholders collaboration",
    "summarized_story": "By Cynthia AloThe Standards Organisation of Nigeria, SON, is set to drive up the country’s position under the United Nation’s Sustainable Development Goals, SDGs, objectives in terms of quality of goods manufactured in Nigeria and those imported into the country.\nIt however, called for collaboration of all stakeholders in the economy to achieve the goals.\nREAD ALSO:NGE, NUJ, Ekpu kick as Reps seek to convert NIJ to varsity, cede ownership to govtThis, according to him, helps to address the attainment of the objectives of the seventeen SDGs in Nigeria.\nSalim disclosed that his organisation would undertake road shows in Lagos and Abuja as well as conduct a sensitization workshop for Micro, Small and Medium Enterprises (MSMEs) across the Country to propagate the message of the 2021 World Standards Day within the month of October.\nIn a statement to mark the 2021 World Standards Day, Salim stated that these objectives of the SDGs are highly ambitious but attainable."
  },
  {
    "headline": "Housing Deficit: Govt must partner real estate developers — Expert",
    "summarized_story": "FILE: Low income housing estate in Abuja.\nJames OgunnaikeABEOKUTA – A Real Estate Developer, Osokoya Adewale Morenikeji, has called on both federal and state governments to partner with private real estate developers and financial institutions, to provide good and affordable housing for the Nigerians.\nHe therefore called on government at all levels to make land and finances available for real estate developers.\nGovernment must formulate policies that will encourage the private sector to come into the real estate sector, provide affordable housing for the people”.\nThe real estate guru also criticized the common culture of celebrating individuals of questionable integrity while neglecting nation builders in various areas of endeavours."
  },
  {
    "headline": "UNIZIK signs PPP to establish transport scheme",
    "summarized_story": "According to Okoro’s statement, “On October 14, 2021, Prof. Charles Okechukwu Esimone, the Vice-Chancellor of Nnamdi Azikiwe University, Awka signed an MoU with Dolphite Ventures Nigeria Limited and Legacy FMCG Nigeria Limited for the establishment of Unizik Transport Scheme (UTS).\n“The proposed Unizik Transport Scheme (UTS) is a Five Billion Naira(N5, 000,000,000.00) Public-Private Partnership (PPP) integrated Mass Transit project between Higer bus company limited China, China FAW group & China National Heavy Duty Company limited (SINOTRUK) all represented by Legacy FMCG Trading Company Nigeria Limited.\nThis project is being promoted by Dolphite Ventures Nigeria limited.\n“The UTS project is aimed at supporting the University to benefit from the huge economic potentials inherent in the transport sector; and to create an Alternative Source of revenue for the University.\n“The UTS will redefine transportation in the country using State of the Art applications such as Automated Transport Management Systems (ATMs)."
  },
  {
    "headline": "Why Nigerian varsities not among world best— NUC",
    "summarized_story": "National Universities Commission NUC)—Mulls stringent measures in establishment of new ones—Says some private varsities sick already—Our jobs ‘re hijacked by teaching staff, SSANU lamentsBy Johnbosco AgbakwuruABUJA—THE Executive Secretary of the National Universities Commission, NUC, Prof. Abubakar Rasheed, had lamented that poor funding was one of the main challenges that Nigerian Universities were not ranked among the best universities in the world.\nThe NUC Executive Secretary also said that any university that loses reputation, must have lost everything in life.\nHe debunked the claim that some of the commissions set up by the NUC in the universities were dominated by teaching staff against non teaching staff.\n” There is the issue of nonpayment of salaries especially for our members in state universities.\nSome have not received salaries for up to six months, yet we hear that NUC is giving accreditation to new state universities."
  },
  {
    "headline": "Adamawa records 500 Cholera cases, 23 deaths – official",
    "summarized_story": "The Adamawa Government says it has recorded 500 Cholera cases with 23 deaths since outbreak of the disease in the state in September.\nLaori said that the local government areas worst hit by cholera included Yola North, Girei and Lamurde respectively.\n“Since the outbreak of the disease in the state in September till date, we have recorded about 500 suspected cases and 23 deaths.\nMeanwhile, Malam Audu Ali, a resident of Yelwa Ward in Jimeta, Yola North LGA, lost three children to cholera.\nAliyu told NAN that the incident occurred on Monday at the hospital, where the three children were rushed to for suspected cholera infection."
  },
  {
    "headline": "War in Nigeria’s advertising industry as associations split over practice guidelines",
    "summarized_story": "The Advertisers Association of Nigeria (ADVAN) has rejected the implementation of the new Advertising Industry Standard of Practice (AISOP) guidelines.\nThe signatories include the President, Association of Advertising Agencies of Nigeria (AAAN), Steve Babaeko; President, Media Independent Practitioners Association of Nigeria (MIPAN), Femi Adelusi.\nOthers were President, Outdoor Advertising Association of Nigeria (OAAN), Emmanuel Ajufo and President, Experiential Marketers Association of Nigeria (EXMAN), Tunji Adeyinka.\nIn a statement on Tuesday, ADVAN Acting President, Bunmi Adeniba said ADVAN is supportive of the plan to create a Standard of Practice.\nThe association demanded that the involvement should not overrule the constitutional rights of business entities to conduct legitimate business activities."
  },
  {
    "headline": "Lagos traffic: Former Gov Fayose rides on okada [PHOTOS]",
    "summarized_story": "Former Governor Ago Fayose of Ekiti State, on Tuesday, left his car to commute on a commercial motorcycle, popularly known as Okada, in Ikeja, the Lagos State capital.\nFayose took the decision as a result of the hectic Lagos road traffic, which he said is no respecter of anybody.\nIn a post on his social media handle, the former Governor was seen on the motorcycle with his security aide sitting behind him.\n“Lagos traffic is no respecter of anyone.\nI had to take Okada in Ikeja to avoid missing my flight,” he said in the post."
  },
  {
    "headline": "Sacked Kano anti-graft boss, Rimin-Gado faces alleged forgery charges",
    "summarized_story": "The sacked Kano Public Complaint and Anti-Corruption Commission boss, Muhyi Magaji Rimin-Gado, is to appear before a Magistrates Court to answer questions bordering on allegations of forgery levelled against him by the police.\nRimin-Gado is to be arraigned before Kano State Magistrates Court for alleged forgery and false information charges against him.\nThe embattled ex-anti-graft boss was granted administrative bail after honouring police invitation on the same charges.\nRimin-Gado, who was suspended following the recommendation of the state assembly, is contending with a petition written against the state’s accountant general.\nWhen contacted, the spokesman of the police, DSP Abdullahi Haruna Kiyawa, confirmed that the investigation on the charges of alleged forgery and false information will resume soon."
  },
  {
    "headline": "Ezeiruaku Ifeyinwa Fidelia: No justice for female corps member dehumanized by military officer, as army ‘rewards’ suspect",
    "summarized_story": "Several weeks after Ezeiruaku Ifeyinwa Fidelia, a female corps member who was publicly humiliated and dehumanized by a female military officer, justice as noticed by DAILY POST, seems to be far away from her.\nThis was lucidly noticed in a letter drafted by her to a popular radio station where she decried the way and manner she has been abandoned to her fate.\nI didn’t write anything and didn’t withdraw the case.”Fidelia, who said she has made up her mind to tread every legitimate path to seek justice, said “I am suing Lieutenant Chika Viola and the army authorities.\nDAILY POST, however, noticed that none of such groups, organizations and individuals, as at the time of filing this report, have fulfilled their pledges thereby leaving her to her fate.\nOhanaeze condemns Army officer’s dehumanization of NYSC member"
  },
  {
    "headline": "End SARS: Do not stage any protest in Oyo – Police warn",
    "summarized_story": "Oyo State Police command, on Tuesday, said that it will not allow anyone to organize any protest in the state.\nThe police made this disclosure while reacting to a protest, which has been scheduled to hold in commemoration of the anniversary of End SARS protest in the state.\nOur correspondent recalls that the End SARS protest, which was organised by youths in October last year, was held in order to protest against police brutality.\nDAILY POST gathered that no fewer than five police officers died during the protest in the state last year.\nThe state police command has, however, advised youths not to organise any commemorative protest in Oyo State."
  },
  {
    "headline": "Why Nigeria should radically invest in vocational education",
    "summarized_story": "That is Technical and Vocational Education and Training, TVET.\nBut enrolment was poor because of the general belief then that technical education is inferior to other types of education.\nFor us to get it right, as it is never too late for a people to correct a blunder as grave as neglecting TVET, technical education should be introduced and strengthened in our education policy.\nPut differently, everyone needs to know that having vocational and technical education does not mean illiteracy in scholarship.\nTravelling this road less travelled, Tech-U puts technical, vocational and entrepreneurial competence at the heart of scholarship."
  },
  {
    "headline": "APC chairmanship, Buhari’s legacies and matters arising",
    "summarized_story": "Much has been achieved by the ruling APC since it took power in 2015.\n- Advertisement -In recent times, the media has been inundated with an x-ray of the candidates jostling for the national chairmanship position.\n- Advertisement -No doubt, these candidates have enriched the outlook of the APC as a national party in their various states either during its formative years or at its later stage.\nThis is perhaps where the candidacy of the senator from Niger East, Sani Musa, comes across as interesting.\nIn this he has been consistent since 2014 in his contribution to the development of the party both at the state and national level."
  },
  {
    "headline": "EndSARS: Why youths must tread with caution",
    "summarized_story": "The hoodlums extended their attacks to the Lagos State bus terminals at Oyingbo, Yaba and Berger.\nThe economic loss suffered by Lagos State and Nigeria at large cannot be fully quantified, and we cannot afford to have a similar experience again.\nThe governor of Lagos State must be commended for the proactive steps taken by him to address the situation, restoring normalcy and rebuilding the state’s economy.\nThe Lagos State government recently through the Lagos State Judicial Panel of Inquiry awarded a total sum of N91 Million as compensation to 16 petitioners for the brutality, harassment, extortion and extra-judicial killings of their loved ones by the police officers.\nAlso the youths need to thread with caution to ensure that no death is recorded again."
  },
  {
    "headline": "NASS: National Library first; E-voting",
    "summarized_story": "Also, NASS instead of boldly securing for the citizenry a befitting National Library, seeks to selfishly refurbish its own nearly ‘abandoned’ NASS library as a copycat of the American National Library of Congress.\nNASS, please ensure that Nigeria’s public National Library is befitting’ before a ‘befitting’ NASS library.\nIf NASS members really read and value books, they would never have taken till 2021 to ‘discover’ the NASS library deficit.\nHas any NASS official bemoaned the Nationwide Library Book Deficiency of 50-300m for 10-15m students at 5-20 library books each?\nWell, congratulations to Professor Yakubu and all others; NASS has approved Electronic Voting and Electronic Results Transmission."
  },
  {
    "headline": "Gunmen kill 2 traditional rulers in Imo",
    "summarized_story": "Stanley Uzoaru, OwerriGunmen on Tuesday continued their killing spree in Imo State as they shot and kill two traditional rulers in the State who were having a stakeholders meeting at Nnenasa in Njaba Local Government Area of Imo State.\nThe affected monarchs were Eze E. A Duruebure, obi one of Okwudor,and Eze Sampson Osunwa of Ihebinowere autonomous community.\nAlthough Our correspondent gathered that some other traditional rulers were also seriously wounded from the attack, in fact two of them whose name were not mentioned are said to be presently in coma .\nFollowing the attack on the royal fathers, the council area is said to have been enveloped with fear as most of the traditional rulers who did not attend the meeting have absconded from their palace.\nHe said ” yes two monarchs were killed today, the gunmen just got there where they were having their meeting and open fire on them.”"
  },
  {
    "headline": "Gunmen kill 30 in Sokoto market",
    "summarized_story": "From Tunde Omolehin SokotoSuspected armed bandits reportedly carried out twin attacks on Onion markets in Goronyo and Isa Local Government Areas (LGAs) of Sokoto State, on Sunday.\nSources in the village said the assailants attacked the market in large numbers and started shooting sporadically leading to the death of several people.\nTwenty persons were also killed by suspected bandits at Ungwan Lalle market of Sabon Birni local government area of Sokoto state.\nThe Sokoto state government had earlier ordered the closure of markets in the Eastern Senatorial District of the state as a measure to fight the rising insecurity brewing in the state.\nThe state governor, Aminu Waziri Tambuwal, while receiving the Chief of Army Staff, Lt. General Faruk Yahya, during a courtesy visit, yesterday, confirmed the attack on Goronyo market."
  },
  {
    "headline": "Marwa advocates drug test for politicians, students, others",
    "summarized_story": "By Cecilia OlogunagbaChairman of the National Drug Law Enforcement Agency (NDLEA), Brig.-Gen. Buba Marwa (retd), has recommended integrity drug tests as a requirement for all politicians seeking public office and public office holders.\nMarwa told the News Agency of Nigeria (NAN) in New York that the idea behind the call for the test “is to reduce the prevalence of drug abuse” in the country.\nThe test will help us know those that need help early enough before it gets worse.\n“Since in Nigeria we go for genotype test, we do HIV test before marriage, voluntarily, why can’t we add drug test in the list, so that it will further propel reduction in the prevalence?\nHe said the NDLEA had been partnering relevant agencies in its fight against drug abuse, urging parents to rise up to the challenge of sensitising their children against the danger of drug abuse."
  },
  {
    "headline": "AfreximBank loans to Nigeria rise to $5.5bn",
    "summarized_story": "By Chinwendu ObienyiTotal loan approvals to Nigeria from Afreximbank has now risen to N5.5billion representing 26.8 per cent of its African portfolio.\nThis was even as it gave approval to $1.89billion in the last eight 8 months.\nThe Executive Vice President, Corporate Governance and Legal Services at Afreximbank, Dr George Elombi, disclosed this during the intra-African Trade Fair 2021 official Nigeria high level roadshow which held in Lagos on Monday.\nHe noted that Afreximbank being the organiser of the Intra-African Trade Fair in Durban, has supported and facilitated trade and investments in Nigeria through its array of financial and non-financial instruments.\n“From January to August 2021, total loan approvals for Nigeria were in excess of $1.89 billion and at the end of August 2021, the bank’s total loans exposure to Nigeria was $5.5 billion, representing 26.8 per cent share of the bank’s total loans and advances.”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Olorunyomi, Fashola, Monguno, Irabor, Kyari for editors’ security confab",
    "summarized_story": "Other promoters are Nigeria Deposit Insurance Company (NDIC), Federal Inland Revenue Service (FIRS) and the Yobe State government.\nOlorunyomi, an accomplished internationally acclaimed investigative journalist and journalism teacher, would give the keynote address that would be discussed by security chiefs, including Monguno; Irabor; Director-General, Department of State Services (DSS), Mr. Yusuf Bichi and the Inspector-General of Police, Mr. Usman Baba.\n“A doyen of the media, Mr. Ray Ekpu, would chair the opening session with Fashola and others, including President, Nigeria Union of Journalists (NUJ), Mr. Chris Isiguzo, and foreign ambassadors giving goodwill messages.\nNoted broadcaster, Ms. Kadaria Ahmed, would chair the session’’, the statement added.\nOver 300 editors and media owners – from print, broadcast stations and online newspapers have registered for this year conference."
  },
  {
    "headline": "Buhari, Obasanjo, Jonathan, Akinyemi Mourn Powell, Commiserate with US Govt",
    "summarized_story": "In a statement by his Special Assistant on Media, Kehinde Akinyemi, Obasanjo said, “General Powell’s tenure in office marked a significant departure from the traditional relations between Africa and the United States.\n“He was Secretary of State under the administration of President George W. Bush, Jnr, part of the time I was President of Nigeria.\nHis articulation of the Powell Doctrine gave the United States, and the world at large, a new paradigm for engaging in military action with honour and decorum.\nAkinyemi said he had argued then that there could be circumstances when only overwhelming force could win a war (a sort of Colin Powell doctrine).\nBoth Arise Magazine and the Africa Rising Festival, ultimately gave rise to the fast rising television station of global standard, Arise News Channel."
  },
  {
    "headline": "Bandits Massacre 40 in Sokoto Market, Buhari Declares Total War",
    "summarized_story": "But in Kaduna State, security forces reportedly killed 10 bandits in Kwanan Bataru, Giwa Local Government Area.\nHe argued that the reality of declining insecurity should replace the inaccurate narrative of rising insecurity in the country.\nOne of the sheds used by the bandits to hold hostages was burnt.”Bandits Attack Sokoto Sunday Market, Kill 40No fewer than 40 people were killed as suspected bandits attacked a market in Goronyo Local Government Area of Sokoto State.\nSuspected bandits also killed 20 persons at Ungwan Lalle market, in Sabon Birni Local government Area of Sokoto State.\nThe Sokoto State government had earlier ordered the closure of markets in the Eastern Senatorial District of the state as a measure to fight the rising insecurity in the state."
  },
  {
    "headline": "Upstream Commission, Midstream/Downstream Authority Formally Begin Operations",
    "summarized_story": "The development signaled the official winding up of three agencies which they succeeded as prescribed by the Petroleum Industry Act (PIA).\nHe explained that after a rigorous screening process and the issuance of letters of appointment to the new chief executives, both regulatory agencies have now taken off with competent leadership.\nIt also repeals the DPR Act, the Petroleum Inspectorate Act and the Petroleum Equalisation Act and the PPPRA Act.\nThe authority has staffing coming from the defunct PEF, PPPRA and the DPR and of course the commission staff will come from the DPR.\nThis will lead to industrialisation, job creation and our main focus is to attract investment in gas."
  },
  {
    "headline": "Colin Powell, Former US Secretary of State, Dies of Covid Complications",
    "summarized_story": "By Michael Olugbode in Abuja with Agency reportCOVID-19 took one of its greatest casualties with the death of former US Secretary of State Colin Powell who according to his family died aged 84 of the pandemic complications.\nPowell was a former top military officer who rose to become the first African-American secretary of state in 2001 under Republican George W Bush.\nA statement from the family said: “We have lost a remarkable and loving husband, father, grandfather and a great American.\nThe statement said that Powell had been fully vaccinated against COVID-19.\nIt’s painful now,” Mr Powell told ABC News in 2005."
  },
  {
    "headline": "WSJ: How Nigerian Military Bought Back Anti-aircraft Gun from Kidnapping Gang",
    "summarized_story": "The report alleged that kidnapping gangs that encamped in Nigeria’s Rugu forest had seized the anti-aircraft gun during a clash with a military unit.\nWSJ further alleged that over several months, the militant leader had agreed to part with the truck-mounted 12.7 millimetre anti-aircraft gun in exchange for the ransom.\nThe Nigerian Police last month said they arrested three suspects in the kidnapping of students from Bethel Baptist School in Kaduna State.\nThe Nigerian military opened a new offensive last month, bombarding forest encampments with airstrikes from US-delivered jet fighters.\nEventually, WSJ said, the bandits strapped the antiaircraft gun across two motorbikes and began to wheel it out of the camp."
  },
  {
    "headline": "Nnamdi Kanu, Sunday Igboho More Popular Than All Politicians Put Together –Ex-Vice Presidential Candidate, Peter Obi",
    "summarized_story": "A former Vice Presidential candidate of the Peoples Democratic Party (PDP), Peter Obi has described embattled secessionist leaders, Nnamdi Kanu and Sunday Igboho as more popular than all politicians put together in their respective regions.\nBoth Igboho and Kanu had agitated for Nigeria’s break-up and both are currently languishing in detention.\nHowever, according to Obi, a former Governor of Anambra State, Igboho and Kanu were made popular by their messages because of the dearth of hope for the Nigerian populace.\n“In the South-West, Sunday Igboho is far more popular than all the politicians put together.\n“In the South-East, Nnamdi Kanu is far more popular than all the politicians put together."
  },
  {
    "headline": "Nnamdi Kanu, Sunday Igboho More Popular Than All Politicians Put Together –Ex-Vice Presidential Candidate, Peter Obi",
    "summarized_story": "A former Vice Presidential candidate of the Peoples Democratic Party (PDP), Peter Obi has described embattled secessionist leaders, Nnamdi Kanu and Sunday Igboho as more popular than all politicians put together in their respective regions.\nBoth Igboho and Kanu had agitated for Nigeria’s break-up and both are currently languishing in detention.\nHowever, according to Obi, a former Governor of Anambra State, Igboho and Kanu were made popular by their messages because of the dearth of hope for the Nigerian populace.\n“In the South-West, Sunday Igboho is far more popular than all the politicians put together.\n“In the South-East, Nnamdi Kanu is far more popular than all the politicians put together."
  },
  {
    "headline": "Nnamdi Kanu, Sunday Igboho More Popular Than All Politicians Put Together –Ex-Vice Presidential Candidate, Peter Obi",
    "summarized_story": "A former Vice Presidential candidate of the Peoples Democratic Party (PDP), Peter Obi has described embattled secessionist leaders, Nnamdi Kanu and Sunday Igboho as more popular than all politicians put together in their respective regions.\nBoth Igboho and Kanu had agitated for Nigeria’s break-up and both are currently languishing in detention.\nHowever, according to Obi, a former Governor of Anambra State, Igboho and Kanu were made popular by their messages because of the dearth of hope for the Nigerian populace.\n“In the South-West, Sunday Igboho is far more popular than all the politicians put together.\n“In the South-East, Nnamdi Kanu is far more popular than all the politicians put together."
  },
  {
    "headline": "Oyo Governor Splashes Millions Of Naira On Cars For Party Leaders Amidst Plot To Impeach His Deputy",
    "summarized_story": "He also used the occasion to urge other governors in the country to emulate the uniqueness of Governor Makinde.\nSee Also Exclusive EXCLUSIVE: Plot To Impeach Oyo Deputy Governor Advances, Governor Makinde To Discuss Move With Oyo Lawmakers In Ghana“In their various reactions, the duo of Hon.\nJust last weekend, a petrol station and bakery belonging to the Deputy Governor were vandalised in Ibadan.\nHe hails from Igboho, one of the numerous towns in Okeogun, the second-largest geo-political zone in Oyo State, after Ibadan, the state capital.\n“Governor Makinde initially wanted to fulfil his promise but was soon misled by the likes of Alleluyah and co."
  },
  {
    "headline": "Oyo Governor Splashes Millions Of Naira On Cars For Party Leaders Amidst Plot To Impeach His Deputy",
    "summarized_story": "He also used the occasion to urge other governors in the country to emulate the uniqueness of Governor Makinde.\nSee Also Exclusive EXCLUSIVE: Plot To Impeach Oyo Deputy Governor Advances, Governor Makinde To Discuss Move With Oyo Lawmakers In Ghana“In their various reactions, the duo of Hon.\nJust last weekend, a petrol station and bakery belonging to the Deputy Governor were vandalised in Ibadan.\nHe hails from Igboho, one of the numerous towns in Okeogun, the second-largest geo-political zone in Oyo State, after Ibadan, the state capital.\n“Governor Makinde initially wanted to fulfil his promise but was soon misled by the likes of Alleluyah and co."
  },
  {
    "headline": "Bitcoin surges above $64,000 as first crypto-linked ETF lists on NYSE",
    "summarized_story": "The price of Bitcoin surged, near the all-time high after ProShares Bitcoin Strategy ETF, the first bitcoin-linked exchange-traded fund (ETF) listed on the New York Stock.\nAdvertisementOn Tuesday, Bitcoin rose 4.58 percent or $2812, trading $64,241 up 4.22% over the past 24 hours, according to CoinMarketCap.\nProShares Bitcoin listing has been described as a new milestone in cryptocurrency’s journey toward the financial mass market.\nThe ETF primarily invests in bitcoin futures contracts, betting on the future prices of bitcoin instead of the cryptocurrency.\nProShares, in a statement on Monday, said BITO’s launch would offer investors an opportunity to gain exposure to Bitcoin returns through a brokerage account."
  },
  {
    "headline": "Bitcoin surges above $64,000 as first crypto-linked ETF lists on NYSE",
    "summarized_story": "The price of Bitcoin surged, near the all-time high after ProShares Bitcoin Strategy ETF, the first bitcoin-linked exchange-traded fund (ETF) listed on the New York Stock.\nAdvertisementOn Tuesday, Bitcoin rose 4.58 percent or $2812, trading $64,241 up 4.22% over the past 24 hours, according to CoinMarketCap.\nProShares Bitcoin listing has been described as a new milestone in cryptocurrency’s journey toward the financial mass market.\nThe ETF primarily invests in bitcoin futures contracts, betting on the future prices of bitcoin instead of the cryptocurrency.\nProShares, in a statement on Monday, said BITO’s launch would offer investors an opportunity to gain exposure to Bitcoin returns through a brokerage account."
  },
  {
    "headline": "#EndSARSMemorial: Falana tackles police, says only governors have power over rallies",
    "summarized_story": "Femi Falana, a senior advocate of Nigeria (SAN), says state governors — not the police — are in charge of rallies.\nAdvertisementHe said state governors are vested with the power to “manage public meetings, rallies and processions” under the Public Order Act.\nAdvertisement“Consequently, while the state governors set up the judicial commissions for each of the states the panel instituted by the President was limited to the federal capital territory.\n“In view of the foregoing, governors should take control of the security situation in all states of the federation.\nIn particular, state governors should henceforth exercise the exclusive powers conferred on them to manage public meetings, rallies and processions in line with the provisions of the Public Order Act and the relevant judicial authorities."
  },
  {
    "headline": "#EndSARSMemorial: Falana tackles police, says only governors have power over rallies",
    "summarized_story": "Femi Falana, a senior advocate of Nigeria (SAN), says state governors — not the police — are in charge of rallies.\nAdvertisementHe said state governors are vested with the power to “manage public meetings, rallies and processions” under the Public Order Act.\nAdvertisement“Consequently, while the state governors set up the judicial commissions for each of the states the panel instituted by the President was limited to the federal capital territory.\n“In view of the foregoing, governors should take control of the security situation in all states of the federation.\nIn particular, state governors should henceforth exercise the exclusive powers conferred on them to manage public meetings, rallies and processions in line with the provisions of the Public Order Act and the relevant judicial authorities."
  },
  {
    "headline": "Traditional rulers shot dead during meeting in Imo",
    "summarized_story": "Three traditional rulers were killed on Tuesday after gunmen invaded Nnenasa community, Njaba LGA of Imo state.\nAdvertisementThe traditional rulers were said to be holding a meeting in the area when the gunmen attacked.\n“Yes, we have gotten the report and it is only three traditional rulers that died in the attack,” he said.\nTraditional rulers who sustained injuries in the incident were said to have been “rushed to a hospital for treatment”.\nImagine killing our revered traditional rulers like they are nothing."
  },
  {
    "headline": "Who’s afraid of crypto-salaries?",
    "summarized_story": "Back in 2015, its current president, Muhammadu Buhari, campaigned on a promise to increase the value of the naira.\nThis plunge in the value of the naira has been majorly fueled by Nigeria importing more goods than it exports.\nWith 96% of the crypto value coming from outside the continent, this suggests that more Africans are receiving remittances via crypto.\nThis is the company battling the challenge that comes with paying employees in crypto, as legal barriers in many countries prevent this.\nSome of the barriers include the non-recognition of cryptocurrency as a legal tender and the challenge of calculating taxes when employees are paid in cryptocurrency."
  },
  {
    "headline": "Editi Effiong: father, writer, producer and tech bro",
    "summarized_story": "When asked how he would define himself, he responded with, “I’m a father, writer, producer, and tech bro.\nThe big picture: Editi Effiong is not your average guyMany people know Editi Effiong as the brains behind Anakle.\nAnakle Films’ theatrical releases, Up North and The Setup, were acquired by Netflix in 2019 and 2020 respectively.\nIn 2011, digital marketing didn’t have as much clout as it does now.\nEspecially knowing that you were going to put a lot of time and effort into building out Anakle Films’ brand?"
  },
  {
    "headline": "“We weren’t motivated to become a unicorn”: Wave’s West Africa head reflects on startup’s rapid growth",
    "summarized_story": "Coura: In the early days, we were just a bunch of people who were passionate about building a better mobile money service.\nIn those early days, we had so many iterations and did many pilot tests before we actually launched our mobile money service.\nSecondly, we’ve seen high user adoption thanks to our simple, easy-to-use, and highly adapted mobile money product.\nThey are pro-innovation and pro-technology and were willing to support us in our mission to transform mobile money for the better.\nCoura: Africa’s mobile money market is gigantic!"
  },
  {
    "headline": "I promise it’s funnier in Swahili…Kenyan Comedian Eddie Butita is Showing Netflix How Swahili’s Done",
    "summarized_story": "To roll out this project, the $25 billion company enlisted the help of celebrated Kenyan comic, Eddie Butita.\nButita is skilled at wielding digital technology in a market that’s grown so big that Netflix can’t ignore it.\nAccording to the Worldwide Mobile Data Pricing (2021) report from Cable, a British technology research firm, Kenya takes the lead as the most expensive country for mobile data in East Africa.\nViewing one hour of Netflix content on low resolution (480p) uses 300 MB of data per hour; in high resolution (1080p), Netflix uses 3 GB per hour.\nAt an average cost of $1.05 per GB of data, Netflix viewers in Kenya stand to pay anywhere from $0.32 to $3.15 to watch a one-hour show."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, I'm sure today's header might have warned you what to expect.\nBrace yourself for an exciting lineup of news..."
  },
  {
    "headline": "Nigerian clean energy startup, Homefort Energy, wants to make sure you never have cooking gas worries again",
    "summarized_story": "“Our smart metre’s tamper-proof feature achieves over 95% customer retention by preventing unauthorised retailers from refilling their cylinders,” Owosho says.\nAs a result, when a customer runs out of gas, Homefort notifies them and schedules a delivery.\nMoreover, barcode tags on Homefort cylinders allow them to track the age and health of the cylinders in real-time.\nTo gain access to Homefort, users must first install the Homefort app, available for both Android and iOS systems.\nNew users who do not have cylinders or whose cylinders are more than eight years old must purchase Homefort cylinders."
  },
  {
    "headline": "African healthtech startup, Healthtracka, gets into Techstars Toronto Accelerator programme",
    "summarized_story": "Share this article:Healthtracka, a Nigeria-based healthtech startup decentralised laboratory testing in Africa by providing at-home tests and digital results, has announced joining the Techstars Toronto Accelerator programme.\nAdvertisementHow does it feel to get into Techstars Toronto?\nSeeing a global accelerator like Techstars also identifying with us and backing us is exciting.\nI will recommend that every founder joins a global accelerator for the sake of themselves and their companies.\nAccording to Sunil Sharma, Managing Director of Techstars Toronto, the nature of the problem that Healthtracka is looking to solve was a major attraction."
  },
  {
    "headline": "Blockchain for governance, Sendbox’s $1.8 million seed, Uber’s ride-sharing service",
    "summarized_story": "Share this article:Good day,What I’m discussing:Blockchain for governanceSendbox’s $1.8 million seedUber’s ride-sharing serviceBlockchain for governanceWhen we hear of blockchain, Bitcoin most likely comes to mind.\nSource: TechCrunchOn Monday, October 18, 2021, Nigerian eCommerce startup, Sendbox announced its $1.8 million seed round from 4DX Ventures, Enza Capital, Flexport, Y Combinator, FJ Labs, and Golden Palm Investments.\nUber is testing its ride-sharing service in KenyaRide-hailing company, Uber, is reportedly testing a new ride-sharing option, Pool Chance.\nThis is the first time the service has been introduced by the startup in Africa and is similar to UberPool.\nWith Pool Chance, users can get a discount if the driver picks up another rider."
  },
  {
    "headline": "Household spending surpasses pre-pandemic levels yet Nigerians poorer",
    "summarized_story": "Household consumption has surpassed pre-pandemic levels because Nigerians have to pay more for goods and services and not because they are earning more.\nIt consists of the expenditure incurred by resident households on individual consumption goods and services.\n“Those have boosted investment spending a bit but we still need to see more to drive growth,” Abimbola said.\nThe four components of the GDP are household consumption, private investment, government spending, and net exports.\n(X-M) shows the difference between domestic spending on foreign goods (i.e., imports) and foreign spending on domestic goods (i.e., exports)."
  },
  {
    "headline": "EIU sees Nigeria economy at 7yr-high as oil production recovers in 2022",
    "summarized_story": "Nigeria’s economic growth will quicken in 2022 to a seven-year high of 3.3 percent before rising further by 3.8 percent and 3.9 percent in 2023 and 2024 respectively, as crude oil production recovers from a record low this year, the Economist Intelligence Unit said in a report Tuesday.\nIf the economy expands as predicted by EIU, it will also mark the first time Africa’s biggest oil producer has expanded faster than population growth rate since 2015, snapping six straight years of decline that has thrown more Nigerians into the poverty pit.\nImproving oil production will serve as a trigger for other factors likely to boost growth in those years, according to the EIU.\nA devaluation of the naira is also likely to happen in that period, according to the EIU team.\nDespite a slowdown in the last six months, headline inflation in Nigeria remains at over 16 percent as against the CBN’s target of between 6-9 percent."
  },
  {
    "headline": "Without jobs, protests like #EndSARS can reoccur – Analysts",
    "summarized_story": "Without jobs there are possibilities that the EndSARS protest that saw the Nigerian economy losing billions of naira in October 2020 could reoccur, analysts say.\nSo, if they engage themselves with more roles in digital marketing and work with organisations to increase their digital presence, that can generate jobs,” Oyelade added.\nRead Also: Has anything changed since #EndSARS protests hit Nigeria?\nThe knowledge they have acquired to make them educated, they can input that into the skills and that will bring innovation.\nWhen that is done people will be busy, reducing the reliance on the government for jobs,” Sholarin further said."
  },
  {
    "headline": "Eid-El-Maulud: Obaseki harps on tolerance, peaceful coexistence – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – I join our Muslim brothers and sisters in Edo State in celebrating the birth of Prophet Mohammed (S.A.W.)\nThe Eid-El-Maulud celebration offers us the opportunity to ponder on the importance of peaceful coexistence and tolerance.\nThe spirit of the Eid-El-Maulud celebration should guide us in working together and with a common drive to build strong coalitions that will entrench development and progress in our state.\nI reassure the Muslim faithful that our administration remains committed to ensuring the welfare and peaceful co-existence of all residents.\nGodwin ObasekiGovernor, Edo State..."
  },
  {
    "headline": "Edo, APOI, other stakeholders validate guidelines to drive investment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – To sustain a friendly business environment and capital inflows, the Edo State Government has engaged Africa Palm Oil Initiative (APOI), Proforest and other stakeholders to develop and validate the Free Prior Informed Consent (FPIC) guidelines so as to improve investors’ confidence.\n“The law would boost the confidence of investors and communities to ensure that they know what it requires to secure investment in the state,” he noted.\n“When the document is passed into law, investors would now have the confidence to come in knowing exactly what to do to stake their investment.\nThe FPIC law will also let them know the role of government and what it will do to back their investment in terms of profitability as no investors will be able to cut corners when it comes to investment in Edo State.\n“We really want to have a situation where the communities, local and state governments will work in harmony, as stipulated in the FPIC documents.”..."
  },
  {
    "headline": "Edo police mobilize 3,000 personnel for Eid-Maulud – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY-Edo Police Command has said that it had deployed over 3,000 personnel to provide adequate security for lives and property before, during and after today’s Eid-El Maulud in the state.\nThe command assured that security had been beefed up around mosques and event centres across Edo State.\nThis was made known in a press release signed by the command Public Relations Officer SP Kontongs Bello and made available to journalists in Benin City.\nThe statement wishes Muslim faithful a happy Eid-El Maulud, it however enjoined them to celebrate within the armpit of the law and relevant COVID-19 protocols.\nIt however urged anyone in distress to call Edo State Police Command Control Room through the following numbers: 08037646272, 08123827225, 08056776365 and 08077773721."
  },
  {
    "headline": "World Food Day: Obaseki urges innovation to tackle food security, assures more support for smallholder farmers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for innovations to tackle all challenges threatening food sufficiency, ensuring farmers and other stakeholders in the agricultural value chain increase agricultural productivity and achieve food security.\nObaseki gave the charge in commemoration of World Food Day, marked yearly by the Food and Agriculture Organisation (FAO), and other organs of the United Nations (UN).\nSpeaking on the theme of this year’s World Food Day, ‘Our actions are our future’, Obaseki called on everyone to be a food hero contributing to the transformation of agri-food systems and ensuring enough food for the global population.\nA similar intervention programme was undertaken in Warrake Community, Owan East Local Government Area on a 500ha farmland.\n“In Usugbenu, Ugboha and Sobe communities in Esan Central, Esan Southeast and Owan West, respectively, we empowered 1,500 farmers on the production of maize."
  },
  {
    "headline": "Nine governors, ministers, others to discuss security at Editors’ conference",
    "summarized_story": "Nine governors will participate at the 17th All Nigeria Editors’ Conference which opens in Abuja on Thursday.\nThe governors are Ifeanyi Okowa (Delta); Nasiru El-Rufai (Kaduna); Yahaya Bello (Kogi); Seyi Mankide (Oyo); Bello Matawalle (Zamfara); Babagana Zulum (Borno), and David Umahi (Ebonyi).\nIt said the governors invited to be part of the conversation are those whose states are facing security challenges.\nThe afternoon session with the theme, ‘’Security Challenges: Recovering Lost Grounds’’, which the statement explained, would be attended by state governors, will be chaired by Mr Magashi.\nOver 300 editors and media owners – from print, broadcast stations and online newspapers, according to the statement, are attending the conference."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Unknown gunmen kill three traditional rulers in Imo",
    "summarized_story": "At least three traditional rulers were on Tuesday, killed after gunmen invaded Nnenasa community, Njaba LGA of Imo state, Southeast Nigeria.\nThe traditional rulers were said to be holding a meeting in the area when the gunmen attacked.\nWhile three were killed instantly, several others sustained varying degrees of injuries and were rushed to hospital.\nMichael Abattam, spokesperson of the Imo police command, who confirmed the incident, said, “Yes, we have gotten the report and it is only three traditional rulers that died in the attack.”"
  },
  {
    "headline": "How FirstBank Employees Making a Difference Through the SPARK Initiative",
    "summarized_story": "FirstBank always considers the impact of all its operations and actions on customers and other stakeholders, including the environment, to ensure it is making a net positive difference in the end.\nAnd this orientation has attracted to the bank people who share a similar outlook – whether as employees, partners or other stakeholders.\nThe Start Performing Acts of Random Kindness (SPARK) Initiative is but one such initiative.\nAmong employees SPARK has inspired and encouraged kindness and empathy as well as consideration for others.\nWe should look to see if we can identify situations where we, not government or Nigeria, can make a difference."
  },
  {
    "headline": "New Customs Controller, Nnadi takes charge of Ogun Areas Command 1",
    "summarized_story": "A newly promoted Comptroller of Customs, Mr. Dera Nnadi, has assumed office as the Controller in charge of the Nigerian Customs Service (NCS), Ogun Area Command 1.\nNnadi, until his appointment, served in the Command as Deputy Comptroller in charge of Administration.\nKolo handed over the mantle of leadership to his successor on Monday at the Conference Room of the Command.\nIn his handing over speech, Kolo expressed his gratitude to the principal and entire officers for their unflinching support and cooperation through his stay at the Ogun Area Command 1.\nHe congratulated the new CAC and described his appointment as a round peg in a round hole."
  },
  {
    "headline": "Hawks, FBI arrest eight Nigerians over internet love scam in South Africa",
    "summarized_story": "Hawks and US Federal Bureau of Investigation (FBI) in a massive operation in Cape Town, South Africa on Tuesday, arrested eight Nigerians, aged between 33 and 52 for Internet scams, money laundering and wide scale financial fraud.\n“The suspects in this investigation are alleged to have ties to a transnational organised crime syndicate originating in Nigeria,” she said.\nThe suspects used social media websites, online dating websites to find and connect with their victims, IOL reported.\nOther modus operandi used by the suspects includes business email compromise, where email accounts are diverted in order to change banking details.\nWe are confident that this investigation will have a significant impact on this region and beyond,” said Mogale."
  },
  {
    "headline": "HACEY Hails Osun Govt For Signing VAPP Law",
    "summarized_story": "A non-governmental organisation, HACEY Health Initiative has applauded Osun State governor, Adegboyega Oyetola, for assenting into law, the Violence Against Persons Prohibition (VAPP) Bill on Monday.\nTimothy Owoeye; the Executive Director of HACEY Health Initiaitve, Rhoda Robinson; the State FGM coordinator, Toyin Adelowokan; the StopCut project lead, Oluwatomi Olunuga; HACEY Osun state coordinator, Ayobami Alabi; and the HACEY’s communication officer, Titilayo Fakeye.\nRobinson also noted that Osun State has made progress in reducing the prevalence of the FGM even as she encouraged the state government to intensify its efforts especially in endemic local government areas.\nResearch conducted by HACEY revealed that over 35% of women in Osun have a girl-child who has been circumcised, with the highest proportion reported in Ife North LGA (54.2%) closely followed by Iwo LGA (47.7%).\nConfirming the development, the First Lady of Osun State, Kafayat Olaitan Oyetola, said, “Today His Excellency, Governor Adegboyega Oyetola, signed the Osun Violence Against Persons Prohibition (VAPP) Law at the Governor’s Office, Abere.”It added that the law will serve as a key tool for the crusade and fight for the elimination of all forms of violence against girls and women."
  },
  {
    "headline": "HACEY Hails Osun Govt For Signing VAPP Law",
    "summarized_story": "A non-governmental organisation, HACEY Health Initiative has applauded Osun State governor, Adegboyega Oyetola, for assenting into law, the Violence Against Persons Prohibition (VAPP) Bill on Monday.\nTimothy Owoeye; the Executive Director of HACEY Health Initiaitve, Rhoda Robinson; the State FGM coordinator, Toyin Adelowokan; the StopCut project lead, Oluwatomi Olunuga; HACEY Osun state coordinator, Ayobami Alabi; and the HACEY’s communication officer, Titilayo Fakeye.\nRobinson also noted that Osun State has made progress in reducing the prevalence of the FGM even as she encouraged the state government to intensify its efforts especially in endemic local government areas.\nResearch conducted by HACEY revealed that over 35% of women in Osun have a girl-child who has been circumcised, with the highest proportion reported in Ife North LGA (54.2%) closely followed by Iwo LGA (47.7%).\nConfirming the development, the First Lady of Osun State, Kafayat Olaitan Oyetola, said, “Today His Excellency, Governor Adegboyega Oyetola, signed the Osun Violence Against Persons Prohibition (VAPP) Law at the Governor’s Office, Abere.”It added that the law will serve as a key tool for the crusade and fight for the elimination of all forms of violence against girls and women."
  },
  {
    "headline": "JUST-IN: Gunmen Storm Traditional Rulers’ Meeting, Kill 5 In Imo",
    "summarized_story": "No fewer than five traditional rulers have been reportedly killed during an attack by gunmen at Nnenasa community headquarters of Njaba local government area of Imo State.\nAccording to sources, the traditional rulers from the area numbering about 20 were in a meeting at the local government headquarters in the community when gunmen invaded the the venue, interrupted the meeting with sporadic gunshots and killed at least five traditional rulers on the spot.\nThose who sustained gunshot injuries have been rushed to nearby hospital for treatment.\nWhen contacted, the Imo State Police Public Relations Officer, Mike Abatam, confirmed the attack, saying only three traditional rulers died.\nDetails Later…"
  },
  {
    "headline": "JUST-IN: Gunmen Storm Traditional Rulers’ Meeting, Kill 5 In Imo",
    "summarized_story": "No fewer than five traditional rulers have been reportedly killed during an attack by gunmen at Nnenasa community headquarters of Njaba local government area of Imo State.\nAccording to sources, the traditional rulers from the area numbering about 20 were in a meeting at the local government headquarters in the community when gunmen invaded the the venue, interrupted the meeting with sporadic gunshots and killed at least five traditional rulers on the spot.\nThose who sustained gunshot injuries have been rushed to nearby hospital for treatment.\nWhen contacted, the Imo State Police Public Relations Officer, Mike Abatam, confirmed the attack, saying only three traditional rulers died.\nDetails Later…"
  },
  {
    "headline": "BREAKING: 50 Bandits Killed In Ground, Air Assaults In Kaduna",
    "summarized_story": "The Kaduna State government said in an inspiring success for the security forces, over 50 bandits have been neutralised during a combined ground and air assaults in the Saulawa-Farin Ruwa axis of Birnin Gwari LGA of the state.\nAccording to operational feedback to the Kaduna State government from the Command of the Joint Operations, a Nigerian Air Force helicopter gunship provided close air support to ground troops advancing from the Dogon Dawa-Damari-Saulawa axis.\nThey were engaged vigorously by the helicopter gunship, and were wiped out.\nADVERTISEMENT“A second helicopter gunship joined the operations, and many more fleeing bandits were neutralized by precise strikes.\nAssessment revealed that more than 50 bandits were neutralized during the joint operation,” Aruwan said."
  },
  {
    "headline": "EndSARSAnniversary: Lagos police begin show of force",
    "summarized_story": "The Lagos State Police Command on Tuesday began a show of force to warn those planning on staging #EndSARS memorial protests in the state on October 20, 2021.\nThe activists behind the planned protests have stated that they will be having a car procession in honour of those believed to have lost their lives during the #EndSARS protests of October 2020.\nThe car procession will drive through the Lekki tollgate in Lagos which was the epicentre of the protests last year.\nThe epicentre of the protests was the Lekki tollgate in Lagos where many youths gathered day and night to air their grievances against police brutality and bad governance.\nThis was followed by the destruction of private and public properties by hoodlums in Lagos, an incident that informed the latest warning issued by the police in the state."
  },
  {
    "headline": "EndSARSAnniversary: Lagos police begin show of force",
    "summarized_story": "The Lagos State Police Command on Tuesday began a show of force to warn those planning on staging #EndSARS memorial protests in the state on October 20, 2021.\nThe activists behind the planned protests have stated that they will be having a car procession in honour of those believed to have lost their lives during the #EndSARS protests of October 2020.\nThe car procession will drive through the Lekki tollgate in Lagos which was the epicentre of the protests last year.\nThe epicentre of the protests was the Lekki tollgate in Lagos where many youths gathered day and night to air their grievances against police brutality and bad governance.\nThis was followed by the destruction of private and public properties by hoodlums in Lagos, an incident that informed the latest warning issued by the police in the state."
  },
  {
    "headline": "Three persons missing, as two-storey building collapses in Lagos community",
    "summarized_story": "Three people were missing while two others were rescued at Haruna area, in Ikorodu, Lagos state after a two-storey building collapsed.\nThe three missing persons were suspected to be trapped in the collapsed building though details about the incident were sketchy at press time.\nThe Acting Coordinator, National Emergency Management Agency NEMA, Lagos State, Ibrahim Farinloye who confirmed the incident to Vanguard said NEMA, Police, Lagos State Emergency Management Agency LASEMA, Lagos State Fire and Rescue Service and other relevant agencies are currently searching for those suspected to be trapped in the building.\nHe said the incident occurred at about 10 pm but it could not be ascertained if any life was lost.\n3 are suspected to be missing and trapped presently”.VanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Three persons missing, as two-storey building collapses in Lagos community",
    "summarized_story": "Three people were missing while two others were rescued at Haruna area, in Ikorodu, Lagos state after a two-storey building collapsed.\nThe three missing persons were suspected to be trapped in the collapsed building though details about the incident were sketchy at press time.\nThe Acting Coordinator, National Emergency Management Agency NEMA, Lagos State, Ibrahim Farinloye who confirmed the incident to Vanguard said NEMA, Police, Lagos State Emergency Management Agency LASEMA, Lagos State Fire and Rescue Service and other relevant agencies are currently searching for those suspected to be trapped in the building.\nHe said the incident occurred at about 10 pm but it could not be ascertained if any life was lost.\n3 are suspected to be missing and trapped presently”.VanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "EndSARS: We'll deploy all legitimate means to stop planned protests",
    "summarized_story": "Lagos State Commissioner of Police, Hakeem Odumosu has said the command would deploy all legitimate means to stop or neutralise the planned protests to mark #EndSARS anniversary.\n“On the contrary, the police will only allow an indoor and virtual event in commemoration of the EndSARS anniversary and will provide adequate security at the venue (s) if known.\n“We wish we could permit such street protests.\nThe statement added that “It is acknowledged that citizens have the right to peaceful protests.\nIt will not stand aloof and allow breakdown of law and order which the protests may cause."
  },
  {
    "headline": "Tech entrepreneur, Favour Ori breaks record in Rwanda",
    "summarized_story": "Payday, a Pan-African Fintech startup, founded by Nigerian entrepreneur, Favour Ori has become the first Rwandan company to join the prestigious Techstars Toronto Accelerator program.\nThe 3-month accelerator program’s goal is to provide entrepreneurs with invaluable skills, resources, and connections to a large pool of global talent and investors.\nCEO, Favour Ori said, “Joining Techstars will be a game-changer for us.\nThe word that best describes the founders and team behind Payday is “resilient”.\n“We are thrilled to be able to co-invest with some of the best early-stage fintech and e-commerce investors in Africa” says Sharma."
  },
  {
    "headline": "BREAKING: Police Ban End SARS Protest In Lagos",
    "summarized_story": "End SARS protests slated for Wednesday in Lagos have been banned by the Lagos State Police Command.\nThe security agency stated that it never agreed to allow street protests on the 20th anniversary of the past year’s march, which claimed many lives.\nAdekunle Ajisebutu, the Public Relations Officer, said on Tuesday that only indoor and virtual meetings will be permitted.\nDue to competing interests and the possibility of mayhem, any type of street demonstration is now illegal, according to Ajisebutu.\n“The police will not abdicate the protection of lives and property by allowing avoidable incidents”, the PRO added."
  },
  {
    "headline": "Sanwo-Olu Meets Artist Bodataiye Oniyakuya: Receives Funny Potrait Of Himself.",
    "summarized_story": "Lagos State Governor Babajide Sanwo-Olu has finally been presented with his caricature, days after daring Boda Taiye Oniyakuya, the comic artist who made a mockery of the Governor’s official portrait.\nMidweek, Boda Taiye Oniyakuya became a social media sensation after a viral post showing the Governor’s caricature.\nThere are several of Boda Taiye Oniyakuya that we need to bring out to showcase to the world.\nThis is to help young people develop their abilities and give them choices.”The Governor received the drawing and reward the artist for his effort.\nVisibly excited after meeting the Governor, Boda Taiye Oniyakuya, who attended the event with his twin brother, thanked Sanwo-Olu for encouraging his talent."
  },
  {
    "headline": "Sokoto Massacre: Attack Callous, Painful, Regrettable – Gov Obaseki.",
    "summarized_story": "Mr. Godwin Obaseki, the governor of Edo State, reacted on Tuesday to the bandit raid on Goronyo Market in Sokoto State’s Goronyo Local Government Area, which killed over 43 residents.\nObaseki, in a statement issued by Crusoe Osagie, the Special Adviser to the Edo State Governor on Media and Communication Strategy, commiserated with the people and government of Sokoto State, over the dastardly attack on Goronyo Market by bandits.\nThe governor who described the incident as callous, painful and regrettable, prayed for the repose of the souls of the victims of the attack.\nAccording to him, “We are deeply saddened by the terror attack in Goronyo Market, Sokoto State, which has thrown the entire country into mourning.\n“On behalf of the government and good people of Edo State, I commiserate with the people of Sokoto State and the Governor over this painful incident.”"
  },
  {
    "headline": "BREAKING: 1 Dead, 2 Rescued, 3 Trapped As Two-storey Building Collapses in Lagos [ PHOTOS]",
    "summarized_story": "A two-Storey building has collapsed in the Ikorodu area of Lagos State, News Direct can report.\nAccording to NEMA officials, one person has been confirmed dead while two persons have been rescued.\nThe official added that three other persons are currently trapped under the remains of the collapsed building.\nNEMA could not ascertain if anyone is dead as at press time.\nMeanwhile, rescue operation is ongoing as Labsca, NEMA, Police DMU, and LASEMA are already searching for the trapped peopleSee Photos Below"
  },
  {
    "headline": "Eid-el Maulud: Northern governors preach inter-religious harmony",
    "summarized_story": "Muslim Community across the world marked Eid-el-Maulud Nabyyi (birth of the Holy Prophet Muhammad), with the northern governors calling on Mulslim faithful to emulate the teachings and virtues of the Holy Prophet Mohammed (S.A.W).\nChairman Northern Governors Forum (NGF) and Plateau state Governor Simon Lalong gave the charge in a message in a statement by his director of press, Dr Makut Macham.\nThe NGF said: “The special occasion brings to remembrance the teachings of the Holy Prophet who emphasized love, forgiveness, peaceful coexistence and humility among others.\nMMWGAlso, the Muslim Media Watch Group of Nigeria (MMWG) tasked Nigeria leaders to do things right all times for the nation’s prosperity.\n“The PDP felicitates with Nigerians and wishes them a happy Eid-el Maulud celebration,” the party said."
  },
  {
    "headline": "Insecurity: How gunmen stormed peace meeting, killed 3 Imo monarchs",
    "summarized_story": "Bandits neutralisedAnd in a combined air and ground assaults, troops neutralised over 50 bandits in Birnin Gwari local government area of Kaduna state, the Kaduna state government has said.\n“Over 50 bandits have been neutralized during a combined ground and air assault in the Saulawa-Farin Ruwa axis of Birnin Gwari LGA.\n“After this, armed bandits on about 50 motorcycles were sighted fleeing towards Farin Ruwa, and were struck effectively by the gunship.\nAssessment revealed that more than 50 bandits were neutralised during the joint operation.\n“Governor Nasir el-Rufai expressed his satisfaction at the operational feedback, and congratulated the ground troops and gunship crews on the rout."
  },
  {
    "headline": "Revealed! Identities of 3 monarchs killed when gunmen invaded Imo",
    "summarized_story": "Earlier on Tuesday, we reported that gunmen invaded a stakeholders’ meeting and killed up to three traditional in Njaba local government headquarters of Imo state.\nUp till the time of filling this report, no official press statement has been issued either by the state government or Police authorities.\nUnidentified gunmen had invaded the state Police command and the state headquarters of the Nigeria Correctional Centre located in Owerri and freed many inmates few months ago.\nSince then, there have been reports of gunmen invasion of various Police stations and divisional headquarters within the state, with citizens in continuous fear of the unknown.\nHowever, the state government had assured of its readiness to support various security agencies to curb the menace."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Access Bank, Xploits Consulting celebrate girl child, donate school items in FCT -NigPilot",
    "summarized_story": "In a concerted effort to ensure a better life for the girl child in the country, Access Bank Plc in partnership with Xploits Consulting Ltd has donated learning materials and sanitary items to girls in some schools around the Federal Capital Territory, FCT, to celebrate the International Day of the Girl Child.\nThe project which was titled #keep the girl child in school, reached out to a total of 150 girls.\nFifty girls from each school namely: Junior Secondary School, Gwarimpa, Abuja,Junior Secondary School, Kwali Central, Kwali and Government Secondary School, Giri, Gwagwalada benefited from the project.\nSpeaking further she said the project was supported by Access bank as part of the bank’s corporate social responsibility, CSR, where funds and resources are channeled into impacting people’s lives positively.\nAppreciating the gesture, the principal GSS, Giri, Gwagwalada, Mr. Emmanuel Agbebaku on behalf of the other principals thanked Xploits Consulting and Access Bank Plc for the gifts."
  },
  {
    "headline": "Air Peace gets second safety performance award in three months -NigPilot",
    "summarized_story": "THE West and Central Africa’s largest carrier, Air Peace, has been recognized with the Distinguished Safety Performance Award by the Federal Airports Authority of Nigeria (FAAN).\nThe Spokesperson of the airline, Mr. Stanley Olisa disclosed this in a statement on Friday.\nOlisa said that the award was presented by the Kaduna Airport Manager and Chairperson, Airport Safety Committee, Kaduna International Airport, Mrs. Amina Ozi-Salami, in recognition of Air Peace’s consistent commitment to safety with records of zero accident/serious incidents at the Kaduna International Airport.\nOlisa, expressed gratitude to the airport authorities for the award, adding that it further accentuates the airline’s unwavering stance on 100 percent safety compliance in line with established global standards.\nIn August this year, Air Peace was also conferred with the Gold Standard Safety Award by the National Association of Aircraft and Pilots Engineers (NAAPE), for its safety record and safety system performance as well as outstanding investment in brand new aircraft and equipment."
  },
  {
    "headline": "FG opens more potentials in mining sector as alternative revenue sources -NigPilot",
    "summarized_story": "In line with the diversification agenda of the present administration, more potentials are being opened as alternative sources of revenue generation for the country.\nSpeaking during the foundation laying ceremony of the Gold Souk in Kumbotso Local Government Area in Kano State, Minister of Mines and Steel Development, Arc.\nOlamilekan Adegbite stated that this could not have come at a better time than now.\nHe also disclosed that the event has offered a golden opportunity to highlight the efforts of the present administration to open some of the potentials available in the mining sector to serve as an alternative revenue source.\nSpeaking also at the event, the Governor of Kano State, His Excellency, Dr. Abdullahi Umar Ganduje, said that Kano State was one of the economic commercial centers in Nigeria, the most populous state in the Federation, and historically the center of commerce in the Nation."
  },
  {
    "headline": "Mining is all about data – Adegbite -NigPilot",
    "summarized_story": "Olamilekan Adegbite has disclosed that the knowledge of data of mineral deposits in the country is what makes exploration easier which invariably attracts investment in the Mining and Mineral Sector, generates foreign exchange, and creates employment for the teeming youths, adding that exploration creates wealth along the mineral value chains.\nAdegbite made the disclosure in his office in Abuja recently, at the presentation ceremony of the Committee Preliminary Report on the National Integrated Mineral Exploration Project, NIMEP, led by its Chairman, Dr. Addulrazaq Garuba.\nReceiving the report, which he described as a very good and laudable project, Adegbite explained that NIMEP was designed to provide geosciences data needed for integrated mineral exploration in Nigeria.\nEarlier, the Director-General, Nigerian Geological Survey Agency, NGSA, and Chairman of the Committee on NIMEP, Dr. Abdulrazaq Garuba maintained that NIMEP project faced several challenges such as insecurity, ranging from kidnapping to banditry.\nHe listed other challenges faced by the project as interference by Local Government Areas, community restiveness, amongst others."
  },
  {
    "headline": "UPDATED: At Least Two Killed As Gunmen Open Fire At Traditional Rulers Meeting In Imo",
    "summarized_story": "No fewer than two traditional rulers have been killed during an attack by gunmen at Nnenasa community Headquarters of Njaba local government area of Imo State.\nAccording to sources, the traditional rulers from the area numbering over 20 were in a meeting at the local government headquarters in the community when gunmen invaded the the place and interrupted the meeting with sporadic gunshots.\nSources earlier informed Channels Television that five of the traditional rulers had been killed but when contacted, the Imo state police public relations officer, Mike Abatam, confirmed that only two traditional rulers had died while three others were in a coma.\nREAD ALSO: Go After Criminal Elements In Imo State, Uzodinma Charges TroopsThe murdered traditional rulers include the Obi II of Okwudor, Eze Anayo Durueburoe and the ruler of Ihebineoweri, Okwudor, Eze Samson Osunwa.\nImo State Governor Hope Uzodinma, speaking to Channels Television, condemned the killings and commiserated with the affected families."
  },
  {
    "headline": "Troops Kill 50 Bandits In Kaduna: State Govt",
    "summarized_story": "The Kaduna State Government on Tuesday said no fewer than 50 bandits have been killed by a combined team of security officials during an operation in Birnin Gwari local government area of the state.\nAccording to the Kaduna state Commissioner for internal Security and Home affairs, Samuel Aruwan, a Nigerian Air Force helicopter gunship provided close air support to ground troops advancing from the Dogon-Dawa-Damari-Saulawa axis.\nBut they were engaged vigorously by the helicopter gunship and were wiped out.\nA second helicopter gunship joined the operations, and many more fleeing bandits were neutralized by precise strikes.\nAssessments revealed that more than 50 bandits were neutralized during the joint operation, Aruwan said."
  },
  {
    "headline": "Nigerians Celebrate Eid-ul-Maulud",
    "summarized_story": "Nigerians, especially the Muslim faithful in various parts of the country, are joining their counterparts across the world to celebrate this year’s Eid-ul- Maulud.\nAs the people celebrate, President Muhammadu Buhari, the leadership of the National Assembly, and governors in various states asked Nigerians to continue to live in peace with one another.\nIn his goodwill message on the eve of the celebration, the President congratulated the Muslims in the country, as well as Nigerians of all faiths.\nPresident Buhari also reassured the people of their security, saying the military, police, and intelligence agencies have improved their operations to effectively respond to the challenges in the nation.\nAregbesola, who believes that doing so will guarantee peace and security in the country, asked the people to refrain from violence, lawlessness, and other acts of criminality."
  },
  {
    "headline": "PHOTOS: One Dead, Two Rescued In Ikorodu Building Collapse",
    "summarized_story": "One person has been confirmed killed in a building collapse in the Ikorodu area of Lagos State.\nMeanwhile, emergency officials have carried out controlled demolition of an adjoining building at the site of the collapse.\nThe incident comes four months after one person was killed when a building under construction collapsed in the Isawo area of Ikorodu.\nFew days before the Isawo incident, a five-year-old boy was also killed in a building collapse in the Adeniji Adele area of the state.\nThe Lagos State government through the Lagos State Building Control Agency (LABCA) has been carrying out integrity tests on some buildings across the state."
  },
  {
    "headline": "#EndSARS Anniversary: Police Will Only Allow Vehicular Procession – CP Odumosu",
    "summarized_story": "Ahead of the planned commemoration of the #EndSARS protests of last year, the Lagos State Police Command on Tuesday said it will only allow indoor and virtual events.\nBriefing reporters in Ikeja, the State Commissioner of Police, Hakeem Odumosu, said the police would not allow any form of protest except vehicular procession.\nThe police commissioner cautioned residents, especially the youth against embarking on any form of protest without the approval of the police.\nPolice operatives have been patrolling the streets in armoured tanks and other vehicles ahead of October 20, the day set for the #EndSARS Memorial protests.\nThis is coming a few hours when youths in the country are preparing to commemorate the first anniversary of #EndSARS, a protest movement against police brutality that rocked major cities in the country."
  },
  {
    "headline": "APC registers 1,021,800 members in Zamfara, says exercise was a huge success",
    "summarized_story": "The All Progressives Congress membership registration and revalidation committee in Zamfara state said it has registered one million, twenty one thousand and eight hundred members in the stateThe committee chairman who led the seven man team from the APC National Headquarters Ibrahim Masari said despite security challenges in some areas, the committee was able to deliver on its mandatePresenting the membership registration and committee’s report to Governor Bello Matawalle at the government House in Gusau, he commended the state government for the support given to the committeeOn his part, Governor Bello Matawalle says the revalidation exercise in zamfara was a huge success despite efforts from different quarters to frustrate the processMr. Matawalle adds that anyone who did not register under this committee should not consider himself a member of the APC in Zamfara"
  },
  {
    "headline": "Governor Ortom condoles with Sokoto Gov, families of market attack -",
    "summarized_story": "Benue State governor, Samuel Ortom, has sent a heartfelt condolences to his Sokoto State counterpart, Governor Aminu Waziri Tambuwal, the Government of Sokoto State as well as families of victims of the Goronyo market attack in Goronyo local Government Area of the state by bandits on Sunday night.\nHe described the incident which left more than 30 persons dead and many others injured from the sporadic attacks as sad, unfortunate and shocking.\nThe Governor urged relevant security agencies in the state to ensure that the perpetrators of this dastardly act are apprehended and brought to justice.\nHe said it’s unacceptable, the growing terrorist acts by bandits who are gradually succeeding in destroying the unity and brotherliness of the country through acts of criminality on innocent citizens.\nGovernor Ortom called on the Federal Government to step up its strategies in combating insecurity threatening the corporate existence of the country so that the citizens will begin to live and peace and harmony where development will thrive."
  },
  {
    "headline": "Matawalle felicitates with Muslim Ummah, says it's time for sober reflection -",
    "summarized_story": "Governor Bello Matawalle of Zamfara State felicitates with the Muslim Umma across the globe on the occasion of this year’s Maulud which marks the birthday of the Noble Prophet Muhammad Sallallahu Alaihi WassallamThe Governor says it is a time for sober reflections on the life and times of Prophet MohammedHe urge the Muslims and all Nigerians to continue to pray for the full return of peace in zamfara and the nation in at largeMr. Matawalle assured that his administration will not rest on its oars at ensuring the enthronement of peace and provision of more dividends of democracy to all Irrespective of any differences.\n“I wish to share in the joy like all Muslims on this day when our Prophet Muhammad Sallallahu Alaihi Wassallam was born which is being celebrated by Muslims around the globe and in particular to join the good people of Zamfara state on this special and happy day,” he said.\n” I know that as Muslims we will continue to cherish and imbibe those qualities with the prayer that Allah will reward us with His abundance blessings” Matawalle Prays“I wish to implore the Muslims in particular and the general public to continue to pray for the full return of peace in our dear state and in the nation at large.\n“Your prayers, individually and collectively have brought us to where we are now, with cases of armed banditry, kidnapping and other criminalities drastically reducing and I belief this good work will be sustained for the attainment of lasting peace,” Matawalle added.\nHe assured that his administration will not rest on its oars at ensuring the enthronement of peace and provision of more dividends of democracy to all Irrespective of any difference."
  },
  {
    "headline": "Sanwo-Olu greets Muslims on Maulud Nabiyy, urges them to emulate Prophet Mohammed -",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu has congratulated Nigerian Muslim faithful as they celebrate Maolud Nabiyy, which marks the birthday of Prophet Mohammed (PBUH).\nGovernor Sanwo-Olu in his goodwill message to commemorate the celebration of Maolud Nabiyy today asked Nigerians, particularly Muslims to emulate the life and good virtues of Prophet Muhammad (PBUH).\n“Today, I join millions of people around the world, to wish our Muslim brothers and sisters in Lagos State and in Nigeria happy Maolud Nabiy, which is the birthday of Prophet Mohammed (PBUH).\nThe Muslim faithful in Lagos State should continue to live in peace and harmony with believers of other faiths,” the Governor advised.\nWhile commending Lagosians for their steadfastness, resilience and cooperation with his administration, Governor Sanwo-Olu reassured Lagos residents of his government’s commitment to good governance and people-oriented programmes."
  },
  {
    "headline": "SBM Intelligence: Insecurity, Government Policies, Climate Change Affecting Food Prices",
    "summarized_story": "The Head of Research at SBM Intelligence Ikemesit Effiong was on the Global Business Report to discuss his company’s Jollof index which says the average cost of making a pot of Jollof rice for a family of five remains high across the country.\nOn average, it will cost N8,007.50 which is higher than the average cost in Q2 which stood at N7,618, a percentage difference of 4.98.\nSBM blames a hike in food prices on Insecurity, unfavourable government policies and climate changes.\nWatch the video…"
  },
  {
    "headline": "Buhari Says Insecurity is Declining – Trending with Ojy Okpe",
    "summarized_story": "President Muhammadu Buhari on Monday, in a message to mark the Eid-ul-Maulud celebration, claimed that Insecurity is declining and advised the media to revise their narrative when reporting security challenges in the country.\nThe federal government on Monday announced, that the criminal charges filed against Nnamdi Kanu, leader of the Indigenous People of Biafra have been amended to a seven-count charge as against the five counts he was previously charged, bordering on treasonable felony, and terrorism.\nMeanwhile, the leader of Islamic Movement in Nigeria Sheikh Ibraheem El-Zakzaky and his wife Malama Zeenah Ibrahim have filed a fundamental rights enforcement suit against the Department of State Services and the minister of Justice and Attorney General of the Federation Abubakar Malami to challenge the seizure of their international passports.\nFinally, musician Folarin Falana, better known by his stage name Falz, on Sunday, during the 2021 Felabration, an annual music festival in memory of Fela Kuti, the late Afrobeat pioneer, urged the crowd at the Afrika Shrine to come out en masse for the first anniversary of the #EndSARS protest slated for October 20th."
  },
  {
    "headline": "Trump Files Lawsuit to Keep January 6 Documents from Congress",
    "summarized_story": "In a federal lawsuit, Trump said the committee’s August request was “almost limitless in scope,” and sought many records that weren’t connected to the siege.\n“There’s a long history of the White House accommodating congressional investigative requests when the public interest outweighs other concerns,” Thompson and Cheney said.\nBannon was a private citizen when he spoke to Trump ahead of the attack, the committee said, and Trump has not asserted any such executive privilege claims to the panel itself.\nIn a letter obtained by The Associated Press, the White House also worked to undercut Bannon’s argument.\nIt is unclear whether a fourth former White House aide, Dan Scavino, will comply."
  },
  {
    "headline": "Are Developing Countries Ready to Adopt Clean Energy?",
    "summarized_story": "Investment analyst with Chapel hill Denham Mr Omotola Abimbola, while speaking with Mr Boason Omofaye on the Global Business report, discussed South Africa’s energy minister’s comment on opposing coal ban.\nHe said the minister is more concerned about the long-term security and sustainability of energy in the country.\nMr Abimbola also reacted to Tanzania developing it’s gas reserves.\nWatch the video for more…"
  },
  {
    "headline": "Taliban Says Afghan Girls Will Return to Secondary Schools Soon",
    "summarized_story": "Afghanistan’s Ministry of Interior Affairs has said girls will be allowed to return to secondary schools soon.\n“From my understanding and information, in a very short time all the universities and schools will be reopened and all the girls and women will return to school and their teaching jobs,” he said.\nFollowing the Taliban’s takeover of Afghanistan, teenage girls were told to stay home from school until a “safe learning environment” could be established.\nBut boys in all grades and girls of primary age were told to return to school.\nKhosti “indicated that it was imminent that girls in secondary schools and their female teachers would be returning very soon,” said Al Jazeera’s Stefanie Dekker, reporting from Kabul."
  }
]