[
  {
    "headline": "Stop seeing politics as dirty, Diri urges Christians",
    "summarized_story": "Bayelsa State Governor, Douye Diri, has advised Christians to actively participate in politics and stop seeing it as dirty if they want to have a positive impact on society.\nHe urged Christians not to stay away from politics or remain unconcerned but rather join to influence decision-making for the good of the generality of the people.\nSo, after consultation, we decided to give you the name Ebidaowei of Bayelsa, meaning the good father of Bayelsa.\nⓘ“Our story as a government in Bayelsa will be better told by you, Daddy G.O.\nWhen we were told that you were coming to start the year with us, we opened our arms to welcome you."
  },
  {
    "headline": "Vlahovic arrives at Juventus for medical ahead of transfer",
    "summarized_story": "Serbia striker Dusan Vlahovic arrived at Juventus for a medical on Friday ahead of a much-anticipated winter break transfer to the Italian giants.\nAn official announcement on the move from fellow Serie A club Fiorentina was expected later Friday.\nVlahovic’s signing is expected to help Juventus in its bid to get in the Champions League.\nThe team is currently a point off the top four, having played a game more than fourth-placed Atalanta.\nJuventus tweeted a picture of a 21-year old smiling Vlahovic outside his medical, doing a double thumbs up."
  },
  {
    "headline": "Court grants popular aphrodisiac seller, Jaruma bail",
    "summarized_story": "Popular aphrodisiac seller, Hauwa Muhammed, popularly known as Jaruma, has been granted bail.\nNwoko had accused Jaruma of publishing falsehoods on her Instagram page against him and his wife, Regina Daniels, who is an actress.\nThe judge, Ismaila Abdullahi, on Monday ruled that she should be remanded in the Suleja Correctional Centre pending the bail hearing on Friday.\nRuling on her bail application, Abdullahi said her remand should not be seen as a punishment to the defendant.\nHe, however, warned all parties involved in the matter to refrain from actions that could be considered prejudicial to the case."
  },
  {
    "headline": "2023 Presidency: I’ll remain my old self, Anyim pledges",
    "summarized_story": "By Dennis AgboPeoples Democratic Party, PDP Presidential aspirant, Senator Anyim Pius Anyim has said that he remains as constant as a northern star that does not change and will remain his true self if elected President of Nigeria in 2023.\nAnyim said that he will not change from what people already knew him for, insisting that he would rather remain on the path which has earned him a favour, respect and recognition of the Nigerian people.\nAnyim made the pledge when the Multi-Media Publishers Association of Nigeria, MPAN, led by its National Chairman, Alhaji Gambo Jajindi, visited him on his presidential pursuit.\nAccording to him, “the whole concept of the policy I will run as a president of Nigeria will be youth compliance because the future belongs to them.\nAccording to him, “corruption thrives when there is room for its existence but when the adequate framework is put in place and institutions are enabled to function maximally there will be no room for corruption to flourish.”Vanguard News Nigeria"
  },
  {
    "headline": "Soot: Stakeholders call for review of Petroleum Refining laws to accommodate artisanal refineries",
    "summarized_story": "Urge FG to implement Artisanal/Modular Refinery reportBy Johnbosco AgbakwuruSTAKEHOLDERS in the management of oil and gas have stressed the need for a review of the Petroleum Refining Regulations of 1974 and other relevant laws to accommodate the establishment of artisanal refineries.\nThe emergency meeting was called to address the soot and other environmental pollution caused by artisanal refining activities in Rivers State and other Niger Delta States.\n“That there is the need for the review of the Petroleum Refining Regulations of 1974 and other relevant laws to accommodate the establishment of artisanal refineries.\nThe stakeholders commended the Ministers of EnvironmentPetroleum Resources (State), Finance, Budget and National Planning and Niger Delta Affairs.\nThey also appreciated theDirector General/Chief Executive: National Oil Spill Detection and Response Agency (NOSDRA), the Commission Chief Executive, Nigerian Upstream Petroleum Regulatory Commission (NUPRC), and the Chief Executive, Nigerian Midstream and Downstream Petroleum Regulatory Authority."
  },
  {
    "headline": "Tired of hawking, Plateau women seek better life",
    "summarized_story": "The stature was erected in 1992 by the Fidelis Tapgun administration to depict and demonstrate the resilience and industry of typical Plateau women who try to defy all odds to cater for their families.\nAs a result, the disdainful tradition of women strapping their babies on their backs and hawking groceries is still active and booming in the agrarian state.\nWomen in the past might have ‘enjoyed’ street hawking to fend for their families but today’s women are uncomfortable with this and seek a better deal.\nI train them from the proceeds of hawking but this is not the life I want for my children.\nThe wife of the President too also intervened at a time to lift Plateau women."
  },
  {
    "headline": "Botched visit: Buhari sends video/radio broadcast to Zamfara people",
    "summarized_story": "President Muhammadu Buhari–Bad weather aborts President’s condolence visitBy Johnbosco AgbakwuruABUJA–President Muhammadu Buhari made a broadcast to the people of Zamfara State following the cancellation of his scheduled trip to the State yesterday due to inclement weather conditions.\nThe President in the message said, “My dear people of Zamfara State.\nI had just finished what I came to do in Sokoto at the BUA cement facility and was looking forward to meeting you.\nI particularly sympathize with your Governor, Bello Matawalle, and his cabinet who have put everything in place to make the visit a successful one.\n“God bless the people of Zamfara State.”"
  },
  {
    "headline": "Ogun LGs share N3.587bn in January",
    "summarized_story": "By James OgunnaikeABEOKUTA – The 20 local government areas in Ogun State shared a sum of N3.587 billion, being the amount they received from the Federal Allocation for January, 2022.\nThe State Commissioner for Local Governments and Chieftaincy Affairs, Afolabi Afuwape, disclosed this during theJanuary 2022 Joint Account Allocation Committee (JAAC) meeting held in Abeokuta, the State capital.\nThe Commissioner charged the Chairmen to see the monthly JAAC meeting as an official engagement that requires utmost attention, in order to improve welfare and infrastructural development at the grassroots.\nOkubadejo noted that the gross deficit stood at the sum of N470,901,128.69, which covers PAYE, contributory pension, five percent bond on pension and cooperative and loans.\nTunde Emiola-Gazal appreciated the the state government for harmonizing payment of the first line charges which had allowed all the councils to meet up with salary payment."
  },
  {
    "headline": "Disband Ebubeagu in Ebonyi immediately – HURIWA alleges intimidation of opposition",
    "summarized_story": "Human Rights Writers Association of Nigeria, HURIWA, has called for the immediate suspension of Ebubeagu, the security unit originally set up to fight crime in the South East of Nigeria.\nThe human rights organisation says the group may be illegally empowered by incumbent state governments in the region to fight opposition as the 2023 general elections approach.\nHURIWA wants the security unit to be disbanded in Ebonyi State, pointing out that it now constitutes a danger to the lives of opponents of Governor Dave Umahi.\nEbubeagu Security Network was recently inaugurated in Ebonyi State and since the launch, HURIWA says there has been a rash of violent attacks launched on leaders of the opposition Peoples Democratic Party (PDP) in the State.\n“HURIWA wants the EBUBEAGU security outfit in Ebonyi State disbanded since the Ebonyi State government allegedly has turned it into full-fledged armed political thugs of the ruling All Progressives Congress in Ebonyi State,” the statement said."
  },
  {
    "headline": "US Embassy extends validity of visa fee till 2023",
    "summarized_story": "The United States Mission in Nigeria has extended its visa fee validity to September 2023.\nA statement on the Embassy’s website reads: “The United States Embassy and Consulate in Nigeria understand that many visa applicants have paid the visa application processing fee and are still waiting to schedule a visa appointment.\n“We are working diligently to restore all routine visa operations as quickly and safely as possible.\nThe earliest appointment date given according to applicants is nine months from the date of booking.\nThe embassy explained that it is working efficiently to restore routine consular services that were suspended because of COVID-19."
  },
  {
    "headline": "Biafra: Why Nnamdi Kanu should not be released – Asari Dokubo to Buhari govt",
    "summarized_story": "Former Niger Delta militant leader, Asari Dokubo, has given reasons why the Federal Government should not release Nnamdi Kanu, the pro-Biafra agitator.\nDokubo said Kanu should not be released because he instigated violence and his influence propelled his followers to wreak havoc in the southeast.\nThe leader of the defunct Niger Delta Peoples Salvation Force (NDPSF), disclosed this in a Facebook live yesterday.\nAccording to Dokubo: “They will come and be begging (the FG) to bring out Nnamdi Kanu.\n“You take traditional rulers, chain them, you put guns inside their mouths because they are the people who are not allowing Biafra to come.”Video:https://fb.watch/aPwtSpAC2Y/"
  },
  {
    "headline": "Uduk: Court to adopt a ‘no submission case’ as INEC concludes prosecution",
    "summarized_story": "An Akwa Ibom State High Court sitting in Uyo, the state capital, has disclosed its resolve to adopt a ‘no case submission’ in the ongoing electoral fraud case against Professor Ignatius Uduk of the department of Physical and Health Education, University of Uyo, Uyo.\nThe ‘no case submission’ would be filed by the defence counsel, Mr. Abasiodiong Ekpenyong.\nThis came following the conclusion of prosecution by the Independent National Electoral Commission (INEC).\nThe Prosecution Lawyer, Mr. Clement Onwuenwunor, at a resumed hearing, called four Supervisory Presiding Officers (SPOs) of INEC as witnesses.\nIn his reaction, the Prosecution Lawyer, Clement Onwuenwunor, accepted that a ‘no case submission’ is provided by the law, saying that his team is prepared to respond to whatever the defence team will put up in their address."
  },
  {
    "headline": "You’ll get accident with that car – Pastor David Ibiyeomie curses Yahoo boys, policemen [VIDEO]",
    "summarized_story": "He also laid curses on police officers who released arrested Yahoo boys after collecting bribes from them.\nSome people, the whole of their retirement benefit..You scam them and say you are buying a car.\nYou will get accident with that car!”He added, ”And to the police, all the Yahoo boys, jail them, arrest them.\nIf you take bribes from Yahoo boys, that money will kill you!\nPolice stop taking that kind of money.”Meanwhile, the Economic and Financial Crimes Commission (EFCC) has confirmed the arrest of 60 suspected Yahoo boys in Ogun."
  },
  {
    "headline": "Buhari to military: don’t spare bandits, terrorists",
    "summarized_story": "•‘Northwest security situation giving me sleepless nights’•Poor weather stops President’s Zamfara visitBandits and terrorists will come under severe onslaught in the coming days following an order from President Muhammadu Buhari to the military not to spare them.\nThe President spoke on his directive to the military high command yesterday in Sokoto at the palace of the Sultan, Sa’ad Abubakar III.\nHe reaffirmed the order in a broadcast to the people of Zamfara State following the disruption of his planned visit to Gusau, the state capital due to poor weather conditions.\nAbout 58 people were confirmed dead by Governor Bello Matawalle when bandits attacked some communities.\n“I am directing our security agencies to sustain the onslaught against terrorists, restrict cross-boundary infiltration and all unauthorised access to the goldmines in the state."
  },
  {
    "headline": "Shops, buildings razed as petrol tanker explodes in Onitsha",
    "summarized_story": "A fire explosion rocked Onitsha, Anambra State on Friday when a petrol tanker laden with the premium motor spirit sparked fire at the popular Upper Iweka junction of the commercial city.\nThe incident, which occurred around 8:30am in front of the Relief market, left many shops and buildings around the scene burnt.\n- Advertisement -Police spokesperson, Tochukwu Ikenga confirmed the incident.\nHe said: “Information reveals that the cause of the fire is as a result of a tanker carrying fuel by Obodoukwu junction along Onitsha river Owerri road fell.\nThe Police and fire service are currently on ground there.”"
  },
  {
    "headline": "Juju musician Dayo Kujore goes home",
    "summarized_story": "By Adeniyi Adewoyin and Gbenga BadaLate Juju music star, Dayo Kujore will be laid to rest Friday in Igbore Robiyan, Abeokuta, Ogun State.\nThe Nation reports that activities began on Thursday, January 27, 2022, after a wake held for the late Soco Xtra singer at the Kujore compound in Igbore Robiyan.\nRead Also: Dayo Kujore dies 84 days to 64th birthdayOn-the-spot sources revealed that the burial service has begun in earnest at the Emmanuel African Church in Igbore Robiyan.\n- Advertisement -The remains of the late singer is expected to be interred in Igbore Robiyan with several music icons and Juju exponents in attendance.\nLate Dayo Kujore died at 69 at Lagos State University Teaching Hospital, Ikeja, Lagos after a brief illness."
  },
  {
    "headline": "PDP fixes Feb. 19 for Lagos State outstanding congress",
    "summarized_story": "The National Working Committee (NWC) of the Peoples Democratic Party (PDP) has approved Saturday, Feb. 19, for the conclusion of its outstanding State Congress for the purpose of electing new State Executive Committee members in Lagos StateThe party disclosed this in a statement issued by its National Organising Secretary, Umar Bature, on Thursday in Abuja.\nThe NW, according to the statement, also scheduled a crucial meeting with Lagos State stakeholders on Monday, Feb. 7, at the Zonal Headquarters, Ibadan, Oyo State.\nIt added that the NWC would continue to update stakeholders on any development in that regard."
  },
  {
    "headline": "Ekiti 2022: Group cautions APC, PDP against disrupting political process",
    "summarized_story": "The Convener, Mr Akinola Busuyi, told newsmen in Ado-Ekiti that the call became necessary due to the violence that followed the conduct of the All Progressives Congress (APC) and Peoples Democratic Party (PDP) governorship primaries.\nBusuyi said, aside the violence that characterised the gubernatorial primary of the PDP on Wednesday, the APC governorship primary of Thursday also failed to comply with the democratic norms.\n“It has been reported that certain people had bought over the Governorship Primary Electoral Committee led by Gov.\nThe group convener decried the ways and manners the process was characterised with politics of bitterness and acrimony.\nThe convener, however, commended the APC National leadership for the adoption of direct mode of primary for the governorship primary in Ekiti."
  },
  {
    "headline": "Breaking: Relief Market on fire as fuel tanker falls",
    "summarized_story": "From Jeff Amechi Agbodo, OnitshaThe popular Ogbaru Relief Market near Onitsha, Anambra state is on fire.\nThe fire was caused by fallen fuel tanker at Obodoukwu junction along Onitsha- Owerri road.\nThe fire which is still raging at the time of filling this report has burnt over 10 storey buildings, vehicles and tricycles.\nNo life has been lost yet, but goods and property worth millions of naira were destroyed by the fire.\nThe firefighting officials are on ground trying to put out the fire."
  },
  {
    "headline": "Insecurity: Buhari gives fresh marching orders to military",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, yesterday, reiterated the resolve of his administration to crush terrorists, bandits and other criminals creating security challenges in the country.\nThe President wrote in the visitors’ register: “My condolences to the Sultanate, the Government, and people of Sokoto State over the recent mindless killings by bandits and terrorists.\nNigeria shall win the battle over evil.”100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nGovernor of Sokoto State, Aminu Tambuwal and the Sultan thanked the President for the show of sympathy assuring him of continued support towards peace and stability in the country.\nMeanwhile, in a bid to address soot and other environmental pollution caused by artisanal refining activities in the Niger Delta, the presidency has called for the review of the Petroleum Refining Regulations of 1974."
  },
  {
    "headline": "Security in state of near collapse, Clark tells Buhari",
    "summarized_story": "Clark who is also the Chairman, Southern and Middle Belt Leaders Forum, in an open letter to President Buhari said rather than improve, security under the present administration was in a state of near collapse.\nClark also faulted the claim by President Buhari that he was the architect of the peace witnessed in the Niger Delta, saying the credit righly belongs to former President Godluck Jonthan.\nYour Excellency, I beg to, somewhat, disagree with you on the general state of insecurity in the country, which is presently, in a state of near collapse.\nOf more concern to me is your claims with respect to the Niger Delta or the South-South zone.\n“No doubt, a good amount of peace has come to the Niger Delta in the past few years."
  },
  {
    "headline": "Covid19: UAE to lift flight restriction on Nigeria, 11 other African countries Jan 29",
    "summarized_story": "By Chinelo ObogoThe United Arab Emirate has said the restriction on flights arriving from Nigeria and 11 other African nations will be lifted on Saturday January 29.\n“The excluded categories should present a negative COVID-19 test obtained within 48 hours of departure and a Rapid-PCR test at the airport within six hours of departure whenever possible and another PCR test at the airport upon arrival to UAE,” NCEMA said.\nOn Wednesday January 26, NCEMA also announced that entry procedures have been updated for flights originating from Ghana, Rwanda and Uganda.\nPassengers are required to take a PCR test 48 hours before departure, test where possible at the departure airport, test on arrival and adhere to all precautionary measures when visiting the UAE.\nThe UAE’s NCEMA and GCAA announced last December that travelers from Nigeria, Tanzania, Kenya and Ethiopia were restricted from entering the country from Saturday, December 25 citing a surge in Omicron."
  },
  {
    "headline": "Buhari pledges more infrastructure to boost private sector investments",
    "summarized_story": "From Amechi Ogbonna (Sokoto)President Muhammadu Buhari, Thursday, pledged to continue to support the Nigerian private sector with policies and programmes to propel it toward higher investments and productivity in the various sectors of the economy, even as he acknowledged that economic policies of his administration are indeed working.\nBuhari, who spoke at the official commissioning of line 4 of the new BUA Cement 3MTPA plant in Sokoto, said he was excited to be back to the facility 37 years after he commissioned its line 2 in 1985.\n“The commissioning of this multimillion Naira plant today is an indication that our policies are working.\nAs a government, we have continued to introduce policies to support private sector investments to achieve food self-sufficiency, artisanal gold mining and cement production, among others.\nBuhari, however, called for stronger collaboration between the private investors and his government to ensure that the nation’s economy becomes more competitive among others."
  },
  {
    "headline": "Buhari Unveils BUA Cement’s Plant in Sokoto, Calls for More Private Sector Investment",
    "summarized_story": "The president spoke in Sokoto, at the inauguration of an ultra-modern three million metric tonnes per annum BUA Cement Sokoto line four factory.\n“In the past few weeks, I visited Ogun and Kaduna states, where I observed many private sector investments in action.\nEmefiele pointed out that the achievements so far recorded in the cement sector were not a coincidence but a reflection of the success of the backward integration policy of the Buhari administration.\n“From a job creation and economic standpoint, the Sokoto plant continues to be the largest private sector employer of labour in the North-western part of Nigeria.\n“Also, by adding value to resources mined in Nigeria, Nigeria is being saved billions of US dollars in foreign exchange that would have been spent on importation, whilst also ensuring product availability."
  },
  {
    "headline": "Marginal Fields: NUPRC Moves to Resolve Outstanding Issues, Meets with Awardees",
    "summarized_story": "These, it was learnt, hindered the progress of the initiative, which saw the award of 57 marginal fields to 161 Nigerian entities, from which about N175 billion had been raised by the federal government so far.\nSpeaking during the meeting, the commission’s Chief Executive, Mr. Gbenga Komolafe, noted that the engagement with the marginal field awardees and leaseholders was for NUPRC to state the policy position on the 2020 Marginal Fields Bid Round (MFBR).\nKomolafe stated that this would enable successful awardees progress to field development phase in line with the PIA.\nThe commission, he said, through the Alternative Dispute Resolution Centre (ADRC) also offered an opportunity for co-awardees of marginal fields to resolve issues speedily and amicably.\n“In all, 57 fields were awarded, 119 fully paid up, nine partially paid, 33 awardees failed to pay, while 247 had unsuccessful bids,” the organisation indicated."
  },
  {
    "headline": "Police Helicopter Crash-lands in Bauchi",
    "summarized_story": "Segun Awofadeji in BauchiThe Accident Investigation Bureau (AIB) has reported a crash involving a Bell 429 helicopter with registration marks 5N-MDA owned and operated by the Nigeria Police Force (NPF).\nAccording to a press statement by Tunji Oketunbi, the General Manager, Public Affairs of AIB, titled ‘Nigeria Police Helicopter Occurrence’ which was made available to newsmen Thursday, “On 26th January, 2022, Accident Investigation Bureau, Nigeria was notified by Nigerian Airspace Management Agency (NAMA) about an accident involving a Bell 429 helicopter with Registration Marks 5N-MDA owned and operated by Nigeria Police Force (NPF).\n“The accident occurred on 26th January, 2022 around 7.30pm (local time)at Bauchi Airport.”The statement further said: “The NPF helicopter had departed Abuja at 16:54UTC for Bauchi with six persons on board maintaining 5,500ft.\n“The investigating agency, AIB-N, needs and hereby solicits for your assistance.\n“The Bureau will appreciate that the general public and press respect the privacy of the people involved and NOT assume the cause of the accident until formal report is released.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Again, Rivers Floors FG, As Court Declares Deductions from Fed Account to Fund its Agencies Unconstitutional",
    "summarized_story": "Mohammed barred the federal government from further deductions from the federation account to fund agencies not listed in the 1999 Constitution for direct allocation.\nReacting to the ruling, Rivers State Governor, Mr. Nyesom Wike, stated that the judgement was a resounding victory for democracy.\nThe suit challenging the continued deductions from the federation account to fund agencies belonging to the federal government was filed by the Rivers State Government.\nMohammed, while upholding the suit by Rivers State against the deductions, ordered that the fund belonging to Rivers State but used to fund the Nigeria Police Trust fund by the federal government should be refunded to the state.\nBut not the federal government arbitrarily deducting our money from the federation account and putting it to Police Trust Fund."
  },
  {
    "headline": "Cash-strapped FG Approves N3trn, 17.5% of 2022 Budget to Sustain Subsidy",
    "summarized_story": "The N3 trillion now budgeted to sustain the payment of subsidy in 2022 alone, amounts to 17.5 per cent of the total of N17.126 trillion 2022 budget that was signed into law on the last day of 2021.\nAlready, the approved 2022 budget has a deficit of N6.39 trillion, which is 37 per cent of the N17.126 trillion.\nFayemi said this at a joint meeting between the state governors, NLC, and TUC over the fuel subsidy withdrawal.\nFEC yesterday mandated the Finance, Budget and National Planning Ministry to reconcile the fuel subsidy budget with the Nigerian National Petroleum Company (NNPC) Limited, which prepared the estimate.\nAhmed said a memo in respect of the additional funding provisions to enable government meet the incremental fuel subsidy request in the 2022 budget was presented for the council’s consideration."
  },
  {
    "headline": "BREAKING: Dowen College Parents Demand Change Of School Management, Hostel Teachers, Organise Candlelight For Late Sylvester",
    "summarized_story": "“As parents of Dowen college students, we are still in shock and could not come to terms with this incident and the accounts so far provided by the school,students, and the media.\n“We therefore earnesly ask for a resolution that will bring some relief to the bereaved family, other parents, students of Dowen College and the public.\nDetails of which are as follow: Wednesday, December 8, 6pm; Dowen College.\nIn a series of Tweets, the family member, with handle @Perrisonoromoni said Sylvester was assaulted by some senior students of Dowen College.\nThe Management of Dowen College in a statement had claimed that Sylvester was injured while playing football."
  },
  {
    "headline": "BREAKING: Dowen College Parents Demand Change Of School Management, Hostel Teachers, Organise Candlelight For Late Sylvester",
    "summarized_story": "“As parents of Dowen college students, we are still in shock and could not come to terms with this incident and the accounts so far provided by the school,students, and the media.\n“We therefore earnesly ask for a resolution that will bring some relief to the bereaved family, other parents, students of Dowen College and the public.\nDetails of which are as follow: Wednesday, December 8, 6pm; Dowen College.\nIn a series of Tweets, the family member, with handle @Perrisonoromoni said Sylvester was assaulted by some senior students of Dowen College.\nThe Management of Dowen College in a statement had claimed that Sylvester was injured while playing football."
  },
  {
    "headline": "EXCLUSIVE: Buhari Government Plans To Convert Civil Servants To Teachers Despite Millions Of Unemployed Nigerian Graduates",
    "summarized_story": "The Muhammadu Buhari-led Federal Government has announced a new directive aimed at converting civil servants on levels 8 to 13 literally to the education sector to teach at the Federal Unity Colleges.\nA circular to implement this, obtained by SaharaReporters, is coming despite the teeming population of unemployed Nigerian graduates in the country who are qualified.\nTeacherAccording to the National Bureau of Statistics, the rate of unemployment in Nigeria rose to 33.3% in the last quarter of 2020 with many still unemployed and underemployed.\nIn the circular from the Office of the Head of Service of the Federation and dated July 23, the Federal Government urged interested staff members in the federal civil service to apply for positions in the education sector.\n“Be computer literate and prepared to undergo training that will qualify them to be registered with the Teacher Regulation Council of Nigeria; be willing to be posted to Federal Unity Colleges to teach; have up to 10 years remaining in the service.”There are 104 Federal Unity Colleges in the country and there has been dearth of teachers in the schools and other public schools in the country as the government refused to employ qualified hands into the sector."
  },
  {
    "headline": "EXCLUSIVE: Buhari Government Plans To Convert Civil Servants To Teachers Despite Millions Of Unemployed Nigerian Graduates",
    "summarized_story": "The Muhammadu Buhari-led Federal Government has announced a new directive aimed at converting civil servants on levels 8 to 13 literally to the education sector to teach at the Federal Unity Colleges.\nA circular to implement this, obtained by SaharaReporters, is coming despite the teeming population of unemployed Nigerian graduates in the country who are qualified.\nTeacherAccording to the National Bureau of Statistics, the rate of unemployment in Nigeria rose to 33.3% in the last quarter of 2020 with many still unemployed and underemployed.\nIn the circular from the Office of the Head of Service of the Federation and dated July 23, the Federal Government urged interested staff members in the federal civil service to apply for positions in the education sector.\n“Be computer literate and prepared to undergo training that will qualify them to be registered with the Teacher Regulation Council of Nigeria; be willing to be posted to Federal Unity Colleges to teach; have up to 10 years remaining in the service.”There are 104 Federal Unity Colleges in the country and there has been dearth of teachers in the schools and other public schools in the country as the government refused to employ qualified hands into the sector."
  },
  {
    "headline": "Old Students Lament Delay In Getting Certificates From Ibadan Polytechnic",
    "summarized_story": "Some graduates of The Polytechnic, Ibadan, Oyo State, have decried the delay in the issuance of certificates by the institution despite having graduated some years back.\nHowever, they said it has been tough obtaining the certificates and transcripts from the institution to further their studies in other schools.\nUpon acceptance, he had been required to get the original copy of his certificate and transcript from the polytechnic, which he has applied for since November, 2021.\nNormally, after the statement of result, they said it will take like one year for the certificate to be ready.\nI applied for certificate again and paid close to N100, 000 as charges to get the certificate and transcript."
  },
  {
    "headline": "Gunmen raid THISDAY office in Abuja, threaten to kill staff",
    "summarized_story": "Gunmen have raided the office of THISDAY located at Utako district in the federal capital territory (FCT).\nAccording to the newspaper, the gunmen stormed the office in the early hours of Thursday.\nThe intruders were said to have subjected the security guards and production staff to “inhumane treatments”, threatening to kill them if they made any attempt to alert the police.\nThe gunmen who were said to be in the premises of the newspaper’s office for about 45 minutes, reportedly told the staff that they would be back again “in the days ahead”.\nAdvertisementThe management of THISDAY said it has since reported the incident to the police division in Utako district."
  },
  {
    "headline": "Gunmen raid THISDAY office in Abuja, threaten to kill staff",
    "summarized_story": "Gunmen have raided the office of THISDAY located at Utako district in the federal capital territory (FCT).\nAccording to the newspaper, the gunmen stormed the office in the early hours of Thursday.\nThe intruders were said to have subjected the security guards and production staff to “inhumane treatments”, threatening to kill them if they made any attempt to alert the police.\nThe gunmen who were said to be in the premises of the newspaper’s office for about 45 minutes, reportedly told the staff that they would be back again “in the days ahead”.\nAdvertisementThe management of THISDAY said it has since reported the incident to the police division in Utako district."
  },
  {
    "headline": "Biodun Oyebanji: Fayemi has no hand in my election as Ekiti APC governorship candidate",
    "summarized_story": "Biodun Oyebanji, governorship candidate of the APC, says Kayode Fayemi, governor of Ekiti, has no hand in his emergence as the standard-bearer of the party in the state.\nOn Thursday, Oyebanji, former secretary to the state government (SSG), polled 101,703 votes to emerge as APC’s governorship candidate.\nPrior to the election, seven aspirants had withdrawn from the race, alleging that the primary election committee was made up of loyalists of Fayemi.\n“Fayemi is the party leader in the state, and there’s no party member that doesn’t have a relationship with him.\nAll of us in the race have one relationship with governor Fayemi, and we’re all close to him.”"
  },
  {
    "headline": "Biodun Oyebanji: Fayemi has no hand in my election as Ekiti APC governorship candidate",
    "summarized_story": "Biodun Oyebanji, governorship candidate of the APC, says Kayode Fayemi, governor of Ekiti, has no hand in his emergence as the standard-bearer of the party in the state.\nOn Thursday, Oyebanji, former secretary to the state government (SSG), polled 101,703 votes to emerge as APC’s governorship candidate.\nPrior to the election, seven aspirants had withdrawn from the race, alleging that the primary election committee was made up of loyalists of Fayemi.\n“Fayemi is the party leader in the state, and there’s no party member that doesn’t have a relationship with him.\nAll of us in the race have one relationship with governor Fayemi, and we’re all close to him.”"
  },
  {
    "headline": "After weeks of consultation, Tinubu jets to London 'to see his family'",
    "summarized_story": "Bola Tinubu, chieftain of the All Progressives Congress (APC), has travelled out of the country after weeks of consultation with stakeholders in the country over his 2023 presidential ambition.\nA source in the former governor’s camp confirmed to TheCable, on Friday, that Tinubu travelled to London, the United Kingdom, “to see his family”.\nOther sources said the APC chieftain travelled out of the country to rest and see his doctors.\nHe also met with Seyi Makinde, the state governor, in Ibadan.\nEarlier in the month, Tinubu visited President Muhammadu Buhari where he formally announced his intention to contest for the 2023 presidency."
  },
  {
    "headline": "What do blockchain, NFT, DAO and crypto mean?",
    "summarized_story": "What do blockchain, NFT, DAO and crypto mean?\nHow it works: Standard databases store data in rows, columns and files, but blockchain stores data in blocks that are chained together.\nHow it works: Cryptos are digital currencies created on blockchain technology.\nHow it works: To put it simply, NFTs are digital works that exist on blockchain.\nHow Web3 works: Web3 will be built on the blockchain working independently from different parts of the world."
  },
  {
    "headline": "Zimbabwean James Manyika, becomes Google’s first Senior Vice President of Technology and Society",
    "summarized_story": "Google has appointed Zimbabwean James Manyika as the company’s first Senior Vice President of Technology and Society.\nManyika will report directly to Alphabet’s (Google’s parent company) CEO Sundar Pichai and will be working on the impact of technology on society and the environment.\n“I’m thrilled that James Manyika will be joining Google’s leadership team,” Pichai said in a statement.\n“He’s spent decades working at the intersection of technology and society and has advised a number of businesses, academic institutions and governments along the way.\nManyika has advised the chief executives and founders of many of the world’s leading tech companies on strategy and growth, product, and business innovation."
  },
  {
    "headline": "He built TikTok's strategy in Africa, now he's building Kippa",
    "summarized_story": "Kennedy Ekezie-Joseph who helped lead TikTok’s entry into Africa, was no longer with the company for that moment of triumph.\nEkezie-Joseph’s startup, Kippa, is a bookkeeping and finance app that he founded with Duke Ekezie (his brother) and Jephthah Uche in February 2021.\n“My dad had a small business around when I was born, which he lost.\nWhen he launched Kippa, Ekezie-Joseph knew from personal experience that he was addressing an existential threat to businesses.\nBeyond the early conversion of bookkeepers and small business owners, Ekezie-Joseph is the first to admit that there are plenty of hurdles ahead."
  },
  {
    "headline": "LAND TUSSLE: Appeal Court Dismisses Case, Awards N15m Against Edo Community – Nigerian Observer",
    "summarized_story": "The Appeal Court also allowed the cross appeal filed by the cross appealants (Ulegun) against the cross respondents (Ukhiri Village) and awarded the sum of Fifteen Million Naira ( N15, 000,000.00) as damages against Ukhiri.\nIn a unanimous decision read by Justice Biobele Abraham Georgewill, in the main and cross appeal with suit No.\n45 hectares lying and situated at Ulegun Village in the Benin-Abraka Road, Ikpoba-Okha Local Government Area of Edo State.\nRecall that Ukhiri had on 1976 dragged Ulegun to court alleging encroachment of a portion of its land by Ulegun.\nThe case was again struck out at the Appeal Court for lack of merit along with cost awarded against the appellants over damages and trespass."
  },
  {
    "headline": "FG N4.1 Billion Customs Revenue Target: Undue Pressure On The Agency – ANLCA Boss Faults – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Association of Nigeria Licensed Customs Agents (ANLCA) has described the recent revenue target of N4.1 billion by the Federal Government on the Nigeria Customs Service (NCS) for 2022, as a high target that will put undue pressure on the agency.\nFaulting the Federal Government decision on the exorbrant target, ANLCA posited that the target would also undermine its core responsibility of facilitating trade between Nigeria and other countries.\nTony Iju Nwabunike stated this in Lagos recently during a press briefing to celebrate the four years of his executives on the leadership of the foremost freight forwarding association in Nigeria.\nNwabunike said: “We want to also advise the Federal Government to be careful before signing into the $3.1 billion Customs Modernisation Project which we heard, will run for 20 years.\n“For us, this shows more commitment by the Buhari administration to maritime matters."
  },
  {
    "headline": "CP Alabi Takes Over Leadership Of Lagos Command, Charges Officers And Men For Success – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The new Commissioner of Police, Lagos State, CP Abiodun Alabi has charged Area Commanders, DPOs/HODs and tactical commanders to translate their long-time relationship with him to success in the state.\nCP Alabi charged the officers during his maiden meeting with them shortly after taking over the mantle of leadership as Commissioner of Police in the state at a brief ceremony held on 24th January, 2022 at the Command Headquarters, Ikeja.\nThe CP also directed the Area Commanders and Divisional Police Officers to constantly engage and partner with critical stakeholders in their areas of responsibilities for effective policing.\nSpeaking further, the Commissioner of Police warned officers against corruption and infringement on fundamental human rights of Nigerians.\nHe, however, assured that he would always provide good leadership that would help them succeed in the discharge of their duties."
  },
  {
    "headline": "Obaseki visits, commiserates with family of late Edo NLC Chair – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has commiserated with the family of the late chairman of the state chapter of the Nigerian Labour Congress, Comrade Sunny Osayande.\nObaseki, who led other top government functionaries on a condolence visit to the home of the deceased, pledged to support the family in giving the late labour leader a befitting burial.\nSunny was a good labour leader.\nHe was never tired as a labour leader.\nSpeaking on behalf of the family, Mr. Festus Egharevba, noted that the deceased labour leader enjoyed cordial rapport with the state government in his short stay in office."
  },
  {
    "headline": "UAE To Lift Restrictions On Nigerian Passengers, Others Saturday",
    "summarized_story": "The United Arab Emirates (UAE) authorities have said that restriction on flights arriving from Nigeria and 11 other African countries will be lifted on Saturday, January 29, 2022.\nUAE National Emergency Crisis and Disaster Management Authority (NCEMA) said it was lifting the ban initially imposed as part of measures to prevent the spread of the Omicron variant of COVID-19.\nOthers are South Africa, Tanzania and Zimbabwe, the authorities said in a post on Twitter Wednesday.\nADVERTISEMENTRecall that the UAE had last December issued a travel restriction on passenger flights from Nigeria, Kenya, Tanzania, and Ethiopia.\nADVERTISEMENTIt noted that passengers are required to take a PCR test 48 hours before departure, test where possible at the departure airport, test on arrival and adhere to all precautionary measures when visiting the UAE."
  },
  {
    "headline": "Buhari Inaugurates 3m Metric Tone BUA Cement Factory In Sokoto",
    "summarized_story": "President Muhammadu Buhari on Thursday in Sokoto inaugurated a new three million metric tonnes per annum BUA Cement Sokoto Line 4 Factory, expressing delight that the Federal Government’s policies on economic diversification, job creation and creating an enabling environment for businesses to thrive, were working.\n”In the past few weeks, I visited Ogun and Kaduna States where I observed many private sector investments in action.\nThe President thanked the Founder of BUA Cement, Abdul Samad Rabiu and the entire team for the great work they are doing in supporting the government’s economic diversification and job creation agenda.\nCommending BUA and other entrepreneurs for making Nigeria self-sufficient in cement and a net exporter of the strategic product, the President said: ”I am pleased that through these investments, BUA Cement has created employment opportunities for our citizens.\nRabiu added that he looked forward to President Buhari commissioning the plants next year which will bring total production capacity to 17.5million metric tonnes."
  },
  {
    "headline": "JUST-IN: Deposed Deji Of Akure Is Dead",
    "summarized_story": "The deposed Deji of Akure, Oba Oluwadare Adepoju Adesina, Osupa Ill, has passed on.\nConfirming his death, spokesman for the Adesina Royal Family of the Osupa Ruling House, Dapo Adesina, said the deposed monarch prayed for the peace of Akure Kingdom before his transition.\n“The late deposed Deji of Akure Kingdom said God made it possible for him as a son of the Osupa Ruling House to ascend the throne as the Deji of Akure Kingdom 100 years after the reign of the Ojijigogun Ruling House.\nHe also recovered and took possession of Ilula Recreation Centre from a powerful cabal back to Akure Kingdom.\n“Finally he urged the good people of Akure Kingdom to always live in oneness and peace,” he stated."
  },
  {
    "headline": "JUST-IN: Deposed Deji Of Akure Is Dead",
    "summarized_story": "The deposed Deji of Akure, Oba Oluwadare Adepoju Adesina, Osupa Ill, has passed on.\nConfirming his death, spokesman for the Adesina Royal Family of the Osupa Ruling House, Dapo Adesina, said the deposed monarch prayed for the peace of Akure Kingdom before his transition.\n“The late deposed Deji of Akure Kingdom said God made it possible for him as a son of the Osupa Ruling House to ascend the throne as the Deji of Akure Kingdom 100 years after the reign of the Ojijigogun Ruling House.\nHe also recovered and took possession of Ilula Recreation Centre from a powerful cabal back to Akure Kingdom.\n“Finally he urged the good people of Akure Kingdom to always live in oneness and peace,” he stated."
  },
  {
    "headline": "4 Borno NUJ Officials Resign Over N12m Land Scandal",
    "summarized_story": "Four state executives of the Nigeria Union of Journalists (NUJ) Borno State chapter have tendered a joint resignation letter to their respective chapels over a case of corruption.\n“That proceeds from sale of the land should be remitted to the NUJ Borno Council account in UBA and transaction alert should be received by chairman, secretary and treasurer against the chairman only.\nBY FRANCIS OKOYE, MaiduguriFour state executives of the Nigeria Union of Journalists (NUJ) Borno State chapter have tendered a joint resignation letter to their respective chapels over a case of corruption.\n“That proceeds from sale of the land should be remitted to the NUJ Borno Council account in UBA and transaction alert should be received by chairman, secretary and treasurer against the chairman only.\n“ SEC appealed to four officers: vice chairman, treasurer, financial secretary and assistant secretary who tendered resignation letter the previous day not to abandon the union and continue in office."
  },
  {
    "headline": "Alleged N32.8bn fraud: Supreme Court decides pension director, John Yusuf’s fate April 22 – Daylight",
    "summarized_story": "The Supreme Court on Thursday in Abuja fixed April 22 for judgment in an appeal filed by a former Federal Director of Pension, John Yusuf, challenging his six years imprisonment by the Court of Appeal.\nThe former pension director is also contesting an order of the Court of Appeal, (Abuja Division), that he should refund to the Federal Government N22.9bn he admitted to have diverted for personal use.\nHis admission of guilt at the High Court followed a three-count criminal charges bothering on breach of trust, diversion of N32.8 bn pension fund among others, brought against him by the government.\nHowever upon an appeal by the Economic and Financial Crimes Commission, the Court of Appeal on March 21, 2018 reversed the High Court judgment.\nHe asked the Apex Court to void the judgment so as not to make him suffer double jeopardy."
  },
  {
    "headline": "Alleged N32.8bn fraud: Supreme Court decides pension director, John Yusuf’s fate April 22 – Daylight",
    "summarized_story": "The Supreme Court on Thursday in Abuja fixed April 22 for judgment in an appeal filed by a former Federal Director of Pension, John Yusuf, challenging his six years imprisonment by the Court of Appeal.\nThe former pension director is also contesting an order of the Court of Appeal, (Abuja Division), that he should refund to the Federal Government N22.9bn he admitted to have diverted for personal use.\nHis admission of guilt at the High Court followed a three-count criminal charges bothering on breach of trust, diversion of N32.8 bn pension fund among others, brought against him by the government.\nHowever upon an appeal by the Economic and Financial Crimes Commission, the Court of Appeal on March 21, 2018 reversed the High Court judgment.\nHe asked the Apex Court to void the judgment so as not to make him suffer double jeopardy."
  },
  {
    "headline": "Condemnation as NIPOST fails to deliver consignment from Katsina to Oshogbo three months after dispatch",
    "summarized_story": "Precisely, Wale was assigned by his friend, an indigene of Osun State to help convey his left over property from Katsina State capital to his elder sister in Osogbo, Osun State.\nNIPOST slammed him with a bill of N25, 000 with a firm promise to deliver the listed items from Katsina to Osogbo in Osun State within the time frame of two weeks at most.\nThey do not know the location of the items many months after moving them from Katsina NIPOST Office.\nAccording to Husaini Bello, the Counter Manager, NIPOST Katsina, “This cargo issue is not peculiar to Wale’s items.\nWe either send such item to Funtua or Zaria because there is a stationed cargo there attached to Katsina zone which is under Kaduna zone."
  },
  {
    "headline": "Condemnation as NIPOST fails to deliver consignment from Katsina to Oshogbo three months after dispatch",
    "summarized_story": "Precisely, Wale was assigned by his friend, an indigene of Osun State to help convey his left over property from Katsina State capital to his elder sister in Osogbo, Osun State.\nNIPOST slammed him with a bill of N25, 000 with a firm promise to deliver the listed items from Katsina to Osogbo in Osun State within the time frame of two weeks at most.\nThey do not know the location of the items many months after moving them from Katsina NIPOST Office.\nAccording to Husaini Bello, the Counter Manager, NIPOST Katsina, “This cargo issue is not peculiar to Wale’s items.\nWe either send such item to Funtua or Zaria because there is a stationed cargo there attached to Katsina zone which is under Kaduna zone."
  },
  {
    "headline": "Professor Tunde Fatunde is dead",
    "summarized_story": "Tunde Fatunde, a a Professor of French Language in the Faculty of Arts, Lagos State University(LASU) is dead.\nHe was not just a teacher of the French language, he was also a newspaper columnist and dramatist.\nHe was until his death, the Professor of French Language in the Faculty of Arts at LASU.\nRichard Akinola, a veteran journalist wrote: “What a sad loss of a friend and comrade, Professor Tunde Fatunde.\nHenry Hunjo, a lecturer at LASU wrote: “Travel well, Prof Tunde Fatunde."
  },
  {
    "headline": "53 remanded over bloody street clashes in Niger, killing of cop",
    "summarized_story": "The Niger State Magistrate Court sitting in Minna has ordered that 53 suspects be remanded in New-Bussa Correctional Centre in Borgu LGA over their alleged involvement in bloody clashes and thuggery.\nThe suspects’ activities led to the killing of a police officer and a businessman last week Friday in Minna.\nProsecuting Police Officer, Inspector Ahmed Saidu had informed the court that the offence is criminal in nature and cannot be tried at the magistrate.\nThe presiding Magistrate, Nasir Mu’azu, adjourned the matter to February 21, 2022, for further mention.\nThe Niger State Police on Monday, January 24 arrested twenty-eight youths in the onslaught against youth restiveness, thuggery and other acts of criminality in Minna metropolis."
  },
  {
    "headline": "Medvedev to battle Nadal in Australian Open Final",
    "summarized_story": "World Number Two Russian Daniil Medvedev has booked a titillating Australian Open final with Rafa Nadal, who is hunting for a historic 21st Grand Slam title.\nMedvedev, the U.S. Open champion dismissed Greek Star and World Number seven, Stefanos Tsitispas in four sets on Friday, winning 7-6 6-4 4-6 6-1.\nHopes that Tsitsipas would stage a comeback fizzled out in the fourth set as Medvedev broke him twice to seal a second successive spot in the final.\nOnly Rafa Nadal now stands as an obstacle to his dream of winning in Australia.\nEarlier, he had said he had come to win the tournament."
  },
  {
    "headline": "UAE To Lift Entry Ban On Travelers From Nigeria From January 29",
    "summarized_story": "UAE To Lift Entry Ban On Travelers From Nigeria From January 29From Saturday, January 29, the United Arab Emirates (UAE) has confirmed that passenger flights from Nigeria and 11 other African countries would restart.\nOther nations affected include Ethiopia, Tanzania, Lesotho, Eswatini, Namibia, Zimbabwe, Mozambique, South Africa, Botswana, and the Republic of Congo.\nThe UAE authority also said the passengers must undergo a Rapid PCR test at the airports of departure.\nOn arrival in the UAE, they will be subjected to another PCR test.\nTravel restrictions were put in place by the Arab country in December last year, over the emergence of the Omicron variant of COVID-19."
  },
  {
    "headline": "Nigeria Shall Win Battle Over Evil ―Buhari",
    "summarized_story": "On Thursday, President Muhammadu Buhari stated that Nigeria will triumph over evil in the country.\nHe commiserated with them over the recent loss of lives and property as a result of outrageous attacks by bandits and other criminal gangs.\n“My condolences to the Sultanate, the government, and people of Sokoto State over the recent mindless killings by bandits and terrorists.\n“Nigeria shall win the battle over evil,” Buhari wrote in the visitors’ register.\nGovernor of Sokoto State, Aminu Tambuwal, and the Sultan expressed their gratitude to the President for the show of sympathy, assuring him of continued support towards peace and stability in the country."
  },
  {
    "headline": "Fourteen Kidnapped Students Of FGC Birnin Yauri Still In Captivity After 210 Days",
    "summarized_story": "Fourteen students and their teachers taken from the Federal Government College in Birnin Yauri, Kebbi State, on June 17, 2021, have still to be released by their kidnappers.\nMinister of State for Education, Chukwuemeka Nwajiuba, revealed the youngsters’ prolonged detention during his keynote address at the national campaign on out-of-school children in Birnin Kebbi, Kebbi State, on Thursday.\nHe did say, though, that the federal government was committed to releasing all of the youngsters held captive by terrorists.\nRemember that gunmen had kidnapped approximately 100 children and eight teachers from the school at the time.\nDuring the abduction, some of the students managed to flee the gunman, while others were rescued by security personnel."
  },
  {
    "headline": "Family Calls For Release Of Abducted Ex-President Jonathan’s Cousin",
    "summarized_story": "The family of Jephthah Robert, a cousin of Nigeria’s former President Goodluck Jonathan, has pleaded with his kidnappers to free him immediately.\nRobert was abducted from his home in Yenagoa, Bayelsa State, at 9:30 p.m. on Monday and taken to an unknown location.\nAccording to a statement signed by Austin Ekeinde, Azibaola’s media aide, the family demanded the man’s release on Thursday.\n“In particular, we express our appreciation to the Commissioner of Police, Bayelsa State, and the State Director of the Department of State Services for their determined assistance.\nThe abduction came a day after the Bayelsa State Commissioner for Industry, Trade and Investment, Federal Otokito, was released by his abductors."
  },
  {
    "headline": "Breaking: Shops burnt as explosion rocks Anambra (PICTURES)",
    "summarized_story": "Many shops and buildings burnt as Petrol tanker exploded at the Upper Iweka junction of Onitsha, Anambra state commercial city on Friday.\nThe fire which started at 8.30am had caused a long standstill of vehicles in and out of Onitsha.\nFire service both from Anambra and Delta states have arrived the scene and are battling to quench the fire amid a shortage of water as at the time of filling this report.\nDetails loading …"
  },
  {
    "headline": "North West APC legislators okay Bello for 2023 presidency, laud Buhari, Buni",
    "summarized_story": "The All Progressives Congress (APC) State Assembly Legislators of the North West Zone, have endorsed Kogi state Governor Yahaya Bello for the 2023 presidency.\nThe north west legislators also urged the Buni-led committee to zone the party’s Presidency to the north.\nMarafa said the North West legislators agreed to support their colleagues in the North Central for 2023 Presidency, saying the zone had been deprived of the number one position since Nigeria’s independent in 1960.\nKolawole described Bello as a young dynamic and energetic individual with capacity to manage Nigeria diversity, who would also fit into the demand for young president in 2023.\n“I believe that not only the North will support Bello’s ambition but the other zones of the country,” Lawal said."
  },
  {
    "headline": "Our job creation, economic policies working – Buhari",
    "summarized_story": "President Muhammadu Buhari has inaugurated a new three million metric tonnes per annum BUA Cement Sokoto Line 4 Factory in Sokoto, expressing delight that the federal government’s policies on economic diversification, job creation and an enabling environment for businesses to thrive were working.\nThis is necessary for job creation and indeed, for our economy and national security.\n”It is therefore very clear for all to see that our policies are working.\nPresident Buhari thanked the Founder of BUA Cement, Abdul Samad Rabiu and the entire team for the great work they were doing in supporting the government’s economic diversification and job creation agenda.\nThe President wrote in the visitors’ register: “My condolences to the Sultanate, the Government, and people of Sokoto State over the recent mindless killings by bandits and terrorists."
  },
  {
    "headline": "Fuel Tanker Explodes, Affects Buildings In Anambra",
    "summarized_story": "A tanker laden with substance suspected to be Premium Motor Spirit (PMS), also known as petrol, has exploded in Anambra State.\nAccording to reports, the incident occurred on Friday morning at the Upper Iweka junction of Onitsha – the state’s commercial hub.\nThe South East Zonal Coordinator of the National Emergency Management Agency (NEMA), Major Eze, also confirmed the explosion to Channels Television.\nHe explained that the tanker fell on the road, after which it exploded as a result of the fire from a woman frying Akara on the roadside.\nThe incident caused a gridlock in the area, leaving many commuters travelling in and out of Onitsha stranded."
  },
  {
    "headline": "Two New Speed Trains To Be On Track By 2022 Fourth Quarter – Sanwo-Olu",
    "summarized_story": "﻿The two new high-speed trains recently purchased by the Lagos State government will be on track latest by the fourth quarter of the year, Governor Babajide Sanwo-Olu has said.\nGovernor Sanwo-Olu disclosed this on Friday during an interview on Sunrise Daily where he outlined efforts being made by his administration to address the gridlock on Lagos roads.\n“The trains will be on track by the fourth quarter; the terminal stations will be ready by the fourth quarter,” he stated during his appearance on the Channels Television breakfast programme.\n“Lagosians will be actively moving with trains by the fourth quarter of this year.\nCommon SystemGiving further insights into the operations of the trains during Friday’s interview, Governor Sanwo-Olu explained that the government would be completing testing of the coaches soon."
  },
  {
    "headline": "UAE Relaxes Entry Ban On Nigerian Travellers From Saturday",
    "summarized_story": "The United Arab Emirates (UAE) will resume passenger flights from Nigeria and 11 other African countries on Saturday, January 29.\nREAD ALSO: FIRS Generates Record N6.4trn Revenue In 2021The country’s agency said entry procedures have been updated for flights originating from Ghana, Rwanda, and Uganda.\nAccording to the statement, passengers arriving from these three countries to the UAE must have a negative COVID-19 test obtained within 48 hours of departure from the approved labs in their respective countries.\nOn arrival in the UAE, they will be subjected to another PCR test, asking residents of African countries to refrain from travelling to the country if they have COVID-19 symptoms.\nSimilarly, Emirates Airline, the flag carrier of the UAE, also suspended flights to several African nations due to the directive."
  },
  {
    "headline": "FIRS Generates Record N6.4trn Revenue In 2021",
    "summarized_story": "The Federal Inland Revenue Service (FIRS) has generated a record N6.4 trillion as revenue in 2021, the highest in its history.\nThis year’s revenue collection exceeded that of 2019 when the agency raked in N5.3 trillion under the administration of Babatunde Fowler.\n“Companies Income Tax amounted to N1.896 trillion; Petroleum Profits Tax amounted to N2 trillion; Value Added Tax amounted to N2.07 trillion; Electronic Money Transfer Levy amounted to N114 billion; Earmarked Taxes amounted to N208.8 billion; among others.\n“Non-oil sector contributed 69 percent of the total collection in the year, while oil sector’s contribution was 31 percent of the total collection.\n007 of 2019.”Wojuola stated that in line with the law, 2021 income tax revenue was a function of the outcome of business activities in 2020."
  },
  {
    "headline": "Nearly 40% Of Tigrayans Face ‘Extreme Lack Of Food’ – UN",
    "summarized_story": "Nearly 40 per cent of people in Ethiopia’s Tigray are suffering “an extreme lack of food” in the face of an extended de-facto blockade of the war-hit region, a UN agency said Friday.\nThe dire assessment published by the World Food Programme (WFP) comes as humanitarian groups are forced to increasingly curtail activities because of fuel and supply shortages, with aid having to be delivered by foot.\n“Families are exhausting all means to feed themselves, with three-quarters of the population using extreme coping strategies to survive,” WFP said in a statement.\nDelivering Aid on FootTigray itself has for months been subject to what the UN says is a de-facto blockade.\nLast week, the UN said food distribution in Tigray had reached an all-time low."
  },
  {
    "headline": "Analysts discuss \"Not Too Young to Run Bill\", youths participation in politics -",
    "summarized_story": "On May the 31st, 2018, President Muhammadu Buhari signed the Not-Too-Young-To-Run bill into law.\nThis was part of efforts to get young Nigerians to be more involved in politics.\nAs Nigerians gear up towards the 2023 Election season, youths are being encouraged to participate more in the process by registering for their permanent voter cards, contesting elective positions, and also going out to cast their ballot.\nAdvertisement"
  },
  {
    "headline": "BREAKING: Biodun Oyebanji wins Ekiti APC governorship ticket -",
    "summarized_story": "A former Secretary to the Ekiti State Government, Biodun Oyebanji, has emerged the candidate of the All Progressives Congress in Ekiti State.\nMr Oyebanji emerged victorious with 101,703 votes, defeating seven other contestants.\nAdvertisementBreakdown of the votes shows that Bamidele Faparusi polled a total of 376 votes, Ojo Kayode had 767 votes, Opeyemi Bamidele, a serving Senator had 760 votes, Dayo Adeyeye, a former lawmaker polled 691 votes, Femi Bamisile polled 400 votes,.\nOthers are Toyin Afolabi who polled 47 votes and Demola Popoola who scored 239 votes.\nAdvertisementEarlier, seven aspirants announced their withdrawal from the contest, citing irregularities as reason for their exit."
  },
  {
    "headline": "Deposed Deji of Akure, Oba Oluwadare Adepoju, is dead",
    "summarized_story": "The deposed Deji of Akure, Oba Oluwadare Adepoju, has passed on in the early hours of Thursday after a brief illness.\nAdvertisementThe deceased, who ruled for five years, was deposed by the former Governor of Ondo State, Olusegun Mimiko, following a crisis between him (Adepoju) and his wife, Late Bolanle Adepoju that led to a free-for-all between the couple.\nAccording to the statement, “Oba Oluwadare Adepoju has passed on to the eternal glory this morning, January 27, 2022 during a brief illness.\n“The late Oba Adepoju was deposed by former Governor of Ondo State, Dr. Olusegun Mimiko on grounds of misunderstanding between the monarch and his wife.\nAdvertisement“Before his transition to the eternal glory, the deposed monarch prayed for the peace of Akure Kingdom”“He said he did his best in defending his people while on the throne”AdvertisementHe was the first monarch to be deposed in the history of Akure"
  },
  {
    "headline": "Protest rocks Ekiti APC Secretariat few hours to primary election",
    "summarized_story": "Few hours before the start of the Direct Primary in Ekiti State, several disgruntled party members have approached the Secretariat armed with various placards, protesting what they call “Midnight Robbery.”Protesters claim that election materials were sent overnight to government appointees, implying that the Governor is attempting to force his favored candidate on the party.\nAdvertisementThree of the aspirants, Michael Opeyemi Bamidele, Kayode Ojo, and Bamidele Faparusi, also joined the protest requesting for the primary election to be postponed."
  },
  {
    "headline": "Superb Nadal into Australian Open Final after Win Over Berrettini",
    "summarized_story": "Rafael Nadal moved one win away from a record 21st Grand Slam men’s title after a dominant start enabled him to beat Italy’s Matteo Berrettini in the Australian Open semi-finals.\nSeventh seed Berrettini eventually turned the match into a contest, but Nadal completed a 6-3 6-2 3-6 6-3 win.\nTsitsipas, 23, is targeting his maiden Grand Slam title – after losing to Djokovic in last year’s French Open final – and his first Melbourne final.\nWhen Nadal sealed the second set after one hour and 25 minutes, Berrettini had already hit 24 unforced errors.\nServing for the match, Nadal started with a double fault but clinched victory when Berrettini put another backhand into the net."
  },
  {
    "headline": "Russia Says It Won’t Start a War as Ukraine Tensions Mount",
    "summarized_story": "Tensions have soared in recent weeks, and the United States and its NATO allies worry that the concentration of about 100,000 Russian troops near Ukraine heralds Moscow’s intention to attack the ex-Soviet state.\nAs tensions build, Washington warned Moscow of devastating sanctions if it invades Ukraine, including penalties targeting top Russian officials and key economic sectors.\nSeveral senior U.S. officials also said Thursday that Germany would not allow a newly constructed pipeline — which is meant to bring gas directly from Russia — to begin operations if Russia invades Ukraine.\nAsked about possible sanctions, Lavrov said that Moscow had warned Washington that their introduction would amount to a complete severing of ties.\nThe Russian military also has moved troops to Belarus, which borders Ukraine, for sweeping joint drills, raising Western fears that Moscow could stage an attack from the north."
  },
  {
    "headline": "Brace for Russian Cyber Attacks as Ukraine Crisis Deepens, Britain Warns",
    "summarized_story": "The United States, the European Union and Britain have repeatedly warned Putin against attacking Ukraine after Russia deployed around 100,000 troops near the border with its former Soviet neighbour.\nRussian officials say the West is gripped by Russophobia and has no right to lecture Moscow on how to act after it expanded the NATO military alliance eastwards after the 1991 fall of the Soviet Union and sowed chaos in Iraq and Syria.\nBritain warned big business on Friday to bolster defences against possible Russian cyber attacks as Western fears deepened that President Vladimir Putin would order his troops to annex another part of Ukraine.\nBritain’s National Cyber Security Centre (NCSC), a part of the GCHQ eavesdropping intelligence agency, warned large organisations to bolster their cyber security resilience amid the deepening tensions over Ukraine."
  },
  {
    "headline": "Search Halted for Survivors of Capsized Boat off Florida, Leaving 34 Lost at Sea",
    "summarized_story": "Round-the-clock search operations were halted at nightfall, Coast Guard Petty Officer Jose Hernandez said, hours after U.S. authorities reported recovering four more bodies, bringing the tally of confirmed fatalities to five.\nA lone survivor was rescued on Tuesday morning after a tug boat crew found him clinging to the mostly submerged hull of the overturned boat.\nThe U.S. Coast Guard on Thursday called off a three-day search for 34 people lost at sea off Florida from a boat that capsized while engaged in what officials suspect was an attempt to smuggle migrants into the United States from the Bahamas.\nThe Coast Guard said 189 people on that boat were turned over to Haitian authorities on Thursday.\nVoyages of vessels carrying Haitian migrants have grown more frequent as the Caribbean island nation faces worsening economic and political crises, as well as gang-related kidnappings."
  },
  {
    "headline": "Ex-Senate President Anyim ‘Will Contest’ for President in 2023, Regardless of PDP’s Zoning Decision",
    "summarized_story": "I am not seeking to lead a region but the entire country,” Anyim said during an interactive session with multi-media publishers in Abuja.“Whether zoning or no zoning, I will contest.\nI have acquired a lot of experience to run the affairs of the country,” the former Senate President said.\nOn his fight against corruption, Anyim said he would ensure institutions were strengthened.\nFor the institutions, we will put in place messures that will not allow corruption.\nWe will use a modern system that won’t allow a window for corruption,” Anyim explained."
  }
]