[
  {
    "headline": "South Africa’s unemployment rate hits new high -Report",
    "summarized_story": "The unemployment rate in South Africa soared to its highest level on record in the final quarter of last year, official data showed Tuesday, as the impact of the pandemic continues to be felt.\nThe unemployment rate rose from 0.4 per cent to 35.3 per cent in the final three months of 2021, compared to 34.9 per cent in the previous quarter.\n“This is the highest unemployment rate recorded since the start of the (quarterly labour force survey) in 2008,” StatsSA said in a report.\nCompared to the 14.5 million South Africans with jobs, there are now about 7.9 million unemployed people in the continent’s most industrialised country.\nThe hardest COVID-hit African country has been diagnosed with more than 3.7 million infections, including 99,970 fatalities."
  },
  {
    "headline": "Train attack: Family members apprehensive over whereabouts of commuters",
    "summarized_story": "Some family members of passengers aboard the Kaduna-bound train attacked on Monday have expressed anxiety over the fate of their relatives.\nSpeaking to the News Agency of Nigeria at the Rigasa Railway station in Kaduna on Tuesday, they said they were yet to establish contact, 14 hours after the tragic incident.\nMr Mohammed Barau, a resident of the Ungwan Rimi area of Kaduna, said he was at the train station to have an update regarding the incident, adding that his younger brother was in the train attack.\nHe said the staff of Kaduna State Emergency Management Agency and the Nigerian Red Cross, Kaduna chapter, conducted the evacuation.\nMeanwhile, train service including other business activities at the Rigasa Railway station, Kaduna, has been grounded as a result of the incident."
  },
  {
    "headline": "Abuja-Kaduna Train Attack: 7 passengers feared killed, many missing",
    "summarized_story": "Chief of Army Staff, Lieutenant General Faruk Yahaya at the scene of the bomb attack on an Abuja-Kaduna train.\nBy Ibrahim Hassan-WuyoNo fewer than seven persons are feared dead, following terrorists’ bomb attack on an Abuja-Ibadan route train.\nSources close to the Rigasa Train Station in Kaduna said that seven passengers were killed during the attack, with some missing, while the attackers left with many.\nRelevant authorities were, however, liaising with the Nigerian Railway Corporation (NRC) to ascertain the identity of the passengers from manifest, for efficient tracking.\nThe Managing Director/CEO of the Nigerian Railway Corporation, Mr. Fidet Okhiria, had earlier confirmed the attack but did not give details."
  },
  {
    "headline": "We’ve kidnapped children from Lagos to Ibadan for rituals — Suspect",
    "summarized_story": "A liquid substance, which he said was administered on their victims to put them to sleep, was recovered from him.\nI can’t tell how many children we have kidnapped in Lagos.\nSome of the areas in Lagos where we have kidnapped children are Berger, Ikotun, Iyana-Oba, Iyana-Ipaja.\nOur targets are usually children between four and seven years, who are not able to shout for help.\nThe State Chairman of the Christian Association of Nigeria, Niger State Chapter,(CAN) Reverend Mathias Echioda when contacted simply said, “I can only confirm to you of the Catholic Reverend kidnapped."
  },
  {
    "headline": "Cartoon: APC or PDP?",
    "summarized_story": ""
  },
  {
    "headline": "2023: Metuh kicks against zoning, wants Presidential ticket open to all",
    "summarized_story": "…As association picks Reps nomination forms for AjiaBy Dirisu YakubuFormal national publicity secretary of the Peoples Democratic Party, PDP, Chief Olisa Metuh has advised the party’s zoning committee not to shut the door against any aspirant in the name of zoning.\nAccording to Metuh, PDP will be going into the 2023 general election as an opposition party and as such must tread carefully before taking a position on the sensitive issue.\nIn a letter addressed to the 37-man committee chaired by Benue state governor, Dr. Samuel Ortom, Metuh said opening the race to qualified party members regardless of geo-political zone, would deepen conversation across board, preparatory to the Presidential primaries.\n“There have been arguments about the fairness of zoning to the south after eight years of the Buhari Presidency.\nIn 2015, we adopted sole candidacy and dampened the morale of members to openly campaign for the PDP."
  },
  {
    "headline": "2023: Consensus candidacy, good for PDP – Ishaku",
    "summarized_story": "By Dirisu YakubuTaraba state governor, Darius Ishaku has thrown his weight behind a consensus Presidential candidate ahead of the Peoples Democratic Party, PDP primaries slated for May 28.\nIshaku made the pledge while playing host to the trio of Bukola Saraki, Aminu Tambuwal and Bala Mohammed, who are contesting the Presidential ticket of the PDP.\nwe have shown Nigerians how to rule and manage thier affairs and I think we should still be the leaders.\n“I am sure my colleagues too will give you the same support and any right thinking person should be able to support this mission.\nPeople could travel midnight from here to Lagos and Maiduguri before, but now, even in the afternoon you cannot travel."
  },
  {
    "headline": "Kaduna airport attack: Buhari told to sack Monguno, Bashir Magashi immediately",
    "summarized_story": "President Muhammadu Buhari has been told to, without any further delay, sack his National Security Adviser, NSA, Major General Babagana Monguno (rtd), and the Minister of Defence, Major General Bashir Salihi Magashi (rtd).\nHURIWA, in a statement signed by Comrade Emmanuel Onwubiko, its National Coordinator, expressed disappointment and sadness with the increasing spate and sophistication of coordinated attacks by unknown gunmen in Imo State and terrorists in North West.\nThe rights group wonders whether the President is waiting for the terrorists to launch a daring invasion of the National Assembly complex within the three arms zone of Abuja before he would realise that he has no effective National Security Adviser and Minister of Defence.\nHURIWA, therefore, appealed to Buhari to take urgent action because the terrorists are becoming even more daring and emboldened because they feel they have nothing to fear.\nHURIWA blames what it calls the dysfunctionality of the National defence strategy and the non-workability of any sort of national security strategy put forward by Monguno and Magashi for the upsurge in terror attacks."
  },
  {
    "headline": "Abuja-Kaduna train: Army Chief Yahaya visits scene of terror attack",
    "summarized_story": "The Chief of Army Staff (COAS), Lieutenant General Faruk Yahaya, has visited the scene of the Abuja-Kaduna train attack.\nYahaya was accompanied by some principal staff officers of the Army Headquarters and the General Officer Commanding 1 Division.\nHe assessed the security situation around the general area, inspected the attacked train and the rail track to evaluate the degree of damage.\nThe COAS ordered the troops and other security agencies to intensify their search and rescue operations to ensure kidnapped victims are rescued unconditionally.\nYahaya assured Nigerians that troops will be undeterred and vehement in the fight against banditry and other forms of criminality."
  },
  {
    "headline": "Ex-Zamfara Deputy Gov injured in Abuja-Kaduna train attack – APC",
    "summarized_story": "A former Deputy Governor of Zamfara State, Malam Ibrahim Wakkala Linan, has been seriously injured in the Abuja-Kaduna train attack by terrorists and has been admitted to a military hospital in Kaduna State.\nThis was confirmed by the state publicity secretary of the All Progressives Congress (APC) in Zamfara State, Mallam Yusuf Idris Gusau.\nAccording to him, the former Deputy Governor was initially abducted by the terrorists during the attack but was rescued by the combined forces of the Department of State Services (DSS) and military operatives during a gun battle with the terrorists.\n“However, he is responding very much to treatment at the military hospital in Kaduna State.”DAILY POST gathered that a photo of the former deputy Governor of Zamfara State, Ibrahim Wakkala, was released after the attack.\nAccording to a DAILY POST investigation, the former Deputy Governor was returning from the APC National Convention which was held on Saturday when the train he boarded was shot during a gun battle between the terrorists and the military."
  },
  {
    "headline": "Abuja-Kaduna train: El-Rufai has failed, playing with lives – Nigerians react",
    "summarized_story": "Governor of Kaduna State, Nasir El-Rufai has come under serious criticism as terrorists continue to attack residents of the state.\nDAILY POST reported earlier that bandits, around 6 pm, blew up rail tracks and attacked the Abuja-Kaduna train on Monday.\nNigerians have demanded accountability and a solution to insecurity in Kaduna State as bandits continue to attack communities.\nYet, these men are tightly protected while the innocent Nigerians are paying for the sins they never committed.”@ItsTheLazyChef “Businesses have crumbled, thousands of lives have been lost yet El Rufai still doesn’t know what to do.\nNigeria must have a voice.”@I_amchukaa “El Rufai is playing games with people’s lives."
  },
  {
    "headline": "Nigeria vs Ghana: Super Eagles coach, Eguavoen makes promise to Nigerians",
    "summarized_story": "Super Eagles interim coach, Augustine Eguavoen, has promised Nigerians that they will be happy at the end of Nigeria’s 2022 FIFA World Cup second leg playoff against Ghana.\nEguavoen’s men will battle the Black Stars in today’s World Cup playoff at the Moshood Abiola Stadium, Abuja.\nBoth teams had drawn 0-0 in the first leg in Kumasi last Friday.\nBut Eguavoen is optimistic the Super Eagles will be victorious at the end of the second leg.\n“I want to urge all Nigerian fans and football lovers to support the team,” Eguavoen told a press conference on Monday."
  },
  {
    "headline": "Nigeria vs Ghana: Seven things to expect in Qatar 2022 play-off",
    "summarized_story": "Will the Super Eagles coaching crew be tempted to unleash both strikers against Ghana following their goal scoring feats at their respective clubs.\n6: Nigeria needs an outright win to edge Ghana as any score draw will spell doom for the coach Austin Eguavoen- led Super Eagles.\n7: They say figure seven is magical hence Nigeria stands a good chance to qualify for her seventh FIFA World Cup finals.\nThe Super Eagles have qualified for every edition of the World Cup bar Germany 2006 since their debut at USA 1994 Finals.\nThe Super Eagles were also at France ’98, Korea/ Japan 2002; South Africa 2010; Brazil 2014 and Russia 2018."
  },
  {
    "headline": "11 things you probably didn’t know about new Soun of Ogbomoso, Pastor Olaoye",
    "summarized_story": "11 things you probably didn’t know about new Soun of Ogbomoso, Pastor OlaoyeSenior Pastor of the Redeemed Christian Church of God (RCCG) Jesus House Washington DC Parish, Pastor Afolabi Ghandi Olaoye, has stated his ambition to be the new Soun of Ogbomoso is the will of God.\nHere are things to know about the new Soun of Ogbomoso:1.\nHis parish ‘Jesus House’, Washington DC is the biggest RCCG church in America.\nHe pastored three RCCG Churches in Nigeria, an RCCG Parish in Bonn, Germany before moving to the United States.\nHe is happily married to Pastor Omo, who also played a key role in running the affair of the church."
  },
  {
    "headline": "Becoming Soun of Ogbomoso has God’s backing – RGGC Pastor Olaoye",
    "summarized_story": "Senior Pastor of the Redeemed Christian Church of God (RCCG) Jesus House Washington DC Parish, Pastor Afolabi Ghandi Olaoye, has stated his ambition to be the new Soun of Ogbomoso is the will of God.\nThe Nation had exclusively reported how the RCCG pastor was picked by kingmakers to become the new Soun of Ogbomoso.\nAccording to him: “All I am doing is to obey God.\nYou will be angry that God spoke to me and I did not obey.\nRead Also: How RCCG pastor emerged Soun of Ogbomoso“I told God if it is not your will, Lord stop it, let it not go through."
  },
  {
    "headline": "Terrorists set octogenarian ablaze in Niger",
    "summarized_story": "Terrorists, who invaded Zazzaga community in Munya local government area of Niger State, have set an 80-year-old man ablaze.\nThe octogenarian, whose name is yet disclosed, was burnt alive when the terrorists razed houses in the community after they met an empty community.\nThe terrorists looted shops and houses before they proceeded to Sohon Kabula and Mangoro communities.\nThey have raided 15 communities across three local government areas of Shiroro, Munya and Paikoro in the last 48 hours.\nThe Nation learnt another attack occurred on Monday around 4 pm when the terrorists invaded Aboloso, Kudamin and Dakolo in Kafin Koro district of Paikoro local government area."
  },
  {
    "headline": "Osinbajo hails Tinubu’s contributions to federalism at 70",
    "summarized_story": "Vice President Yemi Osinbajo has hailed the National Leader of the ruling All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, for his contributions to the advancement of federalism and party organisation.\nAnd it is a unique one indeed; the Platinum Jubilee and the completion of yet another remarkable decade.\nNot only did you query the limitations which had beset our federalism, you actively encouraged the use of the legal process in clarifying the constitution.\n“Asiwaju, your decades of sterling contributions in the public and political spheres are remarkable.\nIn particular, your endeavours in the advancement of federalism, electoral reform, and party organisation have helped to enrich our democratic experience,” the Vice President said."
  },
  {
    "headline": "Two killed as terrorists attack Abuja-Kaduna bound train",
    "summarized_story": "Two persons a cleaners and a workers of the attacked Abuja-Kaduna train have been confirmed dead , following the attack on the train late Monday night.\nThe two persons identified as Loretta and Abdul are confirmed to be the only casualty for now, in the fierce late night attack on the train that was bearing about 970 passengers.\nUnofficial sources said also that some security personnel and passengers have been killed by the rampaging terrorists but their names have yet to be released.\nIt was earlier reported that the terrorists had attacked the Nigerian Railway Corporation train from Abuja to Kaduna on Monday night had abducted some of the stranded passengers.\nAbuja to Kaduna train; gunshots still being fired around us."
  },
  {
    "headline": "2023: PDP plotting another EndSARS protest –FG",
    "summarized_story": "From Adetutu Folasade-Koyi, AbujaThe Federal Government has accused the Peoples Democratic Party (PDP) of plotting another round of EndSARS protest and peddling lies about the government of President Muhammadu Buhari.\nHow do you explain their threat of another EndSARS that pushed Nigerian to the brink?\nWe were there before and we remain the ones to beat in terms of a determined, viable and relentless opposition.\nThe minister dismissed the opposition party’s claim that the PDP government handed over $550 billion economy, with single digit inflation and a much reduced debt profile.\nThey wrecked the country’s infrastructure and we are rebuilding them?…When PDP left, 21 states could not pay the salary of their staff."
  },
  {
    "headline": "Umahi, Rabiu, Lawan, Sanwo-Olu, Bala Mohammed, Uzodimma, Zulum, Ngige, Amaechi, Toyin Saraki, Ekwunife, Dokpesi, Akande win The Sun Awards",
    "summarized_story": "Governor of Ebonyi State, Dave Umahi; chairman of BUA Group, Alhaji Abdulsamad Rabiu; Senate President, Ahmad Lawan and 23 others have been named as winners of The Sun Awards 2021.\nUnveiling the award winners yesterday, the Management of The Sun Publishing Limited said Governor Umahi and Alhaji Rabiu emerged as Man of the Year, while Lawan won the Political Icon of the Year award.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nOther winners are Governor Babajide Sanwo-Olu of Lagos State, Governor Hope Uzodimma of Imo State and Governor Bala Mohammed of Bauchi State, who emerged as winners of Governor of the Year award, with Governor Babagana Zulum of Borno State, as winner of Courage in Leadership award.\nIn the business categories, Chief Benson Madubuko, chairman/CEO, De Chico Group and Alhaji Auwalu Rano of AA Rano Oil won Entrepreneur of the Year award,"
  },
  {
    "headline": "2023: INEC explains delay in distribution of PVCs, confirms fixing BVAS challenges",
    "summarized_story": "INEC Chairman, Mahmood Yakubu, who made the disclosure, also confirmed that the commission has found a permanent solution to the malfunctioning Bimodal Voter Accreditation System (BVAS) ahead of the 2023 general election.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\n“I am glad to report that the commission has completed the ABIS for the first and second quarter of the CVR.\nThe commission is meeting next week and the detailed dates and locations for the collection of PVCs will be announced.\nThe commission has also introduced a number of new innovations that we need to perfect ahead of the general election."
  },
  {
    "headline": "SSANU, NASU strike grounds public varsities",
    "summarized_story": "By Gabriel Dike, Seye Ojo, Ibadan, Fred Ezeh, AbujaAdministrative activities and essential services in the state and federal universities were, yesterday, grounded following the strike by the two non-teaching staff unions.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nJoint Action Committee (JAC) of the Senior Staff Association of Nigerian Universities (SSANU) and the Non-Academic Staff Union (NASU) on March 25 directed its members nationwide to embark on strike.\nBranch Chairman of NASU University of Lagos, Kehinde Ajibade, told Daily Sun that the campus is deserted because members complied with the directive to down tools.\nChairman of SSANU University of Ibadan chapter, Abiodun Omisore, said the union recorded 90 per cent compliance on the first day of the nationwide strike declared by the national body."
  },
  {
    "headline": "Breaking: Passengers Trapped in Train Attacked by Terrorists Evacuated, Kaduna Confirms Fatalities",
    "summarized_story": "*Injured passengers moved to hospitals*Search and rescue operations for missing passengers under wayBy John Shiklam in KadunaThe Kaduna state government said the evacuation of passengers attacked by terrorists in the Kaduna bound train on Monday has been concluded.\nThe statement said, “Evacuation of passengers on the trapped Kaduna-bound train from Abuja has been concluded this morning by security forces, officials of Kaduna State Emergency Management Agency (SEMA) and Nigerian Red Cross.\n“Passengers who sustained injuries, and other fatalities, have been moved to hospitals.\n“The passengers were evacuated from different hard-to-reach areas in forests and rocky locations in Audujongom, off the Kaduna-Abuja Road.\n“As stated yesterday, the Kaduna State Government is still liaising with the Nigerian Railway Corporation (NRC) to ascertain the list from the passengers manifest for efficient tracking."
  },
  {
    "headline": "Breaking: NRC Suspends Abuja-Kaduna Rail Services Indefinitely",
    "summarized_story": "Kasim Sumaina in AbujaSequel to Monday night’s terrorists’ attack on Abuja-Kaduna train, the Nigerian Railway Corporation has suspended train operations along the Abuja-Kaduna route indefinitely.\nIn a post on its official Twitter handle @Official_NRC on Tuesday morning,the NRC said the suspension was due to unforeseen circumstances.\nMeanwhile the NRC is yet to release information on the number of passengers injured or kidnapped during the attack at the time of this report.\nMore details later..Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "48 Hours After Attacking Kaduna Airport, Terrorists Blow Up Abuja-Kaduna Train",
    "summarized_story": "Abuja to Kaduna train.\nI am a living witness.”There were at least 970 passengers onboard the train, according to official sources familiar with the train service.\nThe government said, “The Kaduna State Government received multiple reports of an attack on the Abuja-Kaduna train service at around Kateri-Rijana general areas.\nThe Kaduna State government said, “The government of Kaduna State will be liaising with the Nigerian Railway Corporation (NRC) to ascertain the list from the passengers’ manifest for efficient tracking.\n12 of Kaduna Airport Attackers Killed, Says ArmyIn a related development, the 1 Division of the Nigerian Army, Kaduna, yesterday, said, “About 12” of the terrorists that attacked the Kaduna International Airport on Saturday were killed through air strike."
  },
  {
    "headline": "Lai Mohammed Blames PDP for Laying Foundation for Nigeria’s Misery",
    "summarized_story": "The government alleged that the mismanagement of national resources by the opposition party at a time the economy was buoyant laid the foundation for the current woes.\nMinister of Information and Culture, Alhaji Lai Mohammed, made the accusation yesterday at a no-holds-barred press briefing in Abuja.\nMohammed stated further, “Gentlemen, there is nothing wrong in having a fiery and viable opposition in a democracy.\nWe were there before and we remain the ones to beat in terms of a determined, viable and relentless opposition.\nThe main opposition party slammed Mohammed for provocatively claiming that Nigerians were better off under the APC."
  },
  {
    "headline": "Emefiele: My Focus is on Robust Monetary Policy, Building Strong Financial System",
    "summarized_story": "In the Tweet, Emefiele stated that he was committed to building a strong financial system in an increasingly uncertain global economy.\nHe added that he remained committed to raising N15 trillion for the Infrastructure Company (InfraCo) to boost infrastructure financing in the country.\nThe CBN governor stressed that he was focused on his job, even as he pledged to continue to support the federal government’s economic recovery drive.\nGiving the breakdown of how the facility was disbursed, Emefiele revealed that 648,052 households and owners of small and medium scale Enterprises (SMEs) benefited from the federal government-driven policy.\nWe have to go beyond lectures by being practical in dealing with policies that can benefit poor Nigerians,” the Bishop advised."
  },
  {
    "headline": "BREAKING: Terrorists Kill Three Persons In Ongoing Attack On Niger State Community, Residents Flee Homes",
    "summarized_story": "At least three persons have been killed in an ongoing attack on Kabo Village in the Gurara Local Government Area of Niger State by armed Fulani herdsmen.\nThe suspected terrorists, SaharaReporters reliably gathered, arrived in the community in large numbers on Monday afternoon, shooting sporadically in different directions.\nMost residents of the village were said to have been hit by bullets while fleeing into nearby bushes for safety.\nOn March 17, 2022, armed men killed a police officer during an attack on Bangi Divisional Headquarters in the Mariga Local Government Area of the state.\nA day before that incident, bandits killed four police officers including a divisional police officer, Muhammad Umar, and four vigilantes in the Magama council area of the state."
  },
  {
    "headline": "BREAKING: Terrorists Kill Three Persons In Ongoing Attack On Niger State Community, Residents Flee Homes",
    "summarized_story": "At least three persons have been killed in an ongoing attack on Kabo Village in the Gurara Local Government Area of Niger State by armed Fulani herdsmen.\nThe suspected terrorists, SaharaReporters reliably gathered, arrived in the community in large numbers on Monday afternoon, shooting sporadically in different directions.\nMost residents of the village were said to have been hit by bullets while fleeing into nearby bushes for safety.\nOn March 17, 2022, armed men killed a police officer during an attack on Bangi Divisional Headquarters in the Mariga Local Government Area of the state.\nA day before that incident, bandits killed four police officers including a divisional police officer, Muhammad Umar, and four vigilantes in the Magama council area of the state."
  },
  {
    "headline": "Breaking: Four Students Killed As Secondary School Building Collapses In Cross River",
    "summarized_story": "A building housing several classrooms at Diamond Grammar College, Ikang under Bakassi Local Government Area of Cross River State, has collapsed, killing four students in the process.\nThe tragedy, according to findings by SaharaReporters, occurred on Friday afternoon as students were taking an examination in the school.\n“I saw dead bodies of students being moved out of the school immediately after the building collapsed.\n“The heavy rain compounded the whole problem as it made the evacuation of students trapped in the collapsed building quite difficult for rescuers,” an eyewitness living close to the school told SaharaReporters.\n“It is individual and community efforts that have been helping affected families manage the situation since Friday when the building collapsed."
  },
  {
    "headline": "Breaking: Four Students Killed As Secondary School Building Collapses In Cross River",
    "summarized_story": "A building housing several classrooms at Diamond Grammar College, Ikang under Bakassi Local Government Area of Cross River State, has collapsed, killing four students in the process.\nThe tragedy, according to findings by SaharaReporters, occurred on Friday afternoon as students were taking an examination in the school.\n“I saw dead bodies of students being moved out of the school immediately after the building collapsed.\n“The heavy rain compounded the whole problem as it made the evacuation of students trapped in the collapsed building quite difficult for rescuers,” an eyewitness living close to the school told SaharaReporters.\n“It is individual and community efforts that have been helping affected families manage the situation since Friday when the building collapsed."
  },
  {
    "headline": "Terrorists’ Attack: Air Peace Suspends Flights To Kaduna Airport",
    "summarized_story": "Air Peace has suspended flight operations to Kaduna International Airport in Kaduna State.\nRecall that on Saturday, a staff of the Nigerian Airspace Management Authority was shot dead as bandits invaded the Kaduna Airport.\nThis is even as the bandits prevented an Azman aircraft scheduled for Lagos from taking off at the Kaduna Airport.\nHours later, the news of Air Peace halting operations to Kaduna broke.\nThe development was confirmed by Air Peace Spokesman, Stanley Olisa who did not go into further details."
  },
  {
    "headline": "Road, rail and air to Kaduna unsafe: Is the military still 'winning' the war against insecurity?",
    "summarized_story": "In another instance, eight students of ABU were abducted during an attack on motorists along the road in November 2020.\nIn 2019, Rotimi Amaechi, minister of transportation, said the daily passenger traffic on the Abuja-Kaduna rail line had tripled.\nEVEN AIR TRAVEL IS NOT SAFETransportation by air is dubbed the safest form of transportation but that may not be the case for Kaduna travellers.\nMeanwhile, Azman Air has announced the suspension of flights to Kaduna over the recent attack on the airport.\nThe truth of the matter is that the Nigerian government is winning the war against insurgents,” had Mohammed said."
  },
  {
    "headline": "Road, rail and air to Kaduna unsafe: Is the military still 'winning' the war against insecurity?",
    "summarized_story": "In another instance, eight students of ABU were abducted during an attack on motorists along the road in November 2020.\nIn 2019, Rotimi Amaechi, minister of transportation, said the daily passenger traffic on the Abuja-Kaduna rail line had tripled.\nEVEN AIR TRAVEL IS NOT SAFETransportation by air is dubbed the safest form of transportation but that may not be the case for Kaduna travellers.\nMeanwhile, Azman Air has announced the suspension of flights to Kaduna over the recent attack on the airport.\nThe truth of the matter is that the Nigerian government is winning the war against insurgents,” had Mohammed said."
  },
  {
    "headline": "Doctor in Abuja-Kaduna rail attack dies — after being trolled on Twitter for saying she was shot",
    "summarized_story": "The gunmen were said to have blown up the rail track after which they launched an attack on the passengers.\nAdvertisementShortly after the attack, Chinelo posted on her Twitter handle that she was shot in the train, while calling for prayers from her followers.\nOn Tuesday, the Nigerian Twitter space was flooded with posts saying the doctor has died from the gunshot wounds she sustained from the attack.\nI have been shot please pray for me.” was her last tweet 10hours ago and many of you used her to chase clout.\nDr. Chinelo R.I.P — SportsDokita (Odogwu☝️) (@Sports_Doctor2) March 29, 2022"
  },
  {
    "headline": "Doctor in Abuja-Kaduna rail attack dies — after being trolled on Twitter for saying she was shot",
    "summarized_story": "The gunmen were said to have blown up the rail track after which they launched an attack on the passengers.\nAdvertisementShortly after the attack, Chinelo posted on her Twitter handle that she was shot in the train, while calling for prayers from her followers.\nOn Tuesday, the Nigerian Twitter space was flooded with posts saying the doctor has died from the gunshot wounds she sustained from the attack.\nI have been shot please pray for me.” was her last tweet 10hours ago and many of you used her to chase clout.\nDr. Chinelo R.I.P — SportsDokita (Odogwu☝️) (@Sports_Doctor2) March 29, 2022"
  },
  {
    "headline": "Sources: Train driver, food vendors, cleaners killed in Abuja-Kaduna rail attack",
    "summarized_story": "Several persons including one of the train drivers, food vendors, and cleaners were reportedly killed in the Abuja-Kaduna train attack.\nTheCable had reported how gunmen attacked the train which was on its way to Kaduna from Abuja on Monday night.\nThe gunmen were said to have blown up the rail track after which they launched an attack on the passengers.\nAdvertisementAccording to sources, the gunmen were said to have gone straight for the VIP coaches on getting into the train.\nFollowing the attack, the Nigerian Railway Corporation (NRC) suspended train operations on that route."
  },
  {
    "headline": "Nigeria-based CredPal gets $15m to expand its buy now pay later business",
    "summarized_story": "Buy now pay later (BNPL)—a short-term consumer financing that allows shoppers to purchase products online and pay in installments with nominal or no fees—is sweeping the global e-commerce sector.\nThis will be used to expand its consumer credit offerings in its home country, Nigeria, and scale across Africa.\nThe more you use your credit card, the more your reward – from 1% to 15% across our partnered merchants!\npic.twitter.com/PCekh7M5oZ — CredPal (@CredPal) November 26, 2020“What we’ve done is encapsulate the lifestyle of the average working-class Nigerian and ensure that every person can find something specifically for them on CredPal,” Olaogun said in a recent interview.\nWhile competition appears to be heating up, there is a significantly large market of consumers and merchants to be tapped."
  },
  {
    "headline": "Digital Nomads: The pastor turned tech bro",
    "summarized_story": "The reason, Jay says, was that the lecturers in charge, at the time, knew nothing about the applications of tech.\nThis was 2018, mind you, but they said that tech wasn’t that important in the country, and that I should research something else.\nFor Jay, this event pushed him towards putting his degree to good use and becoming an all-round tech bro.\nHe doesn’t think his lecturers meant any harm, but he believes their lack of knowledge on the impact of tech will have damning consequences on the students they teach.\nIf you think your story fits the Digital Nomads bill, reach out to us here."
  },
  {
    "headline": "Okubanjo to step back from people decisions at Bento Africa",
    "summarized_story": "Bento’s board’s decision comes a few days after TechCabal exposed the harrowing experiences of ex-employees of payroll startup Bento Africa and how Okubanjo had allegedly been the orchestrator of that through direct and indirect bullying, verbal abuse, and threats to employees.\nOur responsibility and charter is to the Company, not the founders we invest in,” the board said in an email sent to all Bento employees, past and present.\nFurthermore, the board said that while Okubanjo is taking a back seat with immediate effect, an internal investigation into Bento’s workplace culture has begun.\nThe board claimed to have “…ensured that the current team is safe and free to speak freely.\nWith Love, Okubanjo admits to encouraging a work culture of “long workdays and weeks” and apologised for his abusive outbursts."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "Meta in Kenya’s elections",
    "summarized_story": "However, following a recent investigation by Technext, the proptech startup has repeatedly reneged on these promises leaving its customers with sour stories.\nWhy solving Nigeria’s housing problem is beyond proptech startups for nowMeta’s role in Kenya’s electionsIt’s election time again, and Facebook parent company, Meta, has found itself in the thick of things again.\nKenya’s elections are coming up in August 2022, and we’re gearing up for presidential, legislative, and county-level elections.\nShould big, primarily profit-driven, corporations be the custodians and watchdogs of marquee moments in a society like elections?\nFunding for fantasy footballOn the news: Egyptian fantasy football startup, Eksab, has raised $3m to expand its fantasy football platform across MENA and Africa."
  },
  {
    "headline": "How to hitchhike safely",
    "summarized_story": "The law aims to allow smaller messaging platforms to access the “gatekeepers” of the messaging world.\nBorne out of unpleasant experiences with ride-hailing companies, he got three other friends to join in his desire to build a ride-sharing platform that connects drivers and riders going in the same direction.\nOn Friday, March 25, 2022, Hytch — Onifade’s ride-sharing platform — was publicly launched and currently operates in Lagos State.\nAn age-long problem: Before now, the federal government has made some inroads into challenges surrounding RoW charges.\nRoW charges affect the overall amount telcos spend in laying optic fibre and eventually affect the cost of calls and Internet data."
  },
  {
    "headline": "Ride-sharing newcomer, Hytch is providing a new way to travel, hitchhiking style",
    "summarized_story": "Well, Laolu Onifade thinks he might have found a sweet spot with his newly launched ride-sharing startup, Hytch.\nLaolu Onifade, Hytch FounderAccording to Onifade, Hytch connects car owners and passengers going in the same direction.\nI noticed that Uber and Bolt were getting so expensive and I used to wonder, how about I just hitch a ride?\nso guys, i got robbed on wednesday night at ikoyi by my bolt driver, he took my phone, my cards, my ID, all my money and savings, lemme tell you how it happened.\nAnother Twitter user, @ade_IDD, narrated how she was almost kidnapped by a Bolt driver whose appearance was different from the picture on the platform."
  },
  {
    "headline": "Telcos sink under burden of multiple taxes",
    "summarized_story": "In Nasarawa State, telecom operators are required to pay N20 million every year as a development levy and the state will still charge each employer resident in the state the same levy.\nIn Kogi, Niger, and Rivers states there is an employee development levy charged on telecom operators.\nCustom taxes are the taxes imposed on goods when they are transported across international borders.\nGeneral Tax in the telecoms sector includes transactional taxes other than yearly taxes in the course of the ordinary business.\nThe FIRS and states revenue services collect Stamp Duties (2.25% dependent on the transaction)."
  },
  {
    "headline": "NNPC’s N700bn FAAC deductions since January cripple states’ finances",
    "summarized_story": "Within the last three months, the Nigerian National Petroleum Company has deducted about N697bn from its remittance to the Federation Account Allocation Committee (FAAC) to pay petrol subsidy, putting states in a tough financial position.\n“The estimated value shortfall of N127,035,585,356.25 is to be recovered from the January 2022 proceed due for sharing at the February 2022 FAAC meeting,” the NNPC said in its presentation to FAAC in January.\nThe NNPC prefers to call petrol subsidy ‘value shortfall’ or ‘under-recovery’ in its documents.\nNNPC said in its presentation to FAAC this month said it would deduct N328 billion from March proceed.\nThe country has not benefitted from the significant rise in oil prices because oil production has declined and petrol subsidy is increasing."
  },
  {
    "headline": "Why ASUU’s payment platform wasn’t approved – NITDA",
    "summarized_story": "The striking lecturers are, however, vehement that they would not be subjected to the federal payment platform, and that they would rather prefer to be paid using the UTAS.\nASUU’s insistence on a separate payment platform is due to distrust of the sincerity of the authorities to sufficiently deal with the many problems bedevilling the education system from inception.\nThe meeting was an opportunity for ASUU to demonstrate the capabilities of the UTAS platform, according to sources.\nNITDA said its team carried out a series of Vulnerability Assessments and Penetration Tests on the UTAS platform.\nThere is no doubt that the exercise has positively impacted the functionality and robustness of the UTAS platform."
  },
  {
    "headline": "Emeka Ogbu elected,Sworn In As NUGA President – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…Says, it is countinuity in Progress for NUGABENIN CITY – Mr Emeka Ogbu of Enugu State University of Science and technology(ESUT) has been elected and sworn in as president,Nigeria University Games Association.\nMr Ogbu was returned unopposed to become the new NUGA President after his only opponentDr Nnadozie Cliford of Michael Okpara University of Agriculture , Umudike, Abia State,voluntarily stepped down from the race few hours before the election proper.\nOgbu was elected on Friday 25th of March,2022 to steer the Nigeria University Games Association wheel of progress for a period of two years.\nUntil now, Mr Emeka Ogbu served as 1st vice President under the outgone President, Prof. Stephen S. Hamafyelto.\nIn his words, ” we will collaborate and bring the best of brains to raise the bar in terms of preparation and sourcing for partnerships to improve the quality of our sporting competitions.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Doha 2022: Obaseki woos investors, showcases opportunities for investment in oil palm, tech, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, at the just concluded 2022 Doha Forum in Qatar, showcased business and investment opportunities in Edo State, rallying investors to take advantage of the business-friendly environment as well as incentives provided by his administration in the state to invest in new frontiers.\nObaseki, who joined other world leaders and policymakers at the 20th edition of the forum, showcased investment opportunities in different sectors of the state’s economy including agriculture, healthcare, technology and education, among others.\nThe governor further stated: “For us in Edo State, we didn’t suffer much from the infections or mortality rate of the COVID-19 because of the very young population we have in Nigeria and Edo State.\n“In terms of our healthcare response, we realized the opportunities for investment in the healthcare space and the participation of the private sector in healthcare delivery.\nBefore now, the bulk of healthcare investment was left to the government, even though the private sector is a key provider of healthcare services.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo govt warns against indiscriminate waste disposal, violating environmental laws – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has warned against indiscriminate waste disposal and unhealthy practices that violate the state’s extant environmental laws.\nAddressing journalists after inspecting Oregbeni market, Ikpoba Okha Local Government Area of the state, Commissioner for Environment and Sustainability, Hon.\nJonathan Lawani, urged stakeholders to collaborate with the state government to keep the state clean so as to prevent disease outbreaks.\nHe noted, “Disease-carrying organisms tend to spread when we don’t keep our environment clean, and as residents of the state, we need to ensure that our homes and markets are clean.\nShe appealed to the state government to replace the present waste manager for better waste management."
  },
  {
    "headline": "Ex-Edo governorship candidate commends mothers’ contributions to nation building – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The governorship candidate of the African Democratic Congress (ADC) in the 2019 Edo State governorship election, Mabel Oboh, yesterday, commended Nigerian mothers for their significant roles in nation’s building.\nShe gave the commendation in a statement signed and made available to newsmen in Benin City.\nOboh urges women not to relent but rise to the occasion irrespective of the onerous tasks confronting them at home, work and other places.\n“Today, I wish to commend all mothers in across the world for the roles they are playing for the growth and development of every society.\n“As we grapple with social vices in our society, we mothers believe it can be reduced if we all come together and speak against it rather than encourage it."
  },
  {
    "headline": "Scores, including driver, vendors, doctor, others killed in Abuja-Kaduna train attack",
    "summarized_story": "Scores of individuals, including one of the train drivers, food vendors, a young medical doctor, Chinelo, and cleaners were said to be killed in a terrorist attack on Abuja-Kaduna train on Monday night.\nThe gunmen were said to have blown up the rail track after which they launched an attack on the passengers.\nSources told TheCable that the gunmen went straight for the VIP coaches on getting into the train.\nAn unspecified number of passengers were also said to have been injured during the attack while some others were reportedly abducted.\nTheir bodies were not found among the dead and their whereabouts unknown.”In the meantime, the government of Kaduna State has confirmed that fatalities were recorded during the attack."
  },
  {
    "headline": "Chinelo, young medical doctor killed in Abuja-Kaduna train attack, survivor narrates ordeal",
    "summarized_story": "Chinelo, a young medical doctor who said she was shot by terrorists who attacked Abuja-Kaduna train on Monday night, is said to have died of her injuries.\nMeanwhile, a man who survived Abuja-Kaduna train attack by terrorists has narrated horrible experiences the himself and other passengers passed through during the incident on Monday night.\nThis is even as Chinelo, a lady who said she was shot during the attack has reportedly died.\nThe passenger, who survived the attack, told journalists on phone that while in transit, “we heard a loud bang.\nKaduna govt confirms deathsIn the meantime, the government of Kaduna State has confirmed that fatalities were recorded during the attack."
  },
  {
    "headline": "NRC suspends Abuja-Kaduna train after terrorists bomb attack",
    "summarized_story": "The Nigerian Railway Corporation (NRC) has suspended its Abuja-Kaduna train operations in the wake of a bomb attack by terrorists on Monday night.\n“Dear passengers, due to unforeseen circumstances, Train operations along the Abuja-Kaduna route has been temporarily suspended.\nTerrorists had attacked a train on Monday night, blowing off the rail track between Rijana and Katari in Kaduna State and surrounded it shooting sporadically into the air.\nHowever, the Nigerian Police Force and troops of the Nigerian Airforce who got information about the unfolding attack quickly mobilised to the scene and overpowered the terrorists.\nThe troops defeated the terrorists in a firefight and secured the 970 passengers unhurt."
  },
  {
    "headline": "U.S. govt announces 2022 academy for women entrepreneurs in Nigeria",
    "summarized_story": "The U.S. government has announced the commencement of registration for the 2022 academy for women entrepreneurs in Nigeria.\n“The Venture Garden Foundation team will bring a wealth of expertise and knowledge to the Academy for Women Entrepreneurs program in Nigeria,” Foltz said.\nAs a technology company, our support for the Academy for Women Entrepreneurs will ensure that we help prospective and emerging women entrepreneurs and business owners compete more effectively with a whole array of cutting-edge technological solutions,” Yusuf added.\nLawal, President Ascend Studios Foundation, said 250 participants will be selected for the 2022 Academy for Women Entrepreneurs, a highly competitive entrepreneurship program.\nMotivated and self-driven prospective women entrepreneurs and early-stage business owners can apply at no cost by filling out the application form via http://bit.ly/AWENIGERIA2022."
  },
  {
    "headline": "Osinbajo Tasks Leaders On Quality Education, Health",
    "summarized_story": "Vice President Yemi Osinbajo has appealed to nations across the globe, especially African countries to prioritise the delivery of quality health and education systems besides growing their economies to be able to achieve the global aim of poverty reduction.\nOsinbajo made the call while addressing the African Union continental workshop on Africa’s Voluntary National Reviews for the 2022 high level political forum (HLP and domestication of agenda 2063 in Abuja yesterday.\nHe said the strategic partnership embedded in the SDGs has availed Nigeria a huge implementation context due to its large population, landmass and ethnic diversity.\nOsinbajo said since the adoption of the African Union (AU) agenda 2063 and the UN agenda 2030, his administration has embarked on a process of domesticating the agendas at the national and sub-national levels.\nHe said the new National Development Plan (NDP) 2021-2025 has strategies that aim at achieving the targets set under each of the goals in both agendas."
  },
  {
    "headline": "Kaduna Airport Attack Reenactment Of Afghanistan In Nigeria – Afenifere",
    "summarized_story": "Pan Yoruba socio-political organisation, Afenifere has described the invasion of Kaduna airport by terrorists on Saturday, saying it was a warning that some people are bent on re-enacting the Afghanistan situation in Nigeria.\nKaduna Airport Attack: We Killed 12 Bandits – MilitaryADVERTISEMENTAfenifere noted that some security infractions took place between Friday and Saturday in parts of the country and regretted that it was as though the country was at war – at least in those areas where the unfortunate incidents took place.\n“It is a matter of serious concern that these security infractions happened at a time that the government kept assuring us that it was on top of the situation.\nSome of these attacks by terrorists even occurred in broad daylight, that of Kaduna airport and that of Enugu for instance,” they said.\nAfenifere asserted that with terrorists having the audacity to attack a national airport despite all the available security apparatus means that hardly is anywhere safe any longer in the country."
  },
  {
    "headline": "ASUU: NITDA Says UTAS Failed 156 Out Of 687 Tests",
    "summarized_story": "This was in turn submitted to the chief conciliator, the Honourable Minister of Labour and Employment as well as other stakeholders in ASUU.\nThese also, were adequately communicated to the relevant stakeholders including ASUU, the statement affirmed.\nThese areas of improvement have been fully documented and shared with the ASUU team for necessary action.\nThis regulatory instrument, currently being reviewed, provides guidelines for the design, development and testing of software projects in Nigeria.\nFurthermore, Section 10 of the Guidelines for Nigerian Content Development in ICT, 2019 provided detailed guidelines and expectations for Indigenous Software Development and Software Enabled Products and Services."
  },
  {
    "headline": "ASUU: NITDA Says UTAS Failed 156 Out Of 687 Tests",
    "summarized_story": "This was in turn submitted to the chief conciliator, the Honourable Minister of Labour and Employment as well as other stakeholders in ASUU.\nThese also, were adequately communicated to the relevant stakeholders including ASUU, the statement affirmed.\nThese areas of improvement have been fully documented and shared with the ASUU team for necessary action.\nThis regulatory instrument, currently being reviewed, provides guidelines for the design, development and testing of software projects in Nigeria.\nFurthermore, Section 10 of the Guidelines for Nigerian Content Development in ICT, 2019 provided detailed guidelines and expectations for Indigenous Software Development and Software Enabled Products and Services."
  },
  {
    "headline": "12 Coups In Africa In 5 Years Unacceptable – Osinbajo, Others",
    "summarized_story": "In his welcome address at the event, Obasanjo, who is the chairman of CoDA, condemned military takeover of democratically elected governments in some African countries, stressing that democracy in West Africa and indeed Africa required an urgent attention.\nADVERTISEMENTThe two-day event, themed: “West Africa: Rising to the Challenges of Consolidating Democratic Governance”, was held at the Olusegun Obasanjo Presidential Library in Abeokuta.\nWhy West Africa Has Had So Many Coups…Emphasising that West Africa and indeed African continent are currently going through a perilous storm following political instability in some parts of the continent, the former president lamented that, coup d’etat, election fraud and political violence and instability have crippled the growth of Africa.\nHe however, maintained that the only way the African continent can develop is through peaceful democratic transition of governments.\n“Since 2017, there have been 12 military coups in Africa and half of them occurred since 2020."
  },
  {
    "headline": "Terrorists attack: Kaduna govt. mum on casualties, evacuates trapped train passengers",
    "summarized_story": "The Kaduna State Government Tuesday issued an update on the terrorists attack on a Kaduna bound train, but failed to give figures of casualties.\nIt however said the evacuation of passengers trapped in the train from Abuja was concluded this morning by security forces.\nAruwan said that officials of Kaduna State Emergency Management Agency (SEMA) and Nigerian Red Cross were part of the evacuation of the victims.\n“As stated on Monday, the Kaduna State Government is still liaising with the Nigerian Railway Corporation (NRC) to ascertain the list from the passengers manifest for efficient tracking,” he said.\nA passenger train heading to Kaduna from Abuja was attacked by terrorists on Monday night."
  },
  {
    "headline": "Chinelo UNIPORT-trained surgeon killed in trapped Abuja-Kaduna train",
    "summarized_story": "Megafu Chinelo, a University of Port Harcourt trained Dental Surgeon, has been identified as one of the passengers shot dead during a terrorist attack on the Abuja-Kaduna train on Monday.\nAccording to multiple reports, Dr. Chinelo, who was among the passengers on board the train had twitted after being shot and called for prayers.\nIt however said the evacuation of passengers trapped in the train from Abuja was concluded this morning by security forces.\nAruwan said the passengers who sustained injuries and other fatalities had also been moved to hospitals.\nSome of the families said they are yet to get confirmation concerning the whereabouts and well-being of their loved ones."
  },
  {
    "headline": "Terrorists attack: Families of trapped train passengers in trauma",
    "summarized_story": "Family members of passengers aboard the Kaduna-bound train attacked on Monday are in shock and fear that they may have lost their loved ones.\nThey spoke to NAN after they trooped to the Rigasa Railway station in Kaduna on Tuesday.\nKaduna State Commissioner for Home Affairs and Internal Security, Mr. Samuel Aruwan, on Tuesday, said the train had been secured by military personnel, and that government had evacuated passengers on board the train.\nHe said the staff of Kaduna State Emergency Management Agency (KADSEMA) and Nigeria Red Cross, Kaduna chapter, conducted the evacuation.\nMeanwhile, train service including other business activities at the Rigasa Railway station, Kaduna, had been grounded as a result of the incident."
  },
  {
    "headline": "Review of Rema's Rave & Roses Album",
    "summarized_story": "By Agwuma KingsleyRema’s debut album Rave & Roses is worth the wait since the ending of 2021 when the anticipation began.\n“Hold Me”, is a love song and the influence of 6lack’s input can’t be underrated, it was perfect.\nThere was chemistry meanwhile, Rema stories the love his woman shares with him promising he’d bring her to his mother.\nThe mid-tempo “Mara” is another love song that becomes an instrument he used to describe his woman and more.\nImagine an act that took feminine focal on an album and expressed it differently, it is genius and magical."
  },
  {
    "headline": "Former Zamfara Deputy Governor, Shot In Abuja-Kaduna Train Attack",
    "summarized_story": "A former Deputy Governor of Zamfara State, Ibrahim Wakkala, has sustained gunshot wounds in Monday’s terrorist attack on a Kaduna-bound train.\nThe train conveying hundreds of passengers from Abuja to Kaduna was attacked by gunmen suspected to be bandits between Katari and Rijana in Kaduna State.\nAn aide to the former Deputy Governor told Channels Television that Mr Wakkala who was returning from the APC National Convention which held on Saturday was shot during the cross fire between the terrorists and the military and has been moved to a military hospital in Kaduna for treatment.\nThe spokesperson of the All Progressives Congress (APC) in Zamfara State, Yusuf Idris also confirmed the incident to Channels Television.\nIdris said the former Deputy Governor was initially abducted by the terrorists during the attack and was successfully rescued by the combined forces of DSS and Military“He was initially abducted but was rescued by the DSS and military, it was during the process he sustain gunshot injury in the leg.”"
  },
  {
    "headline": "Survivor Narrates Horrible Ordeal During Abuja-Kaduna Train Attack",
    "summarized_story": "A guy who survived a terrorist attack on an Abuja-Kaduna train has described the horrific experiences he and other passengers had during the tragedy on Monday night.\nThis comes as Chinelo, a woman who said she was shot during the incident, is supposed to have died.\n“We heard a huge blast” while in transit, the passenger, who survived the incident, informed media over the phone.\nWhen the train derailed, he added, nearly a thousand passengers tumbled on top of each other.\nNigerian Railway Corporation (NRC) has suspended its operation on the route following the attack."
  },
  {
    "headline": "Anyone who dares gay marriage in Living Faith will not make heaven – Oyedepo",
    "summarized_story": "President of Living Faith Church, also known as Winners Chapel Worldwide, Bishop David Oyedepo has said that anyone who dares to “marry man and man” in his church will not make heaven.\nThe cleric, who frowned at gay marriage, said God created men and women to replenish the earth.\nSpeaking during a program at the Church’s headquarters on Monday, Oyedepo stressed that no government policy under heaven can rule over his faith.\nnot between female and female, man and man?\n“Till Jesus comes, anyone who dares to marry man and man in this church will not make heaven."
  },
  {
    "headline": "Bandits Didn’t Shut Down Kaduna Airport, We Killed 12 Of Them – Military",
    "summarized_story": "The purported attack on the Kaduna International Airport took place six kilometers from the terminal and outside the airport perimeter fence, according to the military administration.\nAccording to the DAILY POST, the military reported that 12 of the bandits were killed in an air strike after being pursued for a long time.\nWhile briefing journalists, Brig-General Opuene stated that the Kaduna International Airport is quite secure, claiming that there are multiple layers of protection at the airport and that no bandits would dare to attack it.\n“So, as you can see from the distance, the insinuation outside that the terrorists took over the Airport is not correct.\nHe assured that there was no threat to the immediate vicinity of the Airport because the military were ahead of the bandits."
  },
  {
    "headline": "Breaking: NRC shuts down train services along Abuja-Kaduna route, hours after terrorists’ attack",
    "summarized_story": "Hours after terrorists’ attack on Abuja-Kaduna railway, the Nigeria Railway Corporation (NRC) has suspended services along the route.\nThis was disclosed Tuesday morning via a press statement on NRC Twitter handle.\nThe statement reads, “Dear passengers, due to unforeseen circumstances, Train operations along the Abuja-Kaduna route has been temporarily suspended.\n“Further Communication would be given in due course.”Meanwhile, the NRC is yet to release information on the number of passengers injured or kidnapped in Mondays incidence at the time of this report.\nAccording to sources, the attack occurred at a point between Katari and Rijana."
  },
  {
    "headline": "NPower batch C employment: FG approves 50,000 N-Build trainees",
    "summarized_story": "The federal government through National Social Investment Management Scheme (NASIMS) has approved 50,000 N-Build trainees for Npower batch C stream 2 applicants.\nThe scheme who made this known on Monday, via it’s official Twitter handle said the training will include: Carpentry, baking, masonry, catering and phone repairOthers include; Electrical installation, plumbing and fitting.\nNPower Build program is an accelerated training and certification programme that will engage and train it’s beneficiaries to build a new crop of skilled and highly competent workforce of technicians, artisans and service professionals."
  },
  {
    "headline": "FG accuses PDP of plotting another #EndSARS, misinformation",
    "summarized_story": "The federal government Monday accused the opposition Peoples Democratic Party (PDP) of misinformation capable of plunging the country into another round of the #EndSARS protests.\nHe queried: “How do you explain their threat of another EndSARS that pushed Nigeria to the brink?\nWe were there before and we remain the ones to beat in terms of a determined, viable and relentless opposition.\n“But, in our time, not once did we advocate the destruction of Nigeria just because we couldn’t have our way.\n“Nigerians know better and the question to ask is, Is your life better now in 2022 under the APC than it was in 2015 under the PDP?"
  },
  {
    "headline": "Many Feared Killed, Others Kidnapped As Bandits Attack Abuja-Kaduna Train",
    "summarized_story": "Many have been feared killed and several others kidnapped as bandits attacked a train conveying passengers from Abuja to Kaduna on Monday night.\nThe incident happened around 7: 45 pm at Dutse village in Chikun Local Government Area, just a few kilometres from the Rigasa train station, which is the last transit point of the train.\nAlthough both the police and the Kaduna state government are yet to confirm the number of casualties in the attack.\nThe bandits were said to have opened fire, shooting sporadically on the train, and later gained access to the train.\nBut an eyewitness who was also a passenger on the train told Channels Television that some people died while an unspecified number of passengers were taken away by the bandits."
  },
  {
    "headline": "Former Zamfara Deputy Governor, Shot In Abuja-Kaduna Train Attack",
    "summarized_story": "A former Deputy Governor of Zamfara State, Ibrahim Wakkala, has sustained gunshot wounds in Monday’s terrorist attack on a Kaduna-bound train.\nThe train conveying hundreds of passengers from Abuja to Kaduna was attacked by gunmen suspected to be bandits between Katari and Rijana in Kaduna State.\nRead Also: [Train Attack] Evacuation Of Passengers Concluded, Says Kaduna GovtAn aide to the former Deputy Governor told Channels Television that Mr Wakkala who was returning from the APC National Convention which held on Saturday was shot during the cross fire between the terrorists and the military and has been moved to a military hospital in Kaduna for treatment.\nThe spokesperson of the All Progressives Congress (APC) in Zamfara State, Yusuf Idris also confirmed the incident to Channels Television.\nIdris said the former Deputy Governor was initially abducted by the terrorists during the attack and was successfully rescued by the combined forces of DSS and Military“He was initially abducted but was rescued by the DSS and military, it was during the process he sustain gunshot injury in the leg.”“He is very okay now, he is receiving treatment at the hospital in Kaduna state.” Idris added"
  },
  {
    "headline": "Train Attack: Evacuation Of Passengers Concluded, Says Kaduna Govt",
    "summarized_story": "The evacuation of passengers on the trapped Kaduna-bound train from Abuja has been concluded by security forces, officials of the Kaduna State Emergency Management Agency (SEMA), and the Nigerian Red Cross.\nThis was disclosed by the Commissioner, Ministry of Internal Security and Home Affairs, Kaduna State, Samuel Aruwan.\nThe train was conveying passengers from Abuja to Kaduna on Monday when it was attacked by gunmen suspected to be bandits in Kaduna State.\nMany passengers were feared injured while several others were said to have been kidnapped by the assailants.\n“As stated yesterday, the Kaduna State Government is still liaising with the Nigerian Railway Corporation (NRC) to ascertain the list from the passengers manifest for efficient tracking”."
  },
  {
    "headline": "NRC Suspends Train Operations Along Abuja-Kaduna Route",
    "summarized_story": "The Nigerian Railway Corporation (NRC) has suspended train operations along the Abuja-Kaduna route.\n“Dear passengers, due to unforeseen circumstances, Train operations along the Abuja-Kaduna route has been temporarily suspended.\nThe statement follows an attack by gunmen on a train conveying passengers from Abuja to Kaduna on Monday night.\nOne of the passengers on the train told Channels Television that the bandits blew up the train track with an Improvised Explosive Device (IED) which forced the train to derail.\nREAD ALSO: Troops Secure Abuja-Kaduna Train Attacked By Terrorists – Kaduna GovtThe military immediately swung into action and secured the Kaduna-bound train from Abuja which was attacked by terrorists."
  },
  {
    "headline": "IGP, Defence Chief Visit Site Of Kaduna Train Attack",
    "summarized_story": "The Inspector-General of Police Usman Alkali Baba, Chief of Defence Staff General Lucky Irabor, and top officials of the Nigerian Railway Corporation, have visited the site of the terrorist attack on a train at Dutse forest in Chikun Local Government Area of Kaduna.\nFrom there, they proceeded to the scene of the attack located about three kilometres away from the expressway.\nRead Also: Many Feared Killed, Others Kidnapped As Bandits Attack Abuja-Kaduna TrainWhile the casualty figure is yet to be confirmed, several persons are feared dead.\nThe incident happened around 7:45 pm on Monday at Dutse village in Chikun Local Government Area, just a few kilometres from the Rigasa train station, which is the last transit point of the train.\nThe bandits were said to have opened fire, shot sporadically on the train, and later gained access to the train."
  },
  {
    "headline": "Breaking: Osinbajo meets Obasanjo in Abeokuta",
    "summarized_story": "Vice President Yemi Osinbajo on Monday met with former President Olusegun Obasanjo in Abeokuta, the Ogun State capital.\nOur Correspondent gathered that Osinbajo visited Ogun State for a high-level dialogue organised by the Coalition for Dialogue on Africa (CoDA).\nThe dialogue tagged, ‘West Africa: Rising To The Challenge Of Consolidating Democratic Governance’, planned to hold at the Olusegun Obasanjo Presidential Library (OOPL), Abeokuta on Monday and Tuesday.\nHe who was escorted by the Ogun State Governor, Dapo Abiodun and was received by former President Obasanjo as they proceeded to the venue.\nFormer President Goodluck Jonathan was also in attendance during the programme."
  },
  {
    "headline": "2023: APC will poll 41m votes with the right candidate",
    "summarized_story": "Kogi State Governor, Yahaya Bello, has said that the All Progressives Congress will poll over 41 million votes in the 2023 general elections if a generally accepted candidate should emerge at the party’s primary.\nHe stressed that the APC as a party, as currently constituted, would not zone anyone out of the presidential race.\nGovernor Bello said this during an interview with the Sunrise Daily crew on Channels Television on Monday.\nHe said the party went for an experienced party leader to manage its affairs, noting that the period it took to organise the convention was worth the wait.\n“The new party leader and the National Working Committee have great experience to lead the party into a strong and cohesive entity."
  },
  {
    "headline": "Court remands Abba kyari at Correctional centre",
    "summarized_story": "A federal High Court in Abuja, on Monday ordered the remand of the suspended deputy commissioner of police, Abba Kyari and six others in correctional centre.\nThis is after Justice Emeka Nwite refused to grant him bail.\nThe court held that the NDLEA has placed sufficient evidence before the court enough for it to refuse bail.\nThe NDLEA in its counter affidavits to Mr Kyari’s bail application held that it is inappropriate to grant bail to the applicant because of the facts and circumstances of the case.\nThe 2nd applicant who is an Assistant Superintendent of police is under investigation for money laundering and may face charges on same."
  },
  {
    "headline": "Success of APC National Convention causing pains to PDP",
    "summarized_story": "The newly elected national chairman of the All Progressives Congress, Abdullahi Adamu, says politicians are not strangers to pain and disappointment in the outcome of political process.\nThe former governor of Nasarawa state said the success of the APC convention is causing pain to opposition party but members must resist every temptation to blow every personal differences into full blown party crisis.\nHe added that it is time to do things differently to avoid opposition taking advantageThe APC chairman said the time has come to be patriotic in words and deed.\nHe urged the media to follow the path of the pioneers of journalism in working for the success of the country.\nSenator Abdullahi appreciates party members for the confidence reposed in him and promised never to disappoint the party, the nation, Africa and the world."
  },
  {
    "headline": "Roman Abramovich Attends Russia-Ukraine Peace Talks in Turkey Despite Suspected Poisoning",
    "summarized_story": "Roman Abramovich is attending peace talks between Ukrainian and Russian delegations in Istanbul – after reports emerged he had suffered symptoms of a suspected poisoning.\nThree sources told Reuters Mr Abramovich was present at the talks, while footage posted on social media showed him speaking to delegates.\nMr Abramovich suffered symptoms of a poisoning earlier this month along with two Ukrainian peace negotiators during talks at the Ukraine-Belarus border, according to the Wall Street Journal .\nMr Zelensky has asked US officials to refrain from sanctioning Mr Abramovich, claiming he could play a role in helping to negotiate a ceasefire.\nA senior US official said Russian President Vladimir Putin does not appear ready to make compromises to end the war."
  },
  {
    "headline": "Ukraine and Russia Resume Peace Talks with ‘No Handshake’",
    "summarized_story": "Ukrainian television reported the talks had begun with “a cold welcome” and no handshake between the delegations.\nKremlin spokesperson Dmitry Peskov said talks so far had not yielded any substantial progress but it was important they continued in person.\nRussia calls its actions in Ukraine a “special military operation” to disarm and “denazify” its neighbour.\nRussia’s military signalled last week it would concentrate on expanding separatist-held territory in southeastern Ukraine.\nThe sides have held talks via video link in recent weeks and both have publicly discussed a formula under which Ukraine might accept some kind of neutral status."
  },
  {
    "headline": "Nigeria’s Sports Ministry, Football Federation Procure 20,000 Tickets for Super Eagles’ Fans Ahead Ghana Match",
    "summarized_story": "“We will buy 20,000 of the tickets and give to fans at designated centres on Monday and Tuesday morning.\nWe want to ensure maximum support for the Super Eagles by filling up the stands.\n“The NFF have done well to sccure maximum capacity of the Moshood Abiola National Stadium for the match.\nNFF 2nd Vice President, Mallam Shehu Dikko added that both the Ministry and the NFF believe that the full house will ginger the Super Eagles to earn a seventh FIFA World Cup finals ticket on Tuesday evening.\n“It is a very big match and we need the maximum support for our team."
  },
  {
    "headline": "Nigeria’s Economy No Longer Dependent on Oil, Says NNPC GMD Kyari",
    "summarized_story": "The NNPC GMD argued that while Nigeria believes in the net zero drive and has already committed to it, it would continue to build on its gas infrastructure as a buffer before the achievement of the net zero target in 2060.\n“First of all, let me put it in a general context, our country’s GDP contribution from the oil and gas is just nine per cent.\nHe explained that the energy poverty that Nigeria was confronted with, was also true of other African countries.\n“The energy trilemma: energy access, affordability and sustainability should be taken in the holistic manner.\nOil and gas, according to our oil outlook, will continue to account for more than 45 per cent to 50 per cent of the global energy mix."
  },
  {
    "headline": "Information Minister Lai Mohammed Blames Opposition PDP for Laying Foundation for Nigeria’s Misery",
    "summarized_story": "Nigeria’s federal government has lambasted the Peoples Democratic Party (PDP) for being the architect of the country’s economic hardship.\nThe government alleged that the mismanagement of national resources by the opposition party at a time the economy was buoyant laid the foundation for the current woes.\nMinister of Information and Culture, Alhaji Lai Mohammed, made the accusation on Monday at a no-holds-barred press briefing in Abuja.\nMohammed stated further, “Gentlemen, there is nothing wrong in having a fiery and viable opposition in a democracy.\nThe main opposition party slammed Mohammed for provocatively claiming that Nigerians were better off under the APC."
  }
]