[
  {
    "headline": "BREAKING: Olubadan of Ibadan to be buried today -Palace",
    "summarized_story": "The remains of the late Olubadan of Ibadan, Oba Saliu Adetunji, will be buried today, the Popoyemoja Palace, has confirmed.\nThe palace made this known in a press statement by its Director of Media and Publicity, Adeola Oloko, titled, “Olubadan passes on, to be buried today”.\nThe statement read, “The 41st Olubadan of Ibadanland, and Chairman, Oyo State Council of Obas and Chiefs, Oba Saliu Akanmu Adetunji, Aje Ogungunniso 1 has joined his ancestor.\n“Oba Adetunji, 93, passed away in the early hours of this morning at the University College Hospital, UCH, Ibadan.\n“He will be buried at 4.00 pm today at his Popoyemoja, Ibadan Palace according to Muslim rites."
  },
  {
    "headline": "JUST IN: Makinde mourns as Oyo govt confirms Olubadan’s death",
    "summarized_story": "The Oyo State Government has confirmed the death of Olubadan of Ibadanland, Oba Saliu Adetunji, on Sunday.\nIn a condolence press statement, the state governor, Seyi Makinde, expressed shock at the passing of the monarch.\nHis wealth of experience, his immense wisdom and his commitment to seeing a greater Ibadan and a better Oyo State are unrivalled.\n“Ibadan, Oyo State, Nigeria and humanity at large will miss Kabiyesi, who was ever ready to give his all to see a better society.\n“I commiserate with his immediate family, the Olubadan-in-Council, the Central Council of Ibadan Indigenes (CCII) and all Ibadan indigenes at home and abroad on the demise of our father."
  },
  {
    "headline": "Former guber aspirants, PLASU lecturer kidnapped in Plateau",
    "summarized_story": "By Marie-Therese NanlongA former governorship aspirant in Plateau State, Kemi Nicholas Nshe, has been kidnapped.\nNshe, a chieftain of the People’s Democratic Party, PDP, who aspired to govern the State in 2019 was before then, the Chairman of Shendam local government area and the ALGON Chairman in the State.\nHe was kidnapped in Shendam on Saturday, alongside a lecturer with the Plateau State University, PLASU, Dr. Monday Hassan.\nShendam, the headquarters of Plateau South senatorial zone is also the home Council of the State Governor, Simon Lalong.\nBut the spokesman of PLASU, John Agam who confirmed the kidnap of Dr. Hassan said, “This thing happened in Shendam."
  },
  {
    "headline": "Pastor Kumuyi convenes Global Youth Convocation, IMPACT, for young people’s transformation",
    "summarized_story": "All of which firms have earned a space in the competitive global industry.\nREAD ALSO: Pastor Kumuyi explains why evil thrives in societyPreviously, Iyinoluwa co-founded Andela, Africa’s largest engineering organization with over 1000 software engineers that has received investment from Mark Zuckerberg and Google Ventures.\nThe Guest Gospel Artiste, Dunsin Oyekan, is an Industrial Chemistry graduate-turned Gospel Singer.\nDunsin is the artiste behind the popular gospel track, ‘Open Up.’ The song is well known amongst Christians in Nigeria.\nHis gospel music rendition is expected to resonate perfectly with the teenagers and therefore prepare their hearts for the life-changing and goal-inspiring messages of the Convener, Pastor Dr Kumuyi."
  },
  {
    "headline": "Build blacksmith village in Awka, Monarch tells Anambra, Federal govts",
    "summarized_story": "*As he confers titles on Ngige, Nwozo, Oye, AIG Umar, othersBy Vincent UjumaduTHE traditional ruler of Awka Kingdom, Obi Gibson Nwosu has called for the establishment of blacksmith village in the Anambra State capital to serve the South East geopolitical zone.\nAwka is famous for blacksmithing in Igbo land, although the industry is losing its popularity due to neglect.\nOthers who were honoured include former governor of Imo State, Chief Emeka Ihedioha, a Commissioner in the Federal Character Commission, Mrs. Ginika Tor, a member of Anambra House of Assembly, Dr. Pete Ibida, among others.\nHe commended the Anambra State government for the massive development in Awka, noting that such projects as Awka City Stadium, the Anambra International Convention Center and other infrastructure have improved the face of the community.\nIbezim, who prayed for permanent return of peace in Awka Community, charged the people to continue with their support to their traditional ruler, Obi Gibson Nwosu to attract more robust development in the area."
  },
  {
    "headline": "Makinde mourns Olubadan of Ibadanland",
    "summarized_story": "…says he was a great exemplar in royaltyBy Adeola Badru, IbadanThe Governor of Oyo State, ‘Seyi Makinde, on Sunday, expressed shock at the passing of the Olubadan of Ibadanland, Oba Saliu Akanmu Adetunji, Aje Ogungunniso 1, describing him as an exemplar in royalty.\nMakinde, stated that the demise of the royal icon, who he described as a great leader of his people and an exemplary royal father, was painful despite his old age, adding that his wisdom and wealth of experience would be sorely missed.\nThe governor expressed his condolences to the immediate family of the Olubadan, the Olubadan-in-Council and all Ibadan indigenes as well as the Oyo State Traditional Council.\nMakinde, in a statement by his Chief Press Secretary, Mr. Taiwo Adisa, said the late monarch gave his all to see that Ibadanland is developed and took its pride of place as one of the major cities in Africa.\nMay God grant them all eternal rest,” Makinde prayed."
  },
  {
    "headline": "Lekan Balogun may become next Olubadan",
    "summarized_story": "By Sola Isola – IbadanLekan BalogunThe Otun Olubadan of Ibadan land, Senator Lekan Balogun, may be next in line as the Olubadan of Ibadan following the demise of Oba Saliu Adetunji according to the laid down hierarchy of ascension the Ibadan throne.\nVanguard reports that the hierarchical arrangement in the Ibadan system has a two line approach, the Balogun system and the Olubadan (Otun) system.\nThe next to Olubadan and most senior on both lines are the Otun Olubadan and Balogun.\nOba Saliu Adetunji was crowned the 41st Olubadan of Ibadan following his coronation on March 4, 2016.\nPrior to his coronation, Oba Adetunji was the Balogun of Ibadan land which indicates that the Otun Olubadan, Senator Lekan Balogun may be next in line according to the rotational system."
  },
  {
    "headline": "Allah forbids receiving, paying interest – Nigerian cleric warns Muslims",
    "summarized_story": "A Nigerian cleric has warned Muslim faithful in counties across the world to desist from Riba (Usury).\nImam AbdulAfeez Musa described it as a social vice and one of the greatest sins before Almighty Allah.\nThe Imam stressed that Allah forbids Riba since he approved lawful transactions among people in form of Islamic finance.\n“Receiving or paying interest is deemed to be a major sin in Islam”, Musa declared and advised persons who have received such to donate it to charity.\nHe explained that Shari’ah law does not mean cutting of hands or legs as widely believed but controlling one’s self and spending."
  },
  {
    "headline": "Olubadan’s body arrives Popoyemoja’s palace as mourners throng palace [PHOTOS]",
    "summarized_story": "The remains of the Olubadan of Ibadan land, Oba Saliu Akanmu Adetunji have arrived at the monarch’s palace.\nThe palace is located at the family compound of the monarch at the Popoyemoja area of Ibadan.\nDAILY POST recalls that the Olubadan of Ibadan land, Oba Saliu Akanmu Adetunji joined his ancestors in the early hours of Sunday.\nOba Adetunji died at the age of 93.\nThe body was accompanied to the palace by scores of mourners who throng the palace."
  },
  {
    "headline": "Crisis plagued Cross River community reunites at new year",
    "summarized_story": "The people of Bendeghe-Ekeim, an ancient community in Etung Local Government Area of Cross River State have resolved to live in peace and harmony.\nThe community, rich in cocoa had been riddled with bad blood, sharp differences and violence over socioeconomic and economic disagreements.\nThe community came together at the New Year to take the decision at an event attended by stakeholders, clergymen, community leaders and youths.\nThe oldest woman in the community, Madam Amba Bichene Okorn expressed happiness at the peace brokered in the community, describing it as a “great reunion” of the Bendeghe-Ekeim community.\nOfuka urged those aggrieved communities to sheathe their swords and allow peace to reign in the overall interest of the people."
  },
  {
    "headline": "FRSC vows clampdown on speeding drivers",
    "summarized_story": "The Federal Road Safety Corps (FRSC) has vowed to go tough on motorists flouting the law on speed limits.\nA statement by Corps Marshal Boboye Oyeyemi said the defaulters were causing accidents, severe injuries and deaths.\n“Flagrant disobedience to traffic safety rules would no longer be condoned in the new year as enforcement would be total”, he declared.\nHe appealed to citizens to observe traffic rules and stay committed to COVID-19 safety protocols at all times.\nThe statement added that emergencies can be reported to FRSC toll-free line – 122, 08052998090 or 09067000015 for prompt responses."
  },
  {
    "headline": "Insecurity: Middle belt calls on President Buhari to take steps to end Boko Haram",
    "summarized_story": "The Middle Belt Forum (MBF), has called on President Muhammadu Buhari to order security agencies to stop the human carnage ripping across Nigeria, especially in the Middle Belt.\nBitrus said recently, some indigenes of the middle belt came under severe attacks in Nasarawa where no fewer than 45 people were gruesomely massacred by coldblooded killer herdsmen.\n“It is from Damboa local government area that Boko Haram launches attacks on communities, including the recent attack that killed a military general.\n”As an umbrella organisation of ethnic nationalities in the Middle Belt Region, the forum called on President Buhari to swiftly order the security agencies to stop the human carnage ripping across Nigeria, especially in the Middle Belt”.\nSecession: We are grossly marginalized in Nigeria – Middle Belt Youths cry out"
  },
  {
    "headline": "Subjects mourn demise of Olubadan of Ibadan",
    "summarized_story": "Subjects mourn demise of Olubadan of IbadanEmotions flowed as sympathisers, including men, women, children gathered on Sunday to mourn the death of Olubadan of Ibadanland, Oba Saliu Adetunji.\nThey besieged the Popoyemoja palace of the late Olubadan, wailing.\nREAD ALSO: How Olubadan died, by palace spokesperson- Advertisement -A woman said: “Baba oko mi o, Baba lo, eeyan daada ni Baba (king has passed on, he was a good man).\nOthers chanted the oriki of late Olubadan.\nSecurity operatives, including the police and Western Nigeria Security Network also known as Amotekun are at the palace."
  },
  {
    "headline": "How Olubadan died, by palace spokesperson",
    "summarized_story": "Details of how the late Olubadan of Ibadanland, Oba Saliu Adetunji joined his ancestors, have emerged.\nOba Adetunji passed on at the University College Hospital (UCH), Ibadan, on Sunday.\nThe Olubadan died 22 days after the death of Soun of Ogbomoso, Oba Jimoh Oyewumi.\n- Advertisement -Explaining how the monarch passed on to reporters, the Palace spokesman, Adeola Oloko said: “It was around 1am that Kabiyesi passed on.\nHe spent about five to six days at the hospital.”He said the late Olubadan will be buried on Sunday (today) by 4pm."
  },
  {
    "headline": "JUST IN: Makinde mourns Olubadan of Ibadanland",
    "summarized_story": "Oyo State Governor Seyi Makinde, on Sunday, expressed shock at the passing of the Olubadan of Ibadanland, His Imperial Majesty, Oba Saliu Akanmu Adetunji, Aje Ogungunniso 1.\nThe governor expressed condolences to the immediate family of the Olubadan, the Olubadan-in-Council and all Ibadan indigenes as well as the Oyo State Traditional Council.\n“His wealth of experience, his immense wisdom and his commitment to seeing a greater Ibadan and a better Oyo State are unrivalled.\n“Ibadan, Oyo State, Nigeria and humanity at large will miss Kabiyesi, who was ever ready to give his all to see a better society.\n“I commiserate with his immediate family, the Olubadan-in-Council, the Central Council of Ibadan Indigenes (CCII) and all Ibadan indigenes at home and abroad on the demise of our father."
  },
  {
    "headline": "BREAKING: Olubadan joins ancestors at 93",
    "summarized_story": "By Yinka Adeniran and Alao AbiodunThe Olubadan of Ibadanland, Oba Saliu Adetunji has joined his ancestors.\nHe reportedly passed on at the University College Hospital (UCH), Ibadan, on Sunday.\nThe Ekarun Olubadan, High Chief Amidu Ajibade, confirmed his demise.\n- Advertisement -Oba Adetunji was crowned the 41st Olubadan on March 4, 2017.\nMedia aide to the Olubadan, Mr Adeola Oloko, did not pick call as at the time of filing this report."
  },
  {
    "headline": "2023: 2,500 clerics offer prayers for Tinubu in Kano",
    "summarized_story": "The clerics were led by the Chief Imam of Kafin-Maiyaki, who recited verses from the Holy Qur’an.\n“We need somebody who can carry along everybody and I believe that Tinubu is the best option for Nigeria.\nTinubu Support Group inaugurates steering committee in OndoThe Tinubu Support Group (TSG) has also inaugurated its steering committee in the six local government areas of Ondo North Senatorial District to boost support for the presidential bid of Asiwaju Bola Tinubu.\nShe described Tinubu as a “man who is ready to sacrifice all he has for his fatherland.\nR. O Kazeem, said Tinubu has obliquely indicated his interest hence the need to support him ahead of the 2023 election became imperative."
  },
  {
    "headline": "Tears as Olubadan’s corpse arrives palace",
    "summarized_story": "From Oluseye Ojo, IbadanThe corpse of Olubadan of Ibadanland, Oba Saliu Adetunji, who joined his ancestors at the age of 93 in the early hours of today, has been brought to his palace at Popoyemoja, Ibadan, the Oyo State capital.\nSome of the sympathisers at the palace burst into tears when the corpse was brought into the palace premises in an ambulance of the University College Hospital (UCH), Ibadan.\nThe corpse was immediately taken into the chambers and only few people were allowed to enter before the door was closed.\nOba Adetunji became Olubadan in March 2016 after the demise of hia predecessor, Oba Samuel Odulana Odugade I.\nBut it could not be immediately confirmed the time that his corpse would be interred according to Islamic rites."
  },
  {
    "headline": "Kanu, other detainees will receive God’s mercy this year – Mbaka",
    "summarized_story": "From Jude Chinedu, EnuguThe Spiritual Director of the Adoration Ministry, Enugu, Rev Fr Ejike Mbaka, has said that the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, and other detained agitators in the country will receive God’s mercy this year.\nThe cleric, who prayed for the IPOB leader and other agitators under incarceration in various prisons, stated that he sees the IPOB leader as his son.\n‘I’m begging my fellow priests to stop condemning me for praying for Nnamdi Kanu.\nIf I use my mouth to bless Nnamdi Kanu and you don’t like it, please use your own mouth to curse him.\n‘I see Nnamdi Kanu as my son."
  },
  {
    "headline": "2022 prophecy: Tough time awaits Kanu, Igboho",
    "summarized_story": "In addition to that, if Igboho does not handle his matter very well he will stay longer in detention.\nHe should still expect tough time because the government is not ready to free him for one second.\nThe government does not have any plans to kill either Igboho or Kanu.\nThe rotational president Nigerians are clamouring for is not too certain.\n“If Ekweremadu can work very hard, because they want to gang up against his governorship ambition in Enugu State, PDP will still win, PDP will win Imo State, PDP will win Cross River."
  },
  {
    "headline": "2023 presidency: Contest between Kalu, Wike, predicts Prophet Arogun",
    "summarized_story": "“Some people complain about Buhari’s presidency because they are spiritually blind to see what would have happened if Buhari was not the president.\nI have seen Orji Uzor Kalu of the Southeast and Nyesom Wike of the South-south in the final election.\nOn March 1, 2020, Prophet Arogun also prophesied about the 2023 presidency and President Muhammadu Buhari’s successor.\n“Before the 2015 election, God told me that Buhari would win; And God told me a lot of things about Buhari.\nI saw a man in prison and this man has been a former governor from the Southeast taking over from President Buhari."
  },
  {
    "headline": "2023 presidency: Your antics to go North’ll backfire, Ngige warns PDP",
    "summarized_story": "The former Anambra State governor, therefore, advised the PDP to better align with the APC to go South if that is where the ruling party is going to.\nIt is going to be a costly venture for them because during election, it is like a draft game.\nThat seed of PDP of going North will backfire.\nThey better align with APC and if APC comes South, let them also come South.\nNgige who is a chieftain of the ruling All Progressives Congress (APC) argued that zoning and rotation of power create stability, unity, equity and progress of the country."
  },
  {
    "headline": "Breaking: Olubadan, Oba Saliu Adetunji, Dies at 93",
    "summarized_story": "The Olubadan of Ibadanland, Oba Saliu Adetunji, has joined his ancestors.\nThe first class monarch who ascended the throne on March 4, 2026 died at the age of 93.\nIt was learnt that the Olubadan joined his ancestors early Sunday morning, at the University College Hospital (UCH), Ibadan, the Oyo State capital.\nI cannot confirm to you.”The death of Oba Adetunji is coming 22 days after the death of another prominent monarch in Oyo State, the Soun of Ogbomosoland, Oba Jimoh Oyewumi.\nEfforts to reach the spokesman of the state governor, Mr. Taiwo Adisa, were not successful at the time of filing this report."
  },
  {
    "headline": "Fayemi, El-Rufai Defend Buhari’s Rejection of Direct Primary",
    "summarized_story": "While the lawmakers were in support of the direct primary, the governors were opposed to the clause in the bill.\nHe said: “If we do not have these conditions, direct primary will be a disaster.\nIt is not because they think the direct primary is quite possible,” he saidHe urged Nigerians “to be very discerning, careful and understand the process of direct primary and the conditioned precedents as against the indirect primary and not make our moral judgment without understanding the dynamics of it.\nOn his part, Fayemi also argued that the president was an advocate of direct primary, pointing out that he had been a product of direct and indirect primary modes.\n“The direct primary so-called was the direct primary of its own members and not entire voters in the state."
  },
  {
    "headline": "PDP Govs in Fresh Move to Zone Presidential Ticket to South",
    "summarized_story": "The PDP had zoned its national chairmanship ticket to the North, raising hopes that the presidential candidate would emerge from thesouthern part of the country.\n“PDP gave Atiku the ticket in 2019 and may not be in a position to take the same gamble again.\nHe explained that the PDP stakeholders were buying into the sentiments of ensuring equity and fairness to push for the emergence of the party’s presidential candidate from the South.\nHe also argued that power rotation is contained in the 1999 constitution of Nigeria (as amended).\nAyu stressed that to oust the ruling party, Nigerians of eligible age should register and vote in the 2023 general election to herald a new dawn."
  },
  {
    "headline": "NLC Alleges International Conspiracy against Nigeria’s Downstream Petroleum Sector",
    "summarized_story": "NLC further expressed concern that the crisis in Nigeria’s downstream petroleum sector was being aggravated by the persisting crisis in the upstream sub-sector.\n“In the North-east, the exception is Taraba State, which is yet to fully implement the new national minimum wage.\nIn the South-south, the weak link is Cross River State, which has spurned all agreements and entreaties to pay workers in the state the new national minimum wage and consequential salary adjustment.\n“In the South-east, NLC said that Imo and Abia state governments have remained the thorns in the flesh of workers.\nAhead of the 2023 general election, NLC said it would lead the Nigerian electorate to ask pertinent questions of development."
  },
  {
    "headline": "With 200 Deals, Nigeria Tops List of Beneficiaries of $5bn Investments",
    "summarized_story": "In addition, Bezos Expeditions made its maiden investment in the continent, according to the report by Briter Bridges Intelligence, which tracks investments into African start-ups.\nDeals in 2021 were a record-breaking close to $5 billion in disclosed investments, picking up from a pandemic-induced slowdown in 2020.\nEarlier data, which put the figure at $4 billion, stated that Nigeria earned the largest, chunk of $1.37 billion.\nWhile Nigerian start-ups raised $1.37 billion in 2021, South Africa raised $838 million; and Kenya, $375 million, with Nigeria boasting over 200 deals for the year.\nOther mentions were Senegal, where start-ups raised $222 million in 2021 and Tanzania at $96 million."
  },
  {
    "headline": "BREAKING: Olubadan Of Ibadan Is Dead",
    "summarized_story": "Olubadan of Ibadan land, Oba Saliu Adetunji, has passed away at the age of 93.\nThe monarch died at the University College Hospital in Ibadan, Oyo state, on Sunday.\n“Even if he is dead, it is the governor that will announce it,” a media aide to the late monarch said when contacted over the issue.\nAdetunji ascended the throne on March 4, 2017."
  },
  {
    "headline": "BREAKING: Olubadan Of Ibadan Is Dead",
    "summarized_story": "Olubadan of Ibadan land, Oba Saliu Adetunji, has passed away at the age of 93.\nThe monarch died at the University College Hospital in Ibadan, Oyo state, on Sunday.\n“Even if he is dead, it is the governor that will announce it,” a media aide to the late monarch said when contacted over the issue.\nAdetunji ascended the throne on March 4, 2017."
  },
  {
    "headline": "EXCLUSIVE: Petroleum Trust Development Fund Boss Accused Of Corruption, Nepotism, Fraudulent Contract Award",
    "summarized_story": "The Executive Secretary of the Petroleum Trust Development Fund, Dr Bello Aliyu Gusau, has been accused of awarding fraudulent contracts without recourse to procedure and due process.\n“Dr Gusau has turned the PTDF to an extension of his state where only his kinsmen are seen clutching files and folders from the procurement department.\nHe further added that the Executive Secretary has formed the habit of bragging about his untouchable status in the President Muhammadu Buhari-led administration.\n“From all indications, it seems the ES has political ambition, or he is sponsoring a political party or candidate in his home state.\nThis is largely responsible for how he has turned the PTDF into an extension of his state."
  },
  {
    "headline": "EXCLUSIVE: Petroleum Trust Development Fund Boss Accused Of Corruption, Nepotism, Fraudulent Contract Award",
    "summarized_story": "The Executive Secretary of the Petroleum Trust Development Fund, Dr Bello Aliyu Gusau, has been accused of awarding fraudulent contracts without recourse to procedure and due process.\n“Dr Gusau has turned the PTDF to an extension of his state where only his kinsmen are seen clutching files and folders from the procurement department.\nHe further added that the Executive Secretary has formed the habit of bragging about his untouchable status in the President Muhammadu Buhari-led administration.\n“From all indications, it seems the ES has political ambition, or he is sponsoring a political party or candidate in his home state.\nThis is largely responsible for how he has turned the PTDF into an extension of his state."
  },
  {
    "headline": "Olubadan For Burial Today, Palace Confirms",
    "summarized_story": "The late Olubadan of Ibadan, Oba Saliu Adetunji, will be buried on Sunday, the Popoyemoja Palace confirmed.\n“Oba Adetunji, 93, passed away in the early hours of this morning at the University College Hospital, UCH, Ibadan.\n“He will be buried at 4:00pm today at his Popoyemoja, Ibadan Palace according to Muslim rites.\nThe monarch died 22 days after the death of another prominent monarch in Oyo State – Soun of Ogbomoso, Oba Jimoh Oyewumi.\nPrior to his coronation as the Olubadan of Ibadan, he was the Balogun of Ibadan land."
  },
  {
    "headline": "10 Super Eagles standout players since AFCON 2000",
    "summarized_story": "AdvertisementThe African most populous country has won the tournament on three occasions — only bested by Egypt (7) and Ghana (4).\nWith barely less than a week to AFCON 2022, TheCable takes a look at the players who have made Nigeria proud since the 2000 edition of the African football showpiece.\nAdvertisementObafemi MartinsMarins, who is fondly called ‘Oba goal’ which translates to ‘king of goals’ in the Yoruba language, was dreaded due to his pace and excellent goals for the Super Eagles at AFCON 2006.\nJoseph YoboWhile Vincent Enyeama is the man credited with leading another era of Super Eagles, Joseph Yobo was also every bit as important to the team’s philosophy.\nAt the 2000 tournament, he was the jewel in the Super Eagles team."
  },
  {
    "headline": "10 Super Eagles standout players since AFCON 2000",
    "summarized_story": "AdvertisementThe African most populous country has won the tournament on three occasions — only bested by Egypt (7) and Ghana (4).\nWith barely less than a week to AFCON 2022, TheCable takes a look at the players who have made Nigeria proud since the 2000 edition of the African football showpiece.\nAdvertisementObafemi MartinsMarins, who is fondly called ‘Oba goal’ which translates to ‘king of goals’ in the Yoruba language, was dreaded due to his pace and excellent goals for the Super Eagles at AFCON 2006.\nJoseph YoboWhile Vincent Enyeama is the man credited with leading another era of Super Eagles, Joseph Yobo was also every bit as important to the team’s philosophy.\nAt the 2000 tournament, he was the jewel in the Super Eagles team."
  },
  {
    "headline": "CAN: Two Kaduna Baptist school students released — one still in captivity",
    "summarized_story": "The Kaduna chapter of the Christian Association of Nigeria (CAN) says two more abducted students of Bethel Baptist High School, Damishi, Chikun LGA have regained their freedom.\nHe confirmed that a total of 120 abducted students of the school have been freed so far.\nHe said the number of the released students includes one student who was freed on December 28, 2021 and another one who was freed on January 1.\nAdvertisementSince the release of the first set, at least 117 students have regained their freedom in batches.\nRansom was said to have been paid on each batches of the students released."
  },
  {
    "headline": "CAN: Two Kaduna Baptist school students released — one still in captivity",
    "summarized_story": "The Kaduna chapter of the Christian Association of Nigeria (CAN) says two more abducted students of Bethel Baptist High School, Damishi, Chikun LGA have regained their freedom.\nHe confirmed that a total of 120 abducted students of the school have been freed so far.\nHe said the number of the released students includes one student who was freed on December 28, 2021 and another one who was freed on January 1.\nAdvertisementSince the release of the first set, at least 117 students have regained their freedom in batches.\nRansom was said to have been paid on each batches of the students released."
  },
  {
    "headline": "Saliu Adetunji, Olubadan of Ibadan, dies at 93",
    "summarized_story": "Saliu Adetunji, the Olubadan of Ibadan, has died at the age of 93.\nAdvertisementThe monarch was the 41st king of the ancient city, and he succeeded Oba Samuel Odulana who died in 2016.\nThe Olubadan died at the University College Hospital, Ibadan in the early hours of Sunday.\nOlubadan Adetunji has gone to join his ancestors,” he said.\nAdvertisementAdetunji was born on August 26, 1928 to the family of Raji Olayiwola and Suwebat Amope Adetunji in Alusekere compound, Popoyemoja, Ibadan."
  },
  {
    "headline": "TechCabal Wrapped: Here’s what you enjoyed reading from TechCabal in 2021",
    "summarized_story": "I joined TechCabal in January of this year to help drive TechCabal’s transition from a Nigerian tech publication to a pan-African tech and media publication.\nTechCabal Wrapped is our way of walking you through our most-loved and most-read articles in 2021.\n🥂 Koromone Koroye, Managing EditorHere’s what you enjoyed reading from TechCabal in 2021In 2021, TechCabal published 683 articles, 265 editions of TC Daily—including this one—and 50 editions of Next Wave.\nHow Herconomy raised a $600,000 pre-seed round in 24 hoursIn 2021, Nigerian startups raised about $1.4 billion.\nThe African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence."
  },
  {
    "headline": "21 things that happened for the first time in 2021 in the African tech scene",
    "summarized_story": "2021 has been a noteworthy year that has seen the African tech sector bounce back from the difficulties it faced in 2020.\nHere’s a list of 21 things that happened for the first time in the African tech scene this year.\nThe African startup ecosystem raised a record $4 billion+ in venture capital funding2021 year was a landmark year for the African tech ecosystem, raising over $4 billion via 754 deals in venture capital funding.\nMFS Africa acquired Baxi.\nTwitter opened its first Africa office in GhanaIn April 2021 social media giant Twitter announced Ghana as its choice for an African headquarters."
  },
  {
    "headline": "Ask an Investor: Twelve insights from Africa’s top investors",
    "summarized_story": "While most people easily associate investors with just money, Founders Factory Africa (FFA) would rather have you think of more.\nMeghan Curran, West African Director of Acumen, explained this: “In our model, nothing goes back to the investors because the investors in the first place are donors.\nBefore the boom, Sawari Ventures, which was founded over a decade ago, has been backing North African startups.\nNow I’ve seen some term sheets where the investors ask that if the founder opts to pay back the investment, the investor gets some amount of free equity in the company.\nToday, LoftyInc operates three funds that have deployed over $12 million into over 75 African startups like Flutterwave, Andela and Trella."
  },
  {
    "headline": "Inside Jack Dorsey’s Btrust members’ plan to facilitate financial freedom",
    "summarized_story": "In 2020, he co-founded Recursive Capital, a venture capital that provides crypto-focused startups with seed and early-stage investments, with the aim of contributing to the development of the Web 3.0 ecosystem.\nDespite being founded before the Web 3.0 buzz, Recursive Capital had decided that it wanted to enhance financial freedom by decentralising the financial monetary system.\nTalking about the barrier to entry for Bitcoin, Khalil believes a misconception lies in the way people approach it.\nKhalil believes in educating and enlightening individuals about Bitcoin’s long-term benefits: economic freedom for the entire continent.\nOchai believes that bitcoin will eventually become a viable medium for Africans to do business without restrictions."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Techpoint Africa is 7! The next frontier",
    "summarized_story": "Techpoint Africa has been in business for exactly seven years!!\nThemed “The next frontier“, Techpoint Build promises to be, as always, the largest gathering of innovators, startup founders, thinkers, programmers, policymakers, and investors in West Africa.\nAs part of the activities for Techpoint Build, five of 15 shortlisted startups from across Africa will compete for $10,000 in equity-free grant money.\nTo receive an invite to the dinner, you have to purchase a VIP ticket to Techpoint Build.\nTechpoint Africa Membership ProgrammeIn October 2021, we activated our Membership Programme to zero fanfare."
  },
  {
    "headline": "10 memorable moments for African tech in 2021",
    "summarized_story": "As the year ends, we bring you a few memorable moments across the African tech ecosystem, some good and some bad.\nMore African investors throw their hats in the ringKola Aina, pioneer founder Ventures Platform fundFor so long, most of the investment into African startups came from foreign investors.\nHowever, more African investors are springing up and providing much-needed funding for African startups.\nFor so long, it has been argued that Nigerian startup founders need to be proactive in their interactions with the government and regulators.\nAs a result, some of the country’s most prominent founders and investors came together to work on the Nigerian Startup Bill."
  },
  {
    "headline": "Reviewing Nigerian fintech in 2021: Local investors are stepping up",
    "summarized_story": "Share this article:Between January and September 2021, African fintechs raised up to $1.4 billion, signalling an increasing investor appetite for Africa’s growing fintech space, and Nigeria has taken centre stage.\nAccording to data gathered by Intelligence by Techpoint, Nigerian fintech startups raised almost $800 million in 2021.\nBut, so far, there’ve been massive improvements in the fintech space beyond smartphone apps.\nIn January 2021, Olowe made some interesting predictions which, in the real sense, are educated guesses based on the trends from past years, and we created a little analysis.\n“I must admit that MTN would find it really tough to play in the financial space."
  },
  {
    "headline": "How Nigerian banks frustrate cash trapped customers",
    "summarized_story": "Customers of Nigerian banks have decried the inability of the lenders to make cash available on the Automated Teller Machines (ATMs) and even online transfers when needed.\nSome banks’ ATM machines visited randomly by BusinessDay during the festive period were the ones owned by First Bank of Nigeria, GTBank, UBA, FCMB, Access Bank, Stanbic IBTC, Polaris Bank, among others.\nBut as for cash, I am not sure that there is any bank that is insolvent.\nSo, people are not able to get cash because there is a challenge with technology,” Yusuf told BusinessDay.\nDigital payment channels, he said, also help to support the continued conduct of business activities during the lockdown."
  },
  {
    "headline": "How Nigerians can sing a new song in 2022",
    "summarized_story": "It was endless back-slapping yesterday as Nigerians joined the rest of the world to wish one another a happy new year and general goodwill.\nIf one considers the realities on the ground, especially the economic downturn, a new song might elude Nigerians this New Year, except things are consciously done differently by the government and the people.\n“Weather Nigerians will sing a new song or not depends on our government.\nOrdinarily, coming out of 2021 was a miracle because of the hardship that overstretched Nigerians.\nWhen you look at the budget size for 2022 is N16 trillion."
  },
  {
    "headline": "‘Edo APC’s call for state of emergency should be directed at FG’ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – That the Edo State Chapter of the All Progressives Congress (APC) have the temerity to convene a press conference and raise issues about governance and development is not only a slap on the faces of citizens of Edo State, but a sign of selective amnesia.\nCan Edo APC not see that their call for a state of emergency should be more appropriately directed to a federal government, which they lead, that has reduced the value of Nigerian lives to near nothing?\nDoes the party want a state of emergency in a state where every flight, or bus coming into the state is fully booked with air carriers and road transporters jostling to keep up with the pressure of travellers trooping into the state?\nIt is rather shameful for old men – grandfathers, for that matter – to sit comfortably, look into the camera and tell bare-faced lies about the Edo State Judiciary, the state legislature, the newly reconstructed Government Science and Technical College (GSTC), street-lighting project, Edo Tech Park, Edo Innovation Hub, among others.\nThe PDP-led government in Edo State has and will continue to put the interest of the people over and above the interest of all others."
  },
  {
    "headline": "Edo to launch cluster farm initiatives, others to boost oil palm devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government plans to launch the state’s Oil Palm Development initiative and Cluster Farm initiative, as part of ongoing reforms in the agricultural sector to grow the state’s economy and achieve food security.\nThe governor, who spoke to journalists in Benin City, said his administration is committed to stimulating economic prosperity and improving ease of doing business to continuously attract private capital to engender sustainable development.\nAccording to him, “Motivated by the progress recorded with the Edo State Oil Palm Programme (ESOPP), we will be launching the Oil Palm Development initiative and Cluster Farm initiative, in furtherance of our aim of anchoring our economic growth on commercial agriculture while sustaining food security.”Noting that Edo, with the cultivation of 120,000 hectares, has the largest oil palm plantation under cultivation in the country, Obaseki added, “We have put under cultivation up to 250,000 hectares of land for oil palm under our ESOPP programme.\nToday, we are approaching about 120,000 hectares.\n“We are providing our people with an oasis of hope even with the harsh realities that confront us as a sub-national in a country that is confronted by a number of developmental challenges.”..."
  },
  {
    "headline": "Obaseki swears in seven SSAs, 25 SAs in Oredo LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, swore in seven Senior Special Assistants (SSAs) and 25 Special Assistants (SAs), following harmonisation by leaders and members of the Peoples Democratic Party (PDP) in Oredo Local Government Area (LGA).\nThe governor said, “I had to wait, take my time and ensure harmonization of the party in the LGA before making this appointment.\nPolitics in Oredo LGA is very sensitive and the barometer through which Edo politics is judged.\nIf we fail to get Oredo right, it will be difficult and challenging to get Edo State politics right.\n“I have divided Oredo into 20 zones for development purposes as data are available for every household in Oredo."
  },
  {
    "headline": "Edo boosts security on waterways with eight new gun, speedboats – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… builds modern jetty, marine base, others for security personnelBENIN CITY – The Edo State Government, through the State’s Oil and Gas Producing Areas Development Commission (EDSOGPADEC) has procured additional four armoured gunboats and four speedboats to curb criminal activities along the state’s coastal areas and waterways.\nThe Chairman of EDSOGPADEC, Pastor Kennedy Osifo, who spoke to journalists, on behalf of other board members, immediately after inspecting the gun and speed boats, said the commission has now acquired eight gunboats and eight speed boats to strengthen security on its waterways and stop the activities of sea pirates.\nHe said the new armoured equipment will improve security in three oil and gas producing communities, including Ologbo in Ikpoba-Okha Local Government Area (LGA) and Gelegele, Ovia North East LGA of the state.\nOsifo revealed that the commission has completed the construction of a marine base at Ologbo River, as well as a modern jetty with a waiting lounge and other essential facilities for passengers and police officers in Ologbo Community in Ikpoba-Okha.\nThe EDSOGPADEC chair, who charged residents on protection of public facilities, said the commission will sustain efforts at improving the livelihoods of Edo people, which according to him, is a priority of the present administration of Governor Obaseki."
  },
  {
    "headline": "For the Record: ‘Wake Up and Help Save Our Tomorrow!’ – Text of Open Letter By Emeka Obasi Jnr to African Youths on Climate Change",
    "summarized_story": "My trepidation stems from the fact that our continent is in danger, threatened menacingly by climate change.\nAlready, Africa is confronted by the twin challenge of insecurity and poverty, but climate change now threatens the continent’s very existence.\nNot long ago, the the Lagos State government unveiled a five-year Climate Action Plan (CAP) 2020-2025.\nOur tomorrow has a three point agenda:To wake African youths up to the reality of the existential threat climate change poses to their future.\nIndeed, the prospects are exciting, I invite all African youths to this adventure."
  },
  {
    "headline": "Lagos nurses to embark on three-day warning strike over poor working conditions",
    "summarized_story": "Nurses in Lagos State under the umbrella of Lagos State Council of the National Association of Nigeria Nurses and Midwives (NANNM) are to embark on three-day warning strike from January 10 over unmet demands by the state government.\nThe circular said that the SEC of the association resolved to embark on the warning strike at its meeting held on December 29, 2021, accusing the administration of Governor Babajide Sanwo-Olu of failure to meet its demands.\nThe union also noted that the Federal Health Institutions have been exempted from the strike, which it noted would be monitored for strict compliance.\nIts strike notice, which was addressed to the governor in September, had read in part; “As of now, the Lagos State University Teaching Hospital (LASUTH) and the Lagos State Primary Health Care Board have commenced the payment of the allowance to nurses and midwives.\n“We ask that you take this letter as both a reminder and an ultimatum for possible commencement of industrial action."
  },
  {
    "headline": "Wike orders shutdown of illegal refineries over soot pollution",
    "summarized_story": "Rivers State governor, Nyesom Wike, has ordered the shutdown of illegal crude oil refining sites in the state with immediate effect, amid growing soot pollution in the state.\nWike said the measure became imperative to contain the menace of soot pollution which has continued to endanger public health in the state.\n“Since the federal security agencies have largely refused to stop the illegal crude oil refining activities in the state, we have no option than to take necessary measures to tackle this particular and direct challenge to our collective health and survival by ourselves,” he said.\n“Consequently, I have directed the chairman of Port Harcourt city local government council to go after all the illegal crude oil refining sites along Creek road and adjourning areas of the city and shut them down with immediate effect.\n“Furthermore, all local government chairmen are directed to work with community leaders to locate and identify those behind all illegal bunkering and crude oil refining sites in their localities and report to my office for further action.”Facebook Notice for EU!"
  },
  {
    "headline": "Police rescue 21 kidnapped Zamfara students",
    "summarized_story": "The Zamfara State Police Command says it has rescued 21 children abducted on Friday night by bandits while being taken to an Almajiri school in Zamfara State.\nThe bandits had blocked the Gusau-Funtua federal highway in Tsafe Local Government Area in the state and abducted several people in five vehicles, mostly commercial vehicles.\nThe Zamfara State police spokesperson Mohammed Shehu, however said in a statement that some of those abducted have been rescued.\n“The police operatives succeeded in rescuing 21 kidnapped children including two female who were coming from Rini village in Bakura area of Zamfara State to Katsina State for Almajiri Islamic school.\nBandits in Sokoto, Zamfara and Katsina states now attack highways, forcing the closure of major roads including the Jibia-Zurmi-Kaura Namoda-Gusau road, and Kankara-Sheme road in Katsina and Zamfara states."
  },
  {
    "headline": "Air Force Confirms Killing Of Wanted Bandit Leaders In Zamfara Forest",
    "summarized_story": "The Nigerian Air Force (NAF) has confirmed that its airstrike executed on Saturday, January 1, 2022, killed wanted bandit leaders, Alhaji Auta, and Kachalla Ruga, in a forest in Zamfara State.\nThe director of NAF Public Relations and Information, Air Cdre Edward Gabkwet, confirmed this to LEADERSHIP on Saturday.\nLEADERSHIP earlier reported the killing of the bandit leaders, citing security sources.\nThe notorious bandit leaders met their waterloo after a Nigerian Air Force (NAF) aircraft, under Operation Hadarin Daji, acting on credible intelligence bombarded their enclaves, at Gusami Forest and Tsamre Village in Birnin Magaji local government area of the State on Friday, December 31, 2021.\nADVERTISEMENTThe series of airstrikes also killed bandit fighters in the enclave."
  },
  {
    "headline": "JUST-IN: Military Raids Zamfara Forest, Kills Bandit Leaders, Others",
    "summarized_story": "Wanted bandit leaders, Alhaji Auta, and Kachalla Ruga, have been killed in an air raid of a forest in Zamfara State.\nAccording to PRNigeria, the notorious bandit leaders met their waterloo after a Nigerian Air Force (NAF) aircraft, under Operation Hadarin Daji, acted on credible intelligence, and bombarded their enclaves at Gusami Forest and Tsamre Village in Birnin Magaji local government area of the State on Friday night.\n“For now, the whereabouts of other notorious bandits like Alhaji Nashama, Shingi and Halilu who may either be incapacitated or on the run remain unknown,” the source added.\nIt further learnt from the military source, that aggressive bombardments by NAF aircraft, had in recent times been very precise and effective in hitting bandits’ enclaves, eliminating their leaderships and followers, in the process.\n“These operations have reassured citizens of the commitment and dedication of the military and other security agencies, towards bringing the threats posed by banditry under check, in no distant time."
  },
  {
    "headline": "Kwara CAN Chairman Dies At 60, Gov AbdulRazaq Mourns",
    "summarized_story": "The chairman of the Christian Association of Nigeria (CAN), Kwara State chapter, Most Reverend Paul Olawoore, is dead.\nMeanwhile, Kwara State governor, AbdulRahman AbdulRazaq, has commiserated with the Kwara Christian community on the death Olawoore.\nThe governor in a condolence message described the death of the CAN’s chairman as painful.\nADVERTISEMENT“It is indeed a painful exit of a prominent clergy who devoted his entire life to the service of God and humanity.\n“My profound condolences go to his immediate family, the Catholic family, and the entire Christendom in Kwara State on this sad loss."
  },
  {
    "headline": "Kwara CAN Chairman Dies At 60, Gov AbdulRazaq Mourns",
    "summarized_story": "The chairman of the Christian Association of Nigeria (CAN), Kwara State chapter, Most Reverend Paul Olawoore, is dead.\nMeanwhile, Kwara State governor, AbdulRahman AbdulRazaq, has commiserated with the Kwara Christian community on the death Olawoore.\nThe governor in a condolence message described the death of the CAN’s chairman as painful.\nADVERTISEMENT“It is indeed a painful exit of a prominent clergy who devoted his entire life to the service of God and humanity.\n“My profound condolences go to his immediate family, the Catholic family, and the entire Christendom in Kwara State on this sad loss."
  },
  {
    "headline": "2022: Make Your Voice Count, PRP Urges Nigerians",
    "summarized_story": "The People’s Redemption Party (PRP) has called on Nigerians to make their voice count and actions matter in the New Year.\nIn a statement made available to LEADERSHIP on Saturday in Abuja, to herald the New Year, and signed by the interim national chairman of the party, Comrade Adulmajid Yakubu Dauda, the party expressed the hope that 2022 will “hopefully, mark the beginning of a new life for Nigerians.”Dauda declared that from an era of uncontrolled inflation, insecurity, and COVID-19 worries, he said 2022 will be a year of peace, security, and relative prosperity for the country.\nADVERTISEMENTAccording to him, “Our resolve in this new year must be to stand up and be counted as free citizens in a free country who can decide their own destiny.\n“Let’s make our voices count, and our actions matter in our communities and across the country in our push for a better life.\nAnd let’s make 2022 our year of redemption.”ADVERTISEMENTHe, therefore, saluted the resilience of Nigerians and wished them a “Happy New Year.”"
  },
  {
    "headline": "Why I raped, impregnated teenage girl, Anambra native doctor",
    "summarized_story": "A 49-year-old native doctor, simply identified as Ekeneotutu accused of raping a 15-year-old girl in Enugu-Ukwu, Njikoka Local Government Area of Anambra State has explained reasons behind the act.\nHe said, “I was giving the girl treatment to cure her of ‘ogbanje’ spirit also known as ‘personality disorder’.\nShe said, “The Enugu-Ukwu vigilante group said they noticed the girl was roaming the area aimlessly.\nThe girl told us the native doctor sleeps with her every night and abuses her.\nDuring interrogation, the mother of the victim told us she sent the girl back to the man who impregnated her."
  },
  {
    "headline": "Why I raped, impregnated teenage girl, Anambra native doctor",
    "summarized_story": "A 49-year-old native doctor, simply identified as Ekeneotutu accused of raping a 15-year-old girl in Enugu-Ukwu, Njikoka Local Government Area of Anambra State has explained reasons behind the act.\nHe said, “I was giving the girl treatment to cure her of ‘ogbanje’ spirit also known as ‘personality disorder’.\nShe said, “The Enugu-Ukwu vigilante group said they noticed the girl was roaming the area aimlessly.\nThe girl told us the native doctor sleeps with her every night and abuses her.\nDuring interrogation, the mother of the victim told us she sent the girl back to the man who impregnated her."
  },
  {
    "headline": "Five officers killed, as police neutralise 38 bandits in Katsina",
    "summarized_story": "The Katsina State Police Command has announced that 5 of its officers have died in different operations across the state, while no fewer than 38 bandits were killed in the state.\n“In the course of this campaign, thirty-eight (38) bandits were neutralized in various gun battles while five (5) police officers paid the supreme price.”“The Command arrested 999 suspects in connection with 608 reported cases.\nWhile a total number of 874 arrested suspects are undergoing prosecution in various competent Courts of Law in the State,” he said.\n“Sixty-five suspected kidnappers were also arrested and 63 have been charged to court while two are under investigation,” he said.\nHe said 244 suspected cattle rustlers were arrested, of which 230 suspects have been charged to court while 14 are under investigation."
  },
  {
    "headline": "Five officers killed, as police neutralise 38 bandits in Katsina",
    "summarized_story": "The Katsina State Police Command has announced that 5 of its officers have died in different operations across the state, while no fewer than 38 bandits were killed in the state.\n“In the course of this campaign, thirty-eight (38) bandits were neutralized in various gun battles while five (5) police officers paid the supreme price.”“The Command arrested 999 suspects in connection with 608 reported cases.\nWhile a total number of 874 arrested suspects are undergoing prosecution in various competent Courts of Law in the State,” he said.\n“Sixty-five suspected kidnappers were also arrested and 63 have been charged to court while two are under investigation,” he said.\nHe said 244 suspected cattle rustlers were arrested, of which 230 suspects have been charged to court while 14 are under investigation."
  },
  {
    "headline": "My battle with incurable ailment in 2021, actress Kemi Afolabi",
    "summarized_story": "Nollywood actress, Kemi Afolabi-Adesipe, has recounted how she was diagnosed with an incurable disease which led her to sell her properties and secure a space for her burial.\nThe 43-year-old actress recalled that she paraded different hospitals because she was short of breath but was eventually diagnosed with the unnamed ailment.\nShe said: “I wrote my will and booked a space with ebony vault this year 2021, but God showed me how faithful He is despite my unfaithfulness.\n“Me ordinary sand that was toss around from my private hospital to LASUTH to Army Barracks Hospital WAEC and finally LUTH where I spent over three months!\n“Fluid blocked my lungs, affected my heart from functioning well, which was the reason for my breathlessness and that is caused by the condition diagnosed!"
  },
  {
    "headline": "Buhari gets 14-day deadline to probe misuse of security votes by govs",
    "summarized_story": "President Muhammadu Buhari has been issued 14-day deadline to probe alleged misuse of security votes by governors of the 36 states of the federation.\n“As revealed by a recent report by Transparency International (TI), most of the funds appropriated as security votes are spent on political activities, mismanaged or simply stolen.\nIt is estimated that security votes add up to over N241.2 billion every year.\n“On top of appropriated security votes, state governments also receive millions of dollars yearly as international security assistance.\nSecurity votes should be used for improving the security situation in the states or returned to the public treasury."
  },
  {
    "headline": "Toyin Lawani narrates ordeal as her son clocks 8",
    "summarized_story": "Celebrity stylist and entrepreneur Toyin Lawani has recounted her pregnancy ordeal as her son celebrates his 8th birthday.\nAccording to Toyin Lawani, there were a few setbacks during the pregnancy, but it eventually opened multiple doors and reshaped her life completely.\nToyin Lawani also prayed that God would guide her son and help her nurture his various talents.\nShe also prayed that God would guide her son and help her nurture his various talents.\n#TENOR8 let the turn up begin.”Toyin Lawani had her third baby with her personal photographer cum husband, Segun Wealth some months back."
  },
  {
    "headline": "2023 Election: Pastor Adeboye Speaks On Next Nigerian President.",
    "summarized_story": "Pastor E A Adeboye, the General Overseer of the Redeemed Christian Church of God, RCCG, has reacted to inquiries about who will be Nigeria’s next president.\nSpeaking during a New Year sermon, Adeboye while unveiling prophesies for the new year, said God is yet to reveal President Muhammadu Buhari’s successor to him.\nThe 79-year-old clergy who warned against fake prophecies, said there was no need to do guesswork with prophecy, adding that any prophecy which carries, “maybe” is fake.\nHe said, “if somebody asks me today like many people are already doing, ‘Daddy, who is going to be our next President?’“The answer is: I don’t know.\n‘How can you say you don’t know?"
  },
  {
    "headline": "My persecutors planned to drug, undress, film me among prostitutes – Mbaka",
    "summarized_story": "“The way they took Nnamdi Kanu was what they planned to do to me.\nThe Holy Spirit told me never to park in a place for 20 minutes.\n“But the Holy Spirit told me to be careful with my obedience and never to park anyhow.\n“From the one room I was given at Umuchigbo, God has given us a place (Adoration Ministry) he wants us to stay.\nIf I use my mouth to bless Nnamdi Kanu and you don’t like it, please use your own mouth to curse him."
  },
  {
    "headline": "God hasn’t told me who’ll be President in 2023 – Adeboye",
    "summarized_story": "The General Overseer of the Redeemed Christian Church of God, Pastor Enoch Adeboye, says God has not told him who will become Nigeria’s President in 2023.\n“When God speaks, He speaks specifically.\nWhen God speaks, He will say, ‘This fellow will succeed, that fellow is not going to make it’.\nThe cleric said, “When God speaks, some of the things He says may baffle your brain a little.\n“They said, ‘Why?’ I said because God told me."
  },
  {
    "headline": "BREAKING: Fire Guts Three-Storey Building In Lagos On New Year’s Day",
    "summarized_story": "A three-storey building has been gutted by fire in the Surulere area of Lagos State on New Year’s Day.\nAs of the time of filing this report, details of the fire incident are sketchy.\nThis would be the second fire incident to be recorded in Nigeria on new year’s day.\nEarlier, a fire incident was reported at the Port Harcourt Refinery Company in Eleme Local Government Area of Rivers State.\nThe refinery which is currently undergoing repairs is the first and largest refinery in the country."
  },
  {
    "headline": "Breaking: First class traditional ruler, Olubadan, is dead",
    "summarized_story": "The Olubadan of Ibadanland, Oba Saliu Adetunji, Sunday morning joined his ancestors, aged 93.\nSources close to the Olubadan palace said the late monarch died early Sunday, January 2, 2021 in a hospital in Ibadan where he has been receiving treatment.\nThe late Oba Adetunji was born on August 26, 1928 and became the 41st Olubadan when he was coronated on March 4, 2016.\nAs at the time of filling this report, palace sources said it is only the Oyo state government that can make the official announcement on the demise of Oba Adetunji.\nDetails loading…"
  },
  {
    "headline": "Breaking: Fire engulfs National Assembly, day after Archbishop Desmond Tutu’s funeral",
    "summarized_story": "A large fire is raging at the Houses of Parliament in the South African city of Cape Town.\nIt comes hours after Archbishop Desmond Tutu’s state funeral at St George’s Cathedral, near Parliament.\nThe roof area had caught fire and the National Assembly building was on fire too, the city authorities initially said.\nMinister of Public Works Patricia de Lille later said the fire in the Chamber of the Council of Provinces (the parliament’s upper house) had been contained, but the National Assembly building was still burning.\nThe newer sections built in the 1920s and 1980s house the National Assembly."
  },
  {
    "headline": "How I perfected kidnapping strategies by watching Nollywood – Suspect",
    "summarized_story": "A 23-year-old suspected kidnapper identified as Ayobamidele Kudus Ayodele has said he learnt how to abduct school children by watching Nollywood movies.\nHe particularly hinted that he understood kidnapping tricks via regular roles of a popular Nollywood actor, Zubby Michael.\nThe suspect made the shocking revelation after he was arrested by the operatives of the Force Intelligence Response Team (FIRT) in an operationAyodele was said to have been arrested after kidnapping a six-year-old pupil of Remson Group of schools in Ojo Alaba area of Lagos State.\nHe reportedly held the child captive for four days and wouldn’t allow him to go until his parents coughed up N550,000."
  },
  {
    "headline": "Air Force Kill Two Notorious Bandit Leaders, Several Others In Zamfara",
    "summarized_story": "The Nigerian Air Force has killed two notorious bandit leaders, Alhaji Auta, and Kachalla Ruga following an air raid of a forest in Zamfara State.\nSources revealed that the notorious bandit leaders were killed after a NAF aircraft, under Operation Hadarin Daji, acted on credible intelligence, and bombarded their enclaves at Gusami Forest and Tsamre Village in Birnin Magaji local government area of the state last Friday night.\nRead Also: Olubadan Of Ibadan, Oba Saliu Adetunji Is DeadAccording to the sources, multiple airstrikes by the NAF jet, which were carried out in the early hours of Saturday have also led to the death of several other bandits.\nAnother source told Channels TV that some bandits were also killed by the military jet when they went to retrieve the body of the bandits’ leader Alhaji Auta from the scene of bombardment.\nResidents believe that if this level of action is sustained and other local political actors key into working for peace, Zamfara State and the entire northwest region will be restored to the “peaceful region” it once used to be."
  },
  {
    "headline": "Olubadan Of Ibadan, Oba Saliu Adetunji Is Dead",
    "summarized_story": "The Olubadan of Ibadan land, Oba Saliu Adetunji, has died.\nThe monarch who was 93 years old died on Sunday at the University College Hospital (UCH) in Ibadan.\nAn official statement from the palace is, however, yet to be released.\nRead Also: Air Force Kill Two Notorious Bandit Leaders, Several Others In ZamfaraOba Adetunji was crowned the 41st Olubadan of Ibadan following his coronation on March 4, 2016.\nPrior to his coronation as the Olubadan of Ibadan, he was the Balogun of Ibadan land."
  },
  {
    "headline": "Governors Preach Love, Tolerance In New Year Messages",
    "summarized_story": "He assured them that his administration would continue to implement policies, programmes, and projects that have a direct and positive impact on them.\nDespite witnessing two waves of COVID-19 in 2021, the mortality rate which we recorded in Edo State was far less than was projected.\nConsequently, the reform of our healthcare system is now a very high priority in our ongoing transformation of the entire governance structure of Edo State.\nThe physical and digital infrastructure we are laying across the state, including the proposed Airport in Edo North, will position Edo State as a major commercial hub in Nigeria and West Africa.\nI reassure the good people of Edo State that I will continue to strive to do only that which is in the best interest of Edo State and Edo people."
  },
  {
    "headline": "[EXCLUSIVE]: Bola Tinubu Contesting In 2023 A ‘Done Deal’ – Jibrin",
    "summarized_story": "Council, Abdulmumin Jibrin, has confirmed that former Governor of Lagos State and chieftain of the All Progressives Congress (APC), Bola Ahmed Tinubu, will indeed be contesting in the forthcoming 2023 Presidential election.\nBut the issue of Bola Tinubu contesting is a done deal.\nHe is going to contest the election; he’s going to be on the ballot paper,” Jibrin said in an exclusive interview with Channels Television on Saturday.\nRead Also: 2023 Presidency: About 2,500 Islamic Clerics Offer Prayers For Tinubu In KanoAccording to Jibrin, Tinubu has all it takes to defeat any other candidate in the election.\n“For me, the person who has an edge over all of them, that we can hand over the ticket to and perhaps go back home and sleep, is Asiwaju Bola Tinubu,” he said."
  },
  {
    "headline": "US Airport Chaos As Over 2,700 Flights Cancelled",
    "summarized_story": "The United States had 2,723 cancelled flights, more than half of the 4,698 cancelled worldwide, around 11:00 pm (0400 GMT Sunday), according to tracking website FlightAware.\nIn addition, 5,993 domestic flights were delayed on Saturday, out of a total of 11.043 worldwide for the day.\nThe worst affected US airline was SkyWest, which had to cancel 23 percent of its flight schedule, according to the site.\nIn the United States, airports in Chicago were particularly hard-hit because of bad weather, with a snowstorm expected in the area on Saturday afternoon and into the night.\nSome 7,500 flights were cancelled by airlines worldwide over the Christmas weekend."
  },
  {
    "headline": "Gov. Ugwuanyi signs N186.64 billion 2022 budget into law",
    "summarized_story": "Enugu state Governor, Ifeanyi Ugwuanyi has assented to the 2022 appropriation bill of 186,64 billion naira recently passed by the State House of Assembly.\nPresenting the appropriation bill to Governor Ugwuanyi for assent, the Speaker of the State House of Assembly, Edward Ubosi disclosed that the budget proposal was a wonderful budget of international standard.\nUbosi explained that all the Ministries, Departments and Agencies (MDAs) appeared before the various committees to ensure they defended their budget estimates.\nAssenting to the appropriation bill, Governor Ugwuanyi expressed gratitude to God and the members of the State House of Assembly for their commitment and dedication to legislative duties as well as the development of Enugu State.\nHe expressed confidence that the budget would be implemented faithfully for the people of the state to enjoy more dividends of democracy."
  },
  {
    "headline": "Tinubu condoles with Gov Ganduje, Sharia Council over Sheikh Datti Ahmed's death -",
    "summarized_story": "The All Progressives Congress National Leader, Asiwaju Bola Tinubu, has commiserated with Kano State Governor Abdullahi Ganduje and the Supreme Council for Sharia in Nigeria over the death of elder-statesman and president of the council, Dr. Datti Ahmed.\nHe said throughout his life, Dr. Ahmed symbolised and fought for justice, equity and fairness adding that his demise was a loss not only to the Muslim community in Nigeria but to all Nigerians.\n“As a first generation medical doctor from Kano State, Dr. Ahmed dedicated his life to the service of humanity.\n“The death of Dr. Ahmed is a great loss to the medical community in Nigeria and the comity of Islamic scholars.\n“My condolences to his family, Kano State Governor Abdullahi Ganduje, the government and people of the state, Muslims across the country, and Nigerians as a whole."
  },
  {
    "headline": "Auditor General indicts NASS over alleged misappropriation of N9.4b -",
    "summarized_story": "The Office of the Auditor General for the Federation has indicted the management of the National Assembly and the National Assembly Service Commission for alleged unexplained expenditure amounting to N9.4 billion in the 2019 financial year.\nThe report said about N5.5 billion of such expenditure was credited to the House of Representatives in five different audit queries, N3.5 billion credited to the Senate in seven audit queries, while N307.6 million was credited to the National Assembly Service Commission in two audit queries.\nThe queries are contained in the Auditor General’s annual report on non-compliance and internal control weaknesses issues in Ministries, departments and agencies of the federal government for the year ended 31st December 2019.\nThe Report addressed to the Clerk to the National Assembly was signed by the Auditor General for the Federation, Adolphus Aghughu.\nThe report said N2.5 billion was granted to members of the House of Representatives as running costs between July and December 2019 without evidence to show what the funds were used for even as it was not retired."
  },
  {
    "headline": "Somali President suspends PM Roble, accuses him of undermining legislative elections",
    "summarized_story": "President of Somalia Mohamed Abdullahi Mohamed stated Monday that he is suspending Prime Minister Mohamed Hussein Roble, widening the political schism between the country’s top officials.\nAccording to a spokeswoman for President Mohamed, also known as Farmajo, the move was taken in response to an investigation into an illegal acquisition of public land involving Prime Minister Roble.\nThe prime minister accused Mohamed of obstructing parliamentary elections, prompting Roble’s suspension.\nEarlier this year, the feuding leaders agreed to enable 101 delegates to choose members of parliament, who would then choose the future head of state.\nObservers fear that the feud between Farmajo and Roble will divert attention away from the ongoing threat posed by the al Shabab insurgent group, which has fought the central government in an attempt to seize power and impose sharia law in Somalia, which has been wracked by chaos and conflict since the overthrow of former dictator Mohamed Siad Barre in 1991."
  },
  {
    "headline": "Israeli Jets Hit Militant Targets in Gaza After Rocket Fire",
    "summarized_story": "Israel’s military said early Sunday it launched strikes against militant targets in the Gaza Strip, a day after rockets were fired from the Hamas-ruled territory.\nVideo filmed in Khan Younis, southern Gaza Strip, showed three huge explosions and fighter jets could be heard flying overhead.\nThe Israeli military said the attacks targeted a rocket manufacturing facility and a military post for Hamas.\nIt also blamed the militant Islamic group for any violence emanating from the territory it controls.\nIt was not clear whether the rockets were meant to hit Israel, but Gaza-based militant groups often test-fire missiles toward the sea."
  },
  {
    "headline": "France to Cut Covid Isolation Time for Fully Vaccinated People",
    "summarized_story": "France says it will reduce the isolation period for fully vaccinated people who test positive for COVID-19.\nHealth Minister Olivier Veran told the newspaper Le Journal du Dimanche on Sunday that fully vaccinated people will only have to isolate for seven days instead of 10, beginning on Monday.\nBut those who are not vaccinated and who test positive “will have to self-isolate for 10 days, with a possibility to come out of isolation after seven days under the same terms”, Veran said.\nOther countries such as the United States also reduced this week the isolation period for COVID-19 to five days in a bid to prevent disruptions in industries for lack of staff.\nIt said the decision to reduce isolation periods was “aimed at ensuring the virus is controlled while maintaining socioeconomic life”."
  },
  {
    "headline": "US Removes Ethiopia, Mali, Guinea from Trade Programme Over Human Rights Violations and Coups",
    "summarized_story": "The United States has cut Ethiopia, Mali and Guinea out of a duty-free trade programme over alleged human rights violations and recent coups.\nIt said the US was deeply concerned “by the gross violations of internationally recognised human rights being perpetrated by the government of Ethiopia and other parties amid the widening conflict in northern Ethiopia”, as well as by “the unconstitutional change in governments in both Guinea and Mali”.\nThe AGOA trade legislation provides sub-Saharan African nations with duty-free access to the US if they meet certain eligibility requirements, such as eliminating barriers to US trade and investment and making progress towards political pluralism.\nIn its Saturday statement, the USTR said Ethiopia, Mali and Guinea may still rejoin the pact if they met the statute’s provisions.\nUS President Joe Biden had announced in November that Ethiopia would be cut off from the duty-free trading scheme provided under AGOA due to alleged human rights violations in the country’s north."
  },
  {
    "headline": "Liverpool Manager Klopp to Miss Chelsea Game After Suspected Positive Covid Test",
    "summarized_story": "Liverpool manager Jurgen Klopp has returned a suspected positive test for Covid-19 and will miss Sunday’s Premier League game against Chelsea.\nThe 54-year-old is experiencing mild symptoms and is isolating, so his assistant Pep Lijnders will take charge for the visit to Stamford Bridge.\nOn Friday Klopp said three players had tested positive for Covid-19.\nHowever, three backroom staff have also returned suspected positive tests.\nLiverpool are third in the Premier League table, one point behind Chelsea and 12 adrift of leaders Manchester City with two games in hand on Pep Guardiola’s side."
  },
  {
    "headline": "UK Pupils to Wear Face Masks in Class to Tackle Omicron",
    "summarized_story": "Face masks are to be worn in secondary classrooms in England’s schools to reduce the spread of the Omicron variant, the government has announced.\nThe temporary reintroduction of face coverings aims to address concerns about schools remaining open for face-to-face learning this coming term.\nUntil now, England was the only one of the four UK nations where face masks were not recommended for pupils in classrooms.\nAnnouncing the change – just a few days before schools reopen – Education Secretary Nadhim Zahawi said face coverings would be required until 26 January.\nGeneral Secretary of the National Association of Head Teachers Paul Whiteman said reintroducing face masks in secondary classrooms was a sensible move, but that more should be done."
  }
]