[
  {
    "headline": "How we survived chronic lower back pains after caesarean sections —Mothers",
    "summarized_story": "However, as days become months, another type of debilitating pain resurfaces for some mothers – lower back pain.\nSome mothers dealing with this challenge lamented that the pain has affected their ability to function effectively months after delivery.\nAccording to Ugochukwu, the lower back pain is not unconnected with her delivery through the ceaseran section.\nIt explained that doctors use epidural injections to relieve pain during and after surgery, as well as manage chronic pain.\nThe gynaecological experts also explained that not all women suffer from lower back pain after delivery while some women are prone to it."
  },
  {
    "headline": "How we survived chronic lower back pains after caesarean sections —Mothers",
    "summarized_story": "However, as days become months, another type of debilitating pain resurfaces for some mothers – lower back pain.\nSome mothers dealing with this challenge lamented that the pain has affected their ability to function effectively months after delivery.\nAccording to Ugochukwu, the lower back pain is not unconnected with her delivery through the ceaseran section.\nIt explained that doctors use epidural injections to relieve pain during and after surgery, as well as manage chronic pain.\nThe gynaecological experts also explained that not all women suffer from lower back pain after delivery while some women are prone to it."
  },
  {
    "headline": "I’ve been in pain since my wife, kids left – Broadcaster blinded by cataracts, retinal bleeding",
    "summarized_story": "I worked with Star FM for three years then I went back to Metro FM as a freelancer.\nI became inquisitive and went to an eye clinic where, I was told that I had cataracts.\nThey advised me to go to the University College Hospital, Ibadan, and specifically told me to meet a particular doctor.\nSome of the eyedrops were so peppery that they left me unable to do anything for a day or two.\nI think it is because of my eye problem and the diabetes."
  },
  {
    "headline": "I’ve been in pain since my wife, kids left – Broadcaster blinded by cataracts, retinal bleeding",
    "summarized_story": "I worked with Star FM for three years then I went back to Metro FM as a freelancer.\nI became inquisitive and went to an eye clinic where, I was told that I had cataracts.\nThey advised me to go to the University College Hospital, Ibadan, and specifically told me to meet a particular doctor.\nSome of the eyedrops were so peppery that they left me unable to do anything for a day or two.\nI think it is because of my eye problem and the diabetes."
  },
  {
    "headline": "More schools ‘ll reduce ‘begging’ across our domain — Sultan",
    "summarized_story": "Our correspondent reports that the School which was initiated by a Sokoto based Philanthropist Alhaji Umarun Kwabo has 171 Orphans and fewer privileges.\nAccording to Sultan, the children are no longer orphans because he is their father and guardian.\nHe called on Scholars to sustain more enlightenment on the need for the society to support orphans and the needy.\n“The gesture if properly sustained by the society will drastically reduce the ugly situation of rampant begging across our domain,” he said.\nEarlier, the school Proprietor and philanthropist Alhaji Umarun AA, said the gesture is part of his commitment to encouraging society to support orphans and the needy across the country."
  },
  {
    "headline": "Nigeria Automotive industry, Private Sector invests over N500bn — DG NADDC",
    "summarized_story": "By Musa Ba Annabi SokotoDirector-General, National Automotive Design and Development Council ( NADDC), Jelani Aliyu Dogondaji has commended the private sector for investing over N500 billion in the Nigeria Automotive manufacturing industry.\nOur correspondent reports that the DG made the revelation while speaking to journalists on efforts made by the NADDC to boost the local production of vehicles in Nigeria.\n” The council is working to effectively implement an automotive policy agenda, with a view to bringing these companies back to Nigeria.\nThis, he averred, is to make it now in tune with the extant global movement in producing vehicles.\n“So, overnight, Nigeria went into recession, overnight, Nigerians became poor, those people who could buy new 504s, new 505s and beetles could no longer do that."
  },
  {
    "headline": "Revive abandoned MMA’s N250m packaging factory, freight forwarders urge FG",
    "summarized_story": "By Tunde OsoCITING President Muhammadu Buhari’s administration’s mandate to improve the ease of doing business at Nigerian ports, the African Association of Professional Freight Forwarders and Logistics of Nigeria (APFFLON) has urged the Federal Government to revive the abandoned N250million packaging factory at the Murtala Muhammad Airport (MMA), Lagos.\nThe Chief Executive of FOB, Oluwajimi Adebakin, said that talks were in the final stage with NAHCO towards the commencement of the packaging project as the site had already been secured.\nAdebakin explained that the “Brand Nigeria project”, which he described as a national assignment, was to ensure that products exported from Nigeria meet international standards through proper labelling and packaging.\nThe Director, Business Development at NEPC, William Eze in Lagos, recently said Nigerian products destined for export, especially to the US market, have been faced with poor packaging which resulted in rejections.\n“A recent report says that 30 per cent of our (Nigeria) exports to the US are rejected as a result of poor packaging and labelling, not quality of the products,” he said."
  },
  {
    "headline": "Focus on begging Wike for VP slot, stop panicking over Emefiele, EYLC tells Tambuwal",
    "summarized_story": "The group under the aegis of the Nigerian Ethnic Youths Leaders Council, NEYLC, asked Tambuwal to stop panicking over Emefiele who has yet to declare an interest.\nThe NEYLC, which is made up of the Arewa Consultative Youths Movement, ACYM, Ohanaeze Ndigbo Youths Movement, Oduduwa Youths and Middle Belt Youths, made their position known in a statement by the Ohanaeze Secretary-General and Head of Coalition’s secretariat, Nwada Ike Chiamaka.\nAlso Read:APC nomination form: Attacking Emefiele, leaving Adeshina display of ethnic bigotry — EYLThe statement read, “We will like to tell Governor Tambuwal that blowing off someone else’s candle will not make his own candle brighter.\n“We are offering Tambuwal a free counsel: that he should continue begging Governor Nyesom Wike, who is also a presidential aspirant, for a VP slot instead of losing sleep on a case of a man who has not yet declared an interest.\n“Tambuwal should stop taking paracetamol for other people’s headaches.”Vanguard News Nigeria"
  },
  {
    "headline": "Driving against traffic: Commercial bus driver bites task force official to evade arrest",
    "summarized_story": "Officials of the Lagos State Taskforce have arrested a commercial driver who bit the finger of an official of the Agency during his arrest and impoundment of his vehicle for driving against traffic (One-way) along the Oshodi-Apapa Expressway.\nThe suspect, Osinachi Ndukwe, 32, drove against traffic from Oshodi down to Ayoni Bus stop along that route to beat traffic which was a result of the road construction going on on that axis.\n“I usually complete eight to 10 trips in a day but because of the traffic construction going on here, I decided to drive on one-way all the way down to Ayoni Bus stop.\nCSP Jejeloye disclosed that most motorists try to use Road construction as an excuse to break the law but it is not acceptable.\n“Driving against traffic is dangerous and irresponsible and should be frowned at at all levels” He noted."
  },
  {
    "headline": "Buhari to attend conference on desertification, drought, degradation in Abidjan",
    "summarized_story": "President Muhammadu Buhari will in a few hours from now leave the shores of Nigeria for Abidjan, Cote d’Ivoire, to attend a United Nations organized conference on the future of land, regarding desertification, drought, degradation, rights, restoration and implications for national and world economies.\nBuhari will join other world leaders to participate in a Summit of Head of States and Government, on May 9th-10th, 2022.\nThe meeting will hold at Sofitel Hotel, for the 15th session of the Conference Of Parties (COP15) of the United Nations Convention to Combat Desertification (UNCCD), with the theme “, ‘Land.\nIt explained that COP 15 is a key moment in the fight against desertification, land degradation and drought.\n“Drought, land restoration, and related enablers such as land rights, gender equality and youth empowerment are among the top items on the Conference agenda,” the presidential spokesman noted."
  },
  {
    "headline": "Kwara NUJ mourns veteran broadcaster, Yemi Ademokoya",
    "summarized_story": "The death has been announced of a veteran broadcaster, Yemi Ademokoya in Ilorin, Kwara State capital.\nLate Ademokoya was until her death the treasurer of the National League of Veteran Journalists, NALVEJ, Kwara State chapter.\nThe Kwara State Council of the Nigeria of Journalists (NUJ) in a statement in Ilorin on Sunday condoled the family of the late veteran broadcast Journalist.\nThe statement said Kwara NUJ will not forget her vibrancy even in retirement as she contributed positively to the journalism profession.\nLate Chief Mrs Yemi Ademokoya Agboola, a seasoned broadcaster, died at the age of 67 years and is survived by family, children and grandchildren."
  },
  {
    "headline": "2023: CBN now an extension of APC – Ohanaeze gives Emefiele one-month resignation ultimatum",
    "summarized_story": "The youth wing of apex Igbo socio-cultural organization, Ohanaeze Ndigbo Youth Council Worldwide has demanded the immediate resignation of the Central Bank Governor, Godwin Emefiele.\nDAILY POST reports that the development is in connection with the N100m presidential form of the All Progressives Congress, APC.\nEmefiele was within the week listed as one of those who have purchased the form.\nAnd could his so-called father Christmas farmers and patriots have purchased APC form for him if he were not a card carrying member of the party?” Okwu asked.\n“We can’t afford to continue to retain a card carrying member of the APC as CBN Governor."
  },
  {
    "headline": "2023: Miscreants will take over if technocrats, intellectuals shun politics – Ibadan Chief, Adegoke",
    "summarized_story": "An Ibadan Chief, Oloye Taofeek Adegboyega Adegoke has advised people of integrity such as professionals, academics and technocrats not to shy away from politics.\nHowever, Adegoke believes hoodlums will take over the process and leadership of the country if people of integrity distance themselves from politics.\nHe said, “Hoodlums will be in power if people of integrity shun politics.\nWe need leaders that can tap these resources.\n“If we don’t participate in politics, it is the miscreants and the hoodlums that will be ruling us and we cannot complain."
  },
  {
    "headline": "2023 Elections: Retaining offices, using public funds, dollar bribe illegal – TMG",
    "summarized_story": "The Transition Monitoring Group (TMG) said appointees still in office despite aspiring for political positions in 2023 were doing so illegally.\nThe organization also kicked against the use of state resources for election campaigns and party activities.\nTMG Chairman, Auwal Rafsanjani, stressed that the use of taxpayers’ funds and common resources to cover personal purposes was unacceptable.\nRafsanjani told political appointees and other public servants aiming for elective positions to tender their resignation immediately.\n“In compliance with the provision, all political appointees and other public servants should submit their resignation letters and run their campaigns legally”, the statement added."
  },
  {
    "headline": "List of aspirants who have picked APC presidential forms",
    "summarized_story": "As the Tuesday date for collection of All Progressives Congress(APC) presidential form draws nearer, about 20 aspirants have obtained the form.\nHere is a list of those who have picked APC presidential forms:1.\nKogi Governor Yahaya Bello3.\nEbonyi Governor Dave Umahi4.\nVice President Yemi Osinbajo9."
  },
  {
    "headline": "ASUU strike: Students mobilise for protests in Lagos, Imo, others",
    "summarized_story": "ASUU strike: Students mobilise for protests in Lagos, Imo, othersStudents have commenced mass mobilisation across States, including Lagos, Ilorin and Imo against the continued strike action by the Academic Staff Union of Universities (ASUU) and non-teaching staff unions.\nThe Nation gathered that students have decided to embark on peaceful march on the streets because there seems to be no end in sight to the ASUU strike, which has entered its third month.\nAccording to fliers seen by The Nation trending on social media platforms, students in Lagos will gather at University Road Junction Yaba on Monday by 8:00am for the action.\nRead Also: NANS urges ASUU to be flexible as negotiations with FG resumeBanners with inscriptions like ‘End ASUU strike now’, and ‘No to incessant strikes’, among others have since gone viral.\nLast week, students from tertiary institutions in Edo State including University of Benin (UNIBEN), Ambrose Alli University, Ekpoma (AAU), and Federal Polytechnic Auchi protested the strike action."
  },
  {
    "headline": "My grouse with Osinbajo – Dele Momodu",
    "summarized_story": "Presidential aspirant under the Peoples Democratic Party (PDP), Chief Dele Momodu, is seen by many as a lightweight, going by the number of big career politicians he is up against in the race for the party’s sole ticket.\nHe spoke with Gboyega Alaka about his upbringing, career,presidential aspiration and his misgivings about Vice President Yemi Osinbajo, among other issues.\nHe looked simple, so I don’t know what happened to him.\nI don’t know what the cabal did to him.\nI am over sixty; there is no young man who can say that technically he is better than Dele Momodu on social media, apart from musicians."
  },
  {
    "headline": "Easter Advert: Sterling Bank begs CAN for forgiveness",
    "summarized_story": "The leadership of the Christian Association of Nigeria (CAN) has forgiven the Sterling Bank and its Chief Executive Officer, Mr. Abubakar Suleiman, over the provocative and demeaning Easter greeting advertised by the Bank.\nThe Bank in the said advertisement had compared the Resurrection of Jesus Christ to ‘Agege Bread.’CAN said the bank had written an acceptable and genuine apology letter dated 20 April 2022 to the CAN personally and signed by the Chief Executive Officer, Abubakar Suleiman.\n“As a result of this development, CAN has resolved to forgive Sterling Bank and its Chief Executive.\n“We hereby call on all Christians in the country to join us in forgiving the Sterling Bank and its management.\nThose who are considering stopping patronizing the bank as a result of the blunder should stop the process but instead continue doing business with the bank."
  },
  {
    "headline": "GenCos, NBET renegotiate contracted capacity",
    "summarized_story": "The Nigerian Electricity Regulatory Commission (NERC) yesterday revealed that some Generation Companies (Gencos) have commenced the renegotiation of contracted capacity with the Nigerian Bulk Electricity Trading Company (NBET) in order to free up energy for eligible customers.\nNERC’s Vice Chairman, Musiliu Oseni, who made this disclosure in a press briefing in Abuja, insisted that nothing had gone wrong with the implementation of the eligible customers regulation implementation.\nAccording to him, there are a few eligible customers because of the handful ones that have been able to complete their submission and review of the necessary documentation.\nHe explained that this is because many of the generators in the country already have contracts with the Nigerian Bulk Electricity Trading (NBET), stressing that GenCos cannot contract the same capacity twice.\nOn the renegotiation between GenCos and NBET, he said: “But of course, some of them (GenCos) are also making a move to renegotiate the contracted capacity already made with NBET in order to free up some capacity to sell to eligible customers."
  },
  {
    "headline": "The Sun Awards: Night of excellence, glamour",
    "summarized_story": "By Olafioye Olakunle, Chinelo Obogo, Daniel Kanu, Chukwudi Nweje, Sunday AniIt was a night of excellence and glamour yesterday at The Sun Awards as many eminent Nigerians were celebrated.\nImo State governor, Hope Uzobimma also flayed opponents and critics of his government, saying that the state of insecurity in the state is the handwork of opposition.\n“We have been receiving many awards, but The Sun awards is the award.\nI would like to appreciate my Senate President for his support which has made what I do possible.\nI want to thank Abia State Governor, Okezie Ikpeazu, who is the most supportive husband."
  },
  {
    "headline": "Sun Awards symbolises unity –Orji Kalu",
    "summarized_story": "He commended the award winners for being singled out among 200 million Nigerians and charged them to keep the fire burning.\nThe onus is, therefore, on the award winners to continue doing their best in order not to descend from the point of excellence to a lower pedestal.\n“I have seen The Sun Awards evolving from a sole award ceremony of Man of the Year award to a multifaceted award ceremony.\nHe described the process of selecting winners of the Awards as meticulous just as the process of organizing the Awards is rigorous.\n“For the award winners, we say: Continue to excel."
  },
  {
    "headline": "2023 presidency: Anxiety in PDP over zoning, litigations",
    "summarized_story": "From Ndubuisi Orji, AbujaThe Peoples Democratic Party Party (PDP) is currently walking on a tightrope.\nThose cleared include former Vice President Atiku Abubakar; Bauchi State governor, Bala Mohammed; former Anambra State governor, Peter Obi; Aminu Tambuwal, Nyesom Wike, Emmanuel Udom, governors of Sokoto, Rivers, and Akwa Ibom states respectively.\nSince March 2021, members of the PDP have been divided on whether or not the 2023 presidential ticket should be zoned.\nThe PDP National Executive Committee (NEC) at its meeting on March 16, set up a committee to come up with a formula for the zoning of offices for the 2023 polls.\nThe NEC, which is the second highest organ is expected to take a definite stand on whether or not the 2023 presidential ticket should be zoned."
  },
  {
    "headline": "Airports: Don’t shutdown operations, FG begs local airlines",
    "summarized_story": "From Uche Usim, AbujaMinister of Aviation, Mr Hadi Sirika, has appealed to local airlines to reconsider the planned shutdown of operations tomorrow, saying that the development has disastrous consequences on the economy as a whole.\nSirika in a statement issued yesterday said that high-level engagements with airlines, oil marketers and other stakeholders were on to address the scathing price of Jet A1 (aviation fuel).\nHe emphasized that the matter was outside his purview, but will continue to engage all those concerned.\n“We also acknowledge that the airline operators are in the business to make profits, while servicing the very critical sector that is not only the preferred mode of transport for most Nigerians, but also the main international gateway to the nation.\nThe local operators on the platform of Airline Operators of Nigeria (AON) threatened to ground operations from tomorrow, citing the scarce and costly price of Jet A1, which recently hit N700/litre."
  },
  {
    "headline": "Road to 2023: Emefiele has not violated any law – North-Central Youths",
    "summarized_story": "From Fred Itua, AbujaMembers of the Coalition of North-Central Youths Vanguard for Emefiele, have said that the Governor of the Central Bank of Nigeria (CBN), Godwin Emefiele has not broken any law by purchasing the Presidential forms of the All Progressives Congress (APC).\nAmeenah Hayatudeen Publicity Secretary, The Coalition of North-Central Youths Vanguard for Emefiele in a statement, said the Section of CBN Act erroneously quoted, has not been violated by Emefiele.\n“We make bold to ask then from Emefiele’s traducers “what then is the natural and ordinary meaning of the word employment?\nAnd there is no impediment whatsoever on the exercise of such rights except such impediments are contained in the constitution.\n“Contesting for the position of the president is an exercise of constitutional rights and not an engagement in any employment or vocation."
  },
  {
    "headline": "2023 Presidency: Emefiele to Decide in Next Few Days",
    "summarized_story": "The Unified Northern Nigeria Youth Forum (UNNYF), one of the groups calling on Emefiele to contest for the 2023 Presidency, has also condemned the call by the Ondo State Governor, Mr. Rotimi Akeredolu, for Emefiele to resign.\nThe CBN governor, in a series of Tweets, disclosed that he hasn’t decided on whether to throw his hat into the ring or not.\nOn its part, UNNYF, one of the groups calling on Emefiele to contest has condemned Akeredolu’s call for him to resign.\nThe coalition is led by the Head, of One Nigeria Group, Mr Mohammed Saleh.\nOne, he is not comfortable with the large number of people that have purchased the presidential forms in APC."
  },
  {
    "headline": "PDP NEC Meets Wednesday on Zoning of Presidency",
    "summarized_story": "The committee had recommended that the party should throw open the presidential ticket of the party to all interested party members.\nThe PDP NEC had in its meeting set up a 37-man committee to discuss and advise the party on where to zone its presidential ticket for the 2023 presidential election.\nAyu promised that the committee’s recommendations would be transmitted to the NEC, which would take a final decision.\nZone Presidential Ticket to South-east for Stability, Equity, Yakassai tells PDPMeanwhile, the 97-year-old Yakassai has urged the PDP to zone its presidential ticket to the South for the sake of stability and justice.\nIn his response on behalf of the party’s NWC, the National Chairman of the PDP, Ayu, promised a transparent and fair presidential primary."
  },
  {
    "headline": "Game on as Rice Farmers Buy APC Presidential Forms for Emefiele, Unsettle Other Aspirants",
    "summarized_story": "On the same day, South-west APC presidential aspirants and leaders met in Lagos and reached an agreement to ensure that the next presidential candidate of the party is produced by the region.\n22 APC Presidential Aspirants Pick FormsAs at last night, no fewer than 22 presidential aspirants had purchased the Expression of Interest and Nomination forms of the APC ahead of Tuesday’s deadline.\nOthers are Jigawa State Governor, Abubakar Badaru; the former Governor of Zamfara State, Sani Yerima and the former speaker, House of Representatives, Dimeji Bankole.\nSouth-west presidential aspirants meet in LagosSouth-west APC presidential aspirants and leaders met in Lagos yesterday and reached an agreement to ensure that the region produces the next APC presidential candidate.\nHe said the South-west APC presidential aspirants, governors and other leaders are united ahead of the 2023 general elections."
  },
  {
    "headline": "Imo Loses, S’Court Cedes 17 Oil Wells to Rivers State",
    "summarized_story": "*Declares only Rivers entitled to 13% derivation from the wellsAlex Enumah in AbujaThe Supreme Court yesterday resolved the issue of the state entitled to the revenues from 17 oil wells in Akri and Mbede communities in favour of Rivers State.\nBoth Rivers and Imo states have been engaged in legal battles over the ownership of the 17 oil wells located in boundary communities between the two states.\nThe National Boundary Commission had in the Nigeria Administrative Map, 10th, 11th, 12th, and other maps delineated the two communities in which the 17 oil wells are located in Imo State.\nBut, Rivers State, citing decree No.\nThe apex Court also declared that based on the correct instruments, maps and documents for determining the boundary between Rivers and Imo states, the following Rivers State communities wrongly attributed to Imo State, among other communities, are communities within the territorial boundaries of Rivers State and therefore communities in respect of which Rivers State was entitled to exercise governmental and administrative powers, including entitlement to benefits derivable from mineral or other resources within the communities."
  },
  {
    "headline": "News in Photographs: S’West APC Leaders Meet Osinbajo, Tinubu, Other Presidential Aspirants",
    "summarized_story": "News in Photographs: S’West APC Leaders Meet Osinbajo, Tinubu, Other Presidential AspirantsA meeting of South West leaders of the All Progressives Congress with presidential aspirants from the zone is under way in Lagos.\nThe meeting convened by former Governors Bisi Akande and Segun Osoba is holding at the State House, Marina.\nIn attendance are APC presidential aspirants from the zone, including Vice President Yemi Osinbajo, Asiwaju Bola Ahmed Tinubu, Governor Kayode Fayemi and former Governor Ibikunle Amosun.\nAlso attending the meeting are Speaker Femi Gbajabiamila, Works Minister Babatunde Fashola, Interior Minister Rauf Aregbesola, Governor Gboyega Oyetola, Governor Babajide Sanwo-Olu, Governor Rotimi Akeredolu, Governor Dapo Abiodun, APC National Secretary Iyiola Omisore, former Governor Gbenga Daniel and Trade Minister Niyi Adebayo, among others.\nThough the agenda of the meeting was not announced, it was gathered that the meeting was aimed at addressing rhe rising number of presidential aspirants from.the zone on the platform of APC."
  },
  {
    "headline": "2023: Nigerian Christian Leaders Will Tell Faithful Endorsed Presidential Candidate To Vote For—Pastor Adefarasin",
    "summarized_story": "The founder of the House On The Rock Church, Pastor Paul Adefarasin, Sunday, revealed the plans by some Christian leaders to influence the choice of presidential candidate their church members should vote for.\nThe cleric also called on Christians to get their Permanent Voter Card (PVC) to vote for candidates endorsed by church leaders to influence the 2023 general elections.\nHe further told his congregants that instructions regarding which political candidates to vote for would be provided.\n“We believe, we can get 15 million more voters and that becomes a very significant bloc that must be respected and it adds to the platform of our voice, harmonised as Christian leaders.\nI can’t be opportune to see all Muslims in Nigeria but through the Muslim leaders, we can make it happen.”"
  },
  {
    "headline": "2023: Nigerian Christian Leaders Will Tell Faithful Endorsed Presidential Candidate To Vote For—Pastor Adefarasin",
    "summarized_story": "The founder of the House On The Rock Church, Pastor Paul Adefarasin, Sunday, revealed the plans by some Christian leaders to influence the choice of presidential candidate their church members should vote for.\nThe cleric also called on Christians to get their Permanent Voter Card (PVC) to vote for candidates endorsed by church leaders to influence the 2023 general elections.\nHe further told his congregants that instructions regarding which political candidates to vote for would be provided.\n“We believe, we can get 15 million more voters and that becomes a very significant bloc that must be respected and it adds to the platform of our voice, harmonised as Christian leaders.\nI can’t be opportune to see all Muslims in Nigeria but through the Muslim leaders, we can make it happen.”"
  },
  {
    "headline": "EXCLUSIVE: Mountain Of Fire Ministries General Overseer, Olukoya Asks Family Of Regional Pastor Abducted For 10 Months To Keep Praying",
    "summarized_story": "The General Overseer of the Mountain of Fire and Miracles Ministries International, Dr. Daniel Olukoya, has asked the family of a Regional Pastor, Dan Osato Osamwonyi, abducted 10 months ago to keep praying instead of wasting money on the case.\nThe family alleged that the MFM GO had ignored the family, stressing that up till the moment, no single word or trace of pastor Daniel Osamwonyi had been seen and no call placed for a ransom.\nPastor Daniel Olukoya, General Overseer of the Mountain of Fire and Miracles Ministries (MFM).\nWhat was expected of the G.O was to be actively involved and go to any lengths to make sure his Regional Overseer pastor was found.\n\"This is why we the family are crying out loud for the public to help us ask MFM to rise for Pastor Daniel Osamwonyi, the MFM Regional Overseer,\" the source added."
  },
  {
    "headline": "EXCLUSIVE: Mountain Of Fire Ministries General Overseer, Olukoya Asks Family Of Regional Pastor Abducted For 10 Months To Keep Praying",
    "summarized_story": "The General Overseer of the Mountain of Fire and Miracles Ministries International, Dr. Daniel Olukoya, has asked the family of a Regional Pastor, Dan Osato Osamwonyi, abducted 10 months ago to keep praying instead of wasting money on the case.\nThe family alleged that the MFM GO had ignored the family, stressing that up till the moment, no single word or trace of pastor Daniel Osamwonyi had been seen and no call placed for a ransom.\nPastor Daniel Olukoya, General Overseer of the Mountain of Fire and Miracles Ministries (MFM).\nWhat was expected of the G.O was to be actively involved and go to any lengths to make sure his Regional Overseer pastor was found.\n\"This is why we the family are crying out loud for the public to help us ask MFM to rise for Pastor Daniel Osamwonyi, the MFM Regional Overseer,\" the source added."
  },
  {
    "headline": "2023: Contesting For Nigerian President Is Demotion For Me – Bishop Oyedepo",
    "summarized_story": "The presiding Bishop of the Living Faith Church, popularly known as Winners Chapel, worldwide, Bishop David Oyedepo, has said he will not be contesting for the presidency in the 2023 elections.\nOyedepo said vying to be Nigeria’s president is a demotion to him, adding that he’s called for a global impact.\nAccording to him, although he believes in Nigeria, it’s too late for him to contest the highest political position in the nation.\nOyedepo said, “I believe in Nigeria and that’s why I am still here, and still praying for Nigeria.\nBut I consider it a demotion if I am invited to become the president of Nigeria."
  },
  {
    "headline": "INTERVIEW: Shooting ‘Blood Sisters’ at peak of COVID-19 scary, says Biyi Bandele",
    "summarized_story": "AdvertisementBiyi Bandele, director of the project, recently featured on TheCable’s Twitter Space on the film titled “Blood Sisters: Nollywood’s New Gem”.\nShe’d phoned to find out if I’d be interested in directing another film, not Blood Sisters.\nWhile I was waiting, one Friday night, around 10 pm, Mo called me saying, ‘We’ve got this project called Blood Sisters, and we’re in pre-production, weeks away from shooting.\nIn episode 1 of ‘Blood Sisters’, I wanted Kola to be created on his own terms.\nWhat do you think Blood Sisters did right that subsequent titles can emulate?"
  },
  {
    "headline": "INTERVIEW: Shooting ‘Blood Sisters’ at peak of COVID-19 scary, says Biyi Bandele",
    "summarized_story": "AdvertisementBiyi Bandele, director of the project, recently featured on TheCable’s Twitter Space on the film titled “Blood Sisters: Nollywood’s New Gem”.\nShe’d phoned to find out if I’d be interested in directing another film, not Blood Sisters.\nWhile I was waiting, one Friday night, around 10 pm, Mo called me saying, ‘We’ve got this project called Blood Sisters, and we’re in pre-production, weeks away from shooting.\nIn episode 1 of ‘Blood Sisters’, I wanted Kola to be created on his own terms.\nWhat do you think Blood Sisters did right that subsequent titles can emulate?"
  },
  {
    "headline": "UK detects monkeypox in individual who ‘recently travelled from Nigeria’",
    "summarized_story": "Monkeypox is a rare viral infection that does not spread easily between people.\nAccording to a statement by the UK health security agency, “the patient has a recent travel history from Nigeria, which is where they are believed to have contracted the infection, before travelling to the UK”.\n“This includes contacting a number of passengers who travelled in close proximity to the patient on the same flight to the UK.\nAccording to the Nigeria Centre for Disease Control (NCDC), a total of 13 suspected cases has been reported between January 1 to February 28, 2022.\nOf the suspected cases, four were confirmed from four states — FCT (1), Imo (1), Adamawa (1) and Lagos (1) — but no death has been recorded."
  },
  {
    "headline": "UK detects monkeypox in individual who ‘recently travelled from Nigeria’",
    "summarized_story": "Monkeypox is a rare viral infection that does not spread easily between people.\nAccording to a statement by the UK health security agency, “the patient has a recent travel history from Nigeria, which is where they are believed to have contracted the infection, before travelling to the UK”.\n“This includes contacting a number of passengers who travelled in close proximity to the patient on the same flight to the UK.\nAccording to the Nigeria Centre for Disease Control (NCDC), a total of 13 suspected cases has been reported between January 1 to February 28, 2022.\nOf the suspected cases, four were confirmed from four states — FCT (1), Imo (1), Adamawa (1) and Lagos (1) — but no death has been recorded."
  },
  {
    "headline": "Ganduje moves to stop defection of Jibrin, DG of Tinubu support group, from APC",
    "summarized_story": "Abdullahi Ganduje, governor of Kano, is making efforts to stop the defection of Abdulmumin Jibrin, former house of representatives member, from the All Progressives Congress (APC).\nOn Saturday, Jibrin said he was going to announce his new political party, adding that he has done his best for the party.\nIn a statement on Sunday, Abdullahi Abbas, APC chairman, said Ganduje has asked that the crisis among those seeking to represent Kiru/Bebeji federal constituency be resolved.\n“To this end, the party secretariat has complied and summoned a stakeholder meeting to discuss the situation in the constituency.\nJibrin represented Kiru/Bebeji federal constituency in the eighth assembly."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "CAF is tackling Africa's $4bn cybersecurity threat",
    "summarized_story": "From ransomware attacks and phishing scams, to cryptojacking and malware, cybersecurity threats are on the rise as the world moves to become a “global village”.\nAlthough many African countries might not have the largest cybersecurity threats, they are still at risk of cyberattacks.\nThe top 5 cyber threats are online scams, digital extortion, business email compromise or BECs, ransomware, and botnets, and most were distributed through emails.\nUp until a few years ago, it was forbidden to send money, through Western Union, to Canada from Côte d’Ivoire.\nThe programme will take place in Abidjan, Côte d’Ivoire, on May 9 and 10, 2022."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "Can Anambra State spearhead a digital revolution in South-East Nigeria with Fred Agbata’s appointment?",
    "summarized_story": "Share this article:The Anambra State Governor, Charles Chukwuma Soludo, has announced the appointment of Chukwuemeka Fred Agbata as the MD/CEO of the Anambra State ICT Agency for a four-year tenure.\nMuch of the growth in Nigeria’s tech sector has been seen in Lagos State.\nThe hub provides a place for state residents to convene and potentially build technological products.\nAccording to data from the National Bureau of Statistics, the South Eastern region of Nigeria, where Anambra State is, has the lowest Internet penetration rates, with 13.7 million users.\nIn Agbata’s experience and Soludo’s previous experience as a Governor of the Central Bank of Nigeria (CBN), the state could become a digital powerhouse."
  },
  {
    "headline": "TikTok will start rewarding creators",
    "summarized_story": "AdvertisementToday, I’ll be discussing:Problems YC-backed startups are solvingTikTok’s PulseTigerrise’s plan to improve mental healthWhat problems are YC-backed startups solving?\nIsn’t this fantastic news for TikTok Pulse creators?\nTigerrise to improve mental health accessPhoto by Emily Underworld on UnsplashIn Africa, mental health care is scarce.\nTo back up this claim, Kenya’s health ministry reports that 75% of people in need of mental health services cannot obtain them.\nVictoria Fakiya A writer with ADHD who is interested in mental health and how technology is improving the lives of Africans with ADHD."
  },
  {
    "headline": "What problems are Y Combinator-backed startups solving in Africa?",
    "summarized_story": "This has significantly changed how African startups operate and, per some founders, helped refine their business processes.\nLittle wonder that 53% (51) of YC-backed African startups (95) are from Nigeria.\nBut the big question remains: What problems are Y Combinator-backed startups solving?\nWhat problems are Africa’s YC-backed startups solving?\nSo far, YC has invested in a whopping 47 Financial Services startups in Africa, almost half of its Africa alumni."
  },
  {
    "headline": "African Startup Gamic Guild made it into Binance Labs Season 4",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:Binance Labs has accepted the leading gaming guild in Africa into its incubation program, Gamic Guild to position the guild as the most sought after gaming guild in Africa.\nBinance Labs is excited to help Gamic Guild create massive opportunities, access an extensive network of industry leaders, establish a strong market presence and launch market-fit products and services.\nGamic Guild is poised to bridge that gap in the African GameFi ecosystem and create life-changing opportunities for people.\nGamic Guild is one of the latest startups to join the Binance Labs family.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team."
  },
  {
    "headline": "Aladdin Digital Bank, Closes a Debt-Financing Deal Up to $3.5 Million",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Aladdin Scheme Ltd, the leading Ecosystem Digital bank in Nigeria has announced its successful closing of a debt-financing deal up to $3.5 million.\nIn the last couple of months, Aladdin Digital bank has transformed from a digital bank app to a full scale financial powerhouse for individuals, freelancers and SMEs consistently delivering state of the art digital products on its banking platforms to support their hustle.\nIG: @aladdinbankngFacebook:@aladdinbankngLinkedIn:@aladdindigitalbankBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Air Peace, Max Air, Arik, four others remain resolute on flight suspension Monday",
    "summarized_story": "Air Peace Airline, Max Air, Arik, United Nigeria Airlines, Aero, Azman and Dana Air have said they remain resolute on decision to suspend flight operations on Monday.\n“Airline operators are patriotic citizens and we are doing all we can to protect the flying public contrary to what some subjective schools of thought might suggest.\nThis is a collective sacrifice for the common interest of our nation.\n“AON however regrets the unfortunate position taken by one of our members, Ibom Air, not to stand by the collective decision.\nThey stressed that this is totally unsustainable and its consequences, if allowed to stay, will be borne by the passengers; which is what they are trying to prevent."
  },
  {
    "headline": "2023: Is Nigeria for sale?",
    "summarized_story": "I don’t see change in 2023 because the masses are not ready to take on politicians,” he said.\n“With the forms in the hundreds of millions, Nigeria is truly on sale and it is only moneybags that can bid the highest and will carry the day.\nSadly, the government is no longer fighting corruption, the EFCC is doing nothing, and criminals are bidding for stakes in Nigeria,” he said.\n“However, you know that political elite in Africa and perhaps, other third world countries including Nigeria are opportunists.\nI am strongly persuaded that the army of presidential aspirants that we see today is for various reasons."
  },
  {
    "headline": "Ibom Air pulls out of planned airlines shutdown",
    "summarized_story": "Ibom Air, one of Nigeria’s carriers has pulled out of plans by most airlines in Nigeria to shut down flight operations from Monday.\nThis decision is coming barely 24 hours after the Airline operators of Nigeria, (AON) disclosed plans to shut down operations following the continuous increase in Aviation fuel.\nIn a statement by the airline, Ibom Air stated that it acknowledges the existential threat that these runaway fuel price increases pose for the air transport industry in Nigeria and agree that this out-of-control situation is simply unsustainable.\nRead also: Ibom Air to spend N138bn on 10 new A220 planes“Ibom Air has financial obligations to suppliers, financiers and staff, which depend on uninterrupted flow of revenue to service.\n“Apart from the above factors, Ibom Air is currently the only airline serving Akwa Ibom State directly and as such, any voluntary stoppage of operations would completely cut off access by air into and out of the State."
  },
  {
    "headline": "Okomu Did Not Block Community Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOkomu oil Palm Company Did Not Block the Road leading to the Community but dug a trench round its plantation to forestall theft of over ten tons of Banga daily.\nAccording to him, it was a peaceful protest to alert the management of the company that the trench blocked their road to the primary and secondary school, Catholic Church and other villages.\n“We have made several appeals to the government to assist us with electricity, roads, health centers and a secondary school” he added.\nThe DPO advised the protesting community to remain calm and go about their duties as law abiding citizens until the issues are resolved.\nThe Nigerian Observer gathered that the Enogie of Udo has also setup machineries in motion to resolve the issues at stake which he described as a breakdown in communication between the community and Okomu Oil Palm Company."
  },
  {
    "headline": "Edo NEWMAP urges media support in campaign to curb flooding, other environmental hazards – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Coordinator of Nigeria Erosion and Watershed Management Project (NEWMAP), Dr. Tom Obaseki, has canvassed for media collaboration in driving the conversation on flood control as the rains intensify.\nObaseki made the submission at a flood engagement workshop organised by the agency in Benin City, the Edo State capital.\nAccording to him, “The media has a crucial role in spreading information in bridging the knowledge gap and enhancing public awareness.\nThe media chooses which issues to highlight to its viewers and how to frame them, influencing what people perceive to be a priority.\n“We have built a total length of over 40kms of secondary drains."
  },
  {
    "headline": "Master Plan: Obaseki kicks off ‘Operation Plan Edo’ …exercise kicks off in Ugbor area – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced ‘Operation Plan Edo,’ an exercise aimed at recertifying building plans and collecting data on socio-economic needs of communities within the Benin metropolis.\nAccording to her, “The programme enables the government to know what services and infrastructure the people need.\nThe ‘Operation Plan Edo’ will involve various ministries, such as Education, Roads and Bridges, Health, Power, among others”.\nShe called on citizens to cooperate with officials of the ministries and provide necessary information to help plan the city and State in line with the 30-year master plan.\nCondemning attacks on its staff by residents, she warned: “Edo State Government frowns at the attack on Staff of Ministry of Planning, Urban and Regional Planning on duty."
  },
  {
    "headline": "2023: Edo PDP’ll obey party decisions, Obaseki assures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said the state’s chapter of the Peoples Democratic Party (PDP) will obey any decision reached by the party at the national level ahead of the presidential primary election as long as the decision is fair and just.\nHe said, “I believe that you know what the issues are in Nigeria today and have practically touched all of them.\nThere is nothing wrong when you throw your hat in the ring, and you’ve been quite clear and not ambiguous.\nThey also have the privilege to hear from you and know the decision to take when the time comes,” Obaseki noted.\nI know the country very well and the people of the country know me."
  },
  {
    "headline": "Kotu ta raba auren Saeed da Mujidat saboda tsananin korafi da suke wa juna",
    "summarized_story": ""
  },
  {
    "headline": "Sanata Uba Sani ya yi alhinin rasuwar mahaifin Kashim Bukar, ya yi ziyarar ta’aziyya da gaishe-gaishe",
    "summarized_story": ""
  },
  {
    "headline": "Masu kamfanonin jiragen sama sun yi barazanar dakatar da zirga-zirga daga ranar 9 Ga Mayu",
    "summarized_story": ""
  },
  {
    "headline": "MUGUN IRI: Birtaniya ta ce ba za ta bai wa tsagerun IPOB da MOSSOB mafakar siyasa ba",
    "summarized_story": ""
  },
  {
    "headline": "2023: ‘Ba za mu ƙara wa jam’iyyu wa’adin yin zaɓen fidda-gwani ba’ -INEC",
    "summarized_story": ""
  },
  {
    "headline": "2023: Group accuse Akeredolu, Sowore, others of ethnic bias for attacking Emefiele, leaving Adesina",
    "summarized_story": "A group, Ethnic Youth Leaders (EYL), has expressed reservations statements against Godwin Emefiele, governor of the Central Bank of Nigeria (CBN) by Governor Rotimi Akeredolu of Ondo State, constitutional lawyer, Prof. Itse Sagay as well as activist publisher, Omoyele Sowore, following his perceived 2023 presidential ambition.\nThe development has drawn attention, attracting a barrage of criticisms against the CBN Governor.\nSome of the critics, among those who are the Ondo and Sokoto State governors, have asked the financial expert to turn in his resignation letter as CBN Governor to concentrate on his political career.\n”They are calling for his resignation while also keeping mute on the purchase of the APC nomination form by the President of the African Development Bank, Akinwumi Adesina who holds a similar office.\n“This only amounts to ethnic attack against the CBN Governor, who is not their kinsman."
  },
  {
    "headline": "We’re temporarily suspending flights, not embarking on strike- Airline operators",
    "summarized_story": "Airline operators in Nigeria under the aegis of Airline Operators of Nigeria (AON), have said they were not embarking on strike as being speculated but a temporary suspension of operations to protest spiralling cost of jet fuel which has risen almost fourfold this year.\nThe body maintained that the decision to suspend operations was a collective sacrifice for the common interest of the country.\nWhile appealing for understanding from the air passengers, the association called out one of its members, Ibom Air, for not standing by the collective decision to suspend flight operations.\n“Airline operators are patriotic citizens and we are doing all we can to protect the flying public contrary to what some subjective schools of thought might suggest.\n“AON however regrets the unfortunate position taken by one of our members, Ibom Air, not to stand by the collective decision."
  },
  {
    "headline": "Airline operators vow to proceed with flights’ suspension as Ibom Air backs out",
    "summarized_story": "Airline operators in Nigeria have vowed to proceed with planned suspension of flights operations on Monday, as earlier stated on Friday.\nThis is despite the federal government’s plea for them to rescind the decision, and the decision by Ibom Air not to partake in the flight services withdrawal.\nIbom Air’s management announced on Saturday that the airline would not join in the proposed halt of domestic flight operations on Monday despite the exorbitant and unsustainable cost of aviation fuel.\nWhile the Chief Executive Officer of Ibom Air, Capt.\nIt said, “Ibom Air acknowledges the existential threat that these runaway fuel price increases pose for the air transport industry in Nigeria."
  },
  {
    "headline": "Nigeria’s fuel subsidy to hit N3.55tn in 2022 – Report",
    "summarized_story": "Nigeria’s federal government may incur N3.55trillion in petrol under-recovery cost, better known as subsidy in 2022, a report by Cordros Securities said at the weekend.\nRelying on the NNPC’s data, the report said the corporation incurred N245.77 billion as petrol under-recovery cost in March (February: N219.79 billion).\nIt further explained that the under-recovery cost for the review month consists of the previous months’ outstanding and part of the February 2022 value shortfall.\nAccordingly, average crude oil production (including condensates) settled at 1.56mb/d in Q1-22 (Q4-21: 1.51mb/d and Q1-21: 1.74mb/d).\n“Overall, we do not expect a significant improvement in crude oil production over the short term, given the nature of challenges hampering production."
  },
  {
    "headline": "We Now Enjoy Timely, Sustained Air, Maritime Support – COAS – Leadership News",
    "summarized_story": "The Chief of Army Staff, Lt.-Gen. Faruk Yahaya, says troops of the Nigerian Army are currently enjoying timely and sustained air and maritime supports in all their operations.\nYahaya said this at an interaction with participants of Army War College Course on Friday in Abuja.\nThe COAS said he intended to superintend over a Nigerian army that would have the flexibility, capacity and capability to operate under all conditions, in collaboration with other services and agencies.\nAccording to him, the Nigerian army is currently being positioned to conduct protracted land operations independently and jointly with other services, security agencies.\n“As a result, we now enjoy more timely and sustained air and maritime support operations across the country."
  },
  {
    "headline": "Federal Govt Approves Intervention Funds For Tertiary Institutions",
    "summarized_story": "The federal government has approved the 2022 intervention funds for public higher institutions across the country.\nThe executive secretary of Tertiary Education Trust Fund (TETFund), Arch.\nSunday Echono, made this known while receiving in his office, the Committee of Vice Chancellors of Nigerian Universities (CVCNU) in Abuja.\n“One of the problems off our education today is the quality of our graduates, particularly the quality of thesis.\n“We believe in anti-plagiarism device as you have developed will go a long way in dictating this and ensuring compliance."
  },
  {
    "headline": "Power Shift: Don’t Be Intimidated By Southern Candidate, NEF Tells Parties",
    "summarized_story": "Northern Elders Forum (NEF) has called on political parties that find northern presidential candidates deserving to fly their flags, and should not be intimidated by scare tactics that they would lose southern votes.\nNEF spokesman, Dr Hakeem Baba-Ahmed, disclosed this in a statement issued yesterday in Abuja, titled: “Threats from Southern Socio-Cultural Groups”The northern elders also appealed to Southern politicians seeking the support of Northern voters to assure them that they do not share the doomsday scenario being peddled by some leaders of Southern socio-cultural groups.\nBaba-Ahmed stated that the Northern Elders Forum had observed attempts to heighten tension by some Southern socio-cultural groups determined to stampede Nigerians into subverting the foundational principles of the democratic process.\n“NEF does not believe that these elders speak for serious aspirants and prospective southern candidates when they threaten even the survival of the country they aspire to lead unless they have their way,” he said.\n“Our Forum encourages all aspirants and candidates to fully participate in all their parties’ activities,” he said."
  },
  {
    "headline": "Power Shift: Don’t Be Intimidated By Southern Candidate, NEF Tells Parties",
    "summarized_story": "Northern Elders Forum (NEF) has called on political parties that find northern presidential candidates deserving to fly their flags, and should not be intimidated by scare tactics that they would lose southern votes.\nNEF spokesman, Dr Hakeem Baba-Ahmed, disclosed this in a statement issued yesterday in Abuja, titled: “Threats from Southern Socio-Cultural Groups”The northern elders also appealed to Southern politicians seeking the support of Northern voters to assure them that they do not share the doomsday scenario being peddled by some leaders of Southern socio-cultural groups.\nBaba-Ahmed stated that the Northern Elders Forum had observed attempts to heighten tension by some Southern socio-cultural groups determined to stampede Nigerians into subverting the foundational principles of the democratic process.\n“NEF does not believe that these elders speak for serious aspirants and prospective southern candidates when they threaten even the survival of the country they aspire to lead unless they have their way,” he said.\n“Our Forum encourages all aspirants and candidates to fully participate in all their parties’ activities,” he said."
  },
  {
    "headline": "Nigeria Media Needs Self-regulation – Prof Iredia – Leadership News",
    "summarized_story": "A former director-general of the Nigerian Television Authority (NTA), Prof Tonnie Iredia, has said self-regulation by the media in Nigeria would help eliminate government regulation and make the media more accountable to the public.\nHe also called for special constitutional backing to help protect the activities of journalists while carrying out their constitutional responsibilities.\nProf Iredia stated this in Abuja at the commemoration of the World Press Freedom Day with the theme: “Journalism Under Digital Siege”.\n“The public naturally accords ample respect to operatives who are known for adding value to society.”Speaking on the use of social media, Iredia called on journalists not to use the platform the way other citizens do.\nHe said there should be a difference between certified, trained journalists and citizens in terms of using social media."
  },
  {
    "headline": "Ganduje moves to calm APC wantaway Abdulmumin Jibrin",
    "summarized_story": "Kano State Governor Abdullahi Ganduje has ordered the resolution of the political crisis in the Kiru/Bebeji Federal constituency, that made Abdulmumin Jibrin announce his exit from the party.\nKano State APC Chairman, Abdullahi Abbas, in a statement, said Ganduje has ordered that the crisis be resolved.\nAbdulmumin Jibrin Kofa has already accepted the proposal and readiness to attend the meeting.\nJibrin, who is one of the coordinators of Tinubu’s campaign announced on Twitter Saturday his decision to leave the APC.\nI will announce my new political party within the next 24 hours insha Allah."
  },
  {
    "headline": "Olofu says Idoma to produce next Benue governor",
    "summarized_story": "By Nicholas DechiDr David Olofu, the Commissioner for Finance in Benue, says the Idoma nation has a good chance of producing a governor in 2023.\nAccording to him, the Idoma people although the second-largest tribe, have never produced a governor since the state was created in 1967.\nThere has never been a time the Idoma people were as united and sincere in their agitation like this.\n“Since 1999, this is the only time Idoma people unanimously produced one candidate for PDP primaries.\nThereafter, Olofu advised his Idoma kinsmen to heed the advice of Governor Samuel Ortom by continuing to lobby the Tiv stakeholders for a possible understanding before the primaries."
  },
  {
    "headline": "BREAKING: Coalition Picks N100m APC Nomination Forms For AfDB President, Adesina",
    "summarized_story": "This is as a coalition of 28 groups consisting of Youth Arise Movement, Nigerians in Diaspora One Nigeria Group, Prudent Youth Association of Nigeria, women groups, farmers, people with disabilities, and other civil society groups, raised the N100 million fee to purchase the forms for the former minister.\nThe coalition is led by the Head, of One Nigeria Group, Mohammed Saleh.\nThe payment acknowledgment slips exclusively seen by our correspondent on Saturday carried Adesina’s name as the recipient of the forms.\nMore to come…"
  },
  {
    "headline": "President Buhari’s Aide Reacts As Abdulmumin Jibrin Dumps APC",
    "summarized_story": "The personal assistant to President Muhammadu Buhari on new media, Bashir Ahmad has reacted after former lawmaker Abdulmumin Jibrin announced his decision to dump the All Progressives Congress (APC).\nThe reaction comes after Jibrin on Saturday announced that he has done his best for the APC and it’s time for him to move on.\nJibrin wrote on Twitter: “I have done my best for APC.\nI will announce my new political party within the next 24 hours insha Allah.\nI will make a formal statement in due course.”Reacting to the tweet, Ahmad wrote: “This is serious!”"
  },
  {
    "headline": "2023 Presidency: Taraba PDP Delegates Assures Governor Tambuwal of Bloc Votes",
    "summarized_story": "Leading Peoples Democratic Party [PDP] Presidential aspirant and governor of Sokoto state, Aminu Waziri Tambuwal, has been assured of delegate votes during the party’s May 28 presidential primary elections.\nThe Taraba state PDP chairman, Kefas Dantalab who stated this when Govenror Tambuwal visited the state on his Presidential campaign tour said “Taraba is Tambuwal, Tambuwal is Taraba”.\nGovernor Tambuwal who was received at the Taraba state government House by Governor Ishaku Darius; the state deputy governor Haruna Manu, Speaker of the state House of assembly Rt Hon.\nJoseph Albasuk; Taraba State PDP chairman Hon Kefas Dantalab, members of the State executive council as well as members of the state House of assembly said he’s the leader that is accepted by all regions and sectors of Nigeria.\nHe further spoke on governor Tambuwal’s humity which he said he witnessed first hand while the governor was speaker of the House of Representatives."
  },
  {
    "headline": "JUST IN: Tinubu Campaign DG Jibrin Dumps APC, To Announce New Party In 24Hrs",
    "summarized_story": "The National Leader of the All Progressives Congress, APC, Bola Ahmed Tinubu’s campaign Director-General, AbdulMumin Jibrin, has dumped the party.\nReport has it that Jibrin announced this on his official Twitter page.\nHe Said, “I have done my best for APC.\nI will announce my new political party within the next 24 hours, Insha Allah.\nI will make a formal statement in due course.”More to come…"
  },
  {
    "headline": "Breaking: Ahead party presidential primaries, Tinubu’s campaign DG dumps APC",
    "summarized_story": "A former member of the House of Representatives and Director-General of a group campaigning for the presidential ambition of Bola Tinubu, Abdulmumin Jibrin, has defected from the All Progressives Congress (APC).\nJibrin who disclosed this on Saturday via his official Twitter handle, said his new political party would be made known soon.\nHe tweeted, “I have done my best for APC.\nI will announce my new political party within the next 24 hours insha Allah.\nI will make a formal statement in due course.”Details loading…Share this: TwitterFacebook"
  },
  {
    "headline": "Breaking: Premier League club with 5 Super Eagles’ players relegated",
    "summarized_story": "Watford have been relegated from the Premier League after Wilfried Zaha’s first-half penalty secured a deserved victory for Crystal Palace at Selhurst Park.\nNigeria’s Super Eagles vice captain William Troost Ekong plays for Watford.\nFour other Super Eagles players including Oghenekaro Etebo, Samuel Kalu, Maduka Okoye and Bonaventure Dennis are part of Watford squad.\nIt is the second time Watford have dropped out of the top flight in the past three seasons.\nThe manager-less Hornets also went went down on the final day of the 2019-20 campaign before securing an immediate return under Xisco Munoz."
  },
  {
    "headline": "Breaking: At last, CBN governor, Emefiele, opens up on 2023 presidency",
    "summarized_story": "Hours after Nigerians poured out reactions on the purchase of his All Progressives Congress (APC) presidential forms ahead of 2023 general elections, Central Bank of Nigeria (CBN) Governor Godwin Emefiele has outrightly rejected the offers made by farmers in the country.\nCategorically, the CBN Boss said he has not taken a stance on 2023 Presidency.\nEmefiele who spoke via his Twitter handle on Saturday though thanked the farmers for their concern, said if he decides to contest, he would use his personal resources.\nI note and salute the sacrifices of those farmers and patriots going as far as raising personal funds and offering me Presidential Nomination Forms: I thank them most profusely.\nThis is a serious decision that requires God’s Divine intervention: in the next few days The Almighty will so direct.”Share this: TwitterFacebook"
  },
  {
    "headline": "Naira weakens against dollar, exchanges at N419",
    "summarized_story": "Agency reportNaira on Thursday depreciated at the Investors and Exporters window exchanging at N419 to the dollar, 0.24 percent depreciation, weaker than N418 it traded on Wednesday.\nThe open indicative rate closed at N417.40 to the dollar on Thursday.\nAn exchange rate of N444 to the dollar was the highest rate recorded within the day’s trading before it settled at N419.00.\nThe Naira sold for as low as 410 to the dollar within the day are trading.\nA total of 108.24 million dollars was traded in foreign exchange at the official Investors and Exporters window on Thursday."
  },
  {
    "headline": "Oil price tops $108 a barrel ahead of OPEC+ meeting",
    "summarized_story": "Agency reportOil prices rose on Wednesday ahead of the periodic meeting of the Organisation of Petroleum Exporting Countries (OPEC) and its allies.\nBrent crude futures, the global oil benchmark, climbed 3.35 per cent to $108.25 a barrel at 10.20 GMT+1 — the first time since April 29.\nOn Wednesday, Ursula von der Leyen, president of the European Commission, announced that European Union countries would stop importing Russian oil in the next six months.\nThe ban on Russian oil is expected to have a ripple effect on the EU’s energy supply chain.\nAlready, the United States placed a ban on Russian oil imports, and the UK said it would follow suit by the end of the year."
  },
  {
    "headline": "GSM calls, data: Nigerians to pay more",
    "summarized_story": "Based on their proposal, the price floor of calls will increase from N6.4 to N8.95 while the price cap of SMS will increase from N4 to N5.61.\nThis was revealed in a letter titled, ‘Impact of the Economic and Security Issues on the Telecommunications Sector,’ which was sighted by our correspondent.\nThe letter was written by the telecommunications companies under the aegis of the Association of Licensed Telecommunication Operators of Nigeria, ALTCON, to the NCC.\nIn the letter, the telecom companies said there had been a 40 per cent increase in the cost of doing business in the nation.\nThey said this had resulted in an increase in energy costs, increasing their operating expenses by 35 per cent."
  },
  {
    "headline": "Govt, commercial users to pay for using Twitter – Elon Musk",
    "summarized_story": "By Emmanuel ObisueOn the heels of his acquisition of Twitter, billionaire entrepreneur, Elon Musk, on Wednesday said governments and other commercial users may have to pay to use the micro-blogging platform.\nAfter his $44 billion purchase of Twitter, Musk has now hinted that Buhari and other users may have to pay for using the platform.\nConfirming fears by the majority that his takeover might lead to commercialisation of the social media platform, Musk in a tweet in the early hours of Wednesday, said commercial and government users will pay for the platform.\n“Twitter will always be free for casual users, but maybe a slight cost for commercial/government users.\n“Twitter will always be free for casual users, but maybe a slight cost for commercial/government users,” he tweeted."
  },
  {
    "headline": "Naira slides to N589 to $1 at parallel market as FX liquidity crisis persists",
    "summarized_story": "By Agency reportThe free fall of Nigerian naira continued on Wednesday, dropping to N589 against the dollar at the parallel market.\nCurrency traders known as Bureaux De Change operators (BDCs) said that the forex liquidity crisis still persists in the market despite low demands.\nA parallel market (street market) is characterised by noncompliant behaviour with an institutional set of rules.\nThe Central Bank of Nigeria (CBN) has often maintained that the parallel market is not the true reflection of the naira.\nIt may increase the cost of foreign borrowing, force foreign investors to pull out their funds, causing further depreciation of the naira."
  },
  {
    "headline": "Airlines Operators Not Backing Down On Decision To Shutdown Services",
    "summarized_story": "The Airline Operators of Nigeria (AON) on Sunday said they are not backing down on its decision to suspend operations in response to the astronomic and continuously rising cost of JetA1 despite various interventions in the last 24 hours.\nIn a statement jointly signed by Shehu Wada – Executive Director, Max Air, Dr. Obiora Okonkwo – Chairman, United Nigeria Airlines, Barr.\nREAD ALSO: Airlines Threaten To Shutdown Services On Monday Over Price Of Jet FuelAlthough Ibom Airlines in a statement released on Saturday said it will not join the planned shutdown of flights announced by the Airlines Operators of Nigeria (AON), Ibom Airlines said obligations to its customers, suppliers and staff, would not allow it to participate in the shutdown.\nAON, in its response, however, “regrets the unfortunate position taken by one of our members, Ibom Air, not to stand by the collective decision.\nThe Airline Operators called for calm while trying to find a lasting solution to the crisis."
  },
  {
    "headline": "Bandits Kill 48 In Fresh Zamfara Attacks",
    "summarized_story": "They reportedly killed nine people and then proceeded to Damri community where they killed four persons including a Police officer and personnel of Nigeria Security and Civil Defence Corps (NSCDC).\nREAD ALSO: Police Arrest Notorious Gang Leader In ZamfaraThe outlaws also set ablaze a Hilux vehicle belonging to the Nigerian Police.\nThe bandits then killed eight persons in Kalahe community, a village between Sabon Gari Damri and Damri townAccording to Suleiman, the bandits attacked a healthcare facility in Damri town and killed some patients who were receiving treatment in the hospital.\n“The bandits in their large number were on motorcycles with three persons on each motorcycle first attacked Sabon Gari Damri and killed four people,” he said.\n“Military personnels entered the town and exchange fire and forced the bandits to move back to Sabon Gari Damri, after killing nine people at the village, they went back and killed about twenty-one people.”Suleiman confirmed that a total of 48 people were killed during the attacks."
  },
  {
    "headline": "Ibom Airlines Rejects Monday Shutdown, To Continue Operations",
    "summarized_story": "Ibom Airlines says it will not join the planned shutdown of flights announced by the Airlines Operators of Nigeria (AON).\nThe AON had on Friday said its members would suspend flight services on Monday due to the unbearable high cost of aviation fuel (JetA1) and other associated costs.\nBut in a statement, Ibom Airlines said obligations to its customers, suppliers and staff, would not allow it participate in the shutdown.\nREAD ALSO: ‘Consider The Multiplier Effects’, FG Appeals To Airline Operators Over Monday Shutdown“Apart from the above factors, Ibom Air is currently the only airline serving Akwa Ibom State directly and as such, any voluntary stoppage of operations would completely cut off access by air into and out of the State,” the statement added.\nMeanwhille, the Minority Caucus in the House of Representatives has called on President Muhammadu Buhari to intervene and avert the imminent shutdown which, it believes, will cripple the nation’s economy."
  },
  {
    "headline": "Coalition Purchases APC Presidential Forms For Akinwumi Adesina",
    "summarized_story": "A coalition of 28 groups have purchased the All Progressives Congress’ presidential forms for the President of the African Development Bank and former minister of Agriculture, Dr Akiwumi Adesina.\nThe coalition consists of groups such as Youth Arise Movement, Nigerians in Diaspora, One Nigeria Group, Prudent Youth Association of Nigeria, women groups, farmers, and other civil society groups.\nREAD ALSO: Akeredolu Asks CBN Governor To Resign Over Presidential AmbitionDr Adesina has not publicly signaled his intention to run for President.\nOn Friday, some supporters also picked up APC presidential forms for Governor of the Central Bank, Godwin Emefiele.\nMr Emefiele has since rejected the forms, saying he has not decided to run for President."
  },
  {
    "headline": "PDP Calls For Emefiele’s Probe, Arrest Over N100m APC Presidential Form",
    "summarized_story": "The Peoples Democratic Party (PDP) has called for the probe, arrest and prosecution of the Central Bank of Nigeria (CBN) Governor, Godwin Emefiele, over the purchase of the N100m presidential form.\nHis continued stay as CBN Governor will further destroy investors’ confidence in the integrity of our nation’s financial regulatory Institution.\nEmefiele’s involvement in partisan politics while still holding office as CBN Governor underpins the impunity, lawlessness and recklessness of the Muhammadu Buhari-led APC administration.\nIt further confirms that the CBN under Emefiele has all along been the finance department of the APC.\nThe N100 million form was picked up on behalf of the CBN Governor by a group of supporters from the party’s organising secretary at the International Conference Centre (ICC) in Abuja, on Friday morning."
  },
  {
    "headline": "Asiwaju Tinubu Intervenes in Kano APC Dispute -",
    "summarized_story": "All Progressives Congress National Leader, Asiwaju Bola Tinubu, has stepped in to resolve the local political squabbles between Abdulmunin Jibrin and key stakeholders in his constituency in Kano State.\nAbdulmumin Jibrin had announced his decision to leave the Kano State Chapter of the APC for an undisclosed party early on Saturday.\nThere had been a crisis of confidence between Jibrin and Kano State Governor, Abdullahi Ganduje, for some time over local political issues.\nAsiwaju Tinubu reportedly reached out to Governor Ganduje to reach a truce and ensure the unity withion the Kano State Chapter of the APC is not ruptured.\nThe source said Asiwaju Tinubu has already intervened on Jibrin’s behalf with Governor Ganduje and everything will be resolved."
  },
  {
    "headline": "Interest Groups obtain APC Nomination Forms for AfDB President, Adesina -",
    "summarized_story": "The President of the African Development Bank and former minister of Agriculture, Dr Akinwumi Adesina has picked up the N100m Expression of Interest and Nomination form for the 2023 presidential election.\nA coalition of 28 groups, led by the Head of One Nigeria Group, Mohammed Saleh, raised the fee to purchase the form for Adesina.\nThey include; Youth Arise Movement, Nigerians in Diaspora One Nigeria Group, Prudent Youth Association of Nigeria, women groups, farmers, people with disabilities and other civil society groups.\nThe former Minister joinsa crowded group of aspirants that have obtained the nomination form.\nSome of those who have obtained the forms are Vice-President Yemi Osinbajo, APC National Leader, Bola Tinubu, the Minister of State for Education, Emeka Nwajuiba; Pastor Tunde Bakare; Jigawa Governor, Mohammed Badaru."
  },
  {
    "headline": "I have not made any decision on Presidential Contest",
    "summarized_story": "Mr Emefiele disclosed this in a statement he issued on his verified twitter handle and personally signed by him.\nSee full statement belowI am humbled by the growing interest of those asking that I run for the Office of President in the 2023 general elections: I have not come to that decision.\nI note and salute the sacrifices of those farmers and patriots going as far as raising personal funds 1/4and offering me Presidential Nomination Forms: I thank them most profusely.\nAnd should I not run for elected office, 3/4I will continue to serve and sacrifice for the good people of Nigeria under the able leadership of President Muhammadu Buhari.\nThis is a serious decision that requires God’s Divine intervention: in the next few days The Almighty will so direct."
  },
  {
    "headline": "Returning Presidency to the North in 2023 evil, undemocratic",
    "summarized_story": "The Campaign for Democracy, CD said it is evil, undemocratic and unjust, if presidency is allowed to go back to the North.\nCD in a statement issued by its General Secretary, Ifeanyi Odili, said any attempt for the north to take over power again may lead to disintegration.\nThe group said It is a conspiracy against the South by the North for the two major parties, PDP and APC to project fielding Northern candidates in 2023.\n“It is evil, undemocratic and unjust if we fold our hands and allow presidency to go back to the North.\nIt is a conspiracy against the South by the North for the two major parties, PDP and APC to project Northern candidates in 2023″."
  },
  {
    "headline": "Nigeria: Presidential Aspirant Tinubu’s Support Group DG Quits APC",
    "summarized_story": "The Director-General of Tinubu Support Groups Management Council, Abdulmumin Jibrin, has dumped the ruling All Progressives Congress (APC).\nJibrin, a former House of Representatives member from Kiru/Bebeji in Kano State, announced his decision via his verified Facebook account.\nHe was expected to throw his hat into the ring again for the representation of his federal constituency even though the incumbent is also of the APC.\nJibrin said he would soon announce his next political party.\nI will announce my new political party within the next 24 hours Insha Allah."
  },
  {
    "headline": "Nigeria: I Have Courage to Fight Principalities Holding Nigeria Back, Says Presidential Hopeful and Governors’ Chairman Fayemi – Arise News",
    "summarized_story": "Fayemi has also disclosed that Nigeria “is at war,” and recommended counter-insurgency and counter-terrorism measures that would go beyond infantry and other approaches to warfare.\nResponding to a myriad of challenges facing the country, Fayemi identified impunity as a very serious issue, that the commitment, compassion, and competence of a leader alone would not address.\nFayemi said what “is lacking in Nigeria is the leadership and courage to do that what is right.\nSome people consider themselves as principalities and people who believe that they are the owners of this country.\n“I think swift delivery of justice, access to justice, and accountability in society are areas we need to pay attention to."
  },
  {
    "headline": "UBA Chairman Elumelu Challenges US to Shift Emphasis from Aid to Empowering Africa’s Youth",
    "summarized_story": "One of Africa’s leading investors and philanthropists, Mr Tony Elumelu has challenged the United States to shift emphasis from providing aid to governments in Africa to supporting institutions that help empower a burgeoning population of youths through businesses and job creation.\nElumelu, who is the Chairman of United Bank for Africa Plc and Founder of the Tony Elumelu Foundation (TEF), has also identified a strong private sector as a critical driver of peace, stability, and development on the continent.\nHe explained that the tech giant “has committed a team to expand the training capacity of the Tony Elumelu Foundation’s digital network, which already includes about a million active and aspiring entrepreneurs.\nYet, this young African is connected to the rest of the world.\n“In 2005, I led one of the largest bank mergers in sub-Saharan Africa, buying the United Bank for Africa, where I remain chairman."
  },
  {
    "headline": "Nigeria: NCC Rejects Telecoms Operators’ Request for Tariff Increase",
    "summarized_story": "The Nigerian Communications Commission (NCC) has rejected the request by telecom operators for an upward review of tariff, saying that any such decision must be fair to the subscribers and engender healthy competition among services providersa.\nIt however added that “while there could be justifiable reasons for MNOs’ demand for tariff increase, it should be noted that they are not allowed to do such either individually or collectively without recourse to NCC, following the outcome of a cost study.\n“Through NCC’s commitment to engendering healthy competition among the licensees, the cost of services has been democratised and become more and more affordable for Nigerian subscribers.\nThe regulator is even more committed to this cause to ensure subscribers get greater value for money spent on telecom services.”Last week, ALTON wrote a letter to the NCC, the telecoms industry regulator, calling for an upward review of the cost of telecoms services.\nThe operators said the move to increase the cost of telecom services became necessary due to the high cost of delivering telecoms services across networks, coupled with the harsh business environment and the continuous rise in the cost of various items in various sectors of the Nigeria economy."
  },
  {
    "headline": "Nigeria Moves to Avert Shutdown of Operations by Airlines on May 9",
    "summarized_story": "Also, the House of Representatives through its Committee on Aviation has appealed to the airlines to suspend the plan to ground their operations.\nThe airlines said that the situation had made the unit cost per seat for a one hour flight in Nigeria an average of N120,000.\nMeanwhile, the House of Representatives through its House Committee on Aviation has appealed to the airlines to suspend the plan to ground their operations.\nFemi Gbajabiamila was greatly disturbed by the reoccurring aviation fuel crisis in the country.\nWe believe that despite the escalating fuel prices, airlines volunteering to stop operations would rather exacerbate an already bad situation."
  }
]