[
  {
    "headline": "[BREAKING] Bail: Igboho’s associates to know fate today",
    "summarized_story": "The lawyer to the detained aides, Pelumi Olajengbesi, had prayed the court to admit the Igboho aides to bail.\nHowever, he vehemently opposed the bail of the other four applicants on the ground that the DSS’ investigation has revealed their high complicity in the offence of arms’ stockpiling.\nThe DSS lawyer argued that the four aides should not be granted bail in the interest of justice and national security.\nThe lawyer to Igboho aides, Olajengbesi, prayed the court to discountenance the argument of the DSS as it was unknown to Nigerian law.\nOlajengbesi urged the court to release the Igboho’s aides on bail and assured the court that the applicants would be available for further investigations."
  },
  {
    "headline": "Abducted students: Education minister begs bandits on national TV",
    "summarized_story": "The Minister of State for Education, Chukwuemeka Nwajiuba, has appealed to bandits terrorising the country with seemingly unending abductions of students to leave schools in the country alone.\nHe was reacting to the reported release of three more abducted students of the Bethel Baptist High School in Kaduna State.\nThe students were abducted by daredevil bandits on July 5, 2021 around 2am on the school premises along the Kaduna-Kachia Expressway, Damishi, Chikun Local Government Area of Kaduna.\nThe first batch of 28 of the students had spent 20 days in the kidnappers’ den before their recent release.\nAccording to the bill, Nigerians who pay ransom to kidnappers and kidnappers who receive ransom risk 15 years imprisonment."
  },
  {
    "headline": "Nigeria’s interior design industry needs its Ladipo market, for collective efficiency – Tomi Bamgbelu",
    "summarized_story": "Compared to developed countries and the likes of South Africa on the continent skilled in interior design, Nigeria has a long way to go.\nThese developments will significantly improve the interior design industry, create job opportunities, attract FDI via exports to other countries, and improve the nation’s economy.\nWhat are some of the challenges facing Nigeria’s interior design industry?\nThe biggest challenge is probably the vulnerability of the manufacturing industry and its correlatedness with the interior industry.\nNigeria’s design industry needs such a cluster, that improves collective efficiency, allows them trade within themselves, and make the right investments to move the industry forward."
  },
  {
    "headline": "Breaking: Court bars Finance Minister, others from slashing salaries of medical doctors in academics",
    "summarized_story": "The National Industrial Court sitting in Abuja has restrained the Minister of Finance, Mrs Zainab Ahmed, from reviewing downward the salaries and allowances of members of Association of Specialist Medical Doctors in Academics (ASMEDA).\nThe Defendants are the National Salaries, Incomes and Wages Commission; Accountant-General of the Federation and Minister of Finance to court as 1st to 3rd defendants respectively.\nJustice Obaseki-Osaghae restrained all the defendants from acting on the contents of the April 22, letter issued by the salaries commission, pending the determination of the suit.\nNAN reports that in a motion on notice marked: NICN/ABJ/145/2021 dated July 8 and filed July 12 by Agba, the applicants sought some claims against the defendants.\nThe claimants averred that since the latest directive took effect, their take-home pay had reduced drastically by about 60 per cent."
  },
  {
    "headline": "MRA rejects proposed DSS probe of attack on Journalist, calls for independent investigation",
    "summarized_story": "DSS officials assault Vanguard PhotojournalistMedia Rights Agenda (MRA) said today that it has no confidence in the proposed investigation by the Department of State Services (DSS) into the reported assault on Vanguard newspaper photojournalist, Oluwagbemiga Olamikan, by officials of the agency, describing it as an exercise in futility which can have no credibility.\nIt called for a serious, independent and impartial investigation into this and other attacks against journalists.\nShe described the proposed investigation as an exercise in futility that is merely designed to whitewash the incident which has serious implications for Nigeria’s international treaty obligations to ensure the safety of journalists as well as to investigate, prosecute and punish perpetrators of attacks against journalists.\nShe said it is only by so doing that the Government can begin to address the culture of impunity that has festered in the country, especially in cases of crimes against journalists and other media practitioners, for which no single person has ever been prosecuted in Nigeria.\nVanguard News Nigeria"
  },
  {
    "headline": "Leadership rotation, inclusiveness, key to peace and harmony in Igbo communities—Igbo leaders",
    "summarized_story": "Some people are saying that certain sections or zones lack competent hands to occupy leadership positions, but this is not true.\nBut these days, what obtains is the opposite and it has been causing a lot of conflicts in community leadership in Igbo land.\nSo for me, it will be a beautiful thing if Igbo communities make rotation of leadership positions a constitutional matter,” Eze Ogba suggested.\nSuggesting the way forward out of Igbo community leadership crisis, a legal practitioner, Mr. Ugwoke Stephen pinned the root of the problem of Igbo leadership crisis on disobedience to constituted authorities and unwritten rule of law.\nThe legal practitioner condemned the issue of god-fatherism, imposition of candidates and election rigging among others in Igbo community leadership processes."
  },
  {
    "headline": "FG moves to halt smuggling of stolen vehicles into Nigeria",
    "summarized_story": "By Bashir BelloFederal Government on Tuesday said it has introduced a system of National Vehicle Registry, VREG, to tackle smuggling and dumping of stolen vehicles into the country.\nThe Minister of Finance, Budget and National Planning, Dr. Zainab Shamsuna Ahmed made this known while declaring open a one day zonal sensitization programme on the system, VREG for stakeholders in Kano.\nAhmed represented by her Director, Technical Services, Hajia Fatima Hayatu said Nigeria has been a hub of stolen vehicles as most Vehicle Identification Number (VIM) in the country were unregistered rendering the vehicles difficult to trace hence the need to introduce the system.\nWhile an additional 40% of vehicles are smuggled into the country annually, thus evading duty payment of which 22% of these vehicles are stolen vehicles.\nIt was further revealed that Nigeria was hub of stolen vehicles as Vehicle Identification Number (VIM) of vehicles in the country were unregistered, consequently, vehicles within the shores of Nigeria cannot be traced."
  },
  {
    "headline": "I started limping after I had COVID-19 – Hon. Adebutu",
    "summarized_story": "A former member of the House of Representatives, Hon Ladi Adebutu, has recalled how his leg was affected by the deadly COVID-19.\nThe former lawmaker said this while addressing members of the Peoples Democratic Party (PDP) in Abeokuta, the Ogun State capital, on Wednesday.\nAccording to Adebutu, many people do not pay attention to COVID-19 protocols because they do not believe it exists.\nI started limping because of COVID-19.\nDAILY POST reports that about 57 persons have been killed by coronavirus in Ogun State so far."
  },
  {
    "headline": "Sunday Igboho’s aides: DSS relaxes restriction on media coverage as anxiety mounts on bail ruling",
    "summarized_story": "Operatives of the Department of the State Service, DSS, on Monday in Abuja relaxed security on the media coverage of the detained aides of the Yoruba secessionist leader, Sunday Igboho.\nUnlike previous proceedings, the coverage of today’s proceedings by the media was done in a peaceful and friendly manner.\nDAILY POST observed that the leader of the operatives whose name could not be ascertained demonstrated maturity and high level of understanding that made the coverage hitch-free.\nHeavily armed operatives at the entrance to the courtroom we’re seen allowing media men accessing the courtroom upon identification by their leadership.\nAt the time of this report, Justice Obiora Egwuatu is being awaited for his ruling on the bail application."
  },
  {
    "headline": "Abba Kyari deletes Facebook post defending his relationship with Hushpuppi",
    "summarized_story": "The embattled Deputy Commissioner of Police, DCP, Abba Kyari, has deleted his Facebook post explaining his interaction with arrested international cybercriminal, Ramon Abbas, popularly known as Hushpuppi.\nDAILY POST observed that Kyari pulled down the post amid the controversy surrounding his relationship with Hushpuppi.\nIn the United States, a court had accused Hushpuppi of bribing Kyari to jail an errant cyber-criminal.\nIn a post on his verified Facebook page, the former IRT boss had explained that Hushpuppi had called his office complaining of a threat to his life.\nHowever, when DAILY POST perused through the same verified Facebook page, the statement was no longer there on Wednesday."
  },
  {
    "headline": "Flood sacks residents, destroys businesses in Osogbo [PHOTOS]",
    "summarized_story": "Property worth millions of Naira were destroyed by a heavy downpour in different parts of Osogbo, the state capital of Osun State on Tuesday.\nBusinesses dealing in cement, flour, pharmacy, Gas stations, bakeries, boutiques and provisions stores were affected including churches.\nA shop owner at the Onireke area, Ishola Mutiu who sells electronics said the rain started around 8 pm.\n“I was in my shop when the rain started but I didn’t know it was going to be like this.\nWhile estimating his loss, Mutiu said items destroyed in his shop were worth around N5 million."
  },
  {
    "headline": "Gunmen kill 68 persons, burn 63 houses, destroy farmlands in Kaduna communities",
    "summarized_story": "Suspected gunmen attacked four communities in Kauru Local Government Area of Kaduna State, killing 68 people, set 63 houses ablaze, while 68 hectares of farm land were destroyed.\nThe killings and destructions took place in Ungwan Magaji, Kishicho, Kigam and Kikoba villages of Kauru LGA.\nHe said those killed in Urgwan Magaji are: “Timothy Auta, Dauda Gabi, Larai Danladi, Johnny Danladi, Chibi Chiwo, Monday Titus, Altine Maza, Dauda Bala“Houses burnt:52.\n”Six killed, houses, others destroyed in Southern Kaduna fresh attackHe mentioned the number of people killed in KIgam village to include: “Asabe Magani”Gani James”Adamu Kusa”Matthew IshayaAlso, those killed in Kigoba are; ” Adamu Kambari, Musa Kambari, Monday Adamu, Mary Adamu, Laraba Adamu, Asabe Musa.\nKaduna State Govenor, Mallam Nasir ERufai, while reacting to the killings, condoled the families of those killed in the attack, prayed for the repose of the victims’ soul."
  },
  {
    "headline": "BBNaija: Stay away from Jackie B – Jay Paul warns Boma",
    "summarized_story": "Big Brother Naija, BBNaija housemate, Jay Paul has told Boma to stay away from Jackie B.Jay Paul told Boma he’s interested in Jackie and would want him to step back from her.\nAccording to him, he would not want to compete for Jackie B with him.\nJay Paul said: “It is Jackie B I want, I don’t want to compete with you so just step back for me.”Boma responding, told Jay Paul he’s on his own on that as he intends to be with any girl he likes.\nRecall that Boma chose Jackie B to be the deputy head of house after he won Head of house game.\nJackie B is a 29-year-old single mum with a son."
  },
  {
    "headline": "BBNaija Shine Ya Eye: Beatrice irritates me - Boma",
    "summarized_story": "Big Brother Naija Shine Ya Eye season 6 housemate, Boma, has revealed that Beatrice irritates him.\nBoma accused Beatrice of confusing the housemates and making them fail to detect the Wildcard on Sunday.\nDuring her Diary Session earlier, Beatrice had told Big Brother that Boma was being harsh towards her and she really felt bad about it.\nA tweep, @kgotso50, said,” I’ll never forget how Boma said Beatrice irritates him.\nHe shouldn’t, regardless of the situation, talk about her the way he’s doing."
  },
  {
    "headline": "13-year-old Sky Brown becomes Britain's youngest Olympic medalist",
    "summarized_story": "Sky Brown, a 13-year-old skateboarder, has made history by becoming Team Great Britain’s youngest-ever medallist at the summer Olympic Games,The British skater landing bronze in skateboarding behind Japanese duo, Kokona Hiraki (silver) and Sakura Yosozumi (gold).\nUK Metro reports that Brown was outside the medal spots before her third and final run at Ariake Skate Park but produced a cool, calm and collected performance to drag herself onto the podium.\nShe claimed Britain’s first medal in skateboarding and at 13 years and 23 days became the youngest British Olympic medal winner.\nBrown became Britain’s youngest summer Olympian eclipsing Margery Hinton’s longstanding record of 13 years and 43 days when she competed in swimming in the 1928 Games."
  },
  {
    "headline": "Messi to sign new Barcelona contract this week",
    "summarized_story": "Lionel Messi is expected to sign his new Barcelona contract later this week and could mark his new era at the club at the Joan Gamper Trophy match on Sunday.\nMessi is set to return from his post-Copa America holiday but it is not clear whether he will be ready to play in the pre-season game against Juventus, having yet to train and still not technically employed by the club.\nHowever, the intention is for him to be present at the game at the Johan Cruyff Stadium at Barca’s training ground, where he could also give the traditional pre-season speech as captain.\nAnd it means Messi, who remains a free agent after his previous deal expired on July 1, can be officially announced as a Barca player again before the weekend.\nBarcelona were struggling to reduce their wage bill in line with La Liga’s financial fair play rules for this coming season, and have been in talks with vice-captains Gerard Pique, Sergio Busquets and Sergi Roberto about reducing their salaries by 40 per cent in return for contract extensions."
  },
  {
    "headline": "After graduating with first-class in mathematics, Nigerian man bags PhD scholarship in US",
    "summarized_story": "A Nigerian man identified as Olusola Dehinsilu who graduated with a first-class in mathematics has secured a Ph.D scholarship in the United States.\nThe mathematics graduate from Olabisi Onabanjo University shared his academic journey on his LinkedIn page, where he disclosed that he will be studying at the University of Texas in Arlington.\nOlusola was an assistant lecturer at The Polytechnic Ibadan during his National Youth Service Corps (NYSC).\n“And I also enrolled for my Masters of Science in Mathematics @ Olabisi Onabanjo University, which I graduated in 2021.”However, the PhD scholarship didn’t come on a platter of gold as there were many rejections since 2018.\n“After so many rejections since year 2018, I wish to now congratulate myself on this great feat, as I successfully become a University of Texas Arlington Mathematics PhD scholar."
  },
  {
    "headline": "High Court restrains DSS, AGF from arresting Igboho",
    "summarized_story": "By Chinelo ObogoAn Oyo State High court has granted an ex-parte motion restraining the Department of State Services(DSS) and Attorney General of the Federation (AGF) from arresting, intimidating or freezing any bank account belonging to Sunday Adeyemo, also known as Sunday Igboho.\nJustice Ladiean Akintola gave the order following an ex-parte motion moved by Igboho’s lawyer Yomi Aliu (SAN) at the court on Wednesday.\nAbout three weeks after he was declared wanted by the Department of State Security (DSS), the Benin Republic Police arrested Sunday Adeyemo, also known as Sunday Igboho last month.\nEarlier in June, DSS operatives invaded Igboho’s house, located in Soka, Ibadan, capital of Oyo State around 1:00 a.m. Two of his vehicles and some valuable properties were destroyed in the process.\nThe DSS also admitted that two of Igboho’s men were killed in the process while a security agent was shot on the right hand."
  },
  {
    "headline": "Supreme Court ruling: APC may dissolve Buni’s committee",
    "summarized_story": "From Adetutu Folasade-Koyi, AbujaAgainst the backdrop of the July 28, 2021 minority ruling of the Supreme Court on the legitimacy of the Governor Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee (CECPC), the National Caucus of the All Progressives Congress (APC) may soon meet to dissolve the panel.\nThe Supreme Court had dismissed a case brought by the candidate of the Peoples Democratic Party (PDP), Eyitayo Jegede, against Akeredolu’s election.\nRegardless, a party chieftain at the APC national secretariat insisted that Buni’s committee was validly constituted.\nIn the aftermath of the dissenting judgment of the Supreme Court, a presidential committee was set up, with legal experts in government, to assess the implication of the ruling on the ruling party.\n“The Supreme Court judgement has exposed the underbelly of the APC."
  },
  {
    "headline": "Implosion imminent in PDP as crisis gets messier",
    "summarized_story": "They include Diran Odeyemi, deputy national publicity secretary; Ahmed Bello, deputy national legal adviser; Umoru Hadizat, deputy national women leader; Divine Amina Arong, deputy national auditor; Hassan Yakubu, deputy national organizing secretary; and Irona Alphonsus, deputy national financial secretary.\nHe called on PDP governors and other leaders to rise up and rescue the party.\nThere is a sharp division in our NWC right now; not only me, many more NWC members are more aggrieved than myself.\nRight now, I can tell you that not less than eight to ten persons within the NWC members are very aggrieved.\nIt was gathered that the Sokoto Governor, Aminu Tambuwal, who is chairman of the PDP governors is calling for caution."
  },
  {
    "headline": "Gunmen kill pregnant woman, 7 others, destroy farms in Enugu",
    "summarized_story": "From Fred Ezeh, AbujaSuspected armed herdsmen invaded Mgbuji community in Eha-Amufu, Isi-Uzo Local Government Area of Enugu State and killed eight people, injured others and kidnapped many, while farmlands were also destroyed.\nSome villagers told Daily Sun that the armed herdsmen invaded the community, on Sunday afternoon, through the border with Benue community and attacked several farm settlers and other unlucky people caught in the farm.\nThe community members alleged that the police asked them to sign an undertaking before they could release the corpses to the family members for burial.\nHe called on the Enugu government to take action on the armed herdsmen.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Why Okonkwo might win Anambra governorship –Agukwe",
    "summarized_story": "From Magnus Eze, EnuguTop Imo politician and former Commissioner for Information in the State, Chief Elvis Agukwe has predicted that business mogul and Chairman of United Nigeria Airlines, Dr Obiora Okonkwo might win the November 6 Anambra governorship poll.\nAccording to him, the Ogidi-born political economist who emerged second in the PDP primary election is a grassroots mobiliser with a knack for strategic planning.\nAgukwe said: “Politics is a series of concentric circles of conspiracies in which the last group that conspires emerges victorious.\n“Following the array of strong candidates from Anambra South and the crisis of choice of party candidates, he stands a better chance as people would be confused on whom to follow.\n“For coming second in PDP primary elections, it shows that he has strong followership base."
  },
  {
    "headline": "Breaking: Court Stops DSS from Arresting Igboho",
    "summarized_story": "By Kemi Olaitan in IbadanAn Ibadan High Court presided over by Justice Ladiran Akintola, Wednesday granted an order of interim injunction restraining the Departmen of State Services (DSS) and other security agencies from arresting, detaining, molesting or killing Yoruba Nation activist, Chief Sunday Adeyemo (aka Sunday Igboho).\nThe suit was filed by his counsel, Chief Yomi Aliyu, SAN.\nJustice Akintola while adjourning the case to August 18 for hearing of the originating motion, said the respondents must be served before the date.\nDetails later …Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Ahead of 2023, Nigeria’s Dominant Political Parties Battle Survival, Leadership Crises",
    "summarized_story": "Both parties are not only bogged down by leadership crises, but they are also plagued by seemingly intractable survival battles.\nThe suit marked FCT/HC/CV/1824/2021 and dated August 2, 2021, listed the APC and all members of the caretaker committee as defendants.\nLeading the defection train was the governor of Ebonyi State, Dave Umahi, followed by Cross River State Governor Ben Ayade, and, most recently, Zamfara State Governor Bello Matawalle, whose defection had also raised some constitutional concerns following the manner of his emergence as governor.\nThe party will look into the grievances raised by members of NEC as well as members of the National Working Committee.\nIt called on all members of the party and stakeholders to remain calm in the face of the developments."
  },
  {
    "headline": "Buhari Salutes Emefiele’s Patriotic Services at 60",
    "summarized_story": "Buhari appreciated the economist and banker for his patriotic service to the country at a time of difficult economic challenges.\nBuhari equally wished the CBN governor good health and greater service to fatherland.\n“As Mr. Godwin Emefiele celebrates his Diamond Jubilee, I wish him good health and more fruitful years.\nIt also established a health sector grant to promote research in the development of vaccines, among other policy measures.\nThe health sector facility has provided loans to pharmaceutical companies to expand and open drug-manufacturing plants in the country, and it has helped hospitals and healthcare practitioners to expand and build health facilities."
  },
  {
    "headline": "PDP Confirms Resignation of Seven Officials",
    "summarized_story": "By Chuks OkochaThe National Organising Secretary of the Peoples Democratic Party (PDP), Col. Austin Akobundu has confirmed the resignation of seven members of the National Working Committee (NWC) who resigned from their respective offices.\nAccording to the PDP constitution, THISDAY gathered, the seven deputies that resigned, are not entitled to attend meeting of the NWC.\nThey have been agitating that they should be allowed to attend the main NWC meeting as the information reaching them after NWC is secondary.\nThe seven national officers of PDP in their separate letters addressed to the National Secretary of the party, Senator Unaru Tsauri, on Tuesday, alleged being sidelined and unfairly treated by the National Chairman, Uche Secondus.\nAmong those who have tendered their letters of resignation are the Deputy National Financial Secretary, Deputy National Organising Secretary, Deputy National Legal Adviser, Deputy National Publicity Secretary, Deputy Woman Leader, and Deputy National Auditor."
  },
  {
    "headline": "Buhari Approves Deployment of Nine Permanent Secretaries",
    "summarized_story": "By Olawale AjimotokanPresident Muhammadu Buhari has approved the deployment of nine federal permanent secretaries to different ministries.\nThe new postings were communicated by the Head of Civil Service of the Federation, Dr. Folasade Yemi-Esan via a circular- HCSF/CMO/AOD/012/IX/59 dated August 3, 2021.\nAlso affected in the exercise were the four recently appointed Permanent Secretaries: Dr. Onwudiwe Maryanne Ngozi, Dr. Ogunbiyi Marcus Olaniyi, Yusuf Ibrahim Idris and Adebiyi Olusesan Olufunso.\nThey were deployed to Service Welfare Office, OHCSF; Career Management Office, OHCSF; Common Service Office, OHCSF and Federal Ministry of Women Affairs respectively.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "REVEALED: Hushpuppi: What Nigeria’s Suspended Police Officer, Kyari Told Inspector-General’s Investigation Panel On Tuesday",
    "summarized_story": "Suspended Deputy Commissioner of Police, Abba Kyari, who formerly headed the Intelligence Response Team, on Tuesday appeared before the Special Investigation Panel set up by the Inspector-General of Police, Usman Baba, and was grilled for several hours.\nKyari on his part is threatening that many senior officers benefited from his ‘generosity’ and if he’s betrayed, he would expose them.\nAbba Kyari is still being assured by the police hierarchy that he would not be extradited to the US.\nSaharaReporters since Thursday in several reports on Kyari exposed how Hushpuppi claimed to have offered bribes to the top police officer, going by court documents that were ordered unsealed.\nThe Inspector-General of Police has ordered an internal review of the United States’ authorities’ allegations against Kyari."
  },
  {
    "headline": "REVEALED: Hushpuppi: What Nigeria’s Suspended Police Officer, Kyari Told Inspector-General’s Investigation Panel On Tuesday",
    "summarized_story": "Suspended Deputy Commissioner of Police, Abba Kyari, who formerly headed the Intelligence Response Team, on Tuesday appeared before the Special Investigation Panel set up by the Inspector-General of Police, Usman Baba, and was grilled for several hours.\nKyari on his part is threatening that many senior officers benefited from his ‘generosity’ and if he’s betrayed, he would expose them.\nAbba Kyari is still being assured by the police hierarchy that he would not be extradited to the US.\nSaharaReporters since Thursday in several reports on Kyari exposed how Hushpuppi claimed to have offered bribes to the top police officer, going by court documents that were ordered unsealed.\nThe Inspector-General of Police has ordered an internal review of the United States’ authorities’ allegations against Kyari."
  },
  {
    "headline": "REVEALED: Hushpuppi: What Nigeria’s Suspended Police Officer, Kyari Told Inspector-General’s Investigation Panel On Tuesday",
    "summarized_story": "Suspended Deputy Commissioner of Police, Abba Kyari, who formerly headed the Intelligence Response Team, on Tuesday appeared before the Special Investigation Panel set up by the Inspector-General of Police, Usman Baba, and was grilled for several hours.\nKyari on his part is threatening that many senior officers benefited from his ‘generosity’ and if he’s betrayed, he would expose them.\nAbba Kyari is still being assured by the police hierarchy that he would not be extradited to the US.\nSaharaReporters since Thursday in several reports on Kyari exposed how Hushpuppi claimed to have offered bribes to the top police officer, going by court documents that were ordered unsealed.\nThe Inspector-General of Police has ordered an internal review of the United States’ authorities’ allegations against Kyari."
  },
  {
    "headline": "Nigeria’s Suspended Police Chief Deletes Facebook Post Claiming He ‘Assisted Hushpuppi To Buy N300,000 Clothes’ Amid Looming Extradition To US",
    "summarized_story": "Nigeria’s embattled Deputy Commissioner of Police, Abba Kyari, has deleted his infamous Facebook update in which he responded to his indictment in the United States with claims that he only assisted serial internet fraudster, Ramon ‘Hushpuppi’ Abbas, to get N300,000 clothes.\n\"Nobody demanded for a kobo from Abbas Hushpuppi.\nThe Native Clothes and Caps (5 sets) were brought to our office and He sent somebody to Collect them in our office.\n\"Nobody demanded any money from Abbas Hushpuppi and nobody collected any money from him.\nSaharaReporters had earlier reported that Kyari edited the statement he posted on his Facebook page last Thursday, removing the parts where he claimed he helped Hushpuppi to get native clothes and caps worth N300,000."
  },
  {
    "headline": "Nigeria’s Suspended Police Chief Deletes Facebook Post Claiming He ‘Assisted Hushpuppi To Buy N300,000 Clothes’ Amid Looming Extradition To US",
    "summarized_story": "Nigeria’s embattled Deputy Commissioner of Police, Abba Kyari, has deleted his infamous Facebook update in which he responded to his indictment in the United States with claims that he only assisted serial internet fraudster, Ramon ‘Hushpuppi’ Abbas, to get N300,000 clothes.\n\"Nobody demanded for a kobo from Abbas Hushpuppi.\nThe Native Clothes and Caps (5 sets) were brought to our office and He sent somebody to Collect them in our office.\n\"Nobody demanded any money from Abbas Hushpuppi and nobody collected any money from him.\nSaharaReporters had earlier reported that Kyari edited the statement he posted on his Facebook page last Thursday, removing the parts where he claimed he helped Hushpuppi to get native clothes and caps worth N300,000."
  },
  {
    "headline": "FACT CHECK: Did US demand extradition of Air Peace CEO as Fani-Kayode claimed?",
    "summarized_story": "On July 30, Femi Fani-Kayode, a former minister of aviation, claimed the United States requested for the extradition of Allen Onyema, the chief executive officer of Air Peace, on alleged fraud charges “but Nigeria stood by him”.\nAdvertisementIn 2019, Onyema was indicted by the United States Department of Justice for fraud and money laundering.\nChecks by TheCable showed that the US never requested the extradition of Onyema.\nOn November 19, 2019, the US issued a warrant to arrest Onyema for alleged money laundering and bank fraud.\nAdvertisementVERDICT: The claim made by Fani-Kayode that the US demanded the extradition of Onyema is misleading."
  },
  {
    "headline": "FACT CHECK: Did US demand extradition of Air Peace CEO as Fani-Kayode claimed?",
    "summarized_story": "On July 30, Femi Fani-Kayode, a former minister of aviation, claimed the United States requested for the extradition of Allen Onyema, the chief executive officer of Air Peace, on alleged fraud charges “but Nigeria stood by him”.\nAdvertisementIn 2019, Onyema was indicted by the United States Department of Justice for fraud and money laundering.\nChecks by TheCable showed that the US never requested the extradition of Onyema.\nOn November 19, 2019, the US issued a warrant to arrest Onyema for alleged money laundering and bank fraud.\nAdvertisementVERDICT: The claim made by Fani-Kayode that the US demanded the extradition of Onyema is misleading."
  },
  {
    "headline": "MATTERS ARISING: COVID-19, cholera on rampage as Nigerian resident doctors down tools",
    "summarized_story": "On Monday, the Nigerian Association of Resident Doctors (NARD) commenced an indefinite strike over complaints of irregular payment of salaries, allowances, members welfare, health hazard allowances, among other issues.\nWhen the resident doctors went on strike in April, patients across teaching hospitals in the country were stranded and abandoned.\nThe country recorded 505 fresh infections on Tuesday.\nBased on the recent data released by the NCDC, 18 states and the FCT have reported cholera cases since the beginning of the year.\n“The federal ministry of health is engaging resident doctors who have embarked on industrial action with a view to quickly resolving the issues,” Ehanire said."
  },
  {
    "headline": "MATTERS ARISING: COVID-19, cholera on rampage as Nigerian resident doctors down tools",
    "summarized_story": "On Monday, the Nigerian Association of Resident Doctors (NARD) commenced an indefinite strike over complaints of irregular payment of salaries, allowances, members welfare, health hazard allowances, among other issues.\nWhen the resident doctors went on strike in April, patients across teaching hospitals in the country were stranded and abandoned.\nThe country recorded 505 fresh infections on Tuesday.\nBased on the recent data released by the NCDC, 18 states and the FCT have reported cholera cases since the beginning of the year.\n“The federal ministry of health is engaging resident doctors who have embarked on industrial action with a view to quickly resolving the issues,” Ehanire said."
  },
  {
    "headline": "Court restrains DSS from arresting Igboho, blocking his bank accounts",
    "summarized_story": "A high court in Ibadan, Oyo state has granted an ex-parte motion restraining the Department of State Services (DSS) and attorney-general of the federation from “arresting, intimidating, harassing, and blocking bank accounts of Sunday Adeyemo better known as Igboho”.\nAdvertisementLadiean Akintola, the judge, granted the order on Wednesday following an ex-parte motion moved by Yomi Aliu, Igboho’s lawyer at the court.\nIgboho and his wife were arrested at Cadjèhoun Airport in Cotonou on their way to Germany.\nTwo persons were killed by the DSS in the raid while 12 others were arrested and whisked to Abuja.\nIgboho had through his lawyer sued the AGF and the DSS claiming damages worth N5.5 billion over alleged violation his fundamental human rights."
  },
  {
    "headline": "Can mobile applications help solve Africa's healthcare access problem?",
    "summarized_story": "Without discovering the mobile app, he could easily have been one of the more than 400,000 Africans malaria killed in 2019.\nZuri Health mobile app.\nArthur Ikechukwu Anoke and Daisy Isiaho, co-founders of the mobile app, Zuri Health.\nGovernmental policies will help hold digital healthcare companies accountable and protect the information and data of citizens that use the technologies.\nYet it’s fundamental if we should achieve the Sustainable Development Goals,” said Daisy Isiaho, Zuri Health Co-founder and Project Manager."
  },
  {
    "headline": "Inconsistent policies are killing African startups",
    "summarized_story": "On 18 December, 2015 the CBK again issued Banking Circular No 14 of 2015, which cautioned, ‘all financial institutions against dealing in virtual currencies or transacting with entities that are engaged in virtual currencies.\nFinancial institutions are expressly advised not to open accounts for any person dealing in virtual currencies such as Bitcoin.\nDigital Tax policies in South Africa, Nigeria, Uganda and KenyaSouth Africa was the first, in 2014, to tax digital services by imposing a 14% value added tax (VAT) on digital imports.\nThis same proposal for digital tax was only shut down by the Benin Government after a peaceful protest was staged by its people.\nThis has not been the case however – digital tax policies and laws have mainly been used to restrict digital activity of citizens, infringing on their digital rights."
  },
  {
    "headline": "Kuda Bank closes $55 million Series B round led by Paypal backers",
    "summarized_story": "Nigerian fintech startup, Kuda Bank, has raised $55 million in a Series B round at a valuation of $500 million.\nThis comes after a recent Series A of $25 million announced by the company just a little over four months ago.\nKuda plans to use the funds to build on its new services for Nigeria as well as prepare for a continental expansion.\nBeyond just basic financial services, Kuda now offers credit to its users by way of an overdraft allowance, which the company pre-qualifies the most active users for.\nAccording to Ogundeyi, Kuda has seen “minimal” default because of its approach."
  },
  {
    "headline": "The dawn of Ghana’s tech ecosystem: Here’s what you should know",
    "summarized_story": "Here’s what you should know about Ghana’s tech ecosystem, beyond cliches.\n“We are seeing more Ghanaian tech talents being headhunted by global companies.\n“When Impact Hub Accra started, we were pretty much the only Hub in town,” Kelechi Ofoegbu, COO Impact Hub Accra, said.\nA number of established Ghanaian tech companies like Hubtel, Farmerline, Sayetech, Green Afro-Palms began in Kumasi.\nJorge Appiah, who is also the CEO of SolarTaxi, believes the Ghanaian tech ecosystem is in its early days."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has..."
  },
  {
    "headline": "Rachael Akalia’s remarkable journey to becoming Patricia Technologies’ brand manager",
    "summarized_story": "She was better suited for relationship-based tasks with such a skillset, so Agbodje asked her to become the startup’s customer service representative and social media manager.\nI want to start a proper customer service team, which you will head.’”Leading a team of ten was a new challenge that came with greater responsibility which prompted her to take customer service courses on Udemy.\nBy June 2019, the growth of the Patricia team necessitated the expansion of the customer service team to 35 people.\n“I had a conversation with Chika, the Chief People Officer, about why I was moved to the marketing team.\nWhile she continues to embody the Patricia brand, Rachael ultimately plans to go back to school, something she has put on hold for a few years."
  },
  {
    "headline": "Inside Alida School’s plans to raise Africa’s next generation of tech talents",
    "summarized_story": "AdvertisementDissatisfied with this situation, Dauda Barry, a London-based Senegalese serial entrepreneur, was propelled to start Alida School in March 2021, an online coding school for Africans.\n“Building up Adama Robotics, being part of the startup ecosystem in London, I began hearing about Lambda School.\n'”Realising the feasibility, Barry began building Alida School upon his return to London in March 2021.\nAlida School provides schooling in mainly front-end web development, Git, and Vue.js, and the first cohort is currently eleven weeks into the programme.\nWith the various challenges that Africa’s burgeoning tech scene faces, startups like Alida School will go a long way in creating and refining talents to bolster the growth of technological innovations on the continent."
  },
  {
    "headline": "Khula’s seed round, Wapipay’s pre-seed, and Printivo CEO steps down",
    "summarized_story": "Share this article:Today I’m discussing:Khula’s $1.3 million raiseWapipay raises $2.2 millionOluyomi Ojo steps down as Printivo CEOKhula raises $1.3 millionKaridas Tshintsholo (CEO), Matthew Piper (CPO) and Jackson DyoraSouth African agri-tech startup, Khula, has closed a $1.3m seed round.\nThe startup will also be able to use AECI’s vast distribution network to ensure its products reach more people.\nWapipay raises $2.2 millionLeft: Paul Ndichu Co-Founder Wapi Pay, Right: Eddie Ndichu Co-Founder & CEO Wapi Pay.\nSource: WapipayKenyan fintech startup, Wapipay has raised $2.2m in pre-seed funding to help African businesses make payments in Asia.\nAll while minimising the cost of transactions; it needs to be as easy as sending M-PESA.”Oluyomi Ojo steps down as Printivo CEOOluyomi OjoCo-founder of print-on-demand startup, Printivo, Oluyomi Ojo, has announced in a Medium post that he has left his position as CEO."
  },
  {
    "headline": "Bitcoin price retreats on profit-taking, regulatory fears",
    "summarized_story": "The price of bitcoin was trading below $39,000 on Tuesday after nearly a week it went on a bull run hitting an intraday high of $42,388.\nBefore the price surge, the crypto had traded within the range of $30,000 and $40,000 for over two months.\nThe price drop is primarily a result of speculative traders…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Eight ways inflation has made Nigerians poorer within 10yrs",
    "summarized_story": "Declining incomes and a continuous spike in prices are reducing the ability of Nigerians to afford some of the basic necessities of life such as food, water, shelter, and clothing.\nIn almost a decade, the cost of items has more than doubled, worsening the living conditions of people.\nAccording to the National Bureau of Statistics…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Telcos record first subscriber growth in 8 months",
    "summarized_story": "In June, over 500,000 mobile subscribers joined the various telecommunication networks in Nigeria, making it the first time in 8 months the sector is recording growth.\nThis is coming two months after the government lifted the ban on SIM card sales as a measure to get more Nigerians to register for their National Identification Number…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Word Day Against Trafficking In Persons: UNHCR Harps on Inter Agencies Collaboration – Nigerian Observer",
    "summarized_story": "“Although the Federal Governmental has put in measures to counter trafficking in persons, Nigeria remains a country of origin, transit, and destination for human trafficking.\n“We are making significant progress in the fight against human trafficking and we encourage all stakeholders to join the fight against human trafficking so that we can do more”, he said.\n(Mrs.), Chidiebere Oruruo-Ifedu, said that her agency is at the forefront in the fight against human trafficking in Africa.\n“Today, the whole world is celebrating the fight against human trafficking and in our continent, NAPTIP is the focal agency that fight human trafficking.\nWe are saying no to human trafficking”, she remarked..."
  },
  {
    "headline": "Obaseki hails Oba of Benin’s stance on new property protection law, assures on synergy to check activities of land grabbers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has saluted the Oba of Benin, His Royal Majesty, Omo N’Oba N’Edo, Uku Akpolokpolo, Oba Ewuare II, for his support and collaboration with the government to check the criminal activities of land grabbers in the state.\n“We are glad that we have promulgated and re-enacted the law on private property protection and banned the activities of community youths perpetrating this act.\nI am happy to inform you that the palace of the Oba of Benin is standing with the Edo State Government on this.\n“The Oba of Benin, Oba Ewuare II, is very much with the government on this, as youths protested to his palace on this and he stood firm with the action of the government.\nWe will ensure that we curtail it and recover as much land that has been encroached.”He further stated: “Land encroachment and land grabbing is something we are taking very seriously."
  },
  {
    "headline": "Human Trafficking: IOM launches Victims Identification, Reporting Tools – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA: The International Organisation for Migration (IOM) has commemorated the 2021 World Day Against Trafficking in Persons with the launch of identification and reporting tools for victims of human trafficking in Nigeria.\nHe said that it would be administered for victim identification and reporting by all relevant stakeholders across the country.\nThe inability to properly identify trafficked persons, he said increases their vulnerability to exploitation.\nHe added that this year’s theme, “Victims Voices Lead the Way,” highlights the importance of listening to and learning from the experiences of survivors of human trafficking.\nDue to the severity and the multidimensional nature of human trafficking, he said that IOM counter trafficking work focuses on facilitating assistance and protection to trafficked persons to reduce their vulnerability."
  },
  {
    "headline": "Edo College abuse video: Govt suspends Principal, House Master …to prosecute abusers with Child Rights Law – Nigerian Observer",
    "summarized_story": "In a statement, Secretary to Edo State Government, Osarodion Ogie Esq., said all the students involved in the abusive behaviour have been handed over to the Ministry of Justice for investigation and prosecution in accordance with the Child Rights Law.\nThe statement reads: “The Edo State Government has watched with disdain the disturbing viral social media video of abuse by students of Edo College, Benin City, the Edo State capital.\nHe is to remain on suspension until the investigation of the incident is concluded and government provides further directives on the matter.\n“The House Master for Akenzua Hall of Residence, Mr. Oamen Stanley, has also been suspended indefinitely, with immediate effect.\n“All the students involved in the abusive behaviour have been handed over to the Ministry of Justice for investigation and prosecution in accordance with the Child Rights Law."
  },
  {
    "headline": "PDP governors speak on resignation of seven party’s national officers",
    "summarized_story": "ADVERTISEMENTThe Peoples Democratic Party (PDP) Governors’ Forum has appealed to members and ‘stakeholders’ of the party to remain calm over Tuesday resignation of seven national deputy officers of the party.\n“The Governors hereby call on all members of the party and indeed all stakeholders to remain calm in the face of the developments.\nREAD ALSO:Seven deputy national officers of the party on Tuesday resigned their positions as members of the National Executive Council.\nThe seven national officers are Deputy National Publicity Secretary, Diran Odeyemi; Deputy National Legal Adviser, Ahmed Bello; Deputy National Women Leader, Umoru Hadizat; Deputy National Auditor Divine Amina Arong; Deputy National Organising Secretary, Hassan Yakubu; and Deputy National Financial Secretary, Irona Alphonsus.\nThe officers cited the incompetence of the party’s National Chairman, Uche Secondus, in managing the affairs of the party."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Nigeria’s Tokyo 2020 Olympics showing has been near disaster, but change is happening",
    "summarized_story": "But the country’s wrestler at the event, Blessing Oborududu, and long jumper, Ese Brume, have ensured that it won’t return empty handed, by winning silver and bronze medals respectively.\nIndeed, the country won its first medal in the 1964 games held in Tokyo, with Nojim Maiyegun winning bronze in boxing.\nThis was followed in West Germany 1972, by another bronze won in boxing by Isaac Ikhouria.\nChika Chukwumerije and Mariam Usman won bronze in taekwondo and weightlifting respectively.\nOf the total 25 medals won by Nigeria since 1952, for instance, boxing accounted for six, athletics 13, football three, weightlifting two and taekwondo, one."
  },
  {
    "headline": "Report says $2.4m paid as ransom for kidnapped students since November",
    "summarized_story": "A report by the National Security Summit organised by the House of Representatives between May 26 and 29, 2021, had revealed that up to $2.4m has been paid to secure the release of schoolchildren in five separate mass kidnapping incidents in the North-West since November 2020.\nThe leadership of the House of Representatives had presented a copy of the report to President Muhammadu Buhari.\nThe report said though official sources denied paying such money, sources privy to the negotiations that led to the release confirmed the amount.\nIn the North West particularly, Nigeria is experiencing a crisis of armed banditry and kidnapping,” the report said.\n“Their negotiated release has cost the government as much as $2.4m, according to sources familiar with the details, although official sources insist that no ransoms were tendered."
  },
  {
    "headline": "Akinleye celebrates Osun PDP chair at birthday, describes him as a unifying factor",
    "summarized_story": "By Sunday Oguntuyi, OsogboA chieftain of People’s Democratic party, PDP in Osun State, Alhaji Kazeem Akinleye, has joined million of well wishers to rejoice with the chairman of the party in the state, Hon.\nSunday Bisi as he celebrates his birthday today, just as he described as a unifying factor who came to rebuild the party in the state.\nAkinleye in a congratulatory message made available to newsmen in Osogbo, alluded to the leadership quality possessed by the state party chairman which, he said has started manifesting inform of rebuilding the party.\nBisi for attaining another milestone in life and prayed to God for enablement to lead the people’s party to the promise land.\n“I, on behalf of my family and my associate wishing my amiable chairman, the capacity chairman a blissful birthday, I fervently prayed for God’s guidance in all your endeavour."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "VP Osinbajo Presides Over FEC Meeting",
    "summarized_story": "Vice President Yemi Osinbajo on Wednesday presided over a virtual meeting of the Federal Executive Council (FEC) at the Presidential Villa, Abuja.\nPresident Muhammadu Buhari is in London, UK, for a medical check-up after participating in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021 to 2025.\nMinisters physically present at the virtual FEC meeting included Lai Mohammed, Minister of Information and Culture, Abubakar Malami, Minister for Justice and Attorney-General and Timipre Sylva, Minister of State for Petroleum Resources.\nADVERTISEMENTOthers were, Hajia Zainab Ahmed, Minister of Finance, Budget and National Planning, Rotimi Amaechi, Minister of Transportation, Chukwuemeka Nwajiuba, Minister of State for Education.\nAt the last meeting on July 14, FEC approved N8.6 billion for the construction of vaccine laboratory, text kits for HIV/AIDS and procurement of medical equipment."
  },
  {
    "headline": "VP Osinbajo Presides Over FEC Meeting",
    "summarized_story": "Vice President Yemi Osinbajo on Wednesday presided over a virtual meeting of the Federal Executive Council (FEC) at the Presidential Villa, Abuja.\nPresident Muhammadu Buhari is in London, UK, for a medical check-up after participating in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021 to 2025.\nMinisters physically present at the virtual FEC meeting included Lai Mohammed, Minister of Information and Culture, Abubakar Malami, Minister for Justice and Attorney-General and Timipre Sylva, Minister of State for Petroleum Resources.\nADVERTISEMENTOthers were, Hajia Zainab Ahmed, Minister of Finance, Budget and National Planning, Rotimi Amaechi, Minister of Transportation, Chukwuemeka Nwajiuba, Minister of State for Education.\nAt the last meeting on July 14, FEC approved N8.6 billion for the construction of vaccine laboratory, text kits for HIV/AIDS and procurement of medical equipment."
  },
  {
    "headline": "Plateau Crisis: ‘No Cause For Alarm As Normalcy Returns To Gada Biyu’",
    "summarized_story": "The government of Plateau State has said the breach of peace reported around Gada Biyu, Jos North LGA, has been put under control following swift response by security agencies.\nThis is even as the state government also said Jos, the state capital city was calm and peaceful as there is no cause for alarm.\nADVERTISEMENTThe state government said the intervention of the security personnel immediately brought the situation under control as the youths were dispersed and the road cleared, thereby restoring traffic flow.\nIt also noted that with the return of normalcy around Gada Biyu and environs, the government urged citizens to avoid any act that could lead to the breakdown of law and order.\n“Security forces have continued their operations to dominate areas affected by recent attacks in Bassa and Riyom LGAs with a view to restoring normalcy and arresting perpetrators as directed by governor Simon Lalong after an emergency Security Council Meeting,” the statement added."
  },
  {
    "headline": "Plateau Crisis: ‘No Cause For Alarm As Normalcy Returns To Gada Biyu’",
    "summarized_story": "The government of Plateau State has said the breach of peace reported around Gada Biyu, Jos North LGA, has been put under control following swift response by security agencies.\nThis is even as the state government also said Jos, the state capital city was calm and peaceful as there is no cause for alarm.\nADVERTISEMENTThe state government said the intervention of the security personnel immediately brought the situation under control as the youths were dispersed and the road cleared, thereby restoring traffic flow.\nIt also noted that with the return of normalcy around Gada Biyu and environs, the government urged citizens to avoid any act that could lead to the breakdown of law and order.\n“Security forces have continued their operations to dominate areas affected by recent attacks in Bassa and Riyom LGAs with a view to restoring normalcy and arresting perpetrators as directed by governor Simon Lalong after an emergency Security Council Meeting,” the statement added."
  },
  {
    "headline": "Ex-APC Deputy Pub Sec, Timi Frank, Gets International Appointment",
    "summarized_story": "ADVERTISEMENT“This appointment will help to liberate the last colony of the Black African race: West Papua.\nThis appointment will help to liberate the last colony of the Black African race: West Papua.\nThis appointment will help to liberate the last colony of the Black African race: West Papua.\nWe are ready to rally all forces of democracy, human dignity and freedoms to help West Papua to regain its independence and live as a sovereign nation.\nI call on East African, Middle East and West African states and governments to stand up for West Papau.”"
  },
  {
    "headline": "I saw woman, beheaded son where kidnappers kept me in Ondo – Escaped teenager",
    "summarized_story": "As I was going, I saw three men in a Toyota Camry car and they told me that one of my wares had fallen down.\nInside the building, I saw a woman crying with her hands tied to her back and I also saw the headless body of a young person.\nThe woman later told me to untie the rope from her hands and we fled together.\n“When I got to the main road, I saw some people selling bread by the roadside and narrated my ordeal to them.\n“He explained to us that the area, where he was kidnapped from, was isolated as he could not call on anyone."
  },
  {
    "headline": "I saw woman, beheaded son where kidnappers kept me in Ondo – Escaped teenager",
    "summarized_story": "As I was going, I saw three men in a Toyota Camry car and they told me that one of my wares had fallen down.\nInside the building, I saw a woman crying with her hands tied to her back and I also saw the headless body of a young person.\nThe woman later told me to untie the rope from her hands and we fled together.\n“When I got to the main road, I saw some people selling bread by the roadside and narrated my ordeal to them.\n“He explained to us that the area, where he was kidnapped from, was isolated as he could not call on anyone."
  },
  {
    "headline": "Buhari salutes Bazoum as Niger republic marks 61st independence anniversary",
    "summarized_story": "By TANKO ALIPresident Muhammadu Buhari has felicitated with the President of Niger Republic, Mohammed Bazoum, on the country’s Independence Day being observed today, August 3, 2021.\nThe President describes Niger Republic as “one of Nigeria’s best friends in Africa” and that the French speaking country “has always demonstrated tremendous goodwill towards Nigeria.”President Buhari noted that, “despite the artificial division of Africa, the people of Niger share cultural affinity with Nigerians,” adding that “the colonial identity of the people of Niger Republic has never affected the spirit of mutual respect and brotherliness with their Nigerian neighbours.”He described President Bazoum as “a great Africanist who has demonstrated statesmanship since his election in April this year.”President Buhari told Bazoum: “As you celebrate your independence today, I send hearty best wishes on behalf of the government and the people of Nigeria.”Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari salutes Bazoum as Niger republic marks 61st independence anniversary",
    "summarized_story": "By TANKO ALIPresident Muhammadu Buhari has felicitated with the President of Niger Republic, Mohammed Bazoum, on the country’s Independence Day being observed today, August 3, 2021.\nThe President describes Niger Republic as “one of Nigeria’s best friends in Africa” and that the French speaking country “has always demonstrated tremendous goodwill towards Nigeria.”President Buhari noted that, “despite the artificial division of Africa, the people of Niger share cultural affinity with Nigerians,” adding that “the colonial identity of the people of Niger Republic has never affected the spirit of mutual respect and brotherliness with their Nigerian neighbours.”He described President Bazoum as “a great Africanist who has demonstrated statesmanship since his election in April this year.”President Buhari told Bazoum: “As you celebrate your independence today, I send hearty best wishes on behalf of the government and the people of Nigeria.”Share this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Igboho wins big in Court as DSS, AGF Malami barred from arresting him",
    "summarized_story": "Embattled Yoruba Nation agitator, Sundday Igboho, now in Benin Republic scored a big legal victory in Ibadan today against the DSS.\nJustice Ladiean Akintola of Oyo High Court granted an ex-parte motion restraining the Department of State Services (DSS) and Attorney General of the Federation from arresting, intimidating, harassing him.\nThe order was granted following an ex-parte motion moved by Igboho’s lawyer Chief Yomi Aliu (SAN) at the court on Wednesday.\nThe motion developed from the originating motion seeking N500 billion damages for invasion of his house in Ibadan, the Oyo State capital on July 1.\nAliu expressed confidence the AGF Abubakar Malami (SAN) will not disobey the court order."
  },
  {
    "headline": "CAC pledges improved service delivery",
    "summarized_story": "By Chinenye OfforAlhaji Garba Abubakar, the registrar general of the Corporate Affairs Commission (CAC) said the agency will improve its service delivery and revenue generation.\nAbubakar lauded the excellent job of the committee and urged members to continue to offer selfless service to the Commission at all times.\nAlso, Ukaga applauded the registrar general for the tremendous support, guidance and cooperation during the retreat.\nUkaga, therefore, pledged the committee’s readiness to continue to offer selfless service to the Commission and the Nation.\nThe 2021 CAC retreat was tagged “Digital Economy: The Role of Corporate Affairs Commission."
  },
  {
    "headline": "Breaking: DSS presents 12 Igboho’s aides in court, lawyer requests bail",
    "summarized_story": "At the last hearing, the DSS brought only 8 detainees to court, after disobeying the first court order to produce all suspects in court.\nThe security outfit today, however, brought all the 12 detainees before the court for continuation of the suit instituted by the detainees against the DSS Director-General.\nPelumi Olajengbesi, Counsel for the 12 detainees told Justice Obiora Egwuatu to admit his clients to bail unconditionally.\nThe court on Thursday, issued a fresh order on the Director-General of the DSS to produce before it 12 detained aides of the alleged Yoruba secessionist leader, Sunday Igboho.\nJustice Obiora Egwuatu issued the fresh order following an appeal by DSS counsel, Idowu Awo, that the agency is given another time to comply with the order."
  },
  {
    "headline": "BREAKING: Lawless Department of State Services Agrees To Release Eight Among 12 Sunday Igboho’s Aides",
    "summarized_story": "The agency brought the 12 aides before Justice Obiora Egwuatu of the Federal High Court in Abuja on Wednesday.\nJudge Egwuatu had on July 23 ordered the secret police to produce the detainees in court on July 29.\nThe court adjourned till August 2 and restated its order compelling the DSS to produce the detainees in court.\nJustice Egwuatu berated the agency for failing to produce the applicants according to the order of the court.\nHowever, only eight out of the 12 aides paraded by the secret police made it to court on the next date adjourned to."
  },
  {
    "headline": "Abba Kyari Deletes Facebook Post Explaining His Relationship With Hushpuppi",
    "summarized_story": "The United States District Court for the Central District of California had accused Kyari, Hushpuppi and four others of fleecing the Qatari investor of $1.1m.\nKyari had claimed that Hushpuppi raised the alarm that Vincent wanted to take his life.\nThe cop had also added, “Nobody demanded a kobo from Abbas Hushpuppi.\nby Dubai Police on June 9, 2020 — to the Nigerian bank accounts of another person in Nigeria.\nKyari subsequently deleted his “N300,000” Facebook post after Innocenti’s accusation became public."
  },
  {
    "headline": "BREAKING: DSS Produces 12 Igboho’s Aides In Court",
    "summarized_story": "On Wednesday, some of the aides of Yoruba Nation agitator, Sunday Adeyemo, were seen at the Federal High Court in Abuja.\nOlatunji ObasaThe Department of State Service appeared before the Federal High Court in Abuja on Wednesday to present the 12 detained aides of Sunday Adeyemo, also known as Sunday Igboho.\nRecall that Justice Obiora Egwuatu had ordered the DSS to produce all the Igboho aides to enable the court inquire into the circumstances surrounding their arrest.\nOn Monday, when the Igboho aides were brought to court, four out of the 12 were absent.\nThe 12 detained aides were said to have been arrested in Igboho’s house on July 1 and had approached the court challenging their arrest and continued detention."
  },
  {
    "headline": "BREAKING: Court Restrains DSS From Arresting Sunday Igboho",
    "summarized_story": "An ex-parte motion has been granted by an Oyo State High Court, preventing Yoruba Nation agitator Chief Sunday Adeyemo, also known as Sunday Igboho, from being arrested by the Department of State Security and the Attorney General of the Federation.\nThe court also barred the DSS and the AGF from freezing the Yoruba rights activist’s bank accounts.\nFollowing an ex-parte motion filed by his lawyer, Yomi Aliu (SAN), at the court on Wednesday, Justice Ladiean Akintola issued the order.\nJustice Ladiean Akintola gave the order following an ex-parte motion moved by his lawyer, Yomi Aliu (SAN), at the court on Wednesday.\nHe also asked the court to stop the Attorney General of the Federation, DSS and other security agencies from arresting him or infringing on his fundamental human rights."
  },
  {
    "headline": "Happening now – Bail: Judge yet to sit as Sunday Igboho’s associates’ fate still hangs",
    "summarized_story": "After standing down the matter for two hours now, the fate of the 12 detained Igboho’s aides appears to have hanged as the presiding judge, Justice Obiora is yet to resume sitting as at the time of filing this report.\nOlajengbesi made the plea following the production of the 12 detainees beforehim on Wednesday.\nCountering, Counsel to the Nigeria’s secret police, Awo opposed the application for bail for four of the applicants in custody.\nHe however, did not oppose the application for bail for eight others.\nAwo, while justifying his argument cited their level of involvement in the offences preferred against themThe service did not oppose bail for 1st, 3rd, 4th, 7th, 8th, 9th, 10th and 11th applicants, the security outfit strongly objected to granting bail to 2nd, 12th, 6th and 5th applicants."
  },
  {
    "headline": "Breaking: Consider Nigerians, call off strike, Senate, Reps tell residents doctors",
    "summarized_story": "The residents doctors under the aegis of National Association of Resident Doctors (NARD) had resumed strike on Monday August 2, 2021.\nAlready, the strike action is affecting medical services at various government-owned hospitals.\nAccording to him, “Medical doctors are critical to the nation’s health.\nAlso, speaking, the chairman house committee on health services, Hon.\nEarlier, NAFDAC DG, Prof. Moji Adeyeye while explaining the essence of the sensitisation campaign explained that the exercise will start on August 9 and end on October 9, 2021."
  },
  {
    "headline": "Breaking: Again, DSS bars Journalists from covering Sunday Igboho aides’ trial, coalition demands arrest of operatives",
    "summarized_story": "The operatives of Department of State Security (DSS) have again barred Journalists from covering proceedings at the trial of associates to Yoruba nation activist Sunday Adeyemo aka Sunday Igboho.\nMeanwhile, the Coalition in Defence of Nigerian Democracy and Constitution has called for the arrest of the DSS operatives that were involved in the harrasment of Journalists in the line of duty.\nAt the last trial, the DSS operatives seized camera and prevented some newsmen from carrying out their functions as prescribed by relevant sections of the Constitution.\n“It is also instructive at this point for the Nigerian Union of Journalists to rise up and protect journalists from frequent harassment.\n“We urge the NUJ to explore different options to fight for the rights of journalists, including withdrawing its services to targeted institutions.”"
  },
  {
    "headline": "Don’t preach division of Nigeria, NYSC DG advises Corp members -NigPilot",
    "summarized_story": "Director-General, National Youth Service Corps, Brig.-Gen. Shuaibu Ibrahim has advised Corps members to promote peace and unity of Nigeria, urging them to shun any act that would encourage division.\nHe said as nation builders, Corp members should refrain from all forms of cybercrimes, and drive their vision with passion.\nHe urged the Corps members to respect the culture and values as well as contribute meaningfully to the development of their host communities.\nThe DG stressed the need for the Corps members to seek permission before travelling in view of the spate of road accidents and security challenges in the country.\n“Recently, corps members have been involved in a motor accidents, therefore, it is mandatory to take permission before embarking on a journey,” he said."
  },
  {
    "headline": "LG unveils smart home appliances with free stabilizer -NigPilot",
    "summarized_story": "LG Electronics has taken smart home appliances to another dimension with the introduction of stabilizer-free, non-plumbing, and auto restart refrigerators to present consumers with a more enriching smart home experience.\nKang said LG is set to deliver an unparalleled level of performance and convenience into the home with enhanced features.\n“One unique feature is the Stabilizer Free Operation on LG Refrigerators and as the name suggests, refrigerators with stabilizer-free operation features save you from spending extra money in buying a separate stabilizer for your refrigerator.\nOn LG Washing Machine, A unique feature is the Auto Restart feature.\nLG InstaView Refrigerator features a Non-Plumbing Dispenser."
  },
  {
    "headline": "Istochnik Initiative seeks support of Russian Embassy to promote Russian language, culture -NigPilot",
    "summarized_story": "A non-governmental organization (NGO) under the aegis of the Istochnik Initiative has solicited the support of the Russian Embassy in Abuja to promote Russian culture and language amongst the Russian community in Nigeria, as well as Nigerian professionals that were trained in Russia.\n“In addition, Istochnik Initiative aims to popularization Russian education in Nigeria and promote Russian universities in Nigeria.\nHe said: “This passion for the propagation of Russian language and literature had been evident since her lecturing days at the University of Ibadan when she organized Russian cultural activities and Russian language classes for the children of Russian women living in Ibadan.\n“Then, with the support of the Russian Embassy in Lagos, she established a Russian library that included Russian films and subscribed to Russian newspapers and journals for the benefit of the Russian-speaking community.\n“Accordingly, the Russian Embassy in Abuja had supported Mrs. Olga IGBO in her initiative to establish the Istochnik Initiative NGO and actively supported the NGO in the organization of several Russian cultural activities”."
  },
  {
    "headline": "West-African stakeholders embrace Universality of Internet -NigPilot",
    "summarized_story": "Stakeholders of the ICT sector in West Africa have agreed to embrace the universality of the internet with the aim of deepening internet penetration across the region and ensuring safe internet.\nUNESCO and the African ICT Foundation jointly organized a knowledge-sharing session on how to mainstream Internet Universality and ROAM principles (Rights, Openness, Access, and Multi-stakeholder approach).\nDorothy Gordon, Chair of UNESCO’ Information for All Programme, reaffirmed the need for strong advocacy from national and regional stakeholders to implement the national assessment of IUIs across the West-African countries.\nRepresenting Development House, Kafui Aheto introduced the initial findings of the ongoing national assessment of ROAM-X indicators in Ghana.\nUNESCO encourages all countries in the West-African sub-region to continue using the ROAM framework and join the Dynamic Coalition on Internet Universality Indicators (IUIs) to bring the Internet forward in the region."
  },
  {
    "headline": "Court Restrains DSS, AGF From Arresting Sunday Igboho, Blocking His Bank Accounts",
    "summarized_story": "The court also restrained the DSS and Mr. Malami from intimidating, harassing, and blocking the bank accounts of Mr. Igboho.\nThe presiding Judge, Justice Akintola gave the order on Wednesday following an ex-parte motion moved by Mr. Igboho’s lawyer Yomi Aliu (SAN) at the court.\nREAD ALSO: DSS Obeys Court Order, Produces All Sunday Igboho’s AidesSpeaking to journalists after the court proceedings, Mr Aliu said “The court has ordered that he must not be arrested, detained, killed in the next 14 days”.\nThe court order comes the same day when the DSS produced all 12 detained aides of Mr Igboho before the Federal High Court in Abuja.\nIgboho and his wife were arrested in Cotonou on July 19, while they tried to catch a flight to Germany."
  },
  {
    "headline": "DSS Obeys Court Order, Produces All Sunday Igboho’s Aides",
    "summarized_story": "The Department of State Service (DSS) on Wednesday produced all 12 detained aides of Sunday Adeyemo popularly known as Sunday Igboho before the Federal High Court in Abuja.\nThis comes less than seventy-two hours after the court ordered the agency to produce all aides of the Yoruba Nation agitator.\nOn Monday the DSS produced only eight of the detained aides at the court.\nThe DSS had paraded the aides and accused them of stockpiling arms to cause chaos in the country.\nAfter the DSS raid on his (Igboho) home, he fled to the Benin Republic and is presently in court fighting extradition back to Nigeria."
  },
  {
    "headline": "Three More Secondary School Students Abducted In Kaduna Found",
    "summarized_story": "Three more abducted students of the Bethel Baptist Secondary school in Kaduna State have been found.\nRead Also: Tears, Joy As 28 More Kidnapped Students Regain Freedom In KadunaThe students have now been debriefed by the military, and will be handed over to the school authorities soon.\nIts been nearly a month since 121 students of the school were abducted from their hotels by bandits, after which the bandits demanded a ransom of ₦60 million for the release of the students.\nOn July 25, 28 students were found inside the Tsoho Gaya Forest in Chikun Local Government Area of the state.\nBut mass school abductions have soared this year, with almost 1,000 students kidnapped, according to UNICEF."
  },
  {
    "headline": "SDR: IMF Allocates $3.35bn To Nigeria",
    "summarized_story": "Nigeria has been allocated about $3.35 billion as part of a historic general allocation of Special Drawing Rights (SDRs) of the International Monetary Fund (IMF).\n“This is a historic decision – the largest SDR allocation in the history of the IMF and a shot in the arm for the global economy at a time of unprecedented crisis,” said IMF Managing Director, Kristalina Georgieva.\nIt is a potential claim on the freely usable currencies of IMF members and can provide a country with liquidity.\nSupporting Pandemic RecoveryThe amount allocated to Nigeria is as a result of the exchange rate of reference which is 0.702283 SDR to a dollar as of July 1, 2021, and Nigeria has 2.4545 billion SDRs.\n“The SDR allocation will benefit all members, address the long-term global need for reserves, build confidence, and foster the resilience and stability of the global economy,” the IMF managing director added."
  },
  {
    "headline": "Jack Grealish Set To Complete £100m Move To Man City – Reports",
    "summarized_story": "Aston Villa playmaker, Jack Grealish, is set to join Manchester City for £100million today according to reports coming from England.\nThe Premier League champions had been in the running to sign Grealish and they have maintained a dogged pursuit, opening talks over their bid last week.\nDespite the ongoing transfer saga, Grealish had reported to training with Aston Villa on Monday after his holidays to the Greek islands of Mykonos and Dubrovnik.\nAccording to Daily mail, Grealish had been holding crunch talks with Aston Villa’s sporting director, Johan Lange earlier in the week stating his intention to move to the next stage of his career.\nVilla are also intent on challenging the top six in the Premier League and have completed the signing of Bayer Leverkusen winger Leon Bailey for £30m as a possible replacement for Grealish."
  },
  {
    "headline": "Covid-19 Delta variant: Akwa Ibom orders one million doses of vaccine",
    "summarized_story": "Akwa Ibom State governor, Udom Emmanuel has said his administration had ordered one million doses of Copvid-19 vaccines to combat the Delta variant’s spread in the state.\nThe governor stated this while speaking at a family gathering hosted by Nathaniel Adiakpan, the Permanent Secretary, Government House, at Afaha Ubiumn in the state’s Onna Local Government Area.\nHe asked citizens to disregard rumors that the vaccine was unsafe, reassuring them that the vaccine had undergone extensive testing and had been found to be safe.\nHe also advised residents to adhere strictly to safety and prevention protocols.\nAdvertisementHe warned residents against involvement in activities that could expose them to the virus."
  },
  {
    "headline": "Vice President, Yemi Osinbajo, presides over virtual FEC meeting",
    "summarized_story": "Vice President Yemi Osinbajo has presided over a virtual meeting of the Federal Executive Council(FEC) at the Presidential Villa, Abuja.\nPresident Muhammadu Buhari is in London, UK, for a medical check-up after participating in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021 to 2025.\nMinisters physically present at the virtual FEC meeting include Lai Mohammed, Minister of Information and Culture, Abubakar Malami, Minister for Justice and Attorney-General and Timipre Sylva, Minister of State for Petroleum Resources.\nOthers were, Hajia Zainab Ahmed, Minister of Finance, Budget and National Planning, Rotimi Amaechi, Minister of Transportation, Chukwuemeka Nwajiuba, Minister of State for Education.\nAdvertisementBoss Mustapha, Secretary to the Government of the Federation and Ibrahim Gambari, Chief of Staff to President are also in attendance."
  },
  {
    "headline": "Niger’s President Bazoum decorates Governor Zulum with equivalent of GCON",
    "summarized_story": "President Mohammed Bazoum of the Republic of Niger on Tuesday decorated Borno Governor, Babagana Umara Zulum, with the country’s Second Order National Honour, “de Grand Officer dans I`Ordre”, which is the equivalent of Grand Commander of the Order of the Niger, GCON, in Nigeria’s ranking of national honours.\nThe decoration took place in Zindar as part of the Federal Government of Niger’s celebration of the country’s independence day.\nIt was the first time a Nigerien President has bestowed the country’s second highest national honor on a Nigerian governor.\nPresident Bazoum later invited Zulum to accompany him to commission 138km Zindar road project and the 22 mega watts power project also in Zindar.\nThe Niger Republic commemorates its independence every year on August 3 with events known as Fête de l’Arbre in French-speaking countries, which involve activities such as tree planting."
  },
  {
    "headline": "Medical Charity MSF Withdraws From Cameroon",
    "summarized_story": "International, independent organisation, Medical charity Médecins Sans Frontières (MSF) has withdrawn from Cameroon’s North-West region after months of suspension by the authorities.\nThe charity said it could not keep staying in an area where it was “not allowed to provide care to people”.\nThe Cameroonian government in December ordered MSF to suspend its activities in the North-West, accusing the charity of being too close to non-state armed groups in the area.\nMSF, which has been one of the few NGOs offering free medical services in the region, says the people “are paying a very heavy price for this situation”.\nIt said it would maintain a small liaison office in the regional capital and would resume its medical activities if the authorities were to lift the suspension."
  },
  {
    "headline": "Sudan Endorses Bill on Joining ICC",
    "summarized_story": "Sudan’s transitional cabinet has collectively approved a bill that would pave way for it to join the International Criminal Court (ICC), Prime Minister Abdalla Hamdok tweeted on Tuesday.\n“Justice and accountability are the backbones of the new Sudan, which is committed to the rule of law that we all seek to build,” Mr Hamdok said.\nThe development moves Sudan closer to handing over to the ICC suspects wanted for war crimes and genocide in the western Darfur region, including former President Omar al-Bashir.\nIn May, the ICC concluded a confirmation of charges hearing in the case of Ali Kushayb, who is accused of committing war crimes and crimes against humanity in Darfur between 2003 and 2004.\nSince August 2019, Sudan has been led by a transitional civilian-led administration, which has vowed to deliver justice to victims of crimes committed in Darfur during Bashir’s rule."
  },
  {
    "headline": "Nigeria Threatens to Dismiss Civil Servants Leaking Classified Memos on Social Media",
    "summarized_story": "Nigeria’s Federal Government has threatened to dismiss any civil servant caught to be leaking official memoranda and other classified documents on social media and other platforms, in breach of oath of secrecy.\nThe circular- HCSF/3065/Vol.1 /94 was titled ‘Unauthorised Circulation of Official Documents/Information on Social Media’.\n“The unwholesome practice involves posting/reposting of secret, confidential and classified government correspondences, policy drafts, minutes, notes, memos, etc., on social media.\n“Henceforth, any officer caught posting/reporting government documents on social media and other platforms without authorisation would be severely disciplined in accordance with the provisions of the PSR.\nNo/ HCSF/109/S.l/120 dated May 22, 2020 and other extant regulations prohibiting unauthorised publishing of official documents."
  },
  {
    "headline": "Nigeria: CBN Bars Payment Service Holding Companies from Accessing Bank Loans",
    "summarized_story": "The Central Bank if Nigeria (CBN) has barred the proposed Payments Service Holding Companies (PSHC) from borrowing from the Nigerian banking system for the purpose of capitalising itself or any of its subsidiaries.\nThe circular, which was obtained on Tuesday from the bank’s website was signed by the CBN Director, Payment System Management Department, Mr. Musa Jimoh.\nThe framework is sequel to a recent approval of new licence categorisations for participants in the Nigerian payments system.\nIt stated that where the PSHC owns less than 100 per cent of the subsidiaries, its minimum paidup capital shall exceed the summation of its proportionate holding in the subsidiaries.\nThe affected regulated payments activities include mobile money operations, switching and processing and payment solution services and any other activity as may be approved by the CBN."
  },
  {
    "headline": "Biden Chides Republican Governors Who Resist Vaccine Rules",
    "summarized_story": "President Joe Biden on Tuesday called on resistant Republican governors to “get out of the way” of vaccine rules aimed at containing the more transmissible and dangerous COVID-19 variant.\nSpeaking from the White House, Biden sharply criticized Florida Gov.\nThe strain is surging in their states and other parts of the country that have large numbers of unvaccinated people.\nRoughly 90 million eligible Americans aged 12 and over have yet to receive one dose of vaccine.\nBiden announced that the U.S. has donated and shipped more than 110 million doses of COVID-19 vaccines to more than 60 countries, ranging from Afghanistan to Zambia."
  }
]