[
  {
    "headline": "WASSCE: PRP accuses Sokoto, Zamfara govts of negligence",
    "summarized_story": "The Peoples Redemption Party has accused the governments of Sokoto and Zamfara States of negligence and a “poor sense of purpose” over the non-participation of the students in the 2022 West African Senior School Certificate Examination.\nThus, being unconcerned with the education of the children of the masses by the governments of Sokoto and Zamfara States implies lack of vision and a poor sense of purpose.\n“It is most dismal that the Zamfara State governor that has no funds to register the children of the masses for WAEC could afford to buy and distribute 260 luxury cars to traditional rulers for selfish political reasons.\n“Education in Sokoto and Zamfara suffers backwardness because the interest of the governors ruling those states centre on the actualisation of their ambitions, not the liberation of the public from shackles of ignorance.\n“We, therefore, call on the ruling governments to provide quality education at all levels to curb the prevailing moral decadence and insecurity that have been bedeviling our country.”Copyright PUNCH."
  },
  {
    "headline": "Soludo condemns lawmaker’s murder, offers 10m reward for useful tips",
    "summarized_story": "The Anambra State Governor, Prof. Chukwuma Soludo, has condemned the murder of the lawmaker representing Aguata II Constituency at the state House of Assembly, Okechukwu Okoye.\nIn a statement on Saturday night, the governor’s media aide, Christian Aburime, described as “heartless” and “barbaric”, the gruesome murder of the lawmaker.\nThe governor said it was with rude shock and deep sadness that the news of the murder came to him.\nNdi Anambra should brace up for the all-out war against the criminals.\nNdi Anambra should brace up for the all-out war against the criminals.”Copyright PUNCH."
  },
  {
    "headline": "JUST IN: Head of Soludo’s lawmaker kidnapped last week found at Nnobi",
    "summarized_story": "By Vincent Ujumadu, AwkaTHE head of the member representing Governor Chukwuma Soludo’s constituency, Hon Okechukwu Okoye, who was kidnapped last week was found today at Nnobi in Idemili South local government area of Anambra State.\n” I regret that one of you, the member representing the good people of Aguata II Constituency in the House of Assembly (my own representative) – Hon.\nOkechukwu Okoye, is still in the custody of the kidnappers.\nBut the state Police Public Relations Officer, PPRO, Mr Tochukwu Ikenga told Vanguard last night that Okoye had been killed.\n“His head was found along Nnobi road today (Saturday)."
  },
  {
    "headline": "Deborah Yakubu Protest: Observe the peaceful protest in your local churches – CAN",
    "summarized_story": "By Olayinka LatonaAhead of tomorrow’s protest over the killing of Deborah Emmanuel Yakubu, the National President of the Christian Association of Nigeria, CAN, Dr. Samson Ayokunle has instructed Christians in the country to be discreet in carrying out the protest in view of a threat by an unknown Islamic body to do a counter-protest.\nCAN in a Press statement signed by Dr. Ayokunle urged church leaders to do the protest of placard carrying within the premises of their local churches or CAN Secretariat.\nIn his words: “You are all aware that some Muslims had sent out information that they were going to counter our peaceful protest on Sunday, May 23 Their intention is to cause chaos and attribute it to us”“In view of the foregoing, I urge you all to do the protest of placard carrying within the premises of your local churches or your CAN Secretariat."
  },
  {
    "headline": "Obanikoro has not stepped down,will not says Campaign Organisation",
    "summarized_story": "ObanikoroThe Obanikoro Campaign Organisation has stated that the former Minister of Defence, Senator Musiliu Obanikoro, is poised and enthusiastically ready to participate in the forthcoming primary election to represent Lagos West in the Senate in 2023.\nIn a statement signed on Monday by his Special Adviser, Sulaiman Adebiyi, he urged the good people of Lagos West to ignore lies and propaganda from unscrupulous elements that the frontline aspirant has stepped down his ambition.\nThe statement reads in part’: This is a call on all the supporters of Senator Musiliu Obanikoro to continue their campaign and house to house mobilisation for the realization of his senatorial ambition to represent the good people of Lagos West Senatorial district.\n“I urge you all to ignore claims that he has stepped down.\nThe thoughts is just a figment of the imagination of those who are jittery of his high political and grassroots reach “"
  },
  {
    "headline": "Shareholders hail Seplat Energy performance",
    "summarized_story": "Ratify appointment of 3 new Non-Executive DirectorsBy Peter EgwuatuShareholders of Seplat Energy Plc, a leading indigenous Nigerian energy company listed on both the Nigerian Exchange Limited (NGX) and London Stock Exchange (LSE) currently have commended the performane of the company over the years despite operating environment challenges.\nC Orjiako’s 13 years as Seplat Chairman as well as laud his retirement from the board.\nSpeaking to the shareholders, the Chairman of Seplat Energy, Dr. Orjiako said: “Our operational and financial performance in 2021 reflects the challenges of our business in Nigeria.\nI have now served as Chairman of Seplat Energy for 12 years and it has been an honour and a privilege to do so.\nWe are proud of the strong foundation you have laid to position Seplat as a leading indigenous energy company in Nigeria within a short space,” Omojola said."
  },
  {
    "headline": "NEMA receives 129 Nigerians stranded in Niger Republic",
    "summarized_story": "The National Emergency Management Agency (NEMA) received 129 Nigerians stranded at Agadez, Niger Republic on Saturday in KanoNEMA Coordinator, Kano Territorial Office, Dr Nuradeen Abdullahi, gave the figure when he received the returnees.\nThe News Agency of Nigeria (NAN) reports that the returnees arrived in Kano in three luxury buses organised by the International Organisation on Migration.\nAccording to him, the returnees are from different parts of Nigeria; some from Kano, Gombe and Anambra states.\nAnother returnee, James Kelechi from Anambra, said that he operated a medicine store before he left Nigeria in search of greener pasture.\n“My business was not moving fine; that was why I decided to travel to Italy in search of greener pasture,’’ he said."
  },
  {
    "headline": "BREAKING: Kidnapped Anambra lawmaker beheaded",
    "summarized_story": "A member of the Anambra State House of Assembly representing Aguata II, Okechukwu Okoye has been beheaded.\nOkoye’s severed head was found on Saturday at Nnobi in Idemili South Local Government Area of Anambra State.\nThe deceased lawmaker, who represented the constituency of the State Governor, Chukwuma Soludo in the State House of Assembly, was kidnapped last week.\nAnambra State Police Public Relations Officer, Tochukwu Ikenga confirmed the discovery of Okoye’s head.\nFollowing his abduction, the police began a manhunt to rescue the lawmaker."
  },
  {
    "headline": "Blasphemy: Bauchi Gov visits Warji, calls for religious tolerance",
    "summarized_story": "Bauchi State Governor, Senator Bala Abdulkadir Mohammed, on Saturday visited Warji, the headquarters of Warji Local Government Area of the state, barely 24 hours after religious violence erupted in the town, urging people of the state to embrace peace and religious tolerance.\nThe said comments resulted in violence, burning of houses and destruction of shops, while some people sustained varying degrees of injuries.\nThose of us who are 60 years old never heard of a crisis in Warji before this time.\nGovernor Mohammed added that the spate of insecurity across the country was enough source of worry for every well meaning Nigerian.\n“My administration has a special regard for peace and religious tolerance and I will not fold my arms to allow unpatriotic people cause trouble in any part of the state,” he vowed."
  },
  {
    "headline": "Deborah Samuel: CAN issues new directive to Christians as Muslims plan counter-protest on Sunday",
    "summarized_story": "The Christian Association of Nigeria (CAN) has made an adjustment to Sunday’s protest over the murder of Deborah Samuel.\nThe religious leader informed them of the plans by Muslims to counter the demonstration.\nThe cleric advised Christians nationwide to pray for justice for Deborah “who was wickedly and extra-judicially slain”.\nThe President prayed that “the Lord be with us all, His Church in Nigeria and our nation who is in birth pains”.\nDeborah, a student of Shehu Shagari College of Education in Sokoto, was stoned and burned last Thursday for blasphemy."
  },
  {
    "headline": "Oyo suspends two health workers over diversion of patient to private facility",
    "summarized_story": "Oyo State government says it has suspended two health workers over the diversion of patients to a private health facility.\nChairman, Oyo State Hospital Management Board, Dr. Gbola Adetunji, who spoke on behalf of the government, said the two affected workers are a Medical officer and a Nursing officer.\nHe said that it was discovered that the two people diverted a patient to a private facility for emergency surgery.\n“The Oyo State Hospital Management Board has suspended two medical officers for diverting a patient to a private facility for surgery.\n“The Board has had several interactive sessions with a cross-section of the health workers, emphasising drastic attitudinal changes in the course of their duties."
  },
  {
    "headline": "Buhari yet to sign Electoral Act Amendment Bill – Presidency",
    "summarized_story": "The presidency has debunked speculations purporting that President Muhammadu Buhari has signed the reviewed Electoral Act Amendment Bill.\nAn online platform had on Saturday, published a story claiming that the President had already signed the bill, which was transmitted to him last week Friday.\nBut sources within the presidency told DAILY POST correspondent that the information was false.\n“I also cannot tell you that he will still sign it or will not sign it.\nBut if it will be signed later, we will all know”, he said."
  },
  {
    "headline": "Deborah Samuel: Soyinka demands sack, trial of Abuja Mosque Imam",
    "summarized_story": "Nobel Laureate Wole Soyinka said yesterday that it was time Nigeria rose above impunity and drew the line against inhumanity.\nSoyinka deplored the recent killing of a student, Deborah Samuel, by a mob in Sokoto for alleged blasphemy, describing it as the latest example of religious-inspired barbarity in the country.\n“We have already paid, and are still paying too high a price for the culture of Appeasement and Impunity.\nLet it end now, in Affirmative Action,” he said, citing previous killings for alleged blasphemy in Kano and Bauchi states.\nHe spoke in Abuja at the launch of the memorial publication on the late Chief of Army Staff, General Ibrahim Attahiru."
  },
  {
    "headline": "UK court seizes £2m cash linked to Jerry Useni",
    "summarized_story": "“Over the next 15 years, money totalling £1.9m was transferred into four accounts held by ‘Mr Shani’ with Standard Chartered Bank,” the publication stated.\n“In response, six months later, ‘Mr Shani’ requested that the entire balance in his existing accounts be transferred to a Nigerian bank, in which it transpires that Gen. Useni was a shareholder.\n“This request was rejected, and in February 2003, the bank was refused permission to operate the accounts by the police’s Joint Financial Crimes Unit.\n“There followed several attempts by Gen Useni’s lawyer to unfreeze the accounts and, in 2007, Gen Useni finally identified himself as the true owner of the Shani accounts.\n“These acts are similar to gifts being provided by Members of Parliament in England or corporate gifts being provided to directors/employees."
  },
  {
    "headline": "Dozens of lawyers to the defence of Sokoto killers",
    "summarized_story": "The two accused were among dozens involved in the lynching of Miss Samuel, a lynching depressingly inspired and orchestrated by her fellow students over unsubstantiated allegations of blasphemy.\nFirst there was no consensus on the issue of blasphemy or the guilt of Miss Samuel.\nIt is inconceivable that only two people were involved in the murder of Miss Samuel.\nIndeed, defence lawyers will focus more on trying to prove a lack of evidence tying the suspects to the crime.\nHopefully, Sokoto State and the federal government are sensitive enough to realise that sweeping this case under the carpet or handling it shoddily will have consequences."
  },
  {
    "headline": "BREAKING: Gunmen behead kidnapped Soludo's lawmaker",
    "summarized_story": "Gunmen have beheaded the lawmaker representing Anambra Governor Charles Soludo in the Assembly.\nHon Okechukwu Okoye’s head was found at Nnobi in Idemili South local government area where it was hanged.\nThe lawmaker was kidnapped last week with one person in his Toyota Sienna car.\nSoludo offered hope of rescuing his lawmaker while presenting Anambra’s revised budget to lawmakers on Friday.\nAnambra Police spokesman Ikenga Tochukwu confirmed that the lawmaker has been killedHe said: “His head was found along Nnobi road today (Saturday)."
  },
  {
    "headline": "Oba of Benin to Tinubu: We’re praying for you to get APC ticket",
    "summarized_story": "Oba of Benin to Tinubu: We’re praying for you to get APC ticketThe Oba of Benin, Omo N’Oba N’Edo Uku Akpolokpolo, Oba Ewuare II, has assured the National Leader of the governing All Progressives Congress (APC), Asiwaju Bola Tinubu, that he and all the people of Benin Kingdom will continue to pray for him to pick APC’s ticket and win the presidential election.\nThe first-class monarch gave the assurance on Saturday evening in his palace while receiving Tinubu and members of his team.\nI have helped to build great institutions and I have been Governor of Lagos State two times.\n“When I took over as Governor, Lagos State was a big slum.\n“I am here (palace of Oba of Benin) to solicit your blessings, to ask for your endorsement and prayers."
  },
  {
    "headline": "Another explosion averted in Kano as police intercept bomb-laden vehicle",
    "summarized_story": "In a related development, another explosion was averted in the state following the interception of a Mercedes Benz-laden with suspected sophisticated Improvised Explosive Devices (IEDs) on Thursday.\nThe police said that acting on intelligence, they went after the ash-coloured vehicle which was coming into the state from Jigawa State.\n“The Commissioner of Police, Kano State Command, Sama’ila Shu’aibu Dikko, immediately raised a crack team comprising Explosive Ordnance Disposal – Chemical, Biological Radiological and Nuclear Defence (EOD-CBRN) and Operation Puff Adder.\n“At about 1630hrs of the same date, following a hot chase, the suspects abandoned the Motor Vehicle at Bubbugaje Quarters Kumbotso LGA Kano State.\nA technical search conducted by the team revealed that the motor vehicle was fully loaded with Improvise Explosive Device materials."
  },
  {
    "headline": "2023 presidency: Youths stage simultaneous nationwide rallies for Yahaya Bello in 23 states",
    "summarized_story": "Youths across the country yesterday made a huge statement on their steadfast support for the candidacy of Governor Yahaya Bello of Kogi State in the 2023 presidential election.\nIt was a simultaneous gathering of massive crowd of youths in over 23 states, across the six geo-political zones of the federation, in a show of force, tagged, “Nationwide Capacity Rally for Yahaya Bello”.\nThe youths chanted solidarity songs while carrying various placards in support of Bello from as early as 9:00a.m in all the locations.\nIn Oyo State, the crowd moved from ShopRite through Ringroad to Challenge, among others, while the Kwara rally started from Kwara State Stadium, Ibrahim Taiwo Road, Ilorin, and moved through Post Office to other parts of the state.\nOther states where the capacity rally held simultaneously were Sokoto, Kebbi, Gombe, Anambra, Cross River, Borno, Kogi, Benue, Kaduna, Taraba, Plateau, Niger, Katsina, Bauchi, and Yobe, Akwa Ibom, Zamfara, among others."
  },
  {
    "headline": "Why I’m still in loggerheads with Gov Uzodimma–Okorocha",
    "summarized_story": "From Romanus Ugwu, AbujaFormer Imo State governor, Owelle Rochas Okorocha, is a reporter’s delight any day anytime.\nThis is the time for the party to assess the individual track records and who they are before deciding.\nIn the contrary, I feel much more qualified to bring victory to our party if given the presidential ticket.\nThe second is that Nigeria needs somebody who understands the problems of this country and can grow the economy.\nAbove all, God loves this country and He is about to do magic thing for this country."
  },
  {
    "headline": "Ex-FCT minister Useni forfeits £1.9 million in Jersey",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe Government of the Bailiwick of Jersey has announced the forfeiture of the sum of £1.9 million by former Minister of the Federal Capital Territory (FCT), Lieutenant General Jeremiah Useni (retd).\nHe had previously served as Military Governor of the defunct Bendel State in 1984 before serving as FCT Minister during the military regime of late General Sani Abacha.\nEarn up to N2 - N3 million monthly GUARANTEED (all paid in US Dollars).\n“Lieutenant General Useni did not attend the forfeiture hearing nor was he represented at the hearing, although he was represented at previous hearings in the case.\n“I will explore with the Government of the Federal Republic of Nigeria how to return these forfeited assets to the people of Nigeria."
  },
  {
    "headline": "Kano: Another explosion averted as police intercept bomb laden vehicle",
    "summarized_story": "From Desmond Mgboh, KanoThe Kano State Police Command confirmed on Saturday that the explosion that killed nine persons in the state on Tuesday was an Improvised Explosive Device, which went off from a shop that stored toxic chemicals and other hazardous materials.\nsix and a half (6.5) cartons of Snuff (Tobacco) and five (5) drums of Polymer (chemical).\nThe statement signed by the Public Relations Officer of the Command, Superintendent Abdullahi Haruna Kiyawa.\nMeanwhile the names of the nine persons who lost their lives to the tragedy have been released by the police .\nThe police added, ” The Commissioner of Police, Kano State Command, Sama’ila Shu’aibu Dikko, immediately raised a crack team comprising Explosive Ordnance Disposal – Chemical, Biological Radiological and Nuclear Defence (EOD-CBRN) and Operation Puff Adder."
  },
  {
    "headline": "Breaking: One Dead, as 2-Storey Building Collapses in Lagos",
    "summarized_story": "Rebecca EjifomaA body, Saturday, has been recovered after a two-storey building under construction collapsed in the heavy rainfall at Freeman Road on Lagos Island, Lagos State.\nWhile the body is yet-to-be identified, one person has been rescued.\nFirst responders currently at the scene include the National Emergency Management Agency (NEMA), the Lagos State Emergency Management Agency (LASEMA) and fire service men.\nMore details shortly…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Just In: Tension in Bauchi, as Religious Fanatics Burn Houses over Alleged Blasphemy",
    "summarized_story": "By Segun Awofadeji in BauchiIrate youths believed to be religious fanatics late Friday evening went on rampage destroying structures belonging to Christians in Katangan Warji, headquarters of Warji LGA of Bauchi State.\nTHISDAY checks revealed that trouble started when unconfirmed reports circulated in the social media that one of the Christian youths in the town allegedly blasphemed against Islam.\nThis is coming a week after a Sokoto student Deborah Yakubu was killed by Islamic fanatics over alleged blasphemy.\nI am speaking to you, efforts are on to save his life as blood is rushing from the wounds inflicted on him”.\nOne of the leaders of the Christian Association of Nigeria in the state confirmed the situation and said the Police Commissioner in the state and the SSA to the Governor on Christian Religious Affairs, had been informed."
  },
  {
    "headline": "Statutory Delegates Lament Loss of Largesse, Elected Delegates Now to Pick Presidential Candidates",
    "summarized_story": "With the president hesitant to sign the amendment, it means only National delegates elected at the local government congresses will determine Presidential flagbearers of the party.\nLikewise, only the five delegates elected from each ward for the state congresses will vote to elect governors, senators, House of Representatives and states’ House of Assembly members for the APC.\nFor PDP, it will be the three delegates elected from each ward.\nAs things stand, the APC will elect its presidential flagbearer with 2322 democratically elected delegates, based on three National delegates per local government area.\nPower to determine those that will emerge as candidates for various elective positions has now returned to the state governors; already, they determined those on the list of elected delegates sent to INEC."
  },
  {
    "headline": "Leaders: Foisting Northern Presidential Candidates, Grave Tragedy",
    "summarized_story": "There are also important cultural exchanges that are vital to our country; we want to appreciate the European Union for that.\nAyu said: “We worry about post elections as a political party.\n“As a political party, we’re having our convention in the next eight days.\nour 15 presidential aspirants.”Ayu also lamented the rising debt of Nigeria, saying when the PDP was in power, Nigeria was a debt-free country.\n“We have also at the request of the Nigerian authorities always deployed electoral observation, to entrench the process of democracy."
  },
  {
    "headline": "Deborah: Tambuwal Lifts Curfew, Bans all Forms of Processions",
    "summarized_story": "The governor also banned all forms of processions in the state until further notice.\nDeborah was killed and her remains were set on fire by the extremists, two of whom have been arrested and arraigned by the Sokoto State Police Command.\n“South-east and Imo State in particular can’t be excluded.\nWe have restored normalcy now in Sokoto State.\nI will be a president for all Nigerians.”A former Governor of Imo State, Emeka Ihedioha, said that Tambuwal was the right person to lead the country after Buhari."
  },
  {
    "headline": "BREAKING: Gunmen Behead Abducted Anambra Lawmaker From Governor Soludo's Constituency, Hang Head In Motor Park",
    "summarized_story": "Gunmen who abducted a member of the Anambra State House of Assembly, Okey Okoye, have beheaded him.\nAfter beheading him, his head was reportedly displayed at a motor park in Nnobi, Idemili South Local Government Area of the state.\n“The Anambra lawmaker representing Soludo’s constituency, Okechukwu Okoye who was earlier kidnapped, has been beheaded by gunmen; the late lawmaker's head was mounted at Chisco Park in Amichi community,” a military source told SaharaReporters on Saturday.\nGunmen had last Sunday abducted the lawmaker who was representing Aguata II state constituency in Aguata alongside Cyril Chiegboka, his campaign director.\nGovernor Charles Soludo had said during the week that efforts were ongoing to rescue the Anambra lawmaker from his abductors."
  },
  {
    "headline": "BREAKING: Gunmen Behead Abducted Anambra Lawmaker From Governor Soludo's Constituency, Hang Head In Motor Park",
    "summarized_story": "Gunmen who abducted a member of the Anambra State House of Assembly, Okey Okoye, have beheaded him.\nAfter beheading him, his head was reportedly displayed at a motor park in Nnobi, Idemili South Local Government Area of the state.\n“The Anambra lawmaker representing Soludo’s constituency, Okechukwu Okoye who was earlier kidnapped, has been beheaded by gunmen; the late lawmaker's head was mounted at Chisco Park in Amichi community,” a military source told SaharaReporters on Saturday.\nGunmen had last Sunday abducted the lawmaker who was representing Aguata II state constituency in Aguata alongside Cyril Chiegboka, his campaign director.\nGovernor Charles Soludo had said during the week that efforts were ongoing to rescue the Anambra lawmaker from his abductors."
  },
  {
    "headline": "EXCLUSIVE: Delta State PDP Party Delegates To Get N100million To Manipulate Forthcoming Primary Election",
    "summarized_story": "Less than 24 hours to the commencement of the Peoples Democratic Party, (PDP) primaries in Delta State, 25 delegates from the Warri North constituency have alleged that they have been promised N4million each to influence the election outcomes.\nSaharaReporters learnt that the money was allegedly courtesy a former chairman of the Delta State Oil Producing Areas Commission (DESOPADEC), Godwin Toritseju Ebosa.\nSince the creation of our constituency, he is the worst ever produced to represent us in the state Assembly.\nBut now, money is involved, many of us will grab the N4million and still vote our conscience for tomorrow’s (Sunday) primary election for the House of Assembly for the Warri North constituency.\nCan you imagine, a state where pensioners are suffering and dying, yet the governor is busy lavishing the state money on frivolous election matters in a bid to have his unpopular candidates installed as the party flag bearers?"
  },
  {
    "headline": "EXCLUSIVE: Delta State PDP Party Delegates To Get N100million To Manipulate Forthcoming Primary Election",
    "summarized_story": "Less than 24 hours to the commencement of the Peoples Democratic Party, (PDP) primaries in Delta State, 25 delegates from the Warri North constituency have alleged that they have been promised N4million each to influence the election outcomes.\nSaharaReporters learnt that the money was allegedly courtesy a former chairman of the Delta State Oil Producing Areas Commission (DESOPADEC), Godwin Toritseju Ebosa.\nSince the creation of our constituency, he is the worst ever produced to represent us in the state Assembly.\nBut now, money is involved, many of us will grab the N4million and still vote our conscience for tomorrow’s (Sunday) primary election for the House of Assembly for the Warri North constituency.\nCan you imagine, a state where pensioners are suffering and dying, yet the governor is busy lavishing the state money on frivolous election matters in a bid to have his unpopular candidates installed as the party flag bearers?"
  },
  {
    "headline": "Police Intercept Vehicles Loaded With Explosives, Weapons In Kano",
    "summarized_story": "The Kano State Police Command on Saturday intercepted a car loaded with bomb-making devices and sophisticated weapons in the state.\nAccording to a police statement, the command's spokesperson, DSP Abdullahi Haruna Kiyawa, who confirmed the incident, said its operatives were still investigating the matter.\nAccording to the PPRO, the command on May 19 through credible Intelligence intercepted a Mercedes Benz carrying sophisticated Improvised Explosive Devices (IEDs), coming from Jigawa State to Kano State.\n“At about 1630hrs of the same date, following a hot chase, the suspects abandoned the Motor Vehicle at Bubbugaje Quarters Kumbotso LGA Kano State.\nA technical search conducted by the team revealed that the motor vehicle was fully loaded with Improvised Explosive Device materials.”“Two (2) AK-47 Rifles, Four (4) AK-47 Magazines, One Thousand and Ninety-Eight (1,098) Live Ammunition, and Two (2) Pistol Magazines were also recovered."
  },
  {
    "headline": "Jonathan: FG's arbitration cases should be heard in Nigeria -- not UK",
    "summarized_story": "Former President Goodluck Jonathan says arbitration hearings for contracts entered by the federal government with international organisations should be heard in Nigeria, not the United Kingdom.\n“All the contracts the Nigeria government entered with international organisations, arbitrations are always done in the United Kingdom.\nCan’t we do some of these arbitrations in Nigeria?” Jonathan asked.\n“I don’t know why it must be the United Kingdom — why it must be outside Nigeria.\n“So, I believe solving disputes outside the courtroom will be a better and shorter way than going through court processes.”"
  },
  {
    "headline": "Jonathan: FG's arbitration cases should be heard in Nigeria -- not UK",
    "summarized_story": "Former President Goodluck Jonathan says arbitration hearings for contracts entered by the federal government with international organisations should be heard in Nigeria, not the United Kingdom.\n“All the contracts the Nigeria government entered with international organisations, arbitrations are always done in the United Kingdom.\nCan’t we do some of these arbitrations in Nigeria?” Jonathan asked.\n“I don’t know why it must be the United Kingdom — why it must be outside Nigeria.\n“So, I believe solving disputes outside the courtroom will be a better and shorter way than going through court processes.”"
  },
  {
    "headline": "Tinubu: If I am elected president, Edo will become as beautiful as Lagos",
    "summarized_story": "Bola Tinubu, former Lagos governor seeking the presidential ticket of the All Progressives Congress (APC), says if he becomes president, he can make Edo state as “beautiful” as Lagos.\nHe said this on Saturday at a meeting with APC delegates in Edo state, ahead of the party’s presidential primary.\nPresent during the meeting were Adams Oshiomhole, former national chairman of the APC, and Ize Iyamu, candidate of the party in the 2020 Edo governorship election.\nAs the president of the Federal Republic of Nigeria, I will give Edo back to you.\nEdo will turn to a beautiful [state] — if not more beautiful — [and] will be equal to Lagos."
  },
  {
    "headline": "Tinubu: If I am elected president, Edo will become as beautiful as Lagos",
    "summarized_story": "Bola Tinubu, former Lagos governor seeking the presidential ticket of the All Progressives Congress (APC), says if he becomes president, he can make Edo state as “beautiful” as Lagos.\nHe said this on Saturday at a meeting with APC delegates in Edo state, ahead of the party’s presidential primary.\nPresent during the meeting were Adams Oshiomhole, former national chairman of the APC, and Ize Iyamu, candidate of the party in the 2020 Edo governorship election.\nAs the president of the Federal Republic of Nigeria, I will give Edo back to you.\nEdo will turn to a beautiful [state] — if not more beautiful — [and] will be equal to Lagos."
  },
  {
    "headline": "Fayemi has capacity to govern Nigeria, says Ortom",
    "summarized_story": "Samuel Ortom, governor of Benue, says Kayode Fayemi, Ekiti governor and chairman of the Nigeria Governors’ Forum (NGF), has the capacity to govern the country.\nOrtom, a governor on the platform of Peoples Democratic Party (PDP), said this on Saturday when he received Fayemi, an All Progressives Congress (APC) presidential hopeful, at the Benue government house.\nFayemi was in the state to consult with APC stakeholders ahead of his party’s presidential primary.\nAdvertisement“All of us are involved and there is the need for us to work together to rescue our nation,” the Benue governor said.\nAdvertisementThe Ekiti governor also said he would address extreme inequality and poverty, which he identified as causes of insecurity."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Disney+ launches in South Africa. Here’s how much it costs",
    "summarized_story": "Earlier in January, the Walt Disney Company confirmed the expansion of its streaming service, Disney+, to 42 new countries, including 6 African countries—Egypt, Morocco, Algeria, Libya, Tunisia, and South Africa.\nDisney+ South Africa’s arm offers users the Standard Plan, at R119 ($7.47)/month or R1,190 ($74.64)/annum.\nOn the service, South Africans will access original Disney content like the Star Wars series and Encanto; and features from the Marvel Cinematic Universe (MCU) like Moon Knight.\nWhile Netflix does have an affordable R49/month Mobile plan in South Africa, the plan only allows 1 user and 1 device.\nThe only Netflix plan similar to Disney+’s Standard R119 plan is Netflix’s Premium plan which costs R199 plan and allows Ultra HD streaming on up to 4 devices."
  },
  {
    "headline": "How Adora Nwodo is making a name for herself in the cloud",
    "summarized_story": "She currently works as a cloud engineer at Microsoft and is the author of Cloud Engineering for beginners.\nAdora Nwodo on cloud engineering and mixed realityKoromone Koroye: Hi Adora, thanks for agreeing to speak with me.\nAdora Nwodo: I am a software engineer currently building mixed reality on the cloud at Microsoft.\nCloud engineers literally do their engineering on the cloud, whether software engineering or DevOps engineering.\nAN: Before I talk about mixed reality, let me briefly explain the difference between augmented reality (AR) and virtual reality (VR)."
  },
  {
    "headline": "TABS is tomorrow! 💃 💃",
    "summarized_story": "💃😉😊 Tomorrow is the Techpoint Africa Blockchain Africa Summit (TABS)!\n😁AdvertisementIf you’ve registered, you’ll see all the fantastic things we’ve packaged just for you tomorrow.\nTikTok to credit creatorsI’ve never used TikTok, but I’m considering signing up.\nJust this month, the company introduced two new features — Pulse and Branded Mission — for content creators to earn money on the app.\nThis feature, a button, allows creators to credit all types of inspiration for their content, like dances, jokes, and viral sounds."
  },
  {
    "headline": "TikTok on a “Branded Mission”",
    "summarized_story": "For more information on this acquisition, listen to today’s episode of the Techpoint Africa Podcast here.\nTikTok to roll out a new ad productTikTok has announced the launch of “Branded Mission,” a new advertising product.\nIn summary, Branded Mission allows emerging and aspiring creators to respond to ad casting calls directly on TikTok.\nBranded Mission is currently in beta testing and is available to brands in over a dozen markets.\nTechpoint Africa Blockchain SummitThe Techpoint Africa Blockchain Summit (TABS 2022) will take place in two days!"
  },
  {
    "headline": "[PODCAST] Tax evasion in Nigeria to get harder",
    "summarized_story": "Share this article:Taxation is not a subject that Nigerians want to talk about, but the Federal Inland Revenue Service (FIRS) is about to make it unavoidable.\nUsing the National Identification Number (NIN), the organisation wants to track financial transactions in the country to tax Nigerians effectively.\nCompared to Q1 2021, the company witnessed impressive growth with revenue growing to $47.6 million, orders growing to 9.3 million, and gross merchandise value hitting $252.7 million.\nWith the company announcing that it had acquired a payment service solution provider license (PSSP), we explored the possibility of the company growing its fintech footprints.\nEmmanuel shared a Technext report that revealed that most car marketplaces in Nigeria made up to 150% profit from car sales."
  },
  {
    "headline": "Binance To Host “Block and Brunch” Networking Event For Professionals In Lagos",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nThe event targets professionals who are crypto newbies and enthusiasts for an afternoon of learning and networking.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Traction Appoints Babatope Oni as Chief Technology Officer",
    "summarized_story": "This article is a Brand Press post.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Leading financial services platform, Traction has appointed Babatope Oni as Chief Technology Officer (CTO).\nI am excited to join the Traction team,” said the new Traction CTO, Babatope Oni.\nTo learn more about Traction, please visit https://tractionapps.co/Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Electoral Act Amendment Bill is yet to be signed – Presidency",
    "summarized_story": "There were strong indications on Saturday that President Muhammadu Buhari was yet to sign the Electoral Act Amendment Bill, contrary to speculations.\nClaims had been published on Saturday, that the President signed the Bill, which was transmitted to him last week Friday.\nRead also: Senate amends Electoral Act to allow president, others vote at party primariesVilla sources note that such an “important Bill could not have been signed in secret”.\nThe President returned to Abuja on Saturday evening, after a two-day visit to the capital of the United Arab Emirates (UAE), Abu Dhabi.\nDuring a short interaction with Zayed Al Nahyan, the new President of the UAE, President Buhari expressed his condolences and that of Nigeria on the demise of the late President Sheikh Khalifah and congratulated the new President on his election."
  },
  {
    "headline": "How Forbes African billionaires contribute to continent’s economic development",
    "summarized_story": "Some 13,500 out of its 14,029 employees serve in South Africa, and all employees are entitled to top notch training and development opportunities.\nName: Koos Bekker #10Industry: Media and entertainmentCompany: NASPERNetworth: $2.7 BillionNasper operates in South Africa, with other major operations in Africa.\nNasper has contributed to relief works in South Africa, partnered with South African youths making waves in the tech, and also invested in companies which have high potential to thrive globally.\nIt also contributed $70 million to its commitment to South African e-commerce site Takealot.\nName: Patrice Motsepe #9Industry: Metals and miningCompany: African Rainbow Minerals (ARM)Networth: $3.1 BillionARM is headquartered in South Africa and operates in South Africa, and Malaysia."
  },
  {
    "headline": "How partnership between school, private industry can boost Nigeria’s tertiary institutions’ IGR",
    "summarized_story": "Tertiary institutions all over the world are regarded as the hub of economic and sustainable national development.\nIn Nigeria, the tertiary institutions are veritable tools for the realisation of socio-economic national development; hence the most powerful and critical success factor for individuals and society.\nAnother engineer advocates for the work job learning education system as a solution to the incessant half-baked graduates coming out of Nigeria’s tertiary institutions.\nRead also: Nigerians rely on unhappy teachers to develop education sector“Internally generated revenue (IGR) can be a very solid means of financing tertiary institutions in Nigeria.\nInternally generated revenue unit in higher institution, therefore, is to serve as a relief to government expenditure,” he stated."
  },
  {
    "headline": "Woman Saved From Gallows in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinteresta white Thorsday made by God– Barr Olayiwola Afolabi based in Benin, Edo State led a team of journalists to Oko Prisons in the city of Benin- He was not on a prison visit to dole out his known provrrbial gifts to the prison inmates-On the contrary, he was at the prison to effect the release of Mrs Enobong Isonguyo who was incarcerated there since 2013 for the suspected murder of her husband Engr Victor Gabriel Isonguyo, a senior director at Nigerian National Petroleum Company in Benin-An Edo High Court judge, Geraldine Imadegbelo, sentenced her to death by hanging alongside their family psstor Udoka Ukachukwu The trial judge accepted that the prosecutor proved the murder case beyond resonable doubt-Counsel to Mrs Enobong lsonguyo , Barr Olayiwola Afolabi, was dissatisfied by the verdict of the judge- Therefore , after legai consultatoon with his client, he got her approval to proceed on appeal- Behold, the court of appeal upheld the ruling of the high court in Benin-Olayiwola Afolabi was not detered by the setback because he was duobly confident he had a good case- Aferall, all the material ingredients of murder alleged against his client had not been fully proven by the prosecutor- Given this fact , it is trite law for the judge to err in freeing her than err in coñdenming her to death that ìs irreversibĺe-Furthrrmore, Olayiwola Afolabi reasoned that total empirical evidence is very critical in determining whether a murder suspect is guilty of the offence- Judges shouid not base their verdicts on absurd fiction , speculation and volatile imagination as it is now the case-According to him, such issues should not arise in law- They are unknown in Nigerian crimminal code-What is more?\nOlayiwola Afolabi discovered that a major pillar of the prosecutor’s case was legally puerile- His evidence linking Mrs Enobong Isonguyo to her husband’s death is the confessional statement of the co-accused Pastor Udoka Ukachukwu – Impliedly, there is no direct evidence associating her with the alleged crime- She was not at the scene of crime neither did the prosecutor provide concrete evidence of her conspiracy in the death of her husband-Based on all these assured lines of legal thought, Olayiwola Afolabi– after due approval of his client– proceeded to the Supreme Court- In a landmark judgment delivered by Justice Mary Odili in April 2022 she overturned the verdicts of both the lower court and court of appeal that sentenced Mrs Enobong Isonguyo to death- She ordered her to be released without any conditions, noting that the two courts miscarried justice in finding her guilty of murder- And, so, Mrs Enobong Isonguyo was saved from the gallows in strict adherence to the dikta of the crimminal còde while ignoring the whims and caprices of the uninformed, laymen in beer parlours-It is to effect the release of Mrs Enobong Isonguyo , in accordance with Justice Mary Odili’s directive, that took Olayiwola Afolabi to Oko Prisons, Benin on May 5, 2022 accompanied by his legal team and a corpus of journalists -After he emerged from the prison with Mrs Enobong Isonguyo, an elated Olayiwola Afolabi eulogized Justice Mary Odili for her fair, upright and monumental judgment which according to him demonstrates that “the judiciary is the last hope of the common man”-On her part, Mrs Enobong Isonguyo fought back tesrs of freedom- Then, she said– “I thank God and my lawyer for everything- I am now an ambassador of Christ-” As she spoke, a big bibie was positioned under her left armpit-Her co- accused Pastor Udoka Ukachukwu — founder of Land Of Evidence Church, Benin–escaped from Oko Prisons, Benin during the ENDSARS protesr in 2020 with his death sentence hanging on his head-The prosecutor in the murder trial in his investigative report tended in court alleged a steaming amorous affairs beteeen Mrs Enobong Isonguyo and Pastor Udoka Ukachukwu resulted in a disputed pregnancy complained about by her husband- Following this, Pastor Udoka Ukachukwu conspired with Mrs Enobong Isonguyo to get her husband out of the way- Thereafter, the pastor killed him while riding one night in the man’s Toyota Corolla car inside which the pastor also burnt him beyond recognition-Mrs Enobong Isonguyo denied any affairs with the pastor- She explained–“He has been very honest to us; so I don’t know what is happening—–God should intervene because I have never committed any crime before in my life- ”Olayiwola Afolabi recommends the landmark judgment of Justice Mary Odili to lawyers and law teachers/ students for use in updating their knowledge in legal jurisprudence on the murder case-Meanwhile, following victory at the Supreme Court in the murder case Olayiwola Afolabi inched his way to achieving the status of SAN- Also, he has shown that diligence , sacrifice, doggedness perseverance and emotive organic solidarity with a client are formidable foundations for building a succesful legal career- Lastly, by saving the life "
  },
  {
    "headline": "Obaseki hails military for support in tackling insecurity, setting up of operative base in Ehor – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has lauded the Nigerian Army for setting up a forward operating base in Ehor, Uhunmwode Local Government Area of the state.\nObaseki gave the commendation while addressing the wife of Chief of Army Staff and President, Nigerian Army Officers’ Wives Association (NAOWA), Mrs. Salamatu Yahaya, who led other members of the association on a courtesy visit, at the Government House, Benin City.\nIt’s our people first because it’s people that create everything first; it’s people that create money, as well as technology, among others.\nIn the case of education, our focus is on the foundation, because once you have a sound foundation, that child can build on that foundation subsequently.\nThe Edo Basic Education Sector Transformation (EdoBEST) is acclaimed as one of the most transparent educational projects on the continent."
  },
  {
    "headline": "Edo urges submission of e-copy of documents to ease application for building plans, permits – Nigerian Observer",
    "summarized_story": "Edo urges submission of e-copy of documents to ease application for building plans, permitsShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has called for electronic submission of processing documents to the Ministry of Physical Planning, Urban and Regional Development to ease and fast track processing of building plans, permits and other approvals.\nCommissioner of Physical Planning, Urban and Regional Development, Isoken Omo, in a statement, said all documents submitted in support of applications for building permits and other approvals from the Ministry must be both hard and electronic copies.\nShe stated that the soft copies should be submitted in a flash drive.\nAccording to her, “This is in line with the state’s implementation of e-governance in service delivery procedures, which mandates electronic processing of documents.\n“The Ministry reiterates that its offices across the state are open for document processing as the Operation Plan Edo (OPE) intensifies and urges adherence to the new guidelines for speedy processing of approvals and permits.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo to screen pensioners in Diaspora via Skype from May 23 – Nigerian Observer",
    "summarized_story": "Edo to screen pensioners in Diaspora via Skype from May 23Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has announced the commencement of revalidation exercise for pensioners resident outside Nigeria.\nIn a statement, Permanent Secretary/Chairman, Edo State Pensions Bureau, Mrs. Aikefe O. Aigbavboa, said the revalidation exercise for pensioners residing outside Nigeria will be conducted virtually, via Skype.\nThe letter should be addressed to the Managing Director, ICT Agency and sent via email to: bvsonline.state@edostate.gov.ng.”“During the Skype screening, pensioners will be required to show their biometric slip and identity cards.\nFor the avoidance of doubt, screening via Skype is strictly for pensioners outside the country,” she added.\n“For further enquiries on the above, pensioners should kindly contact Daniel on 0706 421 4083 (WhatsApp),” she added."
  },
  {
    "headline": "Benue Catholic priest suspended for joining governorship race",
    "summarized_story": "The Catholic Diocese of Gboko, Benue State, has suspended Reverend Father Hyacinth Iornem Alia, for expressing interest in the governorship contest of the state.\nThe priest is among the 12 governorship aspirants who purchased expression of interest and nomination forms of the All Progressives Congress (APC) to participate in the party’s primary election.\nThe letter read, “I write to communicate to you the suspension of my priest, Rev Fr.\n“Therefore, to respond to the spiritual and pastoral needs of the church in the Catholic Diocese of Gboko, I have suspended him from exercise of sacred ministry.\nMoses Orshio Adasu, who served as the second civilian governor of the state went through the same process."
  },
  {
    "headline": "Nigerian Idol: Season 7 winner to go with N100m worth of prizes on Sunday",
    "summarized_story": "Winner of the season 7 of the Nigerian Idol, which ends on Sunday night, will walk away with N100 million worth of prizes.\nThe competition is down to two finalists –Progress and Zadok – vying for the title of ‘Nigerian Idol’.\nWatch the finale on Africa Magic (DStv channel 151), Africa Magic Urban (DStv channel 153), and Africa Magic Family (DStv channel 154).\nVoting on Nigerian Idol is via the website, mobile site, MyDStv, and MyGOtv apps.\nAfrica magic.tv/Nigerian idol, and the Africa Magic mobile site by selecting your winner, entering the number of votes and clicking VOTE."
  },
  {
    "headline": "U.S. Consulate supports 30 emerging fashion designers in Niger Delta",
    "summarized_story": "On Friday, the U.S. Consulate General launched the third cohort of the Field of Skills and Dreams VTE Academy’s Fashion Entrepreneurship Program for 30 emerging fashion designers in the Niger Delta region.\n“Fashion is a multi-billion-dollar industry and a huge contributor to the global economy, creating jobs and economic prosperity,” Foltz said.\n“Succeeding in the fashion industry takes a lot more than passion and creativity.\nThrough the support of the U.S. Consulate, we are empowering emerging fashion designers to not only thrive in Nigeria’s fashion industry but also to prepare for the global fashion marketplace,” Ogunrinde, an alumna of the U.S. government-sponsored International Visitors Leadership Program, said.\nOver the last six months, a diverse group of 100 young Nigerians have participated in three regional capacity-building fashion entrepreneurship workshops in Lagos (40), Enugu (30), and Port Harcourt (30)."
  },
  {
    "headline": "2023: I have experience, I’m the most qualified aspirant – Osinbajo",
    "summarized_story": "By Sunday Oguntuyi, OsogboNigeria’s vice president, Professor Yemi Osinbajo on Friday said among presidential aspirants jostling to succeed President Muhammad Buhari in 2023, he is the most experienced and most qualified to be the next president of the country.\n“I have served in government for seven years, vice president and acting president inclusive.\n“Kabiyesi, I am here to pay homage first, I can’t come to Osogbo and just speak to the party delegates without visiting you.\n“Having served as vice president and acting president knows much about the governance and happenings in the government circle.\nWhen you acted as the vice president, you performed tremendously well."
  },
  {
    "headline": "Osun 2022: Ex-reps deputy speaker, Lasun Yussuf raises alarm over threat to life",
    "summarized_story": "Lasun Yussuf, a former deputy speaker of the house of representatives and governorship candidate of Labour Party in the July 16 election in Osun State, Rt.\nYussuf raised the alarm against the backdrop of his campaign office that was vandalized by suspected political hoodlums.\nAddressing journalist in his campaign office in Osogbo on Friday, Hon.\nYussuf said, happenings in recent times, particularly since he secured the ticket of the Labour Party to contest the July election in Osun State, portend danger to his life.\n!”“Last week some political thugs abruptly stopped my convoy threatening and warning me of several planned attacks if we refuse to back from our gubernatorial campaign."
  },
  {
    "headline": "Nigeria, UAE To Further Extend Bilateral Ties",
    "summarized_story": "President Muhammadu Buhari has expressed his determination to do more to ensure the growth and intensification of the strategic partnership between Nigeria and the United Arab Emirates (UAE).\nAccording to a statement by presidential spokesman, Garba Shehu, in a short interaction with Sheikh Mohamed bin Zayed Al Nahyan, the new ruler of Abu Dhabi and President of the UAE during a condolence visit to the Presidential Palace on Friday, President Buhari expressed his condolences and that of Nigeria on the demise of the late President Sheikh Khalifah and congratulated the new President on his election.\nPresident Buhari expressed the hope that under Sheikh Mohamed, the two countries will continue to actively champion a vision of sustainable security, strengthen counterterrorism cooperation, facilitate trade and investment, and promote prosperity and development.\nIn the seven years of the Muhammadu Buhari presidency, the two countries have actively conducted bilateral dialogues leading to several agreements and Memoranda of Understanding that have paved the way for further cooperation, mutual understanding and progress in many aspects of their bilateral relations."
  },
  {
    "headline": "JUST-IN: Nasarawa LG Chair Kidnapped, Security Escort Killed",
    "summarized_story": "The executive chairman of Keffi local government council of Nasarawa State, Hon.\nMuhammed Baba Shehu, has been kidnapped by unknown gunmen along Akwanga-Keffi highway on Saturday.\nIt was gathered that his personal security guard was killed in the process.\nThe State Police Public Relations Officer (PPRO), ASP Ramhan Nansel, in a telephone interview confirmed the abduction of the chairman by unknown gunmen.\nDetail Later…."
  },
  {
    "headline": "Imo PDP Criticised Over ‘Stipends’ For Delegates – Leadership News",
    "summarized_story": "Barely hours after the Imo State chapter of the Peoples Democratic Party (PDP) issued a directive to aspirants to provide what it termed stipends for delegates, opposition members have condemned their action, saying it is legalisation of vote buying.\nThe PDP State Secretary, Nze Ray Emeana had in a notice to all aspirants titled “Stipends to Delegates” dated May 19th, directed them to provide finances for the transportation of delegates to the different points of election.\nAll state Vice Chairmen of the senatorial districts are directed to appoint monitoring committees to ensure compliance and report any breach to the state party”.\nFormer Dean of the Imo State University and Law Professor, Nnamdi Obiaraeri said the directive was a tacit endorsement of vote buying.\nEfforts to get the reaction of the PDP State Publicity Secretary, Mazi Emenike Nmeregini proved abortive as he didn’t take the calls put across to him."
  },
  {
    "headline": "Imo PDP Criticised Over ‘Stipends’ For Delegates – Leadership News",
    "summarized_story": "Barely hours after the Imo State chapter of the Peoples Democratic Party (PDP) issued a directive to aspirants to provide what it termed stipends for delegates, opposition members have condemned their action, saying it is legalisation of vote buying.\nThe PDP State Secretary, Nze Ray Emeana had in a notice to all aspirants titled “Stipends to Delegates” dated May 19th, directed them to provide finances for the transportation of delegates to the different points of election.\nAll state Vice Chairmen of the senatorial districts are directed to appoint monitoring committees to ensure compliance and report any breach to the state party”.\nFormer Dean of the Imo State University and Law Professor, Nnamdi Obiaraeri said the directive was a tacit endorsement of vote buying.\nEfforts to get the reaction of the PDP State Publicity Secretary, Mazi Emenike Nmeregini proved abortive as he didn’t take the calls put across to him."
  },
  {
    "headline": "Coalition Holds 1m-man March For Peter Obi",
    "summarized_story": "The exercise is anchored by the Coalition for Peter Obi (CPO), which is made up of more than a dozen support groups for Mr Peter Obi.\nIn a statement in Abuja, Chairman of the coalition, Mr Marcel Ngogbehei said that the support groups including, Peter Obi Support Network (POSN), Like Minds for Peter Obi (LMPO), Nigeria Needs Peter Obi (NNPO), TakeBackNaija (TBN), Women for Peter Obi (WPO), Associates of Peter Obi (APO), Peter Obi FC (POFC), Peter Obi movement for president (POMP), Associates of Peter Obi (APO/POE) Peter Obi candidacy movement (POCM), Peter Obi Ambassadors (POA), TeamOHO, among others have been mobilised to ensure the success of the movement on Saturday.\n“The 1 million-Man-March is anchored by Coalition for Peter Obi (CPO), which is made up of more than a dozen different support groups for Mr Peter Obi.\n“All supporters of Peter Obi will participate fully in the march all over Nigeria.\nThe one-million-match is a show of solidarity and love for the credible candidature of Mr Peter Obi."
  },
  {
    "headline": "Buhari keeps politicians on tenterhooks over Electoral Act on Abu Dhabi return",
    "summarized_story": "By Ismaila ChafePresident Muhammadu Buhari has returned to Abuja after a two-day visit to Abu Dhabi, the capital of the United Arab Emirates (UAE).\nThe Nigerian leader returned to Abuja amidst confusion on whether he had signed the Electoral Act Amendment Bill forwarded to him by the National Assembly last week.\nThe amendment is crucial to the participation of statutory delegates at the primaries and national convention of political parties.\nThey have been excluded from voting and being voted for during the exercises in the previous amendment signed into law by the President.\nHowever, NAN reliably gathered that the president had not signed the latest Electoral Act Amendment as being speculated in some quarters."
  },
  {
    "headline": "Lyon thrash Barcelona for UEFA Champions title",
    "summarized_story": "Olympique Lyonnais beat Barcelona 3-1 in the Women’s Champions League final on Saturday with all the goals coming in the first half.\nMidfielder Amandine Henry netted a brilliant solo goal and striker Ada Hegerberg scored one and made another.\nFavourites Barca, who thumped Chelsea in the 2021 final after suffering defeat by Lyon in the 2019 decider, struggled to deal with the French side’s pressure in the opening 45 minutes.\nWith the club’s official Twitter account quickly welcoming the Champions League trophy home, Lyon coach Sonia Bompastor made history as the first to win the competition as both a player and a coach.\n“I think it just came out, we were the team that showed up the most today, and we had the most experience."
  },
  {
    "headline": "BREAKING: One Dead As Building Collapses In Lagos Again",
    "summarized_story": "BREAKING: One Dead As Building Collapses In Lagos AgainOn the Lagos Island district of Lagos State, one person has been confirmed dead when a two-storey building collapsed.\nNEWS DIRECT learned of the incident on Saturday afternoon.\nPrior to its collapse, it was discovered that the building was under construction.\nThe structure on Freeman Road, Lagos Island, collapsed after heavy rain, according to an eyewitness.\nOne person was rescued alive, according to NEWS DIRECT."
  },
  {
    "headline": "Oyetola Bags Vanguard 2021 ‘Governor Of The Year Award’ for Good Governance",
    "summarized_story": "…says ‘award is a challenge to impact more on humanity’In recognition of his achievements and outstanding performance in office, Governor Adegboyega Oyetola of Osun, on Friday night, received yet another award, as he was crowned the Vanguard Newspapers’ Governor of The Year 2021 for Good Governance.\n“Generally, this nomination for the award of Governor of the Year for Good Governance is actually an encouragement award on how the Governor has raised the pedestal of governance for the people of Osun and beyond,” the award organisers added.\nSpeaking shortly after receiving the award, Governor Oyetola thanked the management of the Vanguard Newspaper for recognising the modest achievements his administration had made to transform Osun.\nOther award recipients are: Ogun State Governor, Prince Dapo Abiodun; Edo State Governor, Godwin Obaseki; Nasarawa State Governor, Alhaji Abdullahi Sule; Gombe State Governor, Muhammed Inuwa Yahaya, foremost Legal Luminary, Aare Afe Babalola among others.\nGovernor Oyetola was accompanied to the event by his wife, Mrs. Kafayat, his children, Speaker, Osun House of Assembly, Hon."
  },
  {
    "headline": "BREAKING: Pastor injured, houses burnt as riot erupts in Bauchi over alleged blasphemy",
    "summarized_story": "Riot reportedly broke out in Katangan area of Warji Local Government Area of Bauchi State on Saturday as irate youths reportedly burnt houses and injured a pastor over another case of alleged blasphemy.\nNews Direct gathered that the violence began when a message was allegedly circulated on social media that a Christian girl in the town allegedly engaged in blasphemy of Islam while reacting to the Sokoto incident.\nDetails of the incident are still sketchy as the State’s Police Public Relations Officer, Ahmed Wakili could not take his calls and was unable to reply text messages forwarded to him."
  },
  {
    "headline": "Gunmen Abduct Keffi Local Government Chairman In Nasarawa, Driver, Kill Policeman",
    "summarized_story": "The Chairman of Keffi Local Government Area in Nasarawa State, Hon Muhammad Baba Shehu, has been abducted by gunmen.\nThe incident occurred in the Gudi district of the Akwanga Local Government Area around 6:30pm on Friday.\nThe gunmen also reportedly killed the police orderly of the chairman, Sergeant Alhassan Habibu Nasir.\nThe police sergeant was killed during a shootout with the gunmen.\nThe gunmen reportedly opened fire on his official vehicle as he approached Gudi, killing his police orderly and abducting him and the driver."
  },
  {
    "headline": "Breaking: Police confirm kidnapped Soludo’s lawmaker dead, head cut off",
    "summarized_story": "Anambra state Police command Public Relations Officer, PPRO, Mr Tochukwu Ikenga, has confirmed that kidnapped member representing Aguata two constituency in the state house of assembly Okey Okoye.\nOkoye was said to have been abducted few days ago around his constituency.\nOnly the head of his body was reportedly found in Nnobi, Idemili South local government area of Anambra state.\nMore to come…Share this: TwitterFacebook"
  },
  {
    "headline": "Breaking: For joining governorship contest, Catholic church suspends priest",
    "summarized_story": "For joining the governorship race in Benue state under the platform of the ruling All Progressives Congress (APC), the Catholic Diocese of Gboko has suspended Rev Fr Hyacinth Alia.\nIn a statement released by William Avenya, Bishop of the Diocese, the Catholic Church does not allow her clerics to get involved in partisan politics on their own.\nThe statement stressed that Alia’s move to contest the governorship position of Benue, runs contrary to the vocation of Catholic priests.\n“The Mother church does not allow her clerics to get involved in partisan politics on their own Ex can.\n“Therefore, to respond to the spiritual and pastoral needs of the Church in the Catholic Diocese of Gboko, I have suspended him from the exercise of sacred ministry."
  },
  {
    "headline": "Breaking: Another building collapses in Lagos, 1 confirmed dead",
    "summarized_story": "A two-storey building under construction on Saturday caved in at Freeman Road, Lagos Island.\nAlready, Lagos state Emergency Management Agency, has confirmed that one person was brought dead, while two have been rescued alive.\nLagos state has recorded a number of building collapse in recent times.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "CIBN appoints Fidelity Bank’s Ken Opara as 22nd President",
    "summarized_story": "Fidelity Bank Plc Executive Director, South West and Lagos, Dr Ken Onyewuchi Opara will tomorrow take over the mantle of leadership of the Chartered Institute of Bankers of Nigeria, CIBN.\nDr Opara, who was elected a month ago, will be sworn in as the 22nd President and Chairman in Council of the highly revered Institute.\nA graduate of Finance from the University Of Nigeria, Dr opara has had a distinguished career in banking spanning over 30years.\nHis Bank, Fidelity Bank Plc is one of the leading financial institutions leveraging in this area .\nDr Ken Opara is married with four Children."
  },
  {
    "headline": "Border Demarcation, A Big Challenge In The Curbing Of Petrol Smuggling – Customs",
    "summarized_story": "Deputy Comptroller of Customs, Timi Bomodi, who made known the challenges of Customs in tackling petrol smuggling in the border communities, said the service has been devising strategies to reduce smuggling along Nigeria’sporous borders.\nHe disclosed that the customs service is applying the rules in ensuring that bad eggs within and outside the service are dealt with appropriately.\nHe added that strategies and technology are already reducing petrol smuggling across Nigeria’s borders.\n“Nigeria Customs Service is gradually tilting towards minimizing physical contact in all its activities.\nReacting to the investigation, the Executive Director, Center for Transparency Advocacy, Faith Nwadishi, noted that impunity is the primary reason petrol smuggling is still thriving across Nigeria’s borders."
  },
  {
    "headline": "Gbemi Saraki Takes Charge As Amaechi Bows Out As Transport Minister",
    "summarized_story": "By Naomi DouglasMinister of State for Transport, Senator Gbemi Saraki, has now taken full charge of the Ministry of Transport, follwoing the formal resignation of Frontline presidential aspirant on the platform of All Progressives Congress APC, Chibuike Rotimi Amaechi, yesterday.\nIn a statement issued by Amaechi Presidential Media Committee, APMC, in Abuja yesterday, Amaechi in his resignation letter, expressed profound gratitude to the President for considering him fit to serve in his administration.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\nUnder your administration, the Ministry of Transportation has recorded significant achievements, made possible by your visionary support and commitment to ensuring that we deliver on our mandate.\n“Your Excellency, whilst humbly seeking your kind consideration of my request please accept the assurances of my highest esteem.”"
  },
  {
    "headline": "Delta-2 Progrmme: Nigeria , Czech Republic Flags off $16.2 million Bilateral Co-funding",
    "summarized_story": "By Eunice OrikeAs part of economic diversification priority of the present administration, the Federal Government and Czech Republic has launched a Call for Public Proposals on Delta-2 Programme worth $16.2 million Co-funding Research and Development R&D,project.\nThe Delta-2 Programme is the cooperation model of the Technology Agency of Czech Republic TA CR, running for the period from 2020-2025, through which TA CR sponsors applied research and innovation of manufacturing companies and innovative institutions.\nProf. Mohammed Sani Haruna said the Call for Public Proposal for the Delta-2 programme is one of the projects to be implemented under the Agreement between the two countries.\n“The PICTT would be sourcing technologies from the Czech Republic’s manufacturing companies; tertiary; research; and development institutions.\nThe Delta-2 Programme is uniquely designed to catalyze technology transfer and mobilize positive interventions and investments among private sectors and relevant stakeholders in Nigeria and Czech Republic for technology advancement."
  },
  {
    "headline": "Naira in free fall, now N600 to $1",
    "summarized_story": "By Our CorrespondentThe free fall of our national currency the Naira against major currencies continued yesterday as it weakened against the United States of America dollar to trade at N600 at the parallel market.\nThis non-stop depreciation of the Naira, which incidentally has been officially devalued thrice under this administration, is a pointer that the fiscal policies are not responding to market trends.\nAbubakar, a BDC operator in Ikorodu, told an online medium that buying and selling prices stood at N595 and N600 per dollar.\nA parallel market (street/black market) is characterised by noncompliant behaviour with an institutional set of rules.\nThe Central Bank of Nigeria (CBN) has often maintained that the parallel market is not the true reflection of the naira."
  },
  {
    "headline": "Two Dead As Three-Storey Building Collapses In Lagos During Rainfall",
    "summarized_story": "﻿A three-storey building located at 4, Alayaki Lane, Lagos Island, collapsed in Lagos on Saturday during heavy rainfall, killing at least two persons.\nAccording to the Lagos State Emergency Management Agency, an unconfirmed number of people were still trapped under the rubble.\n“An unconfirmed number of people are still trapped inside the building.\nIn February, a building under construction collapsed in the Yaba area of the state, trapping some workers.\nEarlier this month, no fewer than 10 persons were confirmed dead after a three-storey building collapsed in the Ebute Metta area of the State."
  },
  {
    "headline": "Police Say Kano Explosion Caused By ‘Mixed Chemical And Gas Reactions’",
    "summarized_story": "But in a statement on Saturday, the police said preliminary investigations revealed toxic chemicals and other hazardous materials at the scene of the explosion.\nThe police said arrests have been made in connection with the illicit materials.\nIED loaded carMeanwhile, the police said it has seized a motor vehicle fully loaded with Improvised Explosive Device materials.\nActing based on an intelligence report, the police recovered the motor vehicle after its occupants abandoned it following a hot chase at Bubbugaje Quarters Kumbotso LGA in Kano.\nThe police gave the names of the dead persons as Ejike Vincent (Wielder); Michael Adejo (Chemical Seller); Musa Kalla (Tea Seller); Christiana Abosade; Mary; Austine Dada; Madam Owoleke; Omo Ben; and Bose Oladapo."
  },
  {
    "headline": "Irate Youths Set Houses, Shops Ablaze Over Alleged Blasphemy In Bauchi LG",
    "summarized_story": "Irate youths in Warji Local Government Area of Bauchi State have set houses and shops ablaze, injuring people over what they say is a blasphemous message.\nSpokesperson of the Bauchi Police Command, SP Ahmed Mohammed Wakil, said in a statement on Saturday that the youths “set six houses and seven shops ablaze, while some scores of persons were injured as a result of a blasphemous message posted on social media”.\nAccording to him, the message was posted by one Rhoda Jatau a 40-year-old staff of the Medical Department of Warji Local Government.\n“The Command would like to use this medium to reiterate the need for parents and guardians to maintain strict vigilance over the activities of their wards, particularly youths,” Mohammed said.\nA source in Warji said three people were shot and injured with Dane guns during the violence."
  },
  {
    "headline": "Buhari Pays Condolence Visit To New UAE President, Seeks Stronger Ties",
    "summarized_story": "President Muhammadu Buhari has paid a condolence visit to the new President of the United Arab Emirates and Ruler of Abu Dhabi, Sheikh Mohamed bin Zayed Al Nahyan, on the passing of his predecessor, Sheikh Khalifa bin Zayed Al Nahyan.\nDuring the visit, President Buhari expressed his condolences and that of Nigeria to Sheikh Mohamed and congratulated him on his election as President.\nPresident Buhari also hopes that under Sheikh Mohamed the two countries will continue to actively champion a vision of sustainable security, strengthen counterterrorism cooperation, facilitate trade and investment, and promote prosperity and development.\nPresident Buhari had left Nigeria for the UAE on Thursday, six days after the death of Sheikh Khalifa.\nSheikh Khalifa, who was rarely seen in public died on Friday, May 13 aged 73 after battling illness for several years."
  },
  {
    "headline": "2023: Osinbajo Meets APC Delegates In Zamfara, Katsina",
    "summarized_story": "Ahead of the presidential primary of All Progressives Congress (APC), Vice President Yemi Osinbajo has met with delegates of the party in Zamfara and Katsina states.\nIn Zamfara, Osibanjo met with delegates behind closed doors as journalists were barred from the meeting.\n“In preparatory to the primaries of our party at the end of the month, I’m here to talk to members of our party and we had very fruitful discussions on wide ranging issues, concerning the economy of the country, concerning the future and so many other matters of concern for the party and for the country,” he said.\nIn Katsina, the Vice President also held discussions on issues concerning security, the economy and human capital development, among others, at the Banquet Hall of the General Muhammadu Buhari Government House.\nHe also met with the Katsina State Governor, Aminu Masari."
  },
  {
    "headline": "Gunmen abduct Keffi Council Chairman, kill Orderly in Nasarawa -",
    "summarized_story": "Gunmen have abducted the chairman of Keffi Local Government of Nasarawa State, Muhammed Shehu and his aide Tanimu Mohammed.\nThe police orderly attached to the chairman, Alhassan Habeeb was also killed by the gunmen.\nTVC News gathered that the incident happened along the Akwanga-Keffi-Abuja highway on Friday night.\nMeanwhile, the state Commissioner of Police, Adesina Soyemi has confirmed the incident and assured that his men are on top of the situation."
  },
  {
    "headline": "Osinbajo solicits supports of APC delegates in Osun",
    "summarized_story": "Vice president Professor Yemi Osinbajo has solicited support of delegates from Osun to win the forthcoming presidential primary of the All Progressives Congress.\nProfessor Yemi Osinbajo who was addressing Osun delegates ahead of the primary election on the 29th and the 30th of May promised to restructure the security architecture of the country if elected.\nThe Vice President says he possessed enough experience to hit the ground running and turn things around in all sectors of the economy.\nSpeaking on the number of presidential aspirants under APC from the South, Professor Yemi Osinbajo said consensus option can still be explored.\nProfessor Yemi Osinbajo had on arrival paid a courtesy call on the Ataoja of Osogbo, Oba Jimoh Olaonipekun for Royal blessings."
  },
  {
    "headline": "Buhari appoints Semiu Adeniran as Statistician-General of Federation -",
    "summarized_story": "President Muhammadu Buhari, has approved the appointment of Mr Semiu Adeyemi Adeniran as the substantive Statistician-General of the Federation and Chief Executive Officer of the National Bureau of Statistics (NBS), with immediate effect.\nThis appointment follows the demise of the former Statistician-General of the Federation, Dr Simon Harry, on 13th April, 2022.\nMr Semiu Adeniran is a professional statistician of repute with bias for Demography and Social Statistics.\nHe has over three decades of statistical hands-on experience garnered from various local and international institutions.\nUntil his appointment, Mr Semiu was the Director of Demographic and Household Statistics at the National Bureau of Statistics (NBS)."
  },
  {
    "headline": "Tinubu assures Nasarawa delegates of quality leadership",
    "summarized_story": "The National Leader of All Progressives Congress (APC), Bola Ahmed Tinubu has met with delegates of the party in Nasarawa State ahead of the forthcoming presidential primaries.\nThe National Leader assured the delegates of offering quality leadership when elected.\nFor him, is track records speak volume of his capacity to deliver on his promises."
  },
  {
    "headline": "Mbappé Signs Three-Year Deal at PSG Deal After Rejecting Madrid",
    "summarized_story": "However, a last-ditch effort from PSG to persuade Mbappe to stay proved successful on Saturday, with the forward pledging his future to the Ligue 1 club until 2025.\nMbappe joined PSG from AS Monaco in 2017, with the club eventually paying a world-record fee for a teenager of €180m.\nMeanwhile, PSG look to build a team around the forward to end their wait for a first Champions League trophy.\n“Kylian’s commitment to PSG represents an amazing milestone in the history of our Club, and a wonderful moment for our fans around the world,” club president Al-Khelaifi said.\nIn committing to PSG, he will be the foundation of our Club’s future both on and off the field."
  },
  {
    "headline": "Udom Emmanuel: I’ve Demonstrated Capacity For Leadership And Will Offer All For Nigeria – Arise News",
    "summarized_story": "Governor of Akwa Ibom State and PDP presidential aspirant, Udom Emmanuel, outlines development strides as template for development."
  },
  {
    "headline": "I’m Qualified To Be President But Will Support Anyone Else From The Southeast- Senator Pius Anyim",
    "summarized_story": "Former Senate President and PDP presidential aspirant, Senator Anyim Pius Anyim, speaks about his ambition to be president, Igbo presidency and plans for national development."
  },
  {
    "headline": "Napoli Striker Osimhen Named Serie A Young Player of the Season",
    "summarized_story": "Napoli striker Victor Osimhen has been named the Best Young Player of the 2021-22 Season in Serie A, completing the list of MVPs.\nThe award is for players who are under 23, and Osimhen sneaks in there, having turned 23 in late December 2021.\nDespite missing much of the campaign due to this injury, Osimhen was still named Best Young Player of Serie A for the 2021-22 season.\nThis is his second year at Napoli after joining from LOSC in September 2020.\nWith Osimhen, this completes the five MVPs of Serie A with goalkeeper Mike Maignan (Milan), defender Gleison Bremer (Torino), midfielder Marcelo Brozovic (Inter) and striker Ciro Immobile (Lazio)."
  },
  {
    "headline": "Russia Halts Gas Supplies to Finland as Payments Row with the West Escalates",
    "summarized_story": "GAS DISPUTEMeanwhile, Russia’s Gazprom (GAZP.MM) halted gas exports to neighbouring Finland on Saturday after it refused to agree to Russian demands to pay for Russian gas supplies in roubles because of Western sanctions imposed over the invasion of Ukraine.\nread moreThe move comes days after Finland and Sweden decided to apply to join the NATO military alliance, a decision spurred by the Ukraine war.\nIn addition to trying to isolate Russia through sanctions, Western nations have stepped up weapons supplies to Ukraine since the invasion.\nThe Russian military said on Saturday it had destroyed a major consignment of Western arms in Ukraine’s Zhytomyr region, west of Kyiv, using sea-launched Kalibr cruise missiles.\nPutin says Russian troops are engaged in a “special military operation” to demilitarise Ukraine and rid it of radical anti-Russian nationalists."
  }
]