[
  {
    "headline": "Don’t introduce Sharia in S’West, PFN warns Senate",
    "summarized_story": "He urged the Senate not to succumb to such agitation which he said was capable of further plunging the country into major religious crisis.\nHe said, “The problems confronting our nation are enormous than wanting to create more.\nSharia law is alien to our culture of religious existence in the South-West.\nAccording to him, the Electoral Act should be amended to allow governorship election cases to terminate at the Supreme Court.\nThe same river that feeds them water for everything is the river that they feed their animals with."
  },
  {
    "headline": "Gombe suspends 431 fresh ghost workers’ salaries, saves N27.1m",
    "summarized_story": "The Gombe State Government on Thursday said the salaries of another 431 ghost workers had being suspended following the biometric screening by Integrated Payroll Payment Gateway and Human Resource Information Management System.\nThe suspension of the 431 worker salary in two local governments of Kwami, Gombe and the state Specialist Hospital has saved the state the sum of N27,114,679.\nRecall that in March, salaries of alleged 668 ghost workers were suspended in two local government area, which has saved the state government the sum of N38.3m.\nThe Head of Service, Bapayo Yahaya; and Commissioner for Finance, Muhammad Magaji, made this disclosure in a press briefing, revealing that in Kwami Local Government Area, 44 workers did not show up for enrolment with their salaries amounting to N704,488.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "5 linked to burning of police station arrested in Imo",
    "summarized_story": "Kindly Share This Story:Imo safe – Landlord AssociationBy Chinonso Alozie, OwerriThe Imo state police command says it has arrested five persons allegedly linked to the burning of Orji police division station in Owerri, Imo state.\nThe state Police Public Relations Officer, PPRO, Bala Elkana, stated this to newsmen in Owerri, Imo state.\nThe Commissioner of Police, Imo State, CP Abutu Yaro, FDC personally led an enforcement team to the scene.\n“The whole area was cordoned and five suspects, namely Chigaemezu Sabastine ‘m’ 26years old, Casmir Ibe ‘m’ 36years old, John Chinonso ‘m’ 24years old, Chukwudi Okoro ‘m’ 28years and Alozie Daberechi ‘m’ 25years old were arrested.\nMeanwhile, the mop-up operation is ongoing to arrest more suspects and recover their firearms.”Also read:In another development, the Association of Landlords in Imo state, yesterday said that Imo state is safe."
  },
  {
    "headline": "NIS increases passport production capacity – Babandede",
    "summarized_story": "Kindly Share This Story:The Comptroller-General, Nigeria Immigration Service (NIS), Mr Muhammad Babandede, says the service has increased its production capacity to beat the May 31 deadline set to clear backlog of passport applications.\nBabandede announced this while briefing newsmen on the NIS passport reforms and recruitment exercise on Thursday in Abuja.\nHe said that the passport production centres across the country were working round the clock to clear the backlogs before the commencement of the new passport regime on June 1.\n“The major challenge we have now is not booklet but production capacity and we have added two production lines to Ikoyi and Ibadan centres,” he said.\nOn recruitment, NIS boss said that the current recruitment exercise was the best ever in immigration and assured all applicants of transparency and fairness."
  },
  {
    "headline": "Benue Security Council orders youths of feuding Bonta/Ukpute communities to fish out criminal elements amongst them",
    "summarized_story": "Kindly Share This Story:By Peter Duru – MakurdiThe Benue State Security Council, SSC, has ordered the feuding youths of neighbouring Bonta and Ukpute communities in Konshisha and Oju Local Government Areas, LGAs, of the state respectively, to fish out the criminal elements amongst them to pave the way for lasting peace in the area.\nIt would be recalled that the crisis in both communities recently claimed the lives of 12 military personnel on peace mission in the area.\n“It was resolved that there should be the urgent demarcation of the borders between Bonta and Ukpute communities of Konshisha and Oju Local Government areas respectively.\n“It was also agreed that there is a need to establish a Police post within the area to serve both Bonta and Ukpute communities.\nAnd that the youths should awake and fish out the criminal elements amongst themselves to pave way for sustainable peace in the area.”Faith-based organisations were also charged by the meeting to encourage the communities on the need for peaceful coexistence."
  },
  {
    "headline": "Construction of 4th Mainland Bridge to start in December ― Sanwo-Olu",
    "summarized_story": "Recall that the construction of the bridge is estimated to gulp $2.5 billion after it was reviewed upward from $2.2 billion.\nThe 4th Mainland Bridge is a proposed 38-kilometer long bridge initiative by the Lagos State Government, connecting Lagos Island by way of Lekki, Langbasa, and Baiyeku towns and across Lagos Lagoon to Itamaga in Ikorodu part.\nSpeaking on the proposed construction of the Fourth Mainland Bridge, Sanwo-Olu said the contract is at the final stage of completion as all arrangements set for implementation.\nALSO READ: Emmanuel Fanu emerges acting Registrar of LASUAccording to him: “We, therefore, believe that the construction of the 37km 4th Mainland Bridge will significantly change the face of transportation and movement in Lagos State.\n“On Security, we are currently working with the various state security operatives to determine additional operational and infrastructure needs that the state can support with."
  },
  {
    "headline": "Niger Delta group warns against implementating proposed N385 fuel price increment -",
    "summarized_story": "Kindly Share This Story:By Joseph ErunkeABUJA–A Niger Delta group under the aegis of Ogoni Liberation Initiative,has warned against further action on the proposed N385 fuel price hike, asking the proponents to immediately drop the proposal.\nAccording to him”The problem is that most of our governors are self-centred, lazy and visionless.\n”“They only rely on the federal allocation and do not have any economic plan to drive the economy of their respective states.\n“They cannot pay minimum wage to Nigerian workers yet they want double the current pump price of petrol.\n“We are disappointed at the action and attitude of the governors in taking such a decision that will have adverse effect on Nigerians."
  },
  {
    "headline": "Repatriated fund goes to CBN, not AGF's office",
    "summarized_story": "Amid deep allegations of the whopping N2B paid to his office from the repatriated fund, the Attorney General of the Federation, AGF, and Minister of Justice, Abubakar Malami has clarified that recovered funds are not channelled to his office.\nMalami said that the Federal Government has a designated account at the Central Bank of Nigeria for all recovered assets to be domiciled.\nThere had been widespread accusation that the AGF’s office benefitted to the tune of N2B from the recently repatriated money from the United Kingdom for undisclosed services.\nHowever, the Minister in a statement made available to DAILY POST Thirsday denied the allegations that two billion naira was paid to his office from the recovered funds.\nThe Minister therefore challenged any person who has any evidence of such payments to either petition him or his office and in the alternative come out publicly with proofs."
  },
  {
    "headline": "We have been borrowing from recovered loot",
    "summarized_story": "The Minister of Finance and National Planning, Zainab Ahmed has revealed that the government has been borrowing from recovered loots to fund the budget.\nThe minister also revealed that the government has not been able to repay back the loans taken so far.\nShe revealed this while appearing before the House of Representatives committee investigation recovered loots on Thursday.\n“From the EFCC Account, you took N19 billion.\nYou took a whole N19 billion from the EFCC account and paid an international organization."
  },
  {
    "headline": "Constitution review will not solve Nigeria's problem",
    "summarized_story": "The pan Yoruba Socio-political association, Afenifere, has stated that the move to review the constitution by the Senate will not solve the myriad of challenges confronting Nigeria.\nThe group, which stated this on Thursday, emphasized that the constitution review was an exercise in futility.\nAccording to the General Secretary of the group, Sola Ebiseni during an interview, Afenifere decided not to submit memorandum at the public hearing because the session of the two arms of the National Assembly, since 2007, had embarked on the same jamboree of constitutional amendment spending public funds on public hearings, without any result.\nHe added that Afenifere believed in the restructuring of the country and true federalism as he emphasized that the National Assembly must also be discussed in the process of restructuring.\nHe added the “we cannot claim to be in a democracy and be governed by a constitution that does not emanate by the people."
  },
  {
    "headline": "NCC restates commitment to digital empowerment for young women, girls",
    "summarized_story": "The Nigerian Communications Commission (NCC) has reaffirmed its commitment to the promotion and empowerment of young women and girls in the use of Information and Communication Technology (ICT) in the country.\nThe annual event is an initiative of the International Telecommunication Union (ITU), designed to raise global awareness on empowering and encouraging young women and girls to consider studies and careers in Science, Technology, Engineering and Mathematics (STEM).\nAside the sensitization campaigns held in Abuja, the NCC held similar events, in its zonal offices, across the country in furtherance of its commitment to promote the empowerment of young women through ICT.\nIn the same vein, a Senior Manager at NCC, Yisa Elizabeth, who led the Commission’s team to GSS, Kuje, encouraged young girls to take advantage of the numerous opportunities in ICT for their personal and career development.\nOther locations where the Commission carried out the sensitization include Girls’ Academy Senior Secondary School, Lagos Island and Girls’ Senior Secondary Grammar School, Obalende Keffi, Lagos State; Model Girls’ Secondary School, Rumueme and Government Girls’ Secondary School Rumuokwuta, Port Harcourt, Rivers State; Kano Capital Secondary School (Girls’ section), Matan Fada Road, Nassarawa and Mairo Tijjani Girls’ Science and Technical College, Kano State."
  },
  {
    "headline": "We will enforce anti-open grazing law in Abia",
    "summarized_story": "Governor Okezie Ikpeazu of Abia State has restated the commitment of his administration to the strict enforcement of the anti-open grazing law already passed by the State House of Assembly.\nGovernor Ikpeazu stated that he has express confidence in the ability of The Methodist Church Nigeria in managing the physical, spiritual and mental upbringing of Children and that his administration will keep partnering the church in the academic development of Abia children.\nHe assured that his administration will consider the request of the Prelate for the return by government, of some schools originally owned by the church.\nEarlier in his speech, the Prelate of the Methodist Church Nigeria, His Eminence, Dr Samuel Kalu Uche said that he is an advocate of a Nigeria with true federalism devoid of marginalization of any section or region.\nHe noted that he has been following the Governor’s transformation agenda with remarkable Infrastructural facelift in Aba and other parts of the state."
  },
  {
    "headline": "Tinu’s road to building a trans-generational healthcare practice",
    "summarized_story": "PhysioCraft Allied Health Services, a private physical therapy practice, works with a team of qualified rehabilitation specialists to support clients during their recovery journey.\nIts founder, Tinu Okebukola, a physiotherapist, says her dream is to transform PhysioCraft into a profitable trans-generational healthcare practice that supports families and individuals.\nShe is also working with young talents, empowering and challenging them to use their skills to improve Nigeria’s healthcare indices.\nWith three locations in Lagos, one in Abuja, and plans to hit more locations soon, Tinu said: “The big dream is to have a profitable trans-generational healthcare practice that supports families and individuals in their movement journey.”Tinu, who earned M.Sc.\nExpectedly, the dynamism and innovation Tinu has brought into her practice has not gone unnoticed."
  },
  {
    "headline": "Gales of testimonials as Kwara APC holds town hall to honour Gov",
    "summarized_story": "The All Progressives Congress (APC) in Kwara on Thursday held a town hall meeting attended by various stakeholders amid testimonials of specific impacts the administration of Governor AbdulRahman AbdulRazaq is having on various demographics of the state.\n“Many private businesses especially 34 businesses in Kwara Mall were totally looted during the #EndSARSProtests and the governor, in his magnanimity, called us and he supported us.\nToday, the mall is back and many are indeed stronger now,” he said at the town hall meeting.\nThis administration is doing a lot to better the lots of the people and Governor AbdulRahman AbdulRazaq will not disappoint you,” he said.\nGovernor AbdulRahman AbdulRazaq and Deputy Governor Kayode Alabi attended the well-attended town hall meeting which was streamed live across various social media platforms."
  },
  {
    "headline": "Buhari meets Akufo-Addo in Aso Rock Villa",
    "summarized_story": "By Bolaji Ogundele, AbujaPresident Muhammadu Buhari, on Thursday, met behind closed doors with President Nana Akufo-Addo of Ghana at the Presidential Villa, Abuja.\nAkufo-Addo is chairman of the Authority of Heads of State and Government of the Economic Community of West African States (ECOWAS).\nAkufo-Addo had earlier in the day attended the 2021 ECOWAS Parliament first Extraordinary Session at ECOWAS headquarters, Abuja, where he called on West African leaders to consolidate efforts to root out terrorism from the region.\nHe noted despite best efforts in dealing with the menace by the ECOWAS leaders, there were persistent attempts to destabilise several countries of the ECOWAS community.\nAccording to Akufo-Addo, this has been the case recently in Niger, Mali, Cote d’Ivoire, Burkina Faso and Nigeria."
  },
  {
    "headline": "FG declares 132 violators of COVID-19 travel advisory wanted",
    "summarized_story": "By Bolaji Ogundele, AbujaThe Presidential Steering Committee (PSC) on COVID-19 has declared another 132 travellers, consisting Nigerians and foreigners, wanted for violating a recently issued travel advisory.\nADVERTISEMENTHowever, the committee observed that many travellers had been violating the advisory, leading to earlier announcement of 90 violators as wanted persons on May 9.\n“The Presidential Steering Committee (PSC) on COVID-19 on 1st May, 2021 issued a Travel Advisory for Passengers arriving in Nigeria from Brazil, India and Turkey.\n“Members of the public are by this notice advised that these persons of interest constitute an immediate health hazard to the society.\n“They must therefore transport themselves safely, to the nearest state public health departments within 48hrs of this notice for immediate evaluation and call the Port Health Services, Federal Ministry of Health on 08036134672 or 08032461990 for further directions."
  },
  {
    "headline": "Nigeria on the brinks, Yoruba elders raise the alarm",
    "summarized_story": "From Oluseye Ojo, IbadanYoruba Council of Elders (YCE) has raised the alarm that Nigeria is at the brinks and all and sundry must act in the interest of the country to prevent its disintegration.\nThe elders stated that the 1999 Constitution must be withdrawn and replaced with a new constitution on the grounds that it was not the people’s constitution.\n“The 1999 Constitution is a document deliberately written for the political leadership elite that constitute less than five per cent of the population.\nWill the National Assembly restrict itself out of this opulence state; all the current attempts of the ruling class, elite, the National Assembly in current constitutional amendments?\n“YCE urges that National Assembly, to as a matter of urgency, pass a Halt Bill that will impute referendum into the 1999 Constitution."
  },
  {
    "headline": "Don’t worsen children’s problem with another crisis, UNICEF warns Nigeria",
    "summarized_story": "From Joe Effiong, UyoThe United Nations Children’s Fund (UNICEF) has warned Nigeria not to allow another crisis compound the already precarious condition caused by the COVID-19 for children.\nIn a statement by UNICEF country director, Peter Hawkins, to commemorate the Children’s Day celebration in Nigeria, yesterday, the organisation lamented that the decade-long progress it had made for children in Nigeria had been threatened by coronavirus pandemic.\n“As we rightfully celebrate Nigerian children today, let us also remember that the COVID-19 crisis has been a child rights crisis in Nigeria and around the world.\nOn this Children’s Day, let us all agree that we cannot let one crisis compound another.\nToday of all days, we must commit to reinforce the protection mechanisms for all children.”"
  },
  {
    "headline": "Seven things you need to know about new Army Chief",
    "summarized_story": "The new Chief of Army Staff (COAS), Major General Faruk Yahaya was born on January 5,..."
  },
  {
    "headline": "INEC urges security agencies to curb attacks on its facilities",
    "summarized_story": "From Romanus Ugwu, AbujaThe Independent National Electoral Commission (INEC) met on Thursday with security formations in the country, urging them to put an end continued attacks on its facilities nationwide.\nThe Commission warned that the attacks will disrupt the electoral process, undermine Nigerian democracy and destabilise the country.\nINEC Chairman Prof Mahmood Yakubu issued the warning in Abuja during the emergency meeting with the Inter-Agency Consultative Committee on Election Security (ICCES).\nIn the last two years, the Commission has recorded a total of 41 incidents involving deliberate attacks on the Commission’s facilities,’ the INEC Chairman stated.\nIndeed, these attacks on the Commission’s facilities should now be treated as a national security emergency."
  },
  {
    "headline": "Constitution review public hearing: Senate gets requests for state police, power devolution, new state in S’East",
    "summarized_story": "“We need to have federal, state and community police, with each granted sufficient powers to make them effective in securing the areas assigned to them and cooperating closely with each other.\n•State police, additional states dominate S’East constitution reviewThe public hearing on the review of the 1999 Constitution which kicked off in Owerri, Imo State, yesterday, was dominated by popular agitations for State policing and creation of another State in South East.\n“The truth is that there is no way the National Assembly can amend the 1999 constitution to cure the inherent defects in the 1999 constitution.\nOr can we, by way of amendment, change the Judicial powers of the President under the 1999 constitution?\nIt is a well-known fact that everything about the 1999 constitution is wound around the Presidential system of government."
  },
  {
    "headline": "Emefiele: N35tn Infrastructure Investment Required for Double-digit Growth",
    "summarized_story": "Ndubuisi Francis in AbujaThe Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, has declared that about N35 trillion investment in infrastructure is required for the economy to post a double-digit growth.\nThe Nigerian economy recorded a 0.51 per cent growth in the first quarter of 2021 after a 0.11 per cent growth in the fou rth quarter of 2020.\nHe observed: “While this news is positive, growth is still well below our population growth of 2.7 per cent.\nIt is therefore imperative that we all work together to harness the growth potential of the Nigerian economy.\n“If we take into account Nigeria’s Infrastructure Masterplan, we require close to N35 trillion worth of investment in order to attain double-digit growth."
  },
  {
    "headline": "Buhari: I Will Bequeath a Better Nation to Future Generation",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has pledged his readiness to bequeath a better Nigeria for present and future generations.\nThe President, in a release on Thursday by his spokesman, Garba Shehu, spoke at the State House, Abuja while hosting some children as part of activities to.mark this year’s Children’s Day, with a solemn promise to bequeath a better country for the present and future generations.\nAs part of the activities to commemorate Children’s Day, observed on May 27, the President hosted a group of Nigerian children at the State House.\nDescribing children as precious blessings who should be nurtured to carry the burden of the society in the future, President Buhari, after spending a memorable time with his august visitors, bid them farewell, saying: “Bye-bye, see you next year.”The short ceremony witnessed the cutting of a ‘national cake’, a guided tour of the President’s office, meeting rooms, banquet hall and the zoo at the Presidential Villa.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Buhari Appoints Maj Gen Farouk Yahaya as New Army Chief",
    "summarized_story": "By Kingsley NwezehPresident Muhammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff.\nA statement issued by Defence Headquarters (DHQ) said Yahaya was General Officer Commanding 1 Division of the Nigerian Army.\nThe statement signed by Defence Spokesman, Brigadier-General Onyema Nwachukwu, said the new army chief was the current Theatre Commander, Operation Hadin Kai, formerly Lafiya Dole.\n“The Commander-in-Chief of the Armed Forces of the Federal Republic of Nigeria, President Mohammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff.\n“Prior to his appointment, Major General Yahaya was the General Officer Commanding 1 Division of the Nigerian Army and the incumbent Theatre Commander of the Counter Terrorism Counter Insurgency military outfit in the North East, code named Operation Hadin Kai”, it said."
  },
  {
    "headline": "CONSTITUTION REVIEW… Power Devolution, State Police Demands Dominate Public Hearings",
    "summarized_story": "The two-day public hearings are being organised by the Senate Committee on Constitution Review.\nLagos State Governor, Mr. Babajide Sanwo-Olu, canvassed a special status for the state, which hitherto hosted the nation’s capital.\nIn his remarks, the Kaduna State Governor, Mallam Nasir el-Rufai, reiterated calls for devolution of powers.\nIn a memorandum, he submitted for Abia State, the Chief of Staff to Abia State Governor, Mr. ACB.\nIn Jos, the Plateau State Governor, Mr. Simon Lalong, expressed the hope that the constitution review would help in addressing the security challenges in the state and other parts of the country."
  },
  {
    "headline": "NNPC Seeks to Acquire 20% Stake in Dangote Refinery",
    "summarized_story": "Yakubu said discussions were already ongoing with the Dangote Group for the acquisition of the stake.\nHe said: “We have what we call the green field refinery and the Greenfield Refining Projects Division (GRPD) of the NNPC.\n“At the moment, we have Dangote Refinery, which is the 650,000 capacity barrels per day plus a mini 80,000 tonnes per annum petrochemical plant.\nI can tell you today that we are seeking to have a 20 per cent minority stake in Dangote Refinery as part of our collaboration and you know that there’s a huge quantity of crude for that refinery.\nHe added that the agency would rather want more royalties than penalties as a business enabler and a revenue generator."
  },
  {
    "headline": "Bobrisky Is Risky, Buhari Regime Warns Travellers, Tourists",
    "summarized_story": "The President Muhammadu regime has warned tourists and travellers to be wary of Nigerian crossdresser, Okuneye Idris Olarenwaju, aka Bobrisky.\nThe health hazard Bobrisky has is worse than Ebola Virus Disease; travellers and tourists should be careful wherever they notice the presence of Bobrisky, mostly as it affects sharing of public facilities.\nNow, Bobrisky will enter the same toilet with a woman and at the end the woman will contract some kind of diseases.\n“If Bobrisky is even using men’s toilet, we can understand.\nAs I speak, we got a report of how a woman was very upset with the Federal Airports Authority of Nigeria because on this day she saw Bobrisky using female toilet in Abuja airport."
  },
  {
    "headline": "Bobrisky Is Risky, Buhari Regime Warns Travellers, Tourists",
    "summarized_story": "The President Muhammadu regime has warned tourists and travellers to be wary of Nigerian crossdresser, Okuneye Idris Olarenwaju, aka Bobrisky.\nThe health hazard Bobrisky has is worse than Ebola Virus Disease; travellers and tourists should be careful wherever they notice the presence of Bobrisky, mostly as it affects sharing of public facilities.\nNow, Bobrisky will enter the same toilet with a woman and at the end the woman will contract some kind of diseases.\n“If Bobrisky is even using men’s toilet, we can understand.\nAs I speak, we got a report of how a woman was very upset with the Federal Airports Authority of Nigeria because on this day she saw Bobrisky using female toilet in Abuja airport."
  },
  {
    "headline": "REPORTER'S DIARY: 'Who Did You Come To See?' — A Visit To The 'Racist' Shi Shi Chinese Restaurant In Lagos",
    "summarized_story": "SaharaReporters visited Shi Shi Chinese restaurant on Thursday due to multiple allegations of racism towards Nigerian visitors to the restaurant, located at 21B, Emina Crescent, off Toyin Street, Ikeja, Lagos.\nOur ExperienceOn arriving Shi Shi, tucked away in a residential area in Ikeja, we approached the gate.\nThe security guard looked as if he was contemplating a response, but seemed to think twice about it and stepped back.\nThe team proceeded (we came disguised as a company of people who had come to hang out).\nShe beckoned to another lady (Chinese) and spoke something to her in their language, while motioning at us."
  },
  {
    "headline": "REPORTER'S DIARY: 'Who Did You Come To See?' — A Visit To The 'Racist' Shi Shi Chinese Restaurant In Lagos",
    "summarized_story": "SaharaReporters visited Shi Shi Chinese restaurant on Thursday due to multiple allegations of racism towards Nigerian visitors to the restaurant, located at 21B, Emina Crescent, off Toyin Street, Ikeja, Lagos.\nOur ExperienceOn arriving Shi Shi, tucked away in a residential area in Ikeja, we approached the gate.\nThe security guard looked as if he was contemplating a response, but seemed to think twice about it and stepped back.\nThe team proceeded (we came disguised as a company of people who had come to hang out).\nShe beckoned to another lady (Chinese) and spoke something to her in their language, while motioning at us."
  },
  {
    "headline": "REPORTER'S DIARY: 'Who Did You Come To See?' — A Visit To The 'Racist' Shi Shi Chinese Restaurant In Lagos",
    "summarized_story": "SaharaReporters visited Shi Shi Chinese restaurant on Thursday due to multiple allegations of racism towards Nigerian visitors to the restaurant, located at 21B, Emina Crescent, off Toyin Street, Ikeja, Lagos.\nOur ExperienceOn arriving Shi Shi, tucked away in a residential area in Ikeja, we approached the gate.\nThe security guard looked as if he was contemplating a response, but seemed to think twice about it and stepped back.\nThe team proceeded (we came disguised as a company of people who had come to hang out).\nShe beckoned to another lady (Chinese) and spoke something to her in their language, while motioning at us."
  },
  {
    "headline": "Abidemi Rufai, suspended aide to Ogun governor, indicted for '$350k fraud' in US",
    "summarized_story": "Abidemi Rufai, a senior special assistant to Dapo Abiodun, governor of Ogun, has been indicted for alleged conspiracy, wire fraud, and aggravated identity theft.\nAdvertisementRufai was arrested at the JFK airport in New York on May 14 over alleged $350,000 unemployment benefits fraud.\nA criminal complaint was filed against Rufai for allegedly stealing over $350,000 in unemployment benefits from the Washington State employment security department (ESD).\n“Rufai is now charged with conspiracy to commit wire fraud, nine counts of wire fraud, and five counts of aggravated identity theft,” the statement reads.\nRufai, who was appointed in August 2020, has since been suspended by the Ogun state governor following his arrest."
  },
  {
    "headline": "Abidemi Rufai, suspended aide to Ogun governor, indicted for '$350k fraud' in US",
    "summarized_story": "Abidemi Rufai, a senior special assistant to Dapo Abiodun, governor of Ogun, has been indicted for alleged conspiracy, wire fraud, and aggravated identity theft.\nAdvertisementRufai was arrested at the JFK airport in New York on May 14 over alleged $350,000 unemployment benefits fraud.\nA criminal complaint was filed against Rufai for allegedly stealing over $350,000 in unemployment benefits from the Washington State employment security department (ESD).\n“Rufai is now charged with conspiracy to commit wire fraud, nine counts of wire fraud, and five counts of aggravated identity theft,” the statement reads.\nRufai, who was appointed in August 2020, has since been suspended by the Ogun state governor following his arrest."
  },
  {
    "headline": "FULL LIST: FG names 132 travellers who 'violated' COVID protocol",
    "summarized_story": "The presidential steering committee (PSC) on COVID-19 has released a second batch of names of travellers who reportedly violated the protocol for international passengers.\nAdvertisementOn May 23, the PSC had released the names of 90 travellers, who were accused of violating the protocol on mandatory self-siolation for passengers from Brazel, Turkey, and India.\nThe federal government had mandated travellers who arrived Nigeria within 14 days of visiting the three countries to embark on isolation.\nHowever, according to the PSC, the 132 passengers listed on Thursday came in through the Nnamdi Azikiwe international airport in Abuja and refused to embark on isolation.\nAdvertisementThe travellers have, however, been directed to report to the nearest government health facility within the next 48 hours."
  },
  {
    "headline": "FULL LIST: FG names 132 travellers who 'violated' COVID protocol",
    "summarized_story": "The presidential steering committee (PSC) on COVID-19 has released a second batch of names of travellers who reportedly violated the protocol for international passengers.\nAdvertisementOn May 23, the PSC had released the names of 90 travellers, who were accused of violating the protocol on mandatory self-siolation for passengers from Brazel, Turkey, and India.\nThe federal government had mandated travellers who arrived Nigeria within 14 days of visiting the three countries to embark on isolation.\nHowever, according to the PSC, the 132 passengers listed on Thursday came in through the Nnamdi Azikiwe international airport in Abuja and refused to embark on isolation.\nAdvertisementThe travellers have, however, been directed to report to the nearest government health facility within the next 48 hours."
  },
  {
    "headline": "I never received N2bn from recovered loot, Malami replies reps",
    "summarized_story": "Abubakar Malami, attorney-general of the federation (AGF), has denied the allegation that N2 billion was paid to his office from recovered loot.\nAdvertisementThe house of representatives ad hoc committee probing the status of recovered loot had on Tuesday queried Malami on the N2 billion which it said was never approved as budgetary allocation.\nHe said all looted funds recovered so far have been applied in accordance with the agreements reached with nations from which the funds are repatriated.\nHe said the federal government has a designated account at the CBN for all recovered assets.\n“Malami has neither, as a person, nor as the attorney-general of the federation and minister of justice, not in any way received any funds from the recovered assets,” the statement reads."
  },
  {
    "headline": "How can you make your company hack-proof? These five experts know.",
    "summarized_story": "Adeoluwa, Daniel, Joseph, Sophina and Nick will be discussing how you can protect your organization and customers from online fraud.\nAdeoluwa is a skilled Information Security Professional.\nHe is responsible for building the backend infrastructure, driving product roadmap, leading the technical team and driving company strategy.\nSophina is a cybersecurity professional currently working with a leading financial services firm.\nHe has over 13 years experience in the technology industry and has worked for multinational, leading technology companies."
  },
  {
    "headline": "GovTech In Nigeria: From Regulatory Maze to Models of Good Practice",
    "summarized_story": "Nigerian public procurement and regulation can be labyrinthine, but recent policy reforms and the model of good practice provided by Kaduna State hint at opportunities for public-purpose innovation to flourish in the country.\nIt has also mandated Nigerian companies with large public sector IT contracts to engage Nigerian startups as R&D partners on the projects.\nBut the Federal Government need not look far for inspiration; it can take a page out of the Kaduna State Government (KDSG)’s Govtech playbook.\nAccording to the World Bank’s latest subnational Doing Business ratings, Kaduna is the most accessible state to register property and get contracts enforced in Nigeria.\nKaduna’s example is an exciting preview of what could be should the Federal Government follow through on a promising start."
  },
  {
    "headline": "OPay in talks to raise $400 million from investors at $1.5bn valuation to finance expansion plans",
    "summarized_story": "OPay is reportedly in talks to raise $400 million from investors at a valuation of $1.5 billion, according to an exclusive report from The Information.\nOPay is looking to raise funding to finance its expansion plan, having launched in Egypt this year.\nAn Africa-focused company with Chinese backersWhile OPay is based in Nigeria, its backers are mostly Chinese companies like Meituan, a multi-billion-dollar Chinese shopping platform.\nIn July 2019, OPay raised $50 million from Sequoia Capital, IDG Capital, Source Code, GSR Ventures and Meituan-Dianping.\nYet, should they successfully raise $400 million, it will be the kind of war chest that makes anything possible."
  },
  {
    "headline": "Brand Africa Ranks TECNO 6th on the Most Admired brands in Africa List",
    "summarized_story": "– In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nWhen TECNO launched dual SIM cards in Africa, there had been nothing of the kind before then.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "How OctaFX became the first financial company in Nigeria to organise a cooking session for Ramadan",
    "summarized_story": "OctaFX brought two popular bloggers together in a cooking studio: the comedian Apaokagi Maryam and the music video director Abdulazeez Greene.\nThey prepared a special evening meal for Ramadan called Iftar and compared the subtleties of cooking with those ingrained in trading.\n‘Ramadan Special’ is the first cooking show in Nigeria produced by a financial company.\nApaokagi Maryam is a frequent collaborator of the global Forex broker and took part in the last OctaFX Goal Booster promotion.\nThe company is aspiring to create more shows like ‘Ramadan Special’ in the future."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "What’s the fate of Nigerian fintech following banking regulator’s fresh regulations?",
    "summarized_story": "The new requirements apply to companies registered with the Corporate Affairs Commission (CAC) and wish to apply for new licences or renew old ones.\nThese requirements relate to licences for Switching and Processing, Mobile Money Operators (MMOs), Payment Solution Services (PSSs), Super Agent, Payment Solution Service Providers (PSSPs), and Payment Terminal Service Providers (PTSPs).\nSwitching and Processing, PSSPs, PTSPs, and Super Agent (super licence) — no longer apply: ₦3 billion reduction in minimum SHF, ₦1,900,000 reduction in application fees.\nMMOs, Non-Bank Merchant Acquiring, and Super Agent (standard licence) — no longer apply: ₦1 billion reduction in minimum SHF, ₦900,000 reduction in application fees.\nPSSPs, PTSPs, and Super Agent (basic licence) — no longer apply: no change in minimum SHF, no change in application fees."
  },
  {
    "headline": "What’s the fate of Nigerian fintech following banking regulator’s fresh regulations?",
    "summarized_story": "The new requirements apply to companies registered with the Corporate Affairs Commission (CAC) and wish to apply for new licences or renew old ones.\nThese requirements relate to licences for Switching and Processing, Mobile Money Operators (MMOs), Payment Solution Services (PSSs), Super Agent, Payment Solution Service Providers (PSSPs), and Payment Terminal Service Providers (PTSPs).\nSwitching and Processing, PSSPs, PTSPs, and Super Agent (super licence) — no longer apply: ₦3 billion reduction in minimum SHF, ₦1,900,000 reduction in application fees.\nMMOs, Non-Bank Merchant Acquiring, and Super Agent (standard licence) — no longer apply: ₦1 billion reduction in minimum SHF, ₦900,000 reduction in application fees.\nPSSPs, PTSPs, and Super Agent (basic licence) — no longer apply: no change in minimum SHF, no change in application fees."
  },
  {
    "headline": "These 11 startups are preparing African kids for the future",
    "summarized_story": "Nine million African girls between the ages of 6 and 11 will never go to school compared to 6 million African boys.\nNigeria, on the other hand, has just 3% of school-age children able to access the Internet at home despite having more edtech startups than any other African country.\nThe sector has grown consistently, with a Briter Bridges report stating that there are over 210 edtech startups on the continent as of Q1 2020.\nListed in no particular order below are 11 randomly selected edtech startups you should check out.\neLimuThe Kenyan edtech startup’s name means education in Swahili, and it creates educational apps and content for students in primary school."
  },
  {
    "headline": "These 11 startups are preparing African kids for the future",
    "summarized_story": "Nine million African girls between the ages of 6 and 11 will never go to school compared to 6 million African boys.\nNigeria, on the other hand, has just 3% of school-age children able to access the Internet at home despite having more edtech startups than any other African country.\nThe sector has grown consistently, with a Briter Bridges report stating that there are over 210 edtech startups on the continent as of Q1 2020.\nListed in no particular order below are 11 randomly selected edtech startups you should check out.\neLimuThe Kenyan edtech startup’s name means education in Swahili, and it creates educational apps and content for students in primary school."
  },
  {
    "headline": "Optimism over economic recovery despite weak numbers",
    "summarized_story": "The last few days have brought to the fore three weak numbers that have pointed to the recovery of the Nigerian economy, which sluggishly exited recession in the fourth quarter of 2020.\nStarting from the latest, these numbers include the Manufacturing Purchasing Managers’ Index (PMI), which grew to 49.0 index points in April 2021 from…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Energy-poor Africa makes case against exiting oil",
    "summarized_story": "As opposition to fossil fuel mounts in Western countries, African experts are standing up against efforts by Western countries to curb crude oil production as a way to protect the environment.\nThe International Energy Agency (IEA), a Paris-based think tank that advises Western countries on their energy policies, on May 18 released a roadmap outlining…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "High input costs, insecurity, climate change take toll on food prices",
    "summarized_story": "The high cost of farm inputs, insecurity, and climate change are responsible for rising food prices in Africa’s most populous country, making it increasingly hard for Nigerian households to buy tomatoes, rice, beans, and other staple foods.\nInput prices ranging from improved seeds, fertilizers, herbicides, pesticides, and poultry feeds are high as a result of…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Edo govt, UN strengthens collaboration to combat COVID-19, illegal migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, met with a delegation of the United Nations to bolster the government’s efforts at containing the coronavirus (COVID-19) pandemic and further reduce the menace of irregular migration.\nThe delegation, headed by the United Nations Resident and Humanitarian Coordinator, Mr. Edward Kallon, was received at Government House in Benin City.\nPhilip Shaibu, reaffirmed the government’s commitment to containing the pandemic and curbing irregular migration among youths in the state.\nHe noted that the present administration of Governor Obaseki is putting in place reforms and policies to ensure a business-friendly environment to attract investment into the state.\nHe noted that a part of the aim for the visit was to discuss ideas that would put an end to irregular migration among youths in Edo."
  },
  {
    "headline": "Children’s Day: We must build strong institutions to assure better future for our children – Obaseki – Nigerian Observer",
    "summarized_story": "Children’s Day: We must build strong institutions to assure better future for our children – ObasekiShare FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has assured that his administration will sustain ongoing reforms to strengthen public institutions to guarantee a sustainable future for children in the state.\nThe governor made the submission in a statement to mark the 2021 Children’s Day celebration, adding that his administration will continue to implement policy reforms to benefit children in the state.\nHe said, “I am delighted to mark this year’s Children’s Day and celebrate our children, who are the future of Edo State and Nigeria.\n“Our children remain the most important stakeholders in the Nigerian project and all our developmental efforts must be geared towards building a vibrant country with critical institutions and structures to assure a better future for them.”According to him, “In Edo State, children are beneficiaries of very pragmatic reforms that we have undertaken in the education sector over these past four years.\nI wish all Edo children a very happy Children’s Day!!"
  },
  {
    "headline": "Ambrose Alli Varsity: Obaseki sets up special intervention team with Olotu as chair – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has appointed a Special Intervention Team to exercise all the powers and functions of the Governing Council of Ambrose Alli University in accordance with the provisions of the Ambrose Alli University (Special Intervention Powers) Law 2021, except with respect to the appointment and removal of Principal Officers.\nThe Special Intervention Team is chaired by the Managing Director of Schlumberger Nigeria Ltd, Mr. Andrew Olotu.\nOther members of the Special Intervention team include Bar.\nPatrick E. Inegbedion, Mr. Uyi Izekor, Prof. Esther Ikuoria, Mrs. Imo Okundaye, Mr. Emmanuel Etomi, Mr. Osen Iyahen, Mr. Yusuf Mohammed, Comr.\n“This Special Intervention Team shall exercise all the powers and function of the Governing Council of the University as contained in the Ambrose Alli University Law 1999 (as amended) except with respect to the appointment and removal of Principal Officers.”..."
  },
  {
    "headline": "EDSG pledges to pay outstanding emoluments of AAU Staff – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEKPOMA – Edo State Government has pledged to pay the emoluments, including Cheque off dues of the striking workers of the Ambrose Alli University, (AAU), Ekpoma, Edo State, as soon as they return back to work.\nHe declared that the vision of the state governor, Mr. Godwin Obaseki was to reposition the university, and address the issues militating against the progress of the state owned institution.\nHe solicited the support of the monarch and his community, promising the traditional ruler that he would not disappoint him.\n“I have no issue with with the decision of governor, since the decision is to move the university forward.\nThough the university in Ekpoma, it is a state owned university”, the monarch said."
  },
  {
    "headline": "Wike pledges N600 million for Akwa Ibom hospital project- Official",
    "summarized_story": "ADVERTISEMENTThe Rivers State Governor, Nyesom Wike has reportedly pledged N600 million to the Akwa Ibom State Government in support of the building of a hospital in the state.\nThe hospital project – Akwa Ibom State University Teaching Hospital – is located in Awa, Onna Local Government Area of the state.\nThe hospital project is a partnership between the Akwa Ibom Government and Bua Group which announced an initial support of N2.5 billion for the project, the Akwa Ibom State Government said in a statement.\nThe oil-rich Rivers State shares a boundary with Akwa Ibom, another state that is also rich in petroleum oil.\n‘Akwa Ibom, Niger Delta safe for investors’Mr Wike, while in Akwa Ibom, also performed a groundbreaking ceremony for Sterling Petro-Chemicals and Fertiliser Production plant in Eastern Obolo."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "NNPC records N39.8bn trade surplus in February",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) says it has recorded N39.85 billion trading surplus for the month of February 2021.\nTrading surplus or trading deficit is derived after deduction of the expenditure profile from the revenue for the period under review.\nThe figure represents a 314.24 per cent rise from the N9.62billion surplus it recorded in January 2021.\nThis is contained in the February 2021 edition of the NNPC Monthly Financial and Operations Report (MFOR).\nThe Corporation attributed the significant increase in trading surplus mainly to reconciled accounts by the Corporation’s downstream subsidiary, the Petroleum Products Marketing Company (PPMC), using the Petroleum Products Pricing Regulatory Agency (PPPRA) pricing template."
  },
  {
    "headline": "NNPC in talks to acquire 20% stake in Dangote Refinery",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) has initiated talks with the Dangote Group about purchasing a 20 percent minority equity stake in its 650,000 barrels per day (bpd) refinery, ThisDay reports.\nMustapha Yakubu, NNPC chief operating officer, refining and petrochemicals, disclosed this on Wednesday at the 2021 edition of the Nigerian Oil & Gas Opportunity Fair (NOGOF), the report said.\n“We have what we call the green field refinery and the Greenfield Refining Projects Division (GRPD) of the NNPC.\n“At the moment, we have Dangote Refinery, which is the 650,000 capacity barrels per day plus a mini 80,000 tonnes per annum petrochemical plant.\nI can tell you today that we are seeking to have a 20 per cent minority stake in Dangote Refinery as part of our collaboration and you know that there’s a huge quantity of crude for that refinery."
  },
  {
    "headline": "LG leveraging on AI, Inverter Compressor to Deliver Next Generation of Premium ACs",
    "summarized_story": "In the residential air conditioners market, some of the products that the company has achieved remarkable innovation success are the ARTCOOL and DUALCOOL Premium Air Conditioners.\n“LG DUALCOOL Premium Air Conditioners are equipped with dual premium design and unique features such as Smart ThinQ, ice & custom cooling and energy saving.\nLG ARTCOOL product is equipped with sympathetic artificial intelligence which notifies the user of the driving mode that changes according to the situation without a customer’s question and tells the necessary information.\nCompared to general cooling of 10.8℃ in average, LG DUALCOOL Premium Air Conditioner blows 6.8℃ wind in average to provide instant cooling when it is turned on.\nLG Inverter ACs available in Nigeria today include ARTCOOL 2.0HP; DUALCOOL 1.5HP; ARTCOOL 1.5HP; DUALCOOL 2.0HP and many others."
  },
  {
    "headline": "Breaking: Buhari names Farouk Yahaya new Chief of Army Staff",
    "summarized_story": "OBINNA EZUGWUNigeria’s president, Muhammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff.\nHe replaces Lt General Ibrahim Attahiru, who died in an air crash last Friday.\nAmong other posts, Yahaya was the Theater Commander of Operation Lafiya Dole (OPLD) in Maiduguri.\nHe took over from Maj.-Gen. Olusegun Adeniyi, who was redeployed to the Nigerian Army Resource Centre as Senior Research Fellow.\nHe is from Sokoto State, North West Nigeria."
  },
  {
    "headline": "Security Agents Rescue 14 Kidnap Victims At Byhazin-Bwari Hills In Abuja",
    "summarized_story": "Operatives of the Nigeria Police Force in collaboration with the Department State Service (DSS) and local hunters have successfully rescued 14 victims kidnapped at Gauraka area of Niger State during a joint operation at Byhazin-Bwari axis in FCT Abuja.\nThe Joint Operation led by the FCT command’s anti-kidnapping squad combed the forest, engaged in a fierce gun duel with suspected kidnappers, dislodged them and arrested two kidnap suspects while others escaped with bullet wounds.\nFCT PRO, ASP Yusuf Mariam, said exhibits recovered from the kidnappers’ den are two AK-47 magazines and cooking utensils.\nAccording to her, “the victims who appeared frail after several days in captivity are currently receiving medical attention at the Police medical facility.\nBala Ciroma wishes to reassure FCT residents of the Command’s undeterred resolve towards the protection of lives and property within the FCT , through continuous partnership with sister security agencies and key community stakeholders."
  },
  {
    "headline": "Security Agents Rescue 14 Kidnap Victims At Byhazin-Bwari Hills In Abuja",
    "summarized_story": "Operatives of the Nigeria Police Force in collaboration with the Department State Service (DSS) and local hunters have successfully rescued 14 victims kidnapped at Gauraka area of Niger State during a joint operation at Byhazin-Bwari axis in FCT Abuja.\nThe Joint Operation led by the FCT command’s anti-kidnapping squad combed the forest, engaged in a fierce gun duel with suspected kidnappers, dislodged them and arrested two kidnap suspects while others escaped with bullet wounds.\nFCT PRO, ASP Yusuf Mariam, said exhibits recovered from the kidnappers’ den are two AK-47 magazines and cooking utensils.\nAccording to her, “the victims who appeared frail after several days in captivity are currently receiving medical attention at the Police medical facility.\nBala Ciroma wishes to reassure FCT residents of the Command’s undeterred resolve towards the protection of lives and property within the FCT , through continuous partnership with sister security agencies and key community stakeholders."
  },
  {
    "headline": "PEARL Collaborates With Canadian Energy Firm To Boost Nigerian Oil And Gas Industry",
    "summarized_story": "This has been made possible by its partnership with global energy solutions provider, Canadian Energy Solutions (CES).\nIt will increase local production, create job opportunity and improve our foreign exchange reserve position.\nFounded in 2001, CES Energy Solutions has extensive testing capabilities for corrosion, scale, hydrogen sulphide scavenger and other production related requirements.\nThe company will provide technical assistance to PEARL who is the exclusive representative for production chemicals in the oil producing countries of Africa.\nAt the beginning of local content implementation, the board had always emphasised that its focus will be on developing in-country capacity in manufacturing, fabrication, engineering and other high-end services supporting the oil and gas industry."
  },
  {
    "headline": "PEARL Collaborates With Canadian Energy Firm To Boost Nigerian Oil And Gas Industry",
    "summarized_story": "This has been made possible by its partnership with global energy solutions provider, Canadian Energy Solutions (CES).\nIt will increase local production, create job opportunity and improve our foreign exchange reserve position.\nFounded in 2001, CES Energy Solutions has extensive testing capabilities for corrosion, scale, hydrogen sulphide scavenger and other production related requirements.\nThe company will provide technical assistance to PEARL who is the exclusive representative for production chemicals in the oil producing countries of Africa.\nAt the beginning of local content implementation, the board had always emphasised that its focus will be on developing in-country capacity in manufacturing, fabrication, engineering and other high-end services supporting the oil and gas industry."
  },
  {
    "headline": "DPR Set To Remit N900bn To Federal Govt In Q2 2021",
    "summarized_story": "He said the DPR is pushing investment to help meet government’s aspiration of hitting 3 million barrels a day production and 40 billion reserve base.\nIn view of that, he said the agency is about issuing licences to 57 operators that the marginal field bid round recently concluded.\nLEADERSHIP reports that the federal government in a patriotic consideration had introduced the marginal field development programme in 1996 to help grow the country’s oil and gas production.\nThe programme has seen Shell, Total, Agip, Chevron and others surrender fields which are then allocated to marginal field operators in bid rounds.\nThe aspiration to increase Nigerian content will however, not materialise if the stock of marginal field operators dwindle not just because of the harsh operating environment but because of counter-productive pronouncements and actions by regulators."
  },
  {
    "headline": "Zidane quits as Real Madrid manager — Daily Times Nigeria",
    "summarized_story": "Zinedine Zidane has resigned as Real Madrid coach, the club confirmed, saying it’s “time to respect his decision.”The Frenchman’s second spell in charge was far less fruitful than his first, failing to win any trophies.\nHaving lost to Chelsea in the Champions League semifinals, and to Atlético Madrid in the final stretch of the race for the Spanish league championship, it was the first time in 11 seasons Real Madrid came up empty.\nIt was a far cry from Zidane’s first three seasons at Real when he guided the club to a hattrick of Champions League crowns, a La Liga title and two Club World Cups.\n”Zidane is one of the greats of Real Madrid and his legend goes beyond what he has been as a coach and player for our club,” the club said in a statement.\n“He knows that he is at the heart of Real Madrid and that Real Madrid is and will always be his home.”Zidane was a 1998 World Cup winner with France as a player, and starred with Real Madrid from 2001 to 2006."
  },
  {
    "headline": "Chukwueze’s Villarreal win Europa League after marathon shootout victory over Man United",
    "summarized_story": "Villarreal goalkeeper Geronimo Rulli kept his composure to score in a nerve-shredding, seemingly never-ending shootout then denied David de Gea as his side won their first major trophy by beating Manchester United 11-10 on penalties in the Europa League final on Wednesday.\nThe win gave Villarreal coach Unai Emery a record fourth title in the competition, leaving United without a trophy since their Europa League triumph in 2017.\nUnited coach Ole Gunnar Solskjaer said his players had to remember the pain of the defeat for the future.\nUnited forward Rashford said the club had passed up a great opportunity.\n“But there’s no chance this team will give up, we’ll come back next season with a bigger desire.”"
  },
  {
    "headline": "A mildle man Defies Three Underaged Daughters — Daily Times Nigeria",
    "summarized_story": "Nkiru Nwagbo, AwkaA forty-eight years old man has been arrested yesterday by the Nigerian Security and Civil Defence Corps NSCDC in Anambra state for defying his three daughters.\nThomas from Ikolani in Igboetiti in Enugu state but resides in Engwu Ukwu in Anambra state claimed that he was drunk when he committed the acts.\nBut unfortunately, his neighbors who reported the incident to the Civil Defence Corps explained that it has been a steady act for the man.\nIgbo who hails from Ikoloani Igboetiti area of Enugu State claimed that he was under the influence of alcohol the day he slept with the daughter.\nOn the case of 28-year old Solomon Isaac, Billie said he was arrested for jumping in the premises of NSCDC state headquarters, Awka on May 24."
  },
  {
    "headline": "FG yet to remit £4.2m Ibori's loot to Delta State , Idris clarifies —",
    "summarized_story": "” For now, no money has been returned to Delta State,” he said.\nThe Delta State Government immediately reacted to the development on Wednesday and said that it has yet to receive the money.\n“For now, no money has been returned to Delta State,” he said.\nThe £4.2 million pounds was stolen by former Delta governor James Ibori associates and lodged in UK accounts.\nHe is back in Nigeria where he is actively involved in the politics of the Delta State as a kingmaker and godfather."
  },
  {
    "headline": "Kwara Assets: More trouble as Panel indicts Saraki, Ahmed, recommends prosecution, 10-year ban from political office",
    "summarized_story": "The panel, in its report, recommended a 10-year ban from political office for the indicted former governors and their aides, among others, to recover the alleged stolen properties.\nIn fact, Kwara State is now heavily indebted to some people because the past governments mismanaged our properties.\nResponding, Governor AbdulRazaq commended the panel for a job well done adding that the recommendations were noted for action.\nGovt’s claims false, diversionary—SarakiReacting to the panel’s report, the Abubakar Bukola Saraki Media Office faulted the panel noting that they were not invited to appear before it.\nIt just shows how low governance has become in Kwara State."
  },
  {
    "headline": "Kwara Assets: More trouble as Panel indicts Saraki, Ahmed, recommends prosecution, 10-year ban from political office",
    "summarized_story": "The panel, in its report, recommended a 10-year ban from political office for the indicted former governors and their aides, among others, to recover the alleged stolen properties.\nIn fact, Kwara State is now heavily indebted to some people because the past governments mismanaged our properties.\nResponding, Governor AbdulRazaq commended the panel for a job well done adding that the recommendations were noted for action.\nGovt’s claims false, diversionary—SarakiReacting to the panel’s report, the Abubakar Bukola Saraki Media Office faulted the panel noting that they were not invited to appear before it.\nIt just shows how low governance has become in Kwara State."
  },
  {
    "headline": "Again, reps query AGF, Ahmed Idris, over N19b ‘illegal’ withdrawals from recovered loot accounts",
    "summarized_story": "House of Representatives yesterday queried the Accountant General of the Federation (AGF), Ahmed Idris for making an illegal withdrawal from recovered loots accounts.\nIdris, who listed several recovery accounts including that of the EFCC, tried to justify the withdrawals from the separate recovery accounts.\nBut up till now, I have not received any formal conveyance, any formal information written in respect of this £4.2 million.\nIn its ruling, the Committee directed the AGF and Finance Minister to furnish it with a summary of all transactions made from the recovered loot accounts since 2002.\nIt also invited the Governor of the Central Bank of Nigeria, Godwin Emefiele, to appear before it on June 3, 2021 for proper reconciliation of all recovery accounts."
  },
  {
    "headline": "Again, reps query AGF, Ahmed Idris, over N19b ‘illegal’ withdrawals from recovered loot accounts",
    "summarized_story": "House of Representatives yesterday queried the Accountant General of the Federation (AGF), Ahmed Idris for making an illegal withdrawal from recovered loots accounts.\nIdris, who listed several recovery accounts including that of the EFCC, tried to justify the withdrawals from the separate recovery accounts.\nBut up till now, I have not received any formal conveyance, any formal information written in respect of this £4.2 million.\nIn its ruling, the Committee directed the AGF and Finance Minister to furnish it with a summary of all transactions made from the recovered loot accounts since 2002.\nIt also invited the Governor of the Central Bank of Nigeria, Godwin Emefiele, to appear before it on June 3, 2021 for proper reconciliation of all recovery accounts."
  },
  {
    "headline": "Chinese Marra Thai, Nasarawa official, policemen arrested over theft of rail tracks, sleepers",
    "summarized_story": "Abdullahi Sule were among the 15 people arrested for theft of rail tracks and rail sleepers in Nasarawa state.\nMr Bola Longe, Commissioner of Police in Nasarawa state, announced this while addressing newsmen on Thursday in Lafia.\nHe said that items recovered included two articulated trucks and two buses loaded with stolen rail tracks and rail sleepers.\nThe commissioner said investigation was on-going into the matter at the State Criminal Investigation Department, Lafia.\nJubrin Ibrahim Hayas ‘M’Yusuf Abubakar Musa A.K.A Yusuf Mada – Special Adviser to the Governor of Nasarawa State on Infrastructure."
  },
  {
    "headline": "Nigeria on verge of collapse, 2023 elections threatened – Falana",
    "summarized_story": "By Kazeem UgbodagaHuman rights lawyer, Femi Falana on Thursday said Nigeria is on the verge of collapse as the 2023 general election is threatened in view of series of attacks on INEC offices.\nWhat can we do very quickly to save this country which is on the verge of collapse?\nFalana said for the constitutional amendment to be fruitful, for Nigeria to have genuine outputs from this meeting, peace must reign.\n“In fact, in some parts of the country, the 2023 elections are already threatened.\n“But unless we are prepared to make these provisions justiciable and enforceable, this country will know no peace."
  },
  {
    "headline": "Huge crowd as Obasanjo hits Ibadan Chicks Market",
    "summarized_story": "By Kazeem UgbodagaFormer President, Chief Olusegun Obasanjo on Thursday, visited the Obasanjo Market, at Oluyole Estate, Ibadan, with a promise to assist in having better structure and government backing.\nThe visit at the Day Old chicks market recorded a massive turnouts of traders and buyers, who welcomed the former President amid pomp and ceremony.\nThe tour was conducted by Deacon Sunday Agusa, the General Manager of the Obasanjo Farms, Ibadan, located in the area.\nThe leader of the Day Old Chicks Merchant Association of Nigeria (DOCMAN), Olaiya Ogunmoyewa at the Obasanjo Day Old International Market, appreciated the coming of the former President, saying the visit had lessened their fears on the future of the market.\nHe said the Obasanjo had spoken their agitation “and we’re pleased with what you have told us."
  },
  {
    "headline": "Pastor’s Wife Fights Dirty With Husband’s Side Chic During Service |Video]",
    "summarized_story": "A viral video of a Nigerian pastor’s wife fighting dirty with her husband’s side chic, a deaconess daughter during church service has surfaced on social media.\nIn the video that has become a growing sensation, the Pastor’s wife, who’s yet to be identified as at the filing of this report, was pictured fighting with her husband’s side chic while the church members watched in amazement in Umuahia, Aboa State.\nThe lady’s mother was also filmed trying to separate them in church.\nWatch the video below;See comments below;@Jotham.fd wrote; ‘The Bible says “The violent taketh it by force”… she’s just practicing what she preaches.\nI’m here for it.”@majestic_margaret_vlogs wrote; ‘Pastor wife is only trying her possible best to separate the two women fighting …Free pastor wife oh….Mum G.o’@6car__wrote; ‘That woman wey dey down don collect’"
  },
  {
    "headline": "Lai Mohammed: Nigeria In Safe Hands Despite Security Challenges",
    "summarized_story": "The Minister of Information and Culture, Alhaji Lai Mohammed, has assured Nigerians that in spite of the current security challenges,the country is in safe hands.\nHe appealed to Oba Ajakaiye to work with his fellow traditional rulers, as well as the Government of Ekiti State, to ensure peace and security in the state.\n”Putting the tourist sites on the national and global map will attract tourists, which will in turn boost the economy of not justIyin town but indeed the entire Ekiti State,” he said.\nHe stressed the need for the federal government to leverage on the tourism industry in its drive to diversify the economy away from oil.\nOba Ajakaiye used the occasion of his visit to invite the Minister to his forthcoming coronation as well as to visit the tourist sites atIyin-Ekiti – the two requests that were granted by the Minister.."
  },
  {
    "headline": "BREAKING: President Buhari Appoints New Chief Of Army Staff",
    "summarized_story": "The Commander in Chief of the Armed Forces of the Federal Republic of Nigeria, President Mohammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff.\nPrior to his appointment Major General Yahaya was the General Officer Commanding 1 Division of the Nigerian Army and the incumbent Theatre Commander of the Counter terrorism Counter Insurgency military outfit in the North East code named Operation HADIN KAI.\nPlease disseminate this information to the general public through your news medium.\nThank you for your cooperation.\nONYEMA NWACHUKWUBrigadier GeneralActing Director Defence Information27 May 2021"
  },
  {
    "headline": "Pictures: President Muhammadu Buhari receives Ghanian President, Nana Akufo-Addo",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: See how President Muhammadu Buhari celebrated children’s day in Abuja",
    "summarized_story": "PreviousProfile of the new Chief of Army Staff, Maj.- Gen Faruk Yahaya"
  },
  {
    "headline": "Breaking: New Chief of Army Staff replaces late Attahiru",
    "summarized_story": "President Mohammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff.\nMajor General Yahaya replaces late Lt. Gen. Ibrahim Attahiru who died in a plane crash last Friday, a press statement by the acting Director Defence Information Brig.\nGeneral Onyema Nwachukwu has revealed on Thursday.\nThe statement further read, “Prior to his appointment Major General Yahaya was the General Officer Commanding 1 Division of the Nigerian Army and the incumbent Theatre Commander of the Counter terrorism Counter Insurgency military outfit in the North East code named Operation HADIN KAI.\nShare this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Stolen Artefacts: ARAN commends FG’s recovery efforts -NigPilot",
    "summarized_story": "Rescuers Association of Nigeria, (ARAN) a body responsible for the rescue of Nigeria artifacts and its patrimonies has commended Minister of Information and Culture, Alhaji Lai Mohammed, over his recent call for all artifacts looted from Nigeria by foreigners to be returned.\nThe President, Obalosa Bamidele made the commendation in Abuja on Monday while speaking with journalists saying that Alhaji Mohammeds’ call is yielding fruitfulness with some foreign institutions with the nations’ patrimonies agreeing to negotiate with the country for possible returns.\nHe said with the renewed calls for the repatriation of all looted Nigeria artifacts , with passion and commitment of the Minister, there is hope that “most stolen riches of the country will find its way back.”Recall that the Federal Government launched campaign for the repatriation of looted artefacts from the country in 2019 which yielded fruitfully with spate of return of stolen Nigerian antiquities from around the world.\nThe German Government and Museums, both of which are currently at the forefront of repatriating the nations’ antiquities set the stage for a global movement to restitute colonial loot with its March announcement that it planned to hand over some Benin bronze to Nigeria.\nAlso, the Jesus College at the University of Cambridge has pledged to return a bronze cockreal along with the University of Aberdeen in Europe, committed in returning a Benin bronze, head of an oba (king) in its possession, acquired in a way that is considered extremely immoral."
  },
  {
    "headline": "FG reiterates commitment to effective waste management system -NigPilot",
    "summarized_story": "Minister for Environment, Dr Muhammad Mahmoud Abubakar has said that the Federal Government is committed to an effective waste management system in Nigeria.\nThe Minister stated this at the 3rd International Waste Summit 2021, organised by the Waste Management Society of Nigeria, WAMASON, held in Port Harcourt, Rivers State.\nAbubakar noted that the Federal Government is seeking greater partnership with professional bodies like WAMASON on useful ideas on effective waste management in the country.\nHe stressed that youths could benefit through all the stages of waste management, from sorting, storage, transporting to treatment.\nIn achieving an effective waste management system, the Minister stated that the federal government will continue to develop policies to ensure that actions towards waste management are profitable."
  },
  {
    "headline": "NAPTIP DG calls for implementation of policies for protection of children",
    "summarized_story": "Director-General of the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, Imaan Sulaiman – Ibrahim has called for the strengthening of policies, programs, and legal instruments that will further enhance the protection of Children in the Country.\nThe NAPTIP boss said “I join millions of Nigerians across the globe in wishing our children a Happy Children’s Day.\nQuite a large number of Nigerian children have fallen victims of illicit commercial activities which include human trafficking, sexual exploitation domestic servitude, and street begging.\n“It is therefore imperative that parents work closely with NAPTIP and other law Enforcement Agencies in ensuring that perpetrators of evil acts towards our children are reported in order to ensure that such perpetrators are brought to book.\n“NAPTIP on its part shall continue to work assiduously towards the protection of our children,” she said."
  },
  {
    "headline": "Children’s Day: UNICEF calls for protection of child rights -NigPilot",
    "summarized_story": "Commemorating the event of the Children’s Day, the United Nations Children’s Fund, UNICEF, has advocated the need to reinforce protection mechanisms for children especially at a challenging moment for child rights in the country and the world, with the COVID-19 pandemic threatening gains made for children’s development.\n“As we rightfully celebrate Nigerian children today, let us also remember that the COVID-19 crisis has been a child rights crisis – in Nigeria and around the world.\n“On this Nigerian Children’s Day, let us all agree that we cannot let one crisis compound another.\n“Violence is perpetrated against one in four Nigerian children – and one in three Nigerian girls is sexually abused.\n“Nigerian children are resilient, talented and aspire to do great things."
  },
  {
    "headline": "Buhari Appoints New Chief Of Army Staff, Major-General Yahaya",
    "summarized_story": "President Muhammadu Buhari has appointed Major-General Farouk Yahaya as the new Chief of Army Staff.\nMajor-General Yahaya started his cadet training on 27 September 1985 and was commissioned into the Nigerian Army Infantry Corps on 22 September 1990.\nRésumé/CV of newly appointed Chief of Army Staff (COAS), Major General Farouk Yahaya.\nNotable among the appointments held by the new COAS are Garrison Commander Headquarters Guards Brigade, Directing Staff at the Armed Forces Command and Staff College (AFCSC), Deputy Director Army Headquarters Department of Military Secretary, Deputy Director Army Research and Development and the Chief of Staff, Headquarters Joint Task Force Operation Pulo Shield.\nHe also served as the Principal General Staff Officer (PGSO) to the Honourable Minister of Defence, the Commander, Headquarters 4 Brigade and 29 Task Force Brigade (Operation Zaman Lafiya), Director Manpower at the Army Headquarters, Military Secretary, Army Headquarters and General Officer Commanding (GOC) Headquarters 1 Division of the Nigerian Army."
  },
  {
    "headline": "PHOTOS: Buhari Celebrates Children’s Day",
    "summarized_story": "President Muhammadu Buhari celebrated Children’s Day with children in the State House on Thursday, May 27th.\nMay 27th is celebrated as Children’s Day in Nigeria.\nPresident Buhari commemorated the day with some kids in the Aso Rock Villa with cake and waving flags.\nAccording to the Presidency’s official Twitter handle, “The President spent the morning with a group of visiting children, at the State House.\nSchools and educational institutes used to celebrate this day by organizing fun days, and arranging for kids to go for match passes in stadia across the country."
  },
  {
    "headline": "Disbandment Of SARS Created A Vacuum In Police To Tackle Insecurity – IGP",
    "summarized_story": "The acting Inspector-General of Police (IGP), Alkali Usman has said that the disbandment of the Special Anti-Robbery Squad (SARS) created a vacuum which is challenging efforts by the Police to tackle insecurity in the country from a position of strength.\nThe acting IGP stated this on Thursday at a presidential briefing organized by the Presidential Communications Team at the statehouse in Abuja.\nREAD ALSO: Let Us Not Deceive Ourselves, Things Are Not Alright – Sultan AbubakarAccording to him, the aftermath of the EndSARS protest equally dampened the morale of the officers of the force.\nThe IGP also indicated that the police have recorded successes against secessionist groups and criminals in the southeast.\nHe noted that prosecution to ensure justice is served has remained a major challenge because of the ongoing strike by judiciary workers."
  },
  {
    "headline": "Let Us Not Deceive Ourselves, Things Are Not Alright – Sultan Abubakar",
    "summarized_story": "﻿The Sultan of Sokoto, Muhammad Sa’ad Abubakar, on Wednesday, said Nigerians should not deceive themselves that things are alright.\nHe made the comment during a National Security Summit in Abuja.\n“Let us not deceive ourselves that things are alright, things are not alright,” the revered traditional ruler said.\nWhile commending the Speaker of the House of Representatives, Femi Gbajabiamila, for initiating the National Security Summit, the Sultan called for the implementation of the resolutions of the summit.\nThe traditional ruler expressed happiness that both the Speaker and the Senate President, Ahmad Lawan, have admitted that things are not well with the country."
  },
  {
    "headline": "Malami Denies Receiving N2bn From Recovered Loots",
    "summarized_story": "Attorney General of the Federation and Minister of Justice, Abubakar Malami (SAN) has denied allegations suggesting that N2 billion was paid to his office from the recovered funds.\nMalami, therefore, challenged any person who has any evidence of such payments to either him or his office, to come out publicly with proofs.\nN2bn Illegally PaidEarlier in the week, a House of Representatives panel said the Central Bank of Nigeria (CBN) illegally paid N2 billion to Abubakar Malami, attorney-general of the federation (AGF), from recovered loot.\nAt its sitting on Tuesday, the house ad hoc committee probing the status of recovered loot queried Malami on the funds which they said they never approved as a budgetary allocation.\nThey also challenged the Minister of Justice for allegedly requesting payment of approved solicitors’ fees from the recovered assets, a claim which Malami utterly denied."
  },
  {
    "headline": "Matawalle congratulates new COAS, Maj. Gen. Farouk Yahaya, says it’s a divine elevation",
    "summarized_story": "Zamfara State governor, Bello Matawalle, has congratulated Major General Farouk Yahaya over his appointment by President Muhammadu Buhari as the 22nd Chief of Army Staff.\nThe Governor, on behalf of the government and good people of the state, wishes him success as he takes over the highest seat in the Nigerian ArmyMr. Matawalle described the appointment as a divine elevationIn a press statement signed by the Director General Media and Communications to the Governor Yusuf Idris Gusau said the governor is optimistic that having come from the North West region of the country, the New chief of Army staff will play a vital role in addressing the lingering security challenges that has bedeviled the region and the nation at large.\n” As a top ranking military officer, Gen. Yahaya who is very conversant with the security challenges caused by armed Banditry and Boko Haram insurgents, I am optimistic that he will do well Nigeria proud by addressing the menace of Insecurity that has affected all aspect of human live in the north”.\nMatawalle saidAdvertisementHe also prayed God to continue to guide and protect the COAS as he lead his officers and men on this onerous task in the service of his fatherland.\nThe appointment of major General Yahaya Faruk is coming exactly a week after the death of lieutenant General Attahiru Ibrahim who died along side other senior military officers in a plane crash enroute Kaduna."
  },
  {
    "headline": "Somolu LG Chairman ‘Dullar’ calls for peace as hoodlums destroy campaign posters",
    "summarized_story": "Chairman of Somolu Local Government, Abdul Hamed Salawu has urged his supporters to remain calm as suspected hoodlums destroyed his campaign posters and signage posts across Somolu.\nDullar, as he is fondly called, who disclosed this while addressing his supporters at Agunbiade Primary School,, also warned against reprisal attack on banners and posters of his co-aspirants.\nHe said the destruction is a conspicuous sign that his opponents are aware that he is coasting to victory on Saturday.\nAccording to a statement from his media office, Mr Salawu said he still remain the most popular APC Chairmanship aspirant in Somolu and will emerge the ruling party’s candidate by Saturday after the Primary election.\nHe further urged his followers not to engage in any violence or criminal act to avenge the sponsored attack on his campaign posters and banners."
  },
  {
    "headline": "Nigeria: Thirty Bodies Discovered After Boat Sinks in Northwest Kebbi State",
    "summarized_story": "Thirty bodies have been pulled from a river where a boat carrying more than 150 passengers sank in northern Nigeria.\nAuthorities in the West African Country said only 20 people were rescued when the ferry travelling between Niger state and Kebbi state broke in two.\nYusuf Birma, head of the National Inland Waterways Authority (Niwa) in Kebbi state told the reporters that 30 bodies have so far been recovered.\nThe state governor tweeted that it was “in deep shock and sorrow, over the unfortunate boat accident which claimed the lives of over 100 passengers”.\nThis is the second accident in the region this month, after at least 28 people drowned when their boat capsized two weeks ago in Niger state."
  },
  {
    "headline": "Meet Maj. General Yahaya, Nigeria’s New Chief of Army Staff",
    "summarized_story": "Major General Farouk Yahaya is now Nigeria’s new Chief of Army Staff following his appointment by the country’s leader Muhammadu Buhari on Thursday.\nThe new army chief hails from northwestern Zamfara State.\nHe commenced his cadet training on September 27 1985 and was commissioned into the Nigerian Army Infantry Corps on September 22, 1990.\nHe was the Garrison Commander Headquarters Guards Brigade, Directing Staff at the Armed Forces Command and Staff College (AFCSC), Deputy Director Army Headquarters Department of Military Secretary, Deputy Director Army Research and Development and the Chief of Staff, Headquarters Joint Task Force Operation Pulo Shield.\nHe also served as the Principal General Staff Officer (PGSO) to the Honourable Minister of Defence, the Commander, Headquarters 4 Brigade and 29 Task Force Brigade (Operation Zaman Lafiya); Director Manpower at the Army Headquarters, Military Secretary, Army Headquarters and General Officer Commanding (GOC) Headquarters 1 Division of the Nigerian Army."
  },
  {
    "headline": "Buhari Appoints Major General Farouk Yahaya as Nigeria’s New Army Chief",
    "summarized_story": "Nigeria’s President Muhammadu Buhari has appointed Major General Farouk Yahaya as the new Chief of Army Staff.\nPrior to his appointment Major General Yahaya was the General Officer Commanding 1 Division of the Nigerian Army and the incumbent Theatre Commander of the Counter terrorism Counter Insurgency military outfit in the North East code named Operation HADIN KAI.\nYahaya replaces Lt. Gen Ibrahim Attahiru who sadly perished in a plane crash along with 10 other officers on Friday May 22, 2021."
  },
  {
    "headline": "Pochettino in Talks With Former Side Tottenham Over Possible Return",
    "summarized_story": "Mauricio Pochettino is in talks with Tottenham over a return to the club that would see him leave Paris Saint-Germain after less than six months in charge.\nPochettino led PSG to French Super Cup and Coupe de France wins but failed to deliver the Ligue 1 title, missing out to Lille by a point.\nAs well as coaching PSG, Pochettino also spent two-and-a-half years at the club as a player after joining from Espanyol in 2001.\nWere Pochettino to depart PSG, he would leave them searching for their third head coach in less than a year.\nPochettino joined the club as a replacement for Thomas Tuchel, who was sacked in December 2020 despite leading them to their first Champions League final just months earlier."
  },
  {
    "headline": "Zinedine Zidane Steps Down as Real Madrid Head Coach",
    "summarized_story": "Zinedine Zidane has stepped down as Real Madrid head coach for the second time, the club have confirmed.\nHis departure comes after Real narrowly lost out on the league title to city rivals Atletico Madrid at the weekend.\n“It is now time to respect his decision and show him our appreciation for his professionalism, dedication and passion in all these years, and for what his figure represents for Real Madrid,” a club statement read.\n“Zidane is one of the great myths of Real Madrid and his legend goes beyond what he has been as a coach and player of our club.\nHe knows that he is at the heart of Real Madrid and that Real Madrid is and will always be his home.”“It’s an option that Zidane could replace Maurio Pochettino at PSG."
  }
]