[
  {
    "headline": "Kebbi approves payment of N556m gratuity to ex-councillors",
    "summarized_story": "Governor Atiku Bagudu of Kebbi State has approved the payment of over N556 million severance gratuity to former local government chairmen and councillors in the state.\nThe State Commissioner for Local Government and Chieftaincy Affairs, Alhaji Hassan Muhammad-Shalla, confirmed this in a statement made available to newsmen in Birnin Kebbi on Saturday.\nHe said, “His Excellency, Senator Abubakar Atiku Bagudu has graciously approved the sum of N556,010,639.59k for payment of severance gratuity to former Local Government Chairmen and Councillors in the state.”According to him, the payments are for all categories of former local government councils that served from 2004 to 2007, 2008 to 2011, 2012 to 2015, 2017 to 2019 and 2019 to 2021.\n“The payments are to cover all those who have not been paid, irrespective of any political party affiliation.\n“All incumbent executive chairmen of the 21 local government councils are directed to commence preparations to effect the payment of gratuity to beneficiaries with immediate effect,” he said."
  },
  {
    "headline": "Sanwo-Olu felicitates Ugwuanyi at 58",
    "summarized_story": "Governor Babajide Sanwo-Olu of Lagos State has felicitated the Enugu State Governor, Mr Ifeanyi Ugwuanyi on his 58th birthday, describing him as a visionary leader.\nHe described Governor Ugwuanyi, who clocked 58 on Sunday, March 20, as a committed and selfless public servant, who contributed to the development of Enugu State and Nigeria at large, as a governor and former federal lawmaker.\n”On behalf of my wife, Ibijoke, and the good people of Lagos State, I join family, friends, political associates and the people of Enugu State to congratulate my dear brother, Governor Ugwuanyi on his 58th birthday.\nRead Also Why Enugu land commissioner resigned appointment”Governor Ugwuanyi’s input in the growth and development of Enugu is pragmatic testament to his visionary leadership.\nHis developmental strides in Enugu State and national growth are noticeable in different areas of endeavour."
  },
  {
    "headline": "Police arrest ‘spirit’ attempting to dupe victim of N2.2m in Borno",
    "summarized_story": "The Police Command in Borno has arrested a suspect who specialised in defrauding his victims by pretending to be a spirit with powers to make them wealthy.\nThe Commissioner of Police (CP), Abdu Umar, told newsmen in Maiduguri on Friday that nemesis caught up with the suspect, a member of a three-man gang.\nUmar said that the mode of operation of the gang was to deceive their victim into believing that they were in communication with a spirit who could assist them in making wealth.\n“The victim complied and the suspects withdrew the sum of N2.2 million from his account domiciled at TAJ Bank Plc,” Umar said.\nUmar added that efforts to arrest the two other accomplices have been intensified."
  },
  {
    "headline": "2023: Ex Edo revenue Boss, Owie declares for senate",
    "summarized_story": "A Chieftain of the Peoples Democratic Party (PDP) and former Executive Chairman of Edo State Internal Revenue Service (EIRS), Dr. Ese Owie has formally declared his intention to seek the ticket of the Peoples Democratic Party to contest the 2023 Senatorial Election to represent Edo South in the Senate.\n“Between 2009 and 2011, I served as Special Adviser (Cabinet Rank) to the Executive Governor of Edo State on Policy and Strategic Planning and helped to shape the Administration’s strategic policy direction.\nA Legislator’s first and primary responsibility is, thus, to make laws for the peace, order and good governance of the country.\n“That constitutional responsibility also places a heavy onus on the Legislator to make laws that will be beneficial to his/her constituents.\nOptimizing the operations of the Federal Neuro-Psychiatric Hospital, Uselu, to meet the mental health needs of our people would also be a priority."
  },
  {
    "headline": "Nigeria’s foreign policy lacks national interests, values, others— Gambari",
    "summarized_story": "…Zulum says Nigeria’s foreign policies is deficit of national passionBy Ezra Ukanwa, AbujaThe Chief of Staff, CoS, to President Mohammadu Buhari, Professor Ibrahim Gambari, has said that the Foreign Policy of the Nigerian state does not showcase Nigeria’s worldview, national interests, and values.\nHe went further to explain that the book, which he claimed aptness, addressed some of the lapses of Nigeria’s foreign policies and how it has affected Nigeria’s domestic politics and policy.\n“Foreign policy is not about “dogo turenchi” which is reserved for the kind of elite that is assembled in this, it is more that.\nHe stated further that one of the issues bedeviling the foreign policy of the country is that these foreign policies lacked national passion and commitment.\nThis continues to be one of the major challenges of our foreign policy”, he bemoaned."
  },
  {
    "headline": "Groups hail courage of FHC Umuahia in quashing Section 84 (12) of Electoral Act",
    "summarized_story": "By Joseph ErunkeABUJA-THE Nigerian Ethnic Youth Leaders,NEYLC, on Saturday, hailed Friday’s nullification of Section 84 (12) of the newly ammended Electoral Act,by the Federal High Court,Umuahia.\nThe NEYLC, which is made up of the Arewa Consultative Youths Movement,ACYM,Ohanaeze Ndigbo Youths Movement, Oduduwa Youths and Middle Belt Youths, made its position known in a statement signed by Ohanaeze Secretary General and head of coalition’s secretariat, Nwada Ike Chiamaka.\nThe group said it was clear from the beginning that the controversial section was conceived to witch hunt appointees of government.\nThe statement read, “We cannot but commend the courage of the court in delivering such a sound judgment that we believe will stand a test of time.\n“We knew from the beginning that the section was deliberately inserted to witch hunt appointees of government."
  },
  {
    "headline": "BUA explains fire incident at diesel storage tank farm in Sokoto",
    "summarized_story": "BUA Group, has on Saturday, cleared the air on the fire incident that took place at one of its diesel storage tank farm in Sokoto.\nDirector, Admin Services, sent to Vanguard, explained that the incident occurred when routine maintenance work was ongoing.\nBellow is the statement:“We wish to use this medium to inform the public of an isolated fire incident which occurred at a diesel storage tank farm situated in the vicinity of one of our factories in Sokoto.\n“This incident occurred whilst routine maintenance work was ongoing on one of the storage tanks by a third-party contractor.\n“Immediately the incident occurred, our emergency management and mitigation services were alerted, and a swift response activated, which prevented any escalation of the incident or damage to our main plant and equipment."
  },
  {
    "headline": "Gov Uzodinma blows hot as gunmen bomb Ohanaeze President’s home",
    "summarized_story": "Governor Hope Uzodinma of Imo State has condemned the razing of the country home of the President-General of Ohanaeze Ndigbo, Prof George Obiozor, at Awo-Omanma in the Oru East Local Government Area of Imo State.\nIt was gathered that the suspects used Improvised Explosives Devices, IED and petrol bombs to raze down the building.\nReacting in a statement he personally signed, Uzodinma vowed that his government is working in concert with security agencies to identify and punish the perpetrators of the act.\nThe Governor said it was shameful that both the sponsors and perpetrators of the violence deployed their malicious attack on an innocent man.\nHe, therefore, commiserated with Prof Obiozor and assured Imo people that the Government will continue to do all within its constitutional power to protect lives and property in the state."
  },
  {
    "headline": "Motorists groan as fuel scarcity persists in Yobe",
    "summarized_story": "Petrol end users, especially motorists in Damaturu, the Yobe State capital, have continued to suffer fuel scarcity as the product is now sold for as high as N250 per litre.\nThe resultant effects of the scarcity have resulted in the forming of long queues in the few stations the commodity is available.\nAn official of the Task Force revealed that about three Golf drivers were arrested for what he called recycle buying.\nA member of the task force said, “We arrested three Golf drivers who are black makers here at the station.\nThe sales of the product at the mega station has forced drivers to abandon other marketers selling at exorbitant rates."
  },
  {
    "headline": "Crisis like EndSARS being planned over fuel scarcity in Nigeria – DSS",
    "summarized_story": "The Department of State Services (DSS) has alerted of a sinister plan to stoke violence in parts of Nigeria, particularly the North Central.\nThe spokesman said the aim was to cause ethno-religious crisis, ignite reprisals and heat up the polity.\nThe DSS said the sponsors have mobilised foot soldiers and held several meetings in and outside the target areas.\nThe DSS disclosed it was trailing “the agents of destabilisation who are desirous of using violence to achieve ulterior goals”.\nThe statement warned, “the ring leaders and their cohorts to desist from acts capable of causing a breakdown of law and order”."
  },
  {
    "headline": "Why I celebrate birthdays once in 10 years – Bishop Oyedepo",
    "summarized_story": "Bishop David Oyedepo of Living Faith Church, also known as Winners Chapel Worldwide, has revealed that he celebrates birthdays just once in ten years.\nOyedepo, the richest preaching pastor in Africa, said during a sermon that he lacks time to celebrate his birthday annually, saying he usually forgets his birthdays due to activities.\nAccording to him, to attain great height, one must focus on hard work, stressing that only hard workers fly higher in the race of life.\nHe said, “For lack of time, I can only celebrate birthday once in ten years.\n“Only hard workers emerge as high fliers in the race of life."
  },
  {
    "headline": "EPL: Arsenal warned they could lose out on top four despite 1-0 win at Aston Villa",
    "summarized_story": "Arsenal legend, Martin Keown, has warned that his former club could still lose out on finishing in the top four places.\nThe Gunners bounced back from their 1-0 defeat to Liverpool in midweek to beat Aston Villa 1-0 at Villa Park on Saturday.\nThe win opened a four-point gap between Mikel Arteta’s men and Manchester United in fifth place.\n“Now there’s a lot of games ahead and I still put Spurs as favourites to make top four.\nArsenal, we have now got to see, but when I look at the fixtures and I see games away at Chelsea, Spurs, it’s tough."
  },
  {
    "headline": "Port Harcourt Fire: Mayor vows to demolish shanties, illegal structures close to tank farm",
    "summarized_story": "The Mayor of Port Harcourt, Allwel Ihunda, has vowed to begin the demolition of shanties and other illegal structures close to a tank farm at the Abonema Wharf axis of the Rivers State capital.\nHe blamed the Friday inferno that destroyed goods and property worth millions of naira at the area on storage of adulterated petroleum products in the shanties.\n“All the illegal structures around here henceforth will cease to exist from Monday next week we are going to demolish all the illegal structures on this road.\nThis is a tank farm and explosion came.\n“Where you have a tank farm, do you expect people to be cooking or lighting fire around that area?"
  },
  {
    "headline": "Akeredolu welcomes Soludo to Southern Governors’ Forum",
    "summarized_story": "Chairman of the Southern Governors’ Forum (SGF) and Ondo State Governor, Oluwarotimi Akeredolu, has charged Anambra State Governor, Prof. Charles Soludo, to brace up for the herculean job ahead.\nGovernor Akeredolu, who congratulated Prof. Soludo on his inauguration as the Executive Governor of Anambra State, said security and economic challenges in the Southern part of the country and the nation at large required joint efforts and unalloyed commitment.\nThe Ondo Governor through his Chief Press Secretary, Richard Olatunde, said Southern Governors’ Forum was confident of Soludo’s track records and ability to provide the right leadership for the people of Anambra State.\n“We are particularly enamoured by Governor Soludo’s palpable passion for home-grown economic growth through effective mobilisation of resources for development.\n“For us at the Southern Governors’ Forum, we see Prof. Soludo as a great asset that will further help drive our forum’s agenda, most especially on the economic well-being of our dear people."
  },
  {
    "headline": "2023: INEC picks holes in new Electoral Act",
    "summarized_story": "After the initial relief that greeted the 2022 Electoral Act, the Independent National Electoral Commission (INEC) has picked holes in the new Act that may derail the 2023 general elections.\nThe Commission is seeking practice direction to deal with some of the provisions of the Electoral Act that are considered as inimical to the electoral process.\nOne of such provisions identified by the Commission that should be revisited, is the removal of issues relating to pre-election matters from the High Courts and domiciling it with the Federal High Court.\nINEC National Commissioner and Chairman Information and Voter Education, Festus Okoye, while highlighting the challenges that may confront the implementation of the new Electoral Act, hinted that, “one of the big issues that the new Electoral Act has made is to remove issues around pre-election matter from the High Courts and the High of the FCT and it has domiciled it with the Federal High Court.\n“The Electoral Act has just come into force and there are many issues that have been embedded in the Act we also need to begin a robust training of our Staff in relation to some of the issues embedded in the new Act."
  },
  {
    "headline": "Don’t drag us into your dirty politics – IPOB warns politicians",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has asked Nigerian politicians not to drag the group into their dirty politics, warning such actions would be regretted if continued.\nEric Ogbo Asogwa, Mazi Chinedu Mba and others to leave IPOB alone.\nTheir intent is to drag our hallowed name into their dirty politics.\n“We also warn those behind these devilish activities to be careful and leave IPOB out of their dirty politics.\nThey should leave IPOB alone and face their hopeless politics in Nigeria because IPOB is not interested in their evil politics."
  },
  {
    "headline": "Wike urges new Oba to emulate late father",
    "summarized_story": "Rivers State Governor, Nyesom Wike, has appealed to the new Oba of Ogbaland His Eminence, Nwachukwu Obuoha Nnam-Obi, III, to follow the footsteps of his predecessor and late father.\nThe governor, who spoke when the Ogba traditional council and stakeholders formally introduced their new monarch to him in Government House at the weekend recalled that the late Oba consulted with government regularly, carried his traditional office with dignity and was respected across the country.\nWike also asked him to be a man of peace, exude intelligence like his late father and ensure the peaceful coexistence of Ogba people.\nWike warned communities across the state to stop disrupting the operations of oil companies within their domains.\nThe Oba thanked Wike for the various developmental projects executed in Ogbaland and for thr restoration of peace particularly in Omoku."
  },
  {
    "headline": "BREAKING: Gunmen bomb Ohanaeze PG, Obiozor’s country home in Imo",
    "summarized_story": "Our correspondent gathered that Obiozor was not at home when his house was attacked.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nClick here to see how you too can get paid .\nEven as all effort to reach Obiozor and his media crew did not yield any result, a community leader who does not want his name mentioned said that he has already called the PG to sympatise with him on the incident.\nThe police spokesperson in the state, Micheal Abattam, could not respond to calls made to his phone line concerning the incident."
  },
  {
    "headline": "Breaking: Again, gunmen bomb Imo police station",
    "summarized_story": "From Stanley Uzoaru, OwerriGunmen again renew their attack on police formation in Imo State attacking the Umuguma police division in Owerri West Local Government Area of Imo State at the early hours of Sunday.\nA source from the area who narrated the incident to our correspondent said that the hoodlums also killed 2 police constabularies who were on duty.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nAccording to the source, the gunmen who were heavily armed blocked the road on arrival at the station and started shooting sporadically to scare people from coming close to them before they threw a dynamite inside the premises."
  },
  {
    "headline": "Beware of subversive elements, Naval Chief warns 329 retiring personnel",
    "summarized_story": "The Chief of Naval Staff, Vice Admiral Awwal Gambo has warned retiring soldiers of the Nigerian Armed Forces to be wary of subversive element within the society, urging them to stay away from these elements and remain loyal to the Nigerian military.\nThe CNS urged the graduands to justify the magnanimity of President Muhammadu Buhari who had continued to support the armed forces especially retiring personnel as observed in the enhanced welfare packages.\nAlso speaking, Lubo said that over 50,000 personnel of the armed forces had been trained in NAFRC since it’s inception in the 1980’s.\n“The centre has also successfully trained members of paramilitary agencies as well as members from federal ministries, departments and agencies.\nThe NAFRC Commandant thanked President Buhari for his continuous support to the development of the military and also extended his appreciation to the families of the retiring personnel for their love and support over the past years."
  },
  {
    "headline": "Showdown at Soludo’s inauguration: Why I slapped Obiano’s wife –Bianca Ojukwu – The Sun Nigeria",
    "summarized_story": "From Magnus Eze, EnuguNigeria’s former Ambassador to Spain and wife of Dim Chukwuemeka Odumegwu Ojukwu, Mrs Bianca Ojukwu has given reasons why she slapped the immediate past first lady of Anambra State, Ebelechukwu Obiano on Thursday.\nThe duo had a faceoff in Awka during the inauguration of Professor Chukwuma Soludo as the new governor of Anambra State.\nBianca was seen in a viral giving Ebele a slap after the latter left her seat to assault Mrs Ojukwu.\nMrs Obiano who was left messy after her fracas with Bianca was also filmed on camera calling Bianca ‘’ashawo,’’ referring to prostitute.\nIn a statement yesterday, Bianca disclosed that Mrs Obiano was not just the aggressor, but that the former governor’s wife had a premeditated plot to disgrace her."
  },
  {
    "headline": "Obiano’s wife has committed sacrilege, she must apologise to Igbo –Obi of Awka",
    "summarized_story": "The Obi of Awka Ancient Kingdom, Awka Capital Territory, Dr. Austin Ndigwe (JP), has given the wife of the immediate past governor of Anambra State, Mrs. Ebelechukwu Obiano seven days to publicly apologise to the entire Igbo people or face serious consequences, over her sacrilegious action against the symbol of Igbo unity, Bianca Odumegwu- Ojukwu.\n“Bianca told me after the incident that what angered her was that Ebere called her unprintable names, including prostitute and queried her presence at the swearing in ceremony.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\n“Unfortunately, this grave sin was committed in the land of Awka, which is known for peace and unity.\n“Even when she was informed that the seat was for the chief judge, she refused to vacate the seat, only for her to stand up and move towards the direction of Bianca Ojukwu to start pouring venom on her."
  },
  {
    "headline": "Game on, Court Vacates Order Stopping APC’s Convention, Akpanudoedehe Returns",
    "summarized_story": "Justice Kawu vacated the order stalling APC’s National Convention following an application by the party to that effect.\nThere were allegations that Buni had perfected plans to scuttle the party’s national convention in order to remain as Caretaker Chairman.\nNasir el-Rufai, Governor of Kaduna, on March 9, alleged that Buni’s lawyers colluded with a petitioner to “destroy” the National Convention.\nHe described the said court order as a “hidden nuclear weapon” that would have hampered the party’s chances in the 2023 general election.\n“We are now at the finishing line in the preparations for our National Convention, which is at hand."
  },
  {
    "headline": "Awka Monarch: Ebelechukwu Obiano Has Desecrated Kingdom By Fighting Bianca, Says Serious Consequences Loom",
    "summarized_story": "A fight that broke out last Thursday between the two women during the inauguration of Professor Charles Soludo as Governor resulted in Bianca slapping Ebelechukwu.\nEze Ndigwe also ordered Ebelechukwu to apologise to Bianca within seven days to avoid consequences.\nThe Obi of Awka, in his press release, said he had given Ebelechukwu seven days to publicly apologise to the entire Igbo people or face serious consequences.\nHe added that a study of the scenario showed that Mrs. Obiano’s action was deliberate, as she came very much prepared to disrupt the swearing in ceremony.\nBianca endorsed Obiano and called on all APGA members, including then Governor Obi to support him."
  },
  {
    "headline": "Malami Celebrates as Court Annuls Section of Electoral Act Barring Political Appointees",
    "summarized_story": "The judge, accordingly, ordered the AGF to forthwith delete Section 84(12) from the Electoral Act.\n“The provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be treated accordingly.\n“By virtue of section 318 of the Constitution, political appointees are not included in the list of persons employed in the public service.\nTo that extent, section 84 (12) of the Electoral Act was annulled on a very faulty ground.\n811) 540 Ojonye V. Onu & ORS (2018) LPELR-44223) where the appellate Courts have held that political appointees or political office holders are not public servants as provided for under the Constitution.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Electoral Act: Senate not Aware of Court Judgment on Section 84 (12), Says Spokesperson",
    "summarized_story": "Sunday Aborisade in AbujaThe Senate said on Friday that it was not aware of any court judgment which struck out the controversial Section 84 (12) from the newly amended Electoral Act 2022.\nThe Federal High Court sitting in Umuahia, the Abia State capital, had earlier on Friday, ordered that Section 84 (12) should be deleted from the newly amended Electoral Act 2022.\nPresident Muhammadu Buhari had penultimate week, written to the National Assembly, urging it to delete the controversial section by a way of amendment.\n“I cannot react to newspaper reports of court judgment without seeing the actual court judgment.”President Buhari had, while signing the amended Electoral Act, urged the National Assembly to delete the provision.\nThe president thereafter wrote a letter to both chambers of the National Assembly seeking an amendment by way of deleting the provision."
  },
  {
    "headline": "Court Orders AGF to Delete Section 84(12) of Amended Electoral Act",
    "summarized_story": "Emmanuel Ugwu-Nwogo in UmuahiaA Federal High Court in Umuahia Friday nullified the controversial Section 84(12) of the Amended Electoral Act and ordered the Attorney General of the Federation (AGF) “to delete it forthwith”, saying that it is unconstitutional, illegal, null and void.\nThe controversial section had pitted the National Assembly against President Muhammadu Buhari, who had extracted a promise from the federal lawmakers to remove the vexacious section before he signed the amended Electoral Act.\nFHC/UM/CS/26/2022, which had received accelerated hearing, Justice Evelyn Anyadike held that Section 84(12) of the Electoral Act, as amended, is inconsistent with Sections 66, 107, 137 and 182 of the 1999 Constituion of the Federal Republic of Nigeria as amended.\nPresident Buhari had, while signing the amended Electoral Act, urged the National Assembly to go back and delete the controversial provision as it violated the constitution and breached the rights of government appointees.\nThough he followed it up with a letter to both Chambers of the National Assembly seeking amendment by way of deleting the provision, the National Assembly members stuck to their gun and refused to do the bidding of the president."
  },
  {
    "headline": "EXCLUSIVE: How Attorney-General Malami, Amaechi, Emefiele Procured Court Order Deleting Section 84(12) Of Electoral Act, To Safeguard Their Political Ambitions",
    "summarized_story": "SaharaReporters earlier today reported that the court sitting in Umuahia, Abia State, ordered the Office of the Attorney-General of the Federation to immediately delete Section 84 (12) of the Amended New Electoral Act.\nHowever, top sources revealed to SaharaReporters on Friday night that Malami was the brains behind the court order obtained from Abia State.\n“The judgment of the Court will be recognized by the Government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\n“The provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be so treated accordingly."
  },
  {
    "headline": "EXCLUSIVE: How Attorney-General Malami, Amaechi, Emefiele Procured Court Order Deleting Section 84(12) Of Electoral Act, To Safeguard Their Political Ambitions",
    "summarized_story": "SaharaReporters earlier today reported that the court sitting in Umuahia, Abia State, ordered the Office of the Attorney-General of the Federation to immediately delete Section 84 (12) of the Amended New Electoral Act.\nHowever, top sources revealed to SaharaReporters on Friday night that Malami was the brains behind the court order obtained from Abia State.\n“The judgment of the Court will be recognized by the Government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\n“The provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be so treated accordingly."
  },
  {
    "headline": "Anti-graft Agency, EFCC Moves Ex-Anambra Governor, Obiano From Lagos To Abuja For Interrogation",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has moved former Anambra Governor, Willie Obiano to its headquarters in Abuja.\nGovernor Willie ObianoUwajaren said Obiano was still in detention and not released as reported by some newspapers.\nSee Also Breaking News BREAKING: Anti-graft Agency, EFCC Arrests Ex-Anambra Governor, Obiano At Lagos AirportObiano is also being probed over some suspicious projects, including the Umueri International Airport project whose cost was believed to be inflated.\nEFCC operatives had picked him up at the Murtala Muhammed International Airport, Lagos, around 08:30 pm on Thursday.\nHe was on his way to Houston, Texas, US, after handing over to his successor, Governor Charles Soludo."
  },
  {
    "headline": "Anti-graft Agency, EFCC Moves Ex-Anambra Governor, Obiano From Lagos To Abuja For Interrogation",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has moved former Anambra Governor, Willie Obiano to its headquarters in Abuja.\nGovernor Willie ObianoUwajaren said Obiano was still in detention and not released as reported by some newspapers.\nSee Also Breaking News BREAKING: Anti-graft Agency, EFCC Arrests Ex-Anambra Governor, Obiano At Lagos AirportObiano is also being probed over some suspicious projects, including the Umueri International Airport project whose cost was believed to be inflated.\nEFCC operatives had picked him up at the Murtala Muhammed International Airport, Lagos, around 08:30 pm on Thursday.\nHe was on his way to Houston, Texas, US, after handing over to his successor, Governor Charles Soludo."
  },
  {
    "headline": "Collapsed School Building Kills Five Children Working As Scavengers",
    "summarized_story": "Five children have been killed by a primary school building that collapsed on Saturday at UK Bello Memorial Primary School, Paiko, in the Paiko Local Government Area of Niger State.\nAccording to a source, the children, who died in the area were scavengers picking materials from a refuse dump by the fence of the school.\nThe source stated, “There is a refuse dump close to the school toilet where children usually pick up discarded materials to sell, adding that it was during such visits that the toilet collapsed on them.\n“The toilet block is outside the school building and there is a refuse dump very close to the toilet.\nAt the time of filing this report, the Public Relations Officer of Niger State Universal Basic Education Board, Idris Kolo, didn’t pick up his calls."
  },
  {
    "headline": "Why Nigeria needs a third force",
    "summarized_story": "By upset, he meant a third force — rather than the Peoples Democratic Party (PDP) — upstaging the ruling All Progressives Congress (APC).\nTo be sure, history does not favour a third force in politics, much less in Nigeria.\nIn Nigeria, the PDP and APC (in different shapes and sizes) have been dominating the terrain in the fourth republic.\nPDP controlled power for 16 years, at a point threatening to rule Nigeria for 60 years non-stop.\nWe see third force typically as a “third political party” that will cause an electoral upset."
  },
  {
    "headline": "Why Nigeria needs a third force",
    "summarized_story": "By upset, he meant a third force — rather than the Peoples Democratic Party (PDP) — upstaging the ruling All Progressives Congress (APC).\nTo be sure, history does not favour a third force in politics, much less in Nigeria.\nIn Nigeria, the PDP and APC (in different shapes and sizes) have been dominating the terrain in the fourth republic.\nPDP controlled power for 16 years, at a point threatening to rule Nigeria for 60 years non-stop.\nWe see third force typically as a “third political party” that will cause an electoral upset."
  },
  {
    "headline": "Tambuwal: The situation between Buhari and Nigeria is like a forced marriage",
    "summarized_story": "Aminu Tambuwal, governor of Sokoto state, says President Muhammadu Buhari does not “understand” the dynamics of modern governance.\nTambuwal on Saturday said the relationship between the president and Nigeria is a “forced marriage”.\n“I have said this somewhere else I will repeat it, the situation between President Muhammadu Buhari and Nigeria is like that of a forced marriage between a man and a woman.\nThe president doesn’t understand Nigeria and the dynamics of modern governance.”AdvertisementTambuwal said Nigeria needs a president who understands the country and can build consensus on matters of national importance.\n“For us to address Nigeria’s challenges today, we need to have at the top of leadership of this country someone that understands Nigeria itself."
  },
  {
    "headline": "Tambuwal: The situation between Buhari and Nigeria is like a forced marriage",
    "summarized_story": "Aminu Tambuwal, governor of Sokoto state, says President Muhammadu Buhari does not “understand” the dynamics of modern governance.\nTambuwal on Saturday said the relationship between the president and Nigeria is a “forced marriage”.\n“I have said this somewhere else I will repeat it, the situation between President Muhammadu Buhari and Nigeria is like that of a forced marriage between a man and a woman.\nThe president doesn’t understand Nigeria and the dynamics of modern governance.”AdvertisementTambuwal said Nigeria needs a president who understands the country and can build consensus on matters of national importance.\n“For us to address Nigeria’s challenges today, we need to have at the top of leadership of this country someone that understands Nigeria itself."
  },
  {
    "headline": "DSS raises the alarm on 'plot' to incite ethno-religious crisis in north-central",
    "summarized_story": "The Department of State Services (DSS) says it has uncovered a plot to incite violence in some parts of the country, particularly the north-central zone.\nThe security agency said on Saturday that the plan is to “cause ethno-religious crisis, ignite reprisals and heat up the polity”.\nPeter Afunanya, public relations officer, DSS, said the sponsors of the plot “have mobilised foot soldiers and held several meetings in and outside the target areas”.\nThis is despite ongoing efforts by Government to address the issues,” the statement reads.\nIt added that those who go against the law will be made to face the consequences."
  },
  {
    "headline": "Google’s Africa internet cable to first arrive in Togo",
    "summarized_story": "Google has announced that Equiano, a subsea internet cable running through Portugal to South Africa, will first land in Togo.\nThis announcement marks a milestone in Google’s plan to provide affordable internet access in Africa by building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nLast October, Google CEO Sundar Pichai announced a plan to invest $1billion over 5 years to support digital transformation in Africa, of which project Equiano is part of.\nNitin Gajria, Managing Director of Google Sub-Saharan Africa commented, “The landing of Equiano affirms Google’s commitment to the African continent, to support Africa’s digital transformation.\nThe shutdown of Google’s Project Loon brought up questions about the fate of Google’s other internet projects targeted at Africa."
  },
  {
    "headline": "Digital Nomads: The Nigerians escaping Ukraine’s war",
    "summarized_story": "Students, all of whom are given temporary residence permits, can work unofficially or do small businesses by registering as private entrepreneurs.\n“I finished last year, and I was going to leave Ukraine this year.\nYou can’t get out that easily.”A day after Russia’s invasion, Ukraine’s president Volodymyr Zelenskyy instituted martial law and grounded commercial flights.\n“I was already applying for visas to leave Ukraine for the UK where my brother is.”Kemi’s journey is not so certain.\nIf you think your story fits the Digital Nomads bill, reach out to us here."
  },
  {
    "headline": "Big Cabal Media raises $2.3m to expand its compelling line of digital products",
    "summarized_story": "In 2021, venture capital invested $115 million in digital media globally, a tenth of the $1.1billion it funded in 2015, but not much came to Africa.\nToday, one of such exceptions, Big Cabal Media (BCM), a leading African digital media company, has announced a $2.3 million Seed funding round, emphasising its commitment to keep building exciting and authoritative media products and brands.\nBCM’s progress over the years and recent fundraise is a noteworthy example of the possibilities and opportunities in Africa’s digital media sector.\nOf the reported $4.3–$5 billion raised by African startups in 2021 whereby fintech received 53–63% of the volume, digital media companies are one of many sectors that have traditionally been overlooked in the conversation of tangible ventures.\n“Investing in Africa’s booming digital media sector aligns perfectly with MaC’s mission of supporting exceptional entrepreneurs building valuable technology companies that leverage shifts in cultural trends and behaviours."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Did you miss Apple’s first event of the year?\nI did, but I saw a recap and the best way to describe my reaction is..."
  },
  {
    "headline": "Big Cabal Media’s seed funding",
    "summarized_story": "This means that sharing your Netflix password with someone else may soon become expensive, as account sharing will incur an additional fee.\nToday, I’ll be discussing:Dream VC’s pipeline planBig Cabal Media’s seed fundingDream VC’s pipeline planNowadays, it appears that many people want to work in technology companies.\nHowever, only a small percentage are familiar with the Venture Capital (VC) industry.\nInterestingly, venture capital funding only became common in the last decade, leaving a considerable talent gap, which Dream VC was founded to fill.\nBig Cabal Media’s seed fundingIf you are on Twitter, you might likely have read content from Zikoko, TechCabal, or both."
  },
  {
    "headline": "Inside Dream VC’s plan to build a pipeline for African VC talent",
    "summarized_story": "However, very few understand or are even aware of the venture capital space, but Mark Kleyner and Cindy Ai want to demystify the space with Dream VC.\nInterestingly, VC funding only became common in the past decade, and so there is a gaping talent hole, which Dream VC was launched to fill.\nThe goal was to help them break into the VC space,” he added.\nHaving tested their hypothesis, Dream VC would be launching two programmes: the Launch into VC Program and the Investor Accelerator Program.\nLaunch into VC is a fully remote 13-week programme targeted at early-stage professionals looking to break into the VC space."
  },
  {
    "headline": "African B2B eCommerce on growth streak",
    "summarized_story": "The eCommerce startup also got a makeover, changing its name from Sokowatch to Wasoko, meaning people of the market.\nThe B2B model: Like TradeDepot, Alerzo and other eCommerce startups that have raised funds from 2021, B2B is the dominant model.\nAs B2B continues to be the go-to model for eCommerce in Africa, only time will tell how sustainable it is.\n4G Capital’s $18m fundingKenyan fintech startup, 4G Capital, has raised $18 million in a Series C round led by Lightrock.\nA touch of eCommerce: 4G Capital plans to roll out new products, including an app, later this year."
  },
  {
    "headline": "Meet P.Priime: From Sarz Academy to Carpe Diem to V",
    "summarized_story": "In a competitive and fickle industry, BusinessDay examines how a Sarz Academy graduate becomes the guy everyone wants on their team.\nHe has collaborated with artists such as Olamide in recent years, creating the majority of the tracks on his Carpe Diem album.\nBased on his prior work, this album is a testament to what P.Priime can do with an album.\nWhile there is a defined reward system for producers and songwriters in other places like the US and UK, this has not been the case for most Nigerian music producers.\nThey may need to hire a manager or lawyer who is familiar with the music industry to keep an eye on the method by which they are compensated after collaborating with artists."
  },
  {
    "headline": "Ponzi schemes: Investors’ greed or dearth of investible products?",
    "summarized_story": "Ponzi schemes are ‘investment’ schemes that promise unrealistic returns which ordinarily should be treated with caution.\n“The capital market experience starts with a bank account and eventually the distribution has to hit a bank account as well.\n“The upsurge of these schemes has undermined the reputation of the capital market and dampened investors’ confidence, among other things.\nThe National Assembly is proposing a Bill that will empower the SEC to impose stiffer punishment on promoters of Ponzi Schemes and other unregistered investment schemes.\nNo capital market can grow without discipline and adherence to laid down rules and regulations,” Yuguda told journalists after the second capital market committee meeting in 2021."
  },
  {
    "headline": "Your career is really in your hands – Damola Andah, talent manager",
    "summarized_story": "Damola Andah is a seasoned talent manager with almost a decade in hiring top talents for innovative and successful businesses within the country.\nShe held various roles, including Human Resources Project Officer, Performance and Talent Management Officer, Senior Talent Management Officer, Human Resource Business Partner, Lagos, & Southwest Regions and Head, Talent & Succession Programme Management (2019).\nWhat have you learned about people and career management over the years as an HR professional?\nFrom my experience, I would say career management is not static, and your career is really in your hands.\nWhat advice do you have for young women on career management and progression?"
  },
  {
    "headline": "Edo offers property developers 2-week window for issuance of free building plans …begins farming season March 25 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government, as part of efforts at ensuring all property in the state are with building plans, is offering property developers a 2-week window for issuance of free building plan permits.\nShe noted, “The ‘Operation show you building plan’ seeks to encourage all land developers and those building to come for their building plan in the ministry.\nThe objective of the exercise is to capture all into the Edo State Master Plan as it’s necessary for development.\nThis year’s farming season should be taken seriously as there will be an interface between farmers and off-takers.\n“The disease is a pandemic that is still ravaging some communities across local government areas in Edo State."
  },
  {
    "headline": "AAU VC Lauds Outgoing Registrar – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestTHE acting Vice Chancellor of the Ambrose Alli University, (AAU), Ekpoma, Edo State, Prof. Sonnie Adagbonyin has showered encomiums on the outgoing acting Registrar of AAU, Mr. Edward Aihevba for his outstanding achievements in office.\nHe gave the commendation while speaking at the Second Registry Lecture of the institution, titled: Administrative Imperatives for Universities: A case Study of Ambrose Alli University; delivered by the outgoing acting Registrar, Mr. Edward Aihevba.\nThe acting vice chancellor asserted that the outgoing Registrar in his short time in office recorded numerous achievements which were of benefit to the staff, students and the university in general.\nPraised the registry department and outgoing Registrar for the registry lecture initiative, and called on other departments of the university to emulate the registry department by organising similar lectures for staff members.\nHe explained that the registry lecture was introduced in his time as acting Registrar because of his desire to broaden and sharpen the administrative skills of staff of the registry for optimum performance."
  },
  {
    "headline": "Obaseki partners centre on construction of Benin Cultural Village, assures policies to preserve Edo heritage – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has assured support for the construction of the Benin Cultural Village, being built by the Benin Cultural Heritage Centre (BCHC), reassuring that his government will sustain policies and reforms to preserve the state’s rich cultural heritage.\nObaseki, who received the executives and members of the Benin Cultural Heritage Centre on a courtesy visit at the Government House, said his government is paying critical attention to the state’s cultural assets to boost social-economic activities in the culture and tourism sector.\nWe have huge plans for our history and cultural heritage as this administration has a lot to showcase, knowing it can drive our Internally Generated Revenue (IGR) in Edo State.\n“Our governor is very passionate about our cultural heritage.\n“We have trained 300 teachers in Edo language and the government has employed them.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo Community head send SOS to Security Agencies – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe people of Ogheghe Community, Uhuowmonde Local Government Area of Edo State has notified security agencies in the state over the planned attacked by some evil doers been spearheaded by the current chief priest Samuel Emokpae.\nPa Kingsley Iziengbe Amayo in a statement personally singed by him said the community has endured lasting peace since August 2017 judgment by His Royal Majesty, Oba Ewuare II.\nAccording to the statement; Priest Samuel Emokpae from all indications is bent on sabotaging the peace that we have been enjoying for the past four years.\nThe Community still and will continue to abide by the judgment of 15 August 2017 as pronounced by our Royal Majesty.\n” All we want is that various security agencies including the Nigerian Police and Army to take note of this threat by Priest Emokpae before it degenerate to crisis."
  },
  {
    "headline": "KWAƊO YA FAƊA ZUWAN ZAFI: Yadda EFCC ta damƙe Willie Obiano yayin da ya ke shirin tserewa Amurka",
    "summarized_story": ""
  },
  {
    "headline": "Saka wa jami’ar Maryam Abacha sunan mahaifiyar mu da Farfesa Gwarzo yayi abin alfahari ne gare mu – Mohammed Abacha",
    "summarized_story": ""
  },
  {
    "headline": "KYARI YA ƁALLO RUWA: ‘Yadda jami’an NDLEA ke taimakon masu shigo da muggan ƙwayoyi cikin Najeriya -Inji Kyari",
    "summarized_story": ""
  },
  {
    "headline": "TINUBU A MAJALISAR TARAYYA: ‘Ni kaɗai na cancanci takara a APC, sauran duk ‘yan a-ci-bulus ne",
    "summarized_story": ""
  },
  {
    "headline": "ZAƁEN 2023: Tinubu ya gana da Sanatocin APC, ya nemi su taimaka masa ya cika burin shugabancin Najeriya",
    "summarized_story": ""
  },
  {
    "headline": "Anyim mourns Prince Emeka Obasi, says late publisher was a unique personality",
    "summarized_story": "Anyim Pius Anyim (GCON), Nigeria’s former senate president, has commiserated with Dr. (Mrs) Betty Emeka-Obasi over the demise of her husband, Prince Emeka Obasi, describing the late publisher as a unique personality who will be sorely missed.\nObasi, a veteran journalist, publisher and public relations expert, passed away on Tuesday after an illness.\n“It was a rude shock for me to receive the very sad news of the passing of your dear husband, Prince Emeka Obasi.\nEmeka himself always sounded confident that he was going to recover fully,” Anyim said.\n“Beyond journalism, Emeka also made his mark in public issues management."
  },
  {
    "headline": "Uzodinma reacts as bandits burn Ohanaeze president, Obiozor’s home",
    "summarized_story": "Imo State governor, Hope Uzodinma, has condemned the burning of the home of the President-General of Ohanaeze Ndigbo, Prof George Obiozor by those he described as political bandits.\nGunmen had on Saturday morning razed the country home of Prof Obiozor, at Awo-Omanma in the Oru East Local Government Area of Imo State.\nUzodinma described the attack on the country home of Prof Obiozor as cowardly and a height of desperation.\nUzodinma wondered why the bandits should attack the home of a man who is not a politician but a statesman working for the good of the entire Igbo race.\nHe said it was shameful that both the sponsors and perpetrators of the violence deployed their malicious attack on an innocent man."
  },
  {
    "headline": "2023: Buhari’s aide vows not to support Tinubu’s presidential bid",
    "summarized_story": "Special adviser to President Muhammadu Buhari on political matters, Mr. Babafemi Ojudu, said he would never support the presidential ambition of Bola Ahmed Tinubu.\nOjodu who spoke in an interview with Chude Jideonwo, a media entrepreneur, on Saturday, noted that Yemi Osinbajo, Nigeria’s vice president, is a better candidate than Tinubu.\n“If I support Osinbajo, he deserves to be supported… I see the way he works, day and night, committed, not asking for things for himself, committed to the people, committed to Nigeria and well educated.\nI’m looking for a better society, a society where everybody can realise themselves.\nI’m looking for a society where some people will not pile all of a country’s resources into their accounts."
  },
  {
    "headline": "Osun debt controversy: Oyetola not distracted by mischief makers – Finance Commissioner",
    "summarized_story": "Commissioner for Finance, Mr Bola Oyebamiji stated this in a press statement in response to an earlier publication by the former commissioner.\nMr Oyebamiji said the write-up by the former commissioner is full of unsubstantiated lies, with regard to the loan repayment figures of the state.\nOyebamiji’s full statement reads, “My attention has been called, yet again, to the needless and ill-motivated vituperation from Wale Bolorunduro, the immediate past Commissioner for Finance in Osun.\nUnfortunately, a million dramatic series of lies from Dr Bolorunduro will not distract us; we remain committed as a government.\nThe Debt Management Office (DMO), Osun makes adequate monthly returns to the Debt Management Office, Abuja as a matter of duty."
  },
  {
    "headline": "Buhari Returns To Abuja From London",
    "summarized_story": "President Muhammadu Buhari has returned to the country after spending two weeks in London for a medical vacation.\nThe President was received at the Nnamdi Azikwe International Airport on Friday night by his Chief of Staff, Prof Ibrahim Gambari; Minister of FCT, Mallam Muhammed Musa Bello; Minister of Water Resources, Engr Sulieman Adamu, and other senior government officials.\nHis spokesman, Femi Adesina, explained that his early return to the country showed that all is well with the President.\nHe added that his presence will bring cohesion back to the ruling All Progressives Congress (APC) which has been in disarray in the run-up to its national convention slated for March 26, 2022.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Deleting Section 84 Of Electoral Act Will Cripple Democratic Choices – TMG",
    "summarized_story": "The Transition Monitoring Group (TMG) has called on the National Assembly not delete Section 84 (12) in the Electoral Act 2022, stating that it will cripple democratic choices.\nTMG chairman, Awwal Musa Rafsanjani, stated this on Friday during a meeting aimed at ensuring electoral transparency in the forthcoming 2023 general election.\nAccording to Rafsanjani, TMG strongly do not support the call to delete sSction 84 (12) in the new electoral law and urged the National Assembly to disregard the call.\n“So, we call on the National Assembly to totally disregard this call because this call is not meant to defend democracy.\nSo, Transition Monitoring Group is solidly calling on the National Assembly not to consider this amendment."
  },
  {
    "headline": "Deleting Section 84 Of Electoral Act Will Cripple Democratic Choices – TMG",
    "summarized_story": "The Transition Monitoring Group (TMG) has called on the National Assembly not delete Section 84 (12) in the Electoral Act 2022, stating that it will cripple democratic choices.\nTMG chairman, Awwal Musa Rafsanjani, stated this on Friday during a meeting aimed at ensuring electoral transparency in the forthcoming 2023 general election.\nAccording to Rafsanjani, TMG strongly do not support the call to delete sSction 84 (12) in the new electoral law and urged the National Assembly to disregard the call.\n“So, we call on the National Assembly to totally disregard this call because this call is not meant to defend democracy.\nSo, Transition Monitoring Group is solidly calling on the National Assembly not to consider this amendment."
  },
  {
    "headline": "Why I Slapped Obiano’s Wife – Bianca Ojukwu",
    "summarized_story": "Mrs. Bianca Odumegwu-Ojukwu, the widow of the late Biafran warlord, Chief Chukwuemeka Odimegwu Ojukwu, has said that she slapped the wife of former Anambra State governor because the latter tried to remove her hair tie, an act that is considered a sacrilege for a titled Igbo woman.\nWhile initial stories had said it was Obinano’s wife that slapped Bianca, it turned out however that the reverse was the case.\nBianca, a former Nigerian Ambassador to Spain, gave her explanations in a statement she issued in Awka, the Anambra State capital, on Friday.\nShe held on to her wig with her two hands and tried to take the wig away from me.\n“It is unfortunate that she threw all caution to the wind and imported this kind of melodrama to a state ceremony."
  },
  {
    "headline": "Why I Slapped Obiano’s Wife – Bianca Ojukwu",
    "summarized_story": "Mrs. Bianca Odumegwu-Ojukwu, the widow of the late Biafran warlord, Chief Chukwuemeka Odimegwu Ojukwu, has said that she slapped the wife of former Anambra State governor because the latter tried to remove her hair tie, an act that is considered a sacrilege for a titled Igbo woman.\nWhile initial stories had said it was Obinano’s wife that slapped Bianca, it turned out however that the reverse was the case.\nBianca, a former Nigerian Ambassador to Spain, gave her explanations in a statement she issued in Awka, the Anambra State capital, on Friday.\nShe held on to her wig with her two hands and tried to take the wig away from me.\n“It is unfortunate that she threw all caution to the wind and imported this kind of melodrama to a state ceremony."
  },
  {
    "headline": "Ex-Eagles defender, Taribo West rains prayers for Tinubu's presidential ambition (Video)",
    "summarized_story": "Former Super Eagles defender, Pastor Taribo West on Saturday led other ex-internationals in intensive prayers for Asiwaju Bola Tinubu to become president in 2023.\nThe ex-internationals led by Jay-Jay Okocha and Kanu Nwankwo had paid a visit to Tinubu in Abuja in preparation for the novelty match to mark his 70th birthday.\nTaribo West was captured in a video showering Tinubu with prayers to succeed in his presidential ambition.\nDuring the visit, Tinubu had thanked them for the gesture to organise a novelty match to mark his 70th birthday celebration.\nWatch video below"
  },
  {
    "headline": "South Australia upsets PM Morrison's party",
    "summarized_story": "Prime Minister Scott Morrison’s Liberal Party has lost power in the state of South Australia in a shock election defeat.\nThe centre-left Labour Party took power in South Australia, which has a population of about 1.8 million people, after Liberal Party leader Steven Marshall conceded defeat following the elections late on Saturday.\nMarshall is the first incumbent leader to lose power since the start of the pandemic in Australia, and raises concerns for Prime Minister Morrison who is facing a stiff contest in his re-election campaign.\nMorrison’s Liberal Party at both state and federal level have come under pressure in recent months over its handling of the latest wave of the COVID-19 pandemic, as cases and deaths soared following the arrival of the Omicron variant.\nOpposition Labor Party leader Anthony Albanese has drawn level with Morrison as preferred prime minister for the first time since the pandemic outbreak, according to a Newspoll published last week."
  },
  {
    "headline": "Flood displaces 7 communities in Niger",
    "summarized_story": "By Rita IliyaNo fewer than seven communities have been submerged by flood in Shiroro Local Government Area of Niger as a result of the ongoing construction of the Zungeru hydro electric power station.\nHe said that the federal government had made provisions for the affected communities to move to higher grounds.\nSani-Bello stated that the security agencies were synergising to fight the criminals.\nHe listed the affected communities to include Gurumana, Palei, Nmachi, Npani, Zangoro, Masuku and Magani.\nUmar called on the government to come to their aid by paying compensation to enable the affected communities to relocate to safer places."
  },
  {
    "headline": "Massive Explosion Kills Workers At BUA Cement Factory",
    "summarized_story": "On Friday, tragedy occurred at the BUA Cement PLC business in Sokoto State, when two of the company’s oil tanks exploded.\nOne of the tanks was found to be filled with diesel, while the other was found to be filled with black oil.\nAccording to sources, the two tanks combined had around five million litres of oil before the explosion.\nThe tanks were also said to be delivering diesel and black oil to the new plant.\nHe stated that they were looking into the reason of the explosion, the number of people who were injured, and the extent of the damage to the factory."
  },
  {
    "headline": "BREAKING: Gunmen Raze Ohanaeze President’s Country Home In Imo",
    "summarized_story": "On Saturday morning, gunmen set fire to the country residence of Prof George Obiozor, President-General of Ohanaeze Ndigbo, in Awo-Omanma, Oru East Local Government Area, Imo State.\nAccording to The Punch, the terrorists arrived in vehicles and threw explosive devices at the Igbo leader’s home.\nA source said, “The country home of Prof George Obiozor was burnt.\nMicheal Abattam, the state’s police spokesperson, had yet to respond to a question about the attack on Obiozor’s country residence.\nOn the same day as the attack on Obiozor’s rural residence, the Umuguma Divisional Police Headquarters in the state’s Owerri West LGA was set on fire."
  },
  {
    "headline": "EFCC Under Fire For Arresting Gov Obiano Instead Of Bola Tinubu",
    "summarized_story": "EFCC Under Fire For Arresting Gov Obiano Instead Of Bola TinubuThe Economic and Financial Crimes Commission, or EFCC, has come under fire for allegedly failing to apprehend former Lagos State Governor Asiwaju Bola Tinubu.\nAnd Omokri is shocked that the EFCC hasn’t pursued Tinubu, the former governor of Lagos State for eight years.\n“Compared to Bola Tinubu, Obiano is a saint.\nCompared to Oluremi Tinubu, Ebele is a choir mistress,” the former aide to ex-President Goodluck Jonathan tweeted.\n“Why has EFCC left Bola Tinubu, with his humongous corruption, and gone after Obiano?"
  },
  {
    "headline": "Nigeria has 2 laws, if Obiano’s wife, Bianca Ojukwu are not arrested- Falana",
    "summarized_story": "Human rights lawyer, Mr. Femi Falana (SAN), on Friday, stressed that Nigeria operates two sets of laws, one for the rich and one for the poor, if the wife of Anambra’s ex-Governor- Willie Obiano, Ebelechukwu; and a former Ambassador to Spain, Bianca Ojukwu, are not arrested for the offence of affray.\n“The offence of affray occurs when two or more people engage in a fight in public.\nThe senior advocate argued that the police would have immediately arrested the two of them, if they were not dignitaries.\nBut that is not the end of the case as the offence of affray was committed.\n“If two workers had committed affray in that ceremony, they would have been arrested, detained, and charged for disrupting the new governor’s inauguration.”"
  },
  {
    "headline": "Breaking: Again, Victor Osimhen fires brace as Napoli triumph Udinese in spectacular Seria A comeback display",
    "summarized_story": "Super Eagles star Victor Osimhen became the fourth African to score a double-figure in two consecutive Serie A seasons after his brace helped Napoli to a vital 2-1 victory against Udinese at the Stadio Diego Armando Maradona.\nNapoli started the game on top, seeing more of the ball, and trying to break down the Udinese defence.\nAnd just seven minutes after the restart, Osimhen came in handy for Luciano Spalletti’s team.\nEleven minutes later, Osimhen scored his eleventh Serie A goal of the season after latching on to a pass from Giovanni Di Lorenzo to make it 2-1 for Napoli.\nNapoli held out for the remaining 27 minutes to ensure a 2-1 victory, and were further aided after Pablo Mari was sent off in the 83rd minute."
  },
  {
    "headline": "Russian forces kidnapping Ukrainian citizens, blocking aid – Official",
    "summarized_story": "A top official in Mariupol accused Russian forces of taking thousands of Ukrainian citizens against their will across the border into Russia.\nAid agencies are being prevented from reaching people trapped in Ukrainian cities surrounded by Russian forces, the UN’s World Food Programme has said.\nEmergency coordinator Jakob Kern told AFP that “the challenge is to get to the cities that are encircled or about to be encircled,” describing the situation as “dire”.\nHe said it has been almost impossible to deliver emergency supplies to the besieged port city of Mariupol, the northeastern city of Kharkiv and the northeastern city of Sumy.\nHe added that it was a tactic that was “unacceptable in the 21st century”."
  },
  {
    "headline": "Breaking: Hoodlums ‘attack’ Ohaneze Ndigbo President General’s house",
    "summarized_story": "The country home of the President General, Ohaneze Ndigbo Worldwide, Ambassador George Obiozor, in Oru East local government area of Imo state has been reportedly attacked by unknown gunmen early Saturday.\nAlthough, the Police Public Relations Officer(PPRO) Imo State Command, CSP Mike Abattam, is yet to confirm the incident as at the time of filing this report, Blueprint gathered that part of the house was burnt by the hoodlums.\nThe attack happened about the same time another Police station was invaded by gunmen in Umuguma, killing two operatives.\nIncidentally, Ambassador Obiozor was not at home when the incident happened.\nDetails loading…"
  },
  {
    "headline": "DSS Warns Of Plot To Stoke Violence In North-Central, Organise Mass Protest",
    "summarized_story": "The Department of State Services on Saturday said it was aware of a plot to incite violence in parts of the country, especially the North-Central.\nAccording to a statement signed by DSS spokesperson Peter Afunanya, the aim is to cause ethno-religious crisis and destabilise the country.\nThe Service also said there were plans to use students and labour unions to organise a massive protest like #EndSARS.\nREAD ALSO: President Buhari Doesn’t Understand Nigeria – TambuwalIt advised citizens to engage the government only based one existing rules.\n“Those who may wish to go contrary to the law will, however, face the consequences,” the DSS said."
  },
  {
    "headline": "President Buhari Doesn’t Understand Nigeria – Tambuwal",
    "summarized_story": "﻿Sokoto State Governor Aminu Tambuwal on Saturday said President Muhammadu Buhari lacks the capacity to govern Nigeria.\nHe made the comment during his visit to the Kaduna State PDP Secretariat to solicit support for his presidential ambitions in 2023.\nMr Tambuwal, a stalwart of the opposition PDP, has declared his intention to run for President.\n“The President doesn’t understand Nigeria and the dynamics of modern governance,” he said.\nREAD ALSO: President Buhari Returns To Abuja From London“Someone that can reach out and consult and build consensus on issues that concerns Nigerians."
  },
  {
    "headline": "FG Lists Steps Taken To Restore ‘Normal Supply Of Electricity’ Nationwide",
    "summarized_story": "The Federal Government on Saturday said it has taken several steps “towards the restoration of normal supply of electricity nationwide.”The national grid suffered shutdowns at least twice in the past week leading to blackouts across the country amid rising prices of fuel products.\nIn a statement signed by Minister of Power, Abubakar Aliyu, the government said it had made some progress to address the recent challenges.\nREAD ALSO: NERC Confirms Removal Of Electricity Subsidy“The Nigerian public may please recall that the national grid lost 1,110 MW generation capacity as a consequence of simultaneous disruptions in gas supply to the Okpai, Calabar and the Afam VI power plants,” the statement said.\n“The available generation capacity was exacerbated by the ongoing water management regime at the Kainji, Jebba and Shiroro power plants.”According to the Minister, the steps taken to address the situation include the following:"
  },
  {
    "headline": "Electoral Act: Deletion Of Section 84 (12) ‘A Great Error’, Says Falana",
    "summarized_story": "A Senior Advocate of Nigeria and human rights advocate, Femi Falana, has faulted the decision of a Federal High Court sitting in Umuahia to order he deletion of Section 84 (12) of the amended Electoral Act.\nThe section bars political appointees at any level to vote or be voted for “at the Convention or Congress of any political party for the purpose of the nomination of candidates for any election”.\nREAD ALSO: FG To Gazette Electoral Act, Remove Section Barring Political Appointees From ElectionsAccording to Justice Evelyn Anyadike, such a clause was unconstitutional.\nHowever, in a statement obtained by Channels Television on Saturday, Mr Falana argued that “the learned trial judge fell into a great error.”He added:"
  },
  {
    "headline": "Sports Minister Declares 26th NUGA Games Open In Unilag",
    "summarized_story": "The Minister for Youth and Sports Development, Sunday Dare, on Saturday officially declared the 26th Nigeria Universities Games Association (NUGA) tournament open.\nThe Games are holding at the University of Lagos.\nMr Dare said he was excited the Games were returning after seven years and urged participating athletes to show the spirit of sportmanship and complete cleanly throughout the competition.\nREAD ALSO: NUGA Games Show That Every Part Of Nigeria Is Valuable – OsinbajoVice Chancellor of the host institution, Professor Oluwatoyin Ogundipe said the institution is proud to host the Games 24 years after it last hosted.\nOver 75 institutions, both public and private, are competing in this year’s NUGA games."
  },
  {
    "headline": "Gov.Tambuwal visits PDP stakeholders in Kaduna -",
    "summarized_story": "Sokoto State Governor and Presidential aspirant on the platform of the Peoples Democratic Party (PDP) Aminu Waziri Tambuwal on Saturday visited PDP stakeholders in Kaduna over his desire to become president in 2023.\nHe noted that his ambition is aimed at rescuing Nigeria from imminent collapse.\nHe faulted the All Progressive Congress (APC) for mismanaging the socioeconomic affairs of the nation and likened the relationship between President Muhammad Buhari and the Nations as that of a failed marriage.\nThe Sokoto Governor added that having worked in the Judiciary, legislative and Executive arms of Government, he possesses the necessary qualities to provide good governance if elected.\nGovernor Tambuwal called on his Party the PDP to be strategic and deliberate in coming up with a formula for winning elections in 2023."
  },
  {
    "headline": "2023: Youths storm Bauchi streets, say 'no going back on Yahaya Bello' -",
    "summarized_story": "Vehicular movement was temporarily held up for several hours in Bauchi on Saturday when thousands of youths stormed the major streets, rallying support for the presidential aspiration of Governor Yahaya Bello of Kogi State.\nGovernor Yahaya Bello stands out.\n“All the lies they have peddled against him in the past have turned to strength for him and for us Nigerian youths.\n“You have been consistent in your call for His Excellency, Alhaji Yahaya Bello to contest for President come 2023.\nHe has demonstrated in Kogi that it is Youths O Clock, and it is paying off with all the giant strides."
  },
  {
    "headline": "We will implement Court Ruling on Electoral Act",
    "summarized_story": "The office of the Attorney General of the Federation and Minister of Justice will accordingly give effect to the Court judgment in line with the dictates of the law and the spirit of the judgment.\nThe judgment of the Court will be recognized by the Government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\nThe provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be so treated accordingly.\nThis is in line with the dictates of chapter 7, Part 4, Section 287 of the 1999 Constitution of the Federal Republic of Nigeria (as amended) on enforcement of decisions that makes it a point of duty and obligation on all authorities and persons to have the judgment of the federal High Court, among others, to be enforced."
  },
  {
    "headline": "Court Vacates Injunction against APC National Convention -",
    "summarized_story": "An FCT High Court has vacated a restraining injunction against the March 26 convention of the All Progressives Congress (APC).\nHe said the the order of November 18, 2021, has been overtaken by a recent Supreme Court judgement on a similar matter.\nSalisu Umoru, had sought to restrain the APC, Governor Buni and the Independent National Electoral Commission (INEC) from organising any convention until the determination of the suit.\nThe application seeking to set aside the November 18, 2021 ruling of the court restraining the convention was stalled on Tuesday after two lawyers, Shuaibu Aruwan (SAN) and Michael Adoyi, both announced appearances for the APC.\nIn the application dated March 9, 2022, the APC was asking for “an order of this honourable court striking out the suit in its entirety for want of jurisdiction."
  },
  {
    "headline": "Gunmen Raze Country Home of Igbo Socio-Cultural Group President in Imo State – Arise News",
    "summarized_story": "Gunmen on Saturday morning razed the country home of the president general of Ohanaeze Ndigbo, Prof George Obiozor, at Awo- Omanma in the Oru East Local Government Area of Imo state.\nOur correspondent gathered that the attackers who arrived the Igbo leader’s home in vehicles threw explosive devices at the house.\nA source said the Ohaneze Ndigbo president general, Obiozor was not at home when his house was attacked.\nThe country home of Prof George Obiozor was burnt last night.\nThe police spokesperson in the state, Micheal Abattam, had yet to respond to an inquiry concerning the attack on Obiozor’s country home."
  },
  {
    "headline": "Okey Nwosu: Politicians Believe They Can Only Actualise Their Ideas In APC or PDP; That’s Wrong",
    "summarized_story": "The Nigerian Labour Congress describes the ongoing crisis between and within the two major political parties in the house as “disrespect to democratic norms”.\nThe African Democratic Congress also has something to say about the ongoing crisis in political parties ahead of 2022/23 elections & the National Chairman, Ralphs Okey Nwosu joins ARISE News to share his thoughts."
  },
  {
    "headline": "EFCC Moves Ex-Anambra Governor Obiano to Abuja, Queries Him on Alleged N42bn Fraud",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) on Friday confirmed that the immediate-past governor of Anambra State, Willie Obiano, has been moved to Abuja for further interrogation on fraud allegations.\nIt alleged that the former governor also used part of the N42 billion to fund political activities in the state.\n“Willie Obiano was arrested for alleged misappropriation of public funds, including, N5bn Sure-P and N37billion security vote, which was withdrawn in cash,” said the EFCC.\nAnambra APC chairman, Basil Ejidike, had alleged that Obiano was “fraudulently” using the state’s security vote.\nMeanwhile, the EFCC Friday explained why it arrested the immediate past Governor of Anambra State."
  },
  {
    "headline": "Nigeria: Awka Monarch Says Obiano’s Wife Desecrated Kingdom By Fighting Bianca, Says Gods Must Be Appeased",
    "summarized_story": "The Obi of Awka Ancient Kingdom, Eze Uzu III of Awka, Austin Ndigwe on Friday declared that Ebelechukwu, wife of former governor of Anambra State, Willie Obiano had desecrated Awka by fighting Bianca, widow of late Biafran leader, Chukwuemeka Odumegwu-Ojukwu and that the Gods of the Kingdom must be appeased.\nAlso in Friday, Bianca issued a statement about the fight, alleging that Ebelechukwu was drunk when she attacked her.\nA fight that broke out on Thursday between the two women during the inauguration of Professor Charles Soludo as Governor resulted in Bianca slapping Ebelechukwu.\nBianca endorsed Obiano and called on all APGA members, including then Governor Obi to support him.\nMrs. Obiano has only seven days to apologise as demanded and directed or face serious consequences.”"
  },
  {
    "headline": "Nigeria: AGF Malami Says FG Will Immediately Gazette Electoral Act Without Nullified Section 84(12)",
    "summarized_story": "The judge, accordingly, ordered the AGF to forthwith delete Section 84(12) from the Electoral Act.\n“The provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be treated accordingly.\n“By virtue of section 318 of the Constitution, political appointees are not included in the list of persons employed in the public service.\nTo that extent, section 84 (12) of the Electoral Act was annulled on a very faulty ground.\n811) 540 Ojonye V. Onu & ORS (2018) LPELR-44223) where the appellate Courts have held that political appointees or political office holders are not public servants as provided for under the Constitution.”Emmanuel Ugwu-Nwogo in Umuahia and Alex Enumah in Abuja"
  }
]