[
  {
    "headline": "Divert infrastructural funds to tackling insecurity – Abdulsalami",
    "summarized_story": "A former Head of State, General Abdulsalam Abubakar, has advised the Federal Government to forget infrastructural development and divert all necessary funding to the security forces to secure peace in the country.\nAccording to Abdulsalam, if there is no peace, there cannot be a country as he stressed the need for government to stop every unnecessary development across the country and focus on security.\nHe said, “My suggestion is that due to the overstretching of our security forces, I think all the necessary funding should be given to the security forces.\nI suggest that we look at the unnecessary development issues in the country and do the needful to make life bearable and let us face this insecurity by diverting the necessary funding to secure peace in this country.\nWe need the support of the citizens as well to solve the numerous problems that Nigeria faces today.”Copyright PUNCH."
  },
  {
    "headline": "Suspected child trafficker nabbed with five-day-old baby in Cross River",
    "summarized_story": "A suspected child trafficker, Imabong Aniefiok-Samuel, has been arrested with a five-day old baby boy.\nThe suspect was arrested by the Anti-Human Trafficking/Child Labour Unit of the Nigeria Immigration Service in Cross River on May 19 at Peace Park in Etta Agbor area of Calabar metropolis.\nThe spokesperson for the NIS in the state, Amor Austin, said in a statement made available to journalists in Calabar on Thursday that preliminary findings revealed that it was a case of child trafficking.\n“The Comptroller of NIS in Cross River, Mrs Ijeoma Emenike, who is now an Assistant Comptroller General of NIS, has directed that the culprit be handed over to the National Agency for the Prohibition of Trafficking in Persons for further investigation and prosecution,” the statement said.\nThe state Head of Operations, NAPTIP, Mr Oba Jacob, who received the suspect and baby, said the suspect would be used to trace others who had indicated interest to buy the baby but were now on the run."
  },
  {
    "headline": "Ban on open grazing: MACBAN backs govs",
    "summarized_story": "He, therefore, commended the Nigerian Governors’ Forum for placing a ban on open grazing and called on Fulani organizations to unite as one.\n“When you look at the practice of open grazing in Nigeria, compared with what is happening internationally, Nigeria can never continue with traditional open grazing practice.\nThere is so much condemnation from Nigerian governors, Northern governors, Southern governors etc.\nAnother reason we should shy away from open grazing is the way old methods of settlements of crises between herdsmen and farmers have been abandoned.\n‘May I seize this opportunity to congratulate all the governors for the bold steps they are taking to solve the menace of open grazing, kidnapping and banditry."
  },
  {
    "headline": "CAN, TUC, PENGASSAN, CNG, others rail against Govs’ proposal of N385 per litre of petrol",
    "summarized_story": "Kindly Share This Story:By Victor Ahiuma-Young & Luminous JannamikeOUTRAGE yesterday greeted Wednesday’s recommendation by the Nigerian Governors’ Forum, NGF, that the pump price of petrol be N385 per litre.\n‘’We reject the N385 pump price a litre governors’ recommendation and want to seize this opportunity to warn that the pressure being put on the masses is becoming unbearable.\n“Meanwhile, we condemn the Governors’ proposal as insensitive and completely unacceptable.\n“Our reaction as usual is that the proposal of the governors is unreasonable as almost all their decisions on major national issues have been.\nThe only remaining option is for Nigerians to mobilize and reject any further increase in fuel pump prices."
  },
  {
    "headline": "Bee farming can generate $10bn for Nigeria annually – Envoy",
    "summarized_story": "Lot Egopija, Consul-General of Nigeria in New York has described bee farming as an ” untapped gold mine” in Nigeria capable of generating more than 10 billion US dollars in annual revenue for the country.\n“Bee farming is an untapped gold mine in Nigeria as a barrel of honey cost more than a barrel of crude oil.\n“In addition to honey, bee farming yields by-products such as beeswax, bee venom, and propolis that have industrial use in the pharmaceutical, food and beverage industries.\n“Research has shown that quality bee farming is viable in the rural areas of at least eight states across Nigeria,’’ he said.\nEgopija told the conference that as part of efforts to diversify the Nigerian economy, the Federal Government had been encouraging farmers to invest in bee farming."
  },
  {
    "headline": "Bandits kill Emir’s eldest son, others in Kontagora",
    "summarized_story": "Kindly Share This Story:By Wole MosadomiThe ancient city of Kontagora, headquarters of Kontagora Local Government Area of Niger State was, yesterday, thrown into confusion as bandits reportedly killed the son of the Emir, Alhaji Bashar Saidu Namaska, on his father’s farm.\nThe late Bashar reportedly visited the father’s farm at Masuga village close to Kontagora town when he was gunned down by the bandits.\nThe deceased, who is the Sardauna of Kontagora, had been holding forth for his father, Sarkin Sudan, Alhaji Saidu Namaska, who had been sick for sometime.\nBesides the death of the Emir’s son, some people working on the farm were also said to have been killed by the bandits, who also rustled an unspecified number of cows from the farm.\nAn impeccable source and top government official, who confirmed the incident, said: “It is true that bandits invaded Kontagora town and shot several people and killed the Emir’s son, Alhaji Bashar."
  },
  {
    "headline": "Ogun gas explosions: SON, others told to act fast",
    "summarized_story": "Amuzu advised Ogun residents to always take extra precautions while purchasing anything that has to do with gas.\nThe community leader said “with the fourth explosion recorded in Abeokuta, barely 48 hours after the gas explosion in Conference Hotel, it is likely that the gas in circulation are either substandard or expired.\nAccording to him, “our people, especially regular users of such gas products should be wary of purchasing fake, adulterated or expired gas.\nThe cause could be adulterated oxyacetylene gas in circulation, thus gas consumers should be more conscious”.\nHe commiserated with the families of those affected by the gas explosions, praying God to console them."
  },
  {
    "headline": "Air Peace passengers sleep in Lagos airport after delayed flight",
    "summarized_story": "Dozens of Air Peace passengers, Thursday night, slept inside the Arrival Hall at the MM1 wing of the Lagos airport, Nigeria’s busiest.\nAir Peace customers condemned treatment by the company and wondered whether the airline forgot a curfew was in place.\nI’m sure regardless of the time, Air Peace staff would make it home or to hotels.\nDAILY POST gathered that aside Air Peace, Aero Contractors, Arik Air and Max Air are yet to serve passengers refreshments.\nAttempts to engage Air Peace management over the midnight experience failed as none was available for comment."
  },
  {
    "headline": "Investigate what led to death of Ogbomoso toddler",
    "summarized_story": "A former Governor of Oyo State, Otunba Christopher Adebayo Alao-Akala has urged Governor Seyi Makinde of the State to without further delay, investigate what led to the death of a toddler in Ogbomoso on Thursday.\nDAILY POST had reported how a toddler was allegedly killed on Thursday in Ogbomoso during a Peoples Democratic Party (PDP) campaign.\nThe governor who was in Ogbomoso ahead of Saturday’s local government election had said that his convoy was not the one responsible for the death of the deceased.\nBut, Alao-Akala while reacting, called on Makinde to ensure that a thorough investigation is carried out to unravel what led to the death of the toddler.\n“The sad and unfortunate event is heart wrenching seeing the father of the little girl carrying the lifeless body of his once upon a time go lucky, bubbly little girl in tears and anguish."
  },
  {
    "headline": "Gov Umahi gives reason people of S/East support ESN, hits back at Malami",
    "summarized_story": "Governor Dave Umahi of Ebonyi State has said that anyone opposed to the ban on open grazing is saying that the killings going on in different parts of the country, especially the South, should continue.\nThe Governor also pointed out that it is the killings and destruction of farms that gave birth to the Eastern Security Network, ESN, in the South East and South South, adding that although the Governors do not support the security outfit, the people tend to support it.\nRecall that the Attorney-General of the Federation and Minister of Justice, Abubakar Malami, SAN, had during the week warned the governors of the Southern region against ban on open grazing in the region.\n“And that’s of course what the Southern governors and in particular the South East are saying, ‘let’s go back to our traditional method of relationship.\nBut the people tend to support it because of the foreign herders that pretend to be rearing cattle and they’re killing people."
  },
  {
    "headline": "Niger Govt. commiserates with Emir of Kontagora over son’s death",
    "summarized_story": "Niger State Government has commiserated with the Sarkin Sudan of Kontagora, Alhaji Sa’idu Namaska over the death of his son, Alhaji Bashar Saidu Namaska.\nIn a condolence message signed by the Secretary to the Government of Niger State (SSG), Ahmed Ibrahim Matane, the Government described the deceased as an amiable and humble person.\nMatane stated that he was deeply saddened to learn about the death of Bashar Namaska, Sardaunan Kontagora and Head of Yamma adding that the deceased was an amiable and humble person.\nHe further described the death of former Director General, Niger State Public Procurement Board as painful but urged the Sarkin Sudan, Kontagora, Alhaji Saidu Namaska and the entire people of the Emirate to consider the death of Sardaunan Kontagora as an acts of God.\nBashar Namaska who was a former Director General, Niger State Public Procurement Board died in his father’s farm at Masuga village near Kontagora as a result of bandit attack."
  },
  {
    "headline": "VIDEO: Suspected kidnapper disguised as parent caught trying to abduct Abuja school kids",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "VIDEO: Lady shares horrific ordeal in Kidnappers' den",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "VIDEO: How I was offered N100m to frame Davido for murder - Aloma",
    "summarized_story": "Davido’s former personal assistant, Idris Aloma popularly known as Aloma DMW, has confessed that he was once offered a cheque of N100m to frame the singer for murder.\nAccording to Aloma, some individuals offered him a blank cheque to pin the death of Davido’s friend, Tagbo Umeike, on him.\nIn his words,“As we dey Lion Building, Tagbo lawyer show, one person show, I nor wan talk em name.\nBaba fear industry o because everybody be just dey to bring this guy down.”“They say I be fall man say make I just talk say na David kill am, say he send guys.\nBaba blank cheque dey o…100 million they make I just write say Tagbo na David kill am”."
  },
  {
    "headline": "Why I defected to APC - Ayade",
    "summarized_story": "Governor of Cross River State, Prof. Ben Ayade, has defected from the Peoples Democratic Party (PDP) to the All Progressive Congress (APC), saying the move is to “help build Nigeria.”Ayade on Thursday formally declared for the ruling party at the Cross River State Executive Council Chamber in Calabar after meeting with some APC governors in Calabar, the state capital.\n“We need all governors to recognize that it is not the party that matters.\nIt is a character, it is an honour, it is a commitment to the vision of this great nation.\n“We all need to as teamwork ahead of the president by working towards building a prosperous country that the succession worries of 2023 will come without the fears and the worries the international community has for us.\n“I believe that if every one of us as governor joins hands with Mr President, I think we can sit on the same dining table and fashion out a way to govern this country.”"
  },
  {
    "headline": "Skales threatens to beat up MC Galaxy",
    "summarized_story": "Nigerian singer, Skales has threatened to beat his colleague, MC Galaxy after calling him names.\nAlthough Skales did not disclose what transpired between them but it was clear the duo are not on good terms.\nAccording to Skales, Mc Galaxy is ‘a stupid, smelling, fvck boy.’Skales who took to his Insta Stories to make their fight public, wrote:“One day, i go beat that stupid smelling Mc Galaxy… Fuck boy”Shortly after he made the Instagram post, the other aggrieved party (Mc Galaxy) who also doubles as a producer replied his colleague.\nIn his response, MC Galaxy described Skales as a broke boy who collects money from women.\nMC Galaxy’s response reads:“Broke boys wey dey collect money from women can make noise sha lol, Adiok anofiii… Let me know when you are ready for the fight idiot lol… beggar lol”"
  },
  {
    "headline": "Loans repayment: Osinbajo wades into governors, CBN dispute",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaVice President Yemi Osinbajo, yesterday, waded into the disagreement between state governors and the Central Bank of Nigeria (CBN) over the repayment of the budget support facility obtained by the states.\nHowever, the CBN governor, Godwin Emefiele, insisted that the states should begin the repayment without future delay especially the monies owed to the banks.\nEkiti State Governor, Dr. Kayode Fayemi, who is also Chairman, Nigeria Governors’ Forum, reported interactions with the Finance Minister and the CBN Governor regarding the matter.\n“The CBN governor, Godwin Emefiele, also emphasised the importance of the timely repayment of loans, especially those owed to commercial banks, indicating the challenges inherent in a further delay in payment, including audit concerns.\nHe said the repayment of the commercial loans should resume this month.”"
  },
  {
    "headline": "Govs rooting for state police inviting anarchy –IGP",
    "summarized_story": "From Isaac Anumihe, AbujaInspector General of Police (IGP) has berated governors who are clamouring for state police saying they are inviting anarchy.\nSpeaking at the Open Government Partnership Week in Abuja, the IGP said those governors asking for state police are doing so for selfish purpose because they want to use the instrument of state police against their political opponents.\nThe IGP, represented by Deputy Inspector General of Police (DIG) Lemu Sanusi, said: “But state police will bring anarchy.\nIf there is an armed robbery case, a governor cannot send state police.\nHe said the government is trying to repair the damaged relationship through the Open Government Partnership."
  },
  {
    "headline": "ISWAP, Boko Haram clash allegedly kills Shekau in Sambisa Forest",
    "summarized_story": "From Molly Kilete, AbujaStrongman and Leader of the Boko Haram group is said to have been killed after an alleged deadly clash between his men and those of the Islamic State West Africa Province (ISWAP), intelligence sources have confirmed.\n“Duguri disclosed that the ISWAP fighters’ team surrounded the BH leader with his team and shooting ensued between the two factions.\nDuguri further added that Shekau detonated a bomb and killed himself when he observed that the ISWAP fighters wanted to capture him alive.\nHe averred that even yesterday, ISWAP was pursuing Abubakar Shekau and he discarded his cap and ran, but, today, the pursuit continued and he was finally killed.\n“In his response, Sulum rejoiced over the death of Abubakar Shekau and glorified God over the success."
  },
  {
    "headline": "No need for military operation in S’East –IPOB",
    "summarized_story": "From Stanley Uzoaru, OwerriIndigenous People of Biafra (IPOB) has maintained that the current military operation in the South East is needless, rather, it noted the military operation should be in the North where, it claimed, Boko Haram has conquered some communities.\nWhile condemning the military operation in the zone, IPOB Media and Publicity Secretary, Emma Powerful, in a statement, said the Federal Government’s action is a plot to cause harm on the people.\n“South East and South South are not in war with anybody but Fulani terrorists supported by Nigeria government brought war in our land, killing innocent people while pointing fingers at IPOB members and Eastern Security Network operatives.\nThe Buhari-led administration and his service chiefs have no moral justification to take a military action against South East without a South Eastern in attendance at the meeting where such decision was purportedly taken,” he said.\nThey brought the war to our door steps and we have no option but to defend our ancestral land."
  },
  {
    "headline": "African finance summit: Buhari returns from France",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, on Thursday, returned to Abuja from Paris, France, where he attended the just concluded African Finance Summit.\nThe aircraft that conveyed him and some of his aides, landed at the Presidential Wing of Nnamdi Azikiwe International Airport, Abuja at about 3.52 pm.\nWhile in Paris, President Buhari participated fully in the Financing Africa Summit, held at Grande Palais Ephemere on Tuesday, with the theme: “External Financing and debt Treatment.”He also engaged in various bilateral meetings on the sidelines of the summit.\nHe was received by the Chief of Staff, Ibrahim Gambari, DG SSS, Yusuf Bichi and the Acting Inspector General of Police, Usman Baba among others."
  },
  {
    "headline": "Okonjo-Iweala: Patent Waiver Not Enough to Close Vaccine Gap",
    "summarized_story": "Emmanuel Addeh in AbujaWorld Trade Organisation (WTO) Director-General, Dr. Ngozi Okonjo-Iweala, has said that intellectual property waiver alone will not be enough to narrow the huge COVID-19 vaccine supply gap between rich and poor countries.\nOkonjo-Iweala said developing countries had complained that the licensing process was cumbersome and should be improved upon.\nShe said: “I am convinced that we can agree on a text that gives developing countries that kind of access and flexibility, whilst protecting research and innovation.\n“To have solved the unacceptable problem of inequity of access to vaccines, we have to be holistic.\nShe said although the world could manufacture some five billion vaccine doses overall, it now requires twice or three times that capacity due to the spread of the contagion."
  },
  {
    "headline": "Ayade’s Defection Redraws S’south Political Map",
    "summarized_story": "Until yesterday, the PDP controlled the six South-south states of Akwa-Ibom, Bayelsa, Cross River, Edo, Delta and Rivers.\nBesides Bunu, other governors were: Dr. Kayode Fayemi of Ekiti State; Senator Hope Uzodimma of Imo State; Hon.\nSimon Lalong of Plateau State; Senator Atiku Bagudu of Kebbi State; and Mr. Abubakar Badaru of Jigawa State.\nHe said: “I am here on behalf of the APC family to welcome His Excellency, the Executive Governor of Cross River State, formally to the APC.\nHe said the governor had displayed uncommon courage in order to take Cross River State and the South-south out of the periphery to mainstream politics of the nation."
  },
  {
    "headline": "US to Supply Nigeria Drones to Curb Insecurity",
    "summarized_story": "Davidson IriekpenThe United States government has revealed plans to supply drones to Nigeria as part of its commitment to help overcome security challenges in the country.\nThe American Ambassador to Nigeria, Ms. Mary Beth Leonard, stated this in Sokoto at a round table discussion with journalists in the state.\nShe said the drones would help Nigeria to end the activities of bandits, kidnappers, and Boko Haram in the country.\nThe American ambassador said: “Insecurity has shortchanged the development of the country in many areas of human endeavour.\nShe noted that the US government is assisting Nigeria in various human endeavours, stressing that her country is the largest single bilateral contributor to Nigeria."
  },
  {
    "headline": "Buhari Tasks Nigerians on Unity, Irrespective of Ethnic, Political Differences",
    "summarized_story": "George Okoh in MakurdiPresident Muhammadu Buhari yesterday charged Nigerians to be united irrespective of their ethnic, religious and political differences so as to work towards the growth of the country.\nAlso speaking, the Chief of Air Staff, Air Marshal Oladayo Amao said that with the three new aircraft acquired, the service now has 26 aircraft in its fleet.\n“Let me place on record that under the current administration, the NAF has inducted 23 brand new aircraft into its inventory from 2015 till date.\n“The induction of the three JF-17 thunder aircraft brings the total number of new aircraft inducted to 26.\n“These aircraft have significantly boosted our operational effectiveness in the fight to defeat all threats to the nation and its citizenry.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "OPS Rejects Petrol Price Fixing, Says It’s against Deregulation Policy",
    "summarized_story": "They described the recommendation on fixing the price as capable of complicating the quest for the deregulation of the downstream sector of the petroleum industry.\nIt is like they even want to complicate matters for the deregulation policy.\nIt is not their business.”Yusuf, however, said that “given the huge financing gaps that exist at all levels of government, it is impossible to continue to sustain the subsidy regime.\nThe opportunity cost of petrol subsidy is huge.\nHe said: “The transitioning process from a subsidy regime to a deregulated policy space calls for a strategy that is inclusive and socially sensitive."
  },
  {
    "headline": "BREAKING: Fulani Group Raises Alarm Over Plot To Carry Out Terror Attacks In Oyo",
    "summarized_story": "A nameless Fulani group said to be a faction of Miyetti Allah Cattle Breeders Association of Nigeria in the Oke-Ogun area of Oyo state on Thursday alleged of planned terror attacks in the state.\nThe group also alleged that the sons of the embattled Seriki Fulani have been training bandits in the state.\nThe group said out of the eight people fingered in the sinister plot, three of them are biological sons of the embattled Seriki Fulani.\nThe three are said to be the sons of the embattled Seriki Fulani.\nThe source therefore called on the Oyo state government to beam its searchlight henceforth on Ibarapa, Oke-Ogun in particular and Oyo state in general as well as place aforementioned names on their watchlist.\""
  },
  {
    "headline": "BREAKING: Fulani Group Raises Alarm Over Plot To Carry Out Terror Attacks In Oyo",
    "summarized_story": "A nameless Fulani group said to be a faction of Miyetti Allah Cattle Breeders Association of Nigeria in the Oke-Ogun area of Oyo state on Thursday alleged of planned terror attacks in the state.\nThe group also alleged that the sons of the embattled Seriki Fulani have been training bandits in the state.\nThe group said out of the eight people fingered in the sinister plot, three of them are biological sons of the embattled Seriki Fulani.\nThe three are said to be the sons of the embattled Seriki Fulani.\nThe source therefore called on the Oyo state government to beam its searchlight henceforth on Ibarapa, Oke-Ogun in particular and Oyo state in general as well as place aforementioned names on their watchlist.\""
  },
  {
    "headline": "Osinbajo wades into dispute between CBN, governors over budget support repayment",
    "summarized_story": "Vice-President Yemi Osinbajo has waded into the dispute between governors and the Central Bank of Nigeria (CBN) over repayment dates for the N614 billion budget support facility extended to 35 states.\nAdvertisementIn 2017, the federal government had extended the conditional facility to states through the CBN to help cushion the impact of dwindling resources and help meet their various obligations.\nDuring the national economic council (NEC) meeting held on Thursday, Kayode Fayemi, chairman of the Nigeria Governors’ Forum (NGF), insisted that his colleagues wanted the loan repayment due in May to be deferred.\nAdvertisementGodwin Emefiele, governor of the CBN, however, said that states should begin the repayment this month without further delay especially the monies owed to the banks.\nAlso, the national resources account stood at N23,650,579,140.23 as of May 20, 2021."
  },
  {
    "headline": "Osinbajo wades into dispute between CBN, governors over budget support repayment",
    "summarized_story": "Vice-President Yemi Osinbajo has waded into the dispute between governors and the Central Bank of Nigeria (CBN) over repayment dates for the N614 billion budget support facility extended to 35 states.\nAdvertisementIn 2017, the federal government had extended the conditional facility to states through the CBN to help cushion the impact of dwindling resources and help meet their various obligations.\nDuring the national economic council (NEC) meeting held on Thursday, Kayode Fayemi, chairman of the Nigeria Governors’ Forum (NGF), insisted that his colleagues wanted the loan repayment due in May to be deferred.\nAdvertisementGodwin Emefiele, governor of the CBN, however, said that states should begin the repayment this month without further delay especially the monies owed to the banks.\nAlso, the national resources account stood at N23,650,579,140.23 as of May 20, 2021."
  },
  {
    "headline": "Okorocha refused to register with APC in Imo, says Uzodimma",
    "summarized_story": "Hope Uzodimma, governor of Imo, says Rochas Okorocha, his predecessor, refused to be registered as a member of the All Progressives Congress (APC) in the state.\nAdvertisementSpeaking when he received the APC registration and revalidation appeal committee in Owerri, the Imo capital, on Thursday, the governor maintained that he has promoted an all-inclusive process in the state, irrespective of affiliations.\nI recall getting a phone call from the governor of Niger state, telling me that the former governor, Okorocha, complained,” he said.\nAnd I told the speaker, if INEC registration in Imo state is four point something million, you must get me three million.\nIn his remarks, Farouk Aliyu, head of the APC committee, explained that the visit is to ensure that everyone interested in joining the APC is registered."
  },
  {
    "headline": "Okorocha refused to register with APC in Imo, says Uzodimma",
    "summarized_story": "Hope Uzodimma, governor of Imo, says Rochas Okorocha, his predecessor, refused to be registered as a member of the All Progressives Congress (APC) in the state.\nAdvertisementSpeaking when he received the APC registration and revalidation appeal committee in Owerri, the Imo capital, on Thursday, the governor maintained that he has promoted an all-inclusive process in the state, irrespective of affiliations.\nI recall getting a phone call from the governor of Niger state, telling me that the former governor, Okorocha, complained,” he said.\nAnd I told the speaker, if INEC registration in Imo state is four point something million, you must get me three million.\nIn his remarks, Farouk Aliyu, head of the APC committee, explained that the visit is to ensure that everyone interested in joining the APC is registered."
  },
  {
    "headline": "'You're rubbishing Buhari’s government' -- senate spokesman asks Malami to resign",
    "summarized_story": "Ajibola Basiru, spokesman of the senate, says Abubakar Malami, attorney-general of the federation (AGF), is “rubbishing” the administration of President Muhammadu Buhari.\nOn Wednesday, Malami said the resolve to ban open grazing by southern governors is equivalent to prohibiting spare parts trading in the north.\nThe senator said equating the activities of nomadic herdsmen destroying peoples’ means of livelihood with others legitimately “carrying on businesses by selling spare parts in their shops stands logic on its head”.\nAdvertisement“It was not dignifying of the status of the nation’s attorney-general and minister of justice to make such remarks.\n“These kind of statements have made Nigeria a laughing stock in the comity of Nations and they ridicule the administration of President Buhari."
  },
  {
    "headline": "Stax wants you to enjoy USSD with better design, without ever dialling codes again",
    "summarized_story": "—Most people who started using mobile phones in the 2000s became familiar with USSD through loading and checking airtime balance.\nMaking USSD smartStax is a mobile app currently available only to Android users in 10 countries, including Nigeria, Uganda, Kenya and Tanzania.\nWhen a user gives Stax access, the app activates a screen reading functionality and acts as a web browser.\nStax wants the app to be under 10MB so that it will work easily on every (Android) phone.\nWith a large user base, Stax could begin enabling discovery and access to third party services, in what could make Stax a super app of sorts."
  },
  {
    "headline": "Many people have one concern: NITDA warns Nigerians against digital colonialism as Whatsapp’s new privacy policy takes effect",
    "summarized_story": "There’s also the fact that many tech users are becoming concerned about privacy and the kind of data apps collect about them.\nAlthough the pushback was intense, Whatsapp did not budge on its terms and privacy policy; instead, it decided to soft-pedal on the new terms of use and be more subtle about getting users to sign it.\nYet, countries are still concerned, and in Nigeria, the National Information Technology Development Agency (NIDTA) issued a statement Tuesday about Whatsapp.\nSmall businesses will have virtual storefronts, while bigger businesses will be able to integrate Whatsapp into their existing technology stack.\nFor now, the choice ultimately lies with users who will determine how to guard their privacy as WhatsApp’s new rules go into effect."
  },
  {
    "headline": "Nigerians mourn a painful dip day for crypto, but the rallying cry is “HODL!”",
    "summarized_story": "‘Bitcoin’, ‘Binance’, ‘Elon Musk’ and ‘Crypto’ are among top trends on Twitter.\nFrancis, a 21-year-old medical student, says more than half the value of his coins have vanished with Wednesday’s dip.\nDespite the crash in value, holders only lose when they sell off their assets at the current prices.\nTomiwa Lasebikan, co-founder of Buycoins, a Nigerian crypto exchange, is looking beyond the moment.\nTesla has 💎 🙌 — Elon Musk (@elonmusk) May 19, 2021Which, in the crypto world, is another code for “HODL!”"
  },
  {
    "headline": "TECNO Joins Android 12 Beta Program on its latest smartphone CAMON 17",
    "summarized_story": "TECNO Mobile has announced that it will join the first batch of global brands to run the new Android™ 12 Beta on its latest smartphone, the CAMON 17 series, bringing the earliest experience of Android 12 to the early adopters of newest tech.\nUsers of the TECNO CAMON 17 smartphone can download the pre-released versions of Android 12 Beta on TECNO’s official website starting on May 18th to have the early bird experience.\nAt the time Android 12 will be released later this year, all TECNO CAMON 17 devices will be among the first smartphones to receive a notice to install and experience it.\nAs an early adopter of the operating system upgrade to Android 12 beta, TECNO CAMON 17 devices will provide users a more fluid, secured and smarter experience.\nIts highly-anticipated and now launched TECNO CAMON 17 series are camera-centric smartphones having its base model as a 4G smartphone with 5000mah battery, 128GB ROM + 6GB RAM and a 6.8”dot edge-to-edge display."
  },
  {
    "headline": "ZOLA Electric boosts access to solar with robust distribution scheme …signs Blue Camel as a distribution partner to drive market penetration",
    "summarized_story": "ZOLA Electric, one of Africa’s leading renewable energy providers, has launched a robust distribution scheme to drive market penetration and access to its product in its quest to provide clean, effective, and reliable power anywhere.\nBlue Camel, a leading provider of renewable energy solutions including PV panels, solar streetlights, solar home systems, and a major distributor for global solar brands, was recently signed into the scheme.\nSigning on distribution partners will contribute significantly to help bridge the electricity supply deficit by expanding access to ZOLA’s innovative power solutions across the country.\nAdebimpe Adebisi, Business Development Manager, ZOLA Electric Nigeria; Olumide Ajayi, Group Director, Technical Operations, ZOLA Electric; Enobong Kennedy, Group Marketing Director, ZOLA Electric; Olufemi Ashipa, Ag.\nManaging Director, ZOLA Electric Nigeria and Natasha Amaefuna, Business Development Manager, ZOLA Electric during the ZOLA Electric Media Meet at the ZOLA Experience Centre in Lagos on Tuesday, May 18, 2021."
  },
  {
    "headline": "Lessons from Ethiopia, Egypt as local airlines set up maintenance facilities",
    "summarized_story": "Even as stakeholders in the sector have commended moves by domestic airlines to set up home-grown maintenance facilities, they also advise carriers to learn from African countries like Egypt, Ethiopia, Morocco and Kenya that have successfully managed their maintenance facilities.\nEthiopian Airlines has its Ethiopian Airlines MRO; South Africa runs its MRO Division, South African Airways Technical (SAAT) Airways; Egypt Air has its commercial Maintenance & Engineering MRO.\nSouth African Airways Technical (SAAT) Airways MRO also caters for carriers within South Africa and beyond.\nNigerian airlines currently carry out major checks and maintenance of their aircraft in Europe, America and Ethiopia Airlines hangar in Addis-Ababa, Ethiopia, depending on the degree of maintenance required.\nAero Contractors in the last three years maintained about eight Boeing aircraft at its maintenance facilities, implying about 92 aircraft are still being maintained outside the country as a result of absence of aircraft maintenance facilities."
  },
  {
    "headline": "FX, inflation possible consideration for a ‘hold’ as MPC meets Monday",
    "summarized_story": "The Monetary Policy Committee (MPC), chaired by the Central Bank of Nigeria (CBN), would be meeting for the third time this year on Monday and Tuesday, to decide the direction of interest rate and other macro-economic indicators.\nAhead of the meeting, analysts in the financial services sector and other stakeholders are expecting the CBN to…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Why prices of crypto currencies are dropping",
    "summarized_story": "But crypto currencies like bitcoin have potential for transforming payments and remittance in the financial services sector.\nUS banks like Goldman Sachs and JP Morgan have also provided support for their investors in crypto currencies.\nIllicit activitiesThis is one sore spot that critics of crypto currencies easily spotlight.\nBut the anonymity of crypto currencies is making it very attractive for criminals.\nIndia is also planning a review of regulation for the crypto currency market."
  },
  {
    "headline": "Budget support repayment: Osinbajo to meet stakeholders – Aide – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – Vice President Yemi Osinbajo will soon meet with representatives of state governors, the Finance Minister and Central Bank Governor to resolve the issues on repayment of budget support facility.\nHe said the governors restated their request to defer the repayment of the budget support facility that had been enjoyed by the state governments.\n“The finance minister and the CBN governor had indicated previously that the repayment of the facility ought to resume in May.\n“And today, the CBN governor also made a distinction between, in his opinion, what has to be repaid immediately and the commercial loans.\n“So, hopefully, very soon the vice president will be meeting with all the people involved to sort out this matter,’’ he said."
  },
  {
    "headline": "Nigerian Army 4 Brigade begins range competition exercise in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The 4 Brigade Nigerian Army on Thursday began a competition range exercise at the Nigerian Army Range, Ekehuan, in Benin, Edo.\nIn a statement on Thursday in Benin, Maj. Ojo Adenegan, Assistant Director, Army Public Relations of 4 Brigade Nigerian Army, said that the exercise would last until Friday.\nAdenegan said that the exercise was part of the training schedule for 2021, geared toward enhancing troops’ proficiency in weapon handling and marksmanship with fire arms.\n“This is geared toward combat readiness and preparation of troops.\n“The general public and particularly members of Ekehuan community are hereby advised to keep off the Nigerian Army Range area throughout the duration of this exercise."
  },
  {
    "headline": "Court slams N1m fine on EFCC for rights violation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – Justice Ijeoma Ojukwu, of the Federal High Court, on Thursday in Abuja, ordered the Economic and Financial Crimes Commission (EFCC), to pay N1 million to Mr Babajide Adelekan, for violation of his right.\nJustice Ojukwu, in a judgment delivered via a virtual court sitting, held that the EFCC failed to prove why Adelekan was arrested and detained.\nThe judge held that the EFCC failed to lay credible evidence before it to prove the arrest and detention of the applicant.\n“His arrest and detention exceeded what is reasonable and amounts to a violation of his right to liberty and movement.\n“I hereby make a declaration that the arrest and detention of the applicant constitute a violation of his rights as enshrined in Section 35 of the Constitution."
  },
  {
    "headline": "Gas explosion kills 1, another serioulsly injured in Obsanjo Library, Abeokuta – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABEOKUTA – A gas explosion at the Olusegun Obasanjo Presidential Library has led to the death of a technician and the serious injury of another.\nOrtese said that the incident occurred at 11.00a.m.\nand the injured technician was immediately taken to the hospital for treatment while the corpse was deposited at the morgue.\nThe official said that the emergency team of the library with support from the state fire service had contained the fire arising from the explosion.\nThe News Agency of Nigeria reports that a similar incident occurred at the hotel of former Governor Gbenga Daniel’s hotel in Abeokuta barely a week ago."
  },
  {
    "headline": "Kaduna govt, NLC reach agreement on retrenchment, strike, others",
    "summarized_story": "The Kaduna State Government and the Nigeria Labour Congress have reached an agreement on the plan by the state government to lay off workers.\nThe NLC has since Monday led workers to protest against the plan by the Kaduna government to lay off the workers.\nThe Kaduna State Government had earlier announced the sack of hundreds of university teachers and nurses for joining the strike.\n“They also said they were only trying to implement the Kaduna State Government Public Service Revitalization and Renewal Programme approved by the State Executive Council since 2016.\n“The meeting also resolved that the Committee should have as Chairman, the Head of Service of the Kaduna State Government and assisted by a Deputy National President of the NLC."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Grazing, spare parts comparison: Malami evoking dangerous ethnic fault lines – Abaribe",
    "summarized_story": "OBINNA EZUGWUSenate minority leader, Enyinnaya Abaribe, has accused the Attorney General of the Federation and Minister of Justice, Abubakar Malami of embarking on dangerous ethnic profiling, and evoking dangerous ethnic fault lines with his decision to compare spare parts business to open grazing of cattle.\nMalami had while opposing the decision of Southern governors to ban open grazing, said it was same as Northern governors deciding to ban spare parts business, a trade undertaken by mostly people of Igbo extraction.\nReacting to the Attorney General’s comment in a statement by his media aide, Uchenna Awom, Abaribe wondered if there is a correlation between cattle grazing and spare parts business, to have warranted such comparison.\n“While the local ‘bureau de change’ business mostly done by the Fulani are operating in all parts of Nigeria, why have they not elicited any resentment from other Nigerians?” Abaribe wondered.\n“Why should an Attorney General of the federation be so fixated in evoking ethnic/regional fault lines when duty calls for him to be a statesman."
  },
  {
    "headline": "Grazing ban: Malami now justice minister for Fulani herdsmen – HURIWA",
    "summarized_story": "Rights advocacy group, Human Rights Writers Association of Nigeria (HURIWA), has carpeted Nigeria’s Attorney-General and Minister of Justice, Abubakar Malami, for saying open grazing ban by Southern governors was unconstitutional.\nNational Coordinator of HURIWA, Emmanuel Onwubiko, in a statement titled, ‘HURIWA To Malami: Human Rights Aren’t Cow Rights’, said it was unfortunate that the justice minister now speaks for Fulani herders.\nMalami had while reacting to the open grazing ban by Southern governors, said the move was the same thing as Northern governors banning spare parts business.\n“It does appear that a federal Attorney General does not understand the laws in such a way that he is mixing up animal rights and human rights.\n“That the justice minister of Nigeria now speaks for armed Fulani herdsmen is an unmitigated scandal but nevertheless not very strange to us because of our personal experience in a written exchanges with the Federal Attorney General and MinisterofJustice Abubakar Malami recently."
  },
  {
    "headline": "Akeredolu tackles Malami, says comparing spare parts business to open grazing wicked, arrogant",
    "summarized_story": "Malami went on to compare open grazing to spare parts business, noting that Northern governors might as well ban spare parts dealers from operating in the North.\nBut responding to his position in a statement on Thursday, Akeredolu maintained that the ban was sacrosanct, adding that Malami’s comparison of open grazing with the selling of spare parts is annoying.\n“I have just read the press statement credited to the Attorney General of the Federation and Minister of Justice, Mr Shehu Malami SAN on the resolution of the Southern Governors Forum to ban open grazing in their respective States,” he said.\n“The AGF is quoted to have said that this reasoned decision, among others, is akin to banning all spare parts dealers in the Northern parts of the country and is unconstitutional.\n“The decision to ban open grazing stays."
  },
  {
    "headline": "Why I joined APC – Cross River gov, Ben Ayade",
    "summarized_story": "Cross River State governor, Ben Ayade, has explained that he defected from the Peoples Democratic Party (PDP) to the All Progressive Congress (APC) to “help build Nigeria.”The Cross River governor is the second PDP governor to join APC, after Dave Umahi of Ebonyi State.\nAyade announced his defection on Thursday after meeting with some APC governors in Calabar, the state capital.\nHe noted that he is committed to joining forces with President Muhammadu Buhari in building a country we can be proud of.\n“I am here on behalf of the APC family to welcome his excellency the executive governor of Cross River State formally to the APC.\nAs from today, he is the leader of the party in the state,” he said."
  },
  {
    "headline": "Africa Mini-Football Nations Cup: AMC Boss Thumbs Up Nigeria’s Facilities",
    "summarized_story": "The president of Africa Mini-Football Confederation, Achraf Ben Salha, has expressed satisfaction with the facilities at the Ilaji Sports Resort in Ibadan, venue of the forthcoming 2nd Africa Mini-Football Confederation Nations Cup.\nHe gave the thumbs up after inspecting the facilities that would host the second edition of the Africa Mini-Football Confederation Nations Cup scheduled for July 8 to 17, 2021.\nBen Salha, who is also the vice president of the World Mini-Football Federation, was accompanied on the inspection tour of the facilities by a member of AMC, Tarik Zakaria.\n“I am here in Nigeria as the eyes of the World Mini-Football Federation and all presidents of the African Mini-Football Confederations,” he added.\nChairman of the Nigeria Mini-Football Association, Hon Oluyemi Adewale Taiwo, said all hands are on the deck to ensure successful hosting of the tournament."
  },
  {
    "headline": "THE HEALTH FINANCING CONUNDRUM: What Can Be Done To Increase Healthcare Funding In Africa?",
    "summarized_story": "One of the challenges experienced in the healthcare sector is the substantial out-of-pocket payment that individuals pay for healthcare which currently stands at approximately 70 per cent.\nApproximately 35 per cent of total health expenditure went to pharmacies and patent medicine vendors, and 40 per cent of the patients who accessed privately provided healthcare belonged to the low socio-economic strata, showing how regressive the healthcare financing system has become.\nMany state governments have established state health insurance schemes, but coverage and accessibility, especially given the large informal sectors of the population, are still major concerns.\nAfrican Presidents and Ministers of Health from the continent need to build on such discussions and strategise on how to generate sustainable domestic financing for healthcare, and gradually move away from donor dependency in the funding of healthcare programmes.\nEngaging the private sector in such discussions will be critical to achieving optimal healthcare financing in Africa."
  },
  {
    "headline": "FEATURES: When Selection Of Vice Chancellors Becomes Do-or-die Affair",
    "summarized_story": "In recent times, the appointment of vice chancellors in some universities has assumed everything horrible and unexpected from the citadels of learning.\nLast January, union leaders in LASU kicked against the cancellation of the process of appointing the school’s vice chancellor by Governor Babajide Sanwo-Olu.\nI know that in the past 15-20 years, you always found non-indigenes as the deputy vice chancellor.\nI challenge you to go to many universities in the country, you will find some deputy vice chancellors coming from the same village as the vice chancellor.\nPlateau State has quite a number of vice chancellors in other universities, we have a complement of vice chancellors in other universities."
  },
  {
    "headline": "CAA Region II Championship Begins May 29 In Kaduna",
    "summarized_story": "The Athletics Federation of Nigeria (AFN) will host the Confederation of Africa Athletics (CAA) region II, national championships for seniors and juniors, from Saturday May 29 to Sunday 30, 2021 in Kaduna state.\nAFN president Ibrahim Shehu Gusau, who doubles as the CAA Region II president, assured all participating nations of maximum security and protection.\nAlready, 10 out of the 15 countries in Region II have confirmed their final entries and submitted them to AFN.\nThe championship will also serve as qualification for the Tokyo Summer Olympics billed for July and August later this year.\nFor the first time in the history of the Region II championship, a half marathon will take place on the morning of May 29th to kick off the championship."
  },
  {
    "headline": "I’ve No Plan To Contest AFN Presidency, Elections – Yussuf Ali",
    "summarized_story": "The 1990 Commonwealth Games gold medalist in a statement signed by Olukayode Thomas, said his purported ambition to contest to vie for AFN presidency is the imagination of mischief-makers.\n“I am using this medium to state categorically that I don’t have any plan to contest to be a member of the AFN board or vie for the federation’s Presidency.\nAlli, who was Vice-President of AFN and Technical Director over two decades ago, also states that he is neutral in the forthcoming election.\nI wish all the contestants well and I wish whoever will put athletics and athletes first to become our next President”.\nAlli, who captained Team Nigeria to many games and championships said he will always support athletics and athletes."
  },
  {
    "headline": "EFCC recovers over N1 billion from civil servant — Daily Times Nigeria",
    "summarized_story": "Tunde Opalana, AbujaThe Chairman of Economic and Financial Crimes Commission (EFCC), Abdulrasheed Bawa on Thursday disclosed that the anti-graft agency has recovered over N1 billion lodged in one bank account from a civil servant.\nHe told the Committee that there are a lot of leakages in public service needed to be blocked.\n“After observing the proceedings and the process of investigation of the Committee, I am happy with what is happening here.\nIt is a good development that the committee is working towards blocking revenue leakages.\nAt this point in the nation’s history, it is not much about generating revenue as much as blocking leakages of revenue generated and still being generated by all these agencies of government” he stated."
  },
  {
    "headline": "Reps moves to suspend electricity tariff hike due to present hardship —",
    "summarized_story": "*Probe DISCOs transfer of consumer debtsTom Okpe, AbujaIn view of the present hardship confronting the nation, the House of Representatives has urged the Federal Government to direct the Nigerian Electricity Regulatory Commission to decline its decision to increase electricity tariff proposed for June, 2021.\nAccording to the lawmaker, the Electric Power Sector Act prescribed its funding from 15% of electricity charges paid by customers to Distribution Companies.\nHe noted that NERC, working with Distribution Companies, has increased electricity tariffs five times since 2015, the latest, 1 January 2021.\nIn a similar development, the House also resolved to investigate transferred debts incurred by old electricity customers to new users by the Distribution Companies in Nigeria.\nIt mandated the Committee on Power to engage the Distribution Companies and other relevant Regulatory Agencies, particularly NERC to find a lasting solution and report within four (4)."
  },
  {
    "headline": "Olu of Warri: Controversy over burial, coronation, as palace describes...",
    "summarized_story": "Sony Neme, WarriThe palace of the Olu of Warri has debunked the purported published dates for the burial of their revered late monarch, His Majesty, Ogiame Ikenwoli, and the coronation of Omoba Tsola Emiko, as the 21st Olu of Warri as fake.\nThis was contained in a statement dated Thursday, May 20th, and titled, “News Statement on the Coronation of the Olu of Warri, and signed by the Chairman, Media & Publicity, Prince Yemi Emiko, on behalf of the Coronation, CWC.\nThe statement reads in part: “The attention of the Palace of the Olu of Warri, and the CWC has been drawn to a purported statement, announcing dates for both the final burial rites of His Majesty, Ogiame Ikenwoli, and the coronation of Omoba Tsola Emiko, as the 21st Olu of Warri.\n“We seize this opportunity to warn all mischief makers and other social media influencers, who are always quick to release so called ‘breaking News’, to take heed and hold themselves in restraint.\n“All stories and information emanating from the Palace or CWC, must be cleared from prince Yemi Emiko, who is the chairman of Media & Publicity, and the authorized source of Information for the entire process” it added."
  },
  {
    "headline": "...Ogunsan showers encomium on Afolabi, as Marriott Hotel is launched",
    "summarized_story": "The Chairman of Executive Group and Board Member, Lagos State Security Trust Fund (LSSTF), Dr Ayo Ogunsan, has hailed business magnate, Taiwo Afolabi, over the launch of his new hotel, Marriott Hotel.\nSituated in the heart of Ikeja, Lagos, the five-star hotel boasts of state-of-the-art facilities, necessitating a commendation from Ogunsan who described Afolabi as ‘a man with big dreams and a goal-getter’.\nSpeaking with newsmen at the official launch on Wednesday, Ogunsan said: “The foundation of this hotel was laid in 2014.\n“If you care to know who Dr Taiwo Afolabi is to me, he is my ‘egbon’ (senior), mentor and inspiration.\nThe ace business magnate, Dr Taiwo Afolabi is the founder of SIFAX Group, a conglomerate with investments in maritime, aviation, haulage, hospitality, financial services and oil and gas."
  },
  {
    "headline": "Too much money! Davido acquires 2021 Rolls Royce SUV",
    "summarized_story": "Multiple award-winning artiste, Davido, is currently in a cheerful mood as he has gifted himself a brand new 2021 Rolls Royce Cullinan.\nThe singer made the announcement via social media by posting pictures of his new ‘whip’.\nThe ecstatic hitmaker revealed that this is his first Rolls Royce vehicle.\nIn the caption section of his post on Instagram, Davido advised his over 20 million followers to always remember to reward themselves.\nRolls Royce Cullinan."
  },
  {
    "headline": "Too much money! Davido acquires 2021 Rolls Royce SUV",
    "summarized_story": "Multiple award-winning artiste, Davido, is currently in a cheerful mood as he has gifted himself a brand new 2021 Rolls Royce Cullinan.\nThe singer made the announcement via social media by posting pictures of his new ‘whip’.\nThe ecstatic hitmaker revealed that this is his first Rolls Royce vehicle.\nIn the caption section of his post on Instagram, Davido advised his over 20 million followers to always remember to reward themselves.\nRolls Royce Cullinan."
  },
  {
    "headline": "NCC to Nigerians: Submit your phone IDs in three months",
    "summarized_story": "NCC to Nigerians: Submit your phone IDs in three monthsNCC to Nigerians: Submit your phone IDs in three monthsThe Nigerian Communications Commission has said Nigerians will have to submit the International Mobile Equipment Identity of their phones to it from July.\nThe NCC’s move to start the implementation of the Device Management System (a Centralised Equipment Identity Register) is backed by the President, Major General Muhammadu Buhari (retd.).\n“The implementation of a Centralised Equipment Identity Register otherwise known as Device Management System will serve as a repository for keeping records of all registered mobile phones’ International Mobile Equipment Identity and owners of such devices.\nWith the IMEI number, a phone can be tracked and located irrespective of the cellular number in it.\nAccording to an expert that helps the Nigerian Police track stolen phones, who asked for anonymity, said, “The IMEI of a phone allows us to track the phone."
  },
  {
    "headline": "NCC to Nigerians: Submit your phone IDs in three months",
    "summarized_story": "NCC to Nigerians: Submit your phone IDs in three monthsNCC to Nigerians: Submit your phone IDs in three monthsThe Nigerian Communications Commission has said Nigerians will have to submit the International Mobile Equipment Identity of their phones to it from July.\nThe NCC’s move to start the implementation of the Device Management System (a Centralised Equipment Identity Register) is backed by the President, Major General Muhammadu Buhari (retd.).\n“The implementation of a Centralised Equipment Identity Register otherwise known as Device Management System will serve as a repository for keeping records of all registered mobile phones’ International Mobile Equipment Identity and owners of such devices.\nWith the IMEI number, a phone can be tracked and located irrespective of the cellular number in it.\nAccording to an expert that helps the Nigerian Police track stolen phones, who asked for anonymity, said, “The IMEI of a phone allows us to track the phone."
  },
  {
    "headline": "Boko Haram leader, Shekau commits suicide by blowing up self",
    "summarized_story": "Abubakar Shekau, notorious Boko Haram’s leader reportedly committed suicide by blowing up himself during battle with Islamic State West Africa Province (ISWAP) fighters.\nBut HumAngle online, noted for Boko Haram/ISWAP reports, said the wanted Boko Haram fighter died after he blew up himself.\nIt was reported that Shekau’s enclave was tracked down by ISWAP using its forces based in the Timbuktu Triangle.\nHumAngle reported that after his bodyguards were subdued, Shekau surrendered and engaged in an hours-long meeting with the ISWAP fighters.\nHe has been reported dead many times since Boko Haram first began its insurgency in 2009."
  },
  {
    "headline": "Oshodi mayhem: Normalcy returns after soldiers battled hoodlums",
    "summarized_story": "By Kazeem UgbodagaNormalcy has returned to Oshodi in Lagos, Southwest Nigeria after soldiers took over the area following alleged killing of an Air Force personnel by hoodlums on Thursday.\nThere was pandemonium in the area as residents and traders scampered into safety, as soldiers engaged the hoodlums.\nBut the Lagos State Police Command said normalcy has returned to the area after the clash between soldiers and hoodlums.\nCommand’s spokesman, Muyiwa Adejobi said the police were aware of the conflict that occurred at Cappa Park/Mosafejo Oshodi at 7am.\nThe Commissioner of Police, Lagos State, CP Hakeem Odumosu has ordered that intensive patrol be emplaced in the area,” he said."
  },
  {
    "headline": "UPDATED: Many helpless As Soldiers ‘Take Over’ Oshodi, Lagos",
    "summarized_story": "Many residents and passengers are currently helpless and stranded in Oshodi, Lagos State, as soldiers have taken over major places in the area.\nSome residents heading to work were trapped in the ensuing violence while students have fled back home.\nTraders cleaning up their stores on the day of the weekly sanitation also fled just as some transporters abandoned their vehicles.\nSoldiers targeting hoodlums are currently marching across the streets.\nThe situation has compounded the traffic woe in the cosmopolitan city as there is currently no movement in and out the part of Oshodi where the rampaging soldiers are.Oshodi links other major parts of Lagos and a major bus terminal is in that part of the state."
  },
  {
    "headline": "BREAKING: Buhari Returns To Abuja After Paris Trip",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), is back to Abuja after a four-day official visit to Paris, France, to attend the African Finance Summit.\nBuhari left Abuja for Paris on Sunday and met with French President, Emmanuel Macron, and other world leaders at the event in Paris.\nBuhari was also said to have talked about the growing security threats in Sahel and Lake Chad region, political relations, and economic ties with Macron.\nBuhari landed at the Nnamdi Azikwe International Airport in Abuja this evening."
  },
  {
    "headline": "BREAKING: Explosion Rocks Obasanjo’s Library In Abeokuta, 2 Dead",
    "summarized_story": "At least two persons were killed when gas exploded within the Olusegun Obasanjo Presidential Library (OOPL) in Abeokuta, Ogun State, on Thursday morning.\nAccording to Daily Trust, the explosion occurred around 11:am at the Marcque event centre within the Presidential Library.\nIt was gathered that technicians were topping up gas into an air conditioner before it exploded.\nA worker at OOPL who spoke to newsmen in animosity said two people have been confirmed dead following the incident.\n“The two gates leading into OOPL were shut while the security guards at the gate are currently turning visitors back,” the worker said."
  },
  {
    "headline": "Your intervention was unhelpful, El-Rufai slams fellow govs",
    "summarized_story": "Kaduna state Governor Nasir El-Rufai has accused his counterparts of not giving him the support he deserved in his face-off with the Nigeria Labour Congress (NLC).\nEvery step must be therefore taken to resolve the current face-off between Kaduna state government and NLC.\nWe appeal to both the State Government and NLC to return to the negotiating table,” Kebbi state Governor and PGF Chairman Atiku Bagudu had said.\nBut at a virtual meeting of the Nigeria Governors’ Forum (NGF), El-Rufai criticised the NGF, saying the press release was not helpful.\nEl-Rufai also insinuated that there was a conspiracy against the Kaduna state government."
  },
  {
    "headline": "Breaking: Israel, Palestine effect ceasefire days after tragic air strikes",
    "summarized_story": "A ceasefire between Israel and the Palestinian militant group Hamas has come into effect.\nThe ceasefire began early on Friday, bringing to an end 11 days of bombardment in which more than 240 people have died, most of them in Gaza.\nPalestinians poured onto the streets of Gaza soon after the truce began, shouting “God is greatest and thanks to God”.\nOn Thursday more than 100 Israeli air strikes targeted Hamas infrastructure in the north of Gaza.\nHamas began firing rockets after warning Israel to withdraw from the site, triggering retaliatory air strikes."
  },
  {
    "headline": "Shekau dies, ISWAP takes over Sambisa forest",
    "summarized_story": "There was heightened fear around the Lake Chad Basin and fringes of the Sambisa forest Thursday following alleged killing of Boko Haram leader, Abubakar Shekau by the splinter group – Islamic State of West African Province (ISWAP).\nISWAP was reported to have carried out several raids on Boko Haram camps and carried away their women and children.\nISWAP recently dislodged Boko Haram in some section of the Sambisa forest, it was learnt.\nHe averred that even yesterday ISWAP was pursuing Abubakar Shekau and he Shekau discarded his cap and ran but today the pursuit continued and he was finally killed.\n“In his response, Sulum rejoiced over the death of Abubakar Shekau and glorified God over the success."
  },
  {
    "headline": "NASS laments Nigeria’s extremely high mortality indices -NigPilot",
    "summarized_story": "*Calls for prioritization of health securityNational Assembly has decried the extremely high mortality indices in Nigeria, despite huge resources sunk into the health sector over the years by the government at all levels.\nIt therefore called for prioritization of health security in the country on the template of Universal Health Coverage, which it added, cannot be achieved through the exclusive National Health Insurance Scheme being run by the federal government now.\nHe said: “This action by the legislature has become critically necessary as the country’s mortality indices have remained extremely high with minimal improvements, despite the magnitude of resources contributed to improve the statistics.\n“Although the country is making attempts to take giant strides in its pursuit of Universal Health Coverage (UHC); these efforts and whatever achievements have been recorded could be quickly eroded if health security is not prioritized.\nTanko Sununu said there is need for amendment of the existing National Health Insurance Scheme Act for actualisation of the Universal Health Coverage and by extension, health security."
  },
  {
    "headline": "NASS laments Nigeria’s extremely high mortality indices -NigPilot",
    "summarized_story": "*Calls for prioritization of health securityNational Assembly has decried the extremely high mortality indices in Nigeria, despite huge resources sunk into the health sector over the years by the government at all levels.\nIt therefore called for prioritization of health security in the country on the template of Universal Health Coverage, which it added, cannot be achieved through the exclusive National Health Insurance Scheme being run by the federal government now.\nHe said: “This action by the legislature has become critically necessary as the country’s mortality indices have remained extremely high with minimal improvements, despite the magnitude of resources contributed to improve the statistics.\n“Although the country is making attempts to take giant strides in its pursuit of Universal Health Coverage (UHC); these efforts and whatever achievements have been recorded could be quickly eroded if health security is not prioritized.\nTanko Sununu said there is need for amendment of the existing National Health Insurance Scheme Act for actualisation of the Universal Health Coverage and by extension, health security."
  },
  {
    "headline": "PDP to Buhari: Engage Nigerians at home in geo-political zones townhall meetings -NigPilot",
    "summarized_story": "Opposition Peoples Democratic Party, PDP, has charged President Muhammadu Buhari to summon courage and hold sessions with Nigerians via townhall meetings in the six geo-political zones just like the one he had with Nigerian citizens living in France.\nAccording to the PDP Spokesman, Kola Ologbondiyan , President Buhari should be bold to face Nigerians at home and give account of his administration in the last six years.\nThe PDP noted that it was not enough for President Buhari to visit far away France and attempt to use unsuspecting Nigerians living in Paris in a desperate effort to window dress the shambolic economic and security situation foisted on our nation by his failed administration.\nPresident must be reminded that his administration conducted the worst election in our national history as witnessed in the 2019 elections as well as some of the off-season elections.\n“Moreover, our party shudders that Mr. President can assert that he is committed to a multi-party system, in a situation where brazen efforts are being made by his administration to strangulate the main opposition party, with various instruments of suppression including encouraging the EFCC to unconstitutionally harass our party leaders.”The PDP stressed that it was equally jolted by Mr. President’s presentation of imaginary commitment of his administration towards security, economy, agriculture and education."
  },
  {
    "headline": "PDP to Buhari: Engage Nigerians at home in geo-political zones townhall meetings -NigPilot",
    "summarized_story": "Opposition Peoples Democratic Party, PDP, has charged President Muhammadu Buhari to summon courage and hold sessions with Nigerians via townhall meetings in the six geo-political zones just like the one he had with Nigerian citizens living in France.\nAccording to the PDP Spokesman, Kola Ologbondiyan , President Buhari should be bold to face Nigerians at home and give account of his administration in the last six years.\nThe PDP noted that it was not enough for President Buhari to visit far away France and attempt to use unsuspecting Nigerians living in Paris in a desperate effort to window dress the shambolic economic and security situation foisted on our nation by his failed administration.\nPresident must be reminded that his administration conducted the worst election in our national history as witnessed in the 2019 elections as well as some of the off-season elections.\n“Moreover, our party shudders that Mr. President can assert that he is committed to a multi-party system, in a situation where brazen efforts are being made by his administration to strangulate the main opposition party, with various instruments of suppression including encouraging the EFCC to unconstitutionally harass our party leaders.”The PDP stressed that it was equally jolted by Mr. President’s presentation of imaginary commitment of his administration towards security, economy, agriculture and education."
  },
  {
    "headline": "Ayade: PDP urges members in Cross Rivers State to remain united -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "FG Meets With Kaduna Govt, NLC To Resolve Labour Dispute",
    "summarized_story": "The Federal Government on Thursday convened a conciliatory meeting with the Kaduna State government and the Nigeria Labour Congress (NLC) to resolve the impasse that has grounded labour activities in the state.\nMr Chris Ngige, who is the Minister of Labour and Employment, presided over the meeting while NLC National President, Ayuba Wabba, led other labour leaders to the discussion.\nBut the Commissioner of Local Government Affairs in Kaduna, Jaafaru Sabi, represented Governor Nasir El-Rufai and the state government.\nOn the deliberations at the end of the meeting, Ngige told reporters that the state government delegation disagrees with the labour leaders.\nThe minister stated that the committee chaired by the Head of Service in Kaduna State was given a mandate of up to Tuesday next week to report to him."
  },
  {
    "headline": "Stop NERC From Increasing Electricity Tariff, Reps Tell FG",
    "summarized_story": "The House of Representatives has called on the Federal Government to stop the proposed increase of electricity tariff for June.\nThey stressed that it was important to direct the Nigerian Electricity Regulatory Commission (NERC) to rescind its decision on the proposed increment in view of the hard times Nigerians were going through.\nA member of the House, Aniekan Umanah, had raised a motion seeking that the nation’s electricity regulator should suspend the proposed increase in electricity tariff.\nThe lawmaker stated that the Act prescribed its funding from 15 per cent of electricity charges paid by consumers to distribution companies.\nHe decried that NERC, working with the distribution companies, had increased the tariff five times since 2015, the latest being on January 1, 2021."
  },
  {
    "headline": "Open Grazing Ban: Our Decision Is Irreversible And Will Be Enforced, Akeredolu Fires Back At Malami",
    "summarized_story": "Ondo State Governor, Rotimi Akeredolu says the decision of the Southern Governors to ban open grazing is irreversible and will be enforced.\nAkeredolu, who is also the Chairman of the Southern Governors’ Forum said they are ready to defend the legality of their decision in court.\nMr Malami is advised to approach the court to challenge the legality of the Laws of the respective States banning open grazing and the decision of the Southern Governor Forum taken in the interest of their people.\nThe decision to ban open grazing stays.\nSIGNEDARAKUNRIN OLUWAROTIMI O AKEREDOLU, SANGOVERNOR, ONDO STATE"
  },
  {
    "headline": "Governor Ayade Dumps PDP For APC",
    "summarized_story": "﻿Cross Rivers State Governor Ben Ayade has dumped the Peoples Democratic Party (PDP) for the ruling All Progressives Congress (APC).\nGovernor Ayade announced his decision on Thursday morning after a closed-door meeting with six APC governors and some members of the National Assembly who visited him at the Government House.\nAyade was elected as the governor of Cross Rivers State in 2015 under the platform of the PDP.\nAyade is the second sitting governor to have pitched his camp with the ruling APC, lately.\nSix months back, Ebonyi State governor, David Umahi, also left the PDP."
  },
  {
    "headline": "I Have Integrity, I Joined APC To Help Buhari Reduce Tension In Nigeria – Ayade",
    "summarized_story": "Ayade moved to the APC from the Peoples Democratic Party (PDP) on Thursday after months of speculations but explained, however, that he had no issue with his former party.\nThe party stood by me all through the way,” the governor said during his appearance on Channels Television’s Politics Today on Thursday.\nPDP gave me the opportunity to be a senator; PDP gave me the opportunity to be governor.\nMy decision to join APC is to join the President to reduce the tension in the country.”A ‘Depressed’ Governor?\n“That is the amount of the political structure … in Cross River State, once the governor moves, everybody moves.”"
  },
  {
    "headline": "Abiodun warns against sale of adulterated gas products",
    "summarized_story": "Following the increasing rate of Gas explosion in Ogun State, the Governor, Dapo Abiodun has warned that anyone found guilty of selling adulterated gas products or violating safety protocols in the state would be visited with the full weight of the law.\nThe Governor made this known while commiserating with families of the victims of the recent gas explosions in Abeokuta through a press release issued by his Chief Press Secretary, Kunle Somorin.\nThe release added that the Governor has also summoned a stakeholders’ meeting for Friday, May 21st 2021 to discuss the development and has been in consultations with Federal authorities to find a solution to the recent incidents.\nHe has also directed law enforcement agencies and environmental and safety personnel to move round all the nooks and crannies of the state to investigate and bring to book those found culpable of any sharp practices or negligence that could have caused the gas explosions."
  },
  {
    "headline": "Oyo Govt denies killing of a child by Governor’s convoy, commiserates with family",
    "summarized_story": "The Oyo State Government has denied reports that the convoy of the State Governor, Seyi Makinde was involved in an accident that resulted in the death of a girl.\nChief Press Secretary to the Governor of Oyo State Taiwo Adisa, responded to the news by denying that the Toyota Matrix that hit the victim was part of the Governor’s convoy.\nAccording to the governor’s aide, the vehicle lost control after its front tyres burst while in motion, close to the location of a Peoples Democratic Party (PDP) campaign rally.\nAdisa, who expressed the governor’s condolence to the family of the deceased child,said while they await further details on the identity of the driver of the ill-fated car, the people of Ogbomoso should remain calm as they are investigating the matter."
  },
  {
    "headline": "Nigeria Governors’ Chairman Fayemi Says Issues of Legislative, Judicial Autonomy Resolved",
    "summarized_story": "Chairman of the Nigeria Governora Forum Kayode Fayemi has called on the country’s judiciary and legislative workers who have been on strike for more than two months demanding the independence of the arms of government to resume.\nMr Fayemi, who is also the Governor of Ekiti State stated this on Thursday when he featured on ARISE News noting that Nigerian governors have never been opposed to judicial and legislative autonomy.\nAccording to the governor the matter has been resolved in principle and the final product conveyed to Chris Ngige, the country’s Minister of Labour and Employment.\nWatch the video…"
  },
  {
    "headline": "Nigeria: Senate Spokesman Calls For AGF Malami’s Resignation Over Stance on Open Grazing",
    "summarized_story": "Spokesman of the Nigerian Senate Ajibola Basiru has taken a swipe at the Attorney General of the Federation, Abubakar Malami over his “less than dignifying” argument of equating open grazing with southerners selling spare parts in the North.\nThe senator said the statement credited to the Nigerian Minister of Justice also ridicules the administration of President Muhammadu Buhari and therefore called for the immediate removal from office of the AGF.\nAccording to him, “it was not dignifying of the status of the Nation’s Attorney General and Minister of Justice to make such remarks.\nEquating the activities of archaic nomadic herdsmen destroying peoples means of livelihood with others legitimately carrying on businesses by selling spare parts in their shops stand logic on its head.\n“This power is derived from the Constitution, which with the Land Use Act, vested on the Governors the management of all land within the territory of the state."
  },
  {
    "headline": "Israeli Cabinet Approves Ceasefire in Gaza",
    "summarized_story": "Israeli media say Prime Minister Benjamin Netanyahu’s Security Cabinet has approved a unilateral cease-fire to halt an 11-day military operation in the Gaza Strip.\nThe decision came after heavy U.S. pressure to halt the offensive.\nIt was not immediately clear when the truce was to take effect.\nThe public broadcaster Kan said the fighting was to halt immediately, while other TV channels said it would go into effect at 2 a.m.\nIsrael unleashed a new wave of airstrikes across the Gaza Strip on Thursday and Hamas fired more rockets into Israel, despite growing signs that the sides were close to a cease-fire that would end 11 days of heavy fighting."
  },
  {
    "headline": "Aid Workers in South Sudan ‘Under Threat’",
    "summarized_story": "International observers, who are in South Sudan to monitor the implementation of the peace deal, have expressed concerns that widespread violence in the country threatens the “safety and security” of aid workers.\nLast week, a Ugandan aid worker was killed when unknown gunmen fired at a clearly marked humanitarian vehicle.\nMore than 120 aid workers have been killed in the country since the civil war broke out in December 2013.\n“Taken together, all these amount to a worrying composite picture for the safety and security of humanitarian workers,” said Charles Tai Gituai, a retired Kenyan army general, who leads the monitoring group.\nHe urged the unity government to provide a secure and enabling environment for humanitarian workers."
  },
  {
    "headline": "Nigeria: One Dead as Explosion Rocks Obasanjo Presidential Library",
    "summarized_story": "A gas explosion at the Olusegun Obasanjo Presidential Library in Abeokuta, the Ogun State capital has killed one person.\nMr Lim in a statement posted on Facebook said the incident occurred around 11:00 am on Thursday.\nThe Managing Director of the library, Vitalis Ortese, said the explosion occurred when a pair of technical vendors were conducting routine servicing of the air conditioning units.\n“The explosion, which occurred at about 11.04 am, unfortunately, led to the death of a technical vendor and serious injury of the second vendor,” Ortese said in a statement that corroborated Lim’s position.\n“The emergency team of the Library immediately took action to prevent further damages and subsequently moved the injured to the hospital."
  }
]