[
  {
    "headline": "Filling station razed as tanker explodes in Abia",
    "summarized_story": "Residents of Umuahia the Abia State capital scampered for safety on Saturday morning when a diesel-laden tanker exploded in a petrol filling station identified as Master Energy.\nIt was gathered that the tanker was discharging disel to the underground tank when the fire incident happened.\nThe fire caused panic in the area as vehicles were temporarily abandoned within the filling station.\nPeople those living close to the scene fled to avoid being caught up in the explosion.\nFirefighters were seen trying to control the fire from spreading to nearby buildings."
  },
  {
    "headline": "Olu of Ikeja: Royal families, kingmakers reject new king-designate",
    "summarized_story": "Royal families in Ikeja, the capital of Lagos State, have kicked against the nomination of 33-year-old Temitope Ibikunle as the king-designate for the vacant stool of Olu of Ikeja.\nThey said that the issues should not have degenerated to what it is at present, with the different royal families antagonising one another, if politicians had not infiltrated the families.\nFolami, who denied the claim that Muritala was not a member of any of the royal families, provided an oral historical record that linked him to Iyade and Oshoja families.\nThe kingmakers called on the state government to ensure that the will of the indigenes of Ikeja Kingdom prevailed, by approving the installation of Prince Muritala as the new king.\nSpecifically, the Oluwo of Ikeja land raised the alarm that his life was in danger owing to his stance on the issue."
  },
  {
    "headline": "NCC warns Nigerians on new ways hackers attack phones through SMS, power outage messages",
    "summarized_story": "The Nigerian Communications Commission (NCC), again, has been informed of a new high-risk, critical and Short Messaging Service-based malware, TangleBot, infecting Android mobile devices.\nTangleBot employs more or less similar tactics as the recently-announced notorious FlutBot SMS Android malware that targets mobile devices.\nThe NCC hereby reiterates that mobile users are under obligation to practice safe messaging practices and avoid clicking on any links in texts, even if they appear to come from a legitimate contact.\nFinally, telecom consumers and other Internet users should report any incident of system compromise to ngCERT via [email protected] for necessary support and technical assistance.\nThe Commission expresses its commitment to continuously inform and educate mobile telephony subscribers and Internet users in Nigeria, on cyber risks, however, they may manifest."
  },
  {
    "headline": "‘Only deaf Nigerians like Garba Shehu don’t regret voting Buhari into power’ – Benue Govt",
    "summarized_story": "Benue State Commissioner for Information, Culture and Tourism, Hon Michael Inelagwu, has said all Nigerians regret voting General Muhammadu Buhari as the nation’s president.\nHe spoke on Friday, during a world press conference he addressed in reaction to a press statement by the Senior Special Assistant to the President on Media, Mallam Garba Shehu.\nAccording to the Commissioner, only Nigerians who are deaf and can not hear the cry of citizens who are lamenting the security and economic crisis in the country, are still supporting President Muhammadu Buhari’s government.\nHe said, “It will interest Shehu to know that it is not only the Governor that regrets voting Buhari as President in 2015.\nHe added that it’s shameful for Garba Shehu to refer to President Buhari’s recommendation for the return of the century-old animal husbandry, which is not implementable in this age."
  },
  {
    "headline": "NJC becoming willing tool to intimidate judges – Wike",
    "summarized_story": "Rivers State Governor, Nyesom Wike, has accused the National Judicial Council of being “a willing tool” of intimidating judges “who are simply discharging their duties”.\nWike noted that when judges are subjected to “summary trials” and preconceived indictment by the agency, judicial independence is eroded.\nAccording to him, the NJC may be joining the league of unholy forces working against the independence of the judiciary and judicial officers.\n“There was also a time when our judges were respected all over the world for their independence, courage and credibility.\n“Again, time was when decisions from Nigerian courts were widely accepted and celebrated across the world as timeless models of judicial precedents."
  },
  {
    "headline": "Oil bunkering: Why other governors should emulate Wike – CDS",
    "summarized_story": "The Chief of Defence Staff has commended Rivers State Governor, Nyesom Wike for “taking the bull by the horn” in the fight against oil bunkering in the state.\nThe Defence Chief said there is the need for other governors in the south south region to toe the path of Governor Wike, in ensuring that the region is rid of illegal oil refining.\nHe said he was in the state as part of his tour to military formations across the Niger Delta region.\nThe CDS said the military had long wanted such a government focused strategy towards the security of oil and gas assets and hoped that other governors would emulate it.\nOn his part, Governor Nyesom Wike explained that illegal crude oil refinery operators are causing great health hazards to residents in the state and destroying the national economy."
  },
  {
    "headline": "2023: Contest for president – Arewa youths beg Dangote, Adenuga, Okonjo-Iweala, others",
    "summarized_story": "The Arewa Youth Assembly, have urged some prominent Nigerians in the private sector to join the 2023 presidential race.\nThe northern youths said people like Aliko Dangote, Femi Otedola, Ngozi Okonjo-Iweala, Mike Adenuga, among others, should contest for the presidency in 2023 to rescue Nigeria from its current state.\nThey noted that these Nigerians in the private sector have the managerial acumen and leadership skills to lead the country.\nIn the statement, Arewa youths pointed out that political leadership should not be left to the present crop of politicians.\n“We are calling and pleading with the successful private sector players to join the 2023 presidential race, they need to stand up and be counted,” they added."
  },
  {
    "headline": "NCC raises the alarm over SMS-based virus",
    "summarized_story": "The Nigerian Communications Commission (NCC) has warned of a new high-risk, critical and Short Messaging Service (SMS)-based malware, TangleBot, infecting Android mobile devices.\nTangleBot, according to the agency, employs more or less similar tactics as the recently-announced notorious FlutBot SMS Android malware that targets mobile devices.\nIt warned TangleBot also gains control of the device but in far more invasive manner than the FlutBot malware.\n“The immediate consequence is that TangleBot gains access to several different permissions when installed on a device, allowing it to eavesdrop on user communications.\n“The malware then steals sensitive data stored on the device and monitors almost every user activity, including camera use, audio conversations, and location, among other things."
  },
  {
    "headline": "Lottery contract scam: Senate seeks court settlement",
    "summarized_story": "The Senate Committee on Sports headed by Senator Obinna Ogba has told Infrastructure Regulatory and Concession Commission, Bureau for Public Procurement, and the National Lottery Regulatory Commission, to settle their disagreement with System Numeric out of Court.\nThe Lottery Commission and the Bureau for Public Procurement allegedly shunned due process in the bidding process for the LPAAS contract.\n- Advertisement -System Numeric is accusing the Lottery Commission and Bureau for Public Procurement of violating due process in the bidding process for the contract as contained in the Act establishing the Lottery Commission.\nChief executive officer of System Numeric, Chief Athan Nneji Achonu, while briefing newsmen after the interface with Committee, gave an insight into what happened.\n“This was taken to the House of Representatives and their verdict was that System Numeric was the only company that was qualified."
  },
  {
    "headline": "Why I stopped my children from contesting in Enugu, by Nwobodo",
    "summarized_story": "Former Governor of old Anambra State, Senator Jim Nwobodo has said that he stopped his children from seeking elective offices in Enugu State for other families to have a taste of elective public offices.\n“After Enugu East, Enugu West will take over, and after Enugu West, it will go to Enugu North.\nSo, after Enugu North, it goes back to Enugu East.\nThere’s an unwritten zoning system in Enugu State and that zoning system should be maintained.\nIt is very important,” he said adding “But, giving Nkanu East the position will help develop the place a bit."
  },
  {
    "headline": "Army applauds standards in amphibious training school",
    "summarized_story": "The Chief of Training of the Nigerian Army, Major General Abdulsalami has applauded the standard of training and combat readiness given to officers and men of the Amphibious Training School of the Nigeria Army located in Calabar.\nMajor Gen. AB Ibrahim made the remark on Friday during an inspection tour and commissioning of some projects in the School.\nThe Army Chief of Training noted that officers and soldiers of the Nigerian Army are given befitting training in order to discharge their constitutional role and remain professional in their assigned missions.\nHis words, “if you train well, you will bleed less in the battlefield.”- Advertisement -He particularly commended the Commandant of the Amphibious Training School, Calabar, Brig.\nGen. Frank Etim for the standards he had seen at the school and the combat skills displayed by the men and officers of the school."
  },
  {
    "headline": "Kumuyi: The reformer faces unusual push back",
    "summarized_story": "Kumuyi, founder and General Superintendent of the Deeper Christian Life Ministry, popularly known as Deeper Life Bible Church, is unusually in the heat of controversy.\nThe respected cleric is currently facing stiff opposition from some members of his church following his decision to tinker with some of its doctrines.\nThe famed preacher is also being challenged in Port Harcourt, the Rivers state capital, by a group of Deeper Life members.\nPeter Nwaoboshi, leader of the group, said they plan to meet Kumuyi in Ibadan and ask for explanations about the recent developments in the church.\nRecently, Kumuyi explained why he is taking certain steps which are being crticised by his members."
  },
  {
    "headline": "2023: Afenifere, Ohaneze, YCE, others dare APC",
    "summarized_story": "However, Afenifere, Ohaneze Ndigbo Worldwide, YCE, MBF and Pan Niger Delta Forum, (PANDEF) have insisted that all the political parties should zone their presidential ticket to the south in 2023.\nAfenifere National Publicity Secretary, Jare Ajayi, said: “Our position is that the presidency should go to the South in 2023.\nIn fact, we have said that all political parties should zone their presidential ticket to the South.\nHe said: “Every Nigerian knows it is the turn of the South East to produce the President of Nigeria in 2023.\nIt was done in 1999 when both political parties zoned their presidential ticket to the South West."
  },
  {
    "headline": "Ekiti APC guber: My victory a win for all –Oyebanji",
    "summarized_story": "From Priscilla Ediare, Ado-EkitiWinner of the All Progressives Congress (APC) governorship primary in Ekiti State, Mr Biodun Oyebanji, has described his victory as “a win for all and a win for participatory democracy.\nHe pledged to work together with other aspirants to ensure victory for the party in the June 18 governorship election in the state.\nOyebanji, who was declared winner by the Governor Baduru Abubakar-led Governorship Election Committee, polled 101,703 votes at the primary election.\nSpeaking with journalists in Ado Ekiti, Oyebanji commended members of the APC for coming out in large numbers to participate in the electoral process as a sign of deepening the internal democracy of the party.\nI hereby promise my fellow aspirants that together, we will work towards victory and a bright future for our people."
  },
  {
    "headline": "Ekiti APC primary: We carried out exercise with fear of God –Badaru",
    "summarized_story": "From Romanus Ugwu, AbujaChairman of the All Progressives Congress (APC) primary on Ekiti State governorship election, Governor Mohammad Badaru Abubakar, has declared that he conducted the exercise with utmost fear of God.\nSpeaking at the party’s national secretariat in Abuja after submitting the report of the party primary conducted on Thursday in Ekiti, the Jigawa State governor denied writing result to favour the party’s standard bearer, Biodu Oyebanji.\n“At the opening of my engagement with the aspirants, at the stakeholders meeting we held in Ekiti State, I told them that power comes from God.\nAnd believe that He knows who will be the next governor of Ekiti State even before we start this process.\nAnd we did this primary with utmost fear of God."
  },
  {
    "headline": "I can date my friend’s ex-lover if… – Uche Ogbodo",
    "summarized_story": "Nollywood actress, Uche Ogbodo, will think twice before getting romantically involved with her friend’s ex-lover.\nAccording to the single mum of two, the question about dating her friend’s ex-lover or husband is quite deep.\nWhen asked how she feels dating a younger lover like Bobby Maris, Ogbodo says she sees her man as “Mr.\n“It doesn’t make me feel anyhow that people call him my younger lover.\nI’m obviously older than my man, with a couple of years but I don’t see him as my younger lover."
  },
  {
    "headline": "Political negotiations to free Kanu on course -Mbazulike Amechi",
    "summarized_story": "And of course, I held and still hold the view that if Nnamdi Kanu is released today, it will douse the tension in the South East.\nSo, the case of Nnamdi Kanu is as important as the case of Ndigbo or the South East, generally.\nHe cannot order the court to release Nnamdi Kanu, neither has he the power to do so.\nIn the case of Nnamdi Kanu and his people, it can be solved politically.\nAre you confident that a Nigeria President of Igbo extraction is going to be possible this time?"
  },
  {
    "headline": "Osinbajo: Only Leaders Not Inspired by Personal Profit Can Bring about National Transformation",
    "summarized_story": "He added that as a model of leadership, transformational leadership operates by serving and uplifting others because it is servant leadership.\nThis is a model of leadership that is inseparable from our conception of the common good.\n“Transformational leadership is, therefore, the pursuit of the common good.\nBut the pursuit of the common good itself is not as easy as it sounds.\n“Fulfilling the immense promise of our nation requires men and women of goodwill from various communities and faiths to collaborate in advancing the common good."
  },
  {
    "headline": "US: War against Sleaze in Nigeria, Core Priority of Biden Administration",
    "summarized_story": "*Declares American President committed to supporting Nigeria’s anti-corruption initiativesBennett OghifoThe United States Consul General, Claire Pierangelo yesterday stated that countering corruption “is not only a key concern” in Nigeria but also a core United States national security priority for the President Joe Biden’s administration.\nAs a result, she said the Biden government “is committed” to supporting anti-corruption initiatives and collaborative efforts to prevent graft, strengthen investigation and prosecution of corrupt persons and institutions in Nigeria.\nPierangelo stated this when the Inter-Religious Coalition Against Corruption in Nigeria, in collaboration with the US Consulate, launched ReportMagoMago.com, a web-based portal that leverages citizen engagement to fight corruption.\nThe global anti-corruption coalition, Transparency International, last Tuesday rated Nigeria the second most corrupt country in West Africa, after Guinea.\nIn the 2021 Corruption Perceptions Index, Nigeria dropped five places, scoring 24 out of 100 points in the 2021 index."
  },
  {
    "headline": "In Move to Allow Limitless Loan Recovery, CBN Amends Operational Guidelines of Global Standing Instruction",
    "summarized_story": "James EmejoThe Central Bank of Nigeria (CBN) has amended the operational guidelines of the Global Standing Instruction (GSI) to allow for continuous and unrestricted loan recovery by Deposit Money Banks (DMBs) and financial institutions in the country.\nThe bank explained further that in effect, the GSI’s automated loan recovery feature, applicable to all loans in the industry, shall remain perpetually in place throughout the life of the loan and/or until the loan is fully repaid.\nThe guideline contains lists of sanctions to be meted on banks and financial institutions in the event of violation or misapplication of the GSI.\nThe apex bank stated further that the move was in furtherance of its mandate to promote financial system stability.\nThe central bank had in July 2020, issued a guideline on the GSI, which was aimed at enhancing loan recovery and monitoring chronic loan defaulters."
  },
  {
    "headline": "Zoning: Buhari will Guide APC on Way Forward, Says Abiodun",
    "summarized_story": "Deji ElumoyeGovernor Dapo Abiodun of Ogun State has given an assurance that President Muhammadu Buhari would give the ruling All Progressives Congress (APC) the necessary guidance to achieve equity and justice in its zoning formula, ahead of the party’s national convention scheduled for February.\nAbiodun, who spoke with newsmen yesterday at the State House, Abuja, after leading Ogun leaders of thought on a thank-you visit to the President, expressed confidence that Buhari, as the leader of APC, would continue to provide the direction to move the party forward.\nHe said: “We have a President in place, we are the party that’s in government; our President is the leader of the party.\n“We are aware that the party is working on zoning and when that is formalised and ratified by NEC, then it will be made public.\nMeanwhile, President Buhari has described roads and housing estates he inaugurated recently in Ogun as “projects of outstanding quality”."
  },
  {
    "headline": "Buhari Unveils BUA Cement’s Plant in Sokoto, Calls for More Private Sector Investment",
    "summarized_story": "The president spoke in Sokoto, at the inauguration of an ultra-modern three million metric tonnes per annum BUA Cement Sokoto line four factory.\n“In the past few weeks, I visited Ogun and Kaduna states, where I observed many private sector investments in action.\nEmefiele pointed out that the achievements so far recorded in the cement sector were not a coincidence but a reflection of the success of the backward integration policy of the Buhari administration.\n“From a job creation and economic standpoint, the Sokoto plant continues to be the largest private sector employer of labour in the North-western part of Nigeria.\n“Also, by adding value to resources mined in Nigeria, Nigeria is being saved billions of US dollars in foreign exchange that would have been spent on importation, whilst also ensuring product availability."
  },
  {
    "headline": "Military Blames Poor Network, Roads For Zamfara, Niger Killings",
    "summarized_story": "The army asserted that the roads in those areas were very poor and the communication infrastructure is also poor.\nAkpor affirmed that the whole of the South-East will be swallowed by Niger State if put inside.\nStressing that the large expanse of land in Niger State is not something that can easily block and neutralise.\nIf you put the whole of the South-East inside Niger State, it would swallow it.\n“Also, the roads in these areas are very poor, and the communication infrastructure is also poor."
  },
  {
    "headline": "Military Blames Poor Network, Roads For Zamfara, Niger Killings",
    "summarized_story": "The army asserted that the roads in those areas were very poor and the communication infrastructure is also poor.\nAkpor affirmed that the whole of the South-East will be swallowed by Niger State if put inside.\nStressing that the large expanse of land in Niger State is not something that can easily block and neutralise.\nIf you put the whole of the South-East inside Niger State, it would swallow it.\n“Also, the roads in these areas are very poor, and the communication infrastructure is also poor."
  },
  {
    "headline": "Soldiers In North-East Kick As Nigerian Army Omits Names On Rotation List Over Refusal To Pay Alleged Bribes",
    "summarized_story": "Some overstayed soldiers in the North-East region have lamented the failure of the Nigerian Army to rotate them to other areas over their refusal to give alleged bribes.\nThe Nigerian Army released the names of overstayed soldiers and names of some people who got here since 2016 are missing.\nThose of us that are still alive and our names are not on the list of overstayed soldiers and we are the most affected personnel in Borno.\nHe said: “All the soldiers under 5 brigade/145 battalion, no name on the list because we refused to pay money.\nThey refused to submit our names to the army to rotate us because we refused to pay."
  },
  {
    "headline": "Soldiers In North-East Kick As Nigerian Army Omits Names On Rotation List Over Refusal To Pay Alleged Bribes",
    "summarized_story": "Some overstayed soldiers in the North-East region have lamented the failure of the Nigerian Army to rotate them to other areas over their refusal to give alleged bribes.\nThe Nigerian Army released the names of overstayed soldiers and names of some people who got here since 2016 are missing.\nThose of us that are still alive and our names are not on the list of overstayed soldiers and we are the most affected personnel in Borno.\nHe said: “All the soldiers under 5 brigade/145 battalion, no name on the list because we refused to pay money.\nThey refused to submit our names to the army to rotate us because we refused to pay."
  },
  {
    "headline": "Group Sues Ondo Speaker, Finance Commissioner For Non-compliance With FoI Act Over N4.3billion In ‘Secret Account’",
    "summarized_story": "The case was filed by Olu Ogidan & Co law chambers at the state high court in Akure on January 18, 2022.\nOndo State House of Assembly Speaker, Oleyelogun Bamidele DavidThe state government had in 2020 announced the discovery of N4.3billion secretly kept in a bank account for 10 years.\nDonald Ojogo, Commissioner for Information, had said the account domiciled in a third-generation bank was uncovered by the Commissioner for Finance.\n“An order of mandamus ordering the 1st respondent to make available to the applicant information on evidence of expenditure by Ondo State Government the sum of N4,300,000,000.00 (Forty three billion naira) domiciled with Zenith and duly appropriated by the Ondo State House of Assembly.\n“And for such further order (s) as the court may deem fit to make in the circumstances of this application.”"
  },
  {
    "headline": "Shortage of dead bodies hindering anatomy study in Nigeria, says UNILORIN prof",
    "summarized_story": "AdvertisementAcross the globe, medical schools have had to address a shortage of dead bodies while others remain unaffected.\nThe recommendation is that you must have eight students to one dead body for use during dissection classes.\nIf you have multiple medical schools coming up across Nigeria and you don’t have the facilities to train, what are we talking about?\nAdvertisement“People just take things out of context, talking as though we would go and pick dead bodies from the streets.\nIn advanced countries, you solve this by having a system in place“People get to donate to medical schools and colleges."
  },
  {
    "headline": "FULL LIST: 10 Nigerians to receive 2022 YouTube’s black voices grant",
    "summarized_story": "YouTube has named ten Nigerians among content creators to receive grants for the development of their channels from its 2022 black voices fund.\nAdvertisementAccording to a statement on Thursday, the list includes a total of 26 African content creators selected from Kenya, Nigeria, and South Africa.\nIt also said the African creators would join a global cohort of 135 in its flagship #YouTubeBlack voices fund initiative.\nThe statement said apart from the grants to be received, those selected will also “get bespoke training, workshops and networking opportunities.”AdvertisementAlex Okosi, managing director of YouTube’s emerging markets in Europe, the Middle East and Africa (EMEA), described the selected African content creators as “outstanding”.\nCopyright 2022 TheCable."
  },
  {
    "headline": "Dowen College’s founder, board resign over Oromoni’s death",
    "summarized_story": "The management of Dowen College in Lagos has announced the retirement of several of its principal officers including Olumide Phillips, the school’s founder.\nAdvertisementIn a statement on Thursday, Dowen College said Philips and other founding members of the school’s board of governors have decided to quit their roles.\nAdvertisementOromoni’s father had claimed his child was beaten and fed a liquid chemical that eventually led to his death.\nDowen College, however, dismissed the claim, alleging that the boy sustained injuries while playing football with colleagues.\nIn the statement, the school said it is currently reviewing its policies in the wake of Oromoni’s death to forestall similar experiences in the future."
  },
  {
    "headline": "EXTRA: I’ll be Nigeria’s first female president in 2023, says Jaruma after detention",
    "summarized_story": "Hauwa Muhammed, the self-acclaimed sex therapist better known as Jaruma, has declared her interest to contest for the 2023 presidency.\nThe brand influencer also said she is determined to break the jinx in the country’s political landscape as the first female president of Nigeria.\nAdopting the slogan “Jaruma for the masses”, the sex therapist also updated her Instagram bio to include “first female president of Nigeria.”Advertisement“Jaruma, the first female president Of Nigeria.\nVote Jaruma 2023,” the post read.\nTheCable Lifestyle had earlier examined some of the issues arising from the arrest of the sex therapist."
  },
  {
    "headline": "Book on Jim Iyke’s career, life journey to launch Feb 1",
    "summarized_story": "Jim Iyke, actor, is set to launch the first volume of ‘The Gift in The Odds’, a book series he describes as giving an exclusive account of his emergence as both a successful actor and an entrepreneur.\nWith his life as a backdrop, Iyke said the book will point the searchlight on traditions, patterns, and constraints.\nAdvertisementHe said the series gives us an all-access pass to the momentous experiences of his life from childhood to date.\n“It’s a fifteen series book.\nI spoke about love, companionship, raising kids, finding your path in life alone, building startups, career development, tiers of friendship."
  },
  {
    "headline": "What do blockchain, NFT, DAO and crypto mean?",
    "summarized_story": "What do blockchain, NFT, DAO and crypto mean?\nHow it works: Standard databases store data in rows, columns and files, but blockchain stores data in blocks that are chained together.\nHow it works: Cryptos are digital currencies created on blockchain technology.\nHow it works: To put it simply, NFTs are digital works that exist on blockchain.\nHow Web3 works: Web3 will be built on the blockchain working independently from different parts of the world."
  },
  {
    "headline": "Nigerian musician Buju wanted to reward his fans, so he created an NFT project",
    "summarized_story": "After learning extensively about ethereum and NFTs, he started selling the idea of an NFT project to several Nigerian music artistes.\nBefore he knew it, it was making waves and, unknown to his many fans jamming to the song, the colourful art cover is in fact an unreleased NFT project.\nBuju had seen the NFT project as an opportunity to build a community around his fans, reward and connect with them like never before.\nI feel like it is the best way I could reward people that enjoy my music,” Buju said.\nIn this quarter, the “HeadsByBuju” project will be minted publicly and pre-sale will start."
  },
  {
    "headline": "Zimbabwean James Manyika, becomes Google’s first Senior Vice President of Technology and Society",
    "summarized_story": "Google has appointed Zimbabwean James Manyika as the company’s first Senior Vice President of Technology and Society.\nManyika will report directly to Alphabet’s (Google’s parent company) CEO Sundar Pichai and will be working on the impact of technology on society and the environment.\n“I’m thrilled that James Manyika will be joining Google’s leadership team,” Pichai said in a statement.\n“He’s spent decades working at the intersection of technology and society and has advised a number of businesses, academic institutions and governments along the way.\nManyika has advised the chief executives and founders of many of the world’s leading tech companies on strategy and growth, product, and business innovation."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "roHealth officially launches in Nigeria, provides free Health Insurance for SMBs",
    "summarized_story": "Share this article:Nigeria-based healthtech, roHealth has rolled out a free health plan coverage for SMBs in Nigeria.\n“We are a platform that gives employees greater decision-making control over their health insurance with cashback when it is not used.\nEmployees can choose from over 100 Health Plans from top HMOs in Nigeria” Olude told Techpoint at the event.\n” roHealth is on a mission to increase access to healthcare in Nigerians by providing free health Insurance for a limited period.\nSince its inception 4 months ago, over 7000 lives and 500 businesses actively use roHealth for making their health coverage decisions."
  },
  {
    "headline": "Using its credit analytics solution, Periculum wants to improve financial inclusion for Nigerians",
    "summarized_story": "Improving access to credit for underserved marketsNot all organisations have this capability, and this is where Periculum believes it has found its sweet spot.\nWhile working at these banks, he researched and discovered many underserved customers, even in Canada.\n“I started out working in the bank and discovered that we have many underserved customers, so I decided to do some research.\nAccording to Business Day, seven in ten bank customers in Nigeria lack access to credit.\nBusiness model and key differentiatorPericulum can make money in two major ways — a credit analytics and data analytics service to businesses."
  },
  {
    "headline": "There’s more to crypto than buying low and selling high",
    "summarized_story": "At times like that, crypto traders and evangelists seize every opportunity to remind everyone who isn’t into crypto trading what they are missing.\nThere’s more to crypto than tradingCryptocurrencies are used primarily for speculative purposes, buying low and selling high, but they weren’t originally created for speculation.\nAround 40% of Africa’s population — 1.3 billion — lives in extreme poverty, making crypto trading a very attractive venture.\nTransactions on the Ethereum network, the most popular network for alternative crypto usage, cost a lot.\nWhile there are new networks, Solana and Polygon, for instance, springing up and reducing the cost of crypto usage, only time will tell if alternative crypto usage will catch on in Africa."
  },
  {
    "headline": "Top 10 food items Nigerians spent most on in 2021",
    "summarized_story": "Yam tuber, maize, beans, and plantain are some of the food items that gulped the most incomes of Nigerians in 2021 as they recorded the highest increase in prices, according to data from the National Bureau of Statistics.\nThe rising food prices only put more burden on Nigeria’s poor population already struggling with stagnant income and deteriorating standard of living, according to experts.\nThe Bank also revealed that inflation has pushed 8 million more Nigerians into poverty between 2020 and 2021.\n“The rise in food inflation came on the back of huge demand during the festive season and insecurity in the food-producing areas as 15 states recorded higher food inflation rates in December 2021,” said Ayodeji Ebo, Head, Retail Investment, Chapel Hill Denham.\nIn December 2021 specifically, white beans, brown beans, yam tuber, palm oil and vegetable oil were also the food items that accounted for the highest increase in food inflation, the same items when the average for the year was taken."
  },
  {
    "headline": "How economy, security, zoning will dominate debate ahead 2023",
    "summarized_story": "That is what is obtainable in Europe and also the way to go in 2023 if Nigerians wants change,” he said.\nThat should stop in 2023 by making sure any of those non-performing politicians do not even smell party primaries”, he suggested.\nSo, reviving the economy should top the manifesto content”, she said.\nBut Luke Onwuka, an Ahuda, River State-based, mechanical engineer and oil worker, said that government should put ‘no more foreign loans’ as part of the 2023 manifesto.\nHe also said that there should be no mention of fighting corruption in the 2023 manifesto as such will be making further mockery on the intelligence of Nigeria."
  },
  {
    "headline": "MTN Nigeria grows full year profit by 45.5% to N298.7bn",
    "summarized_story": "MTN Nigeria Communications Plc (MTN Nigeria) on Friday January 28 announced its audited results for the financial year ended December 31, 2021.\nMTN Nigeria also reported enhanced guidance for service revenue growth of “at least 20percent” over the medium term.\nService revenue grew by 23.3percent, exceeding our mid-teen target, driven mainly by growth in voice, data and fintech service revenue lines.\nWe deployed 9,336 4G sites representing approximately 75percent of the total sites deployed during the period, reflecting solid data revenue growth.\nMedium-term GuidanceIn line with the accelerated growth MTNN is seeing, “we expect service revenue growth of “at least 20 percent” over the medium term."
  },
  {
    "headline": "Annual Event to Commemorate Civilian-Led Peacebuilding in Mindanao Calls Forth Collective Action to Develop Peace – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOn the 24th of January 2022, over 22,000 social representatives from 51 countries attended the international peace conference celebrating the Peace Day held virtually.\nBack in 2014, Heavenly Culture, World Peace, Restoration of Light (HWPL), an international NGO mediated the conflict in Mindanao by proposing a peace agreement by local representatives.\nBeing the first in Luzon, a peace monument in Dingras, Ilocos Norte was unveiled last January 24 as part of the 8th Anniversary event of the HWPL Peace Day celebration.\nThe event, under the theme of “Law of Peace in Heaven and on Earth”, aimed to promote interfaith harmony between religions and raise public support to establish international law for peace.\n[8th Anniversary of the January 24 HWPL Peace Day] “Law of Peace in Heaven and Earth”https://youtu.be/PtBogiRkfFo..."
  },
  {
    "headline": "LAND TUSSLE: Appeal Court Dismisses Case, Awards N15m Against Edo Community – Nigerian Observer",
    "summarized_story": "The Appeal Court also allowed the cross appeal filed by the cross appealants (Ulegun) against the cross respondents (Ukhiri Village) and awarded the sum of Fifteen Million Naira ( N15, 000,000.00) as damages against Ukhiri.\nIn a unanimous decision read by Justice Biobele Abraham Georgewill, in the main and cross appeal with suit No.\n45 hectares lying and situated at Ulegun Village in the Benin-Abraka Road, Ikpoba-Okha Local Government Area of Edo State.\nRecall that Ukhiri had on 1976 dragged Ulegun to court alleging encroachment of a portion of its land by Ulegun.\nThe case was again struck out at the Appeal Court for lack of merit along with cost awarded against the appellants over damages and trespass."
  },
  {
    "headline": "FG N4.1 Billion Customs Revenue Target: Undue Pressure On The Agency – ANLCA Boss Faults – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Association of Nigeria Licensed Customs Agents (ANLCA) has described the recent revenue target of N4.1 billion by the Federal Government on the Nigeria Customs Service (NCS) for 2022, as a high target that will put undue pressure on the agency.\nFaulting the Federal Government decision on the exorbrant target, ANLCA posited that the target would also undermine its core responsibility of facilitating trade between Nigeria and other countries.\nTony Iju Nwabunike stated this in Lagos recently during a press briefing to celebrate the four years of his executives on the leadership of the foremost freight forwarding association in Nigeria.\nNwabunike said: “We want to also advise the Federal Government to be careful before signing into the $3.1 billion Customs Modernisation Project which we heard, will run for 20 years.\n“For us, this shows more commitment by the Buhari administration to maritime matters."
  },
  {
    "headline": "CP Alabi Takes Over Leadership Of Lagos Command, Charges Officers And Men For Success – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The new Commissioner of Police, Lagos State, CP Abiodun Alabi has charged Area Commanders, DPOs/HODs and tactical commanders to translate their long-time relationship with him to success in the state.\nCP Alabi charged the officers during his maiden meeting with them shortly after taking over the mantle of leadership as Commissioner of Police in the state at a brief ceremony held on 24th January, 2022 at the Command Headquarters, Ikeja.\nThe CP also directed the Area Commanders and Divisional Police Officers to constantly engage and partner with critical stakeholders in their areas of responsibilities for effective policing.\nSpeaking further, the Commissioner of Police warned officers against corruption and infringement on fundamental human rights of Nigerians.\nHe, however, assured that he would always provide good leadership that would help them succeed in the discharge of their duties."
  },
  {
    "headline": "2023: Clerics Endorse Gov Bello’s Presidential Ambition",
    "summarized_story": "No fewer than 1,000 Islamic and Christian clerics including their followers, have drummed support for the Kogi State governor, Yahaya Bello’s 2023 presidential ambition.\nThe clerics also likened Bello to “David”, a biblical hero and man of valour who won all battles to emerge king of ancient kingdom of Israel.\nTherefore, on this divine mission and today Governor Bello will be known and called Yahaya Adoza “David” Bello henceforth.\n“We trust Governor Yahaya Bello to lead Nigeria in the right direction.\nWe are grateful, we are happy and we pray that once again, we shall all come back to this ground in the company of President Yahaya Bello to return all the glory and thanks to Allah SWT.”"
  },
  {
    "headline": "Nwoko: Aphrodisiac Seller, Jaruma, Granted Bail",
    "summarized_story": "Aphrodisiac entrepreneur, Hauwa Saidu, popularly known as Jaruma, has been granted bail after spending days in detention.\nJaruma was arraigned before an FCT High Court on charges bordering on defamation of character, false news publication and cyber intimidation of a former lawmaker and philanthropist, Ned Nwoko.\nThe billionaire businessman had accused Jaruma of publishing falsehoods on her Instagram page against him and his wife, Regina Daniels.\nJustice Ismaila Abdullahi in his ruling on Monday had ordered that Jaruma be remanded in the Suleja Correctional Centre, Niger State, pending the bail hearing on Friday.\nAbdullahi warned all parties involved in the matter to refrain from actions that could be considered prejudicial to the case."
  },
  {
    "headline": "PSN Board Of Fellows Honours New Chairman",
    "summarized_story": "The Board of Fellows, Pharmaceutical Society of Nigeria (PSN), has organised a groundbreaking reception in honour of its new chairman, Pharm.\nAdagadzu emerged chairman, Board of Follows, (PSN) in November 2021 in Port Harcourt, Rivers State, during the Annual National Conference of the PSN.\nADVERTISEMENTAdagadzu, who was full of excitement over the honour and love showered on him by fellows and friends, expressed his desire to see the country becoming self-sufficient in drug production.\n“It is high time Nigeria is also able to engage in the production of primary raw materials.\nAdagadzu, also urged the pharmacists to sponsor people at the state and federal level to take up political positions."
  },
  {
    "headline": "PSN Board Of Fellows Honours New Chairman",
    "summarized_story": "The Board of Fellows, Pharmaceutical Society of Nigeria (PSN), has organised a groundbreaking reception in honour of its new chairman, Pharm.\nAdagadzu emerged chairman, Board of Follows, (PSN) in November 2021 in Port Harcourt, Rivers State, during the Annual National Conference of the PSN.\nADVERTISEMENTAdagadzu, who was full of excitement over the honour and love showered on him by fellows and friends, expressed his desire to see the country becoming self-sufficient in drug production.\n“It is high time Nigeria is also able to engage in the production of primary raw materials.\nAdagadzu, also urged the pharmacists to sponsor people at the state and federal level to take up political positions."
  },
  {
    "headline": "South-East, South-South Professionals Meet Over Regional Devt",
    "summarized_story": "The South-East South-South Professionals of Nigeria (SESSPN), is set to hold its annual general meeting this Sunday with central attention on the development of the two regions with consequential implications to a better Nigeria.\nIn a notice by the general secretary of the frontline advocacy group, Ireke Kalu Onuma, he stated that the regions’ development emergencies deserve continuous critical focus as the cornerstone of Nigeria’s economic sustainability and growth, hence the imperative of all professionals to attend in person or virtually.\nHe noted that development as a fruit of knowledge and good governance, the professionals challenge to make certain such knowledge is available to those that govern, for higher benefits of the governed, remain a persistent duty for key engagements.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "How gunmen raided Abuja THISDAY office",
    "summarized_story": "Some unknown gunmen raided the Abuja office of one of Nigeria’s major news outlets, THISDAY, in the early hours of Thursday.\nRelaying the account, the newspaper’s Abuja Bureau Chief, Iyobosa Uwugiaren Iyobosa, told PREMIUM TIMES that the gunmen accessed the building through the route they came when the organisation was attacked about 10 years ago.\nIn a twin attack, the newspaper offices in Abuja and Kaduna were bombed by suicide bombers on April 26, 2012, killing 11 persons and destroying the newspaper’s multi-million properties.\n“The same route they passed in 2012 was the same route they passed on Thursday to enter into the premises.\n“The people they met were the production staff – those preparing newspapers for circulation that morning."
  },
  {
    "headline": "How gunmen raided Abuja THISDAY office",
    "summarized_story": "Some unknown gunmen raided the Abuja office of one of Nigeria’s major news outlets, THISDAY, in the early hours of Thursday.\nRelaying the account, the newspaper’s Abuja Bureau Chief, Iyobosa Uwugiaren Iyobosa, told PREMIUM TIMES that the gunmen accessed the building through the route they came when the organisation was attacked about 10 years ago.\nIn a twin attack, the newspaper offices in Abuja and Kaduna were bombed by suicide bombers on April 26, 2012, killing 11 persons and destroying the newspaper’s multi-million properties.\n“The same route they passed in 2012 was the same route they passed on Thursday to enter into the premises.\n“The people they met were the production staff – those preparing newspapers for circulation that morning."
  },
  {
    "headline": "Wife’s death: Buhari condoles with Teslim Folarin",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari extends heartfelt condolences to Senator Teslim Folarin, the lawmaker representing Oyo Central senatorial district, his children, family members, and friends who mourn the passing of the Senator’s wife, Chief (Barr.)\nAngela Nwaka Folarin.\nThe President’s prayers and thoughts are with the Folarins as they grieve the departure of a beloved wife and mother, urging them to find solace and strength in the truth that the Almighty God is always with us through the good and difficult seasons of life.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Wife’s death: Buhari condoles with Teslim Folarin",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari extends heartfelt condolences to Senator Teslim Folarin, the lawmaker representing Oyo Central senatorial district, his children, family members, and friends who mourn the passing of the Senator’s wife, Chief (Barr.)\nAngela Nwaka Folarin.\nThe President’s prayers and thoughts are with the Folarins as they grieve the departure of a beloved wife and mother, urging them to find solace and strength in the truth that the Almighty God is always with us through the good and difficult seasons of life.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "In Ogun, Teenagers Behead Girlfriend, Burn Head For Money Ritual",
    "summarized_story": "The perpetrators were apprehended by members of the community while burning the girl’s head, according to the New Telegraph.\n“They killed Rofiat, cut off her head, packed the headless body in a sack and started burning the head in a pot.\nThey told the police in the presence of a mammoth crowd that they wanted to use it for money ritual.\nIn a video made available to our correspondent, Mustakeem Balogun, said: “We wanted to use just her head alone for money ritual.\nOyeyemi added that, a short cutlass and a knife used in cutting off the deceased head were also recovered from the suspects."
  },
  {
    "headline": "Gov. Emmanuel Canvass Unity Among Ekiti Guber Aspirants",
    "summarized_story": "Akwa Ibom State Governor, Mr Udom Emmanuel has urged contestants in the just concluded gubernatorial primaries of the People’s Democratic Party (PDP) in Ekiti State to bury the hatchet and work together for the victory of the party in the state.\nGovernor Emmanuel who was leader of the 5-man PDP primary election committee in Ekiti State gave the admonition while fielding questions with Government House correspondents at the Victor Attah International Airport, Uyo, upon his return from the assignment.\nIn his words, “Talking about Ekiti gubernatorial primaries, I’ve heard a whole lot; how some aspirants even before the process started, went to the press.\nI think we need to unravel that and question your real intensions.”The Ekiti PDP Guber primaries which was keenly contested by twelve apirants had Hon.\nSignificantly, all the aspirants who participated in the primaries have all congratulated the winner and pledged to work for the success of the PDP in the forthcoming Ekiti Governorship election."
  },
  {
    "headline": "Another Yoruba Leader, Olufemi Adegoke, Is Dead",
    "summarized_story": "Dr. Olufemi Adegoke, the chairman of the foremost Pan-Yoruba Intelligentsia Group, Voice of Reason, has died.\nAdegoke was described as a guy of impeccable character in a statement written by the group’s Director of Communication, Maxwell Adeleye.\nThe statement reads, “The deceased was a man of unquestionable character and a man whose lifestyle was a model.\n“Adegoke spent his last years on the surface of earth working for the advancement and liberation of the Yoruba people.\n“He was an unparalleled patriot of the Yoruba people and an intellectual giant whose courage and candour goes beyond the cosmos.”"
  },
  {
    "headline": "Aide Reveals Why Tinubu Travelled To London",
    "summarized_story": "Tunde Rahman, a media aide to All Progressives Congress (APC) National Leader Bola Tinubu, has clarified why his boss flew to the United Kingdom, UK.\nNEWS DIRECT recalls that Nigerians’ comments to Tinubu’s London trip erupted on social media yesterday, with many claiming that he travelled to the UK for routine medical treatment.\nTinubu, a 2023 presidential candidate, was claimed to have traveled abroad to attend various meetings regarding his political ambitions, according to a statement released on Friday by his media aide.\nHe said, “Asiwaju Tinubu is in fine health and excellent spirits.\nWhile abroad, Asiwaju is maintaining a vigorous schedule of meetings and consultations on a range of important matters."
  },
  {
    "headline": "Nigerians thumb down planned tax on carbonated beverages",
    "summarized_story": "Excise duty is a form of tax imposed on the production, licensing and sale of goods.\nShe said the purpose of the additional tax was to discourage the consumption of excessive sugar among Nigerians, which, according to her, contributes to diabetes and obesity.\nThe impact many say is potential job loss and further increase in the prices of carbonated drinks many Nigerians lament is already on the high side.\nOlamilekan said until the government addresses that question, it would continue to further burden businesses and Nigerians with new taxes.\nWhile acknowledging that the government’s position for the tax on carbonated drinks is justified, the political economist urged fiscal authorities to carefully weigh the impact it would have on the economy before implementation."
  },
  {
    "headline": "3 months after, Tinubu returns to London for ‘medical treatment’",
    "summarized_story": "Presidential aspirant and National leader of the All Progressives Congress (APC) Ahmed Bola Tinubu has reportedly returned to London for medical checkup.\nTinubu’s return to London is happening after about three months he came back to Nigeria following months of medical treatment outside the shores of the country.\nDuring his previous visit, the two-time former Lagos governor was said to have undergone a knee surgery.\nTinubu formally confirmed that he would be running for president on January 10, 2022, shortly after meeting with President Muhammadu Buhari at the State House.\nTinubu, an APC stalwart has faced criticism riticism over his presidential ambition especially in the areas of his academic claims among other issues."
  },
  {
    "headline": "Breaking: Shops burnt as explosion rocks Anambra (PICTURES)",
    "summarized_story": "Many shops and buildings burnt as Petrol tanker exploded at the Upper Iweka junction of Onitsha, Anambra state commercial city on Friday.\nThe fire which started at 8.30am had caused a long standstill of vehicles in and out of Onitsha.\nFire service both from Anambra and Delta states have arrived the scene and are battling to quench the fire amid a shortage of water as at the time of filling this report.\nDetails loading …"
  },
  {
    "headline": "Customs Intercept Cocaine Worth N3.9bn Along Seme-Badagry Expressway",
    "summarized_story": "The Seme Area Command of the Nigeria Customs Service (NCS) says it has intercepted cocaine valued at N3.9 billion hidden inside a Ford transit bus conveying religious books along the Seme- Badagry Expressway in Lagos.\nThis was disclosed in a statement signed on Friday by the spokesperson of the command, Hussaini Abdullahi.\nIn the statement, the Customs Area Controller (CAC), Comptroller Bello Mohammed Jibo, disclosed that the substance was intercepted on Sunday, January 23.\nJibo added that the customs also intercepted large quantities of petroleum products packaged in sacks on Wednesday.\nHe assured Nigerians that the command would continue to make life uncomfortable for the unpatriotic people trading illegal businesses in the area."
  },
  {
    "headline": "2023: Buhari Will Give Us Guidance On Zoning, Says Gov Abiodun",
    "summarized_story": "﻿Ahead of the APC National convention in February and General Elections in 2023, the Governor of Ogun State, Dapo Abiodun is confident that the President Muhammadu Buhari will give necessary guidance to ensure that equity and justice is reflected within the party’s zoning formula.\nThe Governor expressed this view after a visit to the President at the State House in Abuja on Friday.\nHe was accompanied by a broad delegation including former governor of the state, Olusegun Osoba; Chairman of the Council of Obas, Oba Babatunde Ajayi; former deputy governor, Alhaja Salimot Badru and a foremost industrialist, Chief Sulaiman Adegunwa.\nREAD ALSO: Fayemi’s Ex-SSG Emerges Ekiti APC Governorship CandidateIn a chat with state house correspondents, Governor Abiodun who thanked the president for his recent visit to the state (where a number of projects were commissioned), equally spoke on the issue of zoning.\nHe noted that the party is working on a formula, which according to him will be made known after an approval by the National Executive Council."
  },
  {
    "headline": "ECOWAS Suspends Burkina Faso Over Coup",
    "summarized_story": "The West African bloc ECOWAS on Friday suspended Burkina Faso following a coup, but will not impose other sanctions for the time being, a participant at a virtual summit said.\nECOWAS is also calling for the new junta to release ousted president Roch Marc Christian Kabore and other officials detained during Monday’s coup, the source said.\nThe summit, which lasted around three hours, also decided to send a mission of ECOWAS chiefs of staff to Ouagadougou, the Burkinabe capital, on Saturday.\nThis will be followed on Monday by ministerial-level envoys from the bloc, the source said.\nOn Sunday, mutinies broke out in several barracks and the following day, Kabore was arrested and taken away by troops."
  },
  {
    "headline": "Re-Election: Lagosians Know What They’ll Be Missing If We Don’t Continue, Says Sanwo-Olu",
    "summarized_story": "﻿Lagos State Governor, Babajide Sanwo-Olu, on Friday said the people of the state are aware of what they will miss if his administration is denied a second term.\nAlthough he did not expressly state if he will seek re-election in 2023, the governor believes it is left for the people to decide if his administration deserves another term or not.\n“I think we are doing a very good job,” the governor rated his administration during his appearance on Channels Television’s Sunrise Daily.\nAccording to the governor, the terminal stations will be ready by the set target but transporting passengers may commence next year.\nHe attributed the possible delay to proper testing of the trains and training of workers, to ensure the safety of passengers."
  },
  {
    "headline": "Police Arrest Three Suspects Accused Of Killing Lady For Ritual",
    "summarized_story": "Three young men have been taken into custody for allegedly killing a lady for ritual purposes in Ogun State, the police said on Saturday.\nThe Police Public Relations Officer in the state, Abimbola Oyeyemi, confirmed the arrest of the suspects in a statement in Abeokuta.\nHe added that on interrogation, the arrested suspects confessed that what they were burning in the local pot was the head of the girlfriend of their escaped accomplice.\nHe also ordered the immediate transfer of the suspects to the homicide section of the State Criminal Investigation and Intelligence Department for investigation.\nBankole said the suspects should be arraigned in court as soon as possible, to answer for the crimes they were accused of."
  },
  {
    "headline": "2023: Businessman donates campaign billboards, vehicles to support Tinubu -",
    "summarized_story": "The National Leader of the APC and 2023 Presidential aspirant Asiwaju Bola Tinubu has been described as a Leader who can bring the desired development to Nigeria.\nThis was made known at the public unveiling of a billboard and campaign vehicles in Lagos by a businessman who has volunteered to support the ambition of Bola Tinubu."
  },
  {
    "headline": "Kebbi LG Poll: Gov Bagudu canvasses support for APC candidates",
    "summarized_story": "Kebbi state Governor, Atiku Bagudu has assured of a credible election, as the state electoral commission set 5th of February 2022 for the state local government election.\nBagudu gave the assurance in Kamba town, Dendi local government area when he led other APC leaders to canvas support for candidates of the party at the coming local government election.\nAdvertisementThe governor says the APC government has delivered dividends of democracy to the teeming Nigeria populace especially in Kebbi state through the agricultural transformation and other meaningful projects.\nGovernor Bagudu said, the evidence of this is seen in how the people kept fate with the party through massive support that saw all elected political offices in the state entrusted in the hands of the APC.\nHe called on the people of the state to turn out in their numbers and vote massively for the party in the upcoming local government election."
  },
  {
    "headline": "Analysts discuss \"Not Too Young to Run Bill\", youths participation in politics -",
    "summarized_story": "On May the 31st, 2018, President Muhammadu Buhari signed the Not-Too-Young-To-Run bill into law.\nThis was part of efforts to get young Nigerians to be more involved in politics.\nAs Nigerians gear up towards the 2023 Election season, youths are being encouraged to participate more in the process by registering for their permanent voter cards, contesting elective positions, and also going out to cast their ballot.\nAdvertisement"
  },
  {
    "headline": "BREAKING: Biodun Oyebanji wins Ekiti APC governorship ticket -",
    "summarized_story": "A former Secretary to the Ekiti State Government, Biodun Oyebanji, has emerged the candidate of the All Progressives Congress in Ekiti State.\nMr Oyebanji emerged victorious with 101,703 votes, defeating seven other contestants.\nAdvertisementBreakdown of the votes shows that Bamidele Faparusi polled a total of 376 votes, Ojo Kayode had 767 votes, Opeyemi Bamidele, a serving Senator had 760 votes, Dayo Adeyeye, a former lawmaker polled 691 votes, Femi Bamisile polled 400 votes,.\nOthers are Toyin Afolabi who polled 47 votes and Demola Popoola who scored 239 votes.\nAdvertisementEarlier, seven aspirants announced their withdrawal from the contest, citing irregularities as reason for their exit."
  },
  {
    "headline": "UAE Lifts Flight Restriction on Nigeria, 11 Other African Countries",
    "summarized_story": "Restriction on flights arriving from Nigeria and 11 other African nations were lifted on Saturday, the United Arab Emirates (UAE) authorities have said.\nThe authorities said flight arrivals can resume from countries like Botswana, Congo Republic, Eswatini, Ethiopia, Kenya, Lesotho, Mozambique, and Namibia.\nThe UAE had last December issued a travel restriction on passenger flights from Nigeria, Kenya, Tanzania, and Ethiopia.\nPassengers are required to take a PCR test 48 hours before departure, test where possible at the departure airport, test on arrival and adhere to all precautionary measures when visiting the UAE.\nThe Nigerian government and the UAE authorities have been at loggerheads in recent months."
  },
  {
    "headline": "Somina Johnbull: NPTF Court Verdict is a Milestone",
    "summarized_story": "The Federal High Court in Abuja on Wednesday barred the Nigerian government from making further deductions from the Federation Account to fund the Nigeria Police Trust Fund, NPTF, or other agencies of government not listed in the Constitution.\nAccording to Justice Ahmed Mohammed, who delivered the ruling, such deductions were illegal, unlawful and unconstitutional.\nTo discuss the implication of the ruling not just for River State, but the all the states and local government areas of the federation, as well as the Federal Capital Territory, is Somina Johnbull, a lawyer who is conversant with the suit."
  },
  {
    "headline": "US East Coast Prepares for Heavy Snow, Plunging Temperatures as Blizzard Hits",
    "summarized_story": "Forecasts of a potentially brutal storm, which moved up the East Coast after forming in the Atlantic Ocean off the Carolinas, had prompted airlines to cancel 5,000 flights through the weekend and delay more than 8,000.\nThe governors of Maryland, Massachusetts, New Jersey, New York all declared states of emergency, warned of likely power outages and urged residents to stay off the roads on Saturday.\n“This is going to be a very big storm, probably one of the biggest we’ve experienced in the last few years.\nThe National Weather Service issued flood warnings for coastal areas and Amtrak canceled passenger rail service across much of the region.\n‘WHITEOUT CONDITIONS’"
  },
  {
    "headline": "Russian Buildup at Ukraine Border Includes Blood for Wounded Soldiers, US Officials Say",
    "summarized_story": "A Russian troop buildup along its border with Ukraine includes supplies of blood for the wounded, three U.S. officials told Reuters, a detail reinforcing U.S. comments that Russia “clearly” now has the capability to move on its neighbour.\nThe United States and NATO have said some of Russia’s demands are non-starters but have also left the door open to dialogue.\nU.S. Defense Secretary Lloyd Austin said the United States remained focused on countering Russian disinformation, including anything that could be used as a pretext for attacks on Ukraine.\nThe United States and the European Union have warned Russia that it will face economic sanctions if it attacks Ukraine.\nUkraine has suggested a Russian attack is not imminent though an economically damaging war is possible."
  },
  {
    "headline": "First Arabic Netflix Film Tackles Taboos, Sparks Controversy",
    "summarized_story": "Those who don’t like the movie, they argue, are free to not subscribe to Netflix or simply skip the film.\nThe scenes in the first Arabic Netflix movie have sparked a public drama as intense as the one that plays out onscreen.\nBut to see those themes broached in an Arabic-language movie with Arab actors went too far for some.\nSome criticized her real-life husband, an Egyptian movie star in his own right, for “allowing” her to play the role.\nThe Egyptian actors syndicate came out in support of Zaki, saying it will not abide verbal abuse or intimidation against actors over their work."
  }
]