[
  {
    "headline": "APC primary: Shun violence, Orelope-Adefulire urges aspirants",
    "summarized_story": "The Senior Special Assistant to the President on Sustainable Development Goals, Princess Adejoke Orelope-Adefulire, has appealed for calm ahead of the primary election of the All Progressives Congress for the Lagos council election scheduled for Saturday, July 29.\nOrelope-Adefulire, a former deputy governor of Lagos, in a statement on Friday urged contestants in the primary to shun every form of violence to have the peaceful atmosphere needed for the conduct of the election.\nShe said, “The primary election should not be a do-or-die affair for anyone, especially if the intention is to genuinely serve the people.\nShe also appealed to those presiding over the primary to ensure that the process is free, fair, and transparent so that the results would be acceptable to all.\nI wish all contestants and members of our party across the state a successful and peaceful election,” she said."
  },
  {
    "headline": "Health officers, federal agency disagree over fumigation of Ekiti college",
    "summarized_story": "The Environmental Health Officers Registration Council of Nigeria has criticised the Federal Fire Service for carrying out fumigation at the Ekiti State Government-owned College of Health Sciences and Technology, Ijero Ekiti.\nThe council said the fire service was not among organisations licensed to carry out fumigation in the country.\nMeanwhile, the Federal Fire Service on Friday said the decontamination at the School of Health Science and Technology, Ijero Ekiti, followed the laid down standards.\nIt also said reports that 15 students of the college collapsed while some were hospitalised as a result of the decontamination exercise carried out by the agency were not true.\nThe statement read in part, “Trouble started 15 minutes after the decontamination exercise started with reports that some students had collapsed due to the adverse effect of the decontamination exercise."
  },
  {
    "headline": "Ereyitomi empowers constituents with speed boats, sewing machines others worth millions of Naira",
    "summarized_story": "Kindly Share This Story:The Member Representing Warri Federal Constituency, Hon.\nThomas Ereyitomi has empowered his constituents with Speed Boats, Tricycles, Sewing Machines among others worth millions of Naira.\nIn no distant time, we will be commissioning 10 water projects spread across the 3 Warri LGAS and be rest assured that more projects are in the pipeline.\n“My dear compatriots and members of Warri Federal Constituency, I appeal to you to sustain your support for me as we make progress together.\nI once again assure you of my selflessness in restoring the greatness of Warri Federal Constituency as I promise to continuously engage and consult our constituents for better representation”."
  },
  {
    "headline": "Constitution Review an exercise in Futility, waste of time, public funds — Afenifere",
    "summarized_story": "Also read:“Amending the constitution is an exercise in futility and a waste of time and public fund.\n“We cannot claim to be a federal Republic and be governed by a unitary constitution.\n“We cannot claim to be in a democracy and be governed by a constitution that does not emanate by the people.\n“Every session of the two arms of the National Assembly, since 2007, has embarked on the same jamboree of constitutional amendment spending public funds on public hearings, without any result.\n“The National Assembly is part of the issue to be determined in the process of restructuring and cannot legitimately be the judge in such exercise."
  },
  {
    "headline": "‘Worship God sincerely to avoid torment in grave’",
    "summarized_story": "Kindly Share This Story:A Muslim Cleric, Imam Garba Alyolawi, has urged Muslims to worship Allah with sincerity and be kind to fellow beings, so as to escape the torment of the grave when they are no more.\nAlyolawi, who is the Imam of Area 10 Jumaat Mosque, Garki, Abuja, gave the admonition in his Jumaat sermon at the mosque on Friday.\nHe said that the grave constituted a stop-gap between death and the day of judgement, where the souls of righteous people would enjoy comfort and evil doers are punished before the day of judgement.\n“In Islam, the term grave (Qabr) constitutes a third stage of human existence, the first two being the womb and worldly life.\nGrave is but a transitory place; a mere passage to our permanent abode, while the hereafter is for eternity,’’ he said."
  },
  {
    "headline": "Pharmacists Council of Nigeria seals 301 medicine shops in Enugu",
    "summarized_story": "Kindly Share This Story:No fewer than 301 patent medicine shops were sealed for various reasons by the Pharmacists Council of Nigeria (PCN)in Enugu State, its Registrar, Dr Elijah Mohammed has said.\nHe said that 90 pharmacies were also sealed while six pharmacies and patent medicine shops were issued compliance directives during the enforcement exercise.\nMohammed said that a total of 524 premises comprising 159 pharmacies and 365 patent medicine shops were visited during the operation.\nMohammed named the existence of unregistered medicine shops as one major factor militating against rational distribution and use of medicines in the country.\nMohammed said that most of the medicine shops had created unhealthy rooms for the sale of substances of abuse to criminal elements in the society."
  },
  {
    "headline": "APC leaders working to address insecurity, other challenges – Group",
    "summarized_story": "Kindly Share This Story:The All Progressives Congress (APC) Legacy Awareness and Campaign Group says the party’s leadership is working to address the country’s insecurity and other challenges.\n“No doubt, there are challenges, which both the Federal Government and all our leaders in the party are working hard to resolve.\n“With all the challenges in the country, APC is the only party that is working to address them,” he said.\nHe added that committed party members and members of the opposition parties, especially the PDP would also be engaged on issues.\n“Unlike other parties controlled by Godfathers who are in denial of their internal challenges, APC belongs to members who are ordinary Nigerians."
  },
  {
    "headline": "Insecurity: Anambra govt bans use of tricycles, shuttle buses after 7pm",
    "summarized_story": "Anambra State Government has banned the use of tricycles and shuttle buses after 7pm.\nA notice released by the Secretary to the State Government (SSG), Prof Solo Chukwulobelu, stated this on Friday night.\nThere have recently been cases of cultists and robbers using tricycles, popularly called Keke and shuttle buses to convey cultists and armed robbers to destinations where they fought and killed rival cultists or robbed innocent persons.\nAny motorcycle found within these areas will be impounded and forfeited;“That the use of motorcycles, tricycles and shuttle buses across the State is now banned between 7pm and 6am daily with effect from Saturday 29th May 2021 and for 1 month in the first instance;“That shuttle buses are henceforth banned from using tinted glasses or curtains while plying on Anambra roads.\nSame measures will be applied in the case of shuttle bus and motorcycle."
  },
  {
    "headline": "Nigerians react as Chibuike Amaechi releases gospel song [VIDEO]",
    "summarized_story": "Nigeria’s Minister of Transportation, Chibuike Amaechi and his wife, Judith, have released a gospel single.\nAmaechi released the song alongside members of his family to mark his birthday.\nSome others believe the song by Amaechi and his wife is lifeless, asking them not to ever sing again.\nThe song, entitled ‘Psalm 33,’ is preceded by a catchphrase ‘Blessed the people the Lord has chosen as his heritage.’Amaechi’s husky voice and solo performance in the video is generating reactions from Nigerians.\nSee video, reactions below:"
  },
  {
    "headline": "Oil Flow Qua: Tension in Akwa Ibom community as crisis rocking steel company deepens",
    "summarized_story": "There is palpable fear in Afaha Eket, Eket Local Government Area of Akwa Ibom State over the worsening internal crisis rocking the ‘Oil Flow Qua Steel Partners’ a steel mining company in the community.\n“But the Oil Flow Qua-Steel Partners had, due to inability to raise the N200m payment for purchase of the metals, drafted KAM STEEL as principal partner.\n“On joining the deal, KAM STEEL made available the said sum with an agreement that “Nothing leaves the site until it exhausts the agreed materials paid for.\n‘’Trouble started when the Oil Flow Service limited allegedly breached the contract with KAM STEEL by selling parts of the sites to non-partners who also planted their security personnel around the site.\n“We paid a total sum of N250m, N200m to the state government and N50m to Oil Flow as those who won the bid."
  },
  {
    "headline": "Five soldiers feared dead as unknown gunmen strike again in Imo",
    "summarized_story": "At least five soldiers are said to have been shot dead along Wetheral Road Owerri in Imo State as unknown gunmen attacked the area.\nAccording to an eyewitness, the bandits took the soldiers unaware and opened fire on them, killing five at a spot.\n“Right now, five soldiers have been shot dead.\nWetheral Road, Nazi/Aba road, Government House Roundabout and all the link roads have been shut down.\n“I personally saw the soldiers evacuating the corpses in a Hilux vehicle, there were five."
  },
  {
    "headline": "Many killed as suspected herdsmen sack Taraba communities",
    "summarized_story": "As at the time of filing this report, no fewer than twelve dead bodies were said to have been recovered from the scenes of the two separate attacks.\nThe separate attacks, which occurred in Sabon-Gida village of Gassol Council and Pangari village of Bali, were said to have been necessitated by the herders.\nA source told DAILY POST that the herders stormed the communities at night when the residents were deep asleep.\nSome persons who claimed to have narrowly escaped the scenes, also told our correspondent that apart from the killings and injuries inflicted on residents of the communities, massive destructions of valuables also took place.\nThe leadership of the state chapter of the Miyetti Allah Cattle Breeders Association of Nigeria (MACBAN), accused Governor Darius Dickson Ishaku of alleged refusal to wade into the ongoing killings."
  },
  {
    "headline": "#BenueUnderAttack: Outrage over killings, attacks in Benue",
    "summarized_story": "By Alao AbiodunNigerians on social media have condemned the gruesome killings, violent attacks in Benue State by suspected herders and gunmen.\nThe Nation reports that Benue has recorded continuous attacks on its communities by gunmen in the past few weeks.\nBenue State Governor Samuel Ortom had urged the people of the state to obtain Dane gun licences from local government areas for self-defence.\nADVERTISEMENTTrending with the hashtag #BenueUnderAttack with over 100,000 tweets, many bemoaned the spate of killings across the state.\nThey are killing innocent Christians in Benue State #BenueUnderAttack”“We can’t fold our hands and watch anymore."
  },
  {
    "headline": "Wild reactions as Wizkid, Burna Boy get 2021 Bet Awards nomination",
    "summarized_story": "By Ekaete BasseyIt has been buzzing on social media as Wizkid and Burna boy receive nomination for 2021 Bet Awards.\nOn Thursday, May 27, BET announced on their official Instagram page Grammy-winning superstars, Ayodeji Ibrahim Balogun, popularly known as Wizkid and Damini Ogulu, popularly known as Burna Boy got a nomination each at the 2021 BET Awards.\nBurna Boy and Wizkid are up for “Best International Act”, along with several other International artistes.\nWizkid and Burna Boy won the “Best Music Video” and “Best Global Music Album” categories respectively at the 2021 Grammy Awards.\nHe also won the award in 2014 for “Best International Act: Africa.”This has not stopped social media users from the nomination of Wizkid and Burna Boy for Bet Awards to troll Davido."
  },
  {
    "headline": "10 killed in fresh bandit, reprisals attacks in Kaduna",
    "summarized_story": "By AbdulGafar Alabelewe, KadunaNo fewer than 10 persons have been killed by bandits during an attack and counterattacks on two villages in Giwa Local Government Area of Kaduna State.\nADVERTISEMENTAccording to him: “Security agencies reported that armed bandits invaded Na’ikko village in Giwa LGA.\nCommunity volunteers engaged the bandits and in the ensuing gun duel, three residents were killed, identified as: Alhaji Shafiu, Alhaji Balailu Sano and Abdulsamad Hussaini.\nThe Commissioner added: “In another incident, armed bandits invaded Dakyauro village, Sabon Birni, Igabi LGA and killed four persons after rustling about 25 cows.\nThe four persons killed were listed as: Musbahu Yusuf Basiru Jaafaru, Ja’afaru Yahaya and Umaru Sulaiman."
  },
  {
    "headline": "Many feared kidnapped on Kaduna-Abuja highway",
    "summarized_story": "By AbdulGafar Alabelewe, KadunaMany people have been feared kidnapped along Kaduna-Abuja highway on Friday.\nKaduna Police Command however said it was yet to receive any report on the incident.\nThe Command’s Police Public Relations Officer (PPRO), ASP Muhammad Jalige told The Nation: “We are yet to receive any report.\nAccording to him: “I have just got a call that Bandits have blocked the Kaduna Abuja road,in between Jere and Katari village in this broad daylight.\n“Scores of people were kidnapped while many have made a fast u-turn in the face of gunshots.”"
  },
  {
    "headline": "Bloody Friday: Bandits kill 10 in fresh attacks in Kaduna, rustle 39 cattle",
    "summarized_story": "From Noah Ebije, KadunaNo fewer than 10 persons have been reported killed by bandits on Friday in three Kaduna communities.\nThe attacks and reprisal left five dead in Giwa Local government area of Kaduna State, just as four were killed and two injured by bandits in Igabi LGA.\nThe bandits also killed a community leader in Chikun LGA.\n“In another incident, armed bandits invaded Dakyauro village, Sabon Birni, Igabi LGA and killed four persons after rustling about 25 cows.\n“Armed bandits also invaded farmlands on the outskirts of Gigani village, Kerawa, Igabi LGA and rustled about 14 bulls being used by farmers to plough the land."
  },
  {
    "headline": "BREAKING: Obaseki wins at Supreme Court",
    "summarized_story": "From Godwin Tsa AbujaSupreme Court on Friday struck out the appeal filed by the All Progressive Congress (APC) and its candidate, Pastor Osagie Ize-Iyamu, against the outcome of the September 19, 2020 governorship election, which returned Mr. Godwin Obaseki of the Peoples Democratic Party (PDP) as Governor of Edo State, for lacking in merit.\nIn a unanimous judgment delivered by Justice Emmanuel Agim, the apex court affirmed the decision of the Court of Appeal which upheld the election of Governor Obaseki.\nThe Supreme agreed completely with the judgment of the lower courts that the appellants did not placed sufficient material evidence to upturned the decision.\nMeanwhile, the court has slammed a cost of N1million against the appellants in favour of Obaseki.\nDetails soon."
  },
  {
    "headline": "Kalu salutes new Chief of Army Staff, General Yahaya",
    "summarized_story": "Congratulating the Chief of Army Staff, Kalu extolled the virtues of the Major-General, describing him as a gallant and committed military officer with passion for professionalism and national development.\nThe former governor, urged the new army chief to sustain his outstanding attributes in his new role.\nIn a congratulatory message, the Senate Chief Whip, stressed that the Nigerian army has continually played a noble role in nation building.\nHe said: “I felicitate with the new Chief of Army Staff, Major-General Farouk Yahaya, on his new national assignment.\n“Considering his antecedents, I am optimistic that the new Chief of Army Staff will bring to bear his expertise in the discharge of his duties and responsibilities."
  },
  {
    "headline": "45 generals to retire as Buhari names, Yahaya, new chief of army staff",
    "summarized_story": "From Molly Kilete, AbujaPresident Muhammadu Buhari has appointed Major Gen. Farouk Yahaya as new Chief of Army Staff (CAOS).\nHe was granted regular combatant commission as a member of 37 regular course on 22 September 1990 in the rank of Second Lieutenant with seniority in the same rank effective September 27, 1985.\nWith his appointment of Yahaya, a member of 37 Regular Course of the Nigerian Army, it was learnt that about 45 generals would have to resign .\nThe affected officers Daily Sun gathered are mostly officers of 35 Regular Course, 36 Regular Course and 37 Regular Course who incidentally are Course-mates of the new army chief.\nThe directive Daily Sun gathered has not changed, thus meaning more officers would retire with the naming of a new service chief."
  },
  {
    "headline": "Immigration increases production capacity to beat deadline for passport backlogs",
    "summarized_story": "Comptroller–General, Nigeria Immigration Service (NIS), Mr Muhammad Babandede, has said the service has increased its production capacity to beat the May 31 deadline set to clear backlog of passport applications.\nBabandede announced this while briefing newsmen on the NIS passport reforms and recruitment exercise, yesterday, in Abuja.\nHe said that the passport production centres across the country were working round the clock to clear the backlogs before the commencement of the new passport regime on June 1.\nHe also said that all passport collection centres would be opened from 6:00 a.m. to 6:00 p.m. daily for applicants.\nOn recruitment, NIS boss said that the current recruitment exercise was the best ever in immigration and assured all applicants of transparency and fairness."
  },
  {
    "headline": "Tinubu Takes N9billion From Lagos Internally Generated Revenue Account Monthly, Says Bode George",
    "summarized_story": "Bode George, a chieftain of the Peoples Democratic Party (PDP), says excessive leakages of revenues and monumental corruption are responsible for slow growth in Lagos state.\nSpeaking in an interview with Yoruba Tooto TV, George accused Bola Tinubu, national leader of the All Progressives Congress (APC) of taking N9 billion monthly from the Lagos state internally generated revenue account.\nBola Tinubu“Do you know how much is Lagos state internally generated revenue monthly?\nThings are hard in this country.”George added that the late Funsho Williams should have become the Lagos state governor.\nHe would have been a better governor of Lagos state,” he said."
  },
  {
    "headline": "Tinubu Takes N9billion From Lagos Internally Generated Revenue Account Monthly, Says Bode George",
    "summarized_story": "Bode George, a chieftain of the Peoples Democratic Party (PDP), says excessive leakages of revenues and monumental corruption are responsible for slow growth in Lagos state.\nSpeaking in an interview with Yoruba Tooto TV, George accused Bola Tinubu, national leader of the All Progressives Congress (APC) of taking N9 billion monthly from the Lagos state internally generated revenue account.\nBola Tinubu“Do you know how much is Lagos state internally generated revenue monthly?\nThings are hard in this country.”George added that the late Funsho Williams should have become the Lagos state governor.\nHe would have been a better governor of Lagos state,” he said."
  },
  {
    "headline": "How Akwa Ibom Police Aided And Abetted Ini Umoren’s Killer, Frank, His Accomplices",
    "summarized_story": "Investigations have revealed that Uduak Frank, the rapist and killer of Akwa Ibom job seeker, Iniubong Umoren had criminal cases to answer for before the latest saga.\nFor instance, MacDon did not say anything about an accomplice in a statement he issued on the arrest of Uduak Akpan on May 1.\nNot long after the search for her went viral on social media, Emmanuel quickly deleted his conversation with late Umoren.\nBoth accomplices disappeared into thin air shortly after making their respective posts while the search for the late Miss Umoren on social media became the top trending topic.\nThe circumstances that led to the arrest of Uduak Akpan have been a subject of controversy."
  },
  {
    "headline": "How Akwa Ibom Police Aided And Abetted Ini Umoren’s Killer, Frank, His Accomplices",
    "summarized_story": "Investigations have revealed that Uduak Frank, the rapist and killer of Akwa Ibom job seeker, Iniubong Umoren had criminal cases to answer for before the latest saga.\nFor instance, MacDon did not say anything about an accomplice in a statement he issued on the arrest of Uduak Akpan on May 1.\nNot long after the search for her went viral on social media, Emmanuel quickly deleted his conversation with late Umoren.\nBoth accomplices disappeared into thin air shortly after making their respective posts while the search for the late Miss Umoren on social media became the top trending topic.\nThe circumstances that led to the arrest of Uduak Akpan have been a subject of controversy."
  },
  {
    "headline": "How Akwa Ibom Police Aided And Abetted Ini Umoren’s Killer, Frank, His Accomplices",
    "summarized_story": "Investigations have revealed that Uduak Frank, the rapist and killer of Akwa Ibom job seeker, Iniubong Umoren had criminal cases to answer for before the latest saga.\nFor instance, MacDon did not say anything about an accomplice in a statement he issued on the arrest of Uduak Akpan on May 1.\nNot long after the search for her went viral on social media, Emmanuel quickly deleted his conversation with late Umoren.\nBoth accomplices disappeared into thin air shortly after making their respective posts while the search for the late Miss Umoren on social media became the top trending topic.\nThe circumstances that led to the arrest of Uduak Akpan have been a subject of controversy."
  },
  {
    "headline": "Death toll from Kebbi boat mishap rises to 81",
    "summarized_story": "The Sokoto office of the National Emergency Management Agency (NEMA) says 81 bodies have been recovered, following the boat mishap that occurred in Wara, Ngaski LGA of Kebbi state.\nWhile 22 persons were rescued alive, more than 100 persons were feared to have drowned in the incident.\nAccording to a statement from the Sokoto NEMA office, as of Thursday, 59 bodies had been recovered from the river.\nAdvertisement“Twenty two (22) more dead bodies has been recovered today (Friday 28-05-2021) following the recent boat mishap which occurred last Wednesday in Wara, Ngaski Local Government Area, Kebbi state,” the statement reads.\n“So far, at the time of filling this report, which is the third day since the incident happened, rescuers have successfully removed 81 dead bodies in total from the river."
  },
  {
    "headline": "Death toll from Kebbi boat mishap rises to 81",
    "summarized_story": "The Sokoto office of the National Emergency Management Agency (NEMA) says 81 bodies have been recovered, following the boat mishap that occurred in Wara, Ngaski LGA of Kebbi state.\nWhile 22 persons were rescued alive, more than 100 persons were feared to have drowned in the incident.\nAccording to a statement from the Sokoto NEMA office, as of Thursday, 59 bodies had been recovered from the river.\nAdvertisement“Twenty two (22) more dead bodies has been recovered today (Friday 28-05-2021) following the recent boat mishap which occurred last Wednesday in Wara, Ngaski Local Government Area, Kebbi state,” the statement reads.\n“So far, at the time of filling this report, which is the third day since the incident happened, rescuers have successfully removed 81 dead bodies in total from the river."
  },
  {
    "headline": "Naira or pounds? In what currency did UK return Ibori loot?",
    "summarized_story": "AdvertisementThe AGF, through his special assistant on media, Umar Gwandu, said the money was paid into the designated federal government account in naira equivalent.\nBut did the AGF goof in the course of sharing information about the recovered loot?\nAdvertisementUsually, the terms and conditions for which funds will be repatriated are stated in a document called the memorandum of understanding (MOU).\nTheCable obtained the MOU signed between the UK government and Nigeria to return the £4.2 million loot.\nAdvertisementIn the MOU, it is clearly stated that the UK will transfer the funds “to the British Pounds ‘Designated Account’ for Asset Recovery at the Central Bank of Nigeria (CBN)”."
  },
  {
    "headline": "Naira or pounds? In what currency did UK return Ibori loot?",
    "summarized_story": "AdvertisementThe AGF, through his special assistant on media, Umar Gwandu, said the money was paid into the designated federal government account in naira equivalent.\nBut did the AGF goof in the course of sharing information about the recovered loot?\nAdvertisementUsually, the terms and conditions for which funds will be repatriated are stated in a document called the memorandum of understanding (MOU).\nTheCable obtained the MOU signed between the UK government and Nigeria to return the £4.2 million loot.\nAdvertisementIn the MOU, it is clearly stated that the UK will transfer the funds “to the British Pounds ‘Designated Account’ for Asset Recovery at the Central Bank of Nigeria (CBN)”."
  },
  {
    "headline": "Reps minority caucus to Buhari: Nigeria becoming a failed state... tackle insecurity now",
    "summarized_story": "The minority caucus of the house of representatives has asked President Muhammadu Buhari to “buckle up” in addressing the challenges confronting the country.\nAdvertisementIn a statement issued on Friday to mark the sixth anniversary of the present administration, Ndudi Elumelu, minority leader of the lower chamber, tackled the All Progressives Congress (APC) over “economic crisis and avoidable acrimony”.\n“The caucus holds that with its failure to check worsening insecurity and mass killing of citizens; its intrinsic corruption, mismanagement of our national economy, as well as the unrelenting assault on our national diversity, the APC administration at the center has failed on all fronts in the last six years,” the statement reads.\n“Failure of the government to address escalated insecurity challenges has crippled the agricultural sector and disorganised commercial activities, leading to imminent food crisis with cost of food and other necessities of life skyrocketing beyond the reach of Nigerians,” the lawmakers said.\n“As representatives of the people, the minority caucus is worried that our nation is heading towards a failed state."
  },
  {
    "headline": "Nokia X20 Review – Dualsight Camera, 2-day battery life, and more",
    "summarized_story": "Early in April, HMD Global announced the launch of six new Nokia Android smartphones.\nIts major selling points include 3 years worth of Android updates from Nokia, cinema mode and dualsight camera, 2-day battery life and a large screen that allows you to watch virtually anything in full HD+.\nThe Nokia X20 retails for about $480.\nFinally, inside the box we have the following:The Nokia X20 : I mean, it would be extremely awkward if this was not in there.\nThe Look, The Feel, The HeftI will start by saying the Nokia X20 is a large phone."
  },
  {
    "headline": "How can you make your company hack-proof? These five experts know.",
    "summarized_story": "Adeoluwa, Daniel, Joseph, Sophina and Nick will be discussing how you can protect your organization and customers from online fraud.\nAdeoluwa is a skilled Information Security Professional.\nHe is responsible for building the backend infrastructure, driving product roadmap, leading the technical team and driving company strategy.\nSophina is a cybersecurity professional currently working with a leading financial services firm.\nHe has over 13 years experience in the technology industry and has worked for multinational, leading technology companies."
  },
  {
    "headline": "GovTech In Nigeria: From Regulatory Maze to Models of Good Practice",
    "summarized_story": "Nigerian public procurement and regulation can be labyrinthine, but recent policy reforms and the model of good practice provided by Kaduna State hint at opportunities for public-purpose innovation to flourish in the country.\nIt has also mandated Nigerian companies with large public sector IT contracts to engage Nigerian startups as R&D partners on the projects.\nBut the Federal Government need not look far for inspiration; it can take a page out of the Kaduna State Government (KDSG)’s Govtech playbook.\nAccording to the World Bank’s latest subnational Doing Business ratings, Kaduna is the most accessible state to register property and get contracts enforced in Nigeria.\nKaduna’s example is an exciting preview of what could be should the Federal Government follow through on a promising start."
  },
  {
    "headline": "How GOtv Nigeria Built the Widest Coverage in Nigeria with Investments in Local Infrastructure",
    "summarized_story": "Nationwide digital terrestrial television operator GOtv has greatly contributed to Nigeria’s digital migration through eye-watering infrastructure investment.\nBut GOtv, launched by Details Nigeria in October 2011, has shown confidence in the local broadcast industry.\nThe company has since worked closely with the government and the Nigerian Communications Commission (NCC) in providing affordable digital television for everyone through unmatched investments in modern broadcast infrastructure.\nOver the years, GOtv has continued to invest heavily in the latest technology in digital television, especially on its transmission technology, which it has consistently improved upon.\nThese investments by GOtv in the local broadcast infrastructure and the expansion of its network coverage have come as the government-driven digital switchover programme (DSO) progresses in fits and starts."
  },
  {
    "headline": "Brand Africa Ranks TECNO 6th on the Most Admired brands in Africa List",
    "summarized_story": "– In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nWhen TECNO launched dual SIM cards in Africa, there had been nothing of the kind before then.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Celebrating the kids, Crypto withdrawal on PayPal, Facebook hiding Likes, Twitter Spaces arrives Web",
    "summarized_story": "Becoming even more crypto-friendly: Currently, PayPal users cannot withdraw or send cryptocurrencies directly to friends and families.\nMore crypto users?\nPayPal’s purported crypto tolerance could be a ploy to lure more crypto users to its platform.\nInstagram and Facebook users now have more control over their experience on the apps.\nThis way, Facebook satisfies those who feel pressured by Likes and those who depend on Like counts — such as influencers — to use the app."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "Celebrating the kids, Crypto withdrawal on PayPal, Facebook hiding Likes, Twitter Spaces arrives Web",
    "summarized_story": "Becoming even more crypto-friendly: Currently, PayPal users cannot withdraw or send cryptocurrencies directly to friends and families.\nMore crypto users?\nPayPal’s purported crypto tolerance could be a ploy to lure more crypto users to its platform.\nInstagram and Facebook users now have more control over their experience on the apps.\nThis way, Facebook satisfies those who feel pressured by Likes and those who depend on Like counts — such as influencers — to use the app."
  },
  {
    "headline": "Why some Nigerians might not miss Internet Explorer but would use Microsoft Edge",
    "summarized_story": "Microsoft announced in a blog post that it would retire the Internet Explorer (IE) on June 15, 2022.\nNonetheless, while Internet Explorer was going through its steady decline in market share, and Google Chrome dominated other browsers with 69% market share, Microsoft was building Microsoft Edge to replace IE.\nWith the Microsoft Edge browser launch in 2015, the software giant revealed plans to kill off Internet Explorer, though it would continue working until the end.\nMicrosoft also claims that Edge is its solution to the security issues faced on Internet Explorer over the years.\nAnd with reportedly the highest-rated protection against malware and phishing attacks, Microsoft Edge seems to be up to the task of protection."
  },
  {
    "headline": "Why Kuda’s exit offer to early investors is a big deal",
    "summarized_story": "Startup exit is the dream of many investors and founders and in a place like Nigeria, it does not happen very often given that the startup ecosystem is still at an infant stage and many startups are at the stage where they need as much cash they can gather to survive.\nSo, when a startup…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Low-wage manufacturing jobs can dent Nigeria’s unemployment",
    "summarized_story": "Creating low-skilled jobs in the manufacturing sector that offer lower wages can help Nigeria temporarily tackle unemployment problem, experts have said.\nWith the unemployment rate at 33.3 percent and youth unemployment rate at 42.5 percent, Nigeria’s population forecast could create a situation where the structure and pattern of growth are insufficiently geared towards job creation….\nDon’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Stanbic Bank lines up $100m to fund renewables in Nigeria",
    "summarized_story": "The manager of Nigeria’s biggest pension fund is to commit $100m in financing for the renewables sector but it’s also embracing solar energy for the good of its own business.\nStanbic IBTC will set aside the $100 million for lending to local companies in the renewables sector over the next three years to help boost…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "The Buhari Administration @ 6: Presidency lists achievements – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Presidency says the Muhammadu Buhari administration is recording giant strides, enough to make Nigerians proud.\nIn 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State.\n– The designation of President Buhari as the African Union (AU) Anti-Corruption Champion for 2018– The designation of President Buhari by ECOWAS Heads of State as West Africa’s Covid-19 Champion in 2020."
  },
  {
    "headline": "COVID-19: Edo immunises over 38, 500 persons in first phase, begins second dose vaccination Tuesday – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has vaccinated over 38,500 persons in the first dose of phase one COVID-19 vaccination campaign and is set to begin the second dose vaccination on Tuesday, June 01, 2021.\nHealth Educator with the State Primary Healthcare Development Agency, Mrs. Irene Uabor, who disclosed this to journalists in Benin City, urged all those that have been vaccinated with the first dose of the Oxford-AstraZeneca COVID-19 vaccine to come out and take the second dose for full protection against the virus.\nShe noted that all eligible persons for the second dose vaccination are expected to take the second dose least 6 weeks from the first dose and before the 9th of July 2021.\nUabor further charged them to go to the health facility where the first dose was administered to access their second dose, adding, “For those that were vaccinated by roaming teams, they should check their cards and go to the health facility written on it for their vaccination.\n“You must continue to wear your facemask when in public; wash your hands regularly under running water, use alcohol-based hand sanitizers and observe social distancing.”She further charged residents with any COVID-19 symptoms to contact the Edo Emergency Operation Centre on this toll-free number: 08003625000 for assistance."
  },
  {
    "headline": "Certificate forgery: Supreme Court upholds Appeal’s ruling, affirms Obaseki as Governor – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…APC gets N1 million fine…ruling buries diabolical controversy – ObasekiThe Supreme Court on Friday upheld the ruling of the Appeal Court, dismissing the alleged certificate forgery suit filed by the All Progressives Congress (APC) against the Governor, during the 2020 governorship election.\nThe verdict affirms the victory of Governor Godwin Obaseki at the September 19 polls.\n“From the statement by the Supreme Court Justices, it is clear that they align with what Edo people knew all along, which is that there was no merit in the case.\nRecall that the Federal High Court, Abuja, had on January 9 dismissed the alleged certificate forgery suit against Governor Obaseki.\nApparently not satisfied with the decision of the lower court, the APC approached the appellate court to challenge the judgment."
  },
  {
    "headline": "Edo govt, UN strengthens collaboration to combat COVID-19, illegal migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, met with a delegation of the United Nations to bolster the government’s efforts at containing the coronavirus (COVID-19) pandemic and further reduce the menace of irregular migration.\nThe delegation, headed by the United Nations Resident and Humanitarian Coordinator, Mr. Edward Kallon, was received at Government House in Benin City.\nPhilip Shaibu, reaffirmed the government’s commitment to containing the pandemic and curbing irregular migration among youths in the state.\nHe noted that the present administration of Governor Obaseki is putting in place reforms and policies to ensure a business-friendly environment to attract investment into the state.\nHe noted that a part of the aim for the visit was to discuss ideas that would put an end to irregular migration among youths in Edo."
  },
  {
    "headline": "Edo Governorship Suit: JUSUN allowed politicians into Supreme Court, but barred journalists",
    "summarized_story": "Some officials of Judiciary Staff Union of Nigeria (JUSUN), on Friday, barred journalists from gaining access into the Supreme Court premises, but allowed the Deputy Governor of Edo State, Philip Shuaib, and his entourage.\nSome officials of JUSUN were stationed at the Supreme Court’s entrance to enforce their ongoing strike action over financial autonomy for the judiciary arm of government.\nPREMIUM TIMES earlier reported that the Supreme Court dismissed the certificate forgery suit and ruled in favour of Mr Obaseki.\nHe said members of the opposition APC in the state had boasted of their victory at the Supreme Court.\n“The Supreme Court is not in their (APC) as they said."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Just In: Supreme Court dismisses Ize-Iyamu’s forgery suit against Obaseki",
    "summarized_story": "The apex court in a judgement delivered by Justice Emmanuel Agim held that the appellants failed to prove its case beyond a reasonable doubt, NAN reported.\n“This court agrees with the lower courts completely, that the appellants did not meet sufficient requirement to prove their case”.\nThe Supreme Court, therefore, awarded a cost of one million naira in favour of Governor Obaseki.\nThe appeal court in Abuja had dismissed the suit challenging Obaseki’s certificates on March 18.\nThe Appeal Court further held that Mohammed’s verdict was without ambiguity and that the APC did not prove its case."
  },
  {
    "headline": "Total changes name to TotalEnergies as part of transition to renewable energy",
    "summarized_story": "Total on Friday changed its name to TotalEnergies as pushes to become one of the world’s top five in renewables by 2030.\nThe shareholders, the statement said, approved, almost unanimously, the resolution to change the company’s name from Total to TotalEnergies, thereby anchoring its strategic transformation into a broad energy company in its identity.\nMr Patrick Pouyanné, Chairman and Chief Executive Officer of TotalEnergies said in tandem with this name change, TotalEnergies was adopting a new visual identity.\nEnergy is reinventing itself, and this energy journey is ours,” he said.\nHe said TotalEnergies would be a broad energy company committed to producing and providing energies that are ever more affordable, reliable and clean."
  },
  {
    "headline": "ADF backs May 30 Remembrance Day, says Biafra part of Igbo history",
    "summarized_story": "OBINNA EZUGWUThe Alaigbo Development Foundation (ADF), has encouraged all patriotic Igbo people across the globe to observe the May 30 Biafra Remembrance Day, as according to it, the day remained an important part of the history of Igbo nation.\nThe ADF which made call in a statement signed by its president, Professor Uzodinma Nwala and spokesperson, Chief Abia Onyike on Friday, argued that May 30 has become an official Igbo Remembrance Day, which cannot be wished away.\n“Events in Alaigbo on May 30, each year show that May 30 has become an official Igbo Remembrance Day not only within Alaigbo but throughout the entire world where Igbo citizens live.\n“It is in the light of this that the ADF fully supports observance of May 30, this year as Igbo Day Celebration.\n“May 30 marks the day Biafra was declared in 1967 and no patriotic Igbo son or daughter can pretend that Biafra is not part of the history and indeed the major water-shed in the history of the Igbo nation,” the group noted."
  },
  {
    "headline": "Any PDP tour of Osun without resolution chairmanship tussle a waste of time – Adagunodo",
    "summarized_story": "The embattled chairman of Osun State Chapter of People’s Democratic Party (PDP) Hon.\nIt is not an official programme of the Osun State chapter of the Peoples Democratic Party.\nInterest groups within a political party are allowed to consult but this should not be misconstrued as an official programme of Osun PDP.\nThere is a difference between OSUN PDP AND PATHFINDER TEAM.\nWill you consider your removal as the genesis of the Osun PDP crisis?"
  },
  {
    "headline": "COAS: Why Buhari Settled For Maj Gen Yahaya – Defence Minister",
    "summarized_story": "The Minister of Defence, Maj. Gen. Bashir Salihi Magashi (retd) said President Muhammadu Buhari has expediently put national interest above ethnic and religious chauvinism in the appointment of Major General Farouk Yahaya as the new Chief of Army Staff (COAS).\nMagashi noted that certain factors were considered and General Yahaya satisfied all requirements.\nThe minister also disclosed that plans were in the pipeline by the Federal Government to immortalise late General Attahiru and others who died in the NAF plane crash.\nADVERTISEMENTThe Minister expressed optimism in the professional pedigree of the former theatre Commander of Operation “Hadin Kai” General Yahaya in sustaining the trajectory of taking offensive and aggressive campaigns to the camps, corridors and cells of the adversaries with a view to obliterating them.\nHe pledged the support of the Ministry of Defence under his watch to the new Army chief in carrying out his mandate."
  },
  {
    "headline": "COAS: Why Buhari Settled For Maj Gen Yahaya – Defence Minister",
    "summarized_story": "The Minister of Defence, Maj. Gen. Bashir Salihi Magashi (retd) said President Muhammadu Buhari has expediently put national interest above ethnic and religious chauvinism in the appointment of Major General Farouk Yahaya as the new Chief of Army Staff (COAS).\nMagashi noted that certain factors were considered and General Yahaya satisfied all requirements.\nThe minister also disclosed that plans were in the pipeline by the Federal Government to immortalise late General Attahiru and others who died in the NAF plane crash.\nADVERTISEMENTThe Minister expressed optimism in the professional pedigree of the former theatre Commander of Operation “Hadin Kai” General Yahaya in sustaining the trajectory of taking offensive and aggressive campaigns to the camps, corridors and cells of the adversaries with a view to obliterating them.\nHe pledged the support of the Ministry of Defence under his watch to the new Army chief in carrying out his mandate."
  },
  {
    "headline": "6 Years Of Buhari Better Than PDP’s 16 Years – APC Group",
    "summarized_story": "The group operating under the auspices of All Progressives Congress (APC) Legacy Awareness & Campaign, made this remark on Friday in Abuja while reeling out some of the achievements of the APC-led government led by President Buhari.\nIsmail Ahmed, said the group has commenced a national campaign to promote some of the initiatives of APC-led government.\nADVERTISEMENT“With all the challenges in the country, APC is the only party that is working to address them.\n“Our country, Nigeria, like every country in the world, is faced with difficult problems.\n“Changing Nigeria for the better requires hard decisions, which are the focus of all our governments’ initiatives under the leadership of President Muhammadu Buhari."
  },
  {
    "headline": "6 Years Of Buhari Better Than PDP’s 16 Years – APC Group",
    "summarized_story": "The group operating under the auspices of All Progressives Congress (APC) Legacy Awareness & Campaign, made this remark on Friday in Abuja while reeling out some of the achievements of the APC-led government led by President Buhari.\nIsmail Ahmed, said the group has commenced a national campaign to promote some of the initiatives of APC-led government.\nADVERTISEMENT“With all the challenges in the country, APC is the only party that is working to address them.\n“Our country, Nigeria, like every country in the world, is faced with difficult problems.\n“Changing Nigeria for the better requires hard decisions, which are the focus of all our governments’ initiatives under the leadership of President Muhammadu Buhari."
  },
  {
    "headline": "Scores Kidnapped On Abuja-Kaduna Road, Says Shehu Sani",
    "summarized_story": "A former Kaduna Central Senator and civil rights advocate, Comrade Shehu Sani, has raised the alarm that scores of travelers have been kidnapped on Abuja-Kaduna Expressway on Friday.\nSenator Sani took to his social media handles to announce the incident.\nOn Facebook, he posted: “Scores kidnapped along Kaduna Abuja road, in between Jere and Katari villages this Friday afternoon.”Earlier on his Tweeter handle, the former lawmaker advised Nigerians to be careful while plying Kaduna-Abuja Road as bandits have blocked the ever-busy road.\nIn a tweet on Friday, Sani wrote: “I have just got a call that Bandits have blocked the Kaduna Abuja road, in between Jere and Katari village in this broad daylight.\nScores of people were kidnapped while many have made a fast u-turn in the face of gunshots.”"
  },
  {
    "headline": "Entrepreneurs must be well educated, says CEO of Sonaira Business World",
    "summarized_story": "By Mutiat AlliThe idea that education has no correlation with the founding of successful businesses is grossly misplaced according to Sonia Omon-Obehi Ovuehor, CEO, Sonaira Business World.\nObtaining a quality education is very important and crucial to entrepreneurship in contemporary society, she argued.\nThe graduate of the University of Benin enrolled at the Pan African Institute for Entrepreneurship and Community Development in 2014, where she further expanded her knowledge about business.\nThe education at the institute helped to crystallised her then decade-long experience trading in commodity.\nShe added: “Growing up, I watched my mom run several businesses, mostly petty trading, even as she took on a daily paid job at times."
  },
  {
    "headline": "Remembering Nigeria’s Biafra war, which many Nigerians would rather forget",
    "summarized_story": "He joined the Biafran army and was assigned to the signal unit, whose responsibilities included “active intelligence and eavesdropping on the Nigerian military”.\nNigerian troops entering Port Harcourt, after routing Biafran troops during the Biafran War.\nHe also remembers the last year of the war when his unit was continuously on the move, fleeing the advancing Nigerian army.\nBIAFRA- By all military odds, Biafra should have lost its war with federal Nigeria long ago.\nIts primary responsibility was to provide technological support to the Biafran army, which was poorly equipped."
  },
  {
    "headline": "Lagos Gov. Babajide Sanwo-Olu vows to punish parents of children convicted of cultism",
    "summarized_story": "Lagos State Governor, Mr Babajide Sanwo-Olu, has said the parents of children convicted for cultism will also face punitive measures.\nSanwo-Olu stated this on Thursday during the Children’s Day celebration at the Police College, Ikeja, addressing pupils and students.\nHe stated that a new law had been signed to fight cultism, adding that parents must be alive to their responsibilities by paying attention to the moral upbringing of their children.\nSanwo-Olu, who was represented by the Deputy Governor, Dr. Obafemi Hamzat, said,Quote“The new law against cultism prescribes punitive measures for parents of young people convicted of cultism.\n“It is not by accident that the education sector got the highest budget in 2020 and 2021."
  },
  {
    "headline": "Doctor narrates his encounter with a female ghost in his house, shares ‘proof’ of her presence",
    "summarized_story": "A medical doctor took to Twitter to complain about a “female ghost” that’s in his house and uses his things.\nDr Maxvayshia said the ghost slams his door, uses his shower, cleans her body with his towel, and also wipes her makeup on his clean T-shirts.\nHe shared a photo of one of his T-shirts smeared with what appears to be makeup.\nHe then issued a warning to the ghost, writing, “I don’t know what u are all about.\nBack in 2020, he shared a thread, narrating his encounter with a ghost while sleeping over at a colleague’s house."
  },
  {
    "headline": "Nwodo demands additional state creation for S-East",
    "summarized_story": "Former President General of apex Igbo socio-cultural organisation, Ohanaeze Ndigbo, John Nnia Nwodo, yesterday, called for the creation of Adada State in the South East.\nAccording to Nwodo, the South East has long been marginalized in the distribution of state entities and as such, the creation of an additional state would help give the people a sense of belonging.\n“No demand is as old as the demand for an additional creation of an additional state for the people and this shows it can be recommended” he said.\nHe recalled that former president Goodluck Jonathan convened a national conference in 2014 where the need for additional state creation and other recommendations were made.\nHe noted that although those who made the constitution made it almost impossible for the creation of an additional state, it can still be achieved."
  },
  {
    "headline": "Nwodo demands additional state creation for S-East",
    "summarized_story": "Former President General of apex Igbo socio-cultural organisation, Ohanaeze Ndigbo, John Nnia Nwodo, yesterday, called for the creation of Adada State in the South East.\nAccording to Nwodo, the South East has long been marginalized in the distribution of state entities and as such, the creation of an additional state would help give the people a sense of belonging.\n“No demand is as old as the demand for an additional creation of an additional state for the people and this shows it can be recommended” he said.\nHe recalled that former president Goodluck Jonathan convened a national conference in 2014 where the need for additional state creation and other recommendations were made.\nHe noted that although those who made the constitution made it almost impossible for the creation of an additional state, it can still be achieved."
  },
  {
    "headline": "Janus Films acquires North American rights for EYIMOFE (This is My Desire) – Daylight",
    "summarized_story": "By TOM OGHENE* Makes history as first Nigerian film on Criterion CollectionJUST as the film concluded its cinematic release in Nigeria, Janus Films has announced the acquisition of Nigerian feature film EYIMOFE (This is My Desire) for the North America market.\nJanus Films was founded in 1956 and was the first theatrical distribution company dedicated to bringing international art-house films to US audiences.\nSpeaking on the acquisition, Criterion President and Janus partner Peter Becker said: “Arie and Chuko’s EYIMOFE (This is My Desire) doesnot feel like a debut film.\nIt then continued to tour festivals in over twenty countries, including BFI London Film Festival, AFI Film Festival in US, Sao Paulo International Film Festival, Vancouver International Film Festival and Seattle International Film Festival where it won the New Directors Grand Jury Prize.\nExecutive producers include Maiden Alex Ibru, Toke Alex Ibru, Olorogun Oskar Ibru, Kayode Akindele, and Ifeoma Esiri."
  },
  {
    "headline": "Janus Films acquires North American rights for EYIMOFE (This is My Desire) – Daylight",
    "summarized_story": "By TOM OGHENE* Makes history as first Nigerian film on Criterion CollectionJUST as the film concluded its cinematic release in Nigeria, Janus Films has announced the acquisition of Nigerian feature film EYIMOFE (This is My Desire) for the North America market.\nJanus Films was founded in 1956 and was the first theatrical distribution company dedicated to bringing international art-house films to US audiences.\nSpeaking on the acquisition, Criterion President and Janus partner Peter Becker said: “Arie and Chuko’s EYIMOFE (This is My Desire) doesnot feel like a debut film.\nIt then continued to tour festivals in over twenty countries, including BFI London Film Festival, AFI Film Festival in US, Sao Paulo International Film Festival, Vancouver International Film Festival and Seattle International Film Festival where it won the New Directors Grand Jury Prize.\nExecutive producers include Maiden Alex Ibru, Toke Alex Ibru, Olorogun Oskar Ibru, Kayode Akindele, and Ifeoma Esiri."
  },
  {
    "headline": "Eight villagers, two bandits shot dead in fresh attack in Kaduna",
    "summarized_story": "By Mohammed TijjaniThe Kaduna State Government on Friday said bandits have killed eight persons in Giwa, Chikun, Igabi and Sabon Gari Local Government Areas of the state.\nThe state government also said that two suspected bandits were killed in reprisal attacks.\nThe Commissioner for Internal Security and Home Affairs, Mr Samuel Aruwan confirmed the killings in a statement on Friday in Kaduna.\nAruwan said: “Security agencies reported that bandits invaded Na’ikko village in Giwa LGA and community volunteers engaged the bandits and in the ensuing gun duel, three residents were killed.\n“In another incident, bandits invaded Dakyauro village, Sabon Birni, Igabi LGA and killed four persons after rustling about 25 cows."
  },
  {
    "headline": "Kaduna govt speaks on alleged kidnapping on Kaduna-Abuja highway",
    "summarized_story": "By AbankulaThe Kaduna State Government has reacted to reports that ‘scores’ of people were kidnapped on Friday on the Kaduna-Abuja highway.\nCommissioner for Internal Security and Home Affairs, Samuel Aruwan said security agencies have not confirmed the report.\n“The security agencies manning the Kaduna-Abuja road are yet to confirm the kidnapping of scores of citizens as reported by a social media enthusiast”, Aruwan said.\n“The Government of Kaduna State known for publicising security developments will certainly make public feedback received by the military and police as soon as the agencies revert”, he added.\nThe public will be briefed as soon as Government of Kaduna State receives operational feedback."
  },
  {
    "headline": "Ponzi scheme operator fleeing from Lagos, arrested in Sokoto",
    "summarized_story": "By AbankulaWanted Ponzi scheme operator Omotade-Sparks Amos Sewanu, who fled from Badagry, Lagos State, has been arrested by the EFCC in Sokoto.\nSewanu was the mastermind of the Inks Nation Ponzi Scheme.\nThe suspect who had been at large, was finally arrested on 27 May.\nHe went ahead to distribute a payment card called “Pink Card” to further confuse his victims.\nOmotade-Sparks equally made false claims that he was in partnership with the EFCC to persuade people to invest in his devious scheme."
  },
  {
    "headline": "Why Buhari Appointed Farouk Yahaya As New Chief Of Army Staff – Minister Of Defence",
    "summarized_story": "The Minister of Defence, Bashir Salihi-Magashi has defended the decision of President Buharu to appoint Major General Farouk Yahaya as the new Chief of Army Staff.\nMagashi explained that Buhari didn’t consider ethnic or religious factors but rather national interest in choosing the new Army Chief.\nRecall that Presisent Buhari on Thursday appointed Major General Farouk Yahaya as the new Chief of Army Staff to replace the late Lt-Gen Ibrahim Attahiru who died last week in a military plan crash in Kaduna.\nThe Minister describe Yahaya as the best first for the job and expressed confidence in the ability of the new Chief of Staff to deliver.\n“The appointment of General Yahaya, President Buhari has expediently put national interest above ethnic and religious chauvinism by fulfilling all requirements necessary."
  },
  {
    "headline": "BREAKING: New COAS, Farouk Yahaya Resumes",
    "summarized_story": "On Friday, Major General Farouk Yahaya took over as the nation’s 22nd Chief of Army Staff.\nYahaya was sworn in at the Army Headquarters in Abuja during a ceremony.\nWhen he arrived, he first went to the sentry to view the guard of honour, after which he went to the conference room.\nHe led others in observing a minute of silence before the start of the program in memory of his late predecessor and ten others who died in a plane tragedy last Friday.\nFirst photo of the new COAS sitting at his official desk."
  },
  {
    "headline": "JUST IN: Disaster Averted As Tanker Guts Fire On Otedola Bridge (Photos)",
    "summarized_story": "On Friday, men from the Lagos State Fire Service extinguished flames from a tanker that had been parked near the Otedola Bridge in the Berger Area of Lagos.\nThe front of the truck was heavily damaged by the fire, according to photos taken at the scene.\nThe fire erupted as a result of an electrical problem, according to the Lagos State Emergency Management Agency.\nLASEMA tweeted, “Upon arrival at the scene it was observed a Mack tanker truck with no registration number loaded with 45,000 litres of diesel was gutted by fire while descending Otedola bridge inward Berger.\n“Further investigation gathered at the scene revealed that (the) fire started as (a) result of an electrical fault."
  },
  {
    "headline": "VIDEO:#MilitaryAppreciationDay: Nigerians honor late COAS Attahiru, military personnel",
    "summarized_story": ""
  },
  {
    "headline": "#MilitaryAppreciationDay: Nigerians honor late COAS Attahiru, military personnel",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: In Ebonyi, Umahi fires Commissioners, others",
    "summarized_story": "Governor David Umahi of Ebonyi state, Friday, dissolved the State Executive Council (SEC).\nSecretary to the State Government (SSG), Dr Kenneth Ugbala, during a joint exco briefing in Abakaliki, said the dissolution was in two phases.\nThose not affected, according to him, include SSG, Attorney General and Commissioner for Justice, Cletus Ofoke; Commissioner for Finance, Orlando Nweze and Commissioner for Information, Uchenna Orji.\nOthers are Commissioner for Border Peace, Stanley Okoro Emegha; SSA Investment, Chioma Nweze and Commissioner for Capital City, Onyekachi Nwebonyi.\nThe Special Assistants to the Governor office of the Deputy Governor, Capital City, Finance, Parks, Media and Medicals are also to remain in their positions."
  },
  {
    "headline": "Stolen Artefacts: ARAN commends FG’s recovery efforts -NigPilot",
    "summarized_story": "Rescuers Association of Nigeria, (ARAN) a body responsible for the rescue of Nigeria artifacts and its patrimonies has commended Minister of Information and Culture, Alhaji Lai Mohammed, over his recent call for all artifacts looted from Nigeria by foreigners to be returned.\nThe President, Obalosa Bamidele made the commendation in Abuja on Monday while speaking with journalists saying that Alhaji Mohammeds’ call is yielding fruitfulness with some foreign institutions with the nations’ patrimonies agreeing to negotiate with the country for possible returns.\nHe said with the renewed calls for the repatriation of all looted Nigeria artifacts , with passion and commitment of the Minister, there is hope that “most stolen riches of the country will find its way back.”Recall that the Federal Government launched campaign for the repatriation of looted artefacts from the country in 2019 which yielded fruitfully with spate of return of stolen Nigerian antiquities from around the world.\nThe German Government and Museums, both of which are currently at the forefront of repatriating the nations’ antiquities set the stage for a global movement to restitute colonial loot with its March announcement that it planned to hand over some Benin bronze to Nigeria.\nAlso, the Jesus College at the University of Cambridge has pledged to return a bronze cockreal along with the University of Aberdeen in Europe, committed in returning a Benin bronze, head of an oba (king) in its possession, acquired in a way that is considered extremely immoral."
  },
  {
    "headline": "FG reiterates commitment to effective waste management system -NigPilot",
    "summarized_story": "Minister for Environment, Dr Muhammad Mahmoud Abubakar has said that the Federal Government is committed to an effective waste management system in Nigeria.\nThe Minister stated this at the 3rd International Waste Summit 2021, organised by the Waste Management Society of Nigeria, WAMASON, held in Port Harcourt, Rivers State.\nAbubakar noted that the Federal Government is seeking greater partnership with professional bodies like WAMASON on useful ideas on effective waste management in the country.\nHe stressed that youths could benefit through all the stages of waste management, from sorting, storage, transporting to treatment.\nIn achieving an effective waste management system, the Minister stated that the federal government will continue to develop policies to ensure that actions towards waste management are profitable."
  },
  {
    "headline": "NAPTIP DG calls for implementation of policies for protection of children",
    "summarized_story": "Director-General of the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, Imaan Sulaiman – Ibrahim has called for the strengthening of policies, programs, and legal instruments that will further enhance the protection of Children in the Country.\nThe NAPTIP boss said “I join millions of Nigerians across the globe in wishing our children a Happy Children’s Day.\nQuite a large number of Nigerian children have fallen victims of illicit commercial activities which include human trafficking, sexual exploitation domestic servitude, and street begging.\n“It is therefore imperative that parents work closely with NAPTIP and other law Enforcement Agencies in ensuring that perpetrators of evil acts towards our children are reported in order to ensure that such perpetrators are brought to book.\n“NAPTIP on its part shall continue to work assiduously towards the protection of our children,” she said."
  },
  {
    "headline": "Children’s Day: UNICEF calls for protection of child rights -NigPilot",
    "summarized_story": "Commemorating the event of the Children’s Day, the United Nations Children’s Fund, UNICEF, has advocated the need to reinforce protection mechanisms for children especially at a challenging moment for child rights in the country and the world, with the COVID-19 pandemic threatening gains made for children’s development.\n“As we rightfully celebrate Nigerian children today, let us also remember that the COVID-19 crisis has been a child rights crisis – in Nigeria and around the world.\n“On this Nigerian Children’s Day, let us all agree that we cannot let one crisis compound another.\n“Violence is perpetrated against one in four Nigerian children – and one in three Nigerian girls is sexually abused.\n“Nigerian children are resilient, talented and aspire to do great things."
  },
  {
    "headline": "Supreme Court Dismisses APC Forgery Suit Against Obaseki",
    "summarized_story": "The Supreme Court has dismissed the All Progressives Congress’ (APC) forgery suit against the Edo State Governor, Godwin Obaseki.\nThe court dismissed the suit for lack of merit.\nIt was filed against Governor Obaseki, the Peoples Democratic Party (PDP) and the Independent National Electoral Commission (INEC).\nThe apex court’s judgement comes two days after the Court of Appeal in Benin upheld the victory of Governor Obaseki of Edo at the 2020 governorship election.\nIn its ruling, the appellate court held that Obaseki did not forge his certificates with which he contested the 2020 governorship election."
  },
  {
    "headline": "Diezani Forfeited Jewellery Worth N14.4bn, Houses Valued At $80m – EFCC",
    "summarized_story": "The Chairman of the Economic and Financial Crimes Commission (EFCC), Abdulrasheed Bawa has disclosed that the jewellery forfeited by the former Minister of Petroleum Resources Diezani Alison-Madueke is worth N14.4 billion.\nThe EFCC chairman stated this on Friday when he appeared before the House of Representatives ad-hoc committee investigating the assessment and status of recovered loot.\nHe said the “jewellery forfeited from the former minister has been valued by relevant government agencies and the estimated value of the jewellery is 14.4 billion naira.”Bawa also noted that the estimated value of the houses seized and forfeited from Diezani is $80 million.\nREAD ALSO: EFCC Hands Over Diezani’s Forfeited Property To Lagos For Isolation CentreEarlier this year, the EFCC handed a property forfeited by the former minister to the Lagos Government for use as an isolation centre for COVID-19 patients.\nThe six flats of three bedrooms and a boys’ quarter had been forfeited to the Federal Government, following an order of a Federal High Court in Lagos in 2017."
  },
  {
    "headline": "New COAS Maj. Gen Yahaya Assumes Office",
    "summarized_story": "The newly-appointed Chief of Army Staff Major General Farouk Yahaya has officially resumed duties.\nHe began his resumption by inspecting the Quarter Guard.\nThe new COAS succeeds Lieutenant Ibrahim Attahiru who died in a plane crash exactly one week ago in Kaduna state alongside other military officers.\nChannels Television’s Sodiq Adelakun captured the event:"
  },
  {
    "headline": "Three Officers Killed In Attack On Delta Police Station",
    "summarized_story": "Three officers have been killed in an attack on the Umutu Police Divisional Headquarters in Ukwuani Local Government Area of Delta State.\nThe Acting Public Police Relations Officer Bright Edafe confirmed the incident in a statement on Friday.\nEdafe noted that the incident started at about 2.am when armed men in their numbers stormed the Umutu police formation, shooting sporadically at the station.\nThe attackers invaded the police station in the early hours of the day with three officers feared dead.\nNigeria’s security situation has worsened in recent months despite the federal government’s reassurances and efforts by security agencies."
  },
  {
    "headline": "Nigerians Will Appreciate Buhari Better After His Tenure In 2023, Says Adesina",
    "summarized_story": "The Presidency on Friday said Nigerians will appreciate President Muhammadu Buhari after the expiration of his tenure in 2023.\nIn 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State.\n– The designation of President Buhari as the African Union (AU) Anti-Corruption Champion for 2018– The designation of President Buhari by ECOWAS Heads of State as West Africa’s Covid-19 Champion in 2020."
  },
  {
    "headline": "The Buhari administration at 6: Counting the Blessings One By One By Femi Adesina",
    "summarized_story": "In 2020 President Buhari commissioned the first phase of the Waltersmith Modular Refinery, in Imo State.\n– Nigeria national U-17 football team, the Golden Eaglets, won the FIFA U-17 World Cup for the fifth time, in 2015.\nTheir first ever win was 30 years earlier, in 1985, when President Buhari was military Head of State.\n– President Buhari approved 5 billion Naira in take-off grant for the Maritime University.\n– The designation of President Buhari as the African Union (AU) Anti-Corruption Champion for 2018– The designation of President Buhari by ECOWAS Heads of State as West Africa’s Covid-19 Champion in 2020."
  },
  {
    "headline": "Bandits kill 10 people in fresh attack in Kaduna",
    "summarized_story": "No fewer than ten person have been killed by armed bandits during an attack and counter attack in some villages in Giwa local government Area, Kaduna State.\nMr Aruwan disclosed that youths of Na’ikko village reacted to the killings by attacking Rugan Abdulmuminu, a nearby Fulani settlement, killing two persons they alleged were involved in the attack.\nArmed bandits also invaded Dakyauro village in Igabi Local government area killing four persons and rustling about 25 cattle.\nKaduna State Governor, Nasir El-Rufai expressed sadness over the attack and condoled with the families of those who were killed.\nThe Kaduna state government has also urged private schools operating in high-risk areas, to adhere to the security advisories issued to them."
  },
  {
    "headline": "Buhari Meets Former Nigeria President Jonathan Over Worsening Crisis in Mali",
    "summarized_story": "Nigeria’s President Muhammadu Buhari has called on actors in the political crisis in Mali to come together for the peace and unity of the country.\nMr Buhari stated this on Friday in the Nigerian capital, Abuja when he received in audience former President Goodluck Jonathan who is Special Envoy and ECOWAS mediator to the West African country.\nPresidential aide, Femi Adesina in a statement quoted President Buhari as saying “a situation where most parts of the country are in the hands of insurgents calls for a consensus and restoration of peace, not a further escalation of the crisis.”Former President Goodluck had briefed the President on the current situation in Mali after meeting with the key political actors ahead of the meeting of ECOWAS leaders under the Chairmanship of President Nana Akufo-Addo of the Republic of Ghana.\nHe added that the meeting of the regional leaders was necessary to urgently find an acceptable solution to the current impasse in the West African nation.\nBy Abel Ejikeme"
  },
  {
    "headline": "Kenya Stops Giving First Doses of AstraZeneca Jabs",
    "summarized_story": "Kenya’s health ministry has advised hospitals to stop giving first doses of the AstraZeneca Covid-19 vaccines.\nHealth Minister Mutahi Kagwe says a shipment arriving on Friday from global-sharing scheme Covax is meant for those due for their second shots.\nMore than 950,000 Kenyans who received their first jab of the Covid-19 vaccine in mid-March will receive the booster shots from Friday.\nMr Kagwe says under the current circumstances it will be better to ensure that these people are fully vaccinated.\nA single dose of the AstraZeneca vaccine gives around 70% protection for at least 12 weeks and 81% after a full dose."
  },
  {
    "headline": "Juventus Sack Pirlo as Head Coach, Allegri Announcement Imminent",
    "summarized_story": "Italian football club Juventus has sacked Andrea Pirlo as head coach and are close to announcing the return of Massimiliano Allegri to replace the football legend.\n53-year-old Allegri is expected to re-sign within the next 24 hours, according to Sky Sports.\nJuve issued the following message to Pirlo upon his departure from the Allianz Stadium: “Thank you, Andrea.\nA few months ago, Andrea Pirlo, an icon of world football, began his new adventure, his first as a coach.\n“Pirlo has just begun the first steps of what will no doubt become a brilliant career as a coach."
  },
  {
    "headline": "Liverpool Signs Konate From RB Leipzig",
    "summarized_story": "Liverpool have signed centre-back Ibrahima Konate from RB Leipzig after agreeing to pay his £36m release clause.\nThe 22-year-old made 21 appearances for Leipzig this season including eight Bundesliga starts as the club finished second – 13 points behind champions Bayern Munich.\nThe injuries saw Fabinho and Jordan Henderson at times deployed at centre-back, while Nathaniel Phillips and Rhys Williams were the defensive pairing at the tail-end of the season as Liverpool secured a top-four place and Champions League football next year.\nLiverpool had signed Ben Davies permanently and Ozan Kabak on loan from Schalke as defensive cover in January.\nDavies is yet to make his Liverpool debut, he was an unused substitute eight times, while Kabak made 13 appearances but looks set to return to Germany despite the club having the option to buy the 21-year-old this summer."
  },
  {
    "headline": "Syria’s Assad Wins 4th Term with 95% of Vote, In Election the West Calls Fraudulent",
    "summarized_story": "The foreign ministers of France, Germany, Italy, Britain and the United States said in a statement criticising Assad ahead of the election that the vote would not be free or fair.\nTurkey, an Assad adversary, has also said the election was illegitimate.\nThe win delivers Assad, 55, seven more years in power and lengthens his family’s rule to nearly six decades.\n… For the future of Syria’s children and its youth, let’s start from tomorrow our campaign of work to build hope and build Syria,” Assad wrote on his campaign’s Facebook page.\nRallies with thousands of people waving Syrian flags and holding pictures of Assad while singing and dancing took place all day Thursday in celebration of the election."
  }
]