[
  {
    "headline": "German woman bags 15 years in jail for murdering her five children",
    "summarized_story": "A woman from the western German city of Solingen on Thursday received a life sentence of 15 years after being found guilty of murdering five out of her six children.\nThe woman’s eldest son survived her actions.\nDuring the trial, the prosecution alleged that she had first sedated the children and then drowned or suffocated them one at a time.\nThe woman insisted that an intruder had broken into her home, tied her up and forced her to send chat messages before murdering the children.\nShe had sent her eldest son, who survived unscathed, to his grandmother."
  },
  {
    "headline": "Vira video: That’s how most of us learnt, Tweeps react as teacher scolds pupil",
    "summarized_story": "A video of a teacher scolding her pupil in a classroom, which is going viral on Twitter has left users of the platform divided.\nThe teacher could be seen trying to make the child write a sum on the board.\nHer effort also included smacking the child who apparently didn’t understand what she was being told to do.\nOne Twitter user, @AkanPatrick1, said, “The fact that it happened to us doesn’t make it right.\nShe needs more training to deal with her emotions and change teaching styles to suit the child’s unique needs”"
  },
  {
    "headline": "Gov. Ugwuanyi appoints Dr. Didigwu as Surveyor-General",
    "summarized_story": "…Upgrades Survey Dept to Extra-Ministerial DeptGovernor Ifeanyi Ugwuanyi of Enugu State has approved the appointment of Surveyor Dr. Augustine S. Didigwu as the Surveyor-General and Head of the state’s Survey Department.\nAroh disclosed that Surveyor Didigwu, until his new appointment, was the Head of Department of Surveying and Geoinformatics, Enugu State University of Science and Technology (ESUT), Agbani, since 2018.\nThe Information Commissioner added that the newly appointed Surveyor-General is also the Chairman of the Nigeria Institute of Surveyors, Enugu State branch, from 2017 till date.\nAroh recalled that the State Executive Council at its 9th Executive Council meeting held on Friday, July 17, 2020 approved the upgrading of the Survey Department to an Extra-Ministerial Department, stressing that Gov.\nUgwuanyi “believes that Surveyor Didigwu, Bs.c, Ms.c, Ph.D, will bring his known professionalism to bear on his new assignment”."
  },
  {
    "headline": "We have no hand in Nnamdi Kanu’s arrest, extradition, Kenya govt tells court",
    "summarized_story": "By Steve OkoKenyan Government has again distanced itself from the arrest and rendition of the Leader of the Indigenous People of Biafra, IPOB, Mazi Nnamdi Kanu.\nThe Government in its defense to the suit filled against it by Kanu’s brother, Kingsley Kanunta Kanu on behalf of the IPOB Leader, confirmed to the court in Kenya that Kanu did not undergo extradition proceedings in Kenya.\nAccording to a press release by Kanu’s brother made available to Vanguard on Thursday by Kanu’s Special Counsel, Aloy Ejimakor, the court hearing in Kenya took place on November 2.\nIt read in part ” On 2nd November 2021, the Government of Kenya filed its defense to the suit I had earlier filed in Kenya on behalf of my brother, Mazi Nnamdi Kanu.\nOur immediate goal is to secure the unconditional release of Mazi Nnamdi Kanu from detention.”Vanguard News Nigeria"
  },
  {
    "headline": "How an APC win could reposition Anambra [Opinion]",
    "summarized_story": "Okeke may not have said everything, but his views represent the silent majority who are no longer amused by the provincial politics that has kept Anambra State down.\nFew entrenched interest whose purpose the futile opposition politics serves have continued to manipulate the emotions of the people for a long time.\nA state like Anambra that produced leaders of Nigeria does not need to go cap in hand to take what belongs to her.\nFollowing from here Anambra does not want to sit idly by while major decisions are taken behind her.\nAnambra State is too important to be isolated in national politics."
  },
  {
    "headline": "Ikoyi Building: Death toll hits 36, rescued still 9 so far",
    "summarized_story": "By Olasunkanmi AkoniThe death toll at the scene of the collapsed building at Gerrard Road, Ikoyi, Lagos has risen to 39 while 9 victims have been rescued so far as at 8.55 a.m, on Thursday.\nNEMA Acting Coordinator, Lagos State Territorial District, Mr. Ibrahim Farinloye, said the survivors include: 1 female and 8 males.\nSimilarly, he said the bodies of three females and 33 males have been recovered so far.\nAccording to Farinloye: “36 dead and 9 alive.\n“Out of the dead, 3 females and 33 males dead.”Meanwhile, search and rescue operation were ongoing as at 9.10am."
  },
  {
    "headline": "IGP, other security agencies working hard to ensure victim’s of UNIABUJA are released",
    "summarized_story": "The police and other security agencies including the military are working hard to ensure that those abducted are released.\nDeclaring the workshop open, Ogun State Governor, Prince Dapo Abiodun, said the initiative would ensure more effective and efficient law enforcement.\nThis is what Ogun state has been doing.\nThe entire law enforcement in Ogun state collaborate very well.\nSecurity is not just having the police or the military, it is also important to look at areas of unemployment."
  },
  {
    "headline": "Insecurity: CAN blasts El-Rufai’s shut down of telecommunication network",
    "summarized_story": "The Christian Association of Nigeria (CAN), Kaduna State chapter, has lamented that the shutdown of telecommunication services in some parts of the state has worsened the insecurity situation.\nHe observed that the shut down of the telecommunication network has further enabled bandits to have a field day on Sunday killing one and kidnapping over 100 Baptist Church worshippers.\nChairman of Kaduna CAN, Rev.\nHayab noted that the insecurity in the state came to a climax on Sunday when bandits invaded Emmanuel Baptist Church during service, killed one, and abducted over 100 worshippers, while others sustained severe injuries without any security presence in the area, attributing the kidnapping of the worshippers to the shut down of the telecommunication network.\nHe suggested that unless appropriate measures are taken against insecurity in the state, the security challenges would continue to worsen and the citizens will continue suffering in the hands of the kidnappers."
  },
  {
    "headline": "Climate change: You can’t rely on rainfed agriculture anymore – Expert tells farmers",
    "summarized_story": "A professor of agricultural extension, Bosede Lawal has said that farmers in the country could no longer rely on rainfed agriculture due to the effect of climate change.\nLawal, who said that climate change is having a negative effect on agricultural production, insisted that the best way to get over the problem is for farmers to embrace irrigation farming.\nShe added that farmers could not rely on rainfall because of a shortage of water.\nShe said, “Climate change is real and farmers can no longer rely on rainfed agriculture for sustainable productivity.\n“One of the major strategies of adapting to climate change is the use of irrigation and efficient water management techniques."
  },
  {
    "headline": "He fought civil war, only ingrates won’t appreciate Buhari’s effort – Gov Yahaya Bello",
    "summarized_story": "Governor Yahaya Bello of Kogi State has said only ingrates would not appreciate the achievements, sacrifices and efforts made by President Muhammadu Buhari for Nigeria.\nBello also said that President Buhari fought the civil war to keep the country together.\n“It will take an ingrate not to appreciate what President Buhari has been doing and is still doing for this country.\nHe added, “He fought the civil war to keep the country together.\n“When Mr. President succeeds, he is not succeeding for himself, his success is for Nigerians, whoever is wishing him to fail, is wishing Nigeria to fail."
  },
  {
    "headline": "Zamfara Assembly passes bill to promote children, younger persons’ education into law",
    "summarized_story": "The Zamfara State House of Assembly has passed into law, a bill seeking to promote children and younger persons’ education after serious amendments to the bill.\nThe House noted that the bill was a private one but sponsored by a member representing Maru North in the state House of Assembly, Hon.\nHowever, a member representing Bungudu West, Hon.\nNasiru Lawal, also presented before the House a bill on “social protection and other matters connected therewith 2021” and it scaled through the first reading.\nAccording to the Director-General, Press Affairs of the House, Comrade Mustapha Jafaru Kaura, the Speaker, Nasiru Mua’zu Magarya commended the lawmaker for sponsoring the bills."
  },
  {
    "headline": "Niger Gov commends FG, others over NNPC road intervention",
    "summarized_story": "Governor Abubakar Sani Bello of Niger State has commended the Federal Government for the approval given to the Nigeria National Petroleum Corporation (NNPC) to intervene in fixing some critical federal roads in the state.\nAccording to him, the intervention in the reconstruction of the federal roads would assist in easing movement within the state as well as reduce the risk of road accidents.\n“If we can fix these roads it will help ease movement within the state, reduce travel time and risk of accidents.\nIt would be recalled that the state was among those to benefit from the strategic intervention of NNPC as approved by the Federal Executive Council, FEC, to reconstruct 21 federal roads in the country.\nOut of this number, nine are in North Central with the majority of the roads projects situated in Niger State."
  },
  {
    "headline": "BREAKING: Death toll of Ikoyi building collapse now 38",
    "summarized_story": "The Death toll at Ikoyi collapsed building site has now risen to 38 as rescuers bring out two male bodies, The Nation has learnt.\nThe National Emergency Management Agency (NEMA) acting Southwest Coordinator, Ibrahim Farinloye, said on Thursday afternoon.\n- Advertisement -As of 9 am on Thursday, the number of those confirmed dead were 36.details shortly…"
  },
  {
    "headline": "Anambra election: Gov. Obiano’s aide dumps APGA for PDP",
    "summarized_story": "Ahead of Saturday Anambra governorship election, a Special Adviser to Gov.\nHe said he was supporting the candidature of Mr Valentine Ozigbo and his running mate, Mrs Azuka Enemo of the PDP in the election.\n“I have decided to endorse the ticket of PDP with Mr Valentine Ozigbo and Azuka Enemuo as governorship candidate and running mate respectively to win the Nov. 6 election in Anambra State.\n“I offered myself to serve as the Governor of Anambra State, but Valentine Ozigbo will equally do better by providing purposeful leadership for our people,” he said.\nOkoli thanked Obiano for giving him the opportunity to serve and for the support he enjoyed while in APGA."
  },
  {
    "headline": "Gunmen kidnap 4 women in Suleja",
    "summarized_story": "The Police Command in Niger on Thursday confirmed the abduction of four women by gunmen at Haske Dabara community, Agwan Gwari Kwamba of Suleja Local Government Area of the state.\nThe Commissioner of Police in the state, Mr Monday Kuryas, confirmed the incident in an interview with the News Agency of Nigeria (NAN) in Minna.\n“Yes it has happened at about 1 a.m. last night and already anti-kidnapping team, the army and vigilante had been deployed to rescue the victims.\n“I am appealing to residents, especially rural dwellers, to come forward with credible information on movement of strange faces among them to the nearest security personnel for necessary security action”, he said.\n- Advertisement -An eyewitness said the gunmen entered the community at about 12.46 a.m. with gunshots that scared the residents."
  },
  {
    "headline": "Deploy social media following for social good, Osinbajo urges skit comedians",
    "summarized_story": "Vice President Yemi Osinbajo has urged skit comedians to use their huge followings on social media and the internet to promote issues for the social good and impact.\nThe delegation, which came under the aegis of the Nigeria Skits Industry Awards (NSIA), was led by its promoter, Bimbo Daramola.\nEveryone with a large following also has a responsibility to draw attention to social issues, Osinbajo said, adding that the Federal Government would continue to create an enabling environment for the growth and development of youths in the country.\nIn his remarks, Daramola thanked the vice president for receiving the delegation, saying that Osinbajo identified with young people describing him as a man of the youths.\nMore so, Agba, alongside others on the delegation, commended the vice president for his support for the development of young Nigerians and further commended his youth-centric connection."
  },
  {
    "headline": "Breaking: Anambra guber: INEC begins distribution of sensitive materials to 21 LGAs",
    "summarized_story": "From Obinna Odogwu, AwkaThe Independent National Electoral Commission (INEC) has commenced the distribution of sensitive materials for next Saturday’s governorship election in Anambra to the 21 Local Government Areas of the state.\nThe INEC team, led by the National Commissioner and Chairman, Information, Voter Education and Publicity Committee of the commission, Festus Okoye, are currently in the premises of the Central Bank of Nigeria (CBN) distributing the materials to the LGAs.\nMore details shortly…"
  },
  {
    "headline": "Soldiers on red alert in Abuja",
    "summarized_story": "From Molly Kilete and Isaac Anumihe, AbujaThere was palpable tension in the Federal Capital Territory (FCT), Abuja, yesterday, after soldiers mounted security checkpoints on strategic locations following reports of planned invasion of the city by bandits and terrorists.\nConsequently, soldiers and the various security agencies have been placed on red alert to counter the invasion of criminals into the city.\nAlready the Guards Brigade Nigerian army has deployed its soldiers to strategic locations where they mounted security checkpoints to monitor and arrest the attackers.\nWhen contacted the Commander, Guards Brigade, confirmed the security checkpoints by the soldiers.\nHe, however, did not state why they mounted the security checkpoints even though soldiers have been in that particular spot for sometime now."
  },
  {
    "headline": "Don cheats death as gunmen attack UINABUJA again",
    "summarized_story": "From Fred Ezeh, AbujaBarely 24 hours after gunmen invaded the University of Abuja (UniAbuja) staff quarters and kidnapped six people, the school has been attacked again.\nAn eyewitness told Daily Sun that the gunmen invaded the permanent site of the university yesterday morning and attacked Dr. David Okoroafor of the Economics department in his office.\nDr. Okoroafor who confirmed the attack in a telephone conversation, said he narrowly escaped death as they were determined to take life off him.\nWhen my voice went higher, they ran out and students pursued after them.\nBut when they brandished their gun, the students became afraid and ran back, giving them room to escape into the bush."
  },
  {
    "headline": "Ikoyi building: More govt officials’ll be fired –Sanwo-Olu",
    "summarized_story": "By Lukman OlabiyiLagos State Governor, Babajide Sanwo-Olu has vowed that more government officials would be fired just as he declared that no stone would be left unturned in attempt to unravel what really went wrong at the collapsed 21-storey in Ikoyi.\nGovernor Sanwo-Olu said an Executive Order would be signed to give legal backing to the panel to investigate the immediate and remote causes of the accident.\nThe terms of reference is to determine the causes of the collapse of the building under construction.\n‘’It is on record that we asked the General Manager of the Building Control Agency, Oki to proceed on an indefinite suspension.\nThe state government also identified six out of the nine survivors from the rubbles in the Ikoyi building collapse."
  },
  {
    "headline": "Northern elders reject special treatment, trial for Kanu",
    "summarized_story": "From Okwe Obi, AbujaPan–Arewa socio-politcal group, Northern Elders Forum (NEF) has rejected special treatment and trial for Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB).\nThe group advised the Federal Government to ensure his trial proceed in accordance with the laws of the land without any special treatment, adding that elite who want special treatment accorded to him for peace “are merely inviting more threats on the people.”It also charged government and security agencies not to allow IPOB truncate the Anambra State governorship election on Saturday.\nAccording to Baba-Ahmed, the elders suggested the state independent electoral commissions should be scrapped and the powers to conduct local government elections transferred to the Independent National Electoral Commission (INEC).\nThe continued existence of state electoral commissions which conduct elections into local governments is severely damaging the democratic process.\nThe spokesperson said if labelling bandits as terrorists would quell the onslaught ravaging the region, the elders would support it wholeheartedly."
  },
  {
    "headline": "INEC: We’ll Ensure Only Eligible Voters Determine Next Anambra Governor",
    "summarized_story": "Yakubu, speaking at a stakeholders’ meeting, said some of the sensitive materials had been secured at the Anambra State branch of the Central Bank of Nigeria (CBN) in Awka.\nI am glad to report that all the BVAS required for the election on Saturday have been configured and delivered to Anambra State.\n“An additional 1,112 polling units were established in Anambra State in addition to the existing 4,608 locations.\nUnderstandably, the voters have also been cautious.”Yakubu explained that out of the 5,720 polling units in the state, 86 (1.5%) had no voters.\nAccording to him, “No one is allowed to wear any cloth, emblem or colour signifying any political party to the polling units."
  },
  {
    "headline": "Building Collapse: Sanwo-Olu Sets Up Six-man Probe Panel as Death Toll Rises",
    "summarized_story": "Sanwo-Olu disclosed this yesterday as he named members of the probe panel at the site of the incident.\nA source said, “The dead body of the PA (Personal Assistant) to the owner of the collapsed Lagos building has been recovered.\nMembers of the probe panel announced by Sanwo-Olu comprised a professional builder, town planner, structural engineer, and legal practitioners – all from the private sector.\nAlready, General Manager of the Lagos State Building Control Agency (LASBCA), Arc.\nThe panel members have been given clear terms of reference and we are giving them a 30-day assignment to tell us what has gone wrong at the site."
  },
  {
    "headline": "ARISE Fashion Week Heads to Dubai World Expo",
    "summarized_story": "Vanessa Obioha and Dike OnwuamaezeAfrica’s most dominant and dazzling runway platform, Arise Fashion Week, is heading to Dubai in December.\nIn collaboration with the Nigerian Pavilion at Expo2020 Dubai and the Federal Ministry of Industry Trade and Investment, the platform would be showcasing the best of African fashion designers and music at the expo in Dubai.\nAlso, Grammy-award winning singer Wizkid would be providing musical entertainment and long-term partner of Arise Fashion Week, Naomi Campbell would be making an appearance alongside other global celebrities.\nSince its return, Arise Fashion Week has been at the forefront of promoting and celebrating the next generation of African fashion designers.\nGovernor, Central Bank of Nigeria (CBN), Godwin Emefiele, who graced the occasion in 2020, had acknowledged the potential of the Nigerian fashion industry during his speech."
  },
  {
    "headline": "Upstream Commission Seeks to Tackle Bureaucracies Causing High Oil Production Cost",
    "summarized_story": "He said as a business enabler, the upstream commission would operate and regulate with best industry practices and would continue to remain very transparent.\nHe urged the OPTS to support the commission in ensuring that key upstream development projects were started.\n“It is only when staff are happy that we can talk of improving our crude oil production quota, which is presently below what we should be producing.\n“Any crisis can further harm the low daily oil production in Nigeria and worsen the nation’s federally generated oil revenue,” Komolafe argued.\n“So, what we have done is by extension to improve the nation’s revenue by increasing crude oil production from the current level of 1.4 mbbls/d to 2.4 mbbls/d,” he added."
  },
  {
    "headline": "Arise Fashion Week Heads to Dubai World Expo",
    "summarized_story": "By Vanessa ObiohaAfrica’s most dominant and dazzling runway platform, Arise Fashion Week, is heading to Dubai in December.\nIn collaboration with theNigerian Pavilion at Expo2020 Dubai and the Federal Ministry of Industry Trade and Investment, the platform will be showcasing the best of African fashion designers and music at the expo in Dubai.\nFor the Expo2020 Dubai, Lisa Folawiyo, Ituen Basi, Banke Kuku, Onalaja, Tjwho, Lagos Space Programme, Huddaya are among the fashion designers that will have their collections on the runway.\nAlso, Grammy-award winning singer Wizkid will be providing musical entertainment and long-term partner of Arise Fashion Week, Naomi Campbell will be making an appearance alongside other global celebrities.\nSince its return, Arise Fashion Week has been at the forefront of promoting and celebrating the next generation of African fashion designers."
  },
  {
    "headline": "EXCLUSIVE: Vice President Osinbajo Linked To Lagos Collapsed Building With Current Death Toll Of 36 Persons",
    "summarized_story": "Vice President Yemi Osinbajo has been linked to the collapsed uncompleted 21-storey building in Lagos State.\n“The Vice President has a lot of properties in the area, he is using his brother to manage the properties.\nSpeaking to SaharaReporters, another source said, “I know the land was bought by the Vice President from Elizade.\nA staff member of the Lagos State Building Control Agency (LASBCA) told SaharaReporters that there ‘was an order from above’ not to visit the building during monitoring.\n(d) The developer must complete Form C at all stages of construction and submit the same to Lagos State Building Control Agency (LASBCA)."
  },
  {
    "headline": "EXCLUSIVE: Vice President Osinbajo Linked To Lagos Collapsed Building With Current Death Toll Of 36 Persons",
    "summarized_story": "Vice President Yemi Osinbajo has been linked to the collapsed uncompleted 21-storey building in Lagos State.\n“The Vice President has a lot of properties in the area, he is using his brother to manage the properties.\nSpeaking to SaharaReporters, another source said, “I know the land was bought by the Vice President from Elizade.\nA staff member of the Lagos State Building Control Agency (LASBCA) told SaharaReporters that there ‘was an order from above’ not to visit the building during monitoring.\n(d) The developer must complete Form C at all stages of construction and submit the same to Lagos State Building Control Agency (LASBCA)."
  },
  {
    "headline": "EXCLUSIVE: Buhari Abandons UN Climate Change Conference In Scotland, Jets To London To See Doctors",
    "summarized_story": "President Muhammadu Buhari has left Glasgow, Scotland for London, England to see his doctors, SaharaReporters has gathered.\nShehu had added that “In Glasgow, President Buhari will participate in some side-line events hosted by US President Joe Biden and French President Emmanuel Macron.\nHis use of the Gulfstream Aerospace and Falcon 7X Jets recently followed the ongoing repairs to Nigerian Air Force 1, a Boeing Business Jet (Boeing 737-700) 5N-FGT in Germany.\nSaharaReporters had reported how the presidential jet (Boeing Business Jet (Boeing 737-700) 5N-FGT) developed a fault following Buhari recent trip to the UN General Assembly in the US.\nOn February 5, 2017, he wrote to the National Assembly, seeking an extension of his London medical leave."
  },
  {
    "headline": "EXCLUSIVE: Buhari Abandons UN Climate Change Conference In Scotland, Jets To London To See Doctors",
    "summarized_story": "President Muhammadu Buhari has left Glasgow, Scotland for London, England to see his doctors, SaharaReporters has gathered.\nShehu had added that “In Glasgow, President Buhari will participate in some side-line events hosted by US President Joe Biden and French President Emmanuel Macron.\nHis use of the Gulfstream Aerospace and Falcon 7X Jets recently followed the ongoing repairs to Nigerian Air Force 1, a Boeing Business Jet (Boeing 737-700) 5N-FGT in Germany.\nSaharaReporters had reported how the presidential jet (Boeing Business Jet (Boeing 737-700) 5N-FGT) developed a fault following Buhari recent trip to the UN General Assembly in the US.\nOn February 5, 2017, he wrote to the National Assembly, seeking an extension of his London medical leave."
  },
  {
    "headline": "Ondo Medical University Students To Now Pay As High As N2 Million Tuition Per Academic Session",
    "summarized_story": "Students of the Ondo State-owned University of Medical Sciences (UNIMED), Ondo, will begin to pay school tuition as high as N2 million in the next academic calendar, according to a document obtained by SaharaReporters on Wednesday.\nSaharaReporters gathered that the school fees have increased ahead of the new revised academic calendar which begins on Sunday, November 7, 2021.\nThe non-indigenes and indigenes in the Nursing Sciences, Medical Rehabilitation (I) and Applied Health Sciences (I) will pay N1,200,000 and N900,000 respectively.\nFor those in Medical Rehabilitation (II) and Applied Health Sciences (II), the students who are non-indigenes and indigenes will pay N750,000 and N500,000 respectively.\nThe least school fees are for the Faculty of Sciences (III) in which non-indigenes will pay N240,000 and indigenes will pay N180,000."
  },
  {
    "headline": "IPOB: We did NOT call for boycott of Anambra governorship election",
    "summarized_story": "The Indigenous People of Biafra (IPOB) says it did not call for the boycott of the Anambra governorship election.\n”IPOB wish to correct some misconceptions, unfounded speculations and outright falsehood concerning our position on the forthcoming November 6 governorship election in Anambra state,” he said.\nIPOB has nothing to do with the Anambra election.\nWe are not concerned if anyone wishes to participate or not to participate in the Anambra election.\nIPOB has never told anybody or group to boycott the Anambra election."
  },
  {
    "headline": "IPOB: We did NOT call for boycott of Anambra governorship election",
    "summarized_story": "The Indigenous People of Biafra (IPOB) says it did not call for the boycott of the Anambra governorship election.\n”IPOB wish to correct some misconceptions, unfounded speculations and outright falsehood concerning our position on the forthcoming November 6 governorship election in Anambra state,” he said.\nIPOB has nothing to do with the Anambra election.\nWe are not concerned if anyone wishes to participate or not to participate in the Anambra election.\nIPOB has never told anybody or group to boycott the Anambra election."
  },
  {
    "headline": "JUPEB: DSS, ICPC arrest 48 lecturers, security officers for 'aiding malpractice'",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) and the Department of State Services (DSS) have arrested 48 people for alleged illegalities in the conduct of the Joint Universities Preliminary Examinations Board (JUPEB).\nOgugua said the suspects were arrested from Wellspring University, Benin in Edo state; Christopher University, Mowe in Ogun state; and Crown-Hill University, Ilorin in Kwara state.\nAdvertisementThe ICPC spokesperson also said the joint operation, tagged ‘Operation Combo’, led to the arrests of lecturers, security officers, workers and students from some of the varsities participating in the exam.\n“Three current Vice-Chancellors have been invited by ICPC for their roles in the unchecked and massive malpractices reported,” it added.\nAdvertisement“Some of the suspects arrested have been granted administrative bail while investigation is on-going.”"
  },
  {
    "headline": "JUPEB: DSS, ICPC arrest 48 lecturers, security officers for 'aiding malpractice'",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) and the Department of State Services (DSS) have arrested 48 people for alleged illegalities in the conduct of the Joint Universities Preliminary Examinations Board (JUPEB).\nOgugua said the suspects were arrested from Wellspring University, Benin in Edo state; Christopher University, Mowe in Ogun state; and Crown-Hill University, Ilorin in Kwara state.\nAdvertisementThe ICPC spokesperson also said the joint operation, tagged ‘Operation Combo’, led to the arrests of lecturers, security officers, workers and students from some of the varsities participating in the exam.\n“Three current Vice-Chancellors have been invited by ICPC for their roles in the unchecked and massive malpractices reported,” it added.\nAdvertisement“Some of the suspects arrested have been granted administrative bail while investigation is on-going.”"
  },
  {
    "headline": "eNaira speed wallet app recorded over 360,000 downloads -- 10 days after release",
    "summarized_story": "eNaira speed wallet app, Africa’s first digital currency, has recorded over 360,000 downloads from 160 countries in the world — ten days after release.\nThe eNaira applications have two versions — eNaira speed wallet and eNaira speed merchant wallet.\nAdvertisementAccording to a report seen by TheCable on Wednesday, the eNaira speed wallet, which is for individuals, recorded 367,000 downloads while the eNaira speed merchant wallet for businesses recorded 58,600 downloads.\nDetails of the analytics showed that the eNaira speed wallet for iPhone users increased from 75 countries penetration on October 28 to 81 countries in ten days.\nAdvertisementThe eNaira speed wallet was earlier removed for optimisation after users experienced difficulties registering on the app."
  },
  {
    "headline": "A surge in African fintech's intra-continental expansion to target SMEs",
    "summarized_story": "This article was contributed to TechCabal by Conrad Onyango/birdSupport for small businesses keen to trade across the continent’s single market is being eyed as a potentially lucrative market by more and more African fintech startups.\nSurge in intra-continental expansionIn the last month alone, a number of startups have either raised growth funds, acquired another player present in regional markets within the same vertical, or tapped top talent in the telecoms industry.\nTheir intention appears to be the targeting of small industries and traders seeking cross-border opportunities in new African markets.\nThe program comes barely a month after Tala raised 145 million dollars in equity, hinting that part of the growth funds would go toward supporting its geographical expansion.\nUntil recently, a lack of local knowledge and access to trade and market information has been linked to low trade volumes and value."
  },
  {
    "headline": "African founders lead Payhippo’s $3m seed investment",
    "summarized_story": "There’s a new exciting trend in the African tech ecosystem: African founders backing fellow founders especially in pre-seed and seed funding, which is an indication that the African tech ecosystem is maturing.\nCapital is a lifeline of businessThere are over 40 million small and medium businesses (SMEs) in Nigeria.\nBut only a few of these businesses have access to capital, mostly due to heavy collateral requirements and long time of loan processing.\nFounded by Zach Bijesse, CEO, Chioma Okotcha, COO, and Uche Nnadi, CTO, Payhippo provides small businesses with short-term working capital with average loan amounts of $1300.\n“Access to credit is a critical necessity for small businesses to manage their daily challenges."
  },
  {
    "headline": "Chipper Cash valued at $2 billion after investment from world’s most valuable crypto exchange",
    "summarized_story": "The investment was led by FTX, the most valuable crypto derivatives exchange company owned by the youngest billionaire in the world, Sam Bankman-Fried.\nWith a valuation of over $2 billion, Chipper Cash has now attained a unicorn status.\nChipper Cash is FTX’s first investment in Africa.\nChipper Cash boasts of having over 4 million users across the world.\nAs a result of this partnership, FTX will increase its footprint in Africa and Chipper Cash will be integrated into the FTX product so that African users can fund their crypto wallet through Chipper Cash."
  },
  {
    "headline": "Nigeria’s E-Settlement acquires Côte d’Ivoire’s QuickCash to increase financial inclusion across Africa",
    "summarized_story": "E-Settlement (E-SL), a Nigerian fintech group of companies, has acquired QuickCash, an Ivorian electronic payment and money transfer company, to expand and boost last-mile access to financial services in Francophone African countries like Côte d’Ivoire, Burkina Faso, Niger, Togo and more.\n“QuickCash is deepening access for agricultural-dominated areas, rural populations, the underbanked and unbanked: the disproportionately financially excluded.\n“At E-SL, we want to empower all by accelerating access to payments, financial services, and jobs.\nPatricia Zoundi Yao, CEO at QuickCash believes that E-SL has the “right vision and deep expertise” to drive QuickCash’s geographic expansion and next stage of growth.\n“E-SL is a leading payment services provider with a strong position in Nigeria’s fintech ecosystem."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "NFTs and music, Egypt’s money rain, Payhippo’s $3m seed, and Opibus’s $7.5m funding",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Music and blockchainFunding rounds in EgyptPayhippo’s $3m seedOpibus’s $7.5m fundingNFTs and musicThe NFT market keeps growing.\nSource: SuppliedNigerian fintech startup, Payhippo, has closed a $3 million seed funding round.\nThe company produces heavy-duty electric vehicles (EVs) such as buses and trucks by converting petrol and diesel-based vehicles into electric, reducing cost and, in a way recycling older vehicles.\nOpibus has been manufacturing EVs since 2017, intending to make electric vehicles affordable in Africa.\nHowever, we still have the likes of Jet Motor Company that announced a $9 million funding in 2020, Siltech, and Ampersand playing in the space."
  },
  {
    "headline": "Blockchain meets music: How music label owner promotes artistes and sells their music as NFTs",
    "summarized_story": "But music NFTs are gaining some wind too.\nThe song was minted on Rocki, an NFT music platform on Binance Smart Chain (BSC).\nNFTs are transforming the music businessHector believes NFTs are going to be a big part of the music business in a few years.\nWhy buy music NFTs?\nHe’s currently creating a crypto token and, at the same time, building a blockchain metaverse where crypto and NFTs reign supreme."
  },
  {
    "headline": "MallforAfrica shuts down, Affiong Williams’ ReelFruit, Chipper Cash’s extension round, Violence against journalists",
    "summarized_story": "For Affiong Williams, Founder and CEO of agritech startup, ReelFruit, starting a fruit processing business in Nigeria with no template to draw from was a bold move.\nThe extension round was led by crypto exchange platform, FTX with SVB Capital, Deciens Capital, Ribbit Capital, Bezos Expeditions, One Way Ventures, and Tribe Capital participating.\nCurrently serving seven African countries, Chipper Cash was founded in 2018 by Sam Serunjogi and Maijid Moujaled to facilitate cross border payment in Africa.\nThis is where Chipper Cash has found a sweet spot.\nSerunjogi reveals that Chipper Cash offers remittances at “considerably cheaper” prices than other competitors."
  },
  {
    "headline": "Collapsed building: Experts’ views",
    "summarized_story": "As rescue operations continue with more survivors and dead bodies being pulled out from the rubbles of the collapsed 21-storey building in Ikoyi, Lagos, experts have faulted Lagos State government on regulatory compliance in the state’s building sector.\nThe experts described the otherwise ambitious collapse building as bad construction with serious engineering issues.\nThe pillars were too weak which explains why the building collapsed like a pack of cards with the deckings (slaps) falling on one another as if it were controlled demolition.\nRead Also: More evidence shows Ikoyi collapsed building developer flouted permit“Financiers are going to be a lot more cautious and will be asking a lot of questions on developers’ antecedents before committing funds to a project.\nMeanwhile, fresh facts have emerged on the collapsed building that are not only big slap on the regulatory authority, but also a dent on the integrity of the developer and the building industry in Nigeria in general and Lagos State in particular."
  },
  {
    "headline": "MTN could rake in $244m from sale of Nigeria shares",
    "summarized_story": "MTN could rake in $244m from sale of Nigeria sharesMTN Group plans to sell shares in the carrier’s Nigeria unit worth about 101 billion naira ($244 million), continuing a plan to sell assets and pay down debt.\nAfrica’s largest mobile-phone operator will offer 575 million shares in MTN Nigeria Communications Plc, which listed in Lagos in 2019, according to a statement in Johannesburg.\n“This is the first step in our previously communicated statement of intent to sell down approximately 14% of MTN Group’s current shareholding in MTN Nigeria,” the company said in a statement.\nThe sale comes as MTN looks to finalize a sale-and-lease back of its South African telecom-mast portfolio and list shares in the Uganda operation in Kampala.\nThe planned share sale comes the same MTN Nigeria announced its trading results for the nine months till September 30, 2021 which came in better than analysts estimates."
  },
  {
    "headline": "Nigeria faces pressure to raise interest rates",
    "summarized_story": "Nigeria’s central bank will come under pressure in coming months to increase interest rates as central banks in developed economies adjust to life after the worst of COVID-19 by raising rates to levels before the pandemic.\nThe US Fed said it would start tapering asset buys by $15 billion per month later this month, a move that would lead to higher interest rates in the US.\nNigerian monetary authorities are well aware of the trend of rising global interest rates and the impact it would have on the economy.\nIn Nigeria, however, the CBN has reasons to balk at raising interest rates.\nThe CBN’s new found love for unorthodox policies also means it may resort to other ways of luring foreign capital other than raising interest rates."
  },
  {
    "headline": "Enugu NSCDC deploys 350 personnel, 15 vehicles for Anambra guber poll – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEnugu – The Nigeria Security and Civil Defence Corps (NSCDC), Enugu State Command, says it is deploying no fewer than 350 personnel for the forthcoming Anambra governorship election.\nThe News Agency of Nigeria (NAN) reports that the Anambra gubernatorial poll will hold on Saturday, Nov. 6 under INEC’s supervision.\nManuel said that the command was also deploying 15 operational vehicles to ensure hitch-free movement of its personnel while carrying out their election duty in Anambra.\n“The NSCDC is determined to see a hitch-free and peaceful election just as the Federal and Anambra Governments are determined also”.\n“The commandant had given the command’s contingent all logistics and moral support to ensure a hitch-free election duty and for them to do the command proud in Anambra,” he added."
  },
  {
    "headline": "EFCC opens money laundering trial of ex-governor’s aide’s wife – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestYenagoa – The Economic and Financial Crimes Commission, on Wednesday, opened its case in the money laundering case it instituted against Mrs Beauty Apere at the Federal High Court Yenagoa.\nThe absence of EFCC’s star witness on Oct 20 had stalled the N200-million money laundering suit against Mr Embelakpo Apere, and his wife, Beauty, in separate cases before the court.\nAt the resumed trial, the prosecution witness, Mr Timothy Owoeye, an official of the EFCC, in his evidence, said that the Commission collaborated with several banks and regulatory agencies during its investigation.\nHe told the court that the Commission acted on a Suspicious Transactions Report (STR) from the Nigerian Financial Intelligence Unit (NFIU) to investigate the defendant.\nThe trial judge, Justice Isa Ndahen, adjourned the case until Nov. 4 for ruling on the admissibility of the documents tendered in evidence by the EFCC."
  },
  {
    "headline": "GOV. DIRI REWARDS NINE-YEAR-OLD AFRICAN CHESS CHAMPION, DEBORAH QUICKEN, WITH SCHOLARSHIP, N4M – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest*APPOINTS HER YOUTH AMBASSADORBayelsa State Governor, Senator Douye Diri, has honoured nine-year-old Deborah Quickpen following her heroic performance at the recent Africa Youth Chess Championship in Accra, Ghana.\nSpeaking during the reception, Governor Diri said: “On behalf of the government and the good people of Bayelsa State, I welcome you home and say a very big congratulations.\n“I therefore appoint you an Ambassador of Bayelsa State youths.\nYou have to attend a school whether in Nigeria or overseas where you can combine both academics and sports, particularly chess.\nShe is the youngest Nigerian and African to win the prestigious chess championship."
  },
  {
    "headline": "NBBF ELECTIONS: Basketball Stakeholders want Sports Ministry to set date …says Edo ready to host congress – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestMember of Edo state Basketball Association and member Protocol and Ceremonial of the Nigeria Basketball Federation Victor Umoru has appealed to the minister of sports Sunday Dare to allow the process of elective congress of the Nigeria Basketball Federation (NBBF) run by announcing a new date for the election.\nThe NBBF elections were scheduled to hold in Benin City, the Edo state capital, on October 30th,2021 but the election was postponed indefinitely by the federal ministry of sports.\nHe reassured the Federation and the minister of the readiness of Edo state to host them.\n” This the first time Edo is given the opportunity to host NBBF election and it is historic for us.\nEng Musa Kida is seeking re-election as Nigeria Basketball Federation and there is no known opponents challenging him."
  },
  {
    "headline": "Ikoyi Building Collapse: Death toll rises to 36",
    "summarized_story": "The death toll in the 21-storey building that collapsed on Monday on Gerrard Road in the Ikoyi area of Lagos State has risen to 36.\nThe National Emergency Management Agency (NEMA) Coordinator, South-west, Ibrahim Farinloye, gave the update on Thursday.\nThe building crumbled around 2 p.m. when workers were on the site.\nMr Farinloye said the bodies include 33 males and three females.\nHe said nine people which included one female and eight males have been rescued."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "MTN to sell 575m shares in Nigeria unit through public offer",
    "summarized_story": "OBINNA EZUGWUTelecom giant, MTN, says it plans to proceed with a public offer to sell up to 575 million shares in its Nigeria business.\nThe company noted that the separation of fintech and fibre assets was on track.\nMTN, which along with Vodacom Group Ltd (VODJ.J) controls over 70% of the South African mobile market in terms of subscribers, said the offer to sell shares in MTN Nigeria will open this month with a bookbuild to institutional investors, after which a fixed price will be announced for retail investors.\nMTN’s core profit jumped 24.1% in the three months to September on robust demand for data and digital financial services.\nIt added 0.2 million subscribers during the quarter, taking the total to 271.9 million, Reuters reported."
  },
  {
    "headline": "Death toll in Lagos building collapse hits 36, top politician fingered",
    "summarized_story": "The number of people that have died at 21-storey building which collapsed at Gerrard Road, Ikoyi, Lagos has risen to 39, with 9 victims so far rescued as of Thursday morning.\nNEMA Acting Coordinator, Lagos State Territorial District, Mr. Ibrahim Farinloye, said the survivors include: 1 female and 8 males, while noting that the bodies of three females and 33 males have been recovered so far.\nOut of the the survivors, 1 female and 8 males.\nMeanwhile, a top Abuja politician with base in Lagos, has been fingered as being culpable in the collapse.\nHowever, the Lagos State Planning Authority was prevented from sealing the building when the Abuja politician who had influence over Lagos State governor, Babajide Sanwo-Olu, intervened and construction continued."
  },
  {
    "headline": "UN launches facility to save African nations $11bn in interest costs",
    "summarized_story": "The United Nations (UN) Economic Commission for Africa (UNECA), has launched a Liquidity and Sustainability Facility (LSF) to enable African governments access to liquidity structure on par with international standards and also save African governments $11 billion a year in interest costs.\nUNECA disclosed this in a statement on Wednesday at the 26th United Nations Climate Change Conference of the Parties (COP 26) in Glasgow where it discussed the continent’s Eurobond issuance needs.\n“Today Africa needs more liquidity than ever before to finance its recovery and to invest in a bold, and sustainable environment,” she added.\nDr. Benedict Oramah, President and Chairman of the Board of Directors, Afreximbank, said: “We are very pleased to be part of the first transaction of the Liquidity and Sustainability Facility.\nIts goal is to also incentivise sustainability-linked investments such as green bonds and Sustainable Development Goals (SDGs) bonds."
  },
  {
    "headline": "Anambra election: Uko endorses Soludo, says Anambra deserves right leadership",
    "summarized_story": "OBINNA EZUGWUAhead of Saturday’s Anambra State governorship election, founder of Igbo Youth Movement (IYM) and Secretary, Eastern Consultative Assembly (ECA), Evang.\nHe emphasized that Anambra is the leading light, not just in the Southeast, but the entire country, and cannot therefore afford an underwhelming leadership at this time.\nHe emphasized that Soludo, of the candidates, should be allowed and enabled to come in and correct the poor leadership currently tainting Anambra state.\nHe should be allowed and enabled to come in and correct the poor leadership currently tainting Anambra state.\nIf Anambra gets it right, Alaigbo will get it right."
  },
  {
    "headline": "Gunmen Kidnap 4 Women In Niger",
    "summarized_story": "The Police Command in Niger State on Thursday confirmed the abduction of four women by gunmen at Haske Dabara community, Agwan Gwari Kwamba of Suleja Local Government Area of the state.\nThe Commissioner of Police in the state, Mr. Monday Kuryas, confirmed the incident in an interview with the News Agency of Nigeria (NAN) in Minna.\n“We will do everything humanly possible to apprehend all those miscreants undermining the peaceful coexistence among residents.\n“I am appealing to residents, especially rural dwellers, to come forward with credible information on movement of strange faces among them to the nearest security personnel for necessary security action”, he said.\nAn eyewitness said the gunmen entered the community at about 12.46 a.m. with gunshots that scared the residents."
  },
  {
    "headline": "Gunmen Kidnap 4 Women In Niger",
    "summarized_story": "The Police Command in Niger State on Thursday confirmed the abduction of four women by gunmen at Haske Dabara community, Agwan Gwari Kwamba of Suleja Local Government Area of the state.\nThe Commissioner of Police in the state, Mr. Monday Kuryas, confirmed the incident in an interview with the News Agency of Nigeria (NAN) in Minna.\n“We will do everything humanly possible to apprehend all those miscreants undermining the peaceful coexistence among residents.\n“I am appealing to residents, especially rural dwellers, to come forward with credible information on movement of strange faces among them to the nearest security personnel for necessary security action”, he said.\nAn eyewitness said the gunmen entered the community at about 12.46 a.m. with gunshots that scared the residents."
  },
  {
    "headline": "Pandemonium As Truck Crushes Man To Death In Kwara",
    "summarized_story": "Pandemonium broke out in Ilorin, the Kwara State capital on Thursday as a hit-and-run truck driver crushed a middle-aged man to death.\nThe incident happened at the popular Post Office area in Ilorin metropolis.\nLEADERSHIP gathered that the driver of the truck that knocked down the young man identified as Usman Salakani escaped from the scene of the incident.\nThe incident worsened the usual traffic gridlock in the post office area and adjoining roads.\nThe unfortunate incident occured at Post Office area of llorin, the Kwara State capital."
  },
  {
    "headline": "Pandemonium As Truck Crushes Man To Death In Kwara",
    "summarized_story": "Pandemonium broke out in Ilorin, the Kwara State capital on Thursday as a hit-and-run truck driver crushed a middle-aged man to death.\nThe incident happened at the popular Post Office area in Ilorin metropolis.\nLEADERSHIP gathered that the driver of the truck that knocked down the young man identified as Usman Salakani escaped from the scene of the incident.\nThe incident worsened the usual traffic gridlock in the post office area and adjoining roads.\nThe unfortunate incident occured at Post Office area of llorin, the Kwara State capital."
  },
  {
    "headline": "Kwara Govt Introduces KwaraLEARN To Improve Basic Education",
    "summarized_story": "Kwara State governor, AbdulRahman AbdulRazaq, has signed a memorandum of understanding (MoU) introducing KwaraLEARN – a public education transformation programme designed to improve learning outcomes for primary school pupils across the state.\n“This is because we believe that the path to prosperity is through the education of the Kwara child.\nKwara Learn will deploy 21st century technology to support teachers and schools.\nADVERTISEMENTDirector of Policy and Partnership, New Globe, Dr Wuraola Kumbi, commended the vision of Governor AbdulRazaq for the education sector in the state.\n“I sincerely like to commend and celebrate His Excellency for his vision in the education sector."
  },
  {
    "headline": "Ikoyi building collapse: Death toll reaches 38",
    "summarized_story": "The death toll in the 21-storey building that collapsed on Monday on Gerrard Road, in the Ikoyi area of Lagos State, has increased to 38.\nThe building crumbled around 2pm when workers were on the site.\nThe PUNCH had reported that many people were trapped in the rubble, including the Managing Director, Fourscore Heights Limited, Mr Femi Osibona, who owned the building.\nThe South-West Coordinator of the National Emergency Management Agency, Ibrahim Farinloye, on Thursday confirmed that 33 males and three females have been brought out dead from the rubble.\nFarinloye added that nine people which included one female and eight males were rescued alive."
  },
  {
    "headline": "Ikoyi building collapse: Death toll reaches 38",
    "summarized_story": "The death toll in the 21-storey building that collapsed on Monday on Gerrard Road, in the Ikoyi area of Lagos State, has increased to 38.\nThe building crumbled around 2pm when workers were on the site.\nThe PUNCH had reported that many people were trapped in the rubble, including the Managing Director, Fourscore Heights Limited, Mr Femi Osibona, who owned the building.\nThe South-West Coordinator of the National Emergency Management Agency, Ibrahim Farinloye, on Thursday confirmed that 33 males and three females have been brought out dead from the rubble.\nFarinloye added that nine people which included one female and eight males were rescued alive."
  },
  {
    "headline": "Weeping as suspected herdsmen kill seven in Adamawa community",
    "summarized_story": "The police command in Adamawa has confirmed that suspected herdsmen killed seven villagers while sleeping in a midnight attack on Negga village in the Numan local government area.\nDSP Sulaiman Nguroje, police spokesman in Adamawa confirmed the killing.\nThe police spokesman added that the assailants launched the attack on the community at about 2:00 a.m. on Wednesday.\n“Police received signal at about 5:00 a.m. on Wednesday, November 3, that there was an attack on Negga community in Numan Local Government Area, a village on the Adamawa-Taraba border.\nAccording to the First Information Report, the suspected criminals attacked the village while the farming community was asleep,” explained the police officer."
  },
  {
    "headline": "Weeping as suspected herdsmen kill seven in Adamawa community",
    "summarized_story": "The police command in Adamawa has confirmed that suspected herdsmen killed seven villagers while sleeping in a midnight attack on Negga village in the Numan local government area.\nDSP Sulaiman Nguroje, police spokesman in Adamawa confirmed the killing.\nThe police spokesman added that the assailants launched the attack on the community at about 2:00 a.m. on Wednesday.\n“Police received signal at about 5:00 a.m. on Wednesday, November 3, that there was an attack on Negga community in Numan Local Government Area, a village on the Adamawa-Taraba border.\nAccording to the First Information Report, the suspected criminals attacked the village while the farming community was asleep,” explained the police officer."
  },
  {
    "headline": "[BREAKING] Ikoyi Building Collapse: Death Toll Rises To 38",
    "summarized_story": "The death toll in the 21-storey building that collapsed on Monday on Gerrard Road, in the Ikoyi area of Lagos State, has increased to 38.\nThe building crumbled around 2pm when workers were on the site.\nNews Direct had reported that many people were trapped in the rubble, including the Managing Director, Fourscore Heights Limited, Mr Femi Osibona, who owned the building.\nThe South-West Coordinator of the National Emergency Management Agency, Ibrahim Farinloye, on Thursday confirmed the number while adding that nine people which included one female and eight males were rescued alive."
  },
  {
    "headline": "Vice President Osinbajo Linked To Lagos Collapsed Building With Current Death Toll Of 36 Persons",
    "summarized_story": "The collapsed unfinished 21-story building in Lagos State has been linked to Vice President Yemi Osinbajo.\nNine people were rescued alive from the rubble of the collapsed building by rescue and emergency workers.\n“The Vice President has a lot of properties in the area, he is using his brother to manage the properties.\nA staff member of the Lagos State Building Control Agency (LASBCA) told SaharaReporters that there ‘was an order from above’ not to visit the building during monitoring.\n(d) The developer must complete Form C at all stages of construction and submit the same to Lagos State Building Control Agency (LASBCA)."
  },
  {
    "headline": "JUST IN: Governor Sanwo-Olu Visits Survivor of Ikoyi Collapsed Building (Photos)",
    "summarized_story": "Lagos State Governor Babajide Sanwo Olu Has Visited the survivors after the death toll from the 21-storey building that collapsed in Ikoyi, Lagos, on Monday has rised from 22 to 36.\nNEWS DIRECT earlier reported that 36 are confirmed dead while 9 is still alive, It was gathered that, 1 female and 8 males survived the incident while 3 females and 33 males are confirmed dead.\nBelow are pictures of Gov Sanwo Olu visit to theSurvivors"
  },
  {
    "headline": "President Buhari Grooming Younger Politicians tlTo Be President In 2023: Yahaya Bello",
    "summarized_story": "According to Governor Yahaya Bello, President Muhammadu Buhari is training young politicians to succeed him as Nigeria’s next leader in 2023.\nAccording to him, Mr Buhari has been making sacrifices to secure and unite Nigeria since his military days, claiming that he is the only Nigerian president without foreign bank accounts, including overseas houses.\n“It will take an ingrate not to appreciate what President Muhammadu Buhari has been doing and is still doing for this country,” stated Mr Bello.\nA recent publication by The Economist had highlighted Mr Buhari’s incompetence as president of the most populous black nation.\nIt also stated that Mr Buhari has failed in his promise of curbing corruption and breeds resentment."
  },
  {
    "headline": "Breaking: Kidnappers demand N50 million ransom per abducted UNIAbuja victim",
    "summarized_story": "Two days after, the abductors of the six persons that were kidnapped from the University of Abuja (UNIABUJA) staff quarters on Tuesday morning have contacted their families to demand ransom, Blueprint has learnt.\nThey have reportedly demanded N50 million on each of the abductees, totaling N300 million for all the six abducted persons.\nA lecturer, two of his children, and three other persons were abducted when gunmen attacked the staff quarters of the university.\nDetails loading…"
  },
  {
    "headline": "NEF to FG: Declare bandits terrorists, tackle IPOB for hitch-free Anambra poll",
    "summarized_story": "It further notes that Nigerians will benefit from additional options, both to improve competition and to broaden the leadership selection process.\nThe continued existence of State electoral commissions which conduct elections into Local Government Councils is severely damaging the democratic process.\n“The Forum notes that opportunities exist for Nigerians to register to vote in the 2023 elections.\n“We will be paying close attention to actions of individuals who interfere with the democratic process or instigate violence against civilian populations before, during, or after the elections.\n“We will not hesitate to consider consequences, including visa restrictions for those found to be responsible for election-related violence or undermining the democratic process."
  },
  {
    "headline": "INEC test-runs BVAS voting device in Anambra, customises election materials by LGAs, PUs",
    "summarized_story": "“The commission is also aware of the concern expressed about the availability of PVCs for new registrants in Anambra State.\n“Another issue that I need to address is the distribution of voters by polling units in Anambra state.\n“An additional 1,112 polling units were established in Anambra state in addition to the existing 4,608 locations.\n“We appealed to them to quickly inform their branches in Anambra state as well as their candidates for the election.\n“Let us by our words and action support the peaceful and credible conclusion of the 2021 Anambra state governorship election,” the commission’s chairman pleaded."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Amotekun: Arrest, parade of Northerners dangerous to Nigeria’s unity –Group -NigPilot",
    "summarized_story": "A socio-political group, the Northern Conscience for 2023, NCfor2023, has described the arrest and parade of some youths believed to have been Northerners by the South West Security Network code-named Amotekun , as dangerous for the unity of Nigeria.\nThe security outfit had arrested 18 youths accused of hiding under bags of beans in a trailer, who were all paraded yesterday.\n“It is even more disturbing when one considers that he claims to be a Senior Advocate of Nigeria (SAN) who should have sound knowledge of the law and the constitution; and the fact that Ametokun is not recognized by the Constitution as a law enforcement agency with powers to parade suspects,” he added.\nThe group’s leader, who maintained that the North remains committed to the unity of Nigeria and the invisibility of the country, warned of grave consequences if the region retaliates the treatment meted it in recent times, by other parts of the country.\nThe country cannot afford to endure the carnage and lawlessness spreading within its borders like wildfire,” Gololo further cautioned."
  },
  {
    "headline": "Impeachment saga: Civil society condemns attack on Gov Lalong -NigPilot",
    "summarized_story": "*Preaches peace to embattled SpeakerThe coalition of Civil Society for Good Governance, CCSGG, has condemned in strong terms tirades and attacks against the Plateau State governor, Barrister Simon Bako Lalong by the impeached Speaker of the State House of Assembly, Rt.\n“Gentlemen of the press, we are aware that Plateau State House of Assembly was the first out of 36 States of the Federation to enjoy legislative and judicial autonomy, even when Hon.\n“The lawmakers decided to impeach their leader based on reasons best known to them and elected Hon.\nYakubu Sanda as new Speaker, which we consider as democracy in action, hence, peace should be allowed to reign at all cost,” the convener stressed.\nIt, however, commended Governor Lalong for his maturity and leadership that has ensured peace and tranquility as well as socio-economic and infrastructural development of the state, while calling on the citizens, particularly the youths not to allow themselves to be used."
  },
  {
    "headline": "East-West Road has gulped N359bn- Akpabio -NigPilot",
    "summarized_story": "Minister of Niger Delta Affairs, Sen. Godswill Akpabio has disclosed that over N359billion has so far been expended on the 657km dual carriage East-West Road stretching from Calabar in Cross River State, to Effurun in Delta State since it was initiated in 2006.\nAkpabio said bearing in mind the objectives of President Muhammadu Buhari on the completion of ongoing projects, the Niger Delta Ministry was considering raising funds from other sources to ensure the completion of section I-IV of the road before the end 2023.\nThe minister made this statement during the Ministry’s 2021 Budget Performance Review and 2022 Proposed Budget Consideration to the House of Representative Committee on Niger Delta Affairs on Tuesday in Abuja.\nSpeaking earlier, during the budget presentation the Chairman House of Representative Committee on Ministry of Niger Delta Affairs Hon.\nEssien Ekpeyong, assured that the Legislature is committed to the security of lives and investment in the Niger Delta region and for economic and social activities to strive."
  },
  {
    "headline": "I don’t need god-father to be APC national Chairman – Moniedafe",
    "summarized_story": "One of the prominent contenders for the national chairmanship position of the ruling All Progressives Congress, APC, Chief Sunny Sylvester Moniedafe, on Monday canvassed for the abolition of the concept of godfatherism in Nigerian politics saying it can not last any longer.\nHe said, “This thing is all about I need god-father, and this is what I want us to completely forget about.\nSunny Moniedafe, who threw his hat into the ring for the party’s national chairmanship office in March, 2021 belonged to the ACN bloc and was the Abuja chairman of the party.\nHe was Secretary of ACN in the FCT before the formation of the mega APC.\nHowever, unlike some of the aspirants in the APC national chairmanship race who are publicly backed by one or more prominent figures in the party, Mr Moniedafe at the moment has only his campaign promises."
  },
  {
    "headline": "Anambra Governorship Candidates Sign Peace Accord",
    "summarized_story": "Candidates in the imminent Anambra governorship election on Thursday signed a peace accord in Awka, the state captial.\nChairman of the Independent National Electoral Commission (INEC), Professor Mahmood Yakubu, was present at the ceremony, which was facilitated by the National Peace Committee.\nAnambra, as in much of the South-East, has witnessed several ‘gunmen’ attacks, casting doubts on the safety of the elections.\nThe proscribed Independent People of Biafra (IPOB) has also threatened the sanctity of the election if its leader, Nnamdi Kanu, is not released from detention.\nOn Tuesday, Senate minority leader, Enyinnaya Abaribe urged voters to show up at the polls, noting that the elections will be safe."
  },
  {
    "headline": "National Security: Budget Reduction Will Impede Nigerian Army’s Capacity, Says COAS",
    "summarized_story": "The Chief of Army Staff, Lt. General Faruk Yahaya, has said the reduction in the army budget will prevent the army from tackling the nation’s security challenges.\nHe stated this on Wednesday while defending the Army’s 2022 budget before the Senate Committee on Army.\nLieutenant-General Yahaya urged the Senate panel to approve the sum of N642.7bn as the Nigerian Army personnel emolument for the 2022 budget.\n“In preparing for the year 2022 budget, the Nigerian Army proposed the sum of N710bn.\n“This reduction would impede the capacity and tempo of the Nigerian Army in carrying out its constitutional duties particularly the ongoing war against Boko Haram terrorists and other criminalities across the country."
  },
  {
    "headline": "Ikoyi Building Collapse: Death Toll Rises To 38",
    "summarized_story": "The death toll from the collapsed high-rise building on Gerrard road in Ikoyi, Lagos has increased 38.\nTen minutes later, two more bodies were recovered from the rubbles, increasing the death toll to 38.\nREAD ALSO: Ikoyi Building Collapse: Mistakes Were Made From All Angles – Sanwo-OluThe survivors include one female and eight male.\nThe operation to rescue those trapped in the rubble of the 21-storey building which collapsed on Monday afternoon, trapping dozens of people is still ongoing.\nLagos State Governor Babajide Sanwo-Olu put the death toll at 21 when he visited the scene on Wednesday afternoon."
  },
  {
    "headline": "Scores Of Bandits Neutralised, Camps Destroyed By Air Strikes In Kaduna",
    "summarized_story": "Troops of the Nigerian Air Force have neutralised several bandits during an airstrike in some locations in Chikun Local Government Area of Kaduna State.\nAruwan said that assessment revealed that many bandits were neutralised during the entire mission, while several camps were equally destroyed.\nMeanwhile, Governor Nasir El-Rufai has welcomed the operational feedback with satisfaction and commended the security forces heartily for what he described as well-executed missions.\nThe Governor expressed optimism that more of such would follow, while urging the security forces to sustain the tempo towards the obliteration of criminals across Kaduna State.\nThe Government also appealed to citizens who might come across suspicious persons seeking medical attention in the general area to report to the Kaduna State Security Operations Room."
  },
  {
    "headline": "Rebel March On Ethiopia Capital To Worsen Humanitarian Crisis, Says US",
    "summarized_story": "The TPLF announced late Wednesday it had reached the town of Kemissie in Ethiopia’s Amhara region, some 325 kilometres (200 miles) northeast of the capital.\nBut a senior official from Washington’s humanitarian arm USAID warned of grave repercussions for Ethiopia’s already acute aid problems.\n‘Egregious humanitarian obstruction’Ethiopia’s war has killed thousands and driven hundreds of thousands of people into famine-like conditions, according to UN estimates.\nThe region has been under a de facto humanitarian blockade since July, according to the UN, exacerbating fears of widespread famine.\n“We continue to see perhaps the most egregious humanitarian obstruction in the world affecting Tigray,” the official said."
  },
  {
    "headline": "Tambuwal Swears-In 3 New Commissioners, Assigns Portfolio -",
    "summarized_story": "Sokoto state governor Aminu Tambuwal has sworn-in three new Commissioners and assigned them portfolios shortly after.\nThis is contained in a statement signed by the Special Adviser on Media and Publicity to the Governor, Mohammed Bello and made available to newsmen in Sokoto.\nHe congratulated them and charged them to bring to bare their experiences, knowledge and expertise in the conduct of their respective assignments.\nHe said their appointment was based on merit and hoped that they will add value by contributing their quota to the development of the state.\nThe other two new Commissioners replaced two deceased Commissioners Jeli Abubakar III and Muhammadu Arzika Tureta, former Commissioners of Home Affairs and Agriculture respectively."
  },
  {
    "headline": "Several Bandits killed, Camps destroyed by Airstrikes in Kaduna -",
    "summarized_story": "Security operatives have reportedly killed an unspecified number of bandits in a recent aerial assault on identified bandit camps in Chikun local government area, that’s in Kaduna State.\nThe State Commissioner for Internal Security and Home Affairs, Samuel Aruwan made this known in a security report on Wednesday.\nAccording to the report, bandits camps in Kauwuri and Gaude villages in Chikun local council were identified after thorough checks and analysis by intelligence agencies.\nHe explained that fighter jets attacked the identified camps and armed bandits were seen fleeing.\nAccording to the Commissioner, assessment revealed that many bandits were neutralized during the mission, and several camps were destroyed."
  },
  {
    "headline": "Ondo PDP, Akeredolu trade words over withdrawal of military checkpoints -",
    "summarized_story": "Soldiers have withdrawn from various checkpoints mounted on major border areas and hot spots across Ondo state.\nThe Peoples Democratic Party (PDP) in the state, has raised alarm over the development.\nIt attributed the withdrawal to the alleged refusal of the state governor, Mr Rotimi Akeredolu, to pay allowances due to the security personnel.\nThe party appealed to Governor Akeredolu, to immediately pay the outstanding allowances due to the security personnel without further delay.\nMr. Ojogo said the PDP attacks on the state government is designed to discredit the state security outfit, Amotekun, and lambasted the opposition for playing up the issue of non-payment of allowance to the military."
  },
  {
    "headline": "Governor Uzodimma mourns Captain Din, condoles family -",
    "summarized_story": "Imo State Governor Hope Uzodimma has commiserated with the Director of News TVC, Mrs. Stella Din on the death of her father, Captain Joseph Din (rtd).\nIn a statement by his Chief Press secretary, Oguwuike Nwachuku, Governor Uzodinma described late Capt.\nThe governor said Nigeria, Plateau State where late Capt.\nDin hails from, the Nigerian Army and indeed, the All Progressives Congress (APC) family where he played leadership role as Chairman of APC Elder’s Advisory Council in Plateau State will miss him sorely.\nGovernor Uzodimma said his thought, that of the government and good people of Imo State are with the Din’s family at this critical time, particularly the widow and urged them to lean on God for courage to bear the huge loss."
  },
  {
    "headline": "Nigeria’s External Reserves Hit $41.83bn in October But Sustainability Concerns Remain",
    "summarized_story": "As of October 29, 2021, Nigeria’s external reserves have risen to $41.\nHe admitted that the surge in external reserves was due to the recent Eurobonds issuance the country made.\nMohamed Abu Basha, head of macroeconomy – EFG Hermes, had predicted that Nigeria’s foreign reserves would cross the USD40bn mark after reserves were boosted in August with the USD3.3bn SDR allocation, providing a significant liquidity lift to the country’s foreign reserve position.\nOil prices remain high, supported by tight supply even as demand has rebounded stronger than anticipated.\nAccording to OPEC data obtained from secondary sources, Nigeria’s oil output (excluding condensates) was up 12 percent m/m to about.45mbpd in September."
  },
  {
    "headline": "EASA Certifies Caverton To Commence Training For AW139 Helicopter",
    "summarized_story": "The European Union Aviation Safety Agency (EASA) has certified Caverton Helicopters, a subsidiary of Caverton Offshore Support Group (COSG), to use the Thales Level D, reality full flight stimulator product, a Reality H system.\nWith this certification and approval, Caverton can now commence commercial training operations for AW139 helicopter operators at its Lagos-based training centre, as revealed by the company on Wednesday.\nThe Chairman of Caverton Offshore Support Group (COSG), Aderemi Makanjuola, said “With this new training centre now operational, Caverton will provide state-of-the-art training, including initial type rating, recurrent training and proficiency checks, for offshore and onshore missions as well as military and special operations”.\n“There could be no better time to experience this pioneering achievement for Caverton.\n“Thales’s role is to help helicopter operators and pilots prepare for their missions, and with Reality H® we’re proud to provide our customers with the solution that makes this possible.”Omotayo Araoye"
  },
  {
    "headline": "Collapsed Ikoyi Building: Death Toll Rises to 36 on Day 4",
    "summarized_story": "Death toll in the 21-storey building that collapsed on Gerrard Road in Ikoyi on Monday, November 1, 2021, has increased to 36.\nThis was revealed on the morning of Thursday, November 4, by the Southwest Zonal Coordinator of the National Emergency Management Agency (NEMA), Mr. Ibrahim Farinloye.\nAccording to him, “A total of 36 bodies has now been recovered from the collapse, comprising of 33 males and three females.”He also revealed that the number of survivors remains at nine, consisting of one female and eight males.\nSunday Ehigiator"
  },
  {
    "headline": "Biden Rejects Blame for Shock Virginia Election Defeat",
    "summarized_story": "Joe Biden has rejected suggestions that his Democratic party’s shock loss in the Virginia governor’s race was a verdict on his presidency.\nMr Biden argued that the miring of his legislative agenda in a Capitol Hill logjam did not sway the outcome.\nUS media have projected Mr Murphy will win that race, though his opponent has not yet conceded.\nAt the White House on Wednesday, Mr Biden was asked whether he accepted any blame for Tuesday’s political earthquake in Virginia.\nMr Biden conceded Democrats should have passed his signature $1.75tn (£1.3tn) package of social and climate programmes and a $1tn infrastructure bill before Tuesday’s vote."
  },
  {
    "headline": "Xavi Hopes Barcelona Can Agree Deal with Al Sadd So He Can ‘Go Back Home’",
    "summarized_story": "Xavi says he wants to “go back home” to be Barcelona manager and hopes an agreement can be reached with Al Sadd.\nBarca officials are in Doha for talks and 41-year-old Xavi is the favourite to replace the sacked Ronald Koeman.\nSpain legend Xavi played 779 games and won 25 major honours for Barca between 1998 and 2015 before spending the last four years of his career with Al Sadd.\nGoing back to Barcelona would be spectacular and exciting.”Earlier, Al Sadd chief executive Turki Al-Ali said: “The club’s position is clear from the beginning – we are committed to keeping Xavi with us.\n“We have great references about Xavi at Al Sadd."
  }
]