[
  {
    "headline": "NIN: NIMC registers over 60 million Nigerians",
    "summarized_story": "The National Identity Management Commission has announced that it now has over 60 million unique NIN records in the National Identity Database.\nThis announcement was contained in a press statement made available to our correspondent on Thursday by NIMC’s Head, Corporate Communications, Kayode Adegoke.\nThe statement titled ‘NIMC reaches more than 60 million unique NIN records’ said the NIN was the primary identification for all citizens and legal residents.\nIt read, “The National Identity Management Commission is delighted to announce more than 60 million as the total number of unique NIN records in the National Identity Database.\n“This feat couldn’t have been possible without the cooperation of all stakeholders including the general public."
  },
  {
    "headline": "Hushpuppi, associates used crime proceeds to acquire foreign citizenships —US",
    "summarized_story": "The United States Attorney’s Office in the Central District of California has said that Ramon Abbas, aka Hushpuppi, and his co-conspirator used crime proceeds to acquire a St. Christopher and Nevis citizenship.\nKyari, however, explained in a Facebook post that Hushpuppi called his office and reported a death threat from someone about two years ago.\nActing United States Attorney, Tracy Wilkison, said, “Mr.\nThe document was signed by Hushpuppi; his lawyer, Loius Shapiro; and Acting United States Attorney, Tracy Wilkison, among others.\nHushpuppi is known to have flaunted his luxury lifestyle in private jets with exotic wines and expensive wristwatches."
  },
  {
    "headline": "Arrest Abba Kyari now — Reactions trail Hushpuppi’s ‘bribery’ allegation",
    "summarized_story": "By Arogbonlo IsraelNigeria’s infamous suspected fraudster, Ramon Olorunwa Abbas, alias Hushpuppi, who recently pleaded guilty in the United States, has narrated how he bribed Nigeria’s celebrated Deputy Commissioner of Police, Abba Kyari.\nAn allegation the latter described as ‘untrue’ and ‘an attempt to tarnish his image’.\nReacting, some social media users on Thursday, took to their handles to share their views on the allegation.\nBelow are some of the reactions gathered by Vanguard:@De_Royal: “Is time we test EFCC efficiency in Nigeria.\nMany Nigerians in prison without trying don’t have files attached to their names, they are there because one wicked human is more powerful than they are."
  },
  {
    "headline": "A’Ibom PDP inaugurates PMM to consolidate peace, development of state",
    "summarized_story": "In her bid to consolidate on the prevailing peace, growth and Industrial development currently prevailing in Akwa Ibom State, the Peoples Democratic Party, PDP, on Wednesday officially inaugurated the “Peace Maintenance Movement”, a grassroot mobilisation movement geared towards preparing the State for a future that will guarantee Peace, Prosperity and Sustenance.\nThe group is also aimed at consolidating on the gains made by the current administration in the State.\nThe PMM DG tasked the leadership of the movement in the federal Constituency to set up structures at the ward level.\nGlory Edet was inaugurated as the Local Government Coordinator while the Chief Whip of the Akwa Ibom State House of Assembly and Member representing Ini State Constituency, Rt.\nEmmanuel Ekpenyong thanked Governor Udom Emmanuel and PMM DG, Barr."
  },
  {
    "headline": "Breaking: We’ll deploy 5G Technology soon – Danbatta",
    "summarized_story": "By Emmanuel ElebekeIn fulfillment of its commitment to put Nigeria on the frontline as a technology driven economy, the Executive Vice Chairman of Nigerian Communications Commission, Prof Umar Danbatta says all is now set for roll out of 5G services across the country.\nHe said the Commission had crossed all the Ts and dot the Is and waiting for green light from the Federal government to roll out the services soon.\nThe EVC made the revelation during the public inquiry on draft frequency spectrum (fees and pricing, and annual operating levy regulations held on Thursday, in Abuja.\nThe move he said followed series of pre-trial roll exercise earlier carried out by MTN and Airtel networks, which justified the Commission’s decision to commence the roll out plan across the nation.\nDetails later:Vanguard News Nigeria"
  },
  {
    "headline": "Access to Justice tackles Aregbesola over remarks on govs signing death warrants",
    "summarized_story": "Ogbeni Rauf AregbesolaBy Onozure DaniaA civil society organization, Access to Justice, AJ, has faulted Minister of Interior, Ogbeni Rauf Aregbesola, for encouraging state governors to sign death warrants for the execution of inmates on death row as a way of resolving the problem of congestion in prison formations across the country.\n“Also speaking on the challenge of congestion in correctional centres, the Minister revealed that its actual capacity of 57,278 has been exceeded by 18 percent.\nThe Minister believes that if governors ‘take the bold step’ to sign execution orders for inmates on death row, it would help to resolve the problem of congestion.\n“Besides, we fear that if the Minister’s call is heeded, many death row convicts who have pending appeals against their convictions will be at risk at execution even before their appeals are determined following administrative errors.\n“Many factors account for the high level of prison congestion, but part of them include political persecution and the misuse of criminal justice institutions."
  },
  {
    "headline": "It’s a lie, Abba Kyari reacts to Hushpuppi’s ‘bribery’ allegation",
    "summarized_story": "Says his hands are cleanBy Arogbonlo IsraelDeputy Commissioner of Police, DCP, Abba Kyari has reacted to allegations by embattled Nigerian socialite, denied receiving money from the latter.\nVanguard earlier reported that US court documents reveal that Abbas reportedly paid off Kyari to arrest a colleague of his whom he had a dispute with.\nHowever, Kyari admitted to knowing about the money-related dispute, claiming it was on the basis of the call that Hushppupi’s colleague was arrested.\nThe Native Clothes and Caps (5 sets) were brought to our office and He sent somebody to Collect them in our office.\nWe are used to such types of people and false newsmakers and distributors.”Vanguard News Nigeria"
  },
  {
    "headline": "SMEs, potent drivers for sustainable economic development – Oyetola",
    "summarized_story": "Governor Adegboyega Oyetola of Osun State has described Micro, Small and Medium Enterprises (MSMEs) as potent drivers for a sustainable economic development.\nHe said their values in the repositioning of the Osun State economy has made the government put necessary focus through concerted efforts of giving financial support to them.\nOyetola disclosed this during the sensitisation programme for the beneficiaries of the Micro, Small, and Medium Enterprises Development Fund (MSMEDF) in Osogbo, the state capital, today.\nOlopade added that the loan is capable of improving medium and small scale businesses and the state economy at large.\nWhile commending the governor for the opportunities given to the beneficiaries, he explained that the loan being distributed would not put an untold burden on enterprises."
  },
  {
    "headline": "US court document exposes link between DCP Abba Kyari, Hushpuppi",
    "summarized_story": "Abba Alhaji Kyari, a Deputy Commissioner of Police, has been accused of collecting a bribe from embattled social media celebrity, Ramon Abbas, popularly known as Hushpuppi.\nAngered by his move, Hushpuppi had ordered Kyari to arrest him in Nigeria and lock him up.\nKyari, after arresting and locking up Vincent, reportedly sent photos as confirmation to Hushpuppi, who sent the police officer some money via a provided bank account number.\nRecall that Hushpppi pleaded guilty to charges filed against him by the United States Government for money laundering.\nHis guilty plea bargain was filed at a U.S. Central District Court of California and signed by him and his lawyer, Louis Shapiro, and the Assistant United States Attorney, Anil Antony, on July 4."
  },
  {
    "headline": "BREAKING: Abba Kyari opens up on alleged bribe to arrest Hushpuppi’s ally",
    "summarized_story": "Deputy Commissioner of Police Abba Kyari has denied receiving a bribe from a Nigerian Instagram celebrity, Ramon Abbas, popularly known as Hushpuppi.\nThe United States Department of Justice had said ongoing investigations showed that Hushpuppi allegedly bribed Kyari to arrest one Kelly Chibuzo Vincent, one of his accomplices in Nigeria.\nReacting to the allegations on Thursday morning, the DCP in a statement on his verified Facebook page said his hands are clean.\nKyari explained that Hushpuppi had informed the police that somebody in Nigeria was threatening to kill his family.\nKyari said the clothes and caps were delivered to his office after which someone collected them for Hushpuppi."
  },
  {
    "headline": "Foreign medical trips portray Buhari as colossal failure – HURIWA dismisses Femi Adesina’s explanation",
    "summarized_story": "The Human Rights Writers Association of Nigeria, HURIWA, has described as totally indefensible, reprehensible, despicable and a shame, President Muhammadu Buhari’s medical trip to the United Kingdom.\nAccording to the human rights group, Buhari, who is in the second year of his final tenure, should not be seen globetrotting in search of medical assistance for his personal medical challenges.\nHURIWA was reacting to a recent statement by Femi Adesina, spokesman to the President, where he had given reasons why his principal travels overseas for medical tourism.\nHURIWA said that Buhari had personally condemned medical tourism which he claims drains Nigeria of resources, adding that it was hypocritical for him to continue engaging in medical tourism.\nThe rights group pointed to the fact that the National Assembly has been voting billions of Naira to fund the running of the presidential clinic in Aso Rock since 2015 with nothing to show for the funds."
  },
  {
    "headline": "Abia’s Ikpeazu pays condolence visit to family of late Army chief, Ibrahim Attahiru",
    "summarized_story": "Governor Okezie Ikpeazu of Abia State on Wednesday paid a condolence visit to the family of former Chief of Army Staff, late General Ibrahim Attahiru, at Niger Barracks, Abuja.\nAttahiru: FG begins investigation of plane crash that killed Army Chief, othersGovernor Ikpeazu described Attahiru as a professional officer who carried out his duties with utmost dedication and patriotism.\nResponding, the widow of the late Army chief, Hajia Fati Attahiru, thanked the Governor for his visit and assured him that they have accepted their fate as the will of Allah.\nThe wife of the late ADC to General Attahiru who also died in the plane crash was present.\nRecall that Nigeria’s former Chief of Army Staff, Lt General Ibrahim Attahiru had in May this year, died in an air crash."
  },
  {
    "headline": "JUST IN: Veteran highlife musician Feladey dies",
    "summarized_story": "By Sam AnokamVeteran highlife musician, Felix Odey, aka Feladey is dead.\nNews of his death was announced in the early hours of Thursday, July 29.\nADVERTISEMENTThe Nation gathered the musician who popularised Rex Lawson’s ‘Sawale’ in the 90s and the subsequent single, ‘Band Boys’ had a fever before passing on.\nThe multi-talented musician and producer, who embraced Christ at the latter parts of his life, would be remembered for his outstanding contributions and works in the music industry of which is the popular and original signature song of NTA 2 Channel 5."
  },
  {
    "headline": "18,000 candidates get chance to take UTME on Aug 6th",
    "summarized_story": "By Frank Ikpefan, AbujaThe Joint Admissions and Matriculation Board has fixed Friday, 6th August, 2021 for 18, 000 candidates who missed the Unified Tertiary Matriculation Examination (UTME) to retake the examination.\nThe Board said the 18,000 candidates slated for the examination are being notified through both text messages on their designated phone numbers and their JAMB profiles.\nIt therefore directed the affected candidates to print fresh examination notification slips containing the venue and time of the examination from its website from August 1.\n“About 18,000 candidates slated for the examination are being notified through both text messages on their designated phone numbers and their JAMB profiles.\nCandidates who have been ascertained by JAMB to have experienced genuine rescheduling/technical problems as was the case in 30 of the 760 centres used for the examination."
  },
  {
    "headline": "Naija Shine Ya Eye: ‘Nurse’ Pere stresses needs for healthy eating",
    "summarized_story": "By Gbenga BadaBBNaija Shine Ya Eye housemate, Pere has stressed the need for housemates to eat healthily.\nA concerned Pere made this known during an early morning discussion with Boma while Angel and Whitemoney were making breakfast for others.\nADVERTISEMENTPere noted he was a nurse during his sojourn in the United States and understands the need to eat healthily.\nPere also complained of how some of the housemates had not been frugal in cooking and making use of food.\nHe said the Housemates have been eating without care, stating this was why the reason foodstuff has drastically reduced."
  },
  {
    "headline": "$1.1m loot: I never demanded, collected bribe from Hushpuppi, says Kyari",
    "summarized_story": "By Robert Egbe and Alao AbiodunDeputy Commissioner of Police Abba Kyari on Thursday denied allegations he ever demanded or received a bribe from celebrity internet fraudster Ramon Olorunwa Abbas, alias Hushpuppi, from a $1.1million loot.\nAbbas had asked Kyari to arrest and jail Vincent after both were locked in a dispute presumably over how to share the $1.1million loot received from the Qatari businessperson.\n“Kyari also allegedly sent Abbas bank account details for an account into which Abbas could deposit payment for Vincent’s arrest and imprisonment,” U.S. Justice department said in a statement.\n“Nobody demanded for a kobo from Abbas Hushpuppi.\n“Nobody demanded any money from Abbas Hushpuppi and nobody collected any money from him."
  },
  {
    "headline": "BBNaija Shine Ya Eye: Liquorose in a heated argument with Angel over game",
    "summarized_story": "By Gbenga BadaA game of charades descended into chaos on Wednesday night, July 28 after Liquorose and Angel got into a heated argument.\nThe housemates gathered to play a round of charades as they unwinded when things got heated between Liquorose and Angel.\nLiquorose did not take things lying down either and gave as much as she received from her fellow housemate.\nLater, Maria and Liquorose went to the bedroom where Angel was, to try and squash the beef, but the move turned chaotic again.\nWhile housemates were yet to get over Angel and Liquorose confrontation, an upset Arin expressed her feelings about Maria accusing her team of cheating."
  },
  {
    "headline": "FG issues flood alert in 28 states",
    "summarized_story": "From Charity Nwakaudu, AbujaThe Federal Government has warned Nigerians to expect heavy flooding this year, listing Lagos and Osun states as likely to experience more flood-related disasters.\nHe said current flood incidents were caused by inadequate drainage systems, as localised heavy downpour generated the flash and urban flooding, adding that river and coastal flooding are yet to set in.\nHe said Lagos and Ogun states may likely experience the three stages of floods -urban, river and coastal flooding due to their geographical location.\nIt must be pointed out virtually that all the flood incidents above were caused by poor drainage systems as localised rainfall generated the urban flooding.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Kanu: UK not doing enough to free him, says Lawyer",
    "summarized_story": "From Ogbonnaya Ndukwe, AbaCounsel to Nnamdi Kanu, Ifeanyi Ejiofor, has alleged that the British government may be complicit in the travails of the pro-Biafran leader.\n“I can confirm to you that the British High Commission is not doing much about this case.\n“As at the time he was arrested, he was arrested as a British national because he had renounced his Nigerian citizenship over five years ago.\nIGA lamented that failure to produce Kanu in court by the DSS, on Monday, sent a wrong signal on the kind of justice, the IPOB leader was likely to get in the course of the trial.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Ondo guber: Supreme Court affirms Akeredolu’s victory",
    "summarized_story": "From Godwin Tsa and Ndubuisi Orji, AbujaIn a split decision of four to three, the Supreme Court, yesterday, affirmed the election of Mr. Rotimi Akeredolu (SAN) as Ondo State Governor.\nThe majority decision agreed with the decision of the tribunal that failure of the appellants to include Buni was fatal to their case.\nJegede congratulated Governor Akeredolu over the judgement, saying, “Now that we have explored the grievance procedure permitted by the constitution and the law, it is time to give glory to God.\nWith this outcome, our respect and reverence for the judiciary and our justices of the supreme court has not diminished.”The PDP, however, yesterday, insisted that the nomination of Ondo State governor, Rotimi Akeredolu, as the candidate of the APC in the last governor poll in the state was illegal.\nNational Publicity Secretary of the party, Kola Ologbondiyan, said this was because the Ondo State governor’s nomination by the APC leadership, led by Yobe State governor, Mai Mala Buni, was a violation of the 1999 Constitution ( as amended)."
  },
  {
    "headline": "2023: Vote APC out, Kukah urges Nigerians",
    "summarized_story": "From Aidoghie Paulinus, AbujaCatholic Bishop of Sokoto Diocese and Founder of the Kukah Centre, Most Revd Matthew Kukah, has called on Nigerians to vote out the All Progressives Congress (APC) in the 2023 poll.\nKukah, who is currently in Washington, U.S, spoke during a conference on ‘Civic Space: The Pathway to Social Cohesion and Integration in Nigeria’ organised by the Kukah Centre.\nHe said the situation was not unconnected with the fact that the nation currently parades people who are in politics with no track records nor antecedents of engagement with public life.\nBut whatever we pass to the next generation must be a light of hope,” Kukah said.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "N87bn allegedly diverted by AGF -Senate report",
    "summarized_story": "From Fred Itua, AbujaFresh facts have emerged on how the Office of Accountant General of the Federation (OAGF) allegedly diverted N87 billion from Solid Mineral Development Funds and Stabilisation Funds to the Independent National Electoral Commission (INEC), Ministry of Power, Army, among others.\nSenate Committee on Public Accounts chaired by Matthew Urhoghide in its investigation said it discovered that many government agencies benefited from funds illegally diverted from OAGF.\nThe Senate Committee in its consideration of the report of Senate Public Accounts Committee ordered the Accountant General of the Federation to ensure refund of the monies within 60 days.\nEnsure that henceforth, payments from these special funds are strictly applied for the purpose were created.\nEnsure the stoppage of further withdrawal from these Accounts without a resolution of National Assembly,” it said."
  },
  {
    "headline": "Buni’s Position as Caretaker Chair Not Injurious to APC Congresses, Anambra Guber, Says APC Counsel",
    "summarized_story": "Akintola who addressed a press conference on Thursday morning alongside the Secretary of the party, Sen. John Akpanudoedehe, called on all prey members not to entertain any fear.\nHe said the Tribunal ruled that the holding of political position does not contravene Section 183 of the Constitution, which he said was upheld by the Appeal Court as well as the Supreme court.\nAkeredolu’s victory, which rested on a split judgment of four against three out of the seven justices on the election panel, had managed to scale through because the opposition Peoples Democratic Party (PDP) failed to join Buni in the matter.\nHis prayer was hinged on the fact that the acting National Chairman of the APC and Yobe State Governor, Mai Mala Buni, was the one, who forwarded Akeredolu’s name to the Independent National Electoral Commission (INEC) as candidate of the APC in the October 20, 2020 poll.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Nigeria’s Super Cop, Abba Kyari, Named in Hushpuppi’s $1m Fraud Case",
    "summarized_story": "Ramon Olorunwa Abbas, also known as Ray Hushpuppi“After this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria.\nAccording to the indictment, Abbas allegedly conspired with Abdulrahman Imraan Juma, a.k.a.\nThe proceeds of the fraud allegedly were laundered in several ways.\nAccording to the indictment, Abbas was assisted in laundering the proceeds of the fraud by Rukayat Motunraya Fashola, a.k.a.\nAfter this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria."
  },
  {
    "headline": "S’Court Judgment in Ondo Governorship Sets Off Another Legal Crisis in APC",
    "summarized_story": "Also, Governor Akeredolu thanked the judiciary for not yielding to any influence, even as he dedicated the election petition success to God.\nThe Ondo State Governorship Election Petition Tribunal, led by Justice Umar Abubakar-led struck out the petition for lacking jurisdiction in the matter.\nAPC Hails Akeredolu’s Supreme Court Election VictoryThe All Progressives Congress (APC) has hailed the Supreme Court decision upholding the victory of the Ondo State Governor, Rotimi Akeredolu in the last governorship election.\n“We are thankful to the people of Ondo State for their steadfastness.\n“With this outcome, our respect and reverence for the judiciary and our justices of the supreme court has not diminished."
  },
  {
    "headline": "After Over Five Years in Detention, Court Frees El-Zakzaky, Wife",
    "summarized_story": "He agreed that though the Kaduna State government has powers to enact laws, “they cannot enact law to prosecute an offence prospectively.\n“The court agreed with us that, El-Zakzaky and his wife have committed no offence.\nThe Court, however, discharged and acquitted El-Zakzaky and his wife.\nIt said there should not have been any charge against El-Zakzaky and his wife, Zeenat in the first place,” he said.\nEl-Zakzaky and his wife were arrested in December 2015, following a bloody clash between his followers and soldiers in Zaria, Kaduna State."
  },
  {
    "headline": "FDC: Ending FX Sale to BDCs Disrupts ‘Juiciest Economic Racket’",
    "summarized_story": "That is, the BDCs would be allowed to buy dollars from the CBN at the parallel market rate less a N10 premium, the research company stated.\nIt said, “For example, if the parallel market rate is N500/$, the purchase rate from the CBN will be N490/$.\nIf the BDCs sell at N550/$, the CBN increases its rate for BDCs to N540/$.\nHe said BDCs bought dollars from the CBN at N197 and sold to their customers at N250.\nEmefiele said it was no wonder that BDCs had risen “from a mere 74 in 2005 to 2,786 BDCs today."
  },
  {
    "headline": "Nigerian Fraudster, Hushpuppi Narrates How He Paid Bribes To Police Chief, Abba Kyari In $1.1million Deal",
    "summarized_story": "Vincent subsequently contacted the victim and informed them that they were being scammed by a syndicate involving him and Abbas.\nThis elicited anger from Abbas, who contacted Kyari to arrest and jail his rival over the dispute.\nAfter this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria.\nKyari also allegedly sent Abbas bank account details for an account into which Abbas could deposit payment for Vincent’s arrest and imprisonment,” U.S. Justice department said in a statement.\nAbbas pleaded guilty to multi-million fraud earlier this month and faces up to 20 years in jail."
  },
  {
    "headline": "Nigerian Fraudster, Hushpuppi Narrates How He Paid Bribes To Police Chief, Abba Kyari In $1.1million Deal",
    "summarized_story": "Vincent subsequently contacted the victim and informed them that they were being scammed by a syndicate involving him and Abbas.\nThis elicited anger from Abbas, who contacted Kyari to arrest and jail his rival over the dispute.\nAfter this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria.\nKyari also allegedly sent Abbas bank account details for an account into which Abbas could deposit payment for Vincent’s arrest and imprisonment,” U.S. Justice department said in a statement.\nAbbas pleaded guilty to multi-million fraud earlier this month and faces up to 20 years in jail."
  },
  {
    "headline": "Lagos Police Arrest More Suspects Over Murder Of Super TV CEO, Ataga",
    "summarized_story": "The Lagos State Police Command has arrested more suspects in connection to the murder of the Super TV CEO, Usifo Ataga.\nThis was confirmed by the Lagos State Police Commissioner, Hakeem Odumosu during a briefing and parade of suspects at the Command headquarters in Ikeja.\nOdumosu, who had yet to give details on the number of suspects arrested and their connection to the murder, said the case was progressing and the police would never compromise on it.\nAccording to him, a 300-level student of Mass Communication, Chidinma Ojukwu, was still a suspect with her rights guaranteed by the constitution.\nHe, however, dismissed insinuations that the police were attempting to give her a soft landing."
  },
  {
    "headline": "Lagos Police Arrest More Suspects Over Murder Of Super TV CEO, Ataga",
    "summarized_story": "The Lagos State Police Command has arrested more suspects in connection to the murder of the Super TV CEO, Usifo Ataga.\nThis was confirmed by the Lagos State Police Commissioner, Hakeem Odumosu during a briefing and parade of suspects at the Command headquarters in Ikeja.\nOdumosu, who had yet to give details on the number of suspects arrested and their connection to the murder, said the case was progressing and the police would never compromise on it.\nAccording to him, a 300-level student of Mass Communication, Chidinma Ojukwu, was still a suspect with her rights guaranteed by the constitution.\nHe, however, dismissed insinuations that the police were attempting to give her a soft landing."
  },
  {
    "headline": "American Court Sentences Nigerian To Eight Years’ Jail Over $975,000 Fraud",
    "summarized_story": "A-38-year old Nigerian, Olumide Bankole Morakinyo, has been sentenced to eight years in prison and ordered to repay $975,863 by an America court.\nThe money is equivalent to N400million repayment, in restitution to multiple victims of his conspiracy to commit money laundering, the court revealed on Wednesday.\nAminu who was sentenced on December 18, 2019, to 51 months in prison, had been charged in a separate indictment.\nWhile bank deposit information on file in the system was changed to re-route retirement payments to debit cards controlled by Aminu, document revealed.\nAminu, who possessed the physical debit cards, would withdraw money under instructions from his co-conspirator, Morakinyo and then transfer or deposit that money at Morakinyo’s direction."
  },
  {
    "headline": "We'll go ahead with our congresses, says APC on supreme court verdict",
    "summarized_story": "The Caretaker/Extraordinary National Convention Planning Committee (CECPC) of the All Progressives Congress (APC) says there is no cause for alarm over the supreme court decision on Ondo gubernatorial poll.\nAdvertisementOn Wednesday, the apex court affirmed the election of Rotimi Akeredolu as Ondo state governor.\nEyitayo Jegede, candidate of the Peoples Democratic Party (PDP), had queried the validity of Akeredolu’s nomination by the national caretaker committee of the APC headed by Mai Mala Buni, Yobe governor.\nAdvertisementKeyamo said the reason is to avoid legal battles, since the competence of Buni to hold the position has chairman has been questioned by the supreme court.\nAddressing a press conference on Thursday in Abuja, John Akpanudoedehe, national secretary of the APC caretaker committee, said apex court’s verdict on Ondo gubernatorial poll has “no bearing on the CECPC’s status and its membership”."
  },
  {
    "headline": "We'll go ahead with our congresses, says APC on supreme court verdict",
    "summarized_story": "The Caretaker/Extraordinary National Convention Planning Committee (CECPC) of the All Progressives Congress (APC) says there is no cause for alarm over the supreme court decision on Ondo gubernatorial poll.\nAdvertisementOn Wednesday, the apex court affirmed the election of Rotimi Akeredolu as Ondo state governor.\nEyitayo Jegede, candidate of the Peoples Democratic Party (PDP), had queried the validity of Akeredolu’s nomination by the national caretaker committee of the APC headed by Mai Mala Buni, Yobe governor.\nAdvertisementKeyamo said the reason is to avoid legal battles, since the competence of Buni to hold the position has chairman has been questioned by the supreme court.\nAddressing a press conference on Thursday in Abuja, John Akpanudoedehe, national secretary of the APC caretaker committee, said apex court’s verdict on Ondo gubernatorial poll has “no bearing on the CECPC’s status and its membership”."
  },
  {
    "headline": "Air Peace CEO to secessionists: Promoting hate and violence is an act of cowardice",
    "summarized_story": "Allen Onyema, chief executive officer of Air Peace, says those pushing for secession may end up becoming victims of their actions.\nSpeaking at the event, Onyema, founder of the Foundation for Ethnic Harmony in Nigeria (FEHN), described those preaching violence as cowards.\n“When I talk about unity and peace, a lot of people might want to behead me but I don’t give a damn.\nWhen I am talking about unity and peace, preaching peace, I am not a coward.\nAnybody preaching violence is the biggest coward."
  },
  {
    "headline": "Air Peace CEO to secessionists: Promoting hate and violence is an act of cowardice",
    "summarized_story": "Allen Onyema, chief executive officer of Air Peace, says those pushing for secession may end up becoming victims of their actions.\nSpeaking at the event, Onyema, founder of the Foundation for Ethnic Harmony in Nigeria (FEHN), described those preaching violence as cowards.\n“When I talk about unity and peace, a lot of people might want to behead me but I don’t give a damn.\nWhen I am talking about unity and peace, preaching peace, I am not a coward.\nAnybody preaching violence is the biggest coward."
  },
  {
    "headline": "'My hands are clean' -- DCP Abba Kyari denies Huspuppi bribe allegation",
    "summarized_story": "Abba Kyari, a deputy commissioner of police (DCP), has denied receiving money from Hushpuppi, the embattled Nigerian socialite.\nAdvertisementAccording to US court documents, Huspuppi had alleged that he bribed Kyari to arrest Vincent, a co-fraudster.\nBut in reaction on Thursday morning, Kyari said he never demanded money from Hushpuppi, while stressing that “my hands are clean”.\nKyari also denied that Vincent was ever jailed, adding that he was instead released on bail.\nAdvertisementThe embattled Instagram celebrity had recently pleaded guilty to the money laundering charges against him, risking 20 years imprisonment."
  },
  {
    "headline": "Here’s why Nigeria’s central bank is banning forex sales to money changers",
    "summarized_story": "Nigeria’s Central Bank (CBN) has stopped the sale of foreign exchange (FX) to Bureau De Change (BDC) operators in the country.\nHowever, Emefiele said the MPC noted that the money changers had become wholesale dealers and illegally traded FX to the tune of millions of dollars per transaction.\nThe apex bank also accused BDC operators of speculative, rent-seeking behaviour and involvement in money laundering activities.\nSome have praised the CBN for ending the “mindless sales” of foreign currency to BDC operators and an end to the reign of traders.\nHowever, there are concerns that thousands of Nigerians working at the 3,000+ BDC operators in the country will be thrown into the already large unemployment pool as a result of the ban."
  },
  {
    "headline": "Ato Bentsi-Enchill is helping African startups raise capital and protecting them from difficult investors",
    "summarized_story": "To understand how Ato Bentsi-Enchill started investing in startups, let’s rewind to 2014.\nBut while in the US, I had attended many Africa-focused business conferences at business schools at Harvard, MIT, Wharton, Stanford and NYU.\nOnce I can understand your business model, I can raise money for you or invest.\nFor example with InstantRad, outside of helping them engage investors, I do a lot of business development work for them.\nI also help companies build a path to exit; It’s something a lot of people don’t understand."
  },
  {
    "headline": "Here’s why PiggyVest acquired VFD-owned Savi",
    "summarized_story": "The Nigeria-based wealth management app giant announced in a Medium post that it has acquired a smaller competitor Savi.ng.\nUnder the deal, all existing Savi.ng users will be automatically migrated to Piggyvest.\n“It’s more of a team acquisition,” PiggyVest co-founder, Joshua Chibueze, explained to TechCabal over a call.\nThe team behind Savi are reputed to have solid expertise in finance and are savvy with financial tools.\nPiggyVest did let TechCabal know that there are more acquisition announcements to come in the year."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has..."
  },
  {
    "headline": "An insight into how early-stage venture firm, LoftyInc Capital Management, invests in African startups",
    "summarized_story": "They are both portfolio companies of LoftyInc Capital Management, creators of Wennovation Hub, Nigeria’s first private incubator.\nInspired by the Houston Angel Network, they decided to set up the LoftyInc Angel Network in Nigeria.\nAdvertisementAnd so, in June 2012, together with a few other African angel investors including Tomi Davies and Dotun Sulaiman, the Lagos Angel Network was formed.\nCriteria for investing in startupsLoftyInc is a sector-agnostic firm that invests in startups building products that users really need.\nIn doing so, we have found our experiences launching startups, building larger corporations, and angel investing have proven invaluable,” Bello adds."
  },
  {
    "headline": "Africa’s next Tesla, Field Intelligence’s expansion and Twitter’s suspended accounts",
    "summarized_story": "Field Intelligence says Africa’s annual pharmaceutical market is valued at $60 billion, but this could increase.\nField Intelligence claims to be solving this problem by easing the supply of medicines with its Shelf Life subscription service.\nFor more details, read Nigerian Healthtech startup, Field Intelligence, announces expansion into 11 cities across Nigeria and Kenya.\nTwitter is testing a new way to notify suspended accountsSource: TwitterHas your Twitter account been suspended before?\nTwitter is testing a new way to inform users their accounts have been suspended."
  },
  {
    "headline": "Building Africa’s Tesla: Can JET Motor Company accelerate the adoption of electric vehicles in Africa?",
    "summarized_story": "AdvertisementThe company has now launched JET EV, the first locally made, fully electric vehicle to run on the Nigerian road, with zero emissions.\nThe JET EVAfter about three years of research, testing, and iterative development, the company has finally achieved its primary goal — to produce electric vehicles from the start.\nAccording to Ebuka Uchendu, Technical Lead, JET EV, the vehicle can travel 260-280km on a full charge, although it can technically do 300km.\n“Say I am a fleet operator, and I own 20 fuel-powered vehicles,” Ajaere adds, “I have to put petrol in those vehicles.\nApart from JET in Nigeria, Siltech builds electric bikes, patrol vehicles, and even utility vehicles for the agricultural sector."
  },
  {
    "headline": "COVID-19: Nigeria records 535 new cases, highest since detection of Delta Variant",
    "summarized_story": "COVID-19: Nigeria records 535 new cases, highest since detection of Delta VariantNigeria on Wednesday recorded 535 new cases of COVID-19 across 18 states, the highest number of infections since the detection of the deadly delta variant in the country and in over four months.\nSince the first case of the delta variant, Nigeria has seen a steady increase in COVID-19 cases across states.\nThe Delta variant, according to the World Health Organisation (WHO), is a variant of concern, due to its high level of transmissibility.\nNigeria recorded its first case early July and has so far detected 10 cases according to the NCDC.\nThe variant has also been linked to a surge in cases in countries where it is the dominant strain in circulation."
  },
  {
    "headline": "Nigeria spends $2.1bn on medical tourism, LASUTH wants to cut it",
    "summarized_story": "The Lagos State University Teaching Hospital is taking a shot at cutting Nigeria’s medical tourism that costs about $2.1 billion yearly.\nAlthough official data on health do not capture the actual expenditure on Nigeria’s medical tourism, an estimated 1billion is sent yearly.\nThe laboratory at 70 percent completion will place LASUTH as the first public hospital in Lagos to set this up and ranks it in line with high-rated private hospitals such as First Cardiology and Evercare.\nEmergency units are often filled with patients who might take days or weeks to be stable enough for transfer to the wards.\nLASUTH’s two emergency units have only 40 beds each emergency with far higher demand from patients."
  },
  {
    "headline": "CFA pass rate in May falls to lowest since 1963",
    "summarized_story": "CFA pass rate in May falls to lowest since 1963The pass rate of 25 percent for the Chartered Financial Analyst Level I exam administered in May was the lowest since testing began in 1963, according to data by the CFA Institute.\nAn average of 42 percent of applicants have passed the test in the last ten years, nearly double of the pass rate in May.\nThe 25 percent pass rate in May is also down from 44 percent for those who sat for the February examination.\nThe level I exam has the lowest pass rate of all three levels in the last ten years on average.\nThe level II exam has a 45 percent pass rate in that period while 54 percent of applicants who sat for the level III exam passed."
  },
  {
    "headline": "CSR: Group donate to schools in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin – The Uhunmwode Zone of NBM of Africa on Tuesday flagged off distribution of free educational, and COVID-19 preventive materials to more than 90 schools across its jurisdiction of Uhunmwode and parts of Ikpoba Okha local government area of Edo state.\nThe exercise which kicked off at Uwa Model Demonstration Primary School in Ikhuenhiro community is expected to be followed by Iguomo Primary and Junior Secondary School respectively next week.\n“It’s going to be a continuous process to boost learning in schools under our jurisdiction.\nOhenhen who is the advisory chairman of SBMC in Uhunmwode local government area assured the group of the committee’s support in the ongoing exercise.\nHighpoint of the event was hoisting of the newly donated Nigeria national flag, by members of the zone."
  },
  {
    "headline": "EIRS Interfaces With Butchers On Tax – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- Edo State Internal Revenue Service (EIRS), yesterday sensitized and enlightened butchers on the new tax regime.\nSensitizing the state leadership of the Butchers Association led by Mr. Akhere Odijie, the EIRS Executive Chairman, Mr. Igbinidu Inneh informed them that the new tax regime which kicks off August 1, 2021 would enable government to regulate butchering, document derivable data and possibly come up with policies that favour them.\nClearing off a grey issue raised by the butchers, he explained that, “Veterinary inspection fees was different from taxes, noting that tax is based on the economic activity engaged in by an individual while the veterinary fees are paid to government for services rendered by the veterinary doctors who certifies the fitness of consumed livestock.”The butchers appreciated the EIRS for being an arm of government which was wearing a human face, giving them the opportunity to interface and raise questions which mostly helped to clear doubts.\nThe convoked meeting, it must be observed, was sequel to a resolution of the Edo State House of Assembly (EDHA) directing the EIRS to come up with a proper record of livestock operators in the state."
  },
  {
    "headline": "Agribusiness: Edo engages stakeholders, plans new market to link farmers to buyers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, on Wednesday, met with stakeholders to finalise plans on the construction of a new market to connect farmers in the state with potential buyers.\nThe engagement session, tagged ‘Edo Farmers Market Stakeholders Forum’, organized by the Edo State Skills Development Agency (EdoJobs), assembled agricultural stakeholders in the state to brainstorm on the viability of the project.\nStakeholders represented at the meeting include Farmers Association/Cooperatives, Heads of Agriculture Department in local governments, Ministry of Agriculture, Aggregators and Processors.\nSpeaking to journalists in Benin City, Managing Director of EdoJobs, Ukinebo Dare, said, “The Edo State Government has finalized plans for the opening of a new market to connect farmers in the state with potential buyers.\n“The market will be an access point where local farmers can bring their produce and achieve increased sales."
  },
  {
    "headline": "World Hepatitis Day: Obaseki urges sustained collaboration among stakeholders to raise awareness on early diagnosis, treatment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has urged stakeholders in the health sector to collaborate with government in intensifying awareness campaigns to enlighten residents on the need for early diagnosis, treatment and risk factors which expose people to viral Hepatitis.\nThe governor said this in commemoration of the World Hepatitis Day marked every July 28, by the World Health Organisation (WHO) and its sister agencies.\nHe said, “As we commemorate the World Hepatitis Day, it is imperative to reaffirm the state government’s resolve to deepen reforms in healthcare sector and collaborate with stakeholders to afford residents the opportunity to access quality healthcare services for early diagnosis and treatment of ailments, including viral Hepatitis.\n“The government will continue to invest in revamping more Primary Healthcare Centres (PHCs) through the Edo Healthcare Improvement Programme (EdoHIP) and improve access to quality and affordable healthcare through the Edo State Health Insurance Scheme (EdoHIS).\n“Low coverage of testing and treatment is the most important gap to be addressed in order to achieve the global elimination goals by 2030.”..."
  },
  {
    "headline": "Abba Kyari speaks on relationship with ‘fraudster’ Hushpuppi",
    "summarized_story": "He said he also got Mr Kyari to arrest one of Nigerian accomplices when they had a disagreement.\nMr Kyari took to his verified Facebook page to state his stance.\nIn his statement, Mr Kyari said he did not demand any money from Hushpuppi.\nNobody demanded for a kobo from Abbas Hushpuppi.\nNobody demanded any money from Abbas Hushpuppi and nobody collected any money from him."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Nigeria’s forex crisis deepens as CBN wields the big stick",
    "summarized_story": "He said, “Operators in the BDC have not reciprocated the gesture to help maintain price stability in the market since the CBN had been selling forex to them.\n“The Central Bank will henceforth discontinue the sale of forex to Bureau de Change operators,” Emefiele said.\nHe said, “It is a policy regime that has created a huge enterprise around foreign exchange – round tripping, speculation, over invoicing, capital flight etc.\nThe same issues would manifest even with the banks.”According to him, the way out of the foreign exchange conundrum was for the CBN to allow the market to function.\nMost Nigerian businesses and travellers source forex from BDCs after CBN placed restrictions on transactions that can qualify for official sales of foreign currencies."
  },
  {
    "headline": "BREAKING: Supreme Court upholds Akeredolu’s victory in split judgment, dismisses Jegede’s suit",
    "summarized_story": "BREAKING: Supreme Court upholds Akeredolu’s victory, dismiss Jegede’s suitNigeria’s apex court, the Supreme Court of Nigeria, has upheld the victory of Governor Rotimi Akeredolu in the Ondo State governorship election held last year.\nThe suit of Mr. Eyitayo Jegede, the candidate of the Peoples Democratic Party (PDP) was thrown out.\nBut the judgment divided Supreme Court justices 4-3, meaning that Akeredolu survived only the whiskers.\nThey equally held that the Yobe State governor acted in violation of Section 183 of the 1999 Constitution of the Federal Republic of Nigeria as amended.\nMeanwhile, in the majority judgment, four of the apex court justices agreed with the concurrent decisions of the Ondo State Governorship Election Petition Tribunal and the Court of Appeal in dismissing the appeal for lacking in merit."
  },
  {
    "headline": "Former Imo governor, Ikedi Ohakim joins APC",
    "summarized_story": "A former governor of Imo State, Mr. Ikedi Ohakim, has joined the All Progressives Congress (APC).\nOhakim is a founding member of the Peoples Democratic Party (PDP) in Imo, had defected to the Progressive Peoples Alliance (PPA) in 2006, through which platform he became governor in 2007.\nAn event was held to welcome him to the APC at Okohia, his hometown, in Isiala Mbano LGA of Imo on Tuesday.\n“This decision is in response to the pleadings of my admirers and the touching request by the leadership of APC in Imo.\nOhakim said Hope Uzodimma, Imo governor, is determined to change the lives of the people of the state."
  },
  {
    "headline": "Nigeria’s capital importation down to $875.62m in Q2",
    "summarized_story": "The National Bureau of Statistics disclosed this in its report titled, ‘Nigerian capital importation (Q1 & Q2 2021)’ released on Tuesday.\nThe largest amount of capital importation by type was received through portfolio investment, which accounted for 62.97 per cent ($551.37m) of total capital importation, followed by Other Investment, which accounted for 28.13 per cent ($246.27m) of total capital imported and Foreign Direct Investment, which accounted for 8.9 per cent ($77.97m) of total capital imported in Q2, 2021.\nBy sector, capital importation by banking dominated in Q2, 2021 reaching $296.51m of the total capital importation in Q2, 2021.\nBy destination of investment, Lagos State emerged as the top destination of capital investment in Nigeria in Q2 2021 with $780.06m.\nBy bank, Stanbic IBTC Bank Plc emerged at the top of capital investment in Nigeria in Q2 2021 with $310.21m."
  },
  {
    "headline": "Wire Fraud: Hushpuppi Pleads Guilty In US, Faces 20-year Jail Term",
    "summarized_story": "Embattled instagram celebrity, Ramon Abbas, aka Hushpuppi, is likely to face up to 20 years in prison after pleading guilty to the four count charge against him in a US Court.\nADVERTISEMENT“Ramon Abbas aka Ray Hushpuppi agreed today to plead guilty in federal court to conspiracy to engage in money laundering, of funds from business email compromise scams and other online heists.\n“In his plea agreement, Abbas admitted to laundering money from the Malta Bank heist and the BEC attacks on a Premier League club, another UK firm, and an American law firm, as well as additional schemes.\n“Abbas’s plea agreement, which involved crimes allegedly perpetrated North Korean state-sponsored hackers, was heavily redacted, and many of the filings in the case remain sealed,” he said.\nHowever, with the commencement of his trial, he has entered into a plea bargain agreement with the U.S. government with the hope of getting a lighter punishment."
  },
  {
    "headline": "Wire Fraud: Hushpuppi Pleads Guilty In US, Faces 20-year Jail Term",
    "summarized_story": "Embattled instagram celebrity, Ramon Abbas, aka Hushpuppi, is likely to face up to 20 years in prison after pleading guilty to the four count charge against him in a US Court.\nADVERTISEMENT“Ramon Abbas aka Ray Hushpuppi agreed today to plead guilty in federal court to conspiracy to engage in money laundering, of funds from business email compromise scams and other online heists.\n“In his plea agreement, Abbas admitted to laundering money from the Malta Bank heist and the BEC attacks on a Premier League club, another UK firm, and an American law firm, as well as additional schemes.\n“Abbas’s plea agreement, which involved crimes allegedly perpetrated North Korean state-sponsored hackers, was heavily redacted, and many of the filings in the case remain sealed,” he said.\nHowever, with the commencement of his trial, he has entered into a plea bargain agreement with the U.S. government with the hope of getting a lighter punishment."
  },
  {
    "headline": "APC Group Lauds Buhari’s Achievements In Power Sector",
    "summarized_story": "President Muhammadu Buhari-led administration in Nigeria is revamping the power sector and completing abandoned projects.\nThis position was contained in a statement issued on the assessment of the power sector by APC Legacy Awareness and Campaign group, a group within the ruling All Progressives Congress (APC).\nAccording to the APC group, some of the inherited abandoned projects that have been completed in 2020 were the 40MW Kashimbila Dam and Hydropower Plant; the 10MW Katsina Wind Farm; and the 30MW Gurara Hydroelectric Power Plant.\nThe APC group noted that the government was also carrying out several financial interventions in form of grants, electricity pricing reform and other programmes.\nThe group noted that the Buhari-led administration was laying a solid foundation for uninterrupted power supply in every part of the country in the near future."
  },
  {
    "headline": "APC Group Lauds Buhari’s Achievements In Power Sector",
    "summarized_story": "President Muhammadu Buhari-led administration in Nigeria is revamping the power sector and completing abandoned projects.\nThis position was contained in a statement issued on the assessment of the power sector by APC Legacy Awareness and Campaign group, a group within the ruling All Progressives Congress (APC).\nAccording to the APC group, some of the inherited abandoned projects that have been completed in 2020 were the 40MW Kashimbila Dam and Hydropower Plant; the 10MW Katsina Wind Farm; and the 30MW Gurara Hydroelectric Power Plant.\nThe APC group noted that the government was also carrying out several financial interventions in form of grants, electricity pricing reform and other programmes.\nThe group noted that the Buhari-led administration was laying a solid foundation for uninterrupted power supply in every part of the country in the near future."
  },
  {
    "headline": "APC Adopts Consensus Option For Congresses In Borno",
    "summarized_story": "All Progressives Congress in Borno State has adopted a consensus option in the election of party officials at all levels in the state.\nThe state deputy governor, Umar Kadafur, moved a motion for the adoption of consensus for the ward congresses and this was seconded by a party faithful, Abdu Musa.\nIn his address, Governor Babagana Umara Zulum urged members of the party to observe and adhere strictly to the APC rules and regulations to guide the conduct of the congresses.\nZulum decried the non-compliance with the party’s rules and regulations in some states and how it resulted in litigations that affected its chances in the previous general elections.\nHe urged members to shun acts capable of threatening the unity of the party in the state."
  },
  {
    "headline": "Why I arrested Hushpuppi’s associate, Abba Kyari opens up",
    "summarized_story": "Deputy Commissioner of Police, Abba Kyari, has narrated his encounter with alleged international fraudster, Ramon Abbas aka Hushpuppi.\nKyari also said he did not receive any money from Hushpuppi.\nKyari also allegedly sent Abbas bank account details for an account into which Abbas could deposit payment for Vincent’s arrest and imprisonment,” the statement partly read.\n“Nobody demanded a kobo from Abbas Hushpuppi.\n“Nobody demanded any money from Abbas Hushpuppi and nobody collected any money from him."
  },
  {
    "headline": "Why I arrested Hushpuppi’s associate, Abba Kyari opens up",
    "summarized_story": "Deputy Commissioner of Police, Abba Kyari, has narrated his encounter with alleged international fraudster, Ramon Abbas aka Hushpuppi.\nKyari also said he did not receive any money from Hushpuppi.\nKyari also allegedly sent Abbas bank account details for an account into which Abbas could deposit payment for Vincent’s arrest and imprisonment,” the statement partly read.\n“Nobody demanded a kobo from Abbas Hushpuppi.\n“Nobody demanded any money from Abbas Hushpuppi and nobody collected any money from him."
  },
  {
    "headline": "$1.1 million fraud: US alleges Hushpuppi paid IGP’s team leader Abba Kyari to jail associate",
    "summarized_story": "Kyari has yet to respond to our correspondent’s enquiry, seeking his response on the American court’s allegation.\nThe court said Hushpuppi, who pleaded guilty to charges including money laundering, wire fraud, felony amongst others, used Kyari, a leader of the Inspector-General of Police’ Intelligence Response Team, to jail Vincent.\nHowever, Hushpuppi allegedly hunted Vincent after a dispute broke out among the team.\nHushpuppi and the five others allegedly defrauded the victim of more than $1.1 million and laundered the proceeds of the fraud in several ways, the document noted.\nAfter this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria."
  },
  {
    "headline": "$1.1 million fraud: US alleges Hushpuppi paid IGP’s team leader Abba Kyari to jail associate",
    "summarized_story": "Kyari has yet to respond to our correspondent’s enquiry, seeking his response on the American court’s allegation.\nThe court said Hushpuppi, who pleaded guilty to charges including money laundering, wire fraud, felony amongst others, used Kyari, a leader of the Inspector-General of Police’ Intelligence Response Team, to jail Vincent.\nHowever, Hushpuppi allegedly hunted Vincent after a dispute broke out among the team.\nHushpuppi and the five others allegedly defrauded the victim of more than $1.1 million and laundered the proceeds of the fraud in several ways, the document noted.\nAfter this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria."
  },
  {
    "headline": "Abba Kyari speaks: I never collected money from Hushpuppi",
    "summarized_story": "By AbankulaDeputy commissioner of police, Abba Kyari has issued a statement denying ever collecting any $1.1 million from Hushpuppi.\nIn a statement on his Facebook page, Kyari confirmed that his squad truly arrested a suspect that Hushpuppi claimed was threatening his family in Nigeria.\nBut he posted an emphatic denial: “Nobody demanded for a kobo from Abbas Hushpuppi..Nobody demanded any money from Abbas Hushpuppi and nobody collected any money from him”.\nNobody demanded for a kobo from Abbas Hushpuppi.\nNobody demanded any money from Abbas Hushpuppi and nobody collected any money from him."
  },
  {
    "headline": "Abiodun Lincoln begs wife, video vixen Bolanle",
    "summarized_story": "By Muhaimin OlowoporokuBusinessman Abiodun Lincoln, the husband of popular Nigerian video vixen, Bolanle has apologised to her, weeks after calling her out on social media.\nLincoln accused Bolanle of domestic violence on social media citing instances when she beat him up in Ghana.\nLincoln apologized for calling Bolanle names and also apologized to their son, who may be unaware of his actions now.\nBolanle and Lincoln became popular when he chased her out of his house and live-streamed the moment.\nAfter he chased her out, he made series of allegations against the video vixen."
  },
  {
    "headline": "Morakinyo Canada based Nigerian jailed in Texas for $1m fraud",
    "summarized_story": "Olumide Bankole Morakinyo, 38, a Canada-based Nigerian has been sentenced to eight years in prison in the United States for defrauding the Texas Employees Retirement System.\nHe will also pay $975,863 in restitution to multiple victims for conspiracy to commit money laundering.\nMorakinyo was sentenced by a court in Austin Texas, according to a statement released by U.S. Attorney’s office of the Western District of Texas.\nAminu, who possessed the physical debit cards, would withdraw money under instructions from Morakinyo and then transfer or deposit that money at Morakinyo’s direction.\n‘Today’s sentencing of Olumide Morakinyo highlights how seriously IRS Criminal Investigation (IRS CI) and our law enforcement partners take the issue of identity theft,’ said IRS CI Special Agent in Charge Richard Goss of the Houston Field Office."
  },
  {
    "headline": "Breaking: Kidnapped Kaduna monarch regains freedom",
    "summarized_story": "The Kpop Ham and Paramount ruler of Jaba Chiefdom in Kaduna state, Dr. Jonathan Danladi Gyet Maude, has been released after spending two days in the kidnappers den.\nKaduna state Police Command confirmed to Blueprint that the 83-year-old Jaba paramount ruler was released on Wednesday night.\nAnthony Maude, younger brother to the first class chief in Kaduna state, told journalists on phone that the monarch was released in the evening of Wednesday.\nAccording to the Kaduna state Police Public Relations Officer (PPRO), ASP Muhammad Jalige, “yes, the Paramount ruler of Jaba chiefdom has regained freedom.\nI’m confirming to you that he was not rescued by security agencies, he regained freedom”."
  },
  {
    "headline": "Five years after: Court ends El-Zakzaky, wife, Zeenat’s trial",
    "summarized_story": "Delivering ruling on the secret trial, Justice Kurada, was said to have upheld the no-case submission of the defendant.\nAccording to the counsel to Zakzaky, Marshal Abubakar, the court upheld their no-case submission and agreed that the case lacked merit.\n“On the no-case submission we filed in court, the court agreed with us that the trial lacked merits.\nThe defendants had pleaded not guilty to the chargeNAN reports that on September 29, 2021, the court dismissed a no-case submission filed by El-Zakzaky and his wife Zeenat.\nIn the motion, El-Zakzaky asked the court to dismiss the allegations against him and his wife for lack of evidence."
  },
  {
    "headline": "Senate to OAGF: Recover N665.8bn loans to agencies in 60 days",
    "summarized_story": "It therefore ordered the OAGF to recover all the loans within 60 days and return same to their sources.\n“The purpose of the Development of Natural Resources Fund is to provide financial resources to development alternative mineral resources Development.\nThe Development of Natural Resources Fund belongs to the Federal government.\nThe stabilization fund belongs to three tiers of government.”Senate’s resolutionIn view of this, the Senate, in consideration of the report, ordered the Accountant General of the Federation to ensure refund within 60 days.\n“Ensure the stoppage of further withdrawal from these Accounts without a resolution of National Assembly,” said the Senate."
  },
  {
    "headline": "Akume expresses certainty over OMSA to combat security challenges accros Africa",
    "summarized_story": "Minister of Special Duties and Inter-Governmental Affairs, Senator George Akume , has expressed certainty as Organisation of Military Sports in Africa, OMSA, to be hosted by Nigeria will bring about strong military collaboration in combating terrorism and other security challenges in the subcontinent ahead of the Sahel Game on October 9-19, 2021.\nAkume made this disclosure on Wednesday while delivering his acceptance speech on the occasion of his investiture as patron of OMSA by the President of OMSA, Brigadier General Maikano Abdullahi, who led a delegation to the Minister at Merit House, Abuja.\nThe Minister said the game is coming at the right time when there are a whole lot of insecurity issues affecting member countries.\nHe said: “It is my great delight to welcome the President, Organisation of Military Sports in Africa OMSA , Board Members and the Executive Members to Nigeria.\nI appreciate you for finding time to include the investiture ceremony as part of your activities."
  },
  {
    "headline": "Misappropriation: Accountant General’s Office gets 60 days ultimatum to refund N665.8bn -NigPilot",
    "summarized_story": "It was also discovered that the INEC collected about N20billion from the Natural Resources Development Fund apart from N17.9 billion collected from Brown Rice Levy, Comprehensive Import Supervision Scheme (CISS) Pool Levy, and Rice Levy.\n“The purpose of the Development of Natural Resources Fund is to provide financial resources to development alternative mineral resources Development.\nThe Development of Natural Resources Fund belongs to the federal government.\n“The purpose of the stabilization fund is to provide for unforseen contingencies and economic downturn and the beneficiaries are the 36 states and Federal Capital Territory (FCT).\nThe stabilization fund bongs to three tiers of government.”The Senate, therefore, in its consideration of the report of Senate Public Accounts Committee ordered the Accountant General of the Federation to ensure refund within 60 days."
  },
  {
    "headline": "Court frees Zakzaky, Wife of culpable homicide, other charges -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "National Workshop for Registrars, Court Clerks and Bailiffs Photo Op",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nIn accordance with THE LAW, the material on this Website is included for informational and educational purposes.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "JUST IN: Despite Order, DSS Fails To Produce Igboho’s Detained Aides In Court",
    "summarized_story": "The Department of State Services (DSS) has defied a court order to produce the 12 detained aides of Yoruba-nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho.\nJustice Obiora Egwuatu of the Federal High Court in Abuja had ordered the DSS to produce in court on July 29, the 12 aides who have been in their custody since July 2, 2021.\nBut since the DSS failed to bring the aides before the court on Thursday, the case has stalled yet again, with Justice Egwatu now issueing another order, asking the DSS to produce the 12 aides in court on Monday, August 2.\nIn addition, Olajenbasi asked that the court orders the DSS to release the aides on bail and grant him access to them.\nThe suspects had earlier sued the DSS before the Federal High Court Abuja, on grounds that their fundamental human rights had been infringed."
  },
  {
    "headline": "Nigeria Records COVID-19 Spike Continues With 535 New Cases",
    "summarized_story": "Nigeria’s COVID-19 spike has continued with 535 new cases across various parts of the country.\nThis is according to the Nigeria Centre for Disease Control (NCDC) in its recent update on the outbreak.\nOf the cases, Lagos recorded an alarming number of 219 infections, Akwa Ibom 142 and Oyo 47.\nREAD ALSO: Nigeria Records 213 More COVID-19 Cases, Two New DeathsNigeria’s total figure has continued to rise recently, although authorities have yet to officially declare a third wave of the pandemic.\nThese include compulsory use of face masks in public places, maintaining social distancing, and restriction of crowds in places of worship and social gatherings, among others."
  },
  {
    "headline": "EFCC Interrogates Ex-Governor Al-Makura, Wife Over Corruption Allegations",
    "summarized_story": "The Former Governor of Nasarawa State, Tanko Al-Makura, has been invited for interrogation at the headquarters of the Economic and Financial Crimes Commission (EFCC) in Abuja.\nAl-Makura who is now a serving senator was invited on Wednesday along with his wife.\nThey were being questioned in relation to an alleged breach of trust and misappropriation of funds, allegedly perpetrated during his eight-year tenure as governor.\nRead Also: Money Laundering: Hushpuppi Pleads Guilty, Risks 20 Years ImprisonmentFollowing the questioning, the former governor said contrary to reports, he was never arrested by the EFCC but was invited.\nAl-Makura served as governor of Nasarawa State between 2011 and 2019 before he was elected into the National Assembly as Senator representing Nasarawa South Senatorial District."
  },
  {
    "headline": "10 Nigerian Athletes Banned From 2020 Tokyo Olympics",
    "summarized_story": "Ten Nigerian athletes have been declared ineligible to compete at the 2020 Tokyo Olympic Games, the Athletics Integrity Unit (AIU) said on Wednesday.\nAIU, an independent body created by World Athletics to manages all integrity issues – both doping and non-doping, noted that eight athletes from other countries were also declared ineligible while two others were replaced prior to the submission of their entries to World Athletics.\nThis comes in spite of the improvements in the domestic testing programmes in various countries.\nIt noted that ahead of the games, the ‘Category A’ Federations, working with their respective National Anti-Doping Organisations (NADOs), made significant progress with respect to their domestic testing programmes.\nNigeria was list in ‘Category A’ at the start of 2020 after a continued period of weak domestic testing levels."
  },
  {
    "headline": "4 Billion Anti-Coronavirus Shots Injected Worldwide",
    "summarized_story": "More than 4 billion doses of anti-Covid vaccines have been administered around the world, eight months after the vaccination drive started, according to an AFP count Thursday.\nGlobal injections have slowed slightly: this fourth billion was reached in 30 days, while it took only 26 days to reach the previous one.\nThe first and second billion were reached after about 140 and 40 days respectively.\nForty of the four billion shots have been administered in China (1.6 billion).\nOn average 52 shots have been injected per 100 inhabitants worldwide."
  },
  {
    "headline": "Nationwide Ward Congresses will hold as scheduled – APC",
    "summarized_story": "The All Progressives Congress (APC) says it’s Ward Congresses to elect party executives will hold across the country on Saturday, July 31st 2021 as scheduled.\nThe assurance is contained in a statement issued on Thursday by Senator John James Akpanudoedehe, the National Secretary, Caretaker/Extraordinary Convention Planning Committee (CECPC) of the party.\nThe statement added that the ward Congress Committees of the Party have already been inaugurated and delegated with the responsibility of conducting, supervising, monitoring the scheduled Ward Congresses.\nThe party says the clarification is against the backdrop of personal opinions being expressed by some individuals on the status of the APC Caretaker/Extraordinary Convention Planning Committee (CECPC ) and its capacity to conduct the Congresses.\nThe statement reads further: ” While it is not our intention to join issues with these commentators, the Supreme Court’s Wednesday judgment affirming the Election victory of the Ondo State Governor, Rotimi Akeredolu SAN had no bearing on the CECPC’s status and its membership.”AdvertisementThe party urges members and aspirants to come out enmasse and peacefully participate in the ward Congresses, come Saturday."
  },
  {
    "headline": "Zamfara Road Traffic Agency suspends activities of tricycle riders in Gusau",
    "summarized_story": "Zamfara state Road Traffic Agency known as ZAROTA has suspended the activities of tricycle riders in the state with immediate effect.\nThis is according to the Commandant of the agency, Rabi’u GarbaYandoto.\nIn an interview with TVC News, the Commandant Zamfara state Road Traffic Agency Rabiu Garba Yandoto said the decision becomes necessary following Wednesday minor clash between personnel of the agency and tricycle riders in Gusau, the Zamfara state Capital.\nTricycle riders in Gusau are accusing personnel of the Zamfara state Road Traffic Agency of extortion which led to minor clash in part of the metropolisYandoto insist that the order stands until the issue is resolved.\nAdvertisementZamfara state government had in June this year suspended activities of ZAROTA and sacked the former Commander following the alleged extortion of tanker and truck drivers in plying the state."
  },
  {
    "headline": "You are disobeying court orders, Judge tells DSS",
    "summarized_story": "Justice Obiora Egwuatu has told the Department of State Security Service that when a court of competent jurisdiction gives an order such orders are meant to be obeyed.\nOn 23rd July ruling on an exparte motion Justice Egwuatu had ordered the DSS to produce the 12 aides in court and also show cause on why the court should not admit them to bail conditionally or unconditionally.\nAt the resumed sitting Counsel to the DSS told the court that the enrolled order of the court was received, but the circumstances of the case needs to be made known to the court, to that effect a 16 paragraph affidavits was filed on 27th July.\nPresiding Judge, Justice Obiora Egwuatu held that the order of the court was for the DSS to produce the applicants in court, that order should be obeyed first, before telling the court the circumstances of their arrest.\nJustice Obiora reemphasized his order directing the respondent produce the applicants in court on 2nd August."
  },
  {
    "headline": "Nigeria Supercop Abba Kyari Indicted in Hushpuppi’s Fraud Case in the US",
    "summarized_story": "Hushpuppi in the indictment, was said to have paid Abba Kyari to get one of his traducers arrested and jailed in Nigeria.\n“After this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria.\nThe proceeds of the fraud allegedly were laundered in several ways.\nAfter this contact, Abbas allegedly arranged to have Vincent jailed in Nigeria by Abba Alhaji Kyari, 46, of Nigeria.\nKyari also allegedly sent Abbas bank account details for an account into which Abbas could deposit payment for Vincent’s arrest and imprisonment."
  },
  {
    "headline": "China Building Second Nuclear Missiles Base, Analysts Say",
    "summarized_story": "Analysts at the Federation of American Scientists say China is building a second field of silos for launching nuclear missiles in a development that could constitute “the most significant expansion of the Chinese nuclear arsenal ever”.\nThe number marks a significant increase, they said, given that China has for decades operated only 20 silos for its liquid fuel Df-5 Intercontinental Ballistic Missiles (ICBM).\nIt added that US media and relevant institutes hype China’s “silos” to increase pressure on Beijing to change its behaviour and to provide “more reason for the US to upgrade its nuclear arsenal”.\nChina’s refusal to discuss its nuclear arsenal “should be a cause for concern and condemned by all responsible nations”, he added.\nAnother Republican, Congressman Mike Rodgers, said China’s crash nuclear buildup was not “the actions of a country with a ‘no first use’ policy and seeking only a ‘minimum credible deterrent’”."
  },
  {
    "headline": "Outspoken Billionaire Sun Dawu Jailed for 18 Years in China",
    "summarized_story": "A prominent Chinese billionaire has been sentenced to 18 years in prison, the latest in a string of punishments against outspoken corporate bosses.\nSun Dawu runs one of the country’s largest private agricultural businesses in the northern province of Hebei.\nHe was reportedly detained last year, along with 20 relatives and business associates, over a land dispute with a government-run farm.\n“The way they’re investigating me now is making those close to us suffer and those who hate us rejoice.\nChina has been cracking down on businesses and entrepreneurs in the country."
  },
  {
    "headline": "Officials in Tokyo Alarmed as Covid Cases Hit Record Highs",
    "summarized_story": "Japanese officials sounded the alarm Thursday after Tokyo reported record-breaking coronavirus cases for two straight days with the Olympics well underway.\nHe said the new cases were soaring not only in the Tokyo area but across the country.\nTokyo reported 3,177 new cases on Wednesday, up from 2,848 on Tuesday, setting an all-time high and exceeding 3,000 for the first time.\nTokyo officials said Thursday that two foreign Olympic athletes are currently hospitalized and 38 others are self-isolating at designated hotels in the city.\nNationwide, Japan reported more than 9,500 confirmed cases, a new record, on Wednesday for a total of about 892,000, with about 15,000 deaths."
  },
  {
    "headline": "US Congress Pressures Biden to Reassess US-Nigeria Relations Over Human Rights Records",
    "summarized_story": "United States lawmakers have begun to mount pressure on President Joe Biden over concerns about Nigeria’s human rights records.\nAlready, a proposed sale of 12 attack aircrafts and 28 helicopter engines worth $857 million has been put on hold.\nIn the past, the Nigerian military had dismissed reports of human rights abuses by its soldiers as baseless and accused human rights groups of undermining the military’s resolve to combat terrorism.\nBut the United States had scrubbed proposed arms sales to Nigeria in the past on a case-by-case basis.\nThe Trump administration, frustrated with how Congress held up proposed arms sales for months, weighed scrubbing the decades-old practice of informally notifying Congress about arms sales, but it faced steep backlash over the idea from lawmakers."
  }
]