[
  {
    "headline": "Fuel scarcity: Private depots hike rates, more filling stations may sell above N180/litre",
    "summarized_story": "The oil marketer added, “If we buy PMS at N170litre, how much are we going to sell it in our filling stations?\nThe manager of a filling station in Kubwa, a suburb in Abuja, confirmed that some private depots were dispensing above the rate approved by the government.\nIt has the power to sanction erring depots and filling stations that dispense petrol above the approved rates.\nRather we are buying it at between N162 and N170 per litre from private depots.\nWhen contacted, the Executive Secretary, Depot and Petroleum Products Marketers Association of Nigeria, Olufemi Adewole, did not respond."
  },
  {
    "headline": "FG admits inspection failure caused dirty fuel imports, prices soar in states",
    "summarized_story": "It disclosed this as queues by motorists persisted in various filling stations in Abuja and neighbouring states of Nasarawa and Niger, as well as in other locations across the country.\nHe said, “In the last weeks, Nigerians have grappled with fuel scarcity, not because of the absence of supply of products but due to inspection failure, which allowed adulterated products into the country.\nIn Bayelsa State, the fuel scarcity persisted as more filling stations operated by the independent petroleum marketers remained shut for business within Yenagoa and its environs.\nAs tension persisted over fuel scarcity in Kwara State, the state government has redoubled its effort to ensure that the hardship encountered by motorists is ameliorated.\nOn Sunday, the state government continued the monitoring of distribution and sale of petroleum products, especially within the Ilorin metropolis."
  },
  {
    "headline": "Obaship: Ifa rejects MC Oluomo (2)",
    "summarized_story": "As the Chairman, Lagos NURTW, Alhaji Tajudeen Agbede, lived in Agege when MC Oluomo was the state treasurer of the union in 2010.\nMC Oluomo probably doesn’t know this because he’s not royalty.\nThe land was gifted to Oshodi Tapa by Chief Aromire at the instance of the colonial governor, Hawley Glover.\n“Oshodi Tapa died on July 2, 1868, about six years after his return from exile in Epe, leaving 46 surviving children.\nA section of the Oshodi Tapa family is now known as Oshodi–Glover on account of the latter’s association with an ex-colonial chieftain."
  },
  {
    "headline": "Makinde receives last batch of 3,300 participants in agribusiness project from Nasarawa",
    "summarized_story": "By Adeola BadruGovernor ‘Seyi Makinde of Oyo State, on Sunday, received batch eleven of the total three thousand three hundred participants of the state’s Youth Entrepreneurship Agribusiness Programme (YEAP), who just arrived in Ibadan from Nasarawa State after their training in agribusiness.\nThe youths numbering about three hundred who could not hide their joy and excitement sang and danced while recounting their experiences during the agribusiness training programme at Nasarawa State.\nHe said: “The journey to Nasarawa state started on 8th of August last year and has ended today.\nShe commended the governor for initiating the programme for the youths saying, Makinde has thought the youths how to fish from the river.\n“Kudos to you sir for working assiduously to turn things around for the best for us in Oyo State."
  },
  {
    "headline": "COVID-19: NGO donates 9,404 packets of Medical Facemasks, 2, 496 bottles of Sanitol Hand Sanitizer, 260 bottles of Hand Wash to Ebonyi",
    "summarized_story": "…reached over 42,714 pregnant women with IPTp across 575 communities in Ohaukwu L.G.ABy Peter Okutu, AbakalikiAn International Organization, Transforming Intermittent Preventive for Optimal Pregnancy (TIPTOP) Jhpiego, weekend, said it has donated 9,404 packets of Medical Facemasks, 2, 496 bottles of Sanitol Hand Sanitizer and 260 bottles of Hand Wash to Ebonyi state to fight COVID-19 pandemic.\nMonitoring and Evaluation Advisor, Jhphiego-TIPTOP Project, Nigeria, Dr. Herbert Onuoha stated this in Abakaliki during a dissemination meeting of research results for evaluation of TIPTOP Project in Nigeria.\nHe noted that 175,800 doses of Sulphadoxine-Pyrimethamine(SP) was procured by the organization and that 152,800 of it has been donated while 23,000 doses would be donated in April this year.\n“TIPTOP project is an innovative, community-based approach that aims to dramatically increase the number of pregnant women in malaria-affected countries in sub-Saharan Africa receiving antimalarial treatment thus saving the lives of thousands of mothers and newborns”, he said.\nHe explained that the organization has worked with service providers and Community Health Workers Agents and reached over 42,714 pregnant women with IPTp in five years across 575 communities in Ohaukwu local government area of the state."
  },
  {
    "headline": "Gunmen kill NDLEA operative close to military checkpoint in Ebonyi",
    "summarized_story": "…set van ablaze, injure another operativeBy Peter Okutu, AbakalikiAn operative of the National Drug Law Enforcement Agency (NDLEA) has been reportedly killed by gunmen, close to a military checkpoint in the Ebonyi State.\nThe operative was killed when the gunmen attacked an NDLEA team on duty along the Ezzamgbo axis of the Enugu-Abakaliki Expressway on Sunday morning.\nIt was gathered that the location of the attack was close to a military checkpoint along the expressway.\nThe source said, “On 20th Feb. 2022, Sunday morning at about 300hrs at a drug checkpoint along Enugu Abakaliki expressway at Ezzangbo, unknown gunmen attacked drug law enforcement agents and shot two drug officers on duty.\nJust like the attack on officials of the Drug Law Enforcement Agents that was carried out at about 3am, the Ezzilo attack was carried out at about 12 midnight."
  },
  {
    "headline": "Pantami’s professorship: ASUU lacks power under Trade Union law to sanction FUTO — Lawyer",
    "summarized_story": "Iheanacho Agboti, weekend, stated that the leadership of the Academic Staff Union of Universities (ASUU) has no right under the Trade Union (Amendment) Act 2005 to sanction management of any University for any supposed infraction.\nHis words: “I’m a lawyer and the truth is that ASUU lacks the power under the Nigerian Trade Union laws to sanction the Management of Federal University of Technology (FUTO) over the supposed illegality.\nThere is nowhere under the Trade Union (Amendment) Act 2005 (which is the legislation guiding the operations of all trade Unions in Nigeria, including ASUU), that gives ASUU the power to sanction a University management for a supposed infraction.\n“And the law guiding the affairs of all federal universities in Nigeria is the Universities (Miscellaneous Provisions)(Amendment) Act 2012.\n“Under this law, a University Management can only be sanctioned by its Governing Council not ASUU”, he explained."
  },
  {
    "headline": "NEMA provides relief items to thousands of IDPs after Muna campfire incident",
    "summarized_story": "By Ndahi Marama, MaiduguriThe National Emergency Management Agency, NEMA has revisited and provided food and non-food items to thousands of Internally Displaced Person IDPs who were affected by fire incident which killed one person, several others injured, with makeshift houses razed down Thursday last week at Muna Elbdawi camp in Borno state.\nThe quick provision of the relief items was sequel to the approval made by the Director-General of the Agency, Alhaji Mustapha Ahmed Habib to fast track the routine/monthly food distribution in Borno state.\nThe federal government through NEMA, according to Mohammad has been supporting the Borno State Government with monthly/routine food distribution for 35,000 households of IDPs living in camps, host and resettled communities in the state.\n“Today each household is to receive a ration compromising 10kg of rice, beans, maize, a gallon of vegetable oil, tomato paste and other varieties of condiments.\n“NEMA under the leadership of the Director-General, Alhaji Mustapha Ahmed Habib will continue to give its maximum support and assistance to bettering the lives of IDPs in the state”."
  },
  {
    "headline": "Fuel scarcity: TUC mulls directing workers to stop going to work",
    "summarized_story": "There are indications that the Trade Union Congress (TUC) may soon direct its members to boycott work if the challenge of fuel scarcity across the country persists for the next few days.\nThose the TUC intends to pass the directive across in the coming days are workers in statutory corporations and government-owned institutions.\nHe said, ”The union’s position is very clear.\nThe position of SSASCGOC also is that, you know we are affiliated to TUC, and we have made it known to TUC that let the workers stop going to work until there is enough fuel to take them to work.\nWe are waiting for our centre to respond to our position but our position in SSASCGOC is that there is no need to go to work."
  },
  {
    "headline": "Fuel scarcity: We aren’t afraid to take responsibility – FG sympathizes with Nigerians over unforeseen hardship",
    "summarized_story": "The Federal Government on Sunday sympathized with Nigerians over unforeseen hardship occasioned by scarcity of Premium Motor Spirit (PMS) and called for patience in finding lasting solutions to the problem.\nAccording to Sylva, It is not a time to trade blame, adding that the Federal Government is not afraid to take responsibility.\n“This is regrettable, and the Federal Government sympathises with the citizenry over the unforeseen hardship, occasioned by the inevitable scarcity.\nHe appreciated the NNPC for showing so much concern to the plight of Nigerians by coming forward with an apology.\n“The Nigerian people deserve the best and the government is determined to set the country on the right path of petroleum products availability and sustainability,” Sylva said."
  },
  {
    "headline": "Fish out killers of Gov Ortom’s relatives now – COSMBYLA tasks security agents in Benue",
    "summarized_story": "The Coalition of Southern and Middle Belt Youth Leaders Assembly, COSMBYLA, has called on security agencies in Benue State to ensure that the killers of Governor Samuel Ortom’s relatives are apprehended without delay.\nDAILY POST recalls that three kinsmen of Governor Ortom, were gunned down by armed men suspected to be Fulani herdsmen on Saturday.\nIt was gathered that the incident occured when the gunmen who were equipped with sophisticated weapons laid an ambush and blocked the Lordye- Gbajimba road in Guma Local Government Area of the state.\nCOSMBYLA, an umbrella body of all the youth groups in the South East, South South, South West and Middle Belt regions also commended the proactive measure of the state governor in collaboration with the troops in rescuing 8 kidnapped victims on Saturday.\n“We commend His Excellency Governor Samuel Ortom for providing necessary logistics and support needed for the security of lives and properties in the state."
  },
  {
    "headline": "Northern cities to experience dust haze – NiMet warns",
    "summarized_story": "The Nigerian Meteorological Agency through its Central Forecast Office, on Sunday, alerted the public on the possibility of some northern cities in Nigeria to experience dust haze, which can lead to deterioration in horizontal visibility.\nIn a statement issued on Sunday by Mr. Ndkwe Adibe, stated that some cities in the northern part of the country may begin experiencing gradual deterioration in horizontal visibility as early as the evening of Sunday.\nAccording to the statement, dust haze is expected to intensify before the end of the day over most parts of the Northern cities, horizontal visibility should further deteriorate from the evening of Saturday, 19th of February 2022, into the next 24 – 48 hours; as thick dust haze should be observed over the Northern cities, keeping visibilities to 1000m and below over places like Maiduguri, Yobe Nguru, Potiskum, Dutse, Gombe,Yola, Bauchi, Katsina, Kano, and Kaduna States.\nAccording to him, a fresh dust plume has been raised at its source region (Faya Largeau in Chad Republic).\nThis is expected to advect into the country and reduce horizontal visibility."
  },
  {
    "headline": "UBEC to conduct NALABE in line with international best practices – Bobboyi",
    "summarized_story": "The Executive Secretary Universal Basic Education Commission (UBEC), Dr. Hamid Bobboyi, has concluded plans to conduct an internationally accepted national assessment.\nBobboyi disclosed this at a five-day workshop for the development of test items for the 2022 National Assessment of Learning Achievement in Basic Education (NALABE) in Nigeria held in Kaduna this week.\nIn a statement signed by David Apeh, the Commission’s Head of Public Relations and Protocol, Bobboyi said UBEC and UNICEF have put everything together for the conduct of an internationally accepted National assessment.\nThe workshop will also produce a development test blueprint and generate test items that will be trial tested for standardization.\nNational assessment is a survey of schools and learning to provide evidence about learners’ achievement in identified curriculum areas, such as reading/literacy, mathematics/numeracy, science and other skills, for a clearly defined part of the education system."
  },
  {
    "headline": "Enugu shuts markets, offices as council poll holds Wednesday",
    "summarized_story": "Enugu State Government said yesterday that Wednesday will be a work-free day, as the local government election holds across the state.\nA statement by the Special Adviser to the Governor on Information, Steve Oruruo, said: “The Enugu State Government (ENSG) wishes to notify the public that local government election will hold on Wednesday across the state.\n“During this period, markets and offices shall be closed and movement of persons and vehicles restricted, except for those on essential duties.\nHe gave the directive in a statement yesterday in Enugu by spokesman Assistant Superintendent of Police (ASP) Daniel Ndukwe.\nThe News Agency of Nigeria (NAN) reports that Enugu State Independent Electoral Commission (ENSIEC) had scheduled elections into the 260 councillorship and 17 council chairmanship positions for Wednesday."
  },
  {
    "headline": "Youths hail Dickson as varsity produces maiden graduates",
    "summarized_story": "The Bayelsa West Youth Leadership Forum (BWYLF) has hailed Sen. Seriake Dickson for choosing their area to site the University of Africa, Toru-Orua (UAT), when he was the governor.\nThe youth said the vision of Dickson, who represents Bayelsa West, had yielded dividends, as the university recently graduated its maiden students.\nSuch priority is necessary to ensure that people to take over leadership positions in the public and private sectors are equipped with knowledge.\nThis institution, the University of Africa Toru-Orua (UAT), has produced its maiden graduates with good grades and flying colours.\n- Advertisement -“We want to convey our heartfelt appreciation to Sen. Dickson for bringing one of the world-class universities to the doorsteps of his people in the rural area.”"
  },
  {
    "headline": "Governors meet Monday over new APC convention date",
    "summarized_story": "But most APC governors were angry that the Buni-led Caretaker Committee has kept them in the dark over the convention.\nAccording to a source, who spoke in confidence, most APC governors were unhappy with the Caretaker Committee for its ding-dong attitude to the convention.\nThe source said: “All is not well among APC governors over the convention because the Caretaker Committee is unwilling to stick to the agreed February 26 timeline.\n“Apart from funding, the Caretaker Committee has come up with an excuse that some off-season elections will hold on the convention date.\n“We heard rumours of a new convention date of March 12 but the CECPC has not made recommendations to the PGF."
  },
  {
    "headline": "Uzodimma distributes 2,700 smart phones, cars to youths",
    "summarized_story": "Imo State Governor Hope Uzodimma has distributed 2,700 smart phones and two cars to youths, as part of activities marking the St Valentine’s Day.\nUzodimma, who distributed the gifts during the ‘Hope for Imo’ Valentine Concert in Owerri at the weekend, promised the recipients free airtime and data subscriptions.\nThe two new Greely cars were presented to Mr. Joshua Okeke from Orlu Local Government and Miss Blessing Emekwe from Ikeduru Council, who were winners in a lucky deep conducted at the venue of the programme.\nThe governor reinstated his commitment to youth empowerment through job creation and called on the youth to fish out criminals disturbing the peace of the state."
  },
  {
    "headline": "Obiano to honour 500 indigenes March 9",
    "summarized_story": "Anambra State Governor Willie Obiano has said he has chosen 500 indigenes to be honoured on March 9.\nHe said this would serve as part of the activities heralding the end of his tenure and the swearing-in of governor-elect Prof. Charles Soludo.\nHe said his administration built 134 roads and did legacy projects that would enable the people not to forget him.\n- Advertisement -Obiano said he was not interested in contesting any election next year, as being governor had taken its toll on him.\nBut now, I have slimmed and shrunk because I worked day and night to lift Anambra to greater heights.”"
  },
  {
    "headline": "Pregnant woman, eight others burnt to death in auto crash in Kwara",
    "summarized_story": "Eight persons and a pregnant woman on Sunday morning have been reported burnt to death in a multiple auto crash in the Ilorin metropolis, the state capital of Kwara state.\nOne of the vehicles involved in the crash was said to have carried petrol-filled kegs.\nThe private vehicle, said to be coming out of the airport, failed to wait for the oncoming passenger bus to pass, while the crash, said to have occurred as a result of over-speeding.\nIt was gathered that the vehicles involved somersaulted and had tyre burst before they burst into flame.\nSpeaking on the incident, the state sector commander of the FRSC, Jonathan Owoade, confirmed the development and described the crash as unfortunate."
  },
  {
    "headline": "Queen Elizabeth tests positive for COVID-19",
    "summarized_story": "The Queen has tested positive for Covid, Buckingham Palace has said.\nThe monarch is experiencing “mild cold-like symptoms” but expects to continue “light duties” at Windsor over the coming week, the palace said.\n“She will continue to receive medical attention and will follow all the appropriate guidelines,” it added in a statement.\nThe Queen, 95, had been in contact with her eldest son and heir, the Prince of Wales, who tested positive last week.\nIt is understood a number of people have tested positive at Windsor Castle, where the Queen resides."
  },
  {
    "headline": "Osun 2022: Oyetola wins APC nomination for second term",
    "summarized_story": "From LAYI OLANREWAJU, IlorinIncumbent Governor Adegboyega Oyetola has been declared winner of Saturday’s All Progressives Congress (APC) governorship primaries held in Osun State.\nOyetola polled 222,169 votes to beat his main challenger and former Secretary to the State Government Moshood Adeoti who got 12,921 votes.\nChairman of the Osun Governorship Primary Election Committee and Governor of Kwara State AbdulRahman AbdulRazaq announced the results at the state secretariat of APC at 2.57a.m.\nHe said there were a total of 235,550 votes cast in the Osun Governorship Primaries.\nChairman of APC in Osun State Prince Gboyega Famodun, who spoke on behalf of the party, commended members of the party for the impressive turnout and peaceful conduct of the exercise."
  },
  {
    "headline": "2023 presidency: Why move to lure Jonathan into APC will fail – Aminu Wali, former Foreign Affairs minister",
    "summarized_story": "From Desmond Mgboh, KanoAmbassador Aminu Wali is Nigeria’s former minister of Foreign Affairs and a founding father of the Peoples Democratic Party (PDP).\nFor us, the national party leader is our sole leader.\nWhatever movement it is, regardless, should not arrogate itself the authority that can compete or disregard the party national leadership- because this is what is happening.\nThere is a new PDP national leadership today.\nThere is demand for Igbo president, Yoruba president or a Northern president or whatever president."
  },
  {
    "headline": "Contaminated fuel: Season of pain, sorrow",
    "summarized_story": "• Affected filling stations confused on how to evacuate adulterated petrol imported from Belgium• Motorists, commuters suffer as product price skyrocketsNigerians can now work and earn dollars DAILY from home.\nAn online video which surfaced recently shows a petrol attendant complaining about how the adulterated petrol dispensed at the station damaged cars and motorcycle engines.\n‘‘Should my vehicle be damaged as a result of this contaminated fuel, who will bail me out?\nThe adulterated petrol according to the regulator-Nigerian Midstream Downstream Petroleum Regulatory Authority(NMDPRA) has proved to be high in methanol concentration.\nBut prior to its recall, the adulterated fuel had already found its way into the Nigerian petroleum retail products market."
  },
  {
    "headline": "Tinubu Floors Aregbesola as Oyetola Wins Osun APC Primary",
    "summarized_story": "The Osun State governor won in Aregbesola’s ward with 309 votes against 146 recorded for Adeoti, the aspirant anointed by Aregbesola.\nHowever, Aregbesola was absent from the primary election and was said to have left Ilesa for Abuja yesterday morning for unspecified official duty.\nAdeoti said the ugly development in Osun APC has sent a wrong signal as to whether the APC has a future in the state.\nHe also accused Oyetola of using intimidation and violence to ensure that the primary election was not free and fair.\n“We are reliably informed that Governor Oyetola is the one who hand-picked the Chairman and members of the primary election committee."
  },
  {
    "headline": "INEC Allays Fears on 2023 Elections, Says No Plan to Shift Polls",
    "summarized_story": "* Electoral Bill 2022 still inchoate, commission clarifiesChuks Okocha in AbujaThe Independent National Electoral Commission (INEC) has stated that the 2023 general election is not encumbered and will hold as planned, beginning with the presidential poll scheduled for February 18, 2023.\nAccording to Section 28 (1) of the Electoral Bill 2022, INEC is required to issue a notice of election not later than 360 days before the day appointed for an election.\nAccording to him, the existing and extant electoral legal framework for the conduct of elections remains the Constitution and the Electoral Act.\nThe INEC commissioner said that the speculations and anxiety relating to the shifting of the date of the 2023 elections were based on the Electoral Bill 2022 which is still inchoate.\nTherefore, the President has to give assent to the bill on or before 22nd February 2022 if the dates announced for the 2023 elections are to be maintained."
  },
  {
    "headline": "Security Agencies Move against Importers of Off-spec Petrol",
    "summarized_story": "The importation and circulation of adulterated petrol had resulted in damage to vehicle engines across many parts of the country.\nIt also affected the supply chain, causing long queues in Lagos and Abuja as filling stations shut down to clean up their tanks.\n“Security agencies have commenced detailed investigation into circumstances that led to the importation of toxic fuel into the country.\nIn both Lagos Island and the mainland, long queues of vehicles were seen at the few filling stations selling petrol.\nLong queues were also on both sides of the Karshi-Nyanya expressway, causing gridlock that stretched down the roads for kilometres."
  },
  {
    "headline": "CBN Has Enough FX to Meet Market Demand, Report Reveals",
    "summarized_story": "The analysts argued that the current low level of crude oil production has weakened foreign reserves accretion, a development which they said necessitated the implementation of policies that would encourage the inflow of foreign portfolio investments.\nAccording to the report, “the CBN has enough supply to support the FX market over the short term, given inflows from the recently issued Eurobond and the IMF’s SDR.\nLast year, Nigeria was able to raise $4 billion through Eurobonds, which financial analysts described as a reflection of investors’ confidence in the economy.\nSDRs are international reserve assets created by the IMF and allocated to members to supplement existing official reserves.\nHoldings of SDRs by an IMF member are recorded as an asset, while the allocation of SDRs is recorded as the incurrence of liability of the member receiving them."
  },
  {
    "headline": "News in Photographs: Osinbajo in Bayelsa",
    "summarized_story": "Vice President Yemi Osinbajo was in Bayelsa on Saturday, where he flagged off the construction of the Angiama-Oporoma bridge.\nHe was hosted by Bayelsa Governor Douye Diri, and also paid visits to traditional rulers in the state.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Seven Dead As Nigerian Air Force Fighter Jet Targeting Bandits ‘Mistakenly’ Bombs Children In Niger Republic",
    "summarized_story": "An airstrike by the Nigerian Air Force targeting ‘bandits’ has killed seven children and wounded five others by mistake in Niger, a local governor told AFP on Sunday.\nIn 2021, a military jet that came to repel an attack by Boko Haram dropped a bomb that landed in a compound where civilians were having child christening.\nA fighter jet also on a mission against Boko Haram extremists in April 2021 mistakenly bombed men of the Nigerian Army, killing over 20 officers.\nSome of the Chibok schoolgirls kidnapped by Boko Haram in 2014 and freed last year also said three of their classmates were killed by Air Force bombardments.\nIn June 2021, an offensive aerial bombardment the NAF Alpha jet carried out around Genu town in Niger State resulted in the killing of some wedding guests."
  },
  {
    "headline": "BREAKING: Seven Dead As Nigerian Air Force Fighter Jet Targeting Bandits ‘Mistakenly’ Bombs Children In Niger Republic",
    "summarized_story": "An airstrike by the Nigerian Air Force targeting ‘bandits’ has killed seven children and wounded five others by mistake in Niger, a local governor told AFP on Sunday.\nIn 2021, a military jet that came to repel an attack by Boko Haram dropped a bomb that landed in a compound where civilians were having child christening.\nA fighter jet also on a mission against Boko Haram extremists in April 2021 mistakenly bombed men of the Nigerian Army, killing over 20 officers.\nSome of the Chibok schoolgirls kidnapped by Boko Haram in 2014 and freed last year also said three of their classmates were killed by Air Force bombardments.\nIn June 2021, an offensive aerial bombardment the NAF Alpha jet carried out around Genu town in Niger State resulted in the killing of some wedding guests."
  },
  {
    "headline": "BREAKING: Seven Dead As Nigerian Air Force Fighter Jet Targeting Bandits ‘Mistakenly’ Bombs Children In Niger Republic",
    "summarized_story": "An airstrike by the Nigerian Air Force targeting ‘bandits’ has killed seven children and wounded five others by mistake in Niger, a local governor told AFP on Sunday.\nIn 2021, a military jet that came to repel an attack by Boko Haram dropped a bomb that landed in a compound where civilians were having child christening.\nA fighter jet also on a mission against Boko Haram extremists in April 2021 mistakenly bombed men of the Nigerian Army, killing over 20 officers.\nSome of the Chibok schoolgirls kidnapped by Boko Haram in 2014 and freed last year also said three of their classmates were killed by Air Force bombardments.\nIn June 2021, an offensive aerial bombardment the NAF Alpha jet carried out around Genu town in Niger State resulted in the killing of some wedding guests."
  },
  {
    "headline": "EXCLUSIVE: Oba Of Benin In Modern Slavery Scandal, Uses Influence To Detain Palace Aide Who Served Him From Age 15 In Prison For Months, Denies Him Bail Over Allegation Of Stealing",
    "summarized_story": "\"Some time ago, Nelson tried to run away from the palace because of the maltreatment and hardship he had endured.\nSaharaReporters learnt that Oghogho and the other were accused of stealing N200 million cash from the palace.\n\"Initially, he (Oba of Benin) said it was $20,000, then, he said N10 million, when he saw that he wasn’t getting as much solidarity.\n\"I don't understand the case you are talking about, the case is in court, do you want Omo n'Oba (Oba of Benin) to react to that?\nOba of Benin in Modern Slavery Scandal, Uses Influence to Detain Palace Aide Who Served Him From Age 15 in... by Sahara Reporters on Scribd"
  },
  {
    "headline": "EXCLUSIVE: Oba Of Benin In Modern Slavery Scandal, Uses Influence To Detain Palace Aide Who Served Him From Age 15 In Prison For Months, Denies Him Bail Over Allegation Of Stealing",
    "summarized_story": "\"Some time ago, Nelson tried to run away from the palace because of the maltreatment and hardship he had endured.\nSaharaReporters learnt that Oghogho and the other were accused of stealing N200 million cash from the palace.\n\"Initially, he (Oba of Benin) said it was $20,000, then, he said N10 million, when he saw that he wasn’t getting as much solidarity.\n\"I don't understand the case you are talking about, the case is in court, do you want Omo n'Oba (Oba of Benin) to react to that?\nOba of Benin in Modern Slavery Scandal, Uses Influence to Detain Palace Aide Who Served Him From Age 15 in... by Sahara Reporters on Scribd"
  },
  {
    "headline": "Tinubu to youths: You will become president... but after me",
    "summarized_story": "Bola Tinubu, a chieftain of the All Progressives Congress (APC), has informed Nigerian youths that they will become presidents of the country after him.\nSpeaking on Sunday when he visited Lamidi Adeyemi, the Alaafin of Oyo, at the palace, Tinubu asked the youths to create room for elderly people.\nWhat if you become president, will you chase us out of town?” Tinubu asked.\nBut I will become the president first.”In January, Tinubu visited President Muhammadu Buhari during which he announced his intention to contest the presidency in 2023.\nAdvertisementIn January, Tinubu visited Oyo state over the deaths of Jimoh Oyewumi, the Soun of Ogbomoso; Saliu Adetunji, the Olubadan of Ibadanland, and Alao-Akala, former governor of Oyo."
  },
  {
    "headline": "Tinubu to youths: You will become president... but after me",
    "summarized_story": "Bola Tinubu, a chieftain of the All Progressives Congress (APC), has informed Nigerian youths that they will become presidents of the country after him.\nSpeaking on Sunday when he visited Lamidi Adeyemi, the Alaafin of Oyo, at the palace, Tinubu asked the youths to create room for elderly people.\nWhat if you become president, will you chase us out of town?” Tinubu asked.\nBut I will become the president first.”In January, Tinubu visited President Muhammadu Buhari during which he announced his intention to contest the presidency in 2023.\nAdvertisementIn January, Tinubu visited Oyo state over the deaths of Jimoh Oyewumi, the Soun of Ogbomoso; Saliu Adetunji, the Olubadan of Ibadanland, and Alao-Akala, former governor of Oyo."
  },
  {
    "headline": "TUC threatens to direct members to sit at home if petrol scarcity persists",
    "summarized_story": "The Trade Union Congress (TUC) has threatened to stop its members from going to work if the lingering petrol scarcity is not addressed.\nThe discovery of petrol with methanol above Nigeria’s specification had caused scarcity and resulted in long queues in filling stations across the country.\nMohammad Yunusa, TUC treasurer, while speaking with journalists on Sunday, asked the federal government to identify and punish those behind the scarcity.\n“We will soon direct workers to stop going to work if the challenge of fuel scarcity across the country persists for the next few days,” he said.\n“The position of SSASCGOC … is workers should stop going to work until there is enough fuel to take them to work."
  },
  {
    "headline": "TUC threatens to direct members to sit at home if petrol scarcity persists",
    "summarized_story": "The Trade Union Congress (TUC) has threatened to stop its members from going to work if the lingering petrol scarcity is not addressed.\nThe discovery of petrol with methanol above Nigeria’s specification had caused scarcity and resulted in long queues in filling stations across the country.\nMohammad Yunusa, TUC treasurer, while speaking with journalists on Sunday, asked the federal government to identify and punish those behind the scarcity.\n“We will soon direct workers to stop going to work if the challenge of fuel scarcity across the country persists for the next few days,” he said.\n“The position of SSASCGOC … is workers should stop going to work until there is enough fuel to take them to work."
  },
  {
    "headline": "THE AFTERMATH: Rejected in Osun, 'buried' in Lagos — is this the end of Aregbesola's political career?",
    "summarized_story": "The political relevance of Rauf Aregbesola, minister of interior, appears to be hanging by a thread, given recent events in south-west politics.\nBut in recent months, the political structures he once relied upon in Lagos and Osun states have come crashing down like a pack of cards.\n‘BURIED’ IN ALIMOSHO, LAGOSAdvertisementMany political analysts have described Alimosho LGA in Lagos as the political stronghold of Aregbesola.\nAdvertisementBut on Sunday, APC members in the LGA held a funeral rally for Aregbesola’s political career.\nAs his ministerial tenure winds down, Aregbesola’s political fate hangs in the balance, especially if he remains in the ruling party."
  },
  {
    "headline": "Flutterwave launches SME lending, fintech-as-a-service in vision 3.0",
    "summarized_story": "Led by founder and CEO Olugbenga Agboola, the company facilitates cross-border payments transactions of small-to-large businesses in Africa via one API.\nGet the best African tech newsletters in your inboxFlutterwave Capital, the new SME loans product, is offered in partnership with the company’s lending partners—CashConnect Microfinance Bank, MoneyWise Microfinance Bank, Wema Bank, Zenith Bank, Stanbic IBTC Bank, and Sterling Bank.\n“With Flutterwave Capital, we’re making it easier for business owners to access the funds they require to grow their businesses.\nFlutterwave also helps businesses outside Africa expand their operations on the continent with an international clientele that includes Booking.com, Flywire, and Uber.\nThe latest financing thus brings its total investments secured since launched in 2016 to $475 million (plus a $35 million Series B in 2020 and a $20 million Series A in 2018)."
  },
  {
    "headline": "Crypto crime grows to $14 billion as crypto popularity increases",
    "summarized_story": "In 2021, crypto criminals made a killing, as illicit crypto transactions hit $14 billion, a 79% jump from the $7.8 billion recorded in 2020, according to a report by US-based blockchain analytics company, Chainalysis.\nThe growth in illicit crypto transactions is attributed to a 567% jump in overall transaction volume in 2021.\nGiven that overall crypto transactions grew to $15.8 trillion in 2021, it is not surprising that cybercriminals are increasingly using crypto.\nDespite the increase in the total volume of illicit transactions, illicit transactions represented just 0.15% of the total cryptocurrency transaction volume in 2021—its lowest ever.\nWhat this means is that legitimate crypto transactions far outstrip illegal transactions."
  },
  {
    "headline": "Inside Ckrowd’s plan to help African creators monetise their content",
    "summarized_story": "This means African creators are still struggling to earn much from their craft, compared to their global counterparts.\nAt KAM Africa, Adebayo started an initiative that would help creative professionals like musicians and actors understand the business part of their craft.\nThink of a marriage between OnlyFans, Patreon, and YouTube—in fact, a combination of all the streaming platforms out there—but now for African content.\nOn Ckrowd, creators can livestream their content like uduX live and upload on-demand contents like on Netflix.\nThe platform pays 70% of total income on content to creators, which we believe is the highest pay-out on digital content to African creators,” said Adebayo."
  },
  {
    "headline": "From telecoms to tech: MTN changes logo to look the part",
    "summarized_story": "Africa’s biggest telecom company MTN is preparing for a brand refresh that’ll position it as a technology company, rather than a telecommunications company.\nThe brand refresh includes forgoing the white, yellow and red lettering in favour of a black lettered MTN logo surrounded by an oval, similar in shape to a rugby ball.\nThe new look is “aligned to our evolution from a telecommunications company to a technology company underpinned by one simple and consistent yet striking brand”, Morafo said.\nCurrent MTN logoNew MTN LogoMTN’s expansion drive to become a fully-fledged technology services company also means that it’s on a hiring drive to hire 150 digital experts in South Africa.\nThis rebrand will help shift public perception of the MTN brand and also influence its market valuation."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "It’s all about seed rounds ￼",
    "summarized_story": "For example, some freight companies in Africa still manage their shipments using outdated methods like spreadsheets, phone calls, and emails.\nAnd this company has announced $4 million in seed funding to expand across the country and into neighbouring regions.\nIt also saw participation from XYZ Ventures, Village Global, Musha Ventures, Ventures Platform, Voltron Capital, and Paystack CEO Shola Akinlade.\nNonso Onwuzulike officially launched the company in January 2022 to improve employees’ financial well-being.\nWhat’s more, the company will use the seed funding to speed up the development of its platform to serve large enterprise employers."
  },
  {
    "headline": "Learning the VC game, Flutterwave’s $3bn valuation and CrowdForce’s $3.6m raise",
    "summarized_story": "AdvertisementToday, we’re discussing:Why female founders should learn the venture capital gameFlutterwave’s $3bn valuationCrowdForce’s $3.6m pre-Series AWomen should play the VC gameIn 2021, women got less than 1% of startup funding.\nAccording to her, women need to learn the rules of the VC game and know what works and what doesn’t.\nIn her chat with Chimgozirim, she detailed the rules and tactics that could mean better odds for women in winning the venture capital game.\nRead all about it here: Female founders need to learn how to play the venture capital game– Sarah DusekFlutterwave’s $3bn valuationFlutterwave has come a long way since it was founded in 2016.\nAway from fintech: Flutterwave also displayed interest in the creator economy with the acquisition of Disha, a platform that allows creators to curate content and receive payment."
  },
  {
    "headline": "Female founders need to learn how to play the venture capital game — Sarah Dusek",
    "summarized_story": "Share this article:A cursory look at the venture capital landscape in Africa will reveal an impressive number of deals and the triumph of innovation over regulation.\nAccording to Sarah Dusek, Managing General Partner at Enygma Ventures, who spoke to Techpoint Africa on Zoom, a second reason is that most women don’t know how to play the venture capital game.\nWith venture capital a novel concept in Africa, not too many people, regardless of gender, understand how it works.\nThat decision birthed Enygma Ventures, a sector-agnostic firm providing women with the capital required to scale and grow their businesses.\nVenture capital is, in many ways, a numbers game, and the more women there are building companies that investors like, the higher the chances of women receiving investments."
  },
  {
    "headline": "2023: Can Iyorchia Ayu return PDP to power?",
    "summarized_story": "Iyorchia Ayu, the national chairman of the People’s Democratic Party (PDP), has, since assumption of office toward the end of last year, been championing the return to power of the erstwhile ruling party.\n“There are clamours for power to shift to the South in 2023 and PDP is not firm on the shift, Atiku is still nursing ambition to rule.\nHe insisted that if Ayu wants to return PDP to power in 2023, he must insist on a Southern presidential candidate or APC will beat them to it again.\nChijioke Umelahi, a lawyer and former Abia lawmaker, believes that returning PDP to power in 2023 is an almost impossible task.\nMustapha described the inaugural speech of Ayu as a bare-faced attempt by the party to hoodwink Nigerians to return it to power in 2023."
  },
  {
    "headline": "APC convention: Party leaders narrow choice to Al’Makura, Akume, Bwari",
    "summarized_story": "The choice of who becomes the National Chairman of the ruling All Progressives Congress (APC) is becoming clearer with leaders of the party endorsing the candidature of three aspirants.\nThey also narrowed the choice of preferred candidates to three aspirants, namely, Tanko Al’Makura (Nasarawa State), George Akume (Benue State) and Abubakar Bawa Bwari (Niger State) in that order.\nThis is however subject to the approval of the party at the February 25 National Convention.\nThe meeting also agreed to zone the office of National Secretary to the South-South; Deputy National Chairman (South) to the South West; Deputy National Chairman (North) North-West; National Treasurer (South East) and National Financial Secretary (North East).\n“Top on our priority in the choice of a national chairman that is loyalty to the party, with pedigree and patriotic to the country."
  },
  {
    "headline": "Naira off to rocky start as OPEC currencies jump",
    "summarized_story": "Only the Algerian Dinar, down 1.22 percent, has lost more value than the Nigerian naira among the currencies of countries in the Organisation of Petroleum Exporting Countries (OPEC) this year.\nThat compares with a 0.9 percent average gain for the currencies of OPEC members, according to Bloomberg data.\nNigeria’s low oil production and the small matter of a growing petrol subsidy bill have wiped out the gains of the oil rally while other oil exporting countries are benefitting.\nThe subsidy burden and low oil production means there has been no external reserve accretion for Nigeria despite high oil prices.\nA non-oil fx programme (RT200) was announced by Godwin Emefiele, Governor of Nigeria’s central bank after the conclusion of February’s bankers’ meeting."
  },
  {
    "headline": "U-17 Wins Edo Cricket League Title, As NCF Boss Splash Cash, Gifts On Deserving Cricketers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – THE 2021/22 Season of the Edo Cricket was rounded off last weekend as the Edo Under-17 Cricket Team retained the title they won last year with 62 runs win over Ambrose Alli University Cricket Club, Ekpoma.\nUyi Akptata, the President of the Nigeria Cricket Federation who is also the Chairman of Edo State Cricket Club, speaking to Sports Writers shortly after the game commended the two teams for given good account of themselves.\nAmbrose Alli University Cricket Club edged Dolphins Cricket Club by six wickets on the opening day of the event, while No Limit Cricket Club fell by nine wickets to the U-17 side to set up the finals on Sunday.\nHigh points of the event was the presentation of Trophiea and Individuals awards to deserving players, as David Abiebhode of U-17 cricket club bagged three awards.\nProsper Useni also of U-17 team being the youngest player to play for the national team and national under-19 team won the National breakthrough of the year award."
  },
  {
    "headline": "NNL WK 2: Bendel Insurance beat J. Atete FC 2-0 as Benin Arsenals encourage fans with free jerseys – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Bendel Insurance FC of Benin on Saturday evening defeated J. Atete FC of Delta state 2-0 to steady their sailing in the new football season of the Nigeria National League(NNL).\nThe visiting J. Atete FC who looked defensive in their approach to the game were yet to recover from shock before the referee signalled his whistle for halftime break.\nSpeaking during the post match interview, Bendel Insurance FC coach Monday Odigie expressed joy over their first victory in the new season.\nJ. Atete FC coach Emakpo Akpoguma on the other hand praised his boys efforts,but however admitted that they lost to a better side.\nMeanwhile, Insurance players while celebrating their victory gave out their Sterling Bank Jerseys to their supporters and fans in appreciation of their steadfastness."
  },
  {
    "headline": "PTI Commences Combination Of e-Learning With Physical Modules; Introduces National Skill Qualification Framework(NSQF) – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Petroleum Training Institute (PTI), Effurun is to commence e-learning along side the physical modules beginning from this academic session.\nOur library is a repository of current textbooks, journals and manuals and they are at the disposal of students.\n“From this academic session, the Institute would integrate e-learning platforms with physical modules, and implore students to brace up to the realities of learning in the post COVID-19 pandemic”, the Principal stated.\nI chose PTI because it is the best among Petroleum Training Institute, I have heard about, so, I thank God for being a student here”.\nAlso , Akinkugbe Obadiah, a Mechanical Engineering OND student who was also delighted said he chose PTI because of their track record of academic excellence."
  },
  {
    "headline": "GBV: Edo First Lady Bags Award of Excellence – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The First Lady of Edo State, Her Excellency Betsy Obaseki has bagged an award of excellence from the Westminster Foundation for Democracy (WFD) in recognition of her outstanding commitment to the eradication of Sexual and Gender Based Violence (GBV) in the State.\nOther experts who worked on the project include Mrs Bunmi Dipo-Salami and Mrs Dorothy Njemanze.\n“I must commend Your Excellency for getting the Edo State Violence Against Persons Prohibition Law amended, reviewed and not only that, for moving Edo State within one year from a State with VAPP law in review, to the model State when it comes to Violence Against Persons Prohibition Law.\nThose who attended the Zoom meeting include the Deputy Governor of Edo State, His Excellency Rt.\nPhilip Shaibu, his wife Her Excellency Maryann Shaibu and over 50 Civil Society Practitioners and government functionaries in Nigeria and overseas."
  },
  {
    "headline": "Osun APC Primary: Aregbesola’s camp kicks as Gov. Oyetola, Alabi, Oyebamiji express satisfaction",
    "summarized_story": "By Sunday Oguntuyi, OsogboGovernor of Osun State, Mr. Adegboyega Oyetola, has expressed satisfaction with the conduct of the state All Progressive Congress (APC) governorship primary election in the state, just as the camp of a former governor of the state, Rauf Aregbesola has alleged that there is widespread irregularities in the exercise.\nThe fact is that there is only one candidate that is contesting the primary in Osun and that’s the incumbent governor.\nBola Oyebamiji expressed happiness at how people of his Community showed appreciation to good governance delivered by Governor Oyetola.\nOyebamiji appreciated the security architecture and the comportment of the people, noting that the exercise was being held under peaceful and conducive environment.\nMeanwhile, the chairman of Aregbesola’s splinter group in the party, The Osun Progressives , Mr. Rasaq Salinsile has faulted the primary election , saying it’s effort in futility."
  },
  {
    "headline": "Tension in Osun as APC holds governorship primary today",
    "summarized_story": "By Olusesan LaoyeThe political atmosphere in Osun State, is intense Saturday morning, as the ruling party in the state, the All Progressive Congress (APC), holds its governorship primary election amid escalating rift between the incumbent governor of the state, Gboyega Oyetola and his predecessor, Rauf Aregbesola.\nAcross Osogbo, the state capital, there is presence of the security personnel at every corner, signaling that they are ready to deal with any one who forments trouble, but their mere presence has made residents apprehensive.\nSecurity men, including the Police, the Army, Civil Defence, DSS, among others, are seen patrolling the streets Osogbo and other major cities in the state.\nAregbesola is supporting the former Secretary to the government during his tenure, Moshood Adeoti against Oyetola who wants the ticket of the party for a second term.\nThe feud between the duo also heightened the frosty relationship which has been existing between Tinubu and Aregbesola."
  },
  {
    "headline": "Osun PDP faction rejects appointment of Sunday Bisi as acting chairman",
    "summarized_story": "By Sunday Oguntuyi, OsogboA faction of the Osun State Chapter of the Peoples Democratic Party, has frowned at a letter “purportedly communicating” a decision of the National Working Committee of the party to appoint Mr Sunday Bisi as the acting chairman of the party.\nThe members, including the acting chairman of the faction, Wale Ojo, maintained that they were the authentic Exco of the PDP in the state.\n“Let me say to you in clear terms, this is about constitionality and in the face of the law I remain the valid and legally recognized State Acting Chairman of Osun PDP.\nHe should desist from walking on the same path as the erstwhile occupant of that office, Prince Uche Secondus did.”A former Chairman of the Party in Osun, Barr.\nOjo Williams, said “the Peoples’ Democratic Party which you all know is a democratic and law abiding party."
  },
  {
    "headline": "9PSB CEO Seeks Targeted Content to Accelerate Nigeria’s Financial Inclusion",
    "summarized_story": "Mracajac made this assertion, while presenting a keynote address, themed “Content Creation and Financial Inclusion; The Future of Digital Banking” at the Tech Summit Ogun 2022, which held at the Olusegun Obasanjo Presidential Library Abeokuta, Ogun State on Thursday February 17, 2022.\nAccording to her, while there are ongoing efforts to support the country’s financial inclusion drive, a lot more rest on formulating tailored strategies that address specific needs.\nShe added that, developing content that speaks only to the already banked and mirroring the digital financial habits of those who are fully included and heavily banked, will not help to keep the newly on-boarded in the system long-term.\nThe second one, she stated, is needed for sustainable Financial inclusion: delivery of digital banking services that are a reflection of the lifestyle of the currently unbanked and underserved population.\nShe called on all stakeholders within the financial ecosystem, including content creators to work collectively to develop and implement a digital content strategy for the unbanked to move the financial inclusion needle and ultimately advance the economy, society and improve life of every Nigerian."
  },
  {
    "headline": "IPAC Pulls Out Of 2022 Enugu LGA Elections",
    "summarized_story": "The Enugu State chapter of the Inter-Party Advisory Council (IPAC), has pulled out of the 2022 local government elections in the State slated for February 23, 2022 as announced by the Enugu State Independent Electoral Commission (ENSIEC), saying it was doubtful of a free, fair and credible exercise.\nIPAC also noted that ENSIEC did not, in line with the law, notify it that there was going to be a local government election in the state.\nThe communique said that Enugu State Independent Electoral Commission has not in line with the law, released names of candidates vying for the elections.\nThe statement reads in part: “That Enugu State Independent Electoral Commission has not in line with the law, released names of candidates vying for the said elections.\n“That Enugu State Independent Electoral Commission has not issued any modalities for the election in less than 4 days to the elections."
  },
  {
    "headline": "Re: Abba Kyari: New Video Contradicts NDLEA’s Claim",
    "summarized_story": "We published a story in our Sunday, February 20, 2022 edition on page 8, entitled, “Abba Kyari: New video contradicts NDLEA‘s claim.”The story has generated considerable public interest.\nUpon investigation we have discovered that there is no “new video” and also that the claim of “contradiction” could not be justified.\nThe story falls disastrously short of the standard of journalistic quality we’re trying to build and should never have been published.\nWe apologise to the public for this indefensible lapse.\nThose involved will be disciplined and steps will be taken to avoid a repeat."
  },
  {
    "headline": "Nigeria Lost 2,038 Lives To Air Crashes In 53 Years – AIB",
    "summarized_story": "The commissioner and chief executive of the Accident Investigation Bureau Nigeria (AIB), Akin Olateru, said Nigeria has lost 2,038 lives to aviation accidents in the last 53 years.\nThis is from the year 1969 to 2022, when a total of 2,038 (1,996 on board passengers and 42 on ground) lives were lost to air crashes.\nHe stated this while speaking at the 2022 international day for commemorating air crash victims and their families on Sunday in Abuja.\nRecall that the International Civil Aviation Organisation (ICAO), in cooperation with the Air Crash Victims’ Families’ Federation International (ACVFFI), has established February 20 as the international day commemorating air crash victims and their families.\nJust as with any other emergency plan, it is essential to have a readiness plan to support the involved victims and their families."
  },
  {
    "headline": "Nigeria Lost 2,038 Lives To Air Crashes In 53 Years – AIB",
    "summarized_story": "The commissioner and chief executive of the Accident Investigation Bureau Nigeria (AIB), Akin Olateru, said Nigeria has lost 2,038 lives to aviation accidents in the last 53 years.\nThis is from the year 1969 to 2022, when a total of 2,038 (1,996 on board passengers and 42 on ground) lives were lost to air crashes.\nHe stated this while speaking at the 2022 international day for commemorating air crash victims and their families on Sunday in Abuja.\nRecall that the International Civil Aviation Organisation (ICAO), in cooperation with the Air Crash Victims’ Families’ Federation International (ACVFFI), has established February 20 as the international day commemorating air crash victims and their families.\nJust as with any other emergency plan, it is essential to have a readiness plan to support the involved victims and their families."
  },
  {
    "headline": "JUST-IN: Unknown Gunmen Attack NDLEA Operatives In Ebonyi, Kill 1",
    "summarized_story": "Unknown gunmen Sunday morning attacked a team of National Drug Law Enforcement Agency (NDLEA) operatives on duty along the Ezzamgbo axis of the Enugu-Abakaliki Expressway, killing one of the personnel and seriously injuring one other.\nThe source further disclosed that the gunmen also collected one riffle from the officers while the NDLEA patrol Hilux Van was burnt by the attackers.\nThe source said, “On 20th Feb. 2022, Sunday morning at about 300hrs at Drug checkpoint along Enugu Abakaliki highway Ezzangbo, unknown gunmen attacked Drug law enforcement agents and shot two drug officers on duty.\nThe attack is coming barely six days after three policemen were shot dead by unknown gunmen at Ezillo axis of the Enugu-Abakaliki expressway in Ishielu local government area of Ebonyi State.\nEzzilo in Ishielu local government area of the state is about few kilometers to Ezzamgbo where the latest attack was carried out by gunmen."
  },
  {
    "headline": "You Can Only Become President After I’ve Become One — Tinubu Tells Nigerian Youths",
    "summarized_story": "You Can Only Become President After I’ve Become One — Tinubu Tells Nigerian YouthsBola Tinubu, the National Leader of the All Progressives Congress and former governor of Lagos State, has advised Nigerian youths that they can only become president after he does.\nOn Sunday, the 69-year-old lawmaker announced this during a visit to Oba Lamidi Adeyemi, the Alaafin of Oyo.\nTinubu’s planned visit to Oyo town was part of his outreach to traditional rulers across the six geopolitical areas in preparation for his presidential bid in 2023.\nSpeaking in Yoruba, he said, “You won’t give room for the elderly to pass and you haven’t become president.\nWhat if you become president, you will chase us out of town?”“You will grow old, you will become president but I will become president first.”"
  },
  {
    "headline": "2023: My 10 Years In APC Was A Waste — Former Member, Mbelegber",
    "summarized_story": "Fiebai Mbelegber, a former All Progressives Congress (APC) Chieftain, has stated that his greatest regret is the ten years he spent as an APC member in Bayelsa State with nothing to show for it.\nMbelegberi lambasted the leadership of his previous party for missing internal democratic processes within the party in an exclusive interview with DAILY POST on Sunday in Yenagoa, after defecting from the APC to the ruling Peoples Democratic Party (PDP) in the state.\nwe will stand by our decision and it can not be altered””I just recently defected from the All Progressive Congress (APC), to the People Democratic Party (PDP).\n”Some circumstances that led to me leaving was that the party does not have internal democracy, the leadership does not have any vision for its followers.\nIn a possible short period, there will be a mass exodus of defectors from the APC to the PDP."
  },
  {
    "headline": "Aftermath Of Osun APC Primary Election: Come, Let’s Build Osun Together, Oyetola Tells Co-contenders",
    "summarized_story": "…urges party members to close ranks, eschew bitternessThe Governor of Osun, Adegboyega Oyetola, swept all the 30 Local Government Areas and Ife-East Area Office in the just-concluded Governorship Primary Election of the All Progressives Congress (APC).\nAccording to the official results announced, Adeoti polled 12,921 votes to come a distant second while Lasun polled 460 votes to come third.\nGovernor Oyetola stated these while delivering his acceptance speech shortly after he was declared winner by the party’s Governorship Primary Election Committee led by the Kwara State Governor, Abdul-Rasak AbdulRahman.\nThe outcome of this primary election is victory for our party and members who have spoken loudly through their votes.\nLet’s join hands to build the Osun of our dream."
  },
  {
    "headline": "FBI Vs Hushpuppi: FG Told To Extradite Abba Kyari To US After NDLEA Arrest",
    "summarized_story": "FBI Vs Hushpuppi: FG Told To Extradite Abba Kyari To US After NDLEA ArrestOhanaeze Ndigbo has requested the Federal Government of Nigeria to enable DCP Abba Kyari, the suspended head of the IRT, to be extradited to the United States to face the Federal Bureau of Investigation’s (FBI) claims in the hushpuppi affair.\nThe National Drug Law Enforcement Agency (NDLEA) arrested Kyari and others on Monday for alleged ties to an international narcotics syndicate.\n“DCP Abba Kyari, who was under suspension previous to this allegation, shall stay on suspension,” the PSC wrote.\n“DCP Abba Kyari should be allowed to face his crimes in the United States.\nNigerians want a thorough investigation of the alleged criminal indictment of Abba Kyari and subsequent extradition to the United States.”"
  },
  {
    "headline": "Pregnant woman, 8 others burnt to death in Kwara auto crash",
    "summarized_story": "A pregnant woman and eight other perssons Sunday were reportedly burnt to death in a multiple auto crash in the Ilorin metropolis, the capital of Kwara state.\nBlueprint gathered that a total number of 20 persons were said to have been involved in the crash, while one male and eight females were reported dead.\nOne of the vehicles involved in the crash was said to have carried petrol-filled kegs.\nIt was gathered that the vehicles involved somersaulted and had tyre burst before they burst into flame.\nSpeaking on the incident, the state sector commander of the FRSC, Jonathan Owoade, confirmed the development and described the crash as unfortunate."
  },
  {
    "headline": "Amended Electoral bill hangs as Buhari returns from EU-AU summit",
    "summarized_story": "President Muhammadu Buhari on Saturday returned to Abuja after attending the sixth Europe-Africa Summit in Brussels, Belgium.\nBefore his departure, the President did not sign the much-debated Electoral bill amended by the National Assembly.\nNAN reports that Buhari departed the country on February 16, to join other African and European leaders to discuss issues of mutual concerns to both continents.\nDuring the G4 meeting, the leaders resolved to strengthen the platform for the resolution of the various issues confronting the African continent.\nHe equally stressed the need to nip the root causes of extremism, conflicts and tensions in Africa."
  },
  {
    "headline": "Police to the rescue as man nails teenager on tree",
    "summarized_story": "In Kenya, Police are investigating a matter where a teenager was nailed on a tree for suspected theft.\nThe 19-year-old identified as Collins Sambaya is said to have been assaulted by one Elvis Irime by nailing him on a tree on the allegation that he had stolen his radio.\nThe matter was reported by the area chief Evans Endesha by phone.\n“It was reported by North Izava location chief namely Evans Endesha by phone that he received a report that a person had been nailed on a tree by some people,” part of the police report read.\nAfter the reports, the police immediately swung into action and visited the scene where they confirmed that the teenager had been nailed on a tree."
  },
  {
    "headline": "NDLEA Intercepts Fake $4.7m Cash In Abuja",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA) have intercepted fake $4.7 million cash from Abuja.\nAccording to Babafemi, controlled delivery of the parcelled counterfeit notes totaling $4.7m led to the arrest of a principal suspect, 52-year-old Abdulmumini Maikasuwa.\nGen. Mohammed Buba Marwa (retired) directed that both the cash and the suspect in custody be transferred to the Economic and Financial Crimes Commission (EFCC) for further investigation.\nThis is coming barely three weeks after NDLEA operatives granted the 38-year-old mother administrative bail following her arrest for dealing in illicit drugs.\nHe equally admonished them and their counterparts in Adamawa, Kwara, Bauchi, and others across the country not to rest on their oars."
  },
  {
    "headline": "Nine Dead In Kwara Road Accident",
    "summarized_story": "At least nine persons have died in a road accident in Kwara State.\nThe incident occurred in the early hours of Sunday in front of the Ilorin Airport along Ilorin – Eyenkorin road.\nAccording to the Sector Commander, FRSC Kwara sector command, Corps Commander Jonathan Owoade, the crash occurred at about 08:00 am; involving a Toyota Hiace Bus with registration number AFN 06 YL and a Toyota Corolla saloon car marked LRN 787 FE with 17 people involved.\nThree other men inside the saloon car, however, escaped uninjured.\nReacting to the incident, the Sector Commander lamented that the crash was avoidable and therefore, warned members of the public against reckless driving."
  },
  {
    "headline": "Queen Elizabeth Tests Positive For COVID-19, Says Palace",
    "summarized_story": "Britain’s 95-year-old Queen Elizabeth II tested positive for Covid-19 on Sunday, a fortnight after marking 70 years on the throne, but aides said her symptoms were “mild”.\nNo information was given then on whether Queen Elizabeth had taken any Covid tests herself.\n“Buckingham Palace confirm that the queen has today tested positive for Covid,” a statement from the palace said.\n“She will continue to receive medical attention and will follow all the appropriate guidelines.”While normally secretive about the queen’s health, the palace has previously confirmed she is triple-vaccinated against Covid-19.\nThe government’s move will be unaffected by the queen’s illness, royal commentator Alastair Bruce said."
  },
  {
    "headline": "Oyetola Declared Winner Of Osun APC Governorship Primary",
    "summarized_story": "﻿Osun State Governor, Adegboyega Oyetola, has won the governorship primary of the All Progressive Congress (APC) in the state.\nIn a statement by its spokesman, Abiodun Agboola, the faction alleged widespread irregularities in the exercise conducted by the Osun APC Primary Election Committee led by Governor Abdulrasaq of Kwara State.\n“The Governor Abdulrahman Abdulrasaq led Osun APC Primary Election Committee should know that the primary lacks credibility and fairness,” it said.\n“It is necessary and important to inform the general public and Governor Abdulrahman Abdulrasaq led Osun APC Primary Election Committee of the ongoing irregularities in the conduct of the primary election of the All Progressives Congress (APC) in the State of Osun.\n“We strongly condemn the conduct of the primary election because it is nothing but a sham with a fraudulent process to favour Governor Adegboyega Oyetola."
  },
  {
    "headline": "Moroccans Protest Against High Prices For Basic Goods",
    "summarized_story": "Protests broke out in several Moroccan cities on Sunday as people rallied against rising prices and to commemorate the eleventh anniversary of demonstrations that called for reform.\nIn the capital Rabat, dozens of protesters decried the high cost of basic goods and shouted slogans harking back to the “February 20 Movement”, an AFP correspondent said.\nREAD ALSO: Int’l Community Pledges $600 Million As Relief For Haiti EarthquakeDozens also rallied in Casablanca and Tangiers, according to videos posted on social media.\nDrought has hurt the country’s economy and Moroccans are also feeling the pinch from high fuel prices.\nSome 3.8 billion dirhams (over $400 million) is needed for flour subsidies alone in 2022, according to an economy ministry official."
  },
  {
    "headline": "Breaking: Oyetola wins Osun APC governorship ticket for second term",
    "summarized_story": "Governor Adegboyega Oyetola has emerged the candidate of the All Progressives Congress for the July 16th governorship election in Osun State.\nOyetola won the ticket for the second term after defeating two other aspirants including Moshood Adeoti backed by his predecessor and Interior minister, Rauf Aregbesola.\nAdvertisementBelow is a breakdown of the election results.\n—————–AdvertisementFinal collation and announcement Apc governorship primaries results.\nTotal number of voters: 11,552AdvertisementAccredited voters: 4,660Total votes cast: 4,323AdvertisementValid votes: 4,323Adegboyega Oyetola: 3,877AdvertisementMoshood Olalekan Adeoti: 446Lasun Yusuf: 0AdvertisementIrepodun local govtTotal number of voters: 20,563AdvertisementAccredited voters: 9,692Total votes cast: 8,874AdvertisementValid votes: 8,874Adegboyega Oyetola: 7,928AdvertisementMoshood Olalekan Adeoti: 732Lasun Yusuf: 214AdvertisementIrewole local govtTotal number of voters: 14,085AdvertisementAccredited voters: 8,432Total votes cast: 8,098AdvertisementValid votes: 8,097Adegboyega Oyetola: 7,570AdvertisementMoshood Olalekan Adeoti: 537Lasun Yusuf: 00AdvertisementFINAL RESULTSTotal number of Voters: 408,697Total Accredited Voters: 247207AdvertisementTotal votes Cast: 235550Adegboyega Oyetola: 222,169AdvertisementLasun Yusuf: 460Moshood Adeoti: 12,921"
  },
  {
    "headline": "Nigeria needs more rebels to speak truth to power- Obasanjo",
    "summarized_story": "A former President, Olusegun Obasanjo said Nigeria “needs more rebels” who would speak the truth to power not minding whose ox is gored.\nThis, he said, remains one of the greatest steps towards rebuilding Nigeria.\nAdvertisementHe made this known in Abeokuta, while unveiling the autobiography of the Babanla Adinni of Egbaland, Tayo Sowunmi, titled “Footprints Of A Rebel.”He noted that for Nigeria to move forward, it requires “more rebels” who stand and speak for the truth.\nAdvertisementHe added that whoever must leave a life of honesty and integrity has to be a rebel."
  },
  {
    "headline": "Osun APC members vote to elect party's governorship candidate -",
    "summarized_story": "Members of the ruling All Progressives Congress in Osun State are filling out at their various wards to vote to candidate of their choice.\nAt ward one in Osogbo local Government the party faithful had started arriving by 8 in the morning and are being accredited.\nAt Ward three also in Osogbo local Government, the exercise is going on smoothly as accreditation is underway.\nThe accreditation exercise is to be rounded off at noon after which voting will commence immediately and end at 2pm through option A4.\nAdvertisementThe state Commissioner for Special Duties and regional integration commended the peaceful conduct of members."
  },
  {
    "headline": "Zamfara APC Factions in War of Words over invasion of Court by Thugs -",
    "summarized_story": "The All Progressives Congress loyal to Senator Kabiru Marafa in Zamfara State is accusing the Matawalle Faction of sponsoring hoodlums to attack its Members and lawyers at the state high court in GusauThe Marafa faction says they were attacked shortly after a court sitting on the Ward, Local Government and State Congresses which held in the state in November 2021AdvertisementThey want security agencies to Investigate the incident and arrest perpetratorsAdvertisementAdvertisementThe Crisis between the Senator Kabiru Marafa faction of the APC and that of Governor Bello Matawalle started a few days after the formal Defection of Governor Bello Matawalle from the PDP to the Ruling APCThis time around, the Marafa faction is accusing the Zamfara state APC of Sponsoring thugs to attack its Lawyers and party members at the state high courtAdvertisementSpokesperson for the Marafa faction, Bello Bakyaswa says the attack was targeted at eliminating himHe calls on the security agencies to Investigate the incident and arrest perpetrators of the attackAdvertisementResponding to the allegations, Spokesperson of the Matawalle faction Yusuf Idris Gusau denies sponsoring thugs to attack the court, describing the allegations as false, baseless and is a sign of failure on the side of the accusersYusuf Idris insists that the party under Governor Bello Matawalle will not fold it’s hands and watch hoodlums disrupt the peace in the stateAdvertisementHe warns Politicians against using Politics to set the state on fire."
  },
  {
    "headline": "Aisha Yesufu: Nothing Can Be More Humane Than Reuniting Leah Sharibu With Her Family",
    "summarized_story": "Human rights activist and #BringBackOurGirls Campaigner, Aisha Yesufu, speaks about the significance of four years of Leah Sharibu in the clutches of terrorists."
  },
  {
    "headline": "Queen Elizabeth, 95, Tests Positive for Covid",
    "summarized_story": "The Queen has tested positive for Covid, Buckingham Palace has said.\nThe palace said the monarch is experiencing “mild cold-like symptoms” but expects to continue “light duties” at Windsor over the coming week.\n“She will continue to receive medical attention and will follow all the appropriate guidelines,” the palace said in a statement.\nThe Queen had been in contact with her eldest son and heir, the Prince of Wales, who tested positive last week.\nDetails later…"
  },
  {
    "headline": "Putin Oversees Nuclear Drills as US Insists Russia Plans to Invade Ukraine",
    "summarized_story": "U.S. Defense Secretary Lloyd Austin said Russian forces were beginning to “uncoil and move closer” to the border.\nRussia ordered the military build-up while demanding NATO prevent Ukraine from ever joining the alliance but says Western warnings that it is planning to invade Ukraine are hysterical and dangerous.\nThe Kremlin said Russia successfully test-launched hypersonic and cruise missiles at sea during the nuclear forces drills.\n“They reaffirmed that Russia could launch an attack against Ukraine at any time.”G7 foreign ministers called on Russia to choose the path of diplomacy.\nSHELLING ALLEGATIONSRussian-backed rebels seized a swathe of eastern Ukraine and Russia annexed Crimea from Ukraine in 2014."
  },
  {
    "headline": "Russia Planning Biggest War in Europe Since 1945, UK PM Johnson Says",
    "summarized_story": "Evidence suggests Russia is planning “the biggest war in Europe since 1945”, Prime Minister Boris Johnson has said.\nHe told the BBC’s Sophie Raworth in an interview: “All the signs are that the plan has already in some senses begun.”Intelligence suggests Russia intends to launch an invasion that will encircle Ukrainian capital Kyiv, Mr Johnson said.\n“People need to understand the sheer cost in human life that could entail,” he saidThe prime minister was speaking from Munich, where world leaders are meeting for an annual security conference.\nMr Johnson also indicated that the UK would bring in even more far-reaching sanctions against Russia than have been suggested before.\nPrevious sanctions suggested by ministers include broadening the range of Russian people and businesses the UK could target."
  },
  {
    "headline": "Ukraine’s Zelenskyy Calls on Putin to Meet as Tensions Soar",
    "summarized_story": "Zelenskyy said Russia could pick the location for the talks.\nZelenskyy spoke hours after separatist leaders in eastern Ukraine ordered a full military mobilization on Saturday while Western leaders made increasingly dire warnings that a Russian invasion of its neighbor appeared imminent.\nIn new signs of fears that a war could start within days, Germany and Austria told their citizens to leave Ukraine.\nMeanwhile, top Ukrainian military officials came under a shelling attack during a tour of the front of the nearly eight-year separatist conflict in eastern Ukraine.\nMedia reports on Saturday described chaos at some of the camps assigned to accommodate the people from eastern Ukraine."
  }
]