[
  {
    "headline": "Community devt: Fintiri presents merit award to four corps members",
    "summarized_story": "Governor of Adamawa state, Ahmadu Fintiri has presented the state’s National Youth Service Corps Merit Award to four corps members for their outstanding performances during the service year.\nFintiri made the presentation at the passing out parade of 2021 Batch ‘A’ Stream 1 corps members, on Thursday in Yola.\nFintiri who was represented by Commissioner of Youth, Aloysius Babadoke, said the service year had exposed the corps members to the realities of life and equipped them adequately for the future.\nHe congratulated the outgoing corps members and urged them to follow in the footsteps of their predecessors in the area of skills acquisition to be self-employed and job creators.\nThe NYSC Coordinator in Adamawa, Ibrahim Tukur, implored the outgoing corps members to remain good ambassadors of the scheme and responsible role models to other youths."
  },
  {
    "headline": "Kaduna Imam dies at 130, survived by 26 children, 290 grandchildren",
    "summarized_story": "The Chief Imam of Kafanchan Central Mosque, Sheikh Adam Tahir, has died at the age of 130 years.\nHe was survived by 26 children, 290 grandchildren, and more than 200 great-grandchildren, according to NAN.\nDeputy Chief Imam of Kafanchan, Alhaji Muhammad Kassim, said Sheikh Adam died on Wednesday evening after an illness.\nKassim said the late Imam would be greatly missed by Muslim faithful as he was a role model to all.\nIn a condolence message, the Emir of Jema’a, Alhaji Muhammad Isa Muhammad II, described the death of the imam as a huge loss to the emirate and to the people of southern parts of Kaduna State."
  },
  {
    "headline": "Fuel Scarcity: FG deploys surveillance teams to Lagos petrol stations",
    "summarized_story": "The Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) on Thursday, deployed seven ad-hoc surveillance teams to monitor petrol stations across Lagos State.\nRight now in Lagos, as of Wednesday morning, we had over 128 million litres in our depots.\n“We have five vessels that are currently discharging since Feb. 15, and they will also bring in about 204 million litres.\nAlso Read:Dirty fuel, an avoidable evil“So in total, in Lagos, we are looking at about 332 million litres within our system.\nAs of Wednesday, we have trucked out about 37 million litres with 885 trucks."
  },
  {
    "headline": "Amotekun intercepts trailer-load of cows hiding 63 northerners, 25 okada",
    "summarized_story": "*… they hid in trailer loaded with rams, registered motorcyclesBy Dayo Johnson, AKUREOndo State Amotekun said it has arrested 63 Northerners hidden in a trailer loaded with rams and motorcycles, at Iju, in Akure North council area of the state.\nThe suspects claimed to be coming from Gombe State and travelling to Lagos, when they were arrested by personnel of the security outfit.\nThe driver of the trailer, marked Kano AB234BDJ, Salisu Ahmed, told newsmen that they took off from Jigawa State en route to Lagos.\nHow they were arrested — CommanderBriefing newsmen, the Amotekun Commander, Mr. Adetunji Adeleye, said: “Our men, while on duty, saw a trailer filled with rams and motorcycles.\n“They were arrested along Iju road and while searching the vehicle, we realised they were not carrying only rams, but also carrying 63 persons, 10 registered motorcycles with Yoruba names and 15 unregistered motorcycles as well as 240 rams in the truck."
  },
  {
    "headline": "Man allegedly lures 4-year-old girl into his room, defiles her",
    "summarized_story": "A Kaduna High Court on Thursday ordered that a 34-year-old labourer Umar Adamu, who allegedly defiled a four-year-old girl be remanded in a correctional centre.\nThe police charged Adamu, who resides in Pala Village of Anchau Local Government Area of Kaduna State with defilement.\nA. Bello, who declined to admit the defendant to bail, ordered that he should be remanded in a Kaduna correctional centre.\nThe Prosecution Counsel, Florence Hassan told the court that the defendant defiled the minor on Jan. 24.\nShe said the offence contravened the provisions of Section 257 and is punishable under Section 258 of the Penal Code of Kaduna State, 2020(as amended)."
  },
  {
    "headline": "OPEC, Sylva, NNPC to discuss upstream, Nigerian gas market",
    "summarized_story": "Organisation of Petroleum Exporting Countries (OPEC), Ministry of Petroleum Resources, Nigerian National Petroleum Corporation (NNPC) Limited and other stakeholders are set to canvassed for a diversified market for Nigeria’s huge gas resources and woo investors into the upstream segment of the country’s oil and gas industry.\nWithout proactive action, Nigeria and other Africa countries may be unable to harness existing crude oil reserves.\n“Nigeria is attending the CERAWEEK with a high level delegation that includes Sylva, Kyari, NNPCLimited’s Bala Wunti, Oritsemeyiwa Eyetan, who is the Group General Manager, Corporate Planning, NNPC and many others.\nThey will present and seek investment opportunities for Nigeria, the African number one producer.\n“The Nigeria Energy Forum is also organised alongside the CERAWEEK 2022 to give Nigeria a stand -alone opportunity to present its core opportunities to a uniquely targeted audience, collaborate and network with stakeholders for business optimization,” Oputa said."
  },
  {
    "headline": "Youths in Creative industry should emulate Hauwa De Zuzu style- Lagos monarch, Don, others",
    "summarized_story": "They stated this at the unveiling ceremony of the luxury and lifestyle brand produced by Hauwa de Zuzu tagged; “ASIWAJU”, in Lagos.\nThe monarch, meanwhile, urged young people to emulate such initiative and stop looking for white-collar jobs that are not readily available anymore.\nThe Don encouraged youths, who were into arts and fashion, to look inward as well as cultivate habits of sourcing their materials for creative works locally.\nThe creative Director for Hauwa De Zuzu, however, stated that HDZ has been a passion project for quite some time before it was fully delivered in 2019.\nZuzu means beauty and confidence, all these attributes are merged to describe the perfect aesthetic Hauwa de Zuzu (HDZ) woman."
  },
  {
    "headline": "Real reason Abia cattle market was attacked – HURIWA makes claims",
    "summarized_story": "Human Rights Writers Association of Nigeria, HURIWA, has blamed members of the deep state and foreign mercenaries for executing the vicious attacks on the Abia State cattle market.\nWe do not think the Eastern Security Network or the now proscribed Indigenous Peoples of Biafra (IPOB) are responsible for the Abia attacks.\nWe believe even strongly that FIFTH columnists are out to destabilize the South East of Nigeria,” the group said.\nHURIWA recalled that the Abia State Government had confirmed the reported attack by yet-to-be identified gunmen on the newly constructed cattle market in Omumauzor in Ukwa West Local Government Area of the state.\nThe Northerners living in the East are like every Igbo person and so the Igbos respects the sanctity of life,” the group said."
  },
  {
    "headline": "Fuel scarcity: Kwara govt warns dealers against hoarding",
    "summarized_story": "As fuel scarcity persists across the country, the Kwara State Government has warned fuel dealers against hoarding the product.\nThe government, according to the state Commissioner for Business Innovation and Enterprise, Hajia Arinola Lawal, will not hesitate to seal up erring fuel stations.\nLawal issued the warning while on the monitoring exercise of fuel stations in the Ilorin metropolis to assess the situation.\nShe condemned fuel hoarding, saying the poor masses might be at the receiving end.\nShe charged fuel dealers to follow laid down procedures by the law in their daily activities."
  },
  {
    "headline": "Living Faith: How I became billionaire – Bishop Oyedepo reveals ‘secret’ of wealth",
    "summarized_story": "Bishop David Oyedepo of Living Faith Church has revealed the secret of his wealth.\nOyedepo, who is the founder of Living Faith Church, disclosed that he became a billionaire by obeying God’s word.\nOyedepo said no one would ever have made it happen without lining up with God’s word.\nAccording to Oyedepo: “God is not a taskmaster.\nSir, from N1 position, you are taking a strong position in obeying God."
  },
  {
    "headline": "NDLEA cocaine bust: Police Commission suspends Abba Kyari’s men, wants ASP Umoru arrested",
    "summarized_story": "Police Service Commission (PSC) has suspended officers indicted by the National Drug Law Enforcement Agency (NDLEA) along with suspended DCP Abba Kyari.\nAn NDLEA covert operation exposed the personnel as collaborators in a 25kg cocaine deal involving an international narcotics cartel.\nThe suspension, in accordance with the provisions of the Public Service Rules 030406, will remain effective until the outcome of the investigation.\nBaba was also requested to place on suspension Inspector Simon Agrigba and Inspector John Nuhu in accordance with the Powers of Delegation.\n“DCP Abba Kyari, who prior to this allegation was on suspension, shall remain so until the conclusion of investigations”, it read."
  },
  {
    "headline": "Zamfara APC: Court adjourns Marafa vs Matawalle case till March",
    "summarized_story": "The Zamfara State High Court has adjourned the suit filed by Senator Kabiru Garba Marafa against the state All Progressives Congress (APC) under Governor Bello Mohammed Matawalle challenging the legality of their congresses.\n“Senator Kabiru Marafa is a chieftain of the party and has the constitutional right to challenge the illegality of the Congresses conducted by Governor Matawalle’s faction,” Shaka said.\nBarrister Shaka said that they are praying the court to declare the congresses illegal and order for fresh congresses from ward to state levels.\nIn his own speech, the leading counsel to the Matawalle’s faction, Barrister Shiaka M Dikko said the court has no jurisdiction to entertain the case because Marafa has ceased to be a member of the APC.\nHe also stated that the court will begin hearing of the case on 14th March 2022 which he said would be a legal battle."
  },
  {
    "headline": "Again, NNPC Apologises to Nigerians, Reveals Five Vessels of Substandard Fuel Rejected",
    "summarized_story": "“For this current situation, I assure you that we have taken every necessary step to restore supply into this country.\nThe statement added that it was working with the regulatory authorities and the Nigerian National Petroleum Company (NNPC) Limited towards a resolution of the current fuel crisis.\nMost importantly, Adeosun maintained that MOMAN members had committed resources towards enhanced operations and associated activities to reduce the burden of the current fuel scarcity to customers.\nNANS also bemoaned the serious fuel supply disruption across the country occasioned by the importation of bad petrol, allegedly, by some approved dealers of the NNPC.\nThe association demanded a speedy resolution of all issues and the normalisation of fuel supply across the country to ameliorate the hardship being experienced by Nigerians."
  },
  {
    "headline": "APC Governors Divided over National Convention, Choice of Consensus",
    "summarized_story": "On the other hand, a third group of governors also want the convention to hold, and for Buni to continue or the convention postponed.\nThe inside source stated, “We are now looking at March for possible date for the national convention.\nIt was learnt that the two governors met with the president last week, where they sold the idea of Senator Sani Musa as a consensus national chairman of the APC.\nBut other APC governors on hearing of the meeting rejected the choice of Musa, and insisted it was not made with their consent.\nBut the crisis rocking APC, insiders said, was compounded by the inability of the convention committee to announce a zoning formula for the national convention."
  },
  {
    "headline": "Police Report to AGF Says Kyari Violated Code of Conduct for Law Enforcement Officers",
    "summarized_story": "But the Chairman/Chief Executive of the National Drug Law Enforcement Agency (NDLEA), Brig.\n“Similarly, he violated the Nigeria Police Code of Professional Ethics by accepting complaints on such without recourse to established protocols.\nHe also received the sum of N44m in multiple transactions from DCP Abba Kyari,” the report stated.\nHow did DCP Kyari think for a moment that he would be reinstated after the FBI fiasco?\nMarwa: Kyari’s Arrest, Clear Message NDLEA is CommittedThe Chairman/Chief Executive of the National Drug Law Enforcement Agency (NDLEA), Brig."
  },
  {
    "headline": "Massive Oil Theft, High Pipeline Repairs Cost, Bleeding Nigeria’s Economy",
    "summarized_story": "A THISDAY analysis showed that at a projected 1.86 million barrels per day in 2021, the country recorded nearly 200 million barrels’ crude deficit, out of a possible 700 million barrels yearly, in the first 11 months of the year.\nKomolafe attributed the underperformance to mostly oil theft, sabotage, vandalism, as well as technical issues, including ruptures associated with the assets.\nIn a period of 10 years, he stated, an analysis by NEITI put losses to oil theft at $41.9 billion, about $4.1 billion per year.\nIn all, the government appears helpless, despite attempts in the past to reduce the incidence of vandalism and oil theft.\nSince this year, Wike has repeatedly accused the Nigeria Police and Nigeria Security and Civil Defence Corps (NSCDC) of connivance."
  },
  {
    "headline": "Buhari Accuses National Assembly of Inserting N887bn into 2022 budget",
    "summarized_story": "This was just as the president has asked the National Assembly to amend the 2022 Appropriation Act passed by the National Assembly in December, 2021.\nBuhari in the letter, he also said it was imperative to remove all capital projects that were replicated in the 2022 Appropriation Act.\n“It is therefore necessary to transfer the National Assembly’s expenditures totaling N16.59 billion in the Service Wide Vote to National Assembly Statutory Transfer provision (see Schedule l).\nHe said: “Following the suspension of the petrol subsidy removal, the 2022 Budget Framework has been revised to fully provide for PMS subsidy.\n“Therefore, the amount available to fund the federal budget is projected to decline by N969.09 billion.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "UPDATED: Police Service Commission Suspends Alleged Cocaine-Dealing Cop, Abba Kyari's Men, Directs Police Inspector-General To Suspend Two Inspectors",
    "summarized_story": "The Police Service Commission (PSC) has suspended Assistant Commissioner of Police, Sunday Ubua, and Assistant Superintendent of Police, James Bawa, from the exercise of the powers and functions of their respective offices with effect from Monday, February 14, 2022.\nThe two police officers were working under the suspended DCP Abba Kyari in the Intelligence Response Team of the Force Investigation and Intelligence Department of the Nigeria Police Force.\nThe Inspector-General of Police was requested to place on suspension Inspector Simon Agrigba and Inspector John Nuhu in accordance with the Powers of Delegation.\nThis came on the trail of his controversial involvement with self-confessed Internet fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe latest scandal involving the suspended Kyari came to the fore on Monday, a few hours after the super cop was declared wanted by the NDLEA over his involvement in a 25 kilogrammes cocaine deal."
  },
  {
    "headline": "UPDATED: Police Service Commission Suspends Alleged Cocaine-Dealing Cop, Abba Kyari's Men, Directs Police Inspector-General To Suspend Two Inspectors",
    "summarized_story": "The Police Service Commission (PSC) has suspended Assistant Commissioner of Police, Sunday Ubua, and Assistant Superintendent of Police, James Bawa, from the exercise of the powers and functions of their respective offices with effect from Monday, February 14, 2022.\nThe two police officers were working under the suspended DCP Abba Kyari in the Intelligence Response Team of the Force Investigation and Intelligence Department of the Nigeria Police Force.\nThe Inspector-General of Police was requested to place on suspension Inspector Simon Agrigba and Inspector John Nuhu in accordance with the Powers of Delegation.\nThis came on the trail of his controversial involvement with self-confessed Internet fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe latest scandal involving the suspended Kyari came to the fore on Monday, a few hours after the super cop was declared wanted by the NDLEA over his involvement in a 25 kilogrammes cocaine deal."
  },
  {
    "headline": "BREAKING: Police Service Commission Suspends Alleged Cocaine-Dealing Cop, Abba Kyari's Men, Directs Police Inspector-General To Suspend Two Inspectors",
    "summarized_story": "The Police Service Commission has called for the immediate suspension of officers attached to the Intelligence Response Team (IRT) under the leadership of disgraced police chief, Abba Kyari.\nAlso, the Commission has directed the Inspector General of Police, Usman Alkali Baba to suspend two other inspectors.\nThis came on the trail of his controversial involvement with self-confessed Internet fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe FBI also alleged that the embattled social media celebrity sent money to Kyari via a third person’s bank account and hosted him in his Dubai apartment.\nThe latest scandal involving the suspended Kyari came to the fore on Monday, a few hours after the super cop was declared wanted by the NDLEA over his involvement in a 25 kilogrammes cocaine deal."
  },
  {
    "headline": "BREAKING: Police Service Commission Suspends Alleged Cocaine-Dealing Cop, Abba Kyari's Men, Directs Police Inspector-General To Suspend Two Inspectors",
    "summarized_story": "The Police Service Commission has called for the immediate suspension of officers attached to the Intelligence Response Team (IRT) under the leadership of disgraced police chief, Abba Kyari.\nAlso, the Commission has directed the Inspector General of Police, Usman Alkali Baba to suspend two other inspectors.\nThis came on the trail of his controversial involvement with self-confessed Internet fraudster, Ramon Abbas, popularly known as Hushpuppi.\nThe FBI also alleged that the embattled social media celebrity sent money to Kyari via a third person’s bank account and hosted him in his Dubai apartment.\nThe latest scandal involving the suspended Kyari came to the fore on Monday, a few hours after the super cop was declared wanted by the NDLEA over his involvement in a 25 kilogrammes cocaine deal."
  },
  {
    "headline": "IPOB, Eastern Security Network Members Behind My Drug Trafficking Travails –Disgraced ‘Super Cop’, Abba Kyari",
    "summarized_story": "The embattled Deputy Commissioner of Police, Abba Kyari, has claimed that members of the Indigenous People of Biafra (IPOB) and Eastern Security Network (ESN) are behind his travails.\nKyari made this claim when he appeared before a probe panel led by Joseph Egbunike, a Deputy Inspector-General of Police (DIG) at the Force Headquarters, Abuja, Daily Trust reports.\nKyari, who did not deny violating social media rules of the Nigeria Police Force (NPF), was berated by the panel for the fact that the officer had been warned against the same practice previously.\nSee Also Breaking News BREAKING: Nigerian Anti-drug Agency, NDLEA Starts Grilling Disgraced Police Officer, Abba Kyari, Other CollaboratorsBut the panel, which faulted his claim, saying it is watery, ordered his demotion from the rank of Deputy Commissioner of Police to Assistant Commissioner of Police.\n“Kyari also allegedly sent Abbas bank account details for an account into which Abbas could deposit payment for Vincent’s arrest and imprisonment.”"
  },
  {
    "headline": "Jibrin risks dismissal as FHA panel summons him over 'serious misconduct'",
    "summarized_story": "A disciplinary panel of the Federal Housing Authority (FHA) has summoned Abdulmumin Jibrin, an executive director of the agency, over alleged misconduct.\nJibrin was appointed executive director (business development) of FHA in August 2020.\nAdvertisementIn the letter seen by TheCable on Thursday, Salihu said the former lawmaker is expected to appear before his panel on Friday at FHA’s office in Abuja.\nThe said misconduct was not mentioned in the letter but Jibrin has been actively campaigning for Bola Tinubu, a presidential aspirant, which is against public service rules.\nAdvertisement“Please recall the query issued to you by the Managing Director/CEO over allegations of serious misconduct in the course of your official duties, and your deliberate refusal to respond to the query as required by the Rules of Public Service as applicable to public officers,” he said."
  },
  {
    "headline": "Jibrin risks dismissal as FHA panel summons him over 'serious misconduct'",
    "summarized_story": "A disciplinary panel of the Federal Housing Authority (FHA) has summoned Abdulmumin Jibrin, an executive director of the agency, over alleged misconduct.\nJibrin was appointed executive director (business development) of FHA in August 2020.\nAdvertisementIn the letter seen by TheCable on Thursday, Salihu said the former lawmaker is expected to appear before his panel on Friday at FHA’s office in Abuja.\nThe said misconduct was not mentioned in the letter but Jibrin has been actively campaigning for Bola Tinubu, a presidential aspirant, which is against public service rules.\nAdvertisement“Please recall the query issued to you by the Managing Director/CEO over allegations of serious misconduct in the course of your official duties, and your deliberate refusal to respond to the query as required by the Rules of Public Service as applicable to public officers,” he said."
  },
  {
    "headline": "Panic as fire guts Nigerian Law School campus in Lagos",
    "summarized_story": "There was panic at the Lagos campus of the Nigerian Law School on Wednesday night after a fire broke out causing a stampede.\nAdvertisementA source told TheCable Lifestyle on Thursday morning that the fire was due to an electrical fault at the institution situated at the Ozumba Mbadiwe street in the Victoria Island axis of the state.\nThe fire was due to an electrical fault,” the source said.\nAdvertisementThe fire was said to have started at around 10 pm from the first floor of the five-storey building hostel housing over 1,500 law graduates.\nIn a now-viral video of the fire incident, a student could be heard screaming amid sparks from the electrical cables."
  },
  {
    "headline": "Panic as fire guts Nigerian Law School campus in Lagos",
    "summarized_story": "There was panic at the Lagos campus of the Nigerian Law School on Wednesday night after a fire broke out causing a stampede.\nAdvertisementA source told TheCable Lifestyle on Thursday morning that the fire was due to an electrical fault at the institution situated at the Ozumba Mbadiwe street in the Victoria Island axis of the state.\nThe fire was due to an electrical fault,” the source said.\nAdvertisementThe fire was said to have started at around 10 pm from the first floor of the five-storey building hostel housing over 1,500 law graduates.\nIn a now-viral video of the fire incident, a student could be heard screaming amid sparks from the electrical cables."
  },
  {
    "headline": "Police commission suspends DCP Kyari's men named in cocaine deal",
    "summarized_story": "The Police Service Commission (PSC) says it suspended two police officers — Sunday Ubua and James Bawa — named in the cocaine deal involving Abba Kyari, suspended deputy commissioner of police.\nOn Monday, the National Drug Law Enforcement Agency (NDLEA) declared Kyari wanted over alleged links with an international drug cartel.\nThe police arrested Kyari, Ubua, Bawa, and John Nuhu for “tampering with narcotic exhibits and unprofessional infractions” and handed them to the anti-drug agency.\nThe spokesperson of the PSC said the commission asked Usman Baba, inspector-general of police, to suspend two police inspectors — Simon Agrigba and John Nuhu.\n“They were also alleged to be involved in the current cocaine seizure and transfer to the National Drug Law Enforcement Agency."
  },
  {
    "headline": "Africa’s young population is driving a gaming market revolution",
    "summarized_story": "This article is contributed to TechCabal by Conrad Onyango/bird story agencyFrom consoles to smartphones, Africa’s growing, tech-savvy population is driving significant growth in the multi-million dollar gaming industry as increased adoption of digital currencies and blockchain technology takes African gaming to the next level.\nUsiku Games Africa, a Kenyan based Social Impact gaming company is pioneering the new era of blockchain gaming in the country where the rising number of tech-savvy youth could soon start earning from the industry boom.\nKenya and Ethiopia finish fourth and fifth largest gaming markets in the continent with 22 percent and 13 percent of their population into gaming respectively.\nAccording to Newswagg’s, 80 percent gamers with crypto accounts are interested in using digital currency for gaming purchases, with 67 percent yearning for an opportunity to use cryptocurrency in gaming.\nGlobal crypto gaming was valued at 321 million US dollars in 2020."
  },
  {
    "headline": "Inside NVIDIA plans to develop Africa’s AI ecosystem",
    "summarized_story": "In 2019, Africa’s AI ecosystem raised $11.27 million—up by 223% from the $3.6 million in 2018—and Tunisia’s InstaDeep $7 million raise represents 62% of the total investment made that year in the ecosystem.\nThrough this programme, InstaDeep was able to buy its first NVIDIA DGX Station, an AI system that brings AI supercomputing to data science teams.\nFast forward to today, NVIDIA has grown to become the pioneer of the modern AI, deep learning, and machine learning market.\n“Africa is a hugely important market for NVIDIA, which is why we are working within its developer ecosystem,” NVIDIA said in an email.\nThis is why NVIDIA is taking a different approach to engage with Africa’s AI ecosystem."
  },
  {
    "headline": "Flutterwave secures $250m Series D with valuation at over $3bn",
    "summarized_story": "Nigeria-based fintech giant Flutterwave has raised $250 million in Series D funding, its single-biggest investment to date, valuing the company at over $3 billion.\nThe investment was led by B Capital Group with participation from new investors Alta Park Capital, Whale Rock Capital, Lux Capital, among others and existing ones, including Glynn Capital, Avenir Growth, Tiger Global, Green Visor Capital, and Salesforce Ventures.\nThe Series D fundraise comes on the back of an impressive run of five years in which Flutterwave has processed over 200 million transactions worth over $16 billion to date across 34 countries in Africa.\nIt also follows a year of rapid growth for the brand which now serves over 900,000 businesses across the globe.\nThis latest fundraising sees its valuation more than triple since its last funding round in March last year, when it raised $170 million in Series C to push its valuation as of then to over $1 billion."
  },
  {
    "headline": "Is Africa’s tech startup ecosystem set for a debt financing boom?",
    "summarized_story": "Okoudjou’s statement came after the pan-African fintech giant closed a $100 million Series C financing round—split between $70 million equity and $30 million debt.\n“Debt investors usually look for predictable cash flows or transferable assets (such as real estate) to secure their exposures.\nAccording to Ayobamigbe Teriba, an ex-analyst at Ingressive Capital, debt financing is viable to businesses but tricky.\nIt participated in MFS Africa’s $100 million funding round with $30 million debt and has backed many startups in Africa.\nShort-term debt financing can also be accessed if it is backed by inventory; for example, e-commerce retailers and their suppliers."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Learning the VC game, Flutterwave’s $3bn valuation and CrowdForce’s $3.6m raise",
    "summarized_story": "AdvertisementToday, we’re discussing:Why female founders should learn the venture capital gameFlutterwave’s $3bn valuationCrowdForce’s $3.6m pre-Series AWomen should play the VC gameIn 2021, women got less than 1% of startup funding.\nAccording to her, women need to learn the rules of the VC game and know what works and what doesn’t.\nIn her chat with Chimgozirim, she detailed the rules and tactics that could mean better odds for women in winning the venture capital game.\nRead all about it here: Female founders need to learn how to play the venture capital game– Sarah DusekFlutterwave’s $3bn valuationFlutterwave has come a long way since it was founded in 2016.\nAway from fintech: Flutterwave also displayed interest in the creator economy with the acquisition of Disha, a platform that allows creators to curate content and receive payment."
  },
  {
    "headline": "Female founders need to learn how to play the venture capital game — Sarah Dusek",
    "summarized_story": "Share this article:A cursory look at the venture capital landscape in Africa will reveal an impressive number of deals and the triumph of innovation over regulation.\nAccording to Sarah Dusek, Managing General Partner at Enygma Ventures, who spoke to Techpoint Africa on Zoom, a second reason is that most women don’t know how to play the venture capital game.\nWith venture capital a novel concept in Africa, not too many people, regardless of gender, understand how it works.\nThat decision birthed Enygma Ventures, a sector-agnostic firm providing women with the capital required to scale and grow their businesses.\nVenture capital is, in many ways, a numbers game, and the more women there are building companies that investors like, the higher the chances of women receiving investments."
  },
  {
    "headline": "Local competition for Uber, Wasla raises $9 million, MoneyHash’s pre-seed round",
    "summarized_story": "Today on Techpoint Digest:Local competition for UberWasla’s $9 million raiseMoneyHash’s pre-seed fundingLocal competition for Uber?\nThe startup has announced an investment of $9 million from Contact Financial Holding, a financial services provider in Egypt.\nFollowing the fresh injection of capital, the startup plans to introduce buy now, pay later options and a new online payment option for its users.\nThey’re very technologically advanced, and their adoption of eCommerce is quite good.”MoneyHash’s pre-seed fundingAccepting payments is a significant challenge for businesses across the globe.\nMoneyHash, an Egyptian startup, has raised $3 million in pre-seed funding for this purpose after launching in 2021."
  },
  {
    "headline": "SERMON: THIS DRUNKENNESS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest1 “ Wine is a mocker strong drink is raging and whosoever is deceived thereby is not wise” Prov.\nNow therefore, beware, I pray thee and drink not wine or strong drink, and eat not any Maclean thing.” Judges 13:3-4 she obeyed God.\nMany have been deceived into alcohol because they see Priests and Pastors who drink alcohol.\nWhat you have to do now if you still drink alcohol, is to come truly to Christ and surrender your life to him and ask for a new life.\nRemember that all that God would use would be filled with the Holy Spiritand not with alcohol or strong drink."
  },
  {
    "headline": "Presidency faults reports by IMF, others on Nigeria debt profile – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Presidency on Tuesday faulted the recent reports by International monetary fund (IMF) and Agusto and CO. on the growth of Nigeria’s debt service and debt levels over the years.\nA press statement emanating from the office of the Debt management office, Abuja and made available to the Nigerian OBSERVER in Benin City yesterday Stated that the author of the alleged evil reports have failed to consider the challenges experienced by Nigeria in recent times as a result of two recessions, sharp drop in Revenues and security challenges.\nThe presidency further noted that the analysis as reported do not acknowledged the improvements in infrastructure which have been achieved through borrowing as well as the strong measures by the Government to grow revenues.\nAccording to the Presidency, “The DMO reiterated the fact that the Government is already implementing policies towards increasing revenues and developing infrastructure through Public Private Partnership arrangements both of which improve debt sustainability”.\nContinuing, the DMO also noted that the Government has active and regular engagements with the IMF on borrowing and debt management, adding that with this case the reports have fail to consider the challenges experienced by Nigeria in recent times."
  },
  {
    "headline": "Industrialisation: 2,500bpd modular refinery, 5MW power plant, others set to go live in Edo next month – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Barring any last-minute changes, a 2,500 barrel per day (bpd) modular refinery, five megawatts power plant, 40-million-scf gas processing facility, and a data centre, among others, will come on stream in Edo State in March, 2022, after necessary regulatory certifications from the Nigerian Midstream and Downstream Regulatory Authority (NMDRA).\nThe company plans to develop the park in phases, with the first phase comprising a 10,000 barrel per day refinery, 60-million-scf gas processing facility, 10-million-scf compressed natural gas (CNG) facility, 50 megawatts power plant and a data centre.\nThe project is financed by the First City Monument Bank (FCMB), Nigerian Content Development & Monitoring Board (NCDMB), among others.\nChief Executive Officer of the DMCL, Dr. Akintoye Akindele, during an inspection of the facility, said the plant will be ready by the end of March.\nIn that way, we will be able to utilize assets optimally, avoid wastage, look after the environment and create jobs,” he said."
  },
  {
    "headline": "Revamped Edo College of Education kicks off academic activities Q3 2022 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said the newly revamped multi-campus Edo College of Education with sites in Igueben, Abudu and Afuze, will begin academic activities before the end of 2022.\nThe government, however, said the academic calendar of the defunct College of Education in Igueben will not be truncated, promising that students of the defunct college will graduate as and when due.\n“Edo College of Education is yet to take off but the College of Education, Igueben no longer exists.\nIgueben is the main campus and it will focus on training secondary school as well as technical and vocational education teachers.\nAbudu is one of the campuses focusing on training early childhood and basic education teachers."
  },
  {
    "headline": "PSC Recommends Suspension of Abba Kyari’s Men Over Drug Cartel Links",
    "summarized_story": "The Police Service Commission (PSC), has recommended the immediate suspension of officers attached to the Intelligence Response Team (IRT) under the leadership of suspended DCP, Abba Kyari.\nThe Commission equally directed the Inspector General of Police, Usman Alkali Baba to suspend two other inspectors.\nKyari was on Monday declared wanted by the National Drug Law Enforcement Agency (NDLEA) for selling cocaine consignment seized by IRT.\nHe was subsequently arrested by the police who handed him over to NDLEA.\nMore subsequently…"
  },
  {
    "headline": "U.S. Consulate AWE Alumna Trains 70 Youths on Digital and Management Skills",
    "summarized_story": "The U.S. government says it is committed to supporting economic and human development initiatives that help create job opportunities and facilitate improved sustainable economic growth and development.\nThe employability training program is aimed at creating more job opportunities for youths in the state, reducing unemployment and improving economic growth, and will also equip participants with digital and management skills that will enable them contribute to the growth of various organizations.\nAfter an intensive six weeks training, more than 70 youths participated in the first cohort graduation ceremony, which was held at the American Space in Ikeja, Lagos.\nSpeaking at the event, U.S. Consulate Public Affairs Officer Stephen Ibelli highlighted the importance of small businesses in spurring economic growth and boosting shared prosperity.\n“For Nigeria to succeed, the men and women who create businesses or hope to develop new businesses and job opportunities must succeed."
  },
  {
    "headline": "Senate confirms nine nominees as NPC, NERC Commissioners",
    "summarized_story": "The Senate on a Wednesday confirmed five nominees appointed by President Muhammadu Buhari as Commissioners of the National Population Commission (NPC).\nAlso confirmed were four other nominees as Commissioners of the Nigerian Electricity Regulatory Commission (NERC).\nThe nominees confirmed as Commissioners of the National Population Commission include: Chief Engr.\nIn addition, the four nominees confirmed as Commissioners of the Nigerian Electricity Regulatory Commission were Dr. Yusuf Ali (North Central), Engr.\nChidi Ike (South East), Mr. Nathan Rogers Shatti (North East), and Mr. Dafe Akpeneye (South South)."
  },
  {
    "headline": "Senate confirms Chidinma Osuji as NDIC Executive Director",
    "summarized_story": "The Nigerian Senate has confirmed the nomination of Mrs. Emily Chidinma Osuji as Executive Director of the Nigerian Deposit Insurance Corporation (NDIC).\nThe confirmation of the nominee on Wednesday, followed the consideration of the report of the Committee on Banking, Insurance and Other Financial Institutions, a statement by Ezrel Tabiowo, media aide to President of the Senate, said.\nChairman of the Committee, Senator Uba Sani (Kaduna Central), in his presentation, said “the office of the Executive Director (Corporate Services) of the Corporation remains vacant following the end of the tenure of the previous occupant.”He however explained that Mrs. Osuji’s nomination by President Muhammadu Buhari was duly in accordance with the provisions of Section 8 of the Nigerian Deposit Insurance Corporation Act, 2006.\nAccording to the lawmaker, “the nominee possesses the academic qualifications, technical knowledge and professional experience to be Executive Director of the NDIC.”He disclosed that the Committee did not receive any petition against her nomination, adding that Osuji was “cleared by the Nigeria Police, Department of State Services (DSS) and possesses the Code of Conduct Acknowledgement slip.”The nominee was, thereafter, confirmed by the Senate."
  },
  {
    "headline": "Osinbajo Is Buhari’s ‘Personal Person’ – Kannywood Stars",
    "summarized_story": "According to a statement by his media aide, Laolu Akande, Prof. Osinbajo said this on Wednesday evening when he received at the Presidential Villa, the Kannywood delegation.\nADVERTISEMENTIn the past, we brought you this song, now we have come with the song again, Osinbajo and Baba Buahri.\nBuhari is fixing the country for us”Chorus: Osinbajo of Baba Buhari.\nProf. Osinbajo noted that the Buhari administration will continue to ramp up efforts to improve security across the country.\n“We are very fortunate that God gave us a leader like President Muhammadu Buhari at the time we are facing."
  },
  {
    "headline": "BREAKING: Ganduje Wins At Appeal Court, Takes Kano APC From Shekarau Faction",
    "summarized_story": "The Court of Appeal in Abuja has set aside the judgment of an FCT High Court which validated the ward and local government congresses conducted by a faction of the Kano State chapter of the All Progressives Congress (APC), led by Senator Ibrahim Shekarau.\nWhile upholding all the three appeals filed by the faction loyal to the State governor, Dr. Abdullahi Umar Ganduje, the appellate court held that the lower court lacked jurisdiction to try the case.\nThe court presided over by Justices Haruna Tsammani, B. I. Gafai and J. Amadi, therefore, set aside the decision for lack of jurisdiction.\nADVERTISEMENTCounsel to the Shekarau faction, Nureini Jimoh, SAN, said it was shocking that they lost in all the three appeals at the appellate court.\n”The third ground is that even the originating process that were used to file the case was wrongly done as such even the originating process was set aside."
  },
  {
    "headline": "Arewa Group Condemns Killing Of 8 In Abia Cattle Market",
    "summarized_story": "The Arewa Youth Consultative Forum (AYCF) has condemned in very strong terms, the gruesome murder of eight persons and injuring several others at cattle market in Abia State.\nIt would be recalled that yet-to-be identified gunmen on Tuesday night invaded the newly constructed Abia cattle market in Omumauzor in Ukwa West local area of the State and killed eight cattle traders and inflicting injuries on others.\nA statement issued by the national president of AYCF, Alhaji Yerima Shettima, said the forum was deeply concerned about the murder of Northerners resident in Abia, who were doing legitimate businesses.\nWe have equally started the immediate relocation of the traders while working out compensation for lost properties.\nWe shall leave no stone unturned to ensure that the evil perpetrators are brought to justice”."
  },
  {
    "headline": "Arewa Group Condemns Killing Of 8 In Abia Cattle Market",
    "summarized_story": "The Arewa Youth Consultative Forum (AYCF) has condemned in very strong terms, the gruesome murder of eight persons and injuring several others at cattle market in Abia State.\nIt would be recalled that yet-to-be identified gunmen on Tuesday night invaded the newly constructed Abia cattle market in Omumauzor in Ukwa West local area of the State and killed eight cattle traders and inflicting injuries on others.\nA statement issued by the national president of AYCF, Alhaji Yerima Shettima, said the forum was deeply concerned about the murder of Northerners resident in Abia, who were doing legitimate businesses.\nWe have equally started the immediate relocation of the traders while working out compensation for lost properties.\nWe shall leave no stone unturned to ensure that the evil perpetrators are brought to justice”."
  },
  {
    "headline": "Climate Change: Federal Govt Backs AFNALPA’s 10m Tree Planting Campaign",
    "summarized_story": "The Federal Ministry of Environment has endorsed the campaign to plant 10 million trees in major locations across the country as a measure to combat desertification and effects of climate change.\nThe campaign is spearheaded by Association of Flower Nurseries and Landscaping Practitioners (AFNALPA).\nAccording to the correspondence, the campaign was in line with the Federal Government’s vision to ensure increment on forest cover.\nOn it’s part, AFNALPA noted that the campaign titled, “Plant A Tree; Save A Life” was in support of the United Nations (UN) climate change programme including the Great Green Wall initiative to plant 100 million trees in Africa.\n“We would soon unveil their “Plant a Tree and Save a Life Campaign” for Nigerians to key into and the proposed launch of the Abuja Horticulture Village and the 10 million tree planting campaign will take place at an event to mark its 10th anniversary,” Omoh stated."
  },
  {
    "headline": "Federal Government Finally React On ASUU Strike",
    "summarized_story": "Chris Ngige, the Minister of Labour and Employment, said on Wednesday that the Academic Staff Union of Universities’ current strike is a “leave” because the union failed to notify his ministry before going on strike.\nNgige, however, said, “I am sure you know NIREC which is headed by the sultan and the CAN president.\nWe were waiting for them to come back and then we heard they were going on strike.\n“ASUU failed to get back to us and proceeded on strike without sending notifications.\nIf you want to go on strike, you should at least inform us officially by giving us notification but they refused to."
  },
  {
    "headline": "BREAKING: Stampede As Fire Guts Lagos Law School",
    "summarized_story": "There was a stampede as fire broke out last night at the Lagos campus of Law School located on Ozumba Mbadiwe Street, Victoria Island.\nThere was a stampede in the hostel.\nA student jumped from the first floor where the fire started near the reading room.\nThe fire was however contained when hostel security officials put off the main electrical server switch before the arrival of Fire Service some minutes later.\nThe injured students are currently receiving medical attention at the school’s clinic."
  },
  {
    "headline": "Subsidy: NNPC Apologises To Nigerians Over Bad Fuel, Long Queues",
    "summarized_story": "The state’s NSCDC commandant, Iskil Makinde, made the arrest of the black marketers public after an on-the-spot assessment visits to some filling stations in Ilorin.\nMakinde said his men discovered that while some filling stations were hoarding fuel, others were selling at N250 per litre.\nThis fuel scarcity is a serious problem to us commercial drivers.\nSome of the vehicles had been at the filling stations as early as 5am as long queues were observed along Ondo Road, Cathedral and Arakale, Oba-Adesida roads among others.\nFuel scarcity is gradually biting hard in Damaturu and other parts of Yobe State with the resurfacing of long queues in filling stations where the product is available."
  },
  {
    "headline": "Ikoyi Building Collapse: Lagos To Demolish Other Skyscrapers, Prosecute Firm, Civil Servants",
    "summarized_story": "The last two projects being built near the 21-story skyscraper that fell on Gerrard Road in Ikoyi, Lagos, in November 2021, will be removed.\nThis is because the buildings failed structural integrity tests, a White Paper on the incident said.\nThe White Paper also said the remaining high-rise buildings will be pulled down through controlled demolition.\nThe firm developing the building that collapsed, Fourscore Homes Limited, will face criminal prosecution, the White Paper on the incident said.\nA new committee, which reviewed the tribunal’s 28 recommendations, was chaired by the Commissioner for Special Duties, Tayo Bamgbose-Martins."
  },
  {
    "headline": "[Breaking] Cocaine saga: PSC suspends Abba Kyari’s men, issues fresh directive to IGP",
    "summarized_story": "PSC Head, Press and Public Relations, Ikechukwu Ani, in a press statement, Thursday in Abuja, said the senior officers: IRT second in Command, ACP Sunday Ubua, and Assistant ASP James Bawa, have been suspended from the exercise of the powers and functions of their respective offices.\n“The two police officers were working under the suspended DCP Abba Kyari in the Intelligence Response Team of the Force Investigation and Intelligence Department of the Nigeria Police Force.\nThey were also alleged to be involved in the current cocaine seizure and transfer to the National Drug Law Enforcement Agency (NDLEA),” the statement read in part.\n“The Commission’s decision was contained in a letter to the Inspector General of Police, dated February 16, 2022, and signed by Hon.\nJustice Clara B. Ogunbiyi, retired Justice of the Supreme Court and Honourable Commissioner 1 in the Commission for the Honourable Chairman, IGP Musiliu Smith (retd)."
  },
  {
    "headline": "Breaking: Salah scores as Liverpool tame Inter Milan, edge closer to Champions League quarter-final berth",
    "summarized_story": "Liverpool took a huge step towards the Champions League quarter-finals after scoring two late goals against Inter Milan in the San Siro.\nItalian champions Inter hit the bar through Hakan Çalhanoglu and were on top for long periods of the second half before Firmino struck in the 75th minute.\nBut Jurgen Klopp’s team had to dig deep as Inter looked the more threatening side after a strong start by the Premier League club.\nIn a fascinating match, Liverpool – who gave 18-year-old Harvey Elliott his first Champions League start – took the lead through Firmino’s glancing 75th-minute header before Salah doubled the lead eight minutes later.\nThere is still work to do for Klopp’s team but it is going to require something extra special from Inter to turn this tie around."
  },
  {
    "headline": "APC chair: Divided govs settle for North-central, zone scribe to South-south",
    "summarized_story": "Governors elected on the All Progressives Congress (APC) platform have zoned the position of the national chairman of the party to the North-central.\nThe governor s, who met under the aegis of Progressive Governors Forum (PGF), took the decision ahead of the February 26 APC National Convention.\nAPC had slated February 26, 2022 for its national convention in Abuja, but the issue of zoning has remained a major challenge the needed to contend with to avoid self-implosion.\n“The Forum of APC Aspirants for 2022 National Convention writes to intimate Your Excellency on the true state of affairs with the National Convention of our great party, the All Progressive Congress (APC).\nWhatever crises the party faces nationally today were birthed at the state levels owing to the overbearing disposition of some state governors."
  },
  {
    "headline": "Cocaine Saga: PSC Suspends Assistant Police Commissioner, ASP ‘Working Under’ Kyari",
    "summarized_story": "The Police Service Commission (PSC) has suspended an Assistant Commissioner of Police (ACP), Sunday Ubua, and Assistant Superintendent of Police (ASP), James Bawa, who both worked under the embattled Abba Kyari in the Intelligence Response Team of the Nigeria Police Force (NPF).\nThis was contained in a statement issued on Thursday by the Head of Press and Public Relations of the PSC, Ikechukwu Ani.\nAlso, the commission maintained that Kyari, who is in custody, remains suspended until investigations into the matter are completed.\nRELATEDAbba Kyari: PSC Postpones Decision, Insists On New Panel To Conduct Fresh InvestigationHushpuppi: Nigeria Collaborating With US, Extradition Of Abba Kyari Considered – AGFNDLEA Declares Abba Kyari Wanted For Drug TraffickingA Wanted ManBefore now, Kyari was declared wanted and arrested by the NDLEA over his links with an international drug cartel.\nThe former head of the IRT was subsequently suspended by the PSC and an investigation – which has been marred in controversy – launched into the claims."
  },
  {
    "headline": "Ikoyi Building Collapse: Fourscore Homes Will Face Criminal Prosecution, Says Lagos Govt",
    "summarized_story": "The Lagos State government has announced that Fourscore Homes Limited, the firm developing the 21-storey building that collapsed on Gerrard Road, Ikoyi, Lagos, on November 1, 2021, will face criminal prosecution.\nThis according to a statement made available to Channels Television on Thursday is following the recommendation contained in the White Paper on the incident.\nAlso recommended to face administrative disciplinary panel are all government officials involved in granting approval to the developer in 2019.\nThe white paper frowned at a situation in which Fourscore was builder and architect – all rolled into one.\n“This included all those that were involved in the 2019 approval of the collapsed building."
  },
  {
    "headline": "France, European Allies To Withdraw Troops From Mali After A Decade",
    "summarized_story": "France and its allies in a European force announced Thursday they would begin withdrawing troops from Mali after nearly 10 years fighting a jihadist insurgency.\nA statement signed by France and its African and European allies said that “multiple obstructions” by the ruling junta meant that the conditions were no longer in place to operate in Mali.\nThe decision applies to both France’s Barkhane force in the Sahel and the Takuba European force that Paris had been trying to forge along with its allies.\nFrance initially deployed troops against jihadists in Mali in 2013 but the insurgency was never fully quelled, and now new fears have emerged of a jihadist push to the Gulf of Guinea.\nEven after the pull-out from Mali, however, the allies vowed to remain engaged in fighting terror in other countries including Niger."
  },
  {
    "headline": "Fuel Queues Will ‘Vanish’ By Next Week, NNPC Assures Nigerians",
    "summarized_story": "﻿The Nigerian National Petroleum Company (NNPC) has assured that the fuel scarcity in the country will end soon.\n“For this current situation, let me assure you we have taken every necessary step to restore supply into this country.\n“The situation you’re seeing today, I can assure you by next week, it will vanish.\nThe situation led to long queues in major cities as many struggled to get the product.\nHoodlums have also reportedly taken advantage of the situation as millions of Nigerians queue for hours, staying late into the night to get fuel."
  },
  {
    "headline": "BioNTech To Ship Mobile COVID-19 Vaccine Labs To Africa",
    "summarized_story": "Germany’s BioNTech, which together with Pfizer developed the first mRNA vaccine against the coronavirus, said Wednesday it plans to ship mobile vaccine production units to Africa.\nBioNTech said it aims to establish the “first manufacturing facility in the African Union” in “mid-2022” and expects to ship the modular production units to Rwanda and/or Senegal.\nEarlier this month, South African biotech company Biologics announced it had produced the continent’s first coronavirus vaccine based on mRNA technology using the genetic code that another mRNA vaccine maker, Moderna, had made publicly available.\n– Meticulous production process –South Africa could “potentially” join the list of recipients of the mobile labs, BioNTech said.\nThe vaccine technology will be shared without the patents behind it being waived, as requested by a number of countries and NGOs."
  },
  {
    "headline": "Ango Abdullahi meets Obasanjo says \"We must strategize for the good of Nigeria\" -",
    "summarized_story": "The Convener of the Northern Elders Forum (NEF), Prof. Ango Abdullahi has disclosed that the country needed good tidings from the 2023 elections, hence the need to strategize.\nAbdullahi made this disclosure after about two hour meeting with former President, Chief Olusegun Obasanjo in Abeokuta on Tuesday evening.\nAdvertisementThis was contained in a release by Special Assistant on Media to the former President, Kehinde Akinyemi on Wednesday.\nYou are in the media and you know what we have been saying about the situation in the country.\nThings are not good enough and as we head for 2023, we hope to be strategizing for the good of the nation.”"
  },
  {
    "headline": "Just In: Reps probe cause(s) of petrol scarcity",
    "summarized_story": "The House of Representatives has launched an investigation into the cause(s) of petrol scarcity across the country.\nThe importation of adulterated Premium Motor Spirits into the country has caused scarcity of the product across the with a litre sold between N250 and N300 in many places.\nAdvertisementMeanwhile, members of the house of representatives will vote on clause by clause amendment to 1999 Constitution on Wednesday.\nAlso, President Muhammadu Buhari has translitted the 2022 Supplementary Budget to House of representatives for consideration."
  },
  {
    "headline": "Zamfara CJ inaugurates 7-man committee to investigate deputy Gov -",
    "summarized_story": "Zamfara State Chief Judge, Kulu Aliyu has Inaugurated a seven man committee to Investigate allegations against the State Deputy Governor Mahdi Aliyu Gusau.\nThe Committee is chaired by retired Justice Halidu Tanko Soba.\nAdvertisementShe adds that the Committee members are of unquestionable integrity and not been members of any public service, legislative Houses or political party.\nThis Development is coming five days after the Zamfara state House of Assembly request the state chief judge to Set up a Committee to Investigate Deputy Governor Mahdi Aliyu Gusau.\nAdvertisementThe Zamfara State House of Assembly is accusing the deputy Governor of gross misconduct, abuse of office among other thingsAdvertisementIt is coming amidst move by the Zamfara State House of Assembly to Impeach the Mahdi Aliyu as the state Deputy GovernorAdvertisementA federal high court in Abuja had in November last year restrained the Zamfara State House of Assembly from from any move to impeach the deputy Governor."
  },
  {
    "headline": "Nigeria's problem needs immediate change in leadership",
    "summarized_story": "Presidential aspirant on the platform of the opposition People’s Democratic Party, Sam Ohuabunwa visited former military President Ibrahim Babangida in his hilltop residence in Minna, Niger State.\nSpeaking to journalists after the closed door meeting he said Nigeria’s problem needs immediate change in leadership.\nAdvertisementThis is why Mazi Sam Ohuabunwa is visiting former president Ibrahim Badamosi Babangida.\nThe state party chairman Tanko Beji while receiving the aspirant at the party secretariat pledged his support noting that the chapter is ready to support all aspirants to give them equal opportunities.\nAdvertisementWith so many people indicating interest to represent the party at the polls getting a nod from the stalwarts is becomes paramount for aspirants."
  },
  {
    "headline": "Nigeria: How ‘Supercop’ Kyari Retained Loyalty of Elite Squad, Called the Shots Despite Suspension",
    "summarized_story": "Headed then by Kyari, the team soon made its mark as a squad that was out to tackle crime given the constant arrests and the category of cases they busted.\nThe case that brought him to national limelight was that of Evans Onwuamadike, the ‘Billionaire kidnapper’, who was arrested by Kyari and his team.\nFor each operation, the bond between Kyari and men forged stronger as they weathered one allegation after the other.\nHow did DCP Kyari think for a moment that he would be reinstated after the FBI fiasco?\nIt was a stunned IG, who heard that he kept assuring his boys that DCP Disu would be removed and he would be reinstated."
  },
  {
    "headline": "Nigeria: APC Governors Divided Over National Convention, Choice of Consensus",
    "summarized_story": "The forthcoming convention of Nigeria’s All Progressive Congress (APC) has split governors elected under the political party into three different groups.\nThe inside source stated, “We are now looking at March for possible date for the national convention.\nIt was learnt that the two governors met with the president last week, where they sold the idea of Senator Sani Musa as a consensus national chairman of the APC.\nBut other APC governors on hearing of the meeting rejected the choice of Musa, and insisted it was not made with their consent.\nBut the crisis rocking APC, insiders said, was compounded by the inability of the convention committee to announce a zoning formula for the national convention."
  },
  {
    "headline": "Again, NNPC Apologises to Nigerians, Reveals Five Vessels of Substandard Fuel Rejected",
    "summarized_story": "“For this current situation, I assure you that we have taken every necessary step to restore supply into this country.\nThe statement added that it was working with the regulatory authorities and the Nigerian National Petroleum Company (NNPC) Limited towards a resolution of the current fuel crisis.\nMost importantly, Adeosun maintained that MOMAN members had committed resources towards enhanced operations and associated activities to reduce the burden of the current fuel scarcity to customers.\nNANS also bemoaned the serious fuel supply disruption across the country occasioned by the importation of bad petrol, allegedly, by some approved dealers of the NNPC.\nThe association demanded a speedy resolution of all issues and the normalisation of fuel supply across the country to ameliorate the hardship being experienced by Nigerians."
  },
  {
    "headline": "Australia: Sydney Beaches Close after First Fatal Shark Attack in 60 Years",
    "summarized_story": "Several Sydney beaches, including the iconic Bondi and Bronte, were shut down on Thursday after a swimmer was killed in a shark attack, the first such fatality at the city’s beaches in nearly 60 years.\n“This has been a complete shock for our community,” Dylan Parker, the mayor of Randwick Council which includes Little Bay, told Reuters.\nOrganisers of the Murray Rose Malabar Magic Ocean Swim had considered postponing the swim till March, but said they decided to cancel it after consulting with the local council and lifesavers.\nA spokesperson for the New South Wales Department of Primary Industries said its shark biologists believe that a white shark at least 3 metres (9.8 feet) in length was likely responsible for the attack.\nIt was the first fatal shark attack in Sydney since 1963, data showed."
  },
  {
    "headline": "Valieva to Take to Olympic Ice Once More on Thursday Amid Doping Scandal",
    "summarized_story": "Absolutely.”The 15-year-old Valieva tested positive for a banned heart medication at the Russian championships in December.\nI wouldn’t say so,” said Kaori Sakamoto of Japan, who is in third place after her short program.\n“That’s definitely disappointing,” said Karen Chen, who competed in the team event and enters Thursday night in 13th place after her short program.\nAnd though she looked calm and collected during a run-through for her short program, the tension appeared to finally get to her when skated off the ice and broke down in tears.\nValieva refused to speak to reporters after the short program, though she would be required to attend a news conference if she finishes in the top three Thursday night."
  }
]