[
  {
    "headline": "Tinubu travels to France amid running mate controversy",
    "summarized_story": "The presidential flagbearer of the All Progressives Congress, Asiwaju Bola Tinubu, on Monday, left the country for France.\nTinubu departed Nigeria shortly after he held a closed-door meeting with the President, Major General Muhammadu Buhari (retd.)\nThe PUNCH reported that the northern governors of the APC from the North-West and North-East were divided over the choice of a suitable running mate for the party’s presidential candidate, Tinubu.\nThe APC had submitted the name of a party chieftain in Katsina State, Ibrahim Masari, to the Independent National Electoral Commission as its surrogate running mate.\nMasari is a serving board member of the National Institute for Policy and Strategic Studies in Kuru, Plateau State."
  },
  {
    "headline": "Ukraine’s Odessa region hit by missile strike",
    "summarized_story": "The Odesa region of southern Ukraine has been hit by a missile strike that caused six casualties including a child, the Ukrainian military’s southern command said on Monday.\nThe command said a missile was fired from a Russian-type Tu-22 strategic bomber.\n“The strike in a residential area of civilian settlement destroyed several residential and farm buildings over around 500 square metres,’’ the command said.\nUkraine reported an increase in Russian missile attacks across the country over the weekend, with a number of regions hit far behind the front line from the western Ukrainian region of Lviv to Khmelnytskyi, Zhytomyr, Chernihiv, and Kyiv.\nIn the south of the country, Mykolaiv and Odesa were among the areas hit."
  },
  {
    "headline": "Sokoto APC loses 3000 supporters, 2 Governorship, House Of Reps aspirants to PDP in Sokoto",
    "summarized_story": "By Musa Na Annabi SokotoThe All Progressive Congress (APC) has lost 3000 supporters, 2 governorship aspirants, and a house of representatives aspirants to the Peoples Democratic Party (PDP) in Sokoto State.\n“APC in Sokoto State has turned to one man Show who plays god not knowing that a tree does not make a forest”.\nHe urged the Nigeria youth to be patient that if PDP form government in 2023 it will create jobs for them.Sokoto APC loses 3000 supporters, 2 Governorship, House Of Reps aspirants to PDP In SokotoBy Musa Na Annabi SokotoThe All Progressive Congress (APC) has loss 3000 supporters, 2 governorship, a house of representatives aspirants to Peoples Democratic party (PDP) in Sokoto State.\n“APC in Sokoto State has turned to one man Show who plays god not knowing that a tree does not make a forest”.\n” The presidential candidate of APC once said he didn’t believe in one Nigeria but he want rule one Nigeria he said."
  },
  {
    "headline": "Ekweremadu: What UK laws say about organ harvesting",
    "summarized_story": "By Biodun BusariAs the former Deputy Senate President, Ike Ekweremadu and his wife, Nwanneka Ekweremadu await judgment on the alleged organ harvesting of a minor to save their ailing daughter’s life, Vanguard has learnt the duo may bag a life sentence if found guilty of the offence.\nRecall Ekweremadus were arrested and detained by the Metropolitan Police, London, the United Kingdom last Thursday over alleged conspiracy on organ harvesting of one David Ukpo Nwamini.\nAccording to the UK laws, the politician and his spouse could be prosecuted for slavery, servitude or compulsory labour; sexual exploitation of a child under their care as entrenched under the United Kingdom’s Modern Slavery Act 2015.\nThe law says, “The United Kingdom’s Modern Slavery Act 2015 frowns at human trafficking under which organ harvesting falls and is punishable with a maximum sentence of life imprisonment upon conviction.\nIt is irrelevant whether that person consents to the travel, or whether they are a child or an adult."
  },
  {
    "headline": "Grandma gave me urine to drink, minor infected with HIV reveals",
    "summarized_story": "•By Esther OnyegbulaA 10-year-old girl infected with Human Immunodeficiency Virus, HIV (name withheld), who was recently rescued alongside her 14-year-old brother by their neighbour and taken to Igando General Hospital, Lagos, has revealed that their grandma gave her urine to drink.\nAccording to the survivor, “our travails started after the death of our mother.\nUnfortunately, the 10-year-old survivor fell ill again in May 2022.\nThe grandma started giving the survivor her urine to drink due to the severity of the cough she had.\nHowever, a neighbour, who noticed her depreciating health, took it upon herself to take her to Igando General Hospital, Alimosho."
  },
  {
    "headline": "Justice Kayode Ariwoola set to step in as new CJN",
    "summarized_story": "By Ise-Oluwa Ige, ABUJABarring any last minute change, the National Judicial Council (NJC) is set to recommend Justice Kayode Ariwoola to President Muhammadu Buhari as the acting Chief Justice of Nigeria (CJN) following the resignation of the incumbent, Justice Tanko Muhammad.\nReliable sources at the NJC told Vanguard on Monday that the mantle of leadership has fallen on Justice Ariwoola in line with the age-long tradition in the bench.\nJustice Ariwoola is the most senior Justice of the Supreme Court after the incumbent, Justice Tanko who just resigned his office.\nJustice Tanko is the second Chief Justice of Nigeria to have resigned his appointment in the last four years.\nHe was formerly a Justice of the Nigerian courts of appeal and on November 22, 2011, he was appointed to the bench of the Supreme Court of Nigeria as Justice, sworn in by the Chief Justice of Nigeria."
  },
  {
    "headline": "Insecurity: Kogi NMA chairman laments exodus of medical personnel",
    "summarized_story": "Some members of the Nigerian Medical Association (NMA) in Kogi State have left the state following the incessant abduction of doctors.\nThe chairman of the Kogi State chapter of the association, Dr Abubakar Hassan, made the disclosure after an emergency meeting in Lokoja on Sunday.\nHe observed that the abductors had become more threatened and daring against the people, lamenting that the security agencies lacked the capacity to confront them in order to curb the menace.\nThe NMA state chairman, however, confirmed the release of the staff of the National Health Insurance Scheme (NHIS), Lokoja, Dr Rukayat Musa, who was abducted on Tuesday, 21st June, 2022.\nDr Abubakar Hassan then called on the Kogi State Government to urgently take steps at supporting the security agencies to upgrade their capacity in order to curb the incessant cases of kidnappings in the state."
  },
  {
    "headline": "Gov Bello appoints Justice Majebi as Kogi Acting CJ",
    "summarized_story": "The Kogi State Governor, Alhaji Yahaya Bello, has appointed Justice Josiah Mejebi as the acting State Chief Judge.\nBello charged the erudite jurist to discharge justice without fear or favour.\nWhile he described the Acting Chief Judge as a man of impeccable character, the Governor urged him to sustain the feat, assuring the judiciary of the present administration’s support.\nSpeaking at the occasion, Justice Josiah Mejebi assured of the quick dispensation of justice under his leadership.\nJustice Josiah Mejebi takes over from Justice Olorunfemi who retired on Sunday 26th June 2022 after clocking 65 years."
  },
  {
    "headline": "Olukayode Ariwoola: 5 things to know about the new Chief Justice of Nigeria",
    "summarized_story": "Barring any last-minute change of plans, President Muhammadu Buhari is expected to swear in Justice Olukayode Ariwoola as the new Chief Justice of Nigeria (CJN) on Monday.\nIn line with the Supreme Court tradition, President Buhari is expected to inaugurate the new CJN Ariwoola today.\nJustice Ariwoola was born on 22 August 1958 and he is currently the most senior Justice of the Supreme Court.\nHe was formerly a Justice of the Court of Appeal and was elevated to the Supreme Court bench after having been elevated from the State High Court of Oyo State.\nBefore his elevation to the Supreme Court, Ariwoola served as Justice of the Court of Appeal in Kaduna, Enugu, and Lagos divisions."
  },
  {
    "headline": "Bandits, ISWAP, Boko Haram: How terrorists can be crushed – Shehu Sani",
    "summarized_story": "Shehu Sani, a popular socio-political commentator, on Monday suggested ways to crush terrorist groups operating in the Northern part of the country.\nSani said terrorists in the Northern part of the country would be crushed when the masses are trained and armed to combat them.\nBandits, Boko Haram insurgents, and the Islamic State in West Africa Province, ISWAP, have been terrorizing the Northern part of the country.\n“Terror groups operating in Northern Nigeria will be crushed and extinguished when the masses are organized, trained and armed to fight them.\n“I support Zamfara State arming the masses to defend their villages,” Sani tweeted"
  },
  {
    "headline": "Soludo denies attacking Obi, Umeh",
    "summarized_story": "Anambra State Governor, Prof Chukwuma Soludo has denied attacking the former Governor of the state and Labour Party presidential candidate, Mr Peter Obi.\nSoludo also denied attacking the former National Chairman of the All Progressives Grand Alliance, APGA, and senatorial candidate of the Labour Party, LP, Chief Victor Umeh.\nIn the reports, Soludo, who was addressing members of APGA, had said that those who left the party for Labour Party will labour in vain.\nNews reports had however attributed Soludo’s comments as being targeted at Obi and Umeh, both of who were also former APGA members.\nHe urged the public to disregard the entire statement as it never emanated from Governor Soludo."
  },
  {
    "headline": "Buhari may swear Ariwoola in as CJN Monday The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari is expected to swear Justice Olukayode Ariwoola on Monday as Acting Chief Justice of Nigeria (CJN) following the sudden resignation of Justice Tanko Muhammad.\nThe news of Justice Muhammad’s resignation, as Chief Justice of Nigeria, broke on Monday morning with sources claiming the former CJN resigned for health reasons.\nHowever, credible sources in the Presidential Villa, who could have confirmed the said swearing-in ceremony, said there was no such information yet.\nHe will act as CJN pending when his name will be sent to the Senate by President Buhari for confirmation as substantive Chief Justice of Nigeria (CJN).\nBorn on 22 August 1958, Justice Ariwoola, from Oyo state, was at some point a Justice of the Court of Appeal before being elevated to the Supreme Court bench in 2011."
  },
  {
    "headline": "BREAKING: Why CJN Muhammad resigned, by media aide The Nation Newspaper",
    "summarized_story": "The Chief Justice of Nigeria (CJN) Justice Ibrahim Muhammad has resigned to enable him attend to his health.\nHis media aide, Ahuraka Yusuf Isah confirmed this in a terse statement a moment ago.\nThe Nation learnt that Justice Muhammed came into his office earlier today, without his usual convoy of vehicles and security details.\nHe stayed briefly and left, but has not returned till then, an official said.\nJustice Muhammad was also absent today at a training workshop for judges, organised by the National Judicial Institute (NJI) which he was expected to declare open."
  },
  {
    "headline": "Full list of winners at BET Awards 2022 The Nation Newspaper",
    "summarized_story": "Full list of winners at BET Awards 2022Nigerian singer, Temilade Openiyi, popularly called Tems, has won the Best International Act, while Wizkid won best collaboration for ‘Essence’ at the 2022 BET Awards.\nThe 2022 award ceremony was held on Sunday at the Microsoft Theater in Los Angeles.\nThe BET Awards celebrate Black excellence in music, culture and sports.\nHere is the full list of winners at the 22nd annual ceremony:Album of the yearWINNER: An Evening With Silk Sonic, Silk SonicBack of My Mind, H.E.R.\nLil Baby & Lil Durk“Family Ties,” Baby Keem & Kendrick Lamar“Kiss Me More,” Doja Cat Feat."
  },
  {
    "headline": "Six prominent Nigerians who’ve said Peter Obi cannot win 2023 presidency The Nation Newspaper",
    "summarized_story": "Presidential candidate of the Labour Party (LP) Peter Obi has come under criticism over his aspiration to win the presidency.\nAliyu said: “Peter Obi is my good friend and a former member of my former Governors forum.\nNow that he is contesting without Peter Obi, it is now that he is serious.\nIke EkweremaduFormer Deputy Senate President, Ike Ekweremadu said that people from the South-East will not vote for Labour Party presidential candidate Peter Obi.\nHe specifically said those who joined the Labour Party (LP) like its presidential candidate, Peter Obi, will just labour in vain in 2023."
  },
  {
    "headline": "How I was arrested in Benin Republic, by Igboho The Nation Newspaper",
    "summarized_story": "How I was arrested in Benin Republic, by IgbohoYoruba Nation agitator Sunday Adeyemo aka Sunday Igboho has narrated how security operatives arrested him in Benin Republic.\nHe said they used his wife, Ropo to arrest him while traveling to Germany last year.\nIgboho, who is at Cotonou, the Republic of Benin disclosed that he would return back to Nigeria soon.\nExplaining how he was arrested, he said: “My wife (Ropo) was detained at the (Cadjèhoun) Airport for about two hours.\nIf I knew that could happen, I wouldn’t allow her to follow me to the airport."
  },
  {
    "headline": "BREAKING: Buhari to swear-in Ariwoola as new CJN",
    "summarized_story": "From Godwin Tsa, Abuja.\nPresident Muhammadu Buhari is expected to swear Justice Olukayode Ariwoola as the new Chief Justice of Nigeria (CJN) today following the resignation of Justice Ibrahim Tanko Muhammad on health grounds.\nJustice Ariwoola who the most senior Justice of the Supreme Court will be sworn-in today by 2pm, according to competent sources.\nBorn on 22 August 1958, Justice Ariwoola was formerly a Justice of the Court of Appeal and was elevated to the Supreme Court bench."
  },
  {
    "headline": "One dies, 10 injured on Abeokuta-Sagamu expressway auto crash",
    "summarized_story": "The Federal Road Safety Corps (FRSC) said one person died while 10 others sustained injuries in an accident at Kobape on the Abeokuta -Sagamu expressway on Sunday.\nMr Ahmed Umar, the FRSC Sector Commander in Ogun, confirmed the incident to newsmen in Abeokuta.\nUmar said the accident occured at 6:35 p.m. and was caused by excessive speed and loss of control by both vehicle drivers.\nThe sector commander stated that 16 people were involved which comprised 10 men and six women.\nThe sector commander cautioned motorists on reckless driving, especially during the rainy season."
  },
  {
    "headline": "Catholic communicators raise alarm over incessant killing of priests",
    "summarized_story": "Catholic Communicators in Nigeria under the auspices of SIGNIS have condemned in very strong terms the incessant killings of priests and other innocent Nigerians by bandits, kidnappers, and terrorists.\nThe Catholic communicators expressed even more concern over the seeming silence of the Muhammadu Buhari administration and the Federal Government in the face of these attacks now.\nThis seeming silence they quipped, does not in any way reassure Nigerians that the government is on top of the situation.\nThey particularly implored all churches and mosques to put in place stringent security measures that would enable them to defend the clergy, the worshippers, and the facilities henceforth.\nReacting to the recent killings of two Catholic priests, Rev Frs."
  },
  {
    "headline": "Northern govs stall selection of Tinubu’s running mate",
    "summarized_story": "The APC presidential flag bearer, it was learnt, has however narrowed his option to the North East and North West.\n“Tinubu has been given the free hands to pick a running mate.\nThey’re insisting that a running mate should be produced by them.\n•I’m still searching –TinubuTinubu, yesterday, said he was still searching for a running mate.\n•It’ll be suicidal to pick Christian running mate –YakasaiElder statesman, Tanko Yakasai, has warned that it would be politically suicidal for Tinubu to pick a Christian as running mate."
  },
  {
    "headline": "Kalu steps down as The Sun Publisher, Neya Kalu takes over",
    "summarized_story": "Chief Whip of the Senate and founder of The Sun Publishing Limited, publishers of Daily Sun, Saturday Sun, Sunday Sun and Sporting Sun, has formally stepped down as Publisher of the newspaper company.\nIn his place, Barr Neya Uzor-Kalu, who was recently appointed Chairman of the Board of Directors of the company, steps in to double as Publisher/Chairman.\nBarr Neya Uzor-Kalu has a degree in Law and an MSc in Finance from the University of Buckingham, United Kingdom.\nMr. Awoyinfa, pioneer Managing Director/Editor-in-Chief of The Sun Publishing Limited, was on the former board.\nKalu joined The Sun Publishing Limited as General Counsel in 2013 and currently heads the Company’s Legal Department."
  },
  {
    "headline": "MOMAN: FG Must Deregulate Downstream to Address Fuel Supply Challenges",
    "summarized_story": "He said issues around petrol subsidy would be resolved through on-going efforts at boosting local refining, especially through private sector involvement.\nOsifo, who spoke on a national television programme, maintained that Nigeria’s major problem was with the distribution of petroleum products.\nOkoronkwo also said the unions had engaged the services of Benham Group to recover money owed them for the supply of petroleum products.\nHe expressed the hope that the partnership would help in ending fuel scarcity at the filling station.\nNational Operations Controller, IPMAN, Mike Osatuyi, said the fuel scarcity would continue if the government failed to consider dialogue as a key solution."
  },
  {
    "headline": "Adamu Meets Senators, Says He is Worried By Gale of Defections – THISDAYLIVE",
    "summarized_story": "Speaking with journalists after the meeting with the APC caucus in the senate, Adamu said the party was worried by the gale of defections among senators.\nSpeaking after addressing the senators yesterday, Adamu said, “The meeting with the senators was most fruitful.\nBut we all know that the occurrence is not only happening in the APC; it’s happening across other political parties, too.\nThe senator said, “The national chairman said the essence of his meeting with us was to find out the reasons APC senators were defecting.\nTwo More Senators Quit Their PartiesTwo senators from Bauchi and Imo states resigned their membership of both the APC and the PDP."
  },
  {
    "headline": "Buhari: We Won’t Let Anyone Put Nigeria Under Unnecessary Religious Stress – THISDAYLIVE",
    "summarized_story": "He, therefore, called on all Nigerians – Christian and Muslim – to unite in prayer against the coward perpetrators of the evil acts.\nAccording to him, “Our religious freedom, our diversity, is what makes Nigeria great.\n“Let us show the cowards, who seek to divide us along religious lines that we will not be divided.\nLet us show them that Nigerians will continue to cherish what we share while respecting each other’s differences.\nLet us show them that Nigerians will never be bullied by cowards, extremists or terrorists,” he concluded."
  },
  {
    "headline": "Senate Probes Shell over Joint Venture Breach, Seeks $200m Refund to FG – THISDAYLIVE",
    "summarized_story": "Sunday AborisadeThe Senate yesterday constituted an Ad-Hoc Committee to investigate Shell Petroleum Development Company (SPDC) over non-compliance with the Petroleum Industry Act and breach of the Joint Venture Agreement entered into with the federal government.\nThe Ad-Hoc committee was mandated to probe the oil mining lease granted to SPDC between 1959 to 1989, and 1989 to 2019 under the SPDC/NNPC Joint Venture agreement.\nThe Ad-Hoc Committee which was constituted by the Senate President, Ahmad Lawan, has Senator Aliyu Sabi Abdullahi as its Chairman.\nHe expressed worry that the trend of illegal extension of Joint Venture (JV) period from 20 years to 30 years lease period without recourse to the Petroleum Act may have also applied to other Joint Venture agreements with the International Oil Companies (IOCs) and need to be investigated.\nHe stated further that Section 89 of the same Constitution provides the process on how such investigation should be carried out."
  },
  {
    "headline": "Petrol Price to Remain at N165 Per Litre, NMDPRA Insists – THISDAYLIVE",
    "summarized_story": "The statement by the NMDPRA that insisted on N165 per litre for pump price, came on the heels of the recent agitation by the Independent Petroleum Marketers Association of Nigeria (IPMAN) that PMS sold at N165 was no longer sustainable.\nThe pump price remains at N165.\nHe assured that NNPC was working with the entire operators and stakeholders in the downstream sector to ensure that petroleum products get to distribution channels and filling stations across the country.\nNigerians will continue to enjoy the free flow of petroleum products,” he added.\nThe IPMAN chairman said based on current economic realities, the sustainable pump price for petrol in in the country should be at N180 per litre."
  },
  {
    "headline": "BREAKING: Embattled Chief Justice Of Nigeria, Tanko Muhammad Tenders Resignation Letter To Buhari",
    "summarized_story": "The Chief Justice of Nigeria, Justice Tanko Muhammad, has tendered his resignation letter to President Muhammadu Buhari, SaharaReporters has gathered.\nMuhammad in the letter which he copied to the Attorney General of the Federation, Abubakar Malami, cited ill-health as the reason for his decision.\nIn the letter seen by SaharaReporters, the Justices accused Muhammad of abandoning his responsibilities as the leader of the court.\nHe was also accused of diverting their housing, vehicles and electricity allowances into his personal pocket and that of his children’s political ambitions.\nWith regard to Justice’s vehicles, several justices are due for vehicle replacement, while the new Justices have not received their full complement of vehicles to date."
  },
  {
    "headline": "BREAKING: Embattled Chief Justice Of Nigeria, Tanko Muhammad Tenders Resignation Letter To Buhari",
    "summarized_story": "The Chief Justice of Nigeria, Justice Tanko Muhammad, has tendered his resignation letter to President Muhammadu Buhari, SaharaReporters has gathered.\nMuhammad in the letter which he copied to the Attorney General of the Federation, Abubakar Malami, cited ill-health as the reason for his decision.\nIn the letter seen by SaharaReporters, the Justices accused Muhammad of abandoning his responsibilities as the leader of the court.\nHe was also accused of diverting their housing, vehicles and electricity allowances into his personal pocket and that of his children’s political ambitions.\nWith regard to Justice’s vehicles, several justices are due for vehicle replacement, while the new Justices have not received their full complement of vehicles to date."
  },
  {
    "headline": "BREAKING: 70-year-old Ruling APC Presidential Candidate, Tinubu Jets Out To France To ‘Seek Medical Attention’",
    "summarized_story": "While in Paris, the capital of France, Tinubu will hold some important meetings, his spokesperson, Tunde Rahman said in a statement.\nHowever, multiple sources told SaharaReporters that the APC Presidential candidate was going to Paris to attend to his medical needs.\nHe was flown out of the country some days before Christmas in 2020 to Paris, France.\n\"Tinubu is in Paris, France for a medical checkup.\nOn August 9, 2021, Tinubu had another knee surgery at the John Hopkins University Hospital in Maryland, the United States."
  },
  {
    "headline": "BREAKING: 70-year-old Ruling APC Presidential Candidate, Tinubu Jets Out To France To ‘Seek Medical Attention’",
    "summarized_story": "While in Paris, the capital of France, Tinubu will hold some important meetings, his spokesperson, Tunde Rahman said in a statement.\nHowever, multiple sources told SaharaReporters that the APC Presidential candidate was going to Paris to attend to his medical needs.\nHe was flown out of the country some days before Christmas in 2020 to Paris, France.\n\"Tinubu is in Paris, France for a medical checkup.\nOn August 9, 2021, Tinubu had another knee surgery at the John Hopkins University Hospital in Maryland, the United States."
  },
  {
    "headline": "BREAKING: 70-year-old Ruling APC Presidential Candidate, Tinubu Jets Out To France To ‘Seek Medical Attention’",
    "summarized_story": "While in Paris, the capital of France, Tinubu will hold some important meetings, his spokesperson, Tunde Rahman said in a statement.\nHowever, multiple sources told SaharaReporters that the APC Presidential candidate was going to Paris to attend to his medical needs.\nHe was flown out of the country some days before Christmas in 2020 to Paris, France.\n\"Tinubu is in Paris, France for a medical checkup.\nOn August 9, 2021, Tinubu had another knee surgery at the John Hopkins University Hospital in Maryland, the United States."
  },
  {
    "headline": "INSIGHT: How security situation in south-east degenerated in one year",
    "summarized_story": "But ESN has been blamed for escalating attacks on civilians and government facilities and security personnel in the south-east.\nMedia reports of violent attacks collated by CFR and other media platforms were analysed to ascertain the number of killings in the south-east.\nImo was followed by Anambra with 187 deaths, Ebonyi recorded 103 deaths, followed by Abia with 70 deaths, and Enugu recorded 68 deaths.\nAdvertisement“Unknown gunmen are different people which we don’t know and they are not IPOB or ESN security outfit,” IPOB spokesperson had said.\nAdvertisement‘USE OF FORCE COMPLICATED THE SITUATION’Freedom Onuorah, a security expert, blames the “dramatic deterioration of security in the south-east” on the activities of IPOB/ESN."
  },
  {
    "headline": "INSIGHT: How security situation in south-east degenerated in one year",
    "summarized_story": "But ESN has been blamed for escalating attacks on civilians and government facilities and security personnel in the south-east.\nMedia reports of violent attacks collated by CFR and other media platforms were analysed to ascertain the number of killings in the south-east.\nImo was followed by Anambra with 187 deaths, Ebonyi recorded 103 deaths, followed by Abia with 70 deaths, and Enugu recorded 68 deaths.\nAdvertisement“Unknown gunmen are different people which we don’t know and they are not IPOB or ESN security outfit,” IPOB spokesperson had said.\nAdvertisement‘USE OF FORCE COMPLICATED THE SITUATION’Freedom Onuorah, a security expert, blames the “dramatic deterioration of security in the south-east” on the activities of IPOB/ESN."
  },
  {
    "headline": "Buhari to swear in Olukayode Ariwoola as acting CJN",
    "summarized_story": "President Muhammadu Buhari will swear in Olukayode Ariwoola as acting chief justice of Nigeria (CJN) today.\nFourteen justices of the supreme court had accused the CJN of abandoning his responsibility as the leader of the court.\nBut to leave no vacuum, an acting CJN must be appointed.\nBut who is the new acting CJN?\nHe was named the chairman of the Oyo state armed robbery tribunal between May 1993 and September 1996."
  },
  {
    "headline": "Buhari to swear in Olukayode Ariwoola as acting CJN",
    "summarized_story": "President Muhammadu Buhari will swear in Olukayode Ariwoola as acting chief justice of Nigeria (CJN) today.\nFourteen justices of the supreme court had accused the CJN of abandoning his responsibility as the leader of the court.\nBut to leave no vacuum, an acting CJN must be appointed.\nBut who is the new acting CJN?\nHe was named the chairman of the Oyo state armed robbery tribunal between May 1993 and September 1996."
  },
  {
    "headline": "Lawyer in Olanipekun/Ajumogobia 'influence peddling' row blames it on 'exuberance'",
    "summarized_story": "The Rivers state government had preferred charges against the company over allegations of $130 million fraud.\nReacting to the development in a letter addressed to Olanipekun, Ajumogobia said the move was in breach of essential mandatory rules.\nAdvertisementOlanipekun has since apologised to Ajumogobia stating that he never approved the email sent by Ogunde.\n“I found out about the Saipem matter through an online article, and I unilaterally reached out to Saipem about the said matter, which unknown to me, was no longer before the court,” she said.\nBode Olanipekun SAN, and my dearest parents, Mr. Oluwemimo Ogunde SAN and Mrs. Yinka Ogunde."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "The Next Wave: How development agencies are investing in Africa’s tech ecosystem",
    "summarized_story": "During my time at these conferences, I realised that funding and support for African startups and the tech ecosystem don’t just come from investment firms, angel investors, corporates, and tech hubs.\nSenegal’s Délégation Générale à l’Entreprenariat Rapide des Femmes et des Jeunes (DER) since 2018 has been investing in the country’s tech environment, granting about 60 billion FCFA (~$96,424,000) out and helping transform the Senegalese tech ecosystem.\nMany other African country governments like Mauritius, Congo, Tunisia, Ghana, and Rwanda have initiatives to spur the tech ecosystem in their country.\nBetter awareness of the different players and activities in the African tech ecosystem creates room for collaboration.\nOne way to scale the impact of the investment activities of development agencies in the Africa tech ecosystem is to increase similar partnerships between them and other players such as tech hubs, universities, and research institutes."
  },
  {
    "headline": "Kune, the controversial Kenyan foodtech startup, has shut down",
    "summarized_story": "Kune, a Kenyan food tech startup that delivered ready-to-eat meals at affordable prices, is closing down today, the company’s founder and CEO Robin Reecht announced.\nThe announcement comes just 4 months after the startup began its commercial operations at established meal centers around Nairobi.\nAround that time, Kune leadership also declared its intentions to raise $3.5 million in its second round of funding.\nBut while Kune was well-liked by its customers, the startup’s journey wasn’t without its fair share of controversy.\nAddressing Kune’s investors, he said, “Not only did you invest in Kune but you gave us your time, brain-width, connections, and emotional support."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Protectionist policies cost Nigeria $18bn in 10 years – World Bank",
    "summarized_story": "Nigeria lost at least $1.8 billion yearly between 2010 and 2019 as a result of the federal government’s protectionist measures, the World Bank has said.\nThe World Bank noted that these policies, which restrict imports, have led to a loss in revenue, an increase in consumer prices, an increase in the cost of production, constraining domestic firms’ competitiveness, and limiting their potential to export to regional and global markets.\n“The closure only had a temporary effect in impeding the transit of illegal trade through Benin into Nigeria,” World Bank said.\nThe World Bank said increased openness to trade could help Nigeria achieve longstanding policy goals of economic diversification and industrial development.\nOnce they increase exports, there will be more dollars and naira will strengthen.”Ken Ifedi, a consultant to the CBN and economics professor, said beyond the concerns of the World Bank, Nigeria must identify an area of competitive advantage and build on it."
  },
  {
    "headline": "Naira weakens to 615 as dollar scarcity lingers",
    "summarized_story": "The naira has plunged to a new all-time low of N615 against the dollar at the unofficial market amid the scarcity of the greenback, traders told BusinessDay on Friday.\nThe traders said the dollar shortage had worsened on the back of the demand by would-be pilgrims and summer travellers.\nRead also: Naira falls to N615 as dollar scarcity hits FX marketsAt the same time, the Nigeria Autonomous Foreign Exchange (NAFEX) remained broadly stable in 2021, the parallel exchange rate depreciated by as much as 16 percent in the context of FX scarcity.\nNigerian banks had in May commenced a review of dollar request processing time for school fees, upkeep and rent payment, following dollar shortages.\nThis, according to the banks, was due to the limited foreign exchange availability provided by the CBN."
  },
  {
    "headline": "Buhari to swear in Ariwoola as Tanko Muhammad, CJN resigns",
    "summarized_story": "Justice Olukayode Ariwoola, a Justice of the Supreme to be sworn in as the acting Chief Justice of Nigeria by President Muhammadu Buhari.\nThis follows the sudden resignation of Justice Tanko Muhammad on sunday night as the chief justice of NigeriaArowoola is taking over by virtue of his being the most senior supreme court Judge.\nHis appointment would however be ratified by both the National Judicial Commission( NJC), president Muhammadu Buhari and the Senate in line with the Nigerian Constitution.\nAriwoola, who had served as a Justice of the Court of Appeal, before proceeding to the Supreme Court is expected to be sworn in at the Council Chambers of the Presidential Villa, by 2pm.\nDetails later"
  },
  {
    "headline": "Buhari gets the rebuke for saying Nigerians are better off today than in 2015",
    "summarized_story": "Buhari gets the rebuke for saying Nigerians are better off today than in 2015Is Nigeria better off today than in 2015There are two things politicians do not have control over – time and history.\nThat may be exactly what President Muhammadu Buhari sought to do last week when in a written response to questions from Bloomberg, he posited that Nigerians are in a better place today than in 2015.\nFinding Nigerians who say they are better off today is like looking for a needle in the bed of an ocean.\nSince Buhari took power in 2015, Nigeria has suffered two debilitating economic contractions that.\nIn the meantime, prices of commodities continue to gallop with annualized inflation in Nigeria surging from 9% in 2015 to today’s 17.17%."
  },
  {
    "headline": "Police kill 2 robbery suspects in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- The Edo State Police Command says its operatives have killed two armed robbery suspects in a gun duel in Benin City.\nThe police command further stated that the two suspects were members of a robbery gang that robbed an Oil and Gas station Off Murtala Mohamed way Benin City, yesterday.\n“The Armed robbers were later successfully trailed to a different location where they were carrying out another Armed Robbery operation.\n“On sighting the team of Security Operatives, the armed robbers opened fire on them which led to a gun duel.\n“The two suspected Armed robbers were taken to the Police Cottage hospital in Benin city where they were confirmed dead by the doctor and their bodies deposited at the mortuary”."
  },
  {
    "headline": "Firm invests N24bn in integrated farm in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestSaro Group of Companies has invested not less than N24bn in an integrated farm in Edo State, in a concerted effort to boost local production of raw materials for use in the manufacturing sector, especially the food and beverages sub-sector.\nMr. Sarumi said the project is valued at N24 billion, adding, “This is an integrated agricultural project.\nAccording to him, “It’s a very innovative finance method; the first to be used by a state government in Nigeria.\nThe federal government does tax credit for big, large corporate organizations but here, we, as a state, have been able to attract an investor and used his tax credit to enhance infrastructural development in the state.\nThese projects were conceptualized about five years ago but construction could not commence until last year due to various challenges.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Obaseki driving digital economy, tech revolution in Edo with fibre optic connectivity – report – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestIn what is yet another validation of the drive of the Governor Godwin Obaseki-led administration on innovation and technology, Edo State has, again, gained global recognition for the government’s investment in digital infrastructure through the ongoing state-wide fibre optic connectivity project.\nThe state government is in partnership with leading global firms including MainOne, Facebook and Global Independent Connect Limited (GICL), among others for a state-wide internet deployment to enhance connectivity and expand the state’s digital economy.\nAs a part of the deal, surveillance cameras are to be installed to improve security in the state.\nSo the days when you send one file somewhere and it gets lost in the system are gone.\n“Schools in Edo and areas where fibre-optic cables can be accessed have benefited from subsidised internet connectivity and are also working with Microsoft-based learning programs, improving the quality of education.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Warri Groan Under Deplorable State Of Roads, Call For Okowa’s intervention. – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – As the rainy season begins to gather momentum, residents of the twin cities of Warri and Effurun have continued to under groan about the very parlours state of roads in the locality.\nThe residents said they have suffered untold hardship for the past seven years as a result of the bad roads which have affected their economic state because their businesses have continued to be on the downward slide due to effects of bad roads.\nOne resident who gave his name as Mr Okonedo Andrew who resides at at 12 Ojugo Street, off Giwa-Amu Road, Warri told our correspondent that they have been suffering because of the bad road since he moved into the street.\nI am a tailor and I have my store here but because of the bad road customers no longer come because the whole place is flooded,” he said.\nPeople call Okowa the Road Master but we are not feeling the impact of that name in this street."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "129 lawyers make 2022 SANs’ list",
    "summarized_story": "The Legal Practitioners’ Privileges Committee (LPPC) has shortlisted 129 lawyers for the conferment of Senior Advocate of Nigeria (SAN) rank in 2022.\nAmong the list are 73 practising lawyers and 56 academic applicants.\n“The general public is at liberty to comment on the integrity, reputation and competence of the above applicants,” she stated.\nAcademics shortlisted for the title include: Dr. Fatihu Abubakar Abba, Assistant Professor Abdulkarim Kana Abubakar, Prof Muhamm4d Taofeeq Abdulrazaq, Dr Adebayo Olugbenga Adaralegbe, Prof Funminiyi Abiodun Adeleke, Dr Ayodele Anthony Adewole, Mr Abraham Femi Afolayan, Dr James Atta Agaba, and Prof John Alewo Agbonika.\nOthers are: Prof Ambrose Ozoemezilem Ekpy, Dr Dennis Ude Ekumankanma, Prof Joy Ngozi Ezeilo, Prof Amokaye Oludayo Gabriel, Prof Olaide Abass Gbadamosi, Prof Akinola Amao Ibidapo-Obe, Prof Abdulqadir Abikan Ibrahim, Prof Mansir Said Ibrahim, Prof Akaa Tyozua Imbwaseh, Prof Nathaniel Ahabue Inegbedion, and Prof Emmanuel Ayangarumun Kenen"
  },
  {
    "headline": "Buhari to swear in Olukayode Ariwoola as acting CJN today",
    "summarized_story": "President Muhammadu Buhari is set to swear in Olukayode Ariwoola as acting chief justice of Nigeria (CJN).\nThis follows the resignation of Ibrahim Muhammad as CJN on Monday.\nLast week, 14 justices of the supreme court had accused the CJN of abandoning his responsibility as the leader of the court.\nThe judges also accused the CJN of going on foreign trips with his family while denying them the right to go on international trainings.\nAriwoola is the next-highest ranking justice of the supreme court and is expected to take over in acting capacity from Monday."
  },
  {
    "headline": "Nigeria’s fuel subsidy hits N2.84trn in 17 months",
    "summarized_story": "Petrol subsidy grew by 190.62 percent in the first five months of 2022 to hit N1.274 trillion compared to N438.36 billion recorded over corresponding period last year.\nWith the latest figure, the total amount paid for petrol subsidy in the past 17 months (N1.5 trillion in 2021) has risen to N2.84 trillion.\nIn March 2022 subsidy of N152 billion was also 35.7 percent higher than N111.96 billion recorded in March 2021, Vanguard reported.\nPetrol subsidy for February 2022 grew by 318.8 percent to N253 billion when compared to N60.4 billion recorded in February 2021.\nThe Federal Government had earlier in the year received approval from the National Assembly to spend N4 trillion on petrol subsidy in 2022."
  },
  {
    "headline": "Fitch upgrades Fidelity Bank to IDR ‘B’",
    "summarized_story": "Fitch Ratings has upgraded Fidelity Bank Plc’s long-term issuer default rating (IDR) to ‘B’ from ‘B-’The latest upgrade in Fidelity Bank’s rating which was issued at the weekend reflects bank’s improving business profile and resilient financial metrics, Fitch stated.\nAccording to the rating note, the upgrade reflected the bank’s increased creditworthiness relative to other issuers in Nigeria.\n“Fidelity’s Long- and Short-Term IDRs are driven by its standalone creditworthiness, as expressed by its Viability Rating (VR) of ‘b’.\n“Fidelity’s stage 3 loans ratio at 2.8 per cent at end-1Q22, has been supported by strong lending growth and is below the banking sector average.\nWe expect the bank’s impaired loans ratio to remain at around three per cent in 2022-2023, supported by stable operating conditions."
  },
  {
    "headline": "Super Falcons off to Morocco for Nations Cup title defence",
    "summarized_story": "The Super Falcons of Nigeria have departed for Rabat, Morocco ahead of the 2022 Africa Cup of Nations in the North African country.\nThe contingent departed the Murtala Muhammed International Airport, Lagos on Monday morning aboard Royal Air Maroc.\nThe players and their officials are expected to arrive at the Mohamed V International Airport, Casablanca at 11.20 am today.\nThey will then embark on a two-hour road trip to Rabat where they will play all their group games.\nThe Super Falcons will face title rivals, South Africa, Burundi, and Botswana in Group C.Randy Waldrum’s charges will confront the Banyana Banyana of South Africa in their first game on Monday, July 4."
  },
  {
    "headline": "Green Infrastructure: Nigeria, AfDB, Others Sign Agreement On Fund Mobilisation",
    "summarized_story": "The federal government through the Nigeria Sovereign Investment Authority (NSIA), has agreed with key organisations in Africa to mobilise funds to accelerate green infrastructure projects in the continent.\nThe letter of intent for the capital mobilisation was signed by the African Development Bank, Africa50 and newly launched African Sovereign Investor Forum (ASIF), for green and climate resilient infrastructure projects across Africa.\nThe signing took place in Rabat, Morocco during an event to launch the Africa Sovereign Investors Forum.\nTen African sovereign investors have already agreed to set up the Forum.\nWe must make key regional infrastructure projects attractive and bankable for both global and African private investors and today’s signing will go a long way to address the continent’s infrastructure deficit."
  },
  {
    "headline": "Green Infrastructure: Nigeria, AfDB, Others Sign Agreement On Fund Mobilisation",
    "summarized_story": "The federal government through the Nigeria Sovereign Investment Authority (NSIA), has agreed with key organisations in Africa to mobilise funds to accelerate green infrastructure projects in the continent.\nThe letter of intent for the capital mobilisation was signed by the African Development Bank, Africa50 and newly launched African Sovereign Investor Forum (ASIF), for green and climate resilient infrastructure projects across Africa.\nThe signing took place in Rabat, Morocco during an event to launch the Africa Sovereign Investors Forum.\nTen African sovereign investors have already agreed to set up the Forum.\nWe must make key regional infrastructure projects attractive and bankable for both global and African private investors and today’s signing will go a long way to address the continent’s infrastructure deficit."
  },
  {
    "headline": "Dangote Commits To Self-sufficiency In Sugar Production",
    "summarized_story": "Nigeria’s quest to attain self-sufficiency in sugar production remains Dangote Sugar Refinery Plc’s major priority.\nThe Nigerian Sugar Master Plan of 2012 is the starting point for backward integration in the sector.\nAlso, the group managing director/chief executive officer of Dangote Sugar, Mr. Ravindra Singhvi said: “we remained ahead of the pack in implementation of the National Sugar backward Integration Development Master Plan.” He said achievement of the Dangote Sugar Master Plan remained paramount in our operations.\nHe explained that “steady progress is now being made as we continue the rehabilitation and expansion project at Dangote Sugar, Numan; and development activities at the Nasarawa Sugar Company Limited, Tunga.\nDangote Sugar currently has three subsidiaries, Nasarawa Sugar Company Limited, Dangote Taraba Sugar Limited and Dangote Adamawa Sugar Limited."
  },
  {
    "headline": "Dangote Commits To Self-sufficiency In Sugar Production",
    "summarized_story": "Nigeria’s quest to attain self-sufficiency in sugar production remains Dangote Sugar Refinery Plc’s major priority.\nThe Nigerian Sugar Master Plan of 2012 is the starting point for backward integration in the sector.\nAlso, the group managing director/chief executive officer of Dangote Sugar, Mr. Ravindra Singhvi said: “we remained ahead of the pack in implementation of the National Sugar backward Integration Development Master Plan.” He said achievement of the Dangote Sugar Master Plan remained paramount in our operations.\nHe explained that “steady progress is now being made as we continue the rehabilitation and expansion project at Dangote Sugar, Numan; and development activities at the Nasarawa Sugar Company Limited, Tunga.\nDangote Sugar currently has three subsidiaries, Nasarawa Sugar Company Limited, Dangote Taraba Sugar Limited and Dangote Adamawa Sugar Limited."
  },
  {
    "headline": "Air Peace Gifts Olympians, Nations Cup Winners Free Local, Int’l Tickets",
    "summarized_story": "Air Peace Airline, over the weekend, announced the gifting of free local and international flying tickets to the 1980 National Football team and 1976 Olympians.\nAir Peace spokesman, Stanley Olisa, in a statement, indicated the chairman of Air Peace, Barrister Allen Onyema, pledged to build a Wall of Fame for Nigeria’s distinguished sports icons whose strides played a tremendous role in unifying the country, projecting her in a favourable light and representing the entire Black race positively.\n“For the 1980 National Football team referred to above, Air Peace shall sponsor an event where they would be celebrated and honoured.\nThe surviving members of that team are hereby made Special Ambassadors of Air Peace and are entitled, for the rest of their lives, to fly Air Peace free of charge, six times in every year on the domestic destinations and once a year to any foreign destination serviced by Air Peace.\nIn September 2021, Air Peace penned a sponsorship deal with the Nigerian Football Federation(NFF), for the National Teams, as their official carrier."
  },
  {
    "headline": "Meet Justice Olukayode Ariwoola expected to be sworn-in as CJN",
    "summarized_story": "Justice Olukayode Ariwoola is expected to be sworn in as the next Chief Justice of Nigeria (CJN) after the resignation of Justice Tanko Muhammad.\nJustice Ariwoola was born on Aug. 22, 1958.\nHe was a Justice of the Court of Appeal between 2005 and 2011 after having been elevated from the State High Court of Oyo State.\nJustice Ariwoola was first appointed a Judge of the Superior Court of record in Oyo State in 1992 from private legal practice.\nBefore his elevation to the Supreme Court, he served as Justice of the Court of Appeal in Kaduna, Enugu and Lagos Divisions."
  },
  {
    "headline": "JAMB warns CBT centres against extortion",
    "summarized_story": "By Veronica DariyaThe Joint Admissions and Matriculation Board (JAMB) on Monday warned operators of accredited Computer Based Tests (CBT) centres to desist from extorting candidates or face severe sanctions.\nIt stated in its weekly bulletin that its attention had been drawn to reports that some operators charged higher than the N700 fee stipulated for services rendered to candidates.\nAccording to the board, any form of exploitation will not be condoned, else a N100,000 fine will be imposed on culprits after they had been made to refund money collected.\nRelated News Obaseki lays foundation for JAMB CBT Centre in Benin“Centre owners are warned that failure to desist from the nefarious act would attract a fine of N100, 000 and possible revocation of a licence issued by JAMB.\n“Candidates are advised to report any CBT centre charging above the board’s stipulated fee for any of its services,’’ it stated."
  },
  {
    "headline": "BREAKING: Buhari To Swear In Justice Ariwoola As CJN Today",
    "summarized_story": "BREAKING: Buhari To Swear In Justice Ariwoola As CJN TodayThere are strong indications that President Muhammadu Buhari will perform the swearing-in of Justice Olukayode Ariwoola as the new Chief Justice of Nigeria (CJN) at noon today.\nThis follows the resignation of Justice Ibrahim Tanko Muhammad over health challenges.\nJustice Ariwoola is currently the most senior Justice of the Supreme Court.\nHe is expected to be sworn in today by 2 pm, according to sources within the presidency.\nBorn on 22 August 1958, Justice Ariwoola was formerly a Justice of the Court of Appeal and was elevated to the Supreme Court bench."
  },
  {
    "headline": "Atiku: Judge Me with My Track Record as Vice President",
    "summarized_story": "This is as he has aligned with the Supreme Court judgment on the Electoral Act, saying it was part of the process to guarantee the independence of the judiciary.\nIn a statement on Sunday, Atiku, said, “Our assets in this campaign are my track records of performance, when I served as vice-president between 1999 and 2007.\n“The second asset is the policy document that details the work plan of what we shall do to rescue Nigeria back to her glorious heights.\nIn his reaction, however, the former vice-president, said, “the ruling of the Supreme Court on Section 84 (12) is commendable.\n‘Under no circumstance must one arm lord over another arm of government,” Atiku wrote on his verified tweeter handle."
  },
  {
    "headline": "BREAKING: CJN Ibrahim Tanko Resigns",
    "summarized_story": "The Chief Justice of Nigeria (CJN), Justice Ibrahim Tanko Mohammad has resigned from office.\nThe development comes amid the corruption allegations some Supreme Court judges levelled against him.\nThe Supreme Court expressed their concerns over their budgetary allocations that have not been increased in the last four years.\nMuhammad has served as a Justice of the Supreme Court of Nigeria since 2005 and was appointed Chief Justice of Nigeria in 2019.\nJustice Tanko became the Chief Justice of Nigeria on July 11, 2019."
  },
  {
    "headline": "2023: Tinubu off to France for further consultations",
    "summarized_story": "2023: Tinubu off to France for further consultationsPresidential Candidate and National Leader of the All Progressives Congress, Asíwájú Bola Ahmed Tinubu, travelled out of the country early Monday morning after meeting with President Muhammadu Buhari at the Presidential Villa.\nHe is off to Paris, France to hold some important meetings.\nThe APC standard bearer is expected back in the country shortly.\nSpeaker’ and launch of legislative mentoring initiative in commemoration of the 60th birthday of Speaker of House Representatives, Femi Gbajabiamila.\nOn June 8, Asiwaju Tinubu emerged the Presidential candidate of APC for the February 25, 2023 election at the party’s presidential primaries/national convention held at the Eagle Square, Abuja."
  },
  {
    "headline": "Breaking: Behold ex-court of appeal Justice set to take over as CJN",
    "summarized_story": "Following the resignation of Justice Ibrahim Tanko Muhammad, President Muhammadu Buhari will later on Monday swear in Justice Olukayode Ariwoola as acting Chief Justice of Nigeria (CJN), a Judiciary source has revealed.\nJustice Ariwoola is the most senior Justice of the Supreme Court.\nBorn on 22 August 1958, Justice Ariwoola was formerly a Justice of the Court of Appeal and was elevated to the Supreme Court bench.\nThe swearing-in event is reportedly scheduled for 2pm.\nDetails loading…Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "After meeting Buhari, Tinubu heads to France",
    "summarized_story": "The former governor of Lagos state and the Presidential Candidate of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, has left Nigeria for France.\nThe spokesman to the presidential hopeful announced his departure on Monday.\nAccording to him: “He is off to Paris, France to hold some important meetings.”It’s unclear how long Tinubu will be away from the country.\nIt was however learnt that he departed for France after meeting with President Muhammadu Buhari at the Presidential Villa, Abuja, on Monday morning, June 27.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Breaking: Chief Justice of Nigeria, Tanko Muhammad, resigns",
    "summarized_story": "Few days after his colleagues at the Supreme Court rose against him, accusing him of sundry infractions in office ranging from corruption to high-handedness, Chief Justice of Nigeria (CJN), Justice Tanko Muhammad, has resigned.\nA Judiciary source revealed that Justice Muhammad resigned on Sunday night, citing ill-health as the reason for his decision.\nThere has been ruckus at the apex court, after 14 justices rose against the CJN over alleged mismanagement of funds and absence of probity, insisting on full blown investigation.\nThe justices had in a recent letter to the CJN, which was leaked to the public, protested the non-payment of their legitimate entitlements for a prolonged period of time.\nAccording to them, though they were blocked from attending foreign trainings, the CJN, severally travelled out of the country with his spouse and children."
  },
  {
    "headline": "MTN’s Mobile Money Bank suffers N22b fraud, drags18 banks to court for recovery",
    "summarized_story": "By Kenneth AtavtiNewly licensed Mobile Money Payment Service Bank Limited (MOMO PSB) a banking subsidiary of MTN Communications Limited has in less than a month operations suffered a massive fraud worth over N22 billion on its network.\nIn an affidavit in support of the originating summons, the Chief Executive Officer (CEO), MOMO PSB Ltd, Mr. Anthony Usoro Usoro claimed that MOMO PSB Ltd is the bona fide owner of the aggregate sum of N22.3 billion which is maintained in its MOMO settlement account.\nAnthony in the affidavit further claimed that a total of about 700, 000 transactions were processed with credits made into about 8,000 various accounts in the listed 18 banks.\nThe erroneous transfers, he claimed, were due to the fact that MOMO PSB Ltd suffered a system exploitation which led to the said debits.\nIt added that its resort to the court was informed by the insistence of the 18 banks that they needed to be ordered by the Federal High Court before they could act."
  },
  {
    "headline": "Collaboration is success path to 5G deployment in Nigeria – NCC",
    "summarized_story": "According to him, the policy framework for the deployment has come into place and will facilitate deployment of services by the recent winners of the 3.5GHz spectrum auction, MTN Nigeria Communications Ltd and MAFAB Communications Ltd.\nHe said the Commission has set out the regulatory instruments needed for fast deployment of the new versatile technology for the benefit of the consumers and the stakeholders.\nProf. Danbatta, therefore, invited the support of all stakeholders to ensure that 5G technology is deployed in Nigeria in a manner beneficial to all telecom consumers and to support the emergent Digital Economy Policy of the Federal Government of Nigeria.\nHe highlighted the potential use cases for 5G networks as broadly categorised by the International Telecommunication Union (ITU) to include Enhanced Mobile broadband (eMBB), Massive Machine-type Communications (mMTC), as well as Ultra-reliable and Low-latency Communications (uLLC)“We will continue to collaborate with stakeholders across sectors to ensure faster deployment of 5G services, and accelerate the growth of Nigeria’s broadband infrastructure,” he said.\nHe identified some challenges in the deployment to include limited frequencies with the required spectral efficiency, skilled professionals with requisite knowledge of the technology, fewer number of 5G-enabled devices, and cost of deployment but stated that the industry must work to turn the challenges into opportunities rather than seeing them as obstacles."
  },
  {
    "headline": "Effective service delivery in hospitality, tourism industry dependent on quality of practitioners in the sector – Experts",
    "summarized_story": "By Palma IleyeExperts at a One-Day Interactive Workshop on Effective Customer Service Delivery for Tourism and Hospitality Professionals organized by the FCT Chapter of the Institute for Tourism Professionals of Nigeria, ITPN, have asserted the obvious fact that an effective service delivery in the sector was dependent on the quality of practitioners and their professional competence.\nIn the paper titled ‘Effective Customer Service Delivery for Tourism and Hospitality Professionals’ presented at the occasion, Alhaji Abdulmalik Hassan, an advocate for quality service, stated that excellent customer service delivered in the appropriate way, is a prerequisite for effective and efficient business management that guarantees customer satisfaction, patronage and retention.\nLordsGreat stressed that Customers are increasingly becoming aware of the need to get value for their money and will frown at poor quality service delivery from mediocre organizations.\n” What drive customers away is rude and discourteous behaviour, inept, and incompetence dispositions of staff during service delivery,” he added.\nCertificates were later presented to participants at the workshop as testimony of attendance and acquisition of the requisite knowledge and skills in the ethics of customer service delivery as professionals in the travel tourism and hospitality industry."
  },
  {
    "headline": "ACCI Member, Esther Eghobamien-Mshelia Elected into UN Committee on CEDAW",
    "summarized_story": "The Federal Ministry of Women Affairs and Social Development (FWASD) has announced the election of Abuja Chamber of Commerce and Industry (ACCI) member, Mrs Esther Eghobamien-Mshelia as Nigeria’s representative on the Convention On the Elimination of All Forms Discrimination Against Women (CEDAW) Committee.\nMrs Eghobamien-Mshelia, who is the founder, Women Arise Development Initiative (WADHI) was one of the 12 members elected by states parties of the committee on the elimination of discrimination against women to replace those whose terms of office are due to expire on 31 December 2022.\nThe terms of the new elected members would commence 1st January 2023 and run through a period of four years, later on 31 December 2026.\nWhile congratulating her election into the CEDAW committee, Mrs Tallen stated that she has no doubt that Mrs Eghobamien-Mshelia will do us proud in the journey ahead adding that we must therefore rise above our differences to ensure that we succeed in flying the Nigeria colours high.\nThe Minister lauded the role of the Managing Director, Bank of Industry, Mr. Olukayode Pitan and the Director-General ACCI, Dr Victoria Akai for the great role they played in the realization of the mandate."
  },
  {
    "headline": "ACCI President Presents Opportunities for Investors in Untapped Natural Gas",
    "summarized_story": "The President of Abuja Chamber of Commerce and Industry (ACCI), Dr Al-Mujtaba Abubakar has said there are opportunities for investors to harness in Nigeria natural gas as we have large untapped reserves.\nHe gave detailed presentation on the Nigeria gas industry, from proven reserve to our daily gas consumption in Nigeria and also the governments agenda for gas by declaring 2020-2030 the decade of gas where he captured the CBN gas intervention fund.\nThe identified companies are; First Services, Target Energy Solutions, ASF Consulting, Innova soft Integration are interested in partnerships in Nigeria.\nThe President ACCI assured them that the Chamber will facilitate their meeting with NNPC and advised them to write through their embassy in Nigeria.\nQuite a number of companies expressed their willingness to participate in the 2023 Petroafrica Conference to be held in Nigeria."
  },
  {
    "headline": "Justice Olukayode Ariwoola To Be Sworn In As Acting CJN",
    "summarized_story": "A justice of the Supreme Court, Justice Olukayode Ariwoola, will be sworn in as the acting Chief Justice of Nigeria (CJN), Channels Television can confirm.\nThis follows the resignation of the CJN, Justice Tanko Muhammad, as the highest judicial officer in the land.\nHe also disclosed that Justice Ariwoola is expected to be inaugurated as the acting CJN by the Presidency at the Presidential Villa in Abuja, the nation’s capital.\nA Senior Advocate of Nigeria, who pleaded anonymity also disclosed to reporters that Justice Ariwoola would be sworn in at 2pm.\nThis resulted in the scheduled inauguration of Justice Ariwoola – the next most senior justice of the Supreme Court at the time of Justice Muhammad’s resignation."
  },
  {
    "headline": "Justice Tanko Muhammad Resigns As CJN",
    "summarized_story": "The Chief Justice of Nigeria, Justice Tanko Muhammad, has resigned, Channels Television learned on Monday.\nSources told Channels Television that Justice Muhammad resigned on Sunday night, citing ill-health as the reason for his decision.\nInformation also has it that arrangements are ongoing to swear in the next most senior justice of the Supreme Court, Justice Olukayode Ariwoola, as the acting Chief Justice of Nigeria.\nAlthough no Supreme Court Justice is present at the event.\nhowever, the Administrator of the Institute, Justice Garba has opened the session."
  },
  {
    "headline": "Kidnappers Kill Catholic Priest, Hunter In Edo",
    "summarized_story": "Gunmen suspected to be kidnappers have killed a Catholic priest, Reverend Father Christopher Odia, in Edo State.\nOdia’s death comes a day after another Catholic priest, Reverend Father Vitus Borogo, was killed by armed men in Chikun Local Government Area of Kaduna State.\nREAD ALSO: Bandits Kill Catholic Priest In KadunaShortly after the incident, Iwegbu stated that the command deployed a combined team of tactical teams from Jattu Divisional Police headquarters to the scene.\nShe added that the security team chased after the kidnappers, killing one of them as others fled with various gunshot wounds.\nHe further encouraged Edo state people not to relent in providing the police with prompt and useful information."
  },
  {
    "headline": "Alleged Organ Harvesting: Immigration Confirms Age Of ‘Victim’ In Ekweremadu’s Case",
    "summarized_story": "The Nigerian Immigration Service (NIS) has confirmed the age of the alleged victim of organ harvesting, David Nwamini, in a case involving former Deputy Senate President, Ike Ekweremadu, and his wife, Beatrice.\nIn a statement issued over the weekend, the Comptroller General of NIS, Mr Isah Idris, disclosed that the said kidney donor was 21, and not 15 as claimed.\nREAD ALSO: UK Police Arrest Ike Ekweremadu, Wife For Organ HarvestingAmid the controversy over Nwamini’s age, the immigration chief explained the procedures involved before Nwamini was issued an international passport by the NIS.\nHe stressed that there was no falsification of age on the passport issued by the immigration as claimed, adding that the agency followed the due process.\nHe insisted that the date of birth or any other information on any passport issued by the immigration is printed on the document only after a thorough vetting process, adding that Nwamini’s case was not an exception."
  },
  {
    "headline": "G7 Vows Solidarity With Ukraine ‘As long As It Takes",
    "summarized_story": "The Group of Seven rich nations vowed enduring support for Ukraine in the face of Russian aggression, in a statement from its summit in Germany on Monday.\n“We will continue to provide financial, humanitarian, military and diplomatic support and stand with Ukraine for as long as it takes,” the G7 said."
  },
  {
    "headline": "I was a son of nobody, my parents never went to school",
    "summarized_story": "Former President of Nigeria, Olusegun Obasanjo has described himself as a son of nobody who struggled to become someone in life.\nHe said, “One of the mistakes I made was picking my number two when I wanted to become the President.\nBut because it was a genuine mistake, God saved me.\n“The second one was when Abacha wanted to arrest me.\nWhen he wanted to arrest me, I was told by the American ambassador that they would arrest me and that America had asked that I should be given an asylum."
  },
  {
    "headline": "I made mistake in picking my running mate in 1999",
    "summarized_story": "He made this known in Abeokuta, during a mentoring session on leadership and entrepreneurship for selected school students.\nThe former president while addressing the students attributed his success story in life to God, his parent, community, education and the determination to excel.\nHe shared his views about political situation in the country and some of his mistakes in life, especially on his choice of Deputy in 1999.\nSpeaking on African continental free trade agreement, the former president called for improved infrastructure, especially a thriving coastal shipping.\nHe also suggested the removal of all encumbrances standing in the way of effective and free movement of goods and services across the continent."
  },
  {
    "headline": "APC Nat'l Women Leader Empowers 500 Zamfara Women, Petty Traders -",
    "summarized_story": "Five Women farmers and petty traders in Zamfara have Benifited from an empowerment program organised by the office of the APC National Women Leader in Collaboration with the Zamfara State GovernmentThe program is aimed at encouraging farming activities and also to eradicate Poverty especially among womenOne hundred of the Benificiaries recieved one hundred thousand naira each while the other four hundred recieved twenty thousand naira eachThe event which held in Maradun Local Government area witnessed a large turn out of women, youth, traditional rulers, Politicians and party faithfulsAddressing the Gathering, the APC National Women leader Dr. Betta Edu say the decision to embark on the empowerment programme is to support the women in their quest to fend for themselves in view of their vulnerability and their positive contributions to democracy and national growth.\nShe adds that the gesture is part of the human nature of the APC at the national level, noting that the party is geared towards transforming the lives of the citizens in different ways.\n“The empowerment programme is aimed at cushioning economic and medical challenges of the beneficiaries mainly due to the prevailing security and economic hardship in the country” Dr. Betta Said“With such kind of support, women would no longer accept unpatriotic elements among politicians who negotiate their votes during elections for money” She addedAccording to the APC National women leader, the Headquarters of the party is fully aware of Governor Bello Matawalle’s twenty thousand naira monthly cash support to women among other smiles driven policies and programmes through the office of the State first ladyDr. Betta noted that what her personal experience in the Zamfara has countered the negative impressions she had earlier about the stateShe Commended Governor Bello Matawalle for executing a number of developmental projects, while calling on him to do more especially in the area of developing women” APC is all out to give women a sense of belonging in the administration of the country and Nigerian women are so thankful to President Muhammad Buhari’s leadership style for initiating programmes capable of impacting on the lives of women” Dr. Betta Maintained.\n“I Personally want to thank Governor Bello Matawalle for giving proportionate number of slots to women in his cabinet and other civil Service appointments” She Commend the Zamfara Gov.\nHighlights of the event includes Disbursement of cash to the five hundred Benificiaries among other important eventsPresent at the Program Includes Zamfara State First Lady A’isha Bello Matawalle, Secretary to Zamfara State Government, Representative of Emir of Maradun, Commissioner for Information among other top Government functionaries."
  },
  {
    "headline": "Wase eulogises Gbajabiamila at 60, says he's a patriot",
    "summarized_story": "Deputy Speaker of the House of Representatives, Ahmed Idris Wase has congratulated Speaker Femi Gbajabiamila as he marks his 60th birthday.In a congratulatory message signed by his Chief Press Secretary, Umar Muhammad Puma, Wase described Gbajabiamila as a patriot and a legislator per excellence.\n“Through the Joint Task mantra, Speaker Femi Gbajabiamila has been able to unite members of the House by giving everyone a sense of belonging.\nThe Deputy Speaker noted that Gbajabiamila has shown great commitment to the independence of the legislature saying “his love for Nigeria and commitment to the growth and sustenance of our democracy through effective legislation is never in doubt”.\n“Working with Speaker Femi Gbajabiamila has been an exciting and insightful experience that has enriched my political career.\n“As you celebrate an additional year today, I pray that the Almighty Allah will bless you with many more decades of good health to continue to serve your fatherland to the best of your ability”."
  },
  {
    "headline": "APC, PDP Have Failed Nigerians, Not Fit for Governance, Says NNPP Candidate Kwankwaso",
    "summarized_story": "Former governor of Kano state and presidential candidate of the New Nigeria People’s Party (NNPP) for the 2023 election, Senator Rabiu Musa Kwankwaso has said the ruling All Progressives Congress (APC) and the main opposition, the Peoples Democratic Party (PDP) are no longer fit for governance, having allegedly failed the populace.\n“We have seen the performance of the APC and PDP and all of us believe that they have failed the country woefully and nobody should expect anything from them again.\nThese people in the two parties have failed and failed woefully, they have nothing to offer.\nThat’s where he naturally belongs and has an assurance of becoming a president one day, and not his current sectional NNPP.\nKwankwaso needs a national party like APC to achieve his presidential ambition."
  },
  {
    "headline": "Nigeria: FG’s Inability to Curtail Killings Part of a Hidden Agenda, Benue Governor Ortom Says",
    "summarized_story": "Benue State Governor, Samuel Ortom, said the constant murderous attacks by Fulani herdsmen on communities in the state were not because of the Open Grazing Prohibition and Ranches Establishment Law enacted in the state.\nOrtom attributed the attacks to a hidden agenda by the assailants and a curious failure of the government at the centre to curtail them.\nAccording to Ortom, other states in the country that have no laws prohibiting open grazing are equally facing attacks and killings, in a clear confirmation of the aggressors’ annihilation, subjugation and conquest agenda.\nHe charged Christians, particularly, the clergymen, not to relent in praying to God on the worsening security and other challenges confronting the state.\nOrtom stated that no challenge was too big for God to solve permanently."
  },
  {
    "headline": "‘It’s Been A Privilege’: Petr Cech to Leave Role as Chelsea’s Technical and Performance Adviser",
    "summarized_story": "Petr Cech will leave his role as technical and performance adviser at Chelsea at the end of the month.\nThe former Blues goalkeeper took up the role in 2019, marking his return to Stamford Bridge.\nRelatedStories No Content AvailableThe 40-year-old spent 11 years as a Chelsea player, winning 13 trophies, including four Premier League titles and the Champions League.\n“It has been a huge privilege to perform this role at Chelsea for the past three years,” he said.\nLike Cech, chairman Bruce Buck will step down on 30 June – and last week Chelsea also confirmed the departure of director Marina Granovskaia."
  },
  {
    "headline": "Russia’s Putin to Make First Foreign Trips Since Launching Ukraine War",
    "summarized_story": "Vladimir Putin will visit two small former Soviet states in central Asia this week, Russian state television reported on Sunday, in what would be the Russian leader’s first known trip abroad since ordering the invasion of Ukraine.\nRelatedStories No Content AvailablePavel Zarubin, the Kremlin correspondent of the Rossiya 1 state television station, said Putin would visit Tajikistan and Turkmenistan and then meet Indonesian President Joko Widodo for talks in Moscow.\nIn Dushanbe, Putin will meet Tajik President Imomali Rakhmon, a close Russian ally and the longest-serving ruler of a former Soviet state.\nIn Ashgabat, he will attend a summit of Caspian nations including the leaders of Azerbaijan, Kazakhstan, Iran and Turkmenistan, Zarubin said.\nUkraine calls the invasion an imperial-style land grab."
  },
  {
    "headline": "Crisis-Hit Sri Lanka Shuts Schools, Urges Work from Home to Save Fuel",
    "summarized_story": "Troops in Sri Lanka handed tokens on Monday to people queueing for petrol amid a severe fuel shortage in the nation battling its worst economic crisis in seven decades, while schools shut in Colombo and public employees were asked to work from home.\nShelton, 67, one of those who received a token meant to hold his place in the queue for when fuel becomes available.\nFuel station queues have grown rapidly since last week.\nPublic transport, power generation and medical services will get priority in fuel distribution, with some rationed to ports and airports.\nA team from the International Monetary Fund is visiting Sri Lanka to hold talks on a $3-billion bailout package."
  }
]