[
  {
    "headline": "Experts allege insiders’ collaboration in jailbreaks",
    "summarized_story": "Security experts have said correctional officials cannot be absolved from the incessant attacks on the correctional centres in the country.\nThe experts, in separate interviews, insisted that it is impossible for attacks to have taken place without the connivance of some officials.\n“The integrity of our custodian centres is in question.\nAnother security expert, Timothy Avele said, “The major cause of this increasing prison breaks is lack of actionable intelligence and counter-intelligence by prisons intelligence units.\nMeanwhile, the Minister of Interior, Rauf Aregbesola, has said the Federal Government has started infrastructural upgrade in all correctional centres in the country."
  },
  {
    "headline": "Hushpuppi: Police commission awaits FDC’s recommendations on Kyari",
    "summarized_story": "THE fate of the erstwhile Commander, Intelligence Response Team, Abba Kyari, a Deputy Commissioner of Police, is hanging in the balance as the Police Service Commission awaits the recommendations of the Force Disciplinary Committee on his case.\nIt was gathered that the FDC’s recommendations would form the crux of the commission’s decision and also determine Kyari’s future in the Nigeria Police.\nThe report contained the case file, evidence and findings as well as testimonies from Kyari and other persons and groups linked to the matter.\nThe agency also said Hushpuppi paid $20,600 into a bank account provided by Kyari.\n“After the SIP report was submitted to the AGF and the Police Service Commission, Kyari was queried and he answered the query."
  },
  {
    "headline": "Lekki Port is 66% completed, to be delivered on schedule",
    "summarized_story": "By Godwin OritsePROMOTERS of the Lekki Deep Sea Port have said that the project is now 66 percent completed, indicating that project may be delivered by third quarter of next year.\nDisclosing this in Lagos during a recent inspection visit by a delegation from Lagos State Government led by the Honourable Commissioner for Commerce, Industry and Cooperatives, Hon Dr (Mrs).\nLola Akande, the , Managing Director of the port, Mr Du Ruogang, said that the project is on schedule for completion.\nWe are happy to report that we are at 66% completion, and efforts will be intensified to meet our deadlines”.\nAkande commended the management of Lekki Port and its promoters for the level of work done so far on the construction of the port."
  },
  {
    "headline": "COVID-19 impact on jobs worse than expected – ILO",
    "summarized_story": "The agency is projecting that global hours worked this year will be 4.3 per cent below pre-pandemic levels, the equivalent of 125 million full time jobs.\nThis is a dramatic revision of the projection made in June, of 3.5 per cent or 100 million full-time jobs.\nIn the third quarter of 2021, total hours worked in high-income countries were 3.6 per cent lower than the fourth quarter of 2019, before the pandemic hit.\nBy contrast, the gap in low-income countries stood at 5.7 per cent and in lower middle-income countries at 7.3 per cent.\nThe highly uneven vaccine roll out, means that the effect was largest in high-income countries, negligible in lower middle-income countries and almost zero in low-income countries."
  },
  {
    "headline": "Citizen sues Malami, Akpabio over NDDC forensic audit report",
    "summarized_story": "By Emma Amaize, Regional Editor, South-South, ASABAA Nigerian citizen, Christian Moses Abeh, has taken legal action against the Minister of Justice, Abubakar Malami(SAN), and Minister of Niger Delta, Senator Godswill Akpabio, over the final report of the forensic audit of Niger Delta Development Commission, NDDC.\nIn his suit before a Federal High Court in Asaba, Delta State, the applicant is seeking an order of mandamus by the law court compelling the respondents to furnish him, within seven days, with the complete final report of the forensic audit of the Niger Delta Development Commission, NDDC.\n“The letter dated September 22 is hereto marked as exhibit CMA 2.\n“From September 22 till date, the first and second respondents have refused to disclose the record demanded in exhibit CMA 1,” he said.\nVanguard News Nigeria"
  },
  {
    "headline": "Family pays N5m ransom for kidnapped nursery pupils",
    "summarized_story": "Reliable family source told Vanguard in Akure that they were released by their captors at about 10p.m.\nThe victims, Fikayo two-year-old and Bolu, four-year-old have since reunited with their parents after a Good Samaritan saw them by the road side and informed security operatives.\n“The kidnappers who initially demanded for N40m as ransom and later reduced the money to N5m after negotiating with the victims parents.\n“I can confirm to you that they have regained their freedom and reunited with their parents,” the source said.\nRecall that police detectives recovered the gunmen’s get-away vehicle barely 48 hours after the children were kidnapped on Ado Ekiti highway."
  },
  {
    "headline": "Nollywood not structured to feed artistes, Sam Dede laments",
    "summarized_story": "Sam DedeBy Davies Iheamnachor, PORT HARCOURTNollywood star and a lecturer in the Department of Theatre and Film Studies, University of Port Harcourt, Dr Sam Dede, has expressed regrets that the nation’s creative industry, Nollywood, is not well structured to put food on the table of the practitioners.\nThey spoke at a one-day sensitization programme on “Legal Perspectives to Management of Creative Industry, for students of Theater Art.\nIgelige and Dede insisted that provisions should be made on how other crew members involved in film production would benefit from their intellectual input in every Project.\nThey must properly be acknowledged and the practitioners need to restructure their association, so that each work you do count for you in the next work.”However, Barr.\nIgelige said the Nigeria movie industry has the potential to contribute to the nation’s economy, calling on the government to invest in entertainment."
  },
  {
    "headline": "eNaira: CBN warns Nigerians against fraudsters, fake social media handles",
    "summarized_story": "The Central Bank of Nigeria (CBN) has urged Nigerians to be wary of fraudsters who have been posting fraudulent messages relating to the eNaira launched recently.\n“For the avoidance of doubt, the Central of Nigeria is not the owner of that twitter handle (@enaira_cbdc) and indeed suspended its presence on Twitter following the Federal Government’s ban.\nIn effect, the Bank is not disbursing eNaira currency to citizens.’’Nwanisobi urged Nigerians to always endeavor to seek clarifications on information about the eNaira either by visiting the eNaira website: www.enaira.gov.ng or calling the eNaira contact centre on 080069362472 or visiting any CBN Branch nearest to them.\nHe also advised anyone seeking clarity to visit the enaira current official social media handles: www.facebook.com/myenaira; www.instagram.com/myenaira and www.youtube.com/myenaira.\nNwanisobi urged that suspicious activity by members of the public should be reported to the CBN using [email protected] or to relevant law enforcement agencies."
  },
  {
    "headline": "Fortify Correctional Centres against jailbreak in Ondo – Akeredolu tells Police",
    "summarized_story": "With the incessant attacks by gunmen on correctional centres in the country, Governor Oluwarotimi Akeredolu of Ondo State has charged the police command in the state to deploy strategies to wade off potential attacks in the state.\nWhile stressing that it is imperative for the police to take adequate measures to secure Correctional Centres across the state, Akeredolu maintained that the coordinated attacks speaks volume.\nAkeredolu added that correctional centres in the state had high number of suspects standing trial in cases of alleged murder, kidnapping, rape and destruction of farmlands, hence the need for the urgent safety measures.\nThe governor maintained that among the high profile suspects in the facilities were those standing trial in the murder of Funke Olakunrin, daughter of elder statesman, Pa Ruben Fasonranti.\n“While the Southwest Security Network, otherwise known as Amotekun has demonstrated considerable capacity in tackling insecurity, it is pertinent that the Nigeria Police authority, especially the State Command, deploys more men to secure Correctional Homes in the State."
  },
  {
    "headline": "Strike: Will not succumb to any form of intimidation, pressure – SSANU",
    "summarized_story": "There seems to be no end to the ongoing strike action embarked upon by the non- academic staff of the Taraba State University as the association vowed not to shift ground pending when their demands are fully addressed.\nThe association, which are made up of the Senior Staff Association of Nigeria Universities (SSANU) and the Non-academic Staff Union of Nigerian Universities (NASU) under the umbrella of Joint Action Committee, Taraba State University Branch, as noticed by DAILY POST has been on strike for over a month.\nTheir grievances, which include the non- payment of promotion allowances, pensions, among others, they said must be met by the authority concerned before the strike which is no doubt telling negatively on the image of the institution will be suspended.\nWondering why the management of the institution and the state government always go about dragging their feet on issues that have to do with the welfare of the association, the chairman of SSANU, Linus Williams, could not fathom why the Commissioner of Tertiary Education Edward Baraya, has continued to mount pressures on the association to suspend the strike without deeming it fit to address their demands.\nThe students who are fast loosing their patients as a result of the strike were noticed to have recently staged peaceful demonstrations calling on the authorities to mop up the drooling tears on the faces of the striking non academic staff of the University."
  },
  {
    "headline": "OML 11: Controversies trial visit by Ogoni leaders to President Buhari",
    "summarized_story": "The visit to President Muhammadu Buhari by leaders of Ogoniland appears to be generating controversies among leaders of the ethnic nationality.\nThe operation of OML 11 which is located in some parts of Ogoniland is at the heat of the controversies.\nThe President of the Movement for the Survival of Ogoni people, Prince Bira, who briefed newsmen after a steering committee meeting of the group in Port Harcourt on Wednesday, said the visit was meant to “hoodwink unsuspecting Ogoni leaders” into facilitating the handover of the OML 11 to an indigenous oil firm which he said represents their business interest.\nDAILY POST gathered that a meeting in which the OML11 operator-ship was to be handed over to the said oil firm after the meeting with the president could not go on in Abuja due to the disagreement among Ogoni leaders.\nThe MOSOP president also announced the rejection by Ogoni people the “proposed pardon” of late environmental activist Ken Sarowiwa and eight other Ogoni leaders, who he said should be exonerated instead."
  },
  {
    "headline": "Boko Haram sends bomb makers to Kaduna as ISIS visits ISWAP in Lake Chad",
    "summarized_story": "Boko Haram under the leadership of Bakoura Buduma have relocated bomb makers to a forest in Kaduna State.\nThe Boko Haram sect is deploying fighters to mountainous forests in the North-West State.\nBuduma recently led the hit against Islamic State’s West Africa Province (ISWAP) in retaliation of the murder a BH commander, Abubakar Dogo Daawa.\n“They are also to join forces with ISWAP to eliminate terrorists of the Bakoura Faction of Boko Haram”, an intelligence source told PRNigeria.\nIn July, intelligence uncovered bandits in Niger and Zamfara States were attending drills conducted by Boko Haram/ISWAP."
  },
  {
    "headline": "Maria has never dated married men, says Uche Maduagwu",
    "summarized_story": "Maria has never dated married men, says Uche MaduagwuActor Uche Maduagwu has confronted accusers of ex-BBNaija housemate Maria over allegations of dating a married man and threatening the wife.\nReacting to the allegations against Maria, Maduagwu via an Instagram post revealed he recently had a phone conversation with her and she was in tears the whole time.\nU no fit beat am if she was but she has never dated married men.\nAnd she will not start in Dubai.”Reacting to Uche Maduagwu’s post, many social media users said Maria is extremely pretentious and possibly lying while also slamming him.\n_penaouyamba_ said: “Maria still playing wild card games.”enowmirabelenow wrote: “Maria can pretend for Africa.”dominic_confidence stated: “You dey crazy I swear..your people should do something before it get out of hand."
  },
  {
    "headline": "Court rejects Nigeria’s request to review judgment on death row inmates",
    "summarized_story": "The ECOWAS Court of Justice has dismissed an application brought by the Federal Republic of Nigeria for a review of the court’s judgment of November 18, 2020 in which it awarded N20million to two former death row inmates for the treatment meted out on them while in prison.\nShortly after the judgment last year, the Nigerian government applied to the court for a review of its decision, arguing that there were new facts on which the court could reverse itself.\n- Advertisement -In a judgment on Tuesday, the ECOWAS court, currently sitting in Abidjan, held that it could not entertain the application by Nigeria.\nAccording to a statement by the court, Justice Januária Costa, who read the judgment, stated that the application by Nigeria was inadmissible, because of the country’s inability to disclose any new fact to the court in accordance with its Rules.\n- Advertisement -The panel of three judges, led by Justice Dupe Atoki, further held that what the Nigeria relied upon as a new fact seemed to be an ordinary appeal, which cannot be brought to the court, because of the finality of its judgment."
  },
  {
    "headline": "INEC free to transmit Anambra governorship poll results electronically – Senate panel",
    "summarized_story": "Chairman Senate Committee on the Independent National Electoral Commission (INEC) Senator Kabiru Gaya on Wednesday said the electoral body is free to transmit the Anambra State governorship election result electronically if it so desires.\nGaya gave this hint while briefing reporters after the National Assembly Joint Committee on Electoral Matters and- Advertisement -INEC met with stakeholders on the November 6, 2021 governorship election in Anambra State.\nAsked if INEC can transmit results of the election electronically, Gaya said: “It is left for INEC to decide whether it will transfer the election results in Anambra or not.\n- Advertisement -“The only way to achieve free and fair, credible election in Anambra is for everybody to eschew violence,” Gaya added.\nNational Chairman of INEC, Professor Yakubu Mahmood, said the agency has recovered from the series of attacks by yet to be identified persons in Anambra state."
  },
  {
    "headline": "BREAKING: FEC approves NNPC to fix 21 federal roads at N621.2bn",
    "summarized_story": "The Federal Executive Council (FEC) on Wednesday gave the Nigerian National Petroleum Corporation (NNPC) the go-ahead to take over the reconstruction of 21 federal roads across the country.\nAccording to him, this is in line with Executive Order No.\n007 of 2019 cited as the Companies Income Tax (Road Infrastructure Development and Refurbishment Investment Tax Credit Scheme) Order, 2019 (“EO7 of 2019” or “the Scheme”), signed by President Muhammadu Buhari.\nThe Minister said it was a strategic intervention under the Federal Government Road Infrastructure and Refreshment Tax Credit Scheme.\nFashola further explained that under Executive Order 7, it allows the private sector to deploy in advance the taxes they would pay for infrastructure development."
  },
  {
    "headline": "FEC approves NNPC to fix 21 federal roads at N621.2bn",
    "summarized_story": "Briefing State House Correspondents at the end of the council meeting, the Minister of Works and Housing, Babatunde Fashola, SAN, the selected 21 roads are 1804.6 kilometers.\nSo NNPC has identified 21 roads that it wants to deploy.\n“So, NNPC has sought and council has approved today that NNPC deployed tax resources to 21 roads covering the total distance of 1,804.6 kilometers across the Six geopolitical zones.\n“Out of those 21 roads, nine are in North Central, particularly Niger state.\n“So, as I said, it is a total of 21 roads."
  },
  {
    "headline": "Kalu to give 700 Nigerians scholarship to study Medicine in 2021/22 academic year",
    "summarized_story": "From Okey Sampson, UmuahiaSenate Chief Whip and senator representing Abia North in the Senate, Dr. Orji Uzor Kalu has concluded arrangement to give 700 Nigerians scholarship to study Medicine in Universities of their choice in the country and abroad.\nThe media aide (South East) to Kalu, Maduka Okoro who made this known in a statement said, said the scholarship will be anchored by Orji Uzor Kalu Foundation.\n“In the quest to provide quality health care services and improved health conditions for Nigerians, the senator representing Abia North Senatorial District in the National Assembly, His Excellency, Dr. Orji Uzor Kalu, through the Orji Uzor Kalu Foundation, has inaugurated a fully-funded scholarship scheme to benefit 700 Nigerians across the 36 states of the federation during the 2021/22 academic year.\n“The scholarship scheme offers beneficiaries the opportunity to pursue courses in the medical discipline obtainable from both foreign and Nigerian universities.\n“The goals and programmes of Orji Uzor Kalu Foundation align with the Nigeria’s national policy on health, as well as the United Nations Sustainable Development goals number 3, Okoro said."
  },
  {
    "headline": "Benue: 6 kidnapping victims regain freedom",
    "summarized_story": "Hemba disclosed the news to reporters by telephone on Wednesday, saying the victims were released at about 6 pm on Tuesday.\n‘Yes, they have been released and they are on their way back to Benue,’ he told newsmen.\nBandits intercepted a Sokoto bound Benue Links bus last week Tuesday and abducted some of the passengers, among whom were two Corps Members posted to Kebbi State and four other persons.\nOur correspondent gathered that the abducted victims include Joseph Zaaka Aondona, Sedoo Tsokar, Jennifer Awashima Iorliam and Sechivir, Muhammadu Saminu and Muhammadu Safiam.\nOthers are Serchivir, a young girl who was visiting her relatives in Sokoto, as well as two brothers, Saminu and Safiam Muhammadu."
  },
  {
    "headline": "NEMA, Police rescue man from verge of suicide in Lagos",
    "summarized_story": "Disaster was averted on Wednesday morning, after men of the Nigeria Police, National Emergency Management Agency (NEMA) and Lagos State Emergency Management Agency (LASEMA) jointly rescued a middle aged man from the verge of suicide.\nIt was learnt that the man who was identified as Daniel Chibuike Bassi, an aluminum technician had climbed a 200 feet mast, allegedly on the verge of killing himself by jumping from mast.\nWitnesses said security and emergency agency operatives were able to convince him to to come down from the 200 feet mast unhurt.\nBassi, who is an aluminum technician works in Aluminum Village and lives at Dopemu, in Lagos.\nFarinloye said: “He told us that he arrived at the scene at about 0800hours and started climbing the mast at 0830hour."
  },
  {
    "headline": "PDP won’t zone presidency in 2023 –Saraki",
    "summarized_story": "By Chinelo ObogoFormer Senate president, Dr. Bukola Saraki, has said despite the fact that the Peoples Democratic Party (PDP) has zoned its national chairmanship to the North Central, it did not prevent any qualified aspirant from any zone from contesting the presidency in 2023.\nSpeaking on a national television programme monitored in Lagos, yesterday, the former Kwara State governor debunked speculations that the party would zone its presidency to the south since it zoned its national chairmanship to the north.\nMore importantly, the country is in a different place now and Nigerians have seen what the ruling party has to offer.\n“Because some people defected from the PDP to APC does not mean that I would defect.\nWe cannot afford to get it wrong in 2023 and PDP is in a better position to give credible leadership.”100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "News in Photographs: Osinbajo Chairs FEC Meeting",
    "summarized_story": "By Deji ElumoyeThe weekly Federal Executive Council (FEC) meeting is holding at the State House, Abuja with Vice-President Yemi Osinbajo presiding.\nThe virtual meeting is holding at the conference room of the First Lady’s office with Osinbajo standing in for President Muhammadu Buhari who is attending the 5th Edition of Future Investment Initiative Summit holding in Riyadh, Saudi Arabia.\nAmong those physically attending the meeting are the Secretary to Government of the Federation, Boss Mustapha; Ministers of Information and Culture, Lai Mohammed; Attorney General of the Federation and Minister of Justice, Abubakar Malami; Finance, Budget and National Planning, Zaineb Ahmed; Works and Housing, Babatunde Fashola; Aviation, Hadi Sirika; and Power, Abubakar Aliyu.\nOther ministers, as well as the Head of the Civil Service of the Federation, Folashade Yemi-Esan, are attending virtually from their various offices in Abuja.\nSee ImagesShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "NNPC: $3.097bn Investment Opportunities Exist in Condensate Refineries",
    "summarized_story": "•Says Nigeria needs $2.7bn to improve products supply, distribution infrastructure•Projects petroleum products demand to grow to 17.3m MT by 2025Peter UzohoThe Nigerian National Petroleum Corporation (NNPC) has said investment opportunities worth nearly $3.097 billion currently exist in the country’s condensate refineries’ space.\nModular refineries are also adding capacities, such as the 5,000 BPSD Waltersmith refinery, which will be upgraded to 50,000 BPSD.\n“Additional 250,000 BSPD is expected to come from the Condensate Refineries through the private sector partnership.\nThe co-location and condensate refineries will close the PMS supply-demand gap and create positive returns to the investors.\nAs investments in hydrocarbon continued to wane due to energy transition and geopolitics, Kyari said the world economy faced shortages, high energy prices, rising inflation and sluggish growth."
  },
  {
    "headline": "Again, CJN Laments Reckless Court Orders",
    "summarized_story": "Muhammad recalled that the reckless granting of ex parte orders reached a worrisome height recently, and he had to warn some judges to desist from such conduct.\n“The legal profession should, indeed, take the lead in all human affairs.\nWe cannot take the lead when our courts issue ex-parte orders recklessly.\nHe said, “The legal profession is the building under which we are sheltered.\nMay God forbid!”While congratulating Justice Baba-Yusuf on his appointment, the CJN prayed to God to guide, protect and assist him in the discharge of his duty as head of court."
  },
  {
    "headline": "Politicians Still Influencing Judges to Use Court against Democracy",
    "summarized_story": "Whether the appellate court would accede to the demand or not is another, particularly, taking into consideration the recent position of appellate court justices with respect to exparte granted by High Court judges.\nIt is worthy of mention that the appellate court and even the Supreme Court had descended heavily on the High Court judges particularly, in the Anambra governorship suits.\nThe appellate court claimed that the trial court erred by entertaining a suit wherein it lacked jurisdiction.\nBut Okeke challenged the authenticity of the Oye leadership at a Federal High Court in Jigawa State, where judgment was given in his favour.\nBut before Secondus could carry out the order, Justice Edem Kooffreh of a Cross River State High Court on August 28, restrained him from resuming."
  },
  {
    "headline": "Buhari Unveils eNaira as CBN Launches Instrument to Support 300 Companies",
    "summarized_story": "He stressed that Nigeria was the first country in Africa and one of the first in the world to introduce digital currency.\nHe disclosed that the journey to create a digital currency for Nigeria began in 2017.\nCBN decided to implement its own CBDC and to name the digital currency eNaira, with the expectation that the innovation would make significant positive difference to Nigeria and Nigerians, he stated.\nThe eNaira wallet is required to access, use and hold eNaira, which will be exchangeable for other Central Bank Digital Currencies (CBDC).\nThe CBN added that the AML/CFT checks for fraud prevention and detection would apply on the eNaira platform."
  },
  {
    "headline": "Anambra Election’ll Hold Even If Nnamdi Kanu Isn’t Released – Asari Dokubo-led Biafran Group Warns IPOB",
    "summarized_story": "The de facto customary government of Biafra led by Mujahid Asari Dokubo says the November 6, 2021 governorship election in Anambra State will hold as scheduled by the Independent National Electoral Commission (INEC).\nIPOB had declared a one week sit-at-home protest across the South-East states starting from November 5, the eve of Anambra governorship election.\nThe group said the protest was aimed at prevailing on the Nigerian government to release Nnamdi Kanu.\nIt vowed that the protest would go on as planned if Kanu was not released before November 4.\nReacting, the De facto Biafra Customary Government spokesperson said the sit-at-home order was ‘criminal’."
  },
  {
    "headline": "Anambra Election’ll Hold Even If Nnamdi Kanu Isn’t Released – Asari Dokubo-led Biafran Group Warns IPOB",
    "summarized_story": "The de facto customary government of Biafra led by Mujahid Asari Dokubo says the November 6, 2021 governorship election in Anambra State will hold as scheduled by the Independent National Electoral Commission (INEC).\nIPOB had declared a one week sit-at-home protest across the South-East states starting from November 5, the eve of Anambra governorship election.\nThe group said the protest was aimed at prevailing on the Nigerian government to release Nnamdi Kanu.\nIt vowed that the protest would go on as planned if Kanu was not released before November 4.\nReacting, the De facto Biafra Customary Government spokesperson said the sit-at-home order was ‘criminal’."
  },
  {
    "headline": "Anambra Election’ll Hold Even If Nnamdi Kanu Isn’t Released – Asari Dokubo-led Biafran Group Warns IPOB",
    "summarized_story": "The de facto customary government of Biafra led by Mujahid Asari Dokubo says the November 6, 2021 governorship election in Anambra State will hold as scheduled by the Independent National Electoral Commission (INEC).\nIPOB had declared a one week sit-at-home protest across the South-East states starting from November 5, the eve of Anambra governorship election.\nThe group said the protest was aimed at prevailing on the Nigerian government to release Nnamdi Kanu.\nIt vowed that the protest would go on as planned if Kanu was not released before November 4.\nReacting, the De facto Biafra Customary Government spokesperson said the sit-at-home order was ‘criminal’."
  },
  {
    "headline": "eNaira App Removed From Google Play Store After Series Of Complaints, Poor Rating",
    "summarized_story": "The recently launched eNaira Wallet application has been removed from Google Play Store barely 36 hours after it was launched by the Central Bank of Nigeria, SaharaReporters has gathered.\nHowever, the app is currently available on the Apple app store with 2.6 over 5 ratings.\nThe digital currency has two applications, which are eNaira speed wallet and eNaira merchant wallet.\nOn Monday, the two apps were rolled out on the Google play store and the Apple store.\nIt is not clear whether the app was removed due to the poor rating it suffered or if the CBN had done that itself."
  },
  {
    "headline": "eNaira App Removed From Google Play Store After Series Of Complaints, Poor Rating",
    "summarized_story": "The recently launched eNaira Wallet application has been removed from Google Play Store barely 36 hours after it was launched by the Central Bank of Nigeria, SaharaReporters has gathered.\nHowever, the app is currently available on the Apple app store with 2.6 over 5 ratings.\nThe digital currency has two applications, which are eNaira speed wallet and eNaira merchant wallet.\nOn Monday, the two apps were rolled out on the Google play store and the Apple store.\nIt is not clear whether the app was removed due to the poor rating it suffered or if the CBN had done that itself."
  },
  {
    "headline": "Garba Shehu: In Saudi Arabia, Buhari offered intense prayers for peace in Nigeria",
    "summarized_story": "Garba Shehu, presidential spokesman, says President Muhammadu Buhari, on Wednesday, prayed for peace and security in the country.\nAdvertisementOn Monday, Buhari departed Abuja for Riyadh, Saudi Arabia, to participate in the investment conference organised by the Future Investment Initiative Institute.\nIn a statement issued on Wednesday, Shehu said the president stopped over in Madina and offered “intense prayers” for the country.\n“President Buhari and the delegation prayed for the well-being of the nation and its people and for the full restoration of peace and security in Nigeria and around the globe.\nPrayers for the economy, ravaged by the pandemic to fully recover for the benefit of the nation and its people, were also offered."
  },
  {
    "headline": "Garba Shehu: In Saudi Arabia, Buhari offered intense prayers for peace in Nigeria",
    "summarized_story": "Garba Shehu, presidential spokesman, says President Muhammadu Buhari, on Wednesday, prayed for peace and security in the country.\nAdvertisementOn Monday, Buhari departed Abuja for Riyadh, Saudi Arabia, to participate in the investment conference organised by the Future Investment Initiative Institute.\nIn a statement issued on Wednesday, Shehu said the president stopped over in Madina and offered “intense prayers” for the country.\n“President Buhari and the delegation prayed for the well-being of the nation and its people and for the full restoration of peace and security in Nigeria and around the globe.\nPrayers for the economy, ravaged by the pandemic to fully recover for the benefit of the nation and its people, were also offered."
  },
  {
    "headline": "COVID: Sanwo-Olu warns of 'potential' fourth wave, flags off mass vaccination campaign",
    "summarized_story": "Babajide Sanwo-Olu, governor of Lagos, says the state runs the risk of experiencing a fourth wave of the COVID pandemic.\nThe programme aims to vaccinate four million residents before the end of 2021.\nAdvertisementThe Lagos COVID vaccination campaign, which is in collaboration with the National Primary Health Care Development Agency (NPHCDA), will cover residents who are 18 years and above.\n4 million Lagosians Vaccinated Against COVID-19’ to target the full vaccination of 4 million Lagos residents before the end of December 2021.\nAdvertisement“We have set up COVID-19 vaccination in all our 205 public primary health centres, 14 of the state’s second and tertiary hospitals,” he added."
  },
  {
    "headline": "COVID: Sanwo-Olu warns of 'potential' fourth wave, flags off mass vaccination campaign",
    "summarized_story": "Babajide Sanwo-Olu, governor of Lagos, says the state runs the risk of experiencing a fourth wave of the COVID pandemic.\nThe programme aims to vaccinate four million residents before the end of 2021.\nAdvertisementThe Lagos COVID vaccination campaign, which is in collaboration with the National Primary Health Care Development Agency (NPHCDA), will cover residents who are 18 years and above.\n4 million Lagosians Vaccinated Against COVID-19’ to target the full vaccination of 4 million Lagos residents before the end of December 2021.\nAdvertisement“We have set up COVID-19 vaccination in all our 205 public primary health centres, 14 of the state’s second and tertiary hospitals,” he added."
  },
  {
    "headline": "Court freezes bank accounts of Benue government over 'N333m loan'",
    "summarized_story": "A federal high court in Abuja has made an interim order freezing bank accounts of the Benue state government over its involvement in securing a “N333 million loan” in 2008.\nHe also directed that the bank accounts of HPPS Multilink Services Ltd, a firm, be frozen pending the hearing and the determination of the substantive suit.\nAdvertisementAccording to the order, the affected bank accounts of both respondents are domiciled in Access Bank Plc, Citibank Nigeria Limited, Eco Bank Nigeria Plc, Fidelity Bank Plc, First Bank Nigeria Plc, First City Monument Bank Plc, and Guaranty Trust Bank Plc.\nOthers include those in Heritage Bank Plc, Keystone Bank Limited, Polaris Bank Limited, Stanbic IBTC Plc, Standard Chartered Bank Nigeria Limited, Sterling Bank Plc, Suntrust Bank Nigeria Limited, Union Bank of Nigeria Plc, United Bank for Africa Plc, Unity Bank Nigeria Plc, Wema Bank Plc and Zenith Bank Plc.\nAdvertisementIn the affidavits in support of the suit, AMCON described the loan as a toxic loan of eligible bank assets transferred to it by law to recover."
  },
  {
    "headline": "Building a food supply operating system: the Vendease story",
    "summarized_story": "There are a lot of fragmented moving parts in running procurement for businesses in Africa, especially small food businesses.\nFood businesses are mostly vulnerable to substandard goods, fluctuating pricing system, expensive middlemen, wastage of productive time while restocking, and unreliable logistics.\nThey all vented and, as usual, discussed the problem for a while, asking what if they could do something to help small food businesses like this to scale.\nPivoting into a more sustainable systemThe initial idea was simple: enable food businesses to get their regular supply at the quality and price they wanted.\nVendease doesn’t just allow food businesses place orders for food supplies and track them; they can also manage inventory, track expenses and gain access to credit facilities."
  },
  {
    "headline": "Africa eShop, DHL’s online retail service, is shutting down this month",
    "summarized_story": "After two years of operation, DHL Africa is shutting down its pan-African online retail platform, e-Shop, at the end of the month.\nSorry for any inconvenience this may have caused,” a message on the Africa eShop website reads.\nTechCabal reached out to DHL Africa for answers but has yet to receive a response at the time of publication.\n— DHL Africa (@DHLAfrica) October 21, 2021A white-labeled productWhile the Africa eShop appears to be a standalone e-commerce platform owned by DHL, that isn’t the case.\nBeing a white-labeled product, DHL’s Africa eShop website and offerings are very similar to that of MallforAfrica."
  },
  {
    "headline": "How Koa is helping Kenyans build and manage wealth",
    "summarized_story": "After doing that for a while, she joined MEST Africa.\nAfter leaving MEST Africa, the duo forayed into different businesses but kept in touch and would always meet up whenever they were in the same city.\nSo, Koa is killing two birds with one stone by holding its users’ money in a money market through a partnership with Britam, an asset manager in the Kenyan market.\nOn Koa, users earn up to 10% interest on their money annually, depending on market conditions.\nSo are Koa users aware that their money is being invested in a money market?"
  },
  {
    "headline": "Here’s everything you need to know about Apple’s new releases",
    "summarized_story": "In a beautiful transition between Tim Cook and Zain Lowe, Apple also revealed the Music Voice Plan, a new subscription category for Apple Music that allows users to seamlessly use Siri with Apple Music.\nThe fall event started off with the introduction of Apple Music Voice Plan, a new subscription offering that allows users to seamlessly enjoy Siri with Apple Music.\nApple Music plansNew colours for Apple HomePod Mini Smart SpeakerAesthetics—that’s the simplest way to describe this update.\nM1 Pro And M1 Max ChipsEarlier in this article, we called these updates the two biggest surprises of the night.\nThe basic models come as standard with the M1 Pro, 16GB of Unified Memory and a 512GB SSD."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Naira’s digitisation via the eNaira: Beyond financial inclusion",
    "summarized_story": "Share this article:Introduction: Naira’s digitisation (the eNaira)A very recent accomplishment of the Central Bank of Nigeria (CBN) is the issuance of the new Central Bank Digital Currency (CBDC), the eNaira.\nConsequently, financial institutions have the responsibility to onboard their customers and integrate the eNaira wallet feature into their digital banking channels.\nIt is hoped that the design model behind the eNaira can permit coordination amongst peers once mCBDCs models become operational.\nAs already stated, the DLT solution for cross-border and FX funds transfer has huge potentials for simplifying cross-border payment with great savings on time and money.\nConclusionNigeria has taken another bold step towards trade finance digitisation by introducing the eNaira; however, the journey has just begun."
  },
  {
    "headline": "What you should know about raising funds, Autochek’s $13.1m seed, VeriFind by VerifyMe, Paystack’s Pay for Me feature",
    "summarized_story": "Another smart address verification toolIs it just me?\nSmart address verification tools like Plus Codes, OkHi, and VeriFind, have been created to solve this challenge.\nIn July 2021, Nigerian Identity verification company, VerifyMe launched VeriFind, a geotagging solution to enhance verifying addresses.\nAlthough, with VeriFind’s technology backed by over 20,000 last mile address verification agents, its remote reach is highly probable.\nLet’s say I want to use the Pay for Me feature to buy a bag on Paystack’s storefront."
  },
  {
    "headline": "First time founder? Here’s everything you need to know as you start raising money",
    "summarized_story": "On their own, these are challenging tasks for anyone, but for a first-time founder with little or no experience, it can be overwhelming.\nMost investors — whether angel investors or traditional VC firms — receive several pitches daily from entrepreneurs looking to get funded.\nFor this article, we’ve focused on raising your first round of funding, usually in the first few months of operation.\nFor example, you don’t need to apply to Y Combinator because everyone you know is applying; that’s the wrong approach to take.\nThat may change as the ecosystem develops, but you need to ensure that your interest aligns with theirs."
  },
  {
    "headline": "Investors pile into 1yr Nigeria T-Bills despite lower return",
    "summarized_story": "Investors overlooked lower interest rates on the one-year Nigerian Treasury Bill at Wednesday’s primary market auction, attempting to invest three times the amount that was up for sale.\nThe strong demand was despite the government offering a lower interest rate compared to the last auction.\nInvestors had expected lower interest rates at Wednesday’s auction even though they would have wished for better returns to compensate for high inflation.\nThe problem with settling for lower returns however is that it further widens the country’s negative real return on investment.\nAt 6.9 percent, the return on the one-year Treasury Bill leaves investors with a negative real return of -9.73 percent from 9.28 percent prior to the auction."
  },
  {
    "headline": "Hassan-Odukale built First Bank majority stake in less than a year",
    "summarized_story": "Tunde Hassan-Odukale, through direct and indirect shares, built a majority shareholding in FBN Holdings plc (FBNH), to gain controlling stake in the financial holding company this year, according to data analysed by BusinessDay.\nAn analysis of First Bank’s annual report shows that Hassan-Odukale’s direct stake in FBN Holdings was 8,854,003 units while his indirect stake was 360,961,091 units as at the end of 2020.\nData gleaned from the letter show that the direct and indirect shares of Hassan-Odukale in the bank now total 1.9 billion units.\nHis indirect holding through Haskal Holdings Limited is 13,229,148 units or 0.04percent; while his indirect holding through Leadway Capital &Trust Limited is 1,004,528 units.\nGTI has set a target price (TP) of N15.20 for FBN Holdings, which represents an upside potential of 24.08percent."
  },
  {
    "headline": "Nigeria’s annual spending on subsidy could exceed Eurobond borrowing",
    "summarized_story": "Nigeria’s excessive borrowing could spark fresh agitation after it emerged that Africa’s largest oil producer could spend more on fuel and power subsidies this year than it raised through a Eurobond offering last month.\nCombined, the interventions would surpass the $4 billion the government raised through a Eurobond in September.\nBuhari has shelved plans announced last March to eliminate the costly fuel subsidies.\nA portion of these shipments is smuggled to nearby countries where the product is much more expensive.\n“Nigeria is subsidizing the entire West African region,” Minister of Power Abubakar Aliyu said on Tuesday."
  },
  {
    "headline": "Relocation of Central Hospital: Obaseki committed to providing quality healthcare for all Edo residents – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has reiterated its commitment to the provision of quality healthcare services to Edo people, noting that ongoing reforms in the health sector is aimed at redesigning the healthcare system, making the state a medical hub.\nAddressing journalists in Benin City, in response to the recent media attacks by the Edo State Chapter of the All Progressives Congress (APC) on the planned structural reforms to be carried out by the Edo State Government within the premises of the Edo Central Hospital, Edo State Commissioner for Communication and Orientation, Hon.\nAndrew Adaze Emwanta JP, said the healthcare sector under the Governor Godwin Obaseki-led administration has received a tremendous boost within the last five years.\nOn September 19 last year, Edo people gave the Governor a mandate under the Making Edo Great again (MEGA) Manifesto to develop Edo State.\nSo, there is no retreat or surrender on the developmental mandate freely given by Edo people to our beloved Governor, for which the health sector is not an exception.”..."
  },
  {
    "headline": "FoEN Sensitizes COP26 Delegates On Climate Change Liabilities, Payments – Nigerian Observer",
    "summarized_story": "Reiterating this point, he said,“According to the Intergovernmental Panel on Climate Change report, climate change impact will continue to be on the rise and with growing intensity hence the need for urgency.\nFirstly, the pledge to mobilizing US$100 billion annually by 2020-2025 as funds to addressing climate change actions stands at about 30% and is nowhere near its mark.\nDeveloping countries should redouble their stand to demand for a fair, just, and equitable energy transition and the climate finance to address climate change.\nAccording to a recent study, the world’s leading polluters have racked up a US$10 trillion carbon debt for carbon dioxide emissions since 1990.\nFurther, the impact of climate change and Covid-19 pandemic and their impacts on escalating the debt service burden on African states is horrendous."
  },
  {
    "headline": "Obaseki urges innovations to conserve, safeguard audio-visual heritage – Nigerian Observer",
    "summarized_story": "Obaseki gave the charge in commemoration of the World Day for Audiovisual Heritage, marked every October 27 by the United Nations Scientific, Educational and Cultural Organisation (UNESCO), and other sister organisations.\nThe governor, who restated the need to conserve and safeguard valuable audiovisual resources for future generations, reassured that the museum project in the state will serve as a critical institution to preserve the audio-visual heritage of Edo people.\nConserving this heritage and ensuring it remains accessible to the public and future generations is a vital goal for all memory institutions, as well as the public at large.\n“The World Day for Audiovisual Heritage (WDAH) provides an occasion to raise general awareness of the need to take urgent measures and to acknowledge the importance of audiovisual documents.\nIt serves as an opportunity for member states to evaluate their performance with respect to implementing the 2015 Recommendation Concerning the Preservation of, and Access to, Documentary Heritage, Including in Digital Form.”..."
  },
  {
    "headline": "Obaseki felicitates with Dan Orbih at 60 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has congratulated Chief Dan Orbih, on his 60th birthday.\nThe governor, in a statement, wished Orbih many more years of celebration in good health and happiness, praying that God grants him wisdom and grace to continue to serve our great nation, Nigeria.\nObaseki noted, “On behalf of the government and people of Edo State, I congratulate you, Chief Dan Osi Orbih as you join the sexagenarians.\nI wish you many more years of impactful service to our dear country.”..."
  },
  {
    "headline": "British university hands over stolen Benin bronze cockerel to Nigeria",
    "summarized_story": "A Cambridge University college has handed over the statue of a bronze cockerel looted by British colonial forces during its invasion of Benin in 1897 to representatives of Nigeria.\nThe statue, locally called “Okukur”, was given to Jesus College in 1905 by the father of a student, BBC reported.\n“It’s massively significant,” BBC quoted the master of Jesus College, Sonita Alleyne, as saying at a handover ceremony held at the college Wednesday.\n“It’s a momentous occasion.”She added that returning the artefact was the “right thing to do” especially because the said bronze statue was of “cultural and spiritual significance to the people of Nigeria.”“It’s part of their ancestral heritage,” Ms Alleyne added.\nHaving crushed Benin’s resistance to its expansionist move, the eventual conquest of Benin by British forces was characterized by large scale systematic destruction and looting."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Senate rejects Buhari’s $700m loan request for water projects",
    "summarized_story": "The Senate Committee on Local and Foreign Debts on Wednesday rejected President Muhammadu Buhari’s loan request to the National Assembly for Sustainable Urban and Rural Water Supply, Sanitation and Hygiene under the Ministry of Water Resources.\nMembers of the panel took a turn to fault the loan for Sustainable Urban and Rural Water Supply, Sanitation and Hygiene, PUNCH reported.\nThe Chairman of the Committee, Senator Clifford Ordia said three different loans had been approved for various water projects.\nI don’t support this one again, enough is enough.”Also kicking against the loan, Senator Ibrahim Oloriegbe demanded the criteria for selecting the benefiting states.\nThe senators appeared not to be convinced with the Permanent Secretary’s explanation on the previous loans approved for water projects."
  },
  {
    "headline": "It’s fake news,” NPHCDA denies seeking for $200m loan for mosquito nets",
    "summarized_story": "The National Primary Health Care Development Agency (NPHCDA), has denied advocating for $200m loan for mosquito nets, describing the report as fake news.\nThe agency’s Head of Public Relations Unit, Mohammad Ohitoto, in a statement titled ‘NPHCDA did not advocate for $200m loan for malaria nets,’ noted that the allocations were unfounded.\nThe denial follows a report that the Executive Director of NPHCDA, Faisal Shuaib, buttressed that the $200m loan by the Federal Government was for importation and local production of mosquito nets.\n“This is to inform Nigerians that this statement is not only untrue, it is a figment of the imagination of the writer as the CEO never discussed the malaria programme nor granted any interview on the malaria programme.\n“It is pertinent to state that the Malaria programme is the responsibility of the National Malaria Elimination Programme."
  },
  {
    "headline": "IMF announces retirement of Deputy Managing Director, Mitsuhiro Furusawa",
    "summarized_story": "International Monetary Fund (IMF) Managing Director Kristalina Georgieva, has announced that Mitsuhiro Furusawa intends to conclude his service as Deputy Managing Director on November 30, 2021.\nHis exemplary diplomatic skills and always thoughtful interactions have commanded respect and ensured excellent relations with member countries.\nMr. Furusawa also spearheaded fundraising efforts for the Catastrophe Containment and Relief Trust.\nHe is well known for making sure that the views of all member countries are given due attention.\ndegree, Mr. Furusawa also graduated in 1983 from the École Nationale d’Administration in Paris."
  },
  {
    "headline": "Yuguda highlights role of sports in economic devt as he receives trophy from victorious SEC Football Team",
    "summarized_story": "Yuguda stated this when he was presented with the trophy won by the victorious SEC Football Team at the just concluded Central Bank of Nigeria All Financial Institutions Football Tournament.\nHe expressed optimism that this year’s edition will also lead to the discovery of young talents that would do the country proud.\n“For our young players in the SEC team, put in more efforts because the sky is your limit.\nFootball is a great industry and it brings more joy to the nation because anytime the football team of Nigeria plays, everyone comes together to support them,” Yuguda said.\nHe advised members of the SEC victorious team not to get carried away by their victory and forget the importance of education."
  },
  {
    "headline": "HACEY Launches Clean Water Initiative Project In 3 States",
    "summarized_story": "A non-governmental organisation, HACEY Health Initiative with Aspire Coronation Trust Foundation, has launched the Clean Water Initiative Project to implement the advocacy of WASH Initiative project at state and community levels in Ondo, Imo and Delta States.\nThe stakeholders explained that the initiative was in fulfillment to drive the implementation of WASH Initiative project at both community and state levels.\nProject Lead, Clean Water Initiative at HACEY Health Initiative, Chioma Osakwe, explained that the project aimed to reduce WASH-related diseases in 10 local communities in Delta, Ondo and Imo States by increasing access to basic water, sanitation and hygiene information and service.\nAustine emphasised the need for strengthened collaborative efforts amongst stakeholders towards ensuring project sustainability, adding that the Clean Water Initiative Project should be a tool for advocacy both on the community level and state level.\nFurthermore, stakeholders were encouraged to possess a sense of ownership as it relates to the Clean Water Initiative project and other community development projects/activities."
  },
  {
    "headline": "HACEY Launches Clean Water Initiative Project In 3 States",
    "summarized_story": "A non-governmental organisation, HACEY Health Initiative with Aspire Coronation Trust Foundation, has launched the Clean Water Initiative Project to implement the advocacy of WASH Initiative project at state and community levels in Ondo, Imo and Delta States.\nThe stakeholders explained that the initiative was in fulfillment to drive the implementation of WASH Initiative project at both community and state levels.\nProject Lead, Clean Water Initiative at HACEY Health Initiative, Chioma Osakwe, explained that the project aimed to reduce WASH-related diseases in 10 local communities in Delta, Ondo and Imo States by increasing access to basic water, sanitation and hygiene information and service.\nAustine emphasised the need for strengthened collaborative efforts amongst stakeholders towards ensuring project sustainability, adding that the Clean Water Initiative Project should be a tool for advocacy both on the community level and state level.\nFurthermore, stakeholders were encouraged to possess a sense of ownership as it relates to the Clean Water Initiative project and other community development projects/activities."
  },
  {
    "headline": "African Women Lawyers Honour Seinye Lulu-Briggs",
    "summarized_story": "The African Women Lawyers (AWLA) has bestowed a special recognition award on Dr. Mrs. Seinye O.\nB. Lulu-Briggs for her contributions to women empowerment.\nB. Lulu-Briggs in 2018.”The AWLA president praised Dr Seinye’s foresight and commitment to the fruitful partnership between AWLA and the O.\nB. Lulu-Briggs Foundation.\nI thank you for your thoughtfulness, commitment and partnership to support women."
  },
  {
    "headline": "African Women Lawyers Honour Seinye Lulu-Briggs",
    "summarized_story": "The African Women Lawyers (AWLA) has bestowed a special recognition award on Dr. Mrs. Seinye O.\nB. Lulu-Briggs for her contributions to women empowerment.\nB. Lulu-Briggs in 2018.”The AWLA president praised Dr Seinye’s foresight and commitment to the fruitful partnership between AWLA and the O.\nB. Lulu-Briggs Foundation.\nI thank you for your thoughtfulness, commitment and partnership to support women."
  },
  {
    "headline": "CBN Disclaims Fake eNaira Social Media Handle",
    "summarized_story": "The Central Bank of Nigeria (CBN) has declaimed a certain social media handle used by suspected fraudulent persons posing to be acting on behalf of the apex bank.\nFollowing the formal launch of the eNafra on Monday, October 25, 2021, some individuals had created a fraudulent twitter handle, @enaira_cbdc purported to belong to the Bank.\nThe fraudulent people claim they were disbursing the sum of 50 billion eNaira currency.\nIn effect, the Bank is not disbursing eNaira currency to citizens.\nThe current official social media handles of the eNaira are: www.facebook.com/m enaira; www.instasram.com/m enaira and www."
  },
  {
    "headline": "Anambra Guber: ‘Senator Uba, Most Experienced,’ says Ohanaeze Ndigbo",
    "summarized_story": "By CHIKA CHIMEZIE…praise him for various interventions whilst at the PresidencyPresident of Anambra State Chapter of Ohanaeze Ndigbo, Prince Emeka Udodeme, yesterday described the governorship candidate of the All Progressive Congress, APC in the forthcoming November 6 election, Senator Andy Uba, as the most experienced candidate for the Anambra State Governorship seat.\nVictor Afam Ogene, director, Media and Publicity of the Senator Andy Uba Governorship Campaign Organisation, SAUGCO, the Ohanaeze chief spoke against the background of the fact that, of the candidates of the three leading political parties billed for the polls, only Senator Uba has tasted electoral victory.\nThe Ohanaeze Ndigbo chieftain told the gathering that Senator Uba, who was accompanied by the Anambra State Deputy Governor, Dr. Ikem Okeke, his deputy governorship candidate, Barrister Emeka Okafor and members of his campaign team, that the APC candidate is “one of the brightest candidate in the race,” stressing that Uba is academically and eminently qualified for govern Anambra State.\nAlthough the Anambra state leader of the sociocultural group clearly stated that the group was not in the business of endorsing any candidate, he would not shy away from disclosing that Senator Uba had assisted Ohanaeze Ndigbo whenever he was called upon to do so.\n“Senator Uba has, besides coming to the aid of Ohanaeze Ndigbo whenever he is beckoned upon, also impacted positively in the lives of our people, especially businessmen who were caught in the web of favourable policies."
  },
  {
    "headline": "Anambra Guber: ‘Senator Uba, Most Experienced,’ says Ohanaeze Ndigbo",
    "summarized_story": "By CHIKA CHIMEZIE…praise him for various interventions whilst at the PresidencyPresident of Anambra State Chapter of Ohanaeze Ndigbo, Prince Emeka Udodeme, yesterday described the governorship candidate of the All Progressive Congress, APC in the forthcoming November 6 election, Senator Andy Uba, as the most experienced candidate for the Anambra State Governorship seat.\nVictor Afam Ogene, director, Media and Publicity of the Senator Andy Uba Governorship Campaign Organisation, SAUGCO, the Ohanaeze chief spoke against the background of the fact that, of the candidates of the three leading political parties billed for the polls, only Senator Uba has tasted electoral victory.\nThe Ohanaeze Ndigbo chieftain told the gathering that Senator Uba, who was accompanied by the Anambra State Deputy Governor, Dr. Ikem Okeke, his deputy governorship candidate, Barrister Emeka Okafor and members of his campaign team, that the APC candidate is “one of the brightest candidate in the race,” stressing that Uba is academically and eminently qualified for govern Anambra State.\nAlthough the Anambra state leader of the sociocultural group clearly stated that the group was not in the business of endorsing any candidate, he would not shy away from disclosing that Senator Uba had assisted Ohanaeze Ndigbo whenever he was called upon to do so.\n“Senator Uba has, besides coming to the aid of Ohanaeze Ndigbo whenever he is beckoned upon, also impacted positively in the lives of our people, especially businessmen who were caught in the web of favourable policies."
  },
  {
    "headline": "Opinion: Anambra 2021: Andy Uba’s ‘Igwebuike’ philosophy and winning streak – By VICTOR OGENE",
    "summarized_story": "Therefore, from this foundational framework, there is no gainsaying that the higher the numbers, the brighter the collective fortunes of groups or individuals that populate a given political party.\nBesides Anambra, why has it been difficult to spread and plant this seemingly good seed in any of the aforementioned states?\nAnd Senator Uba is not only leading the charge, he lives the full expression of the tag in his efforts to build the APC into a formidable force in Anambra State.\nThis, to me, is a commendable leadership and social engineering foresight for the good of Anambra and its precious people.\nThe APC as a brand is benefiting from Senator Andy Uba’s Igwebuike ‘live and let’s live’ political ideology."
  },
  {
    "headline": "Opinion: Anambra 2021: Andy Uba’s ‘Igwebuike’ philosophy and winning streak – By VICTOR OGENE",
    "summarized_story": "Therefore, from this foundational framework, there is no gainsaying that the higher the numbers, the brighter the collective fortunes of groups or individuals that populate a given political party.\nBesides Anambra, why has it been difficult to spread and plant this seemingly good seed in any of the aforementioned states?\nAnd Senator Uba is not only leading the charge, he lives the full expression of the tag in his efforts to build the APC into a formidable force in Anambra State.\nThis, to me, is a commendable leadership and social engineering foresight for the good of Anambra and its precious people.\nThe APC as a brand is benefiting from Senator Andy Uba’s Igwebuike ‘live and let’s live’ political ideology."
  },
  {
    "headline": "All set for Anambra governorship election",
    "summarized_story": "By Naomi SharangProfessor Mahmood Yakubu, the Chairman of, Independent National Electoral Commission (INEC), has said that the commission is ready for the Nov. 6 governorship election in Anambra.\nHe said this on Wednesday, at a meeting with the Joint National Assembly Committee INEC and Electoral Matters to engage with the commission over the forthcoming election.\nWe have trained the requisite number of ad-hoc staff for the election and mobilised members of the National Union of Road Transport Workers (NURTW) for efficient distribution of materials on election day,” he said.\nOn the distribution of Permanent Voter Cards in Anambra, he said, “We have a little over 81,000 valid registrants.\n“The situation in Anambra is quite unfortunate especially at a time when we are approaching the gubernatorial election in the state."
  },
  {
    "headline": "Buhari in Madinah prays for peace in Nigeria",
    "summarized_story": "President Muhammadu Buhari continues his visit to Saudi Arabia with a brief stopover at Madinah where he observed his evening prayers and engaged in intense prayers.\nAccording to a statement by Aso Rock, Buhari, along with his entourage prayed for the return of peace and security all over Nigeria and the world at large.\nThe President had earlier been received at the Prince Muhammad Abdulaziz Airport, Madinah by the Deputy Governor of the Region, Prince Sa’ud Al-Faisal.\nPresident Buhari and the delegation prayed for the well-being of the nation and its people and for the full restoration of peace and security in Nigeria and around the globe.\nThe President will later on in the evening proceed to Makkah for the performance of the Umrah (lesser Hajj)."
  },
  {
    "headline": "E-Naira Removed From Google Play Store After Series Of Complaints, Poor Rating",
    "summarized_story": "The E-Naira speed wallet has disappeared from the Google Play Store barely 48 hours after its launch.\nThe digital currency has two applications, which are eNaira speed wallet and eNaira merchant wallet.\nHowever, the eNaira merchant wallet, which is designed for businesses, is still running and has over 10,000 downloads on the Google Play Store made available to Android users.\nChecks on the Apple App Store showed that the eNaira speed wallet was still active but had been upgraded.\nTo access the eNaira, users have to download the ‘speed wallet’, which allows them to conduct transactions with speed and ease."
  },
  {
    "headline": "Again, Bandits Attack Zamfara Community, Kill Seven",
    "summarized_story": "Seven villagers were killed in an attack by suspected armed bandits on Yanbuki settlement in Zurmi Local Government Area of Zamfara State.\nAccording to a village eyewitness, the bandits began shooting as soon as they seized the area, neutralizing a large number of individuals.\n“Throughout the night, the robbers moved from house to house, burgling shops and stealing people’s possessions and foodstuffs,” he claimed.\nAccording to the informant, no security officers were present during the heinous operation to save the situation.\nMr. Ayuba Elkanah, the Commissioner of Police, has already despatched seven operational cars loaded with armed police officers to the area to restore order, he added."
  },
  {
    "headline": "Gunmen Kidnap 8 In Ekiti, Demand N50m Ransom",
    "summarized_story": "Eight people were allegedly kidnapped on Tuesday in Itapaji Ekiti in the same council area, just a week after four people were kidnapped at Ayebode in the Ikole Local Government Area of Ekiti State.\nThe kidnappers allegedly contacted the family early on Wednesday morning and demanded N50 million in ransom.\nThe residents of the community were stated to be horrified by the gunshots, which lasted over an hour.\nHe added further: “Earlier today (Wednesday), one of the family members received a call from the abductors demanding for a ransom of N50m”, he said.\nWhen contacted, the Police Public Relations Officer, Ekiti Command, Sunday Abutu, confirmed the incident."
  },
  {
    "headline": "BREAKING: Abba Ruma, Yar’Adua’s agric minister, dies in London",
    "summarized_story": "A former minister of Agriculture and Water Resources, Dr Abba Sayyadi Ruma, is dead.\nIt was gathered that Ruma died in a London hospital.\nConfirming the demise of Ruma, his uncle and Danwairen Katsina, Alhaji Sada Salisu Ruma, said late Sayyadi had battled diabetes for a long time before he eventually passed away this morning.\nBorn on March 13, 1962, late Ruma was an influential minister during the administration of late President Umaru Musa Yar’adua.\nAged 59, the late Ruma is survived by two wives and nine children."
  },
  {
    "headline": "Breaking: Young man who put self up for sale arrested",
    "summarized_story": "A 26-year-old man identified as Aliyu Na Idris, who days ago put himself up for sale for N20 million has been arrested in Kano state.\nIdris was arrested by the Islamic police known as Hisbah, who said what Idris did is forbidden in Islam.\nIdris, a tailor trended on social media last weekend after putting himself up for sale, citing poverty.\nHisbah Commander, Harun Ibn Sina, however, confirmed he has been arrest.\nDetails loading…"
  },
  {
    "headline": "Breaking: At last, UK returns stolen Benin to Nigeria",
    "summarized_story": "A Benin bronze stolen from the country in 1897 has finally been returned by the Cambridge University.\nThe British institution became the first to return the bronze to Nigerian authoritiesThe bronze cockerel named Okukor was taken from the Benin Kingdom during a punitive expedition in 1897 when thousands of bronzes were looted by British forces.\nThe bronze cockerel was looted by British colonialists from the palace of the King of Benin and was given to Jesus College, a college of Cambridge in 1905 by the father of a student.\nNigeria’s National Commission for Museums and Monuments received the Benin bronze from Jesus College on behalf of the Federal Government of Nigeria and the Royal Court of Benin.\nAccording to Sonita Alleyne, master of Jesus College, returning the artefact was the “right thing to do” and that the bronze piece was of “cultural and spiritual significance to the people of Nigeria”."
  },
  {
    "headline": "Why I went to EFCC, Anyim opens up",
    "summarized_story": "The former Secretary to the Government of the Federation, Senator Anyim Pius Anyim, Wednesday, said he went to the office of the Economic and Financial Crimes Commission (EFCC) Abuja, on Sunday on his own volition.\nAnyim said he went to the Commission on hearing that someone under investigation by the anti-graft agency mentioned his name.\n“It has, therefore, become necessary to put the records straight on why he went to EFCC between Sunday, October 24 and 26.\n“Senator Anyim got information that some persons invited by the EFCC in connection with some matters it was investigating mentioned his name in the statement made to the EFCC.\n“At the agreed time Senator Anyim arrived at the EFCC office."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Embracing NYSC trust fund will complement federal government’s efforts at lifting 100 million Nigerians out of poverty – CSO -NigPilot",
    "summarized_story": "An indigenous Civil Society Organisation, The Abuja Grassroots Advocacy Projects has drummed support for the establishment of a Trust Fund for the NYSC.\nAccording to the Abuja Grassroots, the establishment of the fund will effectively complement the Federal Government’s efforts in moving 100 million Nigerians out of poverty.\nHe also commended the Scheme for providing a platform that would engender a greater appreciation of the imperative for the NYSC Trust Fund and generate ideas that would Facilitate its actualization.\nAccording to him, resolutions reached after the Symposium had the capacity to change the narratives of not only the NYSC Scheme but the teeming youths.\nHe called on the NYSC Management to sustain and expand the scope of advocacy for the establishment of the fund."
  },
  {
    "headline": "Onyema urges FG to review salaries of NCAA staff -NigPilot",
    "summarized_story": "Chief Executive Officer/Chairman of Air Peace, Allen Onyema, has called on the Federal Government to upwardly review the salaries of staff of Nigerian Civil Aviation Authority, NCAA.\nThe Air Peace boss made the call at the 2021 Brazil-Nigeria Aviation and Defence Trade Forum 2021 organized by the Embassy of Brazil recently in Abuja.\nHe stated that the agency is not able to poach top talents in the industry because its salary structure leaves much to be desired, adding that the Federal Government should remove the NCAA from the civil service salary structure.\n“Their salaries should be upwardly reviewed to match the airlines’ salary structure, as nobody wants to go there to work but they (current staff) are doing their best, which is very commendable.\nThis is a patriotic call,” a statement made available by Spokesman of the Airline, Stanley Olisa, quoted Onyema as saying."
  },
  {
    "headline": "NYSC boss urges Corps Members to embrace Martial Arts training -NigPilot",
    "summarized_story": "“Dear patriotic Corps Members, the NYSC in the last few years recorded a paradigm shift in the Orientation Course content, aligning it with the prevailing security and economic realities.\nThe prevailing security threat which is a global issue, as well as the shrinkage of white-collar jobs made this phenomenal change germane and very compelling.\n“This shift witnessed the introduction of Martial Arts training into the course content so as to equip Corps Members with basic self-defense skills.\n“In an attempt to stem this tide, the Scheme introduced Skill Acquisition and Entrepreneurship Development programme into the Orientation Course content.\nHe advised the Corps Members to utilise the skill acquisition and other programmes maximally in order to contribute to the nation building."
  },
  {
    "headline": "Insecurity: Over 12m children traumatised, afraid of going to school- Buhari -NigPilot",
    "summarized_story": "President Muhammadu Buhari has said more than 12 million children are currently children traumatized and afraid of going to school especially girl child.\nRepresented by his Chief of Staff, Agboola Ibrahim Gambari, Buhari shared a report released by S.B Morgen which revealed that a total of 1,462 learners and education personnel were abducted between 1st December 2019and September 2021 in school-related abductions as well as home and community-related abductions of Learners and teachers.\n” It is no longer news that at will, bandits, kidnappers, and terrorists invade oureducational facilities to abduct the learners in large numbers.\nSome places that have been hit by this menace include Chibok, Dapchi, Buni Yadi, Afaka, kagora, and Jangebein Borno, Yobe, Kaduna, Niger and Zamfara states respectively.\n” It is disheartening tonote that even when the abducted students have released the trauma of the incidences remain long in their minds hence the plan to have teachers trained on psycho-social support,” he said."
  },
  {
    "headline": "Cambridge University Returns Looted Benin Bronze Artefact ‘Okukor’ To Nigeria",
    "summarized_story": "Nigeria has received a Benin bronze artefact from the University of Cambridge, more than a hundred years after it was taken from the country.\nTijani, who spoke during the ceremony to hand over the treasure, stated that it was the first time a UK institution would give back a Benin bronze.\nThe bronze was taken from the kingdom of Benin — now part of Nigeria — in 1897 when Britain had a foothold on the African continent.\nCambridge’s Jesus College removed the cockerel from public display in 2016 after a campaign by students arguing it was a symbol of Britain’s colonial past.\nTijani is expected to travel to Scotland to receive another Benin bronze from the University of Aberdeen on Thursday."
  },
  {
    "headline": "NNPC To Reconstruct 21 Federal Roads At N621.23bn – FEC",
    "summarized_story": "The Federal Executive Council (FEC) has approved the reconstruction of 21 roads covering a total distance of 1,804.6 kilometres across the six geo-political zones.\nThese projects are to be undertaken by the Nigerian National Petroleum Corporation (NNPC) through the deployment of its own tax liabilities.\n“So, NNPC has identified 21 roads that it wants to deploy.\nNNPC has sought and the council has approved today that NNPC deploys tax resources to 21 roads, covering a total distance of 1,804.6 kilometres across the six geopolitical zones.\n“Out of those 21 roads, nine are in North Central, particularly Niger state."
  },
  {
    "headline": "AU Suspends Sudan Over Military Coup",
    "summarized_story": "The African Union said on Wednesday it had suspended Sudan until civilian rule in the country is restored, saying it rejected the military takeover as an “unconstitutional” seizure of power.\nThe continent-wide bloc said it “strongly condemns the seizure of power” and was suspending Sudan from all AU activities “until the effective restoration of the civilian-led transitional authority”.\nPrime Minister Abdalla Hamdok was placed under military arrest, along with his ministers and civilian members of Sudan’s ruling council, sparking angry protests on the streets of Khartoum.\nA number of Western powers have called for an urgent meeting with Hamdok, saying they still recognise the prime minister and his cabinet as the constitutional leaders of Sudan.\nThe AU suspended Sudan in June 2019 after pro-democracy protesters demanding civilian rule were gunned down outside army headquarters in Khartoum."
  },
  {
    "headline": "Insurgency, Banditry Have Forced Over 12m Children Out Of School, Says Presidency",
    "summarized_story": "The Presidency has lamented the impact of insurgency and banditry on school attendance in the country noting that over 12 million children have been forced out of school.\nChief of Staff to the President, Ibrahim Gambari said this on Tuesday at the fourth International Conference on Safe Schools Declaration in Abuja.\n“There are more than 12 million children currently out of school and the wider implication of the ongoing is that of a generation of children traumatised and afraid of going to school, especially the girl child,” he said.\n﻿He pointed out that fear of abduction and a traumatic experience from school children, who have been victims of kidnapping, has forced many children of school age to stay out of educational institutions, thereby increasing the problem of out-of-school children.\n– Working To Overcome –The first mass school abduction in the country was in the northeast region in 2014, when Boko Haram members picked 276 girls from Chibok, triggering a global campaign called #BringBackOurGirls."
  },
  {
    "headline": "UPDATED: Barcelona Sack Ronald Koeman As Coach",
    "summarized_story": "Ronald Koeman has been sacked as coach of Barcelona, the club announced on Wednesday, after defeat by Rayo Vallecano left the club ninth in La Liga.\nA club statement released after midnight in Spain on Wednesday read: “FC Barcelona has dismissed Ronald Koeman as coach of the first team tonight.\n“The president of the club, Joan Laporta, has informed him after the defeat against Rayo Vallecano.\nRonald Koeman will say goodbye to the squad this Thursday at the Ciudad Deportiva.\n“The FC Barcelona wants to thank him for his services and wishes him good luck in his career.”"
  },
  {
    "headline": "Suspected bandits kill seven, cart away over two thousand livestock in Zamfara community",
    "summarized_story": "Suspected armed bandits have killed seven persons and rustled over two thousand livestock in Zamfara state.\nThe gunmen also burgled shops, carted away food stuff and other valuables belonging to the localsThe Community affected is Yanbuki village in Zurmi local government area of the stateTVC NEWS gathered that the gunmen stormed the village in their numbers Tuesday night and opened fire on the locals, causing many to receive varying degrees of injury.\nHundreds of cows and over a thousand, five hundred sheep, among other animals, were rustled.\nCommunities in Zurmi local government have suffered attacks by gunmen in recent timesThis is the second time since the shutdown of telecommunication services and the ongoing onslaught against bandits that gunmen are invading Yanbuki Village.\nAttempts to contact the Zamfara police command for comment were unsuccessful since the command’s spokeswoman, Shehu Mohammed, was not responding to phone calls."
  },
  {
    "headline": "Oyo FOMWAN Condoles Aare Musulumi over Death of Wife -",
    "summarized_story": "The Federation of Muslim Women’s Associations in Nigeria, FOMWAN Oyo State chapter has commiserated the Aare Musulumi of Yorubaland, Edo and Delta Alhaji Daud Akinola, popularly called De-Damak over the death of one of his wives, Alhaja Alimat Funke Akinola.\nIn a condolence message issued in Ibadan, the Oyo FOMWAN Amirah, Alhaja (Dr) B.B Oloso described the death as painful and shocking.\n” The news of the death of Alhaja Alimat Funke Akinola, the wife of the Aare Musulumi of Yorubaland, Edo and Delta came to everyone this morning as a surprise.\nThe entire members of FOMWAN sympathize with Aare on this loss and could imagine the grief in his entire family at the moment .\nOyo FOMWAN Amirah used the medium to beseech Allah to uphold the entire family of the Aare Musulumi and give them the piety to bear the irreplaceable loss."
  },
  {
    "headline": "Suspected Bandits Kill 7, Steal Over Two Thousand Livestock In Zamfara -",
    "summarized_story": "Suspected armed bandits have killed seven persons and Rustled over two thousand livestock in ZamfaraThe gunmen also burgled shops, carted away food stuff and other valuables belonging to the localsThe Community affected is Yanbuki village in Zurmi local government area of the stateTVC NEWS gathered that the gunmen stormed the village in their large number Tuesday night and opened fire on the locals as a result many sustained various degrees of injuriesOver five hundred cows and over one thousand, five hundred sheep among other animals many other animals were rustledCommunities in Zurmi local government have suffered attacks by gunmen in recent timesThis is the second time since the shutdown of telecommunication services and the ongoing unslaught against bandits that gunmen are Invading Yanbuki Village.\nEfforts to reach out to the Zamfara police command for comments yielded no results as the spokesperson of the command Shehu Mohammed is not responding to phone calls"
  },
  {
    "headline": "Senate rejects Health Ministry's request to borrow $82bn to purchase mosquito nets",
    "summarized_story": "The Nigerian Senate has rejected a proposal by the Federal Ministry of Health to borrow $200 million (N82,070,388,916.76) under the malaria program to purchase mosquito nets in the 2022 budget.\nA member of the Senate Committee on Health, Gershom Bassey, spoke out against the proposal by the Ministry at the Federal Ministry of Health’s 2022 budget defense on Tuesday.\nBassey told Mahmuda Mamman, the Permanent Secretary, that the idea to borrow $200 million (approximately N82 billion at the official exchange rate of N410 to a dollar) to purchase mosquito nets was ridiculous given the sum involved.\nThe Committee’s criticism came in reaction to the Permanent Secretary’s previous testimony that he intended to borrow the aforementioned sum to acquire mosquito nets.\nMeanwhile, Faisal Shuaib, Executive Director of the National Primary Health Care Development Agency, stated that the $200 million was for mosquito net imports and local production."
  },
  {
    "headline": "African Union Suspends Sudan Over Coup",
    "summarized_story": "The pan-African body says the suspension will be in place until the civilian-led transitional government is restored.\nThe African Union (AU) has said it suspended Sudan from all its activities after the country’s military overthrew the civilian-led transitional government in a coup.\nThe African Union Political Affairs Peace and Security on Wednesday tweeted the news of the suspension, an expected move typically taken in the wake of military coups.\nIn a communique, the pan-African body said the suspension would be in place until “the effective restoration” of the transitional authority steering the country towards elections.\nIt came as the World Bank also on Wednesday followed the United States in suspending aid to Sudan following the widely condemned military takeover."
  },
  {
    "headline": "Brazil Senators Back Criminal Charges Against Bolsonaro Over Covid Handling",
    "summarized_story": "Brazilian senators have voted to recommend charging President Jair Bolsonaro over his handling of the devastating Covid pandemic.\nA Senate panel backed a report calling for charges against Mr Bolsonaro including crimes against humanity, after 600,000 deaths from coronavirus.\nMr Bolsonaro is also accused of misusing public funds and spreading fake news about the pandemic.\nWill Mr Bolsonaro have to stand up in court to defend his actions?\nIn March, Mr Bolsonaro caused outrage when he told Brazilians to “stop whining” about Covid, a day after the country saw a record rise in deaths over a 24-hour period."
  },
  {
    "headline": "China Says Taiwan ‘Has No Right’ To Join UN, after US Nod",
    "summarized_story": "China has again said that Taiwan has “no right” to join the United Nations, a day after the United States voiced support for the island’s “meaningful participation” at the organisation.\nOn Wednesday, in response to US support for Taipei’s endeavour, the spokesman for the Taiwan Affairs Office in Beijing Ma Xiaoguang said Taiwan “has no right to join the United Nations”.\n“The United Nations is an international governmental organisation composed of sovereign states … Taiwan is a part of China,” Xiaoguang told reporters.\nFor her part, Taiwan President Tsai Ing-wen welcomed Blinken’s support for wider participation on the world stage.\n“Grateful for #US support for expanding #Taiwan’s international participation,” she said on Twitter."
  },
  {
    "headline": "United States Issues Its 1st Passport with ‘X’ Gender Marker",
    "summarized_story": "Zzyym (pronounced Zimm) was denied a passport for failing to check male or female on an application.\nAccording to court documents, Zzyym wrote “intersex” above the boxes marked “M” and “F” and requested an “X” gender marker instead in a separate letter.\nThe department’s denial of Zzyym’s passport prevented Zzyym from being able to travel to a meeting of Organization Intersex International in Mexico.\nThe United States joins a handful of countries, including Australia, New Zealand, Nepal and Canada, in allowing its citizens to designate a gender other than male or female on their passports.\nStern said her office planned to talk about the United States’ experience with the change in its interactions around the world and she hopes that might help inspire other governments to offer the option."
  },
  {
    "headline": "World War III Imminent With Fake News – Says Lai Mohammed – Trending With Ojy Okpe",
    "summarized_story": "Reactions are trailing Donald Trump Jr. Who has resorted to selling T-shirts with the tagline ‘Guns Don’t Kill People, Alec Baldwin Kills People’ on his website, mocking Alec Baldwin for firing a prop gun on his movie set that killed cinematographer Halyna Hutchins.\nSince the fatal shooting, Trump jr has been sharing memes of Baldwin on his Instagram page.\nMeanwhile Nigeria’s minister of information and culture, Lai Mohammed, has yet again cautioned against spreading fake news.\nThis time he says fake news may cause World War III.\nAliyu is said to be a tailor, from Kaduna state and has reportedly put himself up for sale due to economic hardship after losing his tailoring job."
  }
]