[
  {
    "headline": "Rivers ADC gov candidate nominates Tonto Dikeh as running mate",
    "summarized_story": "The Rivers State African Democratic Congress governorship candidate, Tonte Ibraye, has nominated popular actress, Tonto Dikeh, as his running mate.\nThe actress announced her nomination on Instagram on Friday, while sharing their government’s plans if elected into office during next year’s election.\nWhen elected, she said the administration would invest massively in social protection and create social value for the youths.\nShe wrote, “I thank Mr. Tonte Ibraye, the Governorship candidate of the African Democratic Congress Rivers State for nominating me as his running mate.”Dikeh listed their manifesto to include, “investing massively in social protection, creating a social value system for young people, increased women inclusion in our governance system.\nThe actress hails from Rivers State."
  },
  {
    "headline": "ADC’s Chukwuka Monye set for critical political decision",
    "summarized_story": "Following the stellar performance by Chukwuka Monye, the second runner-up in the just concluded presidential primaries on the platform of African Democratic Congress, ADC, speculations trailing the 42-year old Oxford and Harvard-trained social innovator are centered on what his next political move will be.\nDuring the call, he reminded his team that politics is about effectiveness and that the network can only be effective if it is further strengthened.\nAccording to Monye, “It is important for us to separate our emotions from strategy, and whilst love for our great nation is not negotiable, we need to be logical in our strategy and approach for midwifing the transformation we want to see.\nAccording to one of his aides, “You should understand that he is a deep thinker and is thorough in how he evaluates strategic options.\nHe is on the mission for the long.”"
  },
  {
    "headline": "2023: South South APC declares support for Tinubu, hails Amaechi’s outing at primary",
    "summarized_story": "Omeiza Ajayi – AbujaThe South South Caucus of the ruling All Progressives Congress APC have pledged their unalloyed support to the presidential candidate of the party, Asiwaju Bola Ahmed Tinubu.\nThe decision was part of resolutions reached at the end of its meeting on Thursday night in Abuja.\nRead Also:PDP woos aggrieved APC Senators, othersABIA 2023: Emenike, APC gov candidate raises harmonisation team2023: 5,000 dump PDP, defect to APC in OgunThe caucus also hailed Mr Amaechi’s performance at the Special Convention and Presidential Primary Election of the party and the spirit of sportsmanship he demonstrated after the event.\n“The South-south zone in that direction has resolved to work with him and the party to ensure victory in the 2023 general election.\n“We therefore urge all party members in South-south zone to embrace the presidential ticket of our party to ensure victory in 2023”."
  },
  {
    "headline": "Insecurity: Soludo names Bianca Ojukwu, Odinkalu, others in 15-man Truth, Justice, Peace committee",
    "summarized_story": "Prof. Chidi Odinkalu2.\nMrs. Bianca Ojukwu3.\nDr. Joe Nwaorgu5.\nMrs. Bianca Ojukwu2.\nDr. Joe Abah8.Prof."
  },
  {
    "headline": "Gumi spearheads formation of Nomadic Rights Organization",
    "summarized_story": "– Vows To Fight Suppression of HerdersBy Ibrahim Hassan-WuyoRenowned Islamic scholar, Sheikh Ahmad Gumi has announced the formation of an organisation for the protection of the rights of Fulani, the Nomadic Rights Concern (NORIC) with a sole mandate to protect the interests of herders across Nigeria by the use of legal means.\nSheikh Gumi while reeling out the objectives of the Nomadic Rights Concern in Kaduna, lamented over “unjust persecution and stereotyping of herdsmen in the country”, insisting that the nomadic Fulani had been victims of banditry.\nHe said that most frictions , particularly between pastoralists and others could be traced to injustice meted on either of the parties involved.\nHe pointed out that the newly formed group would not only stand for the oppressed Fulani herders, adding that all individuals who may have been affected by any form of injustice or the other would as well be the primary concern of NORIC.\nHe stressed the need for interface between herders and host communities for lasting peace, saying bullet approach alone cannot end violence and banditry in Nigeria."
  },
  {
    "headline": "Audit of public, private Schools in Ondo not to impose tax — Ondo govt clarifies",
    "summarized_story": "Dayo Johnson , AkureThe Ondo State Universal Basic Education Board (SUBEB) has explained that the ongoing audit of all the public and private schools across the state, was not to impose tax.\nHe appealed to proprietors of private schools to cooperate with enumerators, saying the exercise has nothing to do with taxation.\nIn 2010, it was done just for primary schools pupils and Junior Secondary Schools in public schools but in 2018, private schools were involved.\n“We have a challenge and the challenge is that the private schools did not cooperate because they are thinking the government wants to use it to tax them and it entails a lit of convincing.\n“All private schools will be captured whether registered or not, but once they are operating as schools they will be captured."
  },
  {
    "headline": "Buhari told to sack, arrest Buratai over alleged N1.85bn arms fund",
    "summarized_story": "President Muhammadu Buhari has been urged to sack the Nigerian Ambassador to Benin Republic, Lt. Gen. Tukur Buratai (rtd).\nDeji Adeyanju, an Abuja-based activist, said Buhari should also order Buratai’s arrest over the alleged billions discovered in his house.\nICPC officials were said to have stormed the house in the Wuse area of Abuja, following a tip-off from a whistleblower.\nThe huge sum said to have been recovered is alleged to be part of the billions of naira earmarked for the purchase of arms and ammunition by the President Muhammadu Buhari-led government.\nReacting, Adeyanju said Buratai should be prosecuted for the money discovered in his house."
  },
  {
    "headline": "Alleged organ harvesting: Catholic priest reacts to Ekweremadu, wife’s ordeal, makes shocking revelations",
    "summarized_story": "Catholic priest, Rev Fr Kelvin Ugwu has reacted to the arrest of and detainment of former Deputy Senate President, Ike Ekweremadu and his wife, Beatrice in the United Kingdom.\nThe couple were arrested by the UK authority for allegedly facilitating the travel of a 15-year-old boy for organ harvesting.\nConcerned Nigerians, who were shocked upon hearing the report on Thursday, have continued to react to the unfortunate development.\nThe popular priest also revealed that some rich men harvest the blood of newly born children and young people to prolong their lives.\n“Do you know some creams and body lotions are made from aborted fetuses because it has proven to revive aging skin and make them look younger?"
  },
  {
    "headline": "War: Zelensky reacts as US hands Ukraine major boost in battle with Russia",
    "summarized_story": "Ukrainian President Volodymyr Zelensky on Friday said his country is “grateful” to United States President Joe Biden and the American people for the latest package of $450 million in military aid.\nThe Biden administration had on Thursday announced the additional military aid for Ukraine, with the US giving Ukraine four more multiple launch rocket systems and artillery ammunition for other systems, amid the ongoing war between Ukraine and Russia.\nReacting, Zelensky, in a tweet via his Twitter handle on Friday, said by joint efforts, Ukrainian land will be free from the Russian aggressor.\nHe tweeted: “We’re grateful to [US President Joe Biden] and the American people for the decision to provide another $450 million defense aid package to Ukraine.\n“By joint efforts we will free Ukrainian land from the Russian aggressor!”Ukraine and Russia have been fighting since February this year."
  },
  {
    "headline": "Name train station after Fani-Kayode – MURIC to FG",
    "summarized_story": "Islamic human rights organisation, Muslim Rights Concern (MURIC), has asked the Federal Government to name a train station after the late Chief Remi Ade Fani-Kayode.\nIn a statement on Friday, MURIC Director, Ishaq Akintola, argued that the deceased deserves the honour more than some of those already given.\nAkintola said Fani-Kayode, one of the earliest crown counsels to the Queen of England, played a major role in Nigeria’s legal history.\nMURIC said Fani-Kayode demonstrated uncommon courage in his political career and fought against autocratic leadership and feudalistic royalty.\n“If names like Mrs Funmilayo Ransome Kuti (Papalanto Station), Olusegun Osoba (Olodo Station) and Mobolaji Johnson (Ebute Metta Station) who held office or featured only at state level appear at our train stations, why shouldn’t that of the great Fani-Kayode appear”, it added."
  },
  {
    "headline": "Nnamdi Kanu: Stop displaying public hatred for Igbos – IPOB fires back at Buhari",
    "summarized_story": "The Indigenous People of Biafra, IPOB, on Friday, said President Muhammadu Buhari and his Presidency should stop displaying their ignorance and hatred against Igbos.\nIPOB was reacting to Buhari’s latest comment in Rwanda that Kanu jumped bail, hence his release would be difficult.\nBuhari had told the United Kingdom, UK, Prime Minister, Boris Johnson that Kanu must defend his rants against the Nigerian Government.\n“Buhari is still making frivolous statements about Mazi Nnamdi Kanu accusing him of jumping bail in 2017 in far away Kigali Rwanda where the commonwealth head of governments meeting is holding.\nThe UK prime minister Boris Johnson and other reputable world leaders should tell Buhari to stop interfering in Mazi Nnamdi KANU’s court case and stop intimidating judges handling IPOB matters."
  },
  {
    "headline": "Friend lures 16-year-old into bush, plucks out eyes The Nation Newspaper",
    "summarized_story": "Sixteen-year-old Uzairu Salisu of Kwanan Gulmanmu, Jahun quarters in Bauchi metropolis was left in a pool of blood after one Ibrahim of Rafin Zurfi lured him into the bush and forcefully removed his two eyes.\nBauchi Police Command confirmed the incident in a statement on Friday.\nIts spokesman SP Ahmed Wakili said it received a distress call from the Ward Head of Birshi, a suburb of Bauchi metropolis, Mohammed Lawa, that Salisu was found in a pool of blood and struggling to stay alive.\nThe incident was said to have occured on Thursday.\nAccording to him, preliminary investigation revealed that Ibrahim, whom he knew for some time, lured him to the bush for a menial job on his farm where he also used a cable to strangle him."
  },
  {
    "headline": "Ebonyi Assembly moves to amend VAPP Law The Nation Newspaper",
    "summarized_story": "Following growing cases of gender violence, Ebonyi Assembly has moved to amend the Violence Against Persons Prohibition (VAPP) law in the State.\nThe Ebonyi State Violence Against Persons Prohibition (VAPP) Law No 002 of 2018 amendment bill passed the second reading during plenary.\n“Before us a is a Bill for a Law to amend Ebonyi State Violence Against Persons Prohibition Law 2018 and for other related matters.\nMr Speaker this Bill is very apt, very important, considering the level of domestic violence and gender violence in our society today.\nThe House screened and approved nomination of persons into some vacant boards and commissions positions in the State."
  },
  {
    "headline": "BREAKING: Supreme Court strikes out Buhari, Malami's suit on Electoral Act The Nation Newspaper",
    "summarized_story": "The Supreme Court has struck out the suit by President Muhammadu Buhari and the Attorney General of the Federation (AGF), Abubakar Malami seeking to void the provision of Section 84(12) of the Electoral Act 2022.\nThe court, which upheld the objections raised by the National Assembly and other defendants against the suit, declined to determine it on the merit but declared that the Supreme Court lacked the jurisdiction to hear it and that the suit was an abuse of court process.\nJustice Emmanuel Agim, in the lead judgment, held that it was an attack on the democratic principle of Separation of Powers for the President to seek to direct/request the Legislature to make a particular law or alter any law.\n“The President lacks the power to direct the National Assembly to amend or enact an act..it violates the principle of separation of powers.\n“There is no part of the Constitution that makes the exercise of legislative powers subject to the directive of the President,” the court said."
  },
  {
    "headline": "Emefiele lists benefits of e-Naira to trade, investments The Nation Newspaper",
    "summarized_story": "The Governor, Central Bank of Nigeria (CBN) Godwin Emefiele has said the introduction of e-Naira to Nigeria’s payment space will boost trade, investments and other economic activities in the country.\nIt therefore urged interested participants to visit the eNaira Hackathon to register from June 27, 2022.\nTo realise this, registration for the Central Bank of Nigeria (CBN) eNaira hackathon, has been slated to open on June 27, and run till July 21, 2022.\n“Innovators at the hackathon will develop solutions in the areas of international remittance, trans-border payment, blockchain, financial inclusion, and trade (AfCTFA),” Emefiele said.\nIt therefore urged interested participants to visit the eNaira Hackathon www.affcbnhack.com to register from June 27, 2022."
  },
  {
    "headline": "Warning shots from kigali, by Femi Adesina The Nation Newspaper",
    "summarized_story": "Tutsis were killed in cities, towns, villages, in their homes, in churches where they had huddled for refuge, in schools, everywhere.\nWe have always warned about hate speech that is rife in our own country, Nigeria.\nHate speech, or hate media is an ill wind that blows no good.\nIf Nigeria dies, whether now or in the future, hatred killed her.\nThey may carry fancy religious titles, or parade as activists, analysts or newspaper columnists, but what they are is really simple."
  },
  {
    "headline": "Breaking: Supreme Court throws out Buhari, Malami’s suit on Section 84(12)",
    "summarized_story": "From Godwin Tsa, AbujaThe Supreme Court has struck out the suit filed by President Muhammadu Buhari and the Attorney-General of the Federation and Minister of Justice, Mr. Abubakar Malami, SAN, to void section 84(12) of the Electoral Act, 2022.\nIn a unanimous judgment on Friday, a seven-member panel of the Justices led by Justice Muhammad Dattijo, held that it lacked the jurisdiction to entertain the suit which it said amounted to an abuse of the judicial process.\nThe apex court held that President Buhari was not a proper person to approach it with such suit, owing to the nature of reliefs that were sought.\nPresident Buhari and Malami had in the suit marked SC/CV/504/2022, contended that section 84(12) of the Electoral (Amendment) Act, 2022, was inconsistent with the provisions of sections 42, 65, 66, 106, 107, 131, 137, 147, 151, 177, 182, 192 and 196 of the constitution as well Article 2 of the African Charter on Human and Peoples Rights."
  },
  {
    "headline": "Fuel scarcity: IPMAN makes U-turn, directs members not to sell above N165/litre",
    "summarized_story": "This comes as a reversal of its earlier directive to its members to sell petrol at N180/litre.\nRecall that the Lagos Chapter of IPMAN through its secretary, Akeem Balogun on Monday had announced that it would no longer be able to sell petroleum below N180.\nHe said, “The cost of doing business has changed, and it is only NNPC that imports Petroleum products.\nOur members in Lagos were getting the products at N170 to N173/litre, and that is why they were calling for an increment in price of petrol.\nBut yesterday, NNPC released Petroleum products from its tank farms."
  },
  {
    "headline": "Tension deepens in APC over planned defection by lawmakers",
    "summarized_story": "Adamu, at the meeting with APC senate caucus had expressed worry over the wave of defections rocking the party in the National Assembly.\nThe current configuration of the Senate shows that the APC has 61 lawmakers; PDP, 38; NNPP, three;Young Progressives Party (YPP), two; Labour Party, one; while All Progressives Grand Alliance (APGA) has one.\nThere are three vacant seats, vacated by APC national chairman, Adamu and two other APC lawmakers.\nAt plenary last Tuesday, three APC senators defected to the PDP.\nAPC lawmakers are defecting."
  },
  {
    "headline": "Buhari rejects third term, says first person who tried didn’t end well",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has reiterated his resolve to respect the maximum term limit in the Nigerian Constitution, saying the first person that tried to go for a third term didn’t end well.\nFormer president, Olusegun Obasanjo, reportedly in 2006 planned to amend the constitution to extend his tenure.\nPresident Buhari reiterated his position yesterday while in a bilateral meeting with Prime Minister of Great Britain, Boris Johnson on the margins of the 26th Commonwealth Heads of Government Meeting (CHOGM) in Kigali, Rwanda.\nA statement by Special Adviser on Media and Publicity, Femi Adesina, said, the PM, who obviously is not quite familiar with the maximum two terms limit, had asked if President Buhari would run for office again.\nHe described the relationship between the countries as “very strong attachment,” adding: “I just want to be sure that we are doing enough."
  },
  {
    "headline": "Impeachment: Oyo deputy gov replies House of Assembly",
    "summarized_story": "From Oluseye Ojo, IbadanOyo State Deputy Governor, Rauf Olaniyan, has responded to allegations levelled against him by Oyo State House of Assembly, following impeachment process initiated against him by the lawmakers.\nSpokesman for the Assembly, Kazeem Olayanju, stated this when he featured on a radio programme monitored in Ibadan, yesterday.\nThe Office of the Deputy Governor has, however, been moved to the Ministry of Environment, where he is expected to discharge his duties.\nSpeaker Adebo Ogundoyin said the petition met the two-third requirements to initiate the impeachment process against the deputy governor.\nHe said the lawmakers would give the deputy governor a seven-day ‘grace period’ to respond to the allegations, which would end on Wednesday June 22."
  },
  {
    "headline": "Nigeria is Faced with Serious Refugee Problem at Home and Abroad – THISDAYLIVE",
    "summarized_story": "Babatunde Raji Fashola, Minister of Works and Housing, laments that the fear of more people becoming refugees in Nigeria very soon is real.\nAlthough I was unaware that it was World Refugee Day and neither was I aware at the time that a book was to be presented, my mind was already invoking thoughts about refugees.\nIn the hope therefore that I would have something worthwhile to say, I have titled my intervention HOME AND ABROAD.\nI got quite close to the world of refugees in very unusual circumstances that provided a rude awakening, over two decades ago.\nIn other words, every one of us, can cause a problem ABROAD from HOME; or cause a problem at HOME from ABROAD at the push of a button."
  },
  {
    "headline": "Supreme Court Throws out Buhari, AGF Malami’s Suit against Section 84(12) of Electoral Act – THISDAYLIVE",
    "summarized_story": "*Section bans political appointees from primariesAlex Enumah in AbujaThe Supreme Court on Friday threw out the suit filed by the federal government against section 84(12) of the Electoral Act, for being incompetent and lacking in merit.\nSection 84 (12) of the Act says, “No political appointee at any level shall be a voting delegate or be voted for at the convention or congress of any political party for the purpose of the nomination of candidates for any election.”The apex court in a unanimous decision described President Muhammad Buhari and the Attorney-General of the Federation, Abubakar Malami’s suit as an abuse of court process and subsequently dismissed it.\nAccording to Justice Musa Mohammed-Dittjo, who led a seven-man of the Supreme Court, the plaintiffs having earlier assented to section 84 (12) of the Electoral Act 2022, cannot turn around to approach the court to strike it down.\n“There is no provision in the constitution that vests the president the power to challenge the constitutionaility or desirability of a legislation after he has assented or denied his assent.\nIn this case, the president gave his assent,” the apex court held ."
  },
  {
    "headline": "Passionate Plea to Buhari on Inauguration of NDDC Board without Further Delay – THISDAYLIVE",
    "summarized_story": "Prior to your coming to power in 2015, in the absence of a Board duly constituted in line with the NDDC Act, the most senior Civil servant in the NDDC took over as Managing Director in acting capacity for a brief period until a Board was constituted in line with the NDDC Act.\nThe NDDC Act, provides that each of the nine oil producing states have a representative on the board.\nAll the members of the Board listed above are on part time basis as clearly stated in Section 2(3) of the NDDC Act.\nThis has given rise to tension in the Niger Delta region.\nPresident Buhari should now rise to the occasion to save the Niger Delta region from those who have deliberately decided to exacerbate the palpable tension in the region."
  },
  {
    "headline": "2023: House Member Faults APC’s Attempt to Substitute His Name – THISDAYLIVE",
    "summarized_story": "Adedayo Akinwale in AbujaA member of the House of Representatives Committee and House Committee Chair on Climate Change, Chief Sam Onuigbo, has raised the alarm over alleged attempt by the All Progressives Congress (APC) to substitute his name with one Emeka Atuma.\nHe stated categorically that the attempt to supplant genuine winners of party’s primaries was tantamount to political gangsterism.\nI defeated my closest opponent, Chief Henry Ikoh, by 157 to 152 votes.\n“Out of this nine, four of us came from Abia Central, these are myself, Chief Samuel Onuigbo, Chief Henry Ikechukwu Ikoh, Senator Nkechi Justina Nwaogu and Chief Kelvin Chima Ugboaja.\nA few days to the election, Senator Nkechi Justina Nwaogu, wrote and withdrew from the election, then Chief Kelvin Chima Ugboaja did not make it to the election."
  },
  {
    "headline": "Chukwuka Monye to Strengthen Volunteers Network – THISDAYLIVE",
    "summarized_story": "The second runner-up in the just concluded presidential primaries on the African Democratic Congress (ADC) platform, Chukwuka Monye, has dismissed his defection speculations, stressing that he is currently working on strengthening the network of volunteers he has built.\nSource close to the 42-year-old Oxford and Harvard-trained social innovator, said Monye who is considered the new and strategic politician represents a new breed of nation builders, is working on strengthening the network of volunteers he has built before the primaries.\nMonye was said to have had a virtual call while abroad on a working holiday recently with coordinators who led the extensive national network of volunteers.\nDuring the call, Monye was said to have reminded his team that politics is about effectiveness and that the network can only be effective if it is further strengthened.\n“But you should understand that he is a deep thinker and is thorough in how he evaluates strategic options."
  },
  {
    "headline": "EXCLUSIVE: Anti-graft Agency, ICPC Uncovers Billions In Cash Meant For Arms, Ammunition To Fight Boko Haram In Abuja Home Of Ex-Chief Of Army Staff, Buratai",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) has recovered N1.85 billion from a house and office said to belong to former Chief of Army Staff, Tukur Buratai in Abuja, multiple sources told SaharaReporters.\nThe Chief of Army Staff (COAS), Lt General Yusuf Tukur Buratai.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nSaharareporters investigations showed that it belonged to a Nigerian Army Major, Emmanuel G. Adegbola of the Nigerian Army Finance Corps (N/10808).\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "EXCLUSIVE: Anti-graft Agency, ICPC Uncovers Billions In Cash Meant For Arms, Ammunition To Fight Boko Haram In Abuja Home Of Ex-Chief Of Army Staff, Buratai",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) has recovered N1.85 billion from a house and office said to belong to former Chief of Army Staff, Tukur Buratai in Abuja, multiple sources told SaharaReporters.\nThe Chief of Army Staff (COAS), Lt General Yusuf Tukur Buratai.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nSaharareporters investigations showed that it belonged to a Nigerian Army Major, Emmanuel G. Adegbola of the Nigerian Army Finance Corps (N/10808).\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "Presidential Candidates, Atiku, Tinubu, With History Of Fraud Allegations Not Likely To Promise Anti-Corruption Fight During Campaign —Bloomberg Report",
    "summarized_story": "The presidential candidates of the ruling All Progressives Congress (APC) and opposition Peoples Democratic Party (PDP), Bola Tinubu and Atiku Abubakar, have been described as unfit to end corruption in the country.\nAccording to the report, the history of graft allegations surrounding the two candidates means neither is likely to curb corruption in the run-up to February’s vote.\nThe report noted that Nigeria’s next president will face a daunting challenge to turn around Africa’s largest economy.\nIn July 2005, Jefferson told a cooperating witness that Atiku Abubakar had also agreed to accept a bribe in exchange for his assistance, according to the Louisiana congressman’s indictment.\nBoth Tinubu and Atiku will focus on issues other than corruption while campaigning, said Hoffmann."
  },
  {
    "headline": "Presidential Candidates, Atiku, Tinubu, With History Of Fraud Allegations Not Likely To Promise Anti-Corruption Fight During Campaign —Bloomberg Report",
    "summarized_story": "The presidential candidates of the ruling All Progressives Congress (APC) and opposition Peoples Democratic Party (PDP), Bola Tinubu and Atiku Abubakar, have been described as unfit to end corruption in the country.\nAccording to the report, the history of graft allegations surrounding the two candidates means neither is likely to curb corruption in the run-up to February’s vote.\nThe report noted that Nigeria’s next president will face a daunting challenge to turn around Africa’s largest economy.\nIn July 2005, Jefferson told a cooperating witness that Atiku Abubakar had also agreed to accept a bribe in exchange for his assistance, according to the Louisiana congressman’s indictment.\nBoth Tinubu and Atiku will focus on issues other than corruption while campaigning, said Hoffmann."
  },
  {
    "headline": "Nigerian Military Court Orders Imprisonment Of 30 Soldiers, Dismissal Of Four",
    "summarized_story": "A military court in Borno has ordered the imprisonment of 30 soldiers and officers for committing various offences.\nThe judgement is, however, subject to the approval of the army council and Chief of Army Staff.\nThe Theatre Commander of Operation Hadinkai, Major General Christopher Musa disclosed this during the inauguration of another special court to try 29 soldiers at the headquarters of the theatre in Maimalari Barrack in Maiduguri, Borno State.\nMusa who gave the breakdown of the cases said a total of 227 soldiers and officers were presented before the military court.\n“What we have done is that they were recommended and forwarded to Army Headquarters."
  },
  {
    "headline": "ICPC raids Abuja property of military contractor, 'recovers N175m, $220k'",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) says it raided the property of Kabiru Sallau, managing director of K Salam Construction Company Nigeria Limited, for alleged money laundering.\nThe ICPC said this following reports on Thursday that claimed the commission raided the properties belonging to Tukur Buratai, former chief of army staff, in Abuja, and recovered multi billion-naira luxuries.\nFacts available for the time being indicate that the property is owned by the owner of K Salam Construction Company, a military contractor,” the statement reads.\nAdvertisement“The Commission recovered money and other items from the property viz-a-viz N175,706,500; $220,965; G-Wagon; 2022 editions of BMW and Mercedes Benz cars; customized mobile phones; several designer wrist watches, including three Rolexes, and some property documents.\n“The Commission arrested the Managing Director of K Salam Construction Company Nigeria Limited, Mr. Kabiru Sallau and investigation is ongoing."
  },
  {
    "headline": "ICPC raids Abuja property of military contractor, 'recovers N175m, $220k'",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) says it raided the property of Kabiru Sallau, managing director of K Salam Construction Company Nigeria Limited, for alleged money laundering.\nThe ICPC said this following reports on Thursday that claimed the commission raided the properties belonging to Tukur Buratai, former chief of army staff, in Abuja, and recovered multi billion-naira luxuries.\nFacts available for the time being indicate that the property is owned by the owner of K Salam Construction Company, a military contractor,” the statement reads.\nAdvertisement“The Commission recovered money and other items from the property viz-a-viz N175,706,500; $220,965; G-Wagon; 2022 editions of BMW and Mercedes Benz cars; customized mobile phones; several designer wrist watches, including three Rolexes, and some property documents.\n“The Commission arrested the Managing Director of K Salam Construction Company Nigeria Limited, Mr. Kabiru Sallau and investigation is ongoing."
  },
  {
    "headline": "My family and I with Ekweremadus in their travail, says Peter Obi",
    "summarized_story": "Peter Obi, presidential candidate of the Labour Party (LP), has reacted to the organ harvesting allegation against Ike Ekweremadu, former deputy senate president, in the UK.\nIn a tweet on Friday, Obi expressed concern over the allegation, saying justice should be served on the case.\n“My family and I are with the Ekweremadu’s over their travail,” Obi tweeted.\n-PO — Peter Obi (@PeterObi) June 24, 2022AdvertisementWeeks ago, Ekweremadu reportedly said people from the south-east geo-political zone will not vote for LP in the 2023 elections.\nAlthough he admitted that Obi is a credible candidate, Ekweremadu said south-easterners should not “throw away” their vote on LP because it cannot win the presidency."
  },
  {
    "headline": "My family and I with Ekweremadus in their travail, says Peter Obi",
    "summarized_story": "Peter Obi, presidential candidate of the Labour Party (LP), has reacted to the organ harvesting allegation against Ike Ekweremadu, former deputy senate president, in the UK.\nIn a tweet on Friday, Obi expressed concern over the allegation, saying justice should be served on the case.\n“My family and I are with the Ekweremadu’s over their travail,” Obi tweeted.\n-PO — Peter Obi (@PeterObi) June 24, 2022AdvertisementWeeks ago, Ekweremadu reportedly said people from the south-east geo-political zone will not vote for LP in the 2023 elections.\nAlthough he admitted that Obi is a credible candidate, Ekweremadu said south-easterners should not “throw away” their vote on LP because it cannot win the presidency."
  },
  {
    "headline": "Supreme court strikes out Malami's suit challenging section 84(12) of Electoral Act",
    "summarized_story": "The supreme court has struck out the suit challenging section 84(12) of Electoral Act.\nAbubakar Malami, attorney-general of the federation, on behalf of the federal government, had filed a suit challenging that section of the Electoral Act, 2022 on the grounds that it violates the rights of political appointees.\nAdvertisementAokmaye Agim, justice who read the lead judgment, held that having earlier assented to the Electoral Act 2022, with section 84(12) in it, the president cannot turn around and ask the court to remove it.\nHe added that the request by Buhari to the national assembly to delete the provision amounted to constitutional violation.\n“This suit cannot be entertained by this court under section 1(1) (a) of the Additional Jurisdiction of the Supreme Court Act.”"
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Kune, the controversial Kenyan foodtech startup, has shut down",
    "summarized_story": "Kune, a Kenyan food tech startup that delivered ready-to-eat meals at affordable prices, is closing down today, the company’s founder and CEO Robin Reecht announced.\nThe announcement comes just 4 months after the startup began its commercial operations at established meal centers around Nairobi.\nAround that time, Kune leadership also declared its intentions to raise $3.5 million in its second round of funding.\nBut while Kune was well-liked by its customers, the startup’s journey wasn’t without its fair share of controversy.\nAddressing Kune’s investors, he said, “Not only did you invest in Kune but you gave us your time, brain-width, connections, and emotional support."
  },
  {
    "headline": "These founders are helping companies make decisions with data",
    "summarized_story": "It wasn’t their first time venturing into business together; only the previous year they’d tried building an aggregator to curate data from various African countries which multinational companies could use.\nRutakangwa understands why these costly business errors occur: the data the multinational companies rely on—often collected by market research firms—is assumed African countries to be monolithic and did not provide companies with enough detail with which to make market expansion decisions.\nSo, Rutakangwa and Sewankambo employed regular local consumers, called “mappers”, to collect the data from shops and households.\nWhen a mapper submits the data, Rwazi verifies the information by checking that the shop or household’s geocoordinates matches the mapper’s current location.\nBut Rutakangwa saw things differently: in principle, mapping data for hospitals and pharmacies was the same as mapping for beverage and liquor companies."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "AAU varsity resumption: Obaseki says suspension of union activities not a witch-hunt – Nigerian Observer",
    "summarized_story": "The decision followed the protest by students of Ambrose Alli University (AAU), Ekpoma, over the lingering strike by the Academic Staff Union of Universities (ASUU), after which the government directed all cadre of staff to report to their duty posts immediately.\nWe will not compromise education because we are who we are today because of the quality of education that we received.\n“If ASUU has a problem with the federal government, how is that our problem in Edo State?\nIf ASUU has a problem with the federal government, why should we suffer in Edo?” he queried.\nHe said, “No employer of labour in Africa will increase wages without negotiation but you have achieved this."
  },
  {
    "headline": "GIZ, Edojobs Empower 3,000 Edo Students with Entrepreneurship Skills – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – A German development agency, Deutsche Geselschaft fur Internationale Zusammenarbeit (GIZ), in partnership with Edo State Skills Development Agency, also known as Edojobs, has equipped more than 3,000 secondary school students in Edo with entrepreneurial skills in the last three years.\nHead, Economic Education and Entrepreneurship of GIZ, Miss Oladoyin Olawaiye, disclosed this at the Edo Student Entrepreneurship Activity Hub (SEA-Hub) Exhibition and Competition 2022, held in Benin on Wednesday.\n“I am pleased to see the students display innovative works and products after we had trained them on entrepreneurship skills.\nIn her remarks, Managing Director of Edo State Skills Development Agency, Mrs Ukinebo Dare, congratulated the students for keying into the life-changing opportunity to become solution providers at young age.\nDare added that the state government would partner more with GIZ to ensure that the entrepreneurship initiative was extended to more schools in the state."
  },
  {
    "headline": "DCNS. Ayo Eguaveon at 82: Harvesting the joys of motherhood – Nigerian Observer",
    "summarized_story": "So when Benin City was painted red on Sunday for the eighty-two birthday bash of Dcns.\nDcns Ayo’s children all attributed their successes in life to the sacrifices of their mother whom they all described as “virtous woman”.\nAyo Eguaveon earned as a teenager remains the only educational qualification of her life that she never stops telling her children and grandchildren about.\nWhile paying tribute to her mother, Pastor (Mrs) Gladys Ohenzuwa who is the second child and first daughter of Dcns.\nDcns Eguaveon no doubt has the rare crown of a fufilled motherhood whose children are proud of."
  },
  {
    "headline": "Obaseki hails citizens’ support for improved security in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…charges elites on selflessness, community devtBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has commended citizens of the state for their sustained collaboration and support for the state government’s efforts at ensuring improved security.\nObaseki, who noted that his administration has institutionalised intelligence-driven community policing architecture, said the support of residents has contributed to the success recorded in ridding the state of crime and criminals.\nThe foundation was set up by a former Inspector General of Police (IGP), Solomon Arase, who celebrated his 66th birthday.\nCommending the philanthropic gesture of former Inspector General of Police, Arase, the governor said, “We thank you for your support and leadership.\nI am glad you are now in the vanguard of pushing for citizens’ policing in the country,” he added."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Peter Obi expresses support for Ekweremadu amid allegations of organ harvesting",
    "summarized_story": "Presidential candidate of the Labour Party, Peter Obi, has expressed support for former Deputy Senate President, Ike Ekweremadu and his wife, Beatrice, over their travails with the UK legal system.\nThe Ekweremadus were on Thursday remanded in custody by a UK court on charges of bringing a child to the UK for organ harvesting.\nTweeting on Friday, Obi said, “My family and I are with the Ekweremadu’s over their travail.\nDamla Ayas, the crown prosecutor, told on the court that part of the allegations against the couple took place in Nigeria.\nOn Thursday, the London metropolitan police announced that the Ekweremadus were charged to court over the allegation of bringing a child to the UK for organ harvesting."
  },
  {
    "headline": "Gospel Singer, Mercy Chinwo, shares pre-wedding pictures with fiance",
    "summarized_story": "Mercy Chinwo, popular Nigerian gospel artiste, has announced her engagement to Pastor Blessed Uzochikwa of The Waterbrook Church.\nThe Rivers State born singer took to her Instagram page to make the announcement.\nSharing pre-wedding photos on her Instagram page on Wednesday, Chinwo said, “I am blessed to be blessed with #theofficialblessed ❤️ The thoughts of doing the next phase and the rest phase of my life with you makes the blessing more real💃 I love you Sweet❤️”"
  },
  {
    "headline": "Brazil to supply 10,000 tractors to Nigerian farmers – FG",
    "summarized_story": "Nigeria’s federal government, has announced that it is working with Brazil to supply and distribute 10,000 tractors to farmers nationwide.\nAccording to the minister, the deal will boost Nigeria’s mechanized food production, and also enhance food sufficiency is an era of global food crisis.\nHe said the partnership between Brazil and Nigeria is aimed at fast tracking the mechanisation of the agricultural sector, improving production, boosting economy, enhancing food self-sufficiency and creating job opportunities for Nigerian youths.\n“It is also a clarion call to bring succour to the drudgery nature of Nigeria’s farm practices in order to encourage the teeming youths to embrace the agricultural sector.\n“The quest for food self- sufficiency cannot be achieved using the old method of rudimentary tools,” Abubakar said."
  },
  {
    "headline": "Rivers 2023: ADC guber candidate picks Tonto Dikeh as running mate",
    "summarized_story": "The Governorship candidate of the African Democratic Congress (ADC) Rivers State, Mr. Tonte Ibraye, has picked controversial Nollywood, Tonto Dikeh as his running mate for the 2023 governorship election in the state.\nThe actress took to her official Instagram page on Friday to announce the news and as well thank the candidate for choosing her.\nShe wrote, “I thank Mr. Tonte Ibraye(@tonteibraye), the Governorship Candidate of the African Democratic Congress (ADC) Rivers State for nominating me as his running mate.\n“I am glad to be a proud member of the #RiversRescueMission2023Please get your PVC and join the movement.\nYou are the Future and The future is now!TonteTonto2023″"
  },
  {
    "headline": "Supreme Court throws out Buhari, Malami’s suit against new Electoral Act",
    "summarized_story": "The Supreme Court has thrown out the suit President Muhammadu Buhari and the Attorney-General of the Federation and Minister of Justice, Mr. Abubakar Malami, SAN, filed to void section 84 (12) of the Electoral Act, 2022.\nIt held that President Buhari was not a proper person to approach it with such suit, owing to the nature of reliefs that were sought.\nIt argued that President Buhari, having accented to the Electoral Bill, he, “has conclusively discharged his duty under the Constitution”.\nHe argued that President Buhari, having assented to the Electoral Act, he could not turn back to challenge its provisions in court.\n“It appears as if the President is suing himself, since he also assented to the Electoral Act in question."
  },
  {
    "headline": "JUST-IN: ICPC Raids Abuja Home Of Military Contractor, Recovers Cash, Multi-billion Naira Items",
    "summarized_story": "The Independent Corrupt Practices and other related offences Commission (ICPC) has confirmed the raid on a house in Abuja, where its operatives recovered cash, cars, Rolex watches worth billions of Naira.\nFacts available for the time being indicates that the property is owned by owner of K Salam Construction Company, a military contractor.\n“The Commission arrested the managing director of K Salam Construction Company Nigeria Limited, Mr. Kabiru Sallau and investigation is ongoing.\nGen. Buratai (rtd) was part of the immediate-past Service Chiefs when he served as the Chief Army Staff.\nOn retirement from service, he was subsequently appointed by President Muhammadu Buhari as Nigeria’s Ambassador to Benin Republic, where he is currently serving."
  },
  {
    "headline": "JUST-IN: ICPC Raids Abuja Home Of Military Contractor, Recovers Cash, Multi-billion Naira Items",
    "summarized_story": "The Independent Corrupt Practices and other related offences Commission (ICPC) has confirmed the raid on a house in Abuja, where its operatives recovered cash, cars, Rolex watches worth billions of Naira.\nFacts available for the time being indicates that the property is owned by owner of K Salam Construction Company, a military contractor.\n“The Commission arrested the managing director of K Salam Construction Company Nigeria Limited, Mr. Kabiru Sallau and investigation is ongoing.\nGen. Buratai (rtd) was part of the immediate-past Service Chiefs when he served as the Chief Army Staff.\nOn retirement from service, he was subsequently appointed by President Muhammadu Buhari as Nigeria’s Ambassador to Benin Republic, where he is currently serving."
  },
  {
    "headline": "Senatorial Candidate Urges South East To Use APGA Get NASS Seats",
    "summarized_story": "The All Progressives Grand Alliance (APGA) senatorial candidate for Imo East, Mr Chyma Anthony, has called on the people of the South East to focus their attention on producing more members of the National Assembly through APGA in next year’s election.\nAnthony was reacting to the failure of the major political parties in the country to zone their presidential tickets to the South East, saying that the region still has an opportunity of uniting under one party to elect members of parliament from the zone.\nHe was speaking at a media briefing with journalists in Abuja, yesterday, saying the South East still has a window of presenting itself as a formidable force in the National Assembly by adopting its traditional party, APGA to speak for the region in parliament.\n“The decision of the All Progressives Congress (APC) and the Peoples Democratic Party (PDP) to look other ways other than zoning the presidency to the South East is painful especially considering the fact that the South East has been the cornerstone of the PDP since 1999.\nDisclose All Dollar Investments During Obi’s Tenure, POSN Urges Anamb"
  },
  {
    "headline": "Senatorial Candidate Urges South East To Use APGA Get NASS Seats",
    "summarized_story": "The All Progressives Grand Alliance (APGA) senatorial candidate for Imo East, Mr Chyma Anthony, has called on the people of the South East to focus their attention on producing more members of the National Assembly through APGA in next year’s election.\nAnthony was reacting to the failure of the major political parties in the country to zone their presidential tickets to the South East, saying that the region still has an opportunity of uniting under one party to elect members of parliament from the zone.\nHe was speaking at a media briefing with journalists in Abuja, yesterday, saying the South East still has a window of presenting itself as a formidable force in the National Assembly by adopting its traditional party, APGA to speak for the region in parliament.\n“The decision of the All Progressives Congress (APC) and the Peoples Democratic Party (PDP) to look other ways other than zoning the presidency to the South East is painful especially considering the fact that the South East has been the cornerstone of the PDP since 1999.\nDisclose All Dollar Investments During Obi’s Tenure, POSN Urges Anamb"
  },
  {
    "headline": "Terrorism Financing: Auditors Urged To Monitor Digital Payments System",
    "summarized_story": "According to him, processes, controls and regulations around the recognition, reporting, safeguarding and management of crypto currency accounts, account holder information, transactions and all the possible money laundering and financing of terrorism risks that such innovation can bring are areas auditors must watch out for.\nHe said, “today, we have the advent of crypto currencies and regulations around these and future innovations need to be covered by audit teams.\nProcesses, controls and regulations around the recognition, reporting, safeguarding and management of crypto currency accounts, account holder information, transactions and all the possible money laundry and financing of terrorism risks that such innovation can bring are areas auditors must watch out for.”“The Central Bank of Nigeria (CBN) issued a circular to all deposit money banks and payment ser- vice providers in February 2021 on its regulatory framework for open banking in Nigeria.\nCBN Regulatory Guidelines on the e-Naira was issued in October 2021 – to provide few ex- amples of new regulations coming up in the digitization age.\n“According to Ude, regulations have evolved to protect customers and banks from exploitation, abuse and misuse, but auditors cannot overlook the regulatory angle of in- creased digitisation."
  },
  {
    "headline": "Organ harvesting: Dino Melaye reacts to arrest of Ekweremadu, wife",
    "summarized_story": "Former Kogi West Senator, Dino Melaye has expressed his support for ex-Deputy Senate President, Ike Ekweremadu amid controversy of alleged organ harvesting.\nMelaye said he stands with Ekweremadu because there was no wrongdoing by the Senator.\nEkweremadu and his wife, Beatrice were arrested in London for allegedly plotting to harvest the kidney of a Nigerian minor.\nSharing Ekweremadu’s letter via his Twitter handle, Melaye wrote: “Sen.\nIke Ekweremadu notified the British authorities on his trip with the said boy."
  },
  {
    "headline": "BREAKING: Electoral Act: Supreme Court Dismisses Buhari’s Suit Against National Assembly",
    "summarized_story": "A lawsuit filed against the National Assembly to challenge the validity of contentious provision 84 (12) of the Electoral Act of 2022 was dismissed by the Supreme Court.\nThe Apex Court ruled that Buhari lacks the authority to reverse course and contest the validity of the Electoral Act after giving his assent to the Electoral Bill on February 25, 2022.\nThe action of Buhari instituting the case was deemed a blatant abuse of court in a ruling drafted and just delivered by Justice Emmanuel Akomaye Agim.\nThe President attempted to approve and disapprove simultaneously through the lawsuit, according to the Supreme Court, and this cannot be permitted.\nThe unanimous verdict held that Buhari having participated in the making of the Electoral Act by his assent, lacked Constitutional Powers to come up to challenge same."
  },
  {
    "headline": "UK’s Attorney General To Decide If Ekweremadus’ Trial Will Go Ahead",
    "summarized_story": "UK’s Attorney General To Decide If Ekweremadus’ Trial Will Go AheadIf Ike Ekweremadu, a former deputy senate president, and his wife, Beatrice, will stand trial in the UK on charges of human trafficking, the attorney general of England and Wales will make that decision within 14 days.\nThe couple was accused on Thursday at the Uxbridge Magistrates Court and detained until July 7 while an investigation was conducted.\nHe claimed that because the case was “special,” the attorney general, Sue-Ellen Braverman (above), would have to decide where the trial should take place.\nOn Thursday, the London metropolitan police announced that the Ekweremadus were charged to court over the allegation of bringing a child to the UK for organ harvesting.\nHe returned to the address of the Ekweremadus in London before reporting to a police station."
  },
  {
    "headline": "2023: Aggrieved National Assembly Members Plan Showdown With Govs Over Lost Tickets",
    "summarized_story": "According to sources, Rikiji is close to the state Governor, Bello Mattawale.\nEkiti lawmakersIn Ekiti State, one senator and four House of Representatives members lost their bid to return to their positions following last month’s primaries.\nSome of the National Assembly members who lost have resolved to seek legal redress to challenge the elections.\nIn Benue State, three PDP House of Representatives members lost the party’s tickets.\nThe Senator representing Kwara Central zone, Dr. Ibrahim Oloriegbe, lost the party’s ticket to the Turaki of Ilorin, Alhaji Saliu Mustapha."
  },
  {
    "headline": "Ekweremadu docked in UK, denies organ harvesting allegations",
    "summarized_story": "Appearance before the courtBut notwithstanding the letter, the duo were arrested and appeared before the UK court Thursday.\n“Ike Ekweremadu, 60 (12.05.62) of Nigeria is charged with conspiracy to arrange/facilitate travel of another person with a view to exploitation, namely organ harvesting,” the court further heard.\nProsecutorProsecutor Damla Ayas said: ‘It is conspiracy in relation to human trafficking offences for the purposes of organ harvesting.\nEkweremadu, wife’s counselsGavin Irwin, representing Ekweremadu, said: ‘There is no question this is a serious allegation.\nAppearance before the courtBut notwithstanding the letter, the duo were arrested and appeared before the UK court Thursday."
  },
  {
    "headline": "Osun July 16 governorship election: Sanwo-Olu, Ganduje, Akpabio, Amaechi, Saraki make 86-man campaign team",
    "summarized_story": "The election, slated for July 16th, will be coming up about a month after the APC coasted home to victory in Ekiti governorship election.\nThe 86-member campaign council is headed by Lagos state Governor Babajide Sanwo-Olu and co-chaired by Kano state Governor Abdullahi Umar Ganduje.\n“There’s no option to winning the national election and these state elections are like I said, forebears to the national election.\nWe agreed that all stakeholders in Osun state will come together and constitute into one single force in order to win this important election.\n“I am happy the secretary of our great party is from Osun state and I think he is very useful to this election in Osun state."
  },
  {
    "headline": "Pictures: Amotekun parade suspects linked to Owo church massacre",
    "summarized_story": "The Ondo state command of the Southwest security network, code-named Amotekun, says it has arrested some suspects linked to the attack on St Francis Catholic Church, Owo.\nGunmen had on June 5, 2022 attacked the church in Owo and murdered over 40 worshippers.\nOwo is the home town of the sitting governor of Ondo state, Arakunrin Rotimi Akeredolu.\nShare this: TwitterFacebook"
  },
  {
    "headline": "Access Bank to reward customers in South-South, South-East",
    "summarized_story": "Kehinde Ibrahim, LagosACCESS Bank Plc has said it would be rewarding its customers in the South-South and South-East regions with millions of naira and other attractive consolation prizes in its DiamondXtra regional draw.\nSpeaking to newsmen at the bank’s head office in Lagos recently, Group Head, Consumer Banking, Access Bank Plc, Adaeze Ume, explained that the motivation behind the regional draws in the new season of the reward scheme is the need to transform the lives of more Nigerians across the country.\nIn her words, “To deliver on our promise to continually reward our customers for their loyalty and continued savings with our bank, we have decided to take the DiamondXtra reward scheme draws even closer to them.\nWe intend to reward 38 lucky customers in the South-South, South- East region with juicy cash and consolation prizes in the LIVE draw taking place on the 29th of June 2022 in Owerri, Imo State.\n“We continue to evolve and reflect on the various offers within the DiamondXtra reward programme, and engage our customers on what they would prefer to have as a reward."
  },
  {
    "headline": "CFI, others win prizes at NCRIB maiden tennis competition",
    "summarized_story": "Kehinde Ibrahim, LagosTHE Commissioner for Insurance and Chief Executive Officer of the National Insurance Commission (NAICOM) Mr. Olorundare Sunday Thomas has been declared overall winner of the Nigerian Council of Registered Insurance Brokers (NCRIB) maiden tennis competition in Veteran categoryThe Competition held at the weekend at Lagos Lawn Tennis Club, Lagos.\nThe two days competition which was well attended by members of the Lagos Lawn Tennis Club, students of both Secondary and tertiary institutions and insurance industry became a platform for stakeholders to drum the beats of insurance importance to sport lovers.\nOur intention is to indirectly enforce, not only the government’s highlighted insurance policies, but all insurance products without compulsion.\nYou will recall that few days ago, we embarked on Insurance Awareness Walk from Moleye to Adekunle end of Lagos Third Mainland Bridge, where we shared flyers that narrate what insurance stands for.\nBefore the end of the year, we have plan to take the awareness walk campaign to market places, government circles."
  },
  {
    "headline": "PenCom kicks off online verification for MDAs’ retirees",
    "summarized_story": "Kehinde Ibrahim, LagosTHE National Pension Commission (PenCom) has started its online verification and enrolment for prospective retirees and retirees of Federal Government Treasury Funded Ministries, Departments and Agencies (MDAs), the Director-General, Mrs. Aisha Dahir-Umar has said.\nAnnouncing this, Mrs. Dahir-Umar, called on prospective retirees to ensure that they undergo the compulsory Data Recapture Exercise (DRE).\nShe stated that the exercise was aimed at validating the accrued pension liabilities of government for the retirees.\nShe said: “The accrued right is a component of the Retirement Savings Account (RSA) of the employee to be accessed upon retirement.\nHowever, following the experience of the COVID-19 pandemic in 2020, which restricted the movement of persons, PenCom designed and developed an online Enrolment Application with the capabilities to register, verify and enrol the prospective retirees."
  },
  {
    "headline": "NCDMB to set minimum benchmark for women in oil, gas sector",
    "summarized_story": "…to begin disbursement of $40m Women FundPalma IleyeNigerian Content Development and Monitoring Board, NCDMB, has announced plans to set a minimum percentage of females that must be included in any Human Capacity Development, HCD, programme or initiative that it will approve for the Nigerian Oil and Gas Industry.\nSimbi Kesiye Wabote, stated this at the 2nd Nigerian Women in Oil and Gas Conference.\nHe noted that women make up 48 percent of the global labour force, but they only account for 22 percent of the labour force in the oil and gas sector.\nThe Minister harped on the need to be deliberate in getting more girls into Science Technology Engineering and Mathematics, STEM, which was a pathway to careers in the oil and gas industry.\nHe also advised women in the Nigerian Oil and Gas industry to work together towards increasing participation of fellow women in the industry by engendering growth, building capacities and capabilities, identifying opportunities, mentoring and coaching."
  },
  {
    "headline": "Buhari: directed action to bring back kidnapped railway passengers home alive",
    "summarized_story": "Naomi DouglasPresident Muhammadu Buhari has directed increased efforts through kinetic and non-kinetic means to bring the case of the kidnapped railway passengers in Kaduna State to a closure.\nThe Senior Special Assistant to the President on Media and Publicity, Malam Garba Shehu, announced the president’s directive yesterday in a statement titled “President Buhari Directs Urgency in Dealing with Kidnapped Railway Passengers’ Case”.\nPassengers were abducted when bandits attacked a train plying Abuja-Kaduna route on March 28, 2022.\nShehu said upon the President’s approval, the government had continued on the two-lane approach, kinetic and non-kinetic, to secure the passengers’ safe release.\n“The setback notwithstanding, the Government is not leaving any stone unturned in the efforts to bring all of the hostages back."
  },
  {
    "headline": "Electoral Act: Supreme Court Strikes Out Buhari’s Suit Challenging Section 84(12)",
    "summarized_story": "The Supreme Court on Friday struck out President Muhammadu Buhari and the Attorney General of the Federation’s suit challenging Section 84(12) of the Electoral Act.\nThe President and his Minister of Justice, Abubakar Malami, had filed a suit at the Supreme Court, seeking an interpretation of the controversial clause in the Electoral Amendment Act 2022.\nSenate, Reps To Appeal Court Order Removing Section 84 (12) From Electoral ActAppeal Court Sets Aside Judgement On Section 84(12) Of Electoral ActThere have been several debates regarding Section 84(12) of the amended Electoral Act 2022 which was assented to in February.\nUpon assenting to the act, President Buhari had asked the National Assembly to delete the contended clause, however, the parliament declined the president’s request.\nThe Apex Court unanimously agreed that President Buhari lacked the jurisdiction to bring the suit before it because of the nature of the reliefs sought."
  },
  {
    "headline": "Strike: Ngige Did Not Invite Us To Any Meeting On Thursday – ASUU",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) says the Minister of Labour and Employment Chris Ngige did not invite the union for a meeting.\nNgige had after the Federal Executive Council (FEC) meeting on Wednesday said he will be meeting with the union to continue discussions about the lingering strike embarked on by ASUU.\nBut ASUU president Emmanuel Osodeke said the union was not informed about any meeting with the Federal Government.\n“He should confirm to the world that he sent an invitation to ASUU for a meeting on Thursday.”READ ALSO: ASUU Strike Will Be Resolved Soon, Ngige Assures NigeriansProfessor Osodeke asked the labour minister to leave negotiations with the union.\nNgige had earlier assured Nigerians that the protracted action will be resolved soon, saying the Federal Government is determined to see public universities reopened."
  },
  {
    "headline": "Buhari Rules Out Bail Option For IPOB Leader Nnamdi Kanu",
    "summarized_story": "President Muhammadu Buhari has ruled out the bail option for the leader of the proscribed Indigenous Peoples of Biafra (IPOB) Nnamdi Kanu.\nInstead, Buhari insisted that the IPOB leader should “justify all the uncomplimentary things he had been saying against Nigeria in Britain”.\n“He felt very safe in Britain and said awful things against Nigeria.\nThese people, he said “are causing havoc everywhere, as the only thing they know how to do is to shoot guns”.\nAnd the education process is working, the people now understand Boko Haram as anti-God, and not about religion”."
  },
  {
    "headline": "Senate Minority Leader, Others Visit Wike",
    "summarized_story": "Senate Minority Leader, Philip Aduda on Thursday led the leadership of the Peoples Democratic Party (PDP) in the Senate to meet with Rivers State Governor, Nyesom Wike in Port Harcourt.\nSenator Aduda who has been a long-time ally of Governor Wike was nominated as Minority Leader two days ago to replace the former, Enyinaya Abaribe who defected from the PDP.\nOn the entourage are, Deputy Minority Leader, Shuaibu Lau, Minority Whip, Chukwuka Utazi, and Deputy Minority Whip, Danjuma La’ah.\nSenator Barry Mpigi from Rivers State was on hand to receive the guests alongside Governor Wike.\nREAD ALSO: Orubebe Holds Private Meeting With Wike After Dumping PDPThe meeting was held behind closed doors in the private residence of Governor Wike in Port Harcourt."
  },
  {
    "headline": "Boko Haram Logistics Supplier Nabbed As Troops Neutralise Six Terrorists",
    "summarized_story": "The Nigerian Military says it has neutralised six terrorists across its various theatres of operation.\nAuthorities of the military also say troops arrested collaborators of the insurgents – a notorious gun runner and a Boko Haram logistics supplier.\nGeneral Onyeuko said troops engaged in shoot out with the terrorists and in the process troops rescued 6 of the kidnapped victims and neutralized 2 of the terrorists.\nOn the same day, a Boko Haram terrorist, Mallam Modu Rija surrendered to the Nigerian troops at Tashangoto area.\nIn a similar vein, on the 21st of June 2022 troops arrested a Boko Haram member, Mallam Abacha Usman at Benishek and a terrorists’ logistics supplier Mallam Ibrahim Gira."
  },
  {
    "headline": "APC inaugurates Sanwo-Olu-led Osun Governorship Campaign Council -",
    "summarized_story": "The All Progressives Congress on Thursday inaugurated the Governor Babajide Sanwo-Olu-led Osun Campaign Committee with a charge to use whatever it takes within the ambit of the law to win the poll.\nNational Chairman of the party, Abdullahi Adamu, gave the mandate at the inauguration of an 86-member campaign council for Osun governorship election.\nChairman of the council, Babajide Sanwo-Olu, is to be assisted by Governor Abdullahi Ganduje of Kano, while Kebbi State Governor, Senator Abubakar Bagudu; Chairman of the Southwest Governors’ Forum and Governor of Ondo State, Arakunrin Oluwarotimi Akeredolu; Governor of Borno State, Babagana Zulum’ Governor Nasir El-Rufai of Kaduna State and 15 others were appointed as vice-chairmen.\nOther members of the council include: Former Minister of Transportation, Rotimi Amaechi; Minister of Communications and Digital Economy, Dr. Isa Ali Pantami; former Minister of State for Education, Emeka Nwajiuba; former Chief of Army Staff and Nigeria’s Ambassador to the Republic of Benin, General Tukur Buratai and former Attorney General of the Federation and Minister of Justice, Abubakar Malami."
  },
  {
    "headline": "Osun declares Friday Public holiday for PVC collection",
    "summarized_story": "Osun state government has declared Friday, 24th June, as Public holiday for all civil servants in the state to enable them collect Permanent Voter cards ahead of the July 16th governorship election.\nThe Independent National Electoral Commission has set a deadline for the collection of the Permanent Voter Cards in the state ahead of the July 16 governorship election.\nMore than ten political parties are expected to participate in the election predicted by political pundits to be a keenly contested poll between the governing All Progressives Congress Congress and the main opposition, People’s Democratic Party.\nIt is equally expected to be a repeat of the 2018 elections that saw the election running into the runoff after the first ballot failed to produce a clear winner.\nThe two leading candidates, Adegboyega Oyetola (APC) and the People’s Democratic Party, Ademola Adeleke were the two leading candidates in the 2018 election that eventially produced the incumbent (Oyetola) as winner."
  },
  {
    "headline": "Benue Youth Alliance urges APC Guber aspirants to resolve differences -",
    "summarized_story": "Benue Youth Alliances have called on all the Gubernatorial aspirants of the All Progressives Congress to resolve their differences and provide a consensus candidate.\nThey made the call after a rally on major roads in the state capital of Benue, Makurdi.\nThis rally is coming up weeks after the State chapter of the All Progressives Congress party produced Reverend father Hyacinth Alia as the winner of the gubernatorial primary re-election.\nMeanwhile, Some gubernatorial aspirants rejects the party’s re-election result, leading to the uncertainty of people understanding the party’s current conclusion.\nThe Benue Youth Alliances led by Owoicho Onyilo calls on the state party to assist gubernatorial candidates settle with one accepted candidate, as the delay may lead to breakouts."
  },
  {
    "headline": "2023: Get PVCs, ensure your votes count, scholars advise Nigerians -",
    "summarized_story": "The Abeokuta branch of the National Association of Seadogs has urged Nigerians to obtain their Permanent Voter Cards and ensure they troop out on election days to vote and monitor the ballots to prevent cultists and political thugs from hijacking ballot boxes from polling units.\nThe Acting President of the branch, Adeyemi Omitogun, gave this advice during the organisation’s Public Lecture on “Gangsterism, Hooliganism & Cultism in Nigeria : Role of the Family,” held at Gbonogun, Abeokuta.\nHe also admonished citizens to bury the idea of “votes don’t count,” which, according to him, will only embolden bad politicians to continue to manipulate electoral process.\nHe listed hooliganism, gangsterism, bad economy and poor parenting as part of reasons why cultism is increasing among youths in the country.\nHe pointed out economic sustainability and family role as major factors that could reduce the ills of cultism and gangsterism in the society, noting that parents are expected to inculcate morals in their children."
  },
  {
    "headline": "Electoral Act: Supreme Court Strikes Out Buhari and AGF Malami’s Suit on Section 84(12)",
    "summarized_story": "Nigeria’s Supreme Court on Friday struck out a suit filed by President Muhammad Buhari and the Attorney-General of the Federation, Abubakar Malami, challenging the constitutionality of section 84(12) of the Electoral Act.\nA panel of seven justices of the court, led by Musa Dattijo-Muhammad, unanimously struck out the suit, describing it as an abuse of court process.\nHe also said that the request by Buhari to the National Assembly to delete the provision amounted to constitutional violation.\nJustice Agim described the suit as a ploy by Buhari to get the court to validate the violation.\n“This suit cannot be entertained by this court under section 1(1) (a) of the Additional Jurisdiction of the Supreme Court Act."
  },
  {
    "headline": "‘Thread with Caution’: APC Chair Adamu Threatens Renegade Placeholder Machina Over Yobe Senate Seat",
    "summarized_story": "Adamu, who warned Machina to tread with caution, especially, that his comments were becoming overbearing, said delisting Machina’s name from the list of names submitted to the Independent National Electoral Commission (INEC), was in order.\nMachina had won the party’s ticket for Yobe North Senatorial District, but the party substituted his name with Lawan’s after the senate president could not clinch the presidential ticket.\nSpeaking with the BBC Hausa, Adamu said, the party leadership violated no law in substituting Machina’s name for Lawan.\nThus, in a direct message to Machina, who has insisted on recovering his ticket, Adamu said, “Machina should be very careful.\nI will advise him to tread carefully; his comments are becoming too overbearing and I will advise him to be careful."
  },
  {
    "headline": "NNPC Must Address Profiteering at Private Depots to Curb Fuel Scarcity, Independent Marketers Say",
    "summarized_story": "IPMAN members have suffered a lot in the hands of private depot owners.\n“We aren’t saying there is non-availability of petroleum products, but what is available isn’t sufficient The cost of diesel has also increased.\nThese two factors have led to profiteering at tank farms, whereby marketers buy petroleum products at the rate of N169, to N170 above government controlled pump price.\nAccording to the statement, it was becoming increasingly difficult for marketers to sell petroleum products with this little margin.\nThe IPMAN statement added, “There is no way a marketer will use N5 to sell petroleum products."
  },
  {
    "headline": "Nigeria Saved Over N10trn Through Treasury Single Account Implementation, FG Says – Arise News",
    "summarized_story": "Nigeria’s federal government om Thursday disclosed that over N10 trillion has been saved since the Treasury Single Account (TSA) was introduced by the Muhammadu Buhari-led administration.\nThe IPPIS, the DG further explained, led to the weeding out of about 70,000 ghost workers from the service.\n“We have a one shot opportunity to look at IPPIS and say, as at today, we have 720,000 public servants working for Nigeria.\nHis words: “On deductions and complaints around IPPIS, you know, we have just started from the pilot ministries, six.\nHe said government would soon make an announcement on the implementation of the White Paper."
  },
  {
    "headline": "Buhari to Johnson: No 3rd Term for Me, First Person Who Tried It Didn’t End Well",
    "summarized_story": "The Nigerian president told British Prime Minister Boris Johnson, on the sidelines of the conference, that the first person, who tried to extend his tenure – an apparent reference to former President Olusegun Obasanjo – did not end well.\nBuhari, who also met with the Jamaican Prime Minister, Andrew Holness, in Kigali, extolled the cordial political and economic relations between Nigeria and Jamaica.\nA release by Buhari’s media adviser, Femi Adesina, said at the meeting with Johnson, the Nigerian president reiterated his resolve to respect the maximum term limit in the Nigerian constitution.\nThe first person who tried it didn’t end very well.”Obasanjo had towards the end of his second term in 2007 attempted to seek a third term in office but met stiff resistance at the National Assembly.\nBuhari paid tribute to the memory of the victims of the Rwanda genocide and prayed for healing for the survivors."
  }
]