[
  {
    "headline": "BREAKING: Court adjourns Igboho aides’ suit till Aug 4",
    "summarized_story": "The Federal High Court Abuja on Monday adjourned the suit brought by the 12 detained aides of Sunday Adeyemo, popularly known as Sunday Igboho, to August 4.\nJustice Egwuatu granted the applicants’ lawyer, Pelumi Olagbenjesi, the leave to amend his processes to correct the names of the applicants.\nThere was confusion in court regarding the names of the eight applicants produced.\nThus, Olagbejensi applied to amend his processes to reflect their correct names.\nThe DSS only produced eight out of the 12 detained aides of Sunday Igboho."
  },
  {
    "headline": "Kane absent at Tottenham training amid Man United, City transfer links",
    "summarized_story": "Harry Kane has not shown up to Tottenham’s pre-season training amid speculation around his future with the club.\nThe 28-year-old was due to return to Hotspur Way on Monday following a short holiday.\nThe 28-year-old was due to return to Hotspur Way on Monday following a short holiday, Sky Sports News reports.\nThere had been reports in May that Kane told Spurs he wanted to leave this summer with Man City, Manchester United and Chelsea interested.\nTottenham remain in talks with Atalanta over a deal for centre-back Cristian Romero."
  },
  {
    "headline": "Welcome back! – digitalpaper.vanguardngr.com",
    "summarized_story": ""
  },
  {
    "headline": "You have successfully logged out! – digitalpaper.vanguardngr.com",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: Gunmen storm Orlu, behead community leader, destroy 20 shops, vehicles",
    "summarized_story": "By Chinonso AlozieArmed gunmen have unleashed violence in Okporo and neighbouring Communities in Orlu Local Government Area of Imo State.\nIn the attack, a community leader whose identity has not been made known was seen beheaded and his head placed on a table around the market in Okporo community.\nThe number of beheaded persons in the Orlu area has increased to about five, since this violence started.\nREAD ALSO: Unknown gunmen kidnap night club operator in BayelsaIn the attack, two trucks were allegedly set ablaze.\n“Even this Monday morning we hear of strange movement by these men in Okporo community and people started running."
  },
  {
    "headline": "Provide ethical guidance for younger doctors, Ehanire urges AMSN Fellows",
    "summarized_story": "By Chioma ObinnaThe Minister of Health, Dr. Osagie Ehanire weekend urged the newly inaugurated Fellows of the Academy of Medicine Specialities of Nigeria, AMSN, to provide moral and ethical guidance for upcoming generations.\n“It is noteworthy that the Academy adopted a constitution that offers membership not just to academics and medical practitioners but other health care professionals too.\n“This is important and desirable as no sector can on its own provide a solution to all health care challenges of our nation.\n“An efficient health care system requires the participation of components of the establishments and society.\nIn other words, health care is too important to be left to health care providers alone."
  },
  {
    "headline": "Ugwuanyi to meet with Enugu-born aircraft inventor on Tuesday",
    "summarized_story": "…Swears in 68 Development Centre AdministratorsGovernor Ifeanyi Ugwuanyi of Enugu State will, on Tuesday, August 3, at the Government House, Enugu, by 1pm, receive the young inventor, Master Emmanuel Maduabuchi Chukwu, an indigene of the state and student of Government Technical College (GTC), Nsukka, who manufactured a hand-made aircraft.\nUgwuanyi will also on Tuesday, at the Government House, Enugu, by 2pm, swear in all the 68 Development Centre Administrators whose nominations were recently confirmed by the Enugu State House of Assembly.\nA statement by the Commissioner for Information, Nnanyelugo Chidi Aroh, said the governor’s decision to meet with the young aircraft inventor was “in pursuit of his administration’s commitment to encouraging scientific and technological innovation in Enugu State”.\nThe Information Commissioner added that guests invited to the swearing-in ceremony of the Administrators are expected to be seated at the Lion Building, Government House, Enugu, by 1.30pm.\nOthers are Chairman and Members of the State Working Committee of the Peoples Democratic Party (PDP); Chairmen of PDP in the 17 Local Government Areas; State Chairman of the Traditional Rulers’ Council and Local Government Chairmen of the Traditional Rulers’ Council."
  },
  {
    "headline": "Nnamdi Kanu, Sunday Igboho: Buhari govt pushing Igbos, Yorubas out of Nigeria – Ezeife",
    "summarized_story": "Ezeife made the remark while stressing the need for the Nigerian government to engage agitators in a dialogue.\nThe former governor also stated that the travail of Kanu and Igboho may fast-track the call for restructuring of Nigeria.\nFG pushing S/East out of Nigeria – Chukwuemeka Ezeife“So, the arrest of Nnamdi Kanu might fast-track achieving the restructuring and fairness of Nigerian system.\nKanu was recently rearrested from an undisclosed African country and was brought back to Nigeria through extraordinary rendition.\nIgboho had fled Nigeria to Benin Republic after he was declared wanted by the DSS after weapons were discovered after a raid on his home."
  },
  {
    "headline": "Makinde presents staff of office to Olu of Igbo-Ora",
    "summarized_story": "Governor Seyi Makinde of Oyo State has presented instrument of office to the Olu of Igbo-Ora, Oba Jimoh Olajide Titiloye.\nOur correspondent reports that the staff of office was presented to the monarch in Igbo-Ora at the weekend.\nIgbo-Ora is one of the towns in Ibarapa Central Local Government Area in the state.\nMakinde, while presenting the staff of office to the monarch, noted that traditional rulers have a critical role in the development of every society.\nSegun Ogunwuyi, who spoke on behalf of the Governor, stressed the important roles played by traditional rulers in securing lives and property."
  },
  {
    "headline": "Nnamdi Kanu: Crisis hits IPOB as members reportedly shift attention to money",
    "summarized_story": "Carolyn Uchenna Okorafor, the Principal Secretary to Nnamdi Kanu, the leader of the outlawed Indigenous People of Biafra, IPOB, has hinted at a possible crisis within the pro-Biafra group.\nOkorafor lamented that some members of the group are more particular about money than the release of Kanu.\nIn a tweet, she charged members of the group to channel their energies towards the release of the IPOB leader.\nOkorafor tweeted: “People are more concerned with money than the release of @MaziNnamdiKanu !\nPlease put your energy on @MaziNnamdiKanu release and nothing else!!"
  },
  {
    "headline": "BREAKING: Court adjourns Sunday Igboho aides’ suit till Aug 4",
    "summarized_story": "The Federal High Court sitting in Abuja has adjourned the suit brought by the 12 detained aides of Sunday Adeyemo, popularly known as Sunday Igboho, to August 4.\nJustice Egwuatu granted the applicants’ lawyer, Pelumi Olagbenjesi, the leave to amend his processes to correct the names of the applicants.\nThe secret police confiscated the phone while journalists were making move to capture the 12 detained associates.\nThe aides were brought to court on Monday in compliance with the judge’s order.\nJustice Obiora Egwuatu had ordered the DSS operatives to produce the aides who have been in their custody since Igboho’s residence was raided two months ago in court on two occasions."
  },
  {
    "headline": "Borno: Troops eliminate terrorists after Boko Haram assault on military convoy",
    "summarized_story": "Some Boko Haram fighters were killed in Borno on Sunday after a Nigerian military bombardment.\nTroops carried out a successful offensive on their hideouts in the Gubio axis of the state.\nThe sect members launched an attack as officers and men moved along Gubio/Damasak highway at Kareto in the northern part of Borno.\nThe troops had to retreat after suffering casualties.\nIntelligence sources confirmed that the reprisal against the insurgents left dozens dead while weapons and ammunition were also recovered."
  },
  {
    "headline": "Treat every day as special, Alibaba advises",
    "summarized_story": "By Ekaete BasseyVeteran comedian Alibaba has advised that every day should be treated as special for the next day may not be assured.\nADVERTISEMENTAlibaba further advised that people should quit storing up personal effects for ‘special occasions’ but should wear them every other day or give them out to the needy as tomorrow isn’t certain.\nHe wrote:“After thinking of all the things that have happened in the last 2 years and in the last 2 months… every day is a special day.\n“Most times we let the one sad, yes painful, passing of a dear one make us forget the good life they have lived.\nSo treat everyday as special.”"
  },
  {
    "headline": "BREAKING: Wrestling to fetch Nigeria first medal at Tokyo 2020",
    "summarized_story": "By Olalekan OkusanNigeria’s search for a medal at the Tokyo 2020 Olympic Games became a reality on Monday after Blessing Oborududu qualified for the final of the women’s freestyle 68kg in the wrestling event of the games.\nThe 10-time African champion started her campaign against Azerbaijan’s Elis Manolova in the first round (round of 16) and she dominated the European champion and world championship bronze medallist with 13-2 victory by technical superiority with points scored by opponent (VSU1) to advance to quarterfinal where she faced Kyrgyzstan’s Meetim Zhumanazarova, 2018 Asian Games bronze medalist.\nADVERTISEMENTThe close encounter saw the Nigerian prevailing at 3-2 victory by points with points scored by the opponent (VPO1).\nThe semifinal bout, which ensured that Nigeria was certain of its first medal saw Oborududu taking her experienced opponent Mongolia’s Battsetseg Soronzonbold to the cleaner with 7-2 (VPO1) to set up a final clash against number one seed American Tamyra Marianna Stock-Mensah on Tuesday August 3."
  },
  {
    "headline": "VIDEO: Blessing Oborududu celebrates after qualifying for final of the women’s freestyle 68kg in wrestling",
    "summarized_story": "By Adeniyi Adewoyin BBNaija Shine Ya Eye housemate and one of the two wild cards, Maria, has said that she..."
  },
  {
    "headline": "Anyim, Egwu allege attacks, killings of opposition members in Ebonyi",
    "summarized_story": "By Ogochukwu Anioke, AbakalikiEbonyi chapter of the People’s Democratic Party (PDP) and the ruling All Progressives Congress (APC) have disagreed over alleged attacks and killings in the State.\nPDP said its members and supporters have continuously been attacked and accused by the State Government of orchestrating the act.\nThe party alleged the Ebonyi chapter of the Ebube Agụ security outfit has been converted into a political attack militia used to silence perceived opponents of the State Government.\nThe party alleged the creation of Ebubeagu Security outfit by the government has increased persecution of political opponents in the state.\nSam Egwu is doing nothing, he is idle and doesn’t know why Ebonyi North people voted him to represent them."
  },
  {
    "headline": "Anxiety as doctors begin nationwide strike",
    "summarized_story": "From Fred Ezeh, AbujaAnxiety has gripped patients and their families as doctors in public hospitals under the aegis of National Association of Resident Doctors (NARD) begin a nationwide strike today.\nDaily Sun learnt that some patients on admission in public hospitals yesterday moved out to private hospitals to continue treatment, a decision that comes with higher bills.\nLike in previous strikes by doctors in public service, private health clinics are expected to record bumper harvest from this month’s industrial disharmony in the public health care system.\nMeanwhile, the Medical and Dental Practitioners Disciplinary Tribunal (MDPDT), yesterday, said no fewer than 31 health professionals comprising medical doctors and dentists are to appear before it for alleged professional misconduct.\nFour doctors are expecting final judgements from previous cases following the successful completion of their trials by the tribunal, the source said."
  },
  {
    "headline": "$1.1m scam: PSC suspends Kyari, awaits IGP’s update on probe",
    "summarized_story": "The PSC also called on the IGP to furnish the commission with an update of the investigation panel set up to probe the former IRT boss.\n“The Commission has also directed the Inspector General of Police to furnish it with information on further development on the matter for necessary further action.\n“The Commission’s decision, which was conveyed in a letter with reference, PSC/POL/D/153/vol/V/138, to the Inspector General of Police today, Sunday, August 1, 2021, was signed by Hon.\n“The Special Investigation Panel (SIP), comprising four Senior Police Officers, is headed by DIG Joseph Egbunike, the Deputy Inspector General of Police in-charge of the Force Criminal Investigations Department (FCID).\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "We’re monitoring repression in Nigeria –Commonwealth",
    "summarized_story": "The Commonwealth has said it is closely monitoring developments around the suspension of Twitter and allegations of repression of the rights to freedom of expression, access to information, media freedom and disregard for the rule of law in Nigeria.\nIn the appeal, SERAP had stated: “The Nigerian government has repeatedly demonstrated that it is not committed to protecting human rights.\nThis underscores a commitment to the Universal Declaration of Human Rights and other relevant human rights covenants and international instruments.\n“The Commonwealth Secretary-General has been following the developments in Nigeria very closely and she is engaging the relevant stakeholders.\nBut it should never have reached this level, as the government has absolutely no justification to suspend Twitter in Nigeria."
  },
  {
    "headline": "Okonkwo rejoins race as ZLP candidate",
    "summarized_story": "From Magnus Eze, Enugu, Obinna Uzo, and Mokwugwo Solomon, NnewiChairman of the United Nigeria Airlines, Dr. Obiora Okonkwo, has rejoined the Anambra State governorship race, with Zenith Labour Party (ZLP) substituting its candidate with his name.\nShe also served the state meritoriously as Chairman, Anambra State Universal Basic Education Board (ASUBEB between 2005 and 2007.\nLeadership of ZLP will formally unveil Dr. Okonkwo and Dame Balonwu to the good people of Anambra in the next few days.\nHe had his early education in Onitsha, Anambra State, where he combined trading at the Main Market and managing a horde of apprentices, with schooling.\nHigh Chief Okonkwo, who is married with children, is a bridge-builder across all zones and of Anambra State and Nigeria."
  },
  {
    "headline": "Abia alleges plot to attack, kidnap monarchs, govt officials, others",
    "summarized_story": "Abia State Government said it had uncovered plots by renegade members of a non state group to attack and kidnap prominent persons in the state including public office holders, traditional rulers, members of the clergy, and hold them as human shield and ransom for negotiations.\nCommissioner for Information, John Okiyi Kalu, who raised the alarm in a statement, yesterday a strongly admonished those behind the dastardly plot to desist from it.\n“We advise such high profile personalities mentioned above to exercise utmost vigilance while going about their normal duties as security agents in the country are on the trail of the arrowheads of the plot with a view to nipping it in the bud and bring those involved to justice.\nGovernment further appeals to all citizens and visitors to keep their focus on maintaining the existing peace in the state and avoid acts that are capable of reversing the gains we have made collectively in securing the State through the understanding and cooperation of all.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "How Malami, Buni Defied Osinbajo’s Directive to Stop APC Congresses",
    "summarized_story": "Having reached the decision to pause the congress, Osinbajo decided to call Governor Buni on the resolution to suspend to congresses scheduled for Saturday.\nBut to his shock, Buni flatly rejected his directive, insisting like Malami that the congresses would go ahead as planned.\nMalami and Buni belong to the CPC tendency of the APC.\nIt was a bemused Osinbajo, who watched helplessly as Buni refused to obey his directive to suspend the congresses.\n“The Peoples Democratic Party (PDP) is an old, lonely, toothless and hungry Hyena wandering aimlessly in the jungle of political wilderness."
  },
  {
    "headline": "FBI Indictment: PSC Suspends DCP Abba Kyari",
    "summarized_story": "“Abba Kyari’s suspension took effect from Saturday, July 31st 2021 and would subsist pending the outcome of the investigation in respect of his indictment by the Federal Bureau of Investigation of the United States,” it said.\nThe US court documents showed that the American prosecutors had first sought a court warrant to arrest Kyari on February 12, 2021, while another warrant was requested on April 29, 2021.\nBut Wright’s permission for the FBI to arrest Kyari and hold him in a US custody was unsealed on July 26, 2021.\n“The earlier the EFCC knows that it was established to fight corruption in the interest of the public the better.\n“If fighting corruption means much to the EFCC, they should address the concerns of Nigerians about the red-hot Abba Kyari relationship with the convicted scammer,” the statement said."
  },
  {
    "headline": "Manufacturers Back CBN’s Ban of FX Sale to BDCs",
    "summarized_story": "“For instance, with the new policy, manufacturers will depend solely on the interbank market for their FX needs.\nWe hope the banks will provide a seamless process and timely execution of foreign exchange applications by manufacturers,” the association added.\nMost times their operations drift into round tripping and other financial incongruities that negate the overall objective of creating the BDC foreign exchange market.\nThey were countries whose central bank was selling forex to BDCs in the past and at some point they dropped the idea.\nThey, however, observed that channeling the supply of foreign exchange through the commercial banks without addressing its supply side might unintentionally trigger a boom in the black market for foreign exchange."
  },
  {
    "headline": "Petrol Climbs to 99.4% in NNPC’s Total Product Imports",
    "summarized_story": "Also, the quantity of petrol brought into country by the corporation climbed to 99.24 per cent in March this year.\n“This volume is made up of 1.782 billion litres of petrol and 0.45 million litres of diesel.\nTotal sale of white products for the period of March 2020 to March 2021 stood at 17.374 billion litres and petrol accounted for 17.265 billion litres or 99.37 per cent.\n“For the period of March 2020 to March 2021, a total of 2,911.62bcf of gas was produced, representing an average daily production of 7,409.60mmscfd during the period.\n“Waiting to read the reasons for the appeal; Eni confirms its total extraneousness to the contested facts,” a spokesperson said."
  },
  {
    "headline": "Onyeagwu: Africa is the New Frontier for Global Growth",
    "summarized_story": "The Zenith Bank boss delivered his keynote address after the special keynote address by the President of Ghana, Nana Akufo-Addo, who was the Special Guest of Honour.\nCiting the immense opportunities in Africa that represent, including the enormous investment proposition for discerning investors huge population, large market and active labour force, and the rich natural endowment, Onyeagwu described Africa as, “the new frontier” for global growth.\nHe made a case for increased impact investment in Africa, noting that investment opportunities on the continent cut across agriculture, healthcare, housing, infrastructure, electricity, and the creative sectors.\nIn addition, he noted that as a socially responsible organisation, Zenith Bank continues to promote impact investment in Africa.\nThe Zenith Bank boss implored the rest of the world to look at Africa as an investment destination that guarantees optimal returns."
  },
  {
    "headline": "Adamawa Court Remands Youth Leader In Prison For Calling Buhari, SGF 'Useless' Over Insecurity",
    "summarized_story": "Muhammadu BuhariIn a viral video, the youth leader, who hails from the same local council as the SGF called out the latter and Buhari for failing to secure the lives of residents.\nHe labelled the SGF “a disappointment and a failure” just as he described the two leaders as “useless men” in power.\nHowever, a group, Adamawa Concerned Citizens, led by Hussain Gambo, a supporter of the SGF, dragged Kato before the magistrates' court, Punch reports.\nThe group’s leadership said it took the decision to serve as a deterrent to those using social media to slander responsible Nigerians.\nThe Chief Magistrate, Gwama, who took the plea of the accused, ordered him to be remanded in prison till August 2."
  },
  {
    "headline": "Adamawa Court Remands Youth Leader In Prison For Calling Buhari, SGF 'Useless' Over Insecurity",
    "summarized_story": "Muhammadu BuhariIn a viral video, the youth leader, who hails from the same local council as the SGF called out the latter and Buhari for failing to secure the lives of residents.\nHe labelled the SGF “a disappointment and a failure” just as he described the two leaders as “useless men” in power.\nHowever, a group, Adamawa Concerned Citizens, led by Hussain Gambo, a supporter of the SGF, dragged Kato before the magistrates' court, Punch reports.\nThe group’s leadership said it took the decision to serve as a deterrent to those using social media to slander responsible Nigerians.\nThe Chief Magistrate, Gwama, who took the plea of the accused, ordered him to be remanded in prison till August 2."
  },
  {
    "headline": "REVEALED: Identity Of Zamfara Terror Kingpin Who Downed Nigerian Air Force Jet",
    "summarized_story": "A notorious terror kingpin operating around the Dansadau axis of the vast Kuyambana Forest, Ali Kachalla, is the one responsible for the recent shooting down of a Nigeria Air Force (NAF) Alpha Jet, Daily Trust reports.\nThe fighter jet was brought down by men of Kachalla’s gang near Kabaru village, located some 15 km west of Dansadau town.\nKachalla’s current base is located along the bank of a river called River Goron Dutse, which is about 25 km south of Dansadau town.\nGoron Dutse River is situated across the Kaduna – Zamfara boundary, with parts of it in Kaduna State and the other part in Zamfara State.\nThe villages are all situated southeast of Dansadau town."
  },
  {
    "headline": "REVEALED: Identity Of Zamfara Terror Kingpin Who Downed Nigerian Air Force Jet",
    "summarized_story": "A notorious terror kingpin operating around the Dansadau axis of the vast Kuyambana Forest, Ali Kachalla, is the one responsible for the recent shooting down of a Nigeria Air Force (NAF) Alpha Jet, Daily Trust reports.\nThe fighter jet was brought down by men of Kachalla’s gang near Kabaru village, located some 15 km west of Dansadau town.\nKachalla’s current base is located along the bank of a river called River Goron Dutse, which is about 25 km south of Dansadau town.\nGoron Dutse River is situated across the Kaduna – Zamfara boundary, with parts of it in Kaduna State and the other part in Zamfara State.\nThe villages are all situated southeast of Dansadau town."
  },
  {
    "headline": "Your Turn To Produce President Will Come After Another Muslim Has Succeeded Buhari— Islamic Group Tells Christians",
    "summarized_story": "He explained that the group is not opposed to the idea of a Christian president for Nigeria, but noted that CAN must wait for its turn.\n“Chief Mathew Aremu Olusegun Obasanjo, a Christian, spent eight (8) years as president (1999 – 2007).\nBy simple arithmetic, this will bring the total spent by the two Muslim presidents to eleven (11) years.\nIt will be unfair to install a Christian president in 2023 when Muslims still have a shortfall of two or four years.\nCAN should also take a retrospective look at its attitude towards the incumbent since 2015 when a Christian president left the stage."
  },
  {
    "headline": "Report: 123 in Kano, 86 in Sokoto — how cholera killed over 400 people in July",
    "summarized_story": "In July 2021, cholera killed 441 people in Nigeria, according to a report by SB Morgan (SBM) Intelligence.\nAccording to the report, 12 states and the federal capital territory (FCT) recorded fatalities arising from cholera outbreak in July.\nAdvertisementAccording to the report, Kano state recorded the highest number of deaths with 123 fatalities, followed by Sokoto with 86 deaths, and FCT 53 deaths.\nOther states recorded: Plateau (21), Kebbi (1), Niger (10), Kogi (4), Bayelsa (25), Nasarawa (17), Kaduna (28), Bauchi (42), Jigawa (30), and Gombe (1).\nBauchi, Kano, Sokoto, and Zamfara are the most badly affected states with over 2,000 cases."
  },
  {
    "headline": "Report: 123 in Kano, 86 in Sokoto — how cholera killed over 400 people in July",
    "summarized_story": "In July 2021, cholera killed 441 people in Nigeria, according to a report by SB Morgan (SBM) Intelligence.\nAccording to the report, 12 states and the federal capital territory (FCT) recorded fatalities arising from cholera outbreak in July.\nAdvertisementAccording to the report, Kano state recorded the highest number of deaths with 123 fatalities, followed by Sokoto with 86 deaths, and FCT 53 deaths.\nOther states recorded: Plateau (21), Kebbi (1), Niger (10), Kogi (4), Bayelsa (25), Nasarawa (17), Kaduna (28), Bauchi (42), Jigawa (30), and Gombe (1).\nBauchi, Kano, Sokoto, and Zamfara are the most badly affected states with over 2,000 cases."
  },
  {
    "headline": "DSS brings Igboho's supporters to court, bars journalists from covering trial",
    "summarized_story": "The Department of State Services (DSS) has brought some of the supporters of Sunday Igboho who were arrested in Oyo state to a federal high court in Abuja.\nThe DSS on July 1 raided Igboho’s residence in Oyo and arrested 12 of his supporters, who allegedly attacked the operatives during the raid.\nHowever, the DSS failed to produce the applicants in court on the date fixed.\nAt the court session on Monday, only eight of the applicants were brought to court.\nSpeaking to journalists immediately after the court session, Olajemgbese said the court has granted them leave to amend their processes."
  },
  {
    "headline": "DSS brings Igboho's supporters to court, bars journalists from covering trial",
    "summarized_story": "The Department of State Services (DSS) has brought some of the supporters of Sunday Igboho who were arrested in Oyo state to a federal high court in Abuja.\nThe DSS on July 1 raided Igboho’s residence in Oyo and arrested 12 of his supporters, who allegedly attacked the operatives during the raid.\nHowever, the DSS failed to produce the applicants in court on the date fixed.\nAt the court session on Monday, only eight of the applicants were brought to court.\nSpeaking to journalists immediately after the court session, Olajemgbese said the court has granted them leave to amend their processes."
  },
  {
    "headline": "Igboho's request for asylum in Benin Republic will be decided this week, says lawyer",
    "summarized_story": "The asylum request made by Sunday Igboho, Yoruba nation agitator, will be decided this week by authorities of Benin Republic.\nTwo persons were killed by the DSS in the raid while 12 others were arrested and whisked to Abuja.\nAdvertisementHis lawyers said they delayed application for his bail pending the outcome of the asylum request, noting that they are desperate to ensure that he is not sent back to Nigeria.\nOlasupo Ojo, one of the lawyers, said though there had not been an official statement from Benin Republic government on the asylum request, there is hope that a position will be made known this week.\nHe told the Punch that, “no official position on the asylum request but we are expecting feedback this week”."
  },
  {
    "headline": "The dawn of Ghana’s tech ecosystem: Here’s what you should know",
    "summarized_story": "Here’s what you should know about Ghana’s tech ecosystem, beyond cliches.\n“We are seeing more Ghanaian tech talents being headhunted by global companies.\n“When Impact Hub Accra started, we were pretty much the only Hub in town,” Kelechi Ofoegbu, COO Impact Hub Accra, said.\nA number of established Ghanaian tech companies like Hubtel, Farmerline, Sayetech, Green Afro-Palms began in Kumasi.\nJorge Appiah, who is also the CEO of SolarTaxi, believes the Ghanaian tech ecosystem is in its early days."
  },
  {
    "headline": "Here’s why Nigeria’s central bank is banning forex sales to money changers",
    "summarized_story": "Nigeria’s Central Bank (CBN) has stopped the sale of foreign exchange (FX) to Bureau De Change (BDC) operators in the country.\nHowever, Emefiele said the MPC noted that the money changers had become wholesale dealers and illegally traded FX to the tune of millions of dollars per transaction.\nThe apex bank also accused BDC operators of speculative, rent-seeking behaviour and involvement in money laundering activities.\nSome have praised the CBN for ending the “mindless sales” of foreign currency to BDC operators and an end to the reign of traders.\nHowever, there are concerns that thousands of Nigerians working at the 3,000+ BDC operators in the country will be thrown into the already large unemployment pool as a result of the ban."
  },
  {
    "headline": "Ato Bentsi-Enchill is helping African startups raise capital and protecting them from difficult investors",
    "summarized_story": "To understand how Ato Bentsi-Enchill started investing in startups, let’s rewind to 2014.\nBut while in the US, I had attended many Africa-focused business conferences at business schools at Harvard, MIT, Wharton, Stanford and NYU.\nOnce I can understand your business model, I can raise money for you or invest.\nFor example with InstantRad, outside of helping them engage investors, I do a lot of business development work for them.\nI also help companies build a path to exit; It’s something a lot of people don’t understand."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has..."
  },
  {
    "headline": "Nigerian fintech, Kuda Bank closes $55 million Series B to expand into other African countries",
    "summarized_story": "Share this article:Self-styled, “Bank of the Free,” Nigerian fintech startup, Kuda Bank has raised $55 million in Series B funding as it looks to expand into other African countries.\nThe funding was made at a $500 million evaluation and comes after raising a $25 million Series A in March 2021 and a $10 million seed round in November 2020.\nWith a $1.6 million pre-seed raise in September 2019 and a $15,000 pre-seed in 2018, its total raise comes to $91.6 million.\nIncorporated in 2018 as Kudimoney, the company changed its name to Kuda just before its $1.6 million raise in 2019.\nAlthough he does not state the countries where Kuda would launch, he hints that its latest product, the Kuda Bank Overdraft is a sign of things to come."
  },
  {
    "headline": "Nigeria’s eNaira, Bundle’s new CEO, Celebrating Friendship and System Administrators, Twitter’s bias challenge",
    "summarized_story": "So, while Nigeria’s decision is shaping up to be a good move, many of our earlier questions remain unanswered.\nJuly 30, 2021, is International Day of Friendship and to celebrate, we looked at how social media and tech enhance communication among friends.\nYou can watch here: Techpoint Africa celebrates International Day of Friendship 2021Did you know that System Administrators Appreciation Day is celebrated on the last Friday in July?\nLike the International Day of Friendship, this year, it was celebrated on July 30.\nSystem administrators troubleshoot all day, every day, trying their best to keep the organisation from burning down while maintaining a semblance of calm."
  },
  {
    "headline": "Airtel Africa receives $200 million to invest in network and sales infrastructure",
    "summarized_story": "It had also gotten a $100m investment from Mastercard in Airtel Mobile Commerce BV (AMC BV) in April.\nAirtel Africa says that QIA will hold a minority stake in the company while it retains the majority.\nComparing revenue from Q1 2020 with Q1 2021, Airtel saw a significant increase in revenue at $1.03b, dwarfing Q1 2020’s revenue of $899m by 21.7%.\nIts mobile money customer base went from 18.3 million in Q1 2020 to 21.7 million in Q1 2021, an 18.5% increase.\nHe also believes that the Sovereign Wealth Fund’s investment in Airtel Africa will contribute to sub-Saharan Africa’s financial inclusion."
  },
  {
    "headline": "These five apps get you started on foreign assets investment",
    "summarized_story": "These five apps get you started on foreign assets investmentThe value of the naira dropped to a record low against the dollar and other foreign currencies, after the Central Bank of Nigeria (CBN)’s decision to stop the sale of dollars directly to Bureau de Change (BDC) operators.\nHenceforth, the apex bank plans to deal only with commercial banks who in turn will sell to…"
  },
  {
    "headline": "Nigeria’s idle gas projects can leverage $53trn fund",
    "summarized_story": "In a world where funding for fossil fuel investment is waning, global Environmental Social and Governance (ESG) fund projected to hit $53 trillion by 2025 can present a system of autarky for over billion dollars’ worth of idle clean energy projects stranded across Nigeria.\nAcross the world, investors are now shifting attention from traditional funds…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Office space demand drops to 5-year low",
    "summarized_story": "Prime office space suppliers are not having it easy as they struggle to retain occupancy and seek strategies to get new tenants.\nThis transaction, which differs significantly from about 1000sqm pre-Covid-19 market demand, mirrors the current size of requirements in a market still smarting from the effects of social and physical distancing rules.\nFoot traffic at office buildings fell under 30 percent within this period, according to a H1: 2021 office market viewpoint by Broll Properties Nigeria.\nUnderstandably, limited demand is coming from the tech sector, which used to be a major source of demand for office space.\nThe unintended consequences of Twitter ban are taking a toll on the office market."
  },
  {
    "headline": "Edo govt praises Olympics-100m finalist, Enoch Adegoke – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has praised the outstanding performance of Olympics 100m athlete, Enoch Adegoke, who took part in the final 100m track event in the 2020 Tokyo Olympic games.\nEdo State Deputy Governor, Rt.\nHe said despite the outcome of the race in the final, the Edo State Government will give Adegoke a red-carpet reception when he returns to the country as he is a worthy ambassador of Edo State.\nShaibu said, “Edo people are very proud of the performance of Enoch Adegoke.\nWe are proud of Enoch Adegoke who made us proud in Tokyo following his outstanding performance in the race until the muscle pull stole the show from him in the final of the 100m mens final,” he added."
  },
  {
    "headline": "Obaseki harps on collaboration with Judiciary, NAPTIP to secure conviction of traffickers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said the state government is collaborating with the judiciary and the National Agency for the Prohibition of Trafficking in Persons (NAPTIP), to ensure conviction of traffickers.\nAccording to him, convicting the perpetrators and liquidating their assets will serve as a deterrent to others who are still scouting for vulnerable Nigerians to traffic.\nNot because the prosecutors are not doing their utmost best, but because of the very nature of our legal system.\n“We are working very hard with the High Courts and NAPTIP to ensure that we get convictions.\nObaseki added: “We will work with the judiciary to try and reduce the long adjournments and also the way they treat evidence from victims."
  },
  {
    "headline": "Edo Chief of Staff, Iyoha tasks AAU alumni on Edo’s devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Chief of Staff to Edo State Governor, Osaigbovo Iyoha, has enjoined the alumni of Ambrose Ali University (AAU) and other stakeholders to contribute to the development of the state.\nIyoha noted: “AAU has produced great personalities in government.\nEarlier, the Chairman of AAU Alumni Association, Benin Branch, Hon.\nOgbejiele Fidelix, congratulated Iyoha on his well-deserved appointment as Chief of Staff.\n“Your choice as Chief of Staff is an eloquent testimony of your contribution to the service of humanity."
  },
  {
    "headline": "Edo community applauds revocation of C-of-O of 18-hectare land purportedly belonging to Ize-Iyamu – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The indigenes of Amagba Community in Oredo Local Government Area (LGA) of Edo State have commended the revocation of the title to a land measuring 18 hectares in their community purportedly belonging to Osagie Ize-Iyamu by the state governor, Mr. Godwin Obaseki.\nIn a statement signed by the Odionwere of Amagba, Hon.\nJoseph Iduoriyekemwen J.P., Elder Victor Aigbe, Elder O. Igbinidu, Monday Iduoriyekemwen and Elder John Eware, the community said the land was dubiously taken from the community some time ago by Ize-Iyamu.\n“The people of Amagba also acknowledge the numerous developmental projects embarked upon by the Governor in our community, including the over 15km Ugbor-Amagba Road, which has since been completed, as well as several other adjoining roads that have been constructed.\nWe, once more, reaffirm our unflinching support for the Governor for his interest in the development of Amagba Community and appeal that these efforts be sustained.”..."
  },
  {
    "headline": "Nigeria receives 4.8 million doses of vaccine from U.S.",
    "summarized_story": "ADVERTISEMENTThe Nigerian government on Monday received four million and eighty doses of the Moderna COVID-19 vaccine donated by the Biden-Harris administration of the United States of America.\nThe vaccines, which were delivered through the COVAX facility, a vaccine alliance aimed at ensuring equitable distribution of vaccines globally, had earlier arrived in Abuja, Nigeria’s capital city, around 2:15 a.m. on Sunday.\nThe vaccines were received and stored at the country’s National Strategic Cold Store near the Nnamdi Azikiwe International Airport in Abuja.\nThe President of the United States, Joe Biden, had in May, pledged to share 80 million vaccines produced in the U.S with countries around the world to protect the most vulnerable and stem transmission of the coronavirus.\nOf these 80 million, Africa is expected to receive 25 million, with the first shipments to Burkina Faso, Djibouti, and Ethiopia which had already been delivered."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Fintech startup, Kuda Bank raises $55m Series B round at $500m valuation",
    "summarized_story": "Nigerian fintech startup, Kuda Bank has raised $55 million in a Series B round at a valuation of $500 million, months after raising a $25 million Series A round.\nThe funding round was co-led by existing investors Target Global and Valar Ventures, the firm co-founded and backed by PayPal co-founder, Peter Thiel, SBI Investment and a number of previous angels also participated.\nThe new funding round will be used to double down not just on new services for Nigeria, but to prepare its launch into more countries on the continent.\nBut now we are doubling down on the expansion and the idea is to build a strong team for the expansion plans for Kuda,” Babs Ogundeyi CEO of Kuda told TechCrunch.\n“We still see Nigeria as an important market and don’t want to be distracted so don’t want to disrupt those operations too much."
  },
  {
    "headline": "Ibrahim fumes as AMCON takes over RE-INSURANCE Corp",
    "summarized_story": "BY EMEKA EJEREThe takeover of the major interests in NICON Insurance Limited and the Nigeria Reinsurance Corporation (Nigeria Re) by the Asset Management Corporation of Nigeria (AMCON) as announced by the corporation is rattling billionaire businessman, Jimoh Ibrahim.\nLast year, AMCON had said the development followed a court order granting it the power to take over the assets.\nIn February, a federal high court in Abuja set aside the order granting AMCON permission to take over assets belonging to Ibrahim.\nAMCON listed members of the new board of NICON Insurance as Lamis Shehu Dikko, chairman; Henry Uko Ationu, managing director/chief executive officer and John Abuh Oyidih, executive director, finance & administration.\nOgbonna Esq, prayed for an interim order to set down the instant suit for accelerated hearing."
  },
  {
    "headline": "Zenith Bank MD, Onyeagwu seeks impact investment for Africa’s development at global summit",
    "summarized_story": "Mr. Ebenezer Onyeagwu, the Group Managing Director/Chief Executive of Zenith Bank, has called for increased impact investing in Africa for the continent to attain its full potential.\nDelivering the keynote address with the theme “Leveraging Impact Investment Opportunities for Growth in Africa”, Onyeagwu described impact investing as an investment that yields optimal returns for investors, value for all stakeholders, and guarantees continued sustenance and existence of humanity.\nHe made a case for increased impact investment in Africa, noting that investment opportunities on the continent cut across agriculture, healthcare, housing, infrastructure, electricity, and the creative sectors.\nOnyeagwu also noted that as a socially responsible organisation, Zenith Bank continues to promote impact investment in Africa.\nOnyeagwu implored the rest of the world to look at Africa as an investment destination that guarantees optimal returns."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "DSS Produces 8 Igboho’s Aides In Court",
    "summarized_story": "The Department of State Services (DSS), on Monday, produced eight out of the 12 aides of Yoruba nation agitator, Chief Sunday Adeyemo, popularly known as Sunday Igboho, at a Federal High Court in Abuja before Justice Obiora Egwuatu.\nLast week, the court had ordered the DSS to produce them after their counsels approached the court for the enforcement of their fundamental human rights.\nWhen the matter came up at the last adjourned date before the trial judge, the DSS’ lawyer had stated that some of the names on the court order were different from the names of the persons they had arrested on July 1, 2021 at Igboho’s residence in Ibadan during a dawn raid.\nADVERTISEMENTHe also told the court that apart from the second, fourth and twelfth applicants, the identities of the rest of the applicants on the court’s order do not have the persons bearing those names.\nDetails Later…"
  },
  {
    "headline": "DSS Produces 8 Igboho’s Aides In Court",
    "summarized_story": "The Department of State Services (DSS), on Monday, produced eight out of the 12 aides of Yoruba nation agitator, Chief Sunday Adeyemo, popularly known as Sunday Igboho, at a Federal High Court in Abuja before Justice Obiora Egwuatu.\nLast week, the court had ordered the DSS to produce them after their counsels approached the court for the enforcement of their fundamental human rights.\nWhen the matter came up at the last adjourned date before the trial judge, the DSS’ lawyer had stated that some of the names on the court order were different from the names of the persons they had arrested on July 1, 2021 at Igboho’s residence in Ibadan during a dawn raid.\nADVERTISEMENTHe also told the court that apart from the second, fourth and twelfth applicants, the identities of the rest of the applicants on the court’s order do not have the persons bearing those names.\nDetails Later…"
  },
  {
    "headline": "Police Arrest 6 Suspected Kidnappers In Imo",
    "summarized_story": "The Imo State Police Command said six suspects have been arrested for various crimes such as kidnapping and armed robbery.\nADVERTISEMENTThe PPRO stated that after a serious gun battle, the suspect sustained bullet injury on his leg.\n“The suspect was later transferred to the State command’s Anti-kidnapping unit, on 27/7/2021 at about 0830 hours, for detailed investigation.\nHe highlighted that while proceeding to the station, three of the suspects attempted escaping but were demobilised and rearrested.\nThe Police spokesperson added that the Commissioner of Police, Imo State Command, CP Abutu Yaro, commended the officers and men of the Command for their proactiveness in nipping violent crimes in the bud."
  },
  {
    "headline": "Police Arrest 6 Suspected Kidnappers In Imo",
    "summarized_story": "The Imo State Police Command said six suspects have been arrested for various crimes such as kidnapping and armed robbery.\nADVERTISEMENTThe PPRO stated that after a serious gun battle, the suspect sustained bullet injury on his leg.\n“The suspect was later transferred to the State command’s Anti-kidnapping unit, on 27/7/2021 at about 0830 hours, for detailed investigation.\nHe highlighted that while proceeding to the station, three of the suspects attempted escaping but were demobilised and rearrested.\nThe Police spokesperson added that the Commissioner of Police, Imo State Command, CP Abutu Yaro, commended the officers and men of the Command for their proactiveness in nipping violent crimes in the bud."
  },
  {
    "headline": "How Hushpuppi Landed In Trouble – Mompha",
    "summarized_story": "Mompha, has explained how the ‘stubbornness’ of his embattled friend, Abbas Ramon popularly known as Hushpuppi got the latter into trouble.\nMompha said this during an Instagram Live with broadcaster, Daddy freeze over the weekend.\nMompha said: “What fucked him (Hushpuppi) up was that he didn’t listen to me.\nHe is stubborn hence his arrest and trial in the U.S.“People will accuse you wrongly, what about me that brought Hushpuppi from Malaysia?\nAnd it’s not my fault that I come from a rich home, I have even hustled all my life."
  },
  {
    "headline": "Opinion: On Rising Unemployment and Poverty in Nigeria – By DANIEL IGHAKPE",
    "summarized_story": "Unemployment and poverty are two of the major issues currently affecting Nigeria’s economy and its society.\nThis places Nigeria in the number three position among countries with the highest number of unemployed people in the world!\nThis trend of unemployment and poverty is projected to worsen, as the World Data Lab noted that the outlook for poverty alleviation in Nigeria is weak, and that an estimated 120 million Nigerians are expected to slip into extreme poverty by 2030.\nWhat could help to improve this situation of rising unemployment and poverty in Nigeria?\nA revival of the agricultural sector in Nigeria is one suggestion that has been put forth."
  },
  {
    "headline": "Opinion: On Rising Unemployment and Poverty in Nigeria – By DANIEL IGHAKPE",
    "summarized_story": "Unemployment and poverty are two of the major issues currently affecting Nigeria’s economy and its society.\nThis places Nigeria in the number three position among countries with the highest number of unemployed people in the world!\nThis trend of unemployment and poverty is projected to worsen, as the World Data Lab noted that the outlook for poverty alleviation in Nigeria is weak, and that an estimated 120 million Nigerians are expected to slip into extreme poverty by 2030.\nWhat could help to improve this situation of rising unemployment and poverty in Nigeria?\nA revival of the agricultural sector in Nigeria is one suggestion that has been put forth."
  },
  {
    "headline": "2021 first half: Dangote Sugar records strong growth",
    "summarized_story": "During the period under review we launched our new packaging designs for the 50kg fortified and non-fortified sugar bags with the theme “Dangote Sugar has a new look….\nThe technical and agriculture support provided for them over time has led to the improved yield from our Outgrowers sugarcane farms at the Numan Sugar Estate.\nAchievement of the Dangote Sugar Backward Integration Projects targets, he added “remains our focus.\nWe are resolute and will continue in our quest to put Nigeria on the path of sugar self-sufficiency and on the world sugar map.”Dangote Sugar Refinery is Nigeria’s largest producer of household and commercial sugar with 1.44M MT refining capacity at the same location.\nThe Nasarawa Sugar Company Limited is the registered subsidiary of Dangote Sugar Refinery Plc."
  },
  {
    "headline": "2021 first half: Dangote Sugar records strong growth",
    "summarized_story": "During the period under review we launched our new packaging designs for the 50kg fortified and non-fortified sugar bags with the theme “Dangote Sugar has a new look….\nThe technical and agriculture support provided for them over time has led to the improved yield from our Outgrowers sugarcane farms at the Numan Sugar Estate.\nAchievement of the Dangote Sugar Backward Integration Projects targets, he added “remains our focus.\nWe are resolute and will continue in our quest to put Nigeria on the path of sugar self-sufficiency and on the world sugar map.”Dangote Sugar Refinery is Nigeria’s largest producer of household and commercial sugar with 1.44M MT refining capacity at the same location.\nThe Nasarawa Sugar Company Limited is the registered subsidiary of Dangote Sugar Refinery Plc."
  },
  {
    "headline": "JUST IN: Blessing Oborodudu guarantees Nigeria first medal at Tokyo 2020",
    "summarized_story": "By Kazeem UgbodagaNigeria’s Blessing Oborodudu will win Nigeria’s first Olympics medal at the ongoing Tokyo 2020 as she qualified for the final on Monday.\nThe Nigerian wrestler defeated Battsetseg Soronzonboldyn of Mongolia 7-2 to qualify for the final and guaranteed herself and Team Nigeria a medal.\nOborodudu will either win a silver or gold medal in the wrestling competition.\nOborodudu began wrestling at St Jude’s Girls Secondary School in Yenagoa, Nigeria.\nHer ambition is to win a gold medal at the 2020 Olympic Games in Tokyo."
  },
  {
    "headline": "Kiddwaya, DJ Cuppy fuel dating rumours in PDA photos",
    "summarized_story": "By Funmilola OlukomaiyaBig Brother Naija reality star, Terseer Waya, also known as Kiddwaya has shared new PDA photos featuring Florence Ifeoluwa Otedola aka DJ Cuppy.\nThe reality star took to his Instagram page to share the photos he took with the billionaire heiress before her DJ performance on Sunday at the Lux Afrique Polo Day in the United Kingdom.\nIn his post, he wrote: “Happily Unbothered 🌈”View this post on Instagram A post shared by Kidd (@kiddwaya)//www.instagram.com/embed.jsThe celebrity best friends have gotten social media users talking after Kiddwaya is seen kissing Cuppy on the cheek, in a public display of affection(PDA) in one of the photos.\nSome commenters suggest that they should take their friendship to a next level and start dating.\nKiddwaya in September 2020 hinted on having a more intimate relationship with the popular disc jockey."
  },
  {
    "headline": "All eyes on ASUU-FG meeting today",
    "summarized_story": "By AbankulaAll eyes are on the scheduled meeting today between the Federal Government and Academic Staff Union of Universities (ASUU), with Nigerians hoping the dialogue will avert another strike.\n“The Minister for Labour and Employment Dr. Chris Ngige will be hosting a meeting with ASUU.\nThe meeting is scheduled for Monday, August 2, 2021 at Minister’s Conference Room,” Akpan said.\n“The Ministry of Education, which is our ministry, has not called us to any meeting since we signed the Memorandum of Action.\n“Many of our members at the University of Jos have not been paid salaries from February 2020 till date."
  },
  {
    "headline": "You Cannot Insist On Due Process For Igboho, Kanu & Deny It To Abba Kyari – FFK",
    "summarized_story": "We have insisted on due process and the presentation of hard evidence before my friend and brother Sunday Igboho can be extradited from Cotonou to Nigeria.\nWe have condemned the illegal manner in which the Kenyan authorities kidnapped Nnamdi Kanu and returned him to Nigeria.\nThose that complain about us asking for due process & insisting on the presentation of hard evidence before a court of law before Abba Kyari can be extradicted to America are myopic and naive.\nYou cannot insist on due process for Igboho and Nnamdi Kanu & deny it to Abba Kyari.\nThe fact that Abba is a policeman or a northern Muslim does not mean we should feed him to the dogs."
  },
  {
    "headline": "Don’t Vote For PDP, APC Again; They Have Bad Antecedents — Jega Warns Nigerians",
    "summarized_story": "He claimed that the two major political parties were like Siamese twins, and that Nigerians needed to find a legitimate alternative.\n” Nigerians should dump the two parties because of their bad antecedents over the last 20 years.\nLooking at their inability to change the economic fortunes of Nigeria for 20 years now, it is now apparently clear that they would not do anything even if Nigerians vote for any of the two parties again,”he alleged.\nSpeaking in an interview with the BBC Hausa monitored by our correspondent in Kaduna, Jega explained that ” the bad things these parties committed in those past years, Nigerians should never give their trust to the parties again.\nIt is now very clear that these parties would never change, even if they are given another chance.”“The APC and PDP have formed governments, we were all witnesses."
  },
  {
    "headline": "BREAKING: Court Adjourns Igboho Aides’ Suit Till Aug 4",
    "summarized_story": "The petition filed by the 12 arrested aides of Sunday Adeyemo, also known as Sunday Igboho, was adjourned until August 4 by the Federal High Court in Abuja on Monday.\nJustice Egwuatu allowed Pelumi Olagbenjesi, the applicants’ lawyer, permission to change his processes in order to correct the applicants’ names.\nThe identities of the eight applicants produced in court caused some misunderstanding.\nAs a result, Olagbejensi applied to change the names of his processes.\nOnly eight of Sunday Igboho’s 12 detained aides were presented by the DSS."
  },
  {
    "headline": "2023: It’s Not Christians Turn To Become Nigeria’s President — MURIC",
    "summarized_story": "The group was responding to a recent statement by the Christian Association of Nigeria (CAN), in which the country’s largest Christian organization called for a Christian president by 2023.\n“Chief Mathew Aremu Olusegun Obasanjo, a Christian, spent eight (8) years as president (1999 – 2007).\n“Muslims will be shortchanged by two or four years if a Christian becomes president in 2023.\nIt will be unfair to install a Christian president in 2023 when Muslims still have a shortfall of two or four years.\nCAN should also take a retrospective look at its attitude towards the incumbent since 2015 when a Christian president left the stage."
  },
  {
    "headline": "Pictures: In Uyo, Players, officials, others celebrate as Akwa United win first ever NPFL title",
    "summarized_story": "PreviousBreaking: Celebration galore as Oborodudu opens 2020 Olympics medal blessings for team Nigeria in Tokyo"
  },
  {
    "headline": "Breaking: Celebration galore as Oborodudu opens 2020 Olympics medal blessings for team Nigeria in Tokyo",
    "summarized_story": "Top Nigerian wrestler Blessing Oborodudu a while ago on Monday won her 68kg semifinal bout against Mongolia’s Battsetseg Soronzonbold by 7-2.\nWith her victory, Nigeriais has now entered the medals table in the ongoing 2020 Olympic games in Tokyo, Japan.\nAlso, Oborodudu’s performance has seen her emerge as first ever Nigerian wrestler in an Olympic final.\nShe beat Azerbaijani Elis Manolova of Azerbaijan and Meerim Zhumanazarova of Kyrgyzstan to advance to her first Olympic semi finals.\nDetails loading…"
  },
  {
    "headline": "Breaking: Joy overflows as Blessing Oborodudu defeats another wrestling opponent, puts Nigeria on medals’ table in Tokyo (VIDEO)",
    "summarized_story": "NextBreaking: Celebration galore as Oborodudu opens 2020 Olympics medal blessings for team Nigeria in Tokyo"
  },
  {
    "headline": "FG Vs MNK: The FG’s Futile Propaganda/Media Trial and Recommendations of A Peace and Conflict Theorist -NigPilot",
    "summarized_story": "Nevertheless, the International responses and/or consequences of this latest blunder by the Buhari Government will surely be a Case Study for Researchers and Students of International Relations and International Law.\nJust as the Decisions of both Local and International Courts that will be involved, would have serious Implications on International Law Jurisprudence.\nThe Undeniable fact is that the Existential Battle before the Land and People of Eastern Nigeria is not about Mazi Nnamdi Kanu or his ways and manners.\nBut, you never know, as his life and mission on Earth, even as it concerns Eastern Nigeria/Biafra is in the hands of the Almighty God and must conform to the Dictates of the Almighty God’s Divine Order.\nAnd presently, whether anyone likes his Personality or Not, I wish to emphasize that MNK Represents the FACE of a Courageous Battle for the Total emancipation of Eastern Nigeria/Biafra, by his beleaguered Generation."
  },
  {
    "headline": "NAPTIP rescues over 17,000 victims of human trafficking -NigPilot",
    "summarized_story": "Speaking at the World Day against Human Trafficking, the Director-General, NAPTIP, Senator Basheer Garba Muhammed said the Agency has empowered a good number with no fewer than five victims employed at NAPTIP after seeing them through the university education.\nThe projects included, ” Strengthening Nigeria’s Criminal Justice Response to Trafficking in Persons and Smuggling of Migrants- PROMIS.” This particular project, according to NAPTIP is supported by the Netherlands.\nIt seeks to strengthen national capacities to prevent, investigate and prosecute TIP/ SOM cases in line with international human rights standards.\nThe second project was ” Strengthening Trans-Regional Action and Responses against the Smuggling of Migrants-STARCOM.” It is supported by Canada.\nMuhammed, however, appreciated the Development Partners, UNODC, IOM, and FIIAPP, for their unalloyed support for the age"
  },
  {
    "headline": "Paris Agreement: Nigeria submits 2021 final report to UN -NigPilot",
    "summarized_story": "Nigeria has on Friday, submitted its Nationally Determined Contribution, NDC, the final report of 2021 to the United Nations Framework Convention on Climate Change, UNFCCC.\nThe updated report, which was approved by President Muhammadu Buhari, replaced the interim NDC report that was submitted in May 2021.\nAbubakar said: “This submitted updated NDC communicated that Nigeria has raised its ambition by including emission reduction from the waste sector as a new sector in the NDC.\n“Nigeria’s has increased its conditional contribution from 45% to 47% while retaining the unconditional target of 20%.\n“Hence the updated NDC has an unconditional target of 20% below business as usual by 2030 and 47% conditional contribution on international support.”"
  },
  {
    "headline": "There will be peace in Nigeria after 2020 pilgrimage- Pam -NigPilot",
    "summarized_story": "Executive Secretary, Nigeria Christian Pilgrim Commission, NCPC, Rev Yakubu Pam has expressed optimism that the 2020 Pilgrimage exercise would restore peace in Nigeria.\nThe Prayer Congress was the first to be held in Jordan for the 2020 Pilgrimage exercise.\nIn his welcome address, the Executive Secretary of the Nigeria Christian Pilgrim Commission, Rev Yakubu Pam expressed his profound gratitude to the Jordanian authority.\nPam further commended the Jordanian government for opening their doors to Nigerian Pilgrims at a “perilous time like this”.\nYabo appreciated the dynamic and pragmatic leadership of the NCPC boss for making sure that the Jordan Pilgrimage became a reality."
  },
  {
    "headline": "Tokyo 2020: Nigeria Guaranteed Medal As Oborodudu Reaches Wrestling Final",
    "summarized_story": "Nigeria on Monday was guaranteed its first medal at the Tokyo Olympics after Blessing Oborodudu won her women’s freestyle 68kg wrestling semi-final match.\nAlthough the final match is yet to be played, she is now guaranteed either a gold or silver medal.\n“This is a real Blessing to Nigeria,” the Minister of Sports Sunday Dare said, reacting to Oborududu’s feat.\nDon’t give up the fight until you re-write Nigerian Olympics history with a gold medal in the kitty.”Nigerian athletes have struggled to make a mark at the Tokyo Olympics amid failed drug tests and injuries.\nEarlier on Monday, medal hopeful Tobi Amusan had finished fourth in the women’s 100m hurdles final."
  },
  {
    "headline": "Nigeria Takes Delivery Of Over Four Million Moderna Vaccine Doses",
    "summarized_story": "The Federal Government on Monday took delivery of another tranche of COVID-19 vaccine doses.\nThe latest tranche, over four million doses of the Moderna vaccine, was donated by the US government.\nNigeria had earlier kicked off its COVID-19 vaccination program in April after receiving 3.9 million doses of the AstraZeneca vaccine from the COVAX initiative.\nCovax was set up to ensure the equitable distribution of vaccines, particularly to low-income countries, and has already delivered more than 80 million doses to 129 territories.\nThe Moderna vaccines, which were approved by NAFDAC in July, are expected to boost the country’s vaccination programme."
  },
  {
    "headline": "DSS Produces Eight Out Of 12 Sunday Igboho’s Aides In Court",
    "summarized_story": "A lawyer to the arrested aides, Pelumi Olajengbesi, sued the DSS, claiming that his clients have remained underground for weeks.\nRuling on the suit, Justice Obiora Egwuatu had ordered the DSS to produce the 12 aides on July 29.\nHowever only eight out of the 12 aides paraded on July 1 made it to court on Monday.\nLawyer to the aides, Mr Olajengbesi, asked the court to mandate the DSS to produce the last four aides in court at the next date of the hearing..\nAfter the DSS raid on his home, Mr Igboho fled to Benin Republic and is presently in court fighting an extradition back to Nigeria."
  },
  {
    "headline": "Nigeria Records 407 New COVID-19 Cases As Resident Doctors Resume Strike",
    "summarized_story": "Nigeria has recorded fresh 407 COVID-19 cases as resident doctors across the country resumed an indefinite, nationwide strike.\nAccording to data from the Nigeria Centre for Disease Control (NCDC), the new cases were recorded on Sunday.\nNigeria has seen a recent uptick in new cases as fears of a third wave, triggered by the Delta variant, loomsThe Delta variant is believed to be deadlier and more contagious.\nCOVID-19 figuresTill date, Nigeria has recorded 174,315 COVID-19 cases, according to official statistics.\nThe doctors had embarked on an earlier strike in April, leaving many patients unattended across government-owned hospitals in the country."
  },
  {
    "headline": "Canada Stun USA To Reach Olympic Women’s Football Final",
    "summarized_story": "Jessie Fleming scored a second-half penalty as Canada upset four-time Olympic women’s football champions the United States 1-0 in Kashima on Monday to reach the final for the first time.\nFleming’s 74th-minute spot-kick earned Canada a first win over their neighbours since 2001 and set up a clash with Sweden or Australia for the gold medal.\nThe world champions will face the losers of Monday’s second semi-final for the consolation of a bronze medal.\nThe US and Canada combined for seven goals the last time they met at the Olympics, a memorable 4-3 semi-final win for the US after extra time at Old Trafford in 2012.\nThe US had advanced to every Olympic final aside from Rio 2016, where they lost to Sweden on penalties in the last eight."
  },
  {
    "headline": "#Endsars: Lagos judicial panel of inquiry amends rules of proceedings",
    "summarized_story": "The Lagos state judicial panel of inquiry for restitution for SARS-related abuses has amended its rules in order to expedite hearings and increase the likelihood of concluding all pending petitions before the end of its mandate on October 19.\nAccording to the panel’s Secretariat, petitioners must immediately front-load all pending petitions (those have yet to be opened) and convert all petitions to a legally sworn Affidavit.\nThe rules take effect from the 2nd Day of August 2021.\nAdvertisementIn July, the State Government extended the Panel’s term for another three months, the second time since it was established on October 19, citing the hundreds of petitions that had yet to be heard.\nOther issues, including as the disputed shooting at the Lekki tollgate on October 20, 2020, where demonstrators had congregated, have yet to be resolved."
  },
  {
    "headline": "8 Aides of Sunday Adeyemo arrive Federal High Court Abuja",
    "summarized_story": "Aides of Yoruba Nation Agitator, Sunday Adeyemo also Known as Sunday Igboho have arrived the Federal High Court, Abuja.\nThe Department of State Security service brought them to the court with armed guards this morning in Abuja.\nAt the last adjourned date Justice Obiora Egwuatu had reemphasized his order given on 23rd July directing the respondent produce the applicants in court on 2nd August.\nThe Department of State Services (DSS) had on 1st July raided the residence of Mr Igboho, allegedly killing two people and arresting 12 of his aides."
  },
  {
    "headline": "Ganduje, Okorocha, Fashola, Others To Discuss Sustainability Of Nigeria",
    "summarized_story": "Those slated to discuss this at a one-day conference in Abuja the nations’ capital are Kano state governor, Dr. Abdullahi Umar Ganduje, the former governor of Imo state, Senator Rochas Okorocha, incumbent Minister of Works and Housing, Mr. Raji Fashola (SAN), Senator Peter Nwaboshi, Minister of State Federal Capital Territory, Hajia (Dr.) Ramatu Tijjani -Aliyu and Senator Opeyemi Bamidele.\nThe public lecture series is aimed at contributing to the intellectual development of the nation’s democracy.\nJames Faleke, Director General of the Voice of Nigeria (VON) Mr. Osita Okechukwu, Director General of the Progressive Governors Forum (PGF) Salihu Moh Lukman, among others.\nAdvertisement“In discussing Nigeria’s diversity, we believe that Governor Ganduje has a lot of experience to share with Nigerians.\nIn addition, Dr. Ganduje’s networks of closed friends and associates are mostly from the South-east and South-south.” The statement said."
  },
  {
    "headline": "Medal Guaranteed!: Nigeria’s Oborududu Qualifies for Olympics Women’s Wrestling Final",
    "summarized_story": "Nigeria’s Blessing Oborududu has advanced into the Final of the women’s freestyle wrestling event at the ongoing Tokyo 2020 Olympics and is guaranteed either a silver or gold medal at the games.\nThe Bayelsa born wrestler seamlessly floored Mongolia’s Battsetseg Soronzonbold 7-2 in the semi-finals of the women’s 68kg freestyle.\nShe had defeated Azerbaijani’s Elis Manolova and Meerim Zhumanazarova of Kyrgyzstan to advance to her first Olympic semi-finals, before defeating Soronzonbold.\nShe will now compete in the Gold medal match on Tuesday against America’s Tamyra Mensah-Stock and becomes the first Nigerian to ever reach the final of a wrestling event in the Olympics.\nBy Abel Ejikeme"
  },
  {
    "headline": "Mike Ozekhome on the Trial of Seccesion Agitators, Abba Kyari’s FBI Indictment and Legality of APC Congresses – Arise News",
    "summarized_story": "Senior Advocate of Nigeria Mike Ozekhome joined The Morning Show on Monday to dissect topical national issues from a legal perspective.\nThese include the just concluded All Progressives Congress National Ward Congresses held at the weekend, to the court proceedings, revelations and twists in the trials of Nnamdi Kanu, Sunday Igboho, El-Zakzaky as well as Ramon Abass, popularly called Hushpuppi, with its attendant implications for celebrated Nigerian cop Abba Kyari.\nWatch the interview for more…"
  },
  {
    "headline": "Nigeria: APC Nationwide Ward Congresses ‘Null and Void,’ Senior Lawyer Ozekhome Says",
    "summarized_story": "There are concerns that the just concluded ward congresses of Nigeria’s ruling All Progressives Congress (APC) will be an exercise in futility given the split decision of the Supreme Court faulting the Governor Mai Mala Buni-led national executive.\nMike Ozekhome, a Senior Advocate of Nigeria told ARISE News in an interview on Monday that actions done and authenticated by Buni could be declared null and void if challenged in a competent court.\nWatch the interview."
  },
  {
    "headline": "Misery For Children in Madagascar as Country Faces Worst Hunger Situation in Two Generations",
    "summarized_story": "Madagascar is facing her worst hunger situation in two generations with children wasting away and families in the South teetering on the brink of starvation, Save the Children has said.\nMadagascar is currently facing its worst drought in 40 years, caused by years of failed rains, and intensified by a series of sandstorms and locust attacks.\nOne in six children under five are now suffering from acute malnutrition, with numbers rising to one in four children in the six most affected districts.\nThe organisation will focus on ensuring children and their families have access to nutritious food and to child protection.\nWithout urgent action, the world could see tens of thousands of children starving to death, reversing decades of progress."
  },
  {
    "headline": "Abba Kyarl’s FBI Indicttment an Extradictable Offence: Mike Ozekhome",
    "summarized_story": "A Senior Advocate of Nigeria, Mike Ozekhome, has said the alledged offence of indicted cop Abba Kyari is one that can see him extradited to the United States of America.\nMr Ozekhome stated this on Monday when he featured on an ARISE News programme, The Morning Show.\nHe mentioned extraditable offences to include money laundering, advance fee fraud, treason and any other serious offences.\nARISE News had reported how a US court ordered the arrest of Kyari, a celebrated Nigerian cop for his role in a multi-million dollar fraud executed by cyber fraudster Ramon Abbas, also known as Hushpuppi.\nBy Abel Ejikeme"
  }
]