[
  {
    "headline": "BREAKING: Atiku announces Okowa as running mate",
    "summarized_story": "The Presidential candidate of the Peoples Democratic Party, Atiku Abubakar, has announced Governor Ifeanyi Okowa of Delta State as his running mate in the 2023 presidential election.\nAbubakar posted, “I am delighted to announce Governor Ifeanyi A. Okowa as my Vice Presidential candidate.\nThe PUNCH had reported that Okowa and two other PDP top members would be screened today as the party searches for a running mate for its presidential candidate, Atiku Abubakar.\nApart from Okowa, others reportedly shortlisted are Rivers State counterpart, Nyesom Wike and the Akwa Ibom State Governor, Udom Emmanuel.\nHe also run as the PDP presidential candidate in 2019 but lost to President Buhari of APC."
  },
  {
    "headline": "Mines Minister, Adegbite woos investors with huge gold, lead-zinc, iron-ore deposits",
    "summarized_story": "Says geoscience information readily availableGreenfields, Brownfields set to unveil investment opportunitiesBy Gabriel Ewepu – AbujaIn a bid to bounce the economy back, the Minister of Mines and Steel Development, Arc Olamilekan Adegbite, Thursday, wooed investors abroad with huge gold, lead-zinc, iron-ore and barite deposits in Nigeria.\n“Target minerals under the first phase include Gold, Lead-Zinc, Iron Ore, and the Battery Minerals, among others.\n“These include Thor Exploration Limited’s Segilola Gold Mine Project, in Osun State, which has an initial production capacity of 80,000 ounces of gold annually, representing the first large-scale Gold Mine in Nigeria.In June last year, we commissioned the Dukia Gold & Precious Metals Refinery (DGPMR) Project.\nIts potential impact on the gold sector is nothing short of revolutionary.\n“From the revenue drive perspective, the Nigerian Mining Sector has demonstrated a marked improvement despite the challenges of the pandemic."
  },
  {
    "headline": "Ekiti 2022: Masked men arresting my supporters, Segun Oni cries out",
    "summarized_story": "By Biodun BusariFormer Governor of Ekiti State, Segun Oni has said some masked people are unleashing terror and arrests on his supporters ahead of the governorship election in the state slated for Saturday.\nHe disclosed that some people close to the Presidency are behind the dastardly act, using their influence to launch undeserved arrests and oppression on his supporters.\nThe ex-governor then made an appeal to the Inspector-General of Police, IGP, Usman Alkali Baba to check the arrests and protect the people of Ekiti State who have a civic duty of voting on Saturday.\nThis includes the deployment of selected seasoned strategic commanders from the rank of Assistant Commissioner of Police and above for effective supervision of security personnel and operations in the election.\nIs it money, I’m the type that cannot be easily moved by money; Is it that he (Asiwaju) wants to make me his VP, which is not possible?”"
  },
  {
    "headline": "My mission in Rivers State, Ugo Beke, APGA candidate",
    "summarized_story": "Ugo BekeBy Jeremiah UrowayinoGovernorship candidate of All Progressives Grand Alliance, APGA, Prince Ugo Beke, has said he would focus on human capacity building and resource management as governor.\nHe particularly pledged to build oil and gas cities in riverine communities to provide a sustainable economy for those in riverine areas.\nBeke, who is the Chairman of Rivers State Unity Forum, said he is in the race to change old and known ways for a better and prosperous Rivers State.\nHis words: “Signature projects of Ugo Beke’s manifesto include development and construction of oil and gas city in the riverine area of Rivers State.\n“We will construct many feeder roads and fix all the existing bad roads in order to promote trade, free movement of goods and people, and also enhance mobility of labour.”"
  },
  {
    "headline": "FG must look the direction of nuclear energy — DG, NAEC",
    "summarized_story": "This is even as he reacted to some of the myths around introducing Nuclear in Nigeria, stating that the advantages behind Nuclear energy outweighs the disadvantages.\nHe maintained that Nigeria has the local capacity to manage Nuclear energy as done by other countries in the world.\nHe, however, urged the Nigerian Young Generation in Nuclear, NYGN, to advance the campaign of Nuclear energy to citadels of learning in Nigeria and other institutions.\nAccording to him, the advantages of Nuclear power are more than the disadvantages.\n“They are looking at the waste and how to manage waste but we have capacity and capability of managing waste."
  },
  {
    "headline": "Osinachi: Peter Nwachukwu’s trial adjourned till June 20",
    "summarized_story": "By Fortune EromoseleTrial of late gospel singer’s husband, Peter Nwachukwu, has been adjourned till on Monday, June 20 and Tuesday June 21.\nArriving, the court premises as at press time, this correspondent was told by the court registry that the FCT High Court Judge, Justice Njideka Nwosu-Iheme, was absent and would not be sitting today.\nRecall that the federal government slammed a 23-count charge against the late gospel singer’s husband, which borders on domestic violence and homicide.\nOsinachi Nwachukwu’s death sparked outrage after her family alleged that she suffered marital abuse in the hands of her husband.\nMeanwhile, the late Osinachi is expected to be buried in her father’s compound June 25, Abia state."
  },
  {
    "headline": "Yobe Deputy Gov, Gubana loses son, teenage daughter to road accidents in one week",
    "summarized_story": "Yobe State Deputy Governor, Idi Barde Gubana has lost his 16-year-old daughter, Khadija, in a fatal road accident that occurred along the Maiduguri-Kano highway.\nThis is coming a week after he lost his son, Mai Mala Buni Junior, in an accident.\nKhadija, known as Siyama, becomes the latest victim of the accident to have died after sustaining life-threatening injuries.\nHussaini Mai Suleh, Press Secretary to the Deputy Governor, in a statement said until her death, Siyama was a student an SS 2 student at Essence International School, Damaturu, the state capital.\nAccording to Suleh, the burial of the late Khadija Idi Barde is scheduled to take place at Mai Fune’s Place, Damagum by 4:00 pm, Thursday 16th June 2022."
  },
  {
    "headline": "How we restored Peter Obi to govt house after he was kicked out – Fr Mbaka",
    "summarized_story": "Ejike Mbaka has claimed that he played a major role in keeping the 2023 Labour Party presidential candidate, Peter Obi in the Anambra State government house during his (Obi) tenure as Governor of the state.\nMbaka, the founder of Adoration Ministry, Enugu made the claim on Wednesday during a sermon at the adoration ground.\nObi had several times claimed that he was impeached by the state lawmakers for allegedly refusing to mismanage the state’s fund.\n“Ask Peter since then what he used to reward Adoration.\nIf you like Peter Obi, tell him to come and ask for forgiveness."
  },
  {
    "headline": "Justice shouldn’t be for highest bidder – Ishaku tells new Taraba judges",
    "summarized_story": "Governor Darius Dickson Ishaku of Taraba State has cautioned judges that justice should not be for the highest bidder, urging them to be fair in their practice.\nThe governor, who made the call today, while swearing in some new judges in Jalingo, the state capital, stressed the need for them to eschew such unprofessional practice to avoid the wrath of the supernatural judge.\nHe said many Nigerians are disappointed in the judiciary because of such nefarious activities.\n“You don’t need to go to Law School before you know that some judgments in Nigeria are entirely rubbish.\n“Judges must rise above primitive religious and ethnic sentiment that has held us back as a nation for a long time."
  },
  {
    "headline": "Why COEASU resumed suspended strike – Northwest coordinator",
    "summarized_story": "The Northwest coordinator of the Colleges of Education Academic Staff Union (COEASU), Comrade Shehu Jabaka Mohammed, said the union has resumed its suspended strike for four weeks following continued neglect of the sub-sector by the Federal Government.\nThe coordinator disclosed this in Gusau, the Zamfara State capital, while briefing newsmen on the outcome of their National Executive Council meeting, (NEC).\n“Others are non-release of N15 billion approved out of the N456,599,691, and N18 Billion Revitalization Fund for both Federal and State Colleges of Education contrary to repeated promises of the FG.\n“Poor funding of Colleges of Education and poor conditions across State Colleges of Education especially in Ogun, Kwara, Abia, Kogi, Kaduna, Zamfara, Yobe, Oyo, Benue, Edo and Ebonyi States, among others,” he said.\nThe northwest Coordinator added that the union resolved to embark on the industrial action with effect from Friday, 10th June 2022, therefore, the suspended strike action in December 2018 be resumed immediately for four weeks in the first instance."
  },
  {
    "headline": "UN decries terrorist attacks in Adamawa, Borno",
    "summarized_story": "The United Nations (UN) has expressed grave concern about the recent waves of terrorist attacks affecting civilians in North-East Nigeria.\nResident and Humanitarian Coordinator, Matthias Schmale said attacks by non-state armed groups (NSAGs) and communal clashes raise immediate concerns for the safety of civilians.\nOn June 7, terrorists killed dozens of people during an attack on Mugdala village, on the outskirts of Dikwa town in Borno.\nIt occurred after the May 24 attack in Mudu village, Dikwa LGA, that killed at least 32 civilians.\nAgain on May 28, terrorists attacked an IDP camp in Mafa LGA in Borno, looting food and other supplies."
  },
  {
    "headline": "We must march on NASS to demand State police",
    "summarized_story": "Olowo of Owo, Oba Ajibade Gbadegesin Ogunoye III, has urged women groups, civil society organisations and other well meaning Nigerians to march on the National Assembly in demand of constitutional amendment for creation of State police.\nOba Ogunoye III said it was a sad sight to behold innocent children killed in the June 5th attack on the St Francis Catholic Church, Owo.\nOba Ogunoye III, who expressed optimism that the attackers would soon be apprehended, said Nigerians had to be assured of security to lives and property.\n“Let us begin to advocate for true federalism and creation of State police.\n“As we cry for the president to save lives, let us go to the National Assembly."
  },
  {
    "headline": "Mane returns to village, plays in muddy local match The Nation Newspaper",
    "summarized_story": "Sadio Mane returned to his childhood village in Senegal to take part in a muddy local football match as speculation surrounding his Liverpool future continues to rumble on.\nMane, who looks set to leave Jurgen Klopp’s side and seal a move to Bayern Munich this summer, went back to Bambali to play in the local kick-about alongside some star names.\nIn a video posted on his Instagram, Mane can be seen playing on a muddy pitch alongside the aforementioned players and friends from his village.\nHe wrote alongside the post: ‘Back to the source with a gala match on the Bambaly pitch where it all started!!!\nMane was seen playing alongside his friends in Bambali as talk of a potential move to Bayern Munich continues to gather pace."
  },
  {
    "headline": "2023: Lady dumps boyfriend for not supporting Obi The Nation Newspaper",
    "summarized_story": "An Abuja-based lady simply identified as Josephine has ditched her lover for his refusal to support her presidential candidate ahead of the 2023 general elections.\nJosephine tweeted she’s a staunch supporter of the Labour Party (LP) presidential candidate, Peter Obi.\nReferring to her lover as a “dummy”, the young lady declared she can’t continue dating such a fellow especially since he has refused to identify with her preferred presidential candidate.\n”So I ended my relationship today because my boyfriend has refused to support @PeterObi, i can’t be dating a dummy,”she tweeted."
  },
  {
    "headline": "Why Peter Obi can never be president, by Father Mbaka The Nation Newspaper",
    "summarized_story": "Ejike Mbaka has given reasons why Labour Party presidential candidate, Peter Obi, can never win the presidency in 2023.\n“It is now that Atiku is seriously contesting for President; now that he is contesting without Peter Obi; it is now that he is serious.\n“Listen, a good old man is better than a young wicked man; Peter Obi is going nowhere as far as God lives.\nIf Igbos want a representative, it is not someone like Peter Obi.\nPeter Obi has incurred a curse to himself, which means that he is carrying a curse; if you want to be President, change him."
  },
  {
    "headline": "Last-minute intrigues in PDP over Atiku’s running mate The Nation Newspaper",
    "summarized_story": "Yesterday’s decision by the party to raise a team led by Chief Tom Ikimi to screen Rivers State Governor Nyesom Wike created more confusion.\nObservers were wondering why the need to screen Wike again, having been screened by the David Mark-led presidential screening panel.\nThe Rivers State governor came second in the PDP presidential primary.\nOther members of the Ikimi panel expected to screen Wike today, according to PDP spokesman, Debo Ologunagba, are: Dr Akilu Indabawa, Capt.\nVice Presidential and deputy governorship candidates) without which the nomination would be invalid."
  },
  {
    "headline": "Breaking: Atiku picks Okwa as running mate",
    "summarized_story": "From Ndubuisi Orji, AbujaPeoples Democratic Party (PDP) 2023 presidential candidate, Atiku Abubakar, has chosen Delta State governor, Ifeanyi Okowa as his running mate.\nDo not miss the Vital Information, it goes off in 2 days!\nAtiku announced Okowa as his choice, at a meeting of the PDP National caucus, on Thursday, in Abuja.\nThe PDP candidate stated that he consulted the various party organs before settling for the Delta State governor.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Breaking: PDP sets to unveil Okowa as VP candidate",
    "summarized_story": "The Governor of Delta state, Ifeanyi Okowa has just arrived the headquarters of the Peoples Democratic Party’s (PDP) Abuja.\nOkowa and Rivers State Governor, Nyesom Wike, are among names being mentioned as prospective running mates to the PDP’s presidential candidate, Atiku Abubakar.\nEarlier, the PDP had denied reports that it had ruled out Wike from the Vice Presidential race.\n“The various positions creditably held by Governor Nyesom Wike distinguished him as an excellent team player in public governance.\n“The PDP urges Nigerians to disregard the mischievous reporDetails soonPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "VP slot: Suspense persists in APC",
    "summarized_story": "By Wilfred Eya and Ndubuisi OrjiTwenty fours hours to the deadline by the Independent National Electoral Commission (INEC) for political parties to submit names of their vice presidential candidates, suspense has persisted in the All Progressives Congress (APC) over choice of running mate.\nThe development came just as the main opposition party, Peoples Democratic Party (PDP), will today screen its vice presidential aspirants.\nA top member of the APC told Daily Sun that the tension in the camps of various interest groups scrambling for the vice presidential candidate slot is boiling over.\nAlso, the main opposition party would today screen its aspirants for the vice presidential slot.\nHowever, the party is yet to make a formal announcement on the choice of Wike as its 2023 vice presidential candidate."
  },
  {
    "headline": "Reps seek override of President’s veto on Amended Electoral Act",
    "summarized_story": "From Ndubuisi Orji, AbujaSome members of the House of Representatives, yesterday, charged the parliament to override President Muhammadu Buhari’s veto on the amendment the Section 84 (8) of the Electoral Act.\nThe House while on recess convened an emergency session to amend Section 84 (8) of the Electoral Act 2022.\nThis was not unconnected with the president’s refusal to sign the amended 2022 Electoral Act.\nThe Continuous Voter Registration (CVR) exercise is scheduled to end on June 30.\nHe expressed concern due to reports of shortages of voter registration machines, inadequate manpower and personnel at registration centres."
  },
  {
    "headline": "Ekiti 2022: I didn’t meet Tinubu to compromise my candidacy, Oni clarifies – The Sun Nigeria",
    "summarized_story": "“Let me say that this is a lie, I have not seen Tinubu for over a year now.\nI am here for Ekiti people and I will not compromise the interest of Ekiti people for anything.\nI am a contented person and I am not a person that can be bought with money, I can’t be purchased.\nOni also lambasted politicians planning to buy the conscience of the people in the election, describing votes-buying as an unpardonable criminal offence in the face of the law.\nWe have seen a situation whereby minority was lorded over the majority, but it won’t happen again in Ekiti."
  },
  {
    "headline": "EXCLUSIVE: How Lopsided Promotion Of Officers By Nigeria’s Anti-Narcotics Agency, NDLEA Favours Candidates Of Political Office Holders, Denies Others For About 20 Years",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), through its harmonisation exercise, has allegedly denied some officers promotion for about 20 years, while some of their colleagues recruited much later after have been promoted up to two times.\nThe sources said that their promotions have been cumulatively stagnated for about 10 to 20 years which translates to a loss of three to six ranks.\nAccording to him, all CNAs with earlier or 2004 effective dates were made to go through conversion course 1/2008 with no cognizance of the fact that some older NA courses 7/94 and 8/96 were on re-sit.\nThe imposition of the conversion course on these unprepared sets of officers made them unsuccessful in conversion course 1, it was learnt.\nThough the effective dates of promotion of successful candidates of CNA conversion course 1 were backdated appropriately, that of CNA course 2/2013 converted officers were not backdated,” the source continued."
  },
  {
    "headline": "EXCLUSIVE: How Lopsided Promotion Of Officers By Nigeria’s Anti-Narcotics Agency, NDLEA Favours Candidates Of Political Office Holders, Denies Others For About 20 Years",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), through its harmonisation exercise, has allegedly denied some officers promotion for about 20 years, while some of their colleagues recruited much later after have been promoted up to two times.\nThe sources said that their promotions have been cumulatively stagnated for about 10 to 20 years which translates to a loss of three to six ranks.\nAccording to him, all CNAs with earlier or 2004 effective dates were made to go through conversion course 1/2008 with no cognizance of the fact that some older NA courses 7/94 and 8/96 were on re-sit.\nThe imposition of the conversion course on these unprepared sets of officers made them unsuccessful in conversion course 1, it was learnt.\nThough the effective dates of promotion of successful candidates of CNA conversion course 1 were backdated appropriately, that of CNA course 2/2013 converted officers were not backdated,” the source continued."
  },
  {
    "headline": "EXCLUSIVE: How Lopsided Promotion Of Officers By Nigeria’s Anti-Narcotics Agency, NDLEA Favours Candidates Of Political Office Holders, Denies Others For About 20 Years",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), through its harmonisation exercise, has allegedly denied some officers promotion for about 20 years, while some of their colleagues recruited much later after have been promoted up to two times.\nThe sources said that their promotions have been cumulatively stagnated for about 10 to 20 years which translates to a loss of three to six ranks.\nAccording to him, all CNAs with earlier or 2004 effective dates were made to go through conversion course 1/2008 with no cognizance of the fact that some older NA courses 7/94 and 8/96 were on re-sit.\nThe imposition of the conversion course on these unprepared sets of officers made them unsuccessful in conversion course 1, it was learnt.\nThough the effective dates of promotion of successful candidates of CNA conversion course 1 were backdated appropriately, that of CNA course 2/2013 converted officers were not backdated,” the source continued."
  },
  {
    "headline": "Oyo State Lawmakers Start Impeachment Process Against Deputy Governor, Olaniyan",
    "summarized_story": "The Oyo State House of Assembly has commenced the process to impeach the deputy governor of the state, Mr Rauf Olaniyan.\nHence, The Speaker instructed the Clerk of the House, Mrs Yetunde Awe to write the deputy governor mandating him to respond to the allegations within seven days.\nThe impeachment process followed the recent defection of the state deputy governor from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC).\nIn 2021, SaharaReporters had reported that Oyo State would soon be embroiled in legal turmoil as a plot to impeach Olaniyan had been hatched.\nMakinde and Olaniyan have been at loggerheads shortly after their election in 2019, with supporters of Olaniyan accusing Makinde of relegating his deputy governor to the background."
  },
  {
    "headline": "Oyo State Lawmakers Start Impeachment Process Against Deputy Governor, Olaniyan",
    "summarized_story": "The Oyo State House of Assembly has commenced the process to impeach the deputy governor of the state, Mr Rauf Olaniyan.\nHence, The Speaker instructed the Clerk of the House, Mrs Yetunde Awe to write the deputy governor mandating him to respond to the allegations within seven days.\nThe impeachment process followed the recent defection of the state deputy governor from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC).\nIn 2021, SaharaReporters had reported that Oyo State would soon be embroiled in legal turmoil as a plot to impeach Olaniyan had been hatched.\nMakinde and Olaniyan have been at loggerheads shortly after their election in 2019, with supporters of Olaniyan accusing Makinde of relegating his deputy governor to the background."
  },
  {
    "headline": "BREAKING: Atiku picks Okowa as running mate",
    "summarized_story": "Atiku Abubakar, presidential candidate of the Peoples Democratic Party (PDP), has named Ifeanyi Okowa, governor of Delta, as his running mate in the 2023 general election.\nHe announced his choice of running mate on Thursday at the PDP national headquarters in Abuja.\nHe said he reached his decision after wide consultations with party stalwarts.\nHe said it was a difficult decision for him for to make considering the quality of those that were recommended.\nAdvertisementMore to follow…"
  },
  {
    "headline": "BREAKING: Atiku picks Okowa as running mate",
    "summarized_story": "Atiku Abubakar, presidential candidate of the Peoples Democratic Party (PDP), has named Ifeanyi Okowa, governor of Delta, as his running mate in the 2023 general election.\nHe announced his choice of running mate on Thursday at the PDP national headquarters in Abuja.\nHe said he reached his decision after wide consultations with party stalwarts.\nHe said it was a difficult decision for him for to make considering the quality of those that were recommended.\nAdvertisementMore to follow…"
  },
  {
    "headline": "Mbaka asks his followers not to vote for Peter Obi, says he's stingy",
    "summarized_story": "Ejike Mbaka, spiritual director of Adoration Ministries, Enugu, Nigeria (AMEN), says Peter Obi, former governor of Anambra and presidential candidate of the Labour Party (LP), cannot be Nigeria’s president because he is “stingy”.\nHe said it is better to have an old generous man than a young man who does not have the spirit of giving.\nIn 2019, TheCable reported Mbaka as saying Atiku and Obi, might “end in shame” after Obi failed to make donations at the ministry’s 2018 harvest and bazaar celebrations.\n“It is better to have an old man with a generous spirit than to to have a young man with ‘gum’ hands,” Mbaka said.\nIf Igbos are looking for who to represent them in Nigeria, it’s not someone like Peter Obi."
  },
  {
    "headline": "Mbaka asks his followers not to vote for Peter Obi, says he's stingy",
    "summarized_story": "Ejike Mbaka, spiritual director of Adoration Ministries, Enugu, Nigeria (AMEN), says Peter Obi, former governor of Anambra and presidential candidate of the Labour Party (LP), cannot be Nigeria’s president because he is “stingy”.\nHe said it is better to have an old generous man than a young man who does not have the spirit of giving.\nIn 2019, TheCable reported Mbaka as saying Atiku and Obi, might “end in shame” after Obi failed to make donations at the ministry’s 2018 harvest and bazaar celebrations.\n“It is better to have an old man with a generous spirit than to to have a young man with ‘gum’ hands,” Mbaka said.\nIf Igbos are looking for who to represent them in Nigeria, it’s not someone like Peter Obi."
  },
  {
    "headline": "33 passengers escape death as Overland aircraft's engine catches fire mid-air",
    "summarized_story": "Overland Airways says its flight OF1188 en route to Lagos from Ilorin experienced an “unusual high turbine temperature” on one of its engines, noting that all 33 passengers on board disembarked safely.\nOverland Airways said the incident occurred on Wednesday, June 15, 2022 around, 7:50 pm in the approach phase of the flight.\n“Overland Airways wishes to inform the general public that its flight OF1188 from Ilorin to Lagos experienced an unusual high turbine temperature on one of its engines today, Wednesday, June 15, 2022, around 7:50 pm,” the company said.\nAdvertisement“This occurred in the approach phase of flight and the aircraft landed very safely as the crew skillfully implemented their standard procedures for such abnormal situations.\n“All 33 passengers remained calm through the process and safely disembarked row by row in accordance with post-COVID-19 procedures after the aircraft came to a halt on the Murtala Mohammed International Airport Lagos runway 18 Right."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "The IFC backs Gozem's vehicle financing project with $10m in funding",
    "summarized_story": "That’s the estimated number of motor vehicle drivers that Gozem, a Francophone Africa-focused super app, says operate in informal markets across West and Central Africa.\nIFC has dedicated a $10 million investment into Gozem’s vehicle financing project.\nThis investment will enable Gozem to provide access to affordable vehicle financing in Togo and Benin, its operating markets.\nGet the best African tech newsletters in your inboxThis deal comes about 6 months after Gozem closed a $5 million funding and 14 months after it started its vehicle financing program.\nHe added that this partnership also factors in electric vehicles (EV)."
  },
  {
    "headline": "NITDA's Code of Practice to help Nigeria regulate social media",
    "summarized_story": "Months after it lifted its 7-month ban on Twitter, the Nigerian government has set out to regulate social media platforms with a new Code of Practice.\nWhile this includes US-based social media platforms, it also includes indigenous sites like Nairaland, blogs like Linda Ikeji, and newsletter platforms like Substack with over 100,000 users.\nNigeria’s poor regulatory historyThere are few provisions within the draft Code that fulfills NITDA’s aim of “protecting the fundamental human rights of Nigerians”.\nThere was the social media bill of 2019, and the hate speech bill which proscribed death as the penalty for hate speech.\nIn 2021, there was also an attempt to modify the National Broadcasting Commission (NBC) Act to cover social media platforms."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Electricity operators commit to 5,000MW from July 1",
    "summarized_story": "Electricity operators in Nigeria have committed to delivering 5,000MW of power from July 1, under the pain of sanctions if they default, the regulator has said.\n“Effectively from July 1, all electricity market participants have committed to 5,000MW.\nPower generation companies have also been compelled to sign contracts with gas suppliers for the required gas volumes to maintain the projected power delivery.\nThe commission, he said was moving to ensure that all contracted gas volumes are fully paid for.\nThe NERC chairman said the commission was going to enforce this contract by ensuring that erring market operators pay stiff penalties for failing to meet their obligation."
  },
  {
    "headline": "Nigeria’s 17.7% inflation raises concerns over food security",
    "summarized_story": "The National Bureau of Statistics said the inflation rate increased to 17.71 percent in May from 16.82 percent in April.\nFood inflation rose to 19.50 percent, the highest in eight months, compared to 18.37 percent in the previous month.\n“Inflation has reached 17.7 percent (y/y) in May led by a renewed surge in food prices, exacerbated by the war in Ukraine, and raising food security concerns as over 40 percent of the population live below the poverty line.\nUrban inflation rate rose to 18.24 percent in May as against 17.35 percent in April, while rural inflation increased to 17.21 percent from 16.32 percent.\nRead also:Nigeria’s inflation rate hits 17.7%, highest in 11 months“The increase in inflation was driven by persistent structural factors and the base year effect."
  },
  {
    "headline": "Ekiti poll to test INEC’s readiness for 2023",
    "summarized_story": "The gubernatorial election coming up in Ekiti State on Saturday is expected to test the readiness of the Independent National Electoral Commission (INEC) for the 2023 general election.\nAccording to INEC, 16 political parties are presenting candidates for the gubernatorial election.\nThe Ekiti gubernatorial poll will be the first election to be conducted under the current Amended Electoral Act, and the second state election to be conducted using the Bimodal Voter Accreditation System.\nThat is, how effective and efficient INEC in the Ekiti election would determine the level of trust and confidence Nigerians would have in the body.\nUnlike in the past, the campaign by political parties and their candidates have been relatively peaceful."
  },
  {
    "headline": "Federal University of Education (Technical), Bichi Est. Bill, 2022 Passes 2nd reading – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Federal University of Education (Technical) Bichi establishment Bill 2022 has passed second reading on the floor of the Senate.\nAccording to the lawmaker, for any country to achieve meaningful development, the socio economic and political system must be enhanced.\nThis is why successive Nigerian governments placed much emphases on the development of the individual as a means to national development.\nTo act as agents and catalysts for effective Educational system, through post graduate training, research and innovation, for effective economic utilization and conservation of the country’s human and material resources.\nTo bring quality change in Technical Education by focusing on teacher Education, through teaching and learning innovations."
  },
  {
    "headline": "How Edo emerged as World Bank’s best-performing state, by Edo NEWMAP Coordinator – Nigerian Observer",
    "summarized_story": "The World Bank, last weekend, at the closing/valedictory session for the NEWMAP project in Abuja, named Edo State as the best-performing state since the inception of the project in 2012.\nEdo State also came out tops in two other categories, including Best in Disbursement/Engineering/Civil Works/Bio-Engineering and Best in Counterpart Funding.\n“Edo State came out tops in three (3) categories, which is the highest winning by any state out of the 23 NEWMAP participating states.\nThe categories are best overall performing state; best in Disbursement/Engineering/Civil Works/Bio-Engineering, and best in Counterpart Funding.\nThese are in addition to coming as runner up in several other categories.”Obaseki further noted, “It is on record that Edo State NEWMAP accounted for about 17 percent of the overall success of NEWMAP in Nigeria."
  },
  {
    "headline": "Edo eyes N2bn investment in tourism, others, as U.S trade mission arrives Benin – Nigerian Observer",
    "summarized_story": "The Commissioner for Industry, Trade and Co-operatives, Hon.\nAfie Braimoh, who disclosed this to journalists in Benin City, said the trade mission delegation is expected to be in Benin City, the Edo State capital, between June 18 and 19, 2022.\nShe noted that the County Director has facilitated several annual trade missions across Africa and other continents for years.\nBraimoh said the team has a special interest in investment in Africa’s tourism, maritime, and aviation sectors, which are in line with the Obaseki’s Making Edo Great Again (MEGA) Agenda to make Edo State a tourist destination.\nOther areas of possible collaboration, according to the commissioner, include maritime services with opportunities to export ‘Made in Edo’ products via Miami International Port."
  },
  {
    "headline": "Miami Trade Mission to visit Benin- Braimoh – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe efforts of the Edo State government to make the State a tourism and investment hub have begun to yield fruit, with the scheduled visit of a trade mission from the Miami- Dade County, Florida, United States of America.\nThe trade mission delegations are expected to be in Benin between June 18 to 19.\nThe American Trade Mission visit to Benin is the brainchild of Hon.\nShe also led the Edo State team which made its debut appearance at the 6th NASSI business trade fair held in Lagos in May 2022.\nThe trade mission plans to visit the FCT Abuja and Lagos for similar bilateral discussions on trade and tourism before they depart for other African countries by June 22."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Just In: Atiku picks Okowa as running mate",
    "summarized_story": "Presidential candidate of the Peoples Democratic Party (PDP), Alhaji Atiku Abubakar, has picked Dr. Ifeanyi Okowa, Delta State governor as his running mate for the 2023 presidential election.\nAtiku announced the decision on Thursday at the party’s secretariat, Abuja, ahead of Friday’s INEC deadline for the submission of names of party candidates and their running mates.\nRecall that a 17-man commitee set up to pick a running mate for Atiku had voted for Wike as the party’s choice, followed by Okowa and Emmanuel Udom of Akwa Ibom state.\nMembers who attended the meeting include: Benue State Governor, Samuel Ortom; Sokoto State Governor, Aminu Tambuwal; Bauchi State Governor, Bala Mohammed; former governor of Niger State, Babangida Aliyu; former governor of Jigawa State, Sule Lamido; former Cross Rivers State Governor, Liyel Imoke; Senator Adolphus Wabara, Senator Oluwole Oke, Ambassador Taofeek Arapaja, Professor Stella Effah-Attoe.\nOthers include former governor of Ondo State, Olusegun Mimiko; PDP National Secretary, Sam Anyanwu; National Organising Secretary, Hon."
  },
  {
    "headline": "Tragedy averted as crew successfully lands Overland aircraft after engine caught fire midair",
    "summarized_story": "Overland Airways’ crew successfully landed one of its aircraft after it caught fire miles away from runway 18R of the Murtala Muhammed International Airport (MMIA) on Wednesday night.\nThe Lagos airport control tower consequently put the airport emergency response team, including the Federal Airports Authority of Nigeria’s fire services department, on notice.\nThe pilot finally landed the faulty plane safely on the international airport’s runway amid a fully prepared airport emergency response team.\n“This occurred in the approach phase of flight and the aircraft landed very safely as the crew skillfully implemented their standard procedures for such abnormal situations.\n“Overland Airways regrets any inconvenience to its passengers and assures the travelling public of its full commitment to the safety of its services and passengers.”"
  },
  {
    "headline": "Running Mate: Atiku settles for Okowa, to announce decision today",
    "summarized_story": "Presidential candidate of the Peoples Democratic Party (PDP), Alhaji Atiku Abubakar, has reportedly picked Dr. Ifeanyi Okowa, Delta State governor as his running mate for the 2023 presidential election.\nParty sources said the former vice president will announce Okowa as his running mate on Thursday ahead of Friday’s INEC deadline for the submission of names of party candidates and their running mates.\nAtiku and other party leaders are currently meeting at the party’s secretariat in Abuja ahead of the announcement.\nWike worked for Aminu Waziri Tambuwal in the 2019 presidential primary election, though Atiku still won the ticket.\nRecall that a 17-man commitee set up to pick a running mate for Atiku had voted for Wike as the party’s choice, followed by Okowa and Emmanuel Udom of Akwa Ibom state."
  },
  {
    "headline": "‘Best friend and soul mate’ – Theo Walcott hails wife at 9th anniversary",
    "summarized_story": "Former England and Arsenal forward, Theo Walcott, has praised his wife, Melanie, on their 9th wedding anniversary, calling her his best friend and soul mate.\nThe 33-year-old who joined Southampton from Everton took to his twitter account to celebrate his wife on the occasion.\nYou’re my best friend and soul mate #9yearsanniversary,” he wrote.\nYou’re my best friend and soul mate #9yearsanniversary ❤️ pic.twitter.com/nFCpeJIlvA — Theo Walcott (@theowalcott) June 15, 2022Theo Walcott met his girlfriend and future wife in Southampton.\nTheo was 15, and Mel Slade was 16 at the time, making them childhood sweethearts."
  },
  {
    "headline": "Osinachi: Court adjourns Peter Nwachukwu’s trial till June 20",
    "summarized_story": "Trial of late of Peter Nwachukwu, husband of late gospel singer, Osinachi, has been adjourned till on Monday, June 20 and Tuesday June 21.\nThe federal government slammed a 23-count charge on Mr. Nwachukwu, who is accused of being responsible for Osinachi’s death.\nThe defendant, whose wife allegedly died as a result of prolonged assault by him, pleaded not guilty to all the allegations that were contained in the charge the Federal Government preferred against him.\nOsinachi’s death sparked outrage after her family alleged that she suffered marital abuse in the hands of her husband.\nMeanwhile, the late Osinachi is expected to be buried in her father’s compound June 25, Abia state."
  },
  {
    "headline": "N’East, N’West Lobby Tinubu For Running Mate, PDP Screens VP Candidate Today",
    "summarized_story": "This is even as the Peoples Democratic Party (PDP) will screen its vice presidential candidate today.\nADVERTISEMENTThere were also feelers that the APC may have favoured the North East zone to produce Tinubu’s running mate.\nImo State governor, Hope Uzodimma, had told State House correspondents after meeting with President Buhari that the decision of a running mate lies with Tinubu.\nTinubu, while reacting to rumours of picking a Muslim as his running mate, had hinted at picking a Northern Christian as his running mate.\nThe group said Atiku and Wike as presidential candidate and running mate respectively will win the 2023 presidential race without stress."
  },
  {
    "headline": "Reps Move To Override Buhari On Electoral Act Amendment",
    "summarized_story": "The House of Representatives yesterday resolved to move a motion to override President Muhammadu Buhari for failing to assent to Clause 58(8) of the Electoral Act (Amendment) bill, 2022, which provides for statutory delegates.\nADVERTISEMENTHe, therefore, urged his colleagues to rise up, take the pen, collect signatures and override President Buhari and give Nigerians the enabling electoral law.\nAnd by 12th, this amendment was transmitted to Mr. President.\nToby Okechukwu, had said that the electoral act had been weaponised, calling for activation of relevant Constitutional powers to address the lacuna.\n“Anything that occasions it, anything that warrants it, if it is our Electoral Act, if it is our politics, if it is the environment where we operate, we need to retool."
  },
  {
    "headline": "Unravel Those Behind Owo Killings, Senate Tells Security Agencies",
    "summarized_story": "The Senate has challenged Nigeria’s security agencies to unmask the perpetrators of the Owo church attack in Ondo State.\nAccording to the Senate, the security agencies should be discreet in collaborating on intelligence gathering and sharing to prevent future attacks by terrorists.\nThis was just as the chamber condemned the recent attack on St. Francis Catholic Church, Owo, and mourned the killing of worshippers.\nBoroffice, in his presentation, noted with deep concern the attack on worshippers on Sunday, 5th June, 2022, at St. Francis Catholic Church, Owo, Ondo State.\nThe chamber urged for collaboration amongst her various security agencies on intelligence gathering and sharing in very discreet and organised form, at local government and state levels, and nationwide."
  },
  {
    "headline": "ASUU Sues Obaseki Over Ban On Union’s Activities",
    "summarized_story": "Academic Staff Union of Universities (ASUU), Ambrose Alli University, Ekpoma in Edo State have dragged the state governor, Godwin Obaseki, Edo State Government and the attorney general of the state to court over last week’s ban on all unions’ activities in all the state owned tertiary institutions.\nT14, Laws of the Federation of Nigeria, to suspend or prohibit trade union activities in AAU.\n“An order of perpetual injunction restraining the Defendants, their servants, agents and/or privies from taking any form of disciplinary action against the Claimants on account of their trade union activities at Ambrose Alli University, Ekpoma.”The state government had, following a protest by students of AAU over the lingering nationwide strike by ASUU suspended all union activities across all state-owned institutions of higher learning.\nIt said the affected unions include ASUU, Non-Academic Staff of Universities (NASU), Senior Staff Association of Nigeria Universities (SSANU), Academic Staff Union of Polytechnics (ASUP), Non-Academic Staff Union of Polytechnics and all allied unions operating across all state-owned tertiary institutions.\nNo date has been fixed for hearing."
  },
  {
    "headline": "Ordinary Nigerians Our Assets, Says Enugu LP Guber Candidate",
    "summarized_story": "Ahead of the 2023 general election, the gubernatorial flagbearer of the Labour Party in Enugu State, Casmir Uchenna Agbo has described the poor masses as the assets of the party.\nAgbo described Labour Party as the struggle for the emancipation of the people from mental slavery, assuring that the party will ensure good welfare packages for the masses.\nHe vowed that Labour Party will wrest power from the Peoples Democratic Party (PDP) in Enugu State come 2023, stating that the party has the capacity to do so.\n“We are going to take over Enugu State in 2023.\nLabour Party has gotten a man of integrity and the person is Peter Obi, our presidential candidate,” he stated."
  },
  {
    "headline": "Osun APC denies hiring thugs to attack PDP members",
    "summarized_story": "The All Progressives Congress, APC, in Osun has dismissed the allegation by the opposition Peoples Democratic Party (PDP) that it hired thugs to attack and kill its members in the State.\nThis was the genesis of the ongoing violence among the factions of political thugs in the PDP.\nIt will be recalled that the media reported how the PDP thugs also engaged in a free-for-all fight at the party’s Secretariat, shooting themselves in Osogbo last Sunday.\n“It is also untrue that the Amotekun and the Police aided APC thugs in attacking members of the PDP.\n“For the avoidance of doubt, our party does not have any connection with the latest violent attack perpetrated by political thugs loyal to the PDP."
  },
  {
    "headline": "BREAKING: Atiku Picks Governor Okowa As Running Mate",
    "summarized_story": "Ifeanyi Okowa, the Delta state Governor, has emerged as the running mate to the presidential candidate of the Peoples Democratic Party (PDP), Atiku Abubakar.\nMr. Okowa’s nomination was announced and confirmed by Atiku himself on Thursday at an unveiling event of his running mate held in Abuja.\nAtiku while speaking on his choice said his Vice President must fulfil the qualities to be president and one that could complement him as a President.\nFollowing the announcement, Okowa will thereafter be screened by a committee already setup for that purpose.\nMr Okowa supported Atiku in the primary where Mr Wike was his closest challenger."
  },
  {
    "headline": "Fire Guts 42 Shops In Bauchi Varsity, Owners Count Losses",
    "summarized_story": "A fire has destroyed 42 stores at the Abubakar Tafawa Balewa University’s Student Centre in Bauchi State, resulting in the loss of property worth millions of naira.\nAn electrical fault is said to have started the fire, which started around 2 a.m. on Wednesday in one of the shops.\n“All my property, including photocopiers, computers, laptops, printers, stationery, generator and everything I had in that shop was destroyed.\n“By the time I got there later in the morning, I discovered that all the shops were burnt down.\n“I lost everything I had in my shop: computers, printers, furniture, generator, stationery, POS machines and a lot of things,” he added."
  },
  {
    "headline": "We Won 1993 Election, We’ll Win Again – Abiola’s Son",
    "summarized_story": "Kola Abiola, the Peoples Redemption Party’s presidential candidate, expressed optimism on Wednesday that he will emulate his father, Chief MKO Abiola1993 ,’s accomplishment and win the 2023 election.\nHe joined the PRP, he claims, not because he wanted a platform to run for President, but because of the party’s beliefs.\nIf we can win the 1993 election about 30 years ago, we can also win it now.\nI won Kano in 1993 with my father, collectively, and we must win it again.\nTo make this happen, our thought process must change.”The party’s national chairman, Falalu Bello, said the PRP would contest the 2023 governorship election in 21 states."
  },
  {
    "headline": "[Breaking] 2023 presidency: Atiku picks Okowa as running mate",
    "summarized_story": "Less than 24 hours before the Independent National Electoral Commission (INEC) deadline for political parties to submit names of 2023 presidential candidates and running mates, the Peoples Democratic Party (PDP) Presidential candidate, Atiku Abubakar, has announced Delta State Governor, Ifeanyi Okowa as his running mate.\nThe former Vice President who announced this at the party headquarters in Abuja, Thursday, stressed that “party unity is critical for winning the 2023 general election and we must not take anything for granted”.\nAtiku explained that he picked Okowa because he will work with him to unite the country and rebuild the country.\nDetails loading…Share this: TwitterFacebook"
  },
  {
    "headline": "Breaking: Erik ten Hag gets easy clash as Manchester United face Brighton, Everton vs Chelsea in 2022/23 Premier League opener *See full fixtures",
    "summarized_story": "Then a week later, English football’s two most successful sides clash as Manchester United welcome Liverpool (weekend of August 20).\nIn comparison, after travelling to Fulham; Liverpool face Crystal Palace (H), Manchester United (A), Bournemouth (H), Newcastle United (H), Everton (A).\nFulham’s first six games read Liverpool (H), Wolves (A), Brentford (H), Arsenal (A), Brighton (H) and Tottenham (A).\nAnd Forest begin with Newcastle United (A), West Ham (H), Everton (A), Tottenham (H), Manchester City (A) and Bournemouth (H).\nAnd kicking off 2023 on January 2 currently we have the *small* (it isn’t small) matter of Chelsea entertaining Manchester City."
  },
  {
    "headline": "Orji Uzor Kalu on Tinubu’s running mate: Muslim-Muslim ticket only way to APC victory",
    "summarized_story": "The Chief Whip of the Senate, Senator Orji Uzor Kalu (APC Abia North ), has said the only path to victory for the presidential candidate of the All Progressives Congress ( APC), Asiwaju Bola Ahmed Tinubu is to pick a Muslim from the North as running mate.\nHe said Tinubu, as a Muslim minority from the South, cannot afford to pick a Christian minority from the North.\nA Muslim from the North will give Tinubu the required votes in the North,” he said.\nIf I am Bola Ahmed Tinubu whose wife is a senior pastor at a Pentecostal Church, I will go for a Muslim-Muslim ticket.\nBlueprint had reported that the PDP Deputy National Chairman (North) Umar Damagum-led committee Tuesday recommended and settled for Wike as Atiku’s running mate."
  },
  {
    "headline": "Safety Engineers call for establishment of Safety Commission",
    "summarized_story": "Emeka Samuel,UYOThe National Chairman of the Nigerian Institution of Safety Engineers (NISafetyE), Engr.\nAkaninyene Ekong has called on the States’ Houses of Assembly to enact a law for the establishment of Safety Commissions across all states in Nigeria.\nEkong made this call yesterday during the 2022 Annual Public Lecture on “Advancing Safety Engineering for Sustainable Development” organized for the Investiture of Engr.\nThe chairman tasked Safety practitioners and professional bodies to woo and lobby the political class in order to engender a robust and better safety culture in Nigeria through legislation in line wiith ILO guidelines.\nThe chairman called for synergy with the practitioners and developers in the building and environment industry, the political class and particularly, the legislators for the rebirth of a serene safety culture in Nigeria through the use of qualified Engineers in projects and the establishment of a safety regulatory agency, otherwise known as Safety Commission."
  },
  {
    "headline": "NAICOM urges PILA to deepen insurance penetration",
    "summarized_story": "Kehinde Ibrahim, LagosTHE National Insurance Commission (NAICOM) has urged the Professional Insurance Ladies Association (PILA) to use their position influence acceptance of insurance for better penetration and growth of the industry.\nSunday Thomas, commissioner for Insurance and CEO of NAICOM gave the advice during the investiture of Margaret Nkechi Moore as the 14th President of PILA held in Lagos.\nThomas said PILA as the foremost female professional body in Nigeria has over the years provided a forum for developing and promoting forthright professional insurance ladies, whose attributes would be the highest demonstration of empathy in relating with insurance policyholders.\nHe said increasingly, insurance is becoming accepted as a social intermediation, rather than a commercial concern and so requires that its offered and sold in that sense.\n“This administration shall key into this to ensure that it becomes a reality, up and running with well-established constitution for the growth and empowerment of African Insurance Women."
  },
  {
    "headline": "NEPC establshes Export Trade House in Egypt to diversify non Oil base",
    "summarized_story": "Eunice OrikeAdded to the responsibility in fulfillment of it’s mandate of promoting, developing and diversifying Nigeria’s non-oil export base, the Nigeria Export Promotion Council NEPC, has established an Export Trade House in Cairo, Egypt on a Public Private Partnership PPP, in partnership with a private firm.\nThe newly established Export Trade House is an initiative of the NEPC and Agriverdi Limited to have a central location where Made-in-Nigeria products can be shipped, displayed and distributed to different parts of the world.\nIn addition, the NEPC partner on the Export trade House in Cairo and Chief Executive Officer, Agranverdi Limited, Mousalati Ghazwan, said that the partnership would ensure there are no more defaults in payments for Nigerian products.\nHe also emphasised that the insurance industry as a business is not outside of the same pressures as businesses in other industry or sectors.\nHe reiterated NAICOM’s commitment to continuous development and growth of the Nigerian insurance sector thus, always prepared to collaborate with all stakeholders in promoting and entrenching good business strategies for sustainability of the Nigerian Insurance Industry."
  },
  {
    "headline": "FCMB provides 300,000 underbanked Nigerians with Microloans worth N40bn",
    "summarized_story": "Access to financial services enables prosperity and allows disadvantaged and vulnerable people to improve their lives, create wealth and reduce poverty.\nSo, we will continue championing and executing initiatives that deepen access to affordable and sustainable financial services in our local communities to empower individuals and businesses”.\nFCMB has invested in close to 10,000 agency bankers that bring financial services to the streets and doorsteps of millions of Nigerians in peri-urban and rural areas.\nThey are currently driving the onboarding and empowering of unbanked and under-banked Nigerians.\nBank accounts are now being opened through agency bankers by hitherto unbanked and underbanked citizens."
  },
  {
    "headline": "NASENI canvasses for Research, Devt for Nigeria’s industrialization",
    "summarized_story": "On what should be done, Haruna said that unless the Government pay more attention, and funding research deliberately towards the industrial and technological sector, the economy will continue to develop at a lower pace.\nThe EVC/CE of NASENI however commended the administration of President Muhammadu Buhari for unequalled commitment to shore up the Research and Development sector towards redirecting the nation’s economic direction from over dependence on importation, by putting homegrown industrialization on track in Nigeria.\nHe pointed out that the government of today is paying due attention to the development of Science and Technology sector generally by putting more funds in Infrastructure, training, capacity building and Research development “.\nHaruna listed sources of research and development funding in Nigeria to include the Central Bank of Nigeria CBN, Tetfund, Ecological Funds, PTDF and local content funding agency and NASENI.\nBesides, during the commissioning exercise, encomiums were showeredon Prof Haruna’s contributions to technology and technical education in the country, especially at the Kaduna Polytechnic and other tertiary institutions."
  },
  {
    "headline": "JUST IN: Atiku Announces Okowa As Running Mate",
    "summarized_story": "The presidential candidate of the Peoples Democratic Party in the 2023 elections, Atiku Abubakar, has announced Ifeanyi Okowa as his running mate.\nAtiku made the announcement at a meeting attended by PDP executives at the party’s headquarters in Abuja.\nPDP National Chairman, Iyorchia Ayu, said a 17-member committee had been set up by the party to pick a running mate.\nHe said the committee had submitted three names to Atiku to choose from.\nJUST IN: Okowa Arrives PDP Headquarters For Vice Presidential Screeninghttps://t.co/CABk10vho1 pic.twitter.com/8bPyNTlwcs — Channels Television (@channelstv) June 16, 2022Okowa and Rivers State Governor, Nyesom Wike, were among names being mentioned as prospective running mates to the PDP’s presidential candidate, Atiku Abubakar."
  },
  {
    "headline": "2023: PDP Did Not Rule Wike Out Of VP Race – Spokesperson",
    "summarized_story": "The Peoples Democratic Party has rejected reports that it has ruled out Rivers State Governor Nyesom Wike from becoming its Vice Presidential candidate in the 2023 elections.\n“The said misleading reports quoted the National Publicity Secretary of the PDP.\n“It is therefore mischievous to claim that the PDP National Publicity Secretary made any reference to Governor Wike.\n“The various positions creditably held by Governor Nyesom Wike distinguished him as an excellent team player in public governance.\n“The PDP urges Nigerians to disregard the mischievous reports aimed at undermining our Party’s unity at this critical time.”"
  },
  {
    "headline": "Technological Glitches Responsible For Non-Payment Of Pension – PTAD",
    "summarized_story": "﻿The Pension Transitional Arrangement Directorate (PTAD) on Thursday said technological glitches are responsible for the non-payment of pension to retired federal civil servants in Lagos.\nExecutive Secretary of PTAD, Dr Chioma Ejikeme, speaking on Channels Television’s Sunrise Daily said her agency was working on resolving the delayed payments.\nIn a week, you will get four to five obituaries.”But Dr Ejikeme was insistent that it wasn’t the fault of PTAD, but the Office of the Accountant-General of the Federation.\n“If he (Abiodun Michael) says 18,000 pensioners have not been paid, it means that PTAD has a bias for Lagos state pensioners.\nIt is within the domain of the technology that is domiciled within the Office of the Accountant-General of the Federation.”"
  },
  {
    "headline": "Ekiti Guber Candidates Sign Peace Accord Ahead Of Poll",
    "summarized_story": "Candidates in the Ekiti State governorship election on Wednesday signed a Peace Accord ahead of the poll billed for Saturday.\nelection in November 2021, political parties & candidates have signed the Peace Accord under the auspices of the National Peace Committee,” he said in a statement.\n“The intervention of the Peace Committee no doubt contributed in no small way to the peaceful conduct of previous Governorship elections.\n“The truth is that the Peace Accord is not an automated, self-actualising process.\n“The success of the Peace Accord rests on three pedestals: the political actors, INEC, and security agencies."
  },
  {
    "headline": "Court Arraigns Former Chief Of Staff To Matawalle, Four Others",
    "summarized_story": "The former Deputy Chief of Staff To Governor Bello Matawalle of Zamfara State, Bashir Mohammed Maru, and four others have been arraigned in the Chief Magistrate Court 1 Gusau, the State capital over the misappropriation of an official Hilux vehicle.\nThe five accused persons were arraigned in court on two-count bothering criminal conspiracy and misappropriation of an official Hilux vehicle issued to the former Deputy Chief of Staff, Bashir Mohammad Maru.\nThose who were charged to court with the Deputy Chief of Staff were Isah Usman, Shuiabu Musa, Yusuf Bello, and Mallam Yazid.\nHowever, the first accused person, Isah Jabir Usman, and the second accused person, Shuiabu Musa were brought to court but the three other Suspects including Bashir Maru are still at large.\nCounsel to the second accused person aligned himself with all the submissions of the counsel to the first accused Person and adopt the same."
  },
  {
    "headline": "YIAGA Africa asks INEC to publish number of PVCs collected in Ekiti",
    "summarized_story": "The Youth Initiative for Advocacy, Growth and Advancement (YIAGA) has commended the Independent National Electoral Commission for taking the storage of sensitive materials away from the central bank of Nigeria.\nThe organisation gave the commendation at a Press Briefing on Ekiti State governorship Election in Ado-Ekiti on Thursday,YIAGA however expressed pessimism that there might be low turn out of Voters during the election.\nThe election observer and monitoring group also requests INEC to publish number of PVCs collected in the Ekiti State ahead of the election to enhance transparency.\nIt added that the election will be determined by 9833,923 registered voters comprises of 51% women with 38.56% of them as youths (18-34 years)."
  },
  {
    "headline": "Oyo Assembly files impeachment notice against Deputy Governor -",
    "summarized_story": "The Oyo State House Assembly has filed an impeachment notice against the Deputy Governor of Oyo State, Rauf Olaniyan.\nTVC News gathered that the process may be concluded at their next sitting which may result in the impeachment of the deputy governor.\nThe Oyo state Deputy Governor had few weeks ago defected from the Peoples’Democratic Party to the All Progressives CongressThe petition reads,PETITION AND NOTICE OF ALLEGATION OF THE DEPUTY GOVERNOR OF OYO STATE, HIS EXCELLENCY ENGINEER RAUF OLANIYANRT.HON.\nSPEAKER SIR,Consequent upon listed below, we the under listed elected Honourable members of the 9th assembly hereby allege the Deputy Governor of Oyo State, His Excellency Eng.\nThere has been no love lost between the Governor Seyi Makinde and his Deputy Engineer Rauf Aderemi Olaniyan since the electiobn that brought the duo in as Governor and Deputy in 2019 with rumours of Impeachment moves against the deputy Governor by loyalists of the Governor rife especially during the lockdown ocassioned by the Covid-19 Pandemic."
  },
  {
    "headline": "House Moves to override President on Section (4) of Electoral Act -",
    "summarized_story": "The House of Representatives has commnced moves to override President Muhammadu Buhari on the amended Section 84 (4) of the Electoral Act on statutory delegates.\nHe rises to express his heartfelt sadness over the developmentAlso rising on a point of order, Delta State lawmaker, Ben Igbakpa, says the 30-day window for the President to sign the latest amendment to the Electoral Act has lapsed.\nIt will be recalled that the President, Muhammadu Buhari, had refused assent to an amended version of the Electoral Act a few days to the Start of Party Primaries.\nDespite pressure and against the e3xpectation of many, the President refused assent.\nThe primaries at all levels by political parties led to the loss of so many heavyweights especially within the National Assembly."
  },
  {
    "headline": "Abducted Kwara Bishop, wife, driver regain freedom",
    "summarized_story": "Oyo state Police Command has confirmed the release of the abducted Bishop of Jebba Anglican Diocese, Bishop Rev.\nAderogba Adeyinka who was allegedly abducted with his wife and his driver while traveling along the New Oyo/Ogbomosho Expressway.\nA press statement issued by the Oyo state Police command Spokesperson, Wale Osifeso revealed that the Cleric regained freedom alongside his wife and his driver.\nAccording to him, the Abducted Bishop Rt.\nRev Aderogba Adeyinka of Jebba Anglican Diocese regained his freedom unhurt alongside his wife and driver around 1820HRS today, Tuesday 14/06/2022."
  },
  {
    "headline": "Nigeria: PDP Presidential Candidate Atiku Chooses Delta Governor Okowa as Running Mate",
    "summarized_story": "Atiku Abubakar, presidential candidate of the Peoples Democratic Party (PDP), has chosen Ifeanyi Okowa, governor of Delta state, as his running mate.\nThe national working committee (NWC) of the PDP had on Wednesday endorsed Nyesom Wike, governor of Rivers, as Atiku’s running mate.\nHowever, Atiku was said to be ill at ease with Wike as his running mate because he believes the governor does not like him.\nWike worked for Aminu Waziri Tambuwal in the 2019 presidential primary election, though Atiku still won the ticket.\nSome top guns in the PDP were also said to be uncomfortable with Wike as Atiku’s running mate “because the VP is just a heartbeat away from being the president”."
  },
  {
    "headline": "Ukraine Pleads for More Weapons as European Leaders Head for Kyiv",
    "summarized_story": "Major-General Dmytro Marchenko, who leads Ukraine’s forces in Mykolaiv, said his troops could achieve victory over Russia if they are given the right weapons.\nKherson fell to Russian forces in March, soon after Moscow invaded on Feb. 24 in what it describes as a “special military operation” to disarm and “denazify” Ukraine.\nIt accused Ukraine’s forces of disrupting that plan and using civilians as human shields, which Kyiv denies.\nBritish military intelligence said that with all main bridges destroyed, Russian forces would have to conduct a “contested” crossing of the river.\nWeapons provisions are likely to dominate discussions during Friday’s visit to Kyiv by leaders of the European Union’s three biggest countries."
  },
  {
    "headline": "After Nigeria Is Removed from List of Piracy Hotspot, ECOWAS Says It’s Winning War on Maritime Insecurity",
    "summarized_story": "The President of the Economic Community of West African States (ECOWAS) Commission, Jean-Claude Brou has said the war against maritime insecurity was being won in the West African sub-region.\nHe also argued that the victory against maritime insecurity could also be seen with the decreasing rate of attack in the Gulf of Guinea following actions by member countries.\nHe said: “A year ago, I told you that the maritime insecurity in the Gulf of Guinea was extremely disturbing and globally we were the zone having the largest number of maritime piracy attacks.\nThe ECOWAS Commission’s President said just like how maritime insecurity was addressed, early warning mechanisms among other initiatives would be emplaced to tackle the menace of terrorism.\n“It comes to strengthen the various actions carried out in the various countries above all it comes to fight insecurity."
  },
  {
    "headline": "Worsening Insecurity in Nigeria Worries IMF",
    "summarized_story": "The International Monetary Fund (IMF) has expressed concern over the deteriorating level of security conditions in Nigeria, stressing that it was contributing to the subdued Gross Domestic Product (GDP) figures in the country.\nThe Washington-based institution made these known in an end-of-mission statement on Wednesday, at the end of its staff visit with Nigeria.\n“To contain inflationary pressures, the Central Bank of Nigeria has recently hiked its monetary policy rate by 150 basis points to 13 per cent.\n“Regarding the economic outlook, GDP growth is projected at 3.4 percent (y/y) in 2022 while inflation is expected to remain elevated .\n“The IMF mission would like to thank the authorities and other counterparts for the open and thoughtful discussions and excellent cooperation,” it added."
  },
  {
    "headline": "African Youth the Catalytic Force to Propel AfCFTA, Says Afreximbank Boss, Hails Dangote and Elumelu",
    "summarized_story": "The President of the African Export and Import Bank (Afreximbank), Prof. Okey Oramah has identified African youths as the catalytic force that would propel the realisation of the African Continental Free Trade Area (AfCFTA) initiative.\n“We are happy that the protocol on the youth will be negotiated under the AfCFTA.\nHe said: “The African youths are beginning to make significant contributions to economic transformation across the continent.\n“It was a young Tony Elumelu who transformed an ailing commercial bank into an African multinational financial institution.\n“Many African youths who are talented are making the waves around the world."
  }
]