[
  {
    "headline": "Retirees to enjoy health insurance scheme – PTAD",
    "summarized_story": "The Pension Transitional Arrangement Directorate on Friday said that it was working to provide a health insurance package for senior citizens.\nEjikeme said to ensure that senior citizens were included in the national health insurance scheme, the Federal Ministry of Health had established a ministerial committee to look into the issue.\nShe also said PTAD and representatives of the Nigerian Union of Pensioners were members of the committee.\nI am talking about monthly pension because our monthly pension now is over N9bn.\nShe added, “We are consequently in collaboration with some of our stakeholders, including the National Health Insurance Scheme, the National Senior Citizens Centre, and Federal Ministry of Health to see how making health insurance available to our pensioners can be a reality.”Copyright PUNCH."
  },
  {
    "headline": "Killings: Plateau monarch escapes as youths vandalise palace",
    "summarized_story": "A traditional ruler in Plateau State, His Royal Highness, The Bra Ngwe Irigwe, Rt.\nHis palace in Miango community, Bassa Local Government Area of the state was however vandalised by the angry youths.\nAka, an octogenarian, is the paramount of ruler of the Irigwe ethnic nationality in Bassa LGA, where suspected terrorists had killed several people and destroyed property.\nThe President of the Irigwe Youth Development Association, Ezekiel Bini, confirmed the development to Saturday PUNCH in Jos on Friday.\nThe military task force in charge of maintaining peace in the state, Operation Safe Haven, also confirmed the attack on the palace of the traditional ruler in a statement on Friday."
  },
  {
    "headline": "Job seeker’snmurder : Withdrawal of defence Lawyer from case stalls hearing",
    "summarized_story": "By Chioma Onuegbu, UyoTHE ongoing hearing on the trial of Uduak-Abasi Akpan, his father, and sister for the alleged murder of job seeker, late Iniubong Umoren was stalled yesterday, following the withdrawal of Counsel to the second and third accused persons from the case.\nDuring the court proceeding, Counsel to the first accused person, and Coordinator, Akwa Ibom State Legal Aid Council, Samson Adula, assured the court that through his office, he would contact another Lawyer to represent the two accused persons.\nThe trial Judge, Justice Bassey Nkanang therefore urged Mr. Frank Akpan, second accused person to liaise with Samson Adula to connect him and his daughter to another Lawyer.\nI have my own way of putting up my defence, he (Ekongson) has his own way.\nWe will contact a couple of them and anybody that is ready to handle this case, we will assign the person to come in and conclude the defence of the second and third accused persons”"
  },
  {
    "headline": "Gunmen kidnap 4 FULafia students",
    "summarized_story": "By David Odama – LafiaUnknown gunmen Thursday night kidnapped four students of the Federal University Lafia, Nasarawa State.\nHead, Information and Publicity of the university, Abubakar Ibrahim in a statement in Lafia, said the students were abducted in Mararaba axis of Lafia.\nAccording to the statement, the Vice-Chancellor of the University, Professor Shehu Abdul Rahman condemned the abduction of the students in strong terms and seeks for the immediate release of the students.\nAbubakar Ibrahim pointed out that the Vice-chancellor also expressed concern that the kidnap of the students had constituted serious threats to education in Nasarawa State in particular and Nigeria in general.\nMeanwhile, Nasarawa State Police Public Relations Officer ASP Ramhan Nansel who confirmed the incident said details about the kidnap students were still sketchy."
  },
  {
    "headline": "Armed Forces Remembrance Day: FG closes Abuja roads",
    "summarized_story": "By Dirisu YakubuIn commemoration of the 2022 Armed Forces Remembrance Day celebration, the federal government has ordered the closure of parts of the roads accessing the arcade of the federal secretariat complexes and the Ministry of Foreign Affairs in Abuja.\nHead of Civil Service of the Federation, Dr. Folasade Yemi-Esan in a circular numbered HCSF/PS/SWO/007/iv/552, informed the Ministries, Departments and Agencies, MDAs, and the general public of the closure yesterday by 2.00pm prompt.\nThe circular was signed by the Permanent Secretary, Service Welfare Office, Office of the Head of the Civil Service of the Federation, Dr. Ngozi Onwudiwe, on behalf of the Head of Service of the Federation.\n“This event which involves the wreath laying ceremony by President Muhammadu Buhari, accompanied by top government officials and members of the Diplomatic Corps will hold on Saturday 15 January at the National Arcade, Abuja.\n“To this end, all offices within the Federal Secretariat Complex are to be vacated at 2.00pm on Friday, 14th January,” the statement read in part."
  },
  {
    "headline": "Sen Ndume denies Boko Haram attack on Police Training Facility in Gwoza community",
    "summarized_story": "Recalled that some unconfirmed reports revealed that armed Boko Haram sect invaded Limankara village which is about 20km drive south of Gwoza town and kidnapped unspecified number of police officer on training.\nI will describe the reports as untrue and baseless.\n“I have been receiving daily update on the efforts troops are doing to safeguard Limankara and other communities in Gwoza, and I am much impressed.\n“The troops in Limankara are not only stationed in one place, we have them at the deserted Police Mobile Training School, some hills around those axis with sophisticated surveillance cameras and equipments to spot terrorsists’ movement.\nHe therefore called on the media practitioners to always verify their own reports before going to press, especially the ones which concerns security of lives and property."
  },
  {
    "headline": "Twitter: APC govt should apologize to Nigerians for infringing on their rights -Reps’ minority caucus",
    "summarized_story": "The charge was contained in a statement by the minority leader of the House, Hon.\n“Our caucus holds that the declaration of a lift on the ban on Twitter amounts to regulatory approval on freedom of speech, which is completely unknown to our laws.\nThe APC government should rather be apologizing to Nigerians for infringing on their rights as well as for the huge economic losses recorded as a result of the ban.\n“The Minority Caucus insists that instead of seeking to suppress free speech in our country, the APC government should be open to the views of Nigerians and make adjustments for the good of the nation.\n*Our Caucus commends Nigerians for their resilience, innovations and resistance to suppression by the APC government and assures that the caucus will never relent in fighting for the rights of the people at all times.”Vanguard News Nigeria"
  },
  {
    "headline": "Stop establishing universities you can’t fund – SSANU to governors",
    "summarized_story": "The Senior Staff Association of Nigerian Universities (SSANU) has cautioned governors against politicizing education.\nThe North East Zone told them to stop establishing universities they cannot fund.\n“The neglect and poor funding of universities by some governors to the detriment of teaching and research is a matter that requires urgent attention”, it read.\nSSANU lamented that non-teaching units in schools are being usurped by teaching staff in violation of condition of service and establishment procedures.\n“We are against the forceful retirement of our members at the age of 60 in violation of the 65 years agreement in state universities,” the communique added."
  },
  {
    "headline": "Gov Ortom sympathizes with Paul Unongo over wife’s death",
    "summarized_story": "Benue State Governor, Samuel Ortom, has expressed shock over the sudden death of the wife of one time Minister of Steel Development, Paul Unongo, Mrs Comfort Nguumbur Unongo.\nLate Mrs Nguumbur Unongo was aged 54 years and died at Daisyland Hospital Jos, Plateau State.\nAccording to the Governor, “I was shocked when I heard of the death of your beloved wife, Mrs Comfort Nguumbur Unongo.\nThis is indeed sad and painful.\nHe also prayed that the foremost political leader take solace in the fact that his wife lived an accomplished lifestyle towards everyone that came in contact with her and will be greatly missed."
  },
  {
    "headline": "Amotekun arrestes 17 northerners with 35 dogs, charms, cutlasses in Ondo [PHOTOS]",
    "summarized_story": "No fewer than 17 middle-aged men from the northern part of the country who arrived in Ondo State with 35 dogs, charms and cutlasses have been apprehended.\nThe northerners who stormed Okititpupa town, headquarters of Okitipupa Local Government Area of the state were arrested after failing to disclose their mission in the state.\nFollowing the arrival in the state, the residents of Okitipupa raised the alarm as their movement within the town became suspicious.\nAll attempts to reach the person they claimed to work for have not yielded any result till date.\nThey claimed they were dropped in Okitipupa by a vehicle and that the vehicle had left."
  },
  {
    "headline": "IGP decorates new DIGs, AIGs, CPs, others",
    "summarized_story": "The Inspector-General of Police (IGP), Alkali Baba Usman, on Friday, decorated twenty-five newly-promoted Senior Police Officers at the Goodluck Jonathan Peacekeeping Centre, Force Headquarters, Abuja.\nThe Senior Officers included Deputy Inspector-General of Police Zaki Ahmed, the DIG in charge of the Department of Operations and Deputy Inspector-General of Police, Johnson Babatunde Kokumo, the DIG in charge of the Department of Research and Planning at the Force Headquarters.\nAlso decorated were six (6) Assistant Inspectors-General of Police who were elevated from their previous rank of Commissioners of Police.\nThey include AIG Buba Sanusi (former CP Katsina), AIG Mohammed Ndatsu Aliyu (former CP Anti-Fraud, FCID), AIG Bello Sani Dalijan (former CP INEC), AIG Yahaya Sahabo Abubakar (former CP Yobe), AIG Akingbola Olatunji, (former CP Benue), and AIG Hakeem Odumosu, (former CP Lagos).\nThe seventeen (17) Commissioners of Police who were elevated from their previous rank of Deputy Commissioners of Police included CP Josephine Nneka Anyasinti, CP Haruna Gabriel Garba, CP Tajudeen Akinwale Abass and most significantly, the husband-and-wife duo of CP Patrick Kehinde Longe and CP Yetunde Longe."
  },
  {
    "headline": "Gunmen invade Federal University in Nasarawa, kidnap 4 students",
    "summarized_story": "Gunmen suspected to be bandits have abducted some students of Federal University of Lafia, Nasarawa State.\nIt was learnt that the students were abducted by the gunmen at the university community in Mararaba campus.\nConfirming the incident, the University’s Public Relation Officer, Abubakar Ibrahim, revealed that four students were abducted.\nHe said that the gunmen attacked the university at about 11:30 pm on Thursday and whisked the students to an undisclosed location.\n“The Vice-Chancellor, who has since visited the area where the students were abducted, also visited the Nasarawa Police command where he formally notified the commissioner of Police about the abduction of the students,” the statement added."
  },
  {
    "headline": "Youths are Nigeria’s most valued assets, says Osinbajo",
    "summarized_story": "Describing the youth as Nigeria’s most valued assets, Osinbajo said the Federal Government valued their contributions to national development, adding that the Muhammadu Buhari administration is doing everything it can to encourage their creativity.\nOsinbajo said: “As part of the requirements for achieving the Gold Award, they undertook shared purposeful experiences with people who are not their usual companions in a residential setting.\n“We have seen how young Nigerians rallied in the wake of the COVID-19 pandemic and designed various technology solutions to support the government.\n“We’ve seen young Nigerians break new ground and earn global acclaim in innovation, in technology, in sports and the arts and entertainment.\nHe said the programme had produced more than a million young participants globally, mentored through the process by more than 200,000 adults."
  },
  {
    "headline": "Family returns N11m unearned pay of deceased Yobe civil servant",
    "summarized_story": "The family of a deceased civil servant in Yobe State, Alhaji Baba Aji Mamman, has fulfilled his last wish by returning to the state government the sum of N11 million reckoned as his unearned salaries.\nMamman, who died on March 28, 2020, was before his death an official of Yobe Rural Electrification Board in Damaturu, the state capital.\nLess than two years after his death, the family said they have fulfilled Mamman’s last wish by returning N11 million to the Yobe State Government coffers in Access Bank.\nBabagana Baba Aji, who signed the advert in Daily Trust, sought forgiveness for Mamman from the general public and the Rural Electrification Board.\n“May Almighty Allah give you all the hearts to forgive and pray for his eternal rest in Aljanna Firdausi inShaaAllah."
  },
  {
    "headline": "Tinubu seizes bull by the horn",
    "summarized_story": "In his interview with State House correspondents, Tinubu said it has been his life-long ambition to serve the country as president.\nIn the words of Majority Leader of the Lagos State House of Assembly, Hon.\n”He equally shrugged off the question about him and his age-long political protégé, Vice President Yemi Osinbajo, possibly battling for the APC presidential ticket, by saying “I don’t want to discuss individuals now.\nI’ve done that before in Lagos State.\nIn a ready counter, a social media group under the auspices of the Tinubu Defenders, says the only way to repay Tinubu for his sacrifices for the country is to hand him the APC ticket."
  },
  {
    "headline": "2023: Southern, Middle Belt leaders insist on zoning",
    "summarized_story": "Leaders of thought from the Southern and Middle Belt zones of the country have taken a stand on where the country’s next president should come from.\nAccording to the leaders, the next president should be produced by the southern region of the country.\nThe decision was contained in a communique issued at the end of a meeting of the Southern and Middle Belt Leaders Forum held on Thursday and chaired by Chief Edwin Clark.\nTherefore, unequivocally, and in full resolve, call on all political parties in the country to find their presidential ticket to the south.\nAdvices that any political party that does not zone its presidential ticket to the South should not expect support from the four regions.”"
  },
  {
    "headline": "TRENDING: Meet couple who joined Police, became Commissioners ‘same day’",
    "summarized_story": "The couple were among those promoted by the Police Service alongside 15 other Commissioners of Police.\nYetunde once headed the Lagos State Criminal Intelligence Investigation Department (SCIID) Panti, Yaba.\nUnder her watch as Officer-in-charge of Lagos SCID, the department also prosecuted hundreds of crime suspects and ensured culprits were brought to justice.\nShe attended Lagos Anglican Girls School, Broad Street, Lagos as well as Lagos Anglican Girls Grammar School, Surulere, Lagos.\nHer husband, Kehinde while he was an Assistant Commissioner of Police, was the Commander of Area ‘H’ Police Area Command (Lagos State Police Command)."
  },
  {
    "headline": "Crisis brews in Abia PDP over Ikpeazu’s alleged support for Ngwa successor",
    "summarized_story": "Governor Ikpeazu is from Obingwa Local Government Area, one of six councils that make up Ngwaland in Abia South senatorial district.\nAbia South senatorial district has six local government areas, with three from the Ngwaland and three from the Umuahia area of the state.\nThere’s currently contention as to where power will rotate in Abia State in the next governorship election.\nHe was succeeded by Theodore Orji, from Abia Central, whoruled for eight years (2007- 2015).\nMeanwhile, politicians from Abia North in PDP are galvanising support to bid for the governorship."
  },
  {
    "headline": "Customs stray bullet kills 2-year-old girl in Ogun",
    "summarized_story": "Laide Raheem, AbeokutaOfficers of the Nigeria Customs Service (NCS) have reportedly shot dead a two-year-old girl in Ogun State.\nThe incident, it was gathered occurred on Thursday at Itawaya, near the Federal Polytechnic, Ilaro, Yewa South Local Government Area of Ogun.\nSources informed that a customs officer had opened fire while chasing a man suspected to be conveying foreign rice.\n“Those customs officers thought the was smuggling rice, so they opened fire on him.\nWhen contacted, the NCS spokesperson in Ogun 1 Area command, Ahmed Oloyede, confirmed the incident, describing it as highly devastating."
  },
  {
    "headline": "2023 presidency: Why I’m yet to join presidential race –Orji Kalu",
    "summarized_story": "By Wilfred EyaSenate Chief Whip and Former governor of Abia State, Dr Orji Uzor Kalu has given reasons why he is hesitant to declare for the 2023 presidential race.\nPresident Buhari cannot do everything in one day.\nI am going to be 62 years old on April 21 and President Buhari is my father.\nWhat is happening in Nigeria is that every president, governor, minister, commissioner, whoever he succeeds would be his enemy.\nSo, I believe in what President Buhari said."
  },
  {
    "headline": "NLNG crashes cooking gas price, approves 100% production into domestic market",
    "summarized_story": "The development may not be unconnected with strong calls and appeals from stakeholders in the gas sector that NLNG increase its supply of LPG into the domestic market which they claim accounts for about 65 per cent.\nThey argued that the shortfall of 35 per cent is sourced from imports which comes at a premium due to the imposition of Value Added Tax of 7.5 per cent among other added cost, leading to a sharp rise in cooking gas price.\nConsumers of cooking gas had in the last five months contended with the escalating price of the product, forcing many to resort to the use of dirty fuels which included; charcoal, firewood, Kerosene among others.\nNLNG explained that these initiatives are designed to increase LPG availability in Nigeria, diversifying its uses and support the Federal Government’s Decade of Gas initiative.\nNLNG is currently the highest single supplier of LPG into the domestic market, with an estimated 400,000 metric tonnes supplied in 2021."
  },
  {
    "headline": "Buhari leads Sanwo-Olu, Abiodun, others to visit Shonekan’s family",
    "summarized_story": "By Lukman OlabiyiPresident Muhammadu Buhari, yesterday, led Lagos State Governor, Babajide Sanwo-Olu, his Ogun and Yobe states counterparts, Dapo Abiodun and Mai Mala Buni, to visit the Lagos residence of the head of Interim National Government during the annulled June 12, 1993 presidential election, the late Ernest Shonekan.\nPresident Buhari and his entourage, who arrived at Shonekan’s house, Lugard Avenue at about 4:40pm were received by members of the late Shonekan family.\nBuhari, who was on a one-day presidential visit to Ogun State to commission some projects by the Governor Abiodun’s administration, stopped over in Lagos on his way to Abuja and spent some time to commiserate with the Shonekan family.\nHe said the late elder statesman did his best for the country in contributing to the growth and development of Nigeria.\nThe governor also praised Shonekan’s contributions to the economy of Nigeria as boardroom guru and employer of labour, especially during his tenure as the chairman and managing director of the United Africa Company."
  },
  {
    "headline": "Breaking: Again, Australia Revokes Novak Djokovic’s Visa",
    "summarized_story": "Australia has revoked tennis star Novak Djokovic’s visa for a second time in a row over his right to remain in the country unvaccinated.\nThe decision on “health and good order” grounds means he could be deported and get a three-year visa ban.\nThe men’s tennis number one was scheduled to play in the Australian Open, which begins on Monday.\nFor the moment, Djokovic remains in the Australian Open draw and is due to face fellow Serb Miomir Kecmanovic early next week.\nBut on Friday evening in Melbourne, Mr Hawke cancelled Djokovic’s visa under separate powers in Australia’s Migration Act."
  },
  {
    "headline": "Buhari: Abiodun Worthy Example of Promises Made, Promises Kept",
    "summarized_story": "Describing Abiodun as the “Performing Governor of Nigeria’s Gateway State,” the president maintained that the governor was a worthy example of promise made, promises kept.\n“This has made Ogun State one of the safest and most peaceful states in the country and investors’ destination of choice,” Buhari stated.\n“I am particularly impressed by the quality and standard of your road projects, and the creative way you have deployed resources to reconstruct and rehabilitate them.\nIt is significant to note that the two road projects being commissioned today are federal roads.\nThe president was received by Abiodun and five other governors, namely, Governor Babajide Sanwo-Olu of Lagos; Yobe State Governor, Mai Mala Buni; Ekiti State Governor, Dr. Kayode Fayemi; Osun State Governor, Alhaji Gboyega Oyetola; Governor Rotimi Akeredolu of Ondo State, and the representative of Oyo State Governor, Mr. Rauf Olaniyan."
  },
  {
    "headline": "We’re Tackling Mutant Polio Virus Type2 Outbreak, Says FG",
    "summarized_story": "Onyebuchi Ezigbo in AbujaThe federal government yesterday said it was working with development partners to address cases of circulating mutant polio virus Type2 (cMPV2) found in some parts of the country.\nIt blamed the cases of polio outbreak on disruptions to routine immunisation due to the COVID-19 pandemic.\nEfforts are also being ramped up to increase routine immunisation coverage beyond pre-COVID values,” he said.\nHe said, “For the avoidance of doubt, no case of Wild Polio Virus (WPV) has been reported anywhere in the country since the last case in 2016.\n“NPHCDA assures Nigerians that the agency and partners will continue to conduct surveillance and vaccination campaigns to prevent and contain any possible importation of the Wild Polio Virus into the country."
  },
  {
    "headline": "Emefiele: Pan-African Settlement Platform Will Reduce Dollar, Other FX Usage in Africa",
    "summarized_story": "PAPSS is a cross-border financial market infrastructure enabling payment transactions across Africa, bridging trade challenges in a continent with over 41 known currencies.\nIt is expected to boost intra-African trade by transforming and facilitating payment, clearing and settlement for cross-border trade across Africa.\nPAPSS provides the solution to the disconnected and fragmented nature of payment and settlement systems that had long impeded intra-African trade.\n“Prior to the launch of PAPSS, settlements for intra Africa trade required a third currency and a non-African correspondent bank.\n“The launch of PAPPS gives the fresh opportunity and aspiration for the African continent."
  },
  {
    "headline": "Anambra Governor-elect, Soludo, Appoints Ezekwesili as Head of Transition Committee",
    "summarized_story": "David-Chyddy Eleke in AwkaThe governor-elect of Anambra State, Prof. Chukwuma Soludo, has released a list of people to midwife his swearing-in as governor of Anambra State on 17 March.\nThe list, which was released to THISDAY by Soludo’s media aide, Joe Anatume, comprised 80 members with prominent Nigerians who will play diverse roles.\nThe former Minister of Education, Oby Ezekwesili, will head the committee, while Prof. Benedict Oramah, Prof. Pat Utomi and Mr Osita Chidika are members of the committee.\n“This is to announce the constitution of a Transition Committee which will liaise with a team set up by the government of Anambra State to ensure a seamless transition from the Governor Willie Obiano’s administration to a Chukwuma Charles Soludo-led administration as from 17th March, 2022.\n“Members are expected to arrive on Wednesday, 19th while the inauguration and first plenary sessions start on the 20th."
  },
  {
    "headline": "BREAKING: Many Feared Dead, Houses On Fire As Boko Haram Fighters Attack Chibok",
    "summarized_story": "Many residents of Kautikari, a town in Chibok Local Government Area of Borno State, have been feared dead after militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province attacked the community.\nA resident told SaharaReporters that the terrorists, who came in no fewer than 10 gun trucks, stormed the community around 8:00pm on Friday and immediately began to set houses ablaze.\n“They are burning many houses as we speak and it is night, you should know the terrain of this place.\nMost of the villagers have run into the bush,” the resident told SaharaReporters on phone.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new leader of ISWAP in Lake Chad."
  },
  {
    "headline": "BREAKING: Many Feared Dead, Houses On Fire As Boko Haram Fighters Attack Chibok",
    "summarized_story": "Many residents of Kautikari, a town in Chibok Local Government Area of Borno State, have been feared dead after militants from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province attacked the community.\nA resident told SaharaReporters that the terrorists, who came in no fewer than 10 gun trucks, stormed the community around 8:00pm on Friday and immediately began to set houses ablaze.\n“They are burning many houses as we speak and it is night, you should know the terrain of this place.\nMost of the villagers have run into the bush,” the resident told SaharaReporters on phone.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new leader of ISWAP in Lake Chad."
  },
  {
    "headline": "EXCLUSIVE: Police Arrest Ex-Sokoto Governor, Bafarawa’s Nephew For Supplying Weapons, Military Kits To Bandits",
    "summarized_story": "The Nigeria Police Force has arrested and detained a nephew of Alhaji Attahiru Bafarawa, former governor of Sokoto State who was supplying arms, ammunition, and military kits to bandits in Zamfara State, SaharaReporters has gathered.\nSources told SaharaReporters that Bafarawa, who has been uneasy with the arrest of his relation, has been putting pressure on the police for Kamarawa’s release.\nHe was however told the suspect could not be released as Governor Bello Matawalle of Zamfara State was involved and ready to report to President Muhammadu Buhari.\n“This is a relative of the former Governor of Sokoto, Attahiru Bafarawa caught by security agents as arms and military kits’ suppliers to bandits,” a police source said.\nAfterward I got admitted to study for my degree at Usman Danfodiyyo University, Sokoto State.”"
  },
  {
    "headline": "EXCLUSIVE: Police Arrest Ex-Sokoto Governor, Bafarawa’s Nephew For Supplying Weapons, Military Kits To Bandits",
    "summarized_story": "The Nigeria Police Force has arrested and detained a nephew of Alhaji Attahiru Bafarawa, former governor of Sokoto State who was supplying arms, ammunition, and military kits to bandits in Zamfara State, SaharaReporters has gathered.\nSources told SaharaReporters that Bafarawa, who has been uneasy with the arrest of his relation, has been putting pressure on the police for Kamarawa’s release.\nHe was however told the suspect could not be released as Governor Bello Matawalle of Zamfara State was involved and ready to report to President Muhammadu Buhari.\n“This is a relative of the former Governor of Sokoto, Attahiru Bafarawa caught by security agents as arms and military kits’ suppliers to bandits,” a police source said.\nAfterward I got admitted to study for my degree at Usman Danfodiyyo University, Sokoto State.”"
  },
  {
    "headline": "EXCLUSIVE: Police Arrest Ex-Sokoto Governor, Bafarawa’s Nephew For Supplying Weapons, Military Kits To Bandits",
    "summarized_story": "The Nigeria Police Force has arrested and detained a nephew of Alhaji Attahiru Bafarawa, former governor of Sokoto State who was supplying arms, ammunition, and military kits to bandits in Zamfara State, SaharaReporters has gathered.\nSources told SaharaReporters that Bafarawa, who has been uneasy with the arrest of his relation, has been putting pressure on the police for Kamarawa’s release.\nHe was however told the suspect could not be released as Governor Bello Matawalle of Zamfara State was involved and ready to report to President Muhammadu Buhari.\n“This is a relative of the former Governor of Sokoto, Attahiru Bafarawa caught by security agents as arms and military kits’ suppliers to bandits,” a police source said.\nAfterward I got admitted to study for my degree at Usman Danfodiyyo University, Sokoto State.”"
  },
  {
    "headline": "Buhari: Nigerians should assess us fairly... we're doing our best on insecurity",
    "summarized_story": "President Muhammadu Buhari has asked Nigerians to be fair in assessing how his administration has handled security challenges.\nBuhari spoke on Friday when Tidjani Ali Bin Arabi, grand Khalifa of the Tijjaniyya Islamic Movement world-wide, visited him at the state house.\n“I hope God will listen to our prayers.”The president thanked Ganduje for bringing the grand Khalifa to Nigeria.\n“Specifically, Kano state government invited the Grand Khalifa to come to Kano and develop a good relationship between Algeria and the city of Kano,” Ganduje said.\nAccording to him, most of the almajiri children are not indigenes of Kano state but as Nigerians, they are free to live anywhere in this country."
  },
  {
    "headline": "Buhari: Nigerians should assess us fairly... we're doing our best on insecurity",
    "summarized_story": "President Muhammadu Buhari has asked Nigerians to be fair in assessing how his administration has handled security challenges.\nBuhari spoke on Friday when Tidjani Ali Bin Arabi, grand Khalifa of the Tijjaniyya Islamic Movement world-wide, visited him at the state house.\n“I hope God will listen to our prayers.”The president thanked Ganduje for bringing the grand Khalifa to Nigeria.\n“Specifically, Kano state government invited the Grand Khalifa to come to Kano and develop a good relationship between Algeria and the city of Kano,” Ganduje said.\nAccording to him, most of the almajiri children are not indigenes of Kano state but as Nigerians, they are free to live anywhere in this country."
  },
  {
    "headline": "'Four killed, girls abducted' as insurgents attack community in Chibok",
    "summarized_story": "According to residents, the insurgents invaded the area around 5pm on Friday with different of weapons and started shooting sporadically.\nSome of the villagers who spoke to TheCable said the insurgents set houses ablaze, and residents had to run to the bushes for safety.\n“They first went to the market area as today is our market day, and they looted almost everything,” one of the villagers said.\nAlthough the village is about 17 kilometres away from the army brigade headquarters in Chibok, TheCable understands that there is an army company under the 117 battalion stationed in Kwada, not too far from the scene of the attack.\nThe development comes months after Dzarma Zirkushu, a brigadier-general and commander of the 28 task force brigade was killed, alongside three soldiers, in an ambush in Askira, also in Borno."
  },
  {
    "headline": "'Four killed, girls abducted' as insurgents attack community in Chibok",
    "summarized_story": "According to residents, the insurgents invaded the area around 5pm on Friday with different of weapons and started shooting sporadically.\nSome of the villagers who spoke to TheCable said the insurgents set houses ablaze, and residents had to run to the bushes for safety.\n“They first went to the market area as today is our market day, and they looted almost everything,” one of the villagers said.\nAlthough the village is about 17 kilometres away from the army brigade headquarters in Chibok, TheCable understands that there is an army company under the 117 battalion stationed in Kwada, not too far from the scene of the attack.\nThe development comes months after Dzarma Zirkushu, a brigadier-general and commander of the 28 task force brigade was killed, alongside three soldiers, in an ambush in Askira, also in Borno."
  },
  {
    "headline": "‘Buhari repays kindness’ -- Femi Adesina speaks on Margery Okadigbo's appointment as NNPC chair",
    "summarized_story": "Femi Adesina, presidential spokesperson, says the appointment of Margery Okadigbo as the chairperson of the Nigerian National Petroleum Company (NNPC) Limited is President Muhammadu Buhari’s way of “repaying kindness”.\nBuhari had dropped Ifeanyi Araraume, who was appointed last September as board chair of the NNPC Limited, replacing him with Margery, who is the wife of the late Chuba Okadigbo.\nTwo names were very prominent in the assemblage: Margery Chuba Okadigbo, the Chairman, and Constance Harry Marshall,” Adesina wrote.\n“In his first outing in 2003, Buhari ran with the former Senate President, Dr Chuba Okadigbo, as vice-presidential candidate.\nAdvertisement“Now, 19 years later, who has Buhari made Chairman of the NNPC Ltd Board?"
  },
  {
    "headline": "A year to Nigeria’s 2023 elections, its government lifts Twitter ban",
    "summarized_story": "After 6 months, the Nigerian government has lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nRecall that the Nigerian government suspended Twitter’s operation on June 4, 2021, following the platform’s decision to remove a controversial tweet by the Nigerian President, which it said breached the site’s rules.\nThe Nigerian government has insisted the suspension is a matter of national security and not related to the president’s tweet.\nThe government’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits filed against the Nigerian government; and national assembly hearings held to probe the circumstances leading to the ban.\nIn wake of removal of the suspension, Nigerians have come online to celebrate the end of an era of using VPNs to access Twitter."
  },
  {
    "headline": "Tarneem Saeed: The entrepreneur at the forefront of Sudan’s economic renaissance",
    "summarized_story": "alsoug, founded in 2016 by Tarneem Saeed, is reportedly the biggest tech startup in the country; the funding round speaks to this fact.\nWhat is surprising, however, is that, in a conservative and conflict-torn nation like Sudan, a woman-led company is at the forefront of bringing Sudan’s economy back to health.\nGet the best African tech newsletters in your inboxTarneem Saeed and founding alsougSaeed left Sudan for the first time when she was 14.\nAccording to Saeed, the company has managed to capture the biggest market share because of their operational strategy.\nThe Sudan market is tough, and what helped alsoug was building light as they grew; they didn’t try to overweigh the market all at once."
  },
  {
    "headline": "ThankUCash targets the BNPL opportunity in Africa after raising $5.3m seed",
    "summarized_story": "In Africa, where most people are credit-averse, BNPL activity is just beginning to pick up.\nLast September, Australian company Zip acquired South Africa-based BNPL player Payflex, a deal that indicates Africa may be ripe for buy-now-pay-later services.\nA number of companies—including neobanks, payment service providers, and traditional banks—have already launched or are looking to roll out BNPL services in Africa.\nIn Nigeria, the majority of existing BNPL services are manual, provided by asset financing companies and sometimes merchants themselves.\nUltimately, the customer is buying straight from the merchants,” Ononobi explained in a statement."
  },
  {
    "headline": "Meet the 15 semi-finalists for Pitchstorm 3.0",
    "summarized_story": "Mandila Inc: A startup based in Burkina Faso with an app built to teach and preserve African languages.\nUsing data, they provide farmers with information to plan their pre-planting, planting and post-planting operations.\nFinancial inclusionByte: A Nigerian startup replacing account numbers with a phone number, email, or a byte tag for payments in between banks and other financial institutions.\nAxocheck: A Nigerian startup with a mobile app where users can request and schedule home checkups.\nSpacehunt Inc: A Nigerian mobile app that connects renters and buyers to all of the available properties in their city."
  },
  {
    "headline": "Techpoint Awards 2021: And the nominees are…",
    "summarized_story": "[Updated on December 14, 2021]: The Most Outstanding Logistics Startup 2021 was renamed Most Outstanding Mobility & Logistics Startup 2021.\nOn October 21, 2021, Techpoint Africa called for preliminary nominations for the second edition of Techpoint Awards (Nigerian edition), one of the events lined up for Techpoint Build 2021 scheduled to hold in January 2022.\nAfter carefully looking into entries for the blockchain category, the award committee decided to split it into two sub-categories:As with the inaugural edition, Techpoint Awards 2021 is grouped under three categories: Nomination-only, Users’ Choice, and Techpoint Editorial Choice.\nNewbie of the year 2021This category is for startups founded in 2021 with impressive traction and milestones.\nNigerian App of the Year 2021This category is for user-favourite apps built by Nigerians for Nigerians in 2021."
  },
  {
    "headline": "Blockchain-powered music and bigger investments: The next frontier for music tech",
    "summarized_story": "But after a closer look and talking to some of the industry’s brightest, the signs are there — the next frontier for music tech may be closer than we imagine.\nUltimately, he believes the music industry is worthy of the same attention investors pay to fintech or healthtech, for example.\nWhile Nigeria cannot boast such levels of investment, the state of the music industry signals that more investments could have a positive impact on the economy.\nIn terms of revenue, the music industry raked in $40 million in 2021.\nAdetunji and Okpala are optimistic about the future of African and Nigerian music, one where tech will definitely determine what the next frontier will be."
  },
  {
    "headline": "The next frontier for fintech: Disruptive business models",
    "summarized_story": "Africa’s fintech industry is one of the largest and probably the most advanced.\n“We would see more fintech companies, funding more fintech companies.\nCurrently, the fintech industry is very API and cloud computing driven.\nHowever, Olowe and Hassan believe that rather than disruptive technologies, it would be a more disruptive business model.\nCiting companies like Inflow Finance and Sproutly Nigeria, Hassan says infrastructure like Mono’s would be the base of novel business models."
  },
  {
    "headline": "Technology, funding, learning models: What is the next frontier for edtech startups in Africa?",
    "summarized_story": "The edtech industry in Africa: the nowAccording to Briter Bridges, as of Q1 2020, there were 210 edtech startups in Africa.\nInterestingly, he believes that in the future, edtech will focus more on its adaptability and new learning models than technology.\nAccording to Yomi Ojo, Founder of SchoolsCompass, the divide between the haves and have nots is a huge challenge for the edtech industry.\nFundingAs of August 2021, Africa’s edtech industry has attracted $20 million in funding since 2019.\nThis trend will continue.”In September 2020, South African edtech startup, Valenture Institute, raised a $7 million Series A from GSV Ventures."
  },
  {
    "headline": "Nigerian companies eye more debt in 2022",
    "summarized_story": "Nigerian companies are planning to borrow more from the capital market in 2022 as a blend of old and new issuers size up the opportunity presented by relatively low-interest rates.\n“The key determinant to the debt capital raising activities of Nigerian corporates remains prevailing yields, and currently yields are supportive of continued debt issuance,” Majekodunmi says.\nThere has been no debt raising activity yet, 13 days into the New Year, but that will change in the coming weeks, according to Majekodunmi.\nThe International Monetary Fund (IMF) has already advised emerging economies including Nigeria to raise interest rates and even allow their currencies to weaken in response to rising global interest rates led by the Federal Reserve Bank of the United States.\n“If interest rates start to rise and Nigeria is forced to increase rates, it becomes more expensive to raise money,” the fund manager said."
  },
  {
    "headline": "Energy park funded by Duport Midstream, FCMB debuts in Edo",
    "summarized_story": "A first-of-its-kind energy park with a modular refinery and gas operations, power plants and a data centre debuts in Edo State, Thursday.\nThe management of Duport Midstream Company Limited (DMCL) and First City Monument Bank (FCMB) Limited, promoters of the project, on Thursday, said the newly built energy park in Egbokor, Orhionmwon Local Government Area of Edo State would be ready for commissioning in 60 days.\nThe duo spoke in Egbokor village during an inspection tour of the facility, which is being financed by FCMB.\nSpeaking after assessing the project, Yemisi Edun, managing director/CEO, FCMB, expressed satisfaction with the progress of the facility, saying the modular project was remarkable and driven by technology.\nIn that way, we will be able to utilise assets optimally, avoid wastage, look after the environment and create jobs,” he said."
  },
  {
    "headline": "Nigeria dithers as battery storage investment soars",
    "summarized_story": "From food preservation to local clinics, and rural electrification and small businesses, power storage systems should factor significantly in government’s policy plans.\nExperts say increasing demand for continuous power and energy storage systems in critical infrastructures, adoption of grid energy storage solutions, grid modernisation efforts, and increasing usage of lithium-ion battery-based energy storage systems due to its excellent features are among the factors driving the market for battery energy storage systems.\nShell, last year, published its transition to Net-Zero emissions, which relies heavily on investments in clean energy and energy storage technologies.\nThe US strategy report identifies seven energy storage technologies to focus upon including Lithium-ion batteries, Lead-acid batteries, and pumped storage hydropower.\nOthers are Compressed-air energy storage (CAES), Redox flow batteries (RFBs), Hydrogen (H2), and Building thermal energy storage (TES) – Ice."
  },
  {
    "headline": "BEDC to restore service to Uvbe, Evbuobanosa, Abudu, others soon – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOGHADA – Expectations are high in some communities in Orhionmwon and parts of Uhunmwode local government areas of Edo State, as maintenance work on broken down electricity cables, poles and transformers in the area is expected to commence soon.\nThe communities which include Abudu, Evbuobanosa, Iguomoson, Uvbe, Igbogiri, Iru, Ofien, Idudolor, Evbuohen, Evbosawe, Ugboayon, Oza, Ugbeze, Oghada, among others have been without electricity for more than five years.\nAccording to a youth leader in the area, Saturday Irabor, the Agbor business unit of Benin Electricity Distribution Company (BEDC) notified the communities of arrangements to reconnect them back to the national grid.\nThe official was however silent about the electricity debt owed by the communities, which BEDC earlier said prompted it to suspend service to the area.\nHowever, barely two months after the installation, vandals struck and went away with the armoured cables in the transformers which they later abandoned inside a bush where the community recovered them."
  },
  {
    "headline": "Delta Police Arrests Suspected Internet Fraudsters, Recovery Arms, Ammunitions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Delta State Police Command says that two suspected internet fraudsters are currently cooling their feet in police custody following his arrest on the 8/01/2022 .\nABH 911 GW with two male occupants namely Daniel Anikpe “M” age 27Yrs and Chikeluba James Ani “M” age 27Yrs both residing at Ulo line shop off Asaba –Ibusa road.\n“After a painstaking search was conducted on the suspects and the vehicle, one locally made double barrel pistol, three live cartridges, one jack knife, two wraps of substances suspected to be Indian hemp.\n“He also stated that he bought the gun at a cost of twenty-five thousand naira(#25,000).\nInvestigation is ongoing.” The statement said."
  },
  {
    "headline": "Edo community vs abattoir operator: Absence of defendant lawyer stall case in court – Nigerian Observer",
    "summarized_story": "The community also asked for N5 million damages from the defendant for the nuisance she has alleged been and still constituting in the area.\nAt the hearing yesterday, counsel to the defendant pleaded for adjournment on the ground that his principal, Dr. Osagie Obayuwana, was at the Supreme Court, in Abuja and would wanted to personally handle the case.\nHe told the court that Dr. Obayuwana would appear before the court on the next adjourned date.\nHe however urged the court to fine the defense counsel N50,000, so that they would be deligent in the case next time.\nChief Magistrate Prince Mutairu Oarhe, having listern to both counsels argument and counter argument adjourned the case to February 16, 2022 for continuation of hearing."
  },
  {
    "headline": "Obaseki mourns death of former Interim Head of Govt, Ernest Shonekan – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI am saddened by the passing of Nigeria’s former Interim Head of National Government, Chief Ernest Shonekan, at the age of 85.\nShonekan was an unassuming leader and a cerebral lawyer, who helped to steady our nation during the turbulent years of Nigeria’s Third Republic.\nAs the founder of the Nigeria Economic Summit Group, his commitment to private and free enterprise remains indelible in the annals of our history.\nIt is heartbreaking that Chief Shonekan will not be available to offer his priceless advice and guidance as we approach another election season.\nHe will be remembered for his fortitude while he was on the saddle as Interim Head of National Government as well as the genuine effort made to guide Nigeria back to democratic rule."
  },
  {
    "headline": "FG assures Nigerians of adequate provision of ICT equipment for students, citizens",
    "summarized_story": "“To him, the welfare of Nigerians, especially our teaming youths remains a top priority for this administration.\nThe continuous benefits the country has been deriving from effectively leveraging ICT to run governance more efficiently has been phenomenal,” the Minister remarked.\n“In this context, developing capacities for anticipating the changing needs for digital skills for work and life is crucial for all countries and that should be of interest to all of us,” he said.\nThe Digital Nigeria Centre (DNC) is a project facilitated through the Universal Service Provision Fund of the Nigerian Communications Commission (NCC) under the Ministry of Communications and Digital Economy.\nIn attendance at the event were, the Senator Representing Osun West, Sen. Adelere Oriolowo; Speaker of the State of Osun House of Assembly, Represented by Hon."
  },
  {
    "headline": "Buhari hails Ahmad Lawan-led 9th N’Assembly as Senate President urges consensus on critical issues",
    "summarized_story": "President Muhammadu Buhari has applauded the current National Assembly and particularly the leadership style of it’s chairman, the Senate President, Ahmad Lawan.\nProfessor Gambari said the President sent him to deliver a congratulatory message and express his admiration about Lawan’s personal achievements.\nSpeaking at the occasion, the Senate President passionately appealed to politicians irrespective of their political affiliations to work towards building consensus on critical national issues.\n“In the Senate, we have been able to achieve some kind of formidable unity and consensus on what we must do for our country.\n“Regardless of our political affiliations, in the ninth Senate, we have always approached issues mainly in national interest,” Lawan said."
  },
  {
    "headline": "Buhari visits Ogun, commissions Abiodun’s projects",
    "summarized_story": "Idowu OlakunleNigeria’s president, Muhammad Buhari on Thursday, visited Ogun State where he commissioned some monumental projects constructed by the governor, Prince Dapo Abiodun.\n‘‘This has made Ogun State one of the safest and most peaceful states in the country and investors’ destination of choice,” Buhari said.\n‘‘It is significant to note that the two road projects being commissioned today are federal roads.\nIt depicts that something new is happening in Ogun State, a welcoming entrance into the State Capital at the centre point of the State.’’He added that the project is also iconic, depicting the joining of hands for building the future of Ogun State in togetherness.\nHe said his “Administration in Ogun State has continued to fulfil all its promises to the people within the available means."
  },
  {
    "headline": "Osun 2022: PDP Screens Dele Adeleke, 5 others for Osun Governorship Election",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Peoples Democratic Party (PDP) governorship screening committee for Osun state headed by former Attorney General of the Federation and Minister for Justice, Mohammed Adoke on Wednesday screened all the six governorship aspirants that purchased the nomination forms.\nSix of them turned in for the screening and we screened all of them and we are satisfied with the answers they gave us.\n“We ensured that the process was transparent, we ensured that they were given fair hearing and we ensured that we executed the mandate given to us by the party.\n“In fact the national convention screening committee has been made standing committee for the party.\nAlso, another aspirant, Alhaji Abdulateef Akinbade, expressed optimism that he would not be disqualified following the way the screening committee conducted the exercise."
  },
  {
    "headline": "Plateau Killings: Retaliatory Attacks Unacceptable, Says Buhari",
    "summarized_story": "President Muhammadu Buhari has expressed sadness about the fresh killings in Bassa local government area of Plateau State, saying circle of violence in the name of retaliation is unacceptable.\nThe President noted that the latest incident in the state was not in keeping with the principles of the peace agreements reached between the Irigwes and the Fulanis in Bassa LGA.\n“My thoughts are with the families of the victims in this time of grief.\nThis is unacceptable,” the President added.\nADVERTISEMENTThe President, however, commended Governor Simon Lalong for the state government’s handling of the incident so far."
  },
  {
    "headline": "EFCC Arrests Fake Army General For Alleged N270m Fraud",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested an impostor, Bolarinwa Oluwasegun, who claimed to be a General of the Nigerian Army for alleged N270million fraud.\nEFCC spokesman, Wilson Uwujaren, stated in a statement on Thursday that the suspect was arrested by operatives of the Lagos Zonal Command of the anti-graft agency, at his house in the Alagbado area of Lagos State on Wednesday, January 12, 2022.\nHe said that the suspect posed as an Army General to make false representations to his victim, Kodef Clearing Resources, that President Buhari had shortlisted him as the Chief of Army Staff.\nHe added that Oluwasegun also allegedly forged several documents with the signature of the President Muhammadu Buhari in his bid to defraud the victim.\nUwujaren said that the operatives recovered six pump action guns, three cartridge bullets, a swagger stick and several forged documents from the suspect, who he said would be charged to court as soon as investigations were concluded."
  },
  {
    "headline": "APC Hails Buhari, Nigerians For Resisting Twitter ‘Interference’",
    "summarized_story": "The All Progressives Congress (APC) has applauded President Muhammadu Buhari and Nigerians for what it described as their firm stance against the interference of microblogging site, Twitter Inc, in Nigeria’s internal and national security affairs.\n“We also applaud Twitter for allowing good reason and common interest prevail by agreeing to open their office in Nigeria.\nRussia has VKontakte (VK), China has Weibo, among several homegrown social media platforms.\nNigerians talented in the development of social media/software applications are challenged to develop homegrown applications that can rival existing social media platforms and meet the need of Nigerians.\n“Finally we reiterate our charge to operators of social media pages to use their platforms to check divisive and inciting rhetoric, particularly in Nigeria."
  },
  {
    "headline": "APC Hails Buhari, Nigerians For Resisting Twitter ‘Interference’",
    "summarized_story": "The All Progressives Congress (APC) has applauded President Muhammadu Buhari and Nigerians for what it described as their firm stance against the interference of microblogging site, Twitter Inc, in Nigeria’s internal and national security affairs.\n“We also applaud Twitter for allowing good reason and common interest prevail by agreeing to open their office in Nigeria.\nRussia has VKontakte (VK), China has Weibo, among several homegrown social media platforms.\nNigerians talented in the development of social media/software applications are challenged to develop homegrown applications that can rival existing social media platforms and meet the need of Nigerians.\n“Finally we reiterate our charge to operators of social media pages to use their platforms to check divisive and inciting rhetoric, particularly in Nigeria."
  },
  {
    "headline": "Buhari meets faction of Tijjaniyya Movement, Sanusi Lamido left in the cold",
    "summarized_story": "President Muhammadu Buhari has met with a faction of the Tijjaniyya Islamic Movement, leaving the Sanusi Lamido faction in the cold.\nThe faction that met Buhari at the State House in Abuja was led by the Grand Khalifa of the Tijjaniyya Islamic Movement WorldWide.\nThe Grand Khalifa, Tidjani Ali Bin Arabi is from Algeria.\nThe former Emir of Kano, Muhammadu Sanusi Lamido also leads another Tijjaniyya sect in Nigeria.\nReports had said Niasse boycotted a zikr and prayer sessions sponsored by Kano State Government at the Emir’s Palace ."
  },
  {
    "headline": "Sokoto NLC resolves to join nationwide protest",
    "summarized_story": "By Muhammad NasirThe Nigeria Labour Congress (NLC), Sokoto State Chapter, has resolved to join the planned Jan. 27 nationwide protest against the fuel price hike.\nThis development followed a resolution by the State Executive Council (SEC) of the union at its meeting on Friday in Sokoto.\nAddressing newsmen after the SEC meeting, Mr Aminu Umar, the State NLC Chairman, said the resolution was in compliance with the directive of its national secretariat.\n“The decision of the NLC National Headquarter is in consideration of the situation of the country’s economy as well as security challenges.\n“Therefore, the SEC in Sokoto State has unanimously agreed and supported the decision of the NLC at the national level that no retreat no surrender come Jan. 27, we will all come out to protest."
  },
  {
    "headline": "JUST IN: Gunmen Invade Federal University In Nasarawa, Kidnap 4 Students",
    "summarized_story": "JUST IN: Gunmen Invade Federal University In Nasarawa, Kidnap 4 StudentsSome students from the Federal University of Lafia in Nasarawa State have been kidnapped by gunmen suspected of being bandits.\nIt was learnt that the students were abducted by the gunmen at the university community in Mararraba campus.\nConfirming the incident, the University’s Public Relation Officer, Abubakar Ibrahim, revealed that four students were abducted.\nHe said that the gunmen attacked the university at about 11:30 pm on Thursday and whisked the students to an undisclosed location.\n“The Vice-Chancellor, who has since visited the area where the students were abducted, also visited the Nasarawa Police command where he formally notified the commissioner of Police about the abduction of the students,” the statement added."
  },
  {
    "headline": "BREAKING: Boko Haram Kidnaps Mobile Police Officers In Borno",
    "summarized_story": "Boko Haram militants have kidnapped an undisclosed number of mobile police officers from a police mobile training school in the Limankara Gwoza local government area of Borno State, Senator Ali Ndume’s hometown.\nAccording to information obtained by The PUNCH, insurgent fighters attacked the training school with gun trucks at 8:22 p.m. on Thursday, January 13th, and fired sporadically into the air before kidnapping the mobile Police instructors.\nGwoza town is twenty-five kilometers away from the training school.\nIt is a border town between Adamawa State’s Borno and Madagali LGAs.\nThe incident comes seven days after terrorists attempted to penetrate a Nigerian Army base in Gwoza, but were successfully repulsed by Nigerian army soldiers."
  },
  {
    "headline": "IPOB: Nnamdi Kanu Fully Prepared To Appear In Court Next Week — Lawyer",
    "summarized_story": "Mazi Nnamdi Kanu, the leader of the Indigenous People of Biafra, is hopeful of success because he will appear before Justice Binta Nyako of a Federal High Court in Abuja next week, according to his lawyer, Ifeanyi Ejiofor.\nThis was said by Ejiofor in a statement released on Friday morning following his customary visit to Kanu at the Department of State Services Headquarters.\nWe are optimistic that the court outings of Onyendu would be impressive.\nI declare to you, Umuchineke, that Onyendu is fully prepared to appear in court as from January 18 2022.\n“Onyendu expresses his profound gratitude and appreciation to millions of his followers and supporters scattered throughout the face of the earth."
  },
  {
    "headline": "How Nigeria Baptist Convention Paid Bandits N250million To Secure Release Of Abducted Bethel School Students",
    "summarized_story": "The Nigeria Baptist Convention has stated that it spent N250 million to obtain the return of students kidnapped by terrorists in 2021 from Bethel Baptist College in Kaduna.\nAccording to Tribune, the President of the Nigeria Baptist Convention, Rev Dr Israel Akanji, made the announcement in Gombe on Friday at the First Baptist Church in Gombe at the 2022 International General Workers Conference for the North-East.\nHe said, “Initially we didn’t want to spend money, we didn’t believe in spending any money, that was how we began.\nI even said this openly that we will not spend money but I am also saying it openly now that we have had to spend money, we were forced to spend money.\n“Whoever is going to be the next president of Nigeria must be ready to confront the insecurity in our land."
  },
  {
    "headline": "Sofiyat: Raising the bar of military traditions",
    "summarized_story": "Immigration officers tooSimilarly, three female officers of the Nigeria Immigration Service (NIS) were in 2020 queried for partaking in Bopdaddychallenge (a trending dance competition on social media).\n“The institution implicated here is the Nigerian military authority.\nIs Nigeria now the Banana Republic?”Omokri’s takeLikewise, a Nigerian socio-political activist, Reno Omokri, lambasted the Nigerian Army for poor handling of the Sofiyat case.\nHe said, “The Nigerian Army, which is currently rehabilitating Boko Haram, is penalising Private Hannah Sofiyat for accepting a proposal from a corps member; is that not madness?\n“The Nigerian Army should have promoted the love story as a recruitment tool."
  },
  {
    "headline": "Picture: Police arrest housewife for attempting to sell another’s son",
    "summarized_story": "A housewife identified as Aisha Ibrahim has been arrested by the Zamfara state police command for planning to sell her co-wife’s son in Gusau, the state capital.\nShe was arrested with the two-year-old baby boy who she was planning to sell off at Gusau.\nAisha was among the suspects paraded by Zamfara Police Commissioner, CP Ayuba Elkana, at a press briefing on Thursday.\nShe was paraded alongside the two-year-old boyWhile confessing to the crime, Aisha said the child she wanted to sell is the son of her co-wife.\nShe added that she wanted to sell off the boy in retaliation for alleged theft, and sale of her own son by the co-wife."
  },
  {
    "headline": "Another Nigerian law enforcement agency arrests Obi Cubana",
    "summarized_story": "Business man and night club owner, Obi Iyiegbu, popularly known as Obi Cubana has been questioned by the National Drug Law Enforcement Agency (NDLEA) over suspicious payments into his account by three convicted drug dealers from Nigeria, Malaysia and India.\nThe Economic and Financial Crimes Commission (EFCC) had last year also invited the businessman to answer questions about the sources of his wealth.\nAlready, NDLEA has granted him bail after hours of questioning, and he is expected to return at a later date at their headquarters, Blueprint gathered.\nAlthough, the agency is yet to issue an official statement regarding the latest development as at the time of filling this report."
  },
  {
    "headline": "Gunmen Kidnap Four Students Of Federal University Of Lafia",
    "summarized_story": "Gunmen have kidnapped four students of the Federal University of Lafia (FULafia).\nThe management of the institution, confirmed this in a statement on Friday by the Head, Information and Public Relations Unit, Abubakar Ibrahim.\nAccording to the statement, the gunmen attacked the university at about 11:30 p.m on Thursday.\n“The unfortunate kidnap incident took place at a community, Mararraba, located close to the University,” the statement read in part.\nHe, therefore, expressed his deep sympathy to the families of the abducted students, assuring them that serious efforts are being taken to ensure the quick rescue of the kidnapped students."
  },
  {
    "headline": "Illegal Refineries: Wike Announces N2m Reward For LG Chairmen",
    "summarized_story": "﻿Rivers State Governor, Nyesom Wike, has announced a two million naira reward for Council Chairmen in the state who are able to identify illegal refinery sites in their localities.\nGovernor Wike who issued the ultimatum during a meeting with heads of security and Local Government Chairmen in Port Harcourt on Friday said the crime of operating an illegal refinery is worse than the activities of the Boko Haram terrorist.\nHe, therefore, issued a 48-hour ultimatum to the council chairmen in all 23 local government areas of the state to identify the illegal refineries or risk losing their post.\nMeanwhile, Governor Wike accused security personnel including members of the Nigeria Army, the Navy, the Police and the Nigeria Security and Civil Defence Corps (NSCDC) of providing escort services for the operators of the illegal refineries.\nThe meeting was held one day after Governor Wike, accompanied by the Commissioner of Police, Eboka Friday inspected two illegal refinery sites in Ikwerre and Emohua Local Government Areas."
  },
  {
    "headline": "Global Warming Is Real In Nigeria, Says Minister",
    "summarized_story": "Minister of Science and Technology, and Innovation, Dr Ogbonnaya Onu, on Friday said global warming is a reality in Nigeria.\nThe Minister made the comment at the virtual meeting organised by the International Renewable Energy Agency (IRENA) in his office on Friday in Abuja, a statement signed by ministry spokesperson Afonja Ajibola said.\nDr Onu noted that one evidence for global warming in Nigeria is the drying up of Lake Chad, desertification and coastal flooding affecting many parts of the nation.\nAccording to the Minister, Africa accounts for 2-3% of world’s carbon dioxide emission that has varied enormous and energy resources which includes Natural Gas, Hydro Power, Biomass, nuclear and coal.\nThe minister commended IRENA for its role in promoting renewable energy globally and for organizing the Ministerial meeting on just and inclusive energy transition in Africa."
  },
  {
    "headline": "Democracy Has Come To Stay In Nigeria – General Irabor",
    "summarized_story": "The Chief of Defence Staff, General Lucky Irabor, has pledged the loyalty of the military leadership to democratic rule in the country.\nIrabor made the pledge on Friday during an interview on Channels Television’s Sunrise Daily, where he commended the efforts of military personnel ahead of the Armed Forces Remembrance Day.\nSeven weeks later, Sudanese armed forces detained Prime Minister Abdalla Hamdok over his refusal to support their coup on Monday.\nBack in the country, General Irabor admitted that some Nigerians might still be struggling with their experience regarding military involvement in politics in the past.\n“Going forward, I believe that some of these misperceptions that some Nigerians have had with respect to military engagement will begin to change.”"
  },
  {
    "headline": "AFCON Match Preview: Nigeria Eye Knockout Spot Against Sudan",
    "summarized_story": "The Super Eagles of Nigeria face Sudan in their second Group D match at the 2021 Africa Cup of Nations (AFCON) on Saturday, eyeing a berth at the knockout stage of the biennial soccer competition.\nREAD ALSO: [Egypt, Sudan, And Guinea-Bissau] How Tough Is Nigeria’s AFCON Group?\nNigeria Key Men And Team NewsEguaveon’s side have an abundance of attacking options to do the damage against Sudan.\nWhile Nigeria is a tougher opponent, the Falcons are hoping to give Nigeria a run for their money on Saturday.\nNigeria Vs Sudan Match TimeThe game between Nigeria and Sudan at the 2021 Africa Cup of Nation (AFCON) will start at 5:00 pm (WAT)."
  },
  {
    "headline": "Updated: Tinubu visits Zamfara, appeals for continued prayer for peace",
    "summarized_story": "The National Leader of the APC, Asiwaju Bola Tinubu has visited Zamfara to commiserate with Governor Bello Matawalle and residents of the State over the incessant killings by bandits.\nOla Awakan reports that the incessant killings by bandits in Zamfara has become a course of worry to Nigerians.\nWithin the first two weeks of January 2022 hundreds of people are reported to have been killed in Zamfara.\nNational leader of the APC, Asiwaju Bola Tinubu was received in the Government house as he condemned the killings by bandits.\nGovernor Bello Matawalle responded by thanking Bola Tinubu for his show of life."
  },
  {
    "headline": "Ezekwesili heads 80-man transition committee in Anambra",
    "summarized_story": "Anambra State government has announced an 80-man transition committee to ensure a seamless transition from the Governor Willie Obiano’s administration to a Chukwuma Charles Soludo-led administration as from 17th March, 2022.\nThis was disclosed a statement issued on Thursday by Joe Anatune, Media Assistant to the Anambra State Governor-Elect, Chukwuma Soludo Secretariat.\nThe members include:1) Mrs Oby Ezekwesili — Chairperson2) Prof. Benedict Okey Oramah3) Rt.\nIfeanyi Okeoma68) Amb Uche Ajulu-Okeke69) Chief Pat Ubajaka70) Prof. Okey Ikeanyibe71) Comrade Charles Onyeagba72) Prof.\nAu Nnonyelu73) Dr. Forster E. Ihejiofor74) Mr. Odera Ozoka75) Mr. ThankGod Ibeh76) Prof. Sylvia Chika Ifemeje77) Mr. Kanayo Nwafor78) Comrade Churchill Okonkwo79) Sir Damian Okolo80) Dr. Chinedu Onyeizugbe"
  },
  {
    "headline": "February APC National Convention requires no consultation",
    "summarized_story": "The Director General Of the Progressives Governors Forum, Salihu Lukman, has said that the February date for the National Convention of the National Convention requires nor consultation.\nMr Lukman said the more the party continue to allow the leadership of the Caretaker Extraordinary Convention Planning Committee to refuse to commence the process of organising the February APC National Convention, the more party leaders would have supported the CECPC in weakening the electoral prospect of the APC.\nPresident Muhammadu Buhari had agreed to February for the party’s national convention, but the body language of the Caretaker Committee suggest otherwise.\nMr Lukman suggest that the APC must not make the mistake of orientating it’s internal party mobilisation for the emergence of candidates for 2023 elections, especially Presidential Candidate only based on personality contest.\nHe appeal to party stakeholder, as the first challenge is to ensure that the CECPC has no option but to organise the APC National Convention in February as decided based on all the consultations that has taken place, and failure to do otherwise will mean going against president Muhammadu Buhari’s order."
  },
  {
    "headline": "Tinubu visits Zamfara, commiserates Gov Matawalle over killings -",
    "summarized_story": "Former Lagos state Governor and National leader of the All Progressive Congress, Asiwaju Bola Ahmed Tinubu has arrived Zamfara State Government House Gusau.\nThe APC National leader is in Gusau to Commiserate With Governor Bello Matawalle and the people of the state over the recent killings in Anka and Bukuyyum Local Government Areas.\nMr. Tinubu and his entourage were recieved by Zamfara State Governor Bello Matawalle and other top government functionariesHe is currently in a closed door meeting with Governor Bello Matawalle."
  },
  {
    "headline": "Wole Soyinka Debunks Backing Tinubu – Trending With Ojy Okpe",
    "summarized_story": "Nobel laureate, Professor Wole Soyinka, has spoken up about about his alleged support of certain candidates in the race for the 2023 presidencyLast November, a Facebook user Michael Olugbenga Peter posted a comment purportedly made by Professor Soyinka that he would be involved in politics to campaign for Asiwaju Bola Ahmed Tinubu’s 2023 presidential bid because of their National Democratic Coalition background.\nIn a statement titled the Season of Fakery Galore, which is now circulating on social media Wole Soyinka debunked the post as fake news.\nThe Economic and Financial Crimes Commission announced that its operatives arrested one Bolarinwa Oluwasegun for his alleged involvement in a 270 million Naira fraud.\nOluwasegun was said to have presented himself as a general in the Nigerian Army and forged the signature of President Muhammadu Buhari in a letter he claimed was his proof of appointment.\nAccording to the EFCC, Oluwasegun made the false representation to defraud Kodef Clearing Resources under the pretext of securing a grant."
  },
  {
    "headline": "Supreme Court Halts Covid Vaccine Mandate for US Businesses",
    "summarized_story": "At the same time, the court is allowing the administration to proceed with a vaccine mandate for most health care workers in the U.S.\nWhen crafting the OSHA rule, White House officials always anticipated legal challenges — and privately some harbored doubts that it could withstand them.\nThe mandate covers virtually all health care workers in the country, applying to providers that receive federal Medicare or Medicaid funding.\nDecisions by federal appeals courts in New Orleans and St. Louis had blocked the mandate in about half the states.\nA separate vaccine mandate for federal contractors, on hold after lower courts blocked it, has not been considered by the Supreme Court."
  },
  {
    "headline": "Lockdown Parties in No 10 Downing Held on Eve of Prince Philip’s Funeral",
    "summarized_story": "Downing Street staff held two parties the night before Prince Philip’s funeral – at a time when Covid restrictions banned indoor mixing.\nPrime Minister Boris Johnson was not at either party – but it raises further questions about a culture of rule-breaking at Downing Street.\nBut Mr Johnson has faced particular criticism after it emerged he had attended one on 20 May 2020 during the first lockdown.\nHe told BBC Newsnight he had submitted the letter with a “heavy heart”, believing there was no sign the revelations about parties in Downing Street during lockdown would end soon.\nMr Bridgen, who backed Mr Johnson in the 2019 Conservative leadership contest, said this was “preventing the government from functioning as normal and that’s an untenable position”."
  },
  {
    "headline": "NBA: Giannis Antetokounmpo leads Milwaukee Bucks to Win Over Golden State Warriors",
    "summarized_story": "Giannis Antetokounmpo hit his third triple-double of the season as the Milwaukee Bucks secured a 118-99 win over the Golden State Warriors.\nThe 27-year-old notched 30 points, 12 rebounds and 11 assists to help the champions end a two-game losing streak and secure their second win in six.\nStephen Curry made 12 points, eight rebounds and four assists for the Warriors, with Andrew Wiggins top-scoring for the visitors with 16 points.\nShai Gilgeous-Alexander scored 33 points, 10 rebounds and nine assists to help the Thunder end a five-game losing run.\nJames Harden starred again with 26 points, nine assists and seven rebounds for the Nets, who fell to a sixth defeat in nine games."
  },
  {
    "headline": "Zenith Bank’s Share Price Makes History, Outperforms GTCO on NGX",
    "summarized_story": "For the first time in many years, the stock price of Zenith Bank Plc on the Nigerian Exchange Limited (NGX) has overtaken that of Guaranty Trust Holdings Plc (GTCO).\nAccording to capital market analysts, the stock price of Zenith Bank in the last 10 years has never outpaced GTCO.\nOn the other hand, GTCO depreciated by 2.1 per cent to close yesterday at N25.45, from the N26 the stock market price opened this year.\nThe stock price of GTCO over the years traded higher than GTCO on the bourse.\nThe bank’s share price gained one per cent to close 2021 at N25.15 in 2021."
  }
]