[
  {
    "headline": "COVID-19: Reclaim impounded vehicles within 14 days, Kwara police tell owners",
    "summarized_story": "Kwara State Police Command has given a 14-day grace period for owners to remove their vehicles impounded by the Command from the premises of the police stations scattered across the state.\nThe vehicles, according to the statement, included motorcycles, cars, buses, trucks, whether accidented or not, but impounded during the COVID-19 lockdown and parked at Police formations in the state as exhibits.\n“The Kwara State Police Command wishes to inform the general public of her readiness to clear all Divisional Police Headquarters and other formations within the state of all accidented, unclaimed exhibits including motorcycles impounded during the Covid-19 Lockdown/Curfew imposed by the state government.\n“As such, owners of such vehicles and motorcycles are given 14 days of grace to come with the original documents for identification and collection.\n“Also be informed that, after the expiration of the fourteen days ultimatum, all unclaimed items will be auctioned”, the Police said."
  },
  {
    "headline": "Group asks IGP to rescind shoot-on-sight order in South-East",
    "summarized_story": "A socio-cultural association of Igbo professionals and patriots, Nzuko Umunna, has called on the acting Inspector-General of Police, Usman Baba, to rescind his shoot-at-sight order to his men in the South-East.\nThe group said authorising police officers to shoot suspected members of the Indigenous Peoples of Biafra at sight was unconstitutional and violated human rights protections guaranteed by the constitution.\nThe chairman of the group’s Legal Committee, Dr. Sam Amadi, made its position known at a press conference in Abuja on Monday.\nAmadi said the order suggested a declaration of war on the people of the region.\n“Already, there are credible reports of numerous extrajudicial killings of people in the south-East."
  },
  {
    "headline": "One feared dead as police foil attempt to set station ablaze",
    "summarized_story": "Kindly Share This Story:Police in Lagos State on Monday foiled an attempt to set ablaze the Oke-Odo Police Station in Ile-Epo area after a commercial motorcyclist was allegedly killed in the area.\nThey set fire on car tyres to protest the alleged killing adding that they had had enough of the policemen.\n“Policemen killed someone yesterday, Sunday, May 23.\nThis made the people around get angry and decided to take their grievances to the Oke-Odo Police Station.\n“The command wishes to debunk the rumour that lle Epo Police Station was set ablaze by some hoodlums."
  },
  {
    "headline": "How ICT sector retained top position in GDP growth ― Pantami",
    "summarized_story": "He said the Federal Government has provided an enabling environment for the ICT sector to thrive, through the development and implementation of relevant policies.\nHe pointed out that the ICT sector grew by 6.47% in Q1 2021, making it the fastest-growing significant sector of the Nigerian economy.\n‘‘From the report, the Information and Communications Technology (ICT) sector retained its earlier position as the sector with the highest growth rate of all the main sectors of the Nigerian economy in the first quarter of 2021 (Q1 2021).\n‘‘The Minister attributes the consistent positive performance of the ICT sector to the focused and committed support for the administration of President Muhammadu Buhari, for the Digital Economy sector.\n‘‘The Federal Government has provided an enabling environment for the ICT sector to thrive, through the development and implementation of relevant policies."
  },
  {
    "headline": "Enugu govt rehabilitates intractable Etudo/Awkunanaw street",
    "summarized_story": "Kindly Share This Story:…Ugwuanyi always pays certified works on time – ContractorThe Enugu State Ministry of Works and Infrastructure, in keeping with the directives of Governor Ifeanyi Ugwuanyi, has carried out the rehabilitation of the popular Etudo/Awkunanaw Street, Achara Layout, Enugu South Local Government Area, which was hitherto in a deplorable state.\nSpeaking during the governor’s visit, the Commissioner for Works and Infrastructure, Engr.\nNnaji, accompanied by the Deputy Leader of the Enugu State House of Assembly and member representing Enugu South (Rural) Constituency, and the Special Adviser to the Governor on Information, Barr.\nNnaji added that other remedial works will be carried across other adjoining streets of Awkunanaw Street, stressing that he was at the site with the Honourable Members representing, Enugu South Rural and Urban constituencies, Rt.\nUgwuanyi for his swift intervention in the road which she said was neglected by previous administrations for decades."
  },
  {
    "headline": "Three days prayer for late COAS, Lt. Gen Ibrahim Attahiru and others observed in Abuja",
    "summarized_story": "Kindly Share This Story:By Kingsley Omonobi – AbujaA three days prayer was on Monday 24 May 2021 observed for the repose of the soul of late Chief of Army Staff (COAS) Lieutenant General Ibrahim Attahiru who died along with others in the ill-fated Beach Craft King Air 350 crash at Kaduna International airport on Friday 21 May 2021.\nConducting the prayers, the Director Islamic Affairs Nigerian Army and the Chief Imam, Brigadier General Shehu Garba Mustapha prayed to God to forgive the shortcomings of the departed souls and grant them eternal rest in Aljannah Firdaus as well as console their families, friends, and colleagues.\nFielding questions from newsmen after the prayers, the Chief of Defence Staff, General Lucky Irabor charged members of the Armed Forces to remain steadfast in the discharge of their constitutional roles adding that the death of the COAS and others will not be in vain.\nOthers ate one time Chief of Naval Staff, Vice Admiral Murtala Nyako, Chairman/CEO NDLEA Brig Gen Mohammed Buba Marwa (Rtd), Governor of Gombe state, Principal Staff Officers from Defence, Army and sister Services Headquarters, former services chiefs, top government functionaries, members of Defence and Police Officers Wives Association and members of the Nigerian Army Officers Wives Association among several others.\nVanguard News NigeriaKindly Share This Story:"
  },
  {
    "headline": "Insecurity: Ebubeagu, Police arrest 38 bandits, kill one in Ebonyi",
    "summarized_story": "Kindly Share This Story:By Peter Okutu, AbakalikiTHE Southeast Security outfit codenamed “Ebubeagu” in Ebonyi State, in collaboration with the police has arrested 38 suspected bandits in the state.\n37 of the suspects were arrested in the Agubia axis of Ikwo local government area of the State while allegedly plotting to attack some security and other government facilities in the state.\nEmegha said that the suspects came into the state from different parts of South-East to carry out the operation while others also came from the different local government areas of Ebonyi State.\nAlso read:“It was discovered that they have a map and came from different places like Enugu, Imo and others from different local government area of Ebonyi State.\n“But unfortunately, luck ran out of them and they were all arrested and have been handed over to the police”."
  },
  {
    "headline": "NAPTIP busts child-trafficking syndicate, rescues 4 children in Abuja",
    "summarized_story": "The National Agency for the Prohibition of Trafficking in Persons (NAPTIP) on Monday said it has busted a notorious child trafficking syndicate in the Federal Capital Territory and arrested a suspect.\nNezan also explained that the operatives of the agency were able to rescue four children from one Mrs Blessing-Nnena Eze, suspected to have stolen the children.\nNAPTIP said the development represented a major feat in the agency’s determination to curtail the incidence of child trafficking, especially within the nation’s capital.\n“We shall surely fish out the fleeing members of the syndicate and they shall face the full wrath of the law,” Sulaiman-Ibrahim said.\nThe NAPTIP boss further called on parents to keep an eye on their children in order to prevent them from being trafficked."
  },
  {
    "headline": "Shoot order won't end South-East insecurity",
    "summarized_story": "Chidi Onyemelukwe, a Peoples Democratic Party (PDP) governorship aspirant in Anambra State, says armed confrontations cannot bring about the progress the South-East needs.\nOnyemelukwe cautioned security agencies on the shoot-on-sight directive, noting that it will only aggravate the situation.\nThe latest was the Sunday invasion of the Police B-Division and the Independent National Electoral Commission (INEC) State Office in Awka.\nShe said the Police and Nigerian military, in a bid to restore normalcy, must resort to high-handed and extra-judicial engagements.\nShe also mourned police and military personnel, vigilantes, as well as other citizens who lost their lives during attacks on security formations in the South-East and South-South."
  },
  {
    "headline": "Economy: Ikpeazu charges Abia MDAs on increasing IGR",
    "summarized_story": "The Governor of Abia State, Okezie Ikpeazu, has directed all MDAs and LGAs in the state to comply fully with Abia State Revenue Laws and the Abia State Internal Revenue Service (ABIRS) directives in order to achieve the much needed revenue for state development.\nThe Governor gave this charge during the weekend when he met with members of the State IGR Council to express his concerns towards the current economic downturn in the country as it affects the state’s economy, given that a significant drop in FAAC disbursements is expected in the coming months.\nGovernor Ikpeazu made no exceptions and warned that any MDA hiding any revenue source will be severely sanctioned.\nGovernor Ikpeazu however reiterated his commitment and resolve to ensure attainment of the State’s IGR target for the continuing growth and development of the state and welfare of the citizens, and will, therefore, not tolerate any kind of encumbrances from anyone.\nDAILY POST reports that the meeting had in attendance, the Deputy Governor and Chairman of the State IGR Council, Hon."
  },
  {
    "headline": "Creation of states: Bauchi govt pledges to facilitate actualization of Katagum",
    "summarized_story": "The Bauchi State Government on Monday gave the assurance of its commitment to facilitating the actualization of the creation of Katagum State out of the state.\nThe state governor, Senator Bala Abdulkadir Mohammed, gave the assurance while receiving a delegation of the Movement for Creation of Katagum State at the Government House, Bauchi.\nAccording to the governor, the creation of the proposed Katagum State was long over due and informed that the request had been endorsed by the state government.\nAccording to the former SGF, creating a new state out of the present Bauchi State was an added advantage.\nHe, therefore, appealed to Governor Mohammed to be part of the struggle for the creation of Katagum State."
  },
  {
    "headline": "Buhari postpones cabinet, police council meetings",
    "summarized_story": "President Muhammadu Buhari has ordered the postponement of the Federal Executive Council meeting (FEC) in honour of the late Chief of Army Staff, Lt.-Gen. Ibrahim Attahiru and ten other officers.\nBoss Mustapha, Secretary to the Government of the Federation (SGF) made the announcement in a circular on Monday.\nThe President also directed that the scheduled Police Council meeting for Thursday be postponed.\nThe government had declared today May 24 as work free-day for members of the Armed Forces.\nMustapha quoted Buhari as urging all citizens to use the period of mourning to pray for the repose of the souls of the departed and strength for their families."
  },
  {
    "headline": "Peruzzi reacts as Pamilerin hits gym years after alleged assault saga",
    "summarized_story": "In June 2019, Peruzzi reportedly slapped Pamilerin and caused him facila injury over a statement he made about him on social media.\nADVERTISEMENTSocial media users had urged Pamilerin to sue the singer for assault but he chose not to escalate the issue.\nHowever, years after the incident went viral, Pamilerin has teased the “Majesty” crooner with his revenge body and jokingly challenged him.\nThe social media personality shared a photo of himself in a gym-like setting with profuse sweat on his body and tagged the “Majesty” crooner.\nPamilerin in his response jokingly referred to Peruzzi as a “Bully”."
  },
  {
    "headline": "Presidency tackles Southern Govs over ‘ban’ on open grazing",
    "summarized_story": "By Bolaji Ogundele, AbujaThe Presidency has described Southern Governors Forum’s recent ban on open grazing as an action of questionable legality, accusing the Governors of politicking with a serious security issues and an attempt at show of power.\nThe Presidency’s position was contained in a statement by Senior Special Assistant to the President on Media and Publicity, Mallam Garba Shehu.\nThe Presidency announced the Federal Government would commence partial implementation of the plan to rehabilitate grazing reserves in willing states, starting from June.\n“The entire country is acutely aware of the strain the COVID-19 pandemic has taken on public finances, for both Federal and States.\nStill, given the pressing urgency of addressing the perennial challenges, the federal funding for the project that has been delayed is now being partly unlocked."
  },
  {
    "headline": "No funds for Constitution Review in 2021 budget, says Omo-Agege",
    "summarized_story": "By Sanni Onogu, AbujaThere is no allocation for Constitution Review in the 2021 budget, The Nation has learntChairman, Senate Ad-hoc Committee on the Review the 1999 Constitution, Ovie Omo-Agege, disclosed at a briefing in Abuja, on Monday.\nOmo-Agege the situation notwithstanding, the committee has sufficient funds to carry out the exercise, saying it was still operating its 2020 budget.\nHe expressed optimism that funds would be voted for the exercise in the supplementary budget expected to be transmitted to the National Assembly in no distant time.\nI was actually answering a question as to how much was appropriated (for the review exercise) in 2021.\n“Restructuring is just one aspect of several aspects of this Constitution review and it also depends on what you mean by restructuring and who is speaking to that."
  },
  {
    "headline": "Aproko doctor makes acting debut in Netflix movie",
    "summarized_story": "By Ekaete BasseyMedical doctor and social media influencer, Nonso Bobby Fidelis Egemba, aka Aproko Doctor, has made his acting debut in a Netflix acquired movie.\nThe health expert stars alongside Nollywood actor, Okey Uzoeshi and Angel Unigwe in a film titled Strain and directed by Uduak-Obong Patrick.\nADVERTISEMENTSuper excited Aproko Doctor took to his Twitter account to make the announcement.\nThe doctor wrote: “Finally!\nAproko Doctor is on Netflix!"
  },
  {
    "headline": "Buhari okays recommendations to end herders attacks, ranching, forest reserves",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has okayed recommendations that would address the conflicts of herders and farmers in a sustained and lasting manner.\n“It is very clear that there was no solution offered from their resolutions to the herder-farmer clashes that have been continuing in our country for generations.\n“The entire country is acutely aware of the strain the COVID-19 pandemic has taken on public finances, for both Federal and States.\nStill, given the pressing urgency of addressing the perennial challenges, the federal funding for the project that has been delayed is now being partly unlocked.\nActual work for the full actualization of the modern reserve system in a few of the consenting states should take off in June.”"
  },
  {
    "headline": "Lagos, Ogun sign MoU, launch commission on joint border development",
    "summarized_story": "According to Sanwo-Olu, the megacity status of Lagos State necessitated the need for synergy between Lagos and neighbouring Ogun in the area of development.\nThe governor described the MOU as ‘a game changer that will transform the urban agglomeration that Lagos State has become.\nThe MoU precedes the joint development commission that will be established to mutually tackle some of the issues prevalent in key economic sectors like: transportation, the environment, housing, health, infrastructure, among others.\n‘We are cognisant of the fact that Ogun State is the only neighbour that Lagos has and that we are a natural overflow of Lagos.\nAnother manifestation of our working together is the Adiyan Water Works that, though, is in Ogun State, supplying water to the people of Lagos State."
  },
  {
    "headline": "Insecurity: Buhari meets Bello as protesters block highway",
    "summarized_story": "President Muhammadu Buhari on Monday met with Governor of Niger State, Sani Bello even as hundreds of Nigerians blocked the Abuja-Kaduna expressway in Gauraka town in his state protesting rampant kidnappings in the area.\nThe meet may not be unconnected with the heightened insecurity in Niger state.\nRecalled that Bello had recently announced that Boko Haram had hoisted their flag as they took territories in the state.\nProtesters took to the highway in Gauraka, town Monday blocking the expressway and causing traffic gridlock that extended for a few kilometers along the Abuja-Kaduna expressway.\nThe governors declined to comment on the purpose of the meeting when they were approached on the purpose of their meetingDetails later…"
  },
  {
    "headline": "Another INEC office set ablaze in Enugu",
    "summarized_story": "From Jude Chinedu, EnuguAnother office of the Independent National Electoral Commission (INEC), in Ibeagwa-aka, Igboeze South Local Government Area of Enugu State has been set ablaze by unidentified persons.\nThe incidence which occurred at about 11pm on Sunday night brings to three the number of INEC offices so far attacked in the state in less that one month.\nINEC office in Obollo-Afor in Udenu Local Government Area was first to be attacked with damages recorded.\nThe headquarters of the commission in the state was also attacked resulting in the burning of six vehicles before the intervention of men of the state fire service.\nEnugu State Chief Fire Officer Mr. Okwudili Ohaa who confirmed the report said, “there was a fire outbreak at INEC Office, Ibagwa in Igbo-Eze South Local Government Area late last night."
  },
  {
    "headline": "COAS, others death: Buhari orders flag flown at half -mast",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has ordered flag to be flown at half-mast in honour of Lt. General Ibrahim Attahiru, the late Chief of Army Staff and 10 others who died in the Friday air crash.\nIn a statement by Secretary to the Government of the Federation Boss Mustapha, the flag is to be flown in all public buildings, facilities and official residences from Monday, May 24 to Wednesday, May 26th.\nBuhari has also approved Monday as work free say for members of the Armed Forces."
  },
  {
    "headline": "Buhari Questions Legality of Southern Govs’ Ban on Open Grazing, Okays Ranching, Revival of Forest Reserves",
    "summarized_story": "The plan of action include approved actionable plan of rehabilitating grazing reserves in the states, starting with those that are truly committed to the solution and compliant with specific requirements.\nThe President also picked on the Southern Governors and described their recent decision to ban open grazing as illegal saying it infringes on the constitutional right of Nigerians to move freely in any part of the country.\nSouthern governors had at their summit in Asaba recently banned open grazing in the region to end the frequent clashes between farmers and herders and called for restructuring of the country.\nThe statement said it was very clear that there was no solution offered from the Southern Governors resolutions to the herder-farmer clashes that had been continuing in the country for generations.\n“The entire country is acutely aware of the strain the COVID-19 pandemic has taken on public finances, for both Federal and States."
  },
  {
    "headline": "Buhari: Security of Nigerians, Their Well-being, My Priority",
    "summarized_story": "CAR President, Saudi king, Anglican church scribe, commiserate with NigeriaBy Deji ElumoyePresident Muhammadu Buhari has declared that his major priority as a President is to provide adequate security for Nigerians as well as ensuring their well-being.\n“We want closer ties with Nigeria, and that is one of the reasons I am here,” President Touadera said.\nThe Saudi King expressed full solidarity with Nigeria following this national tragedy.\nThe Saudi King also prayed for the repose of the souls of the military men who lost their lives.\nPresident Buhari expressed happiness with the King and thanked him for standing with Nigeria in all situations."
  },
  {
    "headline": "News in Photographs: Flags Fly at Half Mast in State House, Govs Pay Condolence Visit to Buhari",
    "summarized_story": "Flags were flown at half mast at the State House, Abuja on Monday in honour of Army Chief Lt.Gen.\nIbrahim Attahiru, and other military officers, who died in a plane crash in Kaduna on Friday.\nAlso on Monday, the Nigerian Governors’ Forum led by their Chairman and Governor of Ekiti State, Kayode Fayemi, paid a condolence visit to President Muhammadu Buhari at the State House.\nThe governors’ delegation to the State House included Yobe State Governor Mai Mala Buni and his Niger State counterpart Alhaji Abubakar Sani Bello.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Just In: Gunmen Attack Two Plateau Communities, Kill 14",
    "summarized_story": "By Seriki AdinoyiUnknown gunmen on Sunday night killed 14 persons in two attacks on Dong and Kwi communities on the outskirts of Jos, the Plateau State capital.\nThe assailants reportedly invaded the Dong community and shot at the people sporadically, killing at least seven, including women and children.\nThe attack on Kwi took a similar pattern, leaving at least another seven dead and several others injured.\nSpokesman of Police Command in Plateau state, Mr. Gabriel Ogaba, confirmed the incident.\nMeanwhile, Security has been beefed up in that area to prevent escalation of violence.”Those killed in Dong community are Chiyena Oboche, Divine Oboche, Victoria Matthew, Praise Matthew, Danladi Matthew, Mr."
  },
  {
    "headline": "Buhari Questions Legality of Southern Govs’ Ban on Open Grazing, Okays Ranching, Revival of Forest Reserves",
    "summarized_story": "The plan of action include approved actionable plan of rehabilitating grazing reserves in the states, starting with those that are truly committed to the solution and compliant with specific requirements.\nThe President also picked on the Southern Governors and described their recent decision to ban open grazing as illegal saying it infringes on the constitutional right of Nigerians to move freely in any part of the country.\nSouthern governors had at their summit in Asaba recently banned open grazing in the region to end the frequent clashes between farmers and herders and called for restructuring of the country.\nThe statement said it was very clear that there was no solution offered from the Southern Governors resolutions to the herder-farmer clashes that had been continuing in the country for generations.\n“The entire country is acutely aware of the strain the COVID-19 pandemic has taken on public finances, for both Federal and States."
  },
  {
    "headline": "History Will Be Cruel To Tinubu, Bisi Akande, Gbajabiamila, Others Over Their Position On Yoruba Nation",
    "summarized_story": "The umbrella body for Yoruba self-determination groups, Ilana Omo Oodua, has criticised the National Leader of the All Progressives Congress, Bola Tinubu, and other APC leaders in the South-West leaders for opposing “separatist agitations”.\nSaharaReporters had reported that Tinubu and some other APC leaders in the South-West, including the Speaker of the House of Representatives, Femi Gbajabiamila had opposed agitations for Yoruba Nation at a meeting on Sunday.\nBut Ilana Oodua through its spokesperson, Maxwell Adeleye, told The PUNCH that the decision made by the APC leaders was unfortunate.\nWhat we are fighting for is the self-determination right of our people as guaranteed by the United Nations Charter on Human rights and even the 1999 constitution.\n“It is unfortunate that Chief Bisi Akande is present where the yearning and aspirations of Yoruba people will be denied."
  },
  {
    "headline": "History Will Be Cruel To Tinubu, Bisi Akande, Gbajabiamila, Others Over Their Position On Yoruba Nation",
    "summarized_story": "The umbrella body for Yoruba self-determination groups, Ilana Omo Oodua, has criticised the National Leader of the All Progressives Congress, Bola Tinubu, and other APC leaders in the South-West leaders for opposing “separatist agitations”.\nSaharaReporters had reported that Tinubu and some other APC leaders in the South-West, including the Speaker of the House of Representatives, Femi Gbajabiamila had opposed agitations for Yoruba Nation at a meeting on Sunday.\nBut Ilana Oodua through its spokesperson, Maxwell Adeleye, told The PUNCH that the decision made by the APC leaders was unfortunate.\nWhat we are fighting for is the self-determination right of our people as guaranteed by the United Nations Charter on Human rights and even the 1999 constitution.\n“It is unfortunate that Chief Bisi Akande is present where the yearning and aspirations of Yoruba people will be denied."
  },
  {
    "headline": "How Governor El-Rufai Allocated Lands Seized From Civil Servants To Family Members, Cronies",
    "summarized_story": "According to Peoples Gazette, sources in Kaduna revealed that the assets were seized from senior civil servants and their families between 2015 and 2016, barely months after El-Rufai assumed office.\nKaduna State Governor Nasir el-RufaiThe governor promised to publish a list of individuals and corporate entities that would benefit from the residential assets, but had so far failed to do so.\nThose who benefited from the questionable allotments in Kaduna’s elegant GRA include El-Rufai’s first wife, Hadiza Isma El-Rufai, second wife, Asia Ahmad El-Rufai and third wife, Aisha Garba El-Rufai.\nHis son Bashir El-Rufai also benefitted, according to the list, as well as Abubakar Sadiq, presumably the governor’s eight-year-old son.\nWhile seizing the residences, El-Rufai had argued that certain assets cannot be occupied by civil servants below level 16, defying a civil service regulation that said civil servants from level eight and above are entitled to such accommodations."
  },
  {
    "headline": "How Governor El-Rufai Allocated Lands Seized From Civil Servants To Family Members, Cronies",
    "summarized_story": "According to Peoples Gazette, sources in Kaduna revealed that the assets were seized from senior civil servants and their families between 2015 and 2016, barely months after El-Rufai assumed office.\nKaduna State Governor Nasir el-RufaiThe governor promised to publish a list of individuals and corporate entities that would benefit from the residential assets, but had so far failed to do so.\nThose who benefited from the questionable allotments in Kaduna’s elegant GRA include El-Rufai’s first wife, Hadiza Isma El-Rufai, second wife, Asia Ahmad El-Rufai and third wife, Aisha Garba El-Rufai.\nHis son Bashir El-Rufai also benefitted, according to the list, as well as Abubakar Sadiq, presumably the governor’s eight-year-old son.\nWhile seizing the residences, El-Rufai had argued that certain assets cannot be occupied by civil servants below level 16, defying a civil service regulation that said civil servants from level eight and above are entitled to such accommodations."
  },
  {
    "headline": "Presidency Knocks Southern Governors Over Ban On Open Grazing, Says Move Is Unconstitutional",
    "summarized_story": "The Presidency on Monday criticised the Southern Governors’ Forum over its ban on open grazing in the region, saying their announcement “is of questionable legality.”The Presidential spokesman, Garba Shehu, in his characteristic defence of the rampaging herdsmen, stated that the presidency found “no solution offered from their (Southern Governors’ Forum) resolutions” to the incessant herder-farmer clashes that had plagued the country for years.\n“It is very clear that there was no solution offered from their resolutions to the herder-farmer clashes that have been continuing in our country for generations.\nStill, given the pressing urgency of addressing the perennial challenges, the federal funding for the project that has been delayed is now being partly unlocked.\nActual work for the full actualisation of the modern reserve system in a few of the consenting states should take off in June,” the statement added.\nThe SGF earlier this month had at a meeting in Asaba, Delta State, jointly passed a resolution banning open grazing across the zone, due to the violent clashes between herdsmen and farmers which have claimed thousands of lives across various communities."
  },
  {
    "headline": "Presidency: Southern governors’ plan to enforce open grazing ban is of questionable legality",
    "summarized_story": "The presidency says the southern governors’ proposed plan to enforce the ban on open grazing is of “questionable legality”.\nAdvertisementAccording to the presidency, the resolution reached in Asaba, Delta state capital, will not solve the farmer-herder clashes.\nThe governors had said the decision was taken as part of efforts to improve security in the region.\nAdvertisementIn a statement on Monday, Garba Shehu, a presidential spokesperson, said President Muhammadu Buhari had earlier approved the rehabilitation of grazing reserves.\nHe added that the process for achieving full actualisation of the modern reserve system in consenting states should take off in June."
  },
  {
    "headline": "Presidency: Southern governors’ plan to enforce open grazing ban is of questionable legality",
    "summarized_story": "The presidency says the southern governors’ proposed plan to enforce the ban on open grazing is of “questionable legality”.\nAdvertisementAccording to the presidency, the resolution reached in Asaba, Delta state capital, will not solve the farmer-herder clashes.\nThe governors had said the decision was taken as part of efforts to improve security in the region.\nAdvertisementIn a statement on Monday, Garba Shehu, a presidential spokesperson, said President Muhammadu Buhari had earlier approved the rehabilitation of grazing reserves.\nHe added that the process for achieving full actualisation of the modern reserve system in consenting states should take off in June."
  },
  {
    "headline": "Reps consider bill seeking to scrap NYSC",
    "summarized_story": "The house of representatives is considering a bill seeking to scrap the National Youth Service Corps (NYSC) scheme.\nAdvertisementThe constitution alteration bill seeks to repeal section 315 (5)(a) of the 1999 constitution which establishes the NYSC and its enabling act.\nThe NYSC scheme was set up in 1973 during the military regime of Yakubu Gowon as an effort to reconcile and rebuild the country after the civil war.\nAdvertisementAbiante told TheCable on Monday that the NYSC scheme has failed to achieve its intended purpose and therefore should be discontinued.\nHe also said the scheme has led to the untimely death of some corps members who were posted to areas with serious security threats."
  },
  {
    "headline": "Reps consider bill seeking to scrap NYSC",
    "summarized_story": "The house of representatives is considering a bill seeking to scrap the National Youth Service Corps (NYSC) scheme.\nAdvertisementThe constitution alteration bill seeks to repeal section 315 (5)(a) of the 1999 constitution which establishes the NYSC and its enabling act.\nThe NYSC scheme was set up in 1973 during the military regime of Yakubu Gowon as an effort to reconcile and rebuild the country after the civil war.\nAdvertisementAbiante told TheCable on Monday that the NYSC scheme has failed to achieve its intended purpose and therefore should be discontinued.\nHe also said the scheme has led to the untimely death of some corps members who were posted to areas with serious security threats."
  },
  {
    "headline": "Buhari: Losing senior military officers in air crash has increased our problem",
    "summarized_story": "President Muhammadu Buhari says losing Ibrahim Attahiru, chief of army staff, and 10 other military officers has affected the fight against insecurity in the country.\nAdvertisementAttahiru and the military officers died on Friday in a Beechcraft 350 aircraft that crashed near the Kaduna international airport.\nAdvertisement“This is a situation that only God knows when it will happen and it happened at a time when the security situation in the country is a fundamental issue,” Buhari said.\n“The people who elected us, they know the promises we made within the time; the circumstances which we find ourselves.\nThe NGF chairman, however, added that the war against insecurity must be won."
  },
  {
    "headline": "Ethiopia awards its first private telecoms licence to Vodafone consortium",
    "summarized_story": "Ethiopia has awarded one out of the two private telco licences it intends to award to a consortium that includes the Vodafone group.\nThe consortium, which made a winning bid of $850 million, comprises Vodafone, Nairobi-based Safaricom Ltd, CDC Group Plc and Sumitomo Corp.\nEtisalat, Orange Telecoms, MTN and Saudi Telecom Company were some of the companies that registered interest.\nIn the end, only two companies put bids forward; the Vodafone consortium and MTN.\nRegardless, MTN also made a bid of $600 million which was considered not good enough, and now the second telecoms licence will now be retendered for new offers."
  },
  {
    "headline": "Successful product managers are walking encyclopedias.",
    "summarized_story": "Successful product managers need to learn a little bit about each of them because we do a lot of directing in our work.\nShould aspiring product managers expect to manage diverse teams?\nHow then do successful product managers navigate team management?\nI asked her what other skills she believes aspiring product managers need to be excellent in their roles?\nSuccessful product managers must own the product and visualize the bigger picture at all times."
  },
  {
    "headline": "Mono receives $2 million investment from Kuda CEO, Lateral Capital, others",
    "summarized_story": "Nigerian financial data startup Mono has raised a seed round of $2 million from a number of investors including Entrée Capital and Lateral Capital.\nAbdul Hassan, the startup’s CEO, told TechCabal at the time that YC was an opportunity to make strategic connections.\nBut beyond making connections, Mono appears to be expanding its focus beyond financial data.\n“We’re thinking of how we can power the internet economy with data that isn’t necessarily financial data,” Hassan said.\nOne thing on his mind is “open data for telcos,” a framework that enables customers to easily move their data between mobile network providers."
  },
  {
    "headline": "New FirstBank Website Puts YOU, the customer, First!",
    "summarized_story": "With this design, the FirstBank website reformats to fit the screen of whatever device the visitor is using to view it and allows users the flexibility to conduct business wherever they may be.\nOn its new website, FirstBank puts an obvious button to online banking in top navigation so visitors know exactly where to go.\nSeparate Product Pages with Strong Calls-to-ActionThe FirstBank website has unique secondary pages for every product, and clear calls-to-action for people to be able to navigate to those pages.\nWith the new FirstBank website, customers are at an edge in the industry as they establish a relationship with the Bank that puts YOU, its customers, First.\nYou can visit the new FirstBank website here."
  },
  {
    "headline": "Lumos Nigeria Wins the Sabre 2021, Africa’s Biggest PR Award",
    "summarized_story": "14th May, 2021 – Lumos, Africa’s leading solar home system provider in conjunction with Modion Communications, a fast-rising PR Agency in Africa, has won the Sabre Award for 2021 for its social PR campaign supporting indigent schoolgirl Fathia Dele Rasheed, from Ondo State, Southwest, Nigeria in February 2020.\nThe African Sabre Award is the continent’s biggest prize for superior achievement in Public Relations and Corporate Social Responsibility.\nAs part of the campaign, Lumos Nigeria tracked Dele after a picture of her doing her homework at night with illumination from an ATM facility surfaced on social media.\n“We are thrilled to see that the campaign has inspired renewed awareness on the adoption of solar power as an affordable alternative to the perennial power supply deficit in Nigeria.\nThis was in addition to installing its solar systems at Primary Health Centres across 20 Local Governments in Lagos State to help improve quality healthcare delivery to grassroots communities."
  },
  {
    "headline": "Labour-intensive sectors’ slow growth means no relief for Nigeria’s jobless",
    "summarized_story": "Until Nigeria’s economic growth outpaces population growth rate or at least labour-intensive sectors grow at a faster pace, there is no relief in sight for unemployment in Africa’s most populous nation.\nNigeria produces people at an average of 2.6 percent annually, leaving the country’s 0.51 percent GDP growth in the first quarter of 2021, anything…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria’s largest FMCGs’ profits far from pre-pandemic levels",
    "summarized_story": "The stagnant profit of Nigeria’s largest Fast Moving Consumer Goods (FMCGs) companies is the latest sign of how Africa’s largest economy is gasping for breath.\nBusinessDay’s analysis of the financial statements of Nestle Nigeria, Dangote Sugar, Cadbury, Unilever, and NASCON reveals that their cumulative profit after tax for the period ended March 2021 was N21.43…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Thirst for debt: Companies’ borrowing to remain robust in 2021",
    "summarized_story": "Thirst for debt: Companies’ borrowing to remain robust in 2021Corporate debt issuance in Nigeria is expected to remain robust throughout 2021 even as interest rates begin to rise from last year’s record low levels, according to a new research by GCR Nigeria credit ratings.\nNigerian corporates issued a record N1.02 trillion ($2.69bn) of local currency debt instruments in 2020, the highest since at least…"
  },
  {
    "headline": "One feared dead as police foil attempt to set station ablaze – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – Police in Lagos State on Monday foiled an attempt to set ablaze the Oke-Odo Police Station in Ile-Epo area after a commercial motorcyclist was allegedly killed in the area.\nThey set fire on car tyres to protest the alleged killing adding that they had had enough of the policemen.\n“Policemen killed someone yesterday, Sunday, May 23.\nThis made the people around to get angry and decided to take their grievances to the Oke-Odo Police Station.\n“The command wishes to debunk the rumour that lle Epo Police Station was set ablaze by some hoodlums."
  },
  {
    "headline": "2021 UTME: Jamb tells candidates to reprint mock examination slips – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Joint Admissions and Matriculations Board (JAMB) has asked candidates sitting for its mock Unified Tertiary Matriculation Examination (UTME) to reprint their examination slips.\nJAMB stated that candidates, who had indicated interests to sit for the mock- UTME and had earlier printed the examination slips, were advised to reprint, following the shift in examination date.\n“Candidates, who had registered for the 2021 UTME and indicated interest to sit for the optional mock examination, are to reprint their mock notification slips.\n” This is consequent on the change of date for the mock- UTME earlier scheduled for Thursday, May 20 and now to hold on Thursday, June 3.\nJAMB also said it had so far, registered 1,223,962 UTME candidates and 63,586 DE candidates."
  },
  {
    "headline": "Former Chief Judge Urge Parents to Encourage Children to Join the Boys’ Brigade – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – A former Chief Judge in Edo State Hon.\nJustice Esohe Ikponmwen has called on parents to allow their children join the Boys’ Brigade to be trained and disciplined with the fear of the Lord as they grow up in the society.\nWhen they get into the Boys’ Brigade they will turn out to be good citizens.”While commending the Boys’ Brigade for what they are doing, she disclosed that the elderly are responsible to train the young ones, which she has committed her life to and she thanked God for the rare privilege to be honoured into the Boys’ Brigade Hall of Fame.\nThe State President, Boys’ Brigade Nigeria, Edo State Council, Sir (Dr) B.J Braie disclosed that upon the creation of Edo and Delta States from the defunct Midwest/Bendel State in the year 1991, the Boys’ Brigade Nigeria, Edo Council took her foundation.\nBishop Imasuen commended and thanked the Boys’ Brigade for the award and he urged them to continue with the good work."
  },
  {
    "headline": "Obaseki’s community security initiative gets kudos, commendations – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has continued to receive commendations from community, religious and traditional leaders, residents and Edos in Diaspora, among others, for improving the state’s security architecture and proactively responding to security challenges in the state through his community-based security agency, Edo Vigilante Network.\nThe Obaseki-backed Edo State Community Vigilante Security Network has consistently displayed bravery in confronting criminals and kidnappers and rescuing kidnap victims across the state, especially in the Ahor axis of Aduwawa Bypass, along Benin-Auchi Expressway.\nFollowing giant strides recorded in the provision of security in Edo State, a legal practitioner based in Benin has hailed the governor for ensuring peace and security and the protection of lives and property of citizens.\n“However, His Excellency, being a man of great insight and action, immediately swung into action, mobilizing the various security agencies of the State in order to forestall any breakdown of law and order.\n“It is in light of the above that I, as a resident of the state, deemed it imperative to write to His Excellency and appreciate his efforts in ensuring the security of lives and property of citizens in and around the State.”..."
  },
  {
    "headline": "Buhari flays governors over open-grazing ban, approves rehabilitation of reserves",
    "summarized_story": "ADVERTISEMENTPresident Muhammadu Buhari has approved the rehabilitation of grazing reserves across the country as from June, to curb the bloody clashes between herders and farmers across the country.\nThis development comes a few days after southern governors banned open grazing in the entire region.\nThe entire country is acutely aware of the strain the COVID-19 pandemic has taken on public finances, for both Federal and States.\nStill, given the pressing urgency of addressing the perennial challenges, the federal funding for the project that has been delayed is now being partly unlocked.\nActual work for the full actualization of the modern reserve system in a few of the consenting states should take off in June."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Banditry: Protesters burn police station in Niger",
    "summarized_story": "Protesters have burnt a police station in Gauraka in Tafa Local Government Area of Niger State.\nThe protests had followed an attack by gunmen on Angwan-Wazobia community on Monday where six locals were abducted by the assailants.\nThe protesters had burnt tyres as they called for improved security in the area, as well as an end to incessant attacks on their community.\nWasiu Abiodun, the Police Public Relations Officer in the state, confirmed the attack on the community and the station in a statement.\nAbiodun said the command had deployed operatives in the area, but he blamed the protesters for the attack on the police outpost."
  },
  {
    "headline": "INEC says attacks INEC on its offices a national emergency",
    "summarized_story": "Nigeria’s electoral body, the Independent National Electoral Commission (INEC) has decried repeated attacks on its offices in different states, especially in Southeast, describing it as a national emergency.\n“The Independent National Electoral Commission (INEC) met in emergency session today, Monday 24th May 2021, as attacks on its facilities in some states of the Federation continue unabated,” Okoye said.\n“In the latest incidents, three offices of the Commission came under attack in Anambra, Imo and Enugu States.\n“The attacks on the Commission’s facilities have now become a national emergency.\n“In spite of these setbacks, the Commission is determined to continue to discharge its responsibilities including the conduct of the scheduled Anambra Governorship election,” the statement concluded."
  },
  {
    "headline": "Nigeria’s Fintech startup, Mono raises $2m to power internet economy in Africa",
    "summarized_story": "OBINNA EZUGWUNigerian fintech startup, Mono says it has raised $2 million to power internet economy in Africa.\nThis investment comes just nine months after Mono raised $500,000 in pre-seed last September and two months after receiving $125,000 from Ycombinator.\n“I’m excited to share that Mono has raised a $2M Seed round of funding from Entrée Capital (Investors in Stripe, Gusto, Kuda) and Gbenga Oyebode’s fund (TCVP), and our existing investors, Lateral Capital, also participated.\nOur mission stays the same, which is to power the internet economy in Africa.”Mono is one of the three API fintech companies to have raised a seed investment this year.\nLast month, Nigerian fintech, Okra raised $3.5 million while Stitch, a South African API fintech, launched with $4 million in February."
  },
  {
    "headline": "Nigeria’s Champions of Infrastructure on Parade",
    "summarized_story": "The list of Champions of infrastructure in no particular order is made of former Governor of Rivers State and incumbent Minister of Transportation, RT.\nAs Rivers State Governor, Mr. Amaechi executed infrastructure projects like construction of roads, hospitals, schools and modernization of transportation services.\nHe served two terms as Governor of Lagos State from May 29, 2007 to May 29, 2015.\nHe also served in Lagos state in various capacities, including:Secretary of the Lands Sub-Committee of the Transitional Work Groups- 1999.\nGovernor of Lagos stateBabatunde Raji Fashola commenced a four-year tenure as the Executive Governor of Lagos State in Nigeria on 29 May 2007."
  },
  {
    "headline": "Constitution Review Exercise Ends July – Senate",
    "summarized_story": "The Senate has assured that it would pass the Constitution Alteration Bills before it proceeds on annual recess by July this year.\nDeputy President of the Senate and chairman, Senate Committee on Constitution Review, Senator Ovie Omo-Agege, made the disclosures in Abuja on Monday, at a press conference heralding the zonal public hearing on alteration of the Constitution, billed for May 26 and 27, 2021 across the country.\nThe Deputy President of the Senate also disclosed that the national public hearing is scheduled to hold on June 3 and 4 in Abuja.\nThis, he added, was to give opportunity to government agencies and other stakeholders who could not attend the zonal public hearing.\nOthers are electoral reforms; socio-economic and cultural rights as contained in Chapter 2 of the Constitution; strengthening the independence of oversight institutions and agencies created by the constitution or pursuant to an act of the National Assembly; residency and indigene provisions; immunity; National Assembly and state creation."
  },
  {
    "headline": "Constitution Review Exercise Ends July – Senate",
    "summarized_story": "The Senate has assured that it would pass the Constitution Alteration Bills before it proceeds on annual recess by July this year.\nDeputy President of the Senate and chairman, Senate Committee on Constitution Review, Senator Ovie Omo-Agege, made the disclosures in Abuja on Monday, at a press conference heralding the zonal public hearing on alteration of the Constitution, billed for May 26 and 27, 2021 across the country.\nThe Deputy President of the Senate also disclosed that the national public hearing is scheduled to hold on June 3 and 4 in Abuja.\nThis, he added, was to give opportunity to government agencies and other stakeholders who could not attend the zonal public hearing.\nOthers are electoral reforms; socio-economic and cultural rights as contained in Chapter 2 of the Constitution; strengthening the independence of oversight institutions and agencies created by the constitution or pursuant to an act of the National Assembly; residency and indigene provisions; immunity; National Assembly and state creation."
  },
  {
    "headline": "FCT Taskteam Impounds 72 Vehicles, Motorcycles, Tricycles",
    "summarized_story": "It was observed that no fewer than 41 motorcycles, 22 vehicles and 14 tricycles were impounded during the exercise that lasted for six hours.\nSome of the areas raided included Area 3 junction, Apo roundabout, Guzape junction near former SARS headquarters, AYA Roundabout.\nA.A. Rano, Old CBN Junction in Garki, Apo Bridge, Gudu Market Junction, Galadimawa Roundabout and Main Entrance of Games Village.\nHead of FCT DTRS Taskteam, Adamu Shehu Maiwada, led the officials drawn from Abuja Environmental Protection Board (AEPB), various traffic management and security agencies during the exercise.\nADVERTISEMENT“You are not expected to form an illegal motor park, and feel that it’s your private business, but there is law in place."
  },
  {
    "headline": "FCT Taskteam Impounds 72 Vehicles, Motorcycles, Tricycles",
    "summarized_story": "It was observed that no fewer than 41 motorcycles, 22 vehicles and 14 tricycles were impounded during the exercise that lasted for six hours.\nSome of the areas raided included Area 3 junction, Apo roundabout, Guzape junction near former SARS headquarters, AYA Roundabout.\nA.A. Rano, Old CBN Junction in Garki, Apo Bridge, Gudu Market Junction, Galadimawa Roundabout and Main Entrance of Games Village.\nHead of FCT DTRS Taskteam, Adamu Shehu Maiwada, led the officials drawn from Abuja Environmental Protection Board (AEPB), various traffic management and security agencies during the exercise.\nADVERTISEMENT“You are not expected to form an illegal motor park, and feel that it’s your private business, but there is law in place."
  },
  {
    "headline": "Plane Crash: Buhari Postpones FEC, PSC Meetings",
    "summarized_story": "President Muhammadu Buhari has directed that the weekly Federal Executive Council (FEC) meeting scheduled to hold on Wednesday, May 26, 2021 be postponed to Wednesday, June 2, 2021.\nSecretary to the government of the federation, Boss Mustapha, stated this on Monday in a statement sent to journalists.\nHe also said the president has directed that the Police Council (PC) meeting which was earlier scheduled for Thursday May 27, 2021 be postponed to Thursday June 3, 2021.\nThe postponements are in honour of the memory of the late Chief of Army Staff, Lt. Gen. Ibrahim Attahiru and 10 other senior military officers and service men, who died in a plane crash in Kaduna on Friday.\nREAD ALSO: Plane Crash :PMB Directs National Flag To Fly At Half Mast"
  },
  {
    "headline": "ARAN commends FG over efforts to recover stolen artifacts",
    "summarized_story": "By Tom OkpeArtifacts Rescuers Association of Nigeria, (ARAN) a body responsible for rescue of Nigeria artifacts and its patrimonies has commended Minister of Information and Culture, Alhaji Lai Mohammed over his recent call for all artifacts looted from Nigeria by foreigners to be returned.\nThe President, Obalosa Bamidele made the commendation in Abuja on Monday while speaking with journalists saying that Alhaji Mohammeds’ call is yielding fruitfulness with some foreign institutions with the nations’ patrimonies agreeing to negotiate with the country for possible returns.\nThe German Government and Museums, both of which are currently at the forefront of repatriating the nations’ antiquities set the stage for a global movement to restitute colonial loot with its March announcement that it planned to hand over some Benin bronze to Nigeria.\nAlso, the Jesus College at the University of Cambridge has pledged to return a bronze cockreal along with the University of Aberdeen in Europe, committed in returning a Benin bronze, head of an oba (king) in its possession, acquired in a way that is considered extremely immoral.\nObalosa reiterated the commitment of his associations’ readiness to continue working with the Federal Government and all security agents in the country, assuring that all Nigeria’s treasures will be returned."
  },
  {
    "headline": "NYSC partners cereals research institute on modern agric training",
    "summarized_story": "By Ukpono UkpongNational Youth Service Corps (NYSC), has signed a Memorandum of Understanding with the National Cereals Research Institute (NCRI), Badeggi, Niger State, on the training of Corps Members and Staff on modern farming methods.\nThe formalization of partnership by the two agencies comes as NYSC is revamping its agricultural programme in line with the Federal Government’s policy on diversification of the economy.\nREAD ALSO: Nigeria to help other African nations in aviation, says Sirika“NYSC is a proactive agency that encourages Corps Members to be self-reliant instead of seeking for salaried jobs”, he said.\n“We are ready to partner with NYSC, and l wish to assure that we will not let you down.\n“This MoU will enhance the efficient usage of limited human and material resources that will improve productivity”, he said."
  },
  {
    "headline": "Attacks in INEC facilities, national emergency",
    "summarized_story": "Tunde Opalana, AbujaNational Commissioner & Chairman, Information and Voter Education Committee, Barrister Festus Okoye on Monday in Abuja declared that incessant attacks on INEC facilities has reached a crescendo and a national emergency needs to be declared.\nHe was reacting to the latest three fire incidents in INEC offices in Anambra, Imo and Enugu states.\nHe disclosed that all three incidents in Anambra, Imo and Enugu have been reported to the police for investigation.\n“Although no lives were lost, these are clearly orchestrated and targeted attacks aimed at incapacitating the Commission in conducting electoral activities, especially in Anambra State.\n“In spite of these setbacks, the Commission is determined to continue to discharge its responsibilities including the conduct of the scheduled Anambra Governorship election”, he said.."
  },
  {
    "headline": "INEC explains use of new registration device for CVR —",
    "summarized_story": "The Independent National Electoral Commission (INEC) says it adopted the use of Voter Enrolment Device (VED) for resumption of Continuous Voter Registration (CVR) to deepen the use of technology in electoral process.\nMr Festus Okoye, INEC National Commissioner and Chairman, Information and Voter Education Committee, said this when he spoke with the News Agency of Nigeria (NAN) on Monday in Abuja.\n“INEC has broken a 25-year-old jinx relating to the expansion of voter access to polling units, and Nigerians will have at their disposal new polling units.\n“The polling units will enable persons with disability, pregnant women and the elderly to access the units with less stress.\nOkoye said that the voter registration was at the heart of the democratic process, as it would enable Nigerians who had attained the constitutional age for registration to register and exercise their democratic franchise."
  },
  {
    "headline": "Weeping as gunmen kill 20 in Plateau attacks",
    "summarized_story": "No fewer than 20 people have been killed and many others injured when suspected herdsmen attacked communities in three local government areas of Plateau State.\nSome residents in the affected communities confirmed the attacks and the casualties to reporters.\nThey were said to have killed seven at Dong, six in Kadardo and seven in Kwi in three separate attacks in the communities.\nThese attacks came few days after acting Inspector General of Police, Usman Baba, alerted of intelligence reports that terrorists were planning to attack Abuja and Plateau state.\n“Investigation is ongoing, frantic effort is on to arrest the fleeing suspects.”He was yet to confirm the other attacks and casualties."
  },
  {
    "headline": "Weeping as gunmen kill 20 in Plateau attacks",
    "summarized_story": "No fewer than 20 people have been killed and many others injured when suspected herdsmen attacked communities in three local government areas of Plateau State.\nSome residents in the affected communities confirmed the attacks and the casualties to reporters.\nThey were said to have killed seven at Dong, six in Kadardo and seven in Kwi in three separate attacks in the communities.\nThese attacks came few days after acting Inspector General of Police, Usman Baba, alerted of intelligence reports that terrorists were planning to attack Abuja and Plateau state.\n“Investigation is ongoing, frantic effort is on to arrest the fleeing suspects.”He was yet to confirm the other attacks and casualties."
  },
  {
    "headline": "Another INEC office burnt in Enugu",
    "summarized_story": "Barely one week after the headquarters of the Independent National Electoral Commission (INEC) was set ablaze in Enugu, the capital of Enugu State, another office of the commission in Igboeze South council area of the state, has been razed by hoodlums.\nEfforts to speak with the Enugu INEC Resident Electoral Commissioner, Dr. Emeka Ononamadu and the INEC spokesman in Enugu, Pius Eze failed as calls put to their phones were not responded to.\nAccording to Ohaa, “There was a fire outbreak at INEC Office, Ibagwa in Igbo-Eze South Local Government Area late last night.\nThe Nation reports that the latest incident was the third INEC office to be attacked and burnt by hoodlums in less than one month in Enugu State.\nThe State INEC headquarters in Enugu was later attacked where six Hilux vans were razed."
  },
  {
    "headline": "Another INEC office burnt in Enugu",
    "summarized_story": "Barely one week after the headquarters of the Independent National Electoral Commission (INEC) was set ablaze in Enugu, the capital of Enugu State, another office of the commission in Igboeze South council area of the state, has been razed by hoodlums.\nEfforts to speak with the Enugu INEC Resident Electoral Commissioner, Dr. Emeka Ononamadu and the INEC spokesman in Enugu, Pius Eze failed as calls put to their phones were not responded to.\nAccording to Ohaa, “There was a fire outbreak at INEC Office, Ibagwa in Igbo-Eze South Local Government Area late last night.\nThe Nation reports that the latest incident was the third INEC office to be attacked and burnt by hoodlums in less than one month in Enugu State.\nThe State INEC headquarters in Enugu was later attacked where six Hilux vans were razed."
  },
  {
    "headline": "Buhari mocks, queries southern governors for banning open grazing",
    "summarized_story": "* Approves rehabilitation of grazing reserves, equipped with veterinary clinics, schools, housing for herdsmen*Queries the power of the governors to ban open grazingBy Bayo OnanugaPresident Muhammadu Buhari mocked southern governors on Monday over their ban of open grazing of cattle, the cause of deadly clashes between herdsmen and farmers and also a factor in the banditry and kidnapping that have made many parts of Nigeria unsafe.\nIn a statement that betrayed Buhari’s bias in statecraft, he dismissed the ban on open grazing by the governors, which was earlier endorsed by their northern counterparts.\nHe said the ban was a mere ‘attempt’,at banning and merely demonstrated “other acts of politicking intended by its signatories to demonstrate their power”.\nThe Aso Rock statement also repeated the fallacy by the Attorney General of the Federation that the governors have no power to ban open grazing, by comparing herdsmen with auto spare parts sellers, who are ubiquitous in many states.\nThe measures included the reactivation of grazing reserves from June, in states, “truly committed to the solution and compliant with stated requirements”."
  },
  {
    "headline": "2021 UTME: JAMB candidates to reprint mock exam slips",
    "summarized_story": "By Veronica DariyaThe Joint Admissions and Matriculations Board (JAMB) has asked candidates sitting for its mock Unified Tertiary Matriculation Examination (UTME) to reprint their examination slips.\nJAMB stated that candidates, who had indicated interests to sit for the mock- UTME and had earlier printed the examination slips, were advised to reprint, following the shift in examination date.\n“Candidates, who had registered for the 2021 UTME and indicated interest to sit for the optional mock examination, are to reprint their mock notification slips.\n” To print the slip, candidates are to visit the website then click on the facility and print their slips,” it stated.\nSo far, JAMB said it had registered 1,223,962 UTME candidates and 63,586 DE candidates."
  },
  {
    "headline": "Mayhem in Ile-Epo: Police, okada riders clash, one killed",
    "summarized_story": "By Kazeem UgbodagaPandemonium ensued at the Ile-Epo Market on Monday as okada riders were said to have engaged the police a battle following alleged killing of one of their members by a police officer.\nThe entire market was deserted as irate youths went on rampage and attacked the Ile-Epo police station.\nUnconfirmed sources said policemen attached to the Ile-Epo police station killed an okada rider which ignited the riot.\nIt was gathered that the hoodlums mobilized and attempted to burn the Ile-Epo police station but their efforts were thwarted.\nPolice officers were seen driving in convoy along the deserted Ile-Epo market trying to quell the riot."
  },
  {
    "headline": "BREAKING: Southern Governors’ Ban On Open Grazing Political, Unconstitutional – Presidency",
    "summarized_story": "The prohibition on open grazing enacted by the Southern Governors has been chastised by the White House.\nThe Southern Governors allegedly attempted to impose a moratorium on open grazing to display their dominance, according to the report.\nOn Monday, Garba Shehu, a senior special assistant to the President on media and publicity, issued a statement to that effect.\nA ban on open-grazing of cattle and the need for ranching are among the state governors’ resolutions.\nThe Governors also discussed the urgent necessity for reorganization in order to achieve parity with other areas."
  },
  {
    "headline": "Buhari Turns Against Killer Herdsmen, Tackles Southern Govs On Open Grazing Ban",
    "summarized_story": "President Muhammadu Buhari on Monday expressed a strong resolve to address the conflicts of herders and farmers for a permanent solution.\nThe Nigerian leader also ordered that the associated problem of the gun-wielding “killer herdsmen” be tackled.\nThe presidency insisted that Buhari’s action was before the ban on open grazing by the Southern Governors Forum.\nGarba said the citizens of the southern states and others have a right to expect their elected leaders and representatives to find answers to challenges of governance and rights.\nHe noted that the President has rightly been worried about these problems more than any other citizen in consultation with farmers and herders alike."
  },
  {
    "headline": "JUST IN: FG To Relocate Kaduna Forestry College",
    "summarized_story": "Following the recent kidnap of about 37 students at Federal College of Forestry Mechanisation, the Federal Government had concluded plans to relocate the institution from Afaka to a safer location within Kaduna Metropolis.\nThe government also disclosed that school fees of all the 37 kidnapped and released students have been waived throughout their study in the institution.\nProvost of the College, Dr. Usman M.B disclosed this on Monday while addressing a press conference at the College in Afaka, Igabi Local Government Area of Kaduna State.\nRecall that The Nation had reported that bandits on 11th March, 2021 stormed the College around 10pm and whisked 37 students, mostly females into the forest.\nMinister and the Permanent Secretary, Federal Ministry of Environment, the Board Chairman, DG-FRIN and the Commissioner of Police, Kaduna State Command, Alh."
  },
  {
    "headline": "Breaking: Buhari okays ranching, revival of forest reserves, sets take off date",
    "summarized_story": "“It is very clear that there was no solution offered from their resolutions to the herder-farmer clashes that have been continuing in our country for generations.\n“With veterinary clinics, water points for animals, and facilities for herders and their families including schooling – through these rehabilitated reserves, the Federal Government is making far-reaching and practical changes allowing for different communities to co-exist side-by-side: supporting farmers to till their fields, herders to rear their livestock and Nigerians everywhere to be safe.\n“The entire country is acutely aware of the strain the COVID-19 pandemic has taken on public finances, for both Federal and States.\nStill, given the pressing urgency of addressing the perennial challenges, the federal funding for the project that has been delayed is now being partly unlocked.\nActual work for the full actualization of the modern reserve system in a few of the consenting states should take off in June.”Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Pictures: Buhari receives Fayemi, Buni, other govs on condolence visit in honour of late COAS, 10 other fallen soldiers",
    "summarized_story": ""
  },
  {
    "headline": "VIDEO: Watch as residents protest over abduction of 2 in Niger community",
    "summarized_story": "NextRidding the North of Boko Haram and other ills"
  },
  {
    "headline": "Obaseki Harmonizes Edo PDP With APC Decampees -NigPilot",
    "summarized_story": "Following the vote of confidence passed on Godwin Obaseki of Edo state Governor by stakeholders of Peoples Democratic Party PDP, the party has approved the harmonization of the party executives.\nThis is to pave way for lasting peace, thereby setting the motion in place to name his cabinet any moment from now.\nOther positions to be filled with the new members from APC who joined PDP include the State Publicity Secretary, Assistant Secretary, Women Leader, among others.\nThe crisis was however finally resolved during the weekend with the harmonization of the new members who joined PDP along with him during the governorship election with the old ones.\nThere has been outcry by the new PDP members complaining that they were not represented in the hierarchy of the party, a situation which the Governor did not take likely."
  },
  {
    "headline": "2023: APC national convention, congresses in June uncertain – Akpanudoedehe -NigPilot",
    "summarized_story": "There are indications that the ruling All Progressives Congress, APC, might not hold its State congresses and national convention in June this year as expected despite several calls from different quarters.\nSecretary to the national caretaker committee of APC, Sen. James Akpanudoedehe, gave the indication Monday while speaking with journalists at the national secretariat of the party citing insecurity and secessionists agitations in some sections of the country.\nConvention can be done in June and congresses can start and end in June but it all depends on what the leaders of this party agreed upon.\nWe have major stakeholders like Mr President, Vice President, Governors among others.\nThe 6-month tenure extension granted the governor Buni-led caretaker committee will expire on June 8, 2020."
  },
  {
    "headline": "NAPTIP bursts child trafficking syndicate in Abuja, rescues 4 children -NigPilot",
    "summarized_story": "Operatives of the National Agency for the Prohibition of Trafficking in Persons, NAPTIP have arrested a member of a notorious child trafficking syndicate said to be specialized in trafficking children for begging within the Federal Capital Territory, Mrs.\nA total of four stolen children believed to be from different parents were also recovered from the suspect and many other children still believe to be at large.\nThe development represents a major feat in the Agency’s determination to curtail incidence of Child Trafficking especially within the Nation’s capital.\nThe arrest of the suspect followed a tip – off from a media partner who alerted the Agency of the activities of the suspect especially around the popular AYA busy bus terminal, Abuja.\n“We shall surely fish out the fleeing members of the syndicate and they shall face the full wrath of the law”, she said."
  },
  {
    "headline": "FG restates commitment to flush out unqualified teachers -NigPilot",
    "summarized_story": "Federal Government has restated its commitment to flush out unqualified teachers from teaching in all the government-owned and private schools across the country.\nWhile supervising the conduct of the exercise in Abuja on Saturday, the Permanent Secretary, Federal Ministry of Education, Arc Sonny Echono, noted that the move was to ensure the professionalization of teachers.\n“We have commenced the process of enforcing and implementing the policy of allowing only qualified teachers in all our schools across the country.\nAccording to him, a database of all qualified teachers has been compiled, adding that the government will make available the database to states to facilitate employment of qualified teachers who are not currently engaged.\nWhile disclosing that Osun state has the highest number of candidates, she added that all teachers must sit and pass the examination before they would be considered as qualified teachers."
  },
  {
    "headline": "Kaduna Crash: Losing Choice Officers Has Increased Our Problems, Buhari Laments",
    "summarized_story": "President Buhari told the delegation that he is hoping that God would provide the enablement for the nation to deal with challenges.\n“To lose choice officers has increased our problem but we know what we are in for and we will continue to work hard and pray hard so that God will give us the power to appreciate and apply ourselves to the problem,” President Buhari said.\nWhile noting that the death of the officers was a big blow to President Buhari, Governor Fayemi reiterated the President’s unrelenting resolve to fight the war against insecurity.\n“We know that this is a major blow and you’re unrelenting in your quest/commitment to ensure peace and security in our country.\nThe Beechcraft 350 aircraft conveying the military officers, with registration number 5N-R203, was billed to land at the Nigerian Airforce Base in the Mando area of Kaduna but diverted to land at the civil airport."
  },
  {
    "headline": "Police Station Burnt Amid Protest In Niger",
    "summarized_story": "A police station has been burnt amid a protest by residents of Gauraka in Tafa Local Government Area of Niger State.\nThis followed an attack by gunmen on Angwan-Wazobia community on Monday where six locals were abducted by the assailants.\nWasiu Abiodun, the Police Public Relations Officer in the state, confirmed the attack on the community and the station in a statement.\nChannels Television had reported the demonstration by residents of Gauraka who blocked the Abuja – Kaduna highway to protest the incessant cases of kidnapping in the community.\nHe called on parents, guardians, and community leaders in the area to caution their children/wards against engaging in acts of public disturbance."
  },
  {
    "headline": "Suspected Herdsmen Kill 16 Persons In Jos North, Riyom LGAs",
    "summarized_story": "Sixteen persons have been reported killed in two separate attacks in Jos North and Riyom Local Government Areas of Plateau State by men suspected to be herders.\nThe attack in Dong village of Jos North occurred at about 8.00 p.m. on Sunday as the village came under siege with sporadic gunshots.\nThe Village Head, Daniel Choji told Channels Television that the attackers came under the cover of darkness to unleash terror on the community.\nHe said the attack left eight persons dead comprising of five females, two males, and an infant.\nHe added that security personnel have been deployed to the affected areas to forestall the breakdown of law and order."
  },
  {
    "headline": "Protesters Block Abuja-Kaduna Highway, Demand End To Kidnapping, Banditry",
    "summarized_story": "﻿Residents of Gauraka community in Tafa Local Government Area of Niger State have blocked the Abuja-Kaduna highway to protest the incessant cases of kidnapping in the community.\nThe protesters burnt tyres and halted vehicular movement on the highway.\nThey demanded that the state and Federal Government boost security in the area and end the incessant attacks.\nThis comes after kidnappers stormed the area on Saturday and Sunday kidnapping at least fifteen persons from the community and killing three others.\nResidents lament that they have long lost sleep due to the activities of kidnappers who have continued to terrorise the community."
  },
  {
    "headline": "Lawmakers Fault NHIS For Spending Over N152m To Buy Face Masks, Others",
    "summarized_story": "Members of the House of Representatives Committee on Finance have faulted the National Health Insurance Scheme (NHIS) for spending over N152 million on the purchase of face masks, hand sanitisers, and protective wears during the COVID-19 lockdown in 2020.\nSurprise and disbelief greeted the faces of the lawmakers following a document presented by the NHIS containing the details of its expenditures.\nThereafter, the lawmakers raised questions on the expenditures and requested a response from the NHIS Executive Secretary, Professor Mohammed Sambo, who appeared before them with his team.\nIn his defence, Sambo noted that the agency provided more items under its social corporate responsibility for some social workers on the frontline.\nSambo informed the lawmakers that the scheme had a huge infrastructure that required cooling."
  },
  {
    "headline": "Buhari postpones FEC, Police Council Meetings in honour of Attahiru, 10 others",
    "summarized_story": "President Muhammadu Buhari has approved the postponement of the Federal Executive Council and the Police Council meetings this week, following the deaths of the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, and ten other senior military officers and service men.\nA statement issued by the Secretary to the Government of the Federation, Boss Mustapha on Monday in Abuja said “Further to the directive of Mr. President for the National Flag to fly at half-mast nationwide from 24th – 26th May, 2021 and the declaration of today, Monday 24th May, 2021, as work free-day for members of the Armed Forces, the President has also directed that the Federal Executive Council Meeting scheduled to hold on Wednesday, 26th May, 2021 be postponed to Wednesday, 2nd June, 2021.\n“Similarly, the Police Council Meeting which was earlier scheduled for Thursday 27th May, 2021 be postponed to Thursday 3rd June, 2021 in honour of the memory of the late Chief of Army Staff, Lt. Gen. Ibrahim Attahiru and 10 other Senior Military Officers and Service Men.\n“President Muhammadu Buhari urges all citizens to use this period of mourning to pray for the repose of the souls of the departed and strength for the family to bear the painful loss”."
  },
  {
    "headline": "Buhari approves deep rooted solutions to herdsmen attacks, clears way for ranching, revival for forest reserve",
    "summarized_story": "It is clear that their resolutions did not provide a solution to the herder-farmer conflicts that have raged in our country for generations.\nWith veterinary clinics, water points for animals, and facilities for herders and their families including schooling – through these rehabilitated reserves, the Federal Government is making far-reaching and practical changes allowing for different communities to co-exist side-by-side: supporting farmers to till their fields, herders to rear their livestock and Nigerians everywhere to be safe.\nThe entire country is acutely aware of the strain the COVID-19 pandemic has taken on public finances, for both Federal and States.\nStill, given the pressing urgency of addressing the perennial challenges, the federal funding for the project that has been delayed is now being partly unlocked.\nActual work for the full actualization of the modern reserve system in a few of the consenting states should take off in June."
  },
  {
    "headline": "WHO: Vaccine Inequality ‘Failing Vulnerable People’",
    "summarized_story": "The World Health Organisation (WHO) says all health workers and elderly worldwide would have been vaccinated against coronavirus by now if jabs have been distributed equitably.\nThe head of the WHO, Tedros Adhanom Ghebreyesus in an appeal for more doses for poorer countries said governments vaccinating low-risk groups were doing so at the expense of vulnerable people elsewhere.\nHe described the unequal distribution as scandalous and said it was perpetuating the pandemic.\nDr Tedros urged more pledges for the UN’s vaccine distribution programme – Covax.\nHe said the world should aim to vaccinate at least ten per cent of people in every country by September, and 30% by the end of the year."
  },
  {
    "headline": "Drake Wins Billboard Artist of the Decade Award, The Weeknd Dominates with Ten Wins",
    "summarized_story": "Canadian popstar Drake was honoured with the prestigious Artist of the Decade award at the Billboard Awards on Sunday night.\nDrake placed his first song on the Billboard Hot 100 chart in 2009, and since has logged the most songs ever on the chart, with 232 entrees.\nAmong his prizes were best artist; top Hot 100 album for After Hours; and top Hot 100 song for Blinding Lights.\nThe star, whose real name is Abel Tesfaye, more than doubled his career total of Billboard Music Awards, having previously received nine trophies.\nMachine Gun Kelly, who started in rap but has had recent success on the rock charts, won top rock artist and top rock album."
  },
  {
    "headline": "Nigeria: Terrorists Abduct 25 in Niger State, Incensed Protesters Block Abuja-Kaduna Highway – Arise News",
    "summarized_story": "Protesters in Nigeria’s north-central Niger state are currently demonstrating along the Abuja-Suleja-Kaduna expressway over incessant attacks by armed men in the state, with no less than 25 people reportedly kidnapped in Suleja during Monday morning’s raid.\nNiger State Governor Abubakar Bello has in recent weeks warned of an invasion of “Boko Haram elements” in the state he governs.\nThey intended to use the area as a base, just like Sambisa Forest in the Northeast of the country, regarded as a Boko Haram stronghold.\n“They’re angered people are being abducted from house to house there on a daily basis.\nThe affected community is located around Gauraka, Suleja area."
  },
  {
    "headline": "Abubakar Shekau Considered A Hero By House of Rep’s Aide -Trending With Ojy Okpe",
    "summarized_story": "Over the weekend, many Nigerians expressed outrage at the absence of top government officials and president Mohammadu Buhari at the funeral of the late chief of Army Staff Lieutenant General Ibrahim Attahiru and 10 other military officers who lost their lives in a tragic plane crash last Friday.\nMeanwhile, the outrage was inflamed after government officials were seen attending the wedding ceremony of a son to the minister of justice and attorney general of the federation Abubakar Malami which coincided with the same day the stricken officers were laid to rest.\nA short clip of Bashir Magashi Nigeria’s Minister of Defence attributing wrong titles to officials and making grammatical blunders at the funeral of the late chief of Army Staff and 10 other military officers have made the rounds.\nFollowing the reported death of Abubakar Shekau leader of the terrorist group Boko Haram, Bukar Tanda, an aide, to a member of the House of Representatives, Adulkadir Rahis who showered praises on the dreaded leader has been fired by his boss."
  },
  {
    "headline": "Youth Advocate Releases Book On New Nigerian Vision",
    "summarized_story": "Youth advocate Seun Awogbenle has announced his new book titled ‘The Urgency of Now: Why Nigeria Needs A vision of Prosperity, Protection and Liberty.’The book has ten chapters that discuss the imperative of visioning, leadership, youth participation and active citizenship in the country.\nCEO The Cable Newspaper Simon Kolawole described the book as a very important book that seeks to infuse vision, passion, and common sense into the quest for Nigeria’s greatness.\nAwogbenle said he decided to write the book after years of introspection on how he thinks Nigeria can pull back from the brink.\n“I have proposed three planks (prosperity, protection, and liberty).\nThe book goes further to locate a youth agenda, by putting a strong argument for young people to lead Nigeria’s new vision."
  }
]