[
  {
    "headline": "We’ll take bold step in vaccine production, says minister",
    "summarized_story": "The Minister of Health, Dr Osagie Ehanire, says the Federal Government is determined to make a bold step on vaccines production in the country.\nEhanire stated that as the country responded to the COVID-19 pandemic, Nigerians must not believe that the pandemic was over.\nHe added that the detection of the Omicron variant should teach anyone that the virus keeps surprising the world.\nThe minister of State for Health, Dr Olorunnimbe Mamora, said Africa had suffered so much in terms of COVID-19 vaccines distributions.\nOloriegbe explained that investigations conducted in southern African countries had revealed that those infected with the Omicron variant had yet to be vaccinated."
  },
  {
    "headline": "Governors to get substituted service in judiciary financial autonomy suit",
    "summarized_story": "A Federal High Court in Abuja has ordered substituted service on the 36 state governors in a suit seeking financial autonomy for the judiciary.\nThe News Agency of Nigeria reports that the plaintiff, Emeka Okoye, in an originating summons, had sued the 36 states through their attorneys-general.\nOther defendants in the originating summons dated June 18 are the Revenue Mobilisation Allocation and Fiscal Commission, the Federation Accounts Allocation Committee, and the Attorney General of the Federation.\nMoving the exparte motion, Maduabuchi prayed the court for an order of substituted service on the defendants.\nJustice Nyako granted the prayer to serve the 36 state attorneys-general by substituted means by posting the originating summons and other processes through courier services to be delivered to their various addresses."
  },
  {
    "headline": "LAND ENCROACHMENT: Delta Community youths protest arrest, harassment of indigenes",
    "summarized_story": "By Festus Ahon, ASABAYOUTHS of Achala-Igbuzor and Ezukwu of Igbuzor kingdom, Oshimili North Local Government Area, Delta State have embarked on a protest against the arrest and harassment of their indigenes by men of the Delta State Police Command to forcibly take over their land.\nWe are not lazy youths and we are ready to farm if they allow us to use our land.\nIf they take our land that simply means we are finished because it would amount to debasing us to strangers in our own land.\n“Each time we raise our voice over the land matter, they go after us, arresting our youths and detaining them.\n“When they approached our fathers over this land that they wanted to build barrack, there was less population in this community."
  },
  {
    "headline": "IGP approves establishment of Special Desk for Persons with disability in Police Commands nationwide",
    "summarized_story": "**Says NPF Committed to Disability Mainstreaming and Protection of Rights of PWDBy: Kingsley Omonobi – Abuja.\nThe Inspector-General of Police, IGP Usman Alkali Baba has approved the establishment of a Special Desk for Persons with Disability in all the Police Zonal and State Commands across the thirty-six (36) States of the Federation and the Federal Capital Territory (FCT).\n“The IGP equally approved a training program for Police personnel who are to serve as the Disability Desk Officers (DDO) under the coordination of the Force Public Relations Department.\n“The training is being organized in partnership with the National Commission for Persons with Disability (NCPWD).\n“Consequently, the IGP has directed all the Command Commissioners of Police (CPs) and their supervisory Assistant Inspectors General of Police (AIGs) to supervise the nomination of the DDOs and ensure hitch-free takeoff of the Disability Desk Offices in their respective Commands."
  },
  {
    "headline": "Unemployment Summit: We’re determined to push our people out of poverty— Akeredolu",
    "summarized_story": "•Says entrepreneurship only solution to unemployment•Ibukun Awosika, Alajika, others speak at Ondo unemployment summitDayo Johnson AkureGovernor Rotimi Akeredolu has said his administration is determined to push the people of the state out of poverty and unemployment through entrepreneurship knowledge economy, innovation and technology.\nAkeredolu added that ” is ready to invest more in entrepreneurship development and provision of grants for startups and those badly affected by the Covid-19 pandemic.\nHe spoke at the Inaugural Unemployment Summit held at Akure, the state capitalSpeakers at the summit include Mrs. Ibukun Awosika, Apostle Folorunso Alakija, Pastor (Mrs) Funke Felix Adejumo and founder of Africa’s Leadership University, Fred Swaniker.\n“You will recall that our State had hitherto been known and referred to as a Civil Service State.\n“We observe that keeping the civil service culture, in no time, the state will be in chaos hence the birth of the Ondo State Entrepreneurship Development Agency (ONDEA) for Poverty Eradication, Job Creation and Economic Development,” Arakunrin Akeredolu said."
  },
  {
    "headline": "UPU@90: Despite challenges, Nigeria'll not go down — Okowa",
    "summarized_story": "He commended the leadership of UPU for it’s resolve to extend hands of fellowship to other ethinc groups in the state.\n“UPU has played a major role in the advancement of not only the Urhobo nation, but in the advancement of Delta State and Nigeria.\n“When people are recognized, it is a call for those who are growing up to do more for the nation”, he added.\nOn the 2023 governorship election in the state, Okowa expressed happiness with the peaceful manner and respect for each other with which the lobby groups seeking the gubernatorial seat had been going about their aspiration.\n“When there are too many sons and daughters in a race, it creates a lot of challenges."
  },
  {
    "headline": "COVID-19: Adhere to safety guidelines, CAN tells churches",
    "summarized_story": "Oyo State Christian Association of Nigeria (CAN) has called on churches and all faithful in the state to strictly adhere to safety guidelines already in place against the spread of COVID-19 pandemic.\nThe Oyo State CAN Chairman, Apostle Joshua Akinyemiju, made the call on Friday in Ibadan following the emergence of omicron variant of COVID-19.\nAkinyemiju urged all faithful to ensure they were vaccinated to reduce the risk of getting infected.\nHe added that citizens should also be reminded about the consequences of non-compliance with the safety protocols.\n“At every opportunity on the pulpit, mention should be of the prevailing COVID-19 situation."
  },
  {
    "headline": "Sylvester Oromoni’s death: FCT Minister told to shut down Abuja school immediately",
    "summarized_story": "The Human Rights Writers Association of Nigeria, HURIWA, has called on the Federal Capital Territory administration to without further delay, shut down Premiere Academy Lugbe, Abuja, where a female student was reportedly raped to death.\nThe call followed the shutting down of Dowen College Lagos by the state government over the death of a 12- year-old student, Sylvester Oromoni Junior.\nThe 12-year-old Sylvester Oromoni Junior, a junior student of Dowen College was alleged murdered by suspected students’ cultists in the school.\nHURIWA further warned the Lagos State Government not to sacrifice the victim on the altar of political patronage since the Parents of the suspected killers as named by the victim are said to be wealthy.\nThe Rights group noted that the murder of the 12-year-old boy is coming few months after another 14- year-old female student was sexually molested and murdered in Abuja."
  },
  {
    "headline": "Why state courts should be granted power to prosecute drug offenders – Masari",
    "summarized_story": "Governor Aminu Bello Masari of Katsina State has said that the exclusion of state high court from prosecuting drug peddlers is responsible for the delay in bringing offenders to answer for their crimes in the state.\nWhile querying the granting of bail to drug offenders, Governor Masari urged the agency to look inward and see how they can reinforce their position.\nYou can’t release an arm robber on bail but what about a drug dealer who is more dangerous than an armed robber?\nConsequently, he said there is the need to review the narcotic laws to empower state high courts as well to prosecute drug offenders.\nHow can you give bail to a drug dealer who is more dangerous than a bandit?"
  },
  {
    "headline": "Dowen College: Atiku demands justice for Sylvester Oromoni",
    "summarized_story": "Former Vice President, Atiku Abubakar has demanded justice for Sylvester Oromoni, 12-year-old Secondary School student, who was allegedly assaulted at Dowen College Lagos State.\nBut the school Principal, Mrs. Adebisi Layiwola, in a statement denied any form of bullying or attack on the student.\nThis led the Lagos State government to shut down the school and ordered an investigation into the incident.\nhttps://dailypost.ng/2021/12/03/lagos-govt-shuts-dowen-college-in-lekki-over-sylvester-oromonis-death/Reacting on Twitter, Atiku urged the the authorities to bring the culprits to book.\nHe wrote, “We shall be failing in our duties as parents/guardians, administrators, security agencies and government if we do not get to the bottom of the case of late Sylvester Oromoni."
  },
  {
    "headline": "We are marginalized, neglected by Taraba govt – PLWD’s cry out",
    "summarized_story": "Persons Living with Disabilities in Taraba State has alleged marginalization by the state government.\nThe PLWD’s claim they have been relegated to the background by the state government.\nThe group also criticised the government for not carrying it along in the areas of political appointments and asked Governor Ishaku to marshal out plans for the inclusion of persons living with disabilities into his cabinet.\n“Just as you have rightly observed, we have been here since morning, hoping the governor will come out to address us.\nBut since this government came on board, our story has been going from worse to worst”."
  },
  {
    "headline": "Women with disability are faced with double jeopardy in Nigeria – ActionAid",
    "summarized_story": "ActionAid Nigeria has raised an alarm that women with disability in the country are faced with double jeopardy.\n“This means that whatever the challenge faced by Persons with Disability, women with disability suffer more and are subjected to double discrimination.\nObi said despite progress made in ratifying the Policy on Inclusive Education in Nigeria, current education resources are insufficient to achieve inclusive education; only two percent of the Consolidated Revenue Fund to the Universal Basic Education Commission is provided for special needs.\nBudgets and plans are not sensitive enough to support inclusion which makes financing inclusive education very difficult.\nObi said: “ActionAid Nigeria urges governments to leverage on additional revenue by closing tax loopholes and limiting unnecessary tax incentives to provide disability friendly public services including public transport."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Imo ex-MILAD, Col. Zubairu buried in Kaduna",
    "summarized_story": "The remains of a former Military Administrator of Imo State, Colonel Tanko Kurah Zubairu (rtd) was laid to rest at the Military Cemetery 1 Division Nigerian Army, Kaduna on Friday.\nThe deceased was appointed Military Administrator of Imo State in the then military government of General Sani Abacha and General Abdulsalam Abubakar with a responsibility to develop lasting security and operational systems for the Eastern heartland.\nSpeaking at the funeral service which was held at St. Luke’s Military Church, Camilla Barracks 44 Nigerian Army Referral Hospital, Kaduna, ex- Governor of Imo State, Emeka Ihedioha described the former MILAD as a bridge builder and a pillar to humanity.\nThe Imo State governor, Hope Uzodinma was represented by the state’s Commissioner for Information and Strategy, Declan Emelumba, the governor said the state was saddened by the death.\nColonel Zubairu was born on 3oth June, 1947 in Kurmin Rami village, Kachia Local Government Area of Kaduna state."
  },
  {
    "headline": "Impose special taxes on alcohol, tobacco, World Bank tells Nigeria",
    "summarized_story": "The World Bank Group has called on the Federal Government to impose special taxes on alcohol, cigarettes and sugar-sweetened beverages to improve primary healthcare, the News Agency of Nigeria (NAN) reports.\n“If we want to improve healthcare in Nigeria, we need to tax the things that are killing us.\n“The economic rationale for taxing these products is strong if we want to save lives and make a better and healthier Nigeria,’’ Mr Shubham Chaudhuri, Country Director for Nigeria, World Bank Group, said.\nHe made the call on Friday in Abuja at a special National Council on Health meeting organised by the Federal Ministry of Health.\nHe added that UNICEF was determined to apply its comparative advantage as an agency to support Nigeria’s development efforts within the health sector and beyond."
  },
  {
    "headline": "Bandits kill three, abduct 63 in Kaduna communities",
    "summarized_story": "Three persons have been reported killed while no fewer than 63 others were abducted when terrorists attacked Kaduna communities on Friday.\nBandits killed two and 50 others were abducted when terrorists attacked Unguwan Gimbiya community on the outskirts of Kaduna metropolis on Friday.\nIn a separate attack, one person was also killed and no fewer than 13 others abducted when bandits stormed communities at Kainuwar Isa and Kugu of Dutse Ward in Zaria Local Government Area of Kaduna State on Thursday night.\nHowever, a source from the community told journalists on Friday that the bandits invaded the community at about 2.00pm causing serious commotion and pandemonium.\nOn the release of the Zaria local government workers, the two staff were held by their abductors, demanding the delivery of three motorcycles before their release."
  },
  {
    "headline": "NULGE, ALGON, others demand dissolution of state, local government joint accounts",
    "summarized_story": "The National Union of Local Government Employees (NULGE) and the Association of Local Government Chairmen of Nigeria (ALGON), have demanded the dissolution of the joint states and local governments account.\nThey demanded the creation of a dedicated account for Local Governments where funds are remitted directly from the Federal Accounts Allocation Committee (FAAC) account.\nThey also demanded that powers of States to conduct elections for local governments should be taken away from the State Independent Electoral Commissions (SIEC) and given to INEC.\n“Since the return of democracy in 1999, the local governments have witnessed decline in term service delivery as State governments have appropriated to themselves the power to manage local governments.\n“The State has taken over the ability of the local government to stand on its own to act or spend money.”"
  },
  {
    "headline": "SSS 3 student beats teacher to death in Delta",
    "summarized_story": "The suspect, identified as Michael Ogbefe allegedly gave the deceased teacher, Joseph Ossai, some punches that left him with bloody nose and mouth.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nLocal sources said Ossai was rushed to a private hospital from where he was referred to a government hospital where he was confirmed dead.\nUntil his unfortunate death, Ossai was in charge of Agricultural Science and Biology in the school.\nTrouble was said to have started when the late teacher flogged the suspect’s younger sister, one Promise who was involved in a dispute with her classmate."
  },
  {
    "headline": "Omicron variant: FG releases new Int’l travel guidelines",
    "summarized_story": "From Juliana Taiwo Obalonye, AbujaWith confirmed cases of omicron variant of COVID-19, the Federal Government has reviewed its international travel protocol to reduce the risk of spreading the virus in the country.\nCOVID-19 PCR test to be done within 48hrs before departure2.\nPost-arrival Day 2 COVID-19 PCR test3.\nDay 7 post-arrival exit PCR test (For unvaccinated and partially vaccinatedindividuals)Out-bound PassengersAll out-bound Passengers are required to provide either of the following documentation:1.\nNegative PCR test result within 48hrs from the time boardingThe review of the protocol is based on science, national experience, and globaldevelopments."
  },
  {
    "headline": "Student’s death: Lagos govt orders indefinite shut down of Dowen College",
    "summarized_story": "By Gabriel DikeThe Lagos State Government Friday ordered the indefinite closure of Dowen College, Lekki , pending the outcome of an investigation into the death of Sylvester Oromoni Junior, a student of the school.\nAdefiayo called for calm, saying no effort will be spared in getting to the root of the incident.\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nClick Here to Apply ."
  },
  {
    "headline": "Court orders substituted service on 36 states in suit seeking financial autonomy for judiciary",
    "summarized_story": "From Godwin Tsa, AbujaA Federal High Court sitting in Abuja has ordered substituted service on the Attorney General of the 36 states of the federation in a suit against the 36 states of the federation seeking total financial autonomy for the nation’s judiciary.\nIn an originating summons marked FHC/ABJ/CS/502/2021, the plaintiff, Emeka Okoye, sued the 36 states through their Attorney Generals.\nHe said Nigeria, upon independence, adopted a federal system with three tiers of federal, state and local governments with three arms – the executive, legislature and judiciary.\nMr Okoye said the Nigerian constitution created 10 courts for the federation and the 36 states.\nHe however noted that under the system being adopted in violation of the constitution, funds meant for the judiciary are being to the governors of the 36 states, instead of the National Judicial Council (NJC) and heads of court in the states."
  },
  {
    "headline": "South Africa’s new COVID cases double in 1 day amid omicron",
    "summarized_story": "JOHANNESBURG (AP) — South Africa’s new cases of COVID-19 nearly doubled in a day, authorities reported Wednesday, signaling a dramatic surge in the country where scientists detected the omicron variant last week.\nScientists in South Africa said they are bracing for a rapid increase in COVID-19 cases following the discovery of the new omicron variant.\nThe new cases reported Wednesday represent a 16.5% positivity rate of cases tested, up from a 1% rate early in November.\nWith a population of 60 million people, South Africa has recorded more than 2.9 million COVID-19 cases, including nearly 90,000 deaths.\nIt said until the end of October, the delta variant accounted for most genomes sequenced in the country, but in November the omicron variant overtook it."
  },
  {
    "headline": "Lagos Shuts Dowen College over Student’s Death",
    "summarized_story": "The Lagos State Government has ordered the indefinite closure of Dowen College, Lekki, over the death of Sylvester Oromoni Jnr., a student of the school.\nMrs Folashade Adefisayo, Commissioner for Education, in a statement on Friday, announced the closure after a meeting with the school management and staff.\nAdefisayo said that the closure was pending the outcome of an investigation into the death of the student.\nShe called for calm, saying that no effort would be spared in getting to the root of the incident.\nReports alleging that the 12-year-old boy died mysteriously after he was tortured for refusing to join a cult group had been debunked the by the school."
  },
  {
    "headline": "In Dubai, Buhari Commends ARISE Fashion Week for Showcasing Nigeria",
    "summarized_story": "By Vanessa Obioha in Dubai, UAEVisiting Dubai for the World Expo 2020, President Muhammadu Buhari Friday, commended organisers of the ARISE Fashion Week for showcasing Nigeria’s fashion and arts to the world while describing his administration as a listening government that will ensure justice and equity for all Nigerians.\nThe president, represented by the Minister of Industry, Trade and Investment Otunba Niyi Adebayo, said that by hosting AFW in Dubai, the organisers were showcasing Nigerian fashion to the world.\n“I’m very glad to be here to witness another landmark achievement for the country: the first ARISE Fashion Week in Dubai.\nWe are here to celebrate the birth of Nigerian culture as we unleash the power of youth for a new positive image for Nigeria.\nHe recognised that the entertainment industry is a major factor for the country to be recognised globally."
  },
  {
    "headline": "Buhari: World Leaders must Work Together to Stem COVID-19 Pandemic",
    "summarized_story": "Deji Elumoye in AbujaWith the global surge in cases of COVID-19, President Muhammadu Buhari has emphasised the urgent need for world leaders to work together and reinforce partnerships to limit the catastrophic consequences of the pandemic.\nAccording to him, “The concerted efforts by world leaders, working together, enabled us to limit the catastrophic consequences of this pandemic.\nThe Nigerian leader, however, noted that the present administration in Nigeria has registered significant progress within a short period of time and is still making headways in key sectors of the economy.\nHe described Expo Dubai 2020 as the single most important global event of its kind to take place in the Middle East, Africa and the South East Asian regions in recent years.\n‘‘We are proud to be a part of this dynamic evolution of pragmatic partnerships that are both creative and innovative for the progress of the country,” the president said."
  },
  {
    "headline": "Bandits Kill 2, Abduct 50 in Kaduna",
    "summarized_story": "John Shiklam in KadunaTwo people have been killed, while 50 others were abducted when bandits invaded Anguwan Gimbiya, a suburb in Sabon Tasha area of Kaduna metropolis.\nThe bandits, who were said to be in large number, stormed the community Thursday night unleashing terror on residents.\n“They operated for over an hour and killed two people and abducted 50 others.\nWe are in a big trouble.”The spokesman of the Kaduna State Police Command, Mohammad Jalige, did not respond to telephone calls and a text message when contacted.\nDespite efforts by government to end banditry in Kaduna State, the menace seemed to defy solutions as the criminals continue to unleash terror on residents."
  },
  {
    "headline": "Despite Emergency Oil Releases, Omicron Fears, OPEC Sticks to 400,000bpd Supply Hike",
    "summarized_story": "A statement released after meeting stated: “The 23rd OPEC and non-OPEC Ministerial Meeting (ONOMM), was held via videoconference, on Thursday December 2, 2021.\n“The meeting reaffirmed the continued commitment of the participating countries in the Declaration of Cooperation (DoC) to ensure a stable and balanced oil market.\nMeanwhile, Nigeria has received a production output allocation of 1.683 million bpd for January, in spite of its inability to meet previous quotas.\nDespite the over 1.6 million bpd allocated to Nigeria in September and October, the country was only to supply 1.399 million bpd and 1.354 million barrels in the two separate months.\n“It’s very obvious that by the close of the year, we will get back to the 1.7 barrels to 1.8 barrels per day of crude oil."
  },
  {
    "headline": "EXCLUSIVE: Lagos Govt Disburses N450 Million To Higher Institutions For Governor Sanwo-Olu's Peace Walk",
    "summarized_story": "The Lagos State Government has disbursed N450 million to higher institutions in the state for the peace walk announced by the state governor.\n\"Lagos State Government has disbursed N450 million to higher institutions for peace walk, which will likely be held on Monday.\nOn Tuesday, Sanwo-Olu had revealed plans to organise a peace walk in December 2021, in commemoration of the #EndSARS movement.\nHowever, some of his invitees have already rejected the invitation with some youths in the state declaring that the state governor will walk alone.\nIt should be noted that students of the Lagos State University (LASU) have expressed their readiness to participate in the ‘Lagos Peace Walk,’ proposed by Sanwo-Olu."
  },
  {
    "headline": "EXCLUSIVE: Lagos Govt Disburses N450 Million To Higher Institutions For Governor Sanwo-Olu's Peace Walk",
    "summarized_story": "The Lagos State Government has disbursed N450 million to higher institutions in the state for the peace walk announced by the state governor.\n\"Lagos State Government has disbursed N450 million to higher institutions for peace walk, which will likely be held on Monday.\nOn Tuesday, Sanwo-Olu had revealed plans to organise a peace walk in December 2021, in commemoration of the #EndSARS movement.\nHowever, some of his invitees have already rejected the invitation with some youths in the state declaring that the state governor will walk alone.\nIt should be noted that students of the Lagos State University (LASU) have expressed their readiness to participate in the ‘Lagos Peace Walk,’ proposed by Sanwo-Olu."
  },
  {
    "headline": "BREAKING: Boko Haram Terrorists Currently Attacking Borno Town, Nigerian Soldiers Repel Attacks",
    "summarized_story": "Boko Haram terrorists have launched an attack on Malam Fatori, a border town and headquarters of the Abadam Local Government Area of Borno State.\nMalam-Fatori is one of the two local government areas without human activities where Governor Babagana Zulum had insisted on returning displaced persons by December 31.\nAccording to security sources, the terrorists are presently engaging the army formation in Malam-Fatori.\nIn a report by Punch, there were 500 mobile police personnel deployed to clear the town in preparation for the return of 1,000 refugees from the Niger republic.\nThe mobile Police crack team have also abandoned the town and returned to Maiduguri while the military personnel are still there."
  },
  {
    "headline": "BREAKING: Boko Haram Terrorists Currently Attacking Borno Town, Nigerian Soldiers Repel Attacks",
    "summarized_story": "Boko Haram terrorists have launched an attack on Malam Fatori, a border town and headquarters of the Abadam Local Government Area of Borno State.\nMalam-Fatori is one of the two local government areas without human activities where Governor Babagana Zulum had insisted on returning displaced persons by December 31.\nAccording to security sources, the terrorists are presently engaging the army formation in Malam-Fatori.\nIn a report by Punch, there were 500 mobile police personnel deployed to clear the town in preparation for the return of 1,000 refugees from the Niger republic.\nThe mobile Police crack team have also abandoned the town and returned to Maiduguri while the military personnel are still there."
  },
  {
    "headline": "Sanwo-Olu's \"White Paper\", Walk For Peace Or Trampling On Truth, By Bolaji O. Akinyemi",
    "summarized_story": "Initially, the soldiers were not invited but later the truth came up (that it was the governor that invited the murdering soldiers).\nBefore, It was a demon from hell that love darkness that switched off the lights, now it was the Toll Gate management staff carrying out instructions from an \"unknown Director\".\nOnly one man, George Perry Floyd Jr. died in the hands of Minneapolis, Minnesota police officers that generated global outrage (just like Lekki Toll Gate massacre).\nHowever, instead of WALK FOR PEACE we will suggest a WALK FOR HEALING or WALK FOR JUSTICE.\nIf it's about putting the Lekki Toll Gate pain behind us, listen to the people first."
  },
  {
    "headline": "'It gives greater protection' -- FG approves COVID vaccine booster shots",
    "summarized_story": "The federal government has approved booster shots of the COVID vaccine for Nigerians who are fully vaccinated.\nAdvertisementThis was disclosed on Friday in a statement by Mohammad Ohitoto, spokesman for the National Primary Health Care Development Agency (NPHCDA).\nAccording to the statement, eligible Nigerians are to visit health centres and mass vaccination sites from December 10 to get their booster doses.\n“Consequent upon the above, eligible Nigerians are advised to visit the nearest health facility or mass vaccination site for their booster doses as from the 10th of December, 2021 across all states of the federation.\nMeanwhile, 3,720,695 Nigerians, representing 3.3 percent of the population, have been fully vaccinated as of December 2."
  },
  {
    "headline": "'It gives greater protection' -- FG approves COVID vaccine booster shots",
    "summarized_story": "The federal government has approved booster shots of the COVID vaccine for Nigerians who are fully vaccinated.\nAdvertisementThis was disclosed on Friday in a statement by Mohammad Ohitoto, spokesman for the National Primary Health Care Development Agency (NPHCDA).\nAccording to the statement, eligible Nigerians are to visit health centres and mass vaccination sites from December 10 to get their booster doses.\n“Consequent upon the above, eligible Nigerians are advised to visit the nearest health facility or mass vaccination site for their booster doses as from the 10th of December, 2021 across all states of the federation.\nMeanwhile, 3,720,695 Nigerians, representing 3.3 percent of the population, have been fully vaccinated as of December 2."
  },
  {
    "headline": "Army commander feared dead as troops clash with 'ISWAP fighters' in Rann",
    "summarized_story": "AdvertisementThe senior officer was said to have been killed alongside five soldiers when the insurgents attacked Rann, a town in Kala Balge LGA of Borno state on Thursday.\nThe troops were said to have engaged the insurgents who came in their numbers, and the the gunfight lasted many hours.\nAbout 20 ISWAP fighters were also reportedly killed by the troops.\nThe incident comes three weeks after ISWAP fighters killed Dzarma Zirkusu, a brigadier-general and commander of the army brigade in Chibok.\nZirkusu was on his way to Askira to provide support for the troops when he was ambushed and killed."
  },
  {
    "headline": "Army commander feared dead as troops clash with 'ISWAP fighters' in Rann",
    "summarized_story": "AdvertisementThe senior officer was said to have been killed alongside five soldiers when the insurgents attacked Rann, a town in Kala Balge LGA of Borno state on Thursday.\nThe troops were said to have engaged the insurgents who came in their numbers, and the the gunfight lasted many hours.\nAbout 20 ISWAP fighters were also reportedly killed by the troops.\nThe incident comes three weeks after ISWAP fighters killed Dzarma Zirkusu, a brigadier-general and commander of the army brigade in Chibok.\nZirkusu was on his way to Askira to provide support for the troops when he was ambushed and killed."
  },
  {
    "headline": "EXPLAINER: How to buy MTN shares for N3,380 in 10 easy steps on your phone",
    "summarized_story": "In May 2019, MTN Nigeria (MTNN) was listed on the Nigeria Stock Exchange (NSE), immediately adding over N1.8 trillion to the market cap of the exchange.\nOf the entire MTN Nigeria share, approximately 79 percent is held by MTN Group.\nThe best part of the deal is that any Nigerian with a bank verification number (BVN) can buy MTN shares, and for as low as N3,380 on a mobile phone.\nAdvertisementHOW TO BUY MTN SHARES FOR AS LOW AS N3,380Many Nigerians are interested in buying a piece of MTN, but are not interested in the rigour and the hurdles of natively buying the shares of a company listed on the Nigerian exchange.\nIf you already have a CSCS account, enter the account number and your clearinghouse number (CHN)."
  },
  {
    "headline": "MTN Nigeria issues 575m shares through digital public offer",
    "summarized_story": "Nigeria’s biggest telco, MTN Nigeria, has announced that starting from Wednesday, 1 December 2021, retail investors can purchase up to 575 million shares held in MTN Nigeria at ₦169 per share—lower than its share price on the stock market.\nThis public offer is in line with MTN Group’s commitment to reduce its shareholding in MTN Nigeria from 78.8% to 65% over time.\nNotably, this public offer is primarily digital as the shares can be purchased online.\nBolaji Balogun, CEO of Chapel Hill Denham, an investment banking firm leading the public offering, explained this to TechCabal.\nIn response to this public offering announcement, MTN Nigeria’s share price fell 10% on Wednesday to a five-week low, a logical response as investors rushed to buy the lower-priced MTN public offering shares."
  },
  {
    "headline": "Herconomy raised $600,000 in a day. Here's how they did it",
    "summarized_story": "The book was a culmination of all the opportunities Durosinmi-Etti had been sharing on her personal Instagram profile for months.\n“I just wanted to create a place where women could get access to opportunities, grants and fellowships,” Durosinmi-Etti told TechCabal in an interview.\nThe startup plans to introduce financial services to its community members which it believes will be of great benefit to them.\nWithin a day, as Durosinmi-Etti explains, she got “hundreds of responses” from community members who were interested in investing.\nThey did this because it was extremely important for their community members to be part of this raise."
  },
  {
    "headline": "Nigeria’s Payourse secures $600k pre-seed to accelerate crypto adoption across Africa",
    "summarized_story": "But as good as this may sound, navigating through most of the available crypto products still feels like Chinese arithmetic to many Africans.\nAnd this experience is shutting out a large number of Africans from the crypto economy, thereby hindering even wider adoption.\nOne of them, Payourse, a Lagos-based blockchain startup that builds user-friendly products and tools to accelerate the adoption of crypto in Africa, has secured a $600,000 pre-seed investment to scale its products, hire more talent and expand into new markets.\nBut because of its seamless experience, Coinprofile began to gain traction among crypto users.\nUnlike other companies that charge fees on every transaction, Coinprofile doesn’t charge users on a transaction."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "4 tech innovations that can make life easy for physically challenged Africans",
    "summarized_story": "However, the World Health Organisation (WHO) puts the number of people living with disabilities at 300 million.\nThe UN also affirms that most Africans living with disabilities are excluded from school and work opportunities.\nIn celebration of the International Day of the Disabled, we are looking at four tech innovations that could help people living with disabilities globally.\nRecalling when a group of visually impaired persons was testing the Eone, Kim was asked if the watch was made specifically for the blind.\nMore attention needs to be paid to assistive tech but, more importantly, persons with disabilities."
  },
  {
    "headline": "The Herconomy story: Instagram page to fintech raising $600k in 24 hours",
    "summarized_story": "Herconomy founder, Ifedayo Durosinmi-Etti, found this even more true for women and began building solutions to address them.\nThe book’ launch helped establish a community, and what followed was probably unforeseen by anyone in the founder’s circle.\nIfedayo Durosinmi-Etti, CEO, HerconomyFast forward three years to 2021, and Herconomy has raised $600k pre-seed led by VC firm Oui capital.\nTo date, Herconomy claims to have disbursed about ₦30 million ($73,000) worth of grants to 42 women and men.\nDespite the challenges with the outsourced app, Durosinmi-Etti is grateful that the community could grow to over 15,000 members."
  },
  {
    "headline": "Payourse’s $600k pre-seed, Herconomy’s 24hr funding and Octamile’s $500k pre-seed",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Payourse’s $600k pre-seed$600k pre-seed by HerconomyWorld AIDS DayOctamile’s $500k pre-seedOfferZen’s $5.1m Series APayourse’s $600k pre-seedL-R Payourse Co-founders, Bashir Aminuy and John Anisere.\nAdvertisementFive years later, Payourse — the brainchild of Aminu, Hakeem Oyewole, and John Anisere — has announced the raise of a $600k pre-seed to build the next crypto powerhouse.\nYou can read it here: Nigeria-based blockchain startup, Payourse raises $600k pre-seed to build a Web3 powerhouseHerconomy bags $600k pre-seedHerconomy TeamHerconomy is a startup that empowers women by offering them capacity building, jobs, networking, and financial services.\nOn Wednesday, December 1, 2021, the startup announced a $600,000 pre-seed raise, led by members of the Herconomy community.\nOctamile raises $500k pre-seedOctamile Founder, Gbenro DaraOctamile, an African insurtech startup, has closed a $500,000 pre-seed round to simplify access to insurance for Africans."
  },
  {
    "headline": "Why Nigeria will struggle to meet OPEC’s production quota",
    "summarized_story": "“Some Nigeria assets may be under-invested, resulting in potential upside opportunities”.\n“Despite the profitability of their Nigeria assets, the IOCs are under increased pressure to accelerate their energy transition and divest non-core assets,” Wood & Mackenzie said.\n“Many indigenous operators are sitting on significant resources, with opportunities to grow production with access to capital investment,” Wood & Mackenzie added.\n“Nigeria’s oil production is currently struggling at levels never seen before, but the regulators are ignoring the problem and disguising under OPEC’s quota,” Charles Akinbobola, energy analyst at Lagos-based Sofidam Capital, says.\nAlso, a new wave of security threats in Nigeria has emerged that could further dent Nigeria’s production."
  },
  {
    "headline": "BUA Group set to list food businesses on Nigerian Exchange",
    "summarized_story": "BUA Group, Nigeria’s leading foods, infrastructure, mining and manufacturing conglomerate is at the verge of completing the processes to list the shares of its Food businesses –Flour & Pasta, Sugar, Edible Oils, and Rice –on the Nigerian Exchange Limited (NGX).\nWe believed in the capacity of the Nigerian capital market to handle those transactions regardless of the economic headwinds.\nAll the sugar and allied investments of BUA Group are set up to take advantage of the entire sugar production value chain.\nBUA Group has also acquired about 70,000ha of land in both locations for the purpose of setting up large-scale sugar plantations.\nIn 2001, BUA Group acquired Nigeria Oil Mills Limited which was established in 1951."
  },
  {
    "headline": "Nigeria art, fashion, music take centre stage at Dubai Expo 2020",
    "summarized_story": "From a celebrated sculptor to its award-winning singer, Wizkid, to some of its best fashion designers, Nigeria’s creative talent is set to be front and centre during the Arise Fashion Week (AFW) today at the Dubai Expo 2020.\nOriginally scheduled from 20 October 2020 to 10 April 2021 and then postponed due to the COVID-19 pandemic, the Dubai Expo is from 1 October 2021 to 31 March 2022.\nLong-term partner of Arise Fashion Week, Naomi Campbell will be making an appearance alongside other global celebrities.\nFor decades African fashion has been on the backburner of international fashion and Arise is committed to changing the narrative.\nAFW has been at the forefront of promoting and celebrating the next generation of African fashion designers and providing a platform for designers to showcase their work."
  },
  {
    "headline": "Int’l Day of Persons with Disabilities: Obaseki pledges inclusion, assures equal access to health, education, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said his administration will sustain efforts at ensuring a level playing ground for persons with disabilities to thrive and realize their fullest potentials, ensuring inclusive and equal access to health services, education and employment opportunities, among others.\nThe governor said this in commemoration of this year’s International Day of Persons with Disabilities, with the theme, “Leadership and participation of persons with disabilities toward an inclusive, accessible, and sustainable post-COVID-19 world.”He reassured that the government will continue to implement policies that provide sustainable structures and reforms that guarantee persons with disabilities a better chance of expression, economic empowerment, and self-fulfillment.\nAccording to him, “As we commemorate the International Day of Persons with Disabilities, it is imperative to reassure that my administration will sustain programmes and policies to ensure that persons with disabilities in the state realize their fullest potentials, ensuring inclusive and equal access to health services, education and employment opportunities, among others.\n“This year’s commemoration presents yet another opportunity to engage, interact, interface and hold genuine conversations to fashion pragmatic policies that impact the community of persons living with disability in our state.”The governor further noted, “In the last five years, we have demonstrated strong commitments to ensuring persons with disabilities are carried along in the formulation and implementation of government policies and programmes, and will continue to implement policies that provide sustainable structures and reforms that guarantee persons with disabilities better chance for expression, economic empowerment, and self-fulfillment.”“We are also collaborating with other stakeholders including rights groups in building a society where persons with disabilities will live life to the fullest, supported with policies, laws and other social and economic enablement required to assist them to achieve their aspirations.”Reassuring the government’s commitment to the welfare and wellbeing of persons with disabilities, he continued: “We have demonstrated our keen support for persons with disabilities during previous recruitment exercises in the state by ensuring a sizable number of persons with disabilities are given equal opportunity for employment.\n“Other practical initiatives that have been taken by this administration to further demonstrate inclusiveness and participation of persons with disabilities include the implementation of the amended Violence Against Persons (VAP) Law, which aims at eliminating violence against vulnerable persons and groups in private and public life, and provides maximum protection and effective remedies for victims.”..."
  },
  {
    "headline": "Edo arrests three illegal revenue collectors in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Joint Security Operation, Wabaizigan and officials of the state’s Public Works Volunteers (PUWOV) have arrested three suspected illegal revenue collectors in Benin City, the Edo State capital.\nAccording to him, “PUWOV officials have apprehended one Friday Imade, a suspected illegal revenue collector, who has been extorting residents along Airport Road axis in Benin City.\n“In the same vein, the state’s joint security operation, Wabaizigan arrested two other illegal revenue collectors along Oba Market Road, who were illegally selling tickets and extorting unsuspecting traders.\nThe suspects have been handed over to the Police for further investigation and prosecution.”Noting the government’s efforts at ending all forms of extortion and multiple taxations across the state, the PUWOV coordinator said, “The Edo State Government is committed to apprehending all illegal ticket racketeers and other illegal revenue collectors.\nGovernor Obaseki is very involved and will never support oppression or exploitation of Edo citizens.”..."
  },
  {
    "headline": "Obaseki boosts economic activity in varsity community with completion of 4.86km Ekosodin road – Nigerian Observer",
    "summarized_story": "The adjoining streets include Ehigeagba, Osanidowonyi, Boundary and Edo Streets, as well as Main Ekosodin road and Newton Road.\nIn a statement after an inspection tour of the newly completed road project, the Commission’s Chairman, Pastor Kennedy Osifo said all is now set for the commissioning of the project.\nHe noted that before the road was constructed, motorists using the road had to bear the pain of taking their cars to the mechanic on a daily basis, which cost them a lot.\nResidents of the community, including tricycle riders, students, pedestrians and motorists were filled with joy and expressed their excitement on the current shape of the road.\nThey commended Obaseki for coming to their rescue, stressing that the road was in a terrible condition and residents had to leave the environment because the roads deteriorated and became impassable."
  },
  {
    "headline": "Edo communities laments continued blackout – Nigerian Observer",
    "summarized_story": "The Nigerian Observer learnt that, the system, coupled with clearing of unpaid electricity bills amounting to millions of Naira ‘owed’ BEDC were conditions the company handed the affected communities before it can restore power and commence services in the area.\nThe communities which include Abudu, Evbuobanosa, Iguomoson, Uvbe, Igbogiri, Iru, Ofien, Idudolor, Evbuohen, Isua, Evbosawe, Ugboayon, Oza, Ugbeze, Oghada, Igbanke, among others have been without electricity for more than five years.\n“No banks, no major businesses, just POS stands everywhere; and without electricity nobody will be serious to come here and invest.\nBarely two months after installation, vandals took advantage of poor security arrangement in the area to steal armoured cables from the yet-to-be powered transformer.\nConsequently, a representative of Orhionmwon local government at the commission, Charles Aideyan assured that contractor handling the project has been mandated to replace the stolen equipment."
  },
  {
    "headline": "Armed herdsmen destroy IYM founder, Elliot Uko’s farm in Enugu",
    "summarized_story": "Armed herders on Friday, invaded the farm of Evangelist Elliot Ugochukwu-Uko, founder of Igbo Youth Movement (IYM) at Nike, Enugu State, destroying crops, killing chicken in what seemed to be a premeditated attack.\nThe herders, witnesses said, broke into the fenced settlement which houses crops and poultry farms, killed some chickens and led cows to eat up vegetables before leaving.\nNarrating the incident to our correspondent who contacted him on Friday evening, Uko said the herders ruined everything on the farm before leaving in the morning hours of the day.\nAccording him, “Armed Fulani herdsmen deliberately breached my fence by breaking down the wall, led their cattle right into my poultry Farm, violated my Farm, and destroyed all they could.\n“My Farm, established 2009, twelve years ago, is located at Ugwuomu Nike."
  },
  {
    "headline": "2023: Anyim consults with Babangida, Abdulsalami over presidential aspiration",
    "summarized_story": "Nigeria’s former senate president and a leading aspirant for president ahead of the 2023 presidential election, Anyim Pius Anyim, has consulted with elder statesmen and former heads of state, General Ibrahim Babangida (rtd) and General Abdulsalami Abubakar (rtd) over his presidential ambition.\n“Today, I was received in a private audience by two of our nation’s esteemed leaders and patriots.\nI met with former President Ibrahim Babangida and former Head of State, General Abdulsalami Abubarkar,” he wrote.\n“I consulted with them on my intention to contest for the presidency of our beloved country.\n“Such calls resurfaced in the early part of 2021 and I chose to be quiet over the issue."
  },
  {
    "headline": "AI-Powered LG ThinQ Enriching Smart Home Experience",
    "summarized_story": "The fact that the LG ThinQ app has been downloaded over a million times is proof that there is an audience that’s hungry for the conveniences offered by smart products.\nLG Magic Remote not only controls your TV but your other LG-connected devices too, and one can complete their smart adaptive viewing experience with voice-responsive LG smart audio devices like LG Soundbar AI ThinQ which supply immersive sound that changes settings according to content”, he explained.\nWith just a simple voice request, LG AI TVs make suggestions suited to your preference such as movies, programs or music.\nAccording to the LG ThinQ 2021 Smart Home Report, the largest group of smart homeowners say saving energy is the greatest benefit of owning a smart home.\nThe advantages of AI technologies like LG ThinQ will undoubtedly enable humans to live better and smarter lives."
  },
  {
    "headline": "250 Women Graduate from U.S. Consulate Academy for Women Entrepreneurs",
    "summarized_story": "A diverse group of 250 women on Friday graduated from the 3rd cohort of the Academy for Women Entrepreneurs (AWE), a U.S. government initiative that supports women entrepreneurs around the world.\nDesigned to cultivate entrepreneurial know-how, AWE helps women entrepreneurs connect with funding opportunities, enhance opportunities for business expansion, and increase the likelihood of entrepreneurial success.\nThe AWE participants come from a range of backgrounds and levels of business expertise.\nThe benefits of the AWE initiative will continue long after the program ends, as the participants apply skills learned to their own businesses and become part of a robust network of women business leaders.\nThis year’s participants included 50 repatriated irregular migrants who are in various stages of building their businesses."
  },
  {
    "headline": "Banks Disburse N7trn Loans To Nigerians In 3 years",
    "summarized_story": "Commercial banks in Nigeria in the last three years, disbursed over N7 trillion in loans and advances to customers, a feat the Central Bank of Nigeria (CBN) said was achieved through its loans to deposit ratio (LDR) policy.\nThis was stated by the CBN deputy governor, Financial Systems Stability, Mrs. Aishah Ahmad, yesterday at the 40th anniversary summit of Financial Institutions Training Centre (FITC) in Lagos.\nAhmad noted that the LDR policy which specified that a certain percentage of deposits in banks must go out as loans and commenced in 2019, had seen the level of lending to the economy by banks improve improved significantly.\nBY BUKOLA IDOWU, LagosCommercial banks in Nigeria in the last three years, disbursed over N7 trillion in loans and advances to customers, a feat the Central Bank of Nigeria (CBN) said was achieved through its loans to deposit ratio (LDR) policy.\nAhmad noted that the LDR policy which specified that a certain percentage of deposits in banks must go out as loans and commenced in 2019, had seen the level of lending to the economy by banks improve improved significantly."
  },
  {
    "headline": "Banks Disburse N7trn Loans To Nigerians In 3 years",
    "summarized_story": "Commercial banks in Nigeria in the last three years, disbursed over N7 trillion in loans and advances to customers, a feat the Central Bank of Nigeria (CBN) said was achieved through its loans to deposit ratio (LDR) policy.\nThis was stated by the CBN deputy governor, Financial Systems Stability, Mrs. Aishah Ahmad, yesterday at the 40th anniversary summit of Financial Institutions Training Centre (FITC) in Lagos.\nAhmad noted that the LDR policy which specified that a certain percentage of deposits in banks must go out as loans and commenced in 2019, had seen the level of lending to the economy by banks improve improved significantly.\nBY BUKOLA IDOWU, LagosCommercial banks in Nigeria in the last three years, disbursed over N7 trillion in loans and advances to customers, a feat the Central Bank of Nigeria (CBN) said was achieved through its loans to deposit ratio (LDR) policy.\nAhmad noted that the LDR policy which specified that a certain percentage of deposits in banks must go out as loans and commenced in 2019, had seen the level of lending to the economy by banks improve improved significantly."
  },
  {
    "headline": "Lagos Orders Indefinite Closure Of Dowen College Over Student’s Death",
    "summarized_story": "Lagos State government has ordered the indefinite closure of Dowen College, Lekki , pending the outcome of investigation into the death of Sylvester Oromoni Jnr, a student of the school.\nThe state’s Commissioner for Education Mrs. Folasade Adefisayo announced the closure after a meeting with the school management and staff.\nThe statement added, “Government further assured Nigerians that it is in touch with the parents in this difficult time.\nADVERTISEMENT“We reassure the family of the late Sylvester Oromoni Junior and Lagosians at large that efforts are being made to unravel the circumstances leading to his demise, even as we reiterate the government’s commitment to Child Protection.\nIt would be recalled that on Wednesday, the management of the school issued a statement claiming the deceased teenager suffered a thigh injury while playing football."
  },
  {
    "headline": "Lagos Orders Indefinite Closure Of Dowen College Over Student’s Death",
    "summarized_story": "Lagos State government has ordered the indefinite closure of Dowen College, Lekki , pending the outcome of investigation into the death of Sylvester Oromoni Jnr, a student of the school.\nThe state’s Commissioner for Education Mrs. Folasade Adefisayo announced the closure after a meeting with the school management and staff.\nThe statement added, “Government further assured Nigerians that it is in touch with the parents in this difficult time.\nADVERTISEMENT“We reassure the family of the late Sylvester Oromoni Junior and Lagosians at large that efforts are being made to unravel the circumstances leading to his demise, even as we reiterate the government’s commitment to Child Protection.\nIt would be recalled that on Wednesday, the management of the school issued a statement claiming the deceased teenager suffered a thigh injury while playing football."
  },
  {
    "headline": "24 Terrorists, 7 Soldiers Killed In Borno Military Base Attack",
    "summarized_story": "About 24 terrorists have been killed when Nigerian troops repelled an attack by Boko Haram/ISWAP terrorists on a military base at Rann in Kalabalge local government area of Borno State.\nThis is even as the military lost two officers and five soldiers in the attack which occurred on Thursday.\nOur correspondent gathered that the incident occurred when the terrorists attempted to attack the Rann military base.\n“The armed terrorists stormed the town on several gun trucks and engaged the military in a gun battle.\nADVERTISEMENT“We also recovered huge sophisticated weapons apart from their gun trucks that were completely destroyed by airstrikes.”"
  },
  {
    "headline": "Tonto Dikeh to Kpokpogri: I will never regret loving you",
    "summarized_story": "Tonto Dikeh may not have totally healed from her experience with ex lover, Kpokpogri, as she recently shared a strong message on Instagram, insisting that she was never going to regret the love she gave, that was not reciprocated.\n“I’ll never regret the love I gave anyone, even if it wasn’t reciprocated.\nLove always comes back full circle, that love is coming back to me in some shape or form.\nKeep putting love into the universe, because it’s coming back with interest!!\nIt would be recalled that Tonto’s last relationship was with activist Prince Kpokpogri, which ended in a very messy manner."
  },
  {
    "headline": "Tonto Dikeh to Kpokpogri: I will never regret loving you",
    "summarized_story": "Tonto Dikeh may not have totally healed from her experience with ex lover, Kpokpogri, as she recently shared a strong message on Instagram, insisting that she was never going to regret the love she gave, that was not reciprocated.\n“I’ll never regret the love I gave anyone, even if it wasn’t reciprocated.\nLove always comes back full circle, that love is coming back to me in some shape or form.\nKeep putting love into the universe, because it’s coming back with interest!!\nIt would be recalled that Tonto’s last relationship was with activist Prince Kpokpogri, which ended in a very messy manner."
  },
  {
    "headline": "Father from hell: Rapes five-yr-old daughter in Rivers",
    "summarized_story": "A Magistrate Court in Port Harcourt, Rivers State, has remanded one Progress Phimia, 40, for allegedly having carnal knowledge of his five-year-old daughter.\nThe charge sheet, N0 PMC/1859C/2021, at the hearing today, Friday, read: “You, Progress Phimia, male of Philips Close off Road 24, Agip Estate, Port Harcourt;“Sometimes in the month of November 2021 in Port Harcourt Magisterial district, unlawfully had carnal knowledge of your daughter, aged five years;“And thereby committed an offence punishable under Section 218 of Criminal Code Cap “37” Vol.11 laws of Rivers State of Nigeria, 2004.”The defendant did not take plea when the charge was read to him.\nThe presiding Chief Magistrate adjourned to December 9 and ordered the case file be transferred to Director of Public Prosecution, DPP, for advice.\nVanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Father from hell: Rapes five-yr-old daughter in Rivers",
    "summarized_story": "A Magistrate Court in Port Harcourt, Rivers State, has remanded one Progress Phimia, 40, for allegedly having carnal knowledge of his five-year-old daughter.\nThe charge sheet, N0 PMC/1859C/2021, at the hearing today, Friday, read: “You, Progress Phimia, male of Philips Close off Road 24, Agip Estate, Port Harcourt;“Sometimes in the month of November 2021 in Port Harcourt Magisterial district, unlawfully had carnal knowledge of your daughter, aged five years;“And thereby committed an offence punishable under Section 218 of Criminal Code Cap “37” Vol.11 laws of Rivers State of Nigeria, 2004.”The defendant did not take plea when the charge was read to him.\nThe presiding Chief Magistrate adjourned to December 9 and ordered the case file be transferred to Director of Public Prosecution, DPP, for advice.\nVanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Nigerian army grieves again as terrorists kill 2 officers, 5 soldiers",
    "summarized_story": "ISWAP terrorists have given the Nigerian military another heartbreak, after two officers and five soldiers were killed in an encounter at the military base in Rann, Borno State early on Friday.\nAlthough neither the Defence Headquarters nor the Nigerian Army has issued a statement, multiple sources confirmed the losses.\nReports said the terrorists attacked the Rann military camp in Rann, in Kala Balge local government area, in three trucks at roughly 1:30 am, firing sporadically for an hour.\nWhen the shooting stopped, the soldiers went into the town and were killed in an ambush, the sources said.\nLast month, ISWAP killed a Nigerian army general and four soldiers in Borno state."
  },
  {
    "headline": "South Africa hit by 4th wave of COVID-19 caused by Omicron",
    "summarized_story": "Agency ReportThe Omicron variant is propelling a fourth wave of COVID-19 infections in South Africa, Health Minister Joe Phaahla said on Friday.\nThe variant which has been detected in seven of the country’s nine provinces, has raised global fears of a surge in infections.\nIt was first detected in southern Africa last month and has prompted governments across continents to impose travel curbs and take other measures to contain it.\nread morePhaahla told a media briefing that he hoped that the variant could be managed without causing too many deaths.\nHe urged South Africans to get fully vaccinated, adding that the country could manage the fourth wave without stricter lockdown restrictions over Christmas."
  },
  {
    "headline": "How My Son Sylvester Oromoni Was Tortured Before He Died – Father Explained (Video)",
    "summarized_story": "Mr. Oromoni, the late Sylvester Oromoni’s father, has described how his son was abused by fellow classmates, resulting in his death.\nSylvester was a student at Dowen College in Lekki, Lagos, and lived at the school hostel when he died.\nDowen College blamed his death on injuries suffered while playing football.\nFollowing public outcry, the school announced that it would temporarily shut its doors and reopen next week as exams are scheduled to start soon.\nBut the Lagos State Government has ordered the school to be shut down until the education ministry and relevant authorities conclude a probe into Oromoni Jnr’s death."
  },
  {
    "headline": "BREAKING: Soldiers Battle Boko Haram Terrorists in Borno Town, Malam Fatori",
    "summarized_story": "The border town headquarters of the Abadam Local Government Area, Malam Fatori, is under siege by boko Haram terrorists.\nMalam-Fatori is one of the two LGAs without human activities where Governor Zulum had insisted on returning displaced persons by December 31.\nThere were 500 mobile police personnel deployed to clear the town in preparation for the return of 1,000 refugees from Niger republic.\nThe mobile Police crack team have since abandoned the town and returned to Maiduguri while the military personnel are still there.\nReports reaching The PUNCH in Maiduguri indicated the terrorists are engaging the army formation in Malam-Fatori Friday evening."
  },
  {
    "headline": "Dowen College: Former Vice President Atiku Demands Proper Justice For Sylvester Oromoni",
    "summarized_story": "Atiku Abubakar, the former Vice President, has called for justice for Sylvester Oromoni, a 12-year-old Secondary School student who was allegedly assaulted at Dowen College in Lagos State.\nBut the school Principal, Mrs. Adebisi Layiwola, in a statement denied any form of bullying or attack on the student.\nThis led the Lagos State government to shut down the school and ordered an investigation into the incident.\nhttps://dailypost.ng/2021/12/03/lagos-govt-shuts-dowen-college-in-lekki-over-sylvester-oromonis-death/Reacting on Twitter, Atiku urged the the authorities to bring the culprits to book.\nHe wrote, “We shall be failing in our duties as parents/guardians, administrators, security agencies and government if we do not get to the bottom of the case of late Sylvester Oromoni."
  },
  {
    "headline": "BREAKING: Riot In Osogbo As Police Allegedly Kills Truck Driver",
    "summarized_story": "Fear is apparent in Osogbo following the shooting of a truck driver by a police officer on Friday morning.\nAccording to a witness, the victim was brutalized before being shot dead in the Ota-Efun neighborhood of Osogbo while operating a Shekeena Global borehole drilling truck.\nAround 10:30 a.m., the drilling vehicle broke down along Ikirun Way, according to reports.\nAccording to reports, the driver and his crew allegedly blocked the road while attempting to repair the car before police arrived.\nAccording to an eyewitness, police officers descending from a mini commercial bus (Korope) attacked the driver with a shovel under the vehicle before shooting him in the chest with a pistol."
  },
  {
    "headline": "From bandits to terrorists: Will status change end insecurity?",
    "summarized_story": "“Commercial, educational, and farming activities in the North-west and North-central have been disrupted as a result of the groups’ activities,” the federal government noted.\nGumi in a statement by his media aide, Tukur Mamu, said declaring the herdsmen bandits as terrorists is a decision taken for political expediency.\n“Will bandits become terrorists because they have been categorised as terrorists?\nFighting terrorists and fighting bandits who have been declared terrorists at the same time will further complicate the war against terrorism.\n“It is easy to change labels, and tag bandits as terrorists."
  },
  {
    "headline": "Breaking: Bandits kidnap 13, kill 1 in Zaria",
    "summarized_story": "Armed Bandits have abducted 13 people and killed 1 following an attack Thursday night on 2 communities of Kanuwar Isa and Kugu of Dutse Ward in Zaria local government of Kaduna state.\nA source in Zulkifil Sani disclosed to Blueprint that the Bandits invaded Kasuwar Isa community Thursday night where they kidnapped nine people from the community and proceeded to Kugu and abducted four.\n“They shot dead a former councillor that represented the ward in Zaria Local Government known as Honourable Magaji Shaka-Zulu “, he said.\nAt the time of filing this report, the Police spokesperson in the state, ASP Mohammed Jalige, could not be reached so as to seek for comment on the attack."
  },
  {
    "headline": "Breaking: Atlast, Navy frees Comedian Cute Abiola",
    "summarized_story": "Popular Nigerian online comedian, Abdulgafar Ahmed, popularly known as Cute Abiola has been released from detention by the Nigerian Navy after several weeks.\nThe news of his release was confirmed by the Naval spokesperson, Commodore Suleman Dahun, on Friday.\nThe Kwara state born Comedian was declared missing on Monday, November 15, 2021, when fellow comedian Debo Adedayo aka Mr Macaroni, raised the alarm he couldn’t be found after reporting at his office in Navy Town, Lagos.\nThe Navy later announced he wasn’t missing but was detained for contravening the military laws by posting a video of himself in military uniform on social media, an act which is said to be in violation of the armed forces’ social media policy.\nThe Navy added that the comedian failed to show up when called upon to explain himself but only returned after the expiration of his leave on November 15, 2021, and was put behind bars the same day."
  },
  {
    "headline": "FG Approves COVID-19 Booster Shots Amid Omicron Variant",
    "summarized_story": "The Federal Government has approved COVID-19 booster shots as the world battles to contain the new Omicron variant.\nHe quoted the Executive Director of the agency, Dr. Faisal Shuaib, as saying that the booster doses are for people from 18 years and above.\n“COVID-19 booster dose gives greater protection against the virus and urged all Nigerians to take advantage of the opportunity offered by the Federal Government of Nigeria,” Faisal was quoted as saying.\nREAD ALSO: Australia Halts Border Reopening As WHO Warns On New VariantA Regretable, Unfortunate MoveThe approval of the booster doses in Nigeria is coming at a time when the world is battling the Omicron COVID-19 variant.\nThe move has generated a series of debates with the South African government faulting the travel ban imposed on the country."
  },
  {
    "headline": "Lagos Govt Orders Indefinite Closure Of Dowen College",
    "summarized_story": "The Lagos State Government has ordered the indefinite closure of Dowen College, located in the Lekki area of the state.\nThis is pending the outcome of an investigation into the death of Sylvester Oromoni Jnr, a student of the school.\nThe Commissioner also called for calm, saying no effort will be spared in getting to the root of the incident.\nHowever, Dowen College in a press release that also went viral on social media expressed surprise at the allegation.\n“The resident doctor also called the mother later in the week to check up on his progress but she informed the doctor that he was sleeping at the time."
  },
  {
    "headline": "Three Smugglers Bag 16-Year Jail Term For Importing 661 Pump Action Rifles",
    "summarized_story": "Others convicted and sentenced to jail terms by Justice Ayokunle Faji led-court are Oskar Okafor; Donatus Achinulo and Mahmud’s company, Hassan Trades Limited.\nJustice Faji, however, acquitted and discharged Abdulahi Danjuma of all charges.\nJustice Faji, however, discharged and acquitted the fifth defendant.\nWhile delivering the judgement, Justice Faji, said the offence committed by the convicts touches on the security of the country.\nThe judge said the sentence shall run concurrently; the convicts were sentenced on count one and two other counts struck out."
  },
  {
    "headline": "Expo 2020 Dubai: No Better Time To Work Together For A Brighter Future Than Now – Buhari",
    "summarized_story": "President Muhammadu Buhari has called on countries, businesses, and individuals to work together to overcome challenges and make the world a better place.\nThe President made the call on Friday during Nigeria’s National Day ceremony at the Expo 2020 Dubai.\n“There is no better time to work together for a brighter future than now,” the President said during his speech at the ceremony which he attended with top government officials from Nigeria.\n“Connecting Minds, Creating the Future; the theme of the ongoing Expo has placed a moral burden on all relevant shareholders across national boundaries.\n“The concerted efforts by world leaders working together enabled us to limit the catastrophic consequences of this pandemic."
  },
  {
    "headline": "Awoniyi Scores Ninth League Goal As Union Berlin Beat Leipzig",
    "summarized_story": "In-form Nigerian striker Taiwo Awoniyi’s early goal set Union Berlin on the path to a 2-1 win over RB Leipzig on Friday, lifting them to fourth in the German Bundesliga.\nThis was Awoniyi’s ninth Bundesliga goal this season while the result leaves Leipzig still looking for an away win in the league.\nAhead of the rest of the weekend fixtures, Berlin climb to fourth on 23 points from 14 games.\nUnion then grabbed the winner just before the hour mark when a shot from Max Kruse was deflected off teammate Timo Baumgartl and into the goal.\nHaaland has scored 10 Bundesliga goals for Dortmund so far this season while Lewandowski has 14 goals for Bayern."
  },
  {
    "headline": "EFCC rearraigns former Ekiti Gov, Fayose on 11-count amended charge -",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC), on Thursday re-arraigned former Governor of Ekiti State, Ayodele Fayose, and his company, Spotless Limited before a Federal High Court sitting in Lagos.\nJustice Chukwujekwu Aneke is hearing the 11-count charge on alleged money laundering and non-declaration of assets.\nIn the amended charge, Mr Fayose and one Abiodun Agbele, who is also standing trial on alleged money laundering offences before another division of the court, were alleged to have on June 17, 2014, taken possession of N1.\n2 billion, to fund Mr Fayose’s 2014 gubernatorial campaign in Ekiti State.\nAnother Senior Advocate of Nigeria, Rotimi Jacobs Is prosecuting the high profile case for the EFCC."
  },
  {
    "headline": "Wayas was a special breed, his death painful",
    "summarized_story": "Former President, Olusegun Obasanjo has disclosed that the late Senate President, Dr. Joseph Wayas lived for the welfare and security of the common man.\nThe late Senate President died early hours of Wednesday, in United Kingdom after illness at age 80.\nWayas was a special breed who contributed immensely to the development of the country and became a parliamentarian in the Second Republic.\n“He was such a great patriot who had contributed his own quota to the legislative governance and overall development of Nigeria.\nHis knowledge of practices and procedures of the Senate, according to Obasanjo “helped him greatly in running the affairs of the Senate."
  },
  {
    "headline": "Niger Gov signs 2021 revised budget into law",
    "summarized_story": "Niger State governor, Abubakar Sani Bello has assented into law the State “Budget Revision law, 2021”.\nThe Governor signed the law at the Government House, Minna.\nSpeaking to newsmen, the Permanent Secretary, Niger State Planning Commission, Hajiya Ramatu Umar explained that the 2021 budget was reviewed downward following the significant reduction in the inflow of revenue to the state.\nThe Permanent Secretary disclosed that the revised budget allocated N72.5 billion for recurrent expenditure while the sum of 77.3 billion is for capital expenditure bringing the total of the revised 2021 budget to N149.9 billion.\nIn the revised budget, Economic Sector has the highest allocation with N54.7 billion, N14.8 billion is to Social Sector, N7.2 billion was allocated to Administrative Sector while Law and Justice got N580 Million."
  },
  {
    "headline": "Ondo Assembly confirms appointment of 14 Commissioner-nominees -",
    "summarized_story": "The Ondo State House of Assembly has ratified the appointment of fourteen new commissioners.\nA letter of request for the confirmation of appointment of the fourteen Commissioners, signed by Secretary to the State Government, Princess Catherine Oladunni Odu had earlier been forwarded to the House.\nSpeaking after confirmation of the nominees, the Speaker, Oleyelogun Bamidele David congratulated the newly confirmed Commissioners.\nThe Speaker urged the new Commissioners to work with the Governor to enhance the delivery of democracy dividends to the people of Ondo State.\nOthers are: Razak Obe, Dr Banji Ajaka, Pastor Emmanuel Igbasan, Mrs Yetunde Adeyanju, Pastor Femi Agagu and Wale Akinlosotu."
  },
  {
    "headline": "“I Urge the World to Watch Nigeria As We Rebuild And Transform” – President Buhari",
    "summarized_story": "“I urge the world to watch Nigeria as we rebuild and transform” – President Muhammadu Buhari in a message delivered by Minister of Industry, Trade and Investment Niyi Adebayo at the Arise Fashion Weekend 2021 “Made in Nigeria: Conquering the World”."
  },
  {
    "headline": "Nigeria: NCC Confirms MTN, Airtel, Mafab Communications for 3.5GHz Spectrum",
    "summarized_story": "The Nigerian Communications Commission (NCC), on Thursday confirmed that three telecoms operators submitted their Expression of Interest (EoI) to the commission to bid for the 3.5GHz spectrum licence, whose auction date has been fixed for December 13, 2021.\nThe NCC in a statement signed by its Director, Public Affairs, Dr. Ikechukwu Adinde, disclosed that it received their applications to bid for the spectrum.\nThe three bidders are MTN Nigeria Plc, Airtel Networks Limited and Mafab Communications Limited.\nAlthough Mafab Communications is not known in the Nigerian telecoms space, THISDAY gathered that it is a new entrant and a strategic investor with a non-mobile licence that is investing in one of the small telecoms operators in Nigeria.\nMeanwhile, the Executive Commissioner, Stakeholders Management of the Nigerian NCC, Mr. Adeleke Adewolu, has expressed the commission’s readiness to launch the 5G network in 2022."
  },
  {
    "headline": "South Africa Considers 10-year Visa for Nigerian Business Travellers",
    "summarized_story": "In a bid to promote trade between Nigeria and South Africa, the South African High Commissioner to Nigeria, Mr. Thamsanqa Dennis Mseleku has advised more Nigerian businesses, especially financial institutions to expand their businesses to South Africa.\nThe envoy also disclosed that the South African consulate was working on issuing Nigerian business operators 10-year-visa to further foster business relationship between both countries.\nHe said: “Yes, Nigerian businesses are operating in South Africa, and this issue was raised in 2019 when President Buhari was in South Africa specifically referring to Access Bank and Air Peace.\nToday Access bank has opened a bank in South Africa and is active and Air peace is flying to South Africa.\nOn the issues surrounding inaccessibility of visa to business personnel, he added: “For business people, we are agreeing and we would continue to implement longer term visas for them."
  },
  {
    "headline": "Despite Emergency Oil Releases, Omicron Fears, OPEC Sticks to 400,000bpd Supply Hike",
    "summarized_story": "A statement released after meeting stated: “The 23rd OPEC and non-OPEC Ministerial Meeting (ONOMM), was held via videoconference, on Thursday December 2, 2021.\n“The meeting reaffirmed the continued commitment of the participating countries in the Declaration of Cooperation (DoC) to ensure a stable and balanced oil market.\nMeanwhile, Nigeria has received a production output allocation of 1.683 million bpd for January, in spite of its inability to meet previous quotas.\nDespite the over 1.6 million bpd allocated to Nigeria in September and October, the country was only to supply 1.399 million bpd and 1.354 million barrels in the two separate months.\n“It’s very obvious that by the close of the year, we will get back to the 1.7 barrels to 1.8 barrels per day of crude oil."
  },
  {
    "headline": "Nigeria: LASU Students, Activist to Join Sanwo-Olu in ‘Lagos Peace Walk’",
    "summarized_story": "Students of the Lagos State University (LASU) on Thursday expressed their readiness to participate in the ‘Lagos Peace Walk,’ proposed by Governor Babajide Sanwo-Olu to herald the healing of Lagos in the aftermath of last year’s EndSARS protests in the state.\nLASU students who came out in large numbers to welcome the governor said they have all resolved to participate in the ‘Walk for Peace’ with the governor for peace and prosperity of the state.\nThey commended the governor’s giant strides in Lagos State, especially in the education sector.\nWhenever you run, we will run with you to the end,” Badmus assured on behalf of LASU students.\nAwosanya, who started the #EndSARS online, also advised that those dissatisfied with the Lagos State Government’s White Paper should approach the court to express their grievances against the government decision."
  }
]