[
  {
    "headline": "Okowa congratulates Tambuwal at 56, prays for him",
    "summarized_story": "The Governor of Delta State, Ifeanyi Okowa, on Monday congratulated his Sokoto counterpart, Aminu Tambuwal, as the latter clocked 56 years.\nTambuwal, who is also the Chairman of the People’s Democratic Party Governors’ Forum, celebrated his 56th year on Monday and had received congratulatory messages.\nOkowa took to his Facebook page on Monday to share a picture of himself and Tambuwal as he showered the celebrant with prayers.\nThe Delta State Governor wrote, “I join the family and friends of my dear brother, Aminu Waziri Tambuwal, the Governor of Sokoto State and Chairman of the PDP Governor’s Forum to congratulate him as he celebrates his birthday today.\nMay He continue to bless your loved ones, those you lead, and everything you do.”Copyright PUNCH."
  },
  {
    "headline": "Queen Elizabeth to celebrate 70-year jubilee for four days",
    "summarized_story": "Buckingham Palace has unveiled the full programme of events to celebrate the British queen’s platinum jubilee, marking 70 years on the throne.\nThe celebrations will include the 95-year-old monarch opening her private estates to the public and some of the world’s biggest stars performing outside Buckingham Palace in London.\nOfficial jubilee celebrations would begin on Monday when Fortnum & Mason launches the Platinum Pudding Competition to find a dish to dedicate to the queen’s reign.\nPeople across the country would sit down together for the Big Jubilee Lunch on Sunday, June 5, the final day of the bank holiday break.\nSandringham and Balmoral would also be open for residents and visitors to enjoy the celebrations across the long weekend."
  },
  {
    "headline": "Oba Omisore’ll be remembered for dedication to Osun’s development —Buhari",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), has extended heartfelt condolences to a former deputy governor of Osun State, Iyiola Omisore, and the entire Omisore family on the passing of their father and Olu of Ayepe-Olode, Oba Omisore.\nThis is as he said the late monarch would be remembered for his lifelong dedication to the development of his people.\nBuhari’s condolence message is contained in a statement signed on Monday by his Special Adviser on Media and Publicity, Femi Adesina, titled, ‘President Buhari mourns Oba Omisore, father of ex-Osun Deputy Gov’.\nHe, therefore, prayed for the peaceful repose of the departed and comfort for those who mourn."
  },
  {
    "headline": "How poor generation, metering gap, financial crisis shackled power sector in 2021",
    "summarized_story": "6.7 milion customers unmeteredThe NERC data also showed that 6.68 million customers were still without electricity meters as at September 2021.\nThis is because there has not been any remarkable improvement in the power sector.\nThe expectations were high that with the metering system been ramped up that power supply would improve.\n“The Nigerian Electricity Supply Industry requires major intervention if the gains of the Power Sector Reforms are to be realised.\n“In spite of the investments that have been made, the power sector has continued to be a challenge to development."
  },
  {
    "headline": "Cost of funds fall as interbank liquidity rises 42%",
    "summarized_story": "By Babajide KomolafeCost of funds in the interbank money market fell by 5.4 percentage points last week.\nThe development was triggered by a 42 per cent increase in the money market liquidity.\nFinancial Vanguard analysis showed that the decline was prompted by a 42 per cent increase in interbank liquidity to N253.7 billion last week from N178.\nThe 42 per cent increase in market liquidity is in contrast to the 34 per cent decline in average market liquidity in December.\nHowever, analysts at Financial Derivatives Company, FDC, projected low market liquidity due to increased dollar sales to banks by the CBN and possible currency adjustments."
  },
  {
    "headline": "Okowa felicitates Tambuwal at 56",
    "summarized_story": "Aminu TambuwalDelta Governor Dr. Ifeanyi Okowa has congratulated his Sokoto State counterpart, Alhaji Aminu Tambuwal, as he turned 56.\nOkowa also lauded Tambuwal for his sterling contributions to the socio-economic and political re-engineering of Sokoto State and Nigeria, stating that such efforts were worthy of inspiration to the younger generation.\nAccording to him, Governor Tambuwal is a nationalist, whose selfless and impressive political endeavours had placed him ahead of his contemporaries.\nAminu Waziri Tambuwal, on his 56th birth anniversary.\n“Over the years, you have become a household name in the contemporary politics of Nigeria by dint of hardwork, sagacity and doggedness."
  },
  {
    "headline": "BREAKING: Herdsmen attack Ishiagu community in Ebonyi, kill 3",
    "summarized_story": "By Peter Okutu – AbakalikiUnconfirmed report reaching Vanguard has it that three indigenes of Ishiagu Community, in Ivo Local Government Area of Ebonyi State were attacked and killed by suspected herdsmen in the area.\nREAD ALSO: Suspected herdsmen sack Enugu communityThe victims were killed by the suspected herders while returning from their farm in the evening of the fateful day.\nDetails later…Vanguard News Nigeria"
  },
  {
    "headline": "Empowering Future Ambitions for Children in Underserved Communities",
    "summarized_story": "For these children, their hope for a brighter future begins with access to quality education.\nA network of nursery and primary schools in underserved communities in Lagos and Osun state, Bridge Nigeria provides life changing education and offers the platform that puts children on a pathway to future success, irrespective of their socio-economic background.\nBridge pupil, Pwaakadi Sebastian, joined Bridge Rahimi Oyo Academy in Morogbo Badagry, after relocating to Lagos from Borno, in the north east part of the country.\nNow, Bernice is in school learning and hopes to become a doctor in future.\nAs a result of the accelerated learning at Bridge, these children can now aspire to become doctors, engineers, scientists etc and look beyond their socio economic limitations."
  },
  {
    "headline": "BREAKING: NASS staff protest non-implementation of minimum wage",
    "summarized_story": "Staff working in the National Assembly, operating under the Parliamentary Staff Association of Nigeria (PASAN), on Monday, embarked on a protest over the non-implementation of minimum wage.\nDAILY POST reports that the workers converged on the lobby of the white house of the National Assembly with placards condemning the action of the Chairman of the National Assembly Service Commission (NASC) for breaching the memorandum of understanding (MoU) entered into in 2021.\nA copy of the resolutions to embark on protest dated 6th January 2022 and addressed to the Clerk to the National Assembly (CNA) which was sighted by DAILY POST, showed that the association raised six fundamental breaches by the NASS management that triggered the protest.\nThe resolution, which was signed by the association’s Chairman, Comrade Sunday Sabiyi, and the Vice-Chairman, Comrade M.A.\nLiman, accused the NASC and NASS of deliberate contempt of their MoU which was agreed on 14th April 2021 stating that “there would be full implementation of the new National Minimum Wage Act, 2019, and the Revised Condition of Service.”Part of the resolutions read: “Following the Management’s breach of the Memorandum of Understanding entered with PASAN on the 13th April 2021, on the full implementation of the new National Minimum Wage Act, 2019, and the Revised Condition of Service, Congress hereby observes put the management on protest notice.”Efforts to speak with the Clerk’s media adviser failed as his lines were switched off."
  },
  {
    "headline": "Don’t honour DSS invitation, they want to silence you – SOKAPU warns Bishop Kukah",
    "summarized_story": "The Southern Kaduna People’s Union (SOKAPU) has on Monday advised Bishop Mathew Kukah not to honour an invitation by the Department of State Services (DSS) over his latest Christmas message.\nFollowing this, SOKAPU youths advised Kukah not to honour the purported invitation, saying that some Nigerians have fallen victim to such invitation.\nThe group mentioned former Deputy Governor of the Central Bank of Nigeria (CBN), Dr Obadiah Mailafia as a victim of DSS invitation.\nAccording to the statement, without ruling out any possibility of harm, it considered the invitation of Bishop Kukah by the DSS a ploy designed to silence him at all cost.\nIt advised Kukah to ignore such invitation by the DSS for the obvious reasons of threat to life and personal safety."
  },
  {
    "headline": "Electricity shutdown: FG pays AEDC workers’ salaries, other entitlements",
    "summarized_story": "The Federal Government has paid all entitlements of the workers of Abuja Electricity Distribution Company (AEDC).\nOn Monday, the Ministry of Power announced the fulfilment of its promise to ensure that the matter was resolved.\nHis spokesman, Isa Sanusi, listed the entitlements settled as “unpaid allowances, salaries, union deductions and unremitted 20 months pensions contributions deducted from salaries”.\nAliyu reaffirmed the commitment of the ministry to work with all stakeholders “to ensure steady electricity supply” across Nigeria.\nIn December 2021, the ministry appealed to the AEDC workers and organized labour to end the electricity shutdown, with a vow to resolve the matter in early January."
  },
  {
    "headline": "Tinubu, Osinbajo: Southwest strongly considered to produce Buhari’s successor – Gbenga Daniel",
    "summarized_story": "Gbenga Daniel, a former Governor of Ogun State, has said the southwest is being considered to produce Nigeria’s next president.\nDaniel said the southwest stands a better chance of producing Nigeria’s next president if the region agrees to a consensus candidate.\nAccording to Daniel: “The western states or what you can call the south-west is being strongly considered to take over the mantle of leadership for the President.\nA lot of pressure groups have been rooting for Tinubu and Osinbajo to contest for the presidency.\nHowever, both Tinubu and Osinbajo have not declared their intention to run for the presidency."
  },
  {
    "headline": "Buhari reacts to death of Oba Omisore",
    "summarized_story": "President Muhammadu Buhari has extended his heartfelt condolences to a former deputy governor of Osun State, Senator Iyiola Omisore, and the entire Omisore family on the passing of their father and Olu of Ayepe-Olode, Oba David Omisore.\nBuhari’s condolence was contained in a statement by his spokesman, Femi Adesina, on Monday.\nThe President expressed confidence that the Omisore family, friends and associates will continue to honour the departed patriarch’s avowed commitment to peaceful settlement of disputes and promoting harmony among different ethnic groups.\nPresident Buhari prayed for the peaceful repose of the departed and comfort for those who mourn.\nHe passed on some days ago at the age of 90."
  },
  {
    "headline": "Passengers stranded over derailed cargo train in Minna",
    "summarized_story": "A derailed cargo train has left thousands of passengers stranded at the Minna terminal of the Nigerian Railway Corporation (NRC).\nThe Kano-bound train was said to have left Lagos and derailed a week ago at the Minna terminal, making it impossible for other passenger trains to pass through to their destinations.\nThe majority of the passengers on the train could not continue their journey because of the derailed cargo.\nWhen The Nation visited the railway station, it was observed efforts were on to evacuate the cargo train and make the rail free for other trains to pass through.\nWe were told that the cargo train said to have taken off from Lagos for about a week now, why have they not removed it and punishing the passengers?”He stated technicians from the Nigerian Railway Corporation have been trying to evacuate the cargo train manually by using jacks which has been delaying the process."
  },
  {
    "headline": "JUST IN: Workers picket NASS Complex, defy management",
    "summarized_story": "Workers, under the auspices of Parliamentary Staff Association of Nigeria (PASAN) on Monday, picketed the National Assembly Complex for two hours.\nThe picketing followed the failure of the management to persuade the workers to suspend the action.\nThe workers had notified management of the picketing and their resolve to embark on strike if their demands were not met.\nRead Also: VIDEO: Workers picket NASS complex over unpaid allowancesLed by their Chairman, Comrade Sabiyi Sunday, the protesting workers marched several times around the foyer of the National Assembly, singing solidarity songs and waving banners and placards.\nHe said executives of the association would be attending an emergency meeting called by the National Assembly Service Commission to address issues raised by the workers."
  },
  {
    "headline": "NLC mobilises for protests against hike in petrol price",
    "summarized_story": "The Nigeria Labour Congress (NLC) has begun mass mobilisation of civil society organisations (CSOs) ahead of its planned January 27 and February 1 nationwide protests against the proposed removal of petrol subsidy by the Federal Government.\n“There will also be a national protest on the 1st of February 2022, in the Federal Capital Territory (FCT).\n- Advertisement -“The planned protest is to register the displeasure and rejection by Nigerian workers and people of the proposed plans by the government to increase the price of the Premium Motor Spirit (PMS), also commonly referred to as ‘petrol’.\n“Currently, it is being speculated that the planned price hike would see a litre of petrol selling between N340 and N360.\n“Clearly, this price upsurge would unleash very severe and calamitous dislocation on Nigerian workers, people, and businesses."
  },
  {
    "headline": "ECOWAS hits Mali with economic sanctions",
    "summarized_story": "West Africa’s main regional bloc, Economic Community of West African States (ECOWAS), yesterday agreed to close borders with Mali.\nIt also imposed sweeping economic sanctions in response to “unacceptable” delays to hold elections after a 2020 military coup.\nThe extraordinary meeting, in which the Vice President Osinbajo represented President Muhammadu Buhari, was to discuss the political situation in the Republic of Mali.\nOsinbajo said ECOWAS had not lost its bite as it was concerned about issues of good governance and democratic enterprise in the ECOWAS region.\nIt wasn’t immediately known whether the West African leaders gathering in Ghana’s capital would further toughen existing sanctions against Mali’s coup leadership."
  },
  {
    "headline": "IPOB urges Buhari to reconsider stand on Kanu",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has asked President Mohammadu Buhari to reconsider his stance on the release of its detained leader, Mazi Nnamdi Kanu.\nThe group said Buhari was about making a mistake capable of adversely affecting Nigeria, if he failed to free Kanu.\n- Advertisement -The statement reads in part, “Our attention has been drawn to a comment by President Muhammadu Buhari that he will not release our Leader, Mazi Nnamdi Kanu.\nIt added, “Our leader Mazi Nnamdi Kanu and IPOB will defeat them both in local and international courts.\n“Buhari and his advisers should reconsider their stance concerning the release of Mazi Nnamdi KANU."
  },
  {
    "headline": "2023 presidency: Anxiety over Jonathan’s rumoured interest",
    "summarized_story": "From Ndubuisi Orji, AbujaThe rumoured plot to draft former President Goodluck Jonathan into the 2023 presidential race by the All Progressives Congress (APC) is causing disquiet and panic in the Peoples Democratic Party (PDP).\nEze described Jonathan’s alleged presidential bid on APC platform as rumour, saying it had no basis.\n“Some of us are worried of its implications for the PDP, if it turns out to be true.\nHe said: “Because president Jonathan, since he left office, has not been participating actively in the affairs of the PDP.\nBabatope told Daily Sun, at the weekend, that Jonathan would be diminished if he contests in 2023 on APC platform."
  },
  {
    "headline": "Ekiti guber: APC shifts primary to January 27, releases revised timetable",
    "summarized_story": "From Romanus Ugwu, AbujaThe All Progressives Congress (APC) has issued a revised timetable and schedule of activities for Ekiti State governorship election, shifting its primary election earlier slated for January 22 to January 27.\nThe party said it issued the timetable in accordance with provisions of the Electoral Act 2010 (as amended) and Independent National Electoral Commission (INEC) guidelines.\nIn the revised timetable, the party said: “In accordance with provisions of the Electoral Act 2010 (as amended) and Independent National Electoral Commission (INEC) guidelines, the All Progressives Congress has released a revised timetable and schedule of activities for the conduct of the 2022 Governorship Primary Election in Ekiti State.\n“INEC has fixed June 18, 2022 for the Ekiti governorship election.\nHowever, female aspirants and physically challenged aspirants are to pay 50 percent of the prescribed fees,” Akpanudoedehe said."
  },
  {
    "headline": "Kalu commissions roads, town hall, felicitates with Rep",
    "summarized_story": "The roads commissioned include a 1 km road Amaogbu, Agbonmiri, Ndi Okorie Ukwu road, the Okpororenyi Nkalunta road and the Agbamunzu town hall, all situated in Bende town, Bende federal constituency.\nA community stakeholder, the President General Bende, Loveday Kalu, recalled how motorists and road users found it difficult to navigate the roads, most especially during the rainy season.\nHe extolled both Senator Kalu and Benjamin Kalu for working harmoniously to come to their aid to see that the roads were constructed for their economic benefit.\nKalu expressed that Benjamin Kalu has performed excellently in delivering the dividends of democracy to the people of Bende, saying he is pleased with him.\nKalu also urged the people to shun their negative attitude towards President Buhari, saying the president loves the Igbo."
  },
  {
    "headline": "Senate unearths defunct PHCN’s N14.7bn stashed in banks – The Sun Nigeria",
    "summarized_story": "From Fred Itua, AbujaA Senate panel has unearthed N14.7 billion proceeds of the defunct Power Holding Company of Nigeria (PHCN) hidden in commercial banks by the Bureau of Public Enterprise (BPE).\nBut, the BPE in its written submission said: “Two separate sums of N3.231,984.73 (allegedly held in Fidelity Bank PLC) and N18.199,520.87 (held in Stanbic Bank PLC) are unaudited bank balances that were actually no longer in existence as at the date of the audited financial statements or asked questions, the matter would have been clarified.\n“With respect to the two other bank balances N4.4 billion (Access Bank PLC) and N10.2 billon in First City Monument Bank (FCMB).\n“Whereas, the privatisation of PHCN was concluded in 2013, the proceeds are yet to be remitted to CBN Privatisation Proceeds Accounts.\n“Unauthorised funds kept in commercial banks may be diverted for other purposes, thereby leading to loss of revenue available for government programmes."
  },
  {
    "headline": "SERAP sues Lawan, Gbajabiamila over failure to probe missing N4.1bn NASS funds",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against the Senate President, Ahmad Lawan and Speaker, House of Representatives, Femi Gbajabiamila over their failure to probe, and to refer to appropriate anti-corruption agencies fresh allegations that N4.1billion of public money budgeted for the National Assembly is missing.\nClick Here Now .\n“The failure of the National Assembly to promptly and thoroughly investigate, and to refer to appropriate anti-corruption agencies the allegations documented in the annual audited report for 2016 is a fundamental breach of the oversight and public interest duties imposed on the legislative body.\nThis suit seeks to vindicate the rule of law, the public interest, and to promote transparency and accountability.\nGovernment agencies and institutions are responsible to a court of justice for the lawfulness of what they do, and of that the court is the only judge.”SERAP had last year sent a letter to Lawan and Gbajabiamila requesting them to “use their good offices to urgently probe and refer to appropriate anti-corruption agencies allegations that fresh allegations of missing N4.1bn of public money.”"
  },
  {
    "headline": "COVID-19: Djokovic Wins Appeal against Cancellation of His Australian Visa",
    "summarized_story": "Judge rules he should be released, overturns government’s decisionJudge Anthony Kelly has ruled in Melbourne quashing the Australian government’s decision to cancel Novak Djokovic’s visa and ordered that he should be released within 30 minutes of the decision.\nThe Serbian tennis player flew into Melbourne last week hoping to defend his Australian Open title after claiming to have medical exemption from COVID-19 vaccination.\nBut instead, he has been held in an immigration detention centre with Australia’s Border authorities claiming no such authorization came from them.\nHis visa to come into Melbourne to defend his Australian Open title was cancelled.\nBut in the ruling a few minutes ago, the judge ruled that the respondent — in this case, the Ministry of Home Affairs — must pay Djokovic’s costs as agreed or assessed."
  },
  {
    "headline": "Zamfara Killings: Atiku Urges FG to Ramp Up Security as Farouq Decries Situation",
    "summarized_story": "In the same vein, the Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Umar Farouq, has also described the recent killings in Zamfara by bandits as nothing short of horrific.\nOver 500 fleeing bandits on motorcycles had reportedly attacked five villages and razed their homes, after killing over 200 of the people, recently.\n“We sympathise with the government and people of Zamfara State in this trying period and condole with the families of the dead.\nWe pray for the repose of their souls and that peace returns to the state and soon as possible,” she said.\n“Severally, without being prompted, you (Governor Zulum) come to our aide to support us (the army) even logistics wise."
  },
  {
    "headline": "Stock Market Gains N1.33trn in First Trading Week",
    "summarized_story": "Kayode TokedeThe Nigerian Exchange Limited (NGX) kicked off the first trading week of 2022 on a positive note as its market capitalisation gained N1.33 trillion.\nThis followed foreign investors’ and high net worth investors’ demand for Airtel Africa Plc, BUA Foods, Lafarge Africa Plc, and FBN Holdings Plc, which pushed market capitalisation to N23.628 trillion from the N22.296 trillion the stock market opened with trading on the first day.\nActivity levels were strong, as trading volume and value surged by 103.7per cent w/w and 246.8per cent w/w, respectively.\nThe Financial Services Industry followed with 537.959 million shares worth N4.627 billion in 8,015 deals.\nThe third place was The ICT Industry, with a turnover of 76.906 million shares worth N704.346 million in 933 deals."
  },
  {
    "headline": "Oil Defies 2022 Surplus Forecast, Continues Bullish Run on Fading Virus Fears",
    "summarized_story": "*May worsen inflationary pains by major consumersEmmanuel Addeh in AbujaAlthough still early in the year, oil prices has started off 2022 on a positive note, defying experts’ prediction of a ballooning surplus, instead surpassing $80 a barrel at the weekend.\nNigeria is pumping roughly 1.35 million barrels , the lowest figure in years.\nMorgan Stanley expects Brent to climb to $90 a barrel by the third quarter and estimates that observable stockpiles fell by about 690 million barrels last year.\nThe alliance sees an excess of 1.4 million barrels a day in the first quarter, 25 per cent less than its projection a month ago.\nIt anticipates a rebound of 4.2 million barrels a day in global consumption this year, and demand topping 100 million barrels a day by June."
  },
  {
    "headline": "Outraged by Zamfara Massacre, Buhari Vows to Hunt Down Terrorists",
    "summarized_story": "The governors equally commended the government for declaring bandits as terrorists.\nThey were said to be fleeing from Zamfara State as a result of ongoing military operations, when they invaded the villages and killed over 200 people.\nReacting to the incident, President Buhari yesterday vowed to hunt down and eliminate terrorists in the country.\nHe expressed the happiness of the Northern states over the recent declaration of bandits as terrorists by the government.\nA statement issued yesterday by the Nigerian Army said troops clashed with the terrorists in an illegal market operated by the terrorists in Gallo Malawari Village."
  },
  {
    "headline": "EXCLUSIVE: Ex-President Jonathan's Ambition To Retake Power In 2023 Hits Setback As Former Appointees Fail To Support Move Over Distrust For Buhari",
    "summarized_story": "The newspaper had earlier reported how President Buhari shunned former governor of Lagos State and National Leader of the ruling All Progressives Congress, Asiwaju Bola Tinubu, and Vice President Yemi Osinbajo to support Jonathan’s ambition.\nSee Also Exclusive EXCLUSIVE: Buhari Shuns Tinubu, Osinbajo To Support Ex-President Jonathan’s 2023 Election Ambition To Pave Way For North To Reclaim Power In 2027To show commitment to this plan, the President Buhari administration had secretly released funds seized from Jonathan's wife, Patience, back to her.\n“They also said they can’t trust Buhari who their sources said is actually interested in relinquishing power to a Northerner from the North-East.\nThey were informed Buhari is looking at Buni or Zulum and is just lying to Jonathan.\n“Buhari also gave him an ultimatum to join APC by the end of January, early February or forget his ambition,” he said."
  },
  {
    "headline": "EXCLUSIVE: Ex-President Jonathan's Ambition To Retake Power In 2023 Hits Setback As Former Appointees Fail To Support Move Over Distrust For Buhari",
    "summarized_story": "The newspaper had earlier reported how President Buhari shunned former governor of Lagos State and National Leader of the ruling All Progressives Congress, Asiwaju Bola Tinubu, and Vice President Yemi Osinbajo to support Jonathan’s ambition.\nSee Also Exclusive EXCLUSIVE: Buhari Shuns Tinubu, Osinbajo To Support Ex-President Jonathan’s 2023 Election Ambition To Pave Way For North To Reclaim Power In 2027To show commitment to this plan, the President Buhari administration had secretly released funds seized from Jonathan's wife, Patience, back to her.\n“They also said they can’t trust Buhari who their sources said is actually interested in relinquishing power to a Northerner from the North-East.\nThey were informed Buhari is looking at Buni or Zulum and is just lying to Jonathan.\n“Buhari also gave him an ultimatum to join APC by the end of January, early February or forget his ambition,” he said."
  },
  {
    "headline": "EXCLUSIVE: How Ex-Lagos Director Of Public Prosecution Embarrassed State Government With Role In Controversial Legal Advice On Death Of Oromoni",
    "summarized_story": "The state government, SaharaReporters further gathered, was doing everything possible to distance Sanwo-Olu's administration from the controversial legal advice in order to improve the public image of the government.\n“Her (Oshinusi) role was so despicable that the government had to deny that she was never the Director, Directorate of Public Prosecutions.\nTestifying before the panel, General Taiwo had said, \"On October 20, 2020, Lagos State descended into anarchy.\nAfter attempting several times to have Oyewole and his men disengage and leave the area, the Lagos governor left the scene in disappointment.\nInside sources told SaharaReporters that the Lagos governor was greatly worried that these embarrassing incidents could further dent his chances of returning to office for a second term."
  },
  {
    "headline": "EXCLUSIVE: How Ex-Lagos Director Of Public Prosecution Embarrassed State Government With Role In Controversial Legal Advice On Death Of Oromoni",
    "summarized_story": "The state government, SaharaReporters further gathered, was doing everything possible to distance Sanwo-Olu's administration from the controversial legal advice in order to improve the public image of the government.\n“Her (Oshinusi) role was so despicable that the government had to deny that she was never the Director, Directorate of Public Prosecutions.\nTestifying before the panel, General Taiwo had said, \"On October 20, 2020, Lagos State descended into anarchy.\nAfter attempting several times to have Oyewole and his men disengage and leave the area, the Lagos governor left the scene in disappointment.\nInside sources told SaharaReporters that the Lagos governor was greatly worried that these embarrassing incidents could further dent his chances of returning to office for a second term."
  },
  {
    "headline": "Nigerian Senate Uncovers N14.7billion Belonging To Defunct Firm, PHCN, Hidden In Banks",
    "summarized_story": "The sum of N14.7billion proceeds of the defunct Power Holding Company of Nigeria (PHCN) hidden in commercial banks by the Bureau of Public Enterprise (BPE) has been uncovered by a Senate panel.\nThe Senate Public Accounts Committee unravel the hidden proceed in commercial banks as at December 31, 2016, whereas, the privatisation on PHCN had been concluded since 2013, relying on the report of 2017 auditor general’s report.\n“The balance in the FCMB Bank as at December 31, 2016 was only $36,053.55 following a transfer of $65,088,198.53.\n“Whereas, the privatisation of PHCN was concluded in 2013, the proceeds are yet to be remitted to CBN Privatisation Proceeds Accounts.\n“Unauthorised funds kept in commercial banks may be diverted for other purposes, thereby leading to loss of revenue available for government programmes."
  },
  {
    "headline": "Kaduna asks public schools to adopt four-day work week",
    "summarized_story": "The Kaduna government has directed all public schools in the state to migrate to the four-day working week.\nSchools are set to reopen on January 10 for the second term of the 2021/2022 academic session.\nThe Kaduna government, on December 1, 2021, began its pre-announced transition to a four-day work week.\nLawal, in her recent notice, asked public schools in the state to adjust to the new system.\nAdvertisementShe advised members of the school security committee to ensure proper monitoring of security apparatus."
  },
  {
    "headline": "‘Is police now law court?’ — Tonto Dikeh faults Lagos CP’s comment on Oromoni case",
    "summarized_story": "Tonto Dikeh, the Nollywood actress, has kicked against the recent statements of Hakeem Odumosu, Lagos commissioner of police, on the Sylvester Oromoni case.\nAdvertisementOromoni, a student of Dowen College Lagos, died last November after he was allegedly attacked by five colleagues.\nThe first autopsy earlier had revealed that the deceased died of “acute lung injury due to chemical intoxication”.\nA Lagos magistrate court then granted bail to the five students charged with the alleged murder of the dead boy.\nReacting in a post via Instagram, Dikeh asked why the Lagos police played the role of a “law court” in the case."
  },
  {
    "headline": "Coroner’s inquest into Oromoni’s death to begin Jan 15",
    "summarized_story": "The coroner’s inquest into the death of Sylvester Oromoni, the late student of Dowen College in Lagos, will begin on January 15.\nOromoni’s father had claimed his child was beaten and fed a liquid chemical that eventually led to his death.\n4, Epe district, combined high court and magistrate court of Lagos State, Epe at 9:00am prompt; the hearing shall be in open court,” the letter read.\n“The depositions may be filed at any of the Magisterial Districts in Lagos State and served electronically on all parties concerned.\nA Lagos magistrate court had also granted bail to the five students charged with the alleged murder of Oromoni."
  },
  {
    "headline": "SCAM ALERT: Sale of 2022 UTME forms yet to begin, says JAMB",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) says it has not commenced the sale of the 2022 Unified Tertiary Matriculation Examinations (UTME) and Direct Entry (DE) forms as claimed.\nAdvertisementIn a statement on Thursday, Fabian Benjamin, the board’s spokesman, warned prospective applicants to disregard fraudsters claiming the forms are already out.\nBenjamin said while arrangements for the sale of the forms have been concluded, no date has been fixed of its sale.\n“Although the Board has concluded all arrangements to commence the sale of the 2022 UTME/DE Application Documents in due course it is yet to fix any date for its commencement.”AdvertisementBenjamin said the board would inform the public when the sale of the forms would commence in due course.\n“The Board wishes to inform the general public that they would be sufficiently informed of the commencement of the sale of EPINs once approval has been granted by relevant authorities,” it added."
  },
  {
    "headline": "Tiwa Savage: How I was almost attacked at Lagos beach",
    "summarized_story": "Tiwa Savage, the Nigerian singer, has recounted how she was almost attacked when she visited a beach in Lagos without her security details.\nThe ‘Koroba’ singer also shared clips from her recent visit to the beach in which some fans and fun-seekers were seen cheering her in excitement.\n“Omo I do mistake go beach without security, and small cash.\nThe 41-year-old singer also reflected on the usual boisterous scenes in Lagos at night in recent times, adding that it is now “expensive to go out.”Advertisement“Nothing like a calm night in Lagos this days.\nTiwa has established herself as a prominent figure in the global music landscape with numerous hit projects and collaborations."
  },
  {
    "headline": "On the making of King of Boys, Netflix’s first original Nigerian series",
    "summarized_story": "KOB 2 was well received by movie lovers as it topped Netflix’s top-ten movie charts for many weeks.\nMA: Interestingly, as at the time we started shooting KOB 2, I don’t think it was confirmed as a Netflix original.\nDA: Considering that this was Netflix’s first Nigerian original series, how much technical support did Netflix bring in?\nDA: What was the difference between shooting a regular movie and a 7-part series?\nMA: Another thing that’s noteworthy is that, when we finished shooting King of Boys, nobody knew we had shot a series."
  },
  {
    "headline": "Cameroon risks stunting mobile money growth with new transaction levy",
    "summarized_story": "Among Cameroonians, new year celebrations have so far coincided with pushback against a new tax on mobile money transactions introduced by the Paul Biya administration.\n#WeSayNo.”The new mobile money tax will especially hit the poorest, unbanked segments of Cameroon society.\nA later study also points out that many mobile money users belong to “marginalised societal groups” hence the negative impact on financial inclusion and broader development goals of mobile money taxes is significant.\nSimilarly, a 1% tax on mobile money transactions in Uganda was cut in half after protests.\nUnlike Ghana’s case, however, citizens were barely informed of the details before Cameroon’s government implemented the new mobile money tax in November, according to local media reports."
  },
  {
    "headline": "How mobile phones and digital tools have helped Togo tackle COVID-19",
    "summarized_story": "Globally, the COVID-19 disease has infected more than 290 million people, claimed well over 5 million lives, and plunged millions into extreme poverty.\nMore than 1.6 million Togolese registered for the monetary support through their mobile phones, according to data on the Novissi website.\n“People should not have to choose between death by COVID-19 or by hunger,” President Faure Gnassingbe said on the Novissi programme.\nIn a month, more than 50,000 people registered for COVID-19 vaccination through Togo’s digital platforms.\nAuthorities launched a mobile and web-based service that allows Togolese to register for vaccination using their phones."
  },
  {
    "headline": "Here’s why startup funding in the Maghreb ecosystem is low",
    "summarized_story": "But when you break these numbers down into deals and compare them to Egypt’s over $600 million funding in 2021, the conversation on how disturbingly small the funding is comes up.\nWhat’s the problem of the Maghreb region, and how can the ecosystem rise to its full potential?\nIntra-regional conflictThe Maghreb countries don’t see eye-to-eye; they are archenemies or, as they are popularly called, “enemy brothers”.\nIn Nigeria, for instance, big conventional banks back fintech startups, and FMCGs invest in e-commerce and logistic upstarts.\nLanguage barrierThe Maghreb region speaks French and that makes it a francophone region."
  },
  {
    "headline": "Edo’s Ossiomo Power, FG conclude power supply agreement – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… as firm lauds Obaseki on reforms to liberalize state’s electricity sectorThe Edo State Government’s Public Private Partnership (PPP) initiative, Ossiomo Power, has concluded an agreement with the Benin Owena River Basin Authority for the supply of electricity to the authority’s facilities.\nManaging Director, Ossiomo Power, Dr. Uwa Igiehon, who disclosed this in a chat with journalists, said the development is another milestone for the government-backed power initiative.\nAccording to him, “The Benin Owena River Basin Authority, which is a Federal Government agency, had been cut off from the National Grid for nearly four years.\nThe Benin Owena River Basin Authority is located in the same area so we reached an agreement to connect them to our plant.”He noted that the power supply agreement will provide power to the facilities at the Federal Government-owned institution to enable it live up to its mandate.\nHe expressed appreciation to the Edo State Governor, Mr. Godwin Obaseki, who instituted proactive policies in the electricity sector in the state to facilitate the company’s investment in power generation."
  },
  {
    "headline": "Edo govt announces school’s resumption, insists on close of Idogbo secondary school – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has announced Monday 10th January 2022 as the resumption date for all primary and secondary schools in the state.\nIn a statement, Permanent Secretary, Edo State Ministry of Education, Mrs. Stella-Maris Imasuen, said parents/guardians are to ensure that all relevant learning materials are provided for their children/wards.\nShe however noted that Idogbo secondary school remains closed till further notice.\nImasuen stated, “This is to inform principals, Primary School Heads, Proprietors of private schools, Parents/Guardians and the general public that all schools: primary and secondary (public and private) in Edo State resume for the second term of 2021/2022 on Monday 10th January 2022.\n“However, Idogbo secondary school, Idogbo remains closed till further notice.”“Parents/Guardians are to ensure that their children/wards have relevant learning materials necessary for learning before coming to school,” she charged."
  },
  {
    "headline": "Edo Central Hospital Repositioned for Quality Service Delivery – Commissioner – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State government has said that the Central Hospital on Sapele Road, Benin City, adjacent to Edo Specialist Hospital was being repositioned for quality service delivery.\n“We have had to take a decision that that infrastructure is not good enough for Edo people.\n“So, what we have done is, some of the staff who use to work in that structure have been moved into Edo Specialist Hospital to take care of the surge in attendance, which is already happening.\nHer reaction was in apparent response to speculation that the hospital was being relocated to the Stella Obasanjo Hospital.\nAccording to her, “The decision to operate health care provision for our citizens meant that there has to be a lateral movement of services from Central Hospital to Edo Specialist Hospital."
  },
  {
    "headline": "Wike has set Rivers on the threshold of development – Nsirim …Urges journalists to be part of NEW vision history – Nigerian Observer",
    "summarized_story": "Wike has set Rivers on the threshold of development – Nsirim …Urges journalists to be part of NEW vision historyShare FacebookTwitterStumbleuponLinkedInPinterestRivers State Governor, Nyesom Ezenwo Wike has set the State on the threshold of a development agenda that catalyses progress in all facets of life, the State Information and Communications Commissioner, Pastor Paulinus Nsirim has said.\nThe Commissioner was speaking at a dinner he held for members of the Nigerian Union of Journalists, Rivers State Council, at the Ernest Ikoli Press Centre, Port Harcourt.\n“Governor Wike stands tall among Governors in the country.\nNsirim urged journalists in the State to strive to make inputs that would speak for them as people who also contributed to the development of Rivers State during the administration of Governor Wike.\nHe expressed the commitment of members of the Association to the realisation of the development agenda of the State Government under Governor Wike."
  },
  {
    "headline": "SEC to Launch Revised Master Plan",
    "summarized_story": "The Securities and Exchange Commission (SEC) is to organize a capital market conference to launch a revised version of the 10-year Capital Market Masterplan in 2022 to reflect the dynamism of the market and developments in FinTech, among others.\nDirector General of the SEC, Mr. Lamido Yuguda stated this in Abuja Weekend in a New Year Message.\nThe SEC DG stated that as the Year 2022 commences, the Commission is confident that the results of the various initiatives implemented will begin to gradually manifest, spurring developments in many aspects of the market.\nAccording to Yuguda, “As we expect improvements in both economic and capital market activities, we must remain committed to developing the market in line with the 10-year Master Plan.\n“We also plan to provide extra support to the registered commodities trading platforms to complement government’s renewed diversification efforts in agriculture and carry out workshops to deepen the Commodities Trading Ecosystem.”Facebook Notice for EU!"
  },
  {
    "headline": "2023: Dave Umahi and his politics of pettiness",
    "summarized_story": "Umahi, today, has a big stomach, and already sees himself as a very big man.\nBack in the day when we were kids, a big man was a man who had a very big tummy.\nNo doubt, a governor is as big as it gets, and of course, big men often have big ego, especially those who stumbled on wealth.\nSo, when this did not happen, Umahi declared war on everyone, including former senate president, Anyim Pius Anyim.\nUmahi imagines that he must have everything his way, and that everyone must queue behind him and defer to him or he raises hell."
  },
  {
    "headline": "Buhari appoints Ayodeji Gbeleyi Federal Mortgage Bank Chairman",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has appointed Ayodeji Gbeleyi as board chairman of the Federal Mortgage of Bank of Nigeria (FMBN), the apex mortgage finance institution in the country which regulates the activities of primary mortgage loan originators.\nThe appointment was announced on Friday in a statement issued by Femi Adesina, special adviser to the president on media and publicity.\n“President Muhammadu Buhari has approved the appointment of Mr Ayodeji Ariyo Gbeleyi as the Chairman of the Board of Directors of the Federal Mortgage of Bank of Nigeria (FMBN),” the statement said.\n“He replaces Chief Adewale Adesoji Adeeyo who passed on recently.”Gbeleyi was a former commissioner for finance in Lagos during the tenure of Babatunde Fashola.\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Ugwuanyi summons security meeting as bandits kill traders in Enugu community",
    "summarized_story": "The Enugu State governor, Hon.\nIfeanyi Ugwuanyi, has summoned an “emergency security meeting” with stakeholders following the killing traders by bandits in Eha-Amufu community, Isi-Uzo LGA of the state on Thursday.\nSteve Oruruo, media aide to the governor who disclosed this in a statement, said the meeting will take place on Saturday at the Enugu government house.\nThose expected at the meeting are the chairman of the Isi-Uzo LG council, heads of security agencies, traditional rulers of autonomous communities in Eha-Amufu, presidents-general of autonomous communities in Eha-Amufu, youth leaders, clerics, and heads of vigilante groups in the area.\nThe bandits had unleashed attack on the community killing at least two people, while several properties were razedThe Enugu police command which confirmed the incident on Friday in a statement by Daniel Ndukwe, its spokesperson, said information gathered during an assessment tour of the community revealed that the traders were attacked at Orie market in Ogbete-Mgbuji village on Thursday."
  },
  {
    "headline": "USA Women Group Honours Onuoha-Obilor As 2021 Industry Leader",
    "summarized_story": "The award is powered by the Industry Era Women Leaders and IEra Women Leaders Magazine based in New York.\nThe organisation highlights leading visionary women leaders who change industries by leading and implementing state-of-the-art business solutions to accelerate growth, making their companies the world’s most valuable brands.\nAs vice president of Clinical Quality and Medical Policy, she is responsible for the Health Plan’s Clinical Quality and Medical Policy.\nShe is in charge of creating and implementing a hybrid clinical quality strategy that includes both structural and virtual integration models.\nThroughout the pandemic, Highmark Health has worked with many partners on several vaccination events serving minority and vulnerable populations across Pennsylvania."
  },
  {
    "headline": "NDLEA Nabs Grandpa, Others For Dealing In Illicit Drugs",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), has arrested a 76-year-old grandfather, Osagie Robert, in Edo State for dealing in Cannabis.\nThe septuagenarian, Robert, popularly called old soldier, was arrested on Friday, January 7, 2022 in Egor, Oredo area of the state.\nEdwin Agbon, was also arrested for importing drug chocolates and cookies from Canada into Nigeria to sell.\nThe consignment, which emanated from Canada, contained Colorado brand of Cannabis concealed inside chocolates and cookies weighing 6.491kilograms, while the drug cookies and chocolates weighed 5.566kg and 0.383kg respectively.\nShe traveled from Abuja to sell the drug in Benue State."
  },
  {
    "headline": "NDLEA Nabs Grandpa, Others For Dealing In Illicit Drugs",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), has arrested a 76-year-old grandfather, Osagie Robert, in Edo State for dealing in Cannabis.\nThe septuagenarian, Robert, popularly called old soldier, was arrested on Friday, January 7, 2022 in Egor, Oredo area of the state.\nEdwin Agbon, was also arrested for importing drug chocolates and cookies from Canada into Nigeria to sell.\nThe consignment, which emanated from Canada, contained Colorado brand of Cannabis concealed inside chocolates and cookies weighing 6.491kilograms, while the drug cookies and chocolates weighed 5.566kg and 0.383kg respectively.\nShe traveled from Abuja to sell the drug in Benue State."
  },
  {
    "headline": "Buhari To Visit Ogun For Project Inaugurations Thursday",
    "summarized_story": "Barring last-minute change of plan, President Muhammadu Buhari will on Thursday, January 13, 2022 visit Ogun State to commission some landmark infrastructure projects executed by Governor Dapo Abiodun.\nA statement issued on Sunday in Abeokuta, the state capital and signed by the chief press secretary to the governor, ‘Kunle Somorin, indicated that the Gateway City Gate Monument Park located at Sagamu Interchange, along the Lagos-Ibadan Expressway is scheduled to be the first project to be inaugurated by President Buhari during his visit to the state.\nLEADERSHIP recall that the president had cancelled the visit earlier scheduled for December 21, 2021 due to some other official engagements which took him out of the country.\nADVERTISEMENTOther infrastructural projects expected to be commissioned by President Buhari also include two housing estates: the 527-unit low and medium Kobape Housing Scheme as well as the highbrow 83 duplexes located at Kings Court Estate in Oke Mosan axis of Abeokuta metropolis, the state capital.\nSomorin, therefore, enjoined all invited guests to be in full compliance with the COVID-19 safety protocols, while awaiting the arrival of the president for the events."
  },
  {
    "headline": "Buhari To Visit Ogun For Project Inaugurations Thursday",
    "summarized_story": "Barring last-minute change of plan, President Muhammadu Buhari will on Thursday, January 13, 2022 visit Ogun State to commission some landmark infrastructure projects executed by Governor Dapo Abiodun.\nA statement issued on Sunday in Abeokuta, the state capital and signed by the chief press secretary to the governor, ‘Kunle Somorin, indicated that the Gateway City Gate Monument Park located at Sagamu Interchange, along the Lagos-Ibadan Expressway is scheduled to be the first project to be inaugurated by President Buhari during his visit to the state.\nLEADERSHIP recall that the president had cancelled the visit earlier scheduled for December 21, 2021 due to some other official engagements which took him out of the country.\nADVERTISEMENTOther infrastructural projects expected to be commissioned by President Buhari also include two housing estates: the 527-unit low and medium Kobape Housing Scheme as well as the highbrow 83 duplexes located at Kings Court Estate in Oke Mosan axis of Abeokuta metropolis, the state capital.\nSomorin, therefore, enjoined all invited guests to be in full compliance with the COVID-19 safety protocols, while awaiting the arrival of the president for the events."
  },
  {
    "headline": "UI 500-level medicine dropout: I removed my second testicle to kill sexual urge",
    "summarized_story": "Forty-four-year-old Terhemen Anongo, who dropped out of the University of Ibadan as a 500-level medical student, says he has castrated his second testicle.\nThe PUNCH had in March 2021 reported the story of Anongo, who became a cart pusher after dropping out of school and removed one of his testicles.\nOn why he removed the testicle, he had said, “You know how the issue of sexual urge torments one when you don’t have a wife, coupled with your religious beliefs.\nHe said, “Yes, I went to remove the second testicle based on religious belief.\nThe first one had little hitches but this one, having learnt from that experience, I did (remove) it very well."
  },
  {
    "headline": "UI 500-level medicine dropout: I removed my second testicle to kill sexual urge",
    "summarized_story": "Forty-four-year-old Terhemen Anongo, who dropped out of the University of Ibadan as a 500-level medical student, says he has castrated his second testicle.\nThe PUNCH had in March 2021 reported the story of Anongo, who became a cart pusher after dropping out of school and removed one of his testicles.\nOn why he removed the testicle, he had said, “You know how the issue of sexual urge torments one when you don’t have a wife, coupled with your religious beliefs.\nHe said, “Yes, I went to remove the second testicle based on religious belief.\nThe first one had little hitches but this one, having learnt from that experience, I did (remove) it very well."
  },
  {
    "headline": "Crisis brews as police detain ‘abducted’ Ebonyi PDP Publicity Secretary",
    "summarized_story": "The Peoples Democratic Party (PDP) has raised the alarm over the detention of its Publicity Secretary in Ebonyi State, Chika Nwoba.\nHe explained that after the abduction, Mr Nworie notified the Officer in Charge of Anti-kidnapping, Ebonyi State Police Command of the incident.\nHe alleged that the perpetrators were never of the Ebubeagu Security outfit, Ebonyi State chapter.\n“We call on the Attorney-General of the Federation, National Security Adviser, IGP to take notice of what is happening in Ebonyi State.\nNobody is safe unless you are a member of APC.”He accused the Ebonyi State Police Command of detaining the victim for no just cause."
  },
  {
    "headline": "Crisis brews as police detain ‘abducted’ Ebonyi PDP Publicity Secretary",
    "summarized_story": "The Peoples Democratic Party (PDP) has raised the alarm over the detention of its Publicity Secretary in Ebonyi State, Chika Nwoba.\nHe explained that after the abduction, Mr Nworie notified the Officer in Charge of Anti-kidnapping, Ebonyi State Police Command of the incident.\nHe alleged that the perpetrators were never of the Ebubeagu Security outfit, Ebonyi State chapter.\n“We call on the Attorney-General of the Federation, National Security Adviser, IGP to take notice of what is happening in Ebonyi State.\nNobody is safe unless you are a member of APC.”He accused the Ebonyi State Police Command of detaining the victim for no just cause."
  },
  {
    "headline": "Updated: No arrest, Djokovic finally freed to play in Melbourne",
    "summarized_story": "Latest reports from Down Under said Novak Djokovic has finally gotten over the nightmare of his visa cancellation and freed to play tennis.\nDjokovic hours earlier successfully challenged the Australian Government’s decision to cancel his visa, paving the way for him to play in the Australian Open after five days of chaotic bureaucracy.\nBut Djokovic has not been arrested, according to government and tennis sources, and is finally being taken to his rented accommodation.\nImmigration minister Alex Hawke is, however, understood to be still considering whether to again cancel the player’s visa.\nHordes of fans, followed by police, were quick to arrive at Djokovic’s lawyer’s office building after the matter concluded in court."
  },
  {
    "headline": "How I got saved from sex tape claim by Tonto Dikeh",
    "summarized_story": "Janemena, an Instagram dancer and influencer with the real name Jane Orezimena, said having “small boobs” saved her from the sex tape scandal raised by Nollywood actress Tonto Dikeh.\nShe said: “When they brought fake tape and picture and said it was me, do you know what saved me from all explanations?\nThe real ones only.”Tonto Dikeh had in September 2021 claimed that her ex-lover, Joseph Egbri aka Prince Kpokpogri, had a sex tape of Janemena who is married.\nAs a result, Janemena sent a letter to Dikeh, demanding the sum of N500m for alleged libel and claiming on social media that Janemena has a sex tape.\nJanemena said she lost her one-month pregnancy due to Dikeh’s allegation and the trauma it caused."
  },
  {
    "headline": "MC Oluomo Is Not From Oshodi, Doesn’t Belong To Any Ruling House – Regent",
    "summarized_story": "The regent was reacting to claims that the union leader is seeking the obaship of Oshodi.\n“It is glaring that Akinsanya family is not from Oshodi land neither does he belong to any of the ruling houses in Oshodi.\nRoyal stool is not what you can wake up one morning and decide to buy with money, no.\n“I totally frown at it and I trust the Lagos State government will not want to impose Musiliu Akinsanya on the people of Oshodi land because he does not belong to any ruling house in Oshodi.\nI have searched our history; I couldn’t find any link of Akinsanya family to the Oshodi royal stool.”"
  },
  {
    "headline": "BREAKING: Suspected Herdsmen Attack Ishiagu Community, Kill 3",
    "summarized_story": "According to an unconfirmed allegation obtained by Vanguard, three residents of Ishiagu Community in the Ivo Local Government Area of the State were attacked and killed last Sunday by suspected herdsmen in the area.\nThe victims were slaughtered by suspected herders as they returned home from their farm that fateful day in the evening.\nDetails later…"
  },
  {
    "headline": "Kaduna Government Schools To Open Four Days A Week Over Banditry",
    "summarized_story": "Kaduna Government Schools To Open Four Days A Week Over BanditryTo allow employees to focus on agriculture, the Kaduna State Government has mandated that all public schools in the state begin functioning four days a week.\nThe Kaduna State government began the transition to a four-day working week on December 1.\nBandits kidnapped 121 kids from Bethel Baptist School in Maraban Damishi, Chikun Local Government Area, Kaduna, on July 5, 2021.\nIn 2021, at least 1200 students, predominantly from higher education institutions, were abducted in coordinated attacks on schools in mostly Northern states.\nGovernment Science College in Kagara, Niger; Government Girls Secondary School in Jangebe, Zamfara; Bethel Baptist High School; Federal College of Forestry Mechanisation; and Greenfield University, all in Kaduna State, were among the schools targeted."
  },
  {
    "headline": "Olubadan: Ex-Oyo Governor, Ladoja, Folarin, Others Grace 8-Day Prayer For Oba Adetunji",
    "summarized_story": "Senator Rasidi Adewolu Ladoja, a former governor of Oyo State, and other renowned sons and daughters of Ibadan descended to Mapo Hall in Ibadan on Sunday for the 8-day prayer for the immediate past Olubadan of Ibadan land, Oba Saliu Akanmu Adetunji.\nLadoja, the Osi Olubadan of Ibadan land, was among those present.\nHe hailed the late Olubadan as a God-fearing guy who ruled in peace during his lifetime.\n“Oba Adetunji was known for his consistency in promoting peaceful and harmonious co-existence, had respect for religions and diverse cultures in the State and the country as whole.\nHe did not allow anyone to torpedo the Ibadan hierarchical succession plan of ascending the throne,” he said."
  },
  {
    "headline": "Breaking: Court rules on detained Novak Djokovic ahead Australian Open",
    "summarized_story": "Novak Djokovic has won a court battle to stay in Australia to contest the Australian Open despite being unvaccinated against COVID-19, but the government has threatened to cancel his visa for a second time.\nJudge Anthony Kelly has quashed the visa cancellation, and ordered the Australian Government to pay legal costs and release Djokovic from detention within half an hour as he delivered his verdict at 6.16am GMT.\nGovernment counsel Christopher Tran notified the court that the Minister for Immigration, Citizenship, Migrant Services and Multicultural Affairs – not the minister who made the original visa cancellation – will now consider whether to exercise a personal power of cancellation of Djokovic’s visa.\nEarlier in the day, Djokovic was removed from detention to be with his lawyers during the hearing, and Judge Kelly expressed agitation over the rejection of Djokovic’s medical exemption.\nDjokovic’s lawyers presented their arguments to the court, but government lawyer Mr Tran only spoke for half an hour before a lengthy adjournment."
  },
  {
    "headline": "Why we exonerated Dowen College students, others – DPP",
    "summarized_story": "The Lagos state Directorate of Public Prosecution (DPP) has explained further why the state exonerated five students and five officials of Dowen College, Lagos State, suspected to be linked to the death of a student, Sylvester Oromoni.\nThe first autopsy was conducted by the Oromoni family in Warri, Delta, and the second by the Lagos State Government, according to the source.\nThe result of the autopsy conducted in Warri revealed acute bacteria pneumonia, acute pyelonephritis, acute bacterial hepatitis, acute gastritis and cerebral oedema with raised intra-cranial pressure.\nThe seven pathologists included four pathologists, who each represented Dowen College and three of the accused students.\nThe result of the autopsy conducted in Lagos revealed marked pallor of organs, pneumonia (infection of the lungs), infection of the liver, kidney and heart."
  },
  {
    "headline": "Matawallen on Zamfara massacre: Political bandits, yellow journalism threatening my government",
    "summarized_story": "Zamfara state Governor Bello Mohammed (Matawallen Maradun) has said political bandits and yellow journalism were threatening to pull down his administration.\nArmed bandits reportedly killed at least 58 people in Zamfara state after raiding several villages Thursday.\nGovernor Matawallen commiserated with the two monarchs and their entire subjects over the unfortunate incident and promised to address the humanitarian crisis arising from the attacks.\n“We shall conquer all by the strength of the Almighty Allah,” Governor Matawallen assured.\nGovernor Matawallen also said the military would be stationed in the area to protect lives and property of the affected communities pending the return of normalcy."
  },
  {
    "headline": "JUST IN: Greece Donates About One Million COVID-19 Vaccine Doses To Nigeria",
    "summarized_story": "Greece has donated about one million doses of COVID-19 vaccine to Nigeria as the Federal Government moves to ensure more citizens are vaccinated against the disease.\nDendias made the announcement at a meeting with the Minister of Foreign Affairs, Geoffrey Onyeama, and other Nigerian government officials.\nHe said Nigeria and Greece have enjoyed a favourable bond over the years and that his country was even willing to expand the relationship.\nOnyeama, on his part, said Nigeria has enjoyed a smooth partnership with Greece in the area of defence.\nHe said the present administration was willing to expand its partnership with Greece, especially in the areas of agriculture and infrastructure."
  },
  {
    "headline": "NCDC Alerts States As Lassa Fever Death Toll Hits 102",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) said it has sent letters to states to alert the authorities on the disturbing trend of Lassa fever outbreak in the country.\n“In week 52, the number of new confirmed cases decreased from 29 in week 51, 2021 to 28 cases,” it stated.\nThe predominant age group affected, according to the NCDC, is 21-30 years while the male to female ratio for confirmed cases is 1 : 0.9.\n“The five Lassa fever molecular laboratories in the NCDC network are working full capacity to ensure that all samples are tested, and results provided within the shortest turnaround time,” the agency said.\nLassa fever is an acute viral illness and a viral haemorrhagic fever first reported in the Lassa community in Borno State when two missionary nurses died from an unusual febrile illness."
  },
  {
    "headline": "ECOWAS Countries To Shut Borders, Withdraw Ambassadors From Mali",
    "summarized_story": "The Economic Community of West African States (ECOWAS) will impose sanctions on the military junta in Mali, while member states will withdraw all their ambassadors as well as close land and air borders with the country.\nThis is part of the outcome of the Extraordinary Summit of the ECOWAS Authority of Heads of State and Government held on Sunday in Accra, Ghana.\nThe body also imposed additional sanctions on the junta, including the suspension of all commercial and financial transactions between ECOWAS states and Mali.\n“In the years gone by, the African Union, then known as OAU and ECOWAS, never came down heavily on Coups d’etats.\n“But there is evidence now that there is a very strong resolve that ECOWAS and, indeed, AU and the international community will not accept unconstitutional takeover of government.”"
  },
  {
    "headline": "Wike Declares 19 Persons Wanted For Operating Illegal Refineries In Rivers [Full List]",
    "summarized_story": "﻿Governor of Rivers State, Nyesom Wike, on Sunday declared 19 individuals wanted for operating illegal crude oil refining sites which are responsible for the black soot menace in Rivers State.\nThe governor identified some individuals who he termed the “kingpins of bunkering and illegal crude oil refining activities” and he declared them wanted.\nAlso declared wanted for oil bunkering activities in Isiokpo community were: “Mr.\nKemkom Azubike, Mr. Mezu Wabali, Mr. Chigozi Amadi, Mr. Opurum Owhondah, Mr. Bakasi Obodo ,Mr. Opus, Mr. Galaxi Mas, Mr. Chioma, Mr. Ogondah, Mr.\nGovernor Wike said his government has also identified those behind illegal bunkering activities in Okrika communities, Port Harcourt Township, Rivers South-East and Rivers South-West Senatorial Districts, adding that their names would be soon published and declared wanted, if they fail to voluntarily report to the Police."
  },
  {
    "headline": "Serbia Hails Djokovic’s Australia Court Victory",
    "summarized_story": "Serbians applauded Novak Djokovic’s win Monday over the Australian government, overturning the cancellation of his visa on Covid-19 and thus ending his detention by authorities.\nThe tabloid Vecernje novosti announced Djokovic “beat Australia”, while warning that “nothing is over”.\nOthers remained anxious that Australian authorities would make one last effort to expel Djokovic ahead of the Australian Open.\nREAD ALSO: Djokovic Wins Australia Visa Case, Judge Orders His Release“If they deport him, despite the court’s decision, it will be a scandal beyond measure,” said Bozidar Popovic, a 34-year-old economist in Belgrade.\nAccording to documents released by Australian authorities, Djokovic tested positive on the evening of December 16."
  },
  {
    "headline": "Faleke advocates strengthening of traditional institutions for peace -",
    "summarized_story": "He made this known at an event where he was installed a chieftain in the Ikeja area of Lagos."
  },
  {
    "headline": "PDP Shifts Screening of Osun Governorship Aspirants to January 12 -",
    "summarized_story": "The Peoples Democratic Party (PDP) has shifted the screening of aspirants for the Osun State Governorship election primary from the earlier scheduled date of Tuesday, January 11, 2022 to a new date of Wednesday, January 12, 2022.\nNevertheless, the venue for the screening exercise remains PDP National Secretariat, Abuja at 10am prompt.\nThe PDP regrets any inconveniences the change in date may have caused.\nAll aspirants, leaders, critical stakeholders and members of our party in Osun state should take note and by this, guided accordingly."
  },
  {
    "headline": "Aggrieved APC members ask court to stop national convention -",
    "summarized_story": "Some aggrieved members of the All Progressives Congress have made fresh moves to stop the national convention from holding next month.The plaintiffs are seeking an order of the Federal High Court in Abuja to restrain the Gov.\nBuni-led Caretaker- and Extraordinary Convention Planning Committee from going ahead with the convention on the grounds that state congresses are yet to be completed in all the 36 states of the federation.\nJoined as defendants in the suit are the APC, the Chairman of the APC Caretaker/Extraordinary Convention Planning Committee and the Independent National Electoral Commission.\nNo date has been fixed for a hearing of the case."
  },
  {
    "headline": "National Convention: APC Govs set to meet President Buhari",
    "summarized_story": "Governors of the All Progressives Congress will on Sunday with President Muhamadu Buhari on Sunday to decide on a date for the party’s National Convention.\nPlateau State Governor and Chairman of the Northern Governors Forum Simon Lalong made this known after a meeting with the President on Friday.\nHe said President Buhari assured that nothing would stop the APC from conducting the convention in February, hence the resolve by the governors to harmonise all interests and pending litigations.\nThe President had raised fears that a failure by the APC to hold a National Convention expeditiously would negatively impact on its chances of success in coming electionsBut Governor Lalong assures that since the President remains resolved that conventions must be held immediately, Governors would do their parts to make this work.\nMeanwhile the Chairman of the Caretaker and Convention Planning Committee of the APC Governor Mai Mala Buni Yobe state, was also at the Presidential Villa."
  },
  {
    "headline": "Nigeria: Rivers Governor Wike Declares Owners of 19 Illegal Crude Oil Refineries Wanted",
    "summarized_story": "Rivers State Governor, Mr. Nyesom Wike has declared 19 persons wanted for allegedly owning illegal crude oil refining sites in the state.\nThe governor recently declared war on all activities responsible for the environmental pollution (black soot) in the State.\nHe stated that following his 2022 New Year Message outlining measures to tackle the black soot menace, the State Taskforce on Illegal Street Trading raided some illegal crude oil refining sites in Port Harcourt and arrested a number of suspects.\n“Also declared wanted are the following persons who are alleged to be in charge of oil bunkering activities in Isiokpo community: Mr. Kemkom Azubike, Mr. Mezu Wabali, Mr. Chigozi Amadi, Mr. Opurum Owhondah, Mr. Bakasi Obodo ,Mr. Opus, Mr. Galaxi Mas, Mr. Chioma, Mr. Ogondah, Mr.\nWike frowned at the failure of the Rumuokurushe traditional leadership to honour the terms of their undertaking not to allow any form of street trading on the Rumuokurushe market."
  },
  {
    "headline": "Nigeria Senate Uncovers N14.7bn Proceeds of Defunct PHCN ‘Hidden’ in Commercial Banks",
    "summarized_story": "The Nigerian Senate has uncovered N14.7 billion proceeds of the defunct Power Holding Company of Nigeria (PHCN) allegedly hidden in commercial banks by Bureau of Public Enterprise (BPE).\nThe report alleged that the said sum was ‘hidden’ in commercial banks as at December 31, 2016, whereas the privatisation of PHCN was concluded in 2013.\nThe AuGF had in the report queried the BPE on the reported hidden account.\n“Whereas, the privatisation of Power Holding Company of Nigeria (PHCN) was concluded in 2013, the proceeds are yet to be remitted to Central Bank of Nigeria (CBN) Privatisation Proceeds Accounts.\n“Unauthorised funds kept in commercial banks may be diverted for other purposes, thereby leading to loss of revenue available for government programmes."
  },
  {
    "headline": "Oil Defies 2022 Surplus Forecast, Continues Bullish Run on Fading Virus Fears",
    "summarized_story": "Although still early in the year, oil prices has started off 2022 on a positive note, defying experts’ prediction of a ballooning surplus, instead surpassing $80 a barrel at the weekend.\nNigeria is pumping roughly 1.35 million barrels , the lowest figure in years.\nMorgan Stanley expects Brent to climb to $90 a barrel by the third quarter and estimates that observable stockpiles fell by about 690 million barrels last year.\nThe alliance sees an excess of 1.4 million barrels a day in the first quarter, 25 per cent less than its projection a month ago.\nIt anticipates a rebound of 4.2 million barrels a day in global consumption this year, and demand topping 100 million barrels a day by June."
  },
  {
    "headline": "Nigeria’s Stock Market Gains N1.33tn in First Trading Week",
    "summarized_story": "The Nigerian Exchange Limited (NGX) kicked off the first trading week of 2022 on a positive note as its market capitalisation gained N1.33 trillion.\nThis followed foreign investors’ and high net worth investors’ demand for Airtel Africa Plc, BUA Foods, Lafarge Africa Plc, and FBN Holdings Plc, which pushed market capitalisation to N23.628 trillion from the N22.296 trillion the stock market opened with trading on the first day.\nActivity levels were strong, as trading volume and value surged by 103.7per cent w/w and 246.8per cent w/w, respectively.\nThe Financial Services Industry followed with 537.959 million shares worth N4.627 billion in 8,015 deals.\nThe third place was The ICT Industry, with a turnover of 76.906 million shares worth N704.346 million in 933 deals."
  },
  {
    "headline": "Nigeria: Ex-VP Atiku Urges FG to Ramp Up Security After Over 200 Massacred in Zamfara",
    "summarized_story": "Over 500 fleeing bandits on motorcycles had reportedly attacked five villages and razed their homes, after killing over 200 of the people, recently.\nOver 200 persons were buried today (Saturday) due to the invasion by bandits.\n“We sympathise with the government and people of Zamfara State in this trying period and condole with the families of the dead.\nWe pray for the repose of their souls and that peace returns to the state and soon as possible,” she said.\n“Severally, without being prompted, you (Governor Zulum) come to our aide to support us (the army) even logistics wise."
  }
]