[
  {
    "headline": "Fuel tanker falls, spills content in Lagos",
    "summarized_story": "Danger has been averted after a tanker loaded with fuel fell and spilt its content in the Surulere Area of Lagos State on Saturday.\nThe tanker, a Mack Truck with registration number LAGOS 961 XJ, was laden with 33, 000 litres of Premium Motor Spirit when it fell at Stadium Bus Stop along Funsho Williams Avenue, Surulere.\nDivisional Police Officer, CSP Adebayo Adeoya immediately alerted the Lagos State Transport Management Authority, Lagos Emergency Management Agency, and firefighters.\nThe scene of the accident was then cordoned off by a police team which also provided protection to the firefighters and others.\nEffort is ongoing to evacuate the fallen tanker while the police are still maintaining their presence at the scene to protect lives and property and prevent hoodlums from scooping the fuel."
  },
  {
    "headline": "Otedola yet to notify us of acquisition – First Bank",
    "summarized_story": "The holding company of First Bank of Nigeria, FBN Holdings Plc, has said it has not received any notification of acquisition from the former CEO of Forte Oil, Femi Otedola.\nThe reports circulating would indicate that Otedola would be the majority shareholder, which would also give him the highest voting points.\nSince FBN stocks are traded publicly, a notification of the businessman’s acquisition, which is reportedly about N30 billion, would have been reported to the Company Registrars.\n“The Company is yet to receive any notification from the individual mentioned in the media report, of such acquisitions.\n“FBN Holdings Plc will always notify the appropriate agencies and authorities whenever it receives any notice of significant shareholding by the Shareholders and the Company’s Registrars,” the statement added."
  },
  {
    "headline": "Buhari wants peace, unity in Nigeria, says Adesina",
    "summarized_story": "The Special Adviser to the President on Media and Publicity, Femi Adesina, has said the President, Major General Muhammadu Buhari (retd.\n), desires to see peace and unity reign in all parts of the country.\nPresident is actuated by nothing else than peace and unity of the country, many times he has said that those of them that fought for the unity of Nigeria will not sit down with their eyes open and see the country dismembered in their presence.\n“What Mr. President wants is peace, unity and whatever it takes for Nigeria to have peace, she will have it.\nI remembered I did a piece recently where I said for Nigeria, it is ‘Peace Dole’ (Peace by Force)."
  },
  {
    "headline": "Assailants abduct 2 kids inside mother’s car in Akure",
    "summarized_story": "File photoPolice in Ondo State on Saturday confirmed the abduction of two little girls of nursery and kindergarten classes and the stealing of their mother’s car in Akure.\nDSP Funmilayo Odunlami, Police Public Relations Officer in Ondo State told the News Agency of Nigeria (NAN) that the abduction took place on Friday night.\nShe said upon their return from an outing at about 8 p.m., the mother parked the car in front of her house and went out to open the gates leaving the two kids in the vehicle.\n“Another car with three occupants suddenly drove up to her; some of the occupants collected her car keys and drove her car away with the kids inside.\n“The anti-kidnapping section of the police is already on the trail of the assailants to rescue the two kids and recover the car,’’ DSP Odunlami said."
  },
  {
    "headline": "Terror War: NAF Aircraft strikes at 20 boats carrying Boko Haram terrorists in Lake Chad, neutralizes scores",
    "summarized_story": "It said, “On receiving credible Intelligence on 20 October 2021 that about 20 boats with suspected Boko Haram /ISWAP terrorists were converging for a meeting on an Island in the Tumbuns on the Lake Chad and at Malam Fatori, 3 NAF aircraft under Operation Hadin Kai were scrambled to carry out strikes on the targets.\n“Reaching overhead the targets, the pilots observed a gathering of about 20 boats consisting of 5-7 suspected terrorists in each boat.\n“Using a mix of bombs and rockets, the 3 aircraft carried out series of strikes and scored devastating hits on the targets leaving some survivors scrambling for their lives.\n“The operation by the air component of Operation Hadin Kai yet again confirms the high concentration of terrorist and insurgent elements hibernating in the Lake Chad general area.\n“Working alongside the Army and Naval components as well as other security agencies under Operation Hadin KaiI, the Air Component will continue to sustain its operation until the area is rid of all terrorists and insurgents.”"
  },
  {
    "headline": "Story of Prophet Muhammad (s.a.w) (2)",
    "summarized_story": "When Khuza‘a, a tribe, saw Bani An-Najjar’s support to ‘Abdul-Muttalib they said: “He is our son as he is yours.\nNews of the Elephant Event reached the most distant corners of the then civilized world.\n‘Abdullah: The father of Prophet Muhammad (Peace be upon him).\nHis mother was Fatimah, daughter of ‘Amr bin ‘A’idh bin ‘Imran bin Makhzum bin Yaqdha bin Murra.\nShe had suckled Hamzah bin ‘Abdul-Muttalib before and later Abu Salamah bin ‘Abd Al-Asad Al-Makhzumi."
  },
  {
    "headline": "NCDC announces five additional COVID-19 deaths, 176 new infections",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC), has registered five more COVID-19 deaths and additional 176 new infections in 11 states and the FCT.\nLagos State, the epicentre of the infection recorded 15 cases, while Bauchi State in the Northeast recorded nine cases.\nBayelsa, Niger and Sokoto states recorded a single case each also.\nThe NCDC added that the country’s active cases stood at 9,164 as at Oct. 22.\nThe agency stated also that more than three million samples had been tested out of the nation’s estimated 200 million population."
  },
  {
    "headline": "Attack on rail track confirm bandits terrorists — CAN",
    "summarized_story": "By Ibrahim Hassan – KadunaThe Christian Association of Nigeria (CAN) has said that the attack by bandits on rail track was a terrorists act and bandits should be labelled so.\nCAN said the attack on the rail track which has led to the suspension of train services from Abuja to Kaduna ,was another additional cause for concern by the people of Kaduna state and those coming to do business in the state.\nRev.John Joseph Hayab, Vice President of CAN( 19 Northern States and FCT) and Chairman of the Kaduna State chapter, said in a statement titled ‘Attack on Kaduna -Abuja Rail Track, A Final Onslaught by Bandits’,that the Kaduna bandits had become very strong and daring to our government and security agents.\n“Thank God Governor El-Rufai himself has called on the federal government to declare bandits as terrorists so that our security forces can kill them further shows that the era of denials and playing politics with insecurity is coming to an end.”“Unless we maintain a firm position against those tormenting our citizens these bandits will not allow us to see peace.”According to him, “now that the bandits are destroying rail lines, what else have they not done to confirm they are terrorists and enemies of the state?”“Our Government should act decisively now before it will be too late,” he said.\nVanguard News Nigeria"
  },
  {
    "headline": "How I plan to have children – Charlyboy’s lesbian daughter, Dewy",
    "summarized_story": "Charly Boy’s daughter, Dewy Oputa has revealed plans to adopt a child when she marries her lover.\nDewy, who opened up on her sexuality in 2020, and announced that she was gay, said would adopt a child or consider fostering.\nAccording to her, she is indifferent about birthing a child.\n“I am not yet married but I have met my partner’s family and she has met mine.\nRecall that Charlyboy had apologized to his daughter because he realized he was encroaching on her life after after she accused him of neglect."
  },
  {
    "headline": "ISIEC summons stakeholders’ meeting over Imo LG Election",
    "summarized_story": "Imo State Independent Electoral Commission (ISIEC) has organized a stakeholders’ meeting to fashion out ways to make the upcoming council election in the 27 council areas and the 305 INEC wards in the State more credible and transparent.\nThe body charged with the statutory responsibility of electoral management and administration assured Imolites to expect nothing less than a credible council election come March, 2022.\nSpeaking at ISIEC office in Owerri on Friday after the meeting with political parties in the State, the Acting Operational Commissioner for Imo State Independent Electoral Commission, Adimelechi Henry, said the electoral umpire was 100% prepared for the election.\nIwuala said “it is unconstitutional for the Imo State Government to operate the third tier of government with caretaker or sole administrators.\nOgbuehi warned that the reoccurring issue of “the party in power takes it all syndrome” during local government elections should not be the order of the day in the upcoming council election in Imo State."
  },
  {
    "headline": "Atiku reveals his father was jailed",
    "summarized_story": "Former presidential candidate of the Peoples Democratic Party, PDP, Atiku Abubakar, has revealed that his father was jailed for failing to send him to school while he was growing up as a teenager.\nAtiku stated this while delivering a speech at the Baze University Graduation ceremony in Abuja on Friday.\nThe former Vice President also said that his father later embraced the idea of education and despite his humble background, he enjoyed quality education for free.\nAtiku, in his speech titled, ‘Solving Nigeria’s Education Challenges’, said, “I was a schoolboy and a herdsboy, and I fed my family.\n“Initially, my father did not buy the idea of me going to school, for which he had to go to jail."
  },
  {
    "headline": "Police arrest two robbers disguising as security agents in Katsina",
    "summarized_story": "The Katsina State Police Command has succeeded in arresting two armed robbers camouflaging as officers of the Nigerian Army and Police Force to rob unsuspecting members of the public of their valuables.\nThe two suspects identified as Yahaya Armaya’u 35, (alias KOFUR) and Bashir Isiyaku 32, (alias SOJA) both from Yar-Kaware village, in Kafur LGA of Katsina State, were paraded before pressmen on Friday at the State police command.\nPosing as military and police officers, respectively, the suspects intimidated him with handcuff and eventually robbed him of his Boxer motorcycle worth over two hundred thousand naira (N200,000).\nSimilarly, using the same strategy, the suspects attacked and robbed one Usman Sani of Yari-Bori village, of his motorcycle.\nThe police recovered the following exhibits from the suspects: handcuff, a police face cap, one army Camouflage T-shirt, a pair of canvas and two black Jeans trousers."
  },
  {
    "headline": "Police apprehend 19 suspects in Bauchi",
    "summarized_story": "The Bauchi State Police Command has apprehended about 19 suspects for various criminal offences, including homicide, kidnapping and armed robbery.\nHe further explained that they (suspects) also stormed the house of one Ibrahim Dai and kidnapped his son, one Idi Jibrin, to an unknown destination where they demanded N1.5m as ransom.\nThe statement said that the lady was reportedly found in a pool of blood at Sabon Kaura, a suburb of Bauchi metropolis, and was rushed to the Abubakar Tafawa Balewa University Teaching Hospital where she was confirmed dead.\nThe statement explained that the team evacuated the victim to the Abubakar Tafawa Balewa Teaching Hospital Bauchi, where a medical doctor certified her dead.\nHe said the suspect confessed to the crime in the course of investigation."
  },
  {
    "headline": "Genetically modified TELA Maize safe, environment-friendly — FG",
    "summarized_story": "The Federal Government has clarified that TELA Maize, a new maize variety genetically modified to tolerate moderate drought and resist the fall armyworm and stem borer, is safe for cultivation and environment-friendly.\nThe Nation reports the agency had granted the environmental approval for evaluation and open cultivation of the Maize.\nEbegba explained that the TELA maize has the potential to transform Nigeria’s farming communities with higher yields, better grain quality and higher farm income.\n- Advertisement -He said: “There is an application for genetically modified maize, it has some genes.\n- Advertisement -“On whether America has rejected the maize, I don’t think I have any record of that."
  },
  {
    "headline": "Three Kogi suspected kidnappers in police net",
    "summarized_story": "The Kogi State Police Command on Saturday said it arrested three suspected kidnappers behind the series of criminality along the Itobe-Ajaokuta axis.\nKogi Police Public Relations Officer (PPRO), Mr. William Ayah, a Deputy Superintendent of Police (DSP), in a statement explained that arms and ammunition, a Point of Service (POS) machine and assorted charms were recovered from the suspects.\n“The suspects were arrested by the police team following intelligence led operations to contain the activities of criminal elements in the area.\nThe suspects confessed to belonging to a gang responsible for terrorizing road users along Itobe-Anyigba highway.\n“During preliminary investigation, one of the suspects gave useful information that led to arrest of another suspect named Adejoh Tijani of the same address on 22/10/2021 at about 8:30 am."
  },
  {
    "headline": "Secondus moves to stop PDP national convention with fresh suit",
    "summarized_story": "By ‘Dare Odufowokan, Assistant Editor and Gbade Ogunwale, AbujaSuspended National Chairman of the Peoples Democratic Party (PDP), Prince Uche Secondus, has moved against the party’s national convention slated for October 30 and 31, 2021.\nAccording to Secondus, the PDP cannot go ahead with its plans to hold the convention with his appeal against his suspension yet to be determined.\nJoined in the suit are the PDP Acting National Chairman, the Chairman, PDP National Convention Committee, the PDP National Organising Secretary, the PDP National Legal Adviser and the PDP National Secretary.\nThe media team of the PDP chairman had earlier revealed that he is under pressure to move agitation the party and stop the convention.\nWhat is important at this stage, which I will solicit the support of PDP members and the generality of Nigerians, is please support us to have a successful national convention."
  },
  {
    "headline": "Govt links Igboho to Boko Haram sponsor; Kanu to #EndSARS protests",
    "summarized_story": "Addressing a press conference in Abuja, Malami said the Presidential Ad-hoc Committee set up after the re-arrest of the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu, had been able to identify Igboho’s sponsors and financiers.\nHe said: “The Federal Government has received the report on financiers of Adeniyi Sunday Adeyemo a.k.a Sunday Igboho.\nMalami claimed that Kanu took advantage of the 2020 EndSARS protest to destroy property and killed individuals, particularly security personnel.\n“Despite the proscription of IPOB by the Federal Government, Nnamdi Kanu continued the subversive campaign, instigating and inciting broadcasts to direct members of the IPOB to launch attacks on government.\n“The EndSARS protests of October 2020 played into the sinister plans of Nnamdi Kanu, whereby he seized the protests through subversive and inciting online broadcasts and actively commanded and directed attacks on security personnel and facilities."
  },
  {
    "headline": "Igboho working with Boko Haram sponsors -FG",
    "summarized_story": "“We call on these countries to desist from aiding subversive acts by Kanu and IPOB against the state of Nigeria and its people.\nThe AGF also the Federal Government has received the report on the financers of Adeniyi Sunday Adeyemo (a.k.a Sunday Igboho).\nThe report revealed that Sunday Igboho is a Director and signatory to Adesun International Concept Limited registered on 23rd April, 2010.\nInvestigation reveals that Adesun International Concept Ltd (belonging to Igboho) transferred the sum of N12, 750,000 to Abbal Bako & Sons.\nChief Sunday Adeyemo a.k.a Igboho Oosa was not into Oodua Nation until last year."
  },
  {
    "headline": "Night of glitz and glamour as The Sun celebrates distinguished Nigerians",
    "summarized_story": "The ceremony, which has unarguably become the biggest media event in Africa, honoured 24 outstanding Nigerians, for remarkably distinguishing themselves in their various fields of endeavours.\nThe paraphernalia of some state governments were literally moved to the award venue, underscoring the importance of Africa’s biggest media event.\nIt was indeed a night of glitz, glamour and honour.\nThe award went to two individuals, who were singled out for their philanthropy and large-heartedness in reaching out to the needy and downtrodden.\nThe Sun Lifetime Achievement Award went to four distinguished and respected Nigerians."
  },
  {
    "headline": "EndSARS: One year after fire and fury: What we lost and continue to lose – Victims",
    "summarized_story": "Jude Chukwuemeka Idimogu, Chairman of Lagos State House of Assembly, Wealth Creation Committee, it will take years for the state and its people to recover from their losses.\n“It was like a watershed in the history of Lagos State,” he confessed.\nWhen I remember it, I feel for the victims.”One of those victims is Andy Uche, a phone accessories retailer at Mushin.\nIt lost it to the wild orgies of arson and destruction that followed the killings at Lekki Tollgate.\nPrimero Transport Services Ltd (PRT), owners of BRT buses lost over N100 million in six days due to the #EndSARS protests."
  },
  {
    "headline": "Ekiti : Gunmen abduct 3, shoot 2",
    "summarized_story": "From Priscilla Ediare, Ado-EkitiGunmen on Friday engaged soldiers in a gun battle in Ayebode, Ikole Local Government Area of Ekiti State following the abduction of three passengers.\n“It was sporadic shootings between Ayebode-Ilasa as the soldiers engaged the kidnappers.\nThe soldiers acted gallantly, but the kidnappers escaped through a secondary school in Ilasa into the bush.\nWhen contacted, the Police Public Relations Officer, Ekiti Command, ASP Sunday Abutu, confirmed the incident, saying four persons were abducted during the operation.\nAbutu stated that the combined forces of the military men and the police rescued six men from the gunmen."
  },
  {
    "headline": "Igbo leaders in fresh moves to free Kanu",
    "summarized_story": "The IPOB leader is facing trial for treasonable and seditious charges.\nSaturday Sun gathered reliably that South East Governors had advised the Federal Government that the release of Kanu was key to the de-escalation of tension in the region.\nIt was also gathered that several Igbo leaders have continued to push for political solution to the issue.\nOhanaeze, the apex Igbo sociocultural organization, said Kanu’s appearance in court on Thursday was some form of big win.\nNational Publicity Secretary of the group, Chief Alex Ogbonnia said it was one step forward in Ohanaeze’s determined moves towards ensuring that the IPOB leader was set free in no distant time."
  },
  {
    "headline": "FG: Nnamdi Kanu Liable for Murder of Akunyili’s Husband, Gulak, 175 Others",
    "summarized_story": "The Attorney-General of the Federation, Abubakar Malami (SAN), made these allegations yesterday while unveiling the findings of a Presidential Committee set up to investigate Kanu and Ighoho.\nThe government further accused Kanu of being responsible for the murder of a former Presidential Aide, Ahmad Gulak, and over 177 others in the South-East.\n“That 175 security personnel were killed by IPOB/ESN, comprising 128 policemen, 37 military personnel and 10 other security operatives.\nGovernment further alleged that between 2013 and 2020, Igboho received N127 million from several financiers, including a federal lawmaker.\n“The major financier of the fugitive and separatists was found to be a federal lawmaker in the National Assembly."
  },
  {
    "headline": "NCC Alerts Nigerians to Deadly FluBot Malware Targeting Bank Accounts",
    "summarized_story": "*Software uses Android devices to steal banking information*9-point advisory issued for protectionEmma OkonjiThe Nigerian Communications Commission (NCC) yesterday raised the alarm about what it described as an extremely damaging malware called “FluBot” which attacks Android mobile banking applications.\n“According to the information received today (Thursday), October 21, 2021, from the Nigeria Computer Emergency Response Team (ngCERT), Flubot targets Androids with fake security updates and App installations,” NCC’s Director of Public Affairs, Ikechukwu Adinde, said in a statement issued yesterday.\n“Consequently, it secures admittance into the device through SMS and proceeds to transmit similar messages to other contacts that may be on the device it has attacked enticing them into downloading the fake app.\n“It suffices to say that, when Flubot infects a device, it can result in incalculable financial losses.\n“Additionally, the malware creates a backdoor which grants access to the user’s device, thus enabling the invader or attacker to perform other criminal actions, including launching other variants of malware.”The NCC subsequently issued an advisory to protect telecoms consumers from falling victim."
  },
  {
    "headline": "PDP’s National Convention Threatened, Secondus Wants Convention Stopped",
    "summarized_story": "In a letter by Oyetibo dated October 21, 2021, addressed to the following officers of the party: The PDP Acting National Chairman, the Chairman, PDP National Convention Committee, the PDP National Organising Secretary, the PDP National Legal Adviser and the PDP National Secretary C/O Chief E.O Oddey, Odey and Odey Solicitors of above address Suite 120-122 Pan Bank Building No.\nOyetibo said that CA/PH/341/2021: Prince Uche Secondus V Ibeawuchi E. Alex & ORS and the pendency of the application for injunction to restrain the holding of the national convention.\n“An appeal has been filed and entered against the judgment at the Court of Appeal, Port Harcourt Judicial Division.\nIn addition, an Application on Notice has been filed in which Prince Uche Secondus is seeking, inter alia, the following orders,” the letter stated.\nYours faithfully, Tayo Oyetibo, SAN, FCIArb, FNIALS.”It was learnt that the suit is billed for judgement on Tuesday next week."
  },
  {
    "headline": "For the Record: Full Text of AGF’s Statement on Outcome of Kanu, Igboho Investigation",
    "summarized_story": "As you are aware Nnamdi Kanu, the self-acclaimed leader of Indigenous People of Biafra (IPOB), has been at the center of a subversive campaign against the Nigerian State.\nConsequently, Nnamdi Kanu was arrested on 14th October, 2015.\nThe destructive activities of IPOB/ESN pose serious threat to Nigeria’s National Security and its corporate existence, which resulted into re-arrest of Nnamdi Kanu and members of his group.\nThe eventual re-arrest of Nnamdi Kanu in June 2021, and some members of his group led to the inauguration of a Presidential Ad-hoc Committee, comprising twenty-four (24) members drawn from:1.\nWe call on these countries to desist from aiding subversive acts by KANU and IPOB against the state of Nigeria and its people."
  },
  {
    "headline": "FG’s Report Unmasks Igboho’s Sponsors, Accuses Kanu of Instigating Killings",
    "summarized_story": "Malami noted that in the process, 396 firearms and 17,738 ammunition were carted away by Nnamdi Kanu led IPOB and ESN.\n“Some of the state actors aided Kanu, even as a fugitive, in his destructive mission, ignoring the terrorist nature of his activities.\n“We call on these countries to desist from aiding subversive acts by Kanu and IPOB against the state of Nigeria and its people.\nHe added that N273,198,200.00 transaction outflows was recorded from Sunday Igboho’s account between March 15, 2013 and March 11, 2021.\n“The report found connections of financial transaction between Adesun International Concept Ltd (belonging to Igboho) and some construction companies and businesses among others."
  },
  {
    "headline": "EXCLUSIVE: How Fulani Bandits Coordinated Attacks On Oyo Correctional Facility To Free Warlord Wakili, Other Criminal Herdsmen In Detention",
    "summarized_story": "The attack on the Abolongo correctional facility, Oyo town in Oyo State was planned and carried out by Fulani gunmen, believed also to be invading bandits, SaharaReporters has learnt.\nTop prison officials told SaharaReporters on Saturday that the gunmen carried out the attack to free the detained notorious Fulani warlord, Iskilu Wakili and other criminal Fulani herdsmen in the facility.\n“The attack in Oyo last night from the Ogbomosho axis was a well-coordinated Fulani attack aimed at securing the release of Wakili, the terrorist whom (Sunday Adeyemo) Igboho drove away from Ibarapa.\nThis was a well-coordinated attack with the objective to free Wakili and other Fulani inmates,” he added.\nOn March 7, a joint team of Ibarapa security operatives, including the Oodua Peoples Congress, Vigilante, and other groups had arrested the notorious Fulani warlord terrorising Oyo communities, Wakili."
  },
  {
    "headline": "EXCLUSIVE: How Fulani Bandits Coordinated Attacks On Oyo Correctional Facility To Free Warlord Wakili, Other Criminal Herdsmen In Detention",
    "summarized_story": "The attack on the Abolongo correctional facility, Oyo town in Oyo State was planned and carried out by Fulani gunmen, believed also to be invading bandits, SaharaReporters has learnt.\nTop prison officials told SaharaReporters on Saturday that the gunmen carried out the attack to free the detained notorious Fulani warlord, Iskilu Wakili and other criminal Fulani herdsmen in the facility.\n“The attack in Oyo last night from the Ogbomosho axis was a well-coordinated Fulani attack aimed at securing the release of Wakili, the terrorist whom (Sunday Adeyemo) Igboho drove away from Ibarapa.\nThis was a well-coordinated attack with the objective to free Wakili and other Fulani inmates,” he added.\nOn March 7, a joint team of Ibarapa security operatives, including the Oodua Peoples Congress, Vigilante, and other groups had arrested the notorious Fulani warlord terrorising Oyo communities, Wakili."
  },
  {
    "headline": "BREAKING: Gunmen Attack Oyo Correctional Facility With Explosives, Set Inmates Free",
    "summarized_story": "Suspected gunmen have attacked one of the facilities of the Nigeria Correctional Service (NCS), in Oyo State.\nAccording to Daily Post, the facility, christened Abolongo correctional facility, was attacked by the gunmen on Friday evening.\nIt was gathered that the gunmen set all the prisoners at the facility free during the attack.\nSpokesman for the Nigerian Correctional Service (NCS) in the state, Olanrewaju Anjorin confirmed the attack on Saturday.\n“And right now, the comptroller of Nigerian Correctional Service (NCS) and other top officers are assessing the situation."
  },
  {
    "headline": "BREAKING: Gunmen Attack Oyo Correctional Facility With Explosives, Set Inmates Free",
    "summarized_story": "Suspected gunmen have attacked one of the facilities of the Nigeria Correctional Service (NCS), in Oyo State.\nAccording to Daily Post, the facility, christened Abolongo correctional facility, was attacked by the gunmen on Friday evening.\nIt was gathered that the gunmen set all the prisoners at the facility free during the attack.\nSpokesman for the Nigerian Correctional Service (NCS) in the state, Olanrewaju Anjorin confirmed the attack on Saturday.\n“And right now, the comptroller of Nigerian Correctional Service (NCS) and other top officers are assessing the situation."
  },
  {
    "headline": "Mob Sets Ablaze Two Robbery Suspects In Oyo",
    "summarized_story": "Two suspected armed robbers, who specialised in snatching motorcycles and Point of Sales Machines, were set ablaze by a mob at Gbaremu bus stop in the Ibadan North Local Government Area of Oyo State on Friday night.\nSaharaReporters gathered that the robbers shot an Hausa Okada rider after a lady operating a POS had been robbed.\nOyo state on the mapAccording to witnesses, it was the gunshots that alerted some residents before they chased the robbers and arrested two among them.\n“Yes, two of them were set ablaze.\nFew days later, they came to Gbaremu market and robbed a young man who operated POS business."
  },
  {
    "headline": "FBN Holdings: Otedola is yet to notify us of majority share acquisition",
    "summarized_story": "FBN Holdings Plc, the holding company of First Bank of Nigeria, says it is yet to receive any notification from Femi Otedola, billionaire businessman, on his alleged acquisition of majority shares.\nOtedola was said to have acquired more than five percent equity stake in FBN Holdings through provies and investments — reportedly now the single largest shareholder of the bank.\n“The attention of FBN Holdings Plc (the Company) has been drawn to media reports today, 22 October 2020 purporting that a certain individual has acquired significant shareholding interest in FBN Holdings Plc {the Company) therefore making him the majority shareholder in the Company,” the statement reads.\nAdvertisement“As a listed Company, the shares of FBN Holdings Plc are publicly traded, and sale and acquisition of shares is expected in the normal course of business.\n“FBN Holdings Plc will always notify the appropriate agencies and authorities whenever it receives any notice of significant shareholding by the Shareholders and the Company’s Registrars.”"
  },
  {
    "headline": "FBN Holdings: Otedola is yet to notify us of majority share acquisition",
    "summarized_story": "FBN Holdings Plc, the holding company of First Bank of Nigeria, says it is yet to receive any notification from Femi Otedola, billionaire businessman, on his alleged acquisition of majority shares.\nOtedola was said to have acquired more than five percent equity stake in FBN Holdings through provies and investments — reportedly now the single largest shareholder of the bank.\n“The attention of FBN Holdings Plc (the Company) has been drawn to media reports today, 22 October 2020 purporting that a certain individual has acquired significant shareholding interest in FBN Holdings Plc {the Company) therefore making him the majority shareholder in the Company,” the statement reads.\nAdvertisement“As a listed Company, the shares of FBN Holdings Plc are publicly traded, and sale and acquisition of shares is expected in the normal course of business.\n“FBN Holdings Plc will always notify the appropriate agencies and authorities whenever it receives any notice of significant shareholding by the Shareholders and the Company’s Registrars.”"
  },
  {
    "headline": "MATTERS ARISING: Suspects still in prison -- one year after #EndSARS protests",
    "summarized_story": "The protests gained widespread acceptance both on the streets and on social media as celebrities added their voices in support of the movement.\nAdvertisementHowever, despite the disbandment of SARS, the protests continued and was later hijacked by hoodlums.\nAt the magistrate’s court, he was remanded in Kirikiri prison while awaiting the advice of the Lagos state director of public prosecution.\nSince his arrest, Adekemi Adesina, the suspect’s sister, has been using social media to demand justice for her brother.\nThe suspect is still in Kirikiri prison — 10 months after his arrest — and the next court sitting on the case is December 8."
  },
  {
    "headline": "MATTERS ARISING: Suspects still in prison -- one year after #EndSARS protests",
    "summarized_story": "The protests gained widespread acceptance both on the streets and on social media as celebrities added their voices in support of the movement.\nAdvertisementHowever, despite the disbandment of SARS, the protests continued and was later hijacked by hoodlums.\nAt the magistrate’s court, he was remanded in Kirikiri prison while awaiting the advice of the Lagos state director of public prosecution.\nSince his arrest, Adekemi Adesina, the suspect’s sister, has been using social media to demand justice for her brother.\nThe suspect is still in Kirikiri prison — 10 months after his arrest — and the next court sitting on the case is December 8."
  },
  {
    "headline": "THE AFTERMATH: Abuja-Kaduna not safe by road or rail -- so what next?",
    "summarized_story": "On Thursday, news broke of an attack on a train along the Abuja-Kaduna rail track.\nIn 2019, Rotimi Amaechi, minister of transportation, said the daily passenger traffic on the Abuja-Kaduna rail line had tripled.\nThe reason we allowed standing on the Abuja-Kaduna train is the insecurity that has made it unbearable to insist on sitting,” he had said.\nThe UK government’s travel advice lists the Abuja-Kaduna highway as “particularly prevalent” for criminal activities.\n“Nigerians are in serious dilemma because the Abuja-Kaduna road is a gateway to the north-west."
  },
  {
    "headline": "Baxi acquisition deal sees MFS Africa expand footprint into Nigeria",
    "summarized_story": "As the largest fintech interoperability hub in Africa, MFS Africa connects banks, telcos, and money transfer operators across over 35 countries via a single integration point.\nCapricorn will be called MFS Africa but its core product, Baxi, retains its name.\nMFS Africa was founded in 2009 by Dare Okoudjou, a Beninese national, while Nigeria-born Abudu started Capricorn in 2014, with Folu Majekodunmi.\nThe acquisition creates a larger, more versatile company that fuses interoperability between money operators and a super-agent network reaching the mass market.\nMFS Africa will also expand Baxi’s proposition for offline SMEs to select markets within its footprint."
  },
  {
    "headline": "Editi Effiong: father, writer, producer and tech bro",
    "summarized_story": "When asked how he would define himself, he responded with, “I’m a father, writer, producer, and tech bro.\nThe big picture: Editi Effiong is not your average guyMany people know Editi Effiong as the brains behind Anakle.\nAnakle Films’ theatrical releases, Up North and The Setup, were acquired by Netflix in 2019 and 2020 respectively.\nIn 2011, digital marketing didn’t have as much clout as it does now.\nEspecially knowing that you were going to put a lot of time and effort into building out Anakle Films’ brand?"
  },
  {
    "headline": "Who’s afraid of crypto-salaries?",
    "summarized_story": "Back in 2015, its current president, Muhammadu Buhari, campaigned on a promise to increase the value of the naira.\nThis plunge in the value of the naira has been majorly fueled by Nigeria importing more goods than it exports.\nWith 96% of the crypto value coming from outside the continent, this suggests that more Africans are receiving remittances via crypto.\nThis is the company battling the challenge that comes with paying employees in crypto, as legal barriers in many countries prevent this.\nSome of the barriers include the non-recognition of cryptocurrency as a legal tender and the challenge of calculating taxes when employees are paid in cryptocurrency."
  },
  {
    "headline": "I promise it’s funnier in Swahili…Kenyan Comedian Eddie Butita is Showing Netflix How Swahili’s Done",
    "summarized_story": "To roll out this project, the $25 billion company enlisted the help of celebrated Kenyan comic, Eddie Butita.\nButita is skilled at wielding digital technology in a market that’s grown so big that Netflix can’t ignore it.\nAccording to the Worldwide Mobile Data Pricing (2021) report from Cable, a British technology research firm, Kenya takes the lead as the most expensive country for mobile data in East Africa.\nViewing one hour of Netflix content on low resolution (480p) uses 300 MB of data per hour; in high resolution (1080p), Netflix uses 3 GB per hour.\nAt an average cost of $1.05 per GB of data, Netflix viewers in Kenya stand to pay anywhere from $0.32 to $3.15 to watch a one-hour show."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Technology is awesome, but it’s yet to conquer stuttering",
    "summarized_story": "Stuttering in a tech-enabled worldOne can be forgiven for thinking that there is a tech solution somewhere that does away with stuttering.\nStuttering has no known cure, and the best technology can currently do is what therapy does — treat or manage the condition like other speech defects.\nPeople can get the most out of treatment if they address stuttering early enough — preferably as children.\nNumbers don’t lieAccording to The Stuttering Foundation, stuttering affects 1% of the world’s population; depending on what global population you accept, that’s 78 or 79 million people.\n“Stuttering has shaped my personality; I’m reserved, and I don’t say anything around strangers unless it’s necessary because I don’t like being asked to repeat myself."
  },
  {
    "headline": "Techpoint Awards, AltSchool by TalentQL, Privacy Roundtable PT2, Brass’ $1.7m funding",
    "summarized_story": "This lack of degree options and the scarcity of developers is what TalentQL is looking to solve with AltSchool.\nThere’s more: TalentQL launches AltSchool Africa to train entry level tech talent for freeSo you care about your privacy?\nOn Thursday, October 21, 2021, Brass, a Nigerian digital bank, announced $1.7 million in funding to aid their growth across Africa.\nCurrently, the platform provides SMEs with various services, including payroll and expense management, credit and payment services, and API support.\nThey claim to have disbursed $2 million in credit via their crediting platform, Brass Capital, which is still in the Beta phase."
  },
  {
    "headline": "What does the African fintech need?",
    "summarized_story": "The virtual event focused on fintech’s allure to investors, the benefits Africans derive from fintech start-ups, partnerships between banks and fintech startups, and the role of regulators in the industry.\nHowever, Agboola disagreed with that view, arguing that he sees a situation where fintech complement the works that banks do and vice versa, advocating for partnerships between banks and fintech.\nDeepening financial inclusion is high on the agenda of Nigeria’s Central Bank and Y’ello Digital Financial Services has been playing its part in helping the apex realize this goal.\nWith its wide network of over 150,000 MoMo agents, the organization offers financial services to customers.\nWith 54 countries in Africa, providing financial services to users comes with lots of regulatory hurdles in each country."
  },
  {
    "headline": "NCC alerts telecom users of Flubot malware targeting bank accounts",
    "summarized_story": "The Nigerian Communications Commission (NCC) has warned Nigerian telecom users of Flubot, a new, high-risk and extremely-damaging, malware that targets bank accountsNCC in a press statement signed by its spokesperson, Ikechukwu Adinde, said the Nigeria Computer Emergency Response Team, ngCERT affirmed that Flubot “impersonates Android mobile banking applications to draw fake web view on targeted applications” and its goal transcends stealing personal data and essentially targets stealing of credit card details or online banking credentials.\nMalware is a generic word used to describe a virus or software, designed specially to “disrupt, damage, or gain unauthorized access to a computer system.\nAdditionally, the malware creates a backdoor which grants access to the user’s device, thus enabling the invader or attacker to perform other criminal actions, including launching other variants of malware.\nThis will delete any data on your phone, including personal data,Other measures given by the commission are: ” Do not restore from backups created after installing the app.\nYou may contact ngCERT on incident@cert.gov.ng for technical assistance, You will also need to change the passwords to all of your online accounts, with urgency, around your online bank accounts, If you have concerns that your accounts may have been accessed by unauthorised people, contact your bank immediately.”"
  },
  {
    "headline": "Lagos fashion week 2021: The future starts now",
    "summarized_story": "Following a pandemic-induced hiatus, Lagos Fashion Week is finally set to return from October 27th-October 30th at the Lagos Fashion Week Tents, Federal Palace Hotel.\nThe future of fashion for the next decade and for many more to come starts now.\nPutting into practice the foundations of a circular economy that prioritizes reuse, reduce & recycle, Lagos Fashion Week will facilitate the exchange of pre-owned items through swapping, sharing, donating and resale.\n#LFW2021 Line-Up● Fashion Business Series: 27th October 2021● Digital & Offsite Shows: 28th October 2021● Physical Runway Shows: 29th-30th October 2021Heineken Lagos Fashion Week is supported by Heineken, Style House Files, Lush Hair, Advantage Austria Nigeria, OPPO & Nigerian Export Promotion Council.\nIt’s 7 days to go and the city of Lagos will once again come alive as Lagos Fashion Week returns in full force."
  },
  {
    "headline": "Addis Ababa Business class lounge: Designed in style to meet travellers’ needs",
    "summarized_story": "For passengers awaiting their flights or those connecting flights after a long haul trip, an experience to never miss is the Business Class lounge at the newly built Africa’s largest transit hub, Addis Ababa Bole International Airport.\nEntertainment and comfort are intertwined at Bole International Airport Business Class!\nBefore flights, passengers can relax in private suites and take a refreshing shower.\nThe business class airport lounge is spacious with excellent amenities like shower suites, nap areas, and comfortable seats.\nAfter a quick check-in at the business class counter passengers can make their way to the lounge."
  },
  {
    "headline": "#EndSARS: Obaseki meets Edo youths, to pay N190m compensation to victims of police brutality – Nigerian Observer",
    "summarized_story": "Obaseki gave the assurance during a meeting with the youths at the Government House in Benin City.\nHe said, “I set up a panel to investigate cases of police brutality against the people.\nThe panel recommended compensation to be paid to victims totaling N190 million, while the amount of judgment sum recommended being enforced was N98 million.\nReassuring that his administration will do all within its power to implement the 15 recommendations of the panel, Obaseki said Edo youths are the greatest resources of the state.\nA representative of the youths, Solomon Idiogbe, commended Obaseki for improved security across the state, urging him to engage more youths as a means of checking cultism in Edo State."
  },
  {
    "headline": "Obaseki charges judiciary on speedy conviction of sexual, gender-based violence offenders – Nigerian Observer",
    "summarized_story": "Obaseki gave the charge at a one-day sensitization and capacity building workshop on Gender-Based Violence (GBV) for High Court Judges and judicial officers in Edo State, held in Benin City.\nIt is our collective responsibility to drive the desired changes that are required to ensure that we have a society that is free of violence, particularly gender-based violence.\n“We have launched a sexual offenders’ register which serves as a tool to shame all those persons who have been convicted in gender-based violence.\n“The governor has assured us of providing requisites; we need to build new courthouses and a special courthouse for gender-based violence, with special judges assigned to these courts.”In her welcome remarks, Ms.\nLamptey further applauded the state government’s commitment to ensuring access to justice for all, especially for women and girls in Edo."
  },
  {
    "headline": "LASG Reconstitutes Interim Caretaker Committe For ASPMDA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Lagos State Government has reconstituted the interim Caretaker Committee for the Auto Spare Parts & Machinery Dealers Association (ASPMDA) in compliance with the judgments of the High Court of Lagos State in Suit No.\nA statement issued by the Lagos State Attorney-General and Commissioner for Justice, Mr. Moyosore Onigbanjo, said that the decision is in compliance with the Court judgements.\nOnigbanjo noted that 15 months after constituting the Interim Caretaker Committee, chaired by Sir.\nSunday Igbanuzue, it has failed to conduct elections for new Executive Officers of ASPMDA.\nGovernor has directed the immediate dissolution of the Interim Caretaker Committee constituted by the State Government in June 2020 and chaired by Sir."
  },
  {
    "headline": "Flying officers cup:Edo Queens pip Confluence Queens ,face Robo in finals – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo Queens Football Club of Benin yesterday defeated the Confluence Queens of Lokoja by a lone goal in the semifinals stage of the Flying Officers Preseason Tournament and will engage FC Robo of Lagos in the last game of the tournament on Sunday.\nThe final match is scheduled for 3 PM on Sunday at the same FCT Sports Complex.\nEmem Essien’s late strike earned the Benin girls the important victory to once again vie for honour in the tournament they won two years ago in Abuja.\nEdo Queens on the road to the finals of the women football preseason tournament did not concede any goal and won all their games.\nThe two premier league clubs are not new to themselves as they met in the Betsy Obaseki Women Football Tournament held in Benin recently."
  },
  {
    "headline": "Gunmen attack Nigerian prison, free inmates",
    "summarized_story": "Armed persons on Friday night attacked the Abolongo Correctional Centre in Oyo Town, freeing an unspecified number of inmates at the facility, Olarewaju Anjorin, the Public Relations Officer, Nigeria Correctional Service, Oyo State Command, has said..Mr Anjorin told the News Agency of Nigeria (NAN) that the attack happened around 9.50 p.m.NAN reports that the attackers were heavily armed and engaged the guards in a fierce gun battle before freeing some inmates.\n“Yes, I can confirm to you that the place was attacked and some of the awaiting inmates were set free,” the spokesperson said.\n“I am there right now with the Controller and some other senior officers doing assessment of the damage done to the facility.\n“Now, we cannot ascertain the numbers of the inmates freed or people that get injured, but definitely, I will be giving you an update later.”(NAN)"
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "FBN Holdings denies knowledge of Otedola’s majority shares acquisition",
    "summarized_story": "FBN Holdings Plc, the holding company for First Bank of Nigeria Limited, has denied knowledge of acquisition of majority of its shares by billionaire businessman, Mr Femi Otedola.\nThis followed media reports that Otedola has acquired majority of its shareholding.\nThe statement said, “The attention of FBN Holdings Plc has been drawn to media reports today (Friday) that a certain individual has acquired significant shareholding interest in FBN Holdings Plc.\n“As a listed company, the shares of FBN Holdings are publicly traded, and sale and acquisition of shares is expected in the normal course of business.\n“The company is yet to receive any notification from the individual mentioned in the media report, of such acquisitions.”"
  },
  {
    "headline": "ADF commends Igbo lawyers for solidarity with Nnamdi Kanu",
    "summarized_story": "OBINNA EZUGWUThe Alaigbo Development Foundation (ADF), has praised lawyers of Igbo extraction who volunteered to join the defence team of the leader of Indigenous People of Biafra(IPOB), Mazi Nnamdi Kanu at the commencement of his trial at the Abuja Federal High Court yesterday.\nADF which gave the commendation in a statement by its spokesman, Abia Onyike, said it believes that such show of solidarity was essential as the political trial of Kanu gathers momentum.\nHe is a freedom fighter like other genuine Igbo Patriots engaged in the Igbo liberation struggle.\n“The Federal Government should create a conducive atmosphere for dialogue with agitators for Self-determination instead of pursuing them like common criminals,” the group said.\n“The situation in Nigeria today shows clearly that there is an unstoppable longing for freedom by all Ethnic Nationalities which is a rejection of the forced federalism created by Lord Frederick Lugard in 1914."
  },
  {
    "headline": "PDP National Convention: Prof Wale Oladiipo clears air on disqualification",
    "summarized_story": "“When the final decision was made, l abided by it and stayed by the party which consequently made us deliver on our mandate.\nI am also a proud member of both the Convention Committee and the PDP e-registration Committee.\n(3) That l am also pleased to say that l have been delivering my constituencies constantly to the party.\nI have never decamped to any other party or sabotage the interests of the party in any form.\nIt is therefore funny that those who walked out of convention when we had a sitting President are cleared to contest."
  },
  {
    "headline": "Obokun East Chair, Bamidele hails Famoodun on his re-election as Osun APC Chairman",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe caretaker Chairman for Obokun East Local Council Development Area, LCDA, Ilare Ijesha, Osun state, Hon.\nBello Saliu Bamidele has congratulated the state chairman of All Progressives Congress, APC, Prince Gboyega Famoodun on his re-election as party chairman for another four years, saying his victory at the recently held state congress is well deserved.\nHe described the party chairman as a real democrat in whose heart the progress of the party is paramount.\n“I want to state clearly here that the leadership quality displayed by Prince Adegboyega Famodun made it possible for the delegates and the entire members of Osun State APC to re-elect him as the chairman of the party,” he said.\n“It is my greatest joy to join other Progressives family in congratulating our indefatigable Chairman, Prince Adegboyega Famodun for his re-election as Osun State party Chairman of APC All progressives Congress, your victory with large majority has filled me with immense joy."
  },
  {
    "headline": "NYSC Responsible For Kidnap Of Corps Members In Zamfara – Shehu Sani",
    "summarized_story": "Senator Shehu Sani, who represented Kaduna Central in the Senate between 2015 and 2019, has blamed the National Youth Service Corps (NYSC) for the kidnap of two prospective corps members posted to Kebbi State.\nLEADERSHIP reports that Jenifer Iorliam, a Benue State-born prospective corps member, was on her way to the Kebbi State orientation camp when she was kidnapped in Zamfara State.\nThe bandits, who kidnapped her and one another corps member, called Joseph, have made contact with her family and demanding for a ransom before her release.\nAngry Senator Shehu Sani, who took to his social media handles on Saturday morning, said the NYSC management should rescue Jenifer and others since it was responsible for posting them to the hot zone.\nNYSC Denies Alleged Kidnap Of Corps Members In OndoADVERTISEMENTSani wrote: “Jenifer Iorliam, a youth Corper posted to Kebbi was kidnapped by terrorists in Zamfara."
  },
  {
    "headline": "NYSC Responsible For Kidnap Of Corps Members In Zamfara – Shehu Sani",
    "summarized_story": "Senator Shehu Sani, who represented Kaduna Central in the Senate between 2015 and 2019, has blamed the National Youth Service Corps (NYSC) for the kidnap of two prospective corps members posted to Kebbi State.\nLEADERSHIP reports that Jenifer Iorliam, a Benue State-born prospective corps member, was on her way to the Kebbi State orientation camp when she was kidnapped in Zamfara State.\nThe bandits, who kidnapped her and one another corps member, called Joseph, have made contact with her family and demanding for a ransom before her release.\nAngry Senator Shehu Sani, who took to his social media handles on Saturday morning, said the NYSC management should rescue Jenifer and others since it was responsible for posting them to the hot zone.\nNYSC Denies Alleged Kidnap Of Corps Members In OndoADVERTISEMENTSani wrote: “Jenifer Iorliam, a youth Corper posted to Kebbi was kidnapped by terrorists in Zamfara."
  },
  {
    "headline": "Frank To AGF: Allegations Against Kanu, Igboho Mere Propaganda",
    "summarized_story": "A former deputy national publicity secretary of the All Progressives Congress (APC), Comrade Timi Frank, on Saturday, condemned the Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN), and his allegations of terrorist activities against Nnamdi Kanu and Sunday Adeyemo (Igboho).\nAccording to Frank in a statement in Abuja, Malami’s allegations were not only spurious, but highly selective and high-wired propaganda aimed at securing selfish political gains.\nHe called on Nigerians to dismiss Malami’s half-truths against Kanu and Igboho and to continue to demand for fairness, justice and equity as bonafide citizens.\nHe also called Nigerian leaders in the South to speak out and condemn Malami’s statement as they are capable of inciting violence in the country.\nHe, therefore, called on the international community to disregard the pre-arranged outcome from the trial of Nnamdi Kanu and Sunday Igboho due to the obviously unfair and hushed trial being conducted against them by the Federal Government."
  },
  {
    "headline": "Frank To AGF: Allegations Against Kanu, Igboho Mere Propaganda",
    "summarized_story": "A former deputy national publicity secretary of the All Progressives Congress (APC), Comrade Timi Frank, on Saturday, condemned the Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN), and his allegations of terrorist activities against Nnamdi Kanu and Sunday Adeyemo (Igboho).\nAccording to Frank in a statement in Abuja, Malami’s allegations were not only spurious, but highly selective and high-wired propaganda aimed at securing selfish political gains.\nHe called on Nigerians to dismiss Malami’s half-truths against Kanu and Igboho and to continue to demand for fairness, justice and equity as bonafide citizens.\nHe also called Nigerian leaders in the South to speak out and condemn Malami’s statement as they are capable of inciting violence in the country.\nHe, therefore, called on the international community to disregard the pre-arranged outcome from the trial of Nnamdi Kanu and Sunday Igboho due to the obviously unfair and hushed trial being conducted against them by the Federal Government."
  },
  {
    "headline": "IPMAN Allays Marketers’ Fears About PIA, Says Claims In PEF Intact",
    "summarized_story": "The national president of the Independent Petroleum Marketers Association (IPMAN), Engr.\nSanusi Fari, has allayed fears of members over the scrapping of the Petroleum Equalisation Fund by the federal government.\nIt was widely reported on Wednesday that the federal government had officially scrapped the Department of Petroleum Resources (DPR), Petroleum Products Pricing Regulatory Agency (PPPRA) and the Petroleum Equalisation Fund (PEF).\nTwo new agencies, the Upstream Regulatory Commission and Nigerian Midstream and Downstream Petroleum Regulatory Authority (NPRA) have since been saddled statutorily to perform the duties of the three defunct agencies.\n“On behalf of the National Executive Committee (NEC) of IPMAN, I call on our members not to panic."
  },
  {
    "headline": "Reps panel threaten to arrest Polaris Bank MD Innocent Ike",
    "summarized_story": "Failure of the managing director of Polaris Bank Innocent Ike to appear before the House of Representatives ad-hoc committee investigating the status of all recovered loots, movable and immovable assets from 2002-2020 may result in the issuance of an arrest warrant.\nChairman of the committee Adejoro Adeogun said the accountant general of the federation, NNPC, Polaris, Unity, Sterling, Heritage, Keystone and Fidelity banks were invited to appear before the panel.\nIf your bank continues with this level of unseriousness, I will issue an arrest warrant against the MD,” Adeogun said.\nPolaris’ representative told the committee that the bank has tendered evidence of payment to the Central Bank of Nigeria.\nIt also summoned the accountant general of the federation, managing directors of Sterling, Unity, Sterling, Heritage, Keystone and Fidelity banks to appear in persons before it on October 27."
  },
  {
    "headline": "Reps panel threaten to arrest Polaris Bank MD Innocent Ike",
    "summarized_story": "Failure of the managing director of Polaris Bank Innocent Ike to appear before the House of Representatives ad-hoc committee investigating the status of all recovered loots, movable and immovable assets from 2002-2020 may result in the issuance of an arrest warrant.\nChairman of the committee Adejoro Adeogun said the accountant general of the federation, NNPC, Polaris, Unity, Sterling, Heritage, Keystone and Fidelity banks were invited to appear before the panel.\nIf your bank continues with this level of unseriousness, I will issue an arrest warrant against the MD,” Adeogun said.\nPolaris’ representative told the committee that the bank has tendered evidence of payment to the Central Bank of Nigeria.\nIt also summoned the accountant general of the federation, managing directors of Sterling, Unity, Sterling, Heritage, Keystone and Fidelity banks to appear in persons before it on October 27."
  },
  {
    "headline": "Chinese President Xi Seeks To Boost Relations With Nigeria, Writes To Buhari",
    "summarized_story": "Chinese President Xi Jinping has said his country will use the occasion of the 50th anniversary of the establishment of diplomatic relations with Nigeria to promote a strategic partnership to new heights.\nThis is according to a statement by Femi Adesina, the special media adviser to President Muhammadu Buhari.\nAccording to Adesina, President Xi disclosed his intentions in a letter addressed to the Nigerian leader on Friday.\nChina-Nigeria cooperation has been the pacesetter of China-Africa cooperation,’’ the Chinese President is said to have written in his piece to President Buhari.\nThe Chinese leader said he attached great importance to the development of China-Nigeria relations and assured President Buhari that his country would spare no effort in strengthening existing relations."
  },
  {
    "headline": "Chinese President Xi Seeks To Boost Relations With Nigeria, Writes To Buhari",
    "summarized_story": "Chinese President Xi Jinping has said his country will use the occasion of the 50th anniversary of the establishment of diplomatic relations with Nigeria to promote a strategic partnership to new heights.\nThis is according to a statement by Femi Adesina, the special media adviser to President Muhammadu Buhari.\nAccording to Adesina, President Xi disclosed his intentions in a letter addressed to the Nigerian leader on Friday.\nChina-Nigeria cooperation has been the pacesetter of China-Africa cooperation,’’ the Chinese President is said to have written in his piece to President Buhari.\nThe Chinese leader said he attached great importance to the development of China-Nigeria relations and assured President Buhari that his country would spare no effort in strengthening existing relations."
  },
  {
    "headline": "My leaked sex video: I fainted says Walton Liverpool of Bayelsa",
    "summarized_story": "A former permanent secretary of the Bayelsa state ministry of education, Dr. Walton Liverpool has spoken about his trauma following the leakage of his sex video in the social media.\nCharlotte, 19, was arrested by the DSS and charged with circulating the video to blackmail Liverpool.\nHe said the nude video allegedly released by the accused has caused him psychological and physical pains.\n”He told the court that he was asked to pay the sum of N15million or else the nude video will be posted on social media.\n“After six days, on the 14th of September, 2021, I was alerted that my nude video has been posted on Facebook."
  },
  {
    "headline": "Exam. malpractices: Ignatius Ajuru varsity expels 2 PhD students, 1 other",
    "summarized_story": "Okafor Ofiebor/Port HarcourtThree Post graduate students of Ignatius Ajuru University of Education, Port Harcourt, have been expelled for engaging in various forms of examination malpractices.\nThe affected students are: Benjamin Amaechi Onu – (MSc candidate in Sociology), Vicar Efebo – (PhD candidate – Faculty of Busines Studies and Wagbara Faith Ekuetosi – (PhD candidate – Faculty of Business Studies).\nVice Chancellor of Ignatius Ajuru University, Professor Ozo-Mekuri Ndimele disclosed the disciplinary action taken against the students involved in examination malpractices by the management of the institution in a post on his official Facebook account.\nHe further said that ‘their matters have been referred to the Students Disciplinary Committee to determine their fate and the Department of State Services for profiling.\nOur correspondent reports that the University management under the current Vice Chancellor has been tough examination malpractices and other misdemeanors by students and lectures by punishing culprits."
  },
  {
    "headline": "BREAKING: Boko Haram Terrorists Attack Yobe Community",
    "summarized_story": "In the early hours of Saturday, suspected Boko Haram militants in ten gun trucks stormed Katarko village in Yobe State’s Gujba Local Government Area.\nThe assailants drove into the community in a convoy of gun trucks at 8 a.m., according to a source who spoke to DAILY POST from a safe location.\nAccording to him, the attackers were engaged by military stationed in the community.\nAs at the time of reporting this story, the details of the attack were still hazy.\nBoko Haram had previously attacked Katarko village, which is around 20 kilometers from Damaturu, the Yobe State capital."
  },
  {
    "headline": "BREAKING: Gunmen Invade Oyo Prison, Set Inmates Free",
    "summarized_story": "In Oyo State, suspected gunmen invaded one of the Nigeria Correctional Service’s (NCS) facilities.\nThe prison, named Abolongo Correctional Facility, was stormed by gunmen on Friday evening, according to NEWS DIRECT.\nDuring the attack, the gunmen reportedly released all of the facility’s inmates.\nOn Saturday, Olanrewaju Anjorin, a spokesman for the Nigerian Correctional Service (NCS) in the state, confirmed the attack to us.\n“And right now, the comptroller of Nigerian Correctional Service (NCS) and other top officers are assessing the situation."
  },
  {
    "headline": "How Boko Haram, Bandits Bombed Abuja-Kaduna Train Despite Intel Before Attack",
    "summarized_story": "The raid was carried out by Boko Haram and bandits as a coordinated operation in the North-West, confirming their partnership.\nIt detailed how the Darussalam, an Arabic code word for Boko Haram, planned and carried out the mission.\nDarussalam and bandits commanded by “Danlami and Lawan” were planning to detonate a bomb on the train, according to Baffa, whose communication was intercepted.\nBandits were being trained by Boko Haram and the Islamic State’s West Africa Province, security authorities were warned in July (ISWAP).\nSeveral bandits flew from Zamfara State to attend drills at terrorist hideouts in Borno State, the Nigeria Immigration Service (NIS) discovered."
  },
  {
    "headline": "End SARS: Lagos Govt Suspends LNSC Officers For Brutalizing Uber Driver.",
    "summarized_story": "The Lagos State Neighbourhood Safety Agency (LNSA) has sanctioned two officers for their actions during the End SARS demonstration, which included the improper treatment of Uber driver Adedotun Clement.\nNEWS DIRECT reported how Lagos Neighborhood Safety Corps (LNSC) personnel and police officers brutalized Clement on Wednesday despite identifying himself.\nThe two officers directly involved in the assault were de-kitted and suspended for 2 months.\nTheir Commanding Superintendents and the Divisional Commander were suspended for one month; the deputies are to take charge until further notice.\nLSNA General Manager, Ifalade Oyekan apologized to Clement and restated the Lagos government’s commitment to secure lives and properties."
  },
  {
    "headline": "Breaking: Gunmen attack another correctional centre, free all inmates",
    "summarized_story": "Gunmen on Friday night attacked the federal correctional facility in Abolongo in Oyo state and set free all the prisoners at the centre.\nBlueprint gathered that the gunmen stormed the centre at about 10.30pm and launched heavy attack.\nThey were reported to have blown the entrance to the centre with grenades to gain access and set prisoners free.\nIt was gathered that the attack left the facility in disarray with warders scampering for safety.\nAs at Saturday morning, other sister security agencies were deployed at the centre to support men and women of the Nigerian Correctional Service to track down the bandits as well as rearrest prisoners."
  },
  {
    "headline": "US President, Joe Biden, picks another Nigerian in fresh appointment",
    "summarized_story": "Another Nigerian Enoh Titilayo Ebong, has made it into the US government, after President Joe Biden appointed her to the post of Director, United States Trade and Development Agency, swelling the list of what has become of the new administration, which took office in February 2021.\nThe appointment of the Nigerian-born technocrat, was contained in a brief with names of nominees for different positions in the president’s cabinet sent to the US Congress.\nEbong had served in different roles in the USTDA between 2004 and 2019, including serving as the agency’s General Counsel, and Deputy Director.\nBefore joining the USTDA Ebong worked as a lawyer in Boston, representing public and private companies.\nAccording to the brief, President Joseph R. Biden, Jr. appointed Ebong to serve as the Chief Operating Officer of the USTDA and she has been serving as the Acting Director of the agency since then."
  },
  {
    "headline": "Breaking: NRC reopens Abuja-Kaduna train route 48 hours after ‘bandits attack’",
    "summarized_story": "The Nigerian Railway Corporation (NRC) has announced reopening of Abuja-Kaduna route two days after a moving train was attacked by suspected bandits.\nThe attacks carried out between Wednesday evening and Thursday morning also destroyed some part of the rail tracks.\nA reopening announcement by NRC on Friday evening read, “The Board and Management of the Nigerian railway corporation (NRC) hereby inform the general public, particularly our valued passengers that Abuja – Kaduna Train Services (AKTS) resume tomorrow, Saturday, 23rd October, 2021 as follows, From, IDU, Abuja (AK3) at 0950am.\nFrom RIGASA, Kaduna (KA4) at 1035am.\nNRC, once again sincerely apologises for the inconvenience.”Details loading…"
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "FG to tackle maternal mortality occasioned by loss of blood -NigPilot",
    "summarized_story": "Worried by rising cases of pregnancy-related deaths, the National Blood Service Commission has vowed to drastically reduce the level of maternal mortality occasioned by blood loss during childbirth.\nSpeaking during a media briefing alongside sponsor of the Bill, now an Act of the Parliament, Hon.\nAbas Tajudeen, the Director-General of the agency, Dr. Omale Joseph explained that not less than 15 percent of every 1,000 women die due to blood loss during childbirth and urged Nigerians to imbibe the practice of donating blood.\n“As you donate blood, you’re saving a life, and not only that, research has shown that people who donate blood regularly live more healthy”, he submitted.\nIt would be recalled the Commission’s establishment Bill, which was introduced by Hon."
  },
  {
    "headline": "Birthday Felicitations: NCFront hails exemplary leadership of Kwankwaso, Dokpesi @ 65, 70 -NigPilot",
    "summarized_story": "The leadership of the National Consultative Front, NCFront, has felicitated with Dr. Mallam Rabiu Musa Kwakwanso and Dr. Raymond Dokpesi on the occasion of their 65th and 70th Birthdays anniversaries respectively.\nIn a congratulatory statement issued Friday and signed by the Head, Public Affairs Bureau, Dr Tanko Yunusa, NCFRONT recognized their contributions to nation building and for egalitarian society.\nThe group described the two prominent Nigerians as leaders of conscience who have identified with, supported and contributed to the efforts of the National Consultative Front since its inception.\nIt will be recalled that on the 21st of October, 2021, Dr Raymond Dokpesi, the Chairman of the African Independent Television turned 70, while Mallam Rabiu Musa Kwakwanso clocked 65.\nHe added that Kwankwaso is without doubt a leader , an administrator and philosopher whose thoughts and actions symbolise an embodiment of a political cum leadership ideals that this country should be proud of."
  },
  {
    "headline": "NIA honours Aviation Minister for infrastructural development -NigPilot",
    "summarized_story": "Nigeria’s Minister of Aviation, Sen. Hadi Sirika has received the Honorary Fellowship and Distinguished Service Award of the Nigerian Institute of Architects, NIA, for his infrastructural developments within the aviation sector.\nThe Award was given to the minister at the Institute’s Architecture Annual Award 2021 in Abuja on Thursday.\nPresenting the award, the Institute noted that under his supervision, the Ministry of Aviation embarked upon 157 projects and delivered 134 to 100 percent completion for the first time in the history of Nigerian Aviation.\nThe NIA also cited the rehabilitation of the runways of the Abuja Airport and the Enugu Airport according to ICAO specifications which were not only delivered ahead of schedule, but within budget.\nDisclosing that he has rejected 390 awards in the past, Sirika said he had to make an exception for the NIA award because of the integrity of the institution."
  },
  {
    "headline": "Rubber stamp 9th assembly would approve Buhari’s third term if… – Wabara -NigPilot",
    "summarized_story": "Former president of the Senate, Adolphus Wabara Thursday hinted that the present 9th National Assembly would have approved an unconstitutional third term for President Muhammadu Buhari if he had insisted on going for it.\nWabara spoke Thursday in Abuja as a special guest at the public presentation of the book: “Standing Strong”, authored by former president of the Senate, Ken Nnamani.\nThe former Senate president who stepped down under intense pressure in the 5th assembly thanked President Muhammadu Buhari for standing strong against the pressure from certain quarters for him to seek a third term.\nHe eulogized the author, Sen. Ken Nnamani who he described as uncommon patriot and nationalist who stood strong in the face of pressure from the political lackeys of former president Olusegun Obasanjo who were bent on smuggling the third term agenda into the constitution through a backdoor.\nAlso speaking at the event, former Minister of defence, Theophilus Danjuma while commending the author, described the book as a text book for young Nigerians who are aspiring to lead a “difficult nation like Nigeria.”"
  },
  {
    "headline": "Jigawa Cholera Outbreak: Over 500 Persons Dead In Four Months",
    "summarized_story": "Over 500 people have been confirmed dead within four months, following the outbreak of Cholera in Jigawa State, Northwest Nigeria.\nTwenty-two of the 27 local government areas in Jigawa are said to be battling cases of cholera.\nThe state capital Dutse, as well as Birninkudu and Hadejia, are the worst hit by the outbreak.\n﻿“We have received over 1.4 million doses (of vaccine) from the Federal Government through the World Health Organisation (WHO),” said Ibrahim.\nAccording to the World Health Organisation, researchers have estimated that each year, there are 1.3 to four million cases of cholera and 21,000 to 143,000 deaths are recorded."
  },
  {
    "headline": "Buhari To Ogoni Leaders: Sensitise Indigenes On Value Of Protecting Pipelines, National Assets",
    "summarized_story": "President Muhammadu Buhari has urged Ogoni leaders to sensitise indigenes on the value of protecting national assets like pipelines and other oil installations, saying willful damages usually create more havoc on their environment and hamper development in the area.\n“The unfortunate incidents of the early 1990s leading to the loss of lives of distinguished sons of Ogoni Land and the collateral judicial processes are indelible in our memories.\n“Despite the grievous circumstances, the Federal Government will consider the request for the grant of pardon to finally close the Ogoni saga,’’ President Buhari noted.\nNPDC will lay a broad-based programme for the emergence of a new Ogoni Land for the benefit of the Ogoni people and Nigeria as a whole,’’ he added.\nGiniwa, thanked President Buhari for various interventions in the area, particularly on clean-up of the environment."
  },
  {
    "headline": "FG Accuses Nnamdi Kanu Of Inciting Attacks That Killed 175 Security Personnel, Several Others",
    "summarized_story": "The Federal Government has accused the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu, of using Radio Biafra to instigate violence that led to the death of at least 175 security personnel and several other citizens.\nAccording to Malami, such assaults include attacks on security personnel, police stations, security formations, and the destruction of properties of the Independent National Electoral Commission (INEC) and private citizens.\nHe said 175 security operatives – 128 policemen, 37 military personnel, and 10 other security operatives – were killed in the attacks.\nHe added that Kanu also played a role in the violence recorded during the EndSARS protests in 2020.\n“The EndSARS protests of October 2020 played into the sinister plans of Nnamdi Kanu, whereby he seized the protests through subversive and inciting online broadcasts and actively commanded and directed attacks on security personnel and facilities,” Malami said."
  },
  {
    "headline": "There Is A Link Between Igboho And Terrorism Financier, Says FG",
    "summarized_story": "The Nigerian Government says it has established a connection between Yoruba nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho, and a firm being investigated for terrorism.\nAttorney-General of the Federation (AGF) and Minister of Justice, Abubakar Malami, stated this at a news briefing in Abuja on Friday.\n“Investigation reveals that Adesun International Concept Ltd (belonging to Igboho) transferred the sum of N12,750,000 to Abbal Bako & Sons,” the AGF said.\n“It might be recalled that Abbal Bako & Sons and its promoter, Abdullahi Umar Usman, are suspects in the ongoing joint terrorist financing investigation.\n“Abdullahi Umar Usman is by way of financial transaction connected to Surajo Abubakar Muhammad (who was sentenced to life imprisonment in UAE on charges of financing terrorism [Boko Haram])."
  },
  {
    "headline": "Gunmen Kidnap Two Sisters In Ondo",
    "summarized_story": "Some men suspected to be kidnappers have abducted two little girls from their parents’ car in Akure, Ondo State capital.\nThe gunmen attacked at the entrance to the house when the mother of the victims was opening the gate to drive into their compound.\nIt was gathered that the kidnappers came in a car, snatched the car key from the mother of the kids and fled with the car, abandoning their own car.\nThe Public Relations Officer of Ondo State Police Command, DSP Funmilayo Odunlami confirmed the incident to Channels Television on Saturday.\nAlso, four members of a family, including a father, his two children, and another family member were kidnapped earlier this month at Iju-Itaogbolu in Akure North Local Government Area of Ondo state."
  },
  {
    "headline": "NAF Aircraft sustain operations around lake Chad",
    "summarized_story": "The Nigerian Airforce(Operation Hadin Kai struck Iswap/ Boko Haram terrorists on an island in the tumbuns on lake Chad and at Malam Fatori.\nReports reaching us say three aircraft were scrambled and observed a gathering of about twenty boats with at least five suspected terrorists in each boatThe airforce has confirmed that there is a high concentration of insurgents hibernating in the Area.\nThe director of public relations and information Air commodore Edward Gabkwet said the army, Navy and other security AGencies will sustain operations until that corridor is free of all terrorists"
  },
  {
    "headline": "Zamfara Govt distributes relief items to 31 victims of bandits attack -",
    "summarized_story": "Zamfara State Government has donated relief items to thirty one Victims of Bandits attack in Ruwan Doruwa community in Maru local government area of the state.\nThe items donated to the Victims includes Food stuff among other thingsInspecting the distribution of the relief items, the Commissioner for Humanitarian affairs and Disaster Management Faika Ahmad enjoin the beneficiaries to make judicious use of the items , adding that Government is saddened by the unfortunate incident of attack on their Communities.\nIn a related development, authorities in Zamfara have described patients with psychiatric issues as most vulnerable that requires topmost social attention by all asunderAgain, the state Commissioner for Humanitarian affairs and Disaster management Faika Ahmad stated this while presenting food items to psychiatric patients at the Zamfara state Psychiatric Hospital in Anka local government areaDirector of Information of the Ministry Bashir Kabiru Ahmed Confirm the development to newsmen in GusauHe said, the state government through the ministry is committed to cushion the hardship faced by Victims of Armed Bandits attack ,Natural and man made disaster and the vulnerable Persons in the societyMrs. Fa’ika also appealed to the general public especially the well to do individuals to always support and assist psychiatric patients both on hospital admission and in the Communities with a view to improving their mental healthConsumption of Illicit and prohibited drugs in many cases experts say are the root causes of mental illnessReceiving the donation of the food items on behalf of the Hospital, the Executive Chairman Zamfara State Hospital Services Management Board Bashir Muhammad Maru appreciates the gestureDr. Maru applaud the ministry for taking into consideration the plight of psychiatric patients in the stateHe also assures of due utilization of the commoditiesDr. Bashir Maru thanked the state government under the leadership of Governor Bello Matawalle for reaching out to the needy through the ministry of Humanitarian affairs and Disaster Management."
  },
  {
    "headline": "Just In: Kaduna-Abuja train services to resume Saturday",
    "summarized_story": "The Managing Director of the Nigeria Railway Corporation, NRC, says the Abuja-Kaduna train services will resume on Saturday, October 23rd with four trips.\nTrain service on the route was suspended on Thursday following an attack on Kaduna bound train.\nIt’s still unclear who is behind Wednesday night’s attack on the rail track, but intelligence officials noted that terrorists loyal to the ISWAP and Ansaru faction of Boko Haram have been moving into Kaduna State.\nMeanwhile, commuters are calling for deployment of more security personnel on the Kaduna-Abuja highway which is the major option available for many.\nMany people had resorted to using the train following increased security concerns on the highway."
  },
  {
    "headline": "BREAKING: Lady-K, other aide of Sunday Igboho released from DSS detention -",
    "summarized_story": "The two remaining aides of the Yoruba nation agitator, Abibat Amudat popularity known as Lady-K and Noah Oyetunji, have been released from DSS custody.\nLead counsel for the accused, Pelumi Olajengbesi made this known in a statement on his Facebook page on Friday.\nHe said the matter is still pending at the court, the legal team will not be making further statement on the issue.\n“This is to officially announce the release of Amudat Babatunde Abibat AKA Lady-K and Jamiu Noah Oyetunji, the remaining two Sunday Igboho’s aides, from the State Security Service Custody today-22nd October, 2021.\n“While the matter is still a subject of litigation, we shall have no comment further on this for now,” Olajengbesi wrote."
  },
  {
    "headline": "Tunisia Imposes Covid Vaccine Pass on Tunisians and All Foreign Visitors",
    "summarized_story": "Tunisia is imposing COVID-19 vaccine passes on Tunisians and all foreign visitors, a presidential decree showed on Friday.\nThe decree showed that the jobs of employees who did not receive vaccination in the public and private sectors will be suspended until the vaccine pass is presented.\nThe vaccine pass will also be a necessary document for travelling abroad.\nIt will also be given to foreign visitors who present a certificate of vaccination upon arrival.\nTunisia last month entirely lifted its nightly curfew after about a year in force, as outbreaks of the virus diminished."
  },
  {
    "headline": "US Supreme Court Takes Up Texas Abortion Case, Lets Ban Remain",
    "summarized_story": "The US Supreme Court on Friday agreed to hear on Nov. 1 a challenge to a Texas law that imposes a near-total ban on the procedure and lets private citizens enforce it – a case that could dramatically curtail abortion access in the United States if the justices endorse the measure’s unique design.\nThe justices took up requests by President Joe Biden’s administration and abortion providers to immediately review their challenges to the law.\nThe measure bans abortion after about six weeks of pregnancy, a point when many women do not yet realize they are pregnant.\nLiberal Justice Sotomayor dissented from the court’s deferral of a decision on whether to block enforcement of the law while the litigation continues.\nSotomayor said the law’s novel design has suspended nearly all abortions in Texas, the second most populous U.S. state, with about 29 million people."
  },
  {
    "headline": "Watch Nigeria VP Osinbajo’s Speech at the 6th Year Anniversary of Future Assured Initiative – Arise News",
    "summarized_story": "More than 700 students and 45 teachers have benefited from the Education Empowerment Project, Future Assured.\nThe initiative is the brainchild of Aisha Buhari, Nigeria’s First Lady.\nIt focuses on health advocacy, women and youth empowerment.\nAs the Initiative marks its 6th anniversary, it says more women and children have received tangible healthcare among other benefits."
  },
  {
    "headline": "Baldwin Was Told Gun Was ‘Cold’ Before Movie Set Shooting",
    "summarized_story": "He walked back in and handed it to the film’s star, Alec Baldwin, assuring him it was safe to use because it didn’t have live ammo.\n“Cold gun,” Halls yelled.\nInstead, when Baldwin pulled the trigger Thursday, he killed cinematographer Halyna Hutchins and wounded director Joel Souza, who was standing behind her.\nThe gun was one of three that the film’s armorer, Hannah Gutierrez, had set on a cart outside the building where a scene was being acted, according to the records.\nHalls grabbed the gun from the cart and brought it inside to Baldwin, unaware that it was loaded with live rounds, a detective wrote in the search warrant application."
  },
  {
    "headline": "Watch Nigeria First Lady Aisha Buhari’s Speech at the 6th Year Anniversary of Future Assured Initiative",
    "summarized_story": "More than 700 students and 45 teachers have benefited from the Education Empowerment Project, Future Assured.\nThe initiative is the brainchild of Aisha Buhari, Nigeria’s First Lady.\nIt focuses on health advocacy, women and youth empowerment.\nAs the Initiative marks its 6th anniversary, it says more women and children have received tangible healthcare among other benefits."
  }
]