[
  {
    "headline": "MURIC tackles Turkish president over terrorist comments",
    "summarized_story": "The Muslim Rights Concern have tackled the President of Turkey, Recep Tayyip Erdoğan over his comments regarding the presence of Turkish terrorists in Nigeria.\nMURIC’s statement comes after Erdoğan claimed the terrorists who tried to carry out a coup in his country were present in Nigeria during his official visit to president Buhari on Thursday.\nThe statement read in part, “We take the Turkish president’s allegation that there are Turkish terrorists in Nigeria with a pinch of salt.\nBut that does not confer on him the right to label the opposition in his country as terrorists and to haunt them all over the place.\n“Neither should Erdogan’s humongous Muslim hero image becloud nor diminish MURIC’s commitment to protecting Allah-given fundamental human rights of Muslims in Nigeria, be it, individual or group."
  },
  {
    "headline": "Ministry postpones 2021 digital economy conference",
    "summarized_story": "The Federal Ministry of Communications and Digital Economy has announced the postponement of the 2021 Digital Nigeria Conference, Exhibition and Awards earlier scheduled to hold from October 25-27.\nUmar said that a new date for the event would be communicated in no distant future.\nShe said, “The event, formerly known as e-Nigeria International Conference and Exhibition is the flagship technology event in the Nigerian digital economy sector.\n“The conference themed ‘Digital Transformation: A Pathway to Sustainable Digital Economy'” is aimed at addressing Nigeria’s technological challenges in achieving sustainable socio-economic development.\n“The ‘Digital Nigeria Day’ which is a day designated to promote the development of the Digital Economy in Nigeria will still be celebrated on Sunday, October 24."
  },
  {
    "headline": "Motorists, travelers stranded as bridge collapses in Delta",
    "summarized_story": "By Festus Ahon, ASABAHUNDREDS of motorists and travelers were Friday, stranded, following the collapse of Umutu bridge along Agbor- Abraka-Eku road in Ukwuani Local Government Area, Delta State.\nMotorists and travelers lamented over the sad situation obviously confused on the next step to take as at the time of filling in this report.\nThe deplorable condition of federal road has been on the news, with report of the road project already awarded for reconstruction by the federal government.\nDeputy Speaker of the Delta State House of Assembly, Chief Ochor Christopher Ochor who hails from the area, regretted that the federal government had not given such an important road the desired attention.\nOchor who spoke to our Correspondent, described the collapsed of the bridge as unfortunate and sympathized with stranded motorists and travelers for the pains it may have caused them."
  },
  {
    "headline": "Don’t indulge in crime to survive present economic hardship, Hezekiah tells Nigerians",
    "summarized_story": "By Nwabueze Okonkwo, OnitshaTHE Founder/General Superintendent of Living Christ Mission, LCM, Professor Daddy Hezekiah (MFR), (JP), (Ambassador of Peace) and (International Mayor of Peace), has charged Nigerians not to use the present economic hardship in the country as an excuse to indulge in ritual killings, robbery, Obtaining by false Pretence, OBT, cultism, kidnapping and other vices.\nHe said the fact that our present leaders did not create job for the teeming Nigerians to be gainfully employed should not be used to justify any form of criminality in the country.\nHezekiah, the Proprietor/Chancellor of Hezekiah University, UNIHEZ who spoke during a thanksgiving service of the Temple Mothers of LCM at their 37th anniversary celebration, however acknowledged that Nigerians are witnessing serious economic hardship and security challenges under the present Muhammadu Buhari regime but should not be used as a yardstick to take to crime.\nHighlights of the ceremony were the cutting of the 37th annuversary cake and the conferment of national patronship award to Hezekiah by the Umuada Igbo in Nigeria and in the Diaspora.\nUmuada Igbo also conferred Chinenyeugwu titles on Princess Hephzibah Favour Chukwunazaekpere"
  },
  {
    "headline": "Hoodlums attacked us with petrol bombs, injured one – Imo Police",
    "summarized_story": "The command said the hoodlums came in five vehicles and three motorcycles, and shot at the police officers at duty but that the officers responded adequately.\nBut in the process of the gun battle the Police said one of the officers was injured and was taken to an undisclosed hospital for treatment.\nIt added that the hoodlums only succeeded in putting fire in the building but were prevented from looting the arms and amunitions in the police station.\n“The Commissioner of Police, Imo State Command, CP Rabiu Hussaini psc, commended the officers and men of the division for their gallantry and urged them to sustain the tempo.\nAlso to assist them with credible information that will lead to the arrest of the fleeing bandits,” Police said."
  },
  {
    "headline": "2023: 16 APC govs back Tinubu’s presidential ambition — Dayo Adeyeye",
    "summarized_story": "….As Arewa youths want ex-gov adopted sole candidateBy Dapo Akinrefon & Rotimi OjomoyelaNATIONAL Chairman, South-West Agenda for Bola Tinubu’s presidential ambition, codenamed SWAGA 2023, Mr. Dayo Adeyeye, yesterday, disclosed that 16 All Progressives Congress, APC, governors are covertly supporting the presidential aspiration of the former Lagos State governor.\nAdeyeye, a former Minister of Works (state), said this while inaugurating the factional executives belonging to SWAGA group across the 16 local government areas of Ekiti State.\nThe former minister said: “Bola Tinubu will be the next President of this country and one of us will become the governor in Ekiti State.\n“APC leaders and members across board are using their money to fund SWAGA.\n“It is a fact that Tinubu is a champion for progress and development as it was evident with his antecedents while he was the Governor of Lagos State."
  },
  {
    "headline": "Gana heads committee as Obadiah Mailafia burial begins Nov 4",
    "summarized_story": "By Chris Ochayi, AbujaFORMER Minister of Information, Professor Jerry Gana, has been appointed to head the Burial Steering Committee for the late Dr. Obadiah Mailafia.\nRecall that Dr. Mailafia, a former Deputy Governor of the Central Bank of Nigeria, CBN, died on September 19, 2021 at the University of Abuja Teaching Hospital, Gwagwalada, in the Federal Capital Territory, FCT.\nDr. Gideon Para-Mallam, for the burial steering committee, said the funeral programme will commence on November 4, 2021.\n“Since the transition of Dr. Mailafia to eternal glory, religious, political and community leaders, among others, have paid personal visits to the Abuja home of the Mailafias.\nWe thank everyone for identifying with the bereaved family and look forward to the scheduled funeral activities in bidding farewell cum paying last respects to Dr. Obadiah Mailafia.”Vanguard News Nigeria"
  },
  {
    "headline": "Famine looms as Kaduna farmers lament poor harvest",
    "summarized_story": "Kaduna residents, especially farmers, have raised an alarm that poor harvest resulting in insufficient foodstuff in markets, as well as an increase in prices, will negatively impact low-income earners.\n“Again, the Kaduna State Government in its wisdom suspended the bush markets and some major markets within Kaduna city.\nAlso, Alhaji Idris Yubangba who said he buys directly from farmers in some remote villages in Kaduna expressed sadness over the restriction of motorcyclists and tricycles in Kaduna State.\nHe said, “I penetrated some villages in Kaduna to buy food crops during harvest season in the past.\nChairman, Farmers Association, Kaduna State Chapter, Alhaji Umar Modugo noted that bandits have stopped farmers from going to farm this year."
  },
  {
    "headline": "2023: Osinbajo can’t abandon ambition he’s not declared – OGO",
    "summarized_story": "In a reaction to a report that Vice President Yemi Osinbajo has dumped his rumoured presidential bid, the National Convener of The Osibanjo Grassroots Organization (OGO), Sylvanus Foluso Ojo said that Osinbajo could not abandon an ambition he was yet to declare.\nOjo urged Osinbajo’s supporters to continue prevailing on the Vice President until he gives the presidential bid a thought in the interest of Nigeria.\n“The source was also quoted to have revealed that the Vice President had a change of heart following a visit to felicitate with the former Lagos State government and National Leader of the All progressives Congress (APC), Asiwaju Bola Tinubu at his Bourdillon, Lagos State home.\nOur group has in a different forum enjoined Professor Osinbajo to indicate interest in the 2023 presidential bid, and he is yet to respond to this appeal; saying that he abandoned such ambition before a declaration, therefore, suggests that someone is confusing the public.”OGO noted that the report was aimed at dissuading Osinbajo from declaring to contest in the 2023 presidential election.\n“The Osinbajo Grassroots Organisation (OGO) considers this a mind game, and ploy to dissuade the Vice President from exercising his democratic and constitutional rights as a leader with unique leadership skills and robust management style, assuming he chooses to give our pleas a thought."
  },
  {
    "headline": "How Boko Haram, bandits bombed Abuja-Kaduna train despite intel before attack",
    "summarized_story": "The incursion was carried out by Boko Haram and bandits, a joint operation that confirmed their collaboration in the North-West.\nIt stated how the mission was planned and executed by the Darussalam, an Arabic code word for Boko Haram.\nIn July, security agencies were informed that bandits were attending training conducted by Boko Haram and the Islamic State’s West Africa Province (ISWAP).\nSeveral bandits travelled from Zamfara State to attend drills in terrorist hideouts in Borno State, the Nigeria Immigration Service (NIS) revealed.\nA memo titled “Movement of Armed Bandits from Zamfara to Borno for Intensive Boko Haram Training” was signed by ACG Usman Auna."
  },
  {
    "headline": "NYSC discharges 1091 corps members as 12 get extensions in Osun",
    "summarized_story": "The National Youth Service Corps (NYSC) in Osun State has discharged a total of 1091 members of the 2020 Batch B Stream 1a and 1b who have satisfactorily completed the one-year mandatory national service.\nThis was made known by the Osun State Coordinator of the NYSC, Mrs. Winifred Shokpeka, during a low-key ceremony that took place Thursday across the 30 local government areas and an area office of the state.\nShe also revealed that a total number of four absconders were recorded for the stream and 12 corps members had their service year extended.\nWhile expressing satisfaction with the conduct of the 2020 Batch B Stream 1a and 1b corps members, Shokpeka stated that she was optimistic that the subsequent service year is going to be smooth.\nWe say thank you.”She disclosed that the same level of commitment and dedication to service and welfare that has always been prevalent in the state was going to be extended to the serving corps members and the 2021 Batch C Stream 1 prospective corps members who are currently undergoing their orientation course."
  },
  {
    "headline": "Sensitize your people on values of protecting pipelines, national assets – Buhari tells Ogoni leaders",
    "summarized_story": "“You will need to educate the people of Ogoni land and the region more than when pipelines are broken, the damage is more to the immediate environment and the people.\nHe said the government would bring to a close all pending issues on sons of Ogoni Land.\n“The unfortunate incidents of the early 1990s leading to the loss of lives of distinguished sons of Ogoni Land and the collateral judicial processes are indelible in our memories.\nNPDC will lay a broad-based programme for the emergence of a new Ogoni Land for the benefit of the Ogoni people and Nigeria as a whole,’’ he added.\nThe President also appreciated the leaders for recognition of the Federal Government’s efforts to clean up the area and stimulate more economic activities."
  },
  {
    "headline": "Babies conceived by women above 35 years risk Down syndrome – Therapist",
    "summarized_story": "Women who conceive pregnancies after the age of 35 years stand the risk of being delivered of babies with Down syndrome, a speech therapist, Maryam Ibrahim-Maifada, has said.\n“The older the mother, the higher the risk of having a baby with Down syndrome,’’ Ibrahim-Maifada told the News Agency of Nigeria (NAN) in Kaduna on Friday.\nThey are more likely to develop slowly, and are more at risk of some medical conditions, she said.\nShe listed other medical conditions associated with Down syndrome to include heart problems, thyroid abnormalities, auditory and vision problems and low fertility rate males.\nThe possibility of risk of their children having the condition is between 35 per cent and 50 per cent,’’ Ibrahim-Maifada."
  },
  {
    "headline": "216 students bag 1st Class degrees at Covenant University",
    "summarized_story": "The Vice-Chancellor of Covenant University, Ota, Ogun, Prof. Abiodun Adebayo, says 216 students bagged First Class Honours in the 2020/2021 academic session.\nAdebayo said this on Friday in Ota during the institution’s 16th Convocation Ceremony, the Conferment of Doctorate Degrees and Presentation of Prizes.\nThis comprised 216 students who made first class honours; 719 second class upper honours; 435 second class lower; third class 30 and 281 post graduate students.\nThe vice-chancellor added that the institution has been working to get accreditation for all its programme.\n- Advertisement -“The covenant university is on a mission to restore dignity of black race which is attainable through quality research,” he said."
  },
  {
    "headline": "Abusive use of antibiotic causes offensive vaginal odour – gyneacologist",
    "summarized_story": "Abusive use of antibiotic causes offensive vaginal odour – gyneacologistA gyneacologist, Dr Prosper Igboeli, has advised women to shun the abuse of antibiotic drugs for their own health benefit.\nThe medical expert said that women, who stopped the use of oral contraceptive, also experience increased vaginal discharge.\nAccording to him, increased vaginal discharge has been recorded against women who stopped the use of the oral contraceptive.\n- Advertisement -“They have undergone some course of antibiotics and contracted venereal diseases following unprotected and unsafe sexual practices,” he said.\nIgboeli said that vaginal discharge with offensive odor can cause a husband not to engage in sexual activities with the wife, which may trigger marital crisis."
  },
  {
    "headline": "Imo police seek residents’ support to arrest assailants who burnt station",
    "summarized_story": "Police in Imo on Friday in Owerri appealed to residents to assist with information that could lead to the arrest of those who attacked Isiala Mbano police station on Thursday.\nAssailants went to the station in five cars and three motorcycles at about 6 p.m. on Thursday and threw petrol bombs at the building.\n- Advertisement -He stated also that one officer was injured in the attack, but no arm was lost.\nAccording to Abattam, the Commissioner of Police in the state, Rabiu Hussaini, appealed to residents to help to protect police stations and assist the police to arrest the fleeing assailants.\n- Advertisement -CP Hussaini commended officers and men of the division for their gallantry in repelling the attack and urged them to sustain the tempo."
  },
  {
    "headline": "Nnamdi Kanu pleads not guilty, says Nigerian court can’t try him",
    "summarized_story": "Kanu stated this through his counsel, Ifeanyi Ejiofor, shortly after he was re-arraigned on the amended charge before Justice Binta Nyako of the Abuja division of the Federal High Court, yesterday.\nKanu, in the preliminary objections filed by counsel said: “I also know as a fact that jurisdiction is extrinsic to adjudication.\n“That counts 1, 2 and 3 of the amended charge were brought under a non-existent law.\nThat counts 5, 6 and 7 of the amended charge do not disclose an offence known to law.\nThat there is no proof of evidence attached to the amended charge filed against the defendant."
  },
  {
    "headline": "Buhari to security chiefs: Nothing must stop Anambra election",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has given marching orders to the nation’s security chiefs that nothing must be allowed to temper with the November 6th gubernatorial election in Anambra State.\nThis is as the National Security Adviser, General Babagana Monguno (retd) disclosed that the new leader of the Islamic State of West African Province, ISWAP, Mallam Bako was killed two days ago by the military.\nMonguno, who briefed on the outcome of the meeting of security chiefs, said President Buhari gave the armed forces the marching order in response to the heightened security challenges in Anambra state.\n“The President has directed that under no circumstances will anything be allowed to stop the elections from taking place successfully.\n“Two days ago, the man who succeeded him, one Malam Bako, one of the prominent leaders of the Shura Council of the Islamic State of West African Province, was also taken out."
  },
  {
    "headline": "INEC hails NASS over election technology",
    "summarized_story": "From Romanus Ugwu, AbujaThe Independent National Electoral Commission (INEC) has lauded the National Assembly for empowering the agency to determine and deploy appropriate technology in future elections.\nThe commission appreciates the decision of the National Assembly to empower INEC to determine and deploy appropriate technology in future elections.\nFor us in INEC, this is one of the progressive decisions by our National Assembly.\n“The Electoral Act is one of the most important laws in any democracy.\nIn all jurisdictions, the Electoral Act provides more detailed provisions to govern the conduct of elections and the electoral process."
  },
  {
    "headline": "Rivers mulls criminal proceedings against Saipem",
    "summarized_story": "Rivers State Government is to initiate criminal proceeding against Saipem Contracting Nigeria Limited for breach of trust, which led to abandonment of the state’s gas turbine generator unit and accessories in The Netherlands since 2012.\nThe decision to file criminal proceeding was taken at the 15th Executive Council meeting presided over by Governor Nyesom Ezenwo Wike at the Government House, Port Harcourt, yesterday.\n“Consequently, the council unanimously directed the Attorney General of Rivers State to file criminal proceeding against Saipem Contracting Nigeria Limited for her role in this ugly incident.”The Council also approved the reconstruction of two roads, Oyigbo-Okoloma and Chokocho-Igbodo totaling 46.5km.\nCommissioner for Finance, Isaac Kamalu, said the council also approved medium term expenditure framework 2022-2024.\nSpecial Adviser to the Governor on Special Projects, Alabo George-Kelly said the council approved the award of contract for the construction the Rivers State Magistrate Court Complex at the cost of N8.1 billion."
  },
  {
    "headline": "Senators talk tough over embargo on employment",
    "summarized_story": "From Fred Itua, AbujaSenators, yesterday, lambasted the Federal Government over its embargo on employment despite the yearly increases in recurrent expenditure.\n“Honestly speaking, time bomb is ticking because of the doors shut out against millions of youths seeking employment through the embargo.\n“Making it worrisome is the fact that despite the policy (embargo) since 2018 , recurrent expenditure components of yearly budget have been increasing.\nIn 2018, it was N3.5 trillion, N4 trillion in 2019, N4.5 trillion in 2020, N5.6 trillion 2021 and N6.83 trillion in the projected N16.39 trillion 2022 budget.\n“It is bad for recurrent expenditure to be increasing on yearly basis without increase in the number of workforce through required recruitments."
  },
  {
    "headline": "Buhari: Under No Circumstances Will Anambra Election Be Disrupted",
    "summarized_story": "“The president has made it very clear that the armed forces, security agencies, and law enforcement agencies must make sure that the elections take place.\nIf it means overwhelming the entire environment with the presence of security agencies.\n“There are so many implications for elections to be sabotaged by non-state actors.\n“The mere thought that a group of non-state actors want to portray his government as not being able to be firm is totally out of the question,” he said.\nOf course, the armed forces and security agencies have done so much in the last couple of months."
  },
  {
    "headline": "Yakubu Nudges Lawmakers to Speedily Amend Electoral Act, Warns Time Critical",
    "summarized_story": "This is just as the Commission, yesterday, released the notice of the governorship election in Anambra State slated for November 6.\nWhile highlighting the fundamental role of the Electoral Act in the conduct of the election, Yakubu said the Act was one of the most important laws in any democracy.\nHe stated that one of the unique aspects of the current amendment of the Electoral Act was that it started well ahead of the forthcoming general elections, unlike previous exercises which came too close to elections.\nFirst is the constitution, followed by the Electoral Act.\nIn all jurisdictions, the Electoral Act provides more detailed provisions to govern the conduct of elections and the electoral process."
  },
  {
    "headline": "NRC Halts Abuja-Kaduna Train Service over Explosion",
    "summarized_story": "“However, the situation has been brought under control by a relieved locomotive that rescued the train to Rigasa Station, Kaduna State.\n“We are also pleased to inform the public that there were no reported casualties or injuries to either the passengers or Train Crew.\n“Efforts are currently ongoing to ensure that the train services along the Kaduna-Abuja route are fully restored,” he added.\nThey planted an explosive that damaged the rail track and shattered the windshield of the train engine.\nJust this morning, an Abuja-Kaduna passenger train was attacked by criminals, depriving Nigerians the services it provides."
  },
  {
    "headline": "FIRS Proposes Road Infrastructure Funding Scheme for Nigeria",
    "summarized_story": "Oluchi ChibuzorThe Federal Inland Revenue Service (FIRS) has said it is proposing the introduction of Road Infrastructure Tax in Nigeria, to make the informal sector contribute to building a modern society.\nNami said the proposed Road Infrastructure Tax to be administered by the federal agency, would provide government with adequate funding for road construction, rehabilitation, and maintenance, as well as providing the needed security for roads in the country.\nOn the challenges facing the service for delivering on its mandate, he said “Crude oil production has been limited by OPEC quota.\nNigeria’s OPEC quota as at July 2021 was about 1.5mbpd as against its crude oil production budget of 1.8mbpd.\nNami added that the service created 10 Value Added Tax (VAT) Regional Coordination Offices across the country to drive collection of VAT."
  },
  {
    "headline": "Kyari: Why Nigeria Must Balance Financial, Energy Security",
    "summarized_story": "According to the NNPC boss, Nigeria must strike a balance between achieving financial security, a critical driver of the nation’s survival as well as energy security and sustainability.\n“Is Nigeria ready, because they want to have sustainable energy, cleaner energy, abandon this resource that we have and move to other ones?\n“So the balance between financial security and energy security is a very critical national issue.\nThis energy is going to come from a variety of sources, and the debate and the cordial invitation for all of us is that we would try to do what we call clean energy, sustainable energy, which are all wonderful.\nNow, while trying to keep our eyes on making sure that we have sustainable energy, we also have to keep our eyes on making sure that we ensure our country’s energy security."
  },
  {
    "headline": "EXCLUSIVE: Fresh Law Suits Loom For Nigerian Billionaire, Michael Adenuga After Refusing To Pay Multi-million Dollar Companies’ Debts",
    "summarized_story": "With this personal fortune, Adenuga Jr is very unlikely to be hurting for cash.\nIn 2016, ConOil was pursued by creditors for a debt of over $140.5 million owed to two foreign companies and one local company.\nIt also mentioned that it will seek court orders to seize assets including corporate and private bank accounts.\nIn September, Nigeria’s tax authority FIRs sealed off the offices of ConOil at the Mid Adenuga Towers building over non-payment of taxes.\nSee Also Opinion How Otunba Mike Adenuga Impoverished Conoil PensionersLittle has happened since then to restore the confidence of the regulators or international partners in ConOil and Adenuga."
  },
  {
    "headline": "EXCLUSIVE: Fresh Law Suits Loom For Nigerian Billionaire, Michael Adenuga After Refusing To Pay Multi-million Dollar Companies’ Debts",
    "summarized_story": "With this personal fortune, Adenuga Jr is very unlikely to be hurting for cash.\nIn 2016, ConOil was pursued by creditors for a debt of over $140.5 million owed to two foreign companies and one local company.\nIt also mentioned that it will seek court orders to seize assets including corporate and private bank accounts.\nIn September, Nigeria’s tax authority FIRs sealed off the offices of ConOil at the Mid Adenuga Towers building over non-payment of taxes.\nSee Also Opinion How Otunba Mike Adenuga Impoverished Conoil PensionersLittle has happened since then to restore the confidence of the regulators or international partners in ConOil and Adenuga."
  },
  {
    "headline": "Imo Community Raises N1.5million To Fix Road Inaugurated By Buhari Amid Fanfare In September",
    "summarized_story": "Some youths from Nekede Community in Owerri-West Local Government Area of Imo State have raised over N1.5 million to rehabilitate Nekede-Umuoma-FUTO-Ihiagwa trunk “B” Road.\nThe road was one of those said to have been constructed by the Governor of Imo State, Senator Hope Uzodinma and inaugurated by President Muhammadu Buhari, along with others amid fanfare during his recent visit to the state.\nHe added that there are over 50,000 people from all parts of Nigeria and beyond living in the community.\nAccording to him, the road was “awarded, constructed, completed and commissioned on the internet” during the tenure of Ikedi Ohakim between 2007 and 2011.\nOguoma called on the government, philanthropists, non-governmental organisations, and residents to assist in the ongoing rehabilitation of roads in the area."
  },
  {
    "headline": "Imo Community Raises N1.5million To Fix Road Inaugurated By Buhari Amid Fanfare In September",
    "summarized_story": "Some youths from Nekede Community in Owerri-West Local Government Area of Imo State have raised over N1.5 million to rehabilitate Nekede-Umuoma-FUTO-Ihiagwa trunk “B” Road.\nThe road was one of those said to have been constructed by the Governor of Imo State, Senator Hope Uzodinma and inaugurated by President Muhammadu Buhari, along with others amid fanfare during his recent visit to the state.\nHe added that there are over 50,000 people from all parts of Nigeria and beyond living in the community.\nAccording to him, the road was “awarded, constructed, completed and commissioned on the internet” during the tenure of Ikedi Ohakim between 2007 and 2011.\nOguoma called on the government, philanthropists, non-governmental organisations, and residents to assist in the ongoing rehabilitation of roads in the area."
  },
  {
    "headline": "Zamfara APC Party Social Media Handler And Critic Of Governor Matawalle Arrested, Taken To Undisclosed Location",
    "summarized_story": "Operatives of the Zamfara State Police Command’s Counter-Terrorism Unit have allegedly arrested a young man, Mugira Yusuf, the social media manager for the All Progressives Congress (APC) in the state, at Anguwar Dallatu in Gusau, the state capital.\nMugira was arrested while at the shop of one of his friends after an informant from the Zamfara State Government House visited the area, Daily Post reports.\nZamfara State Governor Bello MatawalleAccording to the report, the social media manager was at the shop of one of his friends, Sufiyanu Sani Gusau, popularly known as Sufi, when someone from the Zamfara State Government House started making some suspicious phone calls.\nSome people who witnessed the incident said the man who masterminded the arrest of Mugira left instantly and drove to the state Government House.\nFrom information gathered, Mugira Yusuf is a strong political supporter of the APC faction being led by former Governor Abdul Aziz Yari and has been a constant critic of the current government of Bello Mohammed Matawalle since 2019."
  },
  {
    "headline": "Igboho: I've not asked any politician to beg presidency on my behalf",
    "summarized_story": "Yomi Alliyu, counsel to Sunday Adeyemo, a Yoruba youth leader also known as Sunday Igboho, says his client did not authorise any politician to beg the presidency on his behalf.\nHe has since been in custody at a facility in Cotonou, Benin Republic.\nAdvertisement“Let the whole world be aware, especially the presidency, that Sunday Adeyemo is totally apolitical with no special love or hatred for any political party as he has friends in all.\n“He however respects the six elected governors of the south-west states as authentic representatives of his Yoruba race.\nAny document purportedly signed by Igboho or his wife endorsing, empowering or making anybody his mouthpiece other than his lead counsel should be disregarded and taken as fake."
  },
  {
    "headline": "Igboho: I've not asked any politician to beg presidency on my behalf",
    "summarized_story": "Yomi Alliyu, counsel to Sunday Adeyemo, a Yoruba youth leader also known as Sunday Igboho, says his client did not authorise any politician to beg the presidency on his behalf.\nHe has since been in custody at a facility in Cotonou, Benin Republic.\nAdvertisement“Let the whole world be aware, especially the presidency, that Sunday Adeyemo is totally apolitical with no special love or hatred for any political party as he has friends in all.\n“He however respects the six elected governors of the south-west states as authentic representatives of his Yoruba race.\nAny document purportedly signed by Igboho or his wife endorsing, empowering or making anybody his mouthpiece other than his lead counsel should be disregarded and taken as fake."
  },
  {
    "headline": "Nwodo: 2023 elections may be disrupted -- without restructuring",
    "summarized_story": "John Nwodo, former president-general of Ohanaeze Ndigbo, says the delay in restructuring the country may lead a mass boycott or disruption of the 2023 elections.\nAdvertisementSpeaking at the 14th Anthony Cardinal Okogie Foundation (ACOF) annual lecture themed, ‘Whither Nigeria: Restructuring, Secession or Status Quo’, organised by Knights of St. John International and Ladies Auxiliary (KSJI), Nwodo said restructuring is needed for the unity and development of the country.\nHe added that, sadly after the 1966 coup, the military created a unitary system for the country to suit its command structure.\nAdvertisementHe said this structure which should have been discarded was firmly established in the 1999 constitution.\nHe said for the country to make progress, the military imposed constitution must be replaced with a more people-inclusive document."
  },
  {
    "headline": "Nwodo: 2023 elections may be disrupted -- without restructuring",
    "summarized_story": "John Nwodo, former president-general of Ohanaeze Ndigbo, says the delay in restructuring the country may lead a mass boycott or disruption of the 2023 elections.\nAdvertisementSpeaking at the 14th Anthony Cardinal Okogie Foundation (ACOF) annual lecture themed, ‘Whither Nigeria: Restructuring, Secession or Status Quo’, organised by Knights of St. John International and Ladies Auxiliary (KSJI), Nwodo said restructuring is needed for the unity and development of the country.\nHe added that, sadly after the 1966 coup, the military created a unitary system for the country to suit its command structure.\nAdvertisementHe said this structure which should have been discarded was firmly established in the 1999 constitution.\nHe said for the country to make progress, the military imposed constitution must be replaced with a more people-inclusive document."
  },
  {
    "headline": "You can now pre-order Waziri Adio's memoir at Roving Heights",
    "summarized_story": "AdvertisementThe pre-order platform is now live on the website of Roving Heights, the nation’s most respected bookstore.\nJoshua Ocheja, the business manager of Cable Books, said the paperback goes for N5,000 per copy while the hardcover is N9,000.\nThe Arc of the Possible, which is the first publication of Cable Books, has 25 chapters spanning five sections and almost 300 pages.\nAdio was educated at the University of Lagos, Columbia University and Harvard University where he earned his BSc, MSc and MPA respectively.\nAdvertisementLaunched in October 2021, Cable Books is mandated to deploy non-fiction literature in the pursuit of Nigeria’s progress."
  },
  {
    "headline": "Baxi acquisition deal sees MFS Africa expand footprint into Nigeria",
    "summarized_story": "As the largest fintech interoperability hub in Africa, MFS Africa connects banks, telcos, and money transfer operators across over 35 countries via a single integration point.\nCapricorn will be called MFS Africa but its core product, Baxi, retains its name.\nMFS Africa was founded in 2009 by Dare Okoudjou, a Beninese national, while Nigeria-born Abudu started Capricorn in 2014, with Folu Majekodunmi.\nThe acquisition creates a larger, more versatile company that fuses interoperability between money operators and a super-agent network reaching the mass market.\nMFS Africa will also expand Baxi’s proposition for offline SMEs to select markets within its footprint."
  },
  {
    "headline": "Editi Effiong: father, writer, producer and tech bro",
    "summarized_story": "When asked how he would define himself, he responded with, “I’m a father, writer, producer, and tech bro.\nThe big picture: Editi Effiong is not your average guyMany people know Editi Effiong as the brains behind Anakle.\nAnakle Films’ theatrical releases, Up North and The Setup, were acquired by Netflix in 2019 and 2020 respectively.\nIn 2011, digital marketing didn’t have as much clout as it does now.\nEspecially knowing that you were going to put a lot of time and effort into building out Anakle Films’ brand?"
  },
  {
    "headline": "Who’s afraid of crypto-salaries?",
    "summarized_story": "Back in 2015, its current president, Muhammadu Buhari, campaigned on a promise to increase the value of the naira.\nThis plunge in the value of the naira has been majorly fueled by Nigeria importing more goods than it exports.\nWith 96% of the crypto value coming from outside the continent, this suggests that more Africans are receiving remittances via crypto.\nThis is the company battling the challenge that comes with paying employees in crypto, as legal barriers in many countries prevent this.\nSome of the barriers include the non-recognition of cryptocurrency as a legal tender and the challenge of calculating taxes when employees are paid in cryptocurrency."
  },
  {
    "headline": "I promise it’s funnier in Swahili…Kenyan Comedian Eddie Butita is Showing Netflix How Swahili’s Done",
    "summarized_story": "To roll out this project, the $25 billion company enlisted the help of celebrated Kenyan comic, Eddie Butita.\nButita is skilled at wielding digital technology in a market that’s grown so big that Netflix can’t ignore it.\nAccording to the Worldwide Mobile Data Pricing (2021) report from Cable, a British technology research firm, Kenya takes the lead as the most expensive country for mobile data in East Africa.\nViewing one hour of Netflix content on low resolution (480p) uses 300 MB of data per hour; in high resolution (1080p), Netflix uses 3 GB per hour.\nAt an average cost of $1.05 per GB of data, Netflix viewers in Kenya stand to pay anywhere from $0.32 to $3.15 to watch a one-hour show."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "What does the African fintech need?",
    "summarized_story": "The virtual event focused on fintech’s allure to investors, the benefits Africans derive from fintech start-ups, partnerships between banks and fintech startups, and the role of regulators in the industry.\nHowever, Agboola disagreed with that view, arguing that he sees a situation where fintech complement the works that banks do and vice versa, advocating for partnerships between banks and fintech.\nDeepening financial inclusion is high on the agenda of Nigeria’s Central Bank and Y’ello Digital Financial Services has been playing its part in helping the apex realize this goal.\nWith its wide network of over 150,000 MoMo agents, the organization offers financial services to customers.\nWith 54 countries in Africa, providing financial services to users comes with lots of regulatory hurdles in each country."
  },
  {
    "headline": "For as little as ₦1000, business management startup, BIZ301, wants to help you automate your business",
    "summarized_story": "Every small business owner is struggling.\nMy experience and my engagement with quite a number of small business owners taught me this.”And it was at this point that he arrived at his answer: digitising small businesses.\nAt this point, I sat at the drawing table and tried to understand the exact structure of small businesses.\nWith the employee and payroll function, the business owner automates the salary payment process.\nAs long as the small business owner is making money, BIZ301 makes money too, free user licence or not."
  },
  {
    "headline": "Yes, you have rights over your data, but only to an extent",
    "summarized_story": "The issuesUnder the Nigeria Data Protection Regulation 2019, a data subject has several rights over the use of their personal data.\nThis is in breach of the Nigerian Data Protection Regulations which protects the right of a data subject to rectification and erasure of their personal data.\nThe laws don’t say the right to rectification of data by the data subject must be done on the platform by the individual, or it must be achieved immediately.\nThe NDPR provides for situations that might be regarded as the lawful processing of a data subject’s data.\nBut what I do know is that it has prompted a very important discussion on data rights and how they can be abrogated."
  },
  {
    "headline": "We’re adapting to new global trends amid Covid-19 – PTI principal – Nigerian Observer",
    "summarized_story": "Dr. Adimula stated this in Warri on Tuesday during a press conference which was part of activities marking this year’s convocation ceremony coming up on Saturday, 23rd October, 2021.\nHe further stated that out of the number, 161 passed with Distinctions, while 810 graduated with Upper Credit.\nHe lauded the PTI Alumni for their immense contributions to the PTI project.\nOn collaborations, Dr. Adimula further said that PTI was collaborating with both national and international bodies in the energy and power sectors in realizing the vision of the Institute.\nHe, however, said the Institute was grossly under-funded as a result of the COVID-19 pandemic and the dwindling oil prices."
  },
  {
    "headline": "Obaseki, French govt partner to train 3,000 youths in creative sector – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki and the French Government have strengthened partnership to train not less than 3,000 youths in the creative and entertainment industry.\nDignitaries at the meeting include the Chief Executive Officer of Wazobia TV, Tatiana Moussalli Nouri and filmmaker, Stanlee Ohikuare, among others.\nDare said: “The meeting was to further discuss the partnership, which has been on for nine months.\n“Edo people between the ages of 16 and above are eligible to have access to these trainings,” she added.\nThe EdoJobsSkillUp app is a digital learning platform designed for creatives in the creative industry."
  },
  {
    "headline": "EndSARS Anniversary Protest: 33 Arrested Protesters Regain Freedom In Lagos – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – No fewer than 33 people arrested by the Lagos Police Command allegedly to have participated in the Wednesday Endsars anniversary protect at Lekki Toll gate have been set free by the security agency.\nOut of the 33 released by the law enforcement agency, 26 were said to have been picked at the Lekki Tollgate while seven others were apprehended by security agencies around Onikan axis of the state.\nIt is important for me to mention that we set up a panel after the protest last year.\nThe statement reads: “Indeed struggle pays as CP HAKEEM ODUMOSU, the Commissioner of Police of Lagos State bowed to pressure and released 33 peaceful protesters arrested at the Lekki Toll Gate.\nThe “Lekki 33” , as additional 7 persons were brought from Onikan to join the Panti 26 , were eventually released by 12pm midnight, 20th October, 2021."
  },
  {
    "headline": "‘Obaseki’s agric programmes’ll increase food production, address rising food prices, grow economy’ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has restated that the programmes and interventions of the Governor Godwin Obaseki-led administration in the agricultural sector will reset the state’s economy, increase food production and address rising food prices.\nAccording to him, “the Edo State Government has zero tolerance for hunger and is irrevocably committed to improving the livelihood of its people through the fight against hunger, poverty and malnutrition amongst its citizenry.\n“This year, a total of 444 hectares have been cultivated for rice grain production at Agenebode, Warraproductionke and Agbede.\nThe catfish production component of the programme is ongoing with the training and empowerment of 329 farmers producing over 400,000 catfish.\nThis involves the provision of production infrastructure and assets, including inputs,” he added."
  },
  {
    "headline": "Poll: Buhari orders massive deployment of security agents in Anambra",
    "summarized_story": "President Muhammadu Buhari has ordered a massive deployment of security agents in Anambra State to ensure peaceful conduct of the November 6 governorship election in the state.\nMr Monguno, a retired major general, said NCS observed that non-state actors had made attempts to frustrate the smooth conduct of the polls, following their violent activities in Anambra State.\nMr Baba had earlier deployed a new commissioner of police to Anambra State, after a spate of deadly gun attacks in the South-east state.\nThe president is firm, he wants a peaceful election in Anambra State.\nHe wants a free and fair election in Anambra State, that’s the president for you."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "BOC Gases changes name to Industrial and Medical Gases Nigeria Plc",
    "summarized_story": "Adebayo ObajemuThe Nigerian Exchange Limited, shareholders and the investing public has been notified that BOC Gases Nigeria Plc has changed its name to INDUSTRIAL AND MEDICAL GASES NIGERIA PLC.\nThe change of name is sequel to the purchase of 60% of BOC Gases Nigeria Plc, which was formerly controlled by BOC Holdings UK (a member of the Linde Group) by TY Holdings Limited.\nThis has also resulted in the change of the Company’s logo and trademark.\nThe Company has obtained a new certificate of incorporation from the Corporate Affairs CommissionFacebook Notice for EU!\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Northern Nigeria Flour Mills reports N8bn as turnover in six months",
    "summarized_story": "Adebayo ObajemuNorthern Nigeria Flour Mills (NNFM) on Thursday published its second quarter report for the period ended 30 September 2021.\nThe report shows significant improvement in the Company’s top line and bottom line figures, year on year.\nA turnover of N8.01 billion was reported for the six month period, up by 84.37% from N 4.34 billion reported the previous year.\nProfit after tax grew by 18.72% to N173.742 million from N146.342 million reported the previous year.\nEarnings per share (EPS) of the Company increased to 97 kobo from the EPS of 82 kobo declared the previous year."
  },
  {
    "headline": "Atiku, Utomi, others say Nigeria needs leader to restructure economy, tackle power sector decay",
    "summarized_story": "Atiku, who was presidential candidate of the PDP for the 2019 presidential election, also said that Nigeria needed a leader that would develop the country through restructuring and put the country in the positive corner of global economic of nations.\nAtiku said Nigeria needed a leadership that understood technology and was willing to reform the economy through digital innovation.\nAccording to him, beyond having a technology enthusiast as President, the country also needed a leader that would unify, restructure and guarantee the security of its citizens.\n“Nigeria needs a leadership that can unify the country, bring stability, restructure the country, reform the economy and bring about cohesion to the nation”, he said.\nHe said, “We cannot make progress, as a nation, until we deal with power, because it is so fundamental."
  },
  {
    "headline": "French govt to invest $70m in Nigeria’s renewable energy",
    "summarized_story": "The government of France, through the French Development Agency/Agence Francaise de Developement (AFD), has agreed to invest $70 million into renewable energy projects in Nigeria.\nAccording to Igwe, the $70 million fund will be disbursed to renewable energy stakeholders through Access Bank Plc and United Bank for Africa (UBA).\nIgwe disclosed that the fund would be used to boost investment into Nigeria’s renewable energy space and help fight pollution, adding that SUNREF was committed to sponsoring projects that were innovative, energy-efficient and renewable in the continent.\n“The investment needed is enormous and $70 million does not even begin to cover it, but it does help start things” he said.\n“Renewable energy provides assess to alternative sources of energy that are more sustainable and reduce dependence on fossil fuels,” he said"
  },
  {
    "headline": "Kanu’s Trial: Hoodlums Storm Court Premises With Petrol Bombs, Attack Sowore",
    "summarized_story": "Sowore was still talking to security operatives, who denied him access into the court when some boys, who looked unkempt arrived.\nIt took protest by journalists and lawyers present for security agents to reluctantly intervene and stop the hoodlums from beating Sowore.\nPrior to the attack, Sowore had told journalists that he was in court to show solidarity to Kanu and ask the officials at the court registry why he had not been arraigned.\n“Also I am here to witness the trial of my friend, Nnamdi Kanu.\nSo Nnamdi Kanu is not wrong and his trial should not be in secret."
  },
  {
    "headline": "Kanu’s Trial: Hoodlums Storm Court Premises With Petrol Bombs, Attack Sowore",
    "summarized_story": "Sowore was still talking to security operatives, who denied him access into the court when some boys, who looked unkempt arrived.\nIt took protest by journalists and lawyers present for security agents to reluctantly intervene and stop the hoodlums from beating Sowore.\nPrior to the attack, Sowore had told journalists that he was in court to show solidarity to Kanu and ask the officials at the court registry why he had not been arraigned.\n“Also I am here to witness the trial of my friend, Nnamdi Kanu.\nSo Nnamdi Kanu is not wrong and his trial should not be in secret."
  },
  {
    "headline": "JUST-IN: Police Foil Terror Attack In lmo",
    "summarized_story": "The Imo State Polce Command has said that it repelled an attack on Isiala Mbano police station by suspected IPOB/ESN terror gang.\nThis was disclosed in a release made available to LEADERSHIP, and signed by the Imo Police Public Relations Officer, (PPRO) Michael Abattam.\nThe PPRO stressed that gallant police operatives attached to the station returned fire, engaging thr attackers in a gun duel.\nADVERTISEMENTThe Commissioner of Police, Imo State Command, CP Rabiu Hussaini, commended the officers and men of the Police Division for their gallantry and urged them to sustain the tempo.\nThe CP also urged the residents to assist them with credible information that will lead to the arrest of the fleeing bandits."
  },
  {
    "headline": "JUST-IN: Police Foil Terror Attack In lmo",
    "summarized_story": "The Imo State Polce Command has said that it repelled an attack on Isiala Mbano police station by suspected IPOB/ESN terror gang.\nThis was disclosed in a release made available to LEADERSHIP, and signed by the Imo Police Public Relations Officer, (PPRO) Michael Abattam.\nThe PPRO stressed that gallant police operatives attached to the station returned fire, engaging thr attackers in a gun duel.\nADVERTISEMENTThe Commissioner of Police, Imo State Command, CP Rabiu Hussaini, commended the officers and men of the Police Division for their gallantry and urged them to sustain the tempo.\nThe CP also urged the residents to assist them with credible information that will lead to the arrest of the fleeing bandits."
  },
  {
    "headline": "1 Dead, Another Injured As Hollywood Actor, Baldwin, Shoots Woman On Set",
    "summarized_story": "There was an accidental discharge on a movie set resulting in the death of a woman and a man injured after American actor, Alec Baldwin, on Thursday, fired a prop gun at a New Mexico movie set of Rust.\nThe victim, Halyna Hutchins, aged 42 was shot while working on the set as director of photography.\nThe movie director, Joel Souza, who got injured on the set at Bonanza Creek Ranch was taken to hospital by ambulance.\nThursday’s shooting on the movie set of Rust was rare, but seldom happen.\nActor, Alec Baldwin, who was seen in tears after the ugly incident, is the eldest of four brothers, all actors."
  },
  {
    "headline": "Nigeria can’t produce COVID-19 vaccine now – Pfizer boss",
    "summarized_story": "The Country Manager Nigeria and Cluster Lead West Africa for Pfizer, Mr Olayinka Subair, has said there is no technical capacity to develop a COVID-19 vaccine in Nigeria now.\nWhether Nigeria will be able to do a vaccine for a new disease, it will be very difficult.\n“We do not have the technical competence or the capacity to develop a COVID-19 vaccine locally yet.\nThere are studies that have been published that said that three to four of 10 drugs brought into Nigeria are fake.\nMedicine is meant to heal and restore life; a lot of deaths have happened because doctors are administering fake drugs to critically ill patients."
  },
  {
    "headline": "Nigeria can’t produce COVID-19 vaccine now – Pfizer boss",
    "summarized_story": "The Country Manager Nigeria and Cluster Lead West Africa for Pfizer, Mr Olayinka Subair, has said there is no technical capacity to develop a COVID-19 vaccine in Nigeria now.\nWhether Nigeria will be able to do a vaccine for a new disease, it will be very difficult.\n“We do not have the technical competence or the capacity to develop a COVID-19 vaccine locally yet.\nThere are studies that have been published that said that three to four of 10 drugs brought into Nigeria are fake.\nMedicine is meant to heal and restore life; a lot of deaths have happened because doctors are administering fake drugs to critically ill patients."
  },
  {
    "headline": "Bank customers, PoS operators groan as telcos block 47 LGAs",
    "summarized_story": "In compliance with the directive of the Nigerian Communications Commission, GSM operators on September 3, 2021 shut down their 248 base stations in Zamfara State.\nThe ban was later extended to 13 LGAs in Katsina, 14 LGAs in Sokoto and about seven LGAs in Kaduna.\nThe 13 LGAs affected in Katsina are: Sabuwa, Faskari, Dandume, Batsari, Danmusa, Kankara, Jibia, Safana, Dutsin-Ma,Kurfi, Funtua, Bakori and Malumfashi.\nIn Sokoto State, there were 3,215,534 voice subscribers and 2,329,133 Internet data subscribers as of the first quarter of 2021.\nIn Kaduna State, there were 8,608,198 active voice subscribers and 6,632,861 Internet data subscribers as of the first quarter of 2021."
  },
  {
    "headline": "Bank customers, PoS operators groan as telcos block 47 LGAs",
    "summarized_story": "In compliance with the directive of the Nigerian Communications Commission, GSM operators on September 3, 2021 shut down their 248 base stations in Zamfara State.\nThe ban was later extended to 13 LGAs in Katsina, 14 LGAs in Sokoto and about seven LGAs in Kaduna.\nThe 13 LGAs affected in Katsina are: Sabuwa, Faskari, Dandume, Batsari, Danmusa, Kankara, Jibia, Safana, Dutsin-Ma,Kurfi, Funtua, Bakori and Malumfashi.\nIn Sokoto State, there were 3,215,534 voice subscribers and 2,329,133 Internet data subscribers as of the first quarter of 2021.\nIn Kaduna State, there were 8,608,198 active voice subscribers and 6,632,861 Internet data subscribers as of the first quarter of 2021."
  },
  {
    "headline": "New Jersey, Texas want 8 Nigerians arrested in Cape Town for $6.8m scams",
    "summarized_story": "Warrants of arrests have been issued by the U.S. states of New Jersey and Texas for eight Nigerians busted in Cape Town on Tuesday for online scams, even as they await extradition.\nNtabazalila made this known after the Nigerians made preliminary appearance at Cape Town Magistrates’ Court on Wednesday, facing various charges relating to internet scams, money laundering and identity theft, already filed in the U.S.\nThe Nigerians were charged by superseding indictment with wire fraud conspiracy and money laundering conspiracy, spanning from 2011 to 2021.\nThe suspects are:Perry Osagiede, aka “Lord Sutan Abubakar de 1st,” aka “Rob Nicolella,” aka “Alan Salomon,” 52;Enorense Izevbigie, aka “Richy Izevbigie,” aka “Lord Samuel S Nujoma,” 45;Franklyn Edosa Osagiede, aka, “Lord Nelson Rolihlahla Mandela,” aka, “Edosa Franklyn Osagiede,” aka “Dave Hewitt,” aka, “Bruce Dupont,” 37;Osariemen Eric Clement, aka, “Lord Adekunle Ajasi,” aka, “Aiden Wilson,” 35;Collins Owhofasa Otughwor, aka, “Lord Jesse Makoko,” aka, “Philip Coughlan,” 37; andMusa Mudashiru, aka “Lord Oba Akenzua,” 33.\n“Those charges are conspiracy to commit wire fraud; second charges, wire fraud; third charges, is money laundering; and the fourth charge is aggravated theft of identity."
  },
  {
    "headline": "Photo: Actor Alec Baldwin in tears after 'killing' on movie set",
    "summarized_story": "Hollywood actor Alec Baldwin appeared distraught after he accidentally killed a crew member Halyna Hutchins on the set of his new film.\nThe movie star, 63, fired a prop gun which is believed to have fatally wounded director of photography Halyna Hutchins, 42.\nThe accident on the set of Rust in Santa Fe, New Mexico also left director Joel Souza, 48, in critical condition in hospital.\nAccording to The Mirror, Police are yet to file any charges against the actor but Baldwin had been questioned in the aftermath of the shooting.\nA Santa Fe Sheriff’s Department official said: “Mr."
  },
  {
    "headline": "Burna Boy wears new look, fans may not recognise him[Video]",
    "summarized_story": "Burna Boy is now wearing a new look, just as he says to “look his age”.\nThe 30 year-old Grammy winner shared his new face, on Instagram on Thursday.\nExcept for his dreadlocks hair, he may be unrecognisable by his millions of fans, worldwide.\nBorn as Damini Ebunoluwa Ogulu, Burna Boy has become one of the biggest and most successful artists out of Nigeria and Africa.\nHe was born 2 July 1991 in Port Harcourt, Nigeria."
  },
  {
    "headline": "Don’t Give Any Fresh Loan To Gombe Government, Group Tells Central Bank Of Nigeria",
    "summarized_story": "The Central Bank of Nigeria has been urged not to give any fresh loan to the Gombe State Government in order to avoid burying the state under a mountain of debt from frivolous borrowings by the administration of Governor Muhammadu Inuwa Yahaya.\nThe statement read, “Governor Muhammadu Inuwa Yahaya has plunged Gombe State into a quagmire of crippling debts.\n“The public will recall that we have recently made a press release concerning the spate of reckless borrowing by the Muhammadu Inuwa Yahaya-led administration of Gombe State.\n“There is no gainsaying that the debt service to the overall revenue of Gombe State is excessive and inimical to the economic and developmental aspirations of the state.\n“We therefore call on the Central Bank to resist any temptation to further advance any loan to the borrowing governor of Gombe State who is hell-bent on mortgaging the state to satisfy his selfish ends.”"
  },
  {
    "headline": "BREAKING: Uche Secondus Moves To Stop PDP Convention",
    "summarized_story": "In a letter dated 21st October, 2021, former National chairman of the People’s Democratic Party (PDP), Uche Secondus move to stop PDP convention.\nThe letter reads:Dear Sir,RE: CA/PH/341/2021: PRINCE UCHE I SECONDUS V IBEAWUCHI E. ALEX &ORS.\nOn 10 September 2021, the High Court of Rivers State delivered its judgment in the Suitwhereby Prince Uche Seconds was, inter alia, restrained from performing the functions ofthe office of National Chairman of the PDP.\nIn addition, an Application on Notice has been filed in which Prince Uche Secondus isseeking, inter alia, the following orders:i.\nWe trust that you will wisely advise the Peoples’ Democratic Party and its officers in this regard."
  },
  {
    "headline": "Nationwide Protest Over Hike In Food Prices Coming — Primate Ayodele Warns Buhari Over Economic Crisis",
    "summarized_story": "Primate Elijah Ayodele, the leader of INRI Evangelical Spiritual Church, warned President Muhammadu Buhari on Friday about the current economic situation, which has resulted in an increase in the price of critical commodities.\nDue to the increase in food costs, which has touched every Nigerian, Primate Ayodele has warned of a nationwide protest.\nThe masses, including youths, ladies, men, and children, would take part in the statewide demonstration, according to Primate Ayodele.\nThe president must see into food matters otherwise Nigeria will go up in flames as a result of this.\n‘’The government must do something to avert this coming protest, it will involve the youths, old men and women, it will be very serious."
  },
  {
    "headline": "Police Accuse Nnamdi Kanu’s IPOB, ESN Of Attacking Imo Station With Bombs",
    "summarized_story": "The Police High Command has accused the proscribed Indigenous People of Biafra (IPOB) and Eastern Security Network (ESN) of carrying out the attacks on the Isiala Mbano Police Station on Thursday.\nHe said they threw petrol bombs on the roof of the already damaged building.\nThe Commissioner said gallant police operatives attached to the station returned fire, engaging them in a gun duel.\nThe police chief said, “Due to the gallantry of the police operatives no arm was lost.\n“The command’s tactical teams have been dispatched to the area in pursuit of the bandits and to beef up security in the area.”"
  },
  {
    "headline": "NNPC GMD at Editors’ conference: We ‘ve mobilised contractors for Port Harcourt refinery",
    "summarized_story": "The Nigerian Guild of Editors (NGE) Thursday called on the federal government to adopt necessary measures in tackling the insecurity bedevilling the country.\nNNPC boss speaksAnd in a response to the challenge posed by Ekpu, GMD NNPC Kyari said the inability to fix the nation’s refineries was a consequence of the elite’s greed.\nThe NNPC boss said: “We will not cover our faces in shame that we produce crude oil, but yet import petroleum products.\nSince the establishment of Nigerian refineries, since 1999, every attempt to carry out turnaround maintenance of NNPC refineries ended up in one form of misfortune or the other.\nWe have started the process, contractors have been mobilised for the Port Harcourt refinery."
  },
  {
    "headline": "Bombers of Kaduna-Abuja rail track targeted driver, tank – Shehu Sani",
    "summarized_story": "A former lawmaker from the state, Senator Shehu Sani reported the double attacks Wednesday and Thursday on Facebook:“Yesternight (Wednesday), bandits attacked the Kaduna-Abuja train.\n“They planted an explosive that damaged the rail track and shattered the windshield of the train engine.\n“All Kaduna Abuja train operations need to be suspended for today until this issue is addressed,” Sani wrote.\nOne of the passengers who resides in Kaduna, Aisha Usman, explained why she chose to travel by road to Abuja.\n“Since all these happened, and I can’t postpone my journey, I had no choice than to go by road."
  },
  {
    "headline": "FIRS proposes road taxes for motorists, others",
    "summarized_story": "The Federal Inland Revenue Service (FIRS) has proposed the introduction of road infrastructure tax in Nigeria, to make the informal sector contribute to building a modern society.\nNami said the proposed road infrastructure tax to be administered by FIRS would provide government with adequate funding for road construction, rehabilitation, and maintenance, as well as providing the needed security for roads in the country.\nOn the challenges facing the service for delivering on its mandate, he said: “Crude oil production has been limited by OPEC quota.\nNigerian OPEC quota as at July 2021 was about 1.5mbpd as against its crude oil production budget of 1.8mbpd.\nNami added that the service created 10 Value Added Tax, VAT, Regional Coordination Offices across the country to drive collection of VAT."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "NIA honours Aviation Minister for infrastructural development -NigPilot",
    "summarized_story": "Nigeria’s Minister of Aviation, Sen. Hadi Sirika has received the Honorary Fellowship and Distinguished Service Award of the Nigerian Institute of Architects, NIA, for his infrastructural developments within the aviation sector.\nThe Award was given to the minister at the Institute’s Architecture Annual Award 2021 in Abuja on Thursday.\nPresenting the award, the Institute noted that under his supervision, the Ministry of Aviation embarked upon 157 projects and delivered 134 to 100 percent completion for the first time in the history of Nigerian Aviation.\nThe NIA also cited the rehabilitation of the runways of the Abuja Airport and the Enugu Airport according to ICAO specifications which were not only delivered ahead of schedule, but within budget.\nDisclosing that he has rejected 390 awards in the past, Sirika said he had to make an exception for the NIA award because of the integrity of the institution."
  },
  {
    "headline": "Rubber stamp 9th assembly would approve Buhari’s third term if… – Wabara -NigPilot",
    "summarized_story": "Former president of the Senate, Adolphus Wabara Thursday hinted that the present 9th National Assembly would have approved an unconstitutional third term for President Muhammadu Buhari if he had insisted on going for it.\nWabara spoke Thursday in Abuja as a special guest at the public presentation of the book: “Standing Strong”, authored by former president of the Senate, Ken Nnamani.\nThe former Senate president who stepped down under intense pressure in the 5th assembly thanked President Muhammadu Buhari for standing strong against the pressure from certain quarters for him to seek a third term.\nHe eulogized the author, Sen. Ken Nnamani who he described as uncommon patriot and nationalist who stood strong in the face of pressure from the political lackeys of former president Olusegun Obasanjo who were bent on smuggling the third term agenda into the constitution through a backdoor.\nAlso speaking at the event, former Minister of defence, Theophilus Danjuma while commending the author, described the book as a text book for young Nigerians who are aspiring to lead a “difficult nation like Nigeria.”"
  },
  {
    "headline": "How we use live telecast to scuttle Obj’s 3rd term plot – Nnamani -NigPilot",
    "summarized_story": "” Publicizing the proceedings was faulted by those who wanted to smuggle into the constitution the extension of tenure through undefined and darken proceedings.\n” The knew that if we isolate Nigerians from the proceedings and therefore reduce public pressure on the legislators, it could be possible to ram through with their agenda.\nBut I stood strong.\nThe principal officers of the National Assembly stood strong.\nTo take it beyond doubt, I called for votes a second time."
  },
  {
    "headline": "Access Bank, Xploits Consulting organise workshop on drugs abuse, illicit trafficking to curb menace amongst students -NigPilot",
    "summarized_story": "On the need to fight against the menace of drug abuse in the country and to safeguard the lives of the growing generation, Access Bank Plc in collaboration with Xploits Consulting Ltd has organized a drug abuse and illicit trafficking workshop for students in the Federal Capital Territory, FCT and Nasarawa State.\nAddressing the students during the workshop, Director of Communications, Xploits Consulting Ltd, Mrs. Grace Taiwo said that the issue of drug addiction was eating deep into society especially among young adults.\nMr Nduka advised the students to stay away from drugs as it can lead to jail terms or death.\nAppreciating the efforts of Access bank Plc and Xploits Consulting Ltd, Principal of Babcecil Schools, New Karu Mr. Oliver Onoja said the lecture was timely as drug abuse was the in-thing for young adults.\nAlso, Miss Angela Anajendu of Capville Group of schools, Dawaki thanked the facilitators and sponsors for educating them on the dangers of drug abuse."
  },
  {
    "headline": "Gunmen Attack Police Station With ‘Petrol Bombs’ In Imo",
    "summarized_story": "A group of armed men on Thursday attacked a police station with petrol bombs in Isiala Mbano Local Government Area of Imo State.\nThe Police Public Relations Officer in the state, Michael Abattam, who confirmed the attack in a statement on Friday said it occurred in the evening.\n“The gallant police operatives attached to the station returned fire, engaging them in a gun duel.\nHe explained that the fire that erupted as a result of the petrol bombs was later extinguished, although it caused some damages to the building.\n“One of the police operatives who sustained gunshot injury was rushed to a nearby hospital for treatment,” the statement added."
  },
  {
    "headline": "ISWAP: Al-Barnawi’s Successor Killed By Troops, Says NSA",
    "summarized_story": "Troops have killed the man who succeeded Abu Musab Al-Barnawi as the leader of the Islamic State of West African Province (ISWAP).\nThe National Security Adviser (NSA) to the President, Major General Babagana Monguno (rtd), confirmed this to State House correspondents on Thursday in Abuja.\nHe explained that Al-Barnawi’s successor, Malam Bako, was killed alongside a prominent member of ISWAP on Tuesday by soldiers fighting terrorists in the north-east region of the country.\n“Two days ago, the man who succeeded him, one Malam Bako, one of the prominent leaders of the Shura Council of the Islamic State of West African Province, was also taken out.\nGeneral Irabor led the Chief of Army Staff, Lieutenant General Farouk Yahaya; Chief of Naval Staff, Vice Admiral Awwal Zubairu Gambo, and other security chiefs to the meeting."
  },
  {
    "headline": "Bomb Explosion Forces Suspension Of Train Services On Kaduna-Abuja Route",
    "summarized_story": "The Nigeria Railway Corporation (NRC) has suspended train services on the Kaduna-Abuja route following the bombing of the rail tracks.\nYet-to-be-identified persons had bombed a portion of the rail track on the Kaduna end during an attack on Wednesday night.\n“Yesternight, bandits attacked the Kaduna-Abuja train,” Senator Sani said in a Facebook post on Thursday.\n“They planted an explosive that damaged the rail track and shattered the windshield of the train engine.\nThe train nearly skidded off its track, then we miraculously escaped.”He advised authorities to suspend all train operations on the Kaduna-Abuja route until the issue was properly addressed."
  },
  {
    "headline": "Anambra Polls: Ensure No Group, Individual Stirs Chaos, Buhari Tells Security Agencies",
    "summarized_story": "President Muhammadu Buhari has directed the Nigerian Armed Forces and law enforcement agencies to ensure that no group or individual is allowed to stimulate anarchy and chaos in Anambra State.\nAccording to the president, peace must be maintained in Anambra, even if it requires dominating the state ahead of the governorship election scheduled for November 6.\nThe National Security Adviser (NSA), Babagana Monguno, disclosed this after a security meeting presided by President Buhari at the State House on Thursday.\nBefore the briefing by his cabinet members, President Buhari presided over a security meeting with the nation’s service chiefs and heads of intelligence agencies.\nThe Chief of Defence Staff, General Lucky Irabor, led the Chief of Army Staff, Lieutenant General Farouk Yahaya; Chief of Naval Staff, Vice Admiral Awwal Zubairu Gambo, and other security chiefs to the meeting."
  },
  {
    "headline": "Haiti Gang Leader Threatens To Kill Hostages",
    "summarized_story": "The leader of a Haitian gang who kidnapped a group of North Americans over the weekend has threatened to execute them, according to a video seen by AFP.\n“Since I’m not getting what I need, I’ll kill these Americans,” Joseph said, speaking in Haitian Creole.\nREAD ALSO: Israeli PM Naftali Bennette Holds First Talks With Putin“As far as I know, the video that appeared online today is legitimate,” the official told reporters late Thursday.\nThe FBI is on the ground in Haiti and in contact with all the parties involved,” the official added.\nThe United States has advised Americans not to travel to Haiti, in particular, due to kidnappings they say regularly include American citizens."
  },
  {
    "headline": "Coaches lalk tough ahead Optima Energy NLO Super 8 Final",
    "summarized_story": "Coach of high flying Campus FC, Olumide Arobadi has said that he expects a difficult cup final game with Destiny Boys, as he insisted that his opponents are very formidable side.\n“My focus is to take each game as it comes and every game has been very difficult despite my team emerging victorious.\nDestiny Boys In Final To Win – ObafemiMeanwhile, Abiodun Obafemi, coach of Destiny Boys says he’s fully convinced of his team beating Campus Fc of Owerri.\n“Campus Fc, a very good side no doubt, but my team have players that can hurt them in the final,” he said.\nThe final game promises to be very explosive judging by the red – hot form of both teams in the tournament."
  },
  {
    "headline": "Buhari directs Security agencies to take over Anambra, says non-state actors can't stop election -",
    "summarized_story": "President Muhammadu Buhari on Thursday warned that under no circumstances will non state actors be allowed to prevent the Anambra governorship election from holding.\nThe President made this known on Thursday during the Security Council meeting when he where he received security briefs.\nThe president directed all security agencies to take over Anambra and ensure that citizens are allowed to come out and exercise their right to vote without fear.\nThe Council also reviewed the security situation in other parts of the country and the progress in the fight against bandits in the Northwest.\nWhile it noted that bandits were moving to areas where they could communicate Council was confident that their activities will soon be contained"
  },
  {
    "headline": "Baba ijesha: Doctor says minor’s genitalia showed “blunt penetration” upon examination",
    "summarized_story": "Baba Ijesha faces a six-count charge bordering on indecent treatment of a child, sexual assault, attempted sexual assault by penetration and sexual assault by penetration.\nDr. Makanjuola who is the fourth prosecution witness, is the Head of Clinical Services at the Women at Risk International Foundation (WARIF), a sexual assault referral centre.\nLed in evidence by the state prosecutor, Yusuf Sule, the medical doctor said that she received her training in forensic medical examination in 2017 from the British Council and Pathfinder International.\nWhile under cross-examination by defence counsel, Dada Awosika (SAN), Dr. Makanjuola revealed that she conducted the medical examination based on the client’s history.\n“The healed lacerations connotes is that the lacerations found in the genitalia were not something that was recent, my lord,” she said."
  },
  {
    "headline": "Kebbi Govt confirms release of 30 Students of FGC Birnin Yauri",
    "summarized_story": "Kebbi state government has confirmed the release of thirty students of the Federal Government College, Birnin Yauri by their abductorThe confirmation was made in a statement signed by the Special Adviser on Media to Kebbi state Governor Yahaya SarkiMr. Sarki in a statement said Today Thursday, the 21st of October, 2021 thirty (30) students of the Federal Government College, Birnin Yauri have arrived Birnin Kebbi, the Kebbi State capital.\nHe said this follow their release, while efforts are still continuing to secure the release of the remaining.\nHe said the released students will undergo medical screening and support while being re-united with their families.\nMr. Sarki said the government and people of Kebbi state appreciate the efforts of all that have have helped in securing the release, while congratulating Mr. President, Muhammadu Buhari for the success."
  },
  {
    "headline": "Gang Boss in Haiti Threatens to Kill Abducted Missionaries",
    "summarized_story": "Joseph also threatened Prime Minister Ariel Henry and Haiti’s national police chief as he spoke in front of the open coffins that apparently held several members of his gang who were recently killed.\nLater in the day, Henry’s office announced that Léon Charles had resigned as head of Haiti’s National Police and was replaced by Frantz Elbé.\nThe same day that the missionaries were kidnapped, a gang also abducted a Haiti university professor, according to Haiti’s ombudsman-like Office of Citizen Protection.\nIt also noted a Haitian pastor abducted earlier this month had not been released despite a ransom being paid.\nUNICEF said Thursday that 71 women and 30 children have been kidnapped so far this year — surpassing the 59 women and 37 children abducted in all of last year."
  },
  {
    "headline": "#EndSARS: Lagos Governor Sanwo-Olu Says Judicial Panel Report Will Be Made Public",
    "summarized_story": "Twenty four hours after the anniversary marking the #ENDSARS protest, Lagos State Governor, Mr. Babajide Sanwo-Olu has said the final report of the Judicial Panel of Enquiry and Restitution in the state was being awaited, assuring that his government would disclose the report fully to members of the public.\nThe Governor said the panel report would be helpful in strengthening true reconciliation and preventing re-occurrence of violence in the State.\nSanwo-Olu said: “The panel concluded its sittings about three days ago and has asked for time to put the reports together behind closed doors.\nWe do not know the content of the report, but we want to say publicly that, upon the handover of the report, we will be making it public.\nHe said: “It is exactly a year ago today when Lagos was hit by violence in the aftermath of the EndSARS protests."
  },
  {
    "headline": "Buhari Assures Anambra Election Won’t Be Disrupted, Directs Military to Use Overwhelming Force If Necessary – Arise News",
    "summarized_story": "He gave marching orders to the security agencies to apply overwhelming force, if necessary, to protect the November 6 governorship election and ensure it was not interrupted by non-state actors who have been heating up the polity.\n“The president has made it very clear that the armed forces, security agencies, and law enforcement agencies must make sure that the elections take place.\nIf it means overwhelming the entire environment with the presence of security agencies.\n“There are so many implications for elections to be sabotaged by non-state actors.\nOf course, the armed forces and security agencies have done so much in the last couple of months."
  },
  {
    "headline": "FBI: Human Remains Found in Florida Are Those of Gabby Petito’s Missing Boyfriend",
    "summarized_story": "Partial human remains found in a Florida wilderness area have been identified through dental records as belonging to Brian Laundrie, the boyfriend of murdered travel blogger Gabby Petito, the FBI said on Thursday.\nThe remains were discovered on Wednesday in the swampy Carlton Reserve not far from Laundrie’s parents’ home.\nPolice and FBI agents had been searching for him there since his family reported him missing in mid-September.\nLaundrie had been named a “person of interest” in Petito’s disappearance but was never criminally charged in her murder.\nThe family believes the couple was headed to Grand Teton National Park in Wyoming at the time."
  },
  {
    "headline": "China Evergrande Readies Funds for Interest Payment, Set to Avert Default",
    "summarized_story": "China Evergrande Group has supplied funds to pay interest on a U.S. dollar bond, a person with direct knowledge of the matter told Reuters on Friday, days before a deadline that would have seen the developer plunge into formal default.\nThe person with knowledge of the matter was not authorised to speak with media and so declined to be identified.\n“This is a positive surprise,” said James Wong, portfolio manager at GaoTeng Global Asset Management, who had expected a default.\nSubsequent non-payment would result in formal default and trigger cross-default provisions for its other dollar bonds.\nEvergrande’s next payment deadline is Oct. 29 with the expiration of the 30-day grace period on its Sept. 29 coupon."
  }
]