[
  {
    "headline": "Owo massacre: Group mourns victims, condoles with community",
    "summarized_story": "An indigenous group under the aegis of the Owo Is One Association has mourned the victims of the St Francis Catholic Church, Owaluwo, Owo, Ondo State, massacre and condoled with the community.\nThe group condemned the Sunday attack on the place of worship stating that the incident came as a shock to the indigenes of Owo.\nAruwajoye also condoled with the Olowo of Owo kingdom, Majesty, Oba Ajibade Gbadegeshin Ogunoye III, adding that the community was known to be peaceful from time immemorial.\n“We don’t have any other place we can call home but Owo, our native home,” Aruwajoye said.\nOur people should not only remain calm and be peaceful but continue to pray for God to take control of our homeland.”Copyright PUNCH."
  },
  {
    "headline": "Soludo orders repeat of online recruitment exam for teachers",
    "summarized_story": "Governor of Anambra State, Prof. Chukwuma Soludo, has ordered the repeat of the online recruitment examination teachers which took place on Saturday, June 4.\nThere have been criticisms about the examination by some candidates owing to network failure as the website failed for about 30 minutes into the one-hour exam.\nBut in a press statement on Tuesday, Soludo announced that the examination has been cancelled and that a repeat exercise will hold to accommodate all.\nThe statement signed by the Governor’s Press Secretary, Christian Aburime, said, “In line with his objective of ensuring transparency and fairness to all, Anambra State Governor, Prof Charles Chukwuma Soludo, has directed a repeat of the online recruitment exam for teachers in Anambra State.\n“Soludo has, therefore, graciously directed the Commissioner for Education, Prof. Ngozi Chuma-Udeh, to conduct a repeat of the exercise to make up for the shortfall in the Saturday, June 4, preliminary Teacher’s Recruitment Examination."
  },
  {
    "headline": "Delegates, APC ad hoc officials clash as accreditation begins",
    "summarized_story": "Delegates and some ad hoc officials of the All Progressives Congress clashed at the venue of the party’s national convention on Tuesday.\nIt was learnt that delegates are expected to be issued accreditation tags before proceeding to Eagle Square, the venue of the primary.\nAt the meeting, Adamu informed the NWC that Lawan was the anointed candidate of the party, a move which was not accepted by all of the members.\nBut northern governors in the APC, at their meeting on Saturday night, raised the hope of the South when they insisted that the presidential candidate of the party should emerge from the southern part of the country.\nAdamu’s plot to impose Lawan was on Monday greeted by a groundswell of opposition from some NWC members, northern governors and other presidential aspirants."
  },
  {
    "headline": "Owo massacre: IPOB reacts to attack on Catholic church, reveals those responsible",
    "summarized_story": "The Indigenous People of Biafra, IPOB, has reacted to the attacks in St Francis Catholic Church in Owo, Ondo State.\nIPOB linked the attack that left about 50 people dead to Fulani terrorists.\nThe spokesman of IPOB, Emma Powerful, urged Christians to stop depending on the Nigerian Government to ensure their safety and security.\nIn a statement by Powerful, IPOB claimed that security agencies in Nigeria have only one interest, that of Fulanis.\nThe group called for the support of politicians, clergymen, and Nigerians in the fight against insecurity."
  },
  {
    "headline": "DSS rescues Kano APC senatorial candidate’s mother in Jigawa",
    "summarized_story": "Barely 24 hours after the kidnap of the aged mother of the All Progressives Congress (APC) Kano Central Senatorial District candidate, AA Zaura, the operatives of the Department of State Services, DSS, have rescued her in far away Jigawa State.\nSome gunmen had stormed Zaura town of Nassarawa Local Government Area of Kano State and kidnapped Zaura’s mother in the early hours of Monday.\nHe said, “it is true that we have rescued Laure in Jigawa State, this followed a serious tip off by our men.\nReports earlier on hinted that the kidnappers of Zaura’s mother had called from Katsina State, claiming to have taken her there.\nThe Kano State Police Command had said that they have arrested two persons in connection with the kidnappings, whose identities were not immediately ascertained."
  },
  {
    "headline": "Dagogo’s trial suffers another setback as matter is adjourned till June 10",
    "summarized_story": "The trial of Farah Dagogo, a member representing Degema-Bonny Federal Constituency at the National Assembly, has suffered a setback at the Rivers State High Court sitting in Port Harcourt.\nDagogo is facing two counts of conspiracy and cultism preferred against him by the Rivers State Government.\nDefense counsel, Cosmos Eenweluzo had pleaded that the matter is stood down to make way for the return of the prosecution counsel from the appeal court before the trial would commence.\nHe thereafter adjourned the matter till the 10th and 13th of June for a definite hearing of the matter.\nSpeaking to newsmen outside the courtroom, one of the defendant counsels, Emmanuel Rukani claimed that the absence of the prosecution counsel may be an attempt to “delay the trial”."
  },
  {
    "headline": "Owo massacre: Yorubas being provoked to war, militias taken over Southwest – Afenifere’s Adebanjo",
    "summarized_story": "The leader of the Yoruba socio-political organisation, Afenifere, Ayo Adebanjo, has condemned the killings at St Francis Catholic Church in Owo, Ondo State.\nAdebanjo warned that Yorubas are being provoked into a war with attacks like that on the Catholic church in Owo.\nA statement by Afenifere’s spokesman, Jare Ajayi, quoted Adebanjo as lamenting that militias have taken over the Southwest.\nSome gunmen attacked St. Francis Catholic Church in Owo during church service on Sunday.\n“With what happened in Owo, the Yorubas are being provoked into war because they know that the land had been infiltrated and surrounded by armed militias,” Adebanjo said."
  },
  {
    "headline": "2023: Some Southeast stakeholders prefer to be VP to Northerner than Southwest presidency – Adeyanju",
    "summarized_story": "Deji Adeyanju, an Abuja-based socio-political commentator, has said some Southeast stakeholders prefer to be the running mate to a Northern presidential candidate than one from the Southwest.\nAdeyanju said some stakeholders from the Southeast believe that the Southwest has been betraying their loyalty since 1999.\nIn a Facebook post, Adeyanju said stakeholders from the Southeast are against the Southwest getting the presidency.\nThey feel South West is betraying them for all their loyalty since 1999.”This is coming when the Northern governors had backed a Southern Presidency.\nOn Saturday, 11 Northern governors urged President Muhammadu Buhari to consider a Southerner as his successor."
  },
  {
    "headline": "Only Tinubu can defeat Atiku",
    "summarized_story": "The National Progressive Solidarity Movement (NPSM) has warned the All Progressives Congress (APC) not to let its efforts to retain power in 2023 go in futility.\nThe group said there is the need to hand the APC flag to the national leader, Asiwaju Bola Ahmed Tinubu to lead the party to victory.\n“Tinubu is the only aspirant with all it takes to defeat the Peoples Democratic Party (PDP) and its presidential candidate, Atiku Abubakar.\n“Tinubu has the intimidating credentials, competency and capability for the job.\n“Tinubu has stood true to his progressive credentials and precedence since he helped form the biggest and most successful political coalitions of all times in Africa –the All Progressives Congress."
  },
  {
    "headline": "Sunday Igboho breaks silence on Owo Church attack",
    "summarized_story": "Yoruba Nation activist, Sunday Adeyemo aka Sunday Igboho has joined a host of Nigerians to condemn the terror attack on St. Francis Catholic Church, Owo, Ondo State, that left scores of people dead.\nThe Nation reports gunmen were said to have thrown an improvised explosive device before they started shooting sporadically.\nReacting to the unfortunate incident, Igboho in a viral audio released and obtained by The Nation said: “I pray to God that we don’t experience such again.\nI pray to God to comfort the families of the victims.\n“Many were saying I wanted to create crisis and forment trouble, but can you all see it now?"
  },
  {
    "headline": "FG investigates Wema Bank, Bet Naija over alleged data breach",
    "summarized_story": "The Nigeria Data Protection Bureau has launched investigations into reports of alleged breach of data privacy by Wema Bank plc and KC Gaming Networks (Bet Naija).\nThe agency described Wema Bank and Bet Naija as two major data controllers in Nigeria.\nThe statement reads: “The Nigeria Data Protection Bureau (the Bureau) has commenced investigations into reports of breach of data privacy involving two major data controllers in Nigeria, namely, Wema Bank PLC and KC Gaming Networks (Bet Naija).\n“It will be recalled that sometime in May 2022, some customers of Wema Bank PLC complained of breach of their rights to data privacy and protection by the Bank.\nThe Bureau is also investigating report of breach of data privacy at KC Gaming Networks."
  },
  {
    "headline": "Suspected herdsmen kill two in Benue community",
    "summarized_story": "Two persons have been killed by suspected herdsmen near Ikyungwa Tombo ward , near Ayilamo, Logo Local Government area in Benue State.\nThe incident happened about 4 pm on Monday, along Ikyungwa – Ayilamo road, The Nation gathered.\nHe said they were returning to Ayilamo town where they spent the night because their settlement had been taken over by herdsmen.\nOn the road between Ikyungwa and Ayilamo, herdsmen who laid ambush, open fire and killed them at the spot.\nTombo ward, a farming settlement, has come under sustained attacks from suspected herdsmen since 2016."
  },
  {
    "headline": "BREAKING: APC Govs propose Tinubu, four others for primary",
    "summarized_story": "BREAKING: APC Govs propose Tinubu, four others for primaryAll Progressives Congress (APC) Governors have proposed five presidential aspirants to participate at today’s primary.\nThe five, who are from the South, are: Asiwaju Bola Ahmed Tinubu, Chibuike Amaechi, Prof Yemi Osinbajo, Dave Umahi and Kayode Fayemi.\nThe Governor explained that President Muhammadu Buhari had asked the Progressives Governors’ Forum to reduce the number of aspirants and submit their names to the party.\nRemarkably, three of them are from Southwest, one from South south and one from the Southeast.\nHe dismissed insinuations about any consensus aspirant from the North, insisting that the Governors were committed to zoning."
  },
  {
    "headline": "APC Convention: Buhari meets Bello in Aso Rock",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari is currently meeting with the governor of Kogi State and presidential aspirant on the platform of the All Progressives Congress, Yahaya Bello, in State House, Abuja.\nThe Kogi state governor is among the 23 presidential aspirants of the APC cleared to çontest for the primary of the party.\nBello was absent Monday when the Northern Progresses Governors’ Forum met with President Buhari to announce their resolve that power should shift to the south.\nThose that made the shortlist are said to be Vice President Yemi Osinbajo, former Lagos State governor, Bola Tinubu, Ekiti State Governor Kayode Fayemi; former Transportation Minister, Rotimi Amaechi and Governor Dave Umahi of Ebonyi State.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Breaking: Seven Presidential Aspirants reject Governors’ list, back Abdulahi Adamu",
    "summarized_story": "Seven Presidential aspirants under the platform of the All Progressives Congress, have dismissed the names of five presidential aspirants purportedly to President Muhammadu Buhari to select a consensus candidate, stressing that they were not consulted before the Governors arrived at the decision.\nAccording to them, the motive of the Governors is in their personal selfish interest not the South .\nRallying support for the National Chairman, Abdullahi Adamu the Presidential aspirants commended the decisions made so far by the party leadership .\nThe statement read ;“In the past few hours we have been bombarded with calls and messages from my supporters and concerned Nigerians on a list of five Presidential aspirants submitted to President Buhari to choose from.\nPresident’s directive is very simple, that all Presidential aspirants including those from the North should meet and harmonise inorder to produce a single candidate."
  },
  {
    "headline": "Breaking: Seven Presidential Aspirants rejects Governors’ list, back Abdulahi Adamu",
    "summarized_story": "Seven Presidential aspirants under the platform of the All Progressives Congress, have dismissed the names of five presidential aspirants purportedly to President Muhammadu Buhari to select a consensus candidate, stressing that they were not consulted before the Governors arrived at the decision.\nAccording to them, the motive of the Governors is in their personal selfish interest not the South .\nRallying support for the National Chairman, Abdullahi Adamu the Presidential aspirants commended the decisions made so far by the party leadership .\nThe statement read ;“In the past few hours we have been bombarded with calls and messages from my supporters and concerned Nigerians on a list of five Presidential aspirants submitted to President Buhari to choose from.\nPresident’s directive is very simple, that all Presidential aspirants including those from the North should meet and harmonise inorder to produce a single candidate."
  },
  {
    "headline": "Northern Govs present Umahi, Tinubu, three other names to Buhari",
    "summarized_story": "President Muhammadu Buhari has received the names of five aspirants for his consideration as the consensus presidential candidate of the All Progressives Congress (APC) ahead of Tuesday’s national convention.\nThe Chairman of the Northern Governors Forum, Governor Simon Lalong, confirmed this when he appeared on Channelstv Sun Rise Daily, Tuesday morning.\nThose that made the shortlist are said to be Vice President Yemi Osinbajo, former Lagos State governor, Bola Tinubu, Ekiti State Governor Kayode Fayemi; former Transportation Minister, Rotimi Amaechi and Governor Dave Umahi of Ebonyi State.\nAccording to Lalong, those whose names were submitted had been graded by the party’s screening committee based on specified criteria.\nThe governors had after meeting with President Buhari on Monday insisted on a southern candidate for equity, fairness and justice."
  },
  {
    "headline": "Guterres, UN Secretary-General condemns Owo attack",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe attack on Saint Francis Catholic Church, Owo, Ondo State, on Sunday, has continued to elicit condemnation from the international community.\nUnited States Secretary-General, Antonio Guterres, in a statement issued in New York, United States, condemned in the strongest terms, the heinous attack.\nGuterres called on the Nigerian authorities to spare no effort in bringing the perpetrators to justice.\n“The Secretary-General emphasizes that attacks on places of worship are abhorrent.\n“The Secretary-General extends his heartfelt condolences to the families of the victims and wishes a speedy recovery to the injured."
  },
  {
    "headline": "Sultan, Archbishop of Canterbury Condemn Terrorists Attack on Owo Church, Say It’s Crime against Humanity",
    "summarized_story": "An explosion rocked the Catholic Church on Sunday, which was immediately followed by sporadic shootings by gunmen suspected to be terrorists.\nChairman of NGF and Ekiti State Governor, Dr. Kayode Fayemi, visited Akeredolu at the Government House, Akure.\n“We urge the Ondo State government and the federal government to mobilise immediate medical supplies and other care items for victims.\nWe also commiserate with the Catholic Church and the Ondo State government for this great loss.\nHe said NCGF was traumatised and shocked by Sunday’s killings at St. Francis Catholic Church, Owo."
  },
  {
    "headline": "In ‘Super Tuesday’, Aspirants Narrow to Osinbajo, Tinubu, Fayemi, Amaechi, Umahi, Lawan",
    "summarized_story": "Rotimi Amaechi; Ebonyi State Governor, Dave Umahi and the President of the Senate, Ahmad Lawan.\nBut before his meeting with the governors late last night, Buhari, at a meeting with the Northern APC governors, State House, Abuja, stated emphatically that he had “no preferred candidate”.\n“There are 14 APC governors out of the 19 Northern states.\nMeanwhile, Kalu, in a statement, yesterday, said Lawan was chosen after a thorough evaluation of all the presidential aspirants.\nState Congress of the APC held in October 2021, had recognised Mr. Austin Ekanem as the winner and chairman of the Akwa Ibom APC State Executive."
  },
  {
    "headline": "Atiku Slams APC, Says Ruling Party Dined in Abuja While Innocent Worshippers Died in Owo",
    "summarized_story": "•Urges Nigerians to stand with him in 2023Chuks OkochaPresidential candidate of People Democratic Party (PDP), Alhaji Atiku Abubakar, yesterday, took a swipe at the ruling All Progressives Congress (APC), when he accused leaders of the ruling party of gathering in Abuja to treat themselves to sumptuous dinner in the name of a meeting, while innocent worshippers died needlessly in Owo, Ondo State.\nHe, therefore, called on the Nigerian people to stand with him as volunteers to reclaim the country from the challenges currently befalling it.\nTo that extent, Atiku said, “Since the convention of our great party, the Peoples Democratic Party, last weekend, I have continued to enjoy the support and expression of goodwill by party leaders, members and even my co-contestants after the election.\nBut, I know that with your support, the PDP can return to the winning ways.\n“It needs no mention that whoever is ‘handpicked’ as the APC presidential candidate in such despotic process cannot be any different from the authoritarian fervor of the APC establishment,” he stated."
  },
  {
    "headline": "Buhari: I Have Not Anointed Any Presidential Aspirant",
    "summarized_story": "*Says no candidate will be imposed on party delegates will determine fate of aspirants.\nHave a clear mind as I have.\nGod gave us the chance; we have no reason to complain.\nWe must be ready to take pain as we take the joy.\nThe Party must participate, nobody will appoint anybody.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "You’re on Your Own, APC NWC Members Tell Adamu",
    "summarized_story": "Adedayo Akinwale in AbujaThe members of the National Working Committee (NWC) of the All Progressives Congress (APC) have dissociated themselves from the purported endorsement of the Senate President, Ahmad Lawan as the consensus candidate of the party ahead of the party’s primary scheduled to hold between Tuesday and Wednesday.\nThe National Chairman of the party, Senator Abdulahi Adamu had announced during the NWC meeting that Lawan had been anointed as the consensus candidate of the party.\nBut addressing journalists at the party’s secretariat after the NWC meeting, the National Organising Secretary of the party, Mr. Suleiman Argungun, said the issue of consensus was never discussed at the meeting.\nHe said Adamu only gave them the information, adding that they were yet to discuss it.\nArgungun insisted that the NWC didn’t announce Lawan as the anointed candidate."
  },
  {
    "headline": "EXCLUSIVE: Kogi Governor, Bello Angrily Storms Out Of Ruling APC Governors’ Meeting After Being Told To Withdraw From Race For Southern Region Presidential Candidate",
    "summarized_story": "The meeting was part of preparations towards the presidential primary and to finalise plans to adopt a consensus presidential candidate – from the Southern region as earlier agreed upon.\nKogi State Governor, Yahaya Bello.\nSaharaReporters learnt that Governor Bello angrily walked out of the meeting at the point where he was asked to withdraw from the race for a southern region candidate.\n“Governor Yahaya Bello angrily walked out of the meeting called by the APC governors.\nOthers were; Aminu Bello Masari (Katsina), Abdullahi Sule (Nasarawa), Bello Matawale (Zamfara), Mallam Nasir El-Rufai (Kaduna), Abdullahi Ganduje (Kano), Yahaya Inuwa (Gombe), Abubakar Bello (Niger), and the Yobe State governor, Mai Mala Buni."
  },
  {
    "headline": "EXCLUSIVE: Kogi Governor, Bello Angrily Storms Out Of Ruling APC Governors’ Meeting After Being Told To Withdraw From Race For Southern Region Presidential Candidate",
    "summarized_story": "The meeting was part of preparations towards the presidential primary and to finalise plans to adopt a consensus presidential candidate – from the Southern region as earlier agreed upon.\nKogi State Governor, Yahaya Bello.\nSaharaReporters learnt that Governor Bello angrily walked out of the meeting at the point where he was asked to withdraw from the race for a southern region candidate.\n“Governor Yahaya Bello angrily walked out of the meeting called by the APC governors.\nOthers were; Aminu Bello Masari (Katsina), Abdullahi Sule (Nasarawa), Bello Matawale (Zamfara), Mallam Nasir El-Rufai (Kaduna), Abdullahi Ganduje (Kano), Yahaya Inuwa (Gombe), Abubakar Bello (Niger), and the Yobe State governor, Mai Mala Buni."
  },
  {
    "headline": "EXCLUSIVE: Kogi Governor, Bello Angrily Storms Out Of Ruling APC Governors’ Meeting After Being Told To Withdraw From Race For Southern Region Presidential Candidate",
    "summarized_story": "The meeting was part of preparations towards the presidential primary and to finalise plans to adopt a consensus presidential candidate – from the Southern region as earlier agreed upon.\nKogi State Governor, Yahaya Bello.\nSaharaReporters learnt that Governor Bello angrily walked out of the meeting at the point where he was asked to withdraw from the race for a southern region candidate.\n“Governor Yahaya Bello angrily walked out of the meeting called by the APC governors.\nOthers were; Aminu Bello Masari (Katsina), Abdullahi Sule (Nasarawa), Bello Matawale (Zamfara), Mallam Nasir El-Rufai (Kaduna), Abdullahi Ganduje (Kano), Yahaya Inuwa (Gombe), Abubakar Bello (Niger), and the Yobe State governor, Mai Mala Buni."
  },
  {
    "headline": "EXCLUSIVE: How N268 Million Meant For Pedestrian Bridge Contracts ‘Disappeared’ In Adamawa As Lives Are Lost To Road Crashes",
    "summarized_story": "In 2018, the Adamawa State government awarded a contract for the construction of four steel pedestrian bridges, each at a cost of about N67 million.\nFor many residents, the joy of having lifesaving pedestrian bridges at strategic locations in Yola, the Adamawa State capital, was immeasurable as soon as the contracts for the bridges were awarded.\nThe tragic incident, however, was one out of several vehicular knockdowns that have occurred along the road and other spots within the metropolis due to the non-availability of pedestrian bridges.\nIt was gathered that contracts for the construction of four pedestrian bridges were awarded in 2018, but none was built.\nShema Synergy was awarded the Jimeta Shopping Complex Bridge and Jimeta modern Market Bridge, costing N67 million and N65 million respectively."
  },
  {
    "headline": "EXCLUSIVE: How N268 Million Meant For Pedestrian Bridge Contracts ‘Disappeared’ In Adamawa As Lives Are Lost To Road Crashes",
    "summarized_story": "In 2018, the Adamawa State government awarded a contract for the construction of four steel pedestrian bridges, each at a cost of about N67 million.\nFor many residents, the joy of having lifesaving pedestrian bridges at strategic locations in Yola, the Adamawa State capital, was immeasurable as soon as the contracts for the bridges were awarded.\nThe tragic incident, however, was one out of several vehicular knockdowns that have occurred along the road and other spots within the metropolis due to the non-availability of pedestrian bridges.\nIt was gathered that contracts for the construction of four pedestrian bridges were awarded in 2018, but none was built.\nShema Synergy was awarded the Jimeta Shopping Complex Bridge and Jimeta modern Market Bridge, costing N67 million and N65 million respectively."
  },
  {
    "headline": "LIVE: Tinubu, Osinbajo, Amaechi lock horns for APC presidential ticket",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "LIVE: Tinubu, Osinbajo, Amaechi lock horns for APC presidential ticket",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "Controversy hits APC presidential primary over attempt to replace ad hoc staff",
    "summarized_story": "There is controversy over an alleged attempt to replace the ad hoc staff for the All Progressives Congress (APC) presidential primary election.\nTheCable learnt some youths were trained for the special convention, only to be replaced on Tuesday.\nAdvertisementOn Monday, Abdullahi Adamu, APC national chairman, said Lawan was the party’s consensus candidate.\nThis is contrary to the agreement of the APC governors who want the presidential ticket to be zoned to the south.\nSome members of the party’s national working committee (NWC) aligned with the governors, saying Adamu’s choice was his “opinion”."
  },
  {
    "headline": "Controversy hits APC presidential primary over attempt to replace ad hoc staff",
    "summarized_story": "There is controversy over an alleged attempt to replace the ad hoc staff for the All Progressives Congress (APC) presidential primary election.\nTheCable learnt some youths were trained for the special convention, only to be replaced on Tuesday.\nAdvertisementOn Monday, Abdullahi Adamu, APC national chairman, said Lawan was the party’s consensus candidate.\nThis is contrary to the agreement of the APC governors who want the presidential ticket to be zoned to the south.\nSome members of the party’s national working committee (NWC) aligned with the governors, saying Adamu’s choice was his “opinion”."
  },
  {
    "headline": "APC governors, NWC recommend five hopefuls for presidential primary",
    "summarized_story": "Governors of the All Progressives Congress (APC) have recommended five presidential hopefuls for the party’s primary election scheduled to take place today.\nThe decision is reportedly backed by members of the party’s national working committee (NWC).\nAdvertisementHe said all other presidential hopefuls have been advised to step down, adding that the “frontline candidates” recommended by the governors have the endorsement of President Muhammadu Buhari.\n“The president told us any of these five are qualified to be president and have contributed to the party (APC).\n“Our recommendation is to enable us to give direction for the party as we go into the primary."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Four rising sectors in Africa's technology ecosystem",
    "summarized_story": "In 2020, when AI companies globally attracted $36 billion, AI companies on the continent could only raise $11.63 million.\nWhile many edtech companies around the world benefited from this, as the industry attracted an influx of funding, African edtech companies struggled to tap into this opportunity.\nIn 2021, when edtech globally raised $20 billion, African edtech companies raised less than $40 million.\nThere have been impressive efforts by African companies to solve the continent’s educational problems.\nCompany to watch: Ulesson and FoondaMateUlessonNigerian startup, Ulesson was Africa’s most funded edtech platform last year, raising $22.5 million across 2 funding rounds."
  },
  {
    "headline": "Founder of Babymigo speaks on reducing maternal deaths in Africa",
    "summarized_story": "Kemi OlawoyeThe role of tech in improving maternal healthcareHA: How big of a role do you think tech can play in improving maternal health in Nigeria?\nHA: What singular aspect of maternal healthcare in Nigeria do you think needs the most urgent intervention?\nHA: What are the things you believe will accelerate the growth of the maternal health sector in Nigeria?\nKO: The first thing will be to identify policies and interventions that affect outcomes in terms of maternal and child health.\nIn the next 3 years, we hope to provide healthcare services to 10 million mums across the African continent."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Politicking down to the wire ahead of APC presidential primary",
    "summarized_story": "Politicking has reached fever pitch ahead of the presidential primary of the ruling All Progressives Congress (APC) as the party faces an uphill task of choosing its presidential candidate.\nThe indication is that the choice of the 2023 APC presidential candidate will emerge through the ballot at the ongoing national convention.\nIntensive lobbying of APC delegates has begun in Abuja as the ruling party prepares to choose its presidential candidate at the Eagle Square on Tuesday.\nA similar leak, though true, was the news about the northern APC governors’ support for a consensus candidate from the South.\nBut as it is, the southern region and APC presidential aspirants from that part of the country are yet to arrive at a consensus, as advised by the party’s hierarchy."
  },
  {
    "headline": "Governors tip Tinubu, Amaechi, Fayemi, Umahi, Osinbajo for APC ticket",
    "summarized_story": "In alphabetical order, we said Bola Ahmed Tinubu, Chibuike Rotimi Amaechi, John Kayode Fayemi, David Umahi and Professor Yemi Osinbajo.\nRead also: APC Presidential primary and the Ides of March in JuneAdamu’s claims were roundly rejected by President Muhamadu Buhari and members of the APC National Working Committee.\nBuhari at a meeting with northern APC governors denied “having an anointed candidate”.\nIt has never been deliberated.”BusinessDay gathered that APC stakeholders are still exploring the possibility of getting a consensus candidate out of the five recommended aspirants.\nThe John Odigie-Oyegun-led screening of the party has screened 23 aspirants for the APC presidential ticket."
  },
  {
    "headline": "APC Presidential primary and the ‘Ides of March’ in June",
    "summarized_story": "After months of cocktail of wheeling and dealing, horse-trading, postponements and hide-and-seek, the ruling All Progressives Congress (APC) will today officially announce its flagbearer for the Presidential election scheduled for February next year.\nFor some of the aspirants, it promises to be their “Ides of March” in June!\nRead also: APC presidential ticket: Adamu in the eye of the stormNevertheless, some names are still being bandied as the anointed ones.\nAs the primary holds today, it is going to be tantamount to the “Ides of March” against some of the aspirants.\nWhen heroes in movies, books, television shows are faced with the “Ides of March,” it is always a bad omen."
  },
  {
    "headline": "World Environment Day 2022: Chevron Nigeria’s Commitment to a Sustainable Future – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – Every year on June 5, the world commemorates World Environment Day (“WED”) to celebrate and promote environmental awareness and sustainability across the globe.\nThe theme for this year is “Only One Earth” with focus on “Living Sustainably in Harmony with Nature.” It beams a spotlight on climate action, nature action and pollution action while encouraging everyone, everywhere to live sustainably.\n“Our Environmental philosophy and processes lay the foundation for sound environmental management.\nIn 2005, CNL began supporting a yearly postgraduate research scholarship for PhD students in environment and conservation, instituted by the NCF.\nEdu Memorial Lecture to promote environmental management awareness and partners with the Lagos State Government and NCF to sponsor an annual environmental awareness programme, tagged, Walk for Nature, an event held to create awareness and promote nature conservation and sustainable environmental management."
  },
  {
    "headline": "Edo FA Cup: Insurance FC, Feeders Land In Quarter Finals As Edo Queens Whitewash Genesis Queens – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestFootball activities resumed yesterday in the ongoing Edo FA Cup after the tragic incident on Thursday that put the Challenge cup on hold as Bendel Insurance FC and Feeders defeated their opponents to book quarter finals place in the Challenge Cup.\nTaiwo tapped in Feeders grasuate Chinedu’s fine pull out from the right flank to take the game beyond the reach of Star City .\nIn the second game,Towo Eventus’ brace (8,51) minutes and Jude Oghe’s16th goals dumped out Konstanz Dike FC from the competitionThe defending champions Insurance FC will be playing against an experienced side B.J Foundation FC in the first quarter finals game today at the School of Health Technology.\nIn the female fixtures, Edo Queens FC have booked the finals ticket in the Edo FA Cup after Whitewashing Genesis Queens FC 9-0.\nThey await the winners between Fortress Ladies and Brave Hearts Ladies in the second semifinals game."
  },
  {
    "headline": "Owo church massacre: Your govt in Abuja has failed Nigerians – EDSG chides Edo APC – Nigerian Observer",
    "summarized_story": "According to him, “Edo APC has been uncomfortably mum about the recent attack at the St. Francis Catholic Church in Owo, Ondo State, which has drawn condolences and condemnation from across the country.\n“When Governor Godwin Obaseki embarks on foreign trips to seek investment, Edo APC is quick to throw tantrums.\nBut on a very important occasion such as the Owo attack, they have failed to make a statement to commiserate with the victims.\nThis failing is what Edo APC has refused to acknowledge and draw the attention of its leaders in the executive arm of government to so as to forestall a reoccurrence.\nThe government must rise up to the occasion and take responsibility for the task of protecting the lives of Nigerians,” Osagie charged."
  },
  {
    "headline": "Obaseki extends tenure of AAU Special Intervention Team – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has approved the extension of the tenure of the 10-man Ambrose Alli University Special Intervention Team.\nIn a statement, Secretary to the Edo State Government, Osarodion Ogie, Esq., said the special team’s tenure was extended by 6 (six) months.\nOgie noted, “It is hereby announced for the information of the general public and in particular, the Ambrose Alli University Community that further to the provision of Section 2(c) of the Ambrose Alli University (Special Intervention Powers) Law 2021, the Governor, His Excellency, Mr. Godwin N. Obaseki has approved the extension of the tenure of the 10-man Ambrose Alli University Special Intervention Team by 6 (six) months.\n“Accordingly, the general public and the Staff and students of the Ambrose Alli University, Ekpoma are to note the foregoing.”The intervention team was set up by Governor Obaseki to exercise all the powers and functions of the Governing Council of the Ambrose Alli University, with a charge for them to advance the government’s vision to reposition the institution to meet global standards.\n“You are also going to develop a means of funding the university outside government resources by developing a strategy that will help reduce overdependence on government and separate politics from the university.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "‘APC is very disorganized,’ – journalists lament failure to get tags to access primary value",
    "summarized_story": "Journalists assigned to cover the presidential primary of the All Progressives Congress (APC) holding today, Tuesday, have lamented the delay by the party in giving them tags to be able to access the venue.\nSome of the journalists who spoke to Business Hallmark said the who place is rowdy and that it’s unlikely that the primary will commence anytime soon.\n“From the three days I’ve stayed here for this primary, I can now tell why the APC government has been a failure.\nIt’s very frustrating.”It is understood that the Governor Abdullahi Sule-led Media and Publicity sub-committee has yet to release accreditation tags.\nThe APC correspondents who are always on the ground at the party’s national secretariat in Abuja have not been given their tags either."
  },
  {
    "headline": "Don’t come to my office without your PVC – Peter Okoye",
    "summarized_story": "P-Square’s Peter Okoye, alias Mr P, a Nigeria musician, has said he instructed his security and management team not to allow anyone to visit him without their permanent voters card (PVC).\nIn a tweet on Monday, the 40-year-old singer said the directive also includes his entourage.\nHe said the decision became necessary in view of the need for Nigerians to get it right this time and vote bad leaders out of the corridors of power.\n“I have just instructed my security and my management that no one is allowed to visit my house or my office without showing their PVC!.”“This also includes my management team and entourage!\nNo visits and travels!…we must get it right this time and vote out bad leaders”, he tweeted"
  },
  {
    "headline": "Bombs recovered at scene of Ondo church attack – Police",
    "summarized_story": "Usman Alkali Baba, the Inspector-General of Police, has disclosed that bombs have been recovered from the Sunday attack that took place at St. Francis Xavier Catholic Church, Owo, Ondo State.\nGunmen said to be bandits had on Sunday attacked worshippers in the church, killing about 35 and injuring scores of others.\nAccording to him, “The gunmen, from preliminary investigations, invaded the church with arms and materials suspected to be explosives.\nAKR 896 AG which was snatched from the owner, and escaped through Owo/Ute road.\nThe vehicle has been recovered while the owner of the vehicle is currently assisting the Police in its investigations.”"
  },
  {
    "headline": "APC Primary: Govs, NWC recommend Tinubu, Amaechi, Fayemi, 2 others",
    "summarized_story": "The governors of the APC and members of the party’s National Working Committee (NWC) have pruned down the number of aspirants for today’s presidential primaries to five.\nThe decision followed intense consultation and deliberation as directed by Muhammadu Buhari, Nigeria’s president.\nThe decision was taken in the early hours of today, Plateau State Governor, Simon Lalong, disclosed in an interview with Channels Television.\nWith this, Senate President Ahmad Lawan, who the National Chairman, Senator Adamu Abdullahi, told members of the NWC, was consensus candidate, has been thrown off.\nHowever, Lalong said aspirants among the initial 23, who are displeased with the decision could still contest the primaries."
  },
  {
    "headline": "Owo Massacre: We hold Buhari responsible, he invited Fulani from across Africa into Nigeria – Yoruba Alliance",
    "summarized_story": "The Yoruba Global Alliance (YGA), a association of prominent Yoruba in Nigeria and the diaspora, has blamed President Muhammadu Buhari for the horrendous attack on a Catholic Church in Owo, Ondo State on Sunday.\nThis announcement was made at a time Buhari had shut down all Nigeria land borders to its neighbouring West African states since August of that year!\nThe mayhem in Owo could not have happened that brazenly if Ondo state had a well-equipped State Police,” the statement continued.\n“The Yoruba Global Alliance strongly condemns the so-called political parties and their members for holding rallies and conventions while the country is boiling and the people, they are pretending to serve, are being routinely slaughtered.\n“The Yoruba Global Alliance while condoling with the peaceful people of Owo and the Ondo state government has declared a 7-Day mourning period for our departed Yoruba Nation compatriots."
  },
  {
    "headline": "Titan Trust Gets $300m Afreximbank Facility For Union Bank Acquisition",
    "summarized_story": "Afreximbank has disbursed $300 million intra-African Investment Financing Facility to Titan Trust Bank (TTB) to support its acquisition of a majority stake in Union Bank of Nigeria (UBN) plc.\nAfreximbank’s media contact, Amadou Sall, made this known in a statement from the pan-African bank, yesterday.\nSall said Afreximbank would continue to support the newly merged entity in trade finance to promote intra- and extra-African trade through its broad range of programmes and initiatives.\nHe listed the programmes and initiatives to include the Afreximbank Trade Facilitation Programmes (AfTRAF) and AfPAY, the bank’s international payment services.\nTTB has received industry-wide recognition, having been named ‘Best Trade Finance Provider in Nigeria’ for 2020 and 2021 by Global Finance Magazine."
  },
  {
    "headline": "Titan Trust Gets $300m Afreximbank Facility For Union Bank Acquisition",
    "summarized_story": "Afreximbank has disbursed $300 million intra-African Investment Financing Facility to Titan Trust Bank (TTB) to support its acquisition of a majority stake in Union Bank of Nigeria (UBN) plc.\nAfreximbank’s media contact, Amadou Sall, made this known in a statement from the pan-African bank, yesterday.\nSall said Afreximbank would continue to support the newly merged entity in trade finance to promote intra- and extra-African trade through its broad range of programmes and initiatives.\nHe listed the programmes and initiatives to include the Afreximbank Trade Facilitation Programmes (AfTRAF) and AfPAY, the bank’s international payment services.\nTTB has received industry-wide recognition, having been named ‘Best Trade Finance Provider in Nigeria’ for 2020 and 2021 by Global Finance Magazine."
  },
  {
    "headline": "9mobile Set To Groom Entrepreneurs, SMEs",
    "summarized_story": "9mobile, is set to hold the first edition of its mentorship programme, ‘The Hack’ for young entrepreneurs desirous of scaling their businesses.\nThe Hack seeks to create a platform to support and promote entrepreneurs in the SME space.\nADVERTISEMENTCommenting on the initiative, director of Marketing Communications, 9mobile, Saidat Lawal-Mohammed said the initiative was another of 9mobile’s interventions in developing the SME space by empowering entrepreneurs with knowledge and skills.\n“As an enabler of individuals and enterprises, 9mobile remains committed to entrepreneurs, start-ups and MSMEs, and would not relent in supporting their dreams and aspirations,” Mohammed added.\nThe Hack aims to solve specific challenges that entrepreneurs face, with a broad focus on the limitless possibilities in the SME sector."
  },
  {
    "headline": "9mobile Set To Groom Entrepreneurs, SMEs",
    "summarized_story": "9mobile, is set to hold the first edition of its mentorship programme, ‘The Hack’ for young entrepreneurs desirous of scaling their businesses.\nThe Hack seeks to create a platform to support and promote entrepreneurs in the SME space.\nADVERTISEMENTCommenting on the initiative, director of Marketing Communications, 9mobile, Saidat Lawal-Mohammed said the initiative was another of 9mobile’s interventions in developing the SME space by empowering entrepreneurs with knowledge and skills.\n“As an enabler of individuals and enterprises, 9mobile remains committed to entrepreneurs, start-ups and MSMEs, and would not relent in supporting their dreams and aspirations,” Mohammed added.\nThe Hack aims to solve specific challenges that entrepreneurs face, with a broad focus on the limitless possibilities in the SME sector."
  },
  {
    "headline": "Concessionaire, Technical, Financial Partners To Invest $3.2bn To automate NCS",
    "summarized_story": "A concession agreement was recently signed between the Nigeria Customs Service Modernisation Project and Trade Modernization Project Limited, with Huawei Technologies as the technical partner and Africa Finance Corporation as the lead financiers.\nADVERTISEMENTIn a statement that was issued yesterday, the concessionaire said the Customs Modernisation Project will fully automate the Nigeria Customs Service businesses processes, both operational and administrative.\nThe Concessionaire and its technical and financial partners will invest a total of $3.2 billion to fully automate the Nigeria Customs Service, in Phase.\nThe concessionaire said the investment will be spent in areas that plug the current loopholes in the operational and administrative functions of the Nigeria Customs Service.\nNigeria Customs Service has said that the project will require that all its personnel become computer literate and this is a major aspect of the project."
  },
  {
    "headline": "Consensus candidate: APC governors shortlist Tinubu, Osinbajo, three others",
    "summarized_story": "The All Progressives Congress (APC) governors have shortlisted five presidential aspirants for a possible consensus candidate.\nThose shortlisted are: the National leader of the party, Asiwaju Bola Tinubu, Vice President Yemi Osinbajo, Governor Kayode Fayemi, former Minister of Transportation, Rotimi Amaechi and Governor David Umahi of Ebonyi State.\nChairman, Northern APC Governors’ Forum and Plateau State Governor, Simon Lalong disclosed this on Tuesday in an interview on Channels TV’s Sunrise Daily.\nIn alphabetical order, we said Bola Ahmed Tinubu, Chibuike Rotimi Amaechi, John Kayode Fayemi, David Umahi and Professor Yemi Osinbajo.\nLalong said within that 13 aspirants that were graded by the Screening Committee, “we now looked at it and then recommended, that was jointly done by the Progressive governors and members of the National Working Committee, reducing it to five.”"
  },
  {
    "headline": "APC South Africa: Nigeria needs Bola Tinubu",
    "summarized_story": "By APC South AfricaThe All Progressives Congress (APC) South African Chapter said Nigeria needs an economic and political genius like Sen. Bola Tinubu to achieve its dream in the 2023 general elections.\nThe Chairman of the chapter, Mr. Bola Babarinde, said this in a statement on Tuesday in Lagos while throwing weight behind the presidential ambition of Tinubu, a former governor of Lagos State.\nBabarinde said that Tinubu had demonstrated such a feat as governor of Lagos State in laying the foundation for its economic development.\nAccording to him, this is evident in the strides achieved by Lagos State in becoming the 5th largest economy in Africa.\n“We hereby undoubtedly endorse Asiwaju Ahmed Bola Tinubu as the flag bearer of our party, All Progressives Congress,” Babarinde said."
  },
  {
    "headline": "I Warned Tinubu That He Was Playing ‘Dangerous Game’ With Buhari — Afenifere Leader, Adebanjo",
    "summarized_story": "The leader of the Yoruba socio-political organisation, Afenifere, Chief Ayo Adebanjo, has again recalled that he advised the All Progressives Congress (APC) national leader and a presidential aspirant of the party, Bola Tinubu, against supporting President Muhammadu Buhari.\nAccording to Daily Trust, Adebanjo stated this while reacting to the several comments that trailed Tinubu’s speech in Ogun State last Thursday where the APC national leader proudly said he was the mastermind of Buhari’s victory in 2015.\nAdebanjo narrated how he told Tinubu a long time ago that Buhari could not be trusted when he was branding him as the best to be the president of Nigeria.\nI warned him, I warned the whole nation not to vote for Buhari.\nI warned Tinubu that he is playing a dangerous game."
  },
  {
    "headline": "JUST IN: APC Governors Submit Names Of 5 Presidential Aspirants To Buhari",
    "summarized_story": "Governors who are members of the All Progressives Congress (APC) have submitted the names of five presidential aspirants to President Muhammadu Buhari to select a consensus candidate.\nAccording to News Direct, the governors submitted the names in the early hours of Tuesday.\nThe names include; the Vice President, Yemi Osinbajo, former governor of Lagos State, Asiwaju Bola Ahmed Tinubu, Governor Kayode Fayemi (Ekiti State), and Rotimi Amaechi, former Minister of Transportation, and Governor Dave Umahi (Ebonyi State).\nThe governors had after meeting with the President said they will return to the villa after meeting with the party’s National Working Committee(NWC) and other stakeholders.\nThe Senate President, Ahmad Lawan was named as the consensus candidate by the National Chairman, Senator Abdullahi Adamu."
  },
  {
    "headline": "Consensus Candidate: Adamu can’t act alone; Lawan is APC, President’s Choice – Orji Kalu",
    "summarized_story": "When asked if the decision was from the President, Kalu said, “The Chairman of the Party can not be acting on his own, alone.\nAhmed Lawan is a member of the party and he has served the party very well,” he said.\nHe added, “If the Chairman of the party had said that, it is the choice of the party and the choice of the party is the choice of the President.\nSupremacy of the party lies in the hands of the National Chairman.\nMeanwhile, there has been no response yet from the APC to confirm whether what Adamu had said was official or it was just a rumour."
  },
  {
    "headline": "BREAKING: APC governors in closed-door meeting at party HQ",
    "summarized_story": "Members of the All Progressives Congress (APC) Progressive Governors’ Forum (PGF) are currently locked up in a closed-door meeting with the party’s national leadership, at the national secretariat of the ruling party.\nIn attendance include Governors of Lagos, Babajide Sanwo-Olu, Kaduna, Nasir El-Rufai, Kano, Umar Ganduje, Plateau, Simon Lalong, Niger, Sani Bello, Nasarawa, Abdullahi Sule, Borno, Babagana Zulum, Gombe, Mohammad Inuwa Yahaya, among others.\nThe governors arrived at the party’s national secretariat around 8pm, and headed straight to the NEC Hall of the party to meet with the members of the party’s National Working Committee (NWC).\nThe meeting is not unconnected with the controversy rocking the party over the choice of the party’s presidential candidate for the 2023 presidential election.\nMore details soon…."
  },
  {
    "headline": "APC special convention: Buhari drops crucial hint as Northern APC governors, 7 NWC members disown Adamu on Lawan",
    "summarized_story": "He was reported to have said this during the National Working Committee (NWC) meeting at the party secretariat in Abuja.\nNWC divided over LawanIn a related development, the NWC members are sharply divided over the controversial endorsement of Lawan as consensus candidate.\nIn a statement signed by the Director Legal Directorate Tinubu Campaign Organisation, Babatunde Ogala, the APC national leader described the development as a legal impossibility.\n“Instructively, none of the above conditions have occurred in respect of producing the presidential candidate of the APC.\nTherefore, any declaration of a consensus candidate would be premature and a violation of extant provisions of the law."
  },
  {
    "headline": "You didn’t make Buhari president in 2015, Presidency tells Tinubu",
    "summarized_story": "The Presidency Monday berated a chieftain of the All Progressives Congress (APC) and one of the leading presidential aspirants of the party Mr Asiwaju Ahmed Bola Tinubu for claiming that he made Muhammadu Buhari president in 2015.\nIn a statement issued in Abuja, the Senior Special Assistant to the President on Media and Publicity Mr Garba Shehu said Buhari’s presidency in 2015 was delivered by thousands and voted for by tens of millions.\nHe said no single individual can or should claim to have made the Buhari Presidency possible in 2015.\nBut they were delivered by thousands and voted for by tens of millions.\n“The person most demonstrable in those qualities is the one to lead our party and our country forward.”Share this: TwitterFacebook"
  },
  {
    "headline": "Presidential primaries: At last, Buhari opens up on ‘anointed candidate’",
    "summarized_story": "President Muhamamdu Buhari Monday told northern governors elected on the platform of the All Progressives Congress (APC) that he has no anointed candidate for Tuesday’s presidential primary election of the party.\n“The President told us that for the APC presidential primaries, he has no anointed candidate and therefore directed that the Progressive Governors’ Forum meet with the National Working Committee of the party to agree and proffer further solutions and recommendations for his successor.\nHe said governors were at the Presidential Villa to apologise to the President because their decisions were leaked before they informed the President.\n“What is the political brinkmanship that we need to bring so that every component of Nigeria will feel important?\nAlso speaking, Governor Nasiru El-Rufai of Kaduna State said out of the 14 APC governors in the north, only Yahaya Bello of Kogi State, who is also an aspirant, disagreed with their position."
  },
  {
    "headline": "Agro based company promises to contribute to food security in Nigeria",
    "summarized_story": "By our correspondentAn Agricultural based company operating under the aegis of Green Agriculture West Africa Limited; GAWAL has reiterated its commitment to contribute to food security in Nigeria via quality and high yielding seeds.\nHe said that in 2017 GAWAL successfully registered a high yield rice variety – GAWAL R1 in Nigeria, which outperforms all local rice varieties returning a yield of over 8 tons per hectare.\nThis outstanding result has ensured that more and more people are showing interest in GAWAL R1 “Through different channels, a growing number of Nigerian farmers and organizations are reaching us to buy GAWAL R1 rice seeds.\n“We are aiming to introduce and register many more good quality and high-yield new rice varieties to Nigerian rice farmers”, he said.\nHe said the company was a professional seed company that not only sold seed but taught farmers advanced planting techniques for optimum yield."
  },
  {
    "headline": "Africa must not be left behind in moving from fossil fuel to renewable energy sources — President Buhari",
    "summarized_story": "Minister of mine and steel Arc Olamilekan Adegbite on Wednesday said Africa needs to join the rest of the world’s shift from fossil fuel to renewable energy sources.\nAfrica requires a huge amount of energy generation to drive its development, even as the world shifts away from fossil fuel to clean and renewable energy sources, in the fight against climate change.\n“Our meeting today provides the opportunity to share views on natural resources and energy market developments.\nAfrican Natural Resources and Mines Limited, ANRML, is a group company of the African Industries Group.\nThe mining sector is the backbone of industrialization of the economy."
  },
  {
    "headline": "Agro based company promises to contribute to food security in Nigeria via high yield rice.",
    "summarized_story": "He said that in 2017 GAWAL successfully registered a high yield rice variety – GAWAL R1 in Nigeria, which outperforms all local rice varieties returning a yield of over 8 tones per hectares.\nThis outstanding result has ensures that more and more people are showing interest in GAWAL R1.\n“We are aiming to introduce and register many more good quality and high-yield new rice varieties to Nigerian rice farmers”, he said.\nHe said the company was a professional seed company, that not only sell seed but teach farmers advance planting technique for optimum yield.\nAs one of the large-scale seed companies in Nigeria, it has supplied over 20,000 mt rice and maize seeds to Nigeria farmers in over 30 states."
  },
  {
    "headline": "Nigeria Committed to Energy Transition, Reducing Gas Emission – Silva",
    "summarized_story": "According to him, “the only viable option currently on the table is natural gas, considering vast proven gas endowments, put at 209 TCF, with 600 TCF potential reserves.\nWe cannot ignore this resource, especially when energy poverty is viciously starring at us.”“The goal of Nigeria’s gas policy is to ensure that gas development is undertaken in accordance with our socio-economic development priorities.\nAccording to him, “the implication of the above is that the issues surrounding energy poverty, climate and sustainable development are not mutually exclusive.\nBut of equal concern is the alarming level of energy poverty.\nEnergy transition is about providing clean energy, and not about discriminating between energy sources."
  },
  {
    "headline": "TRCN Registrar elected president of AFTRA",
    "summarized_story": "By Ngozi NwankwoRegistrar/CE Teachers Registration Council of Nigeria, Prof Josiah Ajiboye has been elected the President of the Africa Federation of Teaching Regulatory Authorities, AFTRA.\nAjiboye was elected the AFTRA president at the end of its 9th Annual Conference and 11th Roundtable held in Accra, Ghana, today June 1.\nNigerian Pilot Newspapers learnt that the Africa Federation of Teaching Regulatory Authorities is a continental body comprising all teaching regulatory authorities in all the 54 Africa countries.\nOther elected officers were Deputy President- Zambia, Secretary General- Ghana, Treasurer – Namibia and Assistant Secretary General- South Africa.\nHe also promised to assist countries who are yet to have teacher regulatory bodies to establish one, so that together Africa teachers will enjoy professional status and benefits."
  },
  {
    "headline": "Consensus Candidate: We Recommended Tinubu, Amaechi, Fayemi, Umahi, Osinbajo – Lalong",
    "summarized_story": "Governors of the All Progressives Congress (APC) have recommended five presidential hopefuls for the party to pick its consensus candidate.\nPlateau State Governor Simon Lalong, who is also the Chairman of the Northern Governors’ Forum, disclosed this on Tuesday during an interview on Channels Television’s Sunrise Daily.\nHe listed the aspirants as Bola Tinubu; Vice President Yemi Osinbajo; ex-Transportation Minister, Rotimi Amaechi; governors Kayode Fayemi (Ekiti) and Dave Umahi (Ebonyi).\nLalong, however, explained that the recommended aspirants were advised to hold consultations among themselves to enable them further to reduce the number of contestants.\n“The President told us any of these five are qualified to be president and have contributed to the party (APC)."
  },
  {
    "headline": "LIVE: Accreditation Begins As APC Prepares To Elect Presidential Candidate",
    "summarized_story": "This is a live update page for the All Progressives Congress (APC) special convention to elect the party’s presidential flagbearer for the 2023 general elections.\nThe event, which is holding at the Eagle Square in Abuja will see 2,340 delegates queuing to choose their preferred presidential candidate.\nTwenty-three aspirants later appeared before the APC presidential screening committee led by the party’s former chairman, John Odigie-Oyegun.\nThe northern APC governors also canvassed for the party’s candidate to come from the southern part of the country.\nHe said the presidential candidate of the party is expected to be announced by 10:pm while President Buhari will also grace the occassion."
  },
  {
    "headline": "Court Restrains INEC, Lawan, Gbajabiamila On Participation Of Statutory Delegates",
    "summarized_story": "The Appeal Court restrained them following an exparte application filed by the National Chairman of the All Progressive Congress (APC), Adamu Abdullahi.\nAll six are jointly listed as respondents to the suit.\nOn the 3rd of June, Justice Liman sitting in the Kano division of the court had held that statutory delegates can participate in primaries of political parties in accordance with the Nigerian constitution.\nJustice Liman reached this decision while giving judgement in a suit filed by Doguwa, a legislative aide to Femi Gbajabiamila, Speaker of the House of Representatives; Habibu Sani and Bilyaminu Shinkafi.\nIt adjourned to June the 9th for the hearing of the application."
  },
  {
    "headline": "Nnamani Drops Out Of APC Presidential Race, Calls For South-East Vice-Presidency",
    "summarized_story": "Former Senate President, Ken Nnamani has dropped out of the race for the All Progressives Congress’ presidential ticket.\nNnamani said his decision was motivated by the APC’s decision not to zone the presidency to the South, specifically the South-East.\nMr Nnamani advocated for a Vice Presidential candidate from the South-East.\n“No matter the outcome of the Presidential primary, I pray that our Party does justice to the Southeast that ought to present the next presidential candidate of our Party,” he said.\nAny of them can provide strong leadership to the country.”See full version of his press statement below:"
  },
  {
    "headline": "Alleged Sexual Assault: Court Fixes July 14 For Judgment In Baba Ijesha’s Trial",
    "summarized_story": "The Domestic Violence and Sexual Offences Court in Ikeja on Monday fixed July 14 for judgment in the alleged sexual assault charge against Nollywood actor, Olanrewaju Omiyinka popularly known as Baba Ijesha.\nBaba Ijesha was arraigned before the court by the Lagos State government on a six-count charge of indecent treatment of a child, defilement of a child, sexual assault by penetration, attempted sexual assault by penetration and sexual assault.\n“Exhibit A was illegally obtained as the defendant was invited because of an incident that happened seven years ago without any report made to the police.\nHe urged the court to accept the testimonies of the experts who gave their best to help resolve the case.\n“The defendant admitted to having been with the girl in both the incident that happened seven years ago and the one that happened in 2021."
  },
  {
    "headline": "We agreed on zoning for peace, stability of the country, party-Ganduje",
    "summarized_story": "Speaking on TVC’s current affairs programme Journalists’ Hangout on Sunday, the Governor stated that his advocate for a Southern presidential candidate stemmed from the need for peace and stability in the country, as well as for the All Progressives Congress, APC.\nGanduje added that dialogues have been ongoing with party members for the need to have a Southern Presidential candidate and he is happy that some have started dropping their ambition for the sake of peace and stability in the country, as well as peace and stability in the party.\nGanduje further added “We worked extremely hard to save the northern politicians’ niche, particularly those in the APC, as well as to maintain peace and stability.\n“We chose six people, including our great president, Shehu Shagari of blessed memory, Maitam Sule of blessed memory, Adamu Ciroma of blessed memory, Takar from Benue, Sola Saraki of blessed memory, and the former vice chancellor of Ahmadu Bello University, and presented them to the National Convention in Lagos, where Shagari was elected.\nYou can see that zoning is not a new concept; zoning is a gentleman’s agreement, so there is nothing new to persuade our colleagues to support this resolution."
  },
  {
    "headline": "Kolo emerges NNPP senatorial candidate for Kwara north",
    "summarized_story": "Baba Jiya Kolo has emerged as the Kwara north senatorial candidate for the New Nigeria People’s Party.\nHe emerged through a consensus arrangement held at Bode Saadu in Moro local government area of Kwara state.\nHe was affirmed as the candidate of the party by all the delegates present at the primary election.\nResponding after his election, Mr Baba Jiya Kolo promised to make youth empowerment his focal point at the senate.\nHe appealed to supporters of the New Nigeria People’s Party to avoid violence and obtain their permanent voter cards in order to be eligible to vote."
  },
  {
    "headline": "APC Presidential primary: Accreditation of delegates yet to commence at ICC",
    "summarized_story": "Accreditation of delegates is yet to commence at the international conference centre, AbujaTVC News gathered that the venue is set but the organisers are yet to kick-start the exercise.\nMore than 2,000 delegates are to be accredited for the voting at the Eagle Square in about twenty-four hours.\nSecurity operatives, the media and medical personnel are also to be accredited for ease of entry into the venue of the special convention.\nThere is a calm and serene atmosphere at the ICC, which is expected to get rowdy once the accreditation exercise begins.\nSecurity around the area have also been beefed up."
  },
  {
    "headline": "Tambuwal wins Sokoto Senatorial ticket, mobilises for PDP's return to power",
    "summarized_story": "Governor Aminu Waziri Tambuwal has emerged Senatorial candidate of the People’s Democratic Party (PDP) for Sokoto South Senatorial District.\nTambuwal will now represent seven local government areas in the red chamber in 2023 as a result of this affirmation.\nThe local government areas are: Bodinga, Dange/Shuni, Kebbe, Shagari, Tambuwal, Tureta andYabo local government areas.\nTambuwal, who compared the ruling All Progressives Congress (APC) to a critical care unit in a hospital, said the PDP and its Presidential candidate are poised to reclaim their pride of place as the country’s ruling party and president after the general elections next year.\nHe urged men, women, youths and the elderly to continue praying stating that when the time comes and campaign commences, everyone must go into the nooks and crannies of villages and communities to campaign for the party."
  },
  {
    "headline": "Zinedine Zidane Headbutt Statue to Be Re-Installed in Qatar Ahead of 2022 World Cup",
    "summarized_story": "A statue immortalising Zinedine Zidane’s headbutt during the 2006 World Cup final will be re-installed in Qatar after it was removed in 2013 amid a domestic backlash, the head of Qater Museums said on Monday.\nShe said the original public location of the statue was “not right” and that the sculpture would be remounted at a new sports museum in Doha, which is hosting the World Cup later this year.\nAlthough statues are on public display in many Muslim countries, they are less common in the Arab Gulf.\nThe sculpture by Algerian-born French artist Adel Abdessemed depicts the moment during extra time in the 2006 World Cup final when Zidane head-butted Italy‘s Marco Materazzi.\nZidane was sent off in his final match as a professional footballer, and Italy went on to beat France on penalties."
  },
  {
    "headline": "South Africa: Wealthy Gupta Brothers Arrested in UAE",
    "summarized_story": "Two brothers from the wealthy Gupta family have been arrested in the United Arab Emirates, the South African government has announced.\nAtul and Rajesh Gupta are accused in South Africa of profiting from their close links with former president Jacob Zuma and exerting unfair influence.\nExtradition talks are taking place with the UAE, South African officials say.\nThe brothers fled South Africa after a judicial commission began probing their involvement in corruption in 2018.\nAfter the brothers fled the country, South Africa negotiated an extradition treaty with the UAE in 2021."
  },
  {
    "headline": "‘Let the Delegates Decide’: Osinbajo, Tinubu, Fayemi, Amaechi, Umahi, Lawan Battle for APC Presidential Ticket – Arise News",
    "summarized_story": "Rotimi Amaechi; Ebonyi State Governor, Dave Umahi and the President of the Senate, Ahmad Lawan.\n“There are 14 APC governors out of the 19 Northern states.\nGovernors, who attended the meeting were Lagos State Governor, Babajide Sanwo-Olu; the Plateau State Governor, Simon Lalong; Governor of Nasarawa, Abdulahi Sule and Kaduna State Governor, Nasir el-Rufai, among others.\nHe, therefore, insisted that any attempt for a consensus presidential candidate must be in line with Electoral Act, which he claimed was impossible to achieve.\nOgala said, “Asiwaju Bola Tinubu believes that if there would be any consensus that he is the consensus candidate, if not, let the delegates decide, who will become the presidential candidate of the APC."
  },
  {
    "headline": "Sultan of Sokoto, Archbishop of Canterbury Condemn Terrorist Attack on Owo Church, Say It’s Crime against Humanity",
    "summarized_story": "An explosion rocked the Catholic Church on Sunday, which was immediately followed by sporadic shootings by gunmen suspected to be terrorists.\nChairman of NGF and Ekiti State Governor, Dr. Kayode Fayemi, visited Akeredolu at the Government House, Akure.\n“We urge the Ondo State government and the federal government to mobilise immediate medical supplies and other care items for victims.\nWe also commiserate with the Catholic Church and the Ondo State government for this great loss.\nHe said NCGF was traumatised and shocked by Sunday’s killings at St. Francis Catholic Church, Owo."
  },
  {
    "headline": "Elon Musk Threatens to Walk Away from Twitter Deal Over Fake Accounts",
    "summarized_story": "Elon Musk is threatening to walk away from his $44 billion bid to buy Twitter, accusing the company of refusing to give him information about its spam bot and fake accounts.\nTwitter CEO Parag Agrawal has said that Twitter has consistently estimated that fewer than 5% of its accounts are spam.\nShares of Twitter Inc. slid 1.5% Monday, likely incensing Twitter shareholders who filed a suit against Musk late last month for deflating the price of the stock.\n“We intend to close the transaction and enforce the merger agreement at the agreed price and terms,” it added.\nThe Twitter sale agreement allows Musk to get out of the deal if there is a “material adverse effect” caused by the company."
  }
]