[
  {
    "headline": "Firm unveils fashion brand, rewards distributors",
    "summarized_story": "Manufacturer of natural skincare products, Avila Naturalle Limited, has unveiled its fashion brand.\nThe President, Avila Naturalle, Mrs Temitope Mayegun, at the grand finale of the firm’s annual distributors’ summit and excellence award, said the firm offers designs with the modern family in mind.\n“Avila Fashion is aiming at becoming a continental brand name that will have several branches and outlets in cities across Africa and some countries of the world.\nMayegun noted that the new fashion brand was in furtherance to the vision of Avila Group to be a global household brand that would inspire a healthier and happier world.\nThe event also witnessed the presentation of awards and special prices to its best-performing distributors nationwide."
  },
  {
    "headline": "Reps asks IGP, others to raid Anambra kidnappers’ den",
    "summarized_story": "The operation, the House stated, is in order to “move into and dislodge the camps housing hundreds of kidnap victims, and without delay, rescue the victims, including Mr.\nSteady Idisi and Emmanuel Ifie.”The House also mandated its Committee on Police Affairs, Army and Air Force and other relevant committees to ensure compliance thereof and report back within two weeks for further legislative action.\n“They encountered gunmen suspected to be IPOB militants at Orsumoghu in Ihiala LGA of Anambra State,” the lawmaker added.\n“The House is worried that several efforts made to locate Mr.\n“By the same account, over 100 persons are held captive in that camp and are killed intermittently at the pleasure of the bandits."
  },
  {
    "headline": "COVID-19 triggers 25% increase in anxiety, depression globally — WHO",
    "summarized_story": "World Health Organisation (WHO) says COVID-19 pandemic has triggered 25 per cent increase in anxiety and depression globally in the first year of the pandemic.\n“The information we have now about the impact of COVID-19 on the world’s mental health is just the tip of the iceberg,” Dr Tedros Ghebreyesus, WHO Director-General told journalists on Wednesday.\nThe UN agency’s most recent Mental Health Atlas showed that in 2020, governments worldwide spent on average just over two per cent of their health budgets on mental health.\n“While the pandemic has generated interest in and concern for mental health, it has also revealed historical under-investment in mental health services.\n“Countries must act urgently to ensure that mental health support is available to all,” Dévora Kestel, WHO’s Director of the Department of Mental Health and Substance Use said."
  },
  {
    "headline": "Our Dubai trip to meet with agencies interested in investing in education coincided with Aisha Buhari’s birthday— Governors’ wives",
    "summarized_story": "By Idowu BankoleNigeria Governors’ Wives Forum, NGWF, has described as untrue and scandalous, stories and videos, circulating on social media and some sections of the media, alleging that some governors’ wives left Nigeria for Dubai to attend a birthday party of Nigeria’s First Lady, Aisha Buhari.\nThe Governors’ wives forum expressed shock at the footage being shared on social media, saying selected wives of governors were on the entourage of the First Lady to woo individuals interested in investing in education and technology in Africa with “priority given to young people and women”.\nSome sections of the media, not Vanguard, had reported how some wives of Nigerian governors had left Nigeria for Dubai, spotted with cakes and flowers at an event believed to be a birthday party of the First Lady, Aisha Buhari.\nOn the morning of her birthday, which was February 17th, the delegation of Governors’ Wives paid a private visit to present a cake and flowers.\n“We were therefore dismayed to see footage of the visit interpreted to mean Governors’ Wives left Nigeria for the sole purpose of celebrating his birthday."
  },
  {
    "headline": "Birthday: We didn’t visit Aisha Buhari in Dubai, we were on her entourage – Govs’ wives",
    "summarized_story": "Nigeria Governors’ Wives Forum, Wednesday described as scandalous, the news making the rounds that they travelled from Nigeria to Dubai to celebrate with the First Lady of Nigeria Dr. Aisha Buhari, on the occasion of her birthday.\nReports from online media (not Vanguard) had it that Nigeria Governors’ Wives travelled from Nigeria to Dubai to surprise Aisha Buhari on her birthday.\n“The trip coincided with the birthday of HE Aisha Buhari.\nOn the morning of her birthday, which was February 17th, the delegation of Governors’ Wives paid a private visit to present a cake and flowers.\n“We were therefore dismayed to see footage of the visit interpreted to mean Governors’ Wives left Nigeria for the sole purpose of celebrating HE’s birthday."
  },
  {
    "headline": "Nigeria in process of total collapse ― Former INEC boss, Jega",
    "summarized_story": "By Johnbosco Agbakwuru, AbujaThe former Chairman of Independent National Electoral Commission, INEC, Professor Attahiru Jega, Wednesday said that Nigeria is in the process of collapsing, alleging that reckless elite in control of the governance process are blindly running the country aground.\nThe former INEC boss, who stated this in Abuja at the 2022 Workers’ Political Conference organized by the Nigeria Labour Congress, NLC, said considering the current situation in the country, 2023 general elections may be the ‘make or break’ epochal moment.\n“While Nigeria may not have totally collapsed, it is in the process of collapsing, as reckless elite in control of the governance process are blindly running the country aground.\nAnd the 2023 general elections may be the ‘make or break’ epochal moment.\n“A broad alliance of progressive forces for national rescue and emancipation is absolutely required to get Nigeria out of the current unwholesome predicament in which it finds itself."
  },
  {
    "headline": "Oil Market: Prices surge toward $120 per barrel on OPEC decisions",
    "summarized_story": "Oil money.As Ukraine crisis deepensBy Udeme Akpan, Energy EditorTHE prices of many crudes, yesterday, surged toward $120 per barrel on the decisions of the Organisation of Petroleum Exporting Countries, OPEC.\nCompensation plans should be submitted in accordance with the statement of the 15th Ministerial Meeting.\nSimilarly, in an interview with Vanguard, Energy Partner at Bloomfield Law Practice, Ayodele Oni had also explained that the rising crude oil prices have positive and negative implications to Nigeria as a country.\n“This rising crude oil price is more disadvantageous than advantageous to Nigeria because we do not refine locally.\n“The ECA operates in a way that, if the actual oil revenue is greater than the budgeted oil revenue, we save to the ECA, but if the actual oil revenue is less than the budgeted oil revenue, we withdraw from the ECA."
  },
  {
    "headline": "Reps investigate duplication of duties by government agencies",
    "summarized_story": "The House of Representatives is investigating duplication of duties and overlapping of functions by federal government agencies.\nMonguno said the improvement must be consolidated and demanded that existing 1,484 agencies be looked into.\nHe lamented their similar functions and clash of interests, citing the concerns by the World Bank in its annual ratings.\nAfter his presentation, the House resolved to ascertain the root cause of bickering among some departments, agencies and boards.\nThe Green Chamber also agreed to establish mergers of agencies that might have outlived their usefulness in the digital age."
  },
  {
    "headline": "Reps introduce HIV Trust Fund Bill",
    "summarized_story": "The House of Representatives, on Wednesday, introduced a Bill for an Act to establish the National HIV Trust Fund of Nigeria.\nThis is coming exactly one month after President Muhammad Buhari launched HIV Trust Fund of Nigeria (HTFN) in Abuja.\nPresident Buhari, while launching the N62bn trust fund last month, said it would help Nigeria end AIDS as a public health threat and place more people living with HIV on treatment annually.\nThe President pledged that his administration would continue to prioritize health interventions to address killer diseases and public health emergencies.\nThe Bill will help in providing legislative support and utilization of HIV trust Fund as unveiled by the President."
  },
  {
    "headline": "‘Why Southern Christian should succeed Buhari’ – CAN President to EU",
    "summarized_story": "Christian Association of Nigeria (CAN) has insisted that a Christian should succeed President Muhammadu Buhari in 2023.\nThe President, Rev Samson Ayokunle, spoke at a session with an European Union (EU) Delegation led by the Chief Election Observer, Ms. Maria Arena.\nThe body sought CAN’s position on the preparation of the Independent National Electoral Commission (INEC), security agencies and political parties.\nAyokunle warned that the spate of insecurity might not allow the elections to be free and fair.\n“Since President Buhari is a Muslim from the North, in the interest of equity, fairness, social justice and cohesion, the next President should be a Christian from the South”, the cleric added."
  },
  {
    "headline": "We have lost 498 troops in Ukraine – Russia",
    "summarized_story": "Russian Ministry of Defence has disclosed the number of its servicemen killed in Ukraine since the war started.\nThe ministry disclosed that “498 Russian Servicemen have died since Thursday” when the war declared by its President, Vladimir Putin ordered startedIn a statement, the ministry said “1597 more Russian servicemen were injured.”The ministry did not explain the nature of the injuries.\nPutin had ordered what he called military operations against his neighbour for attempting NATO.\nThe battle, which started last week Thursday has continued, despite attempts to hold peace talks.\nMeanwhile, Russia cautioned NATO against getting involved in the ongoing war against Ukraine."
  },
  {
    "headline": "Fuel scarcity: NSCDC threatens to arrest marketers selling above pump price in Kogi",
    "summarized_story": "The Kogi State Command of the Nigeria Security and Civil Defence Corps (NSCDC), has threatened to arrest any petroleum marketer selling petrol above approved pump price of N162 to N165 per litre.\nDAILY POST had earlier reported that, a litre of fuel in Kogi State now sells between N250 to N500 at filling stations and black market respectively.\nSpeaking during an interview with DAILY POST on Wednesday, the Kogi State Commandant of NSCDC Suleiman Mafara said the command was aware of some sharp practices of petroleum marketers who are hoarding fuel or selling above the approved pump price.\nAccording to him, “The command has received intelligent reports that some marketers are hoarding fuel and selling it to black marketers in the night for their own selfish gains.\n“We are working tirelessly to ensure that this ill-practice such as hoarding of petroleum products, diversion and selling above pump price is controlled."
  },
  {
    "headline": "Atiku pushes on despite all odds",
    "summarized_story": "Former Vice-President Atiku Abubakar has said he has what it takes to become the President Nigeria needs in 2023 and beyond.\nAtiku spoke on Tuesday night in Abuja during an interactive session with Peoples Democratic Party (PDP) members in the House of Representatives.\nAtiku added: “This is the last chance for this country to get it right.\nBut the lawmaker expressed dismay about the incessant verbal attacks among some key PDP stakeholders, including Atiku.\nLike Atiku, Anyim is also seeking the presidential ticket of the PDP to contest the 2023 election."
  },
  {
    "headline": "Osinbajo, governors, Obasa, Gani Adams, others eulogise Adeboye at 80",
    "summarized_story": "By Oyebola Owolabi and Ernest Nwokolo, AbeokutaVice-President Yemi Osinbajo (SAN) and his wife, Dolapo, governors, Aare Onakakanfo of Yoruba land, Gani Adams and Christians yesterday poured encomiums on the General Overseer of the Redeemed Christian Church of God (RCCG), Pastor Enoch Adeboye, as he celebrated his 80th birthday.\n“Very few leaders will ever have the geographical and spiritual reach of influence that Pastor Adeboye has.\n“He was, as early as 2008, listed by Newsweek as one of the 100 most influential people in the world.\nSanwo-Olu said: “Sir, you have been a blessing, not just to the RCCG, but also to us in Lagos State.\n“It is no doubt that Pastor Adeboye is a blessing to Nigeria and the entire globe.”Lagos State House of Assembly Speaker Mudashiru Obasa said: “Many people will hardly believe that you are already 80 because your physical strength still remains intact."
  },
  {
    "headline": "FEC okays N3.5b for aviation equipment in Lagos, Abuja, Kano",
    "summarized_story": "The Federal Executive Council (FEC) yesterday approved N3,523,592,079 for projects in the Ministry of Aviation.\nAviation Minister Hadi Sirika announced this while addressing State House Correspondents after the weekly virtual FEC meeting, presided over by Vice-President Yemi Osinbajo (SAN) at the Presidential Villa in Abuja.\nSpeaking about the approvals on behalf of the minister, the Senior Special Assistant to the President on Media and Publicity in the Office of the Vice-President, Mr. Laolu Akande, said the contracts for which approvals were granted are for Abuja, Lagos and Kano international airports.\nAlso, the FEC approved two memoranda for the Ministry of Humanitarian Affairs, Disaster Management and Social Development, to help victims of human trafficking.\nMinister of Humanitarian Affairs, Disaster Management and Social Development, Hajiya Sadiya Umar Farouk, who addressed reporters during the briefing, explained that both memoranda would target specific agenda, including provision of assistance to victims, as well as rehabilitation and resettlement."
  },
  {
    "headline": "Govt kicks off process for Kyari’s extradition to U.S.",
    "summarized_story": "Govt kicks off process for Kyari’s extradition to U.S.Malami asks court to okay requestsCop challenges 14 days detention orderNigeria has approved the request by the United States for the extradition of suspended Deputy Commissioner of Police (DCP) Abba Kyari.\nA grand jury, last April 29, filed an indictment against Kyari with the approval of the U.S. District Court for the Central District of California.\nYesterday, the Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN), filed an application before the Chief Judge of the Federal High Court in Abuja for Kyari’s extradition.\nAccording to court documents, the three count-charge marked: 2:21-cr-00203-RGK, was filed on April 29, 2021, before the US District Court for the Central District of California, USA.\n“Kyari is wanted to stand trial in the United States for conspiracy to commit wire fraud and money laundering, and identity theft."
  },
  {
    "headline": "OAU student: Adedoyin, six others in Osun for trial Thursday",
    "summarized_story": "OAU student: Adedoyin, six others in Osun for trial ThursdayHotelier, Ramon Adedoyin, and six other suspects in the death of Obafemi Awolowo University, Ile-Ife, student, Timothy Adegoke, have arrived in Osogbo, Osun State, for trial today.\nCounsel to Adegoke’s family, Femi Falana, demanded that the matter be transferred to Osun after the suspects had been arraigned before a Federal High Court, Abuja.\nThe hotel owner, Adedoyin, was alleged to have unlawfully interfered with the body while Adedeji Adesola, Magdalena Chiefuna, Adeniyi Aderogba, Oluwale Lawrence, Oyetunde Kazeem and Adebayo Kunle were arraigned on seven-count charge of conspiracy, attempted murder, and murder, among others.\nMeanwhile, a top security source told The Nation that, “Chief Ramon Adedoyin and other suspects have arrived in Osun ahead of the commencement of their trial on Thursday.\nThey arrived in the state on Wednesday evening.”Police spokesman, Yemisi Opalola, confirmed that the trial will begin today."
  },
  {
    "headline": "Ukraine: Only persons documented with Nigerian Embassies will be evacuated – FG",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe Federal Government has said that only persons documented with Nigerian Embassies will be eligible for evacuation.\nNigerians can now work and earn dollars DAILY from home.\nRegular individuals can earn as low as $300 daily Find out how it works.\n“Intending evacuees should kindly note that only persons documented with the Nigerian Embassies will be eligible for evacuation.\nThe government also said those without passports will be issued Emergency Travel Certificates (ETC) to enable them travel back home."
  },
  {
    "headline": "Ukraine: Air Peace, Max Air confirm evacuation, to deploy Boeing 777-300, 747-400",
    "summarized_story": "By Chinelo ObogoAir Peace, Max Air has confirmed that they would depart the country on Wednesday night for the evacuation of Nigerians stranded abroad as a result of the war in Ukraine.\nMax Air would evacuate 560 Nigerians on Wednesday from Romania while Air Peace would convey 360 from Poland and Hungary.\nThe Chief Operating Officer of Air Peace, Mrs. Oluwatoyin Olajide confirmed the readiness of Air Peace to carry out the evacuation.\n“Air Peace will leave this night to Bucharest and Warsaw to airlift Nigerians back to the country.\nMax Air confirmed that it would depart Nigeria by 11 P.M on Wednesday with its Boeing 747-400 aircraft with capacity to airlift 560 passengers."
  },
  {
    "headline": "Ash Wednesday: Pope urges Catholics to pray for Ukraine – Archbishop Martins",
    "summarized_story": "He noted that ‘with the Ash Wednesday (March 2) the Church ushers all into the solemn season of Lent to experience the profound call to repentance and renewal.\nIn practice, fasting involves limiting oneself to a single full meal or two smaller meals a day.\nRepent and return to God by a good sacramental confession and do appropriate penance if you fall into sin.\n‘Pray before the Blessed Sacrament; go to Mass often, if possible, daily.\n‘Be regular at the Stations of the Cross on Wednesdays and Fridays and do it every day if you can."
  },
  {
    "headline": "Buhari approves $8.5 million to evacuates 5,000 Nigerians from Ukraine",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has approved the sum of $8.5 million for the immediate evacuation of at least 5,000 Nigerians fleeing from Ukraine to Poland, Romania, Hungary and Slovakia.\nDada said those to be evacuated include 940 from Romania, 150 from Slovakia and 350 from Poland who have registered for evacuation.\nSpeaking on the amount approved, Dada explained further: ‘The Ministry of Humanitarian Affairs wrote a memo to the president seeking funding to enable us to conduct this exercise.\nThe memo was to the tune of $8.5 million which Mr President has graciously approved.\nDon’t forget it will also involve taking care of those Nigerians that may decide not to come back."
  },
  {
    "headline": "Thousands of women to occupy NASS until gender bills are reconsidered",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaNigerian women have vowed to occupy the National Assembly beginning 8 am Wednesday until all gender-related bills in the constitution amendment exercise are reconsidered.\nThe statement reads in full:‘Nigeria women are disappointed and aggrieved at the actions of the 9th National Assembly (NASS) today Tuesday, March 1, 2022, when they denied women the opportunity of inclusion and representation in governance by voting against the gender bills.\n‘The proposed gender bills in the 5th Constitution Alteration Bills that were all rejected are Bills targeted at addressing the current gender imbalance across the legislative arm of governments across the country whilst reducing the under-representation of women in political office.\n‘Nigerian women, therefore, demand that all gender Bills be reconsidered.\nThis would have come down to creating 111 extra seats for women at the National Assembly."
  },
  {
    "headline": "President Insists Adamu is Preferred Candidate for APC Chair",
    "summarized_story": "The engagement provided an avenue for South-east APC governors to complain about the zoning of the office of the national secretary to South-west rather than their region.\nSo, we congratulate the National Assembly for passage of the amendments and equally congratulate Mr. President for signing the amendment.\nIt is expected that there will be serious crisis within the party after the national convention fixed for March 26.\nAspirants Write Buhari, Want National Convention HaltedThe Forum of All Progressive Congress (APC) Aspirants for National Convention wrote to President Muhammadu Buhari and urged him to halt the forthcoming national convention of the party slated for March 26.\nThe forum stated, “We crave your patience to recall the near toxic wrangling over the timing of APC’s National Convention."
  },
  {
    "headline": "Constitution Review: National Assembly Okays Autonomy for LGs, State Legislature, Judiciary",
    "summarized_story": "The Senate passed a total of 49 bills out of the 68 considered during voting on the Constitution bills.\nAlso, the federal lawmakers at the end of the exercise, approved financial autonomy for state legislatures, judiciary and local governments (LGs) in the country.\nFor the Financial Independence of State Houses of Assembly and State Judiciary, 296 members voted in favour of the proposal.\nFurthermore, 269 lawmakers voted in support of independent candidacy in presidential, governorship, National Assembly, State Houses of Assembly and local government council elections.\nHowever, his appeals were not heeded to and he thereafter vowed to expose those who voted against women bills."
  },
  {
    "headline": "Breaking: Senate Okays Financial Autonomy for State Legislature, Judiciary",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Breaking: Lawmakers Kick as Osinbajo’s Wife, Dolapo, Visits House to Observe Voting on Constitution Amendment",
    "summarized_story": "Udora OrizuSome members of the House of Representatives on Tuesday, kicked against move to usher in the Wife of the Vice President, Dolapo Osinbajo, to witness voting on the clauses up for consideration in the Constitution Amendment Bills.\nThe Speaker, Hon.\nFemi Gbajabiamila, who presided over the session had called on the House Leader, Hon.\nAdo Doguwa, to suspend relevant rules of the House and move that the VP’s wife should be ushered in to witness the proceedings.\nThis generated screams of Nays from lawmakers across party lines."
  },
  {
    "headline": "Breaking: Buhari Seeks Amendment to New Electoral Act",
    "summarized_story": "Sunday AborisadePresident Muhammadu Buhari has formally asked the Senate to amend the newly signed Electoral Act 2022.\nBuhari, in a letter to the President of the Senate, Ahmad Lawan, specifically asked the federal parliament to consider deleting Section 84 (12) which has to do with the resignation of political appointees before party primariesDetails later…..Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: Female MTN Nigeria Employees Accuse Chief Sales & Distribution Officer, Adekunle Adebiyi, Of Sexual Harassment, Knock CEO, Toriola",
    "summarized_story": "Some female employees of telecommunications company, MTN Nigeria, have accused the company's Chief Sales and Distribution Officer, Adekunle Adebiyi, of sexual harassment and other gross misconducts.\nMTN Nigeria BuildingThey also accused him of threatening such women with sacking if they fail to give in to his demands.\nWe wish men like Adekunle Adebiyi will not destroy MTN Nigeria.\n“Your sexual harassment policy is not protecting levels 1, 2 or 3 or young girls.\n“On the sexual harassment complaints raised; MTN is committed to providing a safe environment for all its employees free from discrimination on any ground and harassment at work, including sexual harassment."
  },
  {
    "headline": "EXCLUSIVE: Female MTN Nigeria Employees Accuse Chief Sales & Distribution Officer, Adekunle Adebiyi, Of Sexual Harassment, Knock CEO, Toriola",
    "summarized_story": "Some female employees of telecommunications company, MTN Nigeria, have accused the company's Chief Sales and Distribution Officer, Adekunle Adebiyi, of sexual harassment and other gross misconducts.\nMTN Nigeria BuildingThey also accused him of threatening such women with sacking if they fail to give in to his demands.\nWe wish men like Adekunle Adebiyi will not destroy MTN Nigeria.\n“Your sexual harassment policy is not protecting levels 1, 2 or 3 or young girls.\n“On the sexual harassment complaints raised; MTN is committed to providing a safe environment for all its employees free from discrimination on any ground and harassment at work, including sexual harassment."
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Petroleum Development Company Awarded $93million Contract To Firm Without Following Due Process",
    "summarized_story": "The Nigerian Petroleum Development Company (NPDC), an upstream subsidiary company of the Nigerian National Petroleum Corporation (NNPC), has awarded a $93million contract to a firm, Verteville Limited without adherence to the nation's Public Procurement Act, which is a violation of extant rules.\nThe OML 119 (formerly OPL 091) is located on the continental shelf approximately 50km from the Nigerian coast in water depths between 60-97 metres.\nSpeaking with SaharaReporters, some NPDC staff members said the contract was done in secret and characterised by fraud.\nThey added that the company awarded the contract, Verteville Limited, could not embark on such a project.\n“Number one, the award of the contract was done in violation of the Public Procurement Act, which is the statutory rule guiding how public contracts and services are awarded,” a staff member told SaharaReporters."
  },
  {
    "headline": "EXCLUSIVE: How Nigerian Petroleum Development Company Awarded $93million Contract To Firm Without Following Due Process",
    "summarized_story": "The Nigerian Petroleum Development Company (NPDC), an upstream subsidiary company of the Nigerian National Petroleum Corporation (NNPC), has awarded a $93million contract to a firm, Verteville Limited without adherence to the nation's Public Procurement Act, which is a violation of extant rules.\nThe OML 119 (formerly OPL 091) is located on the continental shelf approximately 50km from the Nigerian coast in water depths between 60-97 metres.\nSpeaking with SaharaReporters, some NPDC staff members said the contract was done in secret and characterised by fraud.\nThey added that the company awarded the contract, Verteville Limited, could not embark on such a project.\n“Number one, the award of the contract was done in violation of the Public Procurement Act, which is the statutory rule guiding how public contracts and services are awarded,” a staff member told SaharaReporters."
  },
  {
    "headline": "Russia Reveals Numbers Of Its Troops Killed, Injured In Ukraine",
    "summarized_story": "Russia's defence ministry disclosed on Wednesday that 498 Russian soldiers had died in Ukraine.\nIt was the first time that Russia had disclosed the number of casualties suffered in the war.\nThe ministry said over 2,870 Ukrainian soldiers and \"nationalists\" have been killed and about 3,700 wounded, according to Interfax.\nUkrainian authorities earlier said over 2,000 civilians had been killed in seven days since Russia launched the war.\nTen rescuers were killed and 13 were injured in the process, the statement said."
  },
  {
    "headline": "Peter Obi: Leadership failure taking a huge toll on Nigeria",
    "summarized_story": "Peter Obi, former governor of Anambra, says Nigeria needs to ensure that the right people are in leadership positions for the country to experience true development.\nAccording to him, there is also a need to address waste in the public service sector.\nAdvertisement“Public wealth enriches everybody, but private wealth impoverishes the people and the nation,” he said.\n“Whether we agree or not, failure of leadership is taking a huge toll on us as a nation and it could be worse if we do not put the right and committed people in charge of the affairs of critical sectors.\nObi, who recently declared his interest in contesting the presidency in 2023, urged governments at all levels to improve on efforts to generate revenue."
  },
  {
    "headline": "Peter Obi: Leadership failure taking a huge toll on Nigeria",
    "summarized_story": "Peter Obi, former governor of Anambra, says Nigeria needs to ensure that the right people are in leadership positions for the country to experience true development.\nAccording to him, there is also a need to address waste in the public service sector.\nAdvertisement“Public wealth enriches everybody, but private wealth impoverishes the people and the nation,” he said.\n“Whether we agree or not, failure of leadership is taking a huge toll on us as a nation and it could be worse if we do not put the right and committed people in charge of the affairs of critical sectors.\nObi, who recently declared his interest in contesting the presidency in 2023, urged governments at all levels to improve on efforts to generate revenue."
  },
  {
    "headline": "Ukraine invasion: First batch of evacuees to arrive Nigeria Thursday, says FG",
    "summarized_story": "The federal government says the first batch of Ukraine-based Nigerians who will be evacuated will arrive Nigeria on Thursday.\nFollowing the invasion of Ukraine by Russia, many residents, including Nigerians, have been forced to flee to neighbouring countries.\nThe federal government had earlier said its diplomatic mission received Nigerians in Hungary, Poland and Romania.\n“So far, we have the following records of evacuees received by Nigerian embassies at Hungary (650 persons), Poland (350 persons), Romania (940 persons) and Slovakia (150 persons).\nAdvertisement“The first batch of evacuees are expected to arrive Nigeria on Thursday, March 3, 2022."
  },
  {
    "headline": "Ukraine invasion: First batch of evacuees to arrive Nigeria Thursday, says FG",
    "summarized_story": "The federal government says the first batch of Ukraine-based Nigerians who will be evacuated will arrive Nigeria on Thursday.\nFollowing the invasion of Ukraine by Russia, many residents, including Nigerians, have been forced to flee to neighbouring countries.\nThe federal government had earlier said its diplomatic mission received Nigerians in Hungary, Poland and Romania.\n“So far, we have the following records of evacuees received by Nigerian embassies at Hungary (650 persons), Poland (350 persons), Romania (940 persons) and Slovakia (150 persons).\nAdvertisement“The first batch of evacuees are expected to arrive Nigeria on Thursday, March 3, 2022."
  },
  {
    "headline": "Okonjo-Iweala: WTO concerned about casualties, trade implications of Russia-Ukraine war",
    "summarized_story": "The World Trade Organisation (WTO) has expressed concern over the ongoing conflict between Russia and Ukraine.\nIn a statement on Wednesday, Ngozi Okonjo-Iweala, WTO director-general, called for a peaceful resolution of the situation.\nShe said the WTO is “deeply saddened” about casualties that have been sustained in the war so far.\nShe also said the conflict could disrupt trade with significant consequences for global food stability.\n“However, this is now the 7th day, and we are deeply saddened by the continued suffering and loss of life."
  },
  {
    "headline": "Amid Russian invasion of Ukraine, social media accounts were hacked to share Russian propaganda",
    "summarized_story": "But we are an internet world, so the war has also gone to social media, with each side trying to control the narrative online.\nA huge propaganda war is ongoing and social media has been crucial for sharing updates, and misinformation, about the war.\nOn February 26, social media accounts linked to Buffer, the social media scheduling tool, were hacked to spread support for Russia’s invasion of Ukraine under the hashtag #SupportRussia.\nLike most propaganda and disinformation campaigns, the accounts shared the same tweet, with the same social media asset, and at the same time.\nWith a no-holds-barred propaganda and disinformation campaign spreading on social media, it is imperative that users take digital security measures more seriously and are careful about information they consume on social media, especially at this time."
  },
  {
    "headline": "Even inheritance has a tech solution—so meet Cova",
    "summarized_story": "Do they go to your family or will they become unclaimed assets?\nIn South Africa, unclaimed assets are valued at R45 billion (~$3 billion).\nEvery nation in the world has its own reservoir of unclaimed assets.\nHow Cova worksCova is built to organise users’ assets in one place and transfer ownership to users’ listed beneficiaries in the event of their death.\nCova supports two types of assets: digital assets like bank accounts and crypto wallets; and physical assets like landed property."
  },
  {
    "headline": "Inside HUB2's digital stack for insurance providers in francophone Africa",
    "summarized_story": "A digital backbone for insurance servicesHUB2 is primarily a payments aggregator enabling interoperability between mobile money wallets within the same country.\nThe startup’s main customers come from the insurance sector.\nIn addition, digital financial services, particularly mobile money (MoMo) and agency banking are widely used by the public in francophone African markets.\nThe insurance sector in francophone Africa is a largely traditional one where paper certificates are common and delivered three to four weeks after subscription.\nHe blames this on the fact that the insurance sector is not one where investors can get the most margin."
  },
  {
    "headline": "Why did Mercury restrict tens of African startups’ accounts?",
    "summarized_story": "On Tuesday, many African entrepreneurs and tech startup founders took to twitter to express their displeasure of how Mercury, a San Francisco-based digital bank for startups, blocked their accounts without prior communication.\n— Polysaccharide Patriach (@bigbrutha_) March 1, 2022Bank Mercury blocked a bunch of African tech startups… we have work to do.\nI have a list of over 20+ African startups whose bank accounts were mass-blocked at around the same time by @BankMercury yesterday.\nhttps://t.co/vr21Pd9nq4 — Moe is mourning her crocs (@Mochievous) March 1, 2022Mercury restricted a large number of African startups’ bank accounts enmasse due to “unusual activity”.\nMany African founders and ecosystem players have come out to suggest a boycott and others have suggested a home-built alternative that only either serves African founders or black owned businesses."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, There are two types of people in the world right now: those following the Ukraine-Russian tensions..."
  },
  {
    "headline": "CDcare’s buy and “pay small small” model wants to fix Nigeria’s shaky credit culture",
    "summarized_story": "I’d help students buy laptops, and they’d pay little by little.”But his entrepreneurial sprint began a year after getting into the university.\nHe pioneered a small business that helped fellow students secure important files even after formatting their computers.\n“It’s simple; we offer a ‘pay small small for gadgets and appliances with zero interest’, and at normal market price.\nThis was a significant challenge when CDcare started, and Odukoya believes that trust is a two-way thing in eCommerce.\nMost Nigerians settle for Tokunbo because there’s really no way to ‘buy and pay small small’ for cars."
  },
  {
    "headline": "How logistics startup, Flashbike is using the Fiverr model to provide instant pick-up services",
    "summarized_story": "And perhaps — to round it up — how do you reduce customer and dispatch company headache stories?\nThe idea was simple: create a platform that aggregates dispatch riders, enables tracking, and works as quickly as a ride-hailing business.\nLike so many people, they had experienced their fair share of disappointments with delivery companies.\nAdvertisementFlashbike’s model aggregates dispatch companies to provide a pick-up service with the user given the option to pick whichever is closest to them.\nApart from implementing payments — perhaps through subscription by the companies — Flashbike wants to run ads for the logistics companies."
  },
  {
    "headline": "Truck Transit Park (TTP) marks its first anniversary with the launch of a new brand identity",
    "summarized_story": "Share this article:Truck Transit Parks (TTP) limited (Ltd), an innovative traffic management company leveraging technology to help decongest Nigerian ports, celebrated its first anniversary and unveiled its new brand on February 28, 2022.\nHe said that intensive research was done to solve truck traffic and congestion in and around ports, and technology was sourced as the solution.\nHe also said that this solution is presently being used for truck traffic management.\nAs regards the future, the MD sees TTP Ltd transforming from a traffic management company to a tech solution company.\nTruck Transit Parks Limited is a traffic management company that leverages technology and man-management systems to ease traffic challenges."
  },
  {
    "headline": "Senate Approves Financial Autonomy for state legislatures, judiciary and LGAs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Nigerian Senate has approved financial autonomy for state legislatures, judiciary and local governments in the country.\nThe approval came on Tuesday during voting on the report of the Senate Committee on the Review of the 1999 Constitution (Fifth Alteration) Bills, 2022.\nOut of a total number of 88 Senators registered to vote on the bill, 34 voted in support, and 53 against the bill.\nAlso rejected were bills to override Presidential veto in Constitution Alteration; and to override Presidential veto in respect of ordinary money bills.\nThe bill on Procedure for Overriding Presidential Veto in Constitutional Alteration seeks to provide for the procedure for passing a constitution alteration bill where the President withholds assent."
  },
  {
    "headline": "Senate Pass Bill to Summon President and Govenor – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Senate, on Tuesday, passed a bill to empower the National Assembly and State Assemblies to summon the President and State Governors to answer questions bothering on security or any other issues on which the National and State Houses of Assembly have powers to make laws.\nThe bill seeks alteration to Section 67 of the Principal Act by inserting after subsection (3), a new subsection (4).\nThe chamber also approved a bill to include Presiding Officers on the membership of the National Security Council.\nThe bill seeks to alter Section 129 of the Principal Act to insert after subsection (2), a new subsection (3).\nThe chamber, however, turned down a bill to provide for more seats for women in the National and State Houses of Assembly."
  },
  {
    "headline": "Obaseki faults sharing formula for FG’s conditional cash transfer programme, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has faulted the sharing formula for the Federal Government’s conditional cash transfer programme and the distribution of other social amenities.\nHe said this when he received the Executive Chairman of the Federal Character Commission, on a courtesy visit to the Government House, in Benin City, Edo State.\nObaseki said: “In terms of fair distribution of social services, the Commission has not done much.\nI urge the commission never to allow what happened during the sharing of conditional cash transfer from the Federal Government to happen again.\n“Nigerians are not happy and are angry with the way the conditional cash transfer and sharing of social and economic amenities were handled."
  },
  {
    "headline": "Obaseki harps on transparency, accountability in public procurement amid dwindling resources – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…to partner UNDP to create more jobs for Edo youthsThe Edo State Governor, Mr. Godwin Obaseki, has called for transparency and accountability in the use of public resources amid the decline in government revenue.\nObaseki gave the charge when he received a delegation of the United Nations Development Programme (UNDP), Accountability Lab and Open Contracting Partnership, at the Government House, in Benin City, the Edo State capital.\n“Transparency and accountability are key and core to our administration.\nIt is important that we show to our people how we have spent the money we got from them.\nWe need to domesticate the Nigeria Jubilee Fellows Programmes (NJFP) and need the help of UNDP."
  },
  {
    "headline": "Osun 2022: Oyetola will win, but salary payment will cease – Bishop (Video)",
    "summarized_story": "Isaac Oluyamo, the Diocesan Bishop of Ijesa North, Anglican Communion, on Sunday said Gov.\nGboyega Oyetola of Osun would win the Osun governorship election in July, but salary payment of workers will cease for four years.\nOyetola will win the governorship election, but for four years there will be no salary.”He said the second term of governors and governments is always tough.\nThe Bishop thereafter admonished members of the congregation to go out and vote when the election comes.\nIn her acceptance speech, Mrs Foluke Dada thanked the Bishop and the Church for finding her worthy for the chieftaincy bestowed upon her."
  },
  {
    "headline": "FG maps out $8.5m for evacuation of Nigerians in Ukraine",
    "summarized_story": "President Muhammadu Buhari has approved $8.5m dollars to the ministries of Foreign Affairs and Humanitarian, Disaster Management, and Social Development, towards the evacuation of Nigerians stranded in Ukraine, Minister of State for Foreign Affairs, Zubairu Dada, has said.\nThe minister who told State House correspondents after the Federal Executive Council (FEC) meeting on Wednesday that three aircraft would be dispatched to four countries, explained that those to be brought back include over 5,000 (registered and unregistered) NigeriansAccording to him, the countries where the pickup flights would be headed include – Poland, Hungary, Slovakia, and Romania.\nTwo flights from Air Peace and one from Max Air are expected to carry out the evacuation exercise.\nMr Dada said all agencies are fully resourced to ensure that aircraft leave on Wednesday to begin the evacuation.\nThey noted that the flights will embark on a number of shifts until the process is complete."
  },
  {
    "headline": "U.S. govt marks 75th anniversary of Fulbright Program, commits to promoting understanding with Nigeria",
    "summarized_story": "The U.S. government has said it is committed to creating educational and cultural exchange opportunities that promote dialogue and mutual understanding between the people of Nigeria and the United States.\nThe U.S. Mission to Nigeria organized series of events to commemorate the anniversary mark the 75th anniversary of the Fulbright Program.\nShe noted that through the Fulbright program, participants have expanded and strengthened the diversity of their educational institutions and have become members of an international community of scholars that collaborate on projects and research.\nPresident of the Fulbright Alumni Association in Nigeria, Dr. Adele Garkida, applauded the U.S. Mission for its support and commitment to providing educational and cultural exchange opportunities for university faculty.\nSince 1960, there have been over 1,200 Fulbright scholars throughout Nigeria, many of whom currently occupy leadership positions in government as well as public, private and international institutions."
  },
  {
    "headline": "Ugwuanyi lifts ban on tricycle operators, others in Enugu",
    "summarized_story": "Enugu State governor, Ifeanyi Ugwuanyi, on Tuesday lifted a ban he placed on tricycles, motorcycles and tippers in some parts of the state.\nGovernor Ugwuanyi lifted the ban during a security meeting between him and leaders of the Association of Tricycle Riders Transport Union, Enugu State, Motorcycle Transport Union of Enugu State, Nkanu East/West branches and the Enugu State Tipper Union of Nigeria.\nMr Ikah condemned the activities of those who used tricycles for criminal activities in the state.\nHe promised that they would leave no stone unturned in ensuring that those using tricycles for criminal activities were fished out.\nAlso speaking, the President, Enugu State Tipper Union of Nigeria, Andrew Nweke, expressed dismay that the union had been infiltrated by criminals."
  },
  {
    "headline": "Russia Attacks Key Ukraine Cities… ‘They Will Bomb Us To Ashes’",
    "summarized_story": "People in Kharkiv have been appealing for international help to stop Russia’s aerial bombardment of the north-eastern city.\nGlib Mazepas who lives in the city centre wants Nato to enforce a no-fly zone over Ukraine.\nBecause they will just bomb the whole city to the ashes.”Authorities there say four people were killed in Russian shelling this morning.\nI never thought it would be like this.”Four killed as Kharkiv assault intensifiesEmergency services in the eastern city of Kharkiv say four people have been killed by Russian shelling this morning.\nThe city’s mayor says Kharkiv is “partially surrounded” by the Russian army, which the Ukrainian military is currently holding back “heroically”."
  },
  {
    "headline": "Court Okays Umahi’s Defection To APC",
    "summarized_story": "Ogbonnaya Okorie had approached the High Court seeking the court to interpret the Constitution if the Governor should not vacate office having defected from his party.\nADVERTISEMENTConsidering the submissions of both parties, the Court held that having regard to section 188 (1) of the 1999 Constitution as amended, the defendant (Governor Umahi) has not offended any provision of the Constitution or the Electoral Act in his defection to APC.\n“Every constitutional provision relating to the office of President and Vice president they are corresponding provision relating to the governor and his Deputy”.\n“As far back as 2007 the Supreme Court had ruled that there are no consequences for President and Vice President defecting from one political party or another.\nUchenna Orji commended the court for the judgement noting that the judgement is victory for Democracy."
  },
  {
    "headline": "NOTAP Partners DALOKS TechnoServe To Build Franchise For",
    "summarized_story": "The National Office for Technology Acquisition and Promotion (NOTAP) is collaborating with DALOKS Technoserve, to build franchises for Small and Medium Enterprises (SMEs) in Nigeria to promote their business brands in the country and the world.\nHe said that NOTAP has made a survey about Nigerian cuisine, and identified those that can be transformed into franchises, which the government has standardized.\nADVERTISEMENTThe Managing Director of DALOKS Technoserve Mr. Chuks Nwanodu told reporters that the collaboration with NOTAP gives opportunity to individual companies to showcase their capacity and also enable small businesses to grow.\nHe said the government through NOTAP is trying to encourage young Nigerian businesses to grow bigger and higher and spread their tentacles using their franchise, which they can sell to others while still retaining their foundational brands.\nThe CEO/Executive Secretary American Business Council, Margaret Olele in her presentation tagged “Franchise As Business Growth Accelerator” noted that small businesses can grow and add to the economic growth of the country through franchise."
  },
  {
    "headline": "2023: Give Us Peter Obi, Get 10m Votes, Youths Tell PDP",
    "summarized_story": "A group of young Nigerians under the auspices of #TakeBackNaija# Movement has promised the Peoples Democratic Party (PDP) of over 10million votes at the 2023 presidential election, should the party present former Anambra State governor, Mr Peter Obi, as the party’s flag bearer.\nThe national coordinator of the group Comrade Ali Mohammad, who made this known in Yenagoa after an interactive session with youth groups and other stakeholders ahead of the party’s primaries, pleaded with the PDP leadership to consider Peter Obi as the presidential flag bearer, considering the fact that what is at stake in 2023 is beyond party politics, but a case of rescuing the country.\nComrade Mohammed through the statement pointed out that Peter Obi is the most popular candidate amongst the Nigerian youths, as well as the elites, and most importantly, is acceptable across the six geopolitical zones, that are yearning for a credible, visionary and passionate leader, who will transform the fortunes of the country, once given the opportunity.\nHe reiterated that research carried out shows that young persons would troop out en masse to vote in 2023, if the party presents them with a candidate that represents the interest of the youths, and has a plan to revive the country’s dying economy.\nADVERTISEMENT"
  },
  {
    "headline": "Army Gets New Ultra-modern Operations Centre",
    "summarized_story": "The Chief of Army Staff, Lt Gen Faruk Yahaya, has commissioned the newly constructed Nigerian Army ultra-modern operations centre, situated at the Army headquarters complex.\nThe new centre will coordinate and control all Army operational engagements across theatres of operations nationwide.\nThe Chief of Army Staff commended his predecessor, Lt Gen (rtd) Tukur Yusufu Buratai for his foresight in conceiving the project, adding that the new operations centre will serve as a command centre, situation room, as well as operational briefing center for the Army.\nBuratai pointed out that planning and execution are very critical in the success of military operations, stressing that to have a befitting ultra-modern operations centre is an indication of Nigeria Army’s, dynamism seriousness and commitment to professionally perform its constitutional roles.\nADVERTISEMENTIn his welcome address, the chief of operations (Army), Maj Gen Olufemi Akinjobi stated that the centre is equipped with state-of-the-art facilities, that will enable it serve tripartite functions of Command Centre, situation room and operations briefing facility."
  },
  {
    "headline": "Petrol scarcity: NNPC begins 24-hour loading of trucks at depots",
    "summarized_story": "By Emmanuella AnokamPetrol queues at fuel stations will soon disappear as NNPC said today it has begun a round-the-clock loading of trucks at depots.\nThe company said the move will clear current petrol scarcity experienced across the country.\n“Typically in situations like this, people go to the fuel stations and buy in excess of what they need and this is what additional supply will resolve.\nKyari said that neither the Federal Government nor the NNPC had any plan to raise the pump price of petrol.\nHe urged marketers to ensure that they sell petrol at the price approved by the government."
  },
  {
    "headline": "Abramovich plans to sell Chelsea, donate proceeds to Ukraine war victims",
    "summarized_story": "Russian billionaire, Roman Abramovich has said he would sell Chelsea FC and donate the net proceeds to a charitable foundation for the benefit of “all victims of the war in Ukraine.”According to Abramovich, this included providing critical funds towards the urgent and immediate needs of victims, as well as supporting the long-term work of recovery.\nAbramovich, who has denied close financial links to Russian President Vladimir Putin or the Kremlin but has come under increasing scrutiny in recent days, says the sale will not be fast-tracked.\nBBC reports that the Chelsea owner will not be asking for the loans of £1.5bn he has made to the club to be repaid.\nLabour leader Sir Keir Starmer called today for the 55-year-old to face sanctions, saying he is a “person of interest to the Home Office because of his links to the Russian state”."
  },
  {
    "headline": "Spiritualist Mutholib docked for allegedly defrauding victim $100,000, N1m",
    "summarized_story": "By Akin KuponiyiA self-styled acclaimed spiritualist Olalekan Mutholib has been arraigned before a Federal High Court, Lagos, Southwest Nigeria for allegedly swindling one Raji Babajide to the tune of $100,000 and N1,050,000.\nHe was arraigned by Economic and Financial Crimes Commission (EFCC).\nHis counsel, A.B.Odetoki urged the court to grant him bail in liberal terms, on the ground of ill health, as the accused has been under going surgical operations before his arrest and detention.\nAfter listening to the argument and submission of the two parties, the presiding Judge, Nicholas Oweibo adjourned till Friday, 4 May, 2022 for ruling.\nThe offences committed are as in the charge stated below:"
  },
  {
    "headline": "Four internet fraudsters sent to jail in Ibadan",
    "summarized_story": "The Ibadan Zonal Command of the Economic and Financial Crimes Commission, EFCC has secured the conviction of four internet fraudsters before Justice Uche Agomoh of the Federal High Court, in Ibadan, Oyo State on separate charges which bordered on impersonation.\nThe offence is contrary to Section 22 (2) (b) (i) of the Cybercrimes (Prohibition, Prevention etc.)\nThe convicts are: Ajibola Ibrahim Tomiwa, Abdullahi Nurudeen Owolabi, Popoola Salmon Olabode and Hassan Yusuf Atanda.\nJustice Agomoh thereafter, convicted and sentenced Ajibola to seven months imprisonment; Owolabi to ten months, Popoola eight months and Atanda five months imprisonment.\nAlso, the court ordered that the convicts restitute their victims, and forfeit all items recovered from them to the Federal Government of Nigeria."
  },
  {
    "headline": "Senior Lawyer Sues Heritage Bank Over Alleged Account Manipulation",
    "summarized_story": "The bank operated the Plaintiff’s account outside the standard of good banking practice and that the bank conducted its banking business outside the ethical and professional manner consistent with global best practice.\nThe bank breached the duty to exercise reasonable skill and care as well as that of confidentiality in the running of the Plaintiff’s account.\nSection 31(d) of the Federal Inland Revenue Service (Establishment) Act allows the Federal Inland Revenue Service to “require any person to give information as to any money, fund or other assets which may be held by him for, or of any money due from him to, any person”.\nRather, a lien was legally and properly placed on the Plaintiff’s account in view of the Plaintiff’s failure to resolve all outstanding tax issues with the Federal Inland Revenue Service.\nThe Bank further avers that the lien placed on the Plaintiff’s Account has been lifted since 20 January 2020 and lodgements made by the Plaintiff in excess of N76,000 are reflected in the Plaintiff’s account."
  },
  {
    "headline": "BREAKING: 168 Passengers Escape Death As Dana Air Plane Develops Fault Minutes Before Take-Off",
    "summarized_story": "Over 168 passengers of Dana Air flight 9J359 Lagos to Abuja have escaped death following a strange faulty sound from the aircraft while approaching the Muritala Mohammed Airport runway for take-off, NewsDirect can report.\nThis medium learnt that the plane had been cleared for take-off and was taxing towards the runway for take-off when a strange sound and alarm sounded.\nThe passengers raised their voices in frightened voices and they insisted that the plane will not take them to their destination.\nThe Dana Air flight 9J359 Lagos to Abuja had a scheduled departure time of 5.55pm while it was supposed to land in Abuja approximately an hour later.\nMeanwhile, the passengers have been returned to the tarmac and awaiting the reaction of the Dana Air management."
  },
  {
    "headline": "BREAKING: Again, Fire Outbreak Hits Muna IDP Camp",
    "summarized_story": "Hundreds of people have been uprooted again when a fire devastated an internally displaced camp in Borno State’s Mafa Local Government Area on Wednesday, according to sources.\nThis comes after the same Muna Al-Barnawi IDP camp in Maiduguri was devastated by flames only a few weeks ago.\nOver 3,000 shelters were destroyed in the incident that occurred two weeks earlier.\nThe fire started after 12 p.m. and destroyed an unspecified number of IDP temporary homes, according to reports.\n“We are yet to know the cause of the fire but more than hundreds of temporary shelters were destroyed."
  },
  {
    "headline": "Buhari Regime To Spend N3.5 Billion To Evacuate Nigerians In Ukraine",
    "summarized_story": "According to Zubairu Dada, Minister of State for Foreign Affairs, President Muhammadu Buhari has sanctioned N3.5 billion for the evacuation of Nigerians stranded in war-torn Ukraine.\nThe amount was approved, according to Mrs Dada, at the monthly Federal Executive Council (FEC) meeting on Wednesday, which was presided over by the Vice President.\nAir Peace and Max airlines have already been engaged by the federal government to carry out the evacuation using three planes.\nThe evacuation is scheduled to take place in Romania, Hungary, and Poland, where many Nigerians have sought refuge in the aftermath of Russian forces’ deadly attacks in Ukraine.\nCitizens seeking refuge in Nigerian embassies in the aforementioned countries will be accommodated while efforts are made to repatriate them home, the ministry of foreign affairs announced earlier this week."
  },
  {
    "headline": "Breaking: Uproar as FCTA ‘s bulldozer moves to Area 1, pull down ‘illegal structures’ near old federal secretariat",
    "summarized_story": "The Federal Capital Territory Administration (FCTA) has begun mass demolition of illegal structures behind the old Federal Secretariat at Area I in Abuja.\nThe administration had in February, 2022 issued a demolition notice to owners of the structures with reminder on March 1 to leave the place.\nHe regretted that the secretariat that houses the Ministers of Interior, Trade and Investment have been taken over by the illegal structures which constituted security threat to the nation’s capital.\nAttah explained that the demolition followed series of complains received about the area from security agencies and strategic persons, recently.\nSo we are ready to leave, as the government has made it clear that they don’t want people to be there.”"
  },
  {
    "headline": "Breaking: Buhari approves $8.5m for evacuation of Nigerians from Ukraine",
    "summarized_story": "Up to $8.5 million has been approved by President Muhammadu Buhari for the evacuation of stranded Nigerians from troubled Ukraine.\nThe presidential approval was given to the ministries of Foreign Affairs and Humanitarian, Disaster Management, and Social Development.\nThe Minister of State for Foreign Affairs, Zubairu Dada, who disclosed this in Abuja told State House correspondents after the Federal Executive Council (FEC) meeting that three aircraft would be dispatched to four countries.\nHe said the pickup flights from Air Peace and one from Max Air would be headed to Poland, Hungary, Slovakia, and Romania."
  },
  {
    "headline": "[Breaking] Ukraine invasion: Over 100 Nigerians storm embassy, volunteer to fight Russian troops",
    "summarized_story": "Following the call for volunteer fighters by the Ukrainian president, Volodymyr Zelensky, about 115 Nigerian youths, Wednesday, stormed Ukraine embassy in an effort to join Ukraine in its fight against Russia.\nThe youths in their large numbers visited the Ukraine Embassy in Abuja, and were directed by the embassy to put down their names in a register provided.\nThe second secretary, Ukraine Embassy, Bohdan Soltys, confirmed the development, adding that no step had yet been taken to that effect.\nThe volunteers are believed to be responding to a recent call by Ukrainian President, Volodymyr Zelensky, urging people around the world to join the fight.\nZelensky had called on anyone who wished to join the defense of Ukraine, Europe and the world to come and fight side by side with Ukrainians."
  },
  {
    "headline": "Okonjo-Iweala: WTO Saddened By Suffering, Trade Implication Of Russia-Ukraine War",
    "summarized_story": "The Director-General of the World Trade Organisation, Dr Ngozi Okonjo-Iweala, on Friday said the organisation was “deeply saddened by the continued suffering and loss of life” as a result of the war in Ukraine.\nShe said this in a statement on Wednesday, as the war which has shocked the world and threatened global stability entered its seventh day.\nThe WTO had hoped that war would be averted but that hope was dashed.\nWith the battle raging on and talks between Ukraine and Russia yet to yield results, the WTO is concerned about the implications.\nOn Friday, Dr Okonjo-Iweala warned about the “economic impacts” of the war in Ukraine, a major wheat exporter, saying it would hurt consumers around the world."
  },
  {
    "headline": "First Batch Of Evacuees From Ukraine Expected To Arrive In Nigeria On Thursday",
    "summarized_story": "The first batch of Nigerian evacuees from Ukraine is expected to arrive in Nigeria on Thursday.\nThis was disclosed in a statement on Wednesday by the Permanent Secretary, Ministry of Foreign Affairs, Ambassador Gabriel Aduda.\nAccording to the statement, chattered flights will begin picking up Nigerian evacuees back home from the neighbouring countries surrounding Ukraine on Wednesday.\n“The capacity and route of the airlines are as follows: Max Air to Romania 560 persons, Air Peace to Poland, 364 persons and Air Peace to Hungary 360 persons”.\nAduda assured Nigerians that the government is working round the clock to see that citizens are brought back home safely."
  },
  {
    "headline": "Male Lawmakers Against Gender Bills Have No Respect For Women – Minister",
    "summarized_story": "﻿The Minister of Women Affairs, Pauline Tallen, says male lawmakers who voted against gender bills seeking to amend the constitution have no regard for women.\n“It clearly shows that the men that were against the bill don’t have any respect for women; it’s clear.\nRead Also: Failed Bills: Women Groups Storm NASS Gate In ProtestAccording to her, Nigerian women are already strategising on the next line of action.\nOn Tuesday, the lawmakers had voted against bills seeking to promote more opportunities for women in political parties and governance.\nVarious women groups occupied the gate of the National Assembly in protest against the rejection of the bills."
  },
  {
    "headline": "Buhari Approves $8.5m For Evacuation Of Nigerians In Ukraine",
    "summarized_story": "﻿President Muhammadu Buhari has approved $8.5m dollars to the ministries of Foreign Affairs and Humanitarian, Disaster Management, and Social Development, towards the evacuation of over 5,000 (registered and unregistered) Nigerians stranded in Ukraine.\nThis was disclosed on Wednesday by the Minister of State for Foreign Affairs, Zubairu Dada.\nThe minister told State House correspondents after the Federal Executive Council (FEC) meeting that three aircraft would be dispatched to four countries.\nTwo flights from Air Peace and one from Max Air are expected to carry out the evacuation exercise.\nMr Dada said all agencies are fully resourced to ensure that aircraft leave on Wednesday to begin the evacuation."
  },
  {
    "headline": "Abramovich To Sell Chelsea With ‘Net Proceeds’ Going To Ukraine War Victims",
    "summarized_story": "Chelsea’s Russian owner Roman Abramovich said on Wednesday he had made the “incredibly difficult” decision to sell the Premier League club, pledging that proceeds would go to victims of the war in Ukraine.\nThe dramatic development comes days after Abramovich said he was handing over control of Chelsea to trustees of its charitable foundation following Russia’s invasion of Ukraine.\nChelsea have won 19 major trophies in the Abramovich era, including their first two Champions League crowns and five Premier League titles.\nAbramovich, who made a rare appearance to watch Chelsea win the Club World Cup in Abu Dhabi last month, has pledged to donate any net proceeds from the sale to help victims of the war in Ukraine.\n“The foundation will be for the benefit of all victims of the war in Ukraine."
  },
  {
    "headline": "Women Groups, CSO's to occupy National Assembly on Wednesday -",
    "summarized_story": "Women and civil society groups are set to occupy the National Assembly on Wednesday, over decision of the lawmakers to vote against bill seeking to create special seats for women in federal and state parliaments.\nThis decision was made after a virtual press conference in Lagos, presided over by the Founding Director of Women Advocates Research & Documentation Centre, Abiola Akiyode-Afolabi.\nAdvertisementThe decision by the lawmakers means women are denied 35% appointed positions, 35% affirmative action in party administration and leadership, while it declined citizenship to the foreign-born husband of a Nigerian woman.\nIt allows a foreign-born wife of a Nigerian get automatic citizenship, but denies women the ability to take indigeneship of their husband’s state, until after 5 years of being together.\nAdvertisementThe civil society groups and other concerned Nigerians vowed to name and shame the lawmakers for voting against the bill, aimed at promoting gender equality in Nigeria."
  },
  {
    "headline": "Senate separates AGF, Minister of Justice office",
    "summarized_story": "The senate has passed bill for separation of the office of the Attorney General of the Federation and that of the State from the Office of the Minister and Commissioner of Justice.\nThe red chamber also passed the bill for the removal of transitional Lawmaking powers of the executive but rejected the bill for expansion of the scope of Executive immunity to include other Arms of Government- Section 308AdvertisementIn the same vein, the senate also passed the bill for membership of the National Security Council to Include Presiding Officers of the National Assembly.\nThe lawmakers also passed amendment for legislative powers to summon the President and GovernorsAdvertisementMeanwhile, the House of Representatives has rejected the bill seeking to include diaspora voting in the constitution.\nOut of the 298 votes, 58 voted for the bill while 240 voted against.\nThe Senate however passed the bill for independent candidacy to contest for an elective position"
  },
  {
    "headline": "Former Governor, Segun Oni, joins SDP, emerges Ekiti Governorship candidate -",
    "summarized_story": "The Former Governor of Ekiti State, Chief Segun Oni describes the outcome of the PDP Primary in Ekiti State as disgraceful and pitching his tent with the SDP is the right step in giving Ekiti People a new lease of life.\nHe urged the Electorate to Collect their PVCs and stay alert before, during, and after the Elections assuring the People that he is ready to govern the State"
  },
  {
    "headline": "Buhari writes Senate, seeks amendment of Section 84 (12) in Electoral Act",
    "summarized_story": "The Nigerian Senate has received a letter from President Muhammadu Buhari seeking amendment to section 84 subsection 2 and subsection 12 in the 2022 Electoral Act.\nPresident Buhari in his letter that was read on the floor by President of the Senate wants the National Assembly to amend section 84 which states that no political appointee shall be a voting delegate or be voted for at the convention or congress of any political party for the purpose of the nomination of any candidate for an election.\nAdvertisementThe President said the amendment is necessary as the clause constitutes a fundamental defect and leads to the disenfranchisement of political officeholders.\nPresident Buhari added that the provision introduced qualification and disqualification criteria that ultra-vires the Constitution by way of importing blanket restrictions to serving political officeholders."
  },
  {
    "headline": "Muda Yusuf: Sanctions Alone Won’t Solve Ukrainian Problem",
    "summarized_story": "As the effects of the Russian invasion of Ukraine and the raft of sanctions imposed on Russia start to take their toll, countries around the world brace up for inflationary spikes, disruptions to global supplies, and worse still, the prospect of a global recession.\nIn a report released on Tuesday, former Director General of the Lagos Chamber of Commerce and Industry, Muda Yusuf, warned that there would be significant macroeconomic outcomes for Nigeria.\nAccording to him, these include a spike in the fiscal deficit, rising debt levels, higher debt service payments, money supply growth, exchange rate depreciation, and intense inflationary pressure.\nYusuf points to Russia’s position as the second-largest producer of oil globally, noting that the conflict in the region would disrupt oil supplies, reduce output and trigger higher prices.\nThe ongoing tension in Eastern Europe, with huge sanctions, may also affect bilateral discussions, which had progressed significantly between Nigeria and Russia on the resuscitation of the Ajaokuta Steel Plant, he added."
  },
  {
    "headline": "Nigerian Woman’s Ordeal In Ukraine – Trending with Ojy Okpe – Arise News",
    "summarized_story": "A Nigerian Woman has narrated her ordeal in Ukraine amid the outrage over racial discrimination faced by #AfricansinukraineNigerian Embassy in Warsaw, the capital of Poland, began evacuating Ukraine-based Nigerians from Polish borders on February 26th.\nNigerians have reacted to a video showing a group of women believed to be wives of Nigerian governors singing and dancing in celebration of Nigeria’s First Lady Aisha Buhari’s birthday."
  },
  {
    "headline": "As Russia Bombards Ukranian Cities, Biden Warns Putin ‘Has No Idea What’s Coming",
    "summarized_story": "U.S. President Joe Biden warned Vladimir Putin that the Russian leader “has no idea what’s coming”, as Western nations tightened an economic noose around Russia, whose invading forces bombarded Ukrainian cities and appeared poised for an advance on Kyiv.\nHundreds of thousands of Ukrainians have fled the fighting since Putin ordered a full-scale invasion nearly a week ago, with a miles-long Russian military convoy north of Kyiv readying to advance on the capital.\nStraying from the prepared text, Biden added “He has no idea what’s coming.” He did not elaborate.\nread moreUkrainian President Volodymyr Zelenskiy called on Russia to stop bombarding civilians and resume talks.\nWest of Kyiv, in the city of Zhytomyr, four people, including a child, were killed on Tuesday by a Russian cruise missile, a Ukrainian official said."
  },
  {
    "headline": "Buhari Leaves Nigeria for Kenya, Before Travelling to London for Routine Medicals",
    "summarized_story": "Nigeria President Muhammadu Buhari departed Abuja on Tuesday for a three-day official visit to Nairobi, Kenya from where he would proceed to London for routine medical checks that may last two weeks.\nSpecial Adviser to the President on Media and Publicity, Femi Adesina, in a statement disclosed that President Buhari’s medical check-up in UK would last maximum of two weeks.\nMember States are vital partners in formulating UNEP’s policy, implementing UNEP’s programme and championing solutions to our shared environmental challenges.\nBut each nation has a crucial role to play in protecting our people and planet.”Buhari is expected to deliver the National Statement of the country and participate in High Level Dialogue Sessions on the Environment at the event.\nAccording to the statement, Buhari believed Adeboye’s contributions to the betterment of Nigeria and other countries stand out clearly as testimonies of his divine calling, impacting greatly on education, health and infrastructural development, which include many urban and rural roads."
  },
  {
    "headline": "Nigeria Says 70% of Armed Forces Engage in Domestic Policing Due to Insecurity",
    "summarized_story": "Nigeria’s federal government has disclosed that about 70 per cent of officers of the Nigerian Armed forces are currently engaged in domestic policing operations in the country.\nHe said: “Close to 70 per cent of Nigerian armed forces personnel are engaged in policing duties across the 36 states of the federation.\nIrabor said: “The popular one, which people do not want to hear about, is the rehabilitation of repentant Boko Haram that have surrendered their weapons.\nAnd over 23,000 of them have surrendered to the Nigerian armed forces, thereby helping to mop up small arms in circulation.\n“As we approach an election year, we recommend that the government separate politics from security and that the security agencies stay off politics."
  }
]