[
  {
    "headline": "How fear of litigation, safety concerns are fuelling caesarean section delivery –Gynaecologists",
    "summarized_story": "Lara AdejoroMedical experts say the fear of litigation and patients’ demand are among the major factors influencing the rising incidence of caesarean section in the world.\nAkinola said while the rate of CS is low in Nigeria, it is becoming an epidemic in some countries.\nOverall, our CS rate is probably about 6 percent, if not lesser,” he said.\n“And the higher the rate of litigation, the higher the CS rate.\n“Medical practitioners are making conscious efforts and making reviews to keep the caesarean section rate to the barest minimum,” he said."
  },
  {
    "headline": "How fear of litigation, safety concerns are fuelling caesarean section delivery –Gynaecologists",
    "summarized_story": "Lara AdejoroMedical experts say the fear of litigation and patients’ demand are among the major factors influencing the rising incidence of caesarean section in the world.\nAkinola said while the rate of CS is low in Nigeria, it is becoming an epidemic in some countries.\nOverall, our CS rate is probably about 6 percent, if not lesser,” he said.\n“And the higher the rate of litigation, the higher the CS rate.\n“Medical practitioners are making conscious efforts and making reviews to keep the caesarean section rate to the barest minimum,” he said."
  },
  {
    "headline": "‘Drinking too much alcohol in a short period could cause sudden heart failure, death’",
    "summarized_story": "Lara AdejoroA medical practitioner, Dr. Chinonso Egemba, says drinking a lot of alcohol within a short period can lead to sudden heart failure and death.\nDr. Egemba, who is popularly known as ‘Aproko Doctor’ noted that the liver can only process about one unit of alcohol per hour.\nThe doctor was reacting to a viral video of a man who reportedly died after gulping a bottle of spirit alcohol in a competition, via his Instagram handle @aproko_doctor.\nDrinking a lot of alcohol within a short period is very risky and could kill you.\n“Your liver can only process roughly one unit of alcohol per hour, a can of beer is roughly two units."
  },
  {
    "headline": "‘Drinking too much alcohol in a short period could cause sudden heart failure, death’",
    "summarized_story": "Lara AdejoroA medical practitioner, Dr. Chinonso Egemba, says drinking a lot of alcohol within a short period can lead to sudden heart failure and death.\nDr. Egemba, who is popularly known as ‘Aproko Doctor’ noted that the liver can only process about one unit of alcohol per hour.\nThe doctor was reacting to a viral video of a man who reportedly died after gulping a bottle of spirit alcohol in a competition, via his Instagram handle @aproko_doctor.\nDrinking a lot of alcohol within a short period is very risky and could kill you.\n“Your liver can only process roughly one unit of alcohol per hour, a can of beer is roughly two units."
  },
  {
    "headline": "Ondo 2020: PDP raises alarm over non release of CTC of Appeal Court judgment",
    "summarized_story": "Dayo Johnson AkureThe Peoples Democratic Party (PDP) has raised the alarm over the non-release of the Certified True Copies of last week’s judgment of the Court of Appeal to its governorship candidate, Eyitayo JegedeRecall that the Court of Appeal, Akure Division had last week dismissed Jegede’s appeal against the verdict of the Elections Petitions Tribunal, which upheld the victory of Governor Rotimi Akeredolu.\nConsequently, Jegede and his party, the PDP had announced their decisions to challenge the verdict at the Supreme Court.\nBut the Ondo State chapter of the party, weekend raised the alarm of a ploy to deny its candidate justice in the apex court, as six days after the judgment, the certified true copies of the suit have not been released to Jegede.\nThe party said that the Supreme Court has only 60 days within which to conclude hearing of the appeal.\nAlso, the Eyitayo Jegede Campaign Organisation (EJCO) has followed suit in a statement complaining about the delay in using its candidate the certified true copies of the verdictIts spokesperson, Gbenga Akinmoyo, im a statement urged the Judiciary to ensure that “this anomaly is immediately corrected, so as not to send a wrong signal to the public about the independence of our judiciary.”Akinmoyo expressed the belief that Jegede would obtain true verdict, but called for the intervention of appropriate authorities in releasing the Judgement’s copies, as any further delay could affect the filing of the appeal to be heard within the stipulated 60 days"
  },
  {
    "headline": "Child Trafficking: Imo police nab doctor, couple for ‘stealing’ siblings from Enugu",
    "summarized_story": "The Imo state Commissioner of Police, Abutu Yaro, stated this at the Command’s headquarters in Owerri, while parading the suspects, three females and two males.\nStill in the operation, a four years old child, one Ugonma Okerie Ruth, was also recovered from the child trafficking syndicate hide out.\n27 Ngokpala Street Owerri , Imo State where he went and hide the two children.”“On getting there the two children were recovered including one Ugonma Okerie Ruth, a little girl of four years .\nThe Commissioner of police Imo Command , CP Abutu Yaro, fdc has commended the efforts of the men and urge them to sustain the tempo.\nPhotos of the alleged Child trafficking syndicate paraded on Sunday at the Imo police command."
  },
  {
    "headline": "Grazing routes: President Buhari eager to pull Nigeria backward – Ohanaeze",
    "summarized_story": "President Muhammadu BuhariBy Anayo Okoli – EnuguApex Igbo socio-cultural group, Ohanaeze Ndigbo has described President Buhari’s insistence on tracing abandoned grazing routes as funny, saying that the President is backpedaling.\nAccording to Ohanaeze, it could not understand why the President is eager to pull Nigeria backward when other nations of the world are busy embracing changes and moving forward.\n“It is funny, it is difficult to understand what he wants to do; to revalidate grazing routes, for what?\nALSO READ:On their part, Alaigbo Development Foundation, ADF, advised President Buhari to talk of more serious issues abound in the country.\n“The APC Government of President Muhammadu Buhari should save this country from this Fulani hydra-headed problem of open-grazing or no open-grazing."
  },
  {
    "headline": "Sexual assault: Lagos govt arrests school proprietor for kissing female student",
    "summarized_story": "By Olasunkanmi AkoniThe Lagos State Government, through the State Domestic and Sexual Violence Response Team, DSVRT, has arrested the proprietor of Megland Comprehensive School, Lekki for allegedly sexually assaulting and harassing a female student.\nThe proprietor, a 62 year old man, Mr. Emmanuel Madueke, was reported to have sexually harassed a Senior Secondary, SS, student (names-withheld) of his school.\nAccording to Coordinator of the Lagos State DSVRT, Titilola Vivour-Adeniyi, the act contravenes the Child’s Rights law 2015 as well as the Criminal Law of Lagos State, particularly, sections 135, (Indecent treatment of a child) as well as 263, Sexual Assault.\nIt was gathered that the alleged perpetrator had developed a cordial relationship with the student before perpetrating the heinous act.\nMeantime, the team has however, reported the case to Ilasan Police Division with investigation ongoing by the Gender Desk Department of the Lagos State Police Command."
  },
  {
    "headline": "Buhari’s achievement will sustain APC beyond 2023, says Minister",
    "summarized_story": "Aliyu stated this at a reception in her honour following her coronation as the Onyize (Mother of Wealth), of Ebira land by the Ohinoyi of Ebira land, His Royal Majesty, Dr Ado Ibrahim CON.\nAliyu expressed optimism that Nigerians will score the ruling party high before the end of Buhari’s administration in 2023.\nThe minister whose coronation as Onyize of Ebira land at Okene attracted dignitaries from within and outside the country thanked President Buhari for allowing her to serve as a member of his cabinet.\nShe said: “With a heart full of gratitude, I wish to thank you for taking your time out to honor my invitation to my Coronation as the Onyize of Ebira Land.\nDr Ibrahim in his remarks said the royal recognition showered on the minister was due to her philanthropic gestures to the people, particularly the less privileged."
  },
  {
    "headline": "Stop threatening us with war, we can destroy government",
    "summarized_story": "Biafra Nations League, BNL, has warned President Muhammadu Buhari against threatening secessionist groups in the East with war.\nThe group said this while announcing its intention to hold a two-day convention to address issues affecting the Biafra struggle.\n“Igboland is in Biafra, while Biafra is situated in the Gulf of Guinea and cannot be blocked from accessing anywhere.\nThe people of Bakassi Peninsula are now well informed more than other areas being the headquarters of the group.\nBiafra Day: Buhari govt cut-off network in Bakassi Peninsula – BNL"
  },
  {
    "headline": "Arewa Forum reacts as Southeast govs condemn IPOB, Nnamdi Kanu’s agitation",
    "summarized_story": "The Arewa Consultative Forum (ACF) has commended Southeast leaders for disowning the Indigenous People of Biafra, IPOB, and its violent agitation.\nSoutheast governors had distanced themselves from IPOB agitation while insisting on Nigeria’s unity.\nThe governors and leaders of the region, in a communique issued yesterday, said a united Nigeria will enhance justice, equality of rights, fairness, love, and respect.\nReacting to the governors’ declaration, ACF spokesman, Emmanuel Yawe, noted that Igbos are scattered across the country, hence the need for unity.\n“Those who are advocating for separation, I don’t know whether they know the geography of this country."
  },
  {
    "headline": "Alleged SARS in Southeast: HURIWA urges National Assembly to summon IGP",
    "summarized_story": "The Human Rights Writers Association of Nigeria, HURIWA has called on the National Assembly to summon the Inspector General of Police, Usman Baba over the alleged reappearance of the disbanded Special Anti-Robbery Squad, SARS in the Southeast.\nThe call followed an allegation by residents of Imo State that armed police operative wearing the uniforms of SARS were roaming the streets of Owerri, arresting, harassing and humiliating innocent persons while searching for the unknown gunmen.\nReacting, HURIWA, in a statement issued by its National Coordinator, Emmanuel Onwubiko and the National Media Affairs Director, Miss Zainab Yusuf, said it wonders why the National Assembly did not bother to investigate the findings.\nThis is totally primitive and despicable”.\nInsecurity: Again, Senate summons Service Chiefs"
  },
  {
    "headline": "BREAKING: NAF strikes Modu Sulum, ISWAP chief who took part in Shekau’s killing",
    "summarized_story": "The Nigerian Air Force (NAF) eliminated dozens of Islamic State West Africa Province terrorists in Lamboa in Kaga Local Government Area of Borno State on Sunday.\nThe multiple airstrikes conducted by Alpha-Jets, L-39 and MI-35 helicopters hit a notorious terrorist, Modu Sulum and several others.\nSulum, ISWAP Logistics Commander, took part in the elimination of Boko Haram factional leader, Abubakar Shekau in May.\nGround and air troops scuttled their mission after the NAF reconnaissance platform hovered over the location to confirm the targets.\n“Of the eight terrorist gun trucks sighted by our surveillance team, the aircraft took out six and an unconfirmed number of terrorists."
  },
  {
    "headline": "Police engage bandits in gun duel, kill 14 in Benue",
    "summarized_story": "No fewer than 14 bandits who attacked a police station in Katsina-Ala Local Government Area of Benue State have been killed.\nThis was contained in a statement issued by the state’s Police Public Relations Officer, Anene Sewuese Catherine.\nThe statement reads, “on 19th June, 2021 five bandits were arrested and detained at Kastina-Ala Police Division for investigation and prosecution.\n“Officers at the division who were already at alert engaged them in a gun duel and were able to subdue the bandits.\nFourteen (14) of them were brought down during the exchange of fire while several others escaped with gunshot injuries."
  },
  {
    "headline": "FG opts for dialogue over Southeast insecurity crisis",
    "summarized_story": "By Bolaji Ogundele, AbujaThe Federal Government has resolved to adopt the dialogue option in settling the escalating insecurity in the Southeast region.\nOn the security situation in the Southeast, Ngige said: “We also looked at the security situation, especially in my zone, the Southeast, and we made some proposal to him, based on the yearnings of the people, and what the government also wants.\n“We are following up with dialogue, which at the end of the day is what will happen.\nADVERTISEMENT“The Minister of Defence, Minister of Interior and the service chiefs were in Enugu earlier last Saturday and we are going to do follow-up meetings on that again, starting from tomorrow.\n“We briefed him and he accepted that dialogue is the way to go in all these."
  },
  {
    "headline": "Crisis looms in varsities over proposed removal of staff school workers in 2022 budget",
    "summarized_story": "By Frank Ikpefan, AbujaNon-teaching staff of public universities may be heading for another showdown with the Federal Government over plans by the latter to remove staff school workers from the 2022 budget.\nThe workers, under the umbrella of Senior Staff Association of Nigerian Universities (SSANU), threatened to ground public universities if the controversial circular directing that workers of the Staff Schools should not be captured in the 2022 budget is not withdrawn.\nHowever, Labour and Employment Minister, Chris Ngige has assured the workers the government will address the issue to avert another industrial action in the universities.\n“But the government is planning to put them in a different salary table called CONPISS, the consolidated public service salary scale.\nIf government is planning to stop funding, personnel costs of teachers in the university demonstration schools, it should be from the new employments they are making, but not the ones that they have already employed and they have signed contract with."
  },
  {
    "headline": "One injured as building guts fire in Lagos",
    "summarized_story": "By Our ReporterOne person sustained injuries after fire broke out at a two storey building in Wiwo Ona Tere street, Apongbon, Lagos Island early morning on Sunday.\nThe fire started from the top floor of the building and burnt the entire floor before it was put under control by emergency responders.\nWitnesses said the inferno started around 7:51am in one of the apartments of the top floor before it spread to other flats.\nA resident, who pleaded anonymity, said the fire started from a room where a neighbour was cooking.\nThe Nation gathered that the injured teenager was rushed to a nearby private hospital for urgent attention."
  },
  {
    "headline": "Why Obaseki is yet to constitute cabinet, by Deputy",
    "summarized_story": "By Bisi Olaniyi, Southsouth Bureau ChiefEdo Deputy Governor Philip Shaibu has explained Governor Godwin Obaseki is yet to constitute his cabinet because he is still consulting widely with the grassroots.\nHe said the consultations and inputs from the grassroots will determine those who will make the much-awaited cabinet.\nHe noted Obaseki would not impose commissioners on Edo people, stating the process of picking cabinet members had begun and would be rounded off in a couple of days.\nADVERTISEMENTHe said: “Governor Obaseki will not appoint people from Benin.\nThe 36 State Governors are fathers of the 36 states and they should act as fathers to the country and to their states."
  },
  {
    "headline": "Stop profiling Nigerian youths as criminals and cultists, Ita Enang warns leaders",
    "summarized_story": "From Joe Effiong, UyoThe Senior Special Assistant to President Muhammadu Buhari on Niger Delta Affairs, Ita Enang, has warned leaders to stop profiling Nigerian youths ‘as criminals or cultists’ and other such ‘demeaning appellations’.\n‘We should not profile them as criminals or cultists nor such derogatory nor demeaning appellations that give them low self or societal esteem.\n‘Now the security crisis we are experiencing in the South East, we have had a case of that crisis in North West.\nWe have had students kidnapped from Schools, and those students are not Christians, those students are Muslims.\n‘We’ve had this crisis happen in states that are not APC, we have had it happen in states that are PDP."
  },
  {
    "headline": "My pointed nose, boobs, my selling point –Titi Adeoye, actress",
    "summarized_story": "By Damilola FatunmiseFor Titi Adeoye, acting is her second nature.\nShe can play any role spontaneously having been acting in school and church before going professional.\nIn this interview, she narrated her journey into the movie industry, her heartbreak experience and greatest fear.\nWhat’s your greatest fear in life?\nMy greatest fear is failure."
  },
  {
    "headline": "Dot-in-circle: Amechi lambasts Buhari",
    "summarized_story": "I have said it personally that I believe in a bigger country, Nigeria that I fought for.\nBut if Nigeria breaks, Buhari is responsible for the breaking of the country.\nBuhari is the only president who wants to equate Fulani economy and empire with his attempt to Fulanize Nigeria and to Islamize Nigeria.\nThe point we got it wrong is at the point of Muhammadu Buhari as the president of Nigeria.\nIt started with President Buhari because of his other ambition of colonizing Nigeria, that Nigeria is a property bequeathed to them by Uthman Dan Fodio."
  },
  {
    "headline": "There’ll never be peace if Biafra, Oduduwa republics are created –",
    "summarized_story": "I know many people will say Fulani are the bandits, kidnappers, this is how they have been frustrated.\nIf you continue to talk about Fulani this way, they will not have peace and if they don’t have peace, you cannot have peace yourself.\nWhen you keep on blackmailing them as foreigners they will come to Nigeria to help Fulani in Nigeria to fight.\nHow did the urban Hausa caused the fight?\nWhen such republics are created there will never be peace in Nigeria because we will continue to fight with our former brothers."
  },
  {
    "headline": "Minor hiccups as over 1.4m candidates begin 2021 UTME",
    "summarized_story": "By Gabriel DikeThe 2021 Unified Tertiary Matriculation Examination (UTME) kicked off yesterday with minor hiccups in few Computer-Based Test (CBT) centres.\nThe Joint Admissions and Matriculation Board (JAMB) said that over 1.4million candidates are writing the 2021 UTME in over 800 CBT centres nationwide.\nThe candidates arrived at their various exam centres as early as 7:00a.m, but after biometrics, the UTME started at 9:30a.m, 30 minutes behind schedule.\nThe second session candidates started at 1:05p.m while few candidates reported late.\nAt Bafuto CBT centres, Ikotun, at 9:40a.m, the first session candidates finished and came out from the exam hall."
  },
  {
    "headline": "Breaking: Rescue Operation Still on for Kidnapped Kebbi Students",
    "summarized_story": "Rescue operation is still on for the kidnapped students and teachers of the Federal Government College, Birnin Yauri, Kebbi State, THISDAY has learnt.\nMore than 80 students, a majority of them girls, and five teachers were kidnapped last week by bandits who stormed the federal government-owned college in Yauri.\nSources told THISDAY Sunday morning that some of the students had been rescued by troops.\nThe remaining abducted students, sources said, had been split into five groups by the bandits, who had now been surrounded by troops.\n“They have been surrounded by troops but they are negotiating so that the girls would not be killed,” the source said."
  },
  {
    "headline": "Breaking: 15 Kidnap Victims Escape from Captivity in Niger",
    "summarized_story": "By Laleye Dipo in MinnaNot less than 15 people recently kidnapped by bandits in Tegina town of Niger state at the weekend escaped from their Abductors.\nThe 15 were among the adults abducted along with the 156 pupils of the Salihu Tanko Islamic school more than two weeks ago.\nTHISDAY gathered that the escapees moved in different directions so that they will not arouse suspicion from other bandits in the forest.\nA top government official told THISDAY that the escapee was treated, given food and new dress and will soon be reunited with his family in Kuta.\nThe escape of the 15 has raised hopes that the 156 children also picked by the bandits will soon regain their freedom."
  },
  {
    "headline": "Kebbi Students May Have Been Rescued as Scores of Bandits Killed",
    "summarized_story": "The troops, THISDAY gathered, were able to rescue the students and their teachers after closing in on the bandits and killings scores of them, before the rest abandoned their hideouts, leaving the victims behind.\nBandits, on Thursday, kidnapped at least 80 students and five teachers from the Federal Government College, Birnin Yauri, Kebbi State, killing a police officer in the process.\nKebbi State police spokesman Nafiu Abubakar, confirmed that the gunmen killed one of their officersduring an exchange and also shot a student, who had since been receiving medical treatment at an undisclosed hospital.\nThe Kebbi State Police Command further claimed that the vehicle used to convey the kidnapped students and teachers belonged to an unnamed High Court judge in the state.\n“When we got there, we saw students crying, teachers crying, everyone is sympathising with people,” he also said to Reuters."
  },
  {
    "headline": "Bawa: EFCC Won’t Hand over Cases of Interest to any State",
    "summarized_story": "•Says commission as a creation of N’Assembly supersedes states’ establishmentsKingsley Nwezeh in AbujaChairman of the Economic and Financial Crimes Commission (EFCC), Mr. Abdulrasheed Bawa, has declared that the commission, under his leadership, would not hand over cases of interest to any state government.\nSome of the states envisage that the EFCC would hand over corruption cases concerning their states to the local anti-corruption commissions.\nThe EFCC chairman also denied asking the management teams of banks to declare theirs assets to the commission.\n“There are a lot of Supreme Court decided cases on this particular issue.\n“We are yet to see how the EFCC is going to hand over cases that they are interested in to any state government or see any correspondence to that effect."
  },
  {
    "headline": "South-east Governors, Leaders Set up Committees to Engage Agitating Youths",
    "summarized_story": "This followed a meeting in Enugu State.\nAccording to a communiqué read by the chairman of South-east Governors Forum and Governor of Ebonyi State, Dave Umahi, the South-east leaders said in order not to manage the situation in the zone, they “have set up a committee to engage such youths to stop and allow elders speak to address such fears”.\nThe governor regretted that although leaders in the South-east had reassured people from other regions of their safety, Ndigbo were still being threatened, especially, in the north.\nThose present at the meeting included the host, Governor of Enugu State, Hon.\nIn attendance also were Speaker of Enugu State House of Assembly, Rt."
  },
  {
    "headline": "Borrowing Is Good For Nigeria– Buhari’s Minister, Fashola",
    "summarized_story": "The Minister of Works and Housing, Babatunde Fashola, has defended the Nigerian Government’s resort to loans to expand infrastructure in the country.\nFashola, who spoke to the News Agency of Nigeria, said that the country would not make meaningful progress without taking loans to boost infrastructure.\nHe explained that borrowing is not a sin and it is part of the essence of keeping the economy growing.\n“But while we were not borrowing, those who laid the rules started borrowing.\n“But since the aftermath of going to write off that debt we started borrowing again, so this administration did inherit all the debt."
  },
  {
    "headline": "Borrowing Is Good For Nigeria– Buhari’s Minister, Fashola",
    "summarized_story": "The Minister of Works and Housing, Babatunde Fashola, has defended the Nigerian Government’s resort to loans to expand infrastructure in the country.\nFashola, who spoke to the News Agency of Nigeria, said that the country would not make meaningful progress without taking loans to boost infrastructure.\nHe explained that borrowing is not a sin and it is part of the essence of keeping the economy growing.\n“But while we were not borrowing, those who laid the rules started borrowing.\n“But since the aftermath of going to write off that debt we started borrowing again, so this administration did inherit all the debt."
  },
  {
    "headline": "Borrowing Is Good For Nigeria– Buhari’s Minister, Fashola",
    "summarized_story": "The Minister of Works and Housing, Babatunde Fashola, has defended the Nigerian Government’s resort to loans to expand infrastructure in the country.\nFashola, who spoke to the News Agency of Nigeria, said that the country would not make meaningful progress without taking loans to boost infrastructure.\nHe explained that borrowing is not a sin and it is part of the essence of keeping the economy growing.\n“But while we were not borrowing, those who laid the rules started borrowing.\n“But since the aftermath of going to write off that debt we started borrowing again, so this administration did inherit all the debt."
  },
  {
    "headline": "EXPOSED: After Taking N1million Bribe, Inspector General of Police Team In Abuja Releases South-East Youths Framed For Being ESN Members",
    "summarized_story": "Inspector-General of Police (IGP)SaharaReporters gathered that the victims were raided in the South-East and brought to detention at the IGP’S IRT office in Abuja.\nSaharaReporters learnt that the fourth victim, Chinonso John, a barber, was also released after the police in Abuja collected N1.5million.\nA family source said, “Our elder brother, Emma, went to Abuja and met the IPO last week to bargain with the IPO.\nI just got information that the IPO has collected truly collected N1million and released Chinonso John.\nHe had been whisked away to Abuja and later paid N1.5million before his release from custody."
  },
  {
    "headline": "EXPOSED: After Taking N1million Bribe, Inspector General of Police Team In Abuja Releases South-East Youths Framed For Being ESN Members",
    "summarized_story": "Inspector-General of Police (IGP)SaharaReporters gathered that the victims were raided in the South-East and brought to detention at the IGP’S IRT office in Abuja.\nSaharaReporters learnt that the fourth victim, Chinonso John, a barber, was also released after the police in Abuja collected N1.5million.\nA family source said, “Our elder brother, Emma, went to Abuja and met the IPO last week to bargain with the IPO.\nI just got information that the IPO has collected truly collected N1million and released Chinonso John.\nHe had been whisked away to Abuja and later paid N1.5million before his release from custody."
  },
  {
    "headline": "NUT: Abductors of Kebbi students contacted parents but didn't demand ransom",
    "summarized_story": "Isah Arzika, chairman of Kebbi state chapter of the Nigeria Union of Teachers (NUT), says the abductors of students of the Federal Government College, Birnin Yauri, have contacted the parents.\nSubsequently, five students and two teachers have been rescued, while one student was killed during a rescue mission by security operatives.\nSpeaking to NAN, Arzika said the kidnappers contacted the parents of the students and the family members of other abductees to inform them that their children were in their custody.\nAdvertisement“When we made our first contact two days ago, precisely on Thursday, they did not demand any ransom.\n“It was yesterday (Friday) that the security agencies swung on them and since then, there was no contact again”."
  },
  {
    "headline": "NUT: Abductors of Kebbi students contacted parents but didn't demand ransom",
    "summarized_story": "Isah Arzika, chairman of Kebbi state chapter of the Nigeria Union of Teachers (NUT), says the abductors of students of the Federal Government College, Birnin Yauri, have contacted the parents.\nSubsequently, five students and two teachers have been rescued, while one student was killed during a rescue mission by security operatives.\nSpeaking to NAN, Arzika said the kidnappers contacted the parents of the students and the family members of other abductees to inform them that their children were in their custody.\nAdvertisement“When we made our first contact two days ago, precisely on Thursday, they did not demand any ransom.\n“It was yesterday (Friday) that the security agencies swung on them and since then, there was no contact again”."
  },
  {
    "headline": "Pathologist tenders autopsy reports of 99 persons killed during #EndSARS protests",
    "summarized_story": "John Obafunwa, chief pathologist at the Lagos state University Teaching Hospital (LASUTH), has submitted autopsy reports of 99 persons killed during the #EndSARS protests in Lagos to the state judicial panel of inquiry.\nAdvertisementIn October 2020, Nigerians across the country took to the streets to demonstrate against police brutality under the #EndSARS campaign.\nOn October 20, soldiers invaded the Lekki tollgate, where some demonstrators had gathered, and fired shots.\nAdvertisementSpeaking at the hearing of the judicial panel on June 6, Obafunwa said 99 bodies were received for autopsy between October 20 and 24.\nHe said out of the 99 bodies received, three were brought in from Lekki and the remaining bodies were received from other parts of the state including Surulere, Ikorodu, Ajah, Fagba, among others."
  },
  {
    "headline": "Pathologist tenders autopsy reports of 99 persons killed during #EndSARS protests",
    "summarized_story": "John Obafunwa, chief pathologist at the Lagos state University Teaching Hospital (LASUTH), has submitted autopsy reports of 99 persons killed during the #EndSARS protests in Lagos to the state judicial panel of inquiry.\nAdvertisementIn October 2020, Nigerians across the country took to the streets to demonstrate against police brutality under the #EndSARS campaign.\nOn October 20, soldiers invaded the Lekki tollgate, where some demonstrators had gathered, and fired shots.\nAdvertisementSpeaking at the hearing of the judicial panel on June 6, Obafunwa said 99 bodies were received for autopsy between October 20 and 24.\nHe said out of the 99 bodies received, three were brought in from Lekki and the remaining bodies were received from other parts of the state including Surulere, Ikorodu, Ajah, Fagba, among others."
  },
  {
    "headline": "14 gunmen killed as officers repel attack on police station in Benue",
    "summarized_story": "At least 14 gunmen were killed by the police in a foiled attack on Kastina-Ala police station, Kastina-Ala LGA of Benue state.\nThe police spokesperson said the officers on duty, however, repelled the attack, killing 14 of them.\n“On 19th June 2021, five bandits were arrested and detained at Kastina-Ala Police Division for investigation and prosecution,” she said.\nEarly this month, over 20 people were killed in Odugbeho community in Agatu LGA of the state.\nAdvertisementIn May, over 30 people were reportedly killed — including students of the College of Education — in Katsina Ala LGA of the state."
  },
  {
    "headline": "After suspending Twitter, Nigerian government intensifies bid to control online media",
    "summarized_story": "The Buhari administration has stepped up efforts to regulate the online media in Nigeria in what is seen by many as attempts to further stifle the civic space in the country.\nMany have taken to Twitter to express criticism over the proposed regulation of online media.\nBREAKING: NBC Amendment Bill Is Social Media Bill Through The Backdoor — SERAP (@SERAPNigeria) June 17, 2021Amendment of the NBC act;grafting the shoot of autocracy.\n— #OurFavOnlineDoc 🩺🇳🇬🇬🇧💎 (@DrOlufunmilayo) June 17, 2021NBC Amendment Bill = Social Media Bill + Hate Speech Bill in disguise.\nThe government responded by suspending Twitter two days later and directed the NBC to immediately begin the process of licensing all over-the-top (OTT) media service and social media operations in Nigeria."
  },
  {
    "headline": "Facebook pulls down fake accounts targeting opposition figures ahead of Ethiopia’s election",
    "summarized_story": "Facebook, this week, said it has removed fake accounts, pages and groups that posted about news and politics ahead of Ethiopia’s general election scheduled to hold next week.\nThe fake accounts mainly posted in Amharic about topics that include the Prosperity Party and Prime Minister Abiy Ahmed.\nFacebook also linked the fake accounts to individuals associated with the Information Network Security Agency (INSA) in Ethiopia.\nPro-government demonstrators in Ethiopia had criticised the move by Washington and Gleicher added that the fake accounts were critical of the sanctions as well.\nFacebook’s move comes after severe criticism it has faced in the past for not doing enough to tackle fake accounts during national elections, including in the U.S."
  },
  {
    "headline": "Netflix kicks off inaugural skills development initiatives in Africa",
    "summarized_story": "Netflix on Sunday, June 13, commenced its first 3-month Episodic Lab (EPL) and Development Executive Traineeship (DET) programmes in Africa.\nOver 500 applications were received from Nigeria, Kenya, Mozambique, South Africa and Zimbabwe for the inaugural development lab for African writers and DET initiatives.\nOther participants are Andile Ngcizela, Dominique Jossie and Kudakwashe Maradzika from South Africa and Mary Waireri from Kenya.\n“Without the existence of our storytellers, our favourite Netflix stories wouldn’t be possible,” Alison Triegaardt, Netflix manager for Grow Creative in Africa, said.\nPotential boost to subscriber baseIn addition to improving quality storytelling in Africa, Netflix would most likely be looking to grow its relatively small subscriber base in the region by producing more relatable, original local content with the help of the development lab."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How tech tools create a safe space for sexual violence survivors in Nigeria",
    "summarized_story": "The United Nations (UN) affirms that the COVID-19-induced lockdowns in 2020 exposed vulnerable people to more risk of sexual violence.\nDespite the Nigerian Federal Government launching its first sexual offender register in November 2019, there were so many cases of sexual violence in 2020.\nHighlighting existing response channelsJust like Kiishu, most sexual assault survivors don’t bother to report their experiences.\nHowever, Aganran submits that the same channel is also responsible for the increasing cases of sexual violence and human trafficking.\nWith more tech tools in place, there’s no telling how many cases will be reported, and perpetrators brought to book."
  },
  {
    "headline": "Babajide Duroshola steps down as Nigeria’s Country Director for Safeboda",
    "summarized_story": "Former Andela Community Manager, Babajide Duroshola, has stepped down as Safeboda’s Country Director for Nigeria.\nThis came after months of speculation regarding the Uganda-founded ride-hailing startup’s launch in the country.\nAlthough not the stated reason, the okada ban in Lagos meant that Safeboda had to launch in Ibadan, where ORide and MAX.ng were already present.\nHowever, in an interesting turn of events, as Safeboda launched in Ibadan, ORide exited the ride-hailing market.\nPerhaps to justify their decision to launch in Ibadan, Safeboda has regularly publicised the number of rides made on the platform."
  },
  {
    "headline": "Nigeria is planning a new telecom licensing regime to rival developed countries",
    "summarized_story": "In comparison with Nigeria, South Africa also operates a two-category licence structure, but its fees are more expensive.\nGlobal ICT standardsAccording to the International Telecommunication Union’s (ITU) 2020 Global ICT Regulatory Outlook, Nigeria is a third-generation (G3) country.\nAdvertisementTo put this in context, the ITU ranks countries into five generations using Regulatory Tracker indicators divided into four pillars: Regulatory Authority, Regulatory Mandate, Regulatory Regime and Competition Framework.\nAccording to ITU’s ranking, the East African nation’s ICT Regulatory Framework fosters vibrant markets and is also key to finding market solutions.\nWhile this move by the NCC shows progressiveness — especially in light of recent policy amendments — it appears there are still some ways to go before Nigeria attains global ICT standards."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "BUA Cement Further Guarantees ‘No Price Increase’ In Coming Weeks In the light of the current inflationary trend, BUA Cement, Nigeria’s second-largest cement maker, has again assured Nigerians that it won’t further increase the price of cement.\nThis is the second time BUA is reassuring its customers in the past two months.\nThis was confirmed…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "When two years seem like eternity",
    "summarized_story": "Some have described the next two years as an “eternity”, saying that to endure the “suffocating air” for the next two years would be the worst punishment for Nigerians.\nDuring the 2015 general election campaign, the then ruling party and the main opposition party promised Nigerians a lot of goodies.\nYet, they don’t see any difference in the current situation within the remaining two years of this administration.\nIt will definitely get worse in the remaining two years of Buhari,” Angwe Yakubu, a retired senior security personnel, said.\nThis APC- led government is a failure.”According to Daramola, “The President is clueless on providing security for Nigerians not to talk of foreigners."
  },
  {
    "headline": "Is Nigerian Senate playing politics with PIB, Electoral Act and Constitutional Amendment?",
    "summarized_story": "So, the emergence of Senator Ahmad Lawan from Yobe North Senatorial District and Ovie Omo-Agege from Delta Central Senatorial District as president and deputy Senate president, respectively, was largely seen as mission accomplished.\nSimilarly, the $30 billion loan request of the president to the 8th Senate was also rejected to save the country from sinking deeper into indebtedness.\nBesides, on May 18, 2021, Buhari had sought the approval of the Senate to borrow a fresh N2.343 trillion ($6.18bn) external loan.\nNonetheless, the Electoral Act Amendment bill is one bill Nigerians are calling the 9th Senate to also expedite action on in view of the 2023 general election.\nLawan has again promised Nigerians that the Electoral Act Amendment bill and the Constitutional Amendment bill will the passed by mid July 2021 before going on recess."
  },
  {
    "headline": "Edo State Govt assures SACA of collaboration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestENIN CITY – Edo State government has assured of its commitment in view of partnering with the Edo State Action Committee on Aids (SACA) in its drive towards mitigating the spread of HIV/AIDS in the state.\nThe Permanent Secretary, Edo state Ministry of Communication and Orientation, Mr. Joses Sede gave the assurance when he played host to the team of SACA who were on a courtesy visit to the Ministry yesterday in Benin city.\nWhile appraising SACA’s roles towards cushioning the spread of HIV disease in the society, which he said were in line with the state governor, Godwin Obaseki’s vision of making Edo state great again, Joses said the present administration was committed towards restoring the dignity of the state, hence the Make Edo State Great Again ( MEGA).\nAcknowledging that Edo State had always been rated top since Midwest era, the PS charged the good people of Edo State on the need to strengthen their cooperation with the state governor towards moving the state to enviable height.\nShe thanked the PS for granting them audience to acquaint the Ministry with SACA’s activities in the state and appealed for continuous collaboration."
  },
  {
    "headline": "Obaseki begins e-registration of Edo workers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, at the weekend, said his administration has commenced digital registration of all workers across the 18 local government areas of the state.\nObaseki stated this while addressing members of Edo State Civil Service Commission, led by the chairman, Mrs. Ekiuwa Inneh, on a courtesy visit, at the Government House, Benin City.\nAccording to him, “We have sent Information Technology Communications (ITC) experts to scan all your documents into a digital format.\nWe have started the process of digitally registering every staff member in public and civil service in Edo.\n“I want to assure you that we will key into your transformation agenda for the civil service; you have recognized the fact that the civil service has to be empowered,” she added."
  },
  {
    "headline": "Fathers’ Day: Obaseki hails sacrifice, resilience of fathers amid COVID-19 crisis – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI celebrate fathers for their immense role in holding the family unit together despite the disruptions caused by the coronavirus pandemic and the attendant dislocations in economies across the world.\nDespite the challenges, fathers remained strong pillars of support in the family.\nWhile it must be acknowledged that the economies of the world have been heavily impacted by the coronavirus pandemic, fathers walked a tight rope to keep families whole, even in the face of adversities.\nFathers were resilient and made immense sacrifice to keep the family united, even with the effects of the lockdown.\nGodwin N. ObasekiGovernor, Edo State..."
  },
  {
    "headline": "Obaseki celebrates Dame Uzamere at 60, extols her exemplary life – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Saturday, led other top government functionaries to the 60th birthday celebration of Dame Iriagbonse Joy Uzamere, at St. Matthew’s Cathedral in Benin City.\nDame Iriagbonse Joy Uzamere is the mother of the immediate past Chief of Staff to the Governor, Mr. Osaze Ethan Uzamere.\nAccording to him, “She’s a pillar, not only in her family but also in the church and in the community.\nImasuen said Dame Iriagbonse Joy Uzamere is a gift to mankind and her family.\nOther dignitaries at the event are wife of Edo Governor, Mrs. Besty Obaseki; immediate past chief judge, Edo State, Esther Edigin; Sen. Matthew Urhoghide; Edo State head of service, Anthony Okungbowa and former chairman, Edo All Progressives Congress (APC), Anselm Ojezua, among others."
  },
  {
    "headline": "INTERVIEW: Empowering women key to curbing insecurity, poverty – Activist",
    "summarized_story": "Christybelle Sylva John, Coordinator, Ray of Hope Empowerment Foundation, says her sole mission is empowering more women and children, whom she believes are crucial pegs in addressing Nigeria’s developmental challenges.\nThrough her foundation, she continues to reach out to impoverished women and indigent children, helping them find succour in the current economic downturn.\nThis was what I started in school and I grew up and I felt there was a need to continue.\nThe women tell you they can’t stop having children until God stops them.\nIf everything was working for them (women, children), I don’t think we will have the level of crime and insecurity we have now."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "NAF Airstrikes Kill ISWAP Commander, Destroy 6 Gun Trucks In Borno",
    "summarized_story": "Airstrikes executed by the Nigerian Air Force (NAF) have eliminated Islamic State West Africa Province (ISWAP) commander, his fighters and as well destroyed six gun trucks in Borno State.\nAdvertisementsPRNigeria reported that the airstrikes were executed on Sunday at Lamboa in Kaga local government area of the State.\nThe insurgents, in a convoy of eight -gun trucks, had invaded Lamboa, preparatory to launch attack on Mainok axis in the State.\nWhen contacted, spokesperson of NAF, Air Commodore Edward Gabkwet, confirmed the success of the military airstrikes.\nOf the eight terrorist gun trucks sighted by our surveillance team, the aircraft successfully took out six of the trucks including an unconfirmed number of terrorists that were eliminated."
  },
  {
    "headline": "NAF Airstrikes Kill ISWAP Commander, Destroy 6 Gun Trucks In Borno",
    "summarized_story": "Airstrikes executed by the Nigerian Air Force (NAF) have eliminated Islamic State West Africa Province (ISWAP) commander, his fighters and as well destroyed six gun trucks in Borno State.\nAdvertisementsPRNigeria reported that the airstrikes were executed on Sunday at Lamboa in Kaga local government area of the State.\nThe insurgents, in a convoy of eight -gun trucks, had invaded Lamboa, preparatory to launch attack on Mainok axis in the State.\nWhen contacted, spokesperson of NAF, Air Commodore Edward Gabkwet, confirmed the success of the military airstrikes.\nOf the eight terrorist gun trucks sighted by our surveillance team, the aircraft successfully took out six of the trucks including an unconfirmed number of terrorists that were eliminated."
  },
  {
    "headline": "Police Repels Attack On Station, Kill 14 Bandits In Benue",
    "summarized_story": "Operatives of the Benue State Police Command on Sunday neutralised 14 bandits, who attempted to attack a Police Station in Kastina-Ala local government area of the StateAdvertisementsThe Police Public Relations Officer, DSP Catherine Anene, who confirmed the killing, said more 50 bandits, who attempted to invade the station in the early hours of Sunday to rescue their members, were repelled by officers of the Command.\nShe explained that the Police are currently carrying out series of operation in Katsina-Ala LGA geared towards a total clampdown on banditry in the area.\nAccording to her, “On the 19th June, 2021 five bandits were arrested and detained at Kastina-Ala Police Division for investigation and prosecution“However on the 20th June, 2021 at about 0130hrs more than fifty other gang members of the detainees mobilised and invaded the police station to rescue their counterparts.”“But officers at the Division who were already on alert engaged them in a gun duel and were able to gun down Fourteen (14) of them.”AdvertisementsShe further disclosed that several other bandits escaped with gunshot injuries, adding that operatives in the area are currently on the trail of suspects at large.\nThe PPRO advised residents of Kastina-Ala town to remain calm and availed the Police with every useful information about the bandits’ hideout for onward arrest and prosecution."
  },
  {
    "headline": "Police Repels Attack On Station, Kill 14 Bandits In Benue",
    "summarized_story": "Operatives of the Benue State Police Command on Sunday neutralised 14 bandits, who attempted to attack a Police Station in Kastina-Ala local government area of the StateAdvertisementsThe Police Public Relations Officer, DSP Catherine Anene, who confirmed the killing, said more 50 bandits, who attempted to invade the station in the early hours of Sunday to rescue their members, were repelled by officers of the Command.\nShe explained that the Police are currently carrying out series of operation in Katsina-Ala LGA geared towards a total clampdown on banditry in the area.\nAccording to her, “On the 19th June, 2021 five bandits were arrested and detained at Kastina-Ala Police Division for investigation and prosecution“However on the 20th June, 2021 at about 0130hrs more than fifty other gang members of the detainees mobilised and invaded the police station to rescue their counterparts.”“But officers at the Division who were already on alert engaged them in a gun duel and were able to gun down Fourteen (14) of them.”AdvertisementsShe further disclosed that several other bandits escaped with gunshot injuries, adding that operatives in the area are currently on the trail of suspects at large.\nThe PPRO advised residents of Kastina-Ala town to remain calm and availed the Police with every useful information about the bandits’ hideout for onward arrest and prosecution."
  },
  {
    "headline": "UBEC Begins Inspection Of Model Schools Nationwide",
    "summarized_story": "The Universal Basic Education Commission (UBEC) has commenced inspection of its model schools under construction across the country.\nOn his part, the Executive Secretary of UBEC, Bobboyi, said the model school will consist of pre-primary, primary school, JSS, ICT training hall and sports facilities.\nBobboyi explained that Model 1 schools which is spread among the geo-political zones would be sited in Imo, Bauchi, Edo, FCT, Katsina, Nasarawa and Lagos States.\nAdvertisementsThe Model 2 schools, according to him, would be sited in Benue, Adamawa, Kaduna, Niger, Borno, Kano, Sokoto, Anambra, Ebonyi, Akwa Ibom, Cross River, Ekiti and Oyo States.\nEarlier, the national consultant, Mas’ud Abdulkarim, said going by the level of cooperation among the various contractors handling the model schools, the projects would be completed before the stipulated date."
  },
  {
    "headline": "Buhari’s plan to lift 100 million Nigerians out of poverty, a mirage if…’",
    "summarized_story": "He lamented that Nigerians currently faced food insecurity, poor electricity supply, inflation, fall of the naira and other socio-economic and industrial challenges.\nThese two generations, precisely, the millennials and Generation Z have been served the short end of the stick by the Nigerian state.\nYet, between my generation – generation X, the millennial generation and Generation Z, we constitute the largest voting bloc in Nigeria.\nHe said that the gendarmes will double as the state national guards that can be activated by state governments during times of emergency in liaison with the federal government.\nThese are the policies that will stop the hemorrhaging of the Nigerian state and position us to gain a competitive edge in the 21st century.”"
  },
  {
    "headline": "2023: South East should produce the President – Shehu Sani",
    "summarized_story": "We should be concerned; the separatist agitation in the South Eastern part of Nigeria is a threat to peace.\nThey are not just dominant in the South Eastern part of Nigeria, they are dominant in all parts of the country.\nA crisis in the South East is a threat to peace and order in the South Eastern part of Nigeria.\nShould the South or precisely South-East, produce the President of Nigeria in 2023?\nLeaders who have assumed the position of political power should not shrink the democratic space and deny other people the right to stay and enjoy."
  },
  {
    "headline": "Police arrest girl for allegedly staging own kidnap — Daily Times Nigeria",
    "summarized_story": "Ekiti State Police Command has arrested a 16-year-old girl alongside three accomplices for allegedly faking her own kidnap.\nPolice spokesman, ASP Sunday Abutu, said on Saturday at Ado-Ekiti that the suspects were arrested on Thursday at their hotel hideout.\nAbutu said one Bolaji Femi of Bawa Estate, Ado-Ekiti, reported to the police on Tuesday that her sister who left for school at Christ’s School, Ado-Ekiti, on Monday did not return home.\nShe told the police that an unknown person picked a call made to her phone and confirmed that she was in the custody of kidnappers.\nThe “unknown person’’ said the supposed victim would not be released until a ransom of N500,000 was paid to a particular bank account."
  },
  {
    "headline": "IPMAN threatens strike action over alleged extortion — Daily Times Nigeria",
    "summarized_story": "Doosuur Iwambe, AbujaThe Independent Petroleum Marketers Association of Nigeria, IPMAN, Suleja/Abuja Unit, has threatened to embark on an industrial action over alleged extortion by officials of Department of Petroleum Resources, DPR.\nAccording to the Chairman of the Unit, Alhaji Yahaya Ahman Alhassan, the strike action will commence on Monday, June 21, 2021.\nIPMAN also said that DPR request for daily transaction records from filling stations is another bone of contention.\nAccording to Alhassan, “IPMAN has no other alternative other than instructing our members not to load from Suleja depot in Niger State to express our frustrations after all efforts to make DPR officials desist from unethical practices failed.”He added that “IPMAN Suleja/Abuja Unit needs explanation from DPR concerning demand for daily sale activities from filling stations,” saying “these issues have to be resolved before we can commence lifting of products from the depot.”Similarly, Secretary of the Unit, Alhaji Raji Munir, said that “a situation whereby the regulatory agency of federal government is engaging in unethical practices was most unfortunate.”In this vein, Raji said he aligned himself “whole heatedly in support of the strike” with a view to addressing “our grievances.”He also said that IPMAN monitoring team will “be fully on ground throughout the unit to ensure compliance during the strike.”"
  },
  {
    "headline": "CSOs petition Senate, reject nomination of Onochie as INEC Commissioner",
    "summarized_story": "A coalition of civil societies has written a petition to Senate President, Ahmad Lawan against the nomination of Mrs. Lauretta Onochie as a National Commissioner for the Independent National Electoral Commission to represent the South – South in the commission.\nPresident Buhari forwarded the name of Ms Onochie and five others to the Senate in October 2020 for confirmation as INEC national commissioners.\nThe Senate President on June 9, directed the Senate committee on INEC to screen Ms Onochie and five other nominees.\nIn the petition, dated June 16 and addressed to the Chairman of the Senate Committee on INEC, Kabiru Gaya, the CSOs referred to Section 156(1)(a) of the 1999 Constitution which mandates that a person nominated as an INEC National Commissioner should be non-partisan.\nThe CSOs, in the petition, noted that Ms Onochie is a card-carrying member of the ruling All Progressives Congress (APC) and a Special Assistant to President Buhari on social media."
  },
  {
    "headline": "CSOs petition Senate, reject nomination of Onochie as INEC Commissioner",
    "summarized_story": "A coalition of civil societies has written a petition to Senate President, Ahmad Lawan against the nomination of Mrs. Lauretta Onochie as a National Commissioner for the Independent National Electoral Commission to represent the South – South in the commission.\nPresident Buhari forwarded the name of Ms Onochie and five others to the Senate in October 2020 for confirmation as INEC national commissioners.\nThe Senate President on June 9, directed the Senate committee on INEC to screen Ms Onochie and five other nominees.\nIn the petition, dated June 16 and addressed to the Chairman of the Senate Committee on INEC, Kabiru Gaya, the CSOs referred to Section 156(1)(a) of the 1999 Constitution which mandates that a person nominated as an INEC National Commissioner should be non-partisan.\nThe CSOs, in the petition, noted that Ms Onochie is a card-carrying member of the ruling All Progressives Congress (APC) and a Special Assistant to President Buhari on social media."
  },
  {
    "headline": "Kidnapping: Kebbi shuts seven schools indefinitely",
    "summarized_story": "Because Principals are teachers, all the Directors at the Board are also teachers.\n“Government has given us an order and option to take any necessary action as far as our schools are concerned.\n“Some of these schools that I am talking about have policemen attached to them, honestly, we are satisfied with government actions”, he said.\nAlready, seven schools on the frontline in that area have been closed and more will be closed, if we realise the situation is not safe for the teachers and students.\n“It was yesterday (Friday) that the security agencies swung on them and since then there was no contact again”."
  },
  {
    "headline": "Kidnapping: Kebbi shuts seven schools indefinitely",
    "summarized_story": "Because Principals are teachers, all the Directors at the Board are also teachers.\n“Government has given us an order and option to take any necessary action as far as our schools are concerned.\n“Some of these schools that I am talking about have policemen attached to them, honestly, we are satisfied with government actions”, he said.\nAlready, seven schools on the frontline in that area have been closed and more will be closed, if we realise the situation is not safe for the teachers and students.\n“It was yesterday (Friday) that the security agencies swung on them and since then there was no contact again”."
  },
  {
    "headline": "Gun-battle in Benue: Police shoot 14 bandits dead",
    "summarized_story": "Fourteen suspected bandits have been shot dead by the police in Benue State during an intensive gun-battle with the hoodlums.\nIt was gathered that 50 bandits attempted to invade the Kastina-Ala Police Division where some of their members were being detained to free them when sporadic shootings occurred.\nBenue State Police Command’s spokesperson, Catherine Anene, in a statement confirmed the development, saying that the police were determined to wipe out bandits from the state.\nAccording to her, on 19th June, 2021, five bandits were arrested and detained at Kastina-Ala Police Division for investigation and prosecution.\nShe added that 14 of the bandits were brought down during the exchange of fire while several others escaped with gunshot injuries."
  },
  {
    "headline": "Two weeks after T.B. Joshua’s death, church remains locked",
    "summarized_story": "By Taiwo OkanlawonTwo weeks after the death of Prophet Temitope Balogun Joshua, the Synagogue Church of All Nations (SCOAN), has remained under lock without church services even on Sunday.\nThere were, however, security checks by the police that were always stationed at the entrance even before the demise of TB Joshua.\nTB Joshua had said he would reopen his church when he receives direction from God to do so.\nSCOAN, in a statement issued late Monday unveiled a week-long burial plan for Joshua, leading to his burial at the church’s premises.\nThe statement said everyone was aware that TB Joshua had been taken home to be with the Lord, assuring that nothing would stop the work of God at SCOAN from moving on."
  },
  {
    "headline": "Designer of 1004 Flats, National Stadium, TBS Arcade, Fola Alade, is dead",
    "summarized_story": "By Idowu GabrielOne of Nigeria’s first four Architecture graduates, Fola Alade, is dead.\nArchitectural masterpieces bearing his insignia are the 1004 Housing Estate, Victoria Island, Lagos, defunct Federal Secretariat building, Ikoyi, Lagos and the National Stadium, Surulere, Lagos.\nOthers are the Remembrance Arcade, Tafawa Balewa Square, Lagos, Satellite Town, Lagos, Nigerian Air Force Base, Ikeja and the Nigerian Institute of Policy and Strategic Studies building, Kuru, near Jos.\nYet others are the National Judicial institute, Abuja and Nigerian Embassy buildings in 11 countries.\nHe served as the General Secretary of the Nigerian Institute of Architects."
  },
  {
    "headline": "BREAKING: President Buhari Mourns Death Of Alade",
    "summarized_story": "President Muhammadu Buhari has expressed his condolences to Chief (Arc) Isaac Folayan Alade’s family and friends upon his death.\nPresident Buhari lauded Alade, saying that his stamp on the country’s renowned structures will inspire future architects from within and outside the country, leaving a legacy of genius and diligence.\nThe President joins the Nigerian Institute of Architects, the Royal Institute of British Architects, and the Architects’ Registration Council of the United Kingdom in mourning the first architect to serve as a Permanent Secretary in Nigeria, as well as Pro-Chancellor and Chairman of the Federal University of Port Harcourt’s Governing Council.\nHe expressed his condolences to the government and people of Ekiti State, believing that Chief Alade’s contributions to the country’s development in design, construction, and administration, particularly historic structures such as the National Stadium Lagos, Tafawa Balewa Square (TBS), Federal Secretariat Lagos, and Nigerian Institute of Policy and Strategic Studies, will be remembered by posterity."
  },
  {
    "headline": "The Oil In Nigeria Was Discovered With Northern Nigerian Money – Northern Group Says They Are Not Parasites",
    "summarized_story": "Awwal Abdullahi Aliyu, the president of the NCM, remarked that, contrary to common assumption, Nigeria’s northern region is the country’s economic heart.\nHe said that Northern Nigerians discovered and constructed the oil and refineries that can now be found in other parts of the country.\nHe urged the federal government to establish a Northern Development Ministry, which would be funded in the same way as the Niger Delta Development Commission (NDDC).\nAnd nobody can address us as parasites, we are the economic heart of Nigeria.\nThe oil that is so being busted on today were discovered, harnessed, and the refineries were constructed with Northern Nigerian sweat, with the Northern Nigerian money with the Northern Nigerian economy."
  },
  {
    "headline": "5 Persons Can’t Decide For Us – Igbos Tackle Southeast Govs For Disowning IPOB",
    "summarized_story": "Chairman of the Southeast Governors Forum, David Umahi, said they believe in one Nigeria while speaking to reporters shortly after the meeting.\n“We condemn in totality, the activities of violent secessionist groups in the South East and elsewhere.\n“We firmly proclaim that we do not support them, they do not speak for the South East.\n“The impression that South-East leaders are silent over some of our youths’ agitations for secession is not correct.\n@Stevedameze: “Who are these “Southeast Governors?” Do we really recognize them?"
  },
  {
    "headline": "Second Niger Bridge To Be Completed Next Year – Minister Fashola",
    "summarized_story": "Babatunde Fashola, the Minister of Works and Housing, has stated that the Second Niger Bridge will be completed next year.\nMr Fashola stated that the bridge will be completed in the second and third quarters of 2022, and will act as a significant link between the south-east and south-west parts of Nigeria.\nThe minister, on the other hand, made no mention of whether the facility’s construction costs had changed since work began.\nMr Fashola stated that the building work had progressed beyond the water level, indicating that the majority of bridge repairs were carried out underwater.\nIn December of 1965, the existing Niger Bridge, which connects Onitsha and Asaba, was finished."
  },
  {
    "headline": "VIDEO: Moment World boxing legend, Deontay Wilder, revealed Nigeria as his origin",
    "summarized_story": "NextTokyo Olympics ‘ll be different for Team Nigeria – Minister"
  },
  {
    "headline": "FGC Yauri Abduction: Gov. Bagudu vows to lead rescue operation in forest",
    "summarized_story": "Atiku Bagudu of Kebbi State on Saturday vowed to lead the rescue operation of teachers and students abducted from the Federal Government College (FGC), Birnin Yauri, in Ngaski Local Government Area of the State.Bagudu, who is also Chairman, Progressives Governors’ Forum, spoke when local hunters visited him.\nThe News Agency of Nigeria (NAN) reports that the Chairman, Nigeria Governors’ Forum (NGF) and Ekiti State Governor, Dr Kayode Fayemi, and his Jigawa State counterpart, Alhaji Badaru Abubakar, also paid a solidarity and sympathy visit on Gov.\n“But, we also need to mobilize, kit ourselves and take on these bandits.\nWe should follow these bandits wherever they are and take them on.”Bagudu also described the abduction as very callous, even as he lauded the security agencies, management of the school, ‘Yan Sakai and vigilantes for their heroic efforts since the bandits struck at the college.\n‘We are in solidarity with governor Bagudu, we are aware of his prompt intervention and the positive results so far recorded in the rescue operation,” he said.He described the quick response of the governor on the rescue effort as highly commendable, pointing out that no governor has achieved such a feat in Nigeria in similar situation of abduction.Zauro warned criminals to stay away from Kebbi State as they have no hiding place."
  },
  {
    "headline": "Breaking: Germany beat Portugal, return to Euro winning ways",
    "summarized_story": "From a goal down, Germany race to 4-1 while Portugal reduce the deficit 23 minutes to the end.\nThe tie eventually ended 2-4 in favour of Germany.\nPortugal go down from the summit to No 3, a point behind both new leaders France and Germany.\nPortugal will next face France in their last group game on Wednesday, at the same time that Germany will engage Hungary.\nDetails loading…RelatedNo tags for this post."
  },
  {
    "headline": "CSO petitions EFCC, bank for disobeying court order -NigPilot",
    "summarized_story": "Civil Society Organizations in Defence of Justice has expressed disappointment against the continued disobedience of court order by the Economic and Financial Crimes Commission EFCC and the first generation bank.\n“In 2013, 10 staffs who initially subscribed to the purchase of the 2.5 equity shares had their jobs terminated from the employment of Indorama Eleme Petrochemicals.\n“The judgement affirmed the laid off staffs as the authentic owners of the shares.\n“This act continued until Justice Taiwo .O.Taiwo of the Federal High Court in Suit FHC/ABJ/SC/1222/2020 granted an Order stopping the EFCC from arresting, inviting, detaining and prosecuting or inquiring into the acquisition of shares of Indorama Petrochemicals.\nOther demands includes that First Bank of Nigeria, without further delay should honour the order of the court and grant access to the funds in its custody."
  },
  {
    "headline": "2021 UTME: Education Minister commends officials for best practices -NigPilot",
    "summarized_story": "Minister of State for Education, Dr. Chukwuemeka Nwajiuba, has expressed satisfaction with the conduct of the Joint Admission and Matriculation Board, JAMB , officials for displaying what he described as best standards in the 2021 Unified Tertiary Matriculation Examination, UTME.\nThe minister gave the commendation during his inspection visit to some Computer Based Test, CBT, centers in Lekki, Lagos State, yesterday.\nDr. Nwajiuba noted that his visit was to have an on-the-spot assessment on the conduct of the examination and also to ascertain how the candidates are coping with the CBT examination which he said, conforms with the international best practices on Information Communication Technology.\nHe was accompanied by Senator Frank Ibezim, (Imo North), and other members of the Senate Committee on Basic Education."
  },
  {
    "headline": "NAF working steadily in right direction -NigPilot",
    "summarized_story": "When the Chief of the Air Staff, Air Marshal Isiaka Oladayo Amao hinted of a new and renewed synergy in the Nigerian military setup, most of us doubted its workability.\nA keen observer will note that in the past the different arms of the military seem to be working to restore peace without collaboration.\nJust last week, the Nigerian Army troops in conjunction with elements of the Nigerian Air Force rescued some of the abducted teachers and students of Federal Government College, Birnin Yauri.\nThis is not to mention numerous positive results being recorded across the country, with NAF playing a key role.\nBefore him, the Kano State Governor, Abdullahi Ganduje came calling too and lauded NAF for it’s role in fighting crime in the state."
  },
  {
    "headline": "JAMB begins 2021 UTME nationwide -NigPilot",
    "summarized_story": "Nigerian Pilot gathered that about 1, 338, 687 candidates registered for the 2021 UTME which started today, 19th June, 2021,across the nation, while about 75,328 candidates successfully registered for Direct Entry.\nA visit to some of the JAMB approved Computer Based-Test, CBT , centres around Federal Capital Territory, FCT, revealed that there were more suiting arrangements in this 2021 UTME than what it used to be previously.\nSpeaking to our correspondent, a parent, Mr. Ogbonna Ugochukwu who came along with his son at Digital Bridge Institute said, ” This year’s JAMB exam is more organised than before.\nThere was no case of malpractice or system failure.To me, this is a great feet that JAMB has achieved so far.\nOn the parts of the candidates, especially those who had sat for UTME in the previous years, said there was no stress locating their centres , capturing their biometrics, and operating computer during the 2021 UTME."
  },
  {
    "headline": "14 Killed As Bandits Attack Police Station In Benue",
    "summarized_story": "Police authorities in Benue State say 14 bandits were killed following an attempted attack on a police station on Sunday morning.\nA spokesperson for Benue police, Catherine Anene, said in a statement that the gunmen numbering about 50 launched an attack in early hours of Sunday on a police station at Katsina-Ala town of the state, in a bid to free some suspected bandits who were arrested by police on Saturday and detained in the station.\nREAD ALSO: Law Enforcement Officer, 6 Others Arrested For Dealing In DrugsAnene said, “Operatives at the police division, who were already on alert, engaged the attackers in a fierce gun battle,” adding that 14 of the gunmen were killed at the end of the gun duel while others escaped with bullet wounds.\nAccording to her, operatives of the force are on the trail of the fleeing bandits and urged local residents to assist the police with useful information that would lead to arrests.\nIn recent times, bandits have been terrorizing parts of Nigeria, especially the Northeast and Northcentral region, with Benue being one of the worst-hit states."
  },
  {
    "headline": "SERAP Sues FG, Lai Mohammed Over Repressive Directive Asking Broadcasters To Stop Using Twitter",
    "summarized_story": "They intended to safeguard the people of this country from punishment without trial by duly constituted courts.\nThese principles are so fundamental and must be respected.”“The directive to broadcast stations has seriously undermined the ability of Nigerians and other people in the country to freely express themselves in a democracy, and undermined the ability of journalists, media houses, broadcast stations, and other people to freely carry out their professional duties.”“The Twitter accounts by broadcast stations and media houses are their own properties acquired upon privity of terms and conditions formulated by the Twitter Inc. and accepted by the stations and media houses.”SERAP is also asking the Federal High Court for the following reliefs:1.\nA DECLARATION that the acts of the NBC and Mr. Lai Muhammed in relying on the National Broadcasting Act and the Nigeria Broadcasting Code to unilaterally direct broadcast stations to delete their Twitter handles and desist from using Twitter without recourse to the court amount to an infringement on sections 6[1] & [6][b], 36 and 44[1] of the Nigerian Constitution of 1999 [as amended], Articles 1 and 7 of the African Charter on Human and Peoples’ Rights and Article 9 of the International Covenant on Civil and Political Rights.\nA DECLARATION that the NBC and Mr. Lai Muhammed lack the power and authority to unlawfully impose penalties such as fines and other sanctions on any journalists and broadcast stations for using Twitter, and refusing/failing to deactivate their Twitter handles.\nNo date has been fixed for the hearing of the suit."
  },
  {
    "headline": "Law Enforcement Officer, 6 Others Arrested For Dealing In Drugs",
    "summarized_story": "A serving officer of a law enforcement agency, Popoola Abayomi has been arrested by the National Drug Law Enforcement Agency (NDLEA) for selling assorted illicit drugs to students of a Federal University and cultists in Ogun State.\nThe following day, two ladies; Mary Peter, 40, and Mercy Oladele, 39, were arrested at Total Garden, Ibadan when NDLEA operatives acting on a tip-off, intercepted their commercial Micra car.\nThe two women were arrested with seven bags of cannabis weighing 77.23kg brought in from Ogbese, Ondo State, to supply a man they simply identified as Alhaji.\nIn Kaduna State, a drug trafficker, Segun Abraham was arrested at the Panteka area of the state on 17th June with 211.500kg of skunk heading to Kano state.\nThe suspect had arrived at the ‘D’ arrival hall of the airport on 14th June on a Turkish airline flight from Pakistan with the illicit drug inserted in his anus."
  },
  {
    "headline": "South East Governors Condemn Violent Secessionist Groups, Back United Nigeria",
    "summarized_story": "Members of the South East Governors’ Forum have condemned the activities of secessionist groups in the region and other parts of the country.\nHe added, “The impression that South East leaders are silent over some of our youths’ agitations for secession is not correct.\n“South East Governors, Ohanaeze President, National Assembly members, notable leaders had come out publicly many times in the past to speak against such agitations.\nThe forum also condemned the killing of security agencies, burning of strategic infrastructure, and killing of civilians in the South East and other regions.\n“The meeting endorsed our South East joint security outfit – Ebubeagu and asked them to work with security agencies and to respect the rights and privileges of all those living in South East and our visitors,” Governor Umahi said while reading the communique issued at the end of the meeting."
  },
  {
    "headline": "Africa Will Learn From Europe And Launch Super League, Says Motsepe",
    "summarized_story": "CAF president Patrice Motsepe believes Africa can succeed where Europe failed and launch a Super League, according to a statement released by the continental organisation on Sunday.\n“We have been following attempts by some top European clubs to form a Super League and will learn from their experience and pitfalls,” said the South African.\nBut Motsepe is pushing forward after FIFA president Gianni Infantino told CAF officials last year that he favoured 20 permanent African Super League members and additional competitors through qualifying.\nInfantino did not give details as to how the Super League might work and whether it would complement or replace the current marquee club competition, the CAF Champions League.\nThe Champions League and second-tier CAF Confederation Cup prize money was supposed to increase for the 2021/2024 cycle, but Motsepe made no mention of increases."
  },
  {
    "headline": "Oyo Speaker Adebo presents gifts to widows, physically challenged in memory of Father Adeseun Ogundoyin",
    "summarized_story": "The late Philanthropist, Business Mogul, Community and Political Leader, Chief Adeseun Oguntona Ayisa Ogundoyin, the father of the Oyo State Speaker, who died 30 years ago, was honored by prominent indigenes of Eruwa and Lanlate in the Ibarapa East Local Government.\nIn his Constituency, the Speaker, Hon Adebo Ogundoyin, displayed and emulated his late father’s good nature and gesture by donating food and clothing to over a thousand widows, poor, and individuals with special needs.\nAccording to Hon Ogundoyin, the Late Adeseun Ogundoyin had great love for the people of Eruwa, Lanlate and indeed Ibarapaland, and he lived his entire life to serve the people.\nOver one thousand widows, indigent and people with special needs were presented with foodstuffs and clothes at the 30years remembrance programme.\nOther siblings of the Speaker, Adesoji, Adetoye and Aderemi Ogundoyin attended the remembrance programme."
  },
  {
    "headline": "England, Wales to legalise Outdoor civil weddings, partnership ceremonies",
    "summarized_story": "Outdoor civil weddings and partnership ceremonies will be legal in England and Wales beginning July 1, the government announced on Sunday.\nThe law change will be introduced through a statutory instrument meaning a vote will not need to take place.\nAdvertisementIn a minor relaxation of coronavirus restrictions in England, Monday (June 21) will see the 30-person cap on weddings lifted to allow more guests at ceremonies.\nThe relaxation of rules will see venues instead asked to limit numbers based on space, with social distancing measures enforced and masks worn.\nThe change will benefit almost 75% of weddings that are non-religious and take place on approved premises, as well as civil partnerships, according to the Government."
  },
  {
    "headline": "Two dead as training plane crashes in North Khorasan, Iran",
    "summarized_story": "A training plane has crashed in the northeastern province of North Khorasan in Iran killing two people on board, Commander of the North Khorasan Police Force Brigadier General Saeid Motahari said on Sunday.\nThe training plane crashed in Garmeh County at around 2pm Tehran local time.\nMr. Motahari said that rescue teams were dispatched to the area immediately after the incident.\nThe police commander also said the plane belonged to the Fara Sepehr Iranian Company, which operates in Bojnourd located in the northeastern province.\nHe added that the crashed plane was flying from Kalaleh to Bojnourd when it crashed due to a technical failure near the Robat Gharabil gas pipeline."
  },
  {
    "headline": "Finally, Emirates Concedes as Nigerians Can Now Travel Directly to Dubai",
    "summarized_story": "Emirates Airlines will resume flights to Nigeria from June 23, five months after it banned outbound flights from Abuja and Lagos.\nBesides the new condition for Nigerian travellers, UAE has new regulations for passengers travelling from South Africa and India to Dubai.\n“Passengers must present a negative test result for a PCR test taken within 48 hours before departure; UAE citizens are exempted.\nAll passengers must undergo a PCR test on arrival at Dubai airport.\nWe travel agents also paid a huge price because if Emirates flights were operating, we would have made money; we wouldn’t have been at the state we are now financially."
  },
  {
    "headline": "Buhari Canvasses Stronger Pressure on Mali to Return to Civil Rule",
    "summarized_story": "President Muhammadu Buhari has called on West African leaders to exert more pressure on the military leadership in Mali to ensure that the transition process in the country is not aborted.\nMali was recently suspended from the regional bloc due to a military coup in the country.\nPressures are needed to ensure that the transition process in Mali, which is halfway to its conclusion, is not aborted.\nOn Libya, Buhari faulted the recent United Nations resolution to expel all foreign fighters in Libya without first ensuring that they were disarmed.\nThis positive action will certainly enable our organisation move on and deliver services to the satisfaction of our Community citizens."
  },
  {
    "headline": "Nigeria: Anti-graft Chair Bawa Says EFCC Won’t Hand Over Cases to States",
    "summarized_story": "Chairman of the Economic and Financial Crimes Commission (EFCC), Mr. Abdulrasheed Bawa, has declared that the commission, under his leadership, would not hand over cases of interest to any state government.\nSome of the states envisage that the EFCC would hand over corruption cases concerning their states to the local anti-corruption commissions.\nBut those laws do not contain anything that says that EFCC has nothing to do with investigating their states, they would rather be complementing what the EFCC is doing.\n“There are a lot of Supreme Court decided cases on this particular issue.\nWe have 90 per cent to 95 per cent success rate in court on the cases that we have charged."
  },
  {
    "headline": "Nigeria: Abducted Kebbi Students May Have Been Rescued as Scores of Bandits Killed",
    "summarized_story": "Bandits, on Thursday, kidnapped at least 80 students and five teachers from the Federal Government College, Birnin Yauri, Kebbi State, killing a police officer in the process.\nKebbi State police spokesman Nafiu Abubakar, confirmed that the gunmen killed one of their officers during an exchange and also shot a student, who had since been receiving medical treatment at an undisclosed hospital.\nThe Kebbi State Police Command further claimed that the vehicle used to convey the kidnapped students and teachers belonged to an unnamed High Court judge in the state.\n“When we got there, we saw students crying, teachers crying, everyone is sympathising with people,” he also said to Reuters.\nMore than 800 students were believed to have been taken from their schools in the region since December."
  },
  {
    "headline": "Israel Voices ‘Grave Concern’ Over Iranian President-elect Ebrahim Raisi",
    "summarized_story": "Israel has said the international community should have grave concerns about the election of Iran’s new president-elect, Ebrahim Raisi.\nA spokesman for Israel’s foreign ministry, Lior Haiat, said Mr Raisi is Iran’s most extremist president yet.\nMr Raisi, who will be inaugurated in August, is Iran’s top judge and holds ultra-conservative views.\nIn his tweets, however, Mr Haiat said more than 30,000 people were killed, which is a number also referenced by Iranian human rights groups.\nHowever, human rights groups have said Mr Raisi should be investigated for atrocities."
  }
]