[
  {
    "headline": "Fire destroys INEC office in Zamfara",
    "summarized_story": "A fire incident has ravaged an office of the Independent National Electoral Commission in Zamfara State, situated in the Kaura Namoda Local Government Area.\nThe fire reportedly started at about 9pm on Monday.\nWhen firefighters arrived the scene in time to save the office, they reportedly could not put out the fire due to the lack of water in their firetruck.\nMeanwhile, INEC authorities in the region and the national level are yet to issue an official statement regarding the incident.\nThe Zamfara State Police Command are also yet to confirm the incident."
  },
  {
    "headline": "2023: How power can shift to South, Shehu Sani reveals",
    "summarized_story": "Sani said this in his tweet on Tuesday, which read, “Power will shift to the South only if the candidates of the two main political parties are picked from the South.”However, the APC and the PDP are still undecided on where to zone the presidential ticket.\nThe PUNCH reported that the APC national chairman, Adamu Abdulahi, had said that the party was yet to decide on zoning.\nSani had added in another tweet that the people that could not be ignored in the elections come 2023 remained the “Northern poor.”He said, “The most critical group of voters no national political party will ignore are “the Northern poor”.\nThey vote in the direction of their sentiment and the interest of those who control them, and not on their collective plight.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "2023: Stop recycling leaders who have nothing to offer – Ex- DSS Asst Director warns Nigerians",
    "summarized_story": "He went further to examine which kind of leaders Nigeria has had since independence from Britain and asked whether Nigeria had been led or ruled since independence?\nNigerians have been caught up in the quagmire of hypocritical leadership, where we are at the mercy of the politicians.\n“It is a truism that most of the politicians today are ignorant of or devoid of leadership skills and qualities.\nLeaders who understand the meaning of “Service” in Public Service, Finally, every public servant must be held accountable by being monitored with strict Key Performance Indicators (KPI).\nWe must have leaders with a reflective sense of tomorrow, other than that of private bank account enrichment and material acquisition."
  },
  {
    "headline": "London to Lagos on Bike: In Mauritania, death litters their roads — Kunle Adeyanju",
    "summarized_story": "BY DAMILOLA OGUNSAKINNigerian man, Kunle Adeyanju who embarked on a “charity ride” from London, the UK, to Lagos, has revealed that Mauritania is not a country he wants to visit again for anything.\nOn day 14, Kunle via his Twitter account, shared some of his uneventful experiences of the adventure so far.\nAccording to him, the Police, Immigration and Customs in Mauritania all worked together as a cartel to extort and make life hell for foreigners.\nHe went further to say he had visited over 75 countries around the world, and can categorically say that Mauritania is the worst of all the countries.\n‘’For me, Mauritania is not a country I ever want to visit again for anything."
  },
  {
    "headline": "We’re working on safe return of kidnapped victims of March 28 train attack – Buhari",
    "summarized_story": "President Muhammadu Buhari has assured families of those kidnapped by bandits in the ill-fated Abuja-Kaduna train service of March 28 that efforts were on-going to ensure their safe return.\n“This should ease their pain and anxiety as we push the military to ensure their safe return to their families.\nAccording to the president, bandits and terrorists, unlike professional soldiers, don’t respect the rules of engagement and can resort to harming hostages when attacked.\nPresident Buhari allayed fears that bandits would grow to yet another big challenge as faced by the Boko Haram threat, assuring that the administration would not allow such to happen.\nPresident Buhari stated that the welfare of the people of Abuja and that of all Nigerians would continue to remain paramount in government’s agenda."
  },
  {
    "headline": "2023: Ohanaeze youths, MASSOB slam Uwazuruike for endorsing Yahaya Bello",
    "summarized_story": "OWERRI—The Movement for the Actualisation of the Sovereign State of Biafra,MASSOB, and a factional body of Ohanaeze Ndigbo yesterday, condemned the pro-Biafra leader, Ralph Uwazurike, for endorsing the Governor of Kogi State, Yahaya Bello, for the 2023 presidential election.\nBut in separate statements, MASSOB and Ohanaeze, described Uwazurike’s action as unfortunate and a smack betrayal as Ndigbo continued to push for a Nigerian President of ‘Igbo extraction’.\n“We find it strange that he could sell his conscience just for a paltry N20m, to such an extent that a supposed pro-Biafra leader now talks so much about one Nigeria.\n“However, we pity those who find anything meaningful in Uwazurike, a man who was dethroned as MASSOB leader because of the same reason.\nThe group stated: “MASSOB has never engaged or campaigned or rallied for any politician vying for political office in Nigeria."
  },
  {
    "headline": "Buhari to security chiefs: It’s your duty to find terrorists and eliminate them",
    "summarized_story": "By Johnbosco AgbakwuruABUJA—President Muhammadu Buhari, yesterday, told heads of security agencies and service chiefs that it was their duty to know where the terrorists are and eliminate them.\nBuhari gave the charge after joining other Muslims to observe the Eid prayers at the Mambila Barracks Parade Ground, Abuja, in commemoration of the Eid-el-Fitr.\nResponding to questions as he returned to the Presidential Villa after the prayers, Buhari said his administration would continue to make the country safe for Nigerians.\n“Heads of the services of Army, Navy, Air Force, Inspector-General of Police and so on, are very much aware of the situation.\nIt’s their duties to know where the terrorists are and eliminate them.”On the forthcoming general elections, the president reaffirmed the commitment of his administration to free, fair and transparent process."
  },
  {
    "headline": "Pro-Biafra group, BnL begs police to release members",
    "summarized_story": "The Biafran Nations League (BnL) has appealed to the Nigeria Police to release its members arrested few days ago because they were ‘wrongly’ identified as members of the Movement for the Actualisation of State of Biafra (MASSOB).\nTwo days ago, police reportedly carried out a mass arrest of all suspected members of Biafra agitating groups, including outlawed MASSOB, in Ikom LGA of Cross River State.\nIn a release, signed by one Princewill Richard, who claimed to be the national leader of BnL, they claimed that “among those arrested were seven Igbo traders inside a watch repairer shop accused of being MASSOB members, while the remaining 17 are BnL members who were arrested in their houses.\n“Nine of our members were arrested in their houses in Ikom, where we had started our agitation, and we have much followers there.\n“Those arrested in their houses are our members, but those arrested in the shops are just petty traders."
  },
  {
    "headline": "How my abductors called me Adeboye, tortured me to produce N100m – Apostle Okoriko",
    "summarized_story": "The founder of the Solid Rock Kingdom Church, Apostle John Okoriko, who was recently kidnapped by gunmen in Mkpat Enin Local Government Area of Akwa Ibom State says he was severely tortured by his abductors while in captivity.\nThe abductors subsequently demanded N100 million from the church as the only condition for the release of the man of God.\nNarrating his ordeal during church service on Sunday, the General Overseer revealed that his abductors named him ‘Adeboye’, saying he is a rich pastor and must produce the ransom.\nAccording to him, two of the abductors knelt down and asked him for prayers before he was finally released.\nThey told me I am ‘Adeboye’ the richest pastor close to them in Akwa Ibom State."
  },
  {
    "headline": "Russia-Ukraine: War with us will be global disaster – Taiwan to China",
    "summarized_story": "Taiwan has weighed in on Russia’s invasion of Ukraine with a strong message to China.\nForeign Minister Joseph Wu warned that a war triggered by China will end in a global disaster.\n“They know that if there’s going to be a war over Taiwan, it’s going to be a disaster for the rest of the world”, Wu said.\nOn whether China considers Russia’s aggression as “a green light” to also invade Taiwan, Wu guessed they could if his country does not get support.\nThe minister however said China would have a second thought if the United States or other major countries declare readiness to stand with Taiwan."
  },
  {
    "headline": "My government won’t condone acts capable of truncating peace, harmony in Ogun – Abiodun",
    "summarized_story": "The Ogun State governor, Dapo Abiodun says his administration will not condone any act of indiscipline and criminality capable of truncating the peace being enjoyed by the residents of the stateAbiodun gave this position while hosting a reception for members of the Ogun State League of Imams and Alfas led by the Chief Imam of Egbaland, Sheik Sandala Bamgbola, to commemorate the Eid-el-Fitri celebration at the Presidential Lodge, Abeokuta.\nAbiodun reassured that the current administration will always ensure that religious bodies in the state are given equal treatment, imploring the religious leaders to interface on behalf of the government by educating the youths about the dangers inherent in committing crimes.\nEnumerating the importance of religious leaders to the enthronement of good governance in the state, the governor urged the residents to imbibe the spirit of tolerance as a means of promoting peaceful coexistence across the state.\nHe, however, disclosed that his administration would constitute the Muslim Pilgrims Welfare Board in due time.\n“COVID-19 didn’t allow us to go on pilgrimage to the holy land, so we didn’t feel compelled to constitute a board that will not have anything to do, but be rest assured that we will constitute that board and it will be a board that we will be proud of”, Abiodun submitted."
  },
  {
    "headline": "N.3m rapture fee: Kaduna CAN denies knowing Pastor Ade Abraham",
    "summarized_story": "The Christian Association of Nigeria (CAN), Kaduna State chapter, has denied knowing Pastor Ade Abraham, who is alleged to be resident in the state, promising to take his members to heaven if they pay a fee of N310,000.\nHayab, a faceless character like Ade Abraham can easily give the faith of the community a bad name, especially that CAN cannot trace his whereabouts or find any useful information about his being in Kaduna State.\nHe observed that is it possible that Ade Abraham before becoming spiritual had lived in Kaduna or did he come to Kaduna for a visit?\nIt, therefore, called for a proper investigation of Pastor Ade Abraham’s identity, and the location of his ministry to put the record straight to avoid creating panic and misleading the public.\nThe statement stated that if Abraham’s camp is in Ekiti and the sacred place where God is coming to rapture those who have paid their rapture fees, the statement wondered why Kaduna is in the story."
  },
  {
    "headline": "50 passengers escape as fire guts plane in Port-Harcourt",
    "summarized_story": "No fewer than 50 passengers were rescued when fire gutted the tyres of an aircraft operated by Dana Airlines Limited in Port Harcourt on Monday evening.\nThe incident occurred at the Port Harcourt airport with no life lost and no passenger injured.\nTitled ‘Press statement on Port Harcourt incident of 2/5/22’, the statement explained the aircraft had been grounded pending the conclusion of their investigations.\n“However, the impact on the brakes as a result of the aborted take-off affected the aircraft tyres which sparked off while the aircraft was taxiing to repark“All 50 passengers onboard the aircraft disembarked safely and our maintenance team have immediately grounded the aircraft pending the conclusion of their investigations.\n“Once again, we sincerely apologize to all the passengers on the flight for the inconveniences caused due to the eventual cancellation of the flight.”"
  },
  {
    "headline": "Row over ECOWAS Common External Tariff",
    "summarized_story": "Early this month, the Nigeria Customs Service (NCS) dumped the old version of the ECOWAS Common External Tariff (CET 2017- 2021) to the new one (2022- 2026).\nFew weeks ago, the Nigeria Customs Service (NCS) migrated from the old version of the ECOWAS Common External Tariff (2017- 2021) to the new one (2022- 2026).\nWhile within ECOWAS, duty rates for the same items are five per cent and 10 per cent.\nWhy the sudden imposition of 15 per cent and 20 per cent NAC levy on Nigerians?\n“The Nigeria Customs Service migrated from the old version of the ECOWAS Common External Tariff (2017- 2021) to the new version (2022- 2026)."
  },
  {
    "headline": "Events that shook internet in April 2022",
    "summarized_story": "Some of these events were unfortunate as scores were lost while others were general scenarios that left many aghast and furious.\nShe further revealed they were never married like she claimed and apologised to the public for the deceitful announcement and displays.\nThe video of the supposed 10-year-old female pupil and other male colleagues sparked outrage on the internet.\nØ Also, videos of ladies having sexual intercourse with dog surfaced online although their faces weren’t captured in the video.\nØ On April 30, a viral TikTok video saw a lady claiming she slept with a dog for N1.7million."
  },
  {
    "headline": "‘Dangote Refinery will focus on gas export, others’",
    "summarized_story": "Recently, the Minister of Information and Culture, Lai Mohammed, was ona facility tour of Dangote Refinery in Lekki, Lagos.\nNigerians are looking up to when Dangote Refinery will become operational as they are optimistic that it will be a huge relief in a multi-dimensional way.\nDangote Refinery is a huge opportunity for the country to gain foreign exchange (forex).\nThe subsidiaries that participated in the both fairs cut across Dangote Cement, Dangote Sugar, NASCON, Dangote Oil Refinery and Dangote Fertiliser.Their participations were necessitated by the fact that trade fairs have become veritable avenues for our subsidiaries to bond with their customers.\nThe Board of Directors and President of Dangote Group, Alhaji Aliko Dangote, recently went to Abuja to see President Muhammadu Buhari."
  },
  {
    "headline": "BREAKING: Businessman Olawepo-Hashim declares for 2023 Presidency",
    "summarized_story": "A chieftain of the All Progressives Congress (APC) Gbenga Olawepo-Hashim has joined the 2023 presidential race.\n“By reason of accident, my father came from Northern Nigeria and my mother from the South.\nHalf of my family are Christians while the other half are Muslims.\n“I have lived and schooled in both North and South as well as in Europe and America.\nI know that all human beings are born equal and deserving of equal rights, opportunities and justice."
  },
  {
    "headline": "BREAKING: 2023: Unless Igbo are allowed to rule, there may be no Nigeria-Edwin Clark",
    "summarized_story": "BY PHILIP NWOSUThe National Leader of the Southern and Middle Belt Leaders Forum (SMBLF) Chief Edwin Clark has criticised the sidelining and the continued marginalisation of members of the Igbo nation in the leadership of Nigeria, insisted that if the Igbo are now allowed to rule in 2023, there will be no Nigeria.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nAre you a Man 40 yrs and above?\nDo not miss the Vital Information, it goes off in 2 days!\nCLICH HERE to READ ."
  },
  {
    "headline": "I’ll hand over to person Nigerians elect -Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has reaffirmed the commitment of his administration to a free, fair and transparent electoral process in 2023.\nAsked who he would hand over to in 2023, Buhari replied: “The person that Nigerians elect.”The president said his administration would continue to work to make the country safe for Nigerians.\n“Heads of the services; Army, Navy, Air Force, the Inspector-General of Police and so on, are very much aware of the situation.\n“This should ease their pain and anxiety as we push the military to finding a safe return to their families.\nThe primary objective of any rescue operation is to free the hostages safely, unharmed and alive.”"
  },
  {
    "headline": "Iwuanyanwu, Mbaka thank The Sun for awards",
    "summarized_story": "Elderstatesman, Chief Emmanuel Iwuanyanwu and Managing Director, Platinum Mortgage Bank, Emmanuel Mbaka, have praised The Sun for the professionalism and impartiality in selecting its award winners.\nWhile expressing happiness for being singled out for honour, Iwuanyanwu and Mbaka, who wo-uld receive Lifetime Achievement award and Banker of the Year award respectively, said The Sun Awards are worthy recognitions.\nThe highly elated Iwuanyanwu said he couldn’t have been happier in his life, being recognised by one of the best newspapers in the country.\nHe said: “I thank you very much for finding me fit to receive this award.\nFor Mbaka, Ukeh said he was chosen as The Sun Banker of the Year Award for 2021, after a painstaking selection process."
  },
  {
    "headline": "World Press Freedom Day: Buhari salutes media’s role in sustaining democracy – The Sun Nigeria",
    "summarized_story": "A statement by Femi Adesina, media adviser, quoted Buhari as stating this on the occasion of the World Press Freedom Day, observed yearly on May 3.\nHe rejoiced with the Nigerian media, and recognised their role in strengthening the country’s democracy.\n“Today is a day globally, to remind governments of the need to respect their commitment to press freedom.\nIt is also a day of reflection among journalists and other media professionals about issues of press freedom and professional ethics.\nGovernments at all levels must take the lead in making sure that their actions do not inspire violations of press freedom."
  },
  {
    "headline": "2023: Race for PDP primary intensifies",
    "summarized_story": "He said the generals are believed to have the magic wand in the PDP unlike the ruling party, All Progressives Congress (APC) where President Muhammadu Buhari holds the aces.\nMeanwhile, Atiku Abubakar who clearly won the primaries of the party in 2019, our source said, is sweating to retain the structure with which he picked the PDP ticket.\nSeveral factors, he said, now work against Atiku unlike in 2019 when he had a smooth ride in several states particularly in the Southern part of the country.\nHe therefore asked the party’s leadership to grant him the right of first refusal for the 2023 ticket.\nAtiku said this to the PDP National Working Committee at the Wadata Plaza national secretariat when he formally acquainted the leadership with his decision to contest for the presidential ticket ahead of the 2023 elections."
  },
  {
    "headline": "Bury Zoning and Bury Nigeria, South/Middle Belt Leaders Warn",
    "summarized_story": "They declared that another eight years of northern presidency, after President Muhammadu Buhari, was unacceptable.\nThey said they were prepared for those attempting to upturn a practice – zoning – that had sustained the country.\nThe group warned that any attempt to kill and bury the age-long power rotation agreement between the north and south was tantamount to an attempt to kill and bury Nigeria.\nThe Southern and Middle Belt leaders also warned Abdullahi’s NEF, and wondered if the northern body was now out to dissolve the country.\nThey have our absolute support for the Southern and Middle Belt Leaders’ Forum and we stand firmly by them."
  },
  {
    "headline": "Buhari: Rescuing Kidnapped Train Passengers Delicate, Requires Wisdom",
    "summarized_story": "•Assures families victims will safely return•Says terrorists using captives as human shields, making their rescue difficultDeji Elumoye and Udora OrizuPresident Muhammadu Buhari, yesterday, said rescuing the kidnapped passengers of the Kaduna-bound train that was recently attacked by terrorists was a delicate situation, which required wisdom, utmost caution, and proper handling.\nBuhari, however, assured the families of the victims that efforts were on-going to ensure the safe return of all those held captive by the terrorists.\nHe directed security agencies and the Nigerian Railway Corporation (NRC) to provide more regular and detailed information to the victims’ families on their condition and efforts to save them.\nTerrorists had on March 28 attacked a Kaduna-bound train, killing no fewer than nine people, injuring several others, and abducting most of the passengers.\nSERAP also sued the president for his failure to secure the safe release of those held captive by the terrorists."
  },
  {
    "headline": "Banks, Others’ Borrowings from CBN Fell by 66% to N1.4trn in Four Months",
    "summarized_story": "Finance experts attributed the development to improved business environment post Covid-19, stressing that this paved the way for banks and merchant banks to halt borrowing from the CBN this year.\nOn his part, the Vice President, Highcap Securities Limited, Mr. David Adnori said uncertainty in the nation’s economy forced banks and merchant banks to shun borrowing from CBN.\nAccording to him: “Banks and merchant banks have excess liquidity and might not need to borrow from CBN.\nHe stressed that the nation’s economy in 2021, had normalised, giving room for banks and merchant banks to reduce borrowing from the CBN in 2022.\nAdeyeye explained that banks and merchant banks are maintaining effective risk management in a move to cut down down non-performing Loan (NPL) in the financial sector."
  },
  {
    "headline": "FIFA Fines Nigeria $.15m, Bars Fans from Moshood Abiola National Stadium Abuja",
    "summarized_story": "Duro IkhazuagbeWorld football governing body, FIFA, has imposed a fine of $150,000 on Nigeria following the disturbances that followed Super Eagles’ 1-1 draw with Ghana in a 2022 World Cup playoff at the Moshood Abiola National Stadium in Abuja.\nThe draw led to the non-qualification of Nigeria for the 2022 World Cup in Qatar.\nIn addition to the fine, fans have been barred from the Moshood Abiola Stadium in Abuja as Nigeria will play host to Sierra Leone in the first qualifying match of the 2023 AFCON next month.\nOver 60,000 fans crammed the stadium in Nigeria’s last game of the qualifiers for the World Cup in Qatar.\nThe fans’ action resulted in speculations in the local media that the stadium may not witness any international game in the foreseeable future."
  },
  {
    "headline": "2023: Two Groups Move to Stop PDP Convention over Power Rotation, Zoning",
    "summarized_story": "The kernel of their cases are that the PDP over the years had a tradition of power rotation and zoning.\nThe PDP had fixed May 28, for the conduct of its presidential primary election and to that effect screened the 17 aspirants who obtained the presidential form to run in the 2023 election.\nAs of last week, it was obvious that the PDP was not considering zoning its Presidential ticket to the south as being clamoured by southern governors and other leaders in the zone.\nThe PDP asked the court to strike out the suit for want of jurisdiction and also dismiss it for being “statute-barred”.\nIt is the ruling party that should be concerned with zoning, but not the PDP."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Police Academy Commandant, Ahmad Accused Of Islamisation Agenda, Separation Of Meals Between Cadets, Other Discriminatory Policies",
    "summarized_story": "The officers, while speaking with SaharaReporters, accused Ahmad, an Assistant Inspector-General of Police of marginalisation and a subtle islamisation agenda.\nAccording to them, postings of police officers in the Academy to offices are biased and sectional in nature.\n“Postings of police officers in the Academy to offices are biased and sectional in nature.\nAt the cadet's dining, cadets are separated because of the fasting of the Muslims with special meals and treatments for the Muslims and regular for that of Christian cadets.\n“With the introduction of the optional head scarfs for Muslim female serving police officers, the female cadets on training in the Academy now use scarfs."
  },
  {
    "headline": "EXCLUSIVE: Nigerian Police Academy Commandant, Ahmad Accused Of Islamisation Agenda, Separation Of Meals Between Cadets, Other Discriminatory Policies",
    "summarized_story": "The officers, while speaking with SaharaReporters, accused Ahmad, an Assistant Inspector-General of Police of marginalisation and a subtle islamisation agenda.\nAccording to them, postings of police officers in the Academy to offices are biased and sectional in nature.\n“Postings of police officers in the Academy to offices are biased and sectional in nature.\nAt the cadet's dining, cadets are separated because of the fasting of the Muslims with special meals and treatments for the Muslims and regular for that of Christian cadets.\n“With the introduction of the optional head scarfs for Muslim female serving police officers, the female cadets on training in the Academy now use scarfs."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Chief Of Defence Staff, Irabor Laments Increased Cases Of Soldiers Working With Boko Haram, Bandits, Others",
    "summarized_story": "The Chief of Defence Staff (CDS), General Leo Irabor has condemned the increase in cases of military personnel aiding and abetting terrorists and bandits in the country.\n“Recent happenings in various TOOs reveal an increase in cases of aiding and abetting by personnel.\nHe took his life after he was arrested for allegedly conniving with Boko Haram insurgents who attacked Yobe communities recently.\nJibrin, who disappeared from his duty post was said to have been sighted among the Boko Haram terrorists who had earlier attacked Geidam town.\nAlso arrested was another soldier attached to Headquarters 1 Division of the Nigerian Army, PTE Danladi Hadau (20NA/79/4219), along with two vigilantes identified as Mustapha Kasim and Ibrahim Mohammed."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Chief Of Defence Staff, Irabor Laments Increased Cases Of Soldiers Working With Boko Haram, Bandits, Others",
    "summarized_story": "The Chief of Defence Staff (CDS), General Leo Irabor has condemned the increase in cases of military personnel aiding and abetting terrorists and bandits in the country.\n“Recent happenings in various TOOs reveal an increase in cases of aiding and abetting by personnel.\nHe took his life after he was arrested for allegedly conniving with Boko Haram insurgents who attacked Yobe communities recently.\nJibrin, who disappeared from his duty post was said to have been sighted among the Boko Haram terrorists who had earlier attacked Geidam town.\nAlso arrested was another soldier attached to Headquarters 1 Division of the Nigerian Army, PTE Danladi Hadau (20NA/79/4219), along with two vigilantes identified as Mustapha Kasim and Ibrahim Mohammed."
  },
  {
    "headline": "2023 Presidency: RCCG Pastor Under Fire For Endorsing Osinbajo, Says He Spoke For Only Himself",
    "summarized_story": "Pastor Timothy Olaniyan, the Head of Politics and Governance of the Redeemed Christian Church, RCCG, has reacted to criticisms from different quarters over a comment he made regarding the candidacy of Vice-President Yemi Osinbajo for the 2023 general elections.\nOlaniyan, at the weekend, had said that Osinbajo remained the only child of God and a pastor that could change the narrative of governance in Nigeria.\nYemi OsinbajoOlaniyan was quoted to have said: “Money politics in this country has led us to where we are now.\n“As of today, Pastor Yemi Osinbajo is not just a pastor; he is still a child of God.\nThere are many pastors who can decide to do rituals with a human skull and still claim to be a pastor."
  },
  {
    "headline": "Akeredolu: For equity, APC must zone presidential ticket to south",
    "summarized_story": "Rotimi Akeredolu, governor of Ondo state, says for the sake of equity, the All Progressives Congress (APC) must zone its presidential ticket to the south.\nIn a statement on Tuesday, Akeredolu said it is the turn of the southern part of the country to produce the next president.\nThe governor said it will be “disingenuous” for anyone to argue against rotation of power to the south.\nAdvertisement“The party leadership should have no difficulty in making pronouncements on this very important issue, just as it has fixed various fees for the purchase of forms.\nEquity dictates that we take a stand.”AdvertisementAkeredolu said the current democratic dispensation is anchored on an unwritten convention that is driven by a principle of equity."
  },
  {
    "headline": "Akeredolu: For equity, APC must zone presidential ticket to south",
    "summarized_story": "Rotimi Akeredolu, governor of Ondo state, says for the sake of equity, the All Progressives Congress (APC) must zone its presidential ticket to the south.\nIn a statement on Tuesday, Akeredolu said it is the turn of the southern part of the country to produce the next president.\nThe governor said it will be “disingenuous” for anyone to argue against rotation of power to the south.\nAdvertisement“The party leadership should have no difficulty in making pronouncements on this very important issue, just as it has fixed various fees for the purchase of forms.\nEquity dictates that we take a stand.”AdvertisementAkeredolu said the current democratic dispensation is anchored on an unwritten convention that is driven by a principle of equity."
  },
  {
    "headline": "Report: US supreme court to overturn law legalising abortion",
    "summarized_story": "The US supreme court is reportedly set to vote to overturn the law that legalised abortion.\nAccording to a report by Politico, this was disclosed in a leaked draft majority opinion written by Samuel Alito, a supreme court justice.\nAnd far from bringing about a national settlement of the abortion issue, Roe and Casey have enflamed debate and deepened division.\n“An extremist supreme court is poised to overturn #RoeVWade and impose its far-right, unpopular views on the entire country.\nIt’s time for the millions who support the constitution and abortion rights to stand up and make their voices heard."
  },
  {
    "headline": "Report: US supreme court to overturn law legalising abortion",
    "summarized_story": "The US supreme court is reportedly set to vote to overturn the law that legalised abortion.\nAccording to a report by Politico, this was disclosed in a leaked draft majority opinion written by Samuel Alito, a supreme court justice.\nAnd far from bringing about a national settlement of the abortion issue, Roe and Casey have enflamed debate and deepened division.\n“An extremist supreme court is poised to overturn #RoeVWade and impose its far-right, unpopular views on the entire country.\nIt’s time for the millions who support the constitution and abortion rights to stand up and make their voices heard."
  },
  {
    "headline": "Report: Nigeria buys potash from Canada amid Russian supply disruptions",
    "summarized_story": "The federal government bought emergency supplies of Canadian potash in April following disruptions from Russia amid Western sanctions, Reuters is reporting.\nQuoting Uche Orji, managing director of the Nigeria Sovereign Investment Authority (NSIA), the newspaper reports that Nigeria bought three cargoes of Canadian potash, which should arrive within the next month.\nThe Canadian High Commission in Nigeria helped start the conversation with producers,” Reuters quoted Orji to have said.\nAdvertisement“The Canadian potash will hopefully arrive just in the nick of time for the planting season, which starts as early as end-May in some parts,” Gideon Negedu, FEPSAN executive director, was quoted to have said.\nAdvertisementThe International Monetary Fund (IMF) recently said the Russian invasion of Ukraine would lead to economic setbacks for sub-Saharan Africa, including Nigeria."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "Your data or your life?",
    "summarized_story": "Mental health care over data privacyWhat happens to your data when you die?\nOn the flip side is the ever golden question: Are Africans concerned about data privacy and security?\nWhile mental health care is becoming popular in Africa, does this mean we are better off sticking to traditional mental health care?\nEven though these apps typically make mental health care more accessible, the report suggests that access to mental health care may come at the expense of privacy.\nWill you choose data privacy over your mental health or vice-versa?"
  },
  {
    "headline": "Why funding news slowed down in April",
    "summarized_story": "Share this article:African startup funding news appeared to have slowed down in April.\nIn the episode of the Techpoint Africa podcast, our editorial team explores the trend, and other interesting global tech news this week.\n0:29 – Mental health & prayer apps and your privacyRead Mozilla Foundation’s report for context7:48 – Why Central African Republic has adopted Bitcoin as official currency19:51 – Why Nigeria’s Eden life acquired Kenya’s Lynk27:06 – Why funding news slowed down in AprilRegister for the Techpoint Africa Blockchain Summit by visiting blockchain.techpoint.africa.\nYou can also share interesting parts using the #TechpointAfricaPodcast hashtag.\nTechpoint Africa Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "Here are the confirmed speakers for the Techpoint Africa Blockchain Summit",
    "summarized_story": "Share this article:On May 21, 2022, the biggest blockchain and Web3 focused event — Techpoint Africa Blockchain Summit (TABS 2022), will be held at Four Points by Sheraton, Victoria Island Lagos.\nSpeaker at Techpoint Africa Blockchain SummitFisayo Fosudo is a visual storyteller, finance and technology video producer with over 250,000 subscribers.\nSpeaker at The Techpoint Africa Blockchain Summit.\nSpeaker at Techpoint Africa Blockhain Summit.\nSpeaker at Techpoint Africa Blockchain SummitSenator Ihenyen is the current President of Stakeholders in Blockchain Technology Association of Nigeria (SiBAN), a self-regulatory body in Nigeria’s emerging blockchain industry."
  },
  {
    "headline": "Earnipay leverages embedded finance to deliver frictionless transactions to drive on-demand salary earning.",
    "summarized_story": "This article is a Brand Press post.\nBrand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nFor more information, visit earnipay.comBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Mushe (XMU) Joins TikTok Owners ByteDance in a Contest of Clashing Metaverses",
    "summarized_story": "This article is a Brand Press post.\nBrand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nMushe (XMU) recently made a less publicized announcement of its own planned metaverse, but the details should interest anyone interested in virtual commercialization.\nLearn more about Mushe (XMU)Official Website: https://www.mushe.world/Presale Registration: https://portal.mushe.world/sign-upTelegram: https://t.me/MusheWorldXMUTwitter: https://twitter.com/Mushe_WorldInstagram: https://www.instagram.com/mushe_world/Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Obaseki moves to end street begging, urges stakeholders’ support – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has affirmed the government’s zero tolerance for street begging, noting that the state will begin the arrest and prosecution of parents of out-of-school children, as part of efforts to tackle the menace of street begging in the state.\nThe governor said, “We believe that basic education is the right for every Edo child; it’s their right and it’s free and compulsory.\nWe will link education with street begging and street children.\n“In the next few weeks or months, we will not allow street begging in Edo anymore.\nWe will make sure those hard-to-reach areas in the riverine communities will have teachers to teach the children."
  },
  {
    "headline": "Obaseki, Ehanire seek increased private partnership to improve healthcare system – Nigerian Observer",
    "summarized_story": "The duo made the call during a dinner organized for members of the Association of Nigeria Physicians in the Americas (ANPA) who are in Edo State on a one-week medical mission, providing specialised healthcare services to the people of Edo State.\nDuring the medical mission, over 5,000 Edo residents benefitted from the free surgical intervention and treatments for heart, kidney, eye and other ailments.\nHailing the association for the free medical outreach, Obaseki said the mission has provided better healthcare for Edo people.\nHe said, “We have received the fundamental benefit of hope to Edo people as you gave renewed life to Edo people.\nYou also engaged in capacity building as you interchanged skills and made your colleagues here locally improve their knowledge."
  },
  {
    "headline": "Obaseki inspects progress of work on Labour House, to finalises on construction of 7.2km Temboga Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said the government is commencing the construction the 7.2km Temboga Road in Ikpoba-Okha Local Government Area (LGA) of the state to decongest traffic around Ramat and its environs within the Benin metropolis.\nObaseki disclosed this when he was led on an inspection of ongoing construction of the Edo Labour House Complex, in Benin City, by the state chairman of the Nigeria Labour Congress (NLC), Mr. Odion Olaye.\nThe governor said, “We are finalising the design of Temboga Road; it’s about 7.2km to the end.\nOnce they finalize with the design in the next few weeks, we will award the contract.\nIt has a multipurpose hall which can be put into commercial use to generate income."
  },
  {
    "headline": "PHOTOS: Workers’ Day Celebration In Edo – Nigerian Observer",
    "summarized_story": "Check AlsoThe Governor of Edo State, Mr. Godwin Obaseki, has congratulated Muslims in the state as …"
  },
  {
    "headline": "2023: Why every Yoruba should rally behind Tinubu – Tunde Badmus",
    "summarized_story": "The elder statesman urged the other aspirants to consider the roles Asiwaju Bola Tinubu played in their success stories and desist from contesting the APC with him.\nThe person that you might see me together with is Asiwaju Bola Ahmed Tinubu.\nGo and check the history of Asiwaju Ahmed Tinubu, 90 percent of those who are managing him today are Christians.\nIt’s we Muslims that we say are we not building more Christians by giving our votes to Bola Ahmed Tinubu.\nWill Fayemi say Tinubu didn’t contribute to his being a governor?"
  },
  {
    "headline": "Fire guts Dana aircraft tyres in Port Harcourt, 50 passengers rescued",
    "summarized_story": "At least 50 passengers were on Monday, rescued unhurt when fire gutted the tyres of an aircraft operated by Dana Airlines Limited at the Port Harcourt airport in Rivers State.\nNo passenger was injured as first responders including operatives of the fire service at the airport moved in to control the situation.\nIn a statement on Tuesday morning, Dana Air spokesman, Kingsley Ezenwa, said the aircraft had been grounded pending the conclusion of their investigations.\nThe statement titled, ‘Press statement on Port Harcourt Incident of 2/5/22,’ partly read, “Our aircraft with registration number 5N JOY operating flight 9J 344 from Port Harcourt to Lagos on 2nd of May 2022, was set to take off when the pilot in command noticed an anomaly which he queried with the Air Traffic Control before embarking on a ramp return in line with our strict safety operating procedures“However, the impact on the brakes as a result of the aborted take off affected the aircraft tyres which sparked off while the aircraft was taxiing to repark“All 50 passengers onboard the aircraft disembarked safely and our maintenance team have immediately grounded the aircraft pending the conclusion of their investigations.\n“Once again, we sincerely apologize to all the passengers on the flight for the inconveniences caused due to the eventual cancellation of the flight.”Recall that the last air crash in the country involving a commercial airplane was in June 2012 when a Dana Air MD-83 aircraft from Abuja crashed near the Lagos airport while attempting an emergency landing, killing all 153 people on board and six on the ground."
  },
  {
    "headline": "Edo gov to arrest parents whose children are caught begging in streets",
    "summarized_story": "Godwin Obaseki, Edo State governor, has said the government will begin to arrest and prosecute parents of out-of-school children as part of efforts to tackle the menace of street begging in the state.\n“We believe that basic education is the right for every child in Edo State; it’s their right and it’s free and compulsory.\nWe will link education with street begging and street children,” he said.\n“In the next few weeks or months, we will not allow street begging in the state anymore.\nWe will make sure those hard-to-reach areas in the riverine communities will have teachers to teach children."
  },
  {
    "headline": "2023: Bury zoning, bury Nigeria – South/Middle belt leaders warn",
    "summarized_story": "According to them, another eight years of northern presidency, after President Muhammadu Buhari, was unacceptable.\nThey said they were prepared for those attempting to upturn a practice – zoning – that had sustained the country.\nThe group warned that any attempt to kill and bury the age-long power rotation agreement between the north and south was tantamount to an attempt to kill and bury Nigeria.\nThe Southern and Middle Belt leaders also warned Abdullahi’s NEF, and wondered if the northern body was now out to dissolve the country.\nThey have our absolute support for the Southern and Middle Belt Leaders’ Forum and we stand firmly by them."
  },
  {
    "headline": "Judges’ Poor Salaries: Lawyer Sues AGF, NJC, NASS",
    "summarized_story": "A Senior Advocate of Nigeria (SAN), Chief Sebastiane Hon, has sued the attorney-general of the federation, National Judicial Council (NJC) and the National Assembly (NASS) over poor wages being paid to judges.\nThe SAN, who dragged them before a Federal High Court, Abuja, is praying the court to compel them, alongside the Revenue Mobilisation Allocation and Fiscal Commission (RMAFC), to increase the salaries and allowances of judges in the country.\nThe suit by the senior lawyer is marked: FHC/ABJ/CS/595/2022 and filed in his capacity as a concerned legal practitioner in Nigeria.\n“As of November 2008 when the amended Act was in force, the exchange rate between the naira and the US dollar was N117.74 to USD1.\n“The naira has considerably lost its value over time; but judicial officers in Nigeria have been placed on the same salary scale for up to 12 years, namely since 2008,” he said."
  },
  {
    "headline": "Insurgency: South East, Owerri Zone Needs Salvaging – Maduka – Leadership News",
    "summarized_story": "Imo East senatorial aspirant, Sir Basil Maduka has expressed concerns over the gradual collapse of Owerri, and the entire South East following the outbreak of insurgency, criminality, and economic survival.\nMaduka, founder of Virgin Petroleum Group lamented over what he described as the lack of active political participation of the South East zone which portends danger for the economy.\nOur political Imo class do not realise that we are in a gradual self-destruct mode”.\n“I have gone round Owerri zone and I can conveniently tell you that I have not seen any sign of industrial smoke to show presence of a factory anywhere.\nHe assured the people of Owerri Zone that he will disappoint them if given the opportunity to serve them in the Senate come 2023."
  },
  {
    "headline": "Many Nigerians Still Trapped In Captivity, Bandits Prowl The North",
    "summarized_story": "Despite repeated marching orders to crush bandits and terrorists and free all abducted Nigerians in their dens, thousands of victims are still held in captivity.\nMinister of State for Education, Hon Chukwuemeka Nwajiuba, gave the confirmation while presenting his keynote address at the national campaign on out of school children in Birnin Kebbi, Kebbi State.\nAccording to the Kebbi State police command PRO, DSP Nafiu Abubakar, the bandits were engaged by Police and the military forcing the bandits to leave their targets.\nOn March 28, 2022, terrorists bombed the Abuja to Kaduna train, killing about nine and abducting unspecified number of passengers.\nIn his remarks, the Chief of Army Staff, Lt. Gen Faruk Yahaya charged troops to be ruthless with the terrorists, bandits, kidnappers and all violent criminals across the country."
  },
  {
    "headline": "Many Nigerians Still Trapped In Captivity, Bandits Prowl The North",
    "summarized_story": "Despite repeated marching orders to crush bandits and terrorists and free all abducted Nigerians in their dens, thousands of victims are still held in captivity.\nMinister of State for Education, Hon Chukwuemeka Nwajiuba, gave the confirmation while presenting his keynote address at the national campaign on out of school children in Birnin Kebbi, Kebbi State.\nAccording to the Kebbi State police command PRO, DSP Nafiu Abubakar, the bandits were engaged by Police and the military forcing the bandits to leave their targets.\nOn March 28, 2022, terrorists bombed the Abuja to Kaduna train, killing about nine and abducting unspecified number of passengers.\nIn his remarks, the Chief of Army Staff, Lt. Gen Faruk Yahaya charged troops to be ruthless with the terrorists, bandits, kidnappers and all violent criminals across the country."
  },
  {
    "headline": "Border Re-opening: Importers, Agents Recount Losses Of 2-year Closure",
    "summarized_story": "Recounting their experience to LEADERSHIP, they said that the border closure led to nothing beneficial to the economy, instead it brought hardship and suffering to them, the agents, importers and traders at the border communities.\nAn importer, Gideon Pedro Aremu, said the border closure did not really achieve anything for the government except the hardship, losses, and suffering it brought upon the traders and the entire border communities.\nYou can see the negative effects of the border closure.\nGovernment should tell us what they gained during the border closure,” he said.\nAnd probably nothing serious has changed as far as the security is concerned and probably they have seen that insecurity goes beyond border closure."
  },
  {
    "headline": "Ladoja bombs APC, PDP: Your nomination fees corruption boosters",
    "summarized_story": "Rasheed Ladoja of Oyo State said the exorbitant fees charged for nomination forms by APC and PDP will boost corruption.\nHe said that the high cost of nomination form charged by the ruling All Progressives Congress(APC) and Peoples Democratic Party(PDP) would have negative effect on the nation’s economy.\n“It is very ridiculous to ask a presidential aspirant to pick nomination form for N100 million and governorship nomination form for N50m.\n“Other political parties charge less than APC and PDP.\nLadoja urged the political parties to imbibe the lessons of Ramadan in their activities as political activities commenced in the country ahead of 2023."
  },
  {
    "headline": "Nigerian stakeholders worry over rising debt",
    "summarized_story": "By Kadiri AbdulrahmanSome stakeholders in the country’s economic sector have advised the Federal Government to take steps to halt the rising national debt stock as it is fast becoming unsustainable.\nRecently, the Debt Management Office (DMO) announced that the country’s total debt stock as of December 2021 was N39.55 trillion.\nOniha explained that the debt stock was made up of the domestic and external debt stocks of the Federal Government, the 36 state governments and the Federal Capital Territory.\nA breakdown of Nigeria’s public debt stock shows that 37.82 per cent is external, while the balance of 62.18 per cent is domestic.\n“We have a debt problem, we have a revenue problem and we have an expenditure problem."
  },
  {
    "headline": "Buhari Finally Reveals Who He’ll Hand Over To In 2023",
    "summarized_story": "Buhari Finally Reveals Who He’ll Hand Over To In 2023 [VIDEO]President Muhammadu Buhari has promised to hand over to whoever Nigerians elect to succeed him in 2023.\n“I will hand over to whoever Nigerians elect to succeed me,” the President said.\nMr Buhari, who briefly responded to questions after the prayer session, admitted to having sleepless nights over the security situation in parts of the country.\nHe, however, promised to spare no efforts in dealing decisively and mercilessly with the criminal gangs.\n“The national security chiefs and the Police IG are very much aware of the situation and their duty is to know where the terrorists are and eliminate them."
  },
  {
    "headline": "2023: No empty promises, Olawepo-Hashim says as he declares for presidency",
    "summarized_story": "2023: No empty promises, Olawepo-Hashim says as he declares for presidencyA chieftain of the All Progressives Congress (APC), Gbenga Olawepo-Hashim, has declared his intention to become the next president in 2023.\nNews Direct report that the Global Oil Chief Executive Officer made his intention to join the 2023 presidential race in a statement on Tuesday in Abuja.\nAccording to the APC chieftain, he promised to bridge the existing divides in the nation, heal the wounds and bring Nigeria back together again if elected as the president in 2023.\nOlawepo-Hashim added that he plans to build a new Nigeria as encapsulated in a 50 – point agenda that will be publicly presented soon by the Grace of God.\nHe said: “I have stepped out to ignite that fire, in my decision to seek the Presidency of the Federal Republic of Nigeria during the 2023 elections."
  },
  {
    "headline": "Olubadan’s younger brother, Senator Kola Balogun, dumps PDP",
    "summarized_story": "Senator Kola Balogun, representing Oyo South Senatorial District, has resigned his membership in the Peoples Democratic Party.\nNAN reports that Balogun, a younger brother of the Olubadan of Ibadan, Oba Lekan Balogun, is the Vice-Chairman of the Senate Committee on Sports and Youth Development.\nHe said that the letter was received and acknowledged by the PDP Ward Chairman, Tijani Wasiu, on April 29.\n“I, Sen. Kola Balogun, representing Oyo South Senatorial District in the ninth Senate, Federal Republic of Nigeria, hereby tender my membership resignation from PDP with effect from April 28.\nBalogun was the only PDP senator from the state in the ninth senate until his resignation."
  },
  {
    "headline": "Joint Security Forces neutralize bandits in Rafi LGA of Niger",
    "summarized_story": "In an attempt by terrorists/armed bandits to disrupt the peaceful Eid-el-fitr celebration in Niger State, joint security forces engaged and neutralized the hoodlums in Rafi LGA of the State.\nOn 02/05/2022 at about 1700hrs, armed bandits on motorcycles attempted to attack Kawo, Uregi villages in Rafi LGA to disrupt Sallah celebration in the State.\nOn the receipt of this information, joint security tactical teams responded swiftly and mobilised to the area where the hoodlums were engaged around Uregi, Kiribo villages and as a result, about ten bandits were neutralized, 14 kidnapped citizens were rescued and seven motorcycles recovered with arms from them.\nGovernor of Niger State Abubakar Sani Bello commended the gallantry efforts of the security personnel, including the local vigilante members who are supposed to be with their families and loved ones to celebrate Sallah, but rather chose to remain vigilante in the forest to provide security for Nigerlites.\nHe reassured them of his commitment and determination to ensure peace is restored in all the troubled communities."
  },
  {
    "headline": "Breaking: Another disaster averted as Dana air catches fire",
    "summarized_story": "Up to 50 passengers were promply and safely evacuated after another air disaster was averted when the tyres of an aircraft belonging to Dana Airlines caught fire shortly before take off.\nBlueprint gathered that no life was lost and no passenger was injured as first responders including operatives of the fire service at the airport moved in to control the situation.\nA press statement, Tuesday morning, Dana Air spokesman, Kingsley Ezenwa, said the aircraft had been grounded pending the conclusion of their investigations.\n“All 50 passengers onboard the aircraft disembarked safely and our maintenance team have immediately grounded the aircraft pending the conclusion of their investigations.\nShare this: TwitterFacebook"
  },
  {
    "headline": "World Press Freedom Day: Media freedom under attack in Nigeria – NGE",
    "summarized_story": "The Nigerian Guild of Editors (NGE) Monday said the inalienable right to access and disseminate information through an independent press is under attack in Nigeria.\nIt is also a day of reflection among journalists and other media professionals about issues of press freedom and professional ethics.\n“Governments at all levels must take the lead in making sure that their actions do not inspire violations of press freedom.\nPublished ahead of World Press Freedom Day May 3, the data from IPI’s Ukraine War Press Freedom Tracker underscores the devastating toll the conflict has already taken on independent journalism, media freedom and the safety of journalists in both countries.\n“These attacks in both countries cast a dark shadow over this year’s World Press Freedom Day."
  },
  {
    "headline": "2023: I will hand over to Nigerians’ elected choice – Buhari",
    "summarized_story": "The president assured of his readiness to hand over to the democratically elected president in 2023.\nResponding to questions after he returned to the Presidential Villa after the prayers, the President said his administration would continue to work to make the country safe for Nigerians.\nOn the 2023 general elections, the President reaffirmed his commitment to free, fair and transparent process.\nSpecial prayers were offered for an end to the various challenges bedeviling the country, peaceful 2023 elections, as well as sustainable national unity, stability and prosperity.\nAbubakar, who said this in his Eid-el-Fitr Sallah message to Nigerians in Sokoto, urged politicians to allow peace to reign in the country."
  },
  {
    "headline": "Edo State NLC tasks FG on improving job creation",
    "summarized_story": "He made the call yesterday during the 2022 Workers’ Day in Benin City, Edo State.\nMeanwhile, the Edo State Governor, Godwin Obaseki, has approved N40,000 as new minimum wage for workers in the state, in commemoration of this year’s Workers’ Day.\nIt will be immoral and mindless of us to continue to pretend we do not know our workers are suffering.\n“The government of Edo has now decided to review the minimum wage for Edo workers from N30,000 to N40,000.\nUndoubtedly, Edo is the first state since the current outbreak of coronavirus to take this initiative."
  },
  {
    "headline": "2021: FCMB records N1.57trn deposit",
    "summarized_story": "By Onu OkorieFirst City Monument Bank FCMB Group Plc has recorded a Total deposit increase by 1.21 per cent to N1.57 trillion from N1.1.55 trillion in the previous year.\nis on the path of growth overcoming two economic recession as the lender’s profit hit a seven year high and an inch to equaling 2015 highs.\nThe uptick in profit was buoyed by an improvement in interest income as FCMB created risk assets and loans while a benign yield environment strengthened income from treasury yields.\nInterest income on loans and advances increased by 39.87 percent to N46.69 billion in March 2022.\nNet interest income, the difference between the revenue generated from a bank’s interest-bearing assets and the expenses associated with paying its interest-bearing liabilities, was up 52.59 percent to N18.54 billion as at March 2021."
  },
  {
    "headline": "Ogbeifun seeks financial support for seafarers to build capacity for employment",
    "summarized_story": "By Naomi DourglasChairman of Startz Investment Company and former president of Ship Owners Association of Nigeria (SOAN) Engr.\nGreg Ogbeifun has tasked the Federal Government to help Nigerian ship owners with necessary financial support to enable them to build the capacity for seafarers through employment.\n‘He also explained that, the Secretary-General of MOWCA had confirmed to him that the Managing Director of the RMDB has been appointed.\nSo, hopefully, in two or three months, we will have a functional maritime bank with some funds that operators begin to look forward to”.\nOgbeifun stated that the RMDB will serve as a succor to ship owners who find it difficult to access the Cabotage Vessel Financing Fund (CVFF)."
  },
  {
    "headline": "2021: MTN Nigeria Plc rewards shareholders with N13.12bn as dividends",
    "summarized_story": "Also Board representatives re-elected are Mr Rhidwaan Gasant and Mrs lfueko Omoigui-Okauru.\nAs at the end of March 2022, we had approximately 10.7 million active users and 166k active MoMo agents,” MTN Nigeria CEO, Karl Toriola, said.\nMTN Nigeria was recently granted final approval for a Payment Service Bank (PSB) by the Central Bank of Nigeria (CBN).\n“Having established a significant foundation of registered agent network, we are now focusing on scaling the active base.\nWe have expanded our agent services to include card withdrawal services by deploying point of sales (POS) terminals to the agent network."
  },
  {
    "headline": "P+ Measurement wins awards in PR, industry influencer relations",
    "summarized_story": "By Kehinde Ibrahim LagosP+ MEASUREMENT Services, Nigeria’s foremost Independent Public Relations measurement and evaluation agency have attained double laurels at this year’s Industry Awards where it clinched the Leader in PR Measurement & Industry Influencer Awards (Public Relations), for its quality offerings that surpass clients’ expectations and leading position in the sector.\nThe awards come on the heels of the company’s rebranding business strategy with a new logo, website, and office to deepen penetration and maintain its dominant position in the industry it operates, with over 47 brands and 17 Public Relations agencies in Africa’s largest economy.\nAccording to him, the award-winning and innovative organisation, with cutting-edge solutions has dictated the pace of the Public Relations measurement and evaluation services with its distinctive approach to ensuring that clients’ objectives are achieved.\nIts measurement and evaluation report are in-depth, robust, and flexible to accommodate valid metrics that brands desire to see reflected in their customised reports, and also based on the AMEC Standard by the Barcelona Principle 3.0.\nAlso, as part of its efficient services, the measurement and evaluation company introduced “Get-Reports,” a novel product that allows the purchase of PR performance audit reports in key sectors including the 22 Commercial Nigerian Banks PR Performance Audit Report, Top Nigerian Insurance PR Performance Audit Report, Top Nigerian Digital Banks PR Performance Audit Report, and Top Online Streaming Services PR Performance Audit Report."
  },
  {
    "headline": "Journalists Face Attempts To Silence Them From Many Sides – UN",
    "summarized_story": "He stressed the need to shine a spotlight on the essential work of journalists and other media workers who seek transparency and accountability from those in power, often at great personal risk.\n“Throughout the COVID-19 pandemic, many media workers have been on the frontlines, providing accurate, science-based reporting to inform decision-makers and save lives,” Guterres said.\n“But the threats to the freedom of journalists and media workers are growing by the day.\nFrom global health to the climate crisis, corruption, and human rights abuses, they face increased politicisation of their work and attempts to silence them from many sides.\nThe United Nations is working to support journalists and media workers everywhere.”Guterres explained that the UN established a Plan of Action on the Safety of Journalists 10 years ago to protect media workers and end impunity for crimes committed against them."
  },
  {
    "headline": "‘Oxygen Of Democracy,’ NHRC Asks Nigerian Govt To Protect, Support Journalists",
    "summarized_story": "The press is a critical agent for the protection of democracy and development and must be supported to enable them to effectively discharge their constitutional duties as the watchdog of the society, the National Human Rights Commission (NHRC) has said.\nNHRC Executive Secretary, Tony Ojukwu, made the remarks on the eve of the celebration of the 2022 World Press Freedom Day which is commemorated annually on May 3.\n“It must remain the conscience of the nation, telling the truth at times like this, to save our democracy,” said a statement on Tuesday by the NHRC spokesperson, Fatimah Mohammed.\nOjukwu, a Senior Advocate of Nigeria (SAN), said, “It is on this note that I commend UNESCO for championing the proposed World Press Freedom Day Global Conference scheduled to hold between May 2 and 5 in Punta Del Este, Uruguay.\nHe, therefore, urged the law enforcement agencies, including the police to, as a matter of necessity, intensify their investigations to unravel the circumstances surrounding the death of some Nigerian journalists, including that of late Vanguard newspaper, Tordue Salem, whose body was reportedly found in Abuja in 2021."
  },
  {
    "headline": "50 Passengers Rescued After Fire Guts Aircraft Tyres At Port Harcourt Airport",
    "summarized_story": "All passengers onboard an aircraft have been rescued after its tyres caught fire after a planned trip out of Rivers State was aborted.\nThe incident which involved an aircraft operated by Dana Airlines Limited occurred on Monday in Port Harcourt, the state capital.\nHe explained that the aircraft with registration number 5N JOY was set to take off from Port Harcourt to Lagos when the incident occurred.\nHe said the impact on the brakes affected the aircraft tyres, causing them to spark off while the aircraft was taxiing to repark.\nREAD ALSO: Fire Guts INEC LG Office In ZamfaraAccording to the airline official, all 50 passengers onboard disembarked safely while the aircraft was immediately grounded by the company’s maintenance team."
  },
  {
    "headline": "Death Toll Rises To 10, As 24 Rescued In Lagos Building Collapse",
    "summarized_story": "At least 10 persons have died after a building collapsed in the Ebute-Meta area of Lagos on Sunday evening.\nAccording to a statement signed by Director of the Lagos State Fire and Rescue Service, Adeseye Margaret, on Monday 24 persons have also been rescued alive with varying degrees of injury.\nThe three-storey building, located on 32, Ibadan Street, Ebute-Meta, reportedly collapsed on Sunday evening with rescue operations quickly set in motion.\nHe also regretted the frequency of building collapses in the country and urged relevant authorities to do more to halt further reoccurrences.\n“President Buhari wishes those injured a speedy recovery and prays for divine assistance in the ongoing search and rescue operations,” the statement signed by presidential spokesperson Femi Adesina said."
  },
  {
    "headline": "WHO Warns Of Obesity ‘Epidemic’ In Europe",
    "summarized_story": "The WHO said Tuesday that “epidemic” overweight and obesity rates are linked to over 1.2 million deaths annually across Europe, calling for swift policy changes to reverse the dangerous trend.\nNearly a quarter of adults are now obese in Europe, higher than in any other region except the Americas, the WHO said.\n“Overweight and obesity rates have reached epidemic proportions across the region and are still escalating,” the health body’s European office said.\nThe prevalence of obesity among adults has risen by 138 percent since then, with a 21-percent increase between 2006 and 2016.\nEnvironmental factors unique to “modern Europe’s highly digitalised societies are also drivers of obesity”, it said, including the marketing of unhealthy foods and online gaming — especially among children."
  },
  {
    "headline": "National Assembly workers threaten fresh strike over minimum wage -",
    "summarized_story": "Staff of the National Assembly have served notice of an industrial action to the National Assembly Civil Service Commission over unpaid salaries and allowances.\nThe Parliamentary Staff Association of Nigeria threatened to resume its suspended strike if the management fails to begin payment of arrears of minimum wage adjustment by the end of May.\nThe workers rejected the new payment plan put forward by the management of the National Assembly and the National Assembly Service Commission which tend to spread the payment to March 2023.\nIn a communique, the Association, resolved that its members would only allow the management and the commission six months, effective April 2022 to pay the arrears, as against the March 2023 deadline contained in the new proposal by their employees."
  },
  {
    "headline": "2023: It's the turn of South to produce next president, Akeredolu insists -",
    "summarized_story": "The Chairman of Southern Governors Forum, Rotimi Akeredolu has urged the leadership of the All Progressives Congress not to keep party members guessing on where the next president of Nigeria will come from.\nThe Governor in a statement he personally issued, said it is the turn of the Southern part of the country to produce the next President.\nAccording to him, the party leadership should have no difficulty in making pronouncement on this very important issue, just as it has fixed various fees for the purchase of forms.\nHe said , We must not keep our party men and women guessing on the position of the leadership of the party.\n“The party Executive Committee has fixed a fee for the purchase of the nomination form for the office."
  },
  {
    "headline": "2023 Presidency: MASSOB leader, Uwazurike leads thousands of youths in solidarity march for Yahaya Bello -",
    "summarized_story": "The youths, who started the procession from the MASSOB leader’s House in Owerri, marched through the streets, carrying different placards, with inscriptions such as “Power to the Youths, Support Yahaya Bello”, “Youths Can Also Lead”, and “Yahaya Bello for the Youths”, among others.\nAccording to them, in this regard, Governor Bello is the right fit for the position of President of the Federal Republic of Nigeria.\n“All Nigerians should rally round the youthful Governor, Yahaya Bello.\nWe are supporting Yahaya Bello for this and no one else.\nWe must give youths a chance, especially one that has demonstrated uncommon capacity, in the person of Yahaya Bello,” he said."
  },
  {
    "headline": "British Member of Parliament to resign for Watching Porn in Parliament",
    "summarized_story": "A Conservative British Member of Parliament, Neil Parish, has announced that he will resign after admitting twice watching pornography in the House of Commons.\nParish told the BBC the first time he viewed the explicit material was an accident after searching online for farm vehicles.\nThe Government of Prime Minister, Boris Johnson, is engulfed in numerous scandals, just days ahead of crucial local elections.\nThe Prime Minister himself has been fined by police for breaching his own Covid rules during the 2020 lockdown, and faces an investigation into whether he misled Parliament about parties in Downing Street.\nWe support his decision to step down as our Member of Parliament.”"
  },
  {
    "headline": "Nigeria’s Oil Under-Production Undermines OPEC Projection in April – Arise News",
    "summarized_story": "Nigeria, Libya and a handful of African countries again hobbled the projected oil production plan by the Organisation of Petroleum Exporting Countries (OPEC) in April, failing to meet the quota allocated to them by the oil producers’ group.\nThe country produced 1 .39 million barrels per day as against its April allocation of 1.735 million bpd by OPEC.\nOPEC pumped 28.58 million barrels per day (bpd) in April, up 40,000 bpd from the previous month and short of the 254,000 bpd increase called for under the supply deal.\nOPEC and its allies, known as OPEC+, are slowly relaxing 2020 output cuts as demand recovers from the pandemic.\nThe deal called for a 400,000 bpd increase in April from all OPEC+ members, of which about 254,000 bpd is shared by the 10 OPEC producers the agreement covers."
  },
  {
    "headline": "IMF: 20 Sub-Saharan African Countries in Debt Distress, High Risk of Debt Distress",
    "summarized_story": "The International Monetary Fund (IMF) has warned that debt vulnerabilities remains elevated in Sub-Saharan Africa, with no fewer than 20 countries in the region either at high risk of debt distress or already in debt distress.\nUnsustainable debt could lead to debt distress, where a country is unable to fulfill its financial obligations and resorts to debt restructuring.\nAlthough the IMF chief did not list the 20 African countries in debt distress or high risk of debt distress, the most recently published data indicated that eight countries in the world were in debt distress, 30 at high risk, 24 at moderate risk, and seven countries at low risk of debt distress.\nAfrican countries in high risk of debt distress were listed then as Burundi, Cabo Verde, Cameroon, Central African Republic, Comoros, Djibouti, Ethiopia, The Gambia, Ghana, Guinea Bissau, Kenya, Malawi, Sierra Leone, Zambia,Of the eight countries in debt distress globally, all but Grenada are from Africa.\nDespite its N39.556 trillion ($95.77 billion) public debt profile as at December 31, 2021, and over 80 per cent debt service-to-revenue ratio, Nigeria is neither classified as a nation in debt distress nor high risk of debt distress."
  },
  {
    "headline": "Terrorists Using Captives as Human Shields, Rescuing Kidnapped Train Passengers Requires Wisdom, Buhari Says",
    "summarized_story": "President Muhammadu Buhari, on Monday, said rescuing the kidnapped passengers of the Kaduna-bound train that was recently attacked by terrorists was a delicate situation, which required wisdom, utmost caution, and proper handling.\nBuhari, however, assured the families of the victims that efforts were on-going to ensure the safe return of all those held captive by the terrorists.\nHe directed security agencies and the Nigerian Railway Corporation (NRC) to provide more regular and detailed information to the victims’ families on their condition and efforts to save them.\nTerrorists had on March 28 attacked a Kaduna-bound train, killing no fewer than nine people, injuring several others, and abducting most of the passengers.\nSERAP also sued the president for his failure to secure the safe release of those held captive by the terrorists."
  },
  {
    "headline": "Nigeria: Banks, Others’ Borrowings from CBN Fell by 66% to N1.4trn in Four Months",
    "summarized_story": "On his part, the Vice President, Highcap Securities Limited, Mr. David Adnori said uncertainty in the nation’s economy forced banks and merchant banks to shun borrowing from CBN.\nAccording to him: “Banks and merchant banks have excess liquidity and might not need to borrow from CBN.\nHe stressed that the nation’s economy in 2021, had normalised, giving room for banks and merchant banks to reduce borrowing from the CBN in 2022.\nAdeyeye explained that banks and merchant banks are maintaining effective risk management in a move to cut down down non-performing Loan (NPL) in the financial sector.\nHe added that: “Banks and merchant banks with increasing deposit from customers prefer to lend to CBN rather than their customers to maintain NPL below five per cent threshold demanded by CBN.”"
  },
  {
    "headline": "Nigeria’s Southern and Middle Belt Leaders Say Eight Years of Northern Presidency Unacceptable – Arise News",
    "summarized_story": "They declared that another eight years of northern presidency, after President Muhammadu Buhari, was unacceptable.\nSMBLF warned that the move to tinker with the rotation of the presidency was inimical to national unity.\nThe Southern and Middle Belt leaders also warned Abdullahi’s NEF, and wondered if the northern body was now out to dissolve the country.\nThe statement said, “SMBLF says it is rather unfortunate and absurd that Ango Abdullahi and his Northern Elders Forum would make such twaddle.\nThey have our absolute support for the Southern and Middle Belt Leaders’ Forum and we stand firmly by them."
  }
]