[
  {
    "headline": "400,000 apply for 200 ICPC job slots",
    "summarized_story": "NO fewer than 400,000 Nigerians applied for the Independent Corrupt Practices and Other Related Offences Commission 200 job slots.\nThe recruitment exercise was said to have begun early 2020 but was suspended due to the COVID-19 pandemic.\nThe ICPC spokesperson, Mrs Azuka Ogugua, disclosed in a statement on Thursday that the commission had received approval to complete the process.\nShe said, “For a recruitment approval for less than 200 officers, the commission received almost 400,000 applications from Nigerians.\n“Applicants and the general public are, therefore, advised to bear with the commission in this process."
  },
  {
    "headline": "Citizens can report corruption through phone lines –ICPC",
    "summarized_story": "The Independent Corrupt Practices and Other-Related Offences Commission on Thursday said the deployment of security gadgets, including body cameras, had assisted in the tracking and prosecution of electoral offenders in Nigeria.\nHe said, “It is imperative to note that electoral frauds, ranging from vote selling and vote buying, ballot box snatching, falsification or manipulation of election results, among others, are ICPC considers as political corruption and they are punishable under the Electoral Act.\nAll rights reserved.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Reps committee wants INEC to conduct LG poll",
    "summarized_story": "The House of Representatives Committee on Constitution Review says it is considering giving the conduct of local government elections to the Independent National Electoral Commission.\nThe youth leaders advocated, among others, a secured tenure for elected local government leaders, financial autonomy for local government and independence of the local government administration.\nHe said, “You remember the intervention he made regarding the judicial autonomy and the financial independence of the local government.\n“You are adding the secured tenure of the local government now.\nThat is in tandem with what the present government wants to do to ensure good governance at that level."
  },
  {
    "headline": "2023: Group warn Senator against instigating public unrest, insurrection against AKSG",
    "summarized_story": "A Nigerian Senator has been warned against instigating public unrest, inciting the masses against the person and office of the Governor and any unconstitutional act of insurrection that may derail the prevailing peace in the State.\nThe statement read in parts, “The recent press statement against the Special Assistant Media to the Governor by Senator Bassey Akpan is just a smokescreen of his agenda for the 2023 battle.\nWe know that the main target in the failed propaganda was the Governor whom he tried to incite the people against.\nThis was him in his usual element all in a desperate bid to whip public sentiment, sympathy and votes, a gimmick that failed even before it began”.\nThe group called on the Senator to call his “attack dogs” to order and always verify his claims before rushing to the press in order to spare himself avoidable embarrassment."
  },
  {
    "headline": "Lagos tasks traditional rulers on conflict resolution, communal peace",
    "summarized_story": "The Lagos State Government on Thursday, charged traditional rulers on conflict resolution, fostering communal peace and economic development in their domains.\nThe Commissioner for Local Government and Community Affairs, Dr Wale Ahmed, gave the charge at a Retreat, organised for traditional rulers in Lagos state.\nThe theme of the retreat is: ”The Role of Traditional Rulers in Conflict Resolution and in Fostering Communal Peace and Economic Development in Lagos State”.\nHe said the traditional rulers should ensure that residents in each community, understood government policies and programmes in the simplest form, using preferably the indigenous languages.\nOther speakers included, the Permanent Secretary, Lagos State Primary Health Board, Dr Akinwunmi Mustapha and the Commissioner for Justice, Mr Moyosore Onigbanjo (SAN)."
  },
  {
    "headline": "Ondo Assembly appeals to striking doctors to resume work",
    "summarized_story": "The Ondo State House of Assembly on Thursday appealed to the doctors on strike to please toe the line of peace and return to work in the interest of the people.\nThe lawmakers while deliberating on the development on Thursday at plenary, expressed deep concern about the effects of the strike on the people.\nHe called for a tripartite meeting which would involve medical personnel, the executive and the legislative arms with a view to fashion out an amicable solution to the lingering crisis.\nOleyelogun said that the strike had triggered mortality among patients who patronised quack doctors because they lacked the wherewithal to attend standard hospitals in view of the high charges.\nThe speaker appealed to relevant authorities to find an amicable solution to the industrial crisis which had triggered brain drain amongst medical personnel in the state."
  },
  {
    "headline": "Finally, 136 abducted Tegina pupils released; on their way to Minna",
    "summarized_story": "pupils of the Salihu YankoBy Wole MosadomiMinna- At last, the 136 pupils of the Salihu Yanko Islamiyya School in Tegina, Niger state have been released after spending almost three months in the hands of their abductees.\nThe pupils were said to be released in Brinin Gwari in Kaduna state around 8:pm today.\nThe exact number of pupils that eventually survived out of the initial 136 kidnapped cannot however be ascertained for now.\nMost of the children are between the ages of five and fifteen.\nVanguard exclusively reported on Wednesday that six of the pupils have died while in captivity in the past three months while the health of several others is deteriorating fast."
  },
  {
    "headline": "Fuel tanker explodes at Owode Ibeshe road, Ikorodu",
    "summarized_story": "By Olasunkanmi AkoniMen of the Lagos State Fire and Rescue Service with the collaboration of Lagos State Emergency Management Agency, LASEMA, on Thursday, averted loss of lives and property following explosion of Premium Motor Spirit, PMS, laden tanker at Owode Ibeshe road, (inward Dangote), Ikorodu area of the state.\nAccording to a source, the incident occurred around 5 pm as residents ran in different directions to safety.\nDirector General, LASEMA, when contacted, confirmed that no life was lost in the unfortunate incident.\nOke-Osanyintolu said: “On August 26, LASEMA Response Unit received multiple reports of a tanker fire at Owode Ibeshe road, (inward Dangote), Ikorodu.\n“The LASEMA Response Unit arrived to find a fully involved tanker loaded with slug on fire."
  },
  {
    "headline": "Bandits release Islamic students kidnapped in Niger after three months",
    "summarized_story": "More than 70 Islamiyya school pupils kidnapped from Tegina community in Niger State have been released.\nA large number of bandits stormed the village late May and took the students.\nA security agent told PRNigeria Thursday night that the ex-captives are on their way to Minna from Birnin Gwari.\nThe Salihu Tanko Islamiyya school was built by a retired Immigration officer.\nIn February, bandits abducted some staff and students of Government Science College, Kagara in Niger."
  },
  {
    "headline": "Catholic bishops take position on agitation for Nigeria’s break-up, insecurity",
    "summarized_story": "The Catholic Bishops of Nigeria, CBCN, has taken a stand on the rising insecurity, electronic transmission of results and call for Nigeria’s break-up.\nThe Catholic bishops, in a communiqué issued at the end of the Second Plenary Meeting of the Catholic Bishops’ Conference of Nigeria (CBCN), Enugu, appealed to President Muhammadu Buhari’s government to adopt inclusion of all ethnic groups in decision making and policies of the nation in order to avoid a break-up.\nThe clergy admonished Nigerians and the government to toe the path of unity and dialogue in order to unite the nation and not cause break-up.\n“We insist that there is an urgent need for a fair and credible electoral process, through which our political leaders emerge.\n“We call on the National Assembly to reconsider its position in the light of world best practices,” the communique added."
  },
  {
    "headline": "Ortom: NANS condemns NBC ‘victimisation’ of Channels TV presenters",
    "summarized_story": "The National Association of Nigerian Students (NANS), Ogun State, has condemned the National Broadcasting Commission (NBC) for summoning Chamberlain Usoh and Kayode Okikiolu of Channels Television to its Abuja office, describing it as victimisation.\n“Aside from the victimisation of the journalists, which reeks of abuse of power and anti-criticism status, Channels Television is also being threatened with the suspension of their broadcasting license.\n“While the respondents who went to air their opinion are left alone, the journalists are being victimized because they are the easy prey.\n“This condemnable action by the Federal government will only present Nigeria as a laughing stock in the international community.\n“The Nigerian Students in the entire South West solidarises with every affected journalists and media outfits."
  },
  {
    "headline": "Banditry: Matawalle assures security agencies of total support",
    "summarized_story": "Governor Bello Mohammed has commended President Muhammadu Buhari for his immediate approval of sending rapid response troops to fight the resurgence of armed banditry in Zamfara State.\nThe Governor maintained that his administration will continue to give all necessary assistance in terms of logistics and support to the Nigerian Army and all security agencies in the state in order to achieve success in the fight against criminality.\nThe Governor also called for effective collaboration between the local vigilante Groups, Armed forces and other security agencies to achieve lasting peace.\nEarlier, Major General Uwem Bassey said they were at the Government House to inform the Governor on his assumption as the new GOC, 8 Division Nigerian Army Sokoto.\nHe Commended the Governor for his efforts in the area of security and assured that he will continue to support the Government security wise to contain insecurity in all the state."
  },
  {
    "headline": "COVID-19: Ekiti commences second phase of vaccination exercise",
    "summarized_story": "The Ekiti State Government has disclosed that the second phase of COVID-19 vaccination has commenced across the state, urging residents, especially those that have not been vaccinated during the first phase of the exercise, to make themselves available.\nThe Ekiti Commissioner for Health and Human Services, Dr. Oyebanji Filani made this known in Ado-Ekiti recently while featuring on a radio programme to sensitize the residents on the need to make themselves available for immunization against the deadly virus.\nDr. Filani explained that the Moderna vaccines are for eligible residents that haven’t received any jab of COVID-19 vaccination, stressing that anyone who has received the first dose of Astra-Zeneca vaccines should wait for the second dose that would arrive soon.\n29,205 people received COVID-19 vaccination in first phase – Adamawa govtThe Commissioner, who allayed the fear of the people on the groundless rumor that the vaccine has negative effects, reiterated the commitment of the state government to ensure that all residents have unfettered access to the safe and effective vaccines.\nHe advised residents of the state to take advantage of the government’s gesture and get vaccinated, stressing that getting immunized remains the most effective way to curtail the virus."
  },
  {
    "headline": "#EndSARS: NEC gets panels’ reports from eight states",
    "summarized_story": "All the 28 states that established judicial panels of enquiry on last year’s #EndSARS protests have completed their assignment, except Lagos State, which will conclude its work in October.\nVice-President Yemi Osinbajo announced this on Thursday during the National Economic Council (NEC) virtual meeting, coordinated from the Presidential Villa in Abuja.\nOsinbajo said eight states had submitted their reports, adding that the Council would discuss the reports in full at its next meeting when more states are expected to submit their reports.\nThe statement said the Council got updates on cholera outbreaks, which have led to 1,768 deaths in 23 states and the Federal Capital Territory (FCT).\nAccording to the statement, states with suspected cases of cholera include Benue, Delta, Zafara, Gombe, Kogi, Sokoto, Plateau, Kebbi, Cross River, Niger, Nasarawa, Jigawa, Yobe, Kwara, Enugu, Adamawa, Kastina and Borno."
  },
  {
    "headline": "Why we are not suspending strike, by doctors",
    "summarized_story": "Doctors, under the aegis of the Nigerian Association of Resident Doctors (NARD), have unanimously decided to continue their strike which began on August 2.\nIn a statement on Thursday, NARD President Okhuaihesuyi Uyilawa said: “The NEC noted the nonchalant attitude of appointees of the government to the suffering of Nigerian doctors.\n“The NEC painfully observed that issues bedeviling most of our state tertiary health institutions are left unattended to, despite the ongoing strike.\nADVERTISEMENT“The NEC noted that 114 House Officers are yet to be paid their one to six months’ salaries.\n“The NEC reiterated its displeasure over the paltry N5,000 Hazard Allowance given to doctors, nurses and other healthcare workers."
  },
  {
    "headline": "IG gets panel report on Kyari",
    "summarized_story": "The report was submitted by SIP Chairman Joseph Egbunike, a Deputy Inspector-General of Police (DIG), at the Force Headquarters in Abuja.\nADVERTISEMENTThe Nation had reported that Abba Kyari was indicted by the FBI during its probe of confessed fraudster Ramon Abbas (aka Hushpuppi).\nHe said the report contained the case file of the probe, evidences and findings as well as testimonies from Abba Kyari and other persons and groups linked to the matter.\nHe explained that the essence of the probe was to carry out discrete investigations into the allegation levied against Abba Kyari to guide the Force leadership in its decision-making processes.\nAccording to him, a careful and expeditious review of the recommendations will be undertaken by the Force Management Team and thereafter forwarded to appropriate quarters for necessary action."
  },
  {
    "headline": "‘Reps seeking power for INEC over council polls’",
    "summarized_story": "This, the committee said, would ensure a secured tenure for elected local government leaders.\nThe youth leaders called for, among others, a secured tenure for elected local government leaders, financial autonomy for local government and independence of the local government administration.\nThe Deputy Speaker advised the youth leaders to begin the advocacy for a functional local government system to all states.\nHe assured them that President Muhammadu Buhari was determined to leave behind a functional local government in the country.\n“You are adding the secured tenure of the local government now."
  },
  {
    "headline": "Zulum’s passion to end insecurity inspiring, say APC governors",
    "summarized_story": "Governors elected on the platform of the ruling All Progressives Congress (APC) – the Progressive Governors’ Forum (PGF) – have congratulated their Borno State counterpart, Prof. Babagaba Umara Zulum, on Thursday’s celebration of his 52nd birthday and for giving his people and Nigeria effective style of governance.\nThey said Zulum’s style of managing governance has been a source of inspiration to his fellow governors.\nADVERTISEMENT“We celebrate this special occasion with Your Excellency, your entire family, and the people of Borno State.\n“We wish to acknowledge and commend your exemplary leadership, vision, and commitment to a united and peaceful Nigeria.\n“Your insightful and resolute passion to mobilise Nigerians towards ending insecurity and managing processes of governance is a source of inspiration."
  },
  {
    "headline": "No land for ranching in Ebonyi, Umahi, Ohanaeze youths insist",
    "summarized_story": "From Magnus Eze and Chijioke Agwu, AbakalikiChairman of South East Governors’ Forum and Governor of Ebonyi State, Chief David Umahi, has insisted that the state does not have and would not yield any piece of its land for RUGA, ranching or whatever name it is called.\nHe also denied that his state has received N6billion from the Federal Government for the development of ranching in the area.\nReacting to a statement by Malam Garba Shehu, media aide to President Muhammadu Buhari who said on a television programme that four states including Ebonyi had received N24 billion grant for ranching, the Ebonyi State Government noted that it had been inundated with inquiries for clarification.\n“That should any Ebonyian opt to engage in personal ranching, Ebonyians should see such venture as a personal decision of such person who must use his/her land for the purpose.\n“We don’t want to lose more innocent lives in Igbo land."
  },
  {
    "headline": "More trouble for PDP as court restores Secondus as national chairman",
    "summarized_story": "The crisis in the Peoples Democratic Party (PDP) is far from over as Justice Nusirat.\nI. Umar, vacation Judge of the Kebbi State High Court, yesterday, ordered Prince Uche Secondus to return to his position as the National Chairman.\nThis came just as party accepted the Deputy National Chairman (South), Yemi Akinwonmi, as acting national chairman.\nAkinwonmi and the Deputy National Chairman (North), Suleiman Nazif, had clashed on Tuesday over who is in charge following an order by a Rivers State High Court, that restrained Uche Secondus from functioning as national chairman.\nThe acting chairman reaffirmed that the PDP national convention to elect new NWC members would hold in October."
  },
  {
    "headline": "Hushpuppi: Investigation panel submits report to IGP",
    "summarized_story": "From Molly Kilete, AbujaThe Special Investigation Panel (SIP) set up by the Inspector-General of Police (IGP), Usman Alkali Baba, to investigate the former commander of the Intelligence Response Team (IRT), DCP Abba Kyari, on his indictment by the Federal Bureau of Investigation (FBI) has submitted its report.\nForce Public Relations Officer, Frank Mba, who made the disclosure, said the chairman of the SIP, Deputy Inspector General of Police (DIG), Joseph Egbunike, presented the report to the IGP, at the Force Headquarters, Abuja.\nEgbunike, while presenting the report, told the IGP that it contained the case file of the probe, evidence and findings as well as testimonies from DCP Abba Kyari and other persons and groups linked to the matter.\nHe assured that a careful and expeditious review of the recommendations will be undertaken by the Force Management Team and, thereafter, forwarded to appropriate quarters for necessary action(s).\nHe reiterated the commitment of the Force to justice for all."
  },
  {
    "headline": "NARD demands intervention of national council on health",
    "summarized_story": "From Fred Ezeh, AbujaThe National Associati on of Resident Doctors (NARD) has demanded that the emergency meeting of members of National Council on Health (NCH) be called to deliberate on the contentious areas.\nThe doctors said they observed the insincerity of the government in proffering a permanent solution to the prolonged industrial action which has resulted in prolonged disruption of medical services in the public health sector.\nNARD President, Uyilawa Okhuaihesuya, in a statement, said the National Executive Council (NEC) of NARD at its meeting at the University of Benin Teaching Hospital (UBTH), resolved to continue the nationwide strike until their demands are met.\nHe said NEC observed that despite the strike that has been on for 24 days, his members in GIFMIS payment platform in 22 centres were yet to be migrated and captured in IPPIS platform with payment of outstanding backlog of three to four months.\nHe said the NEC observed that despite the instructions by President Muhammadu Buhari that Minister of Health, Dr. Osagie Ehanire, should step aside all technicalities in resolving the issues of dispute, no action had been taken."
  },
  {
    "headline": "Abia at 30: Kalu advocates inclusive leadership",
    "summarized_story": "Former governor of Abia State and Chief Whip of the Senate, Dr. Orji Uzor Kalu has congratulated the people of Abia on the 30th anniversary of the creation of the state.\nAccording to Kalu, Abians must shun political differences in order to work harmoniously for the sake of building a prosperous state.\nKalu in a goodwill message, re-affirmed his commitment as a politician, businessman and philanthropist in promoting credible leadership in all facets of life.\n“As we mark the 30th anniversary of the creation of Abia State, it is imperative for the political class to unite in order to make Abia State great.\nThe political classic must provide genuine leadership in a bid to ameliorate the suffering of the people."
  },
  {
    "headline": "Breaking: Abducted Pupils of Niger Islamiyya School Released",
    "summarized_story": "By Laleye Dipo in MinnaThe pupils of the Salihu Tanko Islamiyya School Tegina in the Rafi local government area of Niger state abducted since May 30 this year have regained their freedom THISDAY learnt that the girls were dumped around Birnin- Gwari town in Kaduna state at about 7.30pm Thursday.\nIt was learnt that the remaining 130 pupils were released after six of them reportedly died of cold, malnutrition and fever.\nThe source told THISDAY that the children were on their way to Minna and would be received by Governor Abubakar Sani Bello on Friday after their profiling.\nA top politician from Rafi local government area who has been monitoring the development as it concern the pupils since they were abducted told THISDAY that ” they ( Pupils) are intact.\nAnother top official told THISDAY that the pupils were approaching Tegina now."
  },
  {
    "headline": "Kebbi Court Restores Secondus as PDP National Chairman",
    "summarized_story": "By Nseobong Okon-EkongThe crisis in the Peoples Democratic Party (PDP) became more intricate as Justice Nusirat.\nI. Umar, a vacation Judge of the Kebbi state High Court on Thursday restored the embattled National Chairman of the party, Prince Uche Secondus to his position.\nThe Deputy National Chairman (South) of the Party, Elder Yemi Akinwomi had assumed leadership of the PDP in acting capacity, following a restraining order on Secondus by a Court in Port Harcourt.\nAkinwomi immediately suspended the scheduled National Working Committee, NWC, meeting of the party till further notice.\n”Three concerned members of the party, Yahaya Usman, Abubakar Mohammed and Bashar Suleman are the claimants/applicant in the case while Prince Secondus and the PDP are the defendants/respondents."
  },
  {
    "headline": "No Record of PMS Consumed Daily, PPPRA Tells House",
    "summarized_story": "Udora Orizu in AbujaThe Petroleum Product Pricing and Regulatory Agency (PPPRA) on Thursday told the House of Representatives Committee on Finance that there were no records of the volume of Premium Motor Spirit (PMS) consumed daily in the country.\nHe said that the issue of smuggling had ⁰pmade it difficult to determine the volume of PMS consumed in the country daily, hence the inclusion of the Nigeria Customs Service in the committee.\nJames Faleke said PPPRA was important to determining the volume of PMS consumed in the country on a daily as well as revenue from that.\nHe said the only records of volume NNPC has is what leaves their depot.\nThey records NNPC presented to us was gotten from PPPRA."
  },
  {
    "headline": "Nigeria’s GDP Grows 5.01% in Q2",
    "summarized_story": "By James EmejoNigeria’s Gross Domestic Product (GDP) grew to 5.01 per cent (year-on-year) in real terms in the second quarter of the year (Q2 2021), compared to 0.51 per cent in the preceding quarter.\nThis marks three consecutive quarters of growth following the negative growth rates recorded in the second and third quarters of 2020, the NBS noted.\nThe statistical agency pointed out that the Q2 growth rate was also higher than the 0.51 per cent recorded in Q1 2021 year on year, indicating the return of business and economic activity near levels seen prior to the nationwide implementation of COVID-19 related restrictions.\nAccording to the GDP estimated for Q2, released Thursday, the “steady recovery observed since the end of 2020, with the gradual return of commercial activity as well as local and international travel, accounted for the significant increase in growth performance relative to the second quarter of 2020 when nationwide restrictions took effect.”Year to date, real GDP grew 2.70 per cent in 2021 compared to -2.18 per cent for the first half of 2020, the NBS added.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari: NDA Attack Will Accelerate Total Uprooting of Evil in Polity",
    "summarized_story": "The Defence Headquarters has ordered an intensive probe of the audacious invasion of the strategic military training institution.\nBut he urged those playing hateful politics with the base assault on the military academy to desist from such.\nThey called for forensic investigation into the circumstances that enabled the invasion of the NDA and subsequent killing and abduction of officers.\n“Military officers, like other security personnel, are entitled to carry out their duties in relative safety and security.\nHe stated, “Igbo youths condemn in its entirety the invasion of NDA, Afaka, where two army officers were shot dead and another abducted."
  },
  {
    "headline": "BREAKING: Bandits Release Tegina School Pupils In Niger State After Three Months",
    "summarized_story": "Gun-wielding bandits have finally released students abducted three months ago from an Islamic school in north-central Nigerian state of Niger, two parents told Reuters on Thursday.\nAround 136 school children were taken from the school in Tegina town in May but on Monday the school's owner said that six had died of illness.\nOne parent, Mallam Saidu Tegina, said by phone the students had been released.\nHe did not confirm how many students were released.\nAbubakar Garba Alhasan, whose seven children are held by the gang, said the students were on their way to the capital city in Minna."
  },
  {
    "headline": "BREAKING: Bandits Release Tegina School Pupils In Niger State After Three Months",
    "summarized_story": "Gun-wielding bandits have finally released students abducted three months ago from an Islamic school in north-central Nigerian state of Niger, two parents told Reuters on Thursday.\nAround 136 school children were taken from the school in Tegina town in May but on Monday the school's owner said that six had died of illness.\nOne parent, Mallam Saidu Tegina, said by phone the students had been released.\nHe did not confirm how many students were released.\nAbubakar Garba Alhasan, whose seven children are held by the gang, said the students were on their way to the capital city in Minna."
  },
  {
    "headline": "2023: Ailing Tinubu Receives Two Governors In London On Solidarity Visit",
    "summarized_story": "SaharaReporters had reported that the APC leader underwent two surgeries within a month.\nThe duo were captured in a trending picture on Wednesday with Tinubu in London on a purported solidarity visit.\nAsides Fayemi and Akeredolu, Lagos State Governor, Babajide Sanwo-Olu, Tinubu’s godson, had first visited the APC National Leader in July.\nPresident Muhammadu Buhari also made a surprise visit to Tinubu in London where the former governor was seen leaning on a walking stick.\nThe APC National Leader has been off official and party functions in the country for a while, amidst talks that he is being positioned for the 2023 presidency to succeed the incumbent repressive regime of Buhari."
  },
  {
    "headline": "2023: Ailing Tinubu Receives Two Governors In London On Solidarity Visit",
    "summarized_story": "SaharaReporters had reported that the APC leader underwent two surgeries within a month.\nThe duo were captured in a trending picture on Wednesday with Tinubu in London on a purported solidarity visit.\nAsides Fayemi and Akeredolu, Lagos State Governor, Babajide Sanwo-Olu, Tinubu’s godson, had first visited the APC National Leader in July.\nPresident Muhammadu Buhari also made a surprise visit to Tinubu in London where the former governor was seen leaning on a walking stick.\nThe APC National Leader has been off official and party functions in the country for a while, amidst talks that he is being positioned for the 2023 presidency to succeed the incumbent repressive regime of Buhari."
  },
  {
    "headline": "Family Alleges Foul Play In Nigerian Pastor's Death As Wife Plots To Flee Country Before Burial",
    "summarized_story": "The family of Apostle Joseph Dominic Agboli, the founder of The Victorious Army Ministries International, Acme Road, Ogba, Lagos State, has alleged a foul play in the death of the cleric.\nHowever, a top source in the Pastor’s family alleged that his wife might have been the source of his death adding that she had hatched a plot to flee from Nigeria before the burial.\nThe source claims the pastor's wife, Blessing, had a boyfriend she had been seeing and already purchased a house in Canada where she planned to move to with her children.\nShe was also said to have received donations from well-wishers to the tune of N17million to fly Agboli abroad despite his demise.\nAll the reliable and loyal people around him, she chased them away with her attitude, including Baba Agboli’s family."
  },
  {
    "headline": "Niger pupils regain freedom -- after 16 weeks in captivity",
    "summarized_story": "More than two months after pupils of Salihu Tanko Islamiyya School in Tegina town, Raffi LGA of Niger state, were kidnapped, those still in captivity have regained their freedom.\nHundreds of pupils and students were kidnapped from the school on May 30, when bandits attacked the community.\nAdvertisementThe development comes days after six of the children died were said to have died in captivity.\nAlhassan said the bandits disclosed that the children died after falling ill, adding that the kidnappers insisted that ransom be paid for the release of the children still in captivity.\nBut Ahmed Ketso, Niger deputy governor, had said the government had begun negotiations with abductors of the kidnapped children."
  },
  {
    "headline": "Niger pupils regain freedom -- after 16 weeks in captivity",
    "summarized_story": "More than two months after pupils of Salihu Tanko Islamiyya School in Tegina town, Raffi LGA of Niger state, were kidnapped, those still in captivity have regained their freedom.\nHundreds of pupils and students were kidnapped from the school on May 30, when bandits attacked the community.\nAdvertisementThe development comes days after six of the children died were said to have died in captivity.\nAlhassan said the bandits disclosed that the children died after falling ill, adding that the kidnappers insisted that ransom be paid for the release of the children still in captivity.\nBut Ahmed Ketso, Niger deputy governor, had said the government had begun negotiations with abductors of the kidnapped children."
  },
  {
    "headline": "Osinbajo: Nigeria will be a great loser if we break up... our destiny inseparable",
    "summarized_story": "Vice-President Yemi Osinbajo says there are “more opportunities for prosperity” if Nigeria remains an indivisible entity.\nThe vice-president noted that the categorisation of citizens into indigenes and non-indigenes is a form of apartheid.\n“All Nigerians have a constitutional right to live, work and enjoy their lives in peace and safety under the law.\nThe classification of Nigerians as “indigenes” and “non-indigenes” is a form of apartheid and contradicts our declared aspirations towards equality and unity,” Osinbajo said.\n“Nigeria will be a great loser if we were to break up; when we see the greatest economic advantage to our size about to come to life."
  },
  {
    "headline": "Osinbajo: Nigeria will be a great loser if we break up... our destiny inseparable",
    "summarized_story": "Vice-President Yemi Osinbajo says there are “more opportunities for prosperity” if Nigeria remains an indivisible entity.\nThe vice-president noted that the categorisation of citizens into indigenes and non-indigenes is a form of apartheid.\n“All Nigerians have a constitutional right to live, work and enjoy their lives in peace and safety under the law.\nThe classification of Nigerians as “indigenes” and “non-indigenes” is a form of apartheid and contradicts our declared aspirations towards equality and unity,” Osinbajo said.\n“Nigeria will be a great loser if we were to break up; when we see the greatest economic advantage to our size about to come to life."
  },
  {
    "headline": "Court temporarily restores Secondus as PDP national chairman",
    "summarized_story": "A Kebbi state high court has ordered the return of Uche Secondus as national chairman of the Peoples Democratic Party (PDP).\nUmar gave an order of interim injunction “staying the purported suspension of the first respondent pending the determination of the substantive motion on notice No.\nKB/HC/M.170/2021 now pending before this honourable court”.\nOn Monday, a high court in Rivers state granted an interim order restraining Uche Secondus from parading himself as the national chairman of the party.\nAdvertisementMeanwhile, following the order, Yemi Akinwonmi, deputy national chairman (south) of the PDP, has been named as the acting chairman of the party."
  },
  {
    "headline": "Nigerian fintech apps users confident despite regulatory crackdown",
    "summarized_story": "The crackdown by the apex bank could result in severe unintended casualties for the companies; but above all, it puts at risk what is arguably their most valuable asset — customers’ trust.\nAnd in Nigeria, where more than 80 million citizens live below the poverty line, trust is even more paramount.\nAnd the fintech platforms affected by CBN’s move — Trove, Risevest, Bamboo, and Chaka — know this.\nSo I was already calm knowing that my money was safe,” Motunrayo Koyejo, a software engineer and Rise Vest user, told TechCabal.\nI mean Nigerian startups almost always have a way of figuring things out.”Another Cowrywise user, Mosopefoluwa Okeowo, told TechCabal she thinks fintech startups will always find a solution."
  },
  {
    "headline": "MaxAB extends Series A to $55M, largest ever by an Egyptian startup",
    "summarized_story": "MaxAB, an Egyptian eCommerce platform that serves food and grocery retailers, has raised an additional $15M from existing investors bringing its total Series A funding to $55M, the largest ever by an Egyptian startup.\nIn addition, it announced its acquisition of WaystoCap, a Morocco-based e-commerce and distribution platform that connects retailers with suppliers across Africa.\nTwo years later, the company got into the 2017 Y Combinator’s Winter batch, making it the first company accepted from Morocco.\nWaystoCap expanded its cross-border services to Ivory Coast and Togo, and at some point, was processing over $3 million worth of transactions per quarter.\nThe acquisition will see MaxAB accelerate its expansion into the Maghreb market – Algeria, Libya, Mauritania, Morocco and Tunisia – empowered by WaystoCap’s expertise in the region."
  },
  {
    "headline": "Ethiopia is building local competitors to Facebook, WhatsApp, Twitter and Zoom",
    "summarized_story": "Ethiopia has begun developing its own social media platforms to rival Facebook, Twitter, WhatsApp and Zoom, as per Reuters.\nIn a local media outlet on Friday, Shumete accused Facebook of blocking users who were “preaching national unity and peace”.\nSupporters of the different sides have taken the conversation over to social media.\nTo build these platforms, Ethiopia is relying solely on local expertise.\nThis begs the question of whether investing in state-owned social network platforms should be on its list of priorities."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "On the heels of $40 million Series A in July — one of the largest fundings in the Middle East and North Africa (MENA)..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Nigeria economy yet to heal after highest GDP growth since 2014",
    "summarized_story": "Nigeria economy yet to heal after highest GDP growth since 2014Nigeria’s economy expanded at the fastest pace since 2014 in the second quarter of 2021, but does not count for much given the economy has only profited from the easing of COVID-19 restrictions that curbed economic activity last year.\nFailure to implement long standing reforms that would open the economy to more private capital while…"
  },
  {
    "headline": "NNPC attributes N287bn profit to cost control, automating process",
    "summarized_story": "Mele Kyari, the group managing director of the Nigerian National Petroleum Corporation (NNPC) has said that cost cutting measures and automating its processes were key reasons why it could declare its first profit in 44 years.\nIn a press conference, Thursday night, Kyari said there were drastic changes to the way NNPC does business including…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Buhari appoints new Statistician-General of the Federation",
    "summarized_story": "President Muhammadu Buhari on Thursday approved the appointment of Simon B. Harry as the new statistician-general of the Federation to head the National Bureau of Statistics (NBS).\nThis is contained in a mailed statement from the Ministry of Finance, Budget and National Planning.\nHarry is to succeed the out-going statistician-general, Yemi Kale, whose second term tenure of five years expired on August 16, 2021.\nHarry is currently the director of, Corporate Planning and Technical Coordination Department of NBS with almost three decades of statistical experience.\nHe joined the erstwhile Federal Office of Statistics as statistician 11 in 1992 and rose to the position of a substantive director of statistics in 2019."
  },
  {
    "headline": "Obaseki lauds Nigeria Immigration Service’s contribution to fight against human trafficking, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has commended the doggedness of the Nigeria Immigration Service (NIS) in the fight against human trafficking, irregular migration and banditry across the nation.\nObaseki gave the commendation while receiving the outgoing Controller of the Nigeria Immigration Service (NIS), Edo State Command, Augustina Adesola Okueyungbo, who was on a courtesy visit at the Government House in Benin City.\nThe governor also commended the outgoing controller for her dedication, commitment and diligence to the service of the state and the country.\nAccording to him, “You are proactive in your assignment and I commend you for the way you manage and handle immigration issues in Edo State.\nWe recognize all the efforts you have put in place in the fight against irregular migration, human trafficking and banditry."
  },
  {
    "headline": "Obaseki, BOI unveil N2bn MSME fund, target over 50,000 businesses – Nigerian Observer",
    "summarized_story": "The initial amount is N2 billion; we are making available N2 billion for MSMEs in Edo State.\n“In addition, we have a N165million fund, as part of the first tranche from the Edo State Government.\n“From this N2 billion fund, we estimate that we can impact as many as 50,000 businesses in Edo State.\n“The MSME fund is aimed at providing business loans to enterprises located within the state, while the second fund is the N165m Edo Production Hub Fund, financed by the Edo State Government.\nThe team also commissioned the new Bank of Industry Building in Benin City, the Edo State capital."
  },
  {
    "headline": "Residents express hope, optimism as Edo celebrates 30th anniversary tomorrow – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo residents are in a jubilant mood as the state, tomorrow, Friday, August 27, 2021, celebrates the 30th anniversary of the state’s creation after the split of old Bendel State into Edo and Delta states, in 1991.\nThe ceremony, which was significantly scaled down in line with the state’s COVID-19 regulations, will also feature an online celebration by Edo people in Diaspora on Saturday, August 28, 2021.\nA cross section of elated residents, who spoke with journalists in Benin City, noted that the 30th anniversary is a celebration of hope for a better Edo, where all citizens’ lives and security are guaranteed, with assurances for the realization of their fullest potentials.\nIt is my sincere hope that the 30th-anniversary celebration would usher in even more progress, greater prosperity and endearing fulfillment for all our people.”Another resident, Aisosa Igbinovia noted: “The 30th anniversary of Edo State is a worthwhile celebration, considering the much that we have achieved in a short while.\nThough we are yet to get to our desired destination, I want to encourage all Edo people to be hopeful of a better future for the Edo Nation."
  },
  {
    "headline": "COVID-19 3rd wave: Seven unvaccinated persons die, infections rising, as Edo opens more points for vaccination – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State is witnessing a sharp rise in the number of COVID-19-related deaths and infections, with unvaccinated persons accounting for 100 percent of fatalities recorded in the state.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the state governor, Mr. Godwin Obaseki.\nAccording to him, “Edo State, in the last 24 hours, recorded two more COVID-19-related deaths, bringing the total number of deaths recorded in the third wave of the pandemic to 7.\n“While 100 percent of the deaths recorded in the state are unvaccinated persons, 96 percent of infections in the state are people who were never vaccinated against the deadly virus.\nThe vaccines are safe, free and effective,” the Incident Manager noted."
  },
  {
    "headline": "136 Niger school pupils freed 86 days after abduction",
    "summarized_story": "ADVERTISEMENTThe 136 abducted pupils of Salihu Tanko Islamiyya School, Tegina in Rafi Local Government Area of Niger State, have been released.\nThey were released on Thursday night in Birnin Gwari LGA of Kaduna State after 86 days in captivity.\nBirnin Gwari shares boundary with Rafi local government area of Niger State where the children were abducted.\nThe children are currently being conveyed from Birnin Gwari to Minna, Niger State capital where they will be reunited with their families on Friday.\nOfficialsin Niger State are yet to comment on the development as of the time of this report."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Nigeria’s economy records 5% growth in Q2 2021",
    "summarized_story": "The NBS disclosed this in the latest report on the nation’s GDP entitled Nigerian Gross Domestic Product Report (Q2 2021) released on Thursday.\n“The Q2 2021 growth rate was higher than the -6.10% growth rate recorded in Q2 2020 and the 0.51% recorded in Q1 2021 year-on-year, indicating the return of business and economic activity near levels seen prior to the nationwide implementation of COVID-19 related restrictions,” the report read.\n“The Q2 2021 nominal growth rate was also higher than 12.25% growth recorded in Q1 2021,” the agency said.\n“Quarter-on-quarter, the oil sector recorded a growth rate of -20.35% in Q2 2021.\nIt added, “The non-oil sector grew by 6.74% in real terms during the reference quarter (Q2 2021)."
  },
  {
    "headline": "PSG face Man City, Liverpool play A. Madrid in Champions League [Full draw]",
    "summarized_story": "French top side, Paris St-Germain (PSG), will face Premier League champions Manchester City in the 2021/2022 European Champions League season, in a group that also includes RB Leipzig and Club Bruges.\nDefending champions Chelsea will come up against Serie A giants Juventus, Russian club Zenit St Petersburg and Swedish side Malmo.\nManchester United face Villarreal, who beat them in last season’s Europa League final, as well as Italian club Atalanta and Swiss side Young Boys.\nLiverpool are in a tough group with Atletico Madrid, Porto and AC Milan.\nThis year’s Champions League final takes place at the St Petersburg Stadium in Russia on Saturday, 28 May."
  },
  {
    "headline": "Court restores Secondus as PDP National Chairman",
    "summarized_story": "OBINNA EZUGWUA High Court sitting in Kebbi State on Thursday, ordered Prince Uche Secondus to return to his position as the National Chairman of the People’s Democratic Party (PDP).\nI. Umar a vacation Judge of the Kebbi High Court who gave the order in a suit brought before her in Birinin Kebbi, the state capital in case KB/AC/M.\n170/2021, said she was satisfied after reading the affavidit of the respondents that an interim order should be granted on the purported suspension of Prince Secondus pending the determination of the case.\n“An order of this Honourable court granting leave to the first respondent (Uche Secondus) to continue exercising all the constitutional powers of the office of Chairman of PDP (second defendant ) as enshrined in both 1999 Constitution of Nigeria as amended and the Peoples Democratic Party’s constitution pending the hearing and final determination of applicant’s motion on notice,” she said.\nThree concerned members of the party, Yahaya Usman , Abubakar Mohammed and Bashar Suleman are the claimants/Applicant in the case while Prince Secondus and the PDP are the defendants/Respondents"
  },
  {
    "headline": "BEDC inaugurates new projects, meters 40,000 customers under NMMP",
    "summarized_story": "BEDC Electricity Plc (BEDC) has said it inaugurated several projects to improve power availability to customers in its franchise despite the disruption caused by the Covid 19 pandemic.\nThe company also said it has metered about 40,000 customers under the National Mass Metering Programme (NMMP) of the Federal Government as at July 31, 2021.\nMrs. Osibodu said BEDC also commissioned the 7.5MVA, 33/11KV injection substation to serve the Delta Development and Property Agency (DDPA) and Ugborokoko communities in Warri.\n“BEDC has taken delivery of 54,198 out of the 75,870 meters for distribution to customers under the NMMP Phase 0 level while we have completed the installation of nearly 40,000 meters across the four states that we cover as at July ending.\nBEDC is installing meters on poles to reduce the incidence of bypass and other forms of energy theft which is prevalent in the network”, she said."
  },
  {
    "headline": "Secondus kicked out as, PDP BoT ratifies Akinwonmi as acting National Chair",
    "summarized_story": "The Board of Trustees of the Peoples Democratic Party, on Thursday ratified the party’s Deputy National Chairman (South), Yemi Akinwonmi as the Acting National Chairman of the party in line with the party’s constitution.\nChairman of the BoT, Senator Walid Jibrin announced this decision after an emergency meeting of the Board, in Abuja.\nHe said, “Since our last meeting, there have been several meeting by stakeholders to ensure sanity returns to the party.\n“The BoT approved Elder Yemi Akinwonmi as acting National Chairman.\n“Was pleased with the resolution of leadership squabble in the NWC which signals return of unity to the party."
  },
  {
    "headline": "Secondus kicked out as, PDP BoT ratifies Akinwonmi as acting National Chair",
    "summarized_story": "The Board of Trustees of the Peoples Democratic Party, on Thursday ratified the party’s Deputy National Chairman (South), Yemi Akinwonmi as the Acting National Chairman of the party in line with the party’s constitution.\nChairman of the BoT, Senator Walid Jibrin announced this decision after an emergency meeting of the Board, in Abuja.\nHe said, “Since our last meeting, there have been several meeting by stakeholders to ensure sanity returns to the party.\n“The BoT approved Elder Yemi Akinwonmi as acting National Chairman.\n“Was pleased with the resolution of leadership squabble in the NWC which signals return of unity to the party."
  },
  {
    "headline": "Pentagon says US troops killed in Kabul airport bomb attack",
    "summarized_story": "Several US troops were killed in the bomb attack at Kabul airport Thursday, and more were wounded, the Pentagon said in a statement.\n“We can confirm that a number of US service members were killed in today’s complex attack on Kabul airport,” said spokesman John Kirby.\nAhead of the attack US and other coalition partners warned they had intelligence that the Afghan arm of the Islamic State group, the Islamic State-Khorasan, was planning suicide bomb attacks on the airport.\nThey were the first US service members to be killed in Afghanistan since Washington signed an agreement with the Taliban in February 2020 to withdraw from the country.\nIn exchange for a commitment to pull out, the Taliban agreed to not carry out attacks on US or NATO troops."
  },
  {
    "headline": "Pentagon says US troops killed in Kabul airport bomb attack",
    "summarized_story": "Several US troops were killed in the bomb attack at Kabul airport Thursday, and more were wounded, the Pentagon said in a statement.\n“We can confirm that a number of US service members were killed in today’s complex attack on Kabul airport,” said spokesman John Kirby.\nAhead of the attack US and other coalition partners warned they had intelligence that the Afghan arm of the Islamic State group, the Islamic State-Khorasan, was planning suicide bomb attacks on the airport.\nThey were the first US service members to be killed in Afghanistan since Washington signed an agreement with the Taliban in February 2020 to withdraw from the country.\nIn exchange for a commitment to pull out, the Taliban agreed to not carry out attacks on US or NATO troops."
  },
  {
    "headline": "Night of tributes for late Mohammed Fawehinmi (Photos)",
    "summarized_story": "In honour of the memory of the late Barrister Mohammed Babatunde Fawehinmi, nicknamed the people’s general, a night of tribute was held at the Archbishop Vining Memorial Cathedral, Ikeja Lagos on Wednesday.\nThe deceased’ siblings, friends, activists, old schoolmates, and colleagues in the law profession packed the venue to pay their last respect, with glowing remarks from all that were given the chance to speak on their encounter with the deceased.\nAccording to most speakers at the event, he was a man who always supports anyone that asks him for help despite his physical condition, and could travel no matter the distance to celebrate with close friends and Associates."
  },
  {
    "headline": "Abiodun: Our biggest security challenges in Ogun",
    "summarized_story": "Governor Dapo Abiodun of Ogun, has listed kidnapping and cultism as the biggest security challenges confronting Ogun state.\n“The biggest issues we have today in Ogun State are that of random kidnapping and cult activities.\n“I believe that the cult activities have abated now because of the joint efforts of the Nigeria Police, the State Security Services and the Nigerian Army.\n“However, we are still struggling and dealing with issues that relate to kidnapping of contractors, farmers and innocent Ogun State residents.\nThis, according to him, is to ensure that adequate security is provided for companies, industries and individuals operating along the axis."
  },
  {
    "headline": "BREAKING: Bandits Release Islamic Students Kidnapped In Niger After Three Months",
    "summarized_story": "More than 70 Islamiyya schoolchildren kidnapped in Niger State’s Tegina hamlet have been released.\nLate in May, a big group of bandits raided the village and kidnapped the students.\nA security agent told PRNigeria Thursday night that the ex-captives are on their way to Minna from Birnin Gwari.\nThe Salihu Tanko Islamiyya school was built by a retired Immigration officer.\nIn February, bandits abducted some staff and students of Government Science College, Kagara in Niger."
  },
  {
    "headline": "BREAKING: Abducted Zamfara Agric Students, Teachers Regain Freedom",
    "summarized_story": "The abducted Zamfara State College of Agriculture and Animal Science, Bakura, instructors and students have been released.\nA very competent source close to the state government who begged for anonymity informed The PUNCH that they would be brought to Government House on Friday [tomorrow].\nHe, however, declined further comments.\nIt could be recalled that on the 16th August, 2021 suspected bandits attacked the college and abducted 19 persons consisting three staff, 15 students and a driver."
  },
  {
    "headline": "Primate Ayodele Prophecies, Says Libya, Iran, Iraq, Afghanistan Will Launch Attack Worse Than 9/11 On United States",
    "summarized_story": "Primate Elijah Ayodele, the leader of INRI Evangelical Spiritual Church, has issued a powerful prophecy concerning the United States.\nPrimate Ayodele revealed that he foresees a serious attack on US soil which will be deadlier than that of the popular September 11.\n“I foresee a very serious attack on the United States of America, I don’t know when but they should expect it.\n“I see them coming from Libya, Iran, Iraq, Afghanistan, they will form a very terrible terrorist coalition to set America on fire.\nLet them consult God, fortify their security system and support other countries in eradicating terrorism, this is the only way these attacks I see won’t happen,” Primate Ayodele said."
  },
  {
    "headline": "Jos Killings: Governor Okowa Orders Evacuation Of Delta Students",
    "summarized_story": "Following further deaths in Plateau State, Delta State Governor Ifeanyi Okowa ordered the immediate evacuation of Delta students from Jos on Thursday.\nHe commended Okowa for his prompt approval of the evacuation, stressing that the lives of students of Delta origin were of great concern to the state.\nAccording to him, the state government has dispatched three buses with police escort to bring back Delta students from the troubled zone.\nMakinde orders evacuation of Oyo students from UNIJOS“When we heard about the incident in Jos, I wrote to the governor, informing him of the need to evacuate our students from the crisis zone.\nOkowa has demonstrated his love for Delta students by ensuring that their safety is topmost priority to the state government."
  },
  {
    "headline": "Breaking: 3 months after, kidnapped Tegina Islamic school children regain freedom",
    "summarized_story": "After nearly three months in captivity, 130 kidnapped pupils from Islamic school in Tegina, Niger state have been released by their abductors.\nThe secretary to the state government Ibrahim Ahmed Matane who confirmed the latest development said the children are being transported to Minna the state capital.\nThe Islamiya pupils were held for 88 days and 11 hours according to the timeline of the days and time they have spent in the bandits’ captivity.\nWhile the Tegina students have now regained their freedom, the abducted students of Yauri Federal Government College (FGC) have been in captivity for 70 days, and the remaining abducted students of a Baptist School in Kaduna will be spending their 52 days in captivity.\nDetails loading…"
  },
  {
    "headline": "Taliban bomb Kabul airport, Americans, others feared dead",
    "summarized_story": "An explosion went off on Thursday outside the Kabul airport, where thousands of people have gathered to try to flee the country on a Western airlift since the Taliban seized power earlier this month.\nEarlier today, the United States says as many as 1,500 Americans may be awaiting evacuation from Afghanistan amid growing warnings Thursday of terrorists threat targeting the Kabul airport as President Joe Biden’s deadline for withdrawing troops fast approaches.\nUK ministers had warned this morning that there was ‘very credible reporting’ of an ‘imminent’ terrorist attack in the area.\nThe Ministry of Defence said it is now ‘working urgently to establish what has happened in Kabul and its impact on the ongoing evacuation effort’.\nThe blast came after Boris Johnson had warned that time is running out to rescue people from Afghanistan ahead of Joe Biden’s exit date."
  },
  {
    "headline": "Pictures: Alhanislam becomes AS Roma Football Acadamy brand ambassador",
    "summarized_story": "Celebrity Influencer and spoken word artists ‘Alhanislam’ has just been signed on as a brand ambassador for the African branch (based in Abuja) of the renowned global football academy – AS Roma international Academy – an offshoot of the AS Roma Football club.\nAS Roma International Academy is recognised throughout the world for the quality of its youth team.\nIt is a high performance, all-year-round football academy, dedicated to all boys and girls aged between 3 and 17.\nAlhanislam who is one of Nigeria’s leading young poets was also recently honoured with an award at the Ooni of Ife’s Royal African Awards.\nA football enthusiast and player herself, Alhanislam will throw her weight behind the academy’s recruitment drive amongst other things."
  },
  {
    "headline": "FMSTI Sensitises Nigerians on Methanol Fuel Technology -NigPilot",
    "summarized_story": "Minister of Science, Technology, and Innovation, Dr. Ogbonnaya Onu has launched the sensitization campaign on Methanol Fuel Technology.\nThe Methanol Fuel Technology policy was developed jointly with The Federal Ministry of Transport, Finance, Petroleum, Agriculture, Power, Environment among others.\nMethanol technology the Minister said is a fuel with lower risk of flammability compared to gasoline and other products.\nThe minister said that with Methanol Fuel Technology, more value will be added to the country’s natural resources.\nMni, said that strategies have been put in place to source for funding to boost the Methanol Fuel Technology value chain."
  },
  {
    "headline": "FMSTI Sensitises Nigerians on Methanol Fuel Technology -NigPilot",
    "summarized_story": "Minister of Science, Technology, and Innovation, Dr. Ogbonnaya Onu has launched the sensitization campaign on Methanol Fuel Technology.\nThe Methanol Fuel Technology policy was developed jointly with The Federal Ministry of Transport, Finance, Petroleum, Agriculture, Power, Environment among others.\nMethanol technology the Minister said is a fuel with lower risk of flammability compared to gasoline and other products.\nThe minister said that with Methanol Fuel Technology, more value will be added to the country’s natural resources.\nMni, said that strategies have been put in place to source for funding to boost the Methanol Fuel Technology value chain."
  },
  {
    "headline": "PDP Crisis: Confusion as two Acting National Chairmen emerge -NigPilot",
    "summarized_story": "Deputy national chairman shall perform the following functions: 1) assist the national chairman in the discharge of his duty .\n3) In a result of resignation, removal, death, incapacitation or absence of the national chairman, a deputy national chairman from the region part of the country where the national chairman originates from shall assume office as the national chairman in acting capacity without prejudice to section 47 (6)of the party Constitution.\n4) in the absence of the National chairman and the deputy national chairman from the region part of the country where the National chairman originates from, the other deputy national chairman shall act as national chairman without prejudice to 47 (6) of this Constitution.\n“We have waited this morning for the deputy national chairman (south), who has been incapacitated, who has not been attending NWC meeting in the last 9 months and I believe there was a communication between the deputy national chairman (south).\nIf the national chairman is not available someone will take over, if the deputy national chairman south is not available, the deputy chairman north will take charge."
  },
  {
    "headline": "PDP Crisis: Confusion as two Acting National Chairmen emerge -NigPilot",
    "summarized_story": "Deputy national chairman shall perform the following functions: 1) assist the national chairman in the discharge of his duty .\n3) In a result of resignation, removal, death, incapacitation or absence of the national chairman, a deputy national chairman from the region part of the country where the national chairman originates from shall assume office as the national chairman in acting capacity without prejudice to section 47 (6)of the party Constitution.\n4) in the absence of the National chairman and the deputy national chairman from the region part of the country where the National chairman originates from, the other deputy national chairman shall act as national chairman without prejudice to 47 (6) of this Constitution.\n“We have waited this morning for the deputy national chairman (south), who has been incapacitated, who has not been attending NWC meeting in the last 9 months and I believe there was a communication between the deputy national chairman (south).\nIf the national chairman is not available someone will take over, if the deputy national chairman south is not available, the deputy chairman north will take charge."
  },
  {
    "headline": "TETFund approves N292.6bn for varsities, others, okays 217 research grants -NigPilot",
    "summarized_story": "At the briefing session, Bogoro also explained that the responsibility of completing the National Library Project in Abuja has been bestowed on TETFund.\nHe said this accounted for the setting up of the National Research Fund which has consistently increased from N3 billion to N8.5 billion in recent times.\n“I have signed the letters of allocation for the research grants that we are issuing out, 217.\nBogoro said TETFund is also providing support to boost research activities in Defence Industries Corporation of Nigeria,DICON, among others, to address the nation’s security challenges.\n“We intend to continue strengthening some in terms of cancer facilities, urology research clinical facilities and heart facilities,” he said."
  },
  {
    "headline": "Hushpuppi: IGP Receives Panel Report On Abba Kyari",
    "summarized_story": "The Inspector-General of Police, Usman Alkali Baba, on Thursday received the report of the panel set up to probe the bribery allegations against the erstwhile Head of the Police Intelligence Response Team (IRT), Abba Kyari.\n“The Inspector-General of Police, Usman Alkali Baba, has received the report of the NPF Special Investigation Panel (SIP) investigating the alleged indictment of the erstwhile Head of the Police Intelligence Response Team (IRT), DCP Abba Kyari by the Federal Bureau of Investigation (FBI),” the statement partly read.\n“DIG Egbunike, while presenting the report, appreciated the IGP for the confidence reposed on him and the members of the Panel to conduct the probe.\nREAD ALSO: Police Commission Sets Up Panel, Awaits Report On Abba Kyari“He further revealed that the report presented contained the case file of the probe, evidence and findings as well as testimonies from DCP Abba Kyari and other persons and groups linked to the matter.\nThree weeks later, the police authorities set up a panel to study in detail the available documents related to Kyari who was indicted by the Federal Bureau of Investigation (FBI)."
  },
  {
    "headline": "Buhari Announces ₦287bn NNPC Profit After Tax For 2020",
    "summarized_story": "President Muhammadu Buhari has announced the declaration of a Profit after Tax (PAT) of N287billion in the year 2020 by the Nigerian National Petroleum Corporation (NNPC).\nAdesina’s statement notes that Buhari has disclosed a Net Profit, making it the first time in the 44-year history of the establishment.\nAccording to the President, who doubles as Minister for Petroleum Resources, “I am pleased to announce the declaration of Profit after Tax of Two Hundred and Eighty-Seven Billion Naira (N287 Billion) in Year 2020 by the Nigerian National Petroleum Corporation.\nThis is sequel to the completion of the statutory Annual Audit exercise for Year 2020.\n“This development is consistent with this administration’s commitment to ensuring prudent management of resources and maximization of value for the Nigerian people from their natural resources."
  },
  {
    "headline": "No Channels Television Anchor Was Arrested",
    "summarized_story": "Contrary to the news on social media that our Sunrise Daily’s anchors have been arrested, this is just to clarify that no such arrest was made.\nBut the entire anchors were invited for a meeting by the National Broadcasting Commission (NBC) in Abuja and they have since returned from that meeting.\nSimilarly, the Department of State Services (DSS) on Thursday clarified that Channels Television’s invited by the secret service in earlier stories on social media are false and misleading.\nDSS spokesman, Peter Afunanya, made the clarification via a statement, warning purveyors of such to stop.\n“The attention of the DSS has been drawn to news making the rounds in some sections of the media that its operatives earlier today (26th August, 2021) arrested two (2) journalists of Channels Television."
  },
  {
    "headline": "10-Year Memorial For Victims Of UN House Bombing In Pictures",
    "summarized_story": "10 years after a car explosion rocked the United Nations House in Abuja killing at least 20 persons and leaving over 60 others injured, family members have gathered for a remembrance ceremony at the nation’s capital.\nWith teary eyes, wreaths were laid in honour of the deceased in front of the UN House on Thursday.\nSee photos below."
  },
  {
    "headline": "Gunmen Free 100 Islamiyya Students Three Months After Abduction",
    "summarized_story": "Gunmen have freed around 100 pupils kidnapped from an Islamic seminary in Niger State nearly three months ago, the school’s head teacher said on Thursday.\nThe head teacher, Abubakar Alhassan, did not, however, say if any ransom was paid.\nBut the bandits this year began targeting schoolchildren and students, demanding more ransom.\nGunmen who kidnapped more than 100 students from a Baptist high school in Kaduna State released 15 more of those hostages after collecting ransom, a representative of the families said on Sunday.\nAround 1,000 students have been kidnapped since December after gunmen started to hit schools."
  },
  {
    "headline": "Breaking: 88 days after, kidnapped Tegina Islamiya Pupils regain freedom",
    "summarized_story": "After 88 days in captivity, over 70 children kidnapped from Islamic school in Tegina, Niger state have been released by their abductors.\nThis was confirmed by secretary to the state government Ibrahim Ahmed Matane who said the children are being transported to Minna the state capital.\nThe Islamiya pupils were held for 88 days and 11 hours according to the timeline of the days and time they have spent in the bandits’ captivity.\nWhile the Tegina students have now regained their freedom, the abducted students of Yauri Federal Government College (FGC) have been in captivity for 70 days and the remaining abducted students of a Baptist School in Kaduna will be spending their 52nd days in captivity."
  },
  {
    "headline": "Huspuppi: IGP receives NPF panel report on DCP Abba Kyari",
    "summarized_story": "The Inspector-General of Police, IGP Usman Alkali Baba in Thursday, 26th August, 2021, received the report of the NPF Special Investigation Panel (SIP) investigating the alleged indictment of the erstwhile Head of the Police Intelligence Response Team (IRT), DCP Abba Kyari by the Federal Bureau of Investigation (FBI).\nAccording to a press release signed by the Force Public Relations Officer, CP Frank Mba, he said that the report was submitted by the chairman of the SIP, DIG Joseph Egbunike, at the Force Headquarters, Abuja.\nDIG Egbunike, while presenting the report, appreciated the IGP for the confidence reposed on him and the members of the Panel to conduct the probe.\nHe noted that the Panel commenced investigations immediately it was inaugurated on 2nd August, 2021 and the report submitted is an outcome of a painstaking, transparent and exhaustive investigative process."
  },
  {
    "headline": "Buhari Media Oerganisation cautions Ortom against unguided utterances",
    "summarized_story": "The Buhari Media Organisation (BMO) has described Benue State Governor Samuel Ortom’s latest comments on President Muhammad Buhari’s administration as rantings of a failed governor.\n“Governor Ortom has expectedly publicly come out to challenge the ongoing move by the Federal Government to revive grazing reserves by making unguarded comments against the President.\nBMO added that Ortom’s position on President Buhari’s support for open grazing is at variance with the realities on ground.\n“We however need to remind the Benue State Governor of the promise he made several weeks ago that he would be inviting the President to commission a number of projects.\nBMO also urged Governor Ortom to speak more on how he has improved on what he met in 2015, rather than his constant desire to hug the limelight with his anti-Buhari rhetorics."
  },
  {
    "headline": "‘King of Boys’ Director Kemi Adetiba Speaks on ‘The Return of the King’ – Arise News",
    "summarized_story": "One of the most anticipated Nollywood films of all time is ‘King of Boys,’ following the success of its first installation which made over $1 million at the box office.\nThe sequel to KOB is Netflix’s first Original 7 part Series directed by Kemi Adetiba.\nAfter a two-year wait, the sequel which initially was supposed to be a movie, premieres on August 27.\nKemi Adetiba and Toni Tones sat with ARISE News Correspondent, Seyitan Atigarin, ahead of the release…"
  },
  {
    "headline": "Nigeria: Buhari Appoints Harry To Head National Bureau of Statistics",
    "summarized_story": "President Muhammadu Buhari has appointed Dr. Simon Harry as the new Statistician-General of the Federation to head the National Bureau of Statistics (NBS).\nThe newly appointed general is to succeeded the out-going Statistician-General, Dr. Yemi Kale, whose second term tenure of five years expires on 16th August, 2021.\nCurrently, Dr. Harry is the Director, Corporate Planning and Technical Coordination Department of NBS with almost three decades of statistical experience.\nHe joined the erstwhile Federal Office of Statistics as Statistician 11 in 1992 and rose to the position of a substantive Director of Statistics in 2019.\nIn the course of his civil service career, Dr. Harry has contributed to several reform initiatives including the reform of the then Federal Office of Statistics which transformed to the current National Bureau of Statistics, the reform of the Nigerian Statistical System which resulted to the creation and establishment of State Bureaus of Statistics at the sub-national level."
  },
  {
    "headline": "Dangote Refinery Will Purchase Over 300,000 Barrels Per Day Of Nigeria’s Crude",
    "summarized_story": "Dangote’s oil refinery will buy at least 300,000 barrels per day of Nigeria’s crude production, after the government granted approval for a 20 percent equity purchase in the project promoted by Africa’s richest man, Aliko Dangote.\n“We structured our equity participation on the basis that the refinery must buy at least 300,000 barrels of crude oil per day of our production.\n“This guarantees our market at a period when every country is struggling to find market for their crude oil”, Kyari told lawmakers in Abuja.\nThe government this month gave NNPC the green light to acquire the stake in the oil refinery for $2.76 billion.\nNigeria, Africa’s biggest crude oil exporter, imports virtually all its fuel due to moribund state refineries, which has prompted NNPC’s interest in Dangote’s oil refinery."
  },
  {
    "headline": "Nigeria’s Presidential Economic Advisory Council Has Not Had Expected Impact: Mustafa Chike-Obi",
    "summarized_story": "President of the Bank Directors Association of Nigeria, Mustafa Chike-Obi says the presidential Economic Advisory Council has failed to have the kind of impact expected of it when it was constituted.\nMr Chike-Obi told ARISE News on Thursday that while the economic council is filled with excellent minds, the president is not a good consumer of policy documents that emerge from the council.\nThe Chairman of Fidelity Bank Nigeria was criticising the lack of a chief economic adviser in President Muhammadu Buhari’s administration who he says receives the work outputs from the council and condenses them for the president’s action.\nHe also had more insights regarding Nigeria’s economy.\nWatch the interview for more…"
  },
  {
    "headline": "Buhari Announces NNPC’s $697m Profit After Tax",
    "summarized_story": "Nigeria’s National Petroleum Corporation (NNPC) recorded N287 billion, some $697 million in 2020, the first time in the 44-year history of the establishment, the country’s President Muhammadu Buhari has announced.\nMr Buhari who doubles as the Minister for Petroleum Resources on Thursday said the announcement was in fulfilment of an earlier pledge by the Federal Government to publicly announce the financial position of the state-owned oil company.\nThis is sequel to the completion of the statutory Annual Audit exercise for Year 2020,” the statement read.\n“I have further directed the Nigerian National Petroleum Corporation to timely publish the Audited Financial statements in line with the requirements of the law and as follow up to our commitment to ensuring transparency and accountability by public institutions.\n“I congratulate the Board, Management and Staff of the Corporation and look forward to greater value creation for the Nigerian people.”By Abel Ejikeme"
  }
]