[
  {
    "headline": "30 Kebbi FGC kidnapped students released after 126-day captivity",
    "summarized_story": "After 126 days in captivity, 30 abducted students of the Federal Government College, Birnin Yauri, on Thursday, arrived Birnin Kebbi, the Kebbi State capital following their release by bandits.\nThe news of their release was broken to journalists in a statement issued by the Special Adviser, Media, to Kebbi State Governor, Yahaya Sarki.\nThe statement read, “Today, Thursday, October 21, 2021, 30 students of the Federal Government College, Birnin Yauri have arrived Birnin Kebbi, the Kebbi State capital, following their release, while efforts are still continuing to secure the release of the remaining.\nSadly, three students, one each from Kamba (Kebbi), Wushishi and Anaba areas of Niger state, were confirmed dead.\nWhen contacted, a parent of one of the abducted students, who did not want his name in print, told our correspondent that, he is not in the picture of under what terms and conditions some of the abducted students were released."
  },
  {
    "headline": "Gas turbine: Rivers to sue Saipem for contractual breach",
    "summarized_story": "Rivers State Government is to initiate criminal proceeding against Saipem Contracting Nigeria Limited for alleged breach of trust, which led to abandonment of the state’s gas turbine generator unit and accessories in The Netherlands since 2012.\nThe Special Assistant (Media) to the Governor, Kelvin Ebiri, disclosed this in a statement on Thursday.\nAccording to Ebiri, the decision to file criminal proceeding against firm was taken at the State Executive Council’s meeting presided over by the state governor, Nyesom Wike, at the Government House, Port Harcourt on Thursday.\n“Consequently, the council unanimously directed the Attorney General of Rivers State to file criminal proceeding against Saipem Contracting Nigeria Limited for her role in this ugly incident,” he said.\nHe further stated that the reconstruction of Chokocho-Igbodo Road is 27.1km, awarded at a cost of N13.523 billion."
  },
  {
    "headline": "Rail movement of cargo from Lagos to Kano, Kaduna Dry Port resumes",
    "summarized_story": "By Providence AdeyinkaThe Nigerian Railway Corporation, NRC, has resumed the movement of cargoes in containers by rail to Kano and Kaduna Inland Dry Ports.\nIsmail Yusuf, Managing Director of Inland Containers Nigeria Limited ICNL, who confirmed the development to journalists in Lagos, said about forty containers have so far been moved.\n“As you know the Federal Government is encouraging the Nigerian Railway Corporation to ensure movement of cargo from the seaport to the hinterland and this is very critical to our Kano bonded terminal and Kaduna Inland Dry Port, which is our subsidiary company.\n“Management of ICNL and that of the railway corporation discussed the modalities of how they can come back to life.\n“It has been fruitful and the railway corporation had commenced movement of cargo from the seaport to the hinterland, that is to ICNL and Kaduna Dry Port.”"
  },
  {
    "headline": "First Rhema solution set to empower Oshimili-Aniocha youths on ICT",
    "summarized_story": "In bid to reduce unemployment, Nigeria’s fastest growing Information and Communication Technology (ICT) Company in the South-South and South-East geopolitical zones of Nigeria.\nFirst Rhema Solutions Limited will be empowering youths in Oshimili & Aniocha North and South respectively through Information and Communication Technology (ICT).\nThe Chairman First Rhema Solutions Amb.\n“This will help in increasing the economic value of our youths across Delta State and by extension Nigeria.\nThe youths led by Dada Okolo ( Igwe Omenife) commended Amb Mark Obi for supporting youths in Delta State through the use of Technological tools."
  },
  {
    "headline": "EndSARS: Lagos judicial panel report ‘ll be made public, fully implemented-Sanwo-Olu assures",
    "summarized_story": "Governor Babajide Sanwo-Olu of Lagos State.\nBy Olasunkanmi Akoni and Nelson AluGovernor, Babajide Sanwo-Olu of Lagos State has assured citizens that the white paper on the final report of the Lagos State Judicial Panel of Enquiry and Restitution would be made public and fully implemented in due course.\nHe said it had been tough for the state government in the rebuilding Lagos project aftermath of devastating destruction on Lagos.\nAccording to Sanwo-Olu: “The panel concluded its sittings about three days ago and has asked for time to put the reports together behind closed doors.\nSanwo-Olu stated: “It is exactly a year ago today when Lagos was hit by violence in the aftermath of the EndSARS protests."
  },
  {
    "headline": "Nigeria’s economy to grow by 2.7% in 2022 — IMF",
    "summarized_story": "The International Monetary Fund (IMF) has predicted Nigeria’s economy to grow by 2.6 per cent this year and a 2.7 per cent growth in 2022.\nThis is according to the October Regional Economic Outlook for Sub-Saharan Africa: One planet, two worlds, three stories, made available at the ongoing Annual Meetings of the IMF and World Bank in Washington on Thursday.\nIt also stated that the region had benefited from improved harvests and increased agricultural production in a number of countries.\nPolicies need to be squarely focused on addressing the challenge of poverty to prevent the insecurity in the region.\nWe need to pay more heed to this phenomenal opportunity.”Selassie further reiterated the commitment of the IMF to supporting sub-Saharan Africa tackle the broad array of challenges it faced."
  },
  {
    "headline": "JAMB registrar seeks transparency in examination processes",
    "summarized_story": "The Registrar of JAMB, Prof. Is-Haq Oloyede, has urged stakeholders in the education sector to establish a pedigree of integrity.\nHe urged them to do this by sticking to honesty, probity and transparency in examination processes and result computation in tertiary universities.\nHe said that transparency in examination processes should become the new normal in our social consciousness.\n“However, hardly can it be controverted that before the outbreak of COVID-19 pandemic, our world had actually entered or descended into the abyss of the abnormal.\n“As COVID-19 pandemic continues to affect many sectors of economies around the world, Nigeria was also faced with new challenges."
  },
  {
    "headline": "Recovered loot: Reps summon CBN, First Bank to give update on recoveries",
    "summarized_story": "To this end, the Central Bank of Nigeria (CBN), First Bank of Nigeria Polaris Bank, Sterling Bank, Nexim Bank, and Heritage Bank have been summoned by the Committee to offer explanation recovered and kept in their vaults.\nAdeogun Adejoro at public hearing on Thursday, stopped representative of Polaris Bank after he introduced himself as the Legal Adviser of the bank.\nAccording to the Legal advisor of Polaris Bank, “Monies have been paid to the CBN account, and the CBN has the evidence”.\nHe also said, “Polaris Bank Cannot be comfortably owing the federal government and refuse to pay, because, the money is supposed to be used to fund the 2022 budget”.\nNNPC advised it should be closed.”“As far as this recovered loot is concerned now, First Bank is not involved in such again, it has been settled."
  },
  {
    "headline": "Tension in Abia as soldiers reportedly ‘gun down’ suspected IPOB members",
    "summarized_story": "Personnel of the Nigerian Army have reportedly gunned down militants of the Indigenous People of Biafra (IPOB) during a gun duel around the palace of Eze Aro in Arochukwu Local Government Area of Abia State.\nIt was gathered that the incident occurred on Thursday when some youths were said to have stormed the streets celebrating the appearance of the IPOB leader, Nnamdi Kanu at the Federal High Court Abuja.\nThe spokesman of the state’s police command, SP Geoffrey Ogbonna, who said he would not speak for the army, confirmed the clash between the suspected IPOB members and some soldiers.\nDAILY POST had reported that the secessionist was at the Federal High Court in Abuja on Thursday for the continuation of his trial over allegations of terrorism and treasonable felony.\nHis request to be moved from the Kuje Correctional Centre from the Department of State Service, DSS, facility to Kuje correctional center was, however, turned down by Justice Binta Nyako who adjourned the case to November 10."
  },
  {
    "headline": "Nnamdi Kanu: Group condemns denial of Ezeife, Ubah entry into courtroom",
    "summarized_story": "COSEYL in a statement by its President General, Goodluck Ibem, said the denial of the two and other Igbo leaders entry into the courtroom was an insult on Igbo people.\nThe release stated in part that: “The DSS operatives threatened to shoot lawyers and Igbo leaders who dared to enforce their right by approaching the entrance to the courtroom.\n“Does the order from above also include ordering them to assassinate great Igbo leaders in broad daylight at the court premises?\nIs the Nigerian Court now the court of the North, where no Igbo man is allowed access?\nEzeife, Senator Ifeanyi Ubah and other great Igbo leaders were representatives of the Igbo Nation, they were denied access to the court in a matter involving their own son and brother, Mazi Nnamdi Kanu in a supposed democratic administration."
  },
  {
    "headline": "‘End SARS protest now a thing of show-off’ – Bello Shagari",
    "summarized_story": "Bello, grandson of late former President Shehu Shagari has said a lot of Nigerians who identify with the End SARS movement are doing it to a show-offAccording to him, most End SARS protesters are claiming to be activists and have little understanding of socio-political system.\nOn his Facebook page, Shagari wrote: “A lot of the young people who identify with the#EndSARS protest are doing so because it has become fashionable.\n”This has become a thing of show off; that everyone is now an activist.\n“We must adopt a more progressive and strategic approach rather than the usual disruptive one which hasn’t yielded any meaningful results.\nYou cannot be doing the same thing and expect a different result."
  },
  {
    "headline": "Benue: Dead resurrecting to receive salaries – Ortom moves to end padding of school teachers’ wage",
    "summarized_story": "Benue State Governor, Samuel Ortom has taken decisive steps to end padding of salaries of primary school teachers by the State Universal Basic Education, SUBEB.\nGovernor Ortom who met with Local Government Chairmen, Chairman and board members of SUBEB among others Thursday, 21st October, 2021 at the New Banquet Hall of Benue Peoples House Makurdi gave the Local Government Council Chairmen one month to carry out intensive physical verification to unmask the cartel behind padding of teacher’s salaries.\nThe Governor maintained that since the decision to engage 2,000 teachers in the primary school was sacrosanct, his government would do everything possible to block financial leakages in the sector to guarantee expected goals.\nSpecial Adviser to the Governor on Bureau of local government and Chieftaincy Affairs, Mr. Kenneth Achabo at the briefing, also presented a report on audited accounts of the twenty three local government councils from 2015 to 2019.\nGovernor Ortom while receiving the report, described it as a novel initiative and stressed the need for those in positions of trust to keep financial records straight so as to support auditors with facts and figures to do their job."
  },
  {
    "headline": "From Black Lives Matter to EndSARS",
    "summarized_story": "SIR: The world did not only combat the dreaded Covid-19 virus in the year 2020, the world stood up against police brutality.\nPeople held signs that read “BLACK LIVES MATTER” while others knelt in silence for the number of minutes it took Floyd’s life to be snuffed out of him.\nThe video that trended the Nigerian internet space too provoked a similar protest which eventually became the #EndSARS protests.\nBoth the “Black Lives Matter” protest and the “EndSARS” protest took solace in a decentralized technique that made it difficult for governments to identify the leaders of the mass movement.\nFew states have implemented the recommendations of ENDSARS judicial panels which amongst others called for the prosecution of certain police officers who abused their powers."
  },
  {
    "headline": "FDI: Nigeria getting it right finally?",
    "summarized_story": "According to the AAFMI evaluation of financial market development in 23 African countries, Nigeria was highlighted as one of the top economies with the most supportive environment for effective markets.\nOverall, Nigeria scored 63 points to occupy the third position while the first and second positions went to South Africa and Mauritius, which scored 86 and 70 points respectively.\nNigeria is also among countries that are using technology in their stock exchanges to boost retail participation.\nAAFMI also acknowledged the fact that Nigeria has continued to make strides in creating an enabling investment environment for foreign investors, with the necessary regulatory developments and policy initiatives.\nIt is believed that beyond rhetoric government will not relent until the country becomes the ultimate destination for foreign investment in Africa."
  },
  {
    "headline": "One year after #EndSARS, no lessons learnt",
    "summarized_story": "- Advertisement -So, one year after the #EndSARS protest, what has changed?\nThe impunity by law enforcement agents has persisted unhinged since the #EndSARS protest.\nPolice criminalise citizens; citizens see police as the enemy.\nThe #EndSARS protest happened at a time Nigeria was reopening the economy after weeks of lockdown owing to the COVID pandemic.\nA lack of strategy and the absence of leadership made the #EndSARS protest vulnerable to political toxins."
  },
  {
    "headline": "BREAKING: Hoodlums beat up Sowore at Kanu’s trial",
    "summarized_story": "Publisher of Sahara Reporters, Omoyele Sowore, was attacked by suspected hoodlums at the Federal High Court in Abuja on Thursday.\n- Advertisement -Immediately the suspected hoodlums descended on Sowore, slapping and punching him.\nTo the surprise of everyone, the security agents just looked on but intervened after shouting from those present by holding Sowore back.\n- Advertisement -However the hoodlums after attacking Sowore left without being apprehended by the security agents.\nThe members of the public then chased the hoodlums to apprehend them as the security operatives looked on."
  },
  {
    "headline": "Buhari to security chiefs: Nothing must stop Anambra election",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has given marching orders to the nation’s security chiefs that nothing must be allowed to temper with the November 6th gubernatorial election in Anambra State.\nMonguno, who briefed on the outcome of the meeting of security chiefs presided over by President Buhari at the Presidential Villa, Abuja, said President Buhari gave the armed forces the marching order in response to the heightened security challenges in Anambra state.\nThe NSA said, “The President has directed that under no circumstances will anything be allowed to stop the elections from taking place successfully.\n“Two days ago, the man who succeeded him, one Malam Bako, one of the prominent leaders of the Shura Council of the Islamic State of West African Province, was also taken out.\nHe said, “In particular, we talked about the Anambra governorship election coming on 6th of November and we want to assure the people of Anambra State and all Nigerians that the government is committed to conducting that election."
  },
  {
    "headline": "Bandits release 30 abductees of FGC Birnin Yauri",
    "summarized_story": "From Olanrewaju Lawal, Birnin KebbiThirty out of unspecified number of the abducted students of Federal Government College, Birnin Yauri, in Kebbi, have regained their freedom after four months, three days in captivity.\nThe bandits released 30 abductees, comprised three teachers: two males and one female; while the students included, two girls and 25 boys.\nBagudu prayed Almighty Allah to rescue those that have not yet been release.\nIt could be recalled that on June 17,2021, bandits attack Yauri FG’s school, kidnap 5 teachers, kill police , abduct unspecified number of students which now four moths, three days..\n“The truth is that the attack took place; and five teachers have been taken away: four male and one female."
  },
  {
    "headline": "Anambra 2021: Supreme Court declares Ozigbo authentic PDP candidate",
    "summarized_story": "From David Onwuchekwa, NnewiSupreme Court in Abuja has declared Mr Valentine Ozigbo the authentic candidate of the People’s Democratic Party (PDP) for the November 6 governorship election in Anambra State.\nThe apex court, in a judgement delivered at the Supreme Court Complex in Abuja on Thursday, October 21, reportedly threw out all the challenges to Ozigbo’s candidacy and awarded damage of N5 million against Senator Ugochukwu Uba.\nThe panel of justices, led by His Lordship, Justice Inyang Okoro, according to the report, affirmed the decision of the Court of Appeal Awka Division delivered on September 3, which declared Ozigbo the authentic governorship candidate of the PDP.\nMr Ozigbo was present at the Supreme Court along with former Governor of Anambra State, Mr Peter Obi, and Senate Minority Leader Senator Enyinnaya Abaribe.\nHe reassured the electorate that the victory was a sign of good things to come."
  },
  {
    "headline": "Kanu pleads not guilty to terrorism charges",
    "summarized_story": "Kanu’s counsel, Mr Ifeanyi Ejiofor, disclosed this shortly after his client was re-arraigned on the amended charges before Justice Binta Nyako of the Abuja division of the Federal High Court.\nKanu pleaded not guilty to the fresh charge, even as his lawyer had requested that he be transferred to the custody of the Correctional Service Centre.\nJustice Nyanko, however, declined to grant the request on the grounds that it would be in the interest of Kanu to remain with the DSS.\nIn a related development, Ohanaeze Ndigbo accused the Federal Government of conducting a secret trial in the issue of Nnamdi Kanu.\nThis was despite the fact that the journalists had forwarded their names to the court and DSS for coverage of the proceedings."
  },
  {
    "headline": "I am not guilty, Nnamdi Kanu tells court",
    "summarized_story": "The leader of the Indigenous People of Biafra (IPOB) Mazi Nnamdi Kanu, has been re-arraigned at a federal high court in Abuja on terrorism charges.\nHe pleaded not guilty.\nWhen the charges were read to him, the IPOB leader pleaded not guilty.\nAdvertisementHe has been in the custody of the Department of State Services (DSS) since his arrest.\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Ojukwu, Akaraiwe, Obegolu, 69 Others Emerge New SANs",
    "summarized_story": "Ojukwu, who was shortlisted last year but did not make the list, was however successful this year.\nSeventy-two candidates are successful from a total of 130 shortlisted for the award last month by the Legal Practitioners’ Privileges Committee (LPPC).\nHowever, after the screening and interview, only 62 were successful from the Advocates category and 10 from the academics.\nOthers that made the list from the academics included Prof. Bankole Sodipo, Prof. Christian Wigwe, Prof. Ajagbe Oyewo and Dr Josephine Agbonika.\nThose in the Advocates category are George Anuga, Deputy Commissioner of Police (DCP); Simon Lough, Ayo Olorunfemi, Ehigie West-Idahosa and Reuben Atabo, amongst others."
  },
  {
    "headline": "Breaking: NRC Suspends Abuja-Kaduna Train Services over Attack",
    "summarized_story": "By Kasim SumainaFollowing the an attack on the Abuja-Kaduna rail corridor by yet to be identified gunmen, the Nigeria Railway Corporation (NRC) has suspended indefinitely train services along the Abuja –Kaduna route.\nThe NRC in a statement on its website on Thursday said the services were suspended for the safety of passengers and crew members.\nAlthough NRC was silent of the cause of safety concerns that necessitated the suspension of the Abuja- Kaduna train services, trending photos on social media showed a train operator cockpit with shattered windshield, suggesting that the train came under attack.\nThe Abuja-Kaduna road has been a den of bandits who attack vehicles on the highway, killing and, most times, kidnapping travellers.\nThis has forced many travellers to opt for train services to commute between the nation’s capital and Kaduna, one of the important cities in the NorthShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Nnamdi Kanu in Court as Trial Commences",
    "summarized_story": "By Alex EnumahThe leader of the Indegenious People of Biafra (IPOB), Nnamdi Kanu, is present in court as his trial over alleged terrorism and treasonable felony commence Thursday morning in Abuja.\nThe federal government, last week, filed an amended seven-count criminal charge against Kanu, upon which he is to be re-arraigned before Justice Binta Nyako of the Federal High Court, Abuja.\nKanu and four others were arraigned in 2016 on a six-count criminal charge but abandoned his trial in 2017 after his family’s house was attacked.\nHe was however re-arrested and brought to the country to continue his trial in June, this year.\nMeanwhile, as the trial gets underway, journalists covering the court, although allowed entry into the court premises, were however prevented from entering the court room."
  },
  {
    "headline": "Breaking: Nnamdi Kanu Arrives Court Premises, Amidst Tight Security",
    "summarized_story": "By Alex EnumahDetained leader of the Indigenous People of Biafra (IPOB), Mr Nnamdi Kanu has arrived the Abuja Division of the Federal High Court, venue of his trial over allegations of terrorism and treasonable felony.\nBefore his arrival, security operatives including DSS, Nigerian Army, Police and the NSCDC had condoned off all enterances leading to the headquarters of the Federal High Court, Abuja.\nEven staff of the Federal High Court had to alight from their staff bus to be screened before they were allowed to go in.\nNnamdi Kanu was arraigned alongside four others on six count criminal trial charge bordering on alleged terrorism and treasonable felony in 2016.\nFollowing the jumping of his bail, trial judge, Justice Binta Nyako had voided the bail and issued a warrant for his arrest."
  },
  {
    "headline": "Security, Trade Take Centre Stage in Nigeria, Turkey Agreements",
    "summarized_story": "“During the visit, we had very useful discussions on a number of bilateral issues, aimed at strengthening this cordial relationship between Nigeria and Turkey.\nThus, Nigeria became our most outstanding and the biggest trade partner in the sub-Saharan Africa for the Republic of Turkey.\nOn the beneficial ties between Turkey and Africa, especially Nigeria, President Erdogan said, “we’ll keep on converging with the African continent as Republic of Turkey on every dimension possible.\nHe added: “As Turkey, we have been closely monitoring the developments unfolding in Nigeria, our brotherly and friendly nation.\nI hope and pray that our Nigerian brothers will forge a closer solidarity in this field with us, the Republic of Turkey."
  },
  {
    "headline": "BREAKING: Lawless Nigeria’s Secret Police, DSS Operatives Harass Electoral Commissioner In Anambra For Refusing To Favour Buhari's APC Party",
    "summarized_story": "Operatives of the Department of State Services (DSS) have harassed the Resident Electoral Commissioner of the Independent National Electoral Commission (INEC) in Anambra State, Dr Nwachukwu Orji, ahead of the state governorship election on November 6.\nSaharaReporters gathered that the petition followed the refusal of the INEC REC to recruit all the Supervisory Polling Officers for the elections from Imo and Ebonyi states.\nINEC, it was further learnt, rejected all 72 Supervisory Polling Officers because it had not used its staff members for such roles since 2010.\nA top source said, “The DSS said the petition came from the refusal of INEC REC to accept 72 supervisory polling officers.\n\"They wanted the REC to recruit all the Supervisory Polling Officers for the elections from Imo and Ebonyi but INEC rejected the 72."
  },
  {
    "headline": "BREAKING: Lawless Nigeria’s Secret Police, DSS Operatives Harass Electoral Commissioner In Anambra For Refusing To Favour Buhari's APC Party",
    "summarized_story": "Operatives of the Department of State Services (DSS) have harassed the Resident Electoral Commissioner of the Independent National Electoral Commission (INEC) in Anambra State, Dr Nwachukwu Orji, ahead of the state governorship election on November 6.\nSaharaReporters gathered that the petition followed the refusal of the INEC REC to recruit all the Supervisory Polling Officers for the elections from Imo and Ebonyi states.\nINEC, it was further learnt, rejected all 72 Supervisory Polling Officers because it had not used its staff members for such roles since 2010.\nA top source said, “The DSS said the petition came from the refusal of INEC REC to accept 72 supervisory polling officers.\n\"They wanted the REC to recruit all the Supervisory Polling Officers for the elections from Imo and Ebonyi but INEC rejected the 72."
  },
  {
    "headline": "BREAKING: Lawless Nigeria’s Secret Police, DSS Operatives Harass Electoral Commissioner In Anambra For Refusing To Favour Buhari's APC Party",
    "summarized_story": "Operatives of the Department of State Services (DSS) have harassed the Resident Electoral Commissioner of the Independent National Electoral Commission (INEC) in Anambra State, Dr Nwachukwu Orji, ahead of the state governorship election on November 6.\nSaharaReporters gathered that the petition followed the refusal of the INEC REC to recruit all the Supervisory Polling Officers for the elections from Imo and Ebonyi states.\nINEC, it was further learnt, rejected all 72 Supervisory Polling Officers because it had not used its staff members for such roles since 2010.\nA top source said, “The DSS said the petition came from the refusal of INEC REC to accept 72 supervisory polling officers.\n\"They wanted the REC to recruit all the Supervisory Polling Officers for the elections from Imo and Ebonyi but INEC rejected the 72."
  },
  {
    "headline": "BREAKING: Tension As Police, Army Clash With #EndSARS Memorial Protesters In Abuja",
    "summarized_story": "Armed security operatives have blocked Nigerians youths protesting in memory of those killed and brutality at Lekki tollgate in Lagos State and around the country during the #EndSARS protest on October 10, 2020.\nThe protest tagged #EndSARSMemorial kicked off from the unity fountain with demand for end in police brutality in the country.\nThe protesters insisted on marching to the National Assembly and the demand for justice for the victims of Lekki massacre but they were prevented by the security operatives led by the FCT Deputy Commissioner of Police in charge of operations, Ben Igweh.\nThe police and security operatives asked the protesters to return to the Unity Fountain and continue with their protest leading to an altercation as the protesters stood their ground.\nAs at time of filing this story the stand-off continued as protesters remained on the road and vowed not to leave until their demands were met."
  },
  {
    "headline": "BREAKING: Tension As Police, Army Clash With #EndSARS Memorial Protesters In Abuja",
    "summarized_story": "Armed security operatives have blocked Nigerians youths protesting in memory of those killed and brutality at Lekki tollgate in Lagos State and around the country during the #EndSARS protest on October 10, 2020.\nThe protest tagged #EndSARSMemorial kicked off from the unity fountain with demand for end in police brutality in the country.\nThe protesters insisted on marching to the National Assembly and the demand for justice for the victims of Lekki massacre but they were prevented by the security operatives led by the FCT Deputy Commissioner of Police in charge of operations, Ben Igweh.\nThe police and security operatives asked the protesters to return to the Unity Fountain and continue with their protest leading to an altercation as the protesters stood their ground.\nAs at time of filing this story the stand-off continued as protesters remained on the road and vowed not to leave until their demands were met."
  },
  {
    "headline": "FULL LIST: NHRC boss among 72 lawyers named senior advocates of Nigeria",
    "summarized_story": "Anthony Ojukwu, executive secretary of the National Human Rights Commission (NHRC), has been named a senior advocate of Nigeria (SAN).\nAdvertisementOjukwu is one of 72 lawyers named by the legal practitioners privilege committee (LPPC) at its 149th plenary session on Thursday.\nA total of 130 lawyers were shortlisted for the rank in September — including 95 advocate applicants and 35 academic applicants.\nOf the 130 candidates shortlisted, 72 were successful, while 58 did not make the cut.\nOther notable persons that were elevated to SAN are Ikeazor Akaraiwe, former vice-president of the Nigerian Bar Association (NBA), as well as Emeka Obegolu, former NBA general secretary."
  },
  {
    "headline": "FULL LIST: NHRC boss among 72 lawyers named senior advocates of Nigeria",
    "summarized_story": "Anthony Ojukwu, executive secretary of the National Human Rights Commission (NHRC), has been named a senior advocate of Nigeria (SAN).\nAdvertisementOjukwu is one of 72 lawyers named by the legal practitioners privilege committee (LPPC) at its 149th plenary session on Thursday.\nA total of 130 lawyers were shortlisted for the rank in September — including 95 advocate applicants and 35 academic applicants.\nOf the 130 candidates shortlisted, 72 were successful, while 58 did not make the cut.\nOther notable persons that were elevated to SAN are Ikeazor Akaraiwe, former vice-president of the Nigerian Bar Association (NBA), as well as Emeka Obegolu, former NBA general secretary."
  },
  {
    "headline": "2023: Atiku, Tambuwal have indicated interest in contesting presidency, says Makinde",
    "summarized_story": "Seyi Makinde, governor of Oyo, says former Vice-President Atiku Abubakar and Aminu Tambuwal, governor of Sokoto, have indicated interest in contesting in the 2023 presidential election.\nSpeaking on Thursday during an interview on Channels Television, Makinde said the Peoples Democratic Party (PDP) has “eminently qualified” personalities that can lead the country successfully.\n“The issue right now is that our party — PDP — has eminently qualified personalities that can lead this country successfully.\nSome have indicated interest like former Vice-President Atiku Abubakar, like governor Tambuwal, like governor Bala Mohammed.\nAdvertisement“They have indicated interest."
  },
  {
    "headline": "2023: Atiku, Tambuwal have indicated interest in contesting presidency, says Makinde",
    "summarized_story": "Seyi Makinde, governor of Oyo, says former Vice-President Atiku Abubakar and Aminu Tambuwal, governor of Sokoto, have indicated interest in contesting in the 2023 presidential election.\nSpeaking on Thursday during an interview on Channels Television, Makinde said the Peoples Democratic Party (PDP) has “eminently qualified” personalities that can lead the country successfully.\n“The issue right now is that our party — PDP — has eminently qualified personalities that can lead this country successfully.\nSome have indicated interest like former Vice-President Atiku Abubakar, like governor Tambuwal, like governor Bala Mohammed.\nAdvertisement“They have indicated interest."
  },
  {
    "headline": "Troops have killed another ISWAP leader, says Monguno",
    "summarized_story": "Babagana Monguno, the national security adviser (NSA), says Malam Bako, another leader of the Islamic State in West Africa Province (ISWAP), has been killed.\nAdvertisementThis development comes days after Lucky Irabor, chief of defence staff, confirmed that Abu Musad Al-Barnawi, a leader of ISWAP and son of Mohammed Yusuf, the late founder of Boko Haram, had been killed.\nAddressing journalists after a security meeting of service chiefs with President Muhammadu Buhari on Thursday, Monguno said Bako was killed two days ago by the military.\nBoth factions have been at war since 2016 when ISWAP broke out of the Shekau-led group over leadership issues.\nAl-Barnawi, the then leader of ISWAP, had said Shekau’s faction would be defeated by the Nigerian military."
  },
  {
    "headline": "Baxi acquisition deal sees MFS Africa expand footprint into Nigeria",
    "summarized_story": "As the largest fintech interoperability hub in Africa, MFS Africa connects banks, telcos, and money transfer operators across over 35 countries via a single integration point.\nCapricorn will be called MFS Africa but its core product, Baxi, retains its name.\nMFS Africa was founded in 2009 by Dare Okoudjou, a Beninese national, while Nigeria-born Abudu started Capricorn in 2014, with Folu Majekodunmi.\nThe acquisition creates a larger, more versatile company that fuses interoperability between money operators and a super-agent network reaching the mass market.\nMFS Africa will also expand Baxi’s proposition for offline SMEs to select markets within its footprint."
  },
  {
    "headline": "Editi Effiong: father, writer, producer and tech bro",
    "summarized_story": "When asked how he would define himself, he responded with, “I’m a father, writer, producer, and tech bro.\nThe big picture: Editi Effiong is not your average guyMany people know Editi Effiong as the brains behind Anakle.\nAnakle Films’ theatrical releases, Up North and The Setup, were acquired by Netflix in 2019 and 2020 respectively.\nIn 2011, digital marketing didn’t have as much clout as it does now.\nEspecially knowing that you were going to put a lot of time and effort into building out Anakle Films’ brand?"
  },
  {
    "headline": "Who’s afraid of crypto-salaries?",
    "summarized_story": "Back in 2015, its current president, Muhammadu Buhari, campaigned on a promise to increase the value of the naira.\nThis plunge in the value of the naira has been majorly fueled by Nigeria importing more goods than it exports.\nWith 96% of the crypto value coming from outside the continent, this suggests that more Africans are receiving remittances via crypto.\nThis is the company battling the challenge that comes with paying employees in crypto, as legal barriers in many countries prevent this.\nSome of the barriers include the non-recognition of cryptocurrency as a legal tender and the challenge of calculating taxes when employees are paid in cryptocurrency."
  },
  {
    "headline": "I promise it’s funnier in Swahili…Kenyan Comedian Eddie Butita is Showing Netflix How Swahili’s Done",
    "summarized_story": "To roll out this project, the $25 billion company enlisted the help of celebrated Kenyan comic, Eddie Butita.\nButita is skilled at wielding digital technology in a market that’s grown so big that Netflix can’t ignore it.\nAccording to the Worldwide Mobile Data Pricing (2021) report from Cable, a British technology research firm, Kenya takes the lead as the most expensive country for mobile data in East Africa.\nViewing one hour of Netflix content on low resolution (480p) uses 300 MB of data per hour; in high resolution (1080p), Netflix uses 3 GB per hour.\nAt an average cost of $1.05 per GB of data, Netflix viewers in Kenya stand to pay anywhere from $0.32 to $3.15 to watch a one-hour show."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "What does the African fintech need?",
    "summarized_story": "The virtual event focused on fintech’s allure to investors, the benefits Africans derive from fintech start-ups, partnerships between banks and fintech startups, and the role of regulators in the industry.\nHowever, Agboola disagreed with that view, arguing that he sees a situation where fintech complement the works that banks do and vice versa, advocating for partnerships between banks and fintech.\nDeepening financial inclusion is high on the agenda of Nigeria’s Central Bank and Y’ello Digital Financial Services has been playing its part in helping the apex realize this goal.\nWith its wide network of over 150,000 MoMo agents, the organization offers financial services to customers.\nWith 54 countries in Africa, providing financial services to users comes with lots of regulatory hurdles in each country."
  },
  {
    "headline": "For as little as ₦1000, business management startup, BIZ301, wants to help you automate your business",
    "summarized_story": "Every small business owner is struggling.\nMy experience and my engagement with quite a number of small business owners taught me this.”And it was at this point that he arrived at his answer: digitising small businesses.\nAt this point, I sat at the drawing table and tried to understand the exact structure of small businesses.\nWith the employee and payroll function, the business owner automates the salary payment process.\nAs long as the small business owner is making money, BIZ301 makes money too, free user licence or not."
  },
  {
    "headline": "Yes, you have rights over your data, but only to an extent",
    "summarized_story": "The issuesUnder the Nigeria Data Protection Regulation 2019, a data subject has several rights over the use of their personal data.\nThis is in breach of the Nigerian Data Protection Regulations which protects the right of a data subject to rectification and erasure of their personal data.\nThe laws don’t say the right to rectification of data by the data subject must be done on the platform by the individual, or it must be achieved immediately.\nThe NDPR provides for situations that might be regarded as the lawful processing of a data subject’s data.\nBut what I do know is that it has prompted a very important discussion on data rights and how they can be abrogated."
  },
  {
    "headline": "Five trends driving business shifts globally – Okiti",
    "summarized_story": "As the global economy shifts, businesses will need to be aware of the changing trends in order to meet the challenges ahead.\nDuring the ThinkBusiness conference, Ogho Okiti, an economist and managing director, BusinessDay Media, identified five factors driving business shifts in the world today.\nSecondly, he identified economic crisis as another factor that drives business shifts.\nThirdly, he pointed out that government policies also drive business shifts.\nFurthermore, technology is a crucial driver of business shifts, he said, saying, “Business owners should not consider any business model without considering the impact of data and technology.”Finally, climate change and the pressure to reduce carbon emission are driving shifts in the business world."
  },
  {
    "headline": "Nigeria needs change of trade approach to create wealth",
    "summarized_story": "“If we got 10 companies in Nigeria and asked them to produce for the international community, it would translate to higher foreign exchange earnings for Nigeria and create more wealth locally,” Okiti said.\nPresident Muhammadu Buhari is keen to grow the economy and create wealth for the vast majority of Nigerians through agriculture after many years of oil dependence.\nNo country in recent decades has achieved economic success, in terms of substantial increases in living standards for its people, without being open to the rest of the world,” the IMF said.\nNigeria needs to boost economic growth and improve living standards now more than ever.\nThe first contraction was caused by a sharp decline in oil prices, while the second was induced by the COVID-19 pandemic which yet again caused a sharp dip in oil prices."
  },
  {
    "headline": "Cash-strapped states’ IGR can increase on compulsory insurance",
    "summarized_story": "States seeking to increase internally generated revenue (IGR) amid falling monthly allocations from the federation account can achieve it by domesticating the implementation of different compulsory insurances.\nWhile the states will earn IGR from the exercise, its citizens are offered risks management protections the different compulsory insurances offer, he states.\nRead Also: NAICOM’s drive to protect Nigerian publics through compulsory insurance gains tractionCompulsory insurance, according to the Nigerian insurance journal, is important because it secures the benefits of insurance to average citizens that would not normally benefit.\nCompulsory insurance focuses on protecting third-party workers by providing compensation in the event of injury, property damage, or death during work.\nThe different compulsory insurances as listed by NAICOM include – Third party Motor Insurance, Group Life insurance, health care professional indemnity insurance, occupiers liability insurance or insurance of public buildings, and builders liability insurance or insurance of buildings under construction."
  },
  {
    "headline": "We’re adapting to new global trends amid Covid-19 – PTI principal – Nigerian Observer",
    "summarized_story": "Dr. Adimula stated this in Warri on Tuesday during a press conference which was part of activities marking this year’s convocation ceremony coming up on Saturday, 23rd October, 2021.\nHe further stated that out of the number, 161 passed with Distinctions, while 810 graduated with Upper Credit.\nHe lauded the PTI Alumni for their immense contributions to the PTI project.\nOn collaborations, Dr. Adimula further said that PTI was collaborating with both national and international bodies in the energy and power sectors in realizing the vision of the Institute.\nHe, however, said the Institute was grossly under-funded as a result of the COVID-19 pandemic and the dwindling oil prices."
  },
  {
    "headline": "Obaseki, French govt partner to train 3,000 youths in creative sector – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki and the French Government have strengthened partnership to train not less than 3,000 youths in the creative and entertainment industry.\nDignitaries at the meeting include the Chief Executive Officer of Wazobia TV, Tatiana Moussalli Nouri and filmmaker, Stanlee Ohikuare, among others.\nDare said: “The meeting was to further discuss the partnership, which has been on for nine months.\n“Edo people between the ages of 16 and above are eligible to have access to these trainings,” she added.\nThe EdoJobsSkillUp app is a digital learning platform designed for creatives in the creative industry."
  },
  {
    "headline": "EndSARS Anniversary Protest: 33 Arrested Protesters Regain Freedom In Lagos – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – No fewer than 33 people arrested by the Lagos Police Command allegedly to have participated in the Wednesday Endsars anniversary protect at Lekki Toll gate have been set free by the security agency.\nOut of the 33 released by the law enforcement agency, 26 were said to have been picked at the Lekki Tollgate while seven others were apprehended by security agencies around Onikan axis of the state.\nIt is important for me to mention that we set up a panel after the protest last year.\nThe statement reads: “Indeed struggle pays as CP HAKEEM ODUMOSU, the Commissioner of Police of Lagos State bowed to pressure and released 33 peaceful protesters arrested at the Lekki Toll Gate.\nThe “Lekki 33” , as additional 7 persons were brought from Onikan to join the Panti 26 , were eventually released by 12pm midnight, 20th October, 2021."
  },
  {
    "headline": "‘Obaseki’s agric programmes’ll increase food production, address rising food prices, grow economy’ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has restated that the programmes and interventions of the Governor Godwin Obaseki-led administration in the agricultural sector will reset the state’s economy, increase food production and address rising food prices.\nAccording to him, “the Edo State Government has zero tolerance for hunger and is irrevocably committed to improving the livelihood of its people through the fight against hunger, poverty and malnutrition amongst its citizenry.\n“This year, a total of 444 hectares have been cultivated for rice grain production at Agenebode, Warraproductionke and Agbede.\nThe catfish production component of the programme is ongoing with the training and empowerment of 329 farmers producing over 400,000 catfish.\nThis involves the provision of production infrastructure and assets, including inputs,” he added."
  },
  {
    "headline": "National Convention: PDP disqualifies three aspirants",
    "summarized_story": "The Peoples Democratic Party (PDP) Screening Committee has disqualified three aspirants from participating in the national convention slated for October 30 and 31.\nThe Chairman of the Convention Committee, Governor Ahmadu Fintiri of Adamawa State, disclosed this during the unveiling of the party’s national convention logo and promotional materials on Thursday in Abuja.\nMr Oladipo was vying for the position of deputy national chairman (south), while Messrs Muo-Aroh and Olafeso were eyeing the positions of national secretary and national publicity secretary, respectively.\nIn his remarks, the PDP National Publicity Secretary, Kola Ologbondiyan, said the 2021 national convention committee led by Mr Fintiri was prepared to hold a convention that would lead PDP to victory in the 2023 general elections.\nMr Ologbondiyan, who is also the Secretary of the National Convention Publicity Sub-Committee, said the national convention of PDP presents an opportunity to Nigerians to come together and support the party in 2023."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "IPOB condemns killings of monarchs in Imo",
    "summarized_story": "The Indigenous People of Biafra (IPOB), has condemned the killing of monarchs and other innocent citizens in Imo State, South-East zone of Nigeria.\nRecall that two traditional rulers were killed when a group of hoodlums invaded a meeting venue in Imo State, on Tuesday, while others sustained varying degrees of injuries.\nAccording to it, the idea of attributing the killings and other criminalities in the state, to its security arm, the Eastern Security Network, had become worrisome.\n“It’s unfortunate that unformed and gullible citizens in Imo state will tomorrow begin to blame these killings to IPOB, IPOB has no issue with these dead Ezes because they are the custodians of our land and anybody who is linking these killings perpetrated in Imo State by Hope Uzodinma boys whom he organised to deal with his political opponents in Imo State.\nWe beg Hope Uzodinma to allow our people because we don’t know Fulani people know him and planted him in Imo State.”"
  },
  {
    "headline": "PZ Cussons grows PAT by 124% in 2020",
    "summarized_story": "PZ Cussons Nigeria Plc released its consolidated financial statements for the year ended 31st of May, 2021, growing profit after tax by 124% to N1.7 billion.\nOther highlights of the results showed that revenue for the period was N82.6 billion.\n(+19.3% YoY)An operating profit of N1.19 billion was generated.\nProfit after tax was N1.7 billion.\n(+124% YoY)Earnings per share of 37 kobo (+121% YoY)."
  },
  {
    "headline": "IATF2021: Cost of not attending will be huge – Afreximbank",
    "summarized_story": "The trade fair is one of the initiatives that the Intra-African Trade is working on.\nThe trade fair, Kanayo said, is not an end in itself but a means to an end.\n“In fact, in the times of recession, you should be heading for a trade fair to be able to stimulate your businesses.\nSoon after the trade fair he was acquired by the Singapore Government and he’s now doing drones for agriculture in Singapore.\nI think Nigerians should take advantage of it, because the cost of not attending will be huge.”"
  },
  {
    "headline": "IMF projects Nigeria’s economy to grow by 2.7% in 2022",
    "summarized_story": "The International Monetary Fund (IMF), has projected Nigeria’s economy to grow by 2.7 percent in 2022 and 2.6 per cent growth for this year, citing recovery in non oil sectors and rising price of crude oil.\nThe Bretton Woods institution also projected that the Sub-Saharan economy will grow by 3.8 per in 2022 and by 3.7 per cent this year.\nThe IMF made these projections today in it’s latest Regional Economic Outlook for Sub-Saharan African Economy released at the sidelines of the ongoing Annual Meetings of the IMF and World Bank in Washington.\nThe IMF said: “Nigeria’s economy will grow by 2.6 percent in 2021, driven by recovery in non-oil sectors and higher oil prices, even though oil production is expected to remain below pre-COVID-19 levels.\n“But the recovery is expected to be slower than in advanced economies, leading to a widening rift in incomes."
  },
  {
    "headline": "72 Lawyers Elevated To Rank Of SAN",
    "summarized_story": "Legal Practitioners and Privileges Committee (LPPC) has announced the names of 72 lawyers elevated to the rank of Senior Advocate of Nigeria (SAN).\nThe 72 candidates emerged successful from a total of 130 shortlisted for the award last month by the LPPC.\nHowever, after the screening and interviews, only 62 were successful from the Advocates category and 10 from the Academics.\nThe successful candidates would, however, be conferred with the rank of SAN on December 8, 2021 at the Supreme Court by the Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad.\nThose from the Advocates category are George Anuga, Deputy Commissioner of Police (DCP); Simon Lough, Ayo Olorunfemi, Ehigie West-Idahosa and Reuben Atabo, amongst others."
  },
  {
    "headline": "72 Lawyers Elevated To Rank Of SAN",
    "summarized_story": "Legal Practitioners and Privileges Committee (LPPC) has announced the names of 72 lawyers elevated to the rank of Senior Advocate of Nigeria (SAN).\nThe 72 candidates emerged successful from a total of 130 shortlisted for the award last month by the LPPC.\nHowever, after the screening and interviews, only 62 were successful from the Advocates category and 10 from the Academics.\nThe successful candidates would, however, be conferred with the rank of SAN on December 8, 2021 at the Supreme Court by the Chief Justice of Nigeria (CJN), Justice Ibrahim Muhammad.\nThose from the Advocates category are George Anuga, Deputy Commissioner of Police (DCP); Simon Lough, Ayo Olorunfemi, Ehigie West-Idahosa and Reuben Atabo, amongst others."
  },
  {
    "headline": "#EndSARS Memorial: Frank Calls For Lagos CP’s Sack Over Arrest Of Protesters",
    "summarized_story": "He called for the immediate release of all #EndSARS detainees held over a year ago and those who were arrested during the memorial procession in Lagos on Wednesday.\nHe also condemned the silence of the President, Major General Muhammadu Buhari (retd.\n), in the face of brutal police aggression against innocent Nigerians exercising their democratic rights to protest against ills in society.\nThe political activist reminded Buhari that police were never used to stop him and members of his party from protesting during his days as an opposition leader.\nFrank also called on the National Assembly to investigate the cases of assaults against peaceful protesters and the media in Lagos by men of the Nigeria Police and other security agencies and bring all erring operatives to book."
  },
  {
    "headline": "#EndSARS Memorial: Frank Calls For Lagos CP’s Sack Over Arrest Of Protesters",
    "summarized_story": "He called for the immediate release of all #EndSARS detainees held over a year ago and those who were arrested during the memorial procession in Lagos on Wednesday.\nHe also condemned the silence of the President, Major General Muhammadu Buhari (retd.\n), in the face of brutal police aggression against innocent Nigerians exercising their democratic rights to protest against ills in society.\nThe political activist reminded Buhari that police were never used to stop him and members of his party from protesting during his days as an opposition leader.\nFrank also called on the National Assembly to investigate the cases of assaults against peaceful protesters and the media in Lagos by men of the Nigeria Police and other security agencies and bring all erring operatives to book."
  },
  {
    "headline": "Group To Partner Anti-graft Agencies Against Corruption",
    "summarized_story": "A group, Association of Public Procurement Practitioners of Nigeria (APPPN) said it will partner the anti-corruption agencies and other relevant institutions to boost the fight against corruption in Nigeria’s public sector.\nThe association disclosed that it was poised to sanitise the procurement process by strict enforcement of the Procurement Act of 2007 by promoting due process, accountability, transparency and value for money in government and private organisationsions.\nThe group further stated that the regularisation of the practice of public procurement in the country to international best practices was critical to national development, insisting that the country’s economy will benefit more when procurement is done with due diligence and transparently.\nHe, however, urged the public not to patronise quacks who are not qualified by law to practice the profession.\nThe Association of Public Procurement Practitioners of Nigeria will also ensure maintenance of standards in public procurement practice across public sector in Nigeria” we are going to showcase what we are doing here in public procurement to the world."
  },
  {
    "headline": "Zuma Makes First Public Appearance Since Release From Prison",
    "summarized_story": "Zuma Makes First Public Appearance Since Release From PrisonZuma Makes First Public Appearance Since Release From PrisonSouth Africa’s ex-president Jacob Zuma on Thursday made his first public appearance since his release from prison on medical parole last month to lay charges against a chief state prosecutor.\nZuma walked into a police station in the eastern city of Pietermaritzburg, where he is on trial for corruption, to open a criminal case against advocating Billy Downer for allegedly leaking his medical records.\nZuma stepped briskly out of his vehicle and up to the building’s entrance surrounded by security personnel, according to AFP reporters at the scene.\nHe was accompanied by one of his daughters and waved to people queueing outside the building as he walked past.\nIn July, Zuma was found guilty of contempt of court for snubbing a separate inquiry into mass looting of public funds during his rule."
  },
  {
    "headline": "Zuma Makes First Public Appearance Since Release From Prison",
    "summarized_story": "Zuma Makes First Public Appearance Since Release From PrisonZuma Makes First Public Appearance Since Release From PrisonSouth Africa’s ex-president Jacob Zuma on Thursday made his first public appearance since his release from prison on medical parole last month to lay charges against a chief state prosecutor.\nZuma walked into a police station in the eastern city of Pietermaritzburg, where he is on trial for corruption, to open a criminal case against advocating Billy Downer for allegedly leaking his medical records.\nZuma stepped briskly out of his vehicle and up to the building’s entrance surrounded by security personnel, according to AFP reporters at the scene.\nHe was accompanied by one of his daughters and waved to people queueing outside the building as he walked past.\nIn July, Zuma was found guilty of contempt of court for snubbing a separate inquiry into mass looting of public funds during his rule."
  },
  {
    "headline": "Hoodlums rape, kill 24-year-old graduate in Benue",
    "summarized_story": "A 24-year-old lady, Joy Onoh, was on Wednesday murdered by some hoodlums in Makurdi, the Benue State capital.\nThe lady, a graduate of Mass Communication from the Benue State University awaiting call up from the National Youth Service Corps, was allegedly raped and killed at North Bank Area of Makurdi.\nShe was said to have received a call from someone to come to a particular place at North Bank, a suburb of Makurdi to supply clothes.\n“Joy left home on Tuesday to deliver Turtle Neck cloth to some persons at Federal Housing, North Bank.\n“She was called to deliver goods at Federal Housing North Bank Makurdi and we later discovered her corpse in a bush."
  },
  {
    "headline": "Hoodlums rape, kill 24-year-old graduate in Benue",
    "summarized_story": "A 24-year-old lady, Joy Onoh, was on Wednesday murdered by some hoodlums in Makurdi, the Benue State capital.\nThe lady, a graduate of Mass Communication from the Benue State University awaiting call up from the National Youth Service Corps, was allegedly raped and killed at North Bank Area of Makurdi.\nShe was said to have received a call from someone to come to a particular place at North Bank, a suburb of Makurdi to supply clothes.\n“Joy left home on Tuesday to deliver Turtle Neck cloth to some persons at Federal Housing, North Bank.\n“She was called to deliver goods at Federal Housing North Bank Makurdi and we later discovered her corpse in a bush."
  },
  {
    "headline": "NRC suspends Abuja-Kaduna train services, mum on terrorists attack",
    "summarized_story": "By Lucy Ogalue/AbujaThe Nigeria Railway Corporation (NRC) has suspended indefinitely train services along the Abuja-Kaduna route.\nP.M.News reported today that terrorists shot at the locomotive of the train on Wednesday night.\n“The board and management of the NRC hereby inform the general public, particularly our valued passengers on Abuja-Kaduna Train Service that there was explosion on the rail track.\n“The NRC intends to resume train services soonest, after appropriate measures, checks and maintenance are carried out“, the statement said.\nMr Paschal Nnorli, Manager of the Abuja-Kaduna Train Service (AKTS) had earlier told the News Agency of Nigeria (NAN) that measures were already in place to address the issue and resume services accordingly."
  },
  {
    "headline": "Lagos trains 30,000 public servants in 10 months",
    "summarized_story": "The Lagos State Government on Thursday disclosed that it has trained over 30,000 public servants since the beginning of this year.\nPonnle revealed that about 28,000 public servants have benefitted from online courses while 2,500 have had physical (face-to-face) training, stating that the figure excludes those involved in micro learning Webinar series.\nShe declaring that the figure was unprecedented and marked a watershed in the training administration in Lagos State, adding that it represented a dramatic shift from the previous arrangement where only 3,000 public servants were trained in four years.\nShe pointed out that the intention was to drive radical change in the public sector to address capacity deficit, enhance efficiency and competence among civil servants.\nFor us, it is really a game changer, and I think the beauty of the process is also that we are able to mandate public servants to do certain courses,” she said."
  },
  {
    "headline": "BREAKING: Gunmen set Imo police station ablaze, free suspects",
    "summarized_story": "Hoodlums on Thursday night set the Isiala Mbano Local Government Area Divisional Police Headquarters in Imo state, situated at Umuelemai on fire.\nThe gun-carrying hoodlums who set the suspects free struck amidst a downpour.\nThe attackers struck before 7 pm.\nFleeing gunmen had on March 19, set the same Divisional Police Headquarters on fire.\nApart from freeing suspects in detention, the attackers kidnapped one of the female cops on duty on that day."
  },
  {
    "headline": "JUST IN: One Kidnapped As Bandits Invade Ex-Zamfara Gov’s Residence",
    "summarized_story": "Abdulaziz Yari, the former governor of Zamfara State, has had a relative kidnapped by bandits.\nNEWS DIRECT discovered Auwal Hussain, Yari’s brother-in-law, was kidnapped during an infiltration of his home in Talata Marafa.\nHussain and a neighbor were kidnapped by motorcycle-riding thugs on Monday night, but the news didn’t get out until Thursday evening.\nThe criminals invaded the area around 11:30 p.m., shooting intermittently to scare inhabitants away, according to a local.\n“We heard when the bandits came in the night."
  },
  {
    "headline": "Nnamdi Kanu: Soldiers Kill Five IPOB Members In Abia",
    "summarized_story": "Five members of the proscribed Indigenous People of Biafra (IPOB) were killed by the Nigerian Army in the Arochukwu area of Abia State’s Arochukwu Local Government Area.\nThe IPOB members were murdered on Thursday, according to a source, following a gunfight with soldiers near the community’s monarch’s palace.\nHe claimed IPOB members were enforcing the sit-at-home order they proclaimed in protest of Nnamdi Kanu’s unjust imprisonment.\nHe went on to say that IPOB members, who were equally overjoyed that Kanu was alive, contrary to rumours to the contrary, marched in the streets.\nWhen the IPOB members arrived near the town’s First Bank axis, they engaged the soldiers in a gunfight, but five of them surrendered to the military’ superior firepower."
  },
  {
    "headline": "Sit-at-Home Order: Hoodlums Burn Truck, Shop In Enugu To Enforce Compliance",
    "summarized_story": "Hoodlums enforcing the sit-at-home directive given by the Indigenous People of Biafra (IPOB) have razed a truck in Enugu state.\nThe sit-at-home order declared by IPOB in the South-East region was in solidarity with the leader, Nnamdi Kanu who appeared before Justice Binta Nyako at the Federal High Court in Abuja on Thursday.\nThe hoodlums burnt a shop and a truck as they enforced the order at Eke — Obinagu suburb along the Enugu-Abakaliki Expressway in the Enugu East Council Area of the state, The Punch reports.\nAlso according to the newspaper, the shop said to be stocked with provisions was burnt while the truck said to belong to CHISCO Company was burnt to its engine.\nMeanwhile, roads and streets in the state were deserted as residents observed the sit-at-home order."
  },
  {
    "headline": "Pictures: Aftermath of how suspected bandits attacked moving train with passengers along Abuja-Kaduna route",
    "summarized_story": ""
  },
  {
    "headline": "Breaking: Reps summon NBBF, clear ministry over athletes’ Olympics eligibility, D’Tigress pay (PICTURES)",
    "summarized_story": "The House of Representatives committee on sports on Thursday summoned former President of Nigeria Basketball Federation (NBBF) over embarrassing non-payment of allowances due Nigeria’s D’Tigresses.\nOne after the other, D’Tigress players have in the past weeks accused NBBF of not releasing payments due them for some years now.\nTo this end, the Reps committee thereafter summoned Kida to appear before it within two weeks.\nThis money came in during the Olympics and was deposited into the NBBF’s CBN account.\n“Prior to now, the CBN have been instructed to process payment of the 12 female team members as first trench payment."
  },
  {
    "headline": "VIDEO: Watch as Nollywood actor, Charles Okocha, destroys daughter’s boyfriend’s car",
    "summarized_story": ""
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Rubber stamp 9th assembly would approve Buhari’s third term if… – Wabara -NigPilot",
    "summarized_story": "Former president of the Senate, Adolphus Wabara Thursday hinted that the present 9th National Assembly would have approved an unconstitutional third term for President Muhammadu Buhari if he had insisted on going for it.\nWabara spoke Thursday in Abuja as a special guest at the public presentation of the book: “Standing Strong”, authored by former president of the Senate, Ken Nnamani.\nThe former Senate president who stepped down under intense pressure in the 5th assembly thanked President Muhammadu Buhari for standing strong against the pressure from certain quarters for him to seek a third term.\nHe eulogized the author, Sen. Ken Nnamani who he described as uncommon patriot and nationalist who stood strong in the face of pressure from the political lackeys of former president Olusegun Obasanjo who were bent on smuggling the third term agenda into the constitution through a backdoor.\nAlso speaking at the event, former Minister of defence, Theophilus Danjuma while commending the author, described the book as a text book for young Nigerians who are aspiring to lead a “difficult nation like Nigeria.”"
  },
  {
    "headline": "How we use live telecast to scuttle Obj’s 3rd term plot – Nnamani -NigPilot",
    "summarized_story": "” Publicizing the proceedings was faulted by those who wanted to smuggle into the constitution the extension of tenure through undefined and darken proceedings.\n” The knew that if we isolate Nigerians from the proceedings and therefore reduce public pressure on the legislators, it could be possible to ram through with their agenda.\nBut I stood strong.\nThe principal officers of the National Assembly stood strong.\nTo take it beyond doubt, I called for votes a second time."
  },
  {
    "headline": "Access Bank, Xploits Consulting organise workshop on drugs abuse, illicit trafficking to curb menace amongst students -NigPilot",
    "summarized_story": "On the need to fight against the menace of drug abuse in the country and to safeguard the lives of the growing generation, Access Bank Plc in collaboration with Xploits Consulting Ltd has organized a drug abuse and illicit trafficking workshop for students in the Federal Capital Territory, FCT and Nasarawa State.\nAddressing the students during the workshop, Director of Communications, Xploits Consulting Ltd, Mrs. Grace Taiwo said that the issue of drug addiction was eating deep into society especially among young adults.\nMr Nduka advised the students to stay away from drugs as it can lead to jail terms or death.\nAppreciating the efforts of Access bank Plc and Xploits Consulting Ltd, Principal of Babcecil Schools, New Karu Mr. Oliver Onoja said the lecture was timely as drug abuse was the in-thing for young adults.\nAlso, Miss Angela Anajendu of Capville Group of schools, Dawaki thanked the facilitators and sponsors for educating them on the dangers of drug abuse."
  },
  {
    "headline": "Attack on Abuja-Kaduna Train despicable, APC reacts -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "30 Students Abducted From Kebbi School Regain Freedom After Four Months",
    "summarized_story": "Thirty students abducted from the Federal Government College, Birnin Yauri in Kebbi State have regained freedom.\nThis comes four months after bandits stormed the school and kidnapped an unspecified number of students and four teachers.\nMr Yahaya Sarki, who is the Special Adviser on Media to Governor Atiku Bagudu of Kebbi, confirmed the release of the students in a statement on Thursday.\nREAD ALSO: Gunmen Abduct Students From Federal Government College In Kebbi“They shall undergo medical screening and support while being reunited with their families.\nOn June 17, Channels Television reported the attack on the school during which the assailants killed a police officer guarding the school."
  },
  {
    "headline": "Anambra Polls: Ensure No Group, Individual Stirs Chaos – Buhari Directs Security Agencies",
    "summarized_story": "President Muhammadu Buhari has directed the Nigerian Armed Forces and law enforcement agencies to ensure that no group or individual is allowed to stimulate anarchy and chaos in Anambra State.\nAccording to the president, peace must be maintained in Anambra, even if it requires dominating the state ahead of the governorship election scheduled for November 6.\nThe National Security Adviser (NSA), Babagana Monguno, disclosed this after a security meeting presided by President Buhari at the State House on Thursday.\nBefore the briefing by his cabinet members, President Buhari presided over a security meeting with the nation’s service chiefs and heads of intelligence agencies.\nThe Chief of Defence Staff, General Lucky Irabor, led the Chief of Army Staff, Lieutenant General Farouk Yahaya; Chief of Naval Staff, Vice Admiral Awwal Zubairu Gambo, and other security chiefs to the meeting."
  },
  {
    "headline": "Bomb Explosion Forces Suspension Of Train Services On Kaduna-Abuja Route",
    "summarized_story": "The Nigeria Railway Corporation (NRC) has suspended train services on the Kaduna-Abuja route following the bombing of the rail tracks.\nYet-to-be-identified persons had bombed a portion of the rail track on the Kaduna end during an attack on Wednesday night.\n“Yesternight, bandits attacked the Kaduna-Abuja train,” Senator Sani said in a Facebook post on Thursday.\n“They planted an explosive that damaged the rail track and shattered the windshield of the train engine.\nThe train nearly skidded off its track, then we miraculously escaped.”He advised authorities to suspend all train operations on the Kaduna-Abuja route until the issue was properly addressed."
  },
  {
    "headline": "Nnamdi Kanu Pleads Not Guilty To FG’s Amended Charges",
    "summarized_story": "The embattled leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu, has pleaded not guilty to the seven amended charges preferred against him by the Federal Government.\nKanu, who was re-arraigned at the Federal High Court in Abuja on Thursday, said he was innocent of all the allegations levelled against him.\nThe Federal Government recently amended the charges against him raising them to seven counts as against the five counts he was previously being tried for.\nREAD ALSO: Nnamdi Kanu Brought To Court For Trial Amid Heavy SecurityJournalists were denied entry into the courtroom where Kanu’s case was heard.\nMeanwhile, a source inside the courtroom, notified court reporters that the embattled IPOB leader took his fresh plea to the seven amended charges at about 10:45 am."
  },
  {
    "headline": "Doctor Confirms Defilement Of Minor In Baba Ijesha’s Case",
    "summarized_story": "The testimony was given at the proceedings on Thursday by another prosecution witness and a medical practitioner, Dr Aneikan Makanjuola.\nShe gave evidence before Justice Toyin Taiwo in the alleged sexual assault charge brought against Baba Ijesha by the Lagos State government.\n“She was sent for psychological assessment and we gave a report of our findings and examinations.\nI authenticated the report as head of clinical services and sent it to State CID, Panti.”The witness said the examination of the victim was conducted by medical personnel and a psychologist.\nAfter listening to Makanjuola’s testimony, Justice Taiwo adjourned the further hearing of the case until November 5 and 12."
  },
  {
    "headline": "Bandits attack Kaduna bound passenger train, plant explosive on rail track -",
    "summarized_story": "Officials of the agency disclosed to TVC News that the decision is temporary as plans are underway to holistically to review the situation.\nNigeria Railway Service has suspended the Abuja-Kaduna train service after a gun attack on a Kaduna bound passenger train and planting of explosive on the rail track by suspected bandits on Wednesday.\nRecent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided.\nArchives Archives Select Month October 2021 (364) September 2021 (546) August 2021 (544) July 2021 (519) June 2021 (603) May 2021 (614) April 2021 (693) March 2021 (769) February 2021 (685) January 2021 (770) December 2020 (677) November 2020 (609) October 2020 (507) September 2020 (780) August 2020 (768) July 2020 (735) June 2020 (682) May 2020 (532) April 2020 (530) March 2020 (456) February 2020 (486) January 2020 (656) December 2019 (705) November 2019 (650) October 2019 (607) September 2019 (574) August 2019 (631) July 2019 (719) June 2019 (747) May 2019 (908) April 2019 (620) March 2019 (516) February 2019 (528) January 2019 (561) December 2018 (492) November 2018 (583) October 2018 (616) September 2018 (568) August 2018 (585) July 2018 (500) June 2018 (437) May 2018 (408) April 2018 (430) March 2018 (510) February 2018 (547) January 2018 (550) December 2017 (291) November 2017 (498) October 2017 (715) September 2017 (675) August 2017 (689) July 2017 (671) June 2017 (679) May 2017 (987) April 2017 (1042) March 2017 (1141) February 2017 (676) January 2017 (612) December 2016 (596) November 2016 (571) October 2016 (639) September 2016 (162) March 2016 (39) May 2015 (1)Categories Categories Select Category #AnambraVotes (15) #Ekiti2018 (25) #EkitiVotes (14) #LagosBuildingCollapse (2) #LiberiaRunOff (6) #OsunDebate (5) #OsunVotes (29) America (554) Asia (279) Athletics (113) Basketball (44) Boxing (69) Breaking News (118) Business News (5,396) Central Africa (85) East Africa (179) Election 2019 (26) Entertainment News (703) Europe (405) Events (16) Fashion (5) fashion & style (15) Featured (533) Football (1,584) Formula 1 (19) Golf (15) Health News (2,199) inside lagos (1) International (7,153) Kogi Election (10) labour lens (5) Lassa Fever & Coronavirus (18) Latest News (25,594) Africa (363) West Africa (184) Livestream (3) Metro (25) Middle East (174) Movies (31) Music (74) Nigeria News (21,247) Nollywood (34) Non classifié(e) (1) North Africa (175) Politics News (5,604) #EdoDecides (22) #LagosCouncilElections (4) #NigeriaVotes (240) #OndoDecides (100) Bayelsa Election (7) nnamdi kalu (9) Presidential Election (45) Science & Technology (8) Shows (2) Southern Africa (173) Sports News (3,412) Table Tennis (20) Tech (22) Tennis (111) the platform (1) Top Stories (38) U-Report (5) Uncategorized (283) VIDEO (1,201) Business Nigeria (3) Business Week (2) Community Forum (11) Crime Watch (102) Fireworks (13) Green Angle (4) Journalists Hangout (106) News at 10 PM (23) Special Reports (112) Sports Debate (32) Sports Desk (3) Standpoint (1) The Big Issue (4) The Sunday Interview (108) This Morning (85) TVC Breakfast (831) TVC Investigates (6) Wildlife (5) World News (2,040)"
  },
  {
    "headline": "Ogun Police parade 24 suspects, recover ammunition",
    "summarized_story": "The Ogun state police command has paraded about twenty four suspected criminals for different offences including six suspected hoodlums arrested during the state congress of the All Progressives Congress in Abeokuta.\nParading the suspects at Eleweran, the police state headquarters, the commissioner of police, Lanre Bankole said they were arrested with prohibited arms and ammunition.\nHe said items recovered from the suspects include one English Barreta Pistol, live ammunition, noting that the suspects would be arraigned in a competent court of jurisdiction after investigations have been completed"
  },
  {
    "headline": "Just In: Sanwo-Olu promises to make EndSARS Panel report public -",
    "summarized_story": "Lagos State governor, Babajide Sanwo-Olu, has pledged to make the Report of the Judicial Panel of Inquiry and Restitution for Victims of Endsars public when received.\nThe governor said this at the 10th Meeting of the National Council on Lands, Housing and Urban Development in LagosThe panel of inquiry concluded its sitting on Monday one year after its inauguration by the state governor."
  },
  {
    "headline": "Gov Lalong presents N160bn 2022 Appropriation bill to Plateau Assembly -",
    "summarized_story": "The Plateau State Governor, Simon Lalong has presented a budget of over one hundred and Six billion Naira to the state House of assembly.\nThe appropriation bill is for the 2022 fiscal year."
  },
  {
    "headline": "NFF Re-instates Salisu Yusuf as Super Eagles’ Assistant Coach",
    "summarized_story": "The Executive Committee of Nigeria Football Federation has approved the re-instatement of Coach Salisu Yusuf to his position as Assistant Coach of the Super Eagles and Head Coach of the Super Eagles B team, with effect from 1st November 2021.\nQualification for the AWCON is non-negotiable,” Oshoala said as the squad met with President of Nigeria Football Federation, Mr Amaju Melvin Pinnick and the General Secretary, Dr Mohammed Sanusi after Wednesday’s encounter.\nThe Confederation of African Football has appointed Ivorian officials to superintend Sunday’s clash in Accra between Nigeria and Ghana.\nZomadre Sonia Kore will be the referee, with her compatriots Denise Akoua (assistant referee 1) and Ndeko Edwige Appia (assistant referee 2) also in action.\nBeatrice Gouchoedou from Benin Republic will be fourth official and Latré-Kayi Lawson-Hogban from Togo will serve as match commissioner."
  },
  {
    "headline": "Nigeria: Bandits Attack Kaduna-Abuja Train",
    "summarized_story": "The Kaduna – Abuja train service was reportedly attacked on Thursday morning.\nSenator Shehu Sani who was on board the Abuja bound train, said passengers miraculously escaped death.\nAll Kaduna -Abuja train operations need to be suspended for today until this issue is addressed”, he said.\nHe attributed the incident to activities of suspected vandals, saying investigation to unravel the incident was underway.\nHe added the track was destroyed by suspected vandals as vandalism of the NRC facilities have been on the increase in recent times."
  },
  {
    "headline": "Chinese Envoy Urges Nigerian Political Parties to Learn from Communist",
    "summarized_story": "The Chinese Ambassador to Nigeria, Cui Jianchun has asked political parties to learn from Communist Party of China by making the well-being of Nigerians their priority.\nThe Ambassador said the CPC was chosen by history and the people.\nNowadays, the CPC is rallying and leading the Chinese people on a new journey toward realizing the second centenary goal of building China into a great modern socialist country in all respects.\nIt is not all rosy with China, we have our challenges.\nThe Actor of the book, Charles Onunaiju said there are definitely lessons for Nigeria from China experience, he said Nigeria need not take the Chinese way but need to fashion out Nigerian way to the very top."
  },
  {
    "headline": "Eight South Africa-based Nigerians Charged in US with Internet Scams, Money Laundering",
    "summarized_story": "Eight Nigerian have been charged in New Jersey, United States with conspiring to engage in internet scams and money laundering from South Africa.\nThe Black Axe defendants and other members of Black Axe took part in, and openly discussed, fraud schemes amongst their membership.\nThe conspirators used the bank accounts of victims and individuals with U.S.-based financial accounts to transfer the money to South Africa.\nSeven defendants were arrested in South Africa yesterday by the South African Police Service.\nThose defendants had their initial appearances in South Africa and are awaiting extradition to the United States on these charges."
  },
  {
    "headline": "South Korea Joins Space Race with Launch of First Homegrown Rocket",
    "summarized_story": "South Korea has conducted the first test launch of its domestically built rocket, joining the ranks of advanced space-faring nations.\nOverseen by the Korea Aerospace Research Institute (KARI), NURI rocket was moved to its launch pad on Wednesday and raised into position.\nSpace launches have long been a sensitive issue on the Korean Peninsula, where North Korea faces sanctions over its nuclear-armed ballistic missile programme.\n“In the next few years, South Korea plans to develop and start operating a series of space launch vehicles from the NARO Space Centre, and these launch vehicles will be putting small vehicles into lower orbit, further increasing South Korea’s space defence capabilities,” he added.\n“Rockets are the only means available to mankind to go out into space,” Lee Sang-ryul, the director of the Korea Aerospace Research Institute, told South Korean newspaper Chosun Biz."
  }
]