[
  {
    "headline": "Lagos car wash operator raped, impregnated me, says 11-year-old mother",
    "summarized_story": "An 11-year-old girl on Tuesday told the Sexual Offences and Domestic Violence Court, Ikeja, Lagos State, how she was allegedly raped and impregnated by a 39-year-old car wash operator, Ezekiel Udoh.\nPUNCH Metro learnt that the incident occurred in the FESTAC Town area of the state in 2020.\nNarrating her ordeal to the court, the victim said Udoh took advantage of her twice.\nShe said, “He (Udoh) sent me to buy something for him and when I returned, he told me to take it upstairs.\n“We asked her and she said it’s a brother at the car wash. She also did not know his name."
  },
  {
    "headline": "Cartoon: Is this The Apple?",
    "summarized_story": "Cartoon: Is this The Apple?"
  },
  {
    "headline": "Anxiety envelopes Ondo community over terrorists attack",
    "summarized_story": "— Varsity, Monarch, Police describe attack letter as fakeDayo Johnson,.\nAkurePalpable fear and anxiety gripped residents of llara- Mokin, in Ifedore council area of Ondo state over alleged letter written by terrorists to attack the university Community.\nElizade University owned by the chairman of Toyota, Chief Michael Ade- Ojo is situated in the agarian community.\nAdegbenro in a statement said that “As Management, it is important to clarify that no threat was issued by Bandits/Fulani Herdsmen to attack the community.\n“The Ondo State Command of the Nigeria Police Force has also clarified that no threat was issued by Banditc/Fulani Herdsmen to attack any community in the State."
  },
  {
    "headline": "Academic activities paralyse in Adeyemi College, as lecturers threaten to extend warning strike",
    "summarized_story": "Dayo Johnson, AkureThe four weeks warning strike embarked upon by the National leadership of the College of Education Academic Staff Union (COEASU) has paralyse academic activities in Adeyemi College of Education, ACE, Ondo, in Ondo state.\nLeadership of COEASU at Adeyemi College of Education have again threatened to extend the four week warning strike if government failed to attend to their demands.\n“Over the years, the Colleges of Education system, the incontrovertible hub of Teacher Education and by extension the bedrock of the nation’s education system, has suffered wanton abandonment by the Federal Government.\n“This neglect has gradually culminated in aggravated decay of infrastructures in the Colleges of Education System.\nFurthermore, based on poor conditions of service, the sector has also witnessed monumental academic staff attrition without significant effort by Government for their replacement."
  },
  {
    "headline": "Masari launches disbursement of N2.1b grant to improve schools in Katsina",
    "summarized_story": "Speaking at the flag-off, Governor Masari said the funds shall be disbursed in two tranches to each school after reaching progress level and certification by the technical monitors.\nIt is a project for Katsina State.\nHe said, “all primary 6 pupils from these pilot schools now transit automatically to JSS since the classes are now at the next door within the same premises.\nIn addition to continue learning, the strategy has also reduced stress by some of the students who do trek between 5 to 10 kilometres to attend secondary schools in other locations.\n“I am aware the schools are mandated to sign indemnity that the funds shall be utilised for the purpose of improving condition of schools and not otherwise."
  },
  {
    "headline": "Osun 2022: PDP determined to reclaim state— Okowa",
    "summarized_story": "By Johnbosco Agbakwuru, AbujaTHE Delta State Governor and Vice-Presidential Candidate of the Peoples Democratic Party, PDP, Senator Ifeanyi Okowa, has said that the party is poised to take back the governorship seat in the July 16 Osun State election.\nFielding question on how prepared his party, the PDP was in the forthcoming Osun governorship election, ,he said “A lot is being done.\nWe agree that they are the government in power in that state but they will be definitely expecting a very stiff competition from us.\nHe said, “I think they need critical thinking because you have to also be in a position to examine the recommendations being made.\nAnd when you look at all these issues, it brings a lot of frustration."
  },
  {
    "headline": "ASUU strike: NLC moves to force FG, lecturers to resolve issues immediately",
    "summarized_story": "The Nigeria Labour Congress (NLC), says it will embark on one-day nationwide protest to compel the Federal Government to find immediate resolutions to contending issues with education sector unions.\nThe NLC President, Mr Ayuba Wabba, who stated this during the opening of the Congress’ Central Working Committee (CWC) meeting on Thursday in Abuja, said the move was to call the attention of the Federal Government to resolve the lingering issues immediately.\nWabba expressed sadness over the closure of the country’s tertiary institutions due to unresolved labour disputes between the Federal Government and unions in education.\n“That meeting was called, but from the reports that I have been receiving from all the unions in the education sector, progress has not been made.\n“This is to call the attention of the government to resolve the issues immediately."
  },
  {
    "headline": "PVC: Ikorodu residents call for relocation of INEC office",
    "summarized_story": "Residents of Ikorodu, Lagos State have appealed to the Independent National Electoral Commission (INEC) to relocate its Ikorodu office for easy processing and collection of Permanent Voters Card (PVC).\n“We want to call on our lawmaker to help see to our plight because the distance of INEC office has discouraged lots of people.\nAlso speaking, Mr Azeez Olushugbo, urged INEC to increase their staff strength as more residents were interested in participating in the forthcoming 2023 general elections.\nMrs Olutoyin Aiyeleso, Ikorodu resident INEC officer said their demands could only be possible if the community provided land and built another office for their operation.\n“The office was built by INEC and we are just members of staff, so we don’t have capacity to move our office to another place,” she said."
  },
  {
    "headline": "Indian man beheaded for ‘blasphemy’, attackers threaten to kill PM Modi",
    "summarized_story": "A man in India, Kanhaiya Lal, has been murdered for alleged blasphemy.\nLal, a tailor was hacked to death inside his shop in Udaipur, a city in the western Indian State of Rajasthan.\nWithin a few minutes, the man cut the tailor on his neck with a cleaver.\nIn Nigeria, a member of a vigilante group in the capital, Abuja, was killed and set on fire for alleged blasphemy.\nOn May 12, Deborah Samuel, a student of Shehu Shagari College of Education in Sokoto, was stoned to death and burned for “blasphemy”."
  },
  {
    "headline": "Insecurity: ICSAN backs state policing",
    "summarized_story": "The Institute of Chartered Secretaries and Administrators of Nigeria (ICSAN) has backed a decentralised policing system for proper grassroots security to stem the tide of insecurity in the country.\nICSAN President, Mr Gbenga Owokalade, made the assertion at the institute’s news conference on Thursday in Lagos.\nOwokalade, who described the nation’s insecurity challenges as overwhelming, said that the state-owned policing system would adequately manage the country’s entire geographical locations and tackle the rising insecurity.\nHe urged the Federal Government to create templates that would make it easier for states to manage their own policing systems.\n“Nigeria is mature enough to have state policing and we should be bold enough to allow states to have their own security apparatus if we say we are a federal structure which allows us to replicate structures at all levels."
  },
  {
    "headline": "Tension in Ondo over alleged plan by bandits to attack community",
    "summarized_story": "Tension engulfed communities, towns and cities in Ondo State on Thursday following the rumour that bandits were preparing to attack Ilara-Mokin community in the Ifedore Local Government Area of the state.\nThe apprehension among residents was hinged on a rumoured letter allegedly sent to Adaba FM, a popular radio station in the state over plans by bandits to launch an attack in the community.\nThe institution claimed that the supposed rumor had been debunked by the appropriate authorities, therefore the university community should disregard the threat.\n“The originators of the information claimed that the purported letter was submitted to Adaba FM, Ilara-Mokin.\n“As management, it is important to clarify that no threat was issued by Bandits/Fulani Herdsmen to attack the community."
  },
  {
    "headline": "JUST IN: Buhari re-appoints Oniha as DMO Boss The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari has approved the re-appointment of Patience Oniha as Director-General of the Debt Management Office (DMO) for a second term of 5 years.\nThis is in accordance to Section IV (9-i) of the Debt Management Office (Establishment ETC) Act, 2003.\n“Her appointment for a second term was based on the significant achievements recorded by the DMO in the last 5 years, under her leadership.\n“Amongst the achievements are the introduction of Sukuk and Green Bonds to finance the development of infrastructure where there is a huge gap.\n“Internally, Oniha introduced reforms to strengthen the DMO, as a critical agency in the public finance ecosystem of the country”, the statement said."
  },
  {
    "headline": "Hajj: 10,000 remaining Nigerian pilgrims to be airlifted before Monday",
    "summarized_story": "About 10,000 remaining Nigerian pilgrims billed to perform this year’s Hajj would be airlifted on or before Monday to the Kingdom of Saudi Arabia, it was learnt on Thursday.\nHassan said that all necessary arrangements have been made to ensure that no registered pilgrim is left out of this year’s Hajj exercise.\nHe said over 20,000 Nigerian pilgrims are already in Saudi Arabia, adding that some airlines involved in the airlift have added additional aircraft to make the airlift seamless.\n“The aircrafts were ready but the pilgrims were not as ready.\n“It is about Nigerian pilgrims."
  },
  {
    "headline": "Osun Decides: Oyetola’s re-election ordained by God — APC elders The Nation Newspaper",
    "summarized_story": "The Elders’ Caucus of the All Progressives Congress (APC), Osun State, pioneered by the first interim chairman of the party and former governor, Chief Bisi Akande has said the reelection of Governor Adegboyega Oyetola has been ordained by God.\n“God backed Oyetola in the first term and we are certain that his reelection during 2022 governorship election slated for July 16th has been ordained.\n“We appreciate all steps and activities undertaking by the Governor towards ensuring quick transformation of our State through his numerous developmental projects spread across the State.\n“We enjoined residents to continue to give their support towards re-election of Oyetola on July 16.\nLet us troop out to vote for re-election of Governor Gboyega Oyetola.”"
  },
  {
    "headline": "Corruption: EFCC expresses worry over declining number of whistleblowers The Nation Newspaper",
    "summarized_story": "The Economic Financial Crime Commission (EFCC) has expressed worry over the declining number of whistleblowers across the country inspite rewards offered to informants.\nThe programme, which was supported by the MacArthur Foundation in collaboration with Anambra Civil Society Network (ACSONET), had the theme “Role of Community-Based Organisations in Entrenching Whistleblowing Policy at the Grassroots^.\nBawa, who was represented by Mr Oshodi Johnson, Enugu Zonal Commander, EFCC, said the whistleblowing policy had helped the agency to recover huge stolen public funds across the country.\nIn his remarks, Mr Chris Azor, Chairman, ACSONET, urged EFCC and ICPC to establish their offices in Anambra state to aid easy access to Whistle-blowers.\nEarlier, Dr Chido Onumah, Coordinator, AFRICMIL, said that whistleblowing policy had proved to be the most direct method of exposing corrupt acts."
  },
  {
    "headline": "Diversify, increase your trade volume into Nigeria, Buhari tells Portugal The Nation Newspaper",
    "summarized_story": "President Buhari made the call on Thursday in Lisbon, while speaking at an Economic Seminar between Nigeria and Portugal businesses.\n‘‘I am confident after your interactions today on the tremendous potential in Nigeria, we will soon be hearing an announcement on the opening of the Nigeria Portugal Trade Chamber”, he said.\nPresident Buhari thanked President Marcelo Rebelo de Sousa of Portugal, who was present at the Seminar, for his contribution, interest and trust in forging formidable economic cooperation between Nigeria and Portugal.\nIn his response, the President of Portugal, Marcelo Rebelo de Sousa told President Buhari that Portugal can help Nigeria diversify the economy.\nOn the visit, the Portuguese President said, “Your visit is a new beginning, A new beginning of every sector."
  },
  {
    "headline": "INEC issues final warning to parties on deadline for list, particulars of candidates",
    "summarized_story": "From Romanus Ugwu, AbujaIndependent National Electoral Commission (INEC) yesterday, issued July 15 deadline final warning to political parties to upload the lists and personal particulars of their nominated candidates.\nIt also urged the political parties to scrutinise the list and personal particulars of the candidates they propose to sponsor at the election to avoid any mix-up and duplication of names.\nGiving update on uploading of list and particulars of nominated candidates, the commission said: “By the timetable and schedule of activities released by the commission, political parties that conducted valid governorship and state Assembly primaries shall upload the list and personal particulars of their nominated candidates between July 1 and 15, 2022.\n“We urge political parties to scrutinise the list and personal particulars of the candidates they propose to sponsor at the election to avoid any mix-up and duplication of names.\nPolitical parties are advised not to wait until the last day before uploading the list and personal particulars of their candidates."
  },
  {
    "headline": "Proscription: IPOB seeks order of court to amend grounds of appeal",
    "summarized_story": "From Okey Sampson, UmuahiaThe Indigenous People of Biafra (IPOB) is seeking an order of court to amend its notice and grounds of appeal filed on March 6, 2018, at the Court of Appeal, Abuja Division.\nStatement by Aloy Ejimakor, counsel to the leader of IPOB, Nmamdi Kanu, said the pro-Biafra group has engaged the services of Chukwuma-Machukwu Ume (SAN) to step up on its 2018 appeal, seeking the reversal of proscription of IPOB and the terrorist tag by the Federal Government.\nUme would among other things, on behalf of Nmamdi Kanu and IPOB, modify the already existing five grounds of appeal and add 13 more.\nWhen the proscription was made ex parte in October 2017, the IPOB had approached the Court of Appeal insisting that the trial court was in error and praying that the lower court’s orders exparte be set aside.\nMachukwu-Umeh is leading a team of several lawyers that include IPOB’s senior principal lawyers, Ejimakor and Ifeanyi Ejiofor."
  },
  {
    "headline": "Onitsha River port to generate N23bn",
    "summarized_story": "The Minister of State for Transportation, Sen. Gbemisola Saraki, says the Onitsha river port is positioned to generate over N23billion to the Federal Government in 30 years.\nSaraki, said during the signing of the concession of the port on Thursday in Abuja, that the port has lots of economic benefits to the country.\nAccording to her, the port will among other things, ensure the 60 per cent shiped cargoes which hitherto goes through Onne port to Onitsha to be transported directly.\n”We hope it is a catalyst for other river ports, so that it will decongest other ports and bring about growth.\nAccording to the minister, the Baro, Lokoja and Oguta ports, which are at different stages of completion, will be considered after the onitsha port."
  },
  {
    "headline": "JNI urges Muslims to intensify prayers against insecurity",
    "summarized_story": "Jama’atu Nasril Islam (JNI) has urged Muslims to intensify prayers against insecurity in the country.\nThe call is contained in a statement issued by the JNI Secretary General, Khalid Aliyu, in Kaduna, following the commencement of the Muslim holy monthof Dhul-Hijjah.\nThe Sultan urged Muslims to intensify prayers and other good deeds during the days.\n“JNI, under the leadership of Muhammad Sa’ad Abubakar, the Sultan of Sokoto and president general of NSCIA, urges Muslims to utilise the first 10 days of Dhul Hijjah in virtuous acts, which commenced yesterday.\nOn the 2023 general election, the JNI said Nigerians must work to counter the apprehensions and uncertainties associated with the periods."
  },
  {
    "headline": "Federal High Court to hear Ekweremadu’s application today",
    "summarized_story": "A Federal High Court in Abuja is scheduled to hear a case instituted by Senator Ekweremadu and wife today.\nLast week, the London Metropolitan Police arrested and charged Ekweremadu and his wife for allegedly bringing a child to the UK for organ harvesting.\nMeanwhile, the former deputy senate president, yesterday appeared before the Uxbridge Magistrate Court, UK, for his trial on alleged organ harvesting.\nOn Wednesday, Ahmad Lawan, senate president, had said the senate would dispatch a delegation to the UK to see Ekweremadu and his wife.\n“There will be a delegation to London to see the former deputy senate president.”"
  },
  {
    "headline": "Mara Set to Launch Cryptocurrency Wallet to Manage Finances – THISDAYLIVE",
    "summarized_story": "Mara, a pan-African company that offers suite of crypto products, has announced the pre-launch of the Mara Wallet, a portal to the crypto economy.\nThe Mara Wallet is a fast and secure multi-currency crypto wallet that gives Africans control over their cryptocurrency.\nWhile describing how the Mara Wallet waitlist works, Nnadi said: “Pre-registered users will join a queue to enable early access on a first-come, first-served basis.\nAll users who refer the Mara Wallet to their friends, family and community also earn further rewards when those users sign up using their unique referral link.\nThe Mara Wallet pre-launch comes at a critical inflection point in the evolution of sub-Saharan Africa."
  },
  {
    "headline": "Buhari Seeks Total Democratization of West African Subregion – THISDAYLIVE",
    "summarized_story": "At another event in Lisbon same day, President Buhari called for an increase in the volume of trade with Portugal as well as diversification to non-oil products.\n‘‘In the past 25 years, trade between Nigeria and Portugal has more than doubled to over $1 billion by 2020 just before the COVID-19 pandemic.\nPresident Buhari thanked President Marcelo Rebelo de Sousa of Portugal, who was present at the Seminar, for his contribution, interest and trust in forging formidable economic cooperation between Nigeria and Portugal.\nIn his response, the President of Portugal, Marcelo Rebelo de Sousa told President Buhari that Portugal can help Nigeria diversify the economy.\nOn President Buhari’s state visit, the Portuguese President said, “Your visit is a new beginning, A new beginning of every sector."
  },
  {
    "headline": "PDP Will Win July 16 Osun Governorship Poll in Osun, Okowa Boasts – THISDAYLIVE",
    "summarized_story": "*Opposes Zamfara Gov’s call on citizens to carry armsDeji Elumoye in AbujaGovernor Ifeanyi Okowa of Delta State has expressed optimism that the opposition Peoples Democratic Party (PDP) will win the July 16, 2022 governorship poll in Osun state.\nThe Vice Presidential candidate of PDP in the February, 2023 presidential election, also faulted the position of his Zamfara State counterpart, Bello Matawalle, that residents of the state should bear fire arms to defend themselves against rampaging terrorists.\nAccording to him, “I think they need critical thinking because you have to also be in a position to examine the recommendations being made.\nHis words: “I think we need to begin to look into many other things.\nAnd when you look at all these issues, it brings a lot of frustration."
  },
  {
    "headline": "Bill to Increase Retirement Age of PWDs Passes Second Reading in House – THISDAYLIVE",
    "summarized_story": "Udora Orizu in AbujaThe House of Representatives has passed through second reading a Bill seeking to amend the Discrimination against Persons with Disability (Prohibition) Act, 2018 for upward review of retirement age of persons with disability.\nThe proposed legislation titled, “Discrimination Against Persons with Disability Prohibition (Amendment) Bill, 2022,” was sponsored by Chairman Committee on Defence, Hon.\nHe said, “Dear Colleagues, the rationale behind this amendment is to further ensure that persons living with disability are fairly treated to ensure equity and justice.\nOriginally, employment rates of persons with disabilities are substantially lower than the rates for persons without disabilities in Nigeria.\nFemi Gbajabiamila told him that PWDs are a special class of people that shouldn’t be discriminated, hence why the Bill is important."
  },
  {
    "headline": "Buhari Reappoints DMO DG, Patience Oniha, for Another 5-year Term – THISDAYLIVE",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has approved the re-appointment of the Director-General of the Debt Management Office (DMO), Patience Oniha, for a second term of five years in accordance with Section IV (9-i) of the Debt Management Office (Establishment ETC) Act, 2003.\nAccording to the statement, Oniha’s appointment for a second term was based on the significant achievements recorded by the DMO in the last five years, under her leadership.\nUnder her watch, as part of the initiatives to improve the sustainability of the public debt and opening up avenues for raising long term funds for corporates, the DMO introduced long term Bonds with tenors of 30 years in the domestic and international markets.\nThis is aside from attracting diverse investors including retail investors to the FGN Bond Market.\nInternally, Oniha was said to have introduced reforms to strengthen the DMO, as a critical agency in the public finance ecosystem of the country."
  },
  {
    "headline": "BREAKING: Ansaru Terrorists Accuse IPOB Of Killing Muslims, Claim Nnamdi Kanu’s Group Behind Activities Of Unknown Gunmen In South-East",
    "summarized_story": "Jamar Ansarul Muslimina fi Biladi Sudan, popularly known as Ansaru, has accused the Indigenous People of Biafra (IPOB) of killing Muslims in the Southern part of the country.\nThe group disclosed this in a video and bulletin about its activities released on Wednesday night.\nIn the 16 minutes video, Ansaru said the ‘unknown gunmen’ terrorising the Southern part of the country are IPOB members.\nIt also accused the Nnamdi Kanu-led group of killing a pregnant Muslim woman, Harira Jubril and her four children in Anambra State.\n“The organization of IPOB has been supported to kill Muslims, then Muslims, who is yours?"
  },
  {
    "headline": "BREAKING: Ansaru Terrorists Accuse IPOB Of Killing Muslims, Claim Nnamdi Kanu’s Group Behind Activities Of Unknown Gunmen In South-East",
    "summarized_story": "Jamar Ansarul Muslimina fi Biladi Sudan, popularly known as Ansaru, has accused the Indigenous People of Biafra (IPOB) of killing Muslims in the Southern part of the country.\nThe group disclosed this in a video and bulletin about its activities released on Wednesday night.\nIn the 16 minutes video, Ansaru said the ‘unknown gunmen’ terrorising the Southern part of the country are IPOB members.\nIt also accused the Nnamdi Kanu-led group of killing a pregnant Muslim woman, Harira Jubril and her four children in Anambra State.\n“The organization of IPOB has been supported to kill Muslims, then Muslims, who is yours?"
  },
  {
    "headline": "BREAKING: Ansaru Terrorists Accuse IPOB Of Killing Muslims, Claim Nnamdi Kanu’s Group Behind Activities Of Unknown Gunmen In South-East",
    "summarized_story": "Jamar Ansarul Muslimina fi Biladi Sudan, popularly known as Ansaru, has accused the Indigenous People of Biafra (IPOB) of killing Muslims in the Southern part of the country.\nThe group disclosed this in a video and bulletin about its activities released on Wednesday night.\nIn the 16 minutes video, Ansaru said the ‘unknown gunmen’ terrorising the Southern part of the country are IPOB members.\nIt also accused the Nnamdi Kanu-led group of killing a pregnant Muslim woman, Harira Jubril and her four children in Anambra State.\n“The organization of IPOB has been supported to kill Muslims, then Muslims, who is yours?"
  },
  {
    "headline": "BREAKING: Three Officers Feared Killed As Gunmen Attack Police Checkpoint In Enugu",
    "summarized_story": "There is tension in Enugu, the Enugu State capital following an attack by gunmen on a police checkpoint during which officers were killed.\nThe incident, SaharaReporters gathered, happened around 9:30 am at Akwuke Junction in the Enugu South local government area of the state.\nAt the time of filing this report, it was still unclear how many police officers were killed in the attack.\n\"The checkpoint the hoodlums attacked are in front of MTD Police Station in Akwuke, opposite Boom Plaza near Tipper park before Enugu – Port-Harcourt highway.\n\"I don't know the extent of casualties but what I heard is that the gunmen have already killed three policemen."
  },
  {
    "headline": "BREAKING: Three Officers Feared Killed As Gunmen Attack Police Checkpoint In Enugu",
    "summarized_story": "There is tension in Enugu, the Enugu State capital following an attack by gunmen on a police checkpoint during which officers were killed.\nThe incident, SaharaReporters gathered, happened around 9:30 am at Akwuke Junction in the Enugu South local government area of the state.\nAt the time of filing this report, it was still unclear how many police officers were killed in the attack.\n\"The checkpoint the hoodlums attacked are in front of MTD Police Station in Akwuke, opposite Boom Plaza near Tipper park before Enugu – Port-Harcourt highway.\n\"I don't know the extent of casualties but what I heard is that the gunmen have already killed three policemen."
  },
  {
    "headline": "Ortom: 14 out of 17 members of PDP panel preferred Wike as VP candidate",
    "summarized_story": "Samuel Ortom, governor of Benue, says 14 out of 17 members of the Peoples Democratic Party (PDP) panel preferred Nyesom Wike as the vice-presidential candidate of the party.\nRecently, Atiku Abubakar, PDP presidential candidate, named Ifeanyi Okowa, governor of Delta, as his running mate for the 2023 elections.\nBut the preference was Wike – 14 members (referring to the committee) out of 17.\n“Three of them were qualified but governor Wike was eminently qualified – 14 out of 17 members chose him.\nWe said that for the PDP to win, we needed governor Wike."
  },
  {
    "headline": "Ortom: 14 out of 17 members of PDP panel preferred Wike as VP candidate",
    "summarized_story": "Samuel Ortom, governor of Benue, says 14 out of 17 members of the Peoples Democratic Party (PDP) panel preferred Nyesom Wike as the vice-presidential candidate of the party.\nRecently, Atiku Abubakar, PDP presidential candidate, named Ifeanyi Okowa, governor of Delta, as his running mate for the 2023 elections.\nBut the preference was Wike – 14 members (referring to the committee) out of 17.\n“Three of them were qualified but governor Wike was eminently qualified – 14 out of 17 members chose him.\nWe said that for the PDP to win, we needed governor Wike."
  },
  {
    "headline": "'Diesel price hike, lack of spare parts' -- Lagos increases BRT fares for ALL routes",
    "summarized_story": "Babajide Sanwo-Olu, governor of Lagos, has approved an increase of N100 for fares of Bus Rapid Transit (BRT) buses for all routes.\nKolawole Ojelabi, assistant director, corporate communication of Lagos Metropolitan Area Transport Authority (LAMATA), disclosed the development in a statement on Thursday.\nAccording to Ojelabi, the decision to hike the fares was reached owing to the rising cost of diesel and the high number of buses out of operation due to the lack of spare parts.\nAdvertisementHe added that Sanwo-Olu has also approved a proposal of a bail-out for the bus operating companies in a bid to minimise the effects of the harsh operating environment.\n“With the increase, a bus ride from Ikorodu – TBS will now cost N600 from N500 while Berger to Ajah is now N700, up from N600."
  },
  {
    "headline": "'Diesel price hike, lack of spare parts' -- Lagos increases BRT fares for ALL routes",
    "summarized_story": "Babajide Sanwo-Olu, governor of Lagos, has approved an increase of N100 for fares of Bus Rapid Transit (BRT) buses for all routes.\nKolawole Ojelabi, assistant director, corporate communication of Lagos Metropolitan Area Transport Authority (LAMATA), disclosed the development in a statement on Thursday.\nAccording to Ojelabi, the decision to hike the fares was reached owing to the rising cost of diesel and the high number of buses out of operation due to the lack of spare parts.\nAdvertisementHe added that Sanwo-Olu has also approved a proposal of a bail-out for the bus operating companies in a bid to minimise the effects of the harsh operating environment.\n“With the increase, a bus ride from Ikorodu – TBS will now cost N600 from N500 while Berger to Ajah is now N700, up from N600."
  },
  {
    "headline": "INEC: Low rate of PVC collection in Lagos worrisome -- over 1m uncollected",
    "summarized_story": "The Independent National Electoral Commission (INEC) says the low rate of collection of permanent voter cards (PVCs) by residents of Lagos state is worrisome.\nOlusegun Agbaje, the state resident electoral commissioner, spoke on Thursday at the eighth annual constituency stakeholders’ meeting in Lagos.\nAccording to NAN, the meeting was organised by the Lagos house of assembly to stress the importance of PVC collection ahead of the 2023 general election.\n“The low rate of PVC collection in Lagos state is worrisome as only 6,382 PVCs out of 34,242 received from the commission’s headquarters for the first and second quarters CVR had been collected by their owners,” Agbaje said.\n“You saw me carry out an exercise trying to see how many people have actually registered and have got PVC."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Spotlighting 7 African startups in Techstars Toronto spring 2022 cohort",
    "summarized_story": "Yesterday, 7 African startups selected for the Techstars Toronto accelerator spring cohort programme graduated alongside 4 other companies across Canada, Pakistan, and India, according to information shared with TechCabal by Techstars Toronto managing director, Sunil Sharma.\nIn the last class, 8 African startups made the cut.\nThe African startups selected in Techstars Toronto’s spring 2022 class are: Emergency Response Africa, Blackcopper, Mycoverai, truQ, Bongalow, Glade, and Gigmile.\nEmergency Response AfricaFounded in 2019 by Ghanian CTO, Maame Pooku and Nigerian CEO Folake Owodunmi, Emergency Response Africa (ERA) provides fast, reliable emergency medical help across Africa.\nGladeGlade is a fintech startup that provides African businesses with multi-currency bank accounts and allows them to perform cross-border payments."
  },
  {
    "headline": "“The future of work for African startups is in distributed offices” and other ideas from VivaTech, one of Europe’s largest tech conferences",
    "summarized_story": "I had travelled to Paris for VivaTech, one of Europe’s largest tech conferences.\nAfter a bit of queuing, I got inside and was fascinated to see more than 100 African startups present—most of them serving francophone African countries.\nThe future he suggested is in distributed offices: rather than having one office, companies could have offices all-around cities, closer to employees.\nMame Aby Seye, General Delegate for Youth and Women Entrepreneurship, spoke about the achievements of the Senegalese tech ecosystem and the support given by the DER to make this possible.\nThe Africa Tech section hosted ace Congolese guitarist Olivier Tshimanga, who dished out some melodic tunes."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Edo recommits to MSMEs devt, assures support, funding – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Acting Governor of Edo State, Rt.\nShaibu said this while addressing stakeholders at a meeting with MSMEs on the Edo Regional Plan and Master Plan at the John Odigie Oyegun Training Academy in Benin City.\nNoting the all-important role MSMEs and other small businesses play in achieving sustainable economic growth, the acting governor said the government will continue to support the sector to thrive.\nHe said, “MSMEs are critical stakeholders in the development of the economy of Edo State and Nigeria.\nThis has led to industries moving out of the country.”“Funding is the major catalyst that can grow MSMEs and we will ensure access to funding facilities for MSMEs to grow in Edo State,” he noted."
  },
  {
    "headline": "Duport Midstream Coy To Commence Commercial Operation July In Edo- NCDMB – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestORHIONMWON – The Nigerian Content Development and Monitoring Board (NCDMB), has said that the Duport Midstream Company Limited (DMCL) would commence commercial operation in July 2022.\n“So, between now (yesterday ) and the end of July this Modular Refinery in addition to the one we have in Ibigwe will become operational.\nCurrently, one of our refineries is working, which is Watersmith modular refinery that is producing 5,000bpd and serving the eastern market.\n” In terms of our modular refinery operation, by July, this one will go live to tell you that there are modular refineries working in the country.\n“Today in Nigeria, we have three refineries working in Nigeria, we have Watersmith, we have Niger Delta and this one is the third."
  },
  {
    "headline": "Edo pledges sustained investment in security, education, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Acting Governor, Rt.\nComrade Philip Shaibu, on Thursday, said the state government will continue to prioritise investment in education, health, security, agriculture and other critical sectors of the state’s economy, ensuring a conducive environment for businesses to thrive.\nWe were able to address the issues and will continue to work together for the benefit of our people.\n“If the sector is not closely monitored, it might be used negatively to destroy the peace and security of the state and nation.\nShaibu further noted, “We will visit the sporting facilities in your office to see things for ourselves as sports is part of our focus."
  },
  {
    "headline": "Edo govt closes Nigerian Observer for one-month revamp exercise – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government in line with the reforms of the state-owned media organisations, has directed the closure of the Nigerian Observer newspaper for a period of one month, for the re-organisation and re-launch of the media outfit.\nIn a statement, the Secretary to the State Government, Osarodion Ogie Esq., said, “The Edo State Government, in line with the reforms of the state-owned media organisations, has directed the closure of the Nigerian Observer newspaper for a period of one month, for re-organisation and re-launch of the media outfit.\n“All existing staff of the Nigerian Observer are hereby redeployed to the Ministry of Communication and Orientation, with immediate effect, where they will receive further directives on their new responsibilities.”Ogie assured, “Members of the reading public and lovers of the Nigerian Observer brand are assured that their darling newspaper titles will return to the stands shortly better and improved.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Get Yourself a Gun, It’s Official, By Tola Adeniyi",
    "summarized_story": "Now it is official, coming from no less a personality and political stalwart than Governor Bello Matawalle of Zamfara state.\nThe Governor noted that Kaduna, Zamfara and Katsina have been in bandits’ grip with the terrorists becoming more audacious in their attacks.\n*Daily Trust* reported that the Zamfara government also “directed the state commissioner of police to issue (gun) license” to people who are qualified and willing to use the guns.\nThis directive by the governor to liberalize gun ownership may reverse the trend in the short term.\nAny state governor who is afraid to follow the courageous and rightful step taken by Matawalle is not fit to be called a man."
  },
  {
    "headline": "Dangote Cement appoints Gbenga Fapohunda as acting group CFO",
    "summarized_story": "Dangote Cement Plc, has appointed Dr. Gbenga Fapohunda as Acting Group Chief Finance Officer (CFO).\nAccording to the disclosure, Mr. Guillaume Moyen resigns as Group CFO effective June 30, 2022.\nHe joined DCP as the Regional Chief Finance Officer (CFO) in Nigeria, effective March 1, 2021.\nDr. Fapohunda is a Fellow Member of the Institute of Chartered Accountants of Nigeria; An Associate Member of the Chartered Institute of Taxation; An Associate Member of the Institute of Cost Management Accountants; An Associate Member of the Institute of Treasury and Financial Administration; An Associate Member of the Institute of Credit & Risk Management; An Associate Member of the Nigerian Institute of Management.\nAccording to the notice, the company welcomes Dr Gbenga Fapohunda as the new Acting Group Chief Finance Officer of DCP, effective July 1, 2022, and wishes him a successful tenure"
  },
  {
    "headline": "Moses Simon, Akinkunmi Amoo nominated for CAF awards: Full List",
    "summarized_story": "Nigerian forward, Moses Simon has been nominated for the Confederation of African Football (CAF) Player of the Year award.\nFormer Golden Eaglets forward Akinkunmi Amoo was also nominated for the Young Player of the Year Award.\nThe African football governing body, CAF released the first list of nominees for the Men’s categories namely Player of the Year, Interclub Player of the Year, Young Player of the Year, National Team of the Year and Club of the Year on Thursday.\nCAF stated that stakeholder panel made up of technical experts, legends and journalists decided on the list for the various categories taking into the consideration the performance of the nominee from September 2021 till June 2022 at all levels.\nThe 2022 awards will be held ahead of the final of Africa’s women’s Cup of Nations in Morocco scheduled to take place between 2 July – 23 July."
  },
  {
    "headline": "MTN Nigeria appoints Onyinye Ikenna-Emeka Fixed Broadband GM",
    "summarized_story": "MTN Nigeria has appointed Onyinye Ikenna-Emeka as General Manager, Fixed BroadbandA statement from the company said Ikenna-Emeka is a business leader with over 23 years of experience in the telecommunications, logistics and education sectors.\nUntil her appointment, Ikenna-Emeka was at the Enterprise Business Division, MTN Nigeria, where she worked as the General Manager, Enterprise Marketing.\nShe developed and managed profitable business models for high-end enterprise and digital initiatives within the MTN Enterprise Business division serving SMEs, large and multi-national organisations.\nCommenting on Onyinye’s appointment, Karl Toriola, Chief Executive Officer, MTN Nigeria, expressed his confidence in Onyinye’s capabilities.\nShe has completed executive education in leadership and business strategies with Harvard Business School, Stanford Business School, Columbia Business School and the Lagos Business School."
  },
  {
    "headline": "Osun 2022: APC Igbimo Agba re-assures Oyetola of their support",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Osun All Progressives Congress, APC, Igbimo Agba has re-assured the governor of the state, Mr. Adegboyega Oyetola of their unalloyed support ahead of the state’s governorship election billed for July 16.\nThis was contained in a communique issued at the end of their monthly meeting held at the residence of the Engr.\nAccording to the communique, the apex body of APC in the state remains resolute its quest for the re-election of governor Adegboyega Oyetola.\nThe communique reads; “The APC, Igbimo Agba Osun under the Chairman- Chief Engr.\n“Based on this feat, all residents and citizens of this State are further appreciated and enjoined them to continue giving their support towards re-election of H/E Alh."
  },
  {
    "headline": "Army Rescues Another Kidnapped Chibok Schoolgirl, Ruth Bitrus, In Borno",
    "summarized_story": "The Nigerian Army has rescued another Chibok schoolgirl, Ruth Bitrus, who was kidnapped alongside many others from Government Girls Secondary School Chibok, in Borno State, on April 14, 2014.\nWhile recounting her ordeal, Ruth said that she escaped from Sambisa forest eight years after she was kidnapped from her school in Chibok town by the Boko Haram terrorists.\nSome of the Boko Haram saw me while I was coming out but I ran to the bush to avoid being arrested,” she said.\nLEADERSHIP reported that Boko Haram kidnapped 276 female students, aged between 16 and 18 from the Government Girls Secondary School in Chibok, Borno State in April 2014.\nOver 100 of the schoolgirls were still unaccounted for eight years after they were kidnapped by terrorists."
  },
  {
    "headline": "Army Rescues Another Kidnapped Chibok Schoolgirl, Ruth Bitrus, In Borno",
    "summarized_story": "The Nigerian Army has rescued another Chibok schoolgirl, Ruth Bitrus, who was kidnapped alongside many others from Government Girls Secondary School Chibok, in Borno State, on April 14, 2014.\nWhile recounting her ordeal, Ruth said that she escaped from Sambisa forest eight years after she was kidnapped from her school in Chibok town by the Boko Haram terrorists.\nSome of the Boko Haram saw me while I was coming out but I ran to the bush to avoid being arrested,” she said.\nLEADERSHIP reported that Boko Haram kidnapped 276 female students, aged between 16 and 18 from the Government Girls Secondary School in Chibok, Borno State in April 2014.\nOver 100 of the schoolgirls were still unaccounted for eight years after they were kidnapped by terrorists."
  },
  {
    "headline": "JUST-IN: Bauchi Deputy Gov, Tela, Denies Resignation",
    "summarized_story": "The Bauchi State deputy governor, Senator Baba Tela, has denied reports (not in LEADERSHIP) that he resigned his position.\nA press release issued by the press secretary to Deputy Governor, Sani Mu’azu Ilelah, and made available to journalists on Thursday in Bauchi, debunked the viral social media report and described it as a figment of the imagination of the author.\n“For the avoidance of doubt, we would like to assure the peace loving and hard-working people of Bauchi State, in particular and the nation in general, that Sen. Baba Tela has not resigned as the Deputy Governor of Bauchi State.\n“His Excellency, the deputy Governor, remains committed to the objectives and ideas of the Government of Bauchi State under the able leadership of His Excellency, Sen. Bala Abdulkadir Mohammed, CON (Kauran Bauchi),” the statement said.\n“While reiterating his support and loyalty to the Governor, rumour mongers who are bent on causing disharmony in the State are warned to desist from such acts,” the statement added."
  },
  {
    "headline": "JUST-IN: Bauchi Deputy Gov, Tela, Denies Resignation",
    "summarized_story": "The Bauchi State deputy governor, Senator Baba Tela, has denied reports (not in LEADERSHIP) that he resigned his position.\nA press release issued by the press secretary to Deputy Governor, Sani Mu’azu Ilelah, and made available to journalists on Thursday in Bauchi, debunked the viral social media report and described it as a figment of the imagination of the author.\n“For the avoidance of doubt, we would like to assure the peace loving and hard-working people of Bauchi State, in particular and the nation in general, that Sen. Baba Tela has not resigned as the Deputy Governor of Bauchi State.\n“His Excellency, the deputy Governor, remains committed to the objectives and ideas of the Government of Bauchi State under the able leadership of His Excellency, Sen. Bala Abdulkadir Mohammed, CON (Kauran Bauchi),” the statement said.\n“While reiterating his support and loyalty to the Governor, rumour mongers who are bent on causing disharmony in the State are warned to desist from such acts,” the statement added."
  },
  {
    "headline": "Tears As Kaduna Catholic Priest Killed By Terrorists Is Buried In Kaduna",
    "summarized_story": "Family, friends and well wishers wept profusely on Thursday as Catholic Archdiocese of Kaduna buried Rev.\nVitus Vaishima Borogo, who was killed by terrorists on his farm in Kaduna State.\n“We no longer have tears in our eyes because the source of our tears have dried up because of constant crying.\nHe further said, “any politician who cannot secure Nigerians should not contest for any political position.\nIt is better the person withdraw from the race.”On his part, the vice chairman of the Indigenous Priests of Kaduna, Rev."
  },
  {
    "headline": "BREAKING: 2023: North-West APC demands vice-presidential slot",
    "summarized_story": "The leaders of the All Progressives Congress (APC) from the North-West have demanded the position of vice president ahead of the July 15 deadline set by the Independent National Electoral Commission (INEC) for the substitution of candidates by political parties where necessary.\nAgainst this background, the leaders of the party from the region have decided to engage the presidential candidate of the party, Senator Bola Tinubu, to make their views known.\nThe North-West leaders are coming out for the first time after the special convention of the party which produced Tinubu to make a demand for the position.\nThe position of the North-West APC leaders was contained in a statement issued by the APC National Vice-Chairman (North-West), Dr. Salihu Lukman after their meeting held on Thursday in Kaduna.\nDetails in a moment…"
  },
  {
    "headline": "BREAKING: Court Orders MTN To Pay Nigerian Musician N20m For Using Song As Caller Tune Without Consent",
    "summarized_story": "The Abuja Division of the Federal High Court has ordered telecommunications giant, MTN Nigeria to pay an Abuja-based musician, Liberty Williams over copyright violation.\nThe suit marked FHC/ABJ/CS/2017 was instituted in 2017 by Williams against MTN, its Chief Executive Officer, Ferdi Moolman; Nowhere to Run Entertainment Ltd and Emmanuel Abanah.\nThe plaintiff had accused MTN of selling a song he composed in July 2013 as a ring tone.\nHe had asked the court to declare that MTN’s sale of the song without his consent constituted an infringement on his copyright.\nHe contended that he did not, at any time, surrender the master tape and the right of the song to the entertainment company and its chief executive."
  },
  {
    "headline": "BREAKING: Ansaru Terrorists Accuse IPOB Of Killing Muslims, Claim Nnamdi Kanu’s Group Behind Activities Of Unknown Gunmen In South-East",
    "summarized_story": "BREAKING: Ansaru Terrorists Accuse IPOB Of Killing Muslims, Claim Nnamdi Kanu’s Group Behind Activities Of Unknown Gunmen In South-EastJamar Ansarul Muslimina fi Biladi Sudan, popularly known as Ansaru, has accused the Indigenous People of Biafra (IPOB) of killing Muslims in the Southern part of the country.\nThe group disclosed this in a video and bulletin about its activities released on Wednesday night.\nIn the 16 minutes video, Ansaru said the ‘unknown gunmen’ terrorising the Southern part of the country are IPOB members.\nIt also accused the Nnamdi Kanu-led group of killing a pregnant Muslim woman, Harira Jubril and her four children in Anambra State.\n“The organization of IPOB has been supported to kill Muslims, then Muslims, who is yours?"
  },
  {
    "headline": "2023: Why Wike Will Not Support Atiku – Ayo Fayose",
    "summarized_story": "Former governor of Ekiti State Ayo Fayose has outlined why he thinks Nyesom Wike, governor of Rivers State, will never back Atiku Abubakar, the PDP candidate for president (PDP).\nAccording to the former Ekiti governor, Mr. Atiku failed to fulfill his promise to Mr. Wike when he settled for the Delta State governor, Ifeanyi Okowa, as his running mate.\n“When they need Wike’s money and Wike’s support, they will say, ‘Wike is good enough.\nWhatever he does is what we would do; wherever he asks us to go is where we will go.”When asked what would happen should Mr. Wike ask them to support Mr. Atiku, the former governor said: “Wike will never say we should support Atiku.\nMr. Fayose further explained that “when the June 12 election was canceled, the presidency was zoned to the southwest to pacify the southwest region."
  },
  {
    "headline": "Military kills 82 terrorists in Zamfara airstrikes, 2 arrested in Kwara",
    "summarized_story": "Kokki also said scores of the bandits were also neutralised as security personnel fought back to repel the attack.\nIt is even more worrisome to know that the lives of security personnel were involved and expatriates were also among those kidnapped,” he said.\n“Alhaji was trying to get cartridge for the local pistol he said he had bought for N8,000 and fortunately for Nigerians he asked question from the wrong person.\n“It was the arrest of Alhaji that led to that of John, who he said, sold the local pistol to him.\n“We know that no one has the right to own local pistol or local rifle."
  },
  {
    "headline": "Nobody is talking about Tinubu, Atiku, others, Peter Obi everywhere – ex-Buhari’s aide opens",
    "summarized_story": "Former new media aide to President Muhammadu Buhari, Bashir Ahmad, said Labour party is getting 75-80% attention in Kano State.\nHe made this known in a tweet via his verified Twitter handle on Thursday.\nAccording to the tweet, “Let me confess, the name Peter Obi alone is a movement to beat, I was in Kano over the weekend and to my surprise everywhere is PO, nobody is talking about other candidates anymore and a friend told me that it’s a similar story in Katsina.\nLP is getting 75% – 80% in those states.”Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Alleged organ harvesting: Ekweremadu appears before UK court",
    "summarized_story": "Former Deputy Senate President, Ike Ekweremadu, on Thursday, appeared before the Uxbridge Magistrate Court, UK, on alleged organ harvesting and modern slavery charges.\nSource disclosed that, Ekweremadu was in the dock where he spoke twice; confirming his name and date of birth.\nIt was also reported that his two adult sons were in the court but his wife, Beatrice wasn’t.\nThe case has been adjourned to July 7 and he will now appear before a judge at Westminster Magistrate court.\nLast week, the Metropolitan Police arrested and charged Ekweremadu and his wife for allegedly bringing a child to the UK for organ harvesting."
  },
  {
    "headline": "MMSD task staff on dedication to duty for improved productivity",
    "summarized_story": "has called on Civil Servants to be dedicated to duty for improved productivity.\nAdegbite made the call during the celebration organized by the ministry to commemorate the 2022 African Public Service Day in Abuja.\nShe told the workers that the occasion also affords the opportunity to specially acknowledge members of staff that have distinguished themselves through outstanding performance.\nUmar Adamu Tsoho who was honoured with the “Presidential Public Service Award” by the OHCSF for outstanding service.\nIt is indeed a noble achievement to successfully exit the Federal Civil Service through retirement."
  },
  {
    "headline": "Naira now exchanges at N614/$ at the parallel market",
    "summarized_story": "The Nigerian naira has dropped to N614 against the dollar at the parallel section of the foreign exchange market.\nAt the official market, the naira also depreciated by 0.21 percent to close at N421/$ on Monday, according to information obtained from FMDQ OTC Securities Exchange — a platform that oversees official foreign-exchange trading.\nInternational organisations such as the World Bank and the International Monetary Fund (IMF) have constantly advised the Central Bank of Nigeria (CBN) to unify the official and parallel market exchange rates.\n“They want us to free the exchange rate.\nAnd you do know that this has some impacts on the exchange rate itself,” he had said."
  },
  {
    "headline": "NCC says telecom firms’ operating costs have risen by N265bn",
    "summarized_story": "Latest data from the Nigerian Communications Commission, NCC, has shown that operating costs of telecommunication companies in Nigeria increased by N265.25 billion in one yearThe figure contained in the 2021 Subscriber/Network Data Annual Report’ by the NCC showed that the operating costs rose from N1.4tn in 2020 to N1.66tn in 2021.\nThe report read in part, “Total operating cost for the mobile network operators increased from N1, 395,000,000,000 in 2020 to N1, 658,235,000,000 at the end of 2021.\nThe President, ALTON, Mr. Gbenga Adebayo, said that the industry was worried about how the rising cost of diesel would further drive the high cost of business.\nAll network planning, operational expenses and planned projection for the year is based on the fact diesel prices.\nBut we are mindful of the high cost of living, and the implication of this on the economy and citizens."
  },
  {
    "headline": "AfDB moves to cut $14bn annual import of medicine into Africa",
    "summarized_story": "Board of Directors of the African Development Bank (AfDB) has approved the establishment of African Pharmaceutical Technology Foundation for Africa’s access to technologies.\n“African pharmaceutical companies do not have the scouting and negotiation capacity, and bandwidth to engage with global pharmaceutical companies.\n“They have been marginalized and left behind in complex global pharmaceutical innovations.”He decried that of 35 companies which recently signed a licence with America’s Merck to produce Nirmatrelvir, a COVID-19 drug, none was African.\nAccording to him, no institution exists in Africa to support the practical implementation of Trade Related Intellectual Property Rights (TRIPs) on nonexclusive or exclusive licensing of proprietary technologies, know-how and processes.\n“It will be staffed with world-class experts on pharmaceutical innovation and development, intellectual property rights, and health policy”, he stated."
  },
  {
    "headline": "Amazing Discounts On Itel Smartphones As Jumia Celebrate 10th Anniversary",
    "summarized_story": "This time around, itel has partnered with Jumia for its 10th anniversary celebration.\nOnline shoppers can get up to 2,000 naira discounts, free gifts, and itel accessories when they purchase itel smartphones and other products on itel’s online store on the Jumia app or website.\nCustomers will also enjoy discounts on the itel A25 Pro, P37, S17, A58, and A37.\nCustomers in Ibadan, Abuja, and Lagos will not have to pay for the delivery of their smartphones when they buy from the itel store on Jumia.\nTo get shopping on itel’s store and to get amazing discounts, click on this link to get started."
  },
  {
    "headline": "Labour To Hold One-Day Nationwide Protest Over Insecurity, ASUU Strike",
    "summarized_story": "﻿The organised labour movement is planning to hold a protest on the state of the nation.\nThe protest is to call the attention of the government to the country’s deteriorating security situation, the lingering strike by the Academic Staff Union of Universities (ASUU) and the unending energy crisis.\nREAD ALSO: Gunmen Kill Scores, Abduct Several Chinese Nationals In Niger State“For four months and running, the children of the poor have remained at home,” Mr Wabba said.\n“Today as we speak, Diesel is selling for more than N800 per litre.\nThere is no way this situation can be allowed to continue."
  },
  {
    "headline": "Gunmen Kill Scores, Abduct Several Chinese Nationals In Niger State",
    "summarized_story": "Gunmen have killed persons, injured and abducted many others including four Chinese nationals in an attack on a mining site in Ajata- Aboki, Gurmana Ward of Shiroro Local Government, Niger State.\nThe Co-convener, Concerned Shiroro Youths Of Niger State, Sani Abubakar Yusuf Kokki, as well as the Niger State Government confirmed the incident in separate statements issued on Thursday.\nAlthough Kokki noted that the Nigerian Army stationed nearby swung into action to repel the attack, he said several officers were gunned down by the assailants.\nMore bodies are still being expected as search efforts have intensified, Kokki said.\nWhile reacting to the incident, Governor Abubakar Sani Bello, commiserated with the families of the victims."
  },
  {
    "headline": "Ekweremadu Appears Before UK Court Over Organ Harvesting Charges",
    "summarized_story": "The former Deputy Senate President Ike Ekweremadu on Thursday appeared before Uxbridge Magistrate’s Court in London, facing charges under Britain’s Modern Slavery Act.\nA large delegation from the Nigeria High Commission was also present in the public gallery alongside the Senator’s two adult children.\nHe explained that members of the Senate Committee on Foreign Affairs will be traveling to the UK soon.\nEqually, the Nigeria Foreign Affairs Minister has been engaged here, so that the Ministry of Foreign Affairs takes steps to provide diplomatic support for our colleague.\nThe High Commission has done so much but we still expect that it will continue to provide any other further consular services.”"
  },
  {
    "headline": "Again, Buhari Promises Credible Elections",
    "summarized_story": "President Muhammadu Buhari has restated his administration’s resolve to conduct free and credible elections in 2023.\nBuhari added that his government will give the Independent National Electoral Commission (INEC) the free hand to conduct the exercise.\n‘‘We also look forward to a smooth transition to the next government,” presidential spokesman, Garba Shehu, quoted Buhari as saying at the meeting held in Lisbon.\nAccording to him, while social media platforms have made great impacts on several areas of life, they, however, have been used negatively.\n‘‘Many countries, including our own, have had to take strong measures against some social media platforms to curb their excesses and prevent them from destabilizing our societies,” Buhari added."
  },
  {
    "headline": "Russia Quits Snake Island, Weakening Blockade Of Ukraine Ports",
    "summarized_story": "Russian troops have abandoned their positions on a captured Ukrainian island, a major setback to their invasion effort that weakens their blockade of Ukraine’s ports, defence officials said on Thursday.\nNow, however, Ukraine has begun to receive longer range missiles and artillery, and the Russian position on Snake Island seems to have become untenable.\n‘Strategically important’British Prime Minister Boris Johnson warned the Russian president that any eventual peace deal would be on Ukraine’s terms.\nThe United Nations humanitarian coordinator in Ukraine said on Thursday 16 million people in Ukraine were in need of humanitarian aid.\n‘Offensive’ remarksAlso on Thursday, Russia summoned Britain’s ambassador to Moscow to protest at Johnson’s “offensive” remarks about Putin."
  },
  {
    "headline": "Groups call for more youth, women involvement in party politics",
    "summarized_story": "Advocacy groups in Kaduna state are again calling for an increase in youth and women participation in governance and decision making in the state and country in order to bring about more stable and balanced society.\nThe advocacy groups majorly made up of youths, gathered to push the agenda for more youth and women inclusion across all levels of political structures.\nThey are particularly disturbed that no presidential or governorship aspirant under the age of 40 emerged as the flag bearer of the major political parties in the concluded primary electionsThey said the youth and women are an indispensable resource and should be given more opportunities at the fore front to lead innovations and bring change.\nThey are however calling on political parties to ensure that youths and women are given more leadership opportunities going forward.\nThe youths believe political participation that is all-Inclusive is fundamental to developing a stable society that better responds to the specific needs of younger generations."
  },
  {
    "headline": "Dr Iyorchia Ayu is still PDP National Chairman",
    "summarized_story": "The Peoples Deomcratic Party has disimissed reports of the purported suspension of its National Chairman, Dr Iyorchia Ayu, over allegeations of misappropriation against him.\nEarlier today, mischievous stories broke on the social media to the effect that the PDP National Chairman, Dr. Iyorchia Ayu, has been “suspended over allegations of misappropriation.”The stories further add that the Deputy National Chairman (North), Amb.\nDr. Iyorchia Ayu, the PDP National Chairman remains the PDP National Chairman.\nA stickler for due process, Dr. Ayu formally handed over to the Deputy National Chairman (North), Amb.\nDamagun, said during the ceremony today: “On behalf of my able National Chairman, Dr. Iyorchia Ayu, I hereby inaugurate you.”6."
  },
  {
    "headline": "CAN Commends Niger government Over PVC Public holidays",
    "summarized_story": "The statement charged all Nigerlites especially Church leaders, worshippers, Civil Servants, Public Office Holders, Women and youths to take advantage of the holiday to get their PVCs registration done.\nThe issue of PVC Registartion, Collection and Choosing the right candidate has been on the front burner recently with many celeberities campaigning on Social Media urging Nigerians to go out and register so as to have a voice in the election of Leaders at all elevls in the 2023 General Elections.\nSome Human and Social Rights Organisations like SERAP have gone as far as instituting lawsuits against the Independent National Electoral Commission INEC, to compel it to extend Voter Registyration which was originally slated to end on the 30th of June 2022.\nThough the commission had maintained that the registartion will not be extended for sometime, its Chairman, Professor Mahmood Yakubu, this past weekend disclosed at a concert to promote voter registartion in Abuja that the Commission will extend the deadline.\nThough the extension up till now is still being expected by Nigerians anxiously waiting for the deadline to be moved forward."
  },
  {
    "headline": "Court restrains Oyo Assembly from impeaching Deputy Governor -",
    "summarized_story": "An Oyo State High Court sitting in Ibadan has ordered the Oyo State House of Assembly to halt every impeachment process against the embattled Deputy Governor of the state, Rauf Olaniyan.\nJustice Ladiran Akintola of the high court gave the ruling on Wednesday when the case came up at Court 7 of the State High Court, Ring Road, Ibadan.\nThe case had earlier been adjourned on Tuesday till Wednesday due to the absence of the legal counsel to the Oyo State House of Assembly, the Speaker of the House and Clerk.\nThe Oyo State House of Assembly had initiated Impeachment proceedings against the Deputy Governor, Engineer Rauf Aderemi Olaniyan, over his defection to the All Progressives Congress from the Peoples Democratic Party.\nThe Deputy Governor had been at daggers drawn with the State Governor, Seyi Makinde, since shortly after the shock victory over the All Progressives Congress in the 2019 Election in Oyo State."
  },
  {
    "headline": "Fayose Against Atiku, Demands Power Shift To South – Trending With Ojy Okpe",
    "summarized_story": "The former governor of Ekiti state, Ayodele Fayose has demanded that a southerner must succeed President Muhammadu Buhari in 2023.\nFayose also tweeted in Yoruba language saying “awa south lo kan” which means “it is the turn of the south”, a reference to the ‘catchphrase’ attributed to Bola Ahmed Tinubu, the presidential candidate of the All Progressives Congress.\nIn Borno state, 314 Terrorists were said to have surrendered to troops in Bama Local Government Area of the state as a result of the ongoing onslaught against terrorism in the North East.\nThe Nigerian Army, which disclosed this on its official social media handle, said the troops also rescued 12 farmers from the terrorists’ den.\nJustice ‘Elsie Thompson’ while delivering the judgment; described the former officer as a “serial trigger-happy” policeman that should not be allowed to remain in society."
  },
  {
    "headline": "Jackson Sworn in, Becomes 1st Black Woman on Supreme Court",
    "summarized_story": "Ketanji Brown Jackson has been sworn in to the Supreme Court, shattering a glass ceiling as the first Black woman on the nation’s highest court.\nMoments later, joined by her family, Jackson recited the two oaths required of Supreme Court justices, one administered by Breyer and the other by Chief Justice John Roberts.\nWASHINGTON (AP) — Nearly three months after she won confirmation to the Supreme Court, Ketanji Brown Jackson will be sworn in as the court’s 116th justice on Thursday.\nJackson will recite two oaths required of Supreme Court justices, one administered by Breyer and the other by Chief Justice John Roberts.\nJackson, a federal judge since 2013, will be the first Black woman to serve as a justice."
  },
  {
    "headline": "Putin Says Western Leaders Would Look ‘Disgusting’ Topless after They Mock His Shirtless Pictures",
    "summarized_story": "Vladimir Putin says Western leaders would look “disgusting” if they were to undress “above or below the waist”.\nThe Russian leader hit back after G7 leaders poked fun at his liking of bare-chested photo ops during the summit.\nCanada’s Justin Trudeau joined in, saying they should put on a “bare-chested horseback riding display” – one of the Russian leader’s widely publicised athletic adventures.\n“Horseback riding is the best.”On a visit to Turkmenistan, Mr Putin was asked about Western leaders joking about him.\nHe retorted that, unlike him, Western leaders abuse alcohol and don’t do any exercise."
  },
  {
    "headline": "Dumo Lulu Briggs: My Popularity in Rivers Will Set Me Apart from My Competition",
    "summarized_story": "The Accord Party is one of the parties that will be seeking to wrestle power from the Peoples Democratic Party come 2023.\nThe party’s governorship candidate Dumo Lulu-Briggs, has promised to run an inclusive government if he emerges as governor of Rivers State in 2023.\nTo discuss his plans for rivers state, and his strategies to oust the PDP in rivers state, is Dumo Lulu-Briggs, Governorship Candidate of the Accord Party, Rivers state."
  },
  {
    "headline": "Mike Igini is Working Against the Interest of the APC – Dr Blessing Agbomhere",
    "summarized_story": "The All Progressives Congress (APC) in Akwa Ibom state have a crisis on their hands, as the Independent National Electoral Commission has indicated that the primary rerun conducted in the state, is not recognized by the commission.\nINEC confirmed that the APC primary which produced Akanimo Udofia as a governorship candidate, and that of senate candidate Godswill Akpabio was not monitored by the electoral body.\nReacting to this development, The South-south zonal organizing secretary of the All Progressives Congress (APC), Dr.\nBlessing Agbomhere, has demanded for the resignation or outright sack of the Akwa Ibom State Resident Electoral Commissioner (REC), Mr Mike Igini, over the role he played in the controversy rocking the APC governorship and senatorial primaries in the state.\nTo discuss the controversy surrounding the APC primary in Akwa Ibom state, is Dr Blessing Agbomhere, South South Zonal Organising Secretary of the All Progressives Congress."
  }
]