[
  {
    "headline": "Cult killings: Akwa Ibom council boss imposes dusk-to-dawn curfew",
    "summarized_story": "The Chairman of Ikono Local Government, Mr Nyakno Uwemedimo Okoibu, has imposed a dusk-to-dawn curfew on the local government area.\nThe curfew which lasts from 6am-6pm daily commenced on December 28th till further notice.\nThe statement reads in part, “The chairman of Ikono LGA, has imposed total restrictions of movement of persons, motorcycles, keke, cars, etc.\nwithin the perimeters of Ikono Local Government Area, from the hours of 6pm to 6am daily, effective from tomorrow, December 28, 2021, until further notice.\n“As a responsible government, we cannot fold our arms and watch events go the other way round."
  },
  {
    "headline": "Group urges continuous legal education for Nigerian lawyers",
    "summarized_story": "The Chairman, Governing Council of the Nigerian Bar Association, Young Lawyers Forum, Tobi Adebowale, has called for continuous legal education for Nigerian lawyers, yesterday.\nHe said that this tool can be acquired and sustained through continuous legal education.\n“The witty saying that ‘a good lawyer knows the law and a great lawyer knows the judge’ has some merit.\nHe blamed this on the capacity of Nigerian law firms and lawyers, to deal with such matters effectively and efficiently.\nHe, therefore, called on the NBA to play its role in bridging the gap by ensuring that the earning capacity of its lawyers through continuous legal education is not lost."
  },
  {
    "headline": "NASS transmits passed 2022 Appropriation Bill to Buhari for assent",
    "summarized_story": "President of the Senate, Senator Ahmad Lawan had disclosed on Wednesday last week moments before the Senate proceeded on recess, that the National Assembly would last week Thursday transmit the 2022 budget to President Buhari for assent into law.\nThe transmission of the 2022 Budget to President Buhari by the National Assembly was contained in a letter by the Clerk to the National Assembly, Ojo Amos.\nThe letter of transmission, with Reference Number NASS/CNA/37/Vol.1/35, was addressed to the President and Commander-in-Chief of the Armed Forces of the Federal Republic of Nigeria and titled ‘APPROPRIATION BILL, 2022, read, “In consonance with the Provisions of the Acts Authentication Act Cap.\nA2, Laws of the Federation of Nigeria, 2004, I wish, with due respect, to forward to Your Excellency, the authenticated copies of Appropriation Bill, 2022, for your consideration and assent.\n“After Your Excellency’s assent, one copy of the signed bill should be retained in your office while the other two are to be returned for our further action, please”."
  },
  {
    "headline": "Air Chief charges troops to sustain tempo of operations against criminal elements in Niger State",
    "summarized_story": "Air Marshal Amao gave the charge while celebrating Christmas with the troops of Air Component of OPGA in Minna.\nThe NAF he stated, operating in concert with sister Services and other security agencies, has continued to courageously confront various security threats, while recording tangible results in the various theatres of operations.\nThe air operations he disclosed, have been immensely instrumental in curtailing the activities of the terrorists and denying them freedom of action.\n“In the same vein, I am happy to note that we currently have a total of 195 officers, airmen and airwomen undergoing various training courses abroad cutting across several specialties and trades.\n“In addition, 12 student pilots are undergoing Basic Fighter Training at 403 Flying Training School, Kano, while 12 others are undergoing Basic Transport Training at 401 Flying Training School, Kaduna."
  },
  {
    "headline": "FG constructed 500 Rural Roads in 2021- Minister",
    "summarized_story": "…To provide power grids to rural communities to aid improved Communication/security in 2022 – Budget Minister, Clem Agba.\n“Cultural festivals also provide a platform for showcasing, promoting and preserving our cultural heritage.\nIt is a great opportunity to call to mind and celebrate the rich, diverse and unique cultural heritage of Iviukhua community.\nContinuing he said, “Cultural festivals such as this has both social and economic angles.\nThus cultural festivals that give us the opportunity to forget all our worries and celebrate the positive side of life, come into existence."
  },
  {
    "headline": "2023 presidency: Wabara, Abaribe drum support for Pius Anyim",
    "summarized_story": "By Steve OkoThe 2023 presidential ambition of Senator Anyim Pius Anyim, gained momentum yesterday, as former Senate President and Secretary of the Peoples Democratic Party, PDP, Board of Trustees, BoT, Dr. Adolphus Wabara, has thrown his support behind the project.\nOzigbo who said electronic transmission of election results would drastically reduce falsification of election results, strongly advocated inclusion of electronic voting as a panacea to electoral fraud.\nSenator Wabara said Anyim had garnered the capacity, the requisite knowledge and national appeal to deliver as President.\nSenator Wabara urged Nigerians to give Anyim a chance to return Nigeria to the path of greatness.\nSenator Anyim has since declared interest in the 2023 presidential race, saying he could be trusted for the political and multi-sectoral salvation of Nigeria."
  },
  {
    "headline": "Prelate to Buhari: Shelve any plans to hike fuel price, free political detainees, Nigerians ‘ve suffered enough",
    "summarized_story": "By Steve OkoThe Prelate and Moderator of the Presbyterian Church of Nigeria, His Eminence Nzie Nsi Eke, has appealed to President Muhammadu Buhari, to shelve any plans to hike the price of petroleum products.\n“In view of these, I am calling on our leaders to give Nigerians the following gifts as we move into the new year:“Rescind the alleged plan to increase fuel pump price.\nIt is a known fact that every increase in fuel price results in a domino effect on the cost of all other goods and services.\n“Reduce the social tension among the various ethnic groups by releasing all political detainees and explore dialogue and political solutions to all agitations.\n“Pave way for free and credible general election in 2023 by enacting enabling laws and making INEC truly independent."
  },
  {
    "headline": "Lawyers condemn abduction of Plateau monarch",
    "summarized_story": "The United Mwaghavul Lawyers Association (UMLA) has described the abduction of the Sum Pyem, Da Charles Mato Dakat as an attack on the entire traditional institution in Plateau State.\nThey described it as “the beginning of a well-orchestrated plan to intimidate and decapitate our treasured leaders in the state and the Middle Belt at large”.\nDAILY POST recalls that in the early hours of Sunday 26th December 2021, the Sum Pyem was abducted by yet to be identified gunmen.\nHe said, “The United Mwaghavul Lawyers Association (UMLA) is greatly saddened by the abduction of the Sum Pyem, Da Charles Mato Dakat in the early hours of Sunday 26th December 2022 by supposedly unknown gunmen.\n“We consider this not just an attack on a person but on the entire traditional institution of the Plateau people."
  },
  {
    "headline": "Damaturu residents told not to panic as Army to detonate IEDs",
    "summarized_story": "Residents of Damaturu, the Yobe State capital, and environs have been advised not to panic as Combat Engineers of the Headquarters Sector 2 Operation HADIN KAI, will detonate unexploded explosive ordinances in two locations within the metropolis.\nThe locations are: near the Yobe State University along Gujba Road and another one along Maiduguri Road.\n), Special Adviser on Security Matters to Governor Mai Mala Buni, on Tuesday in a statement made available to newsmen in Damaturu“The public is hereby notified that they are controlled explosions and should not panic.\n“People are further advised to go about their normal businesses as there is no cause for alarm,” the statement read.\n“The press is by this announcement advised to take note that it is not an adversary explosion, please”."
  },
  {
    "headline": "Ghana Police warns clerics against 2022 prophecies",
    "summarized_story": "The Ghana Police Service (GPS) on Monday warned religious leaders against making misleading prophecies for 2022.\nIn a statement titled “Communication of prophecies and their legal implication”, the security agency cautioned clerics against instilling fear in people’s minds.\nThe GPS said misleading prophecies have resulted in public tensions, anxiety and panic among citizens.\nThe police recalled how, over the years, prophecies of harm and death put the lives of many in danger.\n“The Ghana Police Service wishes to place on record that the police are not against prophecies; we acknowledge that we Ghanaian are religious people who known and believe in centrality of God in our lives”, the GPS added."
  },
  {
    "headline": "Insecurity: Buhari will end insurgency in next 17 months – Presidency",
    "summarized_story": "President Muhammadu Buhari’s spokesman, Femi Adesina has said his principal can end insurgency before the end of his tenure in 2023.\nAdesina said Buhari government would take out those behind insurgency within the next 17 months remaining.\nSpeaking with Channels Television, the presidential spokesman recounted how the Tamil Tigers in Sri Lanka was taken out after 28 years of rebellion.\nI always refer to the Tamil Tigers in Sri Lanka.\nBut one day, the mastermind of that rebellion was taken out and that was the automatic ending of it."
  },
  {
    "headline": "COVID-19 vaccination: 10 million Nigerians get first dose",
    "summarized_story": "The National Primary Health Care Development Agency (NPHCDA) says approximately 10 million Nigerians have received first dose of COVID-19 vaccine.\nThe Executive Director, Dr. Faisal Shuaib gave the update in an interview with the News Agency of Nigeria (NAN) on Monday.\n“As of December 26, 2021, 9,765,729 eligible persons targeted received the first dose, while 4,363,620 got the second dose”, he confirmed.\nShuaib described Nigeria’s COVID-19 vaccine rollout as the biggest vaccination programme in history.\nThe full list of COVID-19 vaccination sites can be found at https://vaccination.gov.ng/vaccination-sitesThe website provides guidelines for persons that have got two doses of AstraZeneca, Moderna, Pfizer Bio-NTech, or one dose of Johnson & Johnson vaccine."
  },
  {
    "headline": "Desmond “Arch” Mpilo Tutu (1931–2021)",
    "summarized_story": "When you met Nelson Mandela, she would say, you knew that you were in the presence of greatness.\n- Advertisement -With Archbishop Desmond Tutu, Dr Abiola would say, you knew you were in the presence of goodness.\nAnd when it was won, there was no happier person in the world than Desmond Tutu.\nThey bespeak genuine affection and appreciation from across the world for his life of service, truth and honesty.\nIt should indeed be said of Desmond Mpilo Tutu that he gave statesmanship itself a whole new meaning."
  },
  {
    "headline": "Harvest of deaths from fatal gas explosions",
    "summarized_story": "There must have been a leakage in her cooking gas called Liquified Petroleum Gas (LPG).\nThe fire was put out at about 12.30 am, through the efforts of five fire trucks from the Lagos State Fire Service and two trucks from the Lagos State Emergency Management Agency Response Unit.\n“The regulation of acetylene gas, oxygen gas and the other related gasses is presently located within the federal ministry in charge of industry.\nCauses of LPG explosionAn expert said an LPG explosion is almost always caused by the accumulation of gas leak in an enclosed space combined with an ignition source, not a propane-LPG tank explosion (gas cylinder explosion).\nAlso, the promise to phase out and replace the gas cylinders in circulation with more advanced ones should be hastened."
  },
  {
    "headline": "Federal Govt set to deploy fighter jets against bandits",
    "summarized_story": "The Federal Government is set for the deployment of 12 Super Tucano jets against bandits as part of concerted efforts by President Muhammadu Buhari to end terrorism before 2023.\nBut, the United States (U.S.) has not given a blank cheque to Nigeria on the use of the fighter jets.\nSources said the Super Tucano jets will be deployed as soon as the gazette against bandits is out.\nThe condition made the Federal Government to apply to a High Court to declare bandits as terrorists, said the source.\nPrincipal Deputy National Security Advisor, Jonathan Finer, said the terms of the agreement during the sale of the 12 Tucano aircraft were unambiguous."
  },
  {
    "headline": "Malami justifies Buhari’s decision on Electoral Bill",
    "summarized_story": "The Attorney-General of the Federation (AGF) and Minister of Justice, Mallam Abubakar Malami (SAN), has justified President Muhammadu Buhari’s rejection of the Electoral Amendment Bill.\nThe AGF, who spoke during an Hausa programme on Radio Kano, said the President has rights to take decision on any bill presented to him.\n“Let’s assume there are about 60 million politicians in the country.\nWhat about the remaining over 160 million Nigerians, who have nothing to do with politics?\nAre you fair to the 160 million Nigerians using their wealth just to conduct primary to produce a party candidate, despite other demands by the public?"
  },
  {
    "headline": "How I was ‘abducted’ in church, by Nwosu",
    "summarized_story": "The 2019 governorship candidate of Action Alliance (AA) in Imo state, Uche Nwosu, has opened up on how he was ‘abducted’ on Sunday in a Gestapo style by security operatives.\nNwosu was arrested during an outing service in honour of his late mother, Jemamah Nwosu, at St. Peter’s Anglican Church, Eziama-Obaire in Nkwerre Local Government Area of Imo State.\nThe government, which had distanced itself from the arrest, yesterday condemned the fact that it was carried out on church premises.\nAlso yesterday, the state Police Command claimed that “officially,” it was not aware that Nwosu had regained his freedom.\n“In this regard, the arrest of Mr. Nwosu within the church premises could have been avoided and therefore stands condemned."
  },
  {
    "headline": "Gunmen kidnap 20 women in Zamfara",
    "summarized_story": "There appears to be no respite for the hapless residents of Zamfara communities as gunmen have again abducted over 20 women and destroyed property, following attacks in 15 villages around Gusau, the state capital.\n“The bandits kidnapped women and girls, took them away.\nThe bandits kidnapped 10 women in Kura at Bayauri they kidnapped nine.\nThey also entered a village called Gana and kidnapped seven before proceeding to Duma and kidnapped another seven.\n“Security operatives, however, intercepted about eight injured bandits at a local health facility, who had gone to seek medical treatment,” he said."
  },
  {
    "headline": "Yoruba nation group unveils App to curb kidnapping in South West",
    "summarized_story": "“In that way, no Yoruba person needs to be alone anywhere on their farms, schools, market places, shops and anywhere else.\n“In short, Yoruba people today, are able now to enjoy security individually and collectively through the use of the App known as Pajawiri.\nThe Ilana Omo Oodua Worldwide owes our engineers who have put this together an enormous debt of gratitude.\nThe Yoruba people also owe a lot of gratitude to the umbrella body of Yoruba self-determination groups, Ilana Omo Oduduwa, for all the encouragement and support that they have given to these engineers.\n“The creators of this App, Pajawiri, have magnanimously offered to put this App Pajawiri freely at the disposal of every Yoruba person for the next 30 days."
  },
  {
    "headline": "Anglican bishop slams Buhari for not signing electoral bill",
    "summarized_story": "He said if senators knew that National Assembly is the oxygen of democracy, they should override the president and pass the bill into law.\nThe National Assembly should put signatures together to override Mr. President.\nAnd if the National Assembly wants the people to clap for them, and the name rubber stamp removed from them, it is time to show it.\nNigerians are clamouring and crying that the electoral bill be signed into law.\nIf the National Assembly knows they are the oxygen of democracy, they should do the right thing; override Mr. President and pass it into law.”"
  },
  {
    "headline": "Stop unending court battles, APGA tells Uba",
    "summarized_story": "From Aloysius Attah, OnitshaNational Coordinator, All Progressives Grand Alliance Media (APGA) Warriors Forum, Chinedu Obigwe, has advised Andy Uba to take a rest and stop unending court battles.\nObigwe said Uba’s alleged claim that APGA has a hand in the Federal High Court’s judgment that disqualified him was tantamount to punching the wind.\nUba’s attempt to link APGA with the recent Federal High Court judgment is a joke taken too far.\nAs a matter of fact, Moghalu went to court with verifiable and reliable evidence and the Federal High Court, Abuja, based its judgment on the evidence presented to it.\n“His threat of appealing the decision of the Federal High Court, Abuja is a medicine after death that will not yield any fruitful result for him."
  },
  {
    "headline": "Passport scarcity affecting 1.5m Nigerians in Italy –NIDOE",
    "summarized_story": "The Nigerian in Diaspora Organisation Europe (NIDO-Europe) has lamented that the scarcity of passports is affecting no fewer than 1.5 million Nigerians in Italy.\nChairman of its Italian chapter, Mr. George Omo-Iduhon, stated this, yesterday, while reflecting on the activities of NIDOE in Europe and Italy.\nHe said the shortage of passports for applicants had frustrated movements and efforts by Nigerians to secure work permits in Italy.\nOmo-Iduhon said the supply of 500 booklets of passports to the Nigerian embassy in Italy was grossly inadequate to serve the number of Nigerians resident in Italy.\n“Using the same sharing formula for all the counties in Europe cannot work in Italy where we have more Nigerians."
  },
  {
    "headline": "Shell, ExxonMobil Face Huge Remediation Costs over Abandoned Onshore Assets",
    "summarized_story": "“The decommissioning and abandonment fund shall exclusively be used to pay for decommissioning and abandonment costs.\nNwakwue said, “There are regulations around assets that are no longer in use and it has nothing to do with the transfer of the assets.\n“All the acquisitions were leveraged buyouts that left several Nigerian banks with massive exposures to the oil and gas sector.\nA leading global oil and gas consulting firm, Wood McKenzie, had put the total value of Shell Petroleum Development Company (SPDC), the subsidiary Shell proposes to totally divest from, at $2.3 billion.\nOnly last month, Nigerian oil and gas company, Seplat Energy, revealed that it was actively engaged in negotiations to acquire ExxonMobil’s shallow water assets in the country."
  },
  {
    "headline": "Omicron: Travel Nightmare as over 2,800 Flights Cancelled",
    "summarized_story": "•US CDC shortens recommended COVID-19 isolation, quarantine timeMore than 2,800 flights were cancelled yesterday as COVID-19 cases surged across the globe.\nHowever, of the more than 2,800 cancelled flights, around 1,000 were within, into or out of the United States, according to FlightAware.\nAccording to the CNN, globally, airlines cancelled more than 6,000 flights on Christmas Eve, Christmas and the day after Christmas.\nIn the United States, more than 1,200 flights were cancelled and more than 5,000 were delayed on Sunday alone as staff and crew call out sick.\nAlaska Airlines, which cancelled 133 flights of 19 per cent of its operations Monday, attributed its cancellations and delays on winter weather in the Pacific Northwest."
  },
  {
    "headline": "Oil Prices Near $80 on Mild Omicron Variant",
    "summarized_story": "Although the variant had been spreading faster than any COVID-19 variant yet, there’s been some relatively relieving news that most people infected with Omicron showed mild symptoms so far.\nOn December 22, Nigeria’s federal lawmakers approved a N17.126 trillion ($38 billion) budget for 2022, anchored on an oil price benchmark of $62 per barrel.\nSenate President, Ahmad Lawan, said the increase in oil price was to reflect the current market values of the oil barrel in the international market and to generate more funds for critical sectors of the economy.\nHowever, the parliament retained the oil production target of 1.88 million bpd, including condensate production of between 300,000-400,000 bpd, for the purpose of its revenue calculation in 2022.\nNigeria has the capacity to pump around 2.2 million b/d of crude and condensate, but in recent months its output has been languishing below 1.55 million bpd."
  },
  {
    "headline": "JOHESU Endorses New Hazard Allowance Approved by FG",
    "summarized_story": "JOHESU Chairman, Biobelemoye Josiah, who spoke on a national television network monitored in Abuja on Monday, said though the new hazard allowance was not exactly what they wanted, the workers have accepted it in the meantime.\nOn the adjustments made to the hazard allowance, Josiah said the unions had accepted the explanation offered by the federal government.\n“As for the approval of the hazard allowance it is not where we wanted to be but as far as we are concerned government pleaded that that is what they can afford for now.\nHe also called for a balance in the leadership of the Health Ministry, saying this would benefit the country.\nHe said it would be wrong for the Federal Ministry of Health to “divert” the funds for other purposes."
  },
  {
    "headline": "Buhari Mourns Mother of THISDAY Executive Director, Morenike Komolafe",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has sent his condolences to the Komolafe family on the demise of their beloved matriarch, Chief Mrs Morenike Victoria Komolafe, the mother of Group Executive Director, THISDAY Newspaper, Kayode KomolafeThe President, in a release on Monday by his spokesman, Garba Shehu, said as an active member of her local community and leader, he believes that Chief Komolafe will be remembered for making important contributions for decades towards the development of her people.\nPresident Buhari expressed confidence that Chief Komolafe’s children, extended family, friends and associates, will continually honour her memory by extending the compassion and selflessness, that epitomised her life, to those in need.\nThe President joined the family in mourning and celebrating the life of a silent achiever and philanthropist, praying God to grant the soul of the departed eternal rest.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "DELSU accused of billing students N4,000 for unprocured magazine",
    "summarized_story": "A firm named Tondek Agency Limited has accused Delta State University (DELSU), Abraka of collecting N4,000 from students for a school magazine that is eventually not procured.\n“We were surprised to hear the VC of the institution deny that the school did not collect N4,000 for the school magazine,” he said.\n“As I speak to you now, the school is collecting N4,000 without remitting to the agency that printed the magazine for two years, and these students were not given the magazine.\n“The N4,000 school magazine fee is one of the pre-requisites for collecting the school certificate or for clearance of admission, so students are still paying the money but we’re not given the magazine.\nEgwunyenga said there was never a time in his administration that the institution exploited students or demanded any payment of N4,000 for the production of the school magazine."
  },
  {
    "headline": "Abia varsity sacks lecturer in sex-for-grade scandal",
    "summarized_story": "Abia State University has sacked Michael Ukaegbu, a senior lecturer, for his alleged involvement in a sex-for-grade scandal.\nThe meeting, which was held at the university council chamber, was chaired by Adolphus Wabara, the chairman and pro-chancellor of the institution’s council.\n“Council-in-Session ratified the dismissal of Dr Michael I. Ukaegbu, former Ag.\nHead, Department of Mass Communication for involvement in sex-for-grade and Mr Leonard Chukwuma for fraud and admission racketeering,” the statement read.\nRecently, cases of lecturers soliciting sex have been rampant across universities in Nigeria."
  },
  {
    "headline": "PHOTOS: 16-year-old student becomes one-day governor in Abia",
    "summarized_story": "Nnenna Precious Okorie, a 16-year-old Nigerian girl, became a one-day governor in Abia state.\nAdvertisementThe student of Galaxy Gem college student was honoured after beating 20 finalists in the state’s essay competition.\nNnenna was made a governor for a full day while the 19 other finalists formed her cabinet.\nThe student, as part of the initiative, visited a hospital and helped offset the bills of patients who couldn’t pay.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from TheCable.Follow us on twitter @Thecablestyle"
  },
  {
    "headline": "Release autopsy result on late student, FCT school’s parents tell police",
    "summarized_story": "The Parents Teachers Association (PTA) of Premiere Academy in Abuja has called on the police to release the autopsy result on the student of the school who died of alleged sexual assault.\nAdvertisementThe 14-year-old student died in controversial circumstances in June while she was being hospitalised at Queens Clinic, Abuja.\nThe institution, however, dismissed the claim, adding that it would release a “factual and composite” statement after the police have concluded an investigation into the matter.\nAdvertisementIn a statement released after a meeting with the school’s management, the parents said making the autopsy result public would address the controversies trailing the incident.\nThe parents described the student’s death as “heart-rending”, adding that the association will continue to advocate justice for the bereaved family."
  },
  {
    "headline": "Maraji opens up on 'secret' marriage, pregnancy and hemorrhoids battle",
    "summarized_story": "Gloria Oloruntobi, the Nigerian comedian better known as Maraji, has narrated her battle with hemorrhoids.\nAdvertisementIn a vlog post, the comedy star who recently announced her pregnancy said she got married in 2021.\nShe also said she was surprised at how quickly she conceived after undergoing hemorrhoidectomy, a surgery to remove her hemorrhoids.\nMaraji said she was scared of losing her child due to her battle with Polycystic ovary syndrome (PCOS).\nI’d always thought it would take me a while to get pregnant to the point that I’d bought ovulation test kits."
  },
  {
    "headline": "Ask an Investor: Twelve insights from Africa’s top investors",
    "summarized_story": "While most people easily associate investors with just money, Founders Factory Africa (FFA) would rather have you think of more.\nMeghan Curran, West African Director of Acumen, explained this: “In our model, nothing goes back to the investors because the investors in the first place are donors.\nBefore the boom, Sawari Ventures, which was founded over a decade ago, has been backing North African startups.\nNow I’ve seen some term sheets where the investors ask that if the founder opts to pay back the investment, the investor gets some amount of free equity in the company.\nToday, LoftyInc operates three funds that have deployed over $12 million into over 75 African startups like Flutterwave, Andela and Trella."
  },
  {
    "headline": "GetEquity is changing startup investment in Africa. But how?",
    "summarized_story": "GetEquity, a Nigeria-based investment platform, came into the market with the mantra of “challenging the status quo of startup financing and venture capital” in Africa.\nInitially, the co-founders didn’t set out to democratise startup investment in Africa.\nOn GetEquity, startups get instant access to several angel investors, syndicates and institutional investors.\nApparently, GetEquity operates like every other VC: its team of diverse backgrounds—law, marketing, investment, business development—analyse the potential growth of a startup before onboarding them on their platform.\nIf that’s the case, one can chose to question the validity of the disruption the company promises to bring into startup investment."
  },
  {
    "headline": "Inside Jack Dorsey’s Btrust members’ plan to facilitate financial freedom",
    "summarized_story": "In 2020, he co-founded Recursive Capital, a venture capital that provides crypto-focused startups with seed and early-stage investments, with the aim of contributing to the development of the Web 3.0 ecosystem.\nDespite being founded before the Web 3.0 buzz, Recursive Capital had decided that it wanted to enhance financial freedom by decentralising the financial monetary system.\nTalking about the barrier to entry for Bitcoin, Khalil believes a misconception lies in the way people approach it.\nKhalil believes in educating and enlightening individuals about Bitcoin’s long-term benefits: economic freedom for the entire continent.\nOchai believes that bitcoin will eventually become a viable medium for Africans to do business without restrictions."
  },
  {
    "headline": "West African e-commerce platforms take local fashion makers global",
    "summarized_story": "The sheer size of the African Diaspora means there’s a large potential market for African fashion collections outside the continent.\nWhile in Paris, he discovered that the Africans he came across abroad were mostly interested in African fashion items but could not readily access them.\nThe company also recently launched ANKA, a SaaS e-commerce solution for African fashion designers and merchants, offering a single dashboard to manage multiple sales channels, inventory, and payments.\nPhoto credit: UmaiziWhether curators like Afrikrea or single-brand sites such as Ghana’s KIKI Clothing, platforms for African fashion tap into a growing global demand for African designer goods, riding on e-commerce.\nThat presents an opportunity for local retailers to promote African fashion globally, especially with consumers increasingly switching to online shopping amid the raging Covid-19 pandemic."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Worried about your child’s online safety during holidays? Try these tools",
    "summarized_story": "Nearly all social media platforms have age restrictions of at least 13 years to use their platform.\nWith many divided on the move, China’s regulatory authority has implemented regulations requiring social media and gaming companies to disincentivise youth from spending too much time on social media.\nGiven the several reported cases of online abuse on the platform, online safety precautions need to be taken, especially for young people.\nTikTokPhoto by Solen Feyissa on UnsplashWith over 2.6 billion downloads, TikTok is one of the most used social media platforms globally.\nLike every other social media platform, it has its safety issues."
  },
  {
    "headline": "After 5 reluctant years of bootstrapping, CinetPay is closing in on Francophone Africa dominance",
    "summarized_story": "“We saw that we have a good opportunity with mobile money because many people have mobile money accounts.\nCinetPay has been Flutterwave’s Francophone Africa partner since 2019.\nA little bit more detail about CinetPayCinetPay helps merchants in the Francophone Africa region accept and collect online payments from mobile money wallets in nine countries.\nAccording to the Francophone Africa and the Equality Challenge 2019 Report by the University of Chester Area Studies Research Group, female literacy rates in Francophone Africa have not been growing consistently, with outdated datasets being used for policy making and decision making.\nThe plan for now, though, is to focus on consolidating their hold in Francophone Africa."
  },
  {
    "headline": "Here’s to more stormy years with plenty of wins",
    "summarized_story": "MAX raises $31 million for its electric vehicle subscriptionSource: MAX.ng TwitterNigerian mobility startup, Metro Africa Xpress (MAX) has closed a $31 million Series B funding round.\nThe startup also moved into Nigeria’s capital market after completing the issuance of a ₦400 million ($1 million) bond in September 2020.\nMaxAB’s $55m Series A, MNT-Halan’s $120m, Paymob’s $18m Series A, and Trella’s $42 million Series A made the highlights.\nGenerally, it’s a good year for Africa’s startup funding scene.\nTechpoint Africa Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "COVID-19: Travel trends to look out for in 2022",
    "summarized_story": "As the world battles a new variant of COVID-19 just a few months after it seemed as though global travel was recovering, the uncertainties around travel are already making people set trends on how they want to travel in the coming year.\nThe resurgence of COVID-19 is accentuating the alteration of social and business norms and interactions, while also becoming tiresome.\nBesides, travel restrictions, including testing requirements and quarantine, are also forcing people to opt for domestic travel or within the same region.\nDomestic tourism/travelThe driving force behind the recovery of the tourism industry and the local economy; domestic tourism is what travel experts believe will be the first step and leading role in 2022 trends in the travel industry.\nWith travel bubbles on hold, travelling closer to home is the perfect way to itch that travel bug while having as little impact as possible."
  },
  {
    "headline": "NIGERIA IN 2022: Five high-yield investment strategies in 2022",
    "summarized_story": "Investors expect T-Bills rates to plunge further in the first quarter of 2022 before picking up in the second quarter of next year.\nLooking at the key themes that are likely to shape the investment landscape for 2022, Afrinvest identified the following investment pointers that can guide investors towards an appropriate investment strategy next year.\nThe firm advised that in 2022, it will be better to identify and position investors’ portfolios to benefit from market movement.\n“One of the key things that will differentiate great investors in 2022 is the fact that they can time the market,” it said.\nAs a result, it highlighted that diversification remains a key theme of its 2022 strategy."
  },
  {
    "headline": "Ten most rated Nigerian movies on Netflix in 2021",
    "summarized_story": "BusinessDay examines the top ten best movies available on the streaming service.\nHere are the 10 most rated Nigerian movies on Netflix in 20211.\nThe movie stars Funke Akindele-Bello in a dual role as Lefty and Ayomide, who are twin sisters living polar opposite lifestyles.\nOne Lagos NightOne Lagos Night is a 2021 Nigerian crime comedy film set in Lagos.\nFine wineFine Wine is a 2021 Nigerian romantic comedy film directed by Nigerian American filmmaker Seyi Babatope and written by Temitope Akinbode and Diche Enunwa."
  },
  {
    "headline": "2023 elections: I’ll not negotiate behind you, Obaseki assures PDP leaders – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has assured leaders of the Peoples Democratic Party (PDP) in the state that he will not negotiate behind the party leaders as the 2023 general elections draw near.\nObaseki gave the assurance during a get-together for party leaders in Benin City, Edo State.\nPDP is the ruling party in Edo State and will continue to be, as some people find it difficult to believe.\n“We have a strong party united at the base as the harmonization was done from the ward level.\n“It is only the people that can give you political power; no one outside Edo State can do that."
  },
  {
    "headline": "Obaseki visits family of late Uwaila Omozuwa, distributes food items to orphanages – Nigerian Observer",
    "summarized_story": "Late Uwaila, a 100 Level Microbiology student of the University of Benin was gruesomely murdered in a church in 2020.\nThe federal and state governments have taken stiffer actions against gender-based violence.\nWe are here to continue to celebrate her life as we continue to fight against gender-based violence.\n“Her death was the reason for the establishment of gender-based violence committee.\nThe Edo State Government has put mechanisms in place to fight gender-based violence related offences."
  },
  {
    "headline": "Edo, Delta States Will Witness Unperturbed Security – Zone 5 AIG Assures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The zone 5 police command comprising Edo and Delta States will henceforth enjoy unperturbed security as the newly deployed Assistant Inspector General of Police (AIG), Ahmad Abdurrahman vows to cleanse the zone of criminals and their allies.\nAIG Ahmad Abdurrahman stated this when he disclosed his mission in the zone to our reporter at his office, Adesuwa road, Off Sapele road, Benin City on December 16, 2021.\nAIG Ahmad Abdurrahman stated.\nAIG Ahmad stated.\nIt will be recalled that AIG Ahmad Abdurrahman assumed duty in zone 5 on December 16, 2021 after taking over from AIG Isaac O. Akinmoyede who has been redeployed to zone 9, Umuahia."
  },
  {
    "headline": "Christmas: Foundation Rolls out Party for Children with Special Needs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – In the spirit of Christmas, the Christabel Otueroro Foundation (COF) has rolled out Christmas party for children with disabilities last weekend in Benin City.\nThe party which was attended by physically challenged children from various care homes in Edo State and their care givers featured dance, singing, poems and refreshments with a theme “happy children, blessed children”.\nAccording to the Executive Director/Convener of COF, Comrade Onome Otueroro “it has become a tradition for the foundation to celebrate special needs children because we believe that children with disabilities deserve to be cared for.\nThis is because for the past nine years, this foundation has not failed to lavish Christmas party on children with disabilities.\nBut much of these challenges have been addressed in the Act that once domesticated in Edo State, will bring relief to us”."
  },
  {
    "headline": "National Assembly sends 2022 budget to Buhari for assent",
    "summarized_story": "Nigeria’s National Assembly has transmitted the 2022 Appropriation Bill to President Muhammadu Buhari for assent.\nThe assembly also raised oil benchmark from the proposed $57 per barrel to $62.\nPresident of the Senate, Ahmad Lawan, had said the budget would be transmitted to Buhari by Thursday.\nA communication from the Clerk to the National Assembly, Ojo Amos, to the Presidency showed that the budget was transmitted on Friday and received by the Office of the Chief of Staff to the President on Saturday.\nA2, Laws of the Federation of Nigeria, 2004, I wish, with due respect, to forward to Your Excellency, the authenticated copies of Appropriation Bill, 2022, for your consideration and assent."
  },
  {
    "headline": "Nigeria loses N69.5bn to gas flaring in one month",
    "summarized_story": "Adebayo ObajemuAccording to the report from the National Oil Spill Detection and Response Agency, NOSDR, Nigeria lost $169 million, an equivalent of N69.53 billion, in one month, due to the flaring activities of oil and gas firms in the country which reportedly flared 48.3 billion standard cubic feet (BSCF) of gas.\nNOSDRA, which gave this figure in its latest report said that the volume of gas flared in November was 136.76 per cent higher, when compared with the 20.4 billion SCF of gas, valued at $71.5 million, an equivalent of N29.42 billion, flared in October.\nAside the actual value of gas the country lost to flaring in November 2021, NOSDRA stated that oil and gas firms are also liable to pay total fines of $96.6 million, about N39.74 billion; compared with penalties of $40.9 million (N16.83 billion) recorded in the previous month.\nIt noted that the volume of gas flared in the month in question is an equivalent of 2.6 million tonnes of carbon dioxide emitted into the environment, which has the potential of generating 4,800 gigawatts hour of electricity.\nThe gas flared offshore in November, according to NOSDRA, is also capable of generating 2,500 gigawatts hour of electricity and is equivalent to 1.4 million tonnes of carbon dioxide emissions."
  },
  {
    "headline": "No attack on SGF’s home town – Police",
    "summarized_story": "Adebayo ObajemuThe Adamawa State Police Command has refuted an online report that Boko Haram fighters and bandits attacked the home town of the Secretary to the Government of the Federation (SGF), Boss Mustapha.\nHe said as of press time, there was no report from the security operatives that the area was under attack.\n“The command received unverified information that people are fleeing from some villages as a result of alleged Boko Haram attacks.\nAlso when contacted, Simon Yakubu, the District Head of Dugwaba, dismissed the online report and described it as a “misleading“.\nThe District Head stated that there was nothing like attack, and that the people were living peacefully and celebrating Christmas in the villages mentioned in the online report."
  },
  {
    "headline": "Obasanjo to Clark: Oil in Niger Delta belongs to Nigeria, imagine what would have happened to your people if Igbo won Biafra war",
    "summarized_story": "By OBINNA EZUGWUNigeria’s former president, Chief Olusegun Obasanjo has responded to an open letter to him by leader of the Pan Niger Delta Forum (PANDEF), Chief Edwin Clark accusing him of hating the people of the Niger Delta region, noting that he had never shown anger or distraught to the Niger Delta region or any part of the country.\nClark argued that Obasanjo’s comments that the oil found in the Niger Delta does not belong to the people of the region represents his continuous arrogant stance and disposition against Niger Delta.\n“All those who purchase crude oil from Nigeria enter into contractual relationship with Nigeria not with the Niger Delta.\nAll those who purchase crude oil from Nigeria enter into contractual relationship with Nigeria not with the Niger Delta.\nOn resumption of office as President of Nigeria in 1999, the first meeting I held out of Abuja was a meeting on the Niger Delta Region."
  },
  {
    "headline": "Church Arrest: Imo CAN Apologies To Anglican Church",
    "summarized_story": "The Imo State chapter of the Christian Association of Nigeria (CAN) has restated support for the state government and security agencies to rid the State of banditry and all forms of criminality.\nThis is even as they apologised to the Anglican Church over the invasion of its church to effect the arrest of Chief Uche Nwosu, son-in-law to former Governor Rochas Okorocha, on Sunday, in Eziama Obaire in the Nkwerre local government area of Imo State.\nThe apology was contained in a statement signed by the state CAN chairman, Revd Eches Divine Eches, in Owerri, the state capital on Monday.\nAccording to him, the invasion of St Peter’s Anglican Church, Eziama Obaire, could have been avoided.\nFurther, it stated support for the state government and authorities in their efforts to rid the State of criminality and banditry."
  },
  {
    "headline": "Ogun ‘ll Assume Oil Producing Status Soon – Gov Abiodun",
    "summarized_story": "Ogun State governor, Prince Dapo Abiodun, has disclosed that his administration was working towards ensuring that the state takes advantage of its rich oil deposit to become an oil producing state.\nAbiodun gave this position during the convocation lecture he delivered at the combined 2nd and 3rd convocation ceremony of the Mountain Top University, titled, “Quest for Excellence: The Nexus of Faith, Knowledge and Resilience”.\nThe governor expressed disappointment that Ogun lost a US$16 billion Dangote refinery to Lagos after a break in discussion between the immediate past administration in the Stte and Dangote Group.\nThe governor affirmed that the state has very rich oil reserves in Tongeji Island, adding that “Ogun state is situated in the Dahomey Basin, which stands for the Niger Delta that goes all the way to Ghana.\nADVERTISEMENT“Everyone of the states in that corridor are oil producing today, even Ondo and Lagos states,” he added."
  },
  {
    "headline": "Yuletide: Passengers Commend Federal Govt Over Free Train Ride",
    "summarized_story": "Railway passengers in Lagos and Kaduna have commneded the decision of the Federal Government to introduce free ride on all routes to celebrate the yuletide season.\nThose who spoke also lauded the giant strides of President Buhari government in the rail transportation sector in the last six years.\nThose who spoke lauded the rail transportation as viable platform for exploring the nation’s country side.\nOn his part, a passenger in Kaduna, Sunday Hassan, stated that the free trip between Abuja and Kaduna helped him in no small way to reach home on time for Christmas.\n“I thank the Federal Government to introducing the free rides to Kaduna."
  },
  {
    "headline": "Yuletide: Passengers Commend Federal Govt Over Free Train Ride",
    "summarized_story": "Railway passengers in Lagos and Kaduna have commneded the decision of the Federal Government to introduce free ride on all routes to celebrate the yuletide season.\nThose who spoke also lauded the giant strides of President Buhari government in the rail transportation sector in the last six years.\nThose who spoke lauded the rail transportation as viable platform for exploring the nation’s country side.\nOn his part, a passenger in Kaduna, Sunday Hassan, stated that the free trip between Abuja and Kaduna helped him in no small way to reach home on time for Christmas.\n“I thank the Federal Government to introducing the free rides to Kaduna."
  },
  {
    "headline": "NSCDC Boss Tasks Private Security Firms On Performance",
    "summarized_story": "The Commandant General of Nigeria Security and Civil Defence Corps, (NSCDC), Ahmed Abubakar Audi, has asked private security organisations in the country to live up to government’s expectations from them.\nHe spoke recently in Lagos when a private security firm, Turret International Services Limited, was awarded ‘Emerging Security Company of the Year 2021’ Award by the Association of Licensed Private Security Practitioners of Nigeria (ALPSPN).\nIn attendance at the ceremony were the Lagos State commandant of NSCDC, Eweka Edenabu, the national president of ALPSPN, representative of Lagos State Security Trust Fund as well as other distinguished business leaders in security circle.\n“Turret International Services Limited is committed to comply with customer satisfaction as well as statutory requirements by providing services through the application of Quality Management System.\nIt could be recalled that Turret international Services received Category A license in July 2020 at the corporate headquarters of the NSCDC to operate as a private security firm in the country."
  },
  {
    "headline": "Opinion: I Stand With Buhari On Withheld Assent To Electoral Amendment Bill, 2021 – By SUNDAY EZE",
    "summarized_story": "The insertion of direct primary election in the Electoral Amendment Act, 2021 as a criterion for nomimation of candidates by political parties was ill conceived.\nIn a space of three years; President Muhammadu Buhari had on two occasions withheld his assent to the Electoral Amendment Bill, 2010 as amended.\nIn a letter to the National Assembly, dated December 13, 2021, titled ‘Withholding of assent to Electoral Act (Amendment) Bill 2021,’ Buhari premised his decision on legal, security and economic grounds.\nFifth, it is undemocratic to restrict the procedure or means of nomination of candidates by political parties, as it also amounts to undue interference in the affairs of political parties.\nPerusing through the reasons adduced by the President for withholding his assent, one has no other option than to stand with Buhari in this one."
  },
  {
    "headline": "Opinion: I Stand With Buhari On Withheld Assent To Electoral Amendment Bill, 2021 – By SUNDAY EZE",
    "summarized_story": "The insertion of direct primary election in the Electoral Amendment Act, 2021 as a criterion for nomimation of candidates by political parties was ill conceived.\nIn a space of three years; President Muhammadu Buhari had on two occasions withheld his assent to the Electoral Amendment Bill, 2010 as amended.\nIn a letter to the National Assembly, dated December 13, 2021, titled ‘Withholding of assent to Electoral Act (Amendment) Bill 2021,’ Buhari premised his decision on legal, security and economic grounds.\nFifth, it is undemocratic to restrict the procedure or means of nomination of candidates by political parties, as it also amounts to undue interference in the affairs of political parties.\nPerusing through the reasons adduced by the President for withholding his assent, one has no other option than to stand with Buhari in this one."
  },
  {
    "headline": "Alleged extortion: DELSU accused of collecting N4,000 for school magazine from students",
    "summarized_story": "A firm, Tondek Agency Limited has accused Delta State University, Abraka of collecting N4,000, from students for a school magazine without giving them the university magazine.\nHowever, the agency which was in charge of the production of the school magazine since 2017 urged Prof Egwunyenga to stop denying it, noting that it had available evidence of payments made by students to prove their claims.\nHe said, “We were surprised to hear the VC of the institution deny that the school did not collect N4,000 for the school magazine.\n“They have been collecting the money since we introduced the magazine in 2017, as I speak to you now, the school is collecting N4,000 without remitting to the agency that printed the magazine for two years, and these students were not given the magazine.\nHe said, “When I came in as VC, I discovered fraud in the publication of the magazine, immediately I directed Students to stop paying for the DELSU @ 25 magazine, especially at a time when DELSU is about 30 years."
  },
  {
    "headline": "Alleged extortion: DELSU accused of collecting N4,000 for school magazine from students",
    "summarized_story": "A firm, Tondek Agency Limited has accused Delta State University, Abraka of collecting N4,000, from students for a school magazine without giving them the university magazine.\nHowever, the agency which was in charge of the production of the school magazine since 2017 urged Prof Egwunyenga to stop denying it, noting that it had available evidence of payments made by students to prove their claims.\nHe said, “We were surprised to hear the VC of the institution deny that the school did not collect N4,000 for the school magazine.\n“They have been collecting the money since we introduced the magazine in 2017, as I speak to you now, the school is collecting N4,000 without remitting to the agency that printed the magazine for two years, and these students were not given the magazine.\nHe said, “When I came in as VC, I discovered fraud in the publication of the magazine, immediately I directed Students to stop paying for the DELSU @ 25 magazine, especially at a time when DELSU is about 30 years."
  },
  {
    "headline": "BREAKING: Enugu State Broadcasting Service Gutted By Fire",
    "summarized_story": "On Tuesday morning, a fire destroyed the Enugu State Broadcasting Service’s headquarters.\nAlthough the cause of the incident remained unknown at the time of reporting this story, station insiders told our correspondent that it started immediately after the station opened about 5.30 a.m.\nDetails later…"
  },
  {
    "headline": "Buhari Can End Insurgency Before He Leaves Office In 17 Months — Femi Adesina",
    "summarized_story": "The presidential spokesman, Femi Adesina, expressed optimism that high-profile militants would be “taken out” before the current administration ends.\nAdesina claimed in an interview with Channels Television’s Sunday Politics that with current efforts to improve security, the insurgency might be put to an end within President Muhammadu Buhari’s remaining 17 months in office.\nBut how would you really describe the living standard of the average Nigerian so we can know where we are going?\nFirst, how do you describe the living standard of the average Nigerian today?\n“Well, we live in a challenged society — challenged politically, challenged security wise, challenged economically."
  },
  {
    "headline": "Police Deny Attack On Boss Mustapha’s Home Town",
    "summarized_story": "Boko Haram insurgents and bandits targeted the home town of the Secretary to the Government of the Federation (SGF), Mr Boss Mustapha, according to Adamawa State police.\nNguroje told the News Agency of Nigeria (NAN) that anti-terrorism and anti-kidnapping teams, as well as undercover officers, had been dispatched to the region.\nHe stated that no security personnel have reported that the region has been attacked thus far.\n“As security personnel, we do not play with any information that borders on insecurity.\n“The command immediately deployed anti-terrorism squad and intelligence officers to the suspected areas and so far there has been no report of attack or people fleeing their villages,” Nguroje told NAN."
  },
  {
    "headline": "Uche Nwosu’s Arrest: Okorocha Issues 24 Hours Ultimatum To Police",
    "summarized_story": "Senator Rochas Okorocha of Imo West has given the police 24 hours to expose his son-in-law Uche Nwosu’s crime.\nIf the police do not comply with Okorocha’s demand within the next 24 hours, he has threatened to take legal action to force the police to release the politicians’ alleged crime.\nNwosu, a former Chief of Staff to Governor Rochas Okorocha, was apprehended on Sunday at St Peter’s Anglican Church, Eziama Obieri, in the state’s Nkwerre Local Government Area.\nHowever, speaking with journalists in Owerri, the state capital, Okorocha said: “I am going to wait for 24 hours to know what Nwosu has done.\n“24 hours is enough for the police to do that which is legal."
  },
  {
    "headline": "Breaking: Presidency reveals when Buhari will sign 2022 budget as NASS transmits estimates",
    "summarized_story": "The Presidency has revealed that President Muhammadu Buhari is scheduled to sign the 2022 Appropriation Bill on Friday.\nThis comes barely a week after lawmakers in the House of Representatives and Senate chambers of the National Assembly passed a budget of N17.126 trillion, increasing the benchmark price of crude from $57 to $62 per barrel.\nThe two chambers also increased the budget spending by N735.8 billion from the proposed N16.391tn to N17.126 trillion.\nThey also raised oil benchmark from $57 per barrel proposed by the executive to $62.\nIn October, President Buhari presented the 2022 budget to the national assembly."
  },
  {
    "headline": "2022: Health workers set to strike if… – Official",
    "summarized_story": "The Joint Health Sector Unions (JOHESU) and Assembly of Healthcare Professional Associations (AHPA) have said they would not guarantee industrial peace in the sector if Consolidated Health Salary Structure (CONHESS) is not adjusted in the 2022 Budget before passage.\nHe said the unions would not guarantee industrial harmony in the health sector if the president fails to include the adjusted salary structure.\nJosiah said the unions were aware of a provision of N80 billion set aside to take care of the salary adjustment for health workers.\nHe said it would be wrong for the Federal Ministry of Health to “divert” the funds for other purposes.\nJosiah added: “If any government wants a proper health system, a developed health system in this country we should change from this leadership where they put medical doctors at the helm of affairs."
  },
  {
    "headline": "At last, Kano state government breaks silence on Miss Nigeria 2021 controversy",
    "summarized_story": "The Kano state government has explained its silence over the controversy trailing the emergence of 18-year-old Shatu Garko, an Hijabian model and indigene of the state who recently emerged Miss Nigerian 2021 at a keenly contested competition in Lagos.\n“We (Hisbah) have confirmed that Shatu Garko is a Muslim from Kano State and her parents are from Garko Local Government Area.\nSome respondents were of the view that it was wrong for a Muslim woman to display her treasure in the full public glare.\n“It is highly disgusting for one to hear that a Muslim woman from Kano state had won a keenly contested beauty contest involving prominent society ladies.\n“I wonder how the issue of this beauty contest should be blown out of proportion."
  },
  {
    "headline": "JUST IN: Buhari To Sign 2022 Budget On Friday",
    "summarized_story": "President Muhammadu Buhari will sign the 2022 Appropriation Bill on Friday, the Presidency has confirmed.\nAccording to him, the 2022 budget has been transmitted by the National Assembly and the President will sign the bill into law by 10am.\nREAD ALSO: Reps Pass 2022 Budget Of N17.126trnMeanwhile, Channels Television has obtained a communication addressed to the Presidency by the Clerk to the National Assembly, Mr Ojo Amos.\nThe National Assembly raised the total 2022 budget figure from the proposed N16.391 trillion to N17.126 trillion.\nSigning the budget before the end of the year will enable Nigeria to continue on the path of a one-year budget cycle."
  },
  {
    "headline": "Uche Nwosu: CAN Apologises To Anglican Church, Condemns Police Invasion",
    "summarized_story": "The Christian Association of Nigeria (CAN) in Imo State has apologised to the Anglican Church over the invasion of the church by security operatives.\n“The Christian Association of Nigeria (CAN), Imo State chapter hereby apologises to the Anglican Church over the recent incident of the arrest of Uche Nwosu in one of its parishes,” he said.\n“We believe that this could have been avoided.”Policemen had stormed St. Peter’s Anglican Church, Eziama-Obaire in Nkwerre Local Government Area of Imo State on Sunday, sparking outcry in parts of the country.\nREAD ALSO: Okorocha’s Son-In-Law, Uche Nwosu Regains FreedomThe heavily-armed security operatives stormed the church with high-powered security vehicles and shot sporadically into the air before arresting Mr Uche Nwosu, a former governorship candidate in Imo and son-in-law of former Governor Rochas Okorocha.\nCondemning the action of the policemen, Divine-Eches asked security agencies to ensure they carry out their duty in a professional manner."
  },
  {
    "headline": "Three Feared Dead, Many Kidnapped As Gunmen Invade Zamfara Communities",
    "summarized_story": "Three persons have reportedly been killed on Sunday after gunmen suspected to be bandits invaded some communities under Gusau Local Government Area of Zamfara State.\nAn unspecified number of villagers, mostly women, were said to have been kidnapped during the assault.\nIt was gathered that the majority of the people in these villages have started leaving their communities to Gusau, the state capital, for safety.\nFurther confirming the attacks, the Zamfara State Commissioner for Information, Ibrahim Dosara told Channels Television that contrary to reports, only Geba community was attacked on Sunday.\nHe also denied claims by some residents that security operatives did not intervene, stressing that soldiers have gone to Geba village and the bandits have been chased away."
  },
  {
    "headline": "1999 Politics Has Expired, Young People Are Taking Over – Obaseki",
    "summarized_story": "﻿Edo State Governor Godwin Obaseki believes Nigeria’s political system has failed the nation.\nAccording to him, the kind of politics played in 1999 is no longer relevant as young people are set to take over.\n“The politics we started in 1999 has now expired or is expiring.\n“So anybody who is playing politics the way it was played in 1999 cannot succeed because the children who were five, six years old in 1999, today are now getting married.\nThe old order can no longer hold."
  },
  {
    "headline": "China Expands Lockdowns As COVID-19 Cases Rise",
    "summarized_story": "The Xi’an lockdown is the most sweeping in China since the similarly-sized Wuhan was sealed off.\nMore than 800 coronavirus cases have been recorded in Xi’an since December 9, with the youngest case a 38-day-old infant, the state-run Global Times newspaper reported Tuesday.\n– ‘There’s no food’ –Many residents Tuesday posted on social media platforms to call for help in acquiring food and other essentials.\nOne Xi’an resident surnamed Liu told AFP on Tuesday that chaotic management of some communities was behind the shortages.\nA resident surnamed Wei said staff at her compound collected residents’ online orders at the entrance and delivered them to her door in person."
  },
  {
    "headline": "Somali President suspends PM Roble, accuses him of undermining legislative elections",
    "summarized_story": "President of Somalia Mohamed Abdullahi Mohamed stated Monday that he is suspending Prime Minister Mohamed Hussein Roble, widening the political schism between the country’s top officials.\nAccording to a spokeswoman for President Mohamed, also known as Farmajo, the move was taken in response to an investigation into an illegal acquisition of public land involving Prime Minister Roble.\nThe prime minister accused Mohamed of obstructing parliamentary elections, prompting Roble’s suspension.\nEarlier this year, the feuding leaders agreed to enable 101 delegates to choose members of parliament, who would then choose the future head of state.\nObservers fear that the feud between Farmajo and Roble will divert attention away from the ongoing threat posed by the al Shabab insurgent group, which has fought the central government in an attempt to seize power and impose sharia law in Somalia, which has been wracked by chaos and conflict since the overthrow of former dictator Mohamed Siad Barre in 1991."
  },
  {
    "headline": "How Police arrested Okorocha's son-in-law, Uche Nwosu during Church service -",
    "summarized_story": ""
  },
  {
    "headline": "Thugs Attack PDP Congress Venue, Destroy Vehicles, Chairs, Others -",
    "summarized_story": "Unknown thugs have attacked venue of the Zamfara State Peoples Democratic Party State CongressThe congress is to enable party members to Elect Officials that will steer the ship of the party in the next three yearsThis follows the recent Defection of the state Governor Bello Matawalle from the PDP to the ruling APCThe thugs attacked the venue of the congress and started pelting stones on some members of the party who were on ground before the commencement of the congressVehicles, Chairs, Canopies and other valuables at the venue were destroyed by unidentified political thugs who’s mission was to prevent the conduct of the congressAuthorities of the party says no amount of intimidation will prevent them from conducting their party Congresses which is their Constitutional rightThe Zamfara State PDP has relocated the congress to another venue which seems to be more saferThe Congress is ongoing in an undisclosed venueEfforts to speak to police in the state proves abortive as the spokesperson of the command is not responding to phone calls"
  },
  {
    "headline": "Respect Buhari, keep to February 5 national convention date, group tells Buni's CECPC -",
    "summarized_story": "A group within the governing All Progressives Congress (APC) under the umbrella of Progressive Mandate Movement (PMM) has challenged Mai Mala Buni-led Caretaker Extraordinary Convention Planning Committee (CECPC) to ensure that the party’s national convention does not fail to hold by 5th of February, 2022.\nThe group also demanded immediate release of processes leading to the national convention, adding that if nothing is done by January 5th 2022, the National Secretariat will be made ungovernable for the CECPC.\nThe statement claimed that President Muhammadu Buhari had wanted the APC National Convention to hold in December 2021 but due to appeal by the Buni’s CECPC, the presidency agreed to February 2022.\n“The delay in conducting the overdue APC national convention is already giving the opposition Peoples Democratic Party some advantages, making it look like nobody is in charge of the governing party.\n“We therefore call on Governor Mai Mala Buni-led National Caretaker Committee not to go beyond February 5 to hold our party’s National Convention."
  },
  {
    "headline": "Outrage Over Dangerous Car Racing by Rich Kids Forces Police Clampdown in Abuja",
    "summarized_story": "The Federal Capital Territory Police Command disclosed that it arrested on Monday four suspects and impounded 21 cars over illegal car racing and other similar offences in Abuja.\nFCT residents had raised the alarm over the threat to lives, property and infrastructure posed by the deadly car racing.\nThe car racing, which had become a menace in the nation’s capital, are usually conducted around the Central Area, Area 10 and Areas One and Two in Garki District.\nThe outcry prompted the police to enforce the prohibition of car and speed races in the nation’s capital.\nThe police command had earlier ordered full enforcement of the prohibition of all kinds of car and speed races in the territory."
  },
  {
    "headline": "Nigeria’s Ex-President Jonathan Left $28.6bn External Reserves, Aide Retorts",
    "summarized_story": "Reno Omokri, an aide to former President Goodluck Jonathan, has refuted claims that the latter left behind funds that could last barely for three weeks in 2015.\n“Rotimi Amaechi is just a useless liar, who thinks he can get APC’s vice presidential slot by attacking former President Jonathan.\nThe whole of Nigeria will soon see what Buhari will leave behind, apart from N40 trillion debt,” he added.\nHe said Amaechi begun life as Peter Odili’s aide, saying inferiority complex had refused to leave him.\n“Sadly, he has a perpetual problem with self worth and Nigerians are cautioned not to take him seriousl,” Omokri added."
  },
  {
    "headline": "Shell, ExxonMobil Face Huge Remediation Charges in Nigeria Over Abandoned Offshore Assets",
    "summarized_story": "Shell Petroleum Development Company of Nigeria and ExxonMobil are presently faced with huge remediation costs over their failure to properly decommission and cap oil and gas assets across the Niger Delta, especially the ones sold to Nigerians in recent divesture programmes.\nFindings by THISDAY have revealed that many of the oil and gas assets sold to Nigerians, mostly by the International Oil Companies (IOCs), are rarely decommissioned or properly abandoned, a development that clearly breaches existing laws regulating the industry.\nNwakwue said, “There are regulations around assets that are no longer in use and it has nothing to do with the transfer of the assets.\nA leading global oil and gas consulting firm, Wood McKenzie, had put the total value of Shell Petroleum Development Company (SPDC), the subsidiary Shell proposes to totally divest from, at $2.3 billion.\nOnly last month, Nigerian oil and gas company, Seplat Energy, revealed that it was actively engaged in negotiations to acquire ExxonMobil’s shallow water assets in the country."
  },
  {
    "headline": "Oil Prices Near $80 as Omicron Concerns Ease",
    "summarized_story": "On December 22, Nigeria’s federal lawmakers approved a N17.126 trillion ($38 billion) budget for 2022, anchored on an oil price benchmark of $62 per barrel.\nThe approved oil price assumption was higher than the $57 per barrel price that President Muhammadu Buhari had proposed to the parliament on October 7, and also higher than the oil price benchmark of $40 per barrel adopted by the government for the 2021 budget.\nSenate President, Ahmad Lawan, said the increase in oil price was to reflect the current market values of the oil barrel in the international market and to generate more funds for critical sectors of the economy.\nHowever, the parliament retained the oil production target of 1.88 million bpd, including condensate production of between 300,000-400,000 bpd, for the purpose of its revenue calculation in 2022.\nNigeria has the capacity to pump around 2.2 million b/d of crude and condensate, but in recent months its output has been languishing below 1.55 million bpd."
  },
  {
    "headline": "Ethiopia Unhappy as US Ends Its Duty-Free Access",
    "summarized_story": "Ethiopia says it is unhappy with the U.S. decision to revoke duty-free access for the East African country’s exports.\nThe statement by Ethiopia’s trade ministry on Monday came after the Biden administration on Dec. 23 terminated Ethiopia’s eligibility for benefits under the African Growth and Opportunity Act.\n“The Ethiopian government is saddened over the decision by the U.S. to remove it,” from the preferential trade benefits, the ministry said.\nThe action also stops Guinea and Mali from receiving the trade benefits as of January 1.\nEthiopia in recent years had one of Africa’s fastest-growing economies, but the war in Tigray has dampened that momentum."
  }
]