[
  {
    "headline": "Police contact Nasarawa as gunmen kidnap Kaduna monarch on farm",
    "summarized_story": "Some bandits have abducted Gyet Maude, the traditional ruler of the Jaba chiefdom in the Jaba Local Government Area of Kaduna State.\nThe first-class-monarch, who is said to be over 80 years, was abducted on Monday on his farm in Gitata, a border town between Kaduna and Nasarawa states.\nThe incident came barely two after bandits’ abduction of the 85-year-old emir of Kajuru, Alhaji Alhassan Adamu, alongside 13 other members of his family.\nHowever, in less than 24 hours, Adamu regained freedom, while other members of the family were held back by the kidnappers.\nThe state Police Public Relations Officer, ASP Mohammed Jalige, said the command had contacted its Nasarawa counterpart over the matter for further details."
  },
  {
    "headline": "Commissioner calls for failed parents’ tribunal",
    "summarized_story": "The Osun State Commissioner for Information and Civic Orientation, Funke Egbemode, on Monday called on the Federal Government through the National Orientation Agency to set up failed parents’ tribunal to restore traditional family values.\nEgbemode, while declaring open a four-day step-down training on the elimination of child labour for staff of National Orientation Agency and media professionals in Osogbo, explained the tribunal would educate parents on the implications of mishandling of children.\nShe said, “Villages, towns, communities and even nations fail first from the home.\nRegardless of the terminologies we have adopted to describe them, the ills in our society are the failure of parenting.\n“The National Orientation Agency really needs to consider setting up failed parents’ tribunal."
  },
  {
    "headline": "IPOB: Nnamdi Kanu takes matter to African Rights Commission",
    "summarized_story": "Nnamdi Kanu, IPOB leaderBy Dennis AgboSpecial Counsel to the leader of Indeginous People of Biafra IPOB, Mazi Nnamdi Kanu, Mr. Aloy Ejimakor has disclosed that the extraordinary rendition of his client is now a matter before the African Commission on Human and Peoples Rights.\n“Both countries also have extradition laws that prohibit this sort of reprehensible conduct that saw Kanu to Nigeria,” Ejimakor said.\n“Further, no valid territorial jurisdiction can issue from an act of extraordinary rendition because Kanu is, technically speaking, still in Kenya.\n“In my previous press briefings, I had said – with much confidence – that Kanu’s trial will be a trial within trial.\n“To be sure, any nation that dabbles in extraordinary rendition has unwittingly brought impediments to her territorial jurisdiction."
  },
  {
    "headline": "Buhari arrives London for Education Summit, holds talks with Boris",
    "summarized_story": "President Muhammadu Buhari is now in London, the United Kingdom (UK), where he will participate in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021 to 2025.\n“It will also offer the opportunity for leaders to make 5-year pledges to support GPE’s work to help transform education systems in up to 90 countries and territories.\n“Deliberations at the Summit will focus on: ‘The Power of Education –A Conversation between Global Champions’; ‘Transforming Education for Girls’; ‘Financing for Impact and Recovery’; and ‘What Now?\nAfter the Summit, Adesina said, Buhari will spend a few days to keep a scheduled medical appointment.\n“He is due back by second week of August 2021,’’ the president’s spokesman said."
  },
  {
    "headline": "Nigeria, Cameroon border bridge will facilitate free trade – Fashola",
    "summarized_story": "The Minister of Works and Housing, Mr Babatunde Fashola has said the construction of a new double lane bridge on the border between Nigeria and Cameroon will facilitate free trade.\nFashola said this on Monday while inspecting the newly constructed 1.5km, two-lane bridge on the border between Nigeria and Cameroon in Ekot-Mfum, Etung Local Government Area of Cross River.\nAccording to the minister, the construction of the bridge will also strengthen relations between both countries and improve cross-border security.\nEtuk reiterated that the new bridge would bring about better trade among the people of Nigeria and Cameroon.\nHe said that the ease of movement and trade would go a long way to improve relationship and foster development in the area."
  },
  {
    "headline": "Ondo APC Members Pass Vote of Confidence on Adefisoye",
    "summarized_story": "Tajudeen Adefisoye.\nAdefisoye by members of the Social Democratic Party (SDP) that have since defected with the federal lawmaker to the ruling APC.\nAlhaji Tajudeen Adeyemi Adefisoye.\n“That we beg our leader, Alhaji Tajudeen Adeyemi Adefisoye to work assiduously towards ensuring the re-election of Engr.\nAde Adetimehin as the Ondo State Chairman of the All Progressive Congress (APC)."
  },
  {
    "headline": "Police arrest house help, three others over alleged killing of banker in Yobe",
    "summarized_story": "The Police Command in Yobe said it had arrested four suspects in connection with the killing of Hassan Abubakar, a staff of Damaturu Branch of United Bank for Africa (UBA).\nAbdulkarim named one Umar Shaibu, 21; Tajjuddeen Taufiq, 20; Ismail Mohammed, 17; and Bulama Modu, 17, all residents of Damaturu as the suspects arrested by the police.\n“On July 24, 2021 the principal suspect, Shaibu, who happened to be the house help of the victim, was arrested while carting away valuable items from the victim’s house,” Abdulkarim explained.\n“They robbed him (deceased) of money but ended up killing the victim, buried the corpse in the compound and fled.\n“On the next day, July 23, 2021 they began to sell the property until they were eventually nabbed by the police which led to the arrest of the three other suspects,” Shaibu said."
  },
  {
    "headline": "President Addo did not call for revolution in Nigeria – Ghana",
    "summarized_story": "The Ghana High Commission in Nigeria has expressed outrage over comments credited to President Akufo Addo.\nThe mission in a statement on Monday, said Addo never made disparaging remarks about Nigeria and President Muhammadu Buhari.\nGhana said the act of the “faceless individuals” was aimed at marring the existing diplomatic relations between Ghana and Nigeria.\n“President Akufo Addo has not and will not make any disparaging remarks about any country and her people, let alone a very strategic partner like Nigeria and her people.\n“The government of Nigeria is a disgrace to democracy and justice in Africa; we expect Nigerian youths to wake up from their slumber for a better Nigeria.”"
  },
  {
    "headline": "Sunday Igboho: Armed policemen chase Yoruba Nation supporters out of court",
    "summarized_story": "The Police in Benin Republic have dispersed journalists and hundreds of Yoruba Nation activists from the premises of the Cour De’appal De Cotonou on Monday.\nThe officers drove into the venue of the hearing of the case against Sunday Adeyemo, also known as Sunday Igboho, in about seven trucks.\nThe court is currently investigating the allegations brought against Igboho by the Federal Government of Nigeria which claimed, amongst other things, that the activist is a gun runner.\nThe court is also expected to rule on the extradition or otherwise of Igboho.\nSunday Igboho’s wife, Yoruba monarchs, others in court for secessionist’s trial"
  },
  {
    "headline": "Osemwengie-Ero blasts Italian government, vows to lead protest over illegal detention of 300 Nigerians",
    "summarized_story": "Former Edo State Commissioner for Arts, Culture, Tourism and Diaspora Affairs, Osaze Osemwengie-Ero, has disclosed plans to lead a protest to the Italian Embassy within the next four weeks to demand the release of over 300 Nigerian youths illegally detained in Italian prisons for trumped-up charges on mafia-related offences.\nAccording to him, “We have over 300 Nigerian youths in Italian prisons illegally arrested and incarcerated for false allegations of mafia-related crimes.\n“We will campaign against the corrupt Italian Justice system and I am going to lead a protest to the Italian Embassy within the next four weeks.\nI wonder why people will say I was arrested with $2 million in my pocket or suitcase for the governor,” he added.\nIllegal detention: Ogun posts lawyers to police stations, offers free legal services"
  },
  {
    "headline": "Ogun: Abiodun inaugurates new LG Chairmen, charges them not to rely on FG allocations",
    "summarized_story": "Governor Dapo Abiodun has on Monday inaugurated the 20 newly-elected local government chairmen in Ogun State.\nDAILY POST had earlier reported that Abiodun’s All Progressives Congress (APC) won across all the local governments in the state at the just-concluded local government poll.\nEarly on Monday, the elected chairmen arrived at the office of the Ogun State Independent Electoral Commission (OGSIEC), where they were presented with their certificates of return.\nHe urged them to generate money in their respective local governments, warning not to make life difficult for the masses in doing so.\nOgun govt denies spending local govt funds"
  },
  {
    "headline": "Why Police DIGs, AIGs weren’t retired after Buhari appointed Baba – Minister",
    "summarized_story": "Police Affairs Minster, Muhammad Dingyadi, has explained why Deputy Inspectors General (DIGs) and Assistant Inspectors General (AIGs) were not retired after President Muhammadu Buhari appointed Inspector General of Police, Usman Baba.\nOn Monday, Dingyadi said there was no retirement this time because adequate additional manpower was required to prosecute the fight against insecurity.\nHe spoke in Abuja at the International Peace Centre during the decoration of 24 Commissioners of Police promoted to AIGs.\nThe Minister stated that the government deliberately left the senior officers to have many hands in the Force.\nDingyadi said that the criteria for the appointment of the new AIGs were based on merit, professional conduct, and individual performance."
  },
  {
    "headline": "Boko Haram abducts two travelling soldiers",
    "summarized_story": "By Duku JOEL, DamaturuTwo soldiers, a corporal and a private soldiers, were kidnapped on Saturday evening by Boko Haram terrorists.\nThe two soldiers, according to the source, were travelling in a commercial vehicle after obtaining pass to do so.\nAnother security source informed the driver of the vehicle has been arrested by soldiers of 29 Task Force after other passengers suspected foul play from him.\nADVERTISEMENT“Yes, I can confirm that two of our guys were kidnapped by Boko Haram on Saturday evening, one corporal and a private soldiers.\nThey were traveling on pass when the incident happened before Jakana after Mainok on Maiduguri road,” the source informed."
  },
  {
    "headline": "JUST IN: Police disperse Igboho’s supporters as trial continues",
    "summarized_story": "By Adekunle YusufThe police in Cotonou, capital of Benin Republic have dispersed supporters of Yoruba Nation agitator Sunday Adeyemo aka Sunday Igboho from the premises of Court of Appeals where his trial is going on.\nThe security personnel, who came in two Hilux vans, insisted everyone, including Journalists, should vacate the court premises.\nADVERTISEMENTThere was no explanation on why the action was taken as the Court allowed hundreds of Igboho’s supporters in its premises.\nDetails shortly…"
  },
  {
    "headline": "Abdulrazaq approves four years promotion arrears for SUBEB teachers",
    "summarized_story": "Our ReporterKwara Governor AbdulRahman AbdulRazaq has approved the implementation of promotion arrears for tens of thousands of teachers and staff of the State Universal Basic Education Board (KWSUBEB), effectively ending years of career stagnation that brought workers’ morale to an all-time low.\nPublic basic school teachers in Kwara State were last promoted in 2017.\nIt is a confirmation of our position that the last administration opted to kill basic education in the state.\nOur efforts have been to restore quality, dignity, and citizens’ confidence to public basic education in the state,” the Governor said.\nNUT chairman in Kwara State Comrade Olu Adewara commended Governor AbdulRazaq for his interest in promoting the welfare of teachers and development of education sector in the state."
  },
  {
    "headline": "Banditry: Kaduna suspends schools resumption indefinitely",
    "summarized_story": "By AbdulGafar Alabelewe, KadunaKaduna Government has suspended resumption of schools across local governments of the State until further notice.\nEl-Rufai added the government was committed to protecting vulnerable children from being attacked by fleeing bandits already feeling the superior firepower of the military.\nHe warned that fleeing bandits might infiltrate their communities.\nSokomba argued licensing of firearms for citizens has become expedient due to the constant kidnapping of many people, including health workers.\nA gender-based activist, Asma Mirza, stressed the need to deploy technology to the various flashpoints, including the forests and highways."
  },
  {
    "headline": "I want to buy my own planet- DJ Cuppy",
    "summarized_story": "By Ekaete BasseyDisc jockey and billionaire daughter, Florence Ifeoluwa Otedola, popularly known as DJ Cuppy has revealed her intention to buy her own planet where she can have more freedom and worry less.\nDj Cuppy, following her revelation tagged the agency responsible for the civilian space program, aeronautics, and space research (NASA) to her post.\nAccording to the ‘Gelato” crooner, she would name her planet Cuppy, Cupptune or Cuppiter.\nShe wrote: “I want to buy own planet in space and name it Cuppy” @NASAADVERTISEMENT“Maybe even “Cupptune” or “Cuppiter”?”Meanwhile, fans and followers have taken to the comment section to express laughable comments on the matter.\nComedian Broda Shaggi said: “Me sef don pay for two plot."
  },
  {
    "headline": "UTME 2021: JAMB blacklists 18 CBT centres for infraction",
    "summarized_story": "By Gabriel DikeJoint Admissions and Matriculation Board (JAMB) has delisted 18 Computer Based Text (CBT) centres from among 820 approved centres for use in the 2021 Unified Tertiary Matriculation Examination (UTME).\nThe decision to blacklist the 18 CBT centres was taken after their underperformance during recent 2021 UTME mock examination nationwide.\nAlso, JAMB management placed 14 CBT centres under watch for various offences noticed during the conduct of the 2021 UTME mock examination.\nThe 2021 UTME will hold between Saturday, June 19, and July 3nationwide and in some foreign countries.\n“All examination officials, including the security agents, are to ensure compliance with all guidelines, rules and regulations on the examination,’’ JAMB said."
  },
  {
    "headline": "FG tightens noose on social, online media",
    "summarized_story": "However, stakeholders in the media industry kicked against the proposal which came barely a week after the NBC had asked all social media platforms and online broadcasting service providers to apply for a broadcast licence.\nGovernment moved to license social media companies after Twitter took down a tweet by President Muhammadu Buhari, after stating that the message violated its policy.\nThey argued that inclusion of internet broadcast and online media to the category of broadcast service licenses to be issued by the NBC will be injurious to freedom of expression and press freedom.\nOnly recently, NBC had asked all social media platforms and online broadcasting service providers to apply for broadcast licence.\nIts Director General, Armstrong Idachaba, gave the directive in a newspaper advertorial following Federal Government’s announcement that Twitter and other social media platforms must register as a Nigerian company for them to do business in Nigeria."
  },
  {
    "headline": "Baba Ijesha denied bail, to be tried in high court",
    "summarized_story": "By Romanus Okoye and Lukman OlabiyiYaba Chief Magistrate Court, yesterday, denied Nollywood actor, Omiyinka Olanrewaju, popularly known as Baba Ijesha, bail, on the ground that the same charge was already before a Lagos State High Court.\nThis sets the stage for trail of the actor at the High Court on charges bothering on rape, sexual assault and abuse of a minor.\n“Since there are indications that the matter is before the high court and the defendant will appear before the court, no bail can be given.\nBaba Ijesha was brought into the magistrate court premises around 12 noon, alongside other suspects.\nWhile in the dock, Baba Ijesha showed signs of discomfort as he kept bending intermittently."
  },
  {
    "headline": "Tanker explosion claims 7 lives at Idiroko",
    "summarized_story": "The Federal Road Safety Corps (FRSC) confirmed that seven persons died in an explosion after a commercial bus collided with a petrol tanker at Ajilete on Idiroko Expressway, yesterday.\nFRSC Idiroko Unit Commander, Akinwunmi Olaluwoye, said two other persons sustained injuries in the accident which happened at about 8.45am.\nHe said that the bus rammed into a tanker laden with 33 litres of petroleum product, while it was ascending the sloppy Ajilete road.\nNine persons were involved in the accident which claimed seven lives, leaving two others with various degrees of injury."
  },
  {
    "headline": "Gunmen behead Imo lawmaker’s guard, APC chieftain",
    "summarized_story": "The guard was said to have been overpowered by a large number of hoodlums who invaded the lawmakers house.\nSimilarly, Daily Sun gathered that the gunmen also beheaded an All Progressives Congress (APC) chieftain in the area, Jonathan Ugochukwu.\nWife of the APC chieftain, Mrs Nkechi Ugochukwu, disclosed that the gunmen carried her husband outside and beheaded him before torching their house.\nA community source also revealed that the rampaging gunmen also left with the head of the lawmaker’s guard.\n“They also invaded the house of another APC chieftain here, Jonathan Ugochukwu, burnt his house, beheaded him and left with his head."
  },
  {
    "headline": "Buhari Signs 2021 Supplementary Appropriation Bill Into Law",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari Monday signed the 2021 Supplementary Appropriation Bill into law.\nThe Senior Special Assistant to the President on National Assembly Matters (House of Representatives), Umar Elyakub, who disclosed this to newsmen at the State House, Abuja, put the total sum of the supplementary budget assented to by the President at N982,729,695,343.\nEl-Yakub, who spoke after President Buhari signed the Appropriation Act, said the budget will be largely focused on funding security and health concerns in the country.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Kanu’s Absence Stalls Alleged Treasonable Felony Trial",
    "summarized_story": "Kanu and three others were standing trial on alleged treasonable felony and five other charges.\nResponding, the trial judge held that the trial of Kanu cannot proceed in the absence of Kanu, having been arrested and brought into the country.\nThe judge insisted that Kanu must physically be brought to court since he is now available to face his trial.\nIn a short ruling, Justice Nyako ordered that access be given to Kanu’s lawyer to see the defendant.\nThe court also ordered that the prosecution must produce Kanu in court at the next adjourned date of October 21."
  },
  {
    "headline": "Buhari Departs for Medical Check up in London Monday",
    "summarized_story": "To attend global education summitExpected back second week of AugustBy Deji ElumoyePresident Muhammadu Buhari will on Monday (today) depart Abuja for London, the United Kingdom to attend a global summit on education as well as undergo medical checks earlier scheduled for last month.\nWhile in London, President Buhari is billed to participate in the Global Education Summit on Financing Global Partnership for Education (GPE) 2021-2025.\nPriorities for Transforming Education in the Coming Five Years, among others.\nPresident Buhari will also hold a bilateral meeting with Prime Minister Boris Johnson.\nHe is due back by second week of August, 2021."
  },
  {
    "headline": "Tight Security as Nnamdi Kanu’s Trial Begins",
    "summarized_story": "As early as 6.40am when THISDAY reporter got to court, security operatives had barricaded all roads to the court, ensuring only staff of the Court and accredited journalists have access into the premises.\nKanu’s trial resumes Monday after nearly four years that he jumped his bail and escaped out of Nigeria.\nSecurity operatives had arrested and extradited Kanu from Kenya, last month and brought him to Nigeria to continue his trial.\nThey also opposed screening by security operatives claiming that lawyers cannot present ID cards before they would be given access into the court.\nHowever, no sight of Nnamdi Kanu yet at the court premises."
  },
  {
    "headline": "Big Five Banks’ Loans to Customers Hit N50trn in Five Years",
    "summarized_story": "The banks are Access Bank Plc., Zenith Bank Plc., FBN Holdings Plc.\nThe data showed that in the five-year period, Access Bank lent out a total of N11.929 trillion to its customers.\nAccess Bank was closely followed by Zenith Bank, whose total loans and advances in the review period stood at N11.297 trillion, despite its penchant for organic growth.\nFor Zenith Bank, its total loans to customers in 2020 was N2.779 trillion; N2.305 trillion in 2019; N1.823 trillion in 2018; N2.100 trillion in 2017; and N2.289 trillion in 2016.\n“The distribution of capital across the banks featured in the report is unequal in terms of the percentage of total capital to assets (or, more technically, interest-earning assets)."
  },
  {
    "headline": "How Ex-Commissioner Escaped Death After Lagos Speaker, Obasa’s Thugs Attacked Residence",
    "summarized_story": "Thugs allegedly loyal to the Speaker of the Lagos State House of Assembly, Mudashiru Obasa, have attacked the former State Commissioner for Transportation, Kayode Opeifa.\n“On Saturday, they openly campaigned for the YPP candidate.\nIn Agege LG and Orile Agege LCDA, the unwarranted attack on the people of the area leaves a sour taste in the mouth of the people.\n“We implore the party leaders across Lagos state, to do their survey before selecting Candidates.\nToo much of Personal Interest in selecting APC Candidates caused the voters apathy in the just concluded LG/LCDA poll throughout Lagos State."
  },
  {
    "headline": "How Ex-Commissioner Escaped Death After Lagos Speaker, Obasa’s Thugs Attacked Residence",
    "summarized_story": "Thugs allegedly loyal to the Speaker of the Lagos State House of Assembly, Mudashiru Obasa, have attacked the former State Commissioner for Transportation, Kayode Opeifa.\n“On Saturday, they openly campaigned for the YPP candidate.\nIn Agege LG and Orile Agege LCDA, the unwarranted attack on the people of the area leaves a sour taste in the mouth of the people.\n“We implore the party leaders across Lagos state, to do their survey before selecting Candidates.\nToo much of Personal Interest in selecting APC Candidates caused the voters apathy in the just concluded LG/LCDA poll throughout Lagos State."
  },
  {
    "headline": "How Ex-Commissioner Escaped Death After Lagos Speaker, Obasa’s Thugs Attacked Residence",
    "summarized_story": "Thugs allegedly loyal to the Speaker of the Lagos State House of Assembly, Mudashiru Obasa, have attacked the former State Commissioner for Transportation, Kayode Opeifa.\n“On Saturday, they openly campaigned for the YPP candidate.\nIn Agege LG and Orile Agege LCDA, the unwarranted attack on the people of the area leaves a sour taste in the mouth of the people.\n“We implore the party leaders across Lagos state, to do their survey before selecting Candidates.\nToo much of Personal Interest in selecting APC Candidates caused the voters apathy in the just concluded LG/LCDA poll throughout Lagos State."
  },
  {
    "headline": "Nnamdi Kanu’s Lawyer Drags Nigeria, Kenya To African Commission, Seeks Kanu’s Transfer To UK",
    "summarized_story": "More particularly, extraordinary rendition is expressly prohibited under the African Charter, where It provides in pertinent part that “A State may not transfer (e.g.\nExtraordinary rendition, or any other transfer, without due process is prohibited”.\n“Further, that no valid territorial jurisdiction can issue from an act of extraordinary rendition because Kanu is, technically speaking, still in Kenya.\n“I also requested the Commission to adopt other urgent measures as the Commission sees fit in the circumstances to protect Nnamdi Kanu in the interim.\nTo be sure, any nation that dabbles in extraordinary rendition has unwittingly brought impediments to her territorial jurisdiction."
  },
  {
    "headline": "Nnamdi Kanu’s Lawyer Drags Nigeria, Kenya To African Commission, Seeks Kanu’s Transfer To UK",
    "summarized_story": "More particularly, extraordinary rendition is expressly prohibited under the African Charter, where It provides in pertinent part that “A State may not transfer (e.g.\nExtraordinary rendition, or any other transfer, without due process is prohibited”.\n“Further, that no valid territorial jurisdiction can issue from an act of extraordinary rendition because Kanu is, technically speaking, still in Kenya.\n“I also requested the Commission to adopt other urgent measures as the Commission sees fit in the circumstances to protect Nnamdi Kanu in the interim.\nTo be sure, any nation that dabbles in extraordinary rendition has unwittingly brought impediments to her territorial jurisdiction."
  },
  {
    "headline": "BREAKING: No immediate extradition as Cotonou court jails Igboho",
    "summarized_story": "The Beninese appeal court sitting in Cotonou has jailed Sunday Adeyemo, the Yoruba youth activist known as Sunday Igboho.\nAs source within the court told TheCable that Igboho would not be set free.\nThis means no immediate extradition for the Yoruba youth leader, who has been declared wanted by the government of Nigeria.\nJournalists, monarchs, and supporters who came to court for the case were barred from witnessing his hearing.\nThey then hung around the court premises until about 7pm when armed security operatives came to court to eject anyone who was not a person of interest."
  },
  {
    "headline": "BREAKING: No immediate extradition as Cotonou court jails Igboho",
    "summarized_story": "The Beninese appeal court sitting in Cotonou has jailed Sunday Adeyemo, the Yoruba youth activist known as Sunday Igboho.\nAs source within the court told TheCable that Igboho would not be set free.\nThis means no immediate extradition for the Yoruba youth leader, who has been declared wanted by the government of Nigeria.\nJournalists, monarchs, and supporters who came to court for the case were barred from witnessing his hearing.\nThey then hung around the court premises until about 7pm when armed security operatives came to court to eject anyone who was not a person of interest."
  },
  {
    "headline": "Afenifere: Nothing wrong with Igboho fleeing Nigeria -- even Moses ran from Pharaoh",
    "summarized_story": "Afenifere, Yoruba socio-political group, says there is nothing wrong with Sunday Adeyemo, a Yoruba nation agitator better known as Sunday Igboho, trying to protect his life.\nIgboho is standing trial at the Cour De’appal De Cotonou after his arrest at Cardinal Bernardin International Airport, Cotonou.\nAdvertisementIn a statement by Jare Ajayi, its national publicity secretary, Afenifere said there is nothing wrong with Igboho seeking asylum to preserve his life.\n“We recall that Moses had to be taken away from the prying eyes of Pharaoh and his agents in Egypt.\nAdvertisement“Thus, there is nothing wrong in Igboho seeking a respite first to preserve his life and perhaps to re-strategise."
  },
  {
    "headline": "Afenifere: Nothing wrong with Igboho fleeing Nigeria -- even Moses ran from Pharaoh",
    "summarized_story": "Afenifere, Yoruba socio-political group, says there is nothing wrong with Sunday Adeyemo, a Yoruba nation agitator better known as Sunday Igboho, trying to protect his life.\nIgboho is standing trial at the Cour De’appal De Cotonou after his arrest at Cardinal Bernardin International Airport, Cotonou.\nAdvertisementIn a statement by Jare Ajayi, its national publicity secretary, Afenifere said there is nothing wrong with Igboho seeking asylum to preserve his life.\n“We recall that Moses had to be taken away from the prying eyes of Pharaoh and his agents in Egypt.\nAdvertisement“Thus, there is nothing wrong in Igboho seeking a respite first to preserve his life and perhaps to re-strategise."
  },
  {
    "headline": "Beninise police eject Igboho supporters from court -- eight hours into hearing",
    "summarized_story": "Police officers stormed the Cotonou Court of Appeal to eject journalists and supporters of the Yoruba nation activist, Sunday Adeyemo better known as Sunday Igboho.\nOne of the police officers told journalists that the president of the court called on the police to eject everyone out of the court, except the lawyers.\nAll the officers wore black masks and wielded heavy guns as they ejected supporters and journalists out of the court premises.\nJournalists, monarchs, and supporters who came to court for the case were barred from witnessing his hearing.\nAdvertisementThe charges against the Yoruba Nation activist border on arms smuggling, inciting violence and calling for a secession of the Yoruba from the Nigerian state."
  },
  {
    "headline": "This US-based early-stage fund wants to invest $5m in African startups",
    "summarized_story": "In the first half of this year, investments in African startups have risen back to pre-covid levels.\nOne of such players is Expert DOJO, a US-based early-stage fund that has decided to commit up to $5m to invest in African startups this year.\nSetting itself apart from other global accelerators, Expert DOJO has assembled an entire Africa-dedicated team plus cross-functional experts and Entrepreneurs in Residence (EIRs).\nStarNews Mobile, a mobile video network for Africa, is one of the first African startups Expert DOJO invested in.\nVictoria Mehran, an Investment associate at Expert Dojo explained this saying, “We’re committed to supporting them for life."
  },
  {
    "headline": "The Next Wave: Scale is hard to find in Africa",
    "summarized_story": "The top 4% No standard definitions exist for what scale is for fintech in Africa.\nHere are five key numbers from the report: Out of 716 fintech companies pooled across Africa, only 37 have achieved scale.\nOn average, it takes 12 years for a African fintech company to scale; only 5 startups have managed to scale within 5 years of operations.\nOne interesting takeaway is that “infrastructure” fintech companies are likely to scale in Africa.\n– Alexander Onukwue, Staff writer, TechCabal Share this newsletter Share Share Sign up for The Next Waveby TechCabal Sign me up"
  },
  {
    "headline": "CBN regulations holding back mobile money revolution in Nigeria",
    "summarized_story": "In Ghana, it would be an “anomaly” for a supermarket, small store, or business merchant to not use a mobile money service for transactions.\nNew agent and electronic money guidelines were released in 2014, allowing network operators to run mobile money services, with supervision from the banking regulator.\nUptake in mobile money services and financial inclusion have equally increased across the country.\nThe regulatory framework is one of the core reasons why mobile money uptake has been relatively slow in Nigeria.\n“The CBN recognises the importance of Mobile Network Operators in the operations of mobile money services and appreciates the criticality of the infrastructure they provide."
  },
  {
    "headline": "This app wants to simplify Twitter giveaways, without bank accounts",
    "summarized_story": "Let’s say I wanted to send a surprise ‘happy birthday’ cash gift to a friend; my first thought would be to ask for their bank account number.\nI would do this for people I know very well but also for someone I only know on social media.\n“Like sending money through email addresses using PayPal, Vendly hopes to replicate that using social media handles,” he said.\nLong-term, Vendly will help social media users monetize their social media presence, the CEO said.\nThe message states the amount sent; recipient inputs the bank account where they want the cash to go."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "The Central Bank of Nigeria (CBN) has disclosed that it’ll launch the pilot scheme of its digital currency on October..."
  },
  {
    "headline": "South Africa-based insurtech startup, Pineapple raises $3.4M Series A",
    "summarized_story": "Share this article:South African insurtech startup, Pineapple has raised $3.4 million Series A to further expand into the car insurance space after it claims to have grown by 200% in the last six months.\nPreviously, in 2017, Pineapple raised $400,000 in seed funding with participation from Lireas Holdings.\nFounded in 2017 by Matthew Elan Smith, Ndabenhle Junior Ngulube and Marnus van Heerden, Pineapple claims to be a flexible, scalable and decentralised peer-to-peer insurer that provides full-fledged insurance coverage to its members.\nThe company does not underwrite insurance claims itself as it tags itself as a Digital Financial Services Provider.\nIn 2020, Pineapple was included in UK digital transformation platform, Sønr and UK publication, Insurance Post‘s Insurtech 100 list."
  },
  {
    "headline": "Early Paystack investor, Olumide Soyombo launches Pan-African VC firm, Voltron Capital",
    "summarized_story": "Share this article:Olumide Soyombo has today announced the launch of Pan-African VC firm, Voltron Capital, co-founded with Abe Choi, a US-based entrepreneur and investor.\nIt is a pre-seed & seed firm for elite tech founders tackling critical problems in the continent’s largest markets.\nAdvertisementIn 2014, He ventured into tech once again, partnering with Ewogbade to found LeadPath Nigeria, an early-stage firm-cum-accelerator.\nThey planned to invest $25,000, take the startups through a three-month accelerator programme ending in a Demo Day.\nWith this, Soyombo has decided to formalise the funding process, bringing his access to non-traditional capital to bear."
  },
  {
    "headline": "Nigerian-American, Abake Adenle, wins award for building speech recognition API for African languages",
    "summarized_story": "The Cambridge University alumna got the attention after building a voice recognition and speech synthesis software for five African languages.\nIt was at that point that I realised that voice recognition wasn’t really available for African languages,” she explains in a chat with Techpoint Africa.\nAnd in the first year, she developed complex algorithms and acoustic models for voice recognition and speech synthesis for two African languages using deep learning.\nAdvertisementApart from the seed fund, Ajala.ai is also in partnership with two large African institutions looking to build voice solutions in African languages.\nIn the meantime, watch this place for a detailed piece about who Adenle is and her journey to digitising African languages."
  },
  {
    "headline": "How Nigeria start-ups keep the lights on",
    "summarized_story": "How Nigeria start-ups keep the lights onAbolore Salami must keep the lights on in his expanding fintech start-up in Yaba, Lagos.\nNicknamed Yabacon Valley, after Silicon Valley in the US, the colonial-era suburb is where many start-ups have their offices.\nReliable internet is a major attraction.\nSalami started Riby in 2016 to help cooperatives and trade groups access savings and loans…"
  },
  {
    "headline": "Tokyo Olympics drowns Japan in pool of debt",
    "summarized_story": "With a muted ceremony and an empty stadium the much delayed Tokyo Olympic Games have finally begun.\nThe shadows of cancellation loom as COVID-19 cases continue to rise.\nThere is a lot at stake for Japan apart from safety, prestige and public sentiment (with reference to the amount of money they have pumped in).\nHow…Don’t miss another story Become a BusinessDay Subscriber today.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "System outages delay passengers’ check-in at Lagos airport",
    "summarized_story": "System outages at the Murtala Muhammed International airport Lagos have continued to frustrate and delay checking-in passengers.\nPassengers spend as many as three hours in queues as airlines check-in travellers manually due to system outages which airport authorities have failed to resolve for some weeks now.\nDaily check-in for hundreds of international air travellers to various destinations has since continued to be delayed for several hours.\nWe are experiencing check-in delays due to local system outage.”In a similar message sent by British Airways to one of its customers it stated, “Due to airport system technical difficulties, we encourage you to arrive at the airport early to ensure a smooth airport check-in experience.\nA source close to the airport authority told BusinessDay that the current challenge maybe because the Lagos airport is owing to its service providers."
  },
  {
    "headline": "Edo ex-commissioner, Osemwengie-Ero to lead protest to Italian Embassy for release of over 300 Nigerians illegally detained in Italy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Former Edo State Commissioner for Arts, Culture, Tourism and Diaspora Affairs, Osaze Osemwengie-Ero, has disclosed plans to lead a protest to the Italian Embassy within the next four weeks to demand the release of over 300 Nigerian youths illegally detained in Italian prisons for trumped-up charges on mafia-related offences.\nAccording to him, “We have over 300 Nigerian youths in Italian prisons illegally arrested and incarcerated for false allegations of mafia-related crimes.\n“We will campaign against the corrupt Italian Justice system and I am going to lead a protest to the Italian Embassy within the next four weeks.”“The justice system in Italy is complex and corrupt and they manipulate the justice system because they know nobody cares about Nigerians,” he noted.\nI wonder why people will say I was arrested with $2 million in my pocket or suitcase for the governor.\nThe governor is too big for that as he was already rich before he became governor of the State; he is an investment banker and can’t do that; that was primitive politics.”..."
  },
  {
    "headline": "Edo IRS To Deepen Tax Education, Partners CITN – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State Internal Revenue Service, EIRS says it will partner with the Chartered Institute of Taxation of Nigeria (CITN) to deepen tax education through sensitization and enlightenment of taxpayers and the general public in the state.\nThe Executive Chairman made this known when he received newly elected executive members of the tax institute, Benin and District Society led by the deputy chairman Felix Ahonsi Esq.\nThe EIRS boss Igbinidu Inneh, represented at the familiarization visit by the Executive Director Income Tax, Prince Felix Abubakar Isuku promised to support the institute through partnership with the tax institute to educate the public on taxation.\nHe charged the State Chairman and the new Executives of CITN to uphold the values for which the institute is known for.\nHe solicited for the collaboration and support of the revenue service which he said, is a major projector of the tax profession."
  },
  {
    "headline": "Arewa, Useh communities hail Obaseki’s devt strides, inclusive governance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Arewa Community in Edo State has commended Governor Godwin Obaseki for his administration’s developmental strides across the state especially in critical sectors such as infrastructure, education, health, agriculture, among others.\n“We shall continue to offer our constructive advice to ensure the state remains in peace and unity.\nWe will ensure we advise our people who are into cattle rearing not to be involved in farmers-herders clashes,” he noted.\nOn his part, Obaseki commended the Arewa Community for their support in ensuring the state enjoys peace and unity.\nAlso, the leadership of the Useh Community led by the Edigin N’ Yan Useh, Chief Ekpen Edigin, hailed the governor’s sustained investment in education and revamp of Useh Primary School."
  },
  {
    "headline": "The war against drug abuse – Nigerian Observer",
    "summarized_story": "Mr James Ojomo, an expert in drug abuse, says many of the major towns including Kano, Kaduna, Abuja and Lagos are veritable grounds for drug abusers.\n“ For some time, the country was not serious in waging war against drug abuse, as we were treating it with kid grooves.\nProf. Isiodore Obot, the Director, Centre for Research and Information on Substance Abuse, said that Nigeria had failed in its drug war, considering the large number of youths involved in drug usage and abuse.\nAdeyeye appealed to the three arms of government not to relent on its efforts in the fight against drug abuse, stressing that they have a major role to play by putting in place, stiffer penalties, that are commensurate with the offences of drug abuse.\nShe called on ministries, departments and agencies, religious bodies, educational institutions and parents to join hands with government in the fight against drug abuse."
  },
  {
    "headline": "Four more abducted Bethel Baptist School students regain freedom",
    "summarized_story": "ADVERTISEMENTFour more abducted students of Bethel Baptist High School, Maraban Damishi, in Chikun Local Government Area of Kaduna State, have regained their freedom, an official said on Monday.\nThe Chairman of the Christian Association of Nigeria (CAN), Kaduna State, John Hayab, confirmed the development in an interview with the News Agency of Nigeria (NAN) in Kaduna.\n“Yes, another four students escaped from their abductors on Sunday, July 25, and have been reunited with their parents,” Mr Hayab said.\nBackstoryBandits in the early hours of July 5, invaded the school and kidnapped an unspecified number of students.\nThe students, who regained their freedom in the early hours of Sunday, are among the reported 121 students abducted at the school premises."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Sterling Bank, C/River, consortium sign MoU on Health Supply Chain Transformation Project",
    "summarized_story": "Sterling Bank Plc.\nhas signed a Memorandum of Understanding (MoU) with the Cross River State Government and a consortium of healthcare providers to provide services for the Cross River Health Supply Chain Transformation Project.\nThe MoU is sequel to the bank’s partnership with the Cross River State Government on the implementation of a Health Insurance Scheme tagged: Ayade Care.\nAlso speaking, Dr. Betta Edu, Commissioner for Health, Cross River State, expressed happiness at state’s readiness to finally implement the Health Supply Chain Transformation Project.\nBesides Sterling Bank and Cross River State Government, other parties in the Health Supply Chain Transformation Project include Horts Medikals Limited, Drugstoc and Zipline."
  },
  {
    "headline": "Globacom Announces 1TB Mega Data Offer for heavy Subscribers",
    "summarized_story": "Globacom has announced a huge 1TB data offer for its customers under the Glo Mega Data Plan.\nThe new offer which is aimed at heavy data users is an addition to the innovative data tariff plans already available on the network.\nAccording to the company “The Glo Mega Data Plan is exclusively packaged to address the needs of heavy data subscribers for reliable and affordable internet service.\nSubscribers can opt into the plan by dialling *777# for the plan menu and selecting “Super Mega Plans” and then choosing the plan of choice.\nIt is also auto-renewable and can be shared with other subscribers on the Glo network."
  },
  {
    "headline": "Police release Sowore, other arrested protesters in Abuja",
    "summarized_story": "Omoyele Sowore, activist and Sahara Reporters publisher as well as other protesters arrested during a protest at the Federal High Court, Abuja have been released.\nThe activists had staged a protest in solidarity with the leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu, who is undergoing trial.\nI told them that they have no right to arrest me,” Sowore said.\nCoordinator of the Coalition, Dimeji Macaulay, according to PUNCH thanked Nigerians for putting pressure on the security operatives to release Sowore and others.\n“Today’s protest, as a legitimate action, has been heavily repressed by policemen and the DSS that pick protesters into a fleet of waiting “police vans”."
  },
  {
    "headline": "BREAKING: Police charge 48 Yoruba nation agitators to court, charge agitator for murder of hawker killed by stray bullet",
    "summarized_story": "In a statement by the Communications Manager for Ilana Omo Oodua, IOO, Maxwell Adeleye said the agitators were charged for unlawful assembly.\nAdeyeye said Tajudeen Bakare (the popular Ogboni Chief) was charged by the Police for the murder of a Sachet Water Hawker, Jumoke Oyeleke, killed by a stray bullet during the protest.\n“They were charged for Unlawful Assembly, Unlawful Society and Conducts likely to cause breach of Public Peace,” he said.\n“However, one of the arrested protesters, Tajudeen Bakare (the popular Ogboni Chief) was charged by the Police for the murder of a Sachet Water Hawker, Jumoke Oyeleke, killed by a stray bullet during the protest.\n“The bail granted to all the Protesters was upheld by the Court but that of Bakare was revoked."
  },
  {
    "headline": "My journey: A personal story – By KINGSLEY MOGHALU",
    "summarized_story": "But I wanted, as I put it on my CV as my goal, “a career of distinction in international affairs”.\nAkinyemi was an alumnus of The Fletcher School, having obtained his master’s degree there in 1966 and then gone on to Oxford University for his Ph.D.\n“Well, young man”, he said, “I don’t have the kind of money that will enable me pay your fees, but I’m impressed you were admitted to The Fletcher School.\nThe American Embassy was impressed with my admission to The Fletcher School , a training ground for many American and world leaders in diplomacy, politics, business, military and security affairs.\nFrom The Fletcher School I joined the UN, my dream career."
  },
  {
    "headline": "My journey: A personal story – By KINGSLEY MOGHALU",
    "summarized_story": "But I wanted, as I put it on my CV as my goal, “a career of distinction in international affairs”.\nAkinyemi was an alumnus of The Fletcher School, having obtained his master’s degree there in 1966 and then gone on to Oxford University for his Ph.D.\n“Well, young man”, he said, “I don’t have the kind of money that will enable me pay your fees, but I’m impressed you were admitted to The Fletcher School.\nThe American Embassy was impressed with my admission to The Fletcher School , a training ground for many American and world leaders in diplomacy, politics, business, military and security affairs.\nFrom The Fletcher School I joined the UN, my dream career."
  },
  {
    "headline": "Two Arraigned for Canadian Visa Scam in Kaduna",
    "summarized_story": "By JUMOKE SANNIThe Kaduna Zonal office of the Economic and Financial Crimes Commission, EFCC today July 26, 2021 arraigned the duo of Mary Aweh and Olaleye Samuel Oluwadamilare before Justice M.T.\nTukur of Kaduna State High Court, Kaduna on a six count charge bordering on advance fee fraud.\nThe judge granted bail to the defendants in sum of N2 million each and a surety in like sum.\nShe offered an alternative – a visa to Canada – which they accepted and paid N4, 240,000 each for visa, consultancy and air tickets.\nAfter a long wait, Olaleye called and delivered the so-called Canadian visa and Yellow Fever cards."
  },
  {
    "headline": "Two Arraigned for Canadian Visa Scam in Kaduna",
    "summarized_story": "By JUMOKE SANNIThe Kaduna Zonal office of the Economic and Financial Crimes Commission, EFCC today July 26, 2021 arraigned the duo of Mary Aweh and Olaleye Samuel Oluwadamilare before Justice M.T.\nTukur of Kaduna State High Court, Kaduna on a six count charge bordering on advance fee fraud.\nThe judge granted bail to the defendants in sum of N2 million each and a surety in like sum.\nShe offered an alternative – a visa to Canada – which they accepted and paid N4, 240,000 each for visa, consultancy and air tickets.\nAfter a long wait, Olaleye called and delivered the so-called Canadian visa and Yellow Fever cards."
  },
  {
    "headline": "Househelp kills boss Hassan Abubakar, UBA staff in Damaturu",
    "summarized_story": "By Nabilu Balarabe/DamaturuA househelp and three others have been arrested by Yobe Police Command for the murder of Hassan Salihu Abubakar, a staff of Damaturu Branch of United Bank for Africa (UBA).\nPolice identified the househelp as 21 year-old Umar Shaibu.\nThe Command’s spokesman, ASP Dungus Abdulkarim, disclosed this in a statement in Damaturu on Monday.\n“On July 23, 2021 at about 1130hrs a report was received from one Abubakar Musa, an employee of UBA Bank, Damaturu Branch, that the victim, one Hassan Abubakar, a co-employee, did not report for duty and efforts to trace his whereabouts proved abortive.\n“They robbed him (deceased) of money but ended up killing the victim, buried the corpse in the compound and fled."
  },
  {
    "headline": "Nigeria’s pension fund hits N12.66T : PENCOM",
    "summarized_story": "By Rukayat AdeyemiThe National Pension Commission (PenCom) said pension fund assets had risen to N12.66 trillion as of June 30.\nThe workshop had as theme: Positioning the Pension Industry in the Post COVID-19 Era.\nDahir-Umar, represented by Mr Peter Aghahowa, Head, Corporate Communication, PenCom, noted that the consistent growth trajectory justified the commission’s overriding investment philosophy of ensuring the safety of pension fund assets.\nAccording to her, other strategic focus areas of PenCom include the resolution of outstanding pension liabilities of the Federal Government; portfolio diversification of pension fund investments.\nShe also mentioned improvement in customer service delivery across the pension industry and unrelenting pursuit of sustainable growth of the pension industry by expanding the coverage of the CPS."
  },
  {
    "headline": "Beninese Police chase out Igboho’s supporters from court premises",
    "summarized_story": "Beninese Police have reportedly chased out supporters of Yoruba Nation agitator, Sunday Igboho from the Cour De’appal De Cotonou where he is being tried.\nThe policemen reportedly stormed the court’s premises in several vehicles to disperse the supporters who are at the premises to garner support for Igboho.\nHis supporters and journalists were shut out of the trial, as he was being tried behind ‘closed door’ on Monday.\nHe was arrested by Interpol and was brought in court last Monday, with the case adjourned to Thursday last week.\nSeveral Yoruba leaders are battling to prevent his extradition to Nigeria as they felt he would not get justice."
  },
  {
    "headline": "4 More Bethel Baptist Students Escape Captivity",
    "summarized_story": "Four more Bethel Baptist High School students who had been kidnapped have been released.\nOn Monday in Kaduna, the chairman of the Christian Association of Nigeria (CAN), Kaduna State, John Hayab, verified the event.\n“Yes, on Sunday, July 25, another four pupils escaped from their kidnappers and were reunited with their parents,” Mr Hayab stated.\nThe bandits had stormed the school in the early hours of July 5 and kidnapped an unidentified number of children.\nASP Mohammed Jalige, a spokesman for the Kaduna police, verified the development."
  },
  {
    "headline": "Buhari Signs N982.7bn 2021 Supplementary Budget Into Law",
    "summarized_story": "President Muhammadu Buhari has signed the N982,729,695,343 Supplementary Appropriation Bill into law for the year 2021.\nThe newly signed Act, according to the announcement, will be primarily focused on funding security and health, particularly the nation’s COVID-19 needs.\nUmar el-Yahya, the President signed the Supplementary Appropriation Act, 2021 in his office at the State House.\n“The President has assented the Supplementary Appropriation Bill, so now it’s Supplementary Appropriation Act, since it has been assented by Mr. President.\nMr. President, having assented to the bill, you’ll find that molecular laboratories, about 10 of them, will be established nationwide.”"
  },
  {
    "headline": "Nnamdi Kanu Will Soon Be Free – Lawyer",
    "summarized_story": "Nnamdi Kanu’s lawyer, Ifeanyi Ejiofor, claims that the Biafra activist would soon be set free.\nIn court, the federal authorities failed to produce the leader of the Indigenous People of Biafra (IPOB).\n“Our Client -Mazi Nnamdi Kanu cannot only be visited by his lawyers but relatives and friends, provided there are only two persons in every of such visits.\n“Our discreet findings confirmed that Nnamdi Kanu was not taken out of Abuja to an unknown destination.\nMazi Nnamdi Kanu will regain his freedom sooner than may be expected”, Ejiofor added."
  },
  {
    "headline": "Man Accused Of Trying To Kill Mali President Dies In Custody",
    "summarized_story": "The government announced on Sunday that a man accused of attempting to assassinate Mali’s military strongman Assimi Goita, the man behind two coups in less than a year, had died in detention.\nFollowing the attempted assassination in Bamako’s Grand Mosque on Tuesday, the suspect, whose identity has not been released, was apprehended.\nA man armed with a knife lunged at Goita after prayers for Eid al-Adha on Tuesday, according to an AFP reporter at the scene.\nIn June, with Goita as interim president, a new government was unveiled, with military figures in key roles.\nThe bloody campaign erupted in the north of Mali in 2012 and has since spread to Burkina Faso, Mali, and Niger."
  },
  {
    "headline": "Breaking: Bandits invade community near Kaduna, kidnap another first class traditional ruler",
    "summarized_story": "The Kpop Ham and paramount ruler of Jaba Chiefdom in Jaba local government area of Kaduna state, Dr. Jonathan Danladi Gyet Maude, has been abducted by gunmen suspected to be kidnappers.\nThough information available to Blueprint did not specify when the top traditional ruler was kidnapped, his brother, Anthony Maude while confirming the incident said that the first class monarch was kidnapped in his farm located at Gitata community in Nasarawa state.\nGitata is a boundary community between Kaduna and Nasarawa states.\nSketchy details available did not disclose if the over 80-year-old traditional ruler was accompanied by his security details or if he was alone and the whereabouts of the security details.\nThe Kaduna state Police Public Relations Officer, ASP Muhammad Jalige, while confirming the kidnap said the Police Command is in touch with their counterparts in Nasarawa state who are seriously working on the matter."
  },
  {
    "headline": "VIDEO: How Nnamdi Kanu’s anticipated retrial set highways on fire, kept may away from work places, markets in Anambra, other states",
    "summarized_story": "NextBreaking: Bandits invade community near Kaduna, kidnap another first class traditional ruler"
  },
  {
    "headline": "Pictures: President Muhammadu Buhari signs N983bn 2021 Supplementary Appropriation Bill into Law",
    "summarized_story": "NextVIDEO: How Nnamdi Kanu’s anticipated retrial set highways on fire, kept may away from work places, markets in Anambra, other states"
  },
  {
    "headline": "Engineering firm rewards Air Peace crew for foiling on-board theft -NigPilot",
    "summarized_story": "The crew reportedly noticed Kelvin taking an envelope of money from Engr Adeniyi’s laptop bag in the overhead cabin.\n“Aware of the former’s theft antecedents, our crew subtly questioned him about the ownership of the bag, which he claimed was his.\nAdeniyi later disclosed that the envelope had a significant sum, which was still intact when Kelvin returned the envelope,” the airline stated.\nOlisa added that the incident was immediately reported to the Airport Security Officials who are currently handling it, while Kelvin has been blacklisted from flying with Air Peace.\nEarlier in June this year, the Air Peace crew had botched the trafficking of two babies by a couple."
  },
  {
    "headline": "Electronic transmission of votes: SDIC, others condemn NCC, NASS -NigPilot",
    "summarized_story": "Social Development Integrated Centre, SDIC, and its affiliates have condemned the orchestrated plot against the electronic transmission of votes by anti-democratic forces.\nThey said his action was to take down the proposed electronic transmission of votes which is pivotal to credible elections in Nigeria, adding that the NCC official, in his blind quest to achieve an insidious agenda, contradicted all factual and evidential prognosis that electoral votes can be effectively transmitted electronically.\n‘‘The benefits of electronic transmission of votes cannot be over-emphasized.\nIt reduces credibility issues associated with manual transmission of voting tallies, reduces costs and associated risks of officials handling manual transmission.\nThe deletion of Sections 65 and 88 completely monetized the electoral process, among others.’’The statement was endorsed by 124 other civil society groups."
  },
  {
    "headline": "Labour, CSOs launch campaign for transformative governance",
    "summarized_story": "Labour and Pro-Labour Civil Society Organisations, CSOs, yesterday launched a Campaign for Transformative Governance to end bad governance, corruption, and human insecurity.\nThe campaign is joint labour and pro-labour CSOs advocacy and platform to influence radical changes in government policies, processes and institutions at all levels towards achieving transformative governance.\nThe pro-labour CSOs include the Trade Union Congress, TUC, Amalgamated Union of Public Corporation Civil Service and Recreational Service Employees, AUPCTRE, Federation of Informal Workers of Nigeria, FIWON.\nAccording to the statement, ‘‘it is unacceptable that a country with enormous resources would be ranked among the poorest in the world.\nThe facts and figures paint a very grim picture.’’The three thematic areas of the campaign are ensuring accessible and effective public service delivery, political education of citizens for transformative governance, and promoting human security as a panacea to the endemic insecurity and ravaging poverty in the country."
  },
  {
    "headline": "MURIC kicks against planned Yoruba Nation Christian Association -NigPilot",
    "summarized_story": "Islamic human rights organization, Muslim Rights Concern, MURIC, has kicked against the planned inauguration of the Yoruba Nation Christian Association, YORNCA by the Power Apostolic Church International, Ojoo, Ibadan, Oyo State.\n“Do we have the Yoruba nation already?\nBecause it presupposes that the real motive behind the agitation for the Yoruba nation is to ‘catch’ Yorubaland ‘for the Lord’.\nIs the Yoruba nation project a Christian agenda?\nIf not, the Christian Association of Nigeria (CAN) should call the Power Apostolic Church International, Ojoo, Ibadan, to order."
  },
  {
    "headline": "UPDATED: DSS Fails To Produce Nnamdi Kanu In Court, Judge Adjourns Trial Till October",
    "summarized_story": "The Federal High Court sitting in Abuja has adjourned the trial of Nnamdi Kanu, the leader of the Indigenous People of Biafra (IPOB).\nJustice Binta Nyako adjourned the trial on Monday at the resumption of proceedings at the court in the Federal Capital Territory (FCT).\nThe trial suffered a setback after the Department of State Services (DSS) failed to produce Kanu in court.\nEjiofor also asked the judge to grant Kanu access to his medical doctor for the purpose of carrying out a comprehensive independent medical examination on him.\nAccording to him, the defendant cannot get a fair trial if he remains in the custody of the DSS."
  },
  {
    "headline": "Buhari Signs N982.72bn Supplementary Budget For Security, COVID-19",
    "summarized_story": "President Muhammadu Buhari has assented to the 2021 Supplementary Appropriation Bill submitted to the National Assembly in June.\nThe 2021 Supplementary Appropriation Act, which is targeted at the provision of military hardware and COVID-19 vaccines, comes into effect from July 26.\nThe Supplementary Appropriation Bill passed by the lawmakers amounted to a total of N982.72 billion.\nIn June, President Buhari asked lawmakers in both Senate and House of Representatives to approve a 2021 Supplementary Budget estimate of N895,842,465,917 in separate letters to the leadership of both chambers.\nThe lawmakers went on to pass an increased sum of N982,729,695,343 as the approved 2021 Supplementary Budget estimate."
  },
  {
    "headline": "Nnamdi Kanu To Remain In DSS Custody, Judge Rules",
    "summarized_story": "Justice Binta Nyako of the Federal High Court gave the order on Monday during the resumption of Kanu’s trial in Abuja.\nIn an application to the judge, Mr Kanu had argued that he cannot get a fair trial if he remains in the custody of the DSS.\nIn her verdict, Justice Nyako ordered that the DSS should allow access to Mr Kanu, although it won’t be a free-for-all.\nWith Mr Kanu absent in court, the judge adjourned the trial to October 21.\nThe DSS said Mr Kanu’s absence in court was due to logistics reasons."
  },
  {
    "headline": "Ogoni Youths Shut Down East-West Road In Protest",
    "summarized_story": "Youths from the four Ogoni-speaking Local Government Areas of Rivers State on Monday morning blocked the Eleme-Onne axis of the East-West road to protest the poor condition of the federal highway.\nThe youths mobilised trucks which they used to block both ends leading to the nation’s critical infrastructures especially the only bridge connecting the area to Port Harcourt.\nApart from the hauling of goods from Eleme, the East-West road with only an access bridge which is near collapsing connects nine local government areas to Port Harcourt, the Rivers State capital.\nAlso, the physical verification of the Continuous Voter Registration exercise scheduled to commence in parts of Rivers State on Monday was affected by the protest.\nIt, however, assured potential registrants in the affected local government areas that the exercise will commence in the areas as soon as the situation is put under control."
  },
  {
    "headline": "Kaduna Kidnap: Four Additional Baptist Students Regain Freedom",
    "summarized_story": "Four additional abducted students of Bethel Baptist Secondary School in Kaduna State have regained their freedom.\nThe latest development, therefore, brings the total number of the rescued students to 38 out of the 121 that were abducted by bandits on July 5th.\nOn Sunday, 28 more abducted students of the school also regained their freedom.\nREAD ALSO: Tears, Joy As 28 More Kidnapped Students Regain Freedom In KadunaThe students were found inside the Tsoho Gaya Forest in the Chikun Local Government Area of the state in the early hours of Sunday.\nThe bandits, who stormed their school on July 8, later demanded a ransom of ₦60million for the release of the students."
  },
  {
    "headline": "PDP Governors insist on Electronic transmission of election results",
    "summarized_story": "The Peoples Democratic Party (PDP) Governors’ Forum has insisted that the National Assembly must approve electronic transmission of election results.\nThe governors made this and Other demands at the end of their meeting in Bauchi State.\nThe PDP Governors insist that the National Assembly must enact laws to make it possible.\nAdvertisementThe governors condemned what they described as an attempt to force the same method of conducting party primaries on all parties.\nThe meeting condemned what it said is an attempt to arm twist PDP governors to join the APC and turn the Presidential Villa that belongs to all Nigerians to the headquarters of the APC."
  },
  {
    "headline": "Ini Umoren’s Killer, Uduak Akpan, pleads guilty to murder",
    "summarized_story": "The 20 year old killer of the Akwa Ibom Job Seeker, Ini Umoren, Uduak Akpan, has pleaded guilty to murder but entered a not guilty plea for Rape.\nUduak Akpan had lured Ini Umoren out of her home with a fake job interview.\nMiss Umoren was raped and killed in April in the outskirts of Uyo by Mr Akpan who the police in Akwa Ibom State described as a serial rapist.\nAdvertisementMr Akpan, who was arraigned alongside his father, however, pleaded not guilty to the charge of rape.\nThe case is being prosecuted by the Akwa Ibom State Government."
  },
  {
    "headline": "Residents of Dansadau storm Zamfara Assembly in solidarity with Governor Matawalle",
    "summarized_story": "Residents of Dansadau area in Maru local government area of state Zamfara state has called on the state government to deal decisively with anyone found guilty of fuelling armed Banditry and other criminality in the stateThe people in their large number stormed the Zamfara state House of Assembly Complex in solidarity to the steps taken by the Matawalle’s administration in bringing lasting end to the menace of InsecurityThey commended Governor Bello Matawalle for suspending some traditional rulers alledged to be involved in banditry activitiesThe peaceful protesters want government to place such persons and their collaborators on security checks to put a stop to the incessant of attack on communities and abduction of personsSpeaking on behalf of the people Sani babbar Doka, Ya’u Muhammad and Asmau mutunji says Dansadau and surrounding communities has suffered in the hands of bandits which has crippled farming and socio-economic activities in the areaAdvertisementThey said only peace can revive farming and commercial activities in the area as trades from other communities finds it difficult attending market days in the areaThe protesters were holding placards with various inscription “We need new emir for peace to reign in Dansadau”“Farmers in Dansadau are Happy with Government efforts to address Insecurity”“Government deal decisively with anyone fuelling banditry no matter how highly placed”.\nReceiving the protesters, the Member representing Maru South in the Zamfara state House of Assembly Kabiru Hashimu Dansadau said government is working round the clock to ensure residents of the state sleep with their two eyes closedAdvertisementHashimu Dansadau assured them that their complain will be looked intoOn his part, the Speaker of the Zamfara state House of Assembly Nasiru Mu’azu Magarya commend the protesters for conducting their self in a peaceful mannerThe speaker noted that Governor Bello Matawalle and the lawmakers are not relenting in his quest of securing the lives and properties of all citizens especially those in the troubled areasMu’azu Magarya further appeal to the people to remain calm and continue to pray for lasting peace in Zamfara.\nDansadau community came under Bandits attack few days ago leading to the destruction of properties including Armoured Personal Carrier belonging to the Nigerian Army stationed to keep peace in the area."
  },
  {
    "headline": "Buhari Sued Over Media Gag Order",
    "summarized_story": "Reactions have trailed a video of a yet to be identified woman who appeared to be voting for the All Progressives Congress.\nSocio-Economic Rights and Accountability Project and Centre for Journalism Innovation and Development have filed a lawsuit against President Muhammadu Buhari and the Minister of Information and Culture, Lai Mohammed, asking the court to declare illegal the gag order stopping journalists and broadcast stations from reporting details of terrorist attacks and victims.\nFinally, the Vatican published for the first time on Saturday its annual budget for a key department managing property and investments, just days before the start of a high-profile trial over a London investment."
  },
  {
    "headline": "War Set to Expand as Ethiopia’s Amhara Region Rallies Residents to Fight Tigrayan Forces",
    "summarized_story": "Ethiopia’s Amhara region has called on all armed residents to mobilise for battle against rebels from conflict-hit Tigray, calling it a “survival campaign”, state media reported.\nAmhara borders Tigray to the south, and the two regions are embroiled in a decades-old land dispute that has become central to the eight-month-old war in Tigray.\nSunday’s statement from Amhara regional president Agegnehu Teshager echoes a call made Friday by the president of Ethiopia’s Afar region just east of Tigray.\nTogether the two statements highlight the potential for the Tigray war, which Prime Minister Abiy Ahmed declared all but over in late November, to draw in the rest of the country.\nThe war has already killed thousands and, according to the United Nations, pushed hundreds of thousands into famine."
  },
  {
    "headline": "Tunisia’s President Accused of ‘Coup’ after Dismissing Prime Minister",
    "summarized_story": "Tunisia’s president has suspended parliament and dismissed Prime Minister Hichem Mechichi in a move condemned as an attack on democracy by his rivals but which others greeted with celebrations on the streets.\nIt is the biggest challenge yet to a 2014 constitution that split powers between the president, prime minister and parliament.\nTunisian Parliament Speaker Rached Ghannouchi accused President Saied of launching “a coup against the revolution and constitution” after the move.\nTunis-based journalist Rabeb Aloui told Al Jazeera that Saied’s move did not come as a surprise, as he had threatened to dissolve parliament and sack the prime minister.\nIn Tunis on Sunday, police used pepper spray against protesters who threw stones and shouted slogans demanding that Prime Minister Mechichi quit and parliament be dissolved."
  },
  {
    "headline": "China Blames US for ‘Stalemate’ in Relations, as Talks Begin",
    "summarized_story": "The fundamental reason why relations between the two face serious difficulties is because some Americans portray China as an “imagined enemy,” the Foreign Ministry quoted Xie as saying.\n2 diplomat, is the highest-ranking U.S. official to visit China since Biden took office six months ago.\nThe Biden administration has said it will cooperate in some areas but confront China in others, such as human rights, describing the relationship as collaborative, competitive and adversarial.\n“China would never accept any country that claims to be superior to others,” he told China’s Phoenix Television.\nJohn Kerry, the Biden administration’s special climate envoy, traveled to Shanghai for meetings with his Chinese counterpart in April."
  },
  {
    "headline": "Covid: Fauci Says US Heading in Wrong Direction as Cases Rise",
    "summarized_story": "Dr Anthony Fauci said the Delta variant of Covid-19 was driving the spike in areas with low vaccination rates.\nThe US had been a world leader in jab uptake until April, when vaccination rates started to drop off.\nVaccination rates are particularly low in southern states, where fewer than half of residents have received their first dose in some cases.\nThe sharpest increases in Covid cases are in states with lower vaccination rates, such as Florida, Texas and Missouri.\nIn his interview with CNN, Dr Fauci said local leaders in areas with low vaccination rates needed to do more to encourage people to get jabbed."
  }
]