[
  {
    "headline": "Anger as Buhari threatens to deal with promoters of insurrection",
    "summarized_story": "Some Nigerians on Twitter have expressed their anger at the warnings by the President, Major General Muhammadu Buhari (retd.\n), to treat promoters of insurrection in a language they will understand.\nIn a statement on Tuesday, the President had said, “Many of those misbehaving today are too young to be aware of the destruction and loss of lives that occurred during the Nigerian Civil War.\nThose of us in the fields for 30 months, who went through the war, will treat them in the language they understand.”This statement did not go down well with many Nigerians as they have reacted to the President’s statement.\n“Meanwhile, President Buhari has never spoken this tough to killer Fulani herdsmen, Boko Haram and bandits,” the user wrote."
  },
  {
    "headline": "Seven things you didn't know about NECO Registrar, Godswill Obioma",
    "summarized_story": "The Registrar of the National Examinations Council, Professor Godswill Obioma, died on Monday night.\nHere are seven things you should know about the NECO Registrar:1.Obioma hails from Bende Local Government Area in Abia State, South-East Nigeria.\nFrom 1994 to 2000, Obioma served as the Director, Monitoring and Evaluation in the National Primary Education Commission, Kaduna.\nHe served as the Director, Monitoring, Research and Statistics at the National Board for Technical Education, Benin City, from 2003 to 2005.\n), as the registrar of NECO for a five-year tenure."
  },
  {
    "headline": "INSECURITY: Nigeria to receive 6 air-fighters in June — Reps’ Defence C’tee Chair",
    "summarized_story": "Kindly Share This Story:By Olayinka AjayiThe Chairman of the House Committee on Defence, Jimi Benson, has disclosed that the much anticipated Super Tucano air-fighter is expected in Nigeria at the end of June.\nFielding question yesterday on a monitored programme on Channels Television ‘Politics Today’ the Chairman, Committee on Defence affirmed that the air-crafts Nigeria is expecting from the US are game-changers in the fight against insecurity,Also Read:“We visited where the aircraft were manufactured, and we got a firm commitment that six will be delivered by the end of June and the other six by the end of September.\n“They spoke highly of our personnel who are going to be manning the weapon and they also informed us that those weapons are game-changers.\nThey have a lot of precision that would reduce civilian mortality.\nThey believe it’s a sign of a good thing to come between the US and the Nigerian counterpart and would also open doors within the US assisting in its fight against insurgency.”Vanguard News NigeriaKindly Share This Story:"
  },
  {
    "headline": "My desire is to get FCE Akoka upgraded to university — Provost",
    "summarized_story": "Kindly Share This Story:By Adesina WahabThe Provost, Federal College of Education, Technical, Akoka, Lagos, Dr Wahab Azeez, has said he is desirous of getting the institution upgraded to a Federal University of Technical Education.\n“The Act that established this College is being amended at the National Assembly; my aspiration is to see that this College is upgraded to the Federal University of Technical Education.\nAlso Read:“This is to enable us to service the students who want to run degree programmes in technical education, and we are already talking with members of NASS on it.\nWe need to make the public know the importance of technical education here in Nigeria; China is giving preference to technical education, being the reason for its progress,” he said.\nHe noted that while his administration inherited some problems, it had taken steps to address a number of them such as dilapidated infrastructure, poor hostel accommodation, poor power supply among others."
  },
  {
    "headline": "CAN leadership debunks rumour of boycotting Covid-19 vaccine",
    "summarized_story": "Kindly Share This Story:By Charly Agwam – BauchiBauchi State Chapter of the Christian Association of Nigeria (CAN) has debunked rumours that Bauchi Christians are refusing to receive the Covid-19 vaccine over some controversial religious beliefs.\n“Christians in the state are obedient people who are committed to participating in the exercise.\nWe, therefore, distance ourselves from pronouncements or any insinuation that Christians in Bauchi state have tagged the vaccination exercise as anti-christian”“I want to assure the government that no Christians in Bauchi state will deliberately not take the vaccination.\nI, therefore, call on all Christians that are medically fit to come out and take the vaccine,” the statement reads.\nRecall that Bauchi State Governor, Bala Mohammed had decried the alleged refusal of Christian leaders to take the AztraZenica Covid-19 vaccine after the governor was briefed on vaccine acceptance by the Head of Bauchi State Primary Healthcare Development Agency, Dr Rilwanu MohammedVanguard News NigeriaKindly Share This Story:"
  },
  {
    "headline": "Ikpeazu mourns NECO registrar",
    "summarized_story": "Okezie Ikpeazu of Abia has described the death of National Examinations Council (NECO) Registrar, Prof. Godswill Obioma, as profoundly sad and yet another blow to the people of Abia.\nObioma, who was the Registrar and Chief Executive Officer of the NECO, was reportedly died during a brief illness in his house on Sunday.\nIkpeazu said that he had sent a congratulatory message to the late Obioma barely a year ago, on May 22, 2020 after he was appointed the registrar of NECO.\n“It is almost impossible to produce alternatives to men like Professor Obioma,” Ikpeazu said.\n“Losing these two eminent and scholarly gentlemen in quick succession is indeed very sad for me as the governor and for our state,” Ikpeazu said."
  },
  {
    "headline": "Ikpeazu reacts to Godswill Obioma's death",
    "summarized_story": "Governor Okezie Ikpeazu of Abia State has reacted to the death of the Registrar and Chief Executive Officer of the National Examinations Council (NECO), Professor Godswill Obioma.\nDAILY POST had reported that Godswill Obioma died on Tuesday after a brief illness, his son, Prince Godswill Obioma the second confirmed.\nGovernor Ikpeazu recalled that on May 22 2020, he sent a message of congratulations to Professor Obioma over his appointment as the Registrar of the National Examinations Council.\nGovernor Ikpeazu stated for emphasis that the death of Professor Obioma was due to natural causes, describing as unfortunate the attempt to politicize the death and give it ethnic undertones with the sole objective of exacerbating the already charged situation in the country.\nGunmen murder NECO Registrar, Godswill Obioma"
  },
  {
    "headline": "Nigeria Immigration postpones application for new passports again",
    "summarized_story": "The Nigeria Immigration Service (NIS) has postponed applications for new passports again.\nIt was earlier slated to commence on June 1, 2020, but the new date will now be June 8, 2021.\nRecruitment: Immigration boss, Babandede give update, warns job seekersThe statement read in part, “A huge number of applicants are already turning up to collect their passports across issuing centres and this is causing some forms of congestion.\nThe move was to allow for the clearance of backlog from all local and foreign passport applications received before May 17, 2021.\nBabandede also revealed that a total of 230,500 applications have been cleared and the passports produced."
  },
  {
    "headline": "LAUTECH: Makinde approves 25 percent reduction in tuition fees",
    "summarized_story": "Oyo Governor, Seyi Makinde, on Tuesday, announced the 25 per cent reduction in the tuition fees of the Ladoke Akintola University of Technology (LAUTECH).\nA statement by spokesman, Taiwo Adisa, quoted Makinde as saying he was thankful to the students for according him warm reception.\nMakinde appoints members of LAUTECH Governing CouncilHe expressed happiness about fulfilling the promise of securing the sole ownership of LAUTECH for Oyo State.\nThe Oyo helmsman said from now on, a four-year programme in LAUTECH will not turn to eight years again.\nASUU faults Makinde for forcing LAUTECH VC to step aside"
  },
  {
    "headline": "‘Those out to destroy my govt will be dealt with'",
    "summarized_story": "President, Muhammadu Buhari has said those who want to destroy his government will receive the shock of their lives as they will be treated in a language they will understand.\nAccording to him, “Whoever wants the destruction of the system will soon have the shock of their lives.\nWe’ve given them enough time.”No Govt can defeat her citizens, time to pay back – Nnamdi Kanu“I received a briefing today from the Chairman of the Independent National Electoral Commission, on the series of attacks on their facilities nationwide.\nThese attacks are totally unacceptable, and we will not allow those behind them to achieve their evil objectives.\nKaduna govt vs NLC: Nigerian govt working to bring lasting peace – Lai Mohammed"
  },
  {
    "headline": "Southern Kaduna people decry incessant killings",
    "summarized_story": "The Southern Kaduna Peoples Union, SOKAPU, has expressed concern that suspected Fulani militias ambushed and killed people coming from their farms in Goska village, Kaninkon Chiefdom, Jemaa Local Government Area of Kaduna state.\nThe SOKAPU spokesman, Luka Binniyat, in a statement explained that in the past one week, Godogodo town and Golkofa village Godogodo Chiefdom, Jemaa local government area have also witnessed similar invasions by the suspected Fulani militias.\nSouthern Kaduna people decry mass sack of civil servants by El-RufaiThe statement observed that Kaduna state is becoming more and more unsafe for its residents, pointing out that no day that passes that a community is not attacked in Kaduna state or persons are kidnapped as individuals or in groups.\nIt said if something is not done to check the increasing ungoverned spaces springing up in Kaduna state, no one can predict the disaster that is looming ahead.\nFour killed, houses destroyed by militias in Southern Kaduna"
  },
  {
    "headline": "FACT-CHECK: Does COVID-19 vaccine cause infertility in men, women?",
    "summarized_story": "He later stated that the controversy was one of the causes of COVID-19 vaccine hesitancy in the state.\n”For the COVID-19 vaccine, Ejembi said, “The vaccine is supposed to prevent serious infection when taken.\nThere is currently no evidence that any vaccines, including COVID-19 vaccines, cause fertility problems—problems trying to get pregnant.\nHowever, the vaccine is not a live virus vaccine, the mRNA does not enter the nucleus of the cell and is degraded quickly.\nTherefore, there is no need to freeze your sperm before taking COVID-19 vaccine as the claim that COVID-19 vaccines infertility is Misleading and tends to contribute to Vaccine Hesitancy."
  },
  {
    "headline": "‘President, governors should serve single term of five years’",
    "summarized_story": "By Joseph JibuezeThe ongoing constitution amendment should provide for the president and governors to serve only a single term of five years rather than two four-year terms.\nNational appointments must comply with the federal character principle and its violation should be an impeachable offence.\nThese are the views of a former Peoples Democratic Party (PDP) governorship aspirant in Akwa Ibom State, Robert Ekutmfon Umoette.\nA five-year term, he said, would “reduce animosity and acrimony and allow for focus towards true service delivery from day one in office”.\nImmunity clause removal, he believes, will end the “emperor-like tendency and make them (president, governors and their deputies) open to legitimate criminal proceedings for actions carried out while in the office with credible evidence”."
  },
  {
    "headline": "COVID-19: Fed Govt to deactivate passports of travel advisory violators",
    "summarized_story": "Agency ReporterThe Presidential Steering Committee (PSC) on COVID-19 pandemic has said the Federal Government would enforce penalties, including deactivating the travel passports of violators of recent travel advisory for travellers from India, Brazil and Turkey.\nThe Federal Government, in the last three weeks, had published names and other travel particulars of more than 220 alleged violators of the travel advisory, who evaded protocols set for travellers from the said countries of concern.\nADVERTISEMENTAccording to Mustapha, besides deactivating passports of the Nigerian violators, the foreign offenders would have their visas revoked and prosecution, where applicable, would be an option.\n“Pursuant to the travel advisory issued, I wish to inform you that the PSC has initiated series of sanctions against those that have violated the 2021 Health Safety Regulations.\n“To this end, the PSC has published the names and particulars of over two hundred violators that evaded the quarantine requirement."
  },
  {
    "headline": "Oshiomhole, Ize-Iyamu ask Obaseki to be magnanimous in victory",
    "summarized_story": "Edo PDP spokesman Chris Nehikhare, however, kicked against the admonition, describing the APC leaders’ demands as unmerited.\nOshiomhole, yesterday in a congratulatory message by his media aide, Victor Oshioke, said: “Congratulations on your victory at the Supreme Court, which has effectively laid to rest all matters arising from the last election.\n“As I have consistently advised, please, be magnanimous in victory.\nWhile acknowledging that the matter was in court, he urged the governor to intervene, through out-of-court settlement, in the interest of Edo, thereby ensuring peace.\nADVERTISEMENTHe also congratulated Obaseki on his victory at the apex court."
  },
  {
    "headline": "BREAKING: NECO Registrar, Godswill Obioma is dead",
    "summarized_story": "From Fred Ezeh, AbujaRegistrar, National Examinations Council (NECO), Prof. Godswill Obioma, has been reportedly killed by unknown assailant.\nProf. Obioma was said to have been killed on Monday night when the assailant invaded his house, strangle him and left with nothing.\nNECO spokesman, Sani Azeez, could neither pick nor return calls placed on his phone.\nAlthough details surrounding his death were sketchy at the time of filing this report, a source close to the deceased said he was not slain; rather, that he slumped in his house and died, in front of his wife and aides.\nMore details later…"
  },
  {
    "headline": "Kalu laments murder of Ex-Presidential adviser, Gulak",
    "summarized_story": "Lamenting the gruesome murder of the former Presidential aide, Kalu condemned the perpetrators of the act, describing their action as totally unacceptable and evil.\n“The evil act is totally unacceptable and highly condemnable.\nThe sponsor (s) of the ugly act must face the wrath of the law.\n“Appropriate security agencies must begin a full scale investigation into the murder of the politician.\n“It is important for security agencies to work closely with local communities in fishing out criminals from the society."
  },
  {
    "headline": "Ganduje, Garba tasks media on professionalism",
    "summarized_story": "Abdullahi Ganduje of Kano State has tasked journalists on the need to demonstrate professionalism in their reportage as they serve as a link between the government and the people.\nGanduje made the appeal on Monday in Kano while declaring open the 2021 Nigerian Guild of Editors (NGE) Biennial Conventions.\nI believe that absence of influential press council that should regulate the media has affected the media practice.\nGanduje also called on journalists to promote peace, harmony and unity at this crucial time in the country.\nGanduje also observed that crossing of redlines by some media organisations in recent times had impacted on the nation’s unity, harmony and integration."
  },
  {
    "headline": "Insecurity: Customs goes after private jet owners",
    "summarized_story": "This is to ensure strict compliance with all relevant regulations governing importation of such aircraft.\nWhile clarifying that private jets do not pay Customs duties, Attah said such airplanes are expected to pay the mandatory Comprehensive Imports Supervision Scheme (CISS) charges.\nThe move is not punitive but to ensure compliance.\nWe believe private jet owners are highly-placed individuals that will do the right thing.\nThey’ll will do what the law says.”In another development, Attah disclosed Customs generated N799,024,705,961 between January 1 and May 30 this year."
  },
  {
    "headline": "Benue killings: Ebonyi on red alert to avoid spill over",
    "summarized_story": "From Magnus Eze, EnuguThe Ebonyi State Government saID it has taken security measures to forestall spillover of the attack that took place in the early hours of Sunday at Nwori Ndi-Obasi village in Ado Local Government Area of Benue State, to neighboring villages of Okwofuruike, Odoke and Ohabuleodo in Izzi and Ebonyi LGAs of the state.\nCommissioner for Internal Security, Border Peace and Conflict Resolution, Stanley Okoro-Emegha, said government has mobilised and dispatched a combined team of security agencies and members of the Ebubeagu security to ensure peace and normalcy in the troubled area.\nThe government had expressed dismay over the invasion of the Benue communities which are predominantly of Izzi stock.\nSuspected herders had attacked inhabitants of the village killing, maiming and razing several houses.\nAnd because the victims are of Izzi origin though in Benue State, many had taken them to belong to Ebonyi State."
  },
  {
    "headline": "Insecurity: N’ Assembly Tired of Observing a Minute Silence for Casualties, Says Lawan",
    "summarized_story": "One minute silence observed six times at Senate plenary TuesdayBy Deji Elumoye and Emameh GabrielThe Senate has expressed concern over the spate of one minute silence usually observed at its plenary as a result of deaths associated with security challenges facing the nation.\nThis is just as the upper chamber at Tuesday’s plenary observed one minute silence six times for those who lost their lives through killings and murders in the wake of security issues across the country.\nAccording to him, it is imperative for the National Assembly to step up legislative interventions to reduce the number of deaths caused by criminal activities.\nHe added that such interventions would be backed by collaborative efforts between the legislature, executive and Nigerians to address Nigeria’s security challenges.\nHe said: “It is very important that we step up our legislative intervention in ensuring that we protect the lives and properties of Nigerians to reduce the incidence of one-minute silence."
  },
  {
    "headline": "Bandits Demand N110m for Release of Abducted Niger Islamic School Pupils",
    "summarized_story": "The bandits contacted the school Headmaster, Alhaji Abubakar Alhassan, at about 4 pm on Monday, asking him to pay N110 million as ransom for the release of his pupils.\nSpeaking with THISDAY via telephone Tuesday, Alhassan said the bandits claimed to have 156 pupils with them.\nAlhassan said the message has been passed to the state government, which said it will not pay ransom for the release of the children.\n“The number of the kidnapped school children is not fully ascertained.\n“We don’t pay ransom to abductors."
  },
  {
    "headline": "Buhari Seeks Senate’s Confirmation of Maj Gen Yahaya as COAS",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari has written formally to the Senate seeking its confirmation of the appointment of Major General Farouk Yahaya as the new Chief of Army Staff (COAS).\nThe president’s request letter, which was addressed to the President of the Senate, Dr Ahmad Lawan, was read at the resumption of Senate plenary on Tuesday.\nPresident Buhari had last week named Major General Yahaya as COAS to replace Lt General Ibrahim Attahiru who died alongside 10 other military officers and men in an air crash in Kaduna last month.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "NECO Registrar, Godswill Obioma, is Dead",
    "summarized_story": "By Laleye DipoThe Registrar and Chief Executive Officer of the National Examination Council NECO Professor Godswill Obioma is dead.\nA reliable source close to the family told THISDAY in Minna, Niger state that Obioma died in the early hours of Tuesday.\nAccording to the source, the NECO registrar returned to his Minna residence late on Monday and some minutes after checking into his house along Okada road, his cousin found him on the floor in his bedroom.\nIt was gathered that he was immediately rushed to Abuja for treatment.\nHowever THISDAY learnt that it was at the National Hospital that the NECO boss was confirmed dead."
  },
  {
    "headline": "South-east Grounded as Residents Comply with Sit-at-home Order",
    "summarized_story": "However, a gun duel between the police and IPOB fighters within Ebebe junction in Abakaliki, the Ebonyi State capital, reportedly claimed five lives.\nA student of Ebonyi State University also told THISDAY that the sit-at-home order disrupted academic activities.\nResidents of the two major Abia cities fully complied with the sit-at-home order.\nThe ever-busy Wetheral Road, Douglas Road, Royce Road, Okigwe Road, Orlu Road, Onitsha Road, Port Harcourt Road and Aba Road were all empty.\nShedding light on why there was total compliance with the sit-at-home order, spokesman of the pan-Igbo sociopolitical organisation, Ohanaeze Ndigbo, Hon."
  },
  {
    "headline": "Eight Abductions That Shook Nigeria",
    "summarized_story": "Though, it happens all over Nigeria, the Northern part of country still remains a hotbed of kidnappings by terrorists and bandits.\nThis brought about a movement of #BringBackOurGirls protest in Nigeria spearheaded by a former Education Minister, Oby Ezekwesili.\nThe Nigerian Air Force and Nigeria Army deployed their men to search for them, but all to no avail.\nIt was on 27th February, that the government of Niger State announced the bandits had released all 42 hostages.\nA video revealed how scores of people were running helter-skelter on the Tegina-Zugero highway in Niger State, during the assault."
  },
  {
    "headline": "Eight Abductions That Shook Nigeria",
    "summarized_story": "Though, it happens all over Nigeria, the Northern part of country still remains a hotbed of kidnappings by terrorists and bandits.\nThis brought about a movement of #BringBackOurGirls protest in Nigeria spearheaded by a former Education Minister, Oby Ezekwesili.\nThe Nigerian Air Force and Nigeria Army deployed their men to search for them, but all to no avail.\nIt was on 27th February, that the government of Niger State announced the bandits had released all 42 hostages.\nA video revealed how scores of people were running helter-skelter on the Tegina-Zugero highway in Niger State, during the assault."
  },
  {
    "headline": "How Suspended NPA boss, Usman Lied, Deceived Vice-President Osinbajo, Others Over Plans To Selfishly Give Calabar Port Project To Cronies",
    "summarized_story": "The project is under Calabar Channel Management, a joint venture operation between a consortium led by Niger Global Engineering and Technical Company Limited and the Nigerian Ports Authority.\nHer lies have cost the country so much money because dredging the Calabar Port would have decongested Lagos ports.\nThis company is being appointed by the NPA to regularly audit the three channel management namely; Lagos Channel Management (LCM), Bonny Channel Management (BCM) and Calabar Channel Management (CCM).\nThe letter was titled ‘Re: Execution Summary of the Entire Argument Surrounding the Calabar Channel Management Contract at the Truth Verifiably Documentary Evidence’.\nShe is the reason why Calabar Port has not been dredged and Lagos ports decongested,” added one of the sources."
  },
  {
    "headline": "How Suspended NPA boss, Usman Lied, Deceived Vice-President Osinbajo, Others Over Plans To Selfishly Give Calabar Port Project To Cronies",
    "summarized_story": "The project is under Calabar Channel Management, a joint venture operation between a consortium led by Niger Global Engineering and Technical Company Limited and the Nigerian Ports Authority.\nHer lies have cost the country so much money because dredging the Calabar Port would have decongested Lagos ports.\nThis company is being appointed by the NPA to regularly audit the three channel management namely; Lagos Channel Management (LCM), Bonny Channel Management (BCM) and Calabar Channel Management (CCM).\nThe letter was titled ‘Re: Execution Summary of the Entire Argument Surrounding the Calabar Channel Management Contract at the Truth Verifiably Documentary Evidence’.\nShe is the reason why Calabar Port has not been dredged and Lagos ports decongested,” added one of the sources."
  },
  {
    "headline": "We’ve Arrested Bandits Who Abducted Islamic School Students— Niger State Government",
    "summarized_story": "The Niger State government says it has arrested some of the bandits who abducted students of the Salihu Tanko Islamiyyan School, Tegina in the Rafi Local Government Area of the state.\nThe school, which consists of nursery and primary arms, also hosts Islamiyya students in the evening and at weekends.\nIt is in the same local government area with Kagara where bandits earlier this year abducted many students but later released them after negotiation with the state government.\nThe deputy governor, however, ruled out payment of any ransom but assured that the abducted children would be rescued the same way the Kagara Science College boys were rescued.\n“We are still taking the census of the children to know the exact number that were actually abducted."
  },
  {
    "headline": "Immigration: Requests for passport booklets remain suspended till June 8",
    "summarized_story": "The federal government through the Nigeria Immigration Service (NIS) has extended the suspension of applications for passport booklets by one week.\nAdvertisementThe NIS said in a statement on Tuesday that the applications, which was scheduled to resume on June 1, will now commence on June 8.\nThe service had, on May 18, suspended fresh requests for booklets to enable passport issuing centres to clear existing backlog of applications by May 31.\n“Consequent upon the above, the Minister of Interior, Rauf Aregbesola, has extended the commencement of the new passport regime earlier scheduled for June 1, 2021 by one week till June 8, 2021.\nTheCable had reported that the contractors in charge of the passport booklets were not able to source for forex from official sources and had to resort to the parallel market."
  },
  {
    "headline": "Immigration: Requests for passport booklets remain suspended till June 8",
    "summarized_story": "The federal government through the Nigeria Immigration Service (NIS) has extended the suspension of applications for passport booklets by one week.\nAdvertisementThe NIS said in a statement on Tuesday that the applications, which was scheduled to resume on June 1, will now commence on June 8.\nThe service had, on May 18, suspended fresh requests for booklets to enable passport issuing centres to clear existing backlog of applications by May 31.\n“Consequent upon the above, the Minister of Interior, Rauf Aregbesola, has extended the commencement of the new passport regime earlier scheduled for June 1, 2021 by one week till June 8, 2021.\nTheCable had reported that the contractors in charge of the passport booklets were not able to source for forex from official sources and had to resort to the parallel market."
  },
  {
    "headline": "‘Buhari supporter’ creates APC faction in Kano",
    "summarized_story": "Abdulmajid Kwamanda, a staunch supporter of President Muhammadu Buhari in Kano, has created a new faction of the All Progressives Congress (APC) in the state.\nSpeaking at a media briefing on Tuesday, Kwamanda said a meeting on the decision to create the faction in the state — referred to as ‘APC Akida’ — commenced on May 31.\n“We have already designed our movement and how we are going to ensure that our new APC Akida makes it to the government house in 2023.\nAdvertisement“We are creating APC Akida and we have the backing and support of the Kano people 100 percent.\nHe said Barau Jibrin, the APC Akida candidate, will contest the state gubernatorial seat, and expressed optimism that the faction will emerge victorious."
  },
  {
    "headline": "‘Buhari supporter’ creates APC faction in Kano",
    "summarized_story": "Abdulmajid Kwamanda, a staunch supporter of President Muhammadu Buhari in Kano, has created a new faction of the All Progressives Congress (APC) in the state.\nSpeaking at a media briefing on Tuesday, Kwamanda said a meeting on the decision to create the faction in the state — referred to as ‘APC Akida’ — commenced on May 31.\n“We have already designed our movement and how we are going to ensure that our new APC Akida makes it to the government house in 2023.\nAdvertisement“We are creating APC Akida and we have the backing and support of the Kano people 100 percent.\nHe said Barau Jibrin, the APC Akida candidate, will contest the state gubernatorial seat, and expressed optimism that the faction will emerge victorious."
  },
  {
    "headline": "ALERT: China records 'first human case' of H10N3 bird flu",
    "summarized_story": "China’s National Health Commission (NHC), on Tuesday, said a 41-year-old man has been confirmed infected with the H10N3 strain of bird flu.\nHe was later said to have been diagnosed as having the H10N3 avian influenza virus on May 28.\nThe commission also noted that no human case of H10N3 has been reported before globally, but said the risk of large-scale spread is low.\nIt added that experts assessed that the full genetic analysis of the virus showed that the H10N3 virus was of avian origin.\nThe risk of large-scale transmission is low,” the NRC said."
  },
  {
    "headline": "Sawari Ventures is leading investments in North Africa",
    "summarized_story": "In today’s edition of Ask an Investor I talk to one of the oldest venture capital firms in the Middle East and North Africa – Sawari Ventures.\nFikry pointed out that Sawari Ventures helped Almentor in three critical areas: Governance, networking with the ecosystem and technical support.\nI talk to Tamer Azer, a principal at Sawari Ventures; he joined the firm in 2019.\nDaniel Adeyemi: Tell me about Sawari VenturesTamer Azer: Sawari ventures has been around since 2010.\nWhen Sawari Ventures raised its North Africa fund, we invested in Flat6Labs Cairo and Flat6Labs Tunis."
  },
  {
    "headline": "For Rising Tide Africa, more African women should build diversified investment portfolios",
    "summarized_story": "Rising Tide Africa wants more women to be bolder at investment tables, to dream bigger and ask for more money to do bigger things.\nIvana Osagie: Founding member, Rising Tide Africa.\nWhat exactly does Rising Tide Africa do?\nThese reasons and more formed the foundation of Rising Tide Africa.\nInvestment opportunity pipeline for startupsApart from investing solely in female-led companies, Rising Tide looks out for all kinds of tech-enabled startups."
  },
  {
    "headline": "How Uche Ogboi became CEO of Lori Systems and her billion-dollar mission for African logistics",
    "summarized_story": "As CEO of Lori Systems, Uche Ogboi will bear some of the weight of African logistics on her shoulders.\nJosh Sandler, Lori’s founding CEO, first met Ogboi in 2017.\nHer due diligence process impressed Sandler who was looking out for someone to bring structure and help scale the logistics startup’s operations.\nLast November, they received an undisclosed investment and signed a partnership agreement with Imperial Logistics, a global logistics company.\nNow she’ll probably sleep even less with the weight of African logistics on her shoulders."
  },
  {
    "headline": "Binance To Offer $30,000+ in Prizes To Hackathon Participants in Africa",
    "summarized_story": "Binance, the world’s leading blockchain ecosystem and cryptocurrency infrastructure provider will hold a DeFi & NFT hackathon for African blockchain enthusiasts from June 7 to June 28, 2021.\nIn line with the company’s commitment to Africa and the growth of the blockchain ecosystem, Binance continues to empower blockchain engineers.\nParticipants will also have the opportunity to win limited edition NFTs and Binance Swags during the Hackathon period.\nRegister for the opening ceremony of the Binance Hackathon HEREWho can participate: All developers, builders, and creators from Africa (hackathon is open to both beginners and non-beginners)How to participate in the hackathon: Join the Telegram group here and sign up through the Hackerlink special landing page where all hackathon projects will be submitted.\nWhat to expect: All DeFi and NFT projects will be built on the Binance Smart Chain and made completely open source."
  },
  {
    "headline": "2021 Oxford Africa Conference Innovation Fair Pitch competition: Winners announced!",
    "summarized_story": "The Oxford Africa Conference Innovation Fair took place on the 28th and 29th of May 2021 with a cohort of 11 highly innovative companies, based across five African countries.\nIn addition, each company received one-on-one mentorship from an industry leader in their field, which was enabled by the support of the TechCabal team.\nThe Fair ended with a highly competitive pitch competition judged by: Dr. Watu Wamae (PhD) – Research Engagement Manager at the Africa Oxford Initiative; Dr. Amy Kao (PhD) – Oxford Sciences Innovation Associate and Dr. Tinashe Chandauka – Oxford Sciences Innovation Associate.\nEmerging from the 11 finalists, the overall cash prize winners were: Maxi Mobility winning 5,000 GBP for first place, Hustlenomics winning 2,500 GBP for second place and Sanaa space winning third prize of 1,000 GBP.\nThe 11 finalist companies in the Oxford Africa Conference Innovation Fair were:EcoboraEcovonHustlenomicsMazi MobilityNatal CaresNuna Premium ResourcesAkoo AudiobooksPledreRecon Health MediaSanaa SpaceThe icreate ProjectFollow the Oxford Africa Conference social media pages or look at our website to learn more about the companies and conference:Or contact:Shaan Pattni, Daniel KandieCo-Managers of the Oxford Africa Conference Innovation Fair"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Nigeria has lost 15.5 million subscribers following the SIM registration ban",
    "summarized_story": "Nigeria is reeling from the effect of the SIM registration ban, as mobile subscribers have dropped drastically in just four months.\nPooling data from the Nigerian Communications Commission (NCC), Intelligence by Techpoint reveals that Nigeria lost 15.5 million subscribers between December 2020 and March 2021.\npic.twitter.com/TdPYGSNAgM — Intelligence by Techpoint (@TechpointIntel) June 1, 2021In 2020, Nigeria had 190 million mobile subscribers, but that number hit 192 million in March 2021.\nPer the NCC, Nigeria lost 9.2 million Internet subscribers between December 2020 and March 2021.\nMTN was the hardest hit, with 3.8 million Internet subscribers lost."
  },
  {
    "headline": "Onyeka Akumah steps down as Farmcrowdy CEO, co-founder, Akindele Phillips takes over",
    "summarized_story": "Nigerian Agritech startup, Farmcrowdy, has announced the exit of its CEO, Onyeka Akumah, who will complete a full transition as chairman of the Farmcrowdy board.\nContinuing the company’s vision would be its co-founder and Chief Risk Officer (CRO), Akindele Phillips.\nAkumah reveals that he will be stepping back from actively running Farmcrowdy to focus fully on his other company, Nigerian mobility startup, Plentywaka.\nFounded in 2016 by Onyeka Akumah (CEO), Akindele Phillips (CRO), Temitope Omotolani, Christopher Abiodun, and Ifeanyi Anazodo, Farmcrowdy started with a premise to finance small scale farmers across Nigeria.\nMeet Akindele PhillipsL-R: Onyeka Akumah, Akindele PhillipsPhillips, who takes the reins of one of Nigeria’s most prominent startups, will be drawing from his experience as a risk officer in some of the world’s most reputable companies."
  },
  {
    "headline": "TalentQL launches ‘Pipeline’ to close Africa’s gap on senior engineering talent",
    "summarized_story": "Today, June 1, 2021, TalentQL is launching Pipeline by TalentQL, a specialised training programme for software engineers in Africa.\nDuring an interview with Techpoint Africa in November 2020, Adewale Yusuf, TalentQL CEO, revealed that Pipeline had been in the works since the company’s inception.\nPipeline is Africa’s first senior engineers’ incubation programme.\nAccording to the IFC-Google report 2020, the continent has nearly 700,000 professional developers, but the ratio of junior developers to senior developers is quite disproportionate.\n[But] most of the senior software engineers didn’t pass our international clients’ tests."
  },
  {
    "headline": "Outsourcing can cut Nigeria’s drug import by 25%",
    "summarized_story": "Contract manufacturing is one of the strategies emerging market peers have adopted to own a significant share of global pharmaceutical production, by servicing the rising need for outsourcing different aspects of production.\nAs of 2017, Nigeria’s drug manufacturing industry only catered to a quarter of the local demand, with the remaining three quarters handled by Asian manufacturers’ exports to Nigeria.\nThis implies as much as 70 percent of marketed drugs by about 130 pharmaceutical firms were imported.\nNIROPHARM sees this as a growth area that the government can pursue strongly to position Nigeria’s manufacturing sector better on the continent.\nBut if you present a product that is in partnership with GSK, the trust will extend to this product and position Nigeria better,” Ehighebolo said."
  },
  {
    "headline": "MTN agent banking rollout in SA test run for Nigeria",
    "summarized_story": "Mobile network operator MTN may not have a Payment Service Bank (PSB) licence in Nigeria just yet, but in South Africa, it can test its ability on a market with a similar model to the most populated country in Africa.\nSince 2018, the South African-based telco has been waiting for the Central Bank of Nigeria…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Half of marginal field bidders cannot pay signature bonuses -",
    "summarized_story": "Only half of the about 161 companies that qualified to bid for marginal fields are able to pay the signature bonus, a development that could derail Nigeria’s plan to raise $500m from the exercise.\nSarki Anwualu, CEO of the Department of Petroleum Regulation (DPR) the government agency that regulates the petroleum industry, said on Monday…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Obaseki flags off COVID -19 second dose vaccination, urges eligible persons to take second jab – Nigerian Observer",
    "summarized_story": "“It is heartwarming today that we continue with our gradual return to our normal lives with the commencement of the second dose coronavirus vaccination.\nI am here today to flag off the second dose vaccination.\nUnfortunately, I can’t take my second dose today because the time scheduled for me is not due.\nHe added, “We have vaccinated 38,500 people in the first phase of the first dose vaccination exercise.\nWe are expecting that 38,500 people will come forward for their second dose."
  },
  {
    "headline": "Legislate On Child Protection, JDPCI Urges Lawmakers – Nigerian Observer",
    "summarized_story": "Speaking on the the theme of the 2021 Child Protection Day, “The Role of Parents and Caregivers in the Protection of Children, the Coordinator of the Edo State Child Protection Network, Barr.\nHe listed the types of Child Abuse to include Physical, Emotional and Sexual Abuses, asserting that abusing a child constituted the worst thing anybody could do to a child.\nWhen you protect children, you are not doing them a favour.\nIt is the duty of everyone to protect children because we are all stakeholders.\n“Not putting a child in school is another form of child abuse."
  },
  {
    "headline": "INSECURITY: Nigeria Customs Summons Private Aircraft Owners For Verification Principles – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – In its efforts to address the insecurity affecting the nation from different angles, the Nigeria Customs Service (NCS) has called on private aircraft owners for verification from June 7- to July 6, 2021 to identify the true owners and properly monitor.\nAddressing newsmen, the National Public Relations Officer, Deputy Comptroller of Customs, DC Joseph Attah, noted the measure is to ensure strict compliance with the NCS regulations and revenue generation through the payment of 1 percent Comprehensive Import Supervision Scheme.\nAttah insisted failure to comply with the verification exercise will certainly lead to the sanction of the defaulters.\nHe attributed the feat to the strict implementation of all extant rules governing imports, exports, and Excise in Nigeria.\nHe attributed it to robust stakeholder sensitization, increasing the level of compliance from stakeholders, and improved working relationships with the National Assembly."
  },
  {
    "headline": "Another Killing In Imo: NIS Chief Provost Murder By Unknown Gunmen – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The wave of killings in Imo State continued Monday as the Chief Provost of Nigerian Immigration Service (NIS), Imo State Command, Okiemute Mrere, has been killed by unknown gunmen.\nAuthoritative source revealed that Mrere, was assassinated on Saturday night on Owerri- Port Harcourt Road in Owerri.\nMrere, was riding a Hilux van belonging to NIS when he was allegedly ambushed, shot and killed by the unknown assailants.\nHe said “The official Hilux van he was riding in as of the time he was attacked was riddled with bullet holes.”According to the source,” the chief provost of Nigerian Immigration service, Imo state Command, Okiemute Mrere, has been assassinated.\nHe was riding in his official Hilux van when he was attacked, shot and killed."
  },
  {
    "headline": "Insecurity: Buhari vows to ‘shock’ those promoting insurrection, burning national assets",
    "summarized_story": "President Muhammadu Buhari has warned that ‘rude shock’ awaits those unpatriotic elements promoting insurrection and burning critical national assets across the country.\nMr Yakubu briefed the president on series of attacks on facilities of the electoral body around the country.\nMr Buhari was quoted as saying: “I receive daily security reports on the attacks, and it is very clear that those behind them want this administration to fail.\nBriefingEarlier in his briefing, Mr Yakubu said that, so far, there had been 42 cases of attacks on INEC offices nationwide, since the last general election.\nAccording to Mr Yakubu, the intention of the anarchists is to incapacitate the commission, undermine the nation’s democracy and precipitate a national crisis."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Buhari promises to give IPOB, ESN shock of their lives, may declare state of emergency",
    "summarized_story": "“I receive daily security reports on the attacks on critical national infrastructure, and it is very clear that those behind them want this administration to fail.\nWhoever wants the destruction of the system will soon have the shock of their lives.\n“I received a briefing today from the Chairman of the Independent National Electoral Commission (INEC), on the series of attacks on their facilities nationwide.\n“Many of those misbehaving today are too young to be aware of the destruction and loss of lives that occurred during the Nigerian Civil War.\nThose of us in the fields for 30 months, who went through the war, will treat them in the language they understand.”"
  },
  {
    "headline": "Anyim mourns Gulak, says death distressing",
    "summarized_story": "Nigeria’s former Senate President, Senator Anyim Pius Anyim, has expressed sadness over the unfortunate assassination of a former adviser to ex-President Goodluck Jonathan, Ahmed Gulak, describing him as a bosom friend and colleague.\nAnyim described Gulak’s killing as “one death too many, ” stating that it was the “darkest Sunday of his life”.\nAhmed Gulak knocked me down into distress, and it took me till this morning of 31st May 2021, to regain my senses from the shock.\nAhmed Gulak was my colleague in President Goodluck’s Administration.\nI pray for God to grant his family the fortitude to bear this irreparable loss and grant his soul eternal repose."
  },
  {
    "headline": "Asaba Declaration: Crossing the threshold of gullibility and division",
    "summarized_story": "It is a landmark that all Southern Governors could meet and take a uniform stand on national matters and have been supported by their National Assembly members, regardless of political party.\nBut a people could be conquered only if they could be kept divided, as Southern Nigeria has perennially been.\nAs long as the President condones the atrocities – expressly or by body language – the Armed Forces and the Police will never move against them, regardless of platitudes.\nThe Nigerian Armed Forces and the Police have more been slaves of the Head of State than defenders of the people, from inception.\nUnder the Aburi Accord, for example, almost everything – from Resource Control to Agriculture, Education, Highways, Power generation and the Armed Forces and the Police – would be regionalized."
  },
  {
    "headline": "Health Minister Lauds 9mobile for Recognizing Frontline Health Workers",
    "summarized_story": "The Honorable Minister of Health, Dr. Osagie Ehanire, has lauded 9mobile for its support in the ongoing fight against COVID-19.\nHe gave the commendation at the Health Workers recognition event, organized by the telco to celebrate health workers at the National Hospital, Abuja, at the weekend.\nSpeaking at the event, the minister, who was represented by the Director of Hospital Services, Federal Ministry of Health, Dr. Adebimpe Adebiyi (mni), stated that the gesture by 9mobile to celebrate frontline health workers by recognizing and rewarding the most outstanding health worker would go a long way to boost the morale of the recipient as well as other health workers.\nAcknowledging the minister’s commendation, Director of Sales, 9mobile, Tosin Olulana, who represented the Acting Chief Executive Director of 9mobile, Juergen Peschel, reiterated the need to support the efforts of frontline health workers who constantly risk their lives to save others.\nFor me, this award and recognition is dedicated to all health workers in the country and particularly the management and staff of National Hospital Abuja for their encouragement and support."
  },
  {
    "headline": "Students Of Kaduna State-owned Varsity Protest Hike In Tuition Fees",
    "summarized_story": "Students of the Kaduna State University (KASU) on Tuesday staged a peaceful protest to the Government House against what they termed abitrary increase in the school tuition fees.\nOne of the students, Comrade Yusuf Shehu, while speaking with journalists, appealed to the governor to reconsider his stance on the tuition fees increment so that the children of the poor can attain education.\n“We are appealing that the increase should be reversed, because with the present increase, most students will be forced to drop out except something is done about it.\n“Even with the former fees, it was very difficult for some students to pay, most of them have to do menial jobs to be able to pay their schools fees, some of us are orphans.\nMeanwhile, while the peaceful protest lasted, there was a traffic gridlock on the road leading to the Government House."
  },
  {
    "headline": "Students Of Kaduna State-owned Varsity Protest Hike In Tuition Fees",
    "summarized_story": "Students of the Kaduna State University (KASU) on Tuesday staged a peaceful protest to the Government House against what they termed abitrary increase in the school tuition fees.\nOne of the students, Comrade Yusuf Shehu, while speaking with journalists, appealed to the governor to reconsider his stance on the tuition fees increment so that the children of the poor can attain education.\n“We are appealing that the increase should be reversed, because with the present increase, most students will be forced to drop out except something is done about it.\n“Even with the former fees, it was very difficult for some students to pay, most of them have to do menial jobs to be able to pay their schools fees, some of us are orphans.\nMeanwhile, while the peaceful protest lasted, there was a traffic gridlock on the road leading to the Government House."
  },
  {
    "headline": "NNPC To Acquire Equity In Private Refineries",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) has revealed that it is currently considering equity participation in a number of private refineries in the country in line with a Federal Government policy directive which stipulates the mandatory participation of the Corporation in any privately-owned refinery that exceeds 50,000 barrels per day capacity in keeping with its statutory role of safeguarding national energy security.\nThese roles enable it to achieve the twin objectives of providing energy security for the country and stimulating the nation’s economic development and growth.\nHe said that NNPC’s strategic objective to ensure energy security and stimulate economic growth with limited resources requires it to consider strategic partnerships with competent investors in sectors of the oil and gas value chain especially where it currently operates on a sole risk basis.\nThe oil refining sector is one of such segments where NNPC is revisiting its strategy in order to strengthen domestic refining capacity and guarantee National Energy Security.\nThe new vision is to grow domestic refining capacity, improve petroleum products supply from our local refineries and become a net exporter of petroleum products."
  },
  {
    "headline": "NNPC To Acquire Equity In Private Refineries",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) has revealed that it is currently considering equity participation in a number of private refineries in the country in line with a Federal Government policy directive which stipulates the mandatory participation of the Corporation in any privately-owned refinery that exceeds 50,000 barrels per day capacity in keeping with its statutory role of safeguarding national energy security.\nThese roles enable it to achieve the twin objectives of providing energy security for the country and stimulating the nation’s economic development and growth.\nHe said that NNPC’s strategic objective to ensure energy security and stimulate economic growth with limited resources requires it to consider strategic partnerships with competent investors in sectors of the oil and gas value chain especially where it currently operates on a sole risk basis.\nThe oil refining sector is one of such segments where NNPC is revisiting its strategy in order to strengthen domestic refining capacity and guarantee National Energy Security.\nThe new vision is to grow domestic refining capacity, improve petroleum products supply from our local refineries and become a net exporter of petroleum products."
  },
  {
    "headline": "1999 Constitution Is Deficient, Says Gbajabiamila",
    "summarized_story": "Femi Gbajabiamila, has said that the 1999 Constitution of the Federal Republic of Nigeria failed to address some critical national questions confronting the country, hence the resolve by the legislature to amend it.\nADVERTISEMENTHe assured Nigerians of the sincerity of purpose of the 9th National Assembly to deliver a reviewed constitution that everyone would be proud of.\n“No nation in the world has a perfect constitution, but we need a near-perfect constitution in Nigeria and we can achieve that through substantive amendments that significantly alter the character of our nation.\n“Our job is to produce a constitution that turns the page on our past, yet heeds its many painful lessons.\nWe are suffering from the tyranny of low expectations and the cynicism that causes us to believe that the political process cannot produce anything worthy or worthwhile."
  },
  {
    "headline": "Bandits give deadline as they demand N110m ransom for Niger State Islamiyya pupils",
    "summarized_story": "The bandits who kidnapped over 200 pupils of the Salihu Tanko Islamiyya School in Tegina town of Rafi Local Government Area of Niger State are demanding the whopping sum of N110 million as ransom to release the victims.\nThe Headmaster also said the bandits disclosed that only 150 pupils are in their custody.\nShe, however, ruled out plans to pay ransom to the criminals.\n“The number of the kidnapped school children is not fully ascertained, however, efforts by security agencies to secure their release has been intensified.\n“We don’t pay ransom to abductors."
  },
  {
    "headline": "Fiscal federalism, LG autonomy, others takes center stage as constitution review hearing kicks off",
    "summarized_story": "By Tom OkpeAs the National Constitution Review hearing organised by the House of Representatives kicks off in the six geo-political zones of the country on Tuesday, Local government autonomy, states and local government creation fiscal federalism and others takes center stage of the debate.\n“We are in support of Federal structure in governance and power devolution, Bauchi is in full support of the existing arrangement comprising federal, state and local government.\nBauchi state recommend that appropriate legal frameworks be put in place to allay the fears of likely abuse of the state police by state governors.\nThe speaker, Bauchi State House of Assemblycommends the national assembly for taking the bull by the horns to alter the constitution.\nStates and Local Governments agitated for are, Katagum from old Bauchi, Savanah from old Borno State, Bura LG from old Ningi in Bauchi State, Fune LG from old Jajere and a new Jajere local government in Yobe State."
  },
  {
    "headline": "Gen. Yahaya unveils his vision for Nigeria Army — Daily Times Nigeria",
    "summarized_story": "The new Chief of Army Staff (COAS), Major General Farouk Yahaya has unveiled his vision for the Nigeria Army, stating that his mission is to have a professional army.\n“The NA under my command will discharge its duties with diligence, commitment and loyalty to the President Commander-in-Chief of the Armed Forces of Nigeria, President Mohammadu Buhari’’ he said.\nGeneral Yahaya took over the leadership of the Nigerian army just as its strength was boasted with an additional 6,400 soldiers who passed out from Zaria depot.\nSpeaking on his behalf during the passing out of 80 regular recruit intake at the Depot Nigeria Army Zaria, General Officer Commanding 1 Division Nigeria Army, Kaduna Major General Danjumma Ali-Keffi, said, “it is noteworthy that as you pass out today, the strength of Nigeria army has been enhanced by 6,400 able-bodied men and women.\nHe assured the public that the Nigerian Army “will not rest on our oars until this country is safe for all of us.” He advised the new soldiers to abide by their oath of allegiance."
  },
  {
    "headline": "Artist King Joel gift self N135,000,000 worth of Ferrari car",
    "summarized_story": "By Mutiat AlliFew weeks after rewarding winners of his Mother’s Day giveaway; talented Nigerian-American rapper, King Joel have gift himself a brand new Ferrari car worth N135,000,000.\nSpeaking on the new gift, King Joel disclosed that it is important in life to make oneself happy and that is why is love for luxury lifestyle prompted him to get such an expensive ride.\nJoel is one artist the Nigerian music space need to pay keen attention to as he is bent on making a difference with his kind of music"
  },
  {
    "headline": "FG looking beyond budgetary allocations to finance infrastructure...",
    "summarized_story": "PHILIP CLEMENT, ABUJAThe minister for Finance, Budget and National Planning, Mrs Zainab Ahmed, says the federal government is looking beyond budgetary allocations to finance critical infrastructure development in the country.\nMrs Ahmed who also doubles as Vice-Chair of the National Council on Privatisation (NCP) said this at the recently held webinar on financing public-private partnership (PPP) to boost infrastructure delivery in Nigeria.\nOne such viable option, according to her, is the adoption of PPP arrangements that could enable Nigeria to access significant resources from both local and international investors for investment in Infrastructure.\nThe circular provides the much-needed clarity on federal government institutional roles for PPP arrangements.\nIn addition, from the 2021/2022 budget cycle, all infrastructure projects must be screened for PPP suitability and compliance with National Integrated Infrastructure Master plan by the Federal Ministry of Finance Budget and National Planning and BPE before inclusion in the national budget and subsequent procurement."
  },
  {
    "headline": "Buhari congratulates elected guild of editors’ leadership",
    "summarized_story": "By TANKO ALIPresident Muhammadu Buhari congratulates Mustapha Isa, the President of the Nigerian Guild of Editors (NGE), who won a second-term of office in the just concluded convention of the Guild in Kano.\nIn expressing good wishes for his new tenure, President Buhari also congratulates those who emerged as members of the Standing Committee, both the re-elected and the ones who won fresh seats.\nThe President commends the rancour-free conduct of the elections and the unanimous acceptance of the outcome, saying this has set a good standard for other unions to copy.\nPresident Buhari calls on the newly-elected executive to join his administration in the efforts to rid the country of fake news and to avoid negativism, advising the media to abstain from content that is against the maintenance of law and order and the sustenance of National security.\nIn calling for partnership between the two, the President says the media and the government working together, ”can, and will build a strong, safe, secure and inclusive Nigeria."
  },
  {
    "headline": "Buhari congratulates elected guild of editors’ leadership",
    "summarized_story": "By TANKO ALIPresident Muhammadu Buhari congratulates Mustapha Isa, the President of the Nigerian Guild of Editors (NGE), who won a second-term of office in the just concluded convention of the Guild in Kano.\nIn expressing good wishes for his new tenure, President Buhari also congratulates those who emerged as members of the Standing Committee, both the re-elected and the ones who won fresh seats.\nThe President commends the rancour-free conduct of the elections and the unanimous acceptance of the outcome, saying this has set a good standard for other unions to copy.\nPresident Buhari calls on the newly-elected executive to join his administration in the efforts to rid the country of fake news and to avoid negativism, advising the media to abstain from content that is against the maintenance of law and order and the sustenance of National security.\nIn calling for partnership between the two, the President says the media and the government working together, ”can, and will build a strong, safe, secure and inclusive Nigeria."
  },
  {
    "headline": "Police re-arrest fleeing Imo inmate in Lagos for stealing in church",
    "summarized_story": "Police re-arrest fleeing Imo inmate in Lagos for stealing in churchPolice re-arrest fleeing Imo inmate in Lagos for stealing in churchOnyemachi Maduabuchi, who escaped from the Owerri Correctional Centre in Imo, has been rearrested in Lagos State.\nThis was contained in a press statement by the spokesperson for the Lagos State Police Command, Olumuyiwa Adejobi, on Tuesday.\nHe said that the said sister later invited him to Lagos on April 19.\nAdejobi said, “The suspect was kept in the sister’s house where she used to lead him to church for special deliverance service.\n“In the process, after the night vigil on April 20, at Bride Assembly Church, Ijesha Area of Lagos State, the suspect allegedly stole the Subscriber Identification Module (SIM) and the memory cards of a member of the church."
  },
  {
    "headline": "Police re-arrest fleeing Imo inmate in Lagos for stealing in church",
    "summarized_story": "Police re-arrest fleeing Imo inmate in Lagos for stealing in churchPolice re-arrest fleeing Imo inmate in Lagos for stealing in churchOnyemachi Maduabuchi, who escaped from the Owerri Correctional Centre in Imo, has been rearrested in Lagos State.\nThis was contained in a press statement by the spokesperson for the Lagos State Police Command, Olumuyiwa Adejobi, on Tuesday.\nHe said that the said sister later invited him to Lagos on April 19.\nAdejobi said, “The suspect was kept in the sister’s house where she used to lead him to church for special deliverance service.\n“In the process, after the night vigil on April 20, at Bride Assembly Church, Ijesha Area of Lagos State, the suspect allegedly stole the Subscriber Identification Module (SIM) and the memory cards of a member of the church."
  },
  {
    "headline": "Buhari: Rude shock awaits insurrectionists",
    "summarized_story": "*Promises to go hard on them sooner than laterPresident Muhammadu Buhari said Tuesday a rude shock awaits those fanning the embers of insurrection and those burning down critical national assets.\nHe gave the warning today after he received briefing from Chairman of Independent National Electoral Commission (INEC), Prof Mahmood Yakubu, on series of attacks on facilities of the electoral body round the country.\n“The intention is to incapacitate the Commission, undermine the nation’s democracy and precipitate a national crisis,” Prof Yakubu said.\nBuhari responded by saying that he receives daily security reports on the attacks.\nWe’ve given them enough time.”President Buhari recalled that he visited all the 36 states of the country before the 2019 election."
  },
  {
    "headline": "Makinde approves recruitment of 500 health workers",
    "summarized_story": "By Taiwo OkanlawonGovernor Seyi Makinde of Oyo State has approved the recruitment of 500 health workers to fill the gap in the health sector across the state.\nMakinde in a statement by his press secretary, Mr. Taiwo Adisa, stated these in Saki, during a Town Hall meeting in commemoration of the second anniversary of the government, held at the Saki Parapo Town Hall, Saki.\nIt is a problem we are trying to solve throughout Oyo State.\n“Last week, I already signed that they should recruit 500 health workers.\nThe event was aired live on three radio stations, with opportunities to call into the Town Hall meeting by listeners at home."
  },
  {
    "headline": "Lai: Security problems will go, Buhari’s legacy intact [Video]",
    "summarized_story": "By Rotimi Ijikanmi/AbujaFederal Government spokesman Lai Mohammed said the security challenges facing the country are ephemeral and will not define the legacy of President Muhammadu Buhari.\nThe Minister of Information and Culture, Alhaji Lai Mohammed said this on Tuesday in Abuja at the presentation of a documentary showcasing the achievements of Buhari’s administration.\n“Let me say that President Buhari’s legacy is assured, and will be defined by his massive achievements in office.\nMohammed said the achievements of the administration which were detailed in the documentary covered roads, rail, housing, power, aviation and agriculture.\nThe minister also listed the Second Niger Bridge, Loko-Oweto Bridge, Zungeru Hydroelectric Dam, Goronyo Dam and airport upgrades in Abuja, Lagos and Enugu."
  },
  {
    "headline": "Ibrahim Babangida’s Son, Family Involved In Auto Crash As Three Soldiers Lose Their Lives",
    "summarized_story": "The troops perished in the accident, according to reports, after their black Prado SUV collided head-on with an articulated vehicle traveling in the opposite way.\nMohammed Babangida was reportedly traveling to Abuja in a Honda Space bus with other members of his family following behind the security vehicle, according to eyewitnesses.\n“Three soldiers died and one was left critically injured as the convoy of Mohammed Babangida, the son of the former military Head of State was involved in the accident.\nHe was travelling to Abuja in a Honda Space bus with other members of his family behind the security vehicle.\n“No member of the Babangida family was hurt in the accident."
  },
  {
    "headline": "Again, Buhari Blames His Political Enemies For His Failures In Tackling Insecurity",
    "summarized_story": "Those who seek to destabilize President Muhammadu Buhari‘s government will be in for a rude awakening, as his administration will do everything in its power to ensure they fail.\nBuhari made the announcement on Tuesday after receiving a briefing from Mahmood Yakubu, the chairman of the Independent National Election Commission, and other electoral commissioners.\nThe sponsors and orchestrators of insecurity in the country, according to the president, are doing it because they want his administration to fail.\nHis government, he claims, will be “harder” on those bent on destroying Nigeria."
  },
  {
    "headline": "Femi Gbajabiamila Speaks On Why The 1999 Constitution Must Be Ammended",
    "summarized_story": "Femi Gbajabiamila, Speaker of the House of Representatives, has announced that Nigeria’s 1999 constitution must be revised since it was rushed into being.\nHe claimed that the constitution is unfit for purpose, describing it as “the product of a hasty national compromise” designed to get the soldiers back to the barracks.\nGbajabiamila, who spoke at a zonal public hearing on the review of the 1999 constitution on Tuesday in Lagos, stated that a better constitution that represents the interests and aspirations of the Nigerian people is required to address the country’s difficulties.\n“Our job is to produce a constitution that turns the page on our past, yet heeds its many painful lessons.\nGbajabiamila added that a constitution review will offer the opportunity to “restructure our government to make it more effective” and will “put an end to the debilitating conflicts that even now continue to tear our nation apart”."
  },
  {
    "headline": "Outrages As Saudi Arabia Asks Mosques To Limit Loudspeaker Volume",
    "summarized_story": "The Saudi Arabian government’s move to limit the volume of loudspeakers in mosques has provoked outrage.\nLast Monday, the country’s Islamic affairs minister, Abdullatif al-Sheikh, ordered that mosque speakers be limited to less than one-third of their maximum volume.\nHe described those who are against the directive as “enemies of the kingdom”, who want to stir public opinion.\n“Those who want to pray do not need to wait for … the imam’s” call to prayer,” al-Sheikh was quoted by Aljazeera.\n“They should be at the mosque beforehand.”This is not the first time Saudi Arabia will make an order to change age-long practices, especially those relating to Islamic doctrines."
  },
  {
    "headline": "Pictures: Ex- aviation Minister, Osika Chidoka, visits, condoles with Ahmed Gulak’s family",
    "summarized_story": "NextWhen a governor identifies with his colleagues: Gov Bala’s example"
  },
  {
    "headline": "How my father died, NECO registrar’s son opens up",
    "summarized_story": "Contrary to media reports that Professor Godswill Obioma, the late registrar of National Examinations Council (NECO) was murdered in his home in Minna, Niger state, the deceased’s son said that his father died as a result of brief illness.\nPrince Godswill Obioma II, son of the late Professor said in a statement on Tuesday morning on behalf of the family that his father died after a brief illness.\n“Dear Sir, this is to formally inform you that my father, Prof. Godswill Obioma, the Registrar/Chief Executive of NECO passed to eternal glory yesterday 31/5/2021 after a brief illness,” he wrote.\nPrince Obioma also notified the management of NECO and the Board as well as the staff members of the passing of his father due to a brief illness.\nThere had been reports suggesting that the late NECO registrar might have been strangled in his room on Monday evening in his apartment in Minna."
  },
  {
    "headline": "Pictures: Unknown gunmen attack Isu police station in Imo",
    "summarized_story": "NextGulak: South-east governors take stand, tell security agents what to do"
  },
  {
    "headline": "Constitution review: Senate begins national public hearing Thursday -NigPilot",
    "summarized_story": "Senate President, Dr. Ahmad Lawan, yesterday announced that a national public hearing to alter the provisions of the 1999 constitution would hold on Thursday through Friday this week.\nHe described the zonal public hearings held last week in the six geo-political zones of the country as “quite successful”.\nHe said: “Let me also congratulate the members of the Constitution Review Committee of the Senate, who had conducted the public hearings across the countries.\n“(And) in fact, the report we received has shown that in all the centres, the public hearings were quite successful.\n“I want to also appeal to Nigerians to take the opportunity of the national public hearing that will take place from Thursday."
  },
  {
    "headline": "Buhari seeks Senate’s confirmation of Yahaya as COAS -NigPilot",
    "summarized_story": "President Muhammadu Buhari has formally requested the Senate to confirm the appointment of Major General Farouk Yahaya as the new Chief of Army Staff, COAS.\nThe request was contained in a letter addressed to the Senate President, Dr. Ahmad Lawan, and read yesterday during the resumption of plenary.\nBuhari in the letter said Yahaya’s appointment was in compliance with the provisions of Section 18 subsection 1 of the Armed Forces Act 2004.\nThis disclosure is contained in a statement issued and signed by the military spokesperson, Brigadier-General Onyema Nwachukwu.\nUntil his new appointment, General Yahaya was the General Officer Commanding 1 Division of the Nigerian Army and the incumbent Theatre Commander of the Counter-terrorism Counter Insurgency military outfit in the North East code-named Operation HADIN KAI."
  },
  {
    "headline": "Ebonyi massacre: Indigenes blame Umahi, call for change in security tactics -NigPilot",
    "summarized_story": "Following the report of recent attacks by suspected Fulani herdsmen on Odoke, Ndiobasi, and Obakotara communities in Izhi, Ebonyi Local Government Area, an Association of Ebonyi State Indigenes in Diaspora (AESID) has blamed governor Dave Umahi, for the continued killings in the state.\n“As we speak, medical and health-care workers in various parts of the State are offering treatments to scores of victims who sustained varying degrees of injuries during the attack.\n“Our anxiety over this sadly depressing attacks is made worse by the fact that the State’s Chief Security Officer, Engr.\nDavid Umahi on whose shoulders hugely lie the constitutional burden of protection of lives and properties of our beloved citizens has largely down-played all sensible and reasonable warnings about the activities of killer herdsmen.\n“This group consequently condemn the claim that the attack took place in Benue State and the attempt by the State government to further downplay or trivialize not only the latest attack on Izhi communities but the entire security affairs in our dear State."
  },
  {
    "headline": "Gulak: Senate President cautions against revenge -NigPilot",
    "summarized_story": "Following the gruesome murder of a former Speaker of the Adamawa State House of Assembly and chieftain of the All Progressives Congress, APC, Hon.\nAhmed Gulak by unknown gunmen on Sunday in Oweri, Imo State, the Senate President, Dr. Ahmad Lawan has appealed for restraint on the part of those calling for revenge.\nThe Senate President, while condemning the killing, maintained that there can be no justification for the brutal murder of a human being and fellow citizen.\nThe Imo State Police Command, however, announced on Sunday night that the it has neutralised the killers of the foremost politician and lawyer as well as recovered ammunition and vehicles from them.\nThe group, however, withdrew the threat yesterday following the elimination of the suspected killers of the late politician by the state Police Command."
  },
  {
    "headline": "Those Plotting Nigeria’s Destruction Will Have Shock Of Their Lives – Buhari",
    "summarized_story": "President Muhammadu Buhari on Tuesday issued a stern warning to those plotting to destroy Nigeria, saying they will soon receive the shock of their lives.\nSpeaking after he received a briefing from Chairman of Independent National Electoral Commission (INEC), Prof Mahmood Yakubu, on series of attacks on facilities of the electoral body around the country, President Buhari said the Federal Government has given the perpetrators enough time.\nWhoever wants the destruction of the system will soon have the shock of their lives.\n“From the pattern and frequency of the most recent attacks, they appear to be targeted at future elections.\nThe intention is to incapacitate the Commission, undermine the nation’s democracy and precipitate a national crisis.”"
  },
  {
    "headline": "Gbajabiamila Faults 1999 Constitution, Calls For Amendment",
    "summarized_story": "The Speaker of the House of Representatives, Femi Gbajabiamila, has faulted the 1999 Constitution, calling for an amendment by the National Assembly.\nSpeaking on Tuesday in Lagos during the public hearing on the review of the Nigerian Constitution, Gbajabiamila said the National Assembly could only achieve the task after getting the inputs and support of the citizens.\nWhile noting that the document failed to address some critical national questions confronting the country, Gbajabiamila said there was an urgent need for the legislature to amend it.\n“Our constitution falls short of this standard,” the Speaker was quoted as saying via a statement issued by his spokesman, Lanre Lasisi.\n“Our job is to produce a constitution that turns the page on our past, yet heeds its many painful lessons."
  },
  {
    "headline": "Attacks: Gunmen Are Not Unknown, They Are Our Young Men, Women – Umahi",
    "summarized_story": "Ebonyi State Governor, David Umahi, believes those responsible for the rising security challenges in the South East are not foreigners.\nHe stated that they were indigenes of the region, especially the young people who should protect the interest of the South East as future leaders.\nHe stressed that the people of the South East were not known for criminal actions and such were beyond the Igbo culture.\nGovernor Umahi lamented that he had done everything necessary to enlighten the youths and discourage them from engaging in criminal activities.\n“People are being brainwashed – they don’t even know what they are agitating for,” he stated as the first factor."
  },
  {
    "headline": "One Word From Buhari To Killer Herders Will Go A Long Way – Benue Dep Gov",
    "summarized_story": "Benue Deputy Governor, Benson Abounu has said one word from President Muhammadu to killer herders will go a long way in ending incessant killings.\nAccording to him, some drastic steps need to be taken to put an end to killings by some herders, and Fulani leaders need to speak up against the attacks by herders on communities.\n﻿The deputy governor added that he has made this suggestion at many meetings including the Nigerian Governors Forum (NGF) meeting, northern governors’ forum, and National Economic Council (NEC) meeting.\nThe deputy governor said Nigeria’s security situation has gotten worse and he needs to address the country, rather than issue press statements through media aides.\nI think we have reached the stage when the President needs to come out and address this country,” the Benue Deputy governor said."
  },
  {
    "headline": "Aruna’s Tokyo Olympics Qualification Confirmed By ITTF",
    "summarized_story": "The International Table Tennis Federation (ITTF) have confirmed the qualification status of Nigeria’s top player, Quadri Aruna for the rescheduled Tokyo 2020 Olympic Games in Japan.\n“It is with great pleasure, I advise the qualification of Quadri Aruna to compete in the table tennis Men’s Singles event at the Tokyo 2020 Olympic Games, on the basis of World Ranking allocation according to the June 2021 ITTF Olympic Qualification Ranking,” Felegyi stated.\nThe NOC is expected to confirm Aruna’s participation on or before June 16.\n“When Aruna got injured during the African Qualifying tournament in Tunis last year, I told the world that he will make it to Tokyo as he is ranked among the top 10 in the Olympic ranking.\nAlready 64 players have been confirmed for the men’s singles event while the remaining six slots will be allocated as wildcards."
  },
  {
    "headline": "Police arrest escaped Imo Correctional facility inmate over SIM card theft in Lagos",
    "summarized_story": "Operatives of the Lagos State Police Command have arrested an inmate who escaped from the Owerri Correctional facility during the jailbreak in April over alleged theft of Subscriber Identification Module (SIM) card.\nThe suspect, Oyemachi Maduabuchi, 34, was alleged to have stolen the SIM and a memory card belonging to a member of a church his elder sister took him to for deliverance on April 20, a day after he arrived Lagos.\nAs soon as he left the prison facility, he was said to have gone to his hometown, Onitsha in Anambra State to see his mother, who then linked him up with his elder sister, Amarachi, a resident of Customs Bus Stop, Ijegun, Lagos.\nAdvertisement“The suspect has confessed to the crime while the Commissioner of Police, Lagos State, CP Hakeem Odumosu, has directed that the suspect should be handed over to the Nigerian Correctional Service for further investigation and necessary action.\n“The Commissioner of Police therefore assured the general public that the command will not relent on its efforts in making the state safe and peaceful for all and sundry to live in as all hands are on deck to effectively police Lagos State,” said Adejobi."
  },
  {
    "headline": "Real Madrid Re-appoint Carlo Ancelotti as Coach",
    "summarized_story": "Real Madrid have announced the shock return of Carlo Ancelotti as manager after he confirmed his departure from Premier League side Everton on Tuesday.\nAncelotti, 61, has agreed a three-year contract with Madrid, and will be presented in a news conference on Wednesday, the club said in a statement.\nZidane led Madrid to a second-placed La Liga finish and the Champions League semifinals last season before quitting, alleging a lack of support from president Florentino Perez.\nThe Italian won the Champions League, Copa del Rey, UEFA Super Cup and FIFA Club World Cup in two years at the club.\nAdvertisementHe also became the first manager to win the competition three times in the Champions League era."
  },
  {
    "headline": "Nigeria Senate Should be Scrapped to Reduce Cost of Governance, Ondo Governor Akeredolu Says",
    "summarized_story": "Rotimi Akeredolu, Governor of Nigeria’s southwestern Ondo state is calling for a unicameral legislature for the country and the immediate scrapping of the senate.\nAccording to Mr Akeredolu the lawmakers should only be engaged in legislative duties on a part time basis to reduce the cost of governance.\nThe Governor stated this in Akure, the Ondo state capital on Tuesday during the South-West Zonal Public Hearing on the constitution review.\n“The country may consider dropping the current bicameral structure of the National Assembly and adopt a unicameral legislature.\nA maximum of four representatives should come from each zone.”According the Governor, “the position of the Ondo State Government has been made public."
  },
  {
    "headline": "Nigeria’s President Buhari Says No Interest in Seeking Illegal Third Term",
    "summarized_story": "President Muhammadu Buhari has said he has no intention of seeking for a third term as Nigeria’s leader.\nMr Buhari said this on Tuesday shortly after he received a briefing from the Chairman of the country’s Independent National Electoral Commission (INEC), on the series of attacks on their facilities nationwide.\n“I received a briefing today from the Chairman of the Independent National Electoral Commission (INEC), on the series of attacks on their facilities nationwide.\nThese attacks are totally unacceptable, and we will not allow those behind them to achieve their evil objectives,” the President said on his official Twitter handle.\n“Many of those misbehaving today are too young to be aware of the destruction and loss of lives that occurred during the Nigerian Civil War."
  },
  {
    "headline": "Nigeria: Arsonists Will Soon Receive ‘Shock of Their Lives,’ Buhari Warns",
    "summarized_story": "Nigerian President Muhammadu Buhari says the rising insecurity in the country is now mentioned all over the world stating that sponsors and orchestrators of violence wants his administration to fail.\nThe Nigerian leader also warned that his administration will go hard on persons behind attacks on facilities of the country’s national electoral commission as they will soon have the shocks of their lives.\nIn recent months, the West African country has witnessed series of attacks on INEC facilities in the southern region.\n“I receive daily security reports on the attacks, and it is very clear that those behind them want this administration to fail,” Mr Buhari said.\nWhoever wants the destruction of the system will soon have the shock of their lives."
  },
  {
    "headline": "Saka, Four Right-backs Included in England’s Euro Squad",
    "summarized_story": "Trent Alexander-Arnold, Reece James, Kieran Trippier and Kyle Walker have all been included in Gareth Southgate’s 26-man England squad for the upcoming European Championships.\nAn underlying problem saw Greenwood ruled out of the Euros earlier on Tuesday, while despite injury concerns for Jordan Henderson, Harry Maguire and Kalvin Phillips, the trio have all made the final squad.\nDefenders: Trent Alexander-Arnold (Liverpool), Ben Chilwell (Chelsea), Conor Coady (Wolves), Reece James (Chelsea), Harry Maguire (Manchester United), Tyrone Mings (Aston Villa), Luke Shaw (Manchester United), John Stones (Manchester City), Kieran Trippier (Atletico Madrid), Kyle Walker (Manchester City).\nMidfielders: Jude Bellingham (Borussia Dortmund), Jordan Henderson (Liverpool), Mason Mount (Chelsea), Kalvin Phillips (Leeds), Declan Rice (West Ham).\nForwards: Dominic Calvert-Lewin (Everton), Phil Foden (Man City), Jack Grealish (Aston Villa), Harry Kane (Tottenham), Marcus Rashford (Manchester United), Bukayo Saka (Arsenal), Jadon Sancho (Borussia Dortmund), Raheem Sterling (Man City)."
  },
  {
    "headline": "Everton Moves for ex-Wolves Manager Nuno Espirito Santo as Ancelotti Closes in on Real Madrid Job",
    "summarized_story": "Everton are lining up Nuno Espirito Santo as their new manager with Carlo Ancelotti on the verge of taking the Real Madrid job.\nThe Italian has three years left to run on his Everton contract but the Premier League club are willing to let him go to Real.\nAn announcement is now imminent, with Toffees owner Farhad Moshiri already making moves to bring in a replacement.\nAccording to talkSPORT Everton are set to try and tempt Nuno into making a swift return to management.\nEverton ended the season in dismal fashion despite being one of the Premier League’s early title contenders last season."
  }
]