[
  {
    "headline": "Prioritise health security, experts urge govt",
    "summarized_story": "Oluwatobiloba JaiyeolaPublic health experts have urged governments at all levels in Nigeria to prioritise health security, noting that it is essential to achieving human security.\nThe experts spoke on Thursday at a virtual Policy Dialogue on Health security, organised by the Nigerian Health Watch.\nHawkins said health security is all about surveillance, noting that it is good that health surveillance in Nigeria is strong.\nHe, however, stated that Nigeria’s health surveillance has started to drop as the COVID-19 pandemic progressed.\nEvery state should take responsibility for their contributory funding for their health security, and all this starts from annual planning,” he said."
  },
  {
    "headline": "Prioritise health security, experts urge govt",
    "summarized_story": "Oluwatobiloba JaiyeolaPublic health experts have urged governments at all levels in Nigeria to prioritise health security, noting that it is essential to achieving human security.\nThe experts spoke on Thursday at a virtual Policy Dialogue on Health security, organised by the Nigerian Health Watch.\nHawkins said health security is all about surveillance, noting that it is good that health surveillance in Nigeria is strong.\nHe, however, stated that Nigeria’s health surveillance has started to drop as the COVID-19 pandemic progressed.\nEvery state should take responsibility for their contributory funding for their health security, and all this starts from annual planning,” he said."
  },
  {
    "headline": "80 babies delivered in Benue IDP camps in seven months —Agency",
    "summarized_story": "The Benue Emergency Management Agency says 80 babies were delivered in Internally Displaced Persons camps in the state in seven months.\nThe Executive Secretary of SEMA, Dr. Emmanuel Shior, made this known on Friday in Makurdi during the agency’s monthly distribution of relief materials to the IDPs.\n“The agency is very strict on illicit sexual affairs in the camps.\n“It is very difficult to control the tide of births in the camps, the IDPs are human beings.\nHe said the relief materials would be distributed to IDPs in Makurdi, Guma, Logo, Agatu, Gwer West, Kwande, and Okpokwu camps, among others."
  },
  {
    "headline": "80 babies delivered in Benue IDP camps in seven months —Agency",
    "summarized_story": "The Benue Emergency Management Agency says 80 babies were delivered in Internally Displaced Persons camps in the state in seven months.\nThe Executive Secretary of SEMA, Dr. Emmanuel Shior, made this known on Friday in Makurdi during the agency’s monthly distribution of relief materials to the IDPs.\n“The agency is very strict on illicit sexual affairs in the camps.\n“It is very difficult to control the tide of births in the camps, the IDPs are human beings.\nHe said the relief materials would be distributed to IDPs in Makurdi, Guma, Logo, Agatu, Gwer West, Kwande, and Okpokwu camps, among others."
  },
  {
    "headline": "Ikeja Electric shuts down customers vending, billing channels for upgrade",
    "summarized_story": "By Lawani MikairuIkeja Electric has shut its customers billing and vending channels and infrastructures for 48 hours, between 15th to 17th July 2022 , to enable it carry out an upgrade.\nA statement by the management yesterday said customers of the Disco should buy energy ahead the shut down as they might not be able to access necessary information , vending and data.\nHowever, our Engineers will endeavour to complete the upgrade within the scheduled time,as well as minimise the impact on customer experience.”“During the upgrade, the following functions will be impacted: a : collection of meter data will be unavailable- meter reading, energy vending, etc.\nB: All payment channels will be unavailable.\nRecall some of the Disco’s customers have recently complained that they don’t have ease access to their accounts online."
  },
  {
    "headline": "United Nations officials rescue 21 Nigerians, other Africans in Niger Republic desert",
    "summarized_story": "By Biodun BusariInternational Organisation for Migration (IOM) and Niger’s civil protection agency have rescued 21 Nigerians among other 44 Africans stranded in the desert of the neighbouring Niger Republic.\nThe combined officials said they made the rescue operation on July 6 rescued according to a report by InfoMigrants on Friday.\nRescue operations for migrants are frequent in the hostile Sahara Desert, especially in Libya.\nMany West African migrants try to cross through Libya to reach the Mediterranean coast and thus reach Europe.\nDespite this measure, a security source that migrants are taking “new and more dangerous routes” to gain access to Libya."
  },
  {
    "headline": "2023: North East elders endorse Peter Obi of Labour Party",
    "summarized_story": "*Denounce APC’s Muslim Muslim ticketBy Joseph Erunke, ABUJAAHEAD of the 2023 presidential election,some North East elders have endorsed the candidacy of Mr Peter Obi of the Labour Party, describing his choice as the best for modern Nigeria.\nThe elders denounced the All Progressives Congress (APC)’s Muslim Muslim presidential ticket, saying the action of the party would not enjoy their blessings as açcording to them,it did not promote equity and fairness in a diverse Nigeria.\nThe statement read in part:”As the 2023 general elections draws near,we the Coalition of North East Elders for Peace and Development have noted with concerns some actions and statements by some political parties and actors in our democratic process.\n“The peace in Nigeria is too fragile to contemplate this kind of madness as exhibited by the ruling APC.\n“We call on all Nigeria’s to resist this evil and selfish agenda of Muslim Muslim ticket with every legal means."
  },
  {
    "headline": "How gunmen kidnapped passengers in Calabar",
    "summarized_story": "…passengers cry for help….many have been rescued – PPRO…two persons still missing – SourceBy Ike UchechukwuUnidentified gunmen have robbed and kidnapped passengers going from Calabar to Oron not long ago.\nIn a 30 seconds video seen by Vanguard a female passenger raised the alarm while calling on security agencies to come to their rescue.\n“Please if you guys are seeing this video on my status , we need help , just raise an alarm , I am going for a wedding in Akwa Ibom when we were robbed , the gunmen came and took all the men( male passengers ) including the boat driver.\nAccording to her there was swift reaction from both the Nigeria Navy, Marine Police who gave the Pirates a hot chase forcing them to leave there victims.\nAn impeccable intelligence source also told Vanguard that the affected boat and passengers have been rescued as the kidnappers took off when they sighted the navy gunboats."
  },
  {
    "headline": "2023: Ugwuanyi is our leader, PDP our party, say Uzo-Uwani people",
    "summarized_story": "The people reaffirmed their commitment and faith in the Peoples Democratic Party (PDP), and assured the governor that the PDP remains their party come 2023 general elections.\nSpeaking, the Chairman of Uzo-Uwani LGA, Hon.\nWe want to assure you that all the candidates of the PDP will be delivered 100 percent in Uzo-Uwani LGA”.\nUgwuanyi’s love for Uzo-Uwani LGA, Hon.\nIfeanyi Ossai and other candidates of the party will be elected overwhelmingly in the council area, in 2023."
  },
  {
    "headline": "Osun decides: Shehu Sani, Adeyanju alleges massive vote-buying",
    "summarized_story": "Two prominent Nigerian socio-political activists have alleged vote-buying in the ongoing governorship election in Osun State.\nShehu Sani, former Kaduna Central Senator, alleged that some residents of Osun State are reportedly demanding money before voting.\nIn a tweet, Sani wrote: “The Osun residents reportedly demanded money before voting.\nMoney is the temptation that will stand in between the electorates and their dream of a good leadership and a better country.”Similarly, Deji Adeyanju also alleged vote-buying in most polling units in the State.\n“Massive vote buying ongoing in most PUs in Osun."
  },
  {
    "headline": "God will judge between Nigerian Christians, Tinubu – Ex-SGF, Lawal",
    "summarized_story": "The elder statesman insisted that Tinubu has proved to be daring and uncaring for the Nigerian Christians in the general election and thereafter.\nThe God of justice and equity through the Nigerian voters will decide the victor between the Nigerian Christians, Alhaji Tinubu and his party, the APC.\n“Come on Alhaji Tinubu!\nLawal, who is one of the closest allies of the APC presidential candidate and former Lagos State governor, Bola Ahmed Tinubu has consistently warned the APC and Tinubu against any attempt to adopt Muslim-Muslim ticket for the coming election.\nTo demonstrate his vehement opposition, he wrote four personal letters to Tinubu counselling him on the consequences of going for Muslim-Muslim ticket at the expense of the Nigerian Christians in the Northern region."
  },
  {
    "headline": "Top NDDC official kidnapped by gunmen in Imo",
    "summarized_story": "A senior official of the Niger Delta Development Commission (NDDC) Engr Kingsley Okorafor has been kidnapped close to his residence in Umuadara Umulogho autonomous community in Imo State.\nThe traditional ruler of the community, Eze Patrick Uwalaka has already confirmed the latest development.\nA source close to the family told DAILY POST that the NDDC official attended a vigil of late Eze Innocent Anyawu, the Traditional Ruler of Ndihu autonomous community in Obowo LGA, whose burial is slated for today, Saturday July 16.\nHe said the victim was trailed after he left the vigil to his community, while his car was left behind.\nThe suspected kidnappers have not yet reached the family members for any ransom as of the time of filling this report."
  },
  {
    "headline": "Osun Decides: Anxiety as electorates storm polling units",
    "summarized_story": "Election Day in Osun has started with relative peace, as voters have been observed conducting themselves in an orderly manner as they wait to cast their votes in the Osun gubernatorial election.\nDAILY POST recalls that on Friday, July 16, 2022, there was slight apprehension when the Osogbo NURTW chairman, Kazeem Oyewale, aka Asiri Eniba, was arrested by a detachment of the Nigerian Army at his Ojurin, Old Garage office.\nOyewale was later paraded in the evening by the Osun State Police Command, alongside some of his boys who were also arrested.\nAt Ward 4, Polling Units 17, 18, 19, 20, as of the time of filing this report, accreditation of voters had started.\nVoters, who spoke with DAILY POST, expressed optimism that the exercise would be peaceful without any case of violence."
  },
  {
    "headline": "2023: Methodist Prelate, Kanu-Uche reveals presidential candidate he will support",
    "summarized_story": "The Prelate of the Methodist Church Nigeria, Samuel Kanu-Uche has identified the presidential candidate he will support in 2023.\nKanu-Uche said he would only support a presidential candidate who doesn’t engage in vote-buying.\nKanu-Uche, who did not name any presidential candidate, cautioned Nigerians against selling their votes.\n“I know that most of the candidates have nothing to offer, but any presidential candidate that shares money will not receive my vote.\n“Only those who have no money to share but offer themselves for service will get my vote,” he said."
  },
  {
    "headline": "EFCC storms Gov Oyetola, Adeleke hometowns The Nation Newspaper",
    "summarized_story": "Operatives of the Economic and Financial Crimes Commission (EFCC) have stormed Iragbiji, hometown of Governor Gboyega Oyetola and Ede, hometown of Senator Ademola Adeleke during the Saturday poll.\nIn Iragbiji, headquarters of Boripe Local Government Area, our correspondent observed that six officials wore jacket of the anti-graft agency arrived Ward 1, Unit 1, St Peter’s Anglican School, Iragbiji, where the Governor voted.\nThe operatives also stormed the polling unit of the governorship candidate of the Peoples Democratic Party at PU9, Ward 2, Abogunde/Sagbe in Ede North Local government area of State of Osun.\nIt was gathered the move was to discourage vote buying during the exercise."
  },
  {
    "headline": "Chukwudi emerges President of Amputee Football Federation The Nation Newspaper",
    "summarized_story": "Mr. Maduakor Chukwudi has emerged unopposed winner of the presidential election of the Amputee Football Federation in Abuja.\nThe News Agency of Nigeria (NAN) reports that in the election held at the Moshood Abiola National Stadium Abuja, Chukwudi had 10 votes.\nNAN reports that Bungon Dauda was elected unopposed as the Vice President from North West with 10 votes.\nReponding after his win, Chukwudi said the board would continue to sponsor and support the various activities of the federation.\n“We need sponsors to develop our sport in Nigeria and as the president, this is my call to duty."
  },
  {
    "headline": "Our trees are paying dearly for high cost of cooking gas, kerosene – Don The Nation Newspaper",
    "summarized_story": "Our trees are paying dearly for high cost of cooking gas, kerosene – DonA don, Prof. Christian Madu, says that the nation’s vegetation and trees are paying dearly for the high cost of kerosene and cooking gas as millions of people struggle to survive.\nHe said: “The high cost of kerosene and in particular cooking gas affects production cost.\nMany people that bought into the campaign to use cooking gas invested in cylinders and stoves.\n“We can get them back but we need to rebuild their confidence and assure them of stable cooking gas (and kerosene) prices,” Madu added.\nNAN reports that a litre of kerosene sells between N750 and N800 in fuel stations; while a kilogramme of cooking gas sells between N850 and N900 in cooking gas stations in most parts of the country."
  },
  {
    "headline": "COAS tasks promoted officers to be more professional The Nation Newspaper",
    "summarized_story": "The Chief of Army Staff (COAS), Lt.-Gen. Faruk Yahaya on Friday charged the newly promoted officers of the Nigerian Army to continue to be more professional in the course of discharging their duties.\nHe urged them to remain apolitical and continue to discharge their duties professionally in the defence of the country and its constitution.\nHe further commended the officers and soldiers for their gallantry and urged them to keep up the good works, ensure synergy with other services security agencies and all stakeholders.\nOne of the decorated officers was Anyawu Kennedy, the Acting Assistant Director, Army Public Relations, Yobe State.\nKennedy, who was promoted from the rank of Lieutenant to Captain, had expressed happiness and pledged to justify the promotion by protecting the territory and integrity of the country."
  },
  {
    "headline": "BREAKING: Gunmen abduct NDDC official in Imo The Nation Newspaper",
    "summarized_story": "Gunmen have kidnapped a top official of the Niger Delta Development Commission (NDDC) Engr Kingsley Okorafor close to his residence in Umuadara Umulogho Autonomous Community, Obowo Local Government Area of Imo.\nThe incident, which occured in the early hours of Saturday,caused serious panic in the community.\nThe community is about yhree kilometres away from a military checkpoint in the area.\nTraditional Ruler of the community Eze Patrick Uwalaka confirmed the incident.\nThe source further disclosed the NDDC staff was trailed after he left the vigil to his community where he was abducted, while his car was left behind."
  },
  {
    "headline": "Osun Decides: INEC has improved – Sen Adeleke",
    "summarized_story": "From Oluseye Ojo, EdeThe governorship candidate of the Peoples Democratic Party (PDP) in the ongoing gubernatorial poll in Osun State, Senator Ademola Adeleke, has commended the Independent National Electoral Commission (INEC) for doing a good job.\nAn interview with journalists after he cast his vote at Sagba/Bogunbe Ward 2, Unit 9 of Ede North Local Government Area.\nWe are watching and I hope it is going to be like that.\nSo, let Osun people decide who they want.”He stated further that a meeting was held prior to today on the success of this election.\nHe explained that the INEC and Security agencies “promised that this election is not going to be like Ekiti, that it will be transparent, free, credible and fair.”"
  },
  {
    "headline": "Osun Decides: Massive turnout in Ede",
    "summarized_story": "In more than 12 polling units that have been visited so far by this reporter in Ede South with 10 wards and Ede North with 11 wards, voters were seen casting their votes for the candidates of their choice.\nThe election processes and procedures adopted by the Independent National Electoral Commission (INEC) include voting by continuous accreditation and voting system.\nThe accreditation process in all the polling units comprised authentication and verification of voters with the use of the Bimodal Accreditation Voter Accreditation System (BVAS), checking of register of voters, inking of the cuticle of the thumb.\nAccreditation and voting exercise commenced at 8:30am in all the polling units visited by this reporter.\nThe voting exercise is expected to stop at 2:30pm, but every voter already in the queue shall be allowed to vote."
  },
  {
    "headline": "Osun 2022: Centenarian cast vote in Iragbiji",
    "summarized_story": "An over 100 year-old man, Mr Mustafa Olatunji, was spotted on Saturday voting at Unit 2, Ward 1, LA Primary School Popo, Iragbiji in Boripe Local Government area of Osun, at the ongoing governorship election.\nThe News Agency of Nigeria (NAN) that Olatunji, a Centenarian, was visibly the oldest person on the queue at the polling unit when accreditation and voting began at about 8.30 a.m.Olatunji told NAN that he had been voting since the day of the late Chief Obafemi Awolowo, saying, “voting is my civic responsibility”.\nAccording to him, I am over 100 years and I have been voting since the day’s Awolowo.\n“I am happy with the election process and always motivated to see people coming out to vote during election.\n“Election is the only process by which people can choose the leaders they want,” he said."
  },
  {
    "headline": "Osun Decides: PDP candidate, Adeleke votes at 8:50 am",
    "summarized_story": "From Oluseye Ojo, EdeThe governorship candidate of the Peoples Democratic Party (PDP) in the ongoing gubernatorial poll in Osun State, Senator Ademola Adeleke, has exercised his franchise.\nHe voted at Unit Nine, Ward Two, Sagba/Abogunde in Ede North Local Government Area as early as 8:50am.\nWithin two minutes, he completed the exercise and returned to his Adeagbo family house at Adeagbo area of Ede.\nIn a short interview with journalists, he described the exercise as very impressive so far.\nHe was optimistic of winning the poll."
  },
  {
    "headline": "Gunmen abduct Catholic priests in Kaduna",
    "summarized_story": "Some suspected gunmen have abducted two Catholic priests in the Lere LGA of Kaduna state.\nThe Catholic Priests who were identified as John Cheitnum and Donatus Cleopas were abducted on Friday at Gure parish, Lere LGA.\nThe abduction was confirmed in a statement issued on Friday night by Emmanuel Okolo, chancellor of the Kafanchan Catholic diocese.\nAccording to the statement, the priests were kidnapped shortly after they arrived the parısh rectory of Christ the King Catholic Church in Yadin Garu, Lere LGA.\n“May Jesus crucified on the Cross, listen to our prayers and hasten the unconditional release of His Priests and all other kidnapped persons.”The development comes days after Emmanuel Silas, a Catholic priest, was abducted in Kauru LGA of Kaduna state."
  },
  {
    "headline": "Live Updates: Osun Governorship Election 2022 – THISDAYLIVE",
    "summarized_story": "Miss Asogwa Ngozika, the Presiding Officer of the polling unit, said they arrived at the polling unit at 6:30 am.\nBut Olatunji said there was a mixed up in the materials brought to the polling unit as a sticker of another polling unit close to the primary school was pasted on the materials.\n“Your colleagues did it successfully in Ekiti and l believe you will also do us proud here in Osun State.\nFor most of yesterday, tension remained very high across Osun State, with voters bitterly divided among the two leading candidates.\n“The people of Osun State and Nigerians will understandably hold us to our promise on election day."
  },
  {
    "headline": "Accord Candidate Commends INEC for Peaceful Election – THISDAYLIVE",
    "summarized_story": "Yinka Kolawole in OsogboThe governorship candidate of Accord Party, Dr Akin Ogunbiyi, has commend INEC for the peaceful conduct of the election so far.\nOgunbiyi spoke to reporters after he voted alongside his wife at Ile-Ogbo ward 5, unit 3 at Methodist primary school.\nAccording to him, at AUD polling unit, about 37 have voted against over 500 registered voters.\nHe enjoined INEC to ensure that all eligible voters voted.\nThe monarch, however, said the exercise had been peaceful and his community in Iwo remain the the most peaceful in Nigeria."
  },
  {
    "headline": "Voters Commend INEC – THISDAYLIVE",
    "summarized_story": "Some electorate in some polling units in Osun State have commended the Independent National Electoral Commission for ensuring that accreditation and voting commenced early.\nChecks by our correspondent revealed that INEC officials arrived polling units few minutes before 8am, while accreditation started immediately.\nThere is peaceful atmosphere in most parts of the state visited by our correspondent as voters filed out early to the polling units to exercise their franchise.\nSpeaking, one of the voters at Ward 6, unit 7, St David Primary School, Ode-Omu, Ayedaade Local Government, Comrade Akinyemi Olatunji commended INEC for ensuring early commencement, adding that voters also came out on time.\nBut Olatunji said there was a mixed up in the materials brought to the polling unit as a sticker of another polling unit close to the primary school was pasted on the materials."
  },
  {
    "headline": "EFCC in Iragbiji, Oyetola’s Hometown – THISDAYLIVE",
    "summarized_story": "Yinka Kolawole in OsogboSome officials of the Economic and Financial Crimes Commission have arrived Iragbiji, the hometown of Governor Gboyega Oyetola, candidate of the All Progressives Congress in Osun State.\nNo fewer than six officials of the anti-graft agency were sighted at Ward 1, Unit 1, St Peter’s Anglican School, Iragbiji, where the governor is expected to vote this morning.\nThe officials wore their jackets branded with EFCC inscriptions and drove their official vehicles to the area.\nThe presence of the anti-graft operatives, it was gathered, was to discourage vote-buying."
  },
  {
    "headline": "Tu Baba, Reminisce Others to perform at Destalker Laughter Crusade – THISDAYLIVE",
    "summarized_story": "Funmi OgundareAhead of the Destalker Laughter Crusade,Tu baba, Reminisce and other surprise artiste are set to perform at the event.\nHe also spoke about his upcoming event Destalker Laughter Crusade.\nIn his interview, he said “My show coming up on the 7th of August, 2022 will be one of the biggest comedy event to happen this year.\nDestalker Laughter crusade as the name implies is more than a comedy show but a crusade experience.\nWe will be having two shows, one on the red carpet and the other in the main Eko Hotel Hall."
  },
  {
    "headline": "LIVE UPDATE: Osun State Governorship Election",
    "summarized_story": "LIVE UPDATE: Osun State Governorship ElectionDear readers, you're welcome to our coverage of the 2022 Osun State governorship election."
  },
  {
    "headline": "LIVE UPDATE: Osun State Governorship Election",
    "summarized_story": "LIVE UPDATE: Osun State Governorship ElectionDear readers, you're welcome to our coverage of the 2022 Osun State governorship election."
  },
  {
    "headline": "We Will Buy Guns For Our People If We Record Further Terrorists’ Attacks – Ondo Governor, Akeredolu",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State has declared that he would buy guns for the people of the state to defend themselves if terrorists ever attack the state again.\nA report by Daily Independent quoted Governor Akeredolu as saying that “Protecting the life and property of our people is our priority here.\n“Any other incident here, we will ask our people to get guns to protect themselves.\n“If we are pushed to the wall, we will also encourage our people to get guns.\nI am begging you, nobody, state, the country can continue to witness this kind of insecurity."
  },
  {
    "headline": "We Will Buy Guns For Our People If We Record Further Terrorists’ Attacks – Ondo Governor, Akeredolu",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State has declared that he would buy guns for the people of the state to defend themselves if terrorists ever attack the state again.\nA report by Daily Independent quoted Governor Akeredolu as saying that “Protecting the life and property of our people is our priority here.\n“Any other incident here, we will ask our people to get guns to protect themselves.\n“If we are pushed to the wall, we will also encourage our people to get guns.\nI am begging you, nobody, state, the country can continue to witness this kind of insecurity."
  },
  {
    "headline": "We Will Buy Guns For Our People If We Record Further Terrorists’ Attacks – Ondo Governor, Akeredolu",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State has declared that he would buy guns for the people of the state to defend themselves if terrorists ever attack the state again.\nA report by Daily Independent quoted Governor Akeredolu as saying that “Protecting the life and property of our people is our priority here.\n“Any other incident here, we will ask our people to get guns to protect themselves.\n“If we are pushed to the wall, we will also encourage our people to get guns.\nI am begging you, nobody, state, the country can continue to witness this kind of insecurity."
  },
  {
    "headline": "Osun election: I'll be reelected, says Oyetola after voting",
    "summarized_story": "Gboyega Oyetola, governor of Osun, says he will be reelected.\nSpeaking with journalists after voting on Saturday, Oyetola said the people are “conscious” and see the need to participate in the process.\nThe governor said once the process is transparent, there would not be a need to ask people to vote.\nIt is important to deplore the machine so as to ensure that the voting process can be completed within the time frame,” he said.\n“By the grace of the Almighty God, I am confident I will be reelected.”AdvertisementEarlier, on his social media pages, Oyetola asked the people to be resolute in voting."
  },
  {
    "headline": "Osun election: I'll be reelected, says Oyetola after voting",
    "summarized_story": "Gboyega Oyetola, governor of Osun, says he will be reelected.\nSpeaking with journalists after voting on Saturday, Oyetola said the people are “conscious” and see the need to participate in the process.\nThe governor said once the process is transparent, there would not be a need to ask people to vote.\nIt is important to deplore the machine so as to ensure that the voting process can be completed within the time frame,” he said.\n“By the grace of the Almighty God, I am confident I will be reelected.”AdvertisementEarlier, on his social media pages, Oyetola asked the people to be resolute in voting."
  },
  {
    "headline": "Osun election: I'm impressed with voting process... I'll be monitoring, says Adeleke",
    "summarized_story": "Ademola Adeleke, governorship candidate of the Peoples Democratic Party (PDP) in Osun election, has lauded the voting process in the state.\nSpeaking with journalists on Saturday after voting at his polling unit in Ede north LGA of the state, Adeleke said he will be on the ground to monitor the election as it progresses.\n“I’m impressed with the electoral process at the moment; everything is going on smoothly,” the former senator said.\nIn 2018, Oyetola, who is seeking another term in office, defeated Adeleke in a keenly contested election.\nAdvertisementAdeleke had scored the highest number of votes in the election, but the Independent National Electoral Commission (INEC) held a rerun and Oyetola was eventually declared winner."
  },
  {
    "headline": "Osun election: I'm impressed with voting process... I'll be monitoring, says Adeleke",
    "summarized_story": "Ademola Adeleke, governorship candidate of the Peoples Democratic Party (PDP) in Osun election, has lauded the voting process in the state.\nSpeaking with journalists on Saturday after voting at his polling unit in Ede north LGA of the state, Adeleke said he will be on the ground to monitor the election as it progresses.\n“I’m impressed with the electoral process at the moment; everything is going on smoothly,” the former senator said.\nIn 2018, Oyetola, who is seeking another term in office, defeated Adeleke in a keenly contested election.\nAdvertisementAdeleke had scored the highest number of votes in the election, but the Independent National Electoral Commission (INEC) held a rerun and Oyetola was eventually declared winner."
  },
  {
    "headline": "LIVE: Oyetola battles to retain seat as Osun decides next governor",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Flutterwave, Eversend and other fintech African startups shut down virtual card service",
    "summarized_story": "Earlier on Friday, many African fintech startups offering virtual dollar card services sent emails to their customers stating that their virtual card service will be unavailable indefinitely starting Saturday, July 16, 2022.\nThis announcement by Flutterwave is bound to affect many other startups who use the company’s white-labeled virtual card service to issue virtual cards to their customers.\nOther fintech startups including crypto exchange Busha, Rwanda-headquartered Payday, and Ugandan Eversend also issued similar notices.\nIt’s not clear which “card partner” Flutterwave and the other fintech startups are referring to, but these platforms have issued virtual cards powered by MasterCard and Visa—two leading global card issuers.\n“It affects us in a big way because all our Facebook ads are connected to our Barter virtual card,” Douglas Kenydson CEO Selar said."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Meet Burna Boy's monitor engineer, Precious Tawo as he takes us on his journey into sound engineering",
    "summarized_story": "Without further ado, let’s meet Precious Tawo, freelance sound engineer and production manager.\nOn the 20th day [of the Calabar festival], we were doing a sound check in the stadium for the band, and my boss was not on the stage.\nPrecious Tawo’s journey into sound engineeringPrecious TawoI didn’t choose the path; the path chose me.\nAnd in 2013, the Calabar Festival was very popular.\nWe tried everything and eventually had to plug my monitors into my boss’ equipment."
  },
  {
    "headline": "Why is Nigeria’s inflation so high?",
    "summarized_story": "For the 12 months ending in June, Nigeria’s inflation rate skyrocketed to 18.6 percent, the highest in the past five years, since January 2017 when it was 18.72 percent.\nLast year, the World Bank said that the country’s high inflation rate has pushed more people into poverty.\nThe food inflation rate, which is the major driver of this accelerating inflation rate, increased to 20.6 percent in June from January, when it was 17.13 percent.\nRussia’s war with Ukraine, which started in February this year, led to supply shocks in energy and food, which accelerated the inflation rate.\nIn addition, the average exchange rate in the parallel market is now as high as N610 per dollar against the official exchange rate of N416.08 per dollar."
  },
  {
    "headline": "Osun election: Major contenders and their chances",
    "summarized_story": "Osun State is set to elect a new governor for the next four years come Saturday.\nHere, BusinessDay analyses the chances of the four major candidates in Saturday’s election.\nJust like in 2018, Saturday’s election would be marred by the inducement of voters and vote-buying across the state.\nHowever, observers fear that the crisis in Osun PDP and even at the national level may affect Adeleke’s chances on Saturday.\nAdeleke may enjoy sympathy from some electorates, considering the manner the 2018 election ended."
  },
  {
    "headline": "Arms control centre engages CSOs on illicit arms-free society – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe National Centre of the Control of Small Arms and Light Weapons (NCCSALW) has engaged with the Civil Society Organisations (CSOs) in the fight against illicit arms proliferation in Nigeria.\nHe said this was in its bid to secure Nigeria from the menace of illicit Small Arms and Light Weapons (SALW).\nHe, therefore, called for the support of CSOs for the government’s avowed commitment to rid the society of illicit weapons.\nHe commended the centre for its efforts in ridding the nation of illicit small arms and light weapons.\nHe said that illicit arms proliferation had remained a key driver for terrorism, ethno-religious conflicts, violent separatism and sundry organised criminal activities within and across borders."
  },
  {
    "headline": "Edo begins clampdown on unregistered vehicles August 1, sets up c’ttee …violators risk prosecution, says Shaibu – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Government will, from August 1, 2022, begin a clampdown on all unregistered vehicles across the state.\nThe Edo State Acting Governor, Rt.\nComrade Philip Shaibu, while constituting a task force to enforce the clampdown at the Government House, Benin City, charged owners and operators of unregistered vehicles in the state to register such vehicles on or before 31st July, 2022 to avoid prosecution.\nOther members of the committee are drawn from the Edo State Internal Generated Revenue Service (EIRS), Federal Road Safety Corps (FRSC), the Edo Public Works Volunteers (PUWOV), and the Nigerian Police.\nShaibu said, “All motorcycles, tricycles, and vehicles, both private and commercial, especially Toyota Yaris, must be registered in the state."
  },
  {
    "headline": "Bendel Insurance beat Ikorodu City 2-0, Secure Promotion Ticket to NPFL – Nigerian Observer",
    "summarized_story": "They gained promotion in 2018/2019 season with same coach Monday Odigie in charge but could not sustain their stay.\nThe first half had ended goalless in the game that attracted a good number of spectators,including top government functionaries most of whom did not want the Lagos boys to spoil Insurance victory party.\nInsurance FC with 46 points in their bag are guests to J.Atete FC in their next game before coming back home to host Vandrezzer FC next week in their last game of the regular season.\nThe Acting Governor assured the team of continuous support to ensure good outings and sustainability in the premier League.\nHe also gave kudos to the management and his players who got the job done with two games to spare."
  },
  {
    "headline": "Africa Anti-corruption Day: Buhari seeks int’l anti-corruption court to try offenders – Nigerian Observer",
    "summarized_story": "He also urged African leaders to intensify the fight against corruption, and create more disincentives for pilfering of public funds.\n“Distinguished participants and fellow African leaders, corruption is evil and all efforts at tackling it are desirable.\n“I am extremely delighted to address the participants as we celebrate the Africa Day of Anti-Corruption.\nAccording to him, African leaders must get rid of corruption in Africa if the continent is to realize its full potentials.\nThe Anti-Corruption Day also helps Africa’s anti-corruption fighters share good lessons and practices."
  },
  {
    "headline": "Osun Guber: PDP candidate, Senator Adeleke casts vote in Ede",
    "summarized_story": "By Sunday Oguntuyi, OsogboSenator Ademola Adeleke, the peoples Democratic party (PDP) governorship candidate for the ongoing election in Osun State, has cast his vote at ward 2, unit 9, in Abogunde Saga Ede South.\nThe Guber candidate cast his vote alongside some of his party faithful in the area.\nAdeleke while addressing his supporters assured them of victory and urged them to stay calm for the votes to be counted.\nHe also visited ward 5, Alajue II, Orisunmibare Village in Ede South Local government area of State of Osun where accreditation and voting are ongoing as as well.\nSome of the INEC Officials noted that about 800 voters are expected to cast their votes in the area."
  },
  {
    "headline": "New Yam Festival: Ebonyi PDP guber candidate, Odii felicitates with Ezza nation",
    "summarized_story": "Dr. Ifeanyi Chukwuma Odii, the People’s Democratic Party (PDP) governorship candidate in Ebonyi State, has felicitated with the people of Ezza Ezekuna and the entire Ezza nation on the occasion of their Okeaku New Yam Festival 2022.\n“I warmly and profoundly felicitate with the people of Ezza Ezekuna on the occasion of their Okeaku New Yam Festival 2022,” he said.\n“The Ezza nation, is a resilient, hospitable, humble, competent, courageous, confident, dependable, creative and innovative people who have over the ages made tremendous contribution to humanity.\n“I therefore explicitly associate with your aspirations as you showcase this harmonious display of great ideal of traditional value.\nDr. Odii prayed God to attend to the observance of the festival “with unrestrained grace and protection.”"
  },
  {
    "headline": "2023: We chose Bola Tinubu as APC candidate to avert fighting – Ganduje",
    "summarized_story": "Abdullahi Ganduje, governor of Kano State, has said the north opted to nominate Bola Ahmed Tinubu as presidential candidate of the All Progressives Congress (APC) because it was the only way to avert fighting.\nThis is as he stated that Oyetola was the only Muslim governor in the South-West, noting that he was their ‘brother’.\nGanduje reportedly visited a mosque in Osogbo on Friday during the Jumaat prayers, where he was said to have met with the Hausa community in Osogbo, canvassing vote for Oyetola.\nGanduje said, “I have come to this mosque to talk to the Muslims here.\nThat is the only way we will be able to avert fighting and crises."
  },
  {
    "headline": "Osun Guber: Ganduje tells Muslims to vote Oyetola because he’s a Muslim",
    "summarized_story": "Abdullahi Ganduje, governor of Kano State, has charged all Muslim faithful in Osun State to vote for the incumbent governor, Gboyega Oyetola in today’s governorship election, to continue his tenure as governor for the second term because he is a Muslim like them.\nThis is as he stated that Oyetola was the only Muslim governor in the South-West, noting that he was their ‘brother’.\nGanduje reportedly visited a mosque in Osogbo on Friday during the Jumaat prayers, where he was said to have met with the Hausa community in Osogbo, canvassing vote for Oyetola.\nGanduje said, “I have come to this mosque to talk to the Muslims here.\nAccording to him, that was enough reason for them to vote for the incumbent governor, who he claimed would “build your markets, roads and bring development to your community”."
  },
  {
    "headline": "Why Peter Obi may become president in 2023 by default, By Farooq Kperogi",
    "summarized_story": "That’s just 17 days’ notice, which falls short of the 21 days’ notice the Electoral Act 2022 requires.\nThe Labour Party, like the PDP, complied with the requirements of Section 82(1) of the Electoral Act 2022.\nBut the PDP fell afoul of Section (3) of the Electoral Act 2022.\nThe Electoral Act makes no provision for a bit-by-bit submission of membership register.\nIn other words, even INEC is in violation of the Electoral Act 2022, and this isn’t the first time it is."
  },
  {
    "headline": "Osun Gov’ship Poll: Voting In Progress Amid Tight Security",
    "summarized_story": "The Osun State governorship election commenced as scheduled on Saturday morning amid tight security.\nThe exercise witnessed early arrival of the Independent National Electoral Commission (INEC) officials at their polling units across the state.\nAt Ward 02, Unit 06 Ilesa, Ilesa West LGA, BVAS failed as only two persons were accredited as at 9am.\nA member of the State House of Assembly representing Ilesa West, Hon.\nHe called on security operatives to be on alert in Ilesa because of the pre-election violence that had occurred in the town."
  },
  {
    "headline": "Osun Gov’ship Poll: Voting In Progress Amid Tight Security",
    "summarized_story": "The Osun State governorship election commenced as scheduled on Saturday morning amid tight security.\nThe exercise witnessed early arrival of the Independent National Electoral Commission (INEC) officials at their polling units across the state.\nAt Ward 02, Unit 06 Ilesa, Ilesa West LGA, BVAS failed as only two persons were accredited as at 9am.\nA member of the State House of Assembly representing Ilesa West, Hon.\nHe called on security operatives to be on alert in Ilesa because of the pre-election violence that had occurred in the town."
  },
  {
    "headline": "Kidney Failure Kills 150 Yearly In Yobe Town – Medical Expert",
    "summarized_story": "No less than 150 residents of Gashua town in Yobe State, die of kidney disease yearly, according to a report published by the International Centre for Investigative Reporting (ICIR).\nAlso, Chief Imam of Bade Emirate, Umar Abubakar, under which Gashua falls, had told ICIR reporter that kidney disease killed at least 120 people yearly in the town.\nAhmed noted that after applying chemicals to preserve foods, people could only eat such foods after six months when the chemicals’ potency would have reduced.\n“Every month, we diagnose around 20 to 30 new cases (of kidney disease).\nHe said the State Specialist Hospital in Damaturu offered free dialysis, but there was no dialysis for treating the condition in Gashua."
  },
  {
    "headline": "Kidney Failure Kills 150 Yearly In Yobe Town – Medical Expert",
    "summarized_story": "No less than 150 residents of Gashua town in Yobe State, die of kidney disease yearly, according to a report published by the International Centre for Investigative Reporting (ICIR).\nAlso, Chief Imam of Bade Emirate, Umar Abubakar, under which Gashua falls, had told ICIR reporter that kidney disease killed at least 120 people yearly in the town.\nAhmed noted that after applying chemicals to preserve foods, people could only eat such foods after six months when the chemicals’ potency would have reduced.\n“Every month, we diagnose around 20 to 30 new cases (of kidney disease).\nHe said the State Specialist Hospital in Damaturu offered free dialysis, but there was no dialysis for treating the condition in Gashua."
  },
  {
    "headline": "I am sure of victory, Oyetola says after casting his vote",
    "summarized_story": "Adegboyega Oyetola of Osun said he is sure of winning the governorship election, as he cast his vote at Unit 2, Ward 1, LA Primary School, Popo, Iragbiji in Boripe Local Government area.\nOyetola, who arrived at the polling unit in the company of his wife, Kafayat, cast his vote at exactly 10.55 a.m, three minutes after his wife voted.\nSpeaking with journalists after exercising his franchise, Oyetola said he was happy with the turnout of voters, especially at his polling unit.\nOyetola said the election process was transparent, adding that this encouraged voters to come out en-masse to vote.\nThere was also a large turnout of voters at the polling unit, which had 1,457 registered voters."
  },
  {
    "headline": "6 pickpockets busted in Jigawa",
    "summarized_story": "By Muhammad Nasir BashirThe Police in Jigawa have arrested six suspected pickpockets in Hadejia Local Government Area of the state.\nThe Police Public Relations Officer (PPRO) in the state, DSP Lawan Shiisu, confirmed this NAN in Dutse on Saturday.\nHe explained that the suspects, residents in Hadejia town, stole the money and phone from the victim at Baturiya market.\nMeanwhile, the PPRO added that the police arrested six suspected drug peddlers and recovered 180 tablets of Diazepam (D5) drug in the same LGA.\nAccording to him, the suspects will be charged to court upon completion of the investigation."
  },
  {
    "headline": "BREAKING: Again, terrorists abduct two Catholic Priests in Kaduna",
    "summarized_story": "In a statement made available to journalists in Kaduna, the Chancellor of the Catholic Diocese of Kafancha, Rev.\nIt is with great sorrow that we must inform you of the kidnapping of two of our priests, Rev.\n“We solicit for an intense prayer for their quick and safe release, we equally wish to call on all and sundry to refrain from taking the laws into their hands.\n“We will use every legitimate means to ensure their quick and safe release.\n“May Jesus crucified on the Cross listen to our prayers and hasten the unconditional release of His Priests and all other kidnapped persons.”This is coming just weeks after three Catholic priests were kidnapped in the State."
  },
  {
    "headline": "JUST IN: Senator Bassey Akpan dumps PDP in Akwa Ibom",
    "summarized_story": "Senator Bassey Akpan, who represents the Uyo Senatorial District in Akwa Ibom State, has defected from the PDP.\nPastor Umo Eno, the party’s preferred candidate to succeed Governor Udom Emmanuel, defeated Akpan in the race for the 2023 governorship ticket.\nThe Senator’s resignation from the People’s Democratic Party (PDP) is detailed in a letter dated July 15, 2022, and distributed to journalists on Friday in Uyo.\nAkpan in the letter addressed to PDP Ward Chairman of Ibiono Ibom Eastern ward 1 , Ibiono Ibom local government area, said his decision to leave PDP was to provide him the latitude to actualize his aspiration of bringing good leadership to the state.\n“Consequently, guided by the sentiments, concerns and worries of our people so expressed on the need to take immediate steps for the actualization of their aspirations, I am therefore compelled to resign my membership of the Peoples Democratic Party (PDP) forthwith."
  },
  {
    "headline": "I Was Born With Sickle Cell, It Was Tough, Painful and Frustrating – Adekunle Gold",
    "summarized_story": "The “High” crooner, in a lengthy letter to his fans disclosed that he was much younger he struggled with his health as he was born with sickle cell anaemia.\nI was born with sickle cell disease.\nSickle cell disease took away my freedom, my childhood.\nLiving with sickle cell is far from living a normal life.\nSickle cell anemia gave me hope, made me tough, gave me the discipline I needed to be who I am today, built my character."
  },
  {
    "headline": "Osun 2022: Court Restrains Amotekun From Election Duty",
    "summarized_story": "The Osun Security Network, also known as the Amotekun Corps, has been prohibited from taking part in the gubernatorial election on Saturday by a Federal High Court sitting in Osogbo, the capital of Osun State.\nThe Independent National Electoral Commission (INEC) was also ordered by the court not to use any members of the Amotekun Corps as part of the security forces that would be deployed during the election.\nAmotekun was issued a warning not to participate in the governor election as a volunteer or member of the security force.\nPart of the order reads, “That the 1st defendant (INEC) is hereby restrained from requesting the deployment of the second defendant (AMOTEKUN) as part of the security personnel deployable for the purpose of Osun 2022 governorship election pending the determination of the originating summons filed in the suit.”Speaking on the court order, Hashim Abioye stated, “With this order, it is forbidden for the INEC to make use of Amotekun as part of the security personnel to be drafted for the election.\n“As I speak to you, those concerned, the INEC, police and other relevant agencies, have been appropriately served.”"
  },
  {
    "headline": "#OsunDecides2022: Nonagenarian defies odds, votes in Osun",
    "summarized_story": "A nonagenarian, Mustapha Olatunji, has casted his vote at the Boripe LG, Ward 1, Unit 002 in the Osun governorship election.\nThe 90-year-old Olatunji revealed that he had been voting since the days of the former Premier of Western Region, Obafemi Awolowo.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "#OsunDecides2022: Free Akara at Aregbesola’s home (PICTURE)",
    "summarized_story": "Free beans cake (akara) is being offered at the home of the Minister of Interior, Rauf Aregbesola, in Ifofin area in Ilesha, Osun state.\nHe is expected to vote in the Osun State governorship election at his house there but has yet to show up.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "#OsunDecides2022: Accord Party candidate commends process",
    "summarized_story": "The governorship candidate of the Accord Party (AP), Dr Akin Ogunbiyi, has commended the INEC and security agents for the peaceful conduct in the Osun state governorship election.\nHe spoke to journalists after casting his vote at Ward 05, unit 03, Methodist Primary School, Ile-Ogbo, in Ayedire local government.\nHe said, “the process has been peaceful and progress is being made.\nI however want the process stepped up to accommodate all eligible voters within the time.\nThe report across the state shows that it has been peaceful.”Share this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Rivers: Nirvana, Access Bank Donate Cartons of Food Items to Sickle Cell Disease Persons",
    "summarized_story": "A non governmental organisation, Nirvana Initiative and Hacey Health Initiative in partnership with Access Bank has lifted the lives of people living with sickle cell disease by donating cartons of food items to them and their relatives in Rivers State.\nNirvana Initiative through Sickle Cell Awareness and Health Foundation, held the sensitisation and food donation event at the University of Port Harcourt Teaching Hospital (UPTH) where many with sickle cell trait and their parents disclosed their challenges.\nA facilitator at the programme, Dabata Omubo-Pepple, Executive Director of Sickle Cell Awareness and Health Foundation, explained that the gesture by the NGO to reach out to people living with the disease was in commemoration the world sickle cell day, earlier celebrated in June.\nA way of reaching out with people living with sickle cell disease with a welfare package which has to do with food, reminding them that food is important in their day to day and also to support them”.\nMy parent realized that I am a sickler when I was about a year old and my mum was already pregnant with my little sister who also had sickle cell”."
  },
  {
    "headline": "X-raying reforms in SEC and uncanny zeal for investment space",
    "summarized_story": "Also, the Yuguda-led executive management team has been implementing capital market development goals set out in the Capital Market Master Plan (CMMP) (2015-2025) and successfully completed the review of CMMP to realign the initiatives/deliverables to prevailing market conditions and keep the document relevant in the dynamic capital market due to issues related to Fintech, sustainability and regional integration.\nThis is even as it processed six Schemes of Merger, seven Acquisitions, 21 Corporate Restructurings, and three Takeovers during the period.\nUnder his leadership, rules for the integrated West African Capital Market were developed and reviewed.\nOn human capital development, the Commission had in 2019 conducted an internal capacity assessment that outlined staffing deficits and needs.\nThe Commission has also secured counterpart funding of $450,000 from AfDB on its Nigeria Securities Market Surveillance System Project to support the deployment of a real-time market surveillance system for the Nigerian capital market."
  },
  {
    "headline": "TAJBank opens new branch to deepen financial inclusion",
    "summarized_story": "…as excited traders jostle to open accountBY Kehinde IbrahimTAJBank Ltd, a leading non-interest hank, has continued its service and financial inclusion drive with the opening of a new, technology-powered branch in Wuse 2, Abuja.\nThe opening of the new branch brings the lender’s growing branch network to 22 within its first two years of operation.\nJoda explained: “The opening of the new branch is to continue with our strategy of ensuring that we take the TAJBank brand to all the nooks and crannies of the Country with the aim of addressing the service needs of our teeming customers.\n“We understand that Customers want to do business and sometimes someone to give them that advisory service they yearn for which in turn will help to address their financial challenges”, he added.\nThe non-interest bank is also set to launch Nigeria’s first private sector Sukuk offering under a N100 billion programme."
  },
  {
    "headline": "NES28 to rally stakeholders for sustainable economic growth",
    "summarized_story": "While welcoming participants to the event, the chairman of the NESG, Mr Asue Ighodalo, said that the annual Nigerian Economic Summits had been sustained as a public-private dialogue platform by the NESG (representing the private sector) and the Federal Ministry of Finance, Budget and National Planning (representing the Federal Government of Nigeria).\nHe noted that the Summit is a foremost platform through which the federal and state governments engage with corporate leaders and discuss Nigeria’s national and sub-national economic realities to co-create reform strategies that are critical for the advancement and reform of the Nigerian economy.\nMr Ighodalo stated that the vision of a secure, developed, prosperous and macro-economically stable country where the rule of law prevails and no one is left oppressed appears dimmed with today’s considerable headwinds, but the current electoral cycle offers a unique opportunity to reflect and reset.\nHe noted that the challenge of non-inclusive economic growth reflects low productivity across employment-elastic sectors, which continues to weaken their capacity to create more job opportunities and decent employment.\n“Government has a pivotal role in jump-starting and addressing with utmost urgency six critical challenges including non-inclusive economic growth, macroeconomic instability, infrastructure deficit, human capital deficit and skills gap, national insecurity and weak economic competitiveness,” he stated."
  },
  {
    "headline": "Danger as Naira hits N620/$ at parallel market",
    "summarized_story": "Naira yesterday fell to N620 per dollar at the parallel market amid the lingering scarcity of the greenback.\nCurrency traders known as Bureaux De Change operators (BDCs) said there was increased demand for the dollar by importers at the street market.\nThe traders put the buying price of the dollar at N614 and the selling price at N620, leaving a profit margin of N6.\nAccording to the Central Bank of Nigeria (CBN), the parallel market is not a true reflection of the country’s exchange rate.\nOn Tuesday, the euro fell to parity against the dollar for the first time in almost 20 years."
  },
  {
    "headline": "LIVE UPDATE: Election Day In Osun, Residents Vote In Governorship Poll",
    "summarized_story": "Welcome to our live page for the Osun State governorship election.\nOsun State also has three senatorial districts, nine federal constituencies, and 23 state constituencies.\nOsun State Governorship Election 2022.\nHe says Nigeria is in trouble if vote-buying mars the Osun governorship election.\nQuick stories for catch upPolice In Show Of Force Ahead Of Osun Governorship ElectionPersonnel of the Nigeria Police on Friday held a show of force exercise ahead of the Osun State governorship election."
  },
  {
    "headline": "Osun Election: Oyetola, Wife Vote In Boripe LGA",
    "summarized_story": "Governor Adegboyega Oyetola of the All Progressives Congress (APC) has cast his vote along with his wife in the Osun State governorship election.\nThe couple voted on Saturday at about 11:04 am at polling unit 2 Ward 1, Local Authority Primary School in Boripe Local Government Area of the state.\nGovernor Oyetola and his wife arrived at the polling station at about 10:37 am after which they joined the queue to cast their votes.\nThey were welcomed by a cheering crowd of supporters, some of whom are in the queue waiting to also cast their votes.\nVIDEO: The moment Governor Adegboyega Oyetola and his wife cast their vote in #OsunDecides2022 pic.twitter.com/mrXPggii9X — Channels Television (@channelstv) July 16, 2022Some minutes after joining the queue, the governor and his wife took turns to get accredited by the Bimodal Voter Accreditation System (BVAS)."
  },
  {
    "headline": "LP’s Yusuf Votes, Says Nigeria In Trouble If Vote-Buying Mars Osun Election",
    "summarized_story": "The candidate of the Labour Party, Lasun Yusuf, has cast his vote in the ongoing Osun State governorship election.\nHe cast his ballot on Saturday at about 10:20 am at one of the polling units in Irepodun Local Government Area of the state.\nYusuf, a former Deputy Speaker of the House of Representatives, decried the long time it took him to be accredited by the Bimodal Voter Accreditation System (BVAS).\nFor him, it is barely two hours into the election, and it will be too early to make any comment in that regard.\nYusuf, however, warned against vote-buying and vote-selling, saying Nigeria would be in trouble if allowed to thrive in the ongoing election."
  },
  {
    "headline": "Osun Election: PDP’s Adeleke Casts His Vote, Commends INEC",
    "summarized_story": "The candidate of the Peoples Democratic Party (PDP), Senator Ademola Adeleke, has cast his vote in the ongoing Osun State governorship election.\nHe cast his ballot on Saturday morning at polling unit 9, Ward 2 in Ede North Local Government Area of the state.\nSenator Adeleke who arrived at his polling unit in Abogunde/Sagba Ede North about 8:46am was accredited by the electoral officials on duty at about 8:50am after which he voted about two minutes later.\nSpeaking to reporters after casting his vote, the PDP governorship candidate commended the Independent National Electoral Commission (INEC) for its efforts.\nAccording to him, everything is going well and that has been the situation from the information he has gotten from other voting areas."
  },
  {
    "headline": "Osun Governorship Election In Photos",
    "summarized_story": "Residents on Saturday trooped to the poll units to vote in the ongoing Osun State governorship election.\nThe Independent National Electoral Commission (INEC) is conducting the exercise in 3,763 polling units across the 332 registration areas in 30 local government areas of the state.\nOsun State also has three senatorial districts, nine federal constituencies, and 23 state constituencies.\nAlthough there are 15 political parties in the state, 15 of them are represented in the contest for the next governor of the state.\nSome of the highlights of the election in various parts of the state are captured in the photos below…"
  },
  {
    "headline": "Osun 2022: Oyetola, wife vote in Iragbiji",
    "summarized_story": "The governorship candidate of the All Progressives Congress, Adegboyega Oyetola and his wife, Kafayat, have voted at their Iragbiji polling unit in Boripe Local government.\nAdvertisementAdvertisementEarlier, INEC Officials were seen addressing voters at the LA School Popo, Ward 1 Oloti Iragbiji in Boripe Local Government of the state.\nAdvertisementAdvertisementAdvertisement"
  },
  {
    "headline": "Osun Governorship Election will be credible, INEC pledges -",
    "summarized_story": "The Independent National Electoral Commission, INEC, has expressed readiness for the Osun Governorship Election, even as it has strongly cautioned against vote buying.\nINEC Chairman, Professor Mahmood Yakubu, assured the Osun electorate of inclusivity, credibility, and security.\nAdvertisementAdvertisementAdvertisementAdvertisement"
  },
  {
    "headline": "40 lawmakers recognised for exceptional legislative work",
    "summarized_story": "Forty out of the four hundred and sixty nine federal legislators have been recognised for their exceptional legislative work in the first two years of the life of the ninth National Assembly.Less than half of this figure will make it to the induction stage into the Hall of Fame as Most Valuable Parliamentarians by the time the Assembly winds down.\nNational Assembly Correspondent, Joke Adisa, reports thatthe awards come in different categories.\nFrom Bill Productivity Index, Performer on Bills Sponsorship per geographical zone, to Impact of Bills Index among many more.\nAdvertisementAdvertisementSenators Oluremi Tinubu and Solomon Adeola, both from Lagos state, as well as Abia Rep, Benjamin Kalu, Oluwole Oke from Osun and the Deputy Chief Whip of the House, Nkeruika Onyejiocha, lead the pack of Awardees.\nThe organiser said the move is to encourage hardwork while putting the legislators on their toesAdvertisementAdvertisementAdvertisementTo some of the awardees, the recognition, which is the first of the four phases into the induction proper, is tonic for more workAdvertisement"
  },
  {
    "headline": "INEC extends Continuous Voter Registration exercise till July 31st -",
    "summarized_story": "The Independent National Electoral Commission has again extended the continuous voter registration exercise to now end on 31th of July, 2022.\nAdvertisementAdvertisementThe electoral umpire said the exercise has also been extended to eight hours daily — from 9am to 5pm — instead of the current duration of six hours daily.\nAccording to the INEC commissioner for information and voter education, Festus Okoye, the exercise will now include weekends as against only weekdays.\nAdvertisementAdvertisementAdvertisementINEC had earlier fixed June 30 as the deadline for the ongoing CVR ahead of the 2023 elections— but the commission later extended the exercise by two weeks.\nThe electoral umpire is now asking Nigerians to take advantage of the new two-week extension to register for their permanent voter cardsAdvertisementAdvertisement"
  },
  {
    "headline": "Nigeria Overcame Recessions with Bespoke Policies, Says Emefiele, as Inflation Hits 5-Year High – Arise News",
    "summarized_story": "The Governor of the Central Bank of Nigeria, Godwin Emefiele, on Friday said with the rising global trend of digital economy, the Monetary Policy Committee is expected to chart a new direction for the Nigerian economy.\nEmefiele noted that in the last eight and a half years, the CBN had done bespoke monetary policies, which had seen Nigeria overcome recession twice in four years.\nTherefore, the urgent call for the need to rethink financial system regulation, supervision and monetary policy implementation.\nWe have to respond so we can make policies that would affect economic growth, inflation and all the intermediate macroeconomic factors.\nThe development means that the headline inflation rate increased in June 2022 when compared to the same month in the previous year (June 2021)."
  },
  {
    "headline": "Shettima to Peter Obi: You Can Only Become President in Igboland, Nigeria Too Big",
    "summarized_story": "The All Progressives Party vice-presidential candidate for the 2023 elections, Kashim Shettima, has said Labour Party presidential candidate, Peter Obi, can only become a President in Igboland, “but definitely not in Nigeria (because) Nigeria is too big for him to handle.”Shettima, speaking on a television programme on Friday said: “The presidential candidate of the Labour Party, Mr. Peter Obi has no political base and structure to win the next election in 2023.\n“Our candidate, Asiwaju Bola Ahmed Tinubu is the right person needed for this position in a time like this.\n“Presidential position is not for the unprepared neither is it an all comers’ affair.\nPeter Obi can only become a President in Igboland but definitely not in Nigeria.\nHe has no leadership ideology nor experiences like President Muhammadu and our incoming President in the person of Asiwaju Bola Ahmed Tinubu.”Adedayo Akinwale in Abuja"
  },
  {
    "headline": "Katsina Governor Masari Says Politics Is About Fair Leadership Not Religion, as Northern Christians Take Protest to Buhari",
    "summarized_story": "So, I fully support his nomination as the running mate of Tinubu for the 2023 presidential election under the platform of APC.\nIt is better to have a good Christian than a bad Muslim likewise is better to have a good Muslim than a bad Christian.\n“However, the move by our party to adopt a Muslim-Muslim ticket is most insensitive and the height of discrimination against Christians in our country.\nThis is on the heels that other political parties indeed reflected the religious balance in the composition of their presidential team.\nBy their action, the APC sent a strong message that Christians are not relevant in the scheme of things in the country.”"
  },
  {
    "headline": "Osun Election: PDP’s Adeleke Challenges Incumbent APC Governor Oyetola",
    "summarized_story": "Both Oyetola and Adeleke contested for the Osun governorship position in 2018, which Oyetola won after a rerun.\nFor most of Friday, tension remained very high across Osun State, with voters bitterly divided among the two leading candidates.\nOyetola and Adeleke (Strengths and Weaknesses)The leading candidates for the election remain Oyetola and Adeleke.\nBaba also moved the Osun State Commissioner of Police, Olawale Olokode (temporarily) to the Force Headquarters until the conclusion of the election.\n“The people of Osun State and Nigerians will understandably hold us to our promise on election day."
  },
  {
    "headline": "Biden Hopes for Israeli Integration at Arab Summit in Saudi Arabia",
    "summarized_story": "US President Joe Biden will discuss regional missile and defence capabilities on Saturday when he meets Arab leaders in Saudi Arabia.\nThat encounter has drawn criticism in the United States over human rights abuses.\nThe administration official said the United States is hopeful it will see an OPEC production boost in the coming weeks.\n“He’s intent on ensuring that there is not a vacuum in the Middle East for China and Russia to fill,” Sullivan said.\nWashington and Riyadh also announced the removal of U.S. and other peacekeepers from Tiran — an island between Saudi Arabia and Egypt in a strategic position leading to the Israeli port of Eilat."
  }
]