[
  {
    "headline": "Nigeria must embrace renewable energy now – Reps",
    "summarized_story": "The House of Representatives has said Nigeria must begin to adopt other sources of energy as the world is shifting from fossil fuel to cleaner, renewable energy.\nThis was made known in Abuja on Wednesday at a public hearing organised by the House Committee on Science and Technology on three bills seeking to amend the Amend Energy Commission of Nigeria Act and create a National Renewable Energy Development Agency.\nOne of the legislation is titled, ‘A Bill for an Act to Amend Energy Commission of Nigeria Act (Cap E10, Laws of the Federation of Nigeria, 2004) to Strengthen and to Make it the National Focal Point for New and Renewable Energy, Energy Efficiency and Conservation and Establish the Renewable Energy, Energy Efficiency and Conservation Fund for Related Matters.’The second legislation is titled, ‘A Bill for an Act to Amend the Energy Commission of Nigeria Act, Cap E10 Lfn, 2004 to Make it Compulsory for the Federal Government Through the Commission to Harness, Explore and Utilise Other Sources of Energy Other Than the Hydro and Gas Energy Sources in Nigeria and for Related Matters.’‘A Bill for an Act to Establish the National Renewable Energy Development Agency (Establishment) Bill, 2020’ is the third legislation presented.\nFollowing the adoption of SDGs, the global energy focus has shifted from carbon fuels to cleaner renewable sources and the implications are far reaching.\nOn the brighter side, Nigeria is abundantly blessed with other cleaner renewable energy sources."
  },
  {
    "headline": "Alleged N5.2bn fraud: Court grants ex-JAMB registrar Ojerinde bail",
    "summarized_story": "The Federal High Court sitting in Abuja on Thursday has granted the bail application of a former Registrar of Joint Admissions and Matriculation Board, Prof Adedibu Ojerinde.\nThe court also ordered that Ojerinde must deposit his passport with the court registrar.\nThe Prosecution lawyer, Ebenezer Shogunle, informed the court that Ojerinde was on his way to court but was delayed by traffic.\nThus, the court stood down the matter and proceeded to take other cases on the cause list.\nJustice Obiora Egwuatu gave the order after the former JAMB boss was arraigned on an 18-count bordering on alleged fraud and diversion of public funds to the tune of N5.2 billion."
  },
  {
    "headline": "Kaduna enrols 400,000 into Contributory Health Mgt Scheme— KADCHMA",
    "summarized_story": "including 46000 vulnerable people By Ibrahim Wuyo, KadunaA total of 400, 000 Kaduna citizens from across the 23 Local Government Areas have been enrolled into the Kaduna Contributory Health Management Authority (KADCHMA) scheme.\nThis was disclosed during a meeting titled: “Partnership to Engage, Reform and Learn (Perl) and Lafiya Programme Interaction with Kaduna State Accountability Mechanism (KADMAN) and KADCHMA on Strategies for Contributory Health Care Enrollment”, held in Kaduna.\nThe scheme was passed into law in 2018 by the Kaduna State government to provide health care services to the residents at very subsidised rates and qualitative manner.\nShe said that the passing into law of the scheme in 2018 led to the establishment of KADCHMA, with the mandate of delivering and operating the contributory health scheme itself.\n“The law state that it’s mandatory for everybody who is resident n Kaduna state to key into the scheme."
  },
  {
    "headline": "We’re now targets of kidnappers — Monarchs",
    "summarized_story": "People are being kidnapped from their homes and taken to unknown destinations, traditional rulers and their hallowed palaces have been desecrated.\nThey made away with him to an unknown destination, the traditional ruler spent four days in the kidnappers’ den.\nSources disclosed that the kidnappers, after gaining entrance into the palace, went straight to the bungalow housing the monarch and his family members.\nOn his part, the Owa Ooye of Okemesi Ekiti, Oba Adedeji Gbadebo, suggested the use of traditional African medicine to tackle the menace.\nThe kidnappers told the family to go home and look for money to secure the release of the farmer."
  },
  {
    "headline": "Maritime group moves to sustain blue economy",
    "summarized_story": "By Godwin OritseThe Blue Economy Resources Nigeria Coordinating Group may have concluded plans to ensure that the Deep Blue project of the Nigerian Maritime Administration and Safety Agency, NIMASA, is sustained with a view to ensuring that the country benefit from the economic potentials.\nA statement by the group’s chairperson, Hajia Lami Tumaka, said that the Group is in business to provide be-spoke innovations tailored towards facilitating maritime business-friendly solutions to the challenges in the Nigeria’s emerging blue economy sector.\n“The Group is working with the Board of Directors as advisors and partners to among others, bring the Blue Economy Advocacy to the front burner of government, the Organized Private Sector and critical stakeholders.\n“Going forward, we shall as a group establish networking platforms to engage critical stakeholders including the Honourable Minister of Transportation, the Heads of maritime agencies, ship owning associations, barge/boat operators, oil and gas players, maritime workers, marine environment managers and community groups.\n“The idea being to sensitize and enlighten them on our vision and mission for the industry and ultimately their support and buy-in.’’"
  },
  {
    "headline": "2023: Okowa not opposed to zoning in Delta",
    "summarized_story": "Chief Press Secretary to Governor Ifeanyi Okowa of Delta, Mr. Olisa Ifeajika, has said that the governor was not averse to the zoning of the governorship of the state contrary to insinuations in some quarters.\n“It’s not true that the Governor of this state, Senator Dr. Ifeanyi Okowa, is opposed to zoning, particularly for the governorship of this state.\n“The insinuation that it was through zoning that Okowa became governor is also wrong.\n“For the one that brought Okowa to power in 2015, we are aware that aspirants from Central and South Senatorial Districts participated, including a former minister who has become an apostle of zoning and saying that zoning consensus brought Governor Okowa to power.\n“In other words, it is not true that it was zoning that brought Okowa to power, it was his person, his pedigree in politics, and the grace of God."
  },
  {
    "headline": "PIB: Ndokwa group rejects 3% allocation, alleges marginalisation",
    "summarized_story": "Rodney Odibe Odili-Obi respectively, issued at the end of a well-attended meeting of the leadership and members of the group including critical stakeholders in the Ndokwa project at the Ndokwa House, Abuja, Thursday.\n“Ndokwa creeks, lowland and upland areas have a cumulative Oil production capacity of over 380 million Stock Tank Barrels (STB).\nThe potential Crude Oil production across the Ndokwa land is 150,000 barrels per day (bpd).\nFirst, to qualify as a Host Community, the subsurface below such a community must geologically bear oil and gas.\nOur economic resources have been hugely exploited, yet our people and environment have largely been without benefits.” The group stated in the presence of the mammoth crowd of Ndokwa people."
  },
  {
    "headline": "BREAKING: Two Immigration officers killed as bandits attack village in Katsina",
    "summarized_story": "Some bandits on Wednesday stormed a village in Jibiya LGA of Katsina State around 11pm, killing two Immigration officers and rustling hundreds of cattle.\nDAILY POST gathered from a reliable source, that the bandits surrounded Kadobe village, close to Immigration checkpoint, after they got information that many cows were sited in the village.\nThe immigration officers, sensing their large numbers and the likelihood of being overpowered, called for reinforcement from the military.\n“The bandits got information that some people brought cows to the village yesterday and you know that the immigration checkpoint is there.\nSo they came in the night and started exchanging fire with the immigration officers."
  },
  {
    "headline": "Biafra: Nnamdi Kanu will soon be released",
    "summarized_story": "Ifeanyi Ejiofor, lawyer of detained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, has assured that the separatist would be released soon.\nEjiofor made the assurance while stressing that the Nigerian government lacked strong evidence to use in convicting Kanu.\nAccording to Ejiofor: “We are in high spirits that Mazi Nnamdi Kanu will soon come out of detention sooner than expected, and better too.\nBut, a few weeks ago, the Nigerian government had rearrested and repatriated him to Nigeria to continue his trial.\nEjiofor had also lamented that the IPOB leader may not get a fair trial when the court resumes sitting on the matter"
  },
  {
    "headline": "Customs generates over N1trn revenue in six months",
    "summarized_story": "The Nigeria Customs Service (NCS) claims that it has generated N1.003 trillion revenue in six months.\nJoseph Attah, Customs Public Relations Officer, stated this on Thursday while addressing journalists in the Federal Capital Territory, Abuja.\nAttah stated that the development brought the difference of about N290.2 billion, expressing optimism that the service may realize more positive changes subsequently.\nThis feat is a result of the resolute pursuit of what is right and willingness to adapt to changes brought about by global health challenges occasioned by covid-19.\n“The Service revenue profile continues to be on the increase due to ongoing reforms that exploit the potentials of technology."
  },
  {
    "headline": "Kaduna Assembly vows to partner state government to rescue abducted Bethel students",
    "summarized_story": "The Speaker, Kaduna State House of Assembly, Alhaji Yusuf Ibrahim Zailani, has expressed sadness over the abduction of the students of Bethel Baptist High School, Kaduna, and promised to work closely with the Executive arm of government to ensure their safe release.\nRecall that over 100 students of the school were on Monday, 5th July, 2021, abducted by suspected gunmen and are still in the hands of their abductors in what many described as the worst kidnapping of students in the state.\nEkene Adams, commiserated with the management of the school and parents of kidnapped students.\nEkene Adams while speaking, said, “I am here on behalf of the Speaker, Kaduna State House of Assembly, Rt.\nAbducted Bethel Baptist students doing well – Bandits confirm"
  },
  {
    "headline": "FIRS moves to recover N1.8trn from MultiChoice Group",
    "summarized_story": "The Federal Inland Revenue Service (FIRS) on Thursday said it is working with some commercial banks in Nigeria to recover the sum of N1.8 trillion from accounts of MultiChoice Nigeria Limited (MCN) And MultiChoice Africa (MCA).\nThis was contained in a statement issued and made available to DAILY POST on Thursday by the FIRS Chairman, Muhammad Nami.\nThe FIRS Chairman accused the companies of persistently breaching all agreements and undertakings with the service, stating that the group refused to respond to correspondences “and are not transparent as they deliberately refused to allow FIRS to access their important records”.\n“Particularly, MCN has avoided giving the FIRS accurate information on the number of its subscribers and income.\nHe lamented that some companies come into the country to “infringe on our tax laws by indulging in tax evasion."
  },
  {
    "headline": "PHOTOS: Mammoth crowd at TB Joshua’s lying-in-state",
    "summarized_story": "Many studies have established that at least 1 out of 4 couples today struggle with one infertility problem or another,..."
  },
  {
    "headline": "I don’t seek sexual validation, says Uti Nwachukwu",
    "summarized_story": "By Adeniyi AdewoyinTV personality and actor Uti Nwachukwu has said he doesn’t seek any form of sexual validation despite being called unprintable names by ex-partners.\nThe ex-BBAfrica winner said that while he had been called several unprintable names by some of his ex-girlfriends, he still maintains loving himself more.\nADVERTISEMENTUti noted that many people cannot deal with rejection therefore they try to project insecurities.\nI’ve been called a lot of names because of the way I’m in love with myself.\nContinuing, Uti said, “But the answer is simple – I conquered the desire to seek and ask for sexual and most types of validation a long time ago and that’s where self-love started from."
  },
  {
    "headline": "Dakore clinches new endorsement deal with Samsung",
    "summarized_story": "By Sampson UnamkaFilm star, Dakore Egbuson-Akande has clinched a new endorsement deal with Samsung Nigeria.\nDakore, it was gathered, will be working closely with the brand to use her star power in raising awareness for Samsung consumer electronics products and ultimately contribute to making Samsung the preferred brand in the West Africa sub-region.\n“The Samsung brand stands for quality, innovation, change, discovery, self-expression, and performance excellence.\nThese very same qualities are exemplified by Dakore whose quality and depth of work as well as versatility as an artist has endeared her to Nigerians today.\nWe are indeed very proud and privileged to have her as our brand ambassador,” Kim said."
  },
  {
    "headline": "Three die of cholera in Ebonyi community",
    "summarized_story": "By Ogochukwu Anioke, AbakalikiThree persons have died in an Ebonyi Community following recent outbreak of cholera, the state government has said.\nActing Commissioner for Health, Dr Richard Nnabu, stated this after a visit to the affected community, Amachi – Igwebuike village in Agba community, Ishielu local government area.\nRead Also: Cholera kills seven in FCTDr Nnabu maintained that the three deaths recorded were because of the the refusal of the patients to go to Hospital for treatment.\nSome residents of the community blamed the outbresk non availability of portable water.\nThey said they go as far as Onicha local government to get drinking water while those who can’t travel the long distance resort to drinking dirty pond water."
  },
  {
    "headline": "58 private jet owners report for Customs verification",
    "summarized_story": "From Uche Usim, AbujaThe Nigeria Customs Service NCS on Thursday disclosed that 58 private jet owners have come forward to have their airplanes verified in line with its new directive on ascertaining their status.\nThe Public Relations Officer of the NCS, Joseph Attah made the disclosures in Abuja at a media briefing.\nHe said that the Customs management has extended the private jet verification deadline to July 20, 2021.\nOn seizures, Attah noted that the Service between January to June 2021 effected 2,333 assorted seizures with duty paid value of N4,422,548,980.\nOn the private jets verification, the Customs Spokesman said that infractions discovered during the verification exercise so far include;breach of Temporary Importation agreement, non-appropriate payment of duty and taxes."
  },
  {
    "headline": "T.B Joshua’s remains arrives SCOAN",
    "summarized_story": "The body of Prophet Temitope Balogun Joshua, the founder of the Synagogue Church of All Nation (SCOAN) has arrived the church for Lying-in-state service.\nHis casket arrived the church on Thursday after the first lap of the service was held at the Prayer Mountain in Agodo-Egbe.\nThe casket in a motorcade arrived the headquarters in Ikotun-Egbe where the final lap of the Lying-in-State service will hold till 5pm.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Protest rocks Ibadan over DSS raid on Igboho’s residence",
    "summarized_story": "From Oluseye Ojo, IbadanYouth from different states in the South West geo-political zone, yesterday, stormed Ibadan, the Oyo State capital, in protest against the raid carried out by the Department of State Security (DSS) and other security agencies on the residence of a Yoruba activist, Chief Sunday Adeyemo, also known as Sunday Igboho.\nThe protest, which took off from the raided residence of Igboho was staged to Soka Junction, Challenge, Molete, and Olubadan palace, at Popoyemoja in Ibadan.\nThere was heavy traffic logjam in the axis passed through by the protesters in Ibadan.\nThey later stormed Oyo State Governor’s Office, Agodi, Ibadan, to conclude the protest.\nHe also told them to put their demands into writing and present the formal document to the state government for necessary actions."
  },
  {
    "headline": "2023: Zulum, northern group make case for South East, Middle Belt",
    "summarized_story": "From Fred Itua, AbujaGovernor Babagana Zulum of Borno State and the North Central Progressive Group (NCGP) have backed the Southern Governors’ Forum’s resolution on the zoning of the presidential seat to the region in 2023.\nHe was reacting to the outcome of Monday’s Southern Governors Forum meeting held in Lagos and its endorsement of rotation.\nIt also urged presidential aspirants who would be 60 years and above by 2023 to steer clear of the presidential quest in the region.\nWe are agitating for the Presidency to be zoned to North Central because our region is being marginalised.\n“If you check the record, since 1999 the presidency has been rotating between the South and North."
  },
  {
    "headline": "Pay less attention to IPOB leader, Kanu, deal with bandits, Boko Haram, Umar tells Buhari",
    "summarized_story": "Umar in a statement in Kaduna said: “Activities of those criminals have resulted in the evacuation of over 20 per cent of villages in North West and North East.\n“The recent rearrest of the IPOB leader, Mazi Nnamdi Kanu, was greeted with a loud sigh of relief and celebration in some sections of the country.\nThis is clearly an exaggeration of the security threat Nnamdi Kanu and indeed IPOB pose to our nation’s security and unity.\nMost economic activities, particularly farming, which is the mainstay of the people in these areas, are now all but impossible.\n“Government’s earlier claim of having technically defeated the Boko Haram insurgency in the North East has turned out to be empty propaganda."
  },
  {
    "headline": "Just In: Bandits Attack Another Kaduna Community, Abduct Many People",
    "summarized_story": "By John ShiklamAn unspecified number of people have been abducted in Anguwan Gimbiya, a suburb of Kaduna metropolis.\nThe incident has resulted in protest by hundreds of residents of the area who blocked the road along Sabon Tasha area of the metropolis.\nA resident of the community said the bandits stormed the community at about 11 pm on Wednesday, wielding sophisticated weapons and shooting sporadically.\n“There was nothing anybody could do because they were carrying very sophisticated weapons and they were many.\nOn Monday, bandits invaded Bethel Baptist High School, Damishi, Kaduna, and abducted 121 students who are still in captivity."
  },
  {
    "headline": "UNICEF Urges More Protection for Children, Schools, Says 950 Abducted",
    "summarized_story": "UNICEF, in a statement yesterday by its Executive Director, Ms. Henrietta Fore, lamented that no fewer than 950 students were abducted in Nigeria since December 2020.\nUNICEF said: “Meanwhile, in Nigeria, the UN estimates that at least 950 students have been abducted from their schools by armed men since December.\n“It is not enough to condemn these crimes, not when millions of children face a worsening protection crisis.\nThey also blamed the Kaduna State Governor, Mallam Nasir el-Rufai, for not doing enough to rescue kidnapped pupils.\nChairman, Christian Association of Nigeria (CAN), Kaduna State Chapter, Rev."
  },
  {
    "headline": "N’Assembly Increases Extra Budget By N86.9bn to N982.729bn",
    "summarized_story": "The Senate also approved the federal government’s request for $6.183 billion (N2.343 trillion) as external borrowing in 2021 Appropriation Act.\nMuktar Betara, increased the budget size to N982,729,695,343, representing an increase of N86.9 billion to Buhari’s proposal.\nBuhari, in a request letter dated May 18, 2021, and read at Senate plenary on June 2, 2021, had asked the Senate to approve N2.3 trillion external loan to fund the 2021 budget deficit.\nFG to fund N5.62tn deficit in 2022 budget with external loans.\nThe budget deficit that is projected for 2022 is N5.62 trillion, up from N5.60 trillion in 2021."
  },
  {
    "headline": "Insurgents, Bandits Pose Greater Threats Than Separatist Groups, Col. Umar Tells Buhari",
    "summarized_story": "Umar said bandits had abducted over 1,000 school children in the north in the past eight months, adding that over 300 others are still in captivity, with the bandits demanding humongous ransom payments.\nHe said, “The recent rearrest of the IPOB leader, Mazi Nnamdi Kanu, was greeted with a loud sigh of relief and celebration in some sections of the country.\n“This is clearly an exaggeration of the security threat Nnamdi Kanu and indeed IPOB pose to our nation’s security and unity”.\n“They won the 1979 Presidential election and enjoyed an enviable brotherly relationship as President and Vice President.\n“The apparent failure of our security forces to deal decisively, as the President so often commands them to do, with these security threats is obviously due to the acute shortage of manpower and equipment."
  },
  {
    "headline": "Adeosun: Court Judgment Vindicates Me, It’s Victory for Nigerians in Diaspora",
    "summarized_story": "Adeosun had resigned her appointment as Minister of Finance following controversy surrounding her NYSC status as she was accused of not participating in the mandatory one year national service for tertiary institution graduates.\nShe was also accused of presenting a forged NYSC discharged certificate.\nShe however instituted a suit against the Attorney General of the Federation on her eligibility for the National Youth Service Corps Scheme.\nIn a statement sent to THISDAY, the former minister said she was happy with official clarification by the court, adding that the judgment has vindicated her after a traumatic spell.\nIt is, however, not only a personal victory; it’s also a victory for many Nigerians in the Diaspora under similar conditions who are desirous to serve their country."
  },
  {
    "headline": "2023: How Buhari Undermined Tinubu Again, Continued To Weaken His Influence In All Progressives Congress Party",
    "summarized_story": "SaharaReporters gathered that the reluctance to announce national convention and choose national executives was to weaken the power and influence of Asiwaju in pushing for his candidates who would then begin more mobilisation for his yet-to-be-announced 2023 presidential ambition.\nThe development is already polarizing further the Buhari camp and the Tinubu camp in the APC, while other smaller camps have to take a stand between Buhari and Tinubu in the silent struggle.\n“The indefinite tenure exten­sion granted to the Caretaker/Extraordinary Convention Planning Committee of the APC is not going down well with us.\n“The president ap­proved the timetable for APC ward, local government and state congresses.\nWard con­gresses will hold 24th July, 2021 followed by local govern­ment congresses on 14th Au­gust, 2021 and state congresses on 18th September, 2021."
  },
  {
    "headline": "2023: How Buhari Undermined Tinubu Again, Continued To Weaken His Influence In All Progressives Congress Party",
    "summarized_story": "SaharaReporters gathered that the reluctance to announce national convention and choose national executives was to weaken the power and influence of Asiwaju in pushing for his candidates who would then begin more mobilisation for his yet-to-be-announced 2023 presidential ambition.\nThe development is already polarizing further the Buhari camp and the Tinubu camp in the APC, while other smaller camps have to take a stand between Buhari and Tinubu in the silent struggle.\n“The indefinite tenure exten­sion granted to the Caretaker/Extraordinary Convention Planning Committee of the APC is not going down well with us.\n“The president ap­proved the timetable for APC ward, local government and state congresses.\nWard con­gresses will hold 24th July, 2021 followed by local govern­ment congresses on 14th Au­gust, 2021 and state congresses on 18th September, 2021."
  },
  {
    "headline": "Nigeria Secret Police Arrest Blind Saxophonist For Wearing #BuhariMustGo T-Shirt",
    "summarized_story": "Samuel Gabriel IwatonaiyeA source revealed that “the blind gentleman was arrested for wearing #BuhariMustGo T-shirts.”“He is a saxophonist and was arrested at Dunamis.\nThe church security handed him over to the DSS after manhandling him,” the source added.\nSaharaReporters also learnt on Tuesday that the DSS admitted that the Dunamis church called them to take away the \"suspects.\"\n“Meanwhile, no one has heard from the activists since Sunday when church security attacked them and detained them on the church premises.\nSee Also Breaking News BREAKING: Nigeria's Secret Police Arrest Six Activists At Abuja Dunamis Church For Wearing #BuhariMustGo T-Shirts"
  },
  {
    "headline": "Nigeria Secret Police Arrest Blind Saxophonist For Wearing #BuhariMustGo T-Shirt",
    "summarized_story": "Samuel Gabriel IwatonaiyeA source revealed that “the blind gentleman was arrested for wearing #BuhariMustGo T-shirts.”“He is a saxophonist and was arrested at Dunamis.\nThe church security handed him over to the DSS after manhandling him,” the source added.\nSaharaReporters also learnt on Tuesday that the DSS admitted that the Dunamis church called them to take away the \"suspects.\"\n“Meanwhile, no one has heard from the activists since Sunday when church security attacked them and detained them on the church premises.\nSee Also Breaking News BREAKING: Nigeria's Secret Police Arrest Six Activists At Abuja Dunamis Church For Wearing #BuhariMustGo T-Shirts"
  },
  {
    "headline": "Borno Residents Share How Much Taxes, Levies Farmers, Fishermen, Others Now Pay To Boko Haram, ISWAP Terrorists",
    "summarized_story": "Boko Haram and Islamic State West African Province terrorists have been taxing residents of Marte, Abadam, Kukawa and Guzamala areas of Borno state for road use.\nYou know, it is not only Boko Haram, we now have ISWAP.\nTraders and farmers pay N5,000 monthly, while the fishermen pay N2,000 per bag and box of fish.\"\n“My own area, the people have been under Boko Haram and ISWAP and many other places for long, since the administration of Goodluck Jonathan and now under Buhari, they have been under Boko Haram.\nThough this is not only in Northern Borno but you see, Marte, Dikwa and the rest have been taken over completely by Boko Haram."
  },
  {
    "headline": "Senate panel begins screening of Lauretta Onochie as INEC commissioner nominee",
    "summarized_story": "The senate committee on Independent National Electoral Commission (INEC) has commenced the screening of Lauretta Onochie, a presidential aide.\nAdvertisementOnochie was nominated by President Muhammadu Buhari as an INEC commissioner.\nIn June, Senate President Ahmad Lawan directed the senate committee on INEC to screen Onochie — eight months after Buhari sent her name for confirmation.\nThe president sent his request for her confirmation in October 2020.\nAdvertisementOn Tuesday, some CSOs filed a lawsuit against Buhari over the nomination of Onochie."
  },
  {
    "headline": "Senate panel begins screening of Lauretta Onochie as INEC commissioner nominee",
    "summarized_story": "The senate committee on Independent National Electoral Commission (INEC) has commenced the screening of Lauretta Onochie, a presidential aide.\nAdvertisementOnochie was nominated by President Muhammadu Buhari as an INEC commissioner.\nIn June, Senate President Ahmad Lawan directed the senate committee on INEC to screen Onochie — eight months after Buhari sent her name for confirmation.\nThe president sent his request for her confirmation in October 2020.\nAdvertisementOn Tuesday, some CSOs filed a lawsuit against Buhari over the nomination of Onochie."
  },
  {
    "headline": "PHOTOS: TB Joshua's corpse arrives at Synagogue church",
    "summarized_story": "The corpse of TB Joshua, the late founder of the Synagogue Church of All Nations (SCOAN), has arrived at the church premises in the Ikotun area of Lagos state.\nOn Thursday, the remains of the deceased arrived at the church premises in line with the laying-in-state service organised in honour of the late founder.\nAdvertisementJoshua’s corpse was taken into the church through its fourth gate while escorted by a number of security operatives.\nBefore arriving the church premises, the corpse was taken to the church’s prayer ground in Ikotun.\nThe late founder of the church will be buried within the church premises on Friday."
  },
  {
    "headline": "PHOTOS: TB Joshua's corpse arrives at Synagogue church",
    "summarized_story": "The corpse of TB Joshua, the late founder of the Synagogue Church of All Nations (SCOAN), has arrived at the church premises in the Ikotun area of Lagos state.\nOn Thursday, the remains of the deceased arrived at the church premises in line with the laying-in-state service organised in honour of the late founder.\nAdvertisementJoshua’s corpse was taken into the church through its fourth gate while escorted by a number of security operatives.\nBefore arriving the church premises, the corpse was taken to the church’s prayer ground in Ikotun.\nThe late founder of the church will be buried within the church premises on Friday."
  },
  {
    "headline": "'Many' kidnapped as gunmen attack Kaduna community",
    "summarized_story": "Some residents have been abducted in Anguwan Gimbiya area of Kaduna state.\nAdvertisementA resident of the community who spoke with TheCable said the bandits, who came in large numbers, invaded the community around 11pm on Wednesday, with “sophisticated weapons”.\n“There was nothing anybody could do because they were carrying very sophisticated weapons and they were many,” the resident said.\nMohammed Jalige, spokesman of the Kaduna state police command, could not immediately confirm the incident when contacted but promised to get back with information.\nAdvertisementA total of 121 students of Bethel Baptist High School in Damishi, Chikun LGA of the state were abducted by gunmen in the early hours of Monday."
  },
  {
    "headline": "Nigeria’s Daystar Power secures $20 million from IFC",
    "summarized_story": "Daystar Power, a provider of hybrid solar power solutions to businesses in West Africa, has secured a facility of $20 million from the International Finance Corporation (IFC) to fund its project pipeline in Nigeria.\nFounded in 2017 by Sunrah Ventures, Daystar Power is an off-grid power service provider whose solutions, “Solar-as-a-Service” and “Power-as-a-Service” provide clean and reliable power while significantly reducing overall power costs for clients.\nDaystar Power will receive a $10 million local currency loan from IFC, which will be provided to its Nigerian subsidiary, Daybreak Power Solutions.\nDaystar Power is working with the Canadian-funded IFC program, Energy2Equal, to close gender gaps and increase women’s participation in the renewable energy sector.\nDaystar Power has 29 megawatts (MW) of installed solar power capacity to date."
  },
  {
    "headline": "Netflix and chill just got a whole lot cheaper for Africa",
    "summarized_story": "But what happens when the elephants in question are not two, but three of the biggest Subscription Video-On-Demand (SVOD) platforms in Africa!\nNextflix just announced a mobile-only subscription starting at $3.99— that’s more than half the price of its basic subscription plan.\nNetflix also launched a Play Partial Download feature that allows users to play Netflix videos which haven’t downloaded completely.\nNetflix’s streaming tussle in AfricaWhen Netflix arrived in Africa in 2016, everyone anticipated a struggle with reigning SVOD champion, iRokoTV, even though Netflix offered mostly foreign movies and while iRokoTV focused on Nollywood.\nBut not for long…Obviously, with the release of this cheaper plan, Netflix may come out on top in this SVOD race to corner the African market."
  },
  {
    "headline": "From iPhone shortages to price surges: The global chip scarcity is affecting Africa",
    "summarized_story": "Months into the shortage, effects from the ongoing global chip scarcity have spread far and wide, across industries and the globe.\nThe automobile industry is one of the hardest hit by the semiconductor shortage with carmakers across the world forced to slash production.\nIn fact, Taiwan is one of the four countries in Asia behind nearly three-quarters of global semiconductor manufacturing capacity.\nThe global semiconductor scarcity affects a staggering 169 industries in some way, according to Goldman Sachs.\nSo the global chip shortage has naturally led to price increases and there’s not so much local players can do about it."
  },
  {
    "headline": "What telcos and banks look for in fintech partnerships",
    "summarized_story": "Fintech is growing in Africa thanks to strategic partnerships between startups, banks and diverse categories of global companies.\nIn a distribution model, a digital-only bank (say Kuda) partners with traditional banks to offer in-branch deposits, ATM withdrawals and card issuance.\nBut partnerships don’t automatically work just because two parties have good intentions or similar ambitions.\nAs CEO of Sterling Bank, Suleiman receives partnership offers regularly and believes himself open to having many conversations.\nAnd so he wishes to encourage an approach that frames partnerships in terms of capabilities, not institutions."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Traffic tech in Lagos, Tix Africa’s pre-seed, Lydia’s $8.3m pre-Series A",
    "summarized_story": "Good day,Today, I’m discussing:Lagos State’s new tech for capturing traffic offendersTix Africa’s pre-seed fundingLydia’s $8.3m pre-Series BTracking traffic offenders in Lagos with techWhat’s happening?\nThe Lagos State Government plans to deploy Traffic Management Solution (TMS) devices to capture traffic offenders, expose corrupt government officials, and reduce gridlocks.\nTix Africa raises six-figure pre-seedNigerian self-service ticketing platform, Tix Africa, has closed an undisclosed six-figure pre-seed.\nWhat’s Tix Africa?\nThere’s more on Lydia’s $8.3 million funding hereIn case you missed itDaystar Power receives $20 million in funding to boost operations in West Africa."
  },
  {
    "headline": "Daystar Power receives $20 million in funding to boost operations in West Africa",
    "summarized_story": "Today, Nigeria-based hybrid renewable energy provider, Daystar Power, has received a $20 million investment from the International Finance Corporation(IFC), a subsidiary of the World Bank Group.\nThis follows an announcement made by IFC in April 2021 that they were considering giving a $20 million loan to Daystar Power.\nCurrently, Daystar Power provides solar power solutions to businesses in the commercial, industrial, and agricultural sectors and claims to offer a 30 per cent reduction in energy cost.\nThis combines solar power supply and battery storage, and clients can integrate this model into their existing power channels like an electrical grid or diesel/fuel generators.\nFounded in 2017 to reduce the cost of electricity and tackle the issue of epileptic power supply faced by businesses in Africa, Daystar Power has since expanded its operations."
  },
  {
    "headline": "Nigerian fintech, Lidya, raises $8.3m pre-Series B",
    "summarized_story": "Nigerian fintech, Lidya, has announced $8.3 million pre-Series B funding.\nPer TechCrunch, the funding round was led by Alitheia Capital and supported by others, including Bamboo Capital Partners and Accion Venture Lab.\nA year after Lidya launched, a seed fund of $1.5 million was announced followed by a $6.9 million Series A in 2018.\nThe startup also announced that co-founder, Ercin Eksin has left the startup to begin other projects, leaving Kehinde as sole CEO.\nWhile Lidya said its Series A funding in 2018 will be used to enter new African markets, it is only present in Nigeria and has revealed no intentions of expanding with its pre-Series B raise."
  },
  {
    "headline": "Close to 50,000 contributors tap N25bn pension over economic hardship",
    "summarized_story": "As the Nigerian economy bites hard with increasing hardship following the impacts of COVID-19 pandemic, people are losing their jobs and increasingly tapping into their pension’s savings for survival.\nFrom first quarter 2020 to first quarter 2021, about 48,873 Retirement Savings Account (RSA) holders have accessed N25.321 billion of their pension savings to survive.\n“Where a Retirement Savings Account (RSA) holder is temporarily unemployed before the retirement age (i.e.\nIn 2020 quarter two, N2.56 billion was paid to 4,668 RSA holders; 2020 quarter three N8.10 billion was paid to 13,569 RSA holders; 2020 quarter-four N5.33 billion was paid to 11, 796, and in the first quarter of 2021, N5.021 billion was paid to 10,619 RSA holders.\nNotwithstanding the provision of subsection (2) of this Section, employees of organisations with less than three employees as well as self-employed persons shall be entitled to participate under the scheme in accordance with guidelines issued by the micro pension scheme."
  },
  {
    "headline": "Nigerian airlines increase fleet, eye AfCFTA’s ‘open skies’",
    "summarized_story": "Nigerian airlines are preparing to take advantage of the ‘open skies’ policy of the African Continental Free Trade Area (AfCFTA) agreement, as they make plans to commence flight operations into African destinations.\nOne of the objectives of AfCFTA is to create a single market for goods and services facilitated by the movement of persons in…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigerian investors sit on N282bn as start-ups seek growth capital",
    "summarized_story": "If given the option to either invest in Nigeria’s growing start-ups or leave their cash idle, many investors in Africa’s largest economy will overlook the potential of the young companies and choose the latter.\nThis can be confirmed from the analysis of the June 30 Treasury Bills (T-Bills) auction result by the Central Bank of…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Edo residents laud Obaseki on devt of Edo Modular Refinery – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAs Edo readies for the Edo Modular Refinery in Ologbo, Ikpoba-Okha Local Government Area to begin operations, residents have lauded Governor Godwin Obaseki for the development and speedy completion of the project.\nAccording to him, “Edo people are elated and optimistic that the Edo Modular Refinery being pursued by the Governor Godwin Obaseki-led administration has become a reality as the refinery is ready to begin operations.\nOsagie noted, “We thank Governor Obaseki for putting Edo people at the forefront of every project embarked upon by his administration.\nThe youths of Edo State are specifically elated over this project because of its impact on the youth population.\n“The Edo Modular Refinery, which is expected to begin operations soonest will create legitimate employment opportunities thereby reducing poverty."
  },
  {
    "headline": "APC has Failed the Country – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The PDP Minority caucus of the National Assembly has described the APC government as a failure, insisting it has failed Nigerians on all fronts.\nThe Joint minority caucus comprising lawmakers from the Senate and House of Representatives Tuesday addressed the media on the outcome of the meeting of Southern governors.\nMinority Leader of the House of Representatives, Hon.\nThe caucus insisted on the five percent percentage sharing as passed in the House of Representatives as against three percent in the Senate.\nThe group also stand the with the Southern governors on insisting Nigeria’s next President be from the southern part of the country."
  },
  {
    "headline": "Edo govt retrains helpline centre operators to boost emergency response – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said it will continue to improve the capacity of call agents in the Edo Helpline Centre with up-to-date skills to boost response to emergencies in the state.\nExecutive Director, Edo State Skills Development Agency (EdoJobs), Ukinebo Dare, in a chat with journalists, said the focus of the agency is to equip the call centre agents with the requisite skills needed to provide Edo residents with efficient and quality service.\n“Our call agents regularly undergo training and retraining, which are geared towards equipping them with the required skills needed to provide Edo residents with optimum service,” she noted.\nAccording to her, the state government recently held computer appreciation training for staff of Edo Helpline Centre to bring them up to speed with updated Microsoft packages for efficient service delivery in emergency response.\nDare further urged residents in the state to take advantage of the Centre by calling any of the Edo Helplines on 08000911911 and 08001235111, for prompt response..."
  },
  {
    "headline": "EDSOGPADEC to commence work on 105.6km Benin-Abraka Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Oil and Gas Producing Areas Development Commission (EDSOGPADEC) has concluded plans to ensure contractors return to site to continue work on the reconstruction of the 105.6km Benin-Abraka Road.\nThe reconstruction of the project was initiated by the Governor Godwin Obaseki-led administration through a tripartite deal between the state government, EDSOGPADEC and the Niger Delta Development Commission (NDDC).\nPermanent Secretary of EDSOGPADEC, James Ufumwen, confirmed that the commission had, in a recent meeting, reached a decision to commence work on the reconstruction project.\nAccording to him, “We are going to commence the reconstruction project.\nA resident in Aifuwa Street, Benin City, Mrs. Dorothy Asemota, commended the decision of EDSOGPADEC to commence reconstruction work on the road, noting that it would address the hardship faced by people who ply the road from villages on the axis to the city center."
  },
  {
    "headline": "Nigerian govt accuses Multichoice of N1.8 trillion tax fraud, moves to freeze accounts",
    "summarized_story": "The Federal Inland Revenue Service (FIRS) has engaged some commercial banks as agents to freeze and recover N1.8 trillion from accounts of MultiChoice Nigeria Limited And MultiChoice Africa.\nThe service said it discovered that the companies persistently breached all agreements and undertakings with the Service.\nThe service added that the groups’ performance did not reflect in their tax obligations and compliance level in the country.\n“Regrettably, Companies come into Nigeria just to infringe on our tax laws by indulging in tax evasion.\n“Information currently at the disposal of FIRS has revealed a tax liability for relevant years of assessment for ₦1.8 trillion and 342.5 million dollars."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Bandits attack Kaduna community, many reportedly kidnapped",
    "summarized_story": "Bandits on Wednesday night, invaded Anguwan Gimbiya area of Kaduna State and kidnapped many residents.\nA resident of the community told TheCable said the bandits, who came in large numbers, invaded the community around 11pm on Wednesday, with “sophisticated weapons”.\n“There was nothing anybody could do because they were carrying very sophisticated weapons and they were many,” the resident told the medium.\n“We don’t know the number of people that were kidnapped yet, but many people were taken away.”Hundreds of residents have taken to the streets to protest the abductions, blocking the road along Sabon Tasha area of the Kaduna metropolis.\nMohammed Jalige, spokesman of the Kaduna state police command, could not immediately confirm the incident when contacted but promised to get back with information."
  },
  {
    "headline": "Imo govt explains how it recovered 43 oil wells from Rivers",
    "summarized_story": "The government of Imo State has given more insights into how it was able to recover 43 oil wells from Rivers State, noting that the recovery will boost state’s revenue.\nThe government which spoke on the recovery yesterday, named the areas it recovered the 43 oil wells to include, 22 recovered from Mgbede Field in Egbema, Ohaji/Egbema Local Government Area and 21 oil wells from the Akri Field in Oguta Local Government Area in ImoThe Senior Special Adviser to Governor Hope Uzodinma on Public Enlightenment, Stamford Nwokedi, who made the clarifications to newsmen in Owerri, said that with the development, that Imo has taken a stronger position in the Niger Delta Development Commission (NDDC).\nAccording to Nwokedi, the “22 oil wells were recovered from the Mgbede Field in Egbema, Ohaji/Egbema Local Government Area, and 21 oil wells from the Akri Field in Oguta Local government area, with these 43 recovered Imo Oil Wells, Imo State is now the 4th largest oil producing State.\n“We were before now a fringe member of the Niger Delta Development Commission.\nImo State is now an assertive 4th in the rung; an authoritative member of the NDDC And every other month from now to perpetuity, much more revenue comes into Imo coffers.”"
  },
  {
    "headline": "FG to freeze MultiChoice bank accounts over N1.8 trillion tax debt",
    "summarized_story": "Nigeria’s Federal Inland Revenue Service (FIRS) says it has begun moves to freeze MultiChoice bank accounts over N1.8 trillion tax debt.\nThe agency said it had engaged banks as agents to freeze and recover N1.8 trillion from accounts of MultiChoice Nigeria Limited (MCN) And MultiChoice Africa (MCA).\nThis is contained in a statement issued by Abdullahi Ahmad, Director, Communications and Liaison Department of FIRS in Abuja on Thursday.\n“Regrettably, Companies come into Nigeria just to infringe on our tax laws by indulging in tax evasion.\n“Information currently at the disposal of FIRS has revealed a tax liability for relevant years of assessment for ₦1.8 trillion and $342.5 million."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "VIDEO: HOW TO VOTE ON FIRSTBANK-SPONSORED THE VOICE NIGERIA SEASON 3",
    "summarized_story": "VIDEO: HOW TO VOTE ON FIRSTBANK-SPONSORED THE VOICE NIGERIA SEASON 3"
  },
  {
    "headline": "VIDEO: HOW TO VOTE ON FIRSTBANK-SPONSORED THE VOICE NIGERIA SEASON 3",
    "summarized_story": "VIDEO: HOW TO VOTE ON FIRSTBANK-SPONSORED THE VOICE NIGERIA SEASON 3"
  },
  {
    "headline": "UNICEF raises alarm over abduction of 950 pupils from schools in six months",
    "summarized_story": "No fewer than 950 pupils have been abducted from their schools by gunmen in the last six months, the United Nations Children’s Fund (UNICEF) said on Wednesday.\nThe United Nations (UN) agency expressed concern about the attacks and abduction of children in some parts of West and Central Africa.\nThe UNICEF urged stakeholders in the education sector to unite at reducing children’s vulnerability and increasing their resilience to keep pupils safe from harm.\n“Meanwhile in Nigeria, the UN estimates that at least 950 students have been abducted from their schools by armed men since December.\n“Over the past six weeks alone, nearly 500 children were abducted in four separate incidents across the central and northwest parts of the country."
  },
  {
    "headline": "UNICEF raises alarm over abduction of 950 pupils from schools in six months",
    "summarized_story": "No fewer than 950 pupils have been abducted from their schools by gunmen in the last six months, the United Nations Children’s Fund (UNICEF) said on Wednesday.\nThe United Nations (UN) agency expressed concern about the attacks and abduction of children in some parts of West and Central Africa.\nThe UNICEF urged stakeholders in the education sector to unite at reducing children’s vulnerability and increasing their resilience to keep pupils safe from harm.\n“Meanwhile in Nigeria, the UN estimates that at least 950 students have been abducted from their schools by armed men since December.\n“Over the past six weeks alone, nearly 500 children were abducted in four separate incidents across the central and northwest parts of the country."
  },
  {
    "headline": "Photos: TB Joshua’s casket arrives Synagogue Church for lying-in-state",
    "summarized_story": "By Taiwo OkanlawonThe body of Prophet Temitope Balogun Joshua, the founder of the Synagogue Church of All Nation (SCOAN) has arrived the church for Lying-in-state service.\nHis casket arrived the church on Thursday after the first lap of the service was held at the Prayer Mountain in Agodo-Egbe.\nThe casket in a motorcade arrived the headquarters in Ikotun-Egbe where the final lap of the Lying-in-State service will hold till 5pm.\nCheck pictures below."
  },
  {
    "headline": "PDP begins door-to-door campaign in Lagos",
    "summarized_story": "By Joan OdafeThe Peoples Democratic Party (PDP) says it has started a door-to-door campaign in Amuwo-Odofin Local Government Area as a build-up to the July 24 council polls in Lagos State.\nPDP’s chairmanship candidate, Mr Adedayo Adesoye said that the campaign became necessary to sensitise voters on the importance of selecting the best candidates.\n“The mode of our rallies, the mode of our door-to-door outreaches, has never been done in the history of PDP in Amuwo-Odofin.\nAdesoye said another strategy used by the ICO to create awareness was to include the date of the election in the party’s campaign posters.\n“At the last election, out of the 135,000 registered voters, the current chairman had just 4,667 votes; that’s about 3per cent,’’ he said."
  },
  {
    "headline": "Olubadan denies collecting N50m bounty on Sunday Igboho",
    "summarized_story": "By Muhaimin OlowoporokuThe Olubadan of Ibadan, Oba Saliu Adetunji, has debunked reports that he was paid a sum of N50 million to aid the arrest of Yoruba Nation agitator, Sunday Igboho.\nMr. Adeola Oloko, the media aide of the Olubadan of Ibadan debunked the news after Wednesday’s protest by Ibadan Youths to vent their anger on the raid by security operatives on Igboho’s house.\n“I want to seize this opportunity to inform the public that Kabiesi did not collect a dime from anybody.\nSunday Igboho is a Yoruba man, he lives in Ibadan, so he is a son of Kabiesi Olubadan, and we are duty-bound to protect him.\nSunday Igboho whose Soka residence in Ibadan was raided on Thursday managed to escape the raid by operatives of the Department of State Service (DSS)."
  },
  {
    "headline": "JUST IN: TB Joshua’s Body Arrives Synagogue Church For Lying-In-State (Photos)",
    "summarized_story": "The remains of the Founder of the Synagogue Church of all Nations (SCOAN), Prophet TB Joshua on Thursday arrived at the church premises in the Ikotun-Egbe area of Lagos for lying-in-state.\nThe popular televangelist, who died on June 5, is scheduled for burial on Friday, July 9 at the church premises."
  },
  {
    "headline": "SSS Killed Igboho’s Relatives In Line With Buhari Shoot-On-Sight Order – Garba",
    "summarized_story": "The State Security Service (SSS) killing of Sunday Igboho’s relatives is in line with President Muhammadu Buhari’s shoot-on-sight order, says the Presidency.\nOn Thursday, the SSS stormed the home of Mr Igboho, an agitator for the realisation of a sovereign Yoruba nation, killing two of his relatives.\nHowever, activists and lawyers faulted the directive, saying Nigeria is not a jungle where security operatives shoot anyone with arms.\nIn January, Peoples Gazette reported how Mr Buhari endorsed lethal force against Sunday Igboho and his supporters.\nHe has, however, received medical attention and is very stable,” said the SSS,” said the security agency."
  },
  {
    "headline": "Yoruba Nation: Gani Adams Says Sunday Igboho’s Methods Are Wrong (Video)",
    "summarized_story": "The Aare Onakakanfo of Yoruba Land, Chief Gani Adams, has stated that majority of the tactics used by the self-proclaimed Yoruba Nation’s actualization fighter, Sunday Igboho, are incorrect.\nHe did, however, call on Obas, governors, and Yoruba leaders to unite around Sunday Igboho and spare him from being slain.\nHis words: “I beg the Ooni of Ife, the Alake of Egba and all other Yoruba leaders.\n“Our youths, let’s be coordinated, let’s be strategic,” Gani Adams said, saying he stands with Yoruba Nation.\nAdams promised to stand with Sunday Igboho, the same way some Yoruba leaders stood up for him during his ordeal in 2001."
  },
  {
    "headline": "Cholera Outbreak: 14 Killed, 953 Cases Recorded In Nigeria",
    "summarized_story": "In Nigeria’s current cholera outbreak, 14 people have died, with 953 cases reported in Plateau.\n910 of those infected have been discharged, while 29 remain in various health facilities across the state.\nHe claimed that the sickness, which had previously been reported in Jos North, had spread to 13 local government areas, necessitating intervention by the National Center for Disease Control (NCDC).\n“The largest number of cholera cases are in Jos North, with 484 cases, followed by Jos South and Bassa local governments, with 307 and 57 cases, respectively,” Mr Lar stated.\n“In terms of COVID-19 instances, the state has tested 73,177 persons to date, with confirmed cases of 9,068, discharged 9,008, and 57 deaths,” he stated."
  },
  {
    "headline": "Pictures: Dignitaries grace late prophet TB Joshua’s lying-in-state",
    "summarized_story": "NextNigeria committed to implementation of MoU with The Gambia-Defence minister"
  },
  {
    "headline": "Pictures: Former Real Madrid Captain, Sergio Ramos, joins PSG on a two-year deal",
    "summarized_story": "NextNAF alerts public on fake admission into its college of Nursing"
  },
  {
    "headline": "Pictures: ‘Fake’ Police Assistant Commissionner nabbed in Kano",
    "summarized_story": ""
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "Alleged Fraud: Court Grants Bail To Ex-JAMB Registrar Professor Ojerinde",
    "summarized_story": "Justice Obiora Egwuatu of the Federal High Court in Abuja has granted bail to the former Registrar of the Joint Admissions and Matriculation Board (JAMB), Professor Adedibu Ojerinde.\nThe bail granted was in the sum of 200 million naira (N200,000,000) and two sureties in like sum, who also must be resident in the Federal Capital Territory (FCT).\nAccording to Justice Egwuatu, one of the sureties must be a professor in a Federal University, and the other, a property owner in Abuja.\nWhile adjourning the case to the 22nd of July for trial, the judge ordered that the former registrar deposits his international passport with the court.\nIn a statement posted on the commission’s website, Ojerinde was arrested and is being held on a remand warrant."
  },
  {
    "headline": "1,130 Looted Nigerian Artefacts Would Be Returned In 2022, Says Germany",
    "summarized_story": "German Minister of State for Culture, Monika Grutters has disclosed that 1,130 artefacts would be returned to Nigeria from the beginning of 2022.\nGrutters said this on Wednesday during a meeting with the Minister of Information and Culture, Alhaji Lai Mohammed in Berlin, Germany.\nThis was contained in a statement issued on Thursday by the Special Assistant to the Minister of Information and Culture, Segun Adeyemi.\nMohammed at the meeting earlier demanded a full and unconditional return of the 1,130 Benin Bronzes that were looted from the African nation in the 19th century and domiciled in German museums.\nAlhaji Mohammed thanked the Government of Germany for taking the lead in the global efforts to repatriate all artefacts that were looted from Nigeria and indeed from the African continent."
  },
  {
    "headline": "NYSC Should Be Extended To Two Years, Members Should Undergo Military Training, Says Ishaku",
    "summarized_story": "﻿Taraba State Governor, Darius Ishaku, says that as part of the country’s efforts to combat insecurity, the National Youth Service Corps (NYSC) should be extended to two years, and members be allowed to undergo military.\nThe governor who was a guest on Channels Television’s Politics Today on Wednesday, also said the scheme should be extended to two years with the first involving core military training.\nNYSC which runs for a year was designed by the Nigerian government in 1973 to encourage nation-building among graduates.\nNigeria has been experiencing a series of security threats ranging from terrorism, banditry, militancy, cultism among others in several parts of the country.\nThe country has been battling terrorism for more than a decade with thousands killed and hundreds of others displaced."
  },
  {
    "headline": "Senate Approves Buhari’s $6.1bn Foreign Loan Request",
    "summarized_story": "The Senate has approved the Federal Government’s request for a $6.1 billion (N2.343 trillion) loan request.\nThe Senate gave the approval on Wednesday after it considered a report from its Committee on Local and Foreign Debt which it earlier directed to work on the loan request.\nREAD ALSO: Senate Passes N895.842bn Supplementary BudgetPresident Muhammadu Buhari had earlier in May asked the National Assembly to approve the loan request, saying it would be raised from multilateral and bilateral tenders as well as the international capital market.\nThe Committee recommended that the Senate approves Buhari’s request for the issuance of $3,000,000,000 but not more than $6,183,081,643.40 Eurobond in the International Capital Market.\nThe Committee also recommended that the Senate should approve that the amount authorised may be raised from multiple sources such as the International Capital Market and any other Multilateral or Bilateral sources as may be available."
  },
  {
    "headline": "South Africa’s Zuma Eligible For Parole In Under Four Months",
    "summarized_story": "South Africa’s former president Jacob Zuma, who on Thursday began a 15-month sentence for contempt, will be eligible to be released on parole in just under four months, the authorities said.\nUnder the country’s correctional regulations, “the former president will be eligible for parole once a quarter of his sentence has been served,” Justice Minister Ronald Ramola told reporters.\nZuma “will be afforded dignity throughout his term of incarceration,” he said, speaking in front of Estcourt prison in KwaZulu-Natal province.\nZuma handed himself in overnight to the police to begin serving the sentence at the jail, which is located in a small farming town.\nThe sentence was handed down by the Constitutional Court on June 29 after Zuma refused an order to appear before anti-graft investigators."
  },
  {
    "headline": "Court grants N200m bail to fmr JAMB Registrar Adedibu Ojerinde",
    "summarized_story": "The Federal High Court sitting in Abuja has granted bail to a former Registrar of Joint Admissions and Matriculation Board, Adedibu Ojerinde.\nThe court granted him bail in the sum of N200 million with two sureties in like sum.\nOne surety must be a professor in a Federal University and the other must be a property owner in Abuja.\nThe court also ordered that Mr. Ojerinde must deposit his passport with the court registrar.\nAdvertisementMr. Ojerinde is accused by the ICPC of diversion of public funds estimated at over N5.2billion."
  },
  {
    "headline": "Spanish defender Sergio Ramos joins Paris Saint-Germain",
    "summarized_story": "Paris Saint-Germain has confirmed the signing of Sergio Ramos from Real Madrid.\nThe Ligue 1 club said that the 35-year-old Spanish defender will wear the number 4 shirt.\nFor me, it’s a privilege to be able to wear this number at such a great team, Paris Saint-Germain.\nSo I must be very special to be able to wear my number here in Paris,” Ramos concluded.\nRamos also scored 101 goals in 671 games for the Spanish giants in all competitions."
  },
  {
    "headline": "Breaking: Court grants bail to ex-JAMB Registrar, Adedibu Ojerinde",
    "summarized_story": "The Federal High Court sitting in Abuja has granted bail to a former Registrar of Joint Admissions and Matriculation Board, Adedibu Ojerinde.\nThe court granted him bail in the sum of N200 million with two sureties in like sum.\none surety must be a professor in a Federal University and the other must be a property owner in Abuja.\nThe court also ordered that Mr Ojerinde must deposit his passport with the court registrar.\nAdvertisementMr Ojerinde is accused by the ICPC of diversion of public funds estimated at over N5.2billion."
  },
  {
    "headline": "Tears, Prayers Mark End to Search for Miami Condo Survivors",
    "summarized_story": "A sombre moment of silence marked the end of the two-week search for survivors of a Florida condominium collapse, as rescue workers stood at solemn attention and clergy members hugged a line of local officials while many of them sobbed.\nRescuers had spent two weeks digging through the rubble, searching in vain for any sign of life, Levine Cava said.\nHope of finding survivors was briefly rekindled after workers demolished the remainder of the building, allowing rescuers access to new areas of debris.\nSome of t ose voids did exist, mostly in the basement and the parking garage, but no survivors emerged.\nAfter initially hoping for miraculous rescues, families had slowly braced themselves for the news that their relatives did not survive."
  },
  {
    "headline": "Police Kill Four after Haiti President Moise Assassinated",
    "summarized_story": "Mr Moïse, 53, was fatally shot and his wife was injured when attackers stormed their home early on Wednesday.\nMr Moïse was killed, but First Lady Martine Moïse survived and has been flown to Florida where she is receiving treatment.\nMr Moïse became president of Haiti in 2017, but in recent times faced widespread protests demanding his resignation.\nAddressing the nation, Mr Joseph vowed the killers would be brought to justice and said the security situation was “under control”.\nMr Joseph said that “all measures have been taken to ensure continuity” and that “democracy and the republic will win”."
  },
  {
    "headline": "Nigeria: Oil Majors Back Petroleum Bill, Seek Speedy Assent",
    "summarized_story": "International Oil Companies (IOCs) operating in Nigeria on Wednesday rallied behind the Petroleum Industry Bill (PIB) passed by the National Assembly last week, describing it as a watershed in the annals of the oil and gas industry in the country.\n“Just having this law finally bodes well for the industry and we all need to congratulate those who have played their own part.\nAnd also, the bill will take care of the plethora of taxes we are faced with,” he said.\nAccording to him, the bill, when assented, will ensure transparency in the running of the industry and have a positive impact on the host communities.\nWhat was laid before the National Assembly is five per cent of actual operators’ expenses in the preceding year."
  },
  {
    "headline": "Euro 2020: England Reaches First Major Final in 55 Years After Beating Denmark",
    "summarized_story": "Harry Kane netted an extra-time goal as England beat Denmark 2-1 to advance to the 2020 European Championship final against Italy.\nIn the first period of extra time, Kane knocked in the rebound after Denmark’s Kasper Schmeichel had saved his initial spot-kick attempt to give England the lead and earn them a berth in the Euro final.\nEngland came in as favourites to win the Euro from the remaining teams, but Denmark took a surprise lead near the 30-minute mark when youngster Mikkel Damsgaard hit a perfect free kick from distance past Jordan Pickford to make it 1-0.\nThe goal, Kane’s fourth thus far at the 2020 Euro, puts him level with Gary Lineker for most goals in England’s major tournament history with 10.\nEngland, who are in their first major tournament final since beating West Germany at the 1966 World Cup showcase, now face an Italy side that have won all of their matches thus far in the Euro final at Wembley on Sunday."
  },
  {
    "headline": "Hurkacz Stuns Federer in Straight Sets to Reach Wimbledon Semi-finals",
    "summarized_story": "World No 18 Hubert Hurkacz produced an inspired performance to end Roger Federer’s quest for a ninth Wimbledon title and landmark 21st Grand Slam crown with a straight-sets victory on Centre Court.\nIn front of a sell-out crowd on the storied arena Federer has presided over since his first title in 2003, Hurkacz excelled firing down 36 winners and make just 12 unforced errors in a 6-3 7-6 6-0 victory – the biggest triumph of his young career.\nBut for Hurkacz, playing in a Grand Slam quarter-final for the first time in his career against Federer’s 53rd and 18th at Wimbledon alone, the title dream remains alive after dismantling his illustrious opponent and childhood idol.\nFederer has more Grand Slam titles than Hurkacz has Grand Slam appearances, but the 24-year-old Pole, playing in his first major quarter-final, was undaunted by the legend stood on the opposite side of the arena as he produced a fearless display to run out a comfortable winner.\nHurkacz will face either Matteo Berrettini or Felix Auger-Aliassime in the last four, while Federer can only look on as Novak Djokovic now stands just two wins away from joining him and Rafael Nadal on 20 Grand Slam titles after his routine win over Martin Fucsovics earlier in the day."
  }
]