[
  {
    "headline": "One killed, five injured in Abuja auto crash",
    "summarized_story": "One person was on Saturday confirmed dead while five others sustained varying degrees of injury in a multiple auto crash in Abuja.\nThe accident was said to have occurred close to AA Rano filling station along the Kubwa-Abuja Expressway around 11 pm on Friday.\nThe crash, it was gathered, involved 19 vehicles and a heavy duty truck.\nThe Federal Road Safety Corps spokesperson, Bisi Kazeem, said 20 persons and 19 vehicles were involved in the accident.\nThe injured persons and the dead had been taken to Zankili Hospital, Utako before the arrival of the officials at the accident scene.”Copyright PUNCH."
  },
  {
    "headline": "El-Rufai appoints new Kaduna peace commission boss",
    "summarized_story": "Governor Nasir El-Rufai has appointed Dr Saleh Momale as the Executive Vice-Chairman of Kaduna State Peace Commission, with Mrs Rebecca Sako-John as Permanent Commissioner.\nIt said that the state Peace Commission, chaired by Most Reverend Dr Josiah Idowu-Fearon, Secretary-General of the Anglican Communion and former Archbishop of Kaduna, was established in 2017.\nAdekeye further said that ‘’after four years of distinguished service, Priscilla Ankut, the pioneer Executive Vice Chairman of the Kaduna State Peace Commission, is taking up new responsibilities with the African Union’’.\nThe statement said that El-Rufai has expressed the government’s gratitude for Priscilla’s contribution to the advancement of peace and harmony in the state.\nThe government and people of Kaduna State wish her every success”."
  },
  {
    "headline": "Nigeria at 61: Jonathan charges citizens to be optimistic of the future",
    "summarized_story": "Former President Dr Goodluck Ebele Jonathan has urged Nigerians to be optimistic about the future of the country, despite the challenges currently being faced by citizens.\nJonathan encouraged the nation’s leaders and the citizens to rededicate ourselves to the virtues of equity, justice and tolerance and strive to give their best for the good of the nation.\n“Ours is a country blessed with numerous opportunities and prospects as well as great citizens, engaging diversity and versatility.\nLet us remain optimistic, for the challenges of this time will redound to a glorious fortune for us and generations yet to come.\n“Happy Independence Anniversary.”"
  },
  {
    "headline": "Police nab suspect with 340 rounds of AK-47 live ammunition in Delta",
    "summarized_story": "The Police Command in Delta has arrested one Solomon Ebe over alleged possession of 340 rounds of AK-47 live ammunition concealed inside bag of garri.\nEdafe said that the suspect was apprehended on Friday by the patrol team of the Bomadi Police Division.\n“Upon search, 340 rounds of AK-47 live ammunition hidden inside the garri were recovered.\nThe police spokesman said that the suspect was arrested on Wednesday by the operatives attached to the Command’s Raider Squad.\n“On Sept. 29, at about 0300hrs, acting on credible information, Operatives attached to the Command’s Raider Squad raided Utuloho Street, Ozoro in Isoko North."
  },
  {
    "headline": "FRCN inaugurates 10kw transmitter at Globe FM Bauchi",
    "summarized_story": "The Federal Radio Corporation of Nigeria (FRCN) has inaugurated a 10kw transmitter at Globe FM, Bauchi.\nOn his part, Mr Sabo Askira, FRCN Director of Engineering Services, said the Federal Government has fulfilled its earlier promise to install a transmitter in Globe FM Bauchi.\n“The Federal Government approved the supply and installation of 10kw transmitters to 12 FM stations across the country.\n“Plans are on the way to install the same 10kw transmitters in three other FM stations, to boost broadcast and compete favorably with mega stations in the country.\nEarlier, the contractor, Mr Muhammad Merhi, who is of COMSAN Nigeria Limited, explained that the 10kw transmitter was very sophisticated and the latest in the industry."
  },
  {
    "headline": "Olonisakin commends Nigeria’s unity in Diaspora",
    "summarized_story": "The remark was contained in his speech delivered on the occasion of Nigeria’s 61st Independence anniversary celebration.\nOlonisakin expressed gratitude to the government of Cameroon, particularly the President, His Excellency, Paul Biya, describing him as a strong pillar of the good relationship between the two countries.\n“Every country, just like every individual, has a shared responsibility towards ensuring the health, peace and prosperity of our world.\n“Our National Day celebration always elicits great feelings both at home and particularly for those of us in the diaspora in all parts of the world.\nIt is the day that underscores our resolve for national identity as Nigerians, irrespective of our ethnic, religious or other affiliations."
  },
  {
    "headline": "El-Rufai appoints Momale as new Kaduna Peace Commission boss",
    "summarized_story": "Governor Nasir El-RufaiGovernor Nasir El-Rufai has appointed Dr Saleh Momale as the Executive Vice-Chairman of Kaduna State Peace Commission, with Mrs Rebecca Sako-John as Permanent Commissioner.\nIt said that the state Peace Commission, chaired by Most Reverend Dr Josiah Idowu-Fearon, Secretary-General of the Anglican Communion and former Archbishop of Kaduna, was established in 2017.\n‘’At inception, the government named Priscilla Ankut as Executive Vice Chairman/Chief Executive Officer, and Dr Momale and Khadijah Hawaja Gambo as pioneer permanent commissioners,’’ he said.\nAdekeye further said that ‘’after four years of distinguished service, Priscilla Ankut, the pioneer Executive Vice Chairman of the Kaduna State Peace Commission, is taking up new responsibilities with the African Union’’.\nThe government and people of Kaduna State wish her every success”."
  },
  {
    "headline": "Military taskforce torturing, arresting us illegally – Plateau community cries out",
    "summarized_story": "The residents said it was important they cry out because of how the military invaded their villages and illegally arrested Hon.\nDavou Nyango, former Secretary of the Local Government in the wee hours of Monday 13, September, 2021, and has been detained since then.\nHe added that the incident has left both the victim and the community physically and emotionally traumatised.\nLogyang said the community has pledged to work cordially with the military, adding that all military actions must be in accordance to constitutional and military extant law.\nThe military said he has been released having not found culpable in the crime allegation against him."
  },
  {
    "headline": "Tinubu gives update on health as northern lawmakers visit him in London",
    "summarized_story": "The National Leader of the All Progressives Congress (APC), Bola Tinubu, has said he is healthy and only undergoing physiotherapy in London, UK.\nTinubu said this as he welcomed members of the House of Representatives northern caucus on Friday.\nThe former governor of Lagos State, who has been in the UK for the last three months since undergoing knee surgery, however, admitted he was undergoing “gruesome” physiotherapy.\nHe said, “Because of God and people like you, I am well.\nHis prolonged stay abroad has drawn criticism from a section of Nigerians who believe he ought to have stayed in the country to receive treatment."
  },
  {
    "headline": "Troops foil ISWAP attack on repentant Boko Haram families in Borno",
    "summarized_story": "The Nigerian military thwarted an attempt by the Islamist State’s West Africa Province (ISWAP) to attack a camp of repentant Boko Haram members in Borno.\nTroops pushed back insurgents as they moved towards their targeted location in Damboa Local Government Area.\nThe fighters stormed Damboa town in a convoy of gun trucks Saturday evening, sources told PRNigeria.\n“The camp is where hundreds of repentant Boko Haram members have been staying since they renounced terrorism,” an officer said.\nThe intelligence disclosed that forces were deployed to face the ISWAP marauders after a distress call."
  },
  {
    "headline": "Ondo, Ekiti residents groan over deplorable Akure/Ado highway",
    "summarized_story": "Residents of Ondo and Ekiti states have berated both the Federal Government and the governments of both states over the deplorable condition of the highway linking both states.\nAccording to motorists and other road users of the highway, the governments had been paying lip service to the reconstruction of the road with nothing significant happening.\nThe highway, which has continued to give motorists and residents nightmares, connects the capital city of both states, Akure and Ado-Ekiti.\nThe road user, Titilayo Ogendengbe, stressed that taxis always tried to avoid plying the axis because of the road while the few ones doing it increased the fare.\n“To me, it is a mystery that a road in the state capital would be left unattended to like this."
  },
  {
    "headline": "Kaduna govt begins enforcement of motorcycle ban, tricycle restriction",
    "summarized_story": "The Kaduna State Government on Saturday began the enforcement of the ban on motorcycles and restrictions of tricycles from 6 am to 7 pm.\nRecall that the state government had banned the use of motorcycles for commercial purposes, or riding to work, and also placed restrictions on tricycles.\nThe government said the order which takes effect from September 30, 2021, was to curtail the activities of bandits.\nThe enforcement on the ban of motorcycles for transportation or commercial purposes applies to everyone, including law enforcement agents who ride their motorcycles to their various places of work.\nMany passengers, workers were seeing stranded as the number of buses, tricycles plying the road were insufficient for passengers."
  },
  {
    "headline": "I’m healthy, only undergoing therapy, Tinubu tells northern lawmakers",
    "summarized_story": "By Oluwatomisin Amokeoja- Advertisement -National Leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, has described his health condition as perfect.\nTinubu made the declaration yesterday when he received members of the northern caucus of the House of Representatives in London.\nHis personal statement followed months of speculations about his health condition, which his media aide and allies addressed after visiting him and declaring him hale and hearty.\nThe former Lagos State governor told the members of the northern caucus of the House of Representatives that he was in good health but only undergoing physiotherapy in London after a surgery in the leg.\n“Because of God and people like you, I am well,” he told the visitors."
  },
  {
    "headline": "COVID-19: Get vaccinated rather than live in fear, doubt – Adeboye",
    "summarized_story": "By Alao Abiodun- Advertisement -The General Overseer of the Redeemed Christian Church of God (RCCG), Pastor Enoch Adeboye, has said will get vaccinated against the Coronavirus (COVID-19) for the sake of preaching the gospel globally.\nAdeboye stated this at the church’s monthly Holy Ghost convention monitored by The Nation.\nSome prominent preachers such as Bishop David Oyedepo, Pastor Chris Oyakhilome and Dr Joshua Suleman have kicked against vaccination.\nBut Adeboye said: “I never said to you ‘don’t be vaccinated’, you have never heard that from me,“Rather than living in fear or doubt, get vaccinated.\n“If vaccination is going to hinder me from doing the work that God has called me to do, if they ask me to get vaccinated 10 times, I would be vaccinated.”"
  },
  {
    "headline": "Gunmen abduct permanent secretary in Niger",
    "summarized_story": "A family source told our correspondent that the gunmen gained access into the house by breaking down the gate to abduct the Permanent Secretary who was relaxing after the celebration.\nHe, however, said the state government would do its best to ensure that the Permanent Secretary was rescued unhurt.\nThe Niger state Police Public Relations Officer, DSP Abiodun Wasiu could not be reached as at the time of filing this story.\nConfirming Musa’s abduction, Niger State governor, Alhaji Abubakar Sani Bello, condemned the incident, describing the act as evil and inhuman.\nGovernor Bello said the state government would do its best to rescue the Permanent Secretary from the hands of his abductors."
  },
  {
    "headline": "Incessant attacks: Killings in S’East senseless –IPOB",
    "summarized_story": "From Aloysius Attah, OnitshaFor the umpteenth time, the Indigenous People of Biafra (IPOB) has washed its hands off incessant killings in the Southeast.\nThe pro-Biafra group in a statement issued by its Media and Publicity Secretary, Emma Powerful, condemned the unending unprovoked attacks.\nIPOB has no hands in the senseless attacks going on in our territory.\nWe are freedom seekers and we remain peaceful in our pursuit for freedom of Biafra,” IPOB said.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "BREAKING: Many feared missing as jetty collapses in Rivers",
    "summarized_story": "From Tony John, Port HarcourtA landing jetty at Isaka in Okrika Local Government Area in Rivers State has collapsed, with about twenty passengers believed to have drowned.\nThe Sun has learned that over 80 people were on the jetty, causing pressure on the old, rickety facility.\nIt was further learnt that when the jetty caved in all the passengers on it fell into the river.\n‘On that process, the jetty caved and so many people fell into the river and they were not able to be rescued.\n‘The jetty is an old jetty."
  },
  {
    "headline": "Abducted Kogi Ex-Provost COETK, Oshadumo dies during rescue operation",
    "summarized_story": "From Emmanuel Adeyemi, LokojaThe pioneer Provost, College of Education Technical Kabba, Chief Julius Oshadumo who was abducted 10 days ago at a church service in Kabba Kogi State is said to have been killed during a rescue operation.\nThe Ex Provost however was said to have died when vigilantes attempted to rescue him and others abducted in a forest around Ogori.\nThe other person abducted was however said to have been rescued but injured and is receiving treatment in a medical facility.\nThe Spokesman of the Nigerian Police, DSP William Ayah was however unable to confirm the incident as at press time.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "BREAKING: Abducted two star general regains freedom",
    "summarized_story": "), who was abducted on Monday in the Ajah area of Lagos State, has regained freedom, The Sun has learnt.\nIt was learnt that the retired two star general was released in the early hours of Saturday.\nThe gunmen were said to have whisked him away in a waiting speedboat, after which they sped off.\nAccording to an SOS voice note shared by his driver, Corporal Odiji, the retired AVM engaged in a struggle with the gunmen before he was subdued.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "NECA DG, Olawale, slumps and dies in Abuja – The Sun Nigeria",
    "summarized_story": "Get paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars.\nClick here to apply today.\nBimbola OyesolaThe Director General of the Nigerian Employers Consultative Association (NECA) Timothy Olawale slumped and died in Abuja last night.According to a top management staff of NECA, Olawale, who was in Abuja for a meeting with the board of the Industrial Training Fund (ITF) in the course of the meeting.The NECA DG attended a meeting on Thursday in Abuja and later attended another meeting on Friday and was on his seat when he could not get up and before help could get to him, he was gone.Olawale was confirmed as the substantive Director General of the employers body in January 2019, after six months in acting capacity.He took over from Mr. Segun Oshinowo, who retired in December, 2018 after serving the Association for 19 years as Director General."
  },
  {
    "headline": "Wike Warns Jonathan against Falling for APC’s Enticement",
    "summarized_story": "*Says ruling party aiming to destroy ex-president with weird baitBennet OghifoGovernor Nyesom Wike of Rivers State yesterday urged former President Goodluck Jonathan to remain in the Peoples Democratic Party (PDP) and resist the temptation of joining the All Progressives Congress (APC).\nWike warned Jonathan not to be enticed by moves by the APC to lure reputable members of the PDP, adding that the ruling party is offering nothing but destruction.\n“If I see the former President, I will tell him what I heard.\nI will tell him, ‘Don’t go anywhere because these people want to destroy your reputation.\nSome APC chieftains had visited him in recent times, raising the stakes in permutations for the 2023 general elections."
  },
  {
    "headline": "Sanusi: Nigeria Throwing Away Millions of Dollars in the Scam Called Subsidy",
    "summarized_story": "Speaking on Arise News Channel, the former governor of the Central Bank of Nigeria also described as an assumption, the notion that Nigeria is an oil rich country.\nSanusi declared: “This has always been a big joke for me and we also talk about the fuel subsidy.\nWe are throwing away millions of dollars in this scam called subsidy.\nWhen you talk about the oil industry, for example, if you eliminate fuel subsidy, you eliminate fraud worth billions and millions of dollars.\nAnd that is why at the end of the exercise, you end up as Nigeria… presented with two useless candidates."
  },
  {
    "headline": "Nigeria Posts OPEC’s Biggest Output Gain in September",
    "summarized_story": "The group’s top producers further eased supply curbs in September under a pact with its allies known as OPEC+, revealed a survey by Reuters.\nAccording to the survey, OPEC pumped 27.31 million barrels per day (bpd) last September, up 420,000 bpd from August’s revised estimate.\nThe biggest rise in September was from Nigeria, where output rose by 170,000 bpd after Forcados force majeure and other problems in August were eased.\nEven so, Nigeria is pumping almost 100,000 bpd less than its OPEC target as under-investment restrains output.\nThe OPEC+ agreement allows for a 400,000 bpd production increase in September from all members, of which 253,000 bpd is shared by the 10 OPEC members covered by the deal."
  },
  {
    "headline": "Okonjo-Iweala: Hearsays about My Interest in Presidency ‘Utterly Ridiculous’",
    "summarized_story": "Charles AjunwaThe Director General of the World Trade Organisation (WTO), Ngozi Okonjo-Iweala, says she is not interested in contesting the 2023 presidential election, describing the speculation as “utterly ridiculous and not true.”Bloomberg News had yesterday quoted “some Geneva trade officials” as saying that they suspect Okonjo-Iweala wanted to run in the 2023 presidential election in her native country of Nigeria.\nThis rumoured presidential ambition is coming after an earlier report about the Nigerian former finance minister’s alleged threats to resign as Director General of the WTO.\nBut yesterday, in a statement to Bloomberg News, Okonjo-Iweala denied any interest in running for the Nigerian presidency.\nEarlier, she had reacted to the rumour that she was mulling the possibility of resigning her WTO job barely seven months into her 4 1/2-year term.\nThe New York-based medium quoted five trade officials in Geneva who declined to be identified."
  },
  {
    "headline": "Nigeria’s 61st Independence Anniversary in Photographs",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "REVEALED: Face Of Boko Haram, ISWAP Operational Commander Who Masterminded Killing Of Nigerian Soldiers, Civilians",
    "summarized_story": "A picture of the dreaded commandant of the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād in Borno State, Abubakar Dan-Buduma, has been released.\nHe is said to have killed so many Nigerian soldiers and civilians during different attacks by the terrorist group.\nUnconfirmed report has it that Dan-Buduma was recently arrested by the Nigerian Army in Sambisa forest, Borno State.\nSee Also Boko Haram ISWAP-Boko Haram Reshuffles 'Cabinet', Imposes Levies On Agricultural, Trade Activities In Nigerian CommunitiesISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nThe terror group has caused over 50,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "REVEALED: Face Of Boko Haram, ISWAP Operational Commander Who Masterminded Killing Of Nigerian Soldiers, Civilians",
    "summarized_story": "A picture of the dreaded commandant of the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP), formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād in Borno State, Abubakar Dan-Buduma, has been released.\nHe is said to have killed so many Nigerian soldiers and civilians during different attacks by the terrorist group.\nUnconfirmed report has it that Dan-Buduma was recently arrested by the Nigerian Army in Sambisa forest, Borno State.\nSee Also Boko Haram ISWAP-Boko Haram Reshuffles 'Cabinet', Imposes Levies On Agricultural, Trade Activities In Nigerian CommunitiesISWAP, which split from the mainstream Boko Haram in 2016, has become a dominant group, focusing on military targets and high-profile attacks, including against aid workers.\nThe terror group has caused over 50,000 deaths and displaced millions of individuals mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "BREAKING: Bandits Burn 10 Alive, Slaughter 15 Others In Niger State Community",
    "summarized_story": "Gunmen suspected to be bandits have burnt 10 people alive in the Kachiwe community in Sarkin Pawa Ward of the Munya Local Government Area of Niger State.\nThe gunmen also abducted about seven women during the attack.\nThe Secretary of Munya Local Government Area, James Jagaba, narrated the ordeal which he described as ‘an ugly incident’.\nHe said, “The bandits set all the houses ablaze, burnt 10 people alive, abducted seven women and slaughtered the others.\nIn the process, three of the abducted women escaped and the bandits went with the other seven women."
  },
  {
    "headline": "BREAKING: Bandits Burn 10 Alive, Slaughter 15 Others In Niger State Community",
    "summarized_story": "Gunmen suspected to be bandits have burnt 10 people alive in the Kachiwe community in Sarkin Pawa Ward of the Munya Local Government Area of Niger State.\nThe gunmen also abducted about seven women during the attack.\nThe Secretary of Munya Local Government Area, James Jagaba, narrated the ordeal which he described as ‘an ugly incident’.\nHe said, “The bandits set all the houses ablaze, burnt 10 people alive, abducted seven women and slaughtered the others.\nIn the process, three of the abducted women escaped and the bandits went with the other seven women."
  },
  {
    "headline": "Anambra Loses N19.6billion During Any Sit-at-home Day – Governorship Candidate, Soludo Laments",
    "summarized_story": "A former Central Bank Governor and candidate of the All Progressives Grand Alliance (APGA) in the forthcoming governorship elections in Anambra State, Prof. Chukwuma Soludo, has said the state loses N19.6billion every day that it is locked down.\nSoludo stated this at an enlarged meeting with Anambra State Elders and Stakeholders Forum, and Forum of Heads of Broadcast Media Stations in Anambra State.\n“Anambra State economy loses an estimated sum of N19.6billion every time the sit-at-home directive is enforced in the state.\nThat is why we are calling on those responsible to stop because we are hurting ourselves,” Soludo said.\nProfessor Soludo while calling on Ndi Anambra to be watchful, praised Governor Willie Obiano for what he called outstanding achievements."
  },
  {
    "headline": "Police arrest bandit kingpin 'behind series of attacks' in Zamfara",
    "summarized_story": "Ayuba Elkanah, commissioner of police in Zamfara, says the command has arrested one Bello Rugga, a notorious bandits’ commander.\nAdvertisementElkanah disclosed this on Saturday while parading the suspected crime kingpin alongside 21 other suspected bandits and their collaborators in Gusau.\nHe said five other bandits were killed during a raid in Gummi LGA of the state.\n“Rugga was in charge of Gummi, Gidan Bita, Malanjara and Kagara forest in Gummi LGA of the state.\nHe said the bandits killed during the operation were behind many attacks in different parts of the state, especially the Zamfara West senatorial district."
  },
  {
    "headline": "Police arrest bandit kingpin 'behind series of attacks' in Zamfara",
    "summarized_story": "Ayuba Elkanah, commissioner of police in Zamfara, says the command has arrested one Bello Rugga, a notorious bandits’ commander.\nAdvertisementElkanah disclosed this on Saturday while parading the suspected crime kingpin alongside 21 other suspected bandits and their collaborators in Gusau.\nHe said five other bandits were killed during a raid in Gummi LGA of the state.\n“Rugga was in charge of Gummi, Gidan Bita, Malanjara and Kagara forest in Gummi LGA of the state.\nHe said the bandits killed during the operation were behind many attacks in different parts of the state, especially the Zamfara West senatorial district."
  },
  {
    "headline": "Buhari to speak at second inauguration of Ethiopian prime minister",
    "summarized_story": "President Muhammadu Buhari will on Monday attend the inauguration ceremony of Abiy Ahmed, Ethiopian prime minister.\nPresident Buhari will deliver a goodwill message at the inauguration ceremony, says the presidency.\n“President Buhari will be accompanied by the Minister of Foreign Affairs, Geoffrey Onyeama, and the Director-General of the National Intelligence Agency (NIA), Ambassador Ahmed Rufai Abubakar.\nAdvertisement“Prime Minister Ahmed secured another term in office following the victory of Ethiopia’s governing Prosperity Party in the country’s parliamentary election of June 21.\n“In his earlier congratulatory message to the Prime Minister, President Buhari had assured that Nigeria will continue to support the unity and territorial well-being of Ethiopia and all African States.”The president is expected back in the country on Tuesday."
  },
  {
    "headline": "Buhari to speak at second inauguration of Ethiopian prime minister",
    "summarized_story": "President Muhammadu Buhari will on Monday attend the inauguration ceremony of Abiy Ahmed, Ethiopian prime minister.\nPresident Buhari will deliver a goodwill message at the inauguration ceremony, says the presidency.\n“President Buhari will be accompanied by the Minister of Foreign Affairs, Geoffrey Onyeama, and the Director-General of the National Intelligence Agency (NIA), Ambassador Ahmed Rufai Abubakar.\nAdvertisement“Prime Minister Ahmed secured another term in office following the victory of Ethiopia’s governing Prosperity Party in the country’s parliamentary election of June 21.\n“In his earlier congratulatory message to the Prime Minister, President Buhari had assured that Nigeria will continue to support the unity and territorial well-being of Ethiopia and all African States.”The president is expected back in the country on Tuesday."
  },
  {
    "headline": "Sikiru Smith, abducted air vice marshal, released after 5 days in captivity",
    "summarized_story": "Sikiru Smith, a retired air vice marshal, who was kidnapped in Lagos state, has been released.\nAdvertisementTheCable had reported that the retired air vice-marshal was kidnapped on Monday in the Ajah axis of the state.\nAdvertisementThe driver of the retired air vice marshal, identified as Corporal Odiji, was the one who raised the alarm via an SOS voice note.\nI am Corporal Odiji attached to air vice marshal smith.\nI was near where I was fixing my boss’ vehicle.”AdvertisementOn Saturday, Adekunle Ajisebutu, the Lagos state police spokesperson, in a telephone conversation with TheCable, said the retired air vice marshal was released in the early hours of Saturday."
  },
  {
    "headline": "Twitter ban in Nigeria to be lifted if certain conditions are met",
    "summarized_story": "Buhari listed these conditions during a broadcast to mark Nigeria’s 61st Independence anniversary on Friday, October 1.\nThe Nigerian government suspended Twitter’s operations in June, following the social media platform’s decision to delete a tweet by Buhari, which it said breached the site’s rules.\nThe state’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits; and national assembly hearings meant to probe the circumstances leading to the ban.\n“The ban on Twitter will soon be lifted as we are getting close to reaching full agreement,” the minister said.\nHowever, the Buhari administration has always been keen on regulating social media and internet-based broadcasting companies."
  },
  {
    "headline": "Kola Aina appointed chair of new board at Lagos Angel Network",
    "summarized_story": "The Lagos Angel Network (LAN) has appointed a new Board of Governors (BoG) to oversee its affairs, effective from today October 1, 2021.\nLAN has also birthed several Angel groups such as Rising Tide Africa (RTA), South South-East Angels Network (SSEAN), Abuja Angels Network (AAN), and the Diaspora Angels Network (DAN).\n“We’ve seen the Lagos startup ecosystem grow significantly bigger than when we started LAN 10 years ago and need to do more.\nWe’ve seen what’s possible, and now it’s time to take Angel investing in Nigeria to the next level,” Sulaiman adds.\n“I want to thank the founding LAN Board whose achievements cannot be overstated, and their legacy is visible for all to see,” Aina says."
  },
  {
    "headline": "iOS 15 review: new features make iPhone a more powerful device",
    "summarized_story": "Apple released the iOS 15 on September 20, 2021, and it’s a super-smart operating system.\nUnlike the flashy update that happened from iOS 6 to iOS 7, iOS 15 debuts with subtle updates that form a more significant upgrade of iOS 14. iOS 15 is the perfect example of being loud without screaming: the new operating system improves your overall experience without altering your phone visually.\niOS 15 Focus mode lets you filter notifications based on your current engagement.\nBut iOS 15 gives you control by gathering your notifications in one place where you can view them at your own convenience.\nWith iOS 15, there’s a tool that lets you have different font sizes for different apps on your phone."
  },
  {
    "headline": "What can Nigerians do on the new eNaira website?",
    "summarized_story": "The website of Nigeria’s official digital currency, eNaira, went live on Monday, four days before its planned launch on October 1, as disclosed by Central Bank governor, Godwin Emefiele.\nA welcome note on the website describes the eNaira as a “Central Bank of Nigeria-issued digital currency that provides a unique form of money denominated in Naira.”The website is a central repository where users can find comprehensive information about the official digital currency, but it offers much more than just details of the eNaira.\nDownload the eNaira applicationThe eNaira app (termed “Speed”) can be downloaded from either the Google PlayStore, Apple App Store, or by scanning a QR code on the website.\nJoin the eNaira communityThe community is a social hub where, according to a note on the website, eNaira users across the globe can connect with one another, share their experiences using the digital currency, offer as well as request help.\nThe eNaira website is loaded with very important information and instructions as well as answers to potential questions in the FAQ section."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "#TwitterBan update: Should you worry if Twitter succumbs to Nigerian government’s demands?",
    "summarized_story": "Share this article:Again, Nigerians have been promised the lifting of the four-month-long Twitter ban.\nRecall that in early June 2021, the Nigerian government indefinitely suspended Twitter after the platform removed a Tweet by the president for violating its rules.\nTo that end, it is awaiting a response on three final requests made to the social media platform, which are registration, physical presence in Nigeria, and fair taxation.\nAfter all, it appears to be what the social media company would have agreed to before establishing an office in any country.\nTrue to this, the country is one of the African countries without any case of Internet censorship or government-influenced social media censorship."
  },
  {
    "headline": "Startup Acts: Can the decade’s sexiest law save Nigeria’s thriving but uncertain startup ecosystem?",
    "summarized_story": "Share this article:With Nigeria’s Startup Bill scheduled to be submitted in October 2021, @eruskkii spotlights the impact of startup acts in Africa, why Nigeria may never be ready for it and why the country needs one regardless.\nLoginJoin Now This is premium content, reserved for Pre-seed, Seed, and Series A members only.\nEmmanuel Paul Senior Reporter at Techpoint Africa | Website Writer and Narrator.\nTech, business and policy analysis is my daily bread.\nCatch up with me, @eruskkii, on Twitter or send a mail to emmanuel@techpoint.africaShare this article:"
  },
  {
    "headline": "More on NFTs, MIT’s prosthetic limbs project, Facebook’s Internet connectivity plan",
    "summarized_story": "Today I’m discussing:More on NFTsMIT’s 3D-printed prosthetic limbs in Sierra Leone2Africa Cable and Internet connectivityMore on NFTsNon-fungible tokens (NFTs) are digital assets that represent physical objects such as art, music, in-game items, and videos.\nAdvertisementAlthough they have been around since 2014, NFTs are gaining popularity as a popular way to buy and sell digital artwork.\nAccording to Facebook, when they are completed, the extension will make 2Africa the world’s longest subsea cable system.\nIn May 2020, Facebook announced plans to build a $1 billion undersea Internet cable for faster Internet access in Africa.\nFor context on Subsea Internet Cables in Africa, please, read: Subsea Internet cables and the race to connect Africa to the InternetWhat I’m reading and watchingGoogle Maps is making it easier to see wildfires and tree coverage."
  },
  {
    "headline": "Land prices to rise on new government’s housing, infrastructure programmes",
    "summarized_story": "This projected price increase, the report adds, will happen mostly in locations with major construction projects and transportation infrastructure.\nMeanwhile, investor interest coming from local real estate investors and developers is currently on the rise at Eko Atlantic City, a world-class city rising from land reclaimed from the Atlantic Ocean, adjacent to Victoria Island in Lagos.\nContinuing, Edumoh reveals, “We are the first purely indigenous company doing development in Eko Atlantic City.\nLand price in the city remains a guarded secret as the promoters, South Energyx Nigeria, says it can only be made available to genuine buyers.\nEven at $1,250 per square metre it was sold a few years ago, Eko Atlantic City land remains the most expensive in Lagos."
  },
  {
    "headline": "SoftBank: A Japanese company betting on Nigeria-based startups",
    "summarized_story": "Japanese companies have a reputation for being huge manufacturing corporations owned by cohesive families with a large retinue of employees working with fierce devotion.\n“We would like to be the capital provider for the information revolution.\nThe Japanese billionaire explained he will begin co-investing in Vision Fund 2, an investment vehicle where SoftBank has been the sole source of capital.\nToday, the “information revolution (is) in full bloom,” according to Son, who said artificial intelligence, is a particular area of focus for SoftBank.\n“In the information revolution, AI will be the one replacing machinery,” he said."
  },
  {
    "headline": "2023: Akpabio, Wike jovial sparks reveal underlining currents and re-alignments",
    "summarized_story": "Governor Wike even said he had never attended NDDC event, but he did this time.\nUncommon banters: Akpabio vs WikeAkpabio: I will not join in urging Governor Wike to join our party.\nBut, the same person later in his remarks, though still joking, urged Governor Wike to cross over.\nIn his speech, the Rivers State Governor NyesomEzenwo Wike berated the NDDC for taking about eleven years to complete the SPU Base 6 housing projects.\nAccording to Governor Wike, it is however, not surprising because NDDC projects, often, are abandoned due to poor conceptualisation, their political nature, and absence of commensurate provision of fund."
  },
  {
    "headline": "JCI honours Alenkhe – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY: Junior Chambers International (JCI), Edo Bronze has bestowed the award of “Personality of the Month of September” on Ace reporter and Crime Correspondent of Edo Broadcasting Service ((EBS), Comrade Festus Alenkhe.\nIn her address at the event which held in Benin City, President of JCI, Edo Bronze, Eson Blessing said that the choice of was informed by his achievements in various endeavours, including, various positions, where he held leadership position.\nHe listed such endevours to include, Edo State Chairman of the Nigeria Red Cross Society and state Chairman of National Youth Council of Nigeria.\nAccording to her, the choice of Alenkhe was widely embraced by members of the JCI, charging the him not to rest on his oars even as he march on to greater heights.\nResponding, Comrade Alenkhe thanked the JCI for the award, which he said would spur him to more commitment in whatever he does."
  },
  {
    "headline": "Edo PDP meets, harmonises ahead of National Convention – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Chapter of the Peoples Democratic Party (PDP) at the weekend held an enlarged stakeholders meeting for harmonization ahead of the party’s National Convention slated to hold at the end of October 2021.\nThe meeting, which was held at New Festival Hall in Government House, Benin City, was attended by the Edo State Governor, Mr. Godwin Obaseki, his deputy, Rt.\nComrade Philip Shaibu, and other top party leaders in the state.\nSpeaking to journalists after the meeting, Obaseki noted, “PDP is organising its convention at the end of October and this meeting is to prepare us for the convention.\nWe want to ensure that we provide the services that we promised our people during the electioneering."
  },
  {
    "headline": "Obaseki, Shaibu, others pay tribute to late Edward Agbonifo, extol exemplary virtues – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Saturday led other top government functionaries to pay last tribute to late Dr. Edward Agbonifo, husband of the Chairman, Pentecostal Fellowship of Nigeria, Edo State Chapter and vision-bearer of Family Intercessory Ministries, Pastor (Mrs.) Margaret Agbonifo.\nOsaigbovo Iyoha and Speaker, Edo State House of Assembly (EDHA), Rt.\nObaseki described the late Agbonifo as a true Edo man and unique Christian who dedicated his life to the service of God and humanity.\nHere is an African and a Nigerian man who didn’t feel threatened by the success of his wife.\nEarlier, the wife of the deceased described the late Agbonifo as her editor, English teacher and project director who was never threatened by her success but was rather proud of it."
  },
  {
    "headline": "Suspected Armed Robber Burnt To Death By Irate Mob In Delta – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – A middle aged man suspected to be an armed robber on Thursday night met his waterloo when he was burnt to death by an irate mob along Jakpa Road, Uvwie council area of Delta state.\nNIGERIAN OBSERVER learnt that the deceased suspect was part of a four-man gang that had earlier snatched a tricycle otherwise known as Keke Napep from an unidentified individual at gunpoint.\nThe suspect was said to have alighted from the tricycle around the spot, but on sighting some vigilante members, took to his heels.\nRecall that a similar incident that saw a member of a suspected armed robbery gang operating in a Keke Napep lynched, occurred within the area in June.\n“But unfortunately before the police got there a mob had already overpowered the vigilante and set him ablaze."
  },
  {
    "headline": "Police arrest man with 340 rounds of AK-47 ammunition, woman with double-barrel gun",
    "summarized_story": "ADVERTISEMENTThe police command in Delta State has arrested one Solomon Ebe over alleged possession of 340 rounds of AK-47 live ammunition concealed inside a bag of garri.\nThe Police Public Relations Officer (PPRO) of the command, Bright Edafe, disclosed this in a statement on Saturday in Warri.\n“Upon search, 340 rounds of AK-47 live ammunition hidden inside the garri were recovered.\nThe police spokesman said that the suspect was arrested on Wednesday by the operatives attached to the Command’s Raider Squad.\n“On Sept. 29, at about 0300hrs, acting on credible information, Operatives attached to the Command’s Raider Squad raided Utuloho Street, Ozoro in Isoko North."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Boko Haram takes over 500 communities in Niger State – Official",
    "summarized_story": "Chairman of Shiroro LGA in Niger State, Suleiman Chukuba, has said over 500 communities in his LGA have been taken over by Boko Haram terrorists.\nChukuba who spoke to journalists on Friday, also said that over eight wards in the LGA are now under Boko Haram siege.\n“Shiroro local government has an uncountable number of Boko Haram fighters.\n“I have the proof being that I am the executive chairman, the chief security officer of the local government.\nWhen they go to the various communities, what they tell them is that ‘We don’t want primary, secondary schools."
  },
  {
    "headline": "Osun LG chair, Adeniyi celebrates birthday with less privileged, gives free PMS to motorcyclists",
    "summarized_story": "By Sunday Oguntuyi, OsogboIfelodun North Local Council Development Area (LCDA) Chairman in Osun State, Prince Adeniyi Olaniyan celebrated his birthday this year with the less privileged in the council area.\nThe birthday celebration which was ushered in with prayers at his residence in Osogbo, had league of Islamic scholars leading the prayer, while family and friends, political associates and well wishers joined the prayer chain.\nFree PMS was distributed to over 100 motorcyclists at Moshadek Filling station as part of the birthday celebration and effort to identify with the people.\nOlaniyan while speaking said, the gesture is to thank his creature for witnessing another year on earth and also to identified with the less privileged.\nHe said his core mandate is to put smile on the people’s faces, particularly those that find it difficult to cope with the declining economy."
  },
  {
    "headline": "Osun contributory pensioners stage peaceful protest to press home demands",
    "summarized_story": "By Sunday Oguntuyi OsogboA group of pensioners under the Contributory Pension Scheme in Osun State on Thursday staged a peaceful protest in Osogbo, demanding payment of their retirement benefits.\nThe pensioners who walked through Freedom Park, Osogbo, to the premises of state House of Assembly, where they were received by the Speaker, Timothy Owoeye, displayed large banner where their seven-point demand was written.\nThey added that they had faced hardship over the non-payment of their entitlements.\nSpeaking with Journalist after the protest, the leader of the group, George Animasaun, said, “We want government to increase monthly allocation to contributory pensioners from the current N150m to N500m.\nIf that is done, we will not have to wait for too long after retirement before our benefits will be paid."
  },
  {
    "headline": "Help, our homes submerged in water – Eti-Osa community cries out to Sanwo-Olu",
    "summarized_story": "OBINNA EZUGWUConcerned residents of Lagos State domiciled within Eti-Osa Local Government, particularly Coastal area, have written a save our soul letter to the state governor, Mr. Babajide Sanwo-Olu over an ocean surge that has submerged several houses in the area.\nOladotun Hassan, Co-Convener and Secretary, Legal Affairs, said more than 1000 families have been displaced, while businesses have perished and houses submerged under the ocean water.\nThey said Communities around Lafiaji Community, Okun Ajah Community, Okun Mopo Community, and many more are currently endangered, and could be swept off if nothing urgently is done to stop the ongoing Ocean Surge in the community.\n“Your Excellency Sir, we are concerned citizens of Lagos State domiciled within Eti-Osa Local Government, particularly Coastal areas and affected communities around Okun Alfa axis(Alfa Beach) and its environs respectively,” the letter read.\n“As we speak, more than 1000 families are displaced, businesses perished and houses have been submerged under the ocean waters; Communities around Lafiaji Community, Okun Ajah Community, Okun Mopo Community, and many more are currently endangered and could be swept off if nothing urgently is done to avert the ongoing Ocean Surge in the community."
  },
  {
    "headline": "Ini Ememobong Foundation Donates School Uniforms To 965 Students",
    "summarized_story": "The Ini Ememobong Foundation in collaboration with the Rotary Club of Uyo Metropolis, Akwa Ibom State, has donated over 800 school uniforms to students and several new fabrics to teachers of Union Secondary School in Ibiaku, Ibiono Ibom local aovernment area of the state.\nThe donation, which took place Thursday, September 30, 2021, at the school premises, had students and teachers expressing excitement as they took turns to collect their new set of ready-made school uniforms, while thier teachers went home with several new fabrics.\nEmemobong, who is also the President of Rotary Club of Uyo Metropolis, “This gesture is in support of what the State Governor Mr. Udom Emmanuel is doing in the education sector.\nGovernment can not do it alone, therefore, people must rise to the occasion, and Rotary Club International realised that a long time ago and rose to the occasion globally.\nHe said the Scholarship Award was instituted to help train people who would serve as qualified conflict managers, in order to restore peace in areas where their services would be most needed."
  },
  {
    "headline": "Ini Ememobong Foundation Donates School Uniforms To 965 Students",
    "summarized_story": "The Ini Ememobong Foundation in collaboration with the Rotary Club of Uyo Metropolis, Akwa Ibom State, has donated over 800 school uniforms to students and several new fabrics to teachers of Union Secondary School in Ibiaku, Ibiono Ibom local aovernment area of the state.\nThe donation, which took place Thursday, September 30, 2021, at the school premises, had students and teachers expressing excitement as they took turns to collect their new set of ready-made school uniforms, while thier teachers went home with several new fabrics.\nEmemobong, who is also the President of Rotary Club of Uyo Metropolis, “This gesture is in support of what the State Governor Mr. Udom Emmanuel is doing in the education sector.\nGovernment can not do it alone, therefore, people must rise to the occasion, and Rotary Club International realised that a long time ago and rose to the occasion globally.\nHe said the Scholarship Award was instituted to help train people who would serve as qualified conflict managers, in order to restore peace in areas where their services would be most needed."
  },
  {
    "headline": "2023: Benue APC Guber Aspirants Meet Akume",
    "summarized_story": "Gubernatorial aspirants from Vandeikya under the auspices of the JKP Initiative have held talks with the leader of the All Progressives Congress (APC) in Benue State and Minister of Special Duties and Intergovernmental Affairs, Senator George Akume, ahead of the primaries in 2022.\nTop APC governorship aspirants paid a visit to the Minister to pledge their loyalty to him and the party, on the occasion of the 61st Independence Day of the nation.\nThe governorship aspirants included Prof. Terhemba Shija; ESV Godwin Ityoachimin; Dr. Jeffrey Kuraun; Arc.\nThe minister received with warmth and enthusiasm, the idea of the next governor of Benue State, of Kunav (Vandeikya) extraction.\nThe governorship aspirants at the meeting also threw their weight behind the ambition of the former Benue State governor, Akume, to be the next national chairman of the ruling APC."
  },
  {
    "headline": "2023: Benue APC Guber Aspirants Meet Akume",
    "summarized_story": "Gubernatorial aspirants from Vandeikya under the auspices of the JKP Initiative have held talks with the leader of the All Progressives Congress (APC) in Benue State and Minister of Special Duties and Intergovernmental Affairs, Senator George Akume, ahead of the primaries in 2022.\nTop APC governorship aspirants paid a visit to the Minister to pledge their loyalty to him and the party, on the occasion of the 61st Independence Day of the nation.\nThe governorship aspirants included Prof. Terhemba Shija; ESV Godwin Ityoachimin; Dr. Jeffrey Kuraun; Arc.\nThe minister received with warmth and enthusiasm, the idea of the next governor of Benue State, of Kunav (Vandeikya) extraction.\nThe governorship aspirants at the meeting also threw their weight behind the ambition of the former Benue State governor, Akume, to be the next national chairman of the ruling APC."
  },
  {
    "headline": "JUST-IN: Zamfara Speaker’s Father Dies In Bandits’ Den",
    "summarized_story": "The father of Speaker of the Zamfara State House of Assembly, Hon.\nNasiru Muazu Magarya, Alhaji Muazu Abubakar, has died in bandits’ captivity.\nElder brother to the deceased, Malam Dahiru Saraki Magarya, disclosed this to journalists in an interview on Saturday.\nThe Zamfara State Police Command in collaboration with the military was said to rescued the other captives.\nRecall that on August 5, 2021, bandits in their large number stormed Magarya town in Zurmi local government area of Zamfara State and kidnapped the victims."
  },
  {
    "headline": "21 Internet Fraudsters Arrested in Abia",
    "summarized_story": "By JUMOKE SANNIOperatives of the Uyo Zonal Command of the Economic and Financial Crimes Commission EFCC, on Wednesday, September 29, 2021 arrested 21 suspected internet Fraudsters a sting operation at World Bank Housing Estate, Umuahia, Abia state.\nThe arrested suspects are: Onwuka John Urum, Nwigwe Favour Uzochukwu, Marvelous Igwe Chikaodiri, Egbulef Promise, Okolo Christopher, Okoye Kosiso Chukwu, Uzor Kingsley Nzube, Okafor Jeremiah Onyedikachi, Okoji Franklin Akachukwu and Emmanuel Chibuike.\nAt the point of arrest, the following vehicles were recovered from them: Lexus ES350 with registration number Abuja KWL3398BP, a Mercedes Benz with registration number Abuja ABC677 EH, a Toyota Camry 2008 Model with registration number SMK507GZ and a Lexus ES350 with registration number IMO EKE 136 AE.\nOther items recovered from the suspects include different brands of laptops and mobile phones.\nThey will be charged to court as soon as the investigation is concluded."
  },
  {
    "headline": "21 Internet Fraudsters Arrested in Abia",
    "summarized_story": "By JUMOKE SANNIOperatives of the Uyo Zonal Command of the Economic and Financial Crimes Commission EFCC, on Wednesday, September 29, 2021 arrested 21 suspected internet Fraudsters a sting operation at World Bank Housing Estate, Umuahia, Abia state.\nThe arrested suspects are: Onwuka John Urum, Nwigwe Favour Uzochukwu, Marvelous Igwe Chikaodiri, Egbulef Promise, Okolo Christopher, Okoye Kosiso Chukwu, Uzor Kingsley Nzube, Okafor Jeremiah Onyedikachi, Okoji Franklin Akachukwu and Emmanuel Chibuike.\nAt the point of arrest, the following vehicles were recovered from them: Lexus ES350 with registration number Abuja KWL3398BP, a Mercedes Benz with registration number Abuja ABC677 EH, a Toyota Camry 2008 Model with registration number SMK507GZ and a Lexus ES350 with registration number IMO EKE 136 AE.\nOther items recovered from the suspects include different brands of laptops and mobile phones.\nThey will be charged to court as soon as the investigation is concluded."
  },
  {
    "headline": "How NECA DG Timothy Olawale died",
    "summarized_story": "The Nigeria Employers’ Consultative Association has announced the death of its Director-General, Dr Timothy Olawale.\nNECA Secretariat said in a statement issued in Lagos on Saturday that Olawale passed on, on Friday, October 1 in a hospital in Abuja.\n“It is with deepest sadness that we announce the passing of Dr Timothy Olawale, our Director-General, which occurred on Oct. 1 2021 at a hospital in Abuja.\nThe statement added that the association was in contact with the family and more information would be communicated in due course.\nOlawale was confirmed as the substantive Director-General of NECA in January 2019, after six months in an acting capacity."
  },
  {
    "headline": "How NECA DG Timothy Olawale died",
    "summarized_story": "The Nigeria Employers’ Consultative Association has announced the death of its Director-General, Dr Timothy Olawale.\nNECA Secretariat said in a statement issued in Lagos on Saturday that Olawale passed on, on Friday, October 1 in a hospital in Abuja.\n“It is with deepest sadness that we announce the passing of Dr Timothy Olawale, our Director-General, which occurred on Oct. 1 2021 at a hospital in Abuja.\nThe statement added that the association was in contact with the family and more information would be communicated in due course.\nOlawale was confirmed as the substantive Director-General of NECA in January 2019, after six months in an acting capacity."
  },
  {
    "headline": "Buhari leaves for Addis Ababa on Sunday",
    "summarized_story": "President Muhammadu Buhari will attend the inauguration of the Ethiopian Prime Minister Abiy Ahmed for a second five-year term in office on Monday in Addis Ababa.\nPresident Buhari will be accompanied by the Minister of Foreign Affairs, Geoffrey Onyeama, and the Director-General of the National Intelligence Agency (NIA), Ambassador Ahmed Rufai Abubakar.\nHe is expected back in Abuja on Tuesday.\nPrime Minister Ahmed secured another term in office following the victory of Ethiopia’s governing Prosperity Party in the country’s parliamentary election of June 21.\nIn his earlier congratulatory message to the Prime Minister, President Buhari gave an assurance that Nigeria will continue to support the unity and territorial well-being of Ethiopia and all African States."
  },
  {
    "headline": "Duterte confirms daughter Sara running for presidency",
    "summarized_story": "Philippine President Rodrigo Duterte’s daughter, Sara Duterte-Carpo would run for president in next year’s election.\nSara Duterte-Carpio is currently mayor of Davao, the Philippines’ third-largest city, and filed on Saturday to run for mayor again.\nIn the same interview witha journalsit, Duterte was asked when his daughter would file her candidacy for president, he said: “I really do not know.\nAsked if he had given his daughter permission to run for president, he said: “Ah, no, actually we don’t talk about politics, ever since we never talk about politics.\nDuterte, 76, said on Saturday he was retiring from politics, a surprise move that fuelled speculation he was clearing the way for a presidential run by his daughter."
  },
  {
    "headline": "Why I will receive COVID-19 vaccine –Adeboye",
    "summarized_story": "Addressing thousands of his members, Adeboye said, “I have never said to you, ‘Don’t be vaccinated.’ You’ve never heard that from me.\nWith the detection of the deadly Delta variant globally, some countries have made COVID-19 vaccination a compulsory immigration item.\nAbout five million Nigerians have since received their first shots of COVID-19 vaccination while about two million have completed their second doses, according to NPHCDA statistics as of end of September.\nThe government also encourages religious and political leaders to take the vaccine to dissipate vaccine hesitancy among the populace.\nHowever, the Presiding Bishop of the Living Faith Church Worldwide aka Winners’ Chapel, David Oyedepo, said that he won’t take the COVID-19 vaccine jab, adding that he is not a guinea pig."
  },
  {
    "headline": "APC Leader, Tinubu Speaks On UK Treatment, Says Physiotherapy Is ‘Gruesome’",
    "summarized_story": "NEWS DIRECT had reported last week that Fayemi also confirmed that Tinubu had surgery recently and he (Fayemi) was in London to show solidarity.\nPresident Muhammadu Buhari also made a surprise visit to Tinubu in London where he was seen leaning on a walking stick.\nNEWS DIRECT had reported that Tinubu underwent a knee surgery at the John Hopkins University Hospital in Maryland, US.\nSources close to Tinubu told SaharaReporters that he wanted the surgery in Paris, France but changed his plan over rumours of his death.\nReports have it that the meeting was held to put an end to speculations surrounding the APC National Leader’s health status."
  },
  {
    "headline": "President Buhari To Depart Abuja For Ethiopia Sunday.",
    "summarized_story": "President Muhammadu Buhari is scheduled to leave the country on Sunday in order to attend Ethiopian Prime Minister Abiy Ahmed’s inauguration for a second five-year term in office in Addis Ababa on Monday.\nThe Special Adviser to the President on Media and Publicity, Femi Adesina, who made the disclosure in a statement on Saturday, said President Buhari is scheduled to deliver a goodwill message during the inauguration ceremony.\nAdesina noted that President Buhari would subsequently attend a State Banquet in honour of visiting Heads of State and Government of the country.\nAccording to the statement, the president is expected to return to the country on Tuesday, October 5.\nThe statement read in part, “President Buhari who will depart Abuja for the Ethiopian capital, Addis Ababa on Sunday, is scheduled to deliver a goodwill message during the inauguration ceremony."
  },
  {
    "headline": "Nude Video: Dangote Withdraws Suit Against American Mistress",
    "summarized_story": "Aliko Dangote, a Nigerian businessman, has dropped the charges he filed against his former mistress Autumn Spikes in an American court.\nMr Dangote filed the charges in Miami, Florida, in a civil complaint under the alias John Doe, seeking $30,000 in damages.\nThe name also had an alias of ‘DA,’ which likely stood for Aliko Dangote’s initials.\nMr Dangote had already offered to pay her for her quiet, according to the woman, because the two had been in a relationship for nine years without a non-disclosure agreement to prevent her from publicly speaking about the affair.\nOn January 1, Ms Spikes used the Instagram name Allarounda1 to publish a video of herself and Mr Dangote on a couch aboard what looked to be a luxurious yacht, showing Mr Dangote half covered by an orange blanket while using his phone."
  },
  {
    "headline": "In Zamfara, Police nab bandits, rescue 3 weeks old baby, others",
    "summarized_story": "The Zamfara state police command through the ongoing operation against armed bandits has arrested 21 notorious armed bandits at various locations of the state.\nAccording to him, five bandits were also neutralised during the operations in four different attacks, and that many bandits suffered heavy casualties.\nHe further added that many informants to the bandits were arrested, investigated and prosecuted.\nShehu also stated that, over 200 kidnapped victims were rescued at various locations, debriefed and reunited with their families.\nBlueprint reports that Malankara popularly known as Turji was one of the bandits’ commanders who terrorised some parts of Zamfara and Sokoto states."
  },
  {
    "headline": "Breaking: Kidnapped Zamfara Speaker’s father dies in bandits’ den",
    "summarized_story": "Alhaji Muazu Abubakar, the father of Zamfara state Speaker House of Assembly, Hon.\nNasiru Muazu Magarya, has been confirmed dead inside bandits’ enclave.\nElder brother to deceased, Malam Dahiru Saraki Magarya disclosed this to Blueprint in an interview on Saturday.\nAlso, in an interview with Blueprint, the wife of the speaker Magarya’s father identified as Hauwa’u Mu’azu Abubakar Magarya who was kidnapped along with her three months baby, husband and three others said she heard one of the bandits saying her husband has died.\nOn August 5, 2021, Bandits in their hundreds stormed Magarya town in Zurmi local government of Zamfara state before they kidnapped their victims."
  },
  {
    "headline": "Breaking – Sports federation election: Stanley Gumut beats Yakubu Usman, emerges players’ representative on NBBF board (VIDEO)",
    "summarized_story": "Former captain Nigerian basketball club side Mark Mentors of Abuja a while ago on Saturday emerged as the players’ representative on the board of Nigeria Basketball Federation (NBBF).\nGumut, a D’Tigers player defeated his only opponent Yakubu Usman from Adamawa state 25-12 to emerge victorious after a keenly contested sports federation election.\nNBBF election had been delayed due to crisis that engulfed the Federation."
  },
  {
    "headline": "DHQ denies killing 20 fishermen in air bombardment -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ) , on Thursday, denied the trending report that the air bombardment of the air component of Operations Hadin Kai on terrorist location killed 20 fishermen in Borno State.\nIt noted that necessary steps were taken to ensure that the presence of the terrorists was ascertained and the strike was precise and professionally executed.\nIt is therefore important to make clarifications regarding the air interdiction mission conducted in the general area.\n“This was after careful Intelligence Surveillance Reconnaissance missions revealed the activities of ISWAP elements in the location.\nAlthough casualty figures could not be ascertained, the strike was verified to be successful in disrupting ISWAP logistics movement and foot soldiers”."
  },
  {
    "headline": "Ita Enang tasks state judiciary workers on implementation of judicial autonomy -NigPilot",
    "summarized_story": "Secretary, Presidential Implementation Committee on Autonomy of State Legislature and Judiciary, Senator Ita Enang, has called on State Chief Judges and Head of Courts to observe caution and due diligence in the implementation of full autonomous judiciary.\nSenator Enang who is also the Senior Special Assistant to the President on Niger Delta Affairs, made the call while presenting a paper at the National Judicial Institute Roundtable on Effective Court Administration recently in Abuja.\n“Let me appreciate the National Judicial Institute for the privilege of this platform to address their Lordships on the patent fears and indeed banana peels on the floor of Autonomy of the Judiciary.\nSome of the Chief Judges present at the roundtable, observed that the present budgetary system was inhuman and stressed the need for a more realistic approach to budgeting.\nOther issues raised by the Chief Judges were on the need to make input at budgeting level and the process of transmission approval into cash."
  },
  {
    "headline": "NCAA refutes ban on travelers without proof of vaccination -NigPilot",
    "summarized_story": "Nigerian Civil Aviation Authority , NCAA has refuted trending reports that the Federal Government through the NCAA has given a directive that from December 1 this year, travelers without proof of vaccination would not be permitted to board both local and international flights.\nThe NCAA in a statement issued on Thursday by its General Manager, Public Relations, Sam Adurogboye, Authority stated that it did not give any such directive.\n“On the other hand, we want to enjoin purveyor of such unfounded news to cross-check facts before publishing.\n“Meanwhile, the Authority will continue to support all Federal Government initiatives to curb the spread of the Delta variant.\n“However, we expect strict adherence to safety protocols in and out of the airports by wearing our facemask, washing our hands periodically, using alcohol-based hand sanitizer, maintaining social distance and avoiding crowded space,” the statement read."
  },
  {
    "headline": "Troops kill 479 terrorists, bandits in September -NigPilot",
    "summarized_story": "The Defence Headquarters (DHQ), on Thursday, said that troops in all theatres of operation killed no fewer than four hundred and seventy-nine (479) Boko Haram/Islamic State of West African Province ISWAP terrorists and bandits in the month of September.\nThis is in addition to the one hundred and five (105) terrorist fighters and bandits that were arrested in September.\n“Troops of Operation HADIN KAI sustained the operational tempo in land and air offensives against terrorists and other criminal elements in the North East theatre.\nCumulatively, a total of 85 BHT/ISWAP terrorists were neutralized and 43 terrorists including their collaborators and logistics suppliers were arrested in the course of the various operations.\nAlso, 47 armed bandits, informants and bandits’ collaborators were arrested within the period,” he also revealed."
  },
  {
    "headline": "OAU Students Protest Closure Of School By Management",
    "summarized_story": "﻿Students of the Obafemi Awolowo University (OAU), Ile-Ife have protested against the closure of the school on the directive of its management.\nThey shut the campus gate and blocked the major roads leading to the school, insisting that the management must rescind its directive on the total shutdown of the campus and that students should vacate the hostels.\nAuthorities at the institution had ordered the closure of the school and directed students to vacate the hostels following a protest sparked by the death of a final year student, Aisat Adesina.\nJustice For AisatIn an interview with Channels Television, students’ union officials said they have zero confidence in the health facility.\nOAU Public Relations Officer, Abiodun Olarewaju, explained that the management took the decision after appealing to the students on four different occasions."
  },
  {
    "headline": "Police Arrest Bandits’ Commander, Ban Unauthorised Use Of Tinted Glass In Zamfara",
    "summarized_story": "The Zamfara State Police Command says it has arrested one of the notorious commanders of bandits, Bello Ruga.\nThe suspect who has many bandits under him also is in possession of AK 47 rifles.”Meanwhile, Elkana announced that all vehicles with unauthorised tinted glass should be immediately removed.\nThe police commissioner also clarified the status of the measures announced by the state government to check the activities of bandits in Zamfara.\nHe reminded them of the restriction of movement in and out of the 13 LGAs from 6am to 6pm, and from 8pm to 6am in the state capital.\nThe suspension of communication networks in the 13 LGAs is still in force with the exception of Gusau metropolis,” he said."
  },
  {
    "headline": "Gunmen Kidnap Permanent Secretary In Niger State",
    "summarized_story": "Gunmen have kidnapped the Permanent Secretary at the Niger State Ministry of Transportation, Dr Ibrahim Musa.\nThe Chief Press Secretary to the state governor, Mary Barje, confirmed the abduction of the government official in a statement on Saturday.\nGovernor Abubakar Bello, in his reaction, condemned the abduction of the permanent secretary.\nHe assured the people of his administration’s commitment to tackling banditry and other forms of security challenges in the state.\nReports had emerged that Boko Haram terrorists have captured many communities in eight wards of Shiroro LGA."
  },
  {
    "headline": "Abducted Air Vice-Marshal Smith Regains Freedom",
    "summarized_story": "Air Vice-Marshal Sikiru Smith who was abducted on Monday in the Ajah area of Lagos State has regained his freedom.\nThe Lagos State Commissioner of Police, Hakeem Odumosu, confirmed the release to Channels Television.\nThe police commissioner said he personally handed over Smith to his family, adding that persistent operational activities along the border corridors of Lagos and the recent onslaught on kidnappers in the forest led to the release of the retired Air Vice-Marshal.\nAir Vice-Marshal Sikiru Smith was abducted by armed masked men who bundled him into a boat, speeding off from the site where he was supervising work in the area.\nREAD ALSO: Gunmen Kidnap Retired Air Vice Marshal In LagosHe is a cousin to the former Inspector-General of Police, Musiliu Smith who is the Chairman of the Police Service Commission."
  },
  {
    "headline": "PDP To Hold NEC Meeting On Thursday",
    "summarized_story": "The Peoples Democratic Party (PDP) has rescheduled its National Executive Committee (NEC) meeting.\nPDP National Secretary, Senator Umaru Tsauri, announced this in a statement titled ‘Change of Date: Notice of PDP NEC Meeting’ on Saturday in Abuja.\n“All members of the National Executive Committee of our great party are invited to the 94th NEC meeting,” he said.\nSenator Tsauri explained that the meeting would take place on Thursday at the party’s national headquarters in the Federal Capital Territory (FCT).\n“All members are enjoined to attend as the meeting will discuss crucial matters,” he added."
  },
  {
    "headline": "NLC expresses shock at demise of NECA DG, Timothy Olawale -",
    "summarized_story": "The Nigeria Labour Congress has expressed at the demise of the Nigeria Employers’ Consultative Association has announced the death of its Director-General, Timothy Olawale.\nThe labour union in a statement by its President, Ayba Wabba, described the NECA boss’ death as shocking and painful.\nMr Timothy Olawale died on Friday, Oct. 1 in a hospital in Abuja.\n“It is with deepest sadness that we announce the passing of Dr. Timothy Olawale, our Director-General, which occurred on Oct. 1 2021 at a hospital in Abuja,” NECA announced in a statement on Saturday.\nTimothy Olawale was confirmed as the substantive Director-General of NECA in January 2019, after six months inacting capacity."
  },
  {
    "headline": "UPDATED: NECA officially announces death of its DG, Timothy Olawale -",
    "summarized_story": "The Nigeria Employers’ Consultative Association has announced the death of its Director-General, Timothy Olawale.\nNECA said in a statement issued in Lagos on Saturday that Timothy Olawale died on Friday, Oct. 1 in a hospital in Abuja.\n“It is with deepest sadness that we announce the passing of Dr. Timothy Olawale, our Director-General, which occurred on Oct. 1 2021 at a hospital in Abuja.\nNECA added that it was in contact with the family and more information would be communicated in due course.\nTimothy Olawale was confirmed as the substantive Director-General of NECA in January 2019, after six months inacting capacity."
  },
  {
    "headline": "Sweden marks 60 years of relations with Nigeria",
    "summarized_story": "Nigeria must use the celebration of its 61 years of existence as a time for deep reflection.\nThis was stated by the UN Humanitarian Coordinator in Nigeria at an event organized by the Embassy of Sweden in Nigeria.\nDetails in this report.."
  },
  {
    "headline": "Niger Governor condemns abduction of Permanent Secretary in Zungeru -",
    "summarized_story": "Governor Abubakar Sani Bello of Niger State has condemned the kidnap of the Permanent Secretary, State Ministry of Transport, Dr. Ibrahim Garba Musa and his son in Zungeru.\nIn a statement by his chief press secretary Mary Noel Berje, governor Sani Bello described the act as evil and inhuman.\nHe also condemned the barbaric and atrocious acts of bandits in Shiroro and Munya Local Government Areas recently, where many villagers were slaughtered, burnt and some kidnapped, houses as well as food bans set ablaze, said with the recent turn of event in the acts of banditry there is the urgent need for total overhauling of the strategy of security apparatus.\nThe Governor maintained that the security operatives are capable of curtailing the situation and called for more support by the general public with useful and timely information.\nThe Governor re-assured the people of his administration’s unrelenting efforts to address the insecurity in the State."
  },
  {
    "headline": "British Museum Accepts Nigerian Artist’s Gift But Keeps Looted Bronzes",
    "summarized_story": "An artist from Benin City in Nigeria said the British Museum had accepted his gift of a bronze plaque in what he felt was a possible first step towards the museum’s return of the priceless Benin Bronzes that were looted by British troops in 1897.\nHowever, the museum told him an exchange of new for looted artworks was impossible, he said.\nOsarobo Zeickner-Okoro, a founding member of Ahiamwen, a new guild of Benin City bronze casters and artists, had offered his creation to encourage the museum to give back the sculptures but also to demand acknowledgment of the city’s modern-day culture.\nAfter meeting with two curators from the museum’s Africa department, he told Reuters on Thursday they had accepted his gift and expressed an interest in acquiring several works by other Ahiamwen artists.\n“It’s disappointing but this is the first step,” he said."
  },
  {
    "headline": "California First US State to Require Covid Vaccines for Schoolchildren",
    "summarized_story": "California will become the first US state to require COVID-19 vaccinations for children to attend public and private schools in person in a mandate that could effect millions of students.\nIt’s why California leads the country in preventing school closures and has the lowest case rates,” Newsom said.\nThe mandate eventually will affect more than 6.7 million public and private school students in the nation’s most populous state.\nIn Los Angeles, a vaccine mandate for eligible students is set to take effect in January.\nCalifornia’s largest teachers unions back the vaccination mandate, as does the California Association of School Boards."
  },
  {
    "headline": "Nigeria Posts OPEC’s Biggest Output Gain in September",
    "summarized_story": "The group’s top producers further eased supply curbs in September under a pact with its allies known as OPEC+, revealed a survey by Reuters.\nAccording to the survey, OPEC pumped 27.31 million barrels per day (bpd) last September, up 420,000 bpd from August’s revised estimate.\nThe biggest rise in September was from Nigeria, where output rose by 170,000 bpd after Forcados force majeure and other problems in August were eased.\nEven so, Nigeria is pumping almost 100,000 bpd less than its OPEC target as under-investment restrains output.\nThe OPEC+ agreement allows for a 400,000 bpd production increase in September from all members, of which 253,000 bpd is shared by the 10 OPEC members covered by the deal."
  },
  {
    "headline": "Muhammadu Sanusi II: Nigeria Wasting Millions of Dollars through Subsidy Scam",
    "summarized_story": "Speaking on Arise News Channel, the former governor of the Central Bank of Nigeria also described as an assumption, the notion that Nigeria is an oil rich country.\nSanusi declared: “This has always been a big joke for me and we also talk about the fuel subsidy.\nWe are throwing away millions of dollars in this scam called subsidy.\nWhen you talk about the oil industry, for example, if you eliminate fuel subsidy, you eliminate fraud worth billions and millions of dollars.\nAnd that is why at the end of the exercise, you end up as Nigeria… presented with two useless candidates."
  },
  {
    "headline": "Nigeria: Rivers Governor Wike Warns Ex-President Jonathan Against Falling for APC’s Enticement",
    "summarized_story": "Governor Nyesom Wike of Rivers State on Friday urged former President Goodluck Jonathan to remain in the Peoples Democratic Party (PDP) and resist the temptation of joining the All Progressives Congress (APC).\nWike warned Jonathan not to be enticed by moves by the APC to lure reputable members of the PDP, adding that the ruling party is offering nothing but destruction.\nI will tell him, ‘Don’t go anywhere because these people want to destroy your reputation.\nIf you want to run for President, run under PDP.\nSome APC chieftains had visited him in recent times, raising the stakes in permutations for the 2023 general elections."
  }
]