[
  {
    "headline": "Drama as judge orders man to hug wife in court",
    "summarized_story": "A Sharia Court sitting in Magajin Gari, Kaduna State, on Tuesday, ordered a man, Yusuf Maiwada, to hug his wife, Nafisa Jibril in court.\nThe Judge, Nuhu Falalu said, ”Lack of affection from Maiwada prompted his wife to seek divorce”.\nThe Judge also ordered him to give his wife money in the court.\n”The court orders you to bring her and their three children back to his house and pay for their feeding in arrears,” he said.\nJibril also alleged that Maiwada beat her and ordered her out of his house and to take her children along."
  },
  {
    "headline": "Our security architecture compromised by unknown gunmen, says NDA",
    "summarized_story": "Nigeria’s foremost military university, Nigerian Defence Academy, has confirmed that it suffered an attack by unknown gunmen which led to the death of two of its personal, while one was abducted.\nIn a statement confirming the attack, the NDA revealed that it is on the trail of the gunmen who compromised its security architecture.\nThis was issued by the Academy Public Relations Officer, Bashir Muhd Jajira, and shared on social media by presidential aide, Buhari Sallau.\nThe statement read, “The security architecture of the Nigerian Defence Academy was compromised early this morning by unknown gunmen who gained access into the residential area within the Academy in Afaka.\nWe assure the general public that these unknown gunmen would soon be apprehended and the abducted personnel rescued.”"
  },
  {
    "headline": "YCE raises alarm over influx of foreigners into Lagos",
    "summarized_story": "Agbede, a retired military colonel, urged security agencies especially the Lagos State Government to be on their toes in ensuring that there is no breakdown of law and order in Lagos State and other parts of the country.\nWith a lot of people who have infiltrated Lagos, the State is sitting not only on a keg of gunpowder but on a barrel of gunpowder.\nA lot of foreigners have sneaked into Lagos State and the majority of them have no place of abode.\n“We also wonder about the show of authority by someone who calls himself Serikin Fulani of Lagos State and Oba Rilwan Akiolu is sitting down comfortably looking at this thing?\nWe still have problems of insecurity in Ekiti State."
  },
  {
    "headline": "Labourer gets 12 strokes for stealing electrical materials",
    "summarized_story": "A Zuba Upper Area Court, Abuja, on Tuesday ordered that a 21-year-old labourer, Marvellous Faruna be given 12 strokes of the cane for stealing electrical materials.\nThe Judge, Gambo Garba, also sentenced Faruna who pleaded guilty to housebreaking and theft and begged the court for leniency to six months imprisonment.\nGarba, however, gave the convict an option to pay a fine of N10,000, and warned him to desist from committing crimes.\nHe also ordered the convict to pay N200, 000 as compensation to the complainant.\nREAD ALSO: Court in Rivers suspends SecondusOgada said the convict and Isreal Ibrahim, at large broke into the complainant’s house and stole electrical materials worth N200, 000."
  },
  {
    "headline": "PIA Protests: HOSCON calls for unity, peace, development in Niger Delta",
    "summarized_story": "“The unity and peace we are talking about are necessary for the successful planning and execution of projects and programmes in the host communities.\n“With the PIA, we now have direct funds for the development of the communities.\n“The Act also provides for a direct benefit framework that will enable the sustainable development of host communities.\nThe host communities have suffered enough, even when NDDC was established, I’m sure it was established because of the host communities’ issues and yet the host communities did not get much attention.\n“This time, the host communities have been specifically mentioned and these funds should go there."
  },
  {
    "headline": "DEVELOPING: Passengers stranded at Cele Bus Stop as transporters protest against task force",
    "summarized_story": "By Onozure DaniaBonfire on Cele-Mile 2 ExpresswayPassengers were on Tuesday, stranded at Cele Bus Stop, along Mile 2, Oshodi Apapa, Badagry expressway, over protests by transporters and motorists against the Lagos State Taskforce operatives.\nThe protesters have set up bonfires on the expressway, inward Oshodi, and are preventing commercial vehicles and motorcycles on both sides from operating.\nThe transporters including thugs were seen wielding machetes and knives.\nVanguard News Nigeria"
  },
  {
    "headline": "UPDATED: 2 military officers killed, one abducted as bandits attack NDA Kaduna",
    "summarized_story": "By Ibrahim Wuyo, KadunaBandits have in the early hours of Tuesday ,attacked the permanent site of the Nigerian Defence Academy( NDA) Kaduna.\nTwo officers were killed during the attack while another was abducted.\nA source told journalists that the bandits who were disguised in military uniform ,came to the NDA in a vehicle and headed to the officers quarters.\nThe bandits were said to have shot sporadically, causing fear and confusion in the Academy which is located not very far from the Federal College of Forestry Mechanisation, Afaka.\nWe assure the general public that this unknown gunmen would soon be apprehended and the abducted personnel rescued.”Vanguard News Nigeria"
  },
  {
    "headline": "NDA attack: Bandits attacked same ward twice before – Shehu Sani",
    "summarized_story": "Senator Shehu Sani, who represented Kaduna Central Senatorial District in the 8th National Assembly between 2015-2018, has condemned the bandits’ attack on the premier military institution in Kaduna.\nRecall that bandits in large numbers stormed the Nigerian Defence Academy (NDA) on Tuesday morning, killing two officers and kidnapping two others.\nReacting on Tuesday on his Facebook wall, Shehu Sani said it was disappointing that previous attacks were carried out in the same ward, yet concerned authorities did not take measures.\nHe said, “The airport staff that was once attacked, the Federal College of Forestry and Mechanisation that was once attacked, and now the Nigerian Defence Academy that is now attacked are all in the same Ward Afaka in Kaduna.\nNo lesson learned and nowhere is safe; disappointing.”BREAKING: Nigerian Defence Academy confirms bandits’ attack, officers’ murder"
  },
  {
    "headline": "Ortom hails Lawan, Gbajabiamila, others over restoration of Benue constituency",
    "summarized_story": "Benue State Governor, Samuel Ortom has acknowledged the support of the Senate President, Senator Ahmed Lawal and Speaker of the House of Representatives, Femi Gbajabiamila over their support for the restoration of Agasha State Constituency.\nGovernor Ortom spoke in Gbajimba, Guma Local Government Area on Monday during the celebration of the restoration of Agasha State Constituency, held at LGEA Primary School Gbajimba.\nThe Governor also thanked Senators Emmanuel Orker Jev and Gabriel Suswam as well as the entire members of the National Assembly from the state for their relentless efforts towards the restoration.\nSenator representing Benue North East, Gabriel Suswam and his Benue North West counterpart, Orker Jev attributed the restoration to unity of purpose and the support of Governor Ortom, stressing that it was imperative to review state constituencies periodically as required by the constitution.\nGov Ortom acknowledges Air Force’s contribution to security in Benue"
  },
  {
    "headline": "Taraba: Our clients in dilemma – Lawyers of police brutality victims raise alarm",
    "summarized_story": "Barely a day after the victims of police brutality in Taraba State took their grievances to the National Economic Council (NEC), solicitors of the 47 victims have treaded the same path.\nThe 47 victims, it would be recalled, had on Monday petitioned Vice President Yemi Osinbajo through the NEC, asking it to prevail on Governor Darius Dickson Ishaku to make funds available for the panel to tidy up their report for onward transmission.\nIn a petition jointly written by them, a copy of which was on Tuesday made available to DAILY POST, the lawyers expressed dismay at the way and manner the state government turned its back on the panel.\nCiting other states who have not only submitted their reports but have as well begun the process of compensating the victims , they said they could not fathom why the reverse is always the case with the government of the state.\nCopies of the petition, which was signed by Barrister Simon Joseph, were made available to the three senators representing the state at the National Assembly."
  },
  {
    "headline": "Cholera: We’re ready to combat outbreak in Osun – Health Commissioner, Isamotu",
    "summarized_story": "The Osun State Commissioner for Health, Dr Rafiu Isamotu, has revealed that the state is ready to curtail and contain any outbreak of cholera.\nAccording to Isamotu, “Osun is absolutely ready to contain any outbreak of cholera.\nIn any outbreak like that of cholera, that is the prerogative of the Department of Public Health of the State Ministry of Health.\nIf that is done, we should be able to avoid any ugly incidences of cholera outbreak”, he concluded.\nCholera outbreak kills over 100 persons in Jigawa"
  },
  {
    "headline": "It’s slap on armed forces’ face – Fani-Kayode reacts to attack on NDA",
    "summarized_story": "Former Aviation Minister, Femi Fani-Kayode has reacted to the attack on the Nigerian Defence Academy by bandits.\nFani-Kayode said the attack was an insult and a slap on the face of the Nigerian armed forces.\nIn a tweet, the former minister wrote: “The attack on the Nigerian Defence Academy by terrorists in which an Army officer was killed and two Majors were kidnapped is a big insult and slap on the face of the Nigerian armed forces.\nTwo officers were killed and four others kidnapped during the attack.\nBREAKING: Nigerian Defence Academy confirms bandits’ attack, officers’ murder"
  },
  {
    "headline": "MultiChoice Nigeria loses top staff Martin Mabutho",
    "summarized_story": "MultiChoice Nigeria has been thrown into mourning over the death of the Chief Customer Officer, Martin Mabutho.\nADVERTISEMENTThe Nation was reliably informed that Mabutho died in South Africa.\nSongstress Seyi Shay took to her social media account to eulogise the late Mabutho.\nMabutho, aside from the passion for his work and MultiChoice, has an unbridled love for sports and entertainment.\nHe was also skilled in Digital Strategy, Marketing Management, Customer Relationship Management (CRM), Customer Value Management, Media Relations and Corporate Communications."
  },
  {
    "headline": "FG kick-starts N-Power Batch C1",
    "summarized_story": "The Federal Government on Monday commenced the Batch C stream 1 of its N-Power programme.\nThe Ministry of Humanitarian Affairs, Disaster Management and Social Development commenced the enrolment process of the third batch of the beneficiaries on June 26, 2020.\nThe Minister of Humanitarian Affairs, Disaster Management and Social Development, Sadiya Farouq, said over six million applications were received from interested applicants.\nADVERTISEMENTShe however said batch C will absorb 510,000 beneficiaries in the first stream and 490,000 beneficiaries in the second stream.\nShe further explained that under Batch C1, 450,000 have been selected to benefit under the graduate component while 60,000 beneficiaries will be non-graduate beneficiaries."
  },
  {
    "headline": "11 things to know about late Senator Biyi Durojaiye",
    "summarized_story": "Fourth Republic lawmaker, Senator Biyi Durojaye died in the early hours of Tuesday in Lagos.\nSources said Durojaye died while receiving medical attention.\nADVERTISEMENTHe was former Chairman, Board of Commissioners for Nigerian Communications Commission (NCC) and an Ex-NADECO chiefHere are more things to know about Senator Biyi Durojaiye1.\nSenator Biyi Durojaye was born in February 1933.\nDurojaiye was an elected Senator from 1999-200310."
  },
  {
    "headline": "Nine feared dead in attacks on Rivers communities",
    "summarized_story": "By Rosemary Nwisi, Port HarcourtNine persons were reportedly killed during gunmen attacks on two communities in Khana Local Government Area of Rivers State.\nThe affected communities are: Gwara and Kono in Boue Kingdom.\nADVERTISEMENTA source close to the communities told reporters the rampaging gunmen invaded the neighbouring communities on Monday afternoon.\nThe source informed residents fled the communities before nightfall for fear of possible midnight attacks.\nRivers Police spokesperson, Nnamdi Omoni, Superintendent of Police (SP), could not confirm the incident as at the time of filing this report."
  },
  {
    "headline": "Kaduna: NDA confirms two killed, one abducted in bandits invasion",
    "summarized_story": "Confirming the unfortunate development via a release in Kaduna, the Academy Public Relations Officer, Major Bashir Muhd Jajira, said combined military personnel have been on the trail of the invaders to rescue the abductee and bring the bandits to book.\nAccording to the NDA Spokesman, “the security architecture of the Nigerian Defence Academy was compromised early this morning by unknown gunmen who gained access into the residential area within the Academy in Afaka.\n“During the unfortunate incident, we lost two personnel and one was abducted.\n“The NDA community and Cadets are safe in the Academy.\n“We assure the public that this unknown gunmen would soon be apprehended and the abducted personnel rescued”, he said."
  },
  {
    "headline": "Breaking: Bandits storm NDA, kill one, abduct 4 officers",
    "summarized_story": "From Noah Ebije, KadunaBandits invaded Nigeria Defence Academy (NDA) permanent site at about 1a.m this morning.\nOne officer killed and undisclosed number of officers abducted.\nA source said.\nDetails soon…"
  },
  {
    "headline": "Court restrains Secondus from parading as national chairman, member of PDP",
    "summarized_story": "From Tony John, Port HarcourtThe High Court of Rivers State has issued an interim injunction restraining Prince Uche Secondus from parading himself as national chairman and member of the Peoples Democratic Party (PDP).\nO. Gbasam of the Degema Judicial Division vacation court sitting in Port Harcourt granted the order yesterday following a suit No: PHC/2183/CS/2021 filed by Ibeawuchi Ernest Alex, Dennis Nna Amadi, Emmanuel Stephen and Umezirike Onucha against Uche Secondus (1st defendant) and the PDP (2nd defendant).\nBello, counsel to the applicants, granted the interim injunction restraining Secondus from parading himself as the national chairman of the PDP.\nMeanwhile, media office of Secondus in a statement by Ike Abonyi reacted to the court judgment saying: “If Secondus and the party are taken to court they will defend themselves.\nPDP and Secondus are not afraid of court, this party is a child of history, owned by Nigerians, bigger than any individual or group including desperadoes.”"
  },
  {
    "headline": "IPOB: Again, Abia, Enugu, Imo, Ebonyi residents stay at home",
    "summarized_story": "Regardless of announcements by the leadership of IPOB over the week concerning suspension of the order, residents of the five eastern states have continued to stay at home ostensibly for fear of the unknown.\nReports from Aba said though there were no cases of molestation by hoodlums, residents stayed at home out of fear.\nIn Enugu, banks, fuel stations and street shops were locked as people were afraid of attacks.\nAlso major roads leading to Main Market Onitsha such as Old Market, New Market, Venn Roads were deserted as young boys turned the roads to football pitches.\n•Go tough on IPOB members –IGInspector General of Police (IGP), Alkali Baba Usman, has charged officers of the Delta State command to deal decisively with any IPOB member."
  },
  {
    "headline": "Court orders striking doctors back to work",
    "summarized_story": "The National Industrial Court of Nigeria (NICN), yesterday, ordered striking members of the Nigerian Association of Resident Doctors (NARD) to resume work immediately.\nThe order was made following an ex parte motion filed last week Friday, by the Federal Ministry of Health, seeking an order of interlocutory injunction, restraining members of NARD from further continuing the industrial action they embarked upon on August 2, 2021, contrary to Section 41 of the Trade Dispute Act, pending the determination of the substantive suit.\nThe motion brought under Suit No: NICN/ABJ/197/2021 has the Federal Ministry of Health and the Federal Government as first and second Claimants/Applicants and NARD as the only Defendant/Respondent.\nThe court held that the continued downing of tools by the striking doctors have inflicted a lot of damage on the health system and the sick, especially in this perilous times of COVID-19 pandemic.\nThe judge adjourned the matter to September 15, 2021, for the hearing of the motion on notice and any other pending application."
  },
  {
    "headline": "NDA Confirms Attack by Bandits",
    "summarized_story": "By John ShiklamThe Nigerian Defence Academy (NDA) has confirmed the attack on the institution by bandits, saying its security architecture was compromised.\nA statement on Tuesday in Kaduna by the Public Relations Officer of the Academy, Maj. Bashir Jajira said two officers were killed while one was abducted.\nThe statement titled “Security breach of Nigerian Defence Academy architecture” reads: The security architecture of the Nigerian Defence Academy was compromised early this morning by unknown gunmen who gained access into the residential area within the Academy in Afaka.\n“The NDA community and Cadets are safe in the Academy.\nWe assure the general public that this unknown gunmen would soon be apprehended and the abducted personnel rescued.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Bandits Attack NDA, Kill 2 Officers, Abduct 1",
    "summarized_story": "By John ShiklamBandits have attacked the permanent site of the Nigerian Defence Academy (NDA) Kaduna, killing two officers.\nSources said the bandits also abducted one officer, injuring another.\nThe wounded officer was said to be receiving treatment at the Academy’s Medical Centre.\nWhen contacted, the spokesman of the academy, Major Bashir Jajira said a press statement will be issued soon.\nI am awaiting the Commandant’s approval”, Jajira responded on the WhatsApp chat group of the NDA and the media."
  },
  {
    "headline": "Ex-NADECO Chieftain, Olabiyi Durojaiye, is Dead",
    "summarized_story": "Former Presidential aspirant on the platform of defunct Social Democratic Party (SDP) and chieftain of the National Democratic Coalition (NADECO), Senator Olabiyi Durojaiye, is dead.\nHe died on Tuesday morning after a brief illness.\nThe late Durojaiye served as Senator for Ogun East Senatorial District on the platform of the Alliance for Democracy between 1999 and 2003.\nIn Senate, he served in the Judiciary, Establishment and Special Project committees.\nHe vied for the presidential ticket of the SDP, which was won by late Chief MKO Abiola."
  },
  {
    "headline": "PDP Crisis Worsens as Court Restrains Secondus from Parading as Chairman",
    "summarized_story": "Part of the prayers were that Secondus be stopped from performing the functions of national chairman of the PDP while on suspension as a member of the party.\nIn line with series of meetings and a determination to resolve the crisis to save PDP, Chairman of the PDP Board of Trustees, Senator Walid Jubrin, summoned an expanded board meeting.\nIn the long run, BoT chairman, Walid Jibrin, identified numerous problems in the PDP, which needed urgent attention.\nThis, sadly, underscored how much Secondus’ ouster meant to the Rivers governor, hence he attended the BoT meeting for the first time.\nThe media office, in a statement by Ike Abonye, said, “PDP and Secondus are not afraid of court."
  },
  {
    "headline": "THISDAY Launches WhatsApp Edition With Free Delivery to 73m MTN Subscribers",
    "summarized_story": "•Commends telco on 20th anniversary celebrationEmma OkonjiTHISDAY Newspapers has launched a WhatsApp edition to deliver the digital PDF copy of its newspapers to over 73 million MTN subscribers for a free download on the MTN Zigi Chatbot.\nLaunched last year, the MTN Zigi Chatbot, is the telco’s new digital personal assistant that can answer questions, and assist subscribers with products, services, and activations.\nZigi chats in English language and she is available to chat with both existing MTN customers and non-MTN customers as a guest.\nThe Zigi chatbot saves the time of customers waiting for customer care representative to respond to question.\nCommenting about ‘Zigi,’ the Chief Customer Relations Officer, MTN Nigeria, Ugonwa Nwoye, said, “Zigi offers personalised, intuitive and prompt service to our customers."
  },
  {
    "headline": "BREAKING: Bandits Attack Nigerian Defence Academy, Kill Military Officer, Abduct Two Personnel",
    "summarized_story": "Bandits have invaded the Afaka barracks of the Nigerian Defence Academy (NDA), Kaduna State, killing a naval officer.\nAccording to Daily Trust, the bandits who attacked the barracks around 1am on Tuesday are still believed to be inside the academy.\nA reliable source within the barracks said security had been beefed up within and around the barracks to stop the bandits from escaping with the officers.\nOne of the officers who was injured in the attack is currently being treated at a hospital within the barracks.\nThe source said that there are, however, fears that the bandits may decide to kill the officers in a bid to escape."
  },
  {
    "headline": "BREAKING: Bandits Attack Nigerian Defence Academy, Kill Military Officer, Abduct Two Personnel",
    "summarized_story": "Bandits have invaded the Afaka barracks of the Nigerian Defence Academy (NDA), Kaduna State, killing a naval officer.\nAccording to Daily Trust, the bandits who attacked the barracks around 1am on Tuesday are still believed to be inside the academy.\nA reliable source within the barracks said security had been beefed up within and around the barracks to stop the bandits from escaping with the officers.\nOne of the officers who was injured in the attack is currently being treated at a hospital within the barracks.\nThe source said that there are, however, fears that the bandits may decide to kill the officers in a bid to escape."
  },
  {
    "headline": "Buhari Regime Secretly Funds Another Welfare Programme For ‘Repentant’ Boko Haram Commanders – Report",
    "summarized_story": "The Muhammadu Buhari-led government has been funding another secret programme aimed at rehabilitating and integrating the “repentant” Boko Haram terrorists into the society.\nThe report dates the start of the Sulhu program back to 2014, after the abduction of over 270 Chibok schoolgirls seized by Boko Haram.\nIn the last few weeks, there has been a separate surge, related to internal feuding within the jihadist movement following the death this May of Abubakar Shekau, who had led Boko Haram since 2009.\nThe report links the Sulhu programme to the recent surrender of terrorists to the Nigerian government.\nA subject of the report is named as Mallam Aliyu, a former Boko Haram member involved in the Bama massacre of 2014."
  },
  {
    "headline": "Buhari Regime Secretly Funds Another Welfare Programme For ‘Repentant’ Boko Haram Commanders – Report",
    "summarized_story": "The Muhammadu Buhari-led government has been funding another secret programme aimed at rehabilitating and integrating the “repentant” Boko Haram terrorists into the society.\nThe report dates the start of the Sulhu program back to 2014, after the abduction of over 270 Chibok schoolgirls seized by Boko Haram.\nIn the last few weeks, there has been a separate surge, related to internal feuding within the jihadist movement following the death this May of Abubakar Shekau, who had led Boko Haram since 2009.\nThe report links the Sulhu programme to the recent surrender of terrorists to the Nigerian government.\nA subject of the report is named as Mallam Aliyu, a former Boko Haram member involved in the Bama massacre of 2014."
  },
  {
    "headline": "Buhari Regime Secretly Funds Another Welfare Programme For ‘Repentant’ Boko Haram Commanders – Report",
    "summarized_story": "The Muhammadu Buhari-led government has been funding another secret programme aimed at rehabilitating and integrating the “repentant” Boko Haram terrorists into the society.\nThe report dates the start of the Sulhu program back to 2014, after the abduction of over 270 Chibok schoolgirls seized by Boko Haram.\nIn the last few weeks, there has been a separate surge, related to internal feuding within the jihadist movement following the death this May of Abubakar Shekau, who had led Boko Haram since 2009.\nThe report links the Sulhu programme to the recent surrender of terrorists to the Nigerian government.\nA subject of the report is named as Mallam Aliyu, a former Boko Haram member involved in the Bama massacre of 2014."
  },
  {
    "headline": "Tunde Bakare: There's gross failure in Buhari's administration — I’m terribly shocked",
    "summarized_story": "Tunde Bakare, the serving overseer of the Citadel Global Community Church, says there is “gross failure” in the administration of President Muhammadu Buhari.\nAdvertisementSpeaking during an interview on Channels Television, on Tuesday, Bakare said this is not the Nigeria he had envisioned.\nI’m terribly shocked about the things that are happening.\nAsked if Buhari’s administration is a failure, Bakare said there is “gross failure” in the administration and that it is possible to fail forward in order to resolve the country’s problems.\nI was very good in English… Yes, there is gross failure, it is apparent to everyone but you can fail forward,” he said."
  },
  {
    "headline": "Tunde Bakare: There's gross failure in Buhari's administration — I’m terribly shocked",
    "summarized_story": "Tunde Bakare, the serving overseer of the Citadel Global Community Church, says there is “gross failure” in the administration of President Muhammadu Buhari.\nAdvertisementSpeaking during an interview on Channels Television, on Tuesday, Bakare said this is not the Nigeria he had envisioned.\nI’m terribly shocked about the things that are happening.\nAsked if Buhari’s administration is a failure, Bakare said there is “gross failure” in the administration and that it is possible to fail forward in order to resolve the country’s problems.\nI was very good in English… Yes, there is gross failure, it is apparent to everyone but you can fail forward,” he said."
  },
  {
    "headline": "Saudi Arabia shops for Nigerian doctors, holds recruitment exercise in Lagos",
    "summarized_story": "Many medical doctors in Nigeria have applied for job positions with the Saudi Arabia ministry of health.\nAfter payment, the medical doctors were screened before a panel of Saudi Arabian personnel.\nThis is my first time.”This is not the first time Saudi Arabia will woo Nigerian medical doctors with job offers.\nAdvertisementNIGERIAN MEDICAL DOCTORS AND STRIKE ACTIONSThe latest recruitment exercise comes amid ongoing strike action by the Nigerian Association of Resident Doctors (NARD).\nThis situation, among others, has forced many medical doctors to leave the country in search of greener pastures."
  },
  {
    "headline": "Saudi Arabia shops for Nigerian doctors, holds recruitment exercise in Lagos",
    "summarized_story": "Many medical doctors in Nigeria have applied for job positions with the Saudi Arabia ministry of health.\nAfter payment, the medical doctors were screened before a panel of Saudi Arabian personnel.\nThis is my first time.”This is not the first time Saudi Arabia will woo Nigerian medical doctors with job offers.\nAdvertisementNIGERIAN MEDICAL DOCTORS AND STRIKE ACTIONSThe latest recruitment exercise comes amid ongoing strike action by the Nigerian Association of Resident Doctors (NARD).\nThis situation, among others, has forced many medical doctors to leave the country in search of greener pastures."
  },
  {
    "headline": "Tambuwal to Buhari: Don't impose open grazing on states",
    "summarized_story": "Aminu Tambuwal, governor of Sokoto state, has cautioned President Muhammadu Buhari against imposing open grazing of cattle on states.\nAdvertisementTambuwal was reacting to the president’s recent approval for the review of 368 grazing reserves across 25 states in the country.\nThe order came at a time when several states, especially in the south, are banning the practice over security issues.\n“I said that President Muhammadu Buhari should only do his programme of cattle routes or grazing reserves where the people or communities are interested.\nInsecurity therefore, becomes a drain on state and national resources at the expense of development and peoples’ wellbeing, thereby having adverse consequences on economic growth and development."
  },
  {
    "headline": "Led by SoftBank, Nigeria’s OPay raises $400m at $2bn valuation",
    "summarized_story": "Nigeria-based OPay has secured $400 million in a new funding round led by SoftBank Vision Fund, the venture capital arm of Japanese conglomerate, SoftBank.\nThe latest funding brings investments to date in OPay to $570 million and values the Nigerian mobile payments platform at $2 billion.\nIt is the single-largest investment round secured by an African-based startup and marks the first investment in a startup on the continent by the SoftBank Vision Fund.\nThey include Sequoia Capital China, DragonBall Capital, Redpoint China, Source Code Capital, SoftBank Ventures Asia, and 3W Capital.\nFounded in 2018, OPay raised two investments in 2019; $50 million in June and a $120 million Series B in November."
  },
  {
    "headline": "Nigerian hacker offers $1 million to disgruntled employees in ransomware scheme",
    "summarized_story": "A Nigerian hacker recently tried to use disgruntled employees of an organisation to run a cyberattack scheme.\nHacker providing link to ransomware file | Image Credit: Abnormal SecurityHow did the hacker get the contact details of the people he contacted?\nAbnormal security also ran an independent check that confirmed he was a Nigerian.\nHacker confirming he’s a Nigeria| Image Credit: Abnormal SecurityInformation found on a Russian social media platform website connecting the hacker to Nigeria.\n| Image Credit: Abnormal SecurityDue to the pandemic and lockdown restrictions in the past year, the digital world has experienced a rise in cyber attacks."
  },
  {
    "headline": "Meet Julaya, a startup solving payment frictions for the World Bank in Ivory Coast",
    "summarized_story": "She has three options – use bank transfers, mobile money, or cash.\nThey also can’t use mobile money due to its limitations and are often forced to rely on inefficient and dangerous cash-based transactions.\nDigitising trade paymentsFounded in 2018, Julaya is a startup that provides businesses in Ivory Coast with mobile-based digital accounts to make money transfers.\nAs a matter of fact, Ivory Coast is one of the largest mobile money markets in francophone West Africa and continental Africa.\nBetween 2016 and 2018, mobile money transactions in the country rose from CFA4.5 trillion ($7.7 billion) to CFA6.3 trillion ($10.8 billion)."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "A Federal High Court sitting in Abuja has granted the Central Bank of Nigeria an order to freeze the accounts of..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Nigeria wants businesses registered in hours, yet it takes months",
    "summarized_story": "Nigeria wants businesses registered in hours, yet it takes monthsHassana (not her real name) is wedged behind her HP workstation with stacks of documents required to register a client’s business in a one-room apartment in Jabi, Abuja.\nOn a table nearby, a scanner and a printer whir along as she spends monotonous hours signing and scanning document after document to upload onto the website…"
  },
  {
    "headline": "Inflows worth N334.5bn to hit Nigeria’s market Wednesday",
    "summarized_story": "Inflows worth N334.5 billion are expected to hit Nigeria’s financial market on Wednesday, raising the system liquidity levels to N406.8 billion from N72.3 billion levels on Friday.\nA breakdown of the inflows showed that a total of N157.2bn worth of maturing Nigerian Treasury Bills (NT-Bills) will be rolled over by the Central Bank of Nigeria…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "OPay’s $2bn valuation equals 33% of Nigeria’s biggest banks",
    "summarized_story": "The new $2 billion (N822bn) market valuation of OPay, the Chinese-backed Africa-focused digital bank, makes it equivalent to a third of the N2.4 trillion market capitalisation of Nigeria’s top five banks.\nThe fintech company on Monday closed a record $400 million funding round led by Japanese-based venture capital finance vehicle, Softbank Vision Fund 2, managed…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Edo imposes restriction on mass gatherings, as Obaseki flags off second phase COVID-19 vaccination – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…only those with proof of one dose of vaccination to access large gatheringsThe Edo State Governor, Mr. Godwin Obaseki, on Monday, flagged off the second phase coronavirus (COVID-19) vaccination exercise, announcing restriction on mass gatherings across the state.\nObaseki, who spoke during the flag-off, at the Government House in Benin City, said those without proof of vaccination will not be allowed access to public places.\nPeople who have not yet been vaccinated at all will depend on remote access to these gatherings.\nHe noted: “In Edo State, the data is very clear, as we have collected 6,306 samples, with 203 confirmed cases and four deaths in the third wave.\nWe are taking the vaccine seriously but we will not shut down Edo State,” he noted."
  },
  {
    "headline": "Obaseki receives Atiku, Ooni of Ife, seeks improved collaboration with traditional institutions to tackle insecurity, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has called for increased collaboration between governments at all levels and the traditional institution to tackle the problem of insecurity and other challenges confronting the country.\nThe governor also received in audience former Vice President, Alhaji Atiku Abubakar.\n“The traditional institution has a role to play, as we encourage our people to farm and produce more foods to feed ourselves.\nIn the first half of this year, we have spent N1 trillion naira importing food and it’s not sustainable.\n“Edo State is the home of culture and tradition and we don’t joke with it."
  },
  {
    "headline": "COVID-19 3rd wave: Edo records 32 new cases, 15 recoveries, as death toll rises to 4 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State has recorded 32 new cases and two recoveries from coronavirus (COVID-19), as the death toll from the virus rises to four in the third wave of the pandemic.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the state governor, Mr. Godwin Obaseki.\nAccording to him, “Edo State, within the last 72 hours, recorded 32 new cases of COVID-19 and 15 recoveries, with 132 active cases currently receiving treatment at various isolation and treatment centres in the state.\nThe 32 new cases were confirmed from the 283 samples collected within the 72-hour time frame.\nReassuring of the government’s commitment to ending the pandemic across all communities in the state, the Incident Manager urged residents to complement the government’s efforts by complying with guidelines to contain the pandemic."
  },
  {
    "headline": "Nat’l Mass Metering Programme: BEDC distributes 40,000 meters to customers – Nigerian Observer",
    "summarized_story": "According to her, despite the COVID-19 induced interruption, between year 2020 and date, BEDC has commissioned some projects to boost network infrastructure and improve power availability to customers in the franchise states.\nOn Commmunity Relations, she said that between 2019 and early this year, the company has connected 108 transformers back to the national grid across the franchise states.\nOf the number, she said that 34 were in Edo, 55 in Delta, 12 in Ondo while seven were in Ekiti states respectively.\nShe expressed as worrisome, the increasing cases of vandalism across the franchise states, with the vandals continuously innovating new approaches.\nShe disclosed that plans are on to introduce and enroll customers on e.billing platform across the states."
  },
  {
    "headline": "Fight against corruption must continue beyond 2023 -Olawepo-Hashim",
    "summarized_story": "ADVERTISEMENTA chieftain of the All Progressives Congress (APC) and former presidential candidate in 2019, Gbenga Olawepo-Hashim, has said for the country to prosper, the fight against corruption must continue beyond 2023 .\nI was the lead actor in a drama skit against corruption on NTA Ilorin Youth scene.\nAccording to Price Water Cooper (PWC), a global Consulting outfit, if not arrested by 2030, corruption will be costing Nigeria 37% of her GDP; i.e.\nREAD ALSO:The businessman and global energy executive, assured that the fight against corruption is winnable, “before some agents of the corrupt start spreading their fatalistic slogan that no one is a saint”.\nIf we are ever going to birth a new Nigeria, it cannot be with the corrupt as midwives.”"
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "PDP crisis: Deputy chairman takes over from Secondus, suspends NWC meeting indefinitely",
    "summarized_story": "The Deputy National Chairman (South) of the Peoples Democratic Party (PDP), Elder Yemi Akinwonmi, has taken over the affairs of the party following the restraining order issued against the National Chairman, Uche Secondus, by a Rivers High Court in Port Harcourt on Monday.\nAkinwonmi cited Section 35 (b) of the PDP Constitution to support his action and suspended the National Working Committee meeting of the party indefinitely.\nRecall that the PDP has been in crisis over attempts by certain individuals within the party to remove Secondus as national chairman.\nYesterday, a Rivers State High Court suspended Secondus following a court case instituted by Ibeawuchi Ernest Alex, Dennis Nina Amadi, Emmanuel Stephen and Umezirike Onucha against him.\nThe applicants sought amongst other prayers an order of interim injunction against Mr Secondus from parading himself as the national chairman of the PDP, which were granted by Justice O. Gbasam at the State High Court in Degema local government area of Rivers state."
  },
  {
    "headline": "Troops rescue 15 abducted commuters in Kaduna",
    "summarized_story": "Troops of Operation Safe Haven have rescued 15 commuters in Jagindi, Jema’a local government area of Kaduna, the state government has said.\nAccording to him, the 15 commuters were kidnapped from two vehicles in the area while in transit.\nHe added that the troops responded to a distress call.\nMr Aruwan added that acting Governor Hadiza Balarabe received the report on the rescue with satisfaction and thanked the troops for their “swift response,” which resulted in the rescue of the commuters.\n“The troops are sustaining search and rescue operations in the area,” said Mr Aruwan"
  },
  {
    "headline": "Bandits attack Nigerian Defence Academy Kaduna, kill three soldiers, abduct others",
    "summarized_story": "Armed bandits have invaded the Nigerian Defence Academy (NDA) in Kaduna State, Northwest Nigeria killing three officers and abducting at least one other, in what represents another dangerous escalation of the security situation in the region.\nNDA is where Nigerian military trains elite cadet officers.\nSources said the bandits invaded the academy dressed in military camouflage and opened fire.\nReports say while three soldiers were killed in the attack, several officers, including at least two majors, were abducted.\n“The attack on the NDA Kaduna is not a rumour, it’s a reality that happened last night,” Sani said via his twitter handle @ShehuSani."
  },
  {
    "headline": "Okoroji to Uzodinma: Restore peace in Imo, says soldiers killing innocent youth tagging them IPOB",
    "summarized_story": "The report added that at least 21 security personnel were killed in three months in Imo State.\n“I want to respectfully all the the governor of Imo State, His Excellency, Hope Uzodinma to bring peace to Imo State.\nImo State needs peace more than anything else.\nThe government of Imo State should urge Buhari and his acolytes to remove the military from Imo State.\n“The federal government should end this military siege in Eastern Nigeria."
  },
  {
    "headline": "NDLEA Arrests 96-yr-old Ex-soldier Over Drug Dealings",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), has arrested a 96-year-old retired soldier, Pa Joseph Owherhi in Suleja area of Niger State for dealing in illicit drugs.\nIn Oyo state, a 35-year-old fashion designer, Abiodun Abubakar, was on Monday, August 23, arrested at Bodija market, Ibadan North LGA with 24.2kg of cannabis sativa.\nA total of 238 kilograms of cannabis and two grams of cocaine were recovered from them.\nIn Kogi State, one Chizoba Francis was also arrested at the weekend in Lokoja with 54kg cannabis hidden in sacks and covered with used footwears.\nIn Ondo state, operatives equally recovered 308 kilograms of compressed cannabis loaded into a Lexus car during a sting operation in Eleyewo area of Akure North LGA at the weekend."
  },
  {
    "headline": "NDLEA Arrests 96-yr-old Ex-soldier Over Drug Dealings",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), has arrested a 96-year-old retired soldier, Pa Joseph Owherhi in Suleja area of Niger State for dealing in illicit drugs.\nIn Oyo state, a 35-year-old fashion designer, Abiodun Abubakar, was on Monday, August 23, arrested at Bodija market, Ibadan North LGA with 24.2kg of cannabis sativa.\nA total of 238 kilograms of cannabis and two grams of cocaine were recovered from them.\nIn Kogi State, one Chizoba Francis was also arrested at the weekend in Lokoja with 54kg cannabis hidden in sacks and covered with used footwears.\nIn Ondo state, operatives equally recovered 308 kilograms of compressed cannabis loaded into a Lexus car during a sting operation in Eleyewo area of Akure North LGA at the weekend."
  },
  {
    "headline": "NDA: Army, NAF Launch Manhunt For Attackers",
    "summarized_story": "The Nigerian Defence Academy (NDA) had said that the Army, Nigerian Airforce (NAF) and other security agencies have launched a manhunt for the attackers of the NDA on Tuesday.\nThis is even as the institution confirmed that two of its officers were killed with another one abducted when the unknown gunmen attacked the premier defence institution.\nHe further said that the NDA community and Cadets were safe in the Academy and assured the general public that the unknown gunmen would soon be apprehended and the abducted personnel rescued.\nMeanwhile, LEADERSHIP had earlier gathered that two officers were indeed killed but four others were abducted during the attack.\nCompetent security source, who spoke with our correspondents on telephone, said the incident occurred at about 1am on Tuesday morning at the permanent site of the nation’s defence institution."
  },
  {
    "headline": "NDA: Army, NAF Launch Manhunt For Attackers",
    "summarized_story": "The Nigerian Defence Academy (NDA) had said that the Army, Nigerian Airforce (NAF) and other security agencies have launched a manhunt for the attackers of the NDA on Tuesday.\nThis is even as the institution confirmed that two of its officers were killed with another one abducted when the unknown gunmen attacked the premier defence institution.\nHe further said that the NDA community and Cadets were safe in the Academy and assured the general public that the unknown gunmen would soon be apprehended and the abducted personnel rescued.\nMeanwhile, LEADERSHIP had earlier gathered that two officers were indeed killed but four others were abducted during the attack.\nCompetent security source, who spoke with our correspondents on telephone, said the incident occurred at about 1am on Tuesday morning at the permanent site of the nation’s defence institution."
  },
  {
    "headline": "Tight Security At NDDC Headquarters Over Planned Protest",
    "summarized_story": "There was a heavy security beef-up at the headquarters of the Niger Delta Development Commission (NDDC) in Port Harcourt on Tuesday, following planned protest by youths from the Niger Delta region.\nADVERTISEMENTBut the protesters, who gathered at a distance on the same road, vowed never to back out from the planned protest, despite the intimidating presence of security operatives.\n“We have gathered that the NDDC is already recruiting some thugs to disrupt the peaceful move of the youths of the region.\n“We also call on youths of the region to come out en masse for this move to restore legitimacy on the NDDC.\nWe further encourage the over 2000 youths that will be taking part in this protest to conduct yourselves peacefully.”"
  },
  {
    "headline": "N-Power: FG receives six million applications, selects one million",
    "summarized_story": "The Federal Government has selected one million persons as N-Power Batch C1 beneficiaries after receiving over six million applications for the social intervention programme.\n“Based on this approval, the (N-Power) portal was again opened in June 2020 and over six million new applications were received.\nOne million beneficiaries will be mined from this as the N-Power Batch C,” Farouq said.\nStream C1 of 510,000 beneficiaries and stream C2 for 490,000 beneficiaries.\n“Today we are here to flag-off the N-Power Batch C1."
  },
  {
    "headline": "N-Power: FG receives six million applications, selects one million",
    "summarized_story": "The Federal Government has selected one million persons as N-Power Batch C1 beneficiaries after receiving over six million applications for the social intervention programme.\n“Based on this approval, the (N-Power) portal was again opened in June 2020 and over six million new applications were received.\nOne million beneficiaries will be mined from this as the N-Power Batch C,” Farouq said.\nStream C1 of 510,000 beneficiaries and stream C2 for 490,000 beneficiaries.\n“Today we are here to flag-off the N-Power Batch C1."
  },
  {
    "headline": "Senate orders AGoF: Release officials indicted in N378m tax waiver to EFCC",
    "summarized_story": "The directive was contained in the report of the Senate Public Accounts Committee, which was approved by the red chamber in June.\nThe Senate, based on the consideration of its committee on Public Accounts, established that some officials of the Office Accountant-General of the Federation signed a controversial tax waiver agreement with a private firm, Webb Fontaine Limited, which caused the Federal Government to lose N378m Withholding Tax.\nThe SPAC established that N3.7bn was paid to Webb Fountain Limited without deducting the Withholding Tax, which invariably led to a loss of tax revenue of N378m to the Federal Government.\nThe report read in part, “The sum of N3.7bn was paid to Web Fountain Limited without deduction of Withholding Tax.\nThe Senate added, “The accountant-general should recover the sum of N378m from Webb Fountain Limited and remit it to the Federal Inland Revenue Service."
  },
  {
    "headline": "Senate orders AGoF: Release officials indicted in N378m tax waiver to EFCC",
    "summarized_story": "The directive was contained in the report of the Senate Public Accounts Committee, which was approved by the red chamber in June.\nThe Senate, based on the consideration of its committee on Public Accounts, established that some officials of the Office Accountant-General of the Federation signed a controversial tax waiver agreement with a private firm, Webb Fontaine Limited, which caused the Federal Government to lose N378m Withholding Tax.\nThe SPAC established that N3.7bn was paid to Webb Fountain Limited without deducting the Withholding Tax, which invariably led to a loss of tax revenue of N378m to the Federal Government.\nThe report read in part, “The sum of N3.7bn was paid to Web Fountain Limited without deduction of Withholding Tax.\nThe Senate added, “The accountant-general should recover the sum of N378m from Webb Fountain Limited and remit it to the Federal Inland Revenue Service."
  },
  {
    "headline": "Breaking: Bandits invade Nigerian Defence Academy, kill 2 soldiers",
    "summarized_story": "Bandits have reportedly attacked the premises of the Nigerian Defence Academy in Kaduna and shot two soldiers dead.\nAccording to reports, the bandits invaded the institution on Tuesday at about 1.00am.\nA statement issued by NDA’s Public Relations Officer, Major Bashir Muhd Jajira on Tuesday said “the security architecture of the Nigerian Defence Academy was compromised early this morning by unknown gunmen who gained access into the residential area within the Academy in Afaka.\n“The NDA community and Cadets are safe in the Academy.\nWe assure the general public that this unknown gunmen would soon be apprehended and the abducted personnel rescued.”"
  },
  {
    "headline": "Oliver Andrews appointed Transcorp non-executive director",
    "summarized_story": "By Itohan Abara-LaserianThe Board of Directors, Transnational Corporation of Nigeria (Transcorp) Plc, has formally announced the appointment of Mr Oliver Andrews, as an Independent Non-Executive Director.\nMrs Kofo Olokun-Olawoyin, secretary of the board posted the notice on the website of the Nigerian Exchange Limited (NGX).\nAndrews has over 35 years experience in infrastructure development, investing, public-private partnerships and strategic advisory work, such as advising and partnering with governments, regional, international corporations and development finance institutions.\n“In addition, Andrews pioneered the project development asset class at AFC and led the strategic formulation and business development, portfolio management and execution of investments.\n“He previously served as CEO of TCI Infrastructure and the Gambia Ports Authority,” it added."
  },
  {
    "headline": "BREAKING: PDP Deputy Chairman Steps In, Suspends NWC Meeting Indefinitely",
    "summarized_story": "The Deputy National Chairman (South) of the Peoples Democratic Party, Elder Yemi Akinwonmi, has taken over the affairs of the party following the restraining order issued against the National Chairman, Uche Secondus, by a Rivers High Court in Port Harcourt on Monday.\nAkinwonmi cited Section 35 (b) of the PDP Constitution to support his action and suspended the National Working Committee meeting of the party indefinitely.\nRecall that a High Court of Rivers State on Monday stopped the embattled Prince Uche Secondus from parading himself as National Chairman or member of the Peoples Democratic Party (PDP).\nJustice O. Gbasam of the Degema Judicial Division Vacation Court sitting in Port Harcourt granted the injunction following a suit No: PHC/2183/CS/2021 filed by Ibeawuchi Ernest Alex, Dennis Nna Amadi, Emmanuel Stephen and Umezirike Onucha against Uche Secondus (1st defendant) and the PDP (2nd defendant).\nAfter listening to the submission of the applicants, the judge granted the interim injunction restraining Secondus from parading himself as the National Chairman of the PDP."
  },
  {
    "headline": "2023 Election: PDP’ll Take Over Power From Buhari, APC – Atiku",
    "summarized_story": "Atiku Abubakar, the former presidential candidate of the Peoples Democratic Party, PDP, has stated that the party will return to power in 2023.\nAtiku said PDP would be strengthened to take over power from the All Progressives Congress, APC, in 2023.\nThe former presidential candidate disclosed that the meeting with Obaseki “centred on governance, current issues in the country and how to strengthen” the former ruling party ahead of 2023.\nOn his part, Obaseki commended Atiku for his leadership and support during the last election in the state.\n“We had challenges, but you stepped up and threw your weight behind the resolution of the issues.”"
  },
  {
    "headline": "Court Strikes Out DSS Suit Seeking Further Detention Of Igboho’s Aides.",
    "summarized_story": "Justice Obiora Egwuatu of the Federal High Court in Abuja has dismissed a request made by the Department of State Service, DSS, seeking the continued custody of four of Sunday Igboho’s 12 assistants.\nThe motion was thrown out by the Judge on Tuesday following its dramatic withdrawal by counsel to the DSS, Mr Idowu Awo.\nAt the resumption of the matter, when the motion was to be heard, DSS lawyer stunned the court when he announced his decision not to go ahead with the matter.\nRather than going ahead with the motion, the counsel informed the court that he had filed a notice of appeal against the bail granted to the four out of the 12 detainees and that he would prefer to pursue the appeal at the Court of Appeal.\nJustice Egwuatu subsequently struck out the motion following the no objection by the detainee’s lawyer, Mr Sunday Adebayo."
  },
  {
    "headline": "Bandits Killed 2 Officers & Abducted 2 – Defence Headquarters",
    "summarized_story": "Bandits broke through the security walls of the National Defence Academy (NDA) and kidnapped an officer, according to the Defence Headquarters in Abuja.\nLEADERSHIP earlier reported that armed bandits attacked the premier defence institution in the wee hours of Tuesday, killing two officers and abducting four others.\nBut Sawyerr said the bandits sneaked into the NDA complex at about 0215 hours and abducted an officer and killed two other officers.\nHe said the operation was well planned as the bandits knew exactly who they wanted and went straight to his accommodation.\n“Yes the NDA security was breached by bandits, they sneaked in at about 02:15 hours."
  },
  {
    "headline": "VIDEO: Horror as LASTMA official falls off moving truck in attempt to arrest driver",
    "summarized_story": "A video which showed moment an unidentified official of the Lagos State Traffic Management Authority (LASTMA) fell off a moving truck while trying to arrest a driver, is trending on social media.\nThose who captured the incident on video, were heard asking if clinging to a moving truck is part of the traffic official’s job description.\nThis was said just before the LASTMA official was seen rolling on the floor after falling off the truck.\nNo official statement from the authorities as the time of filling this report."
  },
  {
    "headline": "Brute force only way out of banditry, kidnapping – El-Rufai",
    "summarized_story": "Kaduna state Governor Nasir El-Rufai has said the best way out of banditry and other forms of violent criminality is to hunt and kill all of them.\nHe said: “That is the position of Kaduna State government and that of our counterpart in Niger.\nThe state Commissioner for Internal Security and Home Affairs, Mr Samuel Aruwan said this Monday in a statement.\nHe said the troops repelled the kidnappers and rescued their victims, adding that intensive search and rescue was ongoing in the area.\n“Troops of Operation Safe Haven have reported to the Kaduna state government the rescue of 15 commuters in Jagindi, Jema’a LGA,” Aruwan said."
  },
  {
    "headline": "Breaking: PDP crisis worsens as court ‘sacks’ Secondus as National Chairman",
    "summarized_story": "The crisis rocking the Peoples Democratic Party (PDP) seems to be far from being over as a High Court in Port Harcourt, Rivers state granted an interim order restraining Prince Uche Secondus from parading self as the National Chairman of the party.\nThe opposition party has been in crisis following the resignation of some national officers and the stringent call by some stakeholders for the resignation of the national chairman over what they described as poor leadership.\nHowever, in an interim order made available to Blueprint, dated August 23, 2021 signed by Honourable Justice (Dr), O. Gbasam and the Assistant Chief Registrar (Litigation), Patricia N. Victor Nwoka, the court restrained Secondus from performing functions of the PDP National Chairman.\nWhile the defendants are Prince Uche Secondus and Peoples Democratic Party (PDP).\n1 William Jumbo Street, old G. R. A Port Harcourt, Rivers State and by publication in the Nation Newspaper."
  },
  {
    "headline": "Humanitarian: flags off commencement of N-power batch C -NigPilot",
    "summarized_story": "“Based on this approval, the portal was again opened in June 2020, and over 6 million new applications were received.\n1,000,000 beneficiaries will be mined from this as the NPower Batch C.“The batch C is divided into 2 streams.\nUnder the Batch C1, a total of 450,000 have been selected to benefit under the graduate component, while 6ve been selected to benefit under the graduate component, while 60,000 beneficiaries will be non-graduate beneficiaries” she said.\nTo also curb the communication challenges of the entire scheme, the ministry has created a more favourable platform.\nAccording to her, the scheme has 3 core segments: N-Power Volunteer Corps which is the Graduate programme, N-Power Build, which is a Non-Graduate programme and N-Power Knowledge – Which is also a non-graduate programme but deliberately designed on ICT skills."
  },
  {
    "headline": "Late Fawehinmi: “We lost a strong brother, friend and partner in the struggle” – NCP -NigPilot",
    "summarized_story": "“Mohammed was a humble legal practitioner, lover of all that came his way.\n“We lost a strong brother, friend, and partner in the struggle.\n“When we lose someone we love, we must learn not to live without them, but to live with the love they left behind”.\n“He saw his legal calling as a task that must be done the exact way his late father, chief Gani does, and he committed everything that he had into that project until he breathed his last.\nBabatunde Mohammed Fawehinmi was a true son of Gani, detribalized and believed in Nigeria."
  },
  {
    "headline": "FG unveils homegrown social innovations in health -NigPilot",
    "summarized_story": "Federal Government has unveiled indigenous health social innovations which when developed, would contribute positively to improving healthcare delivery in the country.\nThe innovations were made possible through the Social Innovation in Health SIHI, Nigeria Hub, and a branch of the SIHI global network, which is domiciled under the World Health Organisation WHO.\nHe urged the Organised Private Sector OPS, to invest more and partner with social innovation programs.\nSpeaking also, the team leader of SIHI, Prof.\nEmeritus Obioma Nwaorgu noted that Social Intervention in Health Initiative helps to address the health care delivery gap."
  },
  {
    "headline": "Three new Per Secs resume duties in Head of Service -NigPilot",
    "summarized_story": "Three new Permanent Secretaries have assumed duty in the Office of the Head of the Civil Service of the Federation, in sequel to a circular signed by its principal Dr. Folasade Yemi-Esan and approved by President Muhammadu Buhari.\nThe Permanent Secretaries are Alhaji Ibrahim Yusuf, Dr. Ngozi Onwudiwe, and Dr. Marcus Ogunbiyi who were deployed to Common Services Office, CSO, Staff Welfare Office, SWO, and Common Management Office, CMO, respectively.\nSpeaking during the handing over, Alhaji Ibrahim promised to adhere to open and transparent fiscal best practices in the discharge of his duties, adding that his appointment comes as a trust which must never be betrayed.\nSimilarly in his own speech, Dr. Ogunbiyi promised to run an open-door policy and work with all staff to deliver the mandate of his office, just as Dr. Ngozi appealed for all hands to be on deck so as to move the service forward."
  },
  {
    "headline": "BREAKING: Bandits Attack NDA, Kill Two Officers, Abduct One",
    "summarized_story": "Bandits have attacked the permanent site of the Nigerian Defence Academy in Kaduna State, killing two officers and abducting one other officer.\nThe Spokesman for the academy in the state Major Bashir Muhd Jajira confirmed that that the incident occurred in the early hours of Tuesday.\n“The security architecture of the Nigerian Defence Academy was compromised early this morning by unknown gunmen,” Jajira said in a statement.\nA combined team of security operatives has now launched a manhunt of the bandits inside the bush including air surveillance with a view to arresting them and rescuing the kidnapped officer.\nThe Nigerian Defence Academy is located few metres away from the Federal College of Forestry Mechanization Afaka, in Igabi Local Government Area of Kaduna State, where 39 students were abducted by bandits in March."
  },
  {
    "headline": "‘PDP Is Bigger Than Desperadoes’: Secondus Reacts To Court Order On His Position",
    "summarized_story": "Mr Uche Secondus has reacted to the court order restraining him from acting as the National Chairman of the Peoples Democratic Party (PDP).\n“If Secondus and the party are taken to court, they will defend themselves,” Secondus’ media aide, Ike Abonyi, said in a statement on Monday.\nAmid calls for the resignation of the PDP national chairman, seven national officers of the party resigned from their roles on August 3.\nThe affected officers claimed that they were being side-lined and treated unfairly by Secondus, but the PDP national chairman denied the allegation.\nJustice Gbasam also made an order restraining the PDP national chairman from parading as a member of the party, or other related functions."
  },
  {
    "headline": "Court Restrains Secondus From Acting As PDP National Chairman",
    "summarized_story": "A High Court in Rivers State has granted an interim order restraining Mr Uche Secondus from parading or acting as the National Chairman of the Peoples Democratic Party (PDP).\nJustice Okogbule Gbasam of the Degema Division of the Rivers State High Court sitting in Port Harcourt gave the order on Monday.\nREAD ALSO: Secondus Reacts To Court JudgementSecondus and the main opposition party were listed as the first and second respondents to the suit.\nDespite their position, there have been calls from some members of the party demanding the resignation of the PDP national chairman.\nHowever, the controversy has taken a new twist with the court order restraining Secondus from parading as the PDP national chairman, pending the hearing and determination of the motion on notice for interlocutory injunction."
  },
  {
    "headline": "COVID-19: 1,094 Returning Travellers Have Absconded From Isolation, Says Sanwo-Olu",
    "summarized_story": "Over 1,000 returning travellers from red-listed countries – India, South Africa, Brazil, and Turkey – have absconded from isolation in Lagos State, the government alarmed on Monday.\nHe explained that the COVID-19 protocols on mandatory isolation were put in place by the Presidential Steering Committee to protect Nigeria from an imminent third wave of the COVID-19 pandemic.\nEpidemiology UpdateAs of the 21st of August 2021, Lagos State had recorded a total of 70,563 confirmed cases of COVID-19.\nThe COVID-19 protocols on mandatory isolation were put in place by the Presidential Steering Committee to protect the country from an imminent third wave of the COVID-19 pandemic.\nIf you’re showing symptoms or suspect you may have contracted the disease, isolate yourself and contact 0800-0356633 immediately, if you’re in Lagos State."
  },
  {
    "headline": "PHOTOS: Celebration As Team Nigeria Returns After World Athletics U-20 Championships",
    "summarized_story": "After a successful outing at the World Athletics U-20 Championships in Nairobi, Kenya, Nigerian athletes have returned home to a rousing welcome.\nThe team touched down at the Nnamdi Azikwe International Airport, Abuja on Tuesday.\nThey were received by Minister of Sports and Development, Mr. Sunday Dare, Minister of Women Affairs, Pauline Tallen, and President of the Athletics Federation of Nigeria (AFN), Tonobok Okowa.\nNigeria won four gold and three bronze medals to finish third on the medal table.\nOver 110 countries participated in the biennial junior track and field competition."
  },
  {
    "headline": "Just In: IGP meets with Gov Obaseki, seeks collaboration on Community Policing",
    "summarized_story": "The Inspector General of Police, Usman Alkali Baba has met with the governor of Edo State, Godwin Obaseki, at the government house in Benin City.\nAddressing the Governor, the IGP said he is in the State to meet with the officer and men of the police to have a firsthand information of how the officers are fairings in terms of welfare and mobilization.\nHe also called for more collaboration in the area of community policing as he rates Edo high is such regards."
  },
  {
    "headline": "We have the manpower, equipment to protect schools – Minister",
    "summarized_story": "The minister of Police Affairs, Maigari Dingyadi, has disclosed that the Nigeria Police Force is well equipped to protect schools across the country.\nSpeaking at a two-day conference on the achievement of the ministry in Abuja, Mr Dingyadi said the force has qualified personnel and state of the art equipment to ensure schools are safe.\nHe added that personnel are equally deployed, but admitted that they are sometimes overwhelmed.\nOperatives are deployed to protect schools.\nJust that sometimes they overwhelm them,” the minister said."
  },
  {
    "headline": "NDA Confirms security breach, killing of 2 personnel, abduction of 1",
    "summarized_story": "The security architecture of the Nigerian Defence Academy according to a statement signed by the Academy Public Relations Officer, Major Bashir Muhammed Jajira was compromised early Tuesday morning by unknown gunmen who gained access into the residential area within the Academy in Afaka.\nMajor Jajira said during the unfortunate incident, two military personnel were killed while another was abducted.\nThe Academy according to him in collaboration with the 1Division Nigerian Army and Air Training Command as well as other security agencies in Kaduna state has commenced the pursuit of the unknown gunmen within the general area with a view to tracking them and rescue the abducted personnel.\nThe NDA community and Cadets according to him are safe in the Academy.\nHe assured the general public that the unknown gunmen will soon be apprehended and the abducted personnel rescued."
  },
  {
    "headline": "Bandits Invade Nigerian Defence Academy in Kaduna, Kill Two Officers, Abduct One",
    "summarized_story": "Armed bandits have invaded the Nigerian Defence Academy (NDA), Afaka in northern Kaduna state, killing two officers.\nARISE News is yet to confirm the identity of the officers killed but reports suggest an undisclosed number of officers were also abducted in the raid.\nSources within the barracks said the bandits also abducted two majors.\nOne of the officers who was injured in the attack is currently being treated at a hospital within the barracks.\nThere are however fears, that the bandits may decide to kill the officers in a bid to escape."
  },
  {
    "headline": "THISDAY Launches WhatsApp Edition With Free Delivery to 73m MTN Subscribers",
    "summarized_story": "THISDAY Newspapers has launched a WhatsApp edition to deliver the digital PDF copy of its newspapers to over 73 million MTN subscribers for a free download on the MTN Zigi Chatbot.\nLaunched last year, the MTN Zigi Chatbot, is the telco’s new digital personal assistant that can answer questions, and assist subscribers with products, services, and activations.\nZigi chats in English language and she is available to chat with both existing MTN customers and non-MTN customers as a guest.\nThe Zigi chatbot saves the time of customers waiting for customer care representative to respond to question.\nCommenting about ‘Zigi,’ the Chief Customer Relations Officer, MTN Nigeria, Ugonwa Nwoye, said, “Zigi offers personalised, intuitive and prompt service to our customers."
  },
  {
    "headline": "High Hopes as Zambia Swears in Hakainde Hichilema",
    "summarized_story": "Veteran opposition leader Hakainde Hichilema will be sworn in as the seventh president of Zambia on Tuesday, after getting more than 2.8 million votes to President Edgar Lungu’s 1.8 million votes, achieving one of the biggest electoral wins in the country’s history.\nHichilema, a 59-year old businessman contesting the presidency for the sixth time, promised democratic reforms, investor-friendly economic policies, better debt management as well as “zero tolerance” to corruption.\nZambia recorded economic progress for more than a decade and achieved middle-income status in 2011, but now the country is beset by high inflation, high debt and allegations of corruption.\nLockdown measures pushed Zambia into its first recession since 1998 and the economy contracted by 1.2%, according to the World Bank.\nHowever, fears of a reversal of those gains emerged recently as Lungu closed some media houses and detained critics."
  },
  {
    "headline": "Nigeria: Katsina Governor Masari Insists That Citizens Acquiring Arms to Repel Bandits Way To Go",
    "summarized_story": "His words: “When we came on board in 2015, we inherited killings and banditry in the state.\nIn 2014, there was a single attack that claimed over 100 lives around Faskari and Sabuwa LGAs.\n“At that time, Fulani women had stopped coming to town and farmers too had stopped going to the bush.\nWe later discovered that it was not a problem of Katsina State alone, it’s a problem that affected Niger, Zamfara, Kaduna States and later, Sokoto, Kebbi and Jigawa.\n“This was how the dialogue stopped especially, around villages bordering Zamfara before the 2019 election."
  },
  {
    "headline": "Nine Women Now Serving as Governors in US, Tying a Record",
    "summarized_story": "A century after women gained the right to vote, 19 states still have never been led by a woman.\nDoug Ducey can’t run again, the field already has several candidates who are women, including Republican state Treasurer Kimberly Yee and Democratic Secretary of State Katie Hobbs.\nArizona already holds the record for the most women who have served as governor — four.\nThe incumbent, Republican Gov.\nPart of the challenge in electing women as governors is overcoming stereotypes of men as stronger, more decisive leaders, Walsh said."
  }
]