[
  {
    "headline": "After 23 years of battling infertility, failed IVF, I conceived twins naturally – 49-year-old school proprietor",
    "summarized_story": "Mrs. Modupe Gabriel, a school proprietress in Lagos, however, defied the odds by conceiving naturally at age 49 and giving birth to twins.\nThe feat was also remarkable because Mrs. Gabriel had battled infertility for over 23 years and even had a failed IVF.\nLARA ADEJORO writes on the remarkable story of Mrs. Gabriel and the contentious medical issues about women with late pregnancies.\nPregnancy after age 45 likely, but rareHer late pregnancy is rare, but she is certainly not alone.\nWhile there is no national data on women with late pregnancy without reproductive assistance, findings show that few women in their late 50s have natural conception and deliver healthy babies."
  },
  {
    "headline": "After 23 years of battling infertility, failed IVF, I conceived twins naturally – 49-year-old school proprietor",
    "summarized_story": "Mrs. Modupe Gabriel, a school proprietress in Lagos, however, defied the odds by conceiving naturally at age 49 and giving birth to twins.\nThe feat was also remarkable because Mrs. Gabriel had battled infertility for over 23 years and even had a failed IVF.\nLARA ADEJORO writes on the remarkable story of Mrs. Gabriel and the contentious medical issues about women with late pregnancies.\nPregnancy after age 45 likely, but rareHer late pregnancy is rare, but she is certainly not alone.\nWhile there is no national data on women with late pregnancy without reproductive assistance, findings show that few women in their late 50s have natural conception and deliver healthy babies."
  },
  {
    "headline": "Studies have shown it’s possible to outgrow asthma –Physician",
    "summarized_story": "Godfrey GeorgeAn Ogun State-based general practitioner, Dr. Shina Ajidahun, speaks to GODFREY GEORGE about asthma and its managementWhat is asthma?\nThere are things that can trigger asthma.\nWhen a child is exclusively breastfed, it would help the child to withstand these issues, studies have shown.\nFrom what I explained, there are a lot of things that can trigger asthma, such as dust, smoke, pollution, etc.\nStudies have shown that some people can actually outgrow asthma but this is not for everyone."
  },
  {
    "headline": "Studies have shown it’s possible to outgrow asthma –Physician",
    "summarized_story": "Godfrey GeorgeAn Ogun State-based general practitioner, Dr. Shina Ajidahun, speaks to GODFREY GEORGE about asthma and its managementWhat is asthma?\nThere are things that can trigger asthma.\nWhen a child is exclusively breastfed, it would help the child to withstand these issues, studies have shown.\nFrom what I explained, there are a lot of things that can trigger asthma, such as dust, smoke, pollution, etc.\nStudies have shown that some people can actually outgrow asthma but this is not for everyone."
  },
  {
    "headline": "BRT Passenger’s Disappearance: Police nab 2, ask public for help",
    "summarized_story": "Confirming the arrest, the Police Public Relations Officer, CSP Adekunle Ajisebutu, said: “As soon as the report got to the police, investigation into the disappearance of Oluwabamise was immediately initiated .\n“To ensure a speedy and diligent investigation, the Commissioner of Police, Abiodun Alabi, immediately directed the State Criminal Investigation Department, Panti, to take over the case.\nThe Command appealed to anyone with useful information that could help the investigation to come forward.\nHow she disappearedOluwabamise’s whereabouts had been unknown since she boarded a BRT bus at the Chevron area of Lekki en route to Oshodi on February 25.\nShe became apprehensive when the yet-to-be-identified driver told her to sit at one of the back seats."
  },
  {
    "headline": "Why governors should be given more security control — Plateau commissioner",
    "summarized_story": "The Commissioner for Information and Communication in Plateau, Mr Dan Manjang, has suggested that state governors should be given more control over security apparatuses in their domain for effective community policing.\nHe noted that it was pertinent to have community policing as the security employees had a better knowledge of the terrain and the individuals in communities.\nHe said that there could not be an effective community policing under the current structure of the state governors who, as the chief security officers of their states, “have very little control over the security of their states.\n“Before they act concerning the security issues pertaining to their states they have to seek permission from the various security bodies.\n“The governor is the chief security officer of the state, but he cannot command troops."
  },
  {
    "headline": "2023 Elections: Resist being used for Do-or-Die politics, ballot snatching — Amb Buratai tasks Nigerian youths",
    "summarized_story": "**Charges them to embrace Political Dynamism and rout out ballot snatching, voter apathy and arson.\n“Political dynamism can be defined as vigorous political activity that is geared towards progress, and strength in the polity.\n“Throughout my time in the Army, I’ve met with many groups of young people, including youth groups, student groups, and young leaders.\n“The Sardauna started to experiment with his leadership qualities right from Katsina Teachers’ College, and later on, through political dynamism characterized by the inclusiveness of all ethnic nationalities in the North.\nAll three of these great leaders practised political dynamism characterized by non-violence, patriotism, human development, and service to humanity."
  },
  {
    "headline": "Lagos hospital abandoned my husband inside ambulance to die — Bereaved wife",
    "summarized_story": "Sunday Vanguard gathered that Atepasile, a father of four, died as a result of the injuries he sustained.\nThree hospitals rejected him after which he was taken to the Lagos University Teaching Hospital (LUTH), Idi-Araba where he passed on the following day.\nWife’s accountMrs Tijani Atepasile, wife of the deceased, who could not hold back tears, spoke to Sunday Vanguard, saying her husband died inside ambulance at LUTH premises six hours after he was brought to the hospital without being attended to.\n“If my husband had been taken to a private hospital he wouldn’t have died”.\n“The lawyer who engaged his services was inside his flat but came to join us there and took him to another hospital”, he narrated."
  },
  {
    "headline": "My hubby mysteriously disappeared after meeting lover in hotel — Ibadan housewife",
    "summarized_story": "Michael Ojo, a solar installer, was last seen on October 10, 2021, in the company of a lady with an undisclosed identity in a hotel.\n“The first number was his mother’s, the second number was mine and the third number was his ex-girlfriend.\n“The police later arrested the ex-girlfriend who revealed that they both went to a hotel together that evening.\nThe police went to the hotel and they confirmed that they both checked out but that the lady left him in front of the hotel.\n“However, his ex-girlfriend revealed that when they were together in the hotel Michael was receiving a video call."
  },
  {
    "headline": "War: WHO confirms multiple deaths, injuries, Ukraine’s health care facilities attacked",
    "summarized_story": "The World Health Organization (WHO) has confirmed “several attacks on health care facilities in Ukraine, causing multiple deaths and injuries.\n“@WHO has confirmed several attacks on health care in #Ukraine, causing multiple deaths and injuries.\nAdditional reports are being investigated“Attacks on healthcare facilities or workers breach medical neutrality and are violations of international humanitarian law.\nOur @WHOUkraine staff will distribute it across the country to support health facilities in need.\nWe need safe passage for our staff to support delivery and continuation of essential health services for the most vulnerable.”Meanwhile, WHO has confirmed six attacks on health care facilities so far."
  },
  {
    "headline": "What Obasanjo told me when we were sentenced to life imprisonment – Shehu Sani",
    "summarized_story": "A former federal lawmaker and activist, Shehu Sani has revealed the exact words of former President Olusegun Obasanjo when both men were sentenced to life imprisonment in 1995.\nRecall that Obasanjo was arrested and convicted of being part of a planned coup in 1995, having been openly critical of the government of military dictator, Sani Abacha.\nHe was imprisoned despite protesting his innocence and there in the prison, Obasanjo was said to have became a born again Christian.\nSani found luck and was released from life imprisonment when democracy was restored in Nigeria in 1999.\n'”Sani recalled yesterday that when they were in Kiri Kiri prison together, no prisoner wanted to serve Obasanjo because he hardly remains food for the boys who washed their dishes."
  },
  {
    "headline": "AfricaNXT 2022: NCC pulls largest gathering, says 5G is safe",
    "summarized_story": "The NCC team explained to the excited audience how 5G will power a plethora of applications, innovation and creativity.\nWhile explaining the security, safety and speed characteristic of 5G, the panel reasoned that, while 4G has a response time of 10 millisecond, equivalent of the capacity of human brain, 5G network is even faster.\nWhen asked if the country was ready for 5G, the panel declared that, “Nigeria is ready for 5G because the NCC has been supported by key stakeholders to make Nigeria ready.\nHe also underscored the need for sustenance of collaborative efforts among tiers of government and all other stakeholders to ensure effective utilization of 5G services across all sectors.\nThe well-attended panel discussion, which focused on, “Moving Forward Steadily: Socio-Economic Significance of Development of 5G Services” was moderated by NCC’s Head of Online Media, Dr. Omoniyi Ibietan."
  },
  {
    "headline": "Imbibe Lisabi’s virtues, shun cultism, money ritual – Abiodun charges youth",
    "summarized_story": "Ogun State Governor, Dapo Abiodun has called on the youths to imbibe the courageous and patriotic spirit of the legendary Lisabi and shun cultism and money rituals.\nOur youth should shun cultism, money rituals and all other anti social behavior.\n“We have renovated 41 schools in Ogun Central in the first phase of our rehabilitation plan of schools in Ogun State.\n“In all, the above is to show that Egbaland and its people remain vital in our development programme for Ogun State.\nThat mass transit will be a revolution to road public transportation not only in Ogun State but in Nigeria."
  },
  {
    "headline": "Fuel scarcity: Buhari told to probe spending on refineries or face legal action",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has called on President Muhammadu Buhari to “direct Mr Abubakar Malami, the Attorney General of the Federation and Minister of Justice, and appropriate anti-corruption agencies to probe the spending on Nigeria’s four refineries, and alleged mismanagement of public fund budgeted for the rehabilitation, operation, and maintenance of the refineries since 1999 or face legal action.\nSERAP also urged Buhari to direct Malami and appropriate anti-corruption agencies to bring to justice anyone suspected to be responsible for the importation and distribution of dirty fuel into Nigeria.\nSERAP’s letter partly read, “Investigating and prosecuting allegations of corruption and mismanagement in the spending on the refineries would be entirely consistent with constitutional guarantees and international standards.\nIt may also galvanize public support for your government’s anti-corruption efforts.\nThe organization is concerned that fuel scarcity in different parts of Nigeria has subjected a lot of Nigerians to harsh social and economic conditions, making them unable to develop their abilities and realize their potential."
  },
  {
    "headline": "Tit bits from Davido’s UK concert at O2 arena",
    "summarized_story": "On Thursday, March 3, 2022, at about 6PM, the management of The O2 Arena in London, UK, announced that tickets for Davido’s concert scheduled for Saturday, March 5, 2022 had been officially sold out.\nThe management of O2 arena tweeted: “Davido has officially sold out at #TheO2 #DavidoatTheO2”.\nHe opened the show with his 2103 monster hit song, Skelewu.\nThe two singers were overwhelmed by the excitement that was visible in the attendees response to the monster hit song.\nHe also performed his monster hit song, Aye, Gobe and many others to the fans’ acceptance and excitement."
  },
  {
    "headline": "Police arrest two suspects over missing BRT passenger",
    "summarized_story": "The Lagos State Police Command has confirmed the arrest of two suspects in the case of 22-year-old Ayanwole Oluwabamise, who went missing after boarding a Bus Rapid Transport (BRT) service on February 26.\nGiving update on the case, police spokesman, CSP Adekunle Ajisebutu, said the suspects in custody were assisting investigation.\n“In the course of ongoing investigation, two suspects have been arrested and are currently helping in our investigation.\nin Ekiti State, is about 5 feet plus tall, dark in complexion and speaks Yoruba and English languages well.\n“This isolated incident notwithstanding, the Police Command is committed to protecting lives and properties of all residents of the state at all times.”"
  },
  {
    "headline": "UPDATED: Another batch of evacuees arrive from Ukraine",
    "summarized_story": "UPDATED: Another batch of evacuees arrive from UkraineAnother batch of 306 Nigerians have been evacuated from Ukraine.\nThe Federal Government has also set in motion arrangement for the evacuation of Nigerian students in Sumy.\nThis follows the intervention of Minister of Foreign Affairs, Geoffrey Onyeama, who spoke with his Ukrainian counterpart, Dymtro Kuleba on how to quickly evacuate Nigerians in Sumy.\nAccording to report, there are over 500 Nigerian students in Sumy.\nThe Minister also assured the students that government was doing everything possible for their safety and speedy evacuation."
  },
  {
    "headline": "Ex-gov Okorocha dragged to International Criminal Court",
    "summarized_story": "A pro-life advocate and neuroscientist, Prof (Dr.) Philip Njemanze, has petitioned the International Criminal Court (ICC), over the demolition of the ancestral Eke Ukwu Owere Market, Owerri.\nThe medical practitioner had also petitioned UNESCO to lament demolition of heritage and ancestral sites in Owerri by the Okorocha administration, now a Senator of Imo West.\nOn August 26, 2018, then Imo State Governor, Rochas Okorocha had demolished the Eke Ukwu market, pulling down stalls and destroying goods worth over N1 billion.\n“To mandate UNESCO World Heritage Centre’s investigators in collaboration with the Federal Ministry of Information and Culture to further uncover the facts of the historical sites in Owerri using the indigenous knowledge base, for enlistment and protection under the UNESCO World Heritage Convention.\nFour years after the demolition of the market, Governor Hope Uzodimma, has embarked on rebuilding the market."
  },
  {
    "headline": "Fresh facts emerge on woman, 22, missing from BRT",
    "summarized_story": "Elizabeth told our correspondent yesterday that her missing sister was heading to the brother’s house at Ikotun to stay with the wife who was in ‘labour’.\nShe reportedly boarded the bus with number 240257 at 7:30pm and became suspicious when the driver told her to sit at one of the back seats.\nWhen she entered the BRT bus, it was only her, and there was no light inside the bus.\nHer friend advised her to drop since the driver didn’t pick up any other passenger.\n“Before entering, she informed her friend that the driver was passing some remarks at her but she did n’t answer."
  },
  {
    "headline": "Again uncertainty trails APC March 26 national convention",
    "summarized_story": "From Romanus Ugwu, AbujaThere are clouds of uncertainty hanging over the national convention of the ruling All Progressives Congress (APC) a few weeks to the much-postponed exercise following the failure of the party’s national leadership to write a fresh notification to the Independent National Electoral Commission (INEC) within the 21-day legal window.\nAlready, the APC Caretaker/Extraordinary Convention Planning Committee (CECPC) had equally reneged in its earlier released timetable and schedule of activities, failing to start the sale of nomination forms for zonal congresses fixed to hold between Monday, February 28 to Thursday, March 3, 2022.\nAlthough the ruling party made a U-turn to fix the convention for March 26, it did not open another correspondence with the commission to notify it of the change in the arrangement for the convention, 21 days to the scheduled date.\nSpeaking to Sunday Sun on telephone, a source at the Commission said that he cannot authenticate the receipt of any fresh correspondent from the ruling party, saying that the commission ought to have received the fresh letter by yesterday.\nHowever, I want to also add that they still have a window of writing a reminder instead of a new letter,” he said."
  },
  {
    "headline": "2022 International Women Day: Nigerian women berate NASS",
    "summarized_story": "But at the National Assembly, a wholly different situation was brewing for the Nigerian women.\n“I can assure you that women in Nigeria have not shown enough readiness to break the bias.\nWhen such things happened members of the National Assembly were angry, saying they could not tolerate that kind of treatment.\nBecause of these discriminatory practices women entrepreneurs face, a lot of women are discouraged and cannot even take off from ground zero.\n“I sat back and looked inwards, got myself well equipped to face the battle and realized that gender bias cannot be killed by fire, but by knowledge!"
  },
  {
    "headline": "Yahaya Bello: North-central stakeholders dismiss Nasarawa council’s call",
    "summarized_story": "According to the APC chieftains, Bello holds the overwhelming mandate of the North-central and Nigerians as a whole to succeed President Muhammadu Buhari.\n“Without mincing words, we are the authentic APC Stakeholders in the North-central and there is no other apart from us.\nWhat has come to stay, through popular demand, is that Yahaya Bello will contest presidency notwithstanding where the party’s chairmanship position is zoned to.\nEven if the party’s chairmanship is zoned to Okene Local Government, Yahaya Bello will contest and we will ensure victory for him by God’s grace.\n“Governor Yahaya Bello has demonstrated capacity, excellence and unequalled competence in governance and he holds the overwhelming mandate of the North-central and Nigerians as a whole to succeed President Muhammadu Buhari."
  },
  {
    "headline": "I write songs in Lagos traffic –Elwoma, gospel singer",
    "summarized_story": "What motivated you to be a gospel singer?\nI would like to state that I wasn’t motivated to be a gospel singer; rather being a gospel singer is part of fulfilling my God-given purpose here on earth.\nBeing a gospel singer is my expression of love to God, and an extension of sharing this love with the world.\nWho are your mentors in gospel music both locally and internationally?\nAs a gospel singer, where do you see yourself in the next five years?"
  },
  {
    "headline": "2023: Why old politicians won’t allow youths rule the country – Nabena, ex-APC spokesman – The Sun Nigeria",
    "summarized_story": "The chairman, Caretaker Committee, Governor Mai Mala Buni, is not relenting.\nWho is actually in charge of the APC, President Buhari, the governors or the Caretaker Committee?\nHow would you rate the Caretaker Committee after being shrouded in one controversy or the other?\nAre you saying that the performance of the Caretaker Committee has justified the sacking of the Comrade Adams Oshiomhole-led NWC?\nIt is wrong to claim that the performance of the Caretaker Committee has justified the sacking of Oshiomhole."
  },
  {
    "headline": "Kyari Stands Down Keynote in US Summit in Order to Fix Fuel Scarcity",
    "summarized_story": "* NNPC intensifies monitoring of product distribution to end queuesEmmanuel Addeh in Abuja and Peter Uzoho in LagosGroup Managing Director of the Nigerian National Petroleum Company (NNPC), Mallam Mele Kyari, will miss his engagement at this year’s energy summit, tagged: ‘CERAWeek’ in the United States, billed to start tomorrow.\nNNPC also yesterday stepped up efforts to end the ongoing petrol scarcity with a product evacuation and distribution monitoring visit to two of the major petroleum products terminals in Lagos.\nKyari was said to have told his associates that given the mood of the nation, it would be inappropriate to leave the country at this time when the supply of adequate petrol had become problematic.\nDespite NNPC’s efforts to bridge the supply gap, long fuel queues have continued to dot several filling stations across the country.\nMeanwhile, the company yesterday stepped up efforts to end the ongoing petrol scarcity with a product evacuation and distribution monitoring visit to two of the major petroleum products terminals in Lagos."
  },
  {
    "headline": "NNPC Seeks to ‘Pre-empt Mobil on Asset Sale to Seplat’",
    "summarized_story": "However, THISDAY learnt from officials NNPC, that the state-owned oil giant has opted to exercise its Right of First Refusal (RFR) on the sale of the assets.\nThe RFR is reportedly contained in the Joint Operating Agreement (JOA) of the Joint Venture (JV), which represents NNPC’s position on the planned sale of the shares to Seplat Energy Plc.\nThe source stressed that NNPC did not have the power to halt the acquisition of the multinational oil company’s shares by Seplat.\nSeplat Energy subsequently put forward a winning bid for the assets and reached an agreement with ExxonMobil.\nAkinosho maintained, “NNPC is in JV with companies that produce at least 45 per cent of our crude."
  },
  {
    "headline": "FG Green-lights DCP Kyari’s Extradition to United States",
    "summarized_story": "Few hours after the extradition process commenced, the National Drug Law Enforcement Agency (NDLEA), which currently has Kyari in its custody following his arrest for alleged illicit drug dealing, also initiated a court process against him.\nNDLEA filed an eight-count criminal charge against the defendants at the Federal High Court, Abuja.\nThe implication of the NDLEA court action against Kyari is that he cannot be extradited to the US, even though the federal government has commenced the extradition process.\nHe noted that there was no criminal proceeding pending against Kyari in Nigeria for the same offence.\nThe charge, filed yesterday and marked FHC/ABJ/CR/57/2022, was signed by NDLEA’s Director, Prosecution and Legal Services, Mr. Joseph Sunday."
  },
  {
    "headline": "INEC: We are Not Registering New Parties Because They Won’t Participate in 2023 Elections",
    "summarized_story": "INEC, which claimed that the reason was because the new Electoral Act barred the registration of new political parties to participate in any general election twelve months before, added also that the same new electoral law, allowed for the merger of political parties, only nine months to the general elections.\nThere are currently 18 registered political parties in the country.\nUnder the new law, the Commission shall issue the Notice of Election not later than 360 days before the date fixed for the conduct of elections.\nAccordingly, he said a good knowledge of the law and its provisions would assist in crafting good editorials and holding the Commission and the Political Parties accountable to their implementation.\n“The Commission has introduced an online nomination portal through which Political Parties upload the list and personal particulars of their nominated candidates."
  },
  {
    "headline": "Evacuation of Nigerians Delayed After Flight Exceeded Allotted Duty Hours",
    "summarized_story": "The flight meant to evacuate stranded Nigerians was cancelled because the aircraft overstayed its allotted duty hours.\nThe crew that operated the Air Peace flight from Nigeria to Poland had spent their allotted hours of duty and, according to international standards, they could not exceed the allotted hours.\nThe Nigerian evacuation flight was shifted to early today morning and it was expected to arrive the Federal Capital Territory, Abuja, later today.\nIt means they have already waited five hours and they are going to have nine hours flight.\n“Our institutions are working together to support Ukraine on the financing and policy fronts and are urgently increasing that support."
  },
  {
    "headline": "Bobrisky Is Risky, Buhari Regime Warns Travellers, Tourists",
    "summarized_story": "The President Muhammadu regime has warned tourists and travellers to be wary of Nigerian crossdresser, Okuneye Idris Olarenwaju, aka Bobrisky.\nThe health hazard Bobrisky has is worse than Ebola Virus Disease; travellers and tourists should be careful wherever they notice the presence of Bobrisky, mostly as it affects sharing of public facilities.\nNow, Bobrisky will enter the same toilet with a woman and at the end the woman will contract some kind of diseases.\n“If Bobrisky is even using men’s toilet, we can understand.\nAs I speak, we got a report of how a woman was very upset with the Federal Airports Authority of Nigeria because on this day she saw Bobrisky using female toilet in Abuja airport."
  },
  {
    "headline": "Bobrisky Is Risky, Buhari Regime Warns Travellers, Tourists",
    "summarized_story": "The President Muhammadu regime has warned tourists and travellers to be wary of Nigerian crossdresser, Okuneye Idris Olarenwaju, aka Bobrisky.\nThe health hazard Bobrisky has is worse than Ebola Virus Disease; travellers and tourists should be careful wherever they notice the presence of Bobrisky, mostly as it affects sharing of public facilities.\nNow, Bobrisky will enter the same toilet with a woman and at the end the woman will contract some kind of diseases.\n“If Bobrisky is even using men’s toilet, we can understand.\nAs I speak, we got a report of how a woman was very upset with the Federal Airports Authority of Nigeria because on this day she saw Bobrisky using female toilet in Abuja airport."
  },
  {
    "headline": "REPORTER'S DIARY: 'Who Did You Come To See?' — A Visit To The 'Racist' Shi Shi Chinese Restaurant In Lagos",
    "summarized_story": "SaharaReporters visited Shi Shi Chinese restaurant on Thursday due to multiple allegations of racism towards Nigerian visitors to the restaurant, located at 21B, Emina Crescent, off Toyin Street, Ikeja, Lagos.\nOur ExperienceOn arriving Shi Shi, tucked away in a residential area in Ikeja, we approached the gate.\nThe security guard looked as if he was contemplating a response, but seemed to think twice about it and stepped back.\nThe team proceeded (we came disguised as a company of people who had come to hang out).\nShe beckoned to another lady (Chinese) and spoke something to her in their language, while motioning at us."
  },
  {
    "headline": "REPORTER'S DIARY: 'Who Did You Come To See?' — A Visit To The 'Racist' Shi Shi Chinese Restaurant In Lagos",
    "summarized_story": "SaharaReporters visited Shi Shi Chinese restaurant on Thursday due to multiple allegations of racism towards Nigerian visitors to the restaurant, located at 21B, Emina Crescent, off Toyin Street, Ikeja, Lagos.\nOur ExperienceOn arriving Shi Shi, tucked away in a residential area in Ikeja, we approached the gate.\nThe security guard looked as if he was contemplating a response, but seemed to think twice about it and stepped back.\nThe team proceeded (we came disguised as a company of people who had come to hang out).\nShe beckoned to another lady (Chinese) and spoke something to her in their language, while motioning at us."
  },
  {
    "headline": "REPORTER'S DIARY: 'Who Did You Come To See?' — A Visit To The 'Racist' Shi Shi Chinese Restaurant In Lagos",
    "summarized_story": "SaharaReporters visited Shi Shi Chinese restaurant on Thursday due to multiple allegations of racism towards Nigerian visitors to the restaurant, located at 21B, Emina Crescent, off Toyin Street, Ikeja, Lagos.\nOur ExperienceOn arriving Shi Shi, tucked away in a residential area in Ikeja, we approached the gate.\nThe security guard looked as if he was contemplating a response, but seemed to think twice about it and stepped back.\nThe team proceeded (we came disguised as a company of people who had come to hang out).\nShe beckoned to another lady (Chinese) and spoke something to her in their language, while motioning at us."
  },
  {
    "headline": "EXCLUSIVE: PDP fixes dates for governorship, presidential primaries",
    "summarized_story": "The Peoples Democratic Party (PDP) has fixed dates for the governorship and presidential primaries.\nJUNE 10 — JUNE 17Submission of presidential and national assembly candidates’ names and forms to INEC.\nJULY 1 — JULY 15Submission of governorship and state house of assembly candidates’ names and forms to INEC.\nOCTOBER 14The last day for withdrawal by presidential and national assembly candidates and replacement of withdrawn candidates.\nOCTOBER 21The last day for withdrawal by the state house of assembly and governorship candidates and replacement of withdrawn candidates."
  },
  {
    "headline": "EXCLUSIVE: PDP fixes dates for governorship, presidential primaries",
    "summarized_story": "The Peoples Democratic Party (PDP) has fixed dates for the governorship and presidential primaries.\nJUNE 10 — JUNE 17Submission of presidential and national assembly candidates’ names and forms to INEC.\nJULY 1 — JULY 15Submission of governorship and state house of assembly candidates’ names and forms to INEC.\nOCTOBER 14The last day for withdrawal by presidential and national assembly candidates and replacement of withdrawn candidates.\nOCTOBER 21The last day for withdrawal by the state house of assembly and governorship candidates and replacement of withdrawn candidates."
  },
  {
    "headline": "Obasanjo: God is not to blame if Nigeria fails",
    "summarized_story": "Former President Olusegun Obasanjo says God is not to blame if Nigeria fails.\nObasanjo noted that over the years, election results have been manipulated such that they no longer reflect the will of the people.\nAnd for me, the major issue is how to progress Nigeria from a country to a nation,” Obasanjo said.\nAdvertisement“If in 2015 Nigeria was seventy-five per cent a country and fifty per cent a nation, today, Nigeria will not be more than fifty per cent a country and twenty-five per cent a nation.\n“We have a lot to learn from the events of the last almost twenty-four years and God is not to blame if we fail."
  },
  {
    "headline": "Obasanjo: God is not to blame if Nigeria fails",
    "summarized_story": "Former President Olusegun Obasanjo says God is not to blame if Nigeria fails.\nObasanjo noted that over the years, election results have been manipulated such that they no longer reflect the will of the people.\nAnd for me, the major issue is how to progress Nigeria from a country to a nation,” Obasanjo said.\nAdvertisement“If in 2015 Nigeria was seventy-five per cent a country and fifty per cent a nation, today, Nigeria will not be more than fifty per cent a country and twenty-five per cent a nation.\n“We have a lot to learn from the events of the last almost twenty-four years and God is not to blame if we fail."
  },
  {
    "headline": "Police begin probe as fashion designer goes 'missing after boarding BRT bus'",
    "summarized_story": "AdvertisementOn February 26, while returning to Ota from Ajah, Oluwabamise was said to have boarded a BRT bus with the number 240257 going to Oshodi, Lagos at about 7 pm at Chevron bus stop.\nThe fashion designer equally sent a video to her friend showing how dark the BRT bus was with the comment: “there are three men and one woman in the bus.\n“However, the alleged routes plied by the bus (Chevron/Lekki) is not operated by Primero Transport Services Limited.\n“The alleged bus, identified in the video distributed on social media, is not owned or operated by Primero Transport Services Limited.\n“There are several bus operating companies (BOCs) in Lagos state managing ‘blue BRT’ buses."
  },
  {
    "headline": "Vault Hill is building a human-centric metaverse. What about it?",
    "summarized_story": "To differentiate itself from other virtual spaces and metaverse, Vault Hill City (Vault Hill’s Metaverse) has four different islands and each island has 7 human-themed districts: Play, Romance, Curiosity, Community, Idealism, Vitality, and Imagination.\nVault Hill is also partnering with Ready Player Me to build out avatars and incorporate digital wearables and limited-edition accessories.\nThat is, using one avatar across multiple metaverses instead of having to create one for Vault Hill, and another for Decentraland,” Vault Hill said.\nVault Hill Part is also partnering with Lingua54 to use machine learning to translate the speeches of avatars across different languages in real time.\nThe first glance of Vault Hill City will be up by Q2 2022 and by the end of the year, it will be fully running."
  },
  {
    "headline": "Two years and 3 million rides later, can SafeBoda keep its lead in Nigeria?",
    "summarized_story": "On Wednesday, Ibadan-based Ugandan bike hailing startup SafeBoda clocked two years of operating in the Nigerian market.\nAnd by the end of the year, while it was pausing its Kenyan operation, it celebrated half a million rides in Nigeria.\nFast forward to today, SafeBoda claims to have recorded over 3 million rides, more than 10,000 riders, over 100,000 users, and completed 50,000 deliveries.\nThe startup currently offers 3 services in Nigeria: rides, deliveries, and airtime purchase.\nSafeBoda riders are highly regarded and respected, not just because of the colour but because of their conduct,” said Clement Obaro, Growth Manager at SafeBoda."
  },
  {
    "headline": "Facebook content moderators in Kenya to receive 30-50% pay raise, following complaints",
    "summarized_story": "Facebook content moderators in Kenya will receive a 30-50% pay rise.\nAlthough the pay raise is welcomed by many of the content moderators, some still say it’s not enough.\nWhile the lowest starting salary of a Facebook content moderator at Sama is $2.20 per hour, outsourced content moderators for Facebook in the U.S. are paid a typical starting salary of $18 per hour.\nMeta, Facebook’s parent company also declined to comment on the announcement of the pay raise.\nThe announcement of the pay raise is seen as a win for the content moderators and validation of the power in employees speaking up."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, What comes to mind when you hear the term \"financial inclusion\"?\nI asked because it has become a..."
  },
  {
    "headline": "S2PAfrica holds its 2022 Regional Engineering Design Competition(EDC) Awards Ceremony",
    "summarized_story": "Share this article:S2PAfrica, a non-profit organisation aiming to groom professional engineers in Sub-saharan Africa, held its annual regional engineering design competition(EDC) awards ceremony on February 26, 2022.\nDr Nadu Denloye, current Chair, ICT committee, the Nigerian Academy of Engineering (NAE), served as the chair for the Engineering design competition.\nTeam EASS won the Energy efficiency category prize of $500, while Team Capture won the Harnessing Ignored Energy category prize of $500.\nThe S2PAfrica regional engineering design awards were announced, starting with the second runner-up award, which Team Improved Charcoal Stove won.\nTeam Koye was announced the winner of the 2022 S2PAfrica regional engineering design competition."
  },
  {
    "headline": "How to improve customer experience",
    "summarized_story": "Today, I’ll be discussing:How to improve customer experienceMTN in the metaverseSudo Africa’s $3.7 million pre-seedChari’s new acquisitionImproving customer experienceWhat is the most memorable customer service experience you’ve had?\nCustomer experience – the feeling or memory that a customer or prospective customer has whenever they come in contact with a business – is dependent on a company’s customer service.\nSo, how can customer experience be enhanced?\nMyServiceAgent is a technology company offering a variety of tools to businesses to improve the customer experience.\nChimgozirim walks us through what they do and how the company uses AI to help companies to improve their customer experience."
  },
  {
    "headline": "Inside NIPOST’s latest financial inclusion play: Agency banking and fingerprint authentication",
    "summarized_story": "In January 2022, NIPOST unveiled its new agency banking platform at a ceremony in Nigeria’s capital, Abuja.\nAdvertisementAccording to Isa Pantami, Minister of Communications and Digital Economy, the agency banking platform would follow the Universal Postal Union’s (UPU) standards on financial inclusion.\nBy UPU standards, NIPOST’s agency banking platform should provide essential services like savings, payments, money transfers, insurance, and credit.\nVisiting other nationsGlobally, postal services are no strangers to providing financial services.\nBy 2020, the postal agency was to have been unbundled into six subsidiaries: NIPOST Banking and Insurance Company; NIPOST Property and Development Company; NIPOST Transport and Logistics Services Company; NIPOST E-government Services Company; and NIPOST E-commerce Services Company."
  },
  {
    "headline": "Obaseki to partner FG to revitalize Okomu National Park, sends forestry bill to Edo Assembly – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said his administration will partner the federal government on the management of the Okomu National Park, to revitalize the park and strengthen security in the area.\nObaseki disclosed this on Thursday while addressing the Conservator of the Okomu National Park, Mr. Augustine Obekpa, when he visited the park in Udo Community, Ovia South-West Local Government Area of the state.\nHe noted, “We are going to be sending a forestry bill to the Edo State House of Assembly for consideration next week.\n“We want to collaborate with the National Park Service.\nIn his remarks, the Conservator of the Okomu National Park said the park is home to white-throated monkeys, Buffalo and Elephants, noting that farming, hunting and illegal logging was affecting the natural habitats of the animals."
  },
  {
    "headline": "Edo begins ‘operation show your building plan’ in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has concluded plans to commence a recertification campaign for buildings in the Ugbor, Ogheghe, Amagba communities and environs in the Benin metropolis to guard against building collapse and other hazards.\nCommissioner for Physical Planning, Urban and Regional Development, Isoken Omo, in a statement, urged members of the public to cooperate with officials of the ministry during the clearance and recertification exercise.\n“Staff of the Ministry will be going from property to property demanding evidence of Building Approval.\nThe general public is advised to allow the officers of the Ministry to do their work and cooperate with them to avoid a breach of the peace,” she added.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Obaseki urges increased global action to combat illegal wildlife trade, trafficking – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has called for stronger collaboration among global stakeholders as well as a more stringent legal framework to combat illegal wildlife trade and trafficking so as to conserve the ecosystem and preserve wildlife.\n“Better policies, including a more stringent legal framework to end the global menace of illegal wildlife trade and trafficking, among others must be developed to preserve the world’s diverse flora and fauna.\n“We are in partnership with stakeholders, including the Nigerian Air Force and other security agencies to preserve our forest reserve, particularly the Okomu Forest Area against criminals.\nWe will continue to explore even better channels to protect our endangered wildlife assets,” he added.\nAccording to the UN, “World Wildlife Day is an opportunity to celebrate the many beautiful and varied forms of wild fauna and flora and to raise awareness of the multitude of benefits that their conservation provides to people."
  },
  {
    "headline": "Obaseki flays unconscionable denial of women representation in Nigeria’s democracy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has slammed the National Assembly for rejecting 5 bills seeking affirmative action and inclusion for women in politics and other spheres of the society.\nThe governor, in a statement, said: “The recent developments at the National Assembly, in which 5 bills seeking affirmative action and inclusion for women were vehemently shut down by members, is most regrettable and unsettling.\n“This is because the legislature is the bastion of democracy and a critical platform for fair representation and inclusion in government.\nThey provide invaluable service to ensure the proper functioning of the engine of government.\nAt the senior cadre of the civil and public service, women make up more than 50 percent of the Permanent Secretaries, which provides them with ample opportunity to serve the people."
  },
  {
    "headline": "Police arrest two over missing BRT passenger, Oluwabamise Ayanwole",
    "summarized_story": "Police in Lagos, says it had arrested two suspects in connection with 22-year-old Ayanwole Oluwabamise, who went missing after boarding a Bus Rapid Transport (BRT) service on February 26.\nOluwabamise was said to have boarded the bus from Chevron Bus Stop, Ajah, to Oshodi around 7pm and later sent distress message to her friend when she felt uncomfortable in the vehicle.\n“As soon as the report got to the police, investigation into the circumstances surrounding the disappearance of the lady was immediately initiated,” he said.\n“In the course of ongoing investigation, two suspects have been arrested and are currently helping in our investigation.\nin Ekiti State, is about 5 feet plus tall, dark in complexion and speaks Yoruba and English languages well."
  },
  {
    "headline": "US Ambassador, Leonard Opens American Corner in Ikeja, Celebrates Strong U.S.-Nigeria Bilateral Ties",
    "summarized_story": "Ambassador Leonard hailed the opening as yet another example of the bourgeoning U.S.-Nigeria bilateral relations, noting the broad range of programs that take place at the American Corner.\n“We’re delighted that this new American Corner will offer even more opportunities to young people to discover the U.S. as they prepare for their futures,” Demuren said.\nSpecial Adviser to the Lagos State Governor, Solape Hammond, welcomed the American Corner Ikeja to the family of American Spaces in Nigeria.\nVisitors to the American Corner will typically include students, teachers, entrepreneurs, academics, journalists, civic organizations, government officials, and community leaders, in addition to many others.\nAddresses and contact details of American Spaces can be found here."
  },
  {
    "headline": "Jane-Frances Okorie Wins 9mobile Future CEO Initiative",
    "summarized_story": "16-year-old Jane-Frances Okorie has won the maiden edition of the 9mobile FutureCEO speech competition.\nThe 9mobile FutureCEO is an initiative aimed at inspiring future leaders by stirring up their interest in business and leadership.\nThe initiative also affords promising future leaders an opportunity to walk in the shoes of senior business leaders.\nThis is proof that you are future leaders who are determined to achieve their dreams.\nReiterating 9mobile’s commitment to promoting education, Ado stated that the 9mobile Future CEO initiative would help build students’ leadership capacity for the future."
  },
  {
    "headline": "UBA’s annual profit up 4.3% to N118.7bn, shareholders to get N27bn dividends",
    "summarized_story": "The latter derived stimulus from earnings from electronic banking, which scaled up from N44.2 billion to N64.6 billion.\nAlso weighing on earnings was a 90.1 per cent rise in income tax spending to N34.4 per cent from its 2020 level.\nPre-tax profit stood at N153.1 billion compared with the N131.9 billion posted a year earlier, while profit after tax enlarged by 4.3 per cent to N118.7 billion.\nThe dividend will be paid to shareholders who have completed the e-dividend registration and mandated the registrar to pay their dividend directly into their bank accounts.\nIt advised shareholders who are yet to complete the e-dividend registration to download the registrar’s e-dividend mandate form."
  },
  {
    "headline": "Lagos Govt Seals Event Centre Where Petrol Was Shared As Souvenir",
    "summarized_story": "The Lagos State government, on Saturday, sealed off Havillah Event Centre in Oniru area of Lagos, where petrol was shared to guests as a souvenir at a party.\nThe event centre was sealed by officials of the Lagos Safety Commission and the Rapid Response Squad (RRS) “for Contravening Public Safety Rules.”In a post titled, “Lagos Seals Event Centre”, the police said, “Rapid Response Squad working in conjunction with Lagos State Safety Commission has sealed Havilah Events Centre, Victoria Island for hosting a party during which litres of premium motor spirit (Petrol) in jerry can were given out as souvenirs.\nADVERTISEMENT“Two officials of the centre were arrested today while Lagos Commissioner of Police, Abiodun Alabi has directed that all those involved be arrested.\nAccording to him, the Lagos State Government, through the Safety Commission will ensure that all parties to “the reprehensible action are made to account for it”.\nMeanwhile, the Erelu Okin of Kemta Kingdom, Pearl Chidinma Ogbolu, has apologised for sharing petrol as a souvenir at her installation party."
  },
  {
    "headline": "2023: Most Aspirants Should Be In Jail If…. Obasanjo",
    "summarized_story": "If EFCC and ICPC will have done their jobs properly, and supported adequately by the judiciary, most of them would be in jail.\n“I was told that social media credited to me names of three people from the South that I am sponsoring for the Presidency in 2023.\nOhuabunwa stated this while reacting to former President Olusegun Obasanjo’s comment that some persons aspiring to be Nigeria’s president in 2023 should be in jail.\nThe first of such support groups that visited were those canvassing for the presidential bid of Vice President Yemi Osibanjo.\nThough Obasanjo restated his decision to stay off party politics, his wealth of experience as a former military and civilian president cannot be overlooked."
  },
  {
    "headline": "Lagos Socialite Apologises For Sharing Petrol Sourvenir At Installation Party",
    "summarized_story": "The Erelu Okin of Kemta Kingdom, Pearl Chidinma Ogbolu, has apologised for sharing petrol as a souvenir at her installation party.\nThe apology was sequel to the backlash from Nigerians over the viral video where kegs of petrol with stickers “Erelu Okin Foundation Installation Party” were shared at the ceremony.\nThe kegs of petrol were seen handed to guests at the party to celebrate Ogbu’s installation as Erelu Okin of Orile Kemta at the Havillah Event Place, Oniru in Lagos.\n“My intent was just to show appreciation to my guests for turning up at my event at these hard times.\n“I have paused to reflect and truly apologise and I thank you all for your understanding and criticisms.”ADVERTISEMENT"
  },
  {
    "headline": "Lagos Govt To Probe Petrol Souvenir At Party",
    "summarized_story": "The Lagos State government, on Saturday, said it was investigating a viral video on the social media showing gallons of petrol as souvenirs at a social event in Lagos.\n“There is no doubt that this action is dangerous and can lead to loss of lives and property.\n“The Lagos State Government through the Safety Commission is investigating this matter and will ensure that all parties to this reprehensible action are made to account for it.\n“The safety of lives and properties of Lagosians and visitors remains a top priority to the Governor Babajide Sanwo-Olu administration.\nWe, therefore, advise that actions that can lead to loss of lives and properties be avoided,” he added."
  },
  {
    "headline": "London Trip Still On Course As Buhari Returns From Kenya",
    "summarized_story": "President Muhammadu Buhari yesterday returned to Abuja after attending the United Nations Environmental Programme (UNEP) at 50 in Nairobi, Kenya.\nThe president, who initially planned to proceed to London for medical check-up, returned to Abuja yesterday at about 1.p.m.\nOn whether the president had shelved his trip to London, Shehu said, “No, he hasn’t shelved his trip to London.\nThe trip to London is Sunday.”ADVERTISEMENTWhile in Kenya, the president participated in the special session to commemorate the 50th anniversary of the United Nations body.\nDuring the meeting, Buhari directed collaboration between the Ministries of Environment, Water Resources, Agriculture and Rural Development and Power to combat desertification."
  },
  {
    "headline": "My disagreements with Obasanjo on issues are without personal animus",
    "summarized_story": "National leader of the APC, Asiwaju Bola Tinubu has said his disagreements with former President Olusegun Obasanjo on some issues are without personal animus.\nTinubu, in a felicitation message to Obasanjo who clocked 85 years on Saturday, said at 85, Obasanjo remained strong, agile and committed to the greatness of our dear nation.\n“President Obasanjo has made numerous useful contributions to this country.\nThere have been instances where I have disagreed with President Obasanjo on important substantive issues.\nPresident Obasanjo has worked tirelessly for Nigeria, Africa and indeed the black race,” he said."
  },
  {
    "headline": "FG evacuates additional 305 Nigerians from Ukraine",
    "summarized_story": "By Maureen OkonA new batch of 306 Nigerians returned home from war-ravaged Ukraine on Sunday.\nThe Nigerians in Diaspora Commission (NiDCOM) stated that they arrived at the Nnamdi Azikiwe International Airport, Abuja at 00:30 a.m. aboard Air Peace Boeing 777-300 Flight APK7534 through Budapest.\nWith their arrival, the number of Nigerians evacuated by the Federal Government have increased to 1,112 as 807 others had earlier been evacuated in three batches as of Saturday.\nNiDCOM stated that the returnees were excited to be home after the uncertainty of fleeing from the war.\nPresident Muhammadu Buhari also approved the release of 8.5 million dollars for the immediate evacuation of at least 5,000 Nigerians fleeing the Russian-Ukrainian conflict zone to Poland, Romania, Hungary, and Slovakia."
  },
  {
    "headline": "BREAKING: Lagos Seals Event Center Where Petrol Was Shared As Souvenir",
    "summarized_story": "BREAKING: Lagos Seals Event Center Where Petrol Was Shared As SouvenirThe Havillah Event Centre in Oniru has been closed by the Lagos state government for violating public safety regulations.\nFollowing a public outcry over the distribution of gasoline-filled jerrycans at an event, the event center was closed.\nOn Saturday, agents from the Lagos Safety Commission and the Rapid Response Squad sealed the facility, according to Jubril Gawat, senior special adviser to the Lagos state governor on new media."
  },
  {
    "headline": "‘I Watched As Six Of My Siblings Were killed’, Turji Justifies Cause",
    "summarized_story": "‘I Watched As Six Of My Siblings Were killed’, Turji Justifies CauseA notorious bandit kingpin, Bello Turji, has recounted some attacks on his family, saying that over 1,000 cattle were stolen from their household and in the process six of his younger siblings were killed that day.\nTurji also accused Yan Sakai volunteers of connivance with security agents to harass and extort the Fulanis.\nThey also connived with Yan Sakai and slaughtered my uncle.\nMy father was involved in a court case for seven years over corn stalks.\nJust for corn stalks!”​"
  },
  {
    "headline": "How I Helped Aregbesola, Fayemi, Mimiko Become Governor – Tinubu",
    "summarized_story": "Asiwaju Bola Tinubu, one of the presidential aspirants and the head of the All Progressives Congress, paid a visit to the traditional rulers in the three senatorial districts of Ondo State on Friday, seeking their support for his presidential bid.\nTinubu highlighted former governors of Osun and Ondo states, Ogbeni Rauf Aregbesola and Dr. Olusegun Mimiko, as beneficiaries of his political generosity.\nHe also mentioned the Governor of Ekiti State, Dr. Kayode Fayemi, and President Muhammadu Buhari.\nTinubu said, “I helped Mimiko get his mandate through court after two years that he was elected.\nI helped Fayemi get his mandate after three years."
  },
  {
    "headline": "How We Escaped Intense Bombings, Death In Ukraine-Russia War – Nigerians",
    "summarized_story": "Nigerians who escaped Russia’s ongoing military offensive in Ukraine arrived in Abuja, the nation’s capital, on Friday, narrating how they escaped the intense bombings and missiles fired by Russia’s military forces.\nSome of the returnees who fled Ukraine to Romania told Saturday PUNCH how they were able to escape the invasion.\n“On Thursday morning, there was a bombing in Kyiv but thankfully I was in Ternopil so I escaped.\nShe added that she would love to return to Ukraine to complete her studies once the war ends.\nAnother returnee, Peter Ajuwon, said the Ukraine war should serve as a lesson to Nigerians on the importance of peace."
  },
  {
    "headline": "Breaking: Police hunt socialite, other party organisers day after sharing petrol as souvenirs",
    "summarized_story": "Moments after Lagos state government sealed a party venue where petrol kegs were shared as souvenirs, Commissioner of Polic, CP Abiodun Alabi, has ordered the arrest of the host of the event.\nThe party took place in the Oniru area of the state.\nA statement by the police spokesman in the state, Adekunle Ajisebutu, on Saturday partly reads, “It’s regrettable that in spite of series of warnings and sensitisations carried out by the Police and other relevant government agencies, some individuals could be handling such combustible substance in a public place in total disregard to safety of lives and properties.\n“Still concerned about the safety, and protection of lives and properties of citizens, the Lagos State Police Command once again appeals to citizens to avoid this kind of condemnable act in the name of generosity.\n“Although the event centre where the distribution of the souvenirs took place has been located and subsequently sealed, the Commissioner of Police, CP Abiodun Alabi, fdc, mnim, has in addition, ordered the arrest of all persons involved in this regrettable and reprehensible act.”"
  },
  {
    "headline": "Pictures: Third batch of Nigerians trapped in Ukraine arrive Abuja",
    "summarized_story": "As Russian troops continue to invade the cities of Ukraine, the third batch of Ukraine-based Nigerians from Hungary have touched down at the Nnamdi Azikiwe International airport, Abuja, Nigeria’s capital.\nNo fewer than 165 Nigerians arrived Friday night at about 11:50 pm local time from Budapest, Hungary."
  },
  {
    "headline": "Breaking: Russia declares partial ceasefire as evacuation begins, Ukraine fires warning shot",
    "summarized_story": "Russia declared a partial ceasefire on Saturday to allow humanitarian corridors out of the Ukrainian cities of Mariupol and Volnovakha, Russia’s defence ministry said.\n“From 1000 am Moscow time (0700 GMT), the Russian side declares a ceasefire and the opening of humanitarian corridors to allow civilians to leave Mariupol and Volnovakha,” Russian news agencies quoted the Russian defence ministry as saying.\nUkraine said it planned to evacuate 200,000 people from Mariupol and 15,000 from Volnovakha, with the Red Cross acting as the guarantor of the ceasefire.\nMeanwhile, Ukraine’s Deputy Prime Minister Iryna Vereshchuk has warned that Russia must not take advantage of an agreed humanitarian corridor to advance its troops.\nShe said her government was “verifying” information that Russian troops were using the ceasefire to move closer to Ukrainian positions in areas along the evacuation routes."
  },
  {
    "headline": "Nigerian Students Trapped In Ukraine Appeal For Urgent Evacuation",
    "summarized_story": "﻿Many Nigerian students trapped in Sumy, Ukraine have called for urgent evacuation back home amid a Russian invasion.\nThe Federal government has evacuated more than 1,000 Nigerians who made it out of Ukraine to neigbouring countries such as Poland and Romania.\nBut the students in Sumy are yet to find a way out of war-torn Ukraine.\n“We are in Sumy and we are stuck in Sumy,” one of the students said during a protest held under snowy conditions.\n“This is Day 10, people don’t have water, people don’t have light in hostels."
  },
  {
    "headline": "Since 2015 Nigeria Has Retrogressed As A Nation – Obasanjo",
    "summarized_story": "﻿Former President Olusegun Obasanjo on Saturday said Nigerian efforts to build a nation has undergone significant decline since 2015.\n“If in 2015, Nigeria was 75 percent a country and 50 percent a nation, today, Nigeria will not be more than 50 percent a country and 25 percent a nation,” Obasanjo said.\nI mean Nigerians in all walks of life: politicians, community leaders, traditional leaders, religious leaders, diplomatic leaders, leaders in the academia, leaders in all aspects of government life, and leaders in other aspects of civil society.\n“We need to be clear about what Nigeria needs today and why Nigeria needs it,” he said.\n“As for me, the major issue for me is how to progress Nigeria from a country to a nation."
  },
  {
    "headline": "‘More Risky’: The Nigerians Who Don’t Want To Return From Ukraine",
    "summarized_story": "﻿As of Saturday morning, the Federal Government had evacuated nearly a thousand Nigerians fleeing Ukraine.\nBut not every Nigerian caught in the ongoing war between Russia and Ukraine wishes to return home.\nSo why should I come home?”Evacuation flightsMore than 700 Nigerians were evacuated from Poland, Hungary and Romania on Friday.\nThe Federal Government on Wednesday said it has approved $8.5m for the evacuation of citizens fleeing Ukraine.\nAlthough some Nigerians are still stuck in Ukraine, many have made it to neigbouring countries where the evacuation flights are taking off from."
  },
  {
    "headline": "Lagos Seals Event Centre Where Petrol Was Shared As Souvenir",
    "summarized_story": "The Lagos State Government on Saturday said it had sealed an event centre where kegs of petrol were reportedly handed out as souvenirs.\n“Lagos State Government through the Lagos Safety Commission and the Rapid Response Squad has sealed Havillah Event Centre, Oniru, for Contravening Public Safety Rules (Fuel Souvenir),” a statement signed by government spokesperson Gbenga Omotosho said.\nA video of the petrol kegs being shared had went viral on social media prompting the government to open an investigation.\n“The Lagos State Government says all those involved in such unlawful act will face the law.\nBelow are photos of the event centre released by the state government:"
  },
  {
    "headline": "‘TechWorks’ Brings Dreams Of Jordan Inventors To Life",
    "summarized_story": "He came up with a device to sterilise them with UV rays — and this is where TechWorks stepped in.\nSet up in 2018, TechWorks says its mission is “to plug into entrepreneurial and innovation ecosystems” and turn ideas into reality.\n“TechWorks has advanced equipment, engineers and technicians that help us convert our ideas into successful products,” he said.\nThe doors of the project’s “Fabrication Lab”, or FabLab, are “open to all; we support students, entrepreneurs, and startups”, he said.\nIt plans to open two more branches in Jordan to provide technology training and help for school and university students."
  },
  {
    "headline": "Gov Yahaya Bello's presidency non-negotiable",
    "summarized_story": "Stakeholders in the North Central Zone under the platform of the ruling All Progressives Congress have thrown their weight behind the presidential ambition of governor Yahaya Bello.\nThis time they say nothing will make them change their mind from supporting the Kogi governor.\nThey maintained that the presidential ambition of the Mr Bello will not be negotiated even if the zone produces the National Chairman of the party in the forthcoming Convention.\nThe APC stakeholders in the North Central Zone made this known on Saturday while reacting to a statement allegedly issued by a group, “Stakeholders in Nasarawa State Council of the All Progressives Congress, appealing to Governor Bello to sacrifice his presidential ambition for the rumoured national chairmanship position awaiting the zone.\nIn a statement signed and issued by the Director-General, North Central Coalition for Leadership, Williams Oluwatoyin, they saiy the purported appeal for mr Bello to relinquish his ambition “stands logic on its head and also belittles the zone.”They made this position known on a day Governor Bello officially presented Staff of Office to the newly approved, graded and upgraded traditional rulers in Kogi State, at the Muhammadu Buhari Civic Centre, Lokoja."
  },
  {
    "headline": "2023: Tinubu visits Pa Fasoranti, concludes Southwest consultation tour -",
    "summarized_story": "The national leader of the All Progressives Congress and presidential hopeful, Asiwaju Bola Ahmed Tinubu has completed his tour of the Southwest states with a visit to the leader of the socio-cultural group, Afenifere, Pa Reuben Fasoranti.\nFormer Lagos state governor who continued his tour of six states in the Southwest Nigeria on Thursday in Ekiti, arrived in Ondo same night."
  },
  {
    "headline": "APC Stakeholders in Sokoto pass Vote of Confidence on Party's Leadership -",
    "summarized_story": "The leadership crisis rocking the All Progressives Congress APC in Sokoto state has taken another twist as the coalition of the APC Support group in the state has passed a vote of confidence on the national leadership of the party led by Yobe state Governor, Mai Mala Buni.\nThe Coalition in a press conference addressed by its spokesman, Isa Jabbi says the APC in Sokoto is strong, formidable and does not need distraction from unnecessary leadership tussle that will not help the party in it bid to take over power in Sokoto, in 2023.\nMr. Jabbi says the Caretaker Extraordinary Convention Planning Committee led by Mr. Buni is working hard to ensure the APC remain a true national party that will meet the yearnings and aspirations of all Nigerians and therefore, should not be distracted.\nThe Coalition reaffirmed its Support and loyalty to the chairmanship of Mainasara Abubakar Sani to lead the APC to success in Sokoto as the nation prepare for the general election in 2023They described as unfortunate and unnecessary the attack on the person of the nation’s Attorney General and Minister of Justice, Abubakar Malami by the factional APC Chairman in Sokoto, Isa Sadiq Achida."
  },
  {
    "headline": "Tinubu takes presidential consultation to traditional rulers in Ado Ekiti -",
    "summarized_story": "Asiwaju Bola Ahmed Tinubu has landed in Ado Ekiti to continue his consultation visit to traditional rulers in the south west.\nHe was received at the Government House by the Deputy Governor of Ekiti State, Otunba Adebisi EgbeyemiThe former Lagos state governor is currently meeting with the Council of traditional rulers in Ekiti State under the chairmanship of the Onisan of Isan-Ekiti, Oba Gabriel Ayodele Adejuwon."
  },
  {
    "headline": "Visa, Mastercard Suspend Operations in Russia Over Ukranian Invasion",
    "summarized_story": "U.S. payments firms Visa Inc (V.N) and Mastercard Inc on Saturday said they were suspending operations in Russia over the invasion of Ukraine, and that they would work with clients and partners to cease all transactions there.\nWithin days, all transactions initiated with Visa cards issued in Russia will no longer work outside of the country and any Visa cards issued outside of Russia will no longer work within the country, the company said.\nU.S. President Joe Biden, in a call with Ukraine’s President Volodymyr Zelenskiy, welcomed Visa’s and Mastercard’s decisions to suspend their operations in Russia, the White House said.\nMastercard said it decided to suspend its network services in Russia following its recent action to block multiple Russian financial institutions from the company’s payment network, as required by regulators globally.\nVisa also said this week it blocked multiple Russian financial institutions from its network in compliance with government sanctions imposed over Moscow’s invasion of Ukraine."
  },
  {
    "headline": "Italy Seizes Oligarchs’ Villas and Yachts to Put Pressure on Russia",
    "summarized_story": "Italian police have seized villas and yachts worth 143 million euros ($156 million) from five high-profile Russians who were placed on sanctions lists following Moscow’s attack on Ukraine, the government said on Saturday.\nIt was worth some 50 million euros and was owned by Gennady Timchenko, whom Putin has described as one of his closet associates.\n“But you told us that Europe has sacred property rights,” he was quoted saying by The Daily Beast.\nRussian oligarchs have bought numerous villas in choice Italian settings over the past 20 years and sources have said more assets are expected to be seized in coming days.\nUzbekistan-born metals and telecoms tycoon Usmanov is well known in Italy for owning multiple properties on Sardinia, while Italian media say Mordashov owned a villa worth some 66 million euros ($72 million) on the same island."
  },
  {
    "headline": "Putin Says Sanctions Imposed on Russia Equivalent to Declaration of War",
    "summarized_story": "Russian President, Mr. Vladimir Putin, jn Saturday stated that the sanctions imposed on his country by western countries over the invasion of Ukraine were like a declaration of war.\nNATO had said taking such an action could result in a “full-fledged war in Europe involving many more countries”.\nSince the start of the invasion of Ukraine, a series of sanctions have been imposed on Russia by the United Kingdom, the United States, Canada and the European Union.\nMeanwhile, the United Nations High Commissioner for Refugees (UNHCR) revealed that it counted about 1,368,864 refugees on its dedicated website at noon Saturday, almost 160,000 more than the previous count on Friday.\nThe number of people taking refuge in Russia remained unchanged at around 53,000, or 3.9 per cent of the total."
  },
  {
    "headline": "APC Chairmanship Race: Al-Makura Rejects Buhari’s Choice, Solicits Support in Ondo",
    "summarized_story": "A chairmanship aspirant of the All Progressives Congress (APC), Senator Tanko Al-Makura has rejected President Muhammadu Buhari’s reported endorsement of Senator Abdullahi Adamu for the national chairmanship position of the ruling party.\nRelatedStories No Content AvailableAl-Makura kn Saturday visited the Chairman of the South-west Governors’ Forum and Ondo State Governor, Mr. Oluwarotimi Akeredolu, to seek support.\n“We feel you have a role to play in determining and shaping how this party (APC) is put together, especially in this critical time of transition.\nResponding, Akeredolu thanked Al-Makura for the visit, while describing him as a competent and committed member of the ruling party.\n“You have said many things and one thing that came out is APC value."
  },
  {
    "headline": "Saudi Arabia Lifts Ban on Direct Flights from Nigeria, 16 Others",
    "summarized_story": "The Kingdom of Saudi Arabia has lifted the ban on direct flights from Nigeria and 16 other countries imposed on these largely African nations on December 8, 2021, in response to the discovery of the Omicron variant of COVID-19 in South Africa.\nThe Kingdom has also lifted the outdoor mask and social distancing mandates.\n“It will also end social distancing in the two Holy Mosques and all the mosques in the Kingdom but worshippers still have to wear masks.\nIt also suspended social distancing measures at all closed and open spaces, activities, and events.\n“The Kingdom lifted the suspension of direct flights and arrival to the Kingdom from the following countries: South Africa, Namibia, Botswana, Zimbabwe, Lesotho, Eswatini and Mozambique, Malawi, Mauritius, Zambia, Madagascar, Angola, Seychelles, United Republic of Comoros, Ethiopia, and Afghanistan.”Michael Olugbode in Abuja"
  }
]