[
  {
    "headline": "Community deserted as gunmen kill nine-year-old in Southern Kaduna",
    "summarized_story": "AGAIN, gunmen have reportedly invaded Atuka community in Kaura Local Government Area of Kaduna State, killing a nine-year-old boy and injuring one while they looted a shop before setting it ablaze.\nHe said security operatives arrived in the village when the attackers had already perpetrated the evil act and left the village.\nHe added that women and children had deserted the village while the men were keeping vigil in the community.\nFour killed in Katsina communityMeanwhile, a group of gunmen on Monday night attacked Tsayau community, Jibia LGA of Katsina State, where they killed four persons and abducted several others.\nIt was learnt that the gunmen arrived in the community on motorcycles late in the night."
  },
  {
    "headline": "Employability skills’ll help youths secure good jobs – Lagos",
    "summarized_story": "The Lagos State Government has said youths with employability and job interview skills will stand better chances of being employed.\nThe Commissioner for Wealth Creation and Employment, Mrs Yetunde Arobieke, said this on Tuesday at a training programme in Agidingbi, Ikeja.\nShe said the training meant to develop employability and job interview skills in youths was organised by the Ministry of Wealth Creation and Employment in collaboration with Jobberman Nigeria.\nShe said, “Governor Babajide Sanwo-Olu, remains unrelenting in the quest to enhance leadership and employability skills of our youth, as well as connect them to professionals that will help shorten the learning curve and assist in accessing the sectors and disciplined expertise.\n“This training will provide youths with good curriculum vitae and cover letter writing, interview preparation, job search strategies and salary negotiation tips.”Copyright PUNCH."
  },
  {
    "headline": "NDDC: CFRLN berates Bishop Udo Azogu",
    "summarized_story": "The group in a statement by its National President, Igonibo Danagogo and National Secretary, Ofem Okang said OMPALAN did not speak for the people of the Niger Delta region but spoke for itself.\n“The said Bishop Azogu went ahead to state that the “Board that was dissolved by the President on the grounds of incompetence cannot be retained and inaugurated”.\n“The much-touted forensic audit, the reason given for the delay in inaugurating the NDDC board has been concluded.\nMr President had assured the people of the Niger Delta that the board he had earlier constituted and had already been screened by the Senate, would be inaugurated immediately after the forensic audit was concluded.\n“All these truly shameful shenanigans machinated to distract our President from doing the right thing must stop forthwith and the substantive board of the NDDC immediately inaugurated as promised by President Buhari”."
  },
  {
    "headline": "Ortom advocates increase of federation allocation to states to 42 percent, LGs 23 percent",
    "summarized_story": "Governor Samuel OrtomBy Peter Duru – MakurdiGovernor Samuel Ortom of Benue state has advocated an increase of federation allocation to states from the present 26.7 percent to 42 percent.\nThe Governor made the call on Tuesday in Makurdi when he received in audience the Federal Commissioner representing the state at Revenue Mobilization, Allocation and Fiscal Commission, RMAFC, Mr. Adaa Maagbe during a sensitization tour of the state.\nHe also suggested that 23 percent of the allocation should go to local government areas from the present 20.6 percent while the federal government should go home with 35 percent as against the present 52.68 percent.\nThe Governor pointed out that the exigencies of the time had made it necessary for a quick review of the sharing formula stressing that since the state governments had more responsibilities they should take the lion share of the Federal Allocation.\nAccording to him, “the federal government has clearly demonstrated that it is overwhelmed by the security challenges and so it should push the responsibilities to States and back it up with more resources."
  },
  {
    "headline": "COVID-19 helped to reduce cost of oil production in Nigeria – Sylva",
    "summarized_story": "The Minister of State for Petroleum Resources, Chief Timipre Sylva, says COVID-19 had helped to reduce the cost of crude oil production in the country.\n“We have reduced the cost of production successfully the issues of our local currency notwithstanding.\nREAD ALSO:Attack on Imo Oil Workers: We’re on trail of perpetrators ― CP“Both programmes have helped to bring down the cost of production, but what also helped us in reducing the cost of production is from a very unlikely quarter and that is COVID-19.\n“With COVID-19, oil prices crashed and a lot of contracts were rationalised and we had to renegotiate, so, we were able at that point to get everybody on board to reduce the cost of production.\n“The average consumption has actually reduced from about 66 million to about 52 million on the average,’’ he said."
  },
  {
    "headline": "Plateau killings: Lalong cautions against rush to bail suspects",
    "summarized_story": "Governor Simon Lalong of Plateau has warned against any rush to bail suspects of the Aug. 14 killings along Rukuba road in Jos, and other attacks in the state.\nThe governor spoke on Tuesday at an emergency peace and security stakeholders meeting held in Jos.\n“The rush to bail suspects of unrest when arrested for investigation frustrates efforts to find lasting solution to insecurity in Plateau.\nHenceforth, people rushing to bail suspects will also be arrested .\n“If you find them, please arrest them; if people rush to bail them, arrest them,” he said ."
  },
  {
    "headline": "NEMA refutes allegation of hoisting Islamic, Taliban flag",
    "summarized_story": "NEMA*Displayed flag is that of Saudi Arabian humanitarian aid, it explainsBy Joseph ErunkeABUJA- THE National Emergency Management Agency,NEMA, has refuted the allegation that it hoisted an Islamic flag, indicating allegiance to Islamic and Taliban groups.\nREAD ALSO:Some Kabul residents venture past gun-toting Taliban back to workAlthough NEMA did not deny hoisting the flag which has attracted public attention, it, however, explained that the said flag is that of King Salman Humanitarian Aid and Relief Centre,a humanitarian aid group in the Kingdom of Saudi Arabia.\nDescribing the allegation as baseless, Ezekiel said the flag was hoisted at the event heralding the commissioning of the call centre by the Saudi-based aid organisation,represented by its Team Leader,Naseer Alsubaie.\nIt is the flag of the Kingdom of Saudi Arabia and it was used specifically for that function.\nImmediately the function was over,the flag was removed,it is the normal thing, it’s a normal practice anywhere."
  },
  {
    "headline": "Nigerian Army warns against planned protest in Jos over killing of 22 Muslims",
    "summarized_story": "The Nigerian Army on Tuesday warned Muslims community and those calling for protest in Jos over the killing of 22 Muslims travellers in Jos on Saturday, August 14, 2021.\nRecall that there has been a message circulating on social media, calling on Muslims to embark on protest over the killing of 22 Muslims travellers in Jos.\nReacting on Tuesday,.\nMajor Ishaku Takwa Military Information Officer, Operation Safe Haven (OPSH) said, “The attention of Operation SAFE HAVEN (OPSH) has been drawn to a message circulating on social media calling on Muslim youths to embark on peaceful protest slated for tomorrow, Wednesday 18 August 2021.\nIt warned that, any body found acting contrary to the law will be dealt with."
  },
  {
    "headline": "Plateau crisis: Lalong summons emergency meeting",
    "summarized_story": "In his efforts to find a lasting solution to the recent skirmishes that led to the recent loss of lives and properties in some parts of Plateau State, Governor Simon Lalong has summoned an emergency security and stakeholders meeting.\nThe meeting was aimed at examining the ways of restoring normalcy and permanent peace to the state.\nLalong disclosed while addressing the meeting at the Government House Little Rayfield Jos, the State Capital.\n“In most of these attacks, farmers as well as herders were either killed or cattle and farm crops destroyed.\nAmong stakeholders who attended the meeting included: elders, past and present political office holders, representatives of CAN and JNI, PIDAN, women and youth groups as well as traditional rulers."
  },
  {
    "headline": "Nigerian military kills 45 bandit leaders, fighters in Zamfara forest",
    "summarized_story": "The military has eliminated three notorious kingpins behind armed banditry in Zamfara State.\nA Nigerian Air Force (NAF) aerial operation targeted the base of the gang leaders and their foot soldiers at Kuyanbana forest.\nA similar operation was carried out last week in Niger State by the air and ground components of Operation Gama Aiki (OPGA).\nNAF deployed AgustaWestland AW109 and Eurocopter EC135 gunships for the two-day assault on the bandits’ hideouts.\nThe operation followed intelligence on camps at the Jasuwan Garba-Urege axis of the state."
  },
  {
    "headline": "Mantu: NCPC boss, Pam mourns ex-Senate President",
    "summarized_story": "The Executive Secretary, Nigeria Christian Pilgrim Commission (NCPC), Rev.\nDr. Yakubu Pam on Tuesday, expressed deep shock over the death of former Deputy Senate President, Alhaji Ibrahim Nasiru MantuIn a statement signed by his Media Aide, Pam Ayuba, the NCPC boss said the news of the demise of Mantu came as a rude shock.\nHe consoled his family, saying, “Death is a necessary end as we shall all depart this world at the allotted time given to us by God our Creator.”The statement further described the loss “As too painful to Plateau State and Nigeria at large, going by the roles the deceased played in the development of the state and Nigeria.\nwhile still alive.\nThe NCPC Boss said Alhaji Mantu will surely be missed, considering his grassroot background as a politician who knows his onions."
  },
  {
    "headline": "Afghanistan: Biden just gave Taliban their biggest haul of weapons since earth was created – Omokri",
    "summarized_story": "A former aide to President Goodluck Jonathan, Reno Omokri, has noted that President Joe Biden of the United States of America has given world terror organisations their biggest haul of weapons since Earth was created.\nAfghanistan was plunged into turmoil after Taliban took over the country, invaded the Kabul, the nation’s capital and occupied the presidency.\nThis happened after the United States of America pulled out its military after spending about two decades in the war-ravaged country.\n“Biden just gave world terror organisations their biggest haul of weapons since earth was created.”However, Russian Ambassador to Afghanistan, Dmitry Zhirnov, on Tuesday said he had a positive and constructive meeting in Kabul with representatives of the Taliban.\nTaliban representatives said that the Taliban movement has the most friendly, the best approach to Russia."
  },
  {
    "headline": "Oyo Assembly approves another N6b loan for Makinde",
    "summarized_story": "Oyo Assembly has approved an additional N6billion credit facility for Governor Seyi Makinde.\nThe approval follows a request letter to the lawmakers by the Governor on Tuesday.\nThe figure is made up of an additional N5billion loan facility and the balance of N1billion window both of the First Bank Nigeria Ltd.\nIn the letter sent to the lawmakers, Governor Makinde noted the N6billion loan request in favour of Oyo State Government contractors is to ensure seamless execution of contracts awarded by the State Government in bridging infrastructural deficit.\nThe Chairman’s designate is to man the newly established Oyo State Audit Service Commission following the recent passage of the Audit Commission Bill, 2021 by the Assembly."
  },
  {
    "headline": "36 Govs meet on doctors’ strike, COVID vaccination, PIB, others",
    "summarized_story": "The nation’s 36 Governors are to meet on Wednesday to examine pressing national issues, including the ongoing strike by resident doctors, the planned commencement of the second phase of the COVID- 19 vaccination, among others.\nThe statement reads: “Three pro-poor issues will feature prominently on the Nigeria Governors’ Forum’s 33rd Teleconference meeting, the 10th in 2021 which takes place on Wednesday 18th August 2021.\nADVERTISEMENT“The Nigerian Security Minting and Printing Company will also address the Forum on how to leverage Modern Security Document Solutions.\n“The health update by the NGF Health Advisor, Dr. Ahmad Abdulwahab will be embroidered by another update on the 2nd Phase of Covid-19 Vaccination by Dr. Faisal Shuaib, while the Gov.\nOkowa Committee of the NGF will brief governors on its appraisal of the PTF thus far."
  },
  {
    "headline": "JUST IN: Inflation falls to 17.38% in July",
    "summarized_story": "The National Bureau of Statistics (NBS) on Tuesday revealed that the inflation rate declined 0.37 per cent to 17.38 per cent in July 2021.\nNBS said: “The consumer price index, (CPI) which measures inflation increased by 17.38 per cent (year-on-year) in July 2021.\nThis is 0.37 per cent points lower than the rate recorded in June 2021 (17.75) per cent.\n“This is higher than 16.51 per cent reported in July 2021, while the corresponding rural inflation rate in July 2021 was 15.73 percent compared to 15.36 per cent recorded in June 2021.\n“The urban inflation rate increased by 18.01 per cent (year-on-year) in July 2021 from 18.35 per cent recorded in June 2021, while the rural inflation rate increased by 16.75 per cent in July 2021 from 17.16 per cent in June 2021."
  },
  {
    "headline": "Teenage girl drowns in Delta pool",
    "summarized_story": "Tragedy struck on Sunday afternoon after a teenager, Favour Appiah, reportedly drowned in a swimming pool at a popular hotel in Effurun, Uvwie council area of Delta State.\nThe swimming pool, an indoor one, surrounded by a drinking bar, is a favourite among many fun-lovers due to its coziness.\nA family source said that there was no attendant at the pool area when the incident occurred.\nREAD ALSO: Law student drowns in Delta hotel pool“We searched everywhere when we could not find her.\nWhen the pool attendant came he refused to enter the water."
  },
  {
    "headline": "Abba Kyari’s saga: Police panel yet to submit report",
    "summarized_story": "The Police on Tuesday night said the probe into the alleged indictment of suspended Deputy Commissioner of Police (DCP), Abba Kyari by the Federal Bureau of Investigation (FBI) being conducted by the Force Special Investigation Panel (SIP) is ongoing.\nThe police said this while reacting to reports in some national newspapers and online platforms that the report have been submitted.\nADVERTISEMENTThe police denied the report has been submitted as reported by some media organisations(Not The Nation).\nHowever, Kyari has appeared before the panel several times and defended himself against the allegations.\nThe Force reassured the public that the outcome of investigations by the probe panel would be communicated accordingly upon conclusion of the investigations."
  },
  {
    "headline": "Take up arms, defend yourselves against bandits –Gov Masari",
    "summarized_story": "Governor Aminu Masari has urged Katsina State citizens resident in areas prone to activities of bandits to acquire weapons and defend themselves.\nAccording to him, security is everybody’s business, pointing out that it is not the responsibility of the government alone.\n“It is the people’s meek submission that emboldens the bandits to continue with their heinous activities with murderous frequency.\n“People must divorce their minds from the mistaken notion that security is government’s sole responsibility alone,” Masari said.\nMeanwhile, the Special Task Force charged with maintaining peace in Plateau and environs has warned against any protest over the attacks on commuters in Jos on Saturday."
  },
  {
    "headline": "Poverty, inequality, mutual suspicion, endemic insecurity, disunity ravaging North –Leaders",
    "summarized_story": "From Fred Itua, AbujaLeading leaders from the three geopolitical zones in the North, yesterday, listed key challenges bedeviling the 19 northern states and the Federal Capital Territory (FCT).\nThese have manifested in the collapse of institutions and services, widespread poverty and inequality, mutual suspicion, endemic insecurity, disunity, despair and dearth of hope across the region.\n“We have no difficulty admitting all is not well with Northern Nigeria and taking primary or vicarious responsibility for the current state of affairs.\nRecent consultations with eminent political, traditional and religious leaders across the North are encouraging.\n“To bring the state of insecurity in Northern Nigeria under control, more and better collaboration among the states across the region and between the states and federal authorities is required."
  },
  {
    "headline": "Petrol price hike not automatic –Sylva",
    "summarized_story": "From Uche Usim, AbujaThe Minister of State Petroleum Resources, Mr Timipre Sylva, on Tuesday calmed frayed nerves with assurances that the signing of the Petroleum Industry Bill (PIB) by President Muhammadu Buhari, Monday, may not automatically translate to a hike in pump price of petrol (premium motor spirit).\nDaily Sun had on Tuesday reported that the signing of the PIB would translate to higher petrol price of about N270/litre, as Sylva had repeatedly said that the new law has no provision for subsidy currently being borne by the Nigerian National Petroleum Corporation (NNPC).\nThe Minister, however, revealed that the national oil company would be unbundled in the next six months as stipulated in the new law.\nHe said, “Well as you know, the Act has actually deregulated the sector but that doesn’t mean that there will be an immediate implementation of the deregulation.\nSo, we will keep it within that band (N162 – N165 per litre) for the time being”."
  },
  {
    "headline": "Rivers Assembly bans open rearing, grazing",
    "summarized_story": "From Tony John, Port HarcourtThe bill prohibiting open rearing and grazing of livestock has been passed into law by the Rivers State House of Assembly.\nThe bill with the caption: “Rivers State Prohibition of Open Rearing and Grazing Bill, 2021” was passed into law yesterday following a committee report presented by the House Committee Chairman on Agriculture, Ansalem Ogwugwo.\nSpeaker of the House, Ikuinyi-Owaji Ibani, in his submission, expressed the confidence that the bill would address challenges emanating from open rearing and grazing of livestock in the state.\nAfter an extensive debate, the lawmakers passed the bill into law.\nHe said the bill would enable the state enhance effective service delivery."
  },
  {
    "headline": "Africa’s increasing population keeps me awake at night –Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo has raised the alarm that Africa’s increasing population is assuming a worsening trend.\n“Three clusters of questions pop up in my mind any time the scary thoughts of the ever-increasing population kept me awake at night.\nThe first cluster is: how are we going to feed this exploding population?\n“The second cluster of questions is: how do we keep this keg of gunpowder of the large army of unemployed youth from exploding?\n“The attention paid to education by a country is, in large part, a reflection of its responsiveness to making its growing population an asset."
  },
  {
    "headline": "Breaking: Bring Repentant Boko Haram Insurgents to Justice, ACF Tells FG",
    "summarized_story": "By John ShiklamThe Arewa Consultative Forum (ACF) has asked the federal government to bring repentant Boko Haram terrorists to justice or release the rest of them still in custody.\nOgbe said, “We are currently witnessing large scale surrender of large numbers of Boko Haram insurgents, among whom are bomb makers, commanders, arsorrists, rapists, and child snatchers.\nIs “I am sorry” enough to bring relief to Nigerians and the thousands of dead and maimed?” he asked.\nThe statement noted the massive destruction of property by the insurgents who have rendered many people homeless.\nWe seriously doubt.”Ogbe, expressed support to similar concerns raised by the Shehu of Borno, the Borno state governor and other concerned Nigerians."
  },
  {
    "headline": "Breaking: Inflation Falls to 17.38%",
    "summarized_story": "By James EmejoThe Consumer Price Index, (CPI) which measures inflation dropped to 17.38 per cent (year-on-year) in July, compared to 17.75 per cent in the preceding month, according to the National Bureau of Statistics (NBS).\nThe NBS however, explained that the 0.37 per cent reduction in the headline index implied that prices continued to rise in July but at a slower rate than it did in June.\nIt noted that prices moderated in all parameters that determined inflation during the review period.\nAccording to the CPI report for July which was released Tuesday by the NBS, food inflation slowed to 21.03 per cent in the review period compared to 21.83 per cent in June, meaning that food prices continued to rise in July but at a slower speed than it did in June.\nCore inflation, which excludes the prices of volatile agricultural produce, however increased to 13.72 per cent, up by 0.63 per cent when compared with 13.09 per cent recorded in June."
  },
  {
    "headline": "(Updated) Breaking: Ibrahim Mantu is Dead",
    "summarized_story": "By Chuks OkochaFormer Deputy Senate President, Senator Ibrahim Mantu, is dead.\nSenator Mantu, who was Deputy President of the Nigeria Senate from 2001- 2007, died at about 2am on Tuesday, after nine days of sickness, according to family sources.\nThe late former deputy Senate President will be buried at 2pm today.\nBorn on February 16, 1947, the late politician began his political career with the defunct National Party of Nigeria (NPN).\nHe served as Chairman of the Senate Committee on Information before emerging as the Deputy Senate President in 2001."
  },
  {
    "headline": "Watershed Moment, As Buhari Signs Petroleum Act to Overhaul Oil Industry",
    "summarized_story": "The Petroleum Industry Act (PIA) provides legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters.\n“The Petroleum Industry Act provides legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters.”Buhari’s government is banking that the reforms will attract a greater share of global capital allocated to fossil fuel projects.\nIt will also see the transformation of the Nigerian National Petroleum Corporation (NNPC) into a profit-oriented company devoid of political interferences.\nAdded to that, is the establishment of the Nigerian Midstream and Downstream Petroleum Regulatory Authority which would be responsible for the technical and commercial regulation of midstream and downstream petroleum operations in the petroleum industry in Nigeria.\nAccording to the upper legislative chamber, the Act will also enable the country to make the most of economic gains of the oil industry for the benefit of Nigerians."
  },
  {
    "headline": "Expect More Intervention Projects in 2022, FG Assures N’Deltans",
    "summarized_story": "Ndubuisi FrancisThe federal government has told people of the Niger Delta region to expect more intervention projects in 2022, declaring that it was passionately seeking better and faster ways of delivering dividends to the people of the region.\nMinister of Niger Delta Affairs, Senator Godswill Akpabio stated this during the commissioning/handing over of the youth corps members’ lodge and viewing centre constructed by his ministry in Koroma Tai Community, Tai Local Government of Rivers State.\nHe urged the Niger Delta region to expect more intervention projects as soon as the 2022 appropriation bill is passed.\nFriday Mbakpone,stated that corps members played important roles in the community, school and offices and commended the ministry for providing comfort to the youth.\nIn a related development, the Akpabio, while commissioning the Community Primary School, Tombia in Yenagoa, Bayelsa State, stated that modern economy was knowledge-driven and the Niger Delta Region needed to be carried along."
  },
  {
    "headline": "Terror-linked Buhari's Minister, Pantami Bribes Information Tech Agency Board Members With Foreign Trip To Support ICT—Killer Bill",
    "summarized_story": "Sources in the National Information Technology Development Agency (NITDA) have revealed how the Federal Minister of Communications and Digital Economy of Nigeria, Isa Ali Pantami, bribed officials within the agency to enforce a bill targeted at destroying ICT startups in the country.\nSources who spoke with SaharaReporters, stated that the minister has been putting in effort to destroy the technology sector and impose his fundamentalist ideals on the works of other agencies.\nOne of the sources said, “Pantami tries to destroy technology sector and systematically encroach on works of other agency.\nThe new bill for which Pantami is lobbying officials is targeted at repealing the National Information Technology Development Agency Act, no 28 2007.\nSaharaReporters obtained a copy of the bill titled ‘A bill for an Act to repeal the National Information Technology Development Agency Act, no 28 2007 and enact the National Information Technology Development Agency Act to provide for the administration, implementation, regulation of information technology systems and practices as well as digital economy in Nigeria and for related matters’."
  },
  {
    "headline": "Terror-linked Buhari's Minister, Pantami Bribes Information Tech Agency Board Members With Foreign Trip To Support ICT—Killer Bill",
    "summarized_story": "Sources in the National Information Technology Development Agency (NITDA) have revealed how the Federal Minister of Communications and Digital Economy of Nigeria, Isa Ali Pantami, bribed officials within the agency to enforce a bill targeted at destroying ICT startups in the country.\nSources who spoke with SaharaReporters, stated that the minister has been putting in effort to destroy the technology sector and impose his fundamentalist ideals on the works of other agencies.\nOne of the sources said, “Pantami tries to destroy technology sector and systematically encroach on works of other agency.\nThe new bill for which Pantami is lobbying officials is targeted at repealing the National Information Technology Development Agency Act, no 28 2007.\nSaharaReporters obtained a copy of the bill titled ‘A bill for an Act to repeal the National Information Technology Development Agency Act, no 28 2007 and enact the National Information Technology Development Agency Act to provide for the administration, implementation, regulation of information technology systems and practices as well as digital economy in Nigeria and for related matters’."
  },
  {
    "headline": "BREAKING: Nigeria's Federal Judge “Disappears” As Soon As Bail Is Perfected For 12 Detained Igboho's Associates",
    "summarized_story": "Justice Obiora Egwuatu of the Federal High Court in Abuja has suddenly gone 'missing' after the 12 detained associates of Yoruba Nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho, met all their bail conditions.\nThe court had asked each of the 12 detainees to get two sureties each, making it a total of 24 sureties.\nSee Also Breaking News BREAKING Court Grants Bail To 12 Detained Igboho's Aides After 34 Days In CustodyThe Department of State Services (DSS) had arrested the 12 persons on July 1, 2021, during a raid on Igboho’s Ibadan residence around 1am, killing two persons in the process.\nThe 12 detained persons had approached the court to seek their release in line with their fundamental human rights.\nJustice Egwuatu had on August 4, 2021 admitted the 12 applicants to bail."
  },
  {
    "headline": "BREAKING: Nigeria's Federal Judge “Disappears” As Soon As Bail Is Perfected For 12 Detained Igboho's Associates",
    "summarized_story": "Justice Obiora Egwuatu of the Federal High Court in Abuja has suddenly gone 'missing' after the 12 detained associates of Yoruba Nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho, met all their bail conditions.\nThe court had asked each of the 12 detainees to get two sureties each, making it a total of 24 sureties.\nSee Also Breaking News BREAKING Court Grants Bail To 12 Detained Igboho's Aides After 34 Days In CustodyThe Department of State Services (DSS) had arrested the 12 persons on July 1, 2021, during a raid on Igboho’s Ibadan residence around 1am, killing two persons in the process.\nThe 12 detained persons had approached the court to seek their release in line with their fundamental human rights.\nJustice Egwuatu had on August 4, 2021 admitted the 12 applicants to bail."
  },
  {
    "headline": "BREAKING: Nigeria's Federal Judge “Disappears” As Soon As Bail Is Perfected For 12 Detained Igboho's Associates",
    "summarized_story": "Justice Obiora Egwuatu of the Federal High Court in Abuja has suddenly gone 'missing' after the 12 detained associates of Yoruba Nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho, met all their bail conditions.\nThe court had asked each of the 12 detainees to get two sureties each, making it a total of 24 sureties.\nSee Also Breaking News BREAKING Court Grants Bail To 12 Detained Igboho's Aides After 34 Days In CustodyThe Department of State Services (DSS) had arrested the 12 persons on July 1, 2021, during a raid on Igboho’s Ibadan residence around 1am, killing two persons in the process.\nThe 12 detained persons had approached the court to seek their release in line with their fundamental human rights.\nJustice Egwuatu had on August 4, 2021 admitted the 12 applicants to bail."
  },
  {
    "headline": "Plateau killings: Anyone rushing to bail suspects will be arrested, says Lalong",
    "summarized_story": "Simon Lalong, governor of Plateau, has ordered that anyone who “rushes to bail suspects” linked to attacks in the state will be arrested.\n“The rush to bail suspects of unrest when arrested for investigation frustrates efforts to find lasting solution to insecurity in Plateau.\nHenceforth, people rushing to bail suspects will also be arrested,” he said.\nAccording to the governor, insecurity, particularly in some LGAs, requires concerted efforts toward lasting peace.\n“In future, defaulters will be arrested and made to face the full wrath of the law,” he added."
  },
  {
    "headline": "Plateau killings: Anyone rushing to bail suspects will be arrested, says Lalong",
    "summarized_story": "Simon Lalong, governor of Plateau, has ordered that anyone who “rushes to bail suspects” linked to attacks in the state will be arrested.\n“The rush to bail suspects of unrest when arrested for investigation frustrates efforts to find lasting solution to insecurity in Plateau.\nHenceforth, people rushing to bail suspects will also be arrested,” he said.\nAccording to the governor, insecurity, particularly in some LGAs, requires concerted efforts toward lasting peace.\n“In future, defaulters will be arrested and made to face the full wrath of the law,” he added."
  },
  {
    "headline": "'Your money is safe, accessible' -- Bamboo, Risevest react to CBN freeze order",
    "summarized_story": "Fintech companies on the receiving end of fresh action by the Central Bank of Nigeria (CBN), say investors’ monies are safe and accessible.\nAdvertisementOn Tuesday, TheCable reported that the CBN got a court order to freeze the accounts of some fintech companies in order to investigate ‘illegal foreign exchange transactions’ by the companies.\nReacting to the move by CBN, Bamboo in a message to investors said it was aware of the situation and looking into the matter, assuring investors that funds are safe.\nOur legal and government relations teams are looking into it but we thought it was important to let you know that your money remains safe and will always be accessible,” Bamboo said.\n“We will work with regulators, as we always have to ensure that all issues raised are properly addressed."
  },
  {
    "headline": "'Your money is safe, accessible' -- Bamboo, Risevest react to CBN freeze order",
    "summarized_story": "Fintech companies on the receiving end of fresh action by the Central Bank of Nigeria (CBN), say investors’ monies are safe and accessible.\nAdvertisementOn Tuesday, TheCable reported that the CBN got a court order to freeze the accounts of some fintech companies in order to investigate ‘illegal foreign exchange transactions’ by the companies.\nReacting to the move by CBN, Bamboo in a message to investors said it was aware of the situation and looking into the matter, assuring investors that funds are safe.\nOur legal and government relations teams are looking into it but we thought it was important to let you know that your money remains safe and will always be accessible,” Bamboo said.\n“We will work with regulators, as we always have to ensure that all issues raised are properly addressed."
  },
  {
    "headline": "AFCON 2021: Super Eagles to face Egypt, Sudan, Guinea Bissau",
    "summarized_story": "The Super Eagles of Nigeria have been drawn in group D alongside Egypt, Sudan and Guinea-Bissau ahead of the 2021 Africa Cup of Nations (AFCON).\nAdvertisementThe 33rd edition of the biennial competition draw was held at the Yaounde conference centre on Tuesday evening.\nSenegal, the number one ranked African team by FIFA, were handed Zimbabwe, Guinea and Mali to battle in group B, while Algeria, the current champions, were placed in group E alongside Sierra Leone, Equatorial Guinea and Ivory Coast.\nIt was originally slated for this year but was postponed until early 2022 due to the coronavirus pandemic.\nSee full groups below:Group A: Cameroon, Burkina Faso, Ethiopia, Cape VerdeGroup B: Senegal, Zimbabwe, Guinea, MaliGroup C: Morocco, Ghana, Gabon, ComorosGroup D: Nigeria, Egypt, Sudan, Guinea-BissauGroup E: Algeria, Sierra Leone, Equatorial Guinea, Ivory CoastGroup F: TunisiaMali, Mauritania, Gambia"
  },
  {
    "headline": "Nigeria’s Central Bank freezes bank accounts of fintech platforms Risevest, Bamboo, Trove and Chaka",
    "summarized_story": "The Central Bank of Nigeria has just frozen the bank accounts of Nigerian fintech platforms Risevest, Bamboo, Trove and Chaka for the next six months.\nThe motion was filed by Chief Micheal Kaase Aondoakaa, SAN, on behalf of the Central Bank Of Nigeria Governor for the purpose of probing the financial activities of these four fintech companies in Nigeria.\n— Bamboo (@investbamboo) August 17, 2021So far none of the affected companies has come out to refute this claim.\nAccording to a source from one of the affected companies, they lost a lot of users and deposits after the April announcement.\nTechCabal has reached out to the affected fintech companies and is awaiting their comments."
  },
  {
    "headline": "Nigerian startup checks out of Afghanistan post Taliban takeover",
    "summarized_story": "The central government was disbanded; Ashraf Ghani, the president of Afghanistan fled the scene unannounced, leaving what remained of his administration in the mercy of the Taliban.\nMore recently, Chekkit, a Nigerian authentication and product tracking startup, expanded to Afghanistan after landing a partnership with the Afghanistan Ministry of Health to help in combating the endemic counterfeit medicine products in the country.\nTheir exit wasn’t much of a decision as all their partners have been forced to exit the country.\nObservers predict that with the Taliban in control, international trade will come to a standstill, leading to a surge in smuggling.\nThough after the capital takeover, the Taliban announced that the war is now over, can the dust settle that easily?"
  },
  {
    "headline": "Iyin Aboyeji, Caleb Zipperstein, on why Future Africa is opening an office in Israel",
    "summarized_story": "Last week, a former associate director with leading Isreali VC OurCrowd Caleb Zipperstein, announced his appointment as a venture partner with Future Africa, and the launch of their Israeli office.\nSo we sat down with Future Africa co-founder Iyin Aboyeji and Caleb to get some insight behind the move.\nAdegoke: What does the current state of ecosystem relationship between Africa and Israel look like and where will Future Africa take that relationship to?\nAdegoke: How would you characterize the Israeli ecosystem in terms of the size of investments, the biggest startups, or entrepreneurs?\nCaleb: Israel is not a B2C market."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "A Federal High Court sitting in Abuja has granted the Central Bank of Nigeria an order to freeze the accounts of..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "States may wait longer for appellate court to decide on VAT",
    "summarized_story": "Nigerian states will no doubt wait longer than expected for the Appeal Court to decide on whether it is truly the states and not the Federal Inland Revenue Services (FIRS) that should collect Value Added Tax (VAT) and Personal Income Tax (PIT).\nBut not satisfied with the court decision in Rivers State, the FIRS appealed the judgment, saying it had sought an injunction pending appeal and a stay of execution of the said judgment.\n“If the judgment is enforced or upheld on appeal, it will apply to other states and not just Rivers State.\nIt replaced sales tax operated under Decree No.7 of 1986, which was administered by states and the FCT.\nBy contrast, VAT is administered by the FIRS and the revenue is shared among all three levels of government."
  },
  {
    "headline": "NITDA’s 1% levy, licence plan for startups put ecosystem on edge",
    "summarized_story": "The Nigerian tech ecosystem is sitting on edge over a new NITDA Act proposing to include startups among companies and enterprises remitting a 1 percent levy of the profit before tax to the National Information Technology Development Fund (NITDEF).\nThe bill will also empower NITDA to fix licensing and authorisation charges, collect fees and penalties…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Nigeria’s BOI plans N362bn Eurobond to support COVID-hit businesses",
    "summarized_story": "Nigeria’s state-owned Bank of Industry plans to raise as much as N362 billion ($883 million) from international debt markets this year for lending to companies hampered by the Covid-19 pandemic in Africa’s largest economy, according to a Bloomberg report.\nFinancial advisers have been appointed for the issue, Olukayode Pitan, chief executive officer said in a…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "New petroleum law, injustice to South-South – Orbih – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin – The Peoples Democratic Party (PDP) in the South South has said that the the Petroleum Industry law recently signed by President Muhammadu Buhari has not addressed the injustice done oil-bearing Niger Delta communities.\nThis is contained in a statement by Chief Dan Orbih, National Vice Chairman, South South of Nigeria’s main opposition party on Tuesday.\nThe News Agency of Nigeria (NAN) reports that Buhari had signed the PIB into law on Monday in Abuja to further address challenges of development in the Niger Delta region.\nOrbi, however, in the statement which he personally signed, described the law as not only insensitive but a brazen act of injustice.\n“Embrace PDP as it holds the best promise of a better and progressive Niger Delta built on honour, justice and equity,” he said."
  },
  {
    "headline": "SWAN President’s death huge loss to sports development in Nigeria, official says – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The death of Ahmed Aigbona, the President of Sports Writers Association of Nigeria (SWAN), is a huge loss to sports development in Nigeria, the Association’s Secretary-General, Mike Oboh, says.\nOboh told sports journalists in Abuja on Tuesday that Aigbona’s death was not just a loss to his family or National SWAN but the Nigerian sports family as a whole.\nBut it goes beyond SWAN, it affects the whole Nigerian sports family.\nHe said the SWAN NEC would soon come up with some announcement on crucial issues regarding the Association.\nAigbona, a former Chairman of Edo SWAN and former member of the Edo Football Association, was elected SWAN National President on Oct. 7 in 2019 in Abuja."
  },
  {
    "headline": "COVID-19 3rd wave: Edo records one death, four new cases, as govt readies to begin second phase vaccination – Nigerian Observer",
    "summarized_story": "COVID-19 3rd wave: Edo records one death, four new cases, as govt readies to begin second phase vaccinationShare FacebookTwitterStumbleuponLinkedInPinterestEdo State on Tuesday recorded one death and four new cases of coronavirus (COVID-19), as the state prepares to begin the second phase vaccination rollout to protect citizens against the virus, amid the third wave of the pandemic.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State governor, Mr. Godwin Obaseki.\nObi said the four new cases bring to 107, the total number of confirmed cases recorded in the state since July 17, 2021 when the third wave of the pandemic started.\nAccording to him, “Edo State, in the last 24 hours, collected 141 samples and recorded four new confirmed cases of COVID-19, with no recoveries.\nHe disclosed that the National Primary Healthcare Development Agency has approved the deployment of 65, 020 doses of the Moderna vaccines to Edo State."
  },
  {
    "headline": "Edo rallies investors to expand state’s 350,000mt per annum aquaculture subsector – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said efforts are being made to create the conducive environment to attract investors to expand the 350,000mt per annum aquaculture subsector to diversify the state’s economy.\nFunctioning Permanent Secretary, Ministry of Agriculture and Natural Resources, Peter Aikhuomobhogbe Uidia, disclosed this during a virtual engagement with Edo indigenes in the Diaspora.\nStating that the state is seeking to attract investment to expand the aquaculture subsector in the state, he said, “Aquaculture in Edo State is an emerging industry that is currently dominated by African catfish (Clarius garlepinus) and very limited number of tilapia (Oreochromis niloticus) production enterprises.\nThe current production level in the aquaculture subsector is estimated at not less than 350,000mt per annum.\nIn the artisanal fisheries subsector, the state has not less than 6,000 fishing families."
  },
  {
    "headline": "EXCLUSIVE: Full list of students, staff kidnapped from Zamfara college",
    "summarized_story": "PREMIUM TIMES has obtained the names of 19 people kidnapped by bandits in Zamfara State College of Agriculture and Animal Sciences, Bakura, in a Sunday night attack.\n15 Students and four staff were also kidnapped.\nA security official of the College sent the completed list of those kidnapped and those killed.\nAccording to the list seen by this reporter, the students kidnapped are Isma’il Lawali, Salim Salisu, Kabiru Lawali, Yasir Lawali, Awaisu Jabir, Aminu Umar, Abba Aliyu, Aminu Adamu, Usman Umar and Umar Haruna.\nThe college registrar, Aliyu Bakura, said the attackers invaded the school premises with sophisticated weapons abducted and killed the victims."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "‘Illegal FX transactions’: CBN secures order freezing Risevest, Bamboo, others’ accounts",
    "summarized_story": "Nigeria’s apex bank, the Central Bank of Nigeria (CBN), has secured an order of a federal high court in Abuja to freeze accounts of fintech companies for 180 days.\nThe accounts include that Rise Vest Technologies Limited, Bamboo Systems Technology Limited, Bamboo Systems Technology Limited OPNS, Chaka Technologies Limited, CTL/Business Expenses, and Trove Technologies Limited.\nThe CBN said it is still investigating ‘illegal foreign exchange transactions’ by the companies.\nIt also sought the court injunction to freeze their bank accounts for 180 days pending the completion of investigations.\nHe then adjourned the matter to February 20, 2022, for hearing."
  },
  {
    "headline": "National Book Clubs and Reading Promoters unveil logo for ‘Uyo 2021’ conference",
    "summarized_story": "By OBINNA EZUGWUThe Local Organizing Committee of the fast approaching, National Book Clubs and Reading Promoters Conference, ‘Uyo 2021’ headed by Rt Hon.\nEmemobong Nicholas, a good number of the LOC Members, Book Club members as well as members of the Press.\nThe conference billed to hold from from September 16 through 19, 2021 at Watbridge Hotel, would feature a conference, reading sessions, sightseeing and performance events.\nEstablished in February 2020, the Network of Book Clubs and Reading Promoters in Nigeria ‘has continued to position itself as a platform for galvanising disparate book club energies in the country while also engendering even more activity that would be overly beneficial to the book sector and the country.’Member clubs that make up the Network include Oleh Book Club, Uyo Book Club, Asaba Reading Club, Ignite Africa Leadership Foundation, iRead Mobile Library, Arepo Book Club, PEA Foundation, Warri Book Club, Raffia City Book Club, Osogbo Book Club and Eket Book Club.\nOthers are Aba Book Club, Bookworm Cafe, Atiba Book Club, CRIMMD Free Public Library, CSS Book Club, Ibadan Book Club, Laterna Book Club, Ikorodu Library Book Club, Lead Out Education Foundation, Openway Reading Awareness Initiative, Readland Leadership Children’s Centre, Writers in Motion, Pens and Voices Book Club, Read2Me Book Club, The Bibliotheque Nigeria, The African Writers Tribe and The 1402 Book Lounge."
  },
  {
    "headline": "Air Peace CEO, Onyema preaches unity, love for country",
    "summarized_story": "Mr. Allen Onyema, Chief Executive Officer (CEO) of Air Peace Airline, has called on Nigerians to have hope in one Nigeria, noting that it’s still a great country despite challenges.\nOnyema who made the call on Tuesday in Ibadan during inaugural flight of Air Peace Airline at Ibadan airport, stressed that there was need for every citizen to work toward sustaining the unity of the country, saying Nigerians don’t have any other country.\nIn his remarks, Makinde said his administration would continue to upgrade facilities at the Ibadan airport till it assume international standard.\nThe governor expressed optimism that the commencement of air flight operations by Air Peace airline at Ibadan, would promote the economy of the state.\nShe called on other airline operators to come to Ibadan airport for business."
  },
  {
    "headline": "Bandits demand N350m ransom for abducted Zamfara college students, staff",
    "summarized_story": "Bandits have demanded N350 million ransom for students and staff of the College of Agriculture and Animal Science, Bakura in Zamfara State.\nProvost of the College, Alhaji Habibu Mainasara made the disclosure in a phone interview with PUNCH.\nMainasara said the bandits called him and told him that they “needed N350 million for the 20 people currently in their captivity”.\nAccording to him, “They said that the money must be paid before they could release the staff and the students they kidnapped in my school,” he added.\nThe Provost did not make a further explanation on whether the families of the affected staff and students would pay the amount or the state government."
  },
  {
    "headline": "African School Principals Tasked On Quality Secondary Education",
    "summarized_story": "The Director, Federal Capital Territory Education Resources Centre, Hajiya Neemat Abdulraheem, has called on principals of secondary schools in Africa to be committed to the task of providing quality education to their students.\nHajiya Neemat Abdulraheem made the call in Abuja while speaking with journalists at the conference of African Confederation Of Principals.\nADVERTISEMENTAccording to her, principals of secondary schools also have a critical roles to play in ensuring that students acquire necessary education needed for their self-reliance in the future.\nThe FCT Director of ERC noted that no nation could develop without given attention to educational development of her citizens.\nHajiya Abdulraheem further explained that FCT Education Resource Centre had put in place necessary measures to enhance educational development in the Territory."
  },
  {
    "headline": "African School Principals Tasked On Quality Secondary Education",
    "summarized_story": "The Director, Federal Capital Territory Education Resources Centre, Hajiya Neemat Abdulraheem, has called on principals of secondary schools in Africa to be committed to the task of providing quality education to their students.\nHajiya Neemat Abdulraheem made the call in Abuja while speaking with journalists at the conference of African Confederation Of Principals.\nADVERTISEMENTAccording to her, principals of secondary schools also have a critical roles to play in ensuring that students acquire necessary education needed for their self-reliance in the future.\nThe FCT Director of ERC noted that no nation could develop without given attention to educational development of her citizens.\nHajiya Abdulraheem further explained that FCT Education Resource Centre had put in place necessary measures to enhance educational development in the Territory."
  },
  {
    "headline": "Withheld Certificate: Melaye, Others Seek Justice For Late NANS President",
    "summarized_story": "The first-ever President of the National Association of Nigerian Students (NANS), Late Comrade Danladi Sunday Oladele, died without being allowed to collect his certificate 41 years after graduation from Yaba College of Technology (YabaTech), Lagos.\nHe said Oladele’s certificate is still being held by the management of YabaTech as a punitive measure over his activism during his days in the college.\nMelaye, a two-time Member of the National Assembly, however, vowed that NANS would ensure that the certificate is retrieved from the school before the remains of Oladele is buried.\n“Seeing how long the injustice had persisted, the Senate mandated the management of YABATECH to release forthwith his certificate withheld for 41 years.\n“Being the pioneer NANS President, a national burial, befitting of his kind, in collaboration with his family, is being coordinated under the Chairmanship of my humble self (Sen. Dino Melaye),” Melaye said."
  },
  {
    "headline": "Withheld Certificate: Melaye, Others Seek Justice For Late NANS President",
    "summarized_story": "The first-ever President of the National Association of Nigerian Students (NANS), Late Comrade Danladi Sunday Oladele, died without being allowed to collect his certificate 41 years after graduation from Yaba College of Technology (YabaTech), Lagos.\nHe said Oladele’s certificate is still being held by the management of YabaTech as a punitive measure over his activism during his days in the college.\nMelaye, a two-time Member of the National Assembly, however, vowed that NANS would ensure that the certificate is retrieved from the school before the remains of Oladele is buried.\n“Seeing how long the injustice had persisted, the Senate mandated the management of YABATECH to release forthwith his certificate withheld for 41 years.\n“Being the pioneer NANS President, a national burial, befitting of his kind, in collaboration with his family, is being coordinated under the Chairmanship of my humble self (Sen. Dino Melaye),” Melaye said."
  },
  {
    "headline": "Pro-Saraki Group Distributes Fertilisers To Farmers",
    "summarized_story": "A political support group, Saraki Is Coming Door To Door 2023 organisation, has donated bags of fertiliser to low-income farmers in North-West part of the country.\nNational Coordinator of the group, Umar Faringado Kazaure, in a statement in Abuja, said the gesture was to deepen the philanthropic gesture and disposition of the President of the 8th Senate, Dr. Abubakar Bukola Saraki.\nHe said farmers in Kano, Katsina Kaduna, Kebbi, Jigawa, Sokoto and Zamfara States were target beneficiaries of the gesture.\nADVERTISEMENT“We are doing this to show who our mentor, Dr. Abubakar Bukola Saraki, is.\n“Our group, ‘Saraki Is Coming Door To Door 2023’ is undertaking this gesture of fertiliser distribution to low-income farmers to continue with the good works of Dr Abubakar Bukola Saraki across Nigeria."
  },
  {
    "headline": "Nigeria’s Consulate in New York suspends services",
    "summarized_story": "The Consulate-General of Nigeria in New York has announced the suspension of all in-person processing of consular and immigration services for one week, effective Sept. 20.\n“Affected passport applicants will be notified of this development through the email address and telephone numbers indicated in their applications,” it stated.\nThe consulate-general requested affected applicants to choose alternative convenient dates between Aug. 19 and Sept. 17 or other dates from Sept. 28, 2021.\n“The Consulate regrets any inconvenience caused by this development,” the notice stated.\nThe News Agency of Nigeria (NAN) reports, however, that no reason has been given by the consulate-general for the imminent temporary suspension of services on the affected dates."
  },
  {
    "headline": "Nigeria’s Consulate in New York suspends services",
    "summarized_story": "The Consulate-General of Nigeria in New York has announced the suspension of all in-person processing of consular and immigration services for one week, effective Sept. 20.\n“Affected passport applicants will be notified of this development through the email address and telephone numbers indicated in their applications,” it stated.\nThe consulate-general requested affected applicants to choose alternative convenient dates between Aug. 19 and Sept. 17 or other dates from Sept. 28, 2021.\n“The Consulate regrets any inconvenience caused by this development,” the notice stated.\nThe News Agency of Nigeria (NAN) reports, however, that no reason has been given by the consulate-general for the imminent temporary suspension of services on the affected dates."
  },
  {
    "headline": "CBN, Police, others to prosecute naira abusers",
    "summarized_story": "The Central Bank of Nigeria has warned that abusers of naira notes will be prosecuted by the financial regulator in collaboration with other regulatory bodies such as the Nigeria Police Force, Federal Inland Revenue Service, the Economic and Financial Crimes Commission and the Nigerian Financial Intelligence Unit.\nThe warning, according to the CBN, was necessitated by the activities of some people who flagrantly abuse the legal tender at social functions.\n“There have also been cases where people mishandle the naira, deface it, hawk the currency at parties and reject the currency in some instances.\n“The naira is our legal tender and symbol of national pride.\nLet us respect it and handle it with care,” the statement added."
  },
  {
    "headline": "CBN, Police, others to prosecute naira abusers",
    "summarized_story": "The Central Bank of Nigeria has warned that abusers of naira notes will be prosecuted by the financial regulator in collaboration with other regulatory bodies such as the Nigeria Police Force, Federal Inland Revenue Service, the Economic and Financial Crimes Commission and the Nigerian Financial Intelligence Unit.\nThe warning, according to the CBN, was necessitated by the activities of some people who flagrantly abuse the legal tender at social functions.\n“There have also been cases where people mishandle the naira, deface it, hawk the currency at parties and reject the currency in some instances.\n“The naira is our legal tender and symbol of national pride.\nLet us respect it and handle it with care,” the statement added."
  },
  {
    "headline": "Exclusive: After CBN crackdown, online stock trader Rise Vest assures investors",
    "summarized_story": "By AbankulaOnline stock trading company Rise Vest Technologies Limited swiftly assured investors on Tuesday night that their investments are safe, in the wake of CBN crackdown.\nOthers affected are Bamboo Systems Technology Limited, Bamboo Systems Technology Limited OPNS,Chaka Technologies Limited, CTL/Business Expenses and Trove Technologies Limited.\n), ACCESS BANK OF NIGERIA (999c, Danmole Street, Off ldejo Street, Off Adetola Odeku Street, Victoria Island, Lagos), VFD MICROFINANCE BANK (Elephant House.\n“Rise Vest Technologies Limited was Incorporated in October 2018 with objects of technological and business consultancy.\n“The shareholders of the company at incorporation were Eke Eleanya Urum and Rise Vest Technologies Limited (USA)."
  },
  {
    "headline": "BBNaija: Team Braids wins Darling Hair challenge",
    "summarized_story": "Members of Team Braids – Liquorose, Michael, Yousef, JMK and Queen have won the Darling Hair Challenge.\nEach of these BBNaija housemates would be rewarded with N750,000 each.\nAccording to the report as read by Head of House Maria, Team Braids excelled by their originality, timing and team work.\nHousemates were asked to style the provided Darling hair products, tell a hair story and also dance.\nThe twenty house mates were divided into four groups – Team Braids, Team Empress, Team Crochet and Team Naturals."
  },
  {
    "headline": "Buhari Lost Appetite Over News Of 25 Muslims Killed – Pantami",
    "summarized_story": "President Buhari lost his appetite after being briefed about the killings of 25 travelers in Rukuba, Plateau state, according to Minister of Communications and Digital Economy Isa Pantami.\nMr Pantami made the statement while paying a condolence visit to Dahiru Bauchi, an Islamic scholar, following the murder of Muslims who had come to him to celebrate the Islamic New Year.\n“The president had subsequently commanded that those behind the attack be fished out and prosecuted,” Mr Pantami said in a video shared on WhatsApp.\nHe had just returned from a journey, and as a matter of fact, the president could not even eat food,” the minister added.\n25 Muslims were gathered up and slaughtered by hoodlums in Rukuba, Jos North Local Government Area, over the weekend after returning from Bauchi State, where they had gone to celebrate the Islamic New Year."
  },
  {
    "headline": "BREAKING: Forex Trading: Court Freezes Bank Accounts Of Rise Vest Technologies, Bamboo Systems Technology, Others",
    "summarized_story": "Rise Vest Technologies Limited, Bamboo Systems Technology Limited, Bamboo Systems Technology Limited OPNS, Chaka Technologies Limited, CTL/Business Expenses, and Trove Technologies Limited are the defendants in this case.\n), ACCESS BANK OF NIGERIA (999c, Danmole Street, Off ldejo Street, Off Adetola Odeku Street, Victoria Island, Lagos), VFD MICROFINANCE BANK (Elephant House.\nIt says, “Rise Vest Technologies Limited was Incorporated In October 2018 with objects of technological and business consultancy.\nThe shareholders of the company at incorporation were Eke Eleanya Urum and Rise Vast Technologies Limited (USA).\n“The above is indicative that Rise Vest Technologies Limited traded in cryptocurrencies in contravention of the CBN circular referenced BSD/DIR/PUB/LAB/014/001, dated February 5 2021.”The motion added that “Bamboo Systems Technology Limited Bamboo Systems Technology Limited is owned by US-based Bamboo Global LLC (99.99%) and Oluwole Raiph Olugbenga (0.01%)."
  },
  {
    "headline": "In Delta, Five Suspected Armed Robbers, Kidnappers Arrested",
    "summarized_story": "Five alleged armed robbers and kidnappers have been apprehended by Delta State Police Command’s Special Anti-Cult Unit, SACU Operatives in Sapele, Sapele Local Government Area.\nNelson Ofurhie, 40 years old, Efe Adams, 32 years old, Williams Onufuevue, 46 years old, Enajite Itiefie, 37 years old, and Oghenero Eruteta, 37 years old are among the suspects.\nAccording to DAILY POST, they were apprehended during a search on a criminal hideaway in Ogorode Sapele.\nOne AK 47 rifle with breech number KT1921, one locally fabricated AK47 rifle, two (2) pump action guns, two (2) locally made single barrel guns, 47 rounds of 7.62mm live ammunition, a quantity of hard drugs, one ash color Mercedes Benz Jeep with registration number AFZ 735 HW, one white color Lexus Jeep with registration number KUJ 983 NW, and one (1) ash color Toyota Corolla car with registration number SAPIn a statement signed by the Acting Police Public Relations Officer, DSP Bright Edafe, the Delta State Police Command, commanded by CP Ari Muhammed Ali, confirmed the report.\nAccording to DSP Edafe “Case is under investigation.”"
  },
  {
    "headline": "Investigation Into Abduction Of Bayelsa SSG‘s Mother Begins, One Arrested",
    "summarized_story": "The Nigerian Army has captured a 27-year-old suspect 25 days after the kidnapping of Madam Bentinal Benson, the 86-year-old mother of the Secretary to the State Government of Bayelsa State.\nThe culprit was apprehended just days after the Nigerian Army took over the investigation into the kidnapping.\nIt had previously been stated that her kidnappers, who broke into her home in the old Assembly quarters, Azikoro road, Yenagoa, were clothed in military attire.\nThe suspect, named Stanley Woniowei, is a native of the Olugbobiri community in the state’s Southern Ijaw Local Government region.\nThe accused suspect was allegedly involved in the kidnapping on July 20th at the Old State Legislators quarters off Azikoro road in the Ekeki region of the state, according to investigations."
  },
  {
    "headline": "N1.8trn recovered loot, N450bn assets: 36 states drag FG to Supreme Court, allege diversion",
    "summarized_story": "The governors also accused the federal government of diverting another N450 billion worth of non-cash assets recovered proceeds of crime since 2015.\nThey are therefore asking for the remittance of N1.8 trillion (cash) and N450billion (non-cash) in recovered loot since 2015 into the federation account.\n“By establishing the Asset Recovery Account and interim Forfeiture Recovery Account into which revenue from recovered assets is to be paid, the Asset Recovery Regulation contradicts the provisions of the Constitution.\nHe said: “They represent Nigerians and Nigerians deserve to know because they have been clamouring for the assets recovery, transparency and monitoring value amongst others.\nNigerians have been rooting for accountability and transparency as regards assets recovery."
  },
  {
    "headline": "Breaking: Super Eagles in AFCON 2021 group of death, face Pharaohs’ Egypt, Sudan, Guinea Bissau *See full draw",
    "summarized_story": "Nigeria’s Super Eagles will have their hands full when 2021 Nation’s Cup gets underway in Cameroon.\nThis was after Tuesday night AFCON draw pitched them with serial continental winners Pharaohs of Egypt, Sudan and Guinea Bissau in group D.See details of the 2021 AFCON drawGROUP ACameroon 🇨🇲Ethiopia 🇪🇹Cape Verde 🇨🇻Burkina Faso 🇧🇫GROUP BSenegal 🇸🇳Zimbabwe🇿🇼Malawi 🇲🇼Guinea 🇬🇳GROUP CMorocco 🇲🇦Comoros 🇰🇲Gabon 🇬🇦Ghana 🇬🇭GROUP DNigeria 🇳🇬Sudan 🇸🇩Guinee Bissau 🇬🇼Egypt 🇪🇬GROUP EAlgerie 🇩🇿Equitorial Guinee 🇬🇶Sierra Leon 🇸🇱Cote D’ivoire 🇨🇮GROUP FTunisie 🇹🇳Gambia 🇬🇲Mauritania 🇲🇷Mali 🇲🇱"
  },
  {
    "headline": "Revealed! How to use and minimise high cost on prepaid electricity meter",
    "summarized_story": "Here are Nine ways you can save electricity consumption in your residence or place of business.\n· Switch to energy-efficient light bulbs: Traditional light bulbs waste 95% of the energy they use giving off heat with only 5% going toward the light.\n· Purchase energy-efficient appliances: Appliances account for a large amount of enemy consumed in households, offices, and industries.\nWith this in mind, it is important to be intentional about purchases made to ensure that energy-efficient appliances are installed.\n· Service your air conditioner: Easy maintenance, such as routinely replacing or cleaning air filters can lower your cooling systems energy consumption."
  },
  {
    "headline": "Photo Op of FCT Minister’s visit to the IGP -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "NSOANP, Smile Train, Move to Stop Preventable Deaths -NigPilot",
    "summarized_story": "Worried about the occurrence of preventable deaths in Nigeria, the National Surgical, Obstetric, Anaesthesia and Nursing Plan (NSOANP), in collaboration with Smile Train, has embarked on capacity building for nurses in the country.\nConsequently, NSOANP the duo has organised a five day training on ‘Nursing Care Saves Lives,’ with participants drawn from the nursing profession across the country in Abuja.\nSpeaking at the opening of the training, Smile Train Programme Manager, West Africa, Victoria Awazie stressed that the training was critical to ensure that nurses were abreast with global best practices in providing care to patients.\nOlubunmi who doubles as a member NSOANP committee maintained that there could never be successful surgical intervention care without quality nursing care, as nurses were always available even when other health care professionals, especially doctors, were not.\n“If medications or equipment are not available, there is little or more the nurses can do within their capacity."
  },
  {
    "headline": "Christian pilgrims pray for Nigerian security, economic prosperity at Mount Nebo -NigPilot",
    "summarized_story": "Nigerian Pilgrims in Jordan have taken the nation’s security challenges and economic prosperity of the nation to God at Mount Nebo.\nThe Nigerians on Pilgrimage to Jordan yesterday prayed fervently for God’s divine intervention on the prevailing security challenges in different parts of the country.\nWhile praying against the spirit of anger, destruction and disobedience, the Christian Pilgrims noted that life without God is meaningless.\nThe pilgrims who were divided into various groups prayed for economic prosperity of the nation, youth development and peaceful co-existence in the country.\nA tour guard, Mueen Akroush, who led the pilgrims round Mount Nebo and other Holy sites, gave an insight into the Biblical history of the sites and their imperatives to the present day."
  },
  {
    "headline": "NAPTIP arrests man for trafficking girlfriend to Mali for prostitution -NigPilot",
    "summarized_story": "Operatives of the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, have arrested a middle-aged man, Emmanuel Stephen for allegedly trafficking his 21 years old girlfriend (name withheld) to Mali for prostitution and sexual exploitation.\nThe arrest came barely two weeks after a notorious trans-border human trafficker was arrested by the combined team of NAPTIP and another sister Security agency in Kano on their way to Libya.\nAccording to him, the Sister promised that the girl will help her to work in a beer parlour in Mali.\nFew weeks later, due to the rigorous sexual activities with numerous partners, the victim was said to have developed a strange sickness with other associated health challenges and presently in serious condition.\nNAPTIP in partnership with other stakeholders will do everything possible to rescue her."
  },
  {
    "headline": "NNPC Limited To Kick Off In Six Months – Sylva",
    "summarized_story": "﻿The Nigerian National Petroleum Corporation (NNPC) will become a commercial company within six months, the Minister of State for Petroleum Resources, Timipre Sylva said on Tuesday.\nThis follows the signing of the Petroleum Industry Bill into law by President Muhammadu Buhari on Monday.\nMr Sylva, who was speaking at a press conference in Abuja, said a transitional committee is already in place to incorporate NNPC Limited.\nREAD ALSO: President Buhari Signs Petroleum Industry Bill Into LawAll shares in NNPC Limited are expected to be vested in the government at incorporation and held by the Ministry of Finance.\nMr Sylva noted that although the new petroleum act has deregulated the oil sector, subsidy policies will remain in place till further notice."
  },
  {
    "headline": "States Sue Malami Over Remittance Of Recovered Funds",
    "summarized_story": "The 36 states of the country have filed a suit at the Supreme Court against the Federal Government on the status of recovered funds and failure to remit same to the federation account.\nThrough their Attorneys-General, who are listed as plaintiffs in the suit, the 36 states instituted the action against the Attorney General of the Federation, Abubakar Malami.\nIn the suit, the plaintiffs are seeking a declaration by the provisions of 162 (1) and Section 162(10) of the Constitution of the Federal Republic of Nigeria 1999 (as amended), all income, returns, proceeds, or receipts derived from confiscated, forfeited and/or recovered assets constitute revenue must be remitted to the federation account for the collective benefit of the Federal, State and Local Governments.\nREAD ALSO: Buhari Mourns Former Deputy Senate President, Ibrahim MantuAmongst other things, they are also seeking a declaration that the failure and/or refusal of President Muhammadu Buhari, the Minister of Finance, the office of the AGF, and the Accountant-General of the Federation, and all her relevant authorities and/or agencies of the federation to remit the receipts, income, returns or proceeds derived from all assets recovered, seized, confiscated and forfeited into the federation account to be distributed in accordance with the provisions of the Constitution” is unconstitutional.”They also asked the court to declare that “it is unconstitutional for the President, through the federal Minister of Finance, the AGF, or any other authority whatsoever, to utilise, apply, allocate, expend and appropriate same to itself or distribute same in any other manner howsoever without due allocation from the federation.”A Senior Advocate of Nigeria, Femi Falana who filed the suit in June on behalf of the 36 states told Channels Television that the Supreme Court is yet to give a date for the hearing of the suit."
  },
  {
    "headline": "Abductors Of Zamfara College Students Demand N350 Million",
    "summarized_story": "﻿The abductors of the students and staff of the College of Agriculture and Animal Science, Bakura in Zamfara State are demanding N350 million for their release.\nThe gunmen had stormed the institution around 11 pm on Sunday and kidnapped the students and staff of the college.\nMeanwhile, the Zamfara State Governor, Bello Matawalle, had promised to secure the release of the victims of the latest abduction by bandits in the state.\nREAD ALSO: Matawalle Promises To Secure Release Of Abducted Zamfara College StudentsIn a statement by his spokesman, Yusuf Gusau, on Monday, he condemned the attack on the College of Agriculture and Animal Science, Bakura.\nGovernor Matawalle called on the people to intensify prayers for an end to all criminal activities in the state and the nation at large."
  },
  {
    "headline": "FG Receives 699,760 Doses Of Astrazeneca Vaccine",
    "summarized_story": "﻿The Federal Government has received 699,760 doses of the AstraZeneca vaccine, donated by the UK government.\nWe have consistently pushed for a global effort that helps every country receive the vaccine against COVID-19.\nI am so pleased to see Nigeria receive 699, 760 doses, donated by the UK, in their second batch of the vaccine through COVAX,” Atkinson said.\nRead Also: COVID-19 Vaccines: Next Step Of Response Will Depend On Health Workers – IhekweazuHe also warned citizens against mixing vaccines.\nThe second phase of the vaccination programme was breathed into life after the US donated over four million doses of the Moderna vaccine."
  },
  {
    "headline": "Niger, Akwa Ibom Governors, Others Celebrate IBB @ 80",
    "summarized_story": "Governors of Niger, Akwa Ibom and Sokoto states today met in Minna, the Niger State capital to celebrate with former Nigerian Military President Ibrahim Badamasi Babangida on the occasion of his 80th Birthday at his hilltop residence.\nAlso speaking to journalists, the Akwa Ibom State Governor Emmanuel Udom described the former Military President as a highly detribilised leader who succeeded in uniting the country despite the differences in religion and tribe.\nUdom said the celebrant is a rare Nigerian who combines character and charisma and deserves to be celebrated.\nHe said Babangida is respected and of inestimable value to the nation based on his experiences.\nThe governors all prayed for God to grant the celebrant more years, strengthen him and give him more wisdom to continue to counsel the younger generation."
  },
  {
    "headline": "AFCON Qualifiers: Nigeria draws Sudan, Egypt, Guinea Bissau",
    "summarized_story": "Nigeria’s Super Eagles have been drawn against Sudan, Egypt and Guinea Bissau in the group D.The draw took place on Tuesday.\nGroup A Cameroon Burkina faso Ethiopia Cape VerdeGroup B Senegal Zimbabwe Guinea MalawiGroup c Morocco Ghana Comoros GabonGroup D Nigeria Egypt Sudan Guinea BissauGroup E Algeria Sierra Leone Equatorial Guinea Cote d’ivoire"
  },
  {
    "headline": "Gov Ishaku condoles with Plateau counterpart over Mantu’s death",
    "summarized_story": "Taraba State governor, Darius Ishaku of Taraba State has condoled with his Plateau State counterpart, Simon Lalong over the death of Ibrahim Mantu, former Deputy Senate President.\nGovernor Darius Ishaku described the late Senator Mantu as a consistent and influential political voice whose contributions to the birth and sustenance of the current democratic dispensation in Nigeria will never be forgotten.\nHe said that as a politician, Senator Mantu never wavered in his belief and desire for the unity of Nigeria.\nnoting that this guided his actions and utterances as member of the Senate.\nThe governor added that with his death, Nigeria has lost a strong political voice and a bridge builder as well prayed God to grant his soul eternal rest."
  },
  {
    "headline": "Makinde sends N50b Supplementary budget to Oyo Assembly",
    "summarized_story": "Oyo State Governor, Seyi Makinde has sought the consideration and approval of the State House of Assembly for a supplementary budget of N50billion.\nThe request was contained in a letter sent to the House of Assembly by the Governor and read at plenary by the Speaker, Adebo Ogundoyin.\nDuring the plenary which held earlier, the lawmakers had approved a loan request of N6billion for the governor.\nIn making the request for the additional budget, the Governor said that the N50billion Supplementary budget was to cater for three major projects not captured in the approved 2021 budget.\nAt the plenary, the Oyo State Supplementary Finance Bill, 2021 and the Supplementary Appropriation Bill 2021 both scaled through the first and second reading in the house."
  },
  {
    "headline": "Taliban Vow to Respect Women’s Rights ‘Under Islamic Law’",
    "summarized_story": "Mujahid, who had been a shadowy figure for years, promised the Taliban would honor women’s rights, but within the norms of Islamic law, though he gave few details.\nMany women have expressed dread that the two-decade Western experiment to expand their rights and remake Afghanistan would not survive the resurgent Taliban.\nGermany, meanwhile, halted development aid to Afghanistan over the Taliban takeover.\nMeanwhile, women in hijabs demonstrated briefly in Kabul, holding signs demanding the Taliban not “eliminate women” from public life.\nThe rights of all Afghans must be defended.”Germany, meanwhile, suspended development aid to Afghanistan, estimated at 250 million euros ($294 million) for 2021."
  },
  {
    "headline": "Ethnic Clashes in Cameroon Forces Thousands to Flee to Chad",
    "summarized_story": "No less than 10,000 people, mostly women and children, have fled into Chad from northern Cameroon this week after deadly clashes between herding and fishing communities, the UN has said.\n“The pressing needs are for health services, shelter and food,” said Iris Blom, the United Nations refugee agency’s deputy director in Chad.\nClashes between ethnic groups are rare in Cameroon but frequent in Chad and Nigeria, particularly between sedentary farmers and semi-nomadic herders.\nIn Chad, the local governor said authorities were moving to ensure the conflict does not spill across the border from Cameroon.\nCameroon’s Far North is also struggling with cross-border attacks by jihadists from northeastern Nigeria."
  },
  {
    "headline": "Uganda to Accommodate 2,000 Afghan Refugees on US Request",
    "summarized_story": "Uganda is set to bring in two thousand Afghan refugees fleeing the crisis in their country at the request of the United States Government.\nRefugees Minister Esther Anyakun told the BBC that President Yoweri Museveni agreed to take in the refugees at the request of the Americans.\nWhen they land, Uganda will become the first African country to take in people fleeing the current crisis in Afghanistan.\nUganda has a long history of hosting refugees – and is currently home to more than one million people who have fled conflict or other disasters.\nRefugees in Uganda live in settlements or villages alongside the population."
  },
  {
    "headline": "Nigeria: Year-On-Year Headline Inflation Decelerates to 17.38%",
    "summarized_story": "Nigeria’s year-on-year headline inflation rate fell to 17.38 per cent for the fourth consecutive month in July from 17.75 per cent in June amid a decelerating increase in food prices, the National Bureau of Statistics (NBS) has said.\nOn a month-on-month basis, the headline index increased by 0.93 per cent in July 2021.\nThis is 0.13 percentage points higher than the rate recorded in June 2021 (1.06per cent).\nIt said the composite food index rose by 21.03 per cent in July 2021 compared to 21.83 per cent in June 2021.\nThe agency added that month-on-month basis, the food sub-index increased by 0.86 per cent in July 2021, down by 0.25 per cent points from 1.11 per cent recorded in June 2021."
  },
  {
    "headline": "Energy Lawyer Gbite Adeniji Unpacks the Petroleum Industry Act 2021",
    "summarized_story": "On Monday, there was palpable excitement when news broke that President Muhammadu Buhari had signed the PetroleumIndustryBill into law.\nIn so doing, he broke the jinx that had prevented the enactment of the oil industry legislation for 13 years.\nHowever, Buhari, who doubles as the Minister of Petroleum Resources, cannot afford to rest on his oars, as he would now have to contend with the difficult task of implementing the provisions of the Petroleum Industry Act of 2021.\nMr. Adeniji is an energy lawyer and Managing Partner at the law firm, ENR Advisory.\nHe also served as Technical Adviser to the former Minister of State for Petroleum Resources, Dr. Ibe Kachikwu."
  }
]