[
  {
    "headline": "Zamfara bandit boasts about exploits in trending video",
    "summarized_story": "In a video which went viral on Saturday, a notorious bandit operating within the precincts of Zamfara forest boasted about his operations and exploits against the Nigerian military.\nIn the video which lasted four minutes and 40 seconds, the dreadlocks-wearing bandit was seen boasting about some of his exploits, especially ambushes against military convoys.\nIt was not clear when the video was shot but it is believed to have been shot a few months ago.\nThe other day, they went to Zurmi and kidnapped children, small children.\nWe don’t kill innocent people.”It was not clear if Dankarami’s claim of some children was in reference to 40 children kidnapped alongside 160 others from a school in Niger State in May 2021."
  },
  {
    "headline": "Bandits on the rampage, attack air force patrol in Zamfara, Kogi Assembly",
    "summarized_story": "Suspected bandits went on the rampage during the week, attacking at least three hallowed institutions in the country: the Kogi State House of Assembly Complex; Olusegun Agagu University of Science and Technology, Okitipupa, Ondo State; and the Nigerian Air Force in Zamfara State.\nIn Zamfara State, bandits on Thursday attacked a patrol team of Operation Hadarin Daji, comprising operatives of the Nigerian Air Force and Police Special Forces, in the Bundugu area of the state.\nHe said, “There was no attack on the NAF base in Zamfara State.\nThe army said the bandits and troops engaged in a fierce gun battle during their patrol along Mayanchi-Dogo, Karfe, and Fagantama villages in the state.\n“Relatedly, troops have neutralised five bandits in another encounter at Bingi village, in the Bungudu Local Government Area of Zamfara State."
  },
  {
    "headline": "Bridging Unemployment Gap: Entrepenuer, Dakpokpo, launches Platterz in Abuja; challenges Private Investors on jobs creation",
    "summarized_story": "Dakpokpo made the call during the opening of his multi-purpose business centre called the “Platterz” on Saturday in New Karu Local Government Area of Nasarawa State.\nHe said the need to create jobs and contribute to the economic development of Nigeria was a major factor that led to establishment of the centre.\nHe remarked that the business complex known as the “Pricipal Arena”, comprise of restaurant, lounge, laundry, barbers and beauty saloons.\nHe added that the hike in price of food items would pose further challenges to SMEs in the country.\nHe said it was a blessing for young people to invest in the society and help young people to grow."
  },
  {
    "headline": "Nasarawa govt to partner ANA on literary works",
    "summarized_story": "The Nasarawa State Ministry of Education, Science and Technology is set to collaborate with the state chapter of the Association of Nigerian Authors (ANA), to make literary works available to all schools.\nThe Commissioner, Hajia Fatu Sabo, said this in a message to the Biennial Convention of ANA, Nasarawa State Chapter in Lafia on Saturday.\nSabo who was represented by Mr Abubakar Kana, Deputy Director, Schools, in the ministry, said that the ministry had been a direct consumer of literary works over the years.\n“The ministry is quite prepared to liaise with this body to make available your literary works to our various schools for our students’ consumption,” he said.\nThe commissioner commended the state chapter of the association for their contribution toward intellectual development in the state."
  },
  {
    "headline": "African Church to set up faith based varsity to teach younger generations morals, values",
    "summarized_story": "— Our varsity will charge less fees compared to other faith based institutionsDayo Johnson AkureThe African Church is set to establish a faith based University to teach the younger generations in the country morals and values.\nArchbishop of Oka-Akoko province, African Church, Most Reverend Joseph Olalekan Akinsanya said this in Akure, the Ondo state capital.\n“The African Church is not known for profit making but it has over the years produced God-fearing students and youths.\nOur great Church, The African Church, has made her impact known virtually in all sectors of life.\n“I want to put it on record that The African Church has made mark in the Political, Educational and Health sectors of this nation-Nigeria."
  },
  {
    "headline": "Gunmen abduct another Ekiti traditional ruler, spare wife",
    "summarized_story": "Armed men believed to be kidnappers have abducted another traditional ruler in Ekiti, Oba Benjamin Oso, the Eleda of Eda Ile, in Ekiti East Local Government Area.\nA source told newsmen on Saturday in Ado Ekiti, that the traditional ruler was returning from farm with his wife on Friday when he was abducted but his wife was spared.\nThe incident made him to become the third traditional ruler to be attacked in similar circumstances in less than three monthsBrig.-Gen. Joe Komolafe, the Commander of the Ekiti State Security Network code-named Amotekun, on Saturday confirmed the kidnapping of the traditional ruler in the state.\nLocal sources told newsmen in Ado Ekiti that the Oba and the wife would have been kidnapped, but for the appeal made to them by the traditional ruler.\n“The Oba and the wife went to farm and were accosted by the gunmen."
  },
  {
    "headline": "68 million Contract Debt: Court shifts Ruling On Motion by UCTH to Strike Out Case",
    "summarized_story": "University of Calabar Teaching Hospital, UCTHBy Ike UchechukwuA High Court siting in Calabar has rescheduled ruling on a motion to strike out the case between a contract ,Obi Achara , Chief Executive officer ,Obi Achara Nigeria Ltd and the University of Calabar Teaching Hospital management Board.\nHC/316/2020 between Obi Achara Nigeria Ltd and the University of Calabar Teaching Hospital UCTH, Management Board.\nThe Presiding Judge ,Angela Obi adjourned the matter till the 12th of July 2021 so as to consider the motion to strike out the case made my UCTH Management Board .\nHis words : “They filed a motion to strike out the matter and so the matter was adjourned for ruling but today they have written to the court to adjourn the matter.\n“We have filled our response though it could not be heard today because they claim they have a matter outside jurisdiction”, he said."
  },
  {
    "headline": "TB Joshua was special gift to humanity",
    "summarized_story": "A religious organization in New York City, White House Prayer For Our Nation, Inc. has described the late Prophet TB Joshua, founder of Synagogue Church if All Nations, SCOAN as a special gift from God to humanity.\nThe statement reads, “Prophet TB Joshua was a special gift from God to humanity.\n“It was always our desire to have Prophet T.B.\nJoshua to minister at our gathering here in Washington DC but God had other plans for him in this time and season.\nTB Joshua served God, humanity with passion – Goodluck Jonathan mourns"
  },
  {
    "headline": "Fani-Kayode faults UNDP report, claims Boko Haram, herdsmen killed millions",
    "summarized_story": "UNDP had further warned that the conflict could amount to the loss of 1.1 million Nigerian lives by 2030.\nThe report warned that indirect deaths, including disease and hunger resulting from the conflict’s physical and economic destruction, already far outnumber those from direct causes.\nBut Fani-Kayode says much more people than were indicated have been killed by the decade long insurgency.\nNorth-East: 1.1 million Nigerians may die if investment deficit continues – UNDP“The UNDP claims that Boko Haram has killed 350,000 Nigerians since it began its operations in 2010,” he tweeted.\nFani-Kayode also wants the Islamic scholar to tell Nigerians the centre of the discussion whenever he meets the bandits in the forests."
  },
  {
    "headline": "Usifo Ataga: ‘Chidimma was a victim of bad parenting, stop demonizing her’- Omokri",
    "summarized_story": "Former Presidential aide, Reno Omokri has said Chidinma Ojukwu, the 21-year-old student of the University of Lagos who murdered the Chief Executive Officer of Super TV, Usifo Ataga, was a victim of bad parenting and bad society.\nOmokri in reaction to the death of the Super Tv CEO said people should stop demonizing the 21-year-old as it takes two to tango.\nUsifo Ataga’s murder: Tracking Unit in Panti exposed suspected killer, Chidinma – Police“How many of you condemning Chidimma were mature at 21?\n“Chidimma is also a victim of bad parenting and bad society.In Nigeria, poor parents suddenly see their young daughters with Range Rover, and rush to church for thanksgiving not minding what they do for a living.\nUsifo Ataga: ‘All Sugar daddies return to base, one man down’ – Nigerians react"
  },
  {
    "headline": "Beyonce’s mum, Tina criticises Derek Chauvin’s 22.5 years conviction",
    "summarized_story": "Tina Lawson mother to American singer, Beyonce Knowles has called for an overhaul of the American judicial system, following the sentencing of former Minneapolis police officer, Derek Chauvin.\nRecall that Floyd, an unarmed 46-year-old man, died on May 25, 2020, in the hands of the White police officer in Minneapolis, Derek Chauvin.\nBut Tina in a post on social media criticized Derek’s jail term while revealing that a loved one is serving a similar jail term for a much lesser offence.\n“I understand Chauvin’s Mom Not Wanting Her Son 2 Be Gone, But George Floyd’s mom will never see her son again.\nDerek Chauvin sentenced to 22.5 years in prison over George Floyd’s death"
  },
  {
    "headline": "I'll never allow you conquer Biafra land",
    "summarized_story": "Nnamdi Kanu of the Indigenous People of Biafra, IPOB, has vowed never to allow the Fulani to conquer Biafra land.\nThe IPOB leader reiterated that it was for this purpose the Eastern Security Network, ESN was created.\nBut Nnamdi Kanu and his group have constantly denied having hands in the atrocities, insisting that their target is the killer herdsmen terrorising the states across the country.\n“IPOB remains the only constant obstacle on the path of the Fulani conquest of the rest of Nigeria,” Kanu tweeted.\nThis Is why ESN was created to put an end to the unchecked atrocities against innocent Biafrans.”Herdsmen attacks: Buhari part of Fulani agenda to conquer Nigeria – Tiv youths allege"
  },
  {
    "headline": "Euro 2020: Denmark thrash Wales 4 - 0",
    "summarized_story": "Agency ReporterThe long and winding road of Euro 2020 took Wales further afield than most and, even as it came to a brutal halt in Amsterdam, this was an ending not without a sense of hope.\nEven by the standards of this transcontinental tournament, Wales’ was an arduous route to the second round, as they travelled thousands of miles to Baku and Rome for group games before facing Denmark in the Dutch capital.\nAs Wales contemplated their 4-0 beating, was this more than just their European Championship over; the end of an era?\nADVERTISEMENTTheir squad was the third youngest at Euro 2020.\n“They’re a young group and there’s World Cup qualifiers around the corner in September, and we’ll go again."
  },
  {
    "headline": "Euro 2020: Italy beat Austria 2 - 1",
    "summarized_story": "Agency ReporterItaly needed extra time to see off battling Austria at Wembley and set up a Euro 2020 quarter-final against Belgium or Portugal.\nAustria marked their first appearance in the knockout stage of the European Championship with a tireless performance to give their much-fancied opponents a scare.\nRead Also; Ronaldo leads race for Euro 2020 Golden BootMarko Arnautovic had a headed goal disallowed after a VAR check for offside in normal time when the game was goalless before goals from substitutes Federico Chiesa and Matteo Pessina sent Italy through.\nADVERTISEMENTChiesa showed terrific technique to bring the ball down and beat Daniel Bachmann from an angle while Pessina, who scored in the group game against Wales, doubled the score from close range.\nAustria pulled a goal back through Sasa Kalajdzic’s brave header, the first goal Italy have conceded in 12 games, but the Azzurri’s 31st match without defeat – a new national record – sees them march on."
  },
  {
    "headline": "Gareth Bale confident of big performance",
    "summarized_story": "Agency ReporterWales captain Gareth Bale is unfazed by his team’s underdog status ahead of their Euro 2020 last-16 clash against Denmark today.\nWales finished runners-up to Italy in Group A with a mixed return from their three group stage fixtures (W1, D1, L1) to reach the European Championships knockout phase for the second tournament running.\nDanish Dynamite lost their headline performer Christian Eriksen for the rest of the competition after the Inter Milan playmaker collapsed on the pitch during their Matchday 1 showdown against Finland.\nIt does not make a difference to us.”Bale also stated the Wales camp had offered their support to Eriksen and praised the way Denmark coped with the unfortunate situation.\n“Obviously, we understand the situation that happened with them, and we have sent all our best wishes to Christian,” he continued."
  },
  {
    "headline": "Police arrest two suspected armed robbers in Jigawa",
    "summarized_story": "Agency ReporterThe Police in Jigawa have arrested two suspected armed robbers in Maigatari Local Government Area of the state.\nThe Police Public Relations Officer, Jigawa Police Command, ASP Lawan Shiisu, confirmed the arrest to newsmen in Dutse on Saturday.\nShiisu said the suspects were arrested after they allegedly attacked and beat one Sale Aliyu with sticks and snatched his motorcycle on June 23.\nADVERTISEMENTShiisu explained that upon receipt of the complaint, a patrol team rushed to the scene and apprehended the suspects.\nAccording to him, investigation into the case was ongoing, after which the suspects would be charged to court."
  },
  {
    "headline": "BREAKING: Ozigbo clinches PDP ticket for Nov 6 election",
    "summarized_story": "Valentine Ozigbo, the immediate past President and Group CEO of Transcorp Plc, on Saturday, June 26, 2021, emerged as the Peoples Democratic Party (PDP) candidate for the Anambra governorship election after winning the party’s primary held at the Prof Dora Akunyili Women Development Center, Awka.\nAnnouncing the results, the head of the electoral panel, His Excellency Philip Shaibu, the Deputy Governor of Edo State, revealed that Ozigbo polled a total of 62 to win the primary.\nHe led his nearest contender, Dr Obiora Okonkwo, who scored 58 votes and Senator Uche Ekwunife who polled 44 votes.\nThe Anambra governorship election is billed to hold on Saturday, November 6, 2021.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Anambra 2021: I’ve not highjacked APC primary – Andy Uba",
    "summarized_story": "From Magnus Eze, EnuguA leading contender for the All Progressives Congress (APC) governorship ticket, Andy Uba, has distanced himself from alleged attempts to hijack the party’s ongoing primary election.\nA statement in Awka, Saturday afternoon by Uba’s campaign organisation said the allegation was the last resort of people it called paper tigers.\nThe statement read: ‘We are presently in touch with a number of false allegations where it has been stated that our principal, Senator Andy Uba has highjacked the process meant to democratically select a candidate for the forthcoming polls in November.\n‘We wish to state categorically that nothing can be further from the truth as our principal, Senator Andy Uba, remains committed to the tenets of democracy and fairness and will thus not indulge in anything that will truncate the process or question its integrity.\n‘We urge the media and Ndi Anambra to disconnect themselves from such feeds of lies and carry out their investigations before reporting."
  },
  {
    "headline": "Osinbajo, Marwa attend premiere of anti-drug Nollywood film ‘The Silent Baron’",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaAs part of activities to commemorate the United Nations International Day Against Drug Abuse and Illicit Drug Trafficking on June 26, with the theme “Share Facts on Drugs.\nSave Lives”, Vice President Yemi Osinbajo attended the premiere of “The Silent Baron”, a film produced by Mr Ifeanyi Ukaeru in partnership with the National Drug Law Enforcement Agency (NDLEA) to highlight the dangers of drug abuse and trafficking in Nigeria.\nThe vice president was accompanied by NDLEA Executive Chairman Brig Gen. Buba Marwa (retd), the Director-General of the National Council for Arts and Culture (NCAC), Otunba Olusegun Runsewe, and other top government functionaries.\nAccording to a statement issued on Saturday by his spokesman, Laolu Akande, Mr Osinbajo’s presence at the film premiere Friday evening was aimed at lending his support to the global campaign against drug abuse and illicit drug trafficking.\nAfter watching the movie, Vice President Osinbajo met some of the actors who were also present at the premiere, interacted briefly and took group photographs with the performers, movie producers and the production crew."
  },
  {
    "headline": "Dreaded Niger Delta Avengers return, threaten total shutdown of economy",
    "summarized_story": "Ben Dunno, WarriIndications that the Niger Delta region may soon erupt in violence emerged yesterday, following the return of dreaded Niger Delta Avengers (NDA), who threatened to resume hostilities across the region with devastating attacks on some critical oil and gas assets, as well as notable politicians sabotaging the development of the area.\n“This operation shall be coded; ‘OPERATION HUMBLE’, aimed at bringing down TARGETED OIL INSTALLATIONS IN THE NIGER DELTA REGION capable of humbling the economy into permanent recession.\nThis mission is also TARGETED AT POLITICAL ACTORS WHO ARE COLLABORATING WITH THE NIGERIAN GOVERNMENT TO UNDERMINE THE INTEREST OF THE NIGER DELTA PEOPLE.\n“Members of our strike teams across the Niger Delta are commanded to be on red alert awaiting precise strike plans as mapped by the high command of the NDA”, it stated.\nThere will be no going back until the Nigerian economy is humbled into recession never to rise again!”, the statement concluded."
  },
  {
    "headline": "Face to face with alleged murderer of super tv CEO",
    "summarized_story": "Her fellow students who spoke to our paper expressed shock over her involvement with the cold-blooded murder of the TV entrepreneur.\nAs she explained, this was because there was no money for her to go back to school to continue her education pursuit.\nFor her secondary school education, she attended Alagomeji Secondary School, Yaba, Lagos, but initially stopped at Junior Secondary School 2 owing to paucity of fund.\nShe later went back and continued from Senior Secondary School 1 but also stopped again due to lack of finance.\nShe later managed to complete her secondary school education."
  },
  {
    "headline": "PDP Faction Elects Uba as Guber Candidate",
    "summarized_story": "By David-Chyddy ElekeA faction of the Peoples Democratic Party (PDP) in Anambra State has elected Senator Ugochukwu Uba as the standard bearer of the party in the November 6 poll.\nThe returning officer in the election, Chief Obidi Ebede, said Uba got 275 votes to defeat his closest rival, Godwin Ezeemo, with 114, while Senator Uche Ekwunife scored 56 votes to come third.\nHe said there were 665 accredited delegates.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "President Approves Extra 6 Months for APC’s Caretaker Committee",
    "summarized_story": "The President gave the approval yesterday morning after a closed-door meeting with members of the Committee at the State House, Abuja.\n“The President also approved the timetable for APC Ward, Local Government and State Congresses.\nThe President said the APC had been revived, energised and repositioned for its forthcoming national convention and future elections.\nHe told the President and other party members that 14 party members had indicated their interest to contest for the Anambra State elections, assuring that the primary elections will be free, fair and transparent.\n“The party members have agreed to name the secretariat, Muhammadu Buhari House,” he added."
  },
  {
    "headline": "Green Energy: Osinbajo Frets over Looming Fall in Funding for Gas",
    "summarized_story": "•Says Nigeria will continue frontline advocacy for a just transition to zero emissionsVice President Yemi Osinbajo is worried about the global clamour for green energy and the looming reduction in funding for gas and fossil fuel projects, especially in developing countries, by international bodies and institutions.\nAt the virtual meeting, Osinbajo maintained his position that the funding for gas and fossil fuel projects in Nigeria and other developing countries be sustained during the global transition to net-zero emissions and said Nigeria would continue its frontline advocacy for a just transition to zero-emission.\nHe also asserted that Nigeria would play a critical role with other gas exporting countries to stop the defunding of gas and fossil fuel projects in developing countries.\nThe Vice President noted that it was vital that the Forum of Gas Exporting Countries (GEC) join forces to prevent the defunding of gas and fossil fuel projects, especially from developing countries, by international bodies and institutions.\nBoth the Minister of State for Petroleum Resources and Minister of Foreign Affairs were directed to work together, to ensure the GEC Forum reaches a consensus that reflects Nigeria’s advocacy on defunding of gas projects."
  },
  {
    "headline": "DSS Grills, Cautions Ahmad Gumi over Comments on Bandits, Security Agents",
    "summarized_story": "The service invited Sheikh Gumi.\nHow can these big weapons cross our borders and get into the forest without the cooperation of some bad element of the security operatives assisting them?\nYou can’t because the security is alert.”The Nigerian Army kicked against the cleric’s claims and warned that it would not condone acts sabotaging its efforts.\nHe also insisted that he never made any disparaging remarks against the military during his recent live interview on national television.\nAccording to him, there was nowhere in the TV interview that he categorically accused the entire military."
  },
  {
    "headline": "Nwaoboshi Defects to APC, Meets Buhari",
    "summarized_story": "Deji Elumoye in AbujaThe senator representing Delta North, Peter Nwaoboshi, has defected to the All Progressives Congress, days after his suspension from the state’s Peoples Democratic Party.\nPresident Muhammadu Buhari yesterday welcomed Nwaoboshi to the APC.\nThe Senior Special Assistant to the President on Media and Publicity, Garba Shehu, announced the defection in a statement titled ‘President Buhari congratulates Senator Peter Nwaoboshi for decamping to APC’.\nNwaoboshi, representing Delta North District, Delta State, was presented to President Buhari and National Caretaker/Extraordinary Convention Planning Committee at the State House by Deputy Senate President, Ovie Omo-Agege.\n“The Deputy Senate President said Senator Nwaoboshi’s decision to join the APC clearly shows that the effort of the CECPC was yielding fruit."
  },
  {
    "headline": "EXCLUSIVE: Senate President, Lawan Gifts Newly Wedded Wife N100m As National Assembly Building Deteriorates",
    "summarized_story": "SaharaReporters had reported how Lawan secretly married Zainab at a very private ceremony in Borno State on Friday.\nSee Also Exclusive EXCLUSIVE: Nigeria's Senate President, Ahmed Lawan Marries Young Shuwa-Arab Girl In Secret WeddingA mini party was also held at the bride's family residence in Gwange 1 Ward, Malut Shuwa Street, Maiduguri.\nA source close to Zainab told SaharaReporters on Saturday that the Senate President gifted her N100 million a few days after they were introduced to each other.\nEXCLUSIVE: Nigeria's Senate President, @DrAhmadLawan Marries Young Shuwa-Arab Girl In Secret Wedding | Sahara Reporters https://t.co/awX606hJ4Q pic.twitter.com/RE1BohBpMu — Sahara Reporters (@SaharaReporters) June 26, 2021\"Lawan personally gave her N100 million days after he saw her pictures.\nSaharaReporters had reported how leaks from the roof of the National Assembly building disrupted the plenary session on Tuesday."
  },
  {
    "headline": "EXCLUSIVE: Senate President, Lawan Gifts Newly Wedded Wife N100m As National Assembly Building Deteriorates",
    "summarized_story": "SaharaReporters had reported how Lawan secretly married Zainab at a very private ceremony in Borno State on Friday.\nSee Also Exclusive EXCLUSIVE: Nigeria's Senate President, Ahmed Lawan Marries Young Shuwa-Arab Girl In Secret WeddingA mini party was also held at the bride's family residence in Gwange 1 Ward, Malut Shuwa Street, Maiduguri.\nA source close to Zainab told SaharaReporters on Saturday that the Senate President gifted her N100 million a few days after they were introduced to each other.\nEXCLUSIVE: Nigeria's Senate President, @DrAhmadLawan Marries Young Shuwa-Arab Girl In Secret Wedding | Sahara Reporters https://t.co/awX606hJ4Q pic.twitter.com/RE1BohBpMu — Sahara Reporters (@SaharaReporters) June 26, 2021\"Lawan personally gave her N100 million days after he saw her pictures.\nSaharaReporters had reported how leaks from the roof of the National Assembly building disrupted the plenary session on Tuesday."
  },
  {
    "headline": "BREAKING: DSS Invites Sheikh Gumi After Alleging Military-Bandits’ Collusion In Attacks On Citizens",
    "summarized_story": "The State Security Service, also known as the Department of State Services (DSS) has invited controversial Islamic cleric, Sheikh Ahmad Gumi, for questioning.\nThe VOA Hausa reported the DSS invitation, days after a controversy between Gumi and the Nigerian Army.\nThe Nigerian Army had replied to Gumi, same day saying his statement is both sad and unfortunate.\nOn Wednesday, he had described bandits and killer herdsmen’s atrocities as “a tribal war,” accusing the government of taking sides.\n“What you call banditry when you cross to the other side, you find out Nigeria is fighting a tribal war,” he explained."
  },
  {
    "headline": "BREAKING: DSS Invites Sheikh Gumi After Alleging Military-Bandits’ Collusion In Attacks On Citizens",
    "summarized_story": "The State Security Service, also known as the Department of State Services (DSS) has invited controversial Islamic cleric, Sheikh Ahmad Gumi, for questioning.\nThe VOA Hausa reported the DSS invitation, days after a controversy between Gumi and the Nigerian Army.\nThe Nigerian Army had replied to Gumi, same day saying his statement is both sad and unfortunate.\nOn Wednesday, he had described bandits and killer herdsmen’s atrocities as “a tribal war,” accusing the government of taking sides.\n“What you call banditry when you cross to the other side, you find out Nigeria is fighting a tribal war,” he explained."
  },
  {
    "headline": "BREAKING: DSS Invites Sheikh Gumi After Alleging Military-Bandits’ Collusion In Attacks On Citizens",
    "summarized_story": "The State Security Service, also known as the Department of State Services (DSS) has invited controversial Islamic cleric, Sheikh Ahmad Gumi, for questioning.\nThe VOA Hausa reported the DSS invitation, days after a controversy between Gumi and the Nigerian Army.\nThe Nigerian Army had replied to Gumi, same day saying his statement is both sad and unfortunate.\nOn Wednesday, he had described bandits and killer herdsmen’s atrocities as “a tribal war,” accusing the government of taking sides.\n“What you call banditry when you cross to the other side, you find out Nigeria is fighting a tribal war,” he explained."
  },
  {
    "headline": "Ozigbo emerges winner of NWC-backed Anambra PDP guber primary",
    "summarized_story": "Valentine Chineto Ozigbo has won the Peoples Democratic Party (PDP) governorship primary election in Anambra state.\nEarlier, the Chris Uba-led faction had organised its primary election at the University of St. Paul, Awka, capital of the state.\nUgochukwu Uba, a former senator, was elected governorship candidate of the primary conducted by the Anambra PDP faction.\nAnambra PDP has been enmeshed in internal wrangling of late, leading to the emergence of two factions of the party.\nAdvertisementThe court also directed the party to use the November 2017 delegates in conducting its governorship primary election."
  },
  {
    "headline": "Ozigbo emerges winner of NWC-backed Anambra PDP guber primary",
    "summarized_story": "Valentine Chineto Ozigbo has won the Peoples Democratic Party (PDP) governorship primary election in Anambra state.\nEarlier, the Chris Uba-led faction had organised its primary election at the University of St. Paul, Awka, capital of the state.\nUgochukwu Uba, a former senator, was elected governorship candidate of the primary conducted by the Anambra PDP faction.\nAnambra PDP has been enmeshed in internal wrangling of late, leading to the emergence of two factions of the party.\nAdvertisementThe court also directed the party to use the November 2017 delegates in conducting its governorship primary election."
  },
  {
    "headline": "Uba, former senator, elected guber candidate of Anambra PDP faction",
    "summarized_story": "Ugochukwu Uba, a former senator representing Anambra south senatorial zone, has won the primary election organised by a faction of the Peoples Democratic Party (PDP) in Anambra.\nHis closest challengers; Godwin Ezeemo polled 114 votes to come second, while Uche Ekwunife, a senator, scored 56 votes to come third.\nThe other PDP faction in the state is holding its primary election at the Dora Akunyili Development Centre, also in Awka.\nAnambra PDP has been enmeshed in internal wrangling of late, leading to the emergence of two factions of the party.\nThe court also directed the party to use the November 2017 delegates in conducting its governorship primary election."
  },
  {
    "headline": "Uba, former senator, elected guber candidate of Anambra PDP faction",
    "summarized_story": "Ugochukwu Uba, a former senator representing Anambra south senatorial zone, has won the primary election organised by a faction of the Peoples Democratic Party (PDP) in Anambra.\nHis closest challengers; Godwin Ezeemo polled 114 votes to come second, while Uche Ekwunife, a senator, scored 56 votes to come third.\nThe other PDP faction in the state is holding its primary election at the Dora Akunyili Development Centre, also in Awka.\nAnambra PDP has been enmeshed in internal wrangling of late, leading to the emergence of two factions of the party.\nThe court also directed the party to use the November 2017 delegates in conducting its governorship primary election."
  },
  {
    "headline": "Boko Haram fighters reunite with ISWAP, swear allegiance to new leader",
    "summarized_story": "Some Boko Haram fighters have reunited with the Islamic State in West Africa Province (ISWAP), the breakaway faction of the insurgent group.\nAdvertisementThe development comes a month after Abubakar Shekau, Boko Haram leader, was killed by ISWAP.\nThe Boko Haram leader was said to have killed himself with a bomb “when he observed that the ISWAP fighters wanted to capture him alive”.\nAdvertisementIn a new video released on Saturday, Boko Haram fighters were seen in alliance with those of ISWAP.\nAdvertisementISWAP broke away from the Shekau-led Boko Haram five years ago over a leadership crisis."
  },
  {
    "headline": "Nigerian businesses face an avalanche of losses as the Twitter ban continues",
    "summarized_story": "The ban happened a day after the Nigerian government announced an indefinite Twitter suspension.\nFeranmi Ajetomobi, the founder of Nifries, explained that the Twitter ban has affected anon (short for anonymous) sales which drive about 20% of sales at Nifries.\nFor Habib who runs Smiley Socks, a clothing company that also thrives on the ‘anon sales’ phenomenon, sales via Twitter have been affected.\nCompared to other advertising channels, Twitter is a cheaper and less stressful channel.\nLet’s put it across all the businesses in that range and you see that the number is massive.”With the Twitter ban, Nigerian businesses that have previously relied on the massive reach of the platform now face an avalanche of losses if the decision is not reversed soon."
  },
  {
    "headline": "Google earmarks $6 million to support African tech startups and women-led businesses",
    "summarized_story": "Google, this week, announced the launch of two new initiatives to support African-founded startups and women-led businesses in underserved communities on the continent.\nThe programs include a $3 million Black Founders Fund for African startups and a $3 million Google.org grant to help women in low-income communities develop entrepreneurial skills and access funding.\nThrough the latter, Google is looking to support access to economic opportunity for women in sub-Saharan Africa with a $3 million grant to the Tony Elumelu Foundation (TEF).\nBlack Founders Fund debuts in AfricaThe Google for Startups Black Founders Fund provides grants and technical assistance to early-stage startups led by black and diverse teams, with a goal of advancing the black community.\nAccording to Bosun Tijani, CEO of Co-Creation Hub (CcHub), which is partnering with Google on the Black Founders Fund Africa, the shortage of funding for African startups is driven by several factors."
  },
  {
    "headline": "Jesse Forrester started an e-mobility company in Kenya after deciding against going to university",
    "summarized_story": "After ALA, Jesse took up a fellowship.\nToday, his company Mazi Mobility is backed by global venture builder, Satgana, and is aiming at implementing an electric vehicle ecosystem in Africa.\nHe started his company without a university degree and he is now preparing himself to dominate the African e-mobility space.\nThe journey to Mazi by way of ALA‘Mazi’ was not always ‘Mazi Mobility’.\nAt ALA, Jesse was a part of the team behind “The Living Machine” a water treatment system that won them the $100,000 Zayed Sustainability Prize in 2019."
  },
  {
    "headline": "SEC approves Chaka as first licensed stock trading app in Nigeria",
    "summarized_story": "Chaka becomes the first to acquire the digital sub-broker license introduced by SEC in April of this year.\nAs part of a major amendment to its Consolidated Rules and Regulations, SEC recognised sub-brokers who use digital platforms to serve multiple brokers.\nOn the 19th of December 2020, the SEC published a statement that effectively barred Chaka from offering its services in Nigeria.\nThat December warning enabled Chaka to take the lead and open talks with the SEC.\nHe said the license also means Chaka could now enable other stockbroking firms who want to have a digital presence."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How technology is helping this AC technician scale his business",
    "summarized_story": "AdvertisementIt’s why when we were asked to pitch possible stories for an article, the event “World Refrigeration Day” caught my attention.\nWorld Refrigeration DaySince 2019, World Refrigeration Day is celebrated every June 26.\nIt is an international awareness campaign established by the World Refrigeration Day Secretariat to raise the profile of the refrigeration, air-conditioning, and heat-pump sector.\nAfter watching several hours of AC installation and work tools videos on YouTube myself, I am inclined to agree.\nA vacuum pump is an essential tool used to repair cooling units to clean the compressor by removing unwanted air and water vapour."
  },
  {
    "headline": "Malawi’s 3D-printed school, learning disabilities and technology, Chrome’s third-party cookies",
    "summarized_story": "Good day,Today, I’m discussing:The world’s first 3D-printed school opening in MalawiLearning disabilities and assistive technologyGoogle’s delay in blocking third-party cookies in ChromeWorld’s first 3D-printed school opens in MalawiPhoto credit: NairametricsWhat happened?\nLearning disabilities (LDs) and assistive technology (AT)Photo by Wulan Sari on UnsplashJust two questions before you proceed: What are learning disabilities?\nAlthough there is no cure for LDs, technology has made learning easier for people with learning disabilities.\nGoogle delays plan to block third-party cookies in ChromePhoto by Brett Jordan on UnsplashAnother announcement?\nGoogle has said that it will delay its plans to block third-party cookies in the Chrome browser until 2023, a year later than planned."
  },
  {
    "headline": "Trying clothes online, virtual store attendants, Facebook plans to over overhaul eCommerce",
    "summarized_story": "Statista showed a rise in eCommerce sales in 2020, with global online sales increasing from $3.35 trillion in 2019 to $4.89 trillion in 2020.\nTo take advantage of this unprecedented rise, the company rolled out Facebook Shops on May 19, 2020.\nAlso, Facebook Shops is coming to WhatsApp soon.\nMeanwhile, the new feature will not be available for Whatsapp users globally.\nIn December 2020, WhatsApp gave an ultimatum for users to accept updated privacy policy."
  },
  {
    "headline": "Is Buhari trapped in the past?",
    "summarized_story": "Is Buhari trapped in the past?\nIn hindsight, President Buhari’s handlers will rue the Arise TV interview.\nIt presented to viewers a man who looked trapped in a time warp.\nIt removed the mystique around a taciturn ruler, revealing an insular president, stuck in the past, with self-preservation as his sole preoccupation.\nBuhari spoke at last, but only to…"
  },
  {
    "headline": "Telcos face negative half-year as subscriber numbers hit 16-month low",
    "summarized_story": "The telecommunication sector would require a major growth result in June to stop it from ending the second quarter in decline and the first half of 2021 in the negative zone.\nA decline in the first half of the year results is likely to affect the outcome of the half-year GDP growth of the industry….\nDon’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "The Gumi factor and the politics of insecurity in Nigeria",
    "summarized_story": "The Gumi factor and the politics of insecurity in NigeriaBy the provisions of the Constitution of the Federal Republic of Nigeria, the President of the country is said to be among the most powerful presidents in the world.\nBut it appears that there are some individuals in Nigeria today, commonly referred to as non-state actors, that are more powerful than the president.\nThese actors…"
  },
  {
    "headline": "Contract on renovation of NASS complex undergoing procurement process – FCDA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Federal Capital Development Authority (FCDA) says proposed contract for rehabilitation of National Assembly Complex is currently undergoing procurement process in line with the Procurement Act of 2007.\nThe Head, Public Relations and Information, FCDA, Mr Richard Nduul, made the disclosure in a statement on Friday in Abuja.\nAccording to him, this has been the tradition with every other assignment which the FCDA has undertaken.\n“The attention of the FCDA has been drawn to recent flooding of the lobby of the national assembly complex, Abuja resulting from leakages from the roof.\n” Full waterproofing of the roof of the White House building is a major aspect of the proposed renovation of the complex,” he said."
  },
  {
    "headline": "Ologbo modular refinery ready for production- Gov. Obaseki – Nigerian Observer",
    "summarized_story": "Godwin Obaseki of Edo, says the modular refinery in Ologbo, Ikpoba – Okha Local Government Area (LGA) of the state was ready for production.\nObaseki stated this shortly after he was conducted round the facility by the Managing Director of the refinery, Mr Tim Tian.\n“The plant is ready to receive crude oil; it is ready to process and it is ready to deliver products.\n“The governor has this project dear to his heart, not only this project, the power plant is also situated in Ologbo.\nMr Tim Tian, the Managing Director of the Ologbo modular refinery, commended the governor for his efforts towards actualising the project."
  },
  {
    "headline": "Obaseki unveils plans for Benin City Cultural District, EMOWAA pavilion …chronicles journey for return of Benin artifacts – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has unveiled plans for the Benin City Cultural District, which will house the Edo Museum of West African Arts (EMOWAA).\nObaseki disclosed this at the 2021 National Commission for Museums and Monuments (NCMM) Retreat for management staff and curators held in Benin City, the Edo State capital.\n“In this plan, we have included the carving out of a large area as a Cultural District and the Museum will be located in the Cultural District.\nIf we host 5,000 visitors every year as a result of the attraction to the Museum, the state will benefit from it.\n“The Edo Museum of West African Arts (EMOWAA) is a big opportunity for us to be at the forefront of promoting and establishing this museum."
  },
  {
    "headline": "Edo govt, NDLEA link rising crime rate to drug use, lead walk against drug abuse – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government and the National Drug Law Enforcement Agency (NDLEA), as part of activities to mark the 2021 International Day Against Drug Abuse and Illicit Trafficking, led other stakeholders in a sensitization road walk against drug abuse and trafficking across the Benin metropolis.\nThe International Day Against Drug Abuse and Illicit Trafficking is observed globally every June 26 to strengthen action and cooperation to achieve the goal of an international society free of drug abuse.\nTo raise awareness on the dangers of the menace, the Edo State Drug Control Committee (ESDCC) and NDLEA staged a walk from Edo State Secretariat to Sakponba Road, Ring Road, and Sapele Road, warning residents against the intake of drugs.\nAccording to him, “We took this walk against drug abuse today to create the necessary information in society.\nDrug abuse is an ill that must be eradicated completely."
  },
  {
    "headline": "Anambra 2021: Valentine Ozigbo wins PDP primary; to challenge Soludo, others",
    "summarized_story": "ADVERTISEMENTA banker, Valentine Ozigbo, has emerged as the governorship candidate of the Peoples Democratic Party (PDP) in Anambra State.\nThe 50-year-old Mr Ozigbo polled 62 out of 218 votes to beat 13 other aspirants who were on the ballot.\nBesides, a faction of the party had held a parallel primary elsewhere in Awka which produced Ugochukwu Uba as its own candidate.\nThe candidates defeated by Mr Ozigbo included Uche Ukwunife, a serving senator, who scored 44 votes and came third in the primary which was conducted late into Saturday night.\nMr Ozigbo was the president and chief executive officer of Transnational Corporation of Nigeria Plc (Transcorp) from 2019 to 2020."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "BREAKING: Ex-Transcorp Boss, Ozigbo, Emerges Anambra PDP Guber Candidate",
    "summarized_story": "The immediate past President and Chief Executive Officer of Transnational Corporation of Nigeria Plc, Mr. Valentine Ozigbo, has emerged candidate of the Peoples Democratic Party (PDP) in the November 6 Anambra State governorship election.\nA total of 14 out of the 16 aspirants cleared by the PDP to contest the party’s governorship ticket participated in the primary election, which produced Ozigbo as the PDP flagbearer.\nShaibu, who announced the result of the primary election, declared Ozigbo winner of the election and candidate of the party in the governorship election.\nOther aspirants who were present at the venue of the primaries included Dr. Winston Udeh, who scored 12 votes; Hon.\nADVERTISEMENTEarlier, Dr. Tony Nwoye and Chief Emeka Etiaba (SAN) had before the commencement of the primary election announced their voluntary withdrawal from the race."
  },
  {
    "headline": "BREAKING: Ex-Transcorp Boss, Ozigbo, Emerges Anambra PDP Guber Candidate",
    "summarized_story": "The immediate past President and Chief Executive Officer of Transnational Corporation of Nigeria Plc, Mr. Valentine Ozigbo, has emerged candidate of the Peoples Democratic Party (PDP) in the November 6 Anambra State governorship election.\nA total of 14 out of the 16 aspirants cleared by the PDP to contest the party’s governorship ticket participated in the primary election, which produced Ozigbo as the PDP flagbearer.\nShaibu, who announced the result of the primary election, declared Ozigbo winner of the election and candidate of the party in the governorship election.\nOther aspirants who were present at the venue of the primaries included Dr. Winston Udeh, who scored 12 votes; Hon.\nADVERTISEMENTEarlier, Dr. Tony Nwoye and Chief Emeka Etiaba (SAN) had before the commencement of the primary election announced their voluntary withdrawal from the race."
  },
  {
    "headline": "Autocrash Claims 11 Lives In Osun",
    "summarized_story": "A fatal accident along Gbongan/Ibadan highway in Ayedaade local government area of Osun State has claimed 11 lives.\nAdvertisementsBesides, no fewer than 22 persons were injured in the accident that occurred at about midnight opposite Ayedaade local government council secretariat along Gbongan-Ibadan expressway.\nA release by the Federal Road Safety Corps (FRSC) public relations officer, Mrs Agnes Ogungbemi, stated that the accident involved a white Mazda E2000 bus with registration number KJA392YA and a black Toyota Hiace bus registration number GWL427YM.\nAlso, 16 injured victims were taken to Ariremako Hospital in Gbongan town while the remaining six injured victims were taken to the Central Hospital in Osogbo.\nOgungbemi added that while the vehicles involved were taken over by the Divisional Traffic Unit of Gbongan police post, other items were in possession of FRSC."
  },
  {
    "headline": "Autocrash Claims 11 Lives In Osun",
    "summarized_story": "A fatal accident along Gbongan/Ibadan highway in Ayedaade local government area of Osun State has claimed 11 lives.\nAdvertisementsBesides, no fewer than 22 persons were injured in the accident that occurred at about midnight opposite Ayedaade local government council secretariat along Gbongan-Ibadan expressway.\nA release by the Federal Road Safety Corps (FRSC) public relations officer, Mrs Agnes Ogungbemi, stated that the accident involved a white Mazda E2000 bus with registration number KJA392YA and a black Toyota Hiace bus registration number GWL427YM.\nAlso, 16 injured victims were taken to Ariremako Hospital in Gbongan town while the remaining six injured victims were taken to the Central Hospital in Osogbo.\nOgungbemi added that while the vehicles involved were taken over by the Divisional Traffic Unit of Gbongan police post, other items were in possession of FRSC."
  },
  {
    "headline": "Gov Zulum Suspends French NGO Over Shooting Training In Borno",
    "summarized_story": "Borno State governor, Professor Babagana Umara Zulum, has directed the immediate suspension of ACTED, an international non-governmental organization (iNGO) following Saturday’s discovery that the humanitarian organisation was using an hotel in Maiduguri for shooting training.\nAdvertisementsZulum’s spokesman, Malam Isa Gusau, who announced the governor’s directive, said the French iNGO was found using toy guns and simulators in training exercises at a hotel located off Circular Road in the state capital.\nThe police found three toy pistols at the hotel while two Nigerian trainers, were arrested for further investigation.\nThe statement said pending the outcome of police investigation, Governor Zulum has directed sealing of the hotel and suspension of the iNGO, ACTED from any humanitarian activity in Borno State.\nGusau noted that Governor Zulum acknowledged and deeply appreciated the roles of credible iNGOs, which have been providing critical humanitarian interventions in different parts of the State."
  },
  {
    "headline": "Nigerian Bishop makes a comprehensive list of adulterous pastors and politicians",
    "summarized_story": "A Nigerian Bishop, identified as Don Simon Osieme has compiled a comprehensive list of all adulterous pastors and politicians across Isoko land in Delta State.\nThe cleric took to his social media to share the list immediately after his children arrive safely in Texas, USA.\nAccording to him, the list contains profile cases of adultery perpetuated by pastors and politicians with whom, when, and where.\nHe wrote; ADULTERYMANIA SAGA VS THE HIDDEN EYES”Adultery by a wife in Isoko tradition is attempted murder and in some cases very close to me, first-degree murder.\nNo current Isoko House of Assembly member is on this list."
  },
  {
    "headline": "No graduate should be employed without certificate of national service – DG NYSC",
    "summarized_story": "Ukpono Ukpong, AbujaAll Employers of labour in the public and private sector have been warned against employing graduates without demanding for Certificate of National Service.\nThe Director-General, National Youth Service Corps (NYSC), Brig Gen Shuaibu Ibrahim, gave the warning yesterday at the opening ceremony of Corps Legal Aid Workshop, yesterday in Abuja.\nSpeaking further, he advised all employers to present the NYSC certificates of their existing employers to the scheme for authentication.\n“Would like to use this medium to remind all employers in the public and private sectors that it is mandatory to demand the Certificate of National Service or Exemption Certificate duly issued by the National Youth Service Corps before offering employment to any holder of Degree or Higher National Diploma.\nHe urged Legal Officers and Corps Lawyers to redouble efforts at enlightening the general public on the provisions of the NYSC Act."
  },
  {
    "headline": "Senate places 75% import duties on importation of syringes, needles",
    "summarized_story": "Tunde Opalana, AbujaThe Senate has ordered a hike in importation duties on syringes and needles into the country and therefore recommended 75 percent port duties.\nThe two directives were meant to protect local manufacturers, give them enabling environment to contribute to the revenue base of the nation and to reduce unemployment.\n“Importation of syringes and needles is killing local manufacturers making them to lay off staff and preventing them from contributing effectively to the economy.\nThis has been an impediment to local manufacturers attaining this status and preventing their being patronized by organisations using donor funds”.\n“The local manufacturers are actually the highest supplies of syringes and needles for hospitals."
  },
  {
    "headline": "FG flags off training for Irish Potato farmers in Kano",
    "summarized_story": "By Nneka NwogwugwuThe Federal Ministry of Agriculture and Rural Development (FMARD) has commenced training for Irish potato farmers in Kano.\nFlagging off the training on Monday at Gezawa Local Government Area of the state, Hajia Karima Babangida, the Director, Federal Department of Agriculture, who spoke on the topic, ‘re-educating Irish potato farmers on farming as business rather than been a culture’, said that Nigerian farmers must begin to change the narratives about farming as a culture to farming as a business.\n‘’It’s important to know that FBS is capable of starting a potato revolution here in Bauchi State especially in Toro LGA and other communities in the state that has potentials to grow potato during dry season.\n‘’FMARD is also poised to build the capacity of farmers in other states with potentials to grow Irish potato with new innovations and techniques on GAP and FBS to ensure productivity and income generation.\nThe training which began on Monday, June 21, will end on Friday June 25, 2021."
  },
  {
    "headline": "Ondo workers warn Akeredolu: We won’t accept payment of percentage salaries again",
    "summarized_story": "Workers in Ondo state are on a collision course with the state government over percentage payment of salaries.\nThe State Executive and Administrative Councils of the Trade Union Congress of Nigeria (TUC) in the state have said that workers “will no henceforth accept percentage salaries.\nA communiqué issued by the TUC after a meeting in Akure, the state capital, they said that “due to untold hardship they are going through amidst high prices of essential commodities they would not accept percentage salaries anymore.\nThe leadership of TUC has therefore charged the state governor Rotimi Akeredolu “to immediately retool the finances of the state government to enable his administration settle salary arrears of workers from March, 2021 to date.\nThe labour Union empathised with workers on the current economic situation in the country especially the astronomical increase in the prices of food and other essential items."
  },
  {
    "headline": "Ondo workers warn Akeredolu: We won’t accept payment of percentage salaries again",
    "summarized_story": "Workers in Ondo state are on a collision course with the state government over percentage payment of salaries.\nThe State Executive and Administrative Councils of the Trade Union Congress of Nigeria (TUC) in the state have said that workers “will no henceforth accept percentage salaries.\nA communiqué issued by the TUC after a meeting in Akure, the state capital, they said that “due to untold hardship they are going through amidst high prices of essential commodities they would not accept percentage salaries anymore.\nThe leadership of TUC has therefore charged the state governor Rotimi Akeredolu “to immediately retool the finances of the state government to enable his administration settle salary arrears of workers from March, 2021 to date.\nThe labour Union empathised with workers on the current economic situation in the country especially the astronomical increase in the prices of food and other essential items."
  },
  {
    "headline": "Anambra APC primaries: Ngige calls for postponement to June 29",
    "summarized_story": "The Minister of Labour and Employment, Senator Chris Ngige, has called for the postponement of the All Progressives Congress (APC) primaries for the Anambra State governorship election scheduled for Saturday, June 26, 2021, to Tuesday, June 29, 2021.\nSenator Ngige said the postponement was to enable party members across the state to participate as well as give enough room to the Committee Members to resolve contentious issues raised by aspirants.\nQuoting Senator Ngige, the statement said, “Your Excellency, Prince Dapo Abiodun, the Chairman of the Anambra State Primary Committee, good day.\n“As I write you now, 4.25pm, Saturday, 26th June, I’m in my home town, Alor with 2 electoral wards and there is no sign of any governorship primary election.\n“As a result, most party members have left for home, having waited since 8am."
  },
  {
    "headline": "Anambra APC primaries: Ngige calls for postponement to June 29",
    "summarized_story": "The Minister of Labour and Employment, Senator Chris Ngige, has called for the postponement of the All Progressives Congress (APC) primaries for the Anambra State governorship election scheduled for Saturday, June 26, 2021, to Tuesday, June 29, 2021.\nSenator Ngige said the postponement was to enable party members across the state to participate as well as give enough room to the Committee Members to resolve contentious issues raised by aspirants.\nQuoting Senator Ngige, the statement said, “Your Excellency, Prince Dapo Abiodun, the Chairman of the Anambra State Primary Committee, good day.\n“As I write you now, 4.25pm, Saturday, 26th June, I’m in my home town, Alor with 2 electoral wards and there is no sign of any governorship primary election.\n“As a result, most party members have left for home, having waited since 8am."
  },
  {
    "headline": "Niger Delta Avengers names woman Tu-ere as new leader, Field Commander",
    "summarized_story": "By Jethro IbilekeThe Niger Delta Avengers (NDA), has named a woman, identified as Tu-ere, aka Queen of the Creeks as its new leader and Field Commander.\nThe Niger Delta militant group, in a statement on Saturday said “The high command of the NDA has promoted and appointed one of our finest operatives, Field Commander Tu-ere, aka Queen of the Creeks to the rank of Brigadier-General.\nWe advise other female operatives to emulate her and be dedicated to our mission at all times.\n“Conclusively, we wish to state unequivocally and in simple terms that we are back with Operation Humble, with the aim of humbling the economy into permanent recession and political players from the Niger Delta extraction to political retirement.\n“There will be no going back until the Nigerian economy is humbled into recession never to rise again!”, the statement concluded,” the group said."
  },
  {
    "headline": "Insurgency: Bama residents celebrate return of peace",
    "summarized_story": "By Yakubu UbaResidents of Bama in Borno State has organised a special anniversary to celebrate the return of peace and normalcy to the war-torn community.\n“The ceremony is a signal to all and sundry that peace has returned to Bama, and Bama is on the path of restoration of its lost glory.\n“This event is significant and provides an opportunity for us to celebrate our unique culture, tradition and diversity.\n“This cultural day would have been possible without understanding, support and cooperation of the Borno State Government and Mercy Corps.\nAccording to him, all parts of Borno State had been recovered except that residents some areas, such as Abadam and Gudumbali were yet to be resettled."
  },
  {
    "headline": "Boko Haram, ISWAP pick AlKhuraishi as new leader",
    "summarized_story": "By AbankulaBoko Haram and its breakaway faction, ISWAP have mended fences and jointly picked a new leader, called Aba Ibrahim Al-Hashimiyil AlKhuraishi.\nPledging his loyalty, he said every member of Boko Haram and ISWAP should be happy that they are now united.\nThe video was silent on the fate of 24 year-old, Bakura Sahaba Modu, who was announced last week by Boko Haram as successor to Abubakar Shekau.\nIt also did not mention the fate of Al Barnawi, son of Boko Haram founder, Mohammed Yusuf.\nOn 25 June, a video was also in circulation showing Boko Haram fighters pledging allegiance to ISWAP."
  },
  {
    "headline": "Tinubu Will Make A Good President, I’ll Support Him — Olubadan",
    "summarized_story": "Bola Tinubu, a chieftain of the All Progressives Congress (APC), will make an excellent president, according to Saliu Adetunji, the Olubadan of Ibadan.\nWhile receiving members of the Tinubu Vanguard in Ibadan, Oyo state capital, on Saturday, the Olubadan is alleged to have shown his support.\nOlubadan described Tinubu as a “good man” who will “consolidate” the APC’s progressive agenda and “propel Nigeria to the road of economic prosperity and sustainable development,” according to the statement.\n“Tinubu is a good man and I will do everything within my power to support his candidacy for the 2023 presidential poll,” he was quoted as saying.\nBenjamin said the group is committed to ensuring that the Tinubu presidential mandate is actualised."
  },
  {
    "headline": "ISWAP, Boko Haram Unite After Shekau’s Death, Plan jihad",
    "summarized_story": "Following a recent peace accord between the two groups, top commanders of Boko Haram and the Islamic State of West Africa Province (ISWAP) have agreed to collaborate in jihad.\nThe talks took place one month after Abubakar Shekau, a former Boko Haram member, blew himself up during a brutal clash with ISWAP.\nThey pledged allegiance to Aba Ibrahim Al-Hashimiyil Khuraishi, who was unanimously ordained as ‘Khalifan Muslimai’ (The Leader of all Muslims).\nFour commanders from Boko Haram and ISWAP announced their loyalty.\nAn ISWAP fighter, with a rifle on his neck, declared: “What is left now is Jihad."
  },
  {
    "headline": "BREAKING: PDP faction elects Sen. Uba As Guber Candidate",
    "summarized_story": "Senator Ugochukwu Uba was picked as the party’s flag bearer by a group of the Peoples Democratic Party (PDP) in Anambra State on November 6.\nThe returning officer in the election, Obidi Ebede said Uba got 275 votes to defeat his closest rival, Godwin Ezeemo with 114, while Senator Uche Ekwunife scored 56 votes to come third.\nHe said there were 665 accredited delegates."
  },
  {
    "headline": "TB Joshua’s Funeral Details Released By Synagogue Church (Photo)",
    "summarized_story": "The funeral details for the Synagogue Church of All Nations’ founder Prophet T.B.\nJoshua’s funeral, as previously stated, will take place over the course of a week, from July 5 to 11.\nMedia mogul Dele Momodu, a friend of the late clergyman, posted a picture to Instagram on Friday night showing details of the funeral as released by the church.\nThe funeral service and interment will hold the following day, July 9.\nIt also assured its members that worship will not stop at the church following shutdown since Joshua’s demise."
  },
  {
    "headline": "Breaking: Valentine Ozigbo emerges PDP candidate ahead 2021 Anambra guber poll",
    "summarized_story": "Unofficial result has just revealed that a former President of Transnational Corporation of Nigeria (Transcorp) Valentine Ozigbo has narrowly emerged victorious after the primary of Peoples Democratic Party (PDP) ahead of Anambra state governorship election on Saturday night.\nThe result yet to be made official by the party has it that Ozigbo scored 62 to closely beat Obiorah Okonkwo who got 58 votes.\nServing Senator Iyom Uche Ekwunife polled 44 votes while Winston Udeh and Dr Godwin Maduka scored 12 and five votes respectively.\nDetails loading…"
  },
  {
    "headline": "Hunger, starvation imminent over security concerns",
    "summarized_story": "BENJAMIN SAMSON in this report examines the effects of the ugly security situation on food production and availability.\n“The security situation has crippled the economy as travelling on the highways across the country has become a nightmare to Nigerians.\nFAO, ActionAid’s alarmsIn the same vein, the Food and Agriculture Organisation (FAO) has raised the alarm over the worsening state of food security in the country.\nIt, therefore, stressed the need for urgent measures to protect the most vulnerable, keep the national agricultural supply chains functional and efficient, and mitigate the food security impacts of the Covid-19 pandemic.\nFor example, wheat remains an imported production input costing Nigeria about N222 billion in the first quarter of 2021 alone."
  },
  {
    "headline": "Breaking: DSS invites Sheikh Gumi over comment on Nigerian Military",
    "summarized_story": "Kaduna-based Islamic cleric, Sheikh Ahmad Abubakar Gumi, has been reportedly invited the Department of State Security ( DSS) for questioning over remarks he made on Arise TV interview that allegedly portrayed the Nigerian military in bad light.\nThis was revealed via a report by the Voice of America, VOA, Hausa service monitored on Friday.\nThe report said Gumi was invited at the Kaduna office of the DSS, after the military authorities took exception to comments by Sheikh Gumi, alleging that their operatives were conniving with bandits.\nDetails coming…"
  },
  {
    "headline": "Okowa tasks States’ legislatures on constitutional amendment -NigPilot",
    "summarized_story": "Governor Ifeanyi Okowa of Delta has called on the States’ House of Assembly to ensure that the Constitutional Amendment Bill is passed when passed to them by the National Assembly.\nOkowa made the call on Friday when he received the Conference of Speakers of States’ Legislatures in Nigeria led by its Chairman and Speaker of Bauchi State House of Assembly, Rt.\nHe stated that as states’ legislatures, the onus was on them to pass the Constitutional amendments in the interest of the nation.\n“The fear of legislative autonomy is unfounded because our state House of Assembly has been operating in autonomy since 2019,” he said.\nSpeaker of Delta House of Assembly and Deputy Chairman of the Conference of Speakers, Rt Hon."
  },
  {
    "headline": "NAF base was not attacked by terrorists in Kaduna -NigPilot",
    "summarized_story": "The Nigerian Air Force (NAF) on Saturday denied a trending report that its Base in Kaduna was attacked by terrorists.\nAccording to the statement, “Merchants of fake news are at it again.\nThis time around, their focus is on the premier Nigerian Air Force Base at Kaduna , which they claimed came under terrorist attack in the early hours of today, 26 June 2021.\n“Members of the public should please disregard the news as it is entirely false”.\nAir Commodore Edward Gabkwet concluded thatthere was nothing of such as the inhabitants of the entire Base are going about their normal activities and duties without any threat whatsoever."
  },
  {
    "headline": "Troops kill scores of bandits in Zamfara State -NigPilot",
    "summarized_story": "The troops of the 8 Division Nigerian Army (NA) , killed scores of bandits while on a fighting patrol, along with Mayanchi-Dogo Karfe and Fagantama villages in Talata Marafa LGA of Zamfara State.\nHe said that in the fierce encounter that ensued, the bandits were overwhelmed by the superior firepower of the troops.\nIn a related development, the Army Spokesperson said that troops again killed five bandits in another encounter at Bingi village, in Bungudu LGA of Zamfara.\nThe gallant troops recovered one AK-47 rifle, one Motorcycle, and three mobile phones from the routed criminals,” he said.\nHe also tasked communities in the North West to support the troops with useful information at all times to enhance anti-banditry operations."
  },
  {
    "headline": "Kumuyi urges Nigerians to connect with God for divine intervention -NigPilot",
    "summarized_story": "…begins 6 days crusade in Abuja, othersAmidst daunting challenges the country grapples with, the General Superintendent, Deeper Life Bible Church, Pastor William Kumuyi , yesterday, urged Nigerians to connect to God for divine intervention.\nHe said: “Suffering came with sinning against God.\n“You can invite sin with one finger but at the end, ten fingers will not be enough to remove them.\nHe knows where your goodness, prosperity, satisfaction and sufficient supplies are, and He will lead you to them as you connect to Him.\n“When God calls you to repentance, you have to come to Him and do away with all those things which cause disconnection, chief of which is sin”, he said."
  },
  {
    "headline": "Drug Abuse Deadlier Than Insecurity – Buhari",
    "summarized_story": "Gloria Ume-Ezeoke, AbujaPresident Muhammadu Buhari on Saturday suggested that the effects of drug abuse in the country was worse than acts of insecurity and banditry.\nThe President made the comment at the launch of War Against Drug Abuse at the State House in Abuja.\nThe launch event was held in commemoration of the United Nations International Day against Drug Abuse and Illicit Drug Trafficking.\n﻿NDLEA Chairman, Buba Marwa, at the launch event, also lamented the pervasive abuse of cannabis among Nigerians.\nHe said Nigeria is the highest user of cannabis globally, a trend which has contributed to the insecurity in the country."
  },
  {
    "headline": "We Want To Conclude North-East Insurgency – Army Chief",
    "summarized_story": "﻿Musa Mingyi in Damaturu and Blessing Tunoh in MaiduguriThe Chief of Army Staff, Major-General Farouk Yahaya on Saturday said the army is committed to ending the insurgency in the North-East.\nThe army chief made the comment while on an operation visit to frontline troops of Sector 2, Joint Taskforce of the Nigeria Army ‘Operation Hadin Kai’ in Damaturu, Yobe State.\nMajor-General Yahaya said ending the insurgency will allow the army move on to other things.\nMajor-General Yahaya was last at the command on the entourage of the immediate past late Chief of Army Staff, Lieutenant-General Ibrahim Attahiru on March 14.\nThe army chief, at the meeting, said such collaborations have paid off in the past."
  },
  {
    "headline": "Borno Govt Suspends French NGO Over Shooting Training At Maiduguri Hotel",
    "summarized_story": "Blessing Tunoh, MaiduguriBorno Governor, Babagana Zulum, has directed the immediate suspension of ACTED, an international Non-Governmental Organization (iNGO) following Saturday’s discovery that the humanitarian organisation was using a hotel in Maiduguri for training some persons on shooting.\nZulum’s spokesperson, Malam Isa Gusau, who announced the Governor’s directive, said the French iNGO was found using toy guns and simulators in training exercises at a hotel located off circular road in Maiduguri.\nGusau explained that residents near the hotel had reported to officials that they were hearing sounds of gunshots from the hotel, following which government officials reported the matter to GRA Divisional Police Headquarters which oversees the hotel’s location.\nThe statement said pending the outcome of police investigation, Governor Zulum has directed sealing of the hotel and suspension of ACTED from any humanitarian activity in Borno State.\nGusau noted that Governor Zulum acknowledges and deeply appreciates the roles of credible iNGOs which have been providing critical humanitarian interventions in different parts of Borno."
  },
  {
    "headline": "Deep Impact: How COVID-19 Exposed The Education Sector’s Digital Flaw",
    "summarized_story": "“Because if it’s the same standards as what we had three, four years ago, I’m obviously scared for public school students.\n“I kind of feel like it’s very unfair that public school students and private school students would sit for the same exams.\nThe importance of digital toolsSamuel Onyeledo, 35, still remembers vividly the first day he walked into a public primary school in Kaduna.\nBecause a basic thing the child should get before leaving primary education is literacy.\nThere were radio programs, but he wasn’t sold on their effectiveness for primary school students."
  },
  {
    "headline": "Italy Beat Austria After Extra-Time To Reach Euro 2020 Quarter-Finals",
    "summarized_story": "Italy made it through to the quarter-finals of Euro 2020 on Saturday with a 2-1 win over Austria after extra-time at Wembley.\nFederico Chiesa and Matteo Pessina struck in the opening period of extra-time to down the Austrians, who pulled a goal back in the 114th minute through Sasa Kalajdzic but couldn’t find the equaliser.\nIn the last eight Roberto Mancini’s side will face either holders Portugal or Belgium in Munich on July 2."
  },
  {
    "headline": "UNILAG may suspend suspected killer Chidinma Ojukwu, police release father on bail",
    "summarized_story": "Authorities of the University of Lagos are reportedly considering the suspension of the alleged killer of Super Tv CEO, Steve Usifo Ataga, Chidinma Adaora Ojukwu, a 21 year old 300 level part time Mass Communications Student of the institution.\nThe decision being considered by the institution is due to the action of the accused, Chidinma Ojukwu, being in clear violation of the conduct expected of her as a student as contained in the institution’s students handbook.\nThe management is expected to initiate disciplinary proceedings against her after which a decision will be taken to either suspend her or not.\nThe Lagos State Police Command has however released the suspect’s father Mr Ojukwu who was arrested for resisting the arrest of his daughter on the grounds that she could not have committed the offence she was being arrested for.\nAdvertisementHe was released on bail with one Nkechi Mogbo the operator of the service apartment in Lekki where the gruesome murder of the Super TV CEO took place."
  },
  {
    "headline": "Voting commences in Anambra PDP governorship primaries",
    "summarized_story": "Voting has commenced in the Anambra state People’s Democratic Party Governorship primaryThe Philip Shaibu led committee was able to screen 218 super delegates who are now voting to nominate their party candidate.\nAnother Aspirant Chuma Nzeribe before the commencement of the exercise, again stepped down for other aspirants.\nIn all, 12 aspirants are now slugging it out, with the hope to elect a flag bearer for the party.\nAdvertisementSimilarly, another faction of the PDP conducted its parallel primary at St. Paul University Play Ground Awka.\nThe exercise produced Senator Ugochukwu Uba as it’s candidate for the same November 6 Anambra state Governorship poll."
  },
  {
    "headline": "Anambra 2021: PDP delegates vote to elect party flagbearer",
    "summarized_story": "Voting has commenced in the Anambra state People’s Democratic Party Governorship primary.\nPresently, the Philip Shaibu led committee was able to screen 218 super delegates who are now voting to nominate their party candidate.\nIn all, 12 aspirants are now slugging it out, with the hope to elect a flag bearer for the party.\nSimilarly, another faction of the PDP conducted its parallel primary at St. Paul University Play Ground Awka.\nAdvertisementThe exercise produced Senator Ugochukwu Uba as it’s candidate for the same November 6 Anambra state Governorship poll."
  },
  {
    "headline": "#EndSARS: Lagos Panel Awards N83m Compensation to Victims of Police Brutality",
    "summarized_story": "The Lagos State Judicial Panel of Inquiry and restitution for SARS related abuses and other matters has awarded a total amount of N83 million in compensation to victims of police brutality.\nAmong those compensated was the family of late Kolade Johnson, awarded the sum of N10 million.\nNigerians voiced their outrage on social media after Johnson was shot during a raid by police officers at Onipetesi area in Lagos on March 31, 2019.\nArise Correspondent, Seyitan Atigarin the details."
  },
  {
    "headline": "Special Report: A Closer Look At Orisa Spirituality",
    "summarized_story": "Yoruba indigenous religion, also known as Orisa spirituality, is practiced by a very small percentage of the population today.\nIn this report, Arise News Correspondent Laila Johnson-Salami visited the family home of an Orisa Priestess in Ibadan, to learn more about the practice…"
  },
  {
    "headline": "Over a Dozen Vaccinated Doctors Dead Amid Indonesia Covid Surge",
    "summarized_story": "More than a dozen fully vaccinated doctors have died of Covid-19 in Indonesia, according to a medical association, as the Southeast Asian country battles a rash of severe cases in inoculated medical workers and highly infectious new virus strains.\nThis month, more than 300 vaccinated doctors and healthcare workers in Central Java were found to have been infected with COVID-19, with about a dozen hospitalised.\nThe country is also grappling with new virus strains, including the highly infectious Delta variant first identified in India.\nMore than a third of the cases reported were elementary school-age students, while a quarter were high school-age students, Inke was quoted by Detik as saying.\n“My sample was among the tested sampling for the Delta variant."
  },
  {
    "headline": "Colombia President Iván Duque’s Helicopter Hit by Gunfire",
    "summarized_story": "Gunfire has hit a helicopter carrying the president of Colombia as it flew near the border with Venezuela.\nPresident Iván Duque was flying toward Cúcuta in the Norte de Santander province, alongside the defence minister, interior minister, and the province’s governor.\n“Our state is strong and Colombia is strong to confront this kind of threat,” he said in a video address posted on Twitter.\nLocal newspaper Semana reports the occupants heard a noise as if something had hit the engine just as the helicopter was coming in to land.\nEarlier this month the ELN denied any involvement in a car bomb attack on a military base in Cúcuta."
  },
  {
    "headline": "Widow Seeks ‘Thorough’ Investigation into John McAfee Death",
    "summarized_story": "“We had a plan of action already in place to appeal that decision,” Janice McAfee told reporters.\nIt said: “We are closely monitoring local authorities’ investigation into the cause of death.\nJohn McAfee had several children from previous relationships, Janice McAfee said.\n“Even though he was born in England, America was his home,” Janice McAfee said.\n“All John wanted to do was spend his remaining years fishing and drinking,” his widow said on Friday."
  }
]