[
  {
    "headline": "Firm proposes farm estates for food security",
    "summarized_story": "By Dennis AgboPursuant to enhancing food security in the country, a Housing and Agricultural development firm, Eastern House Development Ltd, has advised Nigerians to emphasise the establishment of farm estates than Housing.\nThe firm said that efforts should move from the construction of houses to farm estates, where available land should be used for agricultural purposes in commercial quantities.\nThe firm disclosed that it was ready to partner in the specific development of farm estates for government, groups or individuals interested in the project.\n“As in the traditional real estate sector, agricultural real estate will provide homes for rearing animals in a gated distant estate to improve the nation’s agricultural output and boost food security.\n“We, thereby, make a strong case for mass agricultural real estate construction and seek partners in this regard,” he further stated."
  },
  {
    "headline": "Senate Moves to establish Council on Economic Diversification, Tax Crimes Commission",
    "summarized_story": "SenateBy Henry UmoruABUJA- MOVES by the Senate to establish the Nigerian Council on Economic Diversification got boost yesterday as a bill to that effect scaled second reading.\nThe bill is entitled: “Nigerian Economic Diversification Bill, 2022”, was sponsored by the Deputy Whip, Senator Aliyu Sabi Abdullahi, APC, Niger North.\nAlso passed for second reading is a bill to establish the National Tax Crimes Commission, sponsored by Senator Orji Uzor Kalu, APC, Abia North.\nIn a related development, the bill to establish the National Tax Crimes Commission scaled second reading.\nThe bill sponsored by Senator Ajibola Basiru (Osun Central) was referred to the Committee on Health (Secondary and Primary)."
  },
  {
    "headline": "Promoting public sector effectiveness in challenging times",
    "summarized_story": "Aig-Imoukhueme,By Etim EtimSustaining public sector effectiveness and enhancing the morale of public servants during economic crisis could be a very daunting task for many leaders in Africa.\nBut the centrality of public sector workers in the implementation of government policies and programmes is never in doubt.\nThe Foundation’s programmes and initiatives are focused on supporting the development of a more effective public sector.\nAs Mr Aig-Imoukhuede has said, leadership transformation lies at the heart of broader public sector transformation, and so the Foundation is focused on offering programmes that build the capacity of civil servants and other public sector officials.\nPoor internal communication is a major problem in the public service, and it’s a challenge Ada Phil-Ugochukwu is very familiar with."
  },
  {
    "headline": "2023: I’ll act as bridge between legislative, executive arms —Saraki",
    "summarized_story": "Dr Bukola SarakiBy Dirisu YakubuAhead of his formal declaration to vie for the office of the President in 2023 general elections, former Senate President, Bukola Abubakar Saraki has promised to act as bridge between the National Assembly and the Executive arm of government if elected the President of Nigeria.\nThe former Senate President stated this during a consultative meeting he held with members of the Peoples Democratic Party PDP, caucus in the House of Representatives in Abuja.\nThis is even as the Presidential hopeful said“Nigeria cannot attract investment into the country where a government elevated presidential orders above legislative interventions to strengthen the economy”.\n“We can only get out of this mess, if we have leadership that is visionary; understands the issue and is courageous.\nIt is important for us to have a president who understands how to work with the National Assembly."
  },
  {
    "headline": "2023: Owie takes consultation to LGAs, meets Oredo, Ovia south PDP Leaders",
    "summarized_story": "Responding, the Chairman of the PDP in Oredo, Prince Oduwa Igbinosun thanked Dr. Owie for his visit and assured him of their support.\nOther leaders present at the event include Leader of Oredo PDP, Hon.\nMartin Osakue, Senatorial Woman Leader (Edo South) Mrs West Irabor, amongst other dignitaries.\nSimilarly, in Iguobazuwa, headquarters of Ovia South West LGA, Dr. Owie was received by the PDP Leadership led by the Chairman Hon Felix Onaiwu.\nAlso present were Hon Monday Ihama, Chief Oliha, Kemi Aimufua, All 10 Ward Chairmen, Youth Leaders, Women Leaders and critical stakeholders from across the LGA."
  },
  {
    "headline": "Kaduna killings: Atiku reacts as death toll hits 37",
    "summarized_story": "Atiku Abubakar, former Vice President, has reacted to the death toll following attack in Kaura and Jema’a local Government Areas of Kaduna State.\nDAILY POST had reported that the death toll from Sunday’s gunmen attack in Kaduna has risen to 37, as security operatives on Wednesday discovered three more corpses.\nAccording to the presidential aspirant, the latest attack by gunmen has gotten to a point where human lives no longer have value.\nHis tweet read: “The latest attack in Kaduna in which scores of persons were killed is unacceptable and stands condemned.\n“It is unacceptable that we’ve reached a point where human lives have no value.”"
  },
  {
    "headline": "Again, Umahi attacks Wike for mocking him on national television",
    "summarized_story": "Umahi, while referring to the Rivers State Governor, Nyesom Wike, but failed to mention his name, lauded him for admitting on national television that he was behind the hatchet job.\nTaking a swipe on Wike, the Ebonyi state governor likened him (Wike) to biblical Judas Iscariot, noting that as a man who relies on the breath of God like any other mortal, he cannot determine his fate.\nAccording to him, he serves only the living God while that of his unnamed counterpart, might be based on alcohol.\nAsked if he was perturbed about the court judgement, Umahi said: “Do I look worried?\nAnd that’s why even though APC won the election in Bayelsa State, but the deputy governors credentials, were defective."
  },
  {
    "headline": "Buhari condemns ‘mindless killings’ in Kaduna",
    "summarized_story": "President Muhammadu Buhari has condemned the terrorist attack on four locations in Kaura Local Government in Kaduna State.\nThe President stated that “mindless act of violence” have no place in a civilized society.\nBuhari said cowardly attack on innocent civilians, law enforcement officials and the destruction of properties were extremely painful.\n“The nation mourns with the Kagoro community, where the attacks took place and the military which lost their brave compatriots”, he noted.\nHis statement by spokesman Garba Shehu warned against reprisals that may lead to further violence."
  },
  {
    "headline": "Don’t ignore Ibadan traditional rites, practices – Gani Adams advises Olubadan",
    "summarized_story": "The Aare Ona Kakanfo of Yoruba land, Iba Gani Adams, has advised the new Olubadan of Ibadan land, Oba Lekan Balogun, not to ignore the core traditional rites and practices that made Ibadan what it is today.\nAdams has, however, enjoined the new monarch not to abandon the traditional rites and practices that made Ibadan what it is today.\nAs such the burial of any Olubadan as a prominent monarch in Yoruba land should be more traditional than religious.\nTraditional rites is the soul of every traditional institution.\n“Whether we like it or not, Yoruba traditional rites is sacred and unique."
  },
  {
    "headline": "IGP Baba assures police personnel of salary increment",
    "summarized_story": "Inspector General of Police, Usman Baba, has assured personnel nationwide of salary increment.\nThe IGP stated that President Muhammadu Buhari already approved the implementation and will soon take effect.\nKokumo disclosed that relevant federal government were working on the payment and had reached final stages of computation of emolument details.\nThe DIG further disclosed that the issue of promotion is being looked into to ensure deserving officers and men get elevated accordingly.\nLagos Commissioner of Police, Abiodun Alabi thanked IGP for allaying the fears and doubts of personnel and pledged a renewed dedication to duty."
  },
  {
    "headline": "APC Convention: Buhari, Govs agree on consensus for chairman, other positions",
    "summarized_story": "Indications emerged on Wednesday that President Muhammadu Buhari and All Progressives Congress (APC) Governors have adopted consensus for emergence of party officials, including National Chairman.\nThe Governors updated Buhari on progress so far made in the planning of the National Convention scheduled for Saturday at the Eagle Square, Abuja.\nChairman of the Progressive Govenors Forum Atiku Bagudu, who led 16 of his colleagues to the meeting, told State House Correspondents they would follow the President’s guidance for the Convention, including his preferred choice for Chairman.\n“That letter led to a series of actions, including meetings between the Secretary to the Government of the Federation, Chairman of the National Caretaker Committee, Acting Chairman, Governor Abubakar Bello of Niger State, as he was then, and myself.\nHe, however pointed out that aspirants that are against consensus option are free to run at the Saturday Convention, saying APC as a democratic party will not bar anybody from exercising their rights."
  },
  {
    "headline": "U.S. accuses Russian forces of war crimes",
    "summarized_story": "The United States has accused Russian forces of war crimes.\n“Russia’s forces have destroyed apartment buildings, schools, hospitals, critical infrastructure, civilian vehicles, shopping centers, and ambulances, leaving thousands of innocent civilians killed or wounded.\nHe said the Department of State and other U.S. government experts were documenting and assessing potential war crimes in Ukraine.\n“Today, I can announce that, based on information currently available, the U.S. government assesses that members of Russia’s forces have committed war crimes in Ukraine.\nThe U.S. government will continue to track reports of war crimes and will share information we gather with allies, partners, and international institutions and organizations, as appropriate."
  },
  {
    "headline": "Sanwo-Olu launches Lagos Ride with 1,000 cars",
    "summarized_story": "Lagos Governor Babajide Sanwo-Olu has launched the Lagos Ride transport initiative with 1,000 new GAC cars rolled out in the first phase.\nThe initiative is a partnership between Lagos State-owned IBILE Holdings Limited and CIG Motors Company Limited.\nEach car being used in the scheme comes with technology-enabled security features that monitor every journey undertaken.\nSanwo-Olu noted the state had moved another step forward in its drive to develop an efficient transportation model in tune with modernity and comfort.\nThe Governor said the aim was not to run existing hailing ride operators out of business, but to offer safer alternatives and clear the roads of rickety cars."
  },
  {
    "headline": "Court vacates ex-parte order against Union Homes",
    "summarized_story": "A Federal High Court sitting in Lagos on Wednesday vacated an ex parte order it made against Union Homes Savings and Loans Plc.\nJustice Daniel Osiagor discharged the order sequel to a motion filed and argued by the counsel to Union Homes Savings and Loans Plc Dr Muiz Banire SAN and Kunle Adegoke SAN.\nThe order led to the taking over of the firm’s premises at 153, Ikorodu Road, Onipanu Lagos by the Receiver-Manager.\nDissatisfied, Union Homes Savings and Loans Plc and two others – Aso Savings and Loans Plc and Union Bank Plc challenged the order.\nThey approached the court through their counsel Dr. Muiz Banire and Kunle Adegoke – both Senior Advocates of Nigeria (SANs) – with motions to discharge and vacate the order."
  },
  {
    "headline": "Death toll in Kaduna attacks rises to to 37",
    "summarized_story": "Death toll in Kaduna attacks rises to to 37The death toll in Sunday’s attacks in Kaura Local government area and the violent protest in Kafanchan has risen to 37.\nThe development came as some hoodlums were reported to have attacked and burnt two herders’ settlements in Zauru and Kurdan of Zangon Kataf Local Government Area.\nA statement by Kaduna Commissioner for Internal Security and Home Affairs, Samuel Aruwan identified the three victims as Ibrahim Isiyaku (Danasabe), Malam Ibrahim Rilwanu and Malam Lawali Zubairu.\nHe said Zangon- Kataf Local government Chairman Mr. Francis Sani Zimbo, is holding an emergency security meeting with traditional and community leaders of Kurdan and Zaurun to avert reprisal attacks.\n“This brings the total reported death toll from Sunday’s attacks and the ensuing violence to 37."
  },
  {
    "headline": "Lagos fire: Traders under bridges given 7-day quit notice",
    "summarized_story": "By Lukman Olabiyi, LagosThe Federal Government has given occupants of spaces under its bridges in Lagos State seven days to vacate the spaces or face forceful eviction.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nHeads of Ministries, Agencies and Parastatals (MDAs) of the Federal and Lagos State government addressed reporters on top of the bridge when they visited to assess the situation.\nThe Director of Highways, Bridges and Design in the Federal Ministry of Works, Oluropo Oyetade, who represented the minister, said: “All occupants under our bridges, particularly in Lagos now, have seven days, starting today, to leave.\nLagos State Commissioner for Special Duties and Intergovernmental Relations Tayo Bamgbose-Martins described the disaster as cutting across many sectors."
  },
  {
    "headline": "APC convention: We will support whoever Buhari supports – Governors",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaAhead of the March 26 National Convention of the ruling party, the governors of the All Progressive Congress (APC) have said they will support whoever President Muhammadu Buhari supports.\nThe governors were led to the meeting by the Chairman of the Interim Committee of the party and Governor of Yobe State, Mai Mala Buni.\nThe Chairman of the Progressive Governors Forum (PGF) and Governor of Kebbi State, Atiku Bagudu, said they will support any process that would lead to a consensus.\nThe governors are unanimous in the support of the caretaker committee, we thank the Caretaker Committee for what they have been doing.\n‘Indeed, the Chairman of the Caretaker, upon his return, also appreciated what the Caretaker Committee did and the decisions that were taken in his absence."
  },
  {
    "headline": "Breaking: FEC approves N92.123bn contract for Abuja second runway project",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Executive Council (FEC), presided over by President Muhammedu Buhari on Wednesday, approved a total of N92,123,175,305.77 for the construction of a second runway at the Nnamdi Azikiwe International Airport, Abuja.\nThe approval came 24 hours after the inauguration of the new terminal building at the Murtala Mohammed International Airport (MMIA), Lagos.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nMinister of Aviation, Senator Hadi Sirika, disclosed this to State House Correspondents after the week’s virtual FEC meeting, at the Presidential Villa, Abuja.\nRecall President Buhari, had while inaugurating the new terminal building at the MMAI in Lagos on Tuesday, instructed the Minister of Finance, Budget and National Planning, Mrs. Zainab Ahmed, to source funding for the second runway project for the Nnamdi Azikiwe International Airport in Abuja."
  },
  {
    "headline": "Electoral Act battle shifts to Appeal Court",
    "summarized_story": "From Fred Itua, AbujaAlmost one week after a Federal High Court in Abia State, declared as illegal, Section 84(12) of the newly-signed Electoral Act, senators elected on the platforms of the ruling All Progressives Congress (APC) and opposition Peoples Democratic Party (PDP), have resolved to appeal the judgment.\nIn a motion sponsored by George Thompson Sekibo, tagged, “Urgent need to appeal the judgment of the Federal High Court Umuahia on Suit No.\n: FHC/UM/CS/16/2022, lawmakers argued that the power to make laws is vested on the Parliament.\nOn Tuesday, there was a hot exchange on the floor of the Senate, between lawmakers opposed to the action of the Federal High Court and the Minister of Justice, and those opposed to plans by the National Assembly to appeal the judgment.\nSekibo in his motion, quoted extensively Section 4(1, 2 and 3) of the 1999 Constitution, as amended, which he said, was at variance with the court ruling."
  },
  {
    "headline": "BREAKING: Fire destroys Apongbon bridge in Lagos",
    "summarized_story": "An early morning fire has destroyed the Apongbon bridge , the main access route into Lagos Island.\nMany shops located under the bridge were destroyed in the fire outbreak at Apongbon market on Lagos Island.\nThe fire, which broke out on Wednesday morning, has caused a gridlock on the Eko Bridge.\nIt tweeted: “There’s currently fire incidence underneath Eko Bridge which has resulted to slow movement of motorists.\n“Motorists who are yet to connect Eko Bridge are advised to use alternative routes such as Third-Mainland Bridge and Carter Bridge."
  },
  {
    "headline": "Just In: PDP Govs Meet in Abia, Say APC Unfit to Contest 2023 General Election",
    "summarized_story": "Should APC insist on contesting the forthcoming general election despite it woeful failure in every aspects of national life, the PDP Governors said that Nigerians should outrightly reject the ruling party at the polls.\n“The Forum urges Nigerians to reject the APC, a party run undemocratically by a Committee contrary to the Constitution (S.228) with Mr. President regularly issuing instructions and dictates.\nThe meeting noted that life was much better in 2015 under the PDP than today under the APC,” the PDP Governors said.\nOn Debt and Debt Servicing, the Forum said:“Domestic Debt of N8.4T and External Debt of USD 7.3bn was incurred between 1999-2015.\n“The PDP Governors once again decried the inability of the NNPC to make its statutory contributions to the Federation Account, inspite of Oil selling at above $110."
  },
  {
    "headline": "News in Photographs: Buhari Meets APC Govs Ahead of National Convention",
    "summarized_story": "President Muhammadu Buhari Wednesday met with governors of the All Progressives Congress ahead of the party’s national convention which holds this weekend.\nThe meeting at the Council Chambers of the State House Abuja was attended by Vice President Yemi Osinbajo.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Senate to Appeal Court Judgement Nullifying Section 84 (12) of Electoral Act",
    "summarized_story": "Sunday Aborisade, AbujaThe Senate on Wednesday, resolved to appeal a court judgement which nullified Section 84 (12) of the Electoral Act 2022.\nA Federal High Court sitting in Umuahia, had in its verdict, ruled against the provisions of Section 84(12) of the newly amended Electoral Act 2022 passed by the National Assembly.\nJustice Evelyn Anyadike, in the judgment, held that the Section of the Act was unconstitutional, invalid, illegal, null, void and of no effect whatsoever.\nThe Judge said it ought to be struck down as it cannot stand because it was in violation of the clear provisions of the Constitution.\nHe added that Section 228 lists such functions to include making laws to ensure internal democracy within political parties."
  },
  {
    "headline": "House: Court Judgement on Electoral Act Offends Principles of Separation of Power",
    "summarized_story": "*I won’t allow the parliament to be ridiculed, Gbajabiamila vowsUdora Orizu in AbujaThe House of Representatives at the plenary, Wednesday condemned the recent judgment by a Federal High Court sitting in Umuahia, which ordered deletion of Section 84(12) of the newly amended Electoral Act 2022.\nJustice Evelyn Anyadike, had in the judgment, held that the Section of the Act was unconstitutional, invalid, illegal, null, void and of no effect whatsoever.\nThe court ordered the Attorney General of the Federation and Minister of Justice, Abubakar Malami, to “forthwith delete the said sub-section 12 of Section 84 from the body of the Electoral Act.”But, the lawmakers across party lines debating the matter when Hon.\nSada Soli (APC, Katsina) brought it under matters of privilege challenged the judgement of the court, describing it as encroaching the principle of separation of powers.\nGbajabiamila, in his contribution said despite the fact that President Muhammadu Buhari was expected to take legal advice, he won’t allow the institution (House of Representatives) which he heads to be ridiculed."
  },
  {
    "headline": "Buhari Presides at FEC Meeting",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari is presiding over the weekly Federal Executive Council (FEC) meeting at the State House, Abuja.\nThe virtual meeting, which is holding at the Council Chambers, is being attended by Vice-President Yemi Osinbajo, Secretary to Government of the Federation (SGF), Boss Mustapha and Chief of Staff to the President, Prof Ibrahim Gambari.\nThe ministers physically attending the meeting include that of Works and Housing, Babatunde Fashola; Information and Culture, Lai Mohammed; Finance, Budget and National Planning, Zainab Ahmed; Foreign Affairs, Geoffrey Onyema; Humanitarian Affairs and Disaster Management, Sadiya Umar Farouk; Attorney General of the Federation and Justice Minister, Abubakar Malami and Minister of State for Budget and National Planning, Clem Agba.\nOther ministers are virtually attending the meeting in their various offices in Abuja.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: How President Buhari Snubbed Ex-Lagos Governor, Tinubu During Visit To Lagos Days To APC Convention",
    "summarized_story": "There is growing anxiety in the camp of former Lagos State Governor, Bola Tinubu after President Muhammadu Buhari shunned the ex-governor during his (Buhari’s) visit to Lagos State on Tuesday.\nTop sources around the President added that Tinubu was also not allowed near Buhari – a body language suggestive of another round of discord between the two.\nSaharaReporters on Tuesday reported that Buhari and his entourage landed at the Presidential Wing of the Murtala Muhammed Airport, Lagos at 10 am on Tuesday, amid tight security.\nThe President had arrived aboard a Nigerian Air Force Boeing aircraft with registration number 5N-FGT and was welcomed by Governor Babajide Sanwo-Olu and some members of the Lagos State Executive Council.\nPresident Buhari was also at the ongoing construction at the Dangote Refinery, as well as the Lekki Deep Sea Port."
  },
  {
    "headline": "EXCLUSIVE: How President Buhari Snubbed Ex-Lagos Governor, Tinubu During Visit To Lagos Days To APC Convention",
    "summarized_story": "There is growing anxiety in the camp of former Lagos State Governor, Bola Tinubu after President Muhammadu Buhari shunned the ex-governor during his (Buhari’s) visit to Lagos State on Tuesday.\nTop sources around the President added that Tinubu was also not allowed near Buhari – a body language suggestive of another round of discord between the two.\nSaharaReporters on Tuesday reported that Buhari and his entourage landed at the Presidential Wing of the Murtala Muhammed Airport, Lagos at 10 am on Tuesday, amid tight security.\nThe President had arrived aboard a Nigerian Air Force Boeing aircraft with registration number 5N-FGT and was welcomed by Governor Babajide Sanwo-Olu and some members of the Lagos State Executive Council.\nPresident Buhari was also at the ongoing construction at the Dangote Refinery, as well as the Lekki Deep Sea Port."
  },
  {
    "headline": "BREAKING: Nigerian Police Authorities Begin Clampdown On Aggrieved Policemen, Arrest Inspector Over Planned Strike",
    "summarized_story": "The Nigerian police authorities have launched an operation to clampdown on officers planning to embark on industrial actions on Saturday.\nSome policemen had last week said they would embark on the warning strike to protest poor working conditions, poor salaries, lack of genuine welfare benefits and outdated weapons.\nThe officers condemned the continuous killing of their colleagues by armed robbers and terrorists, without adequate compensation for their families.\nAccording to Baba, a strike action by a lead security agency such as the police was tantamount to mutiny.\nHowever, the policemen insisted that there was no going back on the planned industrial action."
  },
  {
    "headline": "BREAKING: Nigerian Police Authorities Begin Clampdown On Aggrieved Policemen, Arrest Inspector Over Planned Strike",
    "summarized_story": "The Nigerian police authorities have launched an operation to clampdown on officers planning to embark on industrial actions on Saturday.\nSome policemen had last week said they would embark on the warning strike to protest poor working conditions, poor salaries, lack of genuine welfare benefits and outdated weapons.\nThe officers condemned the continuous killing of their colleagues by armed robbers and terrorists, without adequate compensation for their families.\nAccording to Baba, a strike action by a lead security agency such as the police was tantamount to mutiny.\nHowever, the policemen insisted that there was no going back on the planned industrial action."
  },
  {
    "headline": "National Assembly Kicks Against Attorney-General Malami, To Appeal Court Order Removing Section 84 (12) From Electoral Act",
    "summarized_story": "The decision was made following a deliberation on the court order during Wednesday’s plenary in both chambers of the National Assembly in Abuja.\nHe later asked the National Assembly to amend the section of the Act, but the request was rejected by the lawmakers.\nThey insisted that the court passed a judgement on a matter which was not included in the Electoral Act passed by the National Assembly.\nThey also questioned why the National Assembly was not joined as a respondent to the suit, stressing that the action of the judge was an ‘aberration’.\nGbajabiamila, therefore, appealed to the AGF not to hastily implement the court judgement, and not to get into the legitimate functions of the National Assembly."
  },
  {
    "headline": "ALERT: Lagos shuts Eko Bridge indefinitely over Apongbon fire outbreak",
    "summarized_story": "The Lagos government has ordered the closure of the Eko Bridge following a fire outbreak in Apongbon area of the state.\nEarlier on Wednesday, a fire broke out at the Apongbon market, and it took hours to bring the situation under control.\nAdvertisementThe federal government has also given traders and squatters under bridges in Lagos till March 31 to vacate such areas.\nIn a statement, the Lagos government said the bridge will remain closed pending the conclusion of the integrity test.\n“TRAVEL ALERT: Eko Bridge has been shut indefinitely by the Lagos State Government due to a fire outbreak at Apongbon in the early hours of today,” the statement reads."
  },
  {
    "headline": "ALERT: Lagos shuts Eko Bridge indefinitely over Apongbon fire outbreak",
    "summarized_story": "The Lagos government has ordered the closure of the Eko Bridge following a fire outbreak in Apongbon area of the state.\nEarlier on Wednesday, a fire broke out at the Apongbon market, and it took hours to bring the situation under control.\nAdvertisementThe federal government has also given traders and squatters under bridges in Lagos till March 31 to vacate such areas.\nIn a statement, the Lagos government said the bridge will remain closed pending the conclusion of the integrity test.\n“TRAVEL ALERT: Eko Bridge has been shut indefinitely by the Lagos State Government due to a fire outbreak at Apongbon in the early hours of today,” the statement reads."
  },
  {
    "headline": "EXTRA: I’m unbothered by court ruling on my sack… I've even added weight, says Umahi",
    "summarized_story": "David Umahi, governor of Ebonyi, says he is not worried about the recent court judgment removing him from office.\n“I’m not worried, because in the first place, there is no constitutional provision that says that the governor can be sued.\nAdvertisement“But a court judgment is a court judgment.\nI’m not interpreting it, but I can speak to the constitution and the constitution says that once you’re elected, you enjoy immunity.\n“So, the hatchet man that boasted is like Judas Iscariot and I have no worry because the constitution is clear."
  },
  {
    "headline": "EXTRA: I’m unbothered by court ruling on my sack… I've even added weight, says Umahi",
    "summarized_story": "David Umahi, governor of Ebonyi, says he is not worried about the recent court judgment removing him from office.\n“I’m not worried, because in the first place, there is no constitutional provision that says that the governor can be sued.\nAdvertisement“But a court judgment is a court judgment.\nI’m not interpreting it, but I can speak to the constitution and the constitution says that once you’re elected, you enjoy immunity.\n“So, the hatchet man that boasted is like Judas Iscariot and I have no worry because the constitution is clear."
  },
  {
    "headline": "'99% effective in mice' -- scientists develop male contraceptive pill",
    "summarized_story": "Scientists in the United States (US) say they have developed a non-hormonal contraceptive pill for males.\nA statement by the ACS also noted that the pill, which limits chances of impregnating females, loses effect when no longer taken.\n“To develop their non-hormonal male contraceptive, the researchers targeted a protein called the retinoic acid receptor alpha (RAR-α).\nAdvertisement“Knocking out the RAR-α gene in male mice makes them sterile, without any obvious side effects.\n“When given orally to male mice for 4 weeks, YCT529 dramatically reduced sperm counts and was 99% effective in preventing pregnancy, without any observable side effects."
  },
  {
    "headline": "Tyranny in the workplace: The chaotic culture of Bento Africa",
    "summarized_story": "Ebun Okubanjo announcing on the company’s slack after firing Kunle“Leave Ebun, that man can literally kill you and brag about it.\nOn November 22, when Okunbanjo fired Kunle for the second and final time, he refused to pay his November salary and severance pay.\nFor Johnson, joining Bento Africa was “a bad idea” and leaving “the best thing he’d ever done for himself”.\nBento is still toxicThree current Bento employees contacted by TechCabal were diplomatic about their responses, but they agreed that everything this publication has unearthed about Bento Africa’s work culture “is not false”.\nEbun Okubanjo posted our email request on Twitter, he has since deleted the tweet."
  },
  {
    "headline": "Big Cabal Media raises $2.3m to expand its compelling line of digital products",
    "summarized_story": "In 2021, venture capital invested $115 million in digital media globally, a tenth of the $1.1billion it funded in 2015, but not much came to Africa.\nToday, one of such exceptions, Big Cabal Media (BCM), a leading African digital media company, has announced a $2.3 million Seed funding round, emphasising its commitment to keep building exciting and authoritative media products and brands.\n“We are delighted to support Big Cabal Media at a pivotal moment.\nBCM’s progress over the years and recent fundraise is a noteworthy example of the possibilities and opportunities in Africa’s digital media sector.\n“Investing in Africa’s booming digital media sector aligns perfectly with MaC’s mission of supporting exceptional entrepreneurs building valuable technology companies that leverage shifts in cultural trends and behaviours."
  },
  {
    "headline": "The untold story of how ThriveAgric survived a turbulent 2020",
    "summarized_story": "He was one out of hundreds of ThriveAgric’s retail investors who hadn’t received the payments.\nThis affected ThriveAgric’s communication with its retail investors as it repeatedly failed to fulfil the promises it made to its retail investors.\nAll through this turbulent phase, the company maintains it didn’t take its retail investors for granted.\nUnexpected support and lessonsDuring the turbulent period, there was a lot of pushback from retail investors but also surprisingly a lot of support from investors, financiers, and friends.\n“Essentially, I ensured that the core business operations ran smoothly and built a system to ensure that the defaulting offtakers paid,” Eje said."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "Watershed moment for crypto as Ukraine legalises crypto, and the US reveals regulation plans",
    "summarized_story": "Less than a week later, Ukraine, a European country currently at war with neighbouring Russia, legalised cryptocurrencies after raising more than $54 million in crypto donations.\nThe fact sheet released by the White House on Wednesday, March 9, 2022, contains details of what the executive order hopes to accomplish with cryptocurrencies.\nGoing by El Salvador’s move to make cryptocurrencies a legal tender, Ukraine’s crypto legalisation might not affect the crypto market.\nHe thinks the executive order will improve cryptocurrency regulations and stabilise the market.\nAmerican diplomat and technologist, Tomicah Tillemann also revealed that the executive order could be a turning point for crypto and the entire Web3 ecosystem."
  },
  {
    "headline": "Lessons from Egypt",
    "summarized_story": "With this raise, the startup intends to expand its operations to other African countries, starting with Ghana, Kenya, and Zambia.\nLessons from EgyptOver the past year, the Egyptian startup ecosystem has received more attention as its startups attract multi-million dollar investments.\nThe banks include the National Bank of Egypt, Banque du Caire, eFinance Investment Group, Egyptian Banks Company, and Banque Misr.\nHowever, this approach by Egypt’s biggest banks is a welcome development and could foster collaboration between banks and fintech startups in the country.\nRather than stifle growth, other African countries will do well to borrow a leaf from Egypt."
  },
  {
    "headline": "Speaking against toxic work cultures",
    "summarized_story": "Eventually, some ex-staff and current workers at the startup contributed to the piece either anonymously or with full disclosure.\nFor a moment, it appears we’re moving away from the reality that protecting employee interest in the Nigerian tech space is harder than it looks.\nSo far, the founder claims that Lendsqr already has over 100 lenders offering credit to almost half a million users.\nMonths before that, five other eCommerce startups have raised $275m combined in VC fund and debt financing.\nWith this raise, Apollo plans to spread its tentacles into West Africa and other parts of East Africa."
  },
  {
    "headline": "Four out of every 10 Nigerians live below poverty line – World bank",
    "summarized_story": "Four out of every 10 Nigerians live below poverty line – World bankNigeria currently need long-term reforms to foster and sustain pro-poor growth and raise citizens out of poverty, World Bank report reveals.\nAccording to the Bank’s latest report titled, ‘A Better Future for All Nigerians: Nigeria Poverty Assessment 2022’, Nigeria requires macroeconomic reforms including fiscal, trade, and exchange rate policy; policies to boost the productivity of farm and non-farm household enterprises among others.\nThe report, which represents the culmination of the World Bank’s engagement on poverty and inequality-relevant data and analytics in Nigeria in the past two years, brings together the latest evidence on the profile and drivers of poverty in Nigeria.\nAs many as 4 in 10 Nigerians live below the national poverty line,” it stated.\n“Data can provide vital guidance on how to design, monitor, and evaluate pro-poor projects and programs, giving a voice to poor and vulnerable Nigerians” added Jonathan Lain, World Bank Economist and co-author of the report."
  },
  {
    "headline": "FEC approves N92.12bn for Abuja airport second runway",
    "summarized_story": "The Federal Executive Council has approved the sum of N92.12billion for the construction of a second runway at the Nnamdi Azikiwe International Airport, Abuja.\nThe approval by the council is coming a day after President Muhammadu Buhari inaugurated a new terminal building at the Murtala Muhammed International Airport (MMIA), Lagos.\nAccording to him, the approved fund will be spread over a number of works to be carried out at the airport within a period of 12 months.\nRead also: FG to concession all airports soon – BuhariThe approval is a follow-up of President Buhari’s directive to Zainab Ahmed, the minister of finance, Budget, and National Planning, to source special funding for the second runway of the airport.\nPresident Muhammadu Buhari had on Tuesday directed Hadi Sirika to fast track the construction of the second runway at Nnamdi Azikiwe International Airport, Abuja and the concession of the five international airports."
  },
  {
    "headline": "Many rich Nigerians one shock away from poverty – W/Bank",
    "summarized_story": "The World Bank has said in a new report that many rich Nigerians are only one small shock away from falling into poverty.\nThe multilateral lender, in its ‘Nigeria Poverty Assessment 2022’ report, said the COVID-19 crisis was driving up Nigeria’s poverty rate, pushing more than five million additional people into poverty by 2022.\n“Many non-poor Nigerians are only one small shock away from falling into poverty, while those who are already poor could be pushed into even deeper deprivation,” the World Bank said.\n“This problem may currently be getting worse: climate change threatens to make floods and droughts more frequent and more severe, compounding this challenge for poverty reduction in Nigeria.\n“The pro-poor government spending that could broaden the base of growth is currently lacking in Nigeria,” the World Bank added."
  },
  {
    "headline": "Obaseki celebrates media icon, Soni Irabor at 70 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has congratulated media icon and Chairman of Soni Irabor Media Group, Soni Irabor, on his 70th birthday.\nObaseki, in a statement, noted that the veteran broadcaster has carved a niche for himself, helping to build the capacity of younger media professionals to enrich the profession and create a veritable pool for promoting media literacy.\nHe noted, “It is with great delight that I congratulate a consummate media icon and celebrated Edo son, Soni Irabor, as he attains the landmark age of 70 years.\n“Irabor has led a remarkable, memorable life; growing from humble beginnings in broadcasting to becoming a media colossus with a career that has spanned almost fifty years, across advertising, media management, public relations, film and marketing.\n“It is remarkable that he has carved a niche for himself, helping to build the capacity of younger media professionals to enrich the profession and create a veritable pool for promoting media literacy."
  },
  {
    "headline": "Obaseki meets Italian Ambassador, strengthens response against human trafficking, illegal migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, said his administration is strengthening the state’s response to human trafficking and illegal migration.\nObaseki disclosed this when he received the Italian Ambassador to Nigeria, Stefano De Leo, who was on a courtesy visit at the Government House, Benin City.\nThis emphasizes the special relationship that Edo State, as a sub-national, and the Italian government enjoys.\nIn the past five years, we have been working with the Italian authorities and have been able to significantly limit and reduce the incidents of irregular migration and human trafficking in Edo.\n“We are creating the enabling environment for businesses to thrive in Edo State."
  },
  {
    "headline": "Taxpayers Protection Bill Passes Second Reading in Senate – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – A bill seeking to enhance the Nation’s revenue generation system through the establishment of a National Tax crimes commission (NTCC) to prevent and combat tax crimes, protect taxpayers rights, amongst others has passed through second reading on the floor of the Nigerian Senate on Wednesday.\nSponsored by the Chief Whip of the Senate, Senator Orji Uzor Kalu the Tax bill titled ” an Act to establish the National Inspector General for Tax Crimes Commission,2022 (SB.\nConcluding his lead debate , Kalu provided the financial implications of the establishment of the Tax Crimes Commission in the twelve first months.\nIn his contribution, Senator Isah Jubrin ( Kogi East) commended Orji Kalu for initiating the bill and moved for the adoption of the bill for second reading.\nThe Senate in a voice vote presided over by the Senate President, Ahmad Lawan voted in favour of the bill to be read for a second time."
  },
  {
    "headline": "TVET: Edo govt plans technical schools in 18 LGAs, advances on formalizing informal sector – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo Government has disclosed plans to build at least one technical school in each of the 18 local government areas in the state to resuscitate Technical and Vocational Education and Training (TVET).\nCommissioner for Education, Dr. Joan Osa-Oviawe, who disclosed this to journalists in Benin City, said Edo was in the process of formalising the informal skilled sector in the state.\nWe don’t just want to strengthen our TVET schools, we want to mainstream TVET so that from primary school, our pupils are exposed to handiwork.\nWith this, any pupil that wants to go to a TVET school can do so.\n“So, mainstreaming skilled acquisition, technical and vocational is not just in our regular schools, the governor has mandated that we should extend to our Special Needs schools."
  },
  {
    "headline": "Sanwo-Olu launches lease-to-own taxi scheme to empower Lagosians",
    "summarized_story": "Governor of Lagos State, Mr. Babajide Sanwo-Olu, on Wednesday, launched a state-run taxi scheme with the roll-out of first 1,000 vehicles.\nThe scheme, according to the governor, will be run on lease-to own basis and meant to provide meaningful source of livelihoods to residents of the state.\n“Earlier today, I launched a safe, comfortable and modernised taxi scheme in Lagos State, with a rollout of the first batch of 1,000 brand-new GAC-branded vehicles under the LAGRIDE scheme,” Sanwo-Olu announced via his Facebook page.\n“The scheme will be operated on a lease-to-own basis, as a component of our multimodal transportation blueprint.\nThe need to provide a dignifying and more rewarding means of livelihood for unemployed and underemployed population gave birth to the new ‘Lagos State Taxi Scheme’, which will be operated on a lease-to-own basis."
  },
  {
    "headline": "PDP governors meet, decry prevailing economic hardship, promise to rescue Nigeria from APC",
    "summarized_story": "(c) Nigeria Federation has 49% shareholding in NLNG.\nThe PDP Governors congratulated the host, His Excellency, Governor Okezie Ikpeazu, the PDP Governors’ Forum Vice Chairman, for his generosity and hospitality in the hosting of the meeting.\nBala Mohammed -Bauchi State• Gov.\nSamuel Ortom -Benue State• Gov.\nGodwin Obaseki – Edo State• Gov."
  },
  {
    "headline": "He was a bright star who helped brighten my path – Elliot Uko pays tribute to Emeka Obasi",
    "summarized_story": "Evangelist Elliot Ugochukwu-Uko, founder of Igbo Youth Movement and Secretary, Eastern Consultative Assembly, has described the late Prince Emeka Obasi as a bright star who helped to brighten his path.\nObasi, an award-winning journalist and publisher Business Hallmark Newspaper, passed away on Tuesday at a Lagos hospital after an illness.\nIn a tribute to the departed, Evangelist Uko said Obasi was a major pillar of support for his Igbo Youth Movement, noting that the movement may not have achieved prominence without him.\nUko remarked that the late Prince Obasi was a hardworking and creative genius whose ideas bore impressive fruits.\n“Prince Emeka Obasi left an inspiring legacy of hardwork, networking and creativity."
  },
  {
    "headline": "U.S. arts envoy thrills Nigerians in 11-day cultural diplomacy visit",
    "summarized_story": "She described what prospective Nigerian students can expect in terms of curriculum and opportunities for studying music in the United States.\n“It has been so wonderful for me to see and feel the warmth of the Nigerian people.” Pauline said.\n“I am so lucky to be here in Nigeria on behalf of the U.S. Department of State as an Arts Envoy.\nHer cultural diplomacy visit to Nigeria was sponsored by the U.S. Department of State’s Bureau of Educational and Cultural Affairs with support from the U.S. Mission in Nigeria.\nThe Public Affairs Sections of the U.S. Mission in Nigeria, in Abuja and Lagos, support programs that bring American cultural leaders to Nigeria to meet, exchange ideas and collaborate with Nigerian cultural leaders."
  },
  {
    "headline": "Kwankwasiyya Na Fuskantar Barazana Kan Ficewar Jiga-jiganta",
    "summarized_story": ""
  },
  {
    "headline": "A Wadanne Shekaru Ne Mata Suke Fara Haila Da Dainawa?",
    "summarized_story": "don na ga kamar shekaruna ba su kai na yi jinin haila ba, Allah ya yi maka albarka a rayuwa?\nTo ‘yar’uwa yawancin mata suna fara yin haila ne daga shekara 12-50 amma wani lokacin mace tana iya yin haila kafin shekara 12 ko kuma bayan shekara 50 wannan ya danganci yanayinta da kuma Wurin da take zaune.\nMalamai sun yi sabani shin akwai wata shekara ta musamman da mace take fara haila ko kuma take dainawa, ta yadda jinin da ya sameta kafin wannan ko bayan wannan shekarun ba za’a kira shi jinin haila ba?\nSaboda haka jinin da kika gani sunansa jinin haila, saboda kamar yadda malamai suka fada duk jinin da ya fito daga gaban mace sunansa jinin haila mutukar ba’a samu wani dalili da yake nuna cewa na cuta ne ba.\nSannan sahabbai sun yi tsarki da ruwan da ya bubbugo daga hannun Annabi (SAW) ruwan zamzam kuma ba zai fi wannan ruwan daraja ba."
  },
  {
    "headline": "2023: Wasu Daga Cikin Masu Zawarcin Kujerar Gwamnan Kano",
    "summarized_story": ""
  },
  {
    "headline": "Kwankwasiyya Na Fuskantar Barazana Kan Ficewar Jiga-jiganta",
    "summarized_story": ""
  },
  {
    "headline": "An Bukaci A Kawo Karshen Matsalar Wutar Lantarki A Nijeriya —Majalisa",
    "summarized_story": ""
  },
  {
    "headline": "Russia keeps mum over heavy military losses in Ukraine",
    "summarized_story": "Russian military officials are keeping mum over the heavy losses sustained in the Ukrainian war since the last report on 2 March.\nNATO paints a more grim picture of casualties, up to 40,000 Russian troops killed, wounded, taken prisoner or are missing in Ukraine.\nNATO estimates that between 7,000 and 15,000 Russian soldiers have been killed since the invasion began on Feb. 24.\nRussia’s invasion of Ukraine has killed thousands of people, displaced nearly 10 million and raised fears of a wider confrontation between Russia and the United States.\nRussia says its “special military operation” was necessary because the United States was using Ukraine to threaten Russia and Moscow had to defend against the “genocide” of Russian speakers by Ukraine."
  },
  {
    "headline": "Photos: Buhari meets APC chairmanship aspirants",
    "summarized_story": "President Muhammadu Buhari has met most of the chairmanship aspirants of the All Progressives Congress (APC) at the State House in Abuja.\nThe meeting which dovetailed into dinner was attended by the Chairmen Caretaker and Extraordinary Convention Planning committee of the APC and Governor of Yobe State, Mai Mala Buni.\nAmong the aspirants at the meeting Wednesday night were Senator Abdullahi Adamu, Sen. Ali Modu Sheriff, Abubakar Yari and Saliu Mustapha.\nOthers are Sen George Akume, Sen Tanko Al-Makura, Sen Mohammed Sani Musa and Mohammed Saidu Etsu.\nThe election of the chairman will take place 26 March in Abuja at the much delayed national convention of the APC."
  },
  {
    "headline": "Details Of Buhari’s Meeting With APC Governors Emerges",
    "summarized_story": "The details of the meeting between President Muhammadu Buhari and Governors elected on the platform of the All Progressives Congress (APC) have emerged.\nNews Direct earlier reported that the President met with the governors at the Presidential Villa ahead of the APC’s national convention slated for Saturday, March 26.\nBagudu added that the governors would support any process that would lead to a consensus in choosing the party officials.\nAccording to Buni, the Progressives Governors Forum are at peace following the directive of President Buhari.\nHe further stated that this person have plans to ignite an unsolicited crisis, just a few days before the party’s national convention."
  },
  {
    "headline": "Nothing Will Destroy My Over 40 Years Of Friendship With Governor Emmanuel – Akan Okon",
    "summarized_story": "Mr. Okon, who is also contesting for the governorship of Akwa Ibom state, said the Governor has been his friend for more than 40 years, he said he will not sacrifice his relationship with the Governor because of politics.\n“Governor Udom Emmanuel is my friend.\n“His Excellency Governor Udom Emmanuel has done well.\n“At 34, Akwa Ibom State cannot afford to be an experimental field where people come to learn leadership in public service.\nMr Akan Okon joined the Akwa Ibom State Government in 2013 and first served as commissioner in the ministry of economic development for six months."
  },
  {
    "headline": "JUST IN: Fintiri Absent As 13 PDP Governors Meet In Abia",
    "summarized_story": "JUST IN: Fintiri Absent As 13 PDP Governors Meet In AbiaAdamawa Governor Umaru Fintiri was absent on Wednesday when Peoples Democratic Party (PDP) Governors’ Forum met at the Umuobiakwa, Obingwa local government area country home of Abia Governor Okezie Ikpeazu.\nTaraba Governor Darius was represented by his deputy, Haruna Manu.\nOthers in attendance were Governors Ifeanyi Ugwuanyi (Enugu); Nyesom Wike (Rivers); Ifeanyi Okowa (Delta); Godwin Obaseki (Edo); Aminu Tambuwal (Sokoto); Seyi Makinde (Oyo); Douye Diri (Bayelsa); Emmanuel Udom (Akwa Ibom) and Samuel Ortom (Benue).\nThough there was no official statement by the Abia State Government over the visit of the Governors, it was gathered zoning would top the issues they will consider."
  },
  {
    "headline": "BREAKING: Atiku Formally Declares 2023 Presidential Bid",
    "summarized_story": "Former Vice-President Atiku Abubakar has formally announced his candidacy for the presidency in 2023.\nOn Wednesday, the former vice president announced his ambition to run for president in 2023 at the International Conference Centre in Abuja.\nThe former customs officer is expected to battle Governor Aminu Tambuwal, Bukola Saraki, Dele Momodu, Ayim Pius Ayim for the Presidential ticket of the PDP.\nMr Atiku has been contesting to be president of Nigeria since 1993.\n“This time around is different; our journey will not end at the poll; we will get to work and rescue Nigeria."
  },
  {
    "headline": "Breaking: Protest hits Edo as Obaseki sacks over 500 sports workers",
    "summarized_story": "There was massive protest around the Samuel Ogbemudia Stadium and adjoining streets on Wednesday after Edo state governor reportedly sacked 513 workers of the State Sports Council.\nAccording to reports, the workers were relieved of their jobs with effect from March 21.\nAs at the time of filling this report, the state government was yet to react.\nDetails loading…"
  },
  {
    "headline": "Tambuwal on 2023: Demography not zoning ‘ll determine Nigeria’s next president – Blueprint Newspapers Limited",
    "summarized_story": "The Chairman Peoples Democratic Party (PDP) Governors’ Forum and Sokoto state Governor Aminu Waziri Tambuwal has said more than anything, the factor of demography would determine who becomes president in 2023.\nHe said, “As leaders of our party, who are working towards winning election, not zoning, not winning tickets.\nBut you must plan to win election.\n“So we must accept these realities as a party and work with these realities to win election.\nWin election first, don’t win zoning, win the election and then we’ll come and share power, because the President and the Vice President cannot come from the same zone."
  },
  {
    "headline": "Buhari orders concession of Abuja, Lagos, Kano, Portharcourt airports",
    "summarized_story": "President Muhammadu Buhari has ordered the speedy concession of four new airport terminals constructed by a Chinese company at the international airports in Lagos, Abuja, Kano and Port Harcourt.\nHe explained that there would be air-rail connectivity between the domestic and international airports to shorten the traffic time between both terminals.\nHe appealed to President Buhari to direct the Nigerian National Petroleum Corporation (NNPC) to import Jet fuel in good quantity for operators in the industry.\nThe new Lagos terminal has the capacity to process 14 million passengers per annum and built on a land mass of approximately 56,000 square metres with 66 check-in counters.\nCCECC commenced construction of four new terminals at Lagos, Abuja, Kano and Port Harcourt airports in 2013 with completion period fixed for 20 months."
  },
  {
    "headline": "UPDATED: FEC Approves N92.12bn For Second Abuja Airport Runway Project",
    "summarized_story": "The Federal Executive Council has approved the sum of N92.12billion for the construction of a second runway at the Nnamdi Azikiwe International Airport, Abuja.\nThe approval by the council comes a day after President Muhammadu Buhari inaugurated a new terminal building at the Murtala Mohammed International Airport (MMIA), Lagos.\nAccording to him, the approved fund will be spread over a number of works to be carried out at the airport within a period of 12 months.\nThe approval is a follow-up of President Buhari’s directive to the Minister of Finance, Budget, and National Planning, Mrs Zainab Ahmed, to source special funding for the second runway of the airport.\nAt the event in Lagos on Tuesday, the President asked the aviation minister to fast-track the airport concession programme, to boost aviation practice in the country and make the aviation industry reflect global standards."
  },
  {
    "headline": "2023 Polls: Atiku Formally Declares Intention To Run For President",
    "summarized_story": "﻿Former Vice President Atiku Abubakar has formally declared his intention to run for the presidency in 2023.\nIf elected, Atiku promised to focus on unity, security, economy, education and devolving more resources and powers to the federating units.\nHe had been Vice President for eight years between 1999 and 2007 and in 2019, entered the race for President.\n“This time around is different; our journey will not end at the poll; we will get to work and rescue Nigeria.\n“I have never been this optimistic, and with your support and God’s grace, we will get to the promised land."
  },
  {
    "headline": "Death Toll From Kaduna Bandits Attacks, Mob Violence Rises To 37",
    "summarized_story": "Security operatives in Kaduna State have discovered three more corpses following mob violence on Monday at two locations in both Kaura and Jema’a local government areas of the state.\nThis follows Sunday’s attack in some communities in Kaura Local Government Area where several people died.\nThe deceased were identified as Malam Ibrahim Rilwanu and Malam Lawali Zubairu, both of No.5 Emir Road, Kafanchan.\nIn another development, security agencies said some hoodlums attacked and burnt down two herders’ settlements in Zauru and Kurdan in Zangon Kataf LGA.\nThe attack, however, prompted the Chairman of Zangon Kataf local government, Mr. Francis Sani Zimbo, to summon an emergency security meeting with traditional and community leaders of Kurdan and Zauru over the incident."
  },
  {
    "headline": "Senate, Reps To Appeal Court Order Removing Section 84 (12) From Electoral Act",
    "summarized_story": "Lawmakers in the Senate and House of Representatives have resolved to appeal judgement which directed the Attorney General of the Federation (AGF) to delete Section 84 (12) of the newly signed Electoral Act.\nThis followed a deliberation on the court order during Wednesday’s plenary in both chambers of the National Assembly in Abuja.\nThey insisted that the court passed a judgement on a matter which was not included in the Electoral Act passed by the National Assembly.\nPresident Muhammadu Buhari assented to the Electoral Act 2022 on February 25, following a series of attempts by the National Assembly to amend the nation’s electoral laws.\nHe later asked the National Assembly to amend the section of the Act, but the request was rejected by the lawmakers."
  },
  {
    "headline": "Buhari Hosts APC Chairmanship Aspirants",
    "summarized_story": "President Muhammadu Buhari has hosted to a dinner, the National Chairmanship Aspirants of the Governing All Progress Congress (APC) at the State House.\nThe Chairmen Caretaker and Extraordinary Convention Planning committee of the APC and Governor of Yobe State, Mai Mala Buni; the Chief of Staff to the President, Professor Ibrahim Gambari and Secretary to the Government of the Federation Boss Mustapha were in attendance.\nRead Also: You Are Afraid Of Your Own Shadows, PDP Claps Back At Buhari, APCAll the aspirants for the APC National Chairmanship position were also in attendance.\nAlthough details of the interactive engagement were not divulged to the media, the engagement is expected to foster a successful and rancor-free Convention on March 26."
  },
  {
    "headline": "Former Zamfara Speaker Sanusi Rikiji Declares Intention For Senatorial Seat -",
    "summarized_story": "Former Speaker of the Zamfara State House of Assembly, Rt.\nHe told the state APC executives under the Chairmanship of Hon.\nTukur Umar Danfulani that he wants to occupy the senate seat in order to further contribute his quota to the political and socio-economic growth of the state.\n” I Intend to add quality to the good representation past senators had made at the national assembly as well as to assist and support the efforts of governor Bello Matawalle in the face of security challenges confronting the state while also joining the governor in the making of a new Zamfara” Rikiji SaidWhile commending the leadership of the party,he pledges his continued support and loyalty to the party and its leadership for the growth and development of the stateResponding, the Chairman, Zamfara State Tukur Umar Danfulani express happiness in the way the aspirant followed due process in declaring his intentionDanfulani assures him that as leaders of the party, they will be fair and just to all members and the party will leave its doors wide open for all interested and qualified members to contest for the position.\nHe noted that Zamfara Central Senatorial Zone deserves the best representation and the party will align with the people in ensuring that the best person is supported to ensure his Victory at the polls."
  },
  {
    "headline": "Only Tinubu can sustain Buhari's endearing legacies in 2023",
    "summarized_story": "This, they say is no other person than former governor of Lagos State, Asiwaju Bolas Ahmed Tinubu.\nThe statement reads further:“Why will President Buhari and Vice President Osinbajo be seen as blessings to Nigeria in the face of economic hardship and security challenges?\nRather than complain and blame President Buhari for the current harsh economic situations, we should applaud him and thank God for giving him to us at these trying times.\nYes, there is no alternative to Tinubu in 2023.\n“Consequently, the No Alternative to Buhari-Osinbajo 2019 ( NATBO 2019) will now be known and referred to as No Alternative to Tinubu 2023 (NATT 2023),” the group concluded."
  },
  {
    "headline": "Abdullahi Shinkafi Withdraws From APC National Chairmanship Race -",
    "summarized_story": "With barely three days to the All Progressive Congress National Convention, a frontline national chairmanship aspirant of the party Abdullahi Shinkafi has withdrawn from the raceShinkafi says, the decision to withdraw from the race is to respect the party supremacy and President Muhammadu Buhari’s decision to zone the position to the North CentralAt a press conference in Gusau, Dr. Shinkafi adds that as a party member, he has all it takes to lead and take the ruling party to a greater heights“I have decided to withdraw from the race as a party man who respect the rule of law and the party’s leaders”.\n“The party has taken a position that the position of its national chairman should go to the North Central, meaning it is exclusively zoned to contestants of the Zone” Shinkafi added.\nAbdullahi Shinkafi appeal to all party Members especially Governors and National Assembly members to support Mai Mala Buni in his quest to conduct a free, fair and transperent National Convention that will lead the party to victory in the 2023 General Elections."
  },
  {
    "headline": "COAS commences Senior Command Leadership seminar in Jos",
    "summarized_story": "The COAS stated this on Tuesday while declaring open the Senior Command and Leadership Seminar organised by the Department of Army Training at the Headquarters 3 Division Nigerian Army, Jos.\nThe three-day seminar was designed for Nigerian Army General Officers Commanding (GOC) and Brigade Commanders, both current and prospective.\nGeneral Yahaya thanked President Muhammadu Buhari, the Nigerian Army’s Commander in Chief, for his unwavering support and strategic leadership in carrying out the Nigerian Army’s constitutional responsibilities.\nIn another development, the COAS today commissioned Transit Accommodation and Officers’ Mess facilities undertaken by GOC 3 Division Maj Gen Ibrahim Ali at the Maxwell Khobe Cantonment, Jos.\nAccording to the GOC, the completed projects will serve to alleviate the dearth of accommodation and provide recreational opportunities for personnel in the Cantonment."
  },
  {
    "headline": "Putin Wants ‘Unfriendly’ Countries to Pay for Russian Gas in Roubles",
    "summarized_story": "Russia will seek payment in roubles for gas sales from “unfriendly” countries, President Vladimir Putin said on Wednesday, sending European gas prices soaring on concerns the move would exacerbate the region’s energy crunch.\nWith major banks reluctant to trade in Russian assets, some big Russian gas buyers in the European Union were not immediately able to clarify how they might pay for gas going forward.\nBut unlike the United States and Britain, EU states have not agreed to sanction Russia’s energy sector, given their dependency.\nThe list of countries includes the United States, European Union member states, Britain, Japan, Canada, Norway, Singapore, South Korea, Switzerland and Ukraine.\nSome of these countries, including the United States and Norway, do not purchase Russian gas."
  },
  {
    "headline": "Commissioning Of New Lagos Airport Terminal – Full Coverage",
    "summarized_story": "1 of 4 - +President Muhammadu Buhari, commissions the International wing of the Murtala Mohammed International Airport, MMA 2.\nThe President in his address says the Airport reflects his administrations commitment to deliver state of the art infrastructure to meet the needs of Nigerians and further develop its economy."
  },
  {
    "headline": "Buhari Lauds Dangote As The 2nd Largest Employer Of Labour After FG -Trending With Ojy Okpe",
    "summarized_story": "Nigerians have reacted to president Muhammadu Buhari’s Visit to Lagos to inaugurate the newly built Airport terminal at the Murtala Muhammed International Airport and the multi-billion dollar Dangote Fertiliser Plant touted the largest in Africa and the second-largest urea plant in the world.\nBetta Edu the Commissioner for Health in Cross River state has been trending on social media after she acknowledged that some of her posts on Twitter during the #EndSARS protest may have been indelicate."
  },
  {
    "headline": "Nigerian Lawmakers Lambast Power Minister Over Grid Collapse",
    "summarized_story": "This, he said had led to the collapse of the national grid and as well what the ministry was doing to salvage the situation.\n“It may be recalled that Nigerians whom we represent experience one of the worst moment of electricity supply across the country.\n“It has caused collapse of small businesses whose operations depend on stable electricity supply.\nThe situation has also aggravated increased process in commodities and services especially those that require electricity supply.\n“The overheated socio-economic environment due to very poor electricity supply attracted huge public outcry for immediate solutions, especially given the contractual nature of provision of power and energy services in the post privatization era by the Nigerian Power Supply Industry."
  },
  {
    "headline": "World Bank: Deep Structural Reforms Urgently Needed to Lift Millions of Nigerians Out of Poverty",
    "summarized_story": "The World Bank has identified sluggish growth, low human capital, labor market weaknesses and exposure to shocks as factors holding Nigeria’s poverty reduction back.\nThe Washington-based institution stated this in its latest report titled: “A Better Future for All Nigerians: Nigeria Poverty Assessment 2022,” obtained Tuesday.\nThe report represented the culmination of the World Bank’s engagement on poverty- and inequality-relevant data and analytics in Nigeria in the past two years.\nThe surveys were implemented by Nigeria’s National Bureau of Statistics (NBS) in collaboration with the World Bank.\nBy investing in data, Nigeria could build trust, accountability, and transparency, taking substantial strides on its pathway to poverty reduction."
  }
]