[
  {
    "headline": "Naira will fall from N570/$1 to N400/$1 at black market if… – CBN ex-deputy gov, Moghalu",
    "summarized_story": "Moghalu had deputised Sanusi Lamido Sanusi, who was CBN Governor from June 2009 to February 2014.\n), and the CBN Governor, Godwin Emefiele.\nThe downward trend of the naira had fueled calls for the sacking or resignation of the CBN Governor, Godwin Emefiele, by some political groups including the Peoples Democratic Party.\nThey blamed Emefiele, who has been CBN governor since June 2014, for poor monetary policies.\nThe CBN ex-deputy governor, however, lamented that the CBN has lost its autonomy to the political class and has little or no investors’ confidence."
  },
  {
    "headline": "BREAKING: Protest hits Bayelsa over youth’s death in police custody",
    "summarized_story": "Angry youths from the Epie and Atissa Kingdoms in the Yenagoa Local Government Area of Bayelsa State are currently protesting in Yenagoa, the state capital, over the death of their colleagues from the Biogbolo-Epie community.\nThe male victim, Goodluck Oviekeme Izigwe, was said to have died in police custody.\nProtesting the death of Izigwe, the youths on Saturday blocked the Biogbolo-Epie section of the Mbiama-Yenagoa Road and the Isaac Boro Expressway with canopies, tyres and sticks, stopping vehicular movement.\nDetails later…"
  },
  {
    "headline": "Man arrested for allegedly killing his brother for rituals in Kwara",
    "summarized_story": "The Kwara State Command of the Nigeria Security and Civil Defence Corps (NSCDC), has arrested one lsmail Saliu, 25, for allegedly conspiring with a herbalist and one other, to slaughter his brother.\nThe NSCDC Command Spokesman in Kwara, Mr Babawale Afolabi, disclosed this in a statement on Saturday, in Ilorin.\nThe spokesman said that investigations revealed, that the suspects lured the victim to the farm, where he was gruesomely murdered by his own brother, lsmail Saliu.\nHe said that the suspect and his accomplices, were later arrested by operatives of the NSCDC on their way back from the farm.\nAfolabi said that the prime suspect and brother to the deceased, confessed to have personally slaughtered his brother with the help of the herbalist and one other person."
  },
  {
    "headline": "2023: Southern Govs goofed on rotation, North-Central must produce next President — Group",
    "summarized_story": "Bello as most suitable candidateBy Boluwaji Obahopo, LOKOJAA Pro-North Group, Congress for Better Nigeria (CBN) has berated the Southern governors over their insistence on power returning to the southern zone in 2023.\nThe group described the demands of the Southern governors as illogical as it does not conform to the principle of equity, fairness and justice upon which Nigeria is built.\nThe group who made the assertion on Saturday in Lokoja noted that the North should still retain the presidency, with the North Central best placed.\nThey equally identified Governor Yahaya Bello of Kogi State as the most preferred and qualified candidate from the North Central Zone; said the governor has all it takes to lead Nigeria to the dreamland.\n“We add that his Youth and women empowerment records in Nigeria remain unrivalled.”The group however called on political stakeholders in the North Central to supports their position on securing the presidency to the zone."
  },
  {
    "headline": "I’m proud of Gov Emmanuel’s six years achievements in infrastructure — Osinbajo",
    "summarized_story": "” I am very proud of what my brother has achieved in the six years of his stewardship as the governor of this state, especially with his industrialization agenda.\n“As you are aware, since the inception of our administration Mr President has prioritised the development of Infrastructure.\nAnd despite the severe economic headwind we experienced in the past six years we have invested more than any administration on infrastructure.\nAt the end of last year the Council also approved the Full business case for the Ibom Deep seaport”, Osinbajo disclosed.\nWhat I am doing is to move Akwa Ibom forward."
  },
  {
    "headline": "NIS CG orders clearance of backlog of passport applications in Ikoyi",
    "summarized_story": "Mr Idris Jere, acting Comptroller-General, Nigeria Immigration Setvice (NIS) has ordered its Special Task Force Team to clear backlog of passport applications in Ikoyi, Lagos State.\nJere directed the taskforce to proceed to the Ikoyi Passport Office to ensure all existing backlog of Passport applications were cleared within one week.\nIt would be recalled that upon assumption in office, the acting C-G had promised to deepen the Passport issuance reform efforts, to ensure seamless Passport issuance processes across the issuing centres.\nThe acting C-G, however, assured applicants who had been enrolled into the Passport system in Ikoyi that the team had commenced issuance of notifications for collection to applicants whose Passports were ready.\nThe NIS boss further appealed to prospective Passport applicants to endeavour to visit the Service’7s website immigration.gov.ng to apply and make payments for the Passport categories of their choice."
  },
  {
    "headline": "2023: Nigeria has adequate ICT Infrastructure for e-Transmission of election results — INEC insists",
    "summarized_story": "“The Independent National Electoral Commission INEC believes that it has developed adequate structures and processes to successfully transmit election results electronically.\nThe controversy has revolved around the readiness of INEC and the capacity of national infrastructure for transmitting election results electronically.\nIt is worthy of note that none of the sides in this controversy appears to substantially question the desirability of electronic transmission of election results.\n“Based on the foregoing, INEC is convinced that the nation has the infrastructure to implement the electronic transmission of election results.\nTherefore, there is no connection between any imagined issues with the SCR and the electronic transmission of election results."
  },
  {
    "headline": "INEC explains why names of dead Nigerians still appear on voter register",
    "summarized_story": "Prof. Mahmood Yakubu, the Chairman of the Independent National Electoral Commission, INEC, has explained why names of dead Nigerians are still on the voter register.\nYakubu said the inability of INEC to get adequate data on death in Nigeria has hampered it from taking away names of dead Nigerians from its register.\nHe stated this when he received Nasir Kwara, the Chairman of the National Population Commission, at the headquarters of the commission on Friday in Abuja.\n“We appreciate that this is a herculean task but that’s partly why we have the National Population Commission.\n“This information is critical for INEC to enhance the credibility of the National Register of Voters”."
  },
  {
    "headline": "Jigawa govt loses N2.5bn monthly to ghost workers",
    "summarized_story": "Jigawa State Government is losing N2.5b monthly to ghost workers in the state and local government civil service.\nThis was contained in a report of the State Workers Verification Committee headed by Surajo Kantoga member representing Birnin Kudu constituency in the state House of Assembly.\nPresenting the committee’s report to the ALGON Chairman, Bala Usman Chamo on Friday said the state was losing over N2.5b monthly in the payment of identified ghost workers of state and local government in the state.\nKantoga said the affected workers are teachers and local government staff across the 27 local Governments.\n“The committee during its exercise discovered that about 84 ghost workers, about 41 teachers lack competency and approved teaching qualification."
  },
  {
    "headline": "ISWAP allegedly kills 12 soldiers, vigilantes in Borno ambush",
    "summarized_story": "Islamic State of West Africa Province (ISWAP) have killed at least twelve Nigerian soldiers and local vigilantes in Borno.\nThe terrorists buried improvised explosive devices(IED) on the road a military convoy travelling to Maiduguri from Marte would pass.\nThe motorcade was escorting soldiers that were granted leave to pass from the Marte unit.\nAs one of their vehicles came in contact with the IED, the terrorists hiding around opened fire.\nThe attack occurred the same day troops repelled ISWAP at a military base in Malam Fatori in Borno and Babangida community in Yobe."
  },
  {
    "headline": "Killing, kidnapping of teachers threaten education in Nigeria – ASUSS",
    "summarized_story": "The Academic Staff Union of Secondary Schools(ASUSS), has expressed regret over incessant killings, kidnappings and harassment of teachers and students across the country, saying the sordid scenarios were affecting the teachers’ productivities adversely.\nDespite the situation, ASUSS lauded the Governor of Kaduna State, Mallam Nasir El-Rufai, for employing 7,600 teachers, commending Kano and Adamawa, for legislating on extension members’ retirement to 65 years.\nThe communique reads: “We appreciate the governor of Kaduna State, Mallam Nasir el-Rufai, for the recruitment of 7,600 teachers into its 9,000 Secondary School Tutors.\n“We commend the government of Kano State for redeploying 11,000 trained teachers in its MDAs to schools to boost teaching and learning.\nIn spite of the above incentives to teaching, ASUSS frowned at the insecurity across the country, particularly, incessant attacks on schools, leading to the killing and kidnapping of teachers and students for ransoms."
  },
  {
    "headline": "Imo will benefit from Buhari’s visit – Deputy Speaker",
    "summarized_story": "The Deputy Speaker of the Imo State House of Assembly, Amara Iwuanyanwu, has said the state will benefit from the recent visit of President Muhammadu Buhari.\nIwuanyanwu said Buhari’s visit to Imo State would help the President identify where he can assist.\nHe said: “The benefits of the presidential visit will be immense and beneficial for Imo.\n“Days after he left Imo, the state visit of President Muhammadu Buhari is still a trending topic in the state.\n“This presidential visit is epochal in different dimensions.”Buhari had on September 9 visited Imo State, where he commissioned some projects."
  },
  {
    "headline": "Masari seeks security agencies’ support for vigilantes in Katsina",
    "summarized_story": "By Augustine Okezie, KatsinaKatsina Governor Aminu Bello Masari has decried the lack of support for vigilante groups and hunters by security agencies in the State.\nHe lamented the Army and Police were not supportive enough of the recruitment and deployment of vigilantes and hunters by the State Government to combat banditry in forests and the rural communities.\nHe said: ’The attitude of the Military and the Police towards the recruitment, training and deployment of the vigilantes particularly in the rural communities, is undermining the fight against banditry in the State.\nREAD ALSO: Masari’s candor‘’The uncooperative and non- support of these agencies to the vigilantes is disturbing.\nHe expressed concerns that the retreating bandits are trooping into the villagers to steal harvests and other farm products as the harvest season is fast approaching."
  },
  {
    "headline": "Only 907 of 14,021 exited N-Power volunteers received stipends – Beneficiaries",
    "summarized_story": "- Advertisement -Some exited volunteers of the N-Power scheme have accused the Federal Government of paying just 907 of 14,021 their outstanding stipends.\nThe former volunteers, according to a statement by their spokesperson, Comrade Ridwan, claimed they were owed five months outstanding allowance by the Federal Ministry of Humanitarian Affairs, Disaster Management and Social Development.\nRidwan lamented their reality was in contrast to the 9,066 figure released by the Ministry last Friday.\nRidwan said: “We were shocked and bewildered and perturbed to have noticed that, the purported payment was made to only 907, which is just 6% of all the affected Beneficiaries and not to 9,066 verified accounts of the Beneficiaries, as claimed by the Ministry in its press release.\nThe delay in the payment of our outstanding stipends, has left majority of us in untold hardships”The beneficiaries, however, called on the Minister Sadiya Umar Farouq to look into the complaint and effect the payment of remaining 13,411 of the beneficiaries’ verified accounts."
  },
  {
    "headline": "Florida Gov. appoints Nigerian-American, Joseph Ladapo Surgeon-General",
    "summarized_story": "Agency ReporterRon DeSantis, Florida Governor, U.S. has appointed a Nigerian-American, Dr Joseph Ladapo, as Florida Surgeon-General and Secretary of the Department of Health.\nDeSantis in a statement posted on the Florida Department of Health website, stated that he was pleased to announce Ladapo for the position.\n“Ladapo has impeccable credentials and a strong vision to effectively serve the people of Florida at the helm of our public health agency.\nLadapo said he is honored to have been chosen by DeSantis to serve as Florida’s next surgeon-general.\n“We must make health policy decisions rooted in data and not in fear."
  },
  {
    "headline": "Power rotation: Southern leaders, MBF slam Northern elders",
    "summarized_story": "Pan Yoruba socio-cultural political organisation, Afenifere, said the Northern elders were like a drowning ship clinging to whatever it could.\nPresident, Middle Belt Forum, Dr Bitrus Porgu said power shift is an arrangement by political parties, not that of northern elders.\n“It is not for northern elders to determine what happens in PDP, APC or any political party for that matter.\nChairman, Alaigbo Development Foundation (ADF), Abia Onyike said the northern elders were daydreaming.\nAccording to him, Southern Nigeria is more united than ever; and will vehemently resist any attempt to impose a Northern President on Nigerians come 2023."
  },
  {
    "headline": "Buhari at UN calls for term limits for African leaders",
    "summarized_story": "From Juliana Taiwo-Obalonye, New YorkPresident Muhammadu Buhari has told world leaders at the 76th Session of the high-level General Debate of the UN General Assembly at the UN headquarters in New York on Friday, to set term limits especially for African leaders.\nPresident Buhari stressed that the recent trend of unconstitutional takeover of power on the continent must not be tolerated by the international community.\n“This will facilitate the achievement of the 2030 Agenda for Sustainable Development and the African Union Agenda 2063.\n“Nigeria fully supports the efforts by ECOWAS to address this growing challenge and appreciates the support of both the African Union and the United Nations.\n“In this regard, I would like to reiterate that as leaders of our individual member-states we need to adhere to the constitutional provisions of our countries, particularly on term limits."
  },
  {
    "headline": "Achike Udenwa: If you kill Nnamdi Kanu, another will rise",
    "summarized_story": "Former Imo State governor, Chief Achike Udenwa has said only a political solution could resolve the IPOB and Nnamdi Kanu issue, noting that legal options wouldn’t go anywhere.\nHow do we tackle this Nnamdi Kanu phenomenon because it is what gave birth to this sit-at-home and other things happening in the South-East.\nCuriously, South-East governors are behind, while South-West and South-South are the ones driving it.\nThese are basic issues, so why our governors don’t want to get involved is what I cannot say.\nThey have held three meetings and we have South-East governors who have not attended any."
  },
  {
    "headline": "Anti-open grazing: Southern groups attack El-Rufai",
    "summarized_story": "Gov El Rufai talked about open grazing no longer being sustainable and said he is constructing ranches and at the same time he is saying that the anti-open grazing law signed by his southern counterparts is not implementable.\nThe Southern governors have come together against him and his co-traitors in the country and that is what matters.\nPresident of the Middle Belt Forum (MBF), Dr Bitrus Pogu said the submission of Gov El Rufai on the anti-open grazing law was unfounded.\nHe said: “Enforcement of the anti-open grazing law is based on determination.\nIf Gov Samuel Ortom is able to implement anti-open grazing law in Benue State, then it is implementable."
  },
  {
    "headline": "Love, sacrifices keeping our marriage going – JJC Skillz, Funke Akindele’s husband",
    "summarized_story": "Songwriter, rapper and producer, Abdulrasheed Bello popular known as JJC Skillz, is happily married to star actress, Funke Akindele.\nIn an encounter with Saturday Sun, JJC Skillz reveals what keeps their marriage strong despite several breakups being witnessed in the industry.\n“No special secret to our union than love and sacrifices.\nIt is lovely and we hope it inspires more people to believe in love and work to keep God’s union.\nFor those experiencing marital challenges, my advice to them is to love your spouse like your siblings or parents."
  },
  {
    "headline": "At UNGA, Buhari Says Boko Haram, Though Weakened, Still Preying on Soft Targets",
    "summarized_story": "President Buhari said: “Mr.\nIn Nigeria, Boko Haram terrorist group, though fragmented by internal strife and weakened by our defence forces, is still active and preying on soft targets.\n“My country and indeed all African countries do not intend to stay indefinitely looking for aid.\nHe also flayed the recent reversal of democratic fortunes in some West African nations including Guinea, Mali and Chad.\nThe UN scribe also commended Buhari for his leadership roles in Africa as well as stabilisation of the West African sub-region."
  },
  {
    "headline": "Continue VAT Collection in all States, Finance Minister Directs FIRS",
    "summarized_story": "Following the Appeal Court ruling, the Organised Private Sector of Nigeria (OPSN), became confused, and desperately called on the federal government to clear the confusion.\nApparently in reaction, the Minister of Finance, in a newspaper advertorial on Thursday, stated the position of the federal government on the rulings, directing the FIRS to continue the collection.\nThe minister stated: “The tax-paying public has been confused about whom to pay VAT to as a result of the Federal High Court’s judgement in Suit No.\nAs such, FIRS shall continue to administer VAT in all the states of the federation unless the appellate court rules otherwise.\n“The ruling of the Court of Appeal, therefore, implores all taxpayers in all the states to continue to pay their VAT, and for the FIRS to continue to collect VAT on behalf of the government in compliance with the VAT Act."
  },
  {
    "headline": "Oil Price Nears Three-year High, Trades at $78.09 a Barrel",
    "summarized_story": "The global output disruptions forced energy companies to pull large amounts of crude out of inventories.\nBrent futures eventually sold at $78.09 a barrel, while U.S. West Texas Intermediate (WTI) crude sold at $73.98 yesterday evening.\nAnalysts at UBS told Reuters that Brent oil price could hit $80 a barrel by the end of September due to stock draws, lower OPEC production and stronger demand in the Middle East.\nThe rise in crude oil price means an increase in revenue for Nigeria but a headache for the country’s subsidy shortfall payments.\nRecently, Mele Kyari, Group Managing Director of the Nigerian National Petroleum Corporation (NNPC), said the supply crisis affecting the natural gas market might push crude oil prices up by $10 a barrel."
  },
  {
    "headline": "Ahead of 61st Independence Anniversary, FG Issues Security Warning",
    "summarized_story": "Olawale Ajimotokan in AbujaThe federal government has alerted the general public to heightened security activities, preparatory to the events marking the country’s 61st Independence anniversary.\nThe Minister of Information and Culture, Alhaji Lai Mohammed, issued the security alert in a statement in Abuja yesterday.\nThe alert was issued on the same day the federal government unveiled programme of activities lined up to mark the 61st Independence anniversary celebration.\nThe Independence Anniversary Parade holds at the Eagle Square on October 1.\nThe events will climax with a Special Jummat Service at the National Mosque also on October 1."
  },
  {
    "headline": "UN Secretary General Urges Buhari to Ensure Stability Of West Africa",
    "summarized_story": "He also flayed the recent reversal of democratic fortunes in some West African nations including Guinea, Mali and Chad.\nIn a statement issued by the Media Adviser to the President, Femi Adesina, the UN scribe commended President Buhari for his leadership roles in Africa as well as stabilization of the West African sub-region.\nThe Secretary General spoke Friday at a meeting with the Nigerian President at the sidelines of the 76th Session of the United Nations General Assembly taking place in New York.\nIn his remarks, President Buhari applauded Gutterres for his global leadership and the success of the 76th Session.\nPresident Buhari added that Nigeria was ready to support and work closely with the United Nations towards achieving the Sustainable Development Goals."
  },
  {
    "headline": "EXPOSED: How Bribes Paid By Foreign Contractors For Nigeria Oil Were Used To Fund Buhari's 2019 Elections",
    "summarized_story": "Some bribes paid to secure oil contracts from the Nigerian National Petroleum Corporation (NNPC) were pocketed by political cronies to fund the 2019 elections under the Muhammadu Buhari regime, according to Bloomberg.\nIn a report, the news medium highlighted how foreign contractors paid their way through to secure contracts.\nAccording to Bloomberg, the bribes paid to win oil contracts were used to fund the 2019 general elections.\nThe 2019 elections were dominated by the All Progressives Congress (APC) and the Peoples Democratic Party (PDP).\nThe illegality of pumping bribes from oil contracts into election did not just happen in 2019, according to the report."
  },
  {
    "headline": "EXPOSED: How Bribes Paid By Foreign Contractors For Nigeria Oil Were Used To Fund Buhari's 2019 Elections",
    "summarized_story": "Some bribes paid to secure oil contracts from the Nigerian National Petroleum Corporation (NNPC) were pocketed by political cronies to fund the 2019 elections under the Muhammadu Buhari regime, according to Bloomberg.\nIn a report, the news medium highlighted how foreign contractors paid their way through to secure contracts.\nAccording to Bloomberg, the bribes paid to win oil contracts were used to fund the 2019 general elections.\nThe 2019 elections were dominated by the All Progressives Congress (APC) and the Peoples Democratic Party (PDP).\nThe illegality of pumping bribes from oil contracts into election did not just happen in 2019, according to the report."
  },
  {
    "headline": "EXPOSED: How Nigerian Government Gave Indicted Cocaine Trafficker Multi-million Dollar Contract To Supply Passports To Citizens",
    "summarized_story": "This report exposes the rot, racketeering, ethnic nepotism, complete failure of due diligence, and how an indicted cocaine trafficker has come to control the supply of passports to Nigerian citizens.\n“We acknowledge and apologise for the challenges faced in the past few weeks regarding passport booklets availability.\nFrom when he made these pronouncements until his retirement earlier this month, passport booklets continued to be a scarce and expensive commodity in Nigeria.\nHe didn’t really care about fixing any systemic issues like staff motivation or the ISTL contract.\nISTL does not actually produce passport booklets, but sub-contracts production to the Malaysian firm Iris Corp."
  },
  {
    "headline": "EXPOSED: How Nigerian Government Gave Indicted Cocaine Trafficker Multi-million Dollar Contract To Supply Passports To Citizens",
    "summarized_story": "This report exposes the rot, racketeering, ethnic nepotism, complete failure of due diligence, and how an indicted cocaine trafficker has come to control the supply of passports to Nigerian citizens.\n“We acknowledge and apologise for the challenges faced in the past few weeks regarding passport booklets availability.\nFrom when he made these pronouncements until his retirement earlier this month, passport booklets continued to be a scarce and expensive commodity in Nigeria.\nHe didn’t really care about fixing any systemic issues like staff motivation or the ISTL contract.\nISTL does not actually produce passport booklets, but sub-contracts production to the Malaysian firm Iris Corp."
  },
  {
    "headline": "Ondo University Senate Should Be Fired For ‘Indecent Reasoning’ – Sowore Lambasts Draconian Policy On ‘Indecent Dressing’ Imposed On Students",
    "summarized_story": "Zilch!”He further stated that Nigerian university senate members have produced rigged elections results without achieving academic breakthroughs.\nHis post reads, “This bizarre, backward and belligerently insane memo emanated from a Nigerian University, to be specific, this nonsense, was released from Adekunle Ajasin University in ONDO state.\nHow on earth do you RUSTICATE a student for one semester for INDECENT dressing?\n“Every member of that University Senate who signed up to this rubbish should be fired for indecent reasoning!\nThese jobless Senate at Adekunle Ajasin University in Ondo state ought to be disowned, dissolved and disbanded with immediate effect."
  },
  {
    "headline": "Sanusi: Nigeria needs a knowledge-based economy to overcome poverty",
    "summarized_story": "Muhammadu Sanusi II, former Emir of Kano, says the country must have a knowledge-based economy to overcome poverty.\n“You have countries and their per capita GDP, you have resource countries and knowledge economies.\nAdvertisement“Look at rich countries like Saudi Arabia, look at Kuwait, we consider these very rich countries and that’s where they are on capita GDP.\nNow compare Saudi Arabia to Singapore or to Finland or Switzerland or the US.\n“We all think Saudi Arabia is richer than UAE but look at the per capita income."
  },
  {
    "headline": "Sanusi: Nigeria needs a knowledge-based economy to overcome poverty",
    "summarized_story": "Muhammadu Sanusi II, former Emir of Kano, says the country must have a knowledge-based economy to overcome poverty.\n“You have countries and their per capita GDP, you have resource countries and knowledge economies.\nAdvertisement“Look at rich countries like Saudi Arabia, look at Kuwait, we consider these very rich countries and that’s where they are on capita GDP.\nNow compare Saudi Arabia to Singapore or to Finland or Switzerland or the US.\n“We all think Saudi Arabia is richer than UAE but look at the per capita income."
  },
  {
    "headline": "SPOTLIGHT: Stanley Oyor, the design guru who defied disability to become successful businessman",
    "summarized_story": "AdvertisementDespite the social barriers against people living with disabilities (PWDs), Stanley Oyor, a physically-challenged artist and businessman, committed himself to breaking the glass ceiling.\nOyor, a graduate of fine and applied arts, started a graphics design and printing business in 2014 which has blossomed.\nLike many other PWDs, Oyor has been body-shamed, but he says he draws strength from such attacks rather than slump into self-pity.\nIn this interview, Oyor talks about rising beyond the average, drawing inspiration from his mentor, finding love despite several rejections, and operating his business.\nSpeaking on finding love, Oyor said it was not easy to find love as a physically-challenged person."
  },
  {
    "headline": "SPOTLIGHT: Stanley Oyor, the design guru who defied disability to become successful businessman",
    "summarized_story": "AdvertisementDespite the social barriers against people living with disabilities (PWDs), Stanley Oyor, a physically-challenged artist and businessman, committed himself to breaking the glass ceiling.\nOyor, a graduate of fine and applied arts, started a graphics design and printing business in 2014 which has blossomed.\nLike many other PWDs, Oyor has been body-shamed, but he says he draws strength from such attacks rather than slump into self-pity.\nIn this interview, Oyor talks about rising beyond the average, drawing inspiration from his mentor, finding love despite several rejections, and operating his business.\nSpeaking on finding love, Oyor said it was not easy to find love as a physically-challenged person."
  },
  {
    "headline": "Buhari: Nigeria would have been in serious trouble if land borders had not been closed",
    "summarized_story": "President Muhammadu Buhari says Nigeria would have been in serious trouble if the land borders had not been closed.\nAdvertisementThe federal government in August 2019 ordered a closure of the country’s land borders over illegal importation of drugs, arms and agricultural products into Nigeria from neighbouring West African countries.\nIn December 2020, Buhari ordered the reopening of four land borders.\nMonths after the reopening, the president expressed concern that the closure of the borders failed to stop arms smuggling into Nigeria.\nHe said if that had not been done “we would have been in serious trouble."
  },
  {
    "headline": "ChatBots Africa, Fashtracker win pitch sessions at TechCabal’s ‘Future of Commerce’",
    "summarized_story": "ChatBots Africa and Fashtracker have been announced as winners of the partnership and investment pitch sessions, respectively, organised by TechCabal as part of the ‘Future of Commerce’ conference.\nHeld on Friday, 24th of September, the partnership pitch session saw a total of three growth-stage startups pitch to corporate organizations for potential partnerships while the investment version involved four early-stage startups pitching to potential investors.\n“For my team and I, winning at the pitching session validates our vision for the future of e-commerce in Africa, that is, conversational and social commerce,” Ronald Tagoe, Founder of ChatBots Africa, told TechCabal.\nNigeria-based Fashtracker connects trusted and sustainable African fashion brands to people within and outside the continent through its online platform.\n“Especially during such tough times in Nigeria – economic prosperity is key.”A screenshot of ChatBots Africa website."
  },
  {
    "headline": "What will commerce look like in Africa over the next decade?",
    "summarized_story": "With Covid-19 restrictions forcing more people to shop online, e-commerce companies and platforms on the continent have enjoyed a surge in activity.\nThis is provided e-commerce platforms continue to solve problems consumers face and offer more suites of offerings.\nAccording to Nkebet Mesele, Senior Director for Solutions Management in sub-Saharan Africa at Visa, that entails making commerce in Africa “mobile-led”.\n“For commerce to grow across Africa, the building blocks that have to be in place are first, it has to be mobile-led.\n“But it starts with building solutions for people on the ground.”If you enjoyed reading this article, please share it in your WhatsApp groups and Telegram channels."
  },
  {
    "headline": "Phishing scams are becoming more prevalent in African countries",
    "summarized_story": "Phishing is one of the oldest internet scams, dating back to the ‘90s, and perhaps remains one of the most prevalent cybercrimes.\nBut one thing phishing emails have in common with other forms of cyberattack is that every phishing email comes with a call to action that prompts recipients to download a link or file.\nPhishing attacks are prevalent in the continents and individuals and businesses across Africa have fallen victims to phishing scams.\nOver a million phishing attacks were recorded in South Africa in the first half of 2021.\nThat’s a combination of over two million attacks in the first half of the year from the three biggest African markets."
  },
  {
    "headline": "ARM collaborates with TechCabal on the Future of Commerce partnership pitch session",
    "summarized_story": "As part of the sessions, TechCabal will organize two strategic workshops – a partnership pitch session where growth-stage startups can pitch to corporate organizations for potential partnerships, and an investment pitch session where early-stage startups can pitch to potential investors.\nAsset & Resource Management Holding Company Limited (ARM), a provider of global asset management services across a wide range of traditional and alternative investment options, has partnered with TechCabal on the partnership pitch session.\nIna Alogwu, Group Director of Digital Transformation at ARM Group will be speaking at the session.\nAt ARM, he oversees the execution of the Group’s digital transformation strategy, helping the seven subsidiary companies in the Group drive their digital initiatives.\nSpeaking about the event, Olanrewaju Odunowo, Head of TechCabal Insights said, “The COVID-19 pandemic has changed the face of commerce."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "How edtech startup, Stranerd is connecting Nigerian students to tutors",
    "summarized_story": "On the supply side, there are more students or prospective students than there are schools.\nSource: SuppliedOn the website, which currently serves mainly Nigerian students, the startup employs a coin system to charge students.\nThe goal, Godwin says, is to become a one-stop-shop for the Nigerian student’s educational needs and possibly African students also.\nThey also want to include connecting students to internships as well as providing study-abroad services to students.\nBut first, the startup plans to build trust among the students before leveraging it to add more services."
  },
  {
    "headline": "Hearing impairments and technology, ReelFruit’s $3m raise, Apple Pay on Paystack",
    "summarized_story": "Today I’m discussing:Living with hearing impairments in a tech-enabled worldRealFruit’s $3 million Series APaystack launching Apple Pay to help Nigerian businessesLiving with hearing impairments in a tech-enabled worldWeYesterday, Thursday, September 23, 2021, was the International Day of Sign Languages.\nPaystack launches Apple Pay to help Nigerian businessesPaystack, an African fintech company that powers and processes payments for businesses, announced yesterday that Pay with Apple Pay is now available on its platform.\nNigerian businesses will have access to millions of Apple Pay users across more than 60 countries where the payments service is available.\nWhen a customer with Apple Pay buys from a Paystack merchant, they will see the option to checkout using Pay with Apple Pay.\nFlutterwave, an African payments company, integrated PayPal into its platform in March 2021, allowing PayPal customers worldwide to pay African merchants via its “Pay with PayPal” feature."
  },
  {
    "headline": "What does communication in a techy world mean for Nigeria’s deaf people?",
    "summarized_story": "#WeSignForHumanRightsNigeria’s deaf communityWeAccording to Oluwaseun Sosanya, a sign language interpreter, tutor, and deaf advocate, the deaf community “is a collection of people that share the same idea, belief, and culture, and use sign language to communicate.\n“The community includes the two categories of deaf — pre-lingual and post-lingual deaf — parents of the deaf, sign language interpreters, and all users of sign language.\nSignFor the African deaf community, the prevalent sign language is the American Sign Language (ASL) which Andrew Foster — regarded as the Father of Deaf Education in Africa — brought into the continent.\nMobile apps that provide sign language tutoring for beginners, such as the ASL American Sign Language and the Ghanian Sign Language app.\nThe deaf community believed it to be more accommodating of the hearing community without regard to the deaf people — who it was purporting to help."
  },
  {
    "headline": "BP, Glencore suits allege role of oil bribe money in Nigeria’s 2015, 2019 elections",
    "summarized_story": "Newly opened lawsuits in London and New York have shed light on how bribe that trading firms paid agents to win oil contracts from Nigeria’s state oil company may have raised funds for the country’s past two elections in 2015 and 2019.\nA spokesman for the NNPC didn’t respond to three calls and three text messages seeking comment.\nThe company then wired $900,000 in fees to a local agent after securing two oil cargoes from NNPC, he said.\nSimilar details emerged two months ago, when Anthony Stimler, who left Glencore in 2019, pleaded guilty to corruption and money-laundering charges.\nHer party, the People’s Democratic Party (PDP), lost the elections in March 2015 to Buhari’s APC."
  },
  {
    "headline": "Netflix reviews for weekender weeks 5",
    "summarized_story": "“Smart Money Woman”Now trending as no 1 on Netflix, the amazing movie produced by “Arese Ugwu” is one that would be worth every bit of your time.\nIt is a very educative series one I am sure you would learn a thing or two make sure you check it out.\nThe movie was directed by Steve Gukas and it feature Bimbo Akintola, Danny Glover, Somikele Idhalama and many more.\nRead also: Netflix reviews for Weekender Week 4“Kate”The 106 minutes thriller/adventure movie featured Mary Elizabeth Winstead “Kate” as the lead actress, she was brutal and was very good at her job, she could take down anyone from any angle and not miss a shot.\nThe fun trip became a survival game as they had become preys to this deadly shooter, who hardly missed the shots."
  },
  {
    "headline": "A new guide to smart investing",
    "summarized_story": "Improving issues around gender equality will significantly improve the conditions of economic development.\nInvesting in women is not just a moral and social decision but is simply smart investing.\nEvery investor wants to invest their time and resources in a good investment, and that is exactly what most female entrepreneurs are.\nWith the growing population and increasing lack of jobs in Nigeria, we must put our full weight behind supporting female entrepreneurs.\nWe therefore must continue to advocate for the allocation of more capital to initiatives that support female entrepreneurs and most especially the female entrepreneurs themselves who require capital to start, grow and scale their enterprises."
  },
  {
    "headline": "Obaseki felicitates with Ogie on birthday – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has felicitated with the Secretary to the State Government, Osarodion Ogie Esq., on his birthday.\nThe governor, in a statement, described Ogie as a kindhearted, meek and trustworthy brother and friend, who has distinguished himself in life and his chosen career path as a lawyer.\nAccording to him, “I felicitate with Secretary to the State Government, Osarodion Ogie Esq., as he adds another year today.\n“He is a true brother and friend, who has shown uncommon commitment to the development and progress of our state.\n“As you add another year today, I wish you many more years in good health."
  },
  {
    "headline": "Eschew Provocative Utterances, Okonjo-Iweala’s Brother Tells Ogwashi-Uku Indigenes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – The Obi of Ogwashi-Uku Kingdom, HRM Obi Ifechukwude Aninshi Okonjo II, Aniocha South Local Government Area of Delta State, has sued for peace and neighborliness among Ogwashi-Uku Indigenes.\nThe Obi appealed to his neighbouring communities to eschew provocative utterances and misrepresentation of facts over which kingdom Otulu community belongs.\n“So, from a historical, geographic and political point of view, Otulu Ogwashi-Uku is and will remain part of Ogwashi-Uku Kingdom.\n“We are aware that some communities are rushing to make claims about Otulu Ogwashi-Uku in light of the unfortunate incident which happened last week.\n“We know the history and relationship between our Azagba Ogwashi-Uku Community and Issele Azagba."
  },
  {
    "headline": "Edo Jailbreak: Fugitive bathe PUWOV officials with faeces, arrested in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOfficials of the Public Works Volunteers (PUWOV) in Edo State, headed Mukhtar Yusuf-Osagie, in collaboration with other security agencies in the state have arrested one Chinedu Ogu, a fugitive who escaped from maximum-security prison at Oko, Benin City, during the #EndSARS protest that rocked the country last year.\nOgu, who was in prison for murder charges, was among the 1,993 inmates who escaped from the two correctional centres in the state on October 19, 2020.\nNarrating the incident, the coordinator stated: “The officials of PUWOV accosted a commercial motorist who contravened the law, and in a bid to resist arrest and incite passersby against the officials, he went nude at the scene of offence.\nHe passed out faeces and used the faeces to bathe the PUWOV officials at the scene.\n“Luckily, PUWOV officials apprehended him and in the process, it was discovered that he is a fugitive."
  },
  {
    "headline": "COVID-19 3rd wave: Edo urges vaccination as mortalities reach 71, infections climb to 1,423 – Nigerian Observer",
    "summarized_story": "Head of the State’s COVID-19 Case Management, Dr. Ebomwonyi Osagie, gave the charge while addressing journalists during the daily briefing on COVID-19, at the Government House in Benin City.\nHe said the state recorded one more death of an unvaccinated person, with seven new COVID-19 cases, urging residents to get vaccinated in order to stay protected against the virus.\nAccording to him, “Edo State, in the last 24 hours, recorded one more death of an unvaccinated person, seven new COVID-19 cases, 11 recoveries, with 720 active cases that are being managed at various treatment and isolation facilities in the state.\n“The casualty; a 68-year-old unvaccinated male, was reported from Stella Obasanjo Hospital.\nWhile applauding their turnout for the ongoing massive vaccination exercise in the state, Irowa urged citizens who are yet to be inoculated to come out to get vaccinated in order to get protection against the virus."
  },
  {
    "headline": "Florida Gov. appoints Nigerian-American, Joseph Ladapo Surgeon-General",
    "summarized_story": "Ron DeSantis, Florida Governor, U.S. has appointed a Nigerian-American, Joseph Ladapo, as Florida Surgeon-General and Secretary of the Department of Health.\nMr DeSantis in a statement posted on the Florida Department of Health website, stated that he was pleased to announce Mr Ladapo for the position.\n“I am pleased to announce that Ladapo will lead the Florida department of health as our state’s next surgeon-general.\nMr Ladapo said he is honored to have been chosen by DeSantis to serve as Florida’s next surgeon-general.\nMr Ladapo was recently granted a professorship at the University of Florida (UF) College of Medicine."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Buhari seeks debt cancellation at UN General Assembly: Full speech",
    "summarized_story": "OBINNA EZUGWUNigeria’s president, Muhammadu Buhari has appealed to the developed world and multinational institutions to consider debt restructuring and even outright cancellation for developing countries impacted by the Covid-19 pandemic.\nBuhari who made the appeal while delivering his speech at the United Nations General Assembly in New York on Friday, noted that developing countries have been faced with unsustainable debt burdens even before the pandemic.\nSimilarly, corruption across national borders has huge negative impact on the stability, peace, and economic prospects of millions, particularly in developing countries.\nOn the issue of debt, we have seen that developing countries have been faced with unsustainable debt burdens even before the pandemic.\nClimate change and unpredictable shocks, such as the current global pandemic, further exacerbate vulnerabilities in the global food system, requiring the UN’s urgent attention."
  },
  {
    "headline": "Top Banker, UK Eke wins Year 2020 Zik Prize",
    "summarized_story": "By Okey OnyenweakuAce banker and Group Managing Director of FBN Holdings, Urum Kalu Eke (UK Eke), has emerged winner of the prestigious Zik Prize in Professional Leadership Award for the year 2020 in recognition of his strides in the banking industry.\nAnd as GMD of FBN Holding’s, he has made his mark.\nAt FBN Holdings, he has continued to prove his mettle.\nIn 2020, however, the impact of the pandemic caused a marginal 1.9 percent drop in the earnings to N579.4 billion.\nFBN Holdings profit grew from N12.24billion in 2016 to N37.7billion in 2017, N58.23billion in 2018, N73.66billion in 2019 and N89.7 billion in 2020."
  },
  {
    "headline": "Fidelity Bank to develop SMEs capacity in non-oil exports sector",
    "summarized_story": "OBINNA EZUGWUTop Nigerian lender, Fidelity Bank Plc, in furtherance of its resolve to help Nigerian businesses build sustainable export capabilities, leading Nigerian lender, says it is set to host the 11th and 12th editions of its highly acclaimed Export Management Programme (EMP).\nLaunched in 2016, the EMP is targeted at preparing participants for real-time experiences in the international non-oil export markets and the broader export market at large.\nThe session typically covers a wide range of topics including Export documentation, Selection and Implementation of Supply Chain Management for Exports, Application of Export Development Business Processes amongst others.\nThe sessions would be facilitated by leading faculty from LBS, Nigerian Export Promotion Council (NEPC) staff as well as experts in financial management and exports.\nFidelity Bank has over the years demonstrated its resolve to grow the non-oil export side of the economy through strategic initiatives and partnerships."
  },
  {
    "headline": "United States boosts Nigeria’s public health emergency preparedness and response",
    "summarized_story": "The Consul General spoke on Friday at the closing and graduation ceremony after a two-week capacity-building exercise on public health emergency management.\nAbout 40 participants drawn from the NCDC, state-level ministries of health, Nigeria Port Health Services, and the Nigerian military were certified in the first cohort of the intermediate-level Public Health Emergency Management Professional Certification Program (PHEM PC) adapted from the US-CDC was delivered by Georgetown University, a leader in Public Health Emergency Management training.\nThe PHEM PC Program equipped emergency managers, incident managers, state epidemiologists, first responders, watch managers, and other public health experts with specialized training in crisis and emergency risk communication, public health emergency management functions, and operations.\nThe knowledge, competencies, and skill set taught in the course will help officials coordinate public health emergencies.\nFinally, following lessons learned from this pilot implementation, USG will continue to support NCDC to advance Public Health Emergency Management interventions in Nigeria at all levels."
  },
  {
    "headline": "Brother Kills Sibling For Money Ritual In Kwara",
    "summarized_story": "Operatives of the Kwara State Command of the Nigeria Security and Civil Defence Corps (NSCDC), have arrested a 25-year-old lsmail Saliu for allegedly killing his 14-year-old brother, Azeez Saliu.\nIsmail reportedly conivedwith an herbalist and one other person to kill his brother for money ritual.\nAfolabi disclosed that the suspects lured the victim to a farm where he was gruesomely murdered by his own blood brother, lsmail Saliu.\n“The prime suspect, who is a brother to the deceased has confessed to have personally slaughtered his own brother with the help of the herbalist and one other person,” Afolabi added.\nHe added that the the State Commandant of NSCDC, lskil Makinde, has ordered that the suspects be handed over to the police for further investigations and prosecution."
  },
  {
    "headline": "Brother Kills Sibling For Money Ritual In Kwara",
    "summarized_story": "Operatives of the Kwara State Command of the Nigeria Security and Civil Defence Corps (NSCDC), have arrested a 25-year-old lsmail Saliu for allegedly killing his 14-year-old brother, Azeez Saliu.\nIsmail reportedly conivedwith an herbalist and one other person to kill his brother for money ritual.\nAfolabi disclosed that the suspects lured the victim to a farm where he was gruesomely murdered by his own blood brother, lsmail Saliu.\n“The prime suspect, who is a brother to the deceased has confessed to have personally slaughtered his own brother with the help of the herbalist and one other person,” Afolabi added.\nHe added that the the State Commandant of NSCDC, lskil Makinde, has ordered that the suspects be handed over to the police for further investigations and prosecution."
  },
  {
    "headline": "Oyo PDP Members Decry planned Intimidation Ahead Of Ward Congresses",
    "summarized_story": "As the ward congress of the People’s Democratic Party (PDP) holds today, some aggrieved members in Oyo State chapter it the party have raised the alarm over an alleged intimidation.\nSpokesperson of the group, Babatunde Nafiu from Saki West Local Government Area, in a statement alleged that some group of people within the party whose interests do not agree with theirs have concluded arrangements to intimidate key members of the party.\nThis is not the Oyo PDP we want, there must be a change to the narrative and this is why we are working round the clock to ensure that things are put in right perspective.\nLamidi is preparing to do his thing as usual on the instruction of governor Seyi Makinde’s ally, Mr Seye Famojuro.\nWe are determined to restructure our party and there is no going back on this course."
  },
  {
    "headline": "Oyo PDP Members Decry planned Intimidation Ahead Of Ward Congresses",
    "summarized_story": "As the ward congress of the People’s Democratic Party (PDP) holds today, some aggrieved members in Oyo State chapter it the party have raised the alarm over an alleged intimidation.\nSpokesperson of the group, Babatunde Nafiu from Saki West Local Government Area, in a statement alleged that some group of people within the party whose interests do not agree with theirs have concluded arrangements to intimidate key members of the party.\nThis is not the Oyo PDP we want, there must be a change to the narrative and this is why we are working round the clock to ensure that things are put in right perspective.\nLamidi is preparing to do his thing as usual on the instruction of governor Seyi Makinde’s ally, Mr Seye Famojuro.\nWe are determined to restructure our party and there is no going back on this course."
  },
  {
    "headline": "Sultan Consoles Oyo Govt Over Death Of Religious Leader",
    "summarized_story": "The sultan of Sokoto and President-General of the Nigeria Supreme Council for Islamic Affairs (NSCIA), His Eminence, Alhaji Muhammad Sa’ad Abubakar has commiserated with Oyo State government and Muslim communities over the death of Alhaji Sanusi Ojolowo who was the Aare Musulumi of Ibarapa Land.\nThe sultan’s condolence message was contained in a statement on Friday by Prince Bashir Adefaka for the sultan of Sokoto media team.\nThe sultan regretted that the Nigerian Muslim Ummah had lost yet another great philanthropist, who spent his life benefitting humanity and building as well as maintaining the mosques of Allah, while also providing succour for people across religions and tribes, especially those in Ibarapa Land.\n“His sincerity and trustworthiness in the discharge of his duty as a reputable Hajj and Umrah operator from the days of Western Region and now in Oyo and Kwara states, which made him the most trusted by especially the Fulani in Ibarapa for the services, was well noted.\nWe can only pray and we indeed pray to Allah to please help us to receive, forgive, keep his gentle soul and repose it in Al-Jannah Firdauz,” Sultan said."
  },
  {
    "headline": "Joshua aims for 25th career win against Usyk today",
    "summarized_story": "ANTHONY Joshua faces a stern test in his bid to record his 25th career win when he comes up against Oleksandr Usyk, a former undisputed cruiserweight world champion in London on Saturday (today) former Nigerian boxing coaches have said, Saturday PUNCH reports.\nJoshua has recorded 24 wins and a loss in 25 bouts since he turned professional in 2013.\nUsyk will be the second Ukrainian boxer, Joshua will be hoping to defeat after he technically knocked out Klitschko at the Wembley Stadium in London, England in 2017.\nJoshua and Usyk each won Olympic gold medals at London 2012.\nSince then, while Joshua has become a two-time heavyweight champion, Usyk won the undisputed cruiserweight title."
  },
  {
    "headline": "Joshua aims for 25th career win against Usyk today",
    "summarized_story": "ANTHONY Joshua faces a stern test in his bid to record his 25th career win when he comes up against Oleksandr Usyk, a former undisputed cruiserweight world champion in London on Saturday (today) former Nigerian boxing coaches have said, Saturday PUNCH reports.\nJoshua has recorded 24 wins and a loss in 25 bouts since he turned professional in 2013.\nUsyk will be the second Ukrainian boxer, Joshua will be hoping to defeat after he technically knocked out Klitschko at the Wembley Stadium in London, England in 2017.\nJoshua and Usyk each won Olympic gold medals at London 2012.\nSince then, while Joshua has become a two-time heavyweight champion, Usyk won the undisputed cruiserweight title."
  },
  {
    "headline": "‘US actor Michael K. Williams died of acute drug overdose’",
    "summarized_story": "US actor Michael K. Williams, who starred as Omar Little in the widely acclaimed television series The Wire, died of an accidental drug overdose, authorities said Friday.\nThe Emmy-nominated actor had been widely hailed for his role in “The Wire,” in which he played a gay armed robber who specialized in holding up drug dealers.\nThe series became one of the most popular shows on television and ran through five seasons from 2002 until 2008.\nWilliams was also well-known for the role of Albert ‘Chalky’ White on the HBO series “Boardwalk Empire,” among others.\nWilliams had spoken openly of his past struggles with drug addiction, and had told US media that he had spent much of his earnings from “The Wire” on narcotics."
  },
  {
    "headline": "‘US actor Michael K. Williams died of acute drug overdose’",
    "summarized_story": "US actor Michael K. Williams, who starred as Omar Little in the widely acclaimed television series The Wire, died of an accidental drug overdose, authorities said Friday.\nThe Emmy-nominated actor had been widely hailed for his role in “The Wire,” in which he played a gay armed robber who specialized in holding up drug dealers.\nThe series became one of the most popular shows on television and ran through five seasons from 2002 until 2008.\nWilliams was also well-known for the role of Albert ‘Chalky’ White on the HBO series “Boardwalk Empire,” among others.\nWilliams had spoken openly of his past struggles with drug addiction, and had told US media that he had spent much of his earnings from “The Wire” on narcotics."
  },
  {
    "headline": "Busted: Anambra lawmaker Victor Ofumelu hides empowerment items for 2 years",
    "summarized_story": "The ICPC made the discovery during the ongoing Constituency and Executive Projects Tracking Exercise in Anambra state.\nThe anti-graft agency said the items meant for youths and women in Oyi/Ayamelum Federal Constituency were concealed in a warehouse belonging to the lawmaker.\nIn the Anambra North Senatorial Zone, the ICPC officials were able to interact with some market women who got training and start-up capital of N80,000 each.\nStill, in Anambra North, the ICPC officials confirmed that some youth were trained on ICT and got N20,000 each as transport fare.\nTricycles were said to have been distributed to youths but the ICPC officials said no single beneficiary could be produced as evidence of having executed the project."
  },
  {
    "headline": "\"I can’t believe you're gone:\" Davido devastated over Fortune's death",
    "summarized_story": "Nigerian superstar, David Adeleke, popularly known as Davido has reacted to the death of his official photographer, Fortunate Ateumunname Peter popularly known as Fortune.\nDavido who was devastated after the death of Fortune took to his verified Instagram page and wrote a heart-wrenching tribute for the deceased.\nI can’t believe you’re gone.\n“I can’t even believe I’m writing a tribute to you right now wtf we still had so much more to do.\nI can’t believe you didn’t give me the chance to fulfill the rest of my promises to you."
  },
  {
    "headline": "Why Dead Nigerians’ Names Are Still On Voter Register – INEC Chair",
    "summarized_story": "Prof. Mahmood Yakubu, the Chairman of the Independent National Electoral Commission, has stated that the commission’s inability to obtain enough data on death in the country has prevented it from removing the names of deceased Nigerians from the voter register.\nOn Friday, Yakubu received the Chairman of the National Population Commission, Nasir Kwarra, at the commission’s offices in Abuja.\nHe did, however, call on the NPC to make sure that data on dead people in the country is made accessible to the commission so that the voter register may be properly cleaned up.\n“We appreciate that this is a herculean task but that is partly why we have the National Population Commission.\nThis information is critical for INEC to enhance the credibility of the National Register of Voters”."
  },
  {
    "headline": "ISWAP Allegedly Kills 12 Soldiers, Vigilantes In Borno Ambush",
    "summarized_story": "At least twelve Nigerian troops and local vigilantes have been slain in Borno by the Islamic State of West Africa Province (ISWAP).\nTerrorists planted improvised explosive devices (IEDs) on the road that a military convoy traveling from Marte to Maiduguri would pass over.\nSoldiers who had been granted leave to leave the Marte unit were escorted by the motorcade.\nAccording to PRNigeria, the troops were ambushed at Ala village, which is located between Marte and Dikwa town.\nThe raid came on the same day when forces fought ISWAP at a military camp in Borno’s Malam Fatori and Yobe’s Babangida hamlet."
  },
  {
    "headline": "20 Nigerian Soldiers Killed In Fresh Boko Haram Ambush In Borno",
    "summarized_story": "In the Marte area of Borno State, militants from the Islamic State-backed Boko Haram group, the Islamic State West Africa Province (ISWAP), formerly known as Jam’at Ahl as-Sunnah lid-Da’wah wa’l-Jihd, ambushed about 20 soldiers and took several more hostage.\n“Two gun trunks were burned, while Boko Haram militants took two additional weapons trucks,” he claimed.\nIn northeastern Nigeria, Boko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and uprooted millions.\nThe rebels also killed roughly 20 soldiers in Malari, Borno State, in February.\nThe soldiers were on patrol following credible intelligence to remove some Boko Haram elements in the region when they were assaulted by the organization, according to SaharaReporters."
  },
  {
    "headline": "Bandits Sack Two Police Stations In Zamfara, Steal Ammunition Amid Military Operations",
    "summarized_story": "Bandits in Zamfara State invaded Shinkafi town, shooting sporadically and destroying two police facilities in the process.\nThe attackers were claimed to have hauled away weaponry from the wrecked police stations, according to the Daily Trust.\nShinkafi is the last major town on the road that connects Zamfara and Sokoto State.\nAt various periods in the past, bandits had raided the town.\nDue to the telecom outage, the Zamfara State police spokesperson could not be reached, and the Nigeria Police Force’s spokesman, CP Frank Mba, stated he had no knowledge about the attack."
  },
  {
    "headline": "Breaking: Nigeria’s D’Tigress subdue Senegal, set up Mail Afrobasket 2021 final clash",
    "summarized_story": "Nigeria’s D’Tigresses on Friday defeated their Senegalese counterparts 73-63 and landed in the final of 2021 Afrobasket final.\nThe Nigerian girls will now battle Mali in the final of the competition.\nMali had narrowly beat host Cameroon 52-51 at the end of their semifinal berth.\nDetails loading…"
  },
  {
    "headline": "Ailing economy: Nigerians bemused over NNPC’s audit declaration",
    "summarized_story": "According to them, over the years, the Corporation seems to have been managed only to record losses; BENJAMIN UMUTEME reports.\n“I am pleased to announce the declaration of profit after tax of N287 billion in 2020 by the Nigerian National Petroleum Corporation.\n“The NNPC losses were reduced from N803 billion in 2018 to N1.7 billion in 2019 and the eventual declaration of net profit in 2020 for the first time in its 44-year history.\nKyari said, “What we did to arrive at this (N287 billion profit), I think it is a continuous process.\nPeterside noted further that the Corporation dipped its fingers into the federation account to announce the N287 billion profits."
  },
  {
    "headline": "Right of VAT collection remains with FIRS, AGF Malami insists",
    "summarized_story": "The chief law officer of the federation explained that the ruling of the Court of Appeal that FIRS and the Rivers Government maintain status quo favoured FIRS.\n“So with that in mind, the Federal Government has succeeded in obtaining an order that establishes the sustenance of the status quo, which status quo is that the Federal Inland Revenue Service should continue collection.\n“This is pending the determination of the cases that were instituted by states, particularly the Rivers State Government and the Lagos State government.\nA three-member panel of the Court of Appeal headed by Haruna Tsammani, issued the order being challenged at the Supreme Court by the Rivers government.\n“And we are taking steps to consider the possibility of instituting an action before the Supreme Court for the purpose of having this matter determined once and for all,’’ Malami said."
  },
  {
    "headline": "NAFDAC warn Nigerians against use of carbide on fruits -NigPilot",
    "summarized_story": "The officials of the National Agency for Food and Drug Administration and Control (NAFDAC) are currently on surveillance in all nooks and crannies of the country to track and arrest anyone found using carbide to ripen fruits.\nThe Director-General of NAFDAC, Prof. Mojisola Christianah Adeyeye, who disclosed this at a sensitization campaign in Onitsha, Enugu state, warned sellers of fruits including oranges, banana, plantain and many others to desist from using carbide or risk being arrested.\nRepresented by the Director of Public Affairs of the agency, Dr Abubakar Jimoh, the NAFDAC Director-General, however, appealed to Nigerians to be on the alert and report anyone found using carbide to ripen fruits to the nearest NAFDAC office or the law enforcement officials.\nShe lamented that those who engage in such sharp practices at the altar of public health is a great disservice and that they are undermining the health system in Nigeria.\nBut now people just want to make quick gain at the detriment of public health."
  },
  {
    "headline": "Ethnic youth leaders to Secondus, PDP: Your call for CBN gov’s resignation baseless, sign of weak NWC -NigPilot",
    "summarized_story": "Nigerian Ethnic Youth Leaders Council, NEYLC, is alarmed over the call made by the Peoples Democratic Party, PDP, that the governor of the Central Bank of Nigeria, CBN, Godwin Emefiele, should resign.\nThe council, which is made up of the Arewa Consultative Youth Movement, Ohanaeze Ndi Igbo Youth Movement, Oduduwa Youths and Middle Belt Youths, is of the strong view that the call is baseless considering the monumental strides of the apex bank under Emefiele’s leadership.\n“The call is laughable and a sign of a weak National Working Committee, NWC, of an opposition party which is ready to play politics with everything, no matter how unreasonable.\n“We pity Ologbondiyan and Secondus because they are like the proverbial drowning men that are desperately looking for a straw to hold on it.\n“We’re really dismayed at the level that which ambition can push people to,” the council noted."
  },
  {
    "headline": "Ortom accuses Buhari of dividing Nigeria -NigPilot",
    "summarized_story": "BENUE State Governor, Samuel Ortom has accused President Muhammadu Buhari of jettisoning the vision of the nation’s founding fathers which was hinged on unity and oneness and instead is pursuing an ethnic agenda.\nOrtom said instead of bringing Nigeria together, the president had succeeded in dividing the country with intimidation and marginalization.\nOrtom said for Nigeria to move in the path of unity and oneness, the people of Eastern Nigeria should be provided with adequate infrastructure.\nOrtom said whereas former President Goodluck Jonathan never threatened or intimidated anybody, under President Buhari, intimidation of dissenting voices in a democracy has been the order of the day.\nOrtom, however, pleaded with Ndigbo not to destroy infrastructure in their place since what they are destroying belongs to them."
  },
  {
    "headline": "NYSC: Army apologies to victim of rights abuse -NigPilot",
    "summarized_story": "He however assured that the rights of the citizenry is sacrosanct and must be respected by all personnel of the Nigerian Army, as any form of infraction will be severely dealt with.\n“It is against this premise that the NA condemns this unimaginable level of infraction by a personnel in its ranks.\nThe Army spokesperson said that the officer’s actions has undoubtedly caused the NA monumental embarrassment and is highly regrettable.\nHe added that the unfortunate act of indiscipline does not in anyway represent the NA and will not be condoned in its entirety.\nThe Service enjoined the public to continue to report such infractions, as Human Rights Desks in all formations of the NA are emplaced to deal decisively with such erring personnel."
  },
  {
    "headline": "Nigeria Records 477 More COVID-19 Cases, Three Deaths In 24 Hours",
    "summarized_story": "Nigeria has recorded three more deaths from the COVID-19 pandemic with 477 fresh cases in the last 24 hours.\nIn its latest update on Friday night, the Nigeria Centre for Disease Control (NCDC) said the cases were reported in Lagos, 16 other states and the Federal Capital Territory (FCT).\nIn Nigeria’s South-south region, Delta had (37), Akwa Ibom (9), Cross River (7), Edo (6), and Bayelsa (2) respectively.\nOther states with fresh cases include Kaduna – 68, Abia – 36, Oyo – 16, Benue – 12, Plateau – 9, Ekiti – 6, Katsina – 4, Jigawa – 3, Ogun – 1 and Yobe – 1.\nAccording to her, the United States pledged to share 500 million more COVID-19 vaccines to low-income countries between now and 2021, bringing its total pledges to more than 1.1 billion doses."
  },
  {
    "headline": "Fear Of Attack Forces Banks, Shops To Close In Ogun",
    "summarized_story": "The fear of an imminent attack has forced banks and shops to shut down in the Ijebu-Ode area of Ogun State.\nChannels Television gathered that commercial banks and shops have closed since Monday following letters allegedly sent to some of them by suspected armed robbers.\nDespite this incident, the banks maintained that they would only resume operations if the Ogun State Government assists the police with Armoured Personnel Carriers to be mounted close to their branches.\nBut the Police Public Relations Officer, Abimbola Oyeyemi, said there is no reason for fear of attacks, saying the police had assured the banks and residents of their safety.\nWe have assured them of their protection and our presence everywhere in Ijebu-Ode and everywhere in Ogun State."
  },
  {
    "headline": "What Buhari Told World Leaders At UN General Assembly",
    "summarized_story": "President Muhammadu Buhari spoke on a long list of critical issues on Friday as he addressed world leaders at the 76th Session of the United Nations General Assembly (UNGA76).\nHe took to the podium to address the world leaders after President Nicos Anastasiades of Cyprus at the General Debate of the session at the UN Headquarters in New York, the United States.\nHe reiterated that leaders of individual member-states must adhere to the constitutional provisions of their countries, particularly on term limits.\nNigeria will continue to play its part fully in supporting United Nations peacekeeping operations within Africa and beyond.\nMr. President,55 No reform of the United Nations system is more urgent than that of the Security Council."
  },
  {
    "headline": "Foreign Debts Not For Recurrent Expenditure – Lai Mohammed",
    "summarized_story": "The Federal Government has clarified that the debts being taken are not for funding recurrent expenditures but for implementing capital projects which previous administrations failed to carry out.\nThese critics are very insincere; we do not borrow for recurrent expenditure neither do we borrow to pay salaries.\nWe are borrowing to build world-class infrastructures that will benefit generations of Nigerians and we have a lot to show from the loans we have taken.” Mohammed stated.\n“For example, in their time they claimed to have spent billions of naira in building infrastructure but as one can see their infrastructure projects are only on the pages of newspapers.\nWe’ll however not be deterred by their antics, we’ll continue to ignore those who have decided to play politics with everything,” Mohammed added."
  },
  {
    "headline": "Police Arrest Suspect For Tying Debtor Over ₦4.6m Debt",
    "summarized_story": "Operatives of the Lagos State Police Command have arrested a man, Oluchi Okoye for tying his debtor over ₦4.6m Debt.\nSpokesman of the State Police Command, Adekunle Ajisebutu, said the suspect was nabbed following a complaint by the victim’s wife.\nThe victim – Reuben Alozie – until his rescue by the police on Thursday was tied to a stick with ropes at No.\nAlthough the creditor tried several means to recover his money but did not succeed, he thereafter resorted to self-help by tying the debtor for about 24 hours before the police came to his rescue.\n“The suspect tied the victim to a stick with ropes at No."
  },
  {
    "headline": "Controversy trails alleged NYSC Kidnap advisory in pamphlet to Corp members -",
    "summarized_story": "Controversy is trailing an alleged advisory to Corp members serving across the country for the one year mandatory national service.\nThe advisory urges Corp members to always inform their family members when they want to travel through specific high risk routes in other to have someone ready with ransom in case of abduction.\nTVC News sighted different versions of the document containing the advisory on different pages between 56 and 59.\nThough the National Youth Service Corps is reported to have dismissed the advisory as fake, TVC News is making efforts to get the management of the Corps to react."
  },
  {
    "headline": "We will not rest until peace is restored in Zamfara",
    "summarized_story": "Zamfara State government says it will not rest on its oars until lasting peace is restored in all troubled it areas in the stateThe government also says it has no regret suspending telecommunication services, ban of weekly markets, sell of fuel in jerrycans among other measures aimed at curtailing the menace of Banditry and KidnappingThe Zamfara state acting Governor who doubles as the speaker of the state House of Assembly Nasiru Mu’azu Magarya and the secretary to Zamfara state government Kabiru Balarabe stated this when they received members of the state taskforce on security in their officesHe noted that the state government is committed to doing everything possible to stem the tide of InsecurityNasiru Magarya commend the Tireless Efforts of the taskforce in ensuring all residents comply with the directivesThe chairman of the state taskforce on security Abubakar Dauran applaud the state for the support the committee is receiving to meet up with it’s taskHe adds that communities hitherto bedeviled by Banditry are now enjoying relative peace especially with the ongoing military operation against banditsDauran appeal to residents to comply with all the measures put in place to address the spate of Banditry and Kidnapping in Zamfara as anyone found guilty will be made to face the full wrath of the law."
  },
  {
    "headline": "Call off your strike now, Sultan appeals to striking doctors",
    "summarized_story": "The Sultan of Sokoto Muhammad Sa’ad Abubakar has appealed to the striking National Association of Resident Doctors to call off their ongoing industrial action and embrace dialogue.\nSultan Abubakar made the call during the opening ceremony of the the 20th conference of the Pediatric Surgeons of Nigeria holding in Sokoto.\nHe said the striking doctor should also respect the court order that asked them to call off the strike.\nHe advised the striking doctors to engage elders, traditional rulers and other stakeholders to engage the government in dialogue.\nHe said at least the government can establish one specialised children hospital in each of the six geopolitical regions in the country."
  },
  {
    "headline": "Just In: Reps Committee on Ecological Funds visits erosion site in Agbor -",
    "summarized_story": "House of Representatives Committee on Ecological Funds has visited the one kilometre erosion site at UBE Road, Off Uromi Junction, Agbor, Ika South Local Government Area of the state with a pledge to intervene urgently.\nChairman of the Committee, Ibrahim Ayokunle Isiaka who led members of the Committee said that they were at the site to assess the impact of the ecological disaster in the area."
  },
  {
    "headline": "Sky Sports: In Usyk, Joshua Faces Toughest Opponent of His Career, Victory Would Be His Greatest Yet",
    "summarized_story": "The most difficult fight of Joshua’s career is against Usyk Saturday night, from the Tottenham Hotspur Stadium in London in front of 70,000 passionate fans, live on Sky Sports Box Office.\nHis pre-fight work-out routine was a calculated attempt not to allow the juggling and entertaining Usyk to steal the limelight.\nFor while Usyk may be a unique test for Joshua, Joshua is certainly the most perilous examination of Usyk’s skills.\nA year later they both won gold at London 2012 and Usyk has kept an eye on Joshua ever since.\nThe dream undisputed title fight will never become a reality unless Joshua can dispatch Usyk tonight, in the most difficult task of his career."
  },
  {
    "headline": "FIFA Calendar Reforms Destructive for Club Game, European Club Association Says",
    "summarized_story": "Fifa’s calendar revamp would “lead to a direct and destructive impact on the club game”, says the European Club Association.\nWorld football’s governing body has proposed a men’s World Cup every two years as part of an overhauled international match calendar (IMC).\nThe ECA said the planned changes were “in direct and unilateral breach of certain legal obligations”.\nIn an exclusive interview with BBC podcast The Sports Desk, Arsene Wenger – Fifa’s head of global development – said proposals would tackle “chaos” and “congestion” in the game.\nIt’s not that you have to play more, it’s you have to play less games, and more competitive games.”"
  },
  {
    "headline": "Chad’s Military Ruler Mahamat Deby Names Transitional Parliament",
    "summarized_story": "Mahamat Idriss Deby, the head of Chad’s military government, has named 93 members of a new interim parliament, five months after declaring himself leader following the death of his father, longtime President Idriss Deby.\n“The following people have been designated members of the National Transitional Council (NTC),” said the decree signed by the four-star general.\nThe military leader dissolved parliament and promised “free and transparent” elections in 18 months when he declared himself head of Chad’s Transitional Military Council on April 20.\nOn May 11, the military government – headed by Mahamat Deby and made up of 14 other generals – named former Prime Minister Albert Pahimi Padacke as interim prime minister.\nPahimi Padacke was runner-up in the country’s April 11 presidential election that was won by Deby and would have handed him a sixth term in office."
  },
  {
    "headline": "Brazil Recall Eight Premier League Players for World Cup Qualifiers Despite UK ‘Red List’",
    "summarized_story": "Brazil have selected eight Premier League players for October’s World Cup qualifiers despite the country remaining on the UK’s travel red list.\nLast month most English clubs refused to release players called up by South American countries.\n“We’ve had lots of positive meetings with Fifa, the Premier League and the British government, and we trust that there will be a positive solution next week,” he said.\nIn August the Premier League released a statement saying its clubs had “reluctantly but unanimously” decided not to release players for matches in red-list countries during September’s international break.\n“TV and other guys, the Premier League, say, ‘OK, that’s how it is, they have to play, let’s have a look how they can sort that’."
  },
  {
    "headline": "‘Weakened’ Boko Haram Still Active and Preying on Soft Targets, Buhari Tells UN General Assembly",
    "summarized_story": "Nigeria’s President Muhammadu Buhari on Friday said Boko Haram terrorists, though weakened by the military, “are still active in the country, preying on soft targets,” promising that the scourge would soon come to an end.\nIn Nigeria, Boko Haram terrorist group, though fragmented by internal strife and weakened by our defence forces, is still active and preying on soft targets.\n“Nigeria will continue to work closely with the UN Counter-Terrorism bodies and entities with a view to bringing this scourge to an end.\nBuhari said: “Nigeria remains grateful for the assistance received from our partners and friends all over the world.\n“We can and must make substantial, irreversible progress on Security Council reform in the current session,” he said."
  }
]