[
  {
    "headline": "Kenya’s ex-president, Mwai Kibaki, dies at 90",
    "summarized_story": "Former Kenyan president, Mwai Kibaki, who led the East African country for more than a decade, has died, his successor Uhuru Kenyatta announced on Friday.\nHe ordered a period of national mourning until sunset on the day Kibaki is to be buried, with all flags to be flown at half-mast.\nKibaki served as Kenya’s third president, from 2002 to 2013.\n“As a leading figure in Kenya’s post-independence history… Kibaki earned the biding respect and affection of the people of this nation,” Kenyatta said.\n“President Kibaki will forever be remembered as a gentleman in Kenya’s politics."
  },
  {
    "headline": "Biden announces new $800m military aid for Ukraine",
    "summarized_story": "US President Joe Biden announced Thursday a new package of $800 million in military aid for Ukraine, saying it would help Kyiv in the fight against Russian forces in the Donbas region.\nHe said unity between the US and allies in support of Ukraine is sending “an unmistakable message” to Russian President Vladimir Putin.\nCombined with 18 howitzers announced for Ukraine last week, the new artillery would be enough to equip five battalions, Kirby said, noting that both sides are preparing for a battle driven by long-range artillery fire.\n“We are going to continue to utilize all available tools to support Ukraine’s armed forces in the face of Russian aggression,” he said.\nNumerous allies in Europe have also supplied Ukraine with weapons and military supplies."
  },
  {
    "headline": "How 2Baba, Tiwa Savage shut down Benin City for “I Go Dye” Standing show",
    "summarized_story": "In Spite of the heavy downpour of rain that marred the Easter Sunday celebration in Benin City, Edo State, the I Go Dye Standing show tagged “More than a Legend” went on in all its glory, pomp and pageantry before a sold out audience.\nIt was a night of great entrances, splendid performances and enthralling exhilaration in a charged atmosphere of intense camaraderie.\nThe duo took to stage at different times to serenade with their magical musical repertoire which set the already charged atmosphere on fire.\nHits after hits, the duo took the crowd on a musical journey, bringing back memories and scintillating sensibilities to a delightful crescendo.\n“I Go Dye Standing: More than a Legend” is a special occasion and thus rightly tagged as it marks the 27th year of Francis Agoda a.k.a I Go Dye on stage."
  },
  {
    "headline": "Ramadan: Reawaken your wards’ spiritual consciousness",
    "summarized_story": "However, it is quite essential for us to nurture the minds of our wards and reawaken their spiritual consciousness during this period.\nWith this, they will genuinely appreciate and internalised the lessons of Ramadan while also looking forward to another Ramadan Insha Allah.\nThey engage in different unwarranted activities on social media to while away their time, rather than focusing on spiritual purifying acts.\nit is imperative our wards outlive the lessons of Ramadan, as it will no doubt, shape their lives positively, both inwardly and outwardly.\nThe National Mosque, Abuja which used to host several hundreds of Muslims in the past had in a statement before the commencement of Ramadan suspended Itikaf this Ramadan due to further renovation work going on."
  },
  {
    "headline": "2023: Tambuwal appoints Senator Tunde Ogbeha as Presidential Campaign Chairman",
    "summarized_story": "Frontline presidential aspirant under the People’s Democratic Party, PDP, and presidential hopeful Governor Aminu Tambuwal has appointed Senator Tunde Ogbeha as the Chairman of his Presidential Campaign.\nSenator Ogbeha is expected to deploy his vast experience in administration, public policy and politics to the Campaign and will chair meetings of the Tambuwal Campaign Council.\nSenator Tunde Ogbeha is a retired general from Kogi State Nigeria who was administrator of Akwa Ibom State and then of Bendel State during the military rule of General Ibrahim Babangida.\nAfter the return to democracy in 1999 he was the elected senator representing the Kogi West constituency of Kogi State from May 1999 to May 2007.\nTunde Ogbeha who had earlier served as an Ambassador is an alumnus of the National Institute of Policy and Strategic Studies in Kuru."
  },
  {
    "headline": "Suspension of SDP National Chair: States Chairmen disown party members",
    "summarized_story": "— Describe them as desperados, they should be disregardedDayo Johnson AkureThe States Chairmen of the Social Democratic Party (SDP) in the country have disowned party members who suspended its National Chairman, Dr Olu Agunloye for alleged anti-party activities and disregard for the party’s constitution.\nThey described them as desperados and should be disregarded by party members and Nigerians.\n“The official Social Democratic Party SDP is intact and very law-abiding.\nThe constitution of the party 2018 as amended has its provisions on the processes of suspension and or expulsion of SDP financial and legitimate members from the party.\nIt added that ” The newly elected officials of the party in Ondo State are directed to continue with the good work of mobilizing people into the party and should not be distracted."
  },
  {
    "headline": "Nigeria’s debt to hit 44.7% of GDP in 5yrs — IMF",
    "summarized_story": "By Babajide Komolafe, Economy Editor & Emma Ujah, Abuja Bureau ChiefThe International Monetary Fund (IMF) has projected that Nigeria’s total public debt will rise steadily to 44.2 per cent of Gross Domestic Product, GDP, by 2027.\nAccording to the Debt Management Office, DMO, national public debt rose by 20 per cent, year-on-year, YoY, to N39.56 trillion in 2021 from N32.92 trillion in 2020.\n“With the Total Public Debt Stock to Gross Domestic Product (GDP) as at December 31, 2021, of 22.47 per cent, the Debt-to-GDP ratio still remains within Nigeria’s self-imposed limit of 40%”, the DMO said.\nMeanwhile, the IMF has warned that the global community faced a general debt spike, food shortage-related unrests and energy crisis.\nThe release of the April 2022 Fiscal Monitor, with the theme, “Fiscal Policy from Pandemic to War” was part of the on-going Spring Meetings of the World Bank / IMF Spring Meetings."
  },
  {
    "headline": "Insecurity: Christians in Southern Kaduna to hold prayer summit",
    "summarized_story": "Following the incessant attacks, killings and destruction of property going on in Southern Kaduna, a four-man committee has been inaugurated for this year’s prayer summit in the area.\nChairman, Southern Kaduna Christian Leaders Association (SKCLA), Apostle Emmanuel Nuhu Kure, while inaugurating the committee explained that they are prepared for the peace summit that would seek divine intervention towards the restoration of peaceful coexistence in the area.\nHe added that during the summit, participants would also seek divine intervention towards proffering solutions to the ragging insecurity in the area.\nHe enjoined the members, especially the new executives to rededicate themselves to the cause for the spiritual growth and development of the land and her people.\nThe committee’s major term of reference, he explained, is to ensure proper planning of the prayer summit which is billed to hold on the 28th May 2022."
  },
  {
    "headline": "Terrorism: NSA Monguno denies accusing El-Rufai of revealing classified information",
    "summarized_story": "National Security Adviser (NSA) Babagana Monguno said he never accused Kaduna Governor Nasir El-Rufai of disclosing classified information on terrorism.\n“The NSA did not at anytime during the briefing criticize and accuse Governor Nasir El Rufai of divulging classified information”, it reads.\nUsman said the NSA was not referring to the Kaduna helmsman in his comment on the protection of sensitive operational information.\nHe clarified that Monguno, while responding to a question, cautioned security agents who are “in the habit of revealing unauthorized sensitive operational details”.\nThe statement said El-Rufai “has been a consistent and exemplary partner to the security sector” and the NSA would not discredit him."
  },
  {
    "headline": "War: Lives of people stuck in Mariupol are in Putin’s hands – City’s mayor, Boychenko",
    "summarized_story": "Mayor of Mariupol, Vadym Boychenko, has insisted that the lives of people stuck in the shattered city are in Russian President Vladimir Putin’s hands.\nBoychenko said this while expressing his frustration at the rate of the evacuation from Mariupol since the beginning of the war between Ukraine and Russia.\nThe mayor said that Russia has “undermined this evacuation,” which they started in “the first days of March.”“They asked us to give them a map of where the evacuation will start from – we gave them the map,” Boychenko told Reuters news agency.\nThe war between Russia and Ukraine started in February this year and many casualties have already been recorded.\nPutin had ordered the invasion of Ukraine due to political differences between both neighbouring nations."
  },
  {
    "headline": "NURTW vs TOOAN: Gunshots as Oluomo, Istijaba’s boys clash in Lagos",
    "summarized_story": "DAILY POST gathered that gunshots were heard Friday morning at Meiran – Ijaiye axis and Ekoro road in the Abule-Egba area.\nThe battle involves the National Union of Road Transport Workers (NURTW) and the Tricycle Owners and Operators Association of Nigeria (TOOAN).\nThe rivals are loyalists of suspended Lagos NURTW Chairman, Musiliu Akinsanya a.k.a.\nReal name Azeez Abiola, Istijaba is the State Chairman of TOOAN.\nThe Lagos State Police Command has deployed operatives to the scene and assured residents of safety."
  },
  {
    "headline": "Goodluck Jonathan in meeting with stakeholders over 2023 presidency",
    "summarized_story": "Following calls for the former President, Goodluck Jonathan to run for the 2023 presidential election, he is reportedly in a meeting with some stakeholders.\nDAILY POST reports that there has been speculation that the former president who lost to President Muhammadu Buhari in 2015 is nursing an ambition to return to power.\nA source told DAILY POST on Friday, that Jonathan who has kept mum on the speculation, may clear the air after the meeting.\nSome of his supporters had earlier stormed his Abuja residence in protest, asking him to declare for the 2023 presidency.\nThe protesters, who were mostly women, wielded placards and banners with inscriptions such as ‘Goodluck Jonathan must run for president 2023′, “Jonathan is our candidate’, among others."
  },
  {
    "headline": "BREAKING: I won't declare now for 2023 but...",
    "summarized_story": "Former President Goodluck Jonathan has said he is yet to declare for the 2023 presidency as the process to that effect is ongoing.\nHe spoke while playing host to a large crowd of supporters, mostly youths and women on solidarity march to his office in Abuja.\nThey persuaded him to declare for the 2023 presidency.\nLeaders of the placard-carrying supporters took turns to ask the former President to return to office in 2023.\nResponding, Jonathan appreciated the large crowd for their support and visit."
  },
  {
    "headline": "JUST IN: Many feared killed as herdsmen attack Benue farmers",
    "summarized_story": "JUST IN: Many feared killed as herdsmen attack Benue farmersGet real time updates directly on you device, subscribe now.\nSuspected herdsmen have been reportedly killed many farmers in Kwande Local Government area.\nHe identified those killed as: Gbaeren Orsoo, Terdoo Tsega, Bemdoo Tsega, Abacha Tsega, Terkaa Tsega, Aôndoaseer Tyov, Iorhen Atim and Aôndowase Igba.\nChairperson of Kwande Local Government Chairman, Hon.\nBenue Police spokesperson , SP Anene Catherine Sewuese, was yet to respond to calls or text messages on the incident."
  },
  {
    "headline": "JUST IN: Women, youths march for Jonathan’s return in 2023",
    "summarized_story": "JUST IN: Women, youths march for Jonathan’s return in 2023Get real time updates directly on you device, subscribe now.\nSome women and youths on Friday morning marched and called for the return of former President Goodluck Jonathan in 2023.\nThey carried placards with different inscriptions, begging the former President to return to office.\nSome of the placards read: “Goodluck declare now”; “We are sorry, Goodluck don’t abandon us, come back”; “Goodluck please come”; “Goodluck we love you” among many others.\nThe Nation had reported posters of the former President flooded the National Secretariat of the ruling All Progressives Congress (APC)Details Shortly…"
  },
  {
    "headline": "From 7 to 70: Why are they not talking about this, by Femi Adesina",
    "summarized_story": "“Today, Nigeria can boast of having some 70 NPK blending plants.\nThis is a clear sign of the confidence investors have in Mr President’s policies and programs.”From 7 to 70 blending plants just under Buhari!\nFrom 7 to 70 fertilizer blending plants in 7 years.\nFrom 7 to 70 blending plants under Buhari.\n*Adesina is Special Adviser to President Buhari on Media and Publicity"
  },
  {
    "headline": "U.S. embassy approves drop box service for Nigerian students seeking visa renewal",
    "summarized_story": "THE United States Embassy yesterday announced that the drop box service for Nigerian students seeking to renew their visas in the country is now available.\nA statement by the embassy indicated that such students schooling in the U.S. can apply for renewal “without an interview when you return to Nigeria this summer”.\nTo qualify for the service, the embassy said the applicant “must be physically in Nigeria renewing a student visa that is still valid or has expired within the past 24 months”.\nThe statement added that Lagos applicants are advised to go to www.ustraveldocs.com/ng and follow the instructions to make an interview waiver appointment for a student visa.\nIt added that if passport has expired, a current valid passport is required and passport photograph meeting these requirements must be presented."
  },
  {
    "headline": "Female passenger slumps, dies at Abuja airport",
    "summarized_story": "By Chinelo ObogoA female passenger waiting to board a Lagos-bound flight from the domestic terminal of the Nnamdi Azikiwe International Airport, Abuja slumped and died on Thursday, the Federal Airports Authority of Nigeria (FAAN) has confirmed.\nThe Authority said the lady was observed having difficulty in breathing at the boarding hall, but later passed on after efforts made to resuscitate her proved abortive.\nThe Acting General Manager, Corporate Affairs of FAAN, Faithful Hope-Ivbaze, said cardiopulmonary resuscitation (CPR) and automated external defibrillator (AED) was administered on the passenger but it was unsuccessful and she was confirmed dead at about 0906hours.\nHer remains was subsequently taken to the NAF Medical Centre.\n“Although the Authority has processed millions of passengers through the airport without any such incident over the years, we deeply regret that despite spirited efforts by our medical officials to resuscitate her, she was confirmed dead at about 0906hours, and her remains was subsequently taken to the NAF Medical Centre."
  },
  {
    "headline": "2023: Northern PDP consensus move shaky",
    "summarized_story": "From Fred Itua, AbujaPlans by the Peoples Democratic Party (PDP) leaders and stakeholders from the North, to settle for a consensus candidate, ahead of the 2023 presidential election, is shaky, Daily Sun authoritatively reports.\nDaily Sun gathered from multiple sources that the consensus push by Northern elders, led by Ango Abdullahi, may have settled for Saraki, ahead of Tambuwal, Mohammed and Hayatu-Deen.\nMeanwhile, Wike’s camp said he is gaining momentum in key Northern chapters of the PDP and may emerge as candidate of the party.\nOn the flipside, Southern PDP aspirants are also divided on a consensus arrangement.\nThe two leading aspirants from the South, Peter Obi and Wike are opposed to any consensus arrangement."
  },
  {
    "headline": "Bandits attacks: NSA indicts El-Rufai",
    "summarized_story": "National Security Adviser (NSA), Babagana Munguno, disclosed this after a meeting of the National Security Council at the Presidential Villa, yesterday.\n“Governor Nasir El-Rufai spoke about the security agencies saying we know who they are, where they are.\nHe said the president was saddened by the security situation in the country and demanded immediate action from the security chiefs.\nHe said the president consequently ordered rescue of all kidnapped persons unhurt using the train attack as fulcrum.\nThe NSA noted that the president feels that enough was not being done by the security agencies despite what had been provided."
  },
  {
    "headline": "2023: 2 Igbere businessmen set to sign N200m cheque for Lawan, Kalu’s presidential forms",
    "summarized_story": "The businessmen, Ukaegbu James, and Nnanna Kalu, made the announcement on Wednesday in Abuja, noting that both Lawan and Kalu are competent leaders to succeed President Muhammadu Buhari in 2023.\nThe duo noted that APC needed a unifier and committed leader with a good knowledge of Nigeria to succeed President Muhammadu Buhari in 2023.\nThey said: “If we must get it right in 2023, we need a result-oriented leaders, like Kalu and Lawan, to succeed President Buhari in 2023.\nIt is time to present our best hands because there won’t be any room for writing of fake results.\n“We are ready to make N200 million available by weekend to purchase their nomination forms."
  },
  {
    "headline": "PDP extends sale of nomination forms, mocks APC over price",
    "summarized_story": "From Ndubuisi Orji, AbujaPeoples Democratic Party (PDP), yesterday, reopened sales of expression of interest and nomination forms for aspirants seeking to contest the 2023 general election.\nUnder the reviewed timetable, the last day for the submission of already completed forms has been extended to Monday, April 25.”Meawhile, the National Chairman, Iyorchia Ayu, has berated the All Progressives Congress (APC) over the price of its nomination forms.\nThe ruling party had pegged the nomination forms for presidential and governorship aspirants at N100 million and N50 million respectively.\nThe same man, as leader of his party, has now sanctioned the sale of the same forms at N100 million.\nIn fact, all those buying the N100 million and N50 million nomination forms should be investigated for suspected fraud,” he said."
  },
  {
    "headline": "Buhari: Military Not Doing Enough to End Insecurity Despite Logistics Provided",
    "summarized_story": "Buhari frowned on the fact that his previous directives to the military to end insecurity in the country had not yielded much results.\nMonguno said there was no way the president would be happy, when people were being killed on a daily basis.\nThe NSA added that the president was of the belief that enough was not being done by the security agencies, despite the logistics being provided.\n“A lot of lives are being lost, the president is not happy about this situation, he’s made it very clear.\nHe condemned the recent spate of attacks on police officers, facilities and other police operational assets across the country."
  },
  {
    "headline": "APC Women Leader: N100m Presidential Form Meant to Shut Out Unserious Aspirants",
    "summarized_story": "Edu said the APC National Working Committee (NWC) had consciously fixed the rate as part of a mechanism to ensure only serious aspirants were on the ballot.\nShe stated, “For all we care, N1.5 million for a House of Assembly nomination form is fair to the general population.\nIn fact, all those buying the N100 million and N50 million nomination forms should be investigated for fraud.”He further stressed, “We, the PDP, are different.\nThe APC had fixed N30 million for the ‘expression of interest form’ and N70 million for the ‘nomination form’, making a total of N100 million.\nThe N100m is also over 100 per cent of the N40 million fixed by the same APC for the 2018, presidential nomination form."
  },
  {
    "headline": "INEC Proposes One Million Staff Deployment for 2023 Elections",
    "summarized_story": "At the same time, the National Security Adviser, Major-General Babagana Munguno, has assured INEC and Nigerians in general of adequate protections during the elections.\n“Let me also reassure those who registered between January and March 2022 as well as those who are doing so until the end of the exercise that their PVCs will be ready for collection long before the 2023 General Election.\nWe want to assure all registered voters that PVCs issued by the Commission remain valid for all elections.\nHis words: “They build on the successes of the preceding plans, especially, in the planning and conduct of the 2019 General Election as well as off-cycle and bye-elections.\nINEC plays a critical role but the Commission alone cannot deliver the elections we all desire."
  },
  {
    "headline": "Aisha Buhari Hosts Presidential Aspirants to Ramadan Iftar Saturday",
    "summarized_story": "This is a standard operational protocol in the Villa when you are having either of the three occupants of the Presidency.\n“Whether the president is having an event or the Vice President is having an event or the First Lady is having an event, because outsiders will come.\nThat’s the security and standard protocol.\n“That does not apply to the Vice President.\nHow can you expect that to apply to the Vice President or even to ministers”, he said."
  },
  {
    "headline": "Buhari Presides over Security Council Meeting",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari is presiding over the National Security Council (NSC) meeting at the State House, Abuja.\nThe meeting, holding at the Council Chambers being attended by heads of security establishments and some Ministers, is sequel to last week’s recommendations by the National Council of State over the security challenges facing the nation.The crucial meeting is also being attended by Vice-President Yemi Osinbajo; Secretary to the Government of the Federation; Boss Mustapha; the Chief of Staff to the President, Professor Ibrahim Gambari; and the National Security Adviser (NSA), Major General Babagana Monguno (rtd.\n).Among the ministers at the meeting are those of Defence, Bashir Magashi; Interior, Rauf Aregbesola; and Foreign Affairs, Geoffrey Onyeama.\nThe Chief of Army Staff, Lieutenant General Farouk Yahaya; Chief of Naval Staff, Vice Admiral Awwal Gambo; and the Chief of Air Staff, Air Marshal Isiaka Oladayo Amao are also in attendance while Chief of Defence Staff, General Lucky Irabor, was represented.\nAlso in attendance are the Inspector-General of Police, Alkali Baba Usman; the Director-General of the Department of State Service (DSS), Yusuf Bichi; and the Director-General of the National Intelligence Agency (NIA), Ahmed Rufai Abubakar."
  },
  {
    "headline": "EXPOSED: Multi-billion Naira Properties Located In Ikoyi Owned By Nigeria's Insouciant Labour Minister, Chris Ngige, Amid Education-crunching Strike By Academic Staff Unions",
    "summarized_story": "You may also like"
  },
  {
    "headline": "EXPOSED: Multi-billion Naira Properties Located In Ikoyi Owned By Nigeria's Insouciant Labour Minister, Chris Ngige, Amid Education-crunching Strike By Academic Staff Unions",
    "summarized_story": "You may also like"
  },
  {
    "headline": "Aisha Buhari Invites Osinbajo, Tinubu, Wike, Atiku, Peter Obi, Others For Ramadan Dinner, Warns Them Against Coming With Phones",
    "summarized_story": "The First Lady, Aisha Buhari, has sent out invitations to aspirants gunning for the presidency of the country in the different political parties to show up for a Ramadan dinner with her on Saturday, April 23.\nAccording to the invitation card, the presidential aspirants are expected to present their invitation cards at the gate of the venue otherwise they may be turned back.\nThe presidential aspirants were also instructed to leave their phones behind when coming for the dinner.\nThe ruling All Progressives Congress (APC) currently has about 8 presidential aspirants.\nThe Governor of Ebonyi State, Dave Umahi, followed suit, and in a similar fashion, visited Buhari to inform him of his intention to run for the coveted number one position in the country."
  },
  {
    "headline": "Aisha Buhari Invites Osinbajo, Tinubu, Wike, Atiku, Peter Obi, Others For Ramadan Dinner, Warns Them Against Coming With Phones",
    "summarized_story": "The First Lady, Aisha Buhari, has sent out invitations to aspirants gunning for the presidency of the country in the different political parties to show up for a Ramadan dinner with her on Saturday, April 23.\nAccording to the invitation card, the presidential aspirants are expected to present their invitation cards at the gate of the venue otherwise they may be turned back.\nThe presidential aspirants were also instructed to leave their phones behind when coming for the dinner.\nThe ruling All Progressives Congress (APC) currently has about 8 presidential aspirants.\nThe Governor of Ebonyi State, Dave Umahi, followed suit, and in a similar fashion, visited Buhari to inform him of his intention to run for the coveted number one position in the country."
  },
  {
    "headline": "2023 Presidency: Women, Youths March With Placards, Call For Goodluck Jonathan's Return As Ex-President Holds ‘Strategic’ Meeting Over Ambition",
    "summarized_story": "Former President of Nigeria, Goodluck Jonathan is currently in a meeting over a possible presidential ambition in the 2023 general elections.\nThey wielded placards and banners with inscriptions saying ‘Goodluck Jonathan must run for president 2023′, “Jonathan is our candidate’, among others.\nResponding to them, Jonathan asked Nigerian youths to show greater interest in the nation’s political process.\nSources however told SaharaReporters that he rejected the conditions and told the cabal he didn’t have interest in the 2023 presidency again.\nHe again contested in 2015 for a second term in office but was defeated by Muhammadu Buhari, the incumbent President."
  },
  {
    "headline": "'Just watch out!' --- Jonathan responds on calls to declare presidential bid",
    "summarized_story": "Former President Goodluck Jonathan says he is not sure if he will run for president in 2023.\nSpeaking after some of his supporters besieged his home in Abuja on Friday, Jonathan said the political process is ongoing, but that they should “just watch out!”The former president said the country needs a president that would carry the youths along.\nAdvertisement“The political process is ongoing, just watch out.\n“Now, we know better, under Jonathan the minimum wage could buy one or two bags of rice.\n“We are begging President Jonathan to forgive us, we have realized our mistakes, we want him back to complete what he started.”"
  },
  {
    "headline": "'Just watch out!' --- Jonathan responds on calls to declare presidential bid",
    "summarized_story": "Former President Goodluck Jonathan says he is not sure if he will run for president in 2023.\nSpeaking after some of his supporters besieged his home in Abuja on Friday, Jonathan said the political process is ongoing, but that they should “just watch out!”The former president said the country needs a president that would carry the youths along.\nAdvertisement“The political process is ongoing, just watch out.\n“Now, we know better, under Jonathan the minimum wage could buy one or two bags of rice.\n“We are begging President Jonathan to forgive us, we have realized our mistakes, we want him back to complete what he started.”"
  },
  {
    "headline": "Police arrest IPOB's bomb maker, recover weapons in Imo",
    "summarized_story": "Mike Abattem, police spokesperson in Imo, disclosed this in a statement issued on Friday.\nAccording to Abattem, the suspect admitted being the manufacturer of most of the IEDs used in attacking police stations in Imo and neighbouring states.\nHe said weapons, including one IDE, 58 pieces of cannon steel pipe, two chisels, one hammer, half bag of potassium nitrate, 30 pounds weight of sulphur, 40 pounds weight of dry sand, 10 pounds weight of red sand, 30 pounds weight of gun powder, half bag of charcoal, 30 electronic motorcycle batteries and seven lengths of eight millimetres iron rods, were recovered from the suspect.\nAdvertisement“The Command’s Explosive Ordinance Disposal Unit (EOD) has taken over the recovered bomb for technical analysis and subsequently for possible detonation,” Abattem said.\nHe added that an investigation is ongoing to arrest other members named by the suspect."
  },
  {
    "headline": "Police arrest IPOB's bomb maker, recover weapons in Imo",
    "summarized_story": "Mike Abattem, police spokesperson in Imo, disclosed this in a statement issued on Friday.\nAccording to Abattem, the suspect admitted being the manufacturer of most of the IEDs used in attacking police stations in Imo and neighbouring states.\nHe said weapons, including one IDE, 58 pieces of cannon steel pipe, two chisels, one hammer, half bag of potassium nitrate, 30 pounds weight of sulphur, 40 pounds weight of dry sand, 10 pounds weight of red sand, 30 pounds weight of gun powder, half bag of charcoal, 30 electronic motorcycle batteries and seven lengths of eight millimetres iron rods, were recovered from the suspect.\nAdvertisement“The Command’s Explosive Ordinance Disposal Unit (EOD) has taken over the recovered bomb for technical analysis and subsequently for possible detonation,” Abattem said.\nHe added that an investigation is ongoing to arrest other members named by the suspect."
  },
  {
    "headline": "Ngige: Section 84(12) doesn't apply to me -- I’m a public servant",
    "summarized_story": "Yes, I’m a public servant.\nA public officer is a public servant.”AdvertisementHe also spoke on the N100 million fixed by the All Progressives Congress (APC) for the presidential nomination form.\nBut when the thing came out and it’s N100 million, they have started calling me.\n“I’ve been in public service for 40 years.\nI have passed through the mills of the public service of Nigeria – both political party-wise, civil service-wise, legislature, executive at state and national level."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Google’s Africa internet cable arrives in Lagos, Nigeria",
    "summarized_story": "Google has announced that earlier today, Equiano, a subsea internet cable running through Portugal to South Africa landed in Lagos, Nigeria.\nThis announcement is coming a month after Equiano first landed on the African continent in Togo.\nThe project, which is named after Nigerian-born writer and abolitionist Olaudah Equiano, is expected to help support further digital transformation in Nigeria, a country with a thriving tech ecosystem.\n“Google is committed to supporting Africa’s digital transformation and we are excited to see the impact of the landing of Equiano in Nigeria,” Juliet Ehimuan, Director, West Africa at Google said.\nLast October, Google CEO Sundar Pichai announced a plan to invest $1billion over 5 years to support digital transformation in Africa, of which project Equiano is part."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, It's the weekend again, and I've been looking forward to it!\nFirst off, thank you for sticking with me...."
  },
  {
    "headline": "Say goodbye to clout chasing on the gram",
    "summarized_story": "AdvertisementWhen you compare this to, say, California, United States – which has an estimated 630,000 developers – you’ll see that this is a problem.\nInstagram prioritises originalityAdam Mosseri, Instagram CEO, announced on Wednesday, April 20, 2022, that the company will change its ranking algorithm to emphasise original content more prominently on its platform.\nThis would also help to prioritise the distribution of original content over reposted content in places like the Reels tab and feed.\nWe’re going to do more to try and value original content more, particularly compared to reposted content,” he says.\nWhat’s more, Mosseri mentioned two recent product launches: product tagging and enhanced tagging."
  },
  {
    "headline": "Google’s Internet cable, Equiano, lands in Nigeria; here’s how it could change your Internet experience",
    "summarized_story": "Share this article:Google has announced the launch of Equiano, a state of the art submarine Internet cable, which is set to land in Lagos, Nigeria.\nThe Internet cable, named after Olaudah Equiano, a historical abolitionist, has a capacity of 144 terabits (18 Terabytes).\nOne of the landmark moments was in 2009, during the launch of the MainOne submarine cable, a private submarine cable that today spans Nigeria, Ghana, and Cote d’Ivoire.\nThere’s a vast submarine cable capacity in Africa that still doesn’t reflect on your download speeds or streaming quality.\nAs of 2020, Africa had a submarine cable capacity of 100 Tbps, but it was only using 10%."
  },
  {
    "headline": "Blockchain-powered insurance: Meet the decentralised insurance protocol, Etherisc, insuring Kenyan farms against bad climate",
    "summarized_story": "Share this article:The concept of decentralised insurance became a theoretical possibility with the emergence of decentralised finance (DeFi).\nWhile DeFi platforms continue to offer borrowing, lending, and staking services, Etherisc, an open-source, decentralised insurance protocol, brings affordable insurance to African farmers away from the complex DeFi protocols.\nFrom traditional insurance to decentralised insuranceEtherisc team with Keyan localsBerende has been in the insurance space since the early 2000s.\nAccording to the Africa Insurance Pulse 2022, insurance penetration in Africa stood at 2.78%, a decline from 2.98% in the previous year.\nHowever, satellite data is not as precise as data obtained from the ground when measuring precipitation."
  },
  {
    "headline": "VIDEO: Group storms Jonathan’s residence, asks him to “ declare for Presidency”",
    "summarized_story": "As pressure continues to mount for the return of former President Goodluck Jonathan, several youths organizations on Friday stormed his Taraba close residence at Maitama, asking him to declare for the 2023 presidential race.\nAs early as 6.30am on Friday, several groups carrying various placards stormed the former President’s residence asking him to answer the clarion calls for his return to power.\nOne of the placards read, “Goodluck Jonathan Declare for Presidency”.\nView this post on Instagram A post shared by BusinessDay (@businessdayng)Recall that President Jonathan had handed over power after losing in a peaceful general election in 2015.\nIn response to the crowd’s calls, the former President later came out to welcome the group."
  },
  {
    "headline": "Obaseki’s industrial reforms: Duport refinery to boost petrol, kerosene, CNG production in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Managing Director of Duport Midstream Company Limited, Dr. Akintoye Akindele, has said the Duport Energy Park will boost the production of naphtha, diesel, kerosene, CNG, LPG and LNG in the state, in furtherance of the state government’s industrialization drive.\nSimbi Kesiye Wabote, to the energy park complex in Egbokor, in Edo State.\nThe Duport Energy Park is the second refinery project in Edo State after the Edo Modular Refinery in Ologbo, which is a 6600bpd facility established through a joint venture between the Edo Refinery and Petrochemical Limited and AIPCC Energy Limited.\nWabote, on his part, said Duport Energy Park is the first integrated energy park in Nigeria, with a 2,500 barrels refinery, CNG Gas processing plant, 10 megawatts power plant, and a data centre.\nA member of the Board of Directors of the Duport Energy Park, Dr. Olatutu Sholeye, expressed delight at the work done, adding that it had created employment opportunities and built capacities among the teeming youth in the community."
  },
  {
    "headline": "Edo excites W’Bank delegates, reels out impact of NEWMAP interventions in communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Nigeria Erosion and Watershed Management Project (NEWMAP) has rolled out the impact of the government’s intervention in flood and gully erosion ravaged communities across the state to the World Bank and 23 other NEWMAP benefitting states.\nThe Coordinator of Edo NEWMAP, Dr. Tom Obaseki, who led other officials of the Edo NEWMAP to an Implementation Completion and Result Mission (ICRM) meeting with the World Bank Project Management team, in Awka, Anambra, showcased the gains of the project’s intervention on communities and residents of the state.\nThe event is an important part of the winding-down process of the NEWMAP intervention in states.\nObaseki said there are 15 intervention sites in various communities in Edo State that have continued to positively impact on residents, opening up communities and improving the livelihoods of people in the state.\nNoting that the NEWMAP has continued to open Edo communities for more economic activities, Obaseki said: “With our interventions, several flood ravaged communities have been impacted."
  },
  {
    "headline": "Edo Govt Unveils Maiden Car Auction In Benin …Shaibu lauds initiative, says it’s catalyst for economic growth – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – Edo State Deputy Governor,Rt.Hon.\nComrade Philip Shaibu, has commended organizers of the Edo Car Auction, saying that the initiative was a catalyst for boosting the economic growth of the State.\nThe Deputy Governor made the remarks, when he spoke through the Permanent Secretary, Office of the Deputy Governor, Mrs. Bose Joy Igbinobaro, during the maiden edition of Edo Car Auction, which held in Benin City, the Edo State capital.\nShaibu lauded the organizers of car auction for their industry and creativity.\nSpeaking earlier, Vision Bearer of the Edo Car Auction 2022, Amb."
  },
  {
    "headline": "ACC Irrua old boys laud Gov. Obaseki’s commitment in public-private partnership…Celebrate five members in his cabinet – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Annunciation Catholic College Irrua old boys Association, ACCIOBA has commended the Governor Godwin Obaseki led administration in Edo State for its commitment to engendering sustainable development in the state through various pragmatic initiatives, including public-private partnership.\n“This model has already been adopted by Abia and Oyo state governments in their respective return of the government college Umuahia and government college Ibadan to the old boys of the schools.\n“As grateful old boys who owe our successes in life to our alma mater, we strongly believe we have a duty to rebuild, protect and sustain the legacy of the founder of ACC Irrua, Rev.\n“But as government we invite you to develop a system that will be sustainable and we are ready to partner with you to improve ACC Irrua,” he added.\nThe old boys from the various branches in Nigeria and North America as well as members of the Edo State Executive, permanent secretaries, and the chief launcher Prince and Princes Peter Okojie attended the occasion."
  },
  {
    "headline": "Police arrest suspected IPOB bomb manufacturer in Imo",
    "summarized_story": "The Imo State police command says it has arrested and paraded a 50-year-old-man, Simeon Onigbo, suspected to be a bomb manufacturer for the Indigenous People of Biafra (IPOB).\nThere have been series of bomb attacks on police facilities and homes of some prominent persons in Imo and other states of the Southeast.\nHowever, he said the suspect had mentioned the names of other suspects in the bomb manufacturing within and outside the states.\n“The Police Operatives immediately mobilised to the hideout of the terror group located at Uba Umuaka in Njaba LGA of Imo State and raided the camp.\nOperatives of the Command are not relenting and all efforts are on top gear to arrest the other suspects,” Police said."
  },
  {
    "headline": "Maintaining peace in Centre of Excellence",
    "summarized_story": "According to investigations, the divisional police officer called in men of Rapid Response Squad without recourse to the area commander, informing officers of RRS that tricycles operators were disturbing the peace of the area when nothing of sort was taking place.\nThe most important thing is peace, Lagos can not afford the breakdown of law and order.\nWe as citizens can not allow the lack of amity between the two transport unions to plunge the state into chaos.\nNo one is above the law, and Lagos State should not keep quiet in this regard but acts fast.\nThe duo are inspiring and should embrace peace in the state."
  },
  {
    "headline": "2023: Jonathan addresses protesters asking him to run, says he’s consulting",
    "summarized_story": "Nigeria’s former president, Goodluck Jonathan, has told protesters asking him to contest for president in 2023 that he is still holding consultations and would make his intention known soon.\nJonathan spoke when came out to address the protesters who gathered in front of his Abuja office chanting his name on Friday.\nWe are begging President Jonathan to forgive us, we have realized our mistakes, we want him back to complete what he started.\nResponding to them, Jonathan asked Nigerian youths to show greater interest in the nation’s political process.\nThe political process is ongoing just watch out."
  },
  {
    "headline": "Emefiele rejects IMF, World Bank’s call for floating of naira",
    "summarized_story": "Godwin Emefiele, governor of the Central Bank of Nigeria (CBN) has, rejected calls for adopting a clean float foreign exchange management approach.\nEmefiele’s stance comes amid calls by the IMF and the World Bank for the Nigerian currency to be floated.\nAnd you do know that this has some impacts on the exchange rate itself.\n“The IMF and World Bank provide advice that we work with.\nWe will continue to engage the IMF and World Bank.”Emefiele said Nigeria would surpass the IMF growth projection for Nigeria."
  },
  {
    "headline": "Buni Commiserates With NAF Over Plane Crash",
    "summarized_story": "Yobe State governor Mai Mala Buni has condoled with the Nigerian Air Force (NAF) and the families of officers who died in the plane crash which occurred on April 19, 2022.\nBuni described the accident as tragic, unfortunate and a huge loss to the country, NAF and families of the departed officers.\n“On behalf of the government and the good people of Yobe State, I condole with the Nigeria Airforce and the families of the deceased officers,” Governor Buni said.\nHe condoled with the family of Flight Lieutenant Abubakar Alkali, an indigene of Yobe State who died in the crash.\n“May Allah grant the souls of Abubakar and the other victim eternal rest and, to their families the fortitude to bear the irreparable loss,” Buni prayed."
  },
  {
    "headline": "Bishop Lauds Gov Ugwuanyi For Sustaining Peace In Enugu",
    "summarized_story": "Christian Onyeka Onyia, has described Governor Ifeanyi Ugwuanyi of Enugu State as a prayerful man who devotes most of his time at night to pray for the progress of the state.\nBishop Onyia also described Ugwuanyi as a good man, stressing that the governor is equally a peaceful man.\nThe cleric told the governor that it was “because you are a peaceful man that this state (Enugu) has remained peaceful”.\nADVERTISEMENTDescribing Ugwuanyi as a prayerful man, Bishop Onyia said: “It is obvious this is part of the strong reasons why this state has been so peaceful.\nUgwuanyi after inaugurating the hospital took a tour of the facility, in the company of Bishop Onyia, his wife, Nneka, the management team, the member representing Enugu East/Isi-Uzo Federal Constituency, Hon."
  },
  {
    "headline": "Kaduna: Ex-Customs Comptroller Joins Guber Race, Vows To Tackle Insecurity",
    "summarized_story": "A retired Assistant Comptroller General of Customs (ACG) Bashir Abubakar has joined the governorship race for Kaduna State and promised to tackle insecurity head on if he emerges the next Governor.\nHe said the Kaduna State governor, Malam Nasir el-Rufai has done alot to move the state forward and he is committed to consolidating on the achievements and engage in new initiatives.\nEarlier at the party’s state secretariat, he said that he decided to contest under the platform of the APC because he believes in its ideology.\nAddressing state party executives at the APC state secretariat, he appreciated the warm reception accorded him.\nBashir, who retired from the Customs Service as an Assistant Comptroller Customs (ACG) has won several awards while serving for his dedicated service."
  },
  {
    "headline": "Kaduna: Ex-Customs Comptroller Joins Guber Race, Vows To Tackle Insecurity",
    "summarized_story": "A retired Assistant Comptroller General of Customs (ACG) Bashir Abubakar has joined the governorship race for Kaduna State and promised to tackle insecurity head on if he emerges the next Governor.\nHe said the Kaduna State governor, Malam Nasir el-Rufai has done alot to move the state forward and he is committed to consolidating on the achievements and engage in new initiatives.\nEarlier at the party’s state secretariat, he said that he decided to contest under the platform of the APC because he believes in its ideology.\nAddressing state party executives at the APC state secretariat, he appreciated the warm reception accorded him.\nBashir, who retired from the Customs Service as an Assistant Comptroller Customs (ACG) has won several awards while serving for his dedicated service."
  },
  {
    "headline": "2022 HAJJ: FCT Gets 1,537 Seats From NAHCON",
    "summarized_story": "Federal Capital Territory Administration (FCTA) has said it has been allocated 1537 seats for the 2022 hajj by the National Hajj Commission of Nigeria (NAHCON) for this year’s hajj exercise.\nThe director of the FCT Muslim Pilgrims Welfare Board, Mallam Muhammad Danmallam disclosed this while briefing top management staff of the board in his office after a meeting with NAHCON and state chief executives of States Muslim Pilgrims Welfare boards, commissions, and agencies.\nIn a statement signed by Muhammad Aliyu, Public Relations Officer, FCT- MPWB, Danmallam advised those who deposited in respect of the Hajj to ensure that their deposits reach up to 2.5 Million before the conclusion of the final hajj fare.\nHe said due to current realities, the cost for this year’s hajj is projected to be about 2.5 Million and therefore stressed the need for the intending Pilgrims to top up their deposit and await the final hajj fare after conclusion with service providers in Saudi Arabia.\nADVERTISEMENTHe also advised those who enrolled in the Hajj Savings Scheme with Ja’iz bank to ensure that their deposit is up to 2.5 million which would ease their balance as soon as the hajj fare is finalized."
  },
  {
    "headline": "IPOB's bombmaker Simeon Onigbo arrested in Imo",
    "summarized_story": "Simeon Onigbo, the man alleged to be manufacturing bombs for The Indigenous People of Biafra, has been arrested in Imo State.\nAbbatam said the Onigbo had confessed to the crime and promised to reveal the hideouts of the terror group.\nAccording to Abbatam, Onigbo used to produce locally-made bombs used in attacking police divisions and other government facilities in Imo.\n“In the course of the raid, one Simeon Onigbo, aged 50, was arrested.\n“Other items are dry Sand weighing 40 pounds and red sand weighing 10 pounds, gun powder weighing 30 pounds, spa half bag of charcoal, 30 pieces of Electronic Motorcycle Batteries, and Seven Lengths of eight millimeters iron rods,” he said."
  },
  {
    "headline": "Late Oba Adetunji's younger brother passes away",
    "summarized_story": "Ambali Adetunji, the younger brother of the late Olubadan of Ibadanland, Oba Saliu Adetunji, has passed away, aged 84.\nAmbali died on Tuesday and was buried the same day according to Islamic rites at his Odo-Oba, Boluwaji, Ibadan home, The Nation reports.\nHe was the Aare Musulumi of Odo-Oba in Ibadan, overseeing the music recording business of his brother, the ex-Olubadan.\nAmbali, from the early ‘80s till the last decade, together with the late Oba Adetunji, redefined Fuji music.\nHe died barely four months after the passing of his elder brother."
  },
  {
    "headline": "BREAKING: : Goodluck Jonathan Finally Speaks",
    "summarized_story": "After chanting and screening his name for minutes, Ex-President Goodluck Jonathan, Friday came out to receive protesters who stormed his Abuja office.\nRecall that some pro-Jonathan protesters stormed his office, demanding he contest in the forthcoming presidential election.\nWe are begging President Jonathan to forgive us, we have realized our mistakes, we want him back to complete what he started.\nResponding to them, Jonathan asked Nigerian youths to show greater interest in the nation’s political process.\nThe political process is ongoing just watch out."
  },
  {
    "headline": "How Five Students Organised Sexual Game During Dubai Trip – Chrisland Narrates",
    "summarized_story": "While the Lagos State Government and the state Police Command continue to investigate sexual actions involving five Chrisland school pupils in Dubai, United Arab Emirate (UAE), the school’s management has revealed that the act occurred during their last trip to the Arab country.\nThe pupils committed the actions in a room on the 11th floor after their lecturers ordered them to sleep early so they wouldn’t miss their early morning flight back to Nigeria, according to the management.\nAfter ensuring that all pupils were in their assigned rooms, the teachers proceeded to their rooms to sleep for a bit before continuing their all-night surveillance to guarantee that there were no gaps throughout their week-long stay in Dubai, according to the report.\nAccording to the management, the students left their rooms and gathered at the spot for the sexual game during the time when the teachers went into their rooms and returned to their nighttime routine.\nAs previously stated, the school assigned three children to a room in the hotel during the trip, with female students being assigned to the fourth level and male students being sent to the eleventh floor."
  },
  {
    "headline": "BREAKING: Women, Youths March For Jonathan’s Return In 2023",
    "summarized_story": "On Friday morning, a group of women and youths marched to demand the return of former President Goodluck Jonathan in 2023.\nThey arrived in four buses and invaded Jonathan’s Taraba Close, Maitama office to make their case.\nThey carried placards with various inscriptions pleading with the former President to resign.\nSome of the placards read: “Goodluck declare now”; “We are sorry, Goodluck don’t abandon us, come back”; “Goodluck please come”; “Goodluck we love you” among many others."
  },
  {
    "headline": "Ogoni Cleanup May Not Be Completed Under Buhari – FG",
    "summarized_story": "The Federal Government announced in Abuja on Wednesday that the Ogoni Cleanup Project would not be finished in the time remaining under the current administration.\nAfter a meeting with the President, Major General Muhammadu Buhari (retd.)\n“They are phased projects; we do not envisage that we can finish the entire project within the lifetime of this government.\n“There is nothing miraculous about our approach to the cleanup operations; it is going to be a very pragmatic, practicable and quick-win solution.\n“However, they are phased projects, we do not envisage that we can finish the entire project within the lifetime of this government."
  },
  {
    "headline": "World Bank tells Nigeria to drop fuel subsidy",
    "summarized_story": "By Emmanuel ObisuePresident of the World Bank Group, David Malpass has asked the Federal Government to have a rethink on its policy on fuel subsidy, stating that the huge amount being expended on the policy could be channeled into other critical sectors.\nMalpass noted this on Wednesday at a media briefing at the ongoing World Bank/International Monetary Fund Spring Meetings in Washington DC, United States.\nIt would be recalled that the Nigerian Senate last week approved N4 trillion for petrol subsidy in 2022.\n“So, we encourage that when there is need for subsidy, either food or for fuel, that it should be carefully targeted at those most in need of it.\nThe World Bank had in November 2021 warned Nigeria not to delay any further in removing the fuel subsidy which had been described as a major drain and waste on the economy."
  },
  {
    "headline": "Naira depreciates, sells at N419.50 to dollar",
    "summarized_story": "Agency reportThe Naira exchanged at N419.50 to the dollar at the Investors and Exporters window on Thursday.\nThis represents 0.28 per cent depreciation, compared to N418.33 to the dollar recorded on Wednesday.\nAn exchange rate of N444 to the dollar was the highest rate recorded within the day’s trading before it settled at N419.50.\nThe Naira sold for as low as N410 to the dollar within the day’s trading.\nA total of $124.85 million dollars was traded in foreign exchange at the official Investors and Exporters window on Thursday."
  },
  {
    "headline": "ONU inducted into ASURI hall of fame",
    "summarized_story": "By Eunice OrikeThe Minister of Science, Technology and Innovation, Dr. Ogbonnaya Onu, has made history as he became the first inductee into the hall of fame of the Academic Staff Union of Research Institutes ASURI.\nThis historical event took place at the sensitisation workshop of the staff of FMSTI on the full implementation of the Presidential Executive Order 05 yesterday in Abuja.\nThe Minister enunciated that the essence of the Executive Order 5, is to ensure that Nigeria acquires technologies that will help in positioning the nation towards self-sufficiency.\nHe said, “The Executive Order is revolutionary as it is a contribution of the Ministry towards transforming the nation to the level of greatness ordained by God”.\nThe National Coordinator of the Strategy implementation task office of the Presidential Executive Order No."
  },
  {
    "headline": "Okowa says Delta Agro-Industrial Park to be ready Nov 2022",
    "summarized_story": "By Anastacia Eluwa, AsabaGovernor Ifeanyi Okowa of Delta State on Thursday, said the Agro-Industrial Park being executed by his administration at Aboh-Ogwashi, Aniocha South Local Government Area, would be ready for inauguration in November, 2022.\n“Let me appreciate the level of cooperation we have had with the Ogwashi-Uku community because they gave us over 180 hectares of land for the Agro-Industrial Park.\n“The contractor has promised to deliver the project towards the end of November which means if they start the road project now, they will still have time during the break in August and in the later part of October to finish with the road project,” Okowa said.\n“The park is a community of its own where you have various agro-processing industries co-sharing common facilities for agro-indstrialisation in the state,” he stated.\nHe said that the state government was working with the Federal Ministry of Trade and Investment to designate the park as an Export Processing Zone."
  },
  {
    "headline": "BoI grows profit by 75% to N62bn in 2021",
    "summarized_story": "By Kehinde Ibrahim LagosTHE Bank of Industry Group has reported a profit before tax of N62.28 billion for the financial year ended December 31, 2021; 75 per cent higher than the 2020 profit of N35.54 billion.\nDiscounted for tax, the profit for the year under review comes to N53.41 billion, compared to N31.59 billion in 2020.\nAlso consistent with its growth trajectory, the group grew its total equity to N384.84 billion for the year ended 2021; over the 2020 position of N336.48 billion.\nThe Bank made an after tax profit of N52.60 billion in 2021, compared to N30.90 billion in 2020.\nIn the five years up to 2021, BOI promoted financial inclusion by supporting the expansion of over 3 million enterprises, thereby creating over 7 million jobs."
  },
  {
    "headline": "Teenager Killed, Shops Razed As Petrol Tanker Explodes In Lagos",
    "summarized_story": "A teenager has been killed after a tanker ladened with Premium Motor Spirit (PMS), also known as petrol exploded along the Lagos – Abeokuta Expressway.\nThe National Emergency Management Agency (NEMA) confirmed the incident on Friday, saying it occurred at about 2:06am.\nIt explained that the tanker was conveying 45,000 litres of petrol before it crashed and spilled its content on the road.\nThe incident occurred at the Ajegunle Bus-Stop of Alagbado (a border community) axis of the highway, causing gridlock as residents ran for safety.\nThe agency, however, regretted that a 15-year-old boy identified as Oluwatobi Lawal, died in the incident while the inferno consumed 42 makeshift shops."
  },
  {
    "headline": "Over One Million Children In Africa Have Taken Malaria Vaccine – WHO",
    "summarized_story": "The World Health Organisation (WHO) says at least one million children in Africa have received one or more doses of the world’s first malaria vaccine.\nChildren in Ghana, Kenya, and Malawi were captured in the pilot programme coordinated by WHO, the agency said in a statement on Thursday ahead of World Malaria Day.\nThe malaria vaccine pilots, first launched by the government of Malawi in April 2019, have shown that the RTS,S/AS01 (RTS,S) vaccine is safe and feasible to deliver, and that it substantially reduces deadly severe malaria, it added.\nIt revealed that no fewer than $155 million has been secured from Gavi – the Vaccine Alliance to support the introduction, procurement, and delivery of the malaria vaccine for Gavi-eligible countries in sub-Saharan Africa.\nWHO also welcomes the news from BioNTech, manufacturer of the Pfizer-BioNTech COVID-19 vaccine, that it aims to develop a malaria vaccine using mRNA technology."
  },
  {
    "headline": "VIDEO: ‘It’s Best To Keep Silent,’ Monguno Cautions El-Rufai On Intelligence Operations",
    "summarized_story": "﻿The National Security Adviser (NSA), Babagana Monguno, has cautioned Governor Nasir El-Rufai of Kaduna State against giving off intelligence to terrorists.\nHe explained that while the governor might have done so not to sabotage the efforts of the security agencies but to give respite to victims’ families, it was best to just keep mum sometime.\nMonguno stated this on Thursday while briefing State House correspondents at the end of a meeting with President Muhammadu Buhari and the service chiefs in Abuja.\n“Governor Nasir El-Rufai spoke about the security agencies, saying we know who they (terrorists) are, where they are,” he said.\nIn further advice to Governor El-Rufai, the NSA said, “Even if they say we know where they (terrorists) are, that in itself is already a problem."
  },
  {
    "headline": "Death Toll In Taraba Bomb Blast Rises To Six As ISWAP Takes Responsibility",
    "summarized_story": "The Anti-bomb squad of the Nigeria Police Force were also on ground combing the area for a possible bomb detonation.\nREAD ALSO: Bomb Explosion Rocks Cattle Market In TarabaMeanwhile jihadists affiliated to the Islamic State have claimed responsibility for the attack.\nISWAP has become the dominant threat in the northeast since the death in May 2021 of Abubakar Shekau, the former leader of rival group Boko Haram.\nMore than 40,000 people have died and around two million have fled their homes since the insurgency began in 2009.\nThere has been growing concern about increasing ties between jihadists and bandits who are motivated by financial motives with no ideological leaning."
  },
  {
    "headline": "Obama Calls For Tigher Reins On Big Tech",
    "summarized_story": "Former US president Barack Obama on Thursday called out Silicon Valley, urging tech companies to stop dividing society and undermining democracy, and for political leaders to help guide the way with regulation.\nObama said that online platforms have found that “inflammatory, polarizing content” attracts online audiences with money to be made at the expense of democracy.\nObama advocated modifying the US law known as Section 230, which spares platforms from liability for what users share on them.\n“These big platforms need to be subject to some level of public oversight and regulation,” Obama said.\n“Tech platforms need to accept that they play a unique role in how we, as a people and people around the world, are consuming information and that their decisions have an impact on every aspect of society,” Obama said."
  },
  {
    "headline": "2023: Yiaga Africa condemns exorbitant fees for party's nomination Forms",
    "summarized_story": "A civil society organisation (CSO), Yiaga Africa, has expressed concern over the exorbitant cost of nomination forms of political parties for the 2023 general elections.\nAccording to Yiaga Africa, the high cost of nomination forms being charged by political parties in preparation for the 2023 general elections was a huge disservice to teeming women, youth and persons with disabilities (PWDs), who nurse the ambition to run for elective offices in next year’s general elections.\nRead the full statement below:Yiaga Africa notes with utmost concern the high cost of nomination forms being charged by political parties in preparation for the 2023 general elections.\nWe note that this is a huge disservice to teeming women, youth and persons with disabilities (PWDs) who nurse the ambition to run for elective office in next year’s general elections.\nWe welcome the concessions made by some political parties to women, youth and PWDs and call for a further downward review of the cost of nomination forms to allow for an inclusive process without discrimination to any group or demography of the society."
  },
  {
    "headline": "Fmr Slovak PM, Róbert Fico, allies charged with organised crime",
    "summarized_story": "Former three-time Prime Minister Róbert Fico and former Interior Minister Róbert Kaliák, who have dominated Slovakian politics for the past 15 years, were on Wednesday charged with organised crime offenses.\nFico, who is still a member of parliament for the opposition Smer party, cannot be arrested without the legislature’s permission.\nFico was accused of being the leader of a “criminal organization” that includes former police director Tibor Gapár and Slovak oligarch Norbert Bodor, according to the indictment.\nHe stood for president in 2014, while serving his second term as Prime Minister of Slovakia, but was defeated by Kiska by nearly 20 percentage points.\nFico accused Kiska of “making his money from usury on impoverished people,” “misusing his charity for political goals,” and having “close ties to Scientology” during an exceptionally acrimonious campaign."
  },
  {
    "headline": "BREAKING: Lagos GAC okays Sanwo-Olu for second term",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu has secured the consent of the Governance Advisory Council (GAC) to run for a second term in office.\nThe GAC, the apex body within the state ruling political class of All Progressives Congress (APC) approved second term for Sanwo-Olu at its meeting this afternoon at State House, Marina.\nWith the APC governorship election primaries slated for May 27, the speculation on whether Sanwo-Olu will get a second term has become rife among the business and political elites in the state, especially members of the APC."
  },
  {
    "headline": "Akeredolu backs wife's senatorial ambition In Imo",
    "summarized_story": "Ondo state governor, Oluwarotimi Akeredolu has declared support for his wife’s Senatorial ambition.\nThe governor’s declaration was contained in a statement he personally signed.\nOndo First Lady, Betty Anyanwu- Akeredolu has shown interest to run for Imo East Senatorial SeatRecall that the state opposition People’s Democratic Party had on Sunday alleged that the governor was using the state fund to sponsor the wife’s Senatorial ambition in Imo state.\nBut in a subtle response, Akeredolu, in the statement, said he believed in the mission of the First Lady to emancipate women from the shackles of all forms of oppression.\nHe described her as a fiercely independent personality who is never afraid to voice her dissent on any issue."
  },
  {
    "headline": "N100m Presidential Form Meant to Shut Out Unserious Aspirants, APC Women Leader Says",
    "summarized_story": "Edu said the APC National Working Committee (NWC) had consciously fixed the rate as part of a mechanism to ensure only serious aspirants were on the ballot.\nShe stated, “For all we care, N1.5 million for a House of Assembly nomination form is fair to the general population.\nIn fact, all those buying the N100 million and N50 million nomination forms should be investigated for fraud.”He further stressed, “We, the PDP, are different.\nThe APC had fixed N30 million for the ‘expression of interest form’ and N70 million for the ‘nomination form’, making a total of N100 million.\nThe N100m is also over 100 per cent of the N40 million fixed by the same APC for the 2018, presidential nomination form."
  },
  {
    "headline": "Nigeria’s Military Not Doing Enough to End Insecurity Despite Logistics Provided, Buhari Says",
    "summarized_story": "In a clear indictment, a disappointed President Muhammadu Buhari, on Thursday, told the security agencies that they were not doing enough to end the security challenges in the country, despite enormous logistics provided by his administration.\nBuhari frowned on the fact that his previous directives to the military to end insecurity in the country had not yielded much results.\nMonguno said there was no way the president would be happy, when people were being killed on a daily basis.\nThe NSA added that the president was of the belief that enough was not being done by the security agencies, despite the logistics being provided.\nHe condemned the recent spate of attacks on police officers, facilities and other police operational assets across the country."
  },
  {
    "headline": "Nigeria’s First Lady Aisha Buhari to Host Presidential Aspirants of All Parties on Saturday",
    "summarized_story": "Nigeria’s First Lady, Mrs. Aisha Buhari, will on Saturday, host presidential aspirants from all political parties to an Iftar at the State House, Abuja.\nIt was, however, clarified that the ‘drop your phone’ instruction might not apply to some of the attendees, including Vice President Yemi Osinbajo, governors and ministers that would be attending.\nThis is a standard operational protocol in the Villa, when you are having either of the three occupants of the presidency.\n“Whether the president is having an event or the vice-president is having an event or the first lady is having an event, because outsiders will come.\nThat’s the security and standard protocol."
  },
  {
    "headline": "Nigeria’s Central Bank Chief Emefiele Defends Exchange Rate Policy, Says Country Facing Peculiar Challenges",
    "summarized_story": "Central Bank of Nigeria (CBN) Governor, Mr. Godwin Emefiele, on Thursday defended the apex bank’s managed-float exchange rate system, stressing that it was adopted to address the peculiar challenges the country faces.\nThey both spoke during an interview with journalists on the sidelines of the IMF/World Bank Spring Meetings in Washington DC, United States of America.\n“Nigeria’s situation is very peculiar and that is why we have continued to engage the IMF and World bank to show understanding in our local problems.\nResponding to a question on the commendation received by the IMF over the positive momentum in Nigeria’s non-oil sector, Emefiele said: “I am happy that the IMF and World Bank are seeing efforts to drive non-oil exports.\n“It went up to almost 18 per cent again and we have managed to bring it down to below 16 per cent."
  },
  {
    "headline": "Ahead of Presidential Primary, Nigeria VP Osinbajo Begins Second Nationwide Consultation, to Meet with Party Delegates",
    "summarized_story": "Nigeria’s Vice President, Prof. Yemi Osinbajo, is expected to begin his second round of nationwide consultation ahead of the presidential primary of the All Progressive Congress (APC) slated for June 1, 2022.\nHe said the vice president would be meeting with APC delegates in all the local governments across the country and might start this weekend in Oyo State.\nOsinbajo who had after a recent nationwide consultation, declared intention to succeed Buhari after months of nationwide consultation, was expected to meet with APC delegates from his home state, Ogun.\n“Without an iota of doubt, I am certain that all the knowledgeable people here can attest to the qualities and competence of Professor Yemi Osinbajo.\n“Unlike the history of some other political parties, records show that neither APC presidential ticket nor its VP slot had ever been won by throwing money around but by populist endorsement from north and south.”"
  }
]