[
  {
    "headline": "Soludo, Uba, Ozigbo win in strongholds, Anambra poll continues today",
    "summarized_story": "Three top contenders in the yet-to-be concluded Anambra State governorship election, which commenced on Saturday, have won their respective polling units.\nOkeke, who voted at Ward 3, polling unit 005, Umueze Awozu, Enugwu-Ukwu, said he did so to dispel rumours that he had returned to APGA.\nThe BVAS, however, malfunctioned in his polling unit, causing a delay for hours.\nINEC extends voting till SundayMeanwhile, INEC extended voting till Sunday in areas where voting could not be concluded on Saturday.\nIt was also observed that three policemen were assigned to each polling unit while soldiers and men of the Nigeria Security and Civil Defence Corps patrolled the major highways and streets."
  },
  {
    "headline": "Amended charges against Nnamdi Kanu laughable, ploy to keep him in detention – Odinkalu",
    "summarized_story": "IPOB in the context of the Anambra election was very much a franchise used by a motley group of people with divergent goals.\nThat is quite clear and a lot of the insecurity towards the Anambra election was attributable to this tendency.\nIt is not as if the Anambra election is some kind of accident or surprise.\nSo, the crisis in the South-East Nigeria has to be seen in the context of larger trends in Nigeria.\nOn the sit-at-home order, the South-East governors have on several occasions asked the people to disregard the order but some of those who dared it were attacked."
  },
  {
    "headline": "I got pregnant at 13 because peers introduced me to ‘early sex’ – Actress Ada Ameh",
    "summarized_story": "Nollywood veteran, Ada Ameh, has stated that she got pregnant at 13 years old because her peers introduced her to sex at an early age.\nKnown for her major role in The Johnsons series, the actress revealed that she was influenced by her peers and this led her to getting pregnant at an early age of 13.\nWhen asked about the cause of her early pregnancy, she said, “It wasn’t my parents.\nThey introduced me to ‘early sex’.\nDespite her early motherhood, the actress, in October 2020, lost her daughter, Aladi Godgift, who was over 30 years old."
  },
  {
    "headline": "Anambra Election: Some transporters paid upfront didn’t render their services — REC",
    "summarized_story": "The Anambra State Resident Electoral Commissioner, REC, Nwachukwu Orji, says some of the transporters paid to move election materials in the gubernatorial poll failed to render their services despite being paid upfront.\nHe also decried some of the ad-hoc staff who pulled out prior to the election day.\n“The challenge we had was that, some of the transporters we make arrangement with and assigned certain fee upfront declined to render their services.\nAlso, some of the recruited ad-hoc staff dropped out and could not continue in the process,” he said.\nAlthough Mr. Orji said the extension is peculiar to polling units that did not start voting at 8:30am, several polling units in Awka South had closed polls as of the time of the announcement."
  },
  {
    "headline": "Institute seeks to reposition Nigeria’s social work practice",
    "summarized_story": "By Luminous Jannamike, AbujaAgainst the backdrop of the growing effects of the COVID-19 pandemic and insecurity in the country, the Institute of Social Work of Nigeria, ISOWN, has urged practitioners to increase their skill set as part of measures to remain relevant.\nIt stated this in a press release made ahead of its 12th Annual International Conference with the theme: ‘Positioning Social Work Practice in Pandemic and Crises Situation’According to ISWON, the conference will address the root cause of social problems, examining existing approaches to these issues and developing new and well-targeted research direction.\n“The major focus of the conference this year is to provide social work experts and professionals in a related field, a platform to find common grounds through which they can share practical advice, engage tactfully and improve advocacy.\n“Also, is to create synergy and engage relevant organs of government to give support in the pursuit of combating social problems and policy formulation amongst others.\nHe, however, said: “We cannot underestimate the importance of a continuous awareness campaign on social ill and the need to improve social skills amongst experts at all levels.”"
  },
  {
    "headline": "Association of Friends holds presidential night, inducts new members",
    "summarized_story": "Prominent Businessman, Dr Kesington Adebukola Adebutu will lead an array of dignitaries from across the country to the annual Presidential night and Induction of new members of the famous social club, the Association of Friends which will take place on Sunday, November 14 in Lagos.\nApart from Dr Adebutu who is the Patron of the club, other prominent guests expected at the usually colourful event include Prominent Businessman, Alhaji Tajudeen Owoyemi who will be the Chairman of the event.\n“ The Presidential night is an annual event hosted by the Association of Friends.\n“As the name implies, Association of Friends was formed by some jolly childhood friends and to be a member, you have to be recommended by two friends amongst other qualities before being admitted as a temporary member of the Club.\nThat condition is maintained as an integral part of our admission policy."
  },
  {
    "headline": "Anambra Election: Election materials snatched, destroyed in Oba, Idemili — REC",
    "summarized_story": "I don’t have that report, CP saysBy Arogbonlo IsraelThe Anambra State Resident Electoral Commissioner, REC, Nwachukwu Orji has decried the distruption of process in the governorship election in some local government areas of the state where he claimed election materials were “snatched and destroyed by community members” for undisclosed reason.\nAccording to him, “Part of the report we got regarding our deployment in different polling units — we were not able to finish deployment in some polling units because of several reasons.\nWhile election materials were snatched and destroyed in some other places.\n“I can categorically state that, I don’t have that report (snatching of election materials).\nThe voting in the governorship election in the state may extend to Sunday in some polling units where electorates could not vote as a result of technical difficulties among other logistic reasons."
  },
  {
    "headline": "Ikoyi building collapse: Death toll hits 42, 15 survivors-Sanwo ― Olu",
    "summarized_story": "By Olasunkanmi AkoniLagos State Governor, Babajide.\nSanwo-Olu, has disclosed that 42 deaths and 15 survivors have been recorded so far from the building collapse on Gerrard Road, Ikoyi, Lagos.\nREAD ALSO: Corpses retrieved form collapsed building in Ikoyi ready for identificationSanwo-Olu stated this when he visited the site on Saturday, in company of All Progressives Congress, APC, National Leader, Asiwaju Bola Tinubu and Nasarawa State Governor, Engr.\nAccording to Sanwo-Olu after briefly addressing the media, “9 survivors were initially recorded with 42 deaths now.\nWe have additional six survivors that were newly discovered at the Police Hospital Falomo, making total survivors 15.”Vanguard News Nigeria"
  },
  {
    "headline": "INEC to begin collation of results for Anambra Sunday morning",
    "summarized_story": "The Independent National Electoral Commission, INEC, has said that collation of results from local government areas for the Anambra governorship election held on Saturday will begin on Sunday by 10am.\nHe added that: “The election is by no means over, we have now entered a critical stage of the process, namely collation of results.\nWe have made adequate arrangement for collation of results at the registration area, local government areas and the state level.\n“Results for polling units are already being uploaded in our IRev portal and registration area and the registration area collation has been progressing well.\n“I’m glad to announce that state collation will commence tommorow at the state collation center."
  },
  {
    "headline": "Ikoyi building collapse: Casualties hit 42 as Tinubu, Sanwo-Olu visit site",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu, on Saturday, visited the site of the building that collapsed in Ikoyi during the week.\nSanwo-Olu was in company of his predecessor, Bola Tinubu and Nasarawa State Governor, Abdullahi Sule.\nSanwo-Olu announced that 49 families had filled the missing persons’ register as at Saturday morning.\nThe document is helping the government to reconcile the details of victims rescued alive and medically account for corpses recovered.\nSurvivors in hospitals have been given financial support”, Sanwo-Olu disclosed."
  },
  {
    "headline": "It is time to implement FOI Act to serve its purpose – Ibadan chief, Adegoke",
    "summarized_story": "An Ibadan chief, Oloye Adegboyega Adegoke, has declared that it is now time to ensure implementation of the Freedom of Information Act signed into law a few years ago.\nIt was gathered that the FOI Act has not been fully implemented in most of these agencies.\nAdegoke while speaking, insisted that it is high time the FOI act is properly put into practice in Nigeria.\n“I want to say that the existing version of FOI Act should be allowed to serve its intended purpose by making public records and information available to citizens.\n“While it is difficult to completely eradicate corruption, if the FOI Act is vigorously implemented in Nigeria, we shall reduce corruption to the barest minimum”."
  },
  {
    "headline": "Ex-Gov Nyako’s CSO detained over alleged illegal N80m land deal",
    "summarized_story": "A former Chief Security Officer (CSO) to ex-Governor Murtala Nyako, Sheriff Rabiu, has been detained by the Directorate of State Services (DSS).\nSheriff, a retired Assistant Commissioner of Police, was arrested and detained on Friday, according to information obtained Saturday, following a petition by management of Sabore Farms Ltd, an outfit belonging to Murtala Nyako.\nMurtala Nyako, a retired naval chief, was the elected governor of Adamawa State between 2007 and 2014.\nNyako who had always been a big-time farmer, returned to his expansive farm, the Sabore Farms Ltd, located at his home Mayo-Belwa local Government Area, after leaving Government House following a controversial impeachment in 2014.\nThe petition alleges that Sheriff changed the sales agreement to Ashran Nigeria Limited, a company which the complainant believes belongs to Sheriff."
  },
  {
    "headline": "COP26: Millions of professionals ring climate-related health crisis alarm",
    "summarized_story": "Millions of health professionals and climate experts on Saturday at COP26 demanded an urgent action to tackle the growing climate-related health crisis.\nUnder the aegis of Global Climate and Health Alliance, they made that call at the Global Conference on Health and Climate Change in Glasgow.\nGlobal Climate and Health Alliance says new challenges are posed to infectious diseases control, deploring the increase in pressure on natural, economic and social systems.\nDr Tedros Ghebreyesus, Director-General, World Health Organization (WHO) said countries must unite to highlight the unprecedented threat that climate change poses to humans.\nDr Jeni Miller, Executive Director, Global Climate and Health Alliance, said well-being citizens across the world must become the beating heart of climate action."
  },
  {
    "headline": "Collation to begin Sunday morning, says INEC",
    "summarized_story": "The collation of Anambra State governorship election results will begin on Sunday morning, the Independent National Electoral Commission (INEC) has said.\nThe Resident Electoral Commissioner (REC), Dr Nkwachukwu Orji, briefed reporters and civil society groups at the INEC office in Awka.\n“We have made adequate arrangement for collation of results at the registration area, local government areas and the state level.\n“Results for polling units are already being uploaded in our IRev portal and registration area and the registration area collation has been progressing well.\n“I’m glad to announce that state collation will commence Sunday at the state collation center."
  },
  {
    "headline": "Ikoyi building collapse: Six more survivors rescued from debris",
    "summarized_story": "The number of persons rescued from the Ikoyi collapsed building increased to 15 on Saturday after six others were brought out of the debris alive.\nHe said: “We have been able to identify six others who were on site when the building collapsed.\n“We have taken the full records of survivors in the incident, and this makes it 15 people rescued.\n- Advertisement -“Among the latest survivors are a 38-year-old Glory Samsom, Ndajor Ahmed, Yunusa Abubaka, Ajiboye Habib, Jeremiah Samson, and one man identified as Emem.\nHe said the register has helped the government reconcile details of those rescued and also account for bodies recovered."
  },
  {
    "headline": "PDP’s loss in 2015 a blessing, says Ayu",
    "summarized_story": "The National Chairman-elect of the Peoples Democratic Party (PDP), Dr Iyorchia Ayu, has said the party’s loss of the presidential election in 2015 was a blessing in disguise.\nSpeaking with reporters in Abuja, Ayu said the PDP under his watch will reposition the party to take back power in 2023.\n“In a democracy, it’s normal for a political party to lose power.\nIf we didn’t lose power, maybe we would have become a dictatorship or become complacent.\n“To believe in democracy…there must have been something we were doing wrong or must have done wrong that the Nigerian electorate shifted.”"
  },
  {
    "headline": "Kidnapped pupils regain freedom after N6m ransom",
    "summarized_story": "Two female pupils of Gloryland Group of Schools, Igarra in Akoko-Edo Local Government Area of Edo State, have been freed.\nThey were released after the parents paid N6million ransom.\nIt was gathered that the primary school pupils were released unhurt.\nTheir vehicle was intercepted at gunpoint at 5:35 p.m. along Igarra-Auchi Road, near Ikpeshi in Akoko-Edo council.\nEdo Police Public Relations Officer (PPRO), Bello Kontongs, a Superintendent of Police (SP), could not be reached."
  },
  {
    "headline": "Breaking: Anambra deputy governor, Okeke, votes in Enugwu-Ukwu, says process transparent",
    "summarized_story": "From Obinna Odogwu, AwkaDeputy Governor of Anambra State, Dr Nkem Okeke, at exactly 10:04am cast his vote in the ongoing governorship election in the state.\nHe voted at polling unit 005, Ward 3, Umueze Awovu in Enugwu-Ukwu community in Njikoka Local Government Area.\nThe deputy governor, while fielding questions from newsmen shortly after casting his vote, said that he was impressed with the process so far.\nMore details coming"
  },
  {
    "headline": "Jubilations as Lawan, Kalu bag chieftaincy titles in Argungu",
    "summarized_story": "There were jubilations in the ancient town of Argungu in Kebbi State on Friday when the Emir, Alhaji Samaila Mera and the Argungu Emirate Council, honoured the Senate President, Ahmad Lawan and the Chief Whip, Orji Uzor Kalu, with chieftaincy titles.\nLawan was honoured with the title of Ganuwan Kabi (Defender of Kabi Kingdom) while Kalu received therevered traditional title of Kibiyan Kabi (Commander of the Archers).\nThe occasion was part of the activities to commemorate the 25th anniversary of the coronation of the Emir.\nLawan and Kalu who arrived Kebbi with their entourage were duly received by the state Governor, Abubakar Atiku Bagudu and the enthusiastic and good people of Kebbi State .\nKalu was also presented a bow and arrow which signified the meaning of the title."
  },
  {
    "headline": "Why grazing routes won’t work in Nigeria -Akeredolu",
    "summarized_story": "From Bamigbola Gbolagunte, AkureOndo State governor, Mr. Rotimi Akeredolu, has declared that grazing routes would not work in Nigeria because the country can no longer continue to live in the past.\nThe governor said many states in the country have signed the anti-open grazing laws to protect the people and their means of livelihood.\nAkeredolu declared that the Western Nigeria Security Network Agency, codenamed Amotekun Corps was effectively filling the vacuum created by the overstretched conventional security agencies, particularly the police in the state.\nGovernor Akeredolu noted that Amotekun Corps was a product of circumstance, essentially created to fill the obvious security gap in the state for the security of all.\nThe governor stressed that Amotekun’s efforts with the help of other security agencies have brought relative peace to the state."
  },
  {
    "headline": "Don’t let Igboho die, Yoruba elders warn FG, Benin govt",
    "summarized_story": "They include the pan Yoruba socio-cultural and political organisation, Afenifere, as well as the Yoruba Council of Elders (YCE) and Ilana Omo Oodua (IOO).\nThey appealed to the government of Benin Republic to allow him access to medical help in any place of his choice.\nWe plead with the government of Benin Republic to grant him the opportunity to get medical help there.\n“We have confidence that Benin Republic that normally follows the rule of law, will ensure that justice is done,” he said.\nIf anybody tells you it is the government of Benin Republic that is holding Igboho, it is a lie."
  },
  {
    "headline": "Baba Ijesha facing another defilement allegation, police officer tells court",
    "summarized_story": "Wahab Kareem, Assistant Superintendent of Police, on Friday told an Ikeja Special Offences Court that Nollywood actor, Olanrewaju James alias “Baba Ijesha” was facing another allegation of child defilement.\nKareem, attached to the State Criminal Investigation Department (SCID), Yaba, Lagos, testified as the fifth prosecution witness in James’s trial for defilement of a minor.\nThe landlord showed us an apartment and said: “This is where Baba Ijesha used to stay.\nHe added that James was not taken to Ikorodu to counter the other claim of defilement due to security reasons.\nActress and comedienne Adekoya, alias Princess, the foster mother of the alleged victim, was present in court."
  },
  {
    "headline": "Live Updates: Anambra Governorship Election",
    "summarized_story": "(NAN)7:03PMAnambra Election: Counting of Votes Under way Counting of votes has started in some polling units in Awka township after Saturday governorship election in Anambra.\nNkwachukwu Orji said that this revised closing time applies to areas where Polling Units opened after the commencement period of 8.30am.\n(NAN)10:31AMAnambra Dep Gov Votes, Hails BVASDavid-Chyddy Eleke in AwkaAnambra State Deputy Governor, Dr Nkem Okeke, has voted at his polling unit, Umueze Awozu, Enugwu-Ukwu Ward 3, polling unit 005 at exactly 10:04am.\nAt Nodu Okpuno that has over six polling units, INEC officials were yet to come as at 8.30 am.\n10:10 AMVoters Awaiting INEC Officials in NriSegun JamesThere is tension in Nri Boys High School, Nri in Anaocha Local Government Area as no INEC officials nor materials has arrived as the people wait."
  },
  {
    "headline": "INEC Extends Voting over BVAS Glitches",
    "summarized_story": "Chuks Okocha in AwkaIn view of the malfunctioning of BVAS voting system, the Independent National Electoral Commission (INEC) has extended the period for opening and closing of Poll from 8.30am to 4.00pm.\nNkwachukwu Orji said that this revised closing time applies to areas where Polling Units opened after the commencement period of 8.30am.\nAccording to him, “The extension of time arose out of several field reports that voters have had problems with accreditation.\nThe Commission is currently investigating the reason the accreditation devices, Bimodal Voter Accreditation System (BVAS), have worked perfectly in some Polling Units, but not in others.\nWith this extension of time and the recommencement of accreditation where the BVAS consistently malfunctions, the Commission assures that no voter will be disenfranchised."
  },
  {
    "headline": "BREAKING: INEC Extends Voting by One Hour",
    "summarized_story": "Voting continues SundayDavid-Chyddy Eleke in AwkaThe Independent National Electoral Commission (INEC) has extended voting in the Anambra governorship election.\nThe INEC Resident Electoral Commissioner (REC) in Anambra State, Dr Nkwachukwu Orji, announced the extension of voting by one hour, from the previous 2:30pm to 3:30pm.\nHe also added that voting will continue on Sunday, insisting that an hourly briefing of the media will help to update all as the election progresses.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Anambra Votes Amid Fear, Tension; Soludo, Ozigbo, Uba are Frontrunners",
    "summarized_story": "For most of yesterday, tension remained very high, with streets deserted, but the police and other security agencies have assured Anambra State voters of maximum security and want them to come out without fear.\nThough, there is no written agreement on the rotation of governorship in Anambra State on Senatorial basis, this has in many previous elections determined the emergence of a governor.\nIn the Southern zone, Uba is also very popular, but will be splitting his votes in the zone with Soludo and Ozigbo.\nThough, there is no written agreement on the rotation of governorship in Anambra State on Senatorial basis, this has in many previous elections determined the emergence of a governor.\nIn the Southern zone, Uba is also very popular, but will be splitting his votes in the zone with Soludo and Ozigbo."
  },
  {
    "headline": "Osinbajo: I’m Not Owner of Collapsed Ikoyi Building’s Land",
    "summarized_story": "Reports surfaced online linking the Vice-President to the collapsed building’s land, and there were also claims that the said land was sold to Osinbajo by Chief Michael Ade-Ojo, Founder of Elizade Motors.\nOsinbajo debunked the reports, and said further that he never intervened with the regulatory authorities in Lagos State to unseal the Ikoyi property at any point.\nThe Vice President said he had briefed his lawyers to sue the online medium that linked him to the said property.\n“Also, the attention of the Vice President has been drawn to an obviously sponsored falsehood regarding the recently collapsed building.\n“He has, indeed, never acted to influence any other regulatory action on the collapsed building, or any other building for that matter, in Lagos State."
  },
  {
    "headline": "LIVEBLOG: Anambra Governorship Election Update",
    "summarized_story": "You may also like"
  },
  {
    "headline": "LIVEBLOG: Anambra Governorship Election Update",
    "summarized_story": "You may also like"
  },
  {
    "headline": "BREAKING: Fire Guts Kubwa Village Market Abuja, Many Feared Dead",
    "summarized_story": "The popular Kubwa Village Market in the Bwari Area Council, Abuja, is currently on fire, leading to the death of an unspecified number of persons.\nThe incident comes a few days after a 21-storey building collapsed on Gerrard Road, in the Ikoyi area of Lagos State.\nSaharaReporters had earlier published on Thursday that the figure of victims confirmed dead at the site of the crumbled building had risen to 36.\nThe 21-floor building that collapsed was one of 360 degrees towers in the highbrow Lagos area.\nEmergency workers have evacuated nine persons alive from the debris of the building while about 39 persons have been confirmed dead."
  },
  {
    "headline": "BREAKING: Fire Guts Kubwa Village Market Abuja, Many Feared Dead",
    "summarized_story": "The popular Kubwa Village Market in the Bwari Area Council, Abuja, is currently on fire, leading to the death of an unspecified number of persons.\nThe incident comes a few days after a 21-storey building collapsed on Gerrard Road, in the Ikoyi area of Lagos State.\nSaharaReporters had earlier published on Thursday that the figure of victims confirmed dead at the site of the crumbled building had risen to 36.\nThe 21-floor building that collapsed was one of 360 degrees towers in the highbrow Lagos area.\nEmergency workers have evacuated nine persons alive from the debris of the building while about 39 persons have been confirmed dead."
  },
  {
    "headline": "#AnambraDecides: Election suspended in Ihiala LGA as hoodlums attack INEC officials",
    "summarized_story": "The Independent National Electoral Commission (INEC) has suspended the governorship election in Ihiala LGA of Anambra state.\nAdvertisementThe election was suspended following the outbreak of violence in various polling units in the LGA.\nINEC officials reported being attacked by hoodlums in different communities across the LGA.\nSome INEC officials also told TheCable that residents in the area disrupted the election in some polling units because of the late arrival of voting materials.\nThey said we were supposed to travel together with other INEC officials."
  },
  {
    "headline": "#AnambraDecides: Election suspended in Ihiala LGA as hoodlums attack INEC officials",
    "summarized_story": "The Independent National Electoral Commission (INEC) has suspended the governorship election in Ihiala LGA of Anambra state.\nAdvertisementThe election was suspended following the outbreak of violence in various polling units in the LGA.\nINEC officials reported being attacked by hoodlums in different communities across the LGA.\nSome INEC officials also told TheCable that residents in the area disrupted the election in some polling units because of the late arrival of voting materials.\nThey said we were supposed to travel together with other INEC officials."
  },
  {
    "headline": "'I lost two children' -- victims of Abuja market fire recount ordeal",
    "summarized_story": "Obinna Fidelis, a resident of the federal capital territory (FCT), says he lost two daughters to the fire incident that occurred at the Kubwa market.\nAdvertisementThere was a fire at the market on Friday night when a tank used to store kerosene exploded.\n“My wife sells foodstuffs around here and she is presently hospitalised at the National Hospital, Abuja, with serious burns.\n“There are assigned gas depots across the FCT and the government is still making more efforts to give us more gas plants.\nNatural disasters can occur anywhere but gas depots, most times, are kept away from humans."
  },
  {
    "headline": "'I lost two children' -- victims of Abuja market fire recount ordeal",
    "summarized_story": "Obinna Fidelis, a resident of the federal capital territory (FCT), says he lost two daughters to the fire incident that occurred at the Kubwa market.\nAdvertisementThere was a fire at the market on Friday night when a tank used to store kerosene exploded.\n“My wife sells foodstuffs around here and she is presently hospitalised at the National Hospital, Abuja, with serious burns.\n“There are assigned gas depots across the FCT and the government is still making more efforts to give us more gas plants.\nNatural disasters can occur anywhere but gas depots, most times, are kept away from humans."
  },
  {
    "headline": "Building collapse: 49 persons reported missing, death toll now 42, says Sanwo-Olu",
    "summarized_story": "The death toll from the collapse of a 21-storey building in the Ikoyi area of Lagos state has increased to 42.\nAdvertisementBabajide Sanwo-Olu, governor of Lagos, disclosed this on Saturday when he visited the site of the collapsed building in the company of Abdullahi Sule, Nasarawa governor, and Bola Tinubu, a chieftain of the All Progressives Congress (APC).\nOn Friday, the Lagos state government told family members of victims of the building collapse to visit the Infectious Disease Hospital (IDH) at Yaba, to identify their relatives.\nThere is still no official figure of how many people were in the building when the structure caved in on Monday.\nHe added that 49 persons said to be at the building before the collapse have been declared missing by their relatives."
  },
  {
    "headline": "MTN Group to sell $245m-worth shares of Nigerian subsidiary",
    "summarized_story": "South Africa-based MTN Group has announced plans to sell 575 million shares of its most profitable subsidiary MTN Nigeria, which went public in Lagos in 2019.\nThe offer is expected to close in December 2021.”The transaction will see MTN Group rake in proceeds of about ₦101 billion ($245 million), based on MTN Nigeria’s (MTNN) current share price of ₦175.60.\nA Bit of HistoryThe planned sell-off is part of a broader intention, announced by MTN Group earlier, to sell down 14% of its current shareholding in the Nigerian unit.\nLast year, the Johannesburg-based group was unable to repatriate its $280 million dividend from its Nigerian subsidiary due to the challenges of securing foreign currency, amid the country’s forex liquidity crisis.\nDespite the domestic challenges, MTN Nigeria has shown resilience."
  },
  {
    "headline": "A surge in African fintech's intra-continental expansion to target SMEs",
    "summarized_story": "This article was contributed to TechCabal by Conrad Onyango/birdSupport for small businesses keen to trade across the continent’s single market is being eyed as a potentially lucrative market by more and more African fintech startups.\nSurge in intra-continental expansionIn the last month alone, a number of startups have either raised growth funds, acquired another player present in regional markets within the same vertical, or tapped top talent in the telecoms industry.\nTheir intention appears to be the targeting of small industries and traders seeking cross-border opportunities in new African markets.\nThe program comes barely a month after Tala raised 145 million dollars in equity, hinting that part of the growth funds would go toward supporting its geographical expansion.\nUntil recently, a lack of local knowledge and access to trade and market information has been linked to low trade volumes and value."
  },
  {
    "headline": "African founders lead Payhippo’s $3m seed investment",
    "summarized_story": "There’s a new exciting trend in the African tech ecosystem: African founders backing fellow founders especially in pre-seed and seed funding, which is an indication that the African tech ecosystem is maturing.\nCapital is a lifeline of businessThere are over 40 million small and medium businesses (SMEs) in Nigeria.\nBut only a few of these businesses have access to capital, mostly due to heavy collateral requirements and long time of loan processing.\nFounded by Zach Bijesse, CEO, Chioma Okotcha, COO, and Uche Nnadi, CTO, Payhippo provides small businesses with short-term working capital with average loan amounts of $1300.\n“Access to credit is a critical necessity for small businesses to manage their daily challenges."
  },
  {
    "headline": "Chipper Cash valued at $2 billion after investment from world’s most valuable crypto exchange",
    "summarized_story": "The investment was led by FTX, the most valuable crypto derivatives exchange company owned by the youngest billionaire in the world, Sam Bankman-Fried.\nWith a valuation of over $2 billion, Chipper Cash has now attained a unicorn status.\nChipper Cash is FTX’s first investment in Africa.\nChipper Cash boasts of having over 4 million users across the world.\nAs a result of this partnership, FTX will increase its footprint in Africa and Chipper Cash will be integrated into the FTX product so that African users can fund their crypto wallet through Chipper Cash."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "NFTs and music, Egypt’s money rain, Payhippo’s $3m seed, and Opibus’s $7.5m funding",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:Music and blockchainFunding rounds in EgyptPayhippo’s $3m seedOpibus’s $7.5m fundingNFTs and musicThe NFT market keeps growing.\nSource: SuppliedNigerian fintech startup, Payhippo, has closed a $3 million seed funding round.\nThe company produces heavy-duty electric vehicles (EVs) such as buses and trucks by converting petrol and diesel-based vehicles into electric, reducing cost and, in a way recycling older vehicles.\nOpibus has been manufacturing EVs since 2017, intending to make electric vehicles affordable in Africa.\nHowever, we still have the likes of Jet Motor Company that announced a $9 million funding in 2020, Siltech, and Ampersand playing in the space."
  },
  {
    "headline": "Blockchain meets music: How music label owner promotes artistes and sells their music as NFTs",
    "summarized_story": "But music NFTs are gaining some wind too.\nThe song was minted on Rocki, an NFT music platform on Binance Smart Chain (BSC).\nNFTs are transforming the music businessHector believes NFTs are going to be a big part of the music business in a few years.\nWhy buy music NFTs?\nHe’s currently creating a crypto token and, at the same time, building a blockchain metaverse where crypto and NFTs reign supreme."
  },
  {
    "headline": "MallforAfrica shuts down, Affiong Williams’ ReelFruit, Chipper Cash’s extension round, Violence against journalists",
    "summarized_story": "For Affiong Williams, Founder and CEO of agritech startup, ReelFruit, starting a fruit processing business in Nigeria with no template to draw from was a bold move.\nThe extension round was led by crypto exchange platform, FTX with SVB Capital, Deciens Capital, Ribbit Capital, Bezos Expeditions, One Way Ventures, and Tribe Capital participating.\nCurrently serving seven African countries, Chipper Cash was founded in 2018 by Sam Serunjogi and Maijid Moujaled to facilitate cross border payment in Africa.\nThis is where Chipper Cash has found a sweet spot.\nSerunjogi reveals that Chipper Cash offers remittances at “considerably cheaper” prices than other competitors."
  },
  {
    "headline": "Anambra guber: Impressive turnout of voters in Awka, Njikoka, Idemili LGAs",
    "summarized_story": "The Saturday governorship election in Anambra started generally peacefully with impressive turnout of voters in most of areas in Awka South, Njikoka and Idemili North Local Government Areas.\nTurnout was impressive in the polling units in Nibo in Awka South, Enugwukwu and Abagana in Njikoka as well as Ogidi in Idmili North Local Government Areas.\nVoting commenced in Umuaka Town Hall Ward 001 and Ward 005 both in Nibo about 9a.m as voters were being accredited with the card reader working effectively.\nObi Ilochi, who voted at Ogidi Town Hall Ward 005, said he was happy that government was able to provide conducive environment for people to participate in the election.\nIt would be recalled that Police had said that it made water-tight security arrangements across the state for the poll."
  },
  {
    "headline": "MTN, Airtel mobile money licences to benefit 40m unbanked Nigerians",
    "summarized_story": "The Central Bank of Nigeria (CBN) on Thursday issued MTN Nigeria and Airtel Africa Approval-in-Principle (AIP) for payment service bank (PSB) licence.\nThe East African country is one of the world’s leaders in mobile money services.\nThe success story of mobile money in deepening financial inclusion is also evident in countries like Ghana, Ethiopia and others.\nBefore now, only banks and licensed financial institutions were allowed to provide financial services (bank-led financial inclusion model).\nFinancial inclusion means that people have access to basic financial services like a savings account, credit and insurance."
  },
  {
    "headline": "A tale of two biggest building collapses in Lagos",
    "summarized_story": "In 2008, a 22-storey building came down in rubbles in Lagos State, but no life was lost, no injury or damage to surrounding buildings was recorded.\nThat was the Bank of Industry (BoI) building constructed in 1972 and brought down through controlled demolition.\nEvidence from the Lagos State government shows that the developer of the building located at 20 Gerard Road, Ikoyi, flouted building permits.\nConsequently, the building collapsed on its weight with rumbles and very thick dust that, for more than 10 minutes, covered the surrounding.\nApproved initially for a 15-storey building, the Fourscore Homes structure was designed as a luxury apartment to be known as 360 Degrees Towers."
  },
  {
    "headline": "Anambra election: CDD commends security agencies for professional conduct – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – Centre for Democracy and Development (CDD) has commended security agencies for the high level of professionalism they have so far shown in the Anambra governorship election.\nDr Saeed Husaini, Director, Research, CDD, at a news conference on the Centre’s election analysis on Saturday in Abuja urged them to sustain the humane approach to election security through the voting, collation, and announcement of results.\nHusaini observed that although there were pockets of reports indicating the absence or low presence of security officials, there had been no widespread reports of misconduct by security officials deployed for the elections.\nHe said that CDD noted that this was a noteworthy development considering that the expectation of intimidation and abuse from state security officials was a source of heightened concern ahead of the elections.\n“In spite of the heavy deployment of state security agents, observers have noted a surprisingly scanty presence of security personnel in numerous reports from across the state."
  },
  {
    "headline": "Stakeholders laud INEC for extenting voting in Anambra guber poll – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAwka – Stakeholders have lauded the Independent National Electoral Commission (INEC) for extending voting in Anambra governorship poll from Saturday to Sunday.\nThe News Agency of Nigeria (NAN) reports that INEC had announced extension of voting in some locations due to the malfunctioning of the Bimodal Verification Accreditation machine.\nMr C-Don Adinuba, the state’s Commissioner for Information and Enlightenment said that a few voters in polling units in Okija community in Ihiala were able to vote on Saturday.\n“You know that I am from Ihiala, election did not holding in many areas because the INEC officials were unable to distribute the materials.\n“It was only in Okija that a few polling units had their voting,” he said."
  },
  {
    "headline": "Anambra Election: Soludo finally cast his vote after waiting for over 5hours – Nigerian Observer",
    "summarized_story": "Anambra Election: Soludo finally cast his vote after waiting for over 5hoursShare FacebookTwitterStumbleuponLinkedInPinterestAguata (Anambra) Nov.6, 3021 (NAN) The All Progressives Grand Alliance (APGA) candidate in the governorship election in Anambra state, Prof. Chukwuma Soludo has cast his vote after waiting for more than five hours.\nAt about 2.p.m, only 18 persons of over 700 voters had been accredited and were able to vote.\nA new BVAS was brought to the polling unit at 4.05 p.m, which was when proper accreditation and voting started.\nAfter voting, Soludo commended the Independent National Electoral Commission (INEC) for making efforts to ensure a peaceful and smooth electoral process.\n“That is to show you that APGA is Anambra and Anambra is APGA."
  },
  {
    "headline": "2 abducted Edo pupils released after payment of N6m ransom – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAuchi – The two abducted pupils of Glory Land Group of Schools in Igarra, Akoko-Edo Local Government Area (LGA) of Edo have been released following the payment of N6 million ransom.\nPolice Police Relations Officer SP Bello Kontongs, while confirming the release to NAN, said he has yet to get information on how they were released.\nIt would be recalled that the pupils were kidnapped on Tuesday by gunmen at about 5:35 pm on the Igarra-Auchi Road, near Ikpeshi, Akoko Edo LGA.\nThe vehicle, in which the siblings were travelling with some other pupils, was intercepted at gun point and the abductors dragged them from vehicle into the bush.\nThe PPRO had on Tuesday confirmed the abduction and said police operatives, soldiers and vigilantes were already combing the bush in an effort to rescue the abducted kids, unhurt."
  },
  {
    "headline": "#AnambraDecides2021: Results from Local Government Areas (LIVE UPDATES)",
    "summarized_story": "The election results have been announced at the various polling units across the Anambra State.\nThe election process moves to the next level, the various local government area collation centres.\nPREMIUM TIMES’ reporters are on the ground to update you with the votes scored in the local government areas in Anambra State by each of the governorship candidates."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Tony Elumelu Foundation to Announce Beneficiaries of 2021 Entrepreneurship Programme on November 12",
    "summarized_story": "The Tony Elumelu Foundation (TEF), the leading philanthropy empowering young African entrepreneurs, says it will announce the beneficiaries of the 2021 TEF Entrepreneurship Programme at the official Selection Announcement event holding in Lagos, and streaming live online, on November 12, 2021.\nThe ground-breaking hybrid event will unveil 4,800 African entrepreneurs chosen from all 54 African countries who will be joining the 2021 cohort of the Foundation’s annual programme.\nEvery year on January 1st, the Tony Elumelu Foundation opens its application portal to African entrepreneurs with businesses of less than five years.\nThe platform’s unique training curriculum covered insightful topics such as Starting Your Business, Business Management & Fundamentals, Leadership & Business Growth, Marketing Strategy, Product Design, and Selecting & Building a Team, amongst others.\nWe are very excited to be unveiling the 2021 cohort of the Tony Elumelu Entrepreneurship programme."
  },
  {
    "headline": "PwC Africa Energy examines continent’s place in global race to net zero by 2050",
    "summarized_story": "This review outlines a double challenge for Africa of energy transition as well as addressing energy poverty, in line with Sustainable Development Goals.\nRenewable energy snapshotAfrica’s renewable energy sector in contrast shows an uptake in generation, capacity, and forecasts.\nThe global energy transition is, however, putting this crucial income source for the continent at risk.\nEmployment levels in the energy sector will depend greatly on the way the energy transition takes place.\nThe global energy transition must prioritise the planet and all nations rather than identifying winners and losers."
  },
  {
    "headline": "NCC to auction 5G Spectrum 13th December, sets conditions",
    "summarized_story": "The Nigerian Communications Commission (NCC) has said all is set for the official auctioning of the 3.5 Gigahertz (3.5 GHz) spectrum for the deployment of Fifth Generation (5G) technology in Nigeria on December 13, 2021.\nAccording to the statement, the Information Memorandum (IM) recently presented to the Commission at a stakeholder engagement forum provides information, conditions, obligations, financial implication, timelines and other necessary details on the planned 3.5Ghz spectrum auction.\n‘‘The IM also explains the rollout obligations of the would-be eventual winners of the spectrum licence auction, whose reserved price has been pegged at $197.4 million (N75 billion),” the statement said.\nOn his part, he Executive Vice Chairman of NCC, Prof. Umar Garba Danbatta, listed the various steps diligently taken by the Commission that culminated in present status of the 5G deployment plan.\nHe also highlighted the potential benefits from investment in 5G deployment to potential operators and investors in the country."
  },
  {
    "headline": "#AnambraDecides: INEC extends closing of polls to 4pm",
    "summarized_story": "According to Orji, the Commission has extended the period for opening and closing the Poll from 8.30 a.m. to 4.00 p.m.\nINEC ad-hoc staff had arrived several polling units late due to logistics issues.\nHe added that some of the trained ad-hoc staff backed out at the last moment, and the Commission was doing its best to solve the challenges.\n“Bimodal Voter Accreditation System (BVAS), have worked perfectly in some Polling Units, but not in others.\nMr Orji said with the extension of closing time and the recommencement of accreditation where the BVAS consistently malfunctions, no voter will be disenfranchised."
  },
  {
    "headline": "Death Toll In Lagos Building Collapse Rises To 42 As Tinubu, Gov Sule visit Site",
    "summarized_story": "The death toll in the collapsed 21-storey building on Gerrard Road, Ikoyi, Lagos, has risen to 42 as rescue operations at the ill-fated building entered the sixth day on Saturday.\nThe governor went back to the site Saturday in company of the national leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, and Nasarawa State governor, Engr.\nHe said: “There are additional six people that we’ve also been able to identify and who were on site when the building collapsed.\nWe have a total of 42 bodies that have been recovered.”Among the latest survivors are a 38-year-old woman, Glory Samsom.\nAs of the time of filing this report search and rescue operations continued at the site while the heap of debris has been reduced."
  },
  {
    "headline": "Death Toll In Lagos Building Collapse Rises To 42 As Tinubu, Gov Sule visit Site",
    "summarized_story": "The death toll in the collapsed 21-storey building on Gerrard Road, Ikoyi, Lagos, has risen to 42 as rescue operations at the ill-fated building entered the sixth day on Saturday.\nThe governor went back to the site Saturday in company of the national leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, and Nasarawa State governor, Engr.\nHe said: “There are additional six people that we’ve also been able to identify and who were on site when the building collapsed.\nWe have a total of 42 bodies that have been recovered.”Among the latest survivors are a 38-year-old woman, Glory Samsom.\nAs of the time of filing this report search and rescue operations continued at the site while the heap of debris has been reduced."
  },
  {
    "headline": "Buhari Expresses Grief Over Sierra Leone Oil Tanker Deaths",
    "summarized_story": "President Muhammadu Buhari has said the sympathies of the entire nation are with the government and people of Sierra Leone, following the fuel tanker explosion in Freetown, the country’s capital in which at least 99 people were killed and more than 100 injured.\nThe tragic incident happened late on Friday when a fuel tanker exploded following a collision, and many people rushed to the scene to siphon off petrol.\nPresident Buhari in a statement by his media aide, Garba Shehu, said he was anguished by the unfortunate loss of lives and injury to so many.\nHe offered condolences on behalf of the government and people of Nigeria to the bereaved families, the government and people of Sierra Leone and wished the injured an early recovery."
  },
  {
    "headline": "Buhari Expresses Grief Over Sierra Leone Oil Tanker Deaths",
    "summarized_story": "President Muhammadu Buhari has said the sympathies of the entire nation are with the government and people of Sierra Leone, following the fuel tanker explosion in Freetown, the country’s capital in which at least 99 people were killed and more than 100 injured.\nThe tragic incident happened late on Friday when a fuel tanker exploded following a collision, and many people rushed to the scene to siphon off petrol.\nPresident Buhari in a statement by his media aide, Garba Shehu, said he was anguished by the unfortunate loss of lives and injury to so many.\nHe offered condolences on behalf of the government and people of Nigeria to the bereaved families, the government and people of Sierra Leone and wished the injured an early recovery."
  },
  {
    "headline": "Yahaya, Goje Feud Deepens As Ex-Gov’s Daughter Resigns As Commissioner",
    "summarized_story": "Dr. Hussaina Goje, daughter of Senator Danjuma Goje has resigned her appointment as the Commissioner of Environment and Forest Resources in Gombe State.\nThe resignation was not unconnected to the feud between the state governor, Muhammed Inuwa Yahaya and his estranged political god-father, Senator Goje, who currently represents Gombe Central in the Senate.\nGoje’s daughter in a statement dated Saturday, November 6, said her resignation was based on personal reasons even as she thanked the governor for giving her the opportunity to serve Gombe State.\n“I also wish to inform that my resignation was made based on personal reasons.\nWith this, I wish to show my appreciation for the opportunity given to me by his Excellency the Executive Governor to serve as a member of his Executive Council in this administration.”"
  },
  {
    "headline": "Anambra Decides: Streets, banks, markets deserted as voters elect new governor",
    "summarized_story": "Fear stricken residents of Anambra State locked themselves up at home for much of yesterday as the clock ticked toward the 8am take-off of the governorship election in the state today.\nThe situation left the streets deserted,the markets empty and the banks shut.\nSome residents said they found the large presence of security personnel and deployment of arms and ammunition in the state ahead of the election intimidating.\nAdinuba said;”you know the governor declared a two day work free day in the State which are Thursday and Friday.\n“If you say they are relocating, what State in Nigeria is safer than Anambra State?"
  },
  {
    "headline": "Anambra Decides: Streets, banks, markets deserted as voters elect new governor",
    "summarized_story": "Fear stricken residents of Anambra State locked themselves up at home for much of yesterday as the clock ticked toward the 8am take-off of the governorship election in the state today.\nThe situation left the streets deserted,the markets empty and the banks shut.\nSome residents said they found the large presence of security personnel and deployment of arms and ammunition in the state ahead of the election intimidating.\nAdinuba said;”you know the governor declared a two day work free day in the State which are Thursday and Friday.\n“If you say they are relocating, what State in Nigeria is safer than Anambra State?"
  },
  {
    "headline": "Anambra Decides: Machine malfunctions in Anambra East",
    "summarized_story": "As of 10:44 am, only seven persons were accredited in Polling Unit 001, Ugundiuka 1, Otuocha 1 in Anambra East Local Government Area (LGA).\nThere are 782 registered voters in the unit.\nOfficials said the newly-introduced Bi-modal Voter Accreditation System (BIVAS) malfunctioned.\nVoters are still waiting to be accredited.\nAlso in Unit 014, Ward 1, Onitsha North, voters said they had been queuing since 8.45 am."
  },
  {
    "headline": "Anambra Decides: Machine malfunctions in Anambra East",
    "summarized_story": "As of 10:44 am, only seven persons were accredited in Polling Unit 001, Ugundiuka 1, Otuocha 1 in Anambra East Local Government Area (LGA).\nThere are 782 registered voters in the unit.\nOfficials said the newly-introduced Bi-modal Voter Accreditation System (BIVAS) malfunctioned.\nVoters are still waiting to be accredited.\nAlso in Unit 014, Ward 1, Onitsha North, voters said they had been queuing since 8.45 am."
  },
  {
    "headline": "#AnambraDecides: Soludo extends lead as more results trickle in",
    "summarized_story": "In Eziama Central School III polling unit, APGA won with 20votes, PDP, 13 votes, YPP, 5votes while APC had no vote.\nIn Oyi LG, Nteje Ward 3, Polling Unit 002, APGA won with 36 votes, PDP next with 15 votes, YPP, 14 votes and APC, 7 votes.\nSee Results belowNnewi South LGAmichi 1 wardEbenator Okpala Hall II UnitAPC-7APGA-9PDP-13YPP-47EZIAMA CENTRAL SCHOOL IAPC-2APGA-24PDP-10YPP-8EZIAMA CENTRAL SCHOOL IIIAPC-0APGA-20PDP-13YPP-5COMM.\nCENTRAL SCHOOL IIIAPC-0APGA-16PDP-29YPP-9EZIAMA CENTRAL SCHOOL IVAPC-0APGA-20PDP-11YPP-6AMICHI III WardAFUBE HALL 2 UnitAPC-14APGA-12PDP-8YPP-4AFUBE HALL IAPC-5APGA-13PDP-13YPP-5ISEKENDIDA HALL IIIAPC-5APGA-25PDP-14YPP-36ISEKENDIDA HALL IIAPC-1APGA-5PDP-8YPP-10AMICHI CENTRAL SCHOOL IIAPC-2APGA-21PDP-7YPP-7Ebenator WardEBENATOR CENTRAL SCHOOL IVAPC-5APGA-9PDP-7YPP-5Nnewi North LGNNEWI-ICHI I WARDAKWU UMUOGBO HALL UNITAPC-4APGA-36PDP-13YPP-46AKABO OBIOFIA HALLAPC-4APGA-16PDP-5YPP-42EZELICHI HALL IIAPC-12APGA-23PDP-27YPP-50OBIOFIA COMM.\nSCHOOL IIAPC-16APGA-15PDP-6YPP-43OKPUNO HEALTH CENTREAPC-0APGA-0PDP-1YPP-0Onitsha South LGBRIDGE HEAD I WARDOPEN SPACE IN FRONT OF PLOT 1/22 END OF IDEMILI STRAPC-5APGA-2PDP-1YPP-0IDEMILI JUNCTIONAPC-24APGA-46PDP-27YPP-0FEGGE PAY OFFICE IVAPC-0APGA-17PDP-3YPP-3Oyi LGNteje Ward 3, Polling Unit 002APGA – 36YPP -14PDP -15APC -7Nteje Ward 3, Polling Unit 003APGA – 51YPP – 13PDP – 10APC – 20Awka South LGWARD: NISE II, Polling Unit 001APGA – 40PDP – 19YPP – 3APC – 1WARD: NISE II, Polling Unit 002APGA – 49PDP – 29YPP – 1APC – 5WARD: NISE II, Polling Unit 007APGA – 68PDP – 16YPP – 6APC – 12WARD: NISE II, Polling Unit 008APGA – 68PDP – 13YPP – 4APC – 3WARD: NISE II, Polling Unit 009APGA – 59PDP – 13YPP – 28APC – 9"
  },
  {
    "headline": "Police: How we rescued UNIABUJA Profs, others from Shenegwu Forest",
    "summarized_story": "The Federal Capital Territory, FCT, Police Command has revealed that the two Professors and four other persons kidnapped from University of Abuja Staff Quarters on Tuesday were kept at Shenegwu Forest in the Gwagwalada area of Abuja, the hideout of their abductors.\nThe Police had early Friday morning announced the rescue of the six kidnapped persons, including two Professors without revealing additional information of how and where they were rescued and if ransom was paid to set them free.\nShe also announced that eight members of the notorious gang who carried out the abduction were arrested during the operation.\n“The criminal elements on sighting the security team engaged them in a fierce gun duel.\n“However, the superior firepower of the security operatives led to the arrest of eight members of the notorious gang while some other members of the gang fled into the forest and nearby communities.”"
  },
  {
    "headline": "BREAKING: Tinubu Visits Site Of Building Collapse In Ikoyi",
    "summarized_story": "A chieftain of the All Progressives Congress, Asiwaju Bola Tinubu, on Saturday, visited the site where a building collapsed in the Ikoyi area of Lagos State.\nTinubu, a former governor of Lagos State, was accompanied by the current Governor, Babajide Sanwo-Olu and his Nasarawa State counterpart, Abdullahi Sule.\nThe PUNCH reported that the building collapsed on Monday with many artisans and others trapped in the rubble.\nThis is as families have submitted 32 names of those believed to still be trapped in the rubble.\nMeanwhile, the Lagos State Government has said families of the victims can now go to the Infectious Disease Hospital, Yaba to identify the corpses recovered from the rubble."
  },
  {
    "headline": "Anambra Election: All Live Results From Polling Units.",
    "summarized_story": "In Anambra State’s ongoing governorship election, results are already coming in from Polling Units.\nIn virtually all Polling Units, INEC personnel have completed the voting process, and ballot counting has begun in front of the voters.\nAccording to NEWS DIRECT, the governorship election in Anambra State was hotly contested between Andy Uba of the All Progressives Congress, APC, Prof. Charles Soludo of the All Progressives Grand Alliance, APGA, and Valentine Ozigbo of the Peoples Democratic Party, PDP.\nWhile elections have been concluded in some Polling Units, many others started very late with INEC announcing the extension of voting till Sunday.\nHere are some of the results from Polling Units:Adegbefomimi ward 2 Enugu Ukwu Njidoka LGAAPGA 82 votesAPC 12 votesPDP 26 votesOBOSI WARD IDEMILI NORTHAPC 8APGA 16PDP 15OBOSI IIAPC 4APGA 16PDP 15OPEN SPACE AT AMA EJIOFOR SQUARE, IREAPGA 0PDP 1YPP OAPC OOPEN SPACE AT OGBE COLLEGE IREAPGA 0APC 0PDP 0YPP 0URUOWULU CENTRAL SCHOOLAPGA 0APC 0PDP 0IDEMILI SOUTH LGA – POLLING UNIT RESULTSALOR WARD 1NKWO IDE PUBLIC SQUARE IIAPC- 20APGA- 20PDP- 6NKWO IDE PUBLIC SQUARE IIIAPC- 12APGA-17PDP- 6NKWO IDE PUBLIC SQUARE IVAPC- 13APGA- 6PDP- 3NKWO IDE PUBLIC SQUARE VAPC- 8APGA- 5PDP- 5ALOR WARD IIUMUOSHI PRY SCH IVAPC- 5APGA- 11PDP- 9UMUOSHI PRY SCH IAPC- 7APGA- 16PDP- 11UMUOSHI PRY SCH IIAPC- 8APGA- 14PDP- 13UMUOSHI PRY SCH IIIAPC- 12APGA- 13PDP- 13UNITED PRY SCH IIIAPC- 18APGA- 16PDP- 4EBENESI OKUBUNOYE HALLAPC- NILLAPGA- 1PDP- 4UNITED PRY SCH IIAPC- 4APGA- 11PDP- 4UNITED PRY SCH IAPC- 4APGA- 13PDP- 3NNOKWA WARDIDEMILI SQUARE IIAPC- 5APGA- 4PDP- 42IDEMILI SQUARE IIIAPC- 4APGA- 2PDP- 15DISPENSARY NNOKWA IIAPC- 4APGA- 16PDP- 49UBILI HALL IVAPC- 9APGA- 11PDP- 34UBILI HALL IIIAPC- 5APGA- 2PDP- 9UBILI HALL IAPC- 5APGA- 2PDP- 9NNOBI WARD IIUMUIKECHEM SQUAREAPC- 10APGA-24PDP-13NNOBI WARD IIIEZIEHULU HALLAPC- 9APGA- 18PDP- 16UMUDIOKPALA UMUHAI HALLAPC- 3APGA- 3PDP- 2"
  },
  {
    "headline": "Ikoyi Building Collapse: Video Shows Trapped Workers, Reveals Contractor’s Name",
    "summarized_story": "The contractor’s name was discovered in footage of the Ikoyi building collapse seen by DAILY POST on Saturday.\nFour people are seen trapped and dead in the video.\nAs responders and citizens work together to remove rubbles, the recorder proceeds to another location where two people were stuck.\nEach unit was priced between $1.2 million and $5 million and sold for 65 percent of its asking price.\nOsibona and state officials are accused of conspiring to increase the number of floors from 21 to 15."
  },
  {
    "headline": "Ikoyi Collapsed Building: VP Yemi Osinbajo To Sue Bloggers, Journalists, Social Media Users",
    "summarized_story": "Vice President, Yemi Osinbajo has commenced moves to sue media houses, publishers, journalists, bloggers, social media users, WhatsApp groups and others linking him to the Ikoyi building collapse.\nIn a statement on Saturday, a lawyer, Ebun-Olu Adegboruwa announced that the VP instructed him to issue a public notice on the matter.\nThe Senior Advocate of Nigeria (SAN) said publications which mentioned Osinbajo as the owner of the structure were sponsored by “faceless individuals and entities”.\nFor the records, our Client is not involved in, associated or connected with the ownership or development of the collapsed building, in any manner whatsoever.\n“We therefore implore you not to yield your noble platforms for the dissemination of any libelous publication of and concerning our Client, henceforth.”"
  },
  {
    "headline": "Breaking: In Gombe, ex-governor’s daughter quits Yahaya’s cabinet",
    "summarized_story": "Gombe state Commissioner for Environment and Forest Resources Dr Husaina Danjuma Goje on Saturday resigned her appointment.\nDr Husaina is a daughter to Senator Muhammad Danjuma Goje, a former Gombe state governor.\nRecall that the relationship between her father and Governor Muhammadu Yahaya turned sour especially with Friday’s happening.\nThe former commissioner stated this in a press statement signed and made available to Blueprint in Gombe on Saturday, saying that her resignation was hinged on personal decision.\n“I also wish to inform you that my resignation was made based on my personal reasons, with this I wish to show my appreciation and the opportunity given to me by his excellency the executive governor to serve as a member of his executive council in this administration.”"
  },
  {
    "headline": "Breaking: Man dies as telecom mast collapses in Kogi community (VIDEO)",
    "summarized_story": "An unidentified man has died after a telecomm mast on Saturday afternoon collapsed in Ihima community of Okehi local government area of Kogi state.\nBlueprint gathered that the collapsed mast belongs to the Nigerian Telecommunications Limited (Nitel)At the time of filling this story, it is unconfirmed if the affected family will be pressing any charges against the telecom company whose mast fell or the agency responsible for the proper installation of masts and signage poles.\nAuthorities are yet to confirm the latest incident.\nDetails loading…"
  },
  {
    "headline": "Breaking: Scores dead as fresh explosion erupts",
    "summarized_story": "At least 99 people have died after a massive explosion when a fuel tanker collided with a lorry in Sierra Leone’s capital, Freetown.\nFuel spilled before igniting and the resulting inferno engulfed bystanders and vehicles at a busy junction.\nFootage broadcast by local media outlets showed badly charred bodies in the streets surrounding the tanker.\nBrima Bureh Sesay, the head of Sierra Leone’s National Disaster Management Agency, said there were many “burnt corpses”.\n“It’s a terrible, terrible accident,” he told local media in a video shared from the scene."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Amotekun: Arrest, parade of Northerners dangerous to Nigeria’s unity –Group -NigPilot",
    "summarized_story": "A socio-political group, the Northern Conscience for 2023, NCfor2023, has described the arrest and parade of some youths believed to have been Northerners by the South West Security Network code-named Amotekun , as dangerous for the unity of Nigeria.\nThe security outfit had arrested 18 youths accused of hiding under bags of beans in a trailer, who were all paraded yesterday.\n“It is even more disturbing when one considers that he claims to be a Senior Advocate of Nigeria (SAN) who should have sound knowledge of the law and the constitution; and the fact that Ametokun is not recognized by the Constitution as a law enforcement agency with powers to parade suspects,” he added.\nThe group’s leader, who maintained that the North remains committed to the unity of Nigeria and the invisibility of the country, warned of grave consequences if the region retaliates the treatment meted it in recent times, by other parts of the country.\nThe country cannot afford to endure the carnage and lawlessness spreading within its borders like wildfire,” Gololo further cautioned."
  },
  {
    "headline": "Impeachment saga: Civil society condemns attack on Gov Lalong -NigPilot",
    "summarized_story": "*Preaches peace to embattled SpeakerThe coalition of Civil Society for Good Governance, CCSGG, has condemned in strong terms tirades and attacks against the Plateau State governor, Barrister Simon Bako Lalong by the impeached Speaker of the State House of Assembly, Rt.\n“Gentlemen of the press, we are aware that Plateau State House of Assembly was the first out of 36 States of the Federation to enjoy legislative and judicial autonomy, even when Hon.\n“The lawmakers decided to impeach their leader based on reasons best known to them and elected Hon.\nYakubu Sanda as new Speaker, which we consider as democracy in action, hence, peace should be allowed to reign at all cost,” the convener stressed.\nIt, however, commended Governor Lalong for his maturity and leadership that has ensured peace and tranquility as well as socio-economic and infrastructural development of the state, while calling on the citizens, particularly the youths not to allow themselves to be used."
  },
  {
    "headline": "East-West Road has gulped N359bn- Akpabio -NigPilot",
    "summarized_story": "Minister of Niger Delta Affairs, Sen. Godswill Akpabio has disclosed that over N359billion has so far been expended on the 657km dual carriage East-West Road stretching from Calabar in Cross River State, to Effurun in Delta State since it was initiated in 2006.\nAkpabio said bearing in mind the objectives of President Muhammadu Buhari on the completion of ongoing projects, the Niger Delta Ministry was considering raising funds from other sources to ensure the completion of section I-IV of the road before the end 2023.\nThe minister made this statement during the Ministry’s 2021 Budget Performance Review and 2022 Proposed Budget Consideration to the House of Representative Committee on Niger Delta Affairs on Tuesday in Abuja.\nSpeaking earlier, during the budget presentation the Chairman House of Representative Committee on Ministry of Niger Delta Affairs Hon.\nEssien Ekpeyong, assured that the Legislature is committed to the security of lives and investment in the Niger Delta region and for economic and social activities to strive."
  },
  {
    "headline": "I don’t need god-father to be APC national Chairman – Moniedafe",
    "summarized_story": "One of the prominent contenders for the national chairmanship position of the ruling All Progressives Congress, APC, Chief Sunny Sylvester Moniedafe, on Monday canvassed for the abolition of the concept of godfatherism in Nigerian politics saying it can not last any longer.\nHe said, “This thing is all about I need god-father, and this is what I want us to completely forget about.\nSunny Moniedafe, who threw his hat into the ring for the party’s national chairmanship office in March, 2021 belonged to the ACN bloc and was the Abuja chairman of the party.\nHe was Secretary of ACN in the FCT before the formation of the mega APC.\nHowever, unlike some of the aspirants in the APC national chairmanship race who are publicly backed by one or more prominent figures in the party, Mr Moniedafe at the moment has only his campaign promises."
  },
  {
    "headline": "‘Resistance, Disruptions, Device Malfunctions’: INEC Gives Update On Anambra Election",
    "summarized_story": "The Independent National Electoral Commissioner (INEC) on Saturday said there had been resistance and disruptions to the election process in Anambra state.\nThe commission also admitted that some of its accreditation devices had malfunctioned while it had been unable to make necessary deployment to certain areas.\nThe Resident Electoral Commissioner in the state, Nkwachukwu Orji, made the disclosures in a press briefing in Awka, the state capital.\n“Where elections held, collation of results will proceed, and the applicable EC40G instrument will be used in line with the provision of the electoral law.\n“If there are areas where there is a determination that the collation of results cannot take place at the RA collation centres, collation will now take place at the LGA collation centres.”"
  },
  {
    "headline": "Anambra Election: Soludo Finally Votes After Waiting For Over Five Hours",
    "summarized_story": "Candidate of All Progressives Grand Alliance (APGA) in the 2021 Anambra governorship election, Charles Soludo, has finally cast his ballot after a delay that lasted more than five hours.\nSoludo, who voted at polling unit 002, Isuofia ward, had earlier complained about the slow accreditation process.\nThe slow process was attributed to the Bimodal Verification Device, which failed to work despite being replaced with additional support.\nREAD ALSO: INEC Extends Voting TimeThe device is used to accredit voters to enable them cast their ballot.\nDespite his complaints, Soludo had called for his supporters to exercise patience, describing himself as a “process person”."
  },
  {
    "headline": "Anambra Election: APC’s Andy Uba Wins Polling Unit",
    "summarized_story": "The candidate of the All Progressives Congress (APC), Andy Uba, has won his polling unit in the ongoing Anambra governorship election.\nINEC officials, who announced the results on Saturday, said Uba had 80 votes in Ward 16, Polling Unit 17 in Uga, Aguata Local Government Area.\nBefore now, INEC had extended the voting time for the election to 4:00 pm on Saturday following challenges with the accreditation of voters.\n“The extension of time arose out of several field reports that voters have had problems with accreditation,” INEC said.\n“The Commission is currently investigating the reason the accreditation devices, Bimodal Voter Accreditation System (BVAS), have worked perfectly in some Polling Units, but not in others.”"
  },
  {
    "headline": "PHOTOS: Security Operatives Patrol Streets During Anambra Election",
    "summarized_story": "The 2021 Anambra governorship election commenced on Saturday as security operatives patrolled various parts of the state to enforce order.\nOfficials of the police, Nigerian Army and Nigeria Security and Civil Defence Corps (NSCDC) participated in the security exercise.\nNo case of violence had yet been reported as of the time of filing this report.\nSee photos below:"
  },
  {
    "headline": "INEC Officials error Leads To Cancelation of Votes in Awka Ward 7 -",
    "summarized_story": "An error by the Presiding officer at polling unit 008 Awka Ward 7, Umuokpu Awka, Awka South Local Government Area has led to the cancelation of all votes cast.\nTrouble started when INEC supervisor in charge of the Area Collation Centre arrived the polling unit and discovered that the BVAS recorded 0 voter accreditation while several people had voted.\nShe told ABS News off record because she was not permitted to talk to the press that upon investigation she discovered that the Presiding officer made an error with the BVAS system which made it not to document people who have voted.\nShe said consequently this will lead to the cancelation of votes as number of votes cast must tally with the number of accredited voters recorded by the BVAS.\nShe said she has approved that voting continues till one hour after scheduled time as the only option was to restart accreditation and voting afreshABS was however faced with hostilities from voters when they attempted speaking to them to find out their opinion about happened"
  },
  {
    "headline": "APGA Candidate, Soludo, yet to vote as BVAS malfunctions",
    "summarized_story": "The candidate of the All Progressives Grand Alliance Professor Charles Soludo is yet to vote because of the malfunctioning BVAS technology in Ofeiyi polling Unit 002, Isuofia, Aguata local government area of Anambra state.\nThe governorship candidate described his inability to vote as the failure of technology deployed by INEC to accredit registered voters, he also complained about shortfall in man power at various polling units across the state.\nHe said in many polling units just one presiding officer is assigned to attend to about 800 to 1000 registered voters, coupled with the inconsistency of the BVAS technology.\nProfessor Charles Soludo called on the electoral commission to immediately rectify the faults in the device that has become a critical element in the country’s electoral process."
  },
  {
    "headline": "Vice President, Osinbajo, demands retraction of publication by Sahara Reporters -",
    "summarized_story": "He added that failure to do so will lead to the commencement of legal proceedings against Sahara Reporters with punitive and substantial damages to be sought before the Court.\nHis representative led by Femi Atoyebi a Senior Advocate of Nigeria also asked that aside the retraction which must come within 48 hours that he should also tender an apology in two national dailiesThe legal representative of Vice President, Yemi Osinbajo, have written the publisher of Sahara Reporters, Omoyele Sowore, to demand the retraction of the publication linking him to the collapsed Ikoyi Building owned by Femi Osibona.\nRecent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided.\nArchives Archives Select Month November 2021 (99) October 2021 (496) September 2021 (546) August 2021 (544) July 2021 (519) June 2021 (603) May 2021 (614) April 2021 (693) March 2021 (769) February 2021 (685) January 2021 (770) December 2020 (677) November 2020 (609) October 2020 (507) September 2020 (780) August 2020 (768) July 2020 (735) June 2020 (682) May 2020 (532) April 2020 (530) March 2020 (456) February 2020 (486) January 2020 (656) December 2019 (705) November 2019 (650) October 2019 (607) September 2019 (574) August 2019 (631) July 2019 (719) June 2019 (747) May 2019 (908) April 2019 (620) March 2019 (516) February 2019 (528) January 2019 (561) December 2018 (492) November 2018 (583) October 2018 (616) September 2018 (568) August 2018 (585) July 2018 (500) June 2018 (437) May 2018 (408) April 2018 (430) March 2018 (510) February 2018 (547) January 2018 (550) December 2017 (291) November 2017 (498) October 2017 (715) September 2017 (675) August 2017 (689) July 2017 (671) June 2017 (679) May 2017 (987) April 2017 (1042) March 2017 (1141) February 2017 (676) January 2017 (612) December 2016 (596) November 2016 (571) October 2016 (639) September 2016 (162) March 2016 (39) May 2015 (1)Categories Categories Select Category #AnambraVotes (15) #Ekiti2018 (25) #EkitiVotes (14) #LagosBuildingCollapse (2) #LiberiaRunOff (6) #OsunDebate (5) #OsunVotes (29) America (554) Asia (279) Athletics (113) Basketball (44) Boxing (69) Breaking News (118) Business News (5,410) Central Africa (85) East Africa (179) Election 2019 (26) Entertainment News (703) Europe (405) Events (16) Fashion (5) fashion & style (15) Featured (533) Football (1,585) Formula 1 (19) Golf (15) Health News (2,209) inside lagos (1) International (7,186) Kogi Election (10) labour lens (5) Lassa Fever & Coronavirus (18) Latest News (25,803) Africa (363) West Africa (184) Livestream (3) Metro (25) Middle East (174) Movies (31) Music (74) Nigeria News (21,451) Nollywood (34) Non classifié(e) (1) North Africa (175) Politics News (5,646) #EdoDecides (22) #LagosCouncilElections (4) #NigeriaVotes (240) #OndoDecides (100) Bayelsa Election (7) nnamdi kalu (9) Presidential Election (45) Science & Technology (8) Shows (2) Southern Africa (173) Sports News (3,415) Table Tennis (20) Tech (22) Tennis (111) the platform (1) Top Stories (38) U-Report (5) Uncategorized (286) VIDEO (1,201) Business Nigeria (3) Business Week (2) Community Forum (11) Crime Watch (102) Fireworks (13) Green Angle (4) Journalists Hangout (106) News at 10 PM (23) Special Reports (112) Sports Debate (32) Sports Desk (3) Standpoint (1) The Big Issue (4) The Sunday Interview (108) This Morning (85) TVC Breakfast (831) TVC Investigates (6) Wildlife (5) World News (2,041)"
  },
  {
    "headline": "Kwara Doctors call off Industrial Action",
    "summarized_story": "The kwara state government striking medical doctors have suspected their industrial action effective 6pm this Saturday.\nThe doctors commence the 7-day warning strike on Monday due to poor condition of service and remuneration.\nDr Agboola said the doctors decided to suspend the strike due to the favorable disposition of the state government to negatiate with them.\nHe also acknowledged the suffering that patients went through due to the warning strike.\nHe denied that they were intimited to suspend the strike."
  },
  {
    "headline": "Boeing Directors Agree to $237.5m Settlement Over 737 MAX Safety Oversight",
    "summarized_story": "Boeing Co (BA.N) current and former company directors have reached a $237.5 million proposed settlement with shareholders to settle a lawsuit over the board’s safety oversight of the 737 MAX aircraft, documents released on Friday show.\nFollowing two fatal 737 MAX crashes in the space of five months in 2018-19 that killed 346 people, Boeing’s best selling plane was grounded for 20 months and returned to service after the company made significant software and training improvements.\nThe settlement would also require Boeing to provide annual public reports on safety related enhancements implemented by the planemaker since the MAX air disasters.\nBoeing agreed to a deferred prosecution agreement with the U.S. Department of Justice in January including $2.5 billion in fines and compensation stemming from the 737 MAX crashes.\nBoeing confirmed the settlement and said “Boeing has taken significant actions to reinforce and strengthen our commitment to aviation safety” since the crashes."
  },
  {
    "headline": "New York County Prosecutor Casts Doubt on Sex Offense Charge Against Cuomo",
    "summarized_story": "A New York county prosecutor on Friday asked a judge to delay for two months the arraignment of former New York Governor Andrew Cuomo on a misdemeanor sex offense charge, saying a local sheriff may have botched the case by rushing to file the complaint.\nAlbany County Sheriff Craig Apple filed a “forcible touching” charge against Cuomo last month based on one woman’s accusation that Cuomo groped her under her blouse at the Executive Mansion in the New York state capital of Albany.\nSoares said in his letter that his office had been investigating Cuomo for months when the sheriff surprised him with a criminal filing.\n“There was sworn testimony included, and we followed the policies and protocols set to interview victims of sex crimes,” Apple said.\nIf convicted on the misdemeanor charge, he would face a possible sentence of up to a year in jail."
  },
  {
    "headline": "Fuel Tanker Blast in Freetown Kills at Least 91, Says Morgue",
    "summarized_story": "Ninety-one people were killed in the capital of Sierra Leone on Friday when a fuel tanker exploded following a collision, the central morgue and local authorities said.\nThe government has not yet confirmed the death toll, but the manager of the central state morgue in Freetown said it had received 91 bodies following the explosion.\nVictims included people who had flocked to collect fuel leaking from the ruptured vehicle, Yvonne Aki-Sawyerr, mayor of the port city, said in a post on Facebook.\n“We’ve got so many casualties, burnt corpses,” said Brima Bureh Sesay, head of the National Disaster Management Agency, in a video from the scene shared online.\n“It’s a terrible, terrible accident.”Images shared widely online showed several badly burned victims lying on the streets as fire blazed through shops and houses nearby."
  },
  {
    "headline": "Nigeria VP Osinbajo Denies Owning Collapsed Ikoyi Building’s Land",
    "summarized_story": "Nigeria Vice President Yemi Osinbajo has denied any link with the 21-storey building that collapsed in Ikoyi, Lagos on Monday, saying he has no interest whatsoever in the said property.\nReports surfaced online linking the Vice-President to the collapsed building’s land, and there were also claims that the said land was sold to Osinbajo by Chief Michael Ade-Ojo, Founder of Elizade Motors.\nThe Vice President said he had briefed his lawyers to sue the online medium that linked him to the said property.\n“Also, the attention of the Vice President has been drawn to an obviously sponsored falsehood regarding the recently collapsed building.\n“He has, indeed, never acted to influence any other regulatory action on the collapsed building, or any other building for that matter, in Lagos State."
  },
  {
    "headline": "Nigeria: Soludo, Uba, Ozigbo are Frontrunners as Anambra Votes Amid Fear, Tension",
    "summarized_story": "Amid fear and tension, caused by an endless bloodbath, which hindered campaigns of the political parties, the people of Anambra State will on Saturday vote to elect a new governor.\nFor most of yesterday, tension remained very high, with streets deserted, but the police and other security agencies have assured Anambra State voters of maximum security and want them to come out without fear.\nThough, there is no written agreement on the rotation of governorship in Anambra State on Senatorial basis, this has in many previous elections determined the emergence of a governor.\nIn the Southern zone, Uba is also very popular, but will be splitting his votes in the zone with Soludo and Ozigbo.\nHe and his party also have high popularity in the Central zone, just as it is expected that his largest number of votes will come from the Northern zone."
  }
]