[
  {
    "headline": "Why Nigeria needs to achieve herd immunity through COVID-19 vaccination –NPHCDA",
    "summarized_story": "Yusuff MoshoodThe Director of Disease Control and Immunisation at the National Primary Health Care Development Agency, Dr. Bassey Bassey Okposen, says the country needs to achieve herd immunity to protect the citizens against new variants of COVID-19.\nOkposen, a public health physician and an immunisation expert said if the nation achieved herd immunity through immunisation, Nigerians will be better protected against future variants.\nHe said, “We need as a nation to achieve herd immunity.\n“Once we achieve herd immunity as a nation, whatever strain of the virus that comes would be easier to deal with.\nOnce you give 100 children measles vaccine, 85 per cent of them develop 100 per cent immunity at first administration."
  },
  {
    "headline": "One in 20 people in UK have COVID-19 –Official data",
    "summarized_story": "More than one in 20 people in Britain had COVID-19 in the last week of 2021, the highest infection rate recorded during the pandemic, official data showed on Wednesday.\n“#COVID19 infection rates continued to increase across all age groups in England in the week ending 31 December 2021, with the highest rates still seen in school-age children and young adults,” the ONS said.\nIn Scotland, Wales and Northern Ireland, where devolved governments have reimposed some restrictions in recent weeks, rates were slightly lower at between one in 20 and one in 25 people.\nAsymptomatic people in England who test positive will no longer require a confirmatory PCR test from January 11, the UK Health Security Agency said.\n“What is beyond doubt is that it is already having a considerable impact,” she said of surging infections, noting the number of people in Scottish hospitals had risen 80 percent in the most recent week."
  },
  {
    "headline": "One in 20 people in UK have COVID-19 –Official data",
    "summarized_story": "More than one in 20 people in Britain had COVID-19 in the last week of 2021, the highest infection rate recorded during the pandemic, official data showed on Wednesday.\n“#COVID19 infection rates continued to increase across all age groups in England in the week ending 31 December 2021, with the highest rates still seen in school-age children and young adults,” the ONS said.\nIn Scotland, Wales and Northern Ireland, where devolved governments have reimposed some restrictions in recent weeks, rates were slightly lower at between one in 20 and one in 25 people.\nAsymptomatic people in England who test positive will no longer require a confirmatory PCR test from January 11, the UK Health Security Agency said.\n“What is beyond doubt is that it is already having a considerable impact,” she said of surging infections, noting the number of people in Scottish hospitals had risen 80 percent in the most recent week."
  },
  {
    "headline": "Pre-departure COVID-19 test for travellers entering UK to be scrapped",
    "summarized_story": "Amarachi OkehFully vaccinated persons would no longer need to take the pre-departure COVID-19 test before entering England, the UK government has announced.\nThis will take effect from Friday at 4 am, the UK government said.\nIn addition, those who are fully vaccinated do not need to self-isolate while waiting for results upon arrival in England.\nAccording to the report by BBC, the Prime Minister, Boris Johnson said the pre-departure test “discourages many from travelling for fear of being trapped overseas and incurring significant extra expense”.\nThe UK government has also said that it will ease COVID-19 testing rules for people without symptoms, who will no longer need to confirm a positive lateral flow test with a PCR."
  },
  {
    "headline": "Transport Amazons call for Nigerian Female President",
    "summarized_story": "She asserted that Nigeria wouldn’t attain the transformational changes desired by patriots until a female president emerges.\nMMS Hall of Fame Induction 2021-2“The truth is that women can’t be in the homes or the other room and expect to become president.\n“It is Kingsley’s dream and I am sure I am right, to have a female President.\n“I’m looking forward to the day Nigeria will have a female president.\nIf we create an enabling environment for a Nigerian female president, we would be amazed at the wonders God will do with them.”“Women are being celebrated today because they are achievers and we expect that this celebration will spur them to do better."
  },
  {
    "headline": "Transport Amazons call for Nigerian Female President",
    "summarized_story": "She asserted that Nigeria wouldn’t attain the transformational changes desired by patriots until a female president emerges.\nMMS Hall of Fame Induction 2021-2“The truth is that women can’t be in the homes or the other room and expect to become president.\n“It is Kingsley’s dream and I am sure I am right, to have a female President.\n“I’m looking forward to the day Nigeria will have a female president.\nIf we create an enabling environment for a Nigerian female president, we would be amazed at the wonders God will do with them.”“Women are being celebrated today because they are achievers and we expect that this celebration will spur them to do better."
  },
  {
    "headline": "The Rave On Fire",
    "summarized_story": "The singer and songwriter, who has a song for every feeling from love, breakup, happiness to travel, says the song ‘Peru’ basically recounts his journey and holiday fun in San Francisco.\nYou are headlining your first concert ever in Lagos “The Fire Concert” How does that make you feel?\nMy debut was simply an introduction to my sound so I decided to make the next one a bit more personal and introspective.\nI had just landed in San Francisco to pay a courtesy visit to my empire team in the studio.\nI’m big on mutual respect and organic energy when it comes to collaborations, so I waited patiently till it came."
  },
  {
    "headline": "The Rave On Fire",
    "summarized_story": "The singer and songwriter, who has a song for every feeling from love, breakup, happiness to travel, says the song ‘Peru’ basically recounts his journey and holiday fun in San Francisco.\nYou are headlining your first concert ever in Lagos “The Fire Concert” How does that make you feel?\nMy debut was simply an introduction to my sound so I decided to make the next one a bit more personal and introspective.\nI had just landed in San Francisco to pay a courtesy visit to my empire team in the studio.\nI’m big on mutual respect and organic energy when it comes to collaborations, so I waited patiently till it came."
  },
  {
    "headline": "Abba Kabir Dankaura Weds Hadiza Bashir Jamoh",
    "summarized_story": "By Emeka AnaetoThe Director-General of the Nigerian Maritime Administration and Safety Agency (NIMASA) Dr. Bashir Jamoh, gave out his daughter, Hadiza, in marriage to Abba Kabir Dankaura at a wedding Fatiha which took place in Kaduna on Friday, December 24, 2021.\nThe serene city of Kaduna played host to dignitaries across the country with Katsina State Governor, Aminu Masari and his Borno counterpart, Prof. Babagana Zulum, playing leading role at the Fatiha which took place at the Sultan Bello Mosque.\nThe reception took place at the Yar’Ádua Center, Murtala Square, Kaduna.\nHere are some of the pictures highlighting the event."
  },
  {
    "headline": "Why I’m not happy with state of electricity in Nigeria – Buhari",
    "summarized_story": "President Muhammadu Buhari has said that he is not happy with the state of electricity in Nigeria because he identified that no country could develop without infrastructure means; road, rail and power.\nAsked if he is happy with the country’s capacity of electricity production, Buhari said, “I am not because I identify that no country can develop without infrastructure and infrastructure means road, rail and power.\nTry to imagine what was happening between Lagos to Ibadan six months ago and what it is now.\n“We are doing from Lagos to Kano by rail, road from here to Kaduna to Kano.\nBuhari had in May 2018 queried the spending of $16bn on power projects during the administration of former President Olusegun Obasanjo."
  },
  {
    "headline": "Adetoun Adeniran, ex-Lagos APC women leader is dead",
    "summarized_story": "The first female Deputy Speaker of the Lagos State House of Assembly, Adetoun Adediran, is dead.\nShe held many political offices, including Women Leader of the All Progressives Congress (APC) in Lagos.\nIn a statement by his spokesman Eromosele Ebhomele, Lagos Speaker, Mudashiru Obasa described her demise as shocking.\n“It was this same passion for service that got her the position of Women Leader of the APC in Lagos.\nShe also later became the Chairman of the Lagos State Building and Investment Company."
  },
  {
    "headline": "Again, Kwara Assembly reprimands lone PDP member for contempt",
    "summarized_story": "Jimoh Raheem Agboola, the Peoples Democratic Party, PDP, lone member in the Kwara State House of Assembly, has again been reprimanded by the House for alleged contempt and breach of privileges.\nDAILY POST reports that he is to abstain from the service of the House for 14 days in line with Order 10, Rule 16, Sub-sections 4 and 11 of the House rules.\nThe embattled lawmaker from Ilorin South constituency, is also to apologize to the House without which the order abstaining him will not be waived.\nThe order was handed down on Wednesday, in a resolution contained in the report laid by the Chairman, Committee on Ethics, Privileges and Judiciary, Ganiyu Folabi Salahu, (Omupo), before the House.\nThe report was thereafter considered at the committee of the whole House."
  },
  {
    "headline": "Sylvester Oromoni: Mother of late Dowen College student reacts as Lagos govt clears students, staff",
    "summarized_story": "The DPP also cleared the students of belonging to unlawful society due to insufficient facts to establish the offence.\nReacting, the deceased’s mother in a viral video broke down in tears and asked God to avenge the death of her son.\nFor this the whole world will know that there is God that fights for the oppressed.\n“Dear lord, let your wrath fall on all of them.\nThe whole world, Nigeria, let them know that you love me, let them know that you are the one fighting my battle."
  },
  {
    "headline": "Buhari gives condition to sign Electoral Bill",
    "summarized_story": "President Muhammadu Buhari, on Wednesday, stated that he is ready to sign the Electoral Act Amendment Bill if the National Assembly makes the necessary adjustments.\nBuhari disclosed this during an interview with Channels Television’s Maupe Ogun and Seun Okinbaloye, which aired today.\n“All I said (is that) there should be options,” Buhari said.\nHis decision to withhold his assent followed the inclusion of direct primary elections in the bill.\nAccording to a letter the President sent to the Senate President, Ahmed Lawan, he cited insecurity and the high cost of conducting the direct primary as his reasons for rejecting the bill."
  },
  {
    "headline": "I must consult widely on 2023, says Abe",
    "summarized_story": "By Mike Odiegwu and Rosemary Nwisi, Port HarcourtSen. Magnus Abe said yesterday that he had not indicated any intention to contest the 2023 governorship election in Rivers State.\nAbe, who represented Rivers Southeast Senatorial District, said he must consult widely and review the political process before taking a decision on the coming election.\n- Advertisement -He said the governor’s position was in tandem with the feelings and statements of some Ogoni leaders, including the late activist, Ken Saro-Wiwa, who condemned the prevalence of pull-him-down syndrome.\n“His presence at the Ogoni Day event and his evident commitment to building unity among the Ogoni are commendable.\nWe have long history of standing by one another, Ogoni Day is always a great opportunity to celebrate our unity and strength."
  },
  {
    "headline": "Anyim to host Southeast leaders in Enugu",
    "summarized_story": "Ex-Senate president and presidential aspirant for 2023 general election Anyim Pius Anyim will host Southeast leaders and stakeholders of the Peoples Democratic Party (PDP) in Enugu today.\nThis is part of his efforts to secure his party’s nod to fly the PDP flag in the presidential election.\nAnyim declared his intention to vie for the party’s ticket at its national convention in Abuja on October 30 last year.\nHe is expected to meet Southeast PDP leaders in Enugu today to brief them on his aspiration.\nAccording to a letter of invitation issued to the PDP zonal leaders, Anyim said the meeting was scheduled to hold at Best Western Hotel, Independence Layout, Enugu."
  },
  {
    "headline": "BREAKING: Veteran Nollywood actress Iyabo Oko dies",
    "summarized_story": "Veteran actress, Sidikat Odukanwi, popularly known as Iyabo Oko is dead.\nActress Foluke Daramola-Salako confirmed her death.\nShe wrote on her Instagram page: “and finally we lost her.. rip Iyabo Oko, we did our best but God knows best”Also Sidikat’s daughter Bisi Aisha, a female soldier, confirmed her death.\nSidikat had stage names such as “Iyabo Oko” “Apoti Aje” Sisi Mama”.\nYoruba Nollywood stars including Foluke Daramola, Iyabo Ojo, Bolaji Amusan, Mercy Aigbe and Biodun Okeowo, others assisted financially in the past."
  },
  {
    "headline": "‘Insecurity will not distort Katsina education’",
    "summarized_story": "Katsina State Government has assured its citizens that the education sector will not be distorted by insecurity and other attendant calamities, including diseases and other social challenges.\nCommissioner for Education, Prof. Badamasi Lawal Charanchi gave the assurance while receiving a combined team of delegates from the Federal Ministry of Education and National UNICEF officers from Abuja who were on an inspection visit to the state.\nHe said the visit came at the right time with opportunities that will address the state’s educational challenges.\n- Advertisement -The Nigeria UNICEF National Office representative, who is also a monitoring and evaluation specialist, Baba Yahaya Aminu, informed the gathering that E-Learning, apart from educating the populace, also provides vocational training and vocational skills for the society for meaningful development.\nThe visiting team was also received by the Permanent Secretary Ministry of Education Alhaji Musa Abdu Dankama, SUBEB Chairman Alhaji Buhari Lawal, as well as all directors of the ministry and those of SUBEB."
  },
  {
    "headline": "‘We need Oro governor in 2023’",
    "summarized_story": "Youths from Akwa Ibom State have cried out that an Oro person is yet to govern the state since its creation in 1987.\nThe stakeholders, under the auspices of the Oro Youths Movement (OYM), urged other ethnic nationalities to help Oro people produce the next governor in 2023.\nIn a communiqué after its Annual General Assembly at Oron, OYM said: “We call on well-meaning people of Akwa Ibom State and other Nigerians to support the sincere and patriotic agitation of Oro people to govern the state in 2023, having not produced a governor since the creation of the state in 1987.\n“We are making this demand based on the principles of tripod, equity, justice and in the interest of democracy that Oro ethnic nationality, being an integral part of Akwa Ibom State, be given a chance to govern the state, as was done to our brothers- Ibibio and Annang.”The communiqué was signed by the Chairman, Central Planning Committee, Philip Nkanginue; National Secretary, Sunday Offiong; National President, Edet Eyo and Director, Media and Publicity, Roselyn Ntekim.\n- Advertisement -The group urged Governor Udom Emmanuel, political leaders, traditional rulers and other stakeholders to convene a summit to discuss issues surrounding the 2023 governorship election."
  },
  {
    "headline": "IPOB: No political solution for Kanu – Buhari",
    "summarized_story": "Kanu is facing charges bordering on treasonable felony instituted against him in response to years of the campaign for the Republic of Biafra through IPOB.\nIn November 2021, south-east traditional and religious leaders had asked the president to grant amnesty to Kanu to deescalate tension in the zone.\nThe President said he wants Kanu to answer for his actions, even though he does not rule out the possibility of a political solution.\nCommenting on the trial of the IPOB leader during the interview, the president said: “I wouldn’t dare interfere with the judiciary.\nWe cannot rule out possibility of political solution, but if he will behave himself all well and good."
  },
  {
    "headline": "Breaking: FG declares bandits as terrorists, issues gazette",
    "summarized_story": "From Godwin Tsa, AbujaThe Federal Government on Wednesday released an official gazette declaring bandits groups in the country as terrorists.\nThe development was sequel to a ruling of the Abuja division of the Federal High Court which declared proscribed bandit groups as terrorists.\nSpecifically, Justice Taiwo Taiwo in his ruling held that activities of Yan Bindiga and Yan Ta’adda bandit groups, constitute acts of terrorism.\nThe ruling declaring bandits terrorists followed an ex parte motion the Federal Government filed through the Federal Ministry of Justice.\nThe motion was moved by the Director of Public Prosecution, DPP, Mohammed Abubakar."
  },
  {
    "headline": "N10% tax: Soft drink to cost more in 2022, says Finance Minister",
    "summarized_story": "Recall that in 2017, the Federal Executive Council (FEC) approved the revised National Tax Policy to increase Value Added Tax (VAT) on luxury items, like champagne, luxury cars, and other luxury goods.\n“What the committee has shown is that we should look at actually increasing VAT on some luxury items.\n“So, they have made recommendations that we should pull out some luxury items and increase VAT on those items immediately.\nI believe it is only fair that when you consume luxury goods, you should pay a little bit more.\nIt had estimated to generate about N480 billion from taxes on luxury items in the 2015 fiscal period"
  },
  {
    "headline": "Gunmen resume hostilities in Niger, abduct 2 Chinese nationals, kill 2 security guards",
    "summarized_story": "From John Adams, MinnaArmed Bandits resumed their attacks in Niger state after the Christmas and new year breaks as they launched offensive on foreign Nationals working at the Zungeru hydro electricity dam, abducting two Chinese Nationals.\nThe heavily armed bandits killed two security guards attacked to the project site and injured one before abducting the foreign Nationals.\nIt was gathered that the workers were working on the connection of high tension extension from Zungeru Dam to Gusase community in Shiroro local area when the gunmen struck.\nHe pointed out that one of the Chinese workers was shot at a close range while two internal security guard were killed.\n“They however went away with two other Chinese workers”, adding that he can’t say more than that for now because many people ran into the bush and can not ascertain their destination at this moment."
  },
  {
    "headline": "Lagos clears 5 Dowen College students, staff of Sylvester Oromoni’s death",
    "summarized_story": "By Gabriel DikeThe Lagos State Government has cleared five students and five employees of Dowen College accused of complicity in the death of 12-year-old Sylvester Oromoni.\nThe state cleared the students, staff as well as the school based on the legal advice of the Director of Public Prosecution, DPP, Ms. Adetutu Oshinusi.\nThe DPP report also cleared the five students of belonging to unlawful society due to insufficient facts to establish the offence.\nC17, Vol.3, Laws of Lagos State 2015.\nHis death generated ripples prompting the Lagos State Police Command to arrest five students and five staff of the college."
  },
  {
    "headline": "Dementia-ravaged Buhari Couldn’t Remember Names Of Governors Who Visited Him On Farmers-herders’ Clashes",
    "summarized_story": "President Muhammadu Buhari again fumbled for words as his dementia seemed to be worsening when he wanted to recall the names of two governors, who visited him at Aso Rock Villa in Abuja over the farmers-herders’ clashes in their states.\nWe met at least four times with the service chiefs and other law enforcement agencies – each meeting taking at least four hours.\nThe governors of ha…ha…ha…ha…Oyo State and the governor of ha…ha… this other state…in Ondo…not Ondo…one other state.\nSaharaReporters in May 2021 reported that Buhari’s worsening dementia and other undisclosed health challenges were taking a heavy toll on his ability to effectively coordinate meetings.\nTop sources in the Presidency had told SaharaReporters that Buhari was not only incoherent but spoke for only a short time."
  },
  {
    "headline": "Dementia-ravaged Buhari Couldn’t Remember Names Of Governors Who Visited Him On Farmers-herders’ Clashes",
    "summarized_story": "President Muhammadu Buhari again fumbled for words as his dementia seemed to be worsening when he wanted to recall the names of two governors, who visited him at Aso Rock Villa in Abuja over the farmers-herders’ clashes in their states.\nWe met at least four times with the service chiefs and other law enforcement agencies – each meeting taking at least four hours.\nThe governors of ha…ha…ha…ha…Oyo State and the governor of ha…ha… this other state…in Ondo…not Ondo…one other state.\nSaharaReporters in May 2021 reported that Buhari’s worsening dementia and other undisclosed health challenges were taking a heavy toll on his ability to effectively coordinate meetings.\nTop sources in the Presidency had told SaharaReporters that Buhari was not only incoherent but spoke for only a short time."
  },
  {
    "headline": "Dementia-ravaged Buhari Couldn’t Remember Names Of Governors Who Visited Him On Farmers-herders’ Clashes",
    "summarized_story": "President Muhammadu Buhari again fumbled for words as his dementia seemed to be worsening when he wanted to recall the names of two governors, who visited him at Aso Rock Villa in Abuja over the farmers-herders’ clashes in their states.\nWe met at least four times with the service chiefs and other law enforcement agencies – each meeting taking at least four hours.\nThe governors of ha…ha…ha…ha…Oyo State and the governor of ha…ha… this other state…in Ondo…not Ondo…one other state.\nSaharaReporters in May 2021 reported that Buhari’s worsening dementia and other undisclosed health challenges were taking a heavy toll on his ability to effectively coordinate meetings.\nTop sources in the Presidency had told SaharaReporters that Buhari was not only incoherent but spoke for only a short time."
  },
  {
    "headline": "BREAKING: Nnamdi Kanu Should Defend Himself In Court, I Can’t Release Him – Buhari",
    "summarized_story": "President Muhammadu Buhari has said the detained leader of the Indigenous People of Biafra, Nnamdi Kanu, should defend himself in court for peddling false information about his regime while he (Kanu) was overseas.\nBuhari stated this in an interview aired on Channels Television on Wednesday night which was monitored by SaharaReporters.\nThere have been pressures on Buhari to release Kanu including a recent visit by some Igbo elders led by Minister of Aviation in the First Republic, Chief Mbazulike Amaechi.\nNigerians know that I don’t interfere with the judiciary, let him be listened to.\nUpon his re-arrest in June 2021, Kanu was re-arraigned before Justice Binta Nyako for terrorism-related charges brought against him by the AGF office."
  },
  {
    "headline": "BREAKING: Nnamdi Kanu Should Defend Himself In Court, I Can’t Release Him – Buhari",
    "summarized_story": "President Muhammadu Buhari has said the detained leader of the Indigenous People of Biafra, Nnamdi Kanu, should defend himself in court for peddling false information about his regime while he (Kanu) was overseas.\nBuhari stated this in an interview aired on Channels Television on Wednesday night which was monitored by SaharaReporters.\nThere have been pressures on Buhari to release Kanu including a recent visit by some Igbo elders led by Minister of Aviation in the First Republic, Chief Mbazulike Amaechi.\nNigerians know that I don’t interfere with the judiciary, let him be listened to.\nUpon his re-arrest in June 2021, Kanu was re-arraigned before Justice Binta Nyako for terrorism-related charges brought against him by the AGF office."
  },
  {
    "headline": "AFCON: Squad numbers revealed as Super Eagles arrive Cameroon",
    "summarized_story": "The Super Eagles of Nigeria players have gotten their jersey numbers ahead of the forthcoming 2022 Africa Cup of Nations (AFCON) in Cameroon.\nAdvertisementIn the goalkeepers’ department, Maduka Okoye still retained his number one jersey for the 33rd AFCON which is billed to kick off on Sunday, while Daniel Akpeyi and John Noble will put on 16 and 27 respectively.\nJoe Aribo retained his number 10, while Odion Ighalo and Chidera Ejuke will wear 9 and 13 respectively.\nThe Super Eagles also arrived in Garoua, Cameroon from Abuja via a chartered flight in the early hours of Thursday.\nAdvertisementView this post on Instagram A post shared by Nigeria Super Eagles (@ng_supereagles) AdvertisementThe Nigerian national football team will open their campaign against Egypt on Sunday at the Roumde Adjia stadium, Garoua."
  },
  {
    "headline": "AFCON: Squad numbers revealed as Super Eagles arrive Cameroon",
    "summarized_story": "The Super Eagles of Nigeria players have gotten their jersey numbers ahead of the forthcoming 2022 Africa Cup of Nations (AFCON) in Cameroon.\nAdvertisementIn the goalkeepers’ department, Maduka Okoye still retained his number one jersey for the 33rd AFCON which is billed to kick off on Sunday, while Daniel Akpeyi and John Noble will put on 16 and 27 respectively.\nJoe Aribo retained his number 10, while Odion Ighalo and Chidera Ejuke will wear 9 and 13 respectively.\nThe Super Eagles also arrived in Garoua, Cameroon from Abuja via a chartered flight in the early hours of Thursday.\nAdvertisementView this post on Instagram A post shared by Nigeria Super Eagles (@ng_supereagles) AdvertisementThe Nigerian national football team will open their campaign against Egypt on Sunday at the Roumde Adjia stadium, Garoua."
  },
  {
    "headline": "Magodo dispute: Lagos to allocate lands at Shangisha to judgment creditors",
    "summarized_story": "The Lagos government says it has reached a settlement plan for Shangisha landlords, the judgement creditors who have laid claim to the land where the Magodo estate phase two is located.\nThereafter, Babajide Sanwo-Olu, Lagos governor, visited the area and promised an “amicable resolution” to the dispute.\nAdvertisement“The surveyor-general of Lagos state, permanent secretary lands bureau and Hon.\n“Upon identification of available and accessible land, the state government is to immediately allocate the land to the 549 judgment creditors.\n“In the event that there is no available and accessible land within the Shangisha village scheme to allocate to all the 549 judgment creditors, the state government, in agreement with the judgment creditors, will provide alternative plots of land."
  },
  {
    "headline": "Magodo dispute: Lagos to allocate lands at Shangisha to judgment creditors",
    "summarized_story": "The Lagos government says it has reached a settlement plan for Shangisha landlords, the judgement creditors who have laid claim to the land where the Magodo estate phase two is located.\nThereafter, Babajide Sanwo-Olu, Lagos governor, visited the area and promised an “amicable resolution” to the dispute.\nAdvertisement“The surveyor-general of Lagos state, permanent secretary lands bureau and Hon.\n“Upon identification of available and accessible land, the state government is to immediately allocate the land to the 549 judgment creditors.\n“In the event that there is no available and accessible land within the Shangisha village scheme to allocate to all the 549 judgment creditors, the state government, in agreement with the judgment creditors, will provide alternative plots of land."
  },
  {
    "headline": "Buhari: Why I'll keep name of my favourite presidential candidate secret",
    "summarized_story": "President Muhammadu Buhari says the name of the candidate who he would prefer to succeed him in 2023 will be kept secret.\nSpeaking during an interview with Channels Television aired on Wednesday, Buhari said his “favourite” for the presidency in 2023 will be “eliminated” if he mentions the person’s name.\nAdvertisementAsked what comes to his mind when he hears about the 2023 elections, Buhari said the next general election is not his problem.\nBuhari added that he is making sure that all important things carried out by his administration are on record.\nAll important things I’ll make sure that they are on record."
  },
  {
    "headline": "Here’s why startup funding in the Maghreb ecosystem is low",
    "summarized_story": "But when you break these numbers down into deals and compare them to Egypt’s over $600 million funding in 2021, the conversation on how disturbingly small the funding is comes up.\nWhat’s the problem of the Maghreb region, and how can the ecosystem rise to its full potential?\nIntra-regional conflictThe Maghreb countries don’t see eye-to-eye; they are archenemies or, as they are popularly called, “enemy brothers”.\nIn Nigeria, for instance, big conventional banks back fintech startups, and FMCGs invest in e-commerce and logistic upstarts.\nLanguage barrierThe Maghreb region speaks French and that makes it a francophone region."
  },
  {
    "headline": "TechCabal Wrapped: Here’s what you enjoyed reading from TechCabal in 2021",
    "summarized_story": "I joined TechCabal in January of this year to help drive TechCabal’s transition from a Nigerian tech publication to a pan-African tech and media publication.\nTechCabal Wrapped is our way of walking you through our most-loved and most-read articles in 2021.\n🥂 Koromone Koroye, Managing EditorHere’s what you enjoyed reading from TechCabal in 2021In 2021, TechCabal published 683 articles, 265 editions of TC Daily—including this one—and 50 editions of Next Wave.\nHow Herconomy raised a $600,000 pre-seed round in 24 hoursIn 2021, Nigerian startups raised about $1.4 billion.\nThe African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence."
  },
  {
    "headline": "21 things that happened for the first time in 2021 in the African tech scene",
    "summarized_story": "2021 has been a noteworthy year that has seen the African tech sector bounce back from the difficulties it faced in 2020.\nHere’s a list of 21 things that happened for the first time in the African tech scene this year.\nThe African startup ecosystem raised a record $4 billion+ in venture capital funding2021 year was a landmark year for the African tech ecosystem, raising over $4 billion via 754 deals in venture capital funding.\nMFS Africa acquired Baxi.\nTwitter opened its first Africa office in GhanaIn April 2021 social media giant Twitter announced Ghana as its choice for an African headquarters."
  },
  {
    "headline": "Ask an Investor: Twelve insights from Africa’s top investors",
    "summarized_story": "While most people easily associate investors with just money, Founders Factory Africa (FFA) would rather have you think of more.\nMeghan Curran, West African Director of Acumen, explained this: “In our model, nothing goes back to the investors because the investors in the first place are donors.\nBefore the boom, Sawari Ventures, which was founded over a decade ago, has been backing North African startups.\nNow I’ve seen some term sheets where the investors ask that if the founder opts to pay back the investment, the investor gets some amount of free equity in the company.\nToday, LoftyInc operates three funds that have deployed over $12 million into over 75 African startups like Flutterwave, Andela and Trella."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Twitter’s second African office? Gahez’s pre-seed funding, FedaPay secures funding",
    "summarized_story": "Share this article:Hi there,Here’s what we’re discussing today:Twitter’s second African office?\nGahez’s pre-seed fundingFedaPay secures fundingTwitter’s second African officeAfter over six months of accessing Twitter using Virtual Private Networks (VPNs), Nigerians may soon access the social media platform freely.\nAdvertisementAccording to a source quoted by The Nation, Twitter’s hesitance to open an office in Nigeria last year stemmed from it not being part of its 2021 budget.\nThe first is that going by the report, Twitter is being coerced into opening an office in Nigeria.\nGahez raises $2 million in pre-seed fundingEgyptian eCommerce startup, Gahez, has raised $2 million in pre-seed funding."
  },
  {
    "headline": "Not your typical African tech stories",
    "summarized_story": "For the third year running, people are living through different levels of lockdowns and increasing cases of COVID-19 and its variants.\nSome countries are still reconsidering lifting lockdowns, while others have experienced more than three waves of the pandemic already.\nI’m tempted to ask, “when does all this end?” So, this is another reminder for you to stay safe.\nHowever, this does not affect Blackberry devices running on Android OS.\nIt features the lives and exploits of African tech specialists across the world."
  },
  {
    "headline": "Meaningful reflection and excitement for the future",
    "summarized_story": "Unsurprisingly, the industry that stood out heads, shoulders, and knees above the pack was the fintech space.\nContext: In recent years, mobile money adoption in Ghana has been growing in leaps and bounds to rival Kenya’s success story.\nA levy on mobile money transactions would improve taxation revenues, but there’s no telling how it would impact the average mobile money user.\nWhatever the apex bank decides tomorrow could heavily affect Nigeria’s fintech space.\nAlso, in 2021, Nigerian fintech, Piggyvest, said it disbursed $587.5 million to 3.5 million customers."
  },
  {
    "headline": "DOCUMENTING EDO STATE GOVERNMENTS – Nigerian Observer",
    "summarized_story": "As a journalist, writer and social scientist I have interacted with hundreds of politicians, public office seekers, academics, civil servants, clerics, critics and scores of other individuals in Edo State.\nFollowing this development, I resolved to start documenting all Edo State Governments in power since 2007 for public consumption beginning with Comrade Adams Aliu Oshiomhole whose administration oversaw the affairs of Edo State from 2007-2016.\nMaterials used for government documentation are from on/offline sources, most especially reports carried in the state-owned Nigerian Observer published by Bendel Newspapers Company Limited with headquarters in Benin City, capital of Edo State.\nGovernor Godwin Nogheghase Obaseki assumed office as Edo State Governor on November 12, 2016.\nRather, the works were put together by a team of researchers who believe passionately in providing resources material with which Edo citizens and other interested persons can get relevant facts about Edo State Government."
  },
  {
    "headline": "With 40MW power plant operational, investors scramble for space in Benin Industrial Park – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… as Edo govt earmarks 100ha for first phase, assures incentives for investors… Ossiomo Power generation capacity now 95MWBENIN CITY – With the coming on stream of the 40MW Independent Power Plant (IPP) built by Ossiomo Power and dedicated to provide power to the Benin Industrial and Enterprise Park, investors are trooping in to harness the benefit of the 24-hour electricity and other benefits available at the mixed-purpose park.\nOssiomo Power had announced that its new 40MW plant became operational in December 29 and had already connected and powering Ologbo and Obayantor communities in Ikpoba Okha Local Government Area of the State.\nThe new plant increases the generation capacity of Ossiomo Power to 95MW, as a 55MW plant had been operational since 2020.\nManaging Director, Edo State Investment Promotion Office (ESIPO), Kelvin Uwaibi, in a chat with journalists, said the state government has earmarked 100 hectares for the first phase of the mixed-purpose Benin Industrial and Enterprise Park, which measures about 997-hectares.\nAccording to him, “We are being inundated by enquiries from investors and are ready for those who want to set up shop as quick as possible."
  },
  {
    "headline": "Obaseki advances on digital economy, to provide optic fibre connectivity across 18 LGAs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has assured residents that his government will sustain ongoing reforms and programmes aimed at achieving digital economy in the state, promising to provide fibre optic connectivity to all Edo communities to enhance access to the internet and expand the state’s digital economy.\nObaseki, who spoke to journalists in Benin City, said his administration is committed to building physical and digital infrastructure, leveraging technology to drive sustainable growth and development in the state.\nHe stated, “Our operation Light Up Edo is in full gear with the street-lighting project being rolled out in Benin City, Ekpoma and Auchi.\n“As a government, we are recommitting ourselves to deepen growth across all sectors of the state and provide more opportunities for our people to realise their full potential.\nThese we will do by leveraging the innate abilities of our people and providing them with the tools and enablement to dominate and conquer their world.”..."
  },
  {
    "headline": "Obaseki congratulates Prof. Salami on appointment as Chief Economic Adviser – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…urges alignment of monetary, fiscal policiesBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has congratulated Prof. Doyin Salami on his appointment as the Chief Economic Adviser to President Muhammadu Buhari.\nThe governor, in a statement, said: “I hope that Prof. Salami will justify the trust and confidence of Mr President and help to align the nation’s monetary and fiscal policies to enable inclusive growth in these very challenging economic times.”He added: “With this new role, I urge Prof. Salami to provide direction in influencing the fundamentals of the Nigerian economy, which will help to steer the economy back on track.\nSalami’s credentials will boost investor confidence for many who have sought a more coordinated and predictable economic environment that can spur Foreign Direct Investment (FDI) and portfolio investment into the economy.\n“As the current chairman of the Presidential Economic Advisory Council (PEAC) and member of the Monetary Policy Committee of the Central Bank of Nigeria, I expect Prof. Salami to bring his experience to bear in the new assignment and place Nigeria on the path of economic prosperity.”..."
  },
  {
    "headline": "‘Don’t think government must give you jobs’ – Buhari tells youths",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has told the country’s youths not to hope on governments jobs after graduation from schools, as according to him, the government must not give them jobs.\nBuhari who spoke in an interview with Channels TV aired on Wednesday night, said youths should not leave school thinking of government jobs.\nThe president who had in the past described Nigerian youths as lazy, prompting outrage among the youths, regretted that the colonial administration indoctrinated people to wait for government jobs after passing through school.\n“You get educated because an educated person is certainly better than uneducated one even in identifying personal problem.\nNo.”The president who also spoke on the 2023 general election, said the polls is not his problem, while noting that he would not disclose the candidate he is backing to succeed him when he leaves office in 2023."
  },
  {
    "headline": "Buhari says Nnamdi Kanu cannot be released",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari, has foreclosed the option of political solution to the case of Mazi Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), noting that the separatist group leader cannot be released.\nHowever, speaking in an interview with Channels Television aired on Wednesday, Buhari said he would not interfere with the judiciary.\nLet him come here with us and then criticise us here.\nNigerians know that I don’t interfere with the judiciary, let him be listened to.\nBut those who are saying that he should be released, no, we cannot release him.”"
  },
  {
    "headline": "Buhari govt officially proscribes bandits as terrorists",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has said bandits terrorising the North West have been declared as terrorists and they would be so treated henceforth.\nNorth West and North Central states States of Zamfara, Katsina, Sokoto, Kaduna and Niger, have been ravaged by banditry in recent years, with bandits killing thousands and kidnapping many others, including several school children for ransom.\nSpeaking further on the North West security, he said a progress has been made in the last six weeks after several meetings with service chiefs which lasted for several hours.\nThe document titled, ‘Terrorism (Prevention) Proscription Order Notice, 2021’ is contained in Volume 108 of the Federal Republic of Nigeria Official Gazette.\nIt read in part, “Notice is hereby given that by the Order of the Federal High Court Abuja, in suit No."
  },
  {
    "headline": "Voters Awareness Initiative promises to engage citizens ahead of 2023 polls",
    "summarized_story": "Advocacy group, Voters Awareness Initiative (VAI), has called on the Nigerian populace to take political participation more seriously ahead of the 2023 general election, as according to it, active participation of citizens in the electoral process is the only way to change the country for the better.\nA people or country that throws away merit and embraces mediocrity and sentiments cannot but retrogress.\nIt is only in Nigeria, that the best is rejected in the process of head-hunting for political office, in particular.\n“To change this situation, we must all put our hands on deck, join hands to partake fully in the electoral process.\nThe politicians, particularly the conventional politicians, have been organising and positioning themselves since 2020."
  },
  {
    "headline": "BREAKING: Kanu Can Be Released If He Behaves Himself – Buhari",
    "summarized_story": "President Muhammadu Buhari has hinted on a possibility of releasing the leader of the outlawed Indigenous Peoples of Biafra (IPOB), Nnamdi Kanu, from detention on the condition that the latter conduct himself well.\nBuhari disclosed this on Wednesday night during an exclusive interview with Channels Television monitored by our correspondent in Abuja.\nThe President said the ongoing trial of Kanu by a Federal High Court in Abuja was an opportunity for him to defend himself from the allegations against him, adding that he would never interfere with the operations of the Judicial arm of government.\nHe, however, added that the option of political solution to the matter was possible if Kanu behaves himself well.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "BREAKING: Federal Govt Proscribes Banditry, Releases Gazette",
    "summarized_story": "The Federal Government of Nigeria has formally proscribed banditry in Nigeria and consequently designated bandits as terrorists.\nThe development is contained in a statement sent to LEADERSHIP by the Federal Ministry of Justice on Wednesday evening.\nRecall that the Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN), disclosed that the Federal Government was planning to officially designate bandits as terrorists.\nHe said his office was in the process of gazetting a court judgement that ordered the government to declare bandits as terrorists, adding that the process would be concluded in a matter of days.\n“With that in mind, Nigeria acted, first by proscribing IPOB, taking into consideration the threats to lives and properties they have caused in the nation."
  },
  {
    "headline": "Uzodimma Cannot Stop My Presidential Quest – Okorocha",
    "summarized_story": "A former governor of Imo State, Senator Rochas Okorocha, has said that Governor Hope Uzodimma cannot stop his ambition of becoming the President of Nigeria even as he called on the Inspector General of Police to unmask those responsible for the invasion of St Peter’s Anglican Church, Nkwerre.\nHe accused Uzodimma as the culprit responsible for the gruesome murder of former presidential adviser, Ahmed Gulak, traditional rulers, and beheading of people in the state.\nOkorocha spoke on Wednesday while reacting to accusations of interference in Imo governance by Governor Uzodimma.\nADVERTISEMENTAccording to him, despite the antics of Uzodimma, the governor lacks the capacity to stop his ambition to succeed President Muhammadu Buhari.\nOn the arrest of his son-in-law, Chief Uche Nwosu, Okorocha called on the IGP not to sweep the incident under the carpet, hence he should unveil the sponsor of the arrest, saying Uzodimma has been boasting that the matter has been settled."
  },
  {
    "headline": "Uzodimma Cannot Stop My Presidential Quest – Okorocha",
    "summarized_story": "A former governor of Imo State, Senator Rochas Okorocha, has said that Governor Hope Uzodimma cannot stop his ambition of becoming the President of Nigeria even as he called on the Inspector General of Police to unmask those responsible for the invasion of St Peter’s Anglican Church, Nkwerre.\nHe accused Uzodimma as the culprit responsible for the gruesome murder of former presidential adviser, Ahmed Gulak, traditional rulers, and beheading of people in the state.\nOkorocha spoke on Wednesday while reacting to accusations of interference in Imo governance by Governor Uzodimma.\nADVERTISEMENTAccording to him, despite the antics of Uzodimma, the governor lacks the capacity to stop his ambition to succeed President Muhammadu Buhari.\nOn the arrest of his son-in-law, Chief Uche Nwosu, Okorocha called on the IGP not to sweep the incident under the carpet, hence he should unveil the sponsor of the arrest, saying Uzodimma has been boasting that the matter has been settled."
  },
  {
    "headline": "Retired Soldiers Besiege Finance Ministry, Demand Pension Arrears Payment",
    "summarized_story": "Some retired military personnel, on Wednesday, stormed the headquarters of the Federal Ministry of Finance in Abuja to demand the immediate payment of their pension arrears.\nMeanwhile, the chairman, Military Pensions Board, Commodore S.A. Lawal, has however assured pensioners that funds for payment of the 24 months minimum wage pension arrears to military pensioners was included in the Board’s year 2022 budget.\nADVERTISEMENTCommodore Lawal assured military retirees, Next of Kins (NOKs) and other well-meaning Nigerians that the Board remains resolute and will sustain the prompt payment of all entitlements due to military retirees or their NOKs.\nCome January 15 we are going to picket the ministry of finance and Defence should our entitlement be delayed further.\nHow can you make minimum wage."
  },
  {
    "headline": "Updated: Australia orders Djokovic expelled after visa cancelled",
    "summarized_story": "Australia cancelled Novak Djokovic’s visa on Thursday and told him to leave the country, thus denying him the chance to defend his Australian Open title.\nThe world number one touched down on an Emirates flight from Dubai into Melbourne shortly after 11pm Wednesday night AEST.\n“This is not a fight for the libertarian world, this is not just a fight for Novak, but a fight for the whole world!\n“In accordance with all the norms of international public law, Serbia will fight for Novak Djokovic, for justice and truth.\n“Otherwise, Novak is strong, as we all know him.”However, shortly after the president weighed in, Djokovic’s visa was cancelled."
  },
  {
    "headline": "Gunmen invade police station in Rivers, free high profile criminals",
    "summarized_story": "Okafor Ofiebor/Port HarcourtThree high-profile criminals and a rape suspect were among detained suspects set free following invasion of Okrika Police Divisional headquarters, Rivers State by yet to be identified gunmen on Tuesday.\nOur correspondent learnt that gunmen invaded the Police Station and freed all inmates at about 2am on Tuesday.\nHe said he suspected a foul play, compromise and conspiracy in the alleged invasion of police station by gunmen.\nTheophilus said he was told at the Police Station on Tuesday evening that all the inmates in the cell had escaped from custody.\n“We have reported the incident to the Police force headquarters, zonal and State commands."
  },
  {
    "headline": "We Cannot Release Nnamdi Kanu — Buhari Vows",
    "summarized_story": "President Muhammadu Buhari has sworn to never release Mazi Nnamdi Kanu, the leader of the Indigenous People of Biafra, IPOB.\nRecall that certain Igbo leaders visited with President to ask for Kanu’s unconditional release.\nBuhari responded by saying that it is a difficult decision to make, but that he will think about it.\nWhen asked if KANU would be released, Mr. President responded, “We cannot free Nnamdi Kanu.” It does not have a political solution.\nIt should be remembered that Kanu, the leader of the Indigenous People of Biafra IPOB, is facing treason accusations brought against him by the federal government."
  },
  {
    "headline": "Lagos Government To Compensate Shangisha Landlords With 549 Plots Over Dispute With Magodo Residents",
    "summarized_story": "To resolve the property issue between Shangisha landlords and the Magodo Residents Association, the Lagos State Government has pledged to provide 549 plots of land as compensation.\nAccording to the Tribune, the parties reached an accord following a meeting presided over by Lagos State Governor Babajide Sanwo-Olu on Wednesday.\n“The State Government representatives will be there, the residents’ association will be there, and the police will also be there.\nSaharaReporters had reported that the CSP, Abimbola Oyewole, on Tuesday openly defied Sanwo-Olu’s order to vacate Magodo Phase 2 Estate.\nSanwo-Olu had led members of his cabinet to visit the residents protesting the continuous presence of armed policemen in the estate."
  },
  {
    "headline": "BREAKING: Finally, FG Declares Bandits As Terrorists",
    "summarized_story": "According to NewsDirect, the Federal Government has designated bandits as terrorists.\nDetails will be provided later…"
  },
  {
    "headline": "BREAKING: Lagos Govt. Clears Dowen College Students, Staff Of Sylvester’s Death, Orders Their Release",
    "summarized_story": "The Lagos State Government has cleared five Dowen College students and five employees of any wrongdoing in the death of Sylvester Oromoni, a 12-year-old student in the state.\nFavour Benjamin, Edward Begue, Ansel Temile, Kenneth Inyang, Favour Benjamin, Edward Begue, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, Favour Benjamin, FavourThey were also exonerated by the government of belonging to any illegal society, including a secret cult, due to a lack of evidence to support the charge.\n3, Laws of Lagos State 2015.\nThe case of Oromoni junior was not murdered, nor was the student poisoned, according to the recommendation issued by Adetutu Oshinusi.\n“To hold otherwise would amount to sniffing for an offence and a speculative act which is not permitted in law."
  },
  {
    "headline": "Breaking: Another veteran Nollywood actress is dead",
    "summarized_story": "The death has been confirmed of a veteran actress, Sidikat Odukanwi, popularly known as Iyabo Oko.\nAccording to her daughter, Bisi Aisha, Iyabo Oko died Wednesday evening, aged 61.\nThe deceased had reportedly battled stroke for for sometime before her demise.\nAlready, some of her friends have started paying tribute via their social media platforms.\nDetails loading…RelatedNo tags for this post."
  },
  {
    "headline": "Breaking: Super Eagles land in Cameroon ahead AFCON 2021 tourney",
    "summarized_story": "Nigeria’s Super Eagles Wednesday night landed at Garoua, Cameroon, four days ahead of 2021 Africa Cup of Nations.\nThe biennial competition is scheduled to kickoff January 9 with the Nigerian senior national men team playing their first match on January 11.\nDetails loading…"
  },
  {
    "headline": "First Bank LIT App: Promoting customer safety, convenience",
    "summarized_story": "First Bank of Nigeria Limited recently launched LIT App to revolutionise the culture and experience of mobile banking in Nigeria.\nThe LIT App was created to revolutionise the culture and experience of mobile banking in Nigeria.\nWith the LIT app, customers are also able to log and manage their complaint(s) without having to visit the branch.\nWhy First Bank created LIT App“In keeping with the bank’s strategy of customer-led innovation; the Lit App has been created to offer customers an alternative mobile app to meet their banking needs.\nThe Lit App has been designed to have a youthful appeal while maintaining your safety and security as you Bank on the go,” it further said."
  },
  {
    "headline": "‘We Cannot Release Him,’ Buhari Says Nnamdi Kanu Should Defend Himself In Court",
    "summarized_story": "President Muhammadu Buhari has ruled out the option of pardoning the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nFor those who are saying that we should release him, no we cannot release him.\nApart from the trial of the IPOB leader, the President also spoke about a number of burning issues including security, economy, and politics, among others.\nSo, in that respect, we have done something,” President Buhari asserted.\nHe went on to defend his government’s decision to source loans from China, saying anyone willing to help Nigeria’s infrastructure was welcome."
  },
  {
    "headline": "I Will Sign Electoral Bill If NASS Includes Consensus Candidates, Indirect Primaries – Buhari",
    "summarized_story": "﻿President Muhammadu Buhari has stated his readiness to sign the Electoral Act Amendment Bill after the National Assembly makes the necessary adjustments.\nHe, however, said such changes must include the addition of consensus candidates, indirect primary options to the mode of selecting a candidate for an election, as against the initial direct mode as the only option to conduct primaries by political parties.\nWhile the lawmakers have yet to resume from recess or deliberate on the bill, President Buhari said it was wrong to force an option on the people.\n“Personally, I do not support direct primary because I want people to be given a choice,” the President stated.\nNot as a result of direct primary, it is as a result of opposition parties coming together and fighting the PDP."
  },
  {
    "headline": "FG Formally Declares Bandits As Terrorists",
    "summarized_story": "The Federal Government has formally declared bandit groups operating in the country as terrorists.\nThe declaration titled ‘Terrorism (Prevention) Proscription Order Notice, 2021 is contained in Volume 108 of the Federal Republic of Nigeria Official Gazette.\nGovernors, the National Assembly, state legislators, lawyers and several groups were among those who made calls for bandits to be declared as terrorists.\nRuling on the motion in November, Justice Taiwo Taiwo declared bandits as terrorists.\nHe specifically held that activities of Yan Bindiga and Yan Ta’adda bandit groups, constitute acts of terrorism."
  },
  {
    "headline": "Oromoni: Lagos Govt Clears Five Dowen Students, Staff, Orders Release Of Suspects",
    "summarized_story": "The Lagos State Government has cleared five students and five employees of Dowen College accused of complicity in the death of 12-year-old Sylvester Oromoni.\nThe state cleared them as well as the school following the Legal Advice of the Director of Public Prosecution, DPP, Ms. Adetutu Oshinusi.\nThe state also cleared the minors of belonging to unlawful society due to insufficient facts to establish the offence.\nC17, Vol.3, Laws of Lagos State 2015.\nThe state, therefore, directed that all the suspects should be released if they are still in custody."
  },
  {
    "headline": "2023: Why I Won’t Disclose My Preferred Successor’s Identity – Buhari",
    "summarized_story": "However, President Muhammadu Buhari is not willing to reveal the identity of his anointed candidate for the safety of such a person.\nI better keep it,” the President stated with a smile.\n“All important things, I’ll make sure that they are on record.\n“I think my legacy is that I try to make sure that we conduct ourselves with integrity.\n“There should be options, you can’t dictate to people and say you are doing democracy."
  },
  {
    "headline": "APC Reconciles Governor Inuwa Yahaya, Senator Goje -",
    "summarized_story": "The All Progressives Congress (AP C) has recorded a landmark Reconciliation between His Excellency the Executive Governor of Gombe state Alh.\nMohammed Inuwa Yahaya and former Governor of the state Sen. Mohammed Danjuma Goje.\nMai Mala Buni with the party’s National Reconciliation Committee Chairman, Sen. Abdullahi Adamu and member if the Committee, Sen. Kashim Shettima.\nThis Gombe state political gladiators were meeting for the first time after a political clash in the state last year.\nYahaya and Sen. Goje for placing the party interest and that of Gombe state over and above personal interests."
  },
  {
    "headline": "Former Lagos Assembly deputy Speaker, Adetoun Adediran, dies -",
    "summarized_story": "Former Deputy Speaker of the Lagos State House of Assembly, Honourable Adetoun Adediran is dead.\nAccording to thegazellenews.com Adediran died early today, Wednesday, 5 January, 2022 after a brief illness.\nAdediran was the first elected female Deputy Speaker of the Lagos State House of Assembly when she served between 1999 and 2003.\nSince then she has held many political offices including being the Women Leader of the Lagos State chapter of the All Progressives Congress (APC).She was reported to have been sick for just two days before her demise this morning."
  },
  {
    "headline": "APC caretaker committee must ensure National Convention goes beyond just electing NWC",
    "summarized_story": "A chieftain of the All Progressives Congress and Director General Of the Progressives Governors Forum, Salihu Lukman, has appealed to the party’s Caretaker Extraordinary Convention Planning Committee, to ensure that the February 2022 Convention is not just about electing National Working Committee members.\nHe urged party leaders on recommendations from the Convention, which he says should guide the review process of the party’s manifesto and bring out some of the campaign agenda of the APC for the 2023 campaigns.\nSalihu Lukman says It is quite worrisome that speculations about the Convention are allowed to create strong doubts as to when the Convention will hold.\nThe major gap, however, is that no date or details of Committees, their membership and terms of reference, were given,a worrisome situation.\nGiven the roll out of political activities for the year, Mr Lukman advised the Caretaker Committee to set up relevant committee for the party’s national assembly, to rest speculations is some quarters that the convention will not hold in February."
  },
  {
    "headline": "Tinubu hails Prof. Bolaji Akinyemi at 80",
    "summarized_story": "All Progressives Congress National Leader, Asiwaju Bola Tinubu, has poured encomiums on elder-statesman and former Foreign Affairs Minister, Prof. Bolaji Akinyemi, as he turns 80 on January 3, 2022.\nIn a statement by his Media Office signed by Mr. Tunde Rahman, Asiwaju, the former Lagos governor, said:“Warm congratulations to former Minister of Foreign Affairs, Prof. Bolaji Akinyemi, on attaining 80.\nErudite scholar, author, diplomat, pro-democracy activist and committed progressive, Prof. Akinyemi has done a lot for this country.\nEasily one of the best the country has produced in that office till date, his two years in office were significant as they represented some of the country’s best moments in international relations.\n“Rich in experience, wisdom and knowledge, Prof. Akinyemi is today an important elder-statesman."
  },
  {
    "headline": "Rochas Okorocha: Uzodinma’s Mate in this Matter Should be Uche Nwosu",
    "summarized_story": "Former Imo governor, Rochas Okorocha, addresses allegations that he is responsible for insecurity in Imo State."
  },
  {
    "headline": "Bolaji Akinyemi : I Wish I Stayed Longer as Minister",
    "summarized_story": "Prof. Bolaji Akinyemi discussed his engagements on the local and international arena for almost five decades and how his interventions as one of Nigeria’s foremost foreign policy experts have helped to shape the country’s foreign policy.\nAs he marks his 80th birthday."
  },
  {
    "headline": "Governor Sanwolu Defied By Police CSP – Trending with Ojy Okpe – Arise News",
    "summarized_story": "The Lagos State Governor, Babajide Sanwo-Olu, on Tuesday, won the hearts of many Lagosians when he stormed the Magodo Phase 2 Estate, in a bid to dismiss police officers stationed there in what he described as an illegal operation.\nOn November 25th a federal high court in Abuja declared the activities of all bandit groups in the country as acts of terrorism.\nThe AGF said his office will be gazetting the court order in a few days.\nIn a related development, reactions have trailed the killing of two notorious bandits Alhaji Auta and Kachalla Luga in Zamfara State.\nThe bandits were said to have been responsible for the abduction of many residents in the state."
  },
  {
    "headline": "North Korea Launches ‘Unidentified Projectile’ into Sea",
    "summarized_story": "North Korea has fired what has been described as an unidentified projectile into the sea, said South Korea’s Joint Chiefs of Staff (JCS).\nUnited Nations officials had earlier warned that vulnerable children and elderly people in North Korea were at risk of starvation.\nHowever, Mr Panda says this was unlikely to deter North Korea from pursuing its weapons program.\nNorth Korea has also repeatedly accused South Korea of double standards over military activities.\nSouth Korea recently tested its first submarine-launched ballistic missile, which it said was needed as deterrence against North Korea’s “provocations”."
  },
  {
    "headline": "UK Travel Firms Call for Removal of Covid Testing Rules",
    "summarized_story": "The travel industry said compulsory testing for UK arrivals and departures had held back the sector’s recovery.\nIt said that passenger numbers at MAG’s airports fell by more than 30% after Omicron measures were introduced.\nAs well as travel restrictions, ministers must also consider future plans for domestic testing.\nMAG chief executive Charlie Cornish and Airlines UK chief executive Tim Alderslade said the government should press ahead with the “immediate removal” of travel testing requirements which come at “huge cost” to the industry.\nBut it said the requirement that people take a PCR test within two days of arriving in England is set to remain."
  }
]