[
  {
    "headline": "Politics now big business, avenue for quick money – Soludo",
    "summarized_story": "“Politics has become big business.\nAppointment or election into public office is seen largely as an opportunity to ‘eat’ rather than a call to selfless service.\nIt only promotes benefits to the individual that is in the public space.\nSocieties that develop did so on the principle that those in the public space are to provide leadership.\n“It is politics that has made the economy to be bad within the context of all the endowment that we have."
  },
  {
    "headline": "Police recruitment our constitutional duty, not NPF’s–PSC",
    "summarized_story": "THE Police Service Commission has said it would not surrender to the Nigeria Police Force its constitutional mandate to recruit police constables which had been affirmed by the Court of Appeal.\nThe PSC stated this in reaction to the protest and shutdown of its headquarters by workers protesting the takeover of the ongoing recruitment by the police.\n‘’The management of the commission has no intention to abdicate this constitutional responsibility.\nAt no time did management willingly surrender the commission’s mandate to the Nigeria Police Force.\nHe added, ‘’The management is currently taking up the recent announcement by the police, of screening dates for the 2021 constables recruitment, and will ensure that the constitutional responsibilities of the commission are not hijacked.’’Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "Talent City to develop revolutionary tech community in Alaro",
    "summarized_story": "By Kingsley AdegboyeTalent City, a revolutionary community founded by serial African techpreneurs, is moving to Alaro City, Lagos’ new city in the Lekki Free Zone.\nTalent City is backed by Pronomos, Charter Cities Institute, Ventures Platform, and Lofty Inc and, following its inauguration at Alaro City, has the ambition to roll out additional model cities in Africa.\nAlong with our partners, we have acquired a 72,000 sqm plot in Alaro City, Lagos’ new city in the Lekki Free Zone.\n“We are pleased to welcome the innovation and innovators of Talent City to Alaro City, where they will find an equal partner in actualising Talent City’s revolutionary ambitions in the technology ecosystem,” added Yomi Ademola, Managing Director, Alaro City.\nAlaro City was awarded the “Best Industrial Development of the Year” distinction at the prestigious Real Estate Discussions and Awards (REDA) 2021."
  },
  {
    "headline": "ARPM Task Force, Police operatives nab suspected oil thieves in Abuja",
    "summarized_story": "By Tunde OsoOperatives of the Association of Refineries and Petroleum Marketers, ANRPM, and men of the Inspector General of Police from the Special Task Force on Petroleum & Illegal Bunkering Unit from Force Headquarters, Abuja, on Friday 28, 2021 busted a gang of suspected oil thieves of Petroleum products at Church Gate, Close to the Nigerian National Petroleum Corporation (NNPC) Abuja, the Federal Capital City.\nLed by the National Task Force Chairman, Eshanekpe Israel, a.k.a Akpodoro and Emmanuel Okoh, a Superintendent of Police, the team arrived the storage facility tucked in a supposed private residence at the Church Gate residence belonging to one Chijioke to discover a huge amount of stolen petroleum products.\nThe Taskforce Team immediately sealed off the facility while the duo of the secretary and accountant were arrested and taken to the office of the police anti-vandal team for further investigation.\nHe further highlighted the need to stop oil thieves from adulterating and stealing Petroleum products saying they (suspected oil thieves) are responsible for several fire incidents recorded lately in the country owing to adulteration of Petroleum products that are easily combustible in the event of road crashes across the country.\nWorking further on credible intelligence gathered by the men of ANRPM, the team also bust another dump site at the Mabushi area of the Federal Capital Territory where a seeming tank farm for stolen petroleum products is domicile."
  },
  {
    "headline": "POWER SHIFT: Why South can’t stop North in 2023 — Kwankwaso",
    "summarized_story": "Kwankwaso was, up till 2015, a member of the Peoples’ Democratic Party, PDP, when he left the party for APC.\nIf you look at security, it is not just for the military or security agencies alone.\nAnd to us, security is not just about the military or security agencies alone.\nBut if you don’t come out to communicate with the people, even friends and supporters will start wondering what you are doing.\nDo you see APC retaining power at the centre in 2023 or PDP taking over power from APC?"
  },
  {
    "headline": "Erosion is swallowing my people in S/East — Onuigbo",
    "summarized_story": "In this interview, he shared what motivated him to sponsor climate change bill, now an act with its benefits to Nigeria.\nWhat motivated you to sponsor the Climate Change Bill that was recently signed into law by President Muhammadu Buhari?\nIt’s the climate change bill.\nThe nation now has a legal framework on issues of climate and how to tackle climate change.\nThe reason is that right now as we speak, transferring people to climate change desk is like punishment of sending them to Siberia."
  },
  {
    "headline": "Save our people from total annihilation, starvation, Chibok group bawls",
    "summarized_story": "By Ezra Ukanwa, AbujaA group, the Kibaku (Chibok) Area Development Association, KADA, has called on the Federal Government, FG, to deploy more troops, and ammunition to Chibok to save its people from total annihilation and starvation.\n“Just this year (2022) alone, Kautikari (second largest town in Chibok area) was attacked on January 14 with 5 (five) girls abducted.\nIn sustaining their carnage, Piyemi, another big town in Chibok area, was attacked on January 20 with 19 persons (mostly girls) abducted and one person, the Vigilante leader, beheaded!\n“We call on all well-meaning Nigerians and Mr. President in particular, to rise up to the occasion and urgently save our people from total annihilation and starvation.\nWe appeal to the Federal Government to immediately set up IDP Camps in Chibok town and provide Chibok with skills acquisition centre so as to avoid imminent hunger/starvation in Chibok."
  },
  {
    "headline": "110 Chibok girls abducted in 2014 unaccounted for – Community",
    "summarized_story": "The Kibaku (Chibok) Area Development Association (KADA) in Borno State has said a total of 110 out of the 276 girls abducted by Boko Haram in 2014 are still unaccounted for.\nPresident of KADA, Dauda Iliya, in a press conference in Abuja on Saturday, explained that out of abducted girls, 57 escaped from the camp of their abductors.\nIliya said that in 2022 alone, Kautikari (the second largest town in the Chibok area) was attacked on January 14 with five girls abducted, three persons killed and many houses and churches burnt.\nIn sustaining their carnage, he explained that Piyemi, another big town in the Chibok area, was attacked on January 20 with 19 persons, mostly girls, abducted and one person, the vigilante leader, beheaded.\nHe explained that they expect their remaining 110 daughters abducted in 2014 and numerous others subsequently abducted at different times to be brought back to them."
  },
  {
    "headline": "Timothy Adegoke: Our kinsman must not die in vain – Oyo Speaker tells police, judiciary",
    "summarized_story": "Speaker of the Oyo State House of Assembly, Adebo Ogundoyin, has said that Mr Timothy Adegoke, an indigene of Eruwa in Ibarapa East Local Government Area of the state, must not die in vain.\nOgundoyin, while speaking, said that the police and the judiciary must not allow the deceased to die in vain.\n“Today we are gathered to bid farewell to late Timothy Adegoke.\nI appreciate everyone who has joined in the campaign for justice for the late Timothy Adegoke.\nMay the Lord rest the soul of late Timothy Adegoke and grant him eternal rest in the bosom of the Lord”."
  },
  {
    "headline": "Why Yahoo boys, drug barons are becoming politicians – Soludo",
    "summarized_story": "The Anambra State Governor-Elect, Chukwuma Soludo, has lamented the influx of drug barons and internet fraudsters known as Yahoo boys into politics.\nSoludo said Nigerians now see politics as a big business rather than a call to service.\nSoludo said oil money has “destroyed the social fabric” and some political stakeholders created political structures to make so many gains.\n“As the noose tightened globally on other rentier/criminal enterprises such as drug trafficking or internet scamming, many of the barons flocked into politics as the next easy alternative.\n“Politics has become big business."
  },
  {
    "headline": "Insecurity threatening existence of private universities – Bishop Kaigama",
    "summarized_story": "Bishop Ignatius Kaigama has said that insecurity is threatening the survival of the education sector, especially private universities.\nKaigama said this while speaking at the 10th convocation ceremony of Veritas University on Saturday in Bwari, Abuja.\nThe Archbishop lamented that the incessant attacks by bandits on the education sector threatens the existence of private universities and puts them at risk.\n”I, therefore, wish to use this medium to call on the government to take drastic steps to improve on the security and safety of lives and properties in and around university campuses across Nigeria.\n”This is in order to ensure their continued well-being,” Kaigama said."
  },
  {
    "headline": "Two students killed as cultists attack police team in Kwara",
    "summarized_story": "Two suspected cultists have been killed during an attack on security detectives in Kwara State.\nThe Kwara State Police Command confirmed their death in a statement on Saturday.\nNAN quoted him as saying four of the cultists, also students of the institution, were arrested and dangerous weapons recovered from them.\n“This prompted the visit to the area by the STS team.\n“Surprisingly, the cultists who were already in ambush, attacked the police team damaging the police Hummer bus, and inflicting a gunshot injury on the head of one police Sergeant, Adebayo Abdulahi, attached to the STS team."
  },
  {
    "headline": "All Nigerians regret voting for Buhari – BNSG",
    "summarized_story": "Benue State Commissioner for Information, Culture and Tourism, Hon.\nMichael Inalegwu says all Nigerians regret voting General Muhammadu Buhari as the nation’s president.\nHe spoke over the weekend during a world press conference he addressed in reaction to a press statement by the Senior Special Assistant to the President on Media, Mallam Garba Shehu.\nAccording to the Commissioner, “It will interest Shehu to know that it is not only the Governor that regrets voting Buhari as President in 2015.\nInalegwu said it is shameful for Garba Shehu to refer to President Buhari’s recommendation for the return of the century-old animal husbandry which is not implementable in this age."
  },
  {
    "headline": "North must produce Buhari’s successor, says Bala Mohammed",
    "summarized_story": "Governor Bala Mohammed of Bauchi State is not swayed by arguments in favour of presidential power shift to the South next year as he insists that the North must produce President Muhammadu Buhari’s successor.\n- Advertisement -He claimed that the agitation for power shift to the South applies only to Buhari’s party –All Progressives Congress (APC).\nIt is the APC that has this burden of zoning the presidency to the South.\n“In my party, the last President, Goodluck Ebele Jonathan, was from the South and he was my President.\nPower ought to be shared in Nigeria between North and South, and rotation is part of power sharing."
  },
  {
    "headline": "Amid probe, Abba Kyari makes first public appearance at IGP Alkali’s son's wedding",
    "summarized_story": "The suspended erstwhile head of the Inspector General of Police Intelligence Response Team, Abba Kyari, yesterday graced the wedding Fatiha of Maina Alkali, the son of Inspector-General of Police, Usman Alkali Baba.\nKyari had not been seen in public functions or activities since the outrage that greeted his Facebook post on August 4, 2021 amid his controversial involvement with alleged internet fraudster Hushpuppi.\nHe eventually deleted the post and disappeared from the Blueville and also from Instagram where he had over 80,000 followers.\nHowever, the Borno indigene took to his verified Facebook page with over 450,000 followers yesterday to share photos from the wedding ceremony.\nThe Nation learnt that yesterday’s wedding ceremony took place at the palace of the Shehu of Borno, Abubakar El-Kanemi, in Maiduguri, the capital of Borno State."
  },
  {
    "headline": "APC chair: Governors in the dark as Buhari keeps party guessing",
    "summarized_story": "Bawa Bwari and the Chairman of the APC National Reconciliation Committee, ex-Governor Abdullahi Adamu for the slot.\nParty sources however hinted that the incoming national chairman may emerge through a consensus being worked out by governors elected on the platform of the party.\nThere had been no word from Buhari at press time on his choice for the exalted position, thus leaving the governors, party leaders and aspirants guessing.\nA few other leaders, including CECPC members, are seeking the APC chairmanship slot for the Chairman of the APC National Reconciliation Committee, ex-Governor Abdullahi Adamu.\nA party source said: “The emergence of Bawa and Adamu in the calculations for APC chairmanship race is part of the complexity we are talking about."
  },
  {
    "headline": "EFCC detains VON DG over ‘N1.3bn fraud’",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) yesterday detained the Director-General of the Voice of Nigeria (VON), Osita Okechukwu, over alleged misappropriation of public funds.\nOkechukwu drove to the EFCC headquarters in Abuja at about 1:30 pm to honour an invitation from the agency over allegations of conspiracy, abuse of office and misappropriation of public funds to the tune of N1.3 billion.\nSpokesperson for EFCC, Wilson Uwujaren, confirmed the VON DG’s invitation but gave no details."
  },
  {
    "headline": "Insecurity: Gov Bello urged to replicate Amotekun in Kogi",
    "summarized_story": "From Oluseye Ojo, IbadanGovernor Yahaya Bello of Kogi State has been urged to replicate the South West Security Network, known as Amotekun Corps, in the state, with a view to tackling the security challenges retarding the progress of the state headlong.\nBut he said Bello could give the security outfit any name that suits the state.\nHe stated that he did not have any iota of doubt that the introduction of Amotekun Corps to Kogi would help in reducing the spate of insecurity in the state.\nAdams, who is the global convener of the Diaspora group, said: “I urge our amiable governor to replicate the idea of Amotekun in Kogi State.\nThe governor can give the state security outfit any name that suits its purpose."
  },
  {
    "headline": "2023: Afenifere, Ohaneze, YCE, others dare APC",
    "summarized_story": "However, Afenifere, Ohaneze Ndigbo Worldwide, YCE, MBF and Pan Niger Delta Forum, (PANDEF) have insisted that all the political parties should zone their presidential ticket to the south in 2023.\nAfenifere National Publicity Secretary, Jare Ajayi, said: “Our position is that the presidency should go to the South in 2023.\nIn fact, we have said that all political parties should zone their presidential ticket to the South.\nHe said: “Every Nigerian knows it is the turn of the South East to produce the President of Nigeria in 2023.\nIt was done in 1999 when both political parties zoned their presidential ticket to the South West."
  },
  {
    "headline": "Ekiti APC guber: My victory a win for all –Oyebanji",
    "summarized_story": "From Priscilla Ediare, Ado-EkitiWinner of the All Progressives Congress (APC) governorship primary in Ekiti State, Mr Biodun Oyebanji, has described his victory as “a win for all and a win for participatory democracy.\nHe pledged to work together with other aspirants to ensure victory for the party in the June 18 governorship election in the state.\nOyebanji, who was declared winner by the Governor Baduru Abubakar-led Governorship Election Committee, polled 101,703 votes at the primary election.\nSpeaking with journalists in Ado Ekiti, Oyebanji commended members of the APC for coming out in large numbers to participate in the electoral process as a sign of deepening the internal democracy of the party.\nI hereby promise my fellow aspirants that together, we will work towards victory and a bright future for our people."
  },
  {
    "headline": "Ekiti APC primary: We carried out exercise with fear of God –Badaru",
    "summarized_story": "From Romanus Ugwu, AbujaChairman of the All Progressives Congress (APC) primary on Ekiti State governorship election, Governor Mohammad Badaru Abubakar, has declared that he conducted the exercise with utmost fear of God.\nSpeaking at the party’s national secretariat in Abuja after submitting the report of the party primary conducted on Thursday in Ekiti, the Jigawa State governor denied writing result to favour the party’s standard bearer, Biodu Oyebanji.\n“At the opening of my engagement with the aspirants, at the stakeholders meeting we held in Ekiti State, I told them that power comes from God.\nAnd believe that He knows who will be the next governor of Ekiti State even before we start this process.\nAnd we did this primary with utmost fear of God."
  },
  {
    "headline": "I can date my friend’s ex-lover if… – Uche Ogbodo",
    "summarized_story": "Nollywood actress, Uche Ogbodo, will think twice before getting romantically involved with her friend’s ex-lover.\nAccording to the single mum of two, the question about dating her friend’s ex-lover or husband is quite deep.\nWhen asked how she feels dating a younger lover like Bobby Maris, Ogbodo says she sees her man as “Mr.\n“It doesn’t make me feel anyhow that people call him my younger lover.\nI’m obviously older than my man, with a couple of years but I don’t see him as my younger lover."
  },
  {
    "headline": "407 Killed, 332 Abducted in 72 Boko Haram Attacks, Chibok People Cry out",
    "summarized_story": "Chibok got famous when on April 14, 2014 Boko Haram invaded a school in the community, abducting over 270 schoolgirls.\nThe group, which was led to the press conference by the National President of KADA, Dauda Iliya said: “We are on behalf of the entire Chibok Community, using this medium to once again call on President Muhammadu Buhari to rescue Chibok Community, an ethnic nationality, from total annihilation by the Boko Haram Terrorists.\n“The parents and the Community have continued to be subjected to persistent and sustained attacks, killings, abductions, maiming, arsons and other myriads of criminality without adequate government protection.\nChibok has been for all intents and purposes abandoned to its own devices by all layers of government in Nigeria.\nJust this year (2022) alone, Kautikari (second largest town in Chibok area) was attacked on January 14 with five girls abducted, three persons killed, many houses and churches burnt, etc."
  },
  {
    "headline": "Osinbajo: Only Leaders Not Inspired by Personal Profit Can Bring about National Transformation",
    "summarized_story": "He added that as a model of leadership, transformational leadership operates by serving and uplifting others because it is servant leadership.\nThis is a model of leadership that is inseparable from our conception of the common good.\n“Transformational leadership is, therefore, the pursuit of the common good.\nBut the pursuit of the common good itself is not as easy as it sounds.\n“Fulfilling the immense promise of our nation requires men and women of goodwill from various communities and faiths to collaborate in advancing the common good."
  },
  {
    "headline": "US: War against Sleaze in Nigeria, Core Priority of Biden Administration",
    "summarized_story": "*Declares American President committed to supporting Nigeria’s anti-corruption initiativesBennett OghifoThe United States Consul General, Claire Pierangelo yesterday stated that countering corruption “is not only a key concern” in Nigeria but also a core United States national security priority for the President Joe Biden’s administration.\nAs a result, she said the Biden government “is committed” to supporting anti-corruption initiatives and collaborative efforts to prevent graft, strengthen investigation and prosecution of corrupt persons and institutions in Nigeria.\nPierangelo stated this when the Inter-Religious Coalition Against Corruption in Nigeria, in collaboration with the US Consulate, launched ReportMagoMago.com, a web-based portal that leverages citizen engagement to fight corruption.\nThe global anti-corruption coalition, Transparency International, last Tuesday rated Nigeria the second most corrupt country in West Africa, after Guinea.\nIn the 2021 Corruption Perceptions Index, Nigeria dropped five places, scoring 24 out of 100 points in the 2021 index."
  },
  {
    "headline": "In Move to Allow Limitless Loan Recovery, CBN Amends Operational Guidelines of Global Standing Instruction",
    "summarized_story": "James EmejoThe Central Bank of Nigeria (CBN) has amended the operational guidelines of the Global Standing Instruction (GSI) to allow for continuous and unrestricted loan recovery by Deposit Money Banks (DMBs) and financial institutions in the country.\nThe bank explained further that in effect, the GSI’s automated loan recovery feature, applicable to all loans in the industry, shall remain perpetually in place throughout the life of the loan and/or until the loan is fully repaid.\nThe guideline contains lists of sanctions to be meted on banks and financial institutions in the event of violation or misapplication of the GSI.\nThe apex bank stated further that the move was in furtherance of its mandate to promote financial system stability.\nThe central bank had in July 2020, issued a guideline on the GSI, which was aimed at enhancing loan recovery and monitoring chronic loan defaulters."
  },
  {
    "headline": "Zoning: Buhari will Guide APC on Way Forward, Says Abiodun",
    "summarized_story": "Deji ElumoyeGovernor Dapo Abiodun of Ogun State has given an assurance that President Muhammadu Buhari would give the ruling All Progressives Congress (APC) the necessary guidance to achieve equity and justice in its zoning formula, ahead of the party’s national convention scheduled for February.\nAbiodun, who spoke with newsmen yesterday at the State House, Abuja, after leading Ogun leaders of thought on a thank-you visit to the President, expressed confidence that Buhari, as the leader of APC, would continue to provide the direction to move the party forward.\nHe said: “We have a President in place, we are the party that’s in government; our President is the leader of the party.\n“We are aware that the party is working on zoning and when that is formalised and ratified by NEC, then it will be made public.\nMeanwhile, President Buhari has described roads and housing estates he inaugurated recently in Ogun as “projects of outstanding quality”."
  },
  {
    "headline": "BREAKING: Boko Haram Fighters Currently Attacking Borno Community",
    "summarized_story": "Insurgents from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād, are currently attacking Ajiri.\nAjiri is a community in Mara Local Government Area of Borno State, which is about 52km from Maiduguri, the state capital.\nRecently, it appointed Wali Sani Shuwaram, a 45-year-old as the new leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of people mainly in Adamawa, Borno and Yobe states."
  },
  {
    "headline": "BREAKING: Boko Haram Fighters Currently Attacking Borno Community",
    "summarized_story": "Insurgents from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province formerly known as Jamā'at Ahl as-Sunnah lid-Da'wah wa'l-Jihād, are currently attacking Ajiri.\nAjiri is a community in Mara Local Government Area of Borno State, which is about 52km from Maiduguri, the state capital.\nRecently, it appointed Wali Sani Shuwaram, a 45-year-old as the new leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of people mainly in Adamawa, Borno and Yobe states."
  },
  {
    "headline": "Military Blames Poor Network, Roads For Zamfara, Niger Killings",
    "summarized_story": "The army asserted that the roads in those areas were very poor and the communication infrastructure is also poor.\nAkpor affirmed that the whole of the South-East will be swallowed by Niger State if put inside.\nStressing that the large expanse of land in Niger State is not something that can easily block and neutralise.\nIf you put the whole of the South-East inside Niger State, it would swallow it.\n“Also, the roads in these areas are very poor, and the communication infrastructure is also poor."
  },
  {
    "headline": "Military Blames Poor Network, Roads For Zamfara, Niger Killings",
    "summarized_story": "The army asserted that the roads in those areas were very poor and the communication infrastructure is also poor.\nAkpor affirmed that the whole of the South-East will be swallowed by Niger State if put inside.\nStressing that the large expanse of land in Niger State is not something that can easily block and neutralise.\nIf you put the whole of the South-East inside Niger State, it would swallow it.\n“Also, the roads in these areas are very poor, and the communication infrastructure is also poor."
  },
  {
    "headline": "Insecurity Threatening Existence Of Private Universities, Catholic Bishop, Kaigama, Says",
    "summarized_story": "Catholic Archbishop of Abuja, Ignatius Kaigama, has said that insecurity in Nigeria was directly or indirectly affecting the survival of private universities in the country.\nHe asserted that the incessant attacks by bandits on the education sector do not only affect the safety of students and staff in schools but also threatens the existence of private universities and put them at risk.\nFile Photo of the Archbishop of Abuja, Ignatius KaigamaKaigama made this assertion while speaking at the 10th convocation ceremony of Veritas University on Saturday in Bwari, Abuja.\nHe called on government to improve security in university campuses to secure the lives of students.\nHe said, ”The attacks by bandits and other criminal elements on the education sector do not only affect the safety of students and staff in schools but also directly or indirectly affect the survival of private universities."
  },
  {
    "headline": "‘Who are we going to vote for?’",
    "summarized_story": "Just as my neighbour was asking me who we should vote for, so also do millions of Nigerian voters ask their leaders and influencers the direction to go.\nHow sweet it is for you to vote freely, for your vote to be counted and for your vote to count!\nHowever, this begs the question: does a PVC in hand translate to making the right choice?\nIt is often argued that Nigerian parties do not have ideologies, that they are in the same boat.\nRather, those who go to their leaders to ask “who should be vote for” are going to be in the majority."
  },
  {
    "headline": "‘Who are we going to vote for?’",
    "summarized_story": "Just as my neighbour was asking me who we should vote for, so also do millions of Nigerian voters ask their leaders and influencers the direction to go.\nHow sweet it is for you to vote freely, for your vote to be counted and for your vote to count!\nHowever, this begs the question: does a PVC in hand translate to making the right choice?\nIt is often argued that Nigerian parties do not have ideologies, that they are in the same boat.\nRather, those who go to their leaders to ask “who should be vote for” are going to be in the majority."
  },
  {
    "headline": "Residents 'flee into forest' as gunmen attack Niger community",
    "summarized_story": "Many people are feared to have been killed following an attack by gunmen on Galkogo village in Shiroro LGA of Niger state.\nAlawa said about 200 persons invaded the village on motorcycles, holding different kind of weapons and shooting sporadically.\nAdvertisement“You know this kind of attack, they have been targeting that village because there is a very strong vigilante group there.\n“There are villages before Galkogo but they came straight down to Galkogo to attack us.\nCurrently, we are trying to see if we can take trucks to the forest to rescue some of our people,” he said."
  },
  {
    "headline": "Residents 'flee into forest' as gunmen attack Niger community",
    "summarized_story": "Many people are feared to have been killed following an attack by gunmen on Galkogo village in Shiroro LGA of Niger state.\nAlawa said about 200 persons invaded the village on motorcycles, holding different kind of weapons and shooting sporadically.\nAdvertisement“You know this kind of attack, they have been targeting that village because there is a very strong vigilante group there.\n“There are villages before Galkogo but they came straight down to Galkogo to attack us.\nCurrently, we are trying to see if we can take trucks to the forest to rescue some of our people,” he said."
  },
  {
    "headline": "Ondo tops list as NCDC reports 74 new Lassa fever cases in one week",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has reported 74 new cases of Lassa fever in nine states across the country.\nLassa fever, an acute viral hemorrhagic disease, is transmitted to humans through contact with food, household items contaminated by infected rodents or contaminated persons.\nOther states that reported new infections include Oyo (3), Ebonyi (3), Benue (1), Katsina (1), Kaduna (1), and Taraba (1).\nOf all confirmed cases, 74% are from Edo (28%), Ondo (28%) and Bauchi (23%) States.\nThe male to female ratio for confirmed cases is 1:0.9."
  },
  {
    "headline": "What do blockchain, NFT, DAO and crypto mean?",
    "summarized_story": "What do blockchain, NFT, DAO and crypto mean?\nHow it works: Standard databases store data in rows, columns and files, but blockchain stores data in blocks that are chained together.\nHow it works: Cryptos are digital currencies created on blockchain technology.\nHow it works: To put it simply, NFTs are digital works that exist on blockchain.\nHow Web3 works: Web3 will be built on the blockchain working independently from different parts of the world."
  },
  {
    "headline": "Nigerian musician Buju wanted to reward his fans, so he created an NFT project",
    "summarized_story": "After learning extensively about ethereum and NFTs, he started selling the idea of an NFT project to several Nigerian music artistes.\nBefore he knew it, it was making waves and, unknown to his many fans jamming to the song, the colourful art cover is in fact an unreleased NFT project.\nBuju had seen the NFT project as an opportunity to build a community around his fans, reward and connect with them like never before.\nI feel like it is the best way I could reward people that enjoy my music,” Buju said.\nIn this quarter, the “HeadsByBuju” project will be minted publicly and pre-sale will start."
  },
  {
    "headline": "Zimbabwean James Manyika, becomes Google’s first Senior Vice President of Technology and Society",
    "summarized_story": "Google has appointed Zimbabwean James Manyika as the company’s first Senior Vice President of Technology and Society.\nManyika will report directly to Alphabet’s (Google’s parent company) CEO Sundar Pichai and will be working on the impact of technology on society and the environment.\n“I’m thrilled that James Manyika will be joining Google’s leadership team,” Pichai said in a statement.\n“He’s spent decades working at the intersection of technology and society and has advised a number of businesses, academic institutions and governments along the way.\nManyika has advised the chief executives and founders of many of the world’s leading tech companies on strategy and growth, product, and business innovation."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "roHealth officially launches in Nigeria, provides free Health Insurance for SMBs",
    "summarized_story": "Share this article:Nigeria-based healthtech, roHealth has rolled out a free health plan coverage for SMBs in Nigeria.\n“We are a platform that gives employees greater decision-making control over their health insurance with cashback when it is not used.\nEmployees can choose from over 100 Health Plans from top HMOs in Nigeria” Olude told Techpoint at the event.\n” roHealth is on a mission to increase access to healthcare in Nigerians by providing free health Insurance for a limited period.\nSince its inception 4 months ago, over 7000 lives and 500 businesses actively use roHealth for making their health coverage decisions."
  },
  {
    "headline": "Using its credit analytics solution, Periculum wants to improve financial inclusion for Nigerians",
    "summarized_story": "Improving access to credit for underserved marketsNot all organisations have this capability, and this is where Periculum believes it has found its sweet spot.\nWhile working at these banks, he researched and discovered many underserved customers, even in Canada.\n“I started out working in the bank and discovered that we have many underserved customers, so I decided to do some research.\nAccording to Business Day, seven in ten bank customers in Nigeria lack access to credit.\nBusiness model and key differentiatorPericulum can make money in two major ways — a credit analytics and data analytics service to businesses."
  },
  {
    "headline": "There’s more to crypto than buying low and selling high",
    "summarized_story": "At times like that, crypto traders and evangelists seize every opportunity to remind everyone who isn’t into crypto trading what they are missing.\nThere’s more to crypto than tradingCryptocurrencies are used primarily for speculative purposes, buying low and selling high, but they weren’t originally created for speculation.\nAround 40% of Africa’s population — 1.3 billion — lives in extreme poverty, making crypto trading a very attractive venture.\nTransactions on the Ethereum network, the most popular network for alternative crypto usage, cost a lot.\nWhile there are new networks, Solana and Polygon, for instance, springing up and reducing the cost of crypto usage, only time will tell if alternative crypto usage will catch on in Africa."
  },
  {
    "headline": "Oil is near $100 but for Nigeria it is still a story of squandering of riches",
    "summarized_story": "Oil is near $100 but for Nigeria it is still a story of squandering of richesWith prices trading near a seven-year high as crude makes a roaring start to 2022, the finances of Africa’s most populous nation remain precariously challenged by corruption and bad management.\nNigeria’s opaque oil industry is hobbled by inept policies which meant the flight of badly needed investment resulting in the failure to produce more oil to take advantage of soaring oil prices.\n“Nigeria is like a man who is dying from dehydration despite being in the midst of a ferocious rainfall,” says economist Festus Ogbobine.\nBrent hovered near $92 a barrel while West Texas Intermediate rose 2% for the week as robust demand tightened global markets.\nAs supply remains constrained, a chorus of Wall Street banks and oil executives are forecasting a return to $100 oil."
  },
  {
    "headline": "Top 10 food items Nigerians spent most on in 2021",
    "summarized_story": "Yam tuber, maize, beans, and plantain are some of the food items that gulped the most incomes of Nigerians in 2021 as they recorded the highest increase in prices, according to data from the National Bureau of Statistics.\nThe rising food prices only put more burden on Nigeria’s poor population already struggling with stagnant income and deteriorating standard of living, according to experts.\nThe Bank also revealed that inflation has pushed 8 million more Nigerians into poverty between 2020 and 2021.\n“The rise in food inflation came on the back of huge demand during the festive season and insecurity in the food-producing areas as 15 states recorded higher food inflation rates in December 2021,” said Ayodeji Ebo, Head, Retail Investment, Chapel Hill Denham.\nIn December 2021 specifically, white beans, brown beans, yam tuber, palm oil and vegetable oil were also the food items that accounted for the highest increase in food inflation, the same items when the average for the year was taken."
  },
  {
    "headline": "How economy, security, zoning will dominate debate ahead 2023",
    "summarized_story": "That is what is obtainable in Europe and also the way to go in 2023 if Nigerians wants change,” he said.\nThat should stop in 2023 by making sure any of those non-performing politicians do not even smell party primaries”, he suggested.\nSo, reviving the economy should top the manifesto content”, she said.\nBut Luke Onwuka, an Ahuda, River State-based, mechanical engineer and oil worker, said that government should put ‘no more foreign loans’ as part of the 2023 manifesto.\nHe also said that there should be no mention of fighting corruption in the 2023 manifesto as such will be making further mockery on the intelligence of Nigeria."
  },
  {
    "headline": "Annual Event to Commemorate Civilian-Led Peacebuilding in Mindanao Calls Forth Collective Action to Develop Peace – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOn the 24th of January 2022, over 22,000 social representatives from 51 countries attended the international peace conference celebrating the Peace Day held virtually.\nBack in 2014, Heavenly Culture, World Peace, Restoration of Light (HWPL), an international NGO mediated the conflict in Mindanao by proposing a peace agreement by local representatives.\nBeing the first in Luzon, a peace monument in Dingras, Ilocos Norte was unveiled last January 24 as part of the 8th Anniversary event of the HWPL Peace Day celebration.\nThe event, under the theme of “Law of Peace in Heaven and on Earth”, aimed to promote interfaith harmony between religions and raise public support to establish international law for peace.\n[8th Anniversary of the January 24 HWPL Peace Day] “Law of Peace in Heaven and Earth”https://youtu.be/PtBogiRkfFo..."
  },
  {
    "headline": "LAND TUSSLE: Appeal Court Dismisses Case, Awards N15m Against Edo Community – Nigerian Observer",
    "summarized_story": "The Appeal Court also allowed the cross appeal filed by the cross appealants (Ulegun) against the cross respondents (Ukhiri Village) and awarded the sum of Fifteen Million Naira ( N15, 000,000.00) as damages against Ukhiri.\nIn a unanimous decision read by Justice Biobele Abraham Georgewill, in the main and cross appeal with suit No.\n45 hectares lying and situated at Ulegun Village in the Benin-Abraka Road, Ikpoba-Okha Local Government Area of Edo State.\nRecall that Ukhiri had on 1976 dragged Ulegun to court alleging encroachment of a portion of its land by Ulegun.\nThe case was again struck out at the Appeal Court for lack of merit along with cost awarded against the appellants over damages and trespass."
  },
  {
    "headline": "FG N4.1 Billion Customs Revenue Target: Undue Pressure On The Agency – ANLCA Boss Faults – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Association of Nigeria Licensed Customs Agents (ANLCA) has described the recent revenue target of N4.1 billion by the Federal Government on the Nigeria Customs Service (NCS) for 2022, as a high target that will put undue pressure on the agency.\nFaulting the Federal Government decision on the exorbrant target, ANLCA posited that the target would also undermine its core responsibility of facilitating trade between Nigeria and other countries.\nTony Iju Nwabunike stated this in Lagos recently during a press briefing to celebrate the four years of his executives on the leadership of the foremost freight forwarding association in Nigeria.\nNwabunike said: “We want to also advise the Federal Government to be careful before signing into the $3.1 billion Customs Modernisation Project which we heard, will run for 20 years.\n“For us, this shows more commitment by the Buhari administration to maritime matters."
  },
  {
    "headline": "CP Alabi Takes Over Leadership Of Lagos Command, Charges Officers And Men For Success – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The new Commissioner of Police, Lagos State, CP Abiodun Alabi has charged Area Commanders, DPOs/HODs and tactical commanders to translate their long-time relationship with him to success in the state.\nCP Alabi charged the officers during his maiden meeting with them shortly after taking over the mantle of leadership as Commissioner of Police in the state at a brief ceremony held on 24th January, 2022 at the Command Headquarters, Ikeja.\nThe CP also directed the Area Commanders and Divisional Police Officers to constantly engage and partner with critical stakeholders in their areas of responsibilities for effective policing.\nSpeaking further, the Commissioner of Police warned officers against corruption and infringement on fundamental human rights of Nigerians.\nHe, however, assured that he would always provide good leadership that would help them succeed in the discharge of their duties."
  },
  {
    "headline": "JUST-IN: Fire Guts Breweries In Osun",
    "summarized_story": "A part of the International Breweries plant in Ilesa, Osun State, was gutted by fire Friday evening with goods and equipment worth millions of naira destroyed.\nIt was gathered that the fire that started at about 7pm raged for about an hour before it was brought under control through the combined efforts of fire fighters, workers and people in the neighborhood.\nThough no life was lost as a result of the incident, the fire consumed valuables that cannot be immediately quantified by the management of the breweries.\nThe cause of the inferno cannot be established as at press time as divergent reasons were expressed by sources.\nADVERTISEMENTA source hinted that the fire at the Breweries plant started from one of the generator rooms on the premises while another claimed that the fire started from the company’s warehouse."
  },
  {
    "headline": "Group Urges Jonathan To Contest 2023 Presidential Election",
    "summarized_story": "A non-partisan group, the Nationalists Movement (NM) has called on former President Goodluck Jonathan to contest the 2023 presidential election.\nThe national coordinator, National Movement, Engr.\nRobinson noted that Jonathan is a unifying force that can keep the country one, adding that the nation’s unity, peace, and security needed to be preserved now than before.\nRobinson said Nigerians needed a popular leader like Jonathan with a track record of integrity and statesmanship to bridge the North-South alliance in 2023.\n“It is in view of the above that majority of patriotic and nationalistic Nigerians and friends of Nigeria from all works of life are pleading with Dr. Goodluck Ebele Jonathan to accept this critical national service once again,” he stated."
  },
  {
    "headline": "Amosun Tasks Nigerians On Welfare Of Prison Inmates, Orphans",
    "summarized_story": "Former governor of Ogun State and Senator representing the Central Senatorial district of the state, Ibikunle Amosun on Friday, urged well meaning Nigerians to always identify with the course of prison inmates, orphans, as well as other less privileged in the society, saying governments alone cannot shoulder all the responsibilities.\nAmosun declared that it is only by identifying with the course of prison inmates and the less privileged that Nigerians can help humanity and jointly achieve a crime-free society which every citizen can be proud of.\nThe former governor spoke at the Nigerian Correctional Service center in Ibara, Abeokuta, the state capital where he had gone to donate some welfare materials as part of the activities marking his 64th birthday celebration.\nThe inmates are Nigerians; they are humans like any other person.\nLet us extend to other people whatever God has given to us, let us try and see how far we can help others”."
  },
  {
    "headline": "Amosun Tasks Nigerians On Welfare Of Prison Inmates, Orphans",
    "summarized_story": "Former governor of Ogun State and Senator representing the Central Senatorial district of the state, Ibikunle Amosun on Friday, urged well meaning Nigerians to always identify with the course of prison inmates, orphans, as well as other less privileged in the society, saying governments alone cannot shoulder all the responsibilities.\nAmosun declared that it is only by identifying with the course of prison inmates and the less privileged that Nigerians can help humanity and jointly achieve a crime-free society which every citizen can be proud of.\nThe former governor spoke at the Nigerian Correctional Service center in Ibara, Abeokuta, the state capital where he had gone to donate some welfare materials as part of the activities marking his 64th birthday celebration.\nThe inmates are Nigerians; they are humans like any other person.\nLet us extend to other people whatever God has given to us, let us try and see how far we can help others”."
  },
  {
    "headline": "APC Commmitted To Welfare Of Masses – Osinbajo",
    "summarized_story": "The Buhari administration and the ruling All Progressives Congress (APC) remain committed to the welfare of the common man because it is a party of the people and will continually ensure that the common man benefits maximally from government, says Vice President Yemi Osinbajo, SAN.\nProf. Osinbajo stated this on Friday when he received on a courtesy call, a delegation of the APC Professionals Forum at the State House, Abuja.\nWhile it was formed about nine years ago, the VP noted that the party has made an impact and was determined to improve the wellbeing of Nigerians.\n“There are many people that say well, we have not done this, we have not done that.\nThe Forum’s delegation also included Deputy Chairman, Board of Trustees and former APC National Secretary, Waziri Bulama; Board of Trustees Secretary, Barrister Dapo Akinosun, SAN, and the national coordinator, Akeem Akintayo."
  },
  {
    "headline": "Alleged N1.3bn fraud: EFCC detains VON DG, Osita Okechukwu",
    "summarized_story": "THE Economic and Financial Crimes Commission on Saturday detained the Director-General of Voice of Nigeria, Osita Okechukwu, over a case of conspiracy, abuse of office and misappropriation of public funds to the tune of N1.3billion.\nHe was said to have arrived at the headquarters of the anti-graft agency in Abuja at about 1.30pm to honour an invitation but was detained and interrogated.\n“Osita Okechukwu, an All Progressives Congress chieftain, was consequently detained and interrogated about his alleged involvement in the fraud.\nThe EFCC spokesperson, Wilson Uwujaren, confirmed the invitation of the VON chief executive but declined to provide further details.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Alleged N1.3bn fraud: EFCC detains VON DG, Osita Okechukwu",
    "summarized_story": "THE Economic and Financial Crimes Commission on Saturday detained the Director-General of Voice of Nigeria, Osita Okechukwu, over a case of conspiracy, abuse of office and misappropriation of public funds to the tune of N1.3billion.\nHe was said to have arrived at the headquarters of the anti-graft agency in Abuja at about 1.30pm to honour an invitation but was detained and interrogated.\n“Osita Okechukwu, an All Progressives Congress chieftain, was consequently detained and interrogated about his alleged involvement in the fraud.\nThe EFCC spokesperson, Wilson Uwujaren, confirmed the invitation of the VON chief executive but declined to provide further details.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Atiku tackles Umahi over arrest of PDP spokesperson, party secretariat",
    "summarized_story": "Ebonyi Governor David Umahi has debunked having a hand in the continued closure of the Peoples Democratic Party (PDP) Head office in Abakaliki.\nThe PDP had consistently accused the State Government of frustrating moves to take over the Secretariat an allegation the State Government continues to deny.\nAtiku on Thursday urged Governor Umahi to return to the PDP secretariat.\nHe spoke through the chairman of the Technical Committee for the actualisation of the Atiku Abubakar presidential election, Dr Raymond Dokpesi during a consultation visit to PDP, Ebonyi State.\nThe Governor, in a statement by his media aide, Francis Nwaze, said Ebonyi State Government “is aware the People’s Democratic Party, PDP, Ebonyi State has a shelter in one ‘Green Lake hotel’ in Abakaliki from where it operates."
  },
  {
    "headline": "Atiku tackles Umahi over arrest of PDP spokesperson, party secretariat",
    "summarized_story": "Ebonyi Governor David Umahi has debunked having a hand in the continued closure of the Peoples Democratic Party (PDP) Head office in Abakaliki.\nThe PDP had consistently accused the State Government of frustrating moves to take over the Secretariat an allegation the State Government continues to deny.\nAtiku on Thursday urged Governor Umahi to return to the PDP secretariat.\nHe spoke through the chairman of the Technical Committee for the actualisation of the Atiku Abubakar presidential election, Dr Raymond Dokpesi during a consultation visit to PDP, Ebonyi State.\nThe Governor, in a statement by his media aide, Francis Nwaze, said Ebonyi State Government “is aware the People’s Democratic Party, PDP, Ebonyi State has a shelter in one ‘Green Lake hotel’ in Abakaliki from where it operates."
  },
  {
    "headline": "EFCC detains VON DG Okechukwu over alleged N1.3bn misappropriation",
    "summarized_story": "By Philomina AttahThe Economic and Financial Crimes Commission (EFCC) has detained the Director-General, Voice of Nigeria (VON), Mr Osita Okechukwu.\nA source close to the anti-graft agency said that Okechukwu was detained over an alleged case of conspiracy, abuse of office and misappropriation of public funds to the tune of N1.3billion.\nThe source added that the DG arrived at the headquarters of the EFCC in Abuja at about 1.30pm to honour its invitation.\nAs at the time of filing this report, Okechukwu was still in the custody of the EFCC, the source stated.\n“He is still with operatives of the EFCC.”When contacted, EFCC’s spokesperson, Mr Wilson Uwujaren confirmed the invitation of the VON DG, but declined further comment."
  },
  {
    "headline": "Nadal, Medvedev seek glory in Australia today",
    "summarized_story": "Daniil Medvedev finds himself the man in the way of history once again as he takes on Rafael Nadal in the final of the Australian Open on Sunday.\n“I know what Rafa is going for, I knew what Novak was going for.\nSo, I don’t think much about this, all this stuff.”This is Nadal’s 29th slam final and Medvedev’s fourth.\n“It’s really tough to get into the final, and I always have them there waiting for me,” said Medvedev.\nThat’s what I’m going to try to do on Sunday.”"
  },
  {
    "headline": "BREAKING: Boko Haram Fighters Currently Attacking Borno Community",
    "summarized_story": "Insurgents from the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province formerly known as Jamā’at Ahl as-Sunnah lid-Da’wah wa’l-Jihād, are currently attacking Ajiri.\nAjiri is a community in Mara Local Government Area of Borno State, which is about 52km from Maiduguri, the state capital.\nRecently, it appointed Wali Sani Shuwaram, a 45-year-old as the new leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of people mainly in Adamawa, Borno and Yobe states."
  },
  {
    "headline": "The Voice You Hear In BBNaija Is Lucifer’s – Mummy G.O (VIDEO)",
    "summarized_story": "The Voice You Hear In BBNaija Is Lucifer’s – Mummy G.O (VIDEO)Big Brother Naija, formerly known as Big Brother Nigeria BBNaija, is a Nigerian reality television series based on the Big Brother television franchise, in which contestants live in an isolated house and compete for a large cash prize and other material prizes at the end of the show by avoiding being evicted from the house by viewers who vote for their favorite housemates to stay in the show.\nAt this point, Ebuka will have to step in.\nMummy G.O, I’m done !!!\npic.twitter.com/CHK7urdN4t — theonly1acre (@theonly1acre) January 29, 2022"
  },
  {
    "headline": "In Ogun, Teenagers Behead Girlfriend, Burn Head For Money Ritual",
    "summarized_story": "The perpetrators were apprehended by members of the community while burning the girl’s head, according to the New Telegraph.\n“They killed Rofiat, cut off her head, packed the headless body in a sack and started burning the head in a pot.\nThey told the police in the presence of a mammoth crowd that they wanted to use it for money ritual.\nIn a video made available to our correspondent, Mustakeem Balogun, said: “We wanted to use just her head alone for money ritual.\nOyeyemi added that, a short cutlass and a knife used in cutting off the deceased head were also recovered from the suspects."
  },
  {
    "headline": "Gov. Emmanuel Canvass Unity Among Ekiti Guber Aspirants",
    "summarized_story": "Akwa Ibom State Governor, Mr Udom Emmanuel has urged contestants in the just concluded gubernatorial primaries of the People’s Democratic Party (PDP) in Ekiti State to bury the hatchet and work together for the victory of the party in the state.\nGovernor Emmanuel who was leader of the 5-man PDP primary election committee in Ekiti State gave the admonition while fielding questions with Government House correspondents at the Victor Attah International Airport, Uyo, upon his return from the assignment.\nIn his words, “Talking about Ekiti gubernatorial primaries, I’ve heard a whole lot; how some aspirants even before the process started, went to the press.\nI think we need to unravel that and question your real intensions.”The Ekiti PDP Guber primaries which was keenly contested by twelve apirants had Hon.\nSignificantly, all the aspirants who participated in the primaries have all congratulated the winner and pledged to work for the success of the PDP in the forthcoming Ekiti Governorship election."
  },
  {
    "headline": "Breaking: Ouattara shines as Burkina Faso beat Super Eagles conquerors Tunisia, zoom to AFCON 2021 semis",
    "summarized_story": "Teenager Dango Ouattara scored the only goal and was sent off as Burkina Faso surprised Tunisia to reach the Africa Cup of Nations semi-finals.\nOuattara, 19, ran onto Blati Toure’s through ball, held off two defenders and cut inside before firing in.\nBurkina Faso, who are ranked 60th in the world, have won all four Afcon quarters they have ever played including three in the past four tournaments.\nTunisia, ranked 30th, have lost six of their past seven.\nThe final whistle, blown 15 seconds before the indicated amount of injury time was over, was met by wild celebrations from the Burkina Faso players."
  },
  {
    "headline": "EFCC detains, grills VON DG, Osita Okechukwu, over ‘abuse of office, N1.3bn misappropriation’",
    "summarized_story": "The Director General of Voice of Nigeria (VON) Mr. Osita Okechukwu is currently being interrogated by the Economic and Financial Crimes Commission (EFCC) on Saturday.\nThis is happening after the country’s anti-graft agency reportedly detained the All Progressives Congress (APC) chieftain over alleged case of conspiracy, abuse of office and misappropriation of public funds to the tune of N1.3billion.\nAlready, EFCC spokesperson, Wilson Uwujaren, has confirmed the invitation of the VON boss.\nHowever, he didn’t give further details.\nDetails loading…"
  },
  {
    "headline": "Pictures: 6 months after, suspended Police cop, Abba Kyari, shows up in public",
    "summarized_story": "Abba Kyari, former head of the Intelligence Response Team (IRT) on Saturday appeared in public six months after he was suspended following allegation of receiving bribe from a Nigerian fraudster Hushpuppi.\nKyari was among the guests who graced the wedding Fatiha of Maina Alkali, son of incumbent Inspector General of Police Usman Baba Alkali in Maiduguri, Borno state capital.\nShortly after, Kyari shared the pictures from the event on his Facebook Page.\nOn his Facebook page, the erstwhile super cop wrote, “Today At the wedding of our younger brother Maina Alkali in Maiduguri my home town.\nThere were also top Nigerian political and business men who attended the event."
  },
  {
    "headline": "Eight Arrested As Rivers Govt Destroys 27 Illegal Refinery Sites",
    "summarized_story": "﻿Eight persons suspected to be pipeline vandals have been arrested in Akuku-Toru Local Government Area of Rivers State, as the operation to end oil bunkering and illegal refining of petroleum products is intensified by the State Government.\nThe suspects were arrested by a special anti-bunkering taskforce set up by the council chairman, Rowland Sekibo to fight illegal oil bunkering in the area.\nThe team, in different operations led by the chairman has also destroyed at least 27 illegal Refinery sites in the area in the past one week.\n“But those of us that are responsible, when we get information, we will go after them.”﻿The fight against illegal bunkering in Rivers State is being spearheaded by Governor Nyesom Wike.\nMr Wike earlier this month promised a reward of two million naira for identifying illegal refineries."
  },
  {
    "headline": "Lassa Fever: Nigeria Records 32 Deaths, 170 Cases In Three Weeks – Report",
    "summarized_story": "At least 32 people have died of Lassa fever since the beginning of the new year, according to data from the Nigeria Centre for Disease Control (NCDC).\nIn a situation report obtained by Channels Television on Saturday, the agency disclosed that the nation reported a total of new 170 confirmed cases within the period.\n[READ ALSO] Lassa Fever: Nigeria Records 11 Deaths, 96 Cases In Two WeeksIt is an acute viral illness and a viral haemorrhagic fever contracted by touching soiled objects, eating contaminated food, or exposure to open cuts or sores.\nThe number of suspected cases has increased compared to that reported for the same period in 2021.\n“National Lassa fever multi-partner, multi-sectoral Technical Working Group (TWG) continues to coordinate the response activities at all levels.”"
  },
  {
    "headline": "Arewa Youths Ask Okonjo-Iweala, Dangote, Otedola, Others To Join 2023 Presidential Race",
    "summarized_story": "Northern youths under the aegis of the Arewa Youth Assembly have called on successful entrepreneurs in various sectors of the private economy to join the 2023 presidential race.\n“An entrepreneur that can grow wealth, bear risk in such conditions found in Nigeria surely is suited to better the fortunes too of the nation,” the youths said.\nAnother election season and the whole country turns into an atmosphere of advertisement for different candidates from different political parties.\nAn entrepreneur that can grow wealth, bear risk in such conditions found in Nigeria surely is suited to better the fortunes too of the nation.\nWe are calling and pleading with the successful private sector players to join the 2023 presidential race, they need to stand up and be counted."
  },
  {
    "headline": "One Killed, Three Injured As Police, Suspected Cultists Clash In Ilorin",
    "summarized_story": "One person has been killed and three others injured in a duel between police operatives and gunmen suspected to be cultists in Kwara State.\nOkasanmi added that the police killed one of the suspects and injured two other members of the gang during the clash, but a security operative sustained an injury.\nThereafter, the security operatives were attacked by the accomplices of the suspect who smashed their patrol van.\nHe stressed that there was no confrontation between the police and students in the area, but with suspected cultists.\nBonfire littered the road leading to the school while a few residents watched as the security operatives move around."
  },
  {
    "headline": "Burkina Faso Defeat Tunisia Again As Hero Ouattara Turns Villain",
    "summarized_story": "Dango Ouattara scored on the stroke of half-time as 10-man Burkina Faso completed a hat-trick of Africa Cup of Nations quarter-final victories over Tunisia with a 1-0 win in Garoua on Saturday.\nBurkina Faso held on to repeat 1998 and 2017 last-eight triumphs over Tunisia and advance to a semi-finals showdown with Senegal or Equatorial Guinea in Yaounde on Wednesday.\nAllow me to dedicate this win to our people who are being tested by current events,” said Burkina Faso coach Kamou Malo.\nMore menacingAfter Tunisia dominated the early exchanges, Burkina Faso gradually matched them at the Stade Roumde Adjia in the northwestern city.\nBurkina Faso were looking the more menacing side and Djibril Ouattara should have done better as half-time approached with a close-range shot, which was aimed directly at Ben Said."
  },
  {
    "headline": "2023: Businessman donates campaign billboards, vehicles to support Tinubu -",
    "summarized_story": "The National Leader of the APC and 2023 Presidential aspirant Asiwaju Bola Tinubu has been described as a Leader who can bring the desired development to Nigeria.\nThis was made known at the public unveiling of a billboard and campaign vehicles in Lagos by a businessman who has volunteered to support the ambition of Bola Tinubu."
  },
  {
    "headline": "Kebbi LG Poll: Gov Bagudu canvasses support for APC candidates",
    "summarized_story": "Kebbi state Governor, Atiku Bagudu has assured of a credible election, as the state electoral commission set 5th of February 2022 for the state local government election.\nBagudu gave the assurance in Kamba town, Dendi local government area when he led other APC leaders to canvas support for candidates of the party at the coming local government election.\nAdvertisementThe governor says the APC government has delivered dividends of democracy to the teeming Nigeria populace especially in Kebbi state through the agricultural transformation and other meaningful projects.\nGovernor Bagudu said, the evidence of this is seen in how the people kept fate with the party through massive support that saw all elected political offices in the state entrusted in the hands of the APC.\nHe called on the people of the state to turn out in their numbers and vote massively for the party in the upcoming local government election."
  },
  {
    "headline": "Analysts discuss \"Not Too Young to Run Bill\", youths participation in politics -",
    "summarized_story": "On May the 31st, 2018, President Muhammadu Buhari signed the Not-Too-Young-To-Run bill into law.\nThis was part of efforts to get young Nigerians to be more involved in politics.\nAs Nigerians gear up towards the 2023 Election season, youths are being encouraged to participate more in the process by registering for their permanent voter cards, contesting elective positions, and also going out to cast their ballot.\nAdvertisement"
  },
  {
    "headline": "BREAKING: Biodun Oyebanji wins Ekiti APC governorship ticket -",
    "summarized_story": "A former Secretary to the Ekiti State Government, Biodun Oyebanji, has emerged the candidate of the All Progressives Congress in Ekiti State.\nMr Oyebanji emerged victorious with 101,703 votes, defeating seven other contestants.\nAdvertisementBreakdown of the votes shows that Bamidele Faparusi polled a total of 376 votes, Ojo Kayode had 767 votes, Opeyemi Bamidele, a serving Senator had 760 votes, Dayo Adeyeye, a former lawmaker polled 691 votes, Femi Bamisile polled 400 votes,.\nOthers are Toyin Afolabi who polled 47 votes and Demola Popoola who scored 239 votes.\nAdvertisementEarlier, seven aspirants announced their withdrawal from the contest, citing irregularities as reason for their exit."
  },
  {
    "headline": "Alleged Rape Victim: I’m Not Questioning Their Integrity; I’m Questioning The Process",
    "summarized_story": "Former student who accuses her former school of protecting accused rapists, Obiamaka Azubike, cries out for justice, and demands acknowledgement of wrong from the institution.\nAzubike joins ARISE to tell her side of the story, sharing details of her experience on the day of the alleged assault, her communication with the school and what has been done or not done so far, to bring justice for Obiamaka and all parties involved."
  },
  {
    "headline": "Barty Beats Collins to End 44-Year Wait for Home Australian Open Champion",
    "summarized_story": "Ash Barty recovered from 5-1 down in the second set to win the Australian Open final 6-3, 7-6 (2) over Danielle Collins on Saturday, ending a 44-year drought for Australian women at their home Grand Slam tournament.\nThe top-ranked Barty won the first set with one service break against the 27th-seeded Collins.\nMomentum was with Collins and she twice served for the set, aiming to take her first Grand Slam final to a third set.\nBut Barty launched a comeback, winning five of the next six games and then dominating the tiebreaker.\nBarty was the first Australian woman into the singles final of the Australian Open since Wendy Turnbull in 1980 and is now the first Australian champion since Chris O’Neil in 1978."
  },
  {
    "headline": "UAE Lifts Flight Restriction on Nigeria, 11 Other African Countries",
    "summarized_story": "Restriction on flights arriving from Nigeria and 11 other African nations were lifted on Saturday, the United Arab Emirates (UAE) authorities have said.\nThe authorities said flight arrivals can resume from countries like Botswana, Congo Republic, Eswatini, Ethiopia, Kenya, Lesotho, Mozambique, and Namibia.\nThe UAE had last December issued a travel restriction on passenger flights from Nigeria, Kenya, Tanzania, and Ethiopia.\nPassengers are required to take a PCR test 48 hours before departure, test where possible at the departure airport, test on arrival and adhere to all precautionary measures when visiting the UAE.\nThe Nigerian government and the UAE authorities have been at loggerheads in recent months."
  },
  {
    "headline": "Somina Johnbull: NPTF Court Verdict is a Milestone",
    "summarized_story": "The Federal High Court in Abuja on Wednesday barred the Nigerian government from making further deductions from the Federation Account to fund the Nigeria Police Trust Fund, NPTF, or other agencies of government not listed in the Constitution.\nAccording to Justice Ahmed Mohammed, who delivered the ruling, such deductions were illegal, unlawful and unconstitutional.\nTo discuss the implication of the ruling not just for River State, but the all the states and local government areas of the federation, as well as the Federal Capital Territory, is Somina Johnbull, a lawyer who is conversant with the suit."
  },
  {
    "headline": "US East Coast Prepares for Heavy Snow, Plunging Temperatures as Blizzard Hits",
    "summarized_story": "Forecasts of a potentially brutal storm, which moved up the East Coast after forming in the Atlantic Ocean off the Carolinas, had prompted airlines to cancel 5,000 flights through the weekend and delay more than 8,000.\nThe governors of Maryland, Massachusetts, New Jersey, New York all declared states of emergency, warned of likely power outages and urged residents to stay off the roads on Saturday.\n“This is going to be a very big storm, probably one of the biggest we’ve experienced in the last few years.\nThe National Weather Service issued flood warnings for coastal areas and Amtrak canceled passenger rail service across much of the region.\n‘WHITEOUT CONDITIONS’"
  }
]