[
  {
    "headline": "ICPC raids military contractor’s Abuja home, recovers $220,965, cars, others",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission has raided the Abuja home of a military contractor and seized N175,706,500; $220,965; G-Wagon; 2022 editions of BMW and Mercedes Benz cars.\nOperatives also recovered customised mobile phones; several designer wrist watches, including three Rolexes, and some property documents.\nICPC arrested the Managing Director of K Salam Construction Company Nigeria Limited, Mr. Kabiru Sallau, said to be the owner of the property.\nFacts available for the time being indicate that the property is owned by the owner of K Salam Construction Company, a military contractor.\n“The Commission arrested the Managing Director of K Salam Construction Company Nigeria Limited, Mr. Kabiru Sallau, and the investigation is ongoing."
  },
  {
    "headline": "Adoption of UTAS critical to resolving strike— ASUU",
    "summarized_story": "By Emem Idio, YenagoaYENAGOA-THE Academic Staff Union of Universities, ASUU, has stated that the adoption of a transparent payment platform University Transparency and Accountability Solutions,UTAS, is critical to resolving the current strike action by the Union.\nHe said: “We definitely can’t continue this way, the adoption of a transparent payment platform is critical to resolving the current impasse in the nation’s university system.\nUTAS has been proven to be a flawless payment platform but the deep-rooted penchant for corruption in our government ethos is all out to frustrate its deployment.\nWhy would the government not be interested in a payment platform that is cheap, 100% corruption proof, and 100% indigenous?\nHow could such huge sums disappear under any serious payment platform?"
  },
  {
    "headline": "Sightsavers hails FG’s promise to end scourge of ‘Neglected Tropical Diseases’",
    "summarized_story": "By Gabriel Ewepu – AbujaAn international development organisation, Sightsavers, Friday, hailed Federal Government over promise to end the scourge of Neglected Tropical Diseases, NTDs, in Nigeria.\nWhile commending Federal Government’s expressed commitment to stop morality rate occasioned by NTDs, the Country Director, Sightsavers Nigeria, Dr Sunday Isiyaku, noted that Nigeria faces one of the biggest burdens from neglected tropical diseases across Africa.\nAt the Kigali Summit on Malaria and Neglected Tropical Diseases, on 23 June, and during the signing of the Kigali Declaration on neglected tropical diseases earlier this year, the government pledged to: Increase funding and resources across the country to support the elimination of NTDs.\nOur country faces one of the biggest burdens from neglected tropical diseases across Africa and we need strong leadership to banish them.\n“Nigeria has made great strides in the fight against these diseases – with support from Sightsavers and partners."
  },
  {
    "headline": "Adamawa govt explains delay in payment of June Salary",
    "summarized_story": "FintiriGovernor Ahmadu Fintiri of Adamawa has asked for understanding of the citizens over delay in payment of June salary.\nMr Humwashi Wonosikou, Press Secretary to the governor, stated this in a statement, on Saturday in Yola.\nHe said the Fintiri administration was in keeping with its tradition of prompt payment of salaries on 23rd or 24th day of every month, adding that the government would not renege.\n“Because of the upcoming Sallah celebration, expected on July 10, salary will be paid at the end of the month just in time for the Sallah festivities.\n“This is to ensure the people celebrate comfortably as Sallah is around the corner, I assure that salaries would be paid by the end of this month,” he saidHe appreciated Civil Servants for their patience and understanding, as the delay is to enable them to celebrate Sallah without challenge."
  },
  {
    "headline": "Tales of the Single Nigerian Woman",
    "summarized_story": "Uzor Maxim UzoatuNigeria is still very much a conservative country in which marriage is seen as the completion of a man or a woman.\nGiven the menace of the ever-ticking biological clockk the single Nigerian woman lives on edge every day.\nRight in heaven; all marriage is how-for-do; all men are the same…”There is this insightful little book, Tales of the Single Woman by Chioma Obiefuna, which bears the insightful subtitle “A humorous encounter with The Single Nigerian Woman”.\nThe author adroitly uses the stories of the single women to paint a contemporary picture of the sundry stereotypes and ill-assorted perceptions towards the mature single women in the conservative society such as Nigeria is.\nShe delineates the types of single ladies thusly: “Sad Single (SS)”, “Nonchalance Feigners (NF)”, and “High Headed Singles HHS”."
  },
  {
    "headline": "Police honour Constable for returning missing dollars to owner",
    "summarized_story": "The Police Command in Katsina State on Friday honoured a Constable, Nura Mande, who found and returned missing 800 dollars to its owner in Katsina.\nHe recalled that Mande was on official duty at the state Pilgrims Welfare Board Hajj camp when he found the 800 dollars belonging to a female intending pilgrim, Hajiya Hadiza Usman.\n“While discharging his duty at the Hajj camp, PC Mande found the 800 dollars on the ground and returned it to the board’s Director of Administration, Alhaji Sada Salisu-Rumah.\n“Salisu-Rumah commended the police constable for his good behaviour and honesty,” he added.\nHe assured that the command would continue to appreciate its operatives who displayed honesty and commitment to their duties."
  },
  {
    "headline": "National Assembly applauds Abia lawmakers on speedy passage of 5th Alteration of 1999 Constitution",
    "summarized_story": "The 9th Senate and House of Representatives Special Ad-hoc Committees on the review of the 1999 constitution of the Federal Republic of Nigeria, has reacted to the passage of the fifth alteration of the 1999 constitution Amendment bill into law by the Abia State House of Assembly.\nReacting, the 9th leadership of the National Assembly, commended the Speaker of the Abia State House of Assembly, Chinedum Orji and entire members of the legislative house on the successful consideration and approval of the constitutional amendment bills.\nThe commendation came through the Special Ad-hoc Committees of the National Assembly on the review of the 1999 constitution of the Federal Republic of Nigeria, in a press release made available to newsmen on Saturday, in Umuahia, the Abia state capital.\nAccording to the release, “the committees, in processing the bills took cognizance of the provisions of section 8 and 9 of the constitution which makes State Houses of Assembly, critical partners with the National Assembly.\nThey must synergize to deliver on the promises made to Nigerians during the National Public Hearing, and this has been demonstrated by the Abia State House of Assembly by the approval of the bills."
  },
  {
    "headline": "Lagos ranked second-worst liveable city on earth",
    "summarized_story": "A global business intelligence, Economist Intelligence Unit, EIU has ranked Nigeria’s commercial capital city, Lagos the world’s second-worst liveable city.\nEIU according to its recent publication, ranked Lagos 171 out of 172 countries in the list of its global liveable cities in the world.\nThe latest 2022 Global Liveability Index published by the EIU revealed that Vienna regained its customary position as the number one.\n“The EIU further highlighted the top five most liveable cities in the world as Vienna, with Austria, scoring 99.\nLagos State remains the most populated city in the country with at least 14 million people."
  },
  {
    "headline": "2023: Get educated, fight for your rights – Jigawa Monarch challenges women",
    "summarized_story": "The Emir of Dutse, Jigawa State, His Highness Dr. Nuhu Muhammad Sanusi has called on Nigerian women to pursue education to fight for their rights in Governance and other areas.\nThe Emir who was represented by the senior counsellor of the emirate, Basiru Nuhu Sanusi (Galadiman Dutse) made the call when he received the Jigawa Education Partners in his palace.\nThe Emir stated this while reacting to the condition of girl child education in Jigawa State, especially in rural areas.\nHe explained that girls’ education is crucial to the development of any given society and the whole Nation.\nEarlier the team leader of Education Partners, Tasiu Abubakar said they were in the palace as part of their state-wide consultation and assessment for promoting girls’ education in the state."
  },
  {
    "headline": "Presidency: Tinubu, Kwankwaso, Peter Obi no threat to Atiku – Dino Melaye",
    "summarized_story": "Melaye said Bola Tinubu, Peter Obi, and Rabiu Kwankwaso do not enjoy national acceptability like Atiku.\nIn a Facebook post, the former lawmaker recounted how President Muhammadu Buhari defeated Atiku with less than three million votes in 2019.\nAtiku won 17states + FCT, and Buhari won 19 states.\nAtiku scored over 11 million votes and had 25% across 2/3 of all the states in Nigeria.\n“None of Tinubu, Peter Obi, Kwankwaso and co can ever enjoy national acceptability like Buhari."
  },
  {
    "headline": "Reveal the truth about military contractor’s arrest, home raid – CACOL to ICPC",
    "summarized_story": "The Centre for Anti-Corruption and Open Leadership (CACOL) has reacted to the raid of an Abuja property belonging to a military contractor.\nIn a statement, CACOL’s Director of Administration and Programmes, Tola Oresanwo told the ICPC that the matter is of public interest.\nNoting that the commission has confirmed that an investigation is still ongoing, he said citizens deserved to know the truth.\nThe statement stressed that it is the moral duty of all Nigerians to be well informed and acquainted with corruption cases.\nThe ICPC raid uncovered N175,706,500, $220,965, 2022 editions of BMW and Mercedes Benz vehicles, customized mobile phones, designer wristwatches, and property documents, among others."
  },
  {
    "headline": "BREAKING: Late gospel singer Osinachi's body arrive for burial The Nation Newspaper",
    "summarized_story": "About two months after her demise, the remains of late gospel singer, Osinachi Nwachukwu have arrived for interment in Abia State.\nThe singer’s body was received in her home town in Amakpoke Umuaku community, Abia around 12:00pm.\nThe Nation reports Osinachi, who sang the popular song ‘Ekwueme’ died on April 8, 2022.\nRead Also:Prior to the final internment on Saturday, a night of worship was held in Abuja on Thursday, June 23 while a Night of Prayer was also held in Isochi, Umunoci in Abia state yesterday, June 24.\nHer family members accused the late singer’s husband Peter Nwachukwu of domestic violence, leading to her death."
  },
  {
    "headline": "Terrorists kill three vigilantes, injure many in Niger community The Nation Newspaper",
    "summarized_story": "Terrorists have killed the Commander of the vigilantes in Kpada community in Lapai local government area of Niger state, Danladi Dobbo and two members of the outfit.\nThey were killed in an attack on the community on Friday afternoon, which left several others injured.\nApart from the three Vigilantes confirmed dead, there were indications others have been killed in the bush with their bodies yet to be evacuated.\nNiger Police Public Relations Officer (PPRP) DSP Wasiu Abiodun could not be reached at the time of filing the report.\nNiger Commissioner for Internal Security, Emmanuel Umar confirmed the attack but urged the community not to go after the bandits in the forest."
  },
  {
    "headline": "Buhari felicitates with Sanwo-Olu at 57 The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari has felicitated with Lagos Governor Babajide Sanwo-Olu on his 57th birthday.\nIn a statement by his Special Adviser on Media and Publicity, Femi Adesina, Buhari lauded Sanwo-Olu’s impacts on the infrastructural, security and business outlooks of Lagos.\n“President Muhammadu Buhari sends warm greetings to Lagos State Governor, Babajide Sanwo-Olu, on his 57th birthday, June 25, 2022, rejoicing with the political leader on remarkable strides of service in the private and public sector.\n“The President notes the visionary leadership of the governor in Lagos State, with impact on infrastructure, security, business outlook and public service, creating opportunities for Nigerians and foreign investors to benefit from the economic vibrancy of the state.\n“President Buhari prays that the Almighty God will keep and prosper the Governor of Lagos State and his family,” the statement reads."
  },
  {
    "headline": "How we escaped death in Kaduna tea shop explosion, by survivors The Nation Newspaper",
    "summarized_story": "Idris’ tea shop is located in the very busy part of the community.\nMai Shayi, as Idris is popularly called, brought his gas cylinder to his stall.\nIdris said he had been using gas to fry eggs and cook noodles in his tea shop for long, but he had never experienced such an incident.\nAccording to the village head, “outside the tea shop, there were children selling food, some were frying soya beans cake.\n“So, when the gas cylinder exploded, the fire caught up with many of them and other people outside, including people in other shops and passersby."
  },
  {
    "headline": "British varsity bans Ekweremadu over ‘organ harvesting’ allegation The Nation Newspaper",
    "summarized_story": "The University of Lincoln, United Kingdom, has banned Senator Ike Ekweremadu who it recently appointed a visiting professor of Corporate and International Linkages.\nDavid, according to the prosecution, was trafficked from Nigeria and entered the UK with the passport of a 41-year-old man.\nThe London Mail yesterday quoted the university’s spokesperson as saying that Ekweremadu’s duties at the institution have been suspended for the time being.\n“Visiting professors are often, as is in this case, non-resident at the university, unpaid and advisory,” the university’s spokesperson said.\n“The consultant was concerned about his actual age and was concerned he was not aware he was the donor of the kidney."
  },
  {
    "headline": "Again, gunmen kill two policemen, three others in Benue",
    "summarized_story": "From Rose Ejembi, MakurdiAt least five persons, including two policemen, were feared killed by armed bandits in two communities of Guma and Ukum Local Government Areas of Benue State on Thursday night.\nIt was gathered from local sources that some gunmen suspected to be herdsmen attacked Yelwata community of Guma LGA, killed two policemen and took away their guns on Thursday night.\nEyewitnesses said the attackers, two young men and a lady, rode on a Bajaj Motorcycle to the area.\nOne of them allegedly pointed the gun at their targets, shot and killed them after which he jumped back on the motorcycle and they rode away unchallenged.\nWhen contacted, Police Public Relations Officer (PPRO) Catherine Anene, a Superintendent of Police, confirmed the killing of the policemen in Yelwata community of Guma but said she was yet to receive information about the Ukum killing."
  },
  {
    "headline": "Not all actresses are wayward –Chioma Nwaoha – The Sun Nigeria",
    "summarized_story": "Fast rising Nollywood star, Chioma Nwaoha, has debunked the notion that actresses cannot make good wives.\nShe said: “I keep hearing that actresses are wayward but I don’t believe that, because we all are not the same.\nFor a God-sent husband, I can give up my career and face our home.”Before joining Nollywood, Chioma Nwaoha had looked forward to working with some of the big names in the industry.\nI look forward to working with Genevieve and Nancy Isime in future,” she disclosed.\nDespite her ravishing beauty, the thespian avowed that her star power is in her personality not physical look."
  },
  {
    "headline": "Ekweremadu: NIN, passport open new twist",
    "summarized_story": "From Fred Itua, AbujaA new twist has opened in the ongoing trial of Senator Ike Ekweremadu and his wife, Beatrice, over alleged child organ harvesting.\nOn Thursday, the London Metropolitan Police charged Ekweremadu and his wife to court over allegation of bringing a minor to the UK for organ harvesting.\nHowever, fresh facts have revealed that contrary to claims that the boy, David Ukpo, is 15 years old, he is actually 21.\nAlso, information on the passport data page of Ukpo, showed he was born on October 12, 2000.\nThe date of issuance of the passport was listed as November 4, 2021, which is a few weeks before Senator Ekweremadu wrote to the UK High Commission in respect of the medical visa application."
  },
  {
    "headline": "Confusion trails INEC’s cleared NASS candidates",
    "summarized_story": "From Romanus Ugwu, AbujaThe fate of certain National Assembly candidates for the 2023 general elections seems to be hanging in the balance following the confusion trailing those cleared by the Independent National Electoral Commission (INEC).\nConflicting reports emanating from the constituencies across the country indicate that the commission dropped the names of certain candidates cleared by the political parties.\nOkoye however clarified that the commission has not published the final list of validly nominated candidates, emphasising: “the final list of validly nominated candidates will be published by INEC on September 20, 2022.\nAnd that is for presidential and National Assembly candidates.\nAnd we published the personal particulars of candidates that emerged from valid party primaries."
  },
  {
    "headline": "Okotie: Nigeria’ll break up if i don’t succeed Buhari",
    "summarized_story": "You don’t need political party system for democracy, what you need is ascent.\nSo, we don’t need political parties.\nAs we don’t need political parties, we don’t also need ministers or commissioners because the civil service structure has been running for ages.\nThey may have such intentions, but the concept of the political system that we are operating is faulty ab initio.\nFor instance, if we don’t have political parties and we don’t have ministers, you don’t have commissioners, what offices will they be running for?"
  },
  {
    "headline": "Pentecostal Fellowship of Nigeria Inaugurates New Exco – THISDAYLIVE",
    "summarized_story": "The youth wing of Pentecostal Fellowship of Nigeria (PFN) Eti Osa Province in Lagos State has inaugurated a new body of executive members.\nThe event, which was largely attended by both members and friends of the province, was held at Miracle Breed Church.\nOn his part, the newly elected Province Youth Director, Joel Obikoru, said that the new executive members would use the platform to provide opportunities for Nigerian youths in realising their dreams of singing and acting.\nHe also urged Nigerian youths to get their Permanent Voters Cards (PVCs) to enable them vote for a credible candidate come 2023.\nMany Nigerian youths are swayed into making money rather than preparing for their task as future leaders.”Highlights of the event were a song presentation by Nigerian gospel artiste, Queen Esther also known as Cheena."
  },
  {
    "headline": "Firm Partners Nigerian Conservation Foundation on Tree Planting Exercise – THISDAYLIVE",
    "summarized_story": "Mary NnahTo help protect and restore nature and biodiversity, Pernod Ricard Nigeria, the local affiliate of Pernod Ricard, a global leader in wines and spirits, in line with its commitment to nurturing terroirs is observing the 10th edition of Responsib’All Day.\nThis year’s theme is being implemented with the Nigerian Conservation Foundation (NCF), the premier NGO dedicated to nature conservation and sustainable development in Nigeria.\nThe Nigerian Conservation Foundation is driven by the vision of a Nigeria where people prosper and live in harmony with nature.\nFor Responsib’All Day, provided expertise in choosing the various seedlings needed at the various locations; and will be accountable for monitoring the maintenance of the trees.\n“Conservation projects that help to sustain our communities like that of the Responsib’All Day, is essential for societal progress”, said Uchenna Achunine, Director, and Business Development & Communications at the Nigerian Conservation Foundation."
  },
  {
    "headline": "Onyema Honours Nigeria’s Sports Heroes, to Build Wall of Fame – THISDAYLIVE",
    "summarized_story": "The Chairman and Chief Executive Officer of Air Peace, Allen Onyema, has pledged to build a Wall of Fame for Nigeria’s distinguished sports icons whose strides played a tremendous role in unifying the country, projecting her in a favourable light and representing the entire black race positively.\nOnyema was honoured for his humanitarian act of rescuing Nigerians in South Africa amidst xenophobic attacks and his immense contributions to the Nigerian economy through job creation.\n“For the 1980 National Football team referred to above, Air Peace shall sponsor an event where they would be celebrated and honoured.\nThe surviving members of that team are hereby made Special Ambassadors of Air Peace and are entitled, for the rest of their lives, to fly Air Peace free of charge, six times in every year on the domestic destinations and once a year to any foreign destination serviced by Air Peace.\nIn September 2021, Air Peace penned a sponsorship deal with the Nigerian Football Federation, NFF, for the National Teams, as their official carrier."
  },
  {
    "headline": "Ikeja Electric Boss Tasks Engineers on Power Challenges in Nigeria – THISDAYLIVE",
    "summarized_story": "Funmi OgundareChairman, Board of Directors, Ikeja Electric PLC, Mr. Kola Adesina, yesterday, called on engineers in the country to activate their intellect to produce the change in the power sector that Nigerians desire to see.\nAccording to him, “why are we not generating gas regularly?\nWhy are the distribution companies not receiving enough power?\nWe are making so much money in oil and gas, but actually not in power.\n“There is no concrete agreement between the sector which NEC is trying to make possible by signing an agreement."
  },
  {
    "headline": "INEC: Voter Registration May Be Extended By At Least More 30 Days – THISDAYLIVE",
    "summarized_story": "Chuks Okocha in AbujaThe Independent National Electoral Commission (INEC) yesterday assured that the ongoing voter registration exercise may be extended to at least an additional 30 days.\n“This voters’ registration started eleven months ago.\nWe started this process on June 28 2021 for online and on July 7 2021, we started the physical registration exercise.\n“We are going to make sure that the exercise is extended to at least the next 30 days.\nINEC programmed that the voter registration will end on June 30."
  },
  {
    "headline": "Nigerian Anti-corruption Agency, ICPC Confirms Arrest Of Military Contractor ‘Fronting For Former Chief Of Army Staff, Buratai’",
    "summarized_story": "His revelation came a few months after President Buhari replaced Buratai and other service chiefs.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nAccording to Monguno, neither the money nor the arms were on the ground upon the resumption of the new service chiefs.\nSaharareporters investigations showed that it belonged to a Nigerian Army Major, Emmanuel G. Adegbola of the Nigerian Army Finance Corps (N/10808).\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "Nigerian Anti-corruption Agency, ICPC Confirms Arrest Of Military Contractor ‘Fronting For Former Chief Of Army Staff, Buratai’",
    "summarized_story": "His revelation came a few months after President Buhari replaced Buratai and other service chiefs.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nAccording to Monguno, neither the money nor the arms were on the ground upon the resumption of the new service chiefs.\nSaharareporters investigations showed that it belonged to a Nigerian Army Major, Emmanuel G. Adegbola of the Nigerian Army Finance Corps (N/10808).\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "Nigerian Anti-corruption Agency, ICPC Confirms Arrest Of Military Contractor ‘Fronting For Former Chief Of Army Staff, Buratai’",
    "summarized_story": "His revelation came a few months after President Buhari replaced Buratai and other service chiefs.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nAccording to Monguno, neither the money nor the arms were on the ground upon the resumption of the new service chiefs.\nSaharareporters investigations showed that it belonged to a Nigerian Army Major, Emmanuel G. Adegbola of the Nigerian Army Finance Corps (N/10808).\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "EXCLUSIVE: Anti-graft Agency, ICPC Uncovers Billions In Cash Meant For Arms, Ammunition To Fight Boko Haram In Abuja Home Of Ex-Chief Of Army Staff, Buratai",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) has recovered N1.85 billion from a house and office said to belong to former Chief of Army Staff, Tukur Buratai in Abuja, multiple sources told SaharaReporters.\nThe Chief of Army Staff (COAS), Lt General Yusuf Tukur Buratai.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nSaharareporters investigations showed that it belonged to a Nigerian Army Major, Emmanuel G. Adegbola of the Nigerian Army Finance Corps (N/10808).\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "EXCLUSIVE: Anti-graft Agency, ICPC Uncovers Billions In Cash Meant For Arms, Ammunition To Fight Boko Haram In Abuja Home Of Ex-Chief Of Army Staff, Buratai",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) has recovered N1.85 billion from a house and office said to belong to former Chief of Army Staff, Tukur Buratai in Abuja, multiple sources told SaharaReporters.\nThe Chief of Army Staff (COAS), Lt General Yusuf Tukur Buratai.\nOthers were former Chief of Defence Staff, Gabriel Olonishakin; Chief of Air Staff, Abubakar Sadique and Chief of Naval Staff, Ibok Ibas.\nSaharareporters investigations showed that it belonged to a Nigerian Army Major, Emmanuel G. Adegbola of the Nigerian Army Finance Corps (N/10808).\nOn August 17, 2015, the Chief of Army Staff paid the sum of N3,270,000 into the account."
  },
  {
    "headline": "Bakers threaten strike over rising cost of flour, sugar",
    "summarized_story": "The association said this on Friday in a communiqué issued after a meeting of its national executive council in Abuja.\nIn the communiqué, signed by the association’s executives, led by Mansur Umar, its national president, the bakers said they would commence an initial two-week strike from July 13, 2022.\nThey said the cost of flour, sugar and other materials used in the bakery business had soared beyond the reach of many bakers.\n“Increase in prices of bakery materials, especially flour and sugar having reached unprecedented levels, for example, flour is now between N25,000 and N27,500, so also other ingredients,” it reads.\nNAFDAC, SON, and NESREA have turned the bakers into money-making machines by charging our members outrageous levies even at this very challenging moment."
  },
  {
    "headline": "Bakers threaten strike over rising cost of flour, sugar",
    "summarized_story": "The association said this on Friday in a communiqué issued after a meeting of its national executive council in Abuja.\nIn the communiqué, signed by the association’s executives, led by Mansur Umar, its national president, the bakers said they would commence an initial two-week strike from July 13, 2022.\nThey said the cost of flour, sugar and other materials used in the bakery business had soared beyond the reach of many bakers.\n“Increase in prices of bakery materials, especially flour and sugar having reached unprecedented levels, for example, flour is now between N25,000 and N27,500, so also other ingredients,” it reads.\nNAFDAC, SON, and NESREA have turned the bakers into money-making machines by charging our members outrageous levies even at this very challenging moment."
  },
  {
    "headline": "Our Two Kobo podcast: Lagos happened to me",
    "summarized_story": "This episode is about Lagos, the centre of excellence, and how Lagosians learn street smartness from sour experiences.\nIt is the centre of opportunities and possibilities, and indeed, anything and everything is possible in Lagos.\nJam Jam recounts how she resorted to “fronting” her backpack after her phone was stolen while The Honourable narrates how he was once swindled at Lagos Island.\nAdvertisementClick HERE to listen on Google Podcast and Anchor FM.\nSend us your recommendations, complaints, and suggestions at [email protected]gmail.comAdvertisementAlso, share your #LagosHappenedToMe experiences with us."
  },
  {
    "headline": "Our Two Kobo podcast: Lagos happened to me",
    "summarized_story": "This episode is about Lagos, the centre of excellence, and how Lagosians learn street smartness from sour experiences.\nIt is the centre of opportunities and possibilities, and indeed, anything and everything is possible in Lagos.\nJam Jam recounts how she resorted to “fronting” her backpack after her phone was stolen while The Honourable narrates how he was once swindled at Lagos Island.\nAdvertisementClick HERE to listen on Google Podcast and Anchor FM.\nSend us your recommendations, complaints, and suggestions at [email protected]gmail.comAdvertisementAlso, share your #LagosHappenedToMe experiences with us."
  },
  {
    "headline": "EXCLUSIVE: Petrol subsidy payments gulped N1.27trn in five months",
    "summarized_story": "The oil firm said it deducted another N327.07 billion as a shortfall for the importation of petrol (subsidy) in May 2022.\nAdvertisementWith the current deductions, NNPC has expended N1.27 trillion on petrol subsidy in the last five months — about 31 percent of the N4 trillion provision for the year.\nIn April, Nigeria spent N271 billion to cater for petrol subsidy.\nInternational Monetary Fund and the World Bank have asked the federal government to retrace its steps on petrol subsidy spending.\nThe institutions have repeatedly said the petrol subsidy policy in Nigeria is not targeted at those most in need."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Kune, the controversial Kenyan foodtech startup, has shut down",
    "summarized_story": "Kune, a Kenyan food tech startup that delivered ready-to-eat meals at affordable prices, is closing down today, the company’s founder and CEO Robin Reecht announced.\nThe announcement comes just 4 months after the startup began its commercial operations at established meal centers around Nairobi.\nAround that time, Kune leadership also declared its intentions to raise $3.5 million in its second round of funding.\nBut while Kune was well-liked by its customers, the startup’s journey wasn’t without its fair share of controversy.\nAddressing Kune’s investors, he said, “Not only did you invest in Kune but you gave us your time, brain-width, connections, and emotional support."
  },
  {
    "headline": "These founders are helping companies make decisions with data",
    "summarized_story": "It wasn’t their first time venturing into business together; only the previous year they’d tried building an aggregator to curate data from various African countries which multinational companies could use.\nRutakangwa understands why these costly business errors occur: the data the multinational companies rely on—often collected by market research firms—is assumed African countries to be monolithic and did not provide companies with enough detail with which to make market expansion decisions.\nSo, Rutakangwa and Sewankambo employed regular local consumers, called “mappers”, to collect the data from shops and households.\nWhen a mapper submits the data, Rwazi verifies the information by checking that the shop or household’s geocoordinates matches the mapper’s current location.\nBut Rutakangwa saw things differently: in principle, mapping data for hospitals and pharmacies was the same as mapping for beverage and liquor companies."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Restoring voter enthusiasm in Nigeria’s electoral process",
    "summarized_story": "Read also: 2023: INEC disproves claim of voter registration centres in Niger RepublicSecondly, becoming a voter is a long, bothersome, inconvenient process for young people.\nWhile voter registration drives have been necessary and impactful in the past, voter turnout is the real problem with electoral participation in the country.\nLow voter participation indicates that the political system lacks legitimacy, presenting challenges to social cohesion.\nAddressing these barriers to increased voter participation will move the country in the right direction on its democratic journey.\nRemi Ogunkayo is political director at Run To Win, a non-partisan organisation which aims to increase the participation of young people in every aspect of Nigeria’s political process"
  },
  {
    "headline": "CBN keeps printing cash to finance deficit, says EIU",
    "summarized_story": "The Central Bank of Nigeria has continued to print money to finance the federal government’s budget deficit, a development that may undermine its ability to tame inflation, the Economist Intelligence Unit (EIU) has said.\nThe EIU noted that the CBN tightened monetary policy with a 150-basis-point hike in the policy rate in May 2022 as inflation stayed on an upward trajectory.\nThe CBN has repeatedly stepped in directly as a lender.”Read also: CBN faults misleading report on payment of overseas tuitionAccording to the EIU, it seems highly plausible that the CBN will continue financing a widening budget deficit through the overdraft facility.\nThe subsidy bill comes directly out of government revenue so money printed by the CBN would mostly be for other government purchases.\n“The EIU does not expect inflation to return to the 9 percent inflation target ceiling in 2022‑26, partly because of policy inconsistencies,” it said."
  },
  {
    "headline": "Inside the $1.7 billion global organ trafficking industry",
    "summarized_story": "Organ trafficking sometimes known as transplant tourism describes the commercialism that drives the illegal organ trade.\nGlobal Financial Integrity (GFI) estimates that 10 percent of all organ transplants including lungs, heart and liver, are done via trafficked organs.\nFrom the year 2015 to 2020, a total of 651 kidneys were transplanted illegally from the country, Global Database on Donation and Transplantation reported.\nIt is estimated that the illegal organ trade conservatively generates approximately $840 million to $1.7 billion annually, according to GFI.\nIn 2020, the Global Database on Donation and Transplantation said 129,681 organs were transplanted annually."
  },
  {
    "headline": "Edo govt trains herbal healers on good hygiene – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has assured members of the Association of Lunatic Healers, of the government’s support in the discharge of their services in the state.\nWhile commending the herbal healers for their passion for the treatment and rehabilitation of persons living with mental illness, he noted that the government will continue to support them to improve their skills.\nOkeguale said the state government is committed to enhancing the capacity of herbal practitioners, urging them to adhere to proper personal hygiene and clean working environment.\nChairman, Association of Lunatic Healers, Edo State, Dr. Samuel Kayode Oghaimeh, expressed appreciation to the state government for the training, which he said, has enriched the members with new knowledge on how to improve their practice.\nFacilitators at the training are the Head of Social Welfare Unit, Federal Neuro-Psychiatric Hospital, Uselu, Agho Ifueko Taiwo, and a Social Welfare Officer with the Federal Neuro-Psychiatric Hospital, Mrs. Felicia Igbinovia."
  },
  {
    "headline": "Edo recommits to use of tech to enhance productivity, as 94 MDAs link to e-governance system – Nigerian Observer",
    "summarized_story": "Edo recommits to use of tech to enhance productivity, as 94 MDAs link to e-governance systemShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has pledged to sustain ongoing reforms in the state’s civil and public service to engender responsive and technology-driven service delivery, leveraging the immense potential of technology to increase the productivity of the state’s workforce.\nThe Edo State Head of Service, Anthony Okungbowa Esq, gave the assurance during a monitoring and evaluation exercise for 94 Ministries, Departments and Agencies (MDAs) across the state.\nHe noted that the government is transforming the state’s civil and public service, ensuring that every worker is adequately equipped with the needed skills and tools to guarantee efficient service delivery to Edo people.\nOkungbowa said the state is leveraging technology and operating an e-governance system to enhance transparency in government, eliminate corruption and promote efficiency, adding, “This is a part of the instruments put in place by the Governor Godwin Obaseki-led administration to ensure effective and efficient service delivery to the people.”The HOS explained that the e-governance system will enhance modern work ethics introduced in the service by the government, noting that “since the onboarding of the e-governance system in April, 2022, the government has put measures in place to ensure strict compliance in its implementation.”He further disclosed that the government has onboarded over 123 workers as Edo e-governance champions that serve as change agents in driving the implementation of the technology-driven system across the various MDAs in the state.\nOkungbowa explained that “the modules involved in the Edo-governance system include memo management, mail management, leave application, training, and general request, among others embedded on the platform to make work easy and balanced.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Keke Rider Kills Refrigerator Repairer In Warri – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – Tragedy struck in the heart of Warri, Warri South Local Government Area of Delta State when a commercial tricycle (keke) rider killed a refrigerator repairer .\nThe midday tragic incident started when the keke rider, while reversing his tricycle, hit a corn vendor at Okandeji Street by Ginuwa Junction in Otovwodo, Agbassa Community Warri, on Thursday, June 16, 2022.\nAccording to a witness the matter which started as a hot exchange of insults, soon degenerated into a brawl between the keke rider and the refrigerator repairer who was about to patronize the corn vendor when the accident occurred.\nThe altercation, which later resulted in fisticuffs between both men, saw the keke rider hitting the head of the repairer with a club which left him unconscious.\nIt was learnt that when the refrigerator repairer eventually died, the authorities of the said clinic had to trick the keke rider (in connivance with some community leaders) to come over to provide more funds for the treatment of the victim."
  },
  {
    "headline": "Obaseki proceeds on annual vacation, transfers powers to Deputy, Shaibu – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… writes State AssemblyBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has proceeded on his annual leave and has transferred powers to his Deputy, Rt.\nComrade Philip Shaibu, to act in his stead while he is away.\nIn a statement, Special Adviser to the Governor on Media Projects, Crusoe Osagie, said the governor has written to the Edo State Assembly, to intimate the House of the development.\nHe said: “The governor has proceeded on his annual leave and has transferred power to his deputy, Rt.\nComrade Philip Shaibu."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "INEC excludes Lawan, Akpabio, Umahi from APC senatorial candidates’ list",
    "summarized_story": "The Independent National Electoral Commission (INEC), has excluded Ahmad Lawan, senate president; David Umahi, Ebonyi State governor and Godswill Akpabio, former governor of Akwa Ibom State from the list of All Progressives Congress (APC) senatorial candidates.\nThe trio had been listed by the APC as candidates for Yobe North, Ebonyi South and Akwa Ibom North-west senatorial districts, respectively.\nHowever, in the list published by the commission on Friday, Lawan, Umahi and Akpabio were said to have been excluded.\nThe development comes on the heels of controversy over the APC Yobe north senatorial ticket, as well as issues over senatorial primaries featuring Akpabio and Umahi.\nAlthough APC had fixed its senatorial primaries for May, Umahi, Lawan and Akpabio were said to have participated in primaries organised by the APC after the trio contested the APC presidential ticket and lost earlier in June."
  },
  {
    "headline": "FG says it shared $322.5m Abacha loot to 1.9m Nigerians in 4 years",
    "summarized_story": "Nigeria’s federal government, through African Network for Economic and Environment Justice (ANEEJ), on Thursday, said that the $322.5million recovered Abacha loot, has been shared to 1.9million poor and vulnerable Nigerians.\nThe said funds were stolen by former Military Head of State, Gen Sani Abacha and were recovered between 2018 and 2022.\nBefore making the disbursement, the money accrued an interest of $11 million where it was deposited.\n“the Abacha loot that was recovered have been exhausted, we have a responsibility to inform Nigerians and then to make sure to tell them what the money was used for.\nIn 2018, ANEEJ commenced the monitoring exercise under the Monitoring of Recovered Assets in Nigeria through the Transparency and Accountability (MANTRA) project."
  },
  {
    "headline": "Kigali: World leaders pledge over $4bn to end malaria in Africa by 2030",
    "summarized_story": "World leaders leaders have made the first in a series of pledges to accelerate progress to end malaria and neglected tropical diseases (NTDs).\nThe commitments, which raised over $4 billion, were made on Friday at the Kigali summit on malaria and NTDs alongside the Commonwealth Heads of Government Summit, Rwanda.\nThe commitments were made by governments, international organisations, and private sector support with the objective to end malaria by 2030.\nThe summit was attended by world leaders including Tedros Ghebreyesus, director-general of the World Health Organisation (WHO); the prince of Wales; Melinda Gates, co-chair, Bill and Melinda Gates Foundation, and Osagie Ehanire, Nigeria’s minister of health.\n“Ensuring that all African countries mobilise the domestic financial resources required for quality healthcare, is a priority for the African Union, and our partners,” he said."
  },
  {
    "headline": "Fani-Kayode celebrates ‘return’ of ex-wife, Precious Chikwendu",
    "summarized_story": "Femi Fani-Kayode, former aviation minister, has celebrated the ‘return’ of his ex-wife, Precious Chikwendu, describing the moment as truly surreal.\nThe All Progressives Congress chieftain further said, “It was joy all around to see the return of this great lioness.\n“Mama Aragorn displayed such courage, grace, dignity, and class.\n“This was a moment when love, mutual respect, truth, and mutual forgiveness triumphed and Satan was put to shame.\n“Thanks for coming, Mama Aragorn."
  },
  {
    "headline": "2023: Kwankwaso, Fayose meet Wike in Port Harcourt",
    "summarized_story": "Rabiu Musa Kwankwaso, presidential candidate of the New Nigeria Peoples Party (NNPP), on Friday, held closed door meeting with Nyesom Wike, governor of Rivers State as he continues to search for a running mate and support ahead of 2023.\nThe former Kano governor who led a delegation of his party leaders and friends, including Ayo Fayose, former Ekiti State governor, held discussions with Wike behind closed doors.\nIt was, however learnt that Kwankwaso in the meeting, which held on Friday at the Governor’s Port Harcourt country home, sought Wike’s support for his presidential ambition.\nOther political players such as Peter Obi, presidential candidate of the Labour Party, Peter Obi; Elder Godsday Orubebe, former minister of Niger Delta Affairs who recently resigned from the PDP, have visited Mr Wike in the past few days.\nMr Wike on Thursday received Senate Minority Leader, Philip Aduda and other PDP politicians, also in Port Harcourt"
  },
  {
    "headline": "Makinde Calls For More Tactical Approach To Combat Insecurity",
    "summarized_story": "Oyo State governor, Seyi Makinde has called on relevant stakeholders in the country to employ a more tactical approach in combating the insecurity challenges facing the nation.\nThe governor, who stated this at an expanded security council meeting held at the House of Chiefs, Secretariat, Agodi, Ibadan, said that security operatives must work on response time during emergencies.\nThe meeting was attended by traditional rulers, and service commanders, including the new Commissioner of Police, Oyo State Command, CP Adebowale Williams as well as local government chairmen and vice-chairmen.\nHe stated: “Let me thank everyone in this hall for the role you have been playing in ensuring that Oyo State is relatively safe and secure.\n“Yesterday, we had the state security council meeting, and relatively compared to other states, Oyo State is peaceful."
  },
  {
    "headline": "Makinde Calls For More Tactical Approach To Combat Insecurity",
    "summarized_story": "Oyo State governor, Seyi Makinde has called on relevant stakeholders in the country to employ a more tactical approach in combating the insecurity challenges facing the nation.\nThe governor, who stated this at an expanded security council meeting held at the House of Chiefs, Secretariat, Agodi, Ibadan, said that security operatives must work on response time during emergencies.\nThe meeting was attended by traditional rulers, and service commanders, including the new Commissioner of Police, Oyo State Command, CP Adebowale Williams as well as local government chairmen and vice-chairmen.\nHe stated: “Let me thank everyone in this hall for the role you have been playing in ensuring that Oyo State is relatively safe and secure.\n“Yesterday, we had the state security council meeting, and relatively compared to other states, Oyo State is peaceful."
  },
  {
    "headline": "NEDC Launches Education Fund In Gombe",
    "summarized_story": "The North East Development Commission (NEDC) has launched Education Endowment Fund (EEF) to award scholarships to people of the zone.\nActing chairman of the board of trustees of the commission, Hajiya Asma’u Mohammed, disclosed this in Gombe while launching the Education Endowment Fund initiated by the commission for the educational development of the region.\nShe said a portal would be opened for all interesting applicants from the North East to apply even as she promised that beneficiaries would be selected on merits.\n“The governing board approved the establishment of the Education Endowment Fund on the 12th of December 2019 and inaugurated its board of trustees in August, 2020.\n“This is to chart a robust support trajectory for the recovery of our decaying education infrastructure and human resource base."
  },
  {
    "headline": "NEDC Launches Education Fund In Gombe",
    "summarized_story": "The North East Development Commission (NEDC) has launched Education Endowment Fund (EEF) to award scholarships to people of the zone.\nActing chairman of the board of trustees of the commission, Hajiya Asma’u Mohammed, disclosed this in Gombe while launching the Education Endowment Fund initiated by the commission for the educational development of the region.\nShe said a portal would be opened for all interesting applicants from the North East to apply even as she promised that beneficiaries would be selected on merits.\n“The governing board approved the establishment of the Education Endowment Fund on the 12th of December 2019 and inaugurated its board of trustees in August, 2020.\n“This is to chart a robust support trajectory for the recovery of our decaying education infrastructure and human resource base."
  },
  {
    "headline": "APP To Drag Tinubu To Court Over Academic Qualifications",
    "summarized_story": "The Action Peoples Party (APP) will on Monday, June 27, 2022, drag the presidential candidate of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, to court to challenge his academic qualifications to stand for the 2023 presidential election.\nThe decision followed alleged irregularities in the academic qualifications and documents submitted by Tinubu to the Independent National Electoral Commission (INEC).\nHe said, “Tinubu denies attending primary and secondary but claims a university degree in new INEC forms published today (Friday).\n“Tinubu commits perjury as he abandons his earlier claim of attending primary school, sworn in an affidavit to run for governor but now claims not to have attended primary school.\n“Tinubu’s new forms contradict his 2007 affidavit that he has primary school and secondary."
  },
  {
    "headline": "Terrorists hit Doma village, kidnap 2, kill vigilante members",
    "summarized_story": "Terrorists branded as gunmen have kidnapped two residents of Doma village in the Lapai Local Government Area of the Niger State.\nAbiodun said on June 22, the terrorists abducted two victims from Duma village, Lapai while working on a farm and disappeared into the forest in Rafin-Daji, Abaji area.\nHe said: ”Unfortunately, Police tactical team with some vigilante members who were on the rescue operation, engaged the kidnappers while one of the vigilante members lost his life.”The Police PRO said the Police teams were on the trail of the hoodlums to apprehend them.\nAbiodun appealed to residents, especially rural dwellers, to remain calm as Police and other security agencies would not relent in the ongoing fight against banditry.\nHe called for support for security agencies by giving intelligence information that could aid in apprehending criminal elements in the state."
  },
  {
    "headline": "Gov. Ikpeazu sad over death of Eze Ikpeaba",
    "summarized_story": "Okezie Ikpeazu has expressed sadness over the death of Eze John Ikpeaba, the traditional ruler of Isiala Ukwu Mbato Autonomous Community, in Obingwa Local Government Area (LGA) of Abia.\nIt said Ikpeazu spoke during the funeral service of the late royal father, conducted by the Apostolic Church Mission, Old Eastern Ngwa Headquarters, Amuzu Ohanze.\nHe noted that the royal father promoted peace, harmony, and development during his reign.\nOther speakers at the funeral extolled the good qualities of the royal father, who passed on at the age of 63 years.\nPresent at the burial were the member representing Obingwa East State Constituency, and Leader of the State Assembly, Mr. Solomon Akpulonu, Executive Chairman of Obingwa, Mr Ibe Nwoke."
  },
  {
    "headline": "JUST IN: UK’s Lincoln University Suspends Ekweremadu As Its Visiting Professor",
    "summarized_story": "Lincoln University, United Kingdom has banned Ike Ekweremadu from his duties as a visiting professor pending the conclusion of the organ harvesting allegation leveled against him.\nEkweremadu and his wife are accused of facilitating David’s entry into the UK to transplant his kidney into their daughter who is suffering from kidney failure.\nThe former Deputy Senate President of Nigeria was recently appointed a visiting professor of Corporate and International Linkages by the British school.\n“Visiting professors are often, as is in this case, non-resident at the university, unpaid and advisory,” a Lincoln University spokesperson said.\nFresh twistDavid’s (the young man who was to donate a kidney to Sonia , daughter of Senator Ekweremadu) passport has emerged, indicating that he is 21 years old."
  },
  {
    "headline": "INEC gives reasons why it excluded Lawan, Akpabio, Umahi’s names from its senatorial list",
    "summarized_story": "The Independent National Electoral Commission (INEC) has explained why some names submitted by the All Progressives Progress (APC) as senatorial candidates are missing from the list published by the commission on Friday.\nHowever, in the list published by the commission on Friday, Lawan, Umahi and Akpabio were said to have been excluded.\nThe development comes amid controversy over the APC Yobe north senatorial ticket, as well as issues over senatorial primaries featuring Akpabio and Umahi.\nAlthough APC had fixed its senatorial primaries for May, Umahi, Lawan and Akpabio were said to have participated in primaries organised by the APC after the trio contested the APC presidential ticket and lost earlier in June.\nHe also said the list published on Friday is not the final document for the 2023 polls, adding that the final list will be published at a later date."
  },
  {
    "headline": "My Certificates Were ‘Looted’ While In Exile – Tinubu",
    "summarized_story": "Ahmed Bola Tinubu, the presidential candidate of the All Progressives Congress (APC), has told the Independent National Electoral Commission (INEC) that his certificates were looted by unknown persons while he was on self-exile.\nAccording to a report by New Telegraph, Tinubu in his sworn affidavit in support of his nomination form, said he “went on self-exile from October 1994 to October 1999 (and) when I returned and discovered that my property including all the documents relating to my qualification and my certificates in respect of paragraph 3 above were looted by unknown persons.”The candidate skipped information regarding his primary and secondary education but said he attended the University of Chicago between 1972 and 1976 where he obtained a B.Sc in Economics.\nHe also said he had B.Sc in Business and Administration, as well as certificate in Public Account.\nThe presidential candidate of the Peoples Democratic Party (PDP) Alhaji Atiku Abubakar, presented the Master degree he obtained in 2021, as his highest educational qualification."
  },
  {
    "headline": "Supreme Court strikes out Buhari, Malami’s suit on Electoral Act amendment",
    "summarized_story": "The Supreme Court has struck out a suit by President Muhammadu Buhari and the Attorney General of the Federation (AGF), Abubakar Malami SAN seeking to void the provision of Section 84(12) of the Electoral Act 2022.\nThe court upheld all the grounds of objection raised by the National Assembly, through its lawyer, Dr. Olukayode Ajulo, against the competence of the suit marked: SC/504/2022.\nThe Supreme Court, however, agreed with Ajulo that the suit is not one of such cases in respect of which the court’s original and additional jurisdictions could be invoked under Section 23(2)(1) of the Constitution and Section 1(1)(a) of the Supreme Court (Additional Jurisdiction) Act 2002.\nThe apex court held that the President lacked the constitutional or legal rights or power to request or compel the National Assembly to amend or make an Act.\n“As it is, one of the cumulative requirements in Section 1(1)(a) of the Supreme Court (Additional Jurisdiction) Act 2002 for the invocation of the additional jurisdiction of this court to entertain an originating suit between the President and the National Assembly does not exist."
  },
  {
    "headline": "APC stalwart hails Buhari over rehabilitation of Yola-Hong-Mubi road",
    "summarized_story": "A stalwart of the All Progressives Congress, APC, in Adamawa state, Malam Hamisu Idris Medugu, has commended President Muhammadu Buhari for approving the rehabilitation of Yola-Hong-Mubi road in the state.\nIn a press release in Yola, the Adamawa state capital, Medugu thanked the president for the positive consideration of the state in his policy implementation.\nHe appreciated President Buhari for being a true father to Nigerians, especially to the people of Adamawa state.\nThe APC chieftain also commended the Secretary to the Government of the Federation, Barrister Boss Mustapha, for his absolute loyalty President Buhari.\nFEC had earlier on June 15, 2022, approved the award of the contract for the rehabilitation of Kashimbila-Takum-Chanchanji road in Taraba state."
  },
  {
    "headline": "[Breaking] Taiwo Awoniyi: New Premier League entrant, Nottingham Forest, strike deal with Super Eagles striker in club’s record signing",
    "summarized_story": "Nottingham Forest have signed Nigeria forward Taiwo Awoniyi from Union Berlin for a club record fee.\nAwoniyi scored 20 goals in 43 games across all competitions last season and becomes Forest’s first signing since gaining promotion back to the Premier League.\n“It’s always been my dream to play in the Premier League,” said Awoniyi.\nForest manager Cooper said Awoniyi was a player the club had been monitoring closely over the past few months.\n“There’s been a lot of interest of Taiwo from other Premier League clubs, and other clubs across Europe, so we’re delighted he’s chosen Nottingham Forest,” Cooper said."
  },
  {
    "headline": "Organ harvest saga: How London doctor exposed Ekweremadu, wife",
    "summarized_story": "Ike Ekweremadu, 60, and Beatrice Ekweremadu, 55, are accused of taking the homeless youngster to the UK from Nigeria to transplant his organs into their daughter who is suffering from kidney failure.\nMr Ekweremadu has been an elected senator at the Abuja-based parliament since 2003 after moving into politics after years as a lawyer.\nHis wife, five years his junior, is an academic and doctor and also a major public figure in Nigeria.\nHe only found out that the purpose of his visit was for an organ transplant when he visited the hospital’.\nEkweremadu, 60, is said to have had £20,000 on him at the time of his arrest, according to prosecutors."
  },
  {
    "headline": "ACCI Member, Esther Eghobamien-Mshelia Elected into UN Committee on CEDAW",
    "summarized_story": "The Federal Ministry of Women Affairs and Social Development (FWASD) has announced the election of Abuja Chamber of Commerce and Industry (ACCI) member, Mrs Esther Eghobamien-Mshelia as Nigeria’s representative on the Convention On the Elimination of All Forms Discrimination Against Women (CEDAW) Committee.\nMrs Eghobamien-Mshelia, who is the founder, Women Arise Development Initiative (WADHI) was one of the 12 members elected by states parties of the committee on the elimination of discrimination against women to replace those whose terms of office are due to expire on 31 December 2022.\nThe terms of the new elected members would commence 1st January 2023 and run through a period of four years, later on 31 December 2026.\nWhile congratulating her election into the CEDAW committee, Mrs Tallen stated that she has no doubt that Mrs Eghobamien-Mshelia will do us proud in the journey ahead adding that we must therefore rise above our differences to ensure that we succeed in flying the Nigeria colours high.\nThe Minister lauded the role of the Managing Director, Bank of Industry, Mr. Olukayode Pitan and the Director-General ACCI, Dr Victoria Akai for the great role they played in the realization of the mandate."
  },
  {
    "headline": "ACCI President Presents Opportunities for Investors in Untapped Natural Gas",
    "summarized_story": "The President of Abuja Chamber of Commerce and Industry (ACCI), Dr Al-Mujtaba Abubakar has said there are opportunities for investors to harness in Nigeria natural gas as we have large untapped reserves.\nHe gave detailed presentation on the Nigeria gas industry, from proven reserve to our daily gas consumption in Nigeria and also the governments agenda for gas by declaring 2020-2030 the decade of gas where he captured the CBN gas intervention fund.\nThe identified companies are; First Services, Target Energy Solutions, ASF Consulting, Innova soft Integration are interested in partnerships in Nigeria.\nThe President ACCI assured them that the Chamber will facilitate their meeting with NNPC and advised them to write through their embassy in Nigeria.\nQuite a number of companies expressed their willingness to participate in the 2023 Petroafrica Conference to be held in Nigeria."
  },
  {
    "headline": "Access Bank to reward customers in South-South, South-East",
    "summarized_story": "Kehinde Ibrahim, LagosACCESS Bank Plc has said it would be rewarding its customers in the South-South and South-East regions with millions of naira and other attractive consolation prizes in its DiamondXtra regional draw.\nSpeaking to newsmen at the bank’s head office in Lagos recently, Group Head, Consumer Banking, Access Bank Plc, Adaeze Ume, explained that the motivation behind the regional draws in the new season of the reward scheme is the need to transform the lives of more Nigerians across the country.\nIn her words, “To deliver on our promise to continually reward our customers for their loyalty and continued savings with our bank, we have decided to take the DiamondXtra reward scheme draws even closer to them.\nWe intend to reward 38 lucky customers in the South-South, South- East region with juicy cash and consolation prizes in the LIVE draw taking place on the 29th of June 2022 in Owerri, Imo State.\n“We continue to evolve and reflect on the various offers within the DiamondXtra reward programme, and engage our customers on what they would prefer to have as a reward."
  },
  {
    "headline": "CFI, others win prizes at NCRIB maiden tennis competition",
    "summarized_story": "Kehinde Ibrahim, LagosTHE Commissioner for Insurance and Chief Executive Officer of the National Insurance Commission (NAICOM) Mr. Olorundare Sunday Thomas has been declared overall winner of the Nigerian Council of Registered Insurance Brokers (NCRIB) maiden tennis competition in Veteran categoryThe Competition held at the weekend at Lagos Lawn Tennis Club, Lagos.\nThe two days competition which was well attended by members of the Lagos Lawn Tennis Club, students of both Secondary and tertiary institutions and insurance industry became a platform for stakeholders to drum the beats of insurance importance to sport lovers.\nOur intention is to indirectly enforce, not only the government’s highlighted insurance policies, but all insurance products without compulsion.\nYou will recall that few days ago, we embarked on Insurance Awareness Walk from Moleye to Adekunle end of Lagos Third Mainland Bridge, where we shared flyers that narrate what insurance stands for.\nBefore the end of the year, we have plan to take the awareness walk campaign to market places, government circles."
  },
  {
    "headline": "PenCom kicks off online verification for MDAs’ retirees",
    "summarized_story": "Kehinde Ibrahim, LagosTHE National Pension Commission (PenCom) has started its online verification and enrolment for prospective retirees and retirees of Federal Government Treasury Funded Ministries, Departments and Agencies (MDAs), the Director-General, Mrs. Aisha Dahir-Umar has said.\nAnnouncing this, Mrs. Dahir-Umar, called on prospective retirees to ensure that they undergo the compulsory Data Recapture Exercise (DRE).\nShe stated that the exercise was aimed at validating the accrued pension liabilities of government for the retirees.\nShe said: “The accrued right is a component of the Retirement Savings Account (RSA) of the employee to be accessed upon retirement.\nHowever, following the experience of the COVID-19 pandemic in 2020, which restricted the movement of persons, PenCom designed and developed an online Enrolment Application with the capabilities to register, verify and enrol the prospective retirees."
  },
  {
    "headline": "INEC Lists Conditions For Political Parties To Substitute Vice-Presidential Candidates",
    "summarized_story": "﻿The Independent National Electoral Commission (INEC) on Friday listed the conditions for political parties to substitute candidates whose names have been forwarded to the commission.\nThis comes amid reports that some political parties, including the All Progressives Congress (APC) and Labour Party, nominated their vice-presidential candidates as placeholders, pending the conclusion of talks for a substantive candidate to be picked.\nWhile the former forwarded the name of Ibrahim Kabiru Masari as its vice-presidential candidate, the latter had nominated Doyin Okupe for the same position.\nHe stressed that none of the political parties neither indicate that they were submitting the document or name of a candidate as a placeholder.\n“All the political parties that submitted list and particulars of their candidates said they were submitting the list of their presidential candidates and vice-presidential candidates; the issue of submitting a name in lieu, or submitting a name as a placeholder did not even arise,” the INEC official stated."
  },
  {
    "headline": "PHOTOS: Kwankwaso, Fayose Visit Wike In Port Harcourt",
    "summarized_story": "Presidential candidate of the New Nigeria People’s Party (NNPP), Rabiu Kwankwaso on Friday paid a visit to Rivers State Governor, Nyesom Wike in Port Harcourt.\nAlso present at the meeting was former Ekiti State Governor, Ayodele Fayose.\nREAD ALSO: ADC Nominates Tonto Dikeh As Deputy Governorship Candidate For RiversOther political players such as the presidential candidate of the Labour Party, Peter Obi, have visited Mr Wike in the past few days.\nMr Wike on Thursday received Senate Minority Leader, Philip Aduda and other PDP politicians, also in Port Harcourt.\nSee more photos from Mr Kwankwaso’s visit:"
  },
  {
    "headline": "2023: Lawan, Akpabio, Umahi Missing As INEC Releases List Of Senatorial Candidates",
    "summarized_story": "﻿The Independent National Electoral Commission has released the list and particulars of candidates vying for various positions at the federal level in the 2023 general elections.\nConspicuously missing were the names of Senate President Ahmad Lawan, former Minister of Niger Delta Affairs, Godswill Akpabio, and Ebonyi State Governor, Dave Umahi.\nINEC is not obligated to publish the name of candidates that did not participate in valid party primaries – Festus Okoye, INEC National Commissioner#PoliticsToday#CTVTweets pic.twitter.com/ymyVaOCct0 — Channels Television (@channelstv) June 24, 2022However, Mr Okoye noted that INEC has not published the final list of validly nominated candidates.\n“The final list of validly nominated candidates will be published by the Independent National Electoral Commission on the 20th day of September, 2022.\nAnd we published the personal particulrs of candidates that emerged from valid party primaries."
  },
  {
    "headline": "US Passes First Major Gun Bill In Decades",
    "summarized_story": "US lawmakers broke a decades-long stalemate on firearms control Friday, passing the first major safety regulations in almost 30 years, less than 24 hours after the Supreme Court bolstered the right to bear arms.\nGun regulation is a touchstone issue for both conservatives and liberals in the United States that has consumed national politics amid multiple mass shootings in recent years.\nThe Democratic-led House of Representatives voted to rubber-stamp a bipartisan Senate gun bill that — while modest — amounts to the first significant piece of legislation to regulate firearms since 1994.\nThe gun legislation includes enhanced background checks for younger buyers and federal cash for states introducing “red flag” laws that allow courts to temporarily remove weapons from those considered a threat.\nThe Supreme court had voted along party lines, with the six Republican appointees in favor of bolstering the constitutional right to bear arms and the three Democratic appointees dissenting."
  },
  {
    "headline": "Super Eagles Striker Awoniyi Joins Nottingham Forest For Club Record Fee",
    "summarized_story": "Super Eagles striker Taiwo Awoniyi has signed for newly promoted Nottingham Forest for an undisclosed club-record fee.\nThe 24-year-old joins from German Bundesliga club Union Berlin for a reported £17.5 million on a five-year-deal after scoring 20 goals in 43 games in all competitions last season for Union.\nFifteen of his goals in 31 Bundesliga games helped Union Berlin finish fifth, thereby qualifying for the UEFA Europa League for the first time since 2001-02.\nThis will be Awoniyi’s second spell with an English Premier League side after starting his professional career at Liverpool in 2015, following his crucial role for the Golden Eaglets in their U-17 World Cup triumph in 2013.\nFollowing his latest return to England, Awoniyi told Nottingham Forest’s website that he is excited by another opportunity to play in the Premier League, especially for a historic club like the Reds and he will be doing his best to help his new club achieve their objectives."
  },
  {
    "headline": "Wase eulogises Gbajabiamila at 60, says he's a patriot",
    "summarized_story": "Deputy Speaker of the House of Representatives, Ahmed Idris Wase has congratulated Speaker Femi Gbajabiamila as he marks his 60th birthday.In a congratulatory message signed by his Chief Press Secretary, Umar Muhammad Puma, Wase described Gbajabiamila as a patriot and a legislator per excellence.\n“Through the Joint Task mantra, Speaker Femi Gbajabiamila has been able to unite members of the House by giving everyone a sense of belonging.\nThe Deputy Speaker noted that Gbajabiamila has shown great commitment to the independence of the legislature saying “his love for Nigeria and commitment to the growth and sustenance of our democracy through effective legislation is never in doubt”.\n“Working with Speaker Femi Gbajabiamila has been an exciting and insightful experience that has enriched my political career.\n“As you celebrate an additional year today, I pray that the Almighty Allah will bless you with many more decades of good health to continue to serve your fatherland to the best of your ability”."
  },
  {
    "headline": "Akeredolu Nominates Two New Commissioners -",
    "summarized_story": "Ondo State Governor, Oluwarotimi Akeredolu Aketi, SAN, has nominated two new commissioners designate.\nThe two nominees are Akinwumi Samson Sowore and Prince Joseph Adeboboye Ologbese.\nTheir names have been forwarded to the State House of Assembly for screening, clearance and confirmation.\nAkinwumi Samson Sowore is from Ese-Odo Local Government Area while Prince Joseph Adeboboye Ologbese is from Akoko Southwest Local Government Area.\nThe two nominees are expected to replace the two former commissioners from the local government areas, Donald Ojogo and Gboyega Adefarati, who resigned their appointments to contest elective positions.https://www.tvcnews.tv/purplegold/post-new.php#"
  },
  {
    "headline": "Tinubu will ensure youth welfare, inclusiveness",
    "summarized_story": "The Asiwaju Tinubu Campaign Organisation says the emergence of the All Progressives Congress presidential candidate as Nigerian president is one that would see to the demands of the youths in the country.\nThe Director General of the Campaign group Bayo Shittu disclosed this while briefing newsmen at a press conference held in ibadan.\nThe former Minister of Communications noted that the presidential candidate Asiwaju Tinubu is aware of the outcome of leaving the youth uncared for in any economy, hence, there would be a total transformation in youth welfare.\nThe DG revealed the APC Presidential candidate would based his mandate on what can be described as Nigeria’s Rebirth Manifesto.\nATPCO is one of the groups backing the Presidential aspiration of the National Leader of the All Progressives Congress, Asiwaju Bola Ahmed Tinubu, who is the party’s Presidential candidate."
  },
  {
    "headline": "APC is headed for victory in 2023",
    "summarized_story": "APC Presidential candidate, Asiwaju Bola Tinubu says victory is sure for him at the forthcoming 2023 Elections.\nHe made the expression of optimism during his assessment visit of the inherited Abuja APC campaign office used in the 2019 election by President Buhari.\nAPC Presidential candidate, Asiwaju Bola Tinubu in the company of Kano State Governor, Abdullahi Ganduje and other party faithful are here to observe the Juma’at prayer.\nHundreds of worshippers trooped out to hail Asiwaju Tinubu as he leaves the mosque with his entourage.\nThe former governor of Lagos moved straight to APC campaign office used in 2019 by President Muhammadu Buhari in Abuja."
  },
  {
    "headline": "Nigeria: President Can’t Ask Court to Remove a Law He Signed, Supreme Court Says",
    "summarized_story": "The apex court, in a unanimous decision described the suit as an abuse of court process and subsequently struck it out.\nAccording to Justice Musa Mohammed-Dittjo, who led a seven-man panel of the Supreme Court, the plaintiffs having earlier assented to the said section 84(12) of the Electoral Act 2022, cannot turn around to approach the court to strike it down.\nTherefore, this suit cannot be entertained by this court in the exercise of its additional jurisdiction under Section 1(1)(a) of the Supreme Court (Additional Jurisdiction) Act 2002.\n“In conclusion, the Supreme Court has laid their own brick in the efforts towards electoral reform by this judgement.\nThey have added their own bricks to Nation building through the electoral reform and electoral act 2022."
  },
  {
    "headline": "Lawan, Umahi, Akpabio Lose Out as INEC Omits Their Names from List of Candidates for 2023 Elections",
    "summarized_story": "Also Friday, INEC explained why some of the names submitted by the political parties were missing from the list published by the commission.\nLawan, Akpabio and Umahi, had been listed by the All Progressives Congress as candidates for Yobe North, Akwa Ibom North-west, and Ebonyi South senatorial districts, respectively.\nUmahi also had a primary election that produced his brother cancelled for a fresh one, but it was not recognized by INEC.\nMeanwhile, INEC on Friday released the formal report on APC Yobe North Senatorial primary, confirming that Lawan did not participate in the primary held May 28 in Gashua.\nThe report read, “The Senatorial Primary for zone ‘C’ comprising Bade, Yusufari, Jakusko, Nguru, Karasuwa and Machina local government areas respectively."
  },
  {
    "headline": "We Need to Practice Democracy in Nigeria and End ‘Partizanism’ – Pst Chris Okotie",
    "summarized_story": "Pastor Chris Okotie, Founder, Household of God Church, says Nigeria must resort to an interim government as a mechanism for the crystalization for a new Nigeria."
  },
  {
    "headline": "Organ Harvesting: Consent is Irrelevant If the Donor in Question is a Minor – Muhammed Babandede",
    "summarized_story": "Former DG, Nigerian Immigration Service, explores the possibility of a child trafficking charge, on Nigerian Senator Ike Ekweremadu, if he indulged in procuring false credentials for a minor with an intent to exploit him for organ harvesting."
  },
  {
    "headline": "Ekweremadu And Wife Arraigned For Organ Harvesting -Trending With Ojy Okpe – Arise News",
    "summarized_story": "The arrest of Nigeria’s former deputy senate president, Ike Ekweremadu and his wife Beatrice by the United Kingdom’s metropolitan police on Thursday has garnered several reactions.\nThe couple were arraigned for conspiracy to arrange the travel of a child, potential modern slavery and organ harvesting.\nThe case has been adjourned till July 7thA lagos based human rights Lawyer, Malcolm Omirhobo on Thursday set social media abuzz after he appeared before the supreme court dressed as a semi lawyer and a traditionalist.\nThe lawyer who is from delta state, claimed to have been expressing his fundamental human rights following the recent verdict of the apex court which legalised the wearing of hijab in schools.\nThe president wanted to show more of his dance moves this time alone in what looks like a hotel room."
  }
]