[
  {
    "headline": "Electoral bill takes front burner as National Assembly resumes Tuesday",
    "summarized_story": "The National Assembly is billed to resume plenary on Tuesday after Christmas and New Year break, with expectations from Nigerians on the Electoral Act (Amendment) Bill and the 1999 Constitution Review.\n), had vetoed the electoral bill over the restriction of political parties to direct primary, insisting on the direct, indirect and consensus options.\nBoth the Senate and the House of Representatives had suspended action on the bill till resumption on January 18, 2022.\nWhen asked why members of the House are not mobilising to override the veto, the lawmaker said, “The electoral bill is what every politician is interested in.\nThe lawmaker vowed that opposition members of the parliament would prevent a repeat of what Buhari did to the bill under the last Assembly."
  },
  {
    "headline": "Nnamdi Kanu: South-East govs, Igbo leaders to meet Buhari, insist on political solution",
    "summarized_story": "The South-East Governors Forum, leadership of Ohanaeze Ndigbo and Igbo leaders of thought will meet the President, Major General Muhammadu Buhari (retd.\n), within the first quarter of the year over Biafra agitation and detained leader of the Indigenous People of Biafra, Nnamdi Kanu, The PUNCH learnt on Sunday.\nThe National Publicity Secretary of Ohanaeze Ndigbo, Chief Alex Ogbonnia, confirmed the development to our correspondent in an interview on Sunday.\nHe said, “Ohanaeze Ndigbo, South East governors and prominent Igbo leaders will meet with the President within the first quarter of this year.\n“If you look at the number of local governments and states in Nigeria, it is lopsided against the South East."
  },
  {
    "headline": "Human traffickers now recruiting victims through virtual processes -NAPTIP",
    "summarized_story": "File: Human trafficking: NAPTIP in battle with human traffickersBy Joseph ErunkeABUJA-WITH the advent of COVID-19 pandemic,human traffickers have shifted from physical recruitment of their victims to virtual recruitment through virtual assessment of victim and proxy negotiation,the National Agency for the Prohibition of Trafficking in Persons,NAPTIP,has said.\nDirector General of NAPTIP, Dr Fatima Waziri–Azi, said this while speaking on the 2022 counter trafficking strategic approach of the agency aimed at ensuring protection of Nigerians from human trafficking and other forms of exploitation, online and offline.\nThere is a shift from physical recruitment to virtual recruitment through virtual assessment of victim and proxy negotiation,”she said.\n“READ ALSO:Police begin probe of alleged involvement of senior officer in artisanal refining of crude“The system will also help trace missing children, rescue child victims and rescue children from abusive situation”, Dr Fatima Waziri–Azi added.\nThe system will also help trace missing children, rescue child victims and rescue children from abusive situation”, Dr Fatima Waziri–Azi stated."
  },
  {
    "headline": "Just in: NITDA to hold Hackathons in 3 States",
    "summarized_story": "By Emmanuel ElebekeThe National Information Technology Development Agency (NITDA) under the supervision of the Ministry of Communications and Digital Economy through its subsidiary, the National Centre for Artificial Intelligence and Robotics (NCAIR) is to host 3 editions of the NITDA HACKATHON in January 2022.\nNITDA Hackathon is a national event in collaboration with academic institutions to drive digital innovation and entrepreneurship by challenging Nigeria’s teeming youths to create and develop solutions from inception through to the market.\nThe first edition will hold between 18th – 20th January 2022 at the Modibbo Adama University of Technology (MAUTECH), Yola, Adamawa.\nAnd the second edition will hold between 25th – 27th January 2022 at the University of Ibadan, Oyo State, while the third edition will hold between 31st January – 2nd February 2022 at the University of Calabar, Cross Rivers State.\nNCAIR is also focused on creating a thriving ecosystem for innovation-driven entrepreneurship (IDE), job creation, and national development."
  },
  {
    "headline": "[BREAKING] National Convention: APC Govs insist on February, pass Confidence Vote on Buni",
    "summarized_story": "Omeiza Ajayi, AbujaGovernors of the ruling All Progressives Congress APC rose from their meeting Sunday night in Abuja with a resolution to go ahead with the national convention of the party in February.\nNo fewer than 20 of the governors were at the meeting which took place behind closed doors at the Kebbi state Governor’s Lodge in the Asokoro District of Abuja.\nBriefing journalists at the end of the meeting, Chairman of the Forum and Kebbi state Governor, Abubakar Atiku Bagudu said the forum passed a vote on confidence on Gov.\nBuni and two other governors in the Caretaker Extraordinary Convention Planning Committee – Abubakar Sani Bello and Gboyega Oyetola.\nHe said the governors also agreed to go ahead with the national convention slated for February."
  },
  {
    "headline": "2023: Ebonyi Govt lampoons group for allegedly dishing out falsehood against Umahi",
    "summarized_story": "By Peter Okutu, AbakalikiEBONYI State Government, weekend lampooned a group, it described as faceless, for publishing damaging and untrue reports against the personality of Governor David Umahi and Presidential aspirant in the 2023 general election.\nDavid Nweze Umahi FNATE, FNATE (Akubaraoha).\n“The latest of their post is the one published by one Jacob Onuewu Dickson which the mischief-makers have sponsored in many social media platforms and same escalated by their paymasters today, 14th January 2022.\n“We again wish to reiterate that Pascal Oluchukwu is a roguish imposter who has fraudulently attached the prefix “Ambassador” to his name with intent to defraud members of the public and swindle the gullible on his evil orchestrations against Ebonyi State.\n“The idle Pascal Oluchukwu with his principals are strongly admonished to bury his face in hopeless shame as the desired social and economic situations in Ebonyi State have assumed an Olympian height under the star Governor and the world has taken judicial notice of this development and no wishes of evil geniuses can derail his visions.”Vanguard News Nigeria"
  },
  {
    "headline": "Unilorin honours Gbajabiamila, other distinguished Nigerians in its 8th Leadership Summit",
    "summarized_story": "The Students Union authorities of the University of Ilorin has concluded arrangements to honour the Speaker of House of Representatives, Rt Honourable Femi Gbajabiamila and other distinguished Nigerians in its 8th edition of the annual Leadership Summit and also launch its, “Erudite” journal of the union at the occasion.\n“Retrospectively, the last two editions were in honour of the Minister of Interior, Ogbeni Rauf Aregbesola and the JAMB Registrar, Professor Is-Haq Oloyede.\n“However, our administration has decided to bring the Speaker of the House of Representatives, Rt Honourable Femi Gbajabiamila considering his giant strides in governance, youth development and quest to better the electoral process at this crucial time.\n“The event will also feature goodwill messages from special Guests of honour that will also be awarded due to their strides.\nMorenikeji Ayodele Aniye, the founder/CEO of Hotspot Group Limited to mention but a few.”Vanguard News Nigeria"
  },
  {
    "headline": "Ikpeazu lauds Nigerian Armed Forces for sustaining national peace",
    "summarized_story": "Governor Okezie Ikpeazu of Abia State has lauded the sacrifices and commitment of the Nigerian Armed Forces in the maintenance of national, sub-national, regional and global peace and security.\nIkpeazu, who made the commendation during the grand finale marking the end of the 2022 Armed Forces Remembrance Day celebration held at the old Cenotaph ground, Ogurube layout, Umuahia, said the country must continue to appreciate and acknowledge the patriotic contributions and sacrifices of the Nigerian Armed Forces in the fight against Boko Haram, insurgency, kidnapping, banditry, armed robbery, terrorism and other forms of criminality across the country.\nIkpeazu, ably represented by his Deputy, Rt Hon.\nHe further promised that the present administration will not relent in its commitment to always encourage and support the state chapter of the Nigeria Legion and other security agencies in all areas within the limits of available resources.\nHighlights of the occasion included the inspection of Guards mounted by men of the Nigerian Armed Forces by the Governor’s representative, laying of wreaths at the feet of the unknown soldier by the Governor represented by Chukwu; the Commander, 14 Brigade, Ohafia, Brigadier Gen M.B."
  },
  {
    "headline": "‘You’re our next president’ – Crowd chants as Tinubu visits Kano",
    "summarized_story": "Bola Ahmed Tinubu, National Leader of the All Progressives Congress (APC), Sunday visited Kano State to chants and placards by supporters shouting, “Tinubu you are our next President”.\nThe former Lagos governor, who was received by Governor Abdullahi Ganduje at the Mallam Aminu Kano Airport, proceeded to late Sheik Ahmad Ibrahim Bomba’s home around BUK old site to condole his family.\nSimilarly, the presidential aspirant visited the late Alhaji Bashir Tofa’s house at Gandun Albasa, where he described Tofa as a gentleman politician who accepted defeats to M.K.O.\nHe described the acceptance of the defeat by Tofa as something worthy of emulation by Nigerian politicians.\nSimilarly, Tinubu visited the home of the late National President of the Council of Sharia, Dr Ibrahim Datti Ahmad, where he offered prayers for the repose of his soul."
  },
  {
    "headline": "Nigeria at crossroads, needs urgent rescue – Bishop Arogundade",
    "summarized_story": "Bishop of the Catholic Diocese of Ondo, Most Reverend Jude Arogundade, has disclosed that measures must be taken to rescue the country from its current doldrums.\nIn his homily, the priest said, “our country is at a crossroad and no individual can save it all alone.\nWe must come together to unite around our common purpose and shared vision.\n“We must teach our youth how to be self-reliant and to take responsibility for their lives and our common patrimony – Nigeria.\n“Our youth need to be told that leadership is not about power but about purpose, not about popularity but about integrity."
  },
  {
    "headline": "Eliminate terrorists by every means possible – Tinubu to Buhari",
    "summarized_story": "The National Leader of the All Progressives Congress (APC), Chief Asiwaju Bola Ahmed Tinubu, has charged President Muhammadu Buhari to employ all available means to eliminate banditry and terrorism from the country.\nThe APC chieftain said he will not relent in his support for the President until he succeeds in cracking the nut.\nWith reference to a Yoruba proverb, he said, “It’s not easy to get to the seed of a palm kernel without a cracker.\nWe will continue to pray with you to conquer the evil of sudden kidnapping, maiming and killing of innocent lives.”Tinubu was in Katsina on Sunday to condole with the State Governor, Aminu Masari, over the assassination of Dr Rabe Nasir, Commissioner for Science and Technology.\nIn his words, “We are here only to grieve on the wicked assassination of the Honourable Commissioner of Science and Technology, Dr Rabe Nasir.”Tinubu said he was informed by the Katsina Governor, that “the late Rabe Nasir was one of the most reliable and resourceful individuals of Katsina State with a very broad knowledge of Nigeria as a country.”While sharing in their grief, Tinubu urged people in the state to have strong faith in God, noting that “evil men may interfere and try to tempt Allah, but He is the giver and He is the taker.”Governor Masari in his remark thanked the APC chieftain for making out time to come down to the state to sympathize with the people of the state."
  },
  {
    "headline": "Living Faith: Bishop Oyedepo speaks of death, warns against naming church after him",
    "summarized_story": "Bishop David Oyedepo of Living Faith Church Worldwide has warned his members against naming the church after him when he dies.\nOyedepo explained that the church belongs to God and not him, hence structures should not be named after him.\nAddressing his members at the church’s headquarters in Ota, Ogun State, the clergyman said such an action was not the plan of God.\n“Don’t try it, it’s not God’s will it’s not God’s plan.\n“You can’t divide anybody goods till after his death and Jesus the owner of the church ever liveth."
  },
  {
    "headline": "Lagos announces plans to immortalise Sound Sultan",
    "summarized_story": "The Lagos State Government has announced plans to immortalise late Nigerian singer, Olanrewaju Abdul-Ganiu Fasasi aka Sound Sultan.\nThe Special Adviser to Lagos State Governor on Tourism, Arts and Culture, Solomon Bonu, said the state will celebrate Sound Sultan every December for four days in Lagos.\nBonu stated this at the just-concluded Festac Music Festival, which was initiated by the late singer and songwriter, to raise young talents.\n- Advertisement -“The Festac Music Festival was supported by the Ministry of Tourism, Arts and Culture to honour Sound Sultan, preserve his legacy, and appreciate his contributions to the music industry.\nThe Festival Director and Chief Executive of Naija Ninja Production, Dare Fasasi aka Baba Dee, who is the elder brother to late Sound Sultan, appreciated the State Government for the recognition."
  },
  {
    "headline": "Uzodinma appoints Cubana Chief Priest Special Adviser",
    "summarized_story": "Imo Governor Hope Uzodinma has appointed celebrity barman, Cubana Chief Priest as a Special Adviser.\nCubana Chief Priest, who used to work with Obi Cuban before going solo, was appointed the Governor’s Special Adviser on social media influence and social events management.\nThe celebrity barman took to his Instagram page to share the news.\nHe posted: ” I have an instruction from his excellency to make over 1000 Imo State youths super successful like me from the almighty social media which made me in just one year, it’s so easy for me to do and I will do just that through Christ who strengthens me, Amen.\n- Advertisement -“May God give me grace, wisdom, energy and guts to tell his excellency the unfiltered truth he needs to hear at all times.”"
  },
  {
    "headline": "Three killed, many abducted as bandits raid Niger communities",
    "summarized_story": "Three killed, many abducted as bandits raid Niger communitiesBandits have killed three persons and abducted 28 others in Farin-Shinge, Kulho, Jigawa, Dogo Fadama communities of Mashegu local government area of Niger stateThe Nation gathered the bandits demanded seven 50 litres of fuel, packs of Viju milk and other drinks as ransom for the release of the abductees.\nIn the Farin-Shinge community, which is in the outskirts of Kontagora, the bandits struck around 1.45 pm when the Jumat prayers were about to hold.\nAnother group of bandits attacked Jigawa, Dogo Fadama and surrounding communities killing two people while four others were abducted.\nA resident of the Jigawa community, Umar Mohammed, said that the bandits conducted house to house searches and rustled a large number of cattle.\nIn Kulho community, the bandits struck around 3.30 pm and operated till 6 pm."
  },
  {
    "headline": "Eguavoen warns Super Eagles against complacency",
    "summarized_story": "Super Eagles coach Augustine Eguavoen has warned his players against complacency and taking their chances in front of goal in subsequent matches of the 2021 AFCON in Cameroon.\nEguavoen however said the team did not play at the same high tempo, especially in the second half and that gave the Sudanese the comeback for the consolatory goal.\n“So it’s a little bit difficult to say whether we were complacent in the Sudan game or not but we will discuss this with the boys going forward,” he said.\n“Obviously, we will make changes for the last group game against Guinea-Bissau.\nThe Super Eagles will take on Guinea-Bissau on Wednesday in their last group match."
  },
  {
    "headline": "NCC raises the alarm over cyber attacks through USB drives",
    "summarized_story": "The Nigerian Communications Commission, NCC, has alerted members of the public that a cybercrime group has perfected a scheme to deliver ransomware to targeted organizational networks.\nWhile businesses are being targeted, criminals could soon begin sending infected USB drives to individuals, the Commission explained further.\nDescribing how the cybercrime group runs the ransomeware, the NCC noted that the ngCERT advisory says the USB drives contain so-called ‘BadUSB’ attacks.\n“According to ngCERT, the attack has been seen in the US where the USB drives were sent in the mail through the Postal Service and Parcel Service.\nThese recommendations include a call on individuals and organisations not to insert USB drives from unknown sources, even if they’re addressed to you or your organization."
  },
  {
    "headline": "0ver 3,000 imported vehicles trapped at port as Vreg platform breaks down",
    "summarized_story": "By Steve AgbotaClearing agents and freight forwarders have decried over 3, 000 imported vehicles trapped at the Tin-Can Island Ports Complex, Apapa, due to the collapse of the National Vehicle Registration (VReg) platform created by the Federal Ministry of Finance (FMoF) for imported vehicles.\nThe clearing agents lamented the daily rising costs incurred from demurrages arising from several imported vehicles trapped at the various terminals in the port as they unable to clear them over breakdown of Vreg platform.\nThey said that VReg platform, which was created by the Federal Ministry of Finance (FMoF) for imported vehicles in 2021 became mandatory and first prerequisite for any vehicle that must be cleared from the nation’s port has been malfunctioning.\n“Accessing Vreg platform since last week has been a nightmare as the portal had been down due to server breakdown.\n“We are appealing to the Federal Ministry of Finance or their consultant to open the link icons for importers to pay directly."
  },
  {
    "headline": "Governors’ forum holds ‘crucial meeting’ in Abuja Wednesday",
    "summarized_story": "From Ndubuisi Orji, AbujaThe 36 state governors would meet on Wednesday in Abuja to discuss pressing national concerns.\nThe meeting is scheduled for the Nigeria Governors’ Forum (NGF) secretariat in the Federal Capital Territory (FCT) at 8pm.\nAn invitation to the governors was sent by the Director-General of the NGF, Asishana Okauru, according to a statement issued by Abdulrazaque Bello-Barkindo, head of public affairs of the forum.\nMeanwhile, the Peoples Democratic Party (PDP) Governors Forum would meet in Port Harcourt, the Rivers State capital, today.\nAyu has been invited to attend the Port Harcourt meeting to hold consultations with the governors on strategies for executing the Rescue and Rebuild Nigeria project.”"
  },
  {
    "headline": "Insurgency: Army chief hails The Sun, pushes for more media collaboration",
    "summarized_story": "The army chief, who called for more collaboration with The Sun, said with media support, about 50 percent of the insurgency war would be won.\nHe said terrorists and other criminal groups continue to thrive because of the publicity they get from the media.\nAs a result, he said oftentimes, the publicity given to terrorists’ activities dampen the morale of troops.\n“The army and the armed forces and other security agencies are productive in their operations and activities.\n“We are also happy with the synergy we are seeing among the Army, Navy, Air Force and other security agencies."
  },
  {
    "headline": "Breaking: Gunmen Reply Niger Governor Bello, Attack Communities In his Local Government",
    "summarized_story": "The latest attacks occurred in Farin-Shinge in Kontagora local government, a home local government of the Governor, and Kulho, Jigawa, Dogo Fadama communities in Mashegu local government area of the state.\nIt was gathered that the gunmen were said to have carried out the onslaught on the communities between Friday afternoon and Saturday morning.\nThe Vice-Chairman of Kontagora local government area, Aliyu Makiga who confirmed the attack in Farin Shinge, said that the gunmen came through the Tegina route in their large number, adding that the security operatives tried to foil the attack but met stiff resistance from the well-equipped gunmen.\nAlso another group of gunmen attacked Jigawa, Dogo Fadama and surrounding communities killing two people while four others were abducted.\n“People began to run and in the process one Alhaji Tanko was shot dead by the gunmen."
  },
  {
    "headline": "NDLEA intercepts 1.5million Tramadol tablets going to Kebbi, Kano; other drugs at Lagos airport, seaport",
    "summarized_story": "The banned substances were loaded in Onitsha, Anambra state and heading to Yauri, Kebbi state.\nThis is even as a total of 425, 000 Diazepam tablets were recovered at Segemu, Kano.\nThe drugs seized include: 394,480 capsules and 3,000 tablets of Tramadol weighing 83.707kg; Exol-5: 647,500 tablets weighing 203.315kg; Diazepam: 12,500 tablets weighing 2.05kg; Bromazepam: 1,500 tablets weighing 0.45kg; Codeine based Syrup: 999 bottles weighing 134.865kg; Pentazocine injections: 4,000 ampoules weighing 16.64kg.\nIn Plateau state, a fake security agent, Babagana Maaji has been arrested through a controlled delivery of 5.6kg cannabis from Lagos.\nWhile commending the officers and men of the various commands for their remarkable efforts, Chairman and Chief Executive of NDLEA, Brig."
  },
  {
    "headline": "Novak Djokovic Loses Australia Visa Appeal, to Be Deported",
    "summarized_story": "Tennis star Novak Djokovic has lost his last-ditch court bid to stay in Australia and is set to be deported.\nJudges rejected his appeal after the government cancelled the unvaccinated player’s visa for a second time this month on public health grounds.\nThe decision has ended the 34-year-old’s hopes of defending his Australian Open title and winning a record 21st Grand Slam.\nThere has been much public anger in Australia over Djokovic’s attempt to enter the country while unvaccinated.\nThe government has repeatedly said that no-one is above the strict rules in place to cope with the pandemic."
  },
  {
    "headline": "2023: North Won’t Vote Based on Sentiments as Done to Buhari, Say Northern Elders",
    "summarized_story": "The elders say they will no longer vote for a candidate based on sentiments as they did for President Muhammadu Buhari in 2015, describing the incumbent as a disappointment to not only the North but the entire country.\nBaba-Ahmed said Nigerians, especially northerners would vote for the best candidate, whether he or she is from the northern or southern part of the country.\n“Northerners were told that if Buhari becomes president, the country would be secured; he will fight corruption; the economy will improve, but now we are worst.\nHe said those who urged the political parties not to field northern candidates are not democrats.\n“That is how we ended up with President Buhari."
  },
  {
    "headline": "President, Others Lay Wreaths to Honour Fallen Heroes",
    "summarized_story": "Our CorrespondentsThe 2022 Armed Forces Remembrance Day was marked yesterday in Abuja with President Muhammadu Buhari presiding.\nActivities to commemorate the Armed Forces Remembrance Day had commenced on October 28, 2021, when the president launched the remembrance emblem at the State House, Abuja.\nTop officials who also laid wreaths include Vice President Yemi Osinbajo, Senate President, Dr Ahmad Lawan; Speaker, House of Representatives, Hon.\nSimilarly, Rivers State Governor, Wike has urged Buhari to stop the incessant killing of Nigerians by Boko Haram groups and bandits.\nThe second meeting is the meeting of all the 36 state governors scheduled for Wednesday to discuss the state of the nation."
  },
  {
    "headline": "OPEC Misses Production Target over Nigeria, Others’ Under-performance",
    "summarized_story": "The development widened the gap between the production quotas set by OPEC and its allies and their actual production.\nThe S&P data showed that OPEC’s 13 countries pumped 28.04 million bpd of crude, up 190,000 bpd from November, while nine non-OPEC partners pumped 13.98 million bpd, an increase of 120,000 bpd.\nBut gains by Venezuela, Kazakhstan, Saudi Arabia, Iraq and Angola far outstripped losses by Libya and Nigeria, making December the 10th straight month that OPEC+ output increased.\nIn addition, Nigeria retained the oil production target of 1.88 million bpd, including condensate production of between 300,000-400,000 bpd, for its revenue calculation in 2022.\nThis is as compared to the output target of 1.86 million bpd the government had set for the 2021 fiscal year."
  },
  {
    "headline": "My Meeting with Tinubu Not About Presidency, Fayemi Clarifies",
    "summarized_story": "This is as Oyo State Governor, Mr. Seyi Makinde, yesterday wished Tinubu well in his 2023 presidential ambition, adding that he would want the best for Nigeria.\nFayemi berated those he described as spin doctors, who claimed that he dropped his veiled presidential ambition at the meeting when nothing of such happened.\nIt is therefore disingenuous of the spin doctors who were nowhere near the venue of the meeting to begin to second guess discussions at the meeting.\n“Fayemi sees Tinubu as his leader in politics and reserves respect for him as a national leader of his party.\nMeanwhile, Oyo State Governor, Makinde, has wished Tinubu, well in his 2023 presidential ambition, but added that he would want the best for Nigeria."
  },
  {
    "headline": "Mali's Former President, Ibrahim Boubacar Keita, Is Dead",
    "summarized_story": "Ex-Malian President, Ibrahim Boubacar Keita, has passed on at the age of 76.\nThe family on Sunday announced the death of the former leader, who led the West African country from 2013 until he was ousted in a coup in 2020, AFP reports.\nIbrahim Keita, Ex-Mali President“President IBK died this morning at 0900 GMT in his home” in Bamako, a family member was quoted as saying.\nKeita was two years into his second five-year term when he was toppled by the military in 2020.\nUnder pressure from the West African bloc ECOWAS, the junta that emerged from the rebellion released Keita on August 27 and returned him to his residence in Bamako, under surveillance."
  },
  {
    "headline": "Mali's Former President, Ibrahim Boubacar Keita, Is Dead",
    "summarized_story": "Ex-Malian President, Ibrahim Boubacar Keita, has passed on at the age of 76.\nThe family on Sunday announced the death of the former leader, who led the West African country from 2013 until he was ousted in a coup in 2020, AFP reports.\nIbrahim Keita, Ex-Mali President“President IBK died this morning at 0900 GMT in his home” in Bamako, a family member was quoted as saying.\nKeita was two years into his second five-year term when he was toppled by the military in 2020.\nUnder pressure from the West African bloc ECOWAS, the junta that emerged from the rebellion released Keita on August 27 and returned him to his residence in Bamako, under surveillance."
  },
  {
    "headline": "BREAKING: NSCDC Rivers Anti-vandals Unit Suspended After Governor Wike’s Outburst",
    "summarized_story": "The Nigeria Security and Civil Defence Corps has disbanded the Anti-vandal Unit of the Rivers State Command of the corps following allegations by the governor of the state, Nyesom Wike.\nSome weeks ago, Wike accused the NSCDC unit and police of aiding and abetting vandals and illegal bunkers to carry out their nefarious activities in the state.\nHe also said the allegations as not being in tandem with his vision for the corps, stressing that he won’t condone any criminal act or act of compromise by any personnel.\nHe assured Governor Wike of getting to the root of the matter without delay, promising more synergy with the state government towards discharging more effective service delivery to the good people of Rivers State.\nWe will investigate those fingered in the allegations and deal decisively with them if found guilty to serve as a deterrent to others."
  },
  {
    "headline": "BREAKING: NSCDC Rivers Anti-vandals Unit Suspended After Governor Wike’s Outburst",
    "summarized_story": "The Nigeria Security and Civil Defence Corps has disbanded the Anti-vandal Unit of the Rivers State Command of the corps following allegations by the governor of the state, Nyesom Wike.\nSome weeks ago, Wike accused the NSCDC unit and police of aiding and abetting vandals and illegal bunkers to carry out their nefarious activities in the state.\nHe also said the allegations as not being in tandem with his vision for the corps, stressing that he won’t condone any criminal act or act of compromise by any personnel.\nHe assured Governor Wike of getting to the root of the matter without delay, promising more synergy with the state government towards discharging more effective service delivery to the good people of Rivers State.\nWe will investigate those fingered in the allegations and deal decisively with them if found guilty to serve as a deterrent to others."
  },
  {
    "headline": "BREAKING: NSCDC Rivers Anti-vandals Unit Suspended After Governor Wike’s Outburst",
    "summarized_story": "The Nigeria Security and Civil Defence Corps has disbanded the Anti-vandal Unit of the Rivers State Command of the corps following allegations by the governor of the state, Nyesom Wike.\nSome weeks ago, Wike accused the NSCDC unit and police of aiding and abetting vandals and illegal bunkers to carry out their nefarious activities in the state.\nHe also said the allegations as not being in tandem with his vision for the corps, stressing that he won’t condone any criminal act or act of compromise by any personnel.\nHe assured Governor Wike of getting to the root of the matter without delay, promising more synergy with the state government towards discharging more effective service delivery to the good people of Rivers State.\nWe will investigate those fingered in the allegations and deal decisively with them if found guilty to serve as a deterrent to others."
  },
  {
    "headline": "'I totally disagree' -- senate spokesman fumes over 'errors' in electoral bill",
    "summarized_story": "Ajibola Basiru, spokesman of the senate, says there is no error in the electoral act amendment bill passed by the upper legislative chamber.\nHe spoke on Sunday at a town hall meeting on the electoral bill organised by Yiaga Africa, a civil society organisation.\nAdvertisementSome civil society organisations (CSOs) also exposed some errors in the bill.\nThe copy of the bill the senate passed has no error.\nLet them [CSOs] bring the source from where they got their errors.”Advertisement“You cannot come on national television and undermine the institution of the national assembly without facts and figures,” he added."
  },
  {
    "headline": "'I totally disagree' -- senate spokesman fumes over 'errors' in electoral bill",
    "summarized_story": "Ajibola Basiru, spokesman of the senate, says there is no error in the electoral act amendment bill passed by the upper legislative chamber.\nHe spoke on Sunday at a town hall meeting on the electoral bill organised by Yiaga Africa, a civil society organisation.\nAdvertisementSome civil society organisations (CSOs) also exposed some errors in the bill.\nThe copy of the bill the senate passed has no error.\nLet them [CSOs] bring the source from where they got their errors.”Advertisement“You cannot come on national television and undermine the institution of the national assembly without facts and figures,” he added."
  },
  {
    "headline": "BudgIT: We've uncovered 460 duplicated projects worth N378.9bn in 2022 budget",
    "summarized_story": "BudgIT, a civic-tech non-profit organisation, says 460 projects amounting to N378.9 billion were duplicated in the 2022 budget.\nOn December 31, 2021, President Muhammadu Buhari signed the N17.13 trillion 2022 appropriation bill into law.\n“Our preliminary analysis of the 21,108 capital projects in the 2022 approved budget revealed 460 duplicated projects amounting to N378.9 billion,” the statement reads.\n“Recall that BudgIT observed 316 duplicated projects inserted into the 2021 FG Budget approved by NASS.\nSpeaking on the findings, Gabriel Okeowo, BudgIT’s country director, described the duplicated projects as “loopholes for fraud”."
  },
  {
    "headline": "BudgIT: We've uncovered 460 duplicated projects worth N378.9bn in 2022 budget",
    "summarized_story": "BudgIT, a civic-tech non-profit organisation, says 460 projects amounting to N378.9 billion were duplicated in the 2022 budget.\nOn December 31, 2021, President Muhammadu Buhari signed the N17.13 trillion 2022 appropriation bill into law.\n“Our preliminary analysis of the 21,108 capital projects in the 2022 approved budget revealed 460 duplicated projects amounting to N378.9 billion,” the statement reads.\n“Recall that BudgIT observed 316 duplicated projects inserted into the 2021 FG Budget approved by NASS.\nSpeaking on the findings, Gabriel Okeowo, BudgIT’s country director, described the duplicated projects as “loopholes for fraud”."
  },
  {
    "headline": "NBA president: Delaying electoral bill may be smokescreen to keep present process for 2023",
    "summarized_story": "Olumide Akpata, the president of the Nigerian Bar Association (NBA), says the issues delaying the approval of the electoral bill may be a “smokescreen” to keep the present provisions for the 2023 polls.\nElectronic transmission of election results and compulsory direct primaries for political parties are among the amendments proposed by the national assembly.\n“Everything rises and falls on leadership; leadership at the executive arm and in the legislature.\nHe had decided that on the basis of that, he is sending it back to the national assembly.\n“Mr President is of the same party as those who control the national assembly."
  },
  {
    "headline": "A year to Nigeria’s 2023 elections, its government lifts Twitter ban",
    "summarized_story": "After 6 months, the Nigerian government has lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nRecall that the Nigerian government suspended Twitter’s operation on June 4, 2021, following the platform’s decision to remove a controversial tweet by the Nigerian President, which it said breached the site’s rules.\nThe Nigerian government has insisted the suspension is a matter of national security and not related to the president’s tweet.\nThe government’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits filed against the Nigerian government; and national assembly hearings held to probe the circumstances leading to the ban.\nIn wake of removal of the suspension, Nigerians have come online to celebrate the end of an era of using VPNs to access Twitter."
  },
  {
    "headline": "Tarneem Saeed: The entrepreneur at the forefront of Sudan’s economic renaissance",
    "summarized_story": "alsoug, founded in 2016 by Tarneem Saeed, is reportedly the biggest tech startup in the country; the funding round speaks to this fact.\nWhat is surprising, however, is that, in a conservative and conflict-torn nation like Sudan, a woman-led company is at the forefront of bringing Sudan’s economy back to health.\nGet the best African tech newsletters in your inboxTarneem Saeed and founding alsougSaeed left Sudan for the first time when she was 14.\nAccording to Saeed, the company has managed to capture the biggest market share because of their operational strategy.\nThe Sudan market is tough, and what helped alsoug was building light as they grew; they didn’t try to overweigh the market all at once."
  },
  {
    "headline": "ThankUCash targets the BNPL opportunity in Africa after raising $5.3m seed",
    "summarized_story": "In Africa, where most people are credit-averse, BNPL activity is just beginning to pick up.\nLast September, Australian company Zip acquired South Africa-based BNPL player Payflex, a deal that indicates Africa may be ripe for buy-now-pay-later services.\nA number of companies—including neobanks, payment service providers, and traditional banks—have already launched or are looking to roll out BNPL services in Africa.\nIn Nigeria, the majority of existing BNPL services are manual, provided by asset financing companies and sometimes merchants themselves.\nUltimately, the customer is buying straight from the merchants,” Ononobi explained in a statement."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "Real estate as NFTs, social media in the metaverse: Projections for blockchain in Africa",
    "summarized_story": "However, Buchi Okoro, CEO of crypto exchange, Quidax, doesn’t think so.\nSocial media is going to the metaverseThe metaverse, NFT, and Web3 were some of the biggest buzzwords of 2021 in the crypto sphere.\nSource: TechnextHanu Fejiro Abodje, CEO of alternative payments solution company, Patricia, has indicated an interest in the Solana blockchain, which has been touted as the Ethereum killer.\nIt brings ease and simplicity to using crypto platforms, reducing the financial barrier of participating in activities such as NFTs and decentralised finance (DeFI).\nAfrican NFT project, Afrobubble, was created on the Solana blockchain because of the ease the chain brings to buying and selling NFTs."
  },
  {
    "headline": "TwitterBan and future shutdowns, Lipa Later’s $12m pre-Series A, Fintech Farm’s $7.4m seed",
    "summarized_story": "Today, I’m discussing:Nigeria’s Twitter ban as a model for future shutdownsLipa Later’s $12 million raiseFintech Farm’s $7.4m funding#TwitterBan Update: A model for future shutdowns?\nBut now, in Nigeria, why would Twitter agree to some of the conditions imposed by the federal government?\nOluwanifemi Kolawole answered my questions and probably some of yours in this article: #Twitterban update: A precedent for future shutdowns?\nLipa Later’s $12 million pre-Series ASource: SuppliedKenyan Buy Now, Pay Later (BNPL) startup, Lipa Later, has raised $12 million in pre-Series A to expand into Nigeria, Ghana, and Tanzania.\nFintech Farm’s $7.4 million seed roundSource: TechcrunchA UK-based fintech startup, Fintech Farm, that creates digital banks in emerging markets, has raised $7.4 million in seed funding to launch neobanks in 8 countries over the next 24 months."
  },
  {
    "headline": "#Twitterban update: A precedent for future shutdowns?",
    "summarized_story": "We are deeply committed to Nigeria, where Twitter is used by people for commerce, cultural engagement, and civic participation.\nOrdinarily, this does not apply to social media sites because they are not under their jurisdiction.\nFar from over: Possible tales of ‘once again’While China is considered the region with the strictest Internet shutdowns, Africa is often regarded as the most volatile environment for social media.\nEthiopia, for instance, has had 12 Internet shutdowns, and as of 2020, Chad had accumulated almost two and a half years of Internet disruptions within five years.\nWhile circumventing social media censorship with VPNs appears to be the easiest way out, the issue of privacy and free speech are still cause for worry."
  },
  {
    "headline": "Why Nigeria’s economy will continue to struggle to grow, EIU",
    "summarized_story": "In addition, the report says rigidities in the foreign-exchange market will become more pronounced when oil earnings decline (as is expected in 2025­26).\nNigeria’s economic growth will also be tempered by high debt-service costs, a large public-sector wage bill and security expenses elevate the spending profile.\nHowever, the report says “these growth rates are well below potential.\n“Royal Dutch Shell is already pursuing divestment of such assets in a push towards a greener portfolio, and other majors could follow.\nThis, the EIU says will ease pressure on Nigeria’s external balance and the naira by the middle of the forecast period."
  },
  {
    "headline": "2023 presidency: Who goes for the Igbo nation?",
    "summarized_story": "And, too early in the day, the Igbo nation and its hapless people are already burdened with confusion as to who goes for them as president.\nMore than ever before, the Igbo nation needs to fight together/pull resources together to be able to fight money bags like Atiku Abubakar and Bola Ahmed Tinubu.\n“For a successful shot at the presidency in 2023, the Igbo nation needs a harmonised approach, which may not come easy, but it is very possible.\nTerming it ‘Igbo Emancipation 2023’, Chigbu Onumah, a lawyer and activist based in Onitsha, Anambra State, noted that the 2023 ambition is achievable for the Igbo nation and that streamlining, fielding a credible candidate, and reaching out to other Nigerians with fairness message will help the Igbos occupy Aso Rock in 2023.\nAccording to him, “Igbo presidency is very realisable; it is far more realisable in 2023 than any other time."
  },
  {
    "headline": "APC gambles with 2023 as convention controversy persists",
    "summarized_story": "If the APC can’t agree on the convention, the opposition will naturally take over,” he said.\nImmediately after the meeting with President Buhari, His Excellency Bagudu announced the agreement reached with President Buhari to the effect that the Convention will hold in February 2022.\n“The truth must be told, the responsibility of organising the February 2022 APC National Convention rests squarely with the CECPC.\nThe Caretaker, especially Governor Buni doesn’t want to take what President Buhari said on NTA for granted”, the source said, pleading for anonymity.\nAkpanudoedehe had on December 20 the meeting of CECPC said the Committee resolved to setup sub-committees on budgeting and other relevant structures for the February National Convention."
  },
  {
    "headline": "How we’re impacting lives, rebuilding Edo communities with interventions to check erosion menace – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his administration will intensify work on intervention programmes to check the menace of gully erosion as part of effort to alleviate the sufferings of residents in erosion-prone communities in the state.\nAddressing journalists after inspecting gully erosion sites in Ogiso Quarters and Urora in Ikpoba-Okha Local Government Area of the state, Obaseki said, “We have started addressing the flood challenges in these areas because before now, this place would be devastated after a rainstorm.\n“For us, it is about rebuilding our communities and improving the lives of our citizens.\nBut let’s not forget that all these won’t have happened without the assistance of the World Bank under the Nigeria Erosion and Watershed Management Project (NEWMAP).\nAn 83-year-old resident in the area, Madam Clara Uhunwonse, praised the governor for the intervention project, which she said has made life better for them."
  },
  {
    "headline": "PDP GOVERNORS MEET IN PORT HARCOURT TO CONSOLIDATE ON RESCUE AND REBUILD NIGERIA PROJECT – Nigerian Observer",
    "summarized_story": "PDP GOVERNORS MEET IN PORT HARCOURT TO CONSOLIDATE ON RESCUE AND REBUILD NIGERIA PROJECTShare FacebookTwitterStumbleuponLinkedInPinterestPORT HARCOURT – The Peoples Democratic Party, PDP Governors Forum will hold a special meeting on Monday 17th January 2022 at the Rivers State Government House, Port Harcourt.\nThe director general, PDP Governors Forum, Hon.\nMaduabum, said the meeting will review the state of the States, the state of the nation and readiness of the PDP to provide the necessary leadership to rescue and rebuild Nigeria.\n“All the elected PDP Governors are expected to attend the meeting to be presided over by the Chairman of the Forum, Rt Hon Aminu Waziri Tambuwal, CFR.\n“The meeting will be preceded by a Gala night to be hosted by the Chief Host, His Excellency, Governor Nyesom Ezenwo Wike, CON."
  },
  {
    "headline": "Obaseki: Decentralised healthcare system ‘ll improve efficient, quality healthcare delivery to Edo people – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has assured Edo residents that the state government’s policy on decentralising healthcare system will enhance the efficiency, accessibility and quality of healthcare service delivery in the state.\nThe governor said this after inspecting ongoing construction work at the Stella Obasanjo Hospital in Benin City, Edo State capital.\n“It is only based on reference from these units that you now come to a specialist hospital.\n“The Stella Obasanjo Hospital was a mother and child hospital before the outbreak of the COVID-19, but has been expanded to provide other services.\nWe are not phasing out the specialist hospital but upgrading the hospital,” the commissioner said."
  },
  {
    "headline": "Governor Obaseki Receives Award of Honor – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Centre for Edo Delta Development Initiative (CEDDI) has bestowed an award of honor on the Governor of Edo State, Mr. Godwin Obaseki in recognition of his humanitarian activities in the state.\nAndrew Emwanta received the award on behalf of the Governor at CEDDI’s 6th graduation, 7th matriculation ceremony and 10th anniversary which held in Benin City.\nEmwanta reinstated the commitment of the Obaseki’s administration to youth empowerment which he said was the reason the Governor has partnered with CEDDI.\n“This award is in recognition of what the People’s Governor, Mr. Godwin Obaseki is doing and is because he believes in initiatives like this that he’s supported the activities of CEDDI.\nEarlier, the founder of CEDDI, Chief Sam Igbe, the Iyase of Benin appreciated the Governor for supporting and partnering with centre."
  },
  {
    "headline": "Osun APC Apex Body, Igbimo Agba Rejoices, Obokun East LCDA Chairman, Bamidele facilitate with Chief Bisi Akande @83",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe apex body of Osun state chapter of All Progressives Congress (APC) Igbimo Agba and Caretaker chairman for Obokun East Local Council Development Area, LCDA Ilare Ijesha, Hon.\nBello Saliu Bamidele have rejoiced with the former Interim National Chairman of the party, Chief Adebisi Akande as he clocks 83 years on earth.\nIgbimo Agba in a congratulatory message issued and signed by its chairman, Chief Sola Akinwumi copies of which were made available to newsmen in Osogbo on Sunday.\nI pledge this body’s continued prayers and supports in your endeavors.”Similarly, Obokun East Caretaker chairman Saliu Bamidele joined other Progressives to celebrate Chief Akande.\nAccording to him, “Baba omo keekeeke” as he used to called has impacted positively to the progressive politics in Osun state the fruit of which all are reaping today."
  },
  {
    "headline": "2023: Reconcile with Igbo youths – Elliot Uko appeals to Southeast leaders",
    "summarized_story": "Have they ever wondered how they are perceived by the angry younger generation?\nThe younger generation are educated, suave, urbane, articulate and social media savvy.\nWhat is true rather, is that the leadership cadre should ask themselves : how come our younger generation lost confidence in us?\nIf all eligible Igbo voters register and vote, Ndigbo could boast of over 25 million votes and nobody can lead Nigeria without them.\nIncidentally, millions of Igbo youths are angry with Nigeria, and don’t want to hear about Nigerian elections, and we still insist on calling them miscreants."
  },
  {
    "headline": "For The Record: Southern and Middle Belt Leaders Demand Power Shift, Restructuring – Full Communique",
    "summarized_story": "COMMUNIQUE ISSUED AT THE END OF A MEETING OF THE SOUTHERN AND MIDDLE BELT LEADERS’ FORUM HELD ON THURSDAY, 13TH JANUARY, 2022A meeting of the Southern and Middle Belt Leaders’ Forum (SMBLF), held on Thursday, 13th January 2022 in Abuja under the Chairmanship of the Leader and Elder Statesman, Chief Dr. E. K. Clark, OFR, CON.\nIn attendance at the meeting were delegations from the four regional socio-cultural organisations, that’s: Afenifere for the South West, Ohanaeze Ndigbo for the South East, Pan Niger Delta Forum (PANDEF) for the South-South and the Middle Belt Forum (MBF) for the Middle Belt.\nTHEREFORE, UNEQUIVOCALLY, AND IN FULL RESOLVE, CALL ON ALL POLITICAL PARTIES IN THE COUNTRY TO ZONE THEIR PRESIDENTIAL TICKETS TO THE SOUTH;iv.\nUrges Governors and members of the National Assembly of the four regions to commit themselves to the subject of Restructuring;ix.\nSigned:Chief Dr. E. K. Clark, OFR, CON – LeaderChief Ayo Adebanjo – Leader, AfenifereProf. George Obiozor – President-General, Ohanaeze NdigboDr. Pogu Bitrus – National President, Middle Belt Forum"
  },
  {
    "headline": "Osun PDP Aspirant, Dele Adeleke eulogises Isiaka Adeleke on 67th posthumous birthday",
    "summarized_story": "By Sunday Oguntuyi, OsogboA leading governorship aspirant on the platform of the Peoples Democratic Party (PDP) in Osun State, Mr. ‘Dele Adeleke, has eulogised the first Civilian Governor of the state, Late Sen. Isiaka Adetunji Adeleke on his 67th posthumous birthday, describing him as a father of modern politics.\nWhen you moved, all men knew a great man has moved.\n“De Guv, you were a great man in every ramification.\n“Thank you for sharing your great life with us.\n“Happy 67th Posthumous birthday, dear Mentor, Leader and Distinguished Sen. Isiaka Adetunji Adeleke."
  },
  {
    "headline": "Why Two-thirds Of Lawmakers May Not Return To NASS",
    "summarized_story": "The APC Senatorial ticket for Ararume is a walkover if the battle is left between him and Ibezim.\nObviously, the senators do not have the backing of the state governor as supporting their return to the red chamber amounts to anti-party activity.\nBesides, he has the backing of the state governor Inuwa Yahaya as the governor attends any political gathering organised by him.\nEmerengwa will be struggling it out with the chairman of Ikwerre local government area of the state, Hon.\nCross River is predominantly a PDP state, despite the fact that the state governor is of the APC."
  },
  {
    "headline": "Field Unqualified Candidate, Pay N0.5m Fine, INEC Warns Political Parties",
    "summarized_story": "The Independent National Electoral Commission (INEC) has warned that any political party that presents a candidate that does not meet the qualifications stipulated in the Constitution and the Electoral Act would be guilty of an offence and on conviction, liable to a fine of N500,000.\nThe commission appealed to citizens who applied for fresh registration as well as transfers and replacement of the PVCs to do so immediately and avoid last last-minute rush for the cards like in the past.\nADVERTISEMENTIt said the FCT was the only part of Nigeria where INEC conducts local government elections and a total of 475 candidates sponsored by all the 18 political parties are vying for the 68 constituencies involving six area council chairmen and 62 councilors.\n“Political parties must conduct their primaries including resolution of disputes arising from the primaries between 26 January and 5th February 2022 while the last day for submission of list of nominated candidates is 6 pm on the ninth of February which must be done through the Commission’s online nomination portal,” it said.\nIt, however, reminded political parties that the aspirant with the highest number of votes at the end of voting shall be declared the winner of the primary of the party and the aspirant’s name shall be forwarded to the Commission as the candidate of the party."
  },
  {
    "headline": "REMEMBRANCE DAY: Buhari, Governors, Others Pay Tribute To Fallen Heroes",
    "summarized_story": "President Muhammadu Buhari and governors of the 36 states of the federation yesterday led Nigerians to honour and pay glowing tributes to fallen heroes during the 2022 Armed Forces Remembrance Day across the country.\nOn October 28, 2021 President Buhari kick started activities to mark this year’s Armed Forces Remembrance Day when he launched the remembrance emblem at the presidential villa.\nHe made the call while responding to questions from journalists after laying the wreath during the Armed Forces Remembrance Day celebration in Kano.\nZulum launched the 2022 Armed Forces Remembrance Day and emblem appeal week with the sum of N10 million.\nChairperson of MIWA, Mrs Like Ugoagha, made the appeal during the 2022 Armed Forces Remembrance Day celebration at Cenotaph, Unity Square, Abakaliki."
  },
  {
    "headline": "REMEMBRANCE DAY: Buhari, Governors, Others Pay Tribute To Fallen Heroes",
    "summarized_story": "President Muhammadu Buhari and governors of the 36 states of the federation yesterday led Nigerians to honour and pay glowing tributes to fallen heroes during the 2022 Armed Forces Remembrance Day across the country.\nOn October 28, 2021 President Buhari kick started activities to mark this year’s Armed Forces Remembrance Day when he launched the remembrance emblem at the presidential villa.\nHe made the call while responding to questions from journalists after laying the wreath during the Armed Forces Remembrance Day celebration in Kano.\nZulum launched the 2022 Armed Forces Remembrance Day and emblem appeal week with the sum of N10 million.\nChairperson of MIWA, Mrs Like Ugoagha, made the appeal during the 2022 Armed Forces Remembrance Day celebration at Cenotaph, Unity Square, Abakaliki."
  },
  {
    "headline": "Excise Duty On Drinks Negates FG’s Economic Recovery, Job Creation Aspirations– OPS",
    "summarized_story": "Labour unions and the Organised Private Sector (OPS) have said the reintroduction of excise duty on drinks in the country negates the federal government’s aspiration on economic recovery and job creation.\nThe federal government had earlier announced the introduction of excise duty of N10 per litre on all non-alcoholic, carbonated and sweetened beverages in the country.\nADVERTISEMENTExcise duty refers to a form of tax imposed on the production, licensing and sale of goods.\nThe citizens and the business community, he said, are already experiencing a galloping and volatile inflationary condition, stressing that the excise duty is also a negation of the economic recovery, job creation and poverty reduction aspirations of the federal government.\nThe millions of micro enterprises in the soft drinks’ fruit juice distribution chain will be adversely impacted by the imposition of the excise tax,” he said."
  },
  {
    "headline": "Again, gunmen kill three, kidnap 28 in Niger State",
    "summarized_story": "Three people have been killed and 28 abducted by gunmen in Farin-Shinge, Kulho, Jigawa and Dogo Fadama communities of Mashegu Local Government Area of Niger StateThe abductions and killings were carried out from Friday afternoon to Saturday morning in the communities.\nAnother group of gunmen were said to have attacked Jigawa, Dogo Fadama and surrounding communities, killing two people while four others were abducted.\nAccording to Umar Mohammed, a resident of Jigawa community, the gunmen conducted a house-to-house search, rustling cattle and abducting people.\nIn the Kulho community, the gunmen began the attack at around 3.30pm and ended the operation at about 6pm.\nA resident named Tanko Kulho was shot dead and 16 people were abducted while shops were looted and over 18 motorcycles stolen by the gunmen."
  },
  {
    "headline": "Again, gunmen kill three, kidnap 28 in Niger State",
    "summarized_story": "Three people have been killed and 28 abducted by gunmen in Farin-Shinge, Kulho, Jigawa and Dogo Fadama communities of Mashegu Local Government Area of Niger StateThe abductions and killings were carried out from Friday afternoon to Saturday morning in the communities.\nAnother group of gunmen were said to have attacked Jigawa, Dogo Fadama and surrounding communities, killing two people while four others were abducted.\nAccording to Umar Mohammed, a resident of Jigawa community, the gunmen conducted a house-to-house search, rustling cattle and abducting people.\nIn the Kulho community, the gunmen began the attack at around 3.30pm and ended the operation at about 6pm.\nA resident named Tanko Kulho was shot dead and 16 people were abducted while shops were looted and over 18 motorcycles stolen by the gunmen."
  },
  {
    "headline": "Dangote advocates Unity, Cooperation among Africans to get global recognition",
    "summarized_story": "By KEN EMORDI…As Afreximbank launches centralised payment, settlement infrastructure platform for intra-African tradeACCRA – President of Dangote Group, Aliko Dangote, has charged African leaders and citizens to be united in the promotion of the continent’s intrinsic greatness through improved trade relations amongst African countries.\nHe asserted that improved trade relations would greatly enhance the speed of recovery across Africa, noting that it had the potential to boost the level of economic activities through intra-Africa trade.\nHe equally expressed optimism that PAPSS would enhance the volume of trade among countries, which were hitherto not recorded or were overlooked because of the informal approach towards these transactions.\nDangote noted the enormous potential and benefits of PAPSS, but nevertheless warned that such projects had their teething issues.\nHe therefore urged regulators and participants across the continent to look beyond any such operational challenges and ensure a successful implementation of the PAPSS."
  },
  {
    "headline": "Dangote advocates Unity, Cooperation among Africans to get global recognition",
    "summarized_story": "By KEN EMORDI…As Afreximbank launches centralised payment, settlement infrastructure platform for intra-African tradeACCRA – President of Dangote Group, Aliko Dangote, has charged African leaders and citizens to be united in the promotion of the continent’s intrinsic greatness through improved trade relations amongst African countries.\nHe asserted that improved trade relations would greatly enhance the speed of recovery across Africa, noting that it had the potential to boost the level of economic activities through intra-Africa trade.\nHe equally expressed optimism that PAPSS would enhance the volume of trade among countries, which were hitherto not recorded or were overlooked because of the informal approach towards these transactions.\nDangote noted the enormous potential and benefits of PAPSS, but nevertheless warned that such projects had their teething issues.\nHe therefore urged regulators and participants across the continent to look beyond any such operational challenges and ensure a successful implementation of the PAPSS."
  },
  {
    "headline": "Face of British hostage taker Malik Faisal Akram [Family statement]",
    "summarized_story": "The face of Malik Faisal Akram, the British hostage taker in Colleyville synagogue in Texas has now been revealed as the FBI takes his investigation to the UK.\nAccording to Faisal’s brother, Gulbar, the FBI will be coming to the UK on further investigation about the hostage taker.\nRelated News British hostage taker Malik Faisal Akram had mental health issues: BrotherBreaking: All Colleyville synagogue hostages released, gunman shot deadUpdated: FBI takes over talks with Colleyville synagogue hostage taker A few minutes later a firefight has taken place and he was shot and killed.\nThe FBI are due to fly into the UK later today so we don’t have much else to share at the moment.\nThe Blackburn Muslim Community issued a different statement that further defined Faisal and wished him “highest ranks of Paradise”."
  },
  {
    "headline": "Australia confirms 3-year visa ban for Djokovic",
    "summarized_story": "Novak Djokovic will be banned from Australia for three years after his visa cancellation was upheld, Minister of home affairs Karen Andrew said on Monday.\n“The outcome of the process that went before the Federal Court and their determinations – the visa was cancelled by [immigration] minister Hawke.\n“That cancellation was upheld by the Federal Court, so as a result of that, he will be banned from entry for three years into the country.\nThe visa saga began after Djokovic was held at an airport in Melbourne when he arrived in the country on January 6.\nBut immigration minister Hawke used his powers to again cancel the visa on Friday and Djokovic left Australia late on Sunday."
  },
  {
    "headline": "2023: Why I Will Win Presidential Election — Bola Tinubu",
    "summarized_story": "Bola Tinubu, a presidential candidate, has stated that he believes he would win the 2023 election.\nTinubu predicted that he will win the election in 2023 with the “solid backing” of the people.\nWhen he paid a visit to ex-Oyo State Governor Rashidi Ladoja’s home yesterday, APC National Leader Atiku Abubakar revealed this.\nTinubu, on the other hand, acknowledged that there might be difficulties, but said he would overcome them.\nAccording to Tinubu: “Life is a challenge and you must be ready to confront challenges and overcome."
  },
  {
    "headline": "BREAKING: ISWAP Fighters Attack Biu In Southern Borno",
    "summarized_story": "Fighters of the Islamic State West Africa Province on Saturday, attacked Mainahari community near Wakabiu in the Biu Local Government Area of Borno State, The PUNCH has learnt.\nAccording to a source from the Army Barrack in Biu, the insurgents threw bombs to the village around 3pm today.\nHowever, the insurgents were successfully repelled by men of the Nigerian Army.\nThen we heard that they were trying to enter Mainahari village near Wakabiu but the army were on alert and they immediately engaged the insurgents.\nThis attack followed an alleged attack by the ISWAP terrorists on Friday in Biu town after attacking the army institute of peace and war college Buratai barely five days ago."
  },
  {
    "headline": "Abuja: 36 Governors To Hold NGF Meeting Tuesday",
    "summarized_story": "The Chairman of the Nigeria Governors’ Forum and Governor of Ekiti State, Dr Kayode Fayemi, has invited all the other 35 Governors to a “very crucial meeting where pressing national concerns will be discussed.”The meeting is slated for 8:00 pm on Wednesday, January 19, 2022, at the NGF Secretariat in Abuja.\nThe Head, Media and Public Affairs, Nigeria Governors’ Forum Secretariat, Abdulrazaque Bello-Barkindo, disclosed this in a statement signed on Saturday titled ‘NGF Meeting’.\nAccording to an invitation issued by the Director-General of the Forum, Asishana Okauru, and sent to all the respective Governors, the meeting, which is the first in 2022, will be in-person as opposed to virtual.\nThis, he said, is to effectively convey the messages of the meeting which are all characterised under the second item of the agenda titled ‘matters arising.’To also feature prominently are the interventions programs such as the regular updates from the Nigeria Governors’ Forum State Fiscal Transparency, Accountability and Sustainability Program team and another on Coronavirus Aid, Relief and Economic Security as well as others.\nThe NGF Chairman, accompanied by all the 36 Governors, will thereafter address a press conference."
  },
  {
    "headline": "BREAKING: Super Eagles Qualify For AFCON 2021 Knockout Stage",
    "summarized_story": "Following a 3-1 win over Sudan on Saturday, Nigeria advanced to the knockout stages of the 2021 Africa Cup of Nations.\nThe Super Eagles had beaten Egypt 1-0 in their first Group D fixture.\nAgainst the Sudanese, goals from Samuel Chukwueze, Taiwo Awoniyi and Moses Simon gave the three-time champions a three-goal lead.\nAlthough Sudan pulled one back, it was merely a consolation goal.\nNigeria top the group with six points ahead of the Egypt vs Guinea-Bissau game."
  },
  {
    "headline": "[Breaking] AFCON 2021: Great upset as Equitorial Guinea end Algeria ‘s 35-match unbeaten run",
    "summarized_story": "Algeria’s 35-match unbeaten streak was ended in stunning fashion by Equatorial Guinea to leave the defending champions in real danger of crashing out in the group stage of the Africa Cup of Nations.\nEsteban Obono’s back post finish on 70 minutes proved the only goal of the game as the side ranked 114th in the world became the first side to beat Algeria since Benin did so back in October 2018, the run ending two short of Italy’s world record 37 games without loss.\nThe result leaves the holders rock bottom of Group E on just one point, having been held to a goalless draw by Sierra Leone in their opening fixture.\nThey must now beat Ivory Coast – who are top on four points – in their final game to keep alive their hopes of retaining the trophy they won in Egypt three years ago.\nAlgeria thought they had taken the lead midway through a scrappy first half when Baghdad Bounedjah tapped in the rebound after Riyad Mahrez’s header had been saved but the flag was raised against the Manchester City winger."
  },
  {
    "headline": "Pictures: Igoche promises more domestic basketball games as 2022 Mark D Ball dunks off amidst glamour",
    "summarized_story": "The 2022 edition of Mark D Ball women’s basketball championship got underway on Saturday evening, with Sunshine Angels of Akure out-dunking Hotcoal Slizzers of Abuja 28-20.\nMark said the New Face of Basketball is a project focused on the reviving the domestic component of the slam and dunk game.\n“Even if we cannot play 82 games, let’s play something close.\nThis is what the New Face of Basketball is all about,” Mark stated.\nWe have a lot of sponsors who still believe that Nigeria basketball can still rise again, we approached them and they obliged our request,” Mark added."
  },
  {
    "headline": "Breaking: I’m disappointed, Novak Djokovic gives up, set to be deported, misses Australian Open",
    "summarized_story": "Tennis star Novak Djokovic has lost his last-ditch court bid to stay in Australia and is set to be deported.\nJudges rejected his appeal after the government cancelled the unvaccinated player’s visa for a second time this month on public health grounds.\nThe decision has ended the 34-year-old’s hopes of defending his Australian Open title and winning a record 21st Grand Slam.\nThere has been much public anger in Australia over Djokovic’s attempt to enter the country while unvaccinated.\nThe government has repeatedly said that no-one is above the strict rules in place to cope with the pandemic."
  },
  {
    "headline": "Why Electoral Bill Should Be Passed Immediately – Jega",
    "summarized_story": "﻿Former Chairman of the Independent National Electoral Commission (INEC), Professor Attahiru Jega, has urged the National Assembly and President Muhammadu Buhari to immediately pass the Electoral Act Amendment Bill 2021.\nAccording to him, the passage of the bill will go a long way in improving the integrity of Nigeria’s elections.\nThe former INEC Chairman, therefore, asked the government to do everything possible to ensure that the country goes into the next election with a new bill.\n“A good legal framework helps to create elections with integrity and electoral integrity helps to enhance democratic consolidation and the preparation and conduct of elections democratically.\n“We already have some fundamental elements that can improve the integrity of the elections, let this be passed immediately, drop this issue of direct primaries, think more seriously about it."
  },
  {
    "headline": "Gunmen Abduct 15 In Niger State – Police",
    "summarized_story": "Gunmen have abducted 15 persons in Niger State.\nThe Niger State Command, Police Public Relations Officer, DSP Wasiu Abiodun, confirmed this in a statement on Sunday.\nAccording to Abiodun, the criminals had stormed the remote community via Ibbi in Mashegu Local Government Area and also rustled a yet-to-be known number of cattle.\nThey were also said to have broken into a provision shop at Kawo Village.\nThe PPRO noted that a team of police/vigilante have been drafted to the area for search and rescue of the abducted victims."
  },
  {
    "headline": "SERAP Writes Buhari, Seeks ‘Copy Of Agreement With Twitter’",
    "summarized_story": "“This means that any conditions for lifting the suspension of Twitter must meet the requirements of regular legal processes and limit government discretion.\nThese open-ended terms and phrases may be used to suppress the legitimate exercise of human rights online.\n“SERAP notes the interdependence of human rights, such as the importance of privacy as a gateway to freedom of expression.\nThe decision to lift the suspension was reportedly based on the recommendations by the Technical Committee on Nigeria-Twitter Engagement.\n“SERAP notes that Alhaji Lai Mohammed on 5th June 2021, announced the suspension of operation of Twitter by the Federal Government, following which a seven-man Presidential Committee was set up to engage Twitter Inc."
  },
  {
    "headline": "NDLEA Intercepts 1.5 Million Tramadol Tablets In Edo",
    "summarized_story": "About one million, five hundred thousand tablets and capsules of pharmaceutical opioids such as Tramadol, Exol-5, and Diazepam loaded in Onitsha, Anambra state and heading to Yauri, Kebbi state have been intercepted in Edo state by operatives of the National Drug Law Enforcement Agency, (NDLEA).\nAccording to NDLEA spokesman, Femi Babafemi, the agency intercepted the drugs on Friday 14th January, the same day 425,000 Diazepam tablets were recovered at Segemu, Kano.\nThe drugs seized include: 394,480 capsules and 3,000 tablets of Tramadol weighing 83.707kg; Exol-5: 647,500 tablets weighing 203.315kg; Diazepam: 12,500 tablets weighing 2.05kg; Bromazepam: 1,500 tablets weighing 0.45kg; Codeine based Syrup: 999 bottles weighing 134.865kg; Pentazocine injections: 4,000 ampoules weighing 16.64kg.\nIn Plateau State, a fake security agent, Babagana Ma’aji has been arrested through a controlled delivery of 5.6kg cannabis from Lagos.\nWhile commending the officers and men of the various commands for their remarkable efforts, the Chairman/Chief Executive of NDLEA, Brig."
  },
  {
    "headline": "Omicron: FG Asks Saudi Arabia To Lift Travel Restrictions On Nigeria",
    "summarized_story": "The Federal Government has asked Saudi Arabia to lift the travel restrictions it imposed on Nigerian travellers following the outbreak of the omicron variant of the COVID-19 in South Africa that was later discovered among some travellers said to have visited Nigeria.\nAmbassador Zubairu Dada, the Minister of State for Foreign Affairs, made the appeal on Saturday when he met with the Saudi Arabian Ambassador to Nigeria, Ambassador Faisal bin Ebraheem Al-Ghamdi.\nThis is as he pledged to continue to give every necessary support and cooperation to the ambassador in the discharge of his responsibility.\nHe equally lauded the Minister for his commitment to improved bilateral relations with the Kingdom of Saudi Arabia.\nSaudi Arabia imposed a temporary ban on flights from Nigeria in December amid the Omicron variant of COVID in Nigeria."
  },
  {
    "headline": "Tinubu visits Ogbomosho, commiserates with Soun, Akala's families",
    "summarized_story": "The national leader of the All Progressives Congress and 2023 Presidential aspirant, Asiwaju Bola Tinubu, has visited the family of the late Christopher Alao-Akala in Ogbomosho.\nThe visit was to commiserate with with his family over the demise of the former governor of Oyo state.\nHe also paid condolence visit to the family of late Soun of Ogbomosho, Oba Jimoh Oyewunmi Ajagungbade III."
  },
  {
    "headline": "Updated: Tinubu visits Zamfara, appeals for continued prayer for peace",
    "summarized_story": "The National Leader of the APC, Asiwaju Bola Tinubu has visited Zamfara to commiserate with Governor Bello Matawalle and residents of the State over the incessant killings by bandits.\nOla Awakan reports that the incessant killings by bandits in Zamfara has become a course of worry to Nigerians.\nWithin the first two weeks of January 2022 hundreds of people are reported to have been killed in Zamfara.\nNational leader of the APC, Asiwaju Bola Tinubu was received in the Government house as he condemned the killings by bandits.\nGovernor Bello Matawalle responded by thanking Bola Tinubu for his show of life."
  },
  {
    "headline": "Ezekwesili heads 80-man transition committee in Anambra",
    "summarized_story": "Anambra State government has announced an 80-man transition committee to ensure a seamless transition from the Governor Willie Obiano’s administration to a Chukwuma Charles Soludo-led administration as from 17th March, 2022.\nThis was disclosed a statement issued on Thursday by Joe Anatune, Media Assistant to the Anambra State Governor-Elect, Chukwuma Soludo Secretariat.\nThe members include:1) Mrs Oby Ezekwesili — Chairperson2) Prof. Benedict Okey Oramah3) Rt.\nIfeanyi Okeoma68) Amb Uche Ajulu-Okeke69) Chief Pat Ubajaka70) Prof. Okey Ikeanyibe71) Comrade Charles Onyeagba72) Prof.\nAu Nnonyelu73) Dr. Forster E. Ihejiofor74) Mr. Odera Ozoka75) Mr. ThankGod Ibeh76) Prof. Sylvia Chika Ifemeje77) Mr. Kanayo Nwafor78) Comrade Churchill Okonkwo79) Sir Damian Okolo80) Dr. Chinedu Onyeizugbe"
  },
  {
    "headline": "February APC National Convention requires no consultation",
    "summarized_story": "The Director General Of the Progressives Governors Forum, Salihu Lukman, has said that the February date for the National Convention of the National Convention requires nor consultation.\nMr Lukman said the more the party continue to allow the leadership of the Caretaker Extraordinary Convention Planning Committee to refuse to commence the process of organising the February APC National Convention, the more party leaders would have supported the CECPC in weakening the electoral prospect of the APC.\nPresident Muhammadu Buhari had agreed to February for the party’s national convention, but the body language of the Caretaker Committee suggest otherwise.\nMr Lukman suggest that the APC must not make the mistake of orientating it’s internal party mobilisation for the emergence of candidates for 2023 elections, especially Presidential Candidate only based on personality contest.\nHe appeal to party stakeholder, as the first challenge is to ensure that the CECPC has no option but to organise the APC National Convention in February as decided based on all the consultations that has taken place, and failure to do otherwise will mean going against president Muhammadu Buhari’s order."
  },
  {
    "headline": "Aisha Yesufu: ‘Young Nigerians Must Approach Elections With Independence, Don’t Be Deceived Again’",
    "summarized_story": "Human rights activist and good governance advocate, Aisha Yesufu, outlines what young Nigerians must do to elect a more responsible leadership in 2023."
  },
  {
    "headline": "Toppled Malian President Keita Dies in Bamako Aged 76",
    "summarized_story": "Former Malian President Ibrahim Boubacar Keita, who was toppled in the August 2020 military coup led by Col Assimi Goita died in Bamako on Sunday aged 76.\nHe resigned and was detained by the Goita regime.\nHe was later freed and allowed to travel to the United Arab Emirates on several occasions for medical treatment.\nSoumaila Cisse, Keita’s opponent in the 2018 presidential election died in 2020 from Covid-19 after his release from abduction by armed groups in northern Mali.\nECOWAS has suspended Mali and slammed it with harsh and controversial financial and border blockage after the Goita-led junta announced a 5-year delay to its transition timetable."
  },
  {
    "headline": "No Title Defence for Djokovic as World No 1 Deported from Australia",
    "summarized_story": "Instead of starting the defence of his Australian Open title on Monday, Novak Djokovic was on his way home, a stunning and unprecedented end to his run of success at Melbourne Park.\nThe ruling was made less than 18 hours before the first Grand Slam matches of 2022 were scheduled to begin.\nDjokovic’s dominance in Grand Slam play of late has been particularly impressive, winning four of the last seven major tournaments and finishing as the runner-up at two others.\nOn Monday night, Djokovic was supposed to play Miomir Kecmanovic, a Serbian ranked 78th, at Rod Laver Arena, the main stadium.\nAustralian Prime Minister Scott Morrison has defended Australia’s tough border policies since Djokovic was detained, tweeting that “rules are rules” on that day."
  },
  {
    "headline": "Expect More Worrisome Variants after Omicron, Scientists Say",
    "summarized_story": "Scientists warn that omicron’s whirlwind advance practically ensures it won’t be the last version of the coronavirus to worry the world.\n“The faster omicron spreads, the more opportunities there are for mutation, potentially leading to more variants,” Leonardo Martinez, an infectious disease epidemiologist at Boston University, said.\nWhen new variants do develop, scientists said it’s still very difficult to know from genetic features which ones might take off.\nFor example, omicron has many more mutations than previous variants, around 30 in the spike protein that lets it attach to human cells.\nTo curb the emergence of variants, scientists stress continuing with public health measures such as masking and getting vaccinated."
  },
  {
    "headline": "Hostages Safe After Texas Synagogue Standoff; Captor Dead",
    "summarized_story": "But DeSarno said the agency’s investigation “will have global reach.”It wasn’t clear why the attacker chose the synagogue.\nShe said she heard the man rant against America and claim he had a bomb.\n“He was clearly in extreme distress.”Francis, who grew up near Colleyville, tuned in after she read about the hostage situation.\nYou know, it’s a small town and it’s a small congregation,” Eisen said as the hostage situation was ongoing.\n“No matter how it turns out it’s hard to fathom how we will all be changed by this, because surely we will be.”President Joe Biden issued a statement thanking law enforcement after the hostage situation ended."
  }
]