[
  {
    "headline": "Ganduje bans thugs from political gatherings",
    "summarized_story": "Governor Abdullahi Ganduje of Kano State has banned political thugs at events and gatherings across the state.\n“We will not accept this and I assure you that I will deal, with any politician who violates this warning.\n“During the flag-off ceremony of Kano-Gwarzo-Dayi Road, on the same day, political thugs engaged in unbecoming conduct.\n“I will personally order the arrest and prosecution of anyone caught brandishing weapons on the occasion.\n“Our politics in Kano is based on good reasoning and knowledge, focusing on good agenda and not that of irresponsibility and madness,” he said."
  },
  {
    "headline": "31 years after, MOUAU yet to receive take-off grant – VC",
    "summarized_story": "Thirty-one years after establishment, Michael Okpara University of Agriculture, Umudike, Abia State is yet to receive its take-off grant.\nThe Vice-Chancellor, Prof. Maduebibisi Ofo Iwe disclosed this in Umuahia while briefing newsmen on his activities within his first 100 days in office, stating that by 1993, the take-off grant was about N1billion naira.\nThe VC, however, said that following the current economic realities in the country, the university submitted a bill of N10 billion to the federal government through its visitation panel.\nProf. Iwe disclosed also that his administration has restored full peace with host communities adding that while having received the support of their traditional rulers, the University Women Association has also fashioned out modalities to strengthen the university’s “relationship with the women in the host communities.”Read AlsoApart from establishing a robust students’ welfare relationship through an open-door approach, the VC said his administration has started addressing staff welfare issues as Hazard Allowance and payment of arrears of two years accumulated Responsibility Allowance “to deserving staff.”He disclosed that within this period, has restored school bus shuttle services, university Microfinance Bank, full implementation of e-Senate and NiMet Partnership that would equip the university’s meteorology laboratory with state-of-the-art equipment, “possibly at no cost to the university”.\nAccording to him, he has also revived and funded its Agricultural Graduate Loan Scheme and procured land clearing and farming equipment for profitable land utilisation."
  },
  {
    "headline": "Jubilee syringe factory expands production",
    "summarized_story": "…As NMA Applauded Gov Emmanuel for making A’Ibom workers highest paid in NigeriaAfrica’s largest syringe production company, Jubilee Syringe Factory in Akwa Ibom State is set to expand its scope of production to cover varieties of medical consumables, as the government doubles efforts to suitably position the state as a budding medical tourism destination.\nThe state governor, Mr. Udom Emmanuel, dropped the hint while playing host to a delegation of the Akwa Ibom Chapter of Nigerian Medical Association, NMA, at Government House, Uyo.\nAffirming his administration’s resolve to ensure a holistic approach in consolidating the state’s healthcare sector, Governor Emmanuel said the Jubilee Syringe Factory, beyond its reputation of largest syringe production capacity in Africa, will soon venture into production of all plastic medical consumables, assuring that the state-of-the-art Akwa Ibom State University Teaching Hospital, AKSUTH, underway, will be a model tertiary hospital.\n“Not just the syringe, we are starting other consumables; everything plastic consumable in the medical line, like all those gloves.\n…We need a lot of your support in setting up our Teaching Hospital and we really mean business about that."
  },
  {
    "headline": "June 12: Buhari did well to immortalise MKO Abiola — Fani-Kayode",
    "summarized_story": "By Idowu BankoleA former Aviation Minister and foremost PDP chieftain, Chief Femi Fani-Kayode has praised President Muhammadu Buhari for immortalising the late winner of the 1993 presidential elections, Chief Moshood Kashimawo Abiola, MKO, by renaming June 12 as Nigeria’s democracy day.\nBuhari had in a nationwide broadcast last year renamed June 12 a National democracy day.\nJune 12 used to be a special day to commemorate MKO Abiola in Lagos and in some southwestern states in Nigeria until it was renamed by President Buhari.\nAgain the same Buhari he removed from power in 1985 was the one that, 35 years later, and once back in power, apologised for the annulment of his 1993 pres.\nNo matter what u say or think about Buhari, he did well on this one!” He noted."
  },
  {
    "headline": "Nollywood yet to marry storytelling with technicalities ― Elenini producers",
    "summarized_story": "By Ayo OnikoyiAllen Onyige and Adeniyi Joseph Omobulejo are the producers of Yoruba drama series, Elenini currently running on GOTV/DSTV Nigeria and both are graduates of Multichoice Talent Factory.\nNollywood has not been able to marry storytelling and the technicalities of storytelling.\nALLEN ONYIGE:One great thing about the Yoruba movie industry is that they have a loyal audience, despite the inadequacies.\nIf this problem is efficiently addressed, I’m confident the Yoruba movie industry will get the accolades that it deserves.\nI started a production company called Nostalgia Media Agency in 2016, where we create content for brands and are also the producers of ELENINI."
  },
  {
    "headline": "Ugwuanyi’s six years of laudable democracy in Enugu state",
    "summarized_story": "It is, hence, arguable that no state in Nigeria other than Enugu state has ever conceived this kind of initiative.\nA tour to most of the communities in Enugu state would leave one astounded as more works are being executed on daily basis.\nwhich will be a topic for another any, rural areas have been major beneficiaries of Ugwuanyi’s paradigm shift in the governance of Enugu State.\nMike Ogbuekwe as Special Adviser on Agriculture and Focal Person, Enugu State Non-Oil Export Programme, set the pace for revolution in agriculture in the State.\nEnugu State under Governor Ugwuanyi is not only working, but safe and sound for the citizens."
  },
  {
    "headline": "Pastor Irame urges support for Buhari",
    "summarized_story": "Revd Symbol Emmanuel IrameThe Pastor of Love God’s Direction Church, Revd Symbol Emmanuel Irame has appealed to Nigerians to support the President Muhammad Buhari administration rather than pulling it to its knees by an avalanche of criticisms.\nThe appeal was contained in a statement he issued to mark the year 2021 Democracy Day celebration.\nThe Warri-based cleric said Nigerians must regard the fact thàt Buhari, becoming the president of Nigeria in 2015 after so many failed attempts has a divine purpose, and since God has allowed him to be president, Nigerians should give him the needed support to succeed.\nAccording to him, President Buhari certainly has some goodies up his sleeves for Nigerians and Nigeria.\nHence, citizens of the country need to contribute their individual talents and expertise to bouy the government and keep the country afloat politically, socially and economically."
  },
  {
    "headline": "June 12: Police justify use of teargas on protesters",
    "summarized_story": "The Nigeria Police Force on Saturday justified its use of teargas on protesters who took to the streets to mark this year’s Democracy Day by voicing their grievances against the present administration.\nDAILY POST recalls that the police shot teargas at protesters in Abuja and Lagos.\nSeveral groups and activists had vowed to stage protests in all parts of the country as Nigeria celebrate Democracy Day.\n“And that’s an acceptable mode of engaging violent protesters anywhere in the world, whether it’s in Abuja, Lagos, Paris, London, or New York or California.\nJune 12: Stop attacks on peaceful protesters – Amnesty Urges FG"
  },
  {
    "headline": "Boko Haram pays recruits N5,000 to spy, smuggle weapons",
    "summarized_story": "Governor Babagana Zulum of Borno State has insisted that Boko Haram offers new recruits N5,000 and use them as spies in communities.\nZulum, who disclosed this during his statewide broadcast on Saturday to commemorate this year’s Democracy Day and his second anniversary in office, noted that Boko Haram also recruits fighters to smuggle weapons.\nRecall that Boko Haram has been terrorising the Northern part of Nigeria for over a decade.\n“From records, we had experienced instances when insurgents offered as low as between N5,000 and N10,000 to recruit some spies and smugglers of weapons.\nPostpone your training of new recruits – Islamic group tells Nigerian Army"
  },
  {
    "headline": "Democracy Day: Ayade ordered aides to beat me, others for protesting – Activist",
    "summarized_story": "A human rights activist and legal luminary, Barr James Ibor, has alleged that Governor Ben Ayade of Cross River State ordered his personal aides on security to manhandle him, some journalists and others.\nAddressing newsmen in Calabar, the state capital, Barr Ibor stressed how he and others were beaten on Saturday during a peaceful protest to mark Democracy Day.\nHe alleged that when Ayade’s convoy arrived where they were distributing flyers to people, his aides ordered them to run but they refused, hence the beating.\n“The Commissioner of Police sent a team of policemen numbering about 50 to stay with them alongside men of the DSS.\nHe reminded that the governor had issued a directive, warning against any forms of public protest."
  },
  {
    "headline": "Herdsmen killings: We’ve cried enough, it’s now time for action",
    "summarized_story": "Governor Samuel Ortom of Benue State has vowed to take action against the unabated attacks by herdsmen in his state.\nOrtom said it is time to stop crying over herdsmen attacks and take action against them.\nHe stressed that his administration would take steps to protect the people of the state from marauding killer herdsmen.\nOrtom also insisted that his administration would not repeal the anti-open grazing law in the state despite the attacks by herdsmen.\nHe said the attacks would rather push his administration to strengthen the law against open grazing."
  },
  {
    "headline": "Gov Lalong confirms sacking of Plateau APC chairman",
    "summarized_story": "Plateau State Governor, Simon Lalong, has confirmed the sacking of Chief Letep Dabang as the chairman of the All Progressives Congress (APC) in the state.\nLalong made the announcement during a lecture and dinner organised for stakeholders as part of the activities to mark the June 12 Democracy Day, which was held at the Rayfield Government House in Jos, the state capital, on Saturday night.\nThe Governor, who stopped mid-way in his speech to introduce the new APC Chairman in Plateau, said, “We have a new APC chairman in Plateau.\nMeanwhile, Dabang’s suspension was contained in a letter written to him by Sen. John Akpanudoedehe, the APC’s National Secretary, Caretaker/Extraordinary Convention Planning Committee.\nThe letter dated June 11, 2021, partly read, “The Party is in receipt of a correspondence suspending you from office as the State Caretaker Chairman of Plateau chapter of our party, over anti-party activities.“Lalong condemns recent attacks in Riyom, Jos North"
  },
  {
    "headline": "Tope Alabi blasts Yinka Alaseyori over #Oniduromi song",
    "summarized_story": "By Olaitan GaniuPopular gospel singer Tope Alabi is on the hot seat following her criticism of colleague Adeyinka Alaseyori over her popular hit song titled ‘Oniduro Mi eseun o’ (my guarantor, I’m grateful).\nIn a video making the rounds on social media, Tope Alabi said God isn’t her guarantor because He’s more than a guarantor.\nAccording to Tope Alabi, Adeyinka Alaseyori, who seems to be the reigning gospel singer of the moment, stated had the song being led by the Holy Spirit, she would understood God is more than a guarantor and will not say such a word.\nADVERTISEMENT“If the Holy Spirit brings it, you are supposed, to digest it, chew it and organise it, before bringing it out,” Tope Alabi had stated.\nBut many fans had alleged Tope Alabi’s criticism was based on envy."
  },
  {
    "headline": "#Oniduromi: Sola Allyson backs Alaseyori after Tope Alabi’s knockdown",
    "summarized_story": "By Adeniyi AdewoyinPopular gospel singer Sola Allyson has weighed in on the knockdown of trending song “Oniduro” by Tope Alabi.\nAlabi’s comments had drawn reactions from the public, including her colleague Sola Allyson who took to social media to air her opinion.\nSola said: Oníìdúró mi, Ẹ ṢÉ OOO!\nI was set free by The ultimate Guarantor, Oníìdúró mi!\n“ONÍÌDÚRÓ MI, Ẹ ṢÉ OOOO!"
  },
  {
    "headline": "Niger IDP camps increase to 20 – NSEMA",
    "summarized_story": "By Justina Asishana, MinnaThe Niger State Emergency Management Agency (NSEMA) has disclosed there are currently 20 Internally Displaced Persons (IDPs) camps across the state.\nAccording to Inga, the burden of taking care of the IDPs is taking a toll on the state government because of dwindling resources.\n“The Niger state government is having serious concern over the IDP situation in the state.\nInga further explained majority of the displaced persons are still in the camp because their communities are not safe for them to return.\n“I am calling on all other agencies that ought to be rendering support along with the government agencies to reach out to the displaced persons in Niger state,” she stated."
  },
  {
    "headline": "Outcry over Niger Gov wife’s alleged involvement in selling water to residents",
    "summarized_story": "By Justina Asishana, MinnaWife of Niger Governor Dr Amina Abubakar- Bello has drawn the ire of Minna residents over her alleged involvement in selling borehole water to them.\nIt was learnt the Governor’s wife allegedly got N100 million from partners to drill the borehole and get tankers for water supply to prospective customers.\nThe residents alleged while populace is suffering from acute water supply, the Governor’s wife is selling water, which her husband should provide for free.\n“It is Raise foundation project and it has nothing to do with the First Lady.\nIt is just like other interventions that Raise Foundation has been doing like the cancer treatment and VVF."
  },
  {
    "headline": "Money, not sex, freaks me –Angel Emeka, actress",
    "summarized_story": "In this exclusive interview, the single mother of two talked about her career, love, sex and marriage.\nBut Madam Joyce Kanu noticed it was my first time and she consoled me and gave me the courage never to be scared.\nHe needed someone big that can fight Joyce Kanu and I fitted into the character.\nI am not a sex freak; the only thing that freaks me is money.\nThey should be focused and consistent because acting needs a lot of time if you really want to make it in the movie business."
  },
  {
    "headline": "NDDC board: What Niger Delta people want Buhari to do to Akpabio —Comrade Joseph Evah",
    "summarized_story": "Excerpt:Let’s know the latest happening on the Niger Delta Development Commission (NDDC)?\nThe Niger Delta Ministry Minister, Godswill Akpabio is simply exhibiting madness, so we are following him up.\nSo, when he looks at the Niger Delta people he feels and thinks that he can put us in his pocket?\nWe expect President Buhari to sack Akpabio quickly, if Akpabio will not face his Ministry of Niger Delta where there is no money to spend.\nThe Ministry of Niger Delta is dead under Akpabio’s watch, and he is not doing anything about it in Abuja."
  },
  {
    "headline": "Anxiety as Nigeria’s debt burden hits N32.9 trillion",
    "summarized_story": "The figure, released by the Debt Management Office (DMO), includes local and external debt of the federal, state governments and the Federal Capital Territory.\nBetween July 2015 when President Muhammadu and December 2020, Nigeria’s debt rose by approximately N20.8 trillion, according to the DMO.\nThe country’s increasing debt profile is also reflected in the growing cost of debt servicing which has further depleted the nation’s dwindling revenues in recent years.\nWithin the period of 66 months under review, the country spent N10.26 trillion on debt servicing.\nThe huge cost of servicing external debt is also a drain on external reserves."
  },
  {
    "headline": "COVID-19 2nd jab: Fear as first batch of AstraZeneca vaccine expires in few weeks",
    "summarized_story": "At about 11:05 a.m, Dr. Cyprian Ngong, a family physician, Senior Registrar at National Hospital, Abuja, was administered the first dose of the AstraZeneca COVID-19 vaccine in Nigeria, marking the historic commencement of COVID-19 vaccination in Nigeria.\nMeanwhile, a credible source at the PSC hinted that procurement of another batch of AstraZeneca COVID-19 vaccine is not in the plan of the Federal Government, rather the government is considering Johnson and Johnson (J&J) vaccine because of cost, storage facilities and other unique features.\nRecall that NAFDAC, few weeks ago, confirmed J&J COVID-19 vaccine safe for use in Nigeria, after a report by its vaccine committee confirmed that data on the vaccine were robust and met criteria for efficacy, safety and quality.\nMany of them did not know if they were given J&J COVID-19 vaccine or placebo.\nMeanwhile, Dr. Ngong, who was the first to take AstraZeneca COVID-19 vaccine said that he took the second dose of the vaccine after 10 weeks, and he had no reaction."
  },
  {
    "headline": "Armed bandits abduct farmer in Ekiti",
    "summarized_story": "From Priscilla Ediare, Ado-EkitiA farmer, Alhaji Jimoh Olodan, has been abducted by armed men suspected to be bandits in Iyemero Ekiti, Ikole Local Government Area of Ekiti State.\nThe abduction came two months and some days after a farmer, Mr. Isaac Agbanigo, was abducted from a farmstead in Ikere Ekiti, Ikere council of the state.\nAccording to the witness, the kidnappers shot sporadically into the air before taking the farmer to an unknown destination.\nWhen contacted, the Police Public Relations Officer, Ekiti State command, ASP Sunday Abutu, said the police were not aware of the incident.\nAlso, the commandant, Ekiti State Security Network Amotekun, Brig Gen. Joe Komolafe (retd), stated that the corps had not been informed about the incident."
  },
  {
    "headline": "Legislature, Judiciary Paralysed in Nigeria, Says Afe Babalola",
    "summarized_story": "“Let me say that it was totally wrong for the National Assembly to say they cannot produce or write a new constitution.\nUnder the 1999 Constitution, the National Assembly can produce a new constitution.\nOne, the 1999 Constitution gave the National Assembly the power to amend.\nAll the National Assembly needed to do is to call for a conference where people will advise on where and how the 1999 constitution can be substituted.\nAnswering to a question on the autonomy of the judiciary, which had prompted a strike by judicial workers for over two months, Babalola said, “Democracy thrives on three fundamentals pillars – the executive, legislature and judiciary."
  },
  {
    "headline": "June 12: Nigerians Stage Protests Nationwide",
    "summarized_story": "Our CorrespondentsNigerians yesterday staged protests and rallies around the country to mark the second anniversary of declaration June 12 as Democracy Day and protest the state of affairs in the country.\nHowever, all was peaceful in known flashpoints in the state, like Oshodi, Ojodu-Berger, Ojuelegba, Fagba, and Ketu, as many residents celebrated the June 12 Democracy Day in their homes.\nBAYELSABayelsa State Governor, Senator Douye Diri, expressed his administration’s determination to change the development narrative of the state.\nJoseph Hayab, said June 12 could not be celebrated as Democracy Day because Nigerian leaders were not democratic.\nHayab said Nigerians could not be governed by intimidation and still celebrate June 12 as Democracy Day."
  },
  {
    "headline": "COVID-19: No Hajj For Muslims this Year, Says FG",
    "summarized_story": "Olawale Ajimotokan in AbujaFor the second time in a row, there will be no Hajj for muslims beacuse of fear of COVID-19.\nThe federal government, yesterday, confirmed this in a statement issued by the National Hajj Commission of Nigeria (NAHCON).\nThe commission said its officials in Saudi Arabia had confirmed the development, which was reported by state television and radio stations in the Kingdom.\nOur prayer is that we collectively turn to Him in repentance so that He admits us for Hajj in the coming years,” NAHCON said.\nNAHCON, however, added that as in the previous year, the pilgrims seeking refund of their Hajj deposits would be granted such without unnecessary delay."
  },
  {
    "headline": "Anambra Guber: Uncertainty in PDP as Court Dissolves Congresses",
    "summarized_story": "Consequently, the High Court has sacked the state chairman of the party, Chief Ndubuisi Nwobu and replaced him with Ejike Oguebego, while directing the PDP PDP to use the November 2017 delegate lists in conducting its governorship primary election.\nThe local government congresses that is expected to produce the national delegates that will choose the governorship candidate of the PDP have been scheduled for June 17 2021.\nHe further sought an order nullifying or setting aside all Congresses, designations or appointment made by the PDP with respect to the state chairman for PDP in Anambra State, EXCO members, local government chairmen and national delegates amongst others.\n“It is hereby further declared that the arbitrary imposition by the 1st Defendant on its members of a State Chairman, Exco members, Local Government Chairmen and National Delegates, as contained atPages 14.\n“That was why we went to court, and thank God today, the authentic leadership of the party has been restored."
  },
  {
    "headline": "Buhari: FG Cannot Afford Funds to Revive Education",
    "summarized_story": "Christopher Isiguzo and Gideon Arinze in EnuguPresident Muhammadu Buhari has said the Nigerian government cannot afford the amount of funding needed to revive the country’s educational system.\nBuhari also said the competition for funds had become keener because of the recent increase in the number of tertiary institutions in Nigeria.\nBuhari, who was represented at the ceremony by the Minister of State for Education, Emeka Nwajiuba, however, said his administration was committed to addressing the needs of tertiary institutions through budgetary allocations to the Tertiary Education Trust Fund (TETFUND).\n“I am optimistic that the on-going drive to diversify the national economy will provide the government with additional resources to improve funding for the education system,” he said.\nBuhari advised academic institutions across the country to embark on the kind of innovative research that could help boost production and diversify the economy."
  },
  {
    "headline": "BREAKING: June 12 Protesters Intercept Busload Of Northerners Going To Lagos, Recover Guns",
    "summarized_story": "A bus conveying some northerners from Gombe State to Lagos has been intercepted in Akure, the Ondo State capital, by the June 12 protesters.\nLocally made guns were found in the bus.\nPHOTONEWS: #June12thProtest Protesters In Ondo Arrest Northerners Traveling From Gombe To Lagos With Locally Made Guns, Hand Them Over To Amotekun Corps pic.twitter.com/fATpQ4XAv1 — Sahara Reporters (@SaharaReporters) June 12, 2021The protesters handed the suspects to the operatives of the security outfit, Amotekun.\nThe suspects are being interrogated."
  },
  {
    "headline": "BREAKING: June 12 Protesters Intercept Busload Of Northerners Going To Lagos, Recover Guns",
    "summarized_story": "A bus conveying some northerners from Gombe State to Lagos has been intercepted in Akure, the Ondo State capital, by the June 12 protesters.\nLocally made guns were found in the bus.\nPHOTONEWS: #June12thProtest Protesters In Ondo Arrest Northerners Traveling From Gombe To Lagos With Locally Made Guns, Hand Them Over To Amotekun Corps pic.twitter.com/fATpQ4XAv1 — Sahara Reporters (@SaharaReporters) June 12, 2021The protesters handed the suspects to the operatives of the security outfit, Amotekun.\nThe suspects are being interrogated."
  },
  {
    "headline": "June 12: Police Attack Protesters In Abuja",
    "summarized_story": "Men of the Nigeria Police Force on Saturday morning thwarted a June 12 protest in the Gudu area of the Federal Capital Territory when they stormed the area and started firing tear gas canisters.\nAccording to Punch, the protest began around 08:30 am and was going on smoothly with the protesters, mainly youths, expressing their dissatisfaction with the nation's state.\nThe protesters, who chanted \"Buhari must go\", \"Say no to injustice\", amongst other solidarity phrases, scampered for safety when the security operatives started shooting.\nJournalists who were covering the protest and some of them also streaming it on Facebook Live ran for cover as the security operatives bombarded the demonstration ground."
  },
  {
    "headline": "June 12: Police Attack Protesters In Abuja",
    "summarized_story": "Men of the Nigeria Police Force on Saturday morning thwarted a June 12 protest in the Gudu area of the Federal Capital Territory when they stormed the area and started firing tear gas canisters.\nAccording to Punch, the protest began around 08:30 am and was going on smoothly with the protesters, mainly youths, expressing their dissatisfaction with the nation's state.\nThe protesters, who chanted \"Buhari must go\", \"Say no to injustice\", amongst other solidarity phrases, scampered for safety when the security operatives started shooting.\nJournalists who were covering the protest and some of them also streaming it on Facebook Live ran for cover as the security operatives bombarded the demonstration ground."
  },
  {
    "headline": "Ortom: Attacks won't make us repeal anti-grazing law in Benue",
    "summarized_story": "Samuel Ortom, governor of Benue, says attacks on residents won’t force his administration to repeal the anti-grazing law in the state.\nAdvertisementOn May 22, 2017, Ortom signed the anti-grazing law that prohibits the movement of livestock on foot within the state — following a series of clashes between herders and farmers.\nAdvertisement“A few weeks ago, Benue stakeholders met and gave this administration the mandate to activate and implement the Community Volunteer Guards Law enacted in 2000,” he said.\n“Let me remind those who think that sustained attacks on the Benue people will force us to repeal the Open Grazing Prohibition and Ranches Establishment Law that they are making a mistake.\nAdvertisement“This law has come to stay and no amount of intimidation can make us repeal it."
  },
  {
    "headline": "Ortom: Attacks won't make us repeal anti-grazing law in Benue",
    "summarized_story": "Samuel Ortom, governor of Benue, says attacks on residents won’t force his administration to repeal the anti-grazing law in the state.\nAdvertisementOn May 22, 2017, Ortom signed the anti-grazing law that prohibits the movement of livestock on foot within the state — following a series of clashes between herders and farmers.\nAdvertisement“A few weeks ago, Benue stakeholders met and gave this administration the mandate to activate and implement the Community Volunteer Guards Law enacted in 2000,” he said.\n“Let me remind those who think that sustained attacks on the Benue people will force us to repeal the Open Grazing Prohibition and Ranches Establishment Law that they are making a mistake.\nAdvertisement“This law has come to stay and no amount of intimidation can make us repeal it."
  },
  {
    "headline": "Matawalle on banditry: Things are getting worse by the day in Zamfara",
    "summarized_story": "Bello Matawalle, governor of Zamfara, says the insecurity challenges in the state are getting worse.\nAdvertisementIn a statewide broadcast on Saturday, Matawalle said banditry has reverted to how it used to be before his administration — despite efforts to curtail it.\nThe governor, however, said none of the criminals and their sponsors will be spared “no matter how highly placed”.\nAdvertisement“In recent weeks, the act of banditry has reverted to the ugly dimensions it had, prior to the coming of my administration,” he said.\nUnfortunately, things suddenly took a dramatic turn and things are getting worse by the day."
  },
  {
    "headline": "Matawalle on banditry: Things are getting worse by the day in Zamfara",
    "summarized_story": "Bello Matawalle, governor of Zamfara, says the insecurity challenges in the state are getting worse.\nAdvertisementIn a statewide broadcast on Saturday, Matawalle said banditry has reverted to how it used to be before his administration — despite efforts to curtail it.\nThe governor, however, said none of the criminals and their sponsors will be spared “no matter how highly placed”.\nAdvertisement“In recent weeks, the act of banditry has reverted to the ugly dimensions it had, prior to the coming of my administration,” he said.\nUnfortunately, things suddenly took a dramatic turn and things are getting worse by the day."
  },
  {
    "headline": "Nigeria records 8 new COVID-19 cases -- lowest in 28 days",
    "summarized_story": "Nigeria’s daily count of new coronavirus infections recorded a significant decline with only eight samples confirmed positive on Saturday.\nThe Nigeria Centre for Disease Control (NCDC) confirmed the new cases in its update for June 12, 2021.\nThe fresh COVID-19 infections were recorded in only two states — Akwa Ibom and Rivers with four positive samples each.\nThe agency reported zero death from COVID-19 complications on Saturday, leaving the death toll at 2,177.\nA total of 167,059 coronavirus cases have now confirmed across 36 states and the FCT."
  },
  {
    "headline": "MultiChoice is increasing its stake in BetKing for $281.5 million",
    "summarized_story": "Seven months after taking up an initial 20% stake in BetKing, South African pay TV operator MultiChoice plans to increase its shareholding in the online gambling company to 49% in a $281.5 million deal.\nBetKing is the trading name of Blue Lake Ventures Limited, a pan-African sports betting and entertainment business with major operations in Nigeria.\nThe value of MultiChoice’s initial investment in BetKing was said to be worth more than $100 million.\nBetKing’s annual statement for the financial year ended December 2020 shows a growth in revenue to $77.9 million, from $54.7 million in the previous year.\nYet, Africa accounts for only 2% of global sports betting revenue."
  },
  {
    "headline": "Nigeria’s Central Bank to launch digital currency before 2022",
    "summarized_story": "Nigeria may pilot an official digital currency in 2021, going by the words of Rakiyat Mohammed, a Central Bank Director in charge of the Information Technology Department, who revealed on Thursday that the banking regulator will soon launch a digital currency.\nA Central Bank Digital Currency (CBDC) represents a country’s official currency in digital form.\nAccording to the CBN director, about 80% of central banks in the world are currently exploring the possibility of issuing central bank digital currency and Nigeria could not be left behind.\nLast year, the Bahamas launched the world’s first central bank digital currency.\nWhen it eventually becomes operational, the digital currency will complement the existing forms of currency in the country and could help reduce the high cost of managing and transferring cash."
  },
  {
    "headline": "What is a VPN and how does it work in Nigeria?",
    "summarized_story": "On the internet, different computers send and receive information between Internet Protocol (IP) addresses.\nBefore turning on my VPN, my device was in Lagos, NigeriaAfter turning on my VPN, my device is in Santo Domingo, Dominican RepublicThe images above show how my location changed from Nigeria to Dominican Republic after turning on my VPN.\nNo monitoring: As we mentioned earlier, your internet service provider (ISP) can see your internet traffic and probably log your browsing history.\nWhat is the difference between a VPN app, a VPN plugin, and a VPN browser?\nAlso, some sites and services look at VPN traffic as suspicious and won’t let you connect."
  },
  {
    "headline": "TECNO CAMON 17 Pro: A Creative Nod to the Selfie and the Selfie Culture",
    "summarized_story": "A few weeks back, TECNO launched the TECNO CAMON 17 Pro smartphone, focusing on the selfie with a 48MP AI selfie camera and 90 Hz super-high refreshing rate at 6.8-inch FHD Screen.\nSo, today, I am going to be sharing the things I love about the Camon 17 Pro.\nThe selfie camera of the Camon 17 Pro is one of the highlights of the phone.\nCamera LAB – The TAIVOS™ Imaging LaboratoryThe TECNO CAMON 17 Pro comes with trademarked TAIVOS technology.\nFurthermore, the TECNO CAMON 17 Pro comes with fast charging so, the TECNO CAMON 17 Pro will be ready to leave when you are."
  },
  {
    "headline": "Fostering Gender Inclusion in Technology with the Bolt Drive4WITech Initiative",
    "summarized_story": "The journey into tech for women in Africa is an ongoing discussion largely influenced by cultural norms and societal expectations concerning gender.\nBolt, an inclusive mobility company, recognises this and as part of efforts to drive participation and inclusion for women in technology, launched the #Drive4WITech (Drive for Women in Tech) initiative to support young women in Africa.\nQ: Among the many applications received, you were selected to intern with Bolt in the #Drive4WITech initiative.\nOluwakorede: I supported the marketing team at Bolt Nigeria.\nI am more equipped to confidently make significant contributions to my future work team."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "From ballot paper to blockchain ledger, can the tech behind Bitcoin heal Nigeria’s democracy?",
    "summarized_story": "Blockchain technology is often tied to the flagship cryptocurrency — Bitcoin.\nIn a Forbes article, Frank Palermo advocated blockchain voting in the US after an alleged hack of the current voting system in 2016.\nIn May 2018, according to NBC News, West Virginians living abroad were able to send their votes in for a primary election with a blockchain voting system.\ni-Elect is a blockchain voting platform with a use case in Nigeria created by blockchain developer and designer Jerry Ojumah.\nIt also says the growing proposals for blockchain elections is borne out of the enthusiasm to improve and modernise elections."
  },
  {
    "headline": "Global Wellness Day: Protecting mental health with technology",
    "summarized_story": "In Africa, mental health resources are scarce, reflecting the weakness of mental health services on the continent.\nA World Health Organization (WHO) fact sheet reveals that mental health disorders, otherwise known as mental health illnesses, vary and come with different presentations.\nNonetheless, a mental health concern becomes a mental health disorder when signs and symptoms cause recurring stress and affect the ability to function.\nProtecting your mental health with technologyImage by Firmbee from PixabayThere are effective strategies to prevent and alleviate the suffering caused by mental health disorders, and technology is one of them.\nMANI attempts to fight stigma, improve mental health literacy, and drive policies that benefit mental health service users and those at risk."
  },
  {
    "headline": "T.B. Joshua’s exit: Business owners gaze into uncertain future",
    "summarized_story": "Until 1987, Ikotun, a suburb of Lagos, was unknown.\nAs at then, the swampy suburb lacked basic infrastructure, especially accessible roads, while its high population ‘occasioned by cheap rent’ and corresponding growing crime rate scared many from living or investing in the area.\nBut since then, the town has undergone appreciable transformation, courtesy of the…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Six years of APC in the saddle: Whither the rosy promises?",
    "summarized_story": "In the last two years, more farmers have been killed more than any other time in the history of the country.\nIt is nothing to write home about as woes, anguish and insecurity has become the order of the day.\nBuhari and the All Progressives Congress (APC) made lots of promises to Nigerians, including restructuring of the country to give every section of the country a sense of belonging.\nNot doing so will not only bring him in a bad light, but also as a man who lacks integrity and courage.\nIt is high time credible and competent men, women and the youths in Nigeria occupied exalted positions and not charlatans."
  },
  {
    "headline": "Naira ends week strong at official market",
    "summarized_story": "The foreign exchange trading week ended on Friday, June 11, 2021, with the Naira stronger in value than the dollar at the official window despite low liquidity.\nRead Also: Nigeria can earn huge foreign exchange from coffee – farmers At the end of the trading week, the Naira closed at N410.80k per dollar, gaining 0.06 percent…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "World Day Against Child Labour: Obaseki seeks legislation, global action to end menace – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for legislative and decisive actions, as well as increased collaboration among global stakeholders to prevent, prohibit and eradicate child labour in its entirety.\nObaseki made the call in commemoration of the 2021 World Day Against Child Labour, with the theme, “Act now: end child labour!” marked every June 12, by the International Labour Organisation (ILO), and observed across the globe.\nThe governor noted that there is an urgent need for stakeholders to improve efforts in the global fight against child labour in order to save the nine million additional children at risk of being pushed into child labour by the end of 2022 as a result of the coronavirus pandemic, according to a new report by the ILO and United Nations International Children’s Emergency Fund (UNICEF).\nObaseki said his government has strengthened institutions in the state to enforce the Child Rights Law, and ensure that children are protected from abuses, especially child labour, which robs them of their childhood and deprives them of the opportunity to live their lives to the fullest.\n“In sub-Saharan Africa, population growth, recurrent crises, extreme poverty, and inadequate social protection measures have led to an additional 16.6 million children in child labour over the past four years.”..."
  },
  {
    "headline": "We must all work together to sustain democracy, says Edo. Dep Gov – Nigerian Observer",
    "summarized_story": "We must all work together to sustain democracy, says Edo.\nShaibu stated this while addressing a cross section of protesters who were in a peaceful protest to Edo Government House, Benin City.\nHe said that the governor should issue a second proclamation letter which is against the law.\n“After 22 years of democracy, Nigerians are still suffering as the standard of living has gone from bad to worse in the country.\nWe enjoy freedom of speech but not freedom after speech."
  },
  {
    "headline": "Obaseki salutes Nigerians on Democracy Day, urges eternal vigilance to consolidate ideals – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, felicitates with Nigerians, as the country marks this year’s Democracy Day.\nThe people and the government hold the key to the solution of our problems and we must work together to make our country truly great.\nWe have a ready example in Edo State, which today is a beacon of hope for democracy.\nIt takes eternal vigilance to keep our country one and prosperous.\nHappy Democracy DayLong live the Federal Republic of NigeriaGodwin N. ObasekiGovernor, Edo State."
  },
  {
    "headline": "Obaseki congratulates Osikhekha, Ibrahim, others on Guild of Editors roles – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has felicitated with the reelected President of the Nigerian Guild of Editors (NGE), Mr. Mustapha Isah Osikhekha, on retaining the highly exalted position in the Guild at the recent NGE convention in Kano.\nThe governor also congratulated two other Edo-born editors, Mr. Iyobosa Uwugiaren, who was returned as General Secretary of the Guild and Mr. Umoru Ibrahim, a member of the Guild’s Standing Committee representing the North.\n“As a worthy son of Edo State, we celebrate his new feat and encourage him to keep the spirit of excellence alive.\nAt a time that Edo youths are seeking for mentors and sources of inspiration, the feat singles Osikhekha out as someone worth emulating.\nUmoru Ibrahim, also from Edo State, is a member of the Guild’s Standing Committee representing the North."
  },
  {
    "headline": "BUK loses second student in one week",
    "summarized_story": "ADVERTISEMENTThe management of Bayero University (BUK), Kano, has announced the death of Moshood Kamaluddeen, a 200-level student in the Department of Accounting.\nAnother 400-level student in the Department of Political Science, Mercy Sunday, had also died of fever and vomiting in the Ramat Hall female students’ hostel on Tuesday morning.\nThe statement said the university will not condone any act capable of disrupting the peace on campuses, adding that any student caught doing so would be decisively dealt with.\nBUK asks ministry of works to erect pedestrian bridgeThe university management said it has requested the Federal Ministry of Works to construct a pedestrian bridge near the main gate of the new campus.\n“Already, the Ministry had obliged to the request of constructing the bridge and arrangement has gone far in that regard,” the statement said."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Herders killings: Ortom says time for crying is over, vows to take action",
    "summarized_story": "Governor of Benue State, Samuel Ortom, has said the time has come for his people to stop crying and take action against killer herders in the state.\nHundreds of people have been killed in Benue the by suspected Fulani herdsmen in the past few days alone, while thousands have been displaced.\n“A few weeks ago, Benue stakeholders met and gave this administration the mandate to activate and implement the Community Volunteer Guards Law enacted in 2000,” he said.\n“We have already commenced the process of recruiting responsible people of 50 years and below into the Volunteer Guards.\n“This law has come to stay and no amount of intimidation can make us repeal it."
  },
  {
    "headline": "NDLEA intercepts 100,000 bottles of Codeine Syrup at Onne Port",
    "summarized_story": "National Drug Law Enforcement Agency, NDLEA, at the Onne seaport, Port Harcourt, Rivers State, has seized about 100,000 bottles of codeine syrup with a total weight of 15,325kilograms.\nGeneral Mohamed Buba Marwa (Retd) has however hailed the synergy among the various government agencies at the Onne port and charged them not to rest on their oars as they daily work hard to keep Nigeria safe.\nHe particularly commended the Commander, officers and men of the Port Harcourt Port Command and their Abuja airport Command counterparts for their vigilance and commitment to the task of ridding Nigeria of illicit drugs.\n“The damage 100,000 bottles of codeine would have done to our youths if they had slipped through the port to our villages, towns and cities is unimaginable.\n146.95 kilograms of khat could have done the same damage if allowed to go into our streets."
  },
  {
    "headline": "Buhari’s anti-corruption failure fuelling insecurity, undermining democracy – Report",
    "summarized_story": "It then gave an outline, including improved financial centralisation, referring to TSA and IPPIS; and higher conviction rates by anti-corruption agencies.\nCorruption and insecuritySince Mr Buhari came to power in 2015, insecurity has intensified and spread, affecting virtually all parts of the country.\nYet President Buhari has done little to change their calculus, hold them accountable or exert strong oversight over their activities.”“Under President Buhari, security sector corruption has become both a cause and a consequence of rising insecurity across the country.\n“90% of Nigeria’s 360-plus progovernment NGOs have started operating since President Buhari took office, a correlation that suggests many enjoy high-level political support,” CDD claimed.\nIt also called on Nigeria’s international partners to prioritise anti-corruption in their engagements and assistance toward the African nation."
  },
  {
    "headline": "National Assembly shouldn’t be afraid of referendum – Ozekhome",
    "summarized_story": "BY EMEKA EJEREConstitutional lawyer and human right activist, Mike Ozekhome on Saturday wondered why the National Assembly was wary of ideas like ‘referendum’ and ‘a people’s constitution’.\nHowever, the Buhari administration has maintained that the ongoing constitutional review being undertaken by the National Assembly will be enough to align the 1999 constitution with people’s expectation, a notion rejected by critics like Ozekhome.\nAnd I have never underrated the role of the National Assembly.\nBut the National Assembly itself, on the other hand, does not seem to understand what it ought to do,” the Senior Advocate of Nigeria said.\nI don’t know why they are afraid of a referendum or a people’s constitution."
  },
  {
    "headline": "AESID Condemns Renewed Izzi/Ikwo Communal Hostility In Ebonyi",
    "summarized_story": "The Association of Ebonyi State Indigenes in the Diaspora (AESID) has condemned the renewed communal clashes between the people of Enyibichiri, Izzi in Abakaliki local government area and Echialike, Ikwo, Ikwo local government area of Ebonyi State over a protracted land dispute, demanding an end to the hostility.\nAdvertisementsThe Ebonyi indigenes also condemned in totality, the abduction of some Izzi children by fighters alleged to be from the Echi-Alike area.\nIn a statement released to journalists on Sunday in Abuja by AESID president worldwide, Amb.\n“Though we had condemned this renewed hostilities, we find this latest news of abduction of under-aged children most perturbing.\nThis, AESID believes is the best way to go for any meaningful development to be initiated and sustained in their local communities,” he added."
  },
  {
    "headline": "Democracy Day: Ibezim Clamours For Additional State In S’East",
    "summarized_story": "The newly inaugurated Senator representing Imo North, Senator Frank Ibezim, has clamoured for an additional state to be created for the South-East region, to balance some political equations.\nAdvertisementsAccording to the lawmaker, additional state for the region would go a long way to pacify the South-East people, while suggesting restructuring to help strengthen the nation’s democracy.\nSpeaking to journalists in Abuja on the gains of democracy, to mark the 2021 Democracy Day, Senator Ibezim also remarked that, democracy had fared well in Nigeria, compared to the days of military regimes.\nI believe that there is hope for positive development and I believe that now is the time for us to look inwards and work together,” Ibezim said.\nHe also said restructuring the country would further strengthen the unity of the people and restore peace and security."
  },
  {
    "headline": "OPINION: 60 Gun-salute To The Literary General",
    "summarized_story": "Back in the 90s, we used to time each of his literary parturitions, the way a sprinter’s dash on the track to the finish-line is scored.\nA skill matched equally by an adroitness at recalling, off-hand, long passages from literary classics.\nIn fact, it will be no exaggeration to say his muse has since ramified into a Trojan of sorts, straddling Nigeria’s literary space.\nIndeed, in Nigeria’s contemporary artistic firmament, very few literary avians could be said to soar close, let alone higher than Sam.\nUntil his final return to Nigeria in 2006 to take up an appointment as Chairman of The Nation editorial board, I doubled as Sam’s literary agent locally."
  },
  {
    "headline": "WAPP Northcore Energy Project To Gulp $568m",
    "summarized_story": "To complete the West African Power Pool (WAPP) sub-regional interconnection project referred to as the 330 kV WAPP Northcore regional interconnection project will cost the financiers-the African Development Bank (AfDB), Agence Française de Développement (AFD), the World Bank (WB) and the federal government of Nigeria (FGN) a total of USD 568 million.\nAdvertisementsThis was disclosed by the minister of power, Sale Mamman, in his welcome address at the first session of the joint ministerial steering committee of WAPP, comprising Nigeria, Niger, Benin, Togo, Burkina Faso Regional Electricity Interconnection Project in Abuja.\nThe North Core Project involves the construction of approximately 875 km of 330 kV and 24 km 225 kV transmission lines from Nigeria to Burkina Faso, through Niger and Benin with associated substations.\nHe further said that the project is considered as one of the priority projects in the infrastructure programme of WAPP aimed at facilitating efficient energy trade in the sub-region among several other benefits.\nADVERTISEMENTIn his address, secretary general of WAPP, Mr. Siengui Apollinaire Ki, said the project is being implemented according to the new model of institutional framework for development by WAPP and the countries concerned."
  },
  {
    "headline": "COVID-19: Again, Brazilian President Fined For Not Wearing Mask",
    "summarized_story": "Brazilian President, Jair Bolsonaro, has been fined for not wearing a mask as he joined thousands of motorcyclists at a rally in Sao Paulo.\nAdvertisementsBolsonaro waved from his bike to the cheering crowd as he used the occasion to insist masks were useless for vaccinated people.\nState authorities later confirmed that Mr Bolsonaro had been fined the equivalent of about £78 for violating a local law that requires masks in public places.\nHe was previously fined for the same reason after a rally in the state of Maranhao in May.\nADVERTISEMENTMore than 480,000 people have died with coronavirus in Brazil and Mr Bolsonaro – who’s expected to run for re-election next year – has consistently downplayed the severity of the pandemic."
  },
  {
    "headline": "Ex-militants in Ondo threaten court action over unpaid benefits —",
    "summarized_story": "Some ex-militants in Ilaje Local Government area of Ondo State have threatened to go to court over unpaid benefits.\nThey alleged that their monthly allowances had not been paid for two years by the Presidential Committee on Amnesty Programme and threatened court action if the benefits were not paid within 30 days.\nThey said said that the camp was invited to the Presidential Amnesty Programme by a letter dated July 16.\n“Building on the initial invitation to the Presidential Amnesty Programme, you will recall that the 204 persons, whose names are annexed, were under the Mr Deji Ehinmowo’s wing in 2017 Presidential Programme conducted in Ondo State by the Federal Government.\n“The exercise was jointly conducted with the Ondo State through the Amnesty Committee headed by the Deputy Governor of Ondo State, Agboola Ajayi, in collaboration with the Navy with other security agencies in attendance."
  },
  {
    "headline": "NDLEA nabs Uber driver, 2 traffickers with cocaine in Lagos —",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has arrested an Uber driver, and two other suspected traffickers with different quantities of cocaine at Murtala Muhammed International Airport (MMIA), Lagos.\nMr Femi Babafemi, Director, Media and Advocacy, NDLEA, said this in a statement on Sunday in Abuja.\nBabafemi said the Uber driver, Lawal Tunde Rasheed, was arrested at the Skyway Aviation Handling Company Plc (SAHCO), export shed of MMIA on Tuesday, June 8.\nAccording to him, when the package was searched, 150grammes of cocaine, concealed inside two pieces of air freshener were discovered.\nGen. Buba Marwa, as commending the MMIA and Lagos State Commands of the agency for the feats."
  },
  {
    "headline": "We’ll pay bandits in same coin – Matawalle — Daily Times Nigeria",
    "summarized_story": "Bello Matawalle of Zamfara has said that his administration will deal decisively with bandits and their sponsors terrorising the state.\nMatawalle made his position known in a statewide broadcast he made in Gusau on Saturday following renewed attacks by the hoodlums in the state.\nThe governor reaffirmed his commitment to deal ruthlessly with all those behind the killings that took place in the past and now.\n“Unfortunately, things suddenly took a dramatic turn and things are getting worse by the day.\n“I assure you that we will remain steadfast in our efforts to eradicate banditry and all types of criminality from the state,” he said."
  },
  {
    "headline": "It’s time to end Boko Haram- Al Mustapha tells new COAS —",
    "summarized_story": "Retired Maj. Hamza Al Mustapha has advised Maj.-Gen. Faruk Yahaya, the new Chief of Army Staff (COAS), to end the Boko Haram insurgency in the shortest possible time.\n“There are different ways for him to succeed in overcoming the numerous security challenges bedevilling the country, ” he said.\nAl Mustapha advised the new army chief to work in synergy with other security agencies to ensure success.\nAl Mustapha said the army chief must also trace the sources of arms getting into Nigeria resulting in arms proliferation.\n“That’s why the country is facing security challenges from all facets at the same time."
  },
  {
    "headline": "Three killed as plane crashes in France",
    "summarized_story": "Three people died after a sightseeing plane crashed in northern France Saturday, following what is thought to have been an engine failure, the local prosecutor said.\nThe four-seater Robin HR 100 had just taken off from an airfield when it crashed and caught fire near Wambrechies, near the city of Lille, said prosecutor Carole Etienne.\nAir accident investigators were at the scene, and at this stage, the thinking is that it was an engine failure, said Etienne.\nThe three people on board, aged 29, 53 and 61, had been bound for Belgium, she added.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Three killed as plane crashes in France",
    "summarized_story": "Three people died after a sightseeing plane crashed in northern France Saturday, following what is thought to have been an engine failure, the local prosecutor said.\nThe four-seater Robin HR 100 had just taken off from an airfield when it crashed and caught fire near Wambrechies, near the city of Lille, said prosecutor Carole Etienne.\nAir accident investigators were at the scene, and at this stage, the thinking is that it was an engine failure, said Etienne.\nThe three people on board, aged 29, 53 and 61, had been bound for Belgium, she added.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Gastroenteritis outbreak kills 37 in 15 Bauchi LGAs",
    "summarized_story": "The Bauchi State Primary Health Care Development Authority, on Saturday, says an outbreak of gastroenteritis infection has killed no fewer than 37 people in 15 local government areas of the state.\nAs of June 3, 2021, BSPHDA announced the disease had killed 28 people in 13 LGAs.\nRead AlsoThe BSPHDA boss added that the affected LGAs are Bauchi, Darazo, Dass, Giade, Ganjuwa and Jama’are, Misau, Ningi, Shira, Tafawa Balewa, Warji, Alkaleri, Kirfi, Shira, and Zaki.\n“The LGAs with the highest number of cases are Bauchi 1,334, Toro 165, Ningi 91 and Dass 60,” he said.\nHe reminded the general public to practice environmental and personal hygiene and report all cases to the nearest health facilities."
  },
  {
    "headline": "Gastroenteritis outbreak kills 37 in 15 Bauchi LGAs",
    "summarized_story": "The Bauchi State Primary Health Care Development Authority, on Saturday, says an outbreak of gastroenteritis infection has killed no fewer than 37 people in 15 local government areas of the state.\nAs of June 3, 2021, BSPHDA announced the disease had killed 28 people in 13 LGAs.\nRead AlsoThe BSPHDA boss added that the affected LGAs are Bauchi, Darazo, Dass, Giade, Ganjuwa and Jama’are, Misau, Ningi, Shira, Tafawa Balewa, Warji, Alkaleri, Kirfi, Shira, and Zaki.\n“The LGAs with the highest number of cases are Bauchi 1,334, Toro 165, Ningi 91 and Dass 60,” he said.\nHe reminded the general public to practice environmental and personal hygiene and report all cases to the nearest health facilities."
  },
  {
    "headline": "Al Mustapha: Boko Haram can be stopped in short time",
    "summarized_story": "By Abdul Hassan/AbujaRetired Maj. Hamza Al Mustapha said he has done some research and concluded that the 12 year-old Boko Haram insurgency can be ended in a short time.\nAl Mustapha, who was a former Chief Security Officer (CSO) to Gen. Sani Abacha, gave the advice in an interview with NAN.\nAl Mustapha advised the new army chief to work in synergy with other security agencies to ensure success.\nAl Mustapha said the army chief must also trace the sources of arms getting into Nigeria resulting in arms proliferation.\nAl Mustapha said the military must hasten its pace in tackling security challenges facing the country so it can return to barracks as soon as possible."
  },
  {
    "headline": "6 killed, 10 others injured in Bauchi road crash",
    "summarized_story": "By Ayinde OlaideThe Federal Road Safety Corps (FRSC) in Bauchi State, on Sunday, said that six people lost their lives in a ghastly motor accident in Gumero village of Ganjuwa Local Government Area of the state.\nThe Sector Commander, Mr Yusuf Abdullahi, who confirmed the accident, said that 10 others were seriously injured in the crash, involving a Peugeot 406 car and a Toyota Hiace bus.\nHe said that the injured and the corpses were referred to the Kafin Madaki and Ningi General Hospitals for confirmation and treatment.\n“The crash happened between a Peugeot car and a Toyota Hiace bus in Gumero village, some 15 kilometres from Kafin Madaki, headquarters of Ganjuwa Local Government Area of the state.\n“Our men swiftly responded to the scene of the crash and they were able to rush both the survivors and the deceased to Kafin Madaki and Ningi General Hospitals respectively for confirmation and treatment, and also cleared up the crash scene,” he said."
  },
  {
    "headline": "Why Abdulsalami’s role in promoting democracy can’t be disputed – Jonathan",
    "summarized_story": "By Kazeem UgbodagaFormer President, Dr. Goodluck Jonathan on Saturday said former Military Head of State, Abdulsalami Abubakar’s role in promoting democracy cannot be disputed because of his relentless passion and sacrifice for the nation.\nJonathan, in a goodwill message to felicitate with Abdulsalami as he clocks 79, commended the retired general for his efforts and contributions to the peace and unity of the country.\nAccording to him, Abdulsalami’s role in promoting democracy and his passion for service is highly commendable.\nNigerians will continue to honour you for the role you played in our nation’s transition from military to civilian administration, which has flourished for over two decades and produced notable leaders.\n“On behalf of my family and the Goodluck Jonathan Foundation, I wish you more years of sound health, strength and peace as you celebrate.”"
  },
  {
    "headline": "How Buhari Plans To Secretly Visit Maiduguri To Avoid Imminent Protest, Boos Over His Poor Performance",
    "summarized_story": "Nigeria’s President Muhammadu Buhari is planning a secret visit to Maiduguri, the capital of Borno, this week, according to NewsDirect.NG.\nAccording to a source in the Presidency, the planned visit is being kept a secret since the President is expected to elicit protests in the volatile country.\nBuhari promised to defeat Boko Haram before his victory in 2015, but that promise has yet to be fulfilled six years later.\n“Buhari has a hidden plan to visit Maiduguri this week,” the source claimed, “but they don’t want to broadcast it to avoid a situation where Maiduguri protesters disgrace him.”When Buhari visited Maiduguri in February 2020 to “sympathize” with the city’s population following recent Boko Haram attacks, protesters booed him.\nAnd on Friday, he gave another interview to NTA, making contentious statements in both interviews, as is his custom."
  },
  {
    "headline": "Nigerians Will ‘Lead Bitcoin’ – Twitter CEO Jack Dorsey",
    "summarized_story": "Despite Nigerian authorities cracking down on cryptocurrency trading, Twitter co-founder and CEO Jack Dorsey claimed on Sunday that “the people of Nigeria will lead bitcoin.”Dorsey’s remark was in response to an op-ed in Bitcoin Magazine published by NFL player Russell Okung.\nNigeria should focus on obtaining “economic independence and financial sovereignty” by adopting a Bitcoin Standard, according to Okung, a Nigerian descendent and self-proclaimed Bitcoin proponent.\nHowever, the central bank of the country has made it illegal for financial institutions to trade in cryptocurrencies.\nAll accounts engaged in the transfer or exchange of cryptocurrency must be identified and closed down, according to the decree.\nDespite the government’s actions, many young Nigerians have found new ways to acquire and sell cryptocurrencies as the naira, the country’s currency, continues to fall against the dollar."
  },
  {
    "headline": "Boko Haram Pays Recruits N5,000 To Spy, Smuggle Weapons – Zulum",
    "summarized_story": "Boko Haram, according to Borno State Governor Babagana Zulum, pays new recruits N5,000 and uses them as spies in areas.\nBoko Haram also recruits fighters to smuggle weapons, according to Zulum, who stated this during his nationwide broadcast on Saturday to honor this year’s Democracy Day and his second anniversary in office.\nBoko Haram has been terrorizing Nigeria’s northern region for more than a decade.\nZulum claims that:“From day one, we were faced with an acute humanitarian crisis, particularly in northern and some parts of the central senatorial zones.\n“From records, we had experienced instances when insurgents offered as low as between N5,000 and N10,000 to recruit some spies and smugglers of weapons."
  },
  {
    "headline": "FG Suspends Salaries Of 331 Civil Servants",
    "summarized_story": "This is due to their failure to properly upgrade their Integrated Personnel and Payroll Information System (IPPIS).\nAccording to the statement, Mamman had signed the circular of the suspension on behalf of the HOCSF, Dr Folasade Yemi-Esan.\n“The salaries of 331 federal civil servants have been suspended on the IPPIS platform for their failure to carry out the online records update of the HR Module of Integrated Personnel and Payroll Information System.\n“And signed on behalf of the Head of Civil Service of the Federation, Dr Folasade Yemi-Esan by the Permanent Secretary, Career Management Office, Mahmuda Mamman,” the statement added.\nThe Human Resources Module of IPPIS records update exercise was initiated to rid the service of ghost workers, cut down government expenditure and ensure credible personnel records."
  },
  {
    "headline": "Breaking: Again, Nigeria’s Adesanya down Italian opponent, retains UFC middleweight title",
    "summarized_story": "UFC middleweight champion Israel Adesanya cruised to victory over Marvin Vettori as he retained his undisputed 185-pound title in the main event of UFC 263 in Glendale, Arizona.\nThe pair had previously met, when Adesanya claimed a split-decision victory over Vettori in April 2018 in the Nigerian-born Kiwi’s second UFC bout.\nBut in Saturday night’s rematch Adesanya, 31, showed his class with a virtuoso performance as he picked apart the Italian over the full five-round championship duration at the Gila River Arena.\nAfter the result was officially announced, Adesanya dedicated his victory to his teammate Fau Vake, a promising up-and-coming fighter who died in May from injuries sustained in an alleged attack in Auckland, New Zealand.\n“I just want to say Fau Vake, Fau Vake, Fau Vake, I love you, man… This fight I dedicate to you, Fau,” he said."
  },
  {
    "headline": "Breaking: Eriksen wakes up after slumping on the pitch, Denmark vs Finland Euro 2020 game continues",
    "summarized_story": "English referee Anthony Taylor called medics on to the pitch and Eriksen underwent prolonged treatment, including CPR.\nTeam-mates formed a shield around the former Tottenham player, while fans inside the stadium were clearly stunned by the incident, with some pictured in tears.\n“Eriksen is awake and his condition remains stable,” the Danish FA later said.\nA statement read: “Following the request made by players of both teams, UEFA has agreed to restart the match between Denmark and Finland tonight at 20:30 CET.\nEriksen’s club, Inter, tweeted: “Forza Chris, all of our thoughts are with you.”Former team Tottenham said: “Get well soon, Christian."
  },
  {
    "headline": "Pictures: Mr Macaroni joins #June12thProtest in Lagos",
    "summarized_story": "PreviousSadiya Umar Farouq: On the podium of honour"
  },
  {
    "headline": "President Buhari Appoints Ilelah as NBC Director-General -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Army redeploys 11 Generals, 3 colonels in latest shake up -NigPilot",
    "summarized_story": "The Hierarchy of the Nigerian Army , last night redeployed eleven Generals, 3 Colonels in the latest shakeup.\nThe outgone Director Army Public Relations, Brigadier General Mohammed Yerima announced the redeployment in a statement in Abuja.\nAccording the statement, “Nigerian Army (NA) has released posting and appointments of senior officers.\nThis is in line with the Chief of Army Staff vision to have a professional Nigerian Army ready to accomplish assigned missions within a Joint Environment in Defence of Nigeria.\nThe Chief of Army Staff, Major General Faruk Yahaya urged all the affected senior officers to justify the confidence reposed on them."
  },
  {
    "headline": "Buhari flags-off Commercial operation of Lagos-lbadan Train service -NigPilot",
    "summarized_story": "President Muhammadu Buhari has officially flagged off commercial operations of the Lagos-Ibadan standard gauge railway project yesterday.\n” This is already yielding the desired result as construction activities on the railway segment, Kaduna – Kano has commenced with back-end engineering activities.\nRotimi Amaechi earlier in his remarks expressed gratitude to President Muhammadu Buhari for summoning the courage to take the loan from China Exim bank to execute the rail project.\nThanking President Buhari for his support in ensuring the project is a success, he stressed that the occasion is the third time of the President commissioning railway project completed during his tenure.\nHe equally thanked the Minister for being the chief pilot of the project in which the project wouldnt have been successful without his tenacity."
  },
  {
    "headline": "UNODC trains Migration, NAPTIP on data collection on human trafficking -NigPilot",
    "summarized_story": "United Nations Office on Drugs and Crime, UNODC, with funding from the Government of Canada, organized a four-day long training of trainers on data collection and analysis on trafficking in persons and smuggling of migrants, TIP and SOM for officers of Nigeria Immigration Service, NIS, National Agency for the Prohibition of Trafficking in Persons, NAPTIP.\nUNODC said the training would equip officers from the Nigeria Immigration Service, NIS, and the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, with the necessary tools when working with data, but also to train data providers at federal and state levels to improve the overall national reporting on TIP and SOM in Nigeria.\nAccording to the agency, it further engaged in the upcoming months with trained NAPTIP and NIS officers to conduct step-down trainings for NAPTIP and NIS zonal commands, recently established State Task Forces and other data providers.\n“Strengthening evidence-based response to trafficking in persons and smuggling of migrants in Nigeria, project funded by Canada, UNODC is currently conducting a threat assessment of trafficking in persons and related organized crime in Nigeria that will support NAPTIP and NIS in developing evidence-based policies and law enforcement strategies,” said UNODC.\nAlso, NIS Deputy Comptroller General, Ms. Anthonia Ifeoma Opara, said in her opening remarks that “this training of trainers is a commendable attempt by UNODC to strengthen the capacity of relevant agencies to generate and process data on trafficking in persons and smuggling of migrants.”Speaking also, NAPTIP’s Director of Research and Programme Development, Mr. OlusayoOlubiyi, added that “UNODC’s training will go a long way in enriching the knowledge and skills necessary to ensure our data is accurate and precise.”"
  },
  {
    "headline": "Democracy Day: Use Of Teargas Was In Line With Global Standards – Police",
    "summarized_story": "The Nigerian police on Saturday justified its use of tear gas on protesters who took to the streets to mark Democracy Day by voicing their grievances against the government of the day.\nAccording to police spokesman, Mr Frank Mba, the actions of officers were in line with international best practices of dispersing violent protests.\nThe police shot teargas at protesters in Lagos and Abuja.\n‘An isolated case’According to Mr Mba, the use of teargas was an isolated case in Abuja where protesters turned violent.\n“We had an isolated case in Abuja where some of the protesters became unruly and in line with international best practices, police fired teargas at them,” he said."
  },
  {
    "headline": "Democracy Day: Police Shoot Teargas At Protesters In Abuja, Lagos",
    "summarized_story": "﻿The police on Saturday shot teargas to disperse protesters in the Gudu area of Abuja and Ojota area of Lagos as the country marked Democracy Day on June 12.\nThe Unity Fountain in Abuja, which is a popular venue for protests in the nation’s capital, had been shy of protesters as of 8:15am.\n‘Resign from office’According to our correspondent, the protesters in Gudu had turned out in their numbers carrying placards and banners with various inscriptions.\nProtest holds in Oyo, OndoThe Democracy Day protests held at Mokola, Ibadan amid heavy police presence.\nChannels Television reporters also observed protests in Osun state."
  },
  {
    "headline": "We Have Lifted 10.5m Nigerians Out Of Poverty In Two Years – Buhari",
    "summarized_story": "President Muhammadu Buhari on Saturday said his administration has lifted 10.5 million people out of poverty in the past two years.\nIn 2019, the President had promised to work towards lifting 100 million Nigerians out of poverty in 10 years.\n﻿“Our over-all economic target of lifting 100 million Nigerians out of poverty in 10 years is our goal notwithstanding COVID-19.\n“Our conditional cash transfer program has benefited over 1.6 million poor and vulnerable households comprising more than 8 million individuals.\n“I have also recently approved the National Poverty Reduction with Growth Strategy Plan that augments existing plans to further reduce poverty in Nigeria."
  },
  {
    "headline": "June 12: PDP Condemns Clampdown On Peaceful Protesters",
    "summarized_story": "The Peoples Democratic Party (PDP) has condemned the clampdown on peaceful protesters on Democracy Day.\nThe party in a statement signed on Saturday by its spokesperson, Kola Ologbondiyan said “the brutal clampdown on Nigerian citizens is sacrilegious”“The Peoples Democratic Party (PDP) condemns, in the strongest term ever, the violent clampdown by agents of the All Progressives Congress (APC) and President Muhammadu Buhari on Nigerians who are peacefully protesting on Democracy Day.\n﻿“It is awkward that the APC and President Buhari, who were allowed their freedom when they protested in 2014, would turn around to subject Nigerians to actions of inhumanity including the use of firearms against the people, as being witnessed today,” the statement read in part.\nREAD ALSO: Security Operatives Foil Fresh Kidnap Attempt On Another Kaduna SchoolThe party claimed that President Buhari, in his Democracy Day address, failed to rein in his security operatives despite the cautions by the PDP.\nThe party stressed that it is cataloging all the infringements which the APC and President Buhari are imposing on Nigerians and urged all global democratic institutions to take note of the infringements and clampdown on democracy in Nigeria by the APC."
  },
  {
    "headline": "NHRC Calls For More Respect For Human Rights",
    "summarized_story": "The National Human Rights Commission (NHRC) has joined the rest of Nigerians to commemorate the 2021 Democracy Day, with a call for the need for more respect for human rights and fundamental freedoms.\nHe, however, believes that these challenges can be curtailed “if we speak the universal language of respect for human rights and fundamental freedoms which are the foundations of any democracy”.\nSpeaking further, the human rights Chief said, “it is imperative to preserve rights to life and avoid wanton extrajudicial killings in our democracy, asserting that all human beings are born equal in dignity and rights”.\nThe Executive Secretary used the opportunity to commend the Federal Government for recognizing June 12, as the democracy day in Nigeria.\nFinally, he pledged the commitment of the NHRC to continue to educate Nigerians about their rights and responsibilities in order to inculcate the culture of respect for human rights in them emphasizing that law enforcement and human rights are mutually reinforcing rather than being anti each other as perceived by most law enforcement personnel."
  },
  {
    "headline": "Prolonged, recurring University strikes must be addressed- Buhari",
    "summarized_story": "The Nigerian government, according to President Muhammadu Buhari, cannot afford the amount of funds required to resuscitate the country’s educational system.\nBuhari also stated that due of the recent increase in the number of higher schools in Nigeria, competition for cash has become more intense.\nThe President said this on Saturday at the University of Nigeria, Nsukka’s 49th convocation event.\nBuhari, who was represented at the occasion by Minister of State for Education Emeka Nwajiuba, said his administration was committed to meeting the needs of tertiary institutions by allocating funds to the Tertiary Education Trust Fund (TETFUND).\n“We must also address the problems of poor work ethics and the albatross of prolonged and recurrent industrial actions by staff of universities,” the president stated."
  },
  {
    "headline": "NDLEA arrest Uber driver, 2 traffickers with cocaine at MMIA, Lagos",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency, NDLEA, have detained an Uber driver and two other cocaine traffickers at the Murtala Muhammed International Airport, MMIA, in Lagos.\nWhen the package was opened, 150 grams of cocaine hidden inside two pieces of air freshener were discovered.\nThe agency added that on the same day, Udogwu James Johnson, a male passenger on Qatar Airlines from GRU in Brazil, was arrested at D-arrival hall, MMIA, Lagos, with nine wraps of cocaine weighing 300grams in his pant.\nGen. Mohamed Buba Marwa (Retd), has congratulated the MMIA and Lagos state Commands of the Agency on their achievements, while charging the officers and men of the two Commands not to rest on their laurels.\nHe asked them to remain vigilant and intensify the ongoing offensive action against all drug cartels in their areas of responsibility."
  },
  {
    "headline": "Israel Adesanya defeats Marvin Vettori, retains UFC tittle",
    "summarized_story": "Nigeria’s Israel Adesanya returned to winning ways with an outstanding five-round performance on Sunday, defeating Italian contender Marvin Vettori at the Gila River Arena in Arizona.\nAdesanya successfully defended his UFC middleweight title with a unanimous decision victory – 50-45, 50-45, 50-45.\nAdvertisementThe 31-year-old, regarded as one of the best strikers in the division, landed several leg shots and jabs as he ended Vettori’s dream of becoming the first Italian UFC champion.\nIt is the second time both fighters have met in the UFC, with Adesanya winning by split decision in their first meeting in April 2018, the Nigerian’s second outing in the UFC franchise.\nHe had earlier promised to knock the Italian out in the second round, but the fight ended in Round five."
  },
  {
    "headline": "Despite Cryptocurrency Ban, Twitter CEO Dorsey Says Nigerians Will Lead Bitcoin Charge",
    "summarized_story": "Twitter CEO and billionaire co-founder Jack Dorsey, is extremely bullish on the future of bitcoin in Nigeria.\nI write to urge the Nigerian government to pursue economic independence and financial sovereignty by pursuing a national Bitcoin standard.\n“It is no secret that the current global economic environment is worrisome and unsustainable.\nSadly, the fate of the Nigerian economy is in the hands of global central bankers who do not represent the best interests of the Nigerian people.\nWe offer our full support, a willingness to voluntarily consult and commitment to activate every resource available to us in order to see Nigeria pursue a Bitcoin standard."
  },
  {
    "headline": "Nigerian CSOs Ask African Commission to Invalidate Twitter Ban",
    "summarized_story": "Two civil society organisations – Global Rights and Tap Initiative for Citizens Development have applied to the African Commission on Human and People’s Rights in Banjul, the Gambia to invalidate the Twitter ban by the Nigerian government and any measures or steps taken to implement the ban.\nFurther, they asked the commission to hold that Nigeria, by imposing a ban on the use of Twitter has violated Nigerians’ right to freedom of expression as provided for by the African Charter on Human and Peoples’ Rights.\nThe Charter is also part of Nigeria’s law having been domesticated by the African Charter (Ratification and Enforcement) Act of 1983.\nThey also asked the commission to refer the complaint against Nigeria to the African Court on Humanand Peoples’ Rights for determination.\nNigeria deposited with the Commission of the African Union its instrument of ratification of the Protocol to the African Charter on Human and Peoples’ Rights on the Establishment of the African Court on Human and Peoples’ Rights on 9 June, 2004 (hereafter called “the African Court Protocol”."
  },
  {
    "headline": "Nigeria Drug Agency Intercepts 100,000 Bottles of Codeine Syrup at Onne Port",
    "summarized_story": "About 100,000 bottles of codeine syrup with a total weight of 15,325kilograms were at the weekend intercepted and seized by the National Drug Law Enforcement Agency, NDLEA, at the Onne seaport, Port Harcourt, Rivers State.\nThe consignment packaged as dried green tea was shipped from Addis Ababa, Ethiopia, on board Ethiopian airline flight ET911.\nGeneral Mohamed Buba Marwa (Retd) has however hailed the synergy among the various government agencies at the Onne port and charged them not to rest on their oars as they daily work hard to keep Nigeria safe.\nHe particularly commended the Commander, officers and men of the Port Harcourt Port Command and their Abuja airport Command counterparts for their vigilance and commitment to the task of ridding Nigeria of illicit drugs.\n“The damage 100,000 bottles of codeine would have done to our youths if they had slipped through the port to our villages, towns and cities is unimaginable."
  },
  {
    "headline": "Nigeria Cannot Afford Funds to Revive Education, Buhari Says",
    "summarized_story": "President Muhammadu Buhari has said the Nigerian government cannot afford the amount of funding needed to revive the country’s educational system.\nBuhari also said the competition for funds had become keener because of the recent increase in the number of tertiary institutions in Nigeria.\nThe president spoke on Saturday at the 49th convocation ceremony of the University of Nigeria, Nsukka.\nBuhari, who was represented at the ceremony by the Minister of State for Education, Emeka Nwajiuba, however, said his administration was committed to addressing the needs of tertiary institutions through budgetary allocations to the Tertiary Education Trust Fund (TETFUND).\nBuhari advised academic institutions across the country to embark on the kind of innovative research that could help boost production and diversify the economy."
  },
  {
    "headline": "June 12: Nigerians Stage Protests Nationwide",
    "summarized_story": "Nigerians on Saturday staged protests and rallies around the country to mark the second anniversary of declaration June 12 as Democracy Day and protest the state of affairs in the country.\nHowever, all was peaceful in known flashpoints in the state, like Oshodi, Ojodu-Berger, Ojuelegba, Fagba, and Ketu, as many residents celebrated the June 12 Democracy Day in their homes.\nBAYELSABayelsa State Governor, Senator Douye Diri, expressed his administration’s determination to change the development narrative of the state.\nJoseph Hayab, said June 12 could not be celebrated as Democracy Day because Nigerian leaders were not democratic.\nHayab said Nigerians could not be governed by intimidation and still celebrate June 12 as Democracy Day."
  }
]