[
  {
    "headline": "Journalists’ lives under threat in Nigeria, says US",
    "summarized_story": "The United States of America has called for the protection of the lives of journalists in Nigeria, saying that threats to journalists have been alarming.\nIbelli said, “I appreciate International Press Centre for partnering with us.\n“Many people look to the media to help tell the story.\nWe will continue to work on the improvement of the training, welfare of journalists and how to combat misinformation.\nWe are particularly concerned about the protection of journalists, and their safety in reporting.”"
  },
  {
    "headline": "98% of allocated COVID-19 doses used – FCT minister",
    "summarized_story": "Minister of the Federal Capital Territory, Muhammad Bello, on Thursday, said 98 per cent of the doses of the COVID-19 vaccine allocated to Abuja have been used.\nThis is as he commended residents of the FCT for their response to the vaccination efforts of the government.\nAccording to a statement by his Chief Press Secretary, Anthony Ogunleye, the minister spoke when he led other members of his cabinet to receive the second dose of the COVID-19 vaccine.\nThe statement was titled ‘FCT minister takes second dose of COVID-19 vaccine.’It read, “Bello revealed that 98 per cent of the doses of the COVID-19 vaccine allocated to the Territory have been utilized and commended residents of the FCT for their response to the vaccination efforts of the government.\n“The minister also assured that the FCT Administration will continue to work hard to ensure that every resident is protected against COVID-19, with the efforts of the FCT Health and Human Services Secretariat."
  },
  {
    "headline": "Insecurity: Nigeria can’t afford another civil war — CAN Youth Wing",
    "summarized_story": "By Luminous Jannamike, ABUJAThe Christian Association of Nigeria, Youth Wing, on Thursday, said Nigeria cannot afford another civil war because it will not augur well for the country since it has yet to recover from the devastating effects of the Biafra war.\nThe national chairman of CAN’s Youth Wing, Belusochukwu Enwere, who said this in a statement issued in Abuja, described the security situation in the country as saddening.\n“The security situation in the country, especially South East saddens my heart.\n“We, therefore, call on the Federal Government, State Governors, military, police and other security agencies to sit-up and do the needful.\nThe CAN Youth Wing chairman also said that the elite could make a great difference just by the words they speak."
  },
  {
    "headline": "We can’t give Nigeria a brand new constitution —Senate",
    "summarized_story": "He said: “Now, some of our compatriots have urged that rather than amend the constitution, we should make a new constitution all together.\nSpecifically, Section 9 of the constitution empowers the National Assembly to alter the provisions of the constitution and prescribes the manner in which it is to be done.\nAnd I assure you, this committee is strongly committed to its obligations to facilitate public involvement in the constitution review process.\nHe said: “The National Assembly has successfully reviewed/amended the constitution of the Federal Republic of Nigeria (as amended) (the Constitution) vide the First, Second, Third and Fourth Alteration Acts.\n“The exercise is, therefore, being rounded up with this national public hearing in the nation’s capital."
  },
  {
    "headline": "LASU VC’s appointment, Sanwo-Olu has no anointed candidate- Aide",
    "summarized_story": "By Olasunkanmi AkoniThe Lagos Government has assured all stakeholders that the appointment of the next Vice-Chancellor for Lagos State University, LASU, will be based on due process and merit, stressing that Governor, Babajide Sanwo-Olu has no anointed candidate for the post.\nAccording to him: “By law, there must be an advert that calls for applications from qualified candidates for the post of the Vice-Chancellor.\nThe requirements for the post as contained in the advert must be ratified by a properly constituted Governing Council before publication.\nThe Chairman was accused of suggesting names of preferred candidates to the Council at its first meeting.\nAccording to him, the focus of the State Government is the constitution of a new Governing Council and a Visitation Panel that will ensure a free and transparent process of appointing the LASU Vice-Chancellor."
  },
  {
    "headline": "Bandits demand N30m ransom for 2 kidnapped Kaduna nurses after collecting N10m",
    "summarized_story": "By Ibrahim HassanWuyoBandits who kidnapped two nurses at the General Hospital Doka, Kajuru Local Government Area of Kaduna state , have demanded for N30 million ransom before they would free the captives.\nChairman of the National Association of Nigeria Nurses and Midwives (NANNM), Kaduna State chapter, Comrade Ishaku Yakubu, told journalists that the kidnappers have already collected N10 million ransom from relatives of the nurses.\n“The kidnappers initially demanded for N10 million; N50,000 recharged cards and four Tecno handsets which were delivered to them two weeks ago.\nAfter collecting the N10 million ransom, they called to ask for more money.”“The initial N10 million paid to the bandits was generated through contributions by well-wishers in the state.”“N10 million was paid in batches because they first collected N2.5m.\n“The bandits also collected N450,000 from the victims’ relations apart from the N10m.The bandits didn’t want to talk to anybody again until the additional ransom is paid,” he added."
  },
  {
    "headline": "NDDC Substantive Board: Another N’Delta group petitions Buhari, gives ultimatum",
    "summarized_story": "By Egufe Yafugborhi, PORT HARCOURTAS agitation for the constitution of a substantive board for the Niger Delta Development Commission (NDDC) rages, Niger Delta Youth Congress (NDYC) has joined the bandwagon of petitions to Presidents Mohammadu Buhari to heed to their demands within two weeks or face unrest from the region.\nFollowing key resolutions adopted at an emergency Congress in Sapele, Delta State, NDYC, expressed disappointment at Buhari’s efforts at developing the Niger Delta on the ground of slow pace of intervention in the oil-rich region.\nIn the resolutions signed by Ogboka Umeda, President General NDYC, the group noted that NDDC management as currently structured, “Denies the region’s youths many opportunities like empowerment, skill acquisition, contracts and even scholarship to the extent that there is a cartel in whose control activities of the Board are now shrouded in secrecy.\n“Also, the ongoing reconstruction of East/West road is in a snail movement and we doubt if the job will be completed before you exit office in 2023.”Umeda demanded of Buhari that, “Ongoing forensic audit at the Commission is a sham and ploy to footh drag development in the Niger Delta through the one man show of Sen Godswill Akpabio and his Akwa brother, hence the imperative for immediate sack of the sole administrator.\n“That the Niger Delta Youth Congress NDYC hereby issues a two week ultimatum for an immediate reconstitution of NDDC Board for effective functioning and in with line with its mandate of meaningfully engaging our youths as well as develop the region“Failure to meet our demands will mean shutting down all oil and gas operations in the Niger Delta region as the youths of the region shall be fully mobilised to take action at the expiration of the ultimatum”Vanguard News Nigeria"
  },
  {
    "headline": "Okorocha warns against ethnic profiling",
    "summarized_story": "Former Governor of Imo State, Rochas Okorocha, has warned against the ethnic profiling of Igbo people, insisting they “are not killers”.\nOkorocha stated this on Thursday, during the centenary celebration in honour of the former Premier of Eastern Nigeria, the late Michael Okpara, in Abuja.\n“I appeal to all Nigerians to stop the ethnic profiling of the Igbo.\nGulak, an ex-political adviser to former President, Goodluck Jonathan, was killed in Owerri, Imo State at the weekend.\nAhmed Gulak: Rochas Okorocha finally reacts to murder of APC chieftain in Imo"
  },
  {
    "headline": "Over 150 bandits invade Katsina communities, lose 6 members as police repels attack",
    "summarized_story": "Armed motorcycle riding bandits, numbering about a hundred and fifty, Thursday attacked Wurma and Yarbudu villages in Kurfi LGA.\nThe attack on Wurma village was successfully repelled by a team of Mobile Police personnel operating along the Wurma axis who engaged the hoodlums in a fierce gun battle.\nOne of the bandits was neutralized and a motorcycle was recovered in the encounter while scores of them escaped with gunshots wounds.\nThis was disclosed in a statement made available to journalists by the PRO Katsina State Police Command, Isah Gambo on behalf of the State Police Commissioner.\nOndo College of Education bans students from driving cars, power bikes on campus"
  },
  {
    "headline": "Kidnappers free 75-year-old Nigerian Catholic Priest after killing Fr Alphonsus",
    "summarized_story": "After spending two weeks at his kidnappers den, 75-year-old retired Northern Nigerian priest, Father Joe Keke has been freed by his abductors.\n“This is to officially announce that the “very Rev Fr joe Keke” has been received from the hands of his kidnappers.\nMay the soul of fr Alphonsus Bello through the mercy of God Rest In Peace, ” Fr Chris Omotosho, Director of Communication said.\nAlphonsus Bello were kidnapped by bandits from the premises of St Vincent Ferrer Catholic Church, Malumfashi, Katsina State on 21 May 2021.\nAlphonsus Bello was found at the back of the Catechetical Training Centre of the parish by a search team."
  },
  {
    "headline": "FCT Minister, Bello receives second dose of COVID-19 vaccine",
    "summarized_story": "Minister of the Federal Capital Territory, FCT, Muhammad Musa Bello, has received his second dose of the AstraZeneca COVID-19 vaccine.\nDAILY POST recalls that the Minister on March 11 2020 took his first jab in his office at Area 11, Abuja making him eligible for the second dose.\nSpeaking after receiving the vaccine on Thursday, the Minister revealed that 98 percent of the total doses allocated the FCT by the Federal Government have been used.\nThe Minister also assured that the FCT Administration will continue to work hard to ensure that every resident is protected against COVID-19, with the efforts of the FCT Health and Human Services Secretariat.\nCOVID-19: 4,683 Nigerians receive second dose of AstraZeneca Vaccine — FG"
  },
  {
    "headline": "June 12: Prophet TB Joshua declares fasting, prayer for Nigeria",
    "summarized_story": "Prophet TB Joshua, founder of the Synagogue, Church of All Nations (SCOAN) has called for fasting and prayer for Nigeria.\nJoshua said Nigerians should fast and pray for Nigeria on June 12, 2021, which happens to be his birthday.\nI feel their pain; I feel their worry so pray for Nigeria on June 12, 2021.\n“Let us dedicate this day to prayer and fasting.\nDon’t forget the needy.”Dare: T.B Joshua reacts to death of Pastor Adeboye’s son"
  },
  {
    "headline": "EKEDC signs MoU with Lagos, NDPHC for power supply upgrade",
    "summarized_story": "By Muyiwa LucasEKO Electricity Distribution Company Plc (EKEDC) has partnered the Niger Delta Power Holding Company Limited (NDPHC) to improve electricity supply in Lagos.\nThe signing ceremony for the MoU was chaired by the Lagos State Governor, Babajide Sanwo-Olu, and coordinated by Commissioner for Energy and Mineral Resources, Olalere Odusote.\nThe collaboration is significant considering the strategic importance of Lagos State as Nigeria’s commercial capital and host state for key industries in Nigeria.\nThe collaboration is significant considering the strategic importance of Lagos State as Nigeria’s commercial capital and host state for key industries in Nigeria.\nGovernor, who is himself a key member of NDPHC’s Board of Directors, and whose state, Lagos, is one of NDPHC’s shareholders."
  },
  {
    "headline": "Why NNPC is considering equity in Dangote refinery, others",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) is considering equity participation in some private refineries in line with a Federal Government’s policy directive which stipulates the mandatory participation of the corporation in any private refinery that exceeds 50,000 barrels per day capacity in keeping with its statutory role of safeguarding national energy security.\nIn this regard, the Corporation has identified at least six refinery projects in which it intends to seek equity participation, five of them are at the development stage with the Dangote Refinery being the largest of them.\nThese roles enable it to achieve the twin objectives of providing energy security for the country and stimulating the nation’s economic development and growth.\nThe sector is one of such segments where NNPC is revisiting its strategy to strengthen domestic refining capacity and guarantee National Energy Security.\nThe new vision is to grow domestic refining capacity, improve petroleum products supply from our local refineries and become a net exporter of petroleum products."
  },
  {
    "headline": "Lagos dislodges 10 illegal slaughter slabs",
    "summarized_story": "The Lagos State government says it has dislodged 10 more illegal slaughter slabs and animal markets in four areas of the state.\n“During the week, officials of the MEC team of the state, dislodged four illegal slaughter slabs and animal markets at Ayobo-Ipaja, Odogunyan and Maya in Ikorodu, as well as Mangoro, on Old Abeokuta Expressway.\nADVERTISEMENT“During the operation, 21 live rams, 13 live goats and well over 4.5 tonnes of meat carcass were confiscated.\n“The meat carcass, after being certified safe for consumption, had been donated to orphanages and correctional homes.\n“It has been observed that animals slaughtered at these illegal slaughter slabs are not inspected by veterinary officials, as a result, the wholesomeness cannot be vouched for."
  },
  {
    "headline": "Ondo school bus hijack was robbery, say police",
    "summarized_story": "By Osagie Otabor, AkureOndo State Police Command yesterday evening said the hijack of a school in Oba Ile community, Akure North local government area was an armed robbery attempt, and not kidnapping.\nA lady was on the bus that was taken away by the hoodlums.\nCommissioner of Police, Bolaji Salami in an interview with journalists said it was a case of robbery and not abduction,’ adding that the school bus taken away by the robbers would be retrieved.\nHe said the incident was not a case of kidnapping as is the case in some parts of the country.\n“Initially we were thinking that the perpetrators would kidnap the lady but from all indications, they were after the school bus."
  },
  {
    "headline": "Epetedo declaration 27th anniversary to hold June 11",
    "summarized_story": "By Robert EgbeVice-President Yemi Osinbajo will deliver a keynote address at the 27th anniversary of the Epetedo declaration by the late Moshood Kashimawo Olawale (MKO) Abiola, the organisers have said.\nChief Abiola, recognised winner of the June 12, 1993 presidential election, declared himself the president, at Epetedo, in the heart of Lagos, on June 11, 1994, after waiting a year for his mandate to be restored.\nHis defiance of the military junta, which later annulled the poll, led to Abiola’s arrest and subsequent death in detention.\nOthers are the Chairman, National Drug Law Enforcement Agency (NDLEA), Buba Marwa and Senator Biyi Durojaiye, Acting Leader, Afenifere Egbe Ilosiwaju Yoruba.\nLagos State Governor Babajide Sanwo-Olu, it added, is host governor, while the principal host is Speaker, Lagos State House of Assembly, Mudashiru Obasa, among other participants."
  },
  {
    "headline": "Sit up, tackle insecurity –CAN youths tell Buhari",
    "summarized_story": "The Youth Wing of the Christian Association of Nigeria, YOWICAN, has lamented the insecurity in the country.\nBelusochukwu Michael Enwere, in a statement, yesterday, said the situation in Nigeria, especially the South East, calls for urgent action and attention.\nEnwere explained that Nigerians cannot afford to live in a season of anomie with the ongoing bloodshed and the way and manner in which youths, politicians, students and security agencies are being killed without proper justification.\n”The scars of the civil war are still fresh in our minds and psyche, and so, we cannot afford another one.\nThe time to avoid a needless war is now!"
  },
  {
    "headline": "Ethnic, religious bigots fuelling insecurity –Lawan",
    "summarized_story": "From Fred Itua, AbujaSenate President, Ahmad Lawan, yesterday, lamented the spate of insecurity in recent times.\nHe said it has taken an alarming dimension with killings, kidnappings and wanton attacks on public facilities becoming daily events in many parts of the country.\nHe stated this at Blueprint Newspapers’ Governor of the Year 2020, held in Abuja, yesterday.\nHe said the exercise seeks to strengthen Nigeria’s democratic institutions, such as the Legislature and the Judiciary at the national and subnational levels, the local government system, the Independent National Electoral Commission (INEC) and Civil Societies.\nHe explained that the move would check abuses and strife responsible for holding back the development of Nigeria’s economy and polity."
  },
  {
    "headline": "Nigeria now flowing with bitterness, sadness –Obasanjo",
    "summarized_story": "From Laide Raheem, AbeokutaFormer President Olusegun Obasanjo, yesterday, lamented the deplorable state of Nigeria, saying the country now flows with bitterness and sadness, rather than milk and honey.\nObasanjo expressed unhappiness that the country is not progressing as destined by God, stressing that Nigeria ought to be the leader of the black race.\nThe book was facilitated by the Vice Chairman/CEO, SIFAX Group Limited, Dr. Taiwo Olayinka Afolabi, and donated to the Olusegun Obasanjo Presidential Library (OOPL) for all federal tertiary institutions.\nObasanjo said Nigeria was endowed with both natural and human resources to excel, but bad leadership has robbed the country of its position, not only in Africa, but the world at large.\nRight now, it is a land flowing with bitterness and sadness; that is not what God wants this country to be."
  },
  {
    "headline": "FG playing politics with judicial autonomy –Wike",
    "summarized_story": "From Tony John, Port HarcourtRivers Governor, Nyesom Wike, has accused the Federal Government of playing politics with judicial autonomy in total disregard to constitutional provisions.\nGovernor Wike said a federal government that is promoting autonomy of the judiciary should not have allowed the nation’s courts to be shut for about two months by Judiciary Staff Union of Nigeria (JUSUN).\n“Is it true that the Federal Government wants the autonomy of the judiciary?\nWike explained that the funds released by Rivers State Government to the judiciary far exceeds the planned deductions by the Federal Government.\nInaugurating the facility, Chief Justice of Nigeria, Ibrahim Tanko Muhammad, noted that Governor Wike has remained a strong voice in the clamour for judicial independence and financial autonomy."
  },
  {
    "headline": "Insecurity: Onion producers suspend supply to South East",
    "summarized_story": "Onion Producers and Marketers Association (OPMAN) yesterday ordered the suspension of supply to markets in the South East citing growing insecurity in the region.\nIt is feared that the decision could result in scarcity and astronomical rise in the cost of the produce should there be no speedy intervention by government.\nAccording to OPMAN’s National President, Aliyu Isah, the group decided to suspend supplies based on the recent hijack of two of their members’ trucks by gunmen suspected to be members of the proscribed Indigenous People of Biafra (IPOB) in Imo State.\nGunmen were believed to have hijacked the trucks and distributed their contents to the public, an act that infuriated the onion producers and marketers given the attendant loss to their business.\nThe north had earlier this year ordered a food blockade to the south over alleged incessant killings of their members in the south."
  },
  {
    "headline": "Obasanjo: Bad Leadership Has Turned Nigeria to Land of Bitterness, Sadness",
    "summarized_story": "But despite the worsening insecurity, the federal government has said it is preposterous for anyone to declare Nigeria a failed state on the basis of the country’s security challenges.\n“Right now, it is a land flowing with bitterness and sadness; that is not what God wants this country to be.\nInsecurity Does Not Make Nigeria Failed State, Insists FGMeanwhile, the federal government has said it is preposterous for anyone to declare Nigeria a failed state due to the country’s security challenges.\n“Nigeria’s worldwide companions, particularly the USA, should acknowledge that Nigeria is now a failed state.\n“Declaring any nation a failed state is not done at the whims and caprices of one or two persons, no matter their status."
  },
  {
    "headline": "DHQ Allays Fear of Mass Retirement",
    "summarized_story": "By Kingsley NwezehThe Defence Headquarters (DHQ) yesterday allayed concerns about possible mass retirement of top military officers superior to the Chief of Army, Maj. Gen. Farouk Yahaya.\nGen.Bernard Onyeuko, said the military was not contemplating any retirement and had, in fact, not retired any general.\nHe said the operations were the combined efforts of the military and other security agencies involving land, maritime and air operations.\nHe said there were also extensive air operations, which included air patrols, intelligence surveillance and reconnaissance missions, offensive air strikes, air interdictions, search and rescue operations, and close air support for ground troops.\nHe added: “They rescued kidnapped victims, neutralised scores of terrorists, destroyed terrorists’ enclaves, arrested terrorists and intercepted terrorists’ logistics items, including vehicles."
  },
  {
    "headline": "FG Protests Deletion of Tweet, Says Twitter Can’t Gag Buhari",
    "summarized_story": "The accusation followed the decision of Twitter to delete a controversial post by Buhari on the Nigerian civil war.\nThe same Twitter during the ENDSARS protests promoted tweets trying to raise funds for the ENDSARS protesters.\nIf Mr. President, anywhere in the world feels very bad and concerned about a situation, he is free to express such views.\nBy whatever name, you can’t justify giving orders to kill policemen or to kill anybody you do not agree with.\nHe said: “There are so many people who have been spewing hate against Mr. President, against this governments."
  },
  {
    "headline": "Ezeife: South-east Violence, Plot to Undermine Clamour for Igbo Presidency",
    "summarized_story": "Ezeife described the insurrection in the South-east as an attempt to provoke indigenes of the South-east.\n“Now we know that more than 80 per cent of the people caught by the CCTV are not from the South-east.\nHe stated that a South-east governor who had earlier accused IPOB and ESN of executing the attacks had since exonerated the secessionist group.\nDuring the ENDSARS protests, people attributed what was happening in Lagos to some Igbo people and it was later discovered to be untrue.\nThe guild thanked Ganduje and members of the state Executive Council for providing the enabling environment for the national convention to hold."
  },
  {
    "headline": "$40bn Investments Needed for Nigeria’s Gas Plan, Says NNPC",
    "summarized_story": "He added that the figure on the quantum of funds needed is based on the submissions NNPC has received from potential investors.\nIn addition, he stated that about 39 thermal power plants were being targeted as opposed to the current 33.\nHe said: “In terms of benefits, we will generate 45,000 megawatts of power in terms of gas use, creating massive employment and import substitution.\n“There are changes we need to look at to actualise the decade of gas.\nHe stated that if Nigeria will achieve the decade of gas, it must transit to a willing-buyer willing-seller market."
  },
  {
    "headline": "After Deleting Tweet, Twitter Removes Video Featuring Buhari's Genocidal Comment",
    "summarized_story": "The microblogging platform, Twitter, has yanked off a video which showed President Muhammadu Buhari threatening to deal with youths of the South-East.\nIn the video, Buhari noted the role he played alongside other Nigerian military officers in the Nigerian Civil War of 1966-70, which led to the murder of over three million Igbos.\nSee Also Breaking News BREAKING: Twitter Deletes Buhari’s ‘Genocidal Tweet’ After Condemnation By NigeriansThis was after many Nigerians reported massively, Buhari's Twitter account likening the tweet to comments made by former United States President, Donald Trump which caused his ban from the social media app.\nSee Also Breaking News BREAKING: Twitter Is Bias, Favours Biafra Agitation, Nnamdi Kanu's Inciting Remarks—Nigerian Government“Has Twitter deleted the violent tweets that Nnamdi Kanu has been sending?\nWhat is their agenda?”See Also Politics Nigerians Rejoice As Twitter Deletes Buhari’s ‘Genocidal Tweet’"
  },
  {
    "headline": "After Deleting Tweet, Twitter Removes Video Featuring Buhari's Genocidal Comment",
    "summarized_story": "The microblogging platform, Twitter, has yanked off a video which showed President Muhammadu Buhari threatening to deal with youths of the South-East.\nIn the video, Buhari noted the role he played alongside other Nigerian military officers in the Nigerian Civil War of 1966-70, which led to the murder of over three million Igbos.\nSee Also Breaking News BREAKING: Twitter Deletes Buhari’s ‘Genocidal Tweet’ After Condemnation By NigeriansThis was after many Nigerians reported massively, Buhari's Twitter account likening the tweet to comments made by former United States President, Donald Trump which caused his ban from the social media app.\nSee Also Breaking News BREAKING: Twitter Is Bias, Favours Biafra Agitation, Nnamdi Kanu's Inciting Remarks—Nigerian Government“Has Twitter deleted the violent tweets that Nnamdi Kanu has been sending?\nWhat is their agenda?”See Also Politics Nigerians Rejoice As Twitter Deletes Buhari’s ‘Genocidal Tweet’"
  },
  {
    "headline": "BREAKING: Tension In Lagos As Nigerian Soldier Kills Customs Officer",
    "summarized_story": "Tension has gripped people living around Seme boarder in Badagry area of Lagos state as a soldier on Wednesday night allegedly shot dead a Customs officer in the area.\nThe soldier, according to residents, was said to be under the influence of alcohol.\n“Fears are currently mounting on possible breakdown of law and order in this area,” a source said.\nMuyiwa Ogunjobi, police spokesman in Lagos state told SaharaReporters that the command was not aware of the incident.\n“We are not yet aware, where?"
  },
  {
    "headline": "BREAKING: Tension In Lagos As Nigerian Soldier Kills Customs Officer",
    "summarized_story": "Tension has gripped people living around Seme boarder in Badagry area of Lagos state as a soldier on Wednesday night allegedly shot dead a Customs officer in the area.\nThe soldier, according to residents, was said to be under the influence of alcohol.\n“Fears are currently mounting on possible breakdown of law and order in this area,” a source said.\nMuyiwa Ogunjobi, police spokesman in Lagos state told SaharaReporters that the command was not aware of the incident.\n“We are not yet aware, where?"
  },
  {
    "headline": "Trump Republicans, Liz Cheney and 2022 Elections By Chido Nwangwu",
    "summarized_story": "Only a few hours ago, today Friday May 14, 2021 House Republicans chose a cheerleader for former President Donald J. Trump, Rep. Elise Stefanik (of New York), to replace the truly conservative Liz Cheney (of Wyoming).\n“It’s official- Liz Cheney has been fired from House Leadership and I was proud to vote against her,” Rep. Lance Gooden (Republican from Texas), yelled, literally on Twitter.\nShe challenged the errant, divisive and destructive lies and ways of the impeached former President Trump.\nThe mob was assembled by Trump and his cronies —Including his “lawyer” Rudy Guiliani who raised the graeco-roman era “trial by combat”!\n\"I am a conservative Republican, and the most conservative of conservative values is reverence for the rule of law."
  },
  {
    "headline": "Gumi to FG: There are bandits willing to fight the 'ugly ones' -- use them",
    "summarized_story": "Ahmad Gumi, a prominent Islamic cleric, has asked the federal government to use ”bad bandits” to fight the “ugly ones”.\nAdvertisementSpeaking with The PUNCH, Gumi said many of the bandits are willing to dialogue with the federal government and ready to surrender themselves for use.\nWe have a lot of them that are ready to fight the bad ones.\n“Use the bad to fight the ugly, and use the good to fight the bad ones when you’re done with the ugly.\n“All these agitations you see, if the government can do a splinter group and the splinter group is empowered, every man wants power and money, they will do your job."
  },
  {
    "headline": "Gumi to FG: There are bandits willing to fight the 'ugly ones' -- use them",
    "summarized_story": "Ahmad Gumi, a prominent Islamic cleric, has asked the federal government to use ”bad bandits” to fight the “ugly ones”.\nAdvertisementSpeaking with The PUNCH, Gumi said many of the bandits are willing to dialogue with the federal government and ready to surrender themselves for use.\nWe have a lot of them that are ready to fight the bad ones.\n“Use the bad to fight the ugly, and use the good to fight the bad ones when you’re done with the ugly.\n“All these agitations you see, if the government can do a splinter group and the splinter group is empowered, every man wants power and money, they will do your job."
  },
  {
    "headline": "Newspaper Headlines: Senate rejects calls for new constitution",
    "summarized_story": "The response of the senate to those calling for a new constitution against amendment of the 1999 constitution dominated the headlines of Nigerian newspapers.\nAdvertisement"
  },
  {
    "headline": "Newspaper Headlines: Senate rejects calls for new constitution",
    "summarized_story": "The response of the senate to those calling for a new constitution against amendment of the 1999 constitution dominated the headlines of Nigerian newspapers.\nAdvertisement"
  },
  {
    "headline": "Daily COVID Tracker: NCDC records 18 deaths as cases surge",
    "summarized_story": "AdvertisementBiden to share 25 million COVID vaccine doses with worldPresident Joe Biden has announced plans to share the first 25 million unused COVID-19 vaccine doses with the rest of the world.\nOyo farmers to get World Bank COVID interventionThousands of farmers affected by the COVID-19 pandemic in Oyo will receive the state government’s intervention sponsored by the World Bank.\nAdvertisementRichard Lako, WHO emergency manager in the north-east, said this during the sensitisation of 60 health workers on risk communication in Damaturu, Yobe state capital.\nEighteen die of COVID-19 in NigeriaThe Nigeria Centre for Disease Control (NCDC) says 18 people died of COVID-19 complications within 24 hours on Thursday.\nThe approval brings to three the number of COVID vaccine authorised in the country after AstraZeneca vaccine and Russia’s Sputnik V.COVID-19 IN NIGERIA"
  },
  {
    "headline": "Can TalentQL’s six-month program fill Africa’s need for senior developers?",
    "summarized_story": "According to Yusuf, the program is necessary because up to 90% of TalentQL’s clients want senior software engineers.\nThey have now expanded their talent pool to include Latin America to more ably serve the senior talent need that Africa alone cannot solve.\nThere will be a screening process to choose only those who want to “make the jump to become Senior Software Developers,” Yusuf says.\nAdewale Yusuf, TalentQL’s founderWhich, as you may have deduced, means that solving Africa’s shortage of senior developers will require more than one training of this sort.\nYet, it could be a valuable experiment for the ecosystem in training senior developers."
  },
  {
    "headline": "After Buhari’s “civil war” tweet is deleted, Nigerian minister accuses Twitter of suspicious agenda",
    "summarized_story": "Buhari’s deleted tweet was widely criticised as summoning the ghosts of the Nigeria civil war, a deadly three-year combat between the Nigerian government and a government in southeast Nigeria, which had seceded from the republic.\n“Many of those misbehaving today are too young to be aware of the destruction and loss of lives that occurred during the Nigerian Civil War,” the tweet read.\nTwitter had never deleted tweets by the Nigerian president before.\n“Has Twitter deleted the violent tweets that Nnamdi Kanu has been sending?\nWhat is their agenda?”Last October, Twitter became the platform where the world learned much about END SARS protests in Nigeria."
  },
  {
    "headline": "Banks don’t fund African renewable energy startups. So where can founders find money?",
    "summarized_story": "Michael Famoroti, chief economist at Stears gave two reasons during a recent TechCabal Live event on financing renewable energy companies in Africa.\nLike renewable energy for example.\nWiebe Boer, All On’s managing director, empathizes with founders who need funding but have little sources to reach out to.\nFrom there, it might be possible to access funding from All On’s initiatives for projects at the ideation stage.\nBut he hopes they persevere because “ultimately, there is a big market to serve.”Watch the full video of the TechCabal Live event on financing an African renewable energy company here."
  },
  {
    "headline": "2021 Kickstart: International Breweries Calls for Application from Young Entrepreneurs",
    "summarized_story": "The application portal for young entrepreneurs between 18 and 35 years old to apply to the highly anticipated 6th Edition of International Breweries Plc’s Kickstart Initiative is now open.\nEndAbout International Breweries Plc.\nInternational Breweries Plc (IBPLC), is a proud part of the world’s largest brewer, Anheuser-Busch InBev, (AB InBev), the world’s largest brewer with over 400 beer brands.\nInternational Breweries was established in 1971 and was listed on The Nigerian Stock Exchange in 1995.\nAB InBev consolidated its business stakes in Pabod Breweries Limited, Intafact Beverages Limited into its majority ownership of International Breweries Plc in a merger that was concluded in December 2017."
  },
  {
    "headline": "Highlights from the Extraordinary Launch of the Infinix Note 10 – Where Beauty meets Strength",
    "summarized_story": "Did you miss the most exciting smartphone launch in recent times?\nInfinix Mobility has unveiled yet another product — the Infinix Note 10, the device that meets beauty with strength.\nThe launch, which was tagged, ‘Meet Beauty With Strength’ illustrates the beautiful screen and body of the device, while showing the strength of its processor.\nInfinix Nigeria went all out at the launch of the new Infinix Note 10 to showcase the elements of the new Note 10- Speed, Beauty, Power, and Strength.\nThe Infinix Note 10 boasts of being the World’s biggest center-punch screen smartphone with a super amazing Helio G95 processor."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Kenya-based startup, Kibanda TopUp, raises $460k pre-seed",
    "summarized_story": "Kibanda TopUp, a Kenyan startup which aims at digitising the food supply chain for micro, small, and medium restaurants in Africa has closed a $460k pre-seed round to increase its customer base.\nThe involvement of local investors like Rockson and Agboola continues a growing trend of African investment in early-stage startups.\n“We are increasing restaurants’ contributions to Africa’s GDP by helping reduce cost with the supply chain.\nBased on Blauwhoff’s skills in entrepreneurial digital strategy and project management, and Mutambo’s experience in logistics, Rockson expresses confidence in the founders’ vision.\nKibanda TopUp has a great opportunity to drive a transformation of these businesses into a formal restaurant cooperative to maximise the economic potential."
  },
  {
    "headline": "Twitter launches Birdwatch to combat misinformation",
    "summarized_story": "Twitter has revealed plans to roll out Birdwatch as part of its efforts to combat misinformation on the platform.\nThe social media platform informed users in a tweet that they might see Tweets with Birdwatch notes across all devices.\nA pilot version of the product was launched in January, with the social media giant calling it a community-based approach to misinformation.\nYou’ll still be able to get to Birdwatch notes on that Tweet by clicking on the Birdwatch icon in the Tweet details page.\nAs social media platforms become more powerful, the question about whose responsibility it is to check abuse remains."
  },
  {
    "headline": "Nigeria’s Siltech produces electric vehicles, for a clean and elegant Africa",
    "summarized_story": "So far, it has been difficult to achieve improved adoption of electric vehicles.\nTolu Williams’ first electric bike.\nIts suspension, while being good for Asian and European roads, could not survive Nigerian roads.\nBefore long, Williams could fix the suspensions, increase the battery capacity, and improve the motor controllers on the electric bike he bought.\n“As long as you can charge your laptop and your mobile phone, you have access to charging life; you can charge your electric bike."
  },
  {
    "headline": "Nigeria needs oil at $103 to boost economy",
    "summarized_story": "Nigeria needs oil at $103 to boost economyPositive crude oil prices since the Organisation of the Petroleum Exporting Countries (OPEC) projected increase in demand have raised hope of a better global fiscal performance after severe disruptions caused by COVID-19 that unsettled oil-dependent economies.\nOn Thursday, the price of Brent, against what Nigeria’s oil is priced, grew by 1.57 percent to open at…"
  },
  {
    "headline": "Banks’ cheap funds don’t reflect in loans to customers",
    "summarized_story": "Nigerian banks access low-cost funds from individual/corporate deposits, interventions from the Central Bank of Nigeria (CBN) and development finance institutions but lend same to customers at higher rate.\nA publication by the CBN, themed ‘Bullion,’ noted that 2019 started with the industry weighted average prime lending rate (PLR) and maximum lending rate (MLR) as high as 16.01 percent and 30.48 percent, respectively.\nThis implies that while the cost of funds to banks was declining, lending rate was on the rise.\nThis disparity was a clear signal of exploitation by the banks, which is no doubt unfriendly to growth, the publication stated.\nArising from the adjustment in the Cash Reserve Ratio (CRR) to 27.5 percent in January 2020, however, the private sector credit moderated to 12.57 percent."
  },
  {
    "headline": "Nigeria falls short of 2020 financial inclusion target as 38m adults lack access",
    "summarized_story": "Nigeria failed to meet its National Financial Inclusion Strategy target for 2020 to include 80 percent of its adult population into the financial system.\nEFInA data show that only 64.1 percent were financially included by the end of last year.\nThis means that 36 percent of Nigerian adults, or 38.1 million of the country’s 106…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "COVID-19: Edo records milestone in mgt of second wave, with zero active cases, no death in 11 weeks – Nigerian Observer",
    "summarized_story": "COVID-19: Edo records milestone in mgt of second wave, with zero active cases, no death in 11 weeksShare FacebookTwitterStumbleuponLinkedInPinterestEdo State has attained a milestone in the management of the second wave of coronavirus (COVID-19), recording no new deaths in the last 11 weeks, no new COVID-19 case in 12 days, with zero active case.\nThe state’s COVID-19 Incident Manager, Dr. Andrew Obi, who disclosed this to journalists in Benin City, said Edo is one of the first states to record zero active cases in the second wave of the pandemic.\nHe said Edo vaccinated over 38, 000 eligible persons across the state’s 18 local councils, including health workers, strategic leaders and other frontline staff in the first phase of the exercise.\n“We urge everyone to support the government’s efforts at containing the pandemic by complying with guidelines to curtail the spread of the virus.\nHe further charged residents with any COVID-19 symptoms to contact the Edo Emergency Operation Centre on this toll-free number: 08003625000 for assistance."
  },
  {
    "headline": "Acting Edo PDP chairman calls for calm – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin – Mr Harrison Omagbon, Edo acting Peoples Democratic Party (PDP) Chairman, has called for calm among party faithful, following the suspension of the state chairman, Dr Tony Aziegbemi.\nHe said that the suspension of Aziegbemi was to allow for proper investigation into the allegations against him.\n“That is why we have set up a committee to investigate and unearth the facts of these allegations,” he said.\nOmagbon added: “My dear party faithful, we are at a very auspicious time in our democracy.\n“It is on record that our governor is counted among those delivering the dividends of democracy to the people."
  },
  {
    "headline": "Obaseki: Court ‘ll decide fate of 14 run-away Assembly members-elect – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has asserted that the fate of the 14 members-elect of the state’s House of Assembly, whose seats were declared vacant, rests with the Court.\nThe seats of the 14 members-elect were in December 2019 declared vacant by the House led by former speaker, Rt.\nAccording to him, “Some characters said they sent congratulatory letters to me and put it in all kinds of conditions.\n“How can you tell me to forgive those 14 lawmakers-elect who are responsible for sedition and treason in Nigeria?\nOsanyande said that the e-revenue collection system would further increase the state government Internally Generated Revenue (IGR)."
  },
  {
    "headline": "Obaseki meets Edo youths, says Nigeria in dire need of strong institutions not strongmen – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has identified weak institutions as a bane of Nigeria’s underdevelopment, hinting on the need for leaders across the country to build strong institutions to achieve sustainable development.\nObaseki made the call while addressing youths in the state during a stakeholders’ engagement of the Edo State Transition Committee with youths and student groups at the New Festival Hall, Government House, Benin City.\nAccording to Obaseki, “Let us hold our political leaders to account; people will come and go, but institutions will remain.\nThe only way this will happen is when we realize that the government is about you and when you participate in governance.\nYou need to participate – not just sit down and participate on social media – in your community; speak up,” the governor charged."
  },
  {
    "headline": "How N56 million was budgeted to construct classrooms in non-existent Akwa Ibom school",
    "summarized_story": "In 2018, N30 million was budgeted for the construction of the phantom classroom block at Community Secondary School, Oku, Uyo.\nProject not found; school non-existentA visit by Premium Times to Oku Uyo in Akwa Ibom State, revealed that neither the school nor the block of classrooms exists.\nYou can check the school at Ikot Okubo,” Aniedi Essien, principal of Community Comprehensive Secondary School, Four Towns Uyo, told this reporter.\nIf it was released in full, the N56 million allocated to the phantom school would have gone a long way towards solving Akwa Ibom educational problems.\nBoth institutions have no direct relationship with Akwa Ibom State nor secondary education."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "FirstBank ranked 2nd most admired lender in Africa",
    "summarized_story": "Nigeria’s premier financial services provider, First Bank of Nigeria Limited, has been ranked second ‘most admired financial services brand’ in Africa – for the second straight year – at the 2021 Brand Africa 100: Africa’s Best Brands Event, held on Africa day, 25th May 2021.\nBrand Africa is an intergenerational movement to inspire a great Africa through promoting a positive image of Africa, celebrating its diversity and driving its competitiveness.\nAppreciating the recognition on behalf of the Bank, the Chief Executive Officer, Dr Adesola Adeduntan, said, “we are grateful to Brand Africa for the back-to-back recognition as the ‘Second Most Admired Financial Services Brand in Africa’.\nHe further noted that FirstBank has created a functional ecosystem for SMEs to thrive through various value adding solutions and value propositions.\nOnly recently, First Bank of Nigeria Limited was awarded the 2021 ‘’Retail Banking CEO of the Year Nigeria’’, ‘’Most innovative Retail Banking App Nigeria’’ and ‘’Best CSR Bank Nigeria’’ awards by Global Banking and Finance magazine."
  },
  {
    "headline": "US arrests another Nigeria, Onus for $.8m internet fraud",
    "summarized_story": "As alleged, Onus did this as effectively as someone who commits bank burglary, but with no need for a blowtorch or bolt-cutters.\nThe FBI’s goal is to prevent cyber criminals from causing harm and holding them accountable, but we can’t do it alone.\nThe compromised Company user accounts were associated with employers whose payroll was processed by the Company, including employers located in the Southern District of New York.\nMs. Strauss also thanked the New York City Police Department, the FBI New York Cyber Task Force, U.S. Customs and Border Protection, and the FBI Field Office in San Francisco for their assistance in the investigation of this case.\nAssistant United States Attorney Sagar K. Ravi is in charge of the prosecution, the Justice Department concluded."
  },
  {
    "headline": "How Dave Umahi became enemy of Ebonyi people, By Abia Onyike",
    "summarized_story": "Okpara(pioneer Premiers of Eastern Region, Dr. Akanu Ibiam(pioneer Governor of Eastern Region), Col.Chukwuemeka Odumegwu Ojukwu(Military Governor of Eastern Region), Chief Sam Mbakwe (Governor of Old Imo state), Chief Jim Nwobodo(Governor, old Anambra state), Chief C.C.Onoh(Governor, old Anambra state), Dr. Ogbonnaya Onu( Governor, old Abia state), Commander Walter Aye Feghabor(first Military Administrator, Ebonyi state),AIG of Police Simeon Oduoye(Military Governor, Ebonyi state), Dr.Sam Ominyi Egwu(first civilian Governor, Ebonyi state and Chief Martin Elechi(second civilian Governor of Ebonyi state).\nNo single state hospital is working in Ebonyi state.\nEven with the lack of teachers in Ebonyi state schools, the last thing to suggest to Umahi is employment of teachers.\nUmahi came into office in 2015, Ebonyi state University was rated as one the best state universities in Nigeria.\nAbia Onyike,Former Commissioner for Information, Ebonyi state."
  },
  {
    "headline": "Time has come to change Nigeria’s narrative – Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo has said it time to change the Nigerian narrative, and transform the country from one flowing with anger and bitterness, to one flowing with milk and honey.\nObasanjo said, “My prayer is that all of us will have something to contribute to making this country what God has created it to be – a land flowing with milk and honey.\n“Right now, it is a land flowing with bitterness and sadness, that is not what God wants this country to be.\n“We must change the narrative, we must talk to ourselves in the civilised language.\n“There is nowhere you go in this country that you will not see geniuses in any section of the country."
  },
  {
    "headline": "An Samu Nasasori Da Dama A Kwanaki 100 Na Shugabancin Saleh Ado A Minjibir",
    "summarized_story": ""
  },
  {
    "headline": "Gwamnan Zamfara Ya Nemi Taimakon Kasar Birtaniya Wajen Yaki Da ‘Yan Bindiga",
    "summarized_story": ""
  },
  {
    "headline": "Fati Nijar: Mawakiyar Da Ta Ke Haskawa A Nijeriya Da Nijar",
    "summarized_story": ""
  },
  {
    "headline": "Kanun Labarai: Daga Ranar Litinin 19 Zuwa 22 Ga Watan Shawwal 144211",
    "summarized_story": ""
  },
  {
    "headline": "Yadda Aka Gudanar Da Taron Nazarin Harsuna Karo Na Farko A ASCOE Azare",
    "summarized_story": "Ya ce “an kafa tsangayar nazarin Harsuna ta wannan makaranta (ASCOE Azare) a shekarar 1989, M. A.\nDa kuma irinsu Islamic/Hausa, Christian/Hausa, Christian/English da kuma Economics/English.\nA cikin jawabinsa ya yi maraba da manyan baki da suka halarci wajen, sannan ya godewa wadanda suka halarci taron.\nFarfesa Sadiya ta fara ne da bada uzurin rashin zuwan nasa sakamakon wani taro da ya halarta a Abuja.\nSintilin Katagum, a cikin jawabinsa ya yi kira da a rike Harsuna da Al’adu da kyau."
  },
  {
    "headline": "Mass retirement of senior officers over new army chief Yahaya not....",
    "summarized_story": "*Military says retirement is voluntaryAndrew Orolua, AbujaThe military high command has dispelled rumours about mass retirement of senior army officers with the appointment of a new Chief of Army Staff (COAS), Major-General Farouk Yahaya.\n“Retirement is only on voluntary basis for senior officers who desire to do so.\nTroops conducted a series of clearance patrols, ambush, raid, picketing, cordon and search operations as well as artillery bombardments.\nThey rescued kidnapped victims, neutralized scores of terrorists, destroyed terrorists’ enclaves, arrested terrorists and intercepted terrorists’ logistics items including vehicles.\nThis has drastically dislocated the terrorists’ logistics network in the region."
  },
  {
    "headline": "We know those killing us and why",
    "summarized_story": "The Catholic Bishop of Sokoto Diocese, Bishop Matthew Hassan Kukah has described the security situation in Nigeria as tragic, saying “There is no ambiguity about those who are killing our people and why they are doing so and where their inspiration comes from.”“We know who they are, who they believe in and where their inspiration comes from.\nWe know who they are, who they believe in and where their inspiration comes from.\n“There is no ambiguity about those who are killing our people and why they are doing so and where their inspiration comes from.\nForeign bandits or anyone can come at will kill, loot, rape, kidnap and murder you.\nHe therefore urged Nigerians to remain steadfast in prayer, saying that God will lead them out of this tragic situation."
  },
  {
    "headline": "My constituents fleeing into bushes from security crackdown, says Rep —",
    "summarized_story": "The lawmaker gave the names of some of his constituents allegedly killed by security agents as Noel Nzeribe and Tochi Ekwe while several other persons are currently missing.\nHe lamented that many people in his Constituency have been driven to the bushes while others fled to where they have spent days without their families.\nMy constituents called me to speak for the world to hold the security agents responsible if my people are killed.\nPlease, I beg the security agents; I beg the authorities to please allow my people to live in peace.\n“If you have arrested and killed some people (who killed Gulak) as a result of this crime, why are you still haunting my constituents?"
  },
  {
    "headline": "'How politicians instigated thugs to attack my palace' —",
    "summarized_story": "“The Military personnel that were around the place during the incident exercised lot of professionalism and restraints, which must be commended.\nKing Diete-Spiff took time to explain to Palace Watch what led to the ugly incident in Twon Brass on Sunday 16th up to Tuesday 18th of May, 2021.\nMost of the sub-contractors, who were supposed to show understanding during these very difficult period refused to see things with Agip Oil Company, in the process spreading false rumors and information.\nFor example, the Twon Brass Chapter of the Ijaw Youths Council (IYC) condemned the attack saying it would not condone any disrespect to their monarch either from indigenes or foreigners.\nThis shooting only took place when some persons hijacked the protest and destroyed part of the King’s Palace.”"
  },
  {
    "headline": "ALTON, IXPN endorse Nigeria DigitalSENSE Forum on IG4D 2021",
    "summarized_story": "By KEN EMORDIThe Association of Licensed Telecommunications Operators of Nigeria (ALTON) has endorsed this year’s Nigeria DigitalSENSE Africa Forum on Internet Governance for Development (IG4D), slated for Thursday, June 10, at the Golden Tulip Hotels Essential, International Airport Road, Lagos.\nThis is coming as the Internet Exchange Point of Nigeria (IXPN) has also given its support to the forum which is the 12th edition.\nDisclosing these, the organisers via the Lead Consulting Strategist and Group Executive Editor, ITREALMS Media inc, Mr. Remmy Nweke, said that ALTON has endorsed NDSF 2021 as the chairman, Engr.\nNweke noted that ALTON membership includes all the major telecommunications licensees in Nigeria, particularly those providing voice and data telephony as well as those providing ancillary and other related value added services.\nHe recalled that this year’s Nigeria DigitalSENSE Forum series on Internet Governance for Development would be presided over by the National President of the Nigeria Computer Society (NCS), Prof. Adesina Sodiya with a keynote by the President of Institute of Software Practitioners of Nigeria (ISPON), Mr. Chinenye Mba-Uzoukwu, among others."
  },
  {
    "headline": "ALTON, IXPN endorse Nigeria DigitalSENSE Forum on IG4D 2021",
    "summarized_story": "By KEN EMORDIThe Association of Licensed Telecommunications Operators of Nigeria (ALTON) has endorsed this year’s Nigeria DigitalSENSE Africa Forum on Internet Governance for Development (IG4D), slated for Thursday, June 10, at the Golden Tulip Hotels Essential, International Airport Road, Lagos.\nThis is coming as the Internet Exchange Point of Nigeria (IXPN) has also given its support to the forum which is the 12th edition.\nDisclosing these, the organisers via the Lead Consulting Strategist and Group Executive Editor, ITREALMS Media inc, Mr. Remmy Nweke, said that ALTON has endorsed NDSF 2021 as the chairman, Engr.\nNweke noted that ALTON membership includes all the major telecommunications licensees in Nigeria, particularly those providing voice and data telephony as well as those providing ancillary and other related value added services.\nHe recalled that this year’s Nigeria DigitalSENSE Forum series on Internet Governance for Development would be presided over by the National President of the Nigeria Computer Society (NCS), Prof. Adesina Sodiya with a keynote by the President of Institute of Software Practitioners of Nigeria (ISPON), Mr. Chinenye Mba-Uzoukwu, among others."
  },
  {
    "headline": "Keshi memorial lecture holds June 7 in Edo",
    "summarized_story": "The fourth Late Stephen Keshi Memorial Lecture will hold on June 7 at the Uyi Grand Event Centre in Benin City, Edo State, The PUNCH reports.\nFormer Nigeria coach Keshi died on June 7, 2016 aged 54 after a brief illness.\nAccording to the secretary of the Board of Trustee, Austin Popo, one of the major events at the lecture will be the launch of the annual Stephen Keshi National U-17 Football Tournament.\nThe memorial lecture, with the theme ‘Traditional Institutions and Grassroots Sports Development in Nigeria: the CFF approach’, is designed to x-ray the role of traditional institutions in community development and integration using sports, especially football, as a major tool.\n“This is the fifth year since the legendary Stephen Keshi passed on and this event is the fourth edition because we could not hold the previous one due to COVID-19 issues last year,” Popo told The PUNCH."
  },
  {
    "headline": "Keshi memorial lecture holds June 7 in Edo",
    "summarized_story": "The fourth Late Stephen Keshi Memorial Lecture will hold on June 7 at the Uyi Grand Event Centre in Benin City, Edo State, The PUNCH reports.\nFormer Nigeria coach Keshi died on June 7, 2016 aged 54 after a brief illness.\nAccording to the secretary of the Board of Trustee, Austin Popo, one of the major events at the lecture will be the launch of the annual Stephen Keshi National U-17 Football Tournament.\nThe memorial lecture, with the theme ‘Traditional Institutions and Grassroots Sports Development in Nigeria: the CFF approach’, is designed to x-ray the role of traditional institutions in community development and integration using sports, especially football, as a major tool.\n“This is the fifth year since the legendary Stephen Keshi passed on and this event is the fourth edition because we could not hold the previous one due to COVID-19 issues last year,” Popo told The PUNCH."
  },
  {
    "headline": "Femi Adesina: Buhari ready to whip everyone into line",
    "summarized_story": "Michael AdesinaFemi Adesina has described President Muhammadu Buhari as a man of iron and steel who is ready to knock sense into stubborn heads and whip everyone into line.\nHe added that Nigeria now needs the combination of General Buhari and President Buhari.\nPresident Muhammadu Buhari (PMB) was once General Muhammadu Buhari (GMB), the army commander who gave Chadian forces who made incursion into Nigerian territory a bloody nose.\nThat is the message of President Buhari, and it should be the message of every good Nigerian.\n*Adesina is Special Adviser to President Buhari on Media and Publicity"
  },
  {
    "headline": "Organisers of Tokyo Olympics blasted by JOC’s Yamaguchi",
    "summarized_story": "Kaori Yamaguchi, a Japanese Olympic Committee board member on Friday blasted organisers of the Tokyo Olympic for ignoring public concerns about holding the event amid a pandemic.\nYamaguchi bared his mind in an opinion piece carried by Japan’s Kyodo news agency.\nHe said the International Olympic Committee (IOC) appeared to think it could steamroll over the wishes of the Japanese public, who, surveys show, overwhelmingly want the games cancelled or postponed.\nJapan’s government also says the Games can go ahead safely despite a slow vaccine rollout and rising numbers of severe coronavirus cases straining the medical system.\nThe country has recorded nearly 750,000 cases and more than 13,000 deaths."
  },
  {
    "headline": "Bandits terrorise Abuja suburbs, 83 kidnapped",
    "summarized_story": "By AbankulaBandits and kidnappers have turned Abuja suburbs into their playgrounds, striking fears in residents and forcing many to relocate.\nLiving in dread of bandits are residents of Abaji, Bwari, Gwagwalada, Kuje and Kwali Area Councils in the FCT.\nThey have been repeatedly attacked by bandits who kidnapped sme of them for ransom, compelling many to flee.\nTungan- Maje, Dobi, Yelwan Zuba are some of the communities in Gwagwalada Area Council which the bandits had raided several times and abducted residents for ransom.\nKabbi, Gafere, Kiyi and Pegi are communities in Kuje Area Council which had been invaded by the kidnappers in the past months."
  },
  {
    "headline": "We Have Reduced Kidnapping, Banditry With NIN – Pantami",
    "summarized_story": "Dr. Isa Pantami, the Minister of Communication and Digital Economy, has claimed that the President’s regime’s policy of requiring Nigerians to obtain a National Identification Number (NIN) has significantly reduced occurrences of banditry and kidnapping.\nPantami made the claim, in Abuja, on Thursday, while rendering account of his stewardship since assuming office, in 2019.\nHe said, “When I was assigned to supervise the sector on 24, August 2019, unregistered, and partial registered sims were being used to perpetrate crime in the country.\nIt was the first time we didn’t know the total of unregistered sims in the country.\n“From end of September 2019, to 2020, you will discover that even kidnapping and banditry reduced to the barest minimum."
  },
  {
    "headline": "BREAKING: Hours After Deleting Tweet, Twitter Deletes Buhari’s ‘Genocidal Threat’ Video",
    "summarized_story": "On Thursday evening, Twitter, the social media giant, erased another another message from President Muhammadu Buhari’s account.\nPresident Muhammadu Buhari’s infamous post threatening “Genocidal” violence against the Igbos was deleted by Twitter on Wednesday, making headlines.\nThe Nigerian government was outraged by the development, and they spent no time in criticizing the site.\nLai Mohammed, Nigeria’s Minister of Information, described the move as “strange,” accusing Twitter of “double standards.” On Thursday, however, the website removed a video of President Buhari making divisive remarks regarding the 1967 civil war."
  },
  {
    "headline": "Reno Omokri Attacks Buhari Over Plans To Mobilize Corps Members For War",
    "summarized_story": "Reno Omokri, a former presidential aide, responded on Thursday to Brig-Gen Shuaibu Ibrahim, the Director-General of the National Youth Service Corps (NYSC), saying that corps members may be recruited for war if necessary.\nThe NYSC director made the announcement on a Channels TV show on Wednesday, noting that the corps members are part of Nigeria’s reserve defense system.\nReno, who reacted on Twitter, chastised President Muhammadu Buhari for failing to provide jobs for Nigerian youngsters.\nThe former presidential advisor questioned why the federal government is sending troops to fight in the battle, and suggested that the president send his son, Yusuf.\nFirst send your son, Yusuf!”"
  },
  {
    "headline": "‘Bandits Hiding In Kano Forests’ — Ganduje Raises Alarm Over Upcoming Kano Attack",
    "summarized_story": "The governor of Kano, Abdullahi Ganduje, has called on the military to intervene against the criminals who have turned part of the state’s woodlands into hideouts.\nOn Thursday, Ganduje made the announcement during a meeting with Farouk Yahaya, the Chief of Army Staff, at the Defence Headquarters in Abuja.\nHe claimed that bandits had begun converging in Falgore woodland, and he raised concern that they were plotting attacks across the state.\n“My visit here today is to condole with the Nigerian Army over the death of the former Chief of Army Staff, Lieutenant General Ibrahim Attahiru and ten other officers,” he said.\n“I am also here to seek the help of the Nigerian Army to sustain the peace in Kano State; bandits have converted some forests in the state to hideouts."
  },
  {
    "headline": "Use of technology has come to stay, INEC tells election riggers",
    "summarized_story": "AbujaThe Independent National Electoral Commission (INEC) Thursday declared the use of technology in the conduct of elections has come to stay around the world and therefore should be improved upon.\nYakubu said technology and processes were a major task in a technologically driven electoral process.\n“The use of technology in elections has come to stay, especially in this part of the world, and therefore needs to be improved upon,” he said.\nOn the way forward on the use of technology in the conduct of elections, the INEC boss said: “Deployment of technology has touched most of the election processes,” adding that INEC was working on the last part – deployment of Electoral Voting Machines (EVMs).\nOthers are declaration of winners, voter registration, voter authentication, balloting, vote collation and vote transmission.”On the voter registration towards 2023 election, he said voter enrolment software would be introduced to recapture as much fingerprints as possible, using better fingerprint capturing software and hardware."
  },
  {
    "headline": "#BlueprintAt10 – VIDEO: Watch as Gwape International Troupe entertains guest",
    "summarized_story": ""
  },
  {
    "headline": "Pictures: Former President, Goodluck Ebele Jonathan, receives African Icon of Democracy award at #BlueprintAt10 event",
    "summarized_story": ""
  },
  {
    "headline": "Digital Economy: IT, Key To The Future, Says Westgate Boss -NigPilot",
    "summarized_story": "Despite the economic downturn occasioned by the COVID-19 outbreak and against the backdrop of the emerging digital economy, the information technology sector remains the key to the future.\nThis was disclosed by the managing director of Westgate Technologies, Mrs Ijeoma Ezeudu, on Thursday during the opening of a Westgate retail store in Abuja.\n“We’ve have been in this Abuja for the past 10 years but as a company, Westgate has been in existence for the past 16 years, we have that vision to take IT to the highest level.\nSo, despite the pandemic, it is quite challenging but we have to keep pushing,” she said.\nOn the impact of the COVID-19 pandemic on the company, Ezeudu said: “We can’t really quantify but all we know is all the SMEs have been affected."
  },
  {
    "headline": "Nigeria now has capacity to produce SIM cards, smartphones for Africa – Pantami -NigPilot",
    "summarized_story": "Nigeria has developed capacity to produce SIM cards and smartphones not only for the use of Nigerians alone but for the entire continent of Africa, Minister of Communications and Digital Economy, Ali Isa Pantami, has disclosed.\nSpeaking at the event organized by a support group known as APC Professionals Forum, Pantami said Nigeria has capacity to produce a minimum of 200 million SIMS annually.\n“When this administration came on board, even SIM cards were imported to Nigeria but as it is today, the federal government has provided an enabling environment for the private sector and as it is today, we have the capacity to produce SIM cards not only for our consumption but for the entire African continent.\n“We have the capacity to produce a minimum of 200 million SIMS annually.\nToday in Nigeria, we are producing smartphones.”"
  },
  {
    "headline": "Improve on Attahiru’s legacy, CNS tasks COAS -NigPilot",
    "summarized_story": "Chief of the Naval Staff (CNS), Vice Admiral Awwal Gambo has charged the newly appointed Chief of Army Staff (COAS), Major General Farouk Yahaya to improve on the legacy of his predecessor, late Lt. Gen. Ibrahim Attahiru.\nVice Admiral Gambo gave this charge when the new Chief of Army Staff (COAS) , Major General Faruk Yahaya paid him a courtesy visit at the Naval Headquarters.\nYou should equally pick up from where the late COAS, Lieutenant General Ibrahim Attahiru left from and improve upon those ideas”.\nEarlier, the Chief of Army Staff, Major General Faruk Yahaya said he was in the Naval Headquarters to formally inform the CNS that he had reported and taken over duty following his appointment as the 22nd COAS.\nMajor General Yahaya promised to ensure cooperation with other security agencies and stakeholders as the challenges confronting the security agencies are multi-faceted and would require a multi-faceted approach."
  },
  {
    "headline": "Accurate data for Persons with Disabilities ready soon- Lalu",
    "summarized_story": "The Executive Secretary Ncpwd Mr. James Lalu has pledged his support to the National Population Commission to ensure that disability data is not taken for laxity.\nIn his welcoming address the Executive Secretary National Commission for Persons with Disabilities Mr. James Lalu thanked the Coalition for putting together such initiatives.\nHowever, at the Global Disability Summit, disability data was on the front burner and so he will ensure that accurate data of persons with Disabilities in the upcoming 2022 Census are taken seriously.\nDr. Irene also urged the disability community to take ownership of the project and drive it to success.\nThe Executive Director of DINABI, Olajide Funso who spoke on Disability Data/Statistics in Nigeria according to him, unreliable, non-disaggregated, estimation-based and completely under-represented the disability community."
  },
  {
    "headline": "Nigeria Is Flowing With Bitterness And Sadness – Obasanjo",
    "summarized_story": "﻿Former President of Nigeria, Chief Olusegun Obasanjo says Nigeria is dripping with bitterness and sadness in the face of the current socio-economic and political challenges facing the country.\nAccording to Obasanjo, the current challenges besetting the nation run contrary to the dreams and aspirations of the founding fathers and what God destined the country to be.\nHe made the assertion on Thursday at the Olusegun Obasanjo Presidential Library in Abeokuta, Ogun State’s capital, when he was presented with a book titled “The Man, The General, and The President,” written by Femmy Carrena.\n“Right now, it is a land flowing with bitterness and sadness, that is not what God wants this country to be.\n“There is nowhere you go in this country that you will not see geniuses in any section of the country."
  },
  {
    "headline": "Buhari Seeks Global Support To Develop Niger Basin",
    "summarized_story": "President Muhammadu Buhari called for global support to develop the resources in the Niger Basin area – home to over 160 million people who depend on the river as a means of sustenance.\nHe made the call on Thursday in Abuja when he declared open the virtual 12th Summit of Heads of State and Government of the Niger Basin Authority (NBA).\nThe President believes the Niger River, commonly called Djoliba in Guinea and Mali, offers enormous development opportunities in the fields of agriculture, animal husbandry, fishing, fish farming, hydropower, hydraulics and navigation.\nHe urged them to continue to support efforts at developing the Niger Basin in the fight against pollution and the degradation of ecosystems, in order to manage its resources in a sustainable and equitable manner.\n“At this summit, my tenure as the Chairman Summit of Heads of State and Government of our common institution comes to an end as I will hand over to a new chairman."
  },
  {
    "headline": "COAS Appointment: Military Denies Enforcing Mass Compulsory Retirement Of Officers",
    "summarized_story": "Military authorities have dispelled the rumour of mass compulsory retirement of senior military officers, following the appointment of the new Chief of Army Staff (COAS), Major General Farouk Yahaya.\nTroops conducted series of clearance patrols, ambush, raid, picketing, cordon and search operations as well as artillery bombardments.\nOn 20 May 2021, troops had contact and engaged BHT criminal elements in Gwoza LGA of Borno State.\nIn Rivers State, troops immobilised several illegal refining sites along with numerous reservoirs and polythene bags of illegally refined oil products at different sites.\nOperation AwatseBetween 20 May and 2 June 2021, troops of Operation AWATSE maintained constant vigilance and operational tempo as well as patrolled our waterways."
  },
  {
    "headline": "Gunmen Hijack Ondo School Bus, Release School Attendant",
    "summarized_story": "A school attendant has been released few hours after some gunmen hijacked a school bus and abducted the staff of the private school, on Thursday morning in Ondo State.\nThe gunmen at about 6.30 am on Thursday abducted her and hijacked the private school bus in Oba Ile Estate of Akure North Local Government Area of Ondo State.\nA staff of the school, Olufunke Oloye explaining to journalists how the incident happened said the victim was later released near Ilaramokin, a neighbouring town while the hoodlum took the school bus away.\nThe spokesperson of the command, DSP Tee-Leo Ikoro while addressing journalists also confirmed that the attendant has been released.\nHe noted that the police are on the trail of the hoodlums, hoping to apprehend them and recover the bus as soon as possible."
  },
  {
    "headline": "Biden, Queen Elizabeth To Meet In Person After G7 Summit",
    "summarized_story": "Queen Elizabeth II will hold her first in-person meeting with a foreign leader in over a year when she hosts US President Joe Biden on June 13 after he attends a G7 summit, Buckingham Palace announced Thursday.\nThe Queen, who has received her two doses of Covid-19 vaccination, has been holding the vast majority of meetings virtually, including audiences with foreign ambassadors.\nThe meeting with the president and first lady will come the day after the Queen’s official birthday, and will follow the three-day summit of Group of Seven leaders in Cornwall, southwest England.\nHe will also make stops at a NATO summit in Brussels and in Geneva, for a June 16 summit with Russian President Vladimir Putin.\nWith the exception of Lyndon B. Johnson, the Queen has met every US president during her 69-year reign."
  },
  {
    "headline": "Akpabio meets Tompolo, other leaders in Delta over NDDC board",
    "summarized_story": "The Minister of Niger Delta Affairs, Godswill Akpabio on Thursday arrived in Delta to meet with former Niger Delta warlord, Government Ekpemupolo alias Tompolo and other Niger Delta leaders in Delta State,His visit may be as a result of the threat issued by Tompolo regarding the immediate inaugurationHis visit may be as a result of the threat issued by Tompolo regarding the immediate inauguration of the NDDC board.\nTVC News reliably gathered that the minister and the Niger Delta leaders will meet in Oporoza, the country home of the ex-militant leader, in Warri Southwest LGA of the state.\n“Niger Delta Minister is on his way to Oporoza to meet with High Chief Government Ekpemupolo, aka Tompolo and other leaders across the Niger Delta.\n“Remember a few days ago, he gave an ultimatum.\nSo, regarding that, the Minister and his entourage are on their way to Oporoza to meet with other Niger Delta leaders on how to prevent the region from going into another round of crisis."
  },
  {
    "headline": "Niger Bans Commercial Motorcycles in Minna",
    "summarized_story": "The Niger state government has banned commercial motorcycles from operating in the state capital, Minna, after security intelligence revealed that bandits were planning to commit heinous crimes using motorcycles.\nAccording to a statement by the state government, non-commercial motorcycles are permitted to operate between the hours of 6 a.m. and 9 p.m., but commercial riders are prohibited.\n“Please be informed that the Niger State Government has banned completely the operation of commercial motorcycles within Minna, the state capital.” The state government said.\nThe state govt noted that the restrictions begins from 9pm to 6am.”“Noncommercial motorcycles however, are permitted to operate but only within the hours of 6am and 9pm.\n“Niger state Government regrets any inconvenience this necessary decision may cause the residents of the state.” The sated govt stated."
  },
  {
    "headline": "FBI arrest Nigerian for stealing $800,000 in payroll hack",
    "summarized_story": "Charles Onus, a Nigerian, has been arrested by the Federal Bureau of Investigation (FBI) for his alleged involvement in a $800,000 money laundering scheme.\nAccording to a statement issued by the US Department of Justice on Wednesday, Onus was involved in a scheme to steal payroll deposits by conducting cyber intrusions into multiple user accounts maintained by a company that provides human resources and payroll services to employers across the country.\nAccording to the allegations in the indictment, the suspect was involved in the scheme from July 2017 to 2018.\n“As alleged, Onus did this as effectively as someone who commits bank burglary, but with no need for a blowtorch or bolt-cutters.\nThanks to the FBI and IRS-CI, Onus is in custody and facing serious federal charges.”According to the statement, “at least approximately 5,500 company user accounts were compromised between July 2017 and 2018, and more than $800,000 in payroll funds were fraudulently diverted to prepaid debit cards, including those under the control of Onus.”"
  },
  {
    "headline": "Nigeria Says $1.5m for Clinical Trial Delaying First Local Covid Vaccine",
    "summarized_story": "Nigeria’s federal government Thursday explained that the production of the first local vaccine for Covid-19 is threatened by its inability to raise the $1.5 million cost of the clinical trial.\nA vaccine candidate means that you have already been able to get the antigen, you have produced something that will work.\n“Now, you have to do what is called the clinical trials; clinical trial means you go through testing it that it’s safe.\nSo, you go through those clinical trials, which are very detailed and they are expensive.\n“It’s hard to find a way to sponsor these clinical trials because they are expensive and they have a very good chance of being successful."
  },
  {
    "headline": "Nigeria: Electoral Commission Presses for Law to Transmit Results Electronically",
    "summarized_story": "Nigeria’s Independent National Electoral Commission (INEC) on Thursday called for legislation to transmit the results of 2023 elections electronically.\nThe commission also showcased new processes for voter’s registration and transmission of results from ward level to the final declaration.\nIt said beginning from June 28 when the voter’s registration will commence, facial capture would be added with the age determination factor to discourage underage voters.\nThe commission said it would use a new artificial intelligence to determine perceived underage voters.\nINEC, however, said all these innovations were subject to the passage of the new electoral law currently before the National Assembly."
  },
  {
    "headline": "Nigeria’s Defence Headquarters Allays Fears of Mass Retirement",
    "summarized_story": "Nigeria’s Defence Headquarters (DHQ) on Thursday allayed concerns about possible mass retirement of top military officers superior to the Chief of Army, Maj. Gen. Farouk Yahaya.\nBriefing the media in Abuja yesterday, Acting Director of the Directorate of Defence Media Operations (DDMO), Bri.\nHe said the operations were the combined efforts of the military and other security agencies involving land, maritime and air operations.\nHe said there were also extensive air operations, which included air patrols, intelligence surveillance and reconnaissance missions, offensive air strikes, air interdictions, search and rescue operations, and close air support for ground troops.\nHe added: “They rescued kidnapped victims, neutralised scores of terrorists, destroyed terrorists’ enclaves, arrested terrorists and intercepted terrorists’ logistics items, including vehicles."
  },
  {
    "headline": "Insecurity Does Not Make Nigeria Failed State: Federal Government",
    "summarized_story": "Nigeria’s federal government has said it is preposterous for anyone to declare Nigeria a failed state due to the country’s security challenges.\n“Nigeria’s worldwide companions, particularly the USA, should acknowledge that Nigeria is now a failed state.\n“Declaring any nation a failed state is not done at the whims and caprices of one or two persons, no matter their status.\n“Just because Nigeria is facing security challenges, which we have acknowledged and which we are tackling, does not automatically make the country a failed state.\n“Former United States Ambassador to Nigeria, John Campbell, has been predicting the collapse of Nigeria for several years."
  },
  {
    "headline": "Bad Leadership Has Turned Nigeria to Land of Bitterness and Sadness, Obasanjo Laments",
    "summarized_story": "Former Nigerian President Olusegun Obasanjo on Thursday expressed worry over the state of the nation and blamed bad leadership for the nation’s woes.\nAccording to him, the country is currently dripping with bitterness and sadness.\nObasanjo stated that although Nigeria is destined to lead the black race, failure of leadership has prevented the country from taking its rightful place in the comity of developed nations.\n“Right now, it is a land flowing with bitterness and sadness; that is not what God wants this country to be.\n“There is nowhere you go in this country that you will not see geniuses in any section of the country."
  }
]