[
  {
    "headline": "[BREAKING] N20bn: ‘DSS must pay’, Ilana Oodua celebrates Igboho’s triumph",
    "summarized_story": "The umbrella body of the Yoruba self-determination Group, Ilana Omo Oodua, has rejoiced over the Oyo State High Court verdict ordering the Department of State Service to pay N20 billion damages to a Yoruba Nation activist, Sunday Adeyemo, fondly called Sunday Igboho.\nThe court had awarded N20 billion against DSS for the “illegal” invasion of Igboo’s home in Ibadan on July 1.\nThe statement was titled, ‘N20 billion Fine Against DSS: Verdict Symbolises Triumph of Light, Truth Over Gladiators of Illegalities – Ilana Omo Oodua’.\nThe group asked the DSS to pay the N20 billion damages in the interest of peace.\n“Our position is that this verdict symbolises the triumph of light and truth over darkness."
  },
  {
    "headline": "Be careful how you spend your youth, Kanayo. O. Kanayo advises",
    "summarized_story": "O. Kanayo has warned youths between the ages of 25 – 45 to be careful about how they live in order not to have regrets during their old age.\nAccording to the thespian turned lawyer, he noted that God gifted some people with long life so that they can reap the evil deeds of their youths.\nWhen they are there, they do not believe that there is a life after office.\nThey play god and God deals with them.\nBe careful of what you do when you are between the ages of 25 and 45."
  },
  {
    "headline": "BREAKING: Gunmen invade Bauchi community again, abduct nursing mother",
    "summarized_story": "There was pandemonium in Birshin Fulani, a suburb of Bauchi metropolis when gunmen invaded the area and allegedly kidnapped a nursing mother, Rukayyat Odedoyin.\nAfter succeeding in breaking into the house, they were said to have gone away with the woman whose husband had just been transferred to Kaduna State.\n“About 12 midnight, we started hearing sporadic gunshots from different directions around our house.\n“We then heard people jumping the fence trying to gain entrance into the house of our neighbour.\nBarely 13 days ago, gunmen invaded the area and killed two people including a senior staff of the Federal Polytechnic, Bauchi."
  },
  {
    "headline": "Kabba Jailbreak politically motivated – Sources",
    "summarized_story": "This followed an earlier intelligence report which, according to sources, revealed plans to carry out coordinated attacks on Adavi, Ankpa, Idah, Koton-karfe, Yagba East, Yagba West and Mapamuro areas of Kogi state.\nThe jailbreak, as gathered, would not have been unconnected with the arrest of the bandits, some of whom were said to be awaiting trial.\nMeanwhile, additional six inmates who escaped during the jailbreak have been rearrested, bringing the total number of rearrested inmates so far, to 120 out of 240.\nHe disclosed that high profile criminals were released during the jailbreak, indicating that the action was thoroughly planned.\nBarring his mind on the jailbreak being politically motivated, Omodara, said, “ If you say it was politically motivated, I won’t shy away from that because we have high profile criminals there."
  },
  {
    "headline": "Tiwa Savage, Davido, Femi kuti, Burna Boy, Ebuka, others, to perform at Global Citizen live event in Lagos",
    "summarized_story": "The international advocacy organization, Global Citizen, has revealed the local host’s TV personalities Ebuka Obi-Uchendu and Nancy Isime for the Global Citizen Live event in Lagos, Nigeria.\nGlobal Citizen Live will call for:Wealthiest nations to deliver on their promise to give $100 billion annually to address the climate needs of developing countries.\nIn Lagos, Global Citizen is working with the Lagos State Government to create a limited-capacity event in celebration of Nigerians working on the frontline in the fight against the COVID-19 pandemic.\nLagos State Governor, Babajide Sanwo-Olu, said: “Lagos State is thrilled to be a part of Global Citizen Live.\nGlobal Citizen is the world’s largest movement of action takers and impact makers dedicated to ending extreme poverty by 2030."
  },
  {
    "headline": "Gunmen kidnap two poultry farmers, one other in Kogi, demand N15m ransom",
    "summarized_story": "Investigations on-going, PPRO reactsBy Boluwaji ObahopoThe abductors of Kabba poultry farmers have demanded for N5 million each to release their victims.\nThe kidnappers yesterday (Wednesday) evening, had struck Kabba and abducted three persons.\nThe abductees; Olorunpomi Damilola, a staff of College of Education Technical Kabba and Pastor Mayowa Otitolaye are said to be partners of a poultry farm in the state.\nThe third persons whose identity was not revealed was said to have been an assistant in the poultry farm.\nA family source of one of the victims confirmed that the kidnappers had established contact with the family and demanded for N5 million ransom."
  },
  {
    "headline": "Breaking: Court grants Igboho’s counsel N2million as cost",
    "summarized_story": "By Sola Isola, IbadanAn Oyo state High Court sitting in Ibadan, Friday granted Chief Yomi Aliu, the counsel to Chief Sunday Adeyemo also known as Igboho, N2million as cost for the thorough process in court.\nAliu had earlier asked the court to grant him N10million.\nDetails Shortly…"
  },
  {
    "headline": "ECOWAS resorts to sanctions over Guinea, Mali coups",
    "summarized_story": "The Economic Community of West African States (ECOWAS) on Thursday imposed sanctions against the junta in Guinea and those slowing Mali’s post-coup transition.\nThe move was agreed at an emergency summit of ECOWAS in Accra to respond to last week’s coup in Guinea and perceived slow progress towards constitutional rule in Mali following a coup last year.\n“In six months elections should be held,” said ECOWAS Commission President Jean-Claude Kassi Brou at a briefing.\nAnyone in Mali hindering preparations for the elections faces the same sanctions as those imposed in Guinea, it said.\nWest and Central Africa has seen four coups since last year – political upheaval that has intensified concerns about a backslide towards military rule in a resource-rich but poverty-stricken region."
  },
  {
    "headline": "Group urges unbiased assessment of Gov Yahaya Bello’s performance",
    "summarized_story": "The Convener, Got Your Back Nigeria, Prof Chris Mustapha Nwaokobia Jnr, has called on Nigerians to rise above sentiment and critically view what Governor Yahaya Bello is doing in Kogi State for better assessment of his performance.\nProf Chris, in a press statement, said that Bello is transforming the state with the people solidly behind him.\nThe statement explained, “Have you wondered why lately there is uncanny desperation to de-robe Kogi State of her deserving feat as the safest state in the North and the second safest state in the whole of Nigeria?\nIt is about the wickedness of selfish politicians and the ungodly quest for power, by all means, devious, foul, impish, and impious.\nProf. Chris explained that the truth is that Kogi State, under the watch of the 46-year-old technocrat in Lugard House, is the safest state in the North and the second safest state in Nigeria, and adjudged so by all available Security Index locally and internationally."
  },
  {
    "headline": "Doctors’ strike: Court issues directives to FG, NARD as negotiation fails",
    "summarized_story": "Justice Bashar Alkali delivered the ruling after the parties stated that negotiation, as advised by the court, had failed, NAN reports.\nAborishade further urged the court to invoke Section 20 of the NICN proceeding to order the claimants to go into negotiation with the defendant.\nHe equally averred that as stipulated by law, their preliminary objection should be taken before the claimants’ motion on notice.\nThe judge, however, refused the application and said that the order was made on Aug.23 and the defence filed its preliminary objection on Aug. 31.\nHe said therefore that the pending applications as stated by the court did not include preliminary objection that was not in existence then."
  },
  {
    "headline": "Plateau unrest: Community urges FG to build police barracks, training camp",
    "summarized_story": "The ADA also said a mobile police training camp should be opened at the hills East of Bauchi Ring Road, around Atagir Zangam, Jos North LGA, so as to prevent the area from becoming a kidnapper’s den or militia camp.\nThe ADA equally called on the government to construct an alternative safety route during emergency situations for students and staff of the University of Jos.\nThe ADA maintained that “There are certain routes that are considered safe in emergency situations.\nThus, the government should construct an alternative road for staff and students from the university’s permanent site linking Aisha Mana Orphanage home, Zaria Road.\n“Mobile police training camp should be opened at the hills of East of Bauchi Ring Road, Atagir Zangam, Jos North to prevent the area from becoming kidnapper’s den or militia’s training camp.”Yelwan massacre: Buhari government has abandoned Plateau – Senator Gyang"
  },
  {
    "headline": "Guinea coup: Osinbajo restates Nigeria’s position, makes demand to ECOWAS",
    "summarized_story": "Determined to ensure a prompt return of democratic rule to Guinea following the recent military coup, Nigeria has called on the Economic Community of West African States (ECOWAS) to maintain a short transition programme that will usher in a new civilian government in the country.\nSpeaking at the Accra summit, Osinbajo restated Nigeria’s position calling for the unconditional release of President Condé and calling for more pressure to be put on the country’s military leaders to return the nation to democratic rule.\nHis Media Aide, Laolu Akande, disclosed this in a statement on Friday.\nAccording to the statement issued at the end of the extraordinary summit, ECOWAS leaders have resolved to freeze the financial assets of members of the military junta, place a travel ban on them, while also demanding that the junta return Guinea to constitutional rule within six months.\nRecall that at the last summit of ECOWAS leaders which was held virtually on September 8, Nigeria, also represented by Osinbajo, condemned the coup d’etat in Guinea, calling for an unconditional release of President Alpha Conde and for stringent measures on Guinea’s military junta."
  },
  {
    "headline": "BREAKING: Court orders DSS to pay Sunday Igboho N20bn over home invasion",
    "summarized_story": "The Department of State Services (DSS) has been ordered to pay Sunday Adeyemo, popularly known as Sunday Igboho, N20billion.\nThe money is for damages done to his Soka home in Ibadan during the July 1 invasion.\nJustice Ladiran Akintola of Oyo State High Court gave the order on Friday.\nThe judge ruled in the suit filed by Igboho against the DSS in which he demanded N500billion.\nThe court declared the raid illegal and criticized the DSS for “arbitrary aggression and prejudices”."
  },
  {
    "headline": "Bauchi community protests as gunmen abduct nursing mother",
    "summarized_story": "By David Adenuga Bauchi- Advertisement -Barely two weeks after suspected gunmen killed two in the Birshin Fulani community, a suburb in Bauchi metropolis, a nursing mother, Rukayyat Odedoyin has been kidnapped in the area.\nThe Nation gathered that the gunmen who were about 10 stormed the residence of Odedoyin on motorbikes around 12:00am on Friday before she was whisked away while her three children were left behind.\nThe development led to a protest by members of the community over the state of insecurity in the area.\nRead Also: FG restates commitment to return refugees to NigeriaOur correspondent sighted a road blockage at the Bauchi-Dass road.\nThe spokesman of the command, Ahmed Wakil, a Superintendent of Police, did not pick calls put across to him as at the time of filing this report."
  },
  {
    "headline": "Suspected notorious robber shot dead in Warri",
    "summarized_story": "By Elo Edremoda, Warri- Advertisement -A suspected robber, Andrew Billions, has been shot dead by police operatives in Warri, Delta state.\nIt was gathered that the incident occurred at about 1pm on Thursday along Mission Road in Warri South council area.\nThe notorious gang of three was said to have robbed someone off an undisclosed amount of money after he trailed from a bank.\nOne locally-made pistol loaded with live cartridge, a Nokia phone, N130,000 and the said vehicle were recovered by the police.\nTwo locally made double barrel guns, three live cartridges and a “lady’s motorcycle” were recovered from the suspects, respectively."
  },
  {
    "headline": "Police shoot suspected dare-devil Imomotimi robbery gang member in Delta",
    "summarized_story": "- Advertisement -The Police Command in Delta on Friday said it had shot a member of a notorious armed robbery gang on in its wanted list.\nThe Acting Public Relations Officer of the command, DSP Bright Edafe, made the disclosure in a statement in Warri.\n“Information got to the DPO that a three-man armed robbery gang had robbed an unknown victim and was operating in a Black Toyota Corolla with registration number RBC 218 BL.\n“Before he died, he gave his name as Andrew and admitted to be a member of the dreaded ‘Imomotimi group’, a dare-devil gang that has been on the command’s wanted list,” he said.\nHe said that the command had intensified efforts to arrest the fleeing members of the gang."
  },
  {
    "headline": "Igboho: Court awards N20bn aggravated damages against FG, DSS, another N2m cost",
    "summarized_story": "From Oluseye Ojo, IbadanJustice Ladiran Akintola of an Oyo State High Court, sitting in Ibadan, the state capital, on Friday awarded N20billion aggravated damages against the Federal Government and Department of State Security (DSS) in a case of fundalmental human rights instituted by the Yoruba nation activist, Chief Sunday Adeyemo, also known as Sunday Igboho.\nThe court also granted all the 16 reliefs sought by Igboho, through his counsel, Chief Yomi Alliyu (SAN), and awarded additional cost of N2million against the respondents jointly and in favour of Igboho.\nThe three respondents are Attorney-General of the Federation and Minister of Justice, Abubakar Malami, as the first respondent, as well as SSS as second respondent and Director of SSS in Oyo State as third respondent.\nIgboho had demanded N500billion as reparation for damage to his exotic cars that include Mercedes Benz G-Class and 2019 Lexus Car during the invasion of his residence at Soka, Ibadan, Oyo State in the early hours of Thursday July 1, 2021 by the Department of State Security (DSS).\nCounsel to Igboho, Alliyu described the judgment as a victory for democracy in an interview with journalists after the court session, while counsel to Malami, Abdullahi Abubakar, refused to grant interview to journalists."
  },
  {
    "headline": "Gumi promoting banditry in the North, CAN alleges",
    "summarized_story": "From Fred Ezeh, AbujaChristian Association of Nigeria (CAN) has accused Islamic cleric, Sheikh Ahmed Gumi, of emboldening bandits and their activities in northern Nigeria.\nHe, thus, advised government to caution Sheik Gumi whose utterances, he claimed, have emboldened the bandits, thereby, promoting their inhumane acts in northern region.\nHe insisted that except drastic measures are put in place to curtail Almajiri phenomenon, banditry would remain in the north for a long time with devastating effects on socio-economic life.\n“Also, you can’t, in a sane nation, have the likes of Sheikh Gumi, a religious scholar, going about promoting banditry and you don’t think that this will continue.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Don’t demonstrate, attack public place, security personnel using my name –Igboho",
    "summarized_story": "He also admonished against attacking public places and security personnel in the pretence of agitating for self-determination for Yoruba nation.\nHis wife had been freed by the court, while he has been facing trial in the neighbouring country.\nHe will also like people to respect his family by not calling his mom out for anything public.\nIn that wise, people are advised to take anything said by anybody, claiming to be from him with a pinch of salt.\n“On no account should anybody attack any public place or security personnel on the pretence of agitating for Yoruba Nation.”Get paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "PDP mocks Presidency over economic council chair’s comments on debts",
    "summarized_story": "From Ndubuisi Orji, AbujaThe Peoples Democratic Party (PDP) has said comments credited to Chairman, Economic Advisory Council (EAC), Doyin Salami, on the country’s rising debt profile is a validation of its position on the government.\nThe party in a statement by Secretary, Kola Ologbondiyan, said Salami comments was a validation of its stance that government has mortgaged the country to foreign interests.\nIt noted that it was disheartening that the All Progressives Congress (APC)-led Federal Government cannot point to any legacy project it has financed with the loans.\nSalami’s revelation only validates apprehensions that President Buhari, who is still borrowing more money, is completely disconnected from his economic team, while the corrupt cabal in his Presidency has taken advantage of the situation to pillage the vaults.\n“More frightening is the revelation by EAC that the nation’s debt stock might soon hit N45 trillion."
  },
  {
    "headline": "UN march has nothing to do with IPOB, self-determination group",
    "summarized_story": "From Oluseye Ojo, IbadanNigerian Indigenous Nationalities Alliance for Self-Determination (NINAS), yesterday, flayed the Presidency for linking its ongoing one million march opposite the United Nations (UN) Headquarters, New York, with activities of the Indigenous People of Biafra (IPOB).\nIt, however, said the one million march in New York had nothing whatsoever to do with IPOB.\nThe renowned historian said rather than losing sleep and temper over the march, “the Nigerian government should, without further delay, declare Miyyetii Allah a terrorist organisation as being demanded by NINAS, saying, “the real terrorists in Nigeria are operating under Miyyetii Allah.\n“We demand an end to the genocide, being perpetrated by Miyyetii Allah against our people.\nMiyyetii Allah is a terrorist group and it should be declared such by the United Nations."
  },
  {
    "headline": "Southern Govs Meet, Insist on States’ Collection of VAT",
    "summarized_story": "They agreed, among other things, to commence the collection of Value Added Tax (VAT) in their various states.\nAkeredolu noted that the collection of VAT by various state governments would boost economic growth and promote development.\nPam, in the judgement, restrained the Attorney General of the Federation and FIRS (1st and 2nd defendants) from collecting VAT in Rivers State and directed the Rivers State government to take charge of the duty.\nAs a result of the court’s decision, the Lagos State government commenced moves to stop the collection of VAT by the FIRS in the state.\nReacting, Rivers and Lagos states urged the appellate court to rather appoint a Receiver or Manager for the purpose of collecting and keeping VAT collected in the interim."
  },
  {
    "headline": "W’Bank Doing Business Report Enmeshed in Ethical Irregularities, Discontinued",
    "summarized_story": "The investigation had examined the improper changes to the data for China in the Doing Business 2018 report; Saudi Arabia, United Arab Emirates, and Azerbaijan in the Doing Business 2020 index respectively.\nPreliminary investigation by the World Bank had already established that irregularities occurred in both editions of the Doing Business reports.\nThe findings however, hailed the bank’s commitment to investigating the circumstances and motivations that led to the data irregularities in Doing Business 2018 and Doing Business 2020.\nIt urged the bank to develop and implement procedures for the routine audit of Doing Business data and rankings by an independent party (i.e., external to the Doing Business team).\n“The publication of the Doing Business report will be paused as we conduct our assessment.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari: I’ll Use Football to Develop the Girl-child, Nation’s Unity",
    "summarized_story": "On women’s football, President Buhari expressed delight that Nigeria has produced excellent role models to inspire the next generation of stars to take up the sport.\nHis words: “Our National women’s football team, the Super Falcons are a force to reckon with, both on the continent and internationally.\n“I have also approved the unveiling of a committee to draw up a 10-year football development master plan for the country.\nOur youth are always positively engaged, when our national football teams are on assignment.\nInfantino, while speaking, renewed FIFA’s commitment to support the development of football in Nigeria, pledging to strengthen its partnership with the Nigeria Football Federation."
  },
  {
    "headline": "Anambra Poll: Incessant Sit-at-home Putting Pressure on Our work, Says INEC",
    "summarized_story": "By David-Chyddy ElekeThe Independent National Electoral Commission (INEC) has said that the frequency of sit-at-home exercises in the South East is putting pressure on its work in the forthcoming governorship election in Anambra State.\nThe Resident Electoral Commissioner, Dr. Nkwachukwu Orji, stated this in a press interview, during a workshop by the EMSC Amber Zone Implementers, which was organised by the European Centre for Electoral Support (ECES).\nOrji said the commission has launched a dashboard that has all activities of the commission for the Anambra governorship election, which is billed to hold on November 6.\n“Already, we have factored in the incessant sit-at-home exercises into our schedule.\nThe exercise has been eating up into our time, and putting pressure on our work, but we have been adjusting to ensure we meet up with our schedule."
  },
  {
    "headline": "Anambra Poll: Incessant Sit-at-home Putting Pressure on Our work, Says INEC",
    "summarized_story": "By David-Chyddy ElekeThe Independent National Electoral Commission (INEC) has said that the frequency of sit-at-home exercises in the South East is putting pressure on its work in the forthcoming governorship election in Anambra State.\nThe Resident Electoral Commissioner, Dr. Nkwachukwu Orji, stated this in a press interview, during a workshop by the EMSC Amber Zone Implementers, which was organised by the European Centre for Electoral Support (ECES).\nOrji said the commission has launched a dashboard that has all activities of the commission for the Anambra governorship election, which is billed to hold on November 6.\n“Already, we have factored in the incessant sit-at-home exercises into our schedule.\nThe exercise has been eating up into our time, and putting pressure on our work, but we have been adjusting to ensure we meet up with our schedule."
  },
  {
    "headline": "BREAKING: Court Orders Buhari Government To Pay Sunday Igboho N20billion",
    "summarized_story": "An Oyo State High Court on Friday granted a relief sought by Yoruba Nation activist, Sunday Adeyemo, aka Sunday Igboho and ordered the Nigerian government to pay him N20 billion.\nThe court also dismissed an application filed by the Attorney General of the Federation, Abubakar Malami, challenging its jurisdiction to hear allegations against Nigerian government agencies.\nIgboho is, among others, seeking an order of the court to declare the invasion of his residence by DSS operatives as illegal and an infringement on his fundamental human rights.\nThe three respondents are Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN), as the first respondent, SSS as the second respondent and Director of SSS in Oyo State as the third respondent.\nCounsel for the AGF, Abubakar Abdullahi had filed an application challeging the ability of a state High Court to hear the activities of Nigerian government agencies."
  },
  {
    "headline": "BREAKING: Court Orders Buhari Government To Pay Sunday Igboho N20billion",
    "summarized_story": "An Oyo State High Court on Friday granted a relief sought by Yoruba Nation activist, Sunday Adeyemo, aka Sunday Igboho and ordered the Nigerian government to pay him N20 billion.\nThe court also dismissed an application filed by the Attorney General of the Federation, Abubakar Malami, challenging its jurisdiction to hear allegations against Nigerian government agencies.\nIgboho is, among others, seeking an order of the court to declare the invasion of his residence by DSS operatives as illegal and an infringement on his fundamental human rights.\nThe three respondents are Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN), as the first respondent, SSS as the second respondent and Director of SSS in Oyo State as the third respondent.\nCounsel for the AGF, Abubakar Abdullahi had filed an application challeging the ability of a state High Court to hear the activities of Nigerian government agencies."
  },
  {
    "headline": "REVEALED: Nigerian Politicians With Corruption Cases Who Joined Ruling Party, APC To Escape Prosecution",
    "summarized_story": "During the 2019 elections, Adams Oshiomhole, a former National Chairman of the APC had announced that those who joined the ruling party would have their \"sins\" forgiven.\nHe encouraged more politicians in opposition parties to toe the path of some members of the Peoples Democratic Party (PDP) who had defected to the APC at that time.\nWe have quite a number of other leaders who have come… in fact, once you have joined APC, all your sins are forgiven,” he had said.\nStella OduahOn August 27, 2021, a former Minister of Aviation, Stella Oduah, who recently joined the APC, claimed she joined the party to change the political narrative in the South-East.\nAdebayo Alao-AkalaIn 2019, a former Governor of Oyo State, Adebayo Alao-Akala reportedly defected to the APC from the Action Democratic Party (ADP)."
  },
  {
    "headline": "REVEALED: Nigerian Politicians With Corruption Cases Who Joined Ruling Party, APC To Escape Prosecution",
    "summarized_story": "During the 2019 elections, Adams Oshiomhole, a former National Chairman of the APC had announced that those who joined the ruling party would have their \"sins\" forgiven.\nHe encouraged more politicians in opposition parties to toe the path of some members of the Peoples Democratic Party (PDP) who had defected to the APC at that time.\nWe have quite a number of other leaders who have come… in fact, once you have joined APC, all your sins are forgiven,” he had said.\nStella OduahOn August 27, 2021, a former Minister of Aviation, Stella Oduah, who recently joined the APC, claimed she joined the party to change the political narrative in the South-East.\nAdebayo Alao-AkalaIn 2019, a former Governor of Oyo State, Adebayo Alao-Akala reportedly defected to the APC from the Action Democratic Party (ADP)."
  },
  {
    "headline": "What I Will Do If Ex-President Jonathan Joins All Progressives Congress, Contests For President—Governor Wike",
    "summarized_story": "Rivers State Governor, Nyesom Wike has said he will not support former President Goodluck Jonathan if he defects to the ruling All Progressives Congress (APC) to contest in the 2023 presidential election.\nNyesom WikeThis came after a former aviation minister and chieftain of the Peoples Democratic Party (PDP), Femi Fani-Kayode defected to the APC on Thursday.\n“About a year ago Jonathan started consulting with APC to see how he could join the party.\nJonathan assisted APC candidate in his state to win election but a court squashed his victory before he could be sworn in.\"\nThe source continued, “Buhari cabal knew Jonathan could only do one term, in fact only 2 years constitutionally."
  },
  {
    "headline": "Court orders DSS to pay Igboho N20bn for unlawful invasion",
    "summarized_story": "An Oyo state high court has directed the Department of State Services (DSS) to pay N20 billion to Sunday Adeyemo better known as Sunday Igboho for unlawfully invading his Ibadan residence on July 1.\nIgboho had sued the AGF, the DSS, and the director of the DSS in Oyo state, demanding N5.5 billion in damages over the raid on his Ibadan home.\nAdvertisementIgboho also sought an order of the court directing the respondents to return all the items seized from his house.\nThe court also described the action of the DSS as “arbitrary aggression and prejudices” against Igboho.\nAdvertisementThe court awarded an additional cost of N2 million against the respondents jointly and in favour of Igboho."
  },
  {
    "headline": "Court orders DSS to pay Igboho N20bn for unlawful invasion",
    "summarized_story": "An Oyo state high court has directed the Department of State Services (DSS) to pay N20 billion to Sunday Adeyemo better known as Sunday Igboho for unlawfully invading his Ibadan residence on July 1.\nIgboho had sued the AGF, the DSS, and the director of the DSS in Oyo state, demanding N5.5 billion in damages over the raid on his Ibadan home.\nAdvertisementIgboho also sought an order of the court directing the respondents to return all the items seized from his house.\nThe court also described the action of the DSS as “arbitrary aggression and prejudices” against Igboho.\nAdvertisementThe court awarded an additional cost of N2 million against the respondents jointly and in favour of Igboho."
  },
  {
    "headline": "Petrol scarcity looms in Enugu, Anambra, Ebonyi as IPMAN withdraws services",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) has asked its members to withdraw their services in some states in the southeast region.\nAdvertisementSanusi Fari, the national president of IPMAN, alleged that some police officers invaded and attacked the association’s Enugu secretariat on Thursday.\nHe further directed members of the association to shut down their operations in Enugu and stop their services in Enugu, Anambra and Ebonyi states until the situation is addressed.\n“This will stop our services to members of the public in Enugu, Anambra, and Ebonyi from Sept. 17 until the police illegality is reversed.”Reacting, Daniel Ndukwe, spokesperson of the Enugu police command, denied that operatives of the command blockaded or attacked the IPMAN secretariat in Enugu.\nIn June, IPMAN had threatened to shut down fuel stations across the country over alleged police harassment."
  },
  {
    "headline": "Petrol scarcity looms in Enugu, Anambra, Ebonyi as IPMAN withdraws services",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) has asked its members to withdraw their services in some states in the southeast region.\nAdvertisementSanusi Fari, the national president of IPMAN, alleged that some police officers invaded and attacked the association’s Enugu secretariat on Thursday.\nHe further directed members of the association to shut down their operations in Enugu and stop their services in Enugu, Anambra and Ebonyi states until the situation is addressed.\n“This will stop our services to members of the public in Enugu, Anambra, and Ebonyi from Sept. 17 until the police illegality is reversed.”Reacting, Daniel Ndukwe, spokesperson of the Enugu police command, denied that operatives of the command blockaded or attacked the IPMAN secretariat in Enugu.\nIn June, IPMAN had threatened to shut down fuel stations across the country over alleged police harassment."
  },
  {
    "headline": "Ease of doing business: IMF chief denies altering World Bank report to appease China",
    "summarized_story": "AdvertisementGeorgieva served as chief executive officer of World Bank between January 2017 and September 2019 before moving to IMF.\nAdvertisementIn its findings, World Bank cited Georgieva as having put staff under pressure to alter data related to China to boost its score.\nThe 2018 Doing Business report was released in October 2017.\nAdvertisementThe 2018 report ranked Nigerian on the 146th spot, a spot from its 145-rank in 2017.\nThe Doing Business report measures the regulations that enhance business activity and those that constrain it."
  },
  {
    "headline": "iPhone 13 series price in Nigeria, Kenya, and South Africa",
    "summarized_story": "During a virtual event on Tuesday, Apple announced that the iPhone 13 will come in four new models: the iPhone 13, 13 Mini, 13 Pro and 13 Pro Max.\nThe iPhone 13 starts at $829 for 128GB, which is twice the storage the iPhone 12 started with; while the iPhone 13 Mini starts at $729 for 128GB of storage.\nThe iPhone 13 Pro and 13 Pro Max start at $999 and $1,099 respectively, for 128GB storage.\nIPHONE 13 SERIES US PRICES AND STORAGEPhone 128GB storage 256GB storage 512GB storage 1TB storage iPhone 13 Mini $729 $829 $1,029 NA iPhone 13 $829 $929 $1,129 NA iPhone 13 Pro $999 $1,099 $1,299 $1,499 iPhone 13 Pro Max $1,099 $1,199 $1,399 $1,599Why the iPhone 13 series are more expensive in African countriesOver the years, there’s been a noticeable price difference for Apple products in African countries.\nAlthough the store hasn’t revealed the prices, the iPhone 13 Pro 128GB is expected to go for around R23,499 ($1,640), while the iPhone 13 Pro Max 128GB could retail for around R25,999 ($1,815)."
  },
  {
    "headline": "How BFree is improving trust in the lending space",
    "summarized_story": "This incident is one out of many which indicate that digital lenders will go the extra mile, sometimes using unethical methods, to get their loans back.\nThe sanction served as a clarion call for digital lenders to use ethical alternative methods to collect loans.\nBut it didn’t take long to see that there were some cracks in the collection process.\nAt BFree customers are appraised based on two factors: willingness and capability to pay.\nFlosbach believes that BFree’s ultimate goal is to increase trust in the African lending space."
  },
  {
    "headline": "Goldman Sachs-backed Jumo launches its first loan product in Ivory Coast",
    "summarized_story": "South Africa-based Jumo has partnered with MANSA Bank and MTN Mobile Financial Services to provide loans to entrepreneurs and small businesses in Ivory Coast.\nIn Ivory Coast, which is Jumo’s most recent market, the collaboration will see the company introduce its new short-term and small-scale loan product, VitKash, built in partnership with MANSA and offered through MTN’s mobile money platform.\nThe recent expansion was driven by a number of factors, which according to Kone make the West African nation an “attractive market” for Jumo.\n“Ivory Coast has all the characteristics of an attractive market with high growth potential.\n“In the WAMU (West African Monetary Union) zone, there is a strong will from the BCEAO (the central bank of 8 Francophone West African States) to improve financial inclusion and financial literacy,” Kone said."
  },
  {
    "headline": "These ten African countries have the cheapest data plans",
    "summarized_story": "This article was contributed to TechCabal by Conrad Onyango /birdIn Africa, internet data is expensive currencySudan leads nine other African countries that charge its citizens less than $1 for a gigabyte (1 GB) of mobile data, a report by British technology research firm Cable shows.\nThe Northeastern Africa nation offers the lowest cost of internet access over a smartphone anywhere in Africa and ranks among the top five cheapest countries for mobile data, in the world, according to the Worldwide Mobile Data Pricing 2021.\nThe cost of mobile internet in Sudan is $0.27 for every gigabyte of data.\nAlgeria is second-cheapest at $0.51, while Somalia takes the third-cheapest slot on the continent, at $0.60 per 1GB of mobile data.\nThe report, which featured more than 230 countries across 12 regions and compared the cost of 1GB from over 6,000 mobile data plans, also pointed out that North Africa (at an average of $1.53) has the cheapest data plans in the world."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Five ways to halt exit of foreign retailers from Nigeria",
    "summarized_story": "Five ways to halt exit of foreign retailers from NigeriaTop South African retailers such as Mr Price and Shoprite have exited Nigeria, and now Massmart plans to leave its Games Stores.\nExperts say foreign retailers need to re-examine their approach to the Nigerian retail landscape in order to succeed.\nThis is why experts say retailers, especially foreign ones, should understand how to penetrate Nigeria’s retail landscape.\nAnother challenge faced by foreign retailers is dealing with inadequate foreign exchange.\nFuller advises foreign retailers to cut down on their range and carry only the basic necessities while focusing on cost reduction."
  },
  {
    "headline": "Why mortgage banks still struggle despite N29bn intervention",
    "summarized_story": "Notwithstanding their recapitalisation and consolidation plus the intervention of the Nigerian Mortgage Refinance Company (NMRC), Nigeria’s primary mortgage banks (PMBs) are still struggling with liquidity issues.\nAs a private sector-led mortgage refinancing company, NMRC has the public purpose of promoting homeownership for Nigerians while deepening liquidity in the mortgage market by raising long-term funds from the capital market.\nRead also: Nigerian banks grow profit by most in 7yrs despite limited cashNMRC had raised a total of N19 billion from the capital market to refinance mortgage loans provided by partnering mortgage and commercial banks.\nTypical mortgage interest rates in Nigeria range between 6-10 percent for the National Housing Fund (NHF) and between 15-25 percent for commercial mortgage institutions.\nThe trick here is that at 15 percent interest rate, it takes a lender approximately seven years to recover the N25 million he lends out."
  },
  {
    "headline": "Nigeria meets investors over $3bn Eurobond issuance",
    "summarized_story": "Nigerian authorities began virtual meetings with potential investors for the proposed $3bn Eurobond issuance today, according to the Debt Management Office (DMO).\nThrough the issuance, Nigeria, currently rated B2 (Negative) by Moody’s, B- (Stable) by S&P and, B (Stable) by Fitch, hopes to raise up to USD$3 billion but not more than USD$6.2 billion.\nIn order to avail local investors the opportunity to invest in the Eurobonds, meetings will also be held with local investors.\nSince the ICM debut in 2011, Nigerian investors have always participated in the biding process, including banks, insurance companies and PFAs.\nOverall, Eurobond issuances by Nigeria and the investor meetings that precede the pricing, have provided a strong global platform for Nigeria to tell its own story and opportunities available in Nigeria for investors."
  },
  {
    "headline": "Delta Man In Police Net Over Attempt To Kill Mother For Ritual – Nigerian Observer",
    "summarized_story": "Delta Man In Police Net Over Attempt To Kill Mother For RitualShare FacebookTwitterStumbleuponLinkedInPinterestWarri – Delta state Police Command has arrested s young man identified as Emma Ere-Eganoma over an attempt to murder his mother, Oke in Okuokoko community, Okpe council area of Delta state.\nNIGERIAN OBSERVER learnt that the incident occurred on Tuesday, after the suspect reportedly invited his mother, a foodstuffs seller in Okuokoko Market, to his apartment within the neighbourhood.\nHowever, the young man immediately locked the entrance, brought out a machete and used it on his mother.\nConfirming the incident, Delta State Police Command noted that until the mother recounts what actually transpired, the Police cannot say if the son meant to kill her for ritual purpose.\nActing Police Public Relations Officer, DSP Bright Edafe, said,“The boy is in custody, but we cannot ascertain if he was about using the mother for ritual because the mother is in the hospital."
  },
  {
    "headline": "Edo reads riot act to operators of unapproved private schools, lecture centres …sets up taskforce, to prosecute promoters – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has warned against operating private schools and lecture centres without approval from the State Ministry of Education, noting that operators of such centres risk prosecution.\nIn a statement, Secretary to the State Government, Osarodion Ogie Esq., decried the activities of some private individuals and organizations, who operate educational centres with substandard instructional facilities and personnel in shanties across the state.\nHe said, “This, we have learned, is being perpetrated in the guise that they are running these facilities in partnership with the Government when in fact they are reaping off unsuspecting members of the public through these unapproved private schools and lecture centres.\n“The Edo State Government is committed to providing quality education for all and will not condone the perpetration of this aberration and the activities of those who are working to truncate the lofty efforts of the government to deliver quality education to children in Edo State.”According to him, “All existing illegal private schools and lecture centres, as well as all private individuals/organisations running these centres are advised to visit the Planning, Research and Statistics of the Ministry of Education for guidelines on schools’ registration/approval.”“Government has constituted a taskforce to clamp down on illegal private school/lecture centres to seal the premises and prosecute those promoting them.”Ogie urged parents/guardians to register their children and wards at only approved private schools and lecture centres or, in the alternative, at the nearest public school."
  },
  {
    "headline": "Obaseki congratulates Omosefe on victory at national scrabble championship – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has felicitated with Prince Omosefe, who emerged winner of the eighth edition of the Nigerian Scrabble Players Championship held at the Federal Capital Territory, Abuja.\nThe Edo player, Omosefe recorded 11 wins with a plus 954 cumulative spread to win the national competition, defeating about 30 other players.\nThe governor, in a statement, described the scrabble star as an enviable ambassador of the state, hailing his prowess in the word game.\nAccording to the governor, “I warmly congratulate Prince Omosefe on his victory at the eighth edition of the Nigerian Scrabble Players Championship held at the Federal Capital Territory, Abuja.\nI am indeed proud of his exploits and even more confident that he would bring more glory to our state and country.”..."
  },
  {
    "headline": "COVID-19 3rd wave: Edo confirms death of three more unvaccinated persons, as infection soars, mortality climbs to 57 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State has confirmed the death of three more persons who were not inoculated with the coronavirus (COVID-19) vaccines, amid ramped up efforts by the government to vaccinate more citizens to protect them and achieve herd immunity against the deadly virus.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State Governor, Mr. Godwin Obaseki.\nObi said the three new deaths reported from the Stella Obasanjo and Irrua Specialist hospitals, raised the total number of deaths recorded in the third wave of the pandemic in the state to 57.\nAccording to him, “Edo State, in the last 24 hours, recorded three more deaths of persons who have not been inoculated with the COVID-19 vaccines, bringing the total mortalities recorded in the third wave of the pandemic in the state to 57.\nHe further disclosed that the state has so far in the third wave of the pandemic collected 13,945 samples and recorded 1,115 confirmed cases and 523 recoveries, with over 71,420 persons inoculated since the commencement of the second phase vaccination exercise in the state."
  },
  {
    "headline": "Ebonyi #EndSARS panel recommends N189 million compensation for victims",
    "summarized_story": "ADVERTISEMENTThe Chairman of the Judicial Panel of Inquiry on police brutality, extra-judicial killings and Human Rights Violations in Ebonyi State, Alloy Nwankwo, on Thursday, said the panel had recommended the payment of N189 million to victims of extra-judicial killings in the state.\nHe said the panel in Ebonyi State received a total of 71 petitions, since it was set up on October 20, 2020.\n“We recommended sanctions and other forms of punishment for security agencies involved in extrajudicial killings, brutality,” he said.\nA pastor in Ebonyi, Ugbala Solomon, during the panel sitting, said the operatives of SARS, the disbanded notorious police unit, of killing two of his church members.\nThe panel, just like the ones in other states across Nigeria, was set up after the 2020 historic #EndSARS nationwide protest."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Union Bank appoints Aisha Abubakar as Independent Non-Executive Director",
    "summarized_story": "Adebayo ObajemuUnion Bank of Nigeria Plc has announced a change to the membership of its Board of Directors with the appointment of Ms. Aisha Abubakar as an Independent Non-Executive Director effective 9th September 2021, following the approval of the Central Bank of Nigeria (CBN)Ms. Abubakar joins the Board of Union Bank following her tenure as Nigeria’s Honourable Minister for Women Affairs and Social Development from 2018 to 2019.\nAt the start of her career, Ms. Abubakar worked at Continental Merchant Bank Ltd., African Development Bank and African International Bank.\nMs. Abubakar is a Fellow of the International Professional Managers Association (IPMA-UK), and the President of the International Experts Consultants (IEC-UK).\nCommenting on the addition to the Board, Mrs. Beatrice Hamza Bassey, Union Bank’s Board Chair said:“On behalf of the Board of Directors, I welcome Ms. Aisha Abubakar to the Board.\nShe brings many years of robust experience which will be invaluable in supporting our efforts to steer the Bank forward and deliver on our strategic objectives.”Also commenting, Chief Executive Officer, Mr. Emeka Okonkwo said:“I am pleased to welcome our new Independent Non-Executive Director, Ms. Aisha Abubakar to the Board."
  },
  {
    "headline": "Japaul Gold declares N257.54m loss in Q2 2021",
    "summarized_story": "Adebayo ObajemuJapaul Gold on Thursday published its Second Quarter report for the period ended 30 June 2021.\nThe Company declared for turnover of N313.62 million for the six months period, down by 4.09% from N327 million reported the previous year.\nJapaul declared a loss of N257.54 million for the six months period as against the profit of N38.293 million reported in Q2 2020.\nEarnings per share depreciated to -4 kobo from the EPS of 1 kobo achieved the previous year.\nAt the share price of 50 kobo, the P.E ratio of Japaul Gold stands at -12.16x with earnings yield of -8.22"
  },
  {
    "headline": "Petrol price increase year on year by 10.87%- NBS",
    "summarized_story": "Adebayo ObajemuRecent report by the National Bureau of Statistics (NBS) revealed that the average price paid by consumers for premium motor spirit (petrol) increased by 10.87% year-on-year and decreased month-on-month by -0.58% to N164.91 in August 2021 from N165.91 in July 2021.\nStates with the highest average price of premium motor spirit (petrol) were Abia (N173.14), Ebonyi (N170.13) and Lagos (N168.31).\nStates with the lowest average price of premium motor spirit (petrol) were Niger (N162.00), Borno (N161.71) and Kano."
  },
  {
    "headline": "Nigeria records 7 deaths, 601 new cases of Covid-19 in 17 states",
    "summarized_story": "Seven more Nigerians have died from Covid-19, bringing fatality toll to 2,647, even as the country recorded 601 new cases of the virus on Thursday.\nThis according figures from the Nigeria Centre for Disease Control (NCDC) disclosed its official website on Friday morning.\nThe additional 601 COVID-19 infections, on Thursday, indicated an increase from the 299 cases reported on Wednesday.\nIt also indicated that the active cases in the country now stand at 8,964 from the 8,799 reported 24 hours earlier.\nThe disease control centre said that the additional 601 new infections were confirmed Thursday across 16 states and the Federal Capital Territory (FCT)."
  },
  {
    "headline": "Doctors Strike: Court Directs FG/NARD To Proceed With Suit As Negotiation Fails",
    "summarized_story": "The National Industrial Court, Abuja, on Friday directed the Federal Government and the Nigerian Association of Resident Doctors ( NARD) to proceed with their applications due to parties failure to reach definite terms of settlement.\nJustice Bashar Alkali delivered the ruling after the parties stated that negotiation as advised by the court had failed.\nAborishade further urged the court to invoke Section 20 of NICN proceeding to order the claimants to go into negotiation with the defendant.\nAborishade equally averred that as stipulated by law, their preliminary objection should be taken before the claimants motion on notice.\nAlkali in addition directed Maduka to move his application on motion on notice for interlocutory injunction."
  },
  {
    "headline": "Doctors Strike: Court Directs FG/NARD To Proceed With Suit As Negotiation Fails",
    "summarized_story": "The National Industrial Court, Abuja, on Friday directed the Federal Government and the Nigerian Association of Resident Doctors ( NARD) to proceed with their applications due to parties failure to reach definite terms of settlement.\nJustice Bashar Alkali delivered the ruling after the parties stated that negotiation as advised by the court had failed.\nAborishade further urged the court to invoke Section 20 of NICN proceeding to order the claimants to go into negotiation with the defendant.\nAborishade equally averred that as stipulated by law, their preliminary objection should be taken before the claimants motion on notice.\nAlkali in addition directed Maduka to move his application on motion on notice for interlocutory injunction."
  },
  {
    "headline": "No Tolerance For Quackery In Health Workers’ Recruitment – LASG",
    "summarized_story": "Lagos State government has warned quacks and unqualified applicants to steer clear of the on-going health workers recruitment exercise being conducted by the Health Service Commission or risk arrest and prosecution.\nThe permanent secretary, Lagos State Health Service Commission, Dr. Muyiwa Eniayewun, who made this known yesterday after meeting with some shortlisted candidates, in Lagos, said the health sector is a sensitive sector that caters for lives and as such, the state government has no tolerance for quackery and malpractices where human lives are involved.\n“Even after this exercise, we will continue with our due diligence for shortlisted and employed candidates; this, we have been doing in collaboration with all the health professionals bodies and associations including through our regulatory agencies”.\nEniayewun also disclosed that the Health Service Commission in partnership with various health professional bodies and associations is currently carrying out professional staff audit and verification exercise for all health workers in the state government employment as part of its zero tolerance for quackery and malpractices.\nHe disclosed that the state government through the professional audit and verification exercise recently uncovered and arrested an employee, Olufunke Adegbenro who was employed as a nurse and deployed to Isolo General Hospital three months ago by the Health Service Commission."
  },
  {
    "headline": "No Tolerance For Quackery In Health Workers’ Recruitment – LASG",
    "summarized_story": "Lagos State government has warned quacks and unqualified applicants to steer clear of the on-going health workers recruitment exercise being conducted by the Health Service Commission or risk arrest and prosecution.\nThe permanent secretary, Lagos State Health Service Commission, Dr. Muyiwa Eniayewun, who made this known yesterday after meeting with some shortlisted candidates, in Lagos, said the health sector is a sensitive sector that caters for lives and as such, the state government has no tolerance for quackery and malpractices where human lives are involved.\n“Even after this exercise, we will continue with our due diligence for shortlisted and employed candidates; this, we have been doing in collaboration with all the health professionals bodies and associations including through our regulatory agencies”.\nEniayewun also disclosed that the Health Service Commission in partnership with various health professional bodies and associations is currently carrying out professional staff audit and verification exercise for all health workers in the state government employment as part of its zero tolerance for quackery and malpractices.\nHe disclosed that the state government through the professional audit and verification exercise recently uncovered and arrested an employee, Olufunke Adegbenro who was employed as a nurse and deployed to Isolo General Hospital three months ago by the Health Service Commission."
  },
  {
    "headline": "Court Refuses To Grant Alleged Drug Baron Bail",
    "summarized_story": "Justice Tijjani Ringim of a Lagos Federal High Court on Thursday refused to grant bail to an alleged drug baron, Stephen Afam Ikeanyionwu, who was arraigned before him over allegation of attempting to smuggle hard drugs weighing 66.65 kilograms out of Nigeria.\nJustice Ringim declined to grant Ikeanyionwu’s bail application, for lacking in merit.\nThe offences, according to the prosecutor, Abu Ibrahim, violated sections 14(b) and 21(2)(d) of the National Drug Law Enforcement Agency Cap.\nWhile ruling on his bail application on Thursday, Justice Ringim held that, “the mere denial of the claim of the ‘flight risk’, by the applicant/respondent was not enough to controvert the claim.\nJustice Ringim, who is a vacation judge, also ordered that the case file should be returned to the court’s administrative Judge, for reassignment."
  },
  {
    "headline": "Buhari pledges to use football for national development, unity",
    "summarized_story": "‘‘Our National women’s football team, the Super Falcons are a force to reckon with both on the continent and internationally.\n‘‘I have also approved the unveiling of a committee to draw up a 10 year football development master plan for the country.\nOur youth are always positively engaged when our national football teams are on assignment.\nIn his remarks, Infantino renewed FIFA’s commitment to support the development of football in Nigeria, pledging to strengthen its partnership with the Nigeria Football Federation.\nThe FIFA president thanked President Buhari for supporting the development of the game, appealing to him to help FIFA amplify the message of football as a uniting force."
  },
  {
    "headline": "Buhari pledges to use football for national development, unity",
    "summarized_story": "‘‘Our National women’s football team, the Super Falcons are a force to reckon with both on the continent and internationally.\n‘‘I have also approved the unveiling of a committee to draw up a 10 year football development master plan for the country.\nOur youth are always positively engaged when our national football teams are on assignment.\nIn his remarks, Infantino renewed FIFA’s commitment to support the development of football in Nigeria, pledging to strengthen its partnership with the Nigeria Football Federation.\nThe FIFA president thanked President Buhari for supporting the development of the game, appealing to him to help FIFA amplify the message of football as a uniting force."
  },
  {
    "headline": "Congratulatory message to Pantami: CAN suspends Gombe chairman",
    "summarized_story": "The Christian Association of Nigeria, CAN, has asked its caretaker committee chairman in Gombe State, Rev.\nSunday Congo, to temporarily vacate his office for writing a congratulatory letter to the Minister of Communication and Digital Economy, Isa Ali Ibrahim Pantami, without approval of its National Executive Committee.\nCongo had extolled Pantami over his promotion to the rank of a Professor of Cyber Security by Federal University of Technology, Owerri; describing him as a ‘son’.\nHowever, a letter dated 15th September 2021, signed by CAN’s General Secretary, Joseph Daramola, and addressed to the caretaker committee chairman of the apex Christian ” in Gombe, said Congo’s suspension took immediate effect.\nIn view of the above, you are hereby directed to relinquish your position in Gombe CAN executive with immediate effect and hand over all CAN’s property to your next in line in your bloc."
  },
  {
    "headline": "Congratulatory message to Pantami: CAN suspends Gombe chairman",
    "summarized_story": "The Christian Association of Nigeria, CAN, has asked its caretaker committee chairman in Gombe State, Rev.\nSunday Congo, to temporarily vacate his office for writing a congratulatory letter to the Minister of Communication and Digital Economy, Isa Ali Ibrahim Pantami, without approval of its National Executive Committee.\nCongo had extolled Pantami over his promotion to the rank of a Professor of Cyber Security by Federal University of Technology, Owerri; describing him as a ‘son’.\nHowever, a letter dated 15th September 2021, signed by CAN’s General Secretary, Joseph Daramola, and addressed to the caretaker committee chairman of the apex Christian ” in Gombe, said Congo’s suspension took immediate effect.\nIn view of the above, you are hereby directed to relinquish your position in Gombe CAN executive with immediate effect and hand over all CAN’s property to your next in line in your bloc."
  },
  {
    "headline": "BREAKING: Court Awards N20bn Damages Against DSS For Raiding Igboho’s House",
    "summarized_story": "The raid by the Department of State Service on the home of Sunday Igboho in Ibadan was found illegal by Justice Ladiran Akintola of the Oyo State High Court.\nThe court also ordered the DSS to pay N20 billion in damages to Igboho.\nDetails will be provided later…"
  },
  {
    "headline": "Buhari Was At The Fore Of Onslaught Against Igbos During Biafra War, Didn’t Take A Day Off—Presidential Aide Boasts",
    "summarized_story": "“A man, who repeatedly tells us that for the 30 months the Nigerian Civil War lasted, he was right there at the front, not even taking one day off.\nWho, President Buhari?\n“A man, who repeatedly tells us that for the 30 months the Nigerian Civil War lasted, he was right there at the front, not even taking one day off.\nIn June, Buhari wrote in a tweet: “Many of those misbehaving today are too young to be aware of the destruction and loss of lives that occurred during the Nigerian Civil War.\nThose of us in the fields for 30 months, who went through the war, will treat them in the language they understand.”The President’s tweet riled some persons who felt he was insensitive to have made reference to killings in the civil war."
  },
  {
    "headline": "FLASHBACK: From Jonathan To Buhari: Fani-Kayode’s Long History Of Going Back To ‘Vomit’",
    "summarized_story": "Governor Yahaya Bello confirmed FFK’s decampment to the APC in February, after he danced around decamping for a while.\nRecall that when it suites FFK, he exploits his Fulani heritage which he is always keen to brandish.\nEmbracing Yahaya Bello he once cursedDuring a spat with Governor Yahaya Bello of Kogi State, FFK did not mince words when speaking his mind.\nYahaya Bello; when I wrote that this boy was a useful idiot and an accursed slave, some said I was being harsh.\nChanging stance on BuhariFFK once described President Buhari as weak, incompetent, sectional, bloodthirsty, genocidal and wicked."
  },
  {
    "headline": "BREAKING: Residents protesting insecurity block Bauchi-Dass road",
    "summarized_story": "Some residents of Birshin Fulani, a suburb of Bauchi metropolis, have blocked the Bauchi-Dass road protesting the deteriorating security in the area.\nMotorists are currently stranded on both ends of the road as a result of the development.\nBarely two weeks ago, gunmen stormed the area and killed two people, including a senior staff of the Federal Polytechnic, Bauchi, Engnr.\nDays later, more people were also abducted there.\nDetails later…."
  },
  {
    "headline": "(Breaking) Igboho’s ‘illegal’ house raid: Court slams N20bn on DSS",
    "summarized_story": "Oyo State High Court on Friday slammed N20 billion on the Department of State Security (DSS) for illegally invading Sunday Igboho’s house in Ibadan some months ago.\nJustice Ladiran Akintola who delivered the judgement directed DSS to pay the huge sum to Igboho whose name is also Sunday AdeyemolAkintola awarded the sum as exemplary and aggravated damages against the secret police in the suit filed by Igboho in which he sought N500 billion damages for the invasion.\nDetails loading..l"
  },
  {
    "headline": "VAT war: Appeal Court stops Rivers, Lagos, Southern govs kick",
    "summarized_story": "The bid by the duo of Rivers and Lagos state governments to stop the Federal Inland Revenue Services (FIRS) from collecting the Value Added Taxes (VAT) experienced a setback of sort Thursday at the Court of Appeal, Abuja.\nThe FIRS had appealed the August 9, 2021 judgment by Justice Steven Pam of the Federal High Court in Port-Harcourt, voiding the VAT Act and ruling that states could collect VAT.\nSimilarly, Lagos state Attorney General, Moyosore Onigbanjo (SAN), who stood for his state, made similar plea and urged the court to be fair and just in pending appeal.\nMoving the application, Onigbanjo argued that Lagos state government had vested interest in the VAT collection and that it would be affected by the court’s decision when delivered.\nSouthern govs kickHowever, the Southern Nigeria Governors Forum (SNGF) insisted states had the power under the law to collect VAT."
  },
  {
    "headline": "How I wooed Umahi, Ayade, Matawalle into APC – Fani-Kayode",
    "summarized_story": "Fani-Kayode also said he influenced several other defections into the ruling party.\nThe former minister said he was instrumental to the defection of the three PDP governors into the APC.\nHe listed the governors to include Dave Umahi of Ebonyi state, Ben Ayade of Cross River state and Matawale.\nFani-Kayode, who held various appointments under the PDP administrations of both Obasanjo and Jonathan, further said he has friends across party line and was wooing some PDP governors into the APC fold.\nSuch governors, he said, include Ifeanyi Ugwuanyi of Enugu state, Seyi Makinde of Oyo state and Bauchi state Governor Bala Mohammed."
  },
  {
    "headline": "FG backs CPN in fight against quacks, impostors in IT industry -NigPilot",
    "summarized_story": "According to the Minister, the establishment of CPN is government’s way of demostrating its commitment to the development and deployment of IT in Nigeria.\n“Therefore, the establishment of CPN is Government’s way of demonstrating its commitment to the development and deployment of Information Technology in Nigeria.\n“The task of nation building through Information Technology is an enormous one, but it is something we can do.\nWe are all aware of what a dynamic and progressive policy in Information Technology has done for many countries around the world.\nIt is a profession through which our lives have been affected and transformed by virtue of our deployment of Information Technology in the execution of our tasks."
  },
  {
    "headline": "Buhari receives staunch critic, Fani-Kayode into APC -NigPilot",
    "summarized_story": "President Muhammadu Buhari Thursday received one of his staunch critics and former Minister of Aviation during the President Olusegun Obasanjo government, Mr. Femi Fani-Kayode as he formally joined the ruling All Progressives Congress, APC.\nFFK as fondly called was brought to the Villa by the Chairman, Caretaker Committee of the APC, and governor of Yobe State, Mai Mala Buni.\nMr. Fani-Kayode is known to have used very unprintable words to criticize the person and administration of President Buhari.\nHe informed that he was instrumental for the exit of three Peoples Democratic Party, PDP, governors to the APC.\nThe governors he mentioned were Dave Umahi of Ebonyi State, Ben Ayade of Cross River State and Bello Matawale of Zamfara State."
  },
  {
    "headline": "World Peace Day: IPCR prioritizes peace advocacy -NigPilot",
    "summarized_story": "The Institute added that International Peace Day is dedicated to promoting the culture of peace amongst people in the world, particularly those in conflict settings or those threatened by violence.\nThe Director General, Institute for Peace and Conflict Resolution who said this while addressing a press conference ahead of the world peace day also added that Nigeria’s disquieting conflict dynamics and manifestations have necessitated the prioritization of conflict resolution.\nAccording the him, “On Tuesday, the 21 of September 2021, countries all over the world will be marking the International Day of Peace or World Peace Day with different activities targeted at realizing the objectives of the theme for the year, “Recovering Better for an Equitable and Sustainable World”.\nThe Peace Day is dedicated to promoting the culture of peace amongst people in the world, particularly those in conflict settings or those threatened by violence.\nHe disclosed that some have initiated new programmes towards promoting peace orientation among children and youths."
  },
  {
    "headline": "Killing of civilians: NAF double speaks, withdrew its denial -NigPilot",
    "summarized_story": "Barely 24 hours after the hierarchy of the Nigerian Air Force (NAF), denied trending reports that alleged killing and wounding of civilians population in Buhari village in Yobe state, the service has withdrawn its hasty denial, saying that it is investigating the tragic episode.\nUnfortunately reports reaching Nigerian Air Force (NAF) Headquarters alleged that some civilians were erroneously killed while others were injured”.\nThe Service had earlier in a separate statement averred that the report that its aircraft fired and killed civilians was false in its entirety.\nThe NAF last conducted a mission into Yobe State (Not Yunusari LGA) on 5 September 2021 and it was an armed recce.\n“Recall that a similar event happened in 2017 when the Nigerian Air Force mistakenly bombed an Internal Displaced Persons’ camp in Rann, Borno State”."
  },
  {
    "headline": "Fani-Kayode’s Claim On My Defection To APC An Insult On My Person – Gov Umahi",
    "summarized_story": "﻿Governor of Ebonyi State, Dave Umahi, has countered Former Minister of Aviation, Mr Femi Fani-Kayode’s claim that he contributed to his (Umahi’s) defection to the All Progressives Congress (APC).\n“I think he needs to withdraw that statement, he’s my good friend but, it was an insult on my person and the other governors,” Umahi said on Channels Television’s Politics Today on Thursday.\n“The man did not know when I moved, but incidentally he visited me and we discussed, and he said he was coming to join me with the other governors to declare.\n“How will somebody in the PDP be instrumental to my moving?,” Umahi asked.\nRead Also: Fani-Kayode Joins APC, Explains Role In Defection Of Three PDP GovernorsMore to follow…"
  },
  {
    "headline": "Court Orders FG To Pay Sunday Igboho N20bn In Damages",
    "summarized_story": "An Oyo State High court has ordered the Federal Government to pay Yoruba nation agitator, Sunday Adeyemo, a.k.a.\nSunday Igboho, the sum of N20 billion.\nJustice Ladiran Akintola awarded the sum on Friday as compensation for the invasion of Igboho’s house and for what was described as exemplary and aggravated damage done against the activist.\nIgboho through his lawyer, Yomi Alliyu, had filed a suit challenging the invasion of his house in Ibadan on July 1 by operatives of the Department of State Services (DSS).\nRead Also: [Igboho Aides] Robbers Stole Our Case File – DSS LawyerMore to follow…"
  },
  {
    "headline": "Nigeria Records 601 New COVID-19 Cases, Seven More Deaths",
    "summarized_story": "Nigeria has recorded 601 new COVID-19 cases and seven more deaths from the virus.\nThe Nigeria Centre for Disease Control (NCDC) disclosed in its COVID update released on Thursday night.\nThis now brings the total confirmed cases across the country to 200,957.\n189,346 infected persons have, however, recovered and have been discharged, while a total of 2,647 deaths have been recorded in 36 states and the Federal Capital Territory.\nBelow is a breakdown of cases across the country."
  },
  {
    "headline": "Southern Governors Back VAT Collection By States, Zoning Of 2023 Presidency To South",
    "summarized_story": "They made the declaration on Thursday at a meeting of the governors held at the Government House in Enugu State.\nAccording to him, the meeting resolved to support the position that the collection of VAT falls within the powers of the states.\nThe governors reaffirmed their commitment to fiscal federalism and stressed the need for the southern states to pursue its inclusion in the Nigerian Constitution, through the ongoing constitutional amendment.\nAhead of the general elections in 2023, the governors insisted that the next Nigerian leader must come from the South.\nSimilarly, the governors lauded the Nigerian Governors’ Forum for its handling of issues around the Petroleum Industry Act (PIA) and ownership of the Nigerian National Petroleum Corporation (NNPC)."
  },
  {
    "headline": "Things Fall Apart: Negotiations Fail As FG, NARD Head Back To Court",
    "summarized_story": "The negotiation and possible settlement, between the Federal Government – through the Ministry of Labour and Employment, and the Nigerian Resident Doctors (NARD), has failed.\nHe added that they brought an entirely different settlement that wasn’t in the original document and walked out of the meeting with the Labour Minister.\nFurthermore, the counsel stressed that there have been interventions from the President, Vice President and the National Assembly, but NARD has refused to shift grounds.\nHe insisted they never walked out of the meeting and urged the court to order the Federal Government to go into negotiations and reconcile on issues within the additional document.\nThe proposed new term of settlement by the resident doctors, which is predicated upon the recognition that the timelines in the original Memorandum of Understanding, has relapsed, is one of the reasons the negotiation failed."
  },
  {
    "headline": "Nigeria, ECOWAS insist on prompt transition to Civil rule in Guinea -",
    "summarized_story": "Nigeria has called on the Economic Community of West African States (ECOWAS) to insist on a short transition programme that will usher in a new civilian government in that country.\nThe Vice President restated the call to engage global bodies and Africa’s development partners in taking steps to prevent such unconstitutional change of government in countries on the continent.\nWhile he noted that although the military junta in Guinea had started consultation with critical stakeholders towards transitioning the country to civil rule, the Vice President reiterated Nigeria’s stance, condemning military intervention and unconstitutional change of government in the West African country.\nAssuring that Nigeria will continue to closely monitor the situation in Guinea, the VP pledged the country’s support in ensuring that only democratic processes are adopted in changing governments in the sub-region.\nThe extraordinary session was chaired by President of Ghana and Chair of the ECOWAS, Nana Addo Dankwa Akufo-Addo."
  },
  {
    "headline": "VAT Collection: Court of Appeal reserves ruling on Lagos joinder presentation -",
    "summarized_story": "The Appeal Court in Abuja has reserved ruling on a motion by the Lagos state government seeking to be joined as an interested party in an appeal concerning the empowerment of states to collect Value Added Tax.\nVAT Collection: Court of Appeal reserves ruling on Lagos joinder presentationRecent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided.\nArchives Archives Select Month September 2021 (269) August 2021 (544) July 2021 (519) June 2021 (603) May 2021 (614) April 2021 (693) March 2021 (769) February 2021 (685) January 2021 (770) December 2020 (677) November 2020 (609) October 2020 (507) September 2020 (780) August 2020 (768) July 2020 (735) June 2020 (682) May 2020 (532) April 2020 (530) March 2020 (456) February 2020 (486) January 2020 (656) December 2019 (705) November 2019 (650) October 2019 (607) September 2019 (574) August 2019 (631) July 2019 (719) June 2019 (747) May 2019 (908) April 2019 (620) March 2019 (516) February 2019 (528) January 2019 (561) December 2018 (492) November 2018 (583) October 2018 (616) September 2018 (568) August 2018 (585) July 2018 (500) June 2018 (437) May 2018 (408) April 2018 (430) March 2018 (510) February 2018 (547) January 2018 (550) December 2017 (291) November 2017 (498) October 2017 (715) September 2017 (675) August 2017 (689) July 2017 (671) June 2017 (679) May 2017 (987) April 2017 (1042) March 2017 (1141) February 2017 (676) January 2017 (612) December 2016 (596) November 2016 (571) October 2016 (639) September 2016 (162) March 2016 (39) May 2015 (1)Categories Categories Select Category #AnambraVotes (15) #Ekiti2018 (25) #EkitiVotes (14) #LagosBuildingCollapse (2) #LiberiaRunOff (6) #OsunDebate (5) #OsunVotes (29) America (554) Asia (279) Athletics (113) Basketball (44) Boxing (69) Breaking News (118) Business News (5,355) Central Africa (85) East Africa (179) Election 2019 (26) Entertainment News (703) Europe (405) Events (16) Fashion (5) fashion & style (15) Featured (533) Football (1,583) Formula 1 (19) Golf (15) Health News (2,180) inside lagos (1) International (7,081) Kogi Election (10) labour lens (5) Lassa Fever & Coronavirus (18) Latest News (25,005) Africa (363) West Africa (184) Livestream (3) Metro (25) Middle East (174) Movies (31) Music (74) Nigeria News (20,672) Nollywood (34) Non classifié(e) (1) North Africa (175) Politics News (5,521) #EdoDecides (22) #LagosCouncilElections (4) #NigeriaVotes (240) #OndoDecides (100) Bayelsa Election (7) nnamdi kalu (9) Presidential Election (45) Science & Technology (8) Shows (2) Southern Africa (173) Sports News (3,405) Table Tennis (20) Tech (22) Tennis (111) the platform (1) Top Stories (38) U-Report (5) Uncategorized (276) VIDEO (1,201) Business Nigeria (3) Business Week (2) Community Forum (11) Crime Watch (102) Fireworks (13) Green Angle (4) Journalists Hangout (106) News at 10 PM (23) Special Reports (112) Sports Debate (32) Sports Desk (3) Standpoint (1) The Big Issue (4) The Sunday Interview (108) This Morning (85) TVC Breakfast (831) TVC Investigates (6) Wildlife (5) World News (2,036)"
  },
  {
    "headline": "[BREAKING] Court grants N20bn aggravated damages to Sunday Igboho -",
    "summarized_story": "An Oyo State High Court has granted a twenty billion naira aggravated damages to the Yoruba nation agitator, Sunday Adetyemo, popularly known as Sunday Igboho.\nJustice Ladiran Akintola who gave the judgment in Ibadan, said all relief sought by the Yoruba Nation activist are also granted.\nJustice Ladiran said the judgment would serve a lesson to Government agencies who are fond of infringing on the fundamental human rights of citizens.\nSunday Adeyemo had earlier filed a 500 billion naira compensation from the Federal Government for infringing on his fundamental human rights.\nCounsel to Sunday Igboho, Yomi Aliu while reacting to this said the judgement by the court was fair and historical in the history of Nigerian democracy."
  },
  {
    "headline": "Court resumes Sunday Igboho's N500bn case against FG",
    "summarized_story": "The case of 500billion naira filed against the Department of State Service and the Federal Government by Yoruba Nation agitator, Sunday Adeyemo also known as Sunday Igboho has resumed.\nThe sitting started around 9am after it’s adjournment by Justice Ladiran Akintola of Oyo State High court.\nSunday Adeyemo is seeking a five hundred billion naira compensation for the infringement on his fundamental human rights by the Department of State Security.\nOn the contrary, counsels to the Federal Government want the court to nullify an interim order given by the court restraining the Federal government from arresting or freezing the account of the Sunday Igboho."
  },
  {
    "headline": "Pineapple Plant in Nigeria’s Southwest Ogun State Produces 21 Fruits at Once",
    "summarized_story": "A pineapple sucker on a farm in Ogun State has just produced what appears to be a record-breaking number of fruits in one go.\nARISE News visited the farm to find out more on what’s occurred and Laila Johnson-Salami sends in this report…"
  },
  {
    "headline": "Senator Abaribe Wonders How Buhari’s Government Negotiates with Those Who Down Aircraft, But Not IPOB",
    "summarized_story": "Senate minority leader Enyinnaya Abaribe has blamed the Nigerian government for the actions and tag associated with the proscribed Indigenous People of Biafra (IPOB).\nMr Abaribe questioned the trend of the federal government leaving people who have shot down a military aircraft without designating them as terrorists but quickly call the IPOB group terrorists.\nAccording to the lawmaker, if the federal government is interested in having peace in the southeast it should not be seen dismissing the option of talking to the proscribed group and seen speaking with the people that shot down a military aircraft.\nWatch Senator Abaribe speak on the issues here…"
  },
  {
    "headline": "There’s an Attempt to Introduce Assassinations in Nigeria’s South East, Senator Abaribe Alleges – Arise News",
    "summarized_story": "The minority leader of the Nigerian Senate, Enyinnaya Abaribe, says there is an attempt to introduce into the southeast region incessant killings and assassinations which he says is alien to the region.\nSenator Abaribe stated this on Friday when he featured on an ARISE News programme, The Morning Show and notes that the sooner those behind the continuous killings are fished out, the better.\nRecently, Mr Abaribe was part of a meeting of lawmakers from the southeast region seeking a political solution to the sit-at-home order in the region and the release of incarcerated Nnamdi Kanu, the leader of the outlawed Indigenous People of Biafra.\nSenator Abaribe says negotiations with federal authorities for Kanu’s release will not be easy.\nWatch the interview for more…"
  },
  {
    "headline": "ECOWAS Freezes Assets, Imposes Travel Ban on Guinea Coup Leaders, Calls for Elections in Mali",
    "summarized_story": "Regional heads of state decided to freeze the financial assets and impose travel bans on Guinea’s military leaders and their relatives, insisting on the release of President Alpha Conde and a short transition.\n“In six months elections should be held,” said ECOWAS Commission President Jean-Claude Kassi Brou at a briefing.\nAnyone in Mali hindering preparations for the elections faces the same sanctions as those imposed in Guinea, it said.\nCoup leaders in Guinea are holding consultations this week with various public figures, groups and business leaders in the country to map a framework for the transition.\nSeparately on Thursday, the International Monetary Fund said it was closely monitoring the situation in Guinea and called for a peaceful resolution."
  },
  {
    "headline": "US and UK Face Global Backlash Over Australia Defence Deal",
    "summarized_story": "The US and UK are facing growing international criticism over a new security pact signed with Australia.\nThe deal – seen as an effort to counter China – will see the US and UK give Australia the technology to build nuclear-powered submarines.\nThe alliance, known as Aukus, was announced by US President Joe Biden, UK Prime Minister Boris Johnson and his Australian counterpart Scott Morrison on Wednesday.\nBut the prime minister was questioned by his predecessor, Theresa May, about whether the deal could lead to Britain being dragged into war with China.\nShe asked the prime minister about the “implications” of the partnership in the event of a Chinese invasion of Taiwan."
  }
]