[
  {
    "headline": "12 burnt to death in Ilorin-Ogbomoso road crash",
    "summarized_story": "Tragedy struck on Saturday when 12 persons were burnt to death in an auto crash on the Ilorin-Ogbomoso Expressway in the Asa Local Government Area of Kwara State.\nIt was learnt that the accident, which occurred in Otte at about 7am, resulted from a head-on collision between a commercial Toyota Hummer bus and a Volvo truck loaded with cement.\nSix of the passengers were rescued alive with burns injury while the deceased passengers were burnt beyond recognition.\nThe Federal Road Safety Corps blamed the accident on speed limit violation and route violation by the drivers.\nThe Kwara State Fire Service, which took part in the rescue operation, urged drivers to be more careful on the highway."
  },
  {
    "headline": "Group campaigns against media profiling of PWDs",
    "summarized_story": "A non-governmental organisation, Theseabilities Foundation, has called on journalists and media practitioners to desist from use of words or expressions that amount to profiling while reporting about persons with disabilities.\nAt the webinar, advocates and participants sought better ways to navigate through language when referring to persons with disabilities.\nAlexander said, “This is particularly evident in commentaries and reporting of events and stories about persons with disabilities.\n“One of the things you must bear in mind when addressing PWDs is that the language must convey respect, dignity.\nInstead say something like ‘wheelchair user’ or ‘person on wheels’."
  },
  {
    "headline": "Colonial masters responsible for Nigeria’s faulty foundation ― Ganduje",
    "summarized_story": "Governor Abdullahi Ganduje of Kano State has attributed the challenges of nation building in Nigeria to the faulty foundation laid by the colonial masters.\nThe governor said that the faulty foundation laid by the colonial masters was purely done to actualise their interests and not for any genuine development of the country.\n“The challenges of nation building in Nigeria are attributable to the very faulty foundation laid by the European colonial masters.\nGanduje said that the colonial rule divided Nigeria into North and South without much concern for the peculiarities of the two regions.\n“Nation-building is about building a common sense of purpose, sense of shared destiny and collective imagination of belonging."
  },
  {
    "headline": "Bamise: Gov’ship aspirant, Jandor wants perpetrators brought to justice",
    "summarized_story": "JandorBy Olasunkanmi AkoniLead Visioner, Lagos4Lagos and Peoples Democratic Party, PDP, Governorship aspirant in Lagos, Dr. Olajide Adediran, popularly called, Jandor, has called for thorough investigation and prosecution of those involved in the abduction and gruesome killing of Oluwabamise Ayanwole on a Bus Rapid Transit, BRT.\nJandor, made the call when he led a delegation on a condolence visit to residence of the bereaved family on Saturday.\nSpeaking to the family of the deceased, Jandor, described the sudden death as “tragic and unfortunate.”“The death of the innocent young lady in an unfortunate and avoidable circumstance is worrisome” he said.\nJandor added that the Bamishe’s case should be seen by concerned residents and the Government as one too many incidents, where residents, especially the youths are being lost to avoidable deaths.\nHe therefore, tasked the administration of Governor Babajide Sanwo-Olu to make this particular case, a deterrence to all criminally minded individuals by ensuring justice is served."
  },
  {
    "headline": "2023: What Obasanjo told me about Igbo presidency – Ohuabunwa",
    "summarized_story": "By Nnamdi OjiegoAs part of efforts to actualize his presidential ambition, an aspirant on the platform of the Peoples Democratic Party, PDP, Mazi Sam Ohuabunwa, on Thursday, visited former President Olusegun Obasanjo, in Abeokuta, the Ogun State capital.\nThe former President of the Pharmaceutical Society Of Nigeria, PSN, revealed that Obasanjo made it clear to him that it was the turn of Ndigbo to produce the president of Nigeria in 2023.\nHe said: “We talked about Nigeria and my presidential ambition.\nHe told me it’s the turn of the South East.\nHe also believed that there are a lot of things the South East can bring to the table beyond bringing unity to the country."
  },
  {
    "headline": "APC Convention: Buhari warms against backstabbing – Calls for order",
    "summarized_story": "By Johnbosco AgbakwuruAhead of the March 26 convention, President Muhammadu Buhari has warned the leaders (and membership) of the All Progressives Congress (APC) to desist from name-calling and backstabbing.\nPresident Buhari’s note of warning to the APC was disclosed via a statement issued by his Senior Special Assistant on Media and Publicity, Mallam Garba Shehu in Abuja.\nAccording to the statement, “President Buhari asks the members to look at the once-powerful, “main opposition” Peoples Democratic Party (PDP) now enfeebled and adrift and learn lessons in disunity, mismanagement and corruption.\n”But parties splintered by competing egos destine themselves to the worst possible fate,” the President warned.\n“It is important to ask what benefits the poor are getting during the period of intense negative coverage."
  },
  {
    "headline": "Don’t sit on the fence in nation’s politics, Cleric warns Christians",
    "summarized_story": "By James OgunnaikeABEOKUTA – Popular cleric in Ogun state, Prophet Sunday Dare Iyunade, has called on Nigerian Christians to take active parts in the nation’s politics, to salvage the country’s democracy from collapse.\nThe cleric lamented that democracy had been bastardised in Nigeria, saying that only Nigerians, especially the Christians with integrity can cleanse the system.\n“Christians are running away from politics because they think it is a dirty game.\nIt is the role of the church to sensitise and encourage their members to actively participate in politics”.\nThey must raise Christians with an untainted character who will rescue Nigeria from the doom we are heading to."
  },
  {
    "headline": "Russia vs Ukraine: This war is difficult, some towns don’t exist again – Zelensky cries out",
    "summarized_story": "Ukrainian President, Volodymyr Zelensky, has described the ongoing war between his country and Russia as a very difficult one.\nZelensky also said that Russia has succeeded in whipping out some small towns in the country and that those towns would never assist again.\n“This war, a difficult war, has truly united our nation.” Zelensky said in a briefing on Saturday, according to CNN.\n“A few small towns just don’t exist anymore.\nHe added that negotiations to end Russia’s invasion of Ukraine “must begin with a ceasefire.”"
  },
  {
    "headline": "Aninri community pledges loyalty, passes vote of confidence in Gov. Ugwuanyi",
    "summarized_story": "Ugwuanyi at the Government House, Enugu, on Saturday.\n“We sincerely appreciate you for seeing that Nenwe produced her first House of Assembly member in the history of Nenwe town.\nOkwu Chinedu and all your appointees from Nenwe town.\nIsrael Ani and the President General, Agbada Nenwe Town Union and Coordinating Presidents General of Nenwe Town Unions, Comrade Ifeanyi Mbude reiterated the support, solidarity, loyalty and confidence of the people of Nenwe community in Gov.\nYou did not stop there, you also gave us member of Enugu State Judicial Commission in the person of Mrs. Amaka Alinta Oriaku."
  },
  {
    "headline": "Bauchi govt approves N100m for Qu’ranic recitation competition",
    "summarized_story": "Bauchi State Governor, Senator Bala Abdulkadir Mohammed, on Saturday, announced the approval of N100million by the state government for this year’s National Quranic Recitation Competition to be hosted by the state.\nGovernor Mohammed made the announcement while inaugurating a 52-man local organising committee for the competition, to be held on March 18, at the Government House, Bauchi.\n“Hosting the 36th edition of the National Quranic Recitation Competition by the Bauchi State Government in collaboration with Usman Danfodio University, Sokoto, is an opportunity to organise the best ever national Musabaqa,” he said.\nWhile assuring that he would not abolish Tsangaya and other modern Qu’ranic schools in the state, Mohammed said the state government was, however, against street begging by Almajirai.\nAccording to him, Tsangaya and other Qu’ray schools were avenues for learning Islamic knowledge, saying that participants in the national Musabaqa were produced by such schools."
  },
  {
    "headline": "War: Why NATO cannot fight Russia in Ukraine – Biden",
    "summarized_story": "The United States President, Joe Biden, says NATO will not fight a war against Russia in UkraineBiden, in a series of tweets on his verified Twitter account, said a direct confrontation between NATO and Russia is World War III.\nBiden wrote , “I want to be clear: We will defend every inch of NATO territory with the full might of a united and galvanized NATO.\n“But we will not fight a war against Russia in Ukraine.\n“A direct confrontation between NATO and Russia is World War III.\nAccording to Biden, although Putin’s plan to dominate Ukraine without a fight and split America has failed."
  },
  {
    "headline": "War: You’re making dangerous move – Russia warns US against transferring weapons to Ukraine",
    "summarized_story": "Russian Deputy Foreign Minister, Sergei Ryabkov, has warned the United States (US) about the potential consequences of transferring weapons to Ukraine.\nRyabkov said that convoys with foreign weapons would be “legitimate targets,” adding that the US would be making a ‘dangerous move.’He stated this on Saturday on the state-run Channel One, according to Russia’s state-owned RIA Novosti news agency.\nRyabkov said, “We warned the United States that pumping Ukraine with weapons from a number of countries orchestrated by them is not just a dangerous move, but these are actions that turn the corresponding convoys into legitimate targets.”The war between Ukraine and Russia began in February.\nThe war enters its sixteenth day today, with massive casualties already recorded.\nRussian President Vladimir Putin, who had ordered the invasion of Ukraine over disagreements on some political issues, had listed some conditions to end the war."
  },
  {
    "headline": "Nigeria must pray over 2023 general elections, says NASFAT",
    "summarized_story": "Nasrul-Lahi-l-Fatih Society (NASFAT) has urged Nigerians to pray for a successful 2023 general elections.\nPresident of NASFAT, Alhaji Abdulmumeen Yusuf, said this at the special prayers for the nation and fund raising for NASFAT mosque organized by Federal Capital Territory (FCT) Zone.\nYusuf advised Nigerian leaders to always put God first in whatever they do.\nElection is less than a year from now and it is important that we pray for a successful election.\nWhen things are difficult we must consult and pray to God."
  },
  {
    "headline": "Maiduguri residents protest rising criminal activities",
    "summarized_story": "Some residents of Shagari Low-cost Housing in Maiduguri on Saturday staged a peaceful protest against what they described as ‘increase in criminal activities’.\nThe protesters demanded immediate closure of “Kasuwan Fara,” a commercial joint known to be habouring drug peddlers, commercial sex workers and other nefarious activities.\n“When you come to Shagari Low-cost in the evening, you will see many prostitutes and youths from different parts of Maiduguri engaging in all sorts of anti-social activities.\nWada said while notorious brothels in Galadima, Artillery, Gamboru, Wulari, Hot Bite, Baga Road, Mairi and London Ciki were shut down, most of the activities had surfaced in Shagari Low-cost.\n“Between last year and this year, residents in this area found seven abandoned babies thrown away by unknown persons,” he said."
  },
  {
    "headline": "AFAN commends FG’s ban on direct sale of farm produce to foreigners",
    "summarized_story": "All Farmers Association of Nigeria, (AFAN) on Saturday, threw its weight behind the Federal Government’s ban on direct purchase of farm produce involving indigenous farmers and foreign nationals, describing it as a welcome development.\nAFAN in a statement signed by its National Publicity Secretary, Mohammed Magaji, said the Federal Government’s stand was taken to protect farmers from being short-changed, stressing that this had always been the position of the association.\nAccording to him, with the new directive, all foreign nationals are expected to go through licensed local agents to do business with the indigenous farmers.\n“In view of this, AFAN wishes to appreciate the FederalGovernment for banning any direct purchase of farm produce involving indigenous farmers and foreign nationals.\nHe said the availability of harvest loan will enable the farmers to harvest their crops with ease without being forced to dispose their produce to foreign nationals out of scarcity of funds at the period of harvest."
  },
  {
    "headline": "Nigeria, Korea trade volume hits $2b",
    "summarized_story": "The trade volume between Nigeria and the Republic of Korea increased by 50 per cent in 2021, hitting $2billion.\nThe envoy challenged Nigerian companies to study the market needs of Korea to produce what is needed and the standard required.\nYoung – Chae said: “The trade volume between Nigeria and the Republic of Korea was around two billion dollars in 2021 which was an increment of about 50 per cent on what it used to be.\n“The balance of trade between the countries is balanced because while Korea exports manufacturing goods into Nigeria, it also imports a lot of gas and crude oil from Nigeria.\n“I hope more Nigerian companies will study the Korean market and Korean customers to know what they need and the standard requirements."
  },
  {
    "headline": "Protests in Abakaliki over court ruling sacking governor",
    "summarized_story": "The sack of Governor David Umahi by an Abuja High Court has continued to generate ripples across Ebonyi State.\nBut thousands of residents from Igariwey’s hometown of Afikpo matched round the city on Saturday to show support for the governor.\nReceiving the crowd, Chairman of the council, Obiageri Oko Enyim, noted that the people of the council are solidly behind the governor.\nWe have many cases at the appeal and Supreme Court levels showing a governor can defect without losing his office.\n“If you are governor of a state when you win election, as a governor, you are a governor for all”, he said."
  },
  {
    "headline": "Nigeria exits IMB piracy lists-Chief of Naval Staff",
    "summarized_story": "BY PHILIP NWOSUThe Chief of Naval Staff, Vice Admiral Awwal Gambo said that the Nigerian Navy remain committed in eradicating criminality within the country’s maritime domain and by extension the Gulf of Guinea.\nHe said that the naval maneuver will impact positively to the Nigerian Navy combat operations through training and it will also expose other maritime agencies to the benefit of inter-agency cooperation and international collaboration.\nThe Chief of Naval Staff revealed that with the latest International Maritime Bureau (IMB) report of March 2022, Nigeria has finally exited the IMB piracy list, adding that, “these achievement is attributable to the sustained presence of the Nigerian Navy vessels at sea and increased regional synergy and maritime domain awareness.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nIn the 2022 EXERCISE OBANGAME EXPRESS, the Naval Chief said, Nigerian navy will be deploying 10 war ships, two helicopters, maritime domain awareness assets and elements of the Special Boat Services (SBS)."
  },
  {
    "headline": "How we saved Nigeria N189b from surplus personal cost-ICPC",
    "summarized_story": "The Chairman of Independent Corrupt Practices and Other Related Offences Commission (ICPC), Professor Bolaji Owasanoye, has revealed how the Commission’s advisory to the government helped to block N42 billion personnel cost from being diverted.\nThis was contained in a statement issued by Mrs Azuka Ogugua, ICPC Spokesperson at the weekend.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nBased on these findings, about N42 billion unspent surplus allocation was blocked based on our advisory to the government,” the Chairman said.\n‘Of course, this could be extended to the non-public sector agencies but the main focus is the public sector agencies."
  },
  {
    "headline": "Treat fuel scarcity as national emergency-NLC advises FG",
    "summarized_story": "From Adanna Nnamani, AbujaThe Nigerian Labour Congress (NLC) has called on the federal government to treat the current fuel scarcity in the country as a national emergency and immediately arrest the situation.\nA crisis that started with the supply of sub-standard Premium Motor Oil (PMS) has now degenerated into a persisting scarcity of not only PMS but also other petroleum products such as Diesel and Aviation Fuel.\nThe socio-economic strain of both the scarcity and the high cost of petroleum products on ordinary Nigerians and manufacturing firms is best imagined.\nThe current hemorrhage induced by the prevailing scarcity of petroleum products has very grave concomitant effects on the already perilous unemployment and security situation in our country.\n“This scarcity of refined petroleum products in our country must be treated as a national emergency."
  },
  {
    "headline": "Ibadan stands still, as Balogun becomes 42nd Olubadan",
    "summarized_story": "From Oluseye Ojo, IbadanMany roads were on lockdown in many parts of Ibadan, the Oyo State capital on Friday, as Governor Seyi Makinde installed Oba Olalekan Ishola Balogun (Alli Okunmade II) as the 42nd Olubadan of Ibadanland.\nBefore the presentation of staff of office, Olubadan had undergone some traditional rites, which were said to have been positive.\nOne of the highpoints of the ceremony was the traditional homage paid by the chiefs in Ibadan to Olubadan at the ceremony.\nThey were led by the Osi Olubadan and a former governor of Oyo State, Senator Rashidi Ladoja, who prostrated for the new Ibadan monarch.\nIn his address on the occasion, The new Olubadan, who appreciated the dignitaries that honoured him and the Ibadan, promised that he would not let Ibadan and Nigeria down."
  },
  {
    "headline": "Igboho: Agitation for Yoruba Nation resumes next week –Akintoye",
    "summarized_story": "From Oluseye Ojo, IbadanThe apex Yoruba self-determination organisation, Ilana Omo Oodua (IOO), has threatened to resume its agitation for Yoruba nation from next week.\nThe leader of the organization, Prof Banji Akintoye, made this position clear in an interview with Saturday Sun.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nBut he did not mince words when he added that the agitation for self-determination would be pursued with vigorous energy.\nOur advice is for him never to be deterred in the struggle for self-determination for Yoruba nation."
  },
  {
    "headline": "Start Mobilising Now, Saraki Tells PDP Youth Leaders",
    "summarized_story": "Former President of the Senate, Dr. Abubakar Bukola Saraki, has challenged the national, zonal and state youth leaders of the Peoples Democratic Party (PDP) and all youth stakeholders in the party to begin the process of mobilising their peers across the nation to select leaders that will meet the aspirations of young people.\nWhile delivering his remarks at the Wadata Plaza, PDP Headquarters in Abuja, venue of a Youth Leaders Summit organised by the PDP National Youth Leader, Prince Mohammed Kadede Sulaiman, Saraki reiterated the need for more young people to have seats at the table in the next government.\n“We have never had a National Youth Leader who symbolises such youthfulness in our party — or any other party in the country.\nSaraki reminded the youth leaders that as it stands, there are currently over 18 million Nigerian young people who are not yet registered to vote.\nYou need to start mobilising at the ward, state, and zonal levels."
  },
  {
    "headline": "Buni May Return as APC Caretaker Chair, Emergency NEC Meeting Not Recognised",
    "summarized_story": "Bello and Professor Mamman were said to have signed the letter notifying the Commission about CECPC decision to hold the emergency NEC meeting and invited INEC to come and monitor it.\nThe INEC letter titled, “Re: Invitation to the Emergency Meeting of the National Executive Committee”, dated March 9, 2022, was signed by the Secretary to the Commission, Mrs Rose Omoa Oriaran-Anthony.\nFor INEC to monitor the emergency NEC meeting, the APC letter notifying it ought to have been written earlier than March 8.\nThis is our best option, otherwise, the party will crumble.”He added: “There is no point keeping Sani Bello as caretaker Committee Chairman.\nINEC National Commissioner of Voter Education and Publicity, Mr. Festus Okoye said: “The Commission has formal ways of communicating with political parties."
  },
  {
    "headline": "Lekan Balogun Installed 42nd Olubadan of Ibadanland, Promises Not to Let Ibadan Down During His Reign",
    "summarized_story": "Kemi Olaitan in IbadanThe new Olubadan of Ibadan, Oba Mohood Olalekan Balogun Alliwo, Alli Okunmade II, who was installed as the 42nd monarch on the revered tool yesterday at the historic Mapo Hall, has pledged not to let Ibadan down during his reign.\nAlso, Moshood Ayanyemi, Atookowagbowo led other Ibadan drummers to welcome the guests and well-wishers to the occasion in a traditional way.\nMakinde, in his speech, declared that the event was a victory for Ibadanland and a restoration of the dignity of its exemplary traditional chieftaincy system.\nAccording to the governor, the Ibadan traditional system is a time-tested and long-lasting chieftaincy system that has remained a worthy example in chieftaincy succession across the globe.\nThe 42nd Olubadan of Ibadanland was ushered into the venue at exactly 11.50am, after which all the traditional chiefs, Mogajis, religious leaders, leaders of various associations in Ibadanland paid homage to Oba Balogun."
  },
  {
    "headline": "US to Partner Nigeria to Stop Gas Flaring By Conversion to Ammonia",
    "summarized_story": "Silva explained that Nigeria already has a transition plan which is predicated on a multi-track approach to developing energy resources.\nOne of those is a focused development of the country’s gas resources during which period a diversified economy would be built around technology and other energy sources.\nDiscussions on the subject were taken from different perspectives, including zeroing-in on gas potentials and the implication of continued gas flaring and reinjection.\nThe point of convergence is the responsible monetization of Nigerian’s gas resources which the American counterparts were in agreement.\nThis the US team suggested would be a good way for Nigeria to utilize its abundant Natural gas resources of over 200 trillion cubic feet (TCF)."
  },
  {
    "headline": "FG: No More Subsidies in Power Sector, Fuel Subsidy to Go in Phases",
    "summarized_story": "*Says power sector subsidy removal quietly doneNdubuisi Francis in AbujaThe federal government disclosed Friday that it had quietly removed all subsidies in the power sector, even as it plans to gradually stop similar subsidies on petroleum motor spirit (PMS), popularly known as fuel.\nThe Minister of Finance, Budget and National Planning, Mrs. Zainab Ahmed, who made the disclosure during a virtual meeting of African finance ministers and the International Monetary Fund (IMF), said: “We are cleaning up our subsidies.\nWe had a setback, we were to remove fuel subsidy by July this year but there was a lot of push back from the polity.\nIt has thrown up our deficits too much higher than we planned.\n“Hopefully, the parliament will agree with us and we are able to continue with our plan for subsidy (removal) otherwise the way things are going we will not be able to predict where we will be,” she said."
  },
  {
    "headline": "Residents Flee As Ebubeagu Operatives Invade Imo Community, Kill Many, Raze Market",
    "summarized_story": "Residents of Amankwo in Orsu Local Government Area of Imo State have fled the community after an attack by members of Ebubeagu security outfit, who killed a yet-to-be ascertained number of people.\nOperatives of the security outfit were said to have stormed Amankwo community on Monday, shooting sporadically.\nResidents told SaharaReporters that the local security operatives also set ablaze a market in the community known as Nkwo-Idemili.\n“Hope Uzodimma's so-called Ebubeagu descended on the market in my community on Monday, torched and razed down the timber section of the market.\nPlease help us beg the government to stop these siege and senseless killings,” a resident told SaharaReporters."
  },
  {
    "headline": "Residents Flee As Ebubeagu Operatives Invade Imo Community, Kill Many, Raze Market",
    "summarized_story": "Residents of Amankwo in Orsu Local Government Area of Imo State have fled the community after an attack by members of Ebubeagu security outfit, who killed a yet-to-be ascertained number of people.\nOperatives of the security outfit were said to have stormed Amankwo community on Monday, shooting sporadically.\nResidents told SaharaReporters that the local security operatives also set ablaze a market in the community known as Nkwo-Idemili.\n“Hope Uzodimma's so-called Ebubeagu descended on the market in my community on Monday, torched and razed down the timber section of the market.\nPlease help us beg the government to stop these siege and senseless killings,” a resident told SaharaReporters."
  },
  {
    "headline": "Nigerian Soldier Caught Extorting Money From Motorists By Superior Officer Cries, Begs For Forgiveness",
    "summarized_story": "A soldier has be caught extorting money from motorists along the popular Maiduguri-Damaturu Highway by a superior officer.\nWhile the time the video was shot was unknown, the soldier was seen crying, prostrating and pleading with a senior officer, who caught him extorting a motorist.\nThe soldier was asked by the superior to surrender all the money extorted from motorists.\nWhile the armed soldier was heard saying he has worked for many years for the Nigerian Army amid tears, the unknown superior officer responded by telling the erring personnel that he was behaving like a low-level soldier.\nCommenting on the video, a soldier said, “He is not a young soldier at all, he is a staff sergeant, it’s so sad."
  },
  {
    "headline": "Nigerian Soldier Caught Extorting Money From Motorists By Superior Officer Cries, Begs For Forgiveness",
    "summarized_story": "A soldier has be caught extorting money from motorists along the popular Maiduguri-Damaturu Highway by a superior officer.\nWhile the time the video was shot was unknown, the soldier was seen crying, prostrating and pleading with a senior officer, who caught him extorting a motorist.\nThe soldier was asked by the superior to surrender all the money extorted from motorists.\nWhile the armed soldier was heard saying he has worked for many years for the Nigerian Army amid tears, the unknown superior officer responded by telling the erring personnel that he was behaving like a low-level soldier.\nCommenting on the video, a soldier said, “He is not a young soldier at all, he is a staff sergeant, it’s so sad."
  },
  {
    "headline": "Grammy-winning Singer, Toni Braxton, Loses Sister, Traci, To Cancer",
    "summarized_story": "Traci Braxton, reality star and sister of Grammy-winning singer, Toni Braxton, has died at the age of 50.\nThe singer and reality star had been in a quiet cancer battle throughout the past year, TMZ reports.\nBraxton had been joined by her famous sisters on Braxton Family Values, which she appeared on for its full run from 2011 to 2020.\n“It is with the utmost regret that we inform you of the passing of our sister, Traci,” Toni wrote alongside a black and white photo of her with her sisters.\n“Needless to say, she was a bright light, a wonderful daughter, an amazing sister, a loving mother, wife, grandmother and a respected performer."
  },
  {
    "headline": "Ekweremadu announces governorship bid, says zoning is 'treachery of politics'",
    "summarized_story": "Ike Ekweremadu, former deputy president of the senate, says he will contest the 2023 governorship election in Enugu state.\nThe lawmaker representing Enugu west senatorial district announced his governorship ambition at a media briefing on Friday in Enugu.\nBut Ekweremadu described the zoning arrangement as a “treachery of politics”, adding that there is no such in the state.\nI was never a product of zoning, and if there was zoning, I won’t be in the senate five times.\n“The position I occupied as deputy president of senate was not out of zoning."
  },
  {
    "headline": "Ekweremadu announces governorship bid, says zoning is 'treachery of politics'",
    "summarized_story": "Ike Ekweremadu, former deputy president of the senate, says he will contest the 2023 governorship election in Enugu state.\nThe lawmaker representing Enugu west senatorial district announced his governorship ambition at a media briefing on Friday in Enugu.\nBut Ekweremadu described the zoning arrangement as a “treachery of politics”, adding that there is no such in the state.\nI was never a product of zoning, and if there was zoning, I won’t be in the senate five times.\n“The position I occupied as deputy president of senate was not out of zoning."
  },
  {
    "headline": "Ganduje: Nigeria’s challenges linked to faulty foundation laid by colonialists",
    "summarized_story": "Abdullahi Ganduje, governor of Kano, says the challenges of nation building in Nigeria are the result of the faulty foundation laid by colonialists.\nGanduje said this on Saturday at the launch of the N250 million Dr Abdullahi Ganduje Lecture Theatre and Award at the University of Ibadan.\nAccording to NAN, the Kano governor said the faulty foundation laid by the colonialists was done to actualise selfish interests rather than for Nigeria’s development.\n“The challenges of nation building in Nigeria are attributable to the very faulty foundation laid by the European colonial masters,” he saidAdvertisement“These were purely done to actualise their interests and not for any genuine development of the country.\nUnder these conditions, it was easy for prejudice and fear to thrive,“Nation-building is about building a common sense of purpose, sense of shared destiny and collective imagination of belonging."
  },
  {
    "headline": "Ganduje: Nigeria’s challenges linked to faulty foundation laid by colonialists",
    "summarized_story": "Abdullahi Ganduje, governor of Kano, says the challenges of nation building in Nigeria are the result of the faulty foundation laid by colonialists.\nGanduje said this on Saturday at the launch of the N250 million Dr Abdullahi Ganduje Lecture Theatre and Award at the University of Ibadan.\nAccording to NAN, the Kano governor said the faulty foundation laid by the colonialists was done to actualise selfish interests rather than for Nigeria’s development.\n“The challenges of nation building in Nigeria are attributable to the very faulty foundation laid by the European colonial masters,” he saidAdvertisement“These were purely done to actualise their interests and not for any genuine development of the country.\nUnder these conditions, it was easy for prejudice and fear to thrive,“Nation-building is about building a common sense of purpose, sense of shared destiny and collective imagination of belonging."
  },
  {
    "headline": "Saudi Arabia executes 81 convicts -- largest mass execution in its history",
    "summarized_story": "The kingdom of Saudi Arabia, on Saturday, announced that it had executed 81 convicted criminals.\nThe Saturday announcement is the largest mass execution conducted by the country in its modern history — more than the 67 executions reported in all of 2021 and 27 in 2020.\nPrior to Saturday, the largest mass execution in the country’s history since 1980 was in 2016 when 47 persons were killed.\nAdvertisementAccording to Saudi Press Agency (SPA), the 81 individuals were convicted of terrorism and capital crimes.\nOf the 81 people killed, 73 were Saudi citizens, seven were Yemeni and one was a Syrian national."
  },
  {
    "headline": "Nigerian government shuts down 6 illegal digital loan companies",
    "summarized_story": "According to Punch, digital lending platforms like GoCash, Okash, EasyCredit, Easi Moni, KashKash, and Speedy Choice were among the busted companies.\n“This information started quite a while ago.\nThese companies move around a lot, and it took us several months visiting each of their locations,” he said.\nWith no address, all these companies have are mobile apps that can be downloaded on both Google and Apple Stores.\nWe also understand that there are between 5 and 7 companies operating at the same location,” said Irukera, hinting at the agency’s ambition to cleanse the nation of all illegal digital lending practices."
  },
  {
    "headline": "Peace Ojemeh’s Haze Monkey finds a home in the $80 billion NFT industry",
    "summarized_story": "By the time she gathered enough knowledge, she reached out to her friend Alabo Briggs, 22, a blockchain engineer, about building their own NFT collection.\nThe next one is the animation series about Haze Monkey’s unique stories where holders and community members will be characters.\nBefore the countdown campaign started, Haze Monkey had gathered over 5,000 organic social followers and over 6,000 Discord community members from across the globe.\nBut Haze Monkey did about 20%.\nThough built by Africans in Africa, Haze Monkey has already positioned itself as a global brand."
  },
  {
    "headline": "Nigerian banks cut dollar spending limit for naira debit cards",
    "summarized_story": "Over the past month, at least 2 of Nigeria’s largest commercial banks have announced reduced limits on international transactions using naira debit cards to $20 (around ₦10,000) per month.\nThis comes as a longstanding scarcity of foreign exchange continues to bite Africa’s largest economy and biggest oil exporter, despite the recent surge in global energy prices.\nNigerians can use their naira-denominated debit cards to pay for transactions billed in US dollars online.\nFor every purchase, debits are made directly from their naira accounts at current exchange rates.\n“Remember you can use your UBA Dollar, Pounds or Euro Card for international POS, ATM, and web transactions,” UBA’s mail read."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Did you miss Apple’s first event of the year?\nI did, but I saw a recap and the best way to describe my reaction is..."
  },
  {
    "headline": "Protecting your mental health and privacy",
    "summarized_story": "Is mental health only related to mental illnesses?\nThis means that someone may have good mental health, no mental illness or be somewhere in between.\nHaving good mental health and no mental illness is at the top of the spectrum, while having poor mental health and a mental illness is at the bottom.\nWhile the people who are somewhere in the middle may have good mental health but a mental illness, they may also have poor mental health but no mental illness.\nConsequently, we must all strive to be at the top of the mental health spectrum which begins with prioritising your mental health as much as you do your physical and sexual health."
  },
  {
    "headline": "Nigeria has a new data protection enforcing body; here’s why you should care",
    "summarized_story": "Among other things, the statement credits the introduction of the Nigeria Data Protection Regulation (NDPR) and the National Digital Economy Policy and Strategy (NDEPS) with creating more awareness about data protection and resulting in the “datafication” of the Nigerian economy.\nAccording to the European Commission, “DPAs are independent public authorities that supervise, through investigative and corrective powers, the application of the data protection law.\nAccording to Suleiman’s statement, the NDPB would “support the process for the development of a primary legislation for data protection and privacy.”The race to a dedicated data protection and privacy law has taken several turns.\nFilled with false starts, the closest Nigeria has come to a law passed by the National Assembly was in 2018 with the Nigeria Data Protection Bill 2018.\nThe Bill provides a much more robust approach to data protection, providing for more categories of data than the NDPR, which appears to deal more with electronic data."
  },
  {
    "headline": "Building a tech startup with no-code tools",
    "summarized_story": "Building a startup with no-code toolsCross section of Ozi team.\nTwo University of Lagos (UNILAG) graduates — Adejumo Azeez and Israel Akpan — are building a tech startup without writing one line of code.\nAfter spending months looking for a developer to build their product, the duo resorted to no-code tools.\nBut even a startup built with no-code tools still has challenges.\nTheir startup, Ozi, can be described as a Communications as a Service product that Azeez and Akpan started in the university."
  },
  {
    "headline": "Nigerian Banks Ration Dollars as Regulator Signals Stopping Sales",
    "summarized_story": "Nigerian banks are cutting the dollar spending limits on local currency cards to free more resources to fund imports after the central bank signaled it will stop foreign-exchange sales to banks.\nFirst Bank of Nigeria Ltd. set the limits on its naira Mastercard and naira credit card to $50 monthly.\nThe regulator has struggled to fulfill its dollar obligations to portfolio investors since 2020 after oil prices collapsed.\nThe International Monetary Fund estimates that the central bank has a backlog of $1.7 billion in unmet demand to investors.\n“Whenever their foreign currency proceeds are received it comes through UBA and we are able to utilize those needed foreign currencies to meet the yearnings of importers,” he said."
  },
  {
    "headline": "I started as a receptionist – Zain Asher, CNN anchor",
    "summarized_story": "Zain Asher is a business and personal finance correspondent for CNN, where she appears across platforms covering the latest news on money and the economy.\nI am not saying there is anything wrong with being a receptionist but I did not want to remain a receptionist.\nBut I think that we need to see more women supporting women.\nMy mum went all the way to Nigeria not knowing if she was going to bury her husband or her son.\nI work at CNN, my brother is an actor, my sister is a doctor and my other brother is a successful entrepreneur."
  },
  {
    "headline": "Lt. General Yahaya, Chief of Army Staff answers 5 national security questions",
    "summarized_story": "This makes the goal of our military operations across the country so important – Every member of Nigeria’s 50 million families must be safe from external and internal aggression.\nHowever, national security and defense should not be the responsibility of only the military.\nRead also: 5 things that stand out from National Security summit reportQ: What are the new strategies in place to improve operational synergy among the Army, Navy and Air Force?cvA: Synergy is presently at its highest.\nPresident Reagan once said, “The greatest leader is not necessarily the one who does the greatest things.\nHe is the one that gets the people to do the greatest things.”Getting people to do the greatest things is what the Chief of Defense Staff, Gen. Lucky Irabor has done differently."
  },
  {
    "headline": "Obaseki swears in new commissioner, inaugurates Edo Sports Commission – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has sworn in a new commissioner and inaugurated the Edo State Sports Commission.\nAddressing the new Commissioner, Obaseki noted, “You are going to be overseeing Culture, and its related to Diaspora Affairs.\nObaseki continued: “Yusuf Ali, the Chairman of the Edo Sports Commission has excelled, both locally and internationally.\nHe further noted, “Edo State can start now to prepare for a global market in sports by identifying young talents in schools and catching them young.\nWe should excel in all areas of sports as we continue to invest in sports development.”Chairman of the Edo State Sports Commission, Yusuf Ali pledged that his team will do their best to transform sports in Edo."
  },
  {
    "headline": "Edo kicks off operation show your building plan, serves demand notice to defaulters – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government, at the weekend, commenced a recertification exercise for house owners in the Ugbor and Amagba communities within the Benin metropolis.\nAs a part of the exercise, property owners and developers within the affected areas are expected to provide their building plans upon demand at their houses and sites for clearance and recertification.\nOfficials of the Edo State Enforcement Team under the Ministry of Physical Planning, Urban and Regional Development, however, marked houses that could not provide evidence of their building plans and served them contravention/demand notices, either by hand or by pasting them on the buildings.\nCommissioner for Physical Planning, Urban and Regional Development, Isoken Omo, said the exercise is in line with the government’s vision of actualising the 30-year development plan.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Accident claims 12 on Ilorin-Ogbomoso Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestILORIN – Twelve people are feared dead in a road accident which occurred on Ilorin-Ogbomoso Road on Saturday.\nMr Jonathan Owoade, Kwara Sector Commander of the Federal Road Safety Corps, gave the figure to newsmen in Ilorin.\nHe blamed the accident on route violation, speed limit violation and loss of control.\nOwoade advised motorists to adhere to road safety rules and regulations and be in the right frame of mind.\n“We will ensure that, on our own part, we continue to enlighten motorists on road safety precautions."
  },
  {
    "headline": "Obaseki tasks Edo Sports Commission to groom 10,000 athletes – Nigerian Observer",
    "summarized_story": "Godwin Obaseki of Edo has charged the State Sports Commission Board to develop 10,000 athletes in different fields of sports in the next five years.\nThe News Agency of Nigeria (NAN) reports that the governor gave the charge while inaugurating the Yusuf Alli-led Sports Commission on Saturday in Benin.\nWe have to catch them young, we have to rethink sports with all the resources we have.\n“We just have to catch them young whether it is in swimming, tennis, basketball, table tennis, handball or football.\nObaseki also urged the commission to tap into funding from the private sector to develop infrastructure and drive sporting activities."
  },
  {
    "headline": "AN GUDU NA A TSIRA BA: Ƴan bindiga sun yi garkuwa da mutane 11 a Shimfiɗa, jihar Katsina",
    "summarized_story": ""
  },
  {
    "headline": "TSUMAGIYAR KAN HANYA: ‘Yan Najeriya miliyan 19.4 za su fuskanci yunwa da barazanar rashin abinci a cikin Agusta, 2022 -FAO",
    "summarized_story": ""
  },
  {
    "headline": "GABA DA GABAN TA: Kotu ta umarci a maida daraktocin Hukumar NFIU da aka kora saboda sun binciki sirrin kuɗaɗen Tinubu da Atiku",
    "summarized_story": ""
  },
  {
    "headline": "SUN YI TUTSU: Majalisar Dattawa ta ƙi ƙara yi wa Dokar Zaɓe Kwaskwarima, kamar yadda Buhari ya nemi su yi",
    "summarized_story": ""
  },
  {
    "headline": "Ko an Ƙi ko an So ni ne dai gwamnan Ebonyi, za mu basu kunya a kotun ƙoli – Umahi",
    "summarized_story": "Gwamnan jihar Ebonyi, David Umahi wanda Kotu ta tsige ya bayyana cewa Alkalin kotun da gangar ya yanke hukuncin tsige amma kotun koli zai bashi kunya da wandanda suke yi masa bita da kulli.\nYadda kotu ta tsige gwamna UmahiBabbar Kotun Tarayya ta Abuja ta tsige Gwamnan David Umahi na Jihar Ebonyi shi da mataimakin sa, saboda komawa APC bayan sun ci zaɓe a ƙarƙashin PDP.\nJam’iyyar PDP ta kai ƙarar su, bisa roƙo cewa sun tafi da haƙƙin jam’iyyar PDP, wadda ta ɗauki nauyi da kuma zaɓen su.\nMai Shari’a ya ce Umahi da Mataimakin sa na iya komawa APC, amma ba ɗauke da haƙƙin PDP ba.\n“Kuri’a a zaɓen Najeriya ta jam’iyya ce, ba ta ɗan takara ba ce.” Inji Mai Shari’a Ekwo."
  },
  {
    "headline": "‘Prepare Your Handover Notes:’ Busuyi Ayowole, PRP guber candidate tells Oyetola",
    "summarized_story": "By Sunday Oguntuyi, OsogboAhead of July 16 governorship election in Osun State, the People’s Redemption Party (PRP) has unanimously adopted Engr.\nBusuyi Ayowole as its candidate.\nThe decision was made on Saturday at the end of the party’s primary election that took place at the NUJ Press Centre, along Iwo/Ibadan road, Osogbo.\nThe primary election was witnessed by party’s official from the national headquarters, Abuja.\nSpeaking shortly after his announcement, the candidate, Busuyi Ayowole, the incumbent governor should start preparing his handover notes because his party is well positioned to take over the mantle of leadership in the state."
  },
  {
    "headline": "Electoral Act 2022: Constitutionality of section 84(12) as argued by Buhari",
    "summarized_story": "The Amended Electoral Bill introduced some innovations, particularly the reception of limited e-voting and holistic e-transmission of electoral results.\nThe major aspect of our electoral stages where manipulations graduate to infamy is at the stage of collation and counting of electoral results.\nAll kinds of malfeasance including criminal input of strange figures in the electoral result sheets usually occur at this stage.\nA careful perusal of the Act reveals a sinister motive meant to pave way to the “elected office holders” to have an undue advantage over and above every other political office aspirant in Nigeria.\nIt provides and I quote “If any other law is inconsistent with the provision of this constitution, this constitution shall prevail, and that other law shall, to the extent of the inconsistency, be void”."
  },
  {
    "headline": "2023: Dele Momodu warns RCCG, Adeboye against backing Osinbajo",
    "summarized_story": "Presidential hopeful and Ovation Magazine publisher, Dele Momodu, has warned the Redeemed Christian Church of God (RCCG) and its general overseer, Pastor Enoch Adeboye, against supporting Nigeria’s vice president, Yemi Osinbajo for 2023 presidency.\nTo the best of my knowledge, Professor Osinbajo is not the only member of the church contesting the Presidential election.\nAccording to him, he’s also a member of the RCCG with his ambition for the 2023 Presidency already public.\nAsiwaju, her husband, is a frontline Presidential aspirant on the platform of APC, just like his godson, the Vice President.\nI’m also the only member of the RCCG aspiring on the platform of PDP, as far as I know."
  },
  {
    "headline": "Osun 2022: Court stops PDP, INEC from recognising Davido’s uncle, Adeleke as candidate",
    "summarized_story": "An Osun State High Court, sitting in Ijebu-Jesa, has ordered the People’s Democratic Party (PDP) and Independent National Electoral Commission (INEC) not to recognise Senator Ademola Adeleke, an uncle to musician, David Adeleke, alias Davido, as the party candidate for July 16 governorship election in the state.\nThe court also ordered that the governorship primary election be conducted by the 215 wards executive in line with its earlier ruling on the validity of delegates qualified to vote on the exercise.\nPresided over by Justice Adeyinka Aderigbigbe the court had on March 3, 2022, in an exparte motion brought before it by one Adedokun Ademola and 29 others ruled that only the 215 wards executive, in line with the judgement of another state High Court delivered on November 22, 2021 were qualified to vote in the exercise.\nIt, therefore, urged the INEC and PDP to recognise Dotun Babayemi, who emerged in a parallel primary, as the valid candidate of the party pending the determination of the substantive suit before it.\nJustice Aderibigbe, in the order of Mandatory Interim Injunction, averred that delegates that voted for Babayemi did so in compliance with the Court judgement of 22nd November 2021 and Order of Mandatory Interim Injunction of 3rd March 2022, affirming the 215 Wards Executive Officers elected then as the authentic and authorized Ward Executive Officers permitted to vote as delegates at the party governorship primaries."
  },
  {
    "headline": "NURTW Crisis: Sanwo-Olu Denies Appointing MC Oluomo As MD, Transport Park",
    "summarized_story": "Lagos State Governor, Mr. Babajide Sanwo-Olu on Friday denied rumour making the rounds that he has appointed the embattled chairman of the National Union of Road Transport Workers (NURTW), Lagos State branch, Musliu Akinsanya popularly known as MC Oluomo as the General Manager of the state’s Transportation Parks and Garages Management Committee.\nFollowing the crisis rocking the National Union of Road Transport Workers (NURTW) in Lagos State, the state government had on Thursday night suspended their activities in the parks and garages across the state.\nADVERTISEMENTOmotoso said, ” The state government has been closely watching events in the National Union of Road Transport Workers Union (NURTW).\n“After considering the provisions of the law, the government hereby suspends the activities of NURTW, which must cease to operate in all parks and garages in Lagos State.\n‘The government will set up a Committee to immediately take control of the parks and garages."
  },
  {
    "headline": "Oyetola Inaugurates Osun House Of Assembly Service Commission",
    "summarized_story": "Osun State Governor, Adegboyega Oyetola has inaugurated Osun House of Assembly Service Commission reiterating his commitment to strengthening the existing bond of unity among the three arms of government in the state.\nAccording to him, the result of this is that the government is able to offer exceptional service delivery to the people without undue distraction.\nThe Governor tasked the newly inaugurated board members to discharge their duties with the fear of God, integrity and high sense of diligence as the state is expectant of much coming from them.\nSpeaking on behalf of other members, the Chairman of the Board, Hon.\nAbiodun Awolola, promised that they would serve the state to the best of their abilities and wisdom."
  },
  {
    "headline": "Convention: INEC’s Stance Proves APC’s Ineligibility – PDP",
    "summarized_story": "The Peoples Democratic Party (PDP) yesterday said the non-recognition of the activities of the All Progressives Congress (APC) by the Independent National Electoral Commission (INEC) showed that the APC lacks the legitimacy and statutory requisites to participate in the 2023 general elections.\nThe PDP further said INEC’s refusal to honour APC’s invitation to attend its National Executive Committee (NEC) meeting as well as its disapproval of APC’s March 26 national convention proved that the APC is a Special Purpose Vehicle (SPV) in liquidation, preparatory to winding up, that cannot legally produce candidates for the elections.\nADVERTISEMENT“Furthermore, INEC’s reference to the failure of the APC to give the required 21-day notice for its national convention confirms the invalidity and unconstitutionality of any national convention conducted by the APC’s illegal Caretaker/Extraordinary Convention Planning Committee (CECPC).\n“As it stands today, regardless of the boldface escapist excuses, the Sword of Damocles hangs precariously on the status of the contraption called CECPC and the APC itself.\nThis signals an existential threat to the soulless, precipice-bound bunch of pretenders masquerading as a political party."
  },
  {
    "headline": "MOSIEND Calls For Scrapping Of Niger Delta Ministry",
    "summarized_story": "The Movement for the Survival of Izon Ethnic Nationality in the Niger Delta (MOSIEND), has called for the scrapping of the Ministry of Niger Delta Affairs, saying that the existence of the ministry has not impacted positively to the development of the Niger Delta region.\nWest particularly accused the Minister of Niger Delta Affairs, Senator Godswill Akpabio, of playing politics with the development of the region, through the ministry.\nHe said: “We want the Ministry of Niger Delta to be scrapped.\nIt is a democratic representation of the people of Niger Delta.\nThere is the need to scrap the Ministry of Niger Delta and leave NDDC to function optimally."
  },
  {
    "headline": "Vote Out Corrupt Leaders In 2023, Foundation Tells Nigerians",
    "summarized_story": "As the 2023 election draws closer, a non-profit organisation, Akin Fadeyi Foundation (AFF) has urged Nigerians to vote out corrupt leaders to halt bad governance in the country.\nThe Foundation also urged Nigerians to vote for credible leaders and shun corrupt leaders or politicians with corruption cases.\nSpeaking during a media briefing in Abuja yesterday, titled: “Put on Your Thinking Cap” the founder, AFF, Mr Akin Fadeyi also urged Nigerians to shun accidental democrats.\nFadeyi stressed that the Foundation will remain partisan, adding that the election sensitization “Put on Your Thinking Cap” will not be hijacked by politicians.\nOnyegbule lamented that the nation keeps going for a lesser end, corrupt and incompetent leaders."
  },
  {
    "headline": "3rd Russian general Kolesnikov dies in Ukraine as invaders suffer heavy losses",
    "summarized_story": "A third Russian army general, Major General Andriy Kolesnikov, has been killed in Ukraine, one of the major losses suffered by the Russian invaders.\nLast week, the 41st Combined Arms Army’s deputy commander, Maj. Gen. Andrei Sukhovetsky was also killed.\nThe Western official noted for context that three Russian general staff officers were killed during the whole Syrian conflict.\nOther two generals killed in Ukraine were Maj. Gen. Vitaly Gerasimov and Maj. Gen. Andrei Sukhovetsky.\nZelensky added that groups of Russian troops were surrendering to Ukrainian forces, but that Russia is now recruiting fighters, reservists, conscripts, and mercenaries to “outnumber” Ukrainian forces."
  },
  {
    "headline": "Adesua, Daniel set to unveil nominees for 8th edition of AMVCAs",
    "summarized_story": "On Saturday, 19 March nominees for the eight edition of the Africa Magic Viewers’ Choice Awards (AMVCAs) will be unveiled in a special broadcast on all Africa Magic channels on DStv and GOtv from 9pm WAT.\nNollywood actors, Adesua Etomi-Wellington and Daniel Etim-Effiong, will announce the nominees in all 33 categories for this edition.\nFor this edition, Africa Magic announced a new category for Best Online Social Content Creator and the return of the Best Africa Magic Original Drama Series and Best Africa Magic Original Comedy Series bringing the total number of categories to 33.\nSome of the other categories include Best Movie in Southern, East and West Africa, Best Director and Best Cinematographer.\nThe full list of nominees will be published on the Africa Magic website following the announcement."
  },
  {
    "headline": "APC crisis: Buhari breaks silence, insists convention holds March 26",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), has broken his silence over the crisis rocking the All Progressives Congress.\nIn a statement by his Senior Special Assistant on Media, Garba Shehu, the president warned the leaders and members of APC to desist from “name-calling and backstabbing”.\nHe reiterated that the party’s national convention would hold on March 26.\nThe president urged APC members to “remain steadfast and maintain unity if the party is to continue in the path of victory and its dominance at all levels throughout the country”."
  },
  {
    "headline": "We’re Looking For Parents Of Baby Abducted By Dispatch Rider – Police",
    "summarized_story": "The Lagos State Police Command says it is looking for the parents of a baby in a viral video, which shows a yet-to-be-identified dispatch rider with the child in his courier box.\nThe command said its attention was drawn to the video, which went viral on social media earlier today.\n“Notwithstanding that the incident was not reported, the Commissioner of Police, Abiodun Alabi, has directed that efforts should be intensified to locate the whereabouts of the alleged dispatch rider and the parents or guardians of the child to enable the police to investigate the incident.”According to online reports, the incident happened in the Sangotedo area of Lagos on Friday, March 11.\nIn the viral video, the rider was seen being assaulted by a mob, who later dragged him to a police station.\nOne of the persons in the background was heard saying, “This is the child that was abducted.”"
  },
  {
    "headline": "Court Okays Process To ‘Jail’ AMCON MD Over NICON Assets",
    "summarized_story": "The Managing Director, Lawal, and two Executive Directors, Eberechukwu Uneze and Aminu Ismail, are the key officers who have been affected.\nIbrahim and his companies had claimed that AMCON and other defendants in a suit pending before the court had flouted orders previously made.\nNICON Investment Limited, NICON Insurance Limited, and NICON Reinsurance Corporation Plc are the firms suing Ibrahim.\n“The having considered that the said undertaking was made by consent of the defendants and is not appealable except with leave of court.\n“And the court having considered, where AMCON is alleged to have flouted court’s order, it is the natural persons that take decisions for it that should be cited for contempt."
  },
  {
    "headline": "PHOTO: Abacha’s Daughter Shows Love To Buni In Troubled Times",
    "summarized_story": "Gumsu Abacha, one of the wives of Governor Mai Mala Buni of Yobe State, has shared a picture of the two of them together.\nIn the picture, the woman who described herself as the daughter of a four-star General, smiled happily as her hubby reciprocated same.\nBuni is currently abroad on medical grounds, but Governor Nasir El-Rufai of Kaduna had said he would never return as APC Chairman.\nGovernor Rotimi Akeredolu of Ondo State also said those supporting Buni are “Yahoo Yahoo governors”.\nIn 2021, Buni got married to Gumsu, whose father was Head of State between 1993 and 1998."
  },
  {
    "headline": "Breaking: Ronaldo fires hat-trick as Manchester United down Tottenham in Premier League clash",
    "summarized_story": "Cristiano Ronaldo scored his first Manchester United hat-trick in 14 years as Tottenham were defeated in a thrilling encounter at Old Trafford.\nThe brilliant Portuguese put United ahead twice before heading home the winner from Alex Telles’ corner nine minutes from time, the 807th goal of his career.\nTottenham twice responded to Ronaldo’s efforts, through a Harry Kane penalty and a Harry Maguire own goal.\nBut it was Ronaldo who had the final word, completing his first United treble since January 2008, in a 6-0 win over Newcastle.\nThe result was a major confidence boost for United before Tuesday’s Champions League last-16 second leg against Atletico Madrid."
  },
  {
    "headline": "Ukraine invasion: Ex-Russian minister reveals what will soon happen to Putin",
    "summarized_story": "A former Russian minister has claimed that Vladimir Putin could be ousted by an internal Kremlin coup.\nAndrei Kozyrev, who was Boris Yeltsin’s leading diplomat, believes key figures in the Kremlin may be plotting the Russian President’s downfall.\nIt comes as Russian troops edge towards Ukraine’s capital Kyiv, with reports overnight stating the bulk of Russian forces are now just 25km from the city following a night of intense fighting.\nTo understand why the invasion was rational for Putin, we have to step into his shoes.”Mr Kozyrev, who now lives in Miami, believes Putin is not insane, but “simply wrong and immoral”.\nIt comes as reports suggested Russian forces made progress overnight from north-east Ukraine in their fight to reach the capital Kyiv."
  },
  {
    "headline": "Chelsea: Respite as Roman Abramovich reaches fresh agreement with UK government",
    "summarized_story": "After so much uncertainty about the club’s fate, Chelsea FC fans can rest easy as Roman Abramovich has reportedly struck a deal with the UK Government to sell the club.\nThe potential buyer also has to agree to these terms, this deal will need authorisation from Prime Minister Boris Johnson himself.\nThere is a set deadline for next week’s Tuesday as Abramovich is widely expecting the potential buyer to come forward and complete a quick sale.\nThere is an alleged £2 billion offer from the Todd Boehly-led group and another £2.5 billion offer that doesn’t have a disclosed buyer.\nIt is believed that an acceptable offer would be of around £3 billion in order to consider it properly."
  },
  {
    "headline": "Another Batch Of Nigerians Fleeing Ukraine Arrive In Abuja",
    "summarized_story": "At least 300 Nigerians fleeing the crisis in Ukraine have been successfully evacuated by the Federal Government.\nThis is the sixth batch of returnees in the ongoing evacuation approved by President Muhammadu Buhari.\nThe students held a protest last week, calling on the Federal government to help evacuate them.\nMany Nigerian students stuck in the city have called for help in recent days.\nThe returnees were undergoing screening, documentation, and COVID-19 tests as of the time of this reporting,"
  },
  {
    "headline": "‘No Food To Eat, Extreme Cold’: Nigerians Stuck In Kherson Call For Help",
    "summarized_story": "﻿As the Russian invasion of Ukraine continues, about 23 Nigerian students at Kherson State Maritime Academy are calling for help from the Federal Government.\nRussian forces seized the port city of Kherson, which has a population of 290,000 people, on March 3 following a three-day siege.\nThe students want the government to urge Russian authorities to declare a ceasefire so they can be safely evacuated from the city.\nFake ReferendumMeanwhile, Ukrainian officials on Saturday accused Russia of planning a fake referendum on creating a pro-Moscow “people’s republic” in Kherson.\n“Russians now desperately try to organize a sham ‘referendum’ for a fake ‘people’s republic’ in Kherson,” Foreign Minister Dmytro Kuleba tweeted."
  },
  {
    "headline": "President Buhari, Silent On Buni’s Status, Calls For Order In APC",
    "summarized_story": "President Muhammadu Buhari on Saturday failed to state his position on the status of Governor Mai Mala Buni in the All Progressives Congress even as he called for order in the party.\nGovernor Buni’s position as the Chairman of the party’s Caretaker Extraordinary Convention Planning Committee has come under scrutiny in recent days.\nBello’s chairmanship is backed by the President, Governor Nasir El-Rufai of Kaduna has said.\n”They failed in 16 years in power and a failure as opposition,” the President said, as quoted in the statement.\n”But parties splintered by competing egos destine themselves to the worst possible fate,” the President warned."
  },
  {
    "headline": "Wike Vows PDP Will Reclaim Ebonyi Governorship Seat",
    "summarized_story": "﻿Governor Nyesom Wike of Rivers State on Saturday said the Peoples Democratic Party will stop at nothing to reclaim the Ebonyi governorship seat following the defection of the Governor, David Umahi to the All Progressives Congress.\nGovernor Wike said despite the initial comments by Governor Umahi to disparage the judiciary, the party will not be intimidated to chicken out of the legal battle, vowing to support the party to fight it out to the Supreme Court.\nEFCC will come, he will say let me join them so EFCC will not go against me.\nYou carry the vote of another party and join another party.\nHowever, the Governor has applied for a stay of execution and approached the Court of Appeal for a review."
  },
  {
    "headline": "Ronaldo Scores Hat-Trick As Man Utd Beat Tottenham",
    "summarized_story": "Victory lifts United back into fourth, although they are just two points ahead of Arsenal who have four games in hand.\nA fifth defeat in eight league games is another blow to Tottenham’s hopes of a top-four finish as they remain seventh, now five points behind United.\nIt took just 12 minutes for Ronaldo to make his mark with a stunning strike into the top corner from outside the box.\nHarry Kane smashed home the resulting spot-kick to continue his fine form for his sixth goal in as many games.\nWithin three minutes, though, United were back in front thanks to a landmark goal for Ronaldo."
  },
  {
    "headline": "Buhari warns APC leaders against name-calling, distractions over convention -",
    "summarized_story": "President Muhammadu Buhari on Saturday issued a warning to leaders of the All Progressives Congress (APC) against “name-calling and distractions” ahead of the party’s national convention.\nThe president’s warning was contained in a statement issued on Saturday by Garba Shehu, presidential spokesman.\nIt would be recalled that over the past days, governors and other stakeholders in the APC have engaged in back-and-forth over the arrangements for the party’s national convention scheduled to hold on March 26.\nIn the statement, Buhari said distractions of any sort in relation to the party’s activities must stop.\n“There must be no more distractions ahead of the convention to choose new leaders,” the President said."
  },
  {
    "headline": "President Muhammadu Buhari asks for Order in The APC -",
    "summarized_story": "President Muhammadu Buhari warns the leaders (and membership) of the All Progressives Party (APC) to desist from name-calling and backstabbing ahead of the oncoming March 26 Convention, remain steadfast and maintain its unity if the party is to continue in the path of victory and its dominance at all levels throughout the country.\nPresident Buhari asks the members to look at the once-powerful, “main opposition” Peoples Democratic Party (PDP) now enfeebled and adrift and learn lessons in disunity, mismanagement and corruption.\n”But parties splintered by competing egos destine themselves to the worst possible fate,” the President warned.\nIt is important to ask what benefits the poor are getting during the period of intense negative coverage.\nThat is for the general election."
  },
  {
    "headline": "INEC letter: Bello's CECPC makes u-turn, says Buni still in charge -",
    "summarized_story": "Since the inception of this CECPC on June 25, 2020, whenever the chairman is not around and Governor Sani Bello is around, he acts on behalf of all as the Chairman.\n“So, one has to leave for the other, whichever, he has transmitted a letter and Governor Sani Bello has been acting appropriately.\n“As part of efforts towards the hitch-free conduct of the March 26th National Convention of the All Progressives Congress (APC), the Caretaker/Extraordinary Convention Planning Committee (CECPC) stepped up preparations this week.\nThe purpose is to ensure speedy execution of the various activities leading to the National Convention on March 26, 2022.\nHe assured that the March 26th National Convention was on course and sacrosanct."
  },
  {
    "headline": "Updated: APC denies writing INEC on emergency NEC meeting -",
    "summarized_story": "The All Progressives Congress, APC has described as figment of imagination, the purported letter written to the party by the Independent National Electoral Commission (INEC) on the need to give the Commission a 21-day notice for its national convention slated for March 26.\nEarlier, there were media reports that the commission had rejected a letter allegedly written by the APC Caretaker Committee requesting it to monitor its emergency NEC meeting.\nIn the latest development, the ruling party said neither the new acting chairman nor the secretary wrote the electoral umpire."
  },
  {
    "headline": "Premier League Disqualifies Abramovich from Running Chelsea",
    "summarized_story": "The Premier League banned Roman Abramovich from running Chelsea on Saturday after the club owner was sanctioned by the British government over Russia’s war on Ukraine.\n“The board’s decision does not impact on the club’s ability to train and play its fixtures,” the Premier League said in a statement.\nBowing to pressure against his ongoing ownership, Abramovich had already announced last week before being sanctioned that he would put Chelsea up for sale.\nAbramovich originally hoped to divert the proceeds into a new foundation for the victims of the war in Ukraine, which he is yet to condemn Putin for launching.\nAbramovich’s disqualification by the Premier League halts the reign of the competition’s first billionaire foreign owner, whose fortune turned Chelsea into one of the biggest-spending clubs in Europe and one of the game’s most successful."
  },
  {
    "headline": "Saudi Arabia Says It Has Executed 81 Convicts in Single Day",
    "summarized_story": "Saudi Arabia on Saturday executed 81 people convicted of a variety of crimes, including killings and belonging to militant groups, in the largest mass execution conducted by the kingdom in its modern history.\nThe total number of those put to death surpassed that of the January 1980 mass execution of those convicted of the seizure of the Grand Mosque in Mecca, which saw 63 people beheaded.\n“The kingdom will continue to take a strict and unwavering stance against terrorism and extremist ideologies that threaten the stability of the entire world,” the report added.\nThe kingdom’s last mass execution came in January 2016, when the kingdom executed 47 people, including a prominent opposition Shiite cleric who had rallied demonstrations in the kingdom.\nIn 2019, the kingdom beheaded 37 Saudi citizens, most of them minority Shiites, in a mass execution across the country for alleged terrorism-related crimes."
  },
  {
    "headline": "Justice for Bamise: Driver Remanded over Passenger’s Death",
    "summarized_story": "A Yaba Magistrate Court in Lagos has remanded for 30 days a Bus Rapid Transit’s driver, Mr Andrew Nice who is being investigated for the death of his passenger, Oluwabamise Ayanwale.\nMagistrate Omobola Salawu ordered his remand following an application by the police.\nMr Nice will remain in custody while police continues with investigation of the case.\nBamise was found dead last Monday on Carter Bridge, Lagos Island, nine days after she was declared missing after she boarded Nice vehicle…"
  },
  {
    "headline": "As Cairo Transforms, Egyptians Fight to Save Their Trees",
    "summarized_story": "So he led a group of residents in “a peaceful demonstration to protect the trees” of his Cairo neighborhood.\nAn official at Egypt’s Ministry of Environment did not respond to a request for comment on the loss of urban green spaces.\nIn recent years, grassroots groups have sprung up in different areas of Cairo to try to protect the city’s urban identity.\nThe law protects green spaces, designating trees as public property, he added.\nRim Hamdy, a botany professor at Cairo University, said some types of trees could vanish from city streets."
  },
  {
    "headline": "US to Partner Nigeria to Stop Gas Flaring By Conversion to Ammonia",
    "summarized_story": "Silva explained that Nigeria already has a transition plan which is predicated on a multi-track approach to developing energy resources.\nOne of those is a focused development of the country’s gas resources during which period a diversified economy would be built around technology and other energy sources.\nDiscussions on the subject were taken from different perspectives, including zeroing-in on gas potentials and the implication of continued gas flaring and reinjection.\nThe point of convergence is the responsible monetization of Nigerian’s gas resources which the American counterparts were in agreement.\nThis the US team suggested would be a good way for Nigeria to utilize its abundant Natural gas resources of over 200 trillion cubic feet (TCF)."
  }
]