[
  {
    "headline": "I will curse politicians frustrating Yoruba nation –Gani Adams",
    "summarized_story": "Aareonakakanfo of Yorubaland, Gani Adams, has threatened to place a curse on politicians infiltrating and frustrating the struggle for Yoruba nation.\nAdams said some prominent politicians in the South-West have infiltrated the struggle for the actualisation of the Yoruba nation.\nHe pointed fingers at some prominent politicians, including someone he referred to as “our senior brother in Lagos”.\nHe accused the prominent politicians of betraying the Yoruba cause for “true liberation”.\nBut Adams said the disagreement between those agitating for the actualisation of the Yoruba nation is caused by “agents that are being paid to frustrate the liberation movement”."
  },
  {
    "headline": "Burning INEC offices, police stations won’t stop 2023 elections —Garba Shehu",
    "summarized_story": "Garba Shehu, Senior Special Assistant to the President on Media and Publicity, says his principal, Major General Muhammadu Buhari (retd.\n), is not interested in running for a third-term in 2023.\nShehu also said the burning of police stations and offices of the Independent National Electoral Commission won’t stop the 2023 general elections.\nHe said, “It is very disturbing that INEC and police offices are being set ablaze in parts of the country by anarchists.\n“Does anybody want to stop election in 2023?"
  },
  {
    "headline": "Garba Shehu hints why Buhari was absent from late COAS Attahiru’s funeral",
    "summarized_story": "Kindly Share This Story:The Senior Special Assistant to the President on Media and Publicity, Garba Shehu has finally revealed why President Muhammadu Buhari was absent from the funeral of late Chief of Army Staff, Ibrahim Attahiru.\nPresident Buhari, who is also the commander-in-chief of the armed forces, was absent when Attahiru and the army officers including three generals were laid to rest in Abuja a day after their passing.\nBecause he doesn’t like this idea of closing roads, security men molesting people on the road for the president to have the right of way.\nYou would recall that Attahiru died after a military plane crashed last week Friday near the Kaduna International Airport.\nThe military plane was conveying 11 military officers including the Chief of Army Staff, Lt. Gen Ibrahim Attahiru."
  },
  {
    "headline": "Covid-19: There's need for proactive actions",
    "summarized_story": "Femi Gbajabiamila on Wednesday said the outbreak of COVID-19 pandemic has thrown up a challenge for Nigeria to be proactive in its social, health and economic affairs.\nGbajabiamila’s call was contained in his remarks at the public presentation of a book by the National Institute of Legislative and Democratic Studies, NILDS titled, “A political economy of pandemics & consequences of COVID-19 for Nigeria”.\nThis is our new reality, and we need to plan government in recognition of this.\n”In the thick of the pandemic, the National Assembly reconvened to consider and pass the revised 2020 budget and approve other financial measures of Mr. President.\nThe National Assembly remained involved in governance processes not only in considering and approving executive proposals but more importantly in providing oversight."
  },
  {
    "headline": "Whistleblowing: Enlist in fight against financial crimes, EFCC urges NYSC members",
    "summarized_story": "Kindly Share This Story:By Luminous Jannamike, AbujaThe Economic and Financial Crimes Commission, EFCC has urged National Youth Service Corps, NYSC members across the country to embrace whistle-blowing as a potent means of enlisting in the fight against economic and financial crimes, including corruption.\n“The Commission realizes that enduring success in the fight against economic crime, including corruption can only be achieved when stakeholders embrace this important fight.\n“Apart from the fact that they (youths) are considered as the leaders of tomorrow, most economic crimes, especially cybercrime are committed by young people.\nRather, they should actually be the foot soldiers leading the mass rout of corruption and economic crimes out of our land,” he said.\nAdd your voice to mine, because the fight against economic and financial crimes involves you and me; while I play my part, you will play yours,” Bawa said."
  },
  {
    "headline": "Yahaya Bello sends delegation to family of Ill-fated Airforce Plane pilot",
    "summarized_story": "Yahaya Bello of Kogi on Wednesday sent a delegation to condole with the families of Flt.- Lt Alfred Olufade, the pilot of the ill-fated Airforce plane which crashed in Kaduna.\nOlufade, Pilot of the Airforce plane that crashed died alongside Former Chief of Army Staff, alt.-Gen. Ibrahim Atahiru and other officers.\nHe also urged the family and his widow to take consolation in the fact that it was the will of God.\nSpeaking on behalf of the Olufade’s family, George, the father of the deceased appreciated the governor for sending a delegation.\nOpeyemi Adesina who also died in the crash, Bello also urged his widow and family to stay strong."
  },
  {
    "headline": "NYSC germane to Nigeria’s unity, still relevant – DG",
    "summarized_story": "Following recent calls for the discontinuation of the National Youth Service Corps, the Director-General of NYSC, Brigadier General Shuaibu Ibrahim has said the relevance of the scheme in the integration and National cohesion of the country cannot be underestimated.\nHe said the National Youth Service Corps has been serving as a tool for the socio-economic development of the country through the deployment of Corps Members to States outside their States of origin, where they contribute their quota by making positive impact in the lives of their host communities through the execution of different laudable projects.\nVanguard reports that a lawmaker in the House of Representatives, Awaji-Inombek Abiante had earlier sponsored a bill to scrap the scheme following the spike of insecurity in the country among other reasons.\nReacting, the DG in a statement Wednesday, emphasised the importance of the scheme amid all odds insisting it is sine qua non to the peace and tranquility of the country."
  },
  {
    "headline": "'Politicians paying to hijack Yoruba nation struggle'",
    "summarized_story": "Aare Onakakanfo of Yorubaland, Iba Gani Adams says well-known politicians in the South-West have infiltrated the struggle for the actualisation of Yoruba nation.\nAare Adams insists the agitation for O’odua Republic is a legitimate right of all Yoruba sons and daughters.\nThe leader regretted that some of the protagonists of the O’odua Republic are agents being paid to frustrate the liberation movement.\n“Unfolding events in the last few weeks have shown that some prominent politicians have hijacked the struggle for the actualisation of O’odua Republic.\n“For those who have been infiltrating the struggle, I will curse them for seven days."
  },
  {
    "headline": "Constitution review: Gov. El-Rufai suggests devolution of powers to reduce burden on FG",
    "summarized_story": "Governor Nasir el-Rufai of Kaduna State has stressed that devolution of powers is necessary to reduce the overburdens the federal government faces with many responsibilities it cannot efficiently handle.\nHe suggested the need to have federal, state and community police, with each granted sufficient powers to make them effective in securing the areas assigned to them and cooperating closely with each other.\nHe noted that it is an anomaly to have a National Judicial Council appointing high court judges for states, suggesting that this should be the responsibility of State Judicial Councils.\nHe suggested that judges of State High Courts, Sharia Courts of Appeal and Customary Courts of Appeal should be nominated by the State Judicial Council, subject to confirmation by the House of Assembly.\nel-Rufai further said that states should also be enabled to establish State Courts of Appeal, similar to what it used to have at the regional level under the 1963 Republican Constitution."
  },
  {
    "headline": "Constitutional review: Senate will tackle challenges facing Nigeria",
    "summarized_story": "The Senate has promised to carefully tackle every challenge confronting Nigeria through constitutional amendment exercise.\n“The review is to improve on the constitution to suit the demands of Nigerians to suit the demands of our time and ensuring that they do not suffer the same fate.\nf we get these items through constitutional processes of alteration successfully then our Constitutional Democracy will be set on the right pedestal, and ultimately, Nigeria will take its pride of place among the enviable constitutional democracies in the world.”The Deputy Senate President also stated that the focus of the Committee is how to manage the review exercise in a fair, inclusive, credible, and transparent manner.\n“We must look critically at the 1999 Constitution and as the chairman of North Central Governors Forum, I have no doubt that justice will be given to our zone”.\nFurthermore, a minute silent was observed in honour of people killed as a result of insecurity in the zone."
  },
  {
    "headline": "Herdsmen: Masari disagrees with Buhari, declares support for ban on open grazing",
    "summarized_story": "Katsina State Governor, Aminu Bello Masari, has kicked against the stance of President Muhammadu Buhari on the ban on open grazing in Nigeria.\nI don’t support that we should continue with the open grazing.’’ He said.\nRecall that on 11 May 2021, the 17 Southern Governor’s met in Asaba, Delta State, and unanimously prohibited open grazing in Southern Nigeria.\nHowever, President Muhammad Buhari has been receiving knocks from Nigerians for kicking against the stance of the southern Nigeria leaders to ban open grazing in the region.\nThe president, while reacting to the development, dismissed the governors’ declaration as having questionable ‘Constitutional legality’."
  },
  {
    "headline": "Insecurity: Gunmen have taken over my constituency",
    "summarized_story": "Member representing Makurdi North Constituency in the Benue State House of Assembly Hon.\nTerfa Kudi, has said his constituents are currently starving, because of growing insecurity in the state.\nThe lawmaker expressed fears that if serious security measures were not taken to curtail the attacks, people may be attacked even in Makurdi town.\n“The assailants are almost taking over the entire Makurdi town since they can successfully attack communities at the outskirts of Makurdi.\n“As I speak to you, the attackers have sacked the entire four council wards that make up Makurdi North,” he said."
  },
  {
    "headline": "Nigerian man, 23, sentenced to death for drug trafficking in Vietnam",
    "summarized_story": "A 23-year-old Nigerian man was sentenced to death on Tuesday, May 25, for smuggling nearly six kilos of methamphetamine from Cambodia to Vietnam.\nTheophilus Ugwu was charged with \"illegal trafficking of narcotic substances\" by the People's Court of Western province of Tay Ninh, Vietnam, Thanh Nien newspaper reported.\nOn March 8 2020, police found Ugwu transporting 12 bags containing meth from Cambodia to Vietnam in Tay Ninh's Ben Cau District.\nThe repeated seizure of huge amounts of narcotics has occurred despite Vietnam having some of the world’s toughest drug laws.\nProduction or sale of 100 grams of heroin or 300 grams of any other illegal substance is also punishable by death."
  },
  {
    "headline": "VIDEO: Man caught in female hostel disguised as woman",
    "summarized_story": "A yet-to-be-identified man, who disguised as a lady and sneaked into a female hostel of the Ignatius Ajuru University of Education in Rivers State, was caught and stripped by students on Monday.\nThe man had dressed like a lady to see a lover who had been avoiding him for a while, according to PUNCH“He disguised like a young female student to gain access to the hostel of his female friend, who had been avoiding him after she took his phone.\nThey mobilised, held the man and stripped him,” the source stated.\nBefore we got to the place, the school security personnel had already intervened and took him into custody.\nThe man claimed that he was not a student; I think the security personnel are still investigating the matter,” Amadi stated."
  },
  {
    "headline": "BREAKING: Many feared dead as boat capsizes in Kebbi",
    "summarized_story": "Many passengers were feared dead in Kebbi when a boat capsized in Niger River on Wednesday.\nThe boat left Niger and was heading to Kebbi when it split and sank, Abdullahi Buhari Wara, according administrative head of Ngaski district said.\n“A rescue operation is underway but only 22 survivors and one dead body has been recovered.\nBBC Hausa Service reported the incident took place on Wednesday around 10 am.\nAccording to BBC Hausa Service, the chairman of Ngaski Local Government Kebbi State, Abdullahi Buhari Warah, who visited the scene to monitor the rescue operation, said it was a tragedy."
  },
  {
    "headline": "Bakers in Nigeria to increase bread, biscuits price by 30%",
    "summarized_story": "Association of Master Bakers and Caterers of Nigeria (AMBCN) has directed its members nationwide to increase prices of bread, biscuits and other items by 30 percent due to devastating economic situation of the country.\nThe association explained the adjustment in price was as a result of the sudden increase in the costs of production as well as prices of sugar, butter, yeast and flour.\nThe directive was part of the resolution reached at the end of the National Executive Council (NEC) meeting of the association in Abuja.\nBesides, the association frowned at the incessant increase in the price of flour as it is forcing its members to close their businesses.\n“The incessant increase of prices of flour and other baking materials is responsible for the decision."
  },
  {
    "headline": "Premier League: Prize money Chelsea, Man Utd, Arsenal got for 2020/2021 season revealed",
    "summarized_story": "The prize money that all the 20 teams in the 2020/2021 Premier League season got has been revealed, the UK Mirror reports.\nThe top four places were filled by Chelsea and Liverpool on the last day of the campaign.\nLeicester City dropped out of the Champions League places, while West Ham finished sixth.\nYet while some clubs failed to meet their objectives, there is some consolation as each club will be due a handsome payout by the Premier League.\nPremier League prize money 2020/211st – Man City – £38m2nd – Man Utd – £36m3rd – Liverpool – £34m4th – Chelsea – £32m5th – Leicester – £30m6th – West Ham – £28m7th – Tottenham – £27m8th – Arsenal – £24m9th – Leeds – £23m10th – Everton – £21m11th – Aston Villa – £19m12th – Newcastle – £17m13th – Wolves – £15m14th – Crystal Palace – £13m15th – Southampton – £11m16th – Brighton – £10m17th – Burnley – £8.5m18th – Fulham – £6m19th – West Brom – £4m20th – Sheffield United – £2.5mMirror UK"
  },
  {
    "headline": "Scores fear drown in boat mishap in Kebbi",
    "summarized_story": "From Olanrewaju Lawal, Birnin KebbiThe Kebbi State Police command has dispatched it, marine team, to Warrah area,in Ngaski Local government of the state where scores of travellers from Niger state were reported drown in river.\nWhile speaking with our correspondent on Phone,Spokesman of Kebbi State Police Command,DSP Nafiu Abubakar confirmed the incident.\nHe said:” the incident happened in Warrah area and the Commissioner of Police has dispatched marine team to the area to rescue the victims “.\nEye witnesses account revealed that about 160 were travelling from Niger State to neighbouring Warrah community in Ngaski Local Government Area of Kebbi State where the boat capsized.\nThe chairperson of Ngaski LGA, Abdullahi Buhari, who visited the area, told newsmen that over 160 people were on board the boat."
  },
  {
    "headline": "BREAKING: Boko Haram abducts travellers on Borno highway",
    "summarized_story": "From Timothy Olanrewaju MaiduguriOver a dozen of travellers have been abducted by Boko Haram in an attack on a Borno highway Wednesday morning.\nThe insurgents mounted a roadblock at a bend between Mainok-Jakana along Maiduguri-Damaturu road at about 9am Wednesday, multiple sources told Daily Sun.\n“The mounted roadblock at a spot where the road is bent, stopped a commercial vehicle and abducted all the passengers,” Malam Isa, a commercial driver disclosed.\nA security source said the insurgents had earlier fired at some vehicles escaping from attack shortly before mounting the roadblock.\nThe scene of the attack is about 45 kilometres to Maiduguri, Borno capital."
  },
  {
    "headline": "#EndSARS: 7 months after Lagos still counting its losses –Sanwo-Olu",
    "summarized_story": "By Lukman OlabiyiLagos State Government has said the actual value of the damage to property in various parastatals aftermath of #EndSARS mayhem were yet to be determined seven months after.\nAyantayo said the state was still counting its losses following the unfortunate EndSARS protest and the attendant destruction of public and private property.\nHe said the state suffered heavy damage to critical public property which nearly brought it to a standstill economically.\nIt is pertinent to mention here that 20 parastatals were affected in varying degrees which include Lekki Concession Company, Motor Vehicle Administration Agency, Lagos State Fire Service, Lagos State Public Works Corporation, Lagos State Material Testing Laboratory, Lagos State Metropolitan Area Transport Authority, Lagos Bus Service Limited, Lagos Television, Lagos Internal Revenue Service, Lagos State Traffic Management Authority,, among others.\nGovernor to come up with total assessment of losses suffered is still working on the total estimate and is yet to submit full report,” Ayantayo said."
  },
  {
    "headline": "Kalu mourns demise of Pharaoh Okadigbo",
    "summarized_story": "Former Abia State Governor and Senate Chief Whip, Dr. Orji Uzor Kalu, has commiserated with the family of former Senate president, the late Chuka Okadigbo, over the demise of their son, Pharaoh Okadigbo.\nAcknowledging the outstanding qualities of the deceased, Kalu prayed to God to comfort the Okadigbo family.\nIn a condolence message, Kalu described the deceased as humble, easy-going and kind-hearted, adding that his demise is painful and shocking.\nHe said, “I was shocked to hear the news of the passing of Mr. Pharaoh Okadigbo.\n“It is with deep sorrow, the family of the late Dr. Chuba Okadigbo announces the death of Pharaoh Okadigbo, a husband, father, son, brother, and nephew."
  },
  {
    "headline": "NNPC, Bonga sign agreement to unlock 2bn barrels in OML 118",
    "summarized_story": "Nigeria stands to reap about $700million benefit as the Nigerian National Petroleum Corporation (NNPC) and Bonga PSC signed agreements to unlock about two billion barrels of oil for the country under the Oil Mining Lease (OML) 118.\nUnder the arrangement, the NNPC and Bonga PSC will be executing five agreements that will deliver about $700million of immediate benefit to Nigeria.\nThe OML 118 with its straddle fields boast of the presence of the five major players in the deepwater space not only in Nigeria but also globally.\nOML 118 is the first major deepwater development in Nigeria in the deepwater Niger Delta 75 kilometres from shore containing the Bonga fields at water depth over 1000m.\nThe objective was that the HoT would translate to fully termed agreements including the Dispute Resolution Agreement and a new PSC Agreement for the OML 118 Contract Area."
  },
  {
    "headline": "Accountant General Recants, Says £4.2m Ibori Loot Has Not Been Returned to Delta",
    "summarized_story": "By James EmejoThe Accountant General of the Federation (AGF), Mr. Ahmed Idris, Wednesday clarified that the recovered £4.2m Ibori loot had not been returned to Delta State.\n“This is the true position as regards the £4.2m Ibori Loot.\n“The issue of the £4.2m Ibori Loot has not been properly resolved.\n“The Office of the Accountant General of the Federation (OAGF) wishes to put the records straight regarding the widely circulated media report on the £4.2m Ibori Loot,” the AGF stated.\nhe Accountant General of the Federation,had on Tuesday claimed that the £4.2 million loot recovered from a former Governor of Delta State, James Ibori, and his associates, which was recently repatriated from the United Kingdom, had been returned to Delta State."
  },
  {
    "headline": "Buhari: Insecurity Hindering My Plans for Nigeria",
    "summarized_story": "Buhari stated this while delivering his remarks in Abuja at the opening of a Special Summit on National Security organised by the House of Representatives.\nHe called on the Legislature to use the opportunity to pass more laws to enhance the operations of national security agencies.\nThe challenges that these international borders pose to our national security and interest are enormous.\nFrom the time I became Sultan till now, for 11 years plus, we have been having such gatherings to talk about Nigeria, national security, development and so on.\nToday we are here once again on the same issue of National Security."
  },
  {
    "headline": "Buhari Not in Support of Open Grazing, Presidency Clarifies",
    "summarized_story": "Some senior lawyers also faulted Buhari’s opposition to the open grazing ban, alleging ethnic bias.\nShehu said the president viewed open grazing as old-fashioned and was looking forward to a replacement for the medieval practice.\nBut he reiterated that banning open grazing without an alternative is not a good approach to the issue.\nOgbe, in the statement, had said that the decision to ban open grazing was in the best interest of all Nigerians.\nHe said since there was a popular demand for the proscription of open grazing, efforts should be made to immediately establish ranches."
  },
  {
    "headline": "Air Force Raises Committee to Audit Aircraft’s Safety",
    "summarized_story": "• Panel gets June 18 deadline to submit reportKingsley NwezehThe Nigerian Air Force (NAF) yesterday set up a committee to conduct a safety audit of its operational and engineering units.\nThere have also been trending calls on the social media for the air force to ground the remaining two.\nBut the air force has insisted that the planes are in good conditions.\nThe statement reads: “The Chief of the Air Staff (CAS), Air Marshal Oladayo Amao, has constituted a committee of serving and retired senior officers to conduct a safety audit of all Nigerian Air Force (NAF) operational and engineering units.\n“The committee is to, among other terms of reference, analyse safety reports from operational and engineering units, conduct safety evaluation of NAF units and recommend measures to enhance safety of operations in the units."
  },
  {
    "headline": "Drop Your Arms, Embrace Anchor Borrowers’ Programme, Emefiele Tells Bandits",
    "summarized_story": "He also announced that the central bank has been encouraged to increase its COVID-19 Targeted Credit Facility to N400 billion from N300 billion.\nAccording to Emefiele, his appeal to criminals to embrace family is because there is a linkage between security and economic growth.\nI am aware that six of them are coming to the country in the month of July and August.\n“I, therefore, would like to appeal to our brothers, who decide that they want to live in bushes and forests, that they should please, begin to retreat, drop their arms and come and embrace the anchor borrowers’ programme.\n“I am optimistic before the end of the year that the security challenges confronting the country will substantially abate,” he stated."
  },
  {
    "headline": "BREAKING: Scores Feared Dead As 160-Passenger Boat Capsizes In Kebbi",
    "summarized_story": "About 140 boat passengers are said to be missing in Kebbi State after an overloaded boat ferrying them sank in the Niger River.\nThe boat left central Niger state and was heading to northwest Kebbi state when it sank, Abdullahi Buhari Wara, administrative head of Ngaski district said.\n“A rescue operation is underway but only 22 survivors and one dead body have been recovered,” Wara said.\n“We are talking of around 140 passengers still missing.”According to AFP, Wara blamed the Kebbi accident on overloading as the boat was meant to ferry not more than 80 passengers.\nThe boat ferrying 100 local traders split into two after hitting a stump during a storm as they were returning from a local market, according to emergency officials."
  },
  {
    "headline": "BREAKING: Scores Feared Dead As 160-Passenger Boat Capsizes In Kebbi",
    "summarized_story": "About 140 boat passengers are said to be missing in Kebbi State after an overloaded boat ferrying them sank in the Niger River.\nThe boat left central Niger state and was heading to northwest Kebbi state when it sank, Abdullahi Buhari Wara, administrative head of Ngaski district said.\n“A rescue operation is underway but only 22 survivors and one dead body have been recovered,” Wara said.\n“We are talking of around 140 passengers still missing.”According to AFP, Wara blamed the Kebbi accident on overloading as the boat was meant to ferry not more than 80 passengers.\nThe boat ferrying 100 local traders split into two after hitting a stump during a storm as they were returning from a local market, according to emergency officials."
  },
  {
    "headline": "Brekete Family Host, Ahmed Isah Caught In Another Assault Video Slapping Man He Accused Of ‘Writing Names Without His Permission’",
    "summarized_story": "Isah, in the midst of the interrogation, paused and hit the young man in the face with his right palm.\nThe assaulted young man was also the one who apologised, saying he was sorry for what he had done.\nIsah asked the young man, \"You gather people and write their names?\"\nThe young man replied, \"I do not gather people, I came for CAC registration.\nIsah, who had by now, slapped the young man asked in anger, \"Who commissioned you to write their names?"
  },
  {
    "headline": "Brekete Family Host, Ahmed Isah Caught In Another Assault Video Slapping Man He Accused Of ‘Writing Names Without His Permission’",
    "summarized_story": "Isah, in the midst of the interrogation, paused and hit the young man in the face with his right palm.\nThe assaulted young man was also the one who apologised, saying he was sorry for what he had done.\nIsah asked the young man, \"You gather people and write their names?\"\nThe young man replied, \"I do not gather people, I came for CAC registration.\nIsah, who had by now, slapped the young man asked in anger, \"Who commissioned you to write their names?"
  },
  {
    "headline": "At Last, Nigerian Government Flies National Flags At Half Mast In Honour of Late Army Officers After SaharaReporters' Story",
    "summarized_story": "In what appears like an afterthought, the Nigerian government has finally flown the national flags hoisted at the popular 'Eagle Square' at half mast after a report by SaharaReporters.\nSaharaReporters had on Monday published a report, video and pictures of how the government ignored its own directive for public buildings, facilities and official residences to fly the national flags at half mast from Monday, May 24 to Wednesday, May 26th.\nChecks on Wednesday by our correspondent showed the flags were flown at half mast in compliance with the directive to honour the army officers who lost their lives in a plane crash on Friday in Kaduna.\nIt was gathered that SaharaReporters' report embarrassed some top government officials, Federal Capital Territory Authority (FCTA), and authority in charge of the facility.\nIt was flancked on both sides by the Federal Secretariat, National Cenotaph, National Assembly Complex, and the Supreme Court."
  },
  {
    "headline": "Lawan: Nigeria's existence under threat -- we need better investment in security",
    "summarized_story": "Senate President Ahmad Lawan says the essence of Nigeria’s existence is under “serious threat” as a result of insecurity.\nSpeaking at the event, Lawan said the country has come under serious security threats, adding that even law enforcement agencies are not left out.\nThe very essence of the existence of this country is under serious threat,” he said.\nAdvertisement“And the recent introduction in the south-east is another serious threat to the existence of this country.\nWhere government institutions are targeted, our police and security agencies personnel are being killed on a daily basis."
  },
  {
    "headline": "Lawan: Nigeria's existence under threat -- we need better investment in security",
    "summarized_story": "Senate President Ahmad Lawan says the essence of Nigeria’s existence is under “serious threat” as a result of insecurity.\nSpeaking at the event, Lawan said the country has come under serious security threats, adding that even law enforcement agencies are not left out.\nThe very essence of the existence of this country is under serious threat,” he said.\nAdvertisement“And the recent introduction in the south-east is another serious threat to the existence of this country.\nWhere government institutions are targeted, our police and security agencies personnel are being killed on a daily basis."
  },
  {
    "headline": "'Over 150' missing as boat capsizes in Kebbi",
    "summarized_story": "More than 150 people have been reported missing following a boat mishap that occurred in Warrah, headquarters of Ngaski LGA of Kebbi state, on Wednesday.\nAdvertisementNafiu Abubakar, spokesman of the Kebbi police command, also confirmed the development, adding that findings will be made public later.\nAccording to NAN, a resident who confirmed the incident via telephone, said the boat took off from Loko in Niger state with over 150 passengers.\n“We are afraid that many people may have died from this mishap, because according to report, the boat took off with over 150 persons and many are still missing,” the source said.\nThe resident added that many people had trooped into the town from Niger state in search of their relations who are said to have boarded the boat."
  },
  {
    "headline": "'Over 150' missing as boat capsizes in Kebbi",
    "summarized_story": "More than 150 people have been reported missing following a boat mishap that occurred in Warrah, headquarters of Ngaski LGA of Kebbi state, on Wednesday.\nAdvertisementNafiu Abubakar, spokesman of the Kebbi police command, also confirmed the development, adding that findings will be made public later.\nAccording to NAN, a resident who confirmed the incident via telephone, said the boat took off from Loko in Niger state with over 150 passengers.\n“We are afraid that many people may have died from this mishap, because according to report, the boat took off with over 150 persons and many are still missing,” the source said.\nThe resident added that many people had trooped into the town from Niger state in search of their relations who are said to have boarded the boat."
  },
  {
    "headline": "'NYSC not a waste of time' -- DG defends scheme amid debate over relevance",
    "summarized_story": "Shuaibu Ibrahim, director-general of the National Youth Service Corps (NYSC) says the scheme is “critical to the unity of the country”.\nAdvertisementHe said the scheme is not a waste of time, adding that its relevance in integration and national cohesion must not be underestimated.\nAdvertisementHe said the corps members contribute in many ways to the lives of residents of their host communities.\nAbiante told TheCable that the NYSC scheme has failed to achieve its intended purpose and therefore should be discontinued.\nReacting, the NYSC DG said the scheme has partnered with security agencies to ensure adequate protection for corps members during their service year."
  },
  {
    "headline": "OPay in talks to raise $400 million from investors at $1.5bn valuation to finance expansion plans",
    "summarized_story": "OPay is reportedly in talks to raise $400 million from investors at a valuation of $1.5 billion, according to an exclusive report from The Information.\nOPay is looking to raise funding to finance its expansion plan, having launched in Egypt this year.\nAn Africa-focused company with Chinese backersWhile OPay is based in Nigeria, its backers are mostly Chinese companies like Meituan, a multi-billion-dollar Chinese shopping platform.\nIn July 2019, OPay raised $50 million from Sequoia Capital, IDG Capital, Source Code, GSR Ventures and Meituan-Dianping.\nYet, should they successfully raise $400 million, it will be the kind of war chest that makes anything possible."
  },
  {
    "headline": "Dominic Joshua’s ‘hedge fund’ paid out 30% monthly returns. Then the scam unravelled",
    "summarized_story": "That payment arrived two weeks later after Adigun repeatedly pressured Dominic Ngene Joshua, the founder and head of Brisk Capital, on Instagram.\nAdigun says her sister also invested in Brisk Capital but never received any returns.\nPosh Josh sells ChanelEmpowered with an increasingly posh image and a slick Brisk Capital website, Joshua began taking funds from willing investors.\nAn advisory note from ChiveGPS, a consultancy, to a client who wanted to invest with Dominic Joshua’s Brisk Capital.\nShe thought the percentage was outrageous but trusted her friend who was a Brisk Capital agent to help her invest."
  },
  {
    "headline": "Dr Vuyane Mhlomi is helping patients receive treatment from the comfort of their own homes",
    "summarized_story": "Before he turned ten, a typical Friday would find Vuyane Mhlomi on one of many trains making his way back home from school.\nToday, Vuyane is a medical doctor, Rhodes scholar, and the co-founder of Quro Medical – a startup making it possible for patients to receive the best care from the comfort of their homes.\nVuyane with his mother Nomsa at his graduation from UCTVuyane lost his father when he was eleven years old.\nVuyane returned to South Africa ready to start a business that would change the healthcare landscape forever.\nOn one hand, Quro finally had capital to begin expanding their services across South Africa and beyond."
  },
  {
    "headline": "Brand Africa Ranks TECNO 6th on the Most Admired brands in Africa List",
    "summarized_story": "– In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nWhen TECNO launched dual SIM cards in Africa, there had been nothing of the kind before then.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "How OctaFX became the first financial company in Nigeria to organise a cooking session for Ramadan",
    "summarized_story": "OctaFX brought two popular bloggers together in a cooking studio: the comedian Apaokagi Maryam and the music video director Abdulazeez Greene.\nThey prepared a special evening meal for Ramadan called Iftar and compared the subtleties of cooking with those ingrained in trading.\n‘Ramadan Special’ is the first cooking show in Nigeria produced by a financial company.\nApaokagi Maryam is a frequent collaborator of the global Forex broker and took part in the last OctaFX Goal Booster promotion.\nThe company is aspiring to create more shows like ‘Ramadan Special’ in the future."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Brand Africa ranks TECNO 6th on the most admired brands in Africa list",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa's audience directly.\nTo promote your brand via Brand Press, please email [email protected]In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "Brand Africa ranks TECNO 6th on the most admired brands in Africa list",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa's audience directly.\nTo promote your brand via Brand Press, please email [email protected]In the recently released Africa’s Best Brands 2021, TECNO ranked for five consecutive years among the TOP 6 brands on the African continent, marking another prestigious recognition of the brand’s leadership in Africa.\nEstablished in 2011, the Brand Africa 100: Africa’s Best Brands rankings is the most authoritative survey and analysis on brands and underlying businesses in Africa, based on a study by Geopoll across 28 countries spanning all the five economic regions and analysis and ranking by Kantar and Brand Leadership.\nThe 2021 survey was conducted between March and April 2021 and yielded over 80,000 brand mentions and over 3,500 unique brands.\nAnd now, with Brand Africa’s new rankings, TECNO has once again come out tops, becoming a leading player in mid to high-end mobile brand segments in Africa."
  },
  {
    "headline": "Have you ever worked as an insurance sales agent, or currently work as one? Help provide insight",
    "summarized_story": "If you’ve ever worked as an insurance sales agent — financial services advisor — or currently do, please keep reading.\nWe have designed the research project to get information from major players in the insurance industry: the potential buyers of insurance products, the sales agents, and the insurance companies.\nPlease, take five minutes to fill this multiple-choice questionnaire if you have insurance sales experience.\nAdvertisementAnd if you have no insurance sales experience, kindly send this to anyone you know who does.\nIntelligence by Techpoint also offers research consultancy services to businesses and institutesComments"
  },
  {
    "headline": "Speculation pushes naira to one-year low",
    "summarized_story": "The pressure on Nigeria’s currency intensified on Wednesday as black market speculators have taken advantage of the Central Bank of Nigeria (CBN) newly adopted exchange rate to buy up and hoard dollars.\nConsequently, the naira fell to N493 per dollar on Wednesday, the lowest since November 30, 2020, when it weakened to as low as…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "OPay in $400m funding talks for expansion in new markets",
    "summarized_story": "OPay in $400m funding talks for expansion in new marketsAfrica-focused digital payment company, OPay, is talking to investors over a possible $400 million funding raise, according to The Information, a San Francisco-based news media.\nThe funding is expected to enable the payment company to expand into new markets as well as new services.\nOPay would also be able to take its valuation to $1.5…"
  },
  {
    "headline": "Shell, Eni lose OPL 245 after 10-year corruption case",
    "summarized_story": "In its latest legal moves, the Federal government has insisted Royal Dutch Shell PLC and Eni SpA resolve all corrupt cases before renewing the Oil Prospecting License (OPL) 245, one of the biggest untapped oil assets on the African continent with reserves estimated at nine billion barrels.\nRead Also: Eni takes Nigeria to Arbitration Court over…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Reps Committee wants authors of anonymous “Non-Paper” petition prosecuted – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The House of Representatives Committee on Foreign Affairs has called on security agencies to investigate and prosecute the authors of a “Non-Paper” petition, accusing the leadership of the Ministry of Foreign Affairs of monumental corruption.\nBuba said that the reform is dealing with the many years of suspected systemic corruption and official malfeasance in the ministry.\n“Part of the allegations contained in the so- called petition dealt extensively with the fiscal years of 2018, 2019 and 2020 respectively.\n“He has indeed, pointed out the way he intends to go in actualising the dreams of the National Assembly for the Ministry of Foreign Affairs.\n“As a result, the committee, unanimously commends the permanent secretary for his dogged commitment to upholding the reforms of President Buhari at the Ministry of Foreign Affairs,’’ he said."
  },
  {
    "headline": "PTI Tasks Students On Entrepreneurial Development, Matriculates 1,901 Students – Nigerian Observer",
    "summarized_story": "Dr. Henry Adimula stated this during the Institute’s annual matriculation ceremony held at PTI Conference Centre, Effurun, Uvwie Local Government Area, Delta State.\n“Entrepreneurship Development is another area that we are building the capacity of our students.\nSome of the visibly excited matriculants, Miss Aishat Oluwatosin and Usuangbon Irehze they were happy becoming bonafide students of the Petroleum Training Institute.\n“My name is Aishat Oluwatosin, I’m matriculating today in the Petroleum Training Institute.\n“I promise to give my best to the Petroleum Training Institute and come out with excellence” he said..."
  },
  {
    "headline": "EIRS Hails IUO On Tax Compliance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOKADA(OVIA NORTHEAST) – Edo State Internal Revenue Service (EIRS), yesterday appreciated Igbinedion University, Okada (IUO) for being tax compliant.\nResponding to the raised tax issues on behalf of the Vice Chancellor, IUO, Professor Lawrence Ikechukwu Ezemonye, Dr. Nosa Edogiawerie (Bursar) appreciated the delegation and encouraged its continuance for ease of tax administration in the state.\nHe affirmed that non payment of tax would dent the image of the hospital and possibly attract a riot act from government.\nAn expatriate and Director of Administration, Igbinedion University Teaching Hospital, Michael Strauss, stated that taxes must be deducted to be responsible employees to government which depends on revenue to succeed.\nHe stated that if taxes are not paid to government one could get punished (nailed) as applicable in advanced countries hence appreciated government for it’s resilience at tax collection."
  },
  {
    "headline": "Ambrose Alli Varsity: Visitation Panel indicts ousted mgt of 1.7bn fraud – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…N133m lease obtained for motor vehicle procurementBENIN CITY – The Ambrose Alli University, Ekpoma, Special Visitation Panel has indicted the ousted management of the institution for “indiscriminate procurement of loans/overdraft” to the tune of N1,794,069,811.02 within the period under review.\nThe panel, which was constituted by Governor Godwin Obaseki in the wake of the agitation by staff unions in the school and other stakeholders in the university community, was tasked to investigate operations of the university in terms of revenue generation, transparency, accountability, adherence to due process, mode of employment and promotions and sustainability.\nThe panel, set up in October, 2020, was chaired by Prof. Ikponmwosa Omoruyi, a Professor of Law at the University of Benin.\nProf. Lawrence Atsegbua, who is a member of the panel, is also a Professor of Law at the University of Benin and a Senior Advocate of Nigeria (SAN).\nOthers on the panel are Mrs. M. E. Ohiowele, Roland Ogbebor, Dr. J. O. Okovido and Venerable Osaze Egbenusi, as members, with Mrs. P. E. Aziegbemhin, as Secretary."
  },
  {
    "headline": "Buba Galadima denies ties with PDP, say rAPC ‘coming back soon’",
    "summarized_story": "ADVERTISEMENTBuba Galadima, a former ally of President Muhammadu Buhari, has denied his affiliation with any of Nigeria’s two dominant political parties.\nI am the national chairman of the breakaway rAPC and I remain so,” Mr Galadima clarified.\nMr Galadima, a former National Secretary of defunct Congress for Progressive Change (CPC), was one of the signatories to the merger that birthed the APC.\nIt is only the people that have the right to choose who will represent them,” Mr Galadima said.\nIf people don’t own these political parties they cannot be stakeholders,” he said."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Children must be brought up to be most innovative – Modupe Adeyinka-Oni",
    "summarized_story": "Now you see your products out there, children you have raised, and who have gone on to play roles in society.\nAnd so, I needed a school where my children would not just go but will thrive.\nWe are a small school, a family school, and we believe that children should be able to express themselves in their natural environment.\nWhere the children will place you in terms of the seniors and where the staff will place you.\nFor a lot of children, their voices are being drowned out under that old philosophy of children only being permitted to listen and not be heard."
  },
  {
    "headline": "U.S. Consulate, Exchange Alumnus seek inclusion of arts in healthcare, launch innovation hub",
    "summarized_story": "United States Consulate General in collaboration with Tender Arts Nigeria unveiled an “Arts and Medicine Innovation Hub” hosted at the Federal Neuropsychiatric Hospital, Yaba, Lagos.\nSpeaking at the formal opening of the innovation hub, U.S. Consulate Acting Public Affairs Officer Jennifer Foltz explained that incorporating the arts into healthcare delivery will enhance holistic patient care.\nAccording to her, the innovation hub will provide opportunities for cultural exchange for art therapists, arts in health practitioners and mental health advocates in Nigeria and beyond.\nIn Lagos State, we will be seeking the input of artists in the design of our new public healthcare facilities,” Professor Abayomi added.\nFounder/Executive Director Tender Arts Nigeria, Kunle Adewale, said creative arts programs can help patients work towards recovery in an effective and enjoyable way."
  },
  {
    "headline": "Army bust Boko Haram logistics stockpile, arrest fuel suppliers",
    "summarized_story": "OBINNA EZUGWUTroops of Operation Hadin Kai on Tuesday, May 25, 2021 raided a suspected Boko Haram logistics stockpile in Kurkareta town, Yobe State, a statement from Army spokesperson, Brig.\nAccording the statement, items recovered during the raid operations by troops in conjunction with local vigilantes include 62 jerrycans loaded with Premium Motor Spirit popularly called petrol, hidden in different houses and shops.\nThree vehicles belonging to the terrorists’ suppliers with registration numbers DAL 626 YE (Kano), GBK 413 GR (Benue) and XA 390 SHN (Borno) were also impounded.\n“The successful raid was undertaken following credible intelligence that some members of the community are suppliers of fuel and other products to insurgents.\nAll the recovered items and the suspects are in our custody for preliminary investigations before handing them over to the appropriate agency for prosecution,” the statement said."
  },
  {
    "headline": "Iran bans Bitcoin mining over power outage",
    "summarized_story": "Iran has banned the mining of Bitcoin after a series of blackouts across major cities.\nThe ban comes amidst a growing unease over cryptos energy usage, and follows a regional ban placed on Bitcoin by China.\nAccording to Bloomberg, Iranian officials are blaming a surge in mining for blackouts in their cities.\nSubsidised power prices allow miners to run the complex computers that compete to solve mathematical problems and receive Bitcoin as a reward.\nThe University of Cambridge estimates Iran was home to 3.4% of Bitcoin mining in the first four months of 2020, putting it in sixth place globally."
  },
  {
    "headline": "Takardun Bogi: Hukumar SUBEB Ta Jihar Neja Ta Kori Malamai",
    "summarized_story": "Share on TelegramShare on TwitterShare on FacebookHukumar bayar da ilimin bai daya ta Jihar Neja (SUBEB) ta sallami malamai guda 20 daga aiki da ke karantarwa a makarantun firamare na gwamnati, sakamakon takardun bogi da rashin zuwa aiki a fadin kananan hukumomi da ke Jihar Neja.\nWadanda aka kora sun kasancewa ne a kananan hukumomi guda tara da ke fadin jihar wadanda suka hada da Bida, Lapai, Agaie, Katcha, Labun, Mashegu, Munya, Shiroro da kuma Kontagora.\nDa yake tabbatar da Koran malaman lokacin da yake zantawa da manema labarai, jami’in yada labarai na hukumar, Idris Kolo ya bayyana cewa, an dauki wannan mataki ne sakamakon rashin kwarewar malaman da ke fadin jihar.\nShugaban hukumar SUBEB na Jihar Neja, Dakta Isah Adamu ya bayyana cewa, hukumarsa ta dauki wannan mataki na korar malaman da ba su kware ba, domin sake inganta harkokin karantarwa a matakin farko na ilimi.\nYa kara da cewa, wannan shi ne mataki na farko da aka gudanar a kan bincikan takardun makarantar da malaman suka yi karatunsu."
  },
  {
    "headline": "Shugaban Malaman Jami’o’i Ya Shawarci Iyaye Kan Tarbiyyar ‘Ya’ayansu",
    "summarized_story": ""
  },
  {
    "headline": "Kisan Da Ake Wa ‘Yan Arewa A Kudu Ya Isa Haka – NEF",
    "summarized_story": ""
  },
  {
    "headline": "Nuna Ninanci Koma Baya Ne Ga Kasar Nan, In Ji ‘Yan Jarida",
    "summarized_story": ""
  },
  {
    "headline": "Jihar Benuwe Ta ki Yarda Da Samar Da Wuraren Kiwo Na Zamani",
    "summarized_story": ""
  },
  {
    "headline": "Reno Omokri: If Hisbah can destroy truckload of beer, southerners can destroy their cows too",
    "summarized_story": "Former presidential aide, Reno Omokri has reacted to the destruction of truckloads of beer by the Hisbah Command in Kano State.\nWe had reported that the Kano State Hisbah Command on Tuesday confiscated 8,400 bottles of beer which was allegedly smuggled into the state from Zaria, Kaduna State.\nReacting, Reno in a post on his official Facebook page on Wednesday, said if the Northerners could engage in such an act without confrontation from authorities, the Southerners can also destroy cows belonging to their counterparts.\n“In the same vein, Nigeria will not collapse if Southern states destroy any cattle caught grazing openly.\n“We must refuse to live in a country where cows have more rights than human beings,” Reno posted."
  },
  {
    "headline": "Crypto: Nigeria will soon have its own digital currency — CBN",
    "summarized_story": "Nigeria will soon create its digital currency, the Central Bank of Nigeria said Tuesday as the bank continues to face questions over its ban on cryptocurrency transactions in the country.\nThe governor of the CBN, Godwin Emefiele, said this while addressing journalists after a two-day meeting of the Monetary Policy Committee in Abuja.\nREAD ALSO: Buhari-led government Conspires to hunt down whistle-blower who exposed Late Abba Kyari, Kingibe, other cabal membersHe said the idea of a digital currency would soon become a reality in the country, and that the central bank has already set up its committee, which is working on the concept."
  },
  {
    "headline": "“Nigerian politicians are the ones giving guns to bandits” – Seun Kuti",
    "summarized_story": "Seun Kuti has exposed those behind the bloody rampage by bandits.\nAccording to the musician and youngest son of Afrobeat legend, Fela Anikulapo Kuti, Nigerian politicians are the ones giving guns to bandits.\nIn a trending video posted on social media, Seun stated that if Nigerians want banditry to end, all politicians in the country should write down a’ list of people they have given guns to’ so that the weapons can be retrieved.\n”Politicians are the ones giving bandits guns in Nigeria.\nIf we want to end this banditry, all politicians should write down a list of people they’ve given guns to so we can go and collect it back."
  },
  {
    "headline": "Nigeria needs deep thinkers to forge ahead -Pastor Kasali",
    "summarized_story": "“If we have deep thinkers we will not be where we are today.\nWe have political thinkers, tribal thinkers, ethnic thinkers and religious thinkers.\n“If we were deep thinkers there are things that we will not do or say.\nWe should think humanity, think nation, think development before we think me because if I think about the collective good it will come to me eventually.\n“We need people like Pastor Motunrayo a deep thinker, strong sound and balanced, very enlightened, who can offer selfless service to humanity."
  },
  {
    "headline": "Military Air Crash: NIPR Mourns Attahiru",
    "summarized_story": "By JOHN MOMODU… Describes Late COAS as Patriotic, Committed to Nigerian ProjectThe Nigerian Institute of Public Relations (NIPR) has expressed sadness over the recent unfortunate incident of air crash that claimed the lives of the Chief of Army Staff, late Lt. Gen. Ibrahim Attahiru and 10 officers while on official duty in Kaduna State.\nThe President and Chairman of the Institute, Mallam Mukhtar Sirajo, in a letter of condolence to both the Chief of Defence Staff and the wife of the late Army Chief said the tragic incident has rubbed the nation of one of its finest brains in the military.\nThe NIPR boss stated that Attahiru, exhibited high sense of professionalism in the discharge of his duties, noting that a few months of his leadership in the nation’s Army brought change in strategy that gave hope to the citizens.\n“The late Army Chief demonstrated firm commitment in the fight against insurgency in the country and believed in the project of a united Nigeria.\nHe described late Attahiru as a patriotic Nigerian, who has lived a life worthy of emulation by officers and non-officers within and outside the military."
  },
  {
    "headline": "Military Air Crash: NIPR Mourns Attahiru",
    "summarized_story": "By JOHN MOMODU… Describes Late COAS as Patriotic, Committed to Nigerian ProjectThe Nigerian Institute of Public Relations (NIPR) has expressed sadness over the recent unfortunate incident of air crash that claimed the lives of the Chief of Army Staff, late Lt. Gen. Ibrahim Attahiru and 10 officers while on official duty in Kaduna State.\nThe President and Chairman of the Institute, Mallam Mukhtar Sirajo, in a letter of condolence to both the Chief of Defence Staff and the wife of the late Army Chief said the tragic incident has rubbed the nation of one of its finest brains in the military.\nThe NIPR boss stated that Attahiru, exhibited high sense of professionalism in the discharge of his duties, noting that a few months of his leadership in the nation’s Army brought change in strategy that gave hope to the citizens.\n“The late Army Chief demonstrated firm commitment in the fight against insurgency in the country and believed in the project of a united Nigeria.\nHe described late Attahiru as a patriotic Nigerian, who has lived a life worthy of emulation by officers and non-officers within and outside the military."
  },
  {
    "headline": "VIDEO: 10 FASCINATING FACTS ABOUT NOLLYWOOD STAR, KATE HENSHAW",
    "summarized_story": "You might also like"
  },
  {
    "headline": "VIDEO: 10 FASCINATING FACTS ABOUT NOLLYWOOD STAR, KATE HENSHAW",
    "summarized_story": "You might also like"
  },
  {
    "headline": "I’ll curse those frustrating agitation for Yoruba Nation seven days – Gani Adams",
    "summarized_story": "The Aare Onakakanfo of Yorubaland, Gani Adams has vowed to curse prominent politicians in the Southwest frustrating agitation for Yoruba Nation for seven days.\nAdams’ threat is coming few days after Southwest APC leaders led by Asiwaju Bola Tinubu met in Lagos to denounce agitation for Yoruba Nation.\nAdams, in a statement issued by his media aide, Kehinde Aderemi, titled, “Yoruba nation’s struggle infiltrated by politicians- Gani Adams,” said it was unfortunate that some people were determined to weaken the spirit of the agitators.\nIn the statement by Adams’ media aide, Kehinde Aderemi, titled, ‘Yoruba nation’s struggle infiltrated by politicians- Gani Adams’, the Yoruba generalissimo was also quoted as cursing those instigating crisis in Yoruba land.\nHe added that he would continue to curse them repeatedly for seven days because they deserved nothing but the wrath of God and that of the Yoruba ancestors."
  },
  {
    "headline": "Why Buhari didn’t attend COAS Attahiru’s burial – Garba Shehu",
    "summarized_story": "Garba Shehu, Senior Special Assistant on Media to President Muhammadu Buhari has revealed why the president refused to attend the burial of late Chief of Army Staff, Lt. Gen. Ibrahim Attahiru.\nThe president’s absence from the burial of the COAS stirred criticism from Nigerians who condemned his decision to shun the burial.\nGarba Shehu who spoke on Tuesday during an interview with Arise TV said he has not spoken to the president about it.\n“These are small things for many people but they are important for President Muhammadu Buhari.\nBuhari did not attend the burial but sent a delegation."
  },
  {
    "headline": "Abidemi Rufai: New charge emerges, surety Nekpen in trouble",
    "summarized_story": "The news platform said an appeal has been filed before a western district judge in Washington state.\nRufai was to be released to the home of a family friend Nekpen Soyemi, a nurse with an address on Long Island.\nHe would also be forbidden from leaving the Eastern District of New York — or eventually, the Western District of Washington.\nThe appeal noted that Rufai has no clear ties to the Western District of Washington, and has just one family member living in the United States.\nMarshals Service transport him to the Western District of Washington, and then he can have another bail release hearing here,” Langlie said."
  },
  {
    "headline": "Plane Crash: Apostle Okikijesu Releases ‘Shocking’ June, July Prophecies",
    "summarized_story": "Apostle Paul Okikijesu has revealed that Nigerians should pray to avert plane crash of a private jet betwen June and July.\nThe popular prophet disclosed this in the prophecies sent to newsmen on Wednesday.\nHe said; “Thus says the Lord: I the Lord had previously instructed people to pray against plane crash and fire incidents or accidents at the airports; another private jet may crash that will cause loss of lives; if people are not prayerful.”“Pray against plane crash of a private jet between June and July 2021.\n“Thus says the Lord: People should pray against the plane crash of a private jet that can make the country to weep; due to loss of lives of the influential figures between June and July 2021.\nOkikijesu also said God’s judgment will fall on former Governors who are now Senators."
  },
  {
    "headline": "President Kagame Advises Buhari, Others To Tackle Africa’s Crises",
    "summarized_story": "President Paul Kagame of Rwanda has urged President Muhammadu Buhari and other African leaders to involve a balanced approach to deal with the root cause of the continent’s security and other crises.\nMr Kagame gave the advice at the UBA Africa Conversations 2021 held virtually to commemorate Africa Day on Tuesday in Lagos.\nHe said, “We did not have to ask the question as to what African leaders are doing to stop the crisis going on across the continent.\n“The continued emergence and spread of this crisis require resources and a mindset to pursue peace, also put in place good politics.\nWe cannot benefit until countries work together in peace, with security in place and stability,” explained the Rwandan president."
  },
  {
    "headline": "Nigerians Don’t Need Bank Accounts — EFCC",
    "summarized_story": "Amid the growing number of bank frauds and insider crimes in the banking sector, the Economic and Financial Crimes Commission says it is not mandatory for Nigerians to have bank accounts.\nThe EFCC also opposed the concept of opening bank accounts using “mere phone numbers,” claiming that approximately 40% of Americans lack bank accounts.\nAs a result, having a bank account is not a requirement for anyone in Nigeria,” said Bawa Usman, the EFCC’s zonal head in Sokoto.\nThe meeting was called by the EFCC to improve the partnership and cooperation between the EFCC and banks in the fight against fraud.\nMr Usman went on to say that banks often stymied the EFCC’s investigations by failing to respond to its letters."
  },
  {
    "headline": "Breaking: El-Rufai sacks deputy Chief of Staff, 18 others",
    "summarized_story": "Kaduna state Governor Nasir El-Rufai has sacked at least 19 political appointees.\nA statement from the state government on Wednesday, said affected officials include two Special Advisers, a deputy Chief of Staff and several special assistants.\nAccording to the statement, the governor said the 19 disengaged staff were the first phase of public servants who will depart the public service, in continuation of rightsizing the workforce.\nShare this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Breaking: Train pipe robbers nabbed in Kaduna",
    "summarized_story": "Kaduna state government officials and some security agents have apprehended those who stole pipes from the train that derailed at Unguwar Kanawa recently.\nThey were arrested at Nnamdi Azikiwe Expressway Western bypass, opposite Zakaria Hotel.\nDetails loading…Share this:TweetPrintTelegramWhatsApp"
  },
  {
    "headline": "Pictures: Nigerians in South Africa stage protest over ‘illegal passport fees’",
    "summarized_story": ""
  },
  {
    "headline": "COAS, others arrives National Military Cemetery for final journey to eternity -NigPilot",
    "summarized_story": "The remains of Chief of Army Staff , and 10 others who died in the ill-fated NAF Beachcraft 350 aircraft in Kaduna yesterday evening had arrived at the National Military Cemetery, Abuja for their last journey to eternity.\nRegrettably, President Muhammadu Buhari was absent as one of his commender, the Chief of Army Staff, Lt Gen Ibrahim Attahiru was laid to rest in Abuja.\nDefence expert who spoke in hush tongue at the burial said that President Buhari’s absent at shows high level of insensitivity.\nThis is even as the Chief of the Naval Staff (CNS), Vice Admiral Awwal Gambo directed the cancellation of the events marking the 65th Anniversary of the Nigerian Navy.\n“The CNS commiserates with the nation and offers the condolences of officers and ratings of the Nigerian Navy to Mr President, the Nigerian Army and Nigerian Air Force as well as families of the departed."
  },
  {
    "headline": "COAS, others arrives National Military Cemetery for final journey to eternity -NigPilot",
    "summarized_story": "The remains of Chief of Army Staff , and 10 others who died in the ill-fated NAF Beachcraft 350 aircraft in Kaduna yesterday evening had arrived at the National Military Cemetery, Abuja for their last journey to eternity.\nRegrettably, President Muhammadu Buhari was absent as one of his commender, the Chief of Army Staff, Lt Gen Ibrahim Attahiru was laid to rest in Abuja.\nDefence expert who spoke in hush tongue at the burial said that President Buhari’s absent at shows high level of insensitivity.\nThis is even as the Chief of the Naval Staff (CNS), Vice Admiral Awwal Gambo directed the cancellation of the events marking the 65th Anniversary of the Nigerian Navy.\n“The CNS commiserates with the nation and offers the condolences of officers and ratings of the Nigerian Navy to Mr President, the Nigerian Army and Nigerian Air Force as well as families of the departed."
  },
  {
    "headline": "Education Ministry committed to producing best crop of teachers -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Education Ministry committed to producing best crop of teachers -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Asaba resolution: Malami is right – Pro Democracy Group -NigPilot",
    "summarized_story": "Pro-democracy group, Coalition For Defence Of Democracy In Nigeria, CDDN, has called for caution over the southern governor’s resolution on open grazing and the statement of the attorneys-general of the federation and minister of justice, Mr. Abubakar Malami (SAN).\nHe spoke following the ban of open graze ng by southern governors after a meeting in Asaba.\n”The context of the use of “spare parts” is about freedom of movement of goods and ownership.\nSpare part dealers move spare parts in ownership and possessive sense.\n”We also make bold to say that the Southern Governors’ declaration is a blanket statement lacking in precision and legally wrong."
  },
  {
    "headline": "At Least 100 Missing As Boat Capsizes In Niger",
    "summarized_story": "At least one hundred people are missing after a boat capsized on Malale River in Borgu Local Government Area of Niger State.\nThe boat capsized at about 3:00 pm on Wednesday.\nInga says a report from the NSEMA’s desk officer in the area indicates that 100 passengers were on board the ill-fated boat.\nCases of boat mishaps in Niger State have been on the rise in recent years.\nBetween 2019 and 2020, at least 50 people lost their lives on the Malale River following incidents of boat mishaps."
  },
  {
    "headline": "Delta State Govt Counters Accountant General, Denies Receiving £4.2m Ibori Loot",
    "summarized_story": "﻿The Delta State Government has denied receiving £4.2 million looted by its former governor, James Ibori.\nBut the truth is that the money has not hit the Delta State government’s account.\nHe assured that the Delta State government will ensure that the funds are judiciously utilised to improve infrastructure across the state, once received.\nThe loot – £4.2 million – was seized from the associates of convicted former Governor of Delta State, Ibori by the United Kingdom and recently returned to Nigeria.\nWe pay them their money.”ContradictionThe Accountant General’s response contradicts the earlier position of the Federal government on the recovered loot."
  },
  {
    "headline": "Why Libya’s Stability Matters To Us – Buhari",
    "summarized_story": "President Muhammadu Buhari says Nigeria is concerned about Libya’s stability because issues affecting the North African nation greatly impact the Lake Chad Basin, which in turn affects Nigeria.\nThe stability or instability of Libya will directly affect us.”Pleased to host the Chairman of the Presidential Council of Libya, HE Mohammed Younis Menfi, today.\nThe stability or instability of Libya directly affects us.\nREAD ALSO: Buhari Meets With Trump, Blames Killings On Libyan CrisisThe Libyan leader who said his country is making progress in the fight against insecurity informed President Buhari that Libya “now have one government, active on the ground”.\nREAD ALSO: Libya’s Instability Affects All Of Us In Sahel Region – BuhariA Region Facing ‘Severe Challenges’President Buhari had repeatedly linked the renewed crime wave in Nigeria to instability in Libya."
  },
  {
    "headline": "National Security Summit: Lawan, Gbajabiamila Identify Challenges, Seek Solutions",
    "summarized_story": "The National Security Summit commenced on Wednesday with leaders of the National Assembly seeking urgent solutions to insecurity confronting the nation.\nSpeaking at the summit which was held at the National Intelligence Agency (NIA), Abuja, Senate President Ahmed Lawan said the procurement processes by security agencies must be reviewed by the National Assembly.\nSenator Lawan said the security architecture of the country must be reviewed, for better results.\nThe lawmaker noted that there is no better investment than investing in security right now, maintaining that the non-functioning local government system and traditional system, are major challenges for the country.\nThe SGF believes Nigeria will overcome the security challenges and urged Nigerians to commit to a common endeavor in the national interest."
  },
  {
    "headline": "Nine Suspected Cultists Nabbed During Supremacy Battle In Ogun",
    "summarized_story": "Nine suspected cultists have been arrested during what the police say was a supremacy battle in the Ajegunle area of Ibogun, Ogun State.\nThe clash was between members of the Eiye and Alaro confraternities, according to the Spokesperson of the Ogun State Police Command, DSP Abimbola Oyeyemi.\nA cutlass, five knives, two axes, five phone batteries and N4,000 were among items the police said they seized from the suspects.\nThe Commissioner of Police in the state, Edward Ajogun, has ordered the transfer of the suspects to the Anti-Cultists Section of the State Criminal Investigation and Intelligence Department for investigation.\nHe also ordered a manhunt for the fleeing members of the group."
  },
  {
    "headline": "Wara Boat Mishap : 5 Corpses Recovered , 20 Persons Rescued So Far",
    "summarized_story": "Five corpses have so far been recovered from river Niger in Wara where an overloaded boat carrying over one hundred and fifty passengers capsized .\nChairman, Kebbi State Emergency Management Agency, Sani Dododo told our correspondent that twenty persons have been rescued.\nTen of the twenty rescued persons are admitted in the hospital while the remaining ten have all been discharged.\nAdvertisementHe said rescue effort in still ongoing."
  },
  {
    "headline": "£4.2m Ibori loot is still being awaited – Accountant General of the Federation",
    "summarized_story": "The Office of the Accountant General of the Federation (OAGF) says the true position of the regarding the widely circulated media report on the £4.2m Ibori Loot is that the money is still being awaited.\nThe issue of the £4.2m Ibori Loot according to a press statement from the Office of the Accountant General of the Federation signed by Henshaw Ogubike, Director Press and Public Relations has not been properly resolved.\nThe money according to the statement is still being awaited, after which the issues around it will be resolved before further action is taken.\nHe adds that the money has not been returned to Delta State.\nThe statement adds further that the explanation is without prejudice to the proceedings at the public hearing that took place yesterday during which the AGF was only making general comments about recoveries relating to State Governments."
  },
  {
    "headline": "Nigeria: Kaduna Governor El-Rufai Sacks 19 Appointees as Cull of Public Servants Begins",
    "summarized_story": "The Kaduna state governor, Mallam Nasir El-Rufai, has sacked 19 political appointees including Mr. Ben Kure, his Political Adviser.\nA Government House issued on Wednesday in Kaduna saidthe 19 disengaged appointees are the first phase of public servants disengaged in continuation of “rightsizing” of the state government workforce.\nAlso on the list are Halima Idris, Special Assistant Creative Arts, Aliyu Alhaji Salihu, Director General, Public Procurement Authority, Ashiru Zuntu, Special Assistant, Community Relations and Saida Sa’ad, a Senior Special Assistant.\nAlso disengaged, are Special Assistant Programmes, Elias Yahaya and Special Assistant to the Secretary to Kaduna State Government, Tasiu Suleiman Yakaii, Special Assistant on Economic Matters, Samuel Hadwayah and Senior Special Assistant Environment, Ahmed Mohammed Gero.\nThe statement said the 19 disengaged staff are the first phase of public servants who will depart the public service, in continuation of rightsizing of the state government workforce."
  },
  {
    "headline": "Nigeria: Members of Governing APC Singing Discordant Tunes, Acting as Opposition, Osoba Says – Arise News",
    "summarized_story": "A former Governor of Ogun State, Olusegun Osoba has said the conflicting opinions of members of the governing All Progressives Congress (APC) is affecting Nigeria negatively.\nMr Osoba stated this on Wednesday when he featured on ARISE News flagship programme, The Morning Show.\nHe said the position of the APC governors is at variance with Garba Shehu, the media handler of the Nigerian President.\nAccording to Mr Osoba, the APC governors as well as the spokesman of the President are members of the same government but act as opposition to the same government.\nHe cautioned Mr Shehu to be careful and weigh his words in terms of interventions."
  },
  {
    "headline": "CBN Governor Under Fire Over Comment On Insecurity And Purchase Of Fighter Jets -Trending with Ojy Okpe",
    "summarized_story": "Reactions have trailed the comment made by the Governor of the Central Bank Of Nigeria Godwin Emefiele who has come under fire on social media for saying that the country is expecting 12 fighter jets to help fight insecurity.\nIn the wake of the ban by the Southern Governors on Open grazing a video of a man lamenting how a herd of cattle Invaded a community in cross river state has made the rounds on social mediaAn African woman married to seven husbands who is also a traditional healer shares her story in this documentary by Afrimax which has now gone viral."
  },
  {
    "headline": "Syrians Vote in Election Set to Extend President Al-Assad’s Grip On Power",
    "summarized_story": "Al-Assad allies Iran and Russia, as well as Belarus, sent delegations to monitor the election.\nMeanwhile, the foreign ministers of the United States, United Kingdom, France, Germany and Italy issued a joint statement in which they described the polls as a sham.\n“For an election to be credible, all Syrians should be allowed to participate, including internally displaced Syrians, refugees, and members of the diaspora, in a safe and neutral environment,” the statement said.\nThe Syrian Democratic Council (SDC), which controls northeastern Syria, slammed al-Assad’s government for obstructing negotiations and meetings.\n“We will not be part of the presidential election process and we will not participate in it,” it said in a statement."
  },
  {
    "headline": "US Secretary of State Blinken Arrives in Egypt to Support Israel-Hamas Ceasefire",
    "summarized_story": "US Secretary of State Antony Blinken has arrived in Egypt on the next leg of a diplomatic mission aimed at strengthening a cease-fire that ended an 11-day war between Israel and Hamas.\nBlinken was scheduled to hold talks with Egypt’s President Abdel Fattah el-Sissi, Foreign Minister Sameh Shukry and the country’s chief spy Abbas Kamel.\nAhead of his departure, Blinken extended US President Joe Biden’s invitation to Israeli President Reuven Rivlin to visit the United States in the coming weeks.\nInstead, he expressed hope for creating a “better environment” that might lead to peace talks.\nIn a gesture to the Palestinians, Blinken on Tuesday announced plans to reopen the US consulate in Jerusalem — an office that historically handled diplomatic outreach to the Palestinians."
  }
]