[
  {
    "headline": "SERAP challenges Buhari to probe ‘missing’ N11tn electricity fund",
    "summarized_story": "), to investigate how over N11 trillion meant to provide regular electricity supply has been allegedly squandered by governments since 1999.\nThe letter, read in part, “The situation will not improve unless you fulfil your campaign promises to probe corruption in the electricity sector, prosecute perpetrators, and recover any missing public funds.\n“Your government has constitutional and international obligations to ensure regular and uninterrupted supply of electricity, even in times of resource constraints.\n“SERAP urges you to urgently implement documented reports of cases of corruption in the electricity sector, and ensure full accountability and restitution.\n“The failure of successive governments and high-ranking government officials to prevent corruption in the electricity sector and to bring suspected perpetrators to justice is the primary cause of the persistent crisis in the electricity sector, including the exploitation of electricity consumers, and collapse of the electricity grid.”Copyright PUNCH."
  },
  {
    "headline": "JUST IN: Sheriff pulls out of APC chairmanship race",
    "summarized_story": "A former Borno State Governor, Ali Modu-Sheriff, Sunday in Abuja, said he will pull out of the chairmanship race of the All Progressives Congress.\nThis is as he said he respects the decision of the party which has zoned the apex office to the Northcentral and also the President, Major General Muhammadu Buhari (retd.).\nHowever, he noted that he will throw in his hat if the party rescinds its decision to keep the chairmanship office solely in the Northcentral.\nSheriff’s decision comes barely one week before the national convention which holds on March 26.\nThe former Governor who comes from the Northeast zone had expressed interest in the party’s apex seat before the zoning decision released about two weeks ago by the Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee."
  },
  {
    "headline": "Delta 2023: They want to disgrace me, but God will disgrace all of them — Ibori",
    "summarized_story": "IboriBy Paul OlayemiChief James Onanefe Ibori, former governor of Delta State on Saturday has sounded a note of warning to those plotting to undermine his influence in Delta politics, saying those who want to disgrace him, will be shamed by God.\nHe warned that those planning to undermine him, in an attempt to disgrace him at the poll will be disgraced by God.\nIbori, therefore, urged party leaders and stakeholders to support Amori’s senatorial ambition, noting that support for Amori is a support for him.\nPlease, support me to send Senator Ighoyota Amori to the Senate.\nPlease, join hands with me and join hands with Senator Amori to the Senate”, he pleaded."
  },
  {
    "headline": "Epileptic grid: SERAP gives Buhari 7 days to probe missing N11trn electricity fund",
    "summarized_story": "Generation capacity has dropped to 2,000 megawatts with about 14 power plants shutting down.\nIn the letter dated 19 March, 2022 and signed by SERAP deputy director Kolawole Oluwadare, the organisation said: “Nigerians have for far too long been denied justice and the opportunity to get to the bottom of why they continue to pay the price for corruption in the electricity sector–staying in darkness, but still made to pay crazy electricity bills.”SERAP said: “The staggering amounts of public funds alleged to have been stolen over the years in the electricity sector have had catastrophic effects on the lives of millions of Nigerians, akin to crimes against humanity against the Nigerian people.”According to SERAP, “Investigating the allegations of missing N11 trillion electricity funds, prosecuting suspected perpetrators and recovering any missing public funds would end a culture of impunity.\nIf we have not heard from you by then, SERAP shall consider appropriate legal actions to compel your government to comply with our request in the public interest.”“The failure of successive governments and high-ranking government officials to prevent corruption in the electricity sector and to bring suspected perpetrators to justice is the primary cause of the persistent crisis in the electricity sector, including the exploitation of electricity consumers, and collapse of the electricity grid.”“SERAP notes that in your inaugural speech on May 29, 2015 you stated that, ‘it is a national shame that an economy of 180 million generates only 4,000MW, and distributes even less.\nWe will not allow this to go on.’ The national grid collapse suggests that this promise remains unfulfilled.”“The African Commission on Human and Peoples’ Rights has adjudged the failure of the States to provide basic services such as electricity as violating the right to health.”“Corrupt officials and corrupt contractors in the electricity sector know well that their conduct is criminal and injurious, and the denial of human dignity coupled with a radical breach of solemn trust, aggravate their alleged crime.”“Citizens are frustrated at persistent allegations of corruption in the sector, and the impacts on their human rights.\nProsecuting perpetrators would address the grave travesty that has for many years occurred in the power sector.”“Impunity for corruption in the electricity sector has for many years forced ordinary Nigerians to stay in darkness, but still made to pay crazy electricity bills.”“Successive governments have failed to increase power generation and provide Nigerians with regular and uninterrupted electricity supply, with many electricity contracts shrouded in secrecy, and trillions of Naira going down the drain.”“Impunity for corruption in the electricity sector will continue as long as high-ranking public officials go largely unpunished for their alleged crimes."
  },
  {
    "headline": "[BREAKING] APC Convention: Modu Sheriff steps down from race",
    "summarized_story": "Omeiza Ajayi, AbujaFormer Governor of Borno state, Senator Ali Modu Sheriff has stepped down from the national chairmanship race ahead of Saturday’s national convention of the ruling All Progressives Congress APC.\nIn a brief chat Sunday in Abuja, Sheriff said he was stepping aside due to the zoning arrangement in the party which has ceded the office to North Central.\nSheriff who is from the North East however said he would rejoin the race should the party change its mind between now and Friday.\nDetails later…."
  },
  {
    "headline": "Russia-Ukraine war will affect Nigerian economy – Ex-NIDOA official",
    "summarized_story": "Key told the News Agency of Nigeria (NAN) in New York on Sunday that the crisis would affect Africa’s economy and also threaten the global economy.\nShe said Russia’s invasion of Ukraine had led to a sharp rise in global oil prices amounting to almost 100 dollars per barrel and counting if the tension deepens.\n“This development without a doubt will pose high implications for the Nigerian economy as the largest oil-producing country in Africa.\nBy extension, Africa will also feel the impact as its largest economy is affected.\nThe official said the conflict could be a blessing in disguise, noting that the conflict presently brings about an increase in global oil prices."
  },
  {
    "headline": "STATE OF THE NATION: Resign, hand over to Osinbajo, Ortom tells Buhari",
    "summarized_story": "On insecurity, Ortom explained that the basic responsibility of any government was the provision of security for lives and property.\nAccording to him, “the level of insecurity in the country today is worrisome.\n“It is really unfortunate that I have over 1.5 million IDPs in Benue State out of the projected seven million population of the state.\nMoreso, more than 80 percent of the IDPs are farmers that earned us the appellation of the food basket of the nation.\nWe will complement the security agencies but we are not going to compromise our peace and security again”, he opined."
  },
  {
    "headline": "2023: Who were your parents, we knew Saraki’s wealthy father – Omokri challenges Tinubu",
    "summarized_story": "The source of wealth of a former Governor of Lagos State, Asiwaju Bola Tinubu, has again come under heavy scrutiny.\nHe noted that former Senate President Saraki had a wealthy father, while Kalu may have become wealthy through his numerous businesses, but wondered how the national leader of the All Progressives Congress, APC, accumulated his wealth.\nOmokri raised this in a video he shared on YouTube, where he tried to provide some reasons Nigerians should reject Tinubu and everything he stands for come 2023.\nIn his words, “Bola Tinubu is fabulously wealthy.\n“All we know is that he worked in Mobile or even Chevron, so, where did all the money come from?"
  },
  {
    "headline": "RCCG political dept: What will happen if Shari’ah Council considers Tinubu’s advice – Shehu Sani",
    "summarized_story": "Shehu Sani, a former Kaduna Central Senator, has reacted to calls by National Leader of the All Progressives Congress, APC, Bola Tinubu, urging the Supreme Council for Shari’ah in Nigeria to create a department of political affairs ahead of the 2023 general elections.\nTinubu made the call at the Annual National Conference and Pre-Ramadan meeting of the Supreme Council for Shari’ah in Nigeria (SCSN) which was held in Osogbo, Osun State capital.\nAccording to him, the move to establish a political wing among them, would help to mobilize support for the faithful who are vying for different political positions.\nReacting, Shehu Sani who kicked against the idea, said once religious groups in the North create a political department, it will be a breeding unit for fanatical religiously-crafted political ideas in pursuit of a theocratic State.\nHe wrote on Twitter, “Once religious groups in the North begins to set up political departments, it’s not just going to be ‘a department’ like in the RCCG, it’s going to be a breeding unit for fanatical religiously-crafted political ideas in pursuit of a theocratic State."
  },
  {
    "headline": "Gov. Lalong’s aide loses step-brother to terrorists",
    "summarized_story": "One Fwangshak Plang, a step-brother of the Special Adviser on Public Affairs to the Plateau State Governor, Diket Plang has been assassinated in Pankshin Local Government Area of the State.\nDAILY POST gathered that the assailants, suspected to be kidnappers, invaded Takas village on Friday night, seriously wounded late Plang, leading to his death.\nA source in the community explained that the attackers invaded the home of the governor’s aide and kidnapped his step-mother and a girl.\nThe source added, “It was on Friday night that the gunmen came and attacked the house of Diket Plang, who is a special adviser to the governor.\n“When they (kidnappers) arrived at his house in Takas that night, the governor’s aide was not in the house at the time."
  },
  {
    "headline": "Russia-Ukraine war: Time will prove our position – China",
    "summarized_story": "China’s Foreign Minister, Wang Yi, has said that “time will prove that China’s position is on the right side of history” amid the ongoing war between Russia and Ukraine.\nWang Yi disclosed this on Sunday while speaking with reporters, according to a statement from the Ministry of Foreign Affairs.\n“China will continue to make independent judgments based on the merits of the matter and in an objective and fair attitude.\n“We will never accept any external coercion and pressure, and we also oppose any groundless accusations and suspicions against China,” the statement added.\nOnly in this way can long-term stability on the European continent be achieved.”Recall that the war between Ukraine and Russia began in February."
  },
  {
    "headline": "Examination Misconduct: Kogi Poly expels 15 students",
    "summarized_story": "The management of Kogi State Polytechnic, Lokoja, has approved the expulsion of fifteen (15) students over examination misconduct and other related offences.\nThe expulsion of the 15 students was sequel to the decision of the academic board of the institution, having considered the report of the Central Examination Misconduct Committee.\n“The fifteen (15) students were found to have contravened relevant sections of the Students’ Information Handbook and were variously recommended by the Central Examination Committee for disciplinary action as a deterrent measure to others,” the Polytechnic’s Public Relations Officer, Mrs Uredo Omale said.\nOmale, who disclosed this in a statement sent to DAILY POST on Saturday, said the offences included impersonation, bringing of illicit materials that were relevant into the examination hall, among others.\nThe statement added that the Rector and Chairman of the Academic Board, Dr. Salisu Ogbo Usman seized the opportunity to admonish the students to be law-abiding, as no stone would be left unturned to ensure absolute law and order in and around the campuses of the Kogi State Polytechnic."
  },
  {
    "headline": "IPOB: We’re ready to work with Soludo, other govs",
    "summarized_story": "Indigenous people of Biafra (IPOB) has assured its full support to Southeast governors ready to work for the interest and liberty of the people of the region.\nThe group, in a statement by its Media and Publicity, Emma Powerful, particularly expressed its preparedness to work with Anambra State governor, Prof. Chukwuma Soludo to secure the State and make it envy of black race.\nThe statement reads in part, “Our attention has been drawn to an encouraging statement by the new Governor of Anambra State, Professor Chukwuma Soludo during his inauguration.\n“We, therefore, assure him of the full cooperation of Biafran youths in his efforts to secure Anambra State.\n“We are ready to work with anyone in Government who works for the interest and liberty of our people.”"
  },
  {
    "headline": "NDLEA arrests father of four with 20.75kg black liquid cocaine in Abuja",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) has arrested a 52-year-old father of four, Okeke Adolphus Anayochukwu, with black liquid cocaine at the Nnamdi Azikiwe International Airport (NAIA).\nDirector, Media and Advocacy, NDLEA Headquarters, Abuja, Femi Babafemi, who disclosed this in a statement on Sunday, said this was the first time such has happened.\nIn Anambra, NDLEA operatives on Thursday 17th March intercepted a bus with reg.\n“The previous day, Wednesday 16th March, narcotic officers in Ogun state recovered 865.2kg of cannabis sativa around Otapele- Obada road in Imeko-Afon LGA.\n“Same day, operatives in the state arrested Bello Ibrahim, 38, with 312.4kg of cannabis Sativa at Ogere tollgate, Ikenne LGA."
  },
  {
    "headline": "BREAKING: Sheriff steps down from APC chairmanship race",
    "summarized_story": "Former governor of Borno State, Senator Ali Modu Sheriff has formally withdrawn from the national chairmanship race of the ruling All Progressives Congress (APC).\nSheriff made this declaration on Sunday in Abuja.\nThe frontline politician said he made the decision after the party zoned the office of the national chairman to the North Central region as he is from the North East region.\nDetails shortly…"
  },
  {
    "headline": "DSS raises the alarm over planned violence in North Central",
    "summarized_story": "The Department of State Services (DSS) has alerted the public of plans by some persons to cause violence in parts of the country particularly the North Central.\nPublic Relations Officer, Department of State Services, National Headquarters, Dr Peter Afunanya, in a statement on Saturday evening, said the aim is to cause ethno-religious crisis, ignite reprisals and heat up the polity.\nRead Also: Soldier allegedly shot by DSS operatives dies in Lagos hospitalThe Statement reads, “The Department of State Services (DSS) hereby alerts the public of a sinister plan by some elements to stoke violence in parts of the country particularly the North Central.\n“Citizens are advised not only to engage according to rules but should resist persuasions to be used to destroy their own country.\nThose who may wish to go contrary to the law will, however, face the consequences.”"
  },
  {
    "headline": "Electoral Act: NASS seeks legal advice, may challenge court ruling",
    "summarized_story": "The National Assembly is already seeking legal advice on the next steps.\n“Neither the two chambers of the National Assembly nor the Independent National Electoral Commission (INEC) was joined in a fundamental suit like this.\nTo that extent, section 84 (12) of the Electoral Act was annulled on a very faulty ground.\n*Why were the National Assembly and Independent National Electoral Commission not joined as parties to the suit?\n“The Electoral Act has just come into force and there are many issues that have been embedded in the Act."
  },
  {
    "headline": "Ali Modu Sheriff quits race for APC national chairman",
    "summarized_story": "From Romanus Ugwu, AbujaFormer Governor of Borno State, Ali Modu Sheriff (SAS), has formally announced his withdrawal from the national chairmanship race of the All Progressives Congress (APC) ahead of the party’s national convention this week.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nClick here to see how you too can get paid .\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nHe said that he will however renew his interest should the leadership of the party change their decision on zoning and announce the extension in the sale of the nomination forms."
  },
  {
    "headline": "Kogi erupts as Natasha defects to PDP with thousands of supporters",
    "summarized_story": "From Emmanuel Adeyemi, LokojaIn what many have described as a terrible blow to the ruling All progressives Congress (APC) in Kogi State, Natasha Akpoti Uduaghan, ‘the Amazon of Kogi politics’, officially defected to the People’s Democratic Party (PDP) with thousands of her supporters on Saturday.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe PDP chairman commended the people of the state for their resilience in standing against the misfortune of the ruling APC saying, with the calibre of defectors, the people have resolved to reclaim the state.\nIn her speech, Natasha explained that her joining the PDP was to seek a more formidable platform to wrestle power from the APC.\nShe solicited the support of all well-meaning party members to see the defection as a service to the people of the senatorial district and the entire state."
  },
  {
    "headline": "APC convention: Unity list, micro-zoning, consensus pose fresh challenges",
    "summarized_story": "From Romanus Ugwu, AbujaThe inability of several geo-political zones to agree on an acceptable micro-zoning formula and the plans to raise unity list by certain party cabals, among others, are some of the challenges confronting this week’s proposed national convention of the All Progressives Congress (APC).\nCuriously, most of the aspirants that returned their expression of interest and nomination forms to the party’s national secretariat, admitted collapse in the attempts to agree on acceptable micro-zoning arrangements.\nI saw a video of someone saying that the governor said a consensus has been made.\nAsked which mode of election, direct, indirect or consensus, he would prefer for the APC to adopt, he said: “I am a democrat.\nBeyond the disagreements in arriving at common ground on consensus and micro-zoning of the national offices, the apprehension and anxiety trailing the anticipated release of unity list few days ahead of the convention this week has become very palpable."
  },
  {
    "headline": "2023: Fresh anxiety in PDP over presidential zoning",
    "summarized_story": "From Ndubuisi Orji, AbujaThere is fresh anxiety in the Peoples Democratic Party (PDP) over the zoning of the party’s 2023 presidential ticket as leaders of the party continue to disagree on whether the ticket should be zoned or thrown open.\nThe PDP commenced the sale of nomination forms for all aspirants seeking to contest the 2023 polls on its platform on March 17.\nIn recent times, there have been controversy on whether or not the PDP should zone its presidential ticket for the next general election or throw it open to all qualified aspirants.\nWhile the zoning committee will submit its report in two weeks.\n“So, what happens if the committee decides to zone the presidential ticket to a particular part of the country?"
  },
  {
    "headline": "Horror in Imo as gunmen bomb Ohanaeze PG home, police division",
    "summarized_story": "The gunmen, it was gathered, threw explosives at Prof Obiozor’s home to set his house ablaze.\nAlso, in the early hours of Saturday, unknown gunmen attacked the Police Divisional headquarters at Umuguma, Owerri-west Local Government Area of Imo State, killing two police officers.\nThe gunmen also razed the roof of the station and seven vehicles, including police operational vehicles parked in the station.\nMeanwhile, the Imo State government has condemned the razing of the home of the Ohanaeze President General, calling the perpetrators of the evil act political bandits.\nKalu, while urging the Ohanaeze President General to be calm, admonished security agencies to live up to expectations by exposing the perpetrators of the incident."
  },
  {
    "headline": "Ahead of National Convention, APC Begins Screening of Aspirants Today",
    "summarized_story": "APC 2022 National Convention Screening Committee headed by the Kastina State Governor, Hon.\nThe 69-year-old businessman-turned-politician is also keen on becoming the next APC chairman.\nHe is believed to have been anointed as the consensus national chairman but the other contestants have refused to accept his nomination.\nAdebayo ShittuA former Minister for Communication, Alhaji Adebayo Shittu is the first person to indicate interest in the office of APC National Secretary.\nIfe OyedeleExecutive Director, Niger Delta Power Holding Company (NDPHC), Mr. Ife Oyedele, is another aspirant for the office of APC National Secretary."
  },
  {
    "headline": "CSO Accuses Desperate Politicians of $1 Million Smear Campaign Plot against Buhari, Emefiele",
    "summarized_story": "Others include the Yoruba Council of Youths, Igbo Youth Movement, Middle Belt Youth Movement, South East Youth Assembly and Lawyers in Defence of Democracy.\nSNP Convener, Mr Peter Abang, said they alerted the public to disregard the smear campaigns once they kicked off.\nHe concluded that Emefiele had contained and dealt with a 60 per cent decline in the price of crude oil.\n“The good people of Nasarawa State benefited so much from the good stewardship of the current CBN Governor.\nNasarawa is the home of solid minerals; Mr Emefiele’s policies of diversification invested so much in solid mineral resources and agriculture."
  },
  {
    "headline": "Game on, Court Vacates Order Stopping APC’s Convention, Akpanudoedehe Returns",
    "summarized_story": "Justice Kawu vacated the order stalling APC’s National Convention following an application by the party to that effect.\nThere were allegations that Buni had perfected plans to scuttle the party’s national convention in order to remain as Caretaker Chairman.\nNasir el-Rufai, Governor of Kaduna, on March 9, alleged that Buni’s lawyers colluded with a petitioner to “destroy” the National Convention.\nHe described the said court order as a “hidden nuclear weapon” that would have hampered the party’s chances in the 2023 general election.\n“We are now at the finishing line in the preparations for our National Convention, which is at hand."
  },
  {
    "headline": "Awka Monarch: Ebelechukwu Obiano Has Desecrated Kingdom By Fighting Bianca, Says Serious Consequences Loom",
    "summarized_story": "A fight that broke out last Thursday between the two women during the inauguration of Professor Charles Soludo as Governor resulted in Bianca slapping Ebelechukwu.\nEze Ndigwe also ordered Ebelechukwu to apologise to Bianca within seven days to avoid consequences.\nThe Obi of Awka, in his press release, said he had given Ebelechukwu seven days to publicly apologise to the entire Igbo people or face serious consequences.\nHe added that a study of the scenario showed that Mrs. Obiano’s action was deliberate, as she came very much prepared to disrupt the swearing in ceremony.\nBianca endorsed Obiano and called on all APGA members, including then Governor Obi to support him."
  },
  {
    "headline": "Malami Celebrates as Court Annuls Section of Electoral Act Barring Political Appointees",
    "summarized_story": "The judge, accordingly, ordered the AGF to forthwith delete Section 84(12) from the Electoral Act.\n“The provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be treated accordingly.\n“By virtue of section 318 of the Constitution, political appointees are not included in the list of persons employed in the public service.\nTo that extent, section 84 (12) of the Electoral Act was annulled on a very faulty ground.\n811) 540 Ojonye V. Onu & ORS (2018) LPELR-44223) where the appellate Courts have held that political appointees or political office holders are not public servants as provided for under the Constitution.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: How Attorney-General Malami, Amaechi, Emefiele Procured Court Order Deleting Section 84(12) Of Electoral Act, To Safeguard Their Political Ambitions",
    "summarized_story": "SaharaReporters earlier today reported that the court sitting in Umuahia, Abia State, ordered the Office of the Attorney-General of the Federation to immediately delete Section 84 (12) of the Amended New Electoral Act.\nHowever, top sources revealed to SaharaReporters on Friday night that Malami was the brains behind the court order obtained from Abia State.\n“The judgment of the Court will be recognized by the Government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\n“The provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be so treated accordingly."
  },
  {
    "headline": "EXCLUSIVE: How Attorney-General Malami, Amaechi, Emefiele Procured Court Order Deleting Section 84(12) Of Electoral Act, To Safeguard Their Political Ambitions",
    "summarized_story": "SaharaReporters earlier today reported that the court sitting in Umuahia, Abia State, ordered the Office of the Attorney-General of the Federation to immediately delete Section 84 (12) of the Amended New Electoral Act.\nHowever, top sources revealed to SaharaReporters on Friday night that Malami was the brains behind the court order obtained from Abia State.\n“The judgment of the Court will be recognized by the Government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\n“The provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be so treated accordingly."
  },
  {
    "headline": "Anti-graft Agency, EFCC Moves Ex-Anambra Governor, Obiano From Lagos To Abuja For Interrogation",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has moved former Anambra Governor, Willie Obiano to its headquarters in Abuja.\nGovernor Willie ObianoUwajaren said Obiano was still in detention and not released as reported by some newspapers.\nSee Also Breaking News BREAKING: Anti-graft Agency, EFCC Arrests Ex-Anambra Governor, Obiano At Lagos AirportObiano is also being probed over some suspicious projects, including the Umueri International Airport project whose cost was believed to be inflated.\nEFCC operatives had picked him up at the Murtala Muhammed International Airport, Lagos, around 08:30 pm on Thursday.\nHe was on his way to Houston, Texas, US, after handing over to his successor, Governor Charles Soludo."
  },
  {
    "headline": "Anti-graft Agency, EFCC Moves Ex-Anambra Governor, Obiano From Lagos To Abuja For Interrogation",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has moved former Anambra Governor, Willie Obiano to its headquarters in Abuja.\nGovernor Willie ObianoUwajaren said Obiano was still in detention and not released as reported by some newspapers.\nSee Also Breaking News BREAKING: Anti-graft Agency, EFCC Arrests Ex-Anambra Governor, Obiano At Lagos AirportObiano is also being probed over some suspicious projects, including the Umueri International Airport project whose cost was believed to be inflated.\nEFCC operatives had picked him up at the Murtala Muhammed International Airport, Lagos, around 08:30 pm on Thursday.\nHe was on his way to Houston, Texas, US, after handing over to his successor, Governor Charles Soludo."
  },
  {
    "headline": "2023: Create Political Departments To Support Muslim Candidates, Counter Other Religious Groups —Tinubu Urges Islamic Leaders",
    "summarized_story": "A presidential aspirant of the All Progressives Congress, APC, Bola Tinubu, has urged the Supreme Council for Shari’ah in the country to create the department of political affairs to create political awareness among faithful towards producing a Muslim president in 2023.\nBola TinubuThe Redeemed Christian Church of God (RCCG) recently established a directorate to oversee political aspirants in the church and to monitor their success.\nHe said, “Other religious groups have commenced political sensitisation by creating political departments or directorate among themselves to promote their own.\n“Through the president of the Supreme Council for Shari’ah in Nigeria, I will visit all states of this nation.\nThe political leadership promised a whole lot, they promised to reduce fuel prices, build new refineries but today, there is no fuel anywhere and the masses are suffering."
  },
  {
    "headline": "APC chairmanship: Sheriff steps down, says he can’t work against Buhari",
    "summarized_story": "Ali Modu Sheriff, a former governor of Borno state, says he will no longer contest the national chairmanship position of the All Progressives Congress (APC).\nHe, however, added that he would contest if the party decided to throw the contest open between Sunday and Friday.\n“Being someone who respects the rule of law and the leaders of the party, the president has taken a position.\nAdvertisement“I respect the president as my leader, and he must have a reason why the national chairman is zoned to the North-central.\nAdvertisementHe said the APC, at the moment, requires a national chairman who enjoys massive political goodwill across party lines with the capacity to drive development at all levels."
  },
  {
    "headline": "APC chairmanship: Sheriff steps down, says he can’t work against Buhari",
    "summarized_story": "Ali Modu Sheriff, a former governor of Borno state, says he will no longer contest the national chairmanship position of the All Progressives Congress (APC).\nHe, however, added that he would contest if the party decided to throw the contest open between Sunday and Friday.\n“Being someone who respects the rule of law and the leaders of the party, the president has taken a position.\nAdvertisement“I respect the president as my leader, and he must have a reason why the national chairman is zoned to the North-central.\nAdvertisementHe said the APC, at the moment, requires a national chairman who enjoys massive political goodwill across party lines with the capacity to drive development at all levels."
  },
  {
    "headline": "Four gunmen killed in yet another attack on Imo police station",
    "summarized_story": "The Imo police command says it killed four gunmen suspected to be members of the Indigenous People of Biafra (IPOB) during a fresh attack at the Omuma divisional police headquarters in the Oru east LGA.\nThe gunmen reportedly attacked the police station in the early hours of Sunday.\nThe attack comes 24 hours after gunmen razed the Umuguma divisional police headquarters in Owerri West LGA of the state, killing one person and burning vehicles in the vicinity.\nAbbatam said the gunmen were repelled by the security operatives who engaged them in a gun duel, killing the four suspects while the others escaped with gunshot wounds.\nThere was no casualty on the side of the joint security operatives."
  },
  {
    "headline": "Four gunmen killed in yet another attack on Imo police station",
    "summarized_story": "The Imo police command says it killed four gunmen suspected to be members of the Indigenous People of Biafra (IPOB) during a fresh attack at the Omuma divisional police headquarters in the Oru east LGA.\nThe gunmen reportedly attacked the police station in the early hours of Sunday.\nThe attack comes 24 hours after gunmen razed the Umuguma divisional police headquarters in Owerri West LGA of the state, killing one person and burning vehicles in the vicinity.\nAbbatam said the gunmen were repelled by the security operatives who engaged them in a gun duel, killing the four suspects while the others escaped with gunshot wounds.\nThere was no casualty on the side of the joint security operatives."
  },
  {
    "headline": "'A booby trap' -- Kayode Ajulo warns APC over court verdict on Kayode Ajulo warns APC over court verdict nullifying section 84 (12)",
    "summarized_story": "Kayode Ajulo, a human rights lawyer, has faulted the court ruling that ordered the removal of section 84 (12) of the amended Electoral Act, 2022.\nAjulo stated this in a post released on Saturday on the nullification of section 84(12) of the electoral act.\nBACKSTORYOn February 25, President Muhammadu Buhari assented to the electoral act amendment bill.\nOn March 9, the senate rejected the president’s request to amend the clause in the electoral act.\nWhy were the national assembly and Independent National Electoral Commission not joined as parties to the suit?” he asked."
  },
  {
    "headline": "Google’s Africa internet cable to first arrive in Togo",
    "summarized_story": "Google has announced that Equiano, a subsea internet cable running through Portugal to South Africa, will first land in Togo.\nThis announcement marks a milestone in Google’s plan to provide affordable internet access in Africa by building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nLast October, Google CEO Sundar Pichai announced a plan to invest $1billion over 5 years to support digital transformation in Africa, of which project Equiano is part of.\nNitin Gajria, Managing Director of Google Sub-Saharan Africa commented, “The landing of Equiano affirms Google’s commitment to the African continent, to support Africa’s digital transformation.\nThe shutdown of Google’s Project Loon brought up questions about the fate of Google’s other internet projects targeted at Africa."
  },
  {
    "headline": "Digital Nomads: The Nigerians escaping Ukraine’s war",
    "summarized_story": "Students, all of whom are given temporary residence permits, can work unofficially or do small businesses by registering as private entrepreneurs.\n“I finished last year, and I was going to leave Ukraine this year.\nYou can’t get out that easily.”A day after Russia’s invasion, Ukraine’s president Volodymyr Zelenskyy instituted martial law and grounded commercial flights.\n“I was already applying for visas to leave Ukraine for the UK where my brother is.”Kemi’s journey is not so certain.\nIf you think your story fits the Digital Nomads bill, reach out to us here."
  },
  {
    "headline": "Big Cabal Media raises $2.3m to expand its compelling line of digital products",
    "summarized_story": "In 2021, venture capital invested $115 million in digital media globally, a tenth of the $1.1billion it funded in 2015, but not much came to Africa.\nToday, one of such exceptions, Big Cabal Media (BCM), a leading African digital media company, has announced a $2.3 million Seed funding round, emphasising its commitment to keep building exciting and authoritative media products and brands.\nBCM’s progress over the years and recent fundraise is a noteworthy example of the possibilities and opportunities in Africa’s digital media sector.\nOf the reported $4.3–$5 billion raised by African startups in 2021 whereby fintech received 53–63% of the volume, digital media companies are one of many sectors that have traditionally been overlooked in the conversation of tangible ventures.\n“Investing in Africa’s booming digital media sector aligns perfectly with MaC’s mission of supporting exceptional entrepreneurs building valuable technology companies that leverage shifts in cultural trends and behaviours."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Did you miss Apple’s first event of the year?\nI did, but I saw a recap and the best way to describe my reaction is..."
  },
  {
    "headline": "Big Cabal Media’s seed funding",
    "summarized_story": "This means that sharing your Netflix password with someone else may soon become expensive, as account sharing will incur an additional fee.\nToday, I’ll be discussing:Dream VC’s pipeline planBig Cabal Media’s seed fundingDream VC’s pipeline planNowadays, it appears that many people want to work in technology companies.\nHowever, only a small percentage are familiar with the Venture Capital (VC) industry.\nInterestingly, venture capital funding only became common in the last decade, leaving a considerable talent gap, which Dream VC was founded to fill.\nBig Cabal Media’s seed fundingIf you are on Twitter, you might likely have read content from Zikoko, TechCabal, or both."
  },
  {
    "headline": "Inside Dream VC’s plan to build a pipeline for African VC talent",
    "summarized_story": "However, very few understand or are even aware of the venture capital space, but Mark Kleyner and Cindy Ai want to demystify the space with Dream VC.\nInterestingly, VC funding only became common in the past decade, and so there is a gaping talent hole, which Dream VC was launched to fill.\nThe goal was to help them break into the VC space,” he added.\nHaving tested their hypothesis, Dream VC would be launching two programmes: the Launch into VC Program and the Investor Accelerator Program.\nLaunch into VC is a fully remote 13-week programme targeted at early-stage professionals looking to break into the VC space."
  },
  {
    "headline": "African B2B eCommerce on growth streak",
    "summarized_story": "The eCommerce startup also got a makeover, changing its name from Sokowatch to Wasoko, meaning people of the market.\nThe B2B model: Like TradeDepot, Alerzo and other eCommerce startups that have raised funds from 2021, B2B is the dominant model.\nAs B2B continues to be the go-to model for eCommerce in Africa, only time will tell how sustainable it is.\n4G Capital’s $18m fundingKenyan fintech startup, 4G Capital, has raised $18 million in a Series C round led by Lightrock.\nA touch of eCommerce: 4G Capital plans to roll out new products, including an app, later this year."
  },
  {
    "headline": "What you need to know about Nigerian actors in Bel-Air",
    "summarized_story": "What you need to know about Nigerian actors in Bel-AirThe 2022 reboot of ‘Fresh Prince of Bel-Air’ one of the most popular TV series of the ’90s titled Bel-Air aired on February 13, 2022 on American streaming platform Peacock.\nBusinessDay takes a look into the life and career of Akingbola and Sholotan the Bel-Air actors with Nigerian roots.\nThe British-Nigerian actor has won a good number of awards for works on British series like Blue/Orange, Rev, and Holby City.\nSome of his awards are TMA Awards Best Supporting Actor 2005, BEFFTA Awards best TV actor, and best Film actor in 2010, Nigerian Entertainment & Lifestyle Awards Best TV actor, and Movie, Video & Screen Awards Best Comedy Performance in TV both in 2012, and many others.\nIn 2022 he landed the role of Charlton in the reboot of the popular 90s series Bel-Air which aired in mid February 2022."
  },
  {
    "headline": "2023: How we plan to surmount challenges – INEC",
    "summarized_story": "Festus Okoye, INEC National Commissioner and Chairman of Voter Education Committee, said: “The 2023 general election will come with challenges and the Commission is determined to surmount these challenges and conduct free, fair, credible and inclusive election.\n“Growing insecurity in several parts of the country and the increasing number of IDPs will pose the biggest challenge to the conduct of the 2023 general election.\nThe group bemoaned the inability of INEC to release results on time due to logistic challenges.\nHe expressed confidence that the Commission would overcome electricity and security challenges plaguing the country during next year’s general election.\nNo matter how prepared the INEC claims to be, the umpire always falters and the 2023 election will not be different,” he disclosed."
  },
  {
    "headline": "Meet P.Priime: From Sarz Academy to Carpe Diem to V",
    "summarized_story": "In a competitive and fickle industry, BusinessDay examines how a Sarz Academy graduate becomes the guy everyone wants on their team.\nHe has collaborated with artists such as Olamide in recent years, creating the majority of the tracks on his Carpe Diem album.\nBased on his prior work, this album is a testament to what P.Priime can do with an album.\nWhile there is a defined reward system for producers and songwriters in other places like the US and UK, this has not been the case for most Nigerian music producers.\nThey may need to hire a manager or lawyer who is familiar with the music industry to keep an eye on the method by which they are compensated after collaborating with artists."
  },
  {
    "headline": "Edo offers property developers 2-week window for issuance of free building plans …begins farming season March 25 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government, as part of efforts at ensuring all property in the state are with building plans, is offering property developers a 2-week window for issuance of free building plan permits.\nShe noted, “The ‘Operation show you building plan’ seeks to encourage all land developers and those building to come for their building plan in the ministry.\nThe objective of the exercise is to capture all into the Edo State Master Plan as it’s necessary for development.\nThis year’s farming season should be taken seriously as there will be an interface between farmers and off-takers.\n“The disease is a pandemic that is still ravaging some communities across local government areas in Edo State."
  },
  {
    "headline": "AAU VC Lauds Outgoing Registrar – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestTHE acting Vice Chancellor of the Ambrose Alli University, (AAU), Ekpoma, Edo State, Prof. Sonnie Adagbonyin has showered encomiums on the outgoing acting Registrar of AAU, Mr. Edward Aihevba for his outstanding achievements in office.\nHe gave the commendation while speaking at the Second Registry Lecture of the institution, titled: Administrative Imperatives for Universities: A case Study of Ambrose Alli University; delivered by the outgoing acting Registrar, Mr. Edward Aihevba.\nThe acting vice chancellor asserted that the outgoing Registrar in his short time in office recorded numerous achievements which were of benefit to the staff, students and the university in general.\nPraised the registry department and outgoing Registrar for the registry lecture initiative, and called on other departments of the university to emulate the registry department by organising similar lectures for staff members.\nHe explained that the registry lecture was introduced in his time as acting Registrar because of his desire to broaden and sharpen the administrative skills of staff of the registry for optimum performance."
  },
  {
    "headline": "Obaseki partners centre on construction of Benin Cultural Village, assures policies to preserve Edo heritage – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has assured support for the construction of the Benin Cultural Village, being built by the Benin Cultural Heritage Centre (BCHC), reassuring that his government will sustain policies and reforms to preserve the state’s rich cultural heritage.\nObaseki, who received the executives and members of the Benin Cultural Heritage Centre on a courtesy visit at the Government House, said his government is paying critical attention to the state’s cultural assets to boost social-economic activities in the culture and tourism sector.\nWe have huge plans for our history and cultural heritage as this administration has a lot to showcase, knowing it can drive our Internally Generated Revenue (IGR) in Edo State.\n“Our governor is very passionate about our cultural heritage.\n“We have trained 300 teachers in Edo language and the government has employed them.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo Community head send SOS to Security Agencies – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe people of Ogheghe Community, Uhuowmonde Local Government Area of Edo State has notified security agencies in the state over the planned attacked by some evil doers been spearheaded by the current chief priest Samuel Emokpae.\nPa Kingsley Iziengbe Amayo in a statement personally singed by him said the community has endured lasting peace since August 2017 judgment by His Royal Majesty, Oba Ewuare II.\nAccording to the statement; Priest Samuel Emokpae from all indications is bent on sabotaging the peace that we have been enjoying for the past four years.\nThe Community still and will continue to abide by the judgment of 15 August 2017 as pronounced by our Royal Majesty.\n” All we want is that various security agencies including the Nigerian Police and Army to take note of this threat by Priest Emokpae before it degenerate to crisis."
  },
  {
    "headline": "NNPC to deduct N242.53bn fuel subsidy from FAAC this month",
    "summarized_story": "The Nigerian National Petroleum Company (NNPC) Limited will deduct N242.53 billion from the Federation Account this month for fuel subsidy.\nThe NNPC disclosed this in its latest presentation to the FAAC meeting, which was obtained by our correspondent in Abuja on Friday, PUNCH reported.\n“The December 2021 value shortfall recovery on the importation of PMS amounted to N210.38bn,” it said.\n“The recovery consists of December 2021 value shortfall of N176.48bn plus the outstanding value shortfall recovery of N33.9bn accrued over the 2021 year.\nOn March 3, 2022, state governors lambasted the NNPC for not remitting any funds at last month’s FAAC meeting."
  },
  {
    "headline": "Tinubu urges Muslim leaders to create political affairs dept to support faithfuls in 2023",
    "summarized_story": "Bola Tinubu, former Lagos State governor and presidential hopeful, has urged the Supreme Council for Shari’ah in the country to create department of political affairs to spread awareness among faithfuls towards producing a muslim president in 2023.\nHe added, “Other religious groups have commenced political sensitisation by creating political departments or directorate among themselves to promote their own.\n“Tinubu disclosed that he would visit the council across the state to solicit support to make his presidential ambtion a reality.\n“Through the president of the Supreme Council for Shari’ah in Nigeria, I will visit all states of this nation.\nHe also called Muslim adherents to use the period of Ramadan to pray for the country to surmount its various challenges."
  },
  {
    "headline": "Anyim mourns Prince Emeka Obasi, says late publisher was a unique personality",
    "summarized_story": "Anyim Pius Anyim (GCON), Nigeria’s former senate president, has commiserated with Dr. (Mrs) Betty Emeka-Obasi over the demise of her husband, Prince Emeka Obasi, describing the late publisher as a unique personality who will be sorely missed.\nObasi, a veteran journalist, publisher and public relations expert, passed away on Tuesday after an illness.\n“It was a rude shock for me to receive the very sad news of the passing of your dear husband, Prince Emeka Obasi.\nEmeka himself always sounded confident that he was going to recover fully,” Anyim said.\n“Beyond journalism, Emeka also made his mark in public issues management."
  },
  {
    "headline": "Uzodinma reacts as bandits burn Ohanaeze president, Obiozor’s home",
    "summarized_story": "Imo State governor, Hope Uzodinma, has condemned the burning of the home of the President-General of Ohanaeze Ndigbo, Prof George Obiozor by those he described as political bandits.\nGunmen had on Saturday morning razed the country home of Prof Obiozor, at Awo-Omanma in the Oru East Local Government Area of Imo State.\nUzodinma described the attack on the country home of Prof Obiozor as cowardly and a height of desperation.\nUzodinma wondered why the bandits should attack the home of a man who is not a politician but a statesman working for the good of the entire Igbo race.\nHe said it was shameful that both the sponsors and perpetrators of the violence deployed their malicious attack on an innocent man."
  },
  {
    "headline": "Court Verdict On Electoral Act, Victory For Rule Of Law – Arewa Youths",
    "summarized_story": "The Arewa Consultative Youth Movement (ACYM) has lauded the judgment of the Federal High Court sitting in Umuahia, Abia State, which on Friday nullified Section 84 (12) of the newly assented Electoral Act, 2022.\nADVERTISEMENTIn a statement made available to journalists in Abuja on Saturday, the ACYM said the sound judgment which affirmed that the controversial section was a violation of the provisions of the nation’s constitution deserved to be celebrated.\nThe group in a statement signed by Kabiru Yusuf, said with the judgment, the coast is now clear for public office-holders who were discriminated against by the section to exercise their right to participate fully in their political parties’ conventions, congresses and primary elections as enshrined in the constitution."
  },
  {
    "headline": "Court Verdict On Electoral Act, Victory For Rule Of Law – Arewa Youths",
    "summarized_story": "The Arewa Consultative Youth Movement (ACYM) has lauded the judgment of the Federal High Court sitting in Umuahia, Abia State, which on Friday nullified Section 84 (12) of the newly assented Electoral Act, 2022.\nADVERTISEMENTIn a statement made available to journalists in Abuja on Saturday, the ACYM said the sound judgment which affirmed that the controversial section was a violation of the provisions of the nation’s constitution deserved to be celebrated.\nThe group in a statement signed by Kabiru Yusuf, said with the judgment, the coast is now clear for public office-holders who were discriminated against by the section to exercise their right to participate fully in their political parties’ conventions, congresses and primary elections as enshrined in the constitution."
  },
  {
    "headline": "DSS Alleges Plot To Cause Ethno-Religious Crisis In North Central",
    "summarized_story": "The Department of State Services (DSS) yesterday said it had uncovered plans by some non-state actors to cause violence in parts of the country, particularly the North Central.\nThe service in a statement signed by its spokesman, Dr Peter Afunanya, said the aim is to cause ethno-religious crisis, ignite reprisals and heat up the polity.\n”Niger Discovers More ExplosivesADVERTISEMENTIn a related development, Niger State Governor Alhaji Abubakar Sani Bello has disclosed that security operatives had detonated explosives planted in Galadima-Kogo, Shiroro local government area of the state.\nThe governor said more security operatives had been deployed to the state, with new strategies adopted to deal with the security situation.\nHe said not all the 4000 internally displaced persons at the Gwada camp were actually displaced as a result of banditry."
  },
  {
    "headline": "DSS Alleges Plot To Cause Ethno-Religious Crisis In North Central",
    "summarized_story": "The Department of State Services (DSS) yesterday said it had uncovered plans by some non-state actors to cause violence in parts of the country, particularly the North Central.\nThe service in a statement signed by its spokesman, Dr Peter Afunanya, said the aim is to cause ethno-religious crisis, ignite reprisals and heat up the polity.\n”Niger Discovers More ExplosivesADVERTISEMENTIn a related development, Niger State Governor Alhaji Abubakar Sani Bello has disclosed that security operatives had detonated explosives planted in Galadima-Kogo, Shiroro local government area of the state.\nThe governor said more security operatives had been deployed to the state, with new strategies adopted to deal with the security situation.\nHe said not all the 4000 internally displaced persons at the Gwada camp were actually displaced as a result of banditry."
  },
  {
    "headline": "2023: Come And Save Nigerian Democracy, Unity, Diaspora Group Writes Atiku",
    "summarized_story": "A pro-democracy group on the aegis of Support Group Atiku U.S.A, has asked former Vice President Atiku Abubakar to formally declare his presidential ambition in order to save Nigerian democracy and unity from further threats.\n“We are supporting Atiku Abubakar because of his formidable track record as a former Vice President of Nigeria with more name recognition and national appeal than his political rivals.\n“We in the Diaspora are watching with consternation how the country is going to the dogs as the economy plummets and unemployment and insecurity get worse.\nADVERTISEMENT“It is befuddling that waiting for good luck seems to be the mindset of the APC administration.\nThis mindset stems from the fact that this administration was not adequately prepared for the task of governance from the beginning."
  },
  {
    "headline": "Bizman Anayochukwu nabbed with liquid cocaine, first time in Nigeria [Video]",
    "summarized_story": "He was arrested by eagle-eyed operatives of the National Drug Law Enforcement Agency, NDLEA.\nOkeke was arrested with 20.75 kilograms of the black liquid cocaine on Tuesday 15th March upon his arrival at the Abuja airport onboard Qatar Airways flight from Sao Paulo, Brazil.\nThe liquid was discovered upon search of his two luggages stuffed with six smaller bags containing 32-makeup mascara, which tested positive to cocaine.\nThe previous day, Wednesday 16th March, narcotic officers in Ogun state recovered 865.2kg of cannabis sativa around Otapele- Obada road in Imeko-Afon LGA.\nSame day, operatives in the state arrested Bello Ibrahim, 38, with 312.4kg of cannabis sativa at Ogere tollgate, Ikenne LGA."
  },
  {
    "headline": "Turkey says Russia, Ukraine nearing peace deal",
    "summarized_story": "Turkey’s foreign minister, Mevlut Cavusoglu said in an interview published on Sunday that Russia and Ukraine were nearing agreement on “critical” issues.\nHe cited Russia’s demand for Ukraine to renounce ambitions to join NATO, demilitarisation, what Russia has referred to as “de-nazification”, and the protection of the Russian language in Ukraine.\nNATO member Turkey shares a maritime border with Ukraine and Russia in the Black Sea, has good relations with both and has offered to mediate between them.\nWhile forging close ties with Russia on energy, defence and trade and relying heavily on Russian tourists, Turkey has sold drones to Ukraine, angering Moscow.\nPresident Tayyip Erdogan has repeatedly said Turkey will not abandon its relations with Russia or Ukraine, saying Ankara’s ability to speak to both sides was an asset."
  },
  {
    "headline": "Four Suspected IPOB Members Killed As Police Repel Bomb Attack",
    "summarized_story": "On Sunday, the Imo State Police Command announced that four hoodlums who stormed Omuma Police Station in Oru East Local Government Area of Imo State had been slain.\nThe command stated that on March 20, 2022, at approximately 0300 hours, hoodlums suspected to be members of the outlawed Indigenous People of Biafra/ Eastern Security Network arrived in huge numbers at Omuma Police Station with various calibres of Improvised Explosive Devices (IEDs).\nThe State Commissioner of Police, CP Rabiu Hussaini, confirmed this in a press release issued by the Command’s spokesman, Micheal Abattam, who claimed the hoodlums fired intermittently but were quickly repelled by tactical teams and DSS agents who responded quickly.\nThere was no casualty on the side of the joint security operatives.\n“On the spot, five undetonated different capacities of Improvised Explosives Devices were recovered from the neutralized bandits and charms."
  },
  {
    "headline": "APC Convention: South-West Governors, Tinubu Battle Buhari’s Candidate",
    "summarized_story": "South-West governors in the All Progressives Congress (APC) and a former Lagos State governor, Senator Bola Tinubu are in a last-meeting rapprochement ahead of the national convention of the party fixed for Saturday, Sunday Tribune can authoritatively reveal.\nInvestigation revealed that among the APC governors in the region, only two enjoy a warm relationship with the former Lagos State governor and presidential aspirant.\nThe South-West governors have since been informed of plot to ensure that Oyedele makes the Unity List of consensus candidates to be ratified at Eagle Square, venue of the convention.\nS/W governors’ last minute move to stop OyedeleThe South-West governors are in frantic move to stop Oyedele, believed to have since enjoyed the blessings of northern governors for the position of the party’s national secretary.\nAPC chieftains in the South-West are apprehensive of a situation in which President Buhari will produce both the national chairman and national secretary of the party ahead the presidential convention."
  },
  {
    "headline": "Disquiet In Lagos APC, Sanwo-Olu Worried As National Leader, Tinubu Is Silent On Governor’s Second Term Bid",
    "summarized_story": "There is anxiety presently in the camp of Lagos State Governor, Babajide Sanwo-Olu, as his godfather and National Leader of the All Progressives Congress, Bola Tinubu, has been silent on his (Sanwo-Olu’s) second term bid.\nSaharaReporters learnt on Saturday from top sources in the party that Sanwo-Olu and his camp are presently worried about Tinubu’s indifference and much more after the state government is “heavily funding” Tinubu’s 2023 presidential ambition.\nIn 2019, Tinubu as always handpicked Sanwo-Olu, having rejected the then governor, Akinwunmi Ambode, who turned out not to be “a good son”.\nAt the present, it appears the table is turning and Ambode’s fate may be waiting for Sanwo-Olu whose second term bid does not appear to be a priority for Tinubu and his circle of Lagos kingmakers.\nThe governor is worried."
  },
  {
    "headline": "Massive Explosion Kills Workers At BUA Cement Factory",
    "summarized_story": "On Friday, tragedy occurred at the BUA Cement PLC business in Sokoto State, when two of the company’s oil tanks exploded.\nOne of the tanks was found to be filled with diesel, while the other was found to be filled with black oil.\nAccording to sources, the two tanks combined had around five million litres of oil before the explosion.\nThe tanks were also said to be delivering diesel and black oil to the new plant.\nHe stated that they were looking into the reason of the explosion, the number of people who were injured, and the extent of the damage to the factory."
  },
  {
    "headline": "Breaking: Again, Victor Osimhen fires brace as Napoli triumph Udinese in spectacular Seria A comeback display",
    "summarized_story": "Super Eagles star Victor Osimhen became the fourth African to score a double-figure in two consecutive Serie A seasons after his brace helped Napoli to a vital 2-1 victory against Udinese at the Stadio Diego Armando Maradona.\nNapoli started the game on top, seeing more of the ball, and trying to break down the Udinese defence.\nAnd just seven minutes after the restart, Osimhen came in handy for Luciano Spalletti’s team.\nEleven minutes later, Osimhen scored his eleventh Serie A goal of the season after latching on to a pass from Giovanni Di Lorenzo to make it 2-1 for Napoli.\nNapoli held out for the remaining 27 minutes to ensure a 2-1 victory, and were further aided after Pablo Mari was sent off in the 83rd minute."
  },
  {
    "headline": "Russian forces kidnapping Ukrainian citizens, blocking aid – Official",
    "summarized_story": "A top official in Mariupol accused Russian forces of taking thousands of Ukrainian citizens against their will across the border into Russia.\nAid agencies are being prevented from reaching people trapped in Ukrainian cities surrounded by Russian forces, the UN’s World Food Programme has said.\nEmergency coordinator Jakob Kern told AFP that “the challenge is to get to the cities that are encircled or about to be encircled,” describing the situation as “dire”.\nHe said it has been almost impossible to deliver emergency supplies to the besieged port city of Mariupol, the northeastern city of Kharkiv and the northeastern city of Sumy.\nHe added that it was a tactic that was “unacceptable in the 21st century”."
  },
  {
    "headline": "Breaking: Hoodlums ‘attack’ Ohaneze Ndigbo President General’s house",
    "summarized_story": "The country home of the President General, Ohaneze Ndigbo Worldwide, Ambassador George Obiozor, in Oru East local government area of Imo state has been reportedly attacked by unknown gunmen early Saturday.\nAlthough, the Police Public Relations Officer(PPRO) Imo State Command, CSP Mike Abattam, is yet to confirm the incident as at the time of filing this report, Blueprint gathered that part of the house was burnt by the hoodlums.\nThe attack happened about the same time another Police station was invaded by gunmen in Umuguma, killing two operatives.\nIncidentally, Ambassador Obiozor was not at home when the incident happened.\nDetails loading…"
  },
  {
    "headline": "BREAKING: Again Gunmen Attack, Raze Police Station In Imo",
    "summarized_story": "Gunmen have attacked and razed the Divisional Police Headquarters in Omuma community, Oru east Local government Area of Imo State.\nThe attack comes less than 24 hours after an attack on the country home of Professor George Obiozor and the Divisional Police Headquarters in Umuguma community.\nChannels Television gathered that the hoodlums who came in large numbers, attacked the station at about 03:00 am on Sunday with various calibres of Improvised Explosive Devices (IED) while also shooting sporadically.\nRead Also: Gunmen Attack Divisional Police Headquarters In ImoThe Imo State Public Relations Officer, Mike Abattam who confirmed this to Channels Television, however, noted that the Command’s tactical teams and operatives of the DSS on duty swiftly repelled the attack.\nFive undetonated Improvised Explosives Devices and charms were also recovered during the operation."
  },
  {
    "headline": "DSS Warns Of Plot To Stoke Violence In North-Central, Organise Mass Protest",
    "summarized_story": "The Department of State Services on Saturday said it was aware of a plot to incite violence in parts of the country, especially the North-Central.\nAccording to a statement signed by DSS spokesperson Peter Afunanya, the aim is to cause ethno-religious crisis and destabilise the country.\nThe Service also said there were plans to use students and labour unions to organise a massive protest like #EndSARS.\nREAD ALSO: President Buhari Doesn’t Understand Nigeria – TambuwalIt advised citizens to engage the government only based one existing rules.\n“Those who may wish to go contrary to the law will, however, face the consequences,” the DSS said."
  },
  {
    "headline": "President Buhari Doesn’t Understand Nigeria – Tambuwal",
    "summarized_story": "﻿Sokoto State Governor Aminu Tambuwal on Saturday said President Muhammadu Buhari lacks the capacity to govern Nigeria.\nHe made the comment during his visit to the Kaduna State PDP Secretariat to solicit support for his presidential ambitions in 2023.\nMr Tambuwal, a stalwart of the opposition PDP, has declared his intention to run for President.\n“The President doesn’t understand Nigeria and the dynamics of modern governance,” he said.\nREAD ALSO: President Buhari Returns To Abuja From London“Someone that can reach out and consult and build consensus on issues that concerns Nigerians."
  },
  {
    "headline": "FG Lists Steps Taken To Restore ‘Normal Supply Of Electricity’ Nationwide",
    "summarized_story": "The Federal Government on Saturday said it has taken several steps “towards the restoration of normal supply of electricity nationwide.”The national grid suffered shutdowns at least twice in the past week leading to blackouts across the country amid rising prices of fuel products.\nIn a statement signed by Minister of Power, Abubakar Aliyu, the government said it had made some progress to address the recent challenges.\nREAD ALSO: NERC Confirms Removal Of Electricity Subsidy“The Nigerian public may please recall that the national grid lost 1,110 MW generation capacity as a consequence of simultaneous disruptions in gas supply to the Okpai, Calabar and the Afam VI power plants,” the statement said.\n“The available generation capacity was exacerbated by the ongoing water management regime at the Kainji, Jebba and Shiroro power plants.”According to the Minister, the steps taken to address the situation include the following:"
  },
  {
    "headline": "Senator Ali Modu Sheriff Pulls Out Of APC National Chairmanship Race",
    "summarized_story": "Senator Ali Modu Sheriff has pulled out of the All Progress Congress (APC) national chairmanship race, saying he doesn’t want to oppose the zoning formula of the party as they have agreed to zone the position to the north-central.\nBriefing journalists on Sunday in Abuja, Senator Sheriff said he has respect for the leader of the party President Muhammadu Buhari and so he will not continue in the race.\nHe thanked his campaign team for their steadfastness and says except the party reviews it’s zoning formula he is no longer contesting.\nRead Also: [2023 Polls] PDP Approves Committee For Zoning, Prices For Nomination FormsMore to follow…"
  },
  {
    "headline": "Gov.Tambuwal visits PDP stakeholders in Kaduna -",
    "summarized_story": "Sokoto State Governor and Presidential aspirant on the platform of the Peoples Democratic Party (PDP) Aminu Waziri Tambuwal on Saturday visited PDP stakeholders in Kaduna over his desire to become president in 2023.\nHe noted that his ambition is aimed at rescuing Nigeria from imminent collapse.\nHe faulted the All Progressive Congress (APC) for mismanaging the socioeconomic affairs of the nation and likened the relationship between President Muhammad Buhari and the Nations as that of a failed marriage.\nThe Sokoto Governor added that having worked in the Judiciary, legislative and Executive arms of Government, he possesses the necessary qualities to provide good governance if elected.\nGovernor Tambuwal called on his Party the PDP to be strategic and deliberate in coming up with a formula for winning elections in 2023."
  },
  {
    "headline": "2023: Youths storm Bauchi streets, say 'no going back on Yahaya Bello' -",
    "summarized_story": "Vehicular movement was temporarily held up for several hours in Bauchi on Saturday when thousands of youths stormed the major streets, rallying support for the presidential aspiration of Governor Yahaya Bello of Kogi State.\nGovernor Yahaya Bello stands out.\n“All the lies they have peddled against him in the past have turned to strength for him and for us Nigerian youths.\n“You have been consistent in your call for His Excellency, Alhaji Yahaya Bello to contest for President come 2023.\nHe has demonstrated in Kogi that it is Youths O Clock, and it is paying off with all the giant strides."
  },
  {
    "headline": "We will implement Court Ruling on Electoral Act",
    "summarized_story": "The office of the Attorney General of the Federation and Minister of Justice will accordingly give effect to the Court judgment in line with the dictates of the law and the spirit of the judgment.\nThe judgment of the Court will be recognized by the Government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\nThe provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be so treated accordingly.\nThis is in line with the dictates of chapter 7, Part 4, Section 287 of the 1999 Constitution of the Federal Republic of Nigeria (as amended) on enforcement of decisions that makes it a point of duty and obligation on all authorities and persons to have the judgment of the federal High Court, among others, to be enforced."
  },
  {
    "headline": "Court Vacates Injunction against APC National Convention -",
    "summarized_story": "An FCT High Court has vacated a restraining injunction against the March 26 convention of the All Progressives Congress (APC).\nHe said the the order of November 18, 2021, has been overtaken by a recent Supreme Court judgement on a similar matter.\nSalisu Umoru, had sought to restrain the APC, Governor Buni and the Independent National Electoral Commission (INEC) from organising any convention until the determination of the suit.\nThe application seeking to set aside the November 18, 2021 ruling of the court restraining the convention was stalled on Tuesday after two lawyers, Shuaibu Aruwan (SAN) and Michael Adoyi, both announced appearances for the APC.\nIn the application dated March 9, 2022, the APC was asking for “an order of this honourable court striking out the suit in its entirety for want of jurisdiction."
  },
  {
    "headline": "NDLEA Arrests Nigerian Businessman from Brazil with 20.75kg of Black Cocaine – Arise News",
    "summarized_story": "A 52-year old father of four children, Okeke Anayochukwu, has been arrested with black liquid cocaine at the Nnamdi Azikiwe International Airport, Abuja by operatives of the National Drug Law Enforcement Agency, NDLEA.\nAnayochukwu who claimed to be a businessman was arrested with the strange substance last Tuesday upon arrival at the Abuja airport onboard Qatar Airways flight from Sao Paulo, Brazil through Doha, Qatar to Abuja.\n“Okeke was arrested with 20.75 kilograms of the black liquid cocaine on Tuesday 15th March upon his arrival at the Abuja airport onboard Qatar Airways flight from Sao Paulo, Brazil through Doha, Qatar to Abuja.\nThe previous day, last Wednesday, narcotic officers in Ogun state recovered 865.2 kilogrammes of cannabis sativa around Otapele- Obada road in Imeko-Afon local government area.\nSame day, operatives in the state arrested Bello Ibrahim, 38, with 312.4 kilogrammes of cannabis sativa at Ogere tollgate, Ikenne local government area."
  },
  {
    "headline": "North Korea Fires Multiple-Rocket Launcher, South Korea Says",
    "summarized_story": "North Korea appeared to have fired a short-range multiple rocket launcher on Sunday, South Korea’s military said, amid heightened military tensions on the peninsula after a spate of larger missile launches by the nuclear-armed North.\nSouth Korea’s National Security Council held an emergency vice-ministerial meeting over the launches.\nLast year South Korea approved plans to pursue a $2.6-billion artillery interception system, similar to Israel’s “Iron Dome”, designed to protect against North Korea’s arsenal of long-range guns and rockets.\nSouth Korea and the United States warn that the North could resume test-firing its largest ICBMs for the first time since 2017 amid stalled denuclearisation talks.\nNorth Korea also appears to be preparing to launch a spy satellite, and new construction has been spotted at its shuttered nuclear test site."
  },
  {
    "headline": "Ukraine Says Russia Bombs Another Shelter in Besieged Mariupol",
    "summarized_story": "The infants — some just days old — are being cared for by nurses who cannot leave the shelter because of constant shelling by Russian troops who are trying to encircle the city.\nThe Russian military said Saturday that it used a Kinzhal for the first time in combat to destroy an ammunition depot in the Carpathian Mountains in western Ukraine.\nUkraine and Russia have held several rounds of negotiations aimed at ending the conflict, but the neighboring countries remain divided over several issues.\nThe Mariupol city council claimed Saturday that Russian soldiers had forcibly relocated several thousand city residents, mostly women and children, to Russia.\nIn Ukraine, Zelenskyy on Sunday ordered the activities of 11 political parties with links to Russia to be suspended during the period of martial law."
  },
  {
    "headline": "Senior Nigerian Lawyers Falana, Adegboruwa Fault Court on Deletion of Section 84 (12) from Electoral Act",
    "summarized_story": "Two Senior Advocates of Nigeria (SANs), Mr. Femi Falana and Mr. Ebun-Olu Adegboruwa, have faulted the decision of a Federal High Court sitting in Umuahia, the Abia State capital, ordering the deletion of Section 84 (12) of the amended Electoral Act.\nIn separate statements issued Saturday, the senior lawyers raised pertinent questions about the judgment, noting that the decision of the court was a great error.\nAnyadike had, consequently, ordered the Attorney General of the Federation, Mr. Abubakar Malami to immediately delete Section 84 (12) of the amended Electoral Act.\nTo that extent, Section 84 (12) of the Electoral Act was annulled on a very faulty ground.\nSupporting Falana’s position, Adegboruwa argued that the Electoral Act “is an Act of the National Assembly."
  },
  {
    "headline": "Following Nationwide Outages, Nigeria Plans to Ramp up 2,150MW of Electricity",
    "summarized_story": "Nigeria’s national power grid experienced another downtime on Tuesday, barely 24 hours after it witnessed a similar system collapse, throwing the nation into darkness.\nFollowing the incident, Aliyu had summoned an emergency meeting to resolve all the outstanding issues with the stakeholders in the Nigerian Electricity Supply Industry (NESI) as a result of the worsening power supply situation.\nThe Gencos under the Association of Power Generation Companies (APGC) had stated that the power supply situation in the country worsened because the generation companies were being owed over N1.6 trillion since 2013.\n“The available generation capacity was exacerbated by the ongoing water management regime at the Kainji, Jebba, and Shiroro power plants.\n“We expect an on-grid improvement of about 800mw generation capacity from the NDPHC plants,” he said."
  }
]