[
  {
    "headline": "Relaxing, straightening hair can cause alopecia, dermatologist warns",
    "summarized_story": "According to the skin expert, the chemicals found in the relaxer can predispose the user to hair loss.\nAccording to the consultant dermatologist, alopecia generally means any hair loss on any hair-bearing part of the body.\nExplaining further, Oiwoh said while there are different causes and types of alopecia, alopecia caused by one’s grooming hairstyle is referred to as central centrifugal cicatricial alopecia.\n“The area of thinning hair expands over time and progresses to more severe, permanent hair loss.\nHe advised that “for the best management of hair loss, the person involved must first visit the nearest Dermatologist."
  },
  {
    "headline": "Relaxing, straightening hair can cause alopecia, dermatologist warns",
    "summarized_story": "According to the skin expert, the chemicals found in the relaxer can predispose the user to hair loss.\nAccording to the consultant dermatologist, alopecia generally means any hair loss on any hair-bearing part of the body.\nExplaining further, Oiwoh said while there are different causes and types of alopecia, alopecia caused by one’s grooming hairstyle is referred to as central centrifugal cicatricial alopecia.\n“The area of thinning hair expands over time and progresses to more severe, permanent hair loss.\nHe advised that “for the best management of hair loss, the person involved must first visit the nearest Dermatologist."
  },
  {
    "headline": "WHO confirms over 100 attacks on healthcare staff, facilities in Ukraine",
    "summarized_story": "Lara AdejoroThe World Health Organisation says it has recorded more than 100 attacks on health care since Russia invaded Ukraine on February 24.\nOf the current total of 103 attacks, 89 have impacted health facilities and 13 have impacted transport, including ambulances.\n“We are outraged that attacks on health care are continuing.\n“I have been personally struck by the resilience and fortitude of health care providers and indeed of the health system itself in Ukraine.\n“Across Ukraine, 1000 health facilities are in proximity to conflict areas or in changed areas of control,” explained Dr. Jarno Habicht, WHO Representative in Ukraine."
  },
  {
    "headline": "WHO confirms over 100 attacks on healthcare staff, facilities in Ukraine",
    "summarized_story": "Lara AdejoroThe World Health Organisation says it has recorded more than 100 attacks on health care since Russia invaded Ukraine on February 24.\nOf the current total of 103 attacks, 89 have impacted health facilities and 13 have impacted transport, including ambulances.\n“We are outraged that attacks on health care are continuing.\n“I have been personally struck by the resilience and fortitude of health care providers and indeed of the health system itself in Ukraine.\n“Across Ukraine, 1000 health facilities are in proximity to conflict areas or in changed areas of control,” explained Dr. Jarno Habicht, WHO Representative in Ukraine."
  },
  {
    "headline": "Breaking: Court bars journalists from covering Nnamdi Kanu’s trial",
    "summarized_story": "By Ikechukwu NnochiriABUJA–Justice Binta Nyako of the Federal High Court, on Friday, barred journalists from covering the ongoing trial of the detained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu.\nHe argued that the court lacked the jurisdiction to try him on the strength of an incompetent charge.\nHowever, FG’s lawyer, Mr Shuaibu Labaran, prayed the court to strike out Kanu’s application and order the Prosecution to open its defence.\nHe argued that Section 32 of the Terrorism Prevention Act imbued the court with the requisite jurisdiction to handle the trial.\n“We urged my lord to refuse the application to pave way for the commencement of the trial in Ernest."
  },
  {
    "headline": "NURTW crisis: Uproar as Lagos govt appoints Oluomo parks c’ttee boss",
    "summarized_story": "This followed a lingering leadership crisis between the NURTW and its Lagos council, led by MC Oluomo, whose leadership had been dissolved by the national body.\nThe state government had suspended the NURTW operations in all parks and garages, following the tension sparked by some events in the union.\nIt’s unfortunate —Lagos PDPA former member of the PDP caretaker committee, who spoke in confidence, said: “That tells you the level of indiscipline that we have in the Lagos State government and that tells you the kind of patronage the Lagos State gets from them.\nIf the national body could rise to their task of trying to curb the menace of these miscreants and the Lagos State government deems it fit to promote them in that light, it is unfortunate.\n“The Babajide Sanwo-Olu government has committed a grave tactical error in aligning with Oluomo whose reign as the Lagos state chairman of NURTW has been marred by killings, maiming, looting and general dislocation of our dear state."
  },
  {
    "headline": "I accept Nigerians call to join 2023 presidential race – Emmanuel",
    "summarized_story": "*Receives N40m purchased formsBy Chioma Onuegbu, UyoGOVERNOR Udom Emmanuel of Akwa Ibom State has yielded to the call from some Nigerians through a human rights media outfit, the Brekete Family, to join the 2023 presidential race.\nHis words: “I appreciate this gesture.Be rest assured that I have accepted the form I have accepted this nomination form.\n” Honestly, when I heard this plan to buy me a Presidential nomination form was going on, I asked myself, how can they raise up to N40million to go and buy me a form?\nI believe everybody should join hands and make sure that we get it right in 2023”, governor Emmanuel advised.\nWe don’t believe in too much talk, so here today we are presenting to you the nomination form for presidential candidate of your party."
  },
  {
    "headline": "Northern Youth Vanguard blasts group over pipeline surveillance contract",
    "summarized_story": "The Northern Youth Vanguard has lambasted the Arewa Youth Assembly for warning the Federal Government of Nigeria over a pipeline surveillance contract allegedly awarded to High Chief Government Ekpemupolo aka Tompolo.\nThe Northern Youth Vanguard decried the position of the Northern Youth Assembly as very embarrassing and shameful considering the plethora of security challenges facing the country and particularly the north, it said the group should bury its head in shame.\nThis is beginning to look like a sabotage to the nation and current government, it seems the intention is to cripple government.\nThe Northern Youth Vanguard spokesman rhetorically asked ” can we have the courage and leadership resolutions like Tompolo and his fellow Niger Delta Youth activists so that we can begin to take back our lives and communities from Boko Haram, Bandits, kidnappers, Herdsmen and terrorists that has ravaged and laid bare our north.\nIt called and challenged the Arewa Youth Assembly to take a tour of the ravaged communities in the north and come up with ideas for solutions to the present quagmire in the northern region."
  },
  {
    "headline": "We won’t surrender Imo to criminals —Uzodimma",
    "summarized_story": "By Chinonso AlozieThe Imo state governor, Hope Uzodimma, on Thursday said he would not surrender the state to criminals.\nThe governor stated this during the inauguration of the State Council of Traditional Rulers at the Government House in Owerri.\nUzodimma insisted that it was because the number of attacks by the hoodlums in the state was sponsored by politicians.\nAccording to the governor, “As we congratulate you, the traditional rulers and heads of each local government, we remind you of the responsibilities that follow, government can’t function without partnership with traditional rulers.\nAmong the traditional rulers inaugurated were the Deputy Chairman Owerri zone, Akujuobi Osuagwu, Deputy Chairman Orlu zone, Thomas Obiefule, Deputy Chairman okigwe zone, Eze Godwin Okeke among the heads of the 27 local government areas of the state."
  },
  {
    "headline": "Court stops journalists from covering Nnamdi Kanu’s terrorism trial",
    "summarized_story": "In compliance with a contentious Practice Directions issued on Thursday by the Chief Judge of the Federal High Court, John Tsoho, journalists covering the treasonable felony charges against Nnamdi Kanu were stopped from covering the proceedings.\nThe journalists from both national and international media organizations were locked out of the courtroom on the alleged order of Justice Binta Nyako.\nThough they were cleared by the operatives of the Department of State Services, DSS, to access the courtroom, the entrance door was firmly locked against them without any explanation.\nThe Chief Judge had in the Practice Directions he issued in less than 24 hours to the resumption of Kanu’s trial announced that terrorism-related charges shall henceforth be conducted in camera.\nJustice Tsoho further threatened that any report on a terrorism trial without prior approval shall attract punishment."
  },
  {
    "headline": "BREAKING: Terrorism: Nnamdi Kanu floors Buhari govt as court strikes out eight out of 15 charges",
    "summarized_story": "An Abuja Federal High Court on Friday ruled on the terrorism charges against Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB.\nThe Nigerian government had filed the 15-count charges bordering on terrorism and treasonable felony against the IPOB leader.\nThe charges which bordered on terrorism were filed against Kanu by the Federal Government.\nThe IPOB leader has been in the custody of the Department of State Services, DSS, since his arrest in June 2021.\nHowever, the IPOB leader contested the charges in a fundamental human rights suit against the Federal Government."
  },
  {
    "headline": "War: 30 killed, scores injured as rocket hits Ukrainian train station",
    "summarized_story": "No fewer than 30 people have been killed and 100 injured in a rocket attack on a railway station in the eastern Ukrainian city of Kramatorsk on Friday, NAN reports.\nThe Ukrainian Railway Chief, Alexander Kamyshin, said it was a deliberate attack on the passengers, infrastructure of the railway and the residents of Kramatorsk.\nAccording to Donetsk Governor, Pavlo Kyrylenko, thousands of people were waiting at Kramatorsk’s train station to be evacuated.\nTetyana Ihnatenko, the spokesperson for Ukraine’s Donetsk administrative region, said 27 people were killed in the attack, including two children, and at least 30 injured.\nThe city is in the part of the Donetsk region that remains under Ukrainian control."
  },
  {
    "headline": "BREAKING: Suspected IPOB members attack army patrol van in Aba",
    "summarized_story": "Gunmen suspected to be members of secessionist group, Indigenous People of Biafra, IPOB, have reportedly attacked an Army patrol van in Aba, a commercial city in Abia State.\nIt was gathered the incident which occurred in the early hours of Friday when the soldiers were on patrol, triggered tension in the area.\nAccording to The Nation, the attackers laid ambush for the unsuspecting soldiers at the popular Tonimas junction, Osisioma LGA axis, on Enugu-Aba-Port Harcourt Expressway.\nDetails of the attack are still sketchy as of press time but it was learnt that the attackers burnt the patrol van of the soldiers.\nHowever, the number of casualties was yet to be ascertained as the army could not be reached for comments."
  },
  {
    "headline": "NCC awards N233 million in research grants, professorial chair endowments",
    "summarized_story": "From the total sum, N172.5 million was awarded to support 13 proposals found to have met the stipulated criteria in the advertised 2021 Request for Proposal (RfP) for Telecommunications-Based Research Innovations from Nigerian Tertiary Institutions (research grant) Programme.\nAdditionally, three universities received the sum of N20 million each for the endowments of the professorial chair by the Commission.\nThe fresh endowment in the three universities brings to seven, the number of universities that the Commission has endowed professorial chairs.\nEarlier, the NCC had instituted professorial chairs at the Federal University of Technology, Owerri, Imo State; Bayero University, Kano, Kano State; Abubakar Tafawa Balewa University, Bauchi State; and University of Ibadan, Oyo State.\nThe EVC stated that with the latest awards and endowments, the Commission has committed more than N660 million to Nigerian tertiary institutions for ICT-focused research innovations."
  },
  {
    "headline": "BREAKING: Gunmen attack soldiers in Abia",
    "summarized_story": "Gunmen suspected to be members of the Indigenous People of Biafra (IPOB) have reportedly attacked an Army patrol van in Aba, the commercial nerve of Abia State.\nThe Nation gathered the incident happened in the early hours Friday when the soldiers were on patrol.\nIt was gathered the attackers laid ambush for the unsuspecting soldiers.\nRead Also: Gunmen rob six POS shops in RiversThe attackers also burnt the patrol van of the soldiers.\nIt was gathered that the incident caused pandemonium with residents of the area in apprehension."
  },
  {
    "headline": "Attacked train: Families of abducted passengers protest",
    "summarized_story": "Aliyu Mahmud, a relative of the seven-month pregnant woman, was among the victims’ families who staged a peaceful protest at the Radio House in Abuja yesterday.\n“But we do not know the efforts of the security agencies.\nSpeaking at a ministerial briefing, she said: “The Ministry of Transportation is working with security agencies.\n“We are very concerned about those kidnapped and we assure you that the security agencies are doing the best they can.\nThey said enough was not being done by security agencies to stem the rising security crises in the state."
  },
  {
    "headline": "Inciting comments are part of insecurity, by Femi Adesina",
    "summarized_story": "Let’s start with a caveat: free comments are part of democracy, and so this is not an attempt to muzzle anyone.\nMost of those who utter incautious, inflammatory words about the state of insecurity in the land, only want power through the back door.\nUnguarded comments can further inflame the insecurity in the land, and it surely does.\nThat is why President Buhari will land safely, and soundly, to the glory of the Almighty.\n*Adesina is Special Adviser to President Buhari on Media and Publicity"
  },
  {
    "headline": "260 Cadillac cars for Zamfara monarchs",
    "summarized_story": "Zamfara State Governor Bello Matawalle on Wednesday, in Gusau, distributed 260 vehicles to traditional rulers in the state.\nThe cars included Cadillac 2019 Model for 17 Emirs, 13 Senior District Heads and 230 District Heads.\nGovernor Matawalle said the gesture was in recognition of the role of traditional rulers in maintaining peace in the state.\n“The role of traditional rulers in fostering national unity, safeguarding our values, and serving as moral compass for our society cannot be over-emphasised.\n“As premier leaders in our communities, traditional rulers play key roles in resolving conflicts and in assisting the government to provide fatherly advice to their subjects in the interest of promoting peace and harmony."
  },
  {
    "headline": "FCTA demolishes 350 structures near Abuja Airport",
    "summarized_story": "No fewer than 350 structures were demolished yesterday in the densely populated Bassa-Jiwa Village, situated near the Nnamdi Azikiwe International Airport Abuja.\nMost of the demolished structures were residential buildings and shanties that were constructed on the right of way (ROW), under Train Bridge, and pedestrian crossing in and around the village off the Airport Road.\nThe Director of Development Control Department Murkhtar Galadima said the 350 structures removed were part of the 500 marked for demolition in the area.\nOn whether adequate notice was given before the exercise, Galadima said: “Before marking the structures, we came for sensitisation first, thereafter, we removed them.\n“What we want the government to do for us is to ensure that nobody is allowed to erect any structures in the areas where houses were demolished.”"
  },
  {
    "headline": "Soyinka Denies Asking Nigerians to Vote for Buhari in 2015",
    "summarized_story": "*Says he only urged Nigerians to vote out JonathanNobel laureate, Prof. Wole Soyinka, has denied asking Nigerians to vote for President Muhammadu Buhari in 2015.\nFollowing the poor performance of the President Buhari-led administration, characterized by hardship and worsening insecurity, Soyinka has been at the receiving end of criticisms from Nigerians.\nSome Nigerians have been blaming him for the role he played in the election of President Buhari in 2015.\nHe, however, said President Buhari failed Nigeria at its critical moments.\nMeanwhile, Soyinka has criticized the ruling All Progressives Congress (APC) over the election of ex-Osun State deputy governor, Chief Iyiola Omisore, as its National Secretary."
  },
  {
    "headline": "Be Firm, Fair to All Party Members, Buhari Charges Apc Chairman",
    "summarized_story": "*Says he’ll continue to entrench democratic principles in governance*Adamu: I am now in chargeDeji Elumoye in AbujaPresident Muhammadu Buhari yesterday formally received in audience the new National Chairman of the ruling All Progressives Congress (APC), Senator Abdullahi Adamu, at the State House, Abuja, with a call on the party chairman to be firm and fair in his dealings with officers and members of the APC.\nThe president urged the new party chairman to be fair and firm as he was known to be, in all his dealings.He also gave assurance to the party and the nation that he would continue the struggle to entrench democratic principles in politics and the affairs of governance.\n“The president expressed confidence that the APC would continue to enjoy the confidence of the people by winning future polls based on the performance of his government in the last seven years.\n“I don’t remember any convention that there were misgivings about the possibility of its success than this one.\nWe came out clean and we thought the leadership that Mr. President provided to the party has made all this possible."
  },
  {
    "headline": "New Revenue Formula Proposes Reduction of FG’s Allocation By 3.33%",
    "summarized_story": "Deji Elumoye in AbujaThe nation’s 30-year-old revenue allocation formula would soon be reviewed with a proposal by the Revenue Mobilisation Allocation and Fiscal Commission (RMAFC) for the reduction of the allocation to federal government by 3.3 percent while the allocation to the 36 states and the 774 local government councils would be increased by 3.07 per cent and 0.44 per cent respectively.\nThis is just as President Muhammadu Buhari has declared that he would await the final outcome of the constitutional review process before presenting the report of the review of the vertical revenue allocation formula to the National Assembly as a Bill for enactment.\n‘‘I am aware that the present revenue allocation formula has not been reviewed since the last exercise carried out in 1992.\nIn arriving at the new vertical revenue allocation formula, Mbam told the president that the Commission had wide consultation with major stakeholders, public hearing in all the geo-political zones, administered questionnaires and studied some other federations with similar fiscal arrangements like Nigeria to draw useful lessons from their experiences.\nHe added that literature reviews were conducted on revenue allocation formula in Nigeria dating back to pre-independence period while the Commission received memoranda from the public sectors, individuals and private institutions across the country."
  },
  {
    "headline": "Military Launches New Operation to Curb Oil Theft, Bunkering in Niger Delta",
    "summarized_story": "He pointed out that troops of Operation Delta Safe had continued to dominate the zone and had conducted anti-crude oil theft and anti-illegal oil bunkering related operations at different locations.\nHe explained that the scale of crude oil theft and pipeline vandalism seen in the host communities was beyond explanation, and has rendered the oil and gas industry unworkable.\nSo, as we speak now, there is no production going on there because we can no longer sustain the operation.\nIt got to a point that when we inject 239,000 barrel per day, we only receive 3,000 barrel per day.\nHe said only a formidable workforce with good welfare could rebuild the failing economy and address all the the challenges in the various sectors including the oil and gas industry."
  },
  {
    "headline": "Buhari Writes House, Seeks Revision of 2022 MTEF as Budget Deficit Increases to N7.35trn",
    "summarized_story": "President Muhamadu Buhari has written to the House of Representatives requesting the revision of the 2022 Medium-Term Expenditure Framework (MTEF) upon which this year’s budget was based.\nAccording to a letter from the president which was read by the Speaker of the House, Femi Gbajabiamila, during plenary yesterday, the revision became necessary as the 2022 budget deficit was projected to increase to N7.35 trillion, representing 3.99 percent of the Gross Domestic Product (GDP).\nThe president said the increase in the budget deficit would be financed by new borrowings from the domestic market.\nThe letter which according to Gbajabiamila was lengthy, read in part: “As you are aware Mr. Speaker, the new development both in the global economy as well as the domestic economy have necessitated the revision of the 2022 fiscal framework on which the 2022 budget was based.\n“The total budget deficit is projected to increase by N965.42 billion to N7.35 trillion representing 3.99 percent of the GDP."
  },
  {
    "headline": "BREAKING: Many Feared Dead As Unknown Gunmen Attack Soldiers In Abia",
    "summarized_story": "Unidentified gunmen have attacked an Army patrol van in Aba, the commercial hub of Abia State.\nIt was learnt the incident happened in the early hours of Friday when the soldiers were on patrol.\nThe attackers were said to have laid an ambush for the unsuspecting soldiers.\nMembership of the committee cut across the five South-East states of Anambra, Abia, Ebonyi, Enugu and Imo.\nIt is termed called Truth, Justice and Peace Committee."
  },
  {
    "headline": "BREAKING: Many Feared Dead As Unknown Gunmen Attack Soldiers In Abia",
    "summarized_story": "Unidentified gunmen have attacked an Army patrol van in Aba, the commercial hub of Abia State.\nIt was learnt the incident happened in the early hours of Friday when the soldiers were on patrol.\nThe attackers were said to have laid an ambush for the unsuspecting soldiers.\nMembership of the committee cut across the five South-East states of Anambra, Abia, Ebonyi, Enugu and Imo.\nIt is termed called Truth, Justice and Peace Committee."
  },
  {
    "headline": "Nnamdi Kanu's Trial: Nigeria's Secret Police, DSS Brings Over 200 Armed Thugs To Court To Attack Kanu’s Supporters, Sowore",
    "summarized_story": "Nigeria’s secret police, Department of State Services on Friday brought over 200 thugs to court as the trial of the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu resumes.\nKanu is expected to appear in the Federal High Court, Abuja today (Friday), in continuation of his trial.\nSaharaReporters observed that the secret police came to the court with a truckload of thugs while denying lawyers, court workers, journalists, activists and supporters access to the court premises.\nIt was gathered that the thugs arrived at the court premises with clubs, machetes, gasoline bombs and other weapons.\nThe Federal High Court on Thursday stated this in a directory referred to as “Practice Directions On Trial of Terrorism Cases,” obtained by SaharaReporters."
  },
  {
    "headline": "Nnamdi Kanu's Trial: Nigeria's Secret Police, DSS Brings Over 200 Armed Thugs To Court To Attack Kanu’s Supporters, Sowore",
    "summarized_story": "Nigeria’s secret police, Department of State Services on Friday brought over 200 thugs to court as the trial of the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu resumes.\nKanu is expected to appear in the Federal High Court, Abuja today (Friday), in continuation of his trial.\nSaharaReporters observed that the secret police came to the court with a truckload of thugs while denying lawyers, court workers, journalists, activists and supporters access to the court premises.\nIt was gathered that the thugs arrived at the court premises with clubs, machetes, gasoline bombs and other weapons.\nThe Federal High Court on Thursday stated this in a directory referred to as “Practice Directions On Trial of Terrorism Cases,” obtained by SaharaReporters."
  },
  {
    "headline": "Ghana Bans Spending Of Foreign Currencies, Makes Cedi Sole Legal Tender",
    "summarized_story": "The Bank of Ghana, on Tuesday, warned members of the public, particularly businesses, companies and institutions to desist from pricing, advertising and receiving payments in foreign currencies.\nThe General Public is hereby notified that the sole legal tender in Ghana is the Ghana Cedi.”The central bank also cautioned the general public to desist from dealing in illegal forex activities, known as black market transactions adding that the sole legal tender in Ghana is the Ghana Cedi.\nThe Bank of Ghana however said it is in collaboration with National Security and Law Enforcement Agencies to clamp down on illegal foreign exchange operations.\n\"All offenders shall be dealt with in accordance with the law and the Bank of Ghana urges the general public to report any violations witnessed,\" it concluded.\nBANK OF GHANA NOTICE TO THE GENERAL PUBLIC by Sahara Reporters on Scribd"
  },
  {
    "headline": "FAO: Global food prices increased by 13% in March -- highest level ever",
    "summarized_story": "Food and Agriculture Organisation (FAO) of the United Nations says global food prices surged by 13 per cent in March, making a giant leap to the highest level ever.\nIn its monthly Food Price Index released on Friday, FAO said food prices averaged 159.3 points in March, up 12.6 per cent from February, when it had already reached its highest level since its inception in 1990.\nThe latest level of the index was 33.6 per cent higher than in March 2021, FAO said.\nPalm, soy, and rapeseed oil prices also rose markedly as a result of the higher sunflower seed oil prices and the rising crude oil prices, with soy oil prices further underpinned by concerns over reduced exports by South America.\nFor African countries like Nigeria, the effect of a surge in global food prices, especially wheat, had seen higher prices in the price of bread and noodles."
  },
  {
    "headline": "FAO: Global food prices increased by 13% in March -- highest level ever",
    "summarized_story": "Food and Agriculture Organisation (FAO) of the United Nations says global food prices surged by 13 per cent in March, making a giant leap to the highest level ever.\nIn its monthly Food Price Index released on Friday, FAO said food prices averaged 159.3 points in March, up 12.6 per cent from February, when it had already reached its highest level since its inception in 1990.\nThe latest level of the index was 33.6 per cent higher than in March 2021, FAO said.\nPalm, soy, and rapeseed oil prices also rose markedly as a result of the higher sunflower seed oil prices and the rising crude oil prices, with soy oil prices further underpinned by concerns over reduced exports by South America.\nFor African countries like Nigeria, the effect of a surge in global food prices, especially wheat, had seen higher prices in the price of bread and noodles."
  },
  {
    "headline": "Court strikes out eight of 15 charges against Nnamdi Kanu",
    "summarized_story": "A federal high court in Abuja has struck out eight out of the 15-count charge filed against Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), by the federal government.\nBinta Nyako, the judge, ruling on Kanu’s application on Friday, struck out counts 6,7,9,10,11,12,13 and 14.\nHe is to stand trial on counts 1,2,3,4,5,8 and 15.\n“The court shall proceed to try the defendant on those counts.”Kanu is standing trial on an amended 15-count charge bordering on treasonable felony.\nOzekhome adopted his application and asked the court to strike out the entire charge."
  },
  {
    "headline": "Court strikes out eight of 15 charges against Nnamdi Kanu",
    "summarized_story": "A federal high court in Abuja has struck out eight out of the 15-count charge filed against Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), by the federal government.\nBinta Nyako, the judge, ruling on Kanu’s application on Friday, struck out counts 6,7,9,10,11,12,13 and 14.\nHe is to stand trial on counts 1,2,3,4,5,8 and 15.\n“The court shall proceed to try the defendant on those counts.”Kanu is standing trial on an amended 15-count charge bordering on treasonable felony.\nOzekhome adopted his application and asked the court to strike out the entire charge."
  },
  {
    "headline": "'Nomination forms can be purchased until April 14' -- PDP adjusts pre-election schedule",
    "summarized_story": "The national working committee (NWC) of the Peoples Democratic Party (PDP) has adjusted its schedule of activities ahead of the 2023 general election.\nIn the adjusted timetable, the opposition party extended the deadline for the purchase as well as the submission of expression of interest and nomination forms.\nIn the old timetable, April 6-15 was the deadline for the submission of expression of interest and nomination forms for state house of assembly, house of representatives and senate, governorship and presidential seats respectively.\nHe said the screening of aspirants for the state house of assembly, national assembly, governorship and presidential seats will take place on April 19, 20, 21 and 25, respectively.\nScreening appeals for state house of assembly, national assembly, governorship and presidential seats will now take place on April 21, 22, 26 and 27, accordingly."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Visa opens its first African innovation Studio in Kenya",
    "summarized_story": "Global payments company Visa has opened a new Innovation Studio in Nairobi, Kenya.\nThis facility will serve the sub-Saharan Africa region and joins a network of innovation centers operated by Visa since 2016, in cities including London, Dubai and Singapore.\nAida Diarra, Senior vice president and head of Visa in Sub-Saharan Africa, said the studio will assist in increasing the Visa market in the region by issuing digital and physical Visa to its clients.\nA photo of the corner fabrics section at the Visa Innovation studio in Nairobi“As a brand built on technology, Visa has driven the major technology advancements that make electronic payments what they are today.\nThe launch of Visa’s first African innovation studio and others serves as a boost to the African tech ecosystem as it’ll encourage the creation, development, and implementation of novel ideas."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there!\nInteresting times.\nThey say, “if you want something done right, do it yourself.” This is the closest..."
  },
  {
    "headline": "Is the NIN-SIM linkage deadline extension really over?",
    "summarized_story": "While you’re thinking about it, here’s what I’ll be discussing today:NIN-SIM linkage deadline extensionImaliPay’s $3 million seedFolklore Group’s shift to B2BUnrelated, but an update is needed.\nIs the NIN-SIM linkage deadline extension really over?\nWhat appeared to be an order that would never be carried out due to its deadline extension is now in effect.\nAdvertisementPer the minister, the March 31, 2022 extension was granted in response to requests from stakeholders, including citizens, legal residents, and Nigerians in the diaspora.\nAs the famous phrase goes, “everything that has a beginning has an ending.” I think we might have come to the end of the SIM-NIN-linkage deadline extension."
  },
  {
    "headline": "How to validate your NIN and avoid crowds",
    "summarized_story": "Share this article:Today’s edition of Techpoint Africa Podcast features the Nigerian government following through with two of its threats.\nWe discussed what Nigerians are currently facing as millions of lines have been barred for not linking to NIN.\nFrom our Senior Reporter, Olwanifemi Kolawole getting flogged to NIMC officials abandoning crowds to people looking to gain full control of their SIMs.\nThree banks have flouted that directive and have been slammed with an ₦800 million ($1.9 million) fine.\nYou can catch up on everything we discussed on Apple Podcasts, Google Podcasts, Spotify, or wherever you get your podcasts."
  },
  {
    "headline": "NIN-SIM linkage: Worrying scenes at NIMC office, as Nigerian telcos block defaulting subscribers",
    "summarized_story": "In December 2020, the Nigerian Communications Commission (NCC) ordered all mobile subscribers to link their NINs to their SIM cards.\nHowever, going by the unhappy crowd at NIMC’s office, the prospect of a NIN-SIM linkage could still be a long way off for some people.\nMembers of the Nigeria Security and Civil Defence Corps (NSCDC) were on the ground to disperse the crowd.\nUsing forceful methods for crowd control, the Civil Defence Corps flogged Nigerians in the crowd.\nAn NSCDC member using a whip on Techpoint journalistUnnecessary NIN-SIM linkage crowdsA lady at the scene confirmed that her SIM had been banned from making calls."
  },
  {
    "headline": "Edo begins process of forest allocation to timber concessionaires – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced the process of forest allocation to prospective timber concessionaires in the state as part of efforts to reopen the state’s forest.\nChairman Forestry Commission, Edward Obiaw, in a statement, urged interested Timber Licensees, Sawmillers, Corporate Organizations and Timber Contractors to pick forest allocation application forms at the Edo State Ministry of Environment and Sustainability.\nThe statement reads: “It is hereby announced for the information of the general public that as part of the process to lift the ban on forest exploitation in the state, the Edo State Government is hereby requesting all interested Timber Licensees, Sawmillers, Corporate Organizations and Timber Contractors that application forms for forest allocation are available at the Ministry of Environment and Sustainability, Room 17, Ist Floor, Palm House, Sapele Road, Benin City with a treasury receipt of payment of a non-refundable application fee of N200,000 (Two Hundred Thousand Naira).\n“All completed application forms are to be addressed and submitted to the Chairman, Forestry Commission within two weeks of this announcement.”Recall that the government had announced the prohibition of all forms of timber exploitation from Tuesday 31st August, 2021, following the expiration of the three-year circle of 2018/2021 Forest Allocation in the state.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo community head, motorists calls for speedy completion of road rehabilitation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOza – Motorists and other road users plying the Evbuobanosa-Iru-Oza-Igbanke road in Orhionmwon local government area of Edo state have called on the contracting firm handling ongoing rehabilitation work on the road to speedily complete the project.\nAccording to the traditional head (Odionza) of Oza community, Chief Amadin Idehen, the rehabilitation has been going on smoothly before the construction firm stopped work recently.\n“They started well initially; suddenly they just abandoned the job”, the Odionza told The Nigerian Observer.\nBut, a source who understands the contractual agreements between the federal government and the firm handling the rehabilitation project attributed the stoppage of work to lack of funds.\n“When you award a contract, you first release 25 percent especially on road projects to start work."
  },
  {
    "headline": "Local Govt Autonomy: NULGE seeks traditional Rulers Support – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe leadership of the Nigeria Union of Local Government Employees (NULGE) have appealed to traditional rulers to support the bill for the amendment in granting autonomy for local governments across the country.\nThe President, Edo Chapter of NULGE, Mr Lazarus Adorolo, yesterday made the appeal during an advocacy visit to traditional rulers in Akoko Local Government Area of Edo.\nAdorolo said the visit to traditional rulers was to prevail on the members of state house of assembly to vote in favour of the local government autonomy.\n“Your highness, we are here today to present the people’s charter of demand for local government autonomy for continued support of our traditional rulers for this struggle in our overall interest.\nAlso, the Olokpe of Okpe, Oba Idogun Oshizimete, promised to team up with other traditional rulers to prevail on the lawmakers to ensure the passage of the bill."
  },
  {
    "headline": "Eradicating Lassa fever from Edo State – Nigerian Observer",
    "summarized_story": "Comrade Phillip Shaibu flagged-off Lassa fever eradication campaign at Auchi.\nToday, we decided to flag off Lassa fever eradication campaign.\nOver twenty one persons have died of Lassa fever this year.\nLassa fever can also be passed between patients and staff at poorly equipped hospitals where sterilization and protective clothing is not standard.\nThere is a test centre at Irrua Specialist Hospital, Irrua, Edo State University, Uzarue and the Edo State Government is presently planning a healthy to establish a centre at Auchi Central Hospital."
  },
  {
    "headline": "Accident: Ijaw youths allege assassination attempt, vow to cripple economy if any evil happens to Jonathan",
    "summarized_story": "The Ijaw Youths Council (IYC) Worldwide has alleged that there was an attempt to eliminate Goodluck Jonathan, a former president of Nigeria, vowing to shut down the country’s economy if any evil happens to him.\nJonathan had explained in a statement, Jonathan that the duo died within the vicinity of the Nnamdi Azikiwe International Airport, Abuja.\nReacting to the incident, the IYC called on security agencies to probe it and make public the circumstances that led to the accident public.\nIgbifa warned that the entire Niger Delta and the Ijaw nation would rise in an unprecedented revolution that would if anything happened to Jonathan.\n“We are calling on security agencies to rise up to their responsibilities and beef up security around the former President."
  },
  {
    "headline": "BREAKING: Court dismisses suit seeking to sack Ayade, deputy for joining APC",
    "summarized_story": "An Abuja Federal High Court has dismissed a suit filed by the Peoples Democratic Party (PDP) seeking to sack Ben Ayade Cross River State governor and the deputy governor, Ivara Esu, over their defection to the ruling All Progressive Congress (APC)Justice Taiwo Taiwo, the presiding judge, in his ruling held that the duo could not be sacked from their positions, other than through statutory procedures that were stipulated in sections 180, 188 and 189 of the 1999 Constitution, as amended.\nAccording to the judge, defection to another political party was not stated as one of the grounds for the removal of either a governor or his deputy.\n“The 3rd and 4th Defendant cannot be removed except by Constitutional provision.\n“This court has no power to declare vacant the seat of the 3rd and 4th Defendants”, Justice Taiwo held.\nPDP had in its suit marked FHC/ABJ/CS/975/2021, prayed the court to sack both Ayade and his deputy, contending that the duo, having abandoned the political party that sponsored their re-election, ought"
  },
  {
    "headline": "Buhari says FG to borrow N7.4trn to finance budget deficit",
    "summarized_story": "President Muhammadu Buhari has written to the House of Representatives asking for an increase in the 2022 budget deficit to be financed through borrowing from the domestic market.\nBuhari said this in a letter read by Speaker Femi Gbajabiamila during plenary on Thursday.\nBuhari, in the letter, also requested for the review of the 2022 Medium-Term Expenditure Framework (MTEF) upon which the budget was hinged.\n“The total budget deficit is projected to increase from N965.42 billion to N7.35 trillion representing 3.99 percent of the GDP,” Buhari said.\nThe Speaker thereafter, referred the letter to the House Committee on Finance for further legislative action."
  },
  {
    "headline": "‘I’m sorry’ – Pastor Adeboye’s son, Leke, begs RCCG pastors after calling them ‘goats’",
    "summarized_story": "However, amid the outrage, the pastor’s son, on Thursday, tendered an apology, asking the pastors to forgive his extreme behavior.\nHe noted, however, that has accepted a disciplinary action taken against him in good faith, while pleading that his action be forgiven.\n“I also wish to apologise profusely to the entire leadership and Pastors of our beloved Church who might have been hurt by this statement.\nReacting to such a move, Pastor Leke took to his Instagram account and referred to the RCCG pastors who preached their messages after the G.O.\nNext Thanksgiving Service, just do an altar call, then thanksgiving,” Leke had said."
  },
  {
    "headline": "2023: PDP Seeks UN Support On E-Transmission Of Result",
    "summarized_story": "Ahead of the 2023 general elections, the Peoples Democratic Party (PDP) has urged the United Nations Needs Assessment Mission to avail Nigeria its technical support in the electronic transmission of results.\nAyu said, “Observer teams like yours should not just assess but encourage democratic process.\nAyu, who cited the recent Federal Capital Territory (FCT) elections, added “We’re very confident in a free and fair election.\nThe only obstacle in the way, we believe, is when elections are not conducted freely and fairly.\nSpeaking earlier, Mr Kubwimana said said their mission which is an electoral Needs Assessment mission is in response to a request for electoral support."
  },
  {
    "headline": "Oshiomhole’s Senatorial Bid Will Polarise Edo North APC, Group Warns",
    "summarized_story": "A group under the aegis of Team Alimikhena, has said that the senatorial aspiration of the former national chairman of the All Progressives Congress (APC), Comrade Adams Oshiomhole in 2023 general election would polarise the party in Edo North senatorial district of the state.\nThe group feared a repeat of what happened in the 2020 governorship election where the party members worked at cross purpose.\nIt said this is particularly so because, while people of the senatorial district accept Oshiomhole’s leadership, they reject his aspiration for the senatorial seat.\n“Oshiomhole should not allow himself to be dragged into Edo North senatorial race and be disgraced at the end of the day.\n“They have opened their fangs again to destroy the peace that have existed in the party in Edo North by trying to convince Oshiomhole to dethrone a performing Senator in the person of Francis Alimikhena."
  },
  {
    "headline": "‘Nigeria Needs Concerted Approach To Tackle Insecurity’ – Leadership News",
    "summarized_story": "A stalwart of the All Progressives Congress (APC) Hon Adesina Adarabierin has called for concerted efforts to tackle the problem of insecurity rocking the country.\nAdarabierin who is an aspirant seeking to represent Ado Ekiti constituency I in the state House of Assembly said the ongoing Lenten and Ramadan periods should be used by the citizenry to seek the face of God on the insecurity and other challenges confronting Nigeria.\n“I congratulate the Muslims and indeed all Nigerians for witnessing another Ramadan.\nI want to enjoin them to use this opportunity to pray for the nation, particularly on the precarious security situation being experienced in our country.\nI believe in the efficacy of prayers, that God Almighty will consider our plight and supplication in this holy period and return peace to our land”."
  },
  {
    "headline": "‘Nigeria Needs Concerted Approach To Tackle Insecurity’ – Leadership News",
    "summarized_story": "A stalwart of the All Progressives Congress (APC) Hon Adesina Adarabierin has called for concerted efforts to tackle the problem of insecurity rocking the country.\nAdarabierin who is an aspirant seeking to represent Ado Ekiti constituency I in the state House of Assembly said the ongoing Lenten and Ramadan periods should be used by the citizenry to seek the face of God on the insecurity and other challenges confronting Nigeria.\n“I congratulate the Muslims and indeed all Nigerians for witnessing another Ramadan.\nI want to enjoin them to use this opportunity to pray for the nation, particularly on the precarious security situation being experienced in our country.\nI believe in the efficacy of prayers, that God Almighty will consider our plight and supplication in this holy period and return peace to our land”."
  },
  {
    "headline": "Gov Akeredolu Not Hospitalised In Germany – Aide – Leadership News",
    "summarized_story": "Ondo State government has described a report that Governor Oluwarotimi Akeredolu was hospitalized in Germany “as wicked and misleading.”An online platform had recently reported that the Governor was hospitalised in Germany.\nWhat exposes this shameful falsehood is the fact that media house (name withheld) claimed that the governor was flown out of the country to Germany when in fact, he left for Dubai.\nWhat exposes this shameful falsehood is the fact that SaharaReporters claimed the Governor was flown out of the country to Germany when in fact, he left for Dubai.\n“In clear terms, Governor Akeredolu is not hospitalized anywhere.\nNo amount of borrowed falsehood to cover up their moral deficiencies will bring back their lost political glory,” he said."
  },
  {
    "headline": "BREAKING: Many Feared Dead As Unknown Gunmen Attack Soldiers In Abia",
    "summarized_story": "BREAKING: Many Feared Dead As Unknown Gunmen Attack Soldiers In AbiaUnidentified gunmen opened fire on an Army patrol van in Aba, Abia State’s commercial capital.\nThe event occurred in the early hours of Friday while the soldiers were on patrol, according to reports.\nThe assailants were believed to have set up an ambush for the soldiers.\nOn the Enugu-Aba-Port Harcourt Expressway, the incident occurred at the popular Tonimas junction, Osisioma LGA axis.\nThe committee’s membership was drawn from the five South-East states of Anambra, Abia, Ebonyi, Enugu, and Imo."
  },
  {
    "headline": "Nnamdi Kanu’s trial: DSS operatives block court premises ahead of court ruling",
    "summarized_story": "The Department of State Services, DSS, sealed all roads leading to the Federal High Court in Abuja on Friday, ahead of the resumption of Nnamdi Kanu’s trial as the leader of the Indigenous People of Biafra, IPOB.\nThe DSS is thought to have shut the roads around the courthouse to increase security.\nKanu is scheduled to appear in court before Justice Binta Nyako to continue his 15-count terrorism and felony accusation.\nHowever, according to sources, Justice Tosho, the Chief Judge of the Federal High Court, ordered a secret trial in all terrorism cases.\nMeanwhile, Kanu’s fundamental human rights suit against the federal government is expected to be decided by Justice Nyako."
  },
  {
    "headline": "Ukraine vs Russia War: FG Reacts To Detention Of Nigerians, Other African Students In Poland",
    "summarized_story": "Ukraine vs Russia War: FG Reacts To Detention Of Nigerians, Other African Students In PolandNigeria’s Federal Government has criticised Poland for holding Nigerians and other African students fleeing war-torn Ukraine amid Russian invasion because of their dark color.\n“So, those Nigerians who refused to return are at risk, some are in detention centres in Poland and they are in a traumatic condition.\n“However, inasmuch as Nigeria has given them the opportunity to come back home and they refused, it does not mean the Polish authority will grab them and put them in detention centres.\n“It is not right for them to detain the blacks because they decided to take cover in their country (Poland).\n“They are not putting whites in those detention centres, so send them back to their countries instead of capturing them in detention centres which is the height of racism in a war situation,” Dabiri-Erewa said as quoted by NAN."
  },
  {
    "headline": "Ayade: PDP To Appeal High Court Judgement",
    "summarized_story": "The opposition Peoples Democratic Party (PDP) in Cross River State has announced that it will appeal the Abuja High Court’s decision in favor of Governor Ben Ayade yesterday.\nThe PDP has indicated that it will take the case all the way to the Supreme Court.\nThe party had gone to the Abuja High Court over Ayade’s defection to the ruling APC with the governorship mandate, claiming it as a provocation by unscrupulous forces who had previously been awarded the party’s mandate by mistake.\n“The judgment of yesterday by the Federal High Court sitting in Abuja is yet another successful exploration of the dept of legal jurisprudence in uncharted territory such as we have at hand.\nHe also advised them to stay focused, saying that the ‘larger picture’ will emerge only once the Supreme Court rules on all matters in the case."
  },
  {
    "headline": "Breaking: Court strikes out 8 terrorism charges against Nnamdi Kanu",
    "summarized_story": "Justice Binta Nyako of the Federal High Court Abuja, has struck out eight out of the 15 count charges preferred by the federal government against the detained leader of the Indigenous People of Biafra (IPOB) Mazi Nnamdi Kanu.\nJustice Nyako freed Nnamdi Kanu on the eight counts on Friday, while ruling on a preliminary objection filed by the IPOB leader challenging the validity of the 15-count amended charge preferred against him by the federal government.\n“In this instant preliminary objection application, I have read the counts and come to the conclusion that counts 6, 7, 8, 9, 10, 11, 12 and 14 have not disclosed any offense against the Defendant.\n“‘Counts 1, 2, 3, 4, 5, 8 and 15 shows some allegations, which the Defendant has to answer.\n“The court shall proceed to try the defendant on those counts,” Justice Nyako ordered."
  },
  {
    "headline": "Breaking: Many killed, injured in Ukraine train station attack as Russia drops denial note",
    "summarized_story": "About 30 people were killed and more than 100 injured Friday in a Russian rocket attack on the Kramatorsk train station, one of the easternmost stations still operating in Ukraine, the country’s President Volodymyr Zelenskyy said in a statement.\nThe station was being used to evacuate civilians from eastern Ukraine’s Donbas region.\nAnd if it is not punished, it will never stop.”Around 4,000 people, mostly women and children, were at the train station at the time of the attack, the mayor of Kramatorsk said.\nUkrainian security forces were seen inspecting the remains of a missile across from the train station after the attack.\nRussia denied it had carried out the attack, blaming it on Ukraine’s own forces."
  },
  {
    "headline": "Breaking: UK sanctions 2 Vladimir Putin’s daughters for ‘lavish lifestyle’",
    "summarized_story": "The United Kingdom (UK) has announced sanctions against Russian President Vladimir Putin’s two known daughters in a bid to undermine their ‘lavish lifestyles’.\nThe UK has coordinated these sanctions with the US, in another show of global unity on action against Russia’s illegal invasion of Ukraine.\nThese designations come into force as new analysis shows the devastating impact of the sanctions imposed on Russia’s economy in recent weeks.\nSanctions imposed in response to Putin’s abhorrent actions have triggered rapid inflation, with average consumer prices up 8.67 per cent since the invasion.\nRestricting access to assets and components will have a material effect on the speed and efficiency with which weapons manufacturers can supply Putin’s war effort."
  },
  {
    "headline": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE – NigPilot",
    "summarized_story": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE, CALLS BOOT PARTY AN APPENDAGE OF THE ALL PROGRESSIVE CONGRESS (APC)The Alliance of Collaborating Political Parties (ACPP) has condemned the felonious court case instituted against the People’s Democratic Party Governorship Candidate in Osun State by the Governorship Candidate of the Boot Party, Adesoji Adeleke.\nIn a statement issued by a Chieftain of the Alliance, Wole Adedoyin who was also the 2018 Governorship Candidate of the Hope Democratic Party (HDP) said the case is baseless, mischievous and full of contradictions to ridicule Senator Demola Adeleke and the People’s Democratic Party (PDP).\nACPP said the suit against Senator Demola Adeleke was in bad faith and targeted by undemocratic elements to undermine democracy and good governance in Osun State.\nAdedoyin said: The Boot Party has become an appendage of the All Progressive Congress (APC) in Osun State.\nThe party is not serious about winning the forthcoming Osun Governorship Election."
  },
  {
    "headline": "Soludo sets up 15 man peace Committee on insecurity in South East",
    "summarized_story": "Anambra state government has set up a truth, justice and peace Committee which is comprised of 15 members drawn from different fringes of the South Eastern region.\nThe members of the committee are Prof.Chidi Odinkalu as the Chairman, Amb.\nMrs. Bianca Ojukwu, Secretary, Dr. Joe Nworgu,Dr. Udenta Udenta, Mr. Charles Oputa(Charly Boy), Ms. Onyeka Onyenu.\n” To identify the remote and immediate causes of the agitations, restiveness, violence, and armed struggle in the South East since 1999.\nIt was gathered the committee would be inaugurated on a date to be communicated to its members."
  },
  {
    "headline": "Lalong salutes elder statesman Amb Yahaya Kwande @ 93",
    "summarized_story": "Plateau State Governor Simon Bako Lalong has sent warm felicitations to elder statesman Ambassador Yahaya Kwande on the occasion of his 93rd birthday.\nGovernor Lalong in a message signed by Macham Makut the director of press and public affairs to Governor Lalong congratulated the seasoned Administrator, Politician, Diplomat and philanthropist for his selfless service to Nigeria, Plateau State and humanity at large.\nHe described him as an accomplished personality who has made huge impact in the lives of the people at various times when he occupied various offices in the country.\nThe Governor said Ambassador Kwande has mentored many in public service, politics and humanitarian activities by his record of performance over the years where he has freely offered counsel, support and goodwill to those in power and others.\nAccording to Governor Lalong, Ambassador Yahaya is one of the few elders that have demonstrated sufficient interest in the peace, progress and prosperity of Plateau State and Nigeria over the years, hence his willingness to advise and share his wealth of experience with the Government on key issues."
  },
  {
    "headline": "Edo LG Poll: EDSIEC extends date for conduct of primaries, insists on April 19 for election",
    "summarized_story": "The Edo State Independent Electoral Commission (EDSIEC) has extended the date for the conduct of party primaries for the local government elections by two days.\nThe Commission, however, said the extension will not affect the April 19 date earlier scheduled for the council polls.\nThe statement reads: “It is hereby announced for the information of the general public, particularly Registered Political Parties in the state that the Edo State Independent Electoral Commission has extended the date for the conduct of primaries by two (2) days.\n“This is in view of the number of Registered Political Parties that have scheduled their primaries on the 6th of April, 2022 which is the last day for the conduct of the primaries.\nThe last date for the primaries is Friday, April 8, 2022.”“The shift of date for the primaries has nothing to do with the date of the election, as other dates remain fixed and firm,” Ojo added."
  },
  {
    "headline": "Soludo declares Monday, a prayer session to counter IPOB sit-at-home order – NigPilot",
    "summarized_story": "The Anambra State Governor, Prof. Chukwuma Soludo, has urged the people of the state to observe a one-day prayer session on Monday, to curb the activities of the gunmen terrorising the state and the South East region in general.\nThe governor said the prayer session slated to hold on Monday, April 4, 2022, at churches and other religious worshipping centres across the state was necessary to counter the evil attached to the Indigenous People of Biafra, IPOB sit-at-home order.\nHe explained that the prayer session would be against those hiding under the IPOB name to cause havoc in the state.\n“I enjoin you to pause and join in fellowship as we seek the face of God.It is expected that the conclusion of the prayer session shall mark the end of Sit At Home in Anambra State” Soludo declared.\n” We shall empower them to become useful to their families, communities, state, region and the society at large."
  },
  {
    "headline": "Alleged Terrorism: Court Strikes Out Eight Of 15 Charges Against Nnamdi Kanu",
    "summarized_story": "The Federal High Court in Abuja has struck out eight of the 15 counts against the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nThe 15 charges which bordered on terrorism were filed against Kanu by the Federal Government.\nWhen the case resumed on Friday at the court in the Federal Capital Territory (FCT), Justice Binta Nyako struck out eight of the charges while delivering a ruling on the validity of the charges.\nThe judge, however, acknowledged that counts one, two, three, four, five, 13, and 15 showed some allegations against the IPOB leader, saying the trial of the defendant would proceed on those counts.\nAccording to her, rendition for the purpose of criminal investigation is allowed and in the instant case, there is a bench warrant on the defendant, suffice to say he is a fugitive before the court."
  },
  {
    "headline": "Nigeria Abstains To Vote In Russia’s Suspension From UN Human Rights Council",
    "summarized_story": "Nigeria abstained from voting in Thursday’s suspension of Russia from the Human Rights Council of the UN General Assembly.\nDespite this, the resolution had a two-thirds majority of those voting, excluding members abstaining to vote in the 193-member Assembly.\nThe meeting marked the resumption of a special emergency session on the war in Ukraine and followed reports of human rights violations committed by Russian forces.\nURGENT🚨 The UN General Assembly votes to suspend Russia’s membership in the UN Human Rights Council @UN_HRC In favor: 93 Abstained: 58 Against: 24 pic.twitter.com/6EavdZJspc — UN News (@UN_News_Centre) April 7, 2022This is the second-ever suspension of a country from the Council, following the sanction imposed on Libya in 2011.\nChina, a strong ally of the Vladimir Putin-led administration voted against the suspension which signified a strong backing for the Kremlin."
  },
  {
    "headline": "IGP Appoints New CPs To Curb Gunmen Attacks In Imo, Kaduna, Others",
    "summarized_story": "They are Mohammed Barde (Imo Command), Yekini Ayoku (Kaduna Command), Sikiru Kayode (Adamawa Command), and Abutu Yaro (Edo Command).\n“CP Abutu Yaro, fdc, the new Commissioner of Police, Edo State Police Command, holds a B.A [Hons] from the Ahmadu Bello University, Zaria,” said Adejobi.\n“He has served in various supervisory capacities within the Nigeria Police Force, including as Commissioner of Police in charge of Zamfara and Imo State Police Commands respectively.\n“CP Muhammed Ahmed Barde, the new Commissioner of Police, Imo State Police Command, is a versatile Police Officer.\n“He equally served in Borno State Police Command as Deputy Commissioner of Police in charge of operations."
  },
  {
    "headline": "Federal High Court Bars Media, Others From Terrorism Trials",
    "summarized_story": "There will be no more media coverage for cases bordering on terrorism, the Federal High Court of Nigeria has said.\nThe court’s Chief Information Officer, Dr Catherine Christopher, announced this in a statement on Thursday while outlining FHC’s new practice directions.\nTerrorism proceedings, according to the statement, will be conducted in secret except when the Chief Judge of the court, Justice John Tsoho, grants permission for media coverage.\nIt stated that terrorism proceedings will hold at any place to be designated by the chief judge and in the case of the Abuja Judicial Division, the venue, for the time being, would be the premises of the Code of Conduct Tribunal.\nRead the full Practice Directions Below:"
  },
  {
    "headline": "Studies Show Omicron Lasts Three Days Less Than Delta For Boosted",
    "summarized_story": "People who are vaccinated and have had a booster shot against Covid-19 recover from symptoms from the Omicron variant more than three days earlier than those with the Delta variant, a study said Friday.\nThe study also found that people with Omicron are significantly less likely to lose their sense of smell, and confirmed previous research that it is less severe.\nFor those with two vaccine doses plus a booster, symptoms from Omicron lasted 4.4 days, compared to 7.7 for Delta — a difference of 3.3 days.\nPeople who had two doses but no booster shot saw Omicron symptoms clear up in 8.3 days, compared to 9.6 days for Delta, according to the study published in the Lancet medical journal.\nThe study also found that Omicron patients were 25 percent less likely to be admitted to hospital."
  },
  {
    "headline": "Governor Ortom set to reinstate aides who lost out in election -",
    "summarized_story": "Benue State Governor Samuel Ortom has directed the reinstatement of political appointees who had resigned to contest elections but were not favoured by the zoning arrangement.\nHis decision was made public in a statement by his Chief Press Secretary, Nathaniel Ikyur, after a parley, he had with all political appointees from the 14 local government areas of the state.\nThe governor said the gesture to reinstate the former aides was to show his appreciation for their dedication to supporting and working for his administration, since their appointment, and supporting consensus arrangements in their various constituencies.\nIn his words, “I have no single problem with our National Chairman, Senator Ayu, our leader, Senator David Mark, Senators Gabriel Suswam, Abba Moro, Order Jev, or any leader of the party.\nThe governor will be holding another meeting with his appointees from the Benue South Senatorial District, at a later date."
  },
  {
    "headline": "Governor Ortom set to reinstate aides who lost out in election",
    "summarized_story": "Benue State Governor, Samuel Ortom has directed the reinstatement of political appointees who had resigned to contest elections but were not favoured by the zoning arrangement.\nHis decision was made public in a statement by his Chief Press Secretary, Nathaniel Ikyur, after a parley, he had with all political appointees from the 14 local government areas of the state.\nThe governor said the gesture to reinstate the former aides was to show his appreciation for their dedication to supporting and working for his administration, since their appointment, and supporting consensus arrangements in their various constituencies.\nIn his words, “I have no single problem with our National Chairman, Senator Ayu, our leader, Senator David Mark, Senators Gabriel Suswam, Abba Moro, Order Jev, or any leader of the party.\nThe governor will be holding another meeting with his appointees from the Benue South Senatorial District, at a later date."
  },
  {
    "headline": "PDP promises good governance in Ogun",
    "summarized_story": "People’s Democratic Party in Ogun State has vowed to take over the control of the state from the ruling All Progressives Congress in the 2023 General Election.\nThe party made this known during the public declaration of the Kaduna State Governor’s aide Jimi Lawal held in Ake, Abeokuta.\nParty chieftains noted that the party has capacity to provide good governance towards revamping Ogun State socio economy, political and security architecture."
  },
  {
    "headline": "Governor Akeredolu not hospitalised, says media aide",
    "summarized_story": "The Ondo State Government has described a report published by an online medium that Governor Oluwarotimi Akeredolu, is hospitalized in Germany as wicked and misleading.\nAccording to a statement issued by the Chief Press Secretary to the Governor , Richard Olatunde, the story was fabricated .\nThe statement reads “The news item published on an online medium alleged that the Ondo State Governor , Arakunrin Oluwarotimi Akeredolu, is being hospitalized in Germany , is wicked and misleading.\n“For the records, Governor Akeredolu, alongside other colleagues, left Nigeria for Dubai to attend the largest Annual Investment Meeting in the United Emirates between March 28 and March 31st, 2022.\nHe also transferred power to the deputy Governor, Lucky Aiyedatiwa to perform the functions of his office while he is away."
  },
  {
    "headline": "Macron Regrets Entering France’s Presidential Race Late as Le Pen Cuts Lead",
    "summarized_story": "French President Emmanuel Macron voiced regret on Friday for starting campaigning late as opinion polls showed him holding a slender lead over the far-right candidate Marine Le Pen, who he warned would scare investors away from France.\nLe Pen has surged in the polls in recent weeks and is expected to face off in the second round against Macron, whose re-election was thought to be a foregone conclusion even a few weeks ago.\nMacron is still ahead in the polls for the second-round match-up, but his lead is within the margin of error.\n“Who could have understood six weeks ago that all of sudden I would start political rallies, that I would focus on domestic issues when the war started in Ukraine,” Macron told RTL radio.\n“Her program will create massive unemployment because it will drive international investors away and it will not hold up budget-wise,” he said."
  },
  {
    "headline": "Nigerian Military Launches New Operation to Curb Record Levels of Crude Oil Theft in Niger Delta",
    "summarized_story": "It also revealed that 30 illegal oil refineries had been demobilised in the region by the naval troops in the last two weeks.\nHe explained that the scale of crude oil theft and pipeline vandalism seen in the host communities was beyond explanation, and has rendered the oil and gas industry unworkable.\n“What this did also as you may be aware is that the diesel that you see until last week, when we clamped down on some of these illegal refineries were actually coming from these illegal refineries.\nMany of these illegal refineries are being taken down and also the insertions are being constantly removed and we believe that these interventions will pay off.\nHe said only a formidable workforce with good welfare could rebuild the failing economy and address all the the challenges in the various sectors including the oil and gas industry."
  },
  {
    "headline": "Nigeria: New Revenue Formula Proposes Reduction of FG’s Allocation By 3.33%, States to Increase By 3.07%",
    "summarized_story": "The president recounted that the federal government also made its input into the process of reviewing the vertical revenue allocation formula based on existing constitutional provisions for roles and responsibilities for the different tiers of government.\nBuhari said he would have gone ahead to present the revenue allocation report to the National Assembly as a Bill for enactment.\n‘‘I am aware that the present revenue allocation formula has not been reviewed since the last exercise carried out in 1992.\nHe announced that the proposed vertical revenue allocation formula advised 45.17 per cent for the federal government, 29.79 per cent for state governments and 21.04 per cent for the local governments.\nHe added that literature reviews were conducted on revenue allocation formula in Nigeria dating back to pre-independence period while the Commission received memoranda from the public sectors, individuals and private institutions across the country."
  },
  {
    "headline": "Be Firm, Fair to All Party Members, Buhari Charges APC Chairman Adamu",
    "summarized_story": "President Muhammadu Buhari on Thursday formally received in audience the new National Chairman of the ruling All Progressives Congress (APC), Senator Abdullahi Adamu, at the State House, Abuja, with a call on the party chairman to be firm and fair in his dealings with officers and members of the APC.\nThe president urged the new party chairman to be fair and firm as he was known to be, in all his dealings.\nHe also gave assurance to the party and the nation that he would continue the struggle to entrench democratic principles in politics and the affairs of governance.\n“We all need our father, the president of the Federal Republic of Nigeria, President Muhammadu Buhari.\nWe came out clean and we thought the leadership that Mr. President provided to the party has made all this possible."
  },
  {
    "headline": "Defection: Cross River Governor Ayade Escapes Sack as Judge Bows to Appeal Court Judgment",
    "summarized_story": "In submission to the principle of ‘Stare disisis’ Justice Taiwo Taiwo of the Abuja Division of the Federal High Court, on Thursday refused to order the removal of Cross River State Governor, Prof. Ben Ayade and his Deputy, Prof. Ivara Esu from office.\nAfter taking submissions from counsel, Justice Taiwo had announced that judgment would be delivered Thursday.\nHe said since defection was not one of the constitutional provisions to remove any governor, no court has power to insert such into it.\nWhile agreeing that defection was immoral, improper and condemnable, the judge however, held that judicial precedents of a higher court must be followed by a lower court and applied in similar matters so as to avoid judicial rascality and anarchy.\nThe court held that although parties and facts in the matter that led to Court of Appeal’s new decision are fundamentally different from those before it except on defection alone, the application of judicial precedent must be followed and in fact, binding on lower courts."
  }
]