[
  {
    "headline": "Elon Musk offers to buy Twitter",
    "summarized_story": "Tesla chief Elon Musk has launched a hostile takeover bid for Twitter, offering to buy 100 percent of its stock and take it private, according to a stock exchange filing.\nMusk offered $54.20 a share, which values the social media firm at $43.4 billion, in a filing dated Wednesday April 13 with the Securities and Exchange Commission.\nMusk’s latest move towards Twitter comes just days after he turned down a seat on the board following his acquisition of a 9.2 percent stake in the microblogging platform.\nMusk’s move comes after he tweeted Saturday asking whether the social media network was “dying” and to call out users such as singer Justin Bieber, who are highly followed but rarely post.\nHe has also sparred repeatedly with federal securities regulators, who cracked down on his social media use after a purported effort to take Tesla private in 2018 fell apart."
  },
  {
    "headline": "Jonathan, Gowon present as Buhari presides over Council of State meeting",
    "summarized_story": "), is presiding over a meeting of the Council of State at the Presidential Villa, Abuja.\nFormer heads of state physically in attendance are Abdusalami Abubakar, Goodluck Jonathan, and Yakubu Gowon.\nState governors in attendance are Hope Uzodinma of Imo State; Kayode Fayemi of Ekiti State, Atiku Bagudu of Kebbi State, and Bello Matawalle of Zamfara State, Nasir El-Rufai of Kaduna state among others.\nA presidential aide who shared pictures of the meeting, Buhari Sallau, oosted, President Muhammadu Buhari presides over the Council Of States Meeting where a minute silence was held in honour of Chief Ernest Shonekan in the Council Chambers at the Statehouse, Abuja.\nPresident Buhari (was) with Former President Goodluck Jonathan, Former Head of State Gen. Yakubu Gowon and Former Head of State Gen. Abdulsalam Abubakar shortly before presiding over Council of State Meeting in State House on 14th April 2022.”Details later…Copyright PUNCH."
  },
  {
    "headline": "NDLEA jails 677 drug traffickers, arrests 3,359, seizes 65,915.891kg of hard drugs in Q1",
    "summarized_story": "By Kingsley OmonobiAbuja—The National Drug Law Enforcement Agency,NDLEA has said owing to its intensified war against illicit drug trafficking and abuse across Nigeria, no less than Six Hundred and Seventy Seven (677) traffickers have been convicted and sentenced to various jail terms between January and March 2022.\nThe NDLEA added that a total of Three Thousand Three Hundred and Fifty Nine (3,359) arrests and 65,915.891 kilograms of assorted drugs were seized within the same period.\nA breakdown of further successes against drug abuse showed that, “No fewer than Two Thousand Two Hundred and Twenty Three (2,223) drug users were also counselled through brief interventions and rehabilitated in NDLEA facilities across the country in the first quarter of the year; figures that represent a fair balance between the Agency’s drug supply reduction and drug demand reduction activities”.\nGen. Mohamed Buba Marwa, retd, urged them not to rest on their oars.\nHe assured them that every outstanding performance would always attract commensurate commendation and/or reward."
  },
  {
    "headline": "Olubadan to Yoruba Nation agitators: Don’t be tired",
    "summarized_story": "By Ademola AdegbiteIBADAN—THE Olubadan of Ibadanland, Oba Lekan Balogun, Alli Okunmade II, yesterday, charged Yoruba groups agitating for self-determination not to be weary or tired of the struggle, until it is achieved.\nHe said this while playing host to one of the groups, Atayese, led by Tokunbo Ajasin, in his Alarere residence in Ibadan.\nOba Balogun, who acknowledged the various challenges confronting the people, noted that the situation could weigh down the activists.\nALSO READ:He said: “Tough times never last, only tough people do.\nHe said: “Kabiyesi, we want the unity of purpose among Yoruba Obas and we want you to do your bit in that regard."
  },
  {
    "headline": "Ugwuanyi calls on Tambuwal, three other PDP presidential aspirants to ensure justice, equity, fairness",
    "summarized_story": "Ugwuanyi made the call when the four PDP presidential aspirants visited him at the Enugu State Government Lodge, Abuja, on Tuesday, in continuation of their consultations towards the emergence of a consensus presidential candidate of the party.\nUgwuanyi, President of the 8th Senate, Senator Saraki said they discussed how to strengthen the unity of Nigeria.\nHe added that they also deliberated on the future of the PDP and the possibility of a consensus presidential candidate of the party in the forthcoming National Convention.\nSaraki disclosed that the push by some PDP presidential aspirants for a consensus candidate for the 2023 polls is not a northern agenda.\nWe are not talking about the northern aspirants or southern aspirants."
  },
  {
    "headline": "2023 Presidency: Anyim, Bala Mohammed unveil blueprints ahead of primaries",
    "summarized_story": "On zoning, Anyim said, “as a true party man, I will abide by the decision of the party.\n“I am not going to be a Northern President, or a Muslim Fulani President or a minority President.\nMeanwhile, the party has raked in a total of N645m from the sale of Presidential nomination forms.\nThis is after the party sold forms to 17 aspirants, made up of 16 men and a woman, Diana Oliva.\nWhile the men paid N40m each, Madam Oliva paid N5m for expression of interest form only as nomination forms are waved for women for all elective offices."
  },
  {
    "headline": "40 Rivers PDP aspirants protest as party refuses to issue them forms after payment",
    "summarized_story": "By Davies IheamnachorPORT HARCOURT—Some House of Assembly aspirants under the platform of People’s Democratic Party, PDP, in Rivers State, have staged a protest over alleged refusal of the party to issue them forms after they had reportedly made payments.\nThe aspirants, numbering over 40, who stormed the party’s office in Port Harcourt, yesterday, with their bank drafts and tellers to demand for their forms, accused the party of denying them the forms.\nALSO READ:“Having purchased this draft, I am entitled to forms, both the nomination and Expression of Interest Forms.\n“We will be able to furnish the public with our account, we used in selling nomination forms, let’s see.\nI can inform you on good authority that they never paid their money to PDP Rivers State Chapter account."
  },
  {
    "headline": "Catholic Bishop calls for exemption of aged women from church levies",
    "summarized_story": "The Catholic Bishop of Awka Diocese, Most Rev.\nPaulinus C. Ezeokafor has called for the exemption of women above 80 years from church levies.\nThe Bishop made the call while delivering his homily during the 2022 Chrism Mass/Cathedraticum at the Catholic Cathedral in Awka, Anambra State.\nThe Bishop said only voluntary donations by such persons should be tolerated.\nHe said: “Any woman above 80 years should be exempted from all forms of levy except voluntary donations in the church.”Bishop Ezeokafor is known for his advocacy for the aged and less privileged in society."
  },
  {
    "headline": "BREAKING: Elon Musk makes huge $43 billion offer to take over Twitter",
    "summarized_story": "The Chief Executive Officer of Tesla, Elon Musk, has offered to buy micro-blogging and social media platform, Twitter, for $43 billion.\nMusk announced the offer in a filing with the U.S. Securities and Exchange Commission on Thursday.\nThe billionaire will offer 54.20 per share in cash, representing a 54% premium over the January 28 closing price and a value of about $43 billion.\nMusk later asked whether or not Twitter rigorously adheres to the principle of free speech.\nAfter the majority replied ‘no’, Musk asked whether a new networking site was needed, disclosing he was considering starting his own."
  },
  {
    "headline": "NCC, Google collaborate to drive Nigeria’s digital transformation",
    "summarized_story": "The Nigerian Communications Commission (NCC) and Google Global Services Nigeria have expressed determination to work together towards advancing the actualisation of auspicious national targets for ubiquitous broadband access in furtherance of Nigeria’s digital transformation policy.\nUnderscoring the importance of such synergy between the Commission and Google, Danbatta, who was represented by the Executive Commissioner, Technical Services (ECTS), NCC, Engr.\nUbale Maska, said the Commission looked forward to making the initiatives of both parties more impactful by enhancing cooperation between the NCC and Google Nigeria for quantifiable and remarkable impact.\nAccording to Ehimuan, demands for internet services have increased the need for more capacity, and sustainable collaborations with all relevant stakeholders within the public and private sectors.\nThe Equiano cable system is the third private international cable owned by Google and the 14th subsea cable invested by Google."
  },
  {
    "headline": "Buhari issue shameless statements after killings – HURIWA backs Ortom’s self defense call",
    "summarized_story": "Human Rights Writers Association of Nigeria, HURIWA, has slammed President Muhammadu Buhari over killings across Benue and neighbouring States.\nThe group noted that the President Buhari-led presidency only issues what it described as shameless statements after killings, kidnappings and maiming of innocent citizens have been successfully executed by marauding terrorists.\nThe human rights advocacy organisation said this while condemning the killings of scores of innocent Nigerians in Plateau and Benue States, describing it as unbecoming.\nThe suspected terrorists had invaded about seven communities in Kanam LGA on Sunday and shot at anyone they saw, which led to the killing of over 70 persons.\nHURIWA said, “The security agencies and the regime of President Muhammadu Buhari again failed Nigerians.”The rights group said it “therefore, backs Ortom’s call for self defense” adding that Section 33(2)(a) of the Nigerian Constitution makes self defence lawful."
  },
  {
    "headline": "Rivers lawmaker, Dagogo vows to open State’s financial transactions to EFCC",
    "summarized_story": "Member representing Degema/Bonny Federal Constituency of Rivers State, Rep Farah Dagogo has said there is a need for Rivers State’s financial records to be opened to the Economic and Financial Crimes Commission (EFCC).\nDagogo, who is aspiring to be governor on the platform of the Peoples Democratic Party (PDP) said he will work with the Rivers State House of Assembly to vacate the perpetual injunction preventing the EFCC and other anti-graft agencies from accessing financial records of the State.\nDoing so, he believed, would engender transparency and accountability expected to guide actions of political office holders in the State.\nHe said: “Repositioning Rivers State starts with working in concord with the Rivers State House of Assembly to vacate perpetual injunction preventing EFCC from accessing financial records of the State.”According to him, Rivers State has no reason not to pay pensioners, adding that he will make pensioners his administration’s priority.\nThe governorship aspirant decried the condition of Rivers people, which he said was below average, given the avalanche of resources coming into the State, stressing that he would reposition the State."
  },
  {
    "headline": "JUST IN: Oyenusi, Anini, Osunbor ‘resurrect’ in Ondo",
    "summarized_story": "JUST IN: Oyenusi, Anini, Osunbor ‘resurrect’ in OndoNotorious armed robbers that terrorised Nigeria in the 1980s and 1990s, Oyenusi, Lawrence Anini and Monday Osunbor, have ‘resurrected’ in Ondo State.\nThey ‘resurrected’ in teenage robbery suspects nabbed by the Ondo State Security Network codenamed Amotekun Corps at Ijare area of Akure.\nMembers of the gang named themselves after the late notorious armed robbers who were killed by firing squad.\nAmong the robbers paraded were 14- year- old Anini; 16-year- old Oyenusi and 17-year- old Monday Osunbor.\nThe mother of 14- year- old Anini was also paraded."
  },
  {
    "headline": "BREAKING: Buhari presides over Council of State meeting",
    "summarized_story": "Amid the myriad crises facing the nation, President Muhammadu Buhari is presiding over the Council of State meeting at the Presidential Villa, Abuja.\nThe ongoing Council of State meeting is the fourth session under the Buhari administration with the last one in August 2020.\nOthers are attending the meeting virtually from their various locations.\nThe first held on October 21, 2015; the second on September 7, 2016 and the third one held virtually in August 2020.\nThe Council of State is an organ of the Federal Government saddled with the responsibility of advising the executives on policy making."
  },
  {
    "headline": "Lady calls off wedding over alleged domestic abuse",
    "summarized_story": "A lady in Ebonyi State, Michael Ozioma Helen, has called off her forthcoming wedding due to alleged domestic abuse by her fiance.\nShe a claimed the maltreatment started immediately after the fiance, David Okike paid her bride price.\n“This is my reason why I am calling off the traditional marriage (Igba Ngwu) and white wedding ceremony between me and Daavid Okike”, she said.\n“This Saturday should have been my traditional and white wedding ceremony day.\nShe stated the “bride price paid” will be returned in due time and urged everyone to respect her choices."
  },
  {
    "headline": "Pastor Enenche opens up on Osinachi’s death",
    "summarized_story": "The Lead Pastor of Dunamis international Church and his wife Pastor Paul and Becky Enenche have broken their silence on the death of the late popular gospel musician Osinachi Nwachukwu.\nMany have alleged she was a victim of domestic abuse with her husband Peter Nwachukwu believed to have assaulted her several times, leading to her death.\nEnenche have been called out by many who accused him of maintaining uncomfortable silence since the incident.\nBut Enenche said he knew nothing about domestic abuse that may have led to the singer’s death.\nHe said when the issue persisted, he directed them to the hospital to ascertain the real cause of the pain."
  },
  {
    "headline": "Why Nigeria’s power grid keeps collapsing",
    "summarized_story": "This collapse frequency is due majorly to the lack of a functional and reliable SCADA system that usually perceives disturbances and employs mitigating actions.\nThe SCADA/EMS may therefore be considered the Power System’s ‘brain’ responsible for the efficient management and operation of interconnected systems within the Grid.\nAn electric power grid is a network of interconnected power systems for delivering power from producers to consumers.\nThe collapse of the grid means loss of power supply across the environments/customers that the grid supplies.\nThe current TCN SCADA/EMS has centralized data aggregation centres at NCC Osogbo and SNCC Shiroro."
  },
  {
    "headline": "GOC warns civilians using vehicles painted in military colours to desist",
    "summarized_story": "BY PHILIP NWOSUThe Nigerian Army in Lagos has warned persons using vehicles painted in Nigerian Army colour of green to desist from such and reverse the colours of the their as the force will not hesitate to deal with them appropriately.\nGeneral Musa explained that persons who display military accoutrements such as banners, belts, stickers and other items are most often not military personnel, but use such to evade laws of the country and harass law abiding citizens.\nHe described as “an unfounded” narrative that all illicit acts committed by persons dressed in military uniforms are always by military personnel.\nThe General Officer Commanding , said the suspects were fully dressed in military camouflage uniforms, which portrayed the Nigerian Army personnel and makes action taken by them as action taken by legitimate personnel of the force.\nHe urged members of the public to desist from wearing military uniform and T- Shirts or display of military banners, belts and stickers on vehicles as well as driving of civil vehicles painted in Army colours."
  },
  {
    "headline": "Gunmen kill 4 policemen, set Anambra station ablaze",
    "summarized_story": "From Jeff Amechi Agbodo, OnitshaNo fewer than four policemen were, yesterday, killed at the Atani police station in Ogbaru Local Government Area of Anambra State.\nThe gunmen, who stormed the police station at about 1am, after killing the police officers set part of the station ablaze.\nThe Atani station attack came after several attacks on police stations and local government headquarters in recent times across the state.\nHe said that the commissioner of police and other police officers, at about 1.30am, stormed the place and engaged the hoodlums which made them to flee the station.\n“It is unfortunate that we lost of four our police officers while the hoodlums burnt part of the station when they attacked the police station at about 1.am Wednesday."
  },
  {
    "headline": "US rates Buhari’s govt low on corruption",
    "summarized_story": "By Chinelo ObogoThe United States of America government has said the Federal Government’s failure to consistently implement laws which penalises corruption led to massive, widespread and pervasive corruption which has affected all levels of government.\n“Massive, widespread, and pervasive corruption affected all levels of government, including the judiciary and security services.\nThe constitution provides immunity from civil and criminal prosecution for the president, vice president, governors, and deputy governors while in office.\n“Domestic and international human rights groups generally operated without government restriction, investigating and publishing their findings on human rights cases.\n“In the North East, there were reports that the military threatened non-governmental organisation and humanitarian organisations after aid provided by these organisations purportedly reached insurgent groups,” the report stated."
  },
  {
    "headline": "Reps renew call for declaration of state of emergency on security",
    "summarized_story": "He claimed security agencies had reliable information at their disposal of the various camps of the terrorists at Kambari forest in Taraba State.\nHe said members would now understand the complicity of the security agencies in the killings, stating that actions needed to be taken against some security agencies.\nHe added that in this case, he did not know what anybody could do not to hold the security agencies responsible.\nHe, however, said there was no way such killings would be happening without security information but condemned the attempt of always sweeping it under the carpet.\n“The security agencies come here, present their budget and we allow it pass, there is no oversight function to unravel the truth."
  },
  {
    "headline": "Presidency replies northern elders, says security reforms coming soon",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe presidency has reacted to the call by Northern Elders Forum (NEF) for the immediate resignation of President Muhammadu Buhari over killings across the country, especially in the North.\nA statement by Senior Special Assistant on Media and Publicity, Garba Shehu, assured of reforms on the security sector by the government.\nHe, however, accused the NEF of seeking publicity like oxygen as was the norm with failed politicians.\nHe said the call for President Buhari’s resignation was not a solution to the security problems facing the country.\n“The presidency does not wish to be drawn into the high-decibel show in the media, taking the nation by the storm from the Northern Elders Forum."
  },
  {
    "headline": "FG Links Kaduna Train Attack to Synergy Between Boko Haram and Bandits",
    "summarized_story": "“Who are the various security agencies that are supposed to protect the lives of the people?\nBamidele Salam (PDP Osun) lamented that information and early warnings were given to the security agencies, but the failed to act.\nFatuhu Mohammed (APC Katsina) said despite budgetary allocations, security agencies appeared to be unwilling to do their job.\nWase said the security agencies were part of the worsening insecurity.\nI want you to understand the complicity of security agencies in this matter."
  },
  {
    "headline": "NLC Seeks High-powered Panel to Resolve FG-ASUU Crisis Within 21 Days",
    "summarized_story": "Arising from a meeting with the unions in the universities in Abuja, the NLC said it’s concern was the litany of agreements that government had failed to implement.\n“Prior to the strike, due process was duly followed and the notice were issued in line with the extant laws.\nShamefully and painfully, there was no attempt by the government to intercept or even invite the unions to a meeting.\nMeanwhile, ASUU has called on the federal government to scrap the National Information Development Agency (NITDA) over its failure to implement the union’s University Transparency and Accountability Solution (UTAS).\nThe Sokoto Zonal office of ASUU comprises Umaru Musa Yar’Adua University, Katsina; Usmanu Danfodio University, Sokoto; Kebbi State University of Science and Technology, Aliero; Sokoto State University, Sokoto, and Federal University, Dutsinma."
  },
  {
    "headline": "FG Attributes Erratic Power Supply, Infrastructure Failure to Sabotage",
    "summarized_story": "It’s not only in the power sector alone, you have just heard about the insecurity.\nSo, they’re not working on the switch yard on the line and if they don’t finish these two, you cannot evacuate.\nThe FEC meeting also approved N1.4 billion for the supply of more equipment for the Transmission Company of Nigeria (TCN), in order to boost power supply in the country.\nAliyu, said he presented two memos from the ministry of power for the Transmission Company of Nigeria.\nHis words: “The second memo was for the supply of handling equipment, haulage and operational vehicles for the TCN at N1,338,159,080."
  },
  {
    "headline": "Breaking: Immigration Arrests Passenger with Firearm at Lagos Airport",
    "summarized_story": "The Nigeria Immigration Service (NIS), the Murtala Muhammed Airport (MMA), Lagos Command on Wednesday morning intercepted an American citizen with firearm at the airport.\nThe male passenger (names withheld), who arrived the country aboard a United Airlines flight from Houston, United States at 10:10am, was said to have checked-in the firearm.\nA source close to the Lagos Airport confided in our correspondent on Wednesday that the American citizen did not declare the firearms as stipulated in international laws on firearms carriage.\nThe source said: “Officials of the Nigeria Immigration Service actually intercepted the passenger with the firearms during screening.\nSo far, the passenger is undergoing scrutiny from the officials of the service and will be handed over to the relevant authorities after interrogation."
  },
  {
    "headline": "Breaking: Statistician-General, Simon Harry, is Dead",
    "summarized_story": "James Emejo in AbujaThe National Bureau of Statistics (NBS) has confirmed the death of the Statistician-General of the Federation (SGF), Dr. Simon Harry.\nDirector, Communication and Public Relations Department, Mr. Ichedi, Sunday Joel, confirmed Harry’s passage adding that “He died from an illness”.\nThe deceased reportedly fell sick last Saturday, and was immediately accorded medical attention but succumbed to the cold hands of death early Wednesday.\nPresident Muhammadu Buhari approved his appointment as chief executive of the NBS in August 2021, after the two-term historic reign of Dr. Yemi Kale as SGF.\nIchedi had earlier denied reports of Harry’s death which was published by an online news platform."
  },
  {
    "headline": "Catch Me If You Can, Bauchi Governor, Mohammed Dares EFCC, Other Anti-Graft Agencies To Prove He’s Corrupt",
    "summarized_story": "Governor Bala Mohammed of Bauchi State has dared anti-graft agencies that previously investigated him to tell Nigerians if he was found guilty.\nThe governor challenged the Economic and Financial Crimes Commission (EFCC), the Independent Corrupt and Practices and Other Related Offences Commission (ICPC) and other anti-corruption agencies as he seeks to contest for President.\nMohammed, however, said if elected, he would not be a northern president, but one who captures the nuanced aspirations of every part of the country.\nBut I dare anybody to find me guilty because I know my conscience and that’s why I’m still standing here.\nI dare every investigative agency; I did my best.”Citing his record in the past three years in office as governor, Mohammed argued that states do not have to be rich before providing infrastructure for their people."
  },
  {
    "headline": "Catch Me If You Can, Bauchi Governor, Mohammed Dares EFCC, Other Anti-Graft Agencies To Prove He’s Corrupt",
    "summarized_story": "Governor Bala Mohammed of Bauchi State has dared anti-graft agencies that previously investigated him to tell Nigerians if he was found guilty.\nThe governor challenged the Economic and Financial Crimes Commission (EFCC), the Independent Corrupt and Practices and Other Related Offences Commission (ICPC) and other anti-corruption agencies as he seeks to contest for President.\nMohammed, however, said if elected, he would not be a northern president, but one who captures the nuanced aspirations of every part of the country.\nBut I dare anybody to find me guilty because I know my conscience and that’s why I’m still standing here.\nI dare every investigative agency; I did my best.”Citing his record in the past three years in office as governor, Mohammed argued that states do not have to be rich before providing infrastructure for their people."
  },
  {
    "headline": "$1billion Malabu Oil Deal: Ex-President Obasanjo Denies Agreement Relied Upon By Former Attorney-General Adoke, Others To Sell OPL 245 Licence",
    "summarized_story": "The ministry under Adoke entered into a settlement agreement to return a licence lost through the court to Malabu, even without an appeal challenging the High Court decision delivered against Malabu.\nAdoke claims, albeit falsely, that Obasanjo sanctioned the out of court settlement.\nHowever, Mr Obasanjo himself has emphatically denied this.\nThat is the approach that Mr Ojo (and Mr Adoke) should have taken to dealing with Etete – but of course, they did not.\"\nIn the interview with Premium Times in 2017, the former President warned Adoke to cease further mention of his name in the controversial $1.1 billion Malabu Oil deal."
  },
  {
    "headline": "$1billion Malabu Oil Deal: Ex-President Obasanjo Denies Agreement Relied Upon By Former Attorney-General Adoke, Others To Sell OPL 245 Licence",
    "summarized_story": "The ministry under Adoke entered into a settlement agreement to return a licence lost through the court to Malabu, even without an appeal challenging the High Court decision delivered against Malabu.\nAdoke claims, albeit falsely, that Obasanjo sanctioned the out of court settlement.\nHowever, Mr Obasanjo himself has emphatically denied this.\nThat is the approach that Mr Ojo (and Mr Adoke) should have taken to dealing with Etete – but of course, they did not.\"\nIn the interview with Premium Times in 2017, the former President warned Adoke to cease further mention of his name in the controversial $1.1 billion Malabu Oil deal."
  },
  {
    "headline": "Cross River Governor, Ayade Presents ‘Status-befitting’ Vehicles To Judges For ‘Standing With The Truth’",
    "summarized_story": "Governor Ben Ayade of Cross River on Wednesday in Calabar gifted newly-appointed judges brand new SUVs.\nAccording to a statement by the Cross River government, he described the gesture as a way of appreciating the judges for “standing with the truth”.\n“I’m here with the chief judge of Cross River state, justice Akon Ikpeme.\n“Against this background, the people of Cross River state want to show appreciation to the judiciary.\nJustice Taiwo Taiwo, in a judgment, said he was bound by the decision of a higher court which delivered a judgment on April 1 in a similar case in Enugu."
  },
  {
    "headline": "Peter Obi, Fayose, Dele Momodu and other presidential jokers",
    "summarized_story": "There are presidential hopefuls and there are presidential jokers.\nPeter Obi, former governor of Anambra state and member of the Peoples Democratic Party (PDP), is a presidential joker.\nPeter Obi is no match for any of the APC presidential hopefuls — Bola Tinubu, Vice-President Yemi Osinbajo, and Rotimi Amaechi.\nDele Momodu is a presidential joker.\nAdvertisementThere are presidential hopefuls and there are presidential jokers."
  },
  {
    "headline": "Peter Obi, Fayose, Dele Momodu and other presidential jokers",
    "summarized_story": "There are presidential hopefuls and there are presidential jokers.\nPeter Obi, former governor of Anambra state and member of the Peoples Democratic Party (PDP), is a presidential joker.\nPeter Obi is no match for any of the APC presidential hopefuls — Bola Tinubu, Vice-President Yemi Osinbajo, and Rotimi Amaechi.\nDele Momodu is a presidential joker.\nAdvertisementThere are presidential hopefuls and there are presidential jokers."
  },
  {
    "headline": "Elon Musk offers $43bn to buy Twitter",
    "summarized_story": "Elon Musk, the billionaire founder of Tesla Inc, has offered to buy Twitter at $54.20 per share in cash.\nMusk said the microblogging platform needs to be transformed into a private company.\n“However, since making my investment, I now realise the company will neither thrive nor serve this societal imperative in its current form.\nTwitter needs to be transformed as a private company.\n“Twitter has extraordinary potential."
  },
  {
    "headline": "Elon Musk offers $43bn to buy Twitter",
    "summarized_story": "Elon Musk, the billionaire founder of Tesla Inc, has offered to buy Twitter at $54.20 per share in cash.\nMusk said the microblogging platform needs to be transformed into a private company.\n“However, since making my investment, I now realise the company will neither thrive nor serve this societal imperative in its current form.\nTwitter needs to be transformed as a private company.\n“Twitter has extraordinary potential."
  },
  {
    "headline": "Naira hits N590/$1 at parallel market ahead of Easter break",
    "summarized_story": "As the Easter holiday approaches, the Nigerian naira weakened to N590 to a dollar at the parallel market.\nOn Thursday morning, street traders (abokis) told TheCable that one dollar exchanged for N590.\nThey put the buying price of the dollar at N585 and the selling price at N590, leaving a N5 profit margin.\nAdvertisementA BDC operator at Ikeja, simply identified as Musa, told TheCable that there has been a surge in demand for the greenback because of the fast-approaching Easter holiday.\nThe development may cause the naira to weaken due to rising dollar demand as Nigerian travellers may have to buy dollars from the parallel market to purchase tickets."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "MTN Nigeria secures approval to operate Mobile Money Bank",
    "summarized_story": "MTN Nigeria, the Nigerian arm of Africa’s largest telecom, today received final approval from the Central Bank of Nigeria to run a payment service bank.\nWith this approval, MTN Nigeria can provide virtually all the services offered by conventional commercial banks with the exception of granting credit and processing foreign exchange transactions.\nThis announcement follows a previous approval in principle granted in November 2021, to Airtel Africa Plc and MTN Nigeria Communications Plc to operate a payment service bank in the country.\nIn January, MTN revealed that MTN Nigeria’s mobile money service had attracted 9.4 million active users since launching in August 2019.\nThis approval is expected to spur the adoption of mobile money in Nigeria as the use cases increase."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Banditry is now the Financial Wing of Boko Haram – Nigerian Observer",
    "summarized_story": "He said: “What is happening now is that there is a kind of an unholy handshake between bandits and Boko Haram insurgents.\nThe only avenue left for Boko Haram to raise funds now is banditry.\nBandits are occupying Zamfara, Katsina, Sokoto, Kebbi, Niger and Kaduna States to raise funds for Boko Haram.\nBanditry represents the financial wing of Boko Haram to raise funds to finance terror activities.\nBandits are terrorists who can raise funds for Boko Haram across Nigeria."
  },
  {
    "headline": "Edo govt pledges reforms to enhance growth of businesses, promote made-in-Edo goods – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has reaffirmed its commitment to promoting made-in-Edo goods to enhance economic growth and development, reassuring policies and reforms to ensure that businesses in the state thrive.\nThe Edo State Commissioner for Industry, Trade and Cooperatives, Afishetu Braimoh, gave the assurance during a meeting with stakeholders, in Benin City, to review strategies for ensuring that locally made products are exported across the world.\nShe said the vision for the Ministry is to drive economic growth and generate wealth through policies that make it easy to do business, promote investment and develop enterprises in Edo State.\n“NADAC is in partnership with us as they are ready to create a friendly environment and improve the process to make it easier to do business in Edo State.\nHe added, “We are happy and encouraged by this stakeholders’ meeting."
  },
  {
    "headline": "Edo to build more facilities for Lassa fever testing – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has disclosed plans to build more facilities for Lassa Fever testing, as part of efforts to contain the epidemic in the state.\nThe Commissioner for Health, Prof. Obehi Akoria, disclosed this while briefing journalists after the weekly Edo State Executive Council (EXCO) meeting chaired by Governor Godwin Obaseki, at the Government House, in Benin City.\n“We have expanded the testing site to include the primary health care centre at Ugbekun and the one at Lucky Way in Iwokpan Primary Healthcare centre and our people are there to provide free medical services.\n“We have also expanded our screening centres in Edo North Senatorial District, specifically the one at the Warrake and Jattu primary health care centres and at Edo Central at Ewohi and Ewohimi primary health care centres.\nWe are hoping that our people will take advantage of these open doors and get the best of health care,” the commissioner added."
  },
  {
    "headline": "Osinbajo lobbies Govs, Senators, invites APC Reps – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestVice-President Yemi Osinbajo has stepped up efforts to lobby state governors ahead of the party’s presidential primaries.\nHe also met, yesterday, with the House of Representatives Caucus..\nThe Chairman, Committee on Finance, James Faleke, who is also the Convener of the Tinubu Support Group, told The NIGERIAN OBSERVER that Tinubu remained the candidate of the APC caucus in the House.\nThe Iftar/Easter dinner was scheduled for 6.30 pm at the Aguda House, Presidential Villa, Abuja.\nAlso, Tuesday, Osinbajo invited the APC caucus in the House to the Banquet Hall of the Presidential Villa for the Iftar dinner on Wednesday."
  },
  {
    "headline": "FG says Port Harcourt refinery will begin refining 60,000 bpsd by Q1 2023",
    "summarized_story": "Mr Timipre Sylva, minister of state for petroleum resources, has said the Port Harcourt refinery will resume operations by the first quarter of 2023.\n“This project kicked off second quarter last year, and where they are now is quite impressive.\n“When people begin to equate modular refinery with the criminality that is going, I think they don’t go together,” he said.\nWhat is going on in Port Harcourt and some of these areas causing problem is a criminal activity, and we cannot legalise that criminal activity.\nThe programme of starting a modular refinery had always been on."
  },
  {
    "headline": "Presidency rejects call for Buhari to resign, hits back at Northern elders",
    "summarized_story": "The presidency has dismissed the Northern Elders Forum (NEF)’s call on President Muhammadu Buhari to resign over the nation’s security challenges.\nThe President’s Senior Special Assistant on Media and Publicity, Garba Shehu, in a statement on Wednesday in Abuja, said resignation of the president would never be a solution to the nation’s security problems.\nShehu said the defence establishment has realigned and reorganised the ongoing operation in the affected areas to achieve positive results.\nThe statement reads in part: “The Presidency does not wish to be drawn into the high-decibel show in the media, taking the nation by the storm from the Northern Elders Forum.\n“Nigerians are assured that the government will keep its promise to the nation and threats to security will be handled with the firmness they call for."
  },
  {
    "headline": "Gunmen kill four in another Anambra police station attack",
    "summarized_story": "Gunmen have killed four police officers, including a female officer, in an attack at the Atani Police Station in Ogbaru Local Government Area of Anambra State.\nThe gunmen invaded the police facility at about 1.30am on Wednesday, and immediately launched an attack.\n“The Commissioner of Police, Echeng Echeng, on hearing the news of the attack, immediately mobilised men of the command from various units to the area.\n“The hoodlums were still there when the CP led men of the command to the affected area.\n“We have already commenced intelligence gathering, and we hope to unravel the persons behind the attack.”"
  },
  {
    "headline": "Simon Harry, Nigeria’s statistician-general has died",
    "summarized_story": "Simon Harry, head of the National Bureau of Statistics (NBS), has died.\nThe rumour of his death went around at the weekend, but was debunked by the NBS.\nHowever, Sunday Ichedi, head of NBS, communication and public relations department, confirmed to the development on Wednesday.\nHarry was appointed by President Muhammadu Buhari in August 2021 to replace Yemi Kale as head of NBS.\nBefore his appointment as the statistician-general of the federation, he was the director of corporate planning and technical coordination, department of the NBS — with almost three decades of statistical experience"
  },
  {
    "headline": "JUST-IN: Insecurity, Economy Top Agenda As Buhari Chairs Council Of State Meeting",
    "summarized_story": "President Muhammadu Buhari is currently presiding over a meeting of the Council of State at the Presidential Villa in Abuja on Thursday morning.\nThe Council of State is an organ of the Federal Government saddled with the responsibility of advising the executive arm of government on policy matters.\nFormer Heads of State physically in attendance are Gen. Yakubu Gowon, Gen. Abdusalami Abubakar and former President Goodluck Jonathan.\nADVERTISEMENTOthers are attending the meeting virtually from their various locations.\nState governors in attendance are Hope Uzodinma (Imo), Kayode Fayemi (Ekiti), Atiku Bagudu (Kebbi), Bello Matawalle (Zamfara), ans Nasir El-Rufai (Kaduna), amongst others."
  },
  {
    "headline": "Easter: Kwara NSCDC Deploys 800 Personnel",
    "summarized_story": "The Nigeria Security and Civil Defence Corps (NSCDC) in Kwara State, has deployed 800 personnel to man security during the Easter celebrations.\nThe State Commandant of NSCDC, Makinde Iskil Ayinla, said the deployed personnel were drawn from various departments and units of the Corps especially armed squad unit, anti-vandal, intelligence and investigations, operations and counter terrorisim.\nAyinla said that the personnel would complement the efforts of other security agents in ensuring hitch-free celebrations.\nADVERTISEMENTHe disclosed that the officers of the NSCDC would complement other security agents in mounting surveillance at recreational centres, worship centres and markets, adding that all the identified flashpoints would be well secured.\nHe felicitated with the Christians in the state and enjoined them to use the occasion to pray for the state in particular and Nigetia in general."
  },
  {
    "headline": "2023: Afenifere Faults Baba-Ahmed’s Attack On Adebanjo",
    "summarized_story": "Pan-Yoruba socio-political group, Afenifere, has faulted the comments of the Northern Elders Forum (NEF) director of Publicity and Advocacy, Dr Hakeem Baba-Ahmed, on its leader’s views on the forthcoming presidential election.\nBaba-Ahmed had said they were not moved by Adebanjo’s warning that any attempt by a northerner to succeed President Muhammadu Buhari in 2023 would spell doom for Nigeria.\nReacting in a statement issued in Akure, the Ondo State capital, the Secretary-General of Afenifere, Chief Sola Ebiseni, said, “It is clear that Baba-Ahmed and those he claims to speak for are only dwelling in their myopic and minority positions about Nigeria and its politics.\nEbiseni stressed that “In these perilous times, when men and women of goodwill are in, utmost sobriety, in search of solutions to its myriads of challenges, it is surprising that the likes of Hakeem Baba-Ahmed would not appreciate the concerns of an elder statesman like Chief Ayo Adebanjo, on the need for the requisite political engineering that will serve to detonate the several time bombs.”He added that, “Baba-Ahmed’s unprovoked vituperations on a man, his father’s age mate, is strange and an eloquent testimony of his imported culture.”ADVERTISEMENTAccording to him, “ Patriotic view, expressed within the context of a deep analysis of the country’s political history, that Hakeem Baba-Ahmed, in his characteristic uncouth language, dismissed as a laughable threat targeted at the North (his North) which he said would continue to vote according to the dictates of its interests.\n“Afenifere noted the laughable crocodile tears of Baba-Ahmed and his group on the current pervasive and intractable state of insecurity in Nigeria and the call for the resignation of President Buhari as if any clear-thinking Nigerian is so impressed.’’"
  },
  {
    "headline": "2023: Afenifere Faults Baba-Ahmed’s Attack On Adebanjo",
    "summarized_story": "Pan-Yoruba socio-political group, Afenifere, has faulted the comments of the Northern Elders Forum (NEF) director of Publicity and Advocacy, Dr Hakeem Baba-Ahmed, on its leader’s views on the forthcoming presidential election.\nBaba-Ahmed had said they were not moved by Adebanjo’s warning that any attempt by a northerner to succeed President Muhammadu Buhari in 2023 would spell doom for Nigeria.\nReacting in a statement issued in Akure, the Ondo State capital, the Secretary-General of Afenifere, Chief Sola Ebiseni, said, “It is clear that Baba-Ahmed and those he claims to speak for are only dwelling in their myopic and minority positions about Nigeria and its politics.\nEbiseni stressed that “In these perilous times, when men and women of goodwill are in, utmost sobriety, in search of solutions to its myriads of challenges, it is surprising that the likes of Hakeem Baba-Ahmed would not appreciate the concerns of an elder statesman like Chief Ayo Adebanjo, on the need for the requisite political engineering that will serve to detonate the several time bombs.”He added that, “Baba-Ahmed’s unprovoked vituperations on a man, his father’s age mate, is strange and an eloquent testimony of his imported culture.”ADVERTISEMENTAccording to him, “ Patriotic view, expressed within the context of a deep analysis of the country’s political history, that Hakeem Baba-Ahmed, in his characteristic uncouth language, dismissed as a laughable threat targeted at the North (his North) which he said would continue to vote according to the dictates of its interests.\n“Afenifere noted the laughable crocodile tears of Baba-Ahmed and his group on the current pervasive and intractable state of insecurity in Nigeria and the call for the resignation of President Buhari as if any clear-thinking Nigerian is so impressed.’’"
  },
  {
    "headline": "Mandilas Empowers Artisans In Lagos With Requisite Tools",
    "summarized_story": "As part of its corporate social responsibility (CSR), Mandilas Group Limited has donated complete mechanical toolboxes and spraying machines to artisans within Lagos Island East Local Council Development Area (LCDA).\nHanding over the tools as part of activities to mark the 2022 Artisans Day celebration, the group chief executive officer, Mandilas Group Limited, Ola Debayo-Doherty, explained that the donated mechanical tools would have a positive impact on the lives of the youths in the community.\n“Mandilas Group Limited has been in operation for over 70 years and much of our history has been shaped by this community.\nFolawiyo said, “We must thank our partner, Mandilas Group, who has been a worthy and responsible corporate organisation since the beginning of this administration.\nOn behalf of the good people of Lagos Island East LCDA and particularly the beneficiaries of your kindness, we thank you immensely.’’"
  },
  {
    "headline": "Osinachi Nwachukwu's house of horror: Children tell heart-rending stories",
    "summarized_story": "Children of the late popular gospel artiste, Osinachi Nwachukwu have opened up on the despicable horror they and their mother experienced with their father Peter Nwachukwu.\n“When I came into the compound, I saw the children, four beautiful children; three boys, one girl.\nHe (Peter) had told the children that they should not speak about the things that have been happening in the house.\n“Then he opened up… And said that their dad used to beat their mom and their mom was always sad.\nThen he opened up… And said that their dad used to beat their mom and their mom was always sad."
  },
  {
    "headline": "Muslim youths urged to embrace social reformation",
    "summarized_story": "Ahmed IyandaMuslim youths have been urged to take up the responsibility to reform society as the contemporary world is immersed in corruption, mischief, and other social vices.\nThe cleric said the alarming trend of social vices among youths suggested that youths have not been playing their roles effectively in nation-building.\n“Muslim youths are a representation of Islam.\nHe, however, urged Muslim youths to pay more attention to self-awareness to stem the tide of social vices in the country, saying they have the biggest role to play in societal reformation.\nHowever, he tasked Muslim youth to be productive and be instruments of change."
  },
  {
    "headline": "Catch Me If You Can, Bauchi Governor, Mohammed Dares EFCC, Other Anti-Graft Agencies To Prove He’s Corrupt",
    "summarized_story": "Catch Me If You Can, Bauchi Governor, Mohammed Dares EFCC, Other Anti-Graft Agencies To Prove He’s CorruptGovernor Bala Mohammed of Bauchi State has dared anti-graft agencies that previously investigated him to tell Nigerians if he was found guilty.\nThe governor challenged the Economic and Financial Crimes Commission (EFCC), the Independent Corrupt and Practices and Other Related Offences Commission (ICPC) and other anti-corruption agencies as he seeks to contest for President.\nMohammed, however, said if elected, he would not be a northern president, but one who captures the nuanced aspirations of every part of the country.\nBut I dare anybody to find me guilty because I know my conscience and that’s why I’m still standing here.\nI dare every investigative agency; I did my best.”Citing his record in the past three years in office as governor, Mohammed argued that states do not have to be rich before providing infrastructure for their people."
  },
  {
    "headline": "Anambra govt marks Odumeje’s church for demolition",
    "summarized_story": "The government of Anambra State has reportedly marked the church of controversial prophet, Chukwuemeka Ohanemere, alias Odumeje, for demolition.\nThe church, Mountain of Holy Ghost Intervention Deliverance Ministry World Miracle Center, alias Land of Freedom, is located at number 88B Bida Road, Fegge, Onitsha.\nThe state government marked the church structure as an illegal structure, and asked that it be removed.\nOdumeje, known for his acrobatic performances during church service, is a widely known cleric based in the Anambra commercial capital.\nIt remains unclear whether the government would carry out the demolition order."
  },
  {
    "headline": "Obasanjo’s Succession Plan Mentioned As Buhari’s Body Language Unsettles Osinbajo, Tinubu, Amaechi, Others",
    "summarized_story": "It was gathered that the inability of the aspirants to properly deduce the direction of the president delayed the declaration of some of the aspirants including Osinbajo and Amaechi.\nStarting with Tinubu, the presidential aspirants of the ruling party had sought for the blessings of the president before declaring for the race.\nThe Independent National Electoral Commission (INEC) had issued a deadline of June 3, 2022, for political parties to conduct their primaries.\nThey include; Tinubu, Osinbajo, Amaechi, Governor David Umahi of Ebonyi State, Yahaya Bello of Kogi State, business tycoon Gbenga Olawepo-Hashim, a former governor of Imo State, Rochas Okorocha as well as Ihechukwu Dallas Chima (IDC).\nHowever, another source said the president seems not to be conformable with the candidatures of Osinbajo and Tinubu."
  },
  {
    "headline": "Osinachi: Lady cancels April 16, 2022 wedding over abuse + Photos",
    "summarized_story": "A social media user, Ada Uburu, has cancelled her wedding to David Okike, scheduled for April 16, 2022.\nThe announcement by the social media user came amid the death of gospel musician, Osinachi Nwachukwu.\nThey are scheduled to hold the traditional and white wedding and this Saturday.\nThis is my reason why I am CALLING OFF the Traditional Marriage (Igba Ngwu) and White Wedding ceremony between me and DAVID OKIKE OFF.\n(Beating me was not part of the agreement in our Marriage)This Saturday should have been my traditional and white wedding ceremony day…."
  },
  {
    "headline": "VIDEO: Watch as Dunamis Pastor, Paul Enenche, breaks silence on Osinachi Nwachukwu’s death at last",
    "summarized_story": "The Founder and Senior Pastor of Dunamis International Gospel Center, Pastor Paul Enenche, has broken his silence over the death of his member, Nwachukwu Osinachi.\nIn a video posted on the pastor’s verified social media handles, he said, he was not aware of any case of domestic violence involving the late singer until after her death.\nEnenche said he was only aware of her respiratory health challenge, which he helped her secure medical assistance."
  },
  {
    "headline": "Insecurity: Bandits now partner dislodged Boko Haram terrorists – FG",
    "summarized_story": "The federal government Wednesday said bandits operating in the North-west and parts of the North-central zones now collaborate with Boko Haram terrorists dislodged from the North-east region.\n“What is happening now is that there is a kind of an unholy handshake between bandits and Boko Haram insurgents.\nPreliminary reports of what transpired at the Kaduna train attacks show that there is a kind of collaboration between the bandits and the dislodged Boko Haram terrorists from the North-east.\nNotorious kingpin, Bello Turji, had in an interview with Daily Trust newspaper recently, said he had no connection with ISWAP and Boko Haram members.\nTurji said he did not need to have any links with ISWAP and Boko Haram because he had no political agenda or looking to establish his own territory."
  },
  {
    "headline": "Insecurity: Bandits now partner dislodged Boko Haram terrorists – FG",
    "summarized_story": "The federal government Wednesday said bandits operating in the North-west and parts of the North-central zones now collaborate with Boko Haram terrorists dislodged from the North-east region.\n“What is happening now is that there is a kind of an unholy handshake between bandits and Boko Haram insurgents.\nPreliminary reports of what transpired at the Kaduna train attacks show that there is a kind of collaboration between the bandits and the dislodged Boko Haram terrorists from the North-east.\nNotorious kingpin, Bello Turji, had in an interview with Daily Trust newspaper recently, said he had no connection with ISWAP and Boko Haram members.\nTurji said he did not need to have any links with ISWAP and Boko Haram because he had no political agenda or looking to establish his own territory."
  },
  {
    "headline": "Bashir Nura Alkali resumes Office as New Permanent Secretary for Works Ministry – NigPilot",
    "summarized_story": "Newly appointed Permanent Secretary of the Federal Ministry of Works and Housing, Mr. Bashir Nura Alkali has resumed duty following the recent approval and redeployment of Permanent Secretaries in the Federal Civil Service by His Excellency, President Muhammadu Buhari.\nEarlier in his remarks, Director Overseeing the Office of the Permanent Secretary, Engr.\nThat tells you the kind of person the new Permanent Secretary is.\nBut it is a gain to us in the Federal Ministry of Works and Housing,’’ Uzo said.\nUzo handed over two sets of handover notes, that of the former Permanent Secretary and that of when he acted as the Director Overseeing the Permanent Secretary’s Office."
  },
  {
    "headline": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE – NigPilot",
    "summarized_story": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE, CALLS BOOT PARTY AN APPENDAGE OF THE ALL PROGRESSIVE CONGRESS (APC)The Alliance of Collaborating Political Parties (ACPP) has condemned the felonious court case instituted against the People’s Democratic Party Governorship Candidate in Osun State by the Governorship Candidate of the Boot Party, Adesoji Adeleke.\nIn a statement issued by a Chieftain of the Alliance, Wole Adedoyin who was also the 2018 Governorship Candidate of the Hope Democratic Party (HDP) said the case is baseless, mischievous and full of contradictions to ridicule Senator Demola Adeleke and the People’s Democratic Party (PDP).\nACPP said the suit against Senator Demola Adeleke was in bad faith and targeted by undemocratic elements to undermine democracy and good governance in Osun State.\nAdedoyin said: The Boot Party has become an appendage of the All Progressive Congress (APC) in Osun State.\nThe party is not serious about winning the forthcoming Osun Governorship Election."
  },
  {
    "headline": "Soludo sets up 15 man peace Committee on insecurity in South East",
    "summarized_story": "Anambra state government has set up a truth, justice and peace Committee which is comprised of 15 members drawn from different fringes of the South Eastern region.\nThe members of the committee are Prof.Chidi Odinkalu as the Chairman, Amb.\nMrs. Bianca Ojukwu, Secretary, Dr. Joe Nworgu,Dr. Udenta Udenta, Mr. Charles Oputa(Charly Boy), Ms. Onyeka Onyenu.\n” To identify the remote and immediate causes of the agitations, restiveness, violence, and armed struggle in the South East since 1999.\nIt was gathered the committee would be inaugurated on a date to be communicated to its members."
  },
  {
    "headline": "Lalong salutes elder statesman Amb Yahaya Kwande @ 93",
    "summarized_story": "Plateau State Governor Simon Bako Lalong has sent warm felicitations to elder statesman Ambassador Yahaya Kwande on the occasion of his 93rd birthday.\nGovernor Lalong in a message signed by Macham Makut the director of press and public affairs to Governor Lalong congratulated the seasoned Administrator, Politician, Diplomat and philanthropist for his selfless service to Nigeria, Plateau State and humanity at large.\nHe described him as an accomplished personality who has made huge impact in the lives of the people at various times when he occupied various offices in the country.\nThe Governor said Ambassador Kwande has mentored many in public service, politics and humanitarian activities by his record of performance over the years where he has freely offered counsel, support and goodwill to those in power and others.\nAccording to Governor Lalong, Ambassador Yahaya is one of the few elders that have demonstrated sufficient interest in the peace, progress and prosperity of Plateau State and Nigeria over the years, hence his willingness to advise and share his wealth of experience with the Government on key issues."
  },
  {
    "headline": "Edo LG Poll: EDSIEC extends date for conduct of primaries, insists on April 19 for election",
    "summarized_story": "The Edo State Independent Electoral Commission (EDSIEC) has extended the date for the conduct of party primaries for the local government elections by two days.\nThe Commission, however, said the extension will not affect the April 19 date earlier scheduled for the council polls.\nThe statement reads: “It is hereby announced for the information of the general public, particularly Registered Political Parties in the state that the Edo State Independent Electoral Commission has extended the date for the conduct of primaries by two (2) days.\n“This is in view of the number of Registered Political Parties that have scheduled their primaries on the 6th of April, 2022 which is the last day for the conduct of the primaries.\nThe last date for the primaries is Friday, April 8, 2022.”“The shift of date for the primaries has nothing to do with the date of the election, as other dates remain fixed and firm,” Ojo added."
  },
  {
    "headline": "Plateau Attacks: We Have Buried 106 People So Far, Says LG Chairman",
    "summarized_story": "One hundred and six persons have so far been buried following the attacks on communities in Plateau State.\nThis is according to the Chairman of Kanam Local Government Area of Plateau State Dayabu Garga who gave an update about the renewed violence in some parts of the north-central state.\nThe issue is so much devastating.”The Kanam council boss, who called for more protection for the people, lamented the recent attacks.\nKanam was not the only local government affected by Sunday’s attack.\nThe attack affected about 10 villages in Garga comprising Kukawa, Gyanbawu, Dungur, Kyaram, Yelwa, Dadda, Wanka, Shuwaka, Gwammadaji, and Dadin Kowa."
  },
  {
    "headline": "Gowon, Abdulsalami, Jonathan Attend As Buhari Presides Over Council Of State Meeting",
    "summarized_story": "President Muhammadu Buhari is presiding over a meeting of the Council of State at the Presidential Villa, Abuja.\nThe meeting, which started at 10 am, is being attended by Vice President Yemi Osinbajo; the Secretary to the Government of the Federation Boss Mustapha, Boss Mustapha; National Security Adviser, Babagana Monguno and the Chief of Staff to the President, Prof. Ibrahim Gambari.\nREAD ALSO: President Buhari Swears In ICPC, NPC CommissionersFormer heads of state physically in attendance are Abdusalami Abubakar, Goodluck Jonathan, and Yakubu Gowon.\nOthers are attending the meeting Virtual from their various locations.\nState governors in attendance are Hope Uzodinma of Imo State; Kayode Fayemi of Ekiti State, Atiku Bagudu of Kebbi State, and Bello Matawalle of Zamfara State, Nasir El-Rufai of Kaduna state among others."
  },
  {
    "headline": "NASU, SSANU Threaten Indefinite Strike Nationwide",
    "summarized_story": "Another major setback looms in the nation’s education sector as the Non-Academic Staff Union of Educational and Associated Institutions (NASU) and the Senior Staff Association of Nigerian Universities (SSANU) threaten a total and indefinite strike.\nThe Joint Action Committee (JAC) of NASU and SSANU announced this in a communique on Wednesday, amid the ongoing warning strike by the unions.\nNASU and SSANU faulted the government for failing to implement an agreement it freely entered into with the unions.\nThis has been a thorny issue that the 2020 Memorandum of Understanding (MoU) and 2021 Memorandum of Action (MoA) addressed.\nThis was assured to be addressed in the 2021 Memorandum of Action (MoA) but to date, nothing has been done."
  },
  {
    "headline": "677 Drug Traffickers Jailed, 3,359 Arrested In Q1 2022 – NDLEA",
    "summarized_story": "The National Drug Law Enforcement Agency, (NDLEA) has revealed that 677 drug traffickers have been jailed and 3, 359 arrested in the first quarter, from January to March 2022.\nThis was disclosed in a statement by the Director, Media, and Advocacy, Femi Babafemi.\n“No less than six hundred and seventy-seven (677) traffickers have been convicted and sentenced to various jail terms between January and March 2022, with a total of three thousand three hundred and fifty-nine (3,359) arrests and 65,915.891 kilograms of assorted drugs seized within the same period.\nIn February, Cannabis also topped the list of seizures with 20,538.79kg; Codeine -1,848.052kg; Tramadol -540.354kg; Diazepam -137.041kg; Rophynol -80.261kg; Cocaine -15.727kg; Methamphetamine – 6.207kg and Heroin – 4.006kg.\nMr Babafemi commended the officers of the agency and urged them not to rest on their oars."
  },
  {
    "headline": "Elon Musk Offers To Buy 100% Of Twitter",
    "summarized_story": "Tesla chief Elon Musk has launched a hostile takeover bid for Twitter, offering to buy 100 percent of its stock and take it private, according to a stock exchange filing.\nMusk offered $54.20 a share, a 54 percent premium over the January 28 closing price, in a filing dated Wednesday April 13 with the Securities and Exchange Commission."
  },
  {
    "headline": "Sokoto Assembly speaker dumps APC for PDP",
    "summarized_story": "Speaker, Sokoto state House of Assembly, Aminu Muhammad Achida has dumped the All Progressives Congress APC for the People’s Democratic Party PDP.\nThe speaker presented the letter of his defection to the assembly during today’s plenary session.\nAlso a member of the state House of Assembly representing Wammako 2Constituemcy, Murtala Bello Maigona has also dumped the APC for the PDP."
  },
  {
    "headline": "Buhari presides over Council of State meeting in Abuja",
    "summarized_story": "President Muhammadu Buhari is currently presiding over the council of State meeting at the Presidential Villa Abuja.\nThe meeting started at 10am and has in attendance Vice President Yemi Osinbajo, Secretary to the government of the federation, National security adviser, Cheif of Staff to the president.\nAlso in attendance are former heads of states Goodluck Jonathan, General Abdulsalami Abubakar, and General Yakubu Gowon.\nThe chairman of Nigerua Governors forum is leading about six other governors physically present at the council chambers while the others join virtually from their respective states.\nThis is the fourth council of state meeting chaired by President Muhammadu Buhari,The meeting is expected to deliberate on important national issues especially matters of security, and the economy."
  },
  {
    "headline": "2023: Ondo youth drums support for Akeredolu's aide, Olumbe Akinkungbe's aspiration -",
    "summarized_story": "A youth socio-political group in Ondo State, Ondo State Youth for Good Governance (OYGG), has declared their unflinching loyalty and support to the renowned ICT Guru, Olumbe Akinkungbe .\nThe group said the entire sons and daughters of Ondo Kingdom are totally supporting him to represent Ondo East/West Federal Constituency at the Green Chamber in the coming general election.\n“It’s time we invite personality with exposure to restructure the kingdom as several people has tried but failed us.\nHowever, the group also called on all Ondo Kingdom stakeholders beyond party affiliation and all dwellers that meant well for the kingdom to support Olumbe Akinkungbe aspiration so that Ondo Kingdom can be great again.\nHe has what it takes to bring rapid development to the kingdom .” he added."
  },
  {
    "headline": "2023: Tinubu rallies APC Speakers, ex-legislators ahead of primary election",
    "summarized_story": "We don’t just know how to run the race and take care of the gear of progress,” Tinubu said at the event hosted by the Speaker of the Lagos State House of Assembly, Rt.\nGovernor Babajide Sanwo-Olu, who was a guest of honour at the parley, described Tinubu as his mentor and benefactor.\nHe also urged the legislators to key into the desire to make Nigeria a better country with Tinubu as President.\nSpeaking with his colleagues, Dr. Obasa described Tinubu as a true democrat.\n“I can confirm that he is the brain behind the legislative autonomy that we enjoy today at the Lagos State House of Assembly and he did this far before the clamour for it by other states."
  },
  {
    "headline": "Elon Musk Offers to Buy Twitter for $43bn, So It Can Be ‘Transformed as Private Company’",
    "summarized_story": "Elon Musk offered to buy Twitter for $54.20 a share, saying the social media company needs to be transformed privately, a little over a week after first revealing a 9.2% stake in the company.\nAccording to Musk, the social media company needs to go private because it can “neither thrive nor serve” free speech in its current state.\nMusk first disclosed his stake in the social media giant on April 4.\nThe Tesla CEO has previously criticized the social media giant publicly, polling people on Twitter last month about whether the company abides by free speech principles.\nHe also said he was considering building a new social media platform."
  },
  {
    "headline": "At Least 306 Killed in Catastrophic Durban Floods, Ramaphosa Calls it Climate Change Disaster",
    "summarized_story": "Flooding in South Africa’s Durban area has killed at least 306 people and is a “catastrophe of enormous proportions,” President Cyril Ramaphosa says.\nIt is telling us that climate change is serious, it is here,” Mr Ramaphosa said as he visited flooded areas of Durban and the surrounding eThekwini metropolitan area.\n“The bridges have collapsed, the roads have collapsed, people have died and people are injured,” he said.\nSouth Africa’s Eastern Cape, Free State and North West provinces could be affected, it said.\nSouth Africa’s northern neighbour Mozambique has suffered a series of devastating floods over the past decade, including one last month that killed more than 50 people."
  },
  {
    "headline": "East Africa, Horn of Africa Prepare for Worst Drought in Decades",
    "summarized_story": "Meteorologists are linking the unfolding drought to human-caused climate change which is leading to increased warming in the Indian Ocean, causing more frequent cyclones.\nLike most of Africa, the east and the Horn’s economic mainstay is agriculture, which is rain-fed, making it vulnerable to extreme weather events.\nKimaru says that increased temperatures recorded over the past few months have denied her livestock pasture and the crops she had planted in anticipation of the long rains season have failed.\n“Whenever we have intense cyclones in the Southwest Indian Ocean, we always prepare for a long drought season in eastern and the Horn regions,” Evans Mukolwe, the former science director at the U.N., said.\nIt has been the pattern for decades.”Aid organizations are already concerned about how worsening climate change impacts will affect the region in future decades."
  },
  {
    "headline": "Russia Says Blast Cripples Black Sea Flagship, Ukraine Claims Missile Strike",
    "summarized_story": "Russia’s Defense Ministry confirmed Wednesday that its Moskva missile cruiser was badly damaged in a fire — hours after Ukrainian forces claimed they’d struck the vessel in the Black Sea.\nWhy it matters: The Moskva is the most essential ship in the Russian Black Sea fleet, with cruise missiles that have a range of at least 440 miles, per Reuters.\nFlashback: The Moskva was the warship that reportedly told Ukrainian border guards to surrender Snake Island, off Ukraine’s coast in the Black Sea.\nAudio emerged of the sailors telling Russian forces to “go f–k yourself” in response, which the Ukrainian Interior Ministry said was authentic.\nIt was initially feared the 10 sailors had been killed, but they were later freed as part of a prisoner swap with Russia."
  },
  {
    "headline": "Nigeria: Benue Governor Ortom Alleges Plan to Hand Over Federal Government to Bandits",
    "summarized_story": "The governor of Benue State in Nigeria’s North-Central region Samuel Ortom accused the Muhammadu Buhari administration of pretending not to notice the unremitting killings of innocent Nigerians.\nOrtom, who spoke during an interview in Makurdi, also alleged plans by the government to yield power to criminal elements.\nHe stated, “I suspect that very soon, some states will be completely taken over by these Fulani men called bandits.\nI suspect that very soon, even the Presidential Villa will be handed over to them.\nOrtom warned that if nothing was done, the people would resort to self-help, which would throw the country into anarchy."
  }
]