[
  {
    "headline": "War on drugs more deadly than insurgency, says Buhari",
    "summarized_story": "), has described Nigeria’s drug war as deadlier than the fight against insurgency and banditry and other threats to the stability of the country.\nBuhari said this on Saturday while launching the War Against Drug Abuse initiative by the National Drug Law Enforcement Agency in commemoration of the United Nations International Day Against Drug Abuse and Illicit Drug Trafficking themed, ‘Share Facts on Drugs.\n“Also appreciated are the members of the inter-ministerial committee on drug control, civil society organisations, the academia, for their contributions and efforts to our National Drug Control initiatives.\n“The war against drugs is a war that must be fought by all, it is, therefore, my pleasure, to declare on behalf of the good people of Nigeria, a War Against Drug Abuse, not just as a slogan, but a call for civil action for all Nigerians to take an active part in this war.\n“So, this is a war that is targeting three generations in a stretch."
  },
  {
    "headline": "Ondo varsity shut as hoodlums rob, rape students",
    "summarized_story": "The development followed a protest embarked upon by the students of university last Thursday.\nA source disclosed no fewer than four female students had been raped by the hoodlums in their various hostels in the last two weeks.\nHe said , “We are tired of this insecurity, armed hoodlums usually come to our off-campus hostels, rob students at gunpoint, and also rape our female students.\n“The school management is not doing enough as we are the ones securing ourselves by working as vigilantes most times, the situation is terrible.\nHe said, “It is true the students staged a peaceful protest, and the school has been shut."
  },
  {
    "headline": "Tinubu will make a good president ― Olubadan",
    "summarized_story": "The Olubadan expressed his support while receiving members of the Tinubu Vanguard, a support group for Tinubu’s presidency project in Ibadan on Saturday.\nA statement by Dr Johnny Benjamin, The Director-General of Tinubu Vanguard, Dr Johnny Benjamin, said this in a statement on Saturday.\nOlubadan described Tinubu as a good man whose stewardship as president would consolidate on the progressive agenda of of the APC and propel Nigeria to the path of economic prosperity and sustainable development.\n“Tinubu is a good man and I will do everything within my power to support his candidacy for the 2023 presidential poll,” he said.\nThe director-general said that representatives of Tinubu Vanguard were at the palace to intimate the Ibadan paramount ruler of their intention to deliver a Tinubu presidency in 2023, and to solicit his royal blessings."
  },
  {
    "headline": "Many youths dying due to intake of hard drugs-ASI",
    "summarized_story": "She said: “The AFI vehicle to pursue our major project is christened “A Societal Awareness Campaign Against Drug Abuse (ASACADA)”.\n“So many brilliant youths have been ruined due to intake of hard drugs substances.\nIn 2016, we observed the first international world drug day on June 26 being a day set aside for the commemoration of world drug day.\nAlso speaking, President NYCN, Comrade Solomon Dodo urged the youths to stay away from hard drugs.\nMaxwell Esan enjoined the NGO to spread the message again hard drugs nationwide to save the youths."
  },
  {
    "headline": "Don't allow violent extremist find breeding ground in your communities",
    "summarized_story": "By Bashir BelloKANO – Worried by the needless conflicts or violence in the country, a non-governmental organization, Africa Initiative for Peace Building Advocacy and Advancement, AFRIPEACE have called on community leaders and organizations not to allow violent extremist to find a breeding ground in their communities in order to avoid reoccurrence of conflict.\nThe group’s Program Officer, Comfort Zawaya made the call during a peace-building capacity training for Civil Society Organizations and community groups held in Kano.\nZawaya said the community leaders should avert the recruitment tactics of the violent extremist groups and breeding ground.\nSecurity challenges, communal crisis, farmers/herders, kidnapping, insurgency, and other civil violence presently ravaging Northern Nigeria.\n“For over three decades, violent conflicts in Northern Nigeria have emerged with huge humanitarian consequences, including displacement of people which has resolved in huge deaths, loss of property across ethnics, religious and political devices."
  },
  {
    "headline": "Panic grips residents as oil pipeline leaks in Lagos",
    "summarized_story": "By Olasunkanmi AkoniFear has gripped the residents of Ijeododo Road, Igando, Alimosho, Local Government Area, Lagos, Saturday, following a Premium Motor Spirit, PMS, popularly, called petrol, pipeline leakage in the area.\nThe incident which occurred in the afternoon when some of the residents noticed the leakage at Igando enroute Ijeododo road and raised the alarm.\nEye witnesses’ account said as soon as the leakage was noticed after the heavy downpour, some of the residents in apparent fear started running helter-skelter.\nREAD ALSO#ENDSARs: LSETF shells out over N1.1b on Lagos MSMEsThe Director-General, Lagos State Emergency Management Agency, LASEMA, Dr. Femi Oke-Osanyintolu, confirmed the development.\nAll stakeholders are on the ground to prevent a secondary incident,” Oke-Osanyintolu stated."
  },
  {
    "headline": "Delta APC waxing stronger with Nwaoboshi — Emerhor",
    "summarized_story": "By Festus Ahon, ASABAFOUNDING Leader and former governorship candidate of the All Progressives Congress, APC in Delta State, Olorogun O’tega Emerhor, Saturday, said the party is waxing stronger in the State with the defection of the senator representing Delta North Senatorial District at the National Assembly, Senator Peter Nwaoboshi to the APC.\nEmerhor, in a statement said “with Nwaaoboshi joining the progressive family in Delta, the quest to liberate Delta State come 2023 from poor leadership and bring it to the progressive fold is gaining ground.\n“Nwaoboshi is a political tactician who is bringing on board over three decades experience in active politics in Delta.\nThe APC in Delta is waxing stronger by the day, and I want to assure Senator Nwaoboshi, the political oracle that there is no joiner in APC Delta, every member has equal stake.\nTogether with other leaders, we will all work harder for the party ahead of 2023 general elections and ensure Delta state is finally liberated”."
  },
  {
    "headline": "Niger NDLEA links growing kidnap cases, banditry to drug abuse",
    "summarized_story": "The Niger State Command of the National Drug Law Enforcement Agency (NDLEA) has hinged the growing rate of kidnaps, banditry and other criminal activities in the state to drugs.\nThe State Commandant of the Agency, Haruna Kwetishe made the disclosure in Minna at a day lecture organized by the Agency as part of the activities to mark this year’s United Nations International Day against drug abuse and illicit drug trafficking.\nThe governor also admitted that 90 percent of crimes and criminalities are committed under the influence of drugs.\nHe added, “and until all stakeholders join hands together to fight this menace, crimes and criminalities will continue to increase”.\nNDLEA seeks establishment of drugs laboratories across Nigeria"
  },
  {
    "headline": "University Don blames parents for moral decadence among young people",
    "summarized_story": "A lecturer at the University of Lokoja, Professor Peace David Irefin has accused parents of living lives that expose their children to crime.\nSpeaking at a seminar in Calabar, Cross River Stare, Prof Irefin regretted the attitudes of parents when it comes to bringing up their children.\n‘There is much suffering, violence and killings today due to moral bankruptcy.\nShe said it is the women or mothers who make the world a better place.\nA good mother ensures that the child has such a welcoming home."
  },
  {
    "headline": "Zulum suspends French NGO for conducting shooting training in Borno hotel",
    "summarized_story": "Borno Governor, Babagana Zulum has suspended ACTED, a French non-governmental organization in the state.\nThe directive followed Saturday’s discovery that the humanitarian body was using a hotel in the state capital for shooting training.\nHe said ACTED used toy guns and simulators in the exercises conducted at the location off Circular Road in Maiduguri.\nThe matter was reported at the GRA Divisional Police headquarters and operatives found three toy pistols in the hotel during a search.\n“Governor Zulum acknowledges and deeply appreciates the roles credible NGOs have been playing in different parts”, he added."
  },
  {
    "headline": "New drug war will be deadlier than fight against insurgency",
    "summarized_story": "President Muhammadu Buhari on Saturday inaugurated the War Against Drug Abuse (WADA) initiated by the National Drug Law Enforcement Agency (NDLEA), warning that the drug war is deadly.\nBuhari stressed that drug war was dangerous than wars against insurgency and banditry because it targeted three generations for destruction.\nThe News Agency of Nigeria (NAN) reports that Buhari said the war against drug abuse and illicit trafficking is a war that must be fought by well-meaning citizens.\nHe said “it is, therefore, my pleasure to declare on behalf of the good people of Nigeria, a War Against Drug Abuse (WADA), not just as a slogan, but a call for civil action for all Nigerians to take an active part in this war.\nDrug abuse too hazardous to ignore in Nigeria – Senate President, Lawan”I’ve seen clips of where grandparents are on drugs, parents are on drugs, and by extension, their wards, their children are on drugs."
  },
  {
    "headline": "Osun government assures Olopa community of adequate security",
    "summarized_story": "The Osun State Government has assured residents of Olopa Estate, Ofatedo, Egbedore local government that it had put measures in place to scale up security to forestall any potential activities of criminals in the area.\nThe notice has since caused tension in the community, resulting in residents vacating their apartments and business activities being paralysed.\nBabatunde Ibirogba, on behalf of the government, held a meeting with critical stakeholders in the community on improved security measures to protect the area.\n“Residents of Olopa estate and Ofatedo community have been assured that there will be no breakdown of law and order in the area because of reinforced security presence in the area.\nThe administration of Governor Adegboyega Oyetola remains committed to the security of lives and properties of the people of Osun.”Armed robbers write Osun community, demand N20 million"
  },
  {
    "headline": "Descendants of nazi era granted citizenship by Germany",
    "summarized_story": "President of the Central Council of Jews in Germany, Josef Schuster, said that the ruling coalition has taken important legal steps to ensure that Germany lives up to its historical responsibility.\nRelatives of refugees have been angered that their applications for citizenship were rejected despite constitutional guarantees.\nGermany’s Basic Law states that former German citizens, who between 1933 and 1945 were deprived of their citizenship on political, racial or religious grounds and their descendants, can have their citizenship restored.\nHowever, some had applications rejected or were told they are not eligible to apply, often on the grounds that they were born to a German mother and non-German father.\nUntil 1953, German citizenship could only be passed on through the paternal line."
  },
  {
    "headline": "My father drugged, exploited me – Britney Spears makes shocking revelation",
    "summarized_story": "Popular popstar, Britney Spears has made shocking revelations and allegations against her father and members of her team during a bombshell court testimony.\nSpears accused her father and team of drugging and forcing her to work against her will, exploiting her financially.\nShe told the presiding judge Brenda Penny of how she has been denied access to her phone, passport, credit cards and forced to work long hours.\n“I’ve lied and told the world I’m alright and I’m happy.\nHer father, Jamie Spears responding to the allegations, said he only acted in his daughter’s best interests as her guardian."
  },
  {
    "headline": "I lied to my parents I have ushering job, says suspected killer of SuperTV boss",
    "summarized_story": "A 21-year-old University of Lagos undergraduate arrested over the murder of SuperTV boss, Michael Usifo Ataga, 49, on Thursday says she lied to her parent just to spend some days with the deceased.\nThe 300-level student of Mass Communication admitted lying to her parents who reside in Alagomeji area of Yaba Local Government Development Area that she was going for an ushering job.\n“I stay with my parents in Alagomeji in Yaba.\nSo I told them that I was going for ushering job (to allow me to leave),” she said.\nThe 300-level student of Mass Communication told newsmen at the Lagos State Police Command that she stabbed Ataga twice on the neck, rupturing his arteries in the process."
  },
  {
    "headline": "We’ve invited Sheikh Gumi – DSS",
    "summarized_story": "The Department of State Services (DSS) on Friday confirmed that it had invited Islamic cleric, Sheikh Ahmad Gumi.\nDSS spokesman, Dr Peter Afunanya, in a WhatsApp platform said tersely, “Gumi was invited by the Service.”He did not say why the cleric was invited.\n“It’s not out of place for the Service to invite any person of interest,” he added."
  },
  {
    "headline": "VIDEO: Duncan Mighty shows off new lover",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "Anambra 2021: I’ve not highjacked APC primary – Andy Uba",
    "summarized_story": "From Magnus Eze, EnuguA leading contender for the All Progressives Congress (APC) governorship ticket, Andy Uba, has distanced himself from alleged attempts to hijack the party’s ongoing primary election.\nA statement in Awka, Saturday afternoon by Uba’s campaign organisation said the allegation was the last resort of people it called paper tigers.\nThe statement read: ‘We are presently in touch with a number of false allegations where it has been stated that our principal, Senator Andy Uba has highjacked the process meant to democratically select a candidate for the forthcoming polls in November.\n‘We wish to state categorically that nothing can be further from the truth as our principal, Senator Andy Uba, remains committed to the tenets of democracy and fairness and will thus not indulge in anything that will truncate the process or question its integrity.\n‘We urge the media and Ndi Anambra to disconnect themselves from such feeds of lies and carry out their investigations before reporting."
  },
  {
    "headline": "Osinbajo, Marwa attend premiere of anti-drug Nollywood film ‘The Silent Baron’",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaAs part of activities to commemorate the United Nations International Day Against Drug Abuse and Illicit Drug Trafficking on June 26, with the theme “Share Facts on Drugs.\nSave Lives”, Vice President Yemi Osinbajo attended the premiere of “The Silent Baron”, a film produced by Mr Ifeanyi Ukaeru in partnership with the National Drug Law Enforcement Agency (NDLEA) to highlight the dangers of drug abuse and trafficking in Nigeria.\nThe vice president was accompanied by NDLEA Executive Chairman Brig Gen. Buba Marwa (retd), the Director-General of the National Council for Arts and Culture (NCAC), Otunba Olusegun Runsewe, and other top government functionaries.\nAccording to a statement issued on Saturday by his spokesman, Laolu Akande, Mr Osinbajo’s presence at the film premiere Friday evening was aimed at lending his support to the global campaign against drug abuse and illicit drug trafficking.\nAfter watching the movie, Vice President Osinbajo met some of the actors who were also present at the premiere, interacted briefly and took group photographs with the performers, movie producers and the production crew."
  },
  {
    "headline": "Dreaded Niger Delta Avengers return, threaten total shutdown of economy",
    "summarized_story": "Ben Dunno, WarriIndications that the Niger Delta region may soon erupt in violence emerged yesterday, following the return of dreaded Niger Delta Avengers (NDA), who threatened to resume hostilities across the region with devastating attacks on some critical oil and gas assets, as well as notable politicians sabotaging the development of the area.\n“This operation shall be coded; ‘OPERATION HUMBLE’, aimed at bringing down TARGETED OIL INSTALLATIONS IN THE NIGER DELTA REGION capable of humbling the economy into permanent recession.\nThis mission is also TARGETED AT POLITICAL ACTORS WHO ARE COLLABORATING WITH THE NIGERIAN GOVERNMENT TO UNDERMINE THE INTEREST OF THE NIGER DELTA PEOPLE.\n“Members of our strike teams across the Niger Delta are commanded to be on red alert awaiting precise strike plans as mapped by the high command of the NDA”, it stated.\nThere will be no going back until the Nigerian economy is humbled into recession never to rise again!”, the statement concluded."
  },
  {
    "headline": "Face to face with alleged murderer of super tv CEO",
    "summarized_story": "Her fellow students who spoke to our paper expressed shock over her involvement with the cold-blooded murder of the TV entrepreneur.\nAs she explained, this was because there was no money for her to go back to school to continue her education pursuit.\nFor her secondary school education, she attended Alagomeji Secondary School, Yaba, Lagos, but initially stopped at Junior Secondary School 2 owing to paucity of fund.\nShe later went back and continued from Senior Secondary School 1 but also stopped again due to lack of finance.\nShe later managed to complete her secondary school education."
  },
  {
    "headline": "Men just want to have a feel of my boobs –Ada Ebere",
    "summarized_story": "For comedienne Ada Ebere aka Ada la Pinky, her unique selling points are her big breasts and she leaves no stone unturned in flaunting them.\nHowever, in a chat with Saturday Sun, the social media influencer lamented the challenges she faces walking around with big boobs.\nAnother challenge is that I can’t sleep lying on my chest; it has to be either up right or sideways.\nClearing the insinuations that she had her boobs enlarged for commercial purposes, Ada claimed they are natural and not enhanced.\nI never liked big boobs, I’d have preferred a portable size but here I am blessed with large ones and I am grateful."
  },
  {
    "headline": "President Approves Extra 6 Months for APC’s Caretaker Committee",
    "summarized_story": "The President gave the approval yesterday morning after a closed-door meeting with members of the Committee at the State House, Abuja.\n“The President also approved the timetable for APC Ward, Local Government and State Congresses.\nThe President said the APC had been revived, energised and repositioned for its forthcoming national convention and future elections.\nHe told the President and other party members that 14 party members had indicated their interest to contest for the Anambra State elections, assuring that the primary elections will be free, fair and transparent.\n“The party members have agreed to name the secretariat, Muhammadu Buhari House,” he added."
  },
  {
    "headline": "Green Energy: Osinbajo Frets over Looming Fall in Funding for Gas",
    "summarized_story": "•Says Nigeria will continue frontline advocacy for a just transition to zero emissionsVice President Yemi Osinbajo is worried about the global clamour for green energy and the looming reduction in funding for gas and fossil fuel projects, especially in developing countries, by international bodies and institutions.\nAt the virtual meeting, Osinbajo maintained his position that the funding for gas and fossil fuel projects in Nigeria and other developing countries be sustained during the global transition to net-zero emissions and said Nigeria would continue its frontline advocacy for a just transition to zero-emission.\nHe also asserted that Nigeria would play a critical role with other gas exporting countries to stop the defunding of gas and fossil fuel projects in developing countries.\nThe Vice President noted that it was vital that the Forum of Gas Exporting Countries (GEC) join forces to prevent the defunding of gas and fossil fuel projects, especially from developing countries, by international bodies and institutions.\nBoth the Minister of State for Petroleum Resources and Minister of Foreign Affairs were directed to work together, to ensure the GEC Forum reaches a consensus that reflects Nigeria’s advocacy on defunding of gas projects."
  },
  {
    "headline": "DSS Grills, Cautions Ahmad Gumi over Comments on Bandits, Security Agents",
    "summarized_story": "The service invited Sheikh Gumi.\nHow can these big weapons cross our borders and get into the forest without the cooperation of some bad element of the security operatives assisting them?\nYou can’t because the security is alert.”The Nigerian Army kicked against the cleric’s claims and warned that it would not condone acts sabotaging its efforts.\nHe also insisted that he never made any disparaging remarks against the military during his recent live interview on national television.\nAccording to him, there was nowhere in the TV interview that he categorically accused the entire military."
  },
  {
    "headline": "Nwaoboshi Defects to APC, Meets Buhari",
    "summarized_story": "Deji Elumoye in AbujaThe senator representing Delta North, Peter Nwaoboshi, has defected to the All Progressives Congress, days after his suspension from the state’s Peoples Democratic Party.\nPresident Muhammadu Buhari yesterday welcomed Nwaoboshi to the APC.\nThe Senior Special Assistant to the President on Media and Publicity, Garba Shehu, announced the defection in a statement titled ‘President Buhari congratulates Senator Peter Nwaoboshi for decamping to APC’.\nNwaoboshi, representing Delta North District, Delta State, was presented to President Buhari and National Caretaker/Extraordinary Convention Planning Committee at the State House by Deputy Senate President, Ovie Omo-Agege.\n“The Deputy Senate President said Senator Nwaoboshi’s decision to join the APC clearly shows that the effort of the CECPC was yielding fruit."
  },
  {
    "headline": "Buhari Postpones Medical Trip to London",
    "summarized_story": "By Deji ElumoyeThe medical follow-up visit of President Muhammadu Buhari to London, United Kingdom earlier scheduled for Friday (today) has been postponed.\nAccording to a release on Friday by Special Adviser on Media to the President, Femi Adesina, a new date will be announced in due course.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: Senate President, Lawan Gifts Newly Wedded Wife N100m As National Assembly Building Deteriorates",
    "summarized_story": "SaharaReporters had reported how Lawan secretly married Zainab at a very private ceremony in Borno State on Friday.\nSee Also Exclusive EXCLUSIVE: Nigeria's Senate President, Ahmed Lawan Marries Young Shuwa-Arab Girl In Secret WeddingA mini party was also held at the bride's family residence in Gwange 1 Ward, Malut Shuwa Street, Maiduguri.\nA source close to Zainab told SaharaReporters on Saturday that the Senate President gifted her N100 million a few days after they were introduced to each other.\nEXCLUSIVE: Nigeria's Senate President, @DrAhmadLawan Marries Young Shuwa-Arab Girl In Secret Wedding | Sahara Reporters https://t.co/awX606hJ4Q pic.twitter.com/RE1BohBpMu — Sahara Reporters (@SaharaReporters) June 26, 2021\"Lawan personally gave her N100 million days after he saw her pictures.\nSaharaReporters had reported how leaks from the roof of the National Assembly building disrupted the plenary session on Tuesday."
  },
  {
    "headline": "EXCLUSIVE: Senate President, Lawan Gifts Newly Wedded Wife N100m As National Assembly Building Deteriorates",
    "summarized_story": "SaharaReporters had reported how Lawan secretly married Zainab at a very private ceremony in Borno State on Friday.\nSee Also Exclusive EXCLUSIVE: Nigeria's Senate President, Ahmed Lawan Marries Young Shuwa-Arab Girl In Secret WeddingA mini party was also held at the bride's family residence in Gwange 1 Ward, Malut Shuwa Street, Maiduguri.\nA source close to Zainab told SaharaReporters on Saturday that the Senate President gifted her N100 million a few days after they were introduced to each other.\nEXCLUSIVE: Nigeria's Senate President, @DrAhmadLawan Marries Young Shuwa-Arab Girl In Secret Wedding | Sahara Reporters https://t.co/awX606hJ4Q pic.twitter.com/RE1BohBpMu — Sahara Reporters (@SaharaReporters) June 26, 2021\"Lawan personally gave her N100 million days after he saw her pictures.\nSaharaReporters had reported how leaks from the roof of the National Assembly building disrupted the plenary session on Tuesday."
  },
  {
    "headline": "BREAKING: DSS Invites Sheikh Gumi After Alleging Military-Bandits’ Collusion In Attacks On Citizens",
    "summarized_story": "The State Security Service, also known as the Department of State Services (DSS) has invited controversial Islamic cleric, Sheikh Ahmad Gumi, for questioning.\nThe VOA Hausa reported the DSS invitation, days after a controversy between Gumi and the Nigerian Army.\nThe Nigerian Army had replied to Gumi, same day saying his statement is both sad and unfortunate.\nOn Wednesday, he had described bandits and killer herdsmen’s atrocities as “a tribal war,” accusing the government of taking sides.\n“What you call banditry when you cross to the other side, you find out Nigeria is fighting a tribal war,” he explained."
  },
  {
    "headline": "BREAKING: DSS Invites Sheikh Gumi After Alleging Military-Bandits’ Collusion In Attacks On Citizens",
    "summarized_story": "The State Security Service, also known as the Department of State Services (DSS) has invited controversial Islamic cleric, Sheikh Ahmad Gumi, for questioning.\nThe VOA Hausa reported the DSS invitation, days after a controversy between Gumi and the Nigerian Army.\nThe Nigerian Army had replied to Gumi, same day saying his statement is both sad and unfortunate.\nOn Wednesday, he had described bandits and killer herdsmen’s atrocities as “a tribal war,” accusing the government of taking sides.\n“What you call banditry when you cross to the other side, you find out Nigeria is fighting a tribal war,” he explained."
  },
  {
    "headline": "BREAKING: DSS Invites Sheikh Gumi After Alleging Military-Bandits’ Collusion In Attacks On Citizens",
    "summarized_story": "The State Security Service, also known as the Department of State Services (DSS) has invited controversial Islamic cleric, Sheikh Ahmad Gumi, for questioning.\nThe VOA Hausa reported the DSS invitation, days after a controversy between Gumi and the Nigerian Army.\nThe Nigerian Army had replied to Gumi, same day saying his statement is both sad and unfortunate.\nOn Wednesday, he had described bandits and killer herdsmen’s atrocities as “a tribal war,” accusing the government of taking sides.\n“What you call banditry when you cross to the other side, you find out Nigeria is fighting a tribal war,” he explained."
  },
  {
    "headline": "Olubadan: Tinubu will be a good president — I’ll do everything to support him",
    "summarized_story": "Saliu Adetunji, the Olubadan of Ibadan, says Bola Tinubu, national leader of the All Progressives Congress (APC) will make a good president.\nThe Olubadan was said to have expressed his support while receiving members of the Tinubu Vanguard in Ibadan, Oyo state capital, on Saturday.\nJohnny Benjamin, director-general of Tinubu Vanguard, made the development known in a statement.\n“Tinubu is a good man and I will do everything within my power to support his candidacy for the 2023 presidential poll,” he was quoted as saying.\nAdvertisementBenjamin said the group is committed to ensuring that the Tinubu presidential mandate is actualised."
  },
  {
    "headline": "Olubadan: Tinubu will be a good president — I’ll do everything to support him",
    "summarized_story": "Saliu Adetunji, the Olubadan of Ibadan, says Bola Tinubu, national leader of the All Progressives Congress (APC) will make a good president.\nThe Olubadan was said to have expressed his support while receiving members of the Tinubu Vanguard in Ibadan, Oyo state capital, on Saturday.\nJohnny Benjamin, director-general of Tinubu Vanguard, made the development known in a statement.\n“Tinubu is a good man and I will do everything within my power to support his candidacy for the 2023 presidential poll,” he was quoted as saying.\nAdvertisementBenjamin said the group is committed to ensuring that the Tinubu presidential mandate is actualised."
  },
  {
    "headline": "UK health secretary resigns after kissing aide in breach of social distancing rules",
    "summarized_story": "Matt Hancock has resigned as UK health secretary after he breached social distancing rules.\nAdvertisementHancock has been under attack after he was captured kissing an aide in breach of COVID-19 guidelines.\nHe announced his resignation in a letter to the UK prime minister, admitting that he has “let people who have sacrificed so much in this pandemic down”.\nAdvertisementThe UK Sun said the pictures were taken inside the Department of Health on May 6.\nAdvertisementUK Prime Minister Boris Johnson had considered the matter “closed” after his apology, but calls for his resignation continued to grow."
  },
  {
    "headline": "UK health secretary resigns after kissing aide in breach of social distancing rules",
    "summarized_story": "Matt Hancock has resigned as UK health secretary after he breached social distancing rules.\nAdvertisementHancock has been under attack after he was captured kissing an aide in breach of COVID-19 guidelines.\nHe announced his resignation in a letter to the UK prime minister, admitting that he has “let people who have sacrificed so much in this pandemic down”.\nAdvertisementThe UK Sun said the pictures were taken inside the Department of Health on May 6.\nAdvertisementUK Prime Minister Boris Johnson had considered the matter “closed” after his apology, but calls for his resignation continued to grow."
  },
  {
    "headline": "Niger Delta Avengers threatens to 'bring down' oil facilities, 'humble the economy'",
    "summarized_story": "The Niger Delta Avengers (NDA) militant group has threatened to “bring down” oil installations in the south-south, after accusing the federal government of marginalising the region.\nAdvertisementNDA, which started operations in 2016, attacked oil-producing facilities that led to a huge decline in Nigeria’s oil production.\nIn a statement on Saturday, the militants announced the launch of ‘Operation Humble, a new mission to resume the attacks.\n“It is obvious that peace in the Niger Delta, and by extension, the South-South geopolitical region is the very thin piece still binding this country together.\n“It is disheartening that despite being the economic backbone and having resolved to maintain the peaceful environment for the smooth operations of the oil multinationals whose proceeds the country cling unto for economic survival, the Niger Delta and the South-South remain the most underdeveloped, with our needs and interests undermined by the failed Nigerian State."
  },
  {
    "headline": "Nigerian businesses face an avalanche of losses as the Twitter ban continues",
    "summarized_story": "The ban happened a day after the Nigerian government announced an indefinite Twitter suspension.\nFeranmi Ajetomobi, the founder of Nifries, explained that the Twitter ban has affected anon (short for anonymous) sales which drive about 20% of sales at Nifries.\nFor Habib who runs Smiley Socks, a clothing company that also thrives on the ‘anon sales’ phenomenon, sales via Twitter have been affected.\nCompared to other advertising channels, Twitter is a cheaper and less stressful channel.\nLet’s put it across all the businesses in that range and you see that the number is massive.”With the Twitter ban, Nigerian businesses that have previously relied on the massive reach of the platform now face an avalanche of losses if the decision is not reversed soon."
  },
  {
    "headline": "Google earmarks $6 million to support African tech startups and women-led businesses",
    "summarized_story": "Google, this week, announced the launch of two new initiatives to support African-founded startups and women-led businesses in underserved communities on the continent.\nThe programs include a $3 million Black Founders Fund for African startups and a $3 million Google.org grant to help women in low-income communities develop entrepreneurial skills and access funding.\nThrough the latter, Google is looking to support access to economic opportunity for women in sub-Saharan Africa with a $3 million grant to the Tony Elumelu Foundation (TEF).\nBlack Founders Fund debuts in AfricaThe Google for Startups Black Founders Fund provides grants and technical assistance to early-stage startups led by black and diverse teams, with a goal of advancing the black community.\nAccording to Bosun Tijani, CEO of Co-Creation Hub (CcHub), which is partnering with Google on the Black Founders Fund Africa, the shortage of funding for African startups is driven by several factors."
  },
  {
    "headline": "Jesse Forrester started an e-mobility company in Kenya after deciding against going to university",
    "summarized_story": "After ALA, Jesse took up a fellowship.\nToday, his company Mazi Mobility is backed by global venture builder, Satgana, and is aiming at implementing an electric vehicle ecosystem in Africa.\nHe started his company without a university degree and he is now preparing himself to dominate the African e-mobility space.\nThe journey to Mazi by way of ALA‘Mazi’ was not always ‘Mazi Mobility’.\nAt ALA, Jesse was a part of the team behind “The Living Machine” a water treatment system that won them the $100,000 Zayed Sustainability Prize in 2019."
  },
  {
    "headline": "SEC approves Chaka as first licensed stock trading app in Nigeria",
    "summarized_story": "Chaka becomes the first to acquire the digital sub-broker license introduced by SEC in April of this year.\nAs part of a major amendment to its Consolidated Rules and Regulations, SEC recognised sub-brokers who use digital platforms to serve multiple brokers.\nOn the 19th of December 2020, the SEC published a statement that effectively barred Chaka from offering its services in Nigeria.\nThat December warning enabled Chaka to take the lead and open talks with the SEC.\nHe said the license also means Chaka could now enable other stockbroking firms who want to have a digital presence."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "How technology is helping this AC technician scale his business",
    "summarized_story": "AdvertisementIt’s why when we were asked to pitch possible stories for an article, the event “World Refrigeration Day” caught my attention.\nWorld Refrigeration DaySince 2019, World Refrigeration Day is celebrated every June 26.\nIt is an international awareness campaign established by the World Refrigeration Day Secretariat to raise the profile of the refrigeration, air-conditioning, and heat-pump sector.\nAfter watching several hours of AC installation and work tools videos on YouTube myself, I am inclined to agree.\nA vacuum pump is an essential tool used to repair cooling units to clean the compressor by removing unwanted air and water vapour."
  },
  {
    "headline": "Malawi’s 3D-printed school, learning disabilities and technology, Chrome’s third-party cookies",
    "summarized_story": "Good day,Today, I’m discussing:The world’s first 3D-printed school opening in MalawiLearning disabilities and assistive technologyGoogle’s delay in blocking third-party cookies in ChromeWorld’s first 3D-printed school opens in MalawiPhoto credit: NairametricsWhat happened?\nLearning disabilities (LDs) and assistive technology (AT)Photo by Wulan Sari on UnsplashJust two questions before you proceed: What are learning disabilities?\nAlthough there is no cure for LDs, technology has made learning easier for people with learning disabilities.\nGoogle delays plan to block third-party cookies in ChromePhoto by Brett Jordan on UnsplashAnother announcement?\nGoogle has said that it will delay its plans to block third-party cookies in the Chrome browser until 2023, a year later than planned."
  },
  {
    "headline": "Trying clothes online, virtual store attendants, Facebook plans to over overhaul eCommerce",
    "summarized_story": "Statista showed a rise in eCommerce sales in 2020, with global online sales increasing from $3.35 trillion in 2019 to $4.89 trillion in 2020.\nTo take advantage of this unprecedented rise, the company rolled out Facebook Shops on May 19, 2020.\nAlso, Facebook Shops is coming to WhatsApp soon.\nMeanwhile, the new feature will not be available for Whatsapp users globally.\nIn December 2020, WhatsApp gave an ultimatum for users to accept updated privacy policy."
  },
  {
    "headline": "Is Buhari trapped in the past?",
    "summarized_story": "Is Buhari trapped in the past?\nIn hindsight, President Buhari’s handlers will rue the Arise TV interview.\nIt presented to viewers a man who looked trapped in a time warp.\nIt removed the mystique around a taciturn ruler, revealing an insular president, stuck in the past, with self-preservation as his sole preoccupation.\nBuhari spoke at last, but only to…"
  },
  {
    "headline": "Telcos face negative half-year as subscriber numbers hit 16-month low",
    "summarized_story": "The telecommunication sector would require a major growth result in June to stop it from ending the second quarter in decline and the first half of 2021 in the negative zone.\nA decline in the first half of the year results is likely to affect the outcome of the half-year GDP growth of the industry….\nDon’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "The Gumi factor and the politics of insecurity in Nigeria",
    "summarized_story": "The Gumi factor and the politics of insecurity in NigeriaBy the provisions of the Constitution of the Federal Republic of Nigeria, the President of the country is said to be among the most powerful presidents in the world.\nBut it appears that there are some individuals in Nigeria today, commonly referred to as non-state actors, that are more powerful than the president.\nThese actors…"
  },
  {
    "headline": "Contract on renovation of NASS complex undergoing procurement process – FCDA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Federal Capital Development Authority (FCDA) says proposed contract for rehabilitation of National Assembly Complex is currently undergoing procurement process in line with the Procurement Act of 2007.\nThe Head, Public Relations and Information, FCDA, Mr Richard Nduul, made the disclosure in a statement on Friday in Abuja.\nAccording to him, this has been the tradition with every other assignment which the FCDA has undertaken.\n“The attention of the FCDA has been drawn to recent flooding of the lobby of the national assembly complex, Abuja resulting from leakages from the roof.\n” Full waterproofing of the roof of the White House building is a major aspect of the proposed renovation of the complex,” he said."
  },
  {
    "headline": "Ologbo modular refinery ready for production- Gov. Obaseki – Nigerian Observer",
    "summarized_story": "Godwin Obaseki of Edo, says the modular refinery in Ologbo, Ikpoba – Okha Local Government Area (LGA) of the state was ready for production.\nObaseki stated this shortly after he was conducted round the facility by the Managing Director of the refinery, Mr Tim Tian.\n“The plant is ready to receive crude oil; it is ready to process and it is ready to deliver products.\n“The governor has this project dear to his heart, not only this project, the power plant is also situated in Ologbo.\nMr Tim Tian, the Managing Director of the Ologbo modular refinery, commended the governor for his efforts towards actualising the project."
  },
  {
    "headline": "Obaseki unveils plans for Benin City Cultural District, EMOWAA pavilion …chronicles journey for return of Benin artifacts – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has unveiled plans for the Benin City Cultural District, which will house the Edo Museum of West African Arts (EMOWAA).\nObaseki disclosed this at the 2021 National Commission for Museums and Monuments (NCMM) Retreat for management staff and curators held in Benin City, the Edo State capital.\n“In this plan, we have included the carving out of a large area as a Cultural District and the Museum will be located in the Cultural District.\nIf we host 5,000 visitors every year as a result of the attraction to the Museum, the state will benefit from it.\n“The Edo Museum of West African Arts (EMOWAA) is a big opportunity for us to be at the forefront of promoting and establishing this museum."
  },
  {
    "headline": "Edo govt, NDLEA link rising crime rate to drug use, lead walk against drug abuse – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government and the National Drug Law Enforcement Agency (NDLEA), as part of activities to mark the 2021 International Day Against Drug Abuse and Illicit Trafficking, led other stakeholders in a sensitization road walk against drug abuse and trafficking across the Benin metropolis.\nThe International Day Against Drug Abuse and Illicit Trafficking is observed globally every June 26 to strengthen action and cooperation to achieve the goal of an international society free of drug abuse.\nTo raise awareness on the dangers of the menace, the Edo State Drug Control Committee (ESDCC) and NDLEA staged a walk from Edo State Secretariat to Sakponba Road, Ring Road, and Sapele Road, warning residents against the intake of drugs.\nAccording to him, “We took this walk against drug abuse today to create the necessary information in society.\nDrug abuse is an ill that must be eradicated completely."
  },
  {
    "headline": "Boko Haram, ISWAP reunite, pledge allegiance to AlKhuraishi",
    "summarized_story": "ADVERTISEMENTBarely a month and some weeks after Abubakar Shekau, former leader of the factional Boko Haram sect, killed himself after a violent confrontation with some renegade Islamic State of West Africa Province (ISWAP) top commanders, PRNigeria has gathered that both Boko Haram and ISWAP fighters have mended fences.\nFour insurgents, drawn from the defunct Boko Haram and ISWAP sects, in the clip, were seen pledging their loyalty to their new commander while speaking in Arabic, Hausa, English and Fulfulde.\nMeanwhile, in the latest video released by Boko Haram, the terrorist element who first spoke, extended his greeting to their new Leader, Khuraishi, thanking him for bringing them together, eventually.\nPledging his loyalty, he said every member of Boko Haram and ISWAP should be happy that they are now united.\nAll the disbelievers have entered trouble.”According to the daredevil terrorist, every Boko Haram and ISWAP member must be ready to fight under the directive of their new leader, for them to survive, and succeed."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Yin Shiru Kan Abin Kunyar Mutuwar ‘Yan Asalin Kasar Kanada Ya Nuna Yadda Ake Baki Biyu Game Da Batun Kare Hakkin Dan Adam A Duniya",
    "summarized_story": "Share on TelegramShare on TwitterShare on FacebookDaga CRI HausaKafar RT a jiya ta wallafa a shafinsa wani bayanin da Tom Fowdy, marubuci na kasar Birtaniya, wanda kuma shi ne manazarci kan harkokin siyasa da huldar kasa da kasa ya rubuta, inda ya ce, yayin da kasashen yammacin duniya suka yiwa kasar Sin taron dangi game da batun ‘yan kabilar Uyghurs a jahar Xinjiang, sai kuma ga shi an yi shiru game da karin manyan kaburbura masu yawa da aka gano a wasu makarantu na ainihin mazauna kasar Kanada.\nA jiya an gano kaburbura 751 a wata makarantar kwana da ke kasar Kanada, kari kan zarge zargen da ake yi na gano gawarwakin mutane 215 a wata makaranta a wasu makonni da suka gabata.\nBayanin ya kara da cewa, wannan na daga cikin al’amura mafi muni a tarihin kasar Kanada, ya kasance al’amarin da duniya bata da cikakkiyar masaniya kansa.\nA cikin dogon lokaci, kasar ta taka rawa wajen boye wasu laifuka dake shafar take hakkin bil adama.\nSai dai bayyanar wadannan labarai marasa dadi na zuwa ne a daidai lokacin da Ottawa, tare da sauran kasashen yammacin duniya, suke zargin kasar Sin game da batutuwan dake shafar yankin Xinjiang mai cin gashin kansa, inda suke zargin an gudanar da abubuwan take hakkin bil adama makamancin wancan."
  },
  {
    "headline": "Masanin Najeriya: Kasar Sin Ta Samu Dimbin Nasarori Karkashin Jagorancin Jam’iyyar Kwaminis",
    "summarized_story": ""
  },
  {
    "headline": "Ministocin Wajen Sin Da Masar Sun Tattauna Ta Wayar Tarho Kan Batun Huldarsu",
    "summarized_story": ""
  },
  {
    "headline": "Ya Kamata Japan Ta Soke Aniyarta Na Zubar Da Ruwan Dagwalon Nukiliya Cikin Teku",
    "summarized_story": ""
  },
  {
    "headline": "Zargin Ta’addanci: DSS Ba Ta Gayyace Ni Ba – Sheikh Gumi",
    "summarized_story": ""
  },
  {
    "headline": "Nigerian Bishop makes a comprehensive list of adulterous pastors and politicians",
    "summarized_story": "A Nigerian Bishop, identified as Don Simon Osieme has compiled a comprehensive list of all adulterous pastors and politicians across Isoko land in Delta State.\nThe cleric took to his social media to share the list immediately after his children arrive safely in Texas, USA.\nAccording to him, the list contains profile cases of adultery perpetuated by pastors and politicians with whom, when, and where.\nHe wrote; ADULTERYMANIA SAGA VS THE HIDDEN EYES”Adultery by a wife in Isoko tradition is attempted murder and in some cases very close to me, first-degree murder.\nNo current Isoko House of Assembly member is on this list."
  },
  {
    "headline": "No graduate should be employed without certificate of national service – DG NYSC",
    "summarized_story": "Ukpono Ukpong, AbujaAll Employers of labour in the public and private sector have been warned against employing graduates without demanding for Certificate of National Service.\nThe Director-General, National Youth Service Corps (NYSC), Brig Gen Shuaibu Ibrahim, gave the warning yesterday at the opening ceremony of Corps Legal Aid Workshop, yesterday in Abuja.\nSpeaking further, he advised all employers to present the NYSC certificates of their existing employers to the scheme for authentication.\n“Would like to use this medium to remind all employers in the public and private sectors that it is mandatory to demand the Certificate of National Service or Exemption Certificate duly issued by the National Youth Service Corps before offering employment to any holder of Degree or Higher National Diploma.\nHe urged Legal Officers and Corps Lawyers to redouble efforts at enlightening the general public on the provisions of the NYSC Act."
  },
  {
    "headline": "Senate places 75% import duties on importation of syringes, needles",
    "summarized_story": "Tunde Opalana, AbujaThe Senate has ordered a hike in importation duties on syringes and needles into the country and therefore recommended 75 percent port duties.\nThe two directives were meant to protect local manufacturers, give them enabling environment to contribute to the revenue base of the nation and to reduce unemployment.\n“Importation of syringes and needles is killing local manufacturers making them to lay off staff and preventing them from contributing effectively to the economy.\nThis has been an impediment to local manufacturers attaining this status and preventing their being patronized by organisations using donor funds”.\n“The local manufacturers are actually the highest supplies of syringes and needles for hospitals."
  },
  {
    "headline": "FG flags off training for Irish Potato farmers in Kano",
    "summarized_story": "By Nneka NwogwugwuThe Federal Ministry of Agriculture and Rural Development (FMARD) has commenced training for Irish potato farmers in Kano.\nFlagging off the training on Monday at Gezawa Local Government Area of the state, Hajia Karima Babangida, the Director, Federal Department of Agriculture, who spoke on the topic, ‘re-educating Irish potato farmers on farming as business rather than been a culture’, said that Nigerian farmers must begin to change the narratives about farming as a culture to farming as a business.\n‘’It’s important to know that FBS is capable of starting a potato revolution here in Bauchi State especially in Toro LGA and other communities in the state that has potentials to grow potato during dry season.\n‘’FMARD is also poised to build the capacity of farmers in other states with potentials to grow Irish potato with new innovations and techniques on GAP and FBS to ensure productivity and income generation.\nThe training which began on Monday, June 21, will end on Friday June 25, 2021."
  },
  {
    "headline": "Entertainers, media personalities, others gather for Bodex Social Media Hangout",
    "summarized_story": "CEO of Bodex media and convener of the event, Florence Bodex Hungbo, said the theme of this year’s Social Media Hangout came long before the twitter ban and she felt God was using her to pass across a message through the theme.\nI love to create a very good relationship with people I come across and the result is what you are seeing with the class of people present here todayShe hinted that there is still hope for traditional media platforms only if they are able to look for innovative ways to merge social and traditional media to achieve results.\n“There is still hope for traditional media.\nWhat we need to do is to have a road map that can enable us to co-exist.\nWe need to find out what others do traditionally, and what others do digitally for us to be able to coexist and be trendy."
  },
  {
    "headline": "Entertainers, media personalities, others gather for Bodex Social Media Hangout",
    "summarized_story": "CEO of Bodex media and convener of the event, Florence Bodex Hungbo, said the theme of this year’s Social Media Hangout came long before the twitter ban and she felt God was using her to pass across a message through the theme.\nI love to create a very good relationship with people I come across and the result is what you are seeing with the class of people present here todayShe hinted that there is still hope for traditional media platforms only if they are able to look for innovative ways to merge social and traditional media to achieve results.\n“There is still hope for traditional media.\nWhat we need to do is to have a road map that can enable us to co-exist.\nWe need to find out what others do traditionally, and what others do digitally for us to be able to coexist and be trendy."
  },
  {
    "headline": "Madonna stuns gay fans with breast-baring club performance",
    "summarized_story": "Madonna stunned fans at The Standard Hotel’s Boom Boom Room in New York on Thursday night by performing on the bar.\nThe pop superstar belted out her tracks Hung Up and I Don’t Search I Find as stars like Lance Bass, Adam Lambert, Zachary Quinto and Jon Batiste looked on from the crowd during the Boom x Pride event.\nWearing a blue wig, red elbow-length gloves and a revealing black leather and lace outfit that left her breasts exposed, Madonna told the thrilled clubbers in footage posted on social media,”To not celebrate pride without people would have been a tragedy for me…Take nothing for granted because you never know what’s waiting for all of us around the corner.\nLearn to love yourself.”Madonna and Quinto auctioned off Polaroids for two LGBTQ support groups – the Ali Forney Center and the Haus of US – and then each pledged a personal donation of $25,000 (£18,000).\nMusicnewsShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Madonna stuns gay fans with breast-baring club performance",
    "summarized_story": "Madonna stunned fans at The Standard Hotel’s Boom Boom Room in New York on Thursday night by performing on the bar.\nThe pop superstar belted out her tracks Hung Up and I Don’t Search I Find as stars like Lance Bass, Adam Lambert, Zachary Quinto and Jon Batiste looked on from the crowd during the Boom x Pride event.\nWearing a blue wig, red elbow-length gloves and a revealing black leather and lace outfit that left her breasts exposed, Madonna told the thrilled clubbers in footage posted on social media,”To not celebrate pride without people would have been a tragedy for me…Take nothing for granted because you never know what’s waiting for all of us around the corner.\nLearn to love yourself.”Madonna and Quinto auctioned off Polaroids for two LGBTQ support groups – the Ali Forney Center and the Haus of US – and then each pledged a personal donation of $25,000 (£18,000).\nMusicnewsShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Niger Delta Avengers names woman Tu-ere as new leader, Field Commander",
    "summarized_story": "By Jethro IbilekeThe Niger Delta Avengers (NDA), has named a woman, identified as Tu-ere, aka Queen of the Creeks as its new leader and Field Commander.\nThe Niger Delta militant group, in a statement on Saturday said “The high command of the NDA has promoted and appointed one of our finest operatives, Field Commander Tu-ere, aka Queen of the Creeks to the rank of Brigadier-General.\nWe advise other female operatives to emulate her and be dedicated to our mission at all times.\n“Conclusively, we wish to state unequivocally and in simple terms that we are back with Operation Humble, with the aim of humbling the economy into permanent recession and political players from the Niger Delta extraction to political retirement.\n“There will be no going back until the Nigerian economy is humbled into recession never to rise again!”, the statement concluded,” the group said."
  },
  {
    "headline": "Boko Haram, ISWAP pick AlKhuraishi as new leader",
    "summarized_story": "By AbankulaBoko Haram and its breakaway faction, ISWAP have mended fences and jointly picked a new leader, called Aba Ibrahim Al-Hashimiyil AlKhuraishi.\nPledging his loyalty, he said every member of Boko Haram and ISWAP should be happy that they are now united.\n“All the disbelievers have entered trouble.”According to the daredevil terrorist, every Boko Haram and ISWAP member must be ready to fight under the directive of their new Leader, for them to survive, and succeed.\nThe video was silent on the fate of 24 year-old, Bakura Sahaba Modu, who was announced last week by Boko Haram as successor to Abubakar Shekau.\nIt also did not mention the fate of Al Barnawi, son of Boko Haram founder, Mohammed Yusuf."
  },
  {
    "headline": "Scores of bandits shot dead in fierce gun-battle with troops in Zamfara",
    "summarized_story": "The Nigerian Army on Saturday said its troops have killed scores of bandits in a gun-battle at Mayanchi-Dogo Karfe and Fagantama villages in Talata Marafa LGA of Zamfara State.\n“In the fierce encounter that ensued, the bandits were overwhelmed by the superior firepower of the troops.\nRelatedly, he disclosed that troops had neutralised five bandits in another encounter at Bingi village, in Bungudu LGA of Zamfara.\nHe added that the gallant troops recovered one AK 47 riffle, one motorcycle and three mobile phones from the routed criminals.\n“He urged communities in the North West to support the troops with useful information at all times to enhance anti- banditry operations,” Nwachukwu said."
  },
  {
    "headline": "New Drug War Will Be Deadlier Than Fight Against Insurgency – Buhari",
    "summarized_story": "President Muhammadu Buhari launched the National Drug Law Enforcement Agency’s (NDLEA) Fight Against Drug Abuse (WADA) on Saturday, warning that the drug war is dangerous.\nBuhari emphasized that the drug war was more hazardous than insurgency or banditry warfare since it targeted three generations for annihilation.\nThe News Agency of Nigeria (NAN) reports that Buhari said the war against drug abuse and illicit trafficking is a war that must be fought by well-meaning citizens.\nHe said “it is, therefore, my pleasure to declare on behalf of the good people of Nigeria, a War Against Drug Abuse (WADA), not just as a slogan, but a call for civil action for all Nigerians to take an active part in this war.\nBuhari charged the NDLEA to intensify efforts at ridding the country of criminal elements."
  },
  {
    "headline": "Nigeria’s Senate President, Ahmed Lawan Marries Young Shuwa-Arab Girl In Secret Wedding",
    "summarized_story": "Ahmad Ibrahim Lawan, the President of the Senate, married a new bride in a very private ceremony in Borno State.\nThe Senate President’s new bride is Zainab Algoni Abdulwahid, a young Shuwa Arab girl, according to SaharaReporters.\n“The Senate President of Nigeria, Lawan, got married to a young Shuwa Arab Girl at Maiduguri.\nThe Senate President didn’t attend the Nikaah, but he sent a delegation to go and get it done.\nWhen contacted, Ola Awoniyi, Special Adviser on Media to the Senate President, said he was at the airport."
  },
  {
    "headline": "In Ogun, Mob Sets Dangote Truck Ablaze For Killing Student",
    "summarized_story": "According to the Traffic Compliance and Enforcement Corps (TRACE), a mob of secondary school students set fire to a truck bearing the Dangote Group’s inscription after a colleague was killed on Friday.\nThe collision occurred near Sabo intersection in Ilaro, Yewa South Local Government Area of Ogun, according to Babatunde Akinbiyi, the agency’s spokesman.\nThe event occurred less than a week after an enraged mob set fire to a corporate truck in Ogun State, resulting in the deaths of two people.\n“According to eyewitness accounts, the Dangote truck was coming from Ibese and heading towards Owode-Idiroko when the unfortunate incident happened.\n“Some students trooped out in their numbers and set the Dangote truck on fire."
  },
  {
    "headline": "BREAKING: Niger Delta Avengers Announce Return, Vow To Cripple Economy",
    "summarized_story": "Oil output fell from a high of 2.2 million barrels per day to below one million barrels per day, the lowest level in more than 30 years, as a result of the attacks.\nThe terrorist organization announced in a statement on Saturday that it has initiated ‘Operation Humble,’ which is aimed at hurting the Nigerian economy.\nNo Confidence vote on PANDEFIt said it has lost confidence in the Chief Edwin Clark-led Pan Niger Delta Forum (PANDEF), which played a critical role to make the group accept ceasefire in 2017.\n“This operation shall be coded ‘Operation Humble’‚ aimed at bringing down targeted oil installations in the Niger Delta Region, capable of humbling the economy into permanent recession.\n“This mission is also targeted at political actors who are collaborating with the Nigerian Government to undermine the interest of the Niger Delta people."
  },
  {
    "headline": "Hunger, starvation imminent over security concerns",
    "summarized_story": "BENJAMIN SAMSON in this report examines the effects of the ugly security situation on food production and availability.\n“The security situation has crippled the economy as travelling on the highways across the country has become a nightmare to Nigerians.\nFAO, ActionAid’s alarmsIn the same vein, the Food and Agriculture Organisation (FAO) has raised the alarm over the worsening state of food security in the country.\nIt, therefore, stressed the need for urgent measures to protect the most vulnerable, keep the national agricultural supply chains functional and efficient, and mitigate the food security impacts of the Covid-19 pandemic.\nFor example, wheat remains an imported production input costing Nigeria about N222 billion in the first quarter of 2021 alone."
  },
  {
    "headline": "Breaking: DSS invites Sheikh Gumi over comment on Nigerian Military",
    "summarized_story": "Kaduna-based Islamic cleric, Sheikh Ahmad Abubakar Gumi, has been reportedly invited the Department of State Security ( DSS) for questioning over remarks he made on Arise TV interview that allegedly portrayed the Nigerian military in bad light.\nThis was revealed via a report by the Voice of America, VOA, Hausa service monitored on Friday.\nThe report said Gumi was invited at the Kaduna office of the DSS, after the military authorities took exception to comments by Sheikh Gumi, alleging that their operatives were conniving with bandits.\nDetails coming…"
  },
  {
    "headline": "VIDEO: Watch Super TV CEO’s last outing with ‘Killer’ girlfriend",
    "summarized_story": ""
  },
  {
    "headline": "Okowa tasks States’ legislatures on constitutional amendment -NigPilot",
    "summarized_story": "Governor Ifeanyi Okowa of Delta has called on the States’ House of Assembly to ensure that the Constitutional Amendment Bill is passed when passed to them by the National Assembly.\nOkowa made the call on Friday when he received the Conference of Speakers of States’ Legislatures in Nigeria led by its Chairman and Speaker of Bauchi State House of Assembly, Rt.\nHe stated that as states’ legislatures, the onus was on them to pass the Constitutional amendments in the interest of the nation.\n“The fear of legislative autonomy is unfounded because our state House of Assembly has been operating in autonomy since 2019,” he said.\nSpeaker of Delta House of Assembly and Deputy Chairman of the Conference of Speakers, Rt Hon."
  },
  {
    "headline": "NAF base was not attacked by terrorists in Kaduna -NigPilot",
    "summarized_story": "The Nigerian Air Force (NAF) on Saturday denied a trending report that its Base in Kaduna was attacked by terrorists.\nAccording to the statement, “Merchants of fake news are at it again.\nThis time around, their focus is on the premier Nigerian Air Force Base at Kaduna , which they claimed came under terrorist attack in the early hours of today, 26 June 2021.\n“Members of the public should please disregard the news as it is entirely false”.\nAir Commodore Edward Gabkwet concluded thatthere was nothing of such as the inhabitants of the entire Base are going about their normal activities and duties without any threat whatsoever."
  },
  {
    "headline": "Troops kill scores of bandits in Zamfara State -NigPilot",
    "summarized_story": "The troops of the 8 Division Nigerian Army (NA) , killed scores of bandits while on a fighting patrol, along with Mayanchi-Dogo Karfe and Fagantama villages in Talata Marafa LGA of Zamfara State.\nHe said that in the fierce encounter that ensued, the bandits were overwhelmed by the superior firepower of the troops.\nIn a related development, the Army Spokesperson said that troops again killed five bandits in another encounter at Bingi village, in Bungudu LGA of Zamfara.\nThe gallant troops recovered one AK-47 rifle, one Motorcycle, and three mobile phones from the routed criminals,” he said.\nHe also tasked communities in the North West to support the troops with useful information at all times to enhance anti-banditry operations."
  },
  {
    "headline": "Kumuyi urges Nigerians to connect with God for divine intervention -NigPilot",
    "summarized_story": "…begins 6 days crusade in Abuja, othersAmidst daunting challenges the country grapples with, the General Superintendent, Deeper Life Bible Church, Pastor William Kumuyi , yesterday, urged Nigerians to connect to God for divine intervention.\nHe said: “Suffering came with sinning against God.\n“You can invite sin with one finger but at the end, ten fingers will not be enough to remove them.\nHe knows where your goodness, prosperity, satisfaction and sufficient supplies are, and He will lead you to them as you connect to Him.\n“When God calls you to repentance, you have to come to Him and do away with all those things which cause disconnection, chief of which is sin”, he said."
  },
  {
    "headline": "We Want To Conclude North-East Insurgency – Army Chief",
    "summarized_story": "﻿Musa Mingyi in Damaturu and Blessing Tunoh in MaiduguriThe Chief of Army Staff, Major-General Farouk Yahaya on Saturday said the army is committed to ending the insurgency in the North-East.\nThe army chief made the comment while on an operation visit to frontline troops of Sector 2, Joint Taskforce of the Nigeria Army ‘Operation Hadin Kai’ in Damaturu, Yobe State.\nMajor-General Yahaya said ending the insurgency will allow the army move on to other things.\nMajor-General Yahaya was last at the command on the entourage of the immediate past late Chief of Army Staff, Lieutenant-General Ibrahim Attahiru on March 14.\nThe army chief, at the meeting, said such collaborations have paid off in the past."
  },
  {
    "headline": "NDLEA Boss Says About 10.6million Nigerians Are Actively Abusing Cannabis",
    "summarized_story": "The Chairman of the National Drug Law Enforcement Agency (NDLEA), Buba Marwa has lamented over the pervasive abuse of (cannabis) substance in the country, revealing that about 10.6 million Nigerians are actively abusing the substance.\nMarwa said this on Saturday at the launch of War Against Drug Abuse in commemoration of the United Nations International Day against drug abuse and illicit drug trafficking at the State House conference centre in Abuja.\nAccording to the NDLEA boss, the increasing trend of drug abuse in the country is worrisome and has become an enabler of insecurity and a catalyst for terrorism.\nEarlier on Monday, he stressed that he is opposed to demands for the legalisation of cannabis in Nigeria.\nHe explained that the nation cannot afford to mortgage the lives of the citizens for financial gains by legalising cannabis."
  },
  {
    "headline": "Deep Impact: How COVID-19 Exposed The Education Sector’s Digital Flaw",
    "summarized_story": "“Because if it’s the same standards as what we had three, four years ago, I’m obviously scared for public school students.\n“I kind of feel like it’s very unfair that public school students and private school students would sit for the same exams.\nThe importance of digital toolsSamuel Onyeledo, 35, still remembers vividly the first day he walked into a public primary school in Kaduna.\nBecause a basic thing the child should get before leaving primary education is literacy.\nThere were radio programs, but he wasn’t sold on their effectiveness for primary school students."
  },
  {
    "headline": "World’s Largest Flag Unveiled In Ibadan",
    "summarized_story": "The world’s largest flag covering an area of 3,275 square meters has been unveiled in Ibadan, the Oyo State capital.\nCreated by the designer of the Nigerian Flag, Taiwo Akinkunmi, the flag was unveiled on Thursday by the Chief of Defense Staff, General Lucky Irabor.\nHe urged Nigerians to, “always remember that the flag is not a mere symbol of Nigeria, it is a symbol of a United Nigeria.\nLet us work together for unity and love in the country.”Pa Akinkunmi designed the Nigerian flag in October 1959, when he was barely 23.\nSpeaking at the unveiling of the world’s largest flag, Akinkunmi, now 85 years old, said the journey to creating Nigeria’s national flag started when he was studying Electrical Engineering at Norwood Technical College in London."
  },
  {
    "headline": "UK Health Secretary Matt Hancock Resigns After Covid Breach",
    "summarized_story": "UK Health Secretary Matt Hancock resigned on Saturday following revelations that he broke the government’s own coronavirus restrictions during an affair with a close aide.\nThe frontman for Britain’s response to the pandemic, particularly the nationwide vaccine roll-out, quit in a letter to Prime Minister Boris Johnson.\nJohnson said he was “sorry” to receive Hancock’s resignation, and that he should be “immensely proud” of his service.\nLast week, Hancock rejected criticism of his handling of the Covid pandemic after private WhatsApp exchanges emerged in which Johnson appeared to describe him as “hopeless”.\nHancock has also previously faced allegations that he lied to Johnson and awarded a contract to an unqualified friend."
  },
  {
    "headline": "There was no attempted attack on NAF base Kaduna – NAF",
    "summarized_story": "The Nigerian Airforce says no attempt was made to attack its Premier Base at Mando, that’s in Kaduna state.\nThis follows reports by some news outlets that the NAF base was attacked on Saturday by terrorists.\nDirector of Public Relations and Information of the force, Air commodore Edward Gabkwet made this known in a statement."
  },
  {
    "headline": "Niger Delta Avengers announce return, vow to resume attacks on oil facilities",
    "summarized_story": "The Niger Delta Avengers (NDA), the militant group notorious for attacking oil-producing facilities in the Niger Delta region has announced its return.\nNDA crippled Nigeria’s economy between 2016 and 2018 by attacking oil facilities in the region which plunged the nation into recession.\nThe militant group in a statement made available to reporters on Saturday said it had launched ‘Operation Humble’ aiming at crippling the economy as it did in previous times.\nThe group, roughly halved Nigeria’s oil production in 2016, including an attack on an underwater pipeline that took it out for more than a year.\nIt has since made a variety of threats but has not staged any attacks since 2017."
  },
  {
    "headline": "Illegal electricity wire connector electrocuted in Benin City",
    "summarized_story": "Edo State Police command has confirmed the death of one Augustine Onyeka whose lifeless body was on Friday found on Electricity pole at Akugbe street , Ikpoba hill, Benin city.\nIn a statement signed by the Police Public Relations officer, SP Kontongs Bello, the command received the information from members of his street that the said Onyeka Augustine, 42 years old of No 6, Akugbe Street, off 1st Upstairs Road Benin City has been electrocuted while he was trying to illegally reconnect BEDC wire that was initially disconnected at Eguavoen Street off first upstairs.\nThe statement further explains that upon the receipt of the information, the Divisional Police Officer (DPO), Ikpoba Hill Division CSP Moses Olanrewaju immediately swung into action by deploying officers to the scene where they met the lifeless body of the man hanging on the wires.\nThe body has been removed by the Police Operatives and deposited at the morgue while effort is in place to contact the family members of the deceased."
  },
  {
    "headline": "#EndSARS: Lagos Panel Awards N83m Compensation to Victims of Police Brutality",
    "summarized_story": "The Lagos State Judicial Panel of Inquiry and restitution for SARS related abuses and other matters has awarded a total amount of N83 million in compensation to victims of police brutality.\nAmong those compensated was the family of late Kolade Johnson, awarded the sum of N10 million.\nNigerians voiced their outrage on social media after Johnson was shot during a raid by police officers at Onipetesi area in Lagos on March 31, 2019.\nArise Correspondent, Seyitan Atigarin the details."
  },
  {
    "headline": "Special Report: A Closer Look At Orisa Spirituality",
    "summarized_story": "Yoruba indigenous religion, also known as Orisa spirituality, is practiced by a very small percentage of the population today.\nIn this report, Arise News Correspondent Laila Johnson-Salami visited the family home of an Orisa Priestess in Ibadan, to learn more about the practice…"
  },
  {
    "headline": "Over a Dozen Vaccinated Doctors Dead Amid Indonesia Covid Surge",
    "summarized_story": "More than a dozen fully vaccinated doctors have died of Covid-19 in Indonesia, according to a medical association, as the Southeast Asian country battles a rash of severe cases in inoculated medical workers and highly infectious new virus strains.\nThis month, more than 300 vaccinated doctors and healthcare workers in Central Java were found to have been infected with COVID-19, with about a dozen hospitalised.\nThe country is also grappling with new virus strains, including the highly infectious Delta variant first identified in India.\nMore than a third of the cases reported were elementary school-age students, while a quarter were high school-age students, Inke was quoted by Detik as saying.\n“My sample was among the tested sampling for the Delta variant."
  },
  {
    "headline": "Colombia President Iván Duque’s Helicopter Hit by Gunfire",
    "summarized_story": "Gunfire has hit a helicopter carrying the president of Colombia as it flew near the border with Venezuela.\nPresident Iván Duque was flying toward Cúcuta in the Norte de Santander province, alongside the defence minister, interior minister, and the province’s governor.\n“Our state is strong and Colombia is strong to confront this kind of threat,” he said in a video address posted on Twitter.\nLocal newspaper Semana reports the occupants heard a noise as if something had hit the engine just as the helicopter was coming in to land.\nEarlier this month the ELN denied any involvement in a car bomb attack on a military base in Cúcuta."
  },
  {
    "headline": "Widow Seeks ‘Thorough’ Investigation into John McAfee Death",
    "summarized_story": "“We had a plan of action already in place to appeal that decision,” Janice McAfee told reporters.\nIt said: “We are closely monitoring local authorities’ investigation into the cause of death.\nJohn McAfee had several children from previous relationships, Janice McAfee said.\n“Even though he was born in England, America was his home,” Janice McAfee said.\n“All John wanted to do was spend his remaining years fishing and drinking,” his widow said on Friday."
  }
]