[
  {
    "headline": "Pictorial: Buhari presides over FEC meeting after South Africa trip",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), on Wednesday presided over the Federal Executive Council meeting at the State House, Abuja.\nThis is coming a day after the President arrived Abuja from South Africa, where he attended the Intra-African Trade Fair at Durban.\nBuhari’s Special Adviser on Media and Publicity shared pictures of the FEC meeting which the President presided on at the State House.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Buhari hails ex-NBA president, Olanipekun, at 70",
    "summarized_story": "on Wednesday sent a congratulatory message to the former President, Nigerian Bar Association, Wole Olanipekun, ahead of the latter’s 70th birthday.\nBuhari’s Special Adviser on Media and Publicity made this known in a statement titled, ‘President Buhari Greets Foremost Lawyer, Wole Olanipekun at 70.’The President commended the ex-NBA boss for replicating himself in his four biological offspring, who are all lawyers.\nThe statement read, “President Muhammadu Buhari rejoices with former President, Nigerian Bar Association, Chief Wole Olanipekun on the occasion of his 70th birthday, November 18, 2021.\n“The President salutes a life dedicated to jurisprudence and service to the country, which has pedestaled Chief Olanipekun as a former Attorney General/Commissioner for Justice in Ondo State, one time NBA President, Vice President Pan African Lawyers Union, Life Bencher among others.\n“He wishes Chief Olanipekun longer life in good health, and greater service to God, and to humanity.”Copyright PUNCH."
  },
  {
    "headline": "Expelling me from APC will cause more crisis, Marafa threatens Buni",
    "summarized_story": "“APC is a political party, not a committee.\nMai Mala is the chairman of the APC convention planning committee and not APC itself,” said Marafa.\nThe Chairman of APC today is an overzealous chairman of convention planning committee only and a sitting governor”, Marafa declared.\n“What does our party constitution says that renders Buni’s committee null and void?\nMarafa reiterated his determination to institute legal actions to save the party from what he tagged, “over ambitious Buni” if he refuses to revert to his original assignment as chairman convention planning committee."
  },
  {
    "headline": "5 die as fuel tanker explodes on Lagos-Ibadan Expressway",
    "summarized_story": "By James Ogunnaike, ABEOKUTAThe Ogun State sector command of Federal Road Safety Corps, FRSC, Wednesday, confirmed that five persons were burnt to death in the early hours of Wednesday, as a petrol tanker burst into flames on the Lagos-Ibadan Expressway.\nThe Sector Commander of FRSC, Mr Ahmed Umar, said this in a statement he issued to newsmen in Abeokuta, the Ogun State capital.\naround Tunji Alegi Filling Station Kwakyama area of Ogere on the Lagos-Ibadan expressway.\nThe sector commander said that the suspected cause of the incident was wrongful overtaking and dangerous driving on the part of the petrol tanker driver, who collided with a moving truck and it resulted into fire.\nMeanwhile, the FRSC Ogere operatives are on ground to manage the traffic situation in order to reduce discomfort inflicted by the development."
  },
  {
    "headline": "BREAKING: Senate probes Lagos gas explosion",
    "summarized_story": "The scene of the gas explosion.\nThe Senate has mandated its Committees on Petroleum Downstream and Gas to, as a matter of urgency, investigate the remote and immediate causes of the explosion and report back to the Senate with a view to avoiding future occurrences.\nResolutions of the Senate, on Wednesday, were sequel to a motion titled, ” Urgent need to Investigate Gas Explosion at Ladipo Area, Mushin LGS resulting in Loss of Lives and massive destruction of property.”The motion was sponsored by Senator Olamilekan Adeola(APC, Lagos West).\nThe Senate also observed a minute silence in honour of innocent Nigerians that lost their lives in the national tragedy.\nThe Upper Chamber also resolved to write a condolence letter to the people and government of Lagos State on the deaths arising from the explosion."
  },
  {
    "headline": "Act on #EndSARS panel report, UN, US, AI, CSOs, Falana, others tell Lagos govt",
    "summarized_story": "The statement issued by the US Embassy in Nigeria, said: “The United States welcomes the conclusion of the Lagos State Judicial Panel of Inquiry with the transmission of its final report.\nFalana said: “The members of the Okuwobi Judicial Commission of Inquiry deserve commendation for the thorough investigation of police brutality in Lagos State.\n“Secondly, the identified security operatives and their enablers must be court-marshalled and subjected to room-orderly trial but all must, thereafter, be prosecuted by the Nigerian State (AGF) to show the clear resentments and disapproval of the Nigerian State.\n“Let’s wait for the white paper from Lagos State government; I will like to see how Lagos State will not prosecute people who were involved in the cover-up and how they prosecute people who refused to appear in a judicial panel.\n“The judicial panel has stood up and we must clap for them, I advise the youths in the #EndSARS protest to channel their anger at the next elections in two years and not to the judicial panel report.”Vanguard News Nigeria"
  },
  {
    "headline": "Commotion in Akure as ‘okadaman’ protesting colleague’s killing is shot dead",
    "summarized_story": "The protesting okada riders.\nBy Dayo Johnson, AKURECommercial motorcyclists, popularly known as Okada riders, are protesting the killing of their colleague by a policeman in Akure, the Ondo State capital.\n“Bonfires were set in front of the ‘A’ Division as the Okada riders demanded to see the policeman who shot dead one of their colleagues.\nBoth men, according to the source, died on the spot, following which other Okada riders began a protest.\nThe protesting Okada riders demanded for the release of the killer-policeman or they would set the building ablaze."
  },
  {
    "headline": "Kaduna govt plans less reliance on federal allocation to finance budget",
    "summarized_story": "The Kaduna State Government has said that in the next few years, it plans to stop relying on federal allocation to fund its budget.\nAccording to him, the state has been boosting its tax collections with about N57 billion which has come with a lot of hard work, stressing that it is in partnership with the Kaduna State House of Assembly towards the realization of its goal.\nHe stated that they have been able to move the state from a state that completely relies on federal allocation to one that is sustainable in order to carry out its programmes in the state.\nThe Commissioner stressed that it is important to note and understand that the state government would bring more and more bills to the House and more initiatives to state, saying that understanding revenue to the state is the most important thing to do.\nHe said since Gov El-Rufai presented the budget to the state house, it has been following up various processes to finalize a budget that is not only inclusive but sustainable."
  },
  {
    "headline": "Gov Masari presents N341bn 2022 budget to Katsina Assembly",
    "summarized_story": "Katsina State Governor, Aminu Bello Masari, presented the 2021 budget proposal of N340,951,912,557.00 to lawmakers at Katsina State House of Assembly on Wednesday.\nSpeaker, Honourable Members of the State House of Assembly, other invited guests, the total budget for the 2022 fiscal year is in the sum of N340,951,912,557.00 with 69.85% Capital Expenditure and 30.40% Recurrent Expenditure.\nIn aggregate terms, the 2022 Budget is higher than that of the 2021 revised budget by N48,064,131,214.00”However, Masari noted that the “2022 recurrent revenue has increased by 8.60% over that of 2021 Revised Budget.\nThe 2022 Budget is therefore tagged as “Budget of Economic Resilience”.\nReacting to the 2022 proposed budget, the Speaker Katsina House of Assembly, Hon."
  },
  {
    "headline": "Iniubong Umoren: Jobseeker’s friend, elder sister testify in court",
    "summarized_story": "Uduak Umoh, the best friend to murdered Akwa Ibom job seeker, Iniubong Umoren, and the deceased elder sister, Ifiok Umoren, have given their testimonies at the ongoing trial of Uduak Akpan, the suspected killer.\nUmoh disclosed that as soon as she made the post, that one Miriam Akpan made a comment that she was a victim of a scam job interview offered by the accused, Uduak Akpan.\nShe said Miriam accused Akpan of raping her, taking her nude pictures, and seizing her android phone with the help of his sister who is the third accused in the case.\nAfter giving her evidence, she was crossed examined and thereafter, the fourth prosecution witness and elder sister of the deceased, Ifiok Umoren in her own evidence, corroborated the testimony of the third prosecution witness.\nThe court also admitted in evidence, the photograph of the exhumed body of Iniubong Umoren as an exhibit, and the case was adjourned till Thursday (tomorrow) to take the evidence of the pathologist."
  },
  {
    "headline": "Govs, Sirika, Lawan, others present as Dangote’s brother is buried in Kano",
    "summarized_story": "The Vice-Chairman of the Dangote Group of Companies, also the younger brother of Africa’s richest man, Aliko Dangote, was buried at the Dantata famous family graveyard, Koki City Center, Kano.\n“We received the information about the passing away of this gentleman Alhaji Sani Dangote with shock.\nKano State, our dear country Nigeria and the business community have lost an illustrious son.\n“But to all of us particularly those from Kano State, we lost a rare gem in the business community.\nAlso present at the burial were his brother, Aliko Dangote, Bukola Saraki, Garba Shehu and Babagana Zulum."
  },
  {
    "headline": "Lekki tollgate massacre: NBA reacts to Lagos Judicial Panel report",
    "summarized_story": "The Benin branch of the Nigerian Bar Association on Wednesday commended the Lagos State Judicial Panel on EndSARS for its timely report after the inquiry into the 2020 protests.\nRecall the Lagos State Judicial Panel on EndSARS submitted its report to the Lagos State Government on Nov. 15.\n“The NBA Benin Bar welcomes the report of the Lagos State Judicial Panel of Inquiry on restitution for victims of SARS-related abuses and other matters.\n“The Lagos panel has made far-reaching findings and recommendations which enjoy wide acceptance.\n“We hope also that the content of the Lagos report would serve as a lesson to all,’’ it stated."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Experts recommend 10,000 steps daily to prevent diabetes, hypertension",
    "summarized_story": "Experts have advised Nigerians to engage in consistent physical activities as it helps to prevent hypertension, diabetes and cancer.\nThey spoke at a media conference organised by pharmaceutical company, Mega Lifesciences, in line with this year’s World Diabetes Day in Lagos.\nThe don advised Nigerians to be more active, keep slim and fit as a way to remain healthy.\nFasanmade said: “We should make about 10,000 steps per day to keep hypertension, diabetes and cancer away.\nHe listed some of the symptoms of the condition to include passing “plenty” of urine, poor vision, poor erection, poor stamina, poor obstetric history including miscarriages and stillbirth, and itching on the skin."
  },
  {
    "headline": "Kano, institute partner on animal feed production",
    "summarized_story": "The Kano State Agro-Pastoral Development Project (KSADP) has signed an agreement with the Nigerian Institute of Animal Science (NIAS) for pasture production in the state.\nShortly after signing the agreement in Kano, the State Project Coordinator of KSADP Malam Ibrahim Garba Muhammad revealed that, as part of the agreement, the project has allocated four hectares of land to NIAS, at Kadawa, Garun Mallam Local Government Area, for pasture production.\nThe Registrar, who is the Chief Executive Officer (CEO) of the Nigerian Institute of Animal Science, Prof. Eustace Ayemere Iyayi, said the endeavour would help in meeting the increasing demand for fodder.\nProf. Iyayi explained that the institute would use irrigation and rain-fed pasture production techniques to develop the four hectares it received.\nManaging Director of Kano State Agricultural and Rural Development Agency’s (KSADP’s) executing agency, Dr Junaidu Yakubu Muhammad, promised that the state government would create the enabling environment for a mutually rewarding and sustainable partnership with the Nigerian Institute of Animal Science."
  },
  {
    "headline": "Forum seeks probe of NSCDC boss",
    "summarized_story": "The Unified Nigerian Youth Forum (UNYF) has called on President Muhammadu Buhari to investigate allegations of corruption against the Commandant-General of the Nigerian Security and Civil Defence Corps (NSCDC), Dr Ahmed Audi.\nIts President, Comrade Abdulsalam Mohammed Kazeem said the Forum had followed activities under the current NSCDC CG which includes “unprofessional conduct, contract/job racketeering, favouritism, administrative bribe and other forms of bad leadership.”The Forum averred the administration of President Buhari has zero tolerance for all forms of corruption at any level of governance, but lamented, however, that “to our greatest surprise, the Nigerian Security and Civil Defence Corps is the corruption hub of Nigeria under the leadership of Mr Audi.\nIn less than a year of his headship, he has transferred many professional, patriotic, committed and brave commanders of the corps out of strategic position/commands and replaced them with his puppet, which lacks all the required professional qualities to occupy such sensitive positions.”UNFY said: “With the current insecurity which ranges from banditry, cattle rustling and all other forms of criminality, the NSCDC is expected to support the armed forces, the police and other security outfits in tackling crimes.”- Advertisement -The forum said should Mr President fail to act now, it will not hesitate to carry out massive protests across the country.\n“If President Buhari refuses to act by sacking Ahmed Audi as the Commandant-General of NSCDC, we will embark on nationwide protest."
  },
  {
    "headline": "Five burnt to death in tanker explosion on Lagos-Ibadan Expressway",
    "summarized_story": "From Laide Raheem, AbeokutaFive people have been confirmed dead in a petrol tanker explosion on Wednesday morning at the Ogere section of the Lagos-Ibadan Expressway.\nThe sector commander said that the suspected cause of the incident was wrongful overtaking and dangerous driving on the part of the petrol tanker driver, who collided with a moving truck, resulting in a fire outbreak.\nThe five dead victims were recovered from one of the crashed trucks and were burnt beyond recognition, Umar said.\nThe sector commander indicated that the Fire Service in Sagamu, Police Traffic Division Ogere and Gateway Police Station, Old Tollgate, Ogere had been contacted.\n‘Motorists are hereby enjoined to take alternative routes to avoid spending several hours in the traffic gridlock,’ Umar said."
  },
  {
    "headline": "EndSARS: Afenifere, CNPP, PDP, Bode George, Falana, Moghalu, Ugwummadu, Nwanguma demand action",
    "summarized_story": "On Monday, the Justice Doris Okuwobi-led panel submitted its report, stating that the armed forces shot and killed protesters at Lekki Toll Gate in Lagos last year.\n“You and I knew that people were killed at Lekki, but the Federal Government said nobody was killed.\nThe policemen who were killed by criminal elements during the protests should be honoured, notwithstanding that their family members have been compensated by the Lagos State Government.\nHowever, as police brutality has continued unabated, we call on the government to set up the Lagos State Human Rights Committee in line with the recommendation of the Panel.\nThe government has been trying to cover up what happened at the Lekki Toll Gate but the truth has come out."
  },
  {
    "headline": "Restructuring better than secession, Fayemi tells Kanu, Igboho, others",
    "summarized_story": "From Obinna Odogwu, AwkaGovernor of Ekiti State, Dr Kayode Fayemi, yesterday, appealed to separatist groups in the country to drop their agitations for secession and consider exploring the enormous benefits derivable from a united Nigeria.\nFayemi, chairman of Nigeria Governors’ Forum (NGF), said restructuring remains the best option to be explored.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nSpeaking as guest lecturer at the combined ninth and 10th combined Zik Lecture Series at the Nnamdi Azikiwe University, Awka, Anambra State, Fayemi admonished Nigerians to bury their differences in order to achieve a greater and fulfilled country.\nIn the South East and parts of South-South, the Indigenous People of Biafra (IPOB) led by Nnamdi Kanu is making case for the Biafra Republic while Sunday Adeyemo popularly known as Sunday Igboho is championing Oduduwa Republic in the South West."
  },
  {
    "headline": "Reps move to avert fresh ASUU strike",
    "summarized_story": "From Ndubuisi Orji, AbujaRivers State House of Representatives, yesterday, charged the Federal Government to immediately open ‘realistic negotiations’ with the Academic Staff Union of Universities (ASUU) to avert another round of strike.\nIt also charged government to implement the agreements reached in the interest of university students, their parents, the education sector and the country at large.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThis followed the adoption of a motion by Chairman, House Committee on Basic Education, Julius Ihonvbere, on “urgent need to do all within its powers to stop the impending ASUU strike” at plenary, yesterday.\nIhonvbere informed the House that lecturers were threatening to proceed on another strike over issues surrounding implementation of agreements."
  },
  {
    "headline": "Zik: Nigeria still grappling with poor management of diversity, differences –Jonathan",
    "summarized_story": "From Romanus Ugwu, AbujaFormer president Goodluck Jonathan has said Nigeria is still grappling with the consequences of poor management of the country’s diversity and differences.\n“An indigene of Eastern Nigeria, born in Northern Nigeria and established in Western Nigeria, Azikiwe had a cosmopolitan life experience and disposition that prepared him for his role in the society.\n“This enabled him to envision a progressive Nigeria, whose diverse tribes and tongue would blend to produce a great nation to lead the rest of Africa.\n“Recently, I addressed another forum where I delivered a paper entitled: ‘Redefining Democracy: Yearnings of the Minority in a Democratic Setting’, which dealt extensively on Nigeria’s diversity and minority rights.\nPresident General of Ohanaeze Ndigbo, George Obiozor, enumerated what Zik would have done in the present day Nigeria."
  },
  {
    "headline": "Emefiele: CBN Disbursed N3trn Loans to Firms, Households in One Year",
    "summarized_story": "He also reiterated that the monetary and fiscal authorities were working hand in hand to deliver a stronger economy to Nigerians.\nOn the recently launched “100 for 100 “, he noted that it was floated to support employment creation, assuring that the central bank would do everything possible to provide foreign exchange to import plants and machinery.\nHe added, “We know that people would like to play some games but I can assure you that the central bank has the resources to monitor.\nSo, it is left for you to respond whether there is collaboration between monetary and fiscal authority there.\nAccording to the CBN helmsman, it was high time Nigeria stopped relying on an economy that depends on oil."
  },
  {
    "headline": "#EndSARS: It’s Time for Healing, Say UN, US, as CDS Cautions against Denigrating Army",
    "summarized_story": "“I urge the government to implement the recommendations of the judicial panel of inquiry to rebuild trust and start the process of healing and reconciliation,” Kallon added.\nIt urged the Lagos State government and the federal government to take appropriate steps to address the alleged abuses.\nHe urged the Lagos State government to accelerate the issuance of the White Paper as well as the implementation of the far-reaching recommendations.\nHe assured, however, that the Nigerian Armed Forces remained committed to their professional calling of protecting the territorial integrity of the country.\n“If Nigerians don’t trust us, then we wouldn’t have been doing what we are doing and in any case, it is the armed forces of Nigeria and remember, we are not talking about the police, we are talking about the armed forces, with emphasis, armed forces, so when the armed forces are called out, it is because there is a need for the armed forces; there is no one who do not require and desire to live in peace."
  },
  {
    "headline": "NNPC Gets $1bn Boost from Afreximbank, Sees Oil at $100pb",
    "summarized_story": "In terms of the NNPC and Afreximbank deal, it was gathered that it did not involve exploration of crude oil, but mainly for trade financing and export of the crude produced by the national oil company, although details still remained sketchy last night.\nArise News Channel reported that the $1.04 billion would be repaid to the continental bank with about 25,000bpd of crude oil produced by the state oil company.\nCurrently, the global oil market has a deficit of over 600,000 bpd, a development that has led to increase in oil and gas prices and bringing along attendant inflationary pressures.\n“It’s very obvious that by the close of the year, we will get back to the 1.7 barrels to 1.8 barrels per day of crude oil.\nBut obviously, the oil industry is adjusting, people are facing new realities and of course, the focus is changing."
  },
  {
    "headline": "Video: Defence Chief Speaks, Says EndSARS Panel Report Released Through Wrong Channel",
    "summarized_story": "So, we do not at this point think that Nigerians should make disparaging remarks regarding the Armed Forces of Nigeria in the sense that we are a professional armed forces.\nBut I can assure you that the armed forces of Nigeria, we are all disciplined and we do not engage in any ignoble act.\n“Speaking further, he said if they did not enjoy the trust of Nigerians, the armed forces would not have been doing what they were doing.\nWe are not talking about the police, we are talking about the armed forces, with emphasis, the ARMED FORCES.\nSo when the armed forces are called out, it is because there is a need for the armed forces,” he added."
  },
  {
    "headline": "Emefiele: CBN Disbursed $3trn Loans to Nigerian Businesses in One Year to Cushion Impact of Covid-19",
    "summarized_story": "Emefiele also reiterated that the monetary policy and fiscal policy were working hand in hand to grow the economy.\nHe noted that with every developmental policy and initiative from the Presidency, the CBN and its fiscal counterpart, the Ministry of Finance, collaborate to achieve set goals.\nHe added that the new financial instrument, “The 100 for 100 PPP – Policy on Production and Productivity” would aid President Muhammadu Buhari’s vision to create 10 million jobs.\nAnd the Minister of Finance and I had opportunities several times to go back to brief the President.\nWe must deepen our economy so that we can truly position ourselves as a country that is self sufficient."
  },
  {
    "headline": "EXCLUSIVE: Bandits Inform Adamawa Community Of Impending Attack, Demand N30million Upfront",
    "summarized_story": "Bandits have sent threats to the Fa'a Gaya community in the Hong Local Government Area of Adamawa State demanding N30million ransom so that they would not invade and launch terror on the community.\n“Kidnappers have threatened to wipe out one village called Fa'a Gaya in Hong LGA of Adamawa State.\nWhy is it that the Nigerian government neglected its citizens and even hand them over to criminals kidnappers, bandits, Boko Haram and ISWAP terrorists?\n“Right now the leaders of Fa'a Gaya community are holding meetings because of the terrible tribulation and trauma that they are going through.\n“Until the criminals, terrorists will carry out their operation on innocent Nigerians before the security agencies start giving excuses for nothing!"
  },
  {
    "headline": "EXCLUSIVE: Bandits Inform Adamawa Community Of Impending Attack, Demand N30million Upfront",
    "summarized_story": "Bandits have sent threats to the Fa'a Gaya community in the Hong Local Government Area of Adamawa State demanding N30million ransom so that they would not invade and launch terror on the community.\n“Kidnappers have threatened to wipe out one village called Fa'a Gaya in Hong LGA of Adamawa State.\nWhy is it that the Nigerian government neglected its citizens and even hand them over to criminals kidnappers, bandits, Boko Haram and ISWAP terrorists?\n“Right now the leaders of Fa'a Gaya community are holding meetings because of the terrible tribulation and trauma that they are going through.\n“Until the criminals, terrorists will carry out their operation on innocent Nigerians before the security agencies start giving excuses for nothing!"
  },
  {
    "headline": "EXCLUSIVE: Nigeria Police Authorities Order Female Officers Married To Civilians To Vacate Barracks With Families",
    "summarized_story": "A large number of married policewomen and others married to civilians living in different barracks in Enugu State are on the verge of being homeless following an order by the police authorities directing them to vacate the facilities.\nThe signal originated from the Department of Finance and Administration in Enugu State and was addressed to all Assistant Commissioners of Police, Heads of Department and Divisional Police Officers in the state.\nThe document also asked those who sublet whole or part of their barrack accommodations to civilians to eject them or face disciplinary action.\nOne of the affected female officers, who spoke to SaharaReporters on condition of anonymity for fear of being sanctioned said she was shocked by the directive.\n“Evicting women police from the barracks just because they are married to civilians is insane and the shameful."
  },
  {
    "headline": "EXCLUSIVE: Nigeria Police Authorities Order Female Officers Married To Civilians To Vacate Barracks With Families",
    "summarized_story": "A large number of married policewomen and others married to civilians living in different barracks in Enugu State are on the verge of being homeless following an order by the police authorities directing them to vacate the facilities.\nThe signal originated from the Department of Finance and Administration in Enugu State and was addressed to all Assistant Commissioners of Police, Heads of Department and Divisional Police Officers in the state.\nThe document also asked those who sublet whole or part of their barrack accommodations to civilians to eject them or face disciplinary action.\nOne of the affected female officers, who spoke to SaharaReporters on condition of anonymity for fear of being sanctioned said she was shocked by the directive.\n“Evicting women police from the barracks just because they are married to civilians is insane and the shameful."
  },
  {
    "headline": "How India Police Detained Me With My Two Kids Without Offence — Nigerian Woman Laments",
    "summarized_story": "A Nigerian woman has cried out after she was detained alongside her two children by the police in Delhi, India.\nThe woman said on arriving at the police station, however, none of the officials told her what her offence was.\nIn the video, she lamented the alleged maltreatment she and her kids aged 3 and 2 were being subjected to by the officials.\nThe distraught woman said she told the officials that her children were complaining of hunger, they were offered Indian meals which they barely managed to eat.\nAround 11pm, my children complained of hunger and when l told them, they brought Indian meals that they could barely eat."
  },
  {
    "headline": "NBS: Plateau, Nasarawa paid above N170/L for petrol in October",
    "summarized_story": "The National Bureau of Statistics (NBS) says Plateau, Nasarawa and Abia States paid the highest amount for premium motor spirit (PMS), better known as petrol, in October 2021.\nAdvertisementThe average petrol price during the month under review is N165.60.\nThis is contained in the NBS report, titled: ‘Premium motor spirit (petrol) price watch (October 2021)’.\nMeanwhile, north-west recorded the lowest average petrol price at N164.46, followed by south-west and south-south N164.53.\nKebbi, Zamfara and Yobe had the lowest average price of diesel at N214.17, Zamfara N223.33 and Yobe N227, respectively."
  },
  {
    "headline": "NBS: Plateau, Nasarawa paid above N170/L for petrol in October",
    "summarized_story": "The National Bureau of Statistics (NBS) says Plateau, Nasarawa and Abia States paid the highest amount for premium motor spirit (PMS), better known as petrol, in October 2021.\nAdvertisementThe average petrol price during the month under review is N165.60.\nThis is contained in the NBS report, titled: ‘Premium motor spirit (petrol) price watch (October 2021)’.\nMeanwhile, north-west recorded the lowest average petrol price at N164.46, followed by south-west and south-south N164.53.\nKebbi, Zamfara and Yobe had the lowest average price of diesel at N214.17, Zamfara N223.33 and Yobe N227, respectively."
  },
  {
    "headline": "5 killed as petrol tanker explodes on Lagos-Ibadan expressway",
    "summarized_story": "Five people have been killed in a petrol tanker explosion on Lagos-Ibadan expressway in the early hours of Wednesday.\nAhmed Umar, the state sector command, said the accident happened at 4:46 am near Tunji Alegi filling station, Kwakyama area, Ogere.\nUmar said the cause of the accident could be wrong overtaking and dangerous driving on the part of the petrol tanker driver.\nHe said the petrol tanker collided with a moving truck resulting in the fire which affected at least five vehicles.\n“The FRSC wishes to inform the motoring public of the fire incident on the Lagos-Ibadan expressway which occurred in the early hours of today, involving a petrol tanker laden with premium motors spirit (PMS) around Tunji Alegi Filling Station, Kwakyama Area of Ogere,” he said."
  },
  {
    "headline": "5 killed as petrol tanker explodes on Lagos-Ibadan expressway",
    "summarized_story": "Five people have been killed in a petrol tanker explosion on Lagos-Ibadan expressway in the early hours of Wednesday.\nAhmed Umar, the state sector command, said the accident happened at 4:46 am near Tunji Alegi filling station, Kwakyama area, Ogere.\nUmar said the cause of the accident could be wrong overtaking and dangerous driving on the part of the petrol tanker driver.\nHe said the petrol tanker collided with a moving truck resulting in the fire which affected at least five vehicles.\n“The FRSC wishes to inform the motoring public of the fire incident on the Lagos-Ibadan expressway which occurred in the early hours of today, involving a petrol tanker laden with premium motors spirit (PMS) around Tunji Alegi Filling Station, Kwakyama Area of Ogere,” he said."
  },
  {
    "headline": "MURIC: Osinbajo loves Muslims -- he's not pursuing religious agenda",
    "summarized_story": "The Muslim Rights Concern (MURIC), an Islamic rights advocacy group, says Vice-President Yemi Osinbajo loves and accommodates Muslims despite being a Christian and a member of the clergy.\nAdvertisementThe group was reacting to a recent allegation accusing Osinbajo of pursuing a religious agenda by appointing and nominating mostly Christians into government.\nMURIC said the vice-president accommodates Muslims and has appointed about 18 of them into his office.\n“During our investigation, we stumbled on an article written by a female Muslim presidential aide in the VP’s office.\n“MURIC is known for raising its voice against those who oppress Muslims but we do not wish to be known for remaining silent when we see Christians who accommodate Muslims."
  },
  {
    "headline": "Jumia records all-time high quarterly orders and unveils its fintech ambition",
    "summarized_story": "Sales and advertising expenses reached $24.0 million, up 228% year-over-year, while technology and content expenses increased by 27% to $9.4 million.\nHistoric number of quarterly ordersA major highlight from the report was that orders made on Jumia reached an all-time quarterly high of 8.5 million, representing a 28% year-over-year growth.\nClosely related to that, Jumia’s annual active consumers reached 7.3 million and its gross merchandise value (GMV) reached $238 million, both up 8% year-over-year.\nJumiaPay and its fintech ambitionIn the second quarter, JumiaPay—Jumia’s financial and digital services—posted its largest-ever quarterly GMV processed.\nSource: JumiaLogistics servicesFor its logistics service to third parties, Jumia reached a major milestone by recording $1 million revenue from this service."
  },
  {
    "headline": "Shuttlers raises $1.6 million to expand to Nigerian cities",
    "summarized_story": "Shuttlers, a logistics startup out of Lagos, Nigeria, has raised $1.6 million in seed funding to expand into African countries.\nWith its new raise, Shuttlers intends to try its wheels in more Nigerian cities before expanding beyond the borders of the country into other African countries.\nShuttling Lagos’ transportation systemIn 2016, Damilola Olokesusi founded Shuttlers to tackle the inefficient transportation system in Lagos, Africa’s most populous city.\nWith over 100 buses and 300 bus stops in Lagos, Shuttlers also claims to have recorded over 2 million trips since its inception in 2013.\n“Our mission at Shuttlers is to transform the way people commute around the world, by building a global partner network and connecting communities of shuttlers like we are presently doing in Lagos, Nigeria."
  },
  {
    "headline": "Sangu Delle is building a “tech-forward healthcare system” across Africa",
    "summarized_story": "This week, Africa Health Holdings, a healthcare startup that operates 40 medical facilities across three countries in Africa, said it has secured $18 million Series A funding.\nAfrica Health Holdings plans to deploy the funds towards building its “tech-forward healthcare system” across the continent.\nIn 2017, Delle took his learnings from all the healthcare investments he lead at GPI and founded Africa Health Holdings.\nSangu Delle, founder and CEO of Africa Health Holdings.\nThe next global healthcare frontierOn Monday, Nigeria-based DrugStoc also announced a $4.4 million Series A fundraising round, led by Africa HealthCare Master Fund, with participation from Vested World and German Development Bank."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "Led by ex-OPay, Kuda exec, Kredi Money wants to be the one-stop-shop for payments, loans, insurance, other financial services",
    "summarized_story": "Consequently, looking at Nigeria’s financial services space will reveal several startups with diverse financial use cases.\nBut for the founders of digital banking startup, Kredi Money, financial services consumers could receive a better experience.\nKredi money was pretty much the brainchild of their combined experiences in the market.\nFrom Left to Right: Samuel Orji, Co-founder Kredi Money, and Afolabi Abimbola, CEO of Kredi Money.\nAbimbola reveals that he wanted to lay the groundwork for a financial services company, before approaching institutional investors."
  },
  {
    "headline": "Techpoint Build 2021, meme coins, Shuttlers’ seed funding, DrugStoc’s Series A, Nigeria’s housing deficit",
    "summarized_story": "All you need to know about meme coinsWith cryptocurrency minting new millionaires, there has been a rise in meme coins.\nMeme coins are crypto tokens inspired by social media trends, jokes, or movies.\nAside from original gangster (OG) meme coins, most meme coins have no use case backing them, which makes trading in them a risky venture.\nFor the latest instalment of Crypto Explorer, our Reporter, Bolu Abiodun, goes into detail about meme coins.\nSource: SuppliedNigerian mobility startup, Shuttlers has raised $1.6 million in seed funding."
  },
  {
    "headline": "Wakanda Inu: What meme tokens are and why you should care",
    "summarized_story": "In fact, the first African themed meme coin, Wakanda Inu, has just been launched.\nAlthough there are hundreds of meme coins, those referred to as OG (original gangster) meme coins are the most popular with the highest market capitalisation.\nInterestingly there’s now an African-themed meme coin — Wakanda Inu — made to create wealth for Africans.\nFor example, the new African-themed meme token — Wakanda Inu — named after a fictional African city — Wakanda — in the movie the Black Panther is on the rise and rallying strongly.\nThe African meme token — Wakanda InuWakanda Inu home pageAccording to the token’s whitepaper, “Wakanda Inu is a community meme project forged from the deep and warm consciousness of humanity.”It says it is “a decentralized meme token to drive growth in the industry, decentralized finance-oriented activities across the world."
  },
  {
    "headline": "Pension funds embrace stocks as bond yields decline",
    "summarized_story": "Nigeria’s pension funds are finding solace in domestic stocks with N874 billion investments as of September 30, 2021, amid declining bond yields, according to figures from the National Pension Commission (PenCom).\nFrom the unaudited report on pension funds industry portfolio for the period ended September 30, 2021, released by PenCom, N873.49 billion was invested in stocks, as against N846.55 billion in August 2021.\nThey note that the pension industry’s exposure to Nigerian Treasury Bills (NTBs) continues to trend downward.\nDave Uduanu, managing director/CEO, Sigma Pensions, says there is nothing fundamental in the investment figures on stocks, but a sign of recovery from COVID-19.\nWhat has happened was that, with the absence of foreign portfolio investment, any new money put in will lead to a rally in some good names (good stocks), and that could mean higher state,” he says."
  },
  {
    "headline": "Ibom Air to spend N138bn on 10 new A220 planes",
    "summarized_story": "At the cost of about N138 billion, Ibom Air, indigenous airline of Akwa Ibom State, on Monday placed an order for 10 A220 aircraft with Airbus, at the ongoing Dubai Air show, taking place in Dubai.\nWorking in collaboration with the Airbus team, Ibom Air took an innovative approach to making the choice of the A220.\nWith the purchase agreement signed, deliveries of the aircraft to Ibom Air will commence in the first quarter of 2023.\nThis implies that Nigeria’s Ibom Air may be purchasing these aircraft at the cost of $33.5 million or slightly lower.\nIbom Air started by wet-leasing two A220s for a year, to test the suitability of the aircraft for their needs."
  },
  {
    "headline": "#EndSARS: Panel report resonates with Nigerians",
    "summarized_story": "Nigerians said yesterday that the judicial panel report on the Lekki Toll Gate #EndSARS protest resonates with them, as youths say the findings of the report vindicate them.\nI am just glad that this report has confirmed that it did happen and it will go on record,” Emmanuel said.\nRead Also: Key points from the #EndSARS Lagos State panel of inquiry reportBut the aftermath of that led to a shooting on October 20, which ultimately crushed the #EndSARS campaign.\nThe manner of assault and killing could in context be described as a massacre,” the report stated.\nThere was also an attempt to cover up the incident by the cleaning of the Lekki Toll Gate and the failure to preserve the scene ahead of potential investigations,” the report highlighted."
  },
  {
    "headline": "YULETIDE: Group Raises Alarm over plans to Sabotage Fuel Supply across Nigeria – Nigerian Observer",
    "summarized_story": "The group which raised the alarm in a press statement issued on Sunday in Abuja and signed by its National Coordinator, Mallam Sabiu Abdullahi expressed worries over what it described as “ the desperation by some saboteurs “to make millions by creating artificial scarcity of petroleum product in the Ember months”.\nIn words of the group: “Our independent investigations have confirmed that currently, Nigeria has 90million litres of petroleum that is being hoarded by marketers as a means of making easy money in the Ember months”.\nSabiu, in the statement, called on the NNPC and security agencies to swing into action by ensuing that the evil plots of the saboteurs are thwarted so that Nigerians can have uninterrupted supply of petrol and happy holidays.\nThey equally called on “patriotic Nigerians, men and women of good conscience to hold the owners of filling stations accountable and immediately inform security agents whenever they see filling station owners handing over Jerry cans of the product to suspicious black market agents”.\nThe group called on the NNPC management not to he lenient with any marketer found guilty of creating artificial scarcity to make brisk business while tormenting innocent Nigerians”..."
  },
  {
    "headline": "Obaseki vows to prosecute sexual offenders, promises justice for victims – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reaffirmed his administration’s commitment to eliminating all forms of gender-based violence across the state, reassuring that the government will not shy away from prosecuting offenders, no matter how highly placed in the society.\nComrade Philip Shaibu gave the assurance while declaring open the Edo Gender-based violence (GBV) workshop, held at the Government House in Benin City.\nThe three-day workshop is being organised by the Edo State Government in collaboration with the Nigeria Academy of Science (NAS) and Ford Foundation.\nThe training, now on its second day, with the theme, “To strengthen the evidence and response pathways for Gender-Based Violence (GBV),” is targeted at getting ultimate justice for victims of gender-based violence in Edo.\nIn a separate remark, Edo First Lady, Mrs. Betsy Obaseki said the essence of setting up the committee by Mr. President was to enable them to achieve the set mandate on issues relating to gender-based violence."
  },
  {
    "headline": "ASUU strike: Gbajabiamila invites Union and others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Speaker of the House of Representatives, Femi Gbajabiamila, has invited the Ministers of Finance and Education over the planned strike by Academic Staff Union if Universities (ASUU).\nHe made the announcement on Tuesday at the plenary while the house was debating on the need to intervene to prevent the strike.\nGbajabiamila said that he would meet with the ministers and the leadership of ASSU to resolve the disagreement between the union and government.\nThe house resolved and urged the Federal Government to urgently take all necessary measures to open a realistic negotiation with ASUU.\nThe house urged the government to stop the strike and implement the signed agreement in the interest of our students, their parents, the education sector and the country."
  },
  {
    "headline": "Obaseki urges concerted effort to address out-of-school children crisis, tasks FG on devt of basic education – Nigerian Observer",
    "summarized_story": "Obaseki gave the charge when he received the Minister of Education, Mallam Adamu Adamu; the management of Universal Basic Education Commission, and the Chairmen of State Universal Basic Education Boards (SUBEB), who were on a courtesy visit at the Government House, Benin City.\nThe governor, who expressed worry over the rising number of out-of-school children in Nigeria, called on President Muhammadu Buhari to disband Universal Basic Education Commission (UBEC) if it fails to return 50 percent of the children back to school.\nEnumerating the administration’s efforts at improving basic education in the state, Obaseki further noted: “What was the Edo miracle?\n“So, we are here to enjoy the hospitality of the good people of Edo State.\nAnd to deliberate, we are looking at enhancing accessibility and standards of basic education through technology-driven initiatives.”..."
  },
  {
    "headline": "#EndSARS group demand apology from Lagos govt, FG over Lekki ‘massacre’",
    "summarized_story": "One of the groups at the forefront of last year’s #EndSARS protest has demanded a “sincere” apology from the Lagos State Government and the Federal Government of Nigeria over the “massacre” at the Lekki toll gate on October 20, 2020, by the Nigerian army and the police.\nThe group demanded that the government at the state level must ensure that the reports of the panels across the country are finalised and made public.\nThey demanded that all persons found culpable of any illegal activity be prosecuted and compensation should be given to victims of police brutality as recommended in the report.\n“As directed by NEC, all state governments proceed to set up human rights committees to conclude with other cases and ongoing issues with the first order of business being investigated into the unlawful incarceration of #EndSARS peaceful protesters in Lagos, Abuja, Oyo and other states,” the statement read.\n“A memorial of this horrific occurrence must also be installed at the Lekki Toll Gate, to forever mark the memory of the deceased, and honour their martyrdom,” the statement read."
  },
  {
    "headline": "NGX Lists Opportunities for Diversification in Nigeria’s Capital Market",
    "summarized_story": "Nigerian Exchange Limited (NGX), has highlighted various opportunities available to investors to diversify their portfolios at its Retail Investor Workshop which held on Tuesday, 16 November 2021.\nTaking participants through the topic, Opportunities for Diversification in Nigeria’s Capital Market was the Head, Secondary Markets, NGX, Mr. Franklin Nwaubani.\nDelivering the closing remarks at the event was Head, Retail Investor Coverage, NGX, Mr. Olumide Orojimi.\nOver the years, NGX has shown relentless commitment in deepening retail participation in the capital market by organizing various investors’ education programs to equip existing and potential investors with adequate knowledge and skills to effectively manage and grow their financial resources.\nThe dynamic and user-friendly mobile app was designed to enhance investors’ participation in the Nigerian capital market."
  },
  {
    "headline": "Tanker explosion kills 5 on Lagos-Ibadan Expressway",
    "summarized_story": "A petrol tanker explosion, Wednesday morning, killed five people on Lagos-Ibadan Expressway.\nThe incident happened in the early hours of Wednesday, the Federal Road Safety Corps (FRSC) Ogun command, Ahmed Umar, confirmed the incident, in a statement.\nHe said the the accident happened at 4:46 am near Tunji Alegi filling station, Kwakyama area, Ogere, Ogun State.\nFacebook Notice for EU!\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "NNPC projects Nigeria’s crude oil production to reach 1.8m bpd in December",
    "summarized_story": "Group Managing Director of Nigerian National Petroleum Corporation (NNPC) Mallam Mele Kyari, has said the country’s crude oil and condensate output will be at 1.8 million barrels per day and is likely to overcome production issues by the end of December.\nThe NNPC GMD said this yesterday in an interview with Bloomberg.\nAccording to him, oil production would easily hit 2m barrels when condensate — a light form of oil — is included in the total.\n“It is very obvious that by the close of the year we would get back to the 1.7-1.8mbpd from crude only.\nAs you may be aware, when we mention these figures, I am talking about crude oil only,” he said."
  },
  {
    "headline": "Covid-19: How CBN disbursed N3trn loans to households, businesses in one year – Emefiele",
    "summarized_story": "BY EMEKA EJEREThe Central Bank of Nigeria (CBN) has so far distributed about $3 trillion to households, Small and Medium Scale Enterprises (SMEs), smallholder farmers, pharmaceutical companies to cushion the impact of Covid-19, the governor, Godwin Emefiele, has revealed.\n“And I can tell you this, between 2020 and now, our data shows that we have disbursed at least N2 trillion, almost N3 trillion in loans to households, to Micro, Small and Medium Enterprises, to smallholder farmers, to pharmaceuticals and health institutions.\nReiterating that the monetary policy and fiscal policy were working hand in hand to grow the economy, Emefiele noted that with every developmental policy and initiative from the Presidency, the CBN and its fiscal counterpart, the Ministry of Finance, collaborate to achieve set goals.\nHe added that the new financial instrument, “The 100 for 100 PPP – Policy on Production and Productivity” would aid President Muhammadu Buhari’s vision to create 10 million jobs.\nWe must deepen our economy so that we can truly position ourselves as a country that is self sufficient."
  },
  {
    "headline": "Ondo PDP Tackles Gov Akeredolu Over Appointment Of Son As DG",
    "summarized_story": "The Peoples Democratic Party (PDP) in Ondo State has condemned the appointment of Babajide Akeredolu, the biological son of Ondo State governor, Oluwarotimi Akeredolu, as the Director-General of Performance and Project Implementation Monitoring Unit (PPMIU) of the state government.\nThe opposition party described the appointment as a flagrant abuse of office and affront on the people of Ondo State.\nRecall that Governor Akeredolu had on Tuesday evening announced the names of 14 Commissioner-nominees and seven Special Advisers, including his son, Babajide Akeredolu.\nReacting to the appointment, PDP said such an appointment was a grand design to finally empty the treasury of the State.\nThe PDP statement added, “The name Babajide Akeredolu became known in Ondo State when the State’s funds were used to procure a marriage for him in Colorado, USA, after the same marriage was consummated in Owo, his father’s birthplace."
  },
  {
    "headline": "Ondo PDP Tackles Gov Akeredolu Over Appointment Of Son As DG",
    "summarized_story": "The Peoples Democratic Party (PDP) in Ondo State has condemned the appointment of Babajide Akeredolu, the biological son of Ondo State governor, Oluwarotimi Akeredolu, as the Director-General of Performance and Project Implementation Monitoring Unit (PPMIU) of the state government.\nThe opposition party described the appointment as a flagrant abuse of office and affront on the people of Ondo State.\nRecall that Governor Akeredolu had on Tuesday evening announced the names of 14 Commissioner-nominees and seven Special Advisers, including his son, Babajide Akeredolu.\nReacting to the appointment, PDP said such an appointment was a grand design to finally empty the treasury of the State.\nThe PDP statement added, “The name Babajide Akeredolu became known in Ondo State when the State’s funds were used to procure a marriage for him in Colorado, USA, after the same marriage was consummated in Owo, his father’s birthplace."
  },
  {
    "headline": "Ex-APC Presidential Aspirant Endorses 36-yr-old’s Aspiration For Party Chairmanship",
    "summarized_story": "A former presidential aspirant of the All Progressives Congress (APC) in the 2019 general elections and CEO of IPI Group Limited, Adamu Garba II, has hailed the aspiration of a fellow youth, Mohammed Saidu Etsu, as the youth consensus candidate for the APC national chairmanship position, saying it will be the “best decision ever.”Garba, who was a presidential aspirant during the run-up to the 2019 general elections, said he was convinced that as national chairman of APC, Etsu will unite the party and make it more formidable.\nHe said he was glad that APC was allowing youths not to only vie for elective positions but to also throw in their hats for party politics, noting that “young and fresh energies are to be given chance to go into the political space at the party level.”Garba described the aspirant as a young man of impeccable character, who will run the affairs of the party with fairness and equity.\nADVERTISEMENTHe said; “With him as the Chairman, all members of the party, particularly the youth- who are the majority can be sure of a level playing ground because the Mohammed Etsu that I know will not condone injustice.”The former APC presidential aspirant called on party leaders and members across the country to support 36 year-old Etsu to actualise his ambition, saying; “there is no better time to salvage the APC than this period that Nigerians are openly desirous of moving beyond the next level.”"
  },
  {
    "headline": "Ex-APC Presidential Aspirant Endorses 36-yr-old’s Aspiration For Party Chairmanship",
    "summarized_story": "A former presidential aspirant of the All Progressives Congress (APC) in the 2019 general elections and CEO of IPI Group Limited, Adamu Garba II, has hailed the aspiration of a fellow youth, Mohammed Saidu Etsu, as the youth consensus candidate for the APC national chairmanship position, saying it will be the “best decision ever.”Garba, who was a presidential aspirant during the run-up to the 2019 general elections, said he was convinced that as national chairman of APC, Etsu will unite the party and make it more formidable.\nHe said he was glad that APC was allowing youths not to only vie for elective positions but to also throw in their hats for party politics, noting that “young and fresh energies are to be given chance to go into the political space at the party level.”Garba described the aspirant as a young man of impeccable character, who will run the affairs of the party with fairness and equity.\nADVERTISEMENTHe said; “With him as the Chairman, all members of the party, particularly the youth- who are the majority can be sure of a level playing ground because the Mohammed Etsu that I know will not condone injustice.”The former APC presidential aspirant called on party leaders and members across the country to support 36 year-old Etsu to actualise his ambition, saying; “there is no better time to salvage the APC than this period that Nigerians are openly desirous of moving beyond the next level.”"
  },
  {
    "headline": "Nigeria’s Sovereignty Under Threat, Taraba Senator Raises Alarm",
    "summarized_story": "Senator representing Taraba South, Emmanuel Bwacha, has raised the alarm that Nigeria’s territorial sovereignty is under threat following the invasion of Manga community in Takum local government area of Taraba State by Ambazonia separatists from Southern Cameroon.\nHe said the invasion of the community by the separatists from neighbouring Cameroon led to the sack of residents of Manga village.\nAccording to the lawmaker, Manga village is 20 kilometers away from Kashimbilla Dam.\nHe, therefore, called on the Nigerian military to immediately swing into action to prevent the eventual occupation of Manga community by the foreign separatists.\nThe village also is razed down.”The Senate, thereafter, held a minute silence to honour those killed by the Ambazonia separatists from Southern Cameroon in Manga community."
  },
  {
    "headline": "Rising food prices: Group blames CBN, questions policies, threatens protest",
    "summarized_story": "A civil society group, the Nigerian Youth Initiative for Good Governance (NYIGG) has blamed the rising prices of commodities in the market on the Central Bank of Nigeria (CBN)’s monetary and fiscal policies.\nIt threatened to mobilise Nigerians to occupy the CBN headquarters if President Muhammadu Buhari failed to relieve its governor, Godwin Emefiele, of his duties within seven days.\nNYIGG Convener/National Coordinator, Adeyemi Lukman, said many Nigerians were finding it difficult to cope because of the harsh economy.\nThe increasing food prices are, in turn, the result of several factors, including the insurgency in the Northeast, herder-farmer clashes and banditry, among others, which have scared farmers off their farms.\nBut the NYIGG argued that the CBN could have done more to keep prices stable."
  },
  {
    "headline": "Rising food prices: Group blames CBN, questions policies, threatens protest",
    "summarized_story": "A civil society group, the Nigerian Youth Initiative for Good Governance (NYIGG) has blamed the rising prices of commodities in the market on the Central Bank of Nigeria (CBN)’s monetary and fiscal policies.\nIt threatened to mobilise Nigerians to occupy the CBN headquarters if President Muhammadu Buhari failed to relieve its governor, Godwin Emefiele, of his duties within seven days.\nNYIGG Convener/National Coordinator, Adeyemi Lukman, said many Nigerians were finding it difficult to cope because of the harsh economy.\nThe increasing food prices are, in turn, the result of several factors, including the insurgency in the Northeast, herder-farmer clashes and banditry, among others, which have scared farmers off their farms.\nBut the NYIGG argued that the CBN could have done more to keep prices stable."
  },
  {
    "headline": "Thursday Business Group (TBG ) set to launch Foundation at upcoming Founders day event",
    "summarized_story": "By JOHN MOMODUThursday Business Group, a foremost business and social club which consist of young professionals from diverse professions but similar business idealogies and shared values is set to host it’s 6th Founders day with the launch of its Philantropic arm, the TBG Foundation.\nIn a statement issued by the General Secretary of the club, Diran Abidakun, he stated that all is set for the clubs Founders Day event scheduled to hold on 18th of November 2021.\nSpeaking further Abidakun noted that ” the Founders Day is the most significant day in the calendar of our club and such we are marking it with all necessary pump and peagentry it deserves.\nSpeaking further on the event, Abidakun pointed that key highlight of the event will be the launch of the TBG Foundation.\nThis project will be driven through an endowment fund to develop the proposed business hub."
  },
  {
    "headline": "Thursday Business Group (TBG ) set to launch Foundation at upcoming Founders day event",
    "summarized_story": "By JOHN MOMODUThursday Business Group, a foremost business and social club which consist of young professionals from diverse professions but similar business idealogies and shared values is set to host it’s 6th Founders day with the launch of its Philantropic arm, the TBG Foundation.\nIn a statement issued by the General Secretary of the club, Diran Abidakun, he stated that all is set for the clubs Founders Day event scheduled to hold on 18th of November 2021.\nSpeaking further Abidakun noted that ” the Founders Day is the most significant day in the calendar of our club and such we are marking it with all necessary pump and peagentry it deserves.\nSpeaking further on the event, Abidakun pointed that key highlight of the event will be the launch of the TBG Foundation.\nThis project will be driven through an endowment fund to develop the proposed business hub."
  },
  {
    "headline": "All You Care About Is Tinubu – Aisha Yesufu Slams Lagos Assembly Over Lekki Massacre",
    "summarized_story": "Popular activist, Aisha Yesufu has slammed members of the Lagos State House of Assembly over their alleged indifferent attitude to the End SARS issues.\nAccording to Yesufu, a social activist, the Lagos assembly members have not done enough to show that they are with the Nigerian youths on the issues that emanated from the nationwide protest but are instead pledging allegiance to Bola Tinubu, the national leader of the All Progressives Congress, APC.\nShe said that the lawmakers have remained mute even after the Lagos State Panel of Investigation recently published a report about the Lekki Toll Gate incident.\nAisha, who was at the forefront of the EndSARS protest in October 2020, tweeted, “The thing that hurt me more than the killings at Lekki Toll Gate was how members of Lagos State House of Assembly threw #EndSars protesters under the bus and were practically swearing allegiance to Tinubu.\nAll they cared about was Tinubu.”"
  },
  {
    "headline": "Sani Dangote Buried As Influential personalities Storms Kano",
    "summarized_story": "Sani Dangote, the younger brother of Africa’s richest man who died in US on Sunday has been buried in Kano.\nHe was laid to rest at a cemetery located at No.92 Sarari quarters in Kano, on Wednesday morning.\nThe Chief Imam of Kano Emir’s palace, Sani Muhammad, led the prayer session at Kofar Kudu, Emir’s palace, Kano.\nNotable among them were Kashim shettima of Borno, former Bauchi state governor, Adamu Mu’azu, Borno state Governor, Babagana Umara Zulum, THISDAY Publisher, Nduka Obaigbena; Chairman, BUA Group, Abdussamad Isiyaka Rabiu.\nOther are Director-General, DSS, Yusuf Magaji Bichi; Senate President Ahmad Lawan; former Senate President Bukola Saraki; Governor Abdullahi Ganduje, Emir of Kano, Aminu Ado Bayero, among others."
  },
  {
    "headline": "UAG Mourns Gen. Zirkusu, 4 Soldiers",
    "summarized_story": "The Unity Advocacy Group has condoned the leadership of the Armed Forces of Nigeria over the death of General Dzarma Zirkusu and four soldiers recently killed by terrorists of the Islamic State West Africa Province (ISWAP).\nUAG in a press release on Tuesday said that the numerous sacrifices of personnel of the Armed Forces of Nigeria to keep Nigeria United cannot be quantified.\nUAG condoned the Chief of Defence Staff, Gen. LEO Irabor, the service chiefs and family of the deceased personnel.\nThe press release urged personnel of the AFN not to relent in the pursuit of the enemies of the country.\n“We are convinced that the present leadership of the Armed Forces and the personnel will ultimately win this war for us,” the group added."
  },
  {
    "headline": "Buhari Congratulates Former President Jonathan On His 64th Birthday.",
    "summarized_story": "During the visit, former President Goodluck Jonathan and President Muhammadu Buhari were present.\nOn behalf of the government and Nigerians, President Major General Muhammadu Buhari (retd.)\nwishes former President Dr. Goodluck Jonathan a happy 64th birthday on November 17, 2021.\nBuhari’s congratulatory message is contained in a statement by his Special Adviser on Media and Publicity, Femi Adesina, titled, ‘President Buhari hails Dr Goodluck Jonathan at 64’.\nAs Dr Jonathan turns 64, the President sends warm greetings to him and his family, praying that the Almighty God will continue to sustain them in good health and all-round wellbeing."
  },
  {
    "headline": "End in sight for insurgency, banditry – CAS Amao",
    "summarized_story": "Chief of Air Staff Air Marshal Isiaka Oladayo Amao has assured Nigerians that the end of insurgency and banditry is in sight.\n“In the face of challenges at hand, prudency and accountability have been the guiding principle of implementation of budgetary allocations by the Nigeria Air Force,” Amao said.\n“The Air Force and by extension the military generally, deserve commendation from Nigerians as far as war against insurgency and banditry are concerned.\nNULGEMeanwhile, the Nigeria Union of Local Government Employees (NULGE) has demanded the immediate release of 12 of her members in Zaria local government council, Kaduna state, kidnapped since November 8, 2021.\n“You see, the scenario was made worse because of the shutdown of telecommunications in Kaduna state."
  },
  {
    "headline": "Exclusive: Job racketeering sets FCSC, MDAs on edge",
    "summarized_story": "A swathe of alleged fake appointment and recruitment letters in possession of many employment seekers has compelled the setting up of service-wide verification exercise for all officers recruited by the Federal Civil Service Commission (FCSC) from 2013 to 2020.\nBut the FCSC frowned at those letters on the grounds that they did not emanate from them.\nWe are particularly concerned because cases of such fake letters are increasingly embarrassing to the commission.\nTo say the least, it’s terrible.”“We are particularly concerned that it is rampant and the culprits are mostly from the MDAs.\nThe circular FC3171/S.7/T3/101 issued on the 27th of August, 2021, directed all MDAs to carry out the exercise."
  },
  {
    "headline": "Revealed! What US told Lagos govt over #EndSARS report",
    "summarized_story": "The United States has tasked the Lagos state and federal governments on taking suitable measures to address allegations of abuses against some members of the security forces as well as the grievances of the victims of the #EndSARS protests and their families.\nThe US Mission, Tuesday, in a statement on the Lagos Judicial Panel of Inquiry Report stated: “The United States welcomes the conclusion of the Lagos State Judicial Panel of Inquiry with the transmission of its final report.\n“We look forward to the Lagos state government’s response as part of a process that represents an important mechanism of accountability regarding the #EndSARS protests and the events that took place near the Lekki Toll Gate on October 20, 2020.\nThe committee is expected to “bring forward the white paper that would be considered at the Lagos state executive council and presented as the white paper coming from the panel of inquiry.”The Nigerian Army had on October 20, 2020, shot at youths protesting police brutality at the Lekki Tollgate but has continued to deny the incident happened.\nBlueprint reports that the panel’s report named the major actors found culpable in the incident and made recommendations concerning to achieve healing and reconciliation."
  },
  {
    "headline": "Urgent Policy Action Needed To Curb COVID-19 Impact On Nigerians – World Bank Report",
    "summarized_story": "Immediate policy action is needed to curb the long-run impacts of the COVID-19 crisis on the lives and livelihoods of Nigerian households, the World Bank has said in a new report.\nThe report, “COVID-19 in Nigeria: Frontline Data and Pathways for Policy,” shows both the extent of such impacts on Nigerians and promising policy options that could accelerate the nation’s recovery.\nIt also draws on innovative sources of high-frequency data, namely, the Nigeria COVID-19 National Longitudinal Phone Survey (NLPS), to inform the choices that Nigerian leaders now face.\nThe report, the World Bank explains, shows that the consequences of the COVID-19 pandemic for human capital, livelihoods, and welfare are proving to be severe.\nHowever, the report stressed that it would be vital to keep generating fresh data that track Nigeria’s progress out of the COVID-19 pandemic."
  },
  {
    "headline": "Five Killed In Lagos/Ibadan Expressway Accident",
    "summarized_story": "Five people have been killed in an accident around Ogere area on Lagos/Ibadan expressway.\nThe accident occurred on Tuesday night after a tanker laden with Petroleum Motor Spirit spilled its contents on the highway and resulted in an explosion.\nREAD ALSO: Kogi Accident: Responders Rescue Driver, Motor-Boys Trapped In Truck Wreckage“A total of five vehicles were involved.\nFire service Sagamu, PTD Ogere, and Gateway Police Station old tollgate Ogere have been contacted,” Okpe added.\nTraffic has been diverted to avoid the secondary crash and motorists are advised to remain calm and cooperate with traffic managers."
  },
  {
    "headline": "#EndSARS Report: CDS Irabor Faults Procedure Of Release, Insists Armed Forces Are Professional",
    "summarized_story": "But I’d like to indicate that the normal procedure is to have such a report submitted to the convening authority.\n“But whatever it is currently, I’d like to indicate that the Armed Forces of Nigeria is a professional armed force.\nSo we will not at this point think that Nigerians should make disparaging remarks regarding the Armed Forces of Nigeria, in the sense that we are a professional armed forces.\n“I can assure that the Armed Forces of Nigeria are well-disciplined and we do not engage in any ignoble acts.\nSo when the Armed Forces are called out, it is because there is a need; there is no one who doesn’t desire to live in peace."
  },
  {
    "headline": "#EndSARS Report: US ‘Looks Forward’ To Response From FG, Lagos Govt",
    "summarized_story": "﻿The United States on Tuesday said it was looking forward to a response from the Lagos State Government after the Lagos State Judicial Panel of Inquiry submitted its final report.\n“The United States welcomes the conclusion of the Lagos State Judicial Panel of Inquiry with the transmission of its final report,” a statement from the US Embassy in Lagos said.\nREAD ALSO: Army ‘Killed Unarmed, Defenseless Protesters’ – Lagos Panel“We look forward to the Lagos State government’s response as part of a process that represents an important mechanism of accountability regarding the #EndSARS protests and the events that took place near the Lekki Toll Gate on October 20, 2020.\nThe Committee is expected to work for the next two weeks on the White Paper, which will be considered by the Lagos State Executive Council.\n“We will ensure that the recommendations that are coming out that will be turned into a white paper and would be made available to the public,” Governor Sanwo-Olu said on Tuesday."
  },
  {
    "headline": "Comedian ‘Cute Abiola’ Is In Our Custody – Nigerian Navy",
    "summarized_story": "The Nigerian Navy has announced that popular comedian, Cute Abiola, is in their custody and not missing.\nThe Navy in a statement signed on Wednesday by Commodore Suleman Dahun said Cute Abiola, with real name Abdulgafar A.\n“The Nigerian Navy wishes to categorically debunk this false news report currently trending online.\n“OSCOMP Abdulgafar is currently under custody in his unit for breaching the Armed Forces Social Media Policy and refusal to obey particular orders.\nThe Nigerian Navy wishes to avail itself of this incident to remind its personnel to comply with the provisions of the Armed Forces Social Media Policy in their usage of social media platforms."
  },
  {
    "headline": "Death toll in Illela attack rises to 38",
    "summarized_story": "Sources in Illela local government area of Sokoto state said more death have been recorded as a result of the bandits attack that took place in different communities of the local government area between Sunday night and Tuesday morning.\nSokoto state governor Aminu Tambuwal had earlier confirmed the killing of twelve persons in Illela local government area and three others in Goronyo local government.\nBut the source confirmed to TVCNEWS that additional twenty seven persons lost their lives in Illela alone.\nHe said the total number of persons killed by the suspected bandits in Illela is now thirty nine persons.\nAn official of Illela local government area who is not authorised to speak on the matter also confirmed this to TVC News."
  },
  {
    "headline": "Makinde charges Oyo PDP exco to reconcile members, unify party -",
    "summarized_story": "Oyo State Governor, Seyi Makinde, has charged the new executive committee of Peoples Democratic Party (PDP) in the state to reconcile all aggrieved members and unify the party’s structure ahead of the 2023 general election.\nHe said: I think by now, even the aggrieved members know where the party structure is.\nToday, the Deputy National Chairman (South) of the party is from Oyo State.\n“So, I want to promise you that everything we are supposed to work out to ensure that the party structure is well oiled and maintained, will be done.\n“As the leadership and administrator of the party in Oyo State, we must have the commitment to be fair and just to all the party members and even to those that claimed to be aggrieved."
  },
  {
    "headline": "Akeredolu Nominates 14 Commissioners, 7 Special Advisers",
    "summarized_story": "Ondo State Governor, Oluwarotimi Akeredolu,SAN, has nominated 14 new commissioners-designate and seven special advisers.\nThe commissioner nominees are as follows:i. Mrs Bamidele Ademola Olateju – Akoko South Eastii.\nOtunba Adefarati Adegboyega – Akoko South Westiii.\nChief Olayato Aribo- OseThose nominated for the position of Special Advisers include the following:i.\nIn the same vein, the governor appointed Mr. Babajide Akeredolu as the Director General, Performance and Project Implementation Monitoring Unit (PPIMU)."
  },
  {
    "headline": "Governor Sanwo-Olu commissions Onikan Multi level Car Park",
    "summarized_story": "Governor of Lagos State, Mr Babajide Sanwo-Olu has commissioned the Onikan Multi-Level Car Park & Facility building.\nThe Facility Building has 5 car parking floors with a capacity of 384 vehicles with offices for tickets and rest rooms on each floor and a 6th floor multipurpose usage which contains:– A Club House– 2 Banquet Halls with 800 capacity each– Water Treatment Plant– Elevators and staircases for smooth and easy pedestrian movement– Fire Alarm Systems– Power– CCTV systemThe Facility Building is important because of its high parking bearing capacity which is strategically situated within the heart of Onikan."
  },
  {
    "headline": "Delhi Smog: Schools and Colleges Shut as Pollution Worsens",
    "summarized_story": "Authorities in the India capital, Delhi, have shut all schools and colleges indefinitely amid the worsening levels of air pollution.\nA figure between zero and 50 is considered “good”, and between 51 and 100 is “satisfactory”, according to the the air quality index or AQI.\nThe air turns especially toxic in winter months as farmers in neighbouring states burn crop stubble.\nAnd fireworks during the festival of Diwali, which happens at the same time, only worsen the air quality.\nFollowing the hearing, a meeting was called by Delhi’s Commission for Air Quality Management and emergency measures were announced."
  },
  {
    "headline": "Canada: Deadly Storm Cuts Transport Links Around Vancouver",
    "summarized_story": "A deadly storm described by officials as a once-in-a-century weather event has severed road and rail links around Vancouver, Canada.\nThe woman’s body was found near Lillooet, about 250km (155 miles) from Vancouver, according to the Royal Canadian Mounted Police (RCMP).\nJust complete panic.”The provincial minister of transportation, Rob Fleming, told a news conference it was the “worst weather storm in a century”.\nThousands of homes in British Columbia were evacuated after an “atmospheric river” dumped the region’s monthly rainfall average in just 24 hours.\nEarlier this month, a tornado was spotted in British Columbia – the first time one has been seen in the area in five decades."
  },
  {
    "headline": "Nigeria’s Parliament Intervenes in Diplomatic Row with UAE",
    "summarized_story": "Nigeria’s Senate and the House of Representatives on Tuesday resolved to intervene in the diplomatic row between Nigeria and the United Arab Emirates (UAE) following disagreements between both countries.\nAt the Senate, the decision to wade into the dispute was reached sequel to a point of order by the Minority Leader, Senator Enyinnaya Abaribe, during plenary.\nAccording to Abaribe, Emirates airline then shut down flights to and from Nigeria owing to the disagreement between the airline and the aviation authorities on the propriety of subjecting passengers travelling from Nigeria to emergency COVID-19 protocols.\nElumelu had while moving the motion, noted that Nigeria and the UAE have had a positive diplomatic relationship and in 2009 the UAE established its embassy in Nigeria.\nThe adhoc committees were given four weeks to carry out the exercise and report back to the house."
  },
  {
    "headline": "Nigeria: PDP Will Adopt Consensus Presidential Candidate in 2023, Says Benue Governor Ortom",
    "summarized_story": "Benue State Governor, Samuel Ortom on Tuesday said the Peoples Democratic Party (PDP) would adopt consensus option for the emergence of its presidential candidate for the 2023 election.\nHe disagreed with the insinuation that the governors use the indirect primary elections to their advantage and manipulate the nomination processes.\nHe explained further, “As a governor, it is easier to manipulate the direct primary than the indirect primary.\nI am not the Lagos State governor, in Benue State, we implemented the outcome of the panel report to extent that justice is seen to have been done to all concerned.\nWe are just paying lip service and the country is going down day by day“The cabals have taken over President Buhari."
  },
  {
    "headline": "Structural Engineers Blame Collapse of Ikoyi Building on Alteration of Original Design",
    "summarized_story": "The Nigerian Institution of Structural Engineers (NIStructE) has attributed the cause of the collapsed building on Gerald Road, Ikoyi, Lagos State, on November 1, to several variations on the original design of the building that was initially planned to be six-storey, but was later increased to 21-storey.\nThe building that collapsed was initially designed for just six floors, and later to 12 floors, before this was further changed to Fifteen 15 floors.\n“The preliminary investigation also revealed some evidence of structural inadequacy in the construction and that signs of some structural distress had already started to show within certain elements of the building.\n“The Nigerian Institution of Structural Engineers (NIStructE) maintains a register of its registered members and can be consulted on any matter of structural importance or concern,” he said.\nIt further stated that the institute waited this long in order to gather verifiable information and carry out physical assessment on the collapsed building before going public with its views."
  }
]