[
  {
    "headline": "Groups differ over Osun finances, Aregbesola’s probe",
    "summarized_story": "A group, The Osun Masterminds, has asked for a probe into the finances of Osun State during the tenure of Minister of Interior, Rauf Aregbesola, as the governor of the state.\nThe group also called on the state governor, Adegboyega Oyetola, to speak about the state of the government that he inherited, saying the people deserve to know.\nHe said, “In the month ended February 2022, Osun State Government received a negative allocation of N-375million from the FAAC, out of a possible N1.45bn.\nReacting, the state Commissioner for Information, Funke Egbemode, said Oyetola’s government did not sponsor any group to attack or demand Aregbesola’s probe.\nShe said, “The Osun Masterminds is not an agency of government in Osun."
  },
  {
    "headline": "Abducted Ekiti pastor escapes, surfaces in Kwara as kidnappers sleep off",
    "summarized_story": "It was carnival like as the cleric arrived the community in the afternoon to the waiting arms of youths and the elderly who sang and danced round the town.\nAt about 10.20pm, four armed men arrived the church, saying ‘where is pastor?’ On locating me, they tied my hands and ordered me to follow them.\n“The following day, Sunday, they asked me to call my family to get N50million ransom across to them for me to regain my freedom.\n“Unfortunately for the gunmen, on Monday morning, at about 5am, the God of covenant demonstrated his awesomeness.\nI kept walking in the bush until Tuesday morning when I got to Eruku, a town in Kwara State."
  },
  {
    "headline": "Road crashes: Kano road safety decries reckless driving along Kano-Zaria-Kaduna highways",
    "summarized_story": "By Bashir Bello, KANOThe Kano State Command of the Federal Road Safety Corps, FRSC said the Kano-Zaria-Kaduna highways remains a challenging road crash spot for the command as motorists engage in reckless driving on the road which is currently undergoing rehabilitation.\nThe Sector Commander said it has deployed its personnel and equipment to the axis to ensure the safety of lives and properties on the road.\nThe Sector Commander further said that the command has succeeded in recording zero road crashes along Kano-Bauchi, Kano-Azare roads among others.\n“The command was able to mitigate the issues of crashes on effectively and efficiently along Kano – Bauchi roads, Kano – Jigawa roads which used to be black spot area of road traffic crashes.\nThe road crashes have reduced virtually to zero fatality."
  },
  {
    "headline": "2023: I’ll ensure justice prevail, rule over Nigeria if given mandate — SDP Presidential aspirant",
    "summarized_story": "The Presidential aspirant vowed that if given the mandate in 2023 he will ensure that justice prevail and rule over the land.\n“I am a 100 per cent follower of late Aminu Kano.\nI would not have been in politics today if there was no Aminu Kano.\nThe way I refer to Aminu Kano as my leader is the way he referred to Zungu as his leader.\nSo my complete political education is around the principles of the late Aminu Kano."
  },
  {
    "headline": "Breaking: Blackout persist, as power grid collapses again",
    "summarized_story": "There seem to be more challenge for Nigerians, as the power sector witnessed another electricity system collapse, forcing households, manufacturers, others into total darkness.\nThis development is coming barely 24 hours aftera total system collapse knocked off Egbin’s 600 megawatts thermal power plant in Lagos.\nAlso, Eko Electricity Distribution Company (EKEDC) also confirmed the partial collapse of the grid in a public notice.\nThey said the collapse had disrupted power supply within their networks with their customers experiencing blackouts.\n“Dear esteemed customers, we would like to inform you of another system collapse on the national grid which occurred at 5:10 p.m today (Tuesday)."
  },
  {
    "headline": "Osun PDP petitions NJC over judge’s alleged frivolous injunctions",
    "summarized_story": "Shina Abubakar, OsogboOsun State chapter of the Peoples Democratic Party, PDP, has petitioned the National Judicial Commission, NJC, requesting the probe of Justice of Osun state High Court.\nIt reads further, “It is our complaint that ignoring and non-compliance with the judgment of the Court of Appeal in Peoples Democratic Party & Ors.\nIn the instant case, the High Court of the Osun State, sitting at lle-Ife is bound by the Court of Appeal decision in Appeal No.\n“Acting with impunity in granting Ex-parte orders in Suit No HIF/36/2021 and Suit No.\n“The refusal to avail our party with records of proceeding particularly, the ruling of the Court in Suit No."
  },
  {
    "headline": "CSOs trade words over call for Aregbesola’s probe",
    "summarized_story": "The group specifically challenged Governor Adegboyega Oyetola, to speak out on the financial status of the state and begin probing of former administrations’ financial accounts.\nBut, another group, the Progressives Minded Forum, has countered the call, describing it as an attempt to discredit the former governor.\n“In the month ended February 2022, Osun State Government received a negative allocation of -375million from the FAAC, out of a possible 1.45billion.\nThis means that monthly, Osun will continue to get allocation deficits that are higher in figure than the last.\n“If the State proceeds in this manner, it will steadily progress into insolvency and eventually, total bankruptcy."
  },
  {
    "headline": "Shari’ah court decries hindrances against progress of women in Nigeria",
    "summarized_story": "Khadi of the Bauchi State Sharia Court of Appeal, Muhammad Uthman El-Mainari, has lamented that Nigeria as a male-dominated society has limited women in the country from discovering and developing their full potentials and as such relegating them to the background.\nEl-Mainari raised the concerns on Tuesday at a one-day stakeholders consultative meeting on women, peace and security in Nigeria (Phase II) organised by UN Women.\n“We need to stand up to fight for the rights of women, support them to get into positions of decision making in governance,” he declared.\nShe said concerted efforts had to be made in ensuring that every form of gender-based violence against women and girls were eliminated from society.\nShe advised that despite Nigeria being a male-dominated society, women related nongovernmental organizations (NGOs), civil society organisations (CSOs) and community-based organisations (CBOs) have to collaborate to ensure that the rights of women are adequately protected."
  },
  {
    "headline": "Blackout in Imo, four other states as EEDC reports second general system collapse in 24 hours",
    "summarized_story": "The Enugu Electricity Distribution Plc (EEDC) on Tuesday reported its second system collapse, which occurred at 5.10 pm, resulting in blackout across the entire Southeast.\nEEDC said this is coming barely 24 hours after the grid collapse experienced in the early hours of Monday, March 14, 2022.\nConfirming the development in a statement to it customers, the Head, Corporate Communications, EEDC, Emeka Ezeh, said as a result of this unfortunate development, all our outgoing feeders are out and supply to our customers in Abia, Anambra, Ebonyi, Enugu, and Imo States has been affected.\nThe statement said, “We are currently on standby, awaiting further directive from the National Control Centre (NCC) for restoration of supply.”Recall that the first EEDC general system collapse occurred on Monday, March 14, 2022 at 10:40 amEze, while confirming the development in his statement yesterday, said “EEDC wishes to inform her esteemed customers in the South East of a general system collapse which occurred on Monday, 14th March, 2022 at 10:40 am.\n“This is the reason for the loss of supply currently being experienced across the network.’’"
  },
  {
    "headline": "Why fuel scarcity persists in Rivers State despite arrival of vessel",
    "summarized_story": "The Rivers State Ministry of Energy and Natural Resources has given reasons for the persistent fuel scarcity across the state.\nThe explanation follows an earlier announcement by the ministry that a petrol laden vessel arrived at the Port Harcourt depot last week Thursday.\nBut despite the announcement, the scarcity has persisted across the state creating long vehicular queues in most filling stations.\nMedee said “mind you there has not been fuel for a long time, so they have to conduct an integrity test on the lines to check that there are no leakages.\n“So that integrity test took some time and by the weekend they succeeded in discharging."
  },
  {
    "headline": "Youths protest deplorable roads in Imo, block Owerri, Port Harcourt highway",
    "summarized_story": "Scores of travellers were on Tuesday left stranded after Ohaji/Egbema youths embarked on a protest along the Owerri- Port Harcourt road, over the deplorable state of Avu – Obosima Umunwaku road, Ada-palm- Etekwuru road in Ohaji -Egbema Local Government Areas of Imo State.\nThe irate youths blocked the highway for several hours in protest against the deplorable condition of roads in the area, leaving many commuters and motorists trapped for hours.\nThe youths were armed with placards of various inscriptions which read ”SOS Avu – Obosima Umunwaku road, Ada-palm- Etekwuru road in Ohaji -Egbema Gov Hope Uzodinma, Attention: Avu – Obosima Umunwaku road, Ada-palm- Etekwuru road in Ohaji -Egbema has become dead zone and others,The protesters expressed anger, calling for urgent intervention.\n“We have lost lives and we are losing work hours on a daily basis along Avu – Obosima Umunwaku road, Ada-palm- Etekwuru roads.\n“We want the state government to fix these state roads and we have given him a list of roads we want him to fix."
  },
  {
    "headline": "LAUTECH: We will suffer if you rename our alma mata – Alumni association tells Makinde",
    "summarized_story": "Ladoke Akintola University of Technology (LAUTECH) Ogbomoso Alumni Association has warned Governor Seyi Makinde of Oyo State against the proposed remaining of the institution.\nThe alumni association explained that thousands of graduates of the institution would suffer in their workplaces if the governor goes ahead to rename the institution.\nOur correspondent recalls that the institution was recently ceded to Oyo State after an agreement was reached with Osun State to allow the institution to be solely owned by the Oyo State Government.\nThe alumni association of the institution has, however, raised the alarm that the proposed change of the name would affect them.\n“Renaming of LAUTECH would demoralize all stakeholders (Staff, Parents, Students, Immediate community, members of Alumni Association and would return the University to zero level."
  },
  {
    "headline": "NCC: 35m Nigerians have no access to telecoms",
    "summarized_story": "The Nigerian Communications Commission (NCC) yesterday said more than 35 million Nigerians are yet to have access to telecommunications and thus lack access to digital financing.\nExecutive Vice Chairman, Nigerian Communications Commission (NCC), Prof Umar Danbatta, made this known at the headquarters of the Commission in Abuja during the World Consumers Rights Day celebration.\nAt the event with the theme:” Fair digital finance”, Danbatta said the situation denies such large numbers of citizens access to digital financial inclusion and the benefits associated with it.\n“The fact remains that more citizens will embrace the digital financial culture when they have access to telecom services in the distant, isolated, unserved, and underserved communities where they dwell.\nHe assured that broadband plans had been designed to cover the underserved areas within a number of years."
  },
  {
    "headline": "Jaiz Bank’s world of opportunities for all, says Akeredolu",
    "summarized_story": "Ondo State Governor, Arakunrin Rotimi Akeredolu, yesterday inaugurated Jaiz Bank Plc’s branch in Akure with a call on all citizens to patronise the bank irrespective of their social and religious affiliations.\nHe said the coming of the premier non-interest bank in Nigeria to Ondo would open the doors for all to enjoy non-interest financing.\n“Over the last five years, we have made efforts to bring development to the state and today we are bringing in Jaiz Bank to the state.\nHe urged civil servants in the state to transfer their salary accounts to Jaiz Bank so that they can take advantage of the bank’s mortgage facility.\nManaging Director, Jaiz Bank Plc, Mr. Hassan Usman commended the governor for his support towards the establishment of the bank in Ondo State."
  },
  {
    "headline": "High food, fuel prices push inflation to 15.70%",
    "summarized_story": "Increase in prices of food items, fuel and gas drove inflation up to 15.70 per cent with most experts predicting that higher energy and food costs would continue to drive inflation rate upward in the meantime.\nThe National Bureau of Statistics (NBS) yesterday released its latest inflation rate, indicating that the headline inflation rate rose from 15.60 per cent in January 2022 to 15.70 per cent last month.\nThis was 1.63 per cent points lower compared to 17.33 per cent recorded in February, 2021.\nThe report showed that urban inflation rate increased by 16.25 per cent in February 2022 from 17.92 per cent recorded in February 2021.\nHarry explained that the rise in food index was caused by increases in prices of bread and cereals, food product potatoes, yam and other tuber, oils and fats and fruits."
  },
  {
    "headline": "Incessant grid collapse: Evidence of moribund power sector",
    "summarized_story": "Amid rising costs of diesel, the national electricity grid collapsed again and again – almost 24 hours after warning from electricity Generation Companies (GenCos).\nThis practice, said the Association of Power Generation Companies (GenCos), Executive Secretary, Dr. Joy Ogaji, has worn out the generating plants.\nIn addition, over N1.6 trillion debt overhang for unused capacity over the years by the Nigerian Bulk Electricity Trading Company Electricity (NBET) Plc has weighed them down from optimal operation.\nGas constraints alone in Olorunsogo gas generating plant had reduced generation from the station by 104MW.\nHowever, it is now evident that the power sector condition is like that of a tattered rag whose redemption is beyond quick fix."
  },
  {
    "headline": "‘Maintain existing rotation of governorship position’",
    "summarized_story": "So, it has to start from the first zone, which is Enugu East.\n“It has been a convention that governorship position rotates among the three senatorial districts.\nI knew quite well that at that time, he had the capacity to retain the governorship position in Nkanu (Enugu East) where he comes from in 2007.\nThe question then was between Enugu West and Enugu North, which would take governorship first.\n“Myself, I had several discussions about that to the effect that I concluded that Enugu West should take it."
  },
  {
    "headline": "APC chairmanship: Mustapha picks nomination forms",
    "summarized_story": "From Romanus Ugwu, AbujaAn aspirant for the position of National Chairman of the All Progressives Congress (APC) Mallam Saliu Mustapha, on Tuesday picked up expression of Interest and nomination forms ahead of the March 26 National Convention.\nDirector General of the Saliu Mustapha Campaign Organisation (SAMCO), Balla Usman, collected the nomination forms on behalf of the former National Deputy Chairman of the Congress for Progressive Change (CPC) at the party’s national Secretariat.\nParty’s Deputy Director, Organisation Sabiu Bello handed over the two forms after receiving the mandatory N20 million from Mustapha’s representativesWhile speaking after receiving the forms at his campaign office, the chairmanship aspirant emphatically described it as a sign of his seriousness.\n“I however want to express my appreciation to President Muhammadu Buhari for paving way for what we have just done today,” he noted.\nMustapha is the first aspirant for the national chairman to collect the nomination forms."
  },
  {
    "headline": "Nweze, 18, Nigerian student emerges West Africa best overall in WASSCE",
    "summarized_story": "In the May/June 2021 WASSCE, Nweze obtained eight As.\nAnother 18-year-old Nigerian, Edeani Godswill, obtained eight As in May/June 2021 WASSCE.\nThe Vice President acknowledged the outstanding performance of the three students and urged other SS111 students to emulate the best students.\nOsinbajo said by the performance of Nweze and Edeani in the May/June 2021 WASSCE, they have done the country proud.\nOsinbajo presented the international and national awards to the best WASSCE students."
  },
  {
    "headline": "Breaking: APC begins sale of national chairmanship nomination form for N20m",
    "summarized_story": "All Progressives Congress (APC) has begun the sale of nomination forms for the national chairmanship position and each aspirant is expected to pay N20m each for each form.\nAspirants for the office of deputy national chairman will pay N10 million, while other positions in the National Working Committee (NWC) of the party will aN5 million each.\nThe sale of the forms which was supposed to have started on Monday, March 14, will close on Friday."
  },
  {
    "headline": "Ukraine: UK suspends priority visas for student, work, family applications",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United Kingdom Visas and Immigration (UKVI) has suspended temporarily, priority visas for student, work and family applications.\nThe British High Commission, Abuja, disclosed the suspension of the priority visas in a message on its Facebook page.\nThe UK Visas and Immigration disclosed that it is currently prioritising applications made under the Ukraine Family Scheme, following its launch and in response to the humanitarian crisis arising from the invasion of Ukraine.\n‘As a result, UKVI have temporarily suspended priority and super-priority services for new study, work, and family applications,” the British High Commission said.\nThe British High Commission further said customers with standard applications in study, work, and family routes may experience some delays in the processing of their application."
  },
  {
    "headline": "BREAKING: Umahi’s kinsmen protest gov’s sack",
    "summarized_story": "Chairman of Ohaozara Local Government Area,Mrs.\nNkechinyere Iyioku and the National President of Akubaraoha Youths Assembly (AYA),Mr. Mark Onu,and other stakeholders from the area led the protesters.\nThe people described the judgement as unfair, and declared their unalloyed support and solidarity to the Governor and his deputy.\nAddressing the people, Chairman of Ohaozara Local Government Area and Chairman of ALGON in the state ,Mrs Nkechinyere Iyioku, urged the appellate courts to dismiss the ruling of the Federal High Court and reinstate the Governor and his Deputy to enable them finish the numerous on going projects in the state.\nDetails later…"
  },
  {
    "headline": "Terrorists Kill DPO, 6 Others in Niger Community",
    "summarized_story": "By Laleye Dipo in MinnaThe Divisional Police Officer in Nasko Police Station in Magama local government area of Niger state, Chief Superintendent of Police Umar Dakingari, and two other policemen have been killed by terrorists.Four members of local vigilance group were also killed by the gunmen in the incident which occured Tuesday afternoon.Very reliable source told THISDAY that the gunmen attacked the policemen and local vigilantes when they were planning to counter the attack of the terrorists who infiltrated the local government headquarters after their raid on parts of Kebbi state.It was learnt that the DPO got wind of the planned assault by the gunmen and immediately started mobilising his men for the counter offensive.Unknown to the DPO, the terrorists had already surrounded the station and started shooting sporadically.It was in the process that the DPO was shot.\nHis subordinates and the men of the local vigilance group were also killed.The terrorists, according to a report, later sacked the armoury and reportedly escaped with some arms.\nThe gunmen also went on a shooting spree in the town, as people ran helter skelter.The State Police Commissioner Mr Monday Bala Kuyars, when contacted on phone, confirmed the attack and the death of the DPO.Niger state Commissioner for Local Government and Internal Security Mr Emmanuel Umar also confirmed the incident.Umar said armed security men had been sent on the trail of the terrorists.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Convention: APC National Chairmanship Form Goes for N20m",
    "summarized_story": "Adedayo Akinwale in AbujaThe All Progressives Congress (APC) has fixed the sum of N20 million for the nomination form for national chairmanship position of the party ahead of the March 26 convention.\nThe Director of Organisation, Prof. Al-Mustapha Medaner, disclosed this in a statement issued Tuesday.\nThe sale of nomination forms, which was expected to have started on Monday, March 14, will close on Friday, March 18.\nThe ruling party noted that female aspirants and physically challenged are to pay 50 per cent of the prescribed fees for each position.\nHowever, as of Tuesday, the sale of forms for the various party positions was yet to commence."
  },
  {
    "headline": "APC: After Days of Turbulence, Buni, Akpanudoedehe Bounce Back",
    "summarized_story": "Buni had travelled out of the country to Dubai for medical reasons when a faction of APC governors moved against him.\nThe Governor of Niger state, Abubakar Bello assumed the leadership of the party in acting capacity while Buni was away.\nI am the National Secretary of the party,” Akpanudoedehe had said.\nAkpanudoedehe restated the absolute loyalty of the CECPC to the APC and the leadership of the party led by President Muhammadu Buhari.\nHe also reassured members and citizens that the ruling party was stronger than ever before and poised to extend her winning streak to 2023 and beyond."
  },
  {
    "headline": "Nationwide Blackout as Power Grid Collapses Again",
    "summarized_story": "We sincerely apologise for the inconvenience.”While confirming the system collapse yesterday, Kaduna Electricity assured its customers that power would soon be restored.\n“Power supply shall be restored as soon as the National Grid is powered back.\nIn Lagos, the Egbin Power Plc also recorded a collapse in its power generating system for the second time in 2022.\nThe Egbin Power system collapse, which occurred about 10:40am, was witnessed by journalists who were at the venue to cover the 2022 edition of Egbin Graduate Engineers Programme (GEP).\nThe Minister of Power had penultimate week blamed the low water level at the dams for the worsening power supply in the country."
  },
  {
    "headline": "Convention: Micro-zoning Tearing APC Apart Amid Leadership Crisis",
    "summarized_story": "In the zoning agreement, the posts of National Chairman and Deputies of National Secretary, National Legal Adviser, National Publicity Secretary, and others were allocated to the North-central.\nThe positions of National Publicity Secretary, National Women Leader, Deputy National Treasurer, and Deputy National Welfare Secretary were zoned to South-south.\nThe South-east got the positions of Deputy National Chairman (South), National Treasurer, National Welfare Secretary, and Deputy National Organising Secretary, among others.\nNorth-east was to produce Deputy National Chairman (North), National Auditor, National Vice Chairman (North-east), Deputy National Financial Secretary, and Deputy National Women Leader.\nThe North-west zone would produce the National Vice Chairman (North-west), National Legal Adviser, National Organising Secretary, National Financial Secretary, and Deputy National Youth Leader."
  },
  {
    "headline": "2023: Desperate To Install A Stooge As Governor, Enugu Government Cabal Bribes Lawmakers With N5m Each To Endorse Zoning",
    "summarized_story": "“Besides, I don’t want to be a zonal governor, but the governor of the entire people of Enugu State,” he said.\nOne of the sources, a member of the State House of Assembly from Enugu North revealed: \"We were summoned up today (Monday) at the Majority Leader's (Hon.\nIkechukwu Ezeugwu's) house to sign a document prepared for House Members and LGA Council Chairmen of our (Enugu North) zone to the effect that there is zoning.\nAnother lawmaker who confirmed the situation said, \"Unfortunately, we thought by now all aspirants should be encouraged to table their programmes on how to end insecurity in Enugu State.\nIt was learnt that Ekweremadu is a dominant force in Enugu West and some prominent people in government, including the state governor, Ifeanyi Ugwuanyi."
  },
  {
    "headline": "2023: Desperate To Install A Stooge As Governor, Enugu Government Cabal Bribes Lawmakers With N5m Each To Endorse Zoning",
    "summarized_story": "“Besides, I don’t want to be a zonal governor, but the governor of the entire people of Enugu State,” he said.\nOne of the sources, a member of the State House of Assembly from Enugu North revealed: \"We were summoned up today (Monday) at the Majority Leader's (Hon.\nIkechukwu Ezeugwu's) house to sign a document prepared for House Members and LGA Council Chairmen of our (Enugu North) zone to the effect that there is zoning.\nAnother lawmaker who confirmed the situation said, \"Unfortunately, we thought by now all aspirants should be encouraged to table their programmes on how to end insecurity in Enugu State.\nIt was learnt that Ekweremadu is a dominant force in Enugu West and some prominent people in government, including the state governor, Ifeanyi Ugwuanyi."
  },
  {
    "headline": "Nigerian Petroleum Agency, NNPC Fails To Account For Missing 107Million Barrels Of Crude Oil — Audit Report",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC), now NNPC Limited, failed to account for about 107,239,436 barrels of crude oil lifted for domestic consumption in 2019, records from the office of the Auditor-General for the Federation (AuGF) have shown.\nAccording to the report, there were discrepancies between the amounts reported by the NNPC as transfer to the federations account and what was reported by the AuGF.\nThe AuGF said the Group Managing Director of the NNPC should be asked to explain the discrepancy between the two figures and remit the balance of N663,896,567,227.58 to the federation account or face sanctions.\nThe AuGF said the Group Managing Director of NNPC should justify non-adherence to the transfer of all federation revenue to the federation account as provided by the 1999 Constitution (as amended) and ensure that all revenue is paid into the federation account going forward.\nIt further said that a total of 239,800 barrels of crude oil valued at N5.498 billion was received in Warri and Kaduna refineries respectively between January and December 2019 with the source of the crude not validated due to the absence of source documents, while money was allegedly classified as crude oil losses without duly completed form 146 to be processed for further investigation."
  },
  {
    "headline": "Nigerian Petroleum Agency, NNPC Fails To Account For Missing 107Million Barrels Of Crude Oil — Audit Report",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC), now NNPC Limited, failed to account for about 107,239,436 barrels of crude oil lifted for domestic consumption in 2019, records from the office of the Auditor-General for the Federation (AuGF) have shown.\nAccording to the report, there were discrepancies between the amounts reported by the NNPC as transfer to the federations account and what was reported by the AuGF.\nThe AuGF said the Group Managing Director of the NNPC should be asked to explain the discrepancy between the two figures and remit the balance of N663,896,567,227.58 to the federation account or face sanctions.\nThe AuGF said the Group Managing Director of NNPC should justify non-adherence to the transfer of all federation revenue to the federation account as provided by the 1999 Constitution (as amended) and ensure that all revenue is paid into the federation account going forward.\nIt further said that a total of 239,800 barrels of crude oil valued at N5.498 billion was received in Warri and Kaduna refineries respectively between January and December 2019 with the source of the crude not validated due to the absence of source documents, while money was allegedly classified as crude oil losses without duly completed form 146 to be processed for further investigation."
  },
  {
    "headline": "Nigerian Petroleum Agency, NNPC Fails To Account For Missing 107Million Barrels Of Crude Oil — Audit Report",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC), now NNPC Limited, failed to account for about 107,239,436 barrels of crude oil lifted for domestic consumption in 2019, records from the office of the Auditor-General for the Federation (AuGF) have shown.\nAccording to the report, there were discrepancies between the amounts reported by the NNPC as transfer to the federations account and what was reported by the AuGF.\nThe AuGF said the Group Managing Director of the NNPC should be asked to explain the discrepancy between the two figures and remit the balance of N663,896,567,227.58 to the federation account or face sanctions.\nThe AuGF said the Group Managing Director of NNPC should justify non-adherence to the transfer of all federation revenue to the federation account as provided by the 1999 Constitution (as amended) and ensure that all revenue is paid into the federation account going forward.\nIt further said that a total of 239,800 barrels of crude oil valued at N5.498 billion was received in Warri and Kaduna refineries respectively between January and December 2019 with the source of the crude not validated due to the absence of source documents, while money was allegedly classified as crude oil losses without duly completed form 146 to be processed for further investigation."
  },
  {
    "headline": "Sack: Ebonyi lawmakers hold plenary despite court order, declare 3 PDP members' seats vacant",
    "summarized_story": "Some lawmakers of the Ebonyi state house of assembly participated in a plenary of the house on Tuesday, despite an order of an Abuja federal high court sacking them.\n“No court, therefore, stops us from holding plenary and we will continue to serve our people.”AdvertisementThe lawmaker added that during the plenary, the house declared the seats of three of its members vacant over their “resignation”.\nFrancis Nwifuru, speaker of the assembly and one of the lawmakers sacked by the court, was said to have presided over the plenary.\nMeanwhile, Aleke, whose seat was declared vacant, had denied his resignation.\nAdvertisement“Above all, such plenary was illegal as a competent court had already declared the seats of those who held it vacant.”"
  },
  {
    "headline": "Sack: Ebonyi lawmakers hold plenary despite court order, declare 3 PDP members' seats vacant",
    "summarized_story": "Some lawmakers of the Ebonyi state house of assembly participated in a plenary of the house on Tuesday, despite an order of an Abuja federal high court sacking them.\n“No court, therefore, stops us from holding plenary and we will continue to serve our people.”AdvertisementThe lawmaker added that during the plenary, the house declared the seats of three of its members vacant over their “resignation”.\nFrancis Nwifuru, speaker of the assembly and one of the lawmakers sacked by the court, was said to have presided over the plenary.\nMeanwhile, Aleke, whose seat was declared vacant, had denied his resignation.\nAdvertisement“Above all, such plenary was illegal as a competent court had already declared the seats of those who held it vacant.”"
  },
  {
    "headline": "Again, national power grid collapses -- second time in 48 hours",
    "summarized_story": "The national electricity grid suffered a system collapse on Tuesday — the second incident within two days.\nThe grid had collapsed on Monday at 10:40am leading to power outage across the country.\nIn a message to its customers, Ikeja Electric said the grid collapsed at about 5:10pm on Tuesday.\nAdvertisement“This is coming barely 24 hours after the grid collapse experienced in the early hours of yesterday, Monday, 14th March, 2022.\nAdvertisementMeanwhile, the grid has experienced disruptions in recent months — it collapsed in February, May, July and August 2021."
  },
  {
    "headline": "Again, national power grid collapses -- second time in 48 hours",
    "summarized_story": "The national electricity grid suffered a system collapse on Tuesday — the second incident within two days.\nThe grid had collapsed on Monday at 10:40am leading to power outage across the country.\nIn a message to its customers, Ikeja Electric said the grid collapsed at about 5:10pm on Tuesday.\nAdvertisement“This is coming barely 24 hours after the grid collapse experienced in the early hours of yesterday, Monday, 14th March, 2022.\nAdvertisementMeanwhile, the grid has experienced disruptions in recent months — it collapsed in February, May, July and August 2021."
  },
  {
    "headline": "Falana on Umahi's sack: Votes belong to political parties — NOT candidates",
    "summarized_story": "Femi Falana, a senior advocate of Nigeria (SAN), says votes cast in any election in the country belong to the political parties, not candidates.\n“Whereas in the 2019 governorship election in Ebonyi State, the PDP garnered 393,343 votes across the 13 local governments areas of the state, its closest challenger, the APC, got 81,703 votes.\nAdvertisement“The court added that all political parties with the second highest votes in the elections and the required spread, are elected to the various elections.\n“We wish to submit, without any fear of contradiction, that elections are won by political parties and not by candidates.\nsection 221) effectually removes the possibility of independent candidacy in our elections; and places emphasis and responsibility in elections on political parties."
  },
  {
    "headline": "This online art marketplace is African artists’ road to Hollywood and beyond",
    "summarized_story": "But then, ArtDey, an African online art marketplace, offered to help him sell them, for prices ranging from ₦50,000 to ₦150,000.\nArtDey—co-founded in 2020 by Chioma Onyenwe, a 33-year-old filmmaker, and her siblings: Emeka Onyenwe and Adaobi Onyenwe—is an online marketplace that connects contemporary African artists to a global audience.\nOnyenwe, who has been collecting African art since 2015, went to collect art in an art market in Kenya in March 2020 but found she could afford only 1 of the 2 paintings she liked.\nThese markets were tourist attractions, but air travel restrictions, because of COVID, had shrunk their sale of art pieces.\nNigerians, she noticed, are not used to standard-sized measurements which are important to selecting art pieces’ sizes."
  },
  {
    "headline": "South African regulator accuses Meta of anti-competitive behaviour",
    "summarized_story": "South Africa’s Competition Commission has referred Meta-owned Facebook and WhatsApp to a tribunal for allegedly abusing its dominant position in the market.\nThis happened after Meta restricted GovChat—a startup that connects government and citizens—and its subsidiary #Lets Talk’s access to data on its WhatsApp Business Application Programming Interface (WhatsApp Business API).\nIt also said the company had “imposed and/or selectively enforced exclusionary terms and conditions regulating access to the WhatsApp Business API, mainly restrictions on the use of data”.\n“We will continue to defend WhatsApp from abuse.”GovChat was launched in 2018 by Eldrid Jordaan for the South African government as a citizen engagement platform that uses the WhatsApp Business API to facilitate real-time communication.\nIn the US, the Federal Trade Commission and multiple states are investigating Meta’s virtual reality unit Oculus over potential anti-competitive practices."
  },
  {
    "headline": "The untold story of how ThriveAgric survived a turbulent 2020",
    "summarized_story": "He was one out of hundreds of ThriveAgric’s retail investors who hadn’t received the payments.\nThis affected ThriveAgric’s communication with its retail investors as it repeatedly failed to fulfil the promises it made to its retail investors.\nAll through this turbulent phase, the company maintains it didn’t take its retail investors for granted.\nUnexpected support and lessonsDuring the turbulent period, there was a lot of pushback from retail investors but also surprisingly a lot of support from investors, financiers, and friends.\n“Essentially, I ensured that the core business operations ran smoothly and built a system to ensure that the defaulting offtakers paid,” Eje said."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Did you miss Apple’s first event of the year?\nI did, but I saw a recap and the best way to describe my reaction is..."
  },
  {
    "headline": "RavenBank Launches its Digital Banking Platform aimed at Making Banking Easy, Fast and Reliable",
    "summarized_story": "Share this article:RavenBank, a digital bank using technology to provide fast, safe, reliable and easy to use financial services to people from the comfort of their homes, officially launched its product on Wednesday, March 9, 2022.\nThe digital bank started with 5,000 users and has been in operations since March 2021.\nApart from providing fast banking services(bills payment, transfers, deposits), RavenBank also offers overdraft services for small businesses.\nRavenBank has sights on working with small businesses bank and making it easy for these businesses to access loans.\nRavenBank is a digital bank that uses technology to provide fast, safe, reliable and easy to use financial services for Africans from the comfort of their homes."
  },
  {
    "headline": "$105 million to Moove across emerging markets",
    "summarized_story": "These days, a typical week has at least one startup announcing over $100 million.\nWe’re discussing financial services for supply chain SMEs, vehicle financing by Moove, and salary-on-demand.\nLooking at Pivo, a startup founded by an all-female team, I would say she was right.\nYesterday, Monday, March 14, 2022, the startup announced that it had raised $105 million in a Series A2 round that brings the total funding raised by the company to $174.5 million.\nAlso, it intends to provide financing for a broader range of vehicles, including trucks, bikes, three-wheelers, and buses."
  },
  {
    "headline": "How Pivo is providing fast and reliable financial services for Africa’s supply chain businesses",
    "summarized_story": "Source: SuppliedThe duo also ran businesses together, and their experience showed them that many small businesses in the supply chain industry struggled with financing.\nFinancial services for supply chain SMEsPivo is a financial services provider targeted at SMEs in Africa’s supply chain sector.\nThe decision to focus on businesses in the supply chain sector comes from the founders’ expertise working in the industry and an understanding that there’s a supply chain segment to most sectors of the African economy.\nIt plans to offer every financial service that a supply chain business needs, including inventory financing, corporate account services, asset financing, etc.\nThe startup has three core products – Pivo Capital, Pivo Finance, and Pivo Plus."
  },
  {
    "headline": "National grid collapses again",
    "summarized_story": "Nigeria’s national electricity power grid collapsed Tuesday.\nThe collapse 5:10pm was confirmed in a text message sent to customers by the Eko Electricity Distribution Company.\n“Dear Esteemed Customer, please be informed of another system collapse on the National grid which occurred at 5:10 pm today.\nWe are monitoring the situation and will continue to provide updates.\nOnce again we apologize for the inconvenience,” the message read."
  },
  {
    "headline": "Nigeria’s inflation rises in February amid fuel shortages",
    "summarized_story": "Nigeria’s headline inflation rate witnessed a significant uptick as it increased by 15.70 percent in the month of February.\nHeadline inflation increased by about 0.1 percent higher than the 15.60 percent witnessed in January inflation report.\nOn a month-on-month basis, headline index increased to 1.63 percent in February 2022, this is 0.16 percent rate higher than the rate recorded in January 2022 which stood at 1.47 percent.\nFood inflation increased to 19.69% in February as against 20.09% the previous month.\nUrban inflation rate increased to 16.25 percent year-on-year in February 2022 from 17.92 percent recorded in February 2021; while Rural inflation rate increased to 15.18 percent in February 2022 compared to the 16.77 percent in February 2021."
  },
  {
    "headline": "Power outage deepening Nigerians’ woes",
    "summarized_story": "Nigerian households and businesses have been hard hit by a double whammy of a lingering fuel crisis and worsening power outage, with economic activities being crippled across vital sectors.\nCivil servants, who were seen idle in their offices, said they could not execute their tasks due to the power outage, and that activities had generally slowed down.\nAt the office of the head of civil service, it was gathered that there was a severe power outage throughout last week.\nAn official at the SERVICOM department in the ministry said, “This light situation is worse now.\nAt the time of filing this report, the power minister was convening an emergency meeting with all power sector stakeholders to find solutions to the problem."
  },
  {
    "headline": "Obaseki: Biting economic hardship threatening fight against irregular migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… Edo sets to launch Migration 2.0BENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Monday, expressed worry that the excruciating hardship resulting from the bad shape of the nation’s economy was threatening the government’s fight against human trafficking and illegal migration.\nThe governor hailed Action Aid and the European Union, among others, for partnering with his administration to checkmate and tackle the challenge of irregular migration.\nHe noted that the state has finalized plans to launch Edo Migration 2.0 to sustain gains recorded in the fight against the global menace.\nI don’t believe that our response should be the same as we did in Migration 1.0 as we may not be able to prevent irregular migration,” Obaseki added.\nThe governor continued: “Our strategy for Migration 2.0 is to work with destination countries and the federal government to look for pathways for regular migration."
  },
  {
    "headline": "ASUU extends strike by eight weeks – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Academic Staff Union of Universities (ASUU) has extended the ongoing industrial strike by eight weeks due to the inability of the Federal Government to satisfactorily address all the issues raised in the 2020 FGN/ASUU Memorandum of Action within the four-week warning strike.\nPresident of the union, Emmanuel Osodeke, made this statement known to the public, yesterday.\nThe statement reads, “NEC acknowledged the intervention efforts, in various ways, by patriots and friends of genuine national development (students, parents, journalists, trade union leaders, civil society activists etc.)\n“However, ASUU, as a union of intellectuals, has historic obligations to make governments honour agreements.\n“The roll-over strike shall commence by 12.O0 am on Monday, 14th March 2022.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Godbless, Nicholas shine in AFN AllComers athletics meet as Sabina reveals plans of Edo Sports Commission – Nigerian Observer",
    "summarized_story": "It was the first major track competition in Nigeria this season aimed at talents discovery which lasted between Saturday and Sunday in Benin.\nAlso speaking at the occasion, the Permanent Secretary, Edo State Sports Commission, Mrs Sabina Amiemenoghena Chikere said she was pleased with the performance of the athletes and the choice of Benin by AFN hosting the event.\nThat is one of our objectives here, to make Edo the sports hub, return sports activities to its prime place in Edo State.\n“There would be more competitions coming to Edo State and to be hosted by Edo State.\nEdo people should expect more sporting activities.” Sabina enthused."
  },
  {
    "headline": "Obaseki to Wike: PDP is not your personal property, Edo cannot be procured – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor has described the personal attacks by his Rivers State counterpart, Hon.\nIf Governor Wike cannot understand and adequately respond to the style and character of the Nigerian youth, how can he aspire to lead them?\n“It is therefore curious why this type of political solution is no longer tenable to resolve the political impasse in Edo State PDP.\nOn September 12, 2019, Governor Wike also threatened to cause trouble for the party over the emergence of Hon.\nEdo State cannot and will not be procured for anyone’s personal ambition."
  },
  {
    "headline": "Nigeria’s govt to use $2.2bn eurobond, borrow more to fund fuel subsidy",
    "summarized_story": "The federal government of Nigeria has said it will use $2.2 billion of the fund raised via eurobond to cater for petrol under-recovery costs.\nIn addition, the government said it would target more local borrowing in 2022 to fund subsidy payments.\nRecall that in September 2021, Nigeria raised $4 billion through eurobond issuance.\n“Rising oil prices have put us in a very precarious position, because we import refined products, and it means that our subsidy cost is increasing,” she said.\nAhmed said that the government was working with lawmakers to boost revenues and that the rise in oil prices means that borrowings will increase more than planned."
  },
  {
    "headline": "Akeredolu insists on restructuring, says states can’t continue to depend on handouts",
    "summarized_story": "Ondo State governor, Rotimi Akeredolu, has maintained that restructuring remained the only solution to the country’s developmental problems.\nThe governor argued that states and local governments could not continue to depend on handouts from the federal government to survive, as according to him, it is not sustainable.\nAkeredolu said the present federal system of government had been skewed had eroded the identities of the states of the federation.\n“The states of the federation cannot continue to depend on hand-outs from the Federal Government for even the payment of workers’ salaries.\nChief Olu Adeyemi, former Secretary-General of the Afenifere, among others, were some of the heroes of the state that were honoured."
  },
  {
    "headline": "APC pegs chairmanship forms at N20m ahead of national convention",
    "summarized_story": "The All Progressives Congress (APC), has pegged its chairmanship forms at N20 million ahead of its national convention billed for March 26.\nSimilarly, forms for deputy national chairman will sell for N10 million while zonal chairmen and other officers will pay N5 million to obtain nomination forms.\nThe APC revealed this in a circular made available on Tuesday after its 25th regular meeting which was held on March 14, 2022.\nFemale aspirants and people with disabilities will pay 50 per cent of all the aforementioned ratesFacebook Notice for EU!\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Nigeria’s inflation rises by 15.70% in February",
    "summarized_story": "Nigeria’s Consumer Price Index (CPI), which measures inflation, increased by 15.70%, highest since October 2021 when it came in at 15.99%.\nThe figure, however, means that the headline inflation rate slowed down in February when compared to the same month in the previous year.\n“On month-on-month basis, the headline index increased to 1.63 percent in February 2022, this is 0.16 percent rate higher than the rate recorded in January 2022 (1.47) percent,” the report said.\n“The urban inflation rate increased to 16.25 percent (year-on-year) in February 2022 from 17.92 percent recorded in February 2021, while the rural inflation rate increased to 15.18 percent in February 2022 from 16.77 percent in February 2021.”Last month, Simon Harry, the statistician-general of the federation, had said the fuel crisis would affect the country’s inflation rate.\nOn the month by month basis, the inflation he said also increased by 1.63%, which is 0.16% higher recorded in the month of January."
  },
  {
    "headline": "Concerns Over Police Brutality In Equatorial Guinea",
    "summarized_story": "Police brutality unfortunately ranks high in the list of things Equatorial Guinea is known for.\nA brawl occurred between a resident of this town, José Boba Bopa, and police officer Pedro Mba Mesie, who, with the collaboration of the town police Commissioner left José Boba Bopa with multiple cranial trauma, whose further consequences are still unforeseeable.\nIt all started as a verbal fight between José Boba Bopa and policeman Pedro Mba Mesie, where the Commissioner eventually intervened on policeman’s side.\nThe two carried out an arbitrary arrest against José Boba Bopa around 04:00 on the 22nd.\nThe current law prohibits all kinds of torture and inhumane treatment in Equatorial Guinea."
  },
  {
    "headline": "2023: Dattijo Declares For Kaduna Gov’ship",
    "summarized_story": "The Commissioner for Budget and Planning in Kaduna State, Muhammad Sani Abdullahi a.ka.\nDattijo, has said that his interest in the 2023 governorship election was fuelled by the desire to guarantee continuity in governance, especially in the area of evolving development in the State.\nAs even his harshest critics will accept, the period from 2015- date is the most historic development our state has witnessed since its creation.\nI am confident of my ability to sustain all that has been achieved so far and continue to Move Kaduna Forward,” he said.\nIn 2018, he was appointed by the World Bank as a member of its Expert Advisory Council on citizen engagement."
  },
  {
    "headline": "Fire Guts Warehouse, Destroys Multi-million Naira Property In Kwara",
    "summarized_story": "A warehouse located along Coca-Cola Road, Ilorin, Kwara State was on Monday gutted by fire.\nThe inferno said to have been caused by an abandoned bush burning which later spread to the storey building hosting the warehouse, destroyed multi-million naira property.\nThe spokesman of Kwara State Fire Service, Hassan Adekunle, confirmed the incident.\nHe said the fire was as a result of an abandoned bush burning in the area, which later spread to the affected warehouse.\nADVERTISEMENTAdekunle stated that the prompt intervention of men of the State Fire Service saved another store in the area from being burnt."
  },
  {
    "headline": "Federal Govt Organises Capacity Building Workshop For NGOs, VYOs",
    "summarized_story": "The Federal Ministry of Youth and Sports Development has commenced a three-day capacity building workshop for registered non-governmental organisations (NGOs) and Voluntary Youth Organiaations (VYOs) at the Public Service Institute of Nigeria (PSIN), Abuja.\nThe workshop was aimed at equipping registered NGOs and VYOs in the country with relevant skills and knowledge to operate effectively and efficiently.\n“In order to reverse this trend, the Ministry thought it wise to organise a capacity building workshop for youth NGOs and VYOs so as to critically engage genuine dialogue and chart a new course on youth development work, as well as create a synergy with the Ministry for effective implementation of the National Youth Policy and other regional and international youth development instruments.\nEarlier, the secretary general of the National Youth Council of Nigeria (NYCN), Barrister Abubakar Suleiman, commended the Ministry of Youth for organsing the workshop and urged the participating youths, NGOs and VYOs to put into practice all the knowledge that they will acquire from the three-day training exercise.\nADVERTISEMENT"
  },
  {
    "headline": "Biafra Referendum: Again, Court Adjourns Suit Till May 20",
    "summarized_story": "A Federal High Court in Abuja has adjourned till May 20, 2022 hearing on the suit filed by the Coalition of Northern Groups (CNG) seeking a referendum to determine fate of Biafra and other self-determination agitations.\nADVERTISEMENTIn his remarks, the spokesperson of CNG, Abdul-Azeez Suleiman, said the group is the plaintiff in the matter and initiated the action.\n“You can see that almost the entire nation is now out picking interest in the matter.\nIn the same vein, the Yoruba nation through the Yoruba global directorial lead counsel, Barrister Timilehin Albert, explained that people should have a right to decide where they want to be in a nation.\nReferendum, it means that the people can decide to stay together and you want to decide to stay together as a country.”"
  },
  {
    "headline": "2023: Students’ Coalition Endorses Tambuwal For President",
    "summarized_story": "The Northern States Students’ Progressive Forum has thrown its support behind Governor Aminu Waziri Tambuwal’s presidential campaign, calling him “Good for the Job.”The forum made the announcement during a public lecture and prize ceremony in Dutse, Jigawa state’s capital.\nTambuwal was also praised by Comrade Inuwa for his sympathy for the situation of Nigerian students, as well as his continued efforts to foster productive discussions between the federal government and ASUU.\nAfter critical evaluation of all the people aspiring to become Nigerian president in 2023, we concluded that, Governor Hon.\nAminu Waziri Tambuwal has a track record that makes him exceptional among all the aspirants.\n“Governor Tambuwal is honest, pragmatic, and insightful, a person who cares to listen to criticism, advice, and any good idea that will promote peace and progress in Nigeria."
  },
  {
    "headline": "BREAKING: Two feared dead as truck crushes Okada rider, passenger in Lagos",
    "summarized_story": "BREAKING: Two feared dead as truck crushes Okada rider, passenger in Lagos [Photos]*Two feared dead as truck crushes Okada rider, passenger in Lagos.\nAn accident involving a trailer and a motorcycle (Okada) has claimed the lives of two brothers at Eleganza bus stop in Lekki/Ajah road.\nSee photos of the incident below…Presently there is an ongoing protest at Eleganza/Lekki Conservative axis of the Lekki-Epe expressway following the incident.\nThe trailer has been vandalized and set ablaze, while the driver is on the run."
  },
  {
    "headline": "BREAKING: Buni Remains APC Chairman – CECPC Dismisses Sani Bello’s Takeover",
    "summarized_story": "The All Progressives Congress (APC) has declared that Yobe Governor Mai Mala Buni remains the National Chairman.\nJohn Akpan Udoedehe, Secretary APC Caretaker/Extraordinary Convention Planning Committee (CECPC) , stated this on Tuesday.\nHe said it became necessary to clarify “the events of last week”, referring to the takeover of the chairmanship seat by Niger Governor Sani Bello.\nUdoedehe insists the ruling party is crisis-free, strong and united in giving Nigeria the transformative leadership and good governance promised.\n“On the 28th day of February, 2022 the CECPC Chairman (Buni) took a long-delayed trip abroad on health grounds, leaving behind written authorisation for other members of the CECPC to continue work in his absence, particularly the day to day management of the APC."
  },
  {
    "headline": "BREAKING: Ebonyi Assembly Declares Seats Of Three PDP Members Vacant",
    "summarized_story": "Ebonyi House of Assembly has declared the seats of three members elected under the People Democratic Party (PDP) vacant.\nThis followed a letter of resignation purportedly written by the three lawmakers.\nThe three lawmakers are Ali Okechukwu (Ishielu North); Franca Okpo Abakaliki North) and Victor Aleke (Ebonyi West).\nThe three lawmakers and their PDP colleagues were not at the sitting.\nFifteen All Progressive Party (APC) lawmakers however attended the sitting."
  },
  {
    "headline": "Breaking: Atletico Madrid boot Manchester United out of UEFA Champions League",
    "summarized_story": "Champions League campaign ended in the disappointment of defeat by Atletico Madrid at Old Trafford to leave them with only a Premier League top-four place to fight for this season.\nHe saved brilliantly from Raphael Varane’s header in front of the Stretford End as United were left to fight for a place in next season’s Champions League in the final weeks of the domestic season.\nMan Utd lack class to make differenceManchester United went the same way as so many teams before them who have suffered at the hands of this remarkably durable Atletico machine assembled by Diego Simeone.\nLiverpool and Jurgen Klopp felt exactly the same after Atletico won at Anfield at this same stage two years ago and while La Liga’s champions may not be among the Champions League favourites, no-one will particularly relish being paired with them.\nThey have players who can provide class in attack and in Oblak they possess one of the world’s great goalkeepers."
  },
  {
    "headline": "FirstBank’s Verve Card Promo: Waiting on star prize winner March 30",
    "summarized_story": "First Bank of Nigeria Limited recently launched Verve Card Promo Campaign to appreciate its cardholders while growing the bank’s card adoption and usage in the country.\nFirst Bank of Nigeria Limited, Nigeria’s leading financial inclusion services provider recently unveiled Verve Card Transact and win promo campaign to reward customers on their continued usage of the card in their business transactions.\nWhat is Verve CardFirstBank Verve Card allows cardholders to conveniently pay for goods and services because it is accepted by all payment channels and bank branches connected to the Interswitch network in Nigeria.\nThe Bank’s Verve Card is powered by Interswitch, secured with chip and PIN technology.\nThe Bank’s Verve Card is powered by Interswitch, secured with chip and PIN technology."
  },
  {
    "headline": "APC crisis: Why 19 governors’ position will prevail – Ndume",
    "summarized_story": "“Various persons have shown interest in the party leadership, and the party will vote by consensus, direct or indirect.\nIn a statement Lukman released Monday in Abuja, he said starting with the March 26, 2022 APC National Convention, APC leaders, especially governors should demonstrate stronger commitment towards recruiting tested and trustworthy leaders.\nThe crucial task before APC leaders is to ensure that leadership selection process produce trustworthy leaders both as party leaders and as candidates for elections.\nAccording to Lukman, “opposition PDP leaders continue to arrogantly and contemptuously ignore this foundational reality of public trust in politics.\n“If anything, the contest for the emergence of trustworthy political leaders in APC is a contest for the unfettered development of Nigerian democracy."
  },
  {
    "headline": "Another Blackout Hits Lagos, Enugu, Others As National Grid Collapses Again",
    "summarized_story": "Electricity consumers in Lagos, Enugu, Ibadan, Anambra, and some other states have yet again been thrown into darkness after the national grid collapsed.\nIt is the second time the national grid would experience a system collapse in less than two days after an earlier fault was reported.\nThe Eko Electricity Distribution Company (EKEDC) was one of four of the Distribution Companies (DISCOs) that reported a system collapse on Monday.\nREAD ALSO: Blackout In Lagos, Abuja, Enugu, Others As National Grid Collapses“Dear esteemed customers, we would like to inform you of another system collapse on the national grid which occurred at 5:10pm today.\n“This is coming barely 24 hours after the grid collapse experienced in the early hours of yesterday, Monday, 14th March 2022."
  },
  {
    "headline": "2023 Presidency: Please Give Me Another Opportunity, Atiku Tells PDP Leaders",
    "summarized_story": "Former Vice President Atiku Abubakar has formally informed the Board of Trustees (BoT) of the Peoples Democratic Party (PDP) of his intention to run for president in the 2023 general elections.\nHe made his interest known on Tuesday during a meeting with the PDP leaders in Abuja, the Federal Capital Territory.\nAtiku, the presidential candidate of the main opposition party in the 2019 general elections, begged for another opportunity to represent the PDP in the coming poll.\n“Please join me in building bridges across this country so that every part of this country will have a sense of belonging,” he told the crowd of PDP leaders at the meeting.\nAt the end of the discussion, he took to social media to share photos of the meeting."
  },
  {
    "headline": "Fire Destroys Trucks At EFCC Exhibit Dump In Port Harcourt",
    "summarized_story": "Fire has destroyed an unconfirmed number of trucks parked at a facility of the Economic and Financial Crimes Commission (EFCC) in Port Harcourt, the Rivers State capital.\nThe incident occurred on Monday morning at an exhibit dump of the anti-graft agency located at Iriebi in Obio-Akpor Local Government Area of the state.\n“There was a fire incident at the exhibit dump of the Economic and Financial Crimes Commission, EFCC, located at Iriebi, Port Harcourt, Rivers State, on Monday, March 14, 2022,” he said.\nEkpungu who was at the facility on Tuesday said the anti-graft agency has commenced an investigation into the incident.\nThe crew members as well as the tugboat and other items were handed over to the EFCC on Monday by the Nigerian Navy Ship (NNS) Pathfinder at Rumuolumeni in Port Harcourt, Rivers State."
  },
  {
    "headline": "Buni’s Allies Return To APC Secretariat, Akpanudoedehe Insists Party Is United",
    "summarized_story": "The National Secretary of the All Progressives Congress Caretaker/Extraordinary Convention Planning Committee, James Akpanudoedehe, on Tuesday returned to the National Secretariat of the party, accompanied by allies and armed security personnel.\nAfter resuming at the secretariat, Akpanudoedehe issued a statement insisting the party remains united and strong and that Governor Buni remains in charge with the committee working to ensure the party’s National Convention holds on March 26.\nFollowing the reports that Governor Buni had been sacked as chairman of the CECPC, Governor Bello subsequently took over as the party’s acting chairman.\nMeanwhile, the party has engaged a team of senior lawyers to address a purported court order halting the planned APC National Convention.\nSIGNED:Sen. John James Akpanudoedehe Ph.DNational SecretaryAPC Caretaker/Extraordinary Convention Planning Committee15th March, 2022"
  },
  {
    "headline": "Police Warn NURTW Members Against Planned Protest In Lagos",
    "summarized_story": "Authorities of the Lagos State Police Command have warned members of the National Union of Road Transport Workers (NURTW) against any planned protest in the state.\nThe Commissioner of Police in Lagos, Abiodun Alabi, gave the warning on Tuesday, saying the police will not condone any form of protest by any group.\nAlabi gave the warning against the backdrop of an intending protest by members of the Lagos State chapter of NURTW following the crisis within the union.\nREAD ALSO: Lagos Govt Suspends NURTW From Parks, GaragesThe leadership of the National Union of Road Transport Workers Union (NURTW) had suspended the union’s chairman in Lagos, Musiliu Akinsanya, aka MC Oluomo, indefinitely.\nIn a bid to ensure the safety of residents, the Lagos State government suspended the activities of NURTW in all parks and garages across the state."
  },
  {
    "headline": "Kogi govt berates ex-PGF DG over comments against Gov Bello, Buni -",
    "summarized_story": "Lukman, over his outbursts against the state governor and the Governor Mai Mala Buni APC Caretaker Extraordinary Convention Planning Committee (CECPC).\nLukman, over his outbursts against the state governor and the Governor Mai Mala Buni APC Caretaker Extraordinary Convention Planning Committee (CECPC).\nTo the amateur politician, the unfounded allegations against the administration of Governor Yahaya Bello should sway the minds of Nigerians or party leaders.\nGovernor Yahaya Bello has only refrained from dignifying detractors with response, venom for venom, because of his sound upbringing.\nCivil servants on Grade Level 1 to 6 received 100% salary with the 30,000 minimum wage."
  },
  {
    "headline": "Ondo govt honours Fasoranti, Arogbofa, other Illustrious citizens -",
    "summarized_story": "Ondo State Governor, Rotimi Akeredolu has honored a foremost Yoruba Leader, Reuben Fasoranti, and three others for their contributions to the creation of the state forty-six years ago.\nGovernor Akeredolu urged the present crop of leaders to continue to demand good governance,"
  },
  {
    "headline": "Ebonyi Assembly declares Seats of 3 Lawmakers Vacant after alleged resignation -",
    "summarized_story": "The Ebonyi House of Assembly has declared the seats of three of its members elected under the People Democratic Party (PDP) vacant.\nThe decision was taken following a letter of resignation purportedly written by the three lawmakers.\nThe three lawmakers are Ali Okechukwu (Ishielu North); Franca Okpo Abakaliki North) and Victor Aleke (Ebonyi West).\nFifteen All Progressive Party (APC) lawmakers however attended the sitting.\nSpeaker Francis Nwifuru read the letters on the floor of the House after which he declared the seats of the three lawmakers vacant."
  },
  {
    "headline": "APC national secretary, Akpanudoedehe resumes at party secretariat -",
    "summarized_story": "The National Secretary of the Caretaker Extra-Ordinary Convention Planning Committee of the All Progressives Congress, Senator John Akpanudoedehe, at the party’s secretariat in Abuja.\nThis puts to rest the attempt to change the leadership of the All Progressives Congress by aggrieved GovernorsAkpanudoedehe was given a rousing welcome by staff of the secretariat and officials of the party who were elated to receive him back in the office after what appears to be a very short holiday.\nMr Akpanudoedehe said contrary to widespread speculations that the Chairman, Secretary or some other officials of the CECPC had been removed from Office or otherwise replaced, all actions taken in his absence were clearly identified at all times as happening in an acting or proxy capacity, and under the auspices of the substantive Chairman, Governor Mai Mala Buni of Yobe State.\nHe also disclosed that the Chairman was on his way back to Nigeria after his medical trip and would resume Office on arrival with the full support of all members and other stakeholders"
  },
  {
    "headline": "Ye Livid Over Daughter’s TikTok Video",
    "summarized_story": "Rapper Kanye West went to his Instagram page to speak against his 8-year-old Tiktok’s usage.\nHe also spoke further in the video he shared that he realises that society doesn’t respect fathers and the idea of family but as her father he doesn’t give approval."
  },
  {
    "headline": "Magnus Abe: APC Will Come Out Stronger At The Convention",
    "summarized_story": "Despite the plea by President Muhammadu Buhari to leading members of the All Progressives Congress to set aside their differences ahead of the party’s forthcoming national convention, the APC continues to be torn apart by disagreements on the way forward.\nConcerns remain that the APC has still not commenced the sale of forms to aspirants seeking to contest for the party’s elective offices, with just 11 days left to the convention.\nSimilarly, the governors of the party cannot seem to agree on micro-zoning and who to support for key elective posts of the APC.\nPolitical pundits have warned that absence of consensus on elective positions could result in a contentious convention and widen the cracks within the APC before the 2023 general election.\nTo discuss this and what the APC should be doing to forge a united front before its national convention, we are now being joined by Senator Magnus Abe, a member of the APC and the senator who represented Rivers Southeast in the National Assembly between 2011 and 2019."
  },
  {
    "headline": "“Gov. Wike is an Embodiment of PDP”- Dr. Samuel Nwanosike",
    "summarized_story": "Wike threw the first salvo at the weekend when he admonished the Deputy Governor of Edo State, Philip Shaibu, after the latter complained of lack of integration of Obaseki’s supporters into the Edo State chapter of the PDP.\nShaibu went on to warn that Obaseki and his supporters might seek alternative political platforms if they are not recognised by the PDP.\nResponding to the deputy governor’s remarks, the typically combative Wike blasted Shaibu for threatening the PDP and promised to write to the national chairman of the PDP, demanding that the party constitutes a disciplinary committee to sanction the Edo State deputy governor.\nBut in swift reaction on Monday, Governor Obaseki came to his deputy’s defence and reminded Wike that the PDP was not his personal property.\nTo explain the root cause of the slanging match between the two governors is Dr Nwanosike Samuel, Chairman of Ikwerre Local Government Area in Rivers State, and Crusoe Osagie, Special Adviser on Media to the Edo State Governor."
  },
  {
    "headline": "Abba Kyari’s Wife Slumps + Wike Vs. Obaseki’s Rift – Trending With Ojy Okpe",
    "summarized_story": "Reactions have trailed the unfortunate incident that occurred on Monday at the federal high court in Abuja when the wife of Abba Kyari the suspended deputy commissioner of police slumped in court.\nMeanwhile, the ongoing rift between the River’s state Governor Nyesom Wike and the Edo state Governor Godwin Obaseki, has taken another dimension.\nOn Monday Wike accused Obaseki of being a serial betrayer.\nFinally, Nigerians have reacted to the power outage that was experienced across the country as a result of the collapse of the national electricity grid."
  },
  {
    "headline": "Strike Action Mutinous, Nigeria Police Chief Warns Personnel",
    "summarized_story": "Following reports of an impending strike by personnnel of the Nigerian Police, the Inspector-General of Police, Mr Usman Baba, on Monday warned officers and men of the force that a strike action by a lead security agency such as the police was tantamount to mutiny.\nOnline and social media reports on Monday indicated plans by policemen to embark on a two-week warning strike fixed for March 26.\nA statement issued by Police Force Headquarters warned that any strike action or any disruption of law enforcement services would be treated as mutiny.\n“The attention of the Nigeria Police Force has been drawn to a news making the rounds on social media alleging that some members of the force will be embarking on a strike action with effect from March 26, 2022.\n“It is pertinent to restate that the Nigeria Police Force is a regimented and disciplined organisation with laid down rules and guidelines for addressing grievances and in no circumstance is a strike action one of such means."
  }
]