[
  {
    "headline": "Jandor declares Lagos gov bid, justifies defection to PDP",
    "summarized_story": "THE leader of the Lagos4Lagos Movement, Mr Olajide Adediran, popularly known as Jandor, has formally declared his interest to contest the Lagos State governorship election on the platform of the Peoples Democratic Party in 2023.\n“I said the only way we can resolve this unfair dominance in Lagos is by seizing that executive power.\nAnd it was clear to us that for us to see that power in the APC, we would first have to commit the first unpardonable sin.\n“We committed that unpardonable sin by making sure we put up a structure which they know could wrest the power away from them.\nThere are 24 ministries in Lagos State and there are over 100 parastatals, is it possible for us alone to occupy them?"
  },
  {
    "headline": "No herder settlement burnt in Southern Kaduna – Govt",
    "summarized_story": "THE Kaduna State Government has clarified that there was no herder’s settlement razed in Kurdan community in Zango-Kataf following the Sunday night’s killing of no fewer than 37 people in Agban Kagoro.\nBut on Thursday, the commissioner in another statement, recanted, saying that no settlement was burnt in the community as reported by security agencies.\nThe commissioner said, “The Kaduna State Government has received a formal complaint from Kurdan community of Zangon Kataf Local Government, stating that no settlement was burnt in the community as reported by security agencies.\n“Security agencies while confirming the oversight on Kurdan community, have already submitted pictorial and video records of locations torched by hoodlums, excluding Kurdan community.\nGen. Bernard Onyeuko, disclosed that serious operations had commenced in Southern Kaduna, assuring all that those behind the attacks would be fished out."
  },
  {
    "headline": "LASU tech hub will promote innovations –Sanwo-Olu",
    "summarized_story": "THE Lagos State Governor, Mr Babajide Sanwo-Olu, has said the proposed Lagos State University technology hub will promote creativity and innovation that will develop the state.\nSanwo-Olu disclosed this on Thursday during the 25th convocation of LASU held in the university’s auditorium, Ojo.\nHe said, “LASU technology hub is one of the various measures adopted by this administration to achieve its vision for sustainable education and technology which is the third of the six-pillar development agenda of this administration.\nThe state government has also mobilised the contractor handling the construction of the first ever LASU technology hub.\n“Availability of a befitting ultra–modern technology hub is crucial to achieving sustainable technological innovations in the West African sub region because the Sub Saharan Africa’s work age population is projected to grow by over 600 million by the year 2030."
  },
  {
    "headline": "Africa Economic Summit holds 30th March 2022",
    "summarized_story": "The Africa Economic Summit Group is bringing senior decision-makers in government and businesses from around Africa together for the 2022 edition of the Africa Economic Summit at the Four Points by Sheraton Victoria Island in Lagos, Nigeria.\nAfrica Economic Summit is a high-level assemblage of thought leaders to discuss issues and frame solutions to the economic problems affecting Africa.\nThe Africa Economic Summit also offers participants the chance to forge a path forward to necessary solutions on issues affecting the world with ambitious African leadership.\nThe current state of the world has given a rare chance to Africa to rewrite the story of Africa.\nDr Joan M. Kiema-Ngunnzi – Minister of Trade and Industrialization, Government Of Embu, Kenya and Dr Brian Reuben, the founder of Africa Economic Summit Group, the United Kingdom among other senior leaders from around Africa."
  },
  {
    "headline": "FG reiterates commitment to revitalise primary health care services",
    "summarized_story": "*Says each ward in Nigeria needs primary health care centreBy Joseph ErunkeABUJA–THE federal government, Thursday,reiterated commitment to the revitalisation of primary health care services in the country, even as it admitted that the journey towards desirable health system and outcomes is still long.\nThe governoment which said the primary health care has been neglected, with consequent negative impact on human capital development, however,said the country has “opportunities to build back better, with the goodwill and funds that have flowed into the system.”Minister of Health,Osagie Ehanire,who spoke at the 2022 Primary Health Care Summit,in Abuja,said every ward in the country needed a primary health care centre.\nHe lamented the neglect of investment in primary health centres in rural areas.\nMeanwhile, surrounding General Hospitals and Primary healthcare centers are not functional,”he said.\nThe Executive Director of the National Primary Health Care Development Agency, NPHCDA, Dr. Faisal Shuaib, speaking at the event with the theme:“Re-imagining Primary Health Care in Nigeria”, said that Nigeria has a four point PHC agenda to implement."
  },
  {
    "headline": "2023: A’Ibom NASS caucus adopts, endorse Umo Eno",
    "summarized_story": "Dirisu Yakubu, AbujaThe Akwa Ibom State Caucus in the National Assembly, on Wednesday, adopted and endorsed Pastor Umo Eno as their sole candidate for the May 21, 2023, PDP Governorship primaries and the 2023 Governorship election.\nIn Akwa Ibom State, agriculture will serve as the low hanging fruits that will create quick impact which must be explored”.\nWith your support we will make Akwa Ibom State better”, he assured.\nAddressing the gathering, the DG, Umo Eno Campaign Organisation, Amb.\nAkwa Ibom caucus has done well and would have done more if the country had a PDP government at the centre”, he noted."
  },
  {
    "headline": "Osinbajo: Nigeria facing learning crisis",
    "summarized_story": "PHOTO: Tolani AlliAs UNICEF, Microsoft,other launch Learning Passport to raise quality of educationBy Joseph ErunkeABUJA–VICE President Yemi Osinbajo, Thursday,said Nigeria was facing learning crisis, regretting that millions of children and young people were not developing even the basic skills required of them to escape poverty.\nThe platform,designed for pre-primary, primary and secondary school learning,.\nNLP, açcording to its handlers,is an online, mobile, and soon–to–be offline platform that would allow continuous access to quality education.\nThe rate of out of school children has decreased by 10% from 42% to 32%,”he said.\n“It is also an effective tool to accelerate national reforms to make quality learning opportunities available to more children, anytime, anywhere."
  },
  {
    "headline": "2023: Nigerians are tired of APC, PDP misrule, says Olayinka",
    "summarized_story": "By Luminous JannamikeAhead of the 2023, general election, the newly elected Chairman of the New Nigeria People’s Party in Ekiti State Hon.\nOlayinka Dada has issued quit notices to the All Progressives Congress and the People’s Democratic Party, saying Nigerians are tired of their misrule.\nDada described the exercise as smooth, timely and reflective of the desire of Nigerians to reject the two political parties, and chart a new direction.\nHe charged officers of the party elected at Ward, Local Government and State levels to work hard in unseating the political parties he described as predators, the people’s woes- APC and PDP.\nOnly our party, the NNPP can guarantee that hope and that begins with your election as officers of our great party."
  },
  {
    "headline": "Nobody wants to live in Nigeria anymore due to hardship, suffering – SAN",
    "summarized_story": "A Senior Advocate of Nigeria, Olumuyiwa Akinboro, has said all the critical sectors in the nation are in shambles and need a forthright, honest and result-oriented leader to fix.\nLamenting that nobody wants to live in Nigeria anymore, Akinboro said the level of hardship and economic woes across the country was alarming.\nSpeaking to journalists at the PDP National Secretariat on Thursday where the Presidential nomination form was purchased for the Governor of Sokoto State, Aminu Tambuwal, Akinboro said Nigeria needed a leader who can take it out of the woods.\n“Nobody wants to live in the country again.\nHe called for Nigerians from all walks of life to be sensitized to ensure that the right person is delivered to Nigeria as the next president."
  },
  {
    "headline": "Insecurity: Details of governors’ meeting emerge",
    "summarized_story": "The Nigeria Governors’ Forum (NGF) on Thursday expressed concern over the state of insecurity in the nation.\nThe governors, in a communiqué signed by the NGF Chairman, Gov.\nNG-CARES is an emergency programme to support state-level response to and recovery from the COVID-induced socioeconomic crisis.\nThe governors also received a briefing on the Nigerian Economy: New Perspectives, from Chief Economic Adviser to Mr. President, Dr Doyin Salami.\nIt added that after the briefing a consensus was reached by the governors to intensify economic diversification and food security initiatives including support for large scale all-season commercial farming."
  },
  {
    "headline": "Buhari’s requests will be honoured by APC governors, we’ve settled for Adamu Abdulahi – Sule",
    "summarized_story": "The party settled for former Nasarawa State Governor, Senator Abdullahi Adamu, as consensus candidate for the post of National Chairman and Senator Iyiola Omisore as the National Secretary.\nSule noted that the party was been driven towards a consensus arrangement in order to have a very peaceful convention.\nSule added that the ruling party would not do anything in violation of the Electoral Act.\n“We will not do anything whatsoever as a political party that is going to be in violation of the law because as the ruling party.\nSule noted that the total number of delegates expected at the convention would be determined by the party."
  },
  {
    "headline": "Police distribute uniforms, body armour, 253 vehicles to officers, commands",
    "summarized_story": "Nigeria Police Force (NPF) officers and commands are to get additional batches of uniforms, kits, accoutrements and body armour.\nBaba also directed that the 253 newly-procured operational and emergency vehicles be dispatched to zonal and state headquarters nationwide.\nThe vehicles to be allocated include 110 Land Cruiser Buffalo Trucks, 33 IVM Carrier Pick Up Trucks, 37 Mikano Pick Up Trucks, 20 Nord Max Pick Up Trucks.\nOthers are 18 Mikano Lorry Trucks, 5 Armoured Personnel Carriers (APCs), 3 Toyota Hiaice Ambulance Vehicles, 1 Toyota Armoured Coaster Bus.\nBaba assured of his administration’s commitment to sustain regular issuance of uniforms and continual upgrade of operational capability at all levels."
  },
  {
    "headline": "Strike action, an act of mutiny – DIG tells policemen",
    "summarized_story": "The Deputy Inspector General of Police, DIG, in charge of South-West zone, Johnson Kokumo, has urged police officers in Ondo State to jettison the idea of embarking on a strike action.\nAccording to the DIG, strike action by the policemen which is strange all over the world is tantamount to mutiny.\nKokumo stated this in Akure, the Ondo State capital on Thursday while meeting with policemen in the state during an interactive session.\nThe DIG, who assured that policemen in the country will soon smile as regards the payment of the increased salary, maintained that faceless individuals were behind the rumoured strike.\n“When you start receiving your new salary, don’t marry new wives, desist from playing gambling and avoid spending excessively on alcohol."
  },
  {
    "headline": "BREAKING: APC excludes political aides from voting at convention",
    "summarized_story": "The Caretaker Extraordinary Convention Planning Committee (CECPC) of the All Progressives Congress (APC) has excluded political office holders from voting at the national convention on Saturday.\nCECPC, in a statement on Thursday, expressly declared that “all political appointees who were elected as delegates to the National Convention slated for 26/3/2022 SHALL NOT VOTE in view of the controversy surrounding Section 84 (12) of the Electoral Act,2022.”The committee, however, stated that political appointees can still attend as observers.\nThis follows the National Assembly’s unanimous rejection of the Electoral Act Amendment Bill signed by President Muhammadu Buhari last month.\nIndications emerged on Wednesday the President and APC Governors had adopted consensus for emergence of party officials, including National Chairman."
  },
  {
    "headline": "INEC stays action on Umahi’s sack over conflicting orders",
    "summarized_story": "Reprieve may have come the way of embattled Ebonyi Governor, Dave Umahi and his Deputy Kelechi Eze, as the Independent National Electoral Commission (INEC) has stayed action over the Federal High Court judgement that sacked them from office.\nThe Commission said that it became imperative to suspend all actions on the Court judgment due to conflicting orders from various Courts of coordinate jurisdiction.\nUmahi and his Deputy were removed from office by the Court for defecting from the People’s Democratic Party (PDP), the platform on which they were elected, to the All Progressives Congress (APC).\n“Since then, the Commission has been served yet more Court Processes on the same matter, bringing the total to twelve.\n“The Commission also considers it prudent to stay action on the conflicting judgements and orders being aware of the pendency of Appeals and Motions for Stay of Execution of some of the judgements before various divisions of the Court of Appeal”."
  },
  {
    "headline": "APC Convention: Buhari hosts Tinubu, Akande, other founding fathers to dinner",
    "summarized_story": "President Muhammadu Buhari on Thursday night continued his consultations with critical stakeholders of the ruling All Progressives Congress (APC).\nHe hosted founding fathers of the party to a dinner.\nAlso in attendance were Chairman, Caretaker and Extraordinary Convention Planning Committee of the party Mai Mala Buni and Secretary to the Government of the Federation Boss Mustapha.\nThe get together, it was gathered, was hosted by the President to show appreciation to the critical stakeholders for their continued support, understanding and cooperation to his administration.\nThe engagement was also in furtherance of efforts by Buhari at ensuring a rancuor- free and successful National Convention of the party on Saturday."
  },
  {
    "headline": "Ebonyi police vow to arrest killers of 35-yr-old lady",
    "summarized_story": "The Ebonyi Police Command has vowed to arrest and prosecute the killers of a 35-years-old woman, Nnenna Onu.\nThe Police Public Relations Officer, DSP Loveth Odah, told journalists in Abakaliki on Thursday that the command would leave no stone unturned in its investigation to arrest the killers.\n“The Assistant Commissioner of Police (Investigation) will join the team to the community and ensure stakeholders’ involvement in the matter in order help to arrest the perpetrators.\nThe State Coordinator of the Commission, Mr Christopher Okorie, made the call at a news briefing in Abakaliki.\nHe further appealed to the public to report all cases of human rights violation to NHRC hotline 07060455554, police and others that are involved in human rights defence."
  },
  {
    "headline": "Appeal Court nullifies factional APC Sokoto congresses",
    "summarized_story": "The Court of Appeal sitting in Abuja has nullified various factional congresses of the All Progressives Congress (APC) conducted in Sokoto State.\nThe appellate court also voided an earlier judgment by a Federal Capital Territory (FCT) High Court in suit No.\nFCT/HC/CV/3265, which was delivered on December 16, 2021, affirming Mr Mainasara Sani’s faction as the Sokoto APC executive.\n“Federal High Court Abuja has jurisdiction only on matters arising from Abuja.\nNow that the Appeal Court has set aside the judgement of the Abuja High Court, the authentic leaders of the APC in Sokoto State will continue to exercise their duties,” Liman said."
  },
  {
    "headline": "Breaking:2023: Obi declares for president, gets endorsement from all Anambra traditional rulers",
    "summarized_story": "From Obinna Odogwu, AwkaFormer Governor of Anambra State, Mr Peter Obi, has declared his intention to contest the 2023 presidential election on the platform of the Peoples Democratic Party (PDP).\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nClick here to see how you too can get paid .\nObi made the declaration during a brief meeting with Anambra State traditional rulers held inside Government House, Awka.\nHe promised also to unify the country, restore security and ensure economic growth."
  },
  {
    "headline": "APC convention: NASS leadership meets Buhari, backs consensus arrangement",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaAhead of Saturday national convention of the All Progressives Congress (APC), principal officers of the National Assembly who are members of the party, have resolved to work towards the emergence of consensus candidates to ensure a rancor-free exercise.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nClick here to see how you too can get paid .\nHe explained that the President emphasised the need for party members to be united ahead of the exercise, adding that it was a very important convention for the party.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood."
  },
  {
    "headline": "NNPC: Buhari headship of petroleum ministry responsible for revenue leakages –PDP govs",
    "summarized_story": "From Ndubuisi Orji and Okey SampsonPeoples Democratic Party (PDP) Governors’ Forum has alleged President Muhammadu Buhari’s headship of the Ministry of Petroleum is responsible for revenue leakages in the Nigerian National Petroleum Corporation (NNPC).\nConsequently, the PDP governors called for the immediate separation of the office of the president from that of the minister of petroleum.\n“NNPC in 2021 alone claimed to have paid over N1 trillion as petroleum subsidy.\nIndeed, in March 2022, N220 billion was deducted as oil subsidy with a promise that N328 billion will be deducted in April 2022.\nFurthermore, the PDP governors noted that the All Progressives Congress (APC) does not deserve to be on the ballot for the 2023 general election."
  },
  {
    "headline": "Why APC is afraid of Nigerians -PDP",
    "summarized_story": "From Ndubuisi Orji, AbujaPeoples Democratic Party (PDP) has said it would not succumb to blackmail over its call on President Muhammadu Buhari to address the fuel crisis plaguing the country.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nIt said the Presidency’s reaction to its stance on the fuel crisis was an indication that the Federal Government did not care about the plight of the people.\nThe opposition party said it would not be deterred from fighting for the well being of Nigerians.\n“Why would the APC not be afraid of the people when it opened our nation to terrorists and bandits who it reportedly imported from neighbouring countries in 2015 to help APC muscle and rig the elections, after which APC leaders failed to honour their deal to pay the said mercenaries for the heinous ‘services’ they were contracted to provide against Nigerians by the APC?"
  },
  {
    "headline": "Days of rickety vehicles numbered in Lagos, says Sanwo-Olu",
    "summarized_story": "By Lukman OlabiyiLagos State Governor, Mr. Babajide Sanwo-Olu, yesterday, said the era of rickety vehicles and popular commercial buses known as ‘danfo’ would soon be over in the state.\nThe governor stated this at the official launch of 1, 000 brand new vehicles for the taxi scheme known as ‘Lagride’ in Ikeja.\nHe said the state was moving gradually from the era of rickety vehicles used for commercial transportation to safe modern vehicles.\nThe Lagos governor said the taxi scheme would ensure seamless transportation system for the teeming commuting populace in the state.\nThe governor called on private organisations and individuals to join hands with his government to increase the number of vehicles for the scheme."
  },
  {
    "headline": "Anyim, Mohammed, Tambuwal Pick Presidential Nomination Forms",
    "summarized_story": "Chuks Okocha in AbujaFormer Senate President and Secretary to the Government of the Federation, Anyim Pius Anyim, the Sokoto state governor, Aminu Tambuwal and his Bauchi state counterpart Bala Mohammed have picked their presidential nomination forms.\nThe Anyim presidential nomination form was paid for by over 400 support groups consisting of women, youths and professional groups.\nAlso the governor of Bauchi state, Bala Mohammed, has purchased the N40 million presidential nomination forms.\nThe Anyim groups proceeded to his campaign office in Garki to hand over the presidential nomination forms.\nComrade Samuel said that “We did not obtain the forms on behalf of Sen. Anyim, we purchased the forms for Sen. Anyim to demonstrate our unshaken confidence in his capacity and suitability to lead Nigeria at this point in our history."
  },
  {
    "headline": "Breaking: Peter Obi Joins Presidential Race, Promises to Lift Country from Poverty",
    "summarized_story": "David-Chyddy Eleke in AwkaA former Governor of Anambra State and vice-presidential candidate on the Peoples Democratic Party (PDP) in the 2019 general election, Mr.Peter Obi, has joined the 2023 presidential race.\nObi declared his intention to run for the presidency at the Anambra State Government House, during a meeting with traditional rulers of the state.\nHe said: “I am talking to the traditional rulers because if somebody begins any journey, he must first tell his fathers.\nI am telling you as my fathers that I am coming out to contest the position of the president of Nigeria.\n“I just came to seek your blessing as traditional rulers of the state."
  },
  {
    "headline": "News in Photographs: Buhari Meets N’Assembly APC Caucus",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari on Thursday afternoon met with the leadership of the ruling All Progressives Congress (APC) Caucus in the National Assembly at the State House, Abuja.\nThe meeting is the third in the series being held by the president to harmonise positions ahead of the ruling APC National Convention scheduled for Saturday in Abuja.\nSenators on the delegation included Deputy Senate President, Senator Ovie Omo-Agege; Senate Leader, Senator Abdullahi Yahaya; Deputy Senate Leader, Senator Ajayi Boroffice; Senate Chief Whip, Senator Orji Uzor Kalu; and Deputy Chief Whip, Senator Sabi Abdullahi.\nIdris Wase, Majority Leader, Hon.\nAlhassan Ado Dogowa; Chief Whip, Mohammed Tahir Monguno; and Deputy Chief Whip, Hon."
  },
  {
    "headline": "Friends Buy PDP Presidential Form for Tambuwal",
    "summarized_story": "A group, Lawyers in Nigeria, headed by Aare Olumuyiwa Akinboro, SAN, has purchased Expression of Interest and Nomination Forms for Sokoto State Governor Aminu Waziri Tambuwal to contest the 2023 Presidential Election on the platform of the Peoples Democratic Party.\nThe forms were handed over to the group by the PDP National Organising Secretary, Hon Umar Bature,“Tambuwal is someone we have all known for 30 years and nothing has changed about him.\nThat is why we are here to buy this form for him.\nHe’s not aware but we as professional and apolitical, we want him to lead,” Akinboro, who led the group to the party secretariat said,.\nAkinboro added that the group was made up of concerned Nigerians who were worried about where Nigeria was headed and wanted a patriot like Tambuwal to rescue the nation."
  },
  {
    "headline": "FG Talks Tough, Moves against Oil Thieves as Buhari Deploys Sylva, Kyari, CDS to N’Delta",
    "summarized_story": "He revealed that up to 80 per cent of oil pumped in the country, particularly in the East, is stolen.\nIn his comments, Kyari stated that the government had concluded plans to move against oil bunkering, pipeline vandalism and illegal activities threatening the country’s oil sector.\nThe team which visited various sites where illegal oil refineries were being carried out, he said, was on a mission to ensure that illegal oil refining and theft of crude oil was halted.\nAt Ibaa which is in Emeoha Local Government of the state, Kyari and the team ordered the destruction of several illegal sites.\nSpeaking with journalists at Ibaa, Kyari said the country could no longer afford to see her oil illegally exploited and stolen."
  },
  {
    "headline": "Anti-graft Agency, EFCC Seizes Obiano’s Passport, as Former Anambra Governor Regains Freedom",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has released the former governor of Anambra State, Willie Obiano after he perfected his bail conditions.\nThe former governor was arrested last week by the anti-corruption agency a few hours after handing over to the current governor, Charles Soludo.\nAccording to Daily Trust, Obiano’s passport was seized by the EFCC as part of his bail condition.\nThe EFCC spokesman had told our correspondent that Obiano was on their watch list prior to his arrest.\nSoludo in an interview with Arise TV on Tuesday said he met only N300 million in the state’s treasury when he assumed office."
  },
  {
    "headline": "Anti-graft Agency, EFCC Seizes Obiano’s Passport, as Former Anambra Governor Regains Freedom",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has released the former governor of Anambra State, Willie Obiano after he perfected his bail conditions.\nThe former governor was arrested last week by the anti-corruption agency a few hours after handing over to the current governor, Charles Soludo.\nAccording to Daily Trust, Obiano’s passport was seized by the EFCC as part of his bail condition.\nThe EFCC spokesman had told our correspondent that Obiano was on their watch list prior to his arrest.\nSoludo in an interview with Arise TV on Tuesday said he met only N300 million in the state’s treasury when he assumed office."
  },
  {
    "headline": "Anti-graft Agency, EFCC Seizes Obiano’s Passport, as Former Anambra Governor Regains Freedom",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has released the former governor of Anambra State, Willie Obiano after he perfected his bail conditions.\nThe former governor was arrested last week by the anti-corruption agency a few hours after handing over to the current governor, Charles Soludo.\nAccording to Daily Trust, Obiano’s passport was seized by the EFCC as part of his bail condition.\nThe EFCC spokesman had told our correspondent that Obiano was on their watch list prior to his arrest.\nSoludo in an interview with Arise TV on Tuesday said he met only N300 million in the state’s treasury when he assumed office."
  },
  {
    "headline": "EXCLUSIVE: How President Buhari Snubbed Ex-Lagos Governor, Tinubu During Visit To Lagos Days To APC Convention",
    "summarized_story": "There is growing anxiety in the camp of former Lagos State Governor, Bola Tinubu after President Muhammadu Buhari shunned the ex-governor during his (Buhari’s) visit to Lagos State on Tuesday.\nTop sources around the President added that Tinubu was also not allowed near Buhari – a body language suggestive of another round of discord between the two.\nSaharaReporters on Tuesday reported that Buhari and his entourage landed at the Presidential Wing of the Murtala Muhammed Airport, Lagos at 10 am on Tuesday, amid tight security.\nThe President had arrived aboard a Nigerian Air Force Boeing aircraft with registration number 5N-FGT and was welcomed by Governor Babajide Sanwo-Olu and some members of the Lagos State Executive Council.\nPresident Buhari was also at the ongoing construction at the Dangote Refinery, as well as the Lekki Deep Sea Port."
  },
  {
    "headline": "EXCLUSIVE: How President Buhari Snubbed Ex-Lagos Governor, Tinubu During Visit To Lagos Days To APC Convention",
    "summarized_story": "There is growing anxiety in the camp of former Lagos State Governor, Bola Tinubu after President Muhammadu Buhari shunned the ex-governor during his (Buhari’s) visit to Lagos State on Tuesday.\nTop sources around the President added that Tinubu was also not allowed near Buhari – a body language suggestive of another round of discord between the two.\nSaharaReporters on Tuesday reported that Buhari and his entourage landed at the Presidential Wing of the Murtala Muhammed Airport, Lagos at 10 am on Tuesday, amid tight security.\nThe President had arrived aboard a Nigerian Air Force Boeing aircraft with registration number 5N-FGT and was welcomed by Governor Babajide Sanwo-Olu and some members of the Lagos State Executive Council.\nPresident Buhari was also at the ongoing construction at the Dangote Refinery, as well as the Lekki Deep Sea Port."
  },
  {
    "headline": "Sack: INEC suspends action on Ebonyi over conflicting court judgments",
    "summarized_story": "The Independent National Electoral Commission (INEC) says it has suspended action on the court judgment ordering the sack of David Umahi and Eric Igwe, governor and deputy governor of Ebonyi, respectively.\nThe commission, in a statement issued on Thursday, said the decision will also affect the court ruling sacking 16 members of the Ebonyi state house of assembly.\nAdvertisementHowever, the governor, deputy governor and the state assembly members have appealed the rulings.\nThe commission said it has received a total of 12 court rulings on the matter, adding that it will stay action pending the outcome of the appeals.\n“Since then, the commission has been served yet more court processes on the same matter, bringing the total to 12."
  },
  {
    "headline": "Sack: INEC suspends action on Ebonyi over conflicting court judgments",
    "summarized_story": "The Independent National Electoral Commission (INEC) says it has suspended action on the court judgment ordering the sack of David Umahi and Eric Igwe, governor and deputy governor of Ebonyi, respectively.\nThe commission, in a statement issued on Thursday, said the decision will also affect the court ruling sacking 16 members of the Ebonyi state house of assembly.\nAdvertisementHowever, the governor, deputy governor and the state assembly members have appealed the rulings.\nThe commission said it has received a total of 12 court rulings on the matter, adding that it will stay action pending the outcome of the appeals.\n“Since then, the commission has been served yet more court processes on the same matter, bringing the total to 12."
  },
  {
    "headline": "Lalong: Buhari told us Abdullahi Adamu is his choice for APC national chairman",
    "summarized_story": "Simon Lalong, governor of Plateau, says President Muhammadu Buhari told governors of the All Progressives Congress (APC) that he would prefer Abdullahi Adamu as the party’s national chairman.\nSpeaking on Thursday when he featured on Channels TV’s Politics Today, Lalong said Buhari had earlier said he would prefer for the party’s national chairmanship slot to be zoned to the north-central.\n“The president said he preferred the chairman should come from the north-central zone,” the Plateau governor said.\nAdamu, who served as governor of Nasarawa between 1999 and 2007 and is currently the senator representing Nasarawa west, chairs the APC national reconciliation committee.\nAdvertisementAdams Oshiomhole, former governor of Edo, was picked as APC national chairman in 2018 under similar circumstances."
  },
  {
    "headline": "Lalong: Buhari told us Abdullahi Adamu is his choice for APC national chairman",
    "summarized_story": "Simon Lalong, governor of Plateau, says President Muhammadu Buhari told governors of the All Progressives Congress (APC) that he would prefer Abdullahi Adamu as the party’s national chairman.\nSpeaking on Thursday when he featured on Channels TV’s Politics Today, Lalong said Buhari had earlier said he would prefer for the party’s national chairmanship slot to be zoned to the north-central.\n“The president said he preferred the chairman should come from the north-central zone,” the Plateau governor said.\nAdamu, who served as governor of Nasarawa between 1999 and 2007 and is currently the senator representing Nasarawa west, chairs the APC national reconciliation committee.\nAdvertisementAdams Oshiomhole, former governor of Edo, was picked as APC national chairman in 2018 under similar circumstances."
  },
  {
    "headline": "Electoral act: Political appointees won't vote during convention, says APC",
    "summarized_story": "The caretaker extraordinary convention planning committee of the All Progressives Congress (APC) says political appointees elected as delegates won’t be allowed to vote during the convention.\nAccording to a statement posted on the Twitter handle of the convention committee on Thursday, the decision to bar political appointees from voting is in “view of the controversy surrounding section 84(12) of the Electoral Act, 2022”.\nThe party, however, said the political appointees could still attend the convention, but as observers.\nAdvertisement“The National Caretaker Extraordinary Convention Planning Committee of APC has declared that all political appointees who were elected as delegates to the National Convention slated for 26/3/2022 SHALL NOT VOTE in view of the controversy surrounding Section 84 (12) of the Electoral Act,2022,” the notice reads.\n“However, political appointees can still attend as observers."
  },
  {
    "headline": "Okubanjo to step back from people decisions at Bento Africa",
    "summarized_story": "Bento’s board’s decision comes a few days after TechCabal exposed the harrowing experiences of ex-employees of payroll startup Bento Africa and how Okubanjo had allegedly been the orchestrator of that through direct and indirect bullying, verbal abuse, and threats to employees.\nOur responsibility and charter is to the Company, not the founders we invest in,” the board said in an email sent to all Bento employees, past and present.\nFurthermore, the board said that while Okubanjo is taking a back seat with immediate effect, an internal investigation into Bento’s workplace culture has begun.\nThe board claimed to have “…ensured that the current team is safe and free to speak freely.\nWith Love, Okubanjo admits to encouraging a work culture of “long workdays and weeks” and apologised for his abusive outbursts."
  },
  {
    "headline": "Tyranny in the workplace: The chaotic culture of Bento Africa",
    "summarized_story": "Ebun Okubanjo announcing on the company’s slack after firing Kunle“Leave Ebun, that man can literally kill you and brag about it.\nOn November 22, when Okunbanjo fired Kunle for the second and final time, he refused to pay his November salary and severance pay.\nFor Johnson, joining Bento Africa was “a bad idea” and leaving “the best thing he’d ever done for himself”.\nBento is still toxicThree current Bento employees contacted by TechCabal were diplomatic about their responses, but they agreed that everything this publication has unearthed about Bento Africa’s work culture “is not false”.\nEbun Okubanjo posted our email request on Twitter, he has since deleted the tweet."
  },
  {
    "headline": "Big Cabal Media raises $2.3m to expand its compelling line of digital products",
    "summarized_story": "In 2021, venture capital invested $115 million in digital media globally, a tenth of the $1.1billion it funded in 2015, but not much came to Africa.\nToday, one of such exceptions, Big Cabal Media (BCM), a leading African digital media company, has announced a $2.3 million Seed funding round, emphasising its commitment to keep building exciting and authoritative media products and brands.\n“We are delighted to support Big Cabal Media at a pivotal moment.\nBCM’s progress over the years and recent fundraise is a noteworthy example of the possibilities and opportunities in Africa’s digital media sector.\n“Investing in Africa’s booming digital media sector aligns perfectly with MaC’s mission of supporting exceptional entrepreneurs building valuable technology companies that leverage shifts in cultural trends and behaviours."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "Tingo, a Nigerian tech company, is attempting to dominate the fintech market after making inroads into agribusiness",
    "summarized_story": "TingoPay is an all-in-one financial solution application designed to address challenges for Small and Medium Scale Businesses (SMEs) and, by extension, all bank customers with smartphones.\nConsequently, farmers have unlimited access and market information, and their concerns about infrastructural challenges, time and product waste are completely alleviated.\nTingo Mobile plans to work with Motorola to provide new Defy rugged Motorola smartphones to users who do not currently own one.\nThe platform enables farmers to sell large quantities of farm produce to buyers both within and outside of Africa.\nAccording to Ayoade, the new solution will also provide customers with soft loans that are easy to access and repay."
  },
  {
    "headline": "Interswitch showcases its role as an enabler in the fintech ecosystem, and engages the media in an interactive session",
    "summarized_story": "In her opening remark, Cherry Eromosele, Executive Vice President (EVP), Group Marketing & Corporate Communications, Interswitch, welcomed members of the media and discussed the role of Interswitch as an innovative enabler in the African Fintech ecosystem.\nShe said “in support of our mission to inspire Africa to greatness, Interswitch group has continued to push the boundary of innovation to deliver payment solutions that enable commerce thrive across Africa.\nThe immersion session led by Olawale Akanbi, Group Head, Growth Marketing – Merchants & Ecosystem, was titled ‘understanding the Interswitch business: Africa’s Fintech Model Company.’ It showcased the businesses of Interswitch and its position as an enabler in the fintech industry.\nThe Verve Global card is accepted in 185 countries.\nThe Verve global card covers the limitations of the Classic Verve card."
  },
  {
    "headline": "Legalising and regulating crypto",
    "summarized_story": "Share this article:Web3 is perhaps one of the biggest buzzwords frequently used in the crypto world.\nHere’s today’s spread:Legalising and regulating cryptoYouTube’s plan to stream TV shows for freeLegalising and regulating cryptoWhile the crypto market has not seen bull runs that send the entire crypto community in a frenzy since Bitcoin’s all-time high of $65,000, it has not been devoid of significant updates.\nTo know more about Ukraine’s crypto donations and their effect on the market, please read here: Russia-Ukraine War: What $54m in crypto donations could mean for the global crypto marketSome people believe that the executive order on crypto by the US was borne out of fears that Russia might use it to circumvent sanctions.\nPer YouTube’s blog post, more people are opting to watch videos on the big screen, and the move to add TV shows to their options is perfect timing.\nIf you’d like to be paid in crypto apply hereKippa needs someone to head its engineering team."
  },
  {
    "headline": "EDSIEC releases timetable, fixes April 19 for Edo council polls – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Independent Electoral Commission (EDSIEC), on Thursday, released the timetable for election in the 18 local government areas of the state.\nThe election, according to the commission, is scheduled to hold on Tuesday, April 19, 2022.\n), who stated this in the Notice of Election signed by the Commission’s Secretary, Peter.O.\nOjo Esq., and made available to journalists in Benin City, said that the commission would meet with political parties on Monday, March 28, 2022.\nEDSIEC said aspirants who are contesting elective positions in the council polls will be screened between 13th and 14th April 2022, while names of candidates will be displayed on 15th April, 2022."
  },
  {
    "headline": "Edo State Govt Slashes Ticket Prices for Central Park Users – Nigerian Observer",
    "summarized_story": "Hon Comrade Philip Shaibu said it was a deliberate policy for the betterment of all drivers and commuters.\nThe increase in ticketing in Oredo Local Government Area of Edo State was due to the proposed cost of maintenance of the structure built at Obakavbaye, which is the central park for all drivers within the Local Government.\nHaven carefully considered the impact of the ticket prices on the drivers and passengers against the background of the economic situation at the moment, the State Government decided to reduce the daily ticket prices from the initial two thousand naira to one thousand six hundred naira (#1,600) paid by each commercial vehicle.\n” We have reduced the prices for the ticket and the maintenance cost for the facilities.\nThe daily ticket prices are; Comrade Buses – #2,50018 seaters Buses – #1,60010 seaters Buses – #1,200Cabs – #800."
  },
  {
    "headline": "‘Don’t Rely On Your Colleagues, Get Firsthand Information’ Uduaghan Charges Media – Nigerian Observer",
    "summarized_story": "Uduaghan while commending the media for their role in strengthening democracy in Nigeria, said,“The media helped in bringing democracy to what it is today.\nSocial Media is much more dangerous than traditional media.\nThe media must endeavour to go round the state, monitor electoral activities, get first-hand information and publish the truth.\nUduaghan, who advocated that media practitioners should be well remunerated, said traditional rulers should be given more roles to play in the polity, especially in the area of security.\n“Traditional rulers should be given more roles to play in the society because if they are, insecurity will reduce."
  },
  {
    "headline": "12-yr Old Defiled With A Stick By Aunt in Delta – Nigerian Observer",
    "summarized_story": "Igho’s cries were said to have attracted her blind mother who pleaded with her sister to cease the beatings.\nHowever, Igho’s mother was attacked by her sister who went further to put pepper and push a stick into Igho’s vagina.\nNarrating the incident , Ejumudo said, “Mercy Oba is the sister to the blind woman.\nThe blind mother managed to find her way down and pleaded for her to leave Igho, but she started to beat her too.\nShe was detained in our presence and medical care was given to the girl and her blind mother”."
  },
  {
    "headline": "CBN’s exchange rate policy has made naira largely stable – Emefiele",
    "summarized_story": "“As you may recall, by June 2014 when I assumed office, the price of crude oil had substantially softened.\nFurthermore, we ensured the liberalization of the Foreign Exchange Market through the operationalization of the “Revised Guidelines for the Operation of Nigerian Inter-bank Foreign Exchange Market” in June 2016.\nThe guidelines introduced the Naira-settled Foreign Exchange Futures Market.\nIt is heartening to note that these policies are yielding positive results in terms of meeting genuine demand for foreign exchange and exchange rate stability.\nPAVE is designed to be the key for fast-tracking a bucket of substitutes to Crude oil export."
  },
  {
    "headline": "The unhelpful reality of greed, pretence and hatred for truth, by Elliot Uko",
    "summarized_story": "Political power at the state and federal level certainly ensures patronage flow our way.\nGreed for political power, gives birth to pretension that all is well with Naija and truth is despised.\nBy lying to ourselves consistently that nothing is wrong with our structure, the fallouts from the retrogresive unitary structure, only got worse with time.\nAll the troubles tied to one thing: the inadequacies of the unitary structure bequeathed the country by the military.\nPretense that all is well with the country, is only inspired by an unhealthy greed for power and hatred of the truth."
  },
  {
    "headline": "Suspected killers of Ogun monarch arraigned",
    "summarized_story": "Olakunle IdowuNo fewer than twelve persons, suspected to have hands in the gruesome murder of the Olu of Agodo in Ogun State, Oba Odetola Olajide Ayinde, were yesterday arraigned before an Ogun State Magistrate Court sitting in Itori, Ewekoro local government area of state.\nIt would be recalled that the suspects on Monday 24th January 2022 allegedly killed Oba Ayinde.\nHe supported his prayers with 16 paragraph affidavit, deposed to by Sergeant Ogunkunle Samuel, and annexed to with 20 exhibits.\n“The accused also allegedly did set ablaze the corpse of Oba Olajide Ayinde Odetola together with his Toyota Sienna car with Reg No.\nAPP 55 GF and thereby committed and offence cbbontrary to section 443 of the Criminal Code Law of Ogun State of Nigeria 2006.”Facebook Notice for EU!"
  },
  {
    "headline": "Makarfi expresses anger over ‘horrible’ killings Southern Kaduna",
    "summarized_story": "A former Governor of Kaduna state, Ahmed Makarfi, has condemned persistent violent attacks against residents of Southern Kaduna by bandits, describing the killings as callous, horrible and unacceptable.\nThe former governor who spoke in the wake of killings of innocent people around the Jema’a-Kaura-Zangon Kataf Local Governments axis of Kaduna in the past few days, demanded action from authorities against the killers.\nRecall also that the Kaduna State government on Wednesday, disclosed that the number of those killed in an attack at Kaura local government of the state on Sunday had risen to 34.\nMakarfi in a statement on Wednesday, while condemning the spate of violence, set condolences to the bereaved.\n“These callous acts must be condemned by all people of decency as we must all come together, irrespective of whatever differences, to do whatever it takes to put a stop to this wanton decent into animalism,” he said."
  },
  {
    "headline": "BREAKING: APC Excludes Political Appointees From Voting At Convention",
    "summarized_story": "In order to avoid legitimacy crisis, the Caretaker/Extraordinary Convention Planning Committee (CECPC) of the All Progressives Congress (APC) has barred political appointees from voting at the national convention of the party slated for Saturday, March 26, 2022.\nCECPC, in a statement on Thursday, expressly declared that “all political appointees who were elected as delegates to the National Convention slated for 26/3/2022 SHALL NOT VOTE in view of the controversy surrounding Section 84 (12) of the Electoral Act, 2022.”The committee, however, stated that political appointees can still attend the convention as observers.\nLEADERSHIP reports that Section 84(12) of the Electoral Act 2022 is currently a subject of disagreement between the Executive arm of government and the National Assembly.\nADVERTISEMENTA Federal High Court sitting Umuahia, Abia State, had last week ordered the deletion of the said Section of the electoral law, saying it offends some Sections of the 1999 Constitution (as amended).\nADVERTISEMENTHowever, the National Assembly, on Wednesday, announced that it will appeal the judgment of the Abia Court at the appellate Court."
  },
  {
    "headline": "NIPSS SEC 44: AIG Aisha Abubakar, Umar Khalifa Emerge Monitor-General, Sec-Gen",
    "summarized_story": "The prestigious National Institute for Policy and Strategic Studies (NIPSS), Kuru in Plateau State, has erupted in wild jubilation penultimate week as Assistant Inspector General of Police (AIG), Aisha Abubakar, and Dr. Umar Khalifa Mohammed, emerged as Monitor General and Secretary General of Senior Executive Course (SEC) 44, 2022 of the Institute respectively.\nAisha Abubakar broke the age-long jinx of men domination to become the first woman to clinch the position of Monitor General (MG), while Dr. Umar Khalifa Mohammed, a 40-year-old technocrat also set an enviable record to become the youngest person to be elected Secretary General of the institute.\nAbubakar, the erstwhile AIG in charge of the Nigeria Police Force (NPF) Animal Branch and National President Nigerian Veterinary Association, clinched the new position after a keenly contested election.\nADVERTISEMENTSimilarly, Dr. Umar Khalifa Mohammed, who was nominated by the Presidency to participate in the course became a pacesetter after he gallantly emerged as the Secretary General (SEC-GEN) of Senior Executive Course (SEC) 44 2022.\nNIPSS is a policy formation center for bureaucrats, private sector leaders, executives, para-military officers, senior civil servants, which was founded in 1979."
  },
  {
    "headline": "BREAKING: APC Releases Programme Of Events For National Convention",
    "summarized_story": "Ahead of the March 26 national convention of the ruling All Progressives Congress (APC), its media and publicity sub-committee of the convention has a released a programme of events for the Saturday’s biggest gathering of the party.\nChairman of the media and publicity sub-committee for the 2022 APC national convention, Governor Abdullahi Sule of Nasarawa State released the programme of events for the convention holding at the Eagle Square in Abuja.\nArrival of the National Chairman, Caretaker/Extraordinary Convention Planning Committee (CECPC) 2:30pm7.\nWelcome Address by National Caretaker/Extraordinary Convention Planning Committee Chairman and presentation of motions 5:55-6:10pmi.Motion for the approval of constitution as amendedADVERTISEMENTii.\nAcceptance Speech by the newly elected National Chairman of the APC25."
  },
  {
    "headline": "2023: Why I Attended Atiku’s Presidential Declaration – Peter Obi",
    "summarized_story": "Former governor of Anambra State, Peter Obi, has explained reasons for attending the ceremony where former Vice President Atiku Abubakar officially declared his interest in the presidency of Nigeria.\nAtiku had formally declared his intention to contest the 2023 presidential election in Abuja on Wednesday at a well-attended event.\nJUST-IN: Peter Obi Joins 2023 Presidential RaceSpeaking with Channels Television at the event, the former running mate to Atiku in the 2019 elections, said he play politics with a difference.\nADVERTISEMENTAsked why he was at the event, given he was eyeing the same position, Obi said, “This is a new politics.\nI play politics differently."
  },
  {
    "headline": "2023: Avoid Squabbles, Distractions, Buhari Tells APC Leaders, Members",
    "summarized_story": "“As you all know, the National Convention of our party, which we have committed to, is holding on the 26th March, 2022.\n“A critical segment of our national democratic process is the National Assembly.\nADVERTISEMENTHe said: “It is very important to also emphasize here, that the nineth National Assembly has been a very stable National Assembly, it has been a very productive National Assembly.\nAnd we have remained very united in the two chambers, as APC senators and members of the House of Representatives.\nAnd we thank God that today, by the grace of God, the ninth National Assembly, has done so much in the area of legislation."
  },
  {
    "headline": "Why African leaders mustn't attempt tenure elongation",
    "summarized_story": "Former President, Olusegun Obasanjo has warned African leaders not to manipulate the system to go beyond their constitutional term limits, as this would only plunge their nations into avoidable crises.\nThe former president spoke virtually at a strategy meeting held in Abuja on Wednesday.\nObasanjo called for a proactive strategy to forestall political crises in the region, adding that early warning signs should be leveraged to prevent degeneration of tenuous situations.\nHis words: “I believe that we need a proactive strategy and a reactive strategy.\nI, therefore, appeal to all our leaders across our nations to make democracy work for the interest of all citizens."
  },
  {
    "headline": "Omosexy celebrates as daughter graduates on wedding anniversary (Photos)",
    "summarized_story": "Veteran Nollywood actress, Omotola Jalade-Ekeinde, popularly known as Omosexy, has celebrated her daughter, Princess, as she bagged a Master’s degree in International Tourism Management from the Middlesex University, Dubai.\nPrincess graduated the same day Omotola and her husband celebrated their 26th wedding anniversary.\nShe wrote: “Yesterday 23rd of March 2022 was a very Special day for me.\nand because God promised me everything now will be triple triple…?\n😂I wish you triple triple blessings too ."
  },
  {
    "headline": "JUST IN: APC bows to electoral act, stops political appointees from voting at convention",
    "summarized_story": "JUST IN: APC bows to electoral act, stops political appointees from voting at conventionThe All Progressives Congress has barred political appointees from voting at its national convention holding on Saturday.\n“However, political appointees can still attend as observers.”The Senate had earlier unanimously rejected Electoral Act Amendment Bill sent by the President Muhammadu Buhari.\nIn the rejected bill, the president asked the National Assembly to amend Section 84(10) of the Act to allow political appointees to contest and participate in the primaries without resigning.\nThe judgment, delivered by Justice Evelyn Anyadike, nullified Section 84(12) of the newly amended Electoral Act, saying it violated the provisions of the Constitution.\nOn Wednesday, March 23, the Senate resolved to appeal the judgment by the Federal High Court in Umuahia, nullifying the provision of Section 84(12) of the Electoral Act 2022."
  },
  {
    "headline": "2023: Northern Pastors organize one-million man prayer rally for Tinubu",
    "summarized_story": "Some Christian clerics under the auspices of Northern Clergy and Christian for Tinubu 2023, on Thursday, staged a special prayer rally for the national leader of the All Progressives Congress (APC) and 2023 presidential hopeful, Asiwaju Ahmed Bola Tinubu, at the Unity Fountain, Abuja.\nSpeaking to journalists shortly after the one-million man prayer rally, the convener, Bishop Sunday Garuba, said God expressed it in their hearts to pray for Tinubu’s presidential ambition.\nAnd we are praying, God also expressed in our hearts to pray for Senator Ahmed Tinubu because of his track records of how he had led.\nIt is only God that can approve for a man to come to authority.\nThe will of God concerning Bola Ahmed Tinubu will be realized."
  },
  {
    "headline": "Strike: Expect Bigger Salaries Soon, IGP Tells Policemen",
    "summarized_story": "He stated that, while the federal government had declared an increase in police officers’ salaries, the process of putting it into effect was still underway.\nHe stated that, while the federal government had declared an increase in police officers’ salaries, the process of putting it into effect was still underway.\n“President (Buhari) announced a salary increase from his benevolence.\nThe salary increase is now being processed, and computations have already begun.\nI want you to sit down and look at the percentage of salary increase."
  },
  {
    "headline": "JUST IN: Peter Obi Declares For 2023 Presidential Race",
    "summarized_story": "Peter Obi, the former governor of Anambra State, has launched his candidacy for the president in 2023.\nDuring a visit to Anambra traditional rulers on Thursday, Mr Obi made his intentions clear.\nBoth Messrs Obi and Abubakar will run for the Peoples Democratic Party’s (PDP) presidential ticket in 2023.\nMr Obi stated his intention to run for president of Nigeria in February, but only provided his party, the Peoples Democratic Party, zones the presidential ticket to the south.\nBola Tinubu, Vice President Yemi Osinbajo, ex-Vice President Atiku Abubakar, and Governor Aminu Tambuwal are currently preparing for the 2023 election."
  },
  {
    "headline": "24 hrs to APC Convention, Buhari drops crucial hint for party members",
    "summarized_story": "President Muhammadu Buhari gave the admonition Thursday while receiving the National Assembly lawmakers elected on the APC platform at the State House.\n“As you all know, the National Convention of our party, which we have committed to, is holding on the 26th March, 2022.\nAnd we cannot afford to do anything that will jeopardize the chances of the party in the 2023 General Elections.\nAddressing newsmen at the party’s national secretariat Thursday in Abuja, Governor Sule said the APC governors were now more united and would go into the convention as one united family.\n“The APC Policy Conference will be structured into different panel discussions that will focus on core thematic areas as follows: economy, governance, and human development."
  },
  {
    "headline": "[Breaking] Ukraine invasion: U.S. heaps more sanctions on Russian lawmakers, elites, others",
    "summarized_story": "The U.S. announced a new package of sanctions on Russian elites, lawmakers and defense companies, punishments designed to ramp up pressure on Moscow over its invasion of Ukraine.\nThe U.S. will impose full blocking sanctions on more than 400 individuals and entities, including the Duma, Russia’s lower house of parliament, and 328 of its members, more than a dozen Russian elites and 48 Russian defense companies.\n“I’m announcing additional sanctions on over 400 Russian elites, lawmakers, and defense companies in response to Putin’s war of choice in Ukraine,” Biden said in a tweet.\nAmong the defense companies being sanctioned are Russian Helicopters, Tactical Missiles Corporation, High Precision Systems, NPK Tekhmash OAO and Kronshtadt, according to the White House.\nThe U.S. and EU are making explicit a ban on transactions in gold with the Russian central bank."
  },
  {
    "headline": "Electoral Act: FG moves to delete section 84(12), NASS goes on appeal, Katsina senators, 25 others back out – Blueprint Newspapers Limited",
    "summarized_story": "The Deputy Whip of the Senate, Senator Aliyu Sabi Abdullahi (APC Niger North), seconded the motion.\nBut Senate President Ahmad Ibrahim Lawan, in a move to water down the prayer on appeal, suggested that the matter should be forwarded to the Senate Committee on Judiciary, Human Rights and Legal Matters.\nReps too…Also, the House of Representatives Wednesday resolved to appeal the judgement.\nThe House, while condemning the Abia High Court judgement, also faulted attempts at hurriedly deleting the contentious section, even when the National Assembly was not joined in the suit.\nAnd above all, as you rightly stated, the possibility of an appeal is equally there."
  },
  {
    "headline": "Second Niger Bridge Now 91% Complete, Says FG",
    "summarized_story": "The Federal Government has disclosed that the Second Niger Bridge linking Anambra and Delta states, scheduled for completion in February 2022, is now 91 per cent completed.\nMinister of Works and Housing, Babatunde Fashola, made this announcement on Thursday during the Special Weekly ministerial briefing at the State House in Abuja.\nAccording to him, the 206 billion naira project has directly employed 1,486 people, while 8,110 indirect jobs have equally been created.\nHe noted that the Lagos Ibadan Express Way and Second Niger Bridge will be completed by the end of the year while the main Carriageway of Abuja-Kaduna-Zaria-Kano expressway is scheduled for completion by the second quarter of 2023.\nThe Second Niger Bridge was first proposed during the 1978/79 political campaign by then-candidate Shehu Shagari of the National Party of Nigeria (NPN)."
  },
  {
    "headline": "Peter Obi Declares To Run For President In 2023",
    "summarized_story": "Former Anambra State Governor Peter Obi on Thursday declared his intention to run for President in 2023.\nHe made the declaration in Awka at a gathering of traditional rulers in Anambra State.\nMr Obi was running mate to former Vice President Atiku Abubakar in the 2019 presidential election.\nREAD ALSO: Peter Obi Attends Atiku’s Presidential Declaration Event, Says ‘Politics Is Not War’On Wednesday, Mr Obi attended an event where Mr Atiku declared his intention to run again for President.\nWhen asked why he was attending the declaration event of a potential rival, Mr Obi said Atiku Abubakar “is my leader” and that “politics is not war.”"
  },
  {
    "headline": "APC Leaders Agree On Consensus Candidates, To Produce Unity List – Lawan",
    "summarized_story": "Senate President Ahmed Lawan has said the All Progressives Congress (APC) has agreed on producing consensus candidates and is expected to put out a ‘Unity List’ by Friday ahead of the party’s national convention on Saturday.\nLawan stated this after the National Assembly caucus leaders met with President Muhammadu Buhari at the State House on Thursday.\n“We hope to achieve a consensus in selecting and electing the officers for the party, we are prepared to come up with a unity list,” he said.\nOn his part, President Buhari urged the APC leaders and members to channel their energies into improving the fortunes of the party in the forthcoming elections and avoid squabbling, that could distract and create disharmony.\nWith the elections less than 11 months away, the President urged that positions should be harmonised with a view to the party winning and providing good governance."
  },
  {
    "headline": "EFCC Releases Ex-Anambra Governor, Willie Obiano",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has released the immediate past governor of Anambra State, Willie Obiano, on administrative bail.\nHe said the former governor was released on Wednesday and that his passport is still being held by the anti-graft agency as part of bail conditions.\nChannels Television had earlier reported that the EFCC Chairman, Abdulrasheed Bawa explained that Obiano was still in custody because he has yet to meet his bail conditions.\nObiano was arrested last week at the Murtala Muhammed International Airport in Lagos, hours after handing over to Governor Charles Soludo.\nAfter handing over to his successor, Professor Charles Soludo, the former governor was intercepted by EFCC operatives at the Murtala Muhammed International Airport in Lagos on Thursday last week."
  },
  {
    "headline": "Portugal Beat Turkey, Through To World Cup Qualifying Play-Off Final",
    "summarized_story": "Portugal survived a second-half fightback to beat Turkey 3-1 in Porto on Thursday and advance to the finals of the European World Cup qualifying play-offs.\nFirst-half goals from Otavio and Diogo Jota had Portugal cruising, but Burak Yilmaz pulled one back in the second half.\nThe Turkey captain then missed a late penalty, and Matheus Nunes sealed Portugal’s win in stoppage time, setting up a play-off decider at home to North Macedonia next Tuesday."
  },
  {
    "headline": "Convention: Buhari hosts APC founding fathers",
    "summarized_story": "President Muhammadu Buhari on Thursday hosted founding fathers of the All Progressive congress to a dinner at the Presidential Villa .\nThe engagement was also in furtherance of genuine efforts by the Nigerian leader at ensuring a rancor free and successful National Convention of the party coming up on Saturday.\nIn attendance were the First Interim Chairman of Party Chief Bisi Akande, Asiwaju Bola Ahmed Tinubu, Dr Ogbomnaya Onu, Rochas Okorocha, Ibrahim Shekarau and Aliyu Magatakarda Wamako.\nOthers are Governors Nasir Ahmed El-Rufai, Aminu Bello Masari, Rotimi Amaechi, Chairman , Caretaker and Extraordinary Convention Planning Committee of the party Mai Mala Buni and Secretary to the Government of the Federation Boss Mustapha.\nIt would be recalled President Buhari had earlier met APC Governors, National Chairmanship Aspirants of the party and leadership of the party at the National Assembly during which issues relating to the APC National Convention were discussed"
  },
  {
    "headline": "West African Court suspends sanctions imposed on Mali",
    "summarized_story": "A West African Court has ordered the suspension of some punitive sanctions imposed on Mali by the eight-nation West African Economic and Monetary Union with the French acronym UEMOA.\nUEOMA members, comprising mainly former French colonies in West Africal also belong to the 15-nation regional ECOWAS bloc.\nThe group met on January 9 in Accra before an ECOWAS summit to suspend Mali and impose sweeping financial sanctions on the country.\nAn official of the UEMOA Court told journalists on Thursday that the suspension order would be followed by “details” of the legal decision.\nMali, Guinea and Burkina Faso are under military rule in a resurgence of coups and regression of democracy in West Africa."
  },
  {
    "headline": "2023 Presidency: Over 700 women groups storm Umuahia for Yahaya Bello -",
    "summarized_story": "The walk was tagged “One Million Women March for Yahaya Bello 2”.\nThey defied the scorching sun and walked through the streets of Umuahia, singing solidarity songs, while some of them held placards with various inscriptions such as “If Yahaya Bello can do it in Kogi, he can do it for Nigeria”, “Yahaya Bello is our choice”, and Yahaya Bello, our hero”, among others.\n“That Governor is Governor Yahaya Adoza Bello.\nI was not actively involved in election processes before, but this time, we will go all out for Yahaya Bello.\nWith what we would do for Yahaya Bello, I mean the Nigerian women, other Governors and leaders will no longer joke with the issue of giving women what they deserve,” she maintained."
  },
  {
    "headline": "Former Zamfara Speaker Sanusi Rikiji Declares Intention For Senatorial Seat -",
    "summarized_story": "Former Speaker of the Zamfara State House of Assembly, Rt.\nHe told the state APC executives under the Chairmanship of Hon.\nTukur Umar Danfulani that he wants to occupy the senate seat in order to further contribute his quota to the political and socio-economic growth of the state.\n” I Intend to add quality to the good representation past senators had made at the national assembly as well as to assist and support the efforts of governor Bello Matawalle in the face of security challenges confronting the state while also joining the governor in the making of a new Zamfara” Rikiji SaidWhile commending the leadership of the party,he pledges his continued support and loyalty to the party and its leadership for the growth and development of the stateResponding, the Chairman, Zamfara State Tukur Umar Danfulani express happiness in the way the aspirant followed due process in declaring his intentionDanfulani assures him that as leaders of the party, they will be fair and just to all members and the party will leave its doors wide open for all interested and qualified members to contest for the position.\nHe noted that Zamfara Central Senatorial Zone deserves the best representation and the party will align with the people in ensuring that the best person is supported to ensure his Victory at the polls."
  },
  {
    "headline": "CBN Unveils Maize Pyramids In Kaduna",
    "summarized_story": "1 of 3 - +In line with President Buhari’s administrations vision of producing what we consume and reducing import bill, The Central Bank of Nigeria through it’s agro partnership with maize farmers are unveiling about 21 pyramids of maize in Kaduna."
  },
  {
    "headline": "West African Court Suspends Sanctions Imposed on Mali",
    "summarized_story": "RelatedStories No Content AvailableAhead of the ECOWAS Extraordinary summit in Ghana on Friday, a West African Court has ordered the suspension of some punitive sanctions imposed on Mali by the eight-nation West African Economic and Monetary Union with the French acronym UEMOA.\nThe group met on January 9 in Accra before an ECOWAS summit to suspend Mali and impose sweeping financial sanctions on the country.\nMali, Guinea and Burkina Faso are under military rule in a resurgence of coups and regression of democracy in West Africa.\nIn apparent retaliation, Mali has expelled the French Ambassador from Bamako and also ordered French media groups RFI and France24 out of Mali.\nAlso, while the memberships of the three military-controlled States have been suspended, it is believed that the sanctions against Mali are disproportionate."
  },
  {
    "headline": "Umahi Accused Of Looting N6.7bn In Petition To EFCC – Trending With Ojy Okpe",
    "summarized_story": "Dave Umahi Governor Of Ebonyi State on Wednesday said that he is unbothered by the recent court judgment that removed him from office.\nIn another development, the Peoples Democratic Party Ebonyi State chapter has allegedly petitioned the Economic and Financial Commission accusing Governor Umahi of looting the state treasury of over six billion naira after being sacked from office by the Federal High Court.\nFew days after the acting police spokesperson informed Nigerians that police officers are not to demand for tinted glass permit, a Twitter user @OsasenagaEno shared a video showing an officer arresting him for not having a tinted glass permit and was made to pay a fine of 20,000 thousand naira.\nFinally, The National Youth Service Corps has directed prospective female Corps members to report for registration at the orientation camps in their husbands state of domicile irrespective of the states indicated on their call-up letters."
  },
  {
    "headline": "Western Leaders Gather In Brussels As Fierce Fighting Rages Across Ukraine",
    "summarized_story": "An extraordinary NATO meeting is under way in Brussels — the first of three exceptional summits scheduled on March 24 by Western leaders to map out the next steps in efforts to stop Russia’s unprovoked invasion of Ukraine as fierce fighting continues in the besieged city of Mariupol and other flash points across the country.\n“At these three summits, we will see who is a friend, who is a partner, and who betrayed us for money.\nSpeaking ahead of the NATO summit, NATO Secretary-General Jens Stoltenberg said Russian President Vladimir Putin made a “big mistake” with his unprovoked invasion of Ukraine.\nThe official, who spoke on condition of anonymity, said in some areas east of Kyiv, Ukrainian troops appear to have pushed the Russians farther away.\nThe UN General Assembly is preparing to meet on March 24 to discuss the war in Ukraine and a draft humanitarian resolution written by Kyiv."
  },
  {
    "headline": "South Korea Fires Multiple Missiles in Response to North Korea’s Rocket Launch",
    "summarized_story": "South Korea has fired multiple missiles in response to North Korea’s earlier intercontinental ballistic missile (ICBM) launch, its military has said.\nJapan’s coast guard earlier said North Korea launched a projectile which landed inside Japan’s exclusive economic zone (EEZ), 170 km (106 miles) west of Aomori prefecture in northern Japan, at 3.44 pm (6.44am GMT).\nThe ICBM launch on Thursday by North Korea is thought to be its largest test ever, militaries in South Korea and Japan said.\nOn Thursday the White House condemned the latest launch and called it a “brazen violation” of multiple UN Security Council resolutions.\nAccording to South Korea’s Joint Chiefs of Staff, the latest North Korean missile was launched from near Sunan, where Pyongyang’s international airport is located."
  }
]