[
  {
    "headline": "Nigerien President commiserates with Buhari over Attahiru’s death",
    "summarized_story": "The Nigerien President, Mohammed Bazoum, on Saturday called the President, Major General Muhammadu Buhari (retd.\n), on the telephone to commiserate with him on the Friday plane crash in Kaduna that claimed the lives of the Chief of Army Staff, Lt. Gen Ibrahim Attahiru, and 10 others.\nThe Senior Special Assistant to the President on Media and Publicity, Garba Shehu, disclosed this on Sunday in a statement titled ‘Niger Republic’s leader, Bazoum, calls to condole with President Buhari over loss of Army Chief.’Shehu quoted the Nigerien President as describing the plane crash as tragic and unfortunate.\n“President Bazoum, who described the plane crash and the resultant deaths as tragic and unfortunate, expressed the condolences of the government and people of his country.\n“President Buhari commended Bazoum for sharing this moment of grief with Nigerians and assured him that the gesture was well noted."
  },
  {
    "headline": "NFF mourns as Supersand Eagles’ coach Adamu ‘Ejo’ dies",
    "summarized_story": "The Nigeria Football Federation has mourned Head Coach of the Beach Soccer National Team (Supersand Eagles), Audu Adamu, who died on Saturday.\n‘Ejo’, who has led the Supersand Eagles to several FIFA World Cup and Beach Soccer AFCON campaigns, lost the battle against diabetes on Saturday evening.\nCoach Adamu was a very dedicated head of the technical crew of our Beach Soccer Team.\nRead Also“The NFF never had any serious issues with him all through the years he spent with the Supersand Eagles.\nHe was very hard working, energetic and committed to beach soccer, and was simple, humble, and humane."
  },
  {
    "headline": "Econet founder Strive Masiyiwa becomes Britain’s first black billionaire",
    "summarized_story": "Econet founder, Strive Masiyiwa, has been named Britain’s first black billionaire.\nMasiyiwa, who is based in London, is the only black billionaire in the Sunday Times Rich List with a net worth of £1.087bn (about N655bn), earning him the title of Britain’s first black billionaire, according to DailyMail.\nMasiyiwa is actively working as an African Union special envoy on COVID-19, saddled with the responsibility of providing Africa with vaccines.\nIn 1993, he founded the Econet Group – a telecommunications company, which has now expanded its operations into Africa, Europe, Asia Pacific, and the Middle East region.\nIn 2016, Masiyiwa was appointed as a Non-Executive Director in Unilever, while in 2020, he became a member of the board of directors of Netflix."
  },
  {
    "headline": "Reps suspend security summit in honour of late Army Chief, others",
    "summarized_story": "Kindly Share This Story:By Tordue Salem – AbujaThe House of Representatives has postponed its security summit slated for Monday, in honour of late Chief of Army Staff, Lt Gen Ibrahim Attahiru and 10 other military officers.\n“The security summit will now kick off on Wednesday, May 26, 2021.\n“The House shares in the grief and sorrow of the families of the late top military officers and prayed that the Almighty God will grant them eternal rest.\n“It should be noted that the postponement became necessary as the late Army Chief was one of the major stakeholders that would have taken part in the summit”, a statement from the office of the Clerk stated.\nIt added that “The House regrets any inconvenience the postponement may cause invited guests.”Vanguard News NigeriaKindly Share This Story:"
  },
  {
    "headline": "EXCLUSIVE: Reps’ Bill bans rice importation, prescribes life imprisonment for offenders",
    "summarized_story": "Kindly Share This Story:By Tordue Salem – AbujaA law to prohibit the importation of rice into the country, is underway in the House of Representatives.\nA Bill exclusively obtained by VANGUARD, is entitled: ”An Act to Provide for the Prohibition of Importation into Nigeria of Rice and the Penalty for the Contravention of the Said Prohibition and other related Matters”.\nThe Bill also states that “(2) in addition to the penalty specified in subsection.\nThe piece of legislation, adds that “An offense committed under this Bill, shall be triable by the Federal High Court.”The Bill is expected to be considered and passed by the House on resumption from recess next month.\nVanguard News NigeriaKindly Share This Story:"
  },
  {
    "headline": "RIVERS: APC criticize PDP for holding rally on day of mourning Attahiru, others",
    "summarized_story": "Kindly Share This Story:By Davies Iheamnachor, Port-HarcourtThe All Progressives Congress, APC, has expressed shock over the decision of the Peoples Democratic Party, PDP, in Rivers State to organize a political event on a day of national mourning.\nNwuke said that the decision to televise such an event was an act of great disrespect for the nation’s fallen heroes who were buried the same day, Saturday.\n“Across the country, events planned for the weekend were shifted in order to enable Nigerians pay their last respect to our fallen heroes who died in an air crash in Kaduna.\nHe said: “We ask Governor Wike to explain why he is finding it difficult to prosecute a man who is not covered by immunity at this time for his alleged crimes while in office as Governor?\nWhy is Governor Wike unable to accept the findings of a panel of Inquiry that was set up by him which exonerated Rt."
  },
  {
    "headline": "Driving against traffic: Lagos impounds 10 vehicles on International Airport Road",
    "summarized_story": "Kindly Share This Story:To prosecute erring driversBy Bose AdelajaLagos State Environmental and Special Offences Unit (Taskforce) says it has impounded 10 vehicles on Muritala Mohammed International Airport Road for driving against traffic just as it has vowed to, henceforth, commence the arrest and prosecution of drivers of vehicles impounded for driving against traffic in addition to the forfeiture of such vehicles.\nThe Chairman of the agency, CSP Shola Jejeloye, was leading his team on a routine enforcement of traffic law in the metropolis when he ran into some of the vehicles driving against traffic on Airport Road on Friday night.\nHe added that Lagos State Law provided for a year imprisonment for drivers of vehicle impounded for driving against traffic as well as forfeiture of such vehicles.\n“It is disturbing that you still find many highly enlightened motorists driving against traffic just like the uneducated ones.\nIn view of the fact that many lives have been cut short by vehicles driving against traffic, many motorists are still in the habit of driving against the traffic, putting the lives of pedestrians and other road users in danger”, he stated."
  },
  {
    "headline": "Gen Attahiru: CAN Youth Wing declares three-day mourning",
    "summarized_story": "Kindly Share This Story:By Luminous Jannamike, AbujaThe Christian Association of Nigeria, CAN, youth wing, has declared three-day mourning over the demise of Chief of Army Staff, Lt. General Ibrahim Attahiru, and other officers who died in a military plane crash in Kaduna.\nHe further demanded an extensive inquest into the military plane crash; describing the incident as a colossal loss to the nation.\nAccording to him, Attahiru and the other officers were heroes who gave their lives for the security of the nation.\n“As we announce three-day national mourning, we demand an extensive inquest into this military plane crash and must be followed to the last.\nIt could be the President, a governor, Senator, military officers, or ordinary citizens."
  },
  {
    "headline": "Late DG, ICRC, Chidi Izuwah laid to rest, Ikpeazu, Presidency mourns",
    "summarized_story": "Abia State Governor, Dr Okezie Ikpeazu has mourned the death of the Director-General of the Infrastructure Concession and Regulatory Commission (ICRC) at the Presidency, Engr.\nChidi Izuwah.\nThe remains of Late Izuwah was laid to rest at his home, Umuotiri Amaede, Ovungwu in Isialangwa South Local Government Area of Abia State during the weekend.\nHe added that Late Engr Chidi Izuwah sacrificed immensely to the service of the nation.\nLate Chidi Kennedy Izuwah, died at the age of 56 leaving behind his wife and children."
  },
  {
    "headline": "NBA official raises alarm over insecurity in Abuja",
    "summarized_story": "David Aigbefoh, the Vice Chairman of the Nigerian Bar Association (NBA) Gwagwalada branch in Abuja, has called for increased security surveillance in the Federal Capital Territory (FCT).\nThe lawyer said there is an urgent need for security agencies to step up surveillance, especially aerial surveillance with the use of drones.\nHe referred to intelligence that some of the perpetrators responsible for crimes in Kaduna have extended their operations to Abuja.\nAigbefoh quoted a 2020 report by SB Morgen wherein the FCT ranked 11th among places where abductions have been recorded.\n“Security is everybody’s concern, all hands should be on deck to ensure the protection of lives and property in all the communities in and around Abuja,” he added."
  },
  {
    "headline": "Attahiru: Niger President Bazoum telephones Buhari",
    "summarized_story": "President Mohamed Bazoum of Niger has telephoned President Muhammadu Buhari over the death of the late Chief of Army Staff, Lt. General Ibrahim Attahiru.\nAttahiru and other military officers died on Friday in an air crash near the Kaduna airport.\nBazoum consoled Buhari, the federal government and the people of Nigeria.\nHe described the mishap and deaths as tragic and unfortunate and expressed condolences to the government and people of Nigeria.\nBuhari commended Bazoum for sharing this moment of grief with Nigerians and assured him that the gesture was well noted."
  },
  {
    "headline": "Middle East: Ex-Osun Speaker, Alabi calls for boycott of Israeli made products",
    "summarized_story": "A former Speaker, Osun State House of Assembly, Professor Majeed Alabi has called on Nigerians to boycott all products being produced by Israelis.\nAlabi made the call on Sunday while addressing journalists during a press conference organized to kick against the alleged persecution of Palestinians by Israelis in the Middle East.\nOur correspondent gathered that ongoing hostilities between Israelis and Palestinians have continued unabated despite several efforts to halt them.\n“It is necessary to put pressure on the state of Israel to ensure that we have peace for the Palestinians in the Middle East.\nWe should try as much as possible to ensure that human rights are guaranteed in any part of the world.”"
  },
  {
    "headline": "NYSC refutes report of directing corps members not to wear uniform",
    "summarized_story": "The National Youth Service Corps (NYSC) has refuted claims that it informed Corps members to stop wearing their uniform.\nThe NYSC in a statement on its Twitter page urged Nigerians to disregard the report, describing it as ‘fake and baseless.\n”The attention of NYSC Management has been drawn to a release trending online, purported to have been issued by the Scheme, directing Corps Members to stop wearing NYSC uniform to Community Development Service meetings, as well as other official programmes.\n”Management wishes to state that the information is fake and baseless, as it did not emanate from the Corps.\n”Corps members are advised to always glean authentic information only from NYSC social media platforms and the traditional media” it added."
  },
  {
    "headline": "Chief of Army Staff, wife, others die in military plane crash",
    "summarized_story": "The Chief of Army Staff, Lieutenant General Ibrahim Attahiru and his wife, Fati, have died in a plane crash involving a Nigerian Air Force aircraft.\nThe couple and six other military officers died near Kaduna airport where the Chief of Army Staff was billed to commission a project in one of the military formations in Kaduna State.\nHe said there was an air crash involving a Nigerian Air Force plane but did not reveal identities of those on board.\nHowever, it was gathered the Chief of Army Staff Lt Gen Ibrahim Attahiru was on board the aircraft with his wife and some other senior military officers.\nBefore his appointment as the Chief of Army Staff, he was the General Officer Commanding 82 Division of the Nigerian Army, Enugu."
  },
  {
    "headline": "VIDEO: Military aircraft crashes in Kaduna airport",
    "summarized_story": "Hello, you need to enable JavaScript to use The Nation Newspaper Community.\nPlease check your browser settings or contact your system administrator."
  },
  {
    "headline": "BREAKING: 12 die as Military plane crashes in Kaduna airport",
    "summarized_story": "A military plane suspected to be that of the Nigerian Air Force (NAF) has crashed around the Kaduna International Airport.\nThe plane, which crashed around 6pm on Friday, according to a source, exploded and got burnt completely.\nA competent source from the Airport told The Nation all the crew members and passengers numbering 12 died in the crash.\nThough, there has not been any official statement from the Armed Forces, eyewitnesses suspected the crew lost control of the aircraft due to sudden change of weather before the evening rain in KadunaDetails shortly…"
  },
  {
    "headline": "BREAKING: Chief of Army Staff, Lt Gen Attahiru, dies in plane crash",
    "summarized_story": "The Chief of Army Staff, Lt General Ibrahim Attahiru, has died in an plane crash with some of his aides.\nMilitary source said Gen. Attahiru was on a trip to Kaduna.\nEfforts were on to locate the wreckage of the plane and evacuate remains of the victims.\nHis mission to Kaduna was said to be “official.”Details shortly…"
  },
  {
    "headline": "How I was raped by a music Producer at 19 - Lady Gaga",
    "summarized_story": "Stefani Germanotta, the US singer better known as Lady Gaga, has revealed that she had a “total psychotic break” after a sexual assault at 19 left her pregnant.\nBut in the latest docuseries, Gaga revealed that she was sexually assaulted by a music producer who threatened to burn her music if she didn’t take off her clothes at the time.\n“I was 19 years old, and I was working in the business, and a producer said to me, ‘Take your clothes off,” she said.\nThe way that I feel when I feel pain was how I felt after I was raped.\nThe music star added that after years of grappling with the experience, she had “learned all the ways to pull myself out of it."
  },
  {
    "headline": "Tanker Explosion injures 48 persons, 8 fire officers in Kano",
    "summarized_story": "From Desmond Mgboh, KanoNo fewer than 56 people were injured following an explosion by a petroleum tanker which occurred at Sharada Phase 1 area of Kano State.\nDaily Sun gathered that the tanker with registration number NSR183 XW was carrying a total of 6600 liters of fuel when it exploded and overwhelmed the whole environment.\nAccording to the Public Relations Officer, Kano Fire Service, SaminuYusuf Abdullahi, 56 peoplr including eight firemen sustainedvarious degrees of burn as a result of the explosion adding that the explosion was caused procedural error while off loading its content.\nHe said thst one Ahmef Mohammed, aged 26.ignorantly opened up one of the tankets compartment ,a situation which ignited the fire .\nKano Secretary General of the Nigerian Red Cross Society, Alhaji Musa Abdullahi said thst the Emergency First Aid Team of the Red Cross promptly responded and evacuated 72 affected victims to Murtala Muhammad Specialists Hospital, Kano for medical attentionHe added that Seven Red Cross Volunteers actively participated in the operation."
  },
  {
    "headline": "Why my first marriage crashed –Yeni Kuti",
    "summarized_story": "By Christy AnyanwuTomorrow May 24, Yeni Kuti will hit a milestone.\nThe first child of Afrobeat legend, Fela Anikulapo- Kuti and choreographer per excellence will on that day turn 60.\nIn this exclusive interview, YK Power as Yeni is fondly called, opened up on her life journey to the Elders Club.\nA lot of people didn’t want to be our friend because were Fela’s children.\nA lot of people looked down on us because we’re Fela’s children."
  },
  {
    "headline": "2023: Why APC won’t ignore zoning —Odigie-Oyegun",
    "summarized_story": "Some people that were surprised when you attended the Edo APC dialogue meeting recently asked whether you are still a member of the APC?\nI don’t know if he wants to come back and I am not telling you he wants to come back.\nJudging by the situation now, will it be a mission possible for the APC to retain the power beyond 2023?\nHow will I know, we don’t know who the candidate will be.\nWhat is your take on the controversial issue of zoning of the 2023 presidential ticket in the APC?"
  },
  {
    "headline": "NAF plane crash: COAS Attahiru, 10 others, buried in Abuja amid tears",
    "summarized_story": "The bodies of the deceased were conveyed from Kaduna to the Nnamdi Azikiwe International Airport, Abuja, in a C-130 aircraft and were received by Service Chiefs and top military officers.\nVice President Yemi Osinbajo, expressed sadness over the death of the Lt. General Ibrahim Attahiru, and the other military officers in an air crash.\nThe All Progressives Congress (APC) described Attahiru as a “gallant soldier that served Nigeria with honour and dignity.\nThe People’s Democratic Party (PDP), yesterday, demanded an extensive probe into the plane crash that killed, Lt General Attahiru and 10 others, as well as other air mishaps involving military officers, in recent times.\nThe party described “Attahiru and the other officers as heroes who gave their lives for the security of our nation,” adding that the tragic incident was a huge blow to Nigeria."
  },
  {
    "headline": "Oduduwa nation: Election won’t hold in Southwest in 2023- Sunday Igboho",
    "summarized_story": "From Bamigbola Gbolagunte, AkureYoruba activist, Chief Sunday Adeyemo, popularly called Sunday Igboho, has declared that there was no going back for him on the clamour for a Yoruba nation.\nBesides, Igboho threatened to ensure that the 2023 general elections do not hold in all the Yoruba-speaking states.\nThe activist lamented the level of kidnapping, killing and maiming that had taken place in the Southwest region in the last six years and called on all Yoruba people to join in the agitation for a Yoruba nation.\nHe said that he would continue to mobilize people for the freedom of Yoruba people until his dream of having a Yoruba nation is achieved.\nThe rally, which was attended by over 2,000 protesters, also featured masquerade and women, chanting Yoruba solidarity songs as they marched round major streets of Akure."
  },
  {
    "headline": "Nigeria’s GDP Records 0.51% Growth in Q1",
    "summarized_story": "By James Emejo in AbujaNigeria’s real Gross Domestic Product (GDP) grew by 0.51 per cent in the first quarter of the year (Q1 2021) compared to 0.11 per cent in Q4 2020 & 1.87 per cent in Q1 2020, the National Bureau of Statistics (NBS) said Sunday.\nOil GDP contracted -2.21 per cent in Q1 compared to a contraction of 19.76 per cent in Q4 2020 and growth of 5.06 per cent in Q1 2020According to the GDP estimates for Q1 2021, which was released by the statistical agency, non-oil GDP grew 0.79 per cent in Q1 compared to 1.69 per cent in Q4.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari: Attahiru was a Brave Soldier Who Led from the Front",
    "summarized_story": "“Lieutenant General Attahiru was an epitome of gallantry and bravery which culminated in his being appointed the chief of army staff.\n“He led the Nigerian Army from the front and was emulated by others.\nHouse Mourns Army Chief, Attahiru, OthersMembers of the House of Representatives have expressed sadness over the death of Chief of Army Staff, Lt. Gen. Ibrahim Attahiru and his entourage in an air crash in Kaduna.\nFemi Gbajabiamila, in a statement described as shocking and sad the death Attahiru and others involved in the plane crash.\nThe Speaker sent his condolences to President Muhammadu Buhari, the Nigerian military, and the Attahiru family over the loss."
  },
  {
    "headline": "COVID-19: FG’s N2.3trn Intervention Stimulus Kicks off Tomorrow",
    "summarized_story": "An initiative being overseen by the Ministry of Humanitarian Affairs, Disaster Management and Social Development, in partnership with the World Bank is tagged: “Covid-19 Rapid Response Register (RRR)”.\nA statement by the communications officer of the State Operations Coordinating Unit (SOCU) in the Bauchi State Ministry of Budget and Economic Planning, Mallam Yakubu Mudi, however disclosed the development.\nThe objective of the Covid-19 Rapid Response Register (RRR) intervention, Mudi further explained, was to identify and support individuals and households in semi urban areas, whose livelihoods had been disrupted by the Covid-19 pandemic.\nThe potential beneficiaries will be targeted in semi urban wards of the 12 selected LGAs of Bauchi State, using geographic satellite remote sensing technology.\nAlso, a total of 20 Wards were equally selected from the LGAs, with a projected number of 828 communities."
  },
  {
    "headline": "Inside Story of Ayade’s Defection to APC",
    "summarized_story": "A top source within the National Working Committee (NWC) of the PDP said the economic issue played out more than the governor losing the PDP structures in the state.\nIta-Giwa, who was a founding member of All Nigeria People’ Party, ANPP has moved between PDP and APC four times since 1999.\n“It was after this slumber that he woke up and demanded that the NWC should intervene and restore the party structures to him.\nHe was the architect of himself missing out in the power structures to members of the National Assembly.\nHe was like emperor wining and dinning when members of National Assembly moved against him and took over the party from him,” the source stated."
  },
  {
    "headline": "Profiles in Courage… Died in Service to Fatherland",
    "summarized_story": "He had the unique privilege of having commanded with distinction all through the chain of command in the Nigerian Army.\nProminent among these appointments were Commanding Officer 146 Battalion Nigerian Army (Operation Harmony IV) in the Bakassi Peninsula, Commander 13 Brigade Nigerian Army (Operation Pulo Shield), and General Officer Commanding 82 Division Nigerian Army.\nHe was the Chief of Staff to the late Chief of Army Staff, Lt. General Ibrahim Attahiru.\nHe received many honours including the United Nations operations medal and others from the Nigerian Army.\nHe was the Provost Marshall of the Nigerian Army and also received a medal of honour from the United Nations."
  },
  {
    "headline": "Tell Your Violent Members To Stop The Killing - Christian Association Of Nigeria Tells Miyetti-Allah",
    "summarized_story": "Christian Association of Nigeria (CAN) on Thursday urged the leadership of the Miyetti-Allah Cattle Breeders Association of Nigeria (MACBAN) to call their members who are violent to order.\nThe cleric explained that nobody hates the Fulani until some Fulani began to act violently and killing innocent people.\n”In those days, our children married them, they married our children, but when they became too violent and started carrying AK47, killing people, what type of play is that?\nHe challenged their leaders to call out the violent ones among them to order, that is the only way people will respect them and people can trust them again.\nAyokunle also charged the government to step up its security system across the country with a view to stopping the unending killings, the News Agency of Nigeria reports."
  },
  {
    "headline": "Tell Your Violent Members To Stop The Killing - Christian Association Of Nigeria Tells Miyetti-Allah",
    "summarized_story": "Christian Association of Nigeria (CAN) on Thursday urged the leadership of the Miyetti-Allah Cattle Breeders Association of Nigeria (MACBAN) to call their members who are violent to order.\nThe cleric explained that nobody hates the Fulani until some Fulani began to act violently and killing innocent people.\n”In those days, our children married them, they married our children, but when they became too violent and started carrying AK47, killing people, what type of play is that?\nHe challenged their leaders to call out the violent ones among them to order, that is the only way people will respect them and people can trust them again.\nAyokunle also charged the government to step up its security system across the country with a view to stopping the unending killings, the News Agency of Nigeria reports."
  },
  {
    "headline": "Northern Leaders To Fulani Herdsmen: Come Back To North If South Isn't Safe, Secure To Live",
    "summarized_story": "The Northern Elders’ Forum (NEF) says it is time all Fulani herdsmen living in the south of Nigeria returned to their ancestral home in the north if their lives and properties cannot be protected by the government.\nThe farmers-herders violent conflicts among other issues have continued to polarize the two parts of Africa's most populous country, especially now with a Fulani man, President Muhammadu Buhari, ruling Nigeria.\nThe northern elders said their kinsmen should immediately vacate the south if their safety and security could no longer be guaranteed in the region.\n“Now, certainly we are worried about their safety like we are worried about the safety of every Nigerian who decided to live wherever they want to,\" he stated.\n“Those who are residents there should keep us informed and those of us who are monitoring from here should also keep ourselves informed about what is happening.\""
  },
  {
    "headline": "Northern Leaders To Fulani Herdsmen: Come Back To North If South Isn't Safe, Secure To Live",
    "summarized_story": "The Northern Elders’ Forum (NEF) says it is time all Fulani herdsmen living in the south of Nigeria returned to their ancestral home in the north if their lives and properties cannot be protected by the government.\nThe farmers-herders violent conflicts among other issues have continued to polarize the two parts of Africa's most populous country, especially now with a Fulani man, President Muhammadu Buhari, ruling Nigeria.\nThe northern elders said their kinsmen should immediately vacate the south if their safety and security could no longer be guaranteed in the region.\n“Now, certainly we are worried about their safety like we are worried about the safety of every Nigerian who decided to live wherever they want to,\" he stated.\n“Those who are residents there should keep us informed and those of us who are monitoring from here should also keep ourselves informed about what is happening.\""
  },
  {
    "headline": "\"Its Biggest Threat To The North\"—Northern Youths Praise Southern Governors For Banning Open Grazing",
    "summarized_story": "Forty-two northern youth groups have endorsed the ban on open grazing in the country.\nFile PhotoSouthern governors had penultimate week issued a ban on open grazing in the Southern part of the country.\nHe said, \"We have taken time to study the communique issued by the southern governors, especially on the ban on open grazing.\n\"To the ban on open grazing, we call for the establishment of Herders Commission or Agency to cater to the needs of the herders.\n\"We also condemned the statement credited to the Attorney General of the Federation on the ban on open grazing."
  },
  {
    "headline": "UI: We’re yet to fix date for physical resumption",
    "summarized_story": "The University of Ibadan (UI) says it has not fixed a date for physical resumption for students of the institution for the rest of the 2020/2021 academic session.\nFaluyi said an ad hoc committee had been set up to propose a date and implement plans for the physical resumption of students.\n“This is to inform the university community and the public, especially staff, students, parents and guardians, that management has not fixed any date for the physical resumption of academic activities for the rest of 2020/2021 academic session,” the statement read.\nAdvertisement“At its meeting on Monday, 17th May, 2021, Senate discussed all matters relating to the physical resumption of academic activities for the rest of the 2020/2021 academic session, and decided to set up an Ad-hoc Committee, to propose a date and implementation plan.\n“The committee is expected to submit its report on Monday, 24th May, 2021, for the consideration of management.”The registrar enjoined the public to discard reports in some quarters that the varsity had already announced physical resumption."
  },
  {
    "headline": "SPOTLIGHT: Age shouldn’t be a barrier, says Nigerian dad who bagged BSc at 67",
    "summarized_story": "AdvertisementOn Friday, the varsity staged its 15th convocation ceremony and also graduated 201 students with first-class; 793 with second-class upper, 595 with second-class lower, 75 with third-class, and 254 postgraduate students.\nOlaseinde completed a five-year programme in Business Administration with a second-class upper rating (2:1).\nI haven’t had a university degree before.\n“I came out with second-class upper, having narrowly missed the first class.\nAge shouldn’t be a barrier.”Reacting to Olaseinde’s achievement on Friday, Oluwatosin, his daughter who first made the feat public, tweeted: “My dad inspires me."
  },
  {
    "headline": "VC saga: Sanwo-Olu dissolves LASU governing council",
    "summarized_story": "Babajide Sanwo-Olu, governor of Lagos, has again cancelled the selection process for the appointment of the ninth substantive vice-chancellor at the Lagos State University (LASU).\nAdvertisementIn a statement on Friday by Gbenga Omotoso, the state commissioner for Information and strategy, the governor ordered the immediate dissolution of the varsity’s governing council.\n“In due course, a new Governing Council for the Lagos State University will be constituted.\nThe Acting Vice-Chancellor and Management of the University are hereby directed to elect new council members from the Senate.\nAdvertisementThe senate of the institution later appointed Damola Oke, the deputy vice-chancellor, administration, as the acting vice-chancellor."
  },
  {
    "headline": "Don’t resume strike, Lalong begs Plateau varsity lecturers",
    "summarized_story": "Simon Lalong, governor of Plateau, has pleaded with the Academic Staff Union of Universities (ASUU) at the state varsity to shelve plans to resume its suspended strike over the non-payment of its N70 million earned academic allowances (EAA).\nAdvertisementAccording to NAN, Sunday Hyat, the state head of service (HOS), on Friday, said there are ongoing efforts to address the union’s grievances.\nThe ASUU chapter of the Plateau State University (PLASU) had embarked on strike in January over issues bordering on allowances and infrastructure development.\nNAN, however, reported that since the lecturers returned to the classrooms, the state government has not released the money to them as promised.\nThe situation is said to have heightened tension and agitation amongst members of the union for the resumption of the suspended strike."
  },
  {
    "headline": "Tchidi Chikere reacts amid rumoured collapse of marriage",
    "summarized_story": "Tchidi Chikere, Nigerian movie producer and actor, has reacted amid rumoured collapse of his marriage to Nuella Njubigbo.\nBut rumours of a potential crack in their marriage swirled a few weeks ago after Sophie Williams, Chikere’s ex-wife, hinted that the union had crashed.\n“Wetin dey happen to one love made in heaven?” Williams had written in the now-deleted post.\nBut shortly after the development, the couple had attracted attention to their union after they unfollowed each other on Instagram.\nChikere had on Saturday shared several posts suggesting that the marriage may be witnessing some challenges."
  },
  {
    "headline": "NCC plans to deploy Device Management System to prevent phone theft",
    "summarized_story": "Two weeks after the Nigerian Communications Commission (NCC) said it had issued 54 million people their national identity numbers, it is in the process of deploying a Device Management System (DMS).\nA Device Management System will take this step even further, allowing the government even more access to what should be private information.\nWhen there’s a central registry for IMEI, the police could identify the owners of lost and stolen phones thousands of times daily.\nA critical part of this paper argues for a central database of mobile phones that law enforcement agencies presumably can access.\n*An earlier version of this report stated that the NCC asked telcos to register the IMEI numbers of their subscribers; the NCC has now clarified its position"
  },
  {
    "headline": "How to build high-performance teams with Chichi Offodile and Seni Sulyman",
    "summarized_story": "In what can be termed a mini-MBA session, Seni Sulyman and Chichi Offodile in an edition of TechCabal Live shared expert advice on how to build high-performance teams.\nTheir Journey at Helium Health and AndelaThe conversation begins with Chichi and Seni talking about their journeys at Helium Health and Andela respectively.\nHer strength lies in figuring out how to build a sustainable company and that’s what she set out to do via a transformation plan.\nBoth Seni and Chichi believe that it starts with hiring people with the potential to be high achievers and then setting a good example as a leader.\nHe ends with a caveat – it’s a little difficult to build a high-performing team without working really hard."
  },
  {
    "headline": "Stax wants you to enjoy USSD with better design, without ever dialling codes again",
    "summarized_story": "—Most people who started using mobile phones in the 2000s became familiar with USSD through loading and checking airtime balance.\nMaking USSD smartStax is a mobile app currently available only to Android users in 10 countries, including Nigeria, Uganda, Kenya and Tanzania.\nWhen a user gives Stax access, the app activates a screen reading functionality and acts as a web browser.\nStax wants the app to be under 10MB so that it will work easily on every (Android) phone.\nWith a large user base, Stax could begin enabling discovery and access to third party services, in what could make Stax a super app of sorts."
  },
  {
    "headline": "Are you ready to Branch in?",
    "summarized_story": "Here are a few more things that sets Branch apart from both your regular banking and other financial apps.\nBonus programs: Most financial apps have some form of bonus program but none of them is like Branch.\nWhereas other financial apps pay one-time bonuses for referrals, Branch pays you N500 when friends you refer pay up their first loan.\nThe money part: Branch gives you up to N500,000 in loans within seconds of applying on the app.\nClearly, Branch offers you more flexibility and a lot more profit than other financial apps."
  },
  {
    "headline": "Founders of TradeDepot selected as Endeavor Entrepreneurs",
    "summarized_story": "Fast-growing retail distribution platform in Africa joins the leading global entrepreneur support organizationLagos, May 20 — Endeavor Nigeria has welcomed three new entrepreneurs into its global network.\nOnyekachi Izukanne, Michael Ukpong, and Ruke Awaritefe, the co-founders of TradeDepot, were selected as Endeavor Entrepreneurs on May 18, 2021, at the 15th Virtual International Selection Panel (v-ISP #15).\nThe Endeavor network includes some of the world’s most exciting scale-up entrepreneurs and most experienced mentors and investors.\nTo date, Endeavor has screened more than 60,000 individuals and selected more than 2,000 founders leading over 1,200 scale-up companies.\nIn Nigeria, we aim to select 4-6 companies a year and today there are 19 Endeavor Entrepreneurs who are leading 11 companies in the portfolio."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "App review – How does Bitnob work?",
    "summarized_story": "At first glance, the Bitnob app feels fantastic, with a simple UI and easy-to-find functions.\nGetting started with BitnobLet’s begin with the onboarding processAdvertisementCreating a new account on BitnobSetting up your Bitnob app begins with installing it from your app store.\nTo protect its users, Bitnob doesn’t let you buy BTC straight from your bank account.\nYou simply paste their address or scan their Bitnob BTC wallet address.\nFinal thoughtsOverall, the Bitnob app delivers an impressive performance."
  },
  {
    "headline": "App review – How does Bitnob work?",
    "summarized_story": "At first glance, the Bitnob app feels fantastic, with a simple UI and easy-to-find functions.\nGetting started with BitnobLet’s begin with the onboarding processAdvertisementCreating a new account on BitnobSetting up your Bitnob app begins with installing it from your app store.\nTo protect its users, Bitnob doesn’t let you buy BTC straight from your bank account.\nYou simply paste their address or scan their Bitnob BTC wallet address.\nFinal thoughtsOverall, the Bitnob app delivers an impressive performance."
  },
  {
    "headline": "Does the Nigerian government want safety or surveillance with its new IMEI policy?",
    "summarized_story": "From July 2021, the Nigerian Communications Commission (NCC) will require Nigerians to submit their IMEI numbers to a Centralised Equipment Identity Register.\nThe International Mobile Equipment Identity (IMEI) is a unique number used to identify a mobile phone.\nWith an IMEI number, a phone can be tracked, but more than that, it can also be used for identity theft and even cloning a phone.\nAdvertisementIf a phone owner possesses their IMEI number, they could provide law enforcement agencies with this information to track these phones if they are stolen.\nAdding IMEI data to this would mean that they can also get real-time location data on anyone."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "For Nigeria, it’s another quarter of tepid growth",
    "summarized_story": "There were no surprises in the latest gross domestic product (GDP) numbers published by the National Bureau of Statistics (NBS) on Sunday.\nRead Also: Nigeria needs 14% of GDP to meet SDG by 2030, says IMFAfrica’s largest economy expanded at a tepid 0.51 percent in the first quarter of 2021, a rate too slow to address the country’s record unemployment rate that’s the highest globally after Namibia.\nThe economy may take another year to return to its pre-pandemic levels, according to the IMF’s estimates.\nOil GDP contracted by 2.21 per cent in Q1 compared to a contraction of 19.76 per cent in Q4 2020 and growth of 5.06 per cent in Q1 2020.\nNon-oil GDP grew 0.79 per cent in Q1 compared to 1.69 per cent in Q4."
  },
  {
    "headline": "The Week Ahead",
    "summarized_story": "AGRICULTURECocoa prices are expected to decline in the coming week as a result of weak demand from Europe.\nHowever, Corn prices climbed by 1.49% Week on Week (W-o-W).\nMore of the same is expected in the week ahead as the Naira is anticipated to continue to hover around N406/$1-N412/$1 threshold.\nThe Nigerian Treasury Bills market continued its bearish sentiment for most of the previous week, however, the sentiments improved slightly at the end of the week.\nNIGERIAN CAPITAL MARKET OUTLOOKIn the coming week, we expect a likelihood of undulating trading sessions during the week."
  },
  {
    "headline": "How National Assembly’s blind loyalty to presidency destroys separation of powers",
    "summarized_story": "But National Assembly played their role; the electoral body played its role appropriately and the country was saved from going into crisis.\nIn Nigeria’s case, the nation’s Judiciary and National Assembly are extension of the Executive.\nOn a number of occasions, the National Assembly had discussed the seriousness of the insecurity situation in the country.\nA National Assembly that worth its salt protects the interest of the masses by prevailing on the Executive to do what is right.\nSome, out of mischief, describe the National Assembly as a rubber stamp, some out of misunderstanding."
  },
  {
    "headline": "Obaseki commits to sustaining biodiversity in Edo forests, protect reserves – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reiterated his commitment to sustaining the unique biological diversity in Edo forests, promising to sustain partnerships with investors to protect forest reserves and sustain the ecosystem.\nThe governor said this in commemoration of the International Day of Biological Diversity, marked by the United Nations on May 22, every year.\nWe are committed to preserving our ecosystem so that all elements are well aligned to meet our developmental needs.\n“This year 2021 the theme is “We’re part of the solution”.\nThe slogan was chosen to be a continuation of the momentum generated last year under the over-arching theme, ‘Our solutions are in nature’, which served as a reminder that biodiversity remains the answer to several sustainable development challenges.”..."
  },
  {
    "headline": "Tax compliance: EIRS visits govt multinational companies on enforcement drive – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State Internal Revenue Service (EIRS), has called on government institutions and multinational companies in Edo State to be tax compliant to avoid being sanctioned.\nThe charge was given during visits by the EIRS compliance team to the Nigerian Petroleum Development Company (NPDC) Liquified Petroleum Gas (LPG) Terminal in Ologbo and the Nigerian Bottling Company (NBC), both in Edo State.\nEIRS Executive Director, Income Tax, Prince Felix Isuku, stated: “the visit was to ensure that both organizations, and others operating in Edo State, comply with tax laws, as they are legally bound to do so.”He warned that “just as there are rewards for compliance, there are also sanctions.”Isuku reiterated the need for all organizations to ensure they register with the EIRS, deduct and remit Pay-As-You-Earn (PAYE), withholding taxes, pay haulage fees, carry out business premises registration and renewal fees, as well as ensure the verification of tax clearance certificates.\nIsuku stressed the need for organizations and multinationals in Edo to play their part towards achieving the plans of making Edo great again.\nThe Plant Manager, Nigerian Bottling Company (NBC), Irene Okpode, expressed appreciation to the EIRS team for the visit, promising a smooth working relationship with the Service and to sustain compliance with the tax laws."
  },
  {
    "headline": "Nigerian Navy cancels 65th anniversary over COAS death – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Chief of the Naval Staff, Vice Admiral Awwal Gambo, has directed the cancellation of events slated for marking the 65th anniversary of the Nigerian Navy.\nThis is contained in a statement by spokesperson for the Nigerian Navy, Commodore Suleman Dahun.\n“The CNS commiserates with the nation and offers the condolences of officers and ratings of the Nigerian Navy to Mr President.\n“The Nigerian Army and Nigerian Air Force as well as families of the departed.\nHe said that the death of Attahiru, a service chief, like his colleague in the navy, Vice Admiral Awwal Gambo, had put the army, navy, air force and the entire defence circle in sober mood."
  },
  {
    "headline": "Obaseki to send Executive bill on disability to EDHA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Edo State governor, Godwin Obaseki said his administration will formulate and send a new disability bill to the state house of assembly for consideration, after the Constitution of the state executive council.\nAccording to Obaseki, the disability bill sent to the house of assembly in 2012 by the previous administration, “was riddled with inconsistencies”.\nThe government maintained that the proposed bill will not only address the concerns of the PWDs, but also “Strengthen frame work of institutions that would see to proper response” for the group.\nMeanwhile, only 10 states in Nigeria has so far domesticated the Discrimination Against persons with Disabilities prohibition Act of 2018, signed into law by president Muhammadu Buhari in 2019.\nThe states are Anambra, Bauchi, Ekiti, Lagos, Kogi, Ondo, Plateau, Jigawa, Kwara and Kano."
  },
  {
    "headline": "COVID-19: World Health Assembly to focus on ending pandemic",
    "summarized_story": "When stakeholders gather on Monday to kick off the 74th session of the World Health Assembly, the World Health Organisation’s highest decision-making body, the focus will be on how to achieve global health security and pandemic preparedness.\nThe global health organisation said participants will brainstorm on how to urgently find innovative solutions to end the biting coronavirus pandemic and work towards averting similar outbreak anytime soon.\nCOVID-19The pandemic took the world by surprise, revealing a global failure to invest in pandemic preparedness.\nThree reports on COVID-19 response will be presented at the Assembly: the Health Emergencies Programme’s Independent Oversight and Advisory Committee (IOAC), the Independent Panel for Pandemic Preparedness and Response and the Review Committee on the Functioning of the International Health Regulations (2005) during the COVID-19 Response.\n“This year’s World Health Assembly will play a vital role in shaping the global health architecture of the future and strengthening WHO to fulfil its mission and mandate”, Ghebreyesus said."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Nigeria’s economy grows by 0.51% in Q1, 2021",
    "summarized_story": "OBINNA EZUGWUNigeria’s gross domestic product (GDP) increased by 0.51 percent in the first quarter of 2021, an improvement from 0.11 percent increase in the fourth quarter of 2020.\nThis is contained in the first-quarter GDP report released by the National Bureau of Statistics (NBS) on Sunday.\nMore later…"
  },
  {
    "headline": "Plateau gov, Lalong mourns death of NASCO founder, Ahmed Nasreddin",
    "summarized_story": "Simon Lalong, governor of Plateau, has condoled with the NASCO family, over the passing of the founder of the NASCO Group of Companies, Mr Ahmed Nasreddin, who died at the age of 97.\nThe governor in a condolence message by his Director of Press and Public Affairs, Dr Makut Macham, on Saturday in Jos, expressed grief over the death of the nonagenarians.\nThe governor described the death of the business man as a huge loss to Plateau people and Nigeria.\nHe praised the deceased as a visionary leader, who established NASCO in Jos in 1963, as the first jute bag factory in Nigeria and sub-Saharan Africa.\nHe assured the NASCO family of the support and collaboration of the state government in their operations, while praying for God to grant his soul eternal rest."
  },
  {
    "headline": "Nigerian lawmaker sacks aide who hailed Boko Haram leader, Shekau as ‘true hero’",
    "summarized_story": "A member of Nigeria’s House of Representatives, Abdulkadir Rahis, has dismissed his aide, Bukar Tanda, for describing the leader of Boko Haram terrorist group, Abubakar Shekau as a real hero.\nShekau reportedly killed himself by detonating his suicide vest on Wednesday after being captured by fighters of the Islamic State in West Africa Province (ISWAP), a breakaway faction of Boko Haram.\nCelebrating the terror leader’s action in a Facebook post on Thursday, Tanda praised him as a hero who died for the course he believed in.\nHe said Shekau “lived a live of hero and died a true hero.\nHe lived a life of a hero and died a true hero."
  },
  {
    "headline": "We’ve accreditation for courses we offer – OOU Pro Chancellor, Mosun Belo-Olusoga",
    "summarized_story": "Idowu Olakunle, AbeokutaThe Pro Chancellor and Chairman, Governing-Council of Olabisi Onabanjo University (OOU), Ago Iwoye, Mrs. Mosun Belo-Olusoga, says the institution now has 96.4 percent accreditation status for courses it offers.\nBelo-Olusoga made the disclosure today in Abeokuta when she led members of the institution’s governing council on visit to the state governor, Prince Dapo Abiodun in his office.\nShe told the governor that erring staff and students, through the university management and senate, had been disciplined after following established procedures.\nWe see that has greatly subsided and students are more focused on their academic activities and I think that is very impressive.\nWhile appreciating the Governing Council for the changes it has made in the curricular of the institution, the governor also commended the Council members for what they were able to achieve in terms of students’ welfare."
  },
  {
    "headline": "Minister To NRC: Arrest Buyers Of Vandalised Rail Tracks",
    "summarized_story": "Worried by the continuous vandalisation of rail tracks across the country, the minister of Transportation, Rotimi Amaechi, has asked the Nigeria Railway Corporation (NRC) to arrest buyers of vandalised rail tracks.\nReacting to the recent vandalisation of rail tracks on the Itakpe to Warri rail line, the minister said vandalism thrives because there are those who are willing to buy stolen equipments and if there are no buyers, vandals will stop.\nI have told the managing director of NRC to arrest the buyers of the equipment.\nADVERTISEMENT“We are not 100 percent ready for commissioning but if for nothing, we are 89 to 90percent ready for commissioning.\nOne thing is that by the time they give us a date, we will be ready for commissioning.”RELATED:"
  },
  {
    "headline": "Minister To NRC: Arrest Buyers Of Vandalised Rail Tracks",
    "summarized_story": "Worried by the continuous vandalisation of rail tracks across the country, the minister of Transportation, Rotimi Amaechi, has asked the Nigeria Railway Corporation (NRC) to arrest buyers of vandalised rail tracks.\nReacting to the recent vandalisation of rail tracks on the Itakpe to Warri rail line, the minister said vandalism thrives because there are those who are willing to buy stolen equipments and if there are no buyers, vandals will stop.\nI have told the managing director of NRC to arrest the buyers of the equipment.\nADVERTISEMENT“We are not 100 percent ready for commissioning but if for nothing, we are 89 to 90percent ready for commissioning.\nOne thing is that by the time they give us a date, we will be ready for commissioning.”RELATED:"
  },
  {
    "headline": "Plane Crash: Gov Makinde Mourns COAS, Oyo-born Asaniyi, Others",
    "summarized_story": "Governor ‘Seyi Makinde of Oyo State, on Sunday, described the death of the Chief of Army Staff, Lt. General Ibrahim Attahiru, and 10 others, including Oyo State-born Flight Lieutenant Taiwo Asaniyi, as a huge loss to Nigeria.\nHe said: “The deaths of Chief of Army Staff, Lt-General Ibrahim Attahiru, and 10 others in a plane crash in Kaduna came as rude shock.\n“It is my prayer that God will console the families they all left behind.\n“I particularly commiserate with President Muhammadu Buhari, the Armed Forces and especially the family of our brother, Flight Lieutenant Asaniyi, who is an indigene of Oyo State.\n“It is my prayer that God will console the families Asaniyi and others left behind and avert sad occurrences as this."
  },
  {
    "headline": "Plane Crash: Gov Makinde Mourns COAS, Oyo-born Asaniyi, Others",
    "summarized_story": "Governor ‘Seyi Makinde of Oyo State, on Sunday, described the death of the Chief of Army Staff, Lt. General Ibrahim Attahiru, and 10 others, including Oyo State-born Flight Lieutenant Taiwo Asaniyi, as a huge loss to Nigeria.\nHe said: “The deaths of Chief of Army Staff, Lt-General Ibrahim Attahiru, and 10 others in a plane crash in Kaduna came as rude shock.\n“It is my prayer that God will console the families they all left behind.\n“I particularly commiserate with President Muhammadu Buhari, the Armed Forces and especially the family of our brother, Flight Lieutenant Asaniyi, who is an indigene of Oyo State.\n“It is my prayer that God will console the families Asaniyi and others left behind and avert sad occurrences as this."
  },
  {
    "headline": "NAFDAC Destroys Fake Drugs, Others Worth N500m In North-East",
    "summarized_story": "The National Agency for Food and Drug Administration and Control (NAFDAC), said it has destroyed falsified medicines, unwholesome food and expired products worth N515,732,587 in the North-East region.\nDirector-general of NAFDAC, Prof. Mojisola Adeyeye, disclosed this on Sunday in a statement signed by the agency’s resident media consultant, Sayo Akintola.\nMedical devices such as disposable syringe, I.V given set, and PPE as well as imported falsified packaging materials for counterfeiting various NAFDAC regulated products,” she noted.\nREAD ALSO:Adeyeye expressed her happiness that the products destroyed could not found their way back to the markets with the resultant consequences.\nShe, however, assured the general public of continued NAFDAC collaboration with other agencies and stakeholders in ensuring that the prescribed standards of identity, safety, quality, and efficacy of regulated products are met."
  },
  {
    "headline": "Primate Ayodele Warns APC Chairman, Buni : “Don’t fly in October, another plane crash may happen”",
    "summarized_story": "The leader Of INRI Evangelical Spiritual Church, Primate Elijah Ayodele has said God showed him another plane crash in Nigeria.\nPrimate Ayodele said Nigerians need to pray against the crash of another military aircraft that will claim the lives of some important personalities.\nThe man of God revealed this during a live service and was contained in a statement forwarded to DAILY POST.\nIn these warnings, he called on the All Progressives Congress, APC, interim chairman, Mala Buni not to travel in October by air with his team on the same aircraft because he foresees danger happening.\n‘’The governor of Yobe State, Mala Buni, who is also the interim chairman of the APC should avoid flying by air on the 2nd and 3rd Of October, 2021 with his reconciliation team on the same aircraft."
  },
  {
    "headline": "UNIABUJA graduate who went to collect her result found dead & naked inside gutter",
    "summarized_story": "Following recent ‘haunting’ of ladies by evil doers in the country, another sad occurence has happened.\nA UNIABUJA female graduate who has gone to collect her result was found naked and dead inside a gutter.\nREAD ALSO: Buhari approves process to replace retired Perm SecReports have it that the deceased, Otunla Blessing who studied English language at the University traveled from Oyo State to Abuja was found naked in a gutter in Student Village, Iddo Sarki, Abuja on Saturday May 22, 2021, fueling speculations that she might have been raped before being murdered and dumped there."
  },
  {
    "headline": "FUOYE VC to Reinstate Suspended ASUU Leader — Daily Times Nigeria",
    "summarized_story": "Fashina spoke in Oye Ekiti, headquarters of Oye Local government during an event marking his 100 days in office.\n“We are also blocking leakages to be able to raise our IGR and these have been paying off”.\n“Nigeria only pays lip service to agriculture .We only do farming with our mouths.\nAgriculture has a lot of value chain, to me, farming is a way of life”.\nThe VC said he would place high premium on welfare of workers by ensuring timely promotion, payment of salaries and benefits, provide affordable transport system and security of students and staff."
  },
  {
    "headline": "Chinese commercial drones favored by South African farmers — Daily Times Nigeria",
    "summarized_story": "A South African drone company recently launched a test for an agricultural sprayer drone in a farm in Clanwilliam area of the Western Cape province.\nAccording to him, the company only uses drones manufactured by DJI, a Chinese technology company, for agricultural spraying.\nEnvironmental protection efforts are another reason for South African farmers to favor the Chinese drones.\nSrigale is a grower of rooibos who prefers DJI drones because of their performance in environmental protection.\nChinese tech products are innovative and cost-effective, Tangocci said, whose company has also purchased many products manufactured by Chinese tech giant Huawei."
  },
  {
    "headline": "Akeredolu endorsed our Yoruba Nation rally in Akure – Sunday Igboho",
    "summarized_story": "The Ondo State capital, Akure, was on Saturday agog as hundreds of Yoruba Nation agitators, under the aegis of Ilana Omo Oodua, trooped to the town from neighboring South-West states for a rally.\nSpeaking at the palace of the Deji of Akure, Oba Aladelusi Aladetoyinbo, Igboho said the agitators did not plan to stop their campaign until the Yoruba Nation became a reality.\nHe said, “Traditional rulers are supposed to be the father of all but they have been relegated and I believe all these anomalies would end when Yoruba Nation comes to being.\nNo going back on the agitation, no election in 2023 and I have a strong belief that we are going to succeed.”Igboho said the Yoruba Nation agitators had the support of the Ondo State Governor, Rotimi Akeredolu, to hold a rally in Akure.\nAll we want is Yoruba Nation,” Igboho declared."
  },
  {
    "headline": "Akeredolu endorsed our Yoruba Nation rally in Akure – Sunday Igboho",
    "summarized_story": "The Ondo State capital, Akure, was on Saturday agog as hundreds of Yoruba Nation agitators, under the aegis of Ilana Omo Oodua, trooped to the town from neighboring South-West states for a rally.\nSpeaking at the palace of the Deji of Akure, Oba Aladelusi Aladetoyinbo, Igboho said the agitators did not plan to stop their campaign until the Yoruba Nation became a reality.\nHe said, “Traditional rulers are supposed to be the father of all but they have been relegated and I believe all these anomalies would end when Yoruba Nation comes to being.\nNo going back on the agitation, no election in 2023 and I have a strong belief that we are going to succeed.”Igboho said the Yoruba Nation agitators had the support of the Ondo State Governor, Rotimi Akeredolu, to hold a rally in Akure.\nAll we want is Yoruba Nation,” Igboho declared."
  },
  {
    "headline": "Again, militants kill 15 people at baptism in Burkina Faso",
    "summarized_story": "A group of militants on Wednesday opened fire and killed 15 civilians during a baptism in Burkina Faso, reports on Thursday said.\nThe attack took place overnight in a village in the north of the country, the regional governor said in a statement.\nBurkina Faso has seen a significant increase in terrorist attacks since 2015.\nAn Irishman and two Spaniards were earlier killed in an attack on a military convoy at the end of April.\nVanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Again, militants kill 15 people at baptism in Burkina Faso",
    "summarized_story": "A group of militants on Wednesday opened fire and killed 15 civilians during a baptism in Burkina Faso, reports on Thursday said.\nThe attack took place overnight in a village in the north of the country, the regional governor said in a statement.\nBurkina Faso has seen a significant increase in terrorist attacks since 2015.\nAn Irishman and two Spaniards were earlier killed in an attack on a military convoy at the end of April.\nVanguardShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Akeredolu to Igboho, others: You’re on your own",
    "summarized_story": "By Taiwo OkanlawonGovernor Rotimi Akeredolu of Ondo State has denied supporting agitation for Yoruba Nation in the South-West region.\nHe spoke for the second time on the issue after self-acclaimed Yoruba activist, Sunday Adeyemo also known as Sunday Igboho said Akeredolu, who is the Chairman of the South-West Governors’ Forum, was supporting the movement of Yoruba Nation.\nAll we want is Yoruba Nation.”However, Akeredolu in a statement signed by his Chief Press Secretary, Richard Olatunde, on Sunday, said Igboho and other secessionist agitators were on their own.\nGovernor Akeredolu stands by a virile, united, and indivisible Nigeria as demanded by the Southern Governors’ Forum.\n“It is important, therefore, to state without any equivocation that the Yoruba Nation secessionist promoters do not enjoy any lending hand in Governor Akeredolu.”"
  },
  {
    "headline": "Arsenal missing in Europe next season first time in 25 years",
    "summarized_story": "By AbankulaArsenal FC won’t be playing in Europe next season for the first time in 25 years, despite winning their last game by beating Brighton 2-0.\nThe Gunners missed Europa League cut after Tottenham rallied to beat Leicester 4-2 and retained the 7th spot on the league.\nChelsea picked the last slot for Champions League, behind League champions, Manchester City, Manchester United and Liverpool.\nUnder manager Mikel Arteta, Arsenal had a torrid season, marked by inconsistency and under par performance, in all competitions.\nThey ended the league season, just like last year in 8th, with 61 points, just one behind Tottenham, in 7th with 62 points."
  },
  {
    "headline": "Brazil-based Nigerian drug lord Enwereaku busted with N8bn worth of cocaine",
    "summarized_story": "The drug lord, Ejiofor Felix Enwereaku, who leads a syndicate was arrested at the airport on Friday 14th May, 2021 for importing 27.95kg of cocaine using their organised criminal gang, which specialises in tagging/planting drugs in innocent travellers’ luggage.\nThe disclaimed bag was promptly secured by NDLEA operatives for investigation.\nAccording to NDLEA spokesman, Femi Babafemi, in a statement, on Sunday, 9th May, 2021, a man came to the airport to make inquiry on how to get the disclaimed bag released.\n“The disclaimed bag was opened in the presence of the arriving passenger and the man who came to negotiate the release of the disputed bag.\nWhen it was opened, it was found that the bag contained 36 blocks of cocaine, weighing 27.95kg."
  },
  {
    "headline": "Chief Of Army Staff: General Attahiru’s Possible Successors Emerge",
    "summarized_story": "The search for a replacement to Lt. General Ibrahim Attahiru, the late Chief of Army Staff (COAS), has begun.\nBrig-Gen. Kuliya, the Chief of Military Intelligence, and Brig-Gen. Olayinka, the Provost Marshall, were among those killed.\nMajor General Danjuma Ali-Keffi, the General Officer Commanding (GOC) of the Nigerian Army’s 1st Division in Kaduna, is rumored to be the next COAS.\nBeyond seniority, a senior military commander told PRNigeria that several considerations are examined when service chiefs are appointed.\nHe is currently the Theatre Commander Operation in the North-East and was previously the General Officer Commanding Officer of 1 Division."
  },
  {
    "headline": "Primate Ayodele Foresees Another Plane Crash, Terrorist Group After Boko Haram",
    "summarized_story": "The Leader Of INRI Evangelical Spiritual Church, Primate Elijah Ayodele, has warned that the Islamic State West Africa Province (ISWAP) will be deadlier than Boko Haram, adding that another group will come up after the latter.\nThe clergyman, who issued the prophecies while addressing his members, assured that Boko Haram’s leader, Abubakar Shekau is dead.\nAccording to Primate Ayodele: ‘‘Abubakar Shekau is dead and buried, anyone that claims to be Shekau is just a joker but ISWAP will become deadlier as they want to shoot down planes, another terrorist group will rise up through Boko Haram but will fade out soon.’’He also mentioned some states that should be on alert against deadly attacks and killings.\n‘’The following states must be very watchful of major attacks that will happen; Lagos, Abuja, Kaduna, Yobe, Bauchi, Plateau, Benue, Adamawa, Ekiti, Ondo, Oyo, Imo, Anambra, Ebonyi, Cross River.\nThey must not joke with this message,’’ he said."
  },
  {
    "headline": "Plane Crash: Buratai speaks on Attahiru, other military chief’s death",
    "summarized_story": "Tukur Buratai, the immediate past Chief of Army Staff and Ambassador Designate,says the death of General Ibrahim Attahiru and other senior military officers came at a time successes were being made on countering surgency operations, urging the military to close ranks to preserve their legacy.\nMr Buratai in his tribute to the late Lieutenant-General Ibrahim Attahiru described the incident as tragic to all Nigerians and peace-loving people, adding that Mr Attahiru and the officers that died with him were top-level officers whose records of service were admirable.\nHe noted that the tragic incident deeply depresses him as it robbed us of the services of the Chief of Army Staff who had left no one in doubt as regards his decision to succeed in the various military undertakings across the country.\n“He was at the verge of making the nation proud in the counterinsurgency and counterterrorism efforts when this tragedy occurred.\nAccording to him, they gave their lives in the line of duty and patriotic service to the nation."
  },
  {
    "headline": "Breaking: Saudi Arabia pegs entire 2021 Hajj slots for pilgrims at 60,000",
    "summarized_story": "Nigeria, which hirtherto got 95,000 Hajj quota, will share just 45,000 slots with over 60 countries of the World as Saudi embargoes Hajj for people under the age of 18 and above 60 yearsThe Kingdom of Saudi Arabia has pegged the global attendance for 2021 Hajj at only 60,000 with just 45,000 quota, out of this, slated for prospective pilgrims from outside the kingdom.\nThe announcement made by the Kingdom few hours ago via a twitter handle; @HaramainInfo sighted by Platforms Africa, noted that only 60,000 pilgrims will be allowed to perform the 2021 (1442) Hajj from across the world.\nThe breakdown shows that only 45,000 pilgrims will perform the Hajj from outside the Kingdom of Saudi Arabia and 15,000 from within.\n“Only 60,000 pilgrims in total for all countries to perform Hajj rituals for this year 2021 / 144245,000 pilgrims from outside KSA will be allocated and 15,000 from inside KSA.\nOnly 1,000 pilgrims from KSA performed a symbolic Hajj last year, a far cry from over two million Muslims that usually perform the religious ritual annually."
  },
  {
    "headline": "Breaking: Anthony Joshua gets order to defend WBO heavyweight title",
    "summarized_story": "Anthony Joshua has been ordered to defend his WBO heavyweight title against mandatory challenger Oleksandr Usyk after the apparent collapse of his bout with fellow Briton Tyson Fury.\nJoshua, who also holds the IBF and WBA belts, had agreed to face WBC champion Fury in Saudi Arabia.\nBut an arbitration hearing ruled Fury must first face Deontay Wilder.\nJoshua’s promoter had been given 48 hours to show why a fight with Usyk should not be mandated.\nEddie Hearn requested an extension until Monday to the “show cause” notice in order to “discuss the subject matter and other related affairs” with Joshua, but Usyk’s team objected."
  },
  {
    "headline": "Breaking – Attahiru: Nigeria’s Military engages independent probe as AIB-N recovers black box of crashed plane",
    "summarized_story": "The black box of a Nigerian Air Force Beechcraft 350 jet which crashed on Friday near the Kaduna International Airport has been recovered by the Accident Investigation Bureau, Nigeria (AIB-N) on Saturday.\nThe aircraft conveyed late Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, and 10 other military personnel who died on Friday.\nThe AIB-N, according to its mandate, only probes civil aviation accidents and incidents in Nigeria and not military accidents or incidents.\nBut Oketunbi said NAF mandated AIB-N to lead the investigation into the crash.\nAccording to the International Civil Aviation Organisation, the United Nations specialised agency for global aviation regulation, black boxes, also known as flight recorders, are one of the most relied upon resources for the improvement of aviation safety."
  },
  {
    "headline": "70% of Niger Delta Ministry budget to be channeled into East-West Road project- FG -NigPilot",
    "summarized_story": "Ministry of Niger Delta Affairs has disclosed that up to 70 percent of its 2021 budget would be channeled into the completion of the East-West road project.\nThis was disclosed by the ministry’s Permanent Secretary, Dr. Babayo Ardo, while inspecting the East-West road at Section IV (Eket Bypass Dual Carriage Way and Onne/Eket-Oron road) in Akwa Ibom State, over the weekend.\nHe assured that the ministry is working round the clock to ensure the completion of the East-West road.\nMinister of State, Ministry of Niger Delta Affairs (MNDA), Sen. Omotayo Alasoadura and I, have been on the East-West road for inspection, that section (I) which covers Warri in Delta State to Kaima in Bayelsa has already been completed last year”, he added.\nAccording to him, section (IV) of the East-West Road project is about 95.7 percent complete revealing, with few works remaining at the Deck-on-pile Section of Eket bridge."
  },
  {
    "headline": "COAS, others arrives National Military Cemetery for final journey to eternity -NigPilot",
    "summarized_story": "The remains of Chief of Army Staff , and 10 others who died in the ill-fated NAF Beachcraft 350 aircraft in Kaduna yesterday evening had arrived at the National Military Cemetery, Abuja for their last journey to eternity.\nRegrettably, President Muhammadu Buhari was absent as one of his commender, the Chief of Army Staff, Lt Gen Ibrahim Attahiru was laid to rest in Abuja.\nDefence expert who spoke in hush tongue at the burial said that President Buhari’s absent at shows high level of insensitivity.\nThis is even as the Chief of the Naval Staff (CNS), Vice Admiral Awwal Gambo directed the cancellation of the events marking the 65th Anniversary of the Nigerian Navy.\n“The CNS commiserates with the nation and offers the condolences of officers and ratings of the Nigerian Navy to Mr President, the Nigerian Army and Nigerian Air Force as well as families of the departed."
  },
  {
    "headline": "Education Ministry committed to producing best crop of teachers -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Asaba resolution: Malami is right – Pro Democracy Group -NigPilot",
    "summarized_story": "Pro-democracy group, Coalition For Defence Of Democracy In Nigeria, CDDN, has called for caution over the southern governor’s resolution on open grazing and the statement of the attorneys-general of the federation and minister of justice, Mr. Abubakar Malami (SAN).\nHe spoke following the ban of open graze ng by southern governors after a meeting in Asaba.\n”The context of the use of “spare parts” is about freedom of movement of goods and ownership.\nSpare part dealers move spare parts in ownership and possessive sense.\n”We also make bold to say that the Southern Governors’ declaration is a blanket statement lacking in precision and legally wrong."
  },
  {
    "headline": "Troops Rescue Scores Of Victims Kidnapped By Bandits In Kaduna",
    "summarized_story": "Troops of the Nigerian Air Force have rescued scores of kidnap victims in the Igabi Local Government Area of Kaduna State.\nHe said while they were trying to escape with their victims, a Nigerian Airforce fighter jet on aerial patrol quickly spotted their location and were able to rescue the kidnap victims.\nThe armed bandits according to the Commissioner were moving with the large number of women kidnapped from Ungwan Najaja when the air platforms traced them to the outskirts of the village.\nThe bandits had earlier injured one Hamza Ibrahim while moving out of the village with the kidnapped women, many of whom were housewives.\nIn another sad case, bandits have killed the personal driver of the Emir of Birnin Gwari, one Nasiru Muhammad."
  },
  {
    "headline": "Akeredolu Distances Self From Yoruba Nation, Declares Support For A United Nigeria",
    "summarized_story": "Ondo State Governor, Oluwarotimi Akeredolu, has denied the claim that he is in support of a Yoruba nation.\nHe, however, declared his commitment to a virile, united, and indivisible Nigeria as demanded by the Southern Governors’ Forum.\nAccording to Olatunde, some group of persons who participated in the rally held on Saturday claimed to have had the governor’s support for the march in which they were calling for Yoruba nation.\nHe insisted that Governor Akeredolu, who is also the Chairman of the South-West Governors’ Forum, never supported the quest for Yoruba nation outside of Nigeria, adding that the secessionist promoters do not enjoy any backing of the governor.\nAt the rally, a Yoruba rights activist, Sunday Adeyemo, popularly known as Sunday Igboho, was reported to have said Governor Akeredolu was aware and in support of their agitation for Yoruba nation."
  },
  {
    "headline": "Kaduna Crash: Reps Postpone Security Summit In Honour Of Attahiru, Others",
    "summarized_story": "The House of Representatives has postponed the planned security summit scheduled to hold on Monday.\nAkubueze also expressed the House’s grief and sorrow of the families of the late top military officers, praying that the Almighty God will grant them eternal rest.\nREAD ALSO: Attahiru Was On The Verge Of Making Nigeria Proud – Buratai“The security summit will now kick off on Wednesday, May 26, 2021.\nIt should be noted that the postponement became necessary as the late Army Chief was one of the major stakeholders that would have taken part in the summit.\nGbajabiamila also “sent his condolences to President Muhammadu Buhari, the Nigerian military, and the Attahiru family over the loss."
  },
  {
    "headline": "Attahiru Was On The Verge Of Making Nigeria Proud – Buratai",
    "summarized_story": "The former Chief of Army Staff ( COAS) and Ambassador-Designate to the Republic of Benin, Lt Gen Rtd, Tukur Buratai has said that the late Chief of Army Lieutenant General Ibrahim Attahiru, was on the verge of making Nigeria proud before his death.\nThe former COAS in his tribute said the late Attahiru had left no one in doubt as regards his determination to succeed in the various military operations across the country.\nHe said he was making progress in the counterinsurgency and counterterrorism efforts when the tragedy occurred.\n“He was on the verge of making the nation proud in the counterinsurgency and counterterrorism efforts when this tragedy occurred.\nREAD ALSO: COAS Attahiru, 10 Others Buried In AbujaAttahiru and 10 other officers died in a plane crash on Friday evening."
  },
  {
    "headline": "How ‘Drug Lord’ Paid $24,500 Bribe To Compromise Operatives – NDLEA",
    "summarized_story": "A suspected drug lord paid $24,500 in three tranches to compromise operatives of the National Drug Law Enforcement Agency (NDLEA).\nIn a statement on Sunday in Abuja, the agency’s spokesman, Femi Babafemi, identified the suspect as Ejiofor Enwereaku.\nAccording to the NDLEA, a man came to the airport the next day to make an inquiry on how to get the disclaimed bag released but he was promptly arrested for investigation.\nWhen the disclaimed bag was opened in the presence of the arriving passenger and the man who came for it, it contained 36 blocks of cocaine.\nA follow-up sting operation was carried out, which led to the arrest of Enwereaku upon his arrival from Addis Ababa onboard Ethiopian airline."
  },
  {
    "headline": "Nigerien leader, Mohamed Bazoum calls to condole with Buhari over Army Chief",
    "summarized_story": "Following the plane crash on Friday that killed Lt. General Ibrahim Attahiru, the Chief of Army Staff, and ten other military officers, President Mohamed Bazoum, the leader of Nigeria’s northern neighbor, Niger Republic, called President Muhammadu Buhari on Saturday to commiserate with him, as well as the government and citizens of Nigeria.\nPresident Bazoum, who described the plane crash and subsequent deaths as tragic and unfortunate, expressed the condolences of his government and people of his country.\nHe prayed to the Almighty Allah to repose the souls of the deceased and grant fortitude to their families, friends and the entire nation to bear the losses.\nPresident Buhari responded by commending President Bazoum for sharing this time of grief with Nigerians and assuring him that the gesture was appreciated.\nHe expressed the nation’s appreciation and gratitude for the sacrifices of the departed military men and promised that the nation will not let their families down."
  },
  {
    "headline": "Buhari condoles with family of fmr President of the Senate over death of son Pharaoh",
    "summarized_story": "President Muhammadu Buhari on Sunday condoled with the family of former Senate President, the late Chuba Okadigbo on the death of their son, Pharaoh Okadigbo.\nPresident Buhari expressed his sadness at the news of the death, saying, “It is very sad to lose such a talented young man with so much potential and enthusiasm for youth participation in Nigeria’s socio-political growth.”The President stated that the late Pharaoh had a vision for a better Nigeria from an early age, one that he (the President) shared with the late Chuba, who was his running mate in the 2003 presidential election.\nPresident Buhari added that the nation will miss a firm believer in the necessity for the people to work in collaboration with governments at all levels to achieve the better society we all wish for.\nHe prayed that God Almighty will comfort family, friends and associates, and repose the soul of the departed."
  },
  {
    "headline": "Severe Weather Kills 21 Ultramarathon Runners in China",
    "summarized_story": "The race was halted when some of the 172 runners went missing, and a rescue operation was launched.\nHigh winds and freezing rain hit participants in the 100km (60-mile) ultramarathon in the Yellow River Stone Forest, a tourist site in Gansu province, on Saturday.\nOfficials said 151 runners were now confirmed safe, and that eight of them were injured.\nSurviving participants said the forecast had shown some wind and rain was anticipated, but nothing as extreme as what they experienced.\nShe headed back to the hotel after previous experience with hypothermia but others continued or were already in worst hit areas."
  },
  {
    "headline": "Hamas Defiant with Military Parade, Appearance of Top Leader",
    "summarized_story": "Hundreds of masked Hamas fighters brandishing assault rifles paraded in Gaza City and the group’s top leader made his first public appearance on Saturday, in a defiant show of strength after the militants’ 11-day war with Israel.\nIn the fighting, Israel unleashed hundreds of airstrikes against militant targets in Gaza, while Hamas and other militants fired more than 4,000 rockets toward Israel.\nOn Saturday, hundreds of Hamas fighters wearing military camouflage paraded past the mourning tent for Bassem Issa, a senior commander killed in the fighting.\nThe top Hamas leader in Gaza, Yehiyeh Sinwar, paid his respects in his first public appearance since the war began.\nPrime Minister Netanyahu said Friday that more than 200 militants were killed, including 25 senior commanders."
  },
  {
    "headline": "EU Considers Ghana as Covid Vaccine Manufacturing Hub, Removes West African Country from Money Laundering List",
    "summarized_story": "The European Union has announced plans to remove Ghana from the list of countries that are deficient anti-money laundering and terrorism financing.\nLast month, United Kingdom exempted Nigeria from its list of high-risk countries for money laundering.\nUntil the end of the Brexit transition period, the list of high-risk countries was determined by the European Union under the 4th Anti Money Laundering Directive.\nThe EU said the nations in this category pose a threat because of lax controls on terrorism financing and money laundering.\n“These Regulations amend the Money Laundering, Terrorist Financing and Transfer of Funds (Information on the Payer) Regulations 2017 (S.I."
  },
  {
    "headline": "Anthony Joshua Ordered to Defend WBO Heavyweight Title against Aleksandr Usyk",
    "summarized_story": "Anthony Joshua has been ordered to defend his WBO heavyweight title against mandatory challenger Oleksandr Usyk after the apparent collapse of his bout with fellow Briton Tyson Fury.\nJoshua, who also holds the IBF and WBA belts, had agreed to face WBC champion Fury in Saudi Arabia.\nBut an arbitration hearing ruled Fury must first face Deontay Wilder.\nJoshua’s promoter had been given 48 hours to show why a fight with Usyk should not be mandated.\nEddie Hearn requested an extension until Monday to the “show cause” notice in order to “discuss the subject matter and other related affairs” with Joshua, but Usyk’s team objected."
  },
  {
    "headline": "Lure of Oil Wells: Why Cross River Governor Ayade Defected to Nigeria’s Ruling Party",
    "summarized_story": "New facts have shown that economic factors far more outweighed the political reasons that necessitated the recent defection of the Cross River State governor, Ben Ayade, from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC).\nA top source within the National Working Committee (NWC) of the PDP said the economic issue played out more than the governor losing the PDP structures in the state.\nIta-Giwa, who was a founding member of All Nigeria People’ Party, ANPP has moved between PDP and APC four times since 1999.\nHowever, the national leadership of the PDP, a source claimed, believed that Ayade lost the control of the party structures in the state due to his complacent attitude to party issues.\n“It was after this slumber that he woke up and demanded that the NWC should intervene and restore the party structures to him."
  }
]