[
  {
    "headline": "FG hails US for removing Nigeria from religious freedom blacklist",
    "summarized_story": "The Federal Government has described as fair and justice the move by the United States which removed Nigeria from the list of countries with religious freedom concerns.\nThis was disclosed by the Special Assistant To The President on Media, Segun Adeyemi, titled ‘FG Hails US For Removing Nigeria From Religious Freedom Blacklist.’The statement said the Minister of Information and Culture, Lai Mohammed reiterated his earlier stand when Nigeria was put on the list last year, that the country does not engage in religious freedom violation or have a policy of religious persecution.\nHe said Nigeria jealously protects religious freedom as enshrined in the country’s constitution and takes seriously any infringements in that regard.\n“We will continue to ensure that every Nigerian has the freedom to practise his or her own chosen religion or belief without hindrance,” the Minister said while commending religious leaders in the country who have been working to ensure religious harmony."
  },
  {
    "headline": "EndSARS: Sanction Malami, Lai Mohammed, others who tried to cover up Lekki shootings, Falana tells FG",
    "summarized_story": "Human rights lawyer, Femi Falana (SAN), says all those who tried to cover up the shootings at the Lekki toll gate on October 20, 2020, must be sanctioned for complicity.\nLagos State Governor, Babajide Sanwo-Olu, who received the report on Monday, constituted a Committee to bring forward a White Paper within the next two weeks to be considered by the Lagos State Executive Council.\nSpeaking on Thursday, Falana said those who released the Lekki panel report feared cover-up by the government, hence, they released the report to the public to know their findings.\nThe human rights lawyer noted that Mohammed, Malami, the LCC and all those who tried to cover up the killings at Lekki must be sanctioned.\nIf by the time the (Lagos State) government issues its White Paper, recommendations are made and these people are not prosecuted, that is not the end of the matter."
  },
  {
    "headline": "Lai Mohammed hails US for removing Nigeria from Religious Freedom Blacklist",
    "summarized_story": "The Federal Government has hailed the United States for removing Nigeria from its list of countries with religious freedom concerns, calling the decision fair and just.\nIn a statement issued in Paris, France, on Thursday, Minister of Information, Lai Mohammed reiterated Nigeria’s earlier stand when it was put on the list in December 2020, that it does not engage in religious freedom violation or have a policy of religious persecution.\nHe said Nigeria jealously protects religious freedom as enshrined in the country’s constitution and takes seriously any infringements in that regard.\nHe commended religious leaders in the country who have been working to ensure religious harmony.\nA statement issued by Anthony Blinken, United States Secretary of State on Wednesday, announced the removal of Nigeria from the list of countries that limit religious freedoms around the world."
  },
  {
    "headline": "Why we increased transport fare to 100 naira in Calabar — Commercial Drivers",
    "summarized_story": "Commuters groan, says price hike insensitiveBy Ike Uchechukwu – CalabarCommercial Drivers in Cross River State have concluded plans to hike transport fares from 50 to 100 naira for the shortest distance in Calabar, the state capital.\nVictor Okon, Director Of Operations, Unified Commercial Drivers Association of Cross River State, the various Unions stated that the increment was due to the incessant hike in fuel and spare parts price in the market.\nThe Drivers lamented that the prices of spare parts and fuel has quadrupled since 2015 and they can no longer bear the burden, so the increment was inevitable.\n“We the Commercial Drivers of Calabar Metropolis have decided to increase transportation fare from 50 to 100 naira short distance due to high cost of spare parts, fuel and other commodities in the market.\nRecall that the Association for Table Water Producers of Nigeria ATWAP had earlier in the month increased the price bag of sachet water 200 naira per bag."
  },
  {
    "headline": "Afe Babalola slams WAEC, NECO for shift in exam calendars",
    "summarized_story": "…Says they are toying with students’ livesBy Adesina WahabThe Founder of Afe Babalola University, Ado-Ekiti, ABUAD, Aare Afe Babalola, SAN, has decried the shift in the examination calendars by the West African Examinations Council, WAEC and the National Examinations Council, NECO from April to June to between August and October in the year.\nThis, according to him, is negatively affecting the chances of final year secondary students to secure admission to tertiary institutions.\nConsequently, last year session ended in June and this year session began in September, 2021 in ABUAD and many other universities.\n“NECO on the other hand which used to conduct its examination between May and July conducted this year’s examination from July 5, 2021 to August 16, 2021.\nThe effect of this delay by both NECO and WAEC is most damaging for both students, parents and universities."
  },
  {
    "headline": "Nigeria’s economy grows by 4.03% in Q3, 2021 — NBS",
    "summarized_story": "Mr Simon Harry, the Statistician-General of the Federation and Head of National Bureau of Statistics, has declared that the nation’s economy grew by 4.03 per cent in the Third Quarter of 2021.\nHarry explained that the negative GDP figures recorded in 2020 as a result of the COVID-19 pandemic had serious base effects on the GDP figures for quarters two and three 2021.\nFor the oil sector, the report said that the nation, in the third quarter of 2021 recorded an average daily oil production of 1.57 million barrels per day (mbpd).\n“This sector was driven in third quarter 2021 mainly by trade, Information and Communication (Telecommunication), other drivers include financial and insurance (financial institutions) and manufacturing (food, beverage and tobacco).\nIt said, “Others are agriculture (crop production) and transportation and storage (road transport), accounting for positive GDP growth."
  },
  {
    "headline": "Davido raises N151m in a day hours after posting account details",
    "summarized_story": "4 million after he shared his account details on his social media platforms on Wednesday.\nHe wrote: “If you know I’ve given you a hit song…send me money… una know una selves ooo,” he initially wrote on instagram before adding his account details, “David Adeleke.”“Omo N7m in 10 minutes keep goin!!\naim na N100m, I wan clear my Rolls Royce from port abeg.”“I know say una love me but una love me like this.\nThe development has sent Nigeria’s social media agog, with comments and reactions causing social media traffic.\nWith the donations, Davido is said to have become one of biggest socialite and social media influencer in Africa."
  },
  {
    "headline": "NUT kicks against teachers taking part in competency test in Kaduna",
    "summarized_story": "The National Executive Council of the Nigeria Union of Teachers (NUT) has enjoined its members in Kaduna State not to take part in the competency test organised by the state government.\nDAILY POST recalls that the Kaduna State Universal Basic Education Board had in July announced plans to conduct competency test for primary school teachers to ensure quality teaching in the state.\nAccording to Mr. Kelvin Nwankwo, the union’s NEC was behind the decision of the Kaduna state wing.\nThe State Chairman, Mr Ibrahim Dalhatu, noted that only TRCN was legally empowered to conduct any form of competency test for teachers, said that teachers would not subject themselves to any test conducted by any other body.\nRecall that the state government had in January 2018 sacked 21,780 primary school teachers for failing a competency test conducted in 2017 and recruited 25,000 qualified ones."
  },
  {
    "headline": "HURIWA faults US for removing Nigeria from religious freedom blacklist",
    "summarized_story": "The Human Rights Writers Association of Nigeria, HURIWA, has carpeted the United States of America, USA, for unilaterally delisting Nigeria from a list of countries violating religious freedom.\nRecall that the US had on Wednesday delisted Nigeria from the list of countries violating religious freedom.\nUS Secretary of State, Antony Blinken, made this known in a statement on Wednesday.\nIn December 2020, the US had listed Nigeria among countries blacklisted for violating religious freedom.\nThe Rights group asked the President of the USA and the United States Congress to change the decision immediately."
  },
  {
    "headline": "Banditry: Group vows to support Matawalle’s peace initiatives in Zamfara",
    "summarized_story": "Responding, Matawalle said his government is particularly in dire need of the support of youths in the state who form the backbone in the drive to transform Zamfara into an enviable position.\nThe Matawallen Maradun said his administration will continue to support women and involve women in decision making in addition to appointing them to various political positions.\nEarlier, Ruwandorowa said she has led over 5,550 members across the 14 Local Government Areas of the state to declare their unflinching support to Governor Matawalle and his administration in the state.\nAccording to her, she has concluded her arrangements to organize a one-million women rally in support of Matawalle in Gusau, the state capital.\nThe occasion which took place at the Government House, Gusau, the state capital was attended by the Speaker Zamfara state House of Assembly Alhaji Nasiru Mu’azu Magarya, Chief of Staff Government House Malam Suleiman Ibrahim."
  },
  {
    "headline": "Sokoto: Tambuwal confirms 43 deaths in Illela bandits’ attack",
    "summarized_story": "Governor Aminu Tambuwal of Sokoto State on Thursday confirmed the killing of 43 persons in Monday’s bandits attack on Illela Local Government Area of the state.\nRecall that bandits attacked the town and some villages near it in the wee hours on Nov. 15, killing 13 persons in the first instance.\n“At the time of the governor’s visit on Wednesday, the death toll had risen to 43,’’ he stated.\nBello explained that the village head of Kalmalo, one of the five villages affected in the midnight attack was wounded.\nHe added that Tambuwal told the people of Illela that the government and people of Sokoto State felt their grief and extended their condolences."
  },
  {
    "headline": "Knee surgery: Gov Abiodun visits Osoba in London",
    "summarized_story": "Governor Dapo Abiodun of Ogun State has visited former Governor Olusegun Osoba in London, where he is recovering after a knee replacement surgery.\nAbiodun, who just returned from a foreign trip said the octogenarian was recuperating well.\nThe governor said he would be happy to welcome Osoba back to Nigeria in no distant time.\nHe said: “Earlier this week, I visited our leader and dear father, Aremo Olusegun Osoba, the former Governor of Ogun State who is in the United Kingdom for medical treatment.\n“Our highly revered Baba is recuperating very well following a knee surgery, and we all look forward to welcoming him back to our midst very soon.”"
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "‘Defendant left night before Ataga’s body was discovered’",
    "summarized_story": "Abubakar Mohammed, the security guard at the service apartment where SuperTV chief Usifo Ataga was murdered, yesterday maintained his earlier testimony that the first defendant, Chidinma Ojukwu left a night before Ataga’s body was discovered.\nMohammed restated this under cross-examination by counsel to first defendant, Onwuka Egwu before Justice Yetunde Adesanya at a Lagos High Court sitting at the Tafawa Balewa Square.\nAt the resumed hearing yesterday the witness said Miss Ojukwu left the apartment on Tuesday night and did not return to the premises even after the body was found.\nMohammed said he was able to identify the defendant at the police station during investigation “because she wears her face mask without covering her nose.\nThe police also asked her if she knew me and my name, and the defendant answered yes and mentioned my name, Abu”."
  },
  {
    "headline": "Bandits kill one, abduct 68 in Niger",
    "summarized_story": "By Justina Asishana, Minna, and Frank Ikpefan, AbujaNo fewer than 68 persons have been abducted from Zazzaga community in Munya council of Niger State.\nFour businessmen were abducted in Tegina, Rafi council of the state barely 48 hours before the Tuesday attack.\n- Advertisement -A source told the reporter on the phone that the bandits went from house to house, adding that four persons were shot.\nMunya council Secretary, James Isaac Jagaban, said one person was killed, adding that four others were being treated in hospital for gunshot wounds.\nThe union, which decried the silence of the Kaduna State government since their abduction, said the abductors have asked for N40 million as ransom."
  },
  {
    "headline": "Fake soldier tries to free detained suspect",
    "summarized_story": "A man dressed up as a soldier and went to secure the release of a detained suspect has been arrested in Niger State.\nEmmanuel Dominic, 28, was arrested when he went to Maitumbi police station in Minna to free his friend who was in custody, police said.\nHe was then arrested and interrogated whereupon he confessed that he was not a soldier but paraded himself as one in order to secure the release of his friend in police custody.\n- Advertisement -He said he grew up in an army barracks in Minna, adding that the uniform in his possession belonged to his late father who was a soldier.\nAbiodun said the suspect was possibly engaging in robbery with his wooden weapon."
  },
  {
    "headline": "Uneasy calm at APC HQs over protest threat by aggrieved members",
    "summarized_story": "From Romaus Ugwu, AbujaUneasy calm pervaded the national secretariat of the All Progressives Congress (APC), yesterday, as battle-ready police personnel took over the entire Blantyre Street housing the ruling party secretariat.\nThe situation was so tensed that women party members from Bauchi State that accompanied their leader on solidarity visit were not allowed access into the Buhari House for hours between 10am and 3.00pm.\nA member of the party’s internal security said the massive deployment was a response to threat from certain “disgruntled” party members.\nIt actually showed that some party members are really aggrieved and there is a limit to what they can do to continue to stop the protesters.\nAggrieved party members from Oyo State had equally stormed the party headquarters to demand the reconciliation of the warring factions in the state."
  },
  {
    "headline": "5 burnt to death as tanker explodes on Lagos-Ibadan Expressway",
    "summarized_story": "From Laide Raheem, AbeokutaNo fewer than five persons have been confirmed dead after a petrol tanker burst into flames yesterday morning at the Ogere section of the Lagos-Ibadan Expressway.\nHe said that the five persons who died were recovered from one of the crashed trucks and were burnt beyond recognition.\n“This development called for caution as the spill has affected some other vehicles parked at the shoulder of the road,“ the FRSC sector commander stated in the statement.\nThe sector commander added that the Fire Service in Sagamu, Police Traffic Division Ogere, and Gateway Police Station, Old Tollgate, Ogere, had been contacted.\n“Motorists are, hereby, enjoined to take alternative routes to avoid spending several hours in the traffic gridlock,” Umar submitted."
  },
  {
    "headline": "Nothing’ll stop Soludo’s swearing in –APGA",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHe said APGA followers started celebrating Soludo victory on November 7, 2021 and were still in celebration mood while many APGA faithful and other prominent Ndi Anambra would carry over the celebration of Soludo victory to 2022.\n“Many prophets of doom prophesied that Soludo will not win the election but he still won with a wide margin.\nThat is to say the hand of God is in his well-deserved victory.\nThe so-called Atasie will be put to shame on March 17 next year being the day Soludo will be sworn in."
  },
  {
    "headline": "FAAC allocation to FG, states, LGAs dips by N68.055bn",
    "summarized_story": "He noted that the N671.910 billion total distributable revenue comprised distributable statutory revenue of N363.849 billion, distributable Value Added Tax (VAT) revenue of N154.844 billion, exchange gain of N3.217 billion and N150 billion augmentation from the non-mineral revenue.\nOgubike confirmed that from the total distributable revenue of N671.910 billion, the Federal Government received N284.292 billion, State Governments got N209.838 billion, while Local Government Councils received N156.282 billion.\nThe sum of N21.498 billion was shared to the relevant states as 13 percent derivation revenue.\n“The distributable statutory revenue of N363.849 billion was available for the month.\nFrom this amount, the Federal Government received N180.551 billion, State Governments got paid N91.578 billion with the Local Government Councils receiving N70.603 billion."
  },
  {
    "headline": "Janguza 3,000-capacity correctional village ready for commissioning April 2022",
    "summarized_story": "The Federal Government of Nigeria has said the 3,000 capacity Nigerian Correctional Service (NCoS) Correctional Village being constructed in Janguza, Kano State, would be ready for commissioning in April, 2022.\n“In the period under review, we commenced the construction of 3000 modern capacity custodial center in each of the 6 geopolitical zones.\n“We have integrated the construction of life centers into the new 3000-capacity custodial facilities in each of the geo-political zones.\nOn reformation and rehabilitation of the inmates, the Minister revealed that there are 465 inmates running different degree programmes at the National Open University of Nigeria.\n“There are currently about 465 inmates running various Degree programs, 85 of the inmates are running Post – Graduate Degree programs, 4 are running PhD programs within the custodial facilities."
  },
  {
    "headline": "GDP Slows to 4.03% in Q3",
    "summarized_story": "James Emejo in AbujaNigeria’s Gross Domestic Product (GDP) growth rate slowed to 4.03 per cent in the third quarter of the year (Q3 2021) compared to 5.\n01 per cent in the preceding quarter, the National Bureau of Statistics (NBS) said Thursday.\nThe GDP measures the country’s economic performance from time to time.\nStatistician General/Chief Executive, National Bureau of Statistics,Dr. Simon Harry, at a media briefing said the negative impact of the COVID-19 pandemic continued to impact economic performance.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Kyari: Financing Major Impediment to Success of Global Energy Transition",
    "summarized_story": "Emmanuel AddehThe Group Managing Director of the Nigerian National Petroleum Corporation (NNPC), Mallam Mele Kyari, yesterday said getting appropriate financing for major projects remains key challenge in the global transition to renewable sources of energy.\n“I think the key challenge of the energy transition is financing what we need to do today, to produce gas and consume gas in the best possible manner and you can’t produce hydrogen without properly doing it.\nThe key challenges is financing and also realising that different countries have different circumstances, that jurisdictions are different and that we can’t move at the same pace,” he stated.\nHe urged proponents of the energy transition to appreciate the basic fact that the circumstances of every nation is peculiar and take it into consideration.\nOn the application of technology in the transition process, he added: “Artificial intelligence is the way to go in the future."
  },
  {
    "headline": "Buhari Sends Delegation to Sani Dangote’s Burial, Says Late Entrepreneur was Honest in Business, Exemplary",
    "summarized_story": "Buhari had earlier commiserated with the Dangote family in Kano on the demise of Sani.\nKano State Governor Abdullaahi Umar Ganduje also received the delegation and thanked the president for sending such a powerful delegation to the burial.\nIn his condolence message, Ganduje said, “We received the information about the passing away of this gentleman, Alhaji Sani Dangote, with shock.\nKano State, our dear country, Nigeria, and the business community have lost an illustrious son.\n“But to all of us, particularly those from Kano State, we lost a rare gem in the business community."
  },
  {
    "headline": "Again, Another Building Collapses in Lagos, Kill Four",
    "summarized_story": "Rebecca EjifomaFour persons, Wednesday, died and five others were injured after a two-storey building collapsed at Flour Mill Estate, Magbon in Badagry area of Lagos State.\nThe building, which was said to be under construction, crumbled at about 1pm.\nFive workers were rescued with various degrees of injuries and taken to Catholic hospital at Magbon.\nFarinloye added that the building was located behind a dwelling structure.\n“The building construction started about two years ago but was not completed."
  },
  {
    "headline": "October Revenue Drops as FG, States, LGs Share N671.910bn",
    "summarized_story": "From the amount, the federal government received N284.292 billion, the states (N209.838 billion), and local government councils (N156.282 billion) while the oil producing states received N21.498 billion as 13 per cent derivation revenue.\nThe VAT distribution saw the federal government taking N23.227 billion, the states received N77.422 billion, local governments got N54.195 billion.\nAlso, the Distributable Statutory Revenue of N407.864 billion received for the month was lower than the N692.283 billion received for the previous month by N284.419 billion, from which the federal government received N180.551 billion, states got N91.578 billion, local governmentss got N70.603 billion,N21.118 billion was allocated as 13 per cent mineral revenue).\nThe communiqué also indicated that Augmentations of N100 billion saw the federal government receiving N52.680 billion, states (N26.720 billion), local received N20.600 billion.\nThe sum of N50 billion from non-oil revenue was also shared with the federal government receiving N26.340 billion, state governments (N13.360 billion), and local governments N10.300 billion."
  },
  {
    "headline": "Nigeria's Police Inspector-General Stops Ejection Of Female Officers Married To Civilians From Barracks After SaharaReporters’ Story",
    "summarized_story": "The Inspector-General of Police, IGP Usman Alkali Baba says no female police officer in police barracks across the country will be ejected for residing with their civilian spouses.\nAccording to a police wireless message with reference number C8:0900/ENS/PROV/VOL.1/195, DTO:100800/11/2021 obtained by SaharaReporters, the women police personnel with their civilian husbands should vacate before January 31, 2022.\nUsman, who expressed anger about the “directive”, described it as unlawful, discriminatory, obnoxious, reprehensive and out of tune with the concept of equality in Nigeria’s Constitution.\nHe noted that the 'directive' is not in line with the Force Gender Policy which institutionalizes gender mainstreaming as a core value in the Nigeria Police Force.\n“The IGP further assures that the Force remains committed to advancing the general well-being, rights and privileges of its personnel, irrespective of rank or gender.”"
  },
  {
    "headline": "Nigeria's Police Inspector-General Stops Ejection Of Female Officers Married To Civilians From Barracks After SaharaReporters’ Story",
    "summarized_story": "The Inspector-General of Police, IGP Usman Alkali Baba says no female police officer in police barracks across the country will be ejected for residing with their civilian spouses.\nAccording to a police wireless message with reference number C8:0900/ENS/PROV/VOL.1/195, DTO:100800/11/2021 obtained by SaharaReporters, the women police personnel with their civilian husbands should vacate before January 31, 2022.\nUsman, who expressed anger about the “directive”, described it as unlawful, discriminatory, obnoxious, reprehensive and out of tune with the concept of equality in Nigeria’s Constitution.\nHe noted that the 'directive' is not in line with the Force Gender Policy which institutionalizes gender mainstreaming as a core value in the Nigeria Police Force.\n“The IGP further assures that the Force remains committed to advancing the general well-being, rights and privileges of its personnel, irrespective of rank or gender.”"
  },
  {
    "headline": "EXCLUSIVE: Bandits Inform Adamawa Community Of Impending Attack, Demand N30million Upfront",
    "summarized_story": "Bandits have sent threats to the Fa'a Gaya community in the Hong Local Government Area of Adamawa State demanding N30million ransom so that they would not invade and launch terror on the community.\n“Kidnappers have threatened to wipe out one village called Fa'a Gaya in Hong LGA of Adamawa State.\nWhy is it that the Nigerian government neglected its citizens and even hand them over to criminals kidnappers, bandits, Boko Haram and ISWAP terrorists?\n“Right now the leaders of Fa'a Gaya community are holding meetings because of the terrible tribulation and trauma that they are going through.\n“Until the criminals, terrorists will carry out their operation on innocent Nigerians before the security agencies start giving excuses for nothing!"
  },
  {
    "headline": "EXCLUSIVE: Bandits Inform Adamawa Community Of Impending Attack, Demand N30million Upfront",
    "summarized_story": "Bandits have sent threats to the Fa'a Gaya community in the Hong Local Government Area of Adamawa State demanding N30million ransom so that they would not invade and launch terror on the community.\n“Kidnappers have threatened to wipe out one village called Fa'a Gaya in Hong LGA of Adamawa State.\nWhy is it that the Nigerian government neglected its citizens and even hand them over to criminals kidnappers, bandits, Boko Haram and ISWAP terrorists?\n“Right now the leaders of Fa'a Gaya community are holding meetings because of the terrible tribulation and trauma that they are going through.\n“Until the criminals, terrorists will carry out their operation on innocent Nigerians before the security agencies start giving excuses for nothing!"
  },
  {
    "headline": "Lekki Massacre: House Of Representatives' Minority Caucus Wants Sacking Or Resignation Of Buhari's Minister, Lai Mohammed Over Denial",
    "summarized_story": "The Minority Caucus in the House of Representatives has reacted to the report submitted by the Lagos State Judicial panel on Special Anti-Robbery Squad (SARS)-related abuses.\nLai MohammedThe report found that the Nigerian Army and police fired live bullets at peaceful protesters at the Lekki Tollgate last year.\nThe Minority Caucus, therefore, urged Nigerians to remain calm, vowing to leave no stone unturned in using legislative instruments to join forces with other well-meaning Nigerians.\n“The report of the Lagos panel shows that no matter how lies and falsehood try to prevail, the truth will always triumph at the end.\nAlso, given the findings of the Lagos panel, the Minister of Information and Culture, Alhaji Lai Mohammed is expected to resign immediately or be fired by President Muhammadu Buhari."
  },
  {
    "headline": "NBS: Nigeria's economy grew by 4.03% in Q3 2021",
    "summarized_story": "Simon Harry, the statistician-general of the federation, has announced that the nation’s economy grew by 4.03 percent in the third quarter of 2021 (Q3 2021).\nAdvertisementFor the oil sector, the report said that the nation, in the third quarter of 2021 recorded an average daily oil production of 1.57 million barrels per day (mbpd).\nThis, it said, was lower than the daily average production of 1.67mbpd recorded in the same quarter of 2020 by 0.10mbpd and lower than the second quarter 2021 production volume of 1.61mbpd by 0.05mbpd.\n“This sector was driven in third quarter 2021 mainly by trade, Information and Communication (Telecommunication), other drivers include financial and insurance (financial institutions) and manufacturing (food, beverage and tobacco),” the report reads.\n“Others are agriculture (crop production) and transportation and storage (road transport), accounting for positive GDP growth."
  },
  {
    "headline": "NBS: Nigeria's economy grew by 4.03% in Q3 2021",
    "summarized_story": "Simon Harry, the statistician-general of the federation, has announced that the nation’s economy grew by 4.03 percent in the third quarter of 2021 (Q3 2021).\nAdvertisementFor the oil sector, the report said that the nation, in the third quarter of 2021 recorded an average daily oil production of 1.57 million barrels per day (mbpd).\nThis, it said, was lower than the daily average production of 1.67mbpd recorded in the same quarter of 2020 by 0.10mbpd and lower than the second quarter 2021 production volume of 1.61mbpd by 0.05mbpd.\n“This sector was driven in third quarter 2021 mainly by trade, Information and Communication (Telecommunication), other drivers include financial and insurance (financial institutions) and manufacturing (food, beverage and tobacco),” the report reads.\n“Others are agriculture (crop production) and transportation and storage (road transport), accounting for positive GDP growth."
  },
  {
    "headline": "43 killed in attack on Sokoto community, says Tambuwal",
    "summarized_story": "Aminu Tambuwal, governor of Sokoto, has confirmed the killing of 43 persons in an attack on Illela LGA of the state.\nThe bandits attacked the town and some villages around it on Monday, killing 13 persons in the first instance.\nHe added that Tambuwal told the people of Illela that the government and people of state felt their grief and extended their condolences.\nThis incident really touched us,’’ he quoted Tambuwal as saying.\nAdvertisement“Instead, this should motivate you to redouble your efforts without seeking revenge in securing your communities,’’ Tambuwal was quoted to have said."
  },
  {
    "headline": "43 killed in attack on Sokoto community, says Tambuwal",
    "summarized_story": "Aminu Tambuwal, governor of Sokoto, has confirmed the killing of 43 persons in an attack on Illela LGA of the state.\nThe bandits attacked the town and some villages around it on Monday, killing 13 persons in the first instance.\nHe added that Tambuwal told the people of Illela that the government and people of state felt their grief and extended their condolences.\nThis incident really touched us,’’ he quoted Tambuwal as saying.\nAdvertisement“Instead, this should motivate you to redouble your efforts without seeking revenge in securing your communities,’’ Tambuwal was quoted to have said."
  },
  {
    "headline": "Hope for Mambilla project as Sunrise Power waives $500m penalty for Nigeria",
    "summarized_story": "Sunrise Power Transmission Company of Nigeria Ltd (SPTCL) has agreed to waive the $500 million penalty fee incurred by the federal government over multiple defaults of a $200 million settlement agreement on the Mambilla hydroelectric power project in Taraba state.\nAdvertisementThere has been a legal tussle stalling the execution of the $5.8 billion project.\nThe company also joined Sinohydro Corporation Limited, the Chinese company currently handling the project, in the arbitration.\nAdvertisementSpeaking on the matter, Kayode Ajulo, a fellow of the Chartered Institute of Arbitrators, United Kingdom, described the decision by Sunrise Power as the best, as it signifies the end of all impediments relating to the Mambilla project.\n“The claim and any other ancillary expenses and or interest from the date the settlement agreement was signed to date, is the best negotiation ever the government has made."
  },
  {
    "headline": "Jumia records all-time high quarterly orders and unveils its fintech ambition",
    "summarized_story": "Sales and advertising expenses reached $24.0 million, up 228% year-over-year, while technology and content expenses increased by 27% to $9.4 million.\nHistoric number of quarterly ordersA major highlight from the report was that orders made on Jumia reached an all-time quarterly high of 8.5 million, representing a 28% year-over-year growth.\nClosely related to that, Jumia’s annual active consumers reached 7.3 million and its gross merchandise value (GMV) reached $238 million, both up 8% year-over-year.\nJumiaPay and its fintech ambitionIn the second quarter, JumiaPay—Jumia’s financial and digital services—posted its largest-ever quarterly GMV processed.\nSource: JumiaLogistics servicesFor its logistics service to third parties, Jumia reached a major milestone by recording $1 million revenue from this service."
  },
  {
    "headline": "Shuttlers raises $1.6 million to expand to Nigerian cities",
    "summarized_story": "Shuttlers, a logistics startup out of Lagos, Nigeria, has raised $1.6 million in seed funding to expand into African countries.\nWith its new raise, Shuttlers intends to try its wheels in more Nigerian cities before expanding beyond the borders of the country into other African countries.\nShuttling Lagos’ transportation systemIn 2016, Damilola Olokesusi founded Shuttlers to tackle the inefficient transportation system in Lagos, Africa’s most populous city.\nWith over 100 buses and 300 bus stops in Lagos, Shuttlers also claims to have recorded over 2 million trips since its inception in 2013.\n“Our mission at Shuttlers is to transform the way people commute around the world, by building a global partner network and connecting communities of shuttlers like we are presently doing in Lagos, Nigeria."
  },
  {
    "headline": "Sangu Delle is building a “tech-forward healthcare system” across Africa",
    "summarized_story": "This week, Africa Health Holdings, a healthcare startup that operates 40 medical facilities across three countries in Africa, said it has secured $18 million Series A funding.\nAfrica Health Holdings plans to deploy the funds towards building its “tech-forward healthcare system” across the continent.\nIn 2017, Delle took his learnings from all the healthcare investments he lead at GPI and founded Africa Health Holdings.\nSangu Delle, founder and CEO of Africa Health Holdings.\nThe next global healthcare frontierOn Monday, Nigeria-based DrugStoc also announced a $4.4 million Series A fundraising round, led by Africa HealthCare Master Fund, with participation from Vested World and German Development Bank."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "Technology, funding, learning models: What is the next frontier for edtech startups in Africa?",
    "summarized_story": "The edtech industry in Africa: the nowAccording to Briter Bridges, as of Q1 2020, there were 210 edtech startups in Africa.\nInterestingly, he believes that in the future, edtech will focus more on its adaptability and new learning models than technology.\nAccording to Yomi Ojo, Founder of SchoolsCompass, the divide between the haves and have nots is a huge challenge for the edtech industry.\nFundingAs of August 2021, Africa’s edtech industry has attracted $20 million in funding since 2019.\nThis trend will continue.”In September 2020, South African edtech startup, Valenture Institute, raised a $7 million Series A from GSV Ventures."
  },
  {
    "headline": "The Kredi Money story, Ozow’s $48m Series B, and blockchain skills with Bitmama",
    "summarized_story": "Share this article:Hi there,Today, I’m discussing:The Kredi Money storyOzow’s $48m Series BGetting blockchain skills with BitmamaThe Kredi Money storyKredi Money Co-founders, Afolabi Abimbola and Samuel OrjiFintech remains one of the biggest movers in Nigeria’s startup ecosystem.\nAdvertisementAnother fintech startup, Kredi Money, has joined the Nigerian fintech space combining several fintech offerings into one.\nEmmanuel Paul has that answer and more here: Led by ex-OPay exec, Kredi Money wants to be the one-stop-shop for payments, loans, insurance, other financial services.\nOzow’s $48m Series BThomas Pays, CEO and Co-Founder of OzowSouth African fintech startup, Ozow has closed a $48 million Series B to ease online payments for South Africans.\n: According to 101 Blockchains, the need for blockchain talent is fueled by the advantages of blockchain, such as security, transparency, and traceability."
  },
  {
    "headline": "Led by ex-OPay exec, Kredi Money wants to be the one-stop-shop for payments, loans, insurance, other financial services",
    "summarized_story": "Consequently, looking at Nigeria’s financial services space will reveal several startups with diverse financial use cases.\nBut for the founders of digital banking startup, Kredi Money, financial services consumers could receive a better experience.\nKredi money was pretty much the brainchild of their combined experiences in the market.\nFrom Left to Right: Samuel Orji, Co-founder Kredi Money, and Afolabi Abimbola, CEO of Kredi Money.\nAbimbola reveals that he wanted to lay the groundwork for a financial services company, before approaching institutional investors."
  },
  {
    "headline": "Aba-bound shoe materials, spare parts stuck in Onne Port",
    "summarized_story": "According to port users, imported containers now dwell for an average of 35 days at Onne Port due to the inefficiency of the Nigeria Customs Service (NCS) and other government agencies involved in cargo clearing.\nI know of many footwear industries that bring in their raw materials from Onne Port,” Tony Anakebe, managing director of Gold-Link Investment, a clearing and forwarding company, said in an interview with BusinessDay.\nRead also: Stakeholders seek end to extortion, harassment on Nigeria roadsAccording to Anakebe, all the Eastern markets including Onitsha Main Market, Ariaria International Market, and Nkwo Nnewi depend on Onne Port to bring in their goods.\nAnakebe, who noted that the major problem in Onne Port was the bad state of the access road, which has become a thorn in the flesh for port users, said there were other bottlenecks to the timely delivery of goods at the port.\nNoah Sheriff, commercial manager of the West African Container Terminal (WACT), told newsmen at the Onne Port in Rivers State recently that the 35-day long dwell time for containers was hampering efficiency at the Onne Port."
  },
  {
    "headline": "Days after COP26 deal, oil producers angle to pump more",
    "summarized_story": "While the ink on which the climate change agreement was written has barely dried, oil producers gathered at a conference in Abu Dhabi are angling to pump more crude oil to achieve what they call energy security.\nIt was a gathering where some of the biggest oil producers announced big plans for new oil fields.\nOn energy transition, he said the challenge was raising financing to improve gas production and consumption.\nOil producers at COP events are quick to rehash their climate commitments and pledges to invest more in renewables but when the rubber hits the road, they queue behind fossil fuels.\nThey warned that energy transition presents a big risk and needs to be managed so as not to harm their economies."
  },
  {
    "headline": "Nigerians enrolment in US universities hits 3yr low",
    "summarized_story": "The number of Nigerian students seeking admission in US universities dipped by 6.5 percent in 2020/2021, the lowest in three years, a BusinessDay analysis of new admission data shows.\nAnalysts attribute the decline to foreign exchange (FX) scarcity and difficulty in sourcing FX, thus making tuition fees expensive.\n“It is not surprising because the difficulty in sourcing for FX, volatility in the exchange rate, and uncertainty that persists in the exchange rate environment have made it too difficult to pay school fees,” Moses Ojo, a Lagos-based economic analyst, says.\nBefore the drop, the number of Nigerian students studying in the US has increased steadily since the 2011/2012 academic year from 7,028 to 13,762 in 2019/20.\nIt is also facing the problem of dilapidated infrastructure,” Peter Okebukola, former executive secretary of the National Universities Commission, said."
  },
  {
    "headline": "Edo govt intensifies removal of illegal structures under high tensions, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has intensified the demolition of illegal structures constructed under high tension cables and other unauthorized places in the Benin metropolis.\nThe exercise is aimed at removing structures by illegal developers and squatters that trade in unauthorized locations such as under the Transmission Company of Nigeria (TCN) High Tension Lines in the metropolis.\nAccording to her, “We are on a demolition exercise to remove illegal structures and traders under high tension/power line at Trinity Way, popularly known as Abuja Quarters.”“How can you do an illegal thing and try to legalize it?\nIf anything happens under this power line, who will be blamed?\n“We have given them ample time to move, but instead of them to move they are building more permanent structures under the power line."
  },
  {
    "headline": "Edo flags off outbreak response for circulating vaccine-derived poliovirus type 2 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Deputy Governor, Rt.\nComrade Philip Shaibu has flagged off the state’s Second Phase Outbreak Response (OBR) for Circulating Vaccine-Derived Polio Virus Type 2.\nThe flag-off ceremony, which was held at Eyaen Primary Healthcare Centre (PHC), Benin City, Uhunmwode Local Government Area of Edo State, was to kick-start a coordinated response to routine immunisation.\nShe explained that the novel oral polio vaccine (noPV2) is the modified version of the moPV that had been used in previous years.\nErhabor encouraged healthcare workers, community leaders and other opinion leaders to support the campaign to ensure its success."
  },
  {
    "headline": "Obaseki pledges sustained investment in healthcare, reassures of one healthcare centre for every ward in Edo – Nigerian Observer",
    "summarized_story": "Obaseki pledges sustained investment in healthcare, reassures of one healthcare centre for every ward in EdoShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said his government is focused on reforming and upgrading the state’s primary healthcare system, ensuring swift, affordable and quality medical service delivery to Edo people.\nObaseki, who spoke to journalists in Benin City, said the government plans to have at least one standard primary healthcare centre in every ward in Edo with well-trained staff and technology before 2024.\nAccording to him, “In the area of healthcare, we have just started, even though we have done quite a lot of work in the sector.\nOur focus has always been on basic care, just like we did with our education system; we are fixing those areas where our people have the first interaction with our healthcare system.\n“We have revamped the Edo Specialist Hospital and ignored the manipulations from detractors who try to make an issue of our decision to bring down a 90-year-old hospital and move it into a 5-year-old hospital.”“So, we are transforming the Specialist Hospital and building a new Stella Obasanjo Hospital,” he stated."
  },
  {
    "headline": "NYSC DG, Ibrahim, kicks against rejection of corps members by employers’ – Nigerian Observer",
    "summarized_story": "General Shaibu Ibrahim, expressed his resentment in Benin City, during corps employers workshop organised by the scheme.\nAhmed Tijani said the workshop was to eliciting idea and suggestions aimed at ensuring good partnership and relationship between NYSC, employers and corp members.\nHe said NYSC is also worried by employers not applying for corps members, under utilisation, delay in issuance of monthly clearance, aiding corps abscondment, lack of provision of statutory welfare of corps members among others.\nHe said employers are expected to make some statutory welfare provision for the corps members serving with them during their service year.\nHe warned that employers have no authority to approve leave or movement of corps members outside their state of deployment."
  },
  {
    "headline": "Death toll rises in Sokoto attacks, governor says 45 buried",
    "summarized_story": "The death toll from the violent attacks on Sunday and Monday in Illela and Goronyo Local Government Areas of Sokoto State has risen to 45, Governor Aminu Tambuwal has said.\nOn Wednesday, Mr Tambuwal said he was briefed about the gravity of the attacks during a visit to the affected areas.\nOn Thursday morning, Governor Tambuwal’s spokesperson, Muhammad Bello, told the BBC Hausa Service that residents told the governor during his visit that 45 people were buried after the attacks.\nAs Tambuwal visits locations, Buhari condemns killingsEarlier, President Buhari had condemned the killings in Sokoto State.\nEvil cannot triumph over good no matter how long it takes,” President Buhari said in the statement."
  },
  {
    "headline": "Skyrocketing food prices could push 6m more Nigerians into poverty – World Bank",
    "summarized_story": "BY EMEKA EJEREContinuous spike in food prices could push additional six million Nigerians into poverty, the World Bank has said.\nThe World Bank report added, “The share of Nigerians living below the national poverty line could have increased from 40.1 percent to 42.8 per cent, due to the food price inflation witnessed between June 2020 and June 2021.\nWhile food price inflation would decrease purchasing power and raise poverty across Nigeria, it appears that urban areas could be disproportionately affected.\n“Indeed, in 2020 and 2021, Nigeria witnessed its highest surge in food-price inflation in almost two decades.\nThe World Bank called on the Nigerian authorities to, as a way of providing a bedrock for recovery, curb the spread of COVID-19 by rolling out vaccines quickly and equitably."
  },
  {
    "headline": "Nigeria writes INTERPOL, demands investigation of Ivorian cop involved in Itunu Babalola’s death",
    "summarized_story": "The government also presented a protest letter from the deceased’s family to the Ivorian High Commissioner to Nigeria, Traore Kalilou, in Abuja on Wednesday.\nThe late Itunu had accused an Ivorian of robbery at her residence and insisted on filing a case against him.\nThe accused, who was related to an Ivorian policeman, reportedly asked her to drop the case, but she refused.\n“The father has officially written a letter which I would present to you and also on our part, we have written to the Interpol.\nOn behalf of her family, I present to you the communication from her father.”"
  },
  {
    "headline": "Nigeria’s social protection programmes inadequate – World Bank",
    "summarized_story": "The Bank which made the observation in a report titled, “The COVID-19 crisis in Nigeria: what’s happening to welfare?” published on Tuesday, observed that coverage of social protection programs remained low throughout the COVID-19 crisis.\nAccording to it, “The early part of the COVID-19 crisis ushered in Nigeria’s deepest recession since the 1980s, with services and industry hit especially hard.\nThis blog considers the resulting welfare effects.”The World Bank noted that the Covid-19 crisis has been worsened by weak social protection in the country.\n“The lack of social protection in Nigeria exposes its population to large welfare losses.\nCoverage of social protection programs remained low throughout the COVID-19 crisis."
  },
  {
    "headline": "Senate passes bill to set up Real Estate Regulatory Council",
    "summarized_story": "Nigerian Senate on Wednesday passed a bill to establish the Real Estate Regulatory Council of Nigeria, which will, among other things, curb fraudulent practices to ensure the real estate business confirms with the National Building Code in Nigeria.\nSponsored by Senator Aliyu Wamakko, the bill was passed after the consideration of a report by the Committee on Establishment and Public Service.\nHe said during the presentation that the establishment of the Real Estate Council of Nigeria would provide efficient, effective and transparent administration of the business of real estate development in Nigeria.\nAccording to him, the council would be responsible for prescribing minimum standards for the conduct of the businesses of real estate development across the country, while recalling that the bill seeking to establish the Real Estate Council of Nigeria was passed by both chambers of the 8th National Assembly, but was not assented to by President Muhammadu Buhari.\nAccording to him, the council would standardize the business of real estate by regulating the conduct of transactions, and provide enabling environment and transparency in the business of real estate development in Nigeria"
  },
  {
    "headline": "Uzodimma Orders Fixing Of 27 Health Centres",
    "summarized_story": "Healthcare delivery service in Imo State is set to receive a boost as Governor Hope Uzodimma has directed that all the health facilities be fixed before December 15, 2021.\nADVERTISEMENTThe governor gave the directive during his meeting with the Interim Management Chairmen (IMC) of the 27 local government areas at the Sam Mbakwe Executive Council Chambers, Government House Owerri.\nUzodimma who was represented by the Health Commissioner, Dr. Barth Okorochukwu, charged the IMC of the 27 LGAs of Imo State and the Officers In-charge of Health in the 305 Wards to take the directive seriously and act immediately."
  },
  {
    "headline": "Uzodimma Orders Fixing Of 27 Health Centres",
    "summarized_story": "Healthcare delivery service in Imo State is set to receive a boost as Governor Hope Uzodimma has directed that all the health facilities be fixed before December 15, 2021.\nADVERTISEMENTThe governor gave the directive during his meeting with the Interim Management Chairmen (IMC) of the 27 local government areas at the Sam Mbakwe Executive Council Chambers, Government House Owerri.\nUzodimma who was represented by the Health Commissioner, Dr. Barth Okorochukwu, charged the IMC of the 27 LGAs of Imo State and the Officers In-charge of Health in the 305 Wards to take the directive seriously and act immediately."
  },
  {
    "headline": "Edo Community Petitions IGP Over Murder Of Youth",
    "summarized_story": "Youths and leaders of Ekiugbo community of Uhunwonde local government area of Edo State have called on the police authorities in the state and Abuja to investigate the alleged killing of one Ikpomwonsa Omoruyi by Justin Omoruyi now held by the Special Weapon and Tactics (SWAT) team in the nation’s capital.\nThe suspect was said to have committed the offence in company of others said to be at large, which has heightened tension in the agrarian community.\nMembers of the community have accused a senior security aide to the governor, Mr Haruna Yusuf, of shielding the suspects and urged Governor Godwin Obaseki to call him to order.\nBut in a swift reaction, Yusuf denied any involvement in the incident, saying that he learnt that some fake vigilantes were mobilised to the community by an All Progressives Congress (APC) chieftain which led to the shootoutADVERTISEMENTHe said, “I’m too busy to have time for all that rubbish.\nThe police in Edo and Abuja are handling the matter, so, if anyone is making any allegation or petition is just wasting his time.”However, leaders of the community through a law firm, Douglas Ogbankwa & Co, in a petition to the state commissioner of police and inspector-general of police (IGP), titled: “Petition of murder, attempted murder, waging communal war, illegal possession of fire arms, cultism, violence and conduct likely to cause breach of peace”, urged the police authorities to protect the legal rights and safety of the inhabitants of Ekiugbo community."
  },
  {
    "headline": "Edo Community Petitions IGP Over Murder Of Youth",
    "summarized_story": "Youths and leaders of Ekiugbo community of Uhunwonde local government area of Edo State have called on the police authorities in the state and Abuja to investigate the alleged killing of one Ikpomwonsa Omoruyi by Justin Omoruyi now held by the Special Weapon and Tactics (SWAT) team in the nation’s capital.\nThe suspect was said to have committed the offence in company of others said to be at large, which has heightened tension in the agrarian community.\nMembers of the community have accused a senior security aide to the governor, Mr Haruna Yusuf, of shielding the suspects and urged Governor Godwin Obaseki to call him to order.\nBut in a swift reaction, Yusuf denied any involvement in the incident, saying that he learnt that some fake vigilantes were mobilised to the community by an All Progressives Congress (APC) chieftain which led to the shootoutADVERTISEMENTHe said, “I’m too busy to have time for all that rubbish.\nThe police in Edo and Abuja are handling the matter, so, if anyone is making any allegation or petition is just wasting his time.”However, leaders of the community through a law firm, Douglas Ogbankwa & Co, in a petition to the state commissioner of police and inspector-general of police (IGP), titled: “Petition of murder, attempted murder, waging communal war, illegal possession of fire arms, cultism, violence and conduct likely to cause breach of peace”, urged the police authorities to protect the legal rights and safety of the inhabitants of Ekiugbo community."
  },
  {
    "headline": "Slain Imo Businessman: Court Orders Substituted Service On Army",
    "summarized_story": "Justice Maureen Onyetenu of the Federal High Court in Owerri, Imo State on Wednesday ordered for substituted service be served on the Chief Of Army Service, Farouk Yahaya, on a case of enforcement of fundamental human rights over the killing of an Owerri based businessman, Noel Chigbu, by suspected soldiers on April 30.\nThe judge ordered that the service be served via a newspaper publication after the counsel to the applicant, Anyalewechi informed the court that the bailiff from Owerri was unable to effect service in Abuja.\nMeanwhile, the other respondents, the chief of defence staff, the governor of Imo State and the commander of the 34 Artillery Brigade, Owerri, had been duly served.\nCounsel to the applicant, appealed to the court to order for an autopsy on the body of the deceased so his family can inter his remains for burial.\nThe late Noel was allegedly gunned down by soldiers on April 30th at the Amakaohia flyover in Owerri while driving home during the spate of the insecurity that swept through Imo state."
  },
  {
    "headline": "Stranded passengers lament as railway workers begin strike, ground services",
    "summarized_story": "About 11,000 workers of the Nigerian Railway Corporation have commenced a three-day warning strike, grounding operations at all rail stations across the country.\nThe NRC employees under the aegis of the Nigerian Union of Railway Workers on Wednesday vowed to halt all train operations nationwide including services on the popular Lagos-Ibadan, Abuja-Kaduna, and Warri-Itakpe routes today (Thursday).\nHowever, we’ve not been served and so by early hours of Thursday morning our strike commences,” Ajiji stated.\nAsked to state the number of workers who would partake in the strike, he replied, “About 11,000 workers.\nWe have 10,995 workers, so we are about 11,000 approximately.”On whether the strike would affect all the rail stations in Nigeria, Ajiji said, “Yes."
  },
  {
    "headline": "Stranded passengers lament as railway workers begin strike, ground services",
    "summarized_story": "About 11,000 workers of the Nigerian Railway Corporation have commenced a three-day warning strike, grounding operations at all rail stations across the country.\nThe NRC employees under the aegis of the Nigerian Union of Railway Workers on Wednesday vowed to halt all train operations nationwide including services on the popular Lagos-Ibadan, Abuja-Kaduna, and Warri-Itakpe routes today (Thursday).\nHowever, we’ve not been served and so by early hours of Thursday morning our strike commences,” Ajiji stated.\nAsked to state the number of workers who would partake in the strike, he replied, “About 11,000 workers.\nWe have 10,995 workers, so we are about 11,000 approximately.”On whether the strike would affect all the rail stations in Nigeria, Ajiji said, “Yes."
  },
  {
    "headline": "N20bn bailout: More trouble for Sterling Bank MD, Abubakar Suleiman, as Kogi assembly extends ultimatum for appearance",
    "summarized_story": "The Kogi Assembly has extended its ultimatum for Sterling Bank Plc., Managing Director, Mr Abubakar Suleiman, to appear before it to Dec. 8.\nThe house announced the extension at plenary on Tuesday, Following the failure of the Sterling bank to appear before it yesterday (Nov. 16).\nUpon resumption of plenary, the Sterling bank MD sent a letter to the assembly, urging it to reschedule his appearance.\nAccording to the letter, the managing director is currently attending AFREXIM Trade fair holding in South Africa.\nThe speaker said that further failure to appear on the agreed date would compel the house to issue a Warrant of Arrest against the MD."
  },
  {
    "headline": "N20bn bailout: More trouble for Sterling Bank MD, Abubakar Suleiman, as Kogi assembly extends ultimatum for appearance",
    "summarized_story": "The Kogi Assembly has extended its ultimatum for Sterling Bank Plc., Managing Director, Mr Abubakar Suleiman, to appear before it to Dec. 8.\nThe house announced the extension at plenary on Tuesday, Following the failure of the Sterling bank to appear before it yesterday (Nov. 16).\nUpon resumption of plenary, the Sterling bank MD sent a letter to the assembly, urging it to reschedule his appearance.\nAccording to the letter, the managing director is currently attending AFREXIM Trade fair holding in South Africa.\nThe speaker said that further failure to appear on the agreed date would compel the house to issue a Warrant of Arrest against the MD."
  },
  {
    "headline": "BREAKING: Gernot Rohr Sacked As Super Eagles Coach After 5-Years",
    "summarized_story": "Gernot Rohr, the head coach of the Nigerian national football team, has been fired, according to NewsDirect.\nTGM has learned that the German was fired despite his squad qualifying for the 2022 World Cup play-offs in Africa.\nOma Akatugba announced this on his own Twitter profile, writing:NFF sack Gernot Rohr after five years https://t.co/2iGWR9tJVk — Oma Akatugba (@omaakatugba) November 18, 2021Despite being defeated to a 1-1 draw by Cape Verde in Lagos on Tuesday, the Super Eagles finished first in Group C.In August 2016, Rohr was named head coach of the Super Eagles, and he guided them to a third-place finish at the 2019 Africa Cup of Nations.\nThe media and supporters have slammed Germany’s conservative attitude and the Super Eagles’ lackluster performances."
  },
  {
    "headline": "BREAKING: Occupants Trapped As Storey Building Collapses In Badagry, Lagos",
    "summarized_story": "On Wednesday, a storey building in the Flour Mills Estate, Magbon, Badagry region of Lagos State collapsed, trapping occupants.\nThis was reported on the Lagos State Fire and Rescue Service’s Facebook page in a statement signed by Margaret Adeseye, Director of the Lagos State Fire and Rescue Service.\nThe statement read, “There has been a reported case of a storey building collapse at Sunny Filled, Flour Mills, Estate, Magbon, Badagry, Lagos.\n“The Lagos State Fire and Rescue Service, Badagry Station had rescued five victims from the under-construction building while concerted efforts are ongoing to rescue remaining trapped victims.\n“However, four adults male have been recovered (unconscious) thus far as the Nigerian Police, Morogbo Division and the Community dwellers are complimenting the efforts of the Lagos State Fire and Rescue Service.”"
  },
  {
    "headline": "Pictorial: Police Take Over APC National Secretariat, Abuja",
    "summarized_story": "Dozens of armed policemen in four patrol vans have taken over the entry and exit points on Blantyre Street where the All Progressives Congress, APC, National Secretariat is located.\nIt was gathered in Abuja, on Wednesday, that the policemen who were complimented by officers of the Department of State Service, are at the location to forestall a possible breakdown of law and order.\nThe Punch learnt that the security officials mobilized in response to security reports about a planned protest by aggrieved APC members against the party leadership to register their displeasure over the conduct of the recently conducted ward, local government and state congresses.\nSee photos below:"
  },
  {
    "headline": "All You Care About Is Tinubu – Aisha Yesufu Slams Lagos Assembly Over Lekki Massacre",
    "summarized_story": "Popular activist, Aisha Yesufu has slammed members of the Lagos State House of Assembly over their alleged indifferent attitude to the End SARS issues.\nAccording to Yesufu, a social activist, the Lagos assembly members have not done enough to show that they are with the Nigerian youths on the issues that emanated from the nationwide protest but are instead pledging allegiance to Bola Tinubu, the national leader of the All Progressives Congress, APC.\nShe said that the lawmakers have remained mute even after the Lagos State Panel of Investigation recently published a report about the Lekki Toll Gate incident.\nAisha, who was at the forefront of the EndSARS protest in October 2020, tweeted, “The thing that hurt me more than the killings at Lekki Toll Gate was how members of Lagos State House of Assembly threw #EndSars protesters under the bus and were practically swearing allegiance to Tinubu.\nAll they cared about was Tinubu.”"
  },
  {
    "headline": "Breaking: NFF move to sack Super Eagles coach, Gernot Rohr",
    "summarized_story": "Super Eagles coach Gernot Rohr is most likely to get the axe any moment soon.\nThe decision to sack the Franco-German gaffer was reportedly taken after a company associated with the senior National team of Nigeria agreed to pay the termination clause in the contract of the coach.\nAccording to sources at the nation’s football house, the Nigeria football Federation (NFF) have communicated the decision to the former Niger and Burkina Faso coach.\nAlready, the country’s football body has started the search for a new coach who will pilot the affairs of the team for the 2022 World Cup Play offs and also the Africa Cup of Nations in Cameroon next year.\nThe German trainer has been in charge since August 2016 and led the team to a 3rd place in 2019 AFCON."
  },
  {
    "headline": "APC crisis deepens, Police barricade entrances to secretariat",
    "summarized_story": "It was gathered that as early as 11:30 am, security was tightened as all roads leading to the party secretariat were barricaded and armed policemen were seen conducting searches on humans and vehicles moving towards the party Secretariat.\nA security source at the APC secretariat said: “We had security report that some people have plans to come and protest here.\n“This is the second time we are seeing this kind of deployment at the secretariat.\nThe committee should also know that they have overstayed their welcome and should be ready to conduct the National Convention.\n“What our party constitution says that rendered Buni-committee null and void."
  },
  {
    "headline": "Breaking: Another tragedy hits Lagos as building collapses, 4 feared dead (PICTURES)",
    "summarized_story": "Yet another building under construction has collapsed in Magbon, Badagry area of Lagos on Wednesday with four persons feared dead.\nFive others were rescued from the rubbles with varying degrees of injury, while efforts are still on to rescue others.\nAlready, rescue operation is ongoing.\nDetails loading…RelatedNo tags for this post."
  },
  {
    "headline": "Reps Minority Caucus Reviews Lagos EndSARS Report, Says FG Has Questions to Answer",
    "summarized_story": "The Minority Caucus in the House of Representatives has said it has reviewed the Lagos EndSARS report and observed that the Federal Government has questions to answer.\nThe lawmakers in a statement signed by Minority Leader, Ndudi Elumelu on Thursday said the report has confirmed that there was indeed a massacre at Lekki Toll Gate on October 20, 2020, despite the earlier denial of killings.\n“The Minority Caucus in the House of Representatives, after a thorough review of the report of the Lagos State EndSARS judicial panel, holds that the attempt by officials of the All Progressives Congress (APC)-led Federal Government to cover up the now confirmed massacre of Nigerians youths by security forces at the Lekki Tollgate suggests a high-level state-backed conspiracy against Nigerians.\nREAD ALSO: Lagos Govt Urges ‘Restraint’ Over #EndSARS Panel Report“The confirmation by the Lagos Panel that there was indeed a massacre at the Lekki Tollgate during the 2020 EndSARS protests in Lagos and that APC government-controlled security forces carted away bodies and mopped up evidence, places a huge burden on the Federal Government which had vehemently denied any killings,” the statement read in part.\n“Our caucus is however shocked that the administration can lie in a matter that has to do with the gruesome killing of citizens, particularly our youths, and even attempt to provide official cover to the culprits."
  },
  {
    "headline": "‘One Of The Best Report Ever Produced’, Falana On #EndSARS Panel Outcome",
    "summarized_story": "Human rights lawyer and a Senior Advocate of Nigeria (SAN), Femi Falana, has described the report of the Judicial Panel of Inquiry on Restitution for Victims of SARS Related Abuses and Other Matters as one of the best ever produced.\n“It was a thorough-going exercise, one of the best reports ever produced by a judicial commission of inquiry in Nigeria,” Falana said.\nThe senior lawyer however faulted the leakage of the report of the Judicial Panel of Inquiry on Restitution for Victims of SARS Related Abuses and Other Matters.\n“So the government could not have released the report and the government should not have released the report because it has to.\n“It is after that committee has concluded its own assignment that the government will then release the report via a white paper.”"
  },
  {
    "headline": "Lagos Govt Urges ‘Restraint’ Over #EndSARS Panel Report",
    "summarized_story": "The Lagos State Government has called for restraint over the report of the Judicial Panel of Inquiry on Restitution for Victims of SARS Related Abuses and Other Matters.\nOn Monday, the Panel submitted its report to the Lagos State Government.\nHowever, a leaked version of the report indicting the state government and the Nigerian Army was released on the Internet.\nLagos State Governor Babajide Sanwo-Olu has set up a committee to review the panel’s report, which is yet to be released officially.\nAt the appropriate time, the Government will make known its views on all the issues raised by the Panel through the release of a White Paper.”"
  },
  {
    "headline": "US Excludes Nigeria From Religious Freedom Violators’ List",
    "summarized_story": "The United States on Wednesday excluded Nigeria from its list of religious violators.\nIn a statement by the US Secretary of State, Antony Blinken, the US blacklisted Russia, China, and eight other countries.\n“This Administration is committed to supporting every individual’s right to freedom of religion or belief, including by confronting and combating violators and abusers of this human right”.\nHe added that “the challenges to religious freedom in the world today are structural, systemic, and deeply entrenched.\nIn 2020, the US placed Nigeria and six other countries on its special watch list of states that had engaged in or tolerated the severe violation of religious freedom, however, the nation was exempted in the 2021 list."
  },
  {
    "headline": "Senate Passes Real Estate Regulatory Council Bill",
    "summarized_story": "The Senate has passed a bill to establish the real estate regulatory council of Nigeria.\nThe bill is tagged: The Real Estate Regulatory Council of Nigeria (Establishment) Bill, 2021.\nIf assented to by President Muhammadu Buhari, the establishment of the Real Estate Council of Nigeria is expected to provide efficient, effective, and transparent administration of the business of real estate development in Nigeria.\nThe Council when established would, amongst others, curb fraudulent practices to ensure that the real estate business confirms with the National Building Code in Nigeria.\nIt would also be responsible for prescribing minimum standards for the conduct of the businesses of real estate development across the country."
  },
  {
    "headline": "Let us be patient as work on Lekki Panel Report continues",
    "summarized_story": "The Lagos State Government has noted the various reactions that have followed the submission of the report of the Judicial Panel of Inquiry on Restitution for Victims of SARS Related Abuses and Other Matters.\nThere have been arguments in the public space over the report.\nThere is need according to the State Commissioner for Information, Mr Gbenga Omotosho, for us to restrain ourselves from nullifying the good intentions of the government in setting up this Panel, which was well encouraged to do its job – a fact that was acknowledged by the Panel.\nIn accordance with the Tribunal of Inquiry Law 2015, a committee has been set up to bring up a White Paper on the report to determine the next line of action.\nAt the appropriate time, the Government will make known its views on all the issues raised by the Panel through the release of a White Paper."
  },
  {
    "headline": "Tambuwal Condoles Illela Community As Death Toll Rises To 43 -",
    "summarized_story": "Armed marauders had attacked the town and some villages near it in the wee hours Monday, at first instance killing thirteen people.\nHowever, at the time of the Governor’s visit Wednesday afternoon the toll has risen to 43.\n“We, therefore, pray that God grant them eternal glory and forgive their shortcomings and sins while they were alive.\n“We again pray to God to continue to ensure that peace prevails in all our communities and across the country.\nMay Allah grant us peace and peaceful coexistence,” he prayed profusely."
  },
  {
    "headline": "FEC approves establishment of Federal University of Health Sciences, Oturkpo -",
    "summarized_story": "The Federal Executive Council has approved a draft bill for the establishment of a Federal University of Health Sciences in Otukpo, Benue State.\nAlso among other approvals given was the enactment of the Civil Defence, Corrections, Fire, Immigration Services Board (CDCFIB), Bill 2021and consequent repeal of the Immigration and Prison Services Board Act, Cap 12, Law of the Federation of Nigeria, 2004.\nThe FCT MinisterMohammed Musa Bello had also obtained approval for the procurement of a light duty towing truck, including a 10ton crane attachment for the Directorate of Road Traffic Services, under the Federal Capital Territory Administration.\nThis truck is meant to complement and add to the fleet of vehicles that the directorate has specifically to tow vehicles from accident scenes and vehicles that have been impoundedThe Works and Housing also got approval for the rehabilitation of the Idah-Nsukka Road, an 84 kilometre road, linking Kogi and Enugu states."
  },
  {
    "headline": "5 Construction Workers rescued from Collapsed Badagry building -",
    "summarized_story": "A storey building has collapsed at Sunny Filled, Flour Mills, Estate, Magbon, Badagry, Lagos.\nThe Lagos State Fire and Rescue Service, Badagry Station has at the last count rescued 5 (five) victims from the under-construction building while concerted efforts are ongoing to rescue the remaining trapped victims.\nThe victims who are mainly construction workers were rescued with varying degrees of injury but in stable condition and have been taken to nearby hospitals for treatment.\nHowever, 4 (four) adults male have been recovered (unconscious) thus far as the Nigerian Police, Morogbo Division and the Community dwellers are complimenting the efforts of the the Lagos State Fire and Rescue Service."
  },
  {
    "headline": "We Are Expanding into More African Countries – Rabiu Umar, GCCO Dangote Group",
    "summarized_story": "The Intra-Africa Trade Fair is a major event held annually in order to boost trade on the continent.\nOwing to the number of participants and visitors, no other event brings together more professionals under one roof.\nFor this year’s trade fair currently taking place in Durban, South Africa, IATF’s theme is focused on the newly-launched African Continental Free Trade Area – a single market for goods and services across 55 countries, aimed at boosting trade and investment.\nRabiu Umar, the Group Chief Commercial Officer of Dangote Group, spoke to ARISE News from Durban to give us his takeaways from the trade fair and lend some insight into what deals his company has struck and in the process of doing."
  },
  {
    "headline": "There Are Discrepancies in The EndSARS Submitted Report – Lagos Counsel Says",
    "summarized_story": "The last three days have shown that the conversation around the report submitted by the Lagos State Judicial Panel set up to, among other issues, investigate the Lekki tollgate shooting a year ago, will not die down soon.\nWhile many youths and persons who participated in the ENDSARS protest last year feel vindicated by the panel’s findings and are eager that the recommendations in the report are implemented soonest, there are others who are pushing back and have pointed to some inconsistencies in the report.\nIn this interview, Abiodun Jelili Owonikoko tells us about his defence of the Lagos State Government while the panel was in session and give us his thoughts on the report on the Lekki tollgate shooting.\nA Senior Advocate of Nigeria, Owonikoko served as counsel to the Lagos State Government during the year-long sitting of the Judicial Panel of Inquiry on Restitution for Victims of SARS Related Abuses and Other Matters."
  },
  {
    "headline": "German Disease Control Head Warns of ‘Terrible Christmas’",
    "summarized_story": "The head of Germany’s disease control agency has warned that the country faces a “really terrible Christmas” unless steps are taken to counter the sharp rise in coronavirus infections.\nGerman lawmakers are debating measures Thursday that would replace the nationwide epidemic rules, which will expire at the end of the month.\nThe Robert Koch Institute, Germany’s disease control agency, said Thursday that 65,371 newly confirmed cases had been reported in a single day, continuing the upward trend that experts have been warning about for weeks.\n“We are going to have a really terrible Christmas if we don’t take countermeasures now.”Wieler said Germany needs to increase its vaccination rates to significantly above 75%, from 67.7% at present.\nSome regions in Germany have vaccination rates as low as 57.6%."
  },
  {
    "headline": "China Coast Guard Uses Water Cannon Against Philippine Boats",
    "summarized_story": "National Security Adviser Hermogenes Esperon told reporters in Manila that two Chinese coast guard ships blocked the two wooden-hulled supply vessels.\nA third coast guard ship “water cannoned the two for one hour,” he said, adding that the outrigger of one of the Philippine ships was displaced by the impact.\nA water cannon is a device on firetrucks that shoots high-velocity water for firefighting and crowd control but has also been installed on Chinese coast guard ships to drive away what China considers intruders in the waters it claims.\nTwo Chinese coast guard ships then tried to block the slow-moving, military-chartered vessel carrying the journalists, with one cutting dangerously through the Philippine ship’s path twice.\nThe Chinese coast guard warned the Philippine vessel by radio to turn back, saying it was illegally venturing into Chinese territory."
  },
  {
    "headline": "Under Pressure, Apple Allows Self-repairs to iPhones, Macs",
    "summarized_story": "Apple is letting some iPhone users fix their own phones, a sharp turnaround for a company that has long prohibited anyone but company-approved technicians from fiddling with its proprietary parts and software.\nThe company said Wednesday that it will enable users of two of the newest iPhone models and eventually some Mac computers to get access to genuine Apple parts and tools for consumer repairs.\nThe shift reflects a strengthening “right to repair” movement embraced by President Joe Biden and affecting everything from smartphones to cars and tractors.\nRegulators have expressed concerns about restrictions that steer consumers into manufacturers’ and sellers’ repair networks, adding costs to consumers and shutting out independent repair shops from business opportunities.\nProctor said that’s thanks to growing pressure, including from some of Apple’s own investors."
  }
]