[
  {
    "headline": "European Catholic varsity honours writer Chimamanda Adichie",
    "summarized_story": "Renowned Nigerian author, Chimamanda Adichie, has received an honorary doctorate degree from the Catholic University of Louvain, Belgium.\nOne of the world’s oldest Catholic universities, the Catholic University of Louvain, conferred the honorary degree to Adichie at their main campus on Friday.\nIt is time for us to seek truth and to insist on measures that make it possible for truth to prevail”.\nIt is pertinent to note that, in recent times, Adichie has decried the attitude of Catholic priests, pertaining to her parents’ funeral.\nIn an essay last year, the “Purple Hibiscus” writer gave an insight as to why she separated herself from Catholicism."
  },
  {
    "headline": "Solving African challenges must involve Africans, says Kenyan activist Lumumba",
    "summarized_story": "Erudite Kenyan scholar and activist, Prof. Patrick Lumumba, has said it is important that Africans begin to appreciate and be proud of the talents they have by using them to solve African challenges.\nLumumba made the call on Friday while delivering the 30th anniversary and Convocation Lecture of the Delta State University, Abraka titled: “Whither Education in Africa”.\nWe should be proud of the talents we have produced at Delta State University Abraka and use them in solving some of our problems in Abraka, Delta State, and Nigeria at large.\nProf. Lumumba submitted that “Delta State University at 30 has made enormous contributions to the development of Abraka, Delta, Nigeria, and Africa”.\nHe said, “As we celebrate Delta State University Abraka’s 30 years of existence and some of the notable achievements of the university over the past years."
  },
  {
    "headline": "Soludo seeks establishment of Bayern Academy in Anambra",
    "summarized_story": "Governor Chukwuma Soludo has urged Bayern Munich FC of Germany to consider establishing an Academy in Anambra as part of an effort to deepen the game of football in Nigeria.\nSoludo made the request while welcoming the Bayern Munich technical team who were in the state for the National Youth Cup on Saturday.\nEmeka Okeke, Chairman, Aspire Foundation Board of Trustees said the Bayern Youth Cup partnership was part of the My Anambra Football Project which had a broad plan of developing football in Anambra.\nThe Bayern Youth Cup technical team is headed by Hans Pflugler, a retired Germany player and member of the 1990 world cup winning team.\nPflugler is also one of Bayern Munich greats."
  },
  {
    "headline": "Judith is my girl, says Uche Ogbodo",
    "summarized_story": "Uche OgbodoBy Sylvester KwentuaBeautiful Nollywood actress, Uche Ogbodo, drew lots of negative reactions to her comment on Judith’s Instagram page.\nJudith Austin had taken to her page to post that she was not afraid to face whatever comes out of her union with Yul, as Jesus got her back.\n“I am not ashamed to say I am nothing without you Jesus.\nHave a lovely day bunnies” Judith posted.\n“My girl”, was what Uche Ogbodo posted that got many social media users angry."
  },
  {
    "headline": "2023: FCT deserves a Mayor – Tambuwal",
    "summarized_story": "Governor Aminu Tambuwal of Sokoto stateGovernor Aminu Tambuwal of Sokoto State says the Federal Capital Territory (FCT), Abuja, deserves a mayor and better recognition.\nTambuwal, who is one of the Peoples Democratic Party (PDP) presidential aspirants, stated this while meeting with the PDP FCT delegates in Abuja.\nWhat stop you from appointing a zonal Minister from the FCT bacause FCT is part of North Central zone?\n“Because of the Special nature of FCT, there should be a Mayor in the FCT.\nZakka urged Tambuwal to continue his support for PDP FCT chapter, adding that the party will continue to appreciate him."
  },
  {
    "headline": "2023: Faleke, Babachir Lawal, pick N100m form for Tinubu, say he remains the man to beat",
    "summarized_story": "Addressing journalists, Faleke said the former Lagos governor is the only one contesting that they know.\nOn his part, the former SGF, Babachir Lawal said “Senator Bola Tinubu is a branded product”.\n“If we were not sure we have chances to win this election, we would not waste our N100 million.\nEverybody is free to buy the forms if he has N100 million.\nBut as far as we are concerned, we are only fulfilling the constitutional requirement of campaigning and going for election."
  },
  {
    "headline": "Only national chairman, national secretary can authenticate membership cards — PDP",
    "summarized_story": "The Peoples Democratic Party (PDP) says only its national chairman and the national secretary that are vested with power to authenticate party membership cards.\nThe party made the clarification in a statement by its National Publicity Secretary, Mr Debo Ologunagba in Abuja on Saturday.\nIt stated that the stakeholders were reportedly demanding that membership cards had to be authenticated by ward chairmen before the holders were eligible to participate in the three-man ad hoc congresses schedule for Saturday, April 30.\n“For the avoidance of doubt, the only authority vested with the power to authenticate party membership cards for eligibility to participate in congresses, including the three-man ad hoc delegate congresses, are the national chairman and the national secretary through their signatures on the cards.\n“The PDP Constitution 2017 (as amended) in Chapter 2, Part 1, Article 8(7) is clear in providing that “the nembership card shall be produced by the National Headquarters and authenticated by the National Chairman and the National Secretary.”The party said that PDP members holding membership cards duly authenticated by the national chairman and national secretary did not require any further authentication."
  },
  {
    "headline": "Consumers in Calabar beg Master Bakers not to increase price of bread",
    "summarized_story": "Consumers of bread in parts of Cross River State have lamented the ever-increasing price of bread and have appealed to master bakers not to carry out their threat to further increase product prices.\nDAILY POST held random interviews with consumers, Saturday morning following a radio programme where a general manager of a bakery hinted that the association may soon increase the price of bread by another 50% as a result of the high costs of baking.\nThis is why I appeal to them not to increase the prices of bread again.”Madam Esther Fidel, a teacher, similarly lamented that bread is now luxury food for the rich.\n“Price of bread might likely increase very soon in Cross River State by 50%.\nThis is owing to high costs of diesel to power our generators, high cost of bags of flour, sugar, oil etc."
  },
  {
    "headline": "Don condemns ASUU strikes, says lecturers killing University system",
    "summarized_story": "A senior lecturer at the Usman Danfodioyo university, Dr. Muhammad Sanusi Yahaya has lamented that ASUU strike actions have continued to weaken the public university system, saying the union is the actual problem.\nDr. Yahaya said he had written a message to striking ASUU lecturers, reminding them of how much damage the incessant strikes are causing to public universities.\n“The monopoly of public universities for the production of manpower for the economic growth has long been diluted when private universities were given licenses to operate” he lamented.\n“Strike actions only weaken the public universities further.\nYou are helping them kill the system for good”, he said."
  },
  {
    "headline": "Eid-el-Fitr: Remain vigilant, support security measures to safeguard lives, property – Police to Yobe residents",
    "summarized_story": "Yobe State Police Command has tasked people in the state to remain vigilant and support all security measures put in to safeguard lives and property before, during and after Sallah celebrations.\nThe Command gave the charge in a statement by its Public Relations Officer, ASP Dungus Abdulkarim in Damaturu.\nIt noted that as Sallah celebrations commence, it is expedient for all stakeholders in the security network to put their hands on deck to ensure a hitch-free celebration throughout the state.\n“The Command condemns the recent bomb attacks in Gashu’a and Geidam.\nHowever, investigations have commenced to unravel possible plans of similar attacks elsewhere in the state”, it assured."
  },
  {
    "headline": "FAAN tightens security at airports",
    "summarized_story": "The Federal Airports Authority of Nigeria (FAAN) has beefed up security at airports ahead of the Eid-el-Fitri celebration.\nHope-Ivbaze said FAAN would ensure seamless facilitation of passengers during the Sallah celebrations and beyond.\nThe spokesperson said facilities at the airports have been improved upon and are functioning optimally.\nFAAN advised intending travellers to make early preparations towards completing their travel requirements in good time.\nReceiving of dignitaries in restricted areas by security agents and airport officials remains prohibited and anyone found wanting would be prosecuted, Hope-Ivbaze added."
  },
  {
    "headline": "Sallah: Kaduna CP deploys 10,000 special forces to check attacks",
    "summarized_story": "The Kaduna Police Command on Saturday said it has deployed 10,000 officers and men across the state to forestall any breakdown of laws and order, during and after the festive period.\nThis was contained in a statement by the Police Public Relations Officer (PPRO), ASP Muhammed Jalige.\nJalige said the deployment is drawn from the conventional, logistics and tactical manpower of the Command and is aimed at ensuring that the festivities are observed hitch-free in the state.\nHe said the over ten thousand (10,000) personnel deployment is to cover worship centres, critical national infrastructures, markets, social and recreational centres, major highways and other public spacesHe said the Commissioner of Police, Kaduna Command, CP Yekini A. Ayoku has assured members of the general public that their safety and security are of paramount importance to the Command.\nHe equally urged them to warn their wards against the use of fireworks (Knock-out) as violators of this will be severely dealt with under extant laws."
  },
  {
    "headline": "I’m eminently qualified to succeed Masari, says Deputy Gov",
    "summarized_story": "He said: “Having worked as the Deputy Governor harmoniously with His Excellency, Aminu Bello Masari, the Governor of Katsina State, for the last seven years, I believe I am eminently qualified for this exalted position.\nREAD ALSO: Masari appoints Chief of Staff as acting Katsina SSG“We will ensure adherence to moral and ethical standards as well as rely on integrity, competence and hard work in governance.\nWith these principles, the good people of Katsina State will find me a dependable ally”.\nThe Deputy Governor said his ambition is to further uplift the living standard of people from the prevailing global economic downturn that has impacted negatively on citizens.\nHe said his administration will promote continuity of the restoration agenda of Masari, adding that it will focus on six pillars of education, agriculture, health, trade and MSME development, security and social reforms."
  },
  {
    "headline": "IPAC rejects NDLEA’s drug integrity test proposal for aspirants",
    "summarized_story": "The Inter Party Advisory Council (IPAC) on Saturday rejected the National Drug Law Enforcement Agency (NDLEA) proposal that political parties should make drug integrity test part of the screening requirements for aspirants seeking to contest political offices in the 2023 general election.\n“IPAC strongly condemns drug abuse by misguided citizens and urges NDLEA to discharge its duties in tandem with the law establishing it.\n“It is obvious that political parties’ activities are guided by the 1999 constitution as amended, the Electoral Act 2022, INEC guidelines/regulations and respective parties’ guidelines”.\nThis is the clear position of the law and the position of IPAC for aspirants seeking political offices in the 2023 general election.\nPolitical parties will not be distracted by this absurdity,” he said."
  },
  {
    "headline": "Tinubu donates food stuff, items to Plateau Muslims",
    "summarized_story": "National Leader of the All Progressives Congress (APC) Asiwaju Bola Ahmed Tinubu has donated over 1,000 bags of rice and other items to the Muslims Umman in Plateau State for Sallah celebration.\nHe challenged them to always pray for emergence of good leaders at all levels as the 2023 general elections approach.\nHassan Isa Maimadara, while distributing the items to beneficiaries across the 17 local government areas, urged them to make judicious use of the items.\nMusa Alha ,Secretary Jos elders forum, Musa Alha; Youth leader Sabo Isa and women leader Hadiza Ibrahim Ndam and Hannatu lawal Gyang, housewife , applauded the kind gesture of the APC stalwart.\nOther beneficiaries include religious leaders, cultural groups, party officials, women groups and Islamic organisations."
  },
  {
    "headline": "Seven dead, five injured in Lagos-Ibadan expressway multiple accident",
    "summarized_story": "Seven dead, five injured in Lagos-Ibadan expressway multiple accidentSeven persons were confirmed dead in a multiple accident at Ogun State stretch of Lagos Ibadan expressway.\nFive others were badly injured in the accident recorded around 7:40pm on Friday opposite Federal Road Safety Corps (FRSC) office in Ogunmakin KM 27 on Lagos – Ibadan expressway.\nThe injured victims were rescued and taken to Victory Hospital Ogere for treatment while the dead bodies were deposited at a private morgue, FOS Morgue Ipara, Ogun State.\nThe Sector Commander FRSC Ogun Corps Commander Ahmed Umar, who described the crash as an avoidable, blamed it on excessive speed which led to loss of control on the part of the Mazda bus.\nHe cautioned motorists to always be safety conscious by applying common sense speed limit especially during raining."
  },
  {
    "headline": "Suspected terrorists kill army officer, two others in Plateau.",
    "summarized_story": "An Army personnel and two others were gunned down in a fresh attack by suspected bandits at Rikwe-Chongu village in the Kwall District of Bassa Local Government Area of Plateau State on Thursday night.\nThe spokesman of the Special Task Force, Operation Safe Haven (OPSH), Major Ishaku Takwa, who confirmed the incident , said that the incident occurred on Thursday night.\nAccording to the military spokesperson, troops have since been deployed to the community, as normalcy have since been restored.\nThe reports that Plateau state has constantly suffered attacks by gunmen.\nEarlier this month, at least 100 people were killed, homes razed and many abducted by gunmen across ten villages in Kanam Local Government area of the state."
  },
  {
    "headline": "2023 Presidency: Northern elders move to draft in Lawan",
    "summarized_story": "Specifically afraid that Kwankwaso may become the favourite bride of northern voters, in the event of the above scenario, northern elders wants to draft Lawan as their own consensus candidate in the APC.\nIt was gathered that the northern elders would set out to brief and get President Buhari’s buy-in this weekend, before Lawan would be persuaded to formally join the presidential race.\nSaturday Sun gathered that the northern elders planning to draft Lawan are proposing a vice president from the South East or South West.\nDeputy Speaker, House of Representatives will go to South South.\nAccording to the northern elders’ proposal, if Lawan is supported to become the president on the APC platform, he would do only one term, to allow South East take over thereafter."
  },
  {
    "headline": "South East: Ohanaeze kicks over military siege",
    "summarized_story": "From Magnus Eze, Enugu and Stanley Uzoaru, OwerriThe Ohanaeze Ndigbo, residents of South East and groups in the area have condemned the heavy presence of the military and personnel of other security agencies on South East roads.\nSaturday Sun learnt that the issue would be slated for discussion on May 5, as the Imeobi Ohanaeze deliberates on the 2023 Presidency and the security situation in the South East.\nDuring their meeting, Ohanaeze Ndigbo explained to the Commandant the inhuman treatments the civilians undergo under the very armed forces whose primary duty was to protect them.\nIn contra-distinction, every two kilometers in the South East has a roadblock.\nTwo other groups, the Igbo National Council (INC) and the Coalition of South East Youth Leaders (COSEYL), have joined the call for the immediate dismantling of the various military checkpoints in the zone."
  },
  {
    "headline": "Presidency: APC yet to decide on zoning –Abdullahi Adamu",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaNational Chairman of the All Progressives Congress (APC), Abdullahi Adamu, has said that the party has not taken a decision on zoning of the presidency.\nAdamu said no decision has been reached on the zone to produce its presidential candidate for the 2023 election.\nWhile stating that the APC was yet to decide, he maintained: “I am today privileged to be the chairman of the party.\nThe party has not made a decision and I cannot preempt what the party decision will be.”100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nWe know what it takes to go through primaries, go through presidential campaign, go through election of the president."
  },
  {
    "headline": "EFCC obtains final forfeiture order on property, vehicles for Authur Eze’s benefit",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has obtained a final forfeiture order on property and vehicles in Abuja belonging to two brothers who hitherto worked for billionaire philanthropist, Prince Arthur Eze.\nThe forfeited property and vehicles will be for the benefit of Prince Eze.\nThis is the second time the anti-corruption agency is getting forfeiture order against the two brothers.\nThe first forfeiture order was for property belonging to the duo in Enugu.\nThe Eze brothers were said to have got the property and vehicles as staff of Prince Eze, when their salaries could not have financed such acquisition."
  },
  {
    "headline": "2023 divides Afenifere, Yoruba elders, others",
    "summarized_story": "From Oluseye Ojo, Ibadan and Lukman Olabiyi, LagosLeading socio-political groups in the South-West are singing discordant tunes on the 2023 Presidential election and zoning of candidates.\nThe Pan-Yoruba socio-political organisation, Afenifere; Yoruba Council of Elders (YCE), Agbekoya Farmers’ Society (AFS) and the apex Yoruba self-determination group, Ilana Omo Oodua (IOO), are divided over the zone that should produce the next president for Nigeria in 2023.\nMeanwhile, Afenifere, on Wednesday called for a government of national unity to midwife a new democratic government in the country.\nBut to the Ilana Omo Oodua under the leadership of an Emeritus Professor of History, Banji Akintoye, Pa Ayo Adebanjo of Afenifere only expressed his opinion on the 2023 presidency.\nSecretary-General of YCE, Dr Kunle Olajide, said he was opposed to the position of Pa Adebanjo."
  },
  {
    "headline": "Abdullahi Adamu: No Decision Yet on Zoning of APC’s Presidential Ticket",
    "summarized_story": "The PDP likewise screened all its 17 presidential aspirants yesterday and disqualified two aspirants – Dr. Nwachukwu Anakwenze and Cosmas Ndukwe.\nThe APC swapped its national offices between North and South, leading to the emergence of Adamu from the North-central as the National Chairman in March.\nToday, for me, just as an example, to contest the national chairman of our party, I had to pay N20 million.\nFive of the presidential aspirants have so far paid N100 million and picked up their forms.\nWe don’t foresee any opposition in the contest.”PDP Screens Presidential AspirantsThe PDP yesterday screened all its presidential aspirants ahead of its National Convention slated for May 30."
  },
  {
    "headline": "President Backs Ultramodern Royal Museum at Oba of Benin’s Palace",
    "summarized_story": "The President announced his support while receiving in audience at the State House, Abuja, the Oba of Benin, H.R.M.\nOmo N’Oba Uku Akpolokpolo Ewuare II, accompanied by members of the Royal Court of Benin and the Board of Trustees of the Benin Royal Museum.\nThe Royal Museum, to be housed in the palace of the Oba of Benin, is in conjunction with the National Commission for Museums and Monuments (NCMM).\nWhen concluded, it will signify the return to Nigeria by Germany of all the 1,130 Benin Bronzes in Germany’s public museums.\n‘‘Furthermore, on the 7th of this month, the Glasgow City Council agreed to return 17 Benin Bronzes to Nigeria."
  },
  {
    "headline": "Breaking; PDP Disqualifies Two Presidential Aspirants, Clears 15",
    "summarized_story": "*Says disqualified aspirants can appeal if not satisfiedChuks Okocha in AbujaThe David Mark-led PDP Presidential screening committee Friday announced the disqualification of two presidential aspirants, stating that they did not meet the committee’s criteria.\nHowever, Mark who briefed journalists after the PDP Presidential screening exercise said that it cleared 15 other aspirants.\nThe chairman of the committee said that those disqualified still had the right of appeal.\nThe appeal committee is headed by the National Chairman of the PDP, Dr. Iyorchia Ayu.\nThe report of the committee, Mark said, will be submitted to the National Working Committee of the party Saturday night."
  },
  {
    "headline": "Buhari Receives Oba of Benin in State House, Says Germany to Return 1,130 Looted Bronzes",
    "summarized_story": "The President gave the assurance while receiving in audience at the State House, Abuja, the Oba of Benin, Oba Ewuare II, accompanied by members of the Royal Court of Benin and the Board of Trustees of the Benin Royal Museum.\nThe Royal Majesty was at State House to thank the President on the recent return of two important Benin Bronzes to its original place of abode by the University of Cambridge and the University of Aberdeen, both in the United Kingdom, after 125 years.\nSpeaking on the return of the artefacts, President Buhari expressed delight that it had brought immense goodwill and acclaim to Nigeria, the ancient Benin Kingdom as well as happiness to the Oba of Benin.\nWhen concluded, it will signify the return to Nigeria by Germany of all the 1,130 Benin Bronzes in Germany’s public museums.\nThis will be a monumental achievement.‘‘Furthermore, on the 7th of this month, the Glasgow City Council agreed to return 17 Benin Bronzes to Nigeria."
  },
  {
    "headline": "Adamu: APC Has Not Taken Decision on Zoning Presidential Ticket",
    "summarized_story": "Deji Elumoye in AbujaThe ruling All Progressives Congress (APC) has declared that it has not taken a decision on where to zone the 2023 presidential ticket to.\nAsked where the ruling party will be zoning its presidential ticket to, Senator Adamu said taking such decision would be the job of the entire party, which he said is bigger than himself as Chairman.\nHis words:“I am today privileged to be the Chairman of the party.\nThe party has not made a decision and I cannot preempt what the party decision will be”.\nThe Northern Elders’ Forum (NEF), had on Thursday, told the major political parties to throw the contest for their presidential tickets open to all sections of the country, asserting that the zoning system is no longer desirable."
  },
  {
    "headline": "BREAKING: Nnamdi Kanu Appeals Court Judgement Retaining Seven Of 15 Charges Against Him, Alleges Miscarriage Of Justice",
    "summarized_story": "Kanu had been standing trial on an amended 15-count charge bordering on treasonable felony.\nNnamdi KanuOn April 8, Binta Nyako, the judge, ruling on Kanu’s application on Friday, struck out counts 6, 7, 9, 10, 11, 12, 13 and 14.\nThis means the IPOB leader is to stand trial on counts 1,2,3,4,5,8 and 15.\nThe separatist leader faulted Nyako's ruling on the case, arguing that the judge erred in several areas which amount to a \"miscarriage of justice\".\n“Ground five: error in law."
  },
  {
    "headline": "BREAKING: Nnamdi Kanu Appeals Court Judgement Retaining Seven Of 15 Charges Against Him, Alleges Miscarriage Of Justice",
    "summarized_story": "Kanu had been standing trial on an amended 15-count charge bordering on treasonable felony.\nNnamdi KanuOn April 8, Binta Nyako, the judge, ruling on Kanu’s application on Friday, struck out counts 6, 7, 9, 10, 11, 12, 13 and 14.\nThis means the IPOB leader is to stand trial on counts 1,2,3,4,5,8 and 15.\nThe separatist leader faulted Nyako's ruling on the case, arguing that the judge erred in several areas which amount to a \"miscarriage of justice\".\n“Ground five: error in law."
  },
  {
    "headline": "BREAKING: One Killed, Many Injured As Lawless Policemen Open Fire On Shiites During Rally In Kaduna",
    "summarized_story": "At least one person was killed while many others were injured when policemen opened fire on members of the Islamic Movement in Nigeria (IMN), popularly known as Shiites during annual Quds Day rally in Zaria, Kaduna State.\nQuds Day, which uses the Arabic name for Jerusalem, is a Palestinian solidarity day held every year by IMN members on the last Friday of the Muslim fasting month of Ramadan.\nAn eyewitness, who spoke with SaharaReporters, disclosed that the IMN members were peacefully going about their protest when policemen emerged all of a sudden and began firing live bullets at them.\nHe said others who sustained bullet wounds and are currently battling for their lives in hospital."
  },
  {
    "headline": "BREAKING: One Killed, Many Injured As Lawless Policemen Open Fire On Shiites During Rally In Kaduna",
    "summarized_story": "At least one person was killed while many others were injured when policemen opened fire on members of the Islamic Movement in Nigeria (IMN), popularly known as Shiites during annual Quds Day rally in Zaria, Kaduna State.\nQuds Day, which uses the Arabic name for Jerusalem, is a Palestinian solidarity day held every year by IMN members on the last Friday of the Muslim fasting month of Ramadan.\nAn eyewitness, who spoke with SaharaReporters, disclosed that the IMN members were peacefully going about their protest when policemen emerged all of a sudden and began firing live bullets at them.\nHe said others who sustained bullet wounds and are currently battling for their lives in hospital."
  },
  {
    "headline": "The Problem With Social Media In-laws And Celebrity Marriages By Matthew Ma",
    "summarized_story": "On the opposite side, people have unfortunately used social media to provoke, instigate or stifle public anger towards specific instances or persons.\nAlthough there are no official statistics to know how social media is destroying marriages in Nigeria, many examples of celebrity marriages have gone sour because of the influence of social media in-laws.\nFollowing this news was a series of mixed reactions from social media in-laws.\nSome social media in-laws, who commented on the issue, faulted the actress for expressing her marital problems on social media.\nSome social media in-laws reported that the couple had been going through trying times for years because of Agwu’s ill health."
  },
  {
    "headline": "MATTERS ARISING: Should ministers nursing political ambitions resign?",
    "summarized_story": "While state political appointees seeking elective offices in the 2023 general election are resigning in droves, their counterparts at the federal level have refused to relinquish their positions.\nThe unwillingness of President Muhammadu Buhari’s cabinet members, who are nursing political ambitions, to step down from office has continued to generate mixed reactions from Nigerians.\nAdvertisementThe Electoral Act does not, however, specify the number of days a political appointee has to resign before a party’s primary.\nPolitics and good governance experts say the political ambitions of Buhari’s cabinet members will clash with their expected duties, consequently affecting governance.\nThis is why it is morally right for political appointees to resign their office and focus on their campaigns."
  },
  {
    "headline": "MATTERS ARISING: Should ministers nursing political ambitions resign?",
    "summarized_story": "While state political appointees seeking elective offices in the 2023 general election are resigning in droves, their counterparts at the federal level have refused to relinquish their positions.\nThe unwillingness of President Muhammadu Buhari’s cabinet members, who are nursing political ambitions, to step down from office has continued to generate mixed reactions from Nigerians.\nAdvertisementThe Electoral Act does not, however, specify the number of days a political appointee has to resign before a party’s primary.\nPolitics and good governance experts say the political ambitions of Buhari’s cabinet members will clash with their expected duties, consequently affecting governance.\nThis is why it is morally right for political appointees to resign their office and focus on their campaigns."
  },
  {
    "headline": "SPOTLIGHT: 'We can’t hear but can work’ -- meet PWDs thriving at Sheraton Lagos Hotel",
    "summarized_story": "But Betty Olayikan and Yewande Odutoye, who are deaf and currently work at the Sheraton Hotel Lagos, have had interesting experiences growing up.\nSpeaking on her job, which she secured through Project Enable Africa and the Youth Empowerment Program, Betty said she enjoys working in the kitchen at Sheraton Lagos Hotel.\nYewande Odutoye, a worker at the housekeeping department of Sheraton Lagos Hotel, was born deaf.\nShe, however, said although growing up was tough, she is grateful for the opportunity of working at the hotel.\n“Life wasn’t easy growing up."
  },
  {
    "headline": "SPOTLIGHT: 'We can’t hear but can work’ -- meet PWDs thriving at Sheraton Lagos Hotel",
    "summarized_story": "But Betty Olayikan and Yewande Odutoye, who are deaf and currently work at the Sheraton Hotel Lagos, have had interesting experiences growing up.\nSpeaking on her job, which she secured through Project Enable Africa and the Youth Empowerment Program, Betty said she enjoys working in the kitchen at Sheraton Lagos Hotel.\nYewande Odutoye, a worker at the housekeeping department of Sheraton Lagos Hotel, was born deaf.\nShe, however, said although growing up was tough, she is grateful for the opportunity of working at the hotel.\n“Life wasn’t easy growing up."
  },
  {
    "headline": "Bala Mohammed: Running for president not easy -- but I'm doing it for Bauchi",
    "summarized_story": "Bala Mohammed, governor of Bauchi state, says launching a presidential bid is not a walk in the park.\nMohammed said it is “not easy” to be on a presidential campaign trail while at the same time serving as governor of Bauchi state.\nThe Peoples Democratic Party (PDP) presidential hopeful, however, said he embarked on the mission to “put Bauchi on the map”.\nThe contenders are Udom Emmanuel, governor of Akwa Ibom; Nyesom Wike, governor of Rivers; Dele Momodu, publisher of Ovation Magazine; and Anyim Pius Anyim, former senate president.\nOthers are former Vice-President Atiku Abubakar, Bukola Saraki, ex-senate president; Ayo Fayose, former governor of Ekiti; and Peter Obi, ex-governor of Anambra state."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "A Kenyan Eden",
    "summarized_story": "Remember we had a Twitter Space titled Do startups need financial literacy?\nSince then, 95 companies have participated as of the Winter 2022 launch, about half of which are financial services providers, and 51 are from Nigeria.\nEden Life’s expansion and acquisitionEden Life, a Lagos-based startup, has announced plans to expand into Nairobi, Kenya.\nBuilding on its success in Lagos, Nigeria, Eden says it intends to remove obstacles to discovering dependable household services in Nairobi.\nWhat I’m reading and watchingOpportunitiesThe FT x Cardano Blockchain Challenge is sourcing ventures building or interested in leveraging the Cardano blockchain platform and community."
  },
  {
    "headline": "“All startup founders must be financially literate.” – Olumide Adesina",
    "summarized_story": "Share this article:What do you think of when you hear financial literacy for startups?\nIf you’re like most people, you’re probably wondering why startups have to be financially literate, especially when much of the conversation around financial literacy has been about personal finance.\nAs surprising as it is, even businesses need financial literacy.\nHowever, he pointed out that knowing about financial issues does not equate to financial literacy.\nWith many startups opting for venture capital investments, Adesina observed that founders need to be careful while deciding what kind of investment they accept."
  },
  {
    "headline": "Another NFT hack?",
    "summarized_story": "Billed as the next generation of the web, Web3 focuses on decentralisation using decentralised blockchains.\nLet NFT artists and blockchain devs show you the ropes at the Techpoint Africa Blockchain Summit.\nAnother NFT phishing schemeOn Monday, April 25, 2022, the Instagram account of the popular NFT collection, Bored Ape Yacht Club (BAYC), was hacked.\nEssentially, the hacker duped victims into handing over control of their wallets by creating a fake advertisement for an upcoming NFT project.\nThe hacker tricked users into clicking a link to “mint” a bogus NFT by sending Ethereum (eth) and, in some cases, an NFT to wrap into a token."
  },
  {
    "headline": "Bekonta extends blockchain awareness and user education to Serving Corps Members.",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Blockchain awareness and user education is a background check that must be done to foster blockchain adoption.\nThe Festival of Culture with the Bekonta presence engaged Youth Corps Members in a unique way.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Get 30GB Free Data from Geneix and Free Ear Buds when you buy the Infinix Hot 12",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:The recently launched Hot12 from Infinix is nothing short of Hot, Bold, Trendy.\nYou can bet on a Fast and Fun Vibe with the Hot series, but not just that.\nYou can enjoy the best of your internet experiences with a whopping 30GB worth of free data and free quality ear buds for a blissful smartphone experience.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Nigerians forgo staple food items as inflation bites",
    "summarized_story": "The recent hike in food prices has caused many Nigerians to rethink their food consumption pattern.\n“It’s crazy how Nigeria’s food inflation simply forces you to forgo some food items and move on with your life.\nQuoting the NBS reports on selected food prices, FBN Quest capital, an investment firm, noted that all 43 food items surveyed increased by about 28.8% year on year average.\nPeople now cope with the rise in food inflation by either foregoing a particular food item for a cheaper one or skipping a meal a day all to meet their budget.\nImported food inflation increased by about 8bps to 17.56%."
  },
  {
    "headline": "Eurobond fails to lift reserves as more borrowing underway",
    "summarized_story": "The $1.25bn Eurobond Nigeria issued in March this year failed to shore up the country’s external reserves, which dropped by 2.15 percent year-to-date, even as the federal government plans more external borrowing, BusinessDay findings show.\nExternal reserves dropped to $39.64 billion on April 27, 2022 from $40.15 billion on January 4, 2022, according to data from the Central Bank of Nigeria (CBN).\nRead also: Nigeria’s new Eurobond to push external reserves to $40bn – FBNQuestRising import bill continued to exert pressure on external reserves and this is expected to continue into the year, said FSDH Research.\nForeign exchange reserves, according to the CBN, are assets held on reserve by a monetary authority in foreign currencies.\nThe gross reserves are calculated on a 30-day moving average basis."
  },
  {
    "headline": "Africa faces infrastructure financing gap of $108bn annually – Adesina",
    "summarized_story": "The African Development Bank (AfDB) says that Africa currently faces an infrastructure financing gap of between $68 billion and $108 billion annually.\n“Other solutions are improving public financing for infrastructure, mobilising financing for green infrastructure, attracting the private sector, and dealing with risks, among others,’’ he said.\n“This pool of capital is so vast that what is needed is only 0.03 percent or up to 0.04 percent to bridge the infrastructure financing gap for Africa.\nHe called on governments to focus more on attracting the private sector to infrastructure financing.\nHe said the bank’s board had also approved a new PPP framework for financing infrastructure."
  },
  {
    "headline": "BIU LAWSA Laud Hon. Andrew Emwanta, Erstwhile President of LAWSA for Dedication and Pragmatic approach to duty – Nigerian Observer",
    "summarized_story": "“I was so committed that little did I know I will become President of LAWSA.\nWe felt Law students should be trained in a manner that they should be able to separate the law and religion.\n“Those were some of the things we did when we were there and eventually I ran for the office of LAWSA President and I won.\n“As a former LAWSA President, the moment you invite me for an event I am under obligation to attend and that obligation extends to my colleagues who are lawyers.\n“Then secondly, the law students must work towards achieving any set target."
  },
  {
    "headline": "Obaseki approves policy on aging to cater for elderly persons in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has approved the Edo State Policy on Aging to provide social care and protection for senior citizens in the state.\nThe Edo State Commissioner for Orientation and Communication, Andrew Emwanta, who disclosed this to journalists in Benin City, said the policy is part of efforts by the government to uphold the rights and dignity of senior citizens.\nHe said the Governor approved the new policy at the weekly Executive Council (EXCO) meeting, at the Government House, Benin City.\nHe said, “The Executive Council has approved the Edo State Policy on Aging which will provide social care and protection for senior citizens.\nThe Council resolved that the policy should move from being a policy on aging to a policy for senior citizens and the age of senior citizens was put at 65 years and above after careful deliberations."
  },
  {
    "headline": "Obaseki hands over defunct Edo College of Education, urges FG to name institution after Tayo Akpata – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Thursday, handed over the defunct Edo College of Education, Ekiadolor to the Federal Government, imploring the government to rename the citadel of learning after the executive secretary of the defunct Petroleum Trust Fund (PTF) and one-time Commissioner for Education in old Bendel State, Chief Tayo Akpata.\nObaseki handed over the institution to the Minister of Education, Mallam Adamu Adamu, reassuring that his administration will sustain investment in technical and vocational education in the state.\nThe governor said, “The only thing we ask for is that the school be named after one of our visionary commissioners for education, Tayo Akpata, who transformed our education landscape.\n“For us sir, we’re hoping that you will make this school a school of excellence to train teachers in technical subjects.\nSo, this federal college of education, technical, is going to help us in the revolution that we seek to achieve in our educational system in Edo."
  },
  {
    "headline": "Ex-gov’ship Candidate Appeals To EDSG To Tackle Insecurity – Nigerian Observer",
    "summarized_story": "Oboh said it is a known fact that the predominant occupation of the people in Esan land is farming, adding that due to the high level of insecurity in that region, they have ceased to go to their farms.\nShe decried that with the way things are and if not tackled, it may lead to a serious food crisis in that land.\nThe Esans are dying; the unknown herdsmen are killing our farmers.\nI am pleading to the conscience of our state governor, Godwin Obaseki, to use his executive powers to protect our farmers from being slaughtered.\nSecurity agents must be sent to the farm borders before more death and famine cripple our people for good, “she decried."
  },
  {
    "headline": "Osun 2022: Oyetola’s achievements enough to earn him second term – Ayeni",
    "summarized_story": "Lawrence Babatunde Ayeni, a member of the Federal House of Representatives, has said the achievements of Gov.\nGboyega Oyetola of Osun, within the space of three and half years in office, transcends the excessive seven and half years of the Peoples Democratic Party (PDP) rule in the state.\nDuring the reign of PDP for seven and half years in Osun State, there was nothing to show for.\n“He has reformed the educational system, improved the health indices of Osun by revitalizing every primary Healthcare centres in each of the wards in Osun.\nSome of the beneficiaries of the Empowerment Programme appreciated the kind gesture of the Lawmaker, urging other Political office holders to emulate him."
  },
  {
    "headline": "PenCom says 20 PFAs have met N5bn minimum regulatory capital",
    "summarized_story": "National Pension Commission (PenCom) says 20 Pension Fund Administrators (PFAs) have meet the April 27 deadline for a Minimum Regulatory Capital (shareholders’ fund) from N1 billion to N5 billion.\nPenCom made the disclosure in a statement on Friday, after approving recapitalisation for PFAs, with a 12-month transition from April 27, 2021, to April 27, 2022.\nDuring the start of the year, PenCom had issued certificates of compliance to 207 organizations.\nIt added that sustained growth in assets signifies increased responsibilities that require more operational capacity by the PFAs.\n“The commission approved the acquisition of AIICO Pension Managers Ltd. by FCMB Pensions Ltd. and the merger between Tangerine Pensions Ltd. and APT Pension Funds Managers Ltd.“It also approved a subsequent change of name of the merged entities to Tangerine APT Pensions Limited."
  },
  {
    "headline": "Access Holdings Plc posts N57bn profit for Q1 2022",
    "summarized_story": "Access Holdings Plc has posted a profit of N57.40 billion in Q1 2022, a 9.23% increase from the corresponding quarter of 2021.\nThe latest profit figure shows that Access Bank has grown its Q1 profits by 160% in 4 years since hitting N22 billion in Q1 2018 with the profit now touching roughly N57.40 billion.\nA further look at the numbers showed net interest income for the period declined by 7.03% from N93.96 billion to N87.36 billion.\nThe company also earned N160.32 billion, from its lending business as Interest income grew by 27.27% from N125.97 billion.\nIt recorded loan losses growth of 9.17%, while net interest income after impairments depreciated by 9.52% to stand at N73.67 billion."
  },
  {
    "headline": "Osun 2022: What I’ll do differently to improve pensioners, worker’s as governor – Ogunbiyi",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe governorship candidate for Accord Party in the July 16th gubernatorial election in Osun state, Dr. Akin Ogunbiyi has said what he would differently to improve the welfare of the state citizens if elected governor.\nOgunbiyi said Osun’s economy is in dire straits with civil service as the only source of income.\nThe Accord party flagbearer stated this during a visit to the state secretariat of the Nigeria Union of Pensioners, NUP in Osogbo on Thursday.\nAccording to him, the only way to enhance economic viability of the state is to make it an industrial hub.\nThe meeting was witnessed by representatives of different groups within the Osun NUP"
  },
  {
    "headline": "2023: Withdraw Statement On Zoning, Arewa Youths Tell APC Chairman",
    "summarized_story": "The Arewa Consultative Youth Forum (ACYF) has called on the national chairman of the ruling All Progressives Congress (APC), Senator Abdullahi Adamu, to quickly withdraw his statement that the party has not taken a position on zoning elective positions for 2023 elections.\nThe ACYF, in a statement on Saturday, said the statement credited to Adamu was capable of heating the polity and spelling doom for the party if not quickly withdrawn.\nThe statement reads, “The unfortunate statement credited to Senator Adamu is regrettable just as it is demeaning of his status as the chairman of a ruling party.\n“His statement that no agreement had been reached on zoning is not in the best interest of the party.\n“The statement is capable of leading to electoral defeat for our great party if not quickly withdrawn."
  },
  {
    "headline": "Pull-up Naija To Sensitise Nigerian Youths For 2023 General Elections",
    "summarized_story": "As the 2023 General Elections draws closer, advocacy group, Pull-up Naija is set to sensitise Nigerian youths to participate actively and exercise their voting rights.\nPull-up founder and film producer, Hauwa Allahbura said the initiative is the concept of 24 Angels borne out of the passion to foster youth participation in elections and voting.\nThe group in a statement said its main objective is to register youths as active voters to enable them take their destinies in their hands.\nIt would host enlightenment campaigns that will feature INEC measure to ensuring that all votes count.\nADVERTISEMENTWith an aim to unite Nigerian youths from different stratas, Pull-up Naija promises to have youth interact with their role models and captain of industries one-on-one."
  },
  {
    "headline": "Estate Surveyors Task Federal Govt On Development Of Intellectual Property Hub",
    "summarized_story": "The Business Assets and Intellectual Property Valuation Division of the Nigerian Institution of Estate Surveyors and Valuers (NIESV) has called on the Federal Government to give priority attention to the development of Intellectual Property Hub in the country.\nThe Division’s chairman, Olalekan Akinwunmi, made this call in Lagos during the World Intellectual Property Day 2022.\nThis year, all over the globe, the theme of the IP day was on “IP and Youth: Innovating for a Better Future”.\nApril 26 every year is celebrated as Intellectual Property Rights’ Day.\nAll member states of the World Intellectual Property Organization use the opportunity to explore the role of Intellectual Property (IP) in the economy, while also encouraging innovation and creativity, and right policies that ensure that inventors and creators get handsome rewards for their services."
  },
  {
    "headline": "Estate Surveyors Task Federal Govt On Development Of Intellectual Property Hub",
    "summarized_story": "The Business Assets and Intellectual Property Valuation Division of the Nigerian Institution of Estate Surveyors and Valuers (NIESV) has called on the Federal Government to give priority attention to the development of Intellectual Property Hub in the country.\nThe Division’s chairman, Olalekan Akinwunmi, made this call in Lagos during the World Intellectual Property Day 2022.\nThis year, all over the globe, the theme of the IP day was on “IP and Youth: Innovating for a Better Future”.\nApril 26 every year is celebrated as Intellectual Property Rights’ Day.\nAll member states of the World Intellectual Property Organization use the opportunity to explore the role of Intellectual Property (IP) in the economy, while also encouraging innovation and creativity, and right policies that ensure that inventors and creators get handsome rewards for their services."
  },
  {
    "headline": "Excitement As Contactless Technology, BleanQ, Launched In Abuja",
    "summarized_story": "As the physical and digital worlds continue to blend into one, a new contactless technology has been introduced into Nigeria through BleanQ.\nThe new contactless technology developed by Zkyte Technologies was launched on Friday by the Minister of Youth and Sports Development, Mr Sunday Dare, at the Silverbend Cinema, Abuja.\nADVERTISEMENT“Contactless technology, Near Field Technology e-commerce e-transactions have changed how the world operates and this comes with huge economic benefits.\nExplaining the technology, the managing director of Zkyte Technologies, Ayoola Daudu said: “With this technology, you do not necessarily need to be everywhere.\nIt also has a contactless way of making payments unlike the normal ATM cards.”Speaking on the readiness of Nigerians to embrace the new technology, Ayoola stated that Nigerians are the largest mobile users in Africa."
  },
  {
    "headline": "Ozekhome, Falana clash over Jonathan",
    "summarized_story": "Senior lawyer Mike Ozekhome said former President Goodluck Jonathan can contest the 2023 election despite having completed Umaru Yar’Adua’s tenure and being elected in 2011.\nOzekhome made this argument in a long essay, a reply of sorts to his colleague, Femi Falana, who had argued that Jonathan was not qualified.\nIn a statement, Falana said Jonathan cannot contest the election by virtue of Section 137 (3) of the Constitution of the Federal Republic of Nigeria, 1999 (as amended).\n“It is not in dispute that Dr. Jonathan became the President of Nigeria in 2010 following the sudden death of President Umaru Yar’Adua.\nHaving spent 5 years in office as President, Dr. Jonathan is disqualified from contesting the 2023 presidential election."
  },
  {
    "headline": "Davido's baby mama Chioma marks 27th birthday with gorgeous photos",
    "summarized_story": "Chioma Avril Rowland the third baby mama of Nigerian music star, Davido, is celebrating her 27th birthday today, April 20, 2022.\nCelebrating herself on her big day, the mum of one took to social to share gorgeous photos of herself.\nIn a post on her Instagram page, she wrote: “27 and gorgeous!\nI’m grown 😂🤪🎉🎉”Chioma and Davido started dating in late 2017 and went exclusive the following year.\nThe music star proposed to her in 2019, days after their introduction."
  },
  {
    "headline": "Soludo seeks establishment of Bayern Academy in Anambra",
    "summarized_story": "Chukwuma Soludo has urged Bayern Munich FC of Germany to consider establishing an Academy in Anambra to deepen the game of football in Nigeria.\nSoludo made the request while welcoming the Bayern Munich technical team who were in the state for the National Youth Cup on Saturday.\nEmeka Okeke, Chairman, Aspire Foundation Board of Trustees said the Bayern Youth Cup partnership was part of the My Anambra Football Project which had a broad plan of developing football in Anambra.\nThe Bayern Youth Cup technical team is headed by Hans Pflugler, a retired Germany player and member of the 1990 world cup winning team.\nThe two-day Bayern National Youth Cup Nigeria 2022 would end on May 1."
  },
  {
    "headline": "BBNaija's Khafi given final warning by London Metropolitan Police",
    "summarized_story": "London Metropolitan Police officer Khafilat Kareem, who achieved fame as a Big Brother Nigeria participant, has been given a final written warning by the service.\nShe entered the Big Brother house in Lagos and lasted 77 days before being evicted, according to reports.\nThe panel found that gross misconduct was proven and PC Kareem should be given a final written warning.\n“A detailed investigation was carried out by the Met’s directorate of professional standards which concluded PC Kareem should face gross misconduct proceedings.\nAt the time she appeared on Nigeria’s Big Brother, the show’s website said the officer wanted “the exposure that being in Big Brother Naija House brings so that she can do societal good”."
  },
  {
    "headline": "More Photos Of Late Nollywood Actress, Chinedu Bernard",
    "summarized_story": "One of the sad events that is currently trending on social media is the death of talented Nollywood actress, Chinedu Bernard.\nHer death triggered mixed reactions among her fans, colleagues, and other well wishes, who were shocked by the news.\nAccording to Punch Newspapers, the actress was confirmed dead at the East Side Hospital in Enugu State after she slumped while cleaning the Chapel of St. Leo the Great Catholic Church in the Federal Housing area of the state yesterday.\nUntil her death, the actress popularly known as Choco featured in several movies including ‘The Mad’, ‘Money Fever’, ‘The Big Mama’s Stick’, ‘The Last Manhood’ and ‘Mad Love’.\nAs we continue to mourn her death, here are more beautiful pictures of the actress;May her soul rest in peace, Amen!"
  },
  {
    "headline": "Buhari to Oba of Benin: Nigeria is expecting return of 1130 looted Benin bronzes from Germany",
    "summarized_story": "President Muhammadu Buhari on Friday gave the assurance that the Federal Government would continue to vigorously pursue the repatriation of looted Nigeria’s artefacts from abroad, including 1,130 Benin Bronzes in Germany’s public museums.\nThe President gave the assurance while receiving the Oba of Benin, Oba Ewuare II, accompanied by members of the Royal Court of Benin and the Board of Trustees of the Benin Royal Museum at the Presidential Villa, Abuja.\nSpeaking on the return of the artefacts, President Buhari expressed delight that it has brought immense goodwill to Nigeria, the ancient Benin Kingdom as well as happiness to the Oba of Benin.\nWhen concluded, it will signify the return to Nigeria by Germany of all the 1,130 Benin Bronzes in Germany’s public museums.\n“Furthermore, on the 7th of this month, the Glasgow City Council agreed to return 17 Benin bronzes to Nigeria."
  },
  {
    "headline": "Ex-minister, Dalung, joins SDP, eyes House of Reps",
    "summarized_story": "A former Minister of Sports and Youth Development, Solomon Dalung, has joined the Social Democratic Party.\nDalung said “When I resigned from the APC and even before my resignation, I had taken a political party, the Social Democratic Party.\nSo, I have joined SDP.\nI only respond to calls to run for such elective position because I don’t see a political office as anything of personal benefit.\nMy concept of holding political position is selfless service."
  },
  {
    "headline": "Kano Billionaire Tahir Fadallah Is Dead",
    "summarized_story": "Tahir Fadallah, the billionaire owner of Tahir Guest Hotel Kano, has passed away.\nGarba Shehu, the official Spokesperson to President Muhammadu Buhari, confirmed the development on Friday.\nMay Allah grant him Aljannah”, Shehu wrote on Facebook with a picture of himself and Tahir.\nTahir, of Lebanese origin, was born in Kano and spoke Hausa fluently.\nRecall that Tahir tested positive to COVID-19 in 2020 and in order not to take any chances, he was evacuated on an Air ambulance to Beirut for treatment."
  },
  {
    "headline": "APC yet to zone presidential ticket – Adamu",
    "summarized_story": "…APC’ll win Ekiti governorship poll, he boasts …Assures of free, fair primariesThe chairman of the All Progressives Congress (APC), Senator Abdullahi Adamu, has said the governing party was yet to zone its presidential ticket for the 2023 elections.\nSenator Adamu stated this Friday in Abuja while speaking to State House Correspondents after presenting the party’s candidate for the Ekiti state governorship election, Biodun Oyebanji, to President Muhammadu Buhari.\nOptimism on Ekiti gov’ship pollMeanwhile, Senator Adamu has expressed optimism that the party would win the forthcoming Ekiti state gubernatorial election scheduled to take place in June this year.\nAdamu said this Friday in Abuja when he formally presented the APC candidate for the election to President Muhammadu Buhari.\nPresidential primaryAsked to comment on how the APC hopes to hold rancour free presidential primary election, the APC chairman said the process would be free and fair, culminating with the emergence of an acceptable candidate."
  },
  {
    "headline": "Atiku to PDP NWC on 2023 presidency: With my 11m votes, I deserve right of first refusal",
    "summarized_story": "He also told the party’s National Working Committee (NWC) that he deserved the right of first refusal, given his experience and competence.\nAnd in his response, the PDP national chairman, Dr Iyorchia Ayu, told the governor to settle for either of the two options, saying he cannot have the two all to himself alone.\nAyuIn his reaction, the PDP national chairman, Senator Ayu, said he won’t work for Atiku alone, but all the 17 aspirants.\nOrtom committeeConsequently, the PDP National Executive Committee (NEC) swiftly inaugurated a 37- man zoning committee led by Benue state Governor Samuel Ortom on the 24th of March, 2022.\n“On our part, we will ensure the party’s national convention and even congress at all levels to elect party’s candidate for all position is free, fair and credible.”Share this: TwitterFacebook"
  },
  {
    "headline": "Breaking: High profile football agent is dead",
    "summarized_story": "High-profile football agent Mino Raiola has died at the age of 54 following a battle with lung disease.\nRaiola represented the likes of Paul Pogba, Erling Haaland and Zlatan Ibrahimovic.\nBack in January, Raiola underwent checks in Italy after reports said he was rushed to hospital for surgery.\nGerman newspaper BILD said he was intensive care due to a lung disease, although his spokesperson downplayed the visit, saying: ‘Mino Raiola is undergoing the usual medical examinations that require anesthesia.\nA promising footballer growing up, Raiola took over the reins as the head of HFC Haarlem’s youth team aged just 20 in 1987 before beginning his career as a football agent."
  },
  {
    "headline": "Seplat Energy’s revenue grows by 58.6% to N100.6bn",
    "summarized_story": "The company also generated cash from its operations to the tune of N74.4bn from N1.7bn year-on-year, rising by 197.8 per cent.\nThe energy Company’s also grew its revenue by 58.6 per cent to N100.6bn from N57.9bn year-on-year; as its gross profit soars to N48.8bn from N20.1bn year-on-year, rising by 122.3 per cent.\nIn its operations, Seplat Energy demonstrated a strong safety record, which extended to 26.1 million hours without LTI from operated assets (2.0 million hours in Q1 2022).\nIt will also bring a significant undeveloped gas resource base which, alongside our ANOH gas project development, will underpin Nigeria’s energy transition and drive domestic and export revenues when developed.\n“We have proven we have the financial strength and credibility to attract international finance into Nigeria’s energy sector and this will help us in our aim to deliver energy transition and provide cleaner, more reliable and more affordable energy for Nigeria’s young and growing population.”"
  },
  {
    "headline": "Women in Oil, Gas to benefit from $40m NCDMB/NEXIM Bank Fund- Wabote",
    "summarized_story": "By Palma IleyeExecutive Secretary of the Nigerian Content Development and Monitoring Board, NCDMB, Engr.\nSimbi Kesiye Wabote has said on Wednesday that women entrepreneurs in the Nigerian oil and gas industry should break barriers by taking advantage of the $40m fund created specifically for them under the Nigerian Content Intervention Fund, NCI Fund.\n“To provide a fair chance for women in the oil and gas industry, the Board partnered with the NEXIM Bank to establish a $20 million fund that was matched with an additional $20 million fund by NEXIM bank, making the total pool of funds available to women in oil and gas to be $40 million,” he said.\nHe explained that the Board and its partners have introduced and implemented several initiatives that promote diversity in the oil and gas industry.\nHe added that “the Board has also organized events that were targeted at women and community activities to promote inclusiveness."
  },
  {
    "headline": "N69.4bn Debt: Court orders stay of contempt proceedings initiated by Jimoh Ibrahim against AMCON",
    "summarized_story": "CA/ABJ/CV/269/2022 in the case between the Asset Management Corporation of Nigeria (AMCON) vs Barrister Jimoh Ibrahim has ruled that all proceedings including the contempt proceedings initiated by Barrister Jimoh Ibrahim and co at the trial court should be stayed pending the hearing, and determination of the substantive appeal.\nWith that ruling, Barrister Jimoh Ibrahim and Co have been again neutralized from executing the said contempt proceedings order, which he obtained under questionable circumstances.\nAMCON over the years had tried all reasonable and peaceful resolution strategies to recover the debt from Jimoh Ibrahim to no avail.\nFHC/ABJ/CS/760/2021 to seek justice, and accordingly received an order of the trial court to take over the businesses of Jimoh Ibrahim.\nAMCON further received the backing of the trial court to appoint a Receiver/Manager to oversee the businesses on behalf of AMCON."
  },
  {
    "headline": "MTNN, Pan-Atlantic University launch media innovation programme",
    "summarized_story": "By Kehinde Ibrahim, LagosMTN Nigeria and Pan-Atlantic University (PAU), yesterday, announced the launch of the MTN Media Innovation Programme (MTN MIP), which will be run by PAU’s School of Media and Communication (SMC).\nThe six-month, fully funded fellowship for Nigerian media practitioners is designed to support the sustainable development of the nation’s changing media scene.\nIt is open to media practitioners across the spectrum, including print, electronic, online platforms and social media content creators.\nThus, it is only fitting that we support developments in the Nigerian media space with our infrastructure and enable capacity building initiatives to enable innovation in media practice.\nThe MTN Media Innovation Programme could not have come at a better time for Nigerian media practitioners to imbibe these pertinent values,” Professor Enase Okonedo, Vice Chancellor, Pan-Atlantic University, added."
  },
  {
    "headline": "NCC moves to strengthen colocation, infrastructure sharing market segment",
    "summarized_story": "By Asuelimen OsasuyiNigerian Communications Commission, NCC, has commenced the process of conducting a study to assess the current level of competition in the colocation and infrastructure sharing, CIS, segment of the Nigerian telecommunications sector.\nAccording to NCC, seventy-eight licensees are currently operating in that market segment.\nThe NCC takes this issue as priority in view of the critical role played by the colocation and infrastructure sharing segment of the telecom ecosystem in ensuring robust services.\nFor instance, at the time the 2013 study was conducted, the CIS market segment was still at embryonic stage and as such, much emphasis was not placed on it.\nThe Director PCEA also informed that activities in the CIS market have also attained the targets set out in the Nigerian National Broadband Plan (2020-2025)”."
  },
  {
    "headline": "Goodluck Jonathan Constitutionally Qualified To Run For Presidency – Ozekhome",
    "summarized_story": "Human Rights lawyer and Senior Advocate of Nigeria (SAN), Mike Ozekhome has said that former President Goodluck Jonathan, is constitutionally qualified to run for president.\nThe case of Jonathan running had been challenged in CYRIACUS NJOKU V GOODLUCK EBELE JONATHAN (2015) LPELR-244496 (CA).\nIndeed, the Court of Appeal had awarded the sum of N50, 000 each as cost to the defendant, President Jonathan.\nSurely, when President Jonathan in May, 2010 stepped into the shoes of late President Yar’Adua, he merely fulfilled constitutional provisions.\nBut, as regards his eligibility to contest, Dr Goodluck Ebele Azikiwe Jonathan is pre-eminently constitutionally, morally and legally qualified to contest the 2023 presidential election."
  },
  {
    "headline": "PDP Committee Disqualifies Two Presidential Candidates After Screening",
    "summarized_story": "﻿The Peoples Democratic Party’s presidential screening committee has disqualified two of its aspirants.\nChairman of the committee, Sen. David Mark announced this on Friday after the committee concluded its screening of the party’s 17 aspirants.\nSen. Mark did not disclose the identity of the disqualified candidates.\nThe disqualified candidates are expected to forfeit the N40 million each of them paid for the expression of interest and nomination forms.\nThe screening, according to one of the aspirants – Sen Anyim Pius Anyim – was designed to verify the candidates’ membership and financial status, academic credentials, and other requirements for a presidential candidate as spelled out in the constitution."
  },
  {
    "headline": "2023: APC Does Not Regret N100m Nomination Fee – Adamu",
    "summarized_story": "The National Chairman of the All Progressives Congress (APC), Senator Abdullahi Adamu, says the party does not regret pegging its presidential nomination form at N100m.\nHe said this on Friday while addressing State House Correspondents after presenting the Ekiti APC governorship candidate, Abiodun Oyebanji, to President Muhammadu Buhari.\nREAD ALSO: [2023] PDP Presidential Committee Begins Screening Of AspirantsThe former lawmaker explained that the move was to ward off unserious contenders and raise sufficient funds ahead of the upcoming elections.\nAside from this, the APC leader also said the party has not yet taken a decision on the zoning of its presidential candidate for the 2023 election.\nSo we want to see that we are able to mobilise sufficient funds to support our efforts to win election."
  },
  {
    "headline": "Electoral Act: Your Election Can Be Annulled, Gbajabiamila Tells Appointees Yet To Resign",
    "summarized_story": "﻿The Speaker of the House of Representatives Femi Gbajabiamila has advised political appointees seeking elective positions to resign, saying their elections might be annulled if they refused to do so.\nAccording to him, Section 84(12) of the Electoral Act 2022, which stipulates that political appointees should resign before seeking political offices in the next election, should be obeyed.\nAnd that particular provision had a reason behind it,” the lawmaker said.\n“But then, there is also a court decision that said that nullification by the court should not be executed as of yet.\nThen, there has also been an appeal by the National Assembly to set it aside."
  },
  {
    "headline": "2022 WAFCON: Super Falcons, Banyana Banyana To Clash Again",
    "summarized_story": "The 2022 Women’s African Cup of Nations will have a repeat of the Nigeria against South Africa battle.\nThe Super Falcons have been drawn to play Banyana Banyana, Botswana and Burundi in Group C of the 14th Women Africa Cup of Nations taking place 2nd – 23rd July in Morocco.\nNigeria and South Africa faced off in the same group at the last edition of the competition in Ghana, with the South African ladies winning by the odd goal.\nThe Super Falcons eventually triumphed 4-3 on penalties to win a record 9th title.\nREAD ALSO: Super Falcons To Know AWCON Opponents On FridayHost nation Morocco lead Group A which also has Burkina Faso, Senegal, and Uganda, while Cameroon head Group B where they compete with Zambia, Tunisia, and Togo."
  },
  {
    "headline": "Peterside asks Wike to release detained Farah Dagogo within 48 hours -",
    "summarized_story": "Wike on how he obtained evidence linking the lawmaker to an alleged disruption of proceedings at the Rivers State Secretariat of the Peoples Democratic Party, PDP.\n“Wike had lied at several times such that these days his claims must be subjected to forensic investigation before believed.\nWhile calling on lovers of democracy and free speech to condemn Wike and his fascist style of governance, Peterside reiterated his 48-hour ultimatum to Gov.\n“Wike has 48 hours to ensure that Honourable Farah is set free and allowed to continue to pursue his political aspiration.\nWike cannot be junketing in pursuit of his presidential ambition using Rivers State resources while wickedly gagging another’s on the altar of ego."
  },
  {
    "headline": "Asiwaju Tinubu Receives APC Presidential Nomination Forms -",
    "summarized_story": "The National Leader of the All Progressives Congress and Frontline Presidential Aspirant, Asiwaju Bola Ahmed Tinubu, has received his Expression of Interest and Nomination Forms to enable him participate in the Presidential Primaries of the Party.\nAsiwaju Tinubu who just returned to the Country after performing the lesser Hajj (Umrah) in Mecca received the forms from Lagos State Governor, Babajide Olusola Sanwoolu.\nHis support groups led by former Secretary to the Government of the Federation, Babchir Lawal, and Senator Dayo Adeyeye purchased the forms for him on Friday afternoon.\nThe Party’s Presidential Primaries will hold between the 30th of May and 1st of June.\nThe Party’s Presidential contest has become increassingly crowded in recent days with the declaration of the Vice President Yemi Osinbajo, Governors Yahaya Bello of Kogi State and Kayode Fayemi of Ekiti State, Senators Ibikunle Amosun and Chris Ngige, Minister of Transportation, Rotimi Amaechi, Minister of Education, Chkwuemeka Nwajiuba and Others."
  },
  {
    "headline": "You have my best wishes, Buhari tells Ekiti APC Gov'ship candidate, Abiodun Oyebanji -",
    "summarized_story": "President Muhammadu Buhari on Friday, at the State House, presented APC flag to the governorship candidate of the party in Ekiti State, Abiodun Oyebanji.\nMr Oyebanji was led to the President by National Chairman of the party, Senator Abdullahi Adamu, the National Secretary, Senator Iyiola Omisore, and Governor Kayode Fayemi of Ekiti State.\n“You have served Ekiti State in many capacities, including as Chief of Staff, Commissioner, and Secretary to the State Government.\nThe National Chairman said APC was planning to win the contest, “by the grace of God,” adding that it was the reason the candidate was being presented for presidential blessings.\nGovernor Fayemi said Oyebanji had been involved in governance in Ekiti in the past 20 years, and has acquitted himself creditably."
  },
  {
    "headline": "We have not Zoned our Presidential Ticket Yet",
    "summarized_story": "The All Progressives Congress (APC) says it has not zoned its presidential ticket for the 2023 elections.\nThe Party’s National Chairman Senator Abdullahi Adamu disclosed this while speaking to State House Correspondents after presenting the party’s candidate for the Ekiti governorship election, Biodun Oyebanji, to President Muhammadu Buhari.\nThe ruling party had swapped its national offices between North and South, leading to the emergence of Adamu from the North Central as the national chairman.\nKaduna Governor Nasir el-Rufai just before the party’s National Convention, said that even though the APC had not decided on zoning the presidential ticket, the swapping of national offices was an indication of where its presidential candidate would come from.\nBut when asked where the ruling party would be zoning its presidential ticket to, Adamu said taking such decision would be the job of the entire party, which he said is bigger than himself as Chairman."
  },
  {
    "headline": "India Seizes $725m in Xiaomi Assets Over Illegal Remittances",
    "summarized_story": "India said on Saturday it had seized $725 million from the local bank accounts of China’s Xiaomi Corp (1810.HK) after a probe found the smartphone maker had made illegal remittances to foreign entities by passing them off as royalty payments.\n“Such huge amounts in the name of royalties were remitted on the instructions of their Chinese parent group entities,” the directorate said in a statement.\nThe directorate’s actions signal widening scrutiny of the Chinese smartphone maker, whose India office was raided in December in a separate investigation over alleged income tax evasion.\nSome other Chinese smartphone markers were also raided at the time.\nReuters reported on April 12 that Xiaomi’s former India head, Manu Kumar Jain, had been summoned for questioning as part of the directorate’s investigation."
  },
  {
    "headline": "UK Lawmaker Says He Opened Porn in Parliament By Mistake",
    "summarized_story": "A British lawmaker suspended by Prime Minister Boris Johnson’s Conservative Party following accusations that he watched pornography on his phone in the House of Commons debating chamber has said he opened the explicit content in error.\nNeil Parish was suspended as a Conservative lawmaker on Friday after reporting himself to parliament’s standards commissioner.\nHe has said he will continue as a member of parliament while an investigation is carried out.\n“It was all very embarrassing,” the newspaper quoted Sue Parish as saying.\n“People shouldn’t be looking at pornography."
  },
  {
    "headline": "Ukraine Says Russia Pounding Donbas, Failing to Take Targets",
    "summarized_story": "Russian forces pounded Ukraine’s eastern Donbas region on Saturday but failed to capture three target areas, Ukraine’s military said, while Moscow said Western sanctions on Russia and arms shipments to Ukraine were impeding peace negotiations.\nUkraine accuses Russian troops of atrocities in areas near the capital, Kyiv, that they previously occupied.\nMykola Lukashuk, head of the Dnipro regional council, said Russian forces had shelled the outskirts of Velyka Kostromka in the Kryvyi Rih area.\nUkraine dismisses Putin’s claims of persecution and says it is fighting an unprovoked land grab to fully capture Donetsk and Luhansk, which form the Donbas region.\nWestern officials said Russia had suffered fewer casualties after narrowing the scale of its invasion but that numbers were still “quite high”."
  },
  {
    "headline": "Nigeria: 68 Abducted Train Passengers Spend Day 34 in the Dungeon of Terrorists, Freedom Still Not in Sight, Families Frustrated",
    "summarized_story": "Last Tuesday, the terrorists released three new photos showing 62 of the abducted passengers, including children and women.\nThree weeks back, the terrorists released a two-minute video, showing scores of abductees sitting in a forest, including men, women and children.\nSome of the elderly among the abducted passengers are clearly experiencing deteriorating health conditions.\nA disturbed relative told THISDAY last Thursday that his uncle was among the abducted passengers and that his health was worsening.\nThe terrorists insist that they are not after a ransom, but an exchange of the abducted passengers with their commanders, who were in government custody."
  },
  {
    "headline": "As Germany Plans to Return 1,130 Looted Benin Bronzes to Nigeria, Buhari Backs Ultramodern Royal Museum at Oba of Benin’s Palace",
    "summarized_story": "President Muhammadu Buhari on Friday backed the planned ultramodern international standard Benin Royal Museum that would house the Benin Bronzes and other artefacts being returned to Nigeria, for the purpose of preserving history, tourism and education.\nThe President announced his support while receiving in audience at the State House, Abuja, the Oba of Benin, H.R.M.\nOmo N’Oba Uku Akpolokpolo Ewuare II, accompanied by members of the Royal Court of Benin and the Board of Trustees of the Benin Royal Museum.\nWhen concluded, it will signify the return to Nigeria by Germany of all the 1,130 Benin Bronzes in Germany’s public museums.\n‘‘Furthermore, on the 7th of this month, the Glasgow City Council agreed to return 17 Benin Bronzes to Nigeria."
  }
]