[
  {
    "headline": "Varsity researchers suspend strike, FG meets SSANU, NASU",
    "summarized_story": "THE Academic Staff Union of Research Institutions has suspended its strike, which commenced last October over unresolved issues with the Federal Government.\nThe union disclosed this in a letter to the Minister of Labour and Employment, Chris Ngige, signed by its Secretary-General, Theophilus Ndubuaku.\nAccording to the letter, the suspension of the strike takes immediate effect.\n“The Academic Staff Union of Research Institutions hereby writes to inform you of our decision to suspend, with immediate effect, our ongoing strike,” the letter read in part.\nThe conciliation meeting, which commenced around 2pm on Thursday at the labour ministry, was ongoing as of the time of filing this report."
  },
  {
    "headline": "Campaign in Mecca, desecration of religious sanctuary –NAHCON",
    "summarized_story": "THE National Hajj Commission on Thursday warned politicians against engaging in any political activities, including discussions and rallies that were detrimental to the sanctity of the Holy mosque in Saudi Arabia.\nThe organisation described the action of some Nigerian politicians displaying posters of their candidates in the grand mosque in Makkah during the Ramadan Umrah (lesser Hajj) as a sacrilege that attracts penalties when apprehended.\n“Kindly recall that the Saudi Arabian authorities are very strict on any form of politicking, while in their land especially not in the Holy Kaabah where devotees engage in solemn prayers.\n“This action is tantamount to the desecration of a religious sanctuary which attracts penalties when apprehended.\nHence, in the actors’ interest and Nigeria’s image, pilgrims are cautioned to desist from such illegal activities please.”Copyright PUNCH."
  },
  {
    "headline": "Defunct PHCN retirees not entitled to 33 per cent increase in pension – PTAD",
    "summarized_story": ",The Pension Transitional Arrangement Directorate (PTAD), said that workers of the defunct Power Holding Company of Nigeria (PHCN) are not entitled to the pension increase of 33 per cent.\nMr Gbenga Ajayi, PTAD’s Head of Corporate Communications, said in a statement on Thursday in Abuja that the PHCN pensioners were already on a special salary structure before the pension review for pensioners was approved.\nAjayi said that the clarification was necessary as the attention of PTAD Management had been drawn to a growing agitation by some group of PHCN Pensioners, known as concerned PHCN Pensioners.\nHe said that the group is alleging that PTAD had colluded with some “powerful individuals” to deprive them of the 33 per cent pension increment as approved by the Federal Government in 2010.\n“It should be noted that PHCN Pensioners took the Federal Government to the National Industrial Court (NIC) Abuja on this issue."
  },
  {
    "headline": "2023: Group buys, presents N20m Senatorial nomination form to Adeola in Ogun",
    "summarized_story": "By James Ogunnaike, ABEOKUTAA political group in Ogun West Senatorial District, ‘West to West for DA Movement,’ on Wednesday presented the Expression of Interest and Nomination Forms to Senator Solomon Olamilekan Adeola in support of his Senatorial ambition in 2023.\nThe Chairman of the group, Dr. Iziaq Salako, in his address, commended Senator Adeola for heeding to the call of leaders in Ogun West Senatorial district to contest for the senatorial seat.\n“This is an unprecedented feat signifying a new trajectory of collectivity and brotherhood in Ogun West Senatorial district”.\nResponding, Senator Adeola in his emotion-laden voice appreciated the Movement for their love and support of the project.\nThe lawmaker, who is currently representing Lagos West Senatorial District, said he was “overwhelmed” by the show of support extended to him to pursue his ambition in the state."
  },
  {
    "headline": "Defunct PHCN pensioners storm PTAD office, protest unpaid entitlements",
    "summarized_story": "Pensioners of the defunct Power Holding Company of Nigeria (PHCN) on Thursday staged a protest at the Lagos office of the Pension Transitional Arrangement Directorate (PTAD) over their unpaid entitlements.\nThe pensioners, under the aegis of Concerned PHCN Pensioners, a pressure group, appealed to President Muhammadu Buhari to intervene in the matter.\nThey claimed that issues of non-payment of their entitlements had yet to be addressed in spite of repeated calls on PTAD.\nThe News Agency of Nigeria (NAN) reports that the group had in March 2021 staged a protest at the same office over issues relating to the pensioners’ entitlements.\nThey also claim that PHCN pensioners have yet to receive the 33 per cent arrears of pension increment approved during President Goodluck Jonathan’s administration, among others."
  },
  {
    "headline": "Oyetola flags off N3.2bn Osogbo township roads",
    "summarized_story": "Shina Abubakar, OsogboOsun State Governor, Adegboyega Oyetola on Thursday, flagged off the reconstruction of roads within Osogbo/Olorunda/Irepodun/Orolu Federal Constituency.\nThe roads awarded to Messed SlavaBorgu construction company are valued at N3,265,623,449.00 with a completion period of 12 months.\nAccording to him, the need to urgently reconstruct the roads was informed by the avoidable hardship being experienced by the residents of the State plying the roads on daily a basis.\n“Apart from the roads project we are flagging off today, the Inisa township road, Baruwa, Halleluyah road, Okinni, Akinlalu, Apomu and Ilesa township road are all undergoing procurement process”, he added.\nSpeaking, the Executive Vice Chairman, Slavabogu Construction Nigeria Limited, the construction company handling the project, Madam Grace Omolori-Okoya, who was represented by the Quality Control Officer, Engr."
  },
  {
    "headline": "COAS commissions 8 Division RSM Quarters in Sokoto",
    "summarized_story": "By Musa Na Annabi SokotoThe Chief of Army Staff Lt General Faruku Yahaya on Thursday commissioned the newly completed Quarter regimental sergeant major, (RSM) of 8 Division, Sokoto.\nThe quarters were built to accommodate the RSM of 8 Division and that of Garrison command aimed at providing the two officers with a befitting accommodation.\nIn his remark the General Officer Command (GOC) Nigerian Army 8 Division, Sokoto Major General Uwem Bassey said the gesture is part of the COAS directive to massive construction of befitting official residences for RSMs in all the Divisions across the country.\nOn his part, the commandant 48 Engineering brigade Brig General Obot Silas Obot said the contract was handled by Alabins investment supervised by the Nigerian Army engineering corps.\nThe COAS commissioned other projects at the Garrison after touring the barracks to inspect some facilitiesThe highlight of the event was the presentation of the keys of the houses to the two beneficiaries by the chief of army staff."
  },
  {
    "headline": "Zulum dissolves Borno State Executive Council",
    "summarized_story": "Borno State Governor, Professor Babagana Umara Zulum, has approved the dissolution of the Borno State Executive Council.\nThe dissolution, which is with immediate effect, was contained in a statement signed by the Permanent Secretary, Administration and General Services, Danjuma Ali on behalf of Secretary to the State Government and made available to journalists by the governor’s spokespersons from the press unit of the Government House in Maiduguri.\nThe members were directed to handover affairs to permanent secretaries in their ministries.\nThe statement explained that the dissolution was to create an enabling environment for interested members of the EXCO to legally participate in forthcoming primaries and congresses of the All Progressives Congress, APC.\nZulum, according to the statement, expressed deepest appreciation to members of the executive council for unquantifiable contributions while they held offices and wished them the best of luck in future endeavors."
  },
  {
    "headline": "Strike: SSANU, NASU resume talks with FG",
    "summarized_story": "The Senior Staff Association of Nigerian Universities (SSANU) and the Non-Academic Staff Union of Universities (NASU), on Thursday, resumed negotiations with a view to finding an amicable solution to the lingering industrial action.\nAdeyemi, however, bemoaned the circumstances that led to declaration of the strike, saying they were equally pained that this action has been prolonged by the government.\nHe said the impression that the Education Ministry abandoned their workers to their fate was not true but contrived to make it that way.\nWe are now seeing the permanent secretary of education here.\nToday, I am particularly happy that the new permanent secretary has come to apologise."
  },
  {
    "headline": "Stop exposing yourself to life-threatening relationships – Akwa Ibom First Lady begs GBV victims",
    "summarized_story": "Akwa Ibom State First Lady, Martha Emmanuel, has advised women, especially victims of gender-based violence to consider stepping aside from abusive relationships rather than exposing themselves to life-threatening risks.\nSpeaking during the inauguration of a Sexual and Gender-Based Referral Center for Uyo Senatorial District on Thursday, Emmanuel, who is also the chairperson of the State Gender-Based Violence Management Committee, urged victims to always report abusive cases to law enforcement agents, saying her committee will not spare resources in bringing perpetrators to book.\nShe said, “Victims of abusive relationships should consider the option of stepping aside than expose themselves to life-threatening risks.\n“I encourage all victims of sexual and gender-based assaults in the state to report to the law enforcement agents, our Committee is ever ready to swing into action once notified.”"
  },
  {
    "headline": "Akwa Ibom: Gani Adams writes Gov Emmanuel, demands justice for murdered Yorubas",
    "summarized_story": "The Aare Ona Ona Kakanfo of Yoruba land, Iba Gani Adams, has urged Akwa Ibom Governor, Udom Emmanuel to ensure that Yorubas killed in Ibeno Local Government Area get justice.\nIn a letter to Emmanuel, Adams told him that the perpetrators of the dastardly act must face the full weight of the law.\nTitled “Killing of Yoruba and urgent need to ensure justice”, the Aare said security reports indicated that Yoruba people were being targeted.\nHe said it was strange that Yoruba people, who have been living peacefully and respecting their hosts, were attacked.\nThe traditional leader commended the Chairman of Ibeno Local Government, Chief Henry Mkpa for the 7pm to 6am curfew."
  },
  {
    "headline": "7th Raisina Dialogue: AfCTA is a game changer – Onyeama",
    "summarized_story": "Minister of Foreign Affairs, Geoffrey Onyeama, has said that the African Continental Free Trade Area (AfCFTA) would be a “game changer”.\nIndia has a comparative advantage in the health sector- we saw the role India played in the COVID-19 outbreak.\nIndia has a very strong pharmaceutical sector so the health field is an area we can do a lot with India.\nWe have had challenges with developing our steel industry in Nigeria so that’s another area we can do alot with India.\nWhile in India, Onyeama visited one of India’s largest steel and power plants, addressed and inaugurated the Nigeria-India Business Council with an impressive attendance by Indian captains of Industry and interacted with 30 invited African Ambassadors and members of the Nigerian Community including students."
  },
  {
    "headline": "Fed Govt takes over Ebonyi medical varsity as Buhari inaugurates projects",
    "summarized_story": "The Federal Government has taken over the King David University of Medical Sciences Teaching Hospital, Uburu in Ebonyi State.\n“It is good that the President is inaugurating the edifice and I am tempted to call it a Federal Teaching Hospital,” he said.\nAt the New Government House Abakaliki, the President commissioned the Muhammadu Buhari Presidential Lodge, the new Executive Council Chambers, the governor’s lodge, the Aisha Buhari First Lady’s Office and the governor’s office.\nAfter inspecting the Presidential Lodge, President Buhari told Umahi that he has created a lot of “problems” for his successor.\nHe was received by Umahi and Enugu State Governor, Ifeanyi Ugwuanyi."
  },
  {
    "headline": "Man breaks into Soun’s palace, claims throne",
    "summarized_story": "A man broke into the palace of the Soun of Ogbomoso yesterday, violently laying claim to the vacant throne.\nHe attacked and knocked off the teeth of a palace chief, Sheu Ayinla, during the intrusion.\nChief Ayinla, who narrated the incident told reporters said he was in the palace to ensure that everything was normal when the intruder attacked him.\nHe said: “ I was in the palace and just called a food vendor when I saw the man ramping up towards the palace court.\nHe broke the glass to the palace but the iron bars prevented him from gaining access."
  },
  {
    "headline": "Abuja-Kaduna train operation to resume",
    "summarized_story": "Train operations on the Abuja-Kaduna corridor will resume soon, the Nigerian Railway Corporation (NRC) said yesterday.\nThe Corporation also said that passengers would have to provide their National Identification Number (NIN) to buy train tickets on any of its train service network.\nAccording to the NRC management, the damaged track on the Abuja-Kaduna corridor had been fixed.\nThe statement reads: “As we have mentioned in our earlier releases, the Abuja – Kaduna Train Service (AKTS) will resume soon with additional security features.\n“The Corporation is committed to the safety of all our passengers and staff on board the ill-fated Ak9 train service."
  },
  {
    "headline": "Vice chancellors plan Turkey trip for wives",
    "summarized_story": "In spite of the ongoing strike by university teachers and workers, wives of Vice Chancellors of ivory towers are to embark on a five-day trip to Turkey.\nThe trip for a Leadership and Management Masterclass, Fellowship Induction programme is scheduled for July 18 to 23, 2022.\nAccording to a May 5 letter by the Committee of Vice Chancellors of Nigerian Universities, the vice-chancellors’ wives are expected to pay a course fee of N1.5m each.\nThe letter by the committee’s Secretary-General, Yakubu Ochefu is titled ‘Invitation to the Istanbul 5-Day Leadership & Management Masterclass, Fellowship Induction for Spouses of Vice Chancellors, Women in Academics and Higher Education Leadership.’It reads in part: ”We understand the vital role spouses play in supporting Vice Chancellors as they execute their day- to day administration of universities.\nIt is therefore imperative, that capacity building exercises be put in place for the Women in Academics and spouses of Vice Chancellors in Nigerian universities."
  },
  {
    "headline": "APC presidential form: 17 aspirants so far … still counting",
    "summarized_story": "Eleven aspirants yesterday obtained the All Progressives Congress (APC) presidential nomination form, raising the list of applicants so far to 17.\nThe electoral commission warned the political parties yesterday that it would only recognise candidates that will emerge from valid primaries.\nWe (North) have served as the president in this country for eight years under the leadership of President Muhammadu Buhari.\nFormer Ogun State Governor Ibikunle Amosun publicly declared his intention to run for president on the platform of the All Progressives Congress (APC) yesterday.\nMaking the declaration in Abuja, Amosun said his experience in public office as a senator and governor would be added advantages if given the chance."
  },
  {
    "headline": "2023: Anxiety in APC, PDP as aspirants await final word on zoning",
    "summarized_story": "He said the situation in the PDP is worse as equal number of aspirants have obtained forms from both the North and South.\nMeanwhile, there are indications that the INEC is under pressure to extend the deadline for the conduct of primaries by political parties by some weeks.\nSection 29(1) of the new Electoral Act deals with the time frame within which political parties must submit their list of candidates before the general elections.\nIt stipulates that parties must conduct primaries and submit their list of candidates at least 180 days before the general elections.\nKey political parties have fixed dates for the conduct of presidential primaries."
  },
  {
    "headline": "Bishop Sunday Onuoha to chair The Sun awards",
    "summarized_story": "methodist Bishop and co-chair of Inter-faith Dialogue Forum, Bishop Sunday Onuoha, will chair The Sun Awards 2021.\nTwenty-six people will receive various awards at The Sun Award ceremony holding tomorrow, May 7, 2022 at the Eko Hotels & Suites, Victoria Island, LagosIn accepting the invitation to be Chairman, Bishop Onuoha said it was gratifying to be part of history of honouring Nigerians who have made marks in their fields of human endeavour.\nBishop Onuoha, who served as Special Assistant on Privatisation in the Presidential Cabinet of President Olusegun Obasanjo in 2003, is founder of Vision Africa International, which empowers Nigerians and other Africans to solve problems and cure society’s ills.\nBishop Onuoha, in 2009, led the Nigerian Inter-Faith Action Association (NIFAA), which is the largest Christian-Muslim collaboration in history.\nMeanwhile, popular television host and filmmaker, Frank Edoho, of “Who Wants to be a Millionaire” fame, will be the host of The Sun Awards 2022."
  },
  {
    "headline": "Primaries: INEC insists on June 3",
    "summarized_story": "From Romanus Ugwu, AbujaINEC has told the 18 political parties to adhere to the timeline for the conduct of their primaries for the 2023 general elections, stating that the deadline is firm and fixed.\nHe said in compliance with section 82(1) of the Electoral Act 2022, all 18 political parties had served the required notices indicating the dates for their conventions, congresses and primaries.\n“Given the importance of the exercise to the emergence of candidates for the various elective positions for the 2023 General Elections, it is imperative to remind political parties that they have one month from today to conclude their primaries.\nThe deadline remains Friday, June 3.”While urging the parties to ensure rancour-free and transparent exercise, the Commission reiterated that the deadline remained firm and fixed.\n“Political parties are further reminded that they must submit to the commission the list of candidates who must have emerged from valid primaries."
  },
  {
    "headline": "Protesters warn APC against imposing Jonathan",
    "summarized_story": "From Romanus Ugwu, AbujaProtesters in their hundreds, yesterday, stormed the national secretariat of the All Progressives Congress (APC) over alleged plans to impose former president, Goodluck Jonathan, as presidential candidate.\nUnder the umbrella of APC North-South PatrioticCoalition (ANSPAC), led by Toyin Rahim, the protesters grounded human and vehicular movements at the party secretariat.\nIt cautioned that “welcoming Jonathan to APC will damage the party.\nAttracting Jonathan to APC will scandalise the party.\nIn APC today there are presidential aspirants with credible pedigrees and humongous electoral value and capacity."
  },
  {
    "headline": "5.5m completed PVC registration by May 2 –INEC",
    "summarized_story": "The commission on its official social media handle said of those that completed their registration, 2,379,063 did it online, while 3,036,556 did it physically.\n“The six South South states have a combined total of 1,283,469 completed registration with the highest being Delta State at 282,003 and the least is Cross River with 153,872.\n“The six South West states have a total of 1,050,262 completed registration with Osun State having 360,625 and Ondo State, having the least with 95,760.\nThe six North East states have a total of 684,065 completed registration with the least being Yobe at 51,366, while Taraba has the highest number with 129,072.\n“The seven North West states have a total of 975,495 completed registration with the highest being Kano at 235,975 and the lowest is Zamfara at 67,842."
  },
  {
    "headline": "FG: With Lekki Port, Nigeria to Wrest Lost Cargoes from Neighbours, Targets Over $201bn in Taxes, Duties",
    "summarized_story": "He said the aggregate impact of the Lekki Deep Sea Port put at $361 billion in 45 years would be over 200 times the cost of building the port.\nAccording to him, the deep sea port would be a game changer because of the impact it would have on the nation’s economy when completed.\nIt is the deepest sea port in Nigeria and West Africa, and that in itself is a unique advantage.\nResponding, the Managing Director, Lekki Deep Sea Port, Du Ruogang, said the port would change the economic landscape of Nigeria and West Africa at large.\nHe said the Lekki port would soon become a central hub for the West African region."
  },
  {
    "headline": "With over N30bn from Sale of Forms, APC Gets Firepower for 2023 Elections",
    "summarized_story": "A rundown on the expected revenue from the electoral process shows APC may generate over N2.3 billion from the sale of presidential forms; N2.8 billion from the sale of governorship forms; and roughly N6.54 billion from the sale of senatorial forms.\nThe party could make about N10.8 billion from the sale of forms to a minimum of three House of Representatives aspirants from each of the country’s 360 federal constituencies.\nSo far, 23 presidential aspirants have indicated interest in the presidency under the ruling party and APC is expected to generate N2.3 billion from the sale of presidential forms.\nOthers are former National Chairman of APC, Adams Oshiohmole; former Governor of Ogun State, Senator Ibikunle Amosun; Minister of Transportation, Rt.\nThere are also indications that the Kebbi State governor, Atiku Bagudu, may declare his interest in the presidency and pick his form soon."
  },
  {
    "headline": "Guterres: UN Committed to Peaceful Nigeria",
    "summarized_story": "•Wants attackers of Global Body’s Building in 2011 ProsecutedDeji Elumoye and Michael Olugbode in AbujaUnited Nations (UN) Secretary-General Antonio Guterres says the intergovernmental organisation remains steadfast in its commitment to a peaceful Nigeria.\nGuterres stated this yesterday in Abuja during a two-day visit to the country.\nGuterres called for the prosecution of those that attacked the UN House in Abuja on August 26, 2011, stressing that perpetrators of terrorism in Nigeria must be held to account.\nThe UN secretary-general said the war in Ukraine would make things worse with regard to global food, energy and financial systems.\nThe president thanked the secretary general for the maiden visit to Nigeria."
  },
  {
    "headline": "Buhari Meets UN Scribe, Guterres, at Aso Villa",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari Wednesday met with the Secretary General of the United Nations (UN), Antonio Guterres, at the State House, Abuja.\nThe president received the UN chief and his team at the forecourt of the Presidential Villa at about 3.03pm.\nAfter a brief welcome ceremony, President Buhari led Guterres to his office where they had a meeting before returning to brief the media.\nAt the briefing, President Buhari stressed the importance of the visit at a time the world’s attention is focused on the Russia-Ukraine war.\nIn his remark, Guterres said his visit was in solidarity with victims of terrorism."
  },
  {
    "headline": "2023: Jigawa Gov, Badaru, Joins Presidential Race",
    "summarized_story": "Ibrahim Shuaibu in DutseJigawa State Governor Muhammad Badaru Abubakar has declared interest in contesting the 2023 presidential election on the platform of the All Progressives Congress (APC).\nKila said: “It is true that Governor Badaru has travelled to Abuja to secure nomination form for the 2023 presidential election.”He explained that his principal has the necessary wherewithal to lead the country to the promised land.\nTHISDAY gathered that on Tuesday evening, the governor informed the party’s stakeholders of his ambition to contest for the presidency.\nGovernor Badaru informed the gathering that he will seek for the blessing of President Buhari before purchasing the form.\nThe governor has since left the state capital, Dutse, for Abuja to obtain the form ahead of the presidential primary elections of the party."
  },
  {
    "headline": "Plot Thickens As Impostors Backed By Buhari Regime Connive With Electoral Body, INEC To Stop Sowore’s Presidential Bid",
    "summarized_story": "A group of impostors supported by the Muhammadu Buhari regime are presently plotting to use the Independent National Electoral Commission (INEC) and other available means to stop the presidential bid of human rights activist, Omoyele Sowore.\nOmoyele Sowore“Ezenwa and his group were recently mobilised by the Muhammadu Buhari regime to do everything possible to stop Sowore from contesting in the 2023 elections.\nMr. Ezenwa is also a stooge used by INEC chairman Mahmood Yakubu to boost the image of INEC and bribe political parties to look away from INEC infractions,” a top source revealed.\nSaharaReporters learnt that Ezenwa had again been freshly mobilised to launch attacks against Sowore’s presidential bid through his cronies in the AAC and elsewhere.\n\"INEC had no option but was forced to withdraw their objection, asking that Sowore’s appeal be struck out."
  },
  {
    "headline": "Plot Thickens As Impostors Backed By Buhari Regime Connive With Electoral Body, INEC To Stop Sowore’s Presidential Bid",
    "summarized_story": "A group of impostors supported by the Muhammadu Buhari regime are presently plotting to use the Independent National Electoral Commission (INEC) and other available means to stop the presidential bid of human rights activist, Omoyele Sowore.\nOmoyele Sowore“Ezenwa and his group were recently mobilised by the Muhammadu Buhari regime to do everything possible to stop Sowore from contesting in the 2023 elections.\nMr. Ezenwa is also a stooge used by INEC chairman Mahmood Yakubu to boost the image of INEC and bribe political parties to look away from INEC infractions,” a top source revealed.\nSaharaReporters learnt that Ezenwa had again been freshly mobilised to launch attacks against Sowore’s presidential bid through his cronies in the AAC and elsewhere.\n\"INEC had no option but was forced to withdraw their objection, asking that Sowore’s appeal be struck out."
  },
  {
    "headline": "Plot Thickens As Impostors Backed By Buhari Regime Connive With Electoral Body, INEC To Stop Sowore’s Presidential Bid",
    "summarized_story": "A group of impostors supported by the Muhammadu Buhari regime are presently plotting to use the Independent National Electoral Commission (INEC) and other available means to stop the presidential bid of human rights activist, Omoyele Sowore.\nOmoyele Sowore“Ezenwa and his group were recently mobilised by the Muhammadu Buhari regime to do everything possible to stop Sowore from contesting in the 2023 elections.\nMr. Ezenwa is also a stooge used by INEC chairman Mahmood Yakubu to boost the image of INEC and bribe political parties to look away from INEC infractions,” a top source revealed.\nSaharaReporters learnt that Ezenwa had again been freshly mobilised to launch attacks against Sowore’s presidential bid through his cronies in the AAC and elsewhere.\n\"INEC had no option but was forced to withdraw their objection, asking that Sowore’s appeal be struck out."
  },
  {
    "headline": "EXCLUSIVE: Vice President Osinbajo Gifts 300 Dollars Each To Over 400 APC Delegates In Adamawa, Taraba States",
    "summarized_story": "As the Nigerian naira continues to struggle against the United States dollar, the Vice President, Yemi Osinbajo has stepped up his game of clinching the presidential ticket of the All Progressives Congress (APC) with the distribution of $300 each to about 400 presidential nomination delegates in Adamawa and Taraba states.\nThe Vice President reportedly switched from doling out money in naira to hard currency in order to stay on top of his game.\nSaharaReporters reported on April 22, 2022, that some presidential delegates of the ruling All Progressives Congress in the South-West on Friday went home with N250,000 each after attending a meeting with Vice President Yemi Osinbajo in Ibadan, Oyo State.\n“This was what we were given by Osinbajo today,” a delegate had said while showing the money packaged in an envelope.\nA visibly elated VP was accompanied to Muna Hotel in Yola, the venue of the meeting by some APC party senators, House of Representatives members and cronies of President Muhammadu Buhari."
  },
  {
    "headline": "EXCLUSIVE: Vice President Osinbajo Gifts 300 Dollars Each To Over 400 APC Delegates In Adamawa, Taraba States",
    "summarized_story": "As the Nigerian naira continues to struggle against the United States dollar, the Vice President, Yemi Osinbajo has stepped up his game of clinching the presidential ticket of the All Progressives Congress (APC) with the distribution of $300 each to about 400 presidential nomination delegates in Adamawa and Taraba states.\nThe Vice President reportedly switched from doling out money in naira to hard currency in order to stay on top of his game.\nSaharaReporters reported on April 22, 2022, that some presidential delegates of the ruling All Progressives Congress in the South-West on Friday went home with N250,000 each after attending a meeting with Vice President Yemi Osinbajo in Ibadan, Oyo State.\n“This was what we were given by Osinbajo today,” a delegate had said while showing the money packaged in an envelope.\nA visibly elated VP was accompanied to Muna Hotel in Yola, the venue of the meeting by some APC party senators, House of Representatives members and cronies of President Muhammadu Buhari."
  },
  {
    "headline": "UK makes U-turn, recognises IPOB as terrorist group excluded from asylum",
    "summarized_story": "In a May 2022 update of its asylum policy, seen by TheCable, the UK government excluded members of the group from seeking refuge in England.\nUKVI RECOGNISES IPOB AS TERRORIST ORGANISATIONIn its May 2022 policy update seen by TheCable, UKVI referred to IPOB as a terrorist organisation to be excluded from its asylum programme over alleged links to violence in the south-east.\nIt added that “MASSOB has been banned, but is not a proscribed terrorist group in Nigeria.\nAdvertisementThe policy brief noted that anyone excluded in this manner is also “excluded from a grant of humanitarian protection”.\nAdvertisementSuspected IPOB members were also recently killed by the Nigerian Army in a gun battle on Orlu–Orsu road in April."
  },
  {
    "headline": "UK makes U-turn, recognises IPOB as terrorist group excluded from asylum",
    "summarized_story": "In a May 2022 update of its asylum policy, seen by TheCable, the UK government excluded members of the group from seeking refuge in England.\nUKVI RECOGNISES IPOB AS TERRORIST ORGANISATIONIn its May 2022 policy update seen by TheCable, UKVI referred to IPOB as a terrorist organisation to be excluded from its asylum programme over alleged links to violence in the south-east.\nIt added that “MASSOB has been banned, but is not a proscribed terrorist group in Nigeria.\nAdvertisementThe policy brief noted that anyone excluded in this manner is also “excluded from a grant of humanitarian protection”.\nAdvertisementSuspected IPOB members were also recently killed by the Nigerian Army in a gun battle on Orlu–Orsu road in April."
  },
  {
    "headline": "2023: Presidential hopeful sues PDP over 'high cost' of nomination form",
    "summarized_story": "Okey Uzoho, a presidential hopeful, has filed a case against the Peoples Democratic Party (PDP) for allegedly denying him the opportunity to contest in the party’s May 28 presidential primary.\nUzoho, a lawyer and member of the PDP, claimed that the high cost of the expression of interest and nomination forms for presidential hopefuls will prevent him from participating in the primary.\nThe PDP had fixed N40 million for its expression of interest and nomination forms for presidential aspirants.\nHe added that aside from the form fee, he met all the requirements of the 1999 constitution and extant laws for participation in the presidential primary of the party for the 2023 election.\nThe plaintiff is seeking N50 million as compensation for the “anxiety, inconvenience, and loss of valuable campaign time” over his inability to participate in the presidential primary."
  },
  {
    "headline": "2023: Presidential hopeful sues PDP over 'high cost' of nomination form",
    "summarized_story": "Okey Uzoho, a presidential hopeful, has filed a case against the Peoples Democratic Party (PDP) for allegedly denying him the opportunity to contest in the party’s May 28 presidential primary.\nUzoho, a lawyer and member of the PDP, claimed that the high cost of the expression of interest and nomination forms for presidential hopefuls will prevent him from participating in the primary.\nThe PDP had fixed N40 million for its expression of interest and nomination forms for presidential aspirants.\nHe added that aside from the form fee, he met all the requirements of the 1999 constitution and extant laws for participation in the presidential primary of the party for the 2023 election.\nThe plaintiff is seeking N50 million as compensation for the “anxiety, inconvenience, and loss of valuable campaign time” over his inability to participate in the presidential primary."
  },
  {
    "headline": "COVID: WHO says 14.9m deaths linked to pandemic — 148% more than virus toll",
    "summarized_story": "The World Health Organisation (WHO) says the deaths linked to the COVID pandemic between January 2020 and December 2021 was approximately 14.9 million.\nThe figure is two times more than the reported six million deaths which have been recorded as a result of COVID.\nAdvertisementAccording to the WHO, the excess deaths include fatalities associated with COVID directly or indirectly (due to the pandemic’s impact on health systems and society).\nThe organisation also said most of the excess deaths – 84 percent — are concentrated in south-east Asia, Europe, and the Americas, while about 68 percent of excess deaths are concentrated in just 10 countries globally.\n“WHO is committed to working with all countries to strengthen their health information systems to generate better data for better decisions and better outcomes,” he added."
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "What problems are Y Combinator-backed startups solving in Africa?",
    "summarized_story": "This has significantly changed how African startups operate and, per some founders, helped refine their business processes.\nLittle wonder that 53% (51) of YC-backed African startups (95) are from Nigeria.\nBut the big question remains: What problems are Y Combinator-backed startups solving?\nWhat problems are Africa’s YC-backed startups solving?\nSo far, YC has invested in a whopping 47 Financial Services startups in Africa, almost half of its Africa alumni."
  },
  {
    "headline": "5 things to look forward to at the Techpoint Africa Blockchain Summit",
    "summarized_story": "Share this article:It takes more than reading to make sense of Web3; it requires an experience, which is what the Techpoint Africa Blockchain Summit wants to simulate.\nWe want to, with this experience, help you find your space as the new Internet age approaches.\nAptly themed, Web3: Engineering tomorrow’s Internet, this event will help Africa realise the opportunities present in the blockchain ecosystem and how Africans can harness the technology to its full potential.\nHere’s what to expect at the Techpoint Africa Blockchain SummitTABS Web3 HackathonDespite its nascency, some Africans are already seizing the opportunities for innovation the Web3 space offers.\nReach out to events@techpoint.africa if you want to exhibit at the Techpoint Africa Blockchain Summit."
  },
  {
    "headline": "You might have to pay to use Twitter",
    "summarized_story": "On Tuesday, May 3, 2022, Elon Musk, Tesla CEO, announced that Twitter might charge a “slight” fee for commercial and government users.\nBut isn’t this at odds with his primary interest in Twitter, which has to do with the company’s censorship of free speech?\nPer Reuters, Musk told banks that to cut costs, he would develop new ways to monetise tweets and tighten executive pay.\nCurrently, Twitter has 229 million daily users around the world.\nGoogle to shut down YouTube GoOn Tuesday, May 3, 2022, Google announced that YouTube Go would be shut down permanently in August 2022."
  },
  {
    "headline": "Mushe’s (XMU) Independence Day Launch is a Cause for Celebration",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:With the launch of Mushe (XMU) tokens on July 4, Independence Day for Americans is also the perfect day for you to kickstart your financial independence.\nInvestors that purchase Mushe tokens to hold in their portfolio for a long-term period can expect significant growth.\nLearn more about Mushe (XMU)Official Website: https://www.mushe.world/Presale Registration: https://portal.mushe.world/sign-upTelegram: https://t.me/MusheWorldXMUTwitter: https://twitter.com/Mushe_WorldInstagram: https://www.instagram.com/mushe_world/Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "The Offshore Lab delivers FUPRE 100-seater ICT Centre for NNPC/SNEPCo",
    "summarized_story": "The FUPRE ICT Centre is an ultra-modern facility which houses a Wi-fi lounge, computer laboratories, conference rooms, a lecture hall, office spaces, and equipment rooms.\nThe ICT Centre is also equipped with a 3D Printer, and associated academic materials, to introduce the University’s students to advancements in the additive manufacturing space.\nThe ICT Centre is a perfect material example of such a strategy.\nBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Nigeria’s revenue problem lingers as tax reforms stall",
    "summarized_story": "On average, revenue to GDP ratio in frontier markets is slightly more than double of that while in South Africa, it’s nearly 30 percent.\n“This looks like almost no one pays tax in Nigeria,” said Charles Robertson, the chief economist at Renaissance Capital.\nThe report stated that 98 percent of businesses in the informal sector actually pay taxes.\nTax experts surveyed by BusinessDay say that the government must also tackle multiple taxation to successfully incorporate the informal sector into the tax base of the country.\nThe report by SBM Intelligence noted that the informal sector could be incorporated into the formal net if the process of administering Tax Identification Numbers were and tax administration simplified."
  },
  {
    "headline": "Nigeria’s revenue problem lingers as tax reforms stall",
    "summarized_story": "On average, revenue to GDP ratio in frontier markets is slightly more than double of that while in South Africa, it’s nearly 30 percent.\n“This looks like almost no one pays tax in Nigeria,” said Charles Robertson, the chief economist at Renaissance Capital.\nThe report stated that 98 percent of businesses in the informal sector actually pay taxes.\nTax experts surveyed by BusinessDay say that the government must also tackle multiple taxation to successfully incorporate the informal sector into the tax base of the country.\nThe report by SBM Intelligence noted that the informal sector could be incorporated into the formal net if the process of administering Tax Identification Numbers were and tax administration simplified."
  },
  {
    "headline": "Case study: 5 countries show how best to improve tax collection",
    "summarized_story": "By 2003, rampant corruption involving tax evasion, illegal tax credits, and theft of government tax revenue had left public finances in shambles.\nThe revenue lost from lower tax rates was made up through a broader tax base, better compliance, and stricter enforcement.\nLessons for tax reformWhat does Georgia’s experience teach us about how best to increase tax revenue?\nIntroduce comprehensive tax administration reformsSuccessful revenue mobilisation cases tend to take a more holistic approach to modernising tax institutions.\nThese offices also support good tax administration; they often pilot new tax and customs procedures before their rollout to the broader population."
  },
  {
    "headline": "Obaseki meets 162 PDP aspirants for Edo House of Assembly, warns against money-bag politics, bitterness – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe governor met with the aspirants alongside party leaders and other Edo PDP officials, at the Government House, Benin City.\nThe way we go about this primary election is very important.\nAfter the primary election, we have nine months to prepare and campaign and the journey will not be easy or cheap.\nWe should work in unity to win the forthcoming EDHA election in 2023.\nOn his part, Edo PDP Chairman, Tony Aziegbemi disclosed that 164 aspirants bought the EDHA forms, while 162 persons returned their forms and were screened and cleared to contest the primary election."
  },
  {
    "headline": "PDP primaries: Edo High Court refuses to grant ex-parte order against Ayu, Obaseki, others – Nigerian Observer",
    "summarized_story": "The action was instituted by one Mr. Eghe Adun, an old PDP member believed to be loyal to the South-South Vice Chairman of the PDP, Chief Dan Orbih.\nListed as defendants in the case with suit number HAB/46/2022 are the Peoples Democratic Party, Senator Iyorchia Ayu, Dr Tony Aziegbemi and His Excellency, Godwin Obaseki.\nThe court, sitting in Abudu, refused to countenance the ex-parte application, but deferred hearing in the matter to the 12th of May, 2022.\nOmoregie Ogbeide-Ihama, member representing Oredo in the House of Representatives sponsored a similar suit at the Federal High Court Abuja, with suit number FHC/ABJ/CS/ 598/2022.\nThey are seeking to restrain the PDP, Dr. Iyorchia Ayu, Senator Sam Anyanwu, Hon."
  },
  {
    "headline": "Flush Out Quacks, Shaibu Urges Society of Engineers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State Deputy Governor, Rt.Hon.\nComrade Philip Shaibu, has appealed to the Nigerian Society of Engineers((NSE),to monitor the activities of its members and flush out quacks from the engineering profession as a panacea to checkmate incessant building collapse in the country.\nThe Deputy Governor made the appeal, when he played host to members of the Nigerian Society of Engineers, Benin branch, at the Government House, Benin City.\nEarlier in his address, the Chairman,Nigerian Society of Engineers, Benin Branch,Engr.\nOmoregie Ehigie Armstrong, stated that, they were in Government House, to inform the Deputy Governor of their up coming Founders Day celebration."
  },
  {
    "headline": "Shaibu Tasks Youths on Actualization of Set Goals – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State Deputy Governor, Rt.Hon.\nComrade Philip Shaibu, has called on Nigerian youths to take advantage of the numerous opportunities created by government to better their lives.\nThe Deputy Governor made the call in Fugar, the administrative headquarters of Etsako Central Local Government, during a civic reception in honour of Engr.\nAccording to Shaibu:” Edo State Government is committed to ensuring that youths are given their pride of place in the scheme of things.\nIn his address,the celebrant, Edo State Commissioner for Environment and Sustainability, Engr."
  },
  {
    "headline": "Court hears suit seeking to stop PDP primaries on May 10",
    "summarized_story": "A federal high court sitting in Abuja has fixed May 10, for a hearing in a suit seeking to stop the planned May 28, presidential primary election of the Peoples Democratic Party (PDP).\nA presidential aspirant, Mr Cosmas Ndukwe, filed an ex-parte application for an order of injunction restraining the PDP from proceeding with its scheduled primary election.\nErokoro prayed the court for an adjournment to enable him to peruse the document and respond to the reasons adduced to by the PDP against the suit of his client.\nCounsel to the PDP, Mr Mahmud Magaji (SAN), as well as counsel to the other defendants, did not oppose the request for an adjournment.\nNdukwe listed the PDP, its National Chairman, Mr Iyorchia Ayu, Sen. Samuel Anyanwu and the Independent National Electoral Commission (INEC), as defendants in the suit marked: FHC/ABJ/CS/508/2022."
  },
  {
    "headline": "Buhari arrives Ebonyi on two-day working visit, commissions projects",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari, on Thursday, arrived Abakaliki, Ebonyi State capital, through Enugu, on a two-day working visit.\nThe president who arrived Akanu Ibiam International Airport, Enugu in the morning hours of Thursday, was received by the Enugu State governor, Ifeanyi Ugwuanyi and Dave Umahi of Ebonyi.\nHe subsequently proceeded to Abakaliki, the Ebonyi State capital where he commissioned a number of projects, including the Ebonyi International Airport, the King David University of Medical Sciences, Uburu, among others.\nHe later proceeded to Muhammadu Buhari International Airport, Onueke via a chopper.\nThe president will also inaugurate the Aisha Buhari Wife of Governor’s Office Complex, Akanu Ibiam lodge, Ebonyi House, and the Muhammadu Buhari Light Tunnel Flyover and Ebonyi Shopping Mall."
  },
  {
    "headline": "Nigerian govt approves increase in electricity tariff",
    "summarized_story": "The Nigerian Electricity Regulatory Commission (NERC), has approved requests by some Electricity Distribution Companies (DisCos) to increase their tariff rates.\nThe new approval took effect from January 1, 2022 but the new rate is from February 2022.\nThe commission noted that the indices with potential impact of on electricity rates were considered.\nThe document disclosed that for the PHED (A-Non MD) customers who paid N56.16/kwh in January 2022 will now (February to December 2022) pay N60.67/kwh).\nThe noted that E- MD2 customers who paid N50.72/kwh in January 2022, will now (From February 2022) pay N54.22/kwh"
  },
  {
    "headline": "Customs intercepts 1000 bags of poisonous rice brought from India",
    "summarized_story": "The Federal Operations Unit (FoU), Zone A of Nigeria Customs Service (NCS), Ikeja, Lagos, on Thursday, said it has intercepted over 1,000 bags of foreign parboiled rice smuggled into the country through Benin Republic.\nActing Comptroller, FoU, Zone A, Hussein Ejibunu, during a press conference on Thursday, said that the bags of parboiled rice came into Cotonou from India.\nHe said the foreign rice were tested by the National Agency for Food Drug Administration and Control (NAFDAC) and confirmed to be poisonous and unsafe for consumption.\n“After seizing the smuggled rice, we called NAFDAC to conduct laboratory analysis and it was gathered that the rice named SIMBA which consist of Led substances that is poisonous to the body was produced in India,” he said."
  },
  {
    "headline": "Customs Intercepts 1,000 Bags Of Poisonous Foreign Rice In Ogun",
    "summarized_story": "The Federal Operations Unit (FoU), Zone A of the Nigeria Customs Service (NCS), Ikeja, Lagos, on Thursday, said it has intercepted over 1,000 bags of foreign parboiled rice smuggled into the country through Benin Republic.\nSpeaking during a press briefing in Lagos on Thursday, the acting Comptroller, FOU, Zone A, Hussein Ejibunu, said the rice came into Cotonou from India.\nAccording to him, the foreign rice were tested by the National Agency for Food Drug Administration and Control (NAFDAC) and confirmed to be poisonous and unsafe for consumption.\nHe said, “After seizing the smuggled rice, we called NAFDAC to conduct laboratory analysis and it was gathered that the rice named SIMBA which consist of Led substances that is poisonous to the body was produced in India.”"
  },
  {
    "headline": "Customs Intercepts 1,000 Bags Of Poisonous Foreign Rice In Ogun",
    "summarized_story": "The Federal Operations Unit (FoU), Zone A of the Nigeria Customs Service (NCS), Ikeja, Lagos, on Thursday, said it has intercepted over 1,000 bags of foreign parboiled rice smuggled into the country through Benin Republic.\nSpeaking during a press briefing in Lagos on Thursday, the acting Comptroller, FOU, Zone A, Hussein Ejibunu, said the rice came into Cotonou from India.\nAccording to him, the foreign rice were tested by the National Agency for Food Drug Administration and Control (NAFDAC) and confirmed to be poisonous and unsafe for consumption.\nHe said, “After seizing the smuggled rice, we called NAFDAC to conduct laboratory analysis and it was gathered that the rice named SIMBA which consist of Led substances that is poisonous to the body was produced in India.”"
  },
  {
    "headline": "Nigeria’s Future Still Bright, Says Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo has said Nigeria’s future is still bright despite the ethnic and religious crises and differences.\nOsinbajo stated this in Jalingo, the Taraba State capital when he visited the state to canvas for delegates votes for the coming All Progressives Congress (APC) presidential nomination.\nOsinbajo also expressed delight over the warm and elaborate reception accorded him in the state by the governor and the APC members.\nHe said the enthusiasm and excitement expressed by the people of the state irrespective of ethnic or religious background is an indication that the future of the country is very bright.\nFrom the governor to the government officials and the teeming leaders and members of our great party in the state."
  },
  {
    "headline": "Nigeria’s Future Still Bright, Says Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo has said Nigeria’s future is still bright despite the ethnic and religious crises and differences.\nOsinbajo stated this in Jalingo, the Taraba State capital when he visited the state to canvas for delegates votes for the coming All Progressives Congress (APC) presidential nomination.\nOsinbajo also expressed delight over the warm and elaborate reception accorded him in the state by the governor and the APC members.\nHe said the enthusiasm and excitement expressed by the people of the state irrespective of ethnic or religious background is an indication that the future of the country is very bright.\nFrom the governor to the government officials and the teeming leaders and members of our great party in the state."
  },
  {
    "headline": "NBA Faults Senate’s Criminalisation Of Ransom Payment",
    "summarized_story": "Nigerian Bar Association (NBA) yesterday condemned the attempt by the National Assembly to criminalise ransom payment by victims of kidnapping in Nigeria.\nThe NBA, which made the condemnation through the Chairman of its section on Public Interest and Development Law, NBA-SPIDEL, Monday Ubani, insisted that the law is misconceived because the government had failed to tackle the root cause of kidnapping.\nLast week, the Senate passed a bill seeking to amend the Terrorism (Prevention) Act, 2013, and prohibit the payment of ransom to kidnappers in Nigeria.\n“This piece of legislation under contemplation lacks logic and wisdom and the House of Representatives is hereby advised to jettison the Bill without any further consideration.\nInstead, the Legislature is strongly advised to focus on laws that will strengthen national security and protection of lives and property, assuming there is a lacuna,” he said."
  },
  {
    "headline": "What I will do if I lose APC presidential ticket",
    "summarized_story": "By Emmanuel MogbedePastor Tunde Bakare, General Overseer of the Citadel Global Community Church, Nigeria, has revealed what he would do if he fails to win the APC presidential ticket.\nBakare bought the N100 million APC presidential nomination and expression of interest forms on Thursday.\nHe said if he did not win the ticket, he would support whoever won.\nWhoever wins, the rest of us most rise to support him to rebuild Nigeria, East, West, North or South, Nigeria is our country,’’ he stressed.\n“This will be in such a way that the devastation we are experiencing, we would see it no more."
  },
  {
    "headline": "They claim Buhari has done nothing. UN scribe, Antonio Gutteres, says not so",
    "summarized_story": "And that was exactly what happened on Tuesday and Wednesday, this week, when United Nations Secretary-General, Antonio Gutteres visited Nigeria as part of a three nations African tour.\nGutteres had probably thought he was coming to a country where hopelessness and despondency were order of the day.\nWe are trying to get them back to the land, and things will get better in the near future.”Yet they say Buhari hasn’t achieved anything.\nIn 2011, Boko Haram bombed the United Nations building in Abuja, killed many people, and completely wrecked the structure.\n“If you don’t say you are, nobody would say thou art.”President Buhari has worked for this country, and continues to work."
  },
  {
    "headline": "Why I Won’t Resign As Minister Before APC Primaries – Presidential Aspirant, Godswill Akpabio",
    "summarized_story": "Minister of Niger Delta, Godswill AkpabioAkpabio, in an interview on Channels Television on Thursday, said Nigeria was very poor and shouldn’t have been one but the past administrations and the COVID-19 pandemic made it worst.\nThe presidential aspirant also opined that Nigerians should be grateful to the Buhari led administration as people are not begging on the streets as it is the situation with other countries.\nOn the price of the forms, he said, “The N100million in my view is very fair.\nYou see, even in modern democracies like America, it is not the candidate that sends himself into presidential elections; it is the people.\nThe money was contributed through fundraising by the youths over a month ago in Kaduna and over a 100million was raised.”"
  },
  {
    "headline": "PHOTOS: Amaechi Picks APC Presidential Nomination Form",
    "summarized_story": "Minister of Transportation, Rotimi Amaechi, has picked the presidential nomination form of the ruling All Progressives Congress.\nSharing photos of the moment on his Twitter handle, Amaechi said, “I just got my expression of interest and Presidential nomination forms.\nI appreciate my friends and associates for doing me this honour.\nI assure you that I am a representation of all tribes and regions.\nA true Nigerian candidate.”"
  },
  {
    "headline": "Oyetola Flags Off Rehabilitation Of Osogbo-Okinni-Ilobu-Ifon FG Road, Others",
    "summarized_story": "The Governor also flagged off and ordered for immediate reconstruction, Ire-Akari-round-about-Erin Osun LCDA Junction road (3.21km) and Post Office-Aiyetoro-Jamodo Olufon Palace-Janta road in Ifon-Osun (2.1km) respectively.\nThe roads have been in a state of disrepair for 13 years after the re-award of the contract for its rehabilitation by the Federal Government in 2013.\n“The flag-off of these roads today is a further confirmation of our belief that the path to sustainable socioeconomic development and service delivery is an endless one.\n“Apart from the roads project we are flagging off today, the Inisa township road, Baruwa, Halleluyah road, Okinni, Akinlalu, Apomu and Ilesa township road are all undergoing procurement process”, he added.\nHe expressed the readiness of his subjects to continuously support the Administration of Governor Oyetola who he described as lover of development."
  },
  {
    "headline": "BREAKING: South-East Residents Defy Unknown Gunmen’s Sit-At-Home Order, Threats Amid Buhari Visit To Ebonyi",
    "summarized_story": "The President is on a two-day working visit to Ebonyi State where he is expected to inaugurate some projects executed by the Umahi administration.\nThe many residents of the major cities in the South-East on Thursday defied the sit-at-home order issued by unknown gunmen terrorising the region, according to SaharaReporters.\nBuhari was received by Enugu Governor, Ifeanyi Ugwuanyi and his Ebonyi counterpart, David Umahi and other officials of government.\nHe thereafter took a helicopter to Abakaliki, the Ebonyi state capital.\nThe President is on a two-day working visit to Ebonyi State where he is expected to inaugurate some projects executed by the Umahi administration."
  },
  {
    "headline": "Presidential ticket: Impose Jonathan lose 2023, APC North-South Coalition warns",
    "summarized_story": "The protest which temporarily affected vehicular movement in and around the Buhari House APC national secretariat had several of the protesters carrying anti-Jonathan placards.\nThe four aspirants have now joined the swelling list of those contesting APC presidential ticket.\nOthers who have purchased the nomination forms include; Former Lagos state Governor Asiwaju Bola Tinubu, Senator Rochas Okorocha, Minister of state for Education Chukwuemeka Nwajiuba, Minister of Niger Delta Godswill Akpabio, Kogi state Governor Yahaya Bello, Ebonyi state Governor Dave Umahi and Jigawa state Governor Abubakar Badaru.\nAmosun declaresAmosun said if given the opportunity, his administration would prioritise human security as a fundamental principle to national security and economic development.\nHe said: “I will prioritise human security as the fundamental principle and ultimate goal of national security."
  },
  {
    "headline": "2023: PDP buying time on zoning, shifts NEC, caucus meetings to May 11",
    "summarized_story": "Ahead of its National Convention slated for May 28 and 29, the Peoples Democratic Party (PDP) has shifted its national executive committee (NEC) and national caucus meeting earlier slated for May 10 to May 11.\nWhile submitting the report April 5, Ortom said the committee only adopted a unanimous position to be presented to the National Executive Committee (NEC) of the party.\nAccording to the statement, the venue remains NEC Hall PDP National Secretariat, Wadata Plaza, Abuja at 2.00 pm.\nGovernor Diri spoke Thursday when a PDP presidential aspirant and Bauchi state Governor Bala Mohammed visited him in Government House Yenagoa.\nThe Bayelsa governor urged PDP members to collectively work for the success of the party in next year’s presidential election."
  },
  {
    "headline": "Breaking: Abuja stadium swimming pool shut as boy, 13, drowns",
    "summarized_story": "The Federal Ministry of Youth and Sports Development has shut down the swimming pool of the Moshood Abiola National Stadium, Abuja with immediate effect, two days after a 13-year-old boy was drown.\nThis was revealed in a statement by the Director Press and Public Relations of the Ministry Mohammed Manga on thursday.\nPart of the statement reads, “All activities within the pool area are therefore suspended till further notice.\n“This follows the unfortunate death through drowning of a 13 year old boy, Matthew Godwin on Tuesday, May 3, 2022 during the festive season.\n“A delegation from the Ministry has since paid the family of the deceased a condolence visit.”Share this: TwitterFacebook"
  },
  {
    "headline": "Oil price tops $108 a barrel ahead of OPEC+ meeting",
    "summarized_story": "Agency reportOil prices rose on Wednesday ahead of the periodic meeting of the Organisation of Petroleum Exporting Countries (OPEC) and its allies.\nBrent crude futures, the global oil benchmark, climbed 3.35 per cent to $108.25 a barrel at 10.20 GMT+1 — the first time since April 29.\nOn Wednesday, Ursula von der Leyen, president of the European Commission, announced that European Union countries would stop importing Russian oil in the next six months.\nThe ban on Russian oil is expected to have a ripple effect on the EU’s energy supply chain.\nAlready, the United States placed a ban on Russian oil imports, and the UK said it would follow suit by the end of the year."
  },
  {
    "headline": "GSM calls, data: Nigerians to pay more",
    "summarized_story": "Based on their proposal, the price floor of calls will increase from N6.4 to N8.95 while the price cap of SMS will increase from N4 to N5.61.\nThis was revealed in a letter titled, ‘Impact of the Economic and Security Issues on the Telecommunications Sector,’ which was sighted by our correspondent.\nThe letter was written by the telecommunications companies under the aegis of the Association of Licensed Telecommunication Operators of Nigeria, ALTCON, to the NCC.\nIn the letter, the telecom companies said there had been a 40 per cent increase in the cost of doing business in the nation.\nThey said this had resulted in an increase in energy costs, increasing their operating expenses by 35 per cent."
  },
  {
    "headline": "Govt, commercial users to pay for using Twitter – Elon Musk",
    "summarized_story": "By Emmanuel ObisueOn the heels of his acquisition of Twitter, billionaire entrepreneur, Elon Musk, on Wednesday said governments and other commercial users may have to pay to use the micro-blogging platform.\nAfter his $44 billion purchase of Twitter, Musk has now hinted that Buhari and other users may have to pay for using the platform.\nConfirming fears by the majority that his takeover might lead to commercialisation of the social media platform, Musk in a tweet in the early hours of Wednesday, said commercial and government users will pay for the platform.\n“Twitter will always be free for casual users, but maybe a slight cost for commercial/government users.\n“Twitter will always be free for casual users, but maybe a slight cost for commercial/government users,” he tweeted."
  },
  {
    "headline": "Naira slides to N589 to $1 at parallel market as FX liquidity crisis persists",
    "summarized_story": "By Agency reportThe free fall of Nigerian naira continued on Wednesday, dropping to N589 against the dollar at the parallel market.\nCurrency traders known as Bureaux De Change operators (BDCs) said that the forex liquidity crisis still persists in the market despite low demands.\nA parallel market (street market) is characterised by noncompliant behaviour with an institutional set of rules.\nThe Central Bank of Nigeria (CBN) has often maintained that the parallel market is not the true reflection of the naira.\nIt may increase the cost of foreign borrowing, force foreign investors to pull out their funds, causing further depreciation of the naira."
  },
  {
    "headline": "NCC issues final letters of licence award to 5G spectrum",
    "summarized_story": "By Chioma NnodimNigerian Communications Commission (NCC), has issued final letters of award of the Fifth Generation (5G) Spectrum Licences to MTN and Mafab Communications.\n“With the issuance of the final letters of awards of 5G spectrum and in line with the 5G auction’s Information Memorandum (IM), the two licensees are now expected to accelerate deployment of the 5G network.\nAdinde said the 5G network, when deployed, would bring a lot of benefits and opportunities that would engender accelerated growth and smart living in the country.\nHe, however, said the commission had confirmed the full payment of $273.6 million each by the two spectrum winners, in addition to spectrum assignment fee paid by MTN, for the 5G spectrum licence.\n“The National Digital Economy Policy and Strategy (NDEPS) 2020-2030, and other sector policies designed to enhance Nigeria’s digital transformation."
  },
  {
    "headline": "2023 Elections: Political Parties Have One Month To Conduct Primaries, Says INEC",
    "summarized_story": "The Independent National Electoral Commission (INEC) has reminded political parties that they have one month to conduct their primaries and present candidates for the 2023 general elections.\nINEC’s reminder came in a statement issued on Thursday by its National Commissioner & Chairman of Information and Voter Education Committee, Festus Okoye.\nAccording to the electoral body, political parties are expected to follow the timetable and schedule of activities as released by the commission ahead of the polls.\nIt explained that parties are “to conduct their primaries for the nomination of candidates from 4th April to 3rd June 2022”.\n“The Commission will continue to work with political parties to ensure fidelity to the Constitution, the Electoral Act, and the timelines for all the activities contained in the Timetable and Schedule of Activities for the 2023 General Election,” INEC said."
  },
  {
    "headline": "15 Killed In Katsina Boat Mishap",
    "summarized_story": "Fifteen people have been killed after a boat capsized at a section of river site located at Mai’adua Local Government Area of Katsina State.\nTo this end, funeral prayers have been conducted for the victims on Thursday at about 7:30 am at Tsabu town in Mai’adua LGA of the state.\nThe State Commissioner for Local Government and Chieftaincy Affairs, Hon.\nYa’u Umar Gwajo-Gwajo was among the dignitaries that attended the funeral service of the victims.\nHe used the opportunity to compensate the families of the deceased."
  },
  {
    "headline": "‘You’re An Engineer With Repute’: Buhari Hails Umahi’s Infrastructure Drive",
    "summarized_story": "President Muhammadu Buhari had lauded Governor Dave Umahi’s infrastructure drive, describing the Ebonyi leader as an engineer with repute.\nBuhari said this on Thursday while inaugurating the 700-metre length twin-flyover (also called King David’s University flyover).\nThese included a twin flyover, a 12-kilometre dualised Federal Road, from Mbu, Enugu State to Uburu, the university building and the University Medical Hospital, facilities and equipment.\nOn his part, Governor Umahi thanked Buhari for approving the funding of the Centre, saying that the facility is one of the best around the globe.\n”You have left a lot of indelible marks in the development of this centre of excellence and it will never be forgotten.”"
  },
  {
    "headline": "ASUU: Nigerian Students Ready To Be Shot To End Strike – Asefon",
    "summarized_story": "﻿The President of the National Association of Nigerian Students (NANS), Sunday Asefon on Thursday suggested that the union is prepared to hit the streets to protest the strike embarked by the Academic Staff Union of Universities.\nAccording to Mr Asefon, the government appears not to be interested in ending the strike as focus shifts to elections in 2023.\nHe referenced the protests in Benin-city embarked by some university students.\nREAD ALSO: University Students Protest For Second Day In Benin-City“We are talking about education, we are talking about life,” he said.\nBut we need to take action”Mr Asefon noted that the government should stop playing politics with the ASUU issue."
  },
  {
    "headline": "West Ham See Red As Frankfurt Reach Europa League Final",
    "summarized_story": "Eintracht Frankfurt reached their first European final for 42 years after a 1-0 home win on Thursday over 10-man West Ham sealed a 3-1 aggregate victory in their Europa League semi-final.\nWest Ham had left-back Aaron Cresswell sent off early on and Hammers manager David Moyes was also dismissed from the sidelines with 12 minutes left for arguing with the referee.\nColombia striker Rafael Borre netted the first-half winner on the night to book Frankfurt a place in the Europa League final on May 18 in Seville against Scottish giants Rangers.\nYet Frankfurt went ahead in the 26th minute.\nFrankfurt, who lost to Chelsea on penalties in the 2019 Europa League semi-finals, are into their first European final since winning the UEFA Cup in 1979/80."
  },
  {
    "headline": "We're happy the world is still with us in fighting terrorism, Buhari tells Guterres -",
    "summarized_story": "President Muhammadu Buhari in Abuja said Nigeria remains grateful to the United Nations and some world leaders on their steadfast partnership in fighting terrorism, saying the spotlight on Russia and Ukraine could easily distract from other pertinent global challenges.\nGod is a God of justice, so you cannot kill people and say God is great.\nPresidency NigeriaThe President thanked Secretary General Antonio Gutress for the maiden visit to Nigeria.\nGuterres said the United Nations had called for an additional 351 million dollars as part of the overall 1.1 billion dollars for the humanitarian response plan for Nigeria.\nThe UN Scribe said discussions with President Buhari also touched on laying groundwork to ensure peaceful and democratic elections next year – and the full participation of Nigeria’s women and young people."
  },
  {
    "headline": "2023: List of aspirants that have obtained N100m APC Presidential Form -",
    "summarized_story": "The number of Presidential aspirants on the platform of the All Progressives Congress has continued to rise despite the mixed feelings trailing the N100million expression of interest and nomination forms.\nThe party made headlines and generated controversy after it pegged the prices for its expression of interest and Presidential nomination forms at N30 million and N70 million respectively.\nSo far, about about twenty aspirants have indicated interest in the presidency while some have purchased the form.\nThe following are those who have so far obtained their expression of interest and nomination forms:Asiwaju Bola Ahmed TinubuYahaya Adoza BelloDave UmahiEmeka NwajiubaOther that have indicated interest and expected to purchase include;1.\nYemi Osinbajo3.Kayode Fayemi4."
  },
  {
    "headline": "Women in mega rally for Yahaya Bello in Akure, say we're not interested in zoning -",
    "summarized_story": "The women, who defied the heavy rain, on Wednesday morning, took to the streets, chanting solidarity songs and carrying various placards with inscriptions such as “Yahaya Bello, the best man for the job”, “We’re not interested in zoning, this is one Nigeria”, and “Yahaya Bello, hero of women inclusion”, among others.\nThe leader of the South-West market movement for Yahaya Bello, Deputy National President, Market Women Association of Nigeria, Princess Nike Aroloye, said the women of Nigeria were already looking beyond the primaries of the two parties.\n“We already see the ticket with Yahaya Bello.\nYahaya Bello is the one we will support.\n“Seeing this huge honest crowd, I am confident that Yahaya Bello’s good deeds, belief in women, and giant strides in a women-filled government, have earned him the trust of Nigerian women."
  },
  {
    "headline": "Breaking News: APC Extends sale of Nomination forms to May 10 -",
    "summarized_story": "The All Progressives Congress (APC) National Working Committee (NWC) on Monday extended the Party’s Sale of Expression of Interest and Nomination Forms for the 2023 General Elections to Tuesday, May 10, 2022.\nIn a revised timetable issued by the APC National Organising Secretary, H.E.\nSulaiman Muhammad Argungu, the last day for Submission of completed forms and accompanying documents is now set for Wednesday, 11th May, 2022."
  },
  {
    "headline": "Wike Calls Nigeria A Mad State + Terrorists Release 21 Abductees – Trending With Ojy Okpe",
    "summarized_story": "Presidential hopeful and Governor of Rivers State Nyesom Wike, on Wednesday described Nigeria as a Mad State which will require a mad person like him to make things better.\n21 out of 26 residents of Chikun Local Government Area of Kaduna State, kidnapped on the 30th of March 2021 were released by Terrorists on Wednesday after N20 million Naira and three new Motorcycles amounting to N800,000 thousand Naira were paid as ransom.\nIn the meantime United Nations secretary general Antonio Guterres on Wednesday said military operations are not enough to defeat terrorism in Nigeria.\nGodswill Akpabio, minister of Niger Delta affairs, on Wednesday, declared his intention to run for president on the platform of the All Progressives Congress."
  },
  {
    "headline": "Why We Demand A Southern Presidency – Oba Olushola Alao",
    "summarized_story": "Some religious leaders have also thrown their weight behind the South, providing the next Nigerian president in 2023.\nThe consensus is that a Southern presidency has become non-negotiable.\nTo further the conversation on a Southern presidency is Oba Francis Olushola Alao; The Olugbon Of Orile-Igbon, Ogbomosho Zone, and Deputy Chairman, Obas Council and Chiefs, Oyo State."
  },
  {
    "headline": "Russia-Ukraine War: Zelenskyy Appeals for Truce to Dig out Civilians Trapped under Mariupol Steel Plant",
    "summarized_story": "Civilians will need to be dug from bunkers under a steel works that is the last holdout of resistance in Ukraine’s Mariupol, President Volodymyr Zelenskiy said on Thursday, after a Russian bombardment that has littered the area with concrete debris.\nHaving failed to capture the capital Kyiv in the early weeks of an invasion that has killed thousands and flattened towns and villages, Russia has accelerated attacks in southern and eastern Ukraine, including on the Azovstal steel works in Mariupol."
  },
  {
    "headline": "Nigeria: Protesters Storm PDP, APC, Insist Power Must Go to the South – Arise News",
    "summarized_story": "The protesters that stormed the PDP national secretariat at about 11 am carried several placards on why the Nigeria’s presidency must shift to south in 2023.\nAlthough at the PDP national secretariat, known as the Wadata Plaza, no official of the party accorded them any audience, they thereafter proceeded to the Blantyre office of the APC, where the National Publicity Secretary, Mr. Felix Morka, told them the ruling party was yet to take a position.\nBefore departing the PDP office, leader of the group, Femi Odabinu, presented a letter to the national chairman, Dr. Iyorchia Ayu, in absentia.\n“We also wish to remind you, that the established convention is that power must rotate between the North and the South.\nHence a president of northern extraction follows that of Southern extraction and vice versa."
  },
  {
    "headline": "Nigeria Hopeful of Return of 96 Benin Artefacts from Cologne",
    "summarized_story": "Nigeria’s Ambassador to Germany, Mr. Yusuf Tuggar has said the federal government was confident that 96 Benin artefacts looted by the British Colonial masters about 125 years ago, and domiciled in Cologne, Germany would be returned to the country.\nTuggar, gave the assurance at the, ‘I Miss You Exhibition’ at Rautenstrauch-Joest Museum, Cologne attended by the city’s Deputy Mayor, Andreas Wolter, the Director of the museum, Nannete Snoep, the Chairman Edo United, Cologne, Samuel Egharevba and art historian Professor Peju Layiwola.\nRelatedStories No Content AvailableHe said the raison d’etre of the Benin artefacts could only be fully appreciated if they are returned to their source of origin for better understanding.\nThe Nigerian ambassador said the return of the Benin Bronzes would catalyse the colonial healing process like no other before, because of the exceptional nature of how the cultural items were looted.\n“Even the Oba of Benin was not spared; he was taken away the same way the Bronzes were."
  }
]