[
  {
    "headline": "Police confirm attack on Plateau students, one killed",
    "summarized_story": "One person was killed on Friday night while three others were injured when gunmen suspected to be terrorists opened fire in Kuru community, Jos South Local Government Area of Plateau State.\nIt was gathered that all the victims were students of a boarding school within the locality.\nSo, last night (Friday), they sent terrorists to attack the community.\n“Unfortunately, around Science School, Kuru, by Emmy fuelling station, opposite Assemblies of God’s Church, close to the school, the bandits who came in J5 vehicle opened fire on people.\n“A few of the students of Science School, Kuru, who went there to charge their phones, were affected."
  },
  {
    "headline": "Ekiti poll: APC, SDP supporters clash, one feared dead",
    "summarized_story": "While the APC blamed the SDP for attacking its members passing through the community, the opposition party claimed they were attacked by supporters of the ruling party.\nThe Director of Media, Biodun Oyebanji Campaign Organisation of the APC, Taiwo Olatunbsun, condemned the alleged violent attack on APC members in Itaji-Ekiti on Saturday, which he said “resulted in the killing of one APC member and many others sustaining severe injuries”.\nOlatubosun said, “Some APC members are at present hospitalised where medical personnel are battling to save their lives following life-threatening injuries they received in the attack carried out by SDP thugs.\n“The Oyebanji Campaign warns Oni and his supporters against further attacks on APC members.\nEarlier on Saturday, Adebayo had in a “press statement”, decried alleged incessant attacks on SDP members in different parts of the state by hoodlums believed to be APC supporters."
  },
  {
    "headline": "Gunmen invade Plateau again",
    "summarized_story": "By Marie-Therese NanlongGunmen on Friday night attacked residents of Kuru in Jos South local government area of Plateau State, killing one and injuring three others.\nThe deceased is said to be a student of Science Secondary School, Kuru.\nConflicting reports had emerged last night that gunmen had invaded the school as sources said students had left the school to charge their phones in the host community when the gunmen stormed the area at about 8 pm.\n“On reaching the scene, the gunmen had fled leaving behind one person dead and three others injured.\nThe Commissioner of Police Plateau State Command, CP Bartholomew Onyeka, advised members of the public to go about their lawful business as normalcy has already been restored in the area."
  },
  {
    "headline": "Democracy Day: ActionAid makes case for Nigerian women, youths, PWDs",
    "summarized_story": "ActionAid Nigeria’s Programmes Director, Suwaiba Muhammad Dankabo, made this known during a rally organized by the group in collaboration with Centre for Communication and Social Impact (CCSI) and Centre for Information, Technology and Development (CITAD) to commemorate Nigeria’s Democracy Day in Kano.\nDankabo further said that over the years, Nigeria’s democracy has been largely characterised by the exclusion of women, young people and PWDs, in the processes hence the need to change the trend.\n“The participation of Women continue to dwindle in each electoral cycle, despite the fact that women constitute the highest numbers at polling units.\n“On this day, let history have it that Nigerian women and youths have refused to stay quiet in the face of exclusion and rights denial.\nWe hereby encourage the women and youths to work and walk in solidarity, to keep the flag flying."
  },
  {
    "headline": "2023: Why APC, Tinubu should pick Ganduje as running mate —Aide",
    "summarized_story": "By Bashir Bello,KANOAmid ongoing consultations processes over who emerges as the running mate to All Progressive Congress, APC Presidential flag bearer, Asiwaju Bola Ahmad Tinubu, a Special Adviser to Governor Abdullahi Umar Ganduje on Media, Shehu Isa has opened up on why the party and Tinubu should pick Ganduje as running mate ahead of the 2023 presidential election.\nIsa who was quick to clear the air on the Muslim-Muslim ticket which he said was unconstitutional, noted that Ganduje was the best person to run along the presidential flag bearer of the party, Tinubu.\nThe Media aide made this known while speaking with newsmen in Kano over the weekend.\nAccording to Isa, “looking at the calibre and track records in both civil service, politics and the kind of person he is, Ganduje is perhaps the only option APC has.\nEven Tinubu will be at peace to work with him as running mate."
  },
  {
    "headline": "2023: Your victory in APC primaries, sign of acceptance by Nigerians – PSC hails Tinubu, Akpabio",
    "summarized_story": "By Luminous Jannamike, AbujaThe Presidential Support Committee, has congratulated the winners of the All Progressives Congress (APC) presidential primaries, Asiwaju Bola Tinubu, and the Akwa Ibom North-West Senatorial District re-run poll, Godswill Akpabio.\n“The PSC glorifies God Almighty, the maker and unmaker of kings, and hereby wishes our presidential candidate, Asiwaju Bola Tinubu, divine protection, good health, and good fortune in all his endeavors and good plans for a great country, Nigeria.\n“We appreciate the challenges ahead and shall as usual, dutifully mobilize our membership nationwide and in the diaspora to do the needful.\n“PSC, therefore, seizes the opportunity to salute Senator Akpabio’s resilience and patriotic resolve to step down for Asiwaju Bola Ahmed Tinubu in the just concluded APC Presidential Primaries, describing his action as uncommon, particularly as he took the decision in the best national interest.\n“Senator Akpabio is no doubt a celebrated leader in his community and his victory at the just concluded primaries for the position of senate has clearly attest to that.”"
  },
  {
    "headline": "Use your hands to unlock your hidden treasures — Scholar tells students",
    "summarized_story": "By Ebunoluwa SessouThe winner of Y2022 Laud Award for Best Lecturer of the year in Nigeria Private Universities, Dr. Seun Ebiesuwa of Babcock University has urged young Nigerians to unleash their academic potentials by using their hands noting that their hands are the instruments God would use to unlock their hidden treasures in their academics.\nDr. Ebiesuwa while addressing a cross section of secondary school students said it is imperative that students discover themselves first, noting that this is the process of understanding more about oneself in order to be fulfilled.\nHe emphasized that a good academic trajectory does not guarantee a great future but only God Almighty can guarantee the unlocking of a man’s academic potentials by citing some Bible verses.\n‘Nigeria is waiting for you as leaders that can make things happen and change the narrative for greater development, not for one but for all’ he urged.\nThe event, which had over one thousands students from both the private and public secondary schools was organized by Babcock University as part of the University’s aspiration to build leaders of thought with good character for the betterment of the society."
  },
  {
    "headline": "Terrorists release names of 11 freed Kaduna-Abuja train attack victims",
    "summarized_story": "The names of the 11 released Kaduna-Abuja train victims have been released.\nTerrorists had abducted over 60 train passengers in March 2022 but released the Managing Director of the Bank of Agriculture a few days later.\nThey also released a pregnant woman who was abducted alongside other victims.\nHowever, on Saturday 11, 2022, the terrorists released five males and six females whose names were given below;Amina Ba’aba MohammedRashida Yusuf BusariJessey JohnHannah AjewoleAmina JibrilNajib Mohammed DahiruHassan AliyuPeace A.\nPublisher of Desert Herald, Tukur Mamu, served as a mediator in the deal that led to their release."
  },
  {
    "headline": "Security personnel quell clash between Hausa, Igbo traders in Benin market",
    "summarized_story": "There was pandemonium at the popular New Benin Market in Oredo Local Government Area of Edo State on Saturday, following a clash between Hausa and Igbo traders.\nAlthough the situation has been brought under control, it took the quick intervention of combined security personnel to quell the crisis.\nThis was said to have led to free for all between the Igbo traders and the Hausa community within the market.\nArmed security personnel including soldiers, Department of State Security Service (DSS), police, and members of Edo State Vigilante Network were immediately drafted in to take over the market to quell the unrest.\n116 Mission Road, Benin City, Edo State."
  },
  {
    "headline": "NLC expresses worry over Zamfara, Cross River, Abia, Taraba’s refusal to implement N30,000 minimum wage",
    "summarized_story": "The Nigeria Labour Congress, NLC, has lamented the alleged refusal of Taraba, Zamfara, Cross River and Abia states to implement the approved national minimum wage of N30,000.\nThis was lucidly demonstrated today at the ongoing 110 Session of the International Labour Conference in Geneva, Switzerland, when the NLC President, Ayuba Wabba, called on the Federal Government to compel state governors yet to adhere to the call to do so.\nHe expressed sadness that four out of the 36 states of the federation have yet to commence or implement the minimum wage since 2019 when the Federal Government began its implementation in the country.\nWabba, who went ahead to note that “minimum wage is a law and a convention that the Nigerian government as ratified” said “since 2019, the minimum wage was enacted” some states are yet to commence the process of implementation.\nHe stressed that the Federal Government has a uty to compel the states to adhere to the national minimum wage."
  },
  {
    "headline": "Gov Obaseki mourns music maestro, Osayomore Joseph",
    "summarized_story": "The Edo State Governor, Godwin Obaseki has expressed sadness over the death of a popular highlife musician, Ambassador Osayomore Joseph who died on Saturday.\nThe governor, in a statement he personally signed, described the music maestro as an enigmatic and versatile musician who according to him, had spread didactic messages via his “soulful and sonorous voice”.\nObaseki recalled how the music legend exported the culture of Edo people to the world through his songs.\n“His long music career, which started in the 1970s, was very productive and enriched the lives of many.\n“I commiserate with the Osayomore family, fans and friends of the illustrious musician and pray that God will grant all the fortitude to bear this irreparable loss”, the statement added."
  },
  {
    "headline": "After my 7-day ultimatum, killers of Owo Catholic church worshippers have all been found – Oyedepo",
    "summarized_story": "Bishop David Oyedepo of Living Faith Church has claimed that the gunmen who attacked and killed over 40 worshippers of St. Francis Catholic Church Owo in Ondo State have all been found.\nOyedepo had while reacting to the news, declared seven days ultimatum for the assailants to be arrested, saying if they escape, then he is not sent by God.\nHe said, “Our God answers prayers, all those demons that attacked the Church in Owo have all been found.\nIt is not seven days yet.\n“I said of they are not caught within seven days then I’m not called by God, now, they have all been caught."
  },
  {
    "headline": "Professionals in government: Issues in navigating policy space in Nigeria",
    "summarized_story": "It is however the United States’ policy management experience during and after the war that signalled the widening of the policy space beyond the remit of traditional policy imperatives.\nAmerica facilitated the inclusion of scholars and intellectuals, as well as the introduction of think tanks, into the policy space.\nIt has the potentials to both muddle the policy management space as well as strengthen it.\nAnd yet the bureaucratic policy space is professionally unique and cannot be arrogantly transgressed by those who think they have better expertise.\nWith managerialism, the policy management space can no longer be the same."
  },
  {
    "headline": "2023: The die is cast (1)",
    "summarized_story": "INEC time table for the conduct of the presidential primaries for the 2023 Presidential election has Thursday, 9 June, 2022 as deadline.\nThe Presidential election, scheduled for 25 February, 2023 has, as the late Chief K. O Mbadiwe of blessed memory would have put it, real men of ‘timber and calibre’, as candidates.\nAlhaji Atiku Abubakar was a very vivacious and effective Vice President the way he handled the Economy which was under his portfolio.\nIt goes thus: fearing Northern reaction after 13 per cent derivation was approved for oil producing states, President Obasanjo did not authorise payment of the funds.\nA man very much after my heart except for his seeming political harlotry, running round political parties chasing presidential candidacy."
  },
  {
    "headline": "Ekiti Decides 2022: Oyebanji outsmarting opponents?",
    "summarized_story": "We have been embarking on stakeholders’ meetings with every critical stakeholder in Ekiti State.\nI was part and parcel of the team that fought for the creation of Ekiti State.\nI was even the Secretary of that Committee and I put together the blueprint for the development of Ekiti State.\nAlso, I have been selling my manifesto to every critical stakeholder in Ekiti State, and I believe that this has been helpful.\nThis is a game changer in the history of campaigns in Ekiti State and it has been extremely helpful."
  },
  {
    "headline": "Boris Johnson has only delayed the inevitable",
    "summarized_story": "In Britain, Johnson is opposed both in the country at large and among what should be the Tory grassroots.\nAnd so long as the country feels this way, he is toast—or, if he isn’t, then the Conservative Party most certainly is.\nAt a stroke Johnson became the most radical and consequential prime minister since Thatcher and, it seemed, was destined to remain in office for as long.\nHere was the extraordinary spectacle of a Conservative prime minister being jeered by a crowd of flag-waving monarchists.\nJohnson is just the latest prime minister to fail spectacularly at the job, though in his case, in uniquely grubby circumstances."
  },
  {
    "headline": "Train attack: Terrorists release 11 of 62 abducted passengers",
    "summarized_story": "After about 75 days in captivity, terrorists who attacked the Abuja-Kaduna AK9 train, killed nine passengers and abducted about 65 others, have released 11 of the remaining 62 abductees.\nThe terrorists attacked the train with over 300 passengers on board on March 28 around Katari and Rijana axis of Kaduna State.\nHe said the 11 abductees were freed after intense negotiations between the Federal Government and the terrorists.\nAccording to him, the 11 victims released include: Jessy John, Amina Ba’aba Mohammed (Gamba), Rashida Yusuf Busari, Hannah Ajewole and Amina Jibril.\nAccording to him, some retired Army Generals and a renowned professor also assisted toward the release of the passengers."
  },
  {
    "headline": "I’ll continue to support God’s work through evangelism –Kalu",
    "summarized_story": "From Ogbonnaya Ndukwe, AbaRenowned philanthropist and current Chief Whip of the Nigerian Senate, Dr Orji Uzor Kalu, yesterday, pledged to continue providing needed support and other assistance towards evangelism in parts of the country and beyond.\nDo not miss the Vital Information, it goes off in 2 days!\nIn a speech she read on his behalf, Mrs Kalu said: “His Excellency said I should bring greetings to the Church, the General Assembly Moderator, other leaders and the entire membership.\nHe would have been here in person but had sent me to represent him.\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "Anxiety as gunmen whisk away 15 youths in Imo",
    "summarized_story": "From Stanley Uzoaru, OwerriEkwe community in Isu Local Government Area of Imo State was gripped by fear on Saturday as gunmen whisked away 15 youths at Njaba Bridge – to an unknown location.\nA source who disclosed the incident Sunday Sun said the gunmen stormed the community through the Njaba River, a boundary between Ekwe community and Amucha in Njaba LGA.\nAccording to the source, the youths were said to be excavating sand at the Njaba River when the gunmen swooped on them and took them away after shooting sporadically in the air and searching for other youths in the vicinity.\n“This morning, some masked gunmen invaded our community, Ekwe, through Amucha, arrested some young men who were excavating sand at Njaba River.\nHe disclosed that four of the gunmen stormed his palace and ordered everybody in his palace to lie face down."
  },
  {
    "headline": "Aregbesola ally Alimi defects to PDP, becomes deputy head of Adeleke campaign",
    "summarized_story": "From Lateef Dada, OsogboKolapo Alimi, a close ally of former governor of Osun State and Minister of Interior Rauf Aregbesola, has finally dumped the All Progressives Congress (APC) for the People’s Democratic Party (PDP).\nAlimi, whose defection was earlier rumoured, had promised to make it open when it is time.\nIt was gathered that Alimi has been appointed as the Deputy Director-General of Adeleke Campaign Organisation, with a mandate to work with the PDP to ensure the emergence of its candidate in the July 16 governorship election.\nThe Director of Media and Publicity of PDP in the state, Oladele Oluwabamiji, confirmed that Alimi is now in PDP.\nHe said that “Adeleke’s defection to PDP is confirmed and he has also been appointed Deputy Director-General, Adeleke Campaign Organisation.”Alimi also confirmed his defection saying he will inform the public very soon."
  },
  {
    "headline": "Muslim-Muslim Joint Ticket: APC candidate Tinubu must look beyond religious sentiment — NWC member",
    "summarized_story": "In a statement he issued in Abuja on Saturday, titled: “Issues for APC 2023 presidential campaign’, he wrote that if Nigeria is to move forward, 2023 presidential campaigns must not be reduced to sentimental considerations of ethnicity and religion.\nQuestion of Muslim-Muslim ticket, implying that another Muslim from the North will most likely be Asiwaju’s running mate.\nLeading party members are already becoming strong advocates for or against a so-called Muslim – Muslim ticket.\nIf Nigerian politics is to overcome the adversities of these so-called religious and ethnic leaders, religious and ethnic backgrounds of leaders must be subordinated to experiential attributes of persons being considered for leadership.\nAPC leaders must acknowledge the fact that the 2023 elections present another golden opportunity for the APC to re-invent itself,” he warned."
  },
  {
    "headline": "Terrorists release 11 hostages from Kaduna train attack",
    "summarized_story": "From Noah Ebije, KadunaThe media consultant of Sheikh Ahmad Gumi, Malam Tukur Mamu has revealed that 11 abducted train passengers were released hy their terrorist hostage-takers Saturday.\nHe said that the 11 hostages that were released have been flown on the orders of President Muhammadu Buhari to Abuja for medical evaluation and treatment before the decisionattack to reunite them with their families.\nAccording to him, some retired army generals and a renowned professor also assisted in the release of the passengers.\nPartner with me, let's get you making N500K to N500K a month!\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "Don’t Present Muslim Running Mates, CAN, Northern Christian Elders Warn Tinubu, Atiku",
    "summarized_story": "But Governor Nasir El-rufai of Kaduna State stressed yesterday that competence should determine his party’s choice of presidential running mate instead of religion.\n“We do not subscribe to Christian/Christian ticket or Muslim/Muslim ticket.\nThose who are planning Muslim/Muslim ticket should also find out what was the outcome of MKO Abiola and Kingibe ticket in 1993.\nIf they try Muslim/Muslim ticket this time around, the outcome will be worse because our fault lines are very visible.\n“Now, extending that consideration to the Muslim-Muslim ticket, I have lived among the Christians and I know that among the Christians, the question of a Muslim-Muslim ticket is a no-go area."
  },
  {
    "headline": "Alleged $50m Fraud/Sale of Assets: Wike Orders Trial of Amaechi, Cole",
    "summarized_story": "The Rivers State Governor had in 2015 set up a Judicial Panel of Inquiry to investigate the activities of the Amaechi administration and the panel thereafter indicted Amaechi, Cole and some others for corruption.\nHowever, analysts are of the view that the drive to prosecute Amaechi and Cole is aimed at making the APC governorship candidate unelectable.\n“Once Cole is put on trial, and obviously will be convicted, his drive to become Rivers State governor ends,” said the analysts.\nLuckily, you came at the right time when we had preferred criminal charges against the former governor (Amaechi), Sahara Energy’s Tonye Cole and the rest of them.\nWike, who spoke during a media parley in Abuja, said the judgement had vindicated the Rivers State Government."
  },
  {
    "headline": "Breaking: Killers of Olufunke Olakunri, Daughter of Afenifere Leader, Sentenced to Death by Hanging",
    "summarized_story": "Fidelis David in AkureAn Ondo State High Court sitting in Akure, the state capital on Friday sentenced killers of Olufunke Olakunri, daughter of Afenifere leader to death by hanging.\nThey include: Lawal Mazaje from Kogi Sate; Adamu Adamu from Adamawa State; Mohammed Usman from Sokoto State.\nThe defendants were arraigned on counts of armed robbery, conspiracy, conspiracy to commit felony, conspiracy to commit armed robbery, kidnapping, murder, aiding and abetting.\n1 Laws of Ondo State of Nigeria, 2006.\n“You could see that one of the defendants was discharged by the judgement of the court court."
  },
  {
    "headline": "Buhari: Tinubu Has Track Record to Lead Our Party to Victory in 2023",
    "summarized_story": "Buhari stated this in a letter to the returning officer of the APC presidential primary convention and governor of Kebbi State, Atiku Bagudu, commending the success of the exercise.\n“Your commitment in pursuit of equity and fairness speaks volumes in the cooperation displayed by APC governors.\n“The party primaries were peacefully conducted and the delegates have selected the candidate to carry the APC flag in the 2023 presidential election.\n“I look forward to working closely with APC governors to support Senator Bola Ahmed Tinubu and all our APC candidates to success in 2023.\nTinubu was at the villa to thank the president for his support and successful hosting of the APC presidential primary."
  },
  {
    "headline": "FG: We’ve Traced Owo Killings to ISWAP",
    "summarized_story": "Unfortunately, gunmen, again struck in Sabo area of Ondo town, in Ondo West Local Government Area of the state and have killed six men.\n“The council is quite concerned about the violent attack in Owo, Ondo State, and has been able to locate the perpetrators of that horrendous attack.\n“It is not an ethnoreligious thing, the animals in ISWAP wanting attention, recognition, are suspected to have launched that attack.\nHe said, “They came to our area (Sabo) on motorbikes and each was carrying three gunmen.\nIt was against these developments that Afenifere, yesterday, paid a condolence visit to Ondo State Governor, Mr Oluwarotimi Akeredolu (SAN), in Akure, the state capital."
  },
  {
    "headline": "How Ogun Police Spokesperson Protects Alleged Fraudulent Car Dealer, Detains, Parades Victim",
    "summarized_story": "Sokunbi Damilola, an Abeokuta-based aluminium fabricator, has narrated how Mohammed Seedu, a car dealer, allegedly influenced the Ogun State Police Command to detain him and his friends after defrauding him of N3million.\nPolice Public Relations Officer, DSP Abimbola OyeyemiHe said he met Seedu in September 2021, after one of his church members, who is also a police officer, introduced him as a reliable car dealer.\n“On September 8, 2021, I journeyed to Coutonu, Benin Republic, with the dealer to get my car.\nOn February 13, 2022, Damilola got a hint from his friends that the dealer was in a car wash around Olomore, Ogun State.\nWhen Oyeyemi, the Ogun police spokesperson, was contacted, he said he was in a meeting."
  },
  {
    "headline": "How Ogun Police Spokesperson Protects Alleged Fraudulent Car Dealer, Detains, Parades Victim",
    "summarized_story": "Sokunbi Damilola, an Abeokuta-based aluminium fabricator, has narrated how Mohammed Seedu, a car dealer, allegedly influenced the Ogun State Police Command to detain him and his friends after defrauding him of N3million.\nPolice Public Relations Officer, DSP Abimbola OyeyemiHe said he met Seedu in September 2021, after one of his church members, who is also a police officer, introduced him as a reliable car dealer.\n“On September 8, 2021, I journeyed to Coutonu, Benin Republic, with the dealer to get my car.\nOn February 13, 2022, Damilola got a hint from his friends that the dealer was in a car wash around Olomore, Ogun State.\nWhen Oyeyemi, the Ogun police spokesperson, was contacted, he said he was in a meeting."
  },
  {
    "headline": "EXCLUSIVE: Community Residents In South-East Nigeria, Others Desert Homes Over Rise In Ritual Killings",
    "summarized_story": "\"I moved away from the community more than one week ago over the rise in mysterious deaths and mutilated bodies.\n\"Ritual killings subsided here a bit some time ago but it appears the evil has returned.\nA community leader in the area, Ezekiel Mba, told SaharaReporters that they were worried about the situation, adding that ritual killers were wreaking havoc around Isiala-Ngwa.\nThe son named Afeez Olalere disclosed that his mother encouraged him to kill his younger sibling for a money ritual.\nOn Wednesday, the House of Representatives called for the declaration of a national emergency of the rising cases of ritual killings across Nigeria."
  },
  {
    "headline": "EXCLUSIVE: Community Residents In South-East Nigeria, Others Desert Homes Over Rise In Ritual Killings",
    "summarized_story": "\"I moved away from the community more than one week ago over the rise in mysterious deaths and mutilated bodies.\n\"Ritual killings subsided here a bit some time ago but it appears the evil has returned.\nA community leader in the area, Ezekiel Mba, told SaharaReporters that they were worried about the situation, adding that ritual killers were wreaking havoc around Isiala-Ngwa.\nThe son named Afeez Olalere disclosed that his mother encouraged him to kill his younger sibling for a money ritual.\nOn Wednesday, the House of Representatives called for the declaration of a national emergency of the rising cases of ritual killings across Nigeria."
  },
  {
    "headline": "Nigerian Police Arrest Two Lagos State Workers For Faking Kidnap, Collecting Ransom",
    "summarized_story": "A 29-year-old employee of the Lagos State Waste Management Authority (LAWMA) and his colleague have been arrested by the police for allegedly faking his kidnap and collecting the sum of N150,000 as ransom.\nHundeyin said detectives from the State Criminal Investigation Department of the command carried out the arrest after a painstaking investigation of the suspects.\nAccording to him, the 29-year-old suspect, after faking his own kidnap travelled to Lugbe in Abuja, where he made a video of himself in captivity.\n“Investigations revealed that the first suspect, who was arrested in Abuja conspired with the second suspect to self-stage his kidnap and made the video that was sent to the co-worker for ransom.\n“The first suspect also confessed to have shared the ransom equally with the second suspect and used his share in acquiring a generator and other items for himself."
  },
  {
    "headline": "Tinubu and Atiku: Birds of a feather",
    "summarized_story": "The stage is now getting set for a grand battle between Tinubu and Alhaji Atiku Abubakar, the presidential flagbearer of the leading opposition party, the Peoples Democratic Party (PDP).\nTinubu and Atiku remained friends but while the former vice-president participated in the transition programme of Gen Sani Abacha in 1997/98, Tinubu was in exile funding pro-democracy agitations in Nigeria.\nIn the end, Iwu organised a sham of a presidential election in 2007, announcing final results while votes were still being counted.\nIn the history of Nigeria, it is only the 2007 presidential election that does not have a state-by-state breakdown.\nIt appeared it was at this juncture that Tinubu and Atiku finally parted ways."
  },
  {
    "headline": "Tinubu and Atiku: Birds of a feather",
    "summarized_story": "The stage is now getting set for a grand battle between Tinubu and Alhaji Atiku Abubakar, the presidential flagbearer of the leading opposition party, the Peoples Democratic Party (PDP).\nTinubu and Atiku remained friends but while the former vice-president participated in the transition programme of Gen Sani Abacha in 1997/98, Tinubu was in exile funding pro-democracy agitations in Nigeria.\nIn the end, Iwu organised a sham of a presidential election in 2007, announcing final results while votes were still being counted.\nIn the history of Nigeria, it is only the 2007 presidential election that does not have a state-by-state breakdown.\nIt appeared it was at this juncture that Tinubu and Atiku finally parted ways."
  },
  {
    "headline": "APC ticket: Umahi accuses south-east delegates of trading votes",
    "summarized_story": "Dave Umahi, governor of Ebonyi, says delegates from the south-east “traded their votes” in the just-concluded presidential primary of the All Progressives Congress (APC).\nI implored the delegates that the issue was not about me, but the mood of the Igbo in the nation.\n“They will come later to preach about Igbo unity and its agenda but henceforth, the only agenda I know is the Ebonyi agenda.\n“You (Ebonyi delegates) have made yourselves reference points of steadfastness in the country and when people are seeking trustworthy people, they will come for you.\n“I have lost total confidence in the leadership of the Ohanaeze Ndigbo socio-cultural organisation, and will openly confront anyone who challenges the Ebonyi agenda.”"
  },
  {
    "headline": "APC ticket: Umahi accuses south-east delegates of trading votes",
    "summarized_story": "Dave Umahi, governor of Ebonyi, says delegates from the south-east “traded their votes” in the just-concluded presidential primary of the All Progressives Congress (APC).\nI implored the delegates that the issue was not about me, but the mood of the Igbo in the nation.\n“They will come later to preach about Igbo unity and its agenda but henceforth, the only agenda I know is the Ebonyi agenda.\n“You (Ebonyi delegates) have made yourselves reference points of steadfastness in the country and when people are seeking trustworthy people, they will come for you.\n“I have lost total confidence in the leadership of the Ohanaeze Ndigbo socio-cultural organisation, and will openly confront anyone who challenges the Ebonyi agenda.”"
  },
  {
    "headline": "Gunmen kill APGA youth leader in Anambra",
    "summarized_story": "Emeka Alaehobi, a youth leader of the All Progressives Grand Alliance (APGA), has been killed by gunmen in Anambra state.\nAlaehobi was said to have been killed in Utuh, a community in Nnewi south LGA on Saturday.\nThe youth leader was reportedly abducted on Thursday after gunmen raided his residence in Ukpor community.\nThe assailants’ latest attack comes days after a woman and her four children were killed by gunmen in a community in Orumba north LGA of the state.\nA week before the killing of the woman and the children, Okechukwu Okoye, lawmaker representing Aguata II constituency in Anambra state, was beheaded by gunmen."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Moroccan Chari acquires Ivorian B2B e-commerce startup Diago",
    "summarized_story": "Chari, a Moroccan B2B e-commerce and fintech startup, today announced that it has acquired a 100% stake in Diago, an Ivorian app that connects neighborhood shops to FMCG producers and importers.\nThe all-stock transaction was facilitated by AF Legal and RBB International firms, representing Chari, and Houda Law Firm, representing the Ivorian upstart.\nThis acquisition is coming only 3 months after Chari acquired Axa Credit, the credit arm of Axa Assurance Maroc, for $22 million.\nJust last month, a Nigerian autotech startup Autochek travelled up north to acquire Moroccan KIFAL Auto.\nNow, Chari is acquiring a West African startup."
  },
  {
    "headline": "Boomplay launches in Côte d'Ivoire",
    "summarized_story": "Boomplay, a Chinese-owned music streaming platform for African artists and songs, has launched in Côte d’Ivoire.\nToday, the platform opened the doors of its Ivorian offices in Abidjan to enhance music streaming, and help Ivorian artists reach a broader audience within and outside the continent.\nCote D’Ivoire marks the 6th African country with Boomplay’s presence after Nigeria, Tanzania, Kenya, Tanzania, Ghana and Cameroon.\nSpeaking about the launch, Boomplay Côte d’Ivoire General Manager, Paola Audrey Ndengue, said, “We’re particularly proud to establish a presence in Abidjan, a creative and cultural hub in the region.\nGuy-Constant Neza, an Ivorian label manager at Believe Digital told Lemonde that 80% of Ivorian artists’ income comes from live performances."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "2 Russian lawmakers sacked for criticising Ukraine war",
    "summarized_story": "The Russian Communist Party in far-eastern Primorsky Krai on Wednesday expelled two regional lawmakers for calling for an end to the war in Ukraine.\nThe call from the two lawmakers from the Primorye region around Vladivostok in Russia’s far east prompted great interest internationally as it showed there was resistance inside Russian politics to the war.\nWhile one colleague supported the move, the regional leadership and his own party leadership accused him of betrayal and threatened consequences.\nIt was unclear whether the two lawmakers will face further disciplinary measures aside from being expelled from the regional party faction.\nRussia’s government has tightened laws to prevent domestic protest against the war since it invaded Ukraine in February."
  },
  {
    "headline": "Zelensky, Erdogan agree on restoration of peace in Ukraine",
    "summarized_story": "Zelensky, Erdogan agree on restoration of peace in UkraineUkrainian President, Volodymyr Zelensky, said he had talks with Turkish President Recep Tayyip Erdogan and both sides agreed on the need to restore peace in Ukraine.\n“Unanimously we agreed on the need to restore peace.\nDuring the conversation, Zelensky and Erdogan also discussed the threats to food security due to the Russia-Ukraine conflict and the ways to unblock Ukraine’s ports.\nThe statement said Turkey had made every effort to continue the negotiations between Ukraine and Russia.\nEarlier, Erdogan held phone talks with Russian President Vladimir Putin."
  },
  {
    "headline": "Russia preparing major attack on Donbas city of Slovyansk – Ukraine",
    "summarized_story": "Russian forces were preparing for a large-scale attack around Slovyansk, the base of Ukrainian defence forces in the eastern Donbas region, the Ukrainian General Staff said on Monday.\nRussian troops were moving new units as they were ready to attack Slovyansk from both Russian-controlled Izyum, a city about 50 kilometres to the north.\nMoscow has been pouring its military resources into eastern Ukraine for weeks and, in spite of heavy resistance from Ukrainian forces, Russia has slowly gained ground.\nKiev said Moscow was focusing on cutting Ukrainian supply lines near Severodonetsk.\nSeverodonetsk had been the target of Russian attacks for months and was considered the largest Donbas city still held by Ukraine."
  },
  {
    "headline": "Just imagine Atiku or Tinubu as president",
    "summarized_story": "ALL manners of experts have filled media spaces with their laudatory tales of how former Vice President Abubakar Atiku, and the former Governor of Lagos State Jagaban Borgu Ashiwaju Bola Ahmed Tinubu won the tickets of their respective parties.\nAtiku and Tinubu deserve their victories.\nSo said Tinubu when he pledged to work with whoever won in the All Progressives Congress, APC.\nTheir political sagacity got Nigeria into the nightmare administration of President Muhammadu Buhari.\nRead also: Atiku, Tinubu unveil economic agendaPONZI schemes are back in fuller force under more guises."
  },
  {
    "headline": "I will back Tinubu to achieve the new Nigeria dream – Osinbajo",
    "summarized_story": "Despite the outcome of the results of the All Progressives Congress (APC) Presidential Primary, Vice President Yemi Osinbajo, has declared that he remains committed to the dream of a new Nigeria.\nWhat is new is that we have a firm belief that a new Nigeria is possible and it is possible through us who are here,” Osinbajo said.\n“A new Nigeria has only just started, and everywhere across this land, it will be clear to all that a new Nigeria has been born.\nRead also: Goodluck Jonathan congratulates Atiku, Tinubu, others“In that letter, I said to him that the dream of this country, the dream of a new country remains alive and well.\nIn every fight, you lose some battles.”Also speaking, some leaders of Osinbajo Support groups, Ahmed Badanga described the Osinbajo as “a role model to all of us."
  },
  {
    "headline": "2022 Democracy Day: Obaseki tasks on unity, urges Nigerians to uphold ideals of founding fathers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has tasked Nigerians to uphold the ideals of the nation’s founding fathers, who fought assiduously for the realisation of an independent country rooted in the values of justice and equity.\nThe governor, in his 2022 Democracy Day message, urged citizens to recommit to the process of “renewing ourselves and work in unison to make our country live up to its promise as the greatest black nation on earth.”Obaseki said, “As we mark the 2022 Democracy Day, I enjoin Nigerians to uphold the ideals of our nation’s founding fathers, who fought assiduously for the realisation of an independent country rooted in the values of justice and equity.\n“Our democratic sojourn has taught us deep lessons on the centrality of freedom and unity to coexist despite our differences.\n“We are at crossroads, as it appears we are yet to get the full dividend of democracy and feel unsure sometimes of the gains of democracy.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo takes ‘Operation Plan Edo’ to Ohoghobi community, as residents laud govt’s masterplan initiative – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has commenced the Operation Plan Edo exercise in Ohoghobi Community, in Ikpoba-Okha Local Government Area of the state, as part of its ongoing efforts to generate a database to ensure development adheres to the state’s urban and regional development plans.\nCommissioner for Physical Planning, Urban and Regional Development, Isoken Omo, while flagging off the exercise, said that the initiative would provide data to ensure equitable distribution of government projects across the state.\nThis is to help the Edo State Government in planning for the community’s needs.\nThis includes the number of schools, roads, access to potable water, electricity, and medical services, among others.\n“The data collected will be collated for the planning of Edo."
  },
  {
    "headline": "Obaseki, German govt move to bridge technical skill gap with exchange programmes – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…plans job placements for Edo trainees in GermanyBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said his government is concluding plans to establish technical and vocational centres in the state with one year of study in Nigeria and job placement opportunities with companies in Germany.\nThe governor, who disclosed this to journalists in Benin City, said the partnership is part of efforts to bridge the technical skill gap of youths in the state.\n“Already, we are in conversation with the German Confederation of Skilled Crafts to establish technical and vocational centres in Edo with one year of study in Nigeria.\nWe are also exploring opportunities of the training in Germany with the possibilities of returning or staying in Germany.”He added, “In our recent visit to the European country, we explored several opportunities for skill transfer, partnership and investments.\nWe met with leaders of the German government and those of the GIZ Migration and Diaspora Programme to deepen investment in Edo in pursuit of the drive to make the state the most competitive subnational in Africa."
  },
  {
    "headline": "Tinubu pays surprise visit to Osinbajo – Nigerian Observer",
    "summarized_story": "At the time Tinubu arrived, the VP was meeting with Senator Kabiru Gaya; former Defence Minister, Major General Dan Ali (retd), and other associates.\nThe VP received Tinubu alongside his other guests and they exchanged pleasantries.\nEarlier, The NIGERIAN OBSERVER reported that the Vice president, Prof. Yemi Osinbajo, has finally sent a congratulatory message to Asiwaju Bola Tinubu.\nRecall that at the APC presidential primary, which started on Tuesday and was rounded off on Wednesday, Tinubu got 1,271 votes to clinch the party’s presidential ticket.\nOther results were former Minister of Transportation, Rotimi Amaechi, got 316 votes; Osinbajo, 235 votes; a former Minister of State for Education, Chukwuemeka Nwajiuba, one vote; Senator Rochas Okorocha and Pastor Tunde Bakare got zero vote each."
  },
  {
    "headline": "KARAMBANI KO KARAMBANA: Ahmed Isah ya dakatar da tarawa ASUU naira biliyan 18, bayan an tara naira miliyan 12",
    "summarized_story": ""
  },
  {
    "headline": "Kotu ta yanke wa Kansilan da ya lakaɗa wa mahaifiyar matarsa dukan tsiya hukuncin ɗauri",
    "summarized_story": ""
  },
  {
    "headline": "YAJIN AIKIN ƘUNGIYAR ƘWADAGO: Kotu ta ce kwamitin binciken da Gwamnatin Kaduna ta kafa haramtacce ne",
    "summarized_story": ""
  },
  {
    "headline": "Ba a saki fasinjojin jirgin kasan Kaduna dake tsare hannun ƴan bindiga ba",
    "summarized_story": ""
  },
  {
    "headline": "Sanata Aliero ya yi nasara a zaben fidda dan takarar sanata na Kebbi ta tsakiya a PDP",
    "summarized_story": ""
  },
  {
    "headline": "MultiChoice subscriber base reaches 21.8m households",
    "summarized_story": "The MultiChoice Group has released its financial results for the year ended March 31, 2022.\nThe results show that the group’s linear pay-TV subscriber base (measured on a 90-day active basis) increased by 0.9 million to reach 21.8 million households, comprising 9 million in South Africa and 12.8 million in the Rest of Africa (RoA), led by Nigeria.\nThe Group said the 5% growth year-on-year (YoY) is subdued due to the tough economic environment and elevated subscriber growth during COVID-19-related lockdowns in the previous year.\nMore specifically, the year ahead will see the group increasing its investment in local content, targeting an allocation of 50% of total general entertainment spend by FY24,” he added.\nThe company adds that the Rest of Africa (RoA) business benefited from the popularity of local content such as Big Brother Naija and live sporting events."
  },
  {
    "headline": "Justin Bieber illness video heartbreaking, says UK patient with same condition",
    "summarized_story": "“I’ve watched his video and I’m not going to lie, I shed a couple of tears.\nI never thought that I would relate to someone so much that I didn’t know,” Nicoya Rescorla told Reuters.\nFormer teen star Bieber, 28, disclosed on Friday that he had been diagnosed with a virus that left half of his face paralysed and forced him to cancel some upcoming performances.\n“I think personally for me stress was a huge factor, a huge factor,” said Rescorla, who is also 28 and has three children.\nObviously, Justin Bieber … he’s a huge celebrity, and I also felt so proud that he was spreading awareness of Ramsay Hunt syndrome."
  },
  {
    "headline": "Gunmen kill APGA youth leader in Anambra",
    "summarized_story": "Some unknown gunmen have reportedly killed Emeka Alaehobi, a youth leader of the All Progressives Grand Alliance (APGA), the ruling party in the state.\nSources said the youth leader was kidnapped from his home in Ukpor, Nnewi South Local Government Area of the state two days ago.\nHowever, no call for ransom was known to have been made, until his remains were found on Saturday morning in a neighbouring town, Utuh.\nAnambra State Police Command spokesperson, DSP Toochukwu Ikenga, confirmed that a corpse was discovered in the area on Saturday, but was unable to ascertain the identity of the corpse.\nThe council headquarters has severally been attacked, same for the police division in the area."
  },
  {
    "headline": "Cristiano Ronaldo rape lawsuit in US dismissed by judge",
    "summarized_story": "A judge in the US has dismissed a rape lawsuit claim from a Nevada woman against Cristiano Ronaldo, football star, in Las Vegas.\nMayorga has claimed that she was assaulted by Ronaldo at a Las Vegas hotel in 2009 but the footballer has denied the allegation against him.\nOn June 12, 2009, Ronaldo met Mayorga at the now-closed nightclub Rain, and they were pictured by paparazzi on that evening.\nMayorga has alleged that she was invited back to Ronaldo’s suite at the Palms Place Hotel, where it is alleged that the rape took place.\nA day later, on June 13, 2009, Mayorga reported the alleged rape to police but opted against revealing her name or the name of her alleged attacker, or where the incident had taken place."
  },
  {
    "headline": "PDP berates Tinubu, APC over ‘attack’ on Igbo voters wanting to collect PVC in Lagos",
    "summarized_story": "The People’s Democratic Party (PDP), has accused Bola Tinubu, presidential candidate of the All Progressives Congress (APC) of employing violence to stop Nigerians, especially those of Southeast extraction, from obtaining their permanent voter cards (PVCs) out of fear of losing the presidential election to Alhaji Atiku Abubakar.\nTraders, mostly of Southeast extraction, were said to have been attacked by thugs when they wanted to register and get their voter cards in the Ojo area of Lagos.\n“That action by the APC in Lagos is part of its desperate design to use violence to sabotage free, fair and credible elections in 2023 having realized that Nigerians have rejected its Presidential Candidate, Asiwaju Bola Ahmed Tinubu ahead of the polls.\n“The APC has again become chaotic and desperate because Nigerians have recognized it as what it is; a Special Purpose Vehicle which was hurriedly put together to defraud the nation.\n“Our Party cautions Asiwaju and the APC to thread carefully and rein in their thugs, hoodlums and terrorists as they will be firmly resisted by Nigerians.”"
  },
  {
    "headline": "Osun Guber: PDP Group Constitutes Youth, Women Campaign Council",
    "summarized_story": "A political support group, PDP New Generation, has constituted a 120-member Youth and Women Gubernatorial Campaign Council (YWGCC) for the July 16 governorship election in Osun State.\n“YWGCC is to work extensively in collaboration with the existing PDP structure in Osun State to support and contribute to the victory of PDP Osun State gubernatorial candidate, Sen. Ademola Adeleke, his running mate Prince Kola Adewusi and the PDP at large.\n“The appointment is with effect from 13th June, to last through the campaign period and terminate on 16th July, 2022.\n“As we look forward to victory, on behalf of thousands of members of PDP New Generation, I congratulate you all on the appointment and task ahead.\n“The PDP New Generation will continue to push hard in achieving its goal of promoting youth and women participation and inclusion in PDP affairs at all levels,” Mahmood stated."
  },
  {
    "headline": "Osun Guber: PDP Group Constitutes Youth, Women Campaign Council",
    "summarized_story": "A political support group, PDP New Generation, has constituted a 120-member Youth and Women Gubernatorial Campaign Council (YWGCC) for the July 16 governorship election in Osun State.\n“YWGCC is to work extensively in collaboration with the existing PDP structure in Osun State to support and contribute to the victory of PDP Osun State gubernatorial candidate, Sen. Ademola Adeleke, his running mate Prince Kola Adewusi and the PDP at large.\n“The appointment is with effect from 13th June, to last through the campaign period and terminate on 16th July, 2022.\n“As we look forward to victory, on behalf of thousands of members of PDP New Generation, I congratulate you all on the appointment and task ahead.\n“The PDP New Generation will continue to push hard in achieving its goal of promoting youth and women participation and inclusion in PDP affairs at all levels,” Mahmood stated."
  },
  {
    "headline": "JUST-IN: 11 Abducted Train Passengers Regain Freedom",
    "summarized_story": "Eleven of the kidnapped passengers of the Abuja-Kaduna Train have been released by their abductors on Saturday.\nOne of the lead negotiators for their release, Malam Tukur Mamu, told LEADERSHIP that the 11 passengers were released after series of negotiations approved by the Federal Government of Nigeria.\nRecall that dare-devil armed men attacked the Abuja-Kaduna train on the night of Monday, March 28, 2022, killing about nine passengers and security men on the spot while kidnapping scores of others.\nAccording to him, those released included Jessy John, Amina Ba’aba Mohammed (Gamba), Rashida Yusuf Busari, Hannah Ajewole and Amina Jibril.\nHe told LEADERSHIP that the kidnap victims have arrived Abuja on Saturday and were receiving medical attention at an undisclosed military facility."
  },
  {
    "headline": "JUST-IN: 11 Abducted Train Passengers Regain Freedom",
    "summarized_story": "Eleven of the kidnapped passengers of the Abuja-Kaduna Train have been released by their abductors on Saturday.\nOne of the lead negotiators for their release, Malam Tukur Mamu, told LEADERSHIP that the 11 passengers were released after series of negotiations approved by the Federal Government of Nigeria.\nRecall that dare-devil armed men attacked the Abuja-Kaduna train on the night of Monday, March 28, 2022, killing about nine passengers and security men on the spot while kidnapping scores of others.\nAccording to him, those released included Jessy John, Amina Ba’aba Mohammed (Gamba), Rashida Yusuf Busari, Hannah Ajewole and Amina Jibril.\nHe told LEADERSHIP that the kidnap victims have arrived Abuja on Saturday and were receiving medical attention at an undisclosed military facility."
  },
  {
    "headline": "Don’t Abandon Nigeria To Those Messing It Up, Obasanjo Tells Youths",
    "summarized_story": "Speaking at the event tagged, ‘OBJ @85 Free Keke Programme’, Chief Obasanjo charged the Nigerian youths not to abandon the country for those messing it up, but brace up and make necessary contributions towards addressing the plethora of challenges confronting the nation.\nHe emphasised that If the youths leave things to those who are messing it up, and who are saying they (youths) are the leaders of tomorrow, they will never have that tomorrow.\n“The first thing we want to prove is that there are opportunities galore in this country.\nHe charged the youths that it is not the opportunities that was given to them that matter, but what use to put the opportunities into.\nKolapo also warned them against corruption and greed, saying it would be difficult to fight those menaces if they are culprit."
  },
  {
    "headline": "BREAKING: Terrorists Release 11 Kidnapped Train Passengers",
    "summarized_story": "The terrorists freed 11 kidnapped train passengers on Saturday after intense discussions between the FG and the terrorists, according to Malam Tukur Mamu, Sheikh Ahmad Gumi’s communications consultant.\nAccording to him, the 11 victims who were released were transported to Abuja on President Buhari’s orders for medical evaluation and treatment before being reunited with their bereaved relatives.\nSome retired Army Generals and a well-known academic, he claims, also assisted in the passengers’ release.\nDetails later…"
  },
  {
    "headline": "Alleged N2bn Fraud: Pastor, Wife Sue As EFCC Declares Them Wanted",
    "summarized_story": "Pastor Oyinmiebi Bribena, the President of Baraza Multipurpose Cooperative Society Limited (BMCSL), and his wife, Beatrice, say that the Economic and Financial Crimes Commission (EFCC) never invited them for questioning or interrogation before declaring them wanted.\nThe EFCC’s Head of Media and Publicity, Wilson Uwujaren, issued a statement declaring the pair wanted for allegedly scamming Nigerians of N2 billion.\nHe had requested answers to some queries about the EFCC’s abilities to intervene in conflicts between cooperative society members, based on the terms of the Nigerian Cooperative Societies Act of 2004.\nReacting to the declaration, Bribena, who is also pastor in a popular church, stated: “We did not receive any invitation letter from the EFCC and were not aware of any summons or pending charge against us by the EFCC.\nBribena, who assured contributors that all hope was not lost, stated that he would not relent in the efforts being made to clear his name."
  },
  {
    "headline": "Sanwo-Olu has abandoned governance for Tinubu’s campaign -Adegboruwa",
    "summarized_story": "Adegboruwa, who was one of the members of the Lagos State Judicial Panel of Inquiry on Restitution for Victims of SARS-Related Abuses, warned the governor on spending the state’s resources on Tinubu’s campaign.\n“Since the declaration of the presidential aspiration of Asiwaju Bola Ahmed Tinubu, Governor Babajide Sanwoolu has abandoned governance in Lagos State.\nNine aspirants had earlier stepped down, eight of whom asked their supporters to vote for Tinubu, while one asked his supporters to vote for Osinbajo.\nThose who stepped down before voting began are Governor Abubakar Badaru of Jigawa, Robert Boroffice, Ken Nnamani, Ibikunle Amosun, Dimeji Bankole, Ekiti State Governor Kayode Fayemi and Godswill Akpabio.\nPastor Felix Nicholas, the United States of America-based aspirant also stepped down and asked his supporters to vote for Osinbajo."
  },
  {
    "headline": "BREAKING: Tinubu, Yahaha Bello in closed-door meeting",
    "summarized_story": "The presidential candidate of the All Progressives Congress and former Governor of Lagos State, Asiwaju Bola Tinubu, is currently in a closed-door meeting with Governor Yahaya Bello of Kogi State, in what political observers said was part of reconciliatory moves to pacify aggrieved aspirants of the APC presidential ticket.\nTinubu was accompanied to the meeting on Friday by Governors Babajide Sanwo-Olu (Lagos); Bello Matawalle (Zamfara); and Abdullahi Ganduje (Kano).\nA former governor of Edo State and former national chairman of the APC, Adams Oshiomhole, is also in the entourage.\nIt was, however, not clear if the issue of Tinubu’s running mate would be part of the agenda.\nNews Direct learnt that they would brief the press on the outcome of the meeting."
  },
  {
    "headline": "Terrorists release 11 kidnapped Abuja-Kaduna train passengers *See full names",
    "summarized_story": "After many weeks, terrorists have released 11 out of 61 kidnapped passengers on Abuja-Kaduna train.\nThe attack on the train happened on March 28, 2022.\nAmong those who regained their freedom are six females and five males who have now been flown to the nation’s capital, Abuja.\nThey are Jessy John, Amina Ba’aba Mohammed (Gamba), Rashida Yusuf Busari and Hannah Ajewole.\nHe further explained that the 11 victims were freed on health grounds in order to enable them undergo urgent medical treatment."
  },
  {
    "headline": "2023: INEC breaks silence on extension of continuous voter registration",
    "summarized_story": "The Chairman Independent National Electoral Commission (INEC), Prof. Mahmood Yakubu, Saturday, said the commission would soon make its stand known on calls for extension of June 30 deadline for the Continuous Voter Registration (CVR).\nYakubu disclosed this while addressing youths in Lagos State at a Mega Musical Concert on ‘Youth Vote Count’, organised by INEC in collaboration with some partners to awaken youth consciousness toward participating in politics and governance.\nThe exercise started on Monday with the deployment of 50 INEC Voter Enrolment Devices (IVED) to capture youths in the CVR, culminated in the concert which featured several youth-inspiring musicians, comedians and celebrities.\n“I know you want to hear from INEC if we are ending the registration on June 30.\n“You want to hear from INEC if you register and vote: will your vote count?"
  },
  {
    "headline": "Pictures: In Borno community, Zulum resettles 2,500 families with N120m, food items",
    "summarized_story": "Borno state governor, Professor Babagana Umara Zulum, on Saturday traveled to Kirawa, a border community in Gwoza Local Government Area (LGA) to supervise the resettlement of 2,500 displaced families into their homes which were rebuilt by the state government.\nGovernor Zulum set up a committee with the task of rebuilding destroyed homes in Kirawa and to safely return on voluntary and dignified terms.\nZulum during his trip for the resettlement, not only ensured return to rebuilt homes but also supervised the distribution of N120 million to the 2,500 families.\nAdditionally, all the 2,500 households each received food items comprising a bag of rice, a bag of maize grill and a wrapper each for female returnees.\nThe governor who returned to Maiduguri by evening, traveled in company of chairman of Kirawa resettlement committee, Engr."
  },
  {
    "headline": "FIRS Pledges Collaboration with KW-IRS on Improved Revenue Generation",
    "summarized_story": "By Kayode AbdulazeezFederal Inland Revenue Service (FIRS) has pledged to collaborate with the Kwara State Internal Revenue Service (KW-IRS) to improve revenue generation in the state.\nThe FIRS official also said that the courtesy visit was aimed at strengthening the long-standing institutional relationship between FIRS and KW-IRS.\nAdama, who applauded the data-sharing liaison between both revenue agencies, pledged continual collaboration in ensuring eligible taxpayers in the State are adequately and appropriately captured into the tax net.\nThe team also discussed several areas of interest and concerns as they relate to revenue enhancement for Kwara State.\nAlso speaking, the Executive Chairman, KW-IRS, Shade Omoniyi, commended FIRS for the support towards achieving seamless tax administration."
  },
  {
    "headline": "NBC Celebrates DG Ilelah as he marks one year in office",
    "summarized_story": "By Friday ObandeAs he marks one year in office, the Management and Staff of National Broadcasting Commission, have felicitated with Director General of the commission, Mallam Balarabe Shehu Ilelah.\nIn a congratulatory message by the commission’s management, it said Ilelah, has on assumption in office, brought his wealth of experience into the running of the NBC.\nAlso, in the course of carrying out the commission’s regulatory functions, the management noted that the DG has continued to stress on professionalism on the part of broadcasters.\nThe Director General implored Broadcasters to engender the unity, peace and progress of our dear country,” they added.\nIlelah, a veteran international broadcaster, was appointed DG of the commission on June 7, 2021 by President Muhamadu Buhari."
  },
  {
    "headline": "Jos Disco urges BIRS to unseal office",
    "summarized_story": "By Sunday Ogli, MakurdiManagement of Jos Electricity Distribution, JED, Plc, has called on the Management of BIRS to swap its tax liability by deducting it from the state government’s indebtedness to the company.\nBenue State Government is indebted to Jos Disco as at 31st December, 2021 to the tune of ₦157,943,414.14 million while Jos Disco owes state’s tax agency; BIRS ₦156,515,414.47 million.\nHowever, BIRS, as a result of the debt, sealed off the operational office of Jos Disco in Gboko and Makurdi on Wednesday.\n“This could be gleaned from several correspondences and meetings to this effect”, the press release stated.\nDr Elijah further disclosed that to resolve the impasse, the two bodies had mandated their tax consultants to ascertain the true situation of things."
  },
  {
    "headline": "NACC urges Nigerian exporters to take advantage of AGOA",
    "summarized_story": "Nigerian American Chamber of Commerce (NACC) Abuja Chapter has called on all Shippers to take advantage of the window provided by the African Growth and Opportunity Act (AGOA) Programme to boost trade between Nigeria and the United States of AmericaThe Executive Secretary of NACC Abuja Chapter, Mr. Ayo Salaam disclosed that Nigerian companies have not taken advantage of the AGOA because they export mainly oil to the United States.\nThe AGOA forum is one of the key components of U.S African strategy that focuses on increasing the United States Trade and Investment in Africa as a mechanism for job creation within the continent.\n“The AGOA project initiated by the United States of America in 2000 was to help develop trade and facilitate exporting over 6000 goods into America with no tariff.\nSpeaking at the event, a diplomat, Ambassador Bayo Idowu, encouraged all shippers to leverage on the AGOA partnership.\n“We are readily available to provide assistance and advice on how Nigerian products can be accepted in the American market."
  },
  {
    "headline": "NDE uplifts 630 Anambra youths on vocational skills",
    "summarized_story": "Tony Oraeki, AwkaThe National Directorate of Employment, NDE, has commenced the training of 630 unemployed youths in Anambra state on various vocational skills.\nThe training would be on two categories which are Basic National Open Apprenticeship Scheme, B-NOAS, and Advanced National Open Apprenticeship Scheme, A-NOAS, with 420 and 210 beneficiaries respectively.\nAddressing the beneficiaries at the orientation ceremony in Awka yesterday, the NDE State Coordinator, Mrs. Chika Ufelle said that B-NOAS is a scheme through which the unemployed youths both male and female are recruited to acquire marketable vocational skills for decent job opportunities.\nShe also said the trainees under A-NOAS are designed for artisans who graduated from B-NOAS with an aim to upgrade their skills to higher levels of competence.\n” I very much appreciate the effort of NDE to avail me this opportunity to be trained in Computer Appreciation.” She said."
  },
  {
    "headline": "Abuja-Kaduna Train Attack: Eleven Kidnap Victims Regain Freedom",
    "summarized_story": "Eleven out of the 61 persons kidnapped following the March 28 Abuja-Kaduna train attack have regained their freedom.\nAmong those who regained their freedom are six females and five males who have now been flown to the nation’s capital, Abuja.\nRead Also: [Train Attack] Relatives Cry Out As Terrorists Threaten To Kill Victims In Seven DaysHe said the victims were released on Saturday afternoon at a forest, and have been flown to Abuja, the nation’s capital.\nHe further explained that the 11 victims were freed on health grounds in order to enable them undergo urgent medical treatment.\nAccording to Mamu, their names are Jessy John, Amina Ba’aba Mohammed (Gamba), Rashida Yusuf Busari and Hannah Ajewole."
  },
  {
    "headline": "INEC Mulling Extension Of Voter Registration – Prof Mahmood",
    "summarized_story": "The Independent National Electoral Commission (INEC) says the body is considering extending the continuous voter registration exercise.\nYou will soon hear from us on the extension of CVR registration,” the chairman of the agency, Prof. Mahmood Yakubu, said in a tweet on its official handle.\nProf. Mahmood Yakubu#YouthVoteCountNG @YIAGA @EUinNigeria pic.twitter.com/N63HNX9CJj — INEC Nigeria (@inecnigeria) June 11, 2022READ ALSO: INEC Records ‘Unprecedented Surge’ In PVC Registration, To Deploy More MachinesINEC Deploys More MachinesHis comments followed calls from several quarters for the body to extend the registration scheduled to end on June 30.\nOn Friday, the Nigeria Civil Society Situation Room (Situation Room), a coalition of Civil Society Organisations, called on the electoral body to extend the deadline.\n“There have also been several appeals by Nigerians to INEC to extend the registration exercise to enable them to register to obtain a PVC."
  },
  {
    "headline": "Democracy Day: President Buhari To Address Nigerians On Sunday",
    "summarized_story": "President Muhammadu Buhari will address the nation via a live broadcast at 7:00 am on Sunday.\nMinister of Information, Lai Mohammed, disclosed this during a morning briefing at a radio house in Abuja where he detailed activities to mark this year’s Democracy Day celebration.\nHe said the broadcast will be centred on the celebration of Democracy Day on Sunday, June 12th, 2022.\nThere will also be a Democracy Day parade at the Eagle Square in Abuja on Monday morning.\nThe minister, did not, however, say if Monday will be declared a public holiday as this year’s Democracy Day falls on a Sunday."
  },
  {
    "headline": "Owo Attack: FG’s Conclusion On ISWAP ‘Too Hasty’ – Akeredolu",
    "summarized_story": "Governor Rotimi Akeredolu of Ondo State says the Federal Government was “hasty” in blaming the Islamic State’s West African Province (ISWAP) for the Owo church attack.\nThe governor said this in a statement issued by his Chief Press Secretary, Richard Olatunde, on Friday.\nISWAP don’t hide their attacks,” the governor was quoted as saying during a virtual interaction with a Swiss-based Christian human rights Organisation, Christian Solidarity International (CSI) on Friday.\nWe are yet to know their identity and our security people are still on their trail.”RELATEDInsecurity: Gunmen Kill Four Persons In OndoISWAP Behind Owo Church Attack – National Security CouncilOwo Attack: Death Toll Rises To 40, Hospitals Discharge 26Owo Church Attack: Police Recover Three Unexploded IEDsAkeredolu, who described the attack that led to scores of death and several injuries, said the incident is a crime against humanity.\nHe said the attack, though horrific, will not deter the indomitable spirit of the people of the state in their quest to fight insecurity."
  },
  {
    "headline": "Battling Hungary Hold Germany To Latest Nations League Draw",
    "summarized_story": "Germany had to settle for their third Nations League 1-1 draw in a row after battling Hungary held their illustrious visitors in a Group A3 tie in Budapest on Saturday.\n“Of course, we are disappointed, but you have to say that Hungary is an unpleasant team to play against,” Germany captain Manuel Neuer told broadcaster RTL.\nMarco Rossi’s side also drew with Germany last June in the Euro 2020 group stages, and from the outset attacked with intent.\nI’m very disappointed, because of that one missed chance,” Hofmann told RTL.\nAlso on Tuesday Hungary, who remain in second place in Group A3 behind leaders Italy with four points, visit last-placed England in Wolverhampton."
  },
  {
    "headline": "Tinubu visits Lawan, Okorocha, Nnamani, Jack Rich, seeks collaborations -",
    "summarized_story": "Presidential candidate of the All Progressives Congress, Asiwaju Bola Tinubu has visited more aspirants of the party’s primary that produced him as the flagbearer.\nThe former governor of Lagos continued the consultation as he visited Senate President, Ahmed Lawan, former Governor of Imo State, Rochas Okorocha, former Senate President Ken Nnamani and Jack Rich.\nHe said the visit is to seek collaborations from the aspirants in the interest of building the party and the nation.\nAll the aspirants visited promised to support Asiwaju tinubu to ensure victory for the party in the 2023 elections."
  },
  {
    "headline": "Two shot, one feared killed as APC, SDP supporters clash in Ekiti -",
    "summarized_story": "At least two persons have been reportedly shot on Saturday in Itaji Ekiti, Oye local Government area of Ekiti state during a Political rally ahead of the June 18 Governorship ElectionAccording to an eye-witness, trouble started when suspected Political thugs attacked the campaign train of the Governorship candidate of the Social democratic party, Segun Oni, even though it is not yet clear what transpired before the altercationsA chieftain of the Social Democratic party, Bimbo Daramola who was on the campaign train of the SDP Candidate, accused certain interest groups in the state of interfering in a Peaceful campaign by opening Fire on SupportersReacting, the Governorship candidate of the APC, Biodun Oyebanji ,condemned violence in all forms and appealed to his supporters to exercise refrain in the face of Provocation.\nThe Police Public Relations officer in Ekiti State Sunday Abutu confirmed the incidence of violence however could not confirm if anyone was killed at the time of Filing this report and Says normalcy has since returned to the area."
  },
  {
    "headline": "Democracy Day: Nigeria on pathway to greatness, says Lagos Speaker -",
    "summarized_story": "The Speaker of the Lagos State House of Assembly, Mudashiru Obasa, has described Nigeria as a country currently on a track to greatness just as he urged the citizens to play active roles for this to be fully achieved.\nDr. Obasa said this in a statement at the weekend to commemorate Nigeria’s Democracy Day which coincides with the 29th anniversary of the June 12, 1993 elections claimed to have been won by the late Chief Moshood Abiola.\nAccording to the Speaker, Nigeria had, since 1999, experienced what could best be described as the teething stage of its democratic journey with the need for unity taking the centre-stage of public discourse.\n“History will forever be kind to those who made Nigeria’s democracy possible.\n“We are honoured to be the current bearers of the baton of democracy and we look forward to upholding the labour of these heroes.”"
  },
  {
    "headline": "Bahari names Uzodinma, others Council members of e-Government -",
    "summarized_story": "President Muhammadu Buhari has appointed the Imo State Governor, Senator Hope Uzodinma into the presidential Council on E-Government and Digital Economy.\nSenator Uzodinma along with 26 other Nigerians will henceforth fashion out ways in which digital technologies will be employed to transform every sector of the country’s economy.\nAt the inauguration of the Council, President Buhari said the choice of Governor Uzodinma and others was arrived at after “a painstaking and thorough process.”He told Senator Uzodinma to ensure that he works hard to justify the confidence the nation has reposed on him.\nHe said the Imo State Governor will be working alongside five other governors, ministers and members of the private sector to realize the federal government’s goals in E-Government and Digital Economy.\nHe tasked Uzodinma and the other members to consider their appointment as a national assignment that requires utmost dedication."
  },
  {
    "headline": "Kaduna Train Attack: After 75 Days in Captivity, 11 Abductees Freed, 51 Still Held",
    "summarized_story": "Eleven of the 62 passengers abducted in the March 28 attack on the Abuja- Kaduna train, have been released.\nTukur Mamud, a media consultant to Kaduna-based Islam cleric, Sheikh Ahmad Gumi, confirmed their release in a telephone chat on Saturday in Kaduna.\nHe was quoted in the Desert Herald newspaper as saying, “behind the scene, Sheikh Gumi by Allah’s will, made it possible.\nWhen contacted, chairman of relations of the abducted victims, Dr. Abdulfatai Jimoh, said he just read the report and was expecting official confirmation from the government.\nOne of the abducted victims was released few days after a ransom of N100 million was paid."
  },
  {
    "headline": "Covid: US Drops Covid Testing for Incoming International Air Travellers",
    "summarized_story": "ET (0400 GMT) Sunday, saying it is “not currently necessary.”The requirement had been one of the last major U.S. COVID-19 travel requirements.\nThe United States has required incoming international air travelers to provide pre-departure negative tests since January 2021.\nThe CDC is still requiring most non-U.S. citizens to be vaccinated against COVID to travel to the United States.\nTwo officials told Reuters the Biden administration had considered lifting the testing rule only for vaccinated travelers.\nThe CDC continues to recommend travelers wear masks and get COVID-19 tests before and after international flights."
  },
  {
    "headline": "Obasanjo Tells Youth Not to Leave Nigeria to ‘Those Messing It Up’",
    "summarized_story": "The tricycles were donated through the Youth Development Centre of the Olusegun Obasanjo Presidential Library (OOPL) with beneficiaries drawn from the 36 states and the Federal Capital Territory (FCT), Abuja.\nIn his remarks, Obasanjo said despite many challenges confronting Nigeria, there are “opportunities galore” and asked the younger generation to take advantage of them.\nHe also charged them to roll up their sleeves and make necessary contributions towards addressing challenges of the nation.\nAccording to him, If the youth leave things to those who are messing it up, and who are saying they are the leaders of tomorrow, they will never have that tomorrow.\n“If you leave things to those who are messing it up for you and who are saying you are the leaders of tomorrow, you will never have that tomorrow."
  },
  {
    "headline": "Tens of Thousands Rally for Stricter US Gun Laws",
    "summarized_story": "Thousands of protesters are gathering across the US to call for stricter gun laws in the wake of last month’s mass shooting in Texas.\nGun safety group March For Our Lives – founded by survivors of the 2018 Parkland school shooting – said some 450 rallies were planned for Saturday.\nUS President Joe Biden backed the protests, calling on Congress to “pass common sense gun safety legislation”.\nOrganisers say it was the largest gun safety rally in one day in US history, and thousands of students across the country left their classrooms to join the demonstrations.\n“Today, young people around the country once again march with @AMarch4OurLives to call on Congress to pass common sense gun safety legislation, supported by the majority of Americans and gun owners,” he tweeted."
  },
  {
    "headline": "Russia Hands out Passports in Occupied Ukraine Cities",
    "summarized_story": "The Russian occupation authorities in southern Ukraine say they have started handing out Russian passports to locals in two cities – Kherson and Melitopol.\nRussia’s Tass news agency says the first 23 Kherson residents got Russian passports at a ceremony on Saturday.\nUkraine now fears the same process is under way in areas seized by Russian forces in the current invasion.\nMelitopol is in the south-eastern Zaporizhzhia region, most of which is now held by Russian forces, including Europe’s biggest nuclear power station.\nRussia is resorting to heavy anti-ship missiles in ground attacks against Ukraine, which are highly inaccurate, UK military analysts say."
  }
]