[
  {
    "headline": "Police destroy illegal detention facility over missing Rivers schoolboy",
    "summarized_story": "The police have raided and destroyed an illegal detention facility operated by a disbanded vigilance group in Elele in the Ikwerre Local Government Area of Rivers State.\nThe boy, Chibuike Victor, a student of Jesus the Saviour Secondary School, Elele allegedly went missing while in the detention of OSPAC.\nThe voice in the video said, “This young man is missing and may have been killed.\n“He is 17-year-old Chibuike Nwokedi, an SS1 student of Jesus Our International Secondary School, Elele in Rivers State.\nWe released some inmates who they kept in their detention facility and destroyed their camp."
  },
  {
    "headline": "N’Assembly gets 54 bills for new varsities, others",
    "summarized_story": "Sunday PUNCH’s investigation has revealed that about 54 bills were proposed in three months by the members of the House of Representatives for the establishment of tertiary institutions across the country.\nReps ignore speakerHowever, a tally conducted by our correspondent on Saturday revealed members had presented about 54 bills for the establishment of new institutions comprising universities, polytechnics and Colleges of Education between June and September 2021.\nThere are currently 170 universities in Nigeria comprising 79 private universities, 43 federal universities and 48 state-owned universities.\nMeanwhile, the National President of ASUP, Anderson Ezeibe, in an interview with Sunday PUNCH advised the Federal Government to channel resources into the existing institutions.\n“You can’t leave the existing institutions without development and say you want to establish new ones."
  },
  {
    "headline": "Phase Down, No Phase Out: Tough climate deal struck at COP26",
    "summarized_story": "Source: BBCA deal aimed at staving off dangerous climate change has been struck at the COP26 summit in Glasgow.\nThe Glasgow Climate Pact is the first ever climate deal to explicitly plan to reduce coal, the worst fossil fuel for greenhouse gases.\nThe deal also presses for more urgent emission cuts and promises more money for developing countries – to help them adapt to climate impacts.\nIndia’s climate minister Bhupender Yadav asked how developing countries could promise to phase out coal and fossil fuel subsidies when they “have still to deal with their development agendas and poverty eradication”.\nIn the end countries agreed to “phase down” rather than “phase out” coal, amid expressions of disappointment by some."
  },
  {
    "headline": "Nigerians dying, end insecurity now — CAN tells FG",
    "summarized_story": "The umbrella Christian body made the call on Saturday in a communique issued at the end of its 4th quarterly meeting in Abuja.\nDescribing the nation’s insecurity as highly unfortunate CAN note that the kidnapping of innocent citizens was fast becoming a daily occurrence in some States.\n“CAN challenges the Security Agencies to respond quickly to distress calls and protect the lives and properties of Nigerians.\n“On the need for prompt action by security agencies, CAN also wish to advise the Federal, States and Local Government Areas to immediately initiate an all-inclusive security dialogue with all stakeholders.\nA situation where Nigerians are subjected to intimidation abroad because of the negligence of the duty of the officials is very embarrassing."
  },
  {
    "headline": "GBV: Sexual harassment remains highly perpetrated in Kano — CITAD",
    "summarized_story": "By Bashir Bello, KANOCentre for Information Technology and Development, CITAD has said that sexual harassment ranks top among other Gender-Based Violence, GBV cases highly perpetrated in Kano State.\nAminu said a comparison of reports the centre received through the app in the months of September and October shows that sexual harassment remains a highly reported case.\nAccording to Aminu, “The cases highly reported is Sexual Harassment.\n“In September, a number of sexual harassment cases reported stands at 18 while in October, 8 cases were reported with 56% decline.\nFurthermore, Sexual Harassment still remains the case with the highest number of perpetrations."
  },
  {
    "headline": "Askira-Uba Attack: Zulum lauds military for resilience; empathizes over loss",
    "summarized_story": "Zulum said amid the loss of some officers and personnel, the military was able to mount heavy resistance and recorded gains which the state is proud of.\nI salute troops who mobilized to provide reinforcement.\nI salute the sacrifices of some officers and men we lost today and share the grieves of the immediate families and the Nigeria military.\n“We thank these fallen heroes for their supreme sacrifices to the Nigerian Nation.\nThe people of Borno will remain forever grateful to them and all fallen heroes, and will remain fully supported of gallant troops currently operating in front lines” Zulum said as quoted in the statement."
  },
  {
    "headline": "Building collapse: Don’t give your food to dogs – LASG tell engineers",
    "summarized_story": "The lecture was entitled “National Local Content Policies in the Construction Industry – Strategies for Optimal Deployment for Engineering Professionals”.\nShe gave insights on how local engineers could benefit from the National Local Content Policies.\nIt is time for the building professionals to know what the local content policy says.\nThe guest speaker, Mr Robbie Owivry, advised local engineers to upgrade their skills and grow capacities to qualify for opportunities created by the Local Content Policies.\nResponding, Lawal, the first NICE National Chairman and Fellow of the Nigerian Society of Engineers, shared experience and knowledge he gained abroad."
  },
  {
    "headline": "Nigerian correctional facilities need serious upgrade – Prison fellowship",
    "summarized_story": "A religious group known as Prison Fellowship Nigeria has called on the federal and state governments to upgrade the infrastructure at the various correctional facilities in the country and improve on the funding of the system in line with United Nations recommendations.\nIt said this would ensure that the facilities meet up with the necessary task of rehabilitation and reform inmates.\nAdelami explained that the poor state of facilities in most Nigerian prisons coupled with poor welfare had made many prisoners worst than they were before conviction.\nAlso the Executive Director, Prison Fellowship Nigeria, Mr. Benson Iwagu appealed to Nigerians to always show love and extend hands of fellowship to prisoners.\nEarlier, the chairman, Prison Fellowship Nigeria, Ekiti State Chapter, Deacon Gabriel Tope Daramola said the meeting was to brainstorm on their activities and reach concrete resolutions on how best to carry out the assignment of reforming prisoners."
  },
  {
    "headline": "S/East violence: Coalition urges Uzodinma to commence healing process in Imo",
    "summarized_story": "Members of various socio-cultural groups in the Owerri zone and sons and daughters under the aegis of Coalition for Owerri Reawakening on Saturday expressed concern over the killings of young men since the administration of Senator Hope Uzodinma in Imo State.\nThe summit was chaired by Maj. Gen. Collins R.U Ihekire.\nIt called on the government of Imo State to begin a healing process by halting the trend and reaching out to families of the victims.\nIt commended Hon.\nEmeka Ihedioha for making Owerri’s zone and indeed, Imo people proud during his seven months stay in office by addressing the myriads of administrative and infrastructural challenges head on, assuring him that history will not forget him."
  },
  {
    "headline": "How God used me to heal one of my ex-girlfriends’ son – Pastor Adeboye",
    "summarized_story": "Pastor E. A. Adeboye of the Redeemed Christian Church of God, RCCG, has revealed how God used him to heal the son of his ex-girlfriend who was born crippled.\n“But after some time she went her way and I went my way.\n“So when they arrived in Ilorin, I was lecturing in Ilorin and I was also pastoring our small church in Ilorin.\nSomeone told her that there is a pastor that God is performing miracles through him, take this child to him.\nI said I am the pastor and she said “You are the pastor?” I said yes!"
  },
  {
    "headline": "Pray for my staff of office to get to me – Delta monarch urges subjects",
    "summarized_story": "The Pere-Elect of Egrangbene Kingdom in Burutu Local Government Area of Delta State, Henry Ambakaderemo Okrikpa, today urged his subjects to pray for his staff of office to get to him from the State Government speedily.\nBut the Egrangbene Kingdom has come to stay.\nBenedict Ekpesa said none of the lawyers involved in the legal tussle want the matter prolonged any further.\nHe however expressed the belief that he still sees possibilities that the situation can be brought to a harmonious conclusion.\nOkoro and a cross-section of indigenes of Egrangbene Community."
  },
  {
    "headline": "Gov Ortom warns against politicizing insecurity, urges leaders to salvage Nigeria",
    "summarized_story": "Governor Samuel Ortom has urged leaders across Nigeria to close ranks to salvage the country from its challenges.\nThe Governor stated that leaders irrespective of political affiliation must put aside their differences for the unity and development of the country.\nThe Governor noted that posterity will judge all in the end for their roles in the affairs of the nation.\nGovernor Ortom tasked the couple on love, respect and trust for one another and also prayed to God to bless their union.\nMembers of the Benue State security and executive council among others also witnessed the wedding ceremony."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Interior firm marks five years anniversary with fanfare",
    "summarized_story": "Founder of Five28 Interiors, Funto Ibuoye has explained how the firm has distinguished itself as one of the few whose “service symbolises a towering symbol of class and an epitome of intuitiveness.”Ibuoye disclosed this at the brand’s fifth anniversary thanksgiving at Marriott Hotels in Lagos, adding clients who keep coming back and “tough” clients enable them to do better.\nRead Also: ‘My journey from accounting to design’She said the design studio is responsible for some of Nigeria’s most inspiring interiors with projects spanning ultra-luxury apartments to executive workspaces and hospitals across the country and beyond.\nShe added the brand based in its flagship studio in Ikeja, Lagos and founded in 2016 has grown to become an international figure in interior design.\n- Advertisement -Personalities who graced the event include Adenike Oyetunde, Senior Special Assistant to the Governor of Lagos State on Persons Living With Disability; Pastor Gideon Mba, President, Choice Souls Media; Morenike Molehin, Chief Executive Officer, Oak & Tea; Samuel Jegede, CEO, FruityLife; Olabisi Ola-Soetan, Founder, Secret Place Wives, among others."
  },
  {
    "headline": "Okon makes a bid for Diezani’s bra as Baba Lekki smells a rat",
    "summarized_story": "Still, we need to be very careful about this business of Diezani’s bra.\n“Oga, I wan quickly reach Abuja make man bid for dem Diezani bra.\nDem say if man dey smell dem, money go come out yafunyafun.\nAs I no get money like dem Yoruba boys who dey whack am, na good chance be dis one”, the mad boy snorted.\nNa Yoruba women dey carry rat inside dem bra”, the crazy boy snorted."
  },
  {
    "headline": "Nigeria lost brave men, Buhari mourns Brig. Gen, three soldiers",
    "summarized_story": "President Muhammadu Buhari has mourned the Commander of the Special Forces, Brigadier General Dzarma Zirkusu and three soldiers killed in a battle with terrorists in Askira Uba, Borno State on Saturday.\nIn a statement on Saturday night by his Senior Special Assistant on Media and Publicity, Mallam Garba Shehu, Buhari, who commended the bravery of the fallen soldiers, describing them as martyrs, noted that Nigeria had lost brave soldiers.\nRead Also: Army confirms insurgents killed senior officer, three soldiers“Nigeria has lost brave soldiers.\nGeneral Zirkusu leaves us sad and devastated.\n- Advertisement -“I pray to the Almighty to give you and the bereaved families the strength and courage to bear this irreparable loss,” the President added."
  },
  {
    "headline": "Brigadier General, 3 soldiers killed in shootout with terrorists",
    "summarized_story": "From Molly Kilete, AbujaThe Nigerian Army headquarters in Abuja has announced the death of a senior officer and three soldiers, who were killed in a shootout with Islamic State West Africa Province (ISWAP) fighters in Askira Uba Local Government Area of Borno State.\nThe deceased senior officer, identified as Brigadier General Dzarma Zirkusu, and his soldiers were said to have been killed while providing reinforcement in a counteroffensive against the terrorists, successfully defending the location.\nThe Director, Army Public Relations, Brigadier General Onyema, who made the announcement in a statement, said the soldiers supported by the Air Component of OPHK have destroyed five A-Jet, two A-29, two Dragon combat vehicles and nine gun trucks manned by the terrorists.\n‘Sadly, a gallant senior officer Brigadier General Dzarma Zirkusu and three soldiers paid the supreme sacrifice in a very rare display of gallantry as they provided reinforcement in a counteroffensive against the terrorists, and successfully defended the location.\n‘The family of the senior officer and soldiers have been contacted."
  },
  {
    "headline": "Fresh call for restructuring: Northern elders carpet Afenifere leader",
    "summarized_story": "By Vincent Kalu, Lagos, Noah Ebije, Kaduna and Sola Ojo, KadunaSome Northern leaders have criticized Chief Ayo Adebanjo, leader of Afenifere, over his recent press statement calling for the restructuring of the country.\n“Chief Ayo Adebanjo has the right to air his views on issues of national importance and use multiparty democracy to pursue his passion,” he said.\nEven in the South-West, Afenifere cannot be said to be speaking for all and this is the reality of things.\n“Ayo Adebanjo is a confused, bitter, frustrated, rambling and irrelevant old man at 93,” he said.\nHe said: “The electoral bill which has been passed by the National Assembly and waiting for president’s ascent is part of restructuring."
  },
  {
    "headline": "Police parade alleged killer of Vanguard journalist",
    "summarized_story": "From Molly Kilete, AbujaThe Nigeria Police in Abuja on Friday paraded an alleged hit-and-run driver, Itoro Clement, said to have been responsible for the death of the missing Vanguard journalist, Tordue, Salem.\nLate Salem, an indigene of Benue State, who was covering the House of Representatives, went missing on October 13, 2021.\nHowever late Thursday night, Vanguad newspapers where the deceased worked before his untimely death reported that his body had been found.\nConfirming the incident, Frank Mba, at a media briefing in Abuja, paraded the suspected killer driver, Itoro Clement, 29, before journalists.\nAt the briefing, Mba, told journalists that Clement was arrested following an investigation carried out by the Force Intelligence Bureau."
  },
  {
    "headline": "Pupils, students jubilate as Kalu distributes free educational materials in Abia North",
    "summarized_story": "From Okey Sampson, UmuahiaIt was jubilation galore by pupils, students and teachers of some schools in Umunneochi Local Government Area of Abia State, following the distribution of free educational materials by the senator representing Abia North, Dr. Orji Uzor Kalu.\nThe recipients and their parents could not hold back their joy over Kalu’s gesture as the event was flagged off at Lokpanta Secondary School, Umuchieze.\nFrom there, the team went to Eziama Model Secondary School, Lokpaukwu; Obinolu Secondary Technical School, Ngodo, and Isuochi Secondary School at Nkwoagu.\nThe pupils, students and their teachers thanked the senator for remembering them and for his quality representation.\nEducational materials distributed to the pupils and students include textbooks, writing materials, schoolbags and exercise books."
  },
  {
    "headline": "Stardom has deprived me of true love –Eva Chris",
    "summarized_story": "Endowed with impressive curves, single but talented actress, Eva Chris is out looking for true love.\nHear her: “Stardom has deprived me of true love.\n“I can’t put my relationship on social media because most girls are always bent on snatching people’s boyfriends.\nI also don’t like people advising me on how to handle my relationship, so I keep my private life off social media.\nEven if I get married today, people will not know because of the way marriages crash on social media is very worrisome."
  },
  {
    "headline": "Stripped of Influence, Govs Fight Back over Direct Primaries, Consider Court Action",
    "summarized_story": "But the lawmakers refused to back down; they went ahead to add mandatory direct primaries to the bill.\nMaking direct primaries mandatory is unconstitutional.\nHe further argued that direct primaries were too cumbersome, unwieldy and would overstretch the limited resources of INEC, statutorily mandated to oversee primaries conducted by political parties.\nHe said: “Direct primaries involve supervisory role by INEC.\nSo, if multiple political parties are doing their primaries, INEC resources will be overstretched, and I think the chairman of INEC had even commented on that.”The PDP leadership is also opposed to mandatory direct primaries."
  },
  {
    "headline": "U.S. Secretary of State, Blinken, Expected in Nigeria",
    "summarized_story": "Michael OlugbodeThe United States Secretary of State, Antony Blinken will arrive Nigeria next week on the second leg of his first official visit to Africa.\nAccording to a statement issued yesterday by the US Embassy, Abuja, titled, “Secretary Blinken’s travel to Kenya, Nigeria, and Senegal,” the top Joe Biden administration official will meet with Kenyan President, Uhuru Kenyatta and Cabinet Secretary for Foreign Affairs, Amb Raychelle Omamo.\n“The Secretary will advance US-Kenyan cooperation on ending COVID-19, improving clean energy access, and protecting the environment.\n“They are expected to discuss furthering cooperation on global health, security, expanding energy access and economic growth, and revitalising democracy,” said the US embassy.\n“Given President Sall’s upcoming African Union chairmanship, Secretary Blinken looks forward to discussing regional issues and shared values."
  },
  {
    "headline": "At UNESCO’s 75th Anniversary, Buhari Canvasses for Global Peace, Solidarity",
    "summarized_story": "*Says Nigerians competitive abroad due to good education acquired at homeDeji Elumoye in Paris, FrancePresident Muhammadu Buhari yesterday said despite mounting challenges facing nations, it was high time peace and solidarity “reign supreme” across the globe.\nHe said: “Our world is fast changing and so are the evolving challenges.\nThere is, therefore, no better time to canvass for solidarity for the enthronement of peace and development.\nBuhari said: “Seventy-five years of building together a more advanced, knowledgeable and prosperous world through education, science, culture, communication and information.\nThe President said this when he met with the Minister of State Foreign Affairs of the United Arab Emirates, Shaikh Shakboot Alnahyan, on the sidelines of the Paris Peace Forum."
  },
  {
    "headline": "Dogara: Nigerians Have Accepted Mass Killings as New Normal",
    "summarized_story": "*Declares country risks survival if people merely tolerate each otherCharles AjunwaA former Speaker of the House of Representatives, Yakubu Dogara has said Nigerians seem to have accepted mass killings in the country as the new normal.\nWe seem to have accepted killings and mass murder as our new normal and so many cold-blooded murders of our brothers and sisters no longer make the headlines in the media.\nThe latest MlCS data tells us that 69 per cent (9.1m) of out-of-school children in Nigeria are in northern states.\nWe now have a small percentage of highly educated Nigerian youths who are prepared to question everything including questioning the questions themselves.\n“It is a pity that many are calling for the disintegration of Nigeria; saying that Nigeria cannot work."
  },
  {
    "headline": "FG Set to Commence Sale of 5,000 Housing Units in 34 States",
    "summarized_story": "•Launches online application portal, promises fairnessEmmanuel Addeh in AbujaThe federal government yesterday officially launched an online platform for its National Housing Scheme (NHS), effectively preparing the ground for the sale of over 5,000 housing units in 34 states of the federation.\n“So first, what we did was to carry out a survey to know what kind of houses Nigerians want to live in and that helped us to formulate relevant policies for the project.\nHe added: “The least selling price for each of these houses will be N7.222 million, and the highest will be N16.19 million.\n“We introduced the online portal from which the national housing programme will be offered to members of the public.\nWhen an allocation is booked on the online portal, it will show that it is no longer available."
  },
  {
    "headline": "EXCLUSIVE: Photos, Identities Of Four Nigerian Soldiers Killed Alongside Army Commander, Brig Gen Zirkusu By ISWAP Terrorists",
    "summarized_story": "While he identified the slain senior officer as Dzarma Zirkusu, the army spokesperson was silent on the identities of the junior officers killed.\nSuspected fighters of ISWAP had engaged the troops at a military base in the Askira/Uba LGA in a gun battle.\nSome civilians had said they sighted the ISWAP fighters in a long convoy of gun trucks along Ngude axis towards Askira, early this morning.\n“Yes, ISWAP is currently attacking Askira town.\nThe troops were ambushed while on their way to provide support for the soldiers battling the insurgents."
  },
  {
    "headline": "EXCLUSIVE: Photos, Identities Of Four Nigerian Soldiers Killed Alongside Army Commander, Brig Gen Zirkusu By ISWAP Terrorists",
    "summarized_story": "While he identified the slain senior officer as Dzarma Zirkusu, the army spokesperson was silent on the identities of the junior officers killed.\nSuspected fighters of ISWAP had engaged the troops at a military base in the Askira/Uba LGA in a gun battle.\nSome civilians had said they sighted the ISWAP fighters in a long convoy of gun trucks along Ngude axis towards Askira, early this morning.\n“Yes, ISWAP is currently attacking Askira town.\nThe troops were ambushed while on their way to provide support for the soldiers battling the insurgents."
  },
  {
    "headline": "PHOTOS: Junketing President, Buhari Departs Paris For Durban, South Africa",
    "summarized_story": "President Muhammadu Buhari on Saturday left Paris, the French capital, for Durban, South Africa, for the official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nBuhari in endless junketing was pictured leaving the French capital with some of his aides and making his way to the 5N-FGW (Gulfstream Aerospace) aircraft.\nSaharaReporters had exclusively reported on Tuesday that Buhari would travel to South Africa, and his media, security and protocol teams had already left for the Southern African country on Thursday.\n“President Muhammadu Buhari will, Saturday, leave Paris for Durban, South Africa, at a special invitation by President Cyril Ramaphosa, to join other African leaders at the Official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\n“The theme of the Fair, Building Bridges for a Successful AfCFTA aims at boosting trade and investment across the African continent."
  },
  {
    "headline": "PHOTOS: Junketing President, Buhari Departs Paris For Durban, South Africa",
    "summarized_story": "President Muhammadu Buhari on Saturday left Paris, the French capital, for Durban, South Africa, for the official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nBuhari in endless junketing was pictured leaving the French capital with some of his aides and making his way to the 5N-FGW (Gulfstream Aerospace) aircraft.\nSaharaReporters had exclusively reported on Tuesday that Buhari would travel to South Africa, and his media, security and protocol teams had already left for the Southern African country on Thursday.\n“President Muhammadu Buhari will, Saturday, leave Paris for Durban, South Africa, at a special invitation by President Cyril Ramaphosa, to join other African leaders at the Official Opening Ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\n“The theme of the Fair, Building Bridges for a Successful AfCFTA aims at boosting trade and investment across the African continent."
  },
  {
    "headline": "2023: Nigeria Is Bruised, Only Igbo Presidency Can Heal It – Ohanaeze Tells Parties, APC, PDP",
    "summarized_story": "The apex Igbo socio-cultural body, Ohanaeze Ndigbo, has declared that Igbo presidency in 2023 would be the healing balm to the bruises and injuries Nigeria has sustained over the decades.\nThe youth wing of Ohanaeze said the two leading parties, the Peoples Democratic Party (PDP) and the All Progressives Congress (APC), should not deny South-Easterners of their presidential tickets.\nOhanaeze NdigboThe Ohanaeze Youth Council, OYC, said denying a southeastern aspirant the presidential ticket would inarguably deteriorate the condition of the country into a more pitiable state.\nThe statement read, “The only remedy is to collectively install Southeastern person as the next president of Nigeria.\n“The selfless effort of Southeastern technocrat and politicians in building PDP from G-34 , holding strong to it since 22-years is enough sacrifice to collectively relinquish PDP presidential to a southeast aspirant.”"
  },
  {
    "headline": "Yoruba Muslims and the fifth columnists",
    "summarized_story": "Since then, there has been an intense debate over allegations of pervasive discrimination against Yoruba Muslims by their Christian kith and kin.\nThere has been a sustained and not-so-subtle campaign in the last 10 or so years to sow seeds of discord among the Yoruba, to play Muslims against Christians and Christians against Muslims.\nIf not that there is an agenda being played out, how can the alleged refusal of Osibona, one Yoruba Christian (among millions of Yoruba Christians), to employ one Yoruba Muslim (among millions of Yoruba Muslims) be extrapolated to mean all or most Yoruba Muslims are rejected by all or most Yoruba Christians?\nYoruba Muslims alienated?\nI am not sure Yoruba Muslims themselves would like to be portrayed as victims and underdogs."
  },
  {
    "headline": "Yoruba Muslims and the fifth columnists",
    "summarized_story": "Since then, there has been an intense debate over allegations of pervasive discrimination against Yoruba Muslims by their Christian kith and kin.\nThere has been a sustained and not-so-subtle campaign in the last 10 or so years to sow seeds of discord among the Yoruba, to play Muslims against Christians and Christians against Muslims.\nIf not that there is an agenda being played out, how can the alleged refusal of Osibona, one Yoruba Christian (among millions of Yoruba Christians), to employ one Yoruba Muslim (among millions of Yoruba Muslims) be extrapolated to mean all or most Yoruba Muslims are rejected by all or most Yoruba Christians?\nYoruba Muslims alienated?\nI am not sure Yoruba Muslims themselves would like to be portrayed as victims and underdogs."
  },
  {
    "headline": "Obaseki: I won't leave PDP for another party -- no matter the pressure",
    "summarized_story": "Godwin Obaseki, the Edo state governor, says he has no plan to join another political party.\nAdvertisementObaseki left the All Progressives Congress (APC) for the Peoples Democratic Party (PDP) in the months leading to the 2020 governorship election in Edo state.\nHe said: “No matter the persuasion to join any political party, I will not.\nWe don’t need to join another political party to develop Edo state to become a home for all.\n“In the last five years, we have been in the foundation laying stage for the development of Edo state."
  },
  {
    "headline": "Obaseki: I won't leave PDP for another party -- no matter the pressure",
    "summarized_story": "Godwin Obaseki, the Edo state governor, says he has no plan to join another political party.\nAdvertisementObaseki left the All Progressives Congress (APC) for the Peoples Democratic Party (PDP) in the months leading to the 2020 governorship election in Edo state.\nHe said: “No matter the persuasion to join any political party, I will not.\nWe don’t need to join another political party to develop Edo state to become a home for all.\n“In the last five years, we have been in the foundation laying stage for the development of Edo state."
  },
  {
    "headline": "Glasgow climate pact sealed amid disappointment over coal compromise",
    "summarized_story": "Almost 200 countries have adopted a new climate pact in Glasgow, Scotland.\nAdvertisementNegotiators from the countries however expressed disappointment over the last-minute compromise on coal.\nAll 197 parties of the United Nations have signed up to the climate pact, despite the reservations.\nSharma said the decisions and action plans not actualised at COP26 will continue at COP27.\nThe sealing of the pact brings the two weeks UN climate talks in Glasgow to a close."
  },
  {
    "headline": "Where is Africa’s digital media landscape headed?",
    "summarized_story": "Digital media in Africa is growing fast: traditional media organisations are finding their way to the internet while digital-only media organisations are taking firm root.\nMore Africans are online, they are spending more time on the internet and relying more on digital media more than ever.\nHow can digital media in Africa create a profitable business model?\nWhile it is normal to get excited about the different innovative news products in the continent’s digital media landscape, Abiru explains that more media houses need to produce more information that helps people understand what is going on around them.\nShe believes African journalists can do amazing work, but their budget is way smaller than that of global publications."
  },
  {
    "headline": "Is Flutterwave’s acquisition of Disha a win for the creator economy?",
    "summarized_story": "Credit: Disha (Medium)The product was an instant hit and got considerable adoption among creators and gig workers.\nThe move by the payments giant, which earlier this year became a unicorn, is surprising as both companies operate in different spaces—Flutterwave in payments and Disha in the creator industry.\nDespite the acquisition, however, Disha will remain an independent company.\n“Before now, when users created a Disha page and linked to a Flutterwave payment link, they got taken off the Disha site.\nNow, with the acquisition, users can create and accept their payments, all in one place.”Flutterwave has always played in the creator space, having supported arts events like ArtX Lagos."
  },
  {
    "headline": "Exclusive: Meta’s VP MEA and Turkey on Facebook’s transition into the metaverse",
    "summarized_story": "Leading that work in Africa is Derya Matras, Vice President (VP), Middle East, Africa (MEA) and Turkey, Meta.\nPrior to her appointment as VP in August, Matras was the Managing Director for the MEA and Turkey region.\nIt’s the next evolution in a long line of social technologies, and it’s ushering in a new chapter for our company.\nWhy should Facebook build this?\nBut it’s important to reiterate that Meta is neither going to build, own, or run the metaverse on its own."
  },
  {
    "headline": "MFS Africa raises $100m to continue expanding its digital payments network",
    "summarized_story": "MFS Africa, Africa’s largest digital payments network, has raised a $100 million Series C funding, an investment divided into two commitments: $70 million for equity and $30 million for debt financing.\nThe announcement came a few weeks after the company extended its footprint into the Nigeria market by acquiring Baxi, one of Nigeria’s largest digital solutions and distribution companies, from Capricorn Digital.\nFounded by Dare Okoudjou in 2009, MFS connects more than 320 million mobile money wallets across over 35 African countries.\nThe company plans to use the new investment to hire more global talent, power its Governance, Risks and Compliance (GRC) functions, and ramp up its expansion efforts.\nWe are excited to join MFS Africa’s world-class management team on its mission and to support its growth journey.”Share this article"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Technext to host Coinference 2021: Africa’s biggest cryptocurrency gathering!",
    "summarized_story": "Share this article:Tech media organisation, Technext has announced its maiden event, Technext Coinference 2021.\nThe maiden event is billed to hold on Thursday, December 9, 2021, at the Pistis conference centre in Lagos.\nRegistered delegates will anticipate discussions on the impact of regulation on the crypto space.\nIt will also provide an exciting opportunity for crypto enthusiasts to meet other enthusiasts, develop ideas and positions for future gain.\nTechnext Website Technext.ng is the go-to site for Tech News, Reviews and Insightful Analysis in Nigeria."
  },
  {
    "headline": "Helium Health acquires Qatar’s Meddy in expansion play",
    "summarized_story": "Share this article:Nigerian healthtech startup, Helium Health has announced its acquisition of Meddy, a doctor booking platform in Qatar.\nAs part of the deal, Meddy’s CEO Haris Aghadi and COO Abed Alkarim Khattab will join Helium Health’s leadership team.\nHowever, Adegoke Olubusi, Helium Health’s CEO reveals that the cultural similarity of the two teams was key in the deal.\nFounded by Olubusi, Dimeji Sofowora, and Tito Ovia, Helium Health provides a suite of services for its healthcare clients.\nThis year, Helium Health has already expanded to Kenya."
  },
  {
    "headline": "Nigerian drones and smart glasses, Rabbit’s $11m pre-seed, MFS Africa’s $100m Series C, and Flutterwave’s Disha acquisition",
    "summarized_story": "AdvertisementLendable, a UK-based debt financing company, typically gives startups between $5 million and $10 million in debt financing.\nYou can read all about it here: How UK-based debt financing company, Lendable, is providing equity-free financing for African startups.\nMFS Africa raises $100m Series CDare Okoudjou (Founder and CEO, MFS Africa).\nSource: Reloadly blogPan-African cross-border payments gateway, MFS Africa, has closed a $100 million Series C round, comprising $70 million equity and $30 million debt.\nFounded in 2009, MFS Africa connects mobile money systems to banks and other financial institutions."
  },
  {
    "headline": "COP26: Countries reach climate deal, refuse support for world’s poorest",
    "summarized_story": "The phrase “phase down unabated coal,” was a compromise to accommodate India’s objection because the earlier draft had read to “phase out” coal.\nRead also: COP26: India in rumble over global climate targetBut the deal reached on Saturday failed in certain important areas.\nNegotiators could not agree to phase out fossil fuels with countries Australia, Russia and Saudi Arabia weakening the pledge.\n“But despite progress on future emissions reductions, COP26 failed those most impacted by the climate crisis now.\nThe EU and US refused to create a fund that the poorest countries could draw on for crisis response,” said International lead, Strategic, Communications, European Climate Foundation."
  },
  {
    "headline": "Naira gains in parallel market on rising dollar availability",
    "summarized_story": "Nigeria’s naira rebounded in the illegal market as the central bank boosted sales of dollars through commercial banks, according to traders.\nThe central bank didn’t reply immediately to phone calls and messages seeking comments.\nThe market is just seeing the impact of larger central bank dollar sales on the naira in the parallel market, said Samir Gadio, London-based head of Africa strategy at Standard Chartered Bank.\nAnd last month there had been calls on the central bank to adopt a market reflective exchange rate to improve foreign currency supply and stabilize the naira.\n“If the central bank continues to put framework and structure that will ensure liquidity, definitively we’ll see appreciation at the parallel market.”"
  },
  {
    "headline": "Wike accuses FG of ‘browbeating’ the judiciary ahead of 2023",
    "summarized_story": "Governor Nyesom Wike of Rivers State sees recent developments as pointers that the Federal Government might be cowing the judiciary ahead of 2023.\nWike alleged that the invasion of the residence of Justice of the Supreme Court, Mary Odili, was a precursor to the Federal Government’s likely tactic of browbeating the judiciary to a state of fear and conformity as the country enters the next political season.\nThe governor said the FG wants to continue to ride roughshod unchecked over the rule of law and the sanctity of the country’s electoral system, hence, the renewed attack on judicial officers.\nThe police in Abuja have paraded those they claimed were behind the invasion, but this may not have impressed Wike who had given a 48-hour ultimatum since last week.\nAccording to him, training sessions have been organized for manpower capacity development in mediation practices, infrastructure improved, and the magistracy practice laws and rules revisited for purposes of review."
  },
  {
    "headline": "Viral video: Edo govt condemns assault on elderly man, youths, vows to prosecute perpetrators with VAP law – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe attention of the Edo State Government has been drawn to a social media video in which some young men wielding machetes and cudgels were recorded assaulting an elderly man and some young people within the state.\nThe state government strongly condemns the reprehensible act and vows to bring the perpetrators to justice.\nPreliminary investigations reveal that the incident appeared to have occurred in Edo State, as the persons in the video spoke in a language indigenous to the state.\nWith its uncompromising commitment to maintaining law and order, the government frowns at all forms of violence and is particularly appalled with the contents of the video.\nOsaigbovo IyohaChief of Staff to the Edo State Governor..."
  },
  {
    "headline": "Alaghodaro 2021: Obaseki, Shaibu tee-off Governor’s Cup Golf tourney – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Governor, Mr. Godwin Obaseki and his deputy, Rt.\nPhilip Shaibu, at the weekend in Benin City, teed-off the Governor’s Cup Golf Tournament, which is part of activities lined up for the annual Alaghodaro Summit.\nSome of our guests play golf and even those that don’t play golf, stay around, spend the weekend and unwind after a very tough summit.\n“As you can see, golf is one of the sports that is closely followed globally.\nHe noted that when followed to the latter, the plan would help Edo become strong as a sub-national."
  },
  {
    "headline": "UROMI-UBIAJA ROAD WEARS NEW LOOK AFTER PALLIATIVE REPAIRS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAUTHORITIES of Esan South East Local Government Council, Edo State, have intervened to effect repairs on the deplorable Uromi-Ubiaja Road, though a federal road.\nWhen The SUNDAY OBSERVER visited the road, it observed council officials from the works department putting Hardcore (big stones) and Stone Base on the failed portions of of the road.\n“We know it’s a Trunk ‘A’ road, but the road is mostly used by people of Esan South East, and by transporters/travellers.\nSo within the available resources in the council, we decided against all odds, to rehabilitate the failed portions on this road.\nThe Director of Works, Esan South East Local Government, Engr."
  },
  {
    "headline": "I’ve no plans to switch parties, says Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said he has no plans to join another political party, reassuring that his party affiliation will not alter development plans for the state.\nObaseki, who spoke during a Banquet in Benin City, as part of activities for this year’s Alaghodaro Summit, said his government is committed to ensuring a progressive and prosperous Edo State where all citizens will live life to the fullest.\nThe governor said, “No matter the persuasion to join any political party, I will not.\nWe don’t need to join another political party to develop Edo State to become a home for all.\n“In the last five years, we have been in the foundation laying stage for the development of Edo State."
  },
  {
    "headline": "Firm verifying addresses using smartphones instead of utility bills launches in Nigeria",
    "summarized_story": "It’s an enormous problem, much wider than just financial services.\nThe point is, in markets where there are functional addressing systems, there is a national database of addresses which Google Maps can leverage.\nIt means as a user, you can put an address into Google Maps and very often navigate there.\nIn a market like Nigeria, where there isn’t a proper addressing system, Google Maps is much less reliable.\nTell us how the idea of smart addressing came about and why you chose Africa as the starting point?"
  },
  {
    "headline": "First Bank Reiterates Commitment to Youth Empowerment, Celebrates Youth Week",
    "summarized_story": "The Youth Week, themed “The Future is Now, Let’s Takeover” started on Monday, 8 November 2021.\nYouths in the food business will be allowed to submit their entries to the vendors at the Grill & Fest 2021.\nSpeaking on the Youth week celebration, Dr. Adesola Adeduntan, Chief Executive Officer of FirstBank said ‘’we remain committed to recognizing the enormous opportunities that can empower the Nigerian youth.\nTherefore, the Youth Week presents a unique platform to strengthen the Banks commitment to the younger population, who have become the powerhouse driving all facets of digitization and innovation in our world today’’.\nFor more information and participation in the Youth Week, kindly visit the bank’s verified social media platforms; Instagram: @firstbanknigeria, Facebook: First Bank of Nigeria Limited."
  },
  {
    "headline": "Terrorists retaliate military bombardment in Borno, kill Nigerian Army general, destroy telecom facilities",
    "summarized_story": "The attack on the Nigerian troops in Askira Uba, Mulai, Ngamdu and Buniyadi in the North-East at the weekend came hours after top commanders of ISWAP were killed in military airstrikes.\n“The ISWAP terrorists who invaded the Askira Uba town destroyed telecommunication masts with guns and other firearms in their possession, forcing residents to flee,” the source was quoted as saying.\n“A military commander was killed in an ambush while leading troops on reinforcement operation.\n“The Chief of Army Staff Lt Gen Faruk Yahaya deeply commiserates with the families and relations of the fallen heroes.\nHe has also directed that the troops continue in the ferrocious counter offensive and hot pursuit to eliminate the remnant of the fleeing terrorists.”"
  },
  {
    "headline": "Enugu govt promises support for woman whose husband killed son for ritual",
    "summarized_story": "Governor of Enugu State, Ifeanyi Ugwuanyi, has assured Mrs. Augustina Ifebuche Eze, whose seven-year-old son was allegedly killed by her husband, Chidi Onyishi, for money ritual that the state government will support her and her children.\nSpecial Adviser to the Governor on Information, Steve Oruruo who led a delegation from Ugwuanyi to commiserate with Mrs. Eze, said the state government will stand behind her family.\nEverything that needs to be done will be done by Enugu State Government to ensure that you find justice and overcome this challenge.\nSo he has sent us to come and commiserate with you and reassure you that you will not stand alone.\nGovernment will be with you and will give you support as we pray that God will give you stronger reason to find comfort."
  },
  {
    "headline": "Ebonyi PDP rejects ‘plan to auction state liaison offices in Abuja, Lagos, Enugu to Umahi family’",
    "summarized_story": "OBINNA EZUGWUThe Ebonyi State chapter of the People’s Democratic Party (PDP), has rejected what it described as a plan by the state government, working in connivance with the state house of assembly, to auction the state’s liaison offices in Abuja, Lagos, Enugu and Aba to the family of Governor David Umahi.\n“The attention of the People’s Democratic Party (PDP) in Ebonyi State has been drawn to the plan by the Ebonyi State Government in connivance with the House of Assembly to cede Ebonyi State liaison office buildings in Aba, Lagos, Abuja and Enugu to the Governor David Umahi’s family.\n“Why are the Ebonyi offices in Aba and Enugu auctioned outright?\nUmahi has concluded plans to acquire the property using cronies and which the leadership of the state assembly is aware of.\nWe wish also to remind the Ebonyi State House of Assembly that it’s not an appendage of the executive arm of the Ebonyi State Government, that they should at all times be doing the bidding of the executive without following due legislative process."
  },
  {
    "headline": "APC Chairmanship: I Have No Pact With PDP – Modu-Sheriff",
    "summarized_story": "A former Borno State governor Senator Ali Modu-Sheriff, has denied any pact with the opposition Peoples Democratic Party (PDP) in his desire to become the next national chairman of the ruling All Progressives Congress (APC).\nA leaked audio had allegedly linked him to a supposed deal with the PDP in his aspiration.\nHowever, the purported audio according to a statement signed by the Director General of the Senator Ali-Modu Sheriff Campaign Organisation, SASCO, Senator Victor Lar, claimed that some PDP National Executive Committee, NEC, members want Sheriff to emerge as the national chairman of the All Progressives Congress, APC.\n“I had told the public that the two term former Borno governor and current senator was hatching a plan to use the media to course mischief and disaffection between Sheriff, APC governors and national leadership of the APC.\n“The current senator is out to blackmail Ali-Modu Sheriff because of his 2023 vice presidential ambition and to gain political favour and the support of one of the presidential aspirants from the South."
  },
  {
    "headline": "APC Chairmanship: I Have No Pact With PDP – Modu-Sheriff",
    "summarized_story": "A former Borno State governor Senator Ali Modu-Sheriff, has denied any pact with the opposition Peoples Democratic Party (PDP) in his desire to become the next national chairman of the ruling All Progressives Congress (APC).\nA leaked audio had allegedly linked him to a supposed deal with the PDP in his aspiration.\nHowever, the purported audio according to a statement signed by the Director General of the Senator Ali-Modu Sheriff Campaign Organisation, SASCO, Senator Victor Lar, claimed that some PDP National Executive Committee, NEC, members want Sheriff to emerge as the national chairman of the All Progressives Congress, APC.\n“I had told the public that the two term former Borno governor and current senator was hatching a plan to use the media to course mischief and disaffection between Sheriff, APC governors and national leadership of the APC.\n“The current senator is out to blackmail Ali-Modu Sheriff because of his 2023 vice presidential ambition and to gain political favour and the support of one of the presidential aspirants from the South."
  },
  {
    "headline": "From Paris, Buhari Moves To South Africa For Intra African Trade Fair",
    "summarized_story": "President Muhammadu Buhari will this Saturday leave Paris for Durban, South Africa, at a special invitation by President Cyril Ramaphosa, to join other African leaders at the official opening ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nThe event, holding from November 15 to November 21, is being convened by the African Export-Import Bank (AFREXIM) in collaboration with the African Union Commission (AUC) and the African Continental Free Trade Area (AfCFTA) Secretariat.\nAccording to a statement by presidential spokesman, Femi Adesina, the theme of the Fair, ‘Building Bridges for a Successful AfCFTA’ aims at boosting trade and investment across the African continent.\nHe said global businesses including non-African international brands are expected to key into opportunities generated by the fair, thereby attracting for the continent trade and investment deals worth $40billion.\nADVERTISEMENTThe President will be accompanied on the trip by the Minister of Foreign Affairs, Geoffrey Onyeama, Minister of Industry, Trade and Investment, Otunba Niyi Adebayo, Director General, National Intelligence Agency, Amb."
  },
  {
    "headline": "From Paris, Buhari Moves To South Africa For Intra African Trade Fair",
    "summarized_story": "President Muhammadu Buhari will this Saturday leave Paris for Durban, South Africa, at a special invitation by President Cyril Ramaphosa, to join other African leaders at the official opening ceremony of the 2nd Intra-African Trade Fair (IATF) 2021 which takes place on Monday.\nThe event, holding from November 15 to November 21, is being convened by the African Export-Import Bank (AFREXIM) in collaboration with the African Union Commission (AUC) and the African Continental Free Trade Area (AfCFTA) Secretariat.\nAccording to a statement by presidential spokesman, Femi Adesina, the theme of the Fair, ‘Building Bridges for a Successful AfCFTA’ aims at boosting trade and investment across the African continent.\nHe said global businesses including non-African international brands are expected to key into opportunities generated by the fair, thereby attracting for the continent trade and investment deals worth $40billion.\nADVERTISEMENTThe President will be accompanied on the trip by the Minister of Foreign Affairs, Geoffrey Onyeama, Minister of Industry, Trade and Investment, Otunba Niyi Adebayo, Director General, National Intelligence Agency, Amb."
  },
  {
    "headline": "HYPPADEC To Sink Boreholes For Kwara Riverine Communities",
    "summarized_story": "Hydro-Electric Power Producing Areas Commission (HYPPADEC), on Saturday, announced plans to sink motorised and hand-pump boreholes in the riverine communities in Kwara State.\nThe commission said it will also train 980 Kwara youths in poultry and fish farming in one year.\nManaging Director of HYPPADEC, Alh Abubakar Yelwa, made these known inIlorin, the state capital during a meeting with stakeholders from HYPPADEC host communities in the state.\nYelwa said the provision of boreholes was imperative to check the prevalence of water borne diseases in the riverine communities.\nSo that in every six months we will be able to graduate 490 youthsfrom Kwara state that will be able to stand on their own,” Yelwa stated."
  },
  {
    "headline": "Tuface’s babymama, Pero demands N500m from Annie for alleged libel, defamation",
    "summarized_story": "Pero Adeniyi, baby mama to popular Nigerian singer, Innocent ‘2Baba’ Idibia, has demanded a sum of N500m from his wife Annie, over alleged defamation and libelous online publication.\nIn September, Annie took to Instagram to call out her husband for alleged infidelity involving Adeniyi.\nReferring to Annie’s post, Pero, via her lawyers, issued a letter to Annie, demanding for public apology and the sum of N500m for damages.\nPero claimed that she and 2baba has nothing but a “civil parental relationship” because they share three children together.\nThe claims are included in a letter signed by Pero’s lawyers, Okonjo, Odiawa, and Ebie Associates titled ‘Re: Malicious and Libelous Online Publication against Pero Adeniyi’."
  },
  {
    "headline": "Tuface’s babymama, Pero demands N500m from Annie for alleged libel, defamation",
    "summarized_story": "Pero Adeniyi, baby mama to popular Nigerian singer, Innocent ‘2Baba’ Idibia, has demanded a sum of N500m from his wife Annie, over alleged defamation and libelous online publication.\nIn September, Annie took to Instagram to call out her husband for alleged infidelity involving Adeniyi.\nReferring to Annie’s post, Pero, via her lawyers, issued a letter to Annie, demanding for public apology and the sum of N500m for damages.\nPero claimed that she and 2baba has nothing but a “civil parental relationship” because they share three children together.\nThe claims are included in a letter signed by Pero’s lawyers, Okonjo, Odiawa, and Ebie Associates titled ‘Re: Malicious and Libelous Online Publication against Pero Adeniyi’."
  },
  {
    "headline": "WCQ: Osimhen, Ahmed Musa score as Super Eagles beat Liberia 2-0",
    "summarized_story": "Nigeria beat Liberia 2-0 to remain top of the group with 12 points while Cape Verde came from a goal down to beat Central Africa Republic 2-1 to remain second with 10 points, two behind Nigeria.\nGroup CNigeria needed to win away to Liberia in Tangier to remain in contention and protect their place on top of the log.\nAnd they beat the fellow West Africans courtesy of a pair of penalties scored by Victor Osimhen and skipper Ahmed Musa.\nThey doubled the tally with virtually the last kick of the game, substitute Musa converted a penalty after Osimhen was pulled down by the keeper inside the box.\nHowever, Cape Verde came off the break a different side and it took them just six minutes to get back to level terms, Julio Tavares finding the back of the net."
  },
  {
    "headline": "WCQ: Osimhen, Ahmed Musa score as Super Eagles beat Liberia 2-0",
    "summarized_story": "Nigeria beat Liberia 2-0 to remain top of the group with 12 points while Cape Verde came from a goal down to beat Central Africa Republic 2-1 to remain second with 10 points, two behind Nigeria.\nGroup CNigeria needed to win away to Liberia in Tangier to remain in contention and protect their place on top of the log.\nAnd they beat the fellow West Africans courtesy of a pair of penalties scored by Victor Osimhen and skipper Ahmed Musa.\nThey doubled the tally with virtually the last kick of the game, substitute Musa converted a penalty after Osimhen was pulled down by the keeper inside the box.\nHowever, Cape Verde came off the break a different side and it took them just six minutes to get back to level terms, Julio Tavares finding the back of the net."
  },
  {
    "headline": "BREAKING: Islamic State, ISWAP Fighters Currently Attacking Nigerian Army Base, Borno Community",
    "summarized_story": "At a military post in Borno State’s Askira/Uba Local Government Area, suspected Islamic State of West Africa Province (ISWAP) fighters are now engaged in a gunfight with forces.\nEarly this morning, some locals stated they saw ISWAP fighters in a big convoy of gun trucks traveling along the Ngude axis towards Askira.\n“Yes, ISWAP is currently attacking Askira town.\n“My people told me that the insurgents came with about 16 gun trucks and there is confusion in the whole town now,” Engr.\nWe are outnumbered; we only have five gun trucks with us.” Yakubu said."
  },
  {
    "headline": "AGF Malami Forced Us To Convert $40 Million Recovered Loot At N305 Per Dollar — Keystone Bank",
    "summarized_story": "Mr Malami, who had determined that a total of $136,676,600.51 was to be paid to NNPC, ordered that 96 million be paid in dollars and 40 million in naira be paid.\n“Out of this entire amount, we paid $96 million in United States dollars and we paid the equivalent of $40 million in naira,” according to Lawal Ahmed.\nMr Ahmed, who is the Executive Director, North and Public Sector Directorate, Keystone Bank, also said that Mr Malami recommended the exchange rate at N305 to a dollar.\nThe final payments were made thereafter in tranches,” Mr Ahmed added.\nReacting, a member of the committee, Olanrewaju Edun, criticised Mr Malami for issuing such directives, suggesting that the AGF be subjected to questioning."
  },
  {
    "headline": "Why Armed Security Operatives, Military Men Stormed Lagos Airport – Nigerian Government",
    "summarized_story": "According to the Federal Airport Authority of Nigeria (FAAN), armed security personnel stormed the Murtala Muhammed Airport in Lagos State as part of a routine security operation.\nAccording to SaharaReporters, NAF personnel invaded the terminal building, fully armed, harassing travelers.\nThey came into the terminal building armed to the teeth, harassing passengers.\n“Their commander led them into the terminal building armed with assault rifles.\nHe alleged that the same Air Force personnel are responsible for recruiting touts from Oshodi to extort passengers at will."
  },
  {
    "headline": "Government Style Is Horrible, Taken Nigeria To Stone Age – Dele Momodu",
    "summarized_story": "Dele Momodu, a presidential contender in 2011, has revealed his reasons for criticizing President Muhammadu Buhari (retd).\nMomodu claimed in a post on his verified Facebook page that Buhari’s style of government is terrible and has caused Nigeria to regress.\nThe veteran journalist also stated how he got into politics despite not joining a political party.\nIn 2015, Momodu worked with Buhari under the All Progressives Congress party.\nHowever, Momodu made a case for the opposition Peoples Democratic Party, stating that the party is the solution to the country’s current challenges."
  },
  {
    "headline": "Breaking: Victor Osimhen, Ahmed Musa score as Super Eagles overpower Liberia in World Cup qualifier",
    "summarized_story": "Napoli striker Victor Osimhen and captain Ahmed Musa were on scoresheet as Nigeria’s Super Eagles beat Lone star of Liberia 2-0 in a World Cup qualifying match.\nThe game was decided in Tangier Morocco.\nSuper Eagles next match will be against Cape Verde that also won their encounter versus Central African Republic 2-1.\nDetails loading…"
  },
  {
    "headline": "LIVE: Ighalo dropped, Ekong captains as Rohr rolls out Super Eagles squad vs Liberia in World Cup qualifier",
    "summarized_story": "Odion Ighalo will not taste action when Super Eagles of Nigeria clash versus the Lone star of Liberia in faraway Morocco.\nDetails on the list is captured in the pictorial presentation above."
  },
  {
    "headline": "Pictures: Police dominate medal table as curtains fall on IGP Open Weightlifting Championship",
    "summarized_story": "Kogi state’s Elizabeth Ada Ayimba won gold in the 49kg women category while Uyai Aniefiok from Akwa Ibom Police Command won silver.\nIn the 55kg for women, Marvelous Ibe from FCT won gold; Olajimoke Oribamise from Ekiti State Police Command won silver while Glory Iheacho from Rivers State Police Command won bronze.\nThe gold medal in 76kg for women went to Chinonso Aniebunwa from Lagos State Command while another police lifter, Abibatu Yusuf, from Rivers State Command won the silver.\nLagos Command won gold in 81kg women category with Ifeanyi John who was the only lifter in that category.\n87kg women category gold went to Rivers State Command with Lilian Anaele whereas Ruth Galadima from Kebbi state Command won silver."
  },
  {
    "headline": "Climate Change: COP26 Deal Clinched As Nations Rally To Compromise",
    "summarized_story": "Rich countries stood accused of failing at the COP26 summit in Glasgow to deliver much-needed finance to vulnerable states that are at risk of drought, rising seas, fire and storms.\nAs the final deal was clinched, a tearful Sharma said “I apologise for the way this process has unfolded.\nSurvivalThe final text urged nations to accelerate efforts to “phase down” unfiltered coal and “phase out” inefficient fossil fuel subsidies.\nLarge emitters China and India had opposed the mention of the polluting fuels, and the language in the final text was significantly more nuanced than earlier drafts.\nTeresa Anderson, climate policy coordinator at ActionAid International, said COP26 was “an insult to the millions of people whose lives are being torn apart by the climate crisis.”AFP"
  },
  {
    "headline": "Brigadier-General, Three Soldiers Killed As Military Battles ISWAP Terrorists In Borno",
    "summarized_story": "A senior officer and three soldiers have been killed in a fierce encounter with ISWAP terrorists in Borno, the Nigerian Army said on Saturday.\nAccording to a statement signed by army spokesperson Brigadier-General Nwachukwu, the encounter took place in Askira Uba Local Government Area of Borno State.\n“The Chief of Army Staff Lt Gen Faruk Yahaya deeply commiserates with the families and relations of the fallen heroes.\n“We thank these fallen heroes for their supreme sacrifices to the Nigerian Nation.\nThe people of Borno will remain forever grateful to them and all fallen heroes, and will remain fully supported of gallant troops currently operating in front lines.”"
  },
  {
    "headline": "Bandits Attack Zamfara Community, Kill Nine, Rustle Livestock",
    "summarized_story": "At least nine persons have been killed by bandits in Tungar Ruwa Village located in Anka Local Government Area of Zamfara State.\nThe incident was confirmed on Friday night by the spokesperson of the Zamfara State Police Command, Mohammed Shehu.\nZamfara State is notorious for bandit attacks.\nOn Sunday, gunmen suspected to be bandits attacked Rijiya village in Gusau Local Government Area of the state, killing six people and abducting several others.\nThe bandits were said to have ambushed the police operatives, killing seven of them and setting ablaze their operational vehicle."
  },
  {
    "headline": "Reps Minority Caucus Mourns Slain Vanguard Reporter, Demands Further Investigation",
    "summarized_story": "The Minority Caucus in the House of Representatives has mourned Tordue Salem, the Vanguard Newspaper correspondent attached to the House of Representatives.\nThe body of Salem was found by the Police on Thursday, November 11, a month after he went missing.\nThe lawmakers in a statement signed on Saturday by the Minority Leader, Ndudi Elumelu, described the news of Salem’s death as shocking and devastating, demanding a further investigation by the police.\n“The Minority Caucus in the House of Representatives receives with shock and utter devastation, the news of the death of the Vanguard Newspaper correspondent attached to the House of Representatives, Mr. Tordue Salem.\nThey also commiserated with the Salem family, particularly, Mrs. Salem, the Vanguard newspapers, the House of Representatives Press Corps, and the entire media industry for the loss."
  },
  {
    "headline": "NDLEA Detains 12 Apapa Dock Workers Over N9.5bn Cocaine Shipment",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) on Saturday said it is holding 12 dockworkers at the Apapa seaport in Lagos because of their significant links to the importation of 32.9 kilograms of cocaine worth over N9.5 billion in street value.\nA thorough search of the ship led to the recovery of 30 parcels containing cocaine, which weighed 32.9kg, a statement signed by NDLEA spokesperson Femi Babafemi said.\nThe NDLEA said its clarification became necessary following claims by the Maritime Workers Union of Nigeria that some of its members are being detained unlawfully by the Agency.\nIn line with the intelligence available to the Agency, there is a syndicate of dockworkers, crew members with apparent international conspirators who work in synergy to traffic in the illicit substances, the NDLEA said.\n“Already, two dockworkers are now on the run, after absconding from their place of work, since the beginning of the investigation."
  },
  {
    "headline": "NDLEA arrests 12 dockworkers linked to N9.5bn cocaine seized at Lagos port -",
    "summarized_story": "The National Drug Law Enforcement Agency, NDLEA has said that it is holding 12 dockworkers at the Apapa seaport in Lagos because of their significant links to the importation of 32.9 kilograms of cocaine worth over N9.5 billion in street value.\nA thorough search of the ship led to the recovery of 30 parcels containing cocaine, which weighed 32.9kg.\nIn line with the intelligence available to the Agency, there is a syndicate of dockworkers, crew members with apparent international conspirators who work in synergy to traffic in the illicit substances.\nAlready, two dockworkers are now on the run, after absconding from their place of work, since the beginning of the investigation.\nFor the avoidance of doubt, all the Agency’s actions are guided by international best practices and in line with the Global Maritime Standard Operational Procedure on arrest, seizure and detention of Vessels and crew members."
  },
  {
    "headline": "No standing order of NASS should be used to block democratic rights of Nigerians",
    "summarized_story": "The Director General of the Progressives Governors Forum, Salihu Lukman has said that party leaders must be appealed to, so that they are able to understand and appreciate that the challenges facing both the party and the nation require strong unity, especially among leaders.\nThis was contained in a statement he signed, while reacting to the meeting convened by the party officials and National Assembly members on the Electoral Act amendment Bill.\nSalihu Lukman says some, believed that through direct method, involving all party members, problems of imposition of leaders and candidates, vote buying, rigging, manipulation, associated with indirect methods of the delegates system will be reduced.\nHe blamed Part of the underlying problems of Nigerian democracy on poor relation between members of executive and legislative branches.\nHe recommended that given that the whole controversy about the proposed Electoral Act amendment which is limited to the new insertions in Section 87, the National Assembly should consider reworking issues under Section 87 to make it unambiguous."
  },
  {
    "headline": "Tordue Salem: NUJ Demands Independent Inquiry, Autopsy",
    "summarized_story": "The Nigeria Union of Journalists (NUJ) FCT Council has tasked the Federal Government to empanel an independent probe into circumstances surrounding the death of Vanguard Newspapers reporter, Tordue Salem.\nSalem went missing on October 13 in Abuja and was reported dead on November 11 by the newspaper he worked with for several years.\n“The death of Mr. Tordue Salem opens another dark chapter for journalism and journalists in Nigeria and we are grievously saddened by it,” the statement reads.\n“While the NUJ appreciates the effort of the police in finding the corpse of Mr. Salem, as a union we are not persuaded by the account of the police as it poses more questions than answers.\nIt is in this regard that we urge President Muhammadu Buhari to order for an independent inquiry into the tragic end of Mr. Tordue."
  },
  {
    "headline": "Six burnt to death in Ondo road accident",
    "summarized_story": "At least six persons were burnt to death at Ode Aye junction in Okitipupa Local Government Area of Ondo state on Friday.\nThe accident involved a coaster bus and a J5 bus laden with Ethanol .\nThe incident which occurred after one of the vehicles was trying to overtake another vehicle but the two vehicles collided and instantly caught fire.\nHe said the six people were burnt beyond recognition while some other victims were rushed Prima hospital in Ore in Odigbo local government where they have been receiving treatment.\nHe said all attempts to call the operatives of the state road safety agency were not successful but said the remains of the victims had been deposited in a hospital in Ore"
  },
  {
    "headline": "Saheed Balogun On Making the Movie ‘Online’",
    "summarized_story": "Share on TwitterShare on FacebookActor and Director Saheed Balogun speaks on his latest movie “Online”"
  },
  {
    "headline": "Free at Last, Britney Spears Calls End of Conservatorship ‘Best Day Ever’",
    "summarized_story": "The 39-year-old “Piece of Me” singer had begged the court for months to terminate the conservatorship that has governed her personal life and $60 million estate since 2008.\nSome danced and sang to her hit “Stronger.”“It was a monumental day for Britney Spears,” the pop star’s attorney, Mathew Rosengart, said outside the courthouse.\nThe arrangement began to crumble in September when in a sudden reversal Jamie Spears said he supported ending it because it had helped her and was no longer needed.\nRosengart is pushing for Jamie Spears to be investigated for possible financial mismanagement of his daughter’s affairs, but he said on Friday it would be up to Britney Spears to decide how to proceed on that matter.\nJamie Spears has said through attorneys that he helped his daughter rehabilitate her career and always acted in her best interest."
  },
  {
    "headline": "Man Who Went to Space Aboard Blue Origin Last Month Dies in Plane Crash",
    "summarized_story": "Authorities have not said who was piloting the small plane.\nIt was incredible,” de Vries said as he got his Blue Origin “astronaut wings” pinned onto his blue flight suit by Blue Origin founder Jeff Bezos.\n“We are devastated to hear of the sudden passing of Glen de Vries,” Blue Origin tweeted Friday.\n“He brought so much life and energy to the entire Blue Origin team and to his fellow crewmates.\nFischer owned the flight school Fischer Aviation and was its chief instructor, according to the company’s website."
  },
  {
    "headline": "Trump Adviser Bannon Charged after Defying Capitol Riot Subpoena",
    "summarized_story": "Stephen Bannon, a prominent adviser to former U.S. President Donald Trump, has been criminally charged for defying a subpoena issued by a congressional committee investigating the Jan. 6 attack on the Capitol, the Justice Department said on Friday.\nBannon, 67, was charged with one count of contempt of Congress for refusing to appear for a deposition and a second count for refusing to produce documents.\nContempt of Congress is a misdemeanor punishable by up to one year in jail and a maximum fine of $100,000.\nTrump has sought to stonewall the committee, which is scrutinizing his actions relating to the deadly Capitol riot, and directed his former associates not to cooperate.\nThe charges against Bannon may bolster the committee’s efforts to secure testimony and documents from other Trump associates."
  },
  {
    "headline": "Biden, Xi Jinping to Hold Virtual Meeting on Monday",
    "summarized_story": "U.S. President Joe Biden will hold a virtual meeting with Chinese leader Xi Jinping on Monday, the White House said, talks Washington hopes will create some stability amid increased tensions between the world’s two largest economies.\nU.S. officials believe direct engagement with Xi is the best way to prevent ties spiraling toward conflict.\n“If the United States really wants to maintain peace in the Taiwan Strait, it should clearly and resolutely oppose any Taiwan pro-independence behavior,” Wang said.\nDaniel Russel, the top U.S. diplomat for Asia under the Obama administration, said both Biden and Xi were worried by the risk of a military incident escalating.\n“This suggests that the personal relationship Biden built with Xi a decade ago is still strong, and that each conversation can add some stability to the mix.”"
  }
]