[
  {
    "headline": "Bone marrow transplant can cure sickle cell disease, treat invasive cancers –Physician",
    "summarized_story": "Lara AdejoroThe Coordinator at the Bone Marrow Registry Nigeria, Dr. Emmanuel Nna, says sickle cell disease can be cured with a bone marrow transplant, noting that people with this health condition should explore the option.\nDr. Nna also stated that a bone marrow transplant can equally help in the treatment of many invasive cancers.\nA blood stem cell transplant is a procedure used to replace damaged or destroyed bone marrow with healthy bone marrow blood stem cells.\n“The stem cells in the bone marrow are capable of replicating (divide and yield specialised cells) which can cure blood cancers.\n“Over four million Nigerians suffer sickle cell disease which is curable by marrow stem cell transplant."
  },
  {
    "headline": "Bone marrow transplant can cure sickle cell disease, treat invasive cancers –Physician",
    "summarized_story": "Lara AdejoroThe Coordinator at the Bone Marrow Registry Nigeria, Dr. Emmanuel Nna, says sickle cell disease can be cured with a bone marrow transplant, noting that people with this health condition should explore the option.\nDr. Nna also stated that a bone marrow transplant can equally help in the treatment of many invasive cancers.\nA blood stem cell transplant is a procedure used to replace damaged or destroyed bone marrow with healthy bone marrow blood stem cells.\n“The stem cells in the bone marrow are capable of replicating (divide and yield specialised cells) which can cure blood cancers.\n“Over four million Nigerians suffer sickle cell disease which is curable by marrow stem cell transplant."
  },
  {
    "headline": "COVID-19: Edo confirms five deaths of unvaccinated persons",
    "summarized_story": "Adeyinka AdedipeEdo State has confirmed the death of five more persons who were not inoculated with the COVID-19 vaccines, with the government urging citizens to come out to get the vaccines to remain safe and healthy.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State Governor, Mr. Godwin Obaseki.\nObi said three of the new fatalities were reported from the Stella Obasanjo Hospital, while the other two were confirmed at the Irrua Specialist Hospital, adding that the new deaths raised the total number of mortalities recorded in the third wave of the pandemic in the state to 64.\nThe Incident Manager, who reiterated the need for residents to get vaccinated to get protection against the deadly virus, said the government has inoculated over 82,849 persons across the state in the second phase vaccination exercise.\nHe said, “Edo State, in the last 72 hours, recorded five more deaths from COVID-19; the persons were all unvaccinated, which restates the need for everyone to get inoculated in order to stay healthy and alive."
  },
  {
    "headline": "COVID-19: Edo confirms five deaths of unvaccinated persons",
    "summarized_story": "Adeyinka AdedipeEdo State has confirmed the death of five more persons who were not inoculated with the COVID-19 vaccines, with the government urging citizens to come out to get the vaccines to remain safe and healthy.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State Governor, Mr. Godwin Obaseki.\nObi said three of the new fatalities were reported from the Stella Obasanjo Hospital, while the other two were confirmed at the Irrua Specialist Hospital, adding that the new deaths raised the total number of mortalities recorded in the third wave of the pandemic in the state to 64.\nThe Incident Manager, who reiterated the need for residents to get vaccinated to get protection against the deadly virus, said the government has inoculated over 82,849 persons across the state in the second phase vaccination exercise.\nHe said, “Edo State, in the last 72 hours, recorded five more deaths from COVID-19; the persons were all unvaccinated, which restates the need for everyone to get inoculated in order to stay healthy and alive."
  },
  {
    "headline": "Fashion designer Tom Ford’s Husband, Richard Buckley dies at 72",
    "summarized_story": "By Damilola OgunsakinTom Ford’s Husband and partner of 35 years, fashion journalist Richard Buckley is dead.\nRichard died at the age of 72 after a long illness.\nTom Ford’s team confirmed the news in a statement that reads: “It is with great sadness that Tom Ford announces the death of his beloved husband of 35 years, Richard Buckley.\nBuckley passed away with both is Husband and Son Jack by his side at their LA home.\nHe was said to have died of “natural causes after a long illness.’“Richard passed away peacefully at their home in Los Angeles with Tom and their son Jack by his side."
  },
  {
    "headline": "PURPORTED HIJACK OF EDO COMMUNITY: I’m innocent, ready to meet Tompolo — Okubo, ex-militant leader",
    "summarized_story": "Tompolo knows that I have developed Inikorogha community and he likes suchthings,” he said.\nThe former SSA who reaffirmed that he provided boreholes for Inikorogha community added that he gave job to 418 youths.\nTheAmaokosuwei is not the community treasurer and as such, revenue cannot be remitted to the Amaokosuwei, but to the community treasurer or chairman.\nThat was what led to the fall of that body during Oshiomhole regime as a governor of Edo State.\n“On a final note, I want you people to visit Inikorogha community to lay to rest all these their false alarms,” he added."
  },
  {
    "headline": "Ndokwa nation seeks chairmanship of APC, writes Buni",
    "summarized_story": "Ndokwa nation, Uweh said, will not fold its arms and sheepishly follow any group into the election without adequately protecting the interest of the Ukwuani and Aboh speaking Deltans.\nAccording to the letter: “Ndokwa ethnic nationality is the 2nd largest ethnic group in Delta state and its is made up of the present Ndokwa East, Ndokwa West and Ukwuani Local Government Areas of the Delta State, which constitute the Ndokwa/Ukwuani Federal Constituency.\nNdokwa shares geographical and cultural affinities with these sister nationalities and is seen as the bridge and stabilizer of the peoples of Delta State.\nIn recent and contemporary times, Ndokwa sons have been moving into the All Progressives Congress (APC), in the determination to take Delta State into the Progressives family.\n“Ndokwa APC leaders and leadership of Organization for Ndokwa Unity aka Ndokwa Unite met at Abbi in June and resolve to seek for the Position of State Chairmanship of APC it was shocking reading the zoning arrangement announced by acting state Chairman-Prophet Jones Erhue and till date, no leader in APC was consulted before the zoning,” the letter stated."
  },
  {
    "headline": "Nigerien, 5 others who supply fuel, breads to bandits arrested in Katsina",
    "summarized_story": "By Bashir BelloNo fewer than six persons including a Nigerien who supply fuel and breads to bandits have been arrested by operatives of police in Katsina state.\n“Nemesis caught up with the suspects when they were arrested long Katsina – Jibia road while on their way into the forest.\n“On same day, the command also succeeded in arresting one Shafi’u Haruna (25-year-old), a suspected supplier of fuel to bandits in the forest.\n“Similarly and on same day, the Command succeeded in arresting one Hamisu Sani (30-year-old), a notorious informer who specializes in supplying bread to bandits in the forest.\n“In the course of investigation, suspect confessed to the commission of the offense,” the Police Public Relations Officer, SP Isah however stated."
  },
  {
    "headline": "Ondo Collapsed Building: I blame our landlord for death of my 80-yr-old Mother — Son",
    "summarized_story": "Olom whose wife and five children escaped death by whiskers told vanguard that he lost his octogenarian mother in the incident that occurred at about 3 am today at Fanibi area, in Akure metropolis.\nOlom blamed the landlord for tampering with the building because he wanted to reconstruct the ground floor to flats from room and parlour.\n” l warned him that reconstructing the building or tampering with it could affect the who building but he refused to listen.\n” All he was after was to make more money after reconstructing the room and parlour to flats forgetting that it’s an old building with weak beams.\n” Myself, wife and our four children escaped unhurt only one of my children sustained a head injury and has been taken to the hospital."
  },
  {
    "headline": "Utazi tells RMAFC to declare Enugu as oil-producing state",
    "summarized_story": "Senator representing Enugu North Senatorial district, Chukuwka Utazi on Tuesday called on Revenue Mobilisation, Allocation and Fiscal Commission (RMAFC) to declare Enugu State an oil-producing state.\n“They gave us a condition that any state that wants to become an oil-producing State to fulfill.\n“I want to say that Anambra State has an Orient Oil Producing Company that has been there trying to extract crude oil in that basin.\n“In view of the foregoing, the Orient Petroleum Company has no status of an oil-producing company, hence, Anambra, Kogi and Enugu cannot be classified as an oil-producing state for now.\nWhat is left now is Anambra State."
  },
  {
    "headline": "Ooni begins seven-day seclusion in preparation for Olojo festival",
    "summarized_story": "The Ooni of Ife, Adeyeye Enitan Ogunwusi Ojaja II, has kickstarted the year 2021 Olojo Festival in Ile-Ife with the traditional seven-day seclusion where he is expected to commune with his ancestors and intercede for the people of Ile-Ife and Nigeria.\nI will go again to seclusion for God to touch their hearts for them to stop these game playing with the people.\nThey are just crisscrossing from one political party to the other in order to retain their positions.\nWe have one political party in this country, same value, same character, same politician.\n“This time around my seclusion will be a request on behalf of the entire people and by extension our dear country Nigeria."
  },
  {
    "headline": "Femi Adesina afraid Fani-Kayode will replace him as Buhari’s spokesman – Omokri",
    "summarized_story": "Socio-political activist, Reno Omokri, has insisted that Femi Adesina, spokesman to President Muhammadu Buhari, is afraid that former Aviation Minister, Femi Fani-Kayode, who recently defected to the All Progressives Congress, APC, will take over his position.\nOmokri said this while reacting to the statement of Adesina that Buhari would teach world leaders how to manage their economy during a pandemic.\nAdesina had on Monday disclosed during an interview on Channels Television that world leaders at the United Nations General Assembly, UNGA, meeting would learn from his principal how to overcome economic recession during a pandemic.\nAdesina said the president “would talk about security.\nHe would talk about the girl child, SDGs, and so many things.”Reacting, Omokri, in a tweet via his Twitter handle on Tuesday, said, “Femi Adesina, Buhari’s in-house clown, is afraid he is about to be replaced by Femi Fani-Kayode, hence he has stepped up his sycophancy, claiming ‘Buhari Will Teach World Leaders How To Manage Economy During Pandemic’."
  },
  {
    "headline": "Benue communal crisis: Community leaders embrace peace as Governor Ortom intervenes",
    "summarized_story": "Leaders of Bonta and Ukpute communities in Konshisha and Oju local government areas of Benue State, on Monday, agreed to end the lingering communal crisis between them which has led to the killing of scores of residents.\nThe two communities made the pledge to bury the hatchet when Governor of the state, Samuel Ortom, led some top government officials to a peace meeting with the leaders of the warring communities.\nGovernor Ortom maintained that where there is no peace, there would be no tangible development.\nSenator representing Benue North East, Gabriel Suswam and his Benue South counterpart, Abba Moro, re-echoed the need for the people to give peace a chance, noting that escalating the crisis would not serve any useful purpose.\nTor Jechira, Chief Clement Uganden who represented Tor Tiv, and Oche Otukpo-Ohimini, Chief Mike Okochi representing the Och’Idoma commended the peace initiative of the Governor, saying with his determination, the two communities would witness peace again."
  },
  {
    "headline": "Biafra: Why I didn’t order my men to kill IPOB members – Okorocha",
    "summarized_story": "Former Governor of Imo State, Rochas Okorocha has revealed why he refused to order his men to shoot and kill members of the Indigenous People of Biafra, IPOB, during his tenure.\n“When IPOB started, they came to Imo State when I was the governor, but I listened to them and understood their grievances.\n“They asked me to join them, and I told them if they can convince me to have another (Biafra country) passport, I will join.\nRecently, many youths have been reportedly killed while many others have been arrested and jailed by Nigerian security operatives.\nIt is unconstitutional to order the shooting of Nigerian youths without proper investigations and trials."
  },
  {
    "headline": "BREAKING: Buhari writes Senate, proposes amendment to PIA",
    "summarized_story": "By Sanni Onogu, Abuja- Advertisement -President Muhammadu Buhari, on Tuesday, wrote to the Senate seeking an amendment to the recently enacted Petroleum Industry Act (PIA).\nAccording to one of the letters read on the floor by Senate President Ahmad Lawan, Buhari, through the proposed amendment to the PIA, seeks to remove the Ministers of Petroleum Resources and Finance from the board of the newly created Nigerian National Petroleum Corporation, (NNPC) Limited.\nThe President insisted that the affected Ministers can continue to perform their functions without necessarily being members of the board of NNPC Limited.\nPart of the amendment being sought by Buhari on PIA is to increase the number of Non-Executive members of the NNPC Limited Board from two to six to reflect Federal Character.\nBuhari, in another letter, transmitted the names of nominees for screening and subsequent confirmation as board members of the Economic and Financial Crimes Commission (EFCC) and the NNPCL."
  },
  {
    "headline": "BREAKING: KSA loses wife hours before 74th birthday",
    "summarized_story": "By Gbenga BadaJuju legend King Sunday ‘Sunny Ade’ Adegeye might not be celebrating his 74th birthday tomorrow following the death of one of his wives, Hon Risikat Adegeye.\nThe late Risikat Adegeye, an ex-member of the Lagos House of Assembly, died in the early hours of Tuesday.\nThe Nation reliably gathered that friends and family members of the famous musician have been thrown into mourning over the incident.\nHowever the circumstances surrounding the late Adegeye’s death were still sketchy.\nKSA was yet to release a statement as at the time of filing this report."
  },
  {
    "headline": "BREAKING: Jide Kosoko, Fred Amata, Yemi Solade lead protest against Raddison Blu",
    "summarized_story": "By Gbenga BadaLeading Nollywood stars including Jide Kosoko, Fred Amata, Yemi Solade and Mahmood Alli-Balogun were spotted at a non-violent protest at the Radisson Blu Hotel situated on Isaac John Street, Ikeja, GRA.\nOther movie stars spotted at the protest instigated by the Audio-visual Rights Society (AVRS) are Yinka Akanbi, Grace Amah, Ejike Asiegbu and Sunny McDon as well as movie producers and directors.\nAVRS boss, Alli-Balogun, said the hospitality outfit has refused to pay for use of their intelligent properties in their different branches.\nHe further said negotiations with the management of the hospitality outfit has met brick walls, leading to the protest.\nAlli-Balogun also alleged the hospitality outfit is owing the copyright collective society to the tune of N50 million."
  },
  {
    "headline": "Govt: We are not interested in naming, shaming terror sponsors",
    "summarized_story": "Our ReporterThe Federal Government on Monday said it was “not interested in naming and shaming anybody” involved in the sponsorship of terrorists in the country.\nIt said it was more interested in bringing such persons to justice.\nAsked if Buhari would comment on the issue of terrorism at the United Nations General Assembly, following the UAE action,” he replied: “Naming and shaming won’t be the motive.\n“Nigeria is not interested in naming and shaming anybody.\n“Rest assured that these people will be dragged before justice and justice will have its way.”"
  },
  {
    "headline": "9 killed in multiple accident in Benin",
    "summarized_story": "From Tony‎ Osauzo, Benin‎A multiple motor accident involving two lorry tippers laden with sand and two commercial buses, has claimed nine lives in Benin Benin City this morning.\nThe accident happened‎ at about 7.30 am at Sapele Road by Ogbelaka junction.\nThe bodies of the victims have already been evacuated to the morgue of the nearby Edo Specialist Hospital.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars.\nClick here to apply today."
  },
  {
    "headline": "Nigerians to pay more for electricity as FG ends N30bn monthly subsidy",
    "summarized_story": "From Isaac Anumihe (Abuja) Adewale Sanyaolu and Merit IbeMore difficult times await Nigerians in the months ahead as the Federal Government yesterday announced it is ending the N30 billion monthly electricity subsidy by January 2022.\nThe decision is also to affect all forms of subsidies hitherto extended to operators in the power sector value chain.\nVice President Yemi Osinbajo, had last July said the government expected the electricity sector to generate its revenue from the power sector market.\nTherefore, the push towards a full cost reflective tariff should be gradual to minimise the shocks on citizens and corporates.\nComparably, the cost of providing diesel for industries is likely higher than the electricity supply from the national grid."
  },
  {
    "headline": "Governor Sanwo-Olu signs anti-open grazing bill",
    "summarized_story": "By Lukman OlabiyiGovernor of Lagos State, Babajide Sanwo-Olu, has signed the law to prohibit open cattle grazing and trespass of cattle on land in Lagos State, and for connected purposes.\nThe governor also signed the Lagos State Domestic And Sexual Violence Agency Bill, 2020 into law.\nThe signing of the bill has made a criminal in Lagos for cattle rearers to occupy unapproved public areas and private land with their livestock for grazing.\nThe signing of the anti-open grazing law by the Governor followed the decision of Southern Governors’ Forum last August, setting the September deadline to pass the law across member States.\nAlthough farmer-herder crisis is not pronounced in Lagos, the anti-open grazing law is expected to prevent the spillover of the menace into the State."
  },
  {
    "headline": "The Sun award not politically influenced –Wike",
    "summarized_story": "Rivers State Governor, Nyesom Wike, has described The Sun Awards as honour that reflects one’s achievements, devoid of sentiment, external influence or political consideration.\nHe thanked the Management and Board of Editors of The Sun for finding him worthy to receive the Man of the Year Award, as he dedicates the award to God and the people of Rivers State.\nGovernor Wike attributed achievements recorded by his administration to massive supports he enjoys from Rivers people.\nOutlining what influenced the decision to name Wike Man of the Year 2020, he said the has contributed immensely to the socio-economic and political development of the country.\nNigerians will remember travel restriction and the closure of Rivers State borders to ensure that coronavirus didn’t rare its ugly head in the state."
  },
  {
    "headline": "Amotekun foils 35 kidnap cases in Ondo",
    "summarized_story": "From Bamigbola Gbolagunte, AkureOndo State Security Agency Network, also known as Operation Amotekun, has disclosed that no fewer than 35 kidnap cases were foiled by its men within the last few months.\nThe state Commander of the Corps, Mr Adetunji Adeleye, also disclosed that the corps had attended to 2,633 cases.\nBriefing reporters in Akure, the Amotekun boss, said the Corps also arrested 1,000 suspects, waded into 515 herders/farmers clashes and arrested kidnappers.\nHe added that the corps has also impounded 26 cars and over 1,000 Okada, totalling 2,633 cases from May 2020 to September 2021.\nGet paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "Breaking: Buhari Sends PIA to House for Amendment",
    "summarized_story": "By Udora OrizuPresident Muhammadu Buhari has written to the House of Representatives, seeking some amendments in the Petroleum Industry Act (PIA), which he recently assented to.\nThe three-page letter was read by the Speaker, Hon.\nFemi Gbajabiamila at the plenary on Tuesday.\nDetails later….\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Your Utterances are Reckless, Careless, Southern/Middle Belt Alliance Tells NEF",
    "summarized_story": "But the Southern and Middle Belt Alliance (SaMBA) dismissed the NEF spokesman’s claim as both reckless and careless.\nSaMBA, in a statement by its spokesman, Rwang Pam Jnr, said the statement purportedly made on behalf of NEF, lacked basis.\nBaba-Ahmed had on Saturday said the North was in the process of rebuilding itself and was not prepared to play second fiddle in a nation, where it enjoyed numerical strength.\nBaba-Ahmed stated, “We will lead Nigeria the way we have led Nigeria before, whether we are president or vice president, we will lead Nigeria.\n“Rather than boasting of numerical strength to win election, NEF should look for ways to turn the numerical strength to productivity."
  },
  {
    "headline": "Military Moves to Prosecute Surrendered Terrorists",
    "summarized_story": "*Vows to halt ISWAP recruitment driveKingsley Nwezeh in AbujaMilitary authorities, yesterday, said plans were afoot to commence the prosecution of surrendered terrorists in the North-east.\nThe military had recently raised the alarm that the group had embarked on a fresh recruitment drive.\nHe further noted that the military was doing all within international laws in the handling of Boko Haram and the prosecution of surrendered terrorists against the backdrop of the recent mass surrender of the terrorists.\nHe said the media tour was aimed at discussing the issues of rehabilitation of surrendered terrorists and plight of the victims of the conflict.\n“These fundamental reasons gave birth to the media tour of the North-east."
  },
  {
    "headline": "Report: Non-oil Earnings Lifted FG’s Revenue by 28% in April",
    "summarized_story": "The CBN stated this in its monthly economic report for April posted on its website.\nWhile oil revenue accounted for 35.5 per cent (or N392.91 billion) of total receipts in the period, non-oil revenue contributed 64.5 per cent (or N712.87 billion).\nThe report said, “In addition, the significant decline in domestic crude oil and gas sales, also contributed to the meagre oil receipt during the period.\nThe strong performance of non-oil revenue in April 2021 reflected the maturing benefits of the Strategic Revenue Generation Initiative (SRGI) of the federal government, as contained in the 2019 and 2020 Finance Acts.\nThe retained revenue of the federal government stood at N409.31 billion or 38.5 per cent below target."
  },
  {
    "headline": "Breaking: No More Open Grazing in Lagos, as Sanwo-Olu Signs Bill into Law",
    "summarized_story": "Segun JamesEleven days after the State House of Assembly passed the bill, Lagos State Governor Babajide Sanwo-Olu, has assented to the bill prohibiting Open Cattle Grazing and Trespass of Cattle on Land.\nThe signing of the anti-open grazing law by the Governor followed the decision of Southern Governors’ Forum last August, setting the September deadline to pass the law across member States.\nThere have been crises witnessed in some States, resulting from alleged open grazing.\nAlthough farmer-herder crisis is not pronounced in Lagos, the anti-open grazing law is expected to prevent the spillover of the menace into the State.\nAfter signing the law, Sanwo-Olu said: “Raising awareness about domestic and sexual violence is an important piece of working to end the cycle of violence."
  },
  {
    "headline": "EXPOSED: How Buhari Regime Hired Pro-Government Protesters In New York, Paid Them $50 Per Hour",
    "summarized_story": "Pro-government Nigerian protesters who countered groups agitating for self-determination in New York, United States on Monday were paid $50 per hour, SaharaReporters has gathered.\n“One of the organisers of the fake “One Nigeria” protest who bribed some Nigerians with the money is Harun Bello.\nHarun Bello with PantamiAlso, a woman confirmed that she was contacted by the organisers of the “One Nigeria” protest but she declined.\nSee Also Politics Pro-Buhari Protesters Clash With Self-Determination Groups As Nigerian President Arrives New YorkShe said, “I was invited for the pro-Buhari protest.\nThe revelation comes as two Nigerian groups with conflicting ideologies confronted each other in New York over the President's visit."
  },
  {
    "headline": "EXPOSED: How Buhari Regime Hired Pro-Government Protesters In New York, Paid Them $50 Per Hour",
    "summarized_story": "Pro-government Nigerian protesters who countered groups agitating for self-determination in New York, United States on Monday were paid $50 per hour, SaharaReporters has gathered.\n“One of the organisers of the fake “One Nigeria” protest who bribed some Nigerians with the money is Harun Bello.\nHarun Bello with PantamiAlso, a woman confirmed that she was contacted by the organisers of the “One Nigeria” protest but she declined.\nSee Also Politics Pro-Buhari Protesters Clash With Self-Determination Groups As Nigerian President Arrives New YorkShe said, “I was invited for the pro-Buhari protest.\nThe revelation comes as two Nigerian groups with conflicting ideologies confronted each other in New York over the President's visit."
  },
  {
    "headline": "BUSTED: Nigerian Army Secretly Contacts Families As Boko Haram Fighters Kill 25 Soldiers In Borno",
    "summarized_story": "The deadly attack left about 25 soldiers dead while some are still missing five days after the incident.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nThe Nigerian military has repeatedly claimed that the insurgency had been largely defeated and frequently underplays any losses.\nThe group also claimed four military vehicles were destroyed.\nIn February, about 20 soldiers were also killed in Malari, Borno State by the insurgents."
  },
  {
    "headline": "BUSTED: Nigerian Army Secretly Contacts Families As Boko Haram Fighters Kill 25 Soldiers In Borno",
    "summarized_story": "The deadly attack left about 25 soldiers dead while some are still missing five days after the incident.\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in North-Eastern Nigeria.\nThe Nigerian military has repeatedly claimed that the insurgency had been largely defeated and frequently underplays any losses.\nThe group also claimed four military vehicles were destroyed.\nIn February, about 20 soldiers were also killed in Malari, Borno State by the insurgents."
  },
  {
    "headline": "Nigerian Army Warns About More Ambush Attacks on Troops, Asks Soldiers To Avoid Explosives Planted On Roads",
    "summarized_story": "Following recent attacks by Boko Haram and Islamic State West African Province terrorists, the Nigerian Army has warned of more ambush attacks on soldiers in the North-East.\nFile photo used to illustrate storyIt also stated that information operations of the terrorists had doubled with the integration of Islamic State West African Province.\n“It is believed that the terrorists are planning more ambush Ops using command IED lanes/small gun attacks on MSR Maiduguri-Monguno.\nAlso, on September 15, at least six soldiers of the Nigerian Army were confirmed injured during an encounter with members of the Islamic State of West Africa (ISWAP).\nBoko Haram and its offshoot, Islamic State West Africa Province, have killed thousands and displaced millions in northeastern Nigeria."
  },
  {
    "headline": "Kwara court slams two-year jail term on herder for romance scam",
    "summarized_story": "A high court in Kwara state has convicted Tunde Olagunju, a herder based in Tanzania, and two others for offences bordering on love scam and cybercrime.\nAdvertisementThe two other convicts are Hassan Gafar Olarewaju, 29, and Ojo Basit Adewale, an Ilorin-based bricklayer.\nThe Economic and Financial Crimes Commission (EFCC), Ilorin zonal command, had arraigned the trio on separate charges on Monday, September 20, 2021.\nAlso, Hassan was sentenced to one year in prison with an option of a fine of N300,000.\nThe convict was ordered to forfeit the iPhone XR recovered from him at the point of arrest to the federal government."
  },
  {
    "headline": "Kwara court slams two-year jail term on herder for romance scam",
    "summarized_story": "A high court in Kwara state has convicted Tunde Olagunju, a herder based in Tanzania, and two others for offences bordering on love scam and cybercrime.\nAdvertisementThe two other convicts are Hassan Gafar Olarewaju, 29, and Ojo Basit Adewale, an Ilorin-based bricklayer.\nThe Economic and Financial Crimes Commission (EFCC), Ilorin zonal command, had arraigned the trio on separate charges on Monday, September 20, 2021.\nAlso, Hassan was sentenced to one year in prison with an option of a fine of N300,000.\nThe convict was ordered to forfeit the iPhone XR recovered from him at the point of arrest to the federal government."
  },
  {
    "headline": "CBN: Merchants, business outlets MUST accept eNaira payments",
    "summarized_story": "The Central Bank of Nigeria (CBN) says the country’s first digital currency, eNaira, must be accepted as a form of payment by all merchants and business outlets.\nAdvertisement“So, the same way naira is accepted that you can’t reject it, is the same way e-naira must be accepted.\nSo, merchants must accept e-naira as a means of payment.”He said that similar to the fiat currency (naira), the CBN bears all liabilities for the eNaira.\nWe don’t expect that on October 1, all business merchants in Nigeria will accept it.\nAdvertisement“Remember there was a time in this country when you had to practically beg business outlets, merchants and others to accept POS transactions."
  },
  {
    "headline": "CBN: Merchants, business outlets MUST accept eNaira payments",
    "summarized_story": "The Central Bank of Nigeria (CBN) says the country’s first digital currency, eNaira, must be accepted as a form of payment by all merchants and business outlets.\nAdvertisement“So, the same way naira is accepted that you can’t reject it, is the same way e-naira must be accepted.\nSo, merchants must accept e-naira as a means of payment.”He said that similar to the fiat currency (naira), the CBN bears all liabilities for the eNaira.\nWe don’t expect that on October 1, all business merchants in Nigeria will accept it.\nAdvertisement“Remember there was a time in this country when you had to practically beg business outlets, merchants and others to accept POS transactions."
  },
  {
    "headline": "Sudan foils coup, arrests top military officers",
    "summarized_story": "Sudanese authorities have reportedly foiled a coup attempt by a group of soldiers in the country.\nAdvertisementAccording to Mohamed Al Faki Suleiman, a member of the country’s ruling council, the situation has been brought under control.\nMany troops, including high-ranking officers, have reportedly been arrested in connection to the failed coup.\nThe military was said to have used tanks to close a bridge connecting Khartoum with Omdurman early on Tuesday morning.\nEarlier in the month, Guinea President Alpha Conde was ousted from office by military forces led by Mamady Doumbouya."
  },
  {
    "headline": "Ventures Park launches larger hub in Abuja for its expanding user base",
    "summarized_story": "The new Ventures Park campus in Abuja.\nA shared workspace at the new Ventures Park campus in Abuja.\nThe new Ventures Park campus in Abuja.\nAfter launching its second innovation hub, Ventures Platform is considering partnerships that could see it expand across Africa, according to Oguchi.\n“The work we do at Ventures Platform is pan-African, and the work that Ventures Park does as a part of that vision is really important,” she said."
  },
  {
    "headline": "A backstory to the tussle between CBN and popular website abokiFX",
    "summarized_story": "abokiFX, a popular mobile and web-based platform that collates the black market foreign exchange rates in Nigeria, on Friday announced it will temporarily suspend the publishing of rates on all its platforms, hours after receiving threats from the Central Bank of Nigeria (CBN).\nWhy Nigeria has different exchange ratesNigeria is Africa’s largest producer of oil, a commodity that brings in more than 90% of the country’s foreign exchange earnings.\nBut rather than an outright devaluation of the naira, the CBN adopted a multiple exchange-rate regime.\nThat left Nigeria with only two rates – the NAFEX rate and the parallel market rate – from almost five different rates as of early 2020.\n“All allegations against our director are yet to be confirmed but we at abokiFX DO NOT trade FX nor do we manipulate parallel market rates,” the statement reads."
  },
  {
    "headline": "iPhone 13 series price in Nigeria, Kenya, and South Africa",
    "summarized_story": "During a virtual event on Tuesday, Apple announced that the iPhone 13 will come in four new models: the iPhone 13, 13 Mini, 13 Pro and 13 Pro Max.\nThe iPhone 13 starts at $829 for 128GB, which is twice the storage the iPhone 12 started with; while the iPhone 13 Mini starts at $729 for 128GB of storage.\nThe iPhone 13 Pro and 13 Pro Max start at $999 and $1,099 respectively, for 128GB storage.\nIPHONE 13 SERIES US PRICES AND STORAGEPhone 128GB storage 256GB storage 512GB storage 1TB storage iPhone 13 Mini $729 $829 $1,029 NA iPhone 13 $829 $929 $1,129 NA iPhone 13 Pro $999 $1,099 $1,299 $1,499 iPhone 13 Pro Max $1,099 $1,199 $1,399 $1,599Why the iPhone 13 series are more expensive in African countriesOver the years, there’s been a noticeable price difference for Apple products in African countries.\nAlthough the store hasn’t revealed the prices, the iPhone 13 Pro 128GB is expected to go for around R23,499 ($1,640), while the iPhone 13 Pro Max 128GB could retail for around R25,999 ($1,815)."
  },
  {
    "headline": "Join Juliet Anammah at the #FutureOfCommerce on the 24th of September",
    "summarized_story": "On the 24th of September, Juliet Anammah, Chairwoman, Jumia Nigeria and Group Chief Sustainability Officer will be speaking at the #FutureOfCommerce.\nThis panel discussion will explore what commerce will look like in Africa and other emerging markets over the next few years.\nJuliet joined Jumia in 2015 as CEO of Jumia Nigeria.\nJuliet began her career in Sanofi Aventis and held various roles in sales, marketing, and product management between 1991-1999.\nInterested in listening to and meeting Juliet on the 24th of September?"
  },
  {
    "headline": "Inside story of electronic bank fraud in Nigeria",
    "summarized_story": "More than six high-profile electronic bank fraud cases took place in Nigeria between February and July this year.\nHe asks me if I have ever heard of a BDC owner jailed for abetting bank fraud.\nOperational teamThere is no specific number of persons required to undertake an electronic bank fraud.\nEach ‘specialist’ in the team for a specific bank fraud has a specific role to play.\nPublic holidays that begin on Thursdays are the most welcome period for bank fraud."
  },
  {
    "headline": "Inside story of electronic bank fraud in Nigeria",
    "summarized_story": "More than six high-profile electronic bank fraud cases took place in Nigeria between February and July this year.\nHe asks me if I have ever heard of a BDC owner jailed for abetting bank fraud.\nOperational teamThere is no specific number of persons required to undertake an electronic bank fraud.\nEach ‘specialist’ in the team for a specific bank fraud has a specific role to play.\nPublic holidays that begin on Thursdays are the most welcome period for bank fraud."
  },
  {
    "headline": "Internet banking fraud victims recall experience",
    "summarized_story": "“I became nervous,” she said, “when I neither received alerts nor emails on my phone alerting me to these deposits.\nThey had also changed her daily transfer limits of ten million naira.\n“They stole ninety-nine million naira from my account!” she said agonizingly.\nHer bank replaced her money after they pleaded with her not to publicise her experience.\nHe remembers the day they discovered that over three hundred million naira had been stolen from their account."
  },
  {
    "headline": "COVID-19 3rd wave: Edo confirms five more deaths of unvaccinated persons, as infections, mortalities soar – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…begins administration of second dose of Moderna vaccines tomorrowEdo State has confirmed the death of five more persons who were not inoculated with the coronavirus (COVID-19) vaccines, with the government urging citizens to come out to get the vaccines in order to remain safe and healthy.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the State Governor, Mr. Godwin Obaseki.\nThe Incident Manager, who reiterated the need for residents to get vaccinated to get protection against the deadly virus, said the government has inoculated over 82,849 persons across the state in the second phase vaccination exercise.\nHe disclosed that the state will tomorrow, September 21, 2021, begin the administration of the second dose of Moderna vaccines for those who were inoculated with the first dose in the second phase vaccination exercise, urging residents to take advantage of the exercise to get full protection against the virus.\nAccording to him, “Edo State, in the last 72 hours, recorded five more deaths from COVID-19; the persons were all unvaccinated, which restates the need for everyone to get inoculated in order to stay healthy and alive."
  },
  {
    "headline": "Food security: Obaseki to flag-off distribution of agric inputs to farmers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, will on Thursday, September 23, 2021flag-off the distribution of agricultural inputs to farmers as part of the Nigeria COVID-19 Action Recovery and Economic Stimulus Programnme (CARES).\nIn a statement, Coordinator, Nigeria Cares, Edo State Programme Office, Ifueko Alufohai, said the distribution of the inputs to farmers under the CARES Programme is aimed at increasing food security and safe functioning of food supply chains for poor households.\nShe said, “The Nigeria CARES Programme is a state-level intervention that seeks to mitigate the local effects of the COVID-19 worldwide pandemic, by protecting the livelihoods of existing and newly poor and vulnerable households, and supporting the recovery of local economic activity.”According to her, Edo State Governor, Mr. Godwin Obaseki will flag-off the exercise on Thursday, September 23, 2021, at the Umuegbe Community, after Ulemon, along Airport Road, Ward 2, Oredo Local Government Area of the state."
  },
  {
    "headline": "Edo supporting manufacturing, industrial sector to reap AfCFTA gains-Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said the government is supporting the manufacturing and industrial sector in the state to boost productivity and reap from the gains of the African Continental Free Trade Agreement (AfCFTA).\nOn the initiatives of the Edo State Government to support businesses, he noted that the Edo State Skills Development Agency was established by his administration to up-skill youths and create a surfeit of employable manpower in the state.\n“The Edo State Government knows that access to funding is a challenge.\nEdo State recently initiated another partnership with the BOI.\nHe added that the manufacturing sector can revamp the economy with the opportunities provided by the African Continental Free Trade Areas (AFCFTA)."
  },
  {
    "headline": "Edo, Swiss govt, IOM, others partner to tackle unemployment, irregular migration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo Government through the state’s skills development agency, EdoJobs has partnered the International Organisation for Migration (IOM) and the Swiss Government to launch a community-based reintegration programme to tackle unemployment and irregular migration in Edo.\nLaunching the programme with the theme, “Promoting Resilience and Sustainable Livelihood for Returned Migrants and Unemployed Youths Through Community-Based Reintegration,” the Managing Director of EdoJobs, Mrs. Ukinebo Dare, said the government will sustain partnerships to guarantee a prosperous Edo State.\nAccording to her, “Everything that we do is about attracting the demand for highly skilled talents in Edo State and providing the demands for that talent.\nThis project sits very much at the center of what we like to do.\n“For us, the major thing that we celebrate about this programme is that it has a lot of elements that we are passionate about including skill transfer, engagement with the private sector and collaboration among various partners.”Also speaking, the Senior Programme Manager, IOM, Lagos, Saskia Kok, said the programme will contribute to improved and sustainable reintegration of returned migrants and create livelihood opportunities for local communities."
  },
  {
    "headline": "Police arrest foreigner, four others for allegedly supplying fuel to bandits in Katsina",
    "summarized_story": "ADVERTISEMENTThe police in Katsina State have arrested one Lawal Shu’aibu, 32, of Maradi in Niger Republic and four others for allegedly selling fuel to armed bandits in a forest in the state.\nThe police spokesperson in Katsina, Gambo Isah, told reporters that the foreigner was arrested on Saturday while conveying the substance in a Volkswagen Passat car with Reg.\nThe police said the other four include one Sani Lawal, 28, of Magamar Jibia for conveying fuel in a Volkswagen Passat car with registration No.\nKMC 198 XB; and Abdulrashid Garba, 50, of Daddara village, Jibia LGA, for conveying fuel in his Volkswagen Golf III wagon with registration No.\n“Also arrested was Tigal Haruna, 57, of Kofar Guga Quarters, Katsina, conveying fuel in his Passat motor vehicle with registration number FC 977 LKJ."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "South, Middle Belt group tackles Baba-Ahmed over ‘insensitive’ 2023 presidency comment",
    "summarized_story": "The Southern and Middle Belt Alliance (SaMBA) has condemned a statement by spokesperson for Northern Elders Forum, Hakeem Baba-Ahmed, to be effect that northern Nigeria will retain the presidency in 2023 because they have the numbers to lead Nigeria in perpetuity.\nHowever, reacting to his comments, SaMBA in a statement on Monday by Rwang Pam, its spokesman, described them as reckless, careless and insensitive.\nIt said the era of ”one north” is in the past, and that instead of boasting of numerical strength to win election, NEF should look for ways to turn the numerical strength to productivity.\n“Let Dr Baba-Ahmed be reminded that without the Middle Belt, such numbers boasted about in the North is mere political posturing,” the statement said.\n“Rather than boasting of numerical strength to win election, NEF should look for ways to turn the numerical strength to productivity."
  },
  {
    "headline": "Ethiopian Airlines to resume Enugu flights October 1",
    "summarized_story": "Ethiopian Airlines has announced plans to resume flights to Enugu on a three-time service schedule with the state-of-the-art Boeing 787 Dreamliner on October.\nIt said the flight to Enugu on that day would reinforce Ethiopian Airlines good relationship with Nigeria since its first flight to the country in 1960.\nBefore the closure of the airport for runway repairs, Ethiopian Airlines was the only international airline operating into Enugu.\nEthiopian Airlines operates to four airports in Nigeria-Abuja, Lagos, Kano and Enugu.\nMeanwhile, aviation stakeholders have commended the Chairman, House of Representative Committee on Aviation, Nnoli Nnaji, for the critical role he played in facilitating the resumption of Ethiopian Airlines flights to Enugu, ThisDay reported."
  },
  {
    "headline": "Nigerian banks CEOs take home N1.7bn pay, cut jobs amid pandemic",
    "summarized_story": "Nigerian banks generally did well amid COVID-19 in 2020, recording profits above the 2019 level in a year that witnessed lockdowns and an economic decline.\nThe increase in revenue and profit did not stop banks from cutting jobs and pay, however.\nWhile some lenders added new jobs, others retrenched despite a directive by the Central Bank of Nigeria for banks to keep their staff.\nBoth CEOs opted for a pay cut even when their banks posted increases in profit.\nCutting its directors pay by almost one third, Zenith Bank adopted the most prudent approach in compensating its directors out of the 14 banks monitored by Premium Times."
  },
  {
    "headline": "Group sends save-our-soul letter to Fashola as erosion cuts Onitsha-Owerri Road into two",
    "summarized_story": "OBINNA EZUGWUAdvocacy group, the Cultural Credibility Development Initiative (CCDI), has sent a save-our-soul letter to the Honourable Minister of Works, Mr. Babatunde Fashola to intervene as Onitsha-Owerri Road, a major road linking Anambra and Imo states is cut into two parts by erosion, leaving motorists stranded.\n“The Cultural Credibility Development Initiative calls on the Hon Minister, Mr Raji Babatunde Fashola, to without delay repair the delapidated Onitsha Owerri Rd, particularly the Metalogical junction,” the letter dated September 21, 2021 reads in part.\n“Today, this road is a present and looming danger to anyone passing through that road.\nIn a sentence, the Onitsha Owerri Rd has been divided into two.\n“Your Excellency, we wish to inform you that the roads in Igboland are so dilapidated that road transportation has crumbled beyond description ."
  },
  {
    "headline": "JUST-IN: King Sunny Ade’s Wife, Risikat Adegeye, Is Dead",
    "summarized_story": "One of the wives of music legend, King Sunny Ade (KSA), Honourable (Mrs) Risikat Adegeye, is dead.\nRisikat Adegeye, an ex-member of the Lagos State House of Assembly, died early mornig on Tuesday, September 21, 2021.\nLEADERSHIP gathered that the former lawmaker died of cancer.\nLate Mrs Adegeye was also a two-time member of the Lagos State Assembly Service Commission.\n…Details Later"
  },
  {
    "headline": "JUST-IN: King Sunny Ade’s Wife, Risikat Adegeye, Is Dead",
    "summarized_story": "One of the wives of music legend, King Sunny Ade (KSA), Honourable (Mrs) Risikat Adegeye, is dead.\nRisikat Adegeye, an ex-member of the Lagos State House of Assembly, died early mornig on Tuesday, September 21, 2021.\nLEADERSHIP gathered that the former lawmaker died of cancer.\nLate Mrs Adegeye was also a two-time member of the Lagos State Assembly Service Commission.\n…Details Later"
  },
  {
    "headline": "CBN Faults Calls For Emefiele’s Resignation",
    "summarized_story": "The Central Bank of Nigeria (CBN) has faulted calls from certain quarters for the resignation of the CBN Governor, Godwin Emefiele, over issues relating to the exchange rate of the naira.\nSpokesman of the CBN, Mr Osita Nwanisobi, disclosed the position of the apex bank in an interview on Monday.\nCBN Warns Banks Against Forex Malpractices, Denies Report On Domiciliary AccountsAccording to him, the CBN would not be distracted in its mandate by yielding to the selfish tendencies of a few to the detriment of the majority.\nMeanwhile, Nwanisobi has assured that the CBN remains committed to meeting the foreign exchange request of travelers with legitimate needs as they relate to travel allowances, payment of tuition and medical fees among other invisibles.\nHe noted that there was enough supply of foreign exchange to the banks to meet legitimate demands for foreign exchange."
  },
  {
    "headline": "CBN Faults Calls For Emefiele’s Resignation",
    "summarized_story": "The Central Bank of Nigeria (CBN) has faulted calls from certain quarters for the resignation of the CBN Governor, Godwin Emefiele, over issues relating to the exchange rate of the naira.\nSpokesman of the CBN, Mr Osita Nwanisobi, disclosed the position of the apex bank in an interview on Monday.\nCBN Warns Banks Against Forex Malpractices, Denies Report On Domiciliary AccountsAccording to him, the CBN would not be distracted in its mandate by yielding to the selfish tendencies of a few to the detriment of the majority.\nMeanwhile, Nwanisobi has assured that the CBN remains committed to meeting the foreign exchange request of travelers with legitimate needs as they relate to travel allowances, payment of tuition and medical fees among other invisibles.\nHe noted that there was enough supply of foreign exchange to the banks to meet legitimate demands for foreign exchange."
  },
  {
    "headline": "JUST-IN: 20% Of Nigeria’s Workforce Lost Employment In 2020 – Report",
    "summarized_story": "A new report released this Tuesday by the United Nations Development Programme (UNDP) Nigeria and the National Bureau of Statistics (NBS) has shown that 20 per cent of the fulltime workforce in Nigeria lost employment during the COVID-19 pandemic in 2020.\n80 per cent of enterprises reported experienced a decrease in production with a majority reporting a decline in production between 21 percent to 60 percent.\n81 per cent of enterprises interviewed experienced a decline in revenue and 73 per cent stated that they faced liquidity challenges due to secondary impacts of COVID-19 in 2020.\nThe median loss in revenue reported remained at 44 percent, in comparison to 2019 revenues.\nDespite reduced restrictions at the time of the interviews, 74 percent of enterprises still reported a decrease in production levels when compared to the same time in 2019."
  },
  {
    "headline": "COVID-19: NCDC registers 393 infections, six deaths",
    "summarized_story": "The Federal Capital Territory on Monday topped the table of COVID-19 infections in the country, as the Nigeria Centre for Disease Control reported 393 cases and six COVID-19 related deaths.\nThe NCDC said the latest positive samples were recorded in 14 states and the FCT, which led the chart with 121 cases, a far cry from the only 15 cases it recorded on Sunday..\n“Today’s report includes: backlog of 1 confirmed case for Taraba for Sept. 18, 2021 and zero cases from Nasarawa, Ondo, Osun and Sokoto States,” NCDC said.\nAccording to the public health agency, till date, 190,901 cases had been discharged as 2661 deaths were recorded across the 36 states and the Federal Capital Territory.\nThe NCDC also said that a multi-sectoral national emergency operations centre (EOC), activated at Level 2, continues to coordinate the national response activities."
  },
  {
    "headline": "COVID-19: NCDC registers 393 infections, six deaths",
    "summarized_story": "The Federal Capital Territory on Monday topped the table of COVID-19 infections in the country, as the Nigeria Centre for Disease Control reported 393 cases and six COVID-19 related deaths.\nThe NCDC said the latest positive samples were recorded in 14 states and the FCT, which led the chart with 121 cases, a far cry from the only 15 cases it recorded on Sunday..\n“Today’s report includes: backlog of 1 confirmed case for Taraba for Sept. 18, 2021 and zero cases from Nasarawa, Ondo, Osun and Sokoto States,” NCDC said.\nAccording to the public health agency, till date, 190,901 cases had been discharged as 2661 deaths were recorded across the 36 states and the Federal Capital Territory.\nThe NCDC also said that a multi-sectoral national emergency operations centre (EOC), activated at Level 2, continues to coordinate the national response activities."
  },
  {
    "headline": "EFCC Arrests 30 Suspected ‘Yahoo-Yahoo Boys’ in Ilorin",
    "summarized_story": "By JUMOKE SANNIOperatives of the Ilorin Zonal Command of the Economic and Financial Crimes Commission, EFCC, have arrested 30 suspected internet fraudsters in a sting operation at Kwara State University, KWASU, Malete.\nThe suspects were arrested following actionable intelligence on their alleged involvement in internet-related fraud activities.\nPart of the intelligence indicated that suspected internet fraudsters were operating in campuses around Ilorin metropolis to swindle unsuspecting victims of their hard-earned income.\nIn the course of interrogation, those found not culpable were released to the Student Union Government, SUG, of the School, while the targets of the sting operation were brought to the Ilorin Zonal Command for further questioning.\nSome of the items recovered from them include six exotic cars, several laptops, mobile phones and other incriminating documents."
  },
  {
    "headline": "EFCC Arrests 30 Suspected ‘Yahoo-Yahoo Boys’ in Ilorin",
    "summarized_story": "By JUMOKE SANNIOperatives of the Ilorin Zonal Command of the Economic and Financial Crimes Commission, EFCC, have arrested 30 suspected internet fraudsters in a sting operation at Kwara State University, KWASU, Malete.\nThe suspects were arrested following actionable intelligence on their alleged involvement in internet-related fraud activities.\nPart of the intelligence indicated that suspected internet fraudsters were operating in campuses around Ilorin metropolis to swindle unsuspecting victims of their hard-earned income.\nIn the course of interrogation, those found not culpable were released to the Student Union Government, SUG, of the School, while the targets of the sting operation were brought to the Ilorin Zonal Command for further questioning.\nSome of the items recovered from them include six exotic cars, several laptops, mobile phones and other incriminating documents."
  },
  {
    "headline": "Aborted coup in Sudan, plotters arrested",
    "summarized_story": "Sudanese authorities have contained a coup attempt and the situation has been brought under control, a member of the country’s ruling council said on Tuesday.\nInterrogation of suspects involved in the attempted coup on Monday was due to begin and the military would issue a statement shortly, spokesman Mohamed Suleiman said.\nA government source, speaking on condition of anonymity, said the coup attempt had involved an effort to take control of state radio in Omdurman, across the river Nile from the capital, Khartoum.\nA witness said that the military had used tanks to close a bridge connecting Khartoum with Omdurman early on Tuesday morning.\nTransitional authorities have said they had foiled or detected previous coup attempts linked to factions loyal to Bashir."
  },
  {
    "headline": "Kaffy narrates near-death experience",
    "summarized_story": "Nigerian dancer, choreographer, dance instructor and fitness coach, Dr. Kafayat Oluwatoyin Shafau-Ameh popularly known as Kaffy has shared her near-death experience after taking a medication she was allergic to.\nIn the post, Kaffy also expressed gratitude to her fans and friends for the rapid response and recuse after taking the drug.\nOn her Instagram stories she wrote; “I’m grateful for life today!\nShe wrote: “Lungs 🫁 collapsingEyes changing colorBelly swellingTaking breathe feeling like 📌I was slipping into the dangerous sleepBut MERCY SAID NO !\nI am not better than them , I am grateful for your MERCY , NOT TODAY said the LORD!"
  },
  {
    "headline": "Just In: Jide Kosoko, Fred Amata lead protest against Radisson Blu",
    "summarized_story": "Top Nollywood actors including Jide Kosoko, Fred Amata, Yemi Solade and many more were spotted holding a peaceful protest against Radisson Blu.\nReports have it that the hospitality outfit refused to the Audio-Visual Rights Society (AVRS) for use of their intellectual properties.\nOther actors spotted at Radission Blu, Ikeja GRA include Mahmood Alli-Balogun, Grace Amah, Yinka Akanbi, Sunny Mcdon and Ejike Asiegbu.\nAVRS boss, Alli-Balogun stated that all efforts to meet, discuss and negotiate with the management of the hotel, met brick wall, hence the protest.\nRadisson Blu is said to owe the copyright collective society close to N50 million."
  },
  {
    "headline": "Governor Wike Kicks As Buhari Government Excludes Rivers From States To Benefit From Fresh Loans",
    "summarized_story": "The Rivers State Governor, Nyesom Wike, has expressed disappointment over the exclusion of Rivers State from states that are to benefit from the projects to be executed with the fresh loan that the Federal Government is seeking to obtain from the World Bank.\nHe described as a sheer act of discrimination the Federal Government’s exclusion of Rivers State as one of the states that would benefit from projects for which it is seeking fresh foreign loans to execute.\nOf all the projects, in all the states, Federal Government did not include Rivers State.\n“It is the prerogative of Mr. President; if he says he does not like Rivers State, if the ruling party says they don’t like Rivers State, I won’t kill myself.\nAccording to Governor Wike, what the FIRS was doing was illegal and could be likened to robbing from the states."
  },
  {
    "headline": "Okonjo-Iweala—Amina Mohammed 2023 Presidential Campaign Poster Surfaces Online",
    "summarized_story": "Campaign posters showing WTO DG, Ngozi Okonjo-Iweala and Amina Mohammed have hit the internet ahead of the 2023 Presidential election.\nThe posters with the words inscribed “Gender paradigm shift” were spotted on different social media platforms.\nDespite the fact that no one has claimed ownership for the campaign posters, some groups have endorsed Okonjo-Iweala and Amina Mohammed for the position of President and Vice-president respectively.\nHowever, the WTO DG, Okonjo-Iweala and Amina Mohammed are yet to react to photos spreading online as at time of filing this report."
  },
  {
    "headline": "I Never Received Salary, Don’t Know How Much Senators Earn — Okorocha",
    "summarized_story": "This was despite the fact that the philanthropist claimed he did not get a salary from the Imo State Government during his eight years as Governor.\nEven as a Governor of Imo State, I didn’t draw a penny for the years I spent.\nOne thing about public funds is that, if you don’t work for it, don’t collect it because it has spiritual implications”, Okorocha told the Journalists.\nSpeaking further on the basic salaries and allowances of Senators, Okorocha said, “I don’t know how much a Senator earns.\nThe NUJ presented Senator Okorocha with the icon of humanitarian award in recognition of his services to the emancipation of Nigerian children through his foundation."
  },
  {
    "headline": "Rivers Prophetess Dies Two Days After She Was Sentenced To Life Imprisonment",
    "summarized_story": "Edna Worleru, a prophetess who was convicted and sentenced to life imprisonment by a high court in Rivers State last week Thursday, has died.\nJustice Adolphus Enebeli sentenced her to prison, and she died while serving her sentence.\nChidi Ekeh, the state prosecutor’s office, verified the prophetess’ death on Monday, saying she died last week Saturday following a brief illness.\nThe deceased’s body, however, remained the property of the federal government and could not be released to the family, according to the lawyer.\nShe hasn’t been discharged, she will still serve her prison term even in death.”"
  },
  {
    "headline": "N50m suit against Ethiopian Airlines gets Nov 2 date",
    "summarized_story": "A Federal High Court in Abuja has adjourned till November 2, 2021 the continuation of trial in the N50 million suit filed against Ethiopian Airlines over lost of luggage with items worth $13, 550.\nThe plaintiffs are also praying the court to award the sum of N50 million as exemplary damages against the Ethiopian Airlines for the inconveniences they suffered and denial of the use of items occasioned by the Airlines’ action and commission.\nThat their luggage were checked-in by the Airlines and tags were dully issued them after staff of the Airlines confirmed the content and that upon arrival, it was discovered that some of their luggage could not be found at the luggage discharge belt.\nThey held that the Airlines handle passengers’ luggage with utmost care and deligence and added that plaintiffs’ claims are not in accordance with the laws governing international transportation by Air.\nThe, trial Judge, Justice Donatus Okorowo has since adjourned the matter till November 2, 2021 for continuation of trial after taking the evidence of the first plaintiff."
  },
  {
    "headline": "Breaking: Lagos joins Ondo, Osun, Enugu, others to sign anti-open grazing bill into law",
    "summarized_story": "Governor Babajide Sanwo-Olu has signed the bill prohibiting the practice open grazing in Lagos state.\nThe governor assented to the bill at the Lagos House on Monday, adding to the list of states, including Delta, Enugu, Ebonyi, Ondo Osun amongst others where the law is already in place after the 17 governors of the South under the aegis of Southern Governors Forum (SGF), pegged August 31.\nDetails loading…"
  },
  {
    "headline": "Pictures: IGP tours Kaduna-Abuja highway, vows to ensure security of lives, property",
    "summarized_story": "In his quest at ensuring all round security along the Kaduna-Abuja highway, the Inspector General of Police, IGP Alkali Baba Usman, on Monday, took a tour of the nipping points.\nThe IGP was warmly received by the Commissioner of Police, Kaduna State Command, DC Operations Kaduna Command and all other tactical commanders of the command.\nSubsequently, the CP went along with the AIG and all nipping points were assessed.\nHe expressed confidence that with what he saw on ground, committees plying the highway should be rest assured that no criminal elements will have the effontry to lay siege on the highway.\nHe however, tasked the general public to be vigilant and not to hesitate to report to security agencies g any suspicious movements noticed along the highway, for prompt action."
  },
  {
    "headline": "FG expresses satisfaction over hitch-free 2021 WASSCE conducts -NigPilot",
    "summarized_story": "The federal government has lauded the conduct of the ongoing 2021 West African Senior School Certificate Examinations WASSCE, describing it as peaceful and stress-free.\nHe said, “We are very pleased that all around the country, exams are going on peacefully.\nThe Permanent Secretary who disclosed that over 1.57 million candidates are currently sitting for the 2021 WASSCE, across Nigeria, also expressed satisfaction over the low level of malpractice recorded in this year’s examination exercise.\nEchono further disclosed that the Federal government is addressing incidences and cases of examination malpractices already recorded during Tertiary admission exams and would arrest any person found culpable.\n“We are pursuing very hard more cases, incidence or possibilities of examinations malpractice we have a zero tolerance for examinations malpractice, we punish and arrest any person found culpable and ensure that immunity is restored to our system,” he said."
  },
  {
    "headline": "Miners’ association laments invasion of mining sector by foreigners, non members -NigPilot",
    "summarized_story": "Miners’ Association of Nigeria , MAN, has decried the rising trend of foreign nationals invading mining communities in the country also stating that rich miners in the country were not members of the association.\nHe said that a low level of technology, inadequate manpower, and invasion of mining communities has led to the increasing loss of revenue in the sector.\nThe Miners’ association president further explained that ninety-nine percent of rich miners in the country were not members of the Association.\nHe attributed the challenges of curbing illegal mining to connivance of illegal miners with security officers, lack of adequate manpower, low level technology and invasion of mining communities.\nThe mandate was sequel to a motion on illegal mining and smuggling of gold in the country brought by Senator Orji Uzor Kalu."
  },
  {
    "headline": "Consortium of lawyers, ethnic youth leaders, CSOs chide Washington Post -NigPilot",
    "summarized_story": "“Out of the five questions Mr. Whoriskey inquired about, question 1 has been resolved by a competent court of law in Nigeria and the decision widely publicized.\nA simple internet search would have availed Mr. Whoriskey of the judgment of the case and the present state of affairs.\nIn answering the allegations against Mr. Peters, the groups claimed that “Mr.\nHe has severally denounced any such attempt to link the purchase of his property with Dieziani under such premises.\nNo furniture that belonged to him can be found at any other place other than in his property."
  },
  {
    "headline": "Guinea Coup: ECOWAS to impose travel ban, freeze financial assets -NigPilot",
    "summarized_story": "This is part of the resolutions reached the Extraordinary Session the Authority of Heads of State and Government of ECOWAS held in Accra, Republic of Ghana.\nOther decisions at the Extraordinary Session include: “To uphold the suspension of Guinea from all ECOWAS governing bodies until the restoration of constitutional order.\n“To ensure the conduct of presidential and legislative elections within six (6) months in order to restore constitutional rule in the Republic of Guinea.\nThese sanctions would include travel ban on such persons and their family members and the freezing of their financial assets.\nThey instructed thePresident of the ECOWAS Commission to compile and submit a list of such persons and groups of persons."
  },
  {
    "headline": "COVID-19: 20% Of Full-Time Nigerian Workforce Lost Employment In 2020 – Report",
    "summarized_story": "At least 20 per cent of the full-time workforce in Nigeria lost employment during the COVID-19 pandemic in 2020, a new report released on Tuesday has revealed.\nThe report tagged ‘The Impact of COVID-19 on Business Enterprises in Nigeria’, was jointly released by the United Nations Development Programme (UNDP) and the National Bureau of Statistics (NBS).\nBased on in-depth interviews with almost 3,000 businesses from both formal and informal sectors across major industries of the economy, the report assesses the impact of COVID-19 on business enterprises in the country.\n“While there have been promising signs of recovery this year, COVID-19 has had an outsized socio-economic impact on Nigeria,” it said.\nIn addition, the report revealed that one in three business enterprises surveyed indicated that some businesses have permanently closed due to operational challenges resulting from the pandemic."
  },
  {
    "headline": "One Person Killed As Building Collapses In Akure",
    "summarized_story": "An elderly woman died on Tuesday morning in Akure after a building partially collapsed in the Ondo State capital.\nChannels Television crew visited the scene later after the incident occurred in Akure South Local Government Area of the state.\nREAD ALSO: Nigeria Is Not Interested In Naming, Shaming Terrorism Sponsors – PresidencyAccording to eyewitnesses, the occupants of the building were thrown into panic when part of the building caved in at about 3am while most of them were fast asleep.\nBut seven other persons, who also live in the house, were rescued by neighbours who raced to the scene of the incident.\nWhile police authorities in Ondo have yet to make an official statement regarding the incident, the body of the woman killed was moved to the morgue by policemen at the scene."
  },
  {
    "headline": "‘Failed’ Coup Attempt Reported In Sudan",
    "summarized_story": "A coup attempt in Sudan “failed” early Tuesday, state media reported, as the country grapples with a fragile transition since the 2019 ouster of longtime President Omar al-Bashir.\nTop military and government sources told AFP that the attempt involved a group of officers who were “immediately suspended” after they “failed” to take over the state media building.\n“There has been a failed coup attempt, the people should confront it,” state television said, without elaborating.\nThe government, led by Prime Minister Abdalla Hamdok, has vowed to fix the country’s battered economy and forge peace with rebel groups who fought the Bashir regime.\nOn Monday, demonstrators blocked key roads as well as the country’s key trade hub, Port Sudan, to protest the peace deal signed with rebel groups last year."
  },
  {
    "headline": "Terrorism: Nigeria Is Not Interested In Naming, Shaming Anybody – Presidency",
    "summarized_story": "The Special Adviser to the President on Media and Publicity, Femi Adesina, says the Nigeria Government is not interested in naming and shaming sponsors of terrorism.\n“Naming and shaming will not be the motive, bringing malefactors to justice will be it,” he said.\n“Nigeria is not interested in naming and shaming anybody.\n“You don’t first call people before the court and start looking for evidence against them later.\nHis remarks come four months after the Federal Government said it had begun profiling for prosecution, well-placed Nigerians suspected to be financiers of terrorism in the country."
  },
  {
    "headline": "Wike Slams Critics Over VAT Collection Dispute",
    "summarized_story": "Rivers State Governor, Nyesom Wike, has slammed those criticising him for the decision of the state government to challenge the legality of the Federal Inland Revenue Service (FIRS) to collect Value Added Tax (VAT).\nHe believes Nigeria must encourage federating states to harness their resources and generate revenues, including VAT to advance their development.\nHe said rather, such a governor should commend Rivers State government for seeking to entrench fiscal federalism and constitutionalism.\nGovernor Wike raised an alarm over attempts to frustrate Rivers and other states to actualise the constitutional provisions that empowered them to harness their resources and revenues, particularly VAT.\nHe explained that beyond the provision of infrastructure, his administration was seeking a law that would provide comfortable accommodation for judicial officers on retirement."
  },
  {
    "headline": "Police arrest 2 ritual killers in Kwara with human parts",
    "summarized_story": "2 persons have been arrested in Offa by the Kwara state command of the Nigeria Police Force for allegedly killing a young girl, Rianat Yusuf for money ritual purpose.\nThe suspects, Femi Adeniji and Shittu Wale were said to have confessed to killing young Rianat.\nThe girl was said to have been sent on an errand around Amuyo area of Offa before she was allegedly abducted by the suspects who eventually killed and severed her body parts for money ritual.\nTwo suspects were later arrested in the same area while one is at large.\nThe Kwara state police public relations officer, SP Ajayi Okasanmi explained that the suspect will be charged to court after the conclusion of investigation."
  },
  {
    "headline": "Nigeria's Unity is unshakeable, we will prevail",
    "summarized_story": "The Federal Government says Nigeria’s resolve to remain as one indivisible entity is unshakable, in spite of the various challenges facing the nation.\nMinister of Information and Culture, Lai Mohammed, stated this in Abuja at the opening of the ‘Nigeria at 60 Photo Exhibition’ with the theme “60 Years of Our Togetherness.”According to the minister, the exhibition captures six decades of Nigeria’s independence, footprints of Nigeria’s political leaders, and 60 years of the labour of the heroes past in ensuring the country’s unity and peace.\nHe explained that the exhibition was to tell Nigeria’s 60-year story in pictorial form, delivering a photographic presentation of the nation’s icons.\nMr. Mohammed said the exhibition also captured ancient and modern fashion/attires/hairstyles, Nigerian cuisine, tourist attractions, festivals, as well as Nigerians in Diaspora and their achievements.\nThe exhibition, which is expected to run for three days at the National Press Centre in Abuja, was declared open by the Secretary to the Government of the Federation, Boss Mustapha."
  },
  {
    "headline": "End SARS: We suspended sitting to focus on review",
    "summarized_story": "The Lagos Judicial Panel of Inquiry on the October 20, 2020 Lekki Toll gate shooting, as well as SARS-related abuses, said its announcement of temporary suspension of public hearings is for the purpose of focusing on the Lekki Investigation.\nin a statement, the panel said this investigation on the alleged shooting of protesters last October is crucial as it impacts other matters emanating from it.\nThe panel said as soon as this is done, the panel will resume hearings and take as much cases as it can within the time limit.\nThe panel of enquiry announced during it’s last sitting on Saturday that, it will suspend further sittings for now.\nTVC News gathered that, during the break, the panel will “evaluate, collate and make findings” regarding the Lekki shooting."
  },
  {
    "headline": "We Requested FG's Communications Blockade",
    "summarized_story": "Sokoto State Governor, Aminu Tambuwal, has disclosed that the State is in partnership with the Ministry of Communications and Digital Economy to block services of telecommunications operators in 14 local government areas of the state.\nThis move by the State Government is coming about 3 weeks after it approved an Executive Order in response to the situation of insecurity in the Eastern flank of Sokoto state.\nThe areas affected by the Executive Order include: Gada, Goronyo, Gudu, Ilela, Isa, Kebbe and Sabon Birni.\nThe remaining are: Shagari, Rabah Tambuwal, Tangaza, Tureta and Wurno local government areas.\nIn addition to these local government areas, Dange Shuni local government area will also be affected by the latest communications blockade, bringing the number of LGAs affected to 14."
  },
  {
    "headline": "Russia Behind Litvinenko Murder, European Rights Court Rules",
    "summarized_story": "Russia was responsible for the killing of Alexander Litvinenko, the European Court of Human Rights (ECHR) has found.\nThe UK inquiry said former KGB bodyguard Andrei Lugovoi and another Russian, Dmitry Kovtun deliberately poisoned Mr Litvinenko by putting the radioactive substance into his drink.\nLitvinenko’s widow, Marina, took the case against Russia to the Strasbourg-based rights court, which has agreed with the UK inquiry’s conclusion.\n“The Court found in particular that there was a strong prima facie case that, in poisoning Mr Litvinenko, Mr Lugovoi and Mr Kovtun had been acting as agents of the Russian state,” the ECHR ruled.\nBoth Mr Lugovoi and Mr Kovtun have denied any involvement in the killing."
  },
  {
    "headline": "No More Open Grazing in Lagos as Governor Sanwo-Olu Signs Bill into Law",
    "summarized_story": "Eleven days after the House of Assembly passed the bill prohibiting open grazing of cattle in Lagos, the State Governor, Mr. Babajide Sanwo-Olu on Monday has signed it into law.\nWith the signing of the anti-open grazing law, it is now criminal in Lagos for herdsmen to occupy unapproved public areas and private land with their livestock for grazing.\nThe signing of the anti-open grazing law by the governor followed the decision of Southern Governors’ Forum last August, setting the September deadline to pass the law across member states.\nAlthough farmer-herder crisis is not pronounced in Lagos, the anti-open grazing law is expected to prevent the spillover of the menace into the state.\nThe governor and members of the state’s cabinet wore attire with purple shades to support the campaign against sexual violence."
  },
  {
    "headline": "Coup Attempt Fails in Sudan, State Media Says",
    "summarized_story": "The government in Sudan says it has thwarted an attempted military coup.\n“There has been a failed coup attempt, the people should confront it,” state media reported on Tuesday.\nThe plotters had tried to take over the state media building, AFP news agency reports.\nVideo on social media appears to show armoured vehicles on city streets, and the AFP news agency reports that traffic now appears to be flowing smoothly in central Khartoum.\nAccording to Reuters news agency, military spokesman Mohamed Al Faki Suleiman says the interrogation of suspects will soon begin."
  },
  {
    "headline": "Nigeria: Your Utterances are Reckless, Careless, Southern/Middle Belt Alliance Tells NEF",
    "summarized_story": "But the Southern and Middle Belt Alliance (SaMBA) dismissed the NEF spokesman’s claim as both reckless and careless.\nSaMBA, in a statement by its spokesman, Rwang Pam Jnr, said the statement purportedly made on behalf of NEF, lacked basis.\nBaba-Ahmed had on Saturday said the North was in the process of rebuilding itself and was not prepared to play second fiddle in a nation, where it enjoyed numerical strength.\nBaba-Ahmed stated, “We will lead Nigeria the way we have led Nigeria before, whether we are president or vice president, we will lead Nigeria.\n“Rather than boasting of numerical strength to win election, NEF should look for ways to turn the numerical strength to productivity."
  },
  {
    "headline": "Covid-19: Lagos Targets 30% Vaccination in One Year",
    "summarized_story": "Lagos State Governor Babajide Sanwo-Olu has said the state aims to vaccinate 30 per cent of its population within one year.\nAt the current rate, it would take about three years to achieve our herd immunity target.\n“One of the objectives of attaining herd immunity is to prevent mutations from emerging leading to more aggressive strains.\n“With our approach, we expect to vaccinate 30 per cent of the population of Lagos within one year.\nThis will put us on a better and more sustainable path towards herd immunity."
  }
]