[
  {
    "headline": "Second-hand pants, bras can cause fungal, other infections –Dermatologist",
    "summarized_story": "According to the dermatologist, wearing second-hand pants and bras can cause fungal infections or mite infestation, and lice.\nA healthy vagina contains bacteria and some yeast cells but when the balance of bacteria and yeast changes, the yeast cells can multiply.\n“Purchasing second-hand clothes is on the rise possibly due to the current socio-economic situation in the country.\nThey concluded that “diverse potential pathogens were isolated from the second-hand clothes with bed sheet and panties been the one with the highest microbial count for bacteria and fungi respectively.\nThough the use of detergents in re-washing the fairly used wears reduced the microbial load, it never removed them totally."
  },
  {
    "headline": "Second-hand pants, bras can cause fungal, other infections –Dermatologist",
    "summarized_story": "According to the dermatologist, wearing second-hand pants and bras can cause fungal infections or mite infestation, and lice.\nA healthy vagina contains bacteria and some yeast cells but when the balance of bacteria and yeast changes, the yeast cells can multiply.\n“Purchasing second-hand clothes is on the rise possibly due to the current socio-economic situation in the country.\nThey concluded that “diverse potential pathogens were isolated from the second-hand clothes with bed sheet and panties been the one with the highest microbial count for bacteria and fungi respectively.\nThough the use of detergents in re-washing the fairly used wears reduced the microbial load, it never removed them totally."
  },
  {
    "headline": "Ondo makes COVID-19 vaccine compulsory for civil servants",
    "summarized_story": "The Ondo State Government has vowed to enforce the no vaccination card, no access to its offices.\nMr. Segun Odusanya, Permanent Secretary, Ministry of Local Government and Chieftaincy Affairs, disclosed this on Wednesday at a meeting with the staff of the Ministry in Akure.\nHe said the presentation of the COVID-19 vaccination card has become a compulsory requirement for civil servants as workers go to their workplaces from November 1.\n“The directive would be enforced as from Nov.1 with compliance to all the COVID-19 protocols by the civil servants in the state.\nHe said the enforcement has become imperative due to the ravaging effects of the pandemic and its attendant morbidity."
  },
  {
    "headline": "Ondo makes COVID-19 vaccine compulsory for civil servants",
    "summarized_story": "The Ondo State Government has vowed to enforce the no vaccination card, no access to its offices.\nMr. Segun Odusanya, Permanent Secretary, Ministry of Local Government and Chieftaincy Affairs, disclosed this on Wednesday at a meeting with the staff of the Ministry in Akure.\nHe said the presentation of the COVID-19 vaccination card has become a compulsory requirement for civil servants as workers go to their workplaces from November 1.\n“The directive would be enforced as from Nov.1 with compliance to all the COVID-19 protocols by the civil servants in the state.\nHe said the enforcement has become imperative due to the ravaging effects of the pandemic and its attendant morbidity."
  },
  {
    "headline": "National Youth Games: Okowa felicitates with Team Delta on record-breaking 6-time win",
    "summarized_story": "Team DeltaDelta State Governor Dr. Ifeanyi Okowa, on Wednesday congratulated Team Delta on its great feat of winning the just-concluded 6th National Youth Games (NYG) for the sixth time.\nHe congratulated the athletes, their coaches and the management of Delta State Sports Commission on the great record, describing it as “stunning and unprecedented“.\nIn the 2021 edition, which held in Ilorin from Oct. 10, 2021 to Oct. 19, 2021, Delta came first with 114 medals – 60 gold, 26 silver and 28 bronze.\nLagos State emerged second with a total of 72 medals comprised of 19 gold, 25 silver and 28 bronze.\nEdo finished third, winning 40 medals – 18 gold, 10 silver and 12 bronze."
  },
  {
    "headline": "#EndSARS: Foundation laments failure of govt to address demands",
    "summarized_story": "“An unprecedented turnout of youths took to the streets nationwide to save their beloved country from the consequences of leadership deficit.\nThe Nigeria Police Force became a tool to channel the grievances and disgust on how this country is run.\nLooking at the demands of the youths, not only did they demand police reforms but also called for a stop to bad governance.\nThe voice of civil rights groups, social and political commentators and human rights activists must be taken serious.\n“Nigeria is very fragile and the youths are determinants of the way forward, if not well handled, will be catastrophic."
  },
  {
    "headline": "Ansu Fati signs 6-year Barca deal with €1bn buyout clause",
    "summarized_story": "Barcelona’s teenage forward Ansu Fati has signed a contract extension that includes a 1bn euro (£846m) buyout clause.\nThe 18-year-old, who is wearing Lionel Messi’s number 10 shirt this season at the Nou Camp, helped Barca to a 1-0 win against Dynamo Kyiv in the Champions League on Wednesday night.\nFati is the second Barca player in a week to sign a new deal with a 1bn euro buyout clause, following Pedri, 18.\nFati has played 47 first-team games for the club, scoring 15 goals.\nHe became the second-youngest Barca player when he made his debut for the club aged 16 years and 298 days and is the club’s youngest scorer in La Liga."
  },
  {
    "headline": "Chelsea whip Malmo for 4, but pay with Lukaku, Werner injuries",
    "summarized_story": "Chelsea put their Champions League campaign back on course by thrashing Malmo at Stamford Bridge.\nBut it was victory at a price as strike duo Romelu Lukaku and Timo Werner suffered injuries.\nThe win, however, was overshadowed by those injuries to Lukaku and Werner.\nLukaku was hurt as he was brought down by Nielsen for Jorginho’s first penalty, seemingly taking the full weight of the Malmo player on his ankle.\nTuchel, though, must now hope Chelsea’s win does not come at too much of a cost as he awaits the medical bulletins on Lukaku and Werner."
  },
  {
    "headline": "Ronaldo scores winner, as Man Utd fight back against Atalanta",
    "summarized_story": "Cristiano Ronaldo headed the winner nine minutes from time as Manchester United came back from two goals down to record a memorable Champions League triumph against Atalanta at Old Trafford.\nOle Gunnar Solskjaer’s side had been booed off at the break, such was the lack of invention they showed in falling behind to goals from Mario Pasalic and Merih Demiral.\nBut, inevitably, it was Ronaldo who won the game, just as he did three weeks previously against Villarreal.\nHowever, the home fans at least made their feelings known before kick-off with a long rendition of ‘Ole’s at the wheel’, before the familiar ‘Ole, Ole, Ole’ chant rang round Old Trafford.\nThe problem for Solskjaer is that the managing bit has not been going well at all."
  },
  {
    "headline": "Strike: Cross River orders workers to return to work or risk sanctions",
    "summarized_story": "The Cross River State Government has directed all civil servants in the state to resume work Thursday, October 21, 2021, by 8am, or be sanctioned.\nReacting, the state chairman of NLC, Comrade Ben Ukpebi, said the strike action will continue irrespective of the NIC order.\nWe are going to court tomorrow to also obtain a Stay of Execution order.\nWhy should they force workers to return to work when the court order is not yet in their hands until tomorrow?\nOur strike action will continue.”"
  },
  {
    "headline": "Nnamdi Kanu: Panic buying in Owerri over IPOB’s sit-at-home order",
    "summarized_story": "Prices of items in Owerri, Imo State capital, have gone up astronomically as residents engaged in panic buying ahead of the arraignment of Mazi Nnamdi Kanu, leader of Indigenous People of Biafra, IPOB, on 21 October.\nRecall that a faction in IPOB had said Thursday is the only day its members should exercise sit-at-home to honour its leader, Kanu, as he is expected in court.\nAn onions trader at Eke Ukwu Owerri, Musa Ibrahim, said the rush had caused the cost of food items to go up astronomically in the market.\n“I don’t know what will happen on Thursday and people are buying food items to stock their kitchens,” he said.\nPanic buying in Awka over IPOB’s sit-at-home order"
  },
  {
    "headline": "End SARS: Youths in Port Harcourt hold candlelight procession",
    "summarized_story": "Hundreds of youths in Port Harcourt, the Rivers State capital, on Wednesday, staged a candlelight procession in commemoration of those who lost their lives during the End SARS protest of last year.\nThe youths converged around the popular Waterlines junction around 4pm to begin their protest.\nSome of the protesters carried placards with various inscriptions like “no protester will die in vain under our watch”.\nOn Wed, Oct 20, 2021 at 8:00 PM ‘Ned Iwunna’ via DPNigeria Staffposts <[email protected]> wrote:ENDSARS: Youths in Port Harcourt hold candle light processionHundreds of youths in Port Harcourt, the Rivers state capital on Wednesday stage a candle light procession in commemoration of the one year anniversary of those who lost their lives during the ENDSARS protest of last year.\nThe youths converged around the popular waterlines junction around 4pm to begin their protest."
  },
  {
    "headline": "Dozens of rescued Chibok girls begin academic programmes at AUN",
    "summarized_story": "About 50 Chibok girls who were abducted from the school hostel in 2014 and rescued in 2016 have been admitted for various academic programmes at the American University of Nigeria, (AUN), Yola, Adamawa State.\nThe girls have started a foundation programme in the university on the Federal Government of Nigeria’s scholarship programme, which was promised to them when they were first rescued.\nIn a statement by the Director of Communication, Mr. Can Okereke on Wednesday, which was obtained by DAILY POST, 57 of the girls have commenced various programmes having joined other matriculating students to start their first year in the school.\nThe school tasked the girls and other students to brace up for the American-style of education, saying that they were meant to find solutions to many challenges of the global society“Whether it is climate change, challenges to our very health, threats of violence, injustice, desertification, inequality, poverty, pollution, tyranny, all our problems are man-made and so are the solutions,” Ensign stated.\n“The American University of Nigeria has just held this year’s annual Convocation and Pledge Ceremony, which included fifty-seven of the rescued “Chibok Girls,” now young women and first-year university students”."
  },
  {
    "headline": "Biafra: Afenifere knocks FG over amended charges against Nnamdi Kanu, double standard",
    "summarized_story": "The pan Yoruba socio-political organization, Afenifere, on Wednesday, described the amended charges against the embattled leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, as an exercise in futility.\nAccording to the group in a statement issued by Sola Ebiseni, its General-Secretary, with the amended charges, it appeared that the federal government had come to its wit’s end in the case with the separatist group leader.\nEbiseni in the statement who stressed that the government had been engaging in petty politicking over the trial, stated that Attorney-General of the Federation, Abubakar had not taken his duty as the Chief Law Officer and Adviser of the federal government with utmost seriousness.\nThe Yoruba group also alleged that the Minister of Communications, Isa Pantami, who had made inciting statements had never been investigated but the government had been exercising unnecessary energy on Kanu.\nThe statement partly read “Without prejudice to the determination of the case by the Court it is clear that its end will certainly compound agitations on the national question, an ill-wind that will blow the Buhari administration and Nigeria no good."
  },
  {
    "headline": "PDP Govs endorse Anyanwu as consensus National Secretary",
    "summarized_story": "Indications emerged on Wednesday that Governors elected on the platform of the Peoples Democratic Party (PDP) have endorsed Senator Samuel Anyanwu as consensus candidate for the position of National Secretary ahead of the party’s October 30-31 national convention.\nAnyanwu was on Wednesday sighted at the meeting of the Governors with the National Chairman designate, Dr Iyorchia Ayu.\nThe meeting, which was held at the Akwa Ibom Governor’s Lodge, Asokoro, Abuja, was believed to have ratified Anyanwu’s candidature as National Secretary.\n- Advertisement -Sokoto Governor Aminu Tambuwal explained away Anyanwu’s presence when a journalist sought to know his mission at the meeting.\nHowever, the fate of Prince Olagunsoye Oyinlola, Prof Adewale, and Toafeek Arapaja, the three candidates vying for the position of Deputy National Chairman (South) remained unknown."
  },
  {
    "headline": "PHOTOS: Former Ekiti Gov Fayose boards Okada to beat Lagos traffic for a flight",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "UCL: Bayern Munich defeat Benfica 4 – 0",
    "summarized_story": "Bayern Munich scored four goals in the final 20 minutes to beat Benfica and move five points clear at the top of their Champions League group.\nLeroy Sane got two of the goals, opening the scoring with a brilliant free-kick before firing home a fourth.\nIt was frustrating for Benfica, who had earlier forced two excellent saves from Manuel Neuer.\n- Advertisement -But the floodgates opened for Bayern after Sane’s excellent 70th-minute free-kick as the dramatic finish left Benfica stunned.\n- Advertisement -Benfica are second on four points while Barcelona are third on three points after recording their first win in the competition by beating bottom-of-the-table Dynamo Kyiv earlier on Wednesday."
  },
  {
    "headline": "UCL: Barca beat Dynamo Kyiv 1 – 0",
    "summarized_story": "Gerard Pique scored Barcelona’s first Champions League goal this season as Ronald Koeman’s side beat Dynamo Kyiv to end their losing start to Group E.Pique volleyed in a superb opener from Jordi Alba’s cross as the hosts found the net in Europe for the first time in more than four and a half hours.\nBarcelona were comfortable, if not clinical, and success keeps their hopes of reaching the knockout stage alive.\nBarcelona headed into this fixture on the back of 3-0 defeats by Bayern and Benfica, managing just one shot on target in total.\n- Advertisement -Sergino Dest earlier headed over and Ansu Fati wasted a good chance to double his side’s lead, before Sergio Aguero was brought on for his first Champions League appearance for the club.\nBut the best chance that fell the former Manchester City striker’s way in his 15-minute cameo was a speculative long-distance effort that struck a defender."
  },
  {
    "headline": "FG has failed to resolve police brutality –Saraki",
    "summarized_story": "Saraki disclosed this yesterday in a statement titled, “We Must Never Forget #EndSARS,” remembering the events of the Lekki tollgate shooting a year ago.\nHe added that his thoughts and prayers are with those who lost their lives and sustained injuries in Lagos and around the country.\n“None of the policemen accused of torturing and extrajudicially murdering Nigerian citizens has been brought to justice.\n“This is the only way we can honour the memory of those who gave their lives for this cause,” he said.\nGod’ll avenge killing of innocent Nigerians –OyedepoFaith Oyedepo, wife of General Overseer of Winners Chapel, Bishop David Oyedepo, said God will avenge the death of innocent Nigerians killed during the #EndSARS protests."
  },
  {
    "headline": "Bandits abduct 13 passengers in Niger",
    "summarized_story": "From John Adams MinnaArmed bandits said to be numbering about 50 abducted no fewer than 13 passengers on board a bus belonging to the Kebbi State Mass Transport Authority, yesterday afternoon, along the notorious Zungeru-Tegina road.\nThe incident occurred at Garin-gabas village, near Zungeru in Wushishi Local Government Area of Niger State.\nA source close to the community told Daily Sun that the bandits struck at about 2pm when the three vehicles were heading towards Minna the Niger state capital.\nAn eyewitness, who escaped from the scene of the incident, said the bandits surrounded the passengers and forced them into the forest where they are presently being kept.\nHe explained that on getting to Konar Barau sharp bend in Rafi LGA along Tegina Minna road, suspected bandits in military uniform kidnapped 13 of his passengers and his motor boy."
  },
  {
    "headline": "Imo monarchs’ killing: We’re not informed about meeting –Police",
    "summarized_story": "The Imo State Police Command has accused the Estern Security Network (ESN) and the Indigenious People of Biafra (IPOB) of killing two monarchs at a stakeholders meeting, on Tuesday, at the Njaba Local Government Council in the State.\nThe police, however, blamed the local government council for not informing it about Tuesday’s meeting.\nThis assertion was made in Owerri, yesterday, by the state Commissioner of Police, Mr Rabiu Hussaini.\n“When the command got wind of the attack, the commissioner of police mobilised the command’s tactical unit to the meeting venue to foil the attack.\n“It was at where the Transitional Chairman of Njaba Local Government Council, Mr Emeka Ihenacho, was holding meeting with some transitional rulers."
  },
  {
    "headline": "Nigeria, Turkey sign 8 agreements on energy, defence, mining, others",
    "summarized_story": "From Juliana Taiwo-Obalonye and Aidoghie Paulinus, AbujaNigeria and Turkey, yesterday, signed eight major memorandum of understandings (MoUs) on key sectors, including energy, defence, mining and hydrocarbons with the implementation to commence immediately.\nPresident Muhammadu Buhari made the disclosure at a joint press conference on the occasion of the official visit of Turkish President, Recep Tayyip Erdogan to Nigeria.\nAs a positive outcome, eight major agreements/MoUs on a number of key sectors, including eEnergy, defence industry, mining and hydrocarbons were signed today (yesterday).\nBuhari praised Erdogan for opening his country’s borders to accommodate millions of refugees in dire need of humanitarian support.\nPresident Buhari described the two-day visit of President Erdogan and the First Lady, Emine, as a reflection of the ‘robust, warm and cordial bilateral relation’ between Nigeria and Turkey."
  },
  {
    "headline": "Nigeria, Turkey sign 8 agreements on energy, defence, mining, others",
    "summarized_story": "Nigerian President Muhammadu Buhari made the disclosure at a joint press conference on the occasion of the official visit of Turkish President Recep Tayyip Erdogan to Nigeria.\nPresident Buhari heaped praises on Erdogan for opening his country’s borders to accommodate millions of refugees in dire need of humanitarian support.\nYou have indeed set an example to the rest of the world,’ President Buhari said.\nIn his remarks, President Erdogan stressed that Turkey was determined to improve relations with Nigeria to ‘higher levels on all fields’.\nPresident Erdogan expressed delight that many Nigerian students are currently studying in Turkey and benefiting from scholarships."
  },
  {
    "headline": "Yield Africa Foundation Trains 650 Youth, Women on Soft Skills",
    "summarized_story": "Ugo AliogoYield Africa Foundation has trained 650 youths and women on different soft skills under a free skills acquisition programme.\nA statement made available to THISDAY by the Executive Director, Yield Africa Foundation, Olatunde Martins said the free skills acquisition programme is in partnership with the United Nations Development Programme (UNDP) vocational Education Training Centre in Oshodi-Isolo Local Government Area of Lagos state.\nThe statement said the programme which started on October,6 and ended on 18 of this month.\nThe statement hinted that the programme is set to benefit many unemployed graduates, secondary school leavers, and women.\nThe beneficiaries commended the foundation for giving them the opportunity to learn the skills of their choices without paying for the training and provision of materials."
  },
  {
    "headline": "In Three Months, Bandits Killed 343 People, Abducted 830 Others in Kaduna",
    "summarized_story": "In the last two quarters between January to June, a total of 545 people were killed while 1,723 others were abducted by bandits.\nAruwan said in the latest report, the Southern Kaduna Senatorial district recorded the highest number of death with 193 while Kaduna Central and Kaduna North Senatorial Districts recorded 130 and 20 deaths respectively.\n“Southern Kaduna Senatorial District recorded 51 kidnapped persons, with Kachia LGA reporting the highest number of 28.\n“We in the Kaduna State Government, have always aligned with the declaration of bandits as insurgents and terrorists.\n“This is the view of the Kaduna State Government”, he said."
  },
  {
    "headline": "News in Photographs: Buhari, Erdogan Meet in State House",
    "summarized_story": "President Muhammadu Buhari Wednesday met with Turkish President Recep Tayyip Erdogan at the State House, Abuja.\nThe two leaders held bilateral talks behind closed-doors during which they considered about 24 agreements and Memoranda of Understanding (MOU) between the two nations.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "#EndSARS: Sanwo-Olu Brokers Truce with Youths, Promises Not to Give Up Belief in Them",
    "summarized_story": "Sanwo-Olu, who attended the peace forum, listened as the youths led conversation on how they could effectively channel their grievances to the authorities.\nSanwo-Olu said, “Today is a day of reconciliation and it is about our teeming youths.\n“This event is about aggregating all the conversations of the millions of youths that have been represented here.\nSecretary to Delta State Government (SSG), Chief Patrick Ukah, revealed this in a statement in Asaba.\nUkah said the decision to mitigate the pains suffered by some of the victims was based on the consideration of the report by the judicial panel of inquiry."
  },
  {
    "headline": "Military Deploys Helicopter Gunships Against Bandits in Kaduna, Decimates 50",
    "summarized_story": "•El-Rufai to troops: Let’s sustain momentum•Says more bandits must be brought to bitter endJohn Shiklam in Kaduna and Kingsley Nwezeh in AbujaThe Nigerian military, yesterday, pounded bandits in Kaduna forests with helicopter gunships, neutralising 50 and destroying many of their hideouts.\nKaduna State Governor Nasir El-Rufai hailed the renewed onslaught against banditry and kidnapping in the state.\nEl-Rufai appealed to the security forces to sustain the momentum and bring more bandits to their “bitter end”.\nFleeing bandits within the surrounding forests were followed up and engaged by ground forces.\n“In maintaining presence for an effective annihilation of the bandits, a second helicopter gunship came overhead the location in dogged support of the ground forces."
  },
  {
    "headline": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
    "summarized_story": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19."
  },
  {
    "headline": "President Donald J. Trump’s Concession Speech, By Rudolf Okonkwo",
    "summarized_story": "The first time I ran for office, I ran for president.\nI have shown you that everything is possible if you have the right man to do the right job.\nThanks to me, they will grow up knowing that ours is a Christian nation where it is allowed to say Merry Christmas.\nTell those terrible lowlifes that they have proved themselves unworthy of Donald Trump’s genius and have opted to reduce America to a Second Class nation in the world.\nYours truly,President Donald J. TrumpThe 45th President of the United States."
  },
  {
    "headline": "Bandits Free Niger State Monarch After 45 Days In Captivity, N10million Ransom",
    "summarized_story": "The Dodo of Wawa community, Niger State, Dr Mahmoud Ahmed Aliyu, has been freed by his abductors after spending 45 days in their captivity.\nHe was said to have been released at about 7:30pm on Tuesday after the payment of N10million ransom to the bandits.\nThe Wazirin Wawa, Alhaji Ja’afar Ibrahim Bio, confirmed the release of the traditional ruler to Daily Trust, on the telephone but declined comment on how much was paid to secure his release.\nIn a video shared by his family, the traditional ruler was seen in a white turban being welcomed by his family and members of the palace.\nAliyu was abducted in his palace by heavily armed men around 9pm on September 4."
  },
  {
    "headline": "The Teflon President With Nine Lives Is On His Way Out By Dr. Wumi Akintide",
    "summarized_story": "The Teflon President with nine lives I have in mind is nobody else but Donald J. Trump.\nIn cahoots with Trump, Republicans have not ended their campaign of calumny to humiliate, blackmail and delegitimize Barack Obama, the first black President.\nThe one-term young Senator from Illinois was elected President in 2008 and re-elected again in 2012 with a wider margin.\nThe voters concluded he had told a lie even though he was one of the most honorable and dependable men of honor ever to serve as American President.\nThe list goes on and on without end but Donald Trump is still there despite an abysmal approval opinion of only 33 percent or less."
  },
  {
    "headline": "Erdogan: Terrorists behind Turkey's failed coup operating illegally in Nigeria",
    "summarized_story": "President Recep Tayyip Erdoğan of Turkey says the “terrorist organisation” behind the July 2016 failed coup in his country are operating illegally in Nigeria.\nThe Turkish president is in Nigeria on a two-day visit.\nAdvertisementErdogan had blamed the “Fethullah terrorist organisation (FETO)” for the incident, and described the failed coup as a victory for democracy in Turkey.\nThe terrorist organisations, the armed gangs, and the marine bandits are continuously active in Nigeria and the Nigerian authorities are continuously fighting against them.\n“The perpetrator of the heinous failed coup of July 15, FETO, is still illegally active in Nigeria."
  },
  {
    "headline": "Erdogan: Terrorists behind Turkey's failed coup operating illegally in Nigeria",
    "summarized_story": "President Recep Tayyip Erdoğan of Turkey says the “terrorist organisation” behind the July 2016 failed coup in his country are operating illegally in Nigeria.\nThe Turkish president is in Nigeria on a two-day visit.\nAdvertisementErdogan had blamed the “Fethullah terrorist organisation (FETO)” for the incident, and described the failed coup as a victory for democracy in Turkey.\nThe terrorist organisations, the armed gangs, and the marine bandits are continuously active in Nigeria and the Nigerian authorities are continuously fighting against them.\n“The perpetrator of the heinous failed coup of July 15, FETO, is still illegally active in Nigeria."
  },
  {
    "headline": "Osinbajo: Without public office, I wouldn’t have been able to make changes Nigeria required",
    "summarized_story": "Vice-President Yemi Osinbajo says without getting involved in politics, he would not have been able to make changes required to make the country better.\nAdvertisement“It took public office for me to be able to get the scale of change that is required to make a difference,” Osinbajo was quoted as saying.\n“Without public office, I would have remained a pressure group activist; I would have done some nice things, but I wouldn’t have been able to make the changes that my country required.\nI was part of several civil society groups at the time.\nI joined the first civil society group when I was 24, I was teaching at the time."
  },
  {
    "headline": "Osinbajo: Without public office, I wouldn’t have been able to make changes Nigeria required",
    "summarized_story": "Vice-President Yemi Osinbajo says without getting involved in politics, he would not have been able to make changes required to make the country better.\nAdvertisement“It took public office for me to be able to get the scale of change that is required to make a difference,” Osinbajo was quoted as saying.\n“Without public office, I would have remained a pressure group activist; I would have done some nice things, but I wouldn’t have been able to make the changes that my country required.\nI was part of several civil society groups at the time.\nI joined the first civil society group when I was 24, I was teaching at the time."
  },
  {
    "headline": "Nigeria recorded four incidents of piracy in 9 months, says NIMASA",
    "summarized_story": "The Nigerian Maritime Administration and Safety Agency (NIMASA) says the country reported four incidents of piracy in the first nine months of 2021.\nBashir Jamoh, director-general of NIMASA, said the reduction was reflected in the International Maritime Bureau (IMB) third-quarter 2021 report.\n“This represents a 77 percent decrease in incidents between 2021 and 2020, and 95 percent reduction from 2018.\nAdvertisement“The IMB also reported a 39 percent reduction in piracy and armed robbery incidents in the Gulf of Guinea (GoG).\n“We are delighted by this latest news from the IMB and the trend of progressive reduction in piracy and related incidents on our waters,” the NIMASA boss said."
  },
  {
    "headline": "Baxi acquisition deal sees MFS Africa expand footprint into Nigeria",
    "summarized_story": "As the largest fintech interoperability hub in Africa, MFS Africa connects banks, telcos, and money transfer operators across over 35 countries via a single integration point.\nCapricorn will be called MFS Africa but its core product, Baxi, retains its name.\nMFS Africa was founded in 2009 by Dare Okoudjou, a Beninese national, while Nigeria-born Abudu started Capricorn in 2014, with Folu Majekodunmi.\nThe acquisition creates a larger, more versatile company that fuses interoperability between money operators and a super-agent network reaching the mass market.\nMFS Africa will also expand Baxi’s proposition for offline SMEs to select markets within its footprint."
  },
  {
    "headline": "Editi Effiong: father, writer, producer and tech bro",
    "summarized_story": "When asked how he would define himself, he responded with, “I’m a father, writer, producer, and tech bro.\nThe big picture: Editi Effiong is not your average guyMany people know Editi Effiong as the brains behind Anakle.\nAnakle Films’ theatrical releases, Up North and The Setup, were acquired by Netflix in 2019 and 2020 respectively.\nIn 2011, digital marketing didn’t have as much clout as it does now.\nEspecially knowing that you were going to put a lot of time and effort into building out Anakle Films’ brand?"
  },
  {
    "headline": "Who’s afraid of crypto-salaries?",
    "summarized_story": "Back in 2015, its current president, Muhammadu Buhari, campaigned on a promise to increase the value of the naira.\nThis plunge in the value of the naira has been majorly fueled by Nigeria importing more goods than it exports.\nWith 96% of the crypto value coming from outside the continent, this suggests that more Africans are receiving remittances via crypto.\nThis is the company battling the challenge that comes with paying employees in crypto, as legal barriers in many countries prevent this.\nSome of the barriers include the non-recognition of cryptocurrency as a legal tender and the challenge of calculating taxes when employees are paid in cryptocurrency."
  },
  {
    "headline": "I promise it’s funnier in Swahili…Kenyan Comedian Eddie Butita is Showing Netflix How Swahili’s Done",
    "summarized_story": "To roll out this project, the $25 billion company enlisted the help of celebrated Kenyan comic, Eddie Butita.\nButita is skilled at wielding digital technology in a market that’s grown so big that Netflix can’t ignore it.\nAccording to the Worldwide Mobile Data Pricing (2021) report from Cable, a British technology research firm, Kenya takes the lead as the most expensive country for mobile data in East Africa.\nViewing one hour of Netflix content on low resolution (480p) uses 300 MB of data per hour; in high resolution (1080p), Netflix uses 3 GB per hour.\nAt an average cost of $1.05 per GB of data, Netflix viewers in Kenya stand to pay anywhere from $0.32 to $3.15 to watch a one-hour show."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, I'm sure today's header might have warned you what to expect.\nBrace yourself for an exciting lineup of news..."
  },
  {
    "headline": "20.10.2020: We will not forget",
    "summarized_story": "This post is a delayed version of Techpoint Digest , a week-daily newsletter that rounds up major happenings in African tech.\nBut, on October 4, 2020, the online protest gained momentum as videos of police brutality circulated on social media.\nAnd we will not forget how technology, through social media, enabled our voices to be heard.\nThe company helps users track gas quantity used, gas quantity remaining, consumption, and transaction history.\nThe Backup platform was created to solve the rising case of police brutality among Nigerian youths."
  },
  {
    "headline": "Nigerian clean energy startup, Homefort Energy, wants to make sure you never have cooking gas worries again",
    "summarized_story": "“Our smart metre’s tamper-proof feature achieves over 95% customer retention by preventing unauthorised retailers from refilling their cylinders,” Owosho says.\nAs a result, when a customer runs out of gas, Homefort notifies them and schedules a delivery.\nMoreover, barcode tags on Homefort cylinders allow them to track the age and health of the cylinders in real-time.\nTo gain access to Homefort, users must first install the Homefort app, available for both Android and iOS systems.\nNew users who do not have cylinders or whose cylinders are more than eight years old must purchase Homefort cylinders."
  },
  {
    "headline": "African healthtech startup, Healthtracka, gets into Techstars Toronto Accelerator programme",
    "summarized_story": "Share this article:Healthtracka, a Nigeria-based healthtech startup decentralised laboratory testing in Africa by providing at-home tests and digital results, has announced joining the Techstars Toronto Accelerator programme.\nAdvertisementHow does it feel to get into Techstars Toronto?\nSeeing a global accelerator like Techstars also identifying with us and backing us is exciting.\nI will recommend that every founder joins a global accelerator for the sake of themselves and their companies.\nAccording to Sunil Sharma, Managing Director of Techstars Toronto, the nature of the problem that Healthtracka is looking to solve was a major attraction."
  },
  {
    "headline": "#EndSARS: Nigeria yet to pick up from ruins of protest",
    "summarized_story": "#EndSARS: Nigeria yet to pick up from ruins of protestBusinesses are yet to recover and public infrastructure are still ruined after they were razed during nationwide #ENDSARS protests against the unpopular and now disbanded Special Anti-Robbery Squad (SARS) one year ago.\nFinancial Derivatives Company, an advisory firm, estimates the economic cost of the #EndSARS protest disruption at N1.5 trillion, about 11.47 percent of the 2021 budget.\nHe said while the big buses cost around $200,000 each, the medium-size buses cost around $100,000 each.\nHowever, over 10,000 small businesses affected by last year’s #EndSARS protests have received a total of N939 million support from the Lagos State government.\nThis was obtained from statistics collated between October 11 and 27, 2020, after the #EndSARS protest spread across the country."
  },
  {
    "headline": "See what Nigerian banks are charging for dollar transaction",
    "summarized_story": "As foreign exchange pressure persists, some Nigerian banks have increased dollar charges by 45.15 percent per dollar, an affected customer told BusinessDay.\n“I performed a dollar transaction on my Globus account last month, I was charged N601 to a dollar.\nThis implies that the bank charged an average rate of N598.04k per dollar compared with N412 the banks are supposed to charge after buying from the Central Bank of Nigeria (CBN) at N410 per dollar.\nOthers include Sterling Bank (N460/$), Standard Chartered Bank (N463/$), and Union Bank rate has remained unchanged at N412/$.\nThe banks’ CEOs in a zoom press conference said they had the infrastructure and the capacity to meet the legitimate foreign exchange demand of the end users."
  },
  {
    "headline": "#EndSARS: NEC wants arm-bearing security recruits to undergo psychiatric evaluation, drug tests",
    "summarized_story": "The National Economic Council (NEC), comprising all State Governors and representatives of the Federal Government, and chaired by the vice president, has called on the leadership of the security agencies to ensure that persons that are recruited into arms-bearing security agencies undergo psychiatric evaluations and drug tests before enlistment.\nThis is to ensure that they are psychologically fit to carry live weapons and to identify behavioural tendencies that may require psycho-social interventions.\nNEC also warns that the personnel of the agencies should dutifully observe Rules of Engagement in the discharge of their duties around and within the civilian populace.\nThe NEC, had, during its meeting on 15 October 2021, received an update on the Reports of Judicial Panels of Inquiry into Allegations of Human Rights Violations against Members of Nigeria Police Force and other Security Agencies.\n“In particular, it advocated the review of pension and gratuity of retired police officers and attainment of parity of remuneration by police officers with sister security agencies,” the Minister added."
  },
  {
    "headline": "Eid-El-Maulud: Obaseki harps on tolerance, peaceful coexistence – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – I join our Muslim brothers and sisters in Edo State in celebrating the birth of Prophet Mohammed (S.A.W.)\nThe Eid-El-Maulud celebration offers us the opportunity to ponder on the importance of peaceful coexistence and tolerance.\nThe spirit of the Eid-El-Maulud celebration should guide us in working together and with a common drive to build strong coalitions that will entrench development and progress in our state.\nI reassure the Muslim faithful that our administration remains committed to ensuring the welfare and peaceful co-existence of all residents.\nGodwin ObasekiGovernor, Edo State..."
  },
  {
    "headline": "Edo, APOI, other stakeholders validate guidelines to drive investment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – To sustain a friendly business environment and capital inflows, the Edo State Government has engaged Africa Palm Oil Initiative (APOI), Proforest and other stakeholders to develop and validate the Free Prior Informed Consent (FPIC) guidelines so as to improve investors’ confidence.\n“The law would boost the confidence of investors and communities to ensure that they know what it requires to secure investment in the state,” he noted.\n“When the document is passed into law, investors would now have the confidence to come in knowing exactly what to do to stake their investment.\nThe FPIC law will also let them know the role of government and what it will do to back their investment in terms of profitability as no investors will be able to cut corners when it comes to investment in Edo State.\n“We really want to have a situation where the communities, local and state governments will work in harmony, as stipulated in the FPIC documents.”..."
  },
  {
    "headline": "Edo police mobilize 3,000 personnel for Eid-Maulud – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY-Edo Police Command has said that it had deployed over 3,000 personnel to provide adequate security for lives and property before, during and after today’s Eid-El Maulud in the state.\nThe command assured that security had been beefed up around mosques and event centres across Edo State.\nThis was made known in a press release signed by the command Public Relations Officer SP Kontongs Bello and made available to journalists in Benin City.\nThe statement wishes Muslim faithful a happy Eid-El Maulud, it however enjoined them to celebrate within the armpit of the law and relevant COVID-19 protocols.\nIt however urged anyone in distress to call Edo State Police Command Control Room through the following numbers: 08037646272, 08123827225, 08056776365 and 08077773721."
  },
  {
    "headline": "World Food Day: Obaseki urges innovation to tackle food security, assures more support for smallholder farmers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for innovations to tackle all challenges threatening food sufficiency, ensuring farmers and other stakeholders in the agricultural value chain increase agricultural productivity and achieve food security.\nObaseki gave the charge in commemoration of World Food Day, marked yearly by the Food and Agriculture Organisation (FAO), and other organs of the United Nations (UN).\nSpeaking on the theme of this year’s World Food Day, ‘Our actions are our future’, Obaseki called on everyone to be a food hero contributing to the transformation of agri-food systems and ensuring enough food for the global population.\nA similar intervention programme was undertaken in Warrake Community, Owan East Local Government Area on a 500ha farmland.\n“In Usugbenu, Ugboha and Sobe communities in Esan Central, Esan Southeast and Owan West, respectively, we empowered 1,500 farmers on the production of maize."
  },
  {
    "headline": "Piracy in Nigeria’s waters down 77% — International Maritime Bureau",
    "summarized_story": "Piracy and armed robbery attacks in Nigerian waters fell 77 per cent in the first nine months of 2021 when compared to the same period in 2020, the International Maritime Bureau said in its latest report.\nMr Jamoh said the agency had put in place measures to sustain the current momentum of security in the country’s waters.\n“We are delighted by this latest news from the IMB and the trend of progressive reduction in piracy and related incidents on our waters,” he said.\n“But we cannot afford to be complacent about our commitment to the security of our maritime domain.\n“We will continue to strive for more effective measures to keep Nigerian waters safe and secure,” he said."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "El-Rufai asks Buhari to declare bandits as terrorists",
    "summarized_story": "Kaduna State governor, Mallam Nasir El-Rufai, has called on the President Muhammadu led Federal Government to declare bandits as terrorists, to according to him, enable the military to kill them without consequences in international law.\nEl-Rufai said his administration support the resolution by the National Assembly on the issue, adding that he will follow up with another letter of support for the government to declare the bandits as terrorists.\nThe Kaduna State Government has always aligned with the declaration of bandits as insurgents and terrorists,” he said.\nThis is the view of the Kaduna State Government,” he said.\n“I wish to appeal to all the citizens and residents of Kaduna State toremain law abiding and to uphold peace in their communities as best as they can,” he said."
  },
  {
    "headline": "Olusegun Obasanjo foundation to screen 10m Nigerians for diabetes",
    "summarized_story": "As part of activities to mark this year’s World Diabetes Day, the Olusegun Obasanjo Foundation has mapped out plans for the celebration on November 14th, 2021 in Abeokuta, Ogun State.\nAddressing the press, former President Olusegun Obasanjo alongside the CEO Olusegun Obasanjo Foundation, Dr Olalekan Makinde, intimated Nigerians on the danger and prevention of diabetes and what to expect as preparations are in top gear for the celebration.\n“Let us mark this year’s diabetes day with a resolve to standby those of us who are diabetic to do what is right.\nThe climax will be a dinner with OBJ, and other dignitaries from all sphere of life, including the players at the marque of the Olusegun Obasanjo Presidential Library Complex.\nThe foundation can be reached on +2349068147970, email at [email protected] or [email protected]"
  },
  {
    "headline": "NDIC committed to assisting CBN in promoting banking system stability",
    "summarized_story": "OBINNA EZUGWUThe Nigerian Deposit Insurance Corporation (NDIC), has restated is commitment to assisting the Central Bank of Nigeria (CBN) in promoting the stability of the banking system.\nThe initiative, strives to ensure that the insurance cover is adequate to support this objective within the banking sector.\n“Furthermore, there have been recent calls on the Corporation to enhance the provision of support, to insured institutions that are facing financial difficulties.\nThis has become more important to us, giving the need to improve on our processes in resolving liquidated financial institutions.\nI therefore call on you, to continue to support the Corporation in its resolve to fully deliver on its core mandates."
  },
  {
    "headline": "Sterling Bank powers corporate HQ with specialized solar energy technology",
    "summarized_story": "Sterling Bank PLC has become the first African corporate organization to power its headquarters with the Building Integrated Photovoltaic (BIPV) energy technology as its primary source of energy.\nDele Faseemo, Group Head, Energy, at Sterling Bank who disclosed this in a statement issued by the Bank recently, said the major milestone is a demonstration of the Bank’s commitment to its vision of concentrating investment under its HEART of Sterling programme on five sectors that can impact the economy remarkably.\nThe sectors are Health, Education, Agriculture, Renewable Energy and Transportation.\nAccording to him, “The building integrated photovoltaic (BIPV) project is being undertaken in Lagos, Nigeria following the official nod received from the Nigerian Electricity Regulatory Commission and the relevant agency of the Lagos State Government; and an Agreement signed between Sterling Bank and PriVida Power Limited, a Nigerian-based international energy company.\nWe are confident that Sterling Bank has taken the right step in strengthening its position as the undisputed Leader in promoting Renewable Energy (RE) deployment in Nigeria through this project.”Faseemo also remarked that 3E, a South Africa-based independent technical advisor for Sterling Bank, has reviewed the design proposed by the EPC Contractor and included the assessment of the site, the verification of the contractor energy audit, the long-term energy yield assessment and the review of the financial model."
  },
  {
    "headline": "DPR, PPPRA, PEF: FG Douses Workers’ Fear Of Job Losses",
    "summarized_story": "The federal government has doused apprehension of staff of the three defunct institutions: Department of Petroleum Resources (DPR), the Petroleum Products Pricing Regulatory Agency (PPPRA), and the Petroleum Equalisation Fund (PEF), assuring them that no job will be lost.\nMinister of state for petroleum resources, Chief Timipre Sylva who gave the assurance in Abuja yesterday, also assured National Association of Road Transport Owners (NARTO) and other people who have commitments with PEF that all their liabilities will be taken care of by the new organisation.\n“It is normal that at junctures like these, there are anxieties.\nThat is why I thought I should come personally along with the permanent secretary to assure you that this is a very normal transition.\nIt’s all because this is what the law says.”ADVERTISEMENT“I want to assure you that the staff of the now defunct DPR have nothing to worry about."
  },
  {
    "headline": "DPR, PPPRA, PEF: FG Douses Workers’ Fear Of Job Losses",
    "summarized_story": "The federal government has doused apprehension of staff of the three defunct institutions: Department of Petroleum Resources (DPR), the Petroleum Products Pricing Regulatory Agency (PPPRA), and the Petroleum Equalisation Fund (PEF), assuring them that no job will be lost.\nMinister of state for petroleum resources, Chief Timipre Sylva who gave the assurance in Abuja yesterday, also assured National Association of Road Transport Owners (NARTO) and other people who have commitments with PEF that all their liabilities will be taken care of by the new organisation.\n“It is normal that at junctures like these, there are anxieties.\nThat is why I thought I should come personally along with the permanent secretary to assure you that this is a very normal transition.\nIt’s all because this is what the law says.”ADVERTISEMENT“I want to assure you that the staff of the now defunct DPR have nothing to worry about."
  },
  {
    "headline": "Queen Elizabeth Cancels Trip On Doctors’ Advice",
    "summarized_story": "Britain’s Queen Elizabeth, has heeded the advice of her doctors to rest and not travel to Northern Ireland as she had planned.\nThe world’s longest-reigning monarch decided yesterday to rest for the next few days on advice from doctors and therefore cancelled a planned visit to Northern Ireland, Buckingham Palace said.\n“The queen has reluctantly accepted medical advice to rest for the next few days.\nShe was 25 when she became Queen Elizabeth II on Feb. 6, 1952 on the death of her father.\nThe queen sent her “warmest good wishes to the people of Northern Ireland, and looks forward to visiting in the future”, the palace said."
  },
  {
    "headline": "Queen Elizabeth Cancels Trip On Doctors’ Advice",
    "summarized_story": "Britain’s Queen Elizabeth, has heeded the advice of her doctors to rest and not travel to Northern Ireland as she had planned.\nThe world’s longest-reigning monarch decided yesterday to rest for the next few days on advice from doctors and therefore cancelled a planned visit to Northern Ireland, Buckingham Palace said.\n“The queen has reluctantly accepted medical advice to rest for the next few days.\nShe was 25 when she became Queen Elizabeth II on Feb. 6, 1952 on the death of her father.\nThe queen sent her “warmest good wishes to the people of Northern Ireland, and looks forward to visiting in the future”, the palace said."
  },
  {
    "headline": "Bandits Kidnap 30 Passengers In Niger",
    "summarized_story": "As the military intensified ground and air strikes in Birni Gwari, Kaduna State, bandits have shifted to the neighbouring communities in Niger State where they kidnapped 30 passengers yesterday evening.\nThe victims were abducted at Garun Gabas in Rafi local government Area of the state which shares borders with Birni Gwari in Kaduna State.\nLEADERSHIP gathered that the passengers travelling in a 18-seater bus and two other vehicles were abducted by the bandits, who engaged in sporadic shooting to instil fear in their captives.\nIt was learnt that the bandits on 30 motorcycles took over the highway as villagers and incoming vehicles scampered for safety amid the shooting.\nSome villagers who spoke on condition of anonymity told LEADERSHIP that the bandits were coming into Niger in droves and that the development was giving them sleepless nights."
  },
  {
    "headline": "Alleged sexual abuse: Court shows video as victim relates how she was defiled by Baba Ijesha",
    "summarized_story": "Alleged sexual abuse: Court shows video as victim relates how she was defiled by Baba IjeshaAlleged sexual abuse: Court shows video as victim relates how she was defiled by Baba IjeshaThe video of the 14-year-old girl allegedly defiled by Nollywood Actor, James Olanrewaju a.k.a.\nBaba Ijesha was on Wednesday shown at an Ikeja Sexual Offences Court.\nAnswering questions from the child forensic expert, the survivor said she likes reading novels and watching cartoons and movies.\nAccording to her, when Baba Ijesha came ìn, he went round the house and was checking the walls.\nShe also said she was not a child advocate but a child forensic expert who had received training on child psychology and development."
  },
  {
    "headline": "Alleged sexual abuse: Court shows video as victim relates how she was defiled by Baba Ijesha",
    "summarized_story": "Alleged sexual abuse: Court shows video as victim relates how she was defiled by Baba IjeshaAlleged sexual abuse: Court shows video as victim relates how she was defiled by Baba IjeshaThe video of the 14-year-old girl allegedly defiled by Nollywood Actor, James Olanrewaju a.k.a.\nBaba Ijesha was on Wednesday shown at an Ikeja Sexual Offences Court.\nAnswering questions from the child forensic expert, the survivor said she likes reading novels and watching cartoons and movies.\nAccording to her, when Baba Ijesha came ìn, he went round the house and was checking the walls.\nShe also said she was not a child advocate but a child forensic expert who had received training on child psychology and development."
  },
  {
    "headline": "Fence Collapse: UNILAG waterfront needs shoreline protection – VC",
    "summarized_story": "He said that the university had maintained an embankment on the shoreline and waterfront serving as perimeter fencing and ensuring that coastal erosion and occasional flooding were addressed.\n“The Lagos lagoon is part of the lagoon complex which comprises a network of nine lagoons namely: Yewa, Ologe, Badagry, Iyagbe, Lagos, Kuramo, Epe, Lekki, and Mahin, stretching from the Republic of Benin.\nOgundipe said that the Lagos lagoon waterfront with usefulness as a tourism resource is considered a major artery in the water transportation architecture of Lagos metropolis.\n“In this light, the university of Lagos waterfront has already been earmarked for construction of a jetty by the Lagos State Government under the leadership of Gov.\n“This comprises of the waterfront, known as university of Lagos Waterfront, shorelines of Ilaje-Bariga and shorelines of Makoko community,” Ogundipe said."
  },
  {
    "headline": "Fence Collapse: UNILAG waterfront needs shoreline protection – VC",
    "summarized_story": "He said that the university had maintained an embankment on the shoreline and waterfront serving as perimeter fencing and ensuring that coastal erosion and occasional flooding were addressed.\n“The Lagos lagoon is part of the lagoon complex which comprises a network of nine lagoons namely: Yewa, Ologe, Badagry, Iyagbe, Lagos, Kuramo, Epe, Lekki, and Mahin, stretching from the Republic of Benin.\nOgundipe said that the Lagos lagoon waterfront with usefulness as a tourism resource is considered a major artery in the water transportation architecture of Lagos metropolis.\n“In this light, the university of Lagos waterfront has already been earmarked for construction of a jetty by the Lagos State Government under the leadership of Gov.\n“This comprises of the waterfront, known as university of Lagos Waterfront, shorelines of Ilaje-Bariga and shorelines of Makoko community,” Ogundipe said."
  },
  {
    "headline": "BREAKING: Bandits Kidnap Over 30 Travellers In Rafi, Niger State",
    "summarized_story": "Armed gunmen are said to have kidnapped approximately 30 travellers at Garun-Gabas in Niger State’s Rafi Local Government Council.\nThe victims were reportedly kidnapped on three separate vehicles on the Zungeru-Garin-Gabas highway on Wednesday afternoon.\nThey were going in an 18-seater bus and two other vehicles when they were ambushed by the attackers, according to NEWS DIRECT.\nAfter taking the travelers, the robbers in huge numbers rushed into the Kundu forest in Rafi to rustle cattle, according to a local who did not want his name publicized.\nWhen contacted, DSP Wasiu Abiodun, the state Police Public Relations Officer, promised to respond, but has yet to do so as of the time of posting this report."
  },
  {
    "headline": "End SARS: Nigerian Govt Receives Final Reports From 11 States.",
    "summarized_story": "According to the federal government, 11 of the 28 states have filed their final reports to the Judicial Panel of Inquiry regarding the 2020 EndSARS protest and its aftermath.\nDAILY POST reports that NEC is the nation’s highest economic decision-making body presided over by the Vice President with all the state governors and selected ministers in attendance.\nIt also reports that the judicial panels set up by the states were to make inquiries into allegations of human rights violations against members of the Nigeria Police Force and other security agencies.\n“Out of the 28 States, 11 States (Abia, Ekiti, Enugu, Gombe, Kwara, Nasarawa, Ogun, Ondo, Osun, Plateau, and Rivers) have submitted their final reports to Council.\nGovernors of other states have also indicated that their reports would be submitted soon.”"
  },
  {
    "headline": "End SARS: Why I Ordered Policemen To Tear Gas Protesters – Police Commissioner.",
    "summarized_story": "On Wednesday, Hakeem Odumosu, the Lagos State Police Commissioner, stated he ordered his troops to tear gas #EndSARSMemorial demonstrators at the Lekki Toll Gate.\nSpeaking with newsmen, Odumosu said the police fired tear gas at the protesters to avoid a breakdown of law and order.\nThe police commissioner noted that he ordered his men to tear gas the protesters because they went against the promise earlier made that the procession will start by 8 am and end by 10 am.\nThe Commissioner said: “The protest was between 8 am and 10 am, anything, after 10 am, is a nuisance.\n“I discussed with them and they said they will end the protest by 10 o’clock."
  },
  {
    "headline": "#EndSARS Memorial: Tiimeline Of Notable Dates To Remember In October 2020.",
    "summarized_story": "Oct. 6, 2020: Protesters block major roads in Delta State, heating up the protest on Twitter, which spilled over to Lagos.\nOct. 8, 2020: Protesters led by celebrities slept in front of the Lagos Government House.\nOct. 14, 2020: Protesters were attacked in Abuja.\nProtests were also held in Belgium, the U.K., and the U.S.Oct. 15, 2020: Hoodlums attacked protesters in Lagos as Christian cleric, Enoch Adeboye, backed the #EndSARS movement.\nOct. 19, 2020: Hoodlums attacked Benin Correctional Centre to free some inmates in one of the cells."
  },
  {
    "headline": "Breaking: Bandits strike, abduct 30 passengers in Niger",
    "summarized_story": "Bandits have struck again, and the abduction of 30 passengers at Garun Gabas in Rafi local government area of Niger state.\nThe passengers were reportedly abducted on Wednesday by the gunmen from three separate vehicles comprising of 18 seater bus and two other vehicles.\nIt was learnt that the bandits in their large number with dangerous weapons stormed Zungeru Garun Gabas highway shooting sporadically to scare villagers before kidnapping the passengers to unknown destination.\nOne of the villagers who pleaded ananormity said in a telephone interview that the bandits have now advanced to Kundu forest in Rafi local government council to rustle cattle in that area.\nThe Police Public Relations Officer (PPRO) Niger state command DSP Wasiu Abiodun could not be reached on the incident."
  },
  {
    "headline": "Pictures: Popular Nigerian rapper, Falz, leads #EndSARS anniversary protest in Lagos",
    "summarized_story": "PreviousAnambra: My administration ‘ll end segregation against non indigenes, secure lives, properties – Ozigbo"
  },
  {
    "headline": "VIDEO: Police disperse protesters on #Endsars anniversary day",
    "summarized_story": ""
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "FG To Roll Out Fresh Policy On Road Transportation, Mass Transit -NigPilot",
    "summarized_story": "Barring any unforeseen circumstances, the Federal Government will in a matter of weeks, take steps to regulate road transportation and mass transit vehicles operations in the country, Senator Gbemisola Saraki , Minister of State Transportation has disclosed.\n“This afternoon I was in a meeting that the Vice President Chaired and we are looking at how best to tackle the issue of road transportation.\nAnd with the fact that ACFTA is coming soon, in order for us to compete properly, we need to have a regulated road transportation system for commercial operators, which now comes to the manufacturers.\nI know that Lome and Cotonou have complained that the vehicles in Nigeria are below standard.\nAccording to Agwu, policy inconsistency is one problem that have cost the auto sector a whole lot of money."
  },
  {
    "headline": "Gov.Bello, Emir of Biu, Sanusi, others receive ‘Peace Achievers Awards’ -NigPilot",
    "summarized_story": "Governor of Kogi State, Yahaya Bello , Emir of Biu in Borno State, Mai Mustapha Umar Mustapha II and others, have received the 2021 Peace Achievers International Awards.\nThe award ceremony of the 10th edition of the annual award and peace summit was held at Nigerian Air Force Conference Centre in Abuja.\nof Kogi state bagged the ‘Governor of the Year on Peace and Security Award, while that of Akwa-Ibom clinched the award of ‘The Best Performing Governor: Industrialization and Peace Building.\n“The Peace Achievers International Awards is a private initiative of peace Ambassador Agency to recognize individuals and organisations in Africa who have demonstrated strong commitment in serving their communities.\nThe 10th edition of the Peace Achievers International Awards is supported through partnerships with the University of Benin,Cotonou, Chartered Institute of Management and leadership and the American Heritage University Southern California, USA."
  },
  {
    "headline": "NCPWD, Stakeholders begin development of curriculum, inclusive education -NigPilotNCPWD, Stakeholders begin development of curriculum, inclusive education",
    "summarized_story": "In a bid to eliminate discrimination against Persons with Disabilities, PWDs, The National Commission for Persons with Disabilities, NCPWD, has said it is working closely with the Ministry of Education, and other relevant Agencies to develop curriculum on disability and inclusive development.\nAcknowledging the huge task before the Commission, Lalu stressed,” How can we bring back out of school children with disabilities to school?\nWe have about 3.1million out of school children with disabilities that do not want to go to school.\nWhile speaking on the effort made so far, Lalu said NCPWD is working with the Education Ministry to ensure that every federal school is open for free education for PWDs.\nAlso, the National President, Association of the blind, Ishika Adamu said the curriculum will help close the gap in accessing Tertiary education for PWDs."
  },
  {
    "headline": "NYSC DG bags Sun award for Public Service -NigPilot",
    "summarized_story": "In a short video aired before the Award presentation, Management of the SUN Newspapers said General Ibrahim was considered for the award because of the unprecedented changes he has brought to the National Youth Service Corps as the 18th Chief Executive of the organisation.\nHis collaboration with several agencies and financial institutions that seek to empower members of the corps were also presented as attributes that make B rigadier General Ibrahim an exceptional leader deserving of the award.\nTwenty individuals were given awards for Public Service, Philanthropy, Business and Technology at the well-attended ceremony.\nBrigadier General Shuaibu was accompanied by his wife, Mrs Martina Ibrahim and some Directors to accept the Award at the 18th Sun Awards 2020.\nAnother winner in the same category was the Chairman of the National Drug Law Enforcement Agency (NDLEA), Brigadier General Buba Marwa rtd."
  },
  {
    "headline": "Gunmen Kidnap Over 30 Passengers In Niger",
    "summarized_story": "Gunmen have abducted 30 passengers at Garin Gabas in Rafi Local Government Area of Niger State.\nChannels Television gathered that the victims were kidnapped on Wednesday in three separate vehicles comprising an eighteen-seater bus and two other vehicles.\nThe bandits in their large number carrying dangerous weapons stormed Zungeru Garin Gabas highway shooting sporadically to scare villagers before kidnapping the passengers to an unknown destination.\nWhen contacted, the Police Public Relations Officer in the state, DSP Wasiu Abiodun promised to get a call back to our reporters.\nThe gangs have been increasingly targeting schools, kidnapping students to squeeze ransom from authorities and parents."
  },
  {
    "headline": "Bandits Should Be Declared Terrorists, El-Rufai To FG",
    "summarized_story": "﻿Governor Nasir El-Rufai of Kaduna State, has asked the Federal Government to declare bandits threatening the peace of the Northwestern region as “terrorists”.\nEl-Rufai made this call after receiving the third quarter security report from the Commissioner of Internal Security and Home Affairs, Mr. Samuel Aruwan, at the Sir Kashim Ibrahim House, Kaduna on Wednesday.\nAccording to the governor, declaring the bandits as terrorists will enable the Nigerian security forces to utterly decimate the gunmen without fear of being sanctioned by the international community.\n“We in the Kaduna State government had always urged for the declaration of bandits as insurgents and terrorists.\nIn his reaction, Governor El-Rufai who sympathized with the victims of the attacks, ordered for the immediate compensation of surviving victims and relatives of the deceased."
  },
  {
    "headline": "Terrorists Who Attempted Coup Against Me Are In Nigeria – Turkey President",
    "summarized_story": "President Recep Tayyip Erdogan of Turkish has said that members of the Fetullah Terrorist Organisation (FETO) that attempted to push him out of power on July 15, 2016 through a failed coup are currently in Nigeria.\nErdogan stated this on Wednesday during a joint press conference with President Muhammadu Buhari in Abuja, the nation’s capital.\nThe Turkish leader is on a two-day working visit to Nigeria, just as he is also touring two other African countries – Togo and Angola.\n“Turkey has been fighting against terrorist organisations for many decades, such as the PKK, PYD, FETO, DASH and other terrorist organisations,” President Erdogan said through an interpreter.\nThe Turkish president also commended President Buhari for hosting him and his delegation."
  },
  {
    "headline": "#EndSARS Anniversary: Celebrities, Youths Hold Memorial Procession At Lekki Tollgate",
    "summarized_story": "﻿Celebrities and youths on Wednesday held a memorial car procession at the Lekki tollgate in Lagos State.\nWhile the parade was in progress, officials of the Lagos Neighbourhood Safety Corps (LNSC) passed vehicles to ensure a free flow of traffic.\nAs the event continued, the number of youths at the venue grew while others came down from their cars, chanting solidarity songs.\nThis led to the decision of the youths to organise a memorial procession rather than a protest, although they maintained the call for an end to police brutality.\nWe know their way, so a procession of cars is the safest option to minimize police harassment."
  },
  {
    "headline": "US High School Shooter Pleads Guilty, Says He’s ‘Very Sorry’",
    "summarized_story": "A former student pleaded guilty on Wednesday to killing 17 people in a shooting rampage at a high school in Parkland, Florida, and apologized in court to relatives of the victims.\nNikolas Cruz, who was 19 at the time, took a legally purchased AR-15 assault rifle into Marjory Stoneman Douglas High School, his former school, on Valentine’s Day in 2018 and killed 17 students and staff members.\nCruz pleaded guilty to 17 counts of first-degree murder and 17 counts of attempted murder for those wounded during the attack, which sparked a student-led movement for tighter gun control laws.\nHe told the judge he was suffering from a “little anxiety” but understood the charges against him and was pleading guilty of his own volition.\nFollowing his guilty pleas, Cruz, who is now 23, apologized to the relatives of his victims."
  },
  {
    "headline": "Governor Lalong inaugurates steering committee for Plateau agenda 2050",
    "summarized_story": "The Committee’s role is to oversee the process of developing the Plan, guide the work and activities of the Sectorial Working Committees, as well as ensure consistency with their respective Terms of Reference."
  },
  {
    "headline": "EndSars one-year after: Over seven persons arrested as procession holds at Lekki tollgate",
    "summarized_story": "Over seven persons were on Wednesday arrested at the Lekki tollgate in Lagos during a procession to commemorate the first anniversary of the EndSars protest.\nTVC news gathered that said some of those arrested were unable to identify themselves when asked to do by security operatives, while others were arrested for arming themselves with cutlasses and glasses.\nConfirming the incident, Commissioner of Police for Lagos State, Hakeem Odumosu said those arrested will be prosecuted accordingly while those who later identified themselves properly will be freed."
  },
  {
    "headline": "#HappeningNow: Army education summit underway in Sokoto",
    "summarized_story": "The Sultan of Sokoto Muhammad Sa’ad Abubakar pointed this out during his opening remark at the second edition of the Nigeria Army education summit ongoing in Sokoto.\nThe Sultan called on the military to adopt functional education and military might in tackling the security challenges.\nNot only education, he added, but functional education, which would shift the focus away from paper qualifications and toward imparting actual information that will equip students with the essential abilities to operate effectively in society.\nHe also advised organisers of the summit to ensure the implementation of outcome of the summit while also calling for more attention to be paid on research and development that will provide solutions to the doubting challenges facing the country.\nDuring his remark, Sokoto state governor Aminu Tambuwal called on the military to focus not only on making the society safe, but also the safety of schools across the country."
  },
  {
    "headline": "Youths protest in Oyo to mark one year anniversary of Endsars",
    "summarized_story": "Governor Lalong inaugurates steering c ...\nGovernor Simon Lalong has Inaugurated a steering committee for the dev [...]EndSars one-year after: Over seven per ... Over seven persons were on Wednesday arrested at the Lekki tollgate in [...]#HappeningNow: Army education summit u ...\nReligious extremism due to poor or inadequate religious knowledge by m [...]Youths protest in Oyo to mark one year ...\nHundreds of youth protesters have converged in Ibadan to commemorate t [...]EndSars one-year after: Hundreds of yo ...\nHundreds of youth are gathered at the Lekki tollgate to commemorate th [...]Buhari receives Turkish president Rece ... President Muhammadu Buhari has received President Recep Tayyip Erdogan [...]We’ll fish out those behind killing of ... Imo State Governor Hope Uzodinma said efforts are being made to fish o [...]"
  },
  {
    "headline": "Renewed Ethiopia Air Raids on Capital of Embattled Tigray Region",
    "summarized_story": "Ethiopian federal government forces have launched an air raid on Mekelle, the capital of Ethiopia’s embattled Tigray region, for the second time this week.\nThe air raids mark a sharp escalation in the near yearlong conflict in northern Ethiopia pitting government forces and their allies against the Tigrayan People’s Liberation Front (TPLF), Tigray’s once dominant governing party.\nA humanitarian source in Mekelle told Reuters news agency the air raid was in 05 Kebelle, an area near a cement factory on the city’s outskirts.\nSeparately, the AFP news agency quoted a Mekelle resident as saying that an industrial site had been destroyed in the air raid.\nMekelle had not seen fighting since June, when Tigrayan forces retook much of the region in a dramatic turn in the war."
  },
  {
    "headline": "Karim Benzema’s Sex Tape Blackmail Case Trial Starts",
    "summarized_story": "Real Madrid striker Karim Benzema has gone on trial in France accused of complicity in an attempt to blackmail fellow footballer Mathieu Valbuena over a sex tape found on his phone.\nHe is on trial with four other men accused of trying to blackmail Mr Valbuena, who told the court on Wednesday that football was his life.\nThe sex tape case began in 2015 when Mr Valbuena, now 37, asked a man in Marseille, Axel Angot, to upload the contents of his mobile phone to a new device.\nThe defendants are accused of approaching a childhood friend of Mr Benzema called Karim Zenati.\nThe trial will continue until the end of the week, with four defendants facing charges of attempted blackmail and Karim Benzema accused of complicity."
  },
  {
    "headline": "Steve Bruce Leaves Newcastle By Mutual Consent after Saudi Takeover",
    "summarized_story": "Manager Steve Bruce has left Newcastle United by mutual consent just 13 days after the Saudi Arabia-backed £305m takeover of the club was completed.\nGraeme Jones will take interim charge of the Premier League side.\nBruce was appointed Magpies manager in July 2019 and achieved finishes of 13th and 12th in his two full seasons in charge.\n“I am grateful to everyone connected with Newcastle United for the opportunity to manage this unique football club,” said Bruce.\nHe would have said the takeover from a footballing sense is the best thing for Newcastle United Football Club in terms of the investment it will undoubtedly bring."
  },
  {
    "headline": "US Expected to Authorise Mix-and-Match Covid Booster Shots",
    "summarized_story": "Federal regulators are expected to authorize the mixing and matching of COVID-19 booster doses this week in an effort to provide flexibility as the campaign for extra shots expands.\nPreliminary results from a government study of different booster combinations found an extra dose of any type revs up levels of virus-fighting antibodies regardless of the brand people first received.\nOne confusing decision is what Moderna dose to recommend in combination with other brands.\nModerna has applied for its booster to be half the original dose, saying that’s plenty for people who already received two full-strength shots.\nBut the mix-and-match study used full-strength extra doses, and there’s no way to know if a half-dose Moderna booster would trigger as strong a reaction in J&J recipients."
  },
  {
    "headline": "#EndSARS: Anti-Riot Policemen Disperse Protesters in Kwara",
    "summarized_story": "Anti-riot policemen in Kwara State on Wednesday dispersed scores of #EndSARS protesters who gathered in front of MAMTESS supermarket at Taiwo Isale, Ilorin.\nBesides, some soldiers were also sighted at the Post Office Area, Ilorin, keeping vigil to see how protesters would start the protest from the area.\nAlready since Tuesday evening, fully armed police officers have been despatched to keep an eye on the #EndSARS protesters and disperse wherever they gathered.\nBy Wednesday morning till the time of filing this report, fully armed police officers were seen at Post Office, Challenge and Unity areas where protests usually take place.\nOne of the organisers, simply identified as Comrade Jamiu confirmed to journalists in Ilorin that they had hardly taken off from Taiwo Isale, when the fully armed anti-riot police officers dispersed them."
  }
]