[
  {
    "headline": "Bukola Ayinde : Coaching To Reinvent",
    "summarized_story": "The alumnus of the Fate Foundation Entrepreneurship Programme is today, a Life Coach, Storyteller, disability disability-inclusion and mental health advocate.\nMy journey to rediscover myself was what led me to become a life coach.\nA life coach can work with a client as regards the critical areas of his or her life.\nWhat I enjoy most about being a life coach is goal setting.\nWhy is it hard for many of them to clarify their goals and how can a life coach help?"
  },
  {
    "headline": "Bukola Ayinde : Coaching To Reinvent",
    "summarized_story": "The alumnus of the Fate Foundation Entrepreneurship Programme is today, a Life Coach, Storyteller, disability disability-inclusion and mental health advocate.\nMy journey to rediscover myself was what led me to become a life coach.\nA life coach can work with a client as regards the critical areas of his or her life.\nWhat I enjoy most about being a life coach is goal setting.\nWhy is it hard for many of them to clarify their goals and how can a life coach help?"
  },
  {
    "headline": "Anenih, others call for Nigerian Female President",
    "summarized_story": "By Yemisi SuleimanIn a bid to attain the nation’s first female president, a former Minister of Women Affairs, Iyom Josephine Anenih called on more Nigerian women to come out and be actively involved in partisan politics, noting that more female state governors should also emerge.\nShe asserted that Nigeria wouldn’t attain the transformational changes desired by patriots until a female president emerges.\n“It is Kingsley’s dream and I am sure I am right, to have a female President.\n“I’m looking forward to the day Nigeria will have a female president.\nIf we create an enabling environment for a Nigerian female president, we would be amazed at the wonders God will do with them.”“Women are being celebrated today because they are achievers and we expect that this celebration will spur them to do better."
  },
  {
    "headline": "Anenih, others call for Nigerian Female President",
    "summarized_story": "By Yemisi SuleimanIn a bid to attain the nation’s first female president, a former Minister of Women Affairs, Iyom Josephine Anenih called on more Nigerian women to come out and be actively involved in partisan politics, noting that more female state governors should also emerge.\nShe asserted that Nigeria wouldn’t attain the transformational changes desired by patriots until a female president emerges.\n“It is Kingsley’s dream and I am sure I am right, to have a female President.\n“I’m looking forward to the day Nigeria will have a female president.\nIf we create an enabling environment for a Nigerian female president, we would be amazed at the wonders God will do with them.”“Women are being celebrated today because they are achievers and we expect that this celebration will spur them to do better."
  },
  {
    "headline": "The Rave On Fire",
    "summarized_story": "The singer and songwriter, who has a song for every feeling from love, breakup, happiness to travel, says the song ‘Peru’ basically recounts his journey and holiday fun in San Francisco.\nYou are headlining your first concert ever in Lagos “The Fire Concert” How does that make you feel?\nMy debut was simply an introduction to my sound so I decided to make the next one a bit more personal and introspective.\nI had just landed in San Francisco to pay a courtesy visit to my empire team in the studio.\nI’m big on mutual respect and organic energy when it comes to collaborations, so I waited patiently till it came."
  },
  {
    "headline": "8 killed, property destroyed as Taraba communities clash",
    "summarized_story": "No fewer than eight persons have been reported killed in a communal clash that occurred in Bisaula and Gwanda communities of Kurmi Local Government Council of Taraba State.\nThe upheaval, which DAILY POST learnt erupted on Wednesday, was said to have been between the Ichen and Dakka people in the aforementioned communities.\nConfirming the incident, the President of the Ichen Cultural Development Association, Dr. Bibinu Ahmed, admitted that four of his people were killed.\nAlso on their parts, the people of Dakka community, confirmed that while one of their person was killed in Bisaula, three were killed in Gwanda.\nOne of the Senior police officers from the council, who also confirmed the incident, told DAILY POST that normalcy has begun to return to the affected communities and the council at large."
  },
  {
    "headline": "Fuel price hike: NLC warns Nigerian govt against N302 rate",
    "summarized_story": "Nigeria Labour Congress (NLC) has cautioned the federal government against removing oil subsidies.\nThere is apprehension over the National Economic Council (NEC) recommendation of N302 per litre of petrol.\nIkechukwu Nwafor, Ebonyi NLC chairman told the News Agency of Nigeria (NAN) on Friday that the government should reconsider its proposed action.\n“This is not the right time to increase pump price when the cost of living is difficult.\nOn the protest scheduled for January 27, the NLC chairman confirmed members were prepared to come out in opposition."
  },
  {
    "headline": "Kwara: 40-year-old man nabbed for alleged cattle rustling, breach of contract",
    "summarized_story": "A 40-year-old man, Ruwa Mojuba, is now in the custody of the Kwara State Command of the Nigeria Security and Civil Defence Corps, NSCDC, over alleged cattle rustling and breach of contract.\nThe suspect allegedly duped one Umar Abubakar, of Budo Alhaji village in Oyo state, who employed him to tend his herd of cattle in September 2021.\nRuwa, according to the spokesman of the state Civil Defence Corps, Babawale Zaid Afolabi, in Ilorin on Friday, was to tend the cattle for seven months on monthly salary of N10,000.\nHe said the suspect, however, “reared the cattle for only one month and ran away with 17 of the cows and relocated to Kura Village in Kaiama Local Government Area of Kwara State.\nThe state Commandant, Makinde Iskil Ayinla, has directed that the suspect be charged to court on Tuesday next week, as investigations have been concluded into the matter."
  },
  {
    "headline": "Ogun: Gov Abiodun declares ‘war’ on Yahoo boys, kidnappers",
    "summarized_story": "Governor Dapo Abiodun of Ogun State has declared war on internet fraudsters, otherwise known as Yahoo boys.\nSadly, he said to me that Ogun State tops the list on ‘Yahoo Yahoo Boys’.\nIn my response, I said I am not surprised because Ogun State is the education capital of this country and you will find such educational institutions around and he agreed with me.\n“We have decided that we will set up our State Commission that will be targeted towards eliminating these sorts of financial crimes.\nOur state commission will collaborate with the Federal Commission so that we do not occupy that false place in this area."
  },
  {
    "headline": "FG should fight oil bunkering same way it is fighting insurgency – Wike",
    "summarized_story": "Rivers State Governor has criticized the federal government for being “indifferent” in the fight against soot in the state.\nWike made the claims during a meeting with traditional rulers and the 23 local council chairmen in the state at the Government House, Port Harcourt on Friday.\nGovernor Wike said the federal government was meant to fight illegal bunkering in the state the same it intends to fight insurgency in the north east.\nHe said “I should think that the way the federal government intends to fight insurgency, is the way they should fight illegal oil bunkering, because it is a sabotage on the national economy.\nI will not because the federal government is not interested to stop it, therefore my people should die."
  },
  {
    "headline": "Court issues Immigration last opportunity to explain refusal to release Odili’s passport",
    "summarized_story": "“On the last adjourned date, this court had made an order that the counsel for the respondents, Mr. J.\n“Today, the matter was called and Mr. Adamu is not in court and no reason was given for his absence.\n“I make an order adjourning this case to the 7th of February 2022 for Mr. Adamu to show cause.\nRead Also: Odili’s passport seizure: Court awards N2m fine against ImmigrationAbbah said, although Adamu was making effort to attend court on Friday, he was unwell and was just trying to make it court.\n“Our lawyer is filing an affidavit to show that we have complied with the court’s order and have handed the passport to the ex-governor,” the source said."
  },
  {
    "headline": "#JusticeforHanifa: Buhari mourns murdered 5-year-old Kano pupil",
    "summarized_story": "President Muhammadu Buhari on Friday evening expressed condolences to the family of five -year-old pupil Hanifa Abubakar, whose body was discovered in a shallow grave in Kano after almost two months of fruitless search.\nBuhari’s reactions were contained in a statement by his Senior Special Assistant on Media and Publicity, Mallam Garba Shehu.\n“When breakthroughs like this happen, people will talk differently of law enforcement,” said the President.\nBuhari prayed for the repose of the soul of the little school girl and urged her parents to bear the sad loss with courage and fortitude in God.\nThe President urged the Police and Ministry of Justice to uphold the integrity of the detective work that busted the case by preparing well and presenting a good case that will earn the respect of the court."
  },
  {
    "headline": "Why I abducted, killed 5-year-old pupil, by school proprietor",
    "summarized_story": "The police in Kano State have arrested the abductors and killers of five-year old Hanifa Abubakar, a pupil of Noble Kids Academy in Kwanar Dakata, Nassarawa local government area of Kano State.\nThe principal suspect, Abdulmalik Mohammed Tanko, 30, who turns out to be the victim’s teacher, had initially demanded N6 million ransom for her release.\n“Sustained efforts led to the arrest of one Abdulmalik Mohammed Tanko, aged 30 years, of Tudun Murtala Quarters, Nassarwa, Kano State and one Hashim Isyaku, aged 37 years, of the same address.\nCommissioner for Education, Muhammad Kiru, announced closure of the school in a statement after detectives discovered the corpse of the victim.\nHe appealed to parents whose children attend the affected school to stop them, pending when investigation would be completed."
  },
  {
    "headline": "Why we took over IBEDC, by AMCON",
    "summarized_story": "Why we took over IBEDC, by AMCONThe Asset Management Corporation of Nigeria (AMCON) has explained why it took over the assets of Integrated Energy Distribution and Marketing (IEDM) Limited, the core investor of Ibadan Electricity Distribution Company (IBEDC).\nAMCON made the disclosure in a public notice, saying it executed the takeover of IEDM following a default in a loan servicing agreement executed with Polaris Bank.\nThe memo stated that the judgment granted preservative orders in favour of AMCON.\nHe explained that the receiver arrived on Thursday, January 20, to take charge formally and held a meeting with the management staff of the IBEDC.\n“I wish us all the best, while I appeal that we continue to remember IBEDC in our prayers.”"
  },
  {
    "headline": "Our plans for 2022, by 10 top Nigerian celebs",
    "summarized_story": "OLAITAN GANIU writes on the plans of 10 Nigerian entertainers for 2022 as well as motivational tips.\nThe mother of one continues to share wellness tips to help her fans kick-start 2022.\nRead Also: Social media agog as Laycon posts shirtless photoShe also advised her followers and fans on social media to stop reading meaning to everything and learn to let people be themselves in 2022.\nThe duo had engaged in social media rants for days, hence, forcing him to resolve to log off social media for the rest of 2022.\nContinuing he wrote: “I will not be seeing social media at all this year."
  },
  {
    "headline": "Killing of little Hanifa: Kano Govt shuts down, withdraws licences of indicted schools",
    "summarized_story": "From Desmond Mgboh, KanoFollowing the abduction and subsequent murder of a five-year-old girl, Hanifa Abubakar, a pupil of Noble Kids Academy, Kwanar Dakata by her school teacher, Kano State Government has ordered for an indefinite closure of the affected institution.\nA statement signed by the Public Relations Officer, Kano State Ministry of Education, Aliyu Yusuf , Friday, disclosed that the government has equally withdrawn the operational license of the.\nThe directives for both tge closure and withdrawal of the opearationsl licences of the two schools are with immediate effects, said the statement.\nThis statement quoted the the state Commissioner of Education, Malam Muhammad Sanusi Sa’id Kiru as expressing deep shock and sadness over the unfortunate incidence.\nHe further stated that the ministry would do all it takes to facilitate the work of the constituted committee to come with actionable suggestions that would prevent future occurrence of such tragic incidence."
  },
  {
    "headline": "Breaking: Gunmen abducts Bayelsa State Commissioner for Trade",
    "summarized_story": "From Femi Folaranmi, YenagoaGunmen have kidnapped the Bayelsa State Commissioner for Trade and Commence, Mr Otokito Federal Oparmiola.\nAccording to investigations, Otokito was kidnapped by heavily armed men from his residence at Otuokpoti, Ogbia Local Government Area.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nSources said the gunmen invaded the community at about 11pm, Thursday night and fired severally shots to scare people away before they proceeded to Otokito’s residence where he was whisked away to an unknown destination.\nDetails later"
  },
  {
    "headline": "Decision on petrol subsidy removal to come in June –NEC",
    "summarized_story": "Sule, who briefed alongside his Edo State counterpart, Godwin Obaseki, said any decision on removal of subsidy would be taken after the budget provision runs its course in June.\nHe said the Federal Government was spending about N2 trillion on petroleum subsidy, an amount he said could have been channelled to the nation’s infrastructure, education, healthcare among others.\n“As you all know and aware, the issue of subsidy has been one matter that NEC has deliberated on, for more than a year now.\nAll of these findings were presented to NEC and NEC has had several deliberations.\nSo, NEC has not come up with any decision yet."
  },
  {
    "headline": "No one’ll be allowed to raise army of thugs –Buhari",
    "summarized_story": "From Noah Ebije, KadunaPresident Muhammadu Buhari has warned that nobody would be allowed to raise an army of thugs to force himself on the people.\n“Nobody should be allowed to raise an army of thugs to force himself on the people.\nNoting the impact of the urban renewal programme, he said he could no longer find his way around Kaduna, even as someone who has lived in the city for long.\nEl-Rufai launched the Kaduna State Urban Renewal Programme in June 2019, shortly after which the projects commenced in Kaduna before those of Kafanchan and Zaria started.\n“The goal of the urban renewal programme is to regenerate Kaduna, Kafanchan and Zaria, the three major cities in the state.”"
  },
  {
    "headline": "You’re haunted by innocent blood spilled during your tenure, Imo",
    "summarized_story": "He claimed that since the police arrested Uche Nwosu in connection with insecurity in the state, Okorocha has been behaving abnormally.\nHe said the recent behaviour of the former governor depicted an early stage of insanity, which needs to be checked before it develops into full madness.\n“Is it not worrisome that Okorocha has veered from psychotic paranoid to being a clown and now a choirmaster of an Area Boys choir?\nWhen he is not howling about persecution by Uzodimma, he is teaching the IG and the police how to do their work.\n“The clownish display by Okorocha about a phantom shooting of God is the height of desperation by a man who wants to make his house boy, turned in-law, to be the governor of Imo State."
  },
  {
    "headline": "Buhari: El-Rufai is Writing His History in Letters of Gold",
    "summarized_story": "*Vows never to let anyone impose himself on NigeriansDeji Elumoye in Abuja and John Shiklam in KadunaPresident Muhammadu Buhari, yesterday, while inaugurating some projects in different parts of Kaduna State, gave a generous pass mark to the Northwestern state governor, Malam Nasir El-Rufai, saying he was writing history in letters of gold.\nIn yet, another instance, an overly impressed Buhari added: “Thank you very much, Your Excellency, and remarkably, you became my governor.\nHe praised Governor El-Rufai for completing people-oriented projects in the Kaduna metropolis as well as other senatorial districts in the state.\nReminiscing on the unfortunate incident, which claimed the lives of many innocent Nigerians, Buhari thanked God for sparing his life on that fateful day along Ali Akilu road, Kawo-Kaduna.\nBuhari is expected to be in Zaria today to commission more road projects under the Urban Renewal Programme."
  },
  {
    "headline": "IMF Proposes $50bn Trust Fund to Help Low-income Countries",
    "summarized_story": "Ndubuisi FrancisAs the COVID-19 pandemic continues to exert heavy strain on the global economy, the International Monetary Fund (IMF) is proposing a $50 billion trust fund which could help low-income and vulnerable middle-income countries to build resilience and sustainability.\nThe trust fund is part of IMF’s options for channeling some of the $650 billion Special Drawing Rights (SDRs) issued in August 2021 to countries with strong external financial positions as well as vulnerable countries through a Resilience and Sustainability Trust (RST).\nLike the IMF’s highly concessional and currently zero interest rate Trust for low-income countries, the RST’s resources would be mobilised on a voluntary basis from members who wish to channel their SDRs or currencies for the benefit of poorer or vulnerable countries.\nThe IMF stated: “Even as countries continue to battle COVID-19, it is crucial not to overlook the longer-term challenge of transforming economies to become more resilient to shocks and achieve sustainable and inclusive growth.\nIt added that the RST’s central objective was to provide affordable long-term financing to support countries as they tackle structural challenges."
  },
  {
    "headline": "NEC: Fuel Subsidy Stays for Now, But May Be Removed Before Year End",
    "summarized_story": "It, however, did not rule out the possibility of the subsidy being removed before the end of this year.\nThe federal government had disclosed plan to phase out the fuel subsidy regime by the second half of this year.\nWhen asked if fuel subsidy removal was discussed at the meeting, Obaseki said though Council discussed the issue, no decision was taken on the matter.\nAccording to him: “The issue of subsidy has been one matter that NEC has deliberated on, for more than a year now.\n“You have to understand that we didn’t make any presentations on the fuel subsidy because there has not been a decision."
  },
  {
    "headline": "Tinubu Visits IBB, Seeks Ex-Military Leader’s Blessing for Presidential Bid",
    "summarized_story": "By Laleye DipoAll Progressives Congress National Leader and former Lagos State Governor Asiwaju Bola Ahmed Tinubu Thursday visited former military president, General Ibrahim Badamasi Babangida, to “get his blessing”.l for his presidential bid.\nTinubu after the parley told newsmen that he was in IBB’s residence to seek his blessing, saying ” there is no way I will visit Niger state without visiting IBB and receive his prayers.\n“I cannot come to Niger state and not stop by to pay a courtesy call on the enigma, General Ibrahim Badamasi Babangida”, Tinubu said.\nGenerally, I came to Niger state to commiserate with the Governor and the people of Niger state.\nThe presidential aspirant had earlier paid a courtesy call on Governor Bello, who spoke glowingly of his contributions to the development of Lagos State."
  },
  {
    "headline": "Buhari: How I Cheated Death in 2014",
    "summarized_story": "Inaugurates flyover, other projects in KadunaDeji Elumoye in AbujaPresident Muhammadu Buhari has gone down memory lane to recollect how he cheated death in Kawo, Kaduna State in 2014.\nSpeaking Thursday while inaugurating the 800-metre long flyover in Kawo, Kaduna State, the President recounted how he narrowly escaped a targeted bomb attack in the vicinity in 2014.\nReminiscing on the unfortunate incident, which claimed the lives of many innocent Nigerians, President Buhari thanked God for sparing his life on that fateful day along Ali Akilu road, Kawo-Kaduna.\nAccording to him: ”For many years, I always plied this route and I cannot recount how many times I crossed it.\nAt the Murtala Square, the new city centre of Kaduna State, President Buhari while admiring the remodelled edifice, recalled that he was constrained by family challenges to relocate from Daura to Kaduna after he was released from detention as a former military Head of State."
  },
  {
    "headline": "Governor Akeredolu Under Fire Over Appointment Of Ondo State Oil Producing Area Development Commission Chairman",
    "summarized_story": "Members of the All Progressives Congress, community leaders, youth leaders and various stakeholders from Ese-Odo Local Government Area of Ondo State have condemned the appointment of Sam Erejuwa as Chairman of Ondo State Oil Producing Area Development Commission.\nGovernor Rotimi Akeredolu had on Thursday named Erejuwa, an indigene of Ilaje LGA, as chairman of the commission.\nDespite all entreaties, the governor looked the other way and appointed another llaje- Ugbo man as chairman of the commission.\n“No Arogbo Ijaw man has been OSOPADEC chairman since its creation in 2001.\nNo Arogbo Ijaw person has been appointed commissioner on the board of NDDC since its creation."
  },
  {
    "headline": "Governor Akeredolu Under Fire Over Appointment Of Ondo State Oil Producing Area Development Commission Chairman",
    "summarized_story": "Members of the All Progressives Congress, community leaders, youth leaders and various stakeholders from Ese-Odo Local Government Area of Ondo State have condemned the appointment of Sam Erejuwa as Chairman of Ondo State Oil Producing Area Development Commission.\nGovernor Rotimi Akeredolu had on Thursday named Erejuwa, an indigene of Ilaje LGA, as chairman of the commission.\nDespite all entreaties, the governor looked the other way and appointed another llaje- Ugbo man as chairman of the commission.\n“No Arogbo Ijaw man has been OSOPADEC chairman since its creation in 2001.\nNo Arogbo Ijaw person has been appointed commissioner on the board of NDDC since its creation."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Mounts Checkpoints On Borno Highways, Now Collects ‘Taxes’ From Travellers",
    "summarized_story": "Travellers in some communities in Borno State are now being forced by militants of the Islamic State West Africa Province (ISWAP) faction of the Boko Haram, to pay what they call, taxes.\nMilitary sources told SaharaReporters that the terrorists mounted roadblocks in the Gubio Local Government Area on Wednesday, issuing tax receipts to travellers.\nThis is coming hours after SaharaReporters published tax receipts issued by the terror group to farmers and herdsman in some North-East states.\nThe receipts were issued to residents of some farming communities in Borno State under the control of the group after collection of levies and taxes from them.\nIt, nevertheless, imposed new taxes and levies in the areas controlled by ISWAP-Boko Haram, to regulate trades and agricultural activities."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Mounts Checkpoints On Borno Highways, Now Collects ‘Taxes’ From Travellers",
    "summarized_story": "Travellers in some communities in Borno State are now being forced by militants of the Islamic State West Africa Province (ISWAP) faction of the Boko Haram, to pay what they call, taxes.\nMilitary sources told SaharaReporters that the terrorists mounted roadblocks in the Gubio Local Government Area on Wednesday, issuing tax receipts to travellers.\nThis is coming hours after SaharaReporters published tax receipts issued by the terror group to farmers and herdsman in some North-East states.\nThe receipts were issued to residents of some farming communities in Borno State under the control of the group after collection of levies and taxes from them.\nIt, nevertheless, imposed new taxes and levies in the areas controlled by ISWAP-Boko Haram, to regulate trades and agricultural activities."
  },
  {
    "headline": "EXCLUSIVE: Boko Haram Mounts Checkpoints On Borno Highways, Now Collects ‘Taxes’ From Travellers",
    "summarized_story": "Travellers in some communities in Borno State are now being forced by militants of the Islamic State West Africa Province (ISWAP) faction of the Boko Haram, to pay what they call, taxes.\nMilitary sources told SaharaReporters that the terrorists mounted roadblocks in the Gubio Local Government Area on Wednesday, issuing tax receipts to travellers.\nThis is coming hours after SaharaReporters published tax receipts issued by the terror group to farmers and herdsman in some North-East states.\nThe receipts were issued to residents of some farming communities in Borno State under the control of the group after collection of levies and taxes from them.\nIt, nevertheless, imposed new taxes and levies in the areas controlled by ISWAP-Boko Haram, to regulate trades and agricultural activities."
  },
  {
    "headline": "FAKE NEWS ALERT: PVCs issued in 2011 don’t need revalidation, says INEC",
    "summarized_story": "The Independent National Electoral Commission (INEC) says all permanent voter cards (PVCs) issued by the commission do not require revalidation.\nA message stating that PVCs issued in 2011 need to be revalidated has been circulating on social media platforms.\nAdvertisement“To be sure, PVCs issued in 2011 and after do not need any revalidation.\n“What the Commission intends to use is a multi-purpose gadget, known as the INEC Voter Enrolment Device (IVED).\n“The general public should therefore disregard the fake news making the rounds that the PVCs issued in 2011 need revalidation."
  },
  {
    "headline": "FAKE NEWS ALERT: PVCs issued in 2011 don’t need revalidation, says INEC",
    "summarized_story": "The Independent National Electoral Commission (INEC) says all permanent voter cards (PVCs) issued by the commission do not require revalidation.\nA message stating that PVCs issued in 2011 need to be revalidated has been circulating on social media platforms.\nAdvertisement“To be sure, PVCs issued in 2011 and after do not need any revalidation.\n“What the Commission intends to use is a multi-purpose gadget, known as the INEC Voter Enrolment Device (IVED).\n“The general public should therefore disregard the fake news making the rounds that the PVCs issued in 2011 need revalidation."
  },
  {
    "headline": "Muslim commissioner sponsors building of CAN secretariat in Osun",
    "summarized_story": "Bola Oyebamiji, commissioner for finance in Osun and the Balogun Musulumi of Ikireland, has sponsored the building of a secretariat for the Christian Association of Nigeria (CAN) in Irewole LGA in the state.\nSpeaking at the unveiling of the secretariat on Thursday, Samson Ayokunle, CAN president, commended Oyebamiji for his efforts and urged Nigerians to embrace religious tolerance.\nAccording to Punch, the CAN president expressed delight that the commissioner has shown a good example for others to emulate.\nIt is nice to know that the sponsor of this project for CAN Irewole is a devout Muslim.\nExplaining why he sponsored the building of the secretariat, Oyebamiji said he was motivated to embark on the project by Adegboyega Oyetola, governor of the state, who he described as someone with a good heart."
  },
  {
    "headline": "Muslim commissioner sponsors building of CAN secretariat in Osun",
    "summarized_story": "Bola Oyebamiji, commissioner for finance in Osun and the Balogun Musulumi of Ikireland, has sponsored the building of a secretariat for the Christian Association of Nigeria (CAN) in Irewole LGA in the state.\nSpeaking at the unveiling of the secretariat on Thursday, Samson Ayokunle, CAN president, commended Oyebamiji for his efforts and urged Nigerians to embrace religious tolerance.\nAccording to Punch, the CAN president expressed delight that the commissioner has shown a good example for others to emulate.\nIt is nice to know that the sponsor of this project for CAN Irewole is a devout Muslim.\nExplaining why he sponsored the building of the secretariat, Oyebamiji said he was motivated to embark on the project by Adegboyega Oyetola, governor of the state, who he described as someone with a good heart."
  },
  {
    "headline": "'I killed five-year-old pupil with N100 rat poison' -- Kano teacher gives details of Hanifa's murder",
    "summarized_story": "Abdulmalik Tanko, a teacher arrested over the murder of Hanifa Abubakar, a five-year-old pupil in Kano, says he killed her with rat poison.\nTanko, who was paraded by the police on Thursday, confessed to the murder while answering questions on his involvement in the crime.\n“I lied to Fatima and Isyaku that the girl’s mother was the one behind the plan to kidnap the girl in order to extort her father,” he said.\nAdvertisement“After Hashimu and Fatima failed to kidnap the girl, I decided to carry out the kidnapping myself.\nI was the one that dug the grave and he offered to pay me after we buried the girl."
  },
  {
    "headline": "Ismael Belkhayat on his way to building Morocco's first unicorn",
    "summarized_story": "For Belkhayat, who has since adopted Ironman as his alias, competing at the sport can be likened to building a business.\nThe next idea came during a trip; Belkhayat had chosen to accompany his wife Sophia Alj, ex-strategy consultant at McKinsey, during a business trip.\nAccording to Belkhayat, Chari currently transacts about $2.5 million monthly.\nBelkhayat the strategistBased on lessons from his previous startups, Belkhayat carved a different operational strategy for Chari, a strategy that rounds up its liability to almost zero.\nEven though Belkhayat is bullish on expanding in many African countries in the coming months, there are countries he won’t go to."
  },
  {
    "headline": "Topship goes from being an Instagram business to a YCombinator company",
    "summarized_story": "That’s an ambitious statement from a company that was operating only on Instagram just 18 months ago.\nBut how did an Instagram business pivot into becoming a tech startup and then get into YC, the world’s biggest accelerator programme with a 1.5% acceptance rate?\nSo, in June 2020, Enenwali started Topship as a one-man shop, opened an Instagram account and started helping people to move parcels locally.\nBut to be Africa’s Flexport, Topship had to be a full technology company, so Enenwali decided to build software that handles the end-to-end process.\nIt’s obvious Topship is really going all-in on its adoption of the Flexport model; it’s already a tech-enabled business and in YC, just like Flexport."
  },
  {
    "headline": "How Moni Africa leverages social trust to finance mobile money agents",
    "summarized_story": "Get the best African tech newsletters in your inboxFollowing a conversation in November 2020 with a cluster of mobile money agents in the Shapati community in Lekki-Ajah, Lagos, one thing was clear to Iromini: liquidity is a major challenge plaguing the mobile money ecosystem.\nThe startup instead leverages an algorithm developed around social trust and social underwriting that’s seen the platform achieve a highly impressive repayment rate.\nMoni Africa claims its revenue has grown 50% month-on-month so far and most of its agents, about 70% of which are women, have grown their businesses by 3x.\nIts 0.1% default rate, according to the CEO, can be attributed to the platform’s community-based model and interest rate which supports the unit economics of a mobile money agent.\nIn the long run, the startup plans to expand its community-finance model beyond mobile money agents to different SMEs across Africa."
  },
  {
    "headline": "What exactly is Web3?",
    "summarized_story": "This was historic as it helped filter out shams and highlight the real success stories, which laid the foundation for subsequent successful internet companies.\nWeb2 companies build sleek and revolutionary apps that become popular quickly, and as the app’s popularity increases, so does its user base.\nSince these web apps are controlled by a single internet company, users can only use them as long as the company wants them to.\n“Web3” was coined in 2014 by Gavin Wood, president and founder of Web3 Foundation, and he said then that it was going to be the next version of the internet.\nThat is why Nigerian crypto entrepreneur, Yele Bademosi, started out his Web3 development plan in Africa with Breach, a platform that uses newsletters, blog posts, quizzes, etc to teach Africans complex Web3 topics."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "Techpoint Build Spotlight: 54Gene is developing world class health technologies for Africa",
    "summarized_story": "Share this article:In recent years, Africa has lagged behind the rest of the world in medical technologies and research.\nJust 3% of African genomic data is represented in global medical research.\nAdvertisementToday’s personality on Techpoint Build Spotlight, Delali Attipoe, COO of 54Gene, takes a little peek at what’s to come in health research.\n54gene’s role in African healthcare is to ensure that disease treatments and therapies for Africans are more suited to their genetic composition because personalized medicine is the future of healthcare.\nWhat makes you excited about Techpoint Build 2021Participating in Techpoint Build not only gives us an opportunity to tell the amazing 54gene story and our impact in healthcare so far but also reinforces our position as a leading technology-based genomics research startup."
  },
  {
    "headline": "Nigeria’s Oxfordbuildbay wants you to easily own land, no matter how much you earn",
    "summarized_story": "“We found that there’s a constant issue around omo onile (traditional landowners), there’s the issue around finding out who actually owns the land.\nA 2019 survey of 5,000 Nigerians showed that 62 – 63% of owned land comes by family inheritance, and just 18% bought theirs outrightly.\nFounders of Oxfordbuildbay: Stephen Nwachukwu – CFO/ Head of Growth (left), Olamilekan Adeniji – MD (right).\n“On the other hand, you could simply create an account, log in to your dashboard, click on the land locations, which will bring out the different land locations we have as of today, and then click on buy.\nBusiness model and expansionFrom left to right: Akinyinka Akinpelu – Head of Business, Stephen Nwachukwu – CFO/ Head of Growth, Olamilekan Adeniji – Managing Director and CEO, Oxfordbuildbay."
  },
  {
    "headline": "Insurpass and insurance plans, Remix for public videos, Chari’s $100m bridge",
    "summarized_story": "While this indicates a slow improvement in the country’s health system, only over 10 million out of a growing population of 200 million Nigerians are currently covered by health insurance.\nThis is done through various programmes by the National Health Insurance Scheme (NHIS), state health insurance agencies, and private plans run by Health Maintenance Organisations (HMOs).\nOluwanifemi Kolawole spoke with the co-founders, who explained how the company plans to increase insurance adoption in the country.\nAny public video on Instagram is fair game for a remix.\nChari’s bridge round at $100 million valuationSource: SuppliedChari, a Moroccan B2B e-commerce and retail startup, has raised a bridge round at a $100 million valuation."
  },
  {
    "headline": "COVID-19: Nigeria missing as South Africa, Kenya, Egypt to produce Merck pill",
    "summarized_story": "Nigeria is missing on the list of African countries that have been selected in a landmark deal to produce low-cost versions of molnupiravir, an oral COVID-19 antiviral medicine produced by Merck & Co.\nBut, Nigeria’s failure to revamp or scale up the country’s capacity for drug manufacturing at par with global standards is excluding it.\nOperations of existing drug manufacturing plants hardly conform to global standards for general manufacturing practice (GMP), a deficit analyst say inhibits the potential to attract top manufacturing deals.\nWhile 13 companies will produce both raw ingredients, nine will produce the finished drug.\nThe companies span 11 countries, including Bangladesh, China, Egypt, India, Indonesia, Kenya, Pakistan, South Africa, South Korea, and Vietnam."
  },
  {
    "headline": "Streaming vs cinemas: How Nollywood can thrive",
    "summarized_story": "There is, however, a bigger incentive pushing producers and investors in Nollywood toward streaming services – the promise of a global audience.\nThese limitations have played a role in the popularity of streaming services.\nBut the streaming services have made quality production a must-have and now control how the distribution of the movies is run.\nFor example, in areas where 4G is scarce, users may not be able to enjoy the streaming services.\nIn the absence of streaming services in major parts of the country, cinemas can fill the gap for movie lovers through community cinemas."
  },
  {
    "headline": "Don Urges FG To Create A Favourable Environment For The Green Manufacturing Technology – Nigerian Observer",
    "summarized_story": "Vincent Aizebeoje Balogun have called on the Federal Government to create a favourable environment for the green manufacturing technology sector to thrive.\nAnd to develop the green manufacturing technology through the use of its local content technology for the production of goods in the manufacturing sector.\n“Rather, we need to employ and develop our green manufacturing sector so that we can create more jobs and take our citizens out of the streets” he said.\nHe urged manufacturers operating in the country to key into the green manufacturing technology for the manufacturing of their products.\n“For green manufacturing to thrive, there has to be an understanding and advocacy on the modus operandi towards green mechanical machining processes."
  },
  {
    "headline": "Tipper drivers protest killing of colleague by security personnel in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Angry tipper drivers protested the killing of their colleague by security personnel alleged to be operative of the Department of State Services (DSS) in Benin City.\n“And before a blink of eye, the DSS operatives opened fire which resulted in the death of a tipper driver.\nThe development caused heavy gridlock in the Benin metropolis as other drivers protested the death of their colleague.\nThe source said the hoodlums, upon sighting the DSS operatives, pounced on them with guns and various dangerous weapons.\nThe DSS source said its operatives sustained varying degrees of injuries during the attack while their vehicles were also damaged."
  },
  {
    "headline": "Diaspora group lite up Edo community – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUDU – As part of efforts to contribute to the development of Abudu, a group under the aegis of Abudu in Diaspora Group has commenced installation of about 250 solar streetlights in the community.\n“We (Abudu in diaspora group) are responsible for the Abudu lighting up project; our motive was to help our people back home at Abudu.\n“When we use to stay in Abudu, people come from outside the state to come and stay in Abudu.\nWe have other projects, and we hope at least we should be able to do one project every year in the community.\nthe solar streetlights project is just a starting point for things to come”."
  },
  {
    "headline": "Nation Blue Economy: Vice President Seeks Stakeholders Participation, Inaugurates Expanded Committee – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Vice President, Prof Yemi Osinbajo has sought for wider participation of relevant stakeholders in the blue economy project to deepen participation and benefits of Nigerians from the country’s marine resources.\nOsinbajo made the call at the inaugural meeting of an Expanded Committee on Sustainable Blue Economy in Nigeria in the Presidential Villa recently.\nAccording to him, a viable blue economy project will offer vista of opportunities not only for littoral states where there are bodies of waters but for the entire country.\n“Countries have to define the scope of their blue economy based on their priorities.\nIn his opening remark, Transportation Minister, Rotimi Amaechi said the blue economy is capable of improving government revenue, create employments and grow the gross domestic product of Nigeria."
  },
  {
    "headline": "IMF proposes $50bn Trust Fund for Nigeria, other developing countries",
    "summarized_story": "The International Monetary Fund (IMF) is proposing a $50 billion trust fund for Nigeria and other low and vulnerable middle-income countries.\nIn a blog post published on Thursday, it explained that the fund was targeted at helping countries in that category to build resilience and sustainability.\n“A proposed $50-billion trust fund could help low-income and vulnerable middle-income countries build resilience to balance of payments shocks and ensure a sustainable recovery,” said the Washington-based institution.\nRecall that Nigeria was allocated about $3.35 billion of the sum, as part of the historic general allocation of SDRs of the IMF.\nThe amount allocated to Nigeria is as a result of the exchange rate of reference which is 0.702283 SDR to a dollar, and Nigeria has 2.4545 billion SDRs as of July 1, 2021."
  },
  {
    "headline": "Nigeria’s Excess Crude Account now $35m",
    "summarized_story": "Nigeria’s Excess Crude Account now stands at $35,868,086.40 as at 17th January 2022, the National Economic Council has revealed.\nIn his presentation, Mr Agba revealed the current state of Nigeria’s underlisted accounts as at 17th of January 2022.\nAccording to him, “Nigeria’s Excess Crude Account (ECA) Balance As At 17th January 2022 Stands At $35,868,086.40.\n“Stabilization Account Balance As Of 17th January 2022 Stands At N30, 685, 611, 413.79.\nDevelopment Of Natural Resources Account Balance As At 17th January 2022 Stands At N42, 820,382,381.40.”The ECA is a savings account retained by the Federal Government and is funded by the difference between the market price of crude oil and the budgeted price of crude oil as contained in the appropriation bill."
  },
  {
    "headline": "NFF says Peseiro has not signed contract to take over from Eguavoen",
    "summarized_story": "An official of the Nigeria Football Federation (NFF) has said Portuguese coach, Jose Peseiro has not signed any contract to take over as coach of the Super Eagles after the 2021 Africa Cup of Nations.\nThe NFF had before the Nations Cup, indicated that it had hired Peseiro to take over from Augustine Eguavoen, who is currently the NFF technical director.\nEguavoen was put in charge of the team after Gernot Rohr was fired.\n“He is not in Cameroon because we have not signed a contract with him yet, he said.\n“If he had signed a contract, he would have definitely been in Cameroon as planned."
  },
  {
    "headline": "Terrorists kill two officers in Katsina base attack",
    "summarized_story": "Terrorists on Tuesday, killed a soldier and an officer of the Nigeria Security and Civil Defence Corps (NSCDC) during an attack on a military base in Shinfida community, Jibia Local Government Area of Katsina State.\nThe terrorists were said to have stormed the military camp in large numbers and began to shoot at the place sporadically.\n“The terrorists attacked the military base located within Government Day Secondary School Shinfida last Tuesday.\n“They attacked the military base on their motorcycles.\nSimilarly, the Niger State Government has confirmed an attack on Ukuru village in the Bobi District of Mariga Local Government of the state, saying unspecified number of people were killed during the attack."
  },
  {
    "headline": "Diri’s Wife Leads Campaign Against Ritual Killings, Others",
    "summarized_story": "Wife of the Bayelsa State governor, Dr Gloria Diri, has led a coalition of civil society and girl-child welfare advocacy groups to campaign against ritual killings and harvest of human organs in some parts of the state.\nShe called on security agencies to step up the protection of the girl-child in the state.\nLet us watch and protect one another against ritual killing.\nWe are also now against out-of-court settlements and we want the law to punish the perpetrators.\nRitual killing is a distraction because if a child goes missing, government will abandon what they are doing and go in search of the missing child.”ADVERTISEMENT"
  },
  {
    "headline": "56 Years Of Denial Fuelling Biafra Agitation – Ohanaeze Youths",
    "summarized_story": "Apex Igbo socio-cultural youth organisation, Ohanaeze Youth Council (OYC) has attributed the agitation for the restoration of the Sovereign State of Biafra to the denial of a Nigeria president of the Southeast extraction for 56 years.\n“Others are Lower Nigeria Congress led by Tony Nnadi, Biafran National Council led by Asari Dukubo, Biafra National Guard led by Comrd.\nInnocent Orji, Biafra National Youth Guard led by Comrd.\nObinna Ude, Biafra ZOINIST led by Benjamin Onwuka, Biafra Shadow Government led by Engr.\nTherefore, they seek secession for the actualisation of the state of Biafra” Igboayaka revealed."
  },
  {
    "headline": "Minister Lauds Buhari’s Approval Of Minna-Baro Rail Line Project",
    "summarized_story": "He said the approval which is an attestation to President Muhammadu Buhari’s commitment to infrastructure development would boost trading, mining and agro allied activities in and around the state and improve the efficiency of National Inland Waterways Authority (NIWA).\nSambo stated this when he played host to the management team of the National Inland Waterways Authority (NIWA), led by its Managing Director and Chief Executive Officer, Chief George Moghalu who paid a courtesy visit to the Honourable Minister.\nHe said he was sure of increased success in the Federal Ministry of Works and Housing with the pedigree of the Honourable Minister, Mr.Babatunde Raji Fashola, SAN who he referred to as his brother.\nHe thanked the NIWA team for the courtesy visit and their best wishes for him while pledging to continue the bond of relationship with NIWA, his former office which he described as a family relationship and also promised to give them support where necessary.\nEarlier, the managing director and chief executive officer National Inland Waterways Authority, Chief George Moghalu told the Minister that they were in his office to congratulate him on his appointment as the Minister of State for Works and Housing and wish him well."
  },
  {
    "headline": "Minister Lauds Buhari’s Approval Of Minna-Baro Rail Line Project",
    "summarized_story": "He said the approval which is an attestation to President Muhammadu Buhari’s commitment to infrastructure development would boost trading, mining and agro allied activities in and around the state and improve the efficiency of National Inland Waterways Authority (NIWA).\nSambo stated this when he played host to the management team of the National Inland Waterways Authority (NIWA), led by its Managing Director and Chief Executive Officer, Chief George Moghalu who paid a courtesy visit to the Honourable Minister.\nHe said he was sure of increased success in the Federal Ministry of Works and Housing with the pedigree of the Honourable Minister, Mr.Babatunde Raji Fashola, SAN who he referred to as his brother.\nHe thanked the NIWA team for the courtesy visit and their best wishes for him while pledging to continue the bond of relationship with NIWA, his former office which he described as a family relationship and also promised to give them support where necessary.\nEarlier, the managing director and chief executive officer National Inland Waterways Authority, Chief George Moghalu told the Minister that they were in his office to congratulate him on his appointment as the Minister of State for Works and Housing and wish him well."
  },
  {
    "headline": "Kwara Executes 143 Road Projects In 3 Years",
    "summarized_story": "Kwara State government has worked on 143 roads in the last three years.\nADVERTISEMENTHe said that the state government in collaboration with security agencies would embark on the arrest and prosecution of offenders, especially shop owners along such roads.\n“There’s a need for attitudinal change among our people, especially artisans and shop owners along major roads in the state, particularly in the Ilorin metropolis.\nWhat they don’t know is that the government would spend money meant for other people- oriented projects on repair of the damaged roads.\nThe state government would soon start prosecuting shop owners along such roads”, he said."
  },
  {
    "headline": "Alleged $119m Saipem Fraud: Court orders arrest of two Italians",
    "summarized_story": "The Rivers State High court in Port Harcourt has ordered the arrest of two Italian citizens – Giandomenico Zingali and Davide Anelli – over their refusal to attend court proceedings to answer charges of alleged $119 million power plant fraud.\n2 Laws of Rivers State of Nigeria 1999.\nSaipem and its top management staff are to be prosecuted based on fiat issued to Godwin Obla, SAN, George Adeyemi, and John Eche Okpe, both of OBLA & Co, Abuja by Rivers State government.\n“The charges are summarised as follows:Conspiracy contrary to Section 518(6) & (7) and punishable under Section 518 of the Criminal Code, Cap 37, Vol.\n2, Laws of Rivers State of Nigeria, 1999;“Cheating contrary to Section 421 and punishable under Section 421 of the Criminal Code, Cap 37, Vol."
  },
  {
    "headline": "Alleged $119m Saipem Fraud: Court orders arrest of two Italians",
    "summarized_story": "The Rivers State High court in Port Harcourt has ordered the arrest of two Italian citizens – Giandomenico Zingali and Davide Anelli – over their refusal to attend court proceedings to answer charges of alleged $119 million power plant fraud.\n2 Laws of Rivers State of Nigeria 1999.\nSaipem and its top management staff are to be prosecuted based on fiat issued to Godwin Obla, SAN, George Adeyemi, and John Eche Okpe, both of OBLA & Co, Abuja by Rivers State government.\n“The charges are summarised as follows:Conspiracy contrary to Section 518(6) & (7) and punishable under Section 518 of the Criminal Code, Cap 37, Vol.\n2, Laws of Rivers State of Nigeria, 1999;“Cheating contrary to Section 421 and punishable under Section 421 of the Criminal Code, Cap 37, Vol."
  },
  {
    "headline": "2023: Every candidate must declare bank asset – INEC",
    "summarized_story": "The Independent National Electoral Commission on Friday said it would beam its searchlight on politicians and political parties to track the sources of funds for their campaigns in the 2023 general election.\nHe said, “As long as we have not notified anybody that the race to the 2023 general election has started, we are not unaware of what anybody is doing.\n“We have not officially declared notice for the 2023 general election, but when we so declare, we will put our monitoring committees to motion like the Central Bank of Nigeria, DSS, EFCC, the ICPC, (commercial) banks and other law enforcement agencies.\n“Every candidate must be made to declare his bank asset.\nThe INEC chairman also threatened to prosecute any bank that failed to cooperate."
  },
  {
    "headline": "2023: Every candidate must declare bank asset – INEC",
    "summarized_story": "The Independent National Electoral Commission on Friday said it would beam its searchlight on politicians and political parties to track the sources of funds for their campaigns in the 2023 general election.\nHe said, “As long as we have not notified anybody that the race to the 2023 general election has started, we are not unaware of what anybody is doing.\n“We have not officially declared notice for the 2023 general election, but when we so declare, we will put our monitoring committees to motion like the Central Bank of Nigeria, DSS, EFCC, the ICPC, (commercial) banks and other law enforcement agencies.\n“Every candidate must be made to declare his bank asset.\nThe INEC chairman also threatened to prosecute any bank that failed to cooperate."
  },
  {
    "headline": "Moment Buhari's posters defaced in Zaria: Untold story of President's visit",
    "summarized_story": "With standard of living dropping and hardship reported countrywide, President Muhammadu Buhari’s popularity is also on the downward slope.\nBut his hosts in Kaduna did not probably tell him the pulse of the public as disgruntled residents of Zaria either defaced or tore the president’s posters announcing his visit.\nOne of such moments was captured in video in Zaria, Governor Nasir El-Rufai’s hometown.\nP.M. News learnt that in many places where the Buhari posters were torn or defaced, the El-Rufai government had to re-paste.\nIt then put policemen in those areas to stop further defacement of the posters."
  },
  {
    "headline": "Buhari's town adopts Amaechi as 'trusted son', turbaning soon",
    "summarized_story": "By Lucy OgalueTransportation Minister, Rotimi Amaechi, will be turbaned as Dan Amanar Daura,, meaning ‘Trusted Son of Daura’ on Feb. 5.\nThe Director of Press and Public Relations in the ministry, Mr Eric Ojiekwe, disclosed this in a statement on Friday.\nHe said Amaechi will be honoured, especially for his effort in bringing to life the rail sector that has been moribund for over three decades.\nHe said the turbaning ceremony would be performed by the Emir of Daura, Dr Umar Farouk Umar, at the Emir’s Palace in Daura, Katsina State, by 11:00 am.\n”The highlight of the occasion will be a royal durbar in honour of the Minister and invited dignitaries,” he added."
  },
  {
    "headline": "Ogun State Gov Dapo Abiodun Declares ‘War’ On Yahoo boys, Kidnappers",
    "summarized_story": "Ogun State Governor Dapo Abiodun has launched war on internet scammers, sometimes known as Yahoo boys.\nSadly, he said to me that Ogun State tops the list on ‘Yahoo Yahoo Boys’.\nIn my response, I said I am not surprised because Ogun State is the education capital of this country and you will find such educational institutions around and he agreed with me.\n“We have decided that we will set up our State Commission that will be targeted towards eliminating these sorts of financial crimes.\nOur state commission will collaborate with the Federal Commission so that we do not occupy that false place in this area."
  },
  {
    "headline": "President Buhari Reacts To Murder Of 5-Year-Old Girl In Kano",
    "summarized_story": "Recall that little Hanifa had gone missing since December last year, prompting intelligence agencies to launch a search into her whereabouts.\nThe security agencies made a breakthrough recently, as her body was discovered in a shallow grave in Kano, after almost two months of search by security operatives.\nDAILY POST gathered that the arrest of her teacher and his other accomplices in the child’s kidnap and murder have also been effected.\nBuhari said the entire country, which was following the incident with keen interest, were optimistic that Hanifa would be rescued alive.\nWhile praying for the repose of the soul of the little school girl, the President urged her parents to bear the sad loss with courage and fortitude in God."
  },
  {
    "headline": "IGP Replaces Odumosu With New Lagos police commissioner",
    "summarized_story": "IGP Replaces Odumosu With New Lagos police commissionerA new Commissioner of Police has been appointed to the Lagos State Police Command.\nThis follows the deployment of Hakeem Odumosu to the Force Headquarters in Abuja.\nHakeem Odumosu was recently promoted to the rank of Assistant Inspector-General of Police.\nAlabi’s deployment to Lagos was contained in a police wireless message dated January 20, 2022.\n“The posting is with immediate effect,” the police signal read in part."
  },
  {
    "headline": "EFCC Arraigns Funmi Adenmosun For Alleged N26.6bn Investment Fraud In Lagos",
    "summarized_story": "EFCC Arraigns Funmi Adenmosun For Alleged N26.6bn Investment Fraud In LagosFunmi Adenmosun, a businessman, was charged with fraud by the Economic and Financial Crimes Commission (EFCC) on Friday.\nThe defendant was docked before Justice Daniel Osiagor of the Federal High Court, in Ikoyi, Lagos.\nAdenmosun faces a 10-count charge bordering on conspiracy and money laundering to the tune of N26,600,000,000.\nHe was arraigned alongside two companies: Home Trust Savings and Loan Limited, and Rare Properties and Development Limited."
  },
  {
    "headline": "2023: How Tinubu’s declaration, Osinbajo’s ambition unsettle South-west, APC",
    "summarized_story": "ABDULRAHMAN ZAKARIYAU and BODE OLAGOKE in this report examines how former Lagos state governor Asiwaju Bola Ahmed Tinubu’s declaration and Vice President Professor Yemi Osinbajo’s ambition have unsettled the South-west and the ruling party.\nThough the APC is yet to zone its ticket, the few that have declared their intentions so far are from the South.\nOsinbajo’s ambitionFor months and even after Tinubu’s declaration those drumming support for the vice-president for the APC ticket have become more vociferous.\nThis is because those who are privileged to know the kind of relationship between the two of them know that it is deeper and such no political ambition can separate them.\nRecall that it was Asiwaju that nominated Osinbajo to become the vice-president; so you think a political ambition will divide them now?"
  },
  {
    "headline": "Breaking: NPFL club, MFM, sack coach one month after",
    "summarized_story": "After recording defeats, Nigeria Professional Football League (NPFL) side, MFM FC, have sacked Technical Adviser Balogun Shola Joshua, popularly known as Tella, one month after he was appointed.\nThe club reportedly decided to relieve Tella of his duties shortly after the team lost in Lagos to Rivers United.\nWith the defeat, MFM are now placed at the bottom of the table.\nDetails loading…"
  },
  {
    "headline": "Super Eagles battle Tunisia, Egypt face Ivory Coast in AFCON 2021 round of 16 *See full knockout stage fixtures",
    "summarized_story": "Nigeria’s Super Eagles will on Sunday face Tunisia in the second round of the ongoing Africa Cup of Nations in Cameroon.\nPrior to their last Group F showdown against the Scorpions, the North Africans needed a win to finish as runners-up.\nOn the other hand, the Super Eagles topped their group, claiming the maximum nine points after winning all three matches.\nMeanwhile, Egypt, who finished second in Nigeria’s group will have to step up and beat Ivory Coast for a place in the Quarter-Finals.\nAFCON Round of 16 fixtures23 JANBurkina Faso v Gabon – 17:00Nigeria v Tunisia – 20:00 24 JANGuinea v Gambia – 17:00Cameroon v Comoros – 20:00 25 JANSenegal v Cape Verde – 17:00Morocco v Malawi – 20:00 26 JANIvory Coast v Egypt – 17:00Mali v Equatorial Guinea – 20:00"
  },
  {
    "headline": "Buhari Asks Police, Justice Ministry To Uphold Integrity In Hanifa Abubakar’s Case",
    "summarized_story": "President Muhammadu Buhari has called on the relevant bodies to ensure justice is served in the murder of Hanifa Abubakar, the five-year-old schoolgirl killed in Kano State.\nHe specifically ordered the police and the Ministry of Justice to uphold the integrity of the detective work that busted the case by preparing well and presenting a good case that will earn the respect of the court.\nThe President stated that the thorough and painstaking detective operation by the law enforcement bodies, leading to the discovery of her remains and the arrest of the suspects who have already made confessions, was commendable.\nUntil her death, Hanifa was a pupil of a private school – Noble Kids Academy in Nassarawa Local Government Area of Kano State.\nHanifa was buried in a shallow grave within the school premises located at Kwanar ‘Yan Gana in Tudun Murtala Quarters."
  },
  {
    "headline": "Kano Govt Closes School Where Five-Year-Old Hanifa Was Killed, Buried",
    "summarized_story": "﻿The Kano State Government has ordered the immediate closure of a private school, Noble Kids Academy, in Nassarawa Local Government Area of the state, where abductors of a pupil, Hanifa Abubakar, were said to have killed and buried her remains.\nFive-year-old Hanifa was abducted late last year and one of those involved in the operation was her teacher, Abdulmalik Mohammed Tanko.\nThe abductors demanded a ransom of N6million but went ahead to kill her after receiving the money.\nRead Also: Kidnapped Five-Year-Old Girl, Hanifa Murdered By Teacher“On investigation, Abdulmalik confessed that the victim, Hanifa was his student at a private school in Kwanar Dakata, Nassarawa LGA, Kano State.\nWondering how he poisoned her, how he watched her struggling to die and how he cut her into pieces."
  },
  {
    "headline": "17 Killed, 59 Injured In Ghana Explosion",
    "summarized_story": "At least 17 people were killed and 59 injured Thursday in a devastating explosion in a western Ghana town after a truck carrying explosives intended for a mine collided with a motorcycle, the government said.\n“A total of 17 people have unfortunately been confirmed dead, and 59 injured people have been rescued,” Information Minister Kojo Oppong Nkrumah said in a statement released overnight.\nOut of 59 people injured, 42 are receiving treatment in hospitals or health centres and “some are in critical condition”, Nkrumah added.\n‘Ghost town’Officials and eyewitnesses described a scene of desolation against the sea of buildings collapsed or impaired in the carnage.\nDr Isaac Dasmani, chief executive of the Prestea Huni-Valley municipality where the explosion occurred, told local media “the whole community is gone” after the blast."
  },
  {
    "headline": "Lassa Fever: Nigeria Records 11 Deaths, 96 Cases In Two Weeks",
    "summarized_story": "No fewer than 11 people have died of Lassa fever since the beginning of the new year, the Nigeria Centre for Disease Control (NCDC) has said.\n“The male to female ratio for confirmed cases is 1 : 0.8.\nThe number of suspected cases has increased compared to that reported for the same period in 2021.\nBetween January 10 to 16, the NCDC said 244 suspected cases of Lassa fever were logged across 16 local government areas of eight states.\nThe confirmed cases were reported from Edo, Ondo, Bauchi, Benue, Kogi, Oyo, Taraba, and Ebonyi States."
  },
  {
    "headline": "Air Strike On Yemen Prison Leaves At Least 70 Dead",
    "summarized_story": "At least 70 people were killed in an air strike on a prison as Yemen’s long-running conflict suffered a dramatic escalation Friday that drew condemnation from UN chief Antonio Guterres.\nREAD ALSO: 14 Dead As Coalition Bombs Yemen After UAE Attack“The children were reportedly playing on a nearby football field when missiles struck,” Save the Children said.\nSaudi Arabia’s state news agency said the coalition carried out “precision air strikes… to destroy the capabilities of the Huthi militia in Hodeida”.\nIn retaliation, the coalition carried out air strikes against rebel-held Sanaa that killed 14 people.\nThe UN has estimated the war killed 377,000 people by the end of 2021, both directly and indirectly through hunger and disease."
  },
  {
    "headline": "Agege LGA holds security summit, assures residents of safer community -",
    "summarized_story": "The Agege local government area council has held a security summit to address the prevailing security challenges in the area.\nResidents of the ancient community are assured of improved security.\nAdvertisement"
  },
  {
    "headline": "APC national chairmanship: I won't join issues with any aspirant",
    "summarized_story": "A former governor of Zamfara state and one of the aspirant for the Chairmanship position in the All Progressives Congress Party, Abdulaziz Yari, said he will not join issues with any other aspirants for the position.\nAdvertisementMr Shinkafi says Abdulaziz Yari was not captured in the revalidation and registration exercise carried out by the party in Zamfara State.\nReacting to the allegations, Abdulaziz Yari says he’s a duly registered member of the All Progressives Congress Party.\nAdvertisementHe also accused Sani shinkafi of formenting trouble with the APC in the state given his antecedent from the All Progressives Grand Alliance (APGA).\nHe called on the Caretaker Committee to disregard Sani Shinkafi describing him as a “noise maker” and means no good for the party."
  },
  {
    "headline": "Tinubu donates N50m to Niger Govt to fight insecurity",
    "summarized_story": "National Leader of the All Progressives Congress, Asiwaju Bola Tinubu has donated N50 Million to the Niger State Government to tackle insecurity, banditry and other security challenges.\nHe made the donation during a condolence visit to the State governor in Minna on Thursday.\nAdvertisementGovernor Bello recently said more than 200 people have been killed in attacks in over 300 communities in the State this year.\nAdvertisement"
  },
  {
    "headline": "Asiwaju Tinubu charges Nigerians to collect PVC's",
    "summarized_story": "National leader of the APC, Asiwaju Bola Tinubu received APC women leaders across the country including the Federal Capital territory where he charged them to unite and go all out to collect their PVCs for them to be able to exercise their civic right during the forthcoming election.\nThe women say the visit was to affirm their support for Bola Tinubu’s 2023 Presidential ambition.\nAdvertisement"
  },
  {
    "headline": "Samuel Ortom: Nigerians Want to Be Rescued by PDP",
    "summarized_story": "With rising security issues across Nigeria, Benue State’s conflict over the enforcement of anti-grazing laws pushes state to implement steeper fines for lawbreakers.\nThis is spurred on by fear for the future of farmers in the state, who face regular attacks.\nIn an exclusive interview with ARISE, Benue State Governor, Samuel Ortom shares details on the review and gains of the anti-grazing laws including its impact on the security in Benue State.\nGovernor Ortom also sheds light on a number of issues relating to current state of affairs: his criticism of the Buhari administration and, his governorship including allegations of non-payment of salaries to Benue workers."
  },
  {
    "headline": "Waziri Adio: Oil Theft Loopholes are Too Much in Nigeria",
    "summarized_story": "Oil theft and illegal refinery operations in Rivers State have been blamed for the pollution of air quality in the state and posing a grave health risk to residents.\nThe governor early this week ordered the 23 local government area chairmen in the state to destroy all illegal crude oil bunkering and artisanal refinery sites in Rivers State.\nTo discuss the enormity of the problem Nigeria is dealing with and the measures government needs to take to end this malaise, is Waziri Adio, former Executive Secretary of the Nigeria Extractive Industries Initiative, NEITI, and Contributing Editor to the THISDAY-ARISE Media Group."
  },
  {
    "headline": "Buhari Welcomed By Mammoth Crowd in Kaduna – Trending With Ojy Okpe",
    "summarized_story": "President Muhammadu Buhari’s visit to Kaduna State, to inaugurate some projects initiated by the Governor of the State, Nasir el-Rufai has elicited reactions.\nThe bombing incident which left over 80 people dead was described by Buhari as an assassination attack.\nMeanwhile a video showing a mammoth crowd that welcomed the President when he arrived Kaduna for his 2-day visit to commission the projects in the state has made the rounds on social media.\nIn the video, the officer violently slapped the woman and opened fire while other officers at the scene tried to calm the situation.\nFinally Tori Yorgey, a television reporter was knocked down by a car while she was reporting live on air."
  },
  {
    "headline": "South Africa Cricket Coach Boucher Charged Over Racism Allegation",
    "summarized_story": "Cricket South Africa (CSA) has charged the men’s national team coach Mark Boucher with gross misconduct after he was accused of racism by former teammate Paul Adams.\nCSA added that a senior counsel, Advocate Terry Motau, had been appointed to chair a disciplinary hearing into allegations of misconduct against the coach.\nFormer spinner Adams said he had been called a “brown sh*t” in a South Africa team song during his time in the side, which spanned a nine-year period from 1995 to 2004, including by former wicketkeeper Boucher who has since apologised.\nBoucher is in charge of the South Africa One-Day International side who are one game into a three-match home series against India.\nA WhatsApp message received by journalists from CSA had a heading which stated that Boucher and Smith were suspended but this message was deleted almost immediately."
  },
  {
    "headline": "US Seeks to Speed Up Delivery of New F-16 Fighter Jets to Taiwan",
    "summarized_story": "More missions mean more wear-and-tear on Taiwan’s aircraft.\nA move to accelerate the aircraft delivery would be seen in Beijing in part through a political lens, according to Abraham Denmark, a former senior Pentagon official.\nThe missions to intercept Chinese aircraft are putting stress on Taiwan’s air force, which last year had several mishaps, including three fatal crashes.\nTaiwan’s air force last week suspended combat training for its entire F-16 fleet after a recently upgraded model of the fighter jet crashed into the sea in the latest of a series of accidents.\nIn 2020, Taiwan’s air force scrambled jets at least 2,972 times against Chinese aircraft at a cost equivalent to US$905m."
  }
]