[
  {
    "headline": "Ogun, WHO vaccinate HIV/AIDS patients against COVID-19",
    "summarized_story": "As part of efforts to vaccinate 50 per cent of the population in the ongoing nationwide mass vaccination against COVID-19, the Ogun State Government, in conjunction with the World Health Organisation, has taken the campaign to people living with HIV/AIDS.\nThe government and the WHO organised a three-day sensitisation programme for 50 persons living with HIV/AIDS from five local government areas of the state, according to a statement on Thursday.\nThe local government areas are Abeokuta North, Abeokuta South, Ifo, Ijebu-Ode and Sagamu.\nCoker said since the people living with HIV had compromised immunity, given their susceptibility to infections, it was important to provide them the vaccine to avoid unnecessary mortality.\nShe said the routine check-up of people living with HIV/AIDS would give the health workers access to them without stress, noting that the Ogun State Government was committed to protecting various vulnerable groups in the society."
  },
  {
    "headline": "Hisbah disowns plan to invite new Miss Nigeria, parents over immorality",
    "summarized_story": "The Kano Sharia Hisbah Board has denied planning to invite the recently crowned Miss Nigeria, Shatu Garko, and her parents for participating in the beauty contest.\nThe Director-General of the board, Dr Aliyu Kibiya, made the clarification while speaking to journalists in Kano on Thursday.\nSinai said her parents would soon be invited to speak on why they allowed her to participate in the contest.\nKibiya stated that the Hisbah board never at any time invited Shatu or her parents for questioning.\nKibiya said, “We never at any time issued any instruction inviting her (Shatu) or her parents for questioning."
  },
  {
    "headline": "Bandits issue Monday ultimatum to seven Zamfara communities to pay ransom of N37m or face consequences",
    "summarized_story": "By Bashir BelloBandits terriozing residents of Zamfara State has issued a Monday ultimatum to seven communities in Tsafe Local government area of the state to pay a sum of N37 million as ransom or it launch attack in the areas.\nThe communities include Bawagauga, Hayin Uda, Ruguza, Dumuyu, Zigau, Mai-Rerai and Gidan Kado.\nThe source said the bandits demanded that residents in Bawagauga pay N13 million, Hayin Uda to pay N7 million, Gidan Kado to pay N6 million and Mai-Rerai to pay N4 million while Ruguza, Dumuyu and Zigau were to pay N2 million each.\nThe source also revealed that the bandit leader identified as Hassan Bamamu has sometimes ago signed a peace pact with the government of Zamfara State and pledged to desist from banditry activities.\nThe source further said that it has already alerted the security authorities about the ultimatum for swift intervention."
  },
  {
    "headline": "Electoral Act: NBA knocks Buhari, says exercise of his veto power in bad faith",
    "summarized_story": "By Ikechukwu NnochiriABUJA–The Nigerian Bar Association, NBA, on Thursday, described as unfortunate, President Muhammadu Buhari’s decision not to assent to the Electoral Act (Amendment) Bill 2021.\nNBA, which is the umbrella body of legal practitioners in the country, said it was not convinced that the President demonstrated good faith in the exercise of his veto powers.\n“For the following reasons, we join other civil society groups and well-meaning Nigerians in expressing our discontent with the manner of the exercise of the President’s veto.\n“Nevertheless, we are not convinced that, in the circumstance, the President demonstrated good faith in the exercise of his veto powers.\n“We fail to see how the above actions contribute to strengthening the electoral process."
  },
  {
    "headline": "NAPTIP commences prosecution of Spain based Nigerian trafficker",
    "summarized_story": "NAPTIPSeeks global partnership to tackle human traffickingBy Joseph ErunkeABUJA–THE National Agency for the Prohibition of Trafficking in Persons,NAPTIP, has commenced the prosecution of a Spain based Nigerian, Patricia Ekhoe Igbinovia,who is notorious in the trafficking of Nigerian young women from Nigeria to Spain.\nTwo of the gang members of the notorious trafficker,who is also known as Mama Bobby and Audu Mariam Olayemi,are currently in detention in Spain.\nA statement to this effect,Thursday,by NAPTIP Press Officer,Adekoye Vincent,said,”The suspect has also been arraigned before Honourable Justice C. J. Aneke of the Federal High Court, Lagos.\n“These 4 strategic priorities plug into the 5-point overarching strategies of the Agency, which is Prosecution, Protection, Prevention, partnership and policy.\n“With the support of IOM, FIIAPP, Italian embassy, UNODC and other partners, we have successfully completed several capacity building for NAPTIP prosecutors, intelligence officers and investigators”."
  },
  {
    "headline": "I’ll keep doing my best till May 2023 I will leave office – Buhari",
    "summarized_story": "President Muhammadu BuhariBy Johnbosco AgbakwuruABUJA–PRESIDENT Muhammadu Buhari yesterday in Maiduguri, Borno State, said his administration will keep giving its best for the development of the country until May 2023, reiterating that he will hand over as stipulated by the Constitution.\nThe President spoke after the commissioning of Oriental Energies Resource Ltd Hanger, Muhammadu Indimi Distance Learning Centre and an International Conference Centre donated to the University of Maiduguri by business mogul, Alhaji Muhammadu Indimi.\nThe high-quality standard of this edifice is major contribution by Alhaji Muhammadu Indimi.\nGovernor Zulum said the state had recognised the contributions of Alhaji Indimi by renaming the Damboa Road after him, now Alhajji Muhammadu Indimi Road.\nVice Chancellor of the University, Prof Aliyu Shugaba, thanked President Buhari for honoring the invitation anf Alhaji Indimi for the contribution."
  },
  {
    "headline": "Kano-Maradi corridor: Amaechi meets German financing advisory",
    "summarized_story": "Minister of Transport, Rotimi Amaechi…Visits Mota-Engil rail site, PortugalBy Dirisu YakubuMinister of Transportation, Rotimi Amaechi, Thursday, met with the financing advisory for the construction of Kano-Maradi rail line, seeking a speed-up of the process to ensure construction begins in the next few weeks.\n“For us in the Ministry of Transportation, in choosing the right of way, we avoided communities.\nLike in Lagos, we avoided communities and used the old line, because if we had to choose a different route, we would pay billions.\n“We still paid compensation, because the rail line was moribund.\nTo eject them, we still had to treat them as though they were the original owners of the land."
  },
  {
    "headline": "EFCC probes audio alleging Nigeria’s AGF Malami controls agency",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has reacted to an explosive tape suggesting Nigeria’s Attorney General and Minister of Justice, Abubakar Malami controls the agency.\nIn the trending audio, Mohammed Idris, a lawyer and police officer, attached to the EFCC, made serious claims regarding the influence of Malami.\nThe operative stated that the AGF, who supervises the commission head by Abdulrasheed Bawa, compromised cases of corruption.\nEarlier, Yusuf declared Malami was in charge of the anti-graft body, and had ordered the unfreezing of “big accounts”.\nThe spokesman said the EFCC does not condone acts of corruption and abuse of privilege for financial gratification by personnel."
  },
  {
    "headline": "Electoral Act Amendment Bill is too important to be jettisoned – NBA",
    "summarized_story": "As reactions continue to trail the refusal of President Muhammadu Buhari to assent to the Electoral Act amendment bill, 2021, the Nigeria Bar Association (NBA), an umbrella body of lawyers practising in the country has expressed disappointment that the bill was returned by President Muhammadu Buhari.\nDescribing President Buhari’s veto of the bill as unfortunate, the body said, though, his rejection was his constitutional prerogative, the body wasn’t convinced that Mr President declined assent in good faith.\nThe statement averred: “The Nigerian Bar Association (“NBA”) has received the unfortunate, but unsurprising, news of the decision of His Excellency, President Muhammadu Buhari GCFR (the “President”) to decline assent to the Electoral Act (Amendment) Bill 2021 (“the Bill”).\n“The NBA acknowledges that in withholding assent to the Bill, the President merely exercised a prerogative constitutional powers available to him within the broader context of the rule of law, which the NBA stands for.\n“Nevertheless, we are not convinced that, in the circumstance, the President demonstrated good faith in the exercise of his veto powers."
  },
  {
    "headline": "Yuletide: Gov Ortom doles out bags of rice, pigs, cows, cash to kinsmen [PHOTOS]",
    "summarized_story": "In the spirit of the 2021 Christmas celebration, Benue State Governor, Samuel Ortom has given out Christmas packages to his kinsmen to help celebrate the yuletide.\nThese included bags of rice, pigs, cows and cash.\nThe Governor stated that within available resources, he will continue to execute projects that will impact on the lives of his kinsmen, pointing out that construction of roads, rural electrification, schools among others will be sustained.\nHe stated that contract has already been awarded for the construction of a feeder road from Tomatar-Tomanyiin-Omea-Akoo to Iordye Akaahena.\nHe also urged them to remain courageous and always strive for justice, equity and fairness in the discharge of their duties."
  },
  {
    "headline": "2023 presidency: IBB endorses Osinbajo",
    "summarized_story": "Former Military President, General Ibrahim Babangida has endorsed the candidature of Vice President Yemi Osibanjo in the 2023 presidential elections, saying he is a good man to lead Nigeria.\nIBB stated this when the Osibanjo Grassroot Organization visited him in his Uphill Residence in Minna.\nHe is a good man.\nA man who has conviction about Nigeria; a man who can communicate with the country and inspire people.\nWe need good man to lead Nigeria.”He described Osibanjo as a man who has passion for the country, adding, “Nigeria is a good country too; the people of Nigeria are good ."
  },
  {
    "headline": "FG approves 16 power contracts across Nigeria, gives breakdown",
    "summarized_story": "The Federal Government of Nigeria on Thursday approved 16 memos presented by Minister of Power, Engr.\nAliyu told State House reporters that the action was in response to the demand for increased electricity supply across the nation.\nThe minister said the major problem Nigeria faces in the Electricity Supply Industry is the ability to evacuate sufficient electricity and distribute them.\n“We have a very weak transmission grid and distribution segment of the value chain.\n“Unless we’re able to strengthen the electricity grid, expand, and be able to evacuate, what the grid can take to consumers will cause a lot of problems."
  },
  {
    "headline": "11 things you probably didn’t know about Bola Ige",
    "summarized_story": "11 things you probably didn’t know about Bola IgeChief James Ajibola Idowu Ige (SAN) was the Attorney-General and Minister of Justice renowned for his oratorial prowess and advocacy work on civil rights and democracy.\nHere are 11 things you probably did not know about the late Ige1.\nBola Ige was born in Esa Oke, Osun State in September 13, 1930.\nHe was a Nigerian lawyer and politician, who served as Attorney-General and Minister of Justice under former President Olusegun Obasanjo.\nIge established Bola Ige & Co in 1961 and later became a Senior Advocate of Nigeria."
  },
  {
    "headline": "‘I became an orphan again with Ige’s death’",
    "summarized_story": "‘I became an orphan again with Ige’s death’Elder statesman and former Osun State Governor Bisi Akande was on his way to Osogbo after a trip to the United Kingdom when Muyiwa Ige broke the news of his father’s death.\nHe drove in his car with Akinwumi and they headed for Osogbo via the old road from Ibadan, passing Iwo.\nThen, the line went off,” Akande recalled.\nMembers of the team started groaning and moaning and there was general confusion.\n“It was President Obasanjo on the other end,” Akande recalled."
  },
  {
    "headline": "Ige wanted to resign from Obasanjo’s govt before murder, says Akande",
    "summarized_story": "Ige wanted to resign from Obasanjo’s govt before murder, says AkandeChief Bola Ige intended to resign from the government of Chief Olusegun Obasanjo before he was killed on December 23, 2001, former Osun State Governor Chief Bisi Akande has said.\nAkande, in his book, ‘My Participations’, recalled that the late Ige confided in him about his plan to leave as the Attorney-General of the Federation and Minister of Justice.\nHis reason was that the government was not implementing programmes that could benefit the people.\nBefore being posted to the Ministry of Justice, Ige was Minister of Power and had vowed to ensure a stable electricity supply within six months.\n- Advertisement -The author also added that Ige’s former deputy governor, who was then the Minister of Internal Affairs, Chief Sunday Afolabi, chided Chief Ige that he should not forget that he was only invited to ‘come and eat.’"
  },
  {
    "headline": "Akande: How ex-minister Bola Ige was killed",
    "summarized_story": "Elder statesman Chief Bisi Akande has recounted how Chief Bola Ige was killed.\nIge was shot dead in his Ibadan, Oyo State capital, residence on December 23, 2001.\nAkande, who was Osun State governor at the time, recalled in his book ‘My Participations’ the circumstances in which Ige was killed.\n“Instead of going to Esa-Oke, Uncle Bola decided to spend the night in Ibadan.\n“They overpowered the only gateman who had been working with Uncle Bola before he took up the ministerial appointment with Obasanjo and marched him upstairs."
  },
  {
    "headline": "Buhari: Nigeria in final push against insurgents, other criminals",
    "summarized_story": "President Muhammadu Buhari has said Nigeria is in final phase of the campaign against insurgents and other criminals.\nThe president, according to a statement by his spokesman, Mr Femi Adesina, spoke when he addressed the troops at the Airforce Base in Maiduguri, Borno State yesterday.\nBorno State Governor Babagana Umara Zulum praised the commitment of the President to the people of Borno State through the trying times of the Boko Haram insurgency.\n“That Mr. President considers and approves the establishment of a Federal college of education to be sited in southern Borno.\n“I am confident that Mr. President will in his usual fairness, empathy, and consideration of our huge challenges, look into these realistic requests,” Zulum said."
  },
  {
    "headline": "COVID-19: PSC mulls another restrictions on gatherings",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Presidential Steering Committee on COVID-19 (PSC), has warned that it may be forced to issue restrictions on gatherings and curfews if the current surge in the number of cases continues.\nThis is even as it has advised Nigerians to celebrate responsibly during the Christmas and New Year holiday season.\nThe Chairman, PSC on COVID-19 and Secretary to the Government of the Federation, Boss Mustapha said this in a statement in Abuja.\nMustapha reiterated the need for Nigerians to imbibe the culture of citizen’s responsibility and observe the following safety measures to reduce community transmission of COVID- 19 during this festive period:100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nHe concluded by saying, “The PSC wishes all Nigerians a merry Christmas and Happy Year 2022.”"
  },
  {
    "headline": "Pandemonium as tanker explosion rocks Anambra capital",
    "summarized_story": "From Obinna Odogwu, AwkaThere was pandemonium at the ever busy UNIZIK Junction in Awka, Anambra State capital following a tanker explosion that rocked the area on Thursday.\nThe tanker laden with liquid substances suspected to be Premium Motor Spirit (PMS) otherwise known as fuel exploded while discharging its content at Mobil Filling Station along the Awka – Onitsha Expressway.\nIt was not exactly clear what caused the inferno which erupted around 1pm but the the men of the Anambra State Fire Service were able to extinguish it within a record time.\nThe fire consumed a car parked by the side of the fuel station, two motorcycles and an overhead water tank.\nA side of the administrative building of the fuel station was razed even as two generators belonging to it were equally torched."
  },
  {
    "headline": "Explosions hit Maiduguri ahead of Buhari visit",
    "summarized_story": "From Timothy Olanrewaju, MaiduguriThree people have been feared killed as explosions from a rocket-propelled grenade believed to have been fired into Maiduguri by Boko Haram/ISWAP hit parts of the city a few hours to the arrival of President Muhammadu Buhari.\nResidents said the explosion occurred at Ajilaro Cross and Gomari a few meters away from the Air Force Base where the president landed hours later.\n‘A woman and her baby at her back were wounded,’ Yusuf Saleh, a resident of the area said.\nA mosque near a state hospital in the area was also hitThe area has been the target of attacks by ISWAP in recent times.\nA few weeks ago, a rocket-propelled grenade was fired into the area with the 1000 housing estate and the adjoining area targeted."
  },
  {
    "headline": "Obasanjo, Sultan, ethnic leaders, others list ways how to save Nigeria",
    "summarized_story": "Their observations are contained in a communiqué issued after an open dialogue meeting held physically in Abuja and virtually across the world on December 13.\nIt said: “The 1999 Constitution does not embody the principles of justice, fairness and equality on which every democracy is founded.\nIt said Nigeria must explore its diverse religion and traditions to discover what is best for the people.\nUnderdevelopment and isolation cannot remain the strategy else they will be uncomfortable to remain with the concept of Nigeria.\nThe role of religious leaders and pulpit managers (traditional, Christian, Islam) in our moral rearmament and collective re-engineering is urgently needed to salvage our nation.”Those physically present at the meeting include former president, Obasanjo, the Sultan of Sokoto, Rev."
  },
  {
    "headline": "Electoral Bill: Senate backs down on plan to veto Buhari’s decision",
    "summarized_story": "From Fred Itua, AbujaContrary to public expectations that the senate would initiate moves to override President Muhammadu Buhari’s veto of the Electoral Amendment Bill 2021, the upper legislative chamber, yesterday, failed to carry out its threat.\nSenate President, Ahmad Lawan while giving a situation report after a closed session, said senators had a frank talk, where they agreed to suspend action on the president’s letter until adequate consultations were made.\nThe senate also resolved in the closed door session to discuss how to respond to the letter of Mr. President on the Electoral Amendment Bill.\nThe senate consequently resolved to consult with the House of Representatives in January when the senate and the House will be in session.\n“Presently, the House of Representatives has gone on recess and the constitutional provision is for the Senate and House of Representatives to jointly take the appropriate action."
  },
  {
    "headline": "Buhari Regime Drags Nigeria Into Controversial Deal With Turkey In Exchange For Military Support",
    "summarized_story": "Nigeria's President, Muhammadu Buhari has entered into a controversial deal with President Recep Tayyip Erdogan of Turkey to keep some Turkey-linked companies in Nigeria under surveillance.\nOn July 28, 2016, the Turkish Ambassador to Nigeria, Hakan Cakil, called on Nigeria to close 17 Turkish schools in the country with ties to the Gulen movement.\nSome of these companies include the Nigerian Turkish International College (NTIC) with branches in Kaduna, Abuja, Kano, Yobe, Ogun and Lagos.\nAlso, the Nigeria Turkish Nile University changed its name to Nile University.\nThe Nigeria Turkish Nizamiye Hospital which was patronised by Nigeria’s elite was simply changed to Nizamiye Hospital."
  },
  {
    "headline": "Buhari Regime Drags Nigeria Into Controversial Deal With Turkey In Exchange For Military Support",
    "summarized_story": "Nigeria's President, Muhammadu Buhari has entered into a controversial deal with President Recep Tayyip Erdogan of Turkey to keep some Turkey-linked companies in Nigeria under surveillance.\nOn July 28, 2016, the Turkish Ambassador to Nigeria, Hakan Cakil, called on Nigeria to close 17 Turkish schools in the country with ties to the Gulen movement.\nSome of these companies include the Nigerian Turkish International College (NTIC) with branches in Kaduna, Abuja, Kano, Yobe, Ogun and Lagos.\nAlso, the Nigeria Turkish Nile University changed its name to Nile University.\nThe Nigeria Turkish Nizamiye Hospital which was patronised by Nigeria’s elite was simply changed to Nizamiye Hospital."
  },
  {
    "headline": "BREAKING: One Dead As Boko Haram Terrorists Fire Rockets Into Borno Airport Area Ahead Of Buhari’s Visit",
    "summarized_story": "One person has been confirmed dead at Ngomari airport general area in Maiduguri, Borno State after Boko Haram fighters fired rockets at the community ahead of the visit of President Muhammadu Buhari.\nOne of the missiles also landed at Ajilari Cross area, near Maiduguri airport where there is a military base.\nSee Also Politics Junketing Nigerian President, Buhari Leaves Abuja For Borno As Security Is Beefed Up In Boko Haram-ravaged StateThe President is visiting Maiduguri to inaugurate multiple projects embarked upon and completed by the Borno State Governor, Professor Babagana Zulum.\nAhead of his election in 2015, Buhari promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit."
  },
  {
    "headline": "BREAKING: One Dead As Boko Haram Terrorists Fire Rockets Into Borno Airport Area Ahead Of Buhari’s Visit",
    "summarized_story": "One person has been confirmed dead at Ngomari airport general area in Maiduguri, Borno State after Boko Haram fighters fired rockets at the community ahead of the visit of President Muhammadu Buhari.\nOne of the missiles also landed at Ajilari Cross area, near Maiduguri airport where there is a military base.\nSee Also Politics Junketing Nigerian President, Buhari Leaves Abuja For Borno As Security Is Beefed Up In Boko Haram-ravaged StateThe President is visiting Maiduguri to inaugurate multiple projects embarked upon and completed by the Borno State Governor, Professor Babagana Zulum.\nAhead of his election in 2015, Buhari promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit."
  },
  {
    "headline": "BREAKING: One Dead As Boko Haram Terrorists Fire Rockets Into Borno Airport Area Ahead Of Buhari’s Visit",
    "summarized_story": "One person has been confirmed dead at Ngomari airport general area in Maiduguri, Borno State after Boko Haram fighters fired rockets at the community ahead of the visit of President Muhammadu Buhari.\nOne of the missiles also landed at Ajilari Cross area, near Maiduguri airport where there is a military base.\nSee Also Politics Junketing Nigerian President, Buhari Leaves Abuja For Borno As Security Is Beefed Up In Boko Haram-ravaged StateThe President is visiting Maiduguri to inaugurate multiple projects embarked upon and completed by the Borno State Governor, Professor Babagana Zulum.\nAhead of his election in 2015, Buhari promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit."
  },
  {
    "headline": "We're in final phase of war against insurgency, says Buhari after ISWAP attack in Borno",
    "summarized_story": "President Muhammadu Buhari has urged troops of operation Hadin Kai to remain steadfast as they go into the “final phase” of the fight against insurgency.\nAdvertisementAccording to a statement by Femi Adesina, presidential spokesperson, Buhari said this on Thursday at the air force base in Maiduguri, Borno state.\nAddressing the troops, Buhari said the entire nation remains grateful for the gallantry displayed in ensuring gradual return of peace to the north-east, while condoling with families that have lost loved ones, as well as the wounded.\n“Your career is like no other because it is a conscious commitment and preparedness to give your best for the sake of others,” Buhari said.\n“This has necessitated several interventions aimed at ensuring the security of persons and property across the numerous hot spots."
  },
  {
    "headline": "We're in final phase of war against insurgency, says Buhari after ISWAP attack in Borno",
    "summarized_story": "President Muhammadu Buhari has urged troops of operation Hadin Kai to remain steadfast as they go into the “final phase” of the fight against insurgency.\nAdvertisementAccording to a statement by Femi Adesina, presidential spokesperson, Buhari said this on Thursday at the air force base in Maiduguri, Borno state.\nAddressing the troops, Buhari said the entire nation remains grateful for the gallantry displayed in ensuring gradual return of peace to the north-east, while condoling with families that have lost loved ones, as well as the wounded.\n“Your career is like no other because it is a conscious commitment and preparedness to give your best for the sake of others,” Buhari said.\n“This has necessitated several interventions aimed at ensuring the security of persons and property across the numerous hot spots."
  },
  {
    "headline": "'Shangisha landlords have no land in Magodo' — Lagos vows to prosecute invaders",
    "summarized_story": "The Lagos state government has condemned the attempt by the Shangisha Landlords Association to demolish houses in Magodo estate phase two.\nOnigbanjo, however, said the verdict of the supreme court only relates to “allocation” and not “possession” of any land.\n“The Judgment before the supreme court was not in respect of declaration of title and the supreme court did not in any way grant title to land to the judgment creditors.\n“The judgment creditors had no claim for possession and none was granted as no survey plan was tendered before the Court.\n“The Lagos state government has high regard for the rule of law and will protect the interests of all parties.”"
  },
  {
    "headline": "'Shangisha landlords have no land in Magodo' — Lagos vows to prosecute invaders",
    "summarized_story": "The Lagos state government has condemned the attempt by the Shangisha Landlords Association to demolish houses in Magodo estate phase two.\nOnigbanjo, however, said the verdict of the supreme court only relates to “allocation” and not “possession” of any land.\n“The Judgment before the supreme court was not in respect of declaration of title and the supreme court did not in any way grant title to land to the judgment creditors.\n“The judgment creditors had no claim for possession and none was granted as no survey plan was tendered before the Court.\n“The Lagos state government has high regard for the rule of law and will protect the interests of all parties.”"
  },
  {
    "headline": "Zamfara commissioner resigns, accepts appointment in Imo",
    "summarized_story": "Rabi Shinkafi, commissioner for women and children affairs in Zamfara, has resigned her appointment and taken up a job in Imo state.\nThere had been speculations on social media about the reason for her resignation, as she was appointed as commissioner in Zamfara in November 2021.\n“I resigned my appointment as commissioner in Zamfara to enable me to pick another appointment as commissioner in Imo,’’ she said.\n“All the speculations on social media about my resignation are completely false; it was just the work of mischief-makers.\n“Both governor Hope Uzodimma of Imo and Matawalle discussed it as fellow All Progressives Congress governors and as friends too.”"
  },
  {
    "headline": "Ghana’s answer to Silicon Valley is inside refurbished government buildings",
    "summarized_story": "This project in the heart of Ghana’s capital city, the Accra Digital Centre, is a symbol of Ghana’s ambition to be the startup capital of Africa.\nAn aerial view of the Accra Digital Centre“Beyond Ghana’s capital city, the government has identified unused government buildings around the country,” said David Ofori, Head of Operations at the Accra Digital Centre.\nFour years later, the Accra Digital Centre is living up to expectation and looks to be a worthy template for other centres across the country.\nAnother early tenant of the Accra Digital Centre is aYo, an affordable insurance product by MTN.\nThe Accra Digital Centre is looking to partner with local or foreign investors and investment companies to expand its reach and impact."
  },
  {
    "headline": "Flutterwave x Wizkid to drive global payments adoption",
    "summarized_story": "While Paystack was more involved with helping startups collect payments, Flutterwave focused on helping anyone send and receive money via its API.\nSince then, the digital payments service has transformed payments in Africa with a number of solutions.\nIt allows African merchants collect payments from their customers anywhere in the world, on web and mobile.\nFlutterwave SendFlutterwave Send dashboardIts latest product, Flutterwave Send, is taking payments to the global level.\nThe Essence of Flutterwave SendAt the helm of Flutterwave Send is Afrobeats artiste, Ayodeji Ibrahim Balogun—popularly known as Wizkid—who was signed on as Flutterwave’s global brand ambassador."
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "After the $5.5 million raise, TeamApt had cash in the bank to place orders for terminals in China and invaded the Nigerian market.\nTo improve the reliability of its product, TeamApt introduced to the market a 24-hour resolution service for false debit card withdrawals.\nTosin Eniolorunda, founder and CEO of TeamApt, champions the thought process and is instilling it into the company culture.\nWith TeamApt seemingly to be crowned with unicorn status, the company now has its eyes on digital banking but with a slant.\nSo, we will be launching a hybrid credit-led banking solution that also caters to the offline market,” Eniolorunda concludes."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "After 5 reluctant years of bootstrapping, CinetPay is closing in on Francophone Africa dominance",
    "summarized_story": "“We saw that we have a good opportunity with mobile money because many people have mobile money accounts.\nCinetPay has been Flutterwave’s Francophone Africa partner since 2019.\nA little bit more detail about CinetPayCinetPay helps merchants in the Francophone Africa region accept and collect online payments from mobile money wallets in nine countries.\nAccording to the Francophone Africa and the Equality Challenge 2019 Report by the University of Chester Area Studies Research Group, female literacy rates in Francophone Africa have not been growing consistently, with outdated datasets being used for policy making and decision making.\nThe plan for now, though, is to focus on consolidating their hold in Francophone Africa."
  },
  {
    "headline": "Here’s to more stormy years with plenty of wins",
    "summarized_story": "MAX raises $31 million for its electric vehicle subscriptionSource: MAX.ng TwitterNigerian mobility startup, Metro Africa Xpress (MAX) has closed a $31 million Series B funding round.\nThe startup also moved into Nigeria’s capital market after completing the issuance of a ₦400 million ($1 million) bond in September 2020.\nMaxAB’s $55m Series A, MNT-Halan’s $120m, Paymob’s $18m Series A, and Trella’s $42 million Series A made the highlights.\nGenerally, it’s a good year for Africa’s startup funding scene.\nTechpoint Africa Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "Blockchain-powered music and bigger investments: The next frontier for music tech",
    "summarized_story": "But after a closer look and talking to some of the industry’s brightest, the signs are there — the next frontier for music tech may be closer than we imagine.\nUltimately, he believes the music industry is worthy of the same attention investors pay to fintech or healthtech, for example.\nWhile Nigeria cannot boast such levels of investment, the state of the music industry signals that more investments could have a positive impact on the economy.\nIn terms of revenue, the music industry raked in $40 million in 2021.\nAdetunji and Okpala are optimistic about the future of African and Nigerian music, one where tech will definitely determine what the next frontier will be."
  },
  {
    "headline": "Is Flour Mills deal to acquire Honeywell made in heaven?",
    "summarized_story": "The expected combination of Flour Mills Nigeria (FMN) and the flour mills unit of Honeywell Flour Mills plc (HFMP) will form a formidable entity and an unassailable market leader in the agro-allied sector in Nigeria, according to industry players and market analysts.\nLast month, Flour Mills announced it had reached a deal to acquire the flour mills business of Honeywell in an N80 billion deal that will significantly enhance its market leadership.\nIn full year ended March 2021, the turnover for the two was N771.6 billion for Flour Mills and N109.59 billion for Honeywell Flour, and the combination will see FMN emerge as a true continental giant, amassing substantial value for shareholders and huge economic benefit for Nigeria.\nRead Also: Honeywell, Flour Mills N80bn merger to boost Nigeria’s food productionFMN, established in 1960, prides itself of being in the vanguard of feeding the nation for the past 60 years.\nUnder the deal, Honeywell Group will dispose of a 71.69 percent stake in its flour business to FMN based on an enterprise value of N80 billion and subject to approval from the appropriate regulators."
  },
  {
    "headline": "The many legal battles of Ecobank and Honeywell",
    "summarized_story": "On October 16, 2015, Ecobank filed two separate suits before Justice Abang.\nSensing that Ecobank’s lawyers might be attempting to use the administration of justice to blackmail Honeywell into submission, on April 7, 2016, Honeywell petitioned the Legal Practitioners Disciplinary Committee also known as the Body of Benchers.\nHoneywell is also in court pressing damages claim against Ecobank for harm to its interests arising from the ex-parte order granted against it and which has now been made voided by courts including the Supreme Court.\nOn July 13, 2018, justices of the Supreme Court made two rulings, both in favour of Honeywell.\nHoneywell is now asking that the court compel Ecobank to deposit the $28 million proceeds from the share sale into the accounts of the court until the determination of the substantive suit brought by Honeywell."
  },
  {
    "headline": "In Ecobank’s case with Honeywell, bank’s lawyer is biggest victim so far",
    "summarized_story": "On January 11, 2018, the Legal Practitioners Privileges Committee severely sanctioned Ogunba for professional misconduct in relation to his handling of the court cases, withdrawing from him the rank of senior advocate of Nigeria and all other privileges attached to the rank.\nAs set out above, Ogunba on behalf of Ecobank, deliberately instituted a multiplicity of actions on the same dispute, facts, grounds and between the same parties.\nRead Also: Ecobank warns FMN against Honeywell acquisition deal“It is obvious that it is Ecobank’s intention through Ogunba to harass, embarrass and disrupt the business of the Honeywell Group.\nThe damaging effect of Ecobank’s numerous mischievous suits and wrongly obtained orders is enormous and cannot be quantified.\n“Consequently, the legal practitioners’ privileges committee at its 129th plenary meeting have withdrawn the rank of senior advocate of Nigeria from Kunle Ogunba Esq and all other privileges attached to the rank forthwith.”The story has been updated."
  },
  {
    "headline": "Buhari calls for cooperation among elites in tackling Nigeria’s challenges – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – President Muhammadu Buhari says there is need for more cooperation among the elites in the country in resolving the challenges facing the nation.\nThe president’s spokesman, Mr Femi Adesina, in a statement in Abuja, said Buhari made the call when he visited the palace of the Shehu of Borno.\nHe said the elites owe it to the people to inform, guide and shape opinions since they had more access and knowledge on the economy.\n“What our country needs now is the continued cooperation of the elites.\nThe president assured Nigerians that his administration will use the remaining period to consolidate on efforts in restoring peace and improving the economy."
  },
  {
    "headline": "Obaseki rallies stockbrokers, to showcase Edo’s investment opportunities at 2022 conference – Nigerian Observer",
    "summarized_story": "Obaseki gave the assurance when he received the management of Chartered Institute of Stockbrokers, led by its President, Mr. Olatunde Amolegbe, who was on a courtesy visit at the Government House, Benin City.\nReassuring support for the stockbrokers, Obaseki said the state plans to host the institute’s annual conference to showcase investment opportunities in Edo.\nAccording to him, “As you know, I was one of those that founded this institute, and I have no choice but to continue to support the institute.\nThe amount of investment opportunities that we see coming into Edo in terms of agriculture, film, tech, services, and entertainment, among others, is quite impressive,” Obaseki noted.\nEarlier, Amolegbe lauded the governor’s developmental strides across all sectors of the state, adding that the institute is proud of Governor Obaseki."
  },
  {
    "headline": "Yuletide: Edo warns against indiscriminate dumping of refuse, to monitor evacuation of wastes in Benin – Nigerian Observer",
    "summarized_story": "Yuletide: Edo warns against indiscriminate dumping of refuse, to monitor evacuation of wastes in BeninShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has mobilized staff of the state’s Ministry of Environment and Sustainability and the Waste Management Board to monitor the evacuation of waste in Benin Metropolis throughout this festive period.\nIn a statement, Permanent Secretary, Edo State Ministry of Environment and Sustainability, Lucky Wasa, warned residents against indiscriminate dumping of waste in public places across the state.\nThe statement reads: “It is hereby announced for the information of the general public that the Ministry of Environment and Sustainability has mobilized staff of the Ministry and Waste Management Board to monitor the evacuation of Waste in Benin Metropolis throughout this festive period.\n“Similarly, Waste Managers have been placed on alert to ensure speedy evacuation of wastes in their various zones.”“The Ministry hereby solicits the cooperation of members of the public to stop indiscriminate dumping of waste in public places both day and night and support Government to actualize the clean-up exercise,” Wasa further charged."
  },
  {
    "headline": "FG destroys over 1m donated doses of expired Astrazeneca vaccines – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Federal Government on Wednesday destroyed over 1m doses of Astrazeneca vaccines donated to combat COVID-19.\n“As you can see these vaccines have now been deposited by the Abuja Environmental Protection Agency.\n“We have come through in our promise to all Nigerians to be transparent in our delivery of vaccines.\nNAN reports that Malawi was the first country to publicly destroy vaccine doses in May.\nThe African Union’s African Vaccine Acquisition Task Team shipped over 900,000 doses AstraZeneca vaccine to 13 African nations through donations."
  },
  {
    "headline": "Titan Trust Bank acquires Union Bank",
    "summarized_story": "Nigeria’s first generation bank, Union Bank Nigeria Plc has announced, in a press release, that it has reached an agreement to sell a majority stake to Titan Trust Bank Ltd, in a deal estimated to be worth about N200 billion, though no purchase consideration was mentioned.\nThe deal will see existing core investors in Union Bank, Union Global Partners Ltd (64.98%), Atlas Mara (25.53%) and other shareholders divest their core holdings totalling 89.39% in Union Bank to Titan Trust Bank.\nTitan Trust Bank, which commenced operations in 2019, is chaired by former Deputy Governor of the CBN and Chairman of Flutterwave, Tunde Lemo.\nThere had been speculations about sale of Union Bank, with the likes of Zenith Bank and Access Bank fingered as potential buyers.\nBut Titan Trust Bank has been confirmed as bank acquiring the 104-year-old bank, in a deal brings back memories of the acquisition of UBA by STB in the landmark deal of 2005."
  },
  {
    "headline": "Osun monarch alleges threat to life over dispute with Ooni of Ife, petitions Inspector General Of Police",
    "summarized_story": "“That our client was advised by the Commissioner of Police to be patient.\n“That the persistent persecutions and the incessant invitation letters our client is not unconnected with the several Chieftaincy and Land cases he instituted against the Ooni of Ife.\n“However, spokesperson to Ooni of Ife, Comrade Moses Olafare discarded the claims against the palace saying the Olojudo was dethroned by late Ooni Olubuse Sijuade for various offences.\nHe is free to vent his grievances but I am not aware of any cases against the Ooni from him”, Olafare said.\nAttempt to reach police proved abortive as the Public Relations Officer of the Osun Command is not reachable."
  },
  {
    "headline": "Olori Naomi quits marriage to Ooni of Ife, says monarch’s public identity not his true self",
    "summarized_story": "The wife of the Ooni of Ife, Oba Adeyeye Ogunwusi, Silekunola Naomi, has confirmed that she quit her three-year-old marriage to the monarch.\nThe monarch revealed Naomi Oluwaseyi, who runs an interdenominational ministry based in Akure, Ondo State, as his wife on Instagram on October 18, 2018.\nThis was 14 months after his ex-wife , Zaynab Otiti-Obanor, confirmed that her 17-month-old marriage to the monarch had indeed ended.\n”He chose Saul to be king, and when He was done, He told the prophet Samuel I have moved on.\nInstead, His Majesty has a picture he would love the world to see and perceive him as and another one which is his true self."
  },
  {
    "headline": "Osun 2022: My ambition is a call to duty -Dele Adeleke",
    "summarized_story": "By Sunday Oguntuyi, OsogboAn aspirant under People’s Democratic Party (PDP), in the forthcoming governorship election in Osun state, Mr. Bamidele David Adeleke, has said his ambition is borne out of his passion to serve the people of the state using his wealth of experience gathered from private sector.\nThere had been several calls since then and it continued to grow into the movement that it is today.\nAlso in bringing the South West together.”Adeleke noted that he could no longer fold his hands while Osun State continues to go down the drain as it suffers in incompetent hands.\n“From the word ‘sponsor’, it is the youths of Osun sponsoring me.\nIt is the spirit of wanting to make that difference that we so desperately need, that is sponsoring me."
  },
  {
    "headline": "Nigeria records 4,035 new cases of Covid-19, highest daily figure ever",
    "summarized_story": "Nigeria on Wednesday, recorded a total of 4,035 new cases of the Covid-19, representing the highest daily number of cases recorded in Nigeria since the virus came into the country last year.\nSo far in the week, a total of 7,930 new cases of the covid-19 has been recorded in the country with the number of active cases hitting 16,569, which is the highest since August 2021.\nA breakdown of the 4,035 cases shows that Lagos State led the pack with 3,393 new cases, accounting for 84.1% of the total cases recorded on Wednesday.\nAccording to the Nigeria Centre for Disease Control, a total of 2,991 deaths have been recorded, while 211,853 patients have been discharged.\nMeanwhile, Nigeria currently ranks 8th on the list of highest number of cases in Africa, following the likes of Kenya and Egypt with 270,899 and 377,960 cases respectivelyFacebook Notice for EU!"
  },
  {
    "headline": "2023: IBB Endorses Osinbajo For President",
    "summarized_story": "Former Military President, General Ibrahim Baadamasi Babangida (rtd), has endorsed Vice President Yemi Osinbajo to contest for the office of President come 2023 general elections.\nHe described Osinbajo as a personality the nation should look up to for leadership.\nGen Babangida disclosed this on Thursday when a pressure group, Osinbajo Grassroots Organisation (OGO) paid him a courtesy visit at his Hilltop Residence in Minna, Niger State on Thursday.\nThe elderstateman stressed that Osinbajo is a man that can mobilise and engineer growth in the country.\nADVERTISEMENTDetails Later…ADVERTISEMENT"
  },
  {
    "headline": "Federal Govt Approves N26bn, $286m, €9m To Boost Power Supply",
    "summarized_story": "In a bid to significantly increase power supply, the federal government has approved all 16 memos on power projects presented by Minister of Power, Abubakar Aliyu.\nAt this point, let me say what these approvals will do to the nation’s electricity supply.\nADVERTISEMENT“As we’re all aware, the major problem we’re having in the Electricity Supply Industry is to be able to evacuate sufficient electricity and distribute them.\n“That is to say, we have a very weak transmission grid and distribution segment of the value chain.\nAliyu noted that the present power generation in the country is about 5,000mw as he decried what he termed the weak transmission grid."
  },
  {
    "headline": "5 Die, 12 Injured As ISWAP Terrorists Fire Mortar Bombs On Maiduguri",
    "summarized_story": "At least five mortar bombs were reportedly fired by the terrorists which landed and exploded on six separate houses thus resulting in the deaths and attendant destructions in the areas affected.\nI left my house and few hours after that, I heard an explosion and on returning back I met the shattered body of my daughter.\nADVERTISEMENT“Although, nothing can replace human life, we plead to the government to assist us in rebuilding the destroyed house,” Hassan reiterated.\nThe injured victims were taken to Umara Shehu Ultramodern Hospital while the rest of the victims who died await burial according to Islamic injunction.\nIt could be recalled that the last mortar bomb that was fired by the terrorists in the same area over two weeks ago resulted in the death of a teenager."
  },
  {
    "headline": "5 Die, 12 Injured As ISWAP Terrorists Fire Mortar Bombs On Maiduguri",
    "summarized_story": "At least five mortar bombs were reportedly fired by the terrorists which landed and exploded on six separate houses thus resulting in the deaths and attendant destructions in the areas affected.\nI left my house and few hours after that, I heard an explosion and on returning back I met the shattered body of my daughter.\nADVERTISEMENT“Although, nothing can replace human life, we plead to the government to assist us in rebuilding the destroyed house,” Hassan reiterated.\nThe injured victims were taken to Umara Shehu Ultramodern Hospital while the rest of the victims who died await burial according to Islamic injunction.\nIt could be recalled that the last mortar bomb that was fired by the terrorists in the same area over two weeks ago resulted in the death of a teenager."
  },
  {
    "headline": "Nigeria In Final Phase Of War Against Insecurity – Buhari",
    "summarized_story": "President Muhammadu Buhari Thursday in Maiduguri, Borno State, urged troops of Operation Hadin Kai to remain steadfast as they go into the final phase of the campaign against insurgency and other forms of criminalities.\nAccording to President Buhari, the Government would continue to ensure that the widows and children of fallen heroes were well catered for, to help them fully realise their potentials.\nAccording to President Buhari, similar attention is being given to Intelligence, Surveillance, Target Acquisition and Reconnaissance Assets.\n“I am also happy with the increased level of cooperation between the good people of Borno State, other stakeholders and the security agencies.\nPresident Buhari expressed deep appreciation to the Government of Borno State for its continuous cooperation with the Federal Government in multiple spheres."
  },
  {
    "headline": "Three dead, 17 rescued as boat capsizes on Badagry waterways",
    "summarized_story": "Three people were drowned while 17 others were rescued by Marine Police when a commercial boat capsized on Badagry waterways on Wednesday.\nA police source told the News Agency of Nigeria (NAN) that the boat took off from Liverpool in Lagos but capsized at Imoba near Ajido on Badagry waterways, following a mechanical problem.\n“As the boat stopped suddenly, it capsized, throwing all the passengers on board into the water.\n“At the end of rescue operations, 17 passengers, including three children, were rescued while three of them died in the water,” the source said.\nDr Tunde Bakare, Medical Director of Badagry General Hospital, also confirmed that one corpse of the boat incident was deposited at the mortuary."
  },
  {
    "headline": "Three dead, 17 rescued as boat capsizes on Badagry waterways",
    "summarized_story": "Three people were drowned while 17 others were rescued by Marine Police when a commercial boat capsized on Badagry waterways on Wednesday.\nA police source told the News Agency of Nigeria (NAN) that the boat took off from Liverpool in Lagos but capsized at Imoba near Ajido on Badagry waterways, following a mechanical problem.\n“As the boat stopped suddenly, it capsized, throwing all the passengers on board into the water.\n“At the end of rescue operations, 17 passengers, including three children, were rescued while three of them died in the water,” the source said.\nDr Tunde Bakare, Medical Director of Badagry General Hospital, also confirmed that one corpse of the boat incident was deposited at the mortuary."
  },
  {
    "headline": "Silekunola: Fascinating facts about Ooni of Ife’s estranged queen",
    "summarized_story": "Her Majesty, Queen Silekunola Naomi, on Thursday announced her separation from the Ooni of Ife Oba Adeyeye Ogunwusi Ojaja II.\nIn a statement posted on her verified Instagram handle and Facebook page on Thursday, she had announced an end to the three-year marriage.\nIt was gathered that the traditional wedding was done in Akure, the Ondo State capital before the new bride was brought to the palace.\nMotherhoodQueen Silekunola and the Ooni had a son together, Tadenikawo.\nThe girl who is said to be my daughter is my niece.”MinistrySilekunola is also the founder and president of En-Heralds— an inter-denominational ministry based in Akure, Ondo State."
  },
  {
    "headline": "Silekunola: Fascinating facts about Ooni of Ife’s estranged queen",
    "summarized_story": "Her Majesty, Queen Silekunola Naomi, on Thursday announced her separation from the Ooni of Ife Oba Adeyeye Ogunwusi Ojaja II.\nIn a statement posted on her verified Instagram handle and Facebook page on Thursday, she had announced an end to the three-year marriage.\nIt was gathered that the traditional wedding was done in Akure, the Ondo State capital before the new bride was brought to the palace.\nMotherhoodQueen Silekunola and the Ooni had a son together, Tadenikawo.\nThe girl who is said to be my daughter is my niece.”MinistrySilekunola is also the founder and president of En-Heralds— an inter-denominational ministry based in Akure, Ondo State."
  },
  {
    "headline": "Buhari begins exit countdown: I will leave in 17 months",
    "summarized_story": "President Muhammadu Buhari is already counting the remaining months to his exit as Nigeria’s leader as he told an audience in Maiduguri that he has 17 months more to spend at the helm.\nBuhari said: “ I know I swore by the Constitution, and I will leave in 17 months.\nThe high quality standard of this edifice is major contribution by Alhaji Muhammadu Indimi.\nIt will now be known as Alhaji Muhammadu Indimi Road.\nVice Chancellor of the University, Prof Aliyu Shugaba, thanked President Buhari for honoring the invitation and Alhaji Indimi for the contribution."
  },
  {
    "headline": "No one can compete against me – JAY-Z replies Rick Ross",
    "summarized_story": "American legendary rapper, Jay-Z has replied his colleague Rick Ross who suggested a verzuz battle between them.\nEarlier, the “Gold Roses” rapper said there was a possibility they’d battle during an appearance on The Real earlier this month.\nRoss said “JAY-Z… Yeah!\nThat’s a possibility, but I gotta give my flowers to the big homie.”However during a recent Twitter Spaces conversation with singer Alicia Keys, 52-year-old JAY-Z said “no one” can compete against him.\nLast month, JAY-Z made history as the artist with the most Grammy nominations."
  },
  {
    "headline": "COVID-19: Nigeria To Consider Additional Restriction On Gatherings — FG Warns",
    "summarized_story": "The Presidential Steering Committee on COVID-19 (PSC) has encouraged Nigerians to take COVID-19 measures while celebrating the holidays properly this Christmas and New Year.\nThe SGF advised Nigerians to continue to follow COVID-19 safety precautions in order to prevent a surge in new COVID-19 cases that would put the country’s healthcare system under strain.\n“As we prepare to celebrate with our families and loved ones, it is important that we do so safely by taking the necessary precautionary measures to stop the further spread of COVID-19 in our nation.\n“Nigerians have been advised to avoid non-essential interstate travel at this period as this increases the risk of spreading COVID-19 from one place to another.\n“The PSC wishes all Nigerians a merry Christmas and Happy Year 2022,” he added."
  },
  {
    "headline": "Gunmen Attack Taraba Mosque During Worship",
    "summarized_story": "Unknown gunmen, suspected to be bandits, stormed a Mosque in Tella town, Taraba State’s Gassol local government area.\nAt least four attendees were abducted during the incident on Wednesday evening while service was taking place in the mosque, according to reports.\nDSP Usman Abdullahi, the Taraba State Police Public Relations Officer, confirmed the attack when reached by DAILY POST.\nHe was unable to provide specifics about the incident, adding only, “I will get back to you quickly.”During Isha’i prayers, a group of roughly 12 gunmen stormed the worship center with sophisticated weaponry and whisked the victims away to an unknown location."
  },
  {
    "headline": "BREAKING: Crossover Services Threatened As FG Restricts Religious Gatherings To 50% Capacity",
    "summarized_story": "The annual crossover services held by religious organisations across the country is under threat as the Boss Mustapha led Presidential Steering Committee on COVID-19 declared that indoor religious gatherings should be limited to 50 per cent with full compliance to public health measures.\nCrossover services are significant events held majorly in churches on the night of December 31 every year to usher in the New Year.\nIt is a time when religious organisations, especially Christians, gather to pray and worship their Maker for the gift of a New Year.\nCustomarily, the services begin a few hours before midnight and end some minutes after, depending on the denomination.\n“Ensure that you have taken the full dose of COVID-19 vaccination including the booster dose to reduce your risk of severe infection and death in case of exposure to COVID-19.”"
  },
  {
    "headline": "JUST IN: Ex-CBN deputy Governor Tunde Lemo Takes Over Union Bank",
    "summarized_story": "Union Bank of Nigeria Plc (Union Bank) has informed the Nigerian Stock Exchange (NGX) and the Securities and Exchange Commission (SEC) that its shareholders Union Global Partners Limited, Atlas Mara Limited, and other shareholders have reached an agreement with Titan Trust Bank Limited (TTB) to divest their shares in Union Bank to TTB.\nTTB will get 89.39 percent of Union Bank’s issued share capital upon conclusion of the transaction, which is subject to regulatory clearances and other financial requirements.\nWe are grateful to our current investors whose significant and consequential investments over the past nine years facilitated the transformation of Union Bank, one of Nigeria’s oldest and storied institutions.\nThis is a solid foundation for our incoming investors to build on as we move into a new era for the Bank.”Chair, Titan Trust Bank, Mr. Tunde Lemo, OFR said:“The Board of Titan Trust Bank and our key stakeholders are delighted as this transaction marks a key step for Titan Trust in its strategic growth journey and propels the institution to the next level in the Nigerian banking sector.\nCitigroup Global Markets Limited acted as financial adviser, Pricewaterhouse Coopers as due diligence partner, Norton Rose Fulbright LLP, Drew Law Practise and G. Elias & Co. acted as legal advisers respectively to TTB."
  },
  {
    "headline": "Crossover service: FG restores COVID-19 protocols on religious gatherings, threatens more sanctions over rising cases",
    "summarized_story": "Apparently due to the rising cases of COVID-19 in Nigeria, the federal government Thursday restricted religious gathering to 50 percent with full compliance to public health measures.\nIt also threatened to introduce more restrictions should there be an upsurge in cases of the virus.\nChairman Presidential Steering Committee (PSC) on COVID-19 and Secretary to the Government of the Federation (SGF) Boss Mustapha announced this in a statement in Abuja.\nDue to the number of attendees of such events across the country, the PSC said there has been reduced compliance to public health social measures which has led to increased COVID-19 cases in the country.\n“Ensure that you have taken the full dose of COVID-19 vaccination including the booster dose to reduce your risk of severe infection and death in case of exposure to COVID-19.”"
  },
  {
    "headline": "NIS leaked memo: Algerian national, others planning attack on Abuja",
    "summarized_story": "The Nigeria Immigration Service (NIS) has raised the alarm over a planned attack on Abuja, Nigeria’s nation’s capital by a group of Nigerian terrorists led by an Algerian national.\nOULD ALI, aka Mohammed Ould Sidat, an Algerian national to be assisted by one Zahid Aminon, a Nigerien national.\n“It is further reported that Ali holds Algerian Diplomatic Passport with the name Najim Ould Ibrahim,” the memo read.\nHowever, the attack did not affect the scheduled state visit as President Buhari enlivened the mood of the troops.\nIt said the bandits were arrested in different operations across the North Central."
  },
  {
    "headline": "Breaking: Queen Naomi part ways with Ooni of Ife",
    "summarized_story": "Wife of the Ooni of Ife, Queen Silekunola Naomi has announced her divorce from the Oba Adeyeye Ogunwusi Ojaja II.\nAccording to a post on her verified Instagram handle, Thursday, the queen announced the end to the three-year marriage with the monarch.\nShe said, “Today I announce the beginning of anew dawn and the close of a chapter.\nToday, I am amother to God’s unique gift.\nI, at this moment,announce that I shall no longer be referred to aswife to the Ooni of Ife or as Queen of Ile-Ife but asthe Queen of the people and mother of my adorablePrince.”Details loading…"
  },
  {
    "headline": "We’ll Keep Doing Our Best Until We Leave In 17 Months, Says Buhari",
    "summarized_story": "President Muhammadu Buhari on Thursday said his administration will keep giving its best for the development of the country until May 2023, reiterating that he will hand over as stipulated by the Constitution.\nHe spoke after the commissioning of Oriental Energies Resource Limited Hanger, Muhammadu Indimi Distance Learning Centre, and an International Conference Centre donated to the University of Maiduguri in Borno State.\n“I know I swore by the Constitution, and I will leave in 17 months,” he was quoted as saying in a statement by his media adviser, Femi Adesina.\n“I pray that the person that will take over from us will also follow the targets of securing the country and building the economy.\nBut we need to develop our resources,” said President Buhari who noted that development would be more sustainable by empowering the people."
  },
  {
    "headline": "Titan Trust Bank To Take Over Union Bank",
    "summarized_story": "One of Nigeria’s newest commercial banks, Titan Trust Bank Limited is set to take over Union Bank of Nigeria Plc, the latter has announced.\nThe Company Secretary of Union Bank, Somuyiwa Sonubi, disclosed this in a statement on Thursday.\nAccording to him, the Board of Directors of Union Bank has received a notification from Union Global Partners Ltd. (UGPL) – the holder of a majority shareholding in the bank – of the execution of a share sale and purchase agreement between UGPL, some of its other existing shareholders, and Titan Trust Bank Limited (the purchaser) for the sale of an aggregate 89.39% of the issued share capital of Union Bank held by the sellers to the purchaser.\nOn his part, the Chief Executive Officer (CEO) of Union Bank, Emeka Okonkwo, described the development as a significant milestone in the journey of the 104-year-old bank.\nWhile it has a network of over 280 sales and service centres across the country, Titan Trust Bank began operation in October 2019."
  },
  {
    "headline": "FG: Nigerians Suffering Epileptic Power Owing To Years Of Neglect",
    "summarized_story": "The Federal government has pointed at past neglect of the power sector as the major cause of slow development of the power sector and consequently epileptic power supply.\nThe Minister of Power, Abubakar Aliyu who presented 16 memos at the Federal Executive Council meeting chaired by the Vice President, Professor Yemi Osinbajo today, disclosed the present administration has done more than was tenable in previous administrations to bridge the power deficits for improved electricity supply.\nIn affirming the current power generation pegged at 5,000 MW, he described the nation’s transmission grid as weak and unable to evacuate and distribute sufficient electricity, which according to him will constitute a major problem ahead.\nREAD ALSO: Buhari Visits Borno As Multiple Explosions Rock MaiduguriHe however noted that the Federal Government has placed order for new power equipment and assures that Nigerians in no time will see the outcome of the ongoing investments.\nHe further maintained that while there are calls for a reversal, there are also calls for full privatization of the sector, a situation that equally demands the Federal Government go back to the drawing board."
  },
  {
    "headline": "Gunmen Abduct 70 Travellers Along Kaduna-Birnin Gwari Highway",
    "summarized_story": "Over 70 travellers have been reportedly kidnapped by gunmen along the Kaduna-Birnin Gwari Road on Wednesday.\nThe incident occurred around Udawa village after Buruku in Chikun Local Government Area of the state.\nAccording to an eyewitness account, the vehicles conveying the travellers, mainly traders, were attacked by a large number of gunmen in the morning.\nBut authorities of the Kaduna State Police Command said they rescued 48 of the kidnapped victims.\nHe explained that the police operatives successfully repelled the attack through superior firepower before rescuing 48 of the passengers."
  },
  {
    "headline": "James Franco Admits To Sleeping With Film School Students",
    "summarized_story": "US actor James Franco said he regretted sleeping with students at his film school, breaking his silence on allegations of sexual misconduct in an interview aired Thursday.\nOscar nominee Franco was publicly accused by five women in 2018 of exploitative behavior including during nude scenes at his Studio 4 school in North Hollywood.\n“Look, I’ll admit, I did sleep with students,” Franco, 43, said in his first major interview on the allegations with The Jess Cagle Show on SiriusXM.\n“Over the course of my teaching, I did sleep with students, and that was wrong.\nSo it just comes down to my criteria was like, ‘if this is consensual, I think it’s cool."
  },
  {
    "headline": "Dowen College: Five students tried over Sylvester oromoni’s death granted bail -",
    "summarized_story": "A Chief Magistrates’ court in the Yaba area of Lagos has granted bail to five students of Dowen College following a charge of conspiracy and homicide made against them by the State Criminal Investigation Department, Panti.\nThe police charged the minors following the alleged murder of their 12-year old schoolmate, Sylvester Oromoni.\nChief magistrate Olatunbosun Adeola, who heard the bail application on Tuesday granted them bail in the sum of N1m each.\nThe magistrate also ordered the defendants to produce two sureties each in like sum.\nMagistrate Adeola said that one of each of the defendants’ sureties must be their parent, and must swear an affidavit of compliance."
  },
  {
    "headline": "FULL TEXT: President Buhari’s letter on withholding assent to electoral bill -",
    "summarized_story": "The President of the Senate, Ahmad Lawan; and Speaker of House of Representatives, Femi Gbajabiamila, on Tuesday, at the opening of plenary read the communication from President Muhammadu Buhari on his rejection of the Electoral Act 2010 (Amendment) Bill.\n“The Electoral Act (Amendment) Bill 2021 seeks to amend certain provisions of the extant Electoral Act 2010.\nPolitical party membership is a voluntary exercise of the constitutional right to freedom of association.\nIt is thus undemocratic to restrict the procedure or means of nomination of candidates by political parties, as it also amounts to undue interference in the affairs of political parties.\n“In the premise of the above, I hereby signify to the National Assembly that I am constrained to withhold assent to the Electoral Act (Amendment) Bill 2021 in line with the provisions of Section 58(1) & (4) of the 1999 Constitution (as amended)."
  },
  {
    "headline": "Just In: Reps raise 2022 budget by N200bn, extend 2021 budget lifespan by 90 days -",
    "summarized_story": "The House of Representatives has extended the lifespan of the 2021 Appropriation act by nine months to enable it run concurrently with the 2022 appropriation.\nMeanwhile, the house of representatives has raised the budget by N200b and passed N17.126 billion as 2022 Spending plan.\nStill in the house of representatives, the lawmakers have approved N215.81b for the Federal Inland Revenue Service in 2022Also, the Senate has approved the nomination of Muazu Sambo as the new minister of Power.\nRecall that President Muhammadu Buhari had few months ago sacked the former minister over failure to improve the sector."
  },
  {
    "headline": "Buhari gives reasons for not signing Electoral Act Amendment Bill -",
    "summarized_story": "Speaker of the House of Representatives, Femi Gbajabiamila has read President Muhammadu Buhari’s letter explaining why he declined to sign the Electoral Act Amendment bill.\nAccording to the president, direct primaries an affront to the right to freedom of association."
  },
  {
    "headline": "Controversy Over Emergence of First Muslim Miss Nigeria – Trending with Ojy Okpe",
    "summarized_story": "The Kano State Hisbah Board on Wednesday allegedly disclosed plans to invite parents of Shatu Garko – who recently emerged as Miss Nigeria – for questioning.\nThe Hisbah board says they will invite her parents to talk to them about the actions of their daughter noting that entering a completion such as the Miss Nigeria pageant was forbidden according to Islamic law.\nFinally, the Abia State government on Wednesday announced that It would prosecute masquerades caught harassing residents in the state.\nIn a statement released by the Secretary to the State Government, adequate measures are being put in place to ensure that lives and property of Abians are secured during the Yuletide Period.\nThe statement further urged residents to report any masquerade seen to be blocking roads and extorting motorists and individuals to security agencies, as they will face the full wrath of the law."
  },
  {
    "headline": "World’s Second-Biggest Miner Rio Tinto Buys Lithium Project For $825m",
    "summarized_story": "World’s second-biggest miner Rio Tinto Group has agreed to buy a lithium mine in Argentina for $825 million as the company accelerates its push into battery materials.\nRio stated that it will buy the Rincon asset in Argentina from private equity buyers.\nThe lithium brine project is in the so-called lithium triangle in South America, home to many of the best lithium deposits.\nRio is already looking to develop a $2.4 billion lithium mine in Serbia as it moves to diversify its business away from iron ore.\nClearly, Rio has thought their lithium strategy through.”Rio’s push into lithium comes as prices surge."
  },
  {
    "headline": "Electoral Act Amendment: Nigeria Senate Cowers, Suspends Move to Override Buhari’s Veto",
    "summarized_story": "Despite the resolve and threat by many senators on Tuesday to overrule President Muhammadu Buhari’s veto of the Electoral Act Amendment Bill, the senate Wednesday, backed down from its resolve.\nBuhari had declined assent to the Electoral Act Amendment Bill, citing issues with direct primaries provisions in the bill.\n“The senate, also, in the closed session, discussed how to respond to the letter from Mr. President on the electoral bill amendment.\nThis is because we cannot sit back and allow one contentious clause to throw away all the positives in the proposed Electoral Act (amendment) Bill.\nThis Electoral Act [Amendment] Bill serves that purpose."
  },
  {
    "headline": "Nigeria Senate Passes 2022 Budget, to Transmit Spending Plan to President on Thursday",
    "summarized_story": "The Red Chamber also approved the N276.8 billion request of President Muhammadu Buhari for funding of expenditure in the 2021 budget before adjourning plenary to January 18, 2022.\nThis is just as President of the Senate, Dr. Ahmad Lawan also disclosed that the National Assembly would on Thursday transmit the 2022 budget passed by both chambers to President Muhammadu Buhari for assent.\nIn addition, the Federal Ministry of Industry, Trade and Investment received N17,966,745,438; Federal Ministry of Labour and Employment – N14,453,726,978; Federal Ministry of Science, Technology and Innovation – N49,683,523,165; Federal Ministry of Transport – N15,892,132,819; Federal Ministry of Aviation – N7,692,548,460; Federal Ministry of Power – N6,262,156,943, and Ministry of Petroleum Resources – N30,502,257, 191.\nOthers are Federal Capital Territory Administration – Nil; Federal Ministry of Niger Delta – N2,569,680,304; Federal Ministry of Youth and Sports Development – N185,489,102,966; Federal Ministry of Women Affairs – N2,103,758,084; Federal Ministry of Education – N593,473,925,256; Federal Ministry of Health – N462,858,698,619; Federal Ministry of Environment – N22,796,647,842; National Population Commission – N8,880,618,082, and Ministry of Humanitarian Affairs, Disaster Management and Social Development – N7,669,972,542.\nOn Wednesday ay, the Senate approved President Muhammadu Buhari’s request for the virement of N276,757,232,395 billion to fund expenditures in the 2021 budget."
  },
  {
    "headline": "Nigeria Destroys More Than 1 Million Expired Covid Vaccines",
    "summarized_story": "Nigeria has destroyed more than a million doses of expired AstraZeneca vaccines in a bid to assure a wary public that they have been taken out of circulation.\nThe Reuters news agency reported on December 7 that about one million COVID-19 vaccines were estimated to have expired in Nigeria in November without being used.\nA truck offloads expired AstraZeneca vaccines at the Gosa dumpsite in Abuja [Afolabi Sotunde/Reuters]Al Jazeera’s Fidelis Mbah, reporting from Abuja, said the delivery of the vaccines has been accompanied by conspiracy theories via social media and word of mouth.\n“We have successfully withdrawn 1,066,214 doses of expired AstraZeneca vaccines.\nThe World Health Organisation said 12,971,729 vaccine doses have been administered in Nigeria as of December 19."
  }
]