[
  {
    "headline": "Ukraine: All of us are at risk – UK defence secretary",
    "summarized_story": "The United Kingdom Defence Secretary, Ben Wallace, has accused the Russian President, Vladimir Putin, of saying “all of us are at risk” as the war in Ukraine continued.\nHe stated this at the Conservative Party Spring Conference at Blackpool on Saturday.\nWallace praised the UK’s response to the war in Ukraine and hinted that more equipment was on the way.\n“Putin has been clear in his threats that all of us are at risk,” he said, stressing that the UK is standing beside “our NATO comrades” in other parts of Europe.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Pictorial: Ex-Super Eagles player Justice Christopher buried in Jos",
    "summarized_story": "A former Super Eagles player, Justice Christopher, has been buried in Jos, Plateau State.\nThe PUNCH had reported that the former midfielder slumped in his hotel in Gwolshe, off Tudunwada Ring Road, Jos, Plateau State, and died on March 9, 2022.\nHis remains were initially deposited at the Plateau Specialists hospital for an autopsy to be carried out on his corpse.\nChristopher represented Nigeria at youth and senior levels, playing for the Super Eagles between 2001 and 2002, during which he amassed a total of 11 caps.\nIn October 2012, he joined Nasarawa United FC of Lafia."
  },
  {
    "headline": "[Advertorial] Natural Pain Relief Discovery for Joint Pain, Arthritis & Rheumatism Stuns Doctors",
    "summarized_story": "You are about to discover an amazing pain relief, totally natural remedy for osteoarthritis, rheumatoid arthritis, body pain, joint pain, knee pain etc., and providing a permanent cure to any kind of arthritis.\nThe Pain Relief Cream has no freezing or anaesthetizing effects, it ‘relaunches’ the body on a cellular level.\nThe Pain Relief Cream also helps alleviates pain (at early stages of the treatment) and eventually completely eliminates the disease.\n– Port Harcourt, River stateI learned about Arthritis remedy kit on one of the forums for people suffering from joint problems.\nTake the Arthritis Remedy kit 2- 3 times daily, apply balm after bathe and drink capsules, send in your testimonials."
  },
  {
    "headline": "Akwa Ibom teachers suspend strike, resume academic activities Monday",
    "summarized_story": "By Chioma Onuegbu UyoTHE members of the Nigeria Union of Teachers, NUT, Akwa Ibom State wing have suspended their industrial strike declared against State government over unpaid entitlement.\nThe leadership of the Union, therefore directed that all teachers to resume normal academic activities from Monday, March 21, 2022.\nThe statement reads, “The leadership of the Nigeria Union of Teachers (NUT) Akwa Ibom State wing hereby suspend its industrial action earlier declared against the Akwa Ibom State government from midnight of Tuesday 15th March, 2022.\n“The NUT, Akwa Ibom state wing appreciate our teachers, parents and students for showing understanding throughout the period of the strike.\n“Teachers in Primary and Secondary Schools in Akwa Ibom State are hereby directed to resume normal academic activities from Monday 21st March 2022” the statement added."
  },
  {
    "headline": "Police arrest ‘spirit’ attempting to dupe victim of N2.2m in Borno",
    "summarized_story": "The Police Command in Borno has arrested a suspect who specialised in defrauding his victims by pretending to be a spirit with powers to make them wealthy.\nThe Commissioner of Police (CP), Abdu Umar, told newsmen in Maiduguri on Friday that nemesis caught up with the suspect, a member of a three-man gang.\nUmar said that the mode of operation of the gang was to deceive their victim into believing that they were in communication with a spirit who could assist them in making wealth.\n“The victim complied and the suspects withdrew the sum of N2.2 million from his account domiciled at TAJ Bank Plc,” Umar said.\nUmar added that efforts to arrest the two other accomplices have been intensified."
  },
  {
    "headline": "Osinbajo Presidency greatest legacy Buhari can bequeath to Nigerians —Ajulo",
    "summarized_story": "Prof Yemi Osinbajo has more intellectual endowment, superior pedigree and moral heft than other potential contestants.\nFrom whatever angle this issue is tilted, Prof. Yemi Osinbajo is far ahead of other aspirants in this race towards 2023.\nWhatever standard, whatever indices you employ, you will find out that at the end of the day that your choice is Prof. Yemi Osinbajo.\nThat is the reason somebody like me and millions of Nigerians spread across the country and beyond are saying it has to be Prof. Yemi Osinbajo.\nTo state the obvious, Prof. Yemi Osinbajo is a man who believes his work should speak for him."
  },
  {
    "headline": "‘Buhari should inaugurate NDDC board to douse tension’",
    "summarized_story": "Niger Delta Elders’ Forum has earnestly urged President Buhari to inaugurate the NDDC Governing Board in accordance with the law, to guarantee equitable representation of the nine constituent states.\nRecall that the Ijaw Interest Advocates (IIA) also known as Izanzan Intellectual Camp, in a statement by its President, Ambassador Salaco Yerinmene, earlier in the year, also urged President Buhari to inaugurate the NDDC Board and douse the rising tension in the region.\nPresident Buhari also promised the nation on the 24th day of June 2021, while receiving the Ijaw National Congress (INC) at the State House in Abuja that the NDDC Board would be inaugurated as soon as the forensic audit report is submitted and accepted.\nI want to assure you that as soon as the forensic audit report is submitted and accepted, the NDDC Board will be inaugurated.” The Forensic audit report has been submitted to President Muhammadu Buhari seven months ago on September 2, 2021.\nChief Tonye Ogbogbula, National President, Niger Delta Elders’ Forum"
  },
  {
    "headline": "I’m not vying for any political office – ITF DG clarifies rumours",
    "summarized_story": "He also said he has never contemplated vying for any political office but is focused on delivering the mandate of ITF which is developing the nation’s human resources.\nThe DG explained he has reported the matter to security operatives to arrest anybody found in possession of anything in connection with the issues raised.\nAri disclosed this while briefing journalists in Jos, the Plateau State Capital, to clear the air about the insinuations that he was running for office.\nHe said, “As journalists, some of you may perhaps, be aware of the activities of unscrupulous elements that are bent on pulling me down.\n“I have, therefore, reported the matter to the security agencies for their further necessary action”, he warned."
  },
  {
    "headline": "Gunmen bomb Ohanaeze President’s home in Imo",
    "summarized_story": "The residence of the President-General of Ohanaeze Ndigbo Worldwide, Prof George Obiozor located in Awo- Omamma in Oru East Local Government Area of Imo State has been bombed by unknown gunmen.\nIt was gathered that the suspects used Improvised Explosives Devices, IED and petrol bombs to raze the building.\nEyewitnesses from the Awo-Omamma community claim the unknown gunmen drove into the compound about 6:15am, Saturday, shot indiscriminately for over 15 minutes before setting the building ablaze, DAILY POST reports.\nConfirming the incident, Micheal Abattam, the Imo State Police Public Relations Officer, PPRO, said “officially there was no report of lives lost.”"
  },
  {
    "headline": "Rate of car theft in Jigawa surges, Police promises to act",
    "summarized_story": "Jigawa State residents have raised concerned over the increasing incidents of car theft by criminal gangs in the state.\nSome of the residents raised their concerns while speaking to DAILY POST in Dutse, the state capital.\nOne victim of car theft said the speed and technique used by the criminals was amazing.\nHe appealed to security operatives to step up efforts at arresting the criminals to ensure the act is reduced in the state.\nState Police Command in a statement issued to DAILY POST signed by the Spokesman ASP Lawan Shiisu Adam assured of actions to check the thefts."
  },
  {
    "headline": "Police arrest woman over alleged assault on blind sister, daughter in Delta Community",
    "summarized_story": "The Police in Isiokolo Division, Ethiope-East Local Government Area of Delta State have arrested a woman, Mercy Oba over an alleged assault on her forty-five-year-old blind step-sister, Odiri Oba and her twelve-year-old daughter.\nThe suspect’s arrest was made possible by a Warri based human rights activist, Kelvin Ejumudo and his team.\nThe Activist in his Facebook timeline alleged that the suspect also drove a wood into the private part of the twelve-year daughter of the blind woman and inflicted bodily injuries on her and the blind mother following severe beatings.\nBlind Odiri Oba is an indigene of Emaje Village, Kokori Community in Ethiope-East Local Government Area and is a step-sister to the suspect, Mercy Oba.\nIt was not clear at the time of this report, why the suspect who is currently in Police custody attacked her blind sister and her daughter."
  },
  {
    "headline": "Insecurity: Niger Police reassures commuters of safety on Minna-Suleja road, others",
    "summarized_story": "Niger State Police Command has reassured commuters of adequate security measures put in place on Minna-Suleja road and across areas where there are identified security challenges in the state.\nThe state Police Command gave the assurance in a press statement signed by the Public Relations Officer, PRO, DSP Wasiu Abiodun in Minna.\nAbiodun said the attention of the Command has been drawn to report alleging that Gawu-Babangida Police Division alerted commuters to be careful along Lambata-Minna road this weekend and that bandits may attack road users.\nThe command urged members of the public to ignore such fabricated reports and go about their lawful business without fear of intimidation, molestation or any form of attack.\nIt added that “the Police and other security agencies are working assiduously to ensure a more secured and safer environment”."
  },
  {
    "headline": "Two die as school toilet building collapses in Niger",
    "summarized_story": "Two children have been killed and three others injured when the toilet block of the UK Bello Memorial Primary School, Paiko, Paikoro local government area of Niger state fell on the children.\nA source told The Nation that the children went to the refuse dump which was very close to the toilet to scavage and dig for some materials which they can sell to people who buy scavaged materials.\nThe Nation that the building had been on the verge of collapse for years and efforts by the Niger state Universal Basic Education Board (NSUBEB) to repair the building and fence the school had met with stiff resistance from the residents.\n“The toilet block is outside the school building and there is a refuse dump very close to the toilet.\nChildren usually go to the refuse dump to dig up for things they can sell."
  },
  {
    "headline": "JUST IN: Gunmen raze Ohanaeze President’s country home in Imo",
    "summarized_story": "The country home of the President General of Ohanaeze Ndigbo, Prof George Obiozor, at Awo- Omanma in the Oru East Local Government Area of Imo state has been razed by yet to be identified gunmen.\nThe Nation gathered that the hoodlums who came in a convoy were spotted throwing explosives at the house on Saturday morning.\nA source said “the country home of Prof George Obiozor was burnt last night.\nThe police spokesperson in the state, Michael Abattam, is yet to respond to an inquiry concerning the attack on Obiozor’s country home.\nThe attack on Obiozor’s country home happens same morning the Umuguma Divisional Police Headquarters in the Owerri West LGA of the state was burnt with two police constabularies reportedly killed and properties worth millions of Naira burnt."
  },
  {
    "headline": "EFCC detectives quiz Obiano over N42b spending",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) yesterday moved ex-Governor Willy Obiano from Lagos to Abuja for quizzing over alleged N42 billion fraud.\nHe is alleged to have mismanaged his security vote while in office.\n“It is too early to talk about ongoing investigation.”The EFCC had placed Obiano on its watch list in November 2021.\nOne of the petitions written by some citizens of the state raised questions over the spending of the N17 billion Paris Club refund to the state and security vote.\nThe EFCC had previously questioned some commissioners and principal officers over the alleged mismanagement of the state funds."
  },
  {
    "headline": "I slapped Obiano’s wife in self defence, says Bianca Ojukwu",
    "summarized_story": "Setting the records straight yesterday, Bianca said she slapped Ebele in self defence after the latter attempted to remove her headgear in public.\n“It is unfortunate that she threw all caution to the wind and imported this kind of melodrama to a state ceremony.\nHe said Ebele’s action was not only against Bianca but against the spirit of her late husband and founder of the APGA who Bianca came to represent.\n“It is on record that I took Obiano and his wife, Ebele, to Bianca Ojukwu where they knelt down while seeking the party’s governorship ticket.\n“Bianca endorsed Obiano and called on all APGA members including then Governor Peter Obi to support him."
  },
  {
    "headline": "JUST IN: Gunmen set police division ablaze in Imo",
    "summarized_story": "Gunmen have set Umuguma police headquarters in Owerri West Local Government Area of Imo State on fire.\nA resident of the area who pleaded not to be mentioned for fear of being attacked said these hoodlums were mean.\nHe was a final year student at Imo state University in Owerri.\nThe entire place is in a state of fear and confusion as we didn’t sleep last night.\nThe invasion was deadly.”The attack came few hours after the Assistant Inspector General of police in charge of zone 9- Umuahia, Isaac Akinmoyede, left the state after a one-day working visit."
  },
  {
    "headline": "Breaking: Again, gunmen bomb Imo police station",
    "summarized_story": "From Stanley Uzoaru, OwerriGunmen again renew their attack on police formation in Imo State attacking the Umuguma police division in Owerri West Local Government Area of Imo State at the early hours of Sunday.\nA source from the area who narrated the incident to our correspondent said that the hoodlums also killed 2 police constabularies who were on duty.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nAccording to the source, the gunmen who were heavily armed blocked the road on arrival at the station and started shooting sporadically to scare people from coming close to them before they threw a dynamite inside the premises."
  },
  {
    "headline": "Beware of subversive elements, Naval Chief warns 329 retiring personnel",
    "summarized_story": "The Chief of Naval Staff, Vice Admiral Awwal Gambo has warned retiring soldiers of the Nigerian Armed Forces to be wary of subversive element within the society, urging them to stay away from these elements and remain loyal to the Nigerian military.\nThe CNS urged the graduands to justify the magnanimity of President Muhammadu Buhari who had continued to support the armed forces especially retiring personnel as observed in the enhanced welfare packages.\nAlso speaking, Lubo said that over 50,000 personnel of the armed forces had been trained in NAFRC since it’s inception in the 1980’s.\n“The centre has also successfully trained members of paramilitary agencies as well as members from federal ministries, departments and agencies.\nThe NAFRC Commandant thanked President Buhari for his continuous support to the development of the military and also extended his appreciation to the families of the retiring personnel for their love and support over the past years."
  },
  {
    "headline": "Showdown at Soludo’s inauguration: Why I slapped Obiano’s wife –Bianca Ojukwu – The Sun Nigeria",
    "summarized_story": "From Magnus Eze, EnuguNigeria’s former Ambassador to Spain and wife of Dim Chukwuemeka Odumegwu Ojukwu, Mrs Bianca Ojukwu has given reasons why she slapped the immediate past first lady of Anambra State, Ebelechukwu Obiano on Thursday.\nThe duo had a faceoff in Awka during the inauguration of Professor Chukwuma Soludo as the new governor of Anambra State.\nBianca was seen in a viral giving Ebele a slap after the latter left her seat to assault Mrs Ojukwu.\nMrs Obiano who was left messy after her fracas with Bianca was also filmed on camera calling Bianca ‘’ashawo,’’ referring to prostitute.\nIn a statement yesterday, Bianca disclosed that Mrs Obiano was not just the aggressor, but that the former governor’s wife had a premeditated plot to disgrace her."
  },
  {
    "headline": "Obiano’s wife has committed sacrilege, she must apologise to Igbo –Obi of Awka",
    "summarized_story": "The Obi of Awka Ancient Kingdom, Awka Capital Territory, Dr. Austin Ndigwe (JP), has given the wife of the immediate past governor of Anambra State, Mrs. Ebelechukwu Obiano seven days to publicly apologise to the entire Igbo people or face serious consequences, over her sacrilegious action against the symbol of Igbo unity, Bianca Odumegwu- Ojukwu.\n“Bianca told me after the incident that what angered her was that Ebere called her unprintable names, including prostitute and queried her presence at the swearing in ceremony.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\n“Unfortunately, this grave sin was committed in the land of Awka, which is known for peace and unity.\n“Even when she was informed that the seat was for the chief judge, she refused to vacate the seat, only for her to stand up and move towards the direction of Bianca Ojukwu to start pouring venom on her."
  },
  {
    "headline": "‘Why EFCC moved Obiano to Abuja’",
    "summarized_story": "A source at the Economic and Financial Crimes Commission (EFCC) has disclosed that the commission transferred the former governor of Anambra State, Willie Obiano to Abuja after his arrest in Lagos on Thursday night to allow the EFCC ample space to interrogate the former governor.\nIt was gathered that Obiano was moved from Lagos to the EFCC headquarters in Abuja on Friday morning.\nObiano was arrested at Lagos airport as he was preparing to board a flight to Houston, United States on Thursday night.\nSpokesperson for the EFCC, Mr Wilson Uwujiaren, confirmed Obiano’s transfer to Abuja when he spoke with the News Agency of Nigeria (NAN) on Friday in Lagos.\n“The ex-governor was arrested in Lagos, but was moved to Abuja this morning (Friday),” Uwujiaren said."
  },
  {
    "headline": "Anti-graft Agency, EFCC Moves Ex-Anambra Governor, Obiano From Lagos To Abuja For Interrogation",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has moved former Anambra Governor, Willie Obiano to its headquarters in Abuja.\nGovernor Willie ObianoUwajaren said Obiano was still in detention and not released as reported by some newspapers.\nSee Also Breaking News BREAKING: Anti-graft Agency, EFCC Arrests Ex-Anambra Governor, Obiano At Lagos AirportObiano is also being probed over some suspicious projects, including the Umueri International Airport project whose cost was believed to be inflated.\nEFCC operatives had picked him up at the Murtala Muhammed International Airport, Lagos, around 08:30 pm on Thursday.\nHe was on his way to Houston, Texas, US, after handing over to his successor, Governor Charles Soludo."
  },
  {
    "headline": "Anti-graft Agency, EFCC Moves Ex-Anambra Governor, Obiano From Lagos To Abuja For Interrogation",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has moved former Anambra Governor, Willie Obiano to its headquarters in Abuja.\nGovernor Willie ObianoUwajaren said Obiano was still in detention and not released as reported by some newspapers.\nSee Also Breaking News BREAKING: Anti-graft Agency, EFCC Arrests Ex-Anambra Governor, Obiano At Lagos AirportObiano is also being probed over some suspicious projects, including the Umueri International Airport project whose cost was believed to be inflated.\nEFCC operatives had picked him up at the Murtala Muhammed International Airport, Lagos, around 08:30 pm on Thursday.\nHe was on his way to Houston, Texas, US, after handing over to his successor, Governor Charles Soludo."
  },
  {
    "headline": "BREAKING: Anti-graft Agency, EFCC Arrests Ex-Anambra Governor, Obiano At Lagos Airport",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested former Anambra State Governor Willie Obiano.\nObiano was arrested at the Murtala Muhammed International Airport, Lagos.\nHe was said to be on his way to Houston, Texas in the United States.\nThe EFCC had last November placed Obiano on a watch-list.\nThe anti-graft agency had requested the Nigeria Immigration Service to inform it anytime the former governor was travelling out of the country from any of the international airports, as well as other points of entry and exit."
  },
  {
    "headline": "BREAKING: Anti-graft Agency, EFCC Arrests Ex-Anambra Governor, Obiano At Lagos Airport",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested former Anambra State Governor Willie Obiano.\nObiano was arrested at the Murtala Muhammed International Airport, Lagos.\nHe was said to be on his way to Houston, Texas in the United States.\nThe EFCC had last November placed Obiano on a watch-list.\nThe anti-graft agency had requested the Nigeria Immigration Service to inform it anytime the former governor was travelling out of the country from any of the international airports, as well as other points of entry and exit."
  },
  {
    "headline": "Sleep-Walking Into Universal Disaster By Owei Lakemfa.",
    "summarized_story": "I often hear an exclamation like: ‘The Devil is a liar’; but in reality, the Devil is a realist; the best way to avoid a nuclear disaster is to rid the world of nuclear weapons.\nBut nuclear weapons increased to 3,000 in 1955 and to over 37,000 by 1965 (US, 31,000 and the Soviet Union 6,000).\nAt this point, there were demands that nuclear weapons should first be drastically reduced, then eliminated.\nYet, humanity and nuclear weapons cannot co-exist; one will have to give way to the other.\nThe way out is decommissioning all nuclear weapons; but will the powerful agree to give up their lethal weapons?"
  },
  {
    "headline": "Students give LAUTECH lecturers 72 hours to pull out of ASUU strike",
    "summarized_story": "Students of the Ladoke Akintola University of Technology (LAUTECH) have given the institution’s Academic Staff Union of Universities (ASUU) 72 hours to withdraw from the ongoing strike.\nAdvertisement“We are giving the leadership of ASUU LAUTECH 72 hours to borrow a leaf from ASUU KWASU that wrote a special letter to the National ASUU based on peculiarity in their institution,” it said.\n“LAUTECH ASUU should opt out of this ongoing strike or else the students’ union will be left with no choice but to see ASUU LAUTECH as saboteurs to the progress of LAUTECH.\n“ASUU LAUTECH, up to date, has refused to grant this sane request but gave excuses of no convenient time due to tensile loads on them.\n“Is it not now crystal clear that ASUU LAUTECH is only fighting for their sole interest at the expense of students?"
  },
  {
    "headline": "Police deny shooting claim in Ibadan",
    "summarized_story": "The Oyo state police command has dismissed a claim that its officers shot a corps member in Ibadan, the state capital.\nAdvertisementOn Thursday, reports had circulated on social media that operatives of the command shot a corps member who was returning from his community development service (CDS).\nAdvertisement“A reckless driving corps member, in company of his colleagues while returning from their CDS, in a white tinted Toyota Camry with Reg.\n“Thus, inciting the now riotous corps members to completely cut off the flow of traffic by blocking the road and other adjoining routes, before proceeding to attack any officer in sight.\n“The riotous corps members then pounced on Sgt."
  },
  {
    "headline": "KWASU ASUU: Why we can’t continue with ongoing strike",
    "summarized_story": "The Kwara State University (KWASU) branch of the Academic Staff Union of Universities (ASUU) says it would not join the extended strike by the national body of the union.\nAdvertisementASUU had on February 14 declared a one-month warning strike to protest the non-implementation of its demands by the federal government.\nBut on Monday, the union extended the strike by eight weeks, citing the government’s failure to fully address its demands.\nIn a statement by Shehu Salahu, its chairman, the varsity’s ASUU branch said it is in support of the strike but will not continue with it due to challenges confronting the institution.\nKWASU is relatively a new branch and our members are gradually being initiated into the ASUU philosophy, tradition and procedures.”The KWASU ASUU branch said it had already communicated with the leadership of the union and other relevant stakeholders on its position on the strike."
  },
  {
    "headline": "NYSC probes viral video of corps members’ erotic dance at orientation camp",
    "summarized_story": "The National Youth Service Corps (NYSC) says it is investigating a viral video of erotic dance among its corps members.\nAdvertisementThe footage from a yet-to-be-identified orientation camp had shown corps members dancing erotically.\nIn the video, one female corps member was seen giving a lap dance to a male counterpart.\nThe video, which attracted condemnations from Nigerians, also showed a male corps member hitting his crotch against a female’s while another corps member was heard screaming, “give am well”.\nAdvertisement“[It is] showing corps members supposedly in NYSC orientation camp in very compromising actions that pushed beyond the boundary of decency."
  },
  {
    "headline": "Dotman: Dismissing abuse against men is destructive… I’ve seen these things",
    "summarized_story": "Dotman, the singer, says it is destructive for society to dismiss abuses committed against its men.\nAdvertisementThe music star tweeted on Saturday about societal bias against men and how he has seen abuse of different kinds.\n“Abuse against men is really something, even though it’s rarely highlighted,” the singers wrote.\nAdvertisement“Like even from society POV, men are not even allowed the space to process the pain and stress.\nLike even from society POV, men are not even allowed the space to process the pain and stress."
  },
  {
    "headline": "Digital Nomads: The Nigerians escaping Ukraine’s war",
    "summarized_story": "Students, all of whom are given temporary residence permits, can work unofficially or do small businesses by registering as private entrepreneurs.\n“I finished last year, and I was going to leave Ukraine this year.\nYou can’t get out that easily.”A day after Russia’s invasion, Ukraine’s president Volodymyr Zelenskyy instituted martial law and grounded commercial flights.\n“I was already applying for visas to leave Ukraine for the UK where my brother is.”Kemi’s journey is not so certain.\nIf you think your story fits the Digital Nomads bill, reach out to us here."
  },
  {
    "headline": "Big Cabal Media raises $2.3m to expand its compelling line of digital products",
    "summarized_story": "In 2021, venture capital invested $115 million in digital media globally, a tenth of the $1.1billion it funded in 2015, but not much came to Africa.\nToday, one of such exceptions, Big Cabal Media (BCM), a leading African digital media company, has announced a $2.3 million Seed funding round, emphasising its commitment to keep building exciting and authoritative media products and brands.\nBCM’s progress over the years and recent fundraise is a noteworthy example of the possibilities and opportunities in Africa’s digital media sector.\nOf the reported $4.3–$5 billion raised by African startups in 2021 whereby fintech received 53–63% of the volume, digital media companies are one of many sectors that have traditionally been overlooked in the conversation of tangible ventures.\n“Investing in Africa’s booming digital media sector aligns perfectly with MaC’s mission of supporting exceptional entrepreneurs building valuable technology companies that leverage shifts in cultural trends and behaviours."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal is set to launch a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Did you miss Apple’s first event of the year?\nI did, but I saw a recap and the best way to describe my reaction is..."
  },
  {
    "headline": "Big Cabal Media’s seed funding",
    "summarized_story": "This means that sharing your Netflix password with someone else may soon become expensive, as account sharing will incur an additional fee.\nToday, I’ll be discussing:Dream VC’s pipeline planBig Cabal Media’s seed fundingDream VC’s pipeline planNowadays, it appears that many people want to work in technology companies.\nHowever, only a small percentage are familiar with the Venture Capital (VC) industry.\nInterestingly, venture capital funding only became common in the last decade, leaving a considerable talent gap, which Dream VC was founded to fill.\nBig Cabal Media’s seed fundingIf you are on Twitter, you might likely have read content from Zikoko, TechCabal, or both."
  },
  {
    "headline": "Inside Dream VC’s plan to build a pipeline for African VC talent",
    "summarized_story": "However, very few understand or are even aware of the venture capital space, but Mark Kleyner and Cindy Ai want to demystify the space with Dream VC.\nInterestingly, VC funding only became common in the past decade, and so there is a gaping talent hole, which Dream VC was launched to fill.\nThe goal was to help them break into the VC space,” he added.\nHaving tested their hypothesis, Dream VC would be launching two programmes: the Launch into VC Program and the Investor Accelerator Program.\nLaunch into VC is a fully remote 13-week programme targeted at early-stage professionals looking to break into the VC space."
  },
  {
    "headline": "African B2B eCommerce on growth streak",
    "summarized_story": "The eCommerce startup also got a makeover, changing its name from Sokowatch to Wasoko, meaning people of the market.\nThe B2B model: Like TradeDepot, Alerzo and other eCommerce startups that have raised funds from 2021, B2B is the dominant model.\nAs B2B continues to be the go-to model for eCommerce in Africa, only time will tell how sustainable it is.\n4G Capital’s $18m fundingKenyan fintech startup, 4G Capital, has raised $18 million in a Series C round led by Lightrock.\nA touch of eCommerce: 4G Capital plans to roll out new products, including an app, later this year."
  },
  {
    "headline": "Ponzi schemes: Investors’ greed or dearth of investible products?",
    "summarized_story": "Ponzi schemes are ‘investment’ schemes that promise unrealistic returns which ordinarily should be treated with caution.\n“The capital market experience starts with a bank account and eventually the distribution has to hit a bank account as well.\n“The upsurge of these schemes has undermined the reputation of the capital market and dampened investors’ confidence, among other things.\nThe National Assembly is proposing a Bill that will empower the SEC to impose stiffer punishment on promoters of Ponzi Schemes and other unregistered investment schemes.\nNo capital market can grow without discipline and adherence to laid down rules and regulations,” Yuguda told journalists after the second capital market committee meeting in 2021."
  },
  {
    "headline": "Your career is really in your hands – Damola Andah, talent manager",
    "summarized_story": "Damola Andah is a seasoned talent manager with almost a decade in hiring top talents for innovative and successful businesses within the country.\nShe held various roles, including Human Resources Project Officer, Performance and Talent Management Officer, Senior Talent Management Officer, Human Resource Business Partner, Lagos, & Southwest Regions and Head, Talent & Succession Programme Management (2019).\nWhat have you learned about people and career management over the years as an HR professional?\nFrom my experience, I would say career management is not static, and your career is really in your hands.\nWhat advice do you have for young women on career management and progression?"
  },
  {
    "headline": "Nigeria records worst ranking in World Happiness index",
    "summarized_story": "Africa’s biggest economy has recorded the worst performance in the 2022 World Happiness Report, ranking 118 out of 146 countries.\nThe report which was released today, two days before the annual International Day of Happiness is issued annually by the UN’s Sustainable Development Solutions Network.\nThe report ranks nations based on factors such as personal sense of well-being, levels of GDP, life expectancy among others.\nThe report also highlighted that Finland retained its position as the world’s happiest place, while Mauritius, standing at 52 positions, is the happiest country in Africa.\nLibya is now the second happiest country in Africa, followed by Ivory Coast, South Africa, Gambia, and Algeria."
  },
  {
    "headline": "Edo offers property developers 2-week window for issuance of free building plans …begins farming season March 25 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government, as part of efforts at ensuring all property in the state are with building plans, is offering property developers a 2-week window for issuance of free building plan permits.\nShe noted, “The ‘Operation show you building plan’ seeks to encourage all land developers and those building to come for their building plan in the ministry.\nThe objective of the exercise is to capture all into the Edo State Master Plan as it’s necessary for development.\nThis year’s farming season should be taken seriously as there will be an interface between farmers and off-takers.\n“The disease is a pandemic that is still ravaging some communities across local government areas in Edo State."
  },
  {
    "headline": "AAU VC Lauds Outgoing Registrar – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestTHE acting Vice Chancellor of the Ambrose Alli University, (AAU), Ekpoma, Edo State, Prof. Sonnie Adagbonyin has showered encomiums on the outgoing acting Registrar of AAU, Mr. Edward Aihevba for his outstanding achievements in office.\nHe gave the commendation while speaking at the Second Registry Lecture of the institution, titled: Administrative Imperatives for Universities: A case Study of Ambrose Alli University; delivered by the outgoing acting Registrar, Mr. Edward Aihevba.\nThe acting vice chancellor asserted that the outgoing Registrar in his short time in office recorded numerous achievements which were of benefit to the staff, students and the university in general.\nPraised the registry department and outgoing Registrar for the registry lecture initiative, and called on other departments of the university to emulate the registry department by organising similar lectures for staff members.\nHe explained that the registry lecture was introduced in his time as acting Registrar because of his desire to broaden and sharpen the administrative skills of staff of the registry for optimum performance."
  },
  {
    "headline": "Obaseki partners centre on construction of Benin Cultural Village, assures policies to preserve Edo heritage – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has assured support for the construction of the Benin Cultural Village, being built by the Benin Cultural Heritage Centre (BCHC), reassuring that his government will sustain policies and reforms to preserve the state’s rich cultural heritage.\nObaseki, who received the executives and members of the Benin Cultural Heritage Centre on a courtesy visit at the Government House, said his government is paying critical attention to the state’s cultural assets to boost social-economic activities in the culture and tourism sector.\nWe have huge plans for our history and cultural heritage as this administration has a lot to showcase, knowing it can drive our Internally Generated Revenue (IGR) in Edo State.\n“Our governor is very passionate about our cultural heritage.\n“We have trained 300 teachers in Edo language and the government has employed them.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo Community head send SOS to Security Agencies – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe people of Ogheghe Community, Uhuowmonde Local Government Area of Edo State has notified security agencies in the state over the planned attacked by some evil doers been spearheaded by the current chief priest Samuel Emokpae.\nPa Kingsley Iziengbe Amayo in a statement personally singed by him said the community has endured lasting peace since August 2017 judgment by His Royal Majesty, Oba Ewuare II.\nAccording to the statement; Priest Samuel Emokpae from all indications is bent on sabotaging the peace that we have been enjoying for the past four years.\nThe Community still and will continue to abide by the judgment of 15 August 2017 as pronounced by our Royal Majesty.\n” All we want is that various security agencies including the Nigerian Police and Army to take note of this threat by Priest Emokpae before it degenerate to crisis."
  },
  {
    "headline": "AfDB secures $15.6bn to link Nigeria and Ivory Coast by road",
    "summarized_story": "African Development Bank (AfDB) says it has secured $15.6 billion for the construction of the Lagos-Abidjan highway corridor, that would link Nigeria and Ivory Coast, to ease transportation across West Africa.\nThe bank had in April 2020, approved funding of $13.67 billion for the Lagos-Abidjan highway corridor project.\nAdesina said the project would go a long way to support trade in West Africa and reduce transport costs and increase intra-regional trade volume.\n“The biggest deal for the boardroom is the $15.6bn deal for the Lagos-Abidjan highway corridor.\n“The AfDB will also be establishing a $1m AFAWA women advisory facility to support women with advisory services,” he addedFacebook Notice for EU!"
  },
  {
    "headline": "Access Bank grows profit by 51% to N160bn in 2021",
    "summarized_story": "Access Bank Plc recorded 51.13% growth in profit to N160 billion for the full year 2021, ended December 31.\nAccording to a release announcing the results, the bank’s net interest income grew by 14.64% from N262.95 billion to N301.46 billion in the current period.\nThe bank earned N601.70 billion, from its lending business as Interest income grew by 22.99% from N489.22 billion.\nDespite a 32.3% spike in loan losses, net interest income after impairments still appreciated by 9.09% to stand at N218.25 billion.\nThe company had earlier paid an interim dividend of N0.30 kobo in September 2021, hence bringing the total dividend for the financial year to N1.00 kobo."
  },
  {
    "headline": "Osun DMO warns ex-finance commissioner against dishing out wrong data on state’s debt profile",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun Debt Management Office (DMO) has cautioned the immediate past Commissioner for Finance in the state, Dr Wale Bolorunduro against misleading the public with wrong narratives as regards the state’s debt portfolio.\n“On the issue of the State’s monthly loan repayments, and monthly loan deductions from the Statutory receipts, these are verifiable details from both the offices of Accountant-General (AG) of the Federation and Federal Ministry of Finance (FMoF).\nTherefore, the unending narratives on Osun State’s Debt Stock and loan repayments from the former Commissioner of finance, in our view are mischievous and needless,” he said.\n“For avoidance of doubts, we wish to add that till date, the current administration has applied over =N=70billion for the State’s loan repayment.\nAs a matter of fact, the State’s IGR was at best, only about 25% of the State’s loan repayment throughout his 3 year tenor as Finance commissioner in the State,” the DG, DMO noted."
  },
  {
    "headline": "Yoruba started glass technology, were the easiest scientists – Ooni of Ife",
    "summarized_story": "He said the community is making history in the world through culture and anthropological artwork, showcasing cultural heritage.\n“It has now been established that technology is behind the glass.\nHe traced it back here in 1830 and was marvelled to see a very broad-based industry rolling out glass technology in millions and it is being spread across the world.\nSome of the first sets were taken from Wumonije compound all the way to British museum, but this was freshly discovered here and it is actually linked to bronze technology, Iron technology which is the Iron and Bronze age, all the way to using Aluminum as a technology, using Copper, using Gold.\nWhat we are using as a symbol for the Yoruba people was first of all dug here.”"
  },
  {
    "headline": "Buhari Returns To Abuja From London",
    "summarized_story": "President Muhammadu Buhari has returned to the country after spending two weeks in London for a medical vacation.\nThe President was received at the Nnamdi Azikwe International Airport on Friday night by his Chief of Staff, Prof Ibrahim Gambari; Minister of FCT, Mallam Muhammed Musa Bello; Minister of Water Resources, Engr Sulieman Adamu, and other senior government officials.\nHis spokesman, Femi Adesina, explained that his early return to the country showed that all is well with the President.\nHe added that his presence will bring cohesion back to the ruling All Progressives Congress (APC) which has been in disarray in the run-up to its national convention slated for March 26, 2022.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Deleting Section 84 Of Electoral Act Will Cripple Democratic Choices – TMG",
    "summarized_story": "The Transition Monitoring Group (TMG) has called on the National Assembly not delete Section 84 (12) in the Electoral Act 2022, stating that it will cripple democratic choices.\nTMG chairman, Awwal Musa Rafsanjani, stated this on Friday during a meeting aimed at ensuring electoral transparency in the forthcoming 2023 general election.\nAccording to Rafsanjani, TMG strongly do not support the call to delete sSction 84 (12) in the new electoral law and urged the National Assembly to disregard the call.\n“So, we call on the National Assembly to totally disregard this call because this call is not meant to defend democracy.\nSo, Transition Monitoring Group is solidly calling on the National Assembly not to consider this amendment."
  },
  {
    "headline": "Deleting Section 84 Of Electoral Act Will Cripple Democratic Choices – TMG",
    "summarized_story": "The Transition Monitoring Group (TMG) has called on the National Assembly not delete Section 84 (12) in the Electoral Act 2022, stating that it will cripple democratic choices.\nTMG chairman, Awwal Musa Rafsanjani, stated this on Friday during a meeting aimed at ensuring electoral transparency in the forthcoming 2023 general election.\nAccording to Rafsanjani, TMG strongly do not support the call to delete sSction 84 (12) in the new electoral law and urged the National Assembly to disregard the call.\n“So, we call on the National Assembly to totally disregard this call because this call is not meant to defend democracy.\nSo, Transition Monitoring Group is solidly calling on the National Assembly not to consider this amendment."
  },
  {
    "headline": "Why I Slapped Obiano’s Wife – Bianca Ojukwu",
    "summarized_story": "Mrs. Bianca Odumegwu-Ojukwu, the widow of the late Biafran warlord, Chief Chukwuemeka Odimegwu Ojukwu, has said that she slapped the wife of former Anambra State governor because the latter tried to remove her hair tie, an act that is considered a sacrilege for a titled Igbo woman.\nWhile initial stories had said it was Obinano’s wife that slapped Bianca, it turned out however that the reverse was the case.\nBianca, a former Nigerian Ambassador to Spain, gave her explanations in a statement she issued in Awka, the Anambra State capital, on Friday.\nShe held on to her wig with her two hands and tried to take the wig away from me.\n“It is unfortunate that she threw all caution to the wind and imported this kind of melodrama to a state ceremony."
  },
  {
    "headline": "Why I Slapped Obiano’s Wife – Bianca Ojukwu",
    "summarized_story": "Mrs. Bianca Odumegwu-Ojukwu, the widow of the late Biafran warlord, Chief Chukwuemeka Odimegwu Ojukwu, has said that she slapped the wife of former Anambra State governor because the latter tried to remove her hair tie, an act that is considered a sacrilege for a titled Igbo woman.\nWhile initial stories had said it was Obinano’s wife that slapped Bianca, it turned out however that the reverse was the case.\nBianca, a former Nigerian Ambassador to Spain, gave her explanations in a statement she issued in Awka, the Anambra State capital, on Friday.\nShe held on to her wig with her two hands and tried to take the wig away from me.\n“It is unfortunate that she threw all caution to the wind and imported this kind of melodrama to a state ceremony."
  },
  {
    "headline": "Willie Obiano 'withdrew' N42 billion in cash",
    "summarized_story": "By Monday Ijeh/NANThe Economic and Financial Crimes Commission (EFCC) said former Gov.\nWillie Obiano of Anambra was being quizzed over the misappropriation of N42 billion belonging to the state.\nThe source said the former governor was being interrogated over the alleged misapplication of N5 billion Sure-P and N37 billion security vote withdrawn in cash.\nThe Commission on Friday told NAN that the former governor was in its custody undergoing interrogation after his arrest on March 17.\n“All I can tell you now is that he is still in the EFCC custody in Abuja,” he said."
  },
  {
    "headline": "3 die, 16 injured in Bauchi auto crash",
    "summarized_story": "Tragedy struck on Friday in Bauchi State, as three people lost their lives, while 16 others sustained various injuries in a lone auto crash.\nMr Yusuf Abdullahi, Sector Commander, Federal Road Safety Corps (FRSC), confirmed the incident in an interview on Saturday.\n“About 20 people were involved in the crash, made up of 18 male adults, one female adult, and a female child.\n“Three male adults lost their lives on the spot, 16 people, including 15 male adults and a female adult sustained injuries, while the only soul unscathed was the female child,” he said.\nAbdullahi explained that both the remains of the deceased and those injured had been taken to Ningi General Hospital."
  },
  {
    "headline": "BREAKING: Gunmen Raze Ohanaeze President’s Country Home In Imo",
    "summarized_story": "On Saturday morning, gunmen set fire to the country residence of Prof George Obiozor, President-General of Ohanaeze Ndigbo, in Awo-Omanma, Oru East Local Government Area, Imo State.\nAccording to The Punch, the terrorists arrived in vehicles and threw explosive devices at the Igbo leader’s home.\nA source said, “The country home of Prof George Obiozor was burnt.\nMicheal Abattam, the state’s police spokesperson, had yet to respond to a question about the attack on Obiozor’s country residence.\nOn the same day as the attack on Obiozor’s rural residence, the Umuguma Divisional Police Headquarters in the state’s Owerri West LGA was set on fire."
  },
  {
    "headline": "EFCC Under Fire For Arresting Gov Obiano Instead Of Bola Tinubu",
    "summarized_story": "EFCC Under Fire For Arresting Gov Obiano Instead Of Bola TinubuThe Economic and Financial Crimes Commission, or EFCC, has come under fire for allegedly failing to apprehend former Lagos State Governor Asiwaju Bola Tinubu.\nAnd Omokri is shocked that the EFCC hasn’t pursued Tinubu, the former governor of Lagos State for eight years.\n“Compared to Bola Tinubu, Obiano is a saint.\nCompared to Oluremi Tinubu, Ebele is a choir mistress,” the former aide to ex-President Goodluck Jonathan tweeted.\n“Why has EFCC left Bola Tinubu, with his humongous corruption, and gone after Obiano?"
  },
  {
    "headline": "Nigeria has 2 laws, if Obiano’s wife, Bianca Ojukwu are not arrested- Falana",
    "summarized_story": "Human rights lawyer, Mr. Femi Falana (SAN), on Friday, stressed that Nigeria operates two sets of laws, one for the rich and one for the poor, if the wife of Anambra’s ex-Governor- Willie Obiano, Ebelechukwu; and a former Ambassador to Spain, Bianca Ojukwu, are not arrested for the offence of affray.\n“The offence of affray occurs when two or more people engage in a fight in public.\nThe senior advocate argued that the police would have immediately arrested the two of them, if they were not dignitaries.\nBut that is not the end of the case as the offence of affray was committed.\n“If two workers had committed affray in that ceremony, they would have been arrested, detained, and charged for disrupting the new governor’s inauguration.”"
  },
  {
    "headline": "Why I slapped ‘drunken’ Obiano’s wife – Bianca Ojukwu",
    "summarized_story": "Bianca Ojukwu has opened up on the fight incident involving her and Ebelechukwu Obiano, the immediate past first lady of Anambra state during the inauguration of Charles Soludo as the new governor of the state, on Thursday.\nRecall, News Direct had reported that Bianca slapped the former First lady during the inauguration after she abused her, leading to a fight between the duo.\nBianca, who spoke about the incident while appearing on Arise TV on Friday, said Mrs. Obiano who was drunk, came to abuse her, which prompted her own reaction.\n“The former APGA chairman, Victor Umeh, told her to leave me and told everyone to leave.\nI was stunned by the stench of whisky in her breath at such an early hour of the day."
  },
  {
    "headline": "Breaking: Hoodlums ‘attack’ Ohaneze Ndigbo President General’s house",
    "summarized_story": "The country home of the President General, Ohaneze Ndigbo Worldwide, Ambassador George Obiozor, in Oru East local government area of Imo state has been reportedly attacked by unknown gunmen early Saturday.\nAlthough, the Police Public Relations Officer(PPRO) Imo State Command, CSP Mike Abattam, is yet to confirm the incident as at the time of filing this report, Blueprint gathered that part of the house was burnt by the hoodlums.\nThe attack happened about the same time another Police station was invaded by gunmen in Umuguma, killing two operatives.\nIncidentally, Ambassador Obiozor was not at home when the incident happened.\nDetails loading…"
  },
  {
    "headline": "Imo: Pandemonium as gunmen invade another Police station, kill 2, destroy 12 vehicles – Blueprint Newspapers Limited",
    "summarized_story": "The Umuguma Police dtation in Owerri West Local Government Area (LGA) of Imo state was attacked by gunmen Saturday morning.\nBlueprint gathered that between 2 and 3am, sporadic gunshots were heard by people living around Umuguma, the headquarters of the LGA, up to Federal Housing area and World Bank Housing Estate.\nThe sounds reportedly lasted up to one hour without resistance from the law enforcement agencies.\nThe roof of the station building was clearly blown up with weapons suspected to be explosives, while more than 12 vehicles parked in the station belonging to individuals were burnt.\nHowever, the Imo Police command’s Public Relations Officer (PRO), CSP Mike Abattam who confirmed the incident to newsmen on the Police/Media WhatsApp platform, said the attack was repelled."
  },
  {
    "headline": "Medical trip: From United Kingdom, Buhari returns to Abuja",
    "summarized_story": "After 12 days, President Muhammadu Buhari has has to the Nigeria’s seat of power, Aso Rock Villa Abuja.\nThe President according to his media team returned Friday evening.\nPresident Buhari had left for medical checkup almost two weeks ago.\nWith his return, plans by the ruling party, the All Progressives Congress (APC) to stage its long-awaited national convention is expected to be on top gear.\nThe convention which has witnessed postponements is scheduled for March 26, 2022 in Abuja."
  },
  {
    "headline": "Gunmen Attack Divisional Police Headquarters In Imo",
    "summarized_story": "The Divisional police headquarters in Umuguma Owerri West Local Government Area of Imo State has been set ablaze by gunmen.\nThe gunmen were reported to have invaded the police station at about 04:00 hours on Saturday morning and attacked police officers on duty.\nThe suspects also freed suspects in detention and threw petrol bombs, setting ablaze the police station.\nResidents said the gunmen shot into the air during the attack they were frightened as they ran into bushes for safety.\nREAD ALSO: Police Arrest 30 Suspects For Complicity In Banditry, Kidnapping, Other Violent CrimesThe Imo state police command public relations officer Mike Abattam confirmed the report of the attack to Channels Television."
  },
  {
    "headline": "FG To Gazette Electoral Act, Remove Section Barring Political Appointees From Elections",
    "summarized_story": "The Federal Government says it will go ahead to gazette the Electoral Act 2022, but remove the contentious Section 84 (12) of the law.\n“The judgment of the court will be recognised by the government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\nPresident Muhammadu Buhari assented to the Electoral Act 2022 on February 25, following a series of attempts by the National Assembly to amend the nation’s electoral laws.\nHe later asked the Senate to amend the section of the Act, but the request was rejected by the lawmakers."
  },
  {
    "headline": "Obiano Arrested For Alleged Misappropriation Of N42bn – Source",
    "summarized_story": "The arrested former Governor of Anambra State was arrested for alleged misappropriation of public funds.\nAccording to the EFCC source, he was arrested for misappropriating N5bn Sure-P and N37 billion Security Vote funds, which was withdrawn in cash.\nFormer Anambra State Commissioner for Information, Don Adinuba, had, at the time, condemned the EFCC watchlist reports, claiming that they were politically motivated.\n“Governor Obiano has a whole four months to remain in office as the Anambra State chief executive,” Adinuba said.\n“The EFCC went too far to announce in November that it is observing him."
  },
  {
    "headline": "Lassa Fever Has Claimed More Lives This Year Than In 2021 – Report",
    "summarized_story": "Lassa fever, one of the most deadly diseases in Nigeria, has continued to kill more people in various parts of the country.\nLassa fever is an acute viral illness and a viral haemorrhagic fever first reported in the Lassa community in Borno State when two missionary nurses died from an unusual febrile illness, according to the Nigeria Centre for Disease Control (NCDC).\nAs of March 13 – representing about 10 weeks into 2022, 112 people died of Lassa fever.\nOf all confirmed cases, 70 per cent are from Ondo (30 per cent), Edo (24 per cent), and Bauchi (16 per cent).\nIt added that the National Lassa fever multi-partner, multi-sectoral, and Emergency Coordination Centre (EOC) has been activated to coordinate response activities at all levels."
  },
  {
    "headline": "Bitcoin To The Rescue: Cryptocurrencies’ Role In Ukraine",
    "summarized_story": "Cryptocurrencies have taken on an unprecedented role in the war in Ukraine, helping the government raise millions of dollars to fund its fight against the Russian invasion.\nWhy has Ukraine turned to cryptocurrencies, and how is the nascent crypto industry changing its reputation and having an impact amid the clouds of war?\nIt is being spent on aid like daily rations and bullet-proof vests and helmets,” the 37-year-old Ukrainian told AFP.\nHe said that the majority of crypto donations came in the form of Bitcoin, Ethereum, and the stablecoin Tether –- a coin pegged one-to-one to the dollar.\nAnother reason crypto donations are of value to Ukraine is because they are less influenced by geopolitical or macroeconomic factors."
  },
  {
    "headline": "We will implement Court Ruling on Electoral Act",
    "summarized_story": "The office of the Attorney General of the Federation and Minister of Justice will accordingly give effect to the Court judgment in line with the dictates of the law and the spirit of the judgment.\nThe judgment of the Court will be recognized by the Government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\nThe provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be so treated accordingly.\nThis is in line with the dictates of chapter 7, Part 4, Section 287 of the 1999 Constitution of the Federal Republic of Nigeria (as amended) on enforcement of decisions that makes it a point of duty and obligation on all authorities and persons to have the judgment of the federal High Court, among others, to be enforced."
  },
  {
    "headline": "Court Vacates Injunction against APC National Convention -",
    "summarized_story": "An FCT High Court has vacated a restraining injunction against the March 26 convention of the All Progressives Congress (APC).\nHe said the the order of November 18, 2021, has been overtaken by a recent Supreme Court judgement on a similar matter.\nSalisu Umoru, had sought to restrain the APC, Governor Buni and the Independent National Electoral Commission (INEC) from organising any convention until the determination of the suit.\nThe application seeking to set aside the November 18, 2021 ruling of the court restraining the convention was stalled on Tuesday after two lawyers, Shuaibu Aruwan (SAN) and Michael Adoyi, both announced appearances for the APC.\nIn the application dated March 9, 2022, the APC was asking for “an order of this honourable court striking out the suit in its entirety for want of jurisdiction."
  },
  {
    "headline": "Federal High Court declares Section 84(12) of Electoral Act Unconstitutional -",
    "summarized_story": "A Federal High Court sitting in Umuahia the Abia State capital has declared unconstitutional Section 84(12) of the newly amended Electoral Act.\nThe court presided over by Justice Evelyn Anyadike while delivering judgement Friday held that the section is in violation of a provision in the 1999 Constitution as amended and should therefore be deleted.\nIt would be recalled that President Muhammadu Buhari had while signing the amended Electoral Act called the attention of the National Assembly to amend the section as it violates the Constitution and breached the rights of political appointees.\nSwiftly, President Muhammadu Buhari wrote a letter to both Chambers of the National Assembly seeking amendment of the section but the Senate rejected the President’s request.\nThe Presiding judge holds that the Constitution has already stipulated that appointees of government seeking to contest elections were only to resign at least 30 days to the date of the election and that any other law that mandated such appointees to resign or leave office at any time before that is unconstitutional, invalid, illegal null and void to the extent of its inconsistency to the clear provisions of the Constitution."
  },
  {
    "headline": "GIZ, KAS organise workshop for Journalists -",
    "summarized_story": "The Independent National Electoral Commission has lamented the poor Infrastructure and road network in Nigeria has great negative impact on its operations.\nOne of its National Commissioners revealed this while speaking on the topic, “INEC and the Electoral Act 2022: operational challenges and emerging risks” at a workshop for journalists on the new Electoral actThe workshop was organised by the German Cooperation, Konrad Adenauer Stiftung in AbujaMany have lauded the signing of the 2022 electoral bill into law but still point out some minor flaws in the Act which could prove contentiousBeyond this, the media has a crucial role to play in enlightening the public, which places on Journalists the need to have a deep rooted knowledge of the Electoral Act.\nThis media workshop is a training on the provisions and changes made to the Electoral Act 2022.\nThe current Act addresses many gaps in the previous Electoral Act but is not without its shortfallsEven officials of INEC have expressed satisfaction with the Electoral Act, 2022 and believe many of its new provisions will assist the Electoral body in conducting credible electionsOrganisers of the workshop also applaud the inherent checks and balances in the new Electoral ActProvisions of the new Electoral Act 2022 will henceforth guide all elections in Nigeria"
  },
  {
    "headline": "Zelensky Calls for Meaningful Peace Talks as Russia’s Grip on Mariupol Tightens",
    "summarized_story": "Ukraine President Volodymyr Zelensky called on Saturday for comprehensive peace talks with Moscow to stop its invasion of Ukraine, saying it would otherwise take Russia “several generations” to recover from its losses in the war.\nOn Saturday Russia’s defence ministry said its hypersonic missiles had destroyed a large underground depot for missiles and aircraft ammunition in the western Ivano-Frankivs region.\nUnprecedented Western sanctions aimed at crippling Russia’s economy have yet to halt what Putin calls a “special operation” to disarm and “de-Nazify” its neighbour.\nZelenskiy alluded to Russia’s losses in a video address early on Saturday.\nMore than 3 million refugees have fled over Ukraine’s western border and Ukrainian authorities have been seeking to evacuate civilians from besieged cities via humanitarian corridors."
  },
  {
    "headline": "Ukraine War: Russia Fires ‘invisible’ Hypersonic Missile in Combat for the First Time Ever",
    "summarized_story": "Russia’s defence ministry claims it has used hypersonic missiles for the first time ever in combat.\nThe use of the weapons is the latest sign Vladimir Putin is getting increasingly desperate as his military struggles to carry out his illegal invasion of Ukraine.\nDetails about the operation remain scarce, but Russia has previously bragged about its hypersonic weapons arsenal.\nRussian President Vladimir Putin has termed the Kinzhal (Dagger) missile “an ideal weapon” that flies at 10 times the speed of sound and can overcome air-defence systems.\nThe Kinzhal missile was one of an array of new weapons Putin unveiled in his state-of-the-nation address in 2018."
  },
  {
    "headline": "Immigration Removes 2 Personnel from Lagos Airport Over Extortion",
    "summarized_story": "The acting Comptroller General of the Nigeria Immigration Service Isah Idris has approved the immediate removal of two operatives from the Murtala Muhammed International Airport Command for unprofessional conduct.\nConsequently, the acting Comptroller General ordered a full investigation into the matter including a thorough check on the CCTV facility at the airport.\nAfter diligent investigation by the committee headed by the Lagos Airport Comptroller of Immigration, CIS KN Nandap, two personnel who attended to the passenger were found culpable of unprofessional action in the handling of the clearance process of the passenger.\nA statement by the spokesman of the NIS, Amos Okpu said they have been withdrawn from the airport and all former privileges as operatives at the airport stripped off them.\nThey are currently undergoing necessary disciplinary procedures in line with the directives of the acting Comptroller General."
  },
  {
    "headline": "Buhari Back In Abuja After Two-Week Medicals In London",
    "summarized_story": "President Muhammadu Buhari Friday evening returned to Abuja after a two-week medical check up in London, the United Kingdom.\nOn what Nigerians should expect from the President as he returns, the Media Adviser stated that “he will continue what he’s doing.\nPresident Buhari had in the course of his medical vacation in London on Wednesday intervened in the internal crisis rocking the ruling All Progressives Congress (APC) saying Mai Mala Buni remains the interim national chairman of the party.\nThe President’s official plane, Nigeria Air Force 1, took off from the Presidential wing of Nnamdi Azikiwe International Airport, Abuja.\nPresident Buhari was seen off at the airport by the Chief of Defence Staff (CDS), General Lucky Irabor; service chiefs, Inspector General of Police, Usman Alkali Baba and his Chief of Staff, Prof Ibrahim Gambari, among other top government officials."
  },
  {
    "headline": "Abramovich Handed Chelsea Director Control of Firm on Day of Ukraine Unvasion",
    "summarized_story": "It was the second time Chelsea owner Abramovich moved assets to a close associate before Britain and the European Union imposed sanctions on him this month.\nA Reuters analysis of corporate filings in London and Amsterdam showed Abramovich was previously listed as the “beneficial owner” of Cyprus-based Ervington Investments Limited.\nAbramovich has handed control of two companies to business associates since the war began, according to corporate filings.\nBritain imposed sanctions on Abramovich on March 10, saying he had profited from transactions with the Russian government and special tax breaks.\nTenenbaum was among 10 of Evraz’s board members who quit on March 11 because of the Abramovich sanctions, the company said."
  }
]