[
  {
    "headline": "Defend yourselves, CAN advises residents as bandits attack Southern Kaduna again",
    "summarized_story": "John Hayab, described the fresh attack on Southern Kaduna as sad.\nSome bandits had raided Agban Kagoro, Kaura Local Government Area of Kaduna State Sunday night, killed 15 people and burnt houses.\nHayab lamented that human beings were killed without adequate protection from the government, urging residents in the area to defend themselves against the bandits.\nHe also called on the state government to swallow its pride and seek genuine help to end the continued killings in the state.\nKaduna State citizens are tired of Government’s rhetorical responses without concrete action taken to protect lives and property."
  },
  {
    "headline": "Halt all trade with Russia, Zelensky urges Europe",
    "summarized_story": "Ukrainian President, Volodymyr Zelensky, called on European leaders on Monday to cease all trade with Russia in an effort to pressure Moscow to halt its nearly month-long military assault on his country.\nPush for Russia to leave Ukraine,” Zelensky said in a video address.\nHowever, Germany had opposed an outright halt on Russian energy imports.\nEarlier on Monday, Russia had cautioned against a European oil embargo, saying the move could “hit everyone”.\nThe United States this month announced a ban on Russian oil and gas, while Britain has said it will cut out Russian oil imports by the end of this year."
  },
  {
    "headline": "Nigeria loses 112 people to Lassa fever in 3 months — NCDC",
    "summarized_story": "By Sola OgundipeA TOTAL of 112 persons have died of Lassa fever in Nigeria since the beginning of 2022 out of 3,079 cases recorded nationwide, the Nigeria Centre for Disease Control, NCDC, revealed over the weekend.\nThe NCDC in a report disclsoed that out of the figure, 45 health workers were infected by Lassa fever between January and March.\nAccording to medical experts, Lassa fever is transmitted when the saliva, urine, and excreta of multi-mammalian rats come into contact with humans.\nIn some cases, Lassa fever has similar symptoms to malaria, appearing between one and three weeks after exposure to the virus.\nThe Agency explained that the animal vector for the Lassa virus, the multimammate rat, is found throughout the west African region, thereby calling on neighboring countries to stay alert on the spread of the Lassa fever."
  },
  {
    "headline": "BREAKING: Why ex-Gov Obiano is still in custody— EFCC Chairman, Bawa",
    "summarized_story": "By Ikechukwu Nnochiri, ABUJAThe Chairman of the Economic and Financial Crimes Commission, Abdulrasheed Bawa, on Monday, explained why the former Governor of Anambra State, Willie Obiano, is still in detention.\nIt will be recalled that Obiano was arrested at the Murtala Mohammed International Airport, Lagos, last Thursday, few hours after he handed over to his successor, Governor Chukwuma Soludo.\nThe former governor, who had been on EFCC’s watchlist, was among other things, accused of misappropriating public funds totalling about N42billion.\n“The EFCC has further developed a five-year Strategic Plan that guides its operational approach in law enforcement action”.\nThe NACIWA Assembly was co-hosted by both the EFCC and the Independent Corrupt Practices and other related offences Commission, ICPC."
  },
  {
    "headline": "2023: We must fix insecurity challenge, if Nigeria must progress —Presidential aspirant, Felix",
    "summarized_story": "By Olasunkanmi AkoniA presidential aspirant in the 2023 general polls and General Overseer, Miracle Centre International, Dr. Nicholas Felix, has said for Nigeria to move forward and witness positive developments, issues of security, power and unstable economy must be given priority.\nFelix, who is also an entrepreneur, made the remarks in Ikeja, Lagos, weekend while addressing newsmen on the state of the nation and declaration of interest to contest the presidential election in 2023.\nMy number one agenda if elected as President of Nigeria, is to protect the life and property of the people.\nUntil Nigeria is saved from the insecurity challenge, we will not have economical growth.\nWe all have the duty to make Nigeria great again.”"
  },
  {
    "headline": "Abia guber: Ohuhu traditional rulers make case for Abia",
    "summarized_story": "\\Central section in Ukwa/Ngwa Traditional rulers in Ohuhu, Umuahia North Local Government Area of Abia State LGA have called on Governor Okezie Ikpeazu to ensure his successor comes from Abia Central section of Ukwa/Ngwa block.\nChairman, Ohuhu Council of Traditional Rulers, Eze Nnamdi Ofoegbu, made the call when he led a delegation of Ohuhu Council of Traditional Rulers to the governor on a solidarity visit at Government House, Umuahia.\nHe commended Governor Ikpeazu for his quality leadership in the state and assured him of their continuos support and prayers.\nGovernor Ikpeazu distanced himself from those who preach ethnic divide, stressing that nobody can ride on ethnicity to become Governor.\n“He disclosed that his prayer is that God gives the state a good leader in 2023, who would continue to unite Abia."
  },
  {
    "headline": "Inauguration Day Slap: Bianca’s attack shocked me — Ebele Obiano",
    "summarized_story": "According to a statement signed by her media aide, Chidiebele Obika, “Mrs Obiano has expressed shock over the attitude of Amb.\nMrs. Obiano stated that she didn’t bother to slap her back, but rather walked away in utter bewilderment”, the statement concluded.\nIn what people around initially took as a joke, Mrs. Obiano said to Bianca: “What are you doing here?\nSecurity men and other people at the high table rushed and separated them and dragged Mrs. Obiano to where her husband, Willie Obiano was seating calmly.\nAlthough Governor Soludo expressed worry over the incident, he did not show it."
  },
  {
    "headline": "War: You’re compulsive liar, can’t separate fact from fiction – Javid slams Putin",
    "summarized_story": "UK Health Secretary, Sajid Javid, has slammed Russian President, Vladimir Putin, branding him a “compulsive liar” amid the ongoing war between Russia and Ukraine.\nJavid said that Putin is having difficulty separating fiction from fact, adding that the West should find some way to constrain the Russian leader at this point amid Russia’s continued invasion of Ukraine.\n“I fear that without finding some way to constrain Russia and Putin at this point, things are going to get a lot uglier.\n“The Russians don’t seem that they can be trusted, and especially President Putin, who we know is a compulsive liar.\nRecall that the war between Ukraine and Russia began in February."
  },
  {
    "headline": "Russia claims troops are making progress in Ukraine",
    "summarized_story": "The Russian army has advanced a further 12 kilometres into Eastern Ukraine and reached the border of the settlement of Nikolske near Mariupol, says Russian Ministry of Defence spokesman, Igor Konashenkov.\nIn a post on Facebook, the Ukrainian general staff said that Russia is mobilising troops in the areas of Luhansk and Donetsk.\nThe self-proclaimed independent republics of Luhansk and Donetsk in Eastern Ukraine have enjoyed the support of Russia since 2014.\nPrior to the Russian invasion on Feb. 24, the republics only covered a portion of the territory of the oblasts or administrative divisions, of Luhansk and Donetsk.\nThe Russian Ministry of Defence also said the Russian army has now destroyed 214 drones, 1,438 tanks and armoured vehicles, 150 rocket launchers, 584 artillery guns and 1,279 vehicles of the Ukrainian army since the start of the invasion."
  },
  {
    "headline": "Petrol will cost N300 per litre, Diesel N1,000, Nigerians’ll stone govs soon – Primate Ayodele",
    "summarized_story": "The leader of INRI Evangelical Spiritual Church, Primate Elijah Ayodele, on Monday, revealed that Nigerians would soon buy diesel for N1000 per litre and petrol for N300 per litre.\nHe noted that the Nigerian government would find it difficult to pay workers due to lack of funds.\nIn a statement by his media aide, Oluwatosin Osho, Ayodele revealed that Nigerians would stone state governors and lawmakers due to the hardship.\nPetrol will become scarce and, at the end of the day, it will move up to N300 per litre.\n“The government must involve God if at all they want changes and they should create an intelligent economic team to redirect the economy."
  },
  {
    "headline": "Kaduna declares 24-hour curfew in Jema’a, Kaura",
    "summarized_story": "The Kaduna State Government has declared a 24-hour curfew in Jema’a and Kaura local government areas with immediate effect following advice from security agencies after an attack on Agban Kagoro and environs by suspected Fulani militias leading to loss of lives and properties.\nA statement from Samuel Aruwan, Commissioner, Kaduna State Ministry of Internal Security and Home Affairs, explained, “Following advice from security agencies, the Kaduna State Government has declared a 24-hour curfew in Jema’a and Kaura local government areas with immediate effect.\nThis is to assist the security agencies to stabilize the situation in the areas, save lives and property and enable the restoration of law and order.”A statement further explained that the security agencies have full authority to enforce the curfew.\nThe government appealed to all residents of Jema’a and Kaura local government areas to cooperate with the security agencies in the urgent task of restoring peace and upholding law and order.\nThe government, however, according to the statement, condemned the violence and all acts of lawlessness that have occurred in the area."
  },
  {
    "headline": "Why Obiano is still in our custody – EFCC Chairman, Abdulrasheed Bawa",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has said that former Anambra State Governor, Willie Obiano’s arrest was not political, adding that he has been granted bail.\nRecall that Obiano is being quizzed over the alleged misappropriation of N42 billion belonging to the state.\nSpeaking on Monday, EFCC Chairman, Abdulrasheed Bawa, who spoke at the 5th Annual General Assembly of the Network of National Anti-corruption Institutions in West Africa (NACIWA) said Obiano had been granted an administrative bail but he is yet to meet the conditions.\n“Nothing political about the arrest of the former Anambra State Governor, Wille Obiano.\nHe has been granted bail."
  },
  {
    "headline": "El-Rufai declares curfew in two councils as bandits kill 15",
    "summarized_story": "Kaduna Governor Mallam Nasir El-Rufai has declared a 24-hour curfew in Jema’a and Kaura local government areas.\nA source from Kaura reported the gunmen on Sunday night attacked Agban Kagoro, Kaura local government area of Kaduna state and killed about 15 people.\nAccording to him: “Following advice from security agencies, the Kaduna State Government has declared a 24-hour curfew in Jema’a and Kaura local government areas with immediate effect.\n“This is to assist the security agencies to stabilise the situation in the areas, save lives and property and enable the restoration of law and order.\n“The security agencies have full authorization to enforce the curfew."
  },
  {
    "headline": "BREAKING: Sacked Ganduje’s Media Adviser quits APC",
    "summarized_story": "Special Adviser on Media Matters to Governor Abdullahi Umar Ganduje of Kano State, Salihu Tanko Yakasai, who was sacked for criticising President Muhammadu Buhari administration, on Monday announced his exit from the ruling All Progressive Congress (APC).\nYakasai was suspended from office in October 2020 and sacked in February 2021, following his utterances against the government in power which he was part of.\n“I have been a bonafide member of the All Progressive Congress (APC) party of Nigeria right from its inception almost a decade ago.\nIt will be hypocritical of me today to keep quiet when our own APC government and party have underperformed.\nConsequently, l was suspended and sacked from office.”Yakasai said he remains grateful to Governor Ganduje for giving him a platform to serve for over five years."
  },
  {
    "headline": "Buhari inaugurates new Lagos airport terminal Tuesday",
    "summarized_story": "President Muhammadu Buhari will on Tuesday, March 22, 2022, inaugurate the newly built international terminal of the Murtala Muhammed Airport, Lagos.\nAccording to her, the brand new, world-class international terminal is among five airport terminals covered in the bilateral arrangement between the Federal Government and the People’s Republic of China.\nThe new Lagos International terminal, she said has the capacity to process 14million passengers per annum.\n“It is built on a landmass of approximately 56,000 square metres, and it has 66 check-in counters.\n“The new terminal is expected to generate about three thousand direct and indirect employment for Nigerians, as well as enhance passenger facilitation and comfort at the Lagos airport,” she said."
  },
  {
    "headline": "APC convention: Southwest picks Kekemeke, Omisore",
    "summarized_story": "Six days to the All Progressives Congress (APC) convention, there is no consensus yet on who will be the national chairman.\nThe region has nominated Mr. Isaac Kekemeke (Ondo State) as its candidate for National Vice Chairman (Southwest) and Senator Iyiola Omisore (Osun) as National Secretary.\nOndo State Governor Oluwarotimi Akeredolu, who is the coordinator of the Southwest Governors Forum, announced the nominations yesterday.\n“For emphasis, what we are going for is national vice chairman with Kekemeke as our candidate and not the national secretary.\nWhat the governors ceded to Ondo State were the National Vice Chairman (Southwest) and Zonal Youth Leader."
  },
  {
    "headline": "NUGA Games: Sanwo-Olu pledges more support for sport dev’t",
    "summarized_story": "Lagos State Governor Babajide Sanwo-Olu has pledged his administration’s steady contribution to the development of sporting facilities in the state.\nSanwo-Olu who was represented by Lagos State Sports Commission chairman Sola Aiyepeku as the special guest of honour during Saturday’s opening ceremony of the 2022 Nigerian University Games Association (NUGA) championships being hosted by the University of Lagos (UNILAG), said as much, even as he reiterated his commitment to uplift the youths so that they can express themselves in all fields of human endeavours.\nIncidentally, both the Lagos Governor and Aiyepeku are both alumnus of UNILAG.\n“ As a great Akokite, His Excellency Governor Babajide Sanwo-Olu is proud and honoured to support the Nigeria University Games Association(NUGA) and this is why Lagos State contributed significantly to improving UNILAG Sports facilities for the games ,” noted Aiyepeku.\n“ Governor Sanwo-Olu is always interested in sports platforms that give youths opportunities to express themselves and we believe this games will offers the students so much fun and we want to wish all of them success,” he added."
  },
  {
    "headline": "PDP: Northern aspirants ready for consensus candidate –Saraki",
    "summarized_story": "Former Senate president, Bukola Saraki, has said all Peoples Democratic Party (PDP) presidential aspirants from the North were ready for a consensus candidate during the party’s primary without acrimony.\nHe gave the assurance when he and Governor Aminu Tambuwal of Sokoto State, also a PDP presidential aspirants, paid a consultative visit to Governor Bala Mohammed of Bauchi State, yesterday.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\n“We appreciate that the three of us have shown aspiration to lead this country, but we also come to realise that we are all capable, competent and fit to lead this country.\nThe former governor of Kwara, however, urged all the PDP supporters to remain focussed and united in order to uplift the party to a greater heights."
  },
  {
    "headline": "Expect agitation worse than EndSARS if… -PDP warns",
    "summarized_story": "From Ndubuisi Orji, AbujaPeoples Democratic Party (PDP), yesterday, warned that Nigeria’s situation is getting to a boiling point and could trigger a nationwide agitation that might be worse than the October 2020 EndSARS if not addressed immediately.\nThis is as it berated President Muhammadu Buhari for allegedly failing to take action over the lingering fuel crisis in the country.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\n“Our party fears that the situation is getting to a boiling point and can trigger a nationwide agitation that might be worse than the October 2020 EndSARS if not addressed immediately.\nPresident Buhari must take responsibility."
  },
  {
    "headline": "My fears for 2023 general elections –Darius Ishaku – The Sun Nigeria",
    "summarized_story": "The thing is that the managers of the system are not telling us the truth about this fuel subsidy.\nThey did that promising us that it would be the end of fuel subsidy and fuel scarcity and yet we have not seen any of that.\nRather, we still have huge budgetary allocation for fuel subsidy and we are suffering unspeakable pains from fuel scarcity.\nThe federal Ministry of Education in particular, I don’t think they have the right attitude towards the management of the crisis.\nAt the National level, what is your take on the security situation ahead of the activities leading up to next year’s elections?"
  },
  {
    "headline": "Matawalle begs Nigerians to assist 700,000 IDPs in Zamfara – The Sun Nigeria",
    "summarized_story": "From Noah Ebije, KadunaZamfara State Governor, Bello Mohammed Matawalle, has called on individual, nongovernmental organisations to assist the over 700,000 persons dislodged from their homes by bandits.\n“I hold the belief that lots of you sympathize with the people of Zamfara considering the bad stories bordering on cruel acts perpetrated by some unpatriotic, inhumane Nigerians against their brothers and sisters.\nKilling, maiming, kidnapping and demand for ransom, rape, cattle rustling and other cruel acts then, remain the order of the day in Zamfara State,” he said.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe ministry has been up and doing to assist victims of both man made and natural disasters in the state."
  },
  {
    "headline": "Convention: Apprehension as APC fails to start screening of aspirants – The Sun Nigeria",
    "summarized_story": "From Romanus Ugwu, AbujaThere is fresh anxiety in the All Progressives Congress (APC) following failure to screen aspirants for the zonal and national leadership positions few day to the March 26 proposed national convention.\nWhile zonal aspirants were to be screened on Saturday, candidates to occupy the position of the National Working Committee (NWC) would have appeared before the screening Committee yesterday.\n“The committee members are more than four.\nThe committee members will now be sub-divided into six zones to handle each zone.\nI doubt if there will be anything like unity list.”The party has raked in N140 million from seven aspirants jostling for the national chairmanship."
  },
  {
    "headline": "Court Dismisses Another Suit Seeking Sack of Buni-led CECPC",
    "summarized_story": "He said if the question was answered in the negative, whether their appointment was not a gross violation of the constitution.\nAmong the declarations Bolarinwa sought from the court was that Buni and the other serving governors’ presence in CECPC was illegal and unconstitutional with regard to Sections 183 and 223 of the constitution.\nThe court explained that all the allegations were denied by the defendants, thereby putting the claimant to the strictest proof of the same.\nThe entire suit having regards to the facts and circumstances of the same, constitute an abuse of judicial process and liable to be dismissed.\n“I shall dismiss the said suit by consigning the same to a forlorn of judicial debris."
  },
  {
    "headline": "Bonds Account for 73% of FG’s N19.24trn Domestic Debt, Says DMO",
    "summarized_story": "The 36 states and the FCT owed a total of N6.428 trillion of the total debt stock during the review period.\nAs at December 31, 2021, Lagos State retained its status as the most indebted state with total domestic debt stock of N658 billion.\nRivers State was next with N225.5 billion, followed by Ogun State, N232 billion; Akwa Ibom State, N214.6 billion; and Imo State, N205 billion.\nThe total external debt of states and the FCT amounted to $4.75 billion or 12 per cent of the total external debt of $38.3 billion.\nThe federal government accounts for the biggest chunk of the external debt of $33.62 billion out of the $95.77 billion (N39.566 trillion) total public debt stock just released by the DMO."
  },
  {
    "headline": "Tambuwal, Adamu, Saraki Meet, Mull Consensus Northern Candidate",
    "summarized_story": "Bala Muhammad of Bauchi state on Sunday hosted his Sokoto state counterpart, Aminu Waziri Tambuwal, and former Senate President, Bukola Saraki, to a consensus building initiative among aspirants of Northern extraction for the position of President under the aegis of the People’s Democratic Party (PDP).\nThe trio, all seeking the nomination of the PDP to run for the seat of Nigeria’s President, met for about two and half hours in Government House, Bauchi.\n“These are more important than our individual ambitions, thus the need for us to work together,” he emphasized.\nThe PDP is ready because what is important is Nigeria.\nThe Deputy Governor of Bauchi state, Engr Baba Tela, was also present at the press briefing."
  },
  {
    "headline": "Ahead of National Convention, APC Begins Screening of Aspirants Today",
    "summarized_story": "APC 2022 National Convention Screening Committee headed by the Kastina State Governor, Hon.\nThe 69-year-old businessman-turned-politician is also keen on becoming the next APC chairman.\nHe is believed to have been anointed as the consensus national chairman but the other contestants have refused to accept his nomination.\nAdebayo ShittuA former Minister for Communication, Alhaji Adebayo Shittu is the first person to indicate interest in the office of APC National Secretary.\nIfe OyedeleExecutive Director, Niger Delta Power Holding Company (NDPHC), Mr. Ife Oyedele, is another aspirant for the office of APC National Secretary."
  },
  {
    "headline": "CSO Accuses Desperate Politicians of $1 Million Smear Campaign Plot against Buhari, Emefiele",
    "summarized_story": "Others include the Yoruba Council of Youths, Igbo Youth Movement, Middle Belt Youth Movement, South East Youth Assembly and Lawyers in Defence of Democracy.\nSNP Convener, Mr Peter Abang, said they alerted the public to disregard the smear campaigns once they kicked off.\nHe concluded that Emefiele had contained and dealt with a 60 per cent decline in the price of crude oil.\n“The good people of Nasarawa State benefited so much from the good stewardship of the current CBN Governor.\nNasarawa is the home of solid minerals; Mr Emefiele’s policies of diversification invested so much in solid mineral resources and agriculture."
  },
  {
    "headline": "BREAKING: Plane Carrying 133 Crashes In China, Causes Mountain Fire",
    "summarized_story": "A China Eastern passenger jet carrying 133 people has crashed in southwest China and caused a mountain fire with casualties unknown, state broadcaster CCTV reported Monday.\nThe Boeing 737 plane crashed in the rural countryside near Wuzhou city, Guangxi region and \"caused a mountain fire,\" CCTV said, citing the provincial emergency management bureau.\nCCTV said a \"China Eastern Airlines Boeing 737 plane carrying 133 people has crashed in Teng county, Wuzhou, Guangxi, and caused a mountain fire.\"\nThe China Eastern flight from Kunming to Guangzhou departed at 1.11 pm local time (0511 GMT), FlightRadar24 data showed.\nThe safety record of China's airline industry has been among the best in the world over the past decade."
  },
  {
    "headline": "BREAKING: Plane Carrying 133 Crashes In China, Causes Mountain Fire",
    "summarized_story": "A China Eastern passenger jet carrying 133 people has crashed in southwest China and caused a mountain fire with casualties unknown, state broadcaster CCTV reported Monday.\nThe Boeing 737 plane crashed in the rural countryside near Wuzhou city, Guangxi region and \"caused a mountain fire,\" CCTV said, citing the provincial emergency management bureau.\nCCTV said a \"China Eastern Airlines Boeing 737 plane carrying 133 people has crashed in Teng county, Wuzhou, Guangxi, and caused a mountain fire.\"\nThe China Eastern flight from Kunming to Guangzhou departed at 1.11 pm local time (0511 GMT), FlightRadar24 data showed.\nThe safety record of China's airline industry has been among the best in the world over the past decade."
  },
  {
    "headline": "EXCLUSIVE: How Attorney-General Malami, Amaechi, Emefiele Procured Court Order Deleting Section 84(12) Of Electoral Act, To Safeguard Their Political Ambitions",
    "summarized_story": "SaharaReporters earlier today reported that the court sitting in Umuahia, Abia State, ordered the Office of the Attorney-General of the Federation to immediately delete Section 84 (12) of the Amended New Electoral Act.\nHowever, top sources revealed to SaharaReporters on Friday night that Malami was the brains behind the court order obtained from Abia State.\n“The judgment of the Court will be recognized by the Government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\n“The provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be so treated accordingly."
  },
  {
    "headline": "EXCLUSIVE: How Attorney-General Malami, Amaechi, Emefiele Procured Court Order Deleting Section 84(12) Of Electoral Act, To Safeguard Their Political Ambitions",
    "summarized_story": "SaharaReporters earlier today reported that the court sitting in Umuahia, Abia State, ordered the Office of the Attorney-General of the Federation to immediately delete Section 84 (12) of the Amended New Electoral Act.\nHowever, top sources revealed to SaharaReporters on Friday night that Malami was the brains behind the court order obtained from Abia State.\n“The judgment of the Court will be recognized by the Government printers in printing the Electoral Act.\nThe Act will be gazetted factoring the effect of the judgment into consideration and deleting the constitutionally offensive provision accordingly.\n“The provision of Section 84(12) of the Electoral Act 2022 is not part of our law and will be so treated accordingly."
  },
  {
    "headline": "Dirty Slap: Former Anambra First Lady, Ebele Obiano, Gives Her Account Of Disgraceful Incident",
    "summarized_story": "Ebelechukwu, wife of Willie Obiano, immediate past governor of Anambra has narrated her side of the story regarding her fight with Bianca Ojukwu, a former ambassador and widow of Chukwuemeka Ojukwu.\nOn Thursday, during the inauguration of Charles Soludo as Anambra governor, Ebelechukwu and Bianca fought after a heated exchange.\nAnambra State Governor Willie Obiano’s wife, Ebelechukwu ObianoDuring the heated conversation between the duo, Bianca slapped Obiano’s wife, an incident that caused a commotion at the event.\nShe stated that she didn't bother returning the slap, instead, she walked away in utter bewilderment.\n“As she made towards me, I den pulled away her wig, she then held on to her wig with her two hands and tried to take the wig away from me."
  },
  {
    "headline": "Tanko-Yakasai, Ganduje's aide who was sacked for criticising Buhari, leaves APC",
    "summarized_story": "Salihu Tanko-Yakasai, former spokesman to Abdullahi Ganduje, governor of Kano, has left the All Progressives Congress (APC).\nTanko-Yakasai was sacked by Ganduje in February 2021, for making “continued unguarded comments” and criticising President Muhammadu Buhari.\nAdvertisementAnnouncing his departure from the APC on Monday, Tanko-Yakasai said the party has failed to fulfil its promises to Nigerians.\nIf anything, things became worse in the second term.\nThe benefit of the doubt we gave the party in the first term vanished as we moved deeper into the second term."
  },
  {
    "headline": "Tanko-Yakasai, Ganduje's aide who was sacked for criticising Buhari, leaves APC",
    "summarized_story": "Salihu Tanko-Yakasai, former spokesman to Abdullahi Ganduje, governor of Kano, has left the All Progressives Congress (APC).\nTanko-Yakasai was sacked by Ganduje in February 2021, for making “continued unguarded comments” and criticising President Muhammadu Buhari.\nAdvertisementAnnouncing his departure from the APC on Monday, Tanko-Yakasai said the party has failed to fulfil its promises to Nigerians.\nIf anything, things became worse in the second term.\nThe benefit of the doubt we gave the party in the first term vanished as we moved deeper into the second term."
  },
  {
    "headline": "Austin Avuru: 80% of Nigeria’s oil production lost to theft",
    "summarized_story": "Austin Avuru, former chief executive officer of Seplat Energy Plc, says 80 percent of Nigeria’s oil production is lost to oil theft.\nThis is coming amid an assertion by Tony Elumelu, chairman of the United Bank for Africa (UBA) Plc that Nigeria is “losing over 95 percent of oil production to thieves”.\nAvuru, in a report, titled “Reining in the Collapse of the Nigerian Oil Industry” published by the Africa Oil+Gas Report, called for a state of emergency in the Nigerian oil and gas sector.\nOil production is down to about 1.4Million barrels per day and declining and this includes about 600,000BOPD from the deepwater.\nIn February, Nigeria’s oil production had dropped to an average of 1.25 million barrels per day (bpd) from 1.39 million the previous month."
  },
  {
    "headline": "Austin Avuru: 80% of Nigeria’s oil production lost to theft",
    "summarized_story": "Austin Avuru, former chief executive officer of Seplat Energy Plc, says 80 percent of Nigeria’s oil production is lost to oil theft.\nThis is coming amid an assertion by Tony Elumelu, chairman of the United Bank for Africa (UBA) Plc that Nigeria is “losing over 95 percent of oil production to thieves”.\nAvuru, in a report, titled “Reining in the Collapse of the Nigerian Oil Industry” published by the Africa Oil+Gas Report, called for a state of emergency in the Nigerian oil and gas sector.\nOil production is down to about 1.4Million barrels per day and declining and this includes about 600,000BOPD from the deepwater.\nIn February, Nigeria’s oil production had dropped to an average of 1.25 million barrels per day (bpd) from 1.39 million the previous month."
  },
  {
    "headline": "ALERT: FAAN asks travellers to be at Lagos airport early as Buhari inaugurates new terminal Tuesday",
    "summarized_story": "The Federal Airports Authority of Nigeria (FAAN) has asked travellers who are scheduled to board flights at Murtala Muhammed International Airport (MMIA), Lagos, on Tuesday, to arrive at the airport earlier than usual.\nIn a travel advisory, FAAN, on Monday, said the newly-built international terminal at the Lagos airport will be inaugurated on Tuesday.\nAdvertisement“Consequently, all travellers and Airport users are advised to get to the airport earlier than usual, due to heightened security and logistics arrangements on ground.\nThe authority apologises for any inconvenience this might cause.”On Tuesday, President Muhammadu Buhari is expected to inaugurate the new terminal at the Lagos airport.\nAdvertisementIn August 2021, the federal government said four major airports, including the Lagos airport, were not designed as international facilities."
  },
  {
    "headline": "Google’s Africa internet cable to first arrive in Togo",
    "summarized_story": "Google has announced that Equiano, a subsea internet cable running through Portugal to South Africa, will first land in Togo.\nThis announcement marks a milestone in Google’s plan to provide affordable internet access in Africa by building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nLast October, Google CEO Sundar Pichai announced a plan to invest $1billion over 5 years to support digital transformation in Africa, of which project Equiano is part of.\nNitin Gajria, Managing Director of Google Sub-Saharan Africa commented, “The landing of Equiano affirms Google’s commitment to the African continent, to support Africa’s digital transformation.\nThe shutdown of Google’s Project Loon brought up questions about the fate of Google’s other internet projects targeted at Africa."
  },
  {
    "headline": "Digital Nomads: The Nigerians escaping Ukraine’s war",
    "summarized_story": "Students, all of whom are given temporary residence permits, can work unofficially or do small businesses by registering as private entrepreneurs.\n“I finished last year, and I was going to leave Ukraine this year.\nYou can’t get out that easily.”A day after Russia’s invasion, Ukraine’s president Volodymyr Zelenskyy instituted martial law and grounded commercial flights.\n“I was already applying for visas to leave Ukraine for the UK where my brother is.”Kemi’s journey is not so certain.\nIf you think your story fits the Digital Nomads bill, reach out to us here."
  },
  {
    "headline": "Big Cabal Media raises $2.3m to expand its compelling line of digital products",
    "summarized_story": "In 2021, venture capital invested $115 million in digital media globally, a tenth of the $1.1billion it funded in 2015, but not much came to Africa.\nToday, one of such exceptions, Big Cabal Media (BCM), a leading African digital media company, has announced a $2.3 million Seed funding round, emphasising its commitment to keep building exciting and authoritative media products and brands.\nBCM’s progress over the years and recent fundraise is a noteworthy example of the possibilities and opportunities in Africa’s digital media sector.\nOf the reported $4.3–$5 billion raised by African startups in 2021 whereby fintech received 53–63% of the volume, digital media companies are one of many sectors that have traditionally been overlooked in the conversation of tangible ventures.\n“Investing in Africa’s booming digital media sector aligns perfectly with MaC’s mission of supporting exceptional entrepreneurs building valuable technology companies that leverage shifts in cultural trends and behaviours."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "Nerves and laughter as Techpoint Pitch Friday returns",
    "summarized_story": "Share this article:On Friday, March 11, 2022, we hosted the first Techpoint Pitch Friday of 2022.\nHarmony plans to play in the increasingly competitive buy now, pay later industry.\nHis startup, Siara, plans to provide emergency response and security services for Nigerians using a community model.\nFeedback and networkingProviding feedback to entrepreneurs is an integral part of Pitch Friday.\nApril’s edition of Pitch Friday will be held on Friday, April 8, 2022, and you can register to pitch your startup or join the audience."
  },
  {
    "headline": "Faster Internet? Maybe.",
    "summarized_story": "Well, Google’s subsea Internet cable — Equiano — has landed in Togo.\nTechnically, this should automatically mean faster Internet, right?\nIt’s one thing for an Internet subsea cable to land on your shores, and it’s another for it to get to where it’s needed.\nHere’s where the analogy comes back: Think of this as that bowl (Africa) overflowing with water (subsea Internet cables).\nElsewhere, MTN’s bid to secure spectrum in South Africa has been successful."
  },
  {
    "headline": "Big Cabal Media’s seed funding",
    "summarized_story": "This means that sharing your Netflix password with someone else may soon become expensive, as account sharing will incur an additional fee.\nToday, I’ll be discussing:Dream VC’s pipeline planBig Cabal Media’s seed fundingDream VC’s pipeline planNowadays, it appears that many people want to work in technology companies.\nHowever, only a small percentage are familiar with the Venture Capital (VC) industry.\nInterestingly, venture capital funding only became common in the last decade, leaving a considerable talent gap, which Dream VC was founded to fill.\nBig Cabal Media’s seed fundingIf you are on Twitter, you might likely have read content from Zikoko, TechCabal, or both."
  },
  {
    "headline": "Edo urges stakeholders’ support to tackle Lassa fever, as cases rise to 160 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has called for the support of residents and other stakeholders in addressing the scourge of Lassa fever in the state.\n“The disease is a pandemic that is still ravaging some communities across local government areas in Edo State.\nThe Commissioner further restated that the state will flag off its farming season on Thursday, March 25, 2022.\nHe said, “The State Government will be flagging off the farming season on Thursday, 25th of March 2022.\nThis year’s farming season should be taken seriously as there will be an interface between farmers and off-takers."
  },
  {
    "headline": "Building plans: Edo residents laud Obaseki on recertification exercise – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has received the commendation of residents of Ugbor and Amagba in Oredo Local Government Area of the state for the building plan recertification exercise being embarked on by his administration.\nAs part of the recertification exercise, property owners and developers within the Benin metropolis are expected to provide their building plans to the staff of the Ministry of Physical Planning, Urban and Regional Development upon demand at their houses and sites for assessment, clearance and recertification.\nSpeaking to journalists at the weekend, a resident of Amagba, Mr. Kingsley Osayande, commended the state government for the initiative, noting that the exercise will ensure order in the built environment.\nOn his part, Mr. Emmanuel Ogbebor, who described the ‘operation show your building plan exercise’ as a welcome development, urged other residents to support the efforts of the state government to ensure the success of the exercise.\nOgbebor noted that the initiative will help enhance data collection of buildings in the state and help the government know areas that need urgent attention in terms of development."
  },
  {
    "headline": "Edo offers property developers 2-week window for issuance of free building plans …begins farming season March 25 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government, as part of efforts at ensuring all property in the state are with building plans, is offering property developers a 2-week window for issuance of free building plan permits.\nShe noted, “The ‘Operation show you building plan’ seeks to encourage all land developers and those building to come for their building plan in the ministry.\nThe objective of the exercise is to capture all into the Edo State Master Plan as it’s necessary for development.\nThis year’s farming season should be taken seriously as there will be an interface between farmers and off-takers.\n“The disease is a pandemic that is still ravaging some communities across local government areas in Edo State."
  },
  {
    "headline": "AAU VC Lauds Outgoing Registrar – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestTHE acting Vice Chancellor of the Ambrose Alli University, (AAU), Ekpoma, Edo State, Prof. Sonnie Adagbonyin has showered encomiums on the outgoing acting Registrar of AAU, Mr. Edward Aihevba for his outstanding achievements in office.\nHe gave the commendation while speaking at the Second Registry Lecture of the institution, titled: Administrative Imperatives for Universities: A case Study of Ambrose Alli University; delivered by the outgoing acting Registrar, Mr. Edward Aihevba.\nThe acting vice chancellor asserted that the outgoing Registrar in his short time in office recorded numerous achievements which were of benefit to the staff, students and the university in general.\nPraised the registry department and outgoing Registrar for the registry lecture initiative, and called on other departments of the university to emulate the registry department by organising similar lectures for staff members.\nHe explained that the registry lecture was introduced in his time as acting Registrar because of his desire to broaden and sharpen the administrative skills of staff of the registry for optimum performance."
  },
  {
    "headline": "Just In: EFCC grants ex-Gov Willie Obiano bail",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has granted, Chief Willie Obiano, a former governor of Anambra State, bail.\nChairman of the commission, Abdulrasheed Bawa, disclosed this on Monday in an interview with journalists in Abuja on the sideline of 5th Annual General Assembly (AGA) of the Network of Anti-Corruption Institutions in West Africa (NACIMA).\nBawa, however, said the former governor had yet to perfect his bail conditions and as such, he is still in the custody of the commission.\nObiano, was nabbed on Thursday at about 8:30pm by the anti-graft agency at Murtala Muhammed International Airport, Lagos when he was reportedly on his way to the United States of America.\nHe was subsequently transferred to the headquarters of the commission, where he was quizzed for days over alleged mismanagement of N42bn and inflated contract"
  },
  {
    "headline": "Investors rage as Chinmark Group CEO fails to repay funds",
    "summarized_story": "Thousands of people who invested in Chinmark Group, an unapproved investment company, are currently counting their losses as the company’s founder, Marksman Ijiomah, has defaulted in repaying invested funds.\nThe angry investors lamented losing their hard-earned money to Chinmark while alleging that the group was fraudulent.\nThe investors were promised mouthwatering return on investment to commit their funds running into billions of naira in Chinmark said to be into real estate, logistics, hospitality, and food businesses.\nIn a statement on his verified Facebook page, Chinmark CEO (Ijiomah) confirmed that his group received funds from “4,966 partners”, noting that “500 partners” have been paid so far but he had yet to publish the names of those that had received payment.\nThough he did not reveal the total amount received from all the investors, a receipt of a refund to an investor he posted on Facebook read N1.3m."
  },
  {
    "headline": "Obiano’s wife laments Bianca Ojukwu’s slap, says it was shocking",
    "summarized_story": "Mrs. Ebele Obiano, wife the immediate past governor of Anambra State, Chief Willie Obiano, has reacted to the fight incident between her and Bianca Ojukwu, wife of the late Emeka Ojukwu.\nRecall that Bianca had, during the inauguration of Charles Chukwuma Soludo as governor of Anambra State on Thursday, slapped Mrs. Obiano when she approached her where she was seated and allegedly abused her.\nResponding to the incident, Mrs. Obiano, in statement signed by her media aide, Chidiebele Obika, said the attack by Mrs. Ojukwu came to her as a shock.\n“Mrs Obiano has expressed shock over the attitude of Amb.\nMrs. Obiano stated that she didn’t bother to slap her back, but rather walked away in utter bewilderment”, the statement concluded."
  },
  {
    "headline": "Boeing 737 plane with 133 passengers crashes in China",
    "summarized_story": "A Boeing 737 passenger plane carrying 133 passengers has crashed in China, local media reported on Monday.\nThe plane belonging to China Eastern Airlines crashed in Teng County, Wuzhou of Guangxi province and caused a mountain fire.\nBack in 2018, a Lion Air Flight 610 operating Boeing 737 Max crashed, while another 737 Max crashed in 2019, operated by Ethiopian Airlines.\nAll Boeing 737 MAX passenger planes were grounded worldwide following the two incidents.\nHowever, the plane operated by China Eastern Airlines is a regular Boeing 737-89P and doesn’t belong to the Max family."
  },
  {
    "headline": "Audit Query: Reps’ C’ttee Summons 17 NNPC Subsidiaries",
    "summarized_story": "House of Representatives Committee on Public Accounts has summoned 17 subsidiaries of the defunct Nigerian National Petroleum Corporation (NNPC) now NNPC Limited to answer questions on the audit queries issued by the Office of the Auditor-General of the Federation over the operation of their finances between 2014 and 2019.\nADVERTISEMENTOthers areHyson (Nigeria) Limited, Nigeria Gas Company, National Engineering and Technical Company, National Petroleum Exchange, NNPC Pensions Limited, Warri Refining and Petrochemical Company, to appear on Thursday, March 24, 2022, while Port Harcourt Refining Company, NNPC Retail Limited, Integrated Data Service Limited, National Petroleum Investment & Management Services (NAPIMS) and Petroleum Product Pricing Regulatory Agency PPPRA) are to appear on Friday, March 25.\nThey are also to present to the House, evidence justifying non-cooperation in respect of constitutional checks conducted based on Section 85(4) of the Constitution of the Federal Republic of Nigeria.\nThe 17 companies had failed to appear before the committee on several occasions, even after threats of invoking the provisions of the constitution to issue a warrant of arrest.\nHowever, the management of the NNPC Limited had assured the committee that the companies would honour the invitation and asked that the letter of summons be channelled through the group managing director who would lead them on days allotted to them."
  },
  {
    "headline": "2023 Election Will Determine Future Of Nigeria – Obi",
    "summarized_story": "The Peoples Democratic Party (PDP) vice presidential candidate in 2019 and former governor of Anambra State, Peter Obi, has said the 2023 general elections would determine the future of Nigeria.\nAlso, former governor of Niger State, Dr Mu’azu Babangida Aliyu, said the 2023 elections will be the toughest one Nigeria has ever experienced since 1999 hence it would determine the country’s future.\nHe reiterated that the next election would determine the future of Nigeria even as he admonished the voters to elect competent and capable politicians who will deliver on their campaign promises.\nADVERTISEMENTObi said, “This next election will determine the future of Nigeria.\nADVERTISEMENTOn his part, Aliyu said, “The 2023 elections may be the toughest polls since 1999."
  },
  {
    "headline": "Goje, Gombe APC Trade Words Over Reconciliation Process",
    "summarized_story": "Senator Danjuma Gojë and the Gombe State chapter of the All Progressives Congress (APC) have disagreed over the non-conclusion of the reconciliation process initiated by the national leadership of the party.\nGovernor Inuwa Yahaya and Goje had taken to the trenches, which prompted the intervention of the APC National Reconciliation Committee led by Senator Abdullahi Adamu to reconcile the two leaders.\nAlmost three months after the reconciliation process was initiated, Goje has expressed concern that efforts to reconcile the warring camps in Gombe State APC had been jettisoned.\nHe said Gombe APC was happy after the Governor Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee (CECPC) of APC met with both Governor Yahaya and Senator Goje in Abuja and reconciled the two top Gombe politicians, both of whom were satisfied with the efforts.\nThe APC said it believed Manga, who is a personal assistant to Goje, had his principal’s nod to make the announcement."
  },
  {
    "headline": "Goje, Gombe APC Trade Words Over Reconciliation Process",
    "summarized_story": "Senator Danjuma Gojë and the Gombe State chapter of the All Progressives Congress (APC) have disagreed over the non-conclusion of the reconciliation process initiated by the national leadership of the party.\nGovernor Inuwa Yahaya and Goje had taken to the trenches, which prompted the intervention of the APC National Reconciliation Committee led by Senator Abdullahi Adamu to reconcile the two leaders.\nAlmost three months after the reconciliation process was initiated, Goje has expressed concern that efforts to reconcile the warring camps in Gombe State APC had been jettisoned.\nHe said Gombe APC was happy after the Governor Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee (CECPC) of APC met with both Governor Yahaya and Senator Goje in Abuja and reconciled the two top Gombe politicians, both of whom were satisfied with the efforts.\nThe APC said it believed Manga, who is a personal assistant to Goje, had his principal’s nod to make the announcement."
  },
  {
    "headline": "NAFDAC Vows To Secure Products From Counterfeits",
    "summarized_story": "National Agency for Food and Drug Administration and Control (NAFDAC) says it has the ability to secure products from counterfeiting.\nNAFDAC deputy director (Investigation and Enforcement, South-South and South East), Dr Christiana Esenwa, stated this at the agency’s zonal headquarters in Asaba, Delta State capital after securing a five-year conviction for an accused.\nEsenwa said the conviction was made possible with the collaboration of the Nigeria Police Force (NPF), who arrested the convict at the open market and handed him over to NAFDAC.\nHe hailed the conviction, noting the declaration would enhance the confidence of marketers in NAFDAC’s list.\nMeanwhile, the legal officer of the agency’s investigation and enforcement unit, Mr. Jumbo Washington, said the convict was found guilty of manufacturing of unwholesome food products under the Counterfeit Products and Miscellaneous Act."
  },
  {
    "headline": "BREAKING: Aircraft With 132 Onboard Crashes In China",
    "summarized_story": "A China Eastern Boeing 737 carrying 132 passengers was involved in an accident that resulted in a mountain fire in Guangxi Zhuang Autonomous Region in South China, according to CCTV on Monday afternoon.\nThe jet, MU 5735, took off at 13:15 from Kunming Changshui airport in Yunnan Province, Southwest China, and was due to arrive at 15:07 in Guangzhou, Guangdong Province, South China.\nAs of press time, China Eastern Airlines has not responded to requests for comment.\nThe plane in question is a Boeing 737 that belongs to China Eastern Airlines’ Yunnan affiliate and has been in service for just over six and a half years.\nChina Eastern Airlines’ stock dropped more than 10% in premarket trading in the United States."
  },
  {
    "headline": "Soludo: Ex-Gov Obiano’s Wife Opens Up On Slap From Bianca Ojukwu",
    "summarized_story": "Soludo: Ex-Gov Obiano’s Wife Opens Up On Slap From Bianca OjukwuMrs Ebelechukwu, the wife of Willie Obiano, the former governor of Anambra State, has spoken up about her feud with Bianca Ojukwu.\nBianca Ojukwu smacked Ebelechukwu during Charles Soludo’s inauguration as Governor of Anambra State last week.\nHowever, the former First Lady said that she had left her seat to greet Bianca, who had responded with a slap.\nAccording to her spokesman, Chidiebele Obika, the former governor’s wife approached the former beauty queen for their customary jovial banter only to be slapped and shoved by her.\nShe wondered what had caused “such much fury and hatred” in a former ambassador that she couldn’t “control herself in public.”Mrs. Obiano claimed that she didn’t bother returning the smack and instead walked away, perplexed."
  },
  {
    "headline": "Abducted APC Party Woman Leader Killed As Vigilantes, Kidnappers Exchange Gunfire",
    "summarized_story": "The woman leader of Koro ward of the All Progressives Congress (APC) in the Ekiti Local Government Area of Kwara State, Mrs Olomi Sunday, was killed during a rescue effort by local vigilantes, on Sunday.\nIt was gathered that three other men were also abducted from another bus on their way from Ekiti State.\n“The (N20m) ransom had been prepared but our vigilantes insisted that they wanted to go and rescue the victims.\nUnfortunately, we lost Mrs Olomi Sunday during the gun battle.\nAlso speaking, Ganiyu Gabriel Afolarin told our reporter, “Yes, we lost the woman leader of Eruku ward (Mrs Olomi Sunday) during an exchange of gunfire between the abductors and our local vigilantes."
  },
  {
    "headline": "APC Convention: South-West Governors reject Buhari’s men as secretary, vice-chair",
    "summarized_story": "According to Punch, a former Minister of Communications, Adebayo Shittu, who is running for the national secretary of the APC; and the Executive Director, Niger Delta Power Holding, Ife Oyedele, were being resisted by the APC governors in the South-West.\nIt is also believed that the unity list of the South-West governors was expected to be released in the coming days.\nThe statement by the Commissioner for Information and Orientation, Donald Ojogo, stated that all the governors of the South-West had endorsed Kekemeke.\nAmong these were the national vice-chairman, which was retained in Ondo, and the secretary, which was micro-zoned to the Oyo/Osun axis.\n“For emphasis, what we are going for is national vice-chairman with Kekemeke as our candidate, and not national secretary."
  },
  {
    "headline": "Breaking: El-Rufai declares 24-hour curfew in 2 Kaduna LGAs",
    "summarized_story": "Kaduna state government has declared 24 hours curfew in Jema’a and Kaura local government areas of the state to enable security agencies restore law and order as well as bring an end to the killings and reprisals taking place there.\nA terse statement signed by the state Commissioner for Internal Security and Home Affairs, Samuel Aruwan, on Monday urged residents to adhere to the curfew while giving security agencies full authority to enforce the curfew.\n“Following advice from security agencies, the Kaduna state government has declared a 24-hour curfew in Jema’a and Kaura local government areas with immediate effect.\n“This is to assist the security agencies to stabilize the situation in the areas, save lives and property and enable the restoration of law and order.\n“A statement from the Ministry of Internal Security and Home Affairs said that that security agencies have full authorization to enforce the curfew."
  },
  {
    "headline": "Breaking: Odion Ighalo, Troost-Ekong, 4 others first to hit Super Eagles’ camp ahead World Cup playoffs vs Ghana",
    "summarized_story": "Saudi Arabia-based striker Odion Ighalo on Monday arrived the camp of Super Eagles ahead of 2022 FIFA World Cup playoffs verses the black stars of Ghana.\nSuper Eagles assistant captain and Watford defender William Troost-Ekong, Leon Balogun, Semi Ajayi, Ola Aina and Frank Onyeka are those already in Abuja camp.\nDetails loading…"
  },
  {
    "headline": "VIDEO: Watch as Willie Obiano spends 4th night in EFCC custody",
    "summarized_story": "The Immediate past governor of Anambra state, Willie Obiano, has now spent four nights in the custody of the Economic Financial Crimes commission (EFCC) over alleged misapropriation of fund.\nObiano was earlier seen in a leaked video drinking water while in the custody.\nHe was arrested on Thursday.\nThis was just hours after Obiano handed over as governor of the South-East state."
  },
  {
    "headline": "Kaduna Govt Imposes Curfew On Two LGs As Bandits Kill Villagers, Raze Houses",
    "summarized_story": "The Kaduna State government has imposed a 24-hour curfew on Kaura and Jema’a Local Government Areas (LGAs) of the state.\nThis comes hours after bandits attacked Kagoro Chiefdom in Kaura LGA, killing at least 13 villagers while several properties were destroyed.\n“Following advice from security agencies, the Kaduna State government has declared a 24-hour curfew in Jema’a and Kaura local government areas with immediate effect,” he said.\nApart from the villagers killed, they were said to have ambushed and killed three soldiers who responded to a distress call and set ablaze scores of houses in Kagoro.\nHe also identified the three soldiers killed as operatives attached to Operation Safe Haven who came to repel the attack."
  },
  {
    "headline": "UPDATE: Plane Carrying 132 People Crashes In China",
    "summarized_story": "The plane was carrying 123 passengers and 9 flight crew members, the CAAC said.\nState broadcaster CCTV reported that the plane crashed in Teng county near Wuzhou and “caused a mountain fire”, citing the provincial emergency management bureau.\nA Henan Airlines flight crashed in northeastern Heilongjiang province in 2010, killing at least 42 out of 92 people on board although the final toll was never confirmed.\nThe deadliest Chinese commercial flight crash was a China Northwest Airlines crash in 1994 which killed all 160 onboard.\nMost of the passengers onboard the Malaysia Airlines Flight MH370, which disappeared in March 2014 en route from Kuala Lumpur to Beijing, were from China."
  },
  {
    "headline": "Bandits Kill Village Head, 19 Others In Zamfara",
    "summarized_story": "No fewer than twenty persons have been killed by bandits in Ganar-Kiyawa village of Adabka District, Bukkuyum Local Government Area of Zamfara StateThe latest attack happened on Sunday morning at about 8:30 am when the gunmen stormed the community and started shooting sporadically, killing 20 persons including the village head.\nHe said residents of Ganar Kiyawa have been sleeping in the bush for the fear of being attacked by the bandits in their homes.\nWhen asked about the response of security agencies, he said the military was only stationed at Adabka and Gwashi town, leaving other villages vulnerable to bandits’ attack“The security agencies are not enough to mount all the villages around.\nWe only have a military presence in two major places, Adabka town, and Gwashi.\nAll other villages around are left uncovered by the security agencies so these people (bandits) can just go out anytime they wish to and attack people,” he explained."
  },
  {
    "headline": "Report Officers Who Demand Tinted Glass Permits At Checkpoints, Police Tell Nigerians",
    "summarized_story": "Nigerians are to report police personnel who demand permits for tinted glasses at checkpoints in any part of the country, the Force Headquarters has said.\nApart from tinted glass permits, Adejobi stated that it would be out of bounds for any policeman to demand customs papers or other documents not relevant to their duties.\nHe explained that while there was no need to demand permits for tinted glasses, they could stop such cars only for the purpose of a search.\n“No policeman should demand your customs papers,” the force spokesman said in one of the tweets.\n“We are to stop any vehicle with tints, search the vehicle, and its occupants, but not to delay him for not having tinted glass permits."
  },
  {
    "headline": "Buhari To Commission Airport Terminal In Lagos On Tuesday",
    "summarized_story": "President Muhammadu Buhari will on Tuesday be commissioning the newly built international terminal of the Murtala Muhammed Airport, Lagos.\nThe terminal has the capacity to process 14million passengers per annum and was built on a landmass of approximately 56,000 square metres and has 66 check-in counters.\nA statement by the acting general manager, corporate affairs, Faithful Hope-Ivbaze, says that there will also be a signing of a memorandum of understanding with the Lagos State Government on the 9km Airport-Shasha-Alimosho link Road to be constructed by the State Government.\nThe terminal was built also in Abuja, Port Harcourt, Kano, and Enugu, in a bilateral arrangement between the Federal Government of Nigeria, and the People’s Republic of China.\nThe Acting GM further noted that the new terminal is expected to generate about three thousand direct and indirect employment for Nigerians, as well as enhance passenger facilitation and comfort at the Lagos airport."
  },
  {
    "headline": "Defection: Court strikes out Umahi's stay of execution application",
    "summarized_story": "The Federal high court in Abuja has struck out the application for stay of execution on the judgment that nullified the candidacy of Ebonyi state governor, Dave Umahi and his deputy Kelechi Igwe for defecting from the People’s democracy party to the All Progressive congressThe court held that the matter has already been instituted before the court of appeal and as such does not have any business in the federal High court."
  },
  {
    "headline": "Fmr Borno Gov Alimodu Sheriff withdraws from APC Chairmanship race",
    "summarized_story": "Former Governor of Borno state Alimodu Sheriff, and one of the APC’s national chairmanship aspirant has declared that he will no longer contest for the position based on the zoning arrangement of the party to the North-central.\nIn an interview with journalists in Abuja, today, Sunday, Alimodu Sheriff stated that if the party decides to hold the election between Sunday and Friday, he will contest.\nHe stated that his decision to withdraw from the contest was based on his respect for the rule of law and the decision of his party.\nThe former Governor, who hails from the Northeast zone, had indicated interest in the party’s apex seat Before the zoning decision issued around two weeks ago by the Mai Mala Buni-led Caretaker/Extraordinary Convention Planning Committee."
  },
  {
    "headline": "Gov.Tambuwal visits PDP stakeholders in Kaduna -",
    "summarized_story": "Sokoto State Governor and Presidential aspirant on the platform of the Peoples Democratic Party (PDP) Aminu Waziri Tambuwal on Saturday visited PDP stakeholders in Kaduna over his desire to become president in 2023.\nHe noted that his ambition is aimed at rescuing Nigeria from imminent collapse.\nHe faulted the All Progressive Congress (APC) for mismanaging the socioeconomic affairs of the nation and likened the relationship between President Muhammad Buhari and the Nations as that of a failed marriage.\nThe Sokoto Governor added that having worked in the Judiciary, legislative and Executive arms of Government, he possesses the necessary qualities to provide good governance if elected.\nGovernor Tambuwal called on his Party the PDP to be strategic and deliberate in coming up with a formula for winning elections in 2023."
  },
  {
    "headline": "2023: Youths storm Bauchi streets, say 'no going back on Yahaya Bello' -",
    "summarized_story": "Vehicular movement was temporarily held up for several hours in Bauchi on Saturday when thousands of youths stormed the major streets, rallying support for the presidential aspiration of Governor Yahaya Bello of Kogi State.\nGovernor Yahaya Bello stands out.\n“All the lies they have peddled against him in the past have turned to strength for him and for us Nigerian youths.\n“You have been consistent in your call for His Excellency, Alhaji Yahaya Bello to contest for President come 2023.\nHe has demonstrated in Kogi that it is Youths O Clock, and it is paying off with all the giant strides."
  },
  {
    "headline": "‘Bringing Back Toll Gates Where Patriots Fell Is Provocative’ – Bode George",
    "summarized_story": "Former Chairman of Nigerian Ports Authority & chieftain of the Peoples Democratic Party, Bode George, vocalises his thoughts on the recent developments in national politics: the amendment & signing of the Electoral Bill, Tinubu running for President and much more.\nIn this press conference, he expresses a disdain for the way elections are going and says he will not be a part of Nigeria if the ruling party, All Progressives Congress, comes into power again."
  },
  {
    "headline": "Mariupol: Ukraine Rejects Russian Demand to Surrender Port City",
    "summarized_story": "Ukraine has rejected a Russian ultimatum offering people in the besieged city of Mariupol safe passage out of the port if they surrender.\nBut Ukraine has refused, saying there was no question of it surrendering the strategic port city.\nAfter two hours, Russian forces say they would then have allowed humanitarian convoys with food, medicine and other supplies to enter the city safely, once the de-mining of the roads was complete.\n“When they [Russian forces] say about humanitarian corridors, what do they really do?\nMariupol is a key strategic target for Russia and has seen some of the invasion’s fiercest fighting, with Russian forces so far failing to take the city from its defenders."
  },
  {
    "headline": "Nigeria: Avuru, Co-Founder Seplat Energy, Calls for State of Emergency in Oil Sector, Says 80% of Crude Stolen",
    "summarized_story": "“How can we be losing over 95 per cent of oil production to thieves?\nOil production is down to about 1.4 million barrels per day and declining and this includes about 600,000BOPD from the deep water.\n“Nigeria will continue to drive the direction of the narrative for the African energy transition programme.\nWe have stood out to say ‘no’ to a single track energy transition programme.\nIt is obvious that we cannot move at the same pace with the rest of the world as far as the energy transition programme is concerned,” he maintained."
  },
  {
    "headline": "Plane Carrying 133 Crashes Into Mountains In China",
    "summarized_story": "A Boeing 737 carrying more than 133 people has crashed in mountains in China, with smoke seen billowing from the scene.\nChinese state television says the plane, flying from Kunming to Guangzhou, had an “accident” over GuangxiThe China Eastern Airlines flight had 133 passengers onboard at the time of the incident.\nIt is unknown how many casualties there are but rescue is said to be on its way to the mountainous region.\nThe Guangxi Emergency Management Department said in a statement: “A Boeing 737 passenger plane carrying 133 people from China Eastern Airlines crashed in Teng County, Wuzhou, Guangxi, and caused a mountain fire.\nImages shared on Twitter claimed to be of large pieces of the plane’s fuselage discovered in the area by locals."
  },
  {
    "headline": "Nigeria: PDP Presidential Hopefuls Tambuwal, Mohammed, Saraki Opt for Consensus Candidate",
    "summarized_story": "Saraki, who briefed journalists after the meeting, also said, “We appreciate that all of us have shown ambition but only one person could lead.\nFor this reason, we decided that we should all embrace consensus going forward in order to make things easier for our party’s stability,” Saraki stated.\nHe said although all of them seeking the number one position were all qualified to contest, “We are ready to sacrifice our ambitions.\nThe PDP is ready, because what is important is Nigeria.\nThe Deputy Governor of Bauchi State, Baba Tela, was also present at the press briefing."
  }
]