[
  {
    "headline": "Don’t use personal money for community projects, NYSC warns corps members",
    "summarized_story": "The National Youth Service Corps has warned prospective corps members against using their personal funds for community projects.\nA statement titled ‘Corps Members Tasked on Teamwork, Patriotism’ revealed that the DG also warned corps members against borrowing money to execute projects.\nRather, Ibrahim posited that prospective corps members should source funds within the community where the project would take place.\n“Don’t borrow money or use your personal money to execute projects”, the statement quoted Ibrahim as saying.\nIbrahim advised the Prospective Corps Members that they should choose either personal or group projects that could be completed within the period of the service year."
  },
  {
    "headline": "2023 Presidency: Nnamdi Kanu weakens Igbo’s chances of producing credible candidate -Yakasai",
    "summarized_story": "A founding member of the Arewa Consultative Forum and elder statesman, Alhaji Tanko Yakasai, says the secessionist agitation by the embattled leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu, weakens the chances of the Igbo people to produce a credible presidential candidate in the 2023 general elections.\nAccording to the 96-year-old statesman, the South-East geopolitical zone must convince Nigerians beyond any reasonable doubt that it is ready to occupy the exalted office in 2023.\nKanu, who is in the custody of the Department of States Services, is facing terrorism-related charges before Justice Binta Nyako of a Federal High Court in Abuja.\nHe and his group had listed alleged marginalisation of the Igbo people in governance, insecurity, as part of the reasons for his agitation.\nSpeaking during the interview, Yakasai said the Igbo people must not sit back and demand that the next Presidency be zoned to them."
  },
  {
    "headline": "Borno APC accuses PDP of being insensitive to plight of IDPs",
    "summarized_story": "The Borno Chairman of the ruling All Progressives Congress, Hon Ali Bukar Dalori, has described as unfortunate the attacking of Gov.\nBabagana Zulum APC- led administration by the opposition Peoples Democratic Party in the state over the distribution of N500 million for resettlement of Internally Displaced Persons from Maiduguri Bakassi camp to their respective local government areas.\nThe Borno chapter of PDP, through a press statement signed by its Publicity Secretary, Mr. Amos Adziba, had recently questioned the move by the APC.\nThe opposition party also called for the probe of the expenditure to see if the amount claimed was really spent.\nBut Dalori said it’s sad that while the people of Borno and Nigeria in general including the IDPs were happy over the gradual return of peace in Borno with massive resettlement and stabilisation programmes, the PDP that has remained silent over the plight of the IDPs for years would now come out to criticise proactive actions taken to empower traumatised IDPs."
  },
  {
    "headline": "Buhari condoles with Cosmas Maduka over wife’s death",
    "summarized_story": "File: Dr. Cosmas Maduka, CON, President, Coscharis Group with his wife, Charity, Vice President, Coscharis Group during the 4th convocation of Afe Babalola University, Ado Ekiti, where he received an Honorary Doctorate Degree award.\nPresident Muhammadu Buhari has commiserated with the Founder and Chief Executive Officer of Coscharis Group, Dr. Cosmas Maduka, over the passing of his wife, Charity, urging prayers for the family at the trying period.\nIn a condolence message released by his spokesman, Mr Femi Adesina, on Monday, in Abuja, President Buhari, joined friends and associates of the Maduka family and business group in mourning Mrs Maduka.\nHe noted that the deceased, who was the Vice President of Coscharis Group, demonstrated virtues in managing her home and businesses effectively.\nThe President also acknowledged the strength and contributions of the matriarch to the Maduka dynasty and country at large."
  },
  {
    "headline": "Global Citizen, Ford Foundation partner to combat Gender-Based Violence in Nigeria",
    "summarized_story": "PHOTO: Dieynaba Niably/UN WomenTo mark the start of today’s annual United Nations 16 Days of Activism campaign, the international advocacy organisation, Global Citizen announced a year-long partnership to combat the increase against gender-based violence in Nigeria, with the Ford Foundation, a private foundation seeking to reduce poverty and injustice.\nThe partnership will address the social, and economic, factors which have contributed to an environment where gender-based violence is now fast on the rise.\nIn communities across Nigeria and the world, COVID-19 has exacerbated cases of gender-based violence and injustice, creating a “shadow pandemic”.\nA survey of twenty-four Nigerian States, conducted from March-April 2020, revealed that the total number of reported gender-based violence incidents more than doubled from 346 cases to 794 cases in just the first two weeks of lockdown.\nThis trend has highlighted a much wider problem – gender-based violence is on the rise, with the increase hard to quantify as the majority of cases go unreported."
  },
  {
    "headline": "Omicron detected in various countries, WHO unclear whether it’s more dangerous",
    "summarized_story": "The World Health Organisation (WHO) on Monday said it is not yet clear whether Omicron is more transmissible, or causes more severe disease compared to other variants.\nOmicron, a new COVID-19 variant, which has been detected in a growing number of countries and regions worldwide has been prompting governments to tighten their restrictions and impose new travel bans.\nThe variant has sparked concerns among the public as two people in the Canadian capital city of Ottawa have tested positive for the highly transmissible Omicron variant of COVID-19.\nThe National Center for Disease Control of Libya on Sunday announced new travel restrictions due to the Omicron variant.\nIt also recommended Libyans not to travel to countries where the new variant has been detected."
  },
  {
    "headline": "Umahi increases revenue generation of Ebonyi through infrastructural Development – Nwaze",
    "summarized_story": "By Peter Okutu, AbakalikiThe Special Assistant to Governor David Umahi of Ebonyi State, Mr. Francis Nwaze, weekend stated that his boss was strategically increasing the State’s revenue generation capacity through infrastructural Development in different parts of the State.\nAccording to him, “Umahi is planning for the future of Ebonyi State.\nBy the grace of God Ebonyi State will have patent in the arrangement.\n“As I speak to you, Umahi has constructed about 500 different roads that have been constructed including rural roads.\nEbonyi State has moved from the dust of the nation to the true Salt of the Nation."
  },
  {
    "headline": "Court adjourns Olejeme’s case to Dec. 6 on medical grounds",
    "summarized_story": "By Fortune EromoseleA Federal High Court in Abuja, Monday, adjourned the trial of former Nigeria Social Insurance Trust Fund, NSITF, Ngozi Olejeme to December 6 on medical grounds.\nTrial Justice Maryam Hassan Aliyu adjourned the matter, after Olejeme’s councel Mr. Paul Erokoro, SAN, prayed the court to adjourn her case on the grounds of immediate medical attention.\n“Four months ago, the applicant suffered a heart failure and last month she caught Covid-19 and she is still in the recovery process.\n“She will have follow-up surgery, one of which is scheduled to hold next month in South Africa,” he stated.\nOlejeme was also accused of receiving $48,485,127.00, which was dollars equivalent of some funds received from contractors as “kickback.”"
  },
  {
    "headline": "Taraba NUT crisis: New faction supported by govt emerge",
    "summarized_story": "The wrangling in the Taraba State chapter of the Nigerian Union of Teachers (NUT) has taken a different dimension as the union has been factionalized into two groups.\nThis comes after the union’s election which took place in Donga local government council of the state.\nThe new group, reportedly backed by the government, has been named the Association of Basic Education Teachers.\nThe faction was said to have been gifted an 18-seater bus and a Hilux van.\nSpeaking, the union’s newly elected chairman, Comrade Nathan Solomon accused the state government of causing division in the union."
  },
  {
    "headline": "Delta 2023: Omo-Agege urges Urhobo to be conscious, strategic",
    "summarized_story": "Ahead of the 2023 governorship election in Delta State, the Deputy Senate President, Sen. Ovie Omo-Agege, on Monday said Urhobo people have to be more conscious and strategic.\nHe spoke on the topic; “The challenges and prospects of Urhobo Progress Union in contemporary times”.\nWe can come together as one big Urhobo family to defend Urhobo interest and still pursue our individual dreams.”The Speaker of the Delta State House of Assembly, Rt.Hon.\nSolomon Ighrakpata, commended the leadership of the Urhobo Progress Union, UPU, for their patriotism, commitment, and dedication to the course of the Urhobo Nation.\nEarlier, the President-General of Urhobo Progress Union, UPU Worldwide, Olorogun(Dr.) Moses Taiga JP welcomed all Urhobo indigenes and guests to the event."
  },
  {
    "headline": "Group advises politicians above 60 not to contest in 2023 election",
    "summarized_story": "The leadership of the Concerned Northern Forum (CNF) has appealed to Nigerian politicians over 60 years of age to stay away from the 2023 presidency.\nIn developed nations, the forum noted that people of such age and experience are mostly engaged in charitable activities, free consultancy services, and all forms of selfless services to their nation and populace.\n“Most of Nigeria’s political elites sources of wealth/ ideology is questionable, their state of health is unknown, primary, secondary and university/polytechnic attended is unknown while their age, name, parents and even state of origin are disputed,” the forum lamented.\nAccording to the forum, “The time is now and 2023 Presidency for us should be based on an Individual’s personal competence, health status, integrity, and credibility will determine his marketability and electability”.\nThe group explained that it can not allow the recycling of old politicians who have been instrumental to the enormous problems facing the country from 1999 till date to still come and lead the country to more uncertainty, alleging that their achievements are looting, corruption, among others."
  },
  {
    "headline": "Billionaire kidnapper Evans’s co-defendant dies in prison",
    "summarized_story": "Chiemeka Arinze, one of the co-defendants in the alleged kidnap of trial of Chukwudimeme Onwuamadike, alias Evans, has died in the custody of the Nigerian Correctional Service.\nThey were also charged with murder, attempted murder, conspiracy to commit kidnapping, attempt to kidnap and sale and transfer of firearms.\nAccording to his death certificate obtained by NAN on Monday, Arinze passed away at 9.08 pm on Nov. 26 as a result of cardiopulmonary arrest.\nThe death certificate which was issued by Ajeromi General Hospital, Ajegunle, signed by Dr. B.E Salisu indicated that the deceased, who died at the age of 45, was also suffering from complicated Advanced HIV.\nHe disclosed to NAN that he intends to inform the court of Arinze’s demise and apply to withdraw from the case"
  },
  {
    "headline": "Buhari sympathizes with Cosmas Maduka over wife’s death",
    "summarized_story": "President Muhammadu Buhari has commiserated with the Founder and Chief Executive Officer of Coscharis Group, Dr Cosmas Maduka, over the death of his wife, Charity.\nBuhari joined friends and associates of the Maduka family and business group in mourning Mrs Maduka, who was the Vice President of Coscharis Group and demonstrated virtues in managing her home and businesses effectively.\nThis was disclosed in a statement issued by Buhari’s Special Adviser on Media and Publicity, Femi Adesina, on Monday.\nAs wife, mother and partner, Buhari noted the strength and contributions of the matriarch to the Maduka dynasty and country at large, working as a professional teacher, caterer, administrator and, most significantly, a committed evangelist.\nPresident Buhari prayed that the Almighty God will receive the soul of the departed and comfort the family."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "JAMB takes over collection of registration fee from CBT centres to end extortion",
    "summarized_story": "JAMB takes over collection of registration fee from CBT centres to end extortionJAMB says it has taken over the collection of the N700 registration fee for the Unified Tertiary Matriculation Examination (UTME), from 2022.\nIt said in its weekly bulletin issued in Abuja on Monday that it would collect the approved N700 registration fee at the point of registration and remit the same to the various approved centres.\n“JAMB will as from the 2022 UTME exercise, be collecting the approved N700 registration fee on behalf of the various Computer-Based Test (CBT) centres along with its UTME registration fees.\n“This laudable step was borne out of a painstaking review of the entire UTME registration process which has revealed some unethical and unacceptable practices by many CBT centres.\nIt stated also that it had been compelled to make the UTME registration process cashless to put a stop to extortion."
  },
  {
    "headline": "BREAKING: Man United hire Rangnick as interim Manager",
    "summarized_story": "Manchester United have confirmed Ralf Rangnick as interim coach until the end of the season.\nUnited reached an agreement with Lokomotiv Moscow last week for the release of Rangnick, who was manager of sports and development at the Russian club.\nRead Also: Former Chelsea boss Guus Hiddink retiresThe 63-year-old’s contract will see him take charge of the first team until June and then remain at the club for at least a further two years in a consultancy role.\nUnited drew 1-1 with Chelsea on Sunday, after Jadon Sancho’s second goal in successive matches was cancelled out by a Jorginho penalty.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "Potential spread of new Omicron strain at global level is high -WHO",
    "summarized_story": "Potential spread of new Omicron strain at global level is high -WHOThe likelihood of potential further spread of the new Omicron Coronavirus strain at the global level is high, the World Health Organization (WHO) said on Monday.\n“Given mutations that may confer immune escape potential and possibly transmissibility advantage, the likelihood of potential further spread of Omicron at the global level is high,” the WHO said in its latest technical paper on the strain.\n“The overall global risk related to the new VOC Omicron is assessed as very high.\nREAD ALSO: Japan to ban foreign arrivals due to Omicron variant- Advertisement -“To date, no deaths associated with the new OMICRON Coronavirus strain have been registered.\n“Due to the risk of importation by incoming travelers from locations experiencing Omicron transmission, countries may increase sampling from inbound travelers."
  },
  {
    "headline": "Tinubu will succeed Buhari, 91-year-old declares",
    "summarized_story": "He said God reveals to him in a recent dream that Tinubu will succeed Preside t Muhammadu Buhari.\nHe also explained why he wants God to take his life before his next birthday in May 2022.\nAccording to him: “I hardly dream but whenever I dream, my dream always comes true.\nBut I now attend C.A.C Bethel that’s very close to my residence here.”“You will see that when they do the convention, Tinubu will win.\nWhen my dream comes to pass, they will remember me.”"
  },
  {
    "headline": "Kalu condoles with President of Coscharis Group of Comapnies, Dr Cosmas Maduka over wife’s demise",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has commiserated with the Founder and President of Cosharis Group of companies, Dr. Cosmas Maduka over the demise of his wife, Mrs Charity Maduka.\nDescribing the deceased as a virtuous woman and strong pillar of support to the womenfolk, Kalu stressed that the late Mrs Maduka will be remembered for her good deeds.\nThe former Governor urged the family members of the deceased to uphold her worthy legacies, adding that the late Vice President of Cosharis Group contributed to humanity through various initiatives.\nIn a condolence message, Kalu prayed to God to grant the deceased eternal rest and give Dr. Maduka the fortitude to bear the sad loss.\nHe said, ” I convey my sincere condolences to the Founder and President of Cosharis Group of Companies, Dr. Cosmas Maduka over the passing of his wife, Mrs Charity Maduka."
  },
  {
    "headline": "Terrorists planning attack on military bases in border towns nationwide –DSS",
    "summarized_story": "From Gyang Bere, JosThe Department of State Services (DSS) has raised the alarm over plans by terrorists to attack military bases in border towns across the country.\nThe secret agency also put the Nigeria Customs Service on red alert to avert the pending attacks by the insurgents on Ogun border communities and other border towns across the country, noting that the warning is based on intelligence it gathered.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe source revealed that most of them were trapped inside the correctional centre by joint security operation of the Operation Safe Haven, which condoned off the prison and its environs.\nNobody escaped from the prison and more information would be made public after our investigation,” he stated."
  },
  {
    "headline": "Subsidy removal: Don’t overburden Nigerians, PFN implores FG",
    "summarized_story": "From Oluseye Ojo, Ibadan and Charity Nwakaudu AbujaTHe Pentecostal Fellowship of Nigeria (PFN) has cautioned the Federal Government against further aggravating the suffering of Nigerians through the proposed subsidy removal.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHe also contended that the planned introduction of N5,000 for 40million poor Nigerians would create a cesspool of corruption.\nThis caution was contained in a statement by his Media Office, and made available to journalists in Ibadan, the Oyo State, yesterday.\nChairman, harvest committee, Offon Akpabio, appealed TO Nigerians to renew their mindsets because God is out to change the situation of the nation."
  },
  {
    "headline": "13 feared killed in Anambra auto crash",
    "summarized_story": "From Obinna Odogwu, AwkaAbout 13 people, including a child, have been feared killed in a fatal accident which took place along the Okija axis of the Onitsha – Owerri Expressway, in Ihiala Local Government Area of Anambra State.\nFRSC, in a statement, said that three vehicles were involved in the fatal crash which it said occurred at 15:06.\nFRSC said that 16 people were involved in the road crash: seven male adults, seven female adults, one male child and one female child.\nIt said that two male adults, one female adult and one male child lost their lives, while 12 were injured.\nOn the cause of the accident, FRSC said that it suspected excessive speeding and brake failure."
  },
  {
    "headline": "Sittings reduced to 6 hours weekly, as low attendance greet Senate",
    "summarized_story": "According to laws governing activities of the Senate vis-a-vis the National Assembly, lawmakers are expected to sit at least 180-181 days in a year.\nBesides shutting the National Assembly for months in 2020, it has also reduced the number of sittings in a week.\nHe claimed that lawmakers were busy with other legislative functions, hence they can’t attend plenary regularly.\nHe said: “I always attend plenary.\n“The primary responsibility of a senator is to attend plenary."
  },
  {
    "headline": "Breaking: Canada Says Two Cases of COVID-19 Omicron Variant Have Nigeria Travel History",
    "summarized_story": "Onyebuchi Ezigbo in Abuja with Agency reportsCanada said it has confirmed two cases of COVID-19 omicron variant from persons who had recently travelled from Nigeria.\nAccording to report by Associated Press, the government of Canada had announced the detection of the new COVID19 variant in a statement issued on Sunday.\n“Today, the province of Ontario has confirmed two cases of the omicron variant of COVID-19 in Ottawa, both of which were reported in individuals with recent travel from Nigeria.\nBut the federal government through the Nigeria Centre for Disease Control (NCDC) has said that the deadly omicron variant of the coronavirus was yet to be detected in the country.\nA statement issued on Sunday by its Director General, Dr. Ifedayo Adetifa however urged Nigerians to go and get vaccinated and also to adhere strictly to COVID19 health Advisory as a means of avioding any spread of more deadly COVID-19 variant."
  },
  {
    "headline": "Omicron COVID-19: Nigeria Stands with S’Africa, Warns West against Discrimination",
    "summarized_story": "The Nigerian government warned Western countries against discrimination against South Africa following travel restrictions imposed on Southern African countries in the aftermath of the new virus discovery.\nEhanire insisted that the move by Western countries to ban or try to isolate South Africa was discriminatory.\nEhanire stated, “Therefore, the world should wait for that time, than to be enmeshed in heavy discrimination against South Africa.\nThe federal government would open its doors to Ramaphosa and others who are coming from South Africa until science says otherwise.\nForeign nationals traveling from South Africa, Botswana, Namibia, Zimbabwe, Lesotho, Eswatini, Malawi and Mozambique were banned from entering South Korea, the agency said."
  },
  {
    "headline": "NDIC to Adopt Risk-based Approach in Determining Banks’ Premium",
    "summarized_story": "*Says in event of banks’ failure, 97% depositors would be coveredUgo AliogoThe Nigeria Deposit Insurance Corporation (NDIC) said it was reviewing its approach for determining the premium by banks to its Deposit Insurance Fund (DIF), with a view to adopting a risk-based approach.\nThe NDIC, in calculating premiums from deposit money banks, usually chose between adopting a flat-rate premium or a system that sought to differentiate premiums on the basis of individual-bank risk profiles.\nA flat-rate premium system has the advantage of being relatively easy to understand and administer.\nAlso, it allows the strong banks to subsidise the weak ones for the stability of the financial system.\nFor instance, in 2016, 2017, 2018 and 2019, the total number of accounts in the deposit money banks stood at 83 million; 99.1million; 112 million and 128.4 million respectively."
  },
  {
    "headline": "All Set for Arise Fashion Week in Dubai",
    "summarized_story": "*Kano Motif adopted as symbolAll is now set for Africa’s most dominant and dazzling runway platform, Arise Fashion Week (AFW), which holds at the Dubai Expo 2020 from December 3, 2021.\nThe AFW which holds in collaboration with the Nigerian Pavilion at Expo2020 Dubai and the Federal Ministry of Industry Trade and Investment, would be showcasing the best of African fashion designers and music at the expo in Dubai.\nFor the Expo2020 Dubai, Lisa Folawiyo, Ituen Basi, Banke Kuku, Onalaja, Tjwho, Lagos Space Programme, Huddaya, would be among the fashion designers that would have their collections on the runway.\nAlso, Grammy-award winning singer Wizkid would be providing musical entertainment and long-term partner of Arise Fashion Week, Naomi Campbell would be making an appearance alongside other global celebrities.\nSince its return, Arise Fashion Week has been at the forefront of promoting and celebrating the next generation of African fashion designers."
  },
  {
    "headline": "How Army, Using Informants, Infiltrated, Arrested Fleeing Terrorists in Lagos",
    "summarized_story": "In a similar development, the 9 Brigade, 81 Division of the Nigerian Army, on Friday in Lagos arrested one Ibrahim Abdullahi with eight 600mm mortar bomb explosives.\nYahaya gave the charge today during a tour of the Headquarters, 6 Brigade, Nigerian Army, Jalingo, as part of his operational and assessment visit to formations and units of the Nigerian Army across the country.\nTHISDAY gathered that the officers on duty at 9 Brigade, Nigerian Army, Lagos, were alerted by the suspicious movements of the suspect and his collaborators currently at large.\nLagos State Commissioner of Police, Hakeem Odumosu, once confirmed intelligence reports about the growing number of sleeper cells across the state.\nAn army statement said the Chief of Army Staff expressed appreciation to the government and people of Taraba State for providing the Nigerian Army land to build the brigade."
  },
  {
    "headline": "BREAKING: Residents Flee As Boko Haram Terrorists Launch Fresh Attack On Borno Community",
    "summarized_story": "Early reports indicate that the insurgents stormed the community Monday morning, shooting heavy artillery.\nSince the death of JAS leader, Abubakar Shekau, ISWAP has been consolidating its grip in locations around Lake Chad.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of people mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "BREAKING: Residents Flee As Boko Haram Terrorists Launch Fresh Attack On Borno Community",
    "summarized_story": "Early reports indicate that the insurgents stormed the community Monday morning, shooting heavy artillery.\nSince the death of JAS leader, Abubakar Shekau, ISWAP has been consolidating its grip in locations around Lake Chad.\nJust recently, it appointed Wali Sani Shuwaram, a 45-year-old as the new Leader (Wali) of ISWAP in Lake Chad.\nThe sect’s membership has swollen with the defection of hundreds of Boko Haram fighters under Shekau.\nThe terror group has caused over 50,000 deaths and displaced millions of people mainly in Adamawa, Borno, and Yobe states."
  },
  {
    "headline": "EXCLUSIVE: Bandits Write Christians In Zamfara To Shut Down Churches Or Risk Attacks",
    "summarized_story": "A group of bandits has written to the Christian community in Zamfara State, Northwest Nigeria to close churches or risk ferocious attacks, SaharaReporters has exclusively learnt.\nThe Zamfara State police command has confirmed the threat to SaharaReporters, saying, \"We are on top of the threat.\"\nSpokesperson for the command, DSP Mohammed Shehu, told our correspondent that the police were aware of the threat letter.\nHe said, \"Yes, I can confirm that it's true, a threat letter was sent to the Christians in Zamfara State to stop worship and to close churches.\n\"Additionally, plain-clothes personnel have been deployed for intelligence gathering and to unravel those behind the threat letter,\" he said."
  },
  {
    "headline": "EXCLUSIVE: Bandits Write Christians In Zamfara To Shut Down Churches Or Risk Attacks",
    "summarized_story": "A group of bandits has written to the Christian community in Zamfara State, Northwest Nigeria to close churches or risk ferocious attacks, SaharaReporters has exclusively learnt.\nThe Zamfara State police command has confirmed the threat to SaharaReporters, saying, \"We are on top of the threat.\"\nSpokesperson for the command, DSP Mohammed Shehu, told our correspondent that the police were aware of the threat letter.\nHe said, \"Yes, I can confirm that it's true, a threat letter was sent to the Christians in Zamfara State to stop worship and to close churches.\n\"Additionally, plain-clothes personnel have been deployed for intelligence gathering and to unravel those behind the threat letter,\" he said."
  },
  {
    "headline": "Nigerian Man, Associates Arrested In India For Defrauding Woman Of N3Million, Scamming Over 50 Others Befriended Online",
    "summarized_story": "The Faridabad police in India have arrested a Nigerian man, Chinonso Roy Akata who lives in Tuglakabad in New Delhi and three others for allegedly defrauding people online.\nIndia PoliceAkata and his accomplices, according to the Hindustan Times News, are using social networking sites to dupe people after befriending them.\nNarender Kadiyan, deputy commissioner of police (crime), Faridabad, said that the Nigerian national with the help of a Delhi woman formed a gang and started duping people after creating fake profiles.\nAfter an investigation by the cyber cell, an FIR was registered on Sunday at Faridabad cyber police station.\n“Our cyber police team put the suspects’ numbers on surveillance and their locations were traced, following which they were arrested,” said SHO Kumar."
  },
  {
    "headline": "Chinese embassy, Ugandan government deny takeover of airport by China over loan default",
    "summarized_story": "The Ugandan government and Chinese embassy in the country have denied viral media reports that China has taken over the Entebbe International Airport.\nAdvertisementMedia reports have claimed that Uganda has “surrendered” its only international airport and other assets in the country to China over an unpaid loan deal.\nAdvertisementEntebbe is said to be Uganda’s only international airport, handling over 1.9 million passengers annually.\n“Terms of the loan agreement for Entebbe Airport Expansion and Upgrading Project are in full compliance with the prevailing conventions and practices in the international financial market.\n“I wish to make it categorically clear that the allegation that Entebbe Airport has been given away for cash is false."
  },
  {
    "headline": "Chinese embassy, Ugandan government deny takeover of airport by China over loan default",
    "summarized_story": "The Ugandan government and Chinese embassy in the country have denied viral media reports that China has taken over the Entebbe International Airport.\nAdvertisementMedia reports have claimed that Uganda has “surrendered” its only international airport and other assets in the country to China over an unpaid loan deal.\nAdvertisementEntebbe is said to be Uganda’s only international airport, handling over 1.9 million passengers annually.\n“Terms of the loan agreement for Entebbe Airport Expansion and Upgrading Project are in full compliance with the prevailing conventions and practices in the international financial market.\n“I wish to make it categorically clear that the allegation that Entebbe Airport has been given away for cash is false."
  },
  {
    "headline": "Omicron: Targeting Africa with travel bans affects global solidarity, says WHO",
    "summarized_story": "The World Health Organisation (WHO) says placing travel bans that target Africa owing to the Omicron COVID-19 variant will affect global solidarity.\nAdvertisementSouth Africa announce the discovery of the new variant on Thursday, and it was subsequently designated a variant of concern by the WHO.\nAdvertisement“With the Omicron variant now detected in several regions of the world, putting in place travel bans that target Africa attacks global solidarity.\n“Flight bans have been imposed on southern African countries, but so far only two have detected the new variant.\nThe organisation, in a separate statement, said it is not yet clear whether Omicron is more transmissible compared to other variants, including Delta."
  },
  {
    "headline": "Omicron: Targeting Africa with travel bans affects global solidarity, says WHO",
    "summarized_story": "The World Health Organisation (WHO) says placing travel bans that target Africa owing to the Omicron COVID-19 variant will affect global solidarity.\nAdvertisementSouth Africa announce the discovery of the new variant on Thursday, and it was subsequently designated a variant of concern by the WHO.\nAdvertisement“With the Omicron variant now detected in several regions of the world, putting in place travel bans that target Africa attacks global solidarity.\n“Flight bans have been imposed on southern African countries, but so far only two have detected the new variant.\nThe organisation, in a separate statement, said it is not yet clear whether Omicron is more transmissible compared to other variants, including Delta."
  },
  {
    "headline": "Adegboruwa to Keyamo: FG can't declare #EndSARS panels illegal after setting them up",
    "summarized_story": "Ebun-Olu Adegboruwa, senior advocate of Nigeria (SAN), says the federal government cannot declare judicial panels on police brutality illegal after setting them up.\nThe report of the Lagos judicial panel, which described the Lekki shooting incident as a massacre, has been in the news lately.\nReacting to the development, Festus Keyamo, minister of state for labour and employment, said the Lagos judicial panel was “illegal and a waste of time”.\nThe human rights lawyer, who is a member of the Lagos panel, said it is important that the government build trust in all its dealing and utterances.\n“The #EndSARS Panels were set up at the behest of the federal government, through the National Economic Council."
  },
  {
    "headline": "African female founders need access to high-impact mentors",
    "summarized_story": "Beyond funding, African female entrepreneurs need access to high-impact mentors and who are willing to open up their network and teach what they know.\nWhile FirstCheck argues that African women in tech are “over-mentored” and “under-funded”, early-stage female founders need some handholding.\nSo Ouffata founded The African Tech Vision (ATV) to create and open up entrepreneurial pathways for ambitious African female founders and executive leaders.\nEmpowering African female entrepreneurs at scaleThe African Tech Vision is a free entrepreneurial programme designed to support early-stage African female founders and help them achieve their goals.\nFor Ouffata, betting on African female founders is a personal decision that fits into the larger vision of The African Tech Vision program."
  },
  {
    "headline": "Bolt partners with MAX to expand its vehicle finance scheme in Nigeria",
    "summarized_story": "In Nigeria, insufficient purchasing power among middle-class citizens, coupled with limited or no access to vehicle financing, puts car purchases out of reach for over 90% of the population.\nEarlier this year, Bolt launched a vehicle financing programme that offered drivers a flexible plan through which they could purchase their own vehicles.\nFor the partnership with Bolt, the company’s alternative credit-scoring technology will allow access to proprietary performance and revenue analytics to underwrite the Bolt car loans for drivers.\nThe car financing programme is currently open only to drivers in Lagos and Abuja, with Bolt planning to expand the offer to all active drivers across Nigeria.\nThe low rate of vehicle ownership in Nigeria is similar across Africa, a continent with the lowest per capita vehicle ownership in the world."
  },
  {
    "headline": "Jump Capital leads $4.2m seed round in Nigerian crypto exchange Busha",
    "summarized_story": "Busha, a Nigeria-based digital platform that helps people buy, sell and store cryptocurrency, has raised seed funding of $4.2 million in a round led by Jump Capital.\nCadenza Ventures, Blockwall Capital, CMT Digital, Greenhouse Capital, Raba Capital, and other investors also participated in the financing round.\nAccording to the company, the new funding will go towards deepening its market positioning in Nigeria, the leading crypto economy in Africa where all of its users are based.\nAs crypto adoption in Africa continues to accelerate, the inclusive offering from Busha is in line with the company’s stated mission to make crypto accessible to a broader population and reduce entry barriers.\nFor context, there are more than a million registered accounts from Nigeria on Paxful, an international peer-to-peer bitcoin marketplace."
  },
  {
    "headline": "Ex-DealDey managers reunite to launch ThankUCash deals",
    "summarized_story": "And at its peak, the startup could claim to be sub-Saharan Africa’s largest online deals platform.\nInterestingly, some of DealDey’s former managers—including Mohammed Abubakar, Juwon Ajao, and Joy Amadi—now have an opportunity to take another shot at building the continent’s largest online deals platform, but this time under the ThankUCash brand.\nThankUCash intends to leverage its existing analytics capabilities in order to do things better now, according to Simeon Ononobi.\nSimeon Ononobi is bullish on ThankUCash’s chances of becoming a super aggregator of such deals, helping businesses grow and consumers access bargains.\n“It’s huge,” the CEO said of his company’s ambitions in the online deals space."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Today, we'll be discussing: What to expect at Techpoint Build 2021All you need to know about meme..."
  },
  {
    "headline": "Fintech predictions, Sabi’s $6 million raise, Nigeria’s cooking gas woes, Sanicle’s $160k funding",
    "summarized_story": "Nigeria’s cooking gas woesIf you are like me and have contemplated using firewood as an alternative to cooking gas in the last few weeks, then some of these statistics might not surprise you.\nIn October 2021, the average price of 12.5kg cooking gas in Nigeria increased by 62.76% compared to October 2020.\nThe graph above shows the increase in the price of cooking gas since November 2019.\nTo see the top ten states by average cost of cooking gas as of October 2021, kindly follow this link.\nTake a listenDakuku Peterside has some thoughts on Nigeria’s rising cooking gas prices."
  },
  {
    "headline": "The next frontier for fintech: Disruptive business models",
    "summarized_story": "Africa’s fintech industry is one of the largest and probably the most advanced.\n“We would see more fintech companies, funding more fintech companies.\nCurrently, the fintech industry is very API and cloud computing driven.\nHowever, Olowe and Hassan believe that rather than disruptive technologies, it would be a more disruptive business model.\nCiting companies like Inflow Finance and Sproutly Nigeria, Hassan says infrastructure like Mono’s would be the base of novel business models."
  },
  {
    "headline": "Nigerian fintech startup, FairMoney, hosts its first “Investor Conference”",
    "summarized_story": "Laurin Hainy, CEO and Co-Founder of FairMoneyAs of October 2021, Africa: The Big Deal reported that 57% of the amounts raised which was slightly above $1.6 billion has gone to fintech startups.\nOne such fintech is FairMoney, a digital bank that currently offers lending services in Nigeria, India, and France.\nL – R: Oluwatomide Oluwole, Finance Manager, FairMoney; Henry Obiekea, VP CapitalMarkets, FairMoney; Yaw Mante, Head, Finance – FairMoney and James Edeh, Head,Compliance, FairMoney, at the FairMoney investor’s conference.\nThey need to be able to pay, they need to be able to save, they need to be able to invest.\nThere was also a panel session on the role of fintech startups in financial inclusion in Nigeria."
  },
  {
    "headline": "Obaseki urges measures to check population growth – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for urgent measures to check Nigeria’s population growth.\nIf we do not do something about controlling our population growth, there will be a huge gap between our capacity to narrow the growth rate and our development.\n“Yes, we could turn the 200 million-plus people we have today into a huge economic asset if we manage that growth.\nWe just commenced a 30-year planning process.\nWhile working on the national population census, we also have to commence our own census with our planning process,” Obaseki said."
  },
  {
    "headline": "Obaseki commissions 5,400mt per annum cashew factory, tasks youths to embrace opportunities in agribusiness – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… factory to be supported by over 2000 smallholder farmersBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has tasked youths to embrace opportunities in the agriculture value chain by deploying innovative ideas to initiate and develop agribusiness projects.\nObaseki made the submission after commissioning a 5,400mt per annum cashew processing factory, along PZ Road in Benin City, the Edo State capital.\n“Thirdly, my administration will continue to encourage more investments in Edo State as investment does well here because it is a state of the progressives.\nI would like to work with you to build capacity and encourage farmers to grow cash crops as you will give them a price for their produce.\nWe are proud of what you are doing here in the state, as we encourage more young people to be enterprising."
  },
  {
    "headline": "Obaseki seeks stakeholders’ collaboration to sustain education reforms in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has called for collaboration of the National Mathematical Centre and other stakeholders to sustain gains recorded in the state’s education sector through the Edo Basic Education Sector Transformation (EdoBEST) programmes.\nHe made the call during a courtesy visit by the Director/Chief Executive, National Mathematical Centre, Prof.\nHe said, “The saving grace for our country is education and not just sending children to school but having basic, qualitative and foundational education.\nBoth literacy and mathematical skills have to be emphasized at that level.”Obaseki noted that in Edo State, “We have made some significant steps in terms of strengthening foundational education through our EdoBEST programme.\nOn his part, the Director/Chief Executive, National Mathematical Centre, Prof."
  },
  {
    "headline": "THE 3,906 INMATES STILL ON THE RUN AND AREGBESOLA – Nigerian Observer",
    "summarized_story": "Rauf Aregbesola, Minister of Interior has ambition plans for the upgrade and rehabilitation of correctional facilities across the states to prevent future jailbreaks.\nAregbesola said the project was part of projects initiated by the federal government to reform the correctional service.\n“It is designed for inmates awaiting trial, a petty, medium and maximum security facility,” the minister said.\nRECENTLY, the Minister of Interior, Mr. Rauf Aregbesola, made a statement over the frightening attack on correctional centres across the country.\nThere have been at least eight jailbreaks in the last one year, and a large proportion of the inmates remain on the run."
  },
  {
    "headline": "Police apprehend eight inmates who escaped from Plateau prison after attack",
    "summarized_story": "The Plateau State police command has said it arrested eight inmates who escaped from a correctional centre in Jos after it was attacked by gunmen.\nGunmen said to bandits on a mission to free their detained colleagues had invaded the facility on Sunday evening, and many inmates escaped.\nOgba said the police took action and began an operation in search of the escaped inmates.\n“The CP also ordered immediate stop and search and seven inmates who escaped were re-arrested by the police and are in custody.\nThe spokesman said he will provide more information in the search of other escaped inmates."
  },
  {
    "headline": "EndSARS panels legal, set up by FG through NEC – Adegboruwa to Keyamo",
    "summarized_story": "Adegboruwa’s intervention is in response to the Minister of State for Labour and Employment, Festus Keyamo who on Sunday, dismissed the EndSARS panel set up by the Lagos State Government and the report it presented to the state government recently.\nBut in a statement on Monday titled, ‘The Legality Of #EndSARS Panels’, Adegboruwa said, “The Federal Government has recently muted the idea that all the Judicial Panels of Inquiry set up by the various States across the Federation, especially that of Lagos State, are illegal.\n“The EndSARS Panels were set up at the behest of the Federal Government, through the National Economic Council.\nBlinken had met with the Nigerian President at Aso Rock in Abuja, and Buhari had said the Federal Government was waiting on Lagos State and other state governments to come up with their conclusions.\nThat report is nothing but the triumph of fake news and the intimidation of a silent majority by a vociferous lynch mob"
  },
  {
    "headline": "World Bank says Nigeria’s exchange rate strategy discourages investors, increases inflation",
    "summarized_story": "The World Bank has said the Nigerian government’s exchange rate management policies are discouraging investments and fuelling inflation in the countryThe bank disclosed this in the November edition of its Nigeria Development Update.\nHighlighting the role of the Central Bank of Nigeria in exchange rate stability, the World Bank said there had been intense pressure on the naira, with the CBN constantly raising the nominal official exchange rate, PUNCH reported.\nIt added that the CBN’s foreign exchange management system was too rigid, with the system driving inflation in the country.\nThe report read in part, “The government’s exchange rate management policies continue to discourage investment and fuel inflation.\n“The NAFEX rate, which is now the guiding exchange rate for the economy, continues to be managed and is not fully reflective of market conditions."
  },
  {
    "headline": "Canadian govt says two persons returning from Nigeria have Omicron variant of COVID-19",
    "summarized_story": "The government of Canada has said two people returning from Nigeria tested positive for the Omicron variant of the Covid-19 virus.\nThis was disclosed by the Province of Ontario, suggesting that the variant may already be in Nigeria.\nThe Omicron variant which was first detected in Southern Africa last week has become a major concern to governments around the world as they rush to contain the spread.\nThe World Health Organization ( WHO) has stated that it is still not clear if the variant is more transmissible than the other variants.\nThe Canadian government said in a statement on Sunday that, “Today, the province of Ontario has confirmed two cases of the Omicron variant of COVID-19 in Ottawa, both of which were reported in individuals with recent travel from Nigeria."
  },
  {
    "headline": "Ugorji’s Appointment As Commissioner Excites Imo Community",
    "summarized_story": "Members of Aboh Mbaise community in Imo State have expressed their elation at the appointment of their son and US-trained public administrator and scholar, Dr Ugorji Okechukwu Ugorji, as Commissioner by Governor Hope Uzodimma.\nThe Oke clan of Aboh Mbaise particularly viewed the appointment as a healing of their perceived marginalisation in Aboh Mbaise.\nContributing, HRH Eze Stephen Nwabueze Ugorji, the Orji Ukwu 1 of Lorji Nwekeukwu Autonomous Community, described Ugorji as “our beloved son with exemplary good character.\nHe described Dr. Ugorji as a good person and the best candidate for the position.\nAs far back as 1996, the late HRH Eze Leonard Nnaji of Enyiogwugwu, conferred the title of Odoziobodo Mbaise (Community Organizer of Mbaise), on Dr. Ugorji."
  },
  {
    "headline": "Ugorji’s Appointment As Commissioner Excites Imo Community",
    "summarized_story": "Members of Aboh Mbaise community in Imo State have expressed their elation at the appointment of their son and US-trained public administrator and scholar, Dr Ugorji Okechukwu Ugorji, as Commissioner by Governor Hope Uzodimma.\nThe Oke clan of Aboh Mbaise particularly viewed the appointment as a healing of their perceived marginalisation in Aboh Mbaise.\nContributing, HRH Eze Stephen Nwabueze Ugorji, the Orji Ukwu 1 of Lorji Nwekeukwu Autonomous Community, described Ugorji as “our beloved son with exemplary good character.\nHe described Dr. Ugorji as a good person and the best candidate for the position.\nAs far back as 1996, the late HRH Eze Leonard Nnaji of Enyiogwugwu, conferred the title of Odoziobodo Mbaise (Community Organizer of Mbaise), on Dr. Ugorji."
  },
  {
    "headline": "COVID-19: Canada Detects First Cases Of Omicron Strain In 2 Travellers From Nigeria",
    "summarized_story": "Canada has announced its first cases of the new Omicron strain of COVID-19, in two people who traveled recently to Nigeria.\nThe government of Ontario confirmed that the two cases are in the country’s capital, Ottawa.\nAccording to the health minister, Canada, Jean-Yves Duclos, both patients are in isolation while public health authorities trace their possible contacts, said Federal and Ontario provincial officials.\nADVERTISEMENT“I was informed today by the Public Health Agency of Canada that testing and monitoring of COVID-19 cases has confirmed two cases of the Omicron variant of concern in Ontario.\nAs the monitoring and testing continues, it is expected that other cases of this variant will be found in Canada,” Duclos explained."
  },
  {
    "headline": "COVID-19: Canada Detects First Cases Of Omicron Strain In 2 Travellers From Nigeria",
    "summarized_story": "Canada has announced its first cases of the new Omicron strain of COVID-19, in two people who traveled recently to Nigeria.\nThe government of Ontario confirmed that the two cases are in the country’s capital, Ottawa.\nAccording to the health minister, Canada, Jean-Yves Duclos, both patients are in isolation while public health authorities trace their possible contacts, said Federal and Ontario provincial officials.\nADVERTISEMENT“I was informed today by the Public Health Agency of Canada that testing and monitoring of COVID-19 cases has confirmed two cases of the Omicron variant of concern in Ontario.\nAs the monitoring and testing continues, it is expected that other cases of this variant will be found in Canada,” Duclos explained."
  },
  {
    "headline": "Adamawa Now Investment Haven, Lawmaker Tells Investors",
    "summarized_story": "The Member representing Madagali/Michika federal constituency of Adamawa State in the National Assembly, Hon.\nZakaria Dauda Nyampa, has called on the people of Adamawa, within and outside Nigeria including investors, to come to the State and invest.\nAccording to the lawmaker, the Adamawa State governor, Umaru Fintiri, has improved the security of the state for investment, adding that they stand to benefit from the government positive policies that include tax holiday.\n“I will like to call on all the people of Adamawa State within and outside Nigeria to come back and invest.\nSince the State is becoming an investment haven, I believe investors know where the oil is and they must take advantage of the good atmosphere, environment and the pragmatic leadership we have in Adamawa State."
  },
  {
    "headline": "Malabu scandal: Documents reveal Seplat chairman, ABC Orjiako’s role",
    "summarized_story": "In the end, Helko Nigeria Ltd., a company in which Mr Orjiako was director, got $2.2 million from the booty.\nAbacha ConnectionThe Malabu case, possibly Nigeria’s biggest government-backed corporate heist, began in 1998 when Mr Etete was petroleum minister under Sani Abacha.\nThe windfall was shared between Mr Etete and top cabinet members in the government, court records show.\nMr Orjiako announced last week he will be stepping down from Seplat Energy’s board of directors in May 2022.\nIt had two directors: Mr Orjiako and his wife, Chioma Orjiako."
  },
  {
    "headline": "Malabu scandal: Documents reveal Seplat chairman, ABC Orjiako’s role",
    "summarized_story": "In the end, Helko Nigeria Ltd., a company in which Mr Orjiako was director, got $2.2 million from the booty.\nAbacha ConnectionThe Malabu case, possibly Nigeria’s biggest government-backed corporate heist, began in 1998 when Mr Etete was petroleum minister under Sani Abacha.\nThe windfall was shared between Mr Etete and top cabinet members in the government, court records show.\nMr Orjiako announced last week he will be stepping down from Seplat Energy’s board of directors in May 2022.\nIt had two directors: Mr Orjiako and his wife, Chioma Orjiako."
  },
  {
    "headline": "NAFDAC warns Nigerians: Abuse of antibiotics can result in death",
    "summarized_story": "The National Agency for Food and Drug Administration and Control has decried the increase in the irrational use of antibiotics.\nThe Director-General of NAFDAC, Prof Mojisola Adeyeye, according to the agency’s Resident Media Consultant, Sayo Akintola, in a statement on Sunday, said this on Friday at the virtual 2021 World Antimicrobial Resistance Week anniversary with the theme, ‘Spread Awareness Stop Resistance’.\nThe statement quoted Adeyeye as sounding a strong note of warning that if allowed to continue, antimicrobial resistance could lead to death.\nThe statement said Adeyeye added that the war against antimicrobial resistance had not only gained prominence and global attention, but had also become a significant battle that the human race must win.\nCreating awareness amidst us all is a major step in the AMR stewardship by relevant stakeholders to effectively stop resistance."
  },
  {
    "headline": "NAFDAC warns Nigerians: Abuse of antibiotics can result in death",
    "summarized_story": "The National Agency for Food and Drug Administration and Control has decried the increase in the irrational use of antibiotics.\nThe Director-General of NAFDAC, Prof Mojisola Adeyeye, according to the agency’s Resident Media Consultant, Sayo Akintola, in a statement on Sunday, said this on Friday at the virtual 2021 World Antimicrobial Resistance Week anniversary with the theme, ‘Spread Awareness Stop Resistance’.\nThe statement quoted Adeyeye as sounding a strong note of warning that if allowed to continue, antimicrobial resistance could lead to death.\nThe statement said Adeyeye added that the war against antimicrobial resistance had not only gained prominence and global attention, but had also become a significant battle that the human race must win.\nCreating awareness amidst us all is a major step in the AMR stewardship by relevant stakeholders to effectively stop resistance."
  },
  {
    "headline": "Breaking: Omicron COVID variant in Nigeria, 2 travellers detected in Canada",
    "summarized_story": "Ontario’s Ministry of Health has confirmed two cases of the Omicron COVID-19 variant, in two individuals with recent travel from Nigeria.\nThe two travellers have been isolated, according to a statement by Ontario ministry of health.\nThis should send alarm signals to Nigerian health authorities that the Omicron COVID-19 variant is already in the country.\n“Today, the province of Ontario has confirmed two cases of the Omicron variant of COVID-19 in Ottawa, both of which were reported in individuals with recent travel from Nigeria”, the ministry said.\nThe World Health Organisation labelled the Omicron COVID-19 variant, a variant of concern."
  },
  {
    "headline": "Agaba beat Akindele, Dominic to win Best Actress in AMAA 2021",
    "summarized_story": "Ugandan star actress Joan Agaba beat Nollywood veterans Funke Akindele-Bello and Rita Dominic to clinch the Best Actress award in the 2021 Africa Movie Academy Awards (AMAA).\nThe prestigious award, known for its recognition and celebration of African talents held on Sunday at the popular Marriot Hotel, Lagos.\nThe star winner of the night was Eyimofe, a movie by the Esiri brothers that bagged five prizes at the award ceremony.\nThe film won accolades for Best Direction, Best Nigerian Film among others.\nCheck out the full list of winners here."
  },
  {
    "headline": "BREAKING: Billionaire Kidnapper, Evans’ Co-defendant Chiemeka Arinze, Dies In Custody",
    "summarized_story": "Chiemeka Arinze, a co-defendant of reputed billionaire kidnap kingpin Chukwudumeme Onwuamadike, also known as Evans, has died in jail custody.\nEvans is on trial with Joseph Emeka, Chiemeka Arinze, and Udeme Upong before Justice Oluwatoyin Taiwo of an Ikeja Special Offences Court for the attempted kidnapping of Chief Vincent Obianodo, the Chairman of the Young Shall Grow Motors.\nThey face a seven-count accusation of murder, attempted murder, kidnapping conspiracy, attempted kidnapping, and guns sale and transfer.\nChemeka Arinze died on Friday, November 26, 2021, according to a source who requested anonymity.\nArinze, who had been unwell, was reportedly transferred from the prison to a General Hospital on Friday, where he died."
  },
  {
    "headline": "Unknown Gunmen Rain Bullets On Lawmaker’s Convoy In Ebonyi",
    "summarized_story": "Unknown gunmen opened fire on the convoy of Ebonyi lawmaker Hon.\nThe lawmaker was ambushed by gunmen on his way back to his hometown of Effium, according to NEWS DIRECT.\nAccording to reports, the gunmen opened fire on his convoy as soon as they saw him approaching the Effium village.\nDavid UMAHI, sent hundreds of security operatives to the Effium community in an attempt to calm the situation, but to no avail.\nRecall that the consultant in charge of the Ebonyi ring road project, along with four others, was kidnapped while supervising the works along the Effium axis of the ring road and has yet to be freed."
  },
  {
    "headline": "Super Tucano Decimates Dozens Of ISWAP Fighters In Borno",
    "summarized_story": "On Sunday, Islamic State’s West Africa Province (ISWAP) fighters were decimated by a Super Tucano strike aircraft.\nIn a military operation in Gajiram, Borno State’s Nganzai Local Government Area, their weapons trucks were also destroyed.\nWhen Nigerian Air Force (NAF) jets bombarded the town and a Forward Operating Base (FOB), the terrorists attempted to overrun it.\nDue to the firepower, some were completely destroyed, while ground troops were able to seize advanced weapons.\nLt. Gen. Faruk Yahaya, the Chief of Army Staff, has encouraged forces to sustain the pace and pursue fleeing terrorists."
  },
  {
    "headline": "Bandits Release 10 Of 13 Kidnapped Zaria LG Staff",
    "summarized_story": "The Kaduna State Police Command has announced the release of 10 of the 13 Zaria Local Government Council personnel who were kidnapped.\nThe LG staff regained their freedom on Saturday, according to the PPRO, ASP Mohammed Jalige.\nAccording to a relative of one of the rescued LG workers, a ransom of N40 million was paid before the robbers released the ten LG workers.\nThe kidnappers agreed to release the last three provided three motorcycles were made available to them, according to him.\nThe Local Government Council is prepared to supply the three motorcycles so that the remaining three LG employees can be discharged, according to journalists."
  },
  {
    "headline": "Breaking: 2 travellers from Nigeria contract new COVID-19 variant Omicron – Official",
    "summarized_story": "Despite claims by the federal government that no trace of the new Omicron strain of COVID-19 is found in the country, Canada has said that it has detected its first cases of two people who had travelled recently to Nigeria.\n“I was informed today by the Public Health Agency of Canada that testing and monitoring of COVID-19 cases has confirmed two cases of the Omicron variant of concern in Ontario,” Health Minister Jean-Yves Duclos was quoted in a statement by France24.com.\n“As the monitoring and testing continues, it is expected that other cases of this variant will be found in Canada.”Federal and Ontario provincial officials said both patients are in isolation while public health authorities trace their possible contacts.\nDetails loading…"
  },
  {
    "headline": "Jail breakers trapped in Jos Custodial Centre – Official",
    "summarized_story": "The Plateau state Medium Security Custodial Centre Jos Sunday came under attack by gunmen who reportedly stormed the facility in large number with sophisticated weapons.\nPolice Public Relations Officer (PPRO) in Kaduna state, ASP Muhammed Jalige, said this on behalf of the Commissioner of Police Abdullahi Mudasiru.\nHe urged other members of the public to assist security operatives with prompt information as he assures them of absolute confidentiality while acting on the intel.\nHowever, the PPRO declined comment on whether ransom was paid to secure the release the abducted staff.\nHe added that the kidnappers did not release three of the abducted staff because some conditions for the release was N40m and three brand new motorcycles."
  },
  {
    "headline": "COVID-19 Omicron: WHO cautions on travel bans targeting Africa, rising concerns over spread in UK, EU countries",
    "summarized_story": "Putting in place travel bans that target Africa attacks global solidarity, the World Health Organisation (WHO) has said through its regional director for Africa, Matshidiso Moeti.\n“With the Omicron variant now detected in several regions of the world, putting in place travel bans that target Africa attacks global solidarity.\n“While investigations continue into the Omicron variant, WHO recommends countries to take a risk-based and scientific approach and put in place measures which can limit its possible spread.\nFlight bans have been imposed on southern African countries, but so far only two have detected the new variant.\nTravel restrictionsPREMIUM TIMES reported how countries moved to restrict travels from southern African countries following the emergence of the new variant."
  },
  {
    "headline": "Breaking: 4 killed, 12 injured as buses, trailer crash in Anambra",
    "summarized_story": "At least four persons died in a crash involving two buses and one trailer along Ihiala-Onitsha road by Ihiala police station in Ihiala Local Government Area of Anambra State.\nEyewitness told Blueprint that 12 persons equally sustained injuries in the crash which occured around 3pm on Sunday.\nAccording to the Sector Commander, Federal Road Safety Commission (FRSC), Anambra State Command, Mr Adeoye Irelewuyi, affected vehicles were Nissan caravan bus with registration number AAH-836-ZV; Nissan caravan bus with registration number number AWK-278-YD; and a mac trailer with no registration number.\nHe said, “Probable cause of crash was as a result of excessive speeding and brake failure.\nFree vehicular movements has been restored by FRSC rescue team, police and the military men.”"
  },
  {
    "headline": "Breaking: Chelsea cage Manchester United in Premier League clash",
    "summarized_story": "The much-talked about Premier League clash between Chelsea and Manchester United has ended in a 1-1 draw.\nJorginho’s goal for Chelsea cancelled the opener scored by United’s Sancho in the 50th minute inside Stamford bridge on Sunday evening.\nDetails loading…"
  },
  {
    "headline": "Jos Prison Attack: Seven Fleeing Inmates Rearrested, Another Surrenders",
    "summarized_story": "Police have rearrested seven inmates who escaped from the Medium Security Custodial Centre in Jos, authorities at the Plateau State Command have said.\nThis followed the attack on the correction facility in the state capital by a yet-to-be-identified group of gunmen on Sunday.\nUbah Ogaba, who is the Police Public Relations Officer in the state, confirmed the rearrest of the inmates in a statement.\nREAD ALSO: Gunmen Attack Jos Correctional CentreThe police commissioner, Ogaba stated, directed that the entire area be cordoned off following reports that the centre was attacked by gunmen, leading to the escape of some inmates there.\nWhile the rearrested inmates are in custody, another person who escaped from the centre is said to have voluntarily surrendered himself to the police."
  },
  {
    "headline": "Two Soldiers Die As Troops Kill Several Terrorists In Borno",
    "summarized_story": "Two soldiers have been killed in an encounter with Boko Haram (BH) and Islamic State West Africa Province (ISWAP) terrorists in Borno State.\nHe said the insurgents were killed at the Forward Operating Base in Gajiram Nganzai Local Government Area of Borno State on Sunday.\nIn addition, troops also uncovered several charred remains of the terrorists along the route in the North-East region.\nTwo weeks ago, the military authorities confirmed the killing of the senior officer, Brig-Gen Dzarma Zirkusu and three other soldiers in a fierce encounter with ISWAP terrorists in Askira Uba Local Government Area of Borno State.\nA few days after, the Army avenged the general’s death by killing more than 50 ISWAP terrorists in the recent counteroffensive in the local government."
  },
  {
    "headline": "FG ‘Monitoring’ New COVID-19 Variant Omicron, Advises Nigerians To Get Vaccinated",
    "summarized_story": "The Nigeria Centre for Disease Control on Sunday said it was monitoring emerging evidence on the new COVID-19 variant, Omicron, which was first recently identified in Southern Africa.\nThe new variant “is considered highly transmissible” and has already triggered a new wave of travel restrictions targeted at countries in Southern Africa.\n“Avoid travel to countries where there is a surge in COVID-19 cases or reported cases of the Omicron variant,” the NCDC said.\n“Therefore we appeal to business owners, religious leaders, and people in authority to take responsibility by ensuring people in their premises wear masks and adhere to physical distancing.\n“We must do all we can to protect ourselves and our country.”"
  },
  {
    "headline": "#EndSARS Panel Was Illegal – Keyamo",
    "summarized_story": "Responding to a question about the position of the government specifically regarding a leaked report by the Lagos judicial panel, the human rights lawyer described the panel as illegal.\n“For me, that panel was an illegal panel”.\nPolicemen, the Armed Forces, military, are not officers of Lagos states, they are officers of the Federal Government by virtue of the Constitution.\nRELATED:#EndSARS Panel: Sanwo-Olu Sets Up Four-Member Committee For White Paper Report#EndSARS Panel Report A Waste Of Time, Taxpayers Money – Lai MohammedWhile the report has yet to be officially released, days later, the panel submitted its findings to Governor Babajide Sanwo-Olu.\nThe Nigerian army had, however, denied shooting live rounds at protesters, telling the judicial panel that only blanks were used."
  },
  {
    "headline": "Panic Grips Ondo Community Over Killing Of Woman At Church Entrance",
    "summarized_story": "Fear has gripped residents of the Iwaro community in Akoko South West Local Government Area of Ondo State over the killing of a woman at a church entrance.\nThe victim, a middle-aged woman – Mrs. Veronica Dare – was murdered in front of a Deeper Life Bible Church in the community.\nShe was said to have been murdered while going to the church to perform her duty as a sanitation worker in the church.\nThe remains of the woman have been deposited at the mortuary of the General Hospital, Iwaro by men of the Nigeria Police Force.\nShe expressed sadness on the wicked act, saying the police investigation has commenced to apprehend the killers of the woman."
  },
  {
    "headline": "Zamfara APC excos visit party bigwigs, promise to take party to greater heights -",
    "summarized_story": "The newly elected officers of the ruling All Progressive Congress in Zamfara said they are committed to respecting the party’s constitution and constituted authorities.\nThe Zamfara APC also says, they will show leadership by example and ensure that no duly registered member of the party is left behindThis was stated in a press statement signed by the publicity secretary of the Party Yusuf Idris GusauThe state Chairman of the party Tukur Umar Danfulani who led other party executive council members to a thank you visit to some party bigwigs in the state says, APC in Zamfara been rebranded and that all loyal members will be fully engaged in the party’s activitiesHe adds that his council have gained the confidence of the political gladiators under the good, people oriented and focused leadership of Governor Bello Matawalle who is also the leader of the party in the state.\nSome of the party bigwigs visited includes Former Governors Ahmad Sani Yeriman Bakura and Mamuda Aliyu ShinkafiOthers are Senator Hassan Nasiha who held brief for the party as Caretaker Committee Chairman and former Chairman House of Representatives Committee on Security and Intelligence, Sani Aminu JajiThe former Governors insist that the APC in Zamfara is united and has no Faction.\nThe duo also called on those challenging the decision of the apex body of the party to desist in the interest of peace, unity and progressSenator Yerima assured of his continuous support to the executive and all party affairs.\nThe first civilian Governor of the state Sani Yarima says, the APC is one in Zamfara and called on those challenging constituted authority of the party in the state to stop doing so in the interest of peace, unity and progress."
  },
  {
    "headline": "7 Escapees Re-arrested after attempted Jos Custodial Jailbreak -",
    "summarized_story": "The Police authorities in Plateau State says they have rearrested 7 inmates that escaped the medium-security custodial centre in Jos,when the facility came under attack by yet to be identified gunmen Sunday evening.\nThe Commissioner of Police in the State, Bartholomew Onyeka led the reinforcement to the scene upon receiving the reports and directed that the entire centre be cordoned.\nA stop and search order was immediately enforced, and in the process 7 escapees were re-arrested by the Police and are in Custody.\nOne of the escapee has voluntarily surrendered himself to the authority.\nThe situation has been brought under control by the swift response of security operatives to the scene."
  },
  {
    "headline": "Zamfara PDP Ward congresses In Progress across 147 Wards -",
    "summarized_story": "The people’s Democratic Party (PDP) in Zamfara ward congress is in progressThe congress is taking place simultaneously across the one hundred and forty Seven wards in the stateThe congress is to allow members of the party at the ward level to elect Officers of their choice that will will steer the ship of the party for the next four yearsAddressing newsmen shortly before the commencement of the congress in Gusau, Caretaker Committee Chairman of the Party in Zamfara Bala Mande says the party will conduct free and fair congressHe assured members of the party’s readiness to continue to practice Internally DemocraticTVC NEWS Monitored the congress of five wards in Gusau and embers were seen conducting their self in a peaceful mannerSabon Gari, Mayana, Madawaki, Tudun Wada and Galadima wards are conducting their Congresses at the GAPP Jenery in Gusau, the zamfara state CapitalA six man Appeal, Electoral and Screening, committee from the National Headquarters of the party led by Sunday Dogo are on ground to monitor the processOfficials of the Independent National Electoral Commission INCE and Security agencies are also present at the venueThe People’s Democratic Party in Zamfara says it has becomes necessary for the party to conduct it wards Congresses today to avoid clash with the All Progressive Congress which had it’s State Congress Saturday."
  },
  {
    "headline": "NANS rejects proposed subsidy removal, payment of N5000 to 4om Nigerians -",
    "summarized_story": "The National Association of Nigerian students has rejected the proposed subsidy removal of the federal government and payment of five thousand naira to 40 million poor Nigerians as transportation grant.\nThe students body threatened to shut down the country should the federal government fail to suspend its plans.\nAddressing journalists at a press conference in Abuja, they described the transportation grant as another window of corruption and excessive spending by the government."
  },
  {
    "headline": "Prince Charles Rejects Claim He Queried Skin Tone of Harry and Meghan’s Child",
    "summarized_story": "Prince Charles’s spokesman on Monday rejected a claim made in a book that the heir to the British throne had questioned what the skin tone of Prince Harry and Meghan’s child would be.\nIn the book, “Brothers And Wives: Inside The Private Lives of William, Kate, Harry and Meghan”, author Christopher Andersen says Charles asked what the “complexion” of the child would be.\n“This is fiction and not worth further comment,” Charles’s spokesman told reporters in Barbados, where Charles will take part in celebrations marking the island’s move to a republic.\nAccording to the Page Six celebrity news website, the book relates an alleged conversation between Charles and his wife Camilla.\nOn the morning of Harry and Meghan’s 2017 engagement, Charles said: “I wonder what the children will look like?”Camilla was apparently “somewhat taken aback” and replied: “Well, absolutely gorgeous, I’m certain,” Page Six said."
  },
  {
    "headline": "Djokovic Likely to Skip Australian Open Over Vaccine Mandate, Says Father",
    "summarized_story": "Novak Djokovic is unlikely to play at the Australian Open if rules on COVID-19 vaccinations are not relaxed, the world number one’s father, Srdjan Djokovic, said.\nOrganisers of the year’s first Grand Slam have said that all players will have to be vaccinated to take part.\nDjokovic has so far declined to disclose whether he is vaccinated and his father told Serbia’s TV Prva that governing body Tennis Australia’s stance on players being vaccinated was tantamount to “blackmail”.\nNo one has the right to enter into our intimacy,” news website B92 quoted Srdjan as saying.\nAnd he’s my son, so you decide for yourself.”Djokovic has won nine Grand Slam titles at Melbourne Park, including this year’s tournament, and shares the record of 20 men’s Grand Slam titles with Roger Federer and Rafa Nadal."
  },
  {
    "headline": "Dutch Police Arrest Quarantine Hotel Escapee Couple",
    "summarized_story": "Dutch police say they have detained a couple who escaped from a Covid-quarantine hotel.\nIt comes after 13 people who arrived in Amsterdam on two flights from South Africa last week tested positive for the new coronavirus variant.\nThey are among 61 passengers who tested positive for Covid.\nLocal media are reporting that they managed to flee a quarantine hotel in the north-western Kennemerland region, where travellers from South Africa are currently in self-isolation.\nThe escapees could be prosecuted for violating Dutch quarantine rules, De Telegraaf newspaper says."
  },
  {
    "headline": "Asian Markets Stabilise Amid Uncertainties Over Omicron Variant",
    "summarized_story": "Asian-Pacific stock markets showed signs of stabilising as investors prepared for weeks of uncertainty over whether the Omicron variant could derail the global economic recovery.\nBoth indices suffered their sharpest fall in months on Friday, with travel and airline stocks hit particularly hard.\nMarcel Thieliant, an economist at Capital Economics in Singapore, told Al Jazeera the implications of the variant for the regional economy were not clear-cut.\n“A more transmissible variant could prompt even more disruptions and restrictions to domestic activity, particularly in China given its zero-COVID strategy,” Thieliant said.\n“Very little is known about the new variant and there is news that symptoms are milder from South Africa,” Nguyen said."
  },
  {
    "headline": "US and Iran Seek to Break Impasse at Talks on Reviving Nuclear Deal",
    "summarized_story": "Critical talks with Iran to prevent the collapse of a nuclear deal are to resume in Vienna after five months.\nOfficials will discuss the possible return of the US to the 2015 accord, which limited Iran’s nuclear activities in return for the lifting of sanctions.\nIran has violated key commitments since then-President Donald Trump pulled out in 2018 and reinstated US sanctions.\nA major focus of the JCPOA was Iran’s production of enriched uranium, which is widely used as fuel for nuclear power plants but can also be used in nuclear weapons.\nInspectors from the International Atomic Energy Agency have also had their access to Iranian nuclear facilities significantly curtailed."
  }
]