[
  {
    "headline": "Pictorial: Buhari receives Masari at Aso Villa",
    "summarized_story": "), has received the Governor of Katsina State, Aminu Masari at the State House in Abuja on Tuesday.\nThis was disclosed by presidential aide, Buhari Sallau who said Masari led a delegation from Katsina State to see the President.\nNalado Sarkin/Sudan, Senator Mamman Danmusa, Senator Abba Ali, Ahmed Yusuf and Minister of Health, Dr. Osagie Ehanire.\nThe presidential aide, however, failed to disclose details of the meeting.\nPhotos courtesy Buhari Sallau | Facebook"
  },
  {
    "headline": "Pictorial: Buhari receives Masari at Aso Villa",
    "summarized_story": "The General Superintendent of the Deeper Christian Life Ministry, Pastor Williams Kumuyi, has preached peace in line with the message of Christmas.\nKumuyi was speaking on Monday night at the annual Christmas Praise Concert hosted by Vice President Yemi Osinbajo, at the Banquet Hall, Presidential Villa, commemorating the Christmas season.\nReferencing the Scriptures, especially the Gospels, the guest preacher spoke on the fact that the angels came to announce joy and peace (which is personal and perpetual) on earth.\nThe Carol service also featured gospel artistes including Mercy Chinwo, Ernest Dades, and choirs drawn from different geopolitical zones across the country.\nThe yearly Praise Concert did not hold in 2020 due to the COVID-19 pandemic and the attendant restriction protocols."
  },
  {
    "headline": "Court dismisses 11 of 20 fraud charges against former FCT Minister’s son",
    "summarized_story": "The Federal High Court Abuja, has discharged and acquitted Shamsudeen Bala, son of former Minister of the Federal Capital Territory, Bala Mohammed on 11 out of 20-count charge preferred against him by the Economic and Financial Crimes Commission, (EFCC).\nThe Economic and Financial Crimes Commission EFCC had alleged that the four companies were used by Bala to launder over N1.1 billion.\nThe anti-graft agency claimed that some of the assets included five plots of land at Asokoro Gardens; House FS 2 B, Green Acre Estate Apo-Dutse, Abuja; House FS 1A, Green Acre Estate, Apo-Dutse; FS 1B, Green Acre Estate, Apo-Dutse, Abuja and House 2A, No.\nThe court held that the evidence laid by the prosecution witness amounted to hearsay and therefore was not tenable in law.\nThe trial court insisted that the defendant should explain counts 17, 18 and 19, which were predicated on forgery."
  },
  {
    "headline": "NYSC membership not right for immunity, crime — DG",
    "summarized_story": "The Director-General, National Youth Service Corps ( NYSC), Brig.-Gen. Ibrahim Shuaibu, has again warned corps members against indulging in criminal activities.\nThe programme, which was observed in a low key in compliance with COVID -19 Protocols, was held at the Permanent NYSC Orientation Camp, Emure-Ekiti, in Emure Local Government Area.\n“Remember that your membership of the service corps does not cover immunity from the legal consequences of any wrongdoing.\nHe, however, reiterated the commitment of the scheme to ensuring safety and welfare of corps members at all times.\nHe, therefore, called on corps members’ employers, especially the State and Local Government Authorities as well as traditional rulers to give necessary encouragement to the corps members."
  },
  {
    "headline": "Bandits move to Kaduna-Zaria Road, allegedly kill many in Night attack, kidnap scores",
    "summarized_story": "Journalists were told that the bandits opened fire on the travellers Some travellers ran away for safety but those hit by bullets, could not.\nThey were taken away by the bandits while others, died.\nMeanwhile, the Kaduna State Police Command is yet to react to inquiry on Dogara’s gruesome murder, even as his relations said they left everything in the hands of Almighty Allah.\nOn Tuesday morning, the Kaduna Police Command said its operatives in Zaria have killed two bandits and recovered motorcycles used by the bandits to terrorize the people of Zaria and environs.\n“As the festive period is fast approaching, bandits and criminals would like to terrorise innocent people,” he said."
  },
  {
    "headline": "Alleged forgery: arraignment of Fani-Kayode stalled",
    "summarized_story": "The arraignment of a former Minister of Aviation, Femi Fani-Kayode for allegedly forging medical reports was on Tuesday stalled at an Ikeja Special Offences Court.\nCounsel to Fani-Kayode, Mr Wale Balogun challenged the jurisdiction of the court to hear the criminal suit.\n“We filed before your lordship an application bordering on your lordship’s jurisdiction to entertain an arraignment,” he said.\nBalogun noted that the alleged offences occured in Abuja and a Lagos court does not have jurisdiction to hear the suit.\n“He procured the false medical reports on Jan. 31, 2018, May 30, 2019, Nov. 24, 2020, March 23, Oct. 11."
  },
  {
    "headline": "Breaking: Nnamdi Kanu gets VIP treatment from our facility, DSS denies IPoB allegations",
    "summarized_story": "The Public Relations Officer of the DSS, Dr. Peter Afunanya, made the clarification at a world press conference in Abuja on Tuesday.\n“The Service denies all the inciting allegations by IPOB and states that Nnamdi Kanu is not, in any way, maltreated in custody.\n“Nnamdi Kanu enjoys full luxury in the holding facility incomparable to any of its type anywhere in the country.\nHe is regularly allowed change of clothing as against what is presented to the public by IPOB propagandists.\n“Rather than focus on how he should get justice, Kanu’s legal team and some mischievous elements among them have chosen to use fake news to mislead the public."
  },
  {
    "headline": "Kogi: Police confirm kidnap of Yahaya Bello Chief of Staff’s mother",
    "summarized_story": "The Kogi State Police Command has confirmed the kidnap of Mrs Seriya Raji, the mother of Gov.\nYahaya Bello’s Chief of Staff.\nDAILY POST had earlier reported that Mrs Raji was kidnapped on Monday evening by unknown gunmen at her residence in Nagazi, under Adavi Local Government Area of Kogi State.\nConfirming the incident on Tuesday, the Kogi State Commissioner of Police, CP Idrisu Dauda Dabban, said his men have combed the entire central senatorial district and border towns in Edo with a view to rescuing the mother of the Chief of Staff.\nMother of Yahaya Bello’s Chief of Staff kidnapped in Kogi"
  },
  {
    "headline": "UAE makes U-turn, accepts Nigerian passengers",
    "summarized_story": "The United Arab Emirates government has rescinded its decision against Nigerian passengers.\nThe UAE had disallowed Nigerian travellers from entering the country on Monday following a circular issued to foreign airlines.\nThe decision was taken as a result of an increasing number of COVID-19 positive passengers.\n“Due to an increasing number of COVID Positive passengers at the destination, it is decided to suspend accepting passengers to U.A.E from Nigeria and Congo DRC (FIH) only,” it read.\nPlease ensure 100% compliance.”Again, UAE places ban on Nigerian flights"
  },
  {
    "headline": "Obasanjo has questions to answer over Bola Ige’s death – Afenifere leader, Ayo Adebanjo",
    "summarized_story": "Ayo Adebanjo, leader of Yoruba socio-political organization, Afenifere, on Tuesday said former President Olusegun Obasanjo has questions to answer on the death of Bola Ige, ex-Attorney General of the Federation.\nAdebanjo maintained that Obasanjo can’t claim innocence over the death of the former AGF.\nAppearing on Arise News on Tuesday, the Afenifere leader said: “A lot of questionable deaths happened during the regime of Obasanjo.\nNobody is disputing that, and as far as we are concerned, he has a lot of questions to answer.\n“To be candid, a lot of questionable deaths happened during the regime of Obasanjo."
  },
  {
    "headline": "BREAKING: NSA Monguno identifies Islamic groups behind Boko Haram, terrorism in Nigeria",
    "summarized_story": "Babagana Monguno, the National Security Adviser to President Muhammadu Buhari, has identified groups enabling terrorism in Nigeria.\nMonguno identified Jama’at Nasr al-Islam Wal Muslimin, JNIM, Islamic and Muslim Support Group, and Islamic State in Greater Sahara, ISGS, as organizations behind terrorism in Nigeria and Africa.\nThe retired Major General disclosed this while speaking at the 14th Workshop of the League of Ulamas, Preachers and Imams of Sahel countries in Abuja on Tuesday.\nAccording to Monguno: “Terrorism and the rapid escalation of violent activities by militant Islamist groups in the Sahel since 2016 have been primarily driven by the Islamic State in Greater Sahara (ISGS), which mainly operates in Mali and extends to the Niger Republic and Burkina Faso.\n“In Nigeria, Boko-Haram and Islamic State in West Africa Province (ISWAP) dominate terrorist activities, especially in the North-Eastern part of the country."
  },
  {
    "headline": "Stop politicizing insecurity, Nigerians can’t serve God – Sultan of Sokoto to politicians",
    "summarized_story": "The Sultan of Sokoto and President of the Nigerian Supreme Council for Islamic Affairs, Muhammadu Sa’ad Abubakar III, has called on Nigerian leaders to stop politicizing insecurity.\nAbubakar said the politicization of insecurity is Nigeria’s major problem.\nSpeaking at an event in Abuja yesterday, the monarch said the solution to insecurity in the country is very close.\nThe monarch lamented that without adequate security, Nigerians can’t worship God.\nAlso, the President of the Christian Association of Nigeria, CAN, Samson Ayokunle, appealed to Nigerians to sustain the pressure on politicians to ensure success in the fight against insecurity."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "BREAKING: National Assembly members, others are targets of kidnapping, assassination – DSS",
    "summarized_story": "The Department of State Services (DSS) on Tuesday raised alarm that certain groups and individuals intend to cause a breakdown of law and order in the country.\nThe Service also raised alarm that recessing members of National Assembly and State Houses of Assembly and other public and private sector workers on vacation may be predisposed to threats of various degrees.\n“These may include but not limited to financial crimes, armed robbery, civil disobedience and violent protests, substance abuse, banditry and kidnapping.\n“Aside students, recessing members of National Assembly/State Houses of Assembly and other public/private sector workers on vacation may be predisposed to threats of various degrees.\n“Overall, citizens and residents are advised to cooperate with security and law enforcement agencies for lasting peace in the country."
  },
  {
    "headline": "Alleged forgery: arraignment of Fani-Kayode stalled",
    "summarized_story": "The arraignment of a former Minister of Aviation, Femi Fani-Kayode for allegedly forging medical reports was on Tuesday stalled at an Ikeja Special Offences Court.\nCounsel to Fani-Kayode, Mr Wale Balogun challenged the jurisdiction of the court to hear the criminal suit.\n“We filed before your lordship an application bordering on your lordship’s jurisdiction to entertain an arraignment,” he said.\n- Advertisement -Balogun noted that the alleged offences occurred in Abuja and a Lagos court does not have jurisdiction to hear the suit.\n“He procured the false medical reports on Jan. 31, 2018, May 30, 2019, Nov. 24, 2020, March 23, Oct. 11."
  },
  {
    "headline": "UPDATED: Buhari nominates new Minister, National Commissioners for INEC, NPC",
    "summarized_story": "UPDATED: Buhari nominates new Minister, National Commissioners for INEC, NPCPresident Muhammdu Buhari has nominated Mr. Muazu Jaji Sambo from Taraba State as a Minister of the Federal Republic of Nigeria.\nBuhari also nominated six National Commissioners and one Resident Electoral Commissioner for the Independent National Electoral Commission (INEC).\nProf. Rada H. Gumus – Bayelsa State, South South, and Mr. Sam Olumeku – Ondo State, South West.\n- Advertisement -Mr. Olaniyi Olaleye Ijalaye from Ondo State, (South West) was named Resident Electoral Commissioner.\nThose nominated as Commissioners for the National Population Commission (NPC), include Engr Benedict Opong – Akwa Ibom State; Mrs Gloria Izofor Mni – Bayelsa state, Barr."
  },
  {
    "headline": "UK has 10 people in hospital with Omicron, says deputy PM Raab",
    "summarized_story": "UK has 10 people in hospital with Omicron, says deputy PM RaabBritish Deputy Prime Minister Dominic Raab said on Tuesday that there were 10 people in hospital with Omicron.\nEarlier, Raab had told Sky News that there were at least 250 people with Omicron in hospital.\n“I misheard one of the questions,” Raab told ITV when asked about the range of figures.\nREAD ALSO: First death with Omicron variant recorded in UK- Advertisement -“The figures are one dead from Omicron, 10 in hospital,” he added.\nWhen asked to clarify the figures, a spokesman for the justice ministry told Reuters to call the health ministry."
  },
  {
    "headline": "FG mulls additional taxes in 2022",
    "summarized_story": "She said a couple of reforms and amendments had been recommended in the draft 2021 Finance amendment bill saying more would be introduced in the middle of 2022.\n“This is to amend the Police Trust Fund Act and the Nigerian Trust Fund Acts, the purpose is to empower the FIRS to collect the Nigerian trust fund levies on companies on behalf of the fund itself.\nHe said the ministry had worked with relevant stakeholders and Fiscal Policy Reform Committee to draft the 2021 Finance bill.\nPresident Muhammadu Buhari, had on December 7, transmitted a letter to the Senate, urging it to consider and pass the Finance (Amendment) Bill 2021.\nBuhari said the Finance Bill would guide the implementation of the soon-to-be passed Appropriation Act, 2022."
  },
  {
    "headline": "COVID-19: We’ll no longer accept short-shelf life vaccines –FG",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaFollowing the expiration of one million doses of COVID-19 vaccine, the Federal Government has announced that it would no longer accept vaccines with short-shelf life as it mounts undue pressure on health workers to administer them.\nIt disclosed that over 10 million vaccines with short-shelf life received free of charge have been administered so far in the country.\nMinister of Health, Dr. Osagie Ehanire, had on December 8, confirmed the report of the expiration of doses of vaccines supplied to the country.\nMinister of Aviation, Hadi Sirika, made the clarification at the PSC briefing.\nSo, today (Saturday) there was a meeting, I participated in a zoom meeting, COVID-19 task force, just for your information also."
  },
  {
    "headline": "Stronger executive, legislative partnership’ll deepen democracy –Buhari",
    "summarized_story": "President Muhammadu Buhari, yesterday, said a stronger executive and legislative partnership would deepen democracy.\n“Our democracy has similarly been confronted by several challenges, some novel, that required hitherto unanticipated solutions, while others, though familiar, required adaptation to meet prevailing circumstances.\n“In other situations, the executive and legislative relationships have come into focus, especially as it concerns the exercise of powers enshrined in the constitution and the practice of checks and balances,” he said.\nBuhari, thereafter, urged the National Assembly and NILDS to ensure the outcome of the lecture was well documented and circulated.\nNILDS Director General, Abubakar Sulaiman, said the lecture series had been initiated by the National Assembly as a bi-annual event."
  },
  {
    "headline": "ASUU issues strike notice, demands implementation of 2009 agreement with FG",
    "summarized_story": "The lecturers’ union spoke at press conferences held at various zonal levels across the country, yesterday.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThe insincerity of the Federal Government is not just beyond understanding, it is beyond tolerance,” ASUU said.\nTo accept negotiation on every issue and for the agreement to be reached, strike must be embarked upon.\nThe implementation of such agreement be it MoA or MoU would only see the light of the day after series of action,” he said."
  },
  {
    "headline": "Body of SANs call on judiciary to defend independence",
    "summarized_story": "From Godwin Tsa, AbujaThe Body of Senior Advocates of Nigeria (BOSAN) has called on the judiciary to protect its independence by not allowing external enemies to invade its sacred sanctuary.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nThere is no doubt that the independence of the judiciary is the cornerstone of a democratic society and safeguard for the freedom and rights of thecitizens under the Rule of Law.\nWe are all familiar with those well-known impediments to the independence of the Judiciary, such as financial dependence, appointment and removal of judges, disobedience of court orders etc.\nClick here ."
  },
  {
    "headline": "BREAKING Mother Of Governor Yahaya Bello’s Chief Of Staff Kidnapped In Kogi",
    "summarized_story": "A few weeks after the Kogi State Commissioner for Environment, Adewale Omofaiye, escaped being kidnapped, the mother of the Chief of Staff to Governor Yahaya Bello has been abducted by gunmen.\nSources said Madam Seriya Raji was abducted around 8pm on Monday at her residence in the Nagazi area of Okene in Kogi State.\nIn the last week of November, the Kogi commissioner, Omofaiye, between Ikoyi and Iyara areas of the state, had been attacked and escaped with injuries.\nThree persons were said to be in the car when they were waylaid and attacked by the suspected kidnappers.\nIt had been reported that some motorists were kidnapped and taken to the bush during the attack."
  },
  {
    "headline": "BREAKING Mother Of Governor Yahaya Bello’s Chief Of Staff Kidnapped In Kogi",
    "summarized_story": "A few weeks after the Kogi State Commissioner for Environment, Adewale Omofaiye, escaped being kidnapped, the mother of the Chief of Staff to Governor Yahaya Bello has been abducted by gunmen.\nSources said Madam Seriya Raji was abducted around 8pm on Monday at her residence in the Nagazi area of Okene in Kogi State.\nIn the last week of November, the Kogi commissioner, Omofaiye, between Ikoyi and Iyara areas of the state, had been attacked and escaped with injuries.\nThree persons were said to be in the car when they were waylaid and attacked by the suspected kidnappers.\nIt had been reported that some motorists were kidnapped and taken to the bush during the attack."
  },
  {
    "headline": "BREAKING Mother Of Governor Yahaya Bello’s Chief Of Staff Kidnapped In Kogi",
    "summarized_story": "A few weeks after the Kogi State Commissioner for Environment, Adewale Omofaiye, escaped being kidnapped, the mother of the Chief of Staff to Governor Yahaya Bello has been abducted by gunmen.\nSources said Madam Seriya Raji was abducted around 8pm on Monday at her residence in the Nagazi area of Okene in Kogi State.\nIn the last week of November, the Kogi commissioner, Omofaiye, between Ikoyi and Iyara areas of the state, had been attacked and escaped with injuries.\nThree persons were said to be in the car when they were waylaid and attacked by the suspected kidnappers.\nIt had been reported that some motorists were kidnapped and taken to the bush during the attack."
  },
  {
    "headline": "Expecting More From Buhari Is Like Beating Dead Horse – Ex-President, Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo has said that President Muhamadu Buhari has done the best he could do and expecting him to do anything more is akin to beating a dead horse.\nAccording to Daily Trust, Obasanjo spoke in Abuja Monday at a retreat on inclusive security organised by the Global Peace Foundation and Vision Africa.\nIf we are expecting anything more than what he has done or what he is doing, that means we’re whipping a dead horse and there is no need.\n“People talk of political will, but I talk of political action.\nIt must be matched by political action."
  },
  {
    "headline": "Expecting More From Buhari Is Like Beating Dead Horse – Ex-President, Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo has said that President Muhamadu Buhari has done the best he could do and expecting him to do anything more is akin to beating a dead horse.\nAccording to Daily Trust, Obasanjo spoke in Abuja Monday at a retreat on inclusive security organised by the Global Peace Foundation and Vision Africa.\nIf we are expecting anything more than what he has done or what he is doing, that means we’re whipping a dead horse and there is no need.\n“People talk of political will, but I talk of political action.\nIt must be matched by political action."
  },
  {
    "headline": "Nnamdi Kanu enjoys full luxury in custody, says DSS",
    "summarized_story": "The Department of State Services (DSS) says Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), enjoys full rights in custody.\nIPOB had alleged that Kanu is denied food and change of clothing in custody.\nAfunanya said Kanu enjoys the best treatment in custody as it is obtainable anywhere in the country.\nAdvertisement“The service denies all the inciting allegations by IPOB and state that Nnamdi Kanu is not in a anyway maltreated in custody,” Afunanya said.\n“Nnamdi Kanu enjoys full luxury in the holding facility in comparable of any of it type any where in the country."
  },
  {
    "headline": "Nnamdi Kanu enjoys full luxury in custody, says DSS",
    "summarized_story": "The Department of State Services (DSS) says Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), enjoys full rights in custody.\nIPOB had alleged that Kanu is denied food and change of clothing in custody.\nAfunanya said Kanu enjoys the best treatment in custody as it is obtainable anywhere in the country.\nAdvertisement“The service denies all the inciting allegations by IPOB and state that Nnamdi Kanu is not in a anyway maltreated in custody,” Afunanya said.\n“Nnamdi Kanu enjoys full luxury in the holding facility in comparable of any of it type any where in the country."
  },
  {
    "headline": "Ayo Adebanjo: Obasanjo still has questions to answer over Bola Ige's death",
    "summarized_story": "Ayo Adebanjo, acting leader of Afenifere, Yoruba socio-political group, says former President Olusegun Obasanjo has “a lot of questions to answer” over the death of Bola Ige.\nAdvertisement“There’s no doubt that Obasanjo’s government cannot claim innocence about the death of Bola Ige.\nNobody is disputing that, and as far as we are concerned, he has a lot of questions to answer.\n“To be candid, a lot of questionable deaths happened during the regime of Obasanjo.\nOn that score [ in the book of Bisi Akande], I think there’s a point for Obasanjo’s government to answer.”"
  },
  {
    "headline": "Ayo Adebanjo: Obasanjo still has questions to answer over Bola Ige's death",
    "summarized_story": "Ayo Adebanjo, acting leader of Afenifere, Yoruba socio-political group, says former President Olusegun Obasanjo has “a lot of questions to answer” over the death of Bola Ige.\nAdvertisement“There’s no doubt that Obasanjo’s government cannot claim innocence about the death of Bola Ige.\nNobody is disputing that, and as far as we are concerned, he has a lot of questions to answer.\n“To be candid, a lot of questionable deaths happened during the regime of Obasanjo.\nOn that score [ in the book of Bisi Akande], I think there’s a point for Obasanjo’s government to answer.”"
  },
  {
    "headline": "Travel ban: Diplomatic row with UAE will be resolved soon, says FG",
    "summarized_story": "The federal government says there are ongoing talks with the United Arab Emirates (UAE) to resolve the fresh diplomatic row.\nTo this effect, Ethiopian Airlines, Turkish Airlines, and other airlines connecting transit flights from their hubs into Dubai refused to board Nigerians.\nBut TheCable understands that this development might not be unconnected with the recent diplomatic rift between Nigeria and UAE.\nAir Peace had requested a slot of three weekly flights from Nigeria to Sharjah Airport in UAE, but only one was granted.\nAdvertisementThe UAE’s GCAA blamed the airline for pulling out of Sharjah Airport and “so should not expect to retain its flight frequency there” — a claim Air Peace has denied."
  },
  {
    "headline": "1da Banton’s “No Wahala” blew up on Tik Tok. Now he knows its power",
    "summarized_story": "“When I recorded ‘No Wahala’, that was how I was feeling, so I put it into music.\nSo, I’m glad we achieved that.”Born and raised in Port-Harcourt, 1da Banton, dropped his debut single in 2015.\n“My TikTok video on the ‘No Wahala’ challenge gave me my highest views and engagement on TikTok.\nI didn’t expect it,” said Yewande Daranijo, an aspiring actress whose first viral TikTok video has over 300,000 views through this challenge.\n1da Banton recalled that at the time his song was blowing up in France, he wasn’t a regular user of Tik Tok and was still finding his way around the app."
  },
  {
    "headline": "Can Kenya get out of the supply chain crisis?",
    "summarized_story": "A global meltdownOn a global level, the supply chain meltdown began with a container shortage that cropped up at the end of 2020, with freight rates rising higher than 264%, compared to previous years.\nAt this point, global supply chains were already out of balance, and demand for exports exceeded the supply of shipping containers.\nWhile the flower industry is rebounding and trucks are moving more freely, the temporary dismemberment of the supply chain industry may continue to have knock-on effects on businesses in the East African economy.\nReliability is keyKenya’s potential supply chain crisis and its impact can be mitigated.\nWithout it, it may be years before we see supply chain issues corrected and an environment for freer trade realised."
  },
  {
    "headline": "How African startups can build multi-million dollar deals",
    "summarized_story": "One of the biggest acquisition deals of 2021 is MFS Africa’s deal with Capricorn.\nWhile the amount is undisclosed, both parties confirmed that the deal is Nigeria’s “second-largest” fintech acquisition deal, second only to Paystack’s $200 million acquisition deal with Stripe.\nBig deals start out smallFor Dare Okoudjou—who has led MFS Africa’s growth in 35 African countries—big deals and acquisitions don’t always start out as big deals.\nPrior to Capricorn, MFS Africa had acquired two other companies.\nIn 2016, MFS Africa acquired Sochitel—a company that specialised in international airtime transfers into Africa—and the acquisition, according to MFS Africa, helped create the largest transfer payment network which focuses on Africa."
  },
  {
    "headline": "Kwara raises a $4m seed to build Africa’s first credit union-powered neobank",
    "summarized_story": "The company is reportedly growing its credit union customer base by 40% month-on-month, and the listed credit unions are growing their membership by 19% and their loan base by 46%, annually.\nThough it’s reported to be courting some credit union clients in South Africa and the Philippines, which, according to the CEO, validates their solution across multiple markets.\nDue to that, it’s launching a new bank that will be powered by its existing credit unions.\nAlso, any unbanked individual can easily join a credit union and then enjoy the whole banking benefits.\n“Kwara’s unique approach is a catalyst for a new way of retail banking through digital-first credit unions."
  },
  {
    "headline": "Mafab Communications: The underdog winner of Nigeria’s 5G license",
    "summarized_story": "Mafab Communications Limited, the unexpected winner of Nigeria’s second 5G license last night, was until December 2, 2021, the day the auction was announced, unknown to very few people.\nThe companies include Eman Homes & Estate, Althani Investment Limited, Salam Takaful Insurance, and Mafab Communications.\nPrior to the auction, BusinessDay had noted a lack of information on the Mafab Communications website regarding the leadership of the communication company.\nMafab secured a 20-year International Data Access (IDA) license and an Interconnect Exchange license from the NCC on 1 October 2020.\nAccording to him, Mafab Communications was very eligible to take part."
  },
  {
    "headline": "Petrol subsidy spend equals nearly half of reported 2021 tax income",
    "summarized_story": "Analysts at the World Bank in a recent report said fiscal pressures have increased for Nigeria as higher petrol subsidy costs cut revenues, urging bold reforms to boost income.\nAlso, petrol subsidy is encouraging petrol smuggling outside Nigeria’s borders.\nAfrica’s biggest oil producer, unlike other countries, does not charge VAT for petrol, a development that denies the country valuable revenue.\nAnalysts at the Economist Intelligence Unit (EIU) said the Nigerian government is unlikely to remove petrol subsidy until after the general elections in 2023 despite the Petroleum Industry Act abolishing the practice.\nThe EIU noted that it may take a new government to finally end petrol subsidies forced by deteriorating fiscal conditions."
  },
  {
    "headline": "Nigeria returns to top Africa oil producer position in December, hits 1.28mb/d",
    "summarized_story": "Nigeria has returned to its former spot as Africa’s top oil producer surpassing Libya, according to the latest Organisation of Petroleum Exporting Countries (OPEC) report released on Monday.\nLast month, Nigeria lost its Africa’s top oil producer status to Libya as its crude oil production fell further amid lingering supply disruptions, according to the monthly report released by the Organisation.\nOPEC uses secondary sources to monitor its oil output, but also publishes a table of figures submitted by its member countries.\nNigeria recorded the biggest increase in output in November among its African peers in OPEC, which put the country after Iraq, based on Secondary sources.\nAccording to secondary sources, crude oil output increased mainly in Saudi Arabia, Iraq and Nigeria, while production in Angola, Libya and Congo declined."
  },
  {
    "headline": "Edo NEWMAP to leverage tech in waste management, test runs new app – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Nigeria Erosion and Watershed Management Project in Edo State (Edo NEWMAP) is test running a plastic redemption application to assist in dealing with the threat posed by plastic waste clogging stormwater drains and natural moats.\nThe State Coordinator of Edo NEWMAP, Dr. Tom Obaseki, who revealed this at a one-day workshop on ‘Advancing Sustainable Plastic Waste Management in our Cities,’ said that the greatest threat to the sustainability and integrity of the functionality of NEWMAP infrastructure in the state is waste, particularly, plastic clogging the newly constructed stormwater drains and underground conduits.\nThe workshop is organized by the Circular Economy Club (CEC) of Abuja and Benin City, in partnership with Edo NEWMAP.\nPresenting the mobile application to key stakeholders, the Edo NEWMAP Coordinator explained that, when fully deployed, the plastic redemption scheme technology will help safeguard and make functional stormwater infrastructure provided by the government, while at the same time presenting opportunities for interested persons to make money from disposing of plastic waste.\nParticipants at the event include Chairman, Technical Steering Committee of Edo NEWMAP, Mr. Lucky Wasa, who is also the Permanent Secretary, Ministry of Environment and Sustainability; Managing Director, Edo State Investment and Promotion Office (ESIPO), Mr. Kelvin Uwaibi; General Manager, Edo State Waste Management Board, Mr. Charles Imarhiagbe and the Chief Executive Officer, Natural Eco Capital, Dr. Eugene Itua, among others."
  },
  {
    "headline": "Shippers Council Deteriorating, Due To New Boss Uncare Attitude-MWUN – Nigerian Observer",
    "summarized_story": "Hassan Bello, the immediate ES/CEO of the Council retired from service.\nAdeyanju said: “This development explains the issue I am raising about the new man at the Shippers’ Council who is not meeting with stakeholders.\n“We, however, wrote to the new man at the Shippers’ Council over the incident, but no response.\nI am talking about Alhaji Hassan Bello the former Executive Secretary, Nigeria Shippers’ Council.\n“To us at MWUN we don’t know if the Executive Secretary of Nigerian Shippers’ Council has been changed, all we know is that Hassan Bello is on leave and that is my word."
  },
  {
    "headline": "Edo explores opportunities in fashion industry, opens booth for designers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, through the state’s skills development agency, Edojobs has launched a fashion and style corner to aggregate designers and other lovers of fashion in the state.\nThe fashion booth was set up by the state government, in collaboration with GIZ’s Skills Development for Youth Employment (SKYE) programme, to create job opportunities for the state’s teeming youth population and tap into the huge opportunities in the fashion and design sector.\nA director in Edojobs, Mr. Omole Niyi, who performed the inauguration at the Edo Innovation Hub, said the booth was a platform to gather, train and empower youths interested in garment production.\nWe have a garment production factory where youths who are interested in fashion can come in and learn.\nWe expect that after six months, the trainees should be able to make garments and earn money for themselves.”..."
  },
  {
    "headline": "Benin Monarch Receives Deed of Transfer of Returnd Artifacts As he marks 5th Coronation Anniversary – Nigerian Observer",
    "summarized_story": "The Oba, however, commended President Muhammadu Buhari, for directing the return of the recently retrieved Benin artifacts to the rightful place, adding that many of the artefacts transcend mere art and are objects of religious significance to the Benin Kingdom.\n“I am happy to welcome you all to the 5th anniversary of my ascension to the throne of my forefathers as the 40th Oba of Benin in a continuous dynasty which dates back to 1170.\n“The celebration of this my 5th coronation anniversary coincides with a major event.\nToday (yesterday) we have in our midst the Nigeria High Commissioner to the United Kingdom, Ambassador Sarafa Tunji Isola.\n“I am here With the support of my ancestral, to sign the relevant Deed of Transfer on behalf of my people."
  },
  {
    "headline": "Buhari nominates Muazu Sambo as power minister, to replace sacked Saleh Mamman",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari, has nominated Mr Muazu Sambo, from Taraba State, as a minister-designate to replace former Minister of Power, Sale Mamman, who was sacked in September, along with Sabo Nanono, ex-agriculture minister.\nThe president said that his action is in accordance with Session 147 (2) of the Constitution of the federal republic of Nigeria 1999 as amended.\nThe letter reads: “In accordance with session 147(2) of the Constitution of the Federal Republic of Nigeria 1999 as amended.\n“I write in honour to forward for confirmation by the Senate the nomination of Muazu Jaji Sambo from Taraba State as Minister of the Federal Republic of Nigeria.\nPlease accept Distinguished Senate President the assurances of my highest regard.”"
  },
  {
    "headline": "‘Don’t think about it’ – Northern Christian Elders reject idea of Muslim-Muslim ticket in 2023",
    "summarized_story": "Christian elders in Northern Nigeria under the aegis of Northern States Christian Elders Forum (NOSCEF) have rejected the idea fielding a Muslim presidential and vice presidential candidates in 2023, describing it as insensitive and selfish.\nLet us recall the Chief Abiola Alhaji Kingibe Muslim-Muslim ticket that won the election in a military imposed two-party system in 1993.\nEkwueme (South East) ruled Nigeria and Abiola/Kingibe therefore, meant power shifting between North and South and in the North, power shifting from North West to North East and in the South, from South West to South East.\n“Therefore, the same injustice, inequity, marginalization that Nigerians fought against to vote a Muslim–Muslim ticket cannot now be promoted by voting same Muslim-Muslim or Christian- Christian ticket,” it said.\n“Linking it with the North West, would remind observing Nigerians, who have seen how a similar insensitivity has deepened the divide and mistrust in the North West state,” they pointed out."
  },
  {
    "headline": "Court adjourns till December 21 to hear pending applications on Paris Club refund",
    "summarized_story": "A federal high court in Abuja has on Monday adjourned till December 21 to hear pending applications in a suit by the 36 state governors against the federal government over the $418 million Paris club refund.\nThe judge adjourned after the matter after counsel to parties have argued the plaintiff’s application for interlocutory injunction.\nThe matter was earlier adjourned for Monday to take the motion on notice for an interlocutory injunction made by the plaintiffs.\nMs Lami-Shiru urged the court to discountenance the plaintiff’s application and set aside its earlier order.\n“In the absence of jurisdiction, the court will be acting in futility no matter how well a proceeding is conducted."
  },
  {
    "headline": "Nigerian govt revenue falls by 52% in August – CBN report",
    "summarized_story": "Nigeria’s federal government recorded a fiscal deficit of N405.28bn in August, according the economic report of the Central Bank of Nigeria (CBN).\nAccording to the report, the government’s aggregate expenditure was N781.61bn while retained revenue stood at N376.33bn, even as independent revenue fell by 52.2 per cent in August which led to a 10.4 per cent decline in government’s retained revenue from N420.2bn in July.\nSignificant decline in independent revenue sources reflected lower remittances from ministries, departments, and agencies and government business interests,” the report said.\nIt said the aggregate expenditure fell by 18.8 per cent from N962.1bn recorded in July due to a reduction in overhead cost and low capital expenditure.\nThe report said, “Although recurrent expenditure shrunk by 18.3 per cent to N683.46bn following a 48.9 per cent decline in overhead cost, it maintained its dominance in total spending."
  },
  {
    "headline": "N13m, N8m quarterly allowances not enough for lawmakers – Lawan",
    "summarized_story": "Senate President Ahmad Lawan yesterday spoke on the controversy over salaries and allowances of members of the National Assembly.\nHe said contrary to allegations of “jumbo pay,” the National Assembly is grossly underfunded in Nigeria compared to other presidential democracies.\nOn the National Assembly budget, Lawan said: “This is perhaps one of the most persistent and vexatious issues that has dented the image of the National Assembly in Nigeria, with widespread presumptions that the budget of the National Assembly is not known.\nIn 2015/2016 and 2019 however, the aggregate allocation to the National Assembly dropped to N120billion and N115billion respectively.\n“In view of the size of Nigeria as well as that of the National Assembly but more importantly, the broad mandates conferred on the National Assembly by the 1999 Constitution, the National Assembly is, in fact, grossly underfunded.”Lawan noted that another issue that has contributed to the poor perception of the National Assembly is salaries and allowances of the legislators."
  },
  {
    "headline": "N13m, N8m quarterly allowances not enough for lawmakers – Lawan",
    "summarized_story": "Senate President Ahmad Lawan yesterday spoke on the controversy over salaries and allowances of members of the National Assembly.\nHe said contrary to allegations of “jumbo pay,” the National Assembly is grossly underfunded in Nigeria compared to other presidential democracies.\nOn the National Assembly budget, Lawan said: “This is perhaps one of the most persistent and vexatious issues that has dented the image of the National Assembly in Nigeria, with widespread presumptions that the budget of the National Assembly is not known.\nIn 2015/2016 and 2019 however, the aggregate allocation to the National Assembly dropped to N120billion and N115billion respectively.\n“In view of the size of Nigeria as well as that of the National Assembly but more importantly, the broad mandates conferred on the National Assembly by the 1999 Constitution, the National Assembly is, in fact, grossly underfunded.”Lawan noted that another issue that has contributed to the poor perception of the National Assembly is salaries and allowances of the legislators."
  },
  {
    "headline": "Owners count losses as phone, laptop shops razed in Computer Village fire",
    "summarized_story": "Fire has razed a shopping complex in the popular Computer Village in Ikeja, Lagos.\nThe fire, which started in the early hours of yesterday, destroyed many shops where phones, laptops and other electronic gadgets worth millions of naira were sold.\nPolice spokesman Adekunle Ajisebutu confirmed the incident in a statement, saying that firefighters had been mobilised to the area.\n–“There was a fire incident at 18, Otigba Street, Computer Village, Ikeja, which engulfed a shopping complex,” Ajisebutu said.\nHowever, valuable property whose estimates were not yet known were destroyed.” NationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Owners count losses as phone, laptop shops razed in Computer Village fire",
    "summarized_story": "Fire has razed a shopping complex in the popular Computer Village in Ikeja, Lagos.\nThe fire, which started in the early hours of yesterday, destroyed many shops where phones, laptops and other electronic gadgets worth millions of naira were sold.\nPolice spokesman Adekunle Ajisebutu confirmed the incident in a statement, saying that firefighters had been mobilised to the area.\n–“There was a fire incident at 18, Otigba Street, Computer Village, Ikeja, which engulfed a shopping complex,” Ajisebutu said.\nHowever, valuable property whose estimates were not yet known were destroyed.” NationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "BREAKING: National Security Adviser Names Groups Backing Terrorist Organisations",
    "summarized_story": "The National Security Adviser (NSA), Major General Babagana Monguno (rtd), has identified Jama’at Nasr al-Islam Wal Muslimin (JNIM), the Islamic and Muslim Support Group (GSIM), and ISGS as groups bolstering terror activities in Nigeria and other Sahel countries.\nThe NSA urged Islamic preachers and Imams to deploy their vantage positions to canvas support for ongoing counter-terrorism operations.\nHe observed that alliances between the clerics and security forces “should be the backbone to rebuilding our terrorism infested communities”.\nThe NSA spoke at the 14th Workshop of the League of Ulamas, Preachers, and Imams of Sahel countries in Abuja.\n“In that regard, it is imperative that Ulamas, Preachers, and Community Leaders in your localities key in to support efforts of our Security Forces, in order to end this menace."
  },
  {
    "headline": "BREAKING: Olowu Of Owu Kingdom, Oba Dosunmu, Is Dead",
    "summarized_story": "Oba Adegboyega Dosunmu Amororo II, the Olowu of Owu Kingdom, has died.\nChief Olusegun Obasanjo, a former Nigerian President, is from Owu and is the Balogun of Owu kingdom.\n“Baba (Oba Dosunmu) is dead, he died yesterday.\nIn July 2005, Oba Dosunmu ascended to the throne.\nIn 1956, Oba Dosunmu enrolled at King’s College in Lagos, and in 1963, he was accepted to Hendon College of Technology in London to study Drama and Television Production."
  },
  {
    "headline": "BREAKING Mother Of Governor Yahaya Bello’s Chief Of Staff Kidnapped In Kogi",
    "summarized_story": "Gunmen kidnapped the mother of Governor Yahaya Bello’s Chief of Staff, Adewale Omofaiye, a few weeks after the Kogi State Commissioner for Environment, Adewale Omofaiye, survived kidnapping.\nMadam Seriya Raji was abducted at her home in the Nagazi area of Okene, Kogi State, around 8 p.m. on Monday, according to sources.\nThe Kogi commissioner, Omofaiye, was attacked in the final week of November between the Ikoyi and Iyara districts of the state and escaped with injuries.\nThree people were in the car when they were allegedly kidnapped and assaulted by the accused kidnappers.\nDuring the raid, some motorists were reportedly kidnapped and taken to the bush."
  },
  {
    "headline": "Buhari Has Done His Best, Don’t Expect Anything More — Obasanjo To Nigerians",
    "summarized_story": "Former President Olusegun Obasanjo has suggested that Nigerians should not expect anything more from President Muhammadu Buhari, despite the country’s issues.\nBuhari has done his best, according to Obasanjo, so expecting more from him is like pounding a dead horse.\nNigerians should be concerned about the post-Buhari era, not what is expected of him, according to Obasanjo.\nAccording to Obasanjo: “The truth is this: President Buhari has done his best.\nBuhari has done his best."
  },
  {
    "headline": "Revealed! How Elephantiasis killed governor’s mother in Lagos",
    "summarized_story": "Senator Oluremi Tinubu (APC Lagos Central) disclosed in Abuja, Monday, that Elephantiasis, one of the 14 Neglected Tropical Diseases (NTDs), prevalent in Nigeria, killed mother of a one day governor in Lagos state years back .\nThe diseases, according to them are Lymphatic Filariasis (Elephantiasis), Soil Transmitted Helminthiasis (STH), Onchocerciasis (River blindness), Trachoma (Granular Conjunctivitis) and Schistosomiasis (Bilharzia).\n“Though many of these diseases are not prevalent in Lagos State as they are, in other parts of the country but a mother of one of the one day Governors in the state, died of Elephantiasis.\nThis will go a long way to alleviating the sufferings of Nigerians afflicted by the diseases in one way or the other,” he said.\nGovernment alone he explained, cannot do it all as corporate organisations need to join in the campaign of eliminating the diseases largely domiciled in rural areas."
  },
  {
    "headline": "Finance bill: More taxes coming 2022, FG proposes",
    "summarized_story": "With the 2021 Finance Amendment Bill currently before the National Assembly, Nigerians and business owners may be in for payment of additional taxes if the proposal sails through.\nAmong others, President Buhari, in the letter, said the Finance Bill would guide the implementation of the yet-to-be passed 2022 Appropriation Act.\nThe minister said a couple of “reforms and amendments” were recommended in the draft 2021 Finance amendment bill, hinting that more would be added mid 2022.\n”Our aspiration is to do a midterm review with a possibility of another Finance Bill in mid-year 2022 to bring in more amendments,” she said.\nGovernor Sanwo-Olu, who was represented by Commissioner for Finance Dr. Rabiu Olowo, also stressed the need for the yearly enactment of the Finance Act to align it with the current economic realities."
  },
  {
    "headline": "Gunmen abduct Kogi Chief of Staff’s mother",
    "summarized_story": "Some gunmen Monday evening abducted the mother of Chief of Staff to Kogi state Governor Pharmacist Abdulkarim Jamiu Asuku at her residence in Adavi local government area of the state.\nThe incident is one out of several others that occurred in the state in the last one month.\nA resident of Inese/Ovakere new layout in Nagazi community, Adavi LGA where the mother of the chief of staff Mrs Seriya Raji resided, told our correspondent that the gunmen storm her residence at about 7:40p.m shortly after she observed her Ishai prayer in a mosque within the house.\nThe abductors, according to the source, were six in number, dressed in black suites with masks holding Ghana Must Go bag suspected to have contained some guns and other dangerous weapons.\nHe said they entered her house through the mosque and whisked her away to a yet- to-be identified destination in the car they came in."
  },
  {
    "headline": "Nine Locals Killed, Four Injured As Gunmen Attack Plateau Village",
    "summarized_story": "Nine locals were killed and four others injured on Sunday when gunmen attacked Pinau village in Wase Local Government Area of Plateau State.\nConfirming the incident on Monday, the Police Public Relations Officer in Plateau, Gabriel Ubah, said police operatives and other security personnel were swiftly deployed to the village in Mavo Chiefdom.\nHe revealed that eight suspects have been arrested in connection with the attack and 12 motorcycles were recovered from the assailants.\nREAD ALSO: Benin Kingdom Takes Legal Possession Of Repatriated Bronzes“Yesterday, at about 4:30 p.m., we received a distress call that yet-to-be-identified gunmen invaded Pinau Village in Wase Local Government Area.\nAccording to him, the attack is coming at a period when the people are striving hard to earn their means of livelihood."
  },
  {
    "headline": "Gunmen Abduct Mother Of Kogi Governor’s Chief Of Staff",
    "summarized_story": "Gunmen have abducted the mother of the Chief of Staff to Governor Yahaya Bello, Abdulkarim Asuku, in Kogi State.\nThe victim, Mrs Seriya Raji, was reported to have been abducted from her residence on Monday evening at Inese/Ovakere New Layout in Nagazi community.\nNagazi community is located in Adavi Local Government Area of the state.\nThe source said they entered the victim’s house through the mosque and whisked her away to an unknown destination, using the car they brought for the operation.\nAs of the time of filing this report, the abductors have yet to make any contact with the family of their victim."
  },
  {
    "headline": "MTN, Mafab Emerge Winners Of Nigeria’s 5G Spectrum Auction",
    "summarized_story": "MTN Nigeria Plc and Mafab Communications Ltd have emerged the two successful winners of the 3.5 gigahertz (GHz) spectrum auction for the deployment of Fifth Generation (5G) technology to support the delivery of universal broadband services in Nigeria.\n“Three companies, namely MTN, Airtel, and Mafab Communications Limited, had qualified for the auction, having met the requirements stipulated in the Information Memorandum (IM) for the spectrum auction,” he said.\nAt this point, Airtel had dropped off from the race having posted a lower exit bid, thus leaving Mafab and MTN as winners of the two available lots.\n“It is my pleasure to announce that at the end of the auction, Mafab Communications Limited and MTN Communications Nigeria Limited emerged as provisional licence winners,” the NCC chief declared.\n“MTN Communications Nigeria Plc made an offer of $15,900,000 for the assignment of a preferred Lot, while Mafab Communications Limited made an offer of $11,120,000 for a preferred Lot,” Danbatta said."
  },
  {
    "headline": "COVID-19 Red List: Nigeria Has Initiated Steps To Overturn Decision – FG",
    "summarized_story": "﻿Nigeria has initiated diplomatic steps to reverse the country’s inclusion into a red list by some nations.\nThe Minister of Aviation, Hadi Sirika, who represented the Chairman of the Presidential Steering Committee (PSC) on COVID-19, Boss Mustapha, stated at an emergency briefing by the committee on Monday.\nThe minister promised that the PSC will reveal the next line of action on Monday, 20th December.\nAccording to him, so far, the death toll from COVID-19 in the country has been below 3,000.\nSirika added that Nigeria is yet to receive a letter circulating on social media and indicating a revised travel restriction update purportedly from the UAE."
  },
  {
    "headline": "Fani-Kayode Challenges Court’s Jurisdiction To Hear Alleged Forgery Case",
    "summarized_story": "The arraignment of a Former Minister of Aviation, Femi Fani-Kayode, before Justice Oluwabunmi Abike-Fadipe of the Special Offences Court in the Ikeja area of Lagos was stalled on Tuesday.\nThis is because the former Minister challenged the jurisdiction of the court to hear the charge.\nHis lawyer, Wale Balogun told the court that the offence could not be tried in Lagos.\nREAD ALSO: Benin Kingdom Takes Legal Possession Of Repatriated BronzesThe court then fixed its ruling to Friday, December 17.\nIn count one, the EFCC alleged that Mr Fani-Kayode on or about the 11th of October 2021 in Lagos fraudulently procured one Dr. Ogieva Oziegbe to issue the fake medical report."
  },
  {
    "headline": "How to explore Tourism Potential In Kogi",
    "summarized_story": "How to explore Tourism Potential In Kogi"
  },
  {
    "headline": "Gov Akeredolu swear-in new Commissioners, Special Advisers, DG -",
    "summarized_story": "Ondo State Governor, Oluwarotimi Akeredolu, on Monday, swore-in all the 14 newly appointed Commissioners who were recently confirmed by the State House of Assembly.\nThe Governor also inaugurated seven Special Advisers and the Director-General of the Performance and Project Implementation Monitoring Unit (PPIMU).\nPresent at the event are the wife of the Governor, Chief Betty Anyanwu-Akeredolu; the Deputy Governor, Hon.\nThe new Commissioners are; Mrs Bamidele Ademola Olateju – Akoko South East; Otunba Adefarati Adegboyega – Akoko South West; Rt.\nThe Special Advisers include: Chief (Dr) Victor Ategbole; Dr. (Mrs) Wunmi Ilawole; Barr Tobi Ogunleye; Dr. Jibayo Adeyeye; Mrs Olamide Falana; Dr ."
  },
  {
    "headline": "PDP National Chairman receives Ortom in Gboko",
    "summarized_story": "The National Chairman of the People’s Democratic Party, PDP, Dr Iyorchia Ayu receives Governor Samuel Ortom and his wife, Eunice Ortom and other members of his entourage at for a decamping ceremony in Gboko.\nBenue State Deputy Governor, Engr Benson Abounu, Senators Gabriel Suswam, Orker Jev and Abba Moro, Members of the House of Representatives, Speaker and Members of the Benue State House of Assembly, State Working Committee of the PDP and other top government officials from the state were also present."
  },
  {
    "headline": "Israeli PM, Bennett, meets Abu Dhabi Crown Prince, Zayed -",
    "summarized_story": "Israeli Prime Minister Naftali Bennett’s office has disclosed that he has met with Abu Dhabi Crown Prince Sheikh Mohammed bin Zayed at his private palace in Abu Dhabi.\nThis is the first official visit of an Israeli Prime Minister to the United Arab Emirates and is coming 15 months after the signing of a normalization agreement between the two countries.\nBennett had highlighted growing trade ties between his country and the UAE in an interview with WAM, the Emirates’ state-run news agency.\nHe did not however mention in the agency’s write-up of the interview tensions with Iran.\nBut the interview made only the slightest possible nod in that direction, writing: ‘On the UAE’s efforts to enhance international cooperation for facing common challenges, the Israeli Prime Minister stressed, “the values of tolerance, peace and dialogue are common, and that is why the friendship that unites us developed at such a high speed.”‘"
  },
  {
    "headline": "Air Force Discharges 27 for Refusal to Get Covid Vaccine",
    "summarized_story": "The Air Force gave its forces until Nov. 2 to get the vaccine, and thousands have either refused or sought an exemption.\nAir Force spokeswoman Ann Stefanek said Monday that these are the first airmen to be administratively discharged for reasons involving the vaccine.\nEach of the services set its own deadlines and procedures for the mandate, and the Air Force set the earliest deadline.\nAccording to the latest Air Force data, more than 1,000 airmen have refused the shot and more than 4,700 are seeking a religious exemption.\nAs of last week, a bit more than 97% of the active duty Air Force had gotten at least one shot."
  },
  {
    "headline": "Nigerian Governors Working to Scuttle Electoral Reform, Lobby Buhari Not to Sign Electoral Bill",
    "summarized_story": "According to THISDAY findings, “The 36 governors want to ensure that they continue to collect local government allocations, which they mismanage.\n“Now, these governors are moving to scuttle the electoral process for their own selfish gains.\nAlso, Nwankwo said Buhari would be doing colossal damage to whatever legacy he might leave behind if he failed to heed the yearnings of Nigerians and sign the Electoral Bill into law.\nThe CDD Director, Idayat Hassan, in a statement in Abuja, also called on President Buhari to sign into law the Electoral Bill 2021, saying this was necessary to represent the most significant legacy of his presidency.\nCDD believes that the next critical step that must be taken is for the assenting into law, the Electoral Bill 2021."
  },
  {
    "headline": "Nigeria Rakes in Fresh $547m as MTN, Mafab Win 3.5GHz Spectrum Auction",
    "summarized_story": "The three eligible bidders that participated at the mock and main auctions, were MTN Nigeria, Mafab Communications and Airtel Networks Limited.\nAt the end of round two, the Auction Manager, again, increased the bid price to $204, 288,256.1 million for the commencement of round three.\nAt the end of round three, the bid price for one lot of the 3.5GHz Spectrum was increased to $215,782,901.38 at the beginning of round five.\nThe main stage auction eventually ended at about 7.22pm with round eleven, with a winning bid price of $273,600,000 million.\nAccording to Danbatta,” The 3.5GHz spectrum auction represents a culmination of all the efforts at the international and national levels that have prepared Nigeria tor this momentous leap toward."
  },
  {
    "headline": "Oba of Benin Appoints Soyinka, Obaigbena as Trustees of Proposed Benin Royal Museum – Arise News",
    "summarized_story": "The Oba of Benin, Omo N’Oba N’Edo Uku Akpolokpolo, Oba Ewuare II, has appointed the Chairman, THISDAY Group and ARISE News Channel, Prince Nduka Obaigbena; Nobel Laureate, Prof. Wole Soyinka; and Prof. Peju Layiwola as Trustees of the proposed Royal Museum in Benin.\nOther trustee members included Aigboje Aig-Imoukhuede; former Chairman of Federal Inland Revenue Services (FIRS), Mrs. Ifueko Omoigui-Okauru; Chief Greg Ero, Mr. Daniel Inneh among others.\nAdibe Emenyonu in Benin City"
  },
  {
    "headline": "Nigeria’s Oil Production Stages Recovery, Overtakes Libya",
    "summarized_story": "Last month, Nigeria lost its top oil producer status in Africa to the North African country, as its crude oil production continued to fall mainly due to ageing upstream infrastructure.\nIn same month, Nigeria’s oil output fell to about 1.23 million barrels per day from about 1.25 million bpd the previous month, with Libya, which overtook Angola as the second-biggest producer on the continent in December last year, seeing its oil production rise to 1.24 million bpd.\n“According to secondary sources, total OPEC-13 crude oil production averaged 27.72 mb/d in November 2021, higher by 0.29 mb/d month-on-month.\nCrude oil output increased mainly in Saudi Arabia, Iraq and Nigeria, while production in Angola, Libya and Congo declined,” the report stated.\nFor the full-year 2022, OPEC forecast global demand will average 100.79 million bpd, while 2021 demand will come in at 99.63 million bpd."
  }
]