[
  {
    "headline": "101 robbery convicts, suspects, 23 rapists among Oyo fleeing inmates",
    "summarized_story": "About 101 accused who were arrested for alleged armed robbery are among the inmates that escaped from the Medium Security Custodial Centre in Oyo town, Oyo State.\nRecall that hundreds of inmates escaped from the facility when some hoodlums invaded the correctional centre.\nOur correspondent noted that the data of 200 inmates were released as the ministry warned members of the public against offering any forms of assistance to the fleeing inmates.\nA note written beside the data of the 200 fleeing inmates read, “Names and faces of wanted persons, who escaped from the Oyo Custodial Centre on Friday 22nd October, 2021.\nAregbesola, who is a former Osun State governor, had said, “We are going after every single inmate that escaped from custody."
  },
  {
    "headline": "Security agents rescue expatriate in Bayelsa, one kidnapper killed",
    "summarized_story": "The Bayelsa State Police Command said on Saturday that security operatives had rescued a foreign national, who was abducted by a gang of gunmen at a construction site along the Igbedi-Amassoma Road in the state.\nThe police, in a statement by the spokesman for the command, Asinim Butswat, said the security personnel guarding the construction site killed one of the kidnappers.\nButswat said the expatriate was rescued unhurt by a combination of joint task force, including Navy and Army operatives around the Ogboibiri waterways, but did not disclose the identity and country of the victim.\nHe said, “The kidnappers escaped with varying degrees of bullet wound.\nEfforts are being intensified to arrest the fleeing kidnappers.”Copyright PUNCHAll rights reserved."
  },
  {
    "headline": "Seek innovative solutions to Nigeria’s challenges, Unilag Muslim Alumni tells govt",
    "summarized_story": "These challenges, regrettably, are mutually reinforcing with one aggravating the other and thus undermining the efforts to address them.\nWhilst we call on governments at all levels to double up the efforts and seek innovative solutions, we urge Nigerians not to give up on the Nigerian project.\nHe promised that the UMA will continue to be actively involved in shaping the polity and in the search for solutions to our national challenges.\nUMA salutes this category of trail blazing youth and urges others not to be discouraged by the current challenges in the environment.\nHighlights of the event was the unveiling of the new logo of the association by the Vice Chancellor, Prof Oluwatoyin Ogundipe."
  },
  {
    "headline": "Oyo APC crisis deepens as Ex-commissioner, Omodewu emerges party Chairman",
    "summarized_story": "They alleged that a serving senator and a former governor are responsible for the falsification of the delegates’ list in circulation.\nSpeaking on behalf of other party leaders, Senator Adeseun stated that some people have inserted fake delegates into the list.\nIf they use the falsified delegates list to hijack party structure, can they use the same approach to win in the general elections?\n“Party members and leaders in Oyo State are vehemently kicking against using such delegates’ list to conduct the state congress.\n“We are using this medium to appeal to the national leadership of our party, the suffering in Oyo State is too much."
  },
  {
    "headline": "FCTA pledges continuous support for orphans, vulnerable",
    "summarized_story": "The Federal Capital Territory Administration (FCTA) on Saturday, has pledged continuos support for orphans and the vulnerable in the FCT.\nRepresented by Mrs Grace Adayilo, Director, Gender Department, FCTA, the minister said that the administration would continuously interrogate issues of welfare that concern orphans and the vulnerable children.\nAccording to her, if you don’t empower the children today, the ideas we live and die for, will have no future and fruition.\nPromotion of more equitable balance in workloads and in the sharing of economic and social benefits between the orphans and vulnerable children and every regular child in the society.\n“We have taken into cognizance that, empowering the orphans and vulnerable children, economically and socially shall bring about socio-equity, particularly in their communities and Nigeria generally."
  },
  {
    "headline": "17 rescued as boat capsizes in Lagos",
    "summarized_story": "File photo: INEC ad hoc staff afloat after a boat mishap in Ilaje area of Ondo State..as LASWA warns ferry operatorsBy Bose AdelajaBarely a month after a ferry passenger boat capsized in Lagos Island enroute Ikorodu, another boat with 17 passengers on board has capsized on Saturday.\nThe incident reportedly occured 20 minutes after the privately owned boat identified as GT Water Line 4 took off at Ebute-Ero enroute Ikorodu Terminal at about 5.15pm.\nThe Lagos State Waterways Authority LASWA, who confirmed this in a statement signed by its General Manager, Oluwadamilola Emmanuel said the boat left Ebute-Ero at about 5.15pm with 17 passengers onboard including 14 males and 3 females.\nHe said LASWA Patrol team and some other boat operators were swift to respond to the distress call from the boat thereby rescuing all 17 passengers onboard including 2 minors.\n“The boat and it’s captain have been taken to custody for further investigation to unravel the cause of the accident and necessary actions."
  },
  {
    "headline": "Alleged land grabbing: Enugu community exonerates former governor",
    "summarized_story": "The Amechi Awkunanaw Community in Enugu South Local Government Area of Enugu State has faulted allegations of land grabbing made against former governor of Old Anambra, Sen. Jim Nwobodo.\nHe also said there was no land dispute involving the community which had degenerated to arson, contrary to what Egbo had made some people to believe.\n“As a community, we do not have any land dispute with Nwobodo because the said land was a gift by the community to him over 40 years ago.\n“We do not understand the link between the purported burning of a car belonging to a certain lecturer and a land dispute involving Nwobodo.\nWhen contacted, Egbo accused the executive members of the town union of resorting to violence over a land dispute in the community."
  },
  {
    "headline": "FG to implement five percent job opportunities for persons living with disabilities",
    "summarized_story": "Minister of Labour, Employment and Productivity, Dr. Chris Ngige has revealed that the Federal Government is ready to implement the five per cent job opportunities for persons living with disabilities.\nThe minister stated this on Saturday in Abuja while marking the 16th year anniversary of KPAKPANDO foundation, a non-governmental organisation catering for issues relating to the less privileged and persons living with disabilities in Nigeria.\nHe said the Federal Government is not taking the Persons living with disabilities Act, which was passed and signed into law in 2019, for granted, hence, a service-wide circular will be issued to all the ministries and parastatals by next week calling for the implementation of the policy.\nHe added that the state has also set up an ultra-modern center for people with disabilities.\nHe commended the efforts of the Foundation for keeping the hope of people living with disabilities alive and working hard on the objectives of programs of the foundation especially in achieving the five percent employment inclusion."
  },
  {
    "headline": "ISWAP procures military uniforms from Libya ahead of December attacks",
    "summarized_story": "The Islamic State’s West Africa Province (ISWAP) has reportedly ordered military uniforms from Libya.\nOne of the commanders is said to have mentioned the purchase ahead of planned attacks in December.\nGamboru-Ngala and Ruwa Misa in the south of Lake Chad axis are two routes already identified.\nOne of their decoys is using military fatigues to disguise as government forces to abduct civilians, attacks troops’ checkpoints and bases.\nMagashi, Chief of Defence Staff Leo Irabor, Service Chiefs and Chief of Defence Intelligence were at the Joint Task Force North-East Operation HADIN KAI Headquarters in Borno."
  },
  {
    "headline": "DSS not sponsoring Biafra National Guard to enforce sit-at-home order – Army",
    "summarized_story": "The Nigerian Army has debunked speculations that the Directorate of Military Intelligence (DMI) and the Department of State Service (DSS) created and funded the Biafra National Guard (BNG) to enforce the sit-at-home order, in a bid to discredit the Indigenous People of Biafra (IPOB).\nIt claimed Kalu Odinakachi is responsible for the “mischievous submission”.\nA statement signed by Brigadier General Onyema Nwachukwu, the Director, Army Public Relations, sent to DAILY POST on Saturday read in part: “It must be abundantly clarified that this spurious allegation is unfounded and could be absolutely described as a hoax.”It added that “the activities of IPOB/ESN have undoubtedly assumed a violent dimension.\n“Their wild allegation that BNG and UGN were an overt operation by the DMI and DSS is not only laughable but remains largely elusive and a ploy to diminish the public support the NA is savouring in the ongoing exercises.”The Nigerian Army assured the people of the South East that they will step up efforts to “to rid the region of criminal elements masquerading as BNG and UGM.\nWe encourage members of the public to provide actionable information to security agencies as the Exercises progress.”Biafra National Guard loots shop, filling station, declares war from October 30"
  },
  {
    "headline": "Orji Kalu condemns invasion of Justice Odili’s residence",
    "summarized_story": "The Chief Whip of the Nigerian Senate, Senator Orji Uzor Kalu, on Saturday condemned the invasion of the Abuja residence of Justice Mary Odili of the Supreme Court, describing the development as cruel and unhealthy for the nation’s democracy.\nKalu insisted that the rule of law must be strictly observed in circumstances like that for the sake of national progress and development.\nHe called on the Federal Government to bring perpetrators to book, adding that unlawful invasion of a citizen’s residence is against the constitution of Nigeria and tenets of democracy.\nHe said, “the invasion of the residence of Justice Mary Odili of the Supreme Court in a Gestapo manner is totally condemnable and unacceptable in a democratic dispensation.\nSupreme Court Justice, Mary Odili’s home under siege; EFCC denies responsibility"
  },
  {
    "headline": "FG denies paying N80,000 to survival fund beneficiaries",
    "summarized_story": "The Federal Government has warned Nigerians to be wary of fraudulent messages making the rounds over the purported payment of N80,000 to beneficiaries of the Survival Fund Scheme.\nIt stressed that the Steering Committee of the MSMEs Survival Fund and the Guaranteed Off Take Stimulus Scheme headed by the Hon Minister of State, Industry, Trade and Investment, Amb.\nMaryam Katagum, was unaware of the fraudulent collation of account details.\n“The procedure for the implementation of all tracks of the survival fund and guaranteed off-take stimulus scheme does not require the public display of account details to individuals or groups.\n“The amount given to beneficiaries remain N30,000 and N50,000 for Payroll Support; N30,000 for Artisans and Transport Grants; N50,000 for the General MSMEs Grant; and N100,000 per MSME for the guaranteed off-take stimulus scheme."
  },
  {
    "headline": "Onyemelukwe-Onuobia wins $100,000 NLNG literature prize",
    "summarized_story": "Cheluchi Onyemelukwe-Onuobia’s ‘The Son Of The House’ has won the $100,000 Nigeria Prize for Literature sponsored by Nigeria LNG Limited for the 2020/2021 cycle on Prose.\nChair of the Advisory Board for the Prize, Prof. Akachi Adimora-Ezeigbo, announced this at the Award Ceremony and Public Presentation of the winners of the 2021 edition of the three NLNG prizes at Expo Centre, Eko Hotel & Suites, Lagos.\n“But they soon realised their path had earlier crossed at various points.\nThe literary criticism prize carries a monetary value of N1 million.\nWhile it was announced that Uchechukwu Umez Uwazurike won the NImillion Literary Criticism prize, there was no winner for the $100,000 prize for Science."
  },
  {
    "headline": "PDP leaders release consensus list for national offices",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "Army releases TASUED SUG President, hand over others to EFCC",
    "summarized_story": "Army releases TASUED SUG President, hand over others to EFCCThe Army has released the Student Union President of Tai Solarin university of Education (TASUED) Sodiq Ridwan.\n- Advertisement -The protest started few minutes after some Army operatives started searching students moving in different cars along Conoil Filling Station, Ijagun, Ijebu Ode.\nThe National President of the National Association of Nigerian Students (NANS), Asefon Sunday, confirmed the release of Ridwan to The Nation.\nHe informed other students arrested were accused of Fraud and subsequently moved to the office of Electronic Financial Crime Commission (EFCC) in Ibadan, capital of Oyo State.\n- Advertisement -“The President and other student officials who were arrested have been released."
  },
  {
    "headline": "PDP Convention: Delegates of five States complete voting",
    "summarized_story": "Delegate from five States have completed voting in the ongoing PDP convention as of 6:55pm.\nThe States are Abia, Adamawa, Akwa Ibom, Anambra and Bauchi.\n- Advertisement -Voting by delegates from Benue and Borno is in progress to be followed by Cross River and Delta.\nSo far, voting has been by affirmation with delegates voting to affirm consensus candidates picked by party leaders for 19 of the 21 elective positions.\nHowever, there will be proper voting for the Deputy National Chairman (North) and Deputy National Chairman (South) with two candidates contesting for two positions."
  },
  {
    "headline": "Nnamdi Kanu’s brother opens up: IPOB now in charge of Southeast",
    "summarized_story": "From Okey Sampson, UmuahiaMr Emmanuel Kanu is the brother of detained leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nHe equally accused the Southeast governors of not being sincere about the activities of Nnamdi Kanu and his group in the region.\nRecently, the Attorney General and Minister of Justice, Abubakar Malami accused the IPOB leader, Nnamdi Kanu of being responsible for the insecurity in the Southeast.\nNnamdi Kanu has said it time and again that he does not give life and will not take it.\nIf the Southeast governors were truthful and told the Presidency what is happening in the Southeast, I believe they will arrest the situation."
  },
  {
    "headline": "Ogoni: No back-door oil production resumption, MOSOP vows",
    "summarized_story": "From Tony John, Port HarcourtMovement for the Survival of the Ogoni People (MOSOP), Rivers State, has declared that it will resist any attempt by any group or company to resume oil exploitation in Ogoniland without due consultation with the natives.\nMOSOP has also called on Federal Government to strengthen its regulatory institutions and the judiciary, to strictly enforce environmental protection laws.\nUSA companies need customer service reps to work from home, hourly pay in $13 per hour, must have a quiet environment to work, internet access.Click here to apply .\nMOSOP also recommended the introduction and implementation of punitive sanctions against erring regulatory and related institutions.\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection."
  },
  {
    "headline": "Why Justice Odili’s home was raided",
    "summarized_story": "Meanwhile, the Chief Magistrate court has revoked the search warrant on the ground that it was misled into granting the order.\nThe commission enjoins the public to discountenance the report.”In the growing heat of the fallout, the Malami distanced himself from the controversial invasion of Justice Odili’s residence by security operatives.\nThe general public needs to know that there is nothing called “Joint Panel Recovery Under the Ministry of Justice” in the Office of the Attorney General of the Federation and Minister of Justice, and by extension the entire Federal Ministry of Justice.\nHe said that relevant authorities should come clean on what informed such ignoble and dishonourable behaviour and render unreserved apology to the Justice Odili and the Judiciary.\nPrince Secondus also noted that the development calls for more diligence on the part of judicial officers in responding to search warrant requests from overzealous officials of the executive."
  },
  {
    "headline": "BREAKING: Cheluchi Onyemelukwe-Onuobia wins Nigeria Prize for Literature 2021",
    "summarized_story": "By Damiete BraideCheluchi Onyemelukwe-Onuobia’s The Son of The House has won The Nigeria Prize for Literature 2021 and she went home with 100,000 USD.\nAccording to The Advisory Board for The Nigeria Prize for Literature, this year, the contest was for Prose Fiction and a total of 202 books entered for the competition.\nAll three novels on the shortlist centre on strong female characters, different unravelling circumstances and experiences of women in the modern world.\nChairperson of the prize’s Advisory Board, Professor Akachi Adimora- Ezeigbo, said the board unanimously agreed that the shortlist of 11 was an excellent list.\nShe stated that excellence was the watchword of the prize, adding that the onus was on the Advisory Board to continue in the tradition that was handed to them by the past board."
  },
  {
    "headline": "KALU CONDEMNS INVASION OF JUSTICE MARY ODILI’S RESIDENCE",
    "summarized_story": "Chief Whip of the Senate, Dr. Orji Kalu, has described the invasion of the Abuja home of Justice Mary Odili of the Supreme Court as a cruel, undemocratic and uncivilised act.\nCondemning the raid on justice’s home, Kalu called on the federal government to commence a full scale investigation into the ugly incident, adding that the unwarranted invasion of the house of the Judge was capable of causing tension in the country.\nKalu, who is former governor of Abia State, stressed that in a democratic set-up, the rule of law must be strictly adhered to for the sake of national progress and development.\nKalu called on the federal government to bring the perpetrators of the evil act to book, adding that unlawful invasion of a citizen’s residence is against the constitution of Nigeria and tenets of democracy.\nHe said: “The invasion of the residence of Justice Mary Odili of the Supreme Court in a gestapo manner is totally condemnable and unacceptable in a democratic dispensation."
  },
  {
    "headline": "PDP Convention in Photographs",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Buhari Warns against Tenure Extension Campaign, Says He’ll Leave Office in 2023",
    "summarized_story": "The President was speaking at a meeting in Makkah with a select group of Nigerians resident in the Kingdom of Saudi Arabia where he just ended a visit.\nNo “Tazarce’’ (tenure extension).”Buhari adds: “I don’t want anybody to start talking about and campaigning for unconstitutional extension.\nAt that point, nobody can steal their votes or buy them,” Buhari was quoted as saying.\nHe quoted Buhari as saying, “My problem is the North-west where people are killing and stealing from one another.\nAccording to them, “Nigerian professionals are doing well and projecting a good image of our country.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Game on as A’Court Clears PDP for National Convention",
    "summarized_story": "He also sought an order of injunction restraining the PDP from holding its National Convention.\nPDP Holds National Convention at Eagle SquareMeanwhile, 3600 delegates will converge on the Eagles Square, Abuja, to elect a new National Working Committee (NWC).\nAddressing a press conference ahead of the convention, the Chairman of the National Convention Committee, Governor Ahmadu Fintiri of Adamawa State said 21 of the 24 offices were returned on consensus basis.\nAccording to Governor Fintiri, the offices that would be contested are that of the Deputy National Chairman (South), National Auditor and National Youth Leader.\nThe former national secretary of the party, Olagunsoye Oyinlola and Ambassador Taofeek Arapaja will be contesting for the office of the Deputy National Chairman (South)."
  },
  {
    "headline": "News in Photographs: Buhari Returns to Abuja from Saudi Arabia",
    "summarized_story": "President Muhammadu Buhari has returned to Abuja from Saudi Arabia.\nBuhari departed for Riyadh, Saudi Arabia, Monday to participate in a three-day investment conference organized by the Future Investment Initiative Institute.\nIn Saudi Arabia, the President also performed the lesser Hajj and met with Nigerians before returning to Abuja on Friday evening.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Confusion as EFCC Denies Raiding Justice Odili’s Home",
    "summarized_story": "Kingsley Nwezeh in AbujaThe Economic and Financial Crimes Commission (EFCC) has denied conducting any operation in the Maitama, Abuja, home of a judge of the Supreme Court, Justice Mary Odili.\nBut a statement issued by the EFCC denied executing any search warrant at the residence of Justice Odili.\n“The commission by this statement wishes to inform the public that the report is false as it did not carry out any operation at the home of Justice Odili.\nIf there was any such operation as claimed by the media, it was not carried out by the EFCC.\nAlso in 2020, the former governor approached a Federal High Court for another injunction to stop an impending probe."
  },
  {
    "headline": "#EndSARS: Nigeria’s Central Bank, Governor Emefiele Retain Ex-Attorney-General, Aondoakaa, Others In Suit Over Harassment Of Protesters, Incompetence In Office",
    "summarized_story": "The Central Bank of Nigeria (CBN) and its governor, Godwin Emefiele, have retained a former Attorney-Attorney-General of the Federation, Mike Aondoakaa (SAN) to lead the legal team of Senior Advocates of Nigeria (SAN) in the defence of the suit against him and the bank.\nThe suit borders on Emefiele’s incompetence in office, and harassment of the #EndSARS protesters.\nHe also wants the court to also compel the CBN never to lend beyond the prescribed 5% of the previous year’s revenues.\nSaharaReporters gathered that Aondoakaa was briefed by the CBN to represent the apex bank in the matter.\n“Former AG Aondoakaa SAN, and the legal team, entered appearance as defence counsel to CBN and Emefiele, and have filed their defence."
  },
  {
    "headline": "#EndSARS: Nigeria’s Central Bank, Governor Emefiele Retain Ex-Attorney-General, Aondoakaa, Others In Suit Over Harassment Of Protesters, Incompetence In Office",
    "summarized_story": "The Central Bank of Nigeria (CBN) and its governor, Godwin Emefiele, have retained a former Attorney-Attorney-General of the Federation, Mike Aondoakaa (SAN) to lead the legal team of Senior Advocates of Nigeria (SAN) in the defence of the suit against him and the bank.\nThe suit borders on Emefiele’s incompetence in office, and harassment of the #EndSARS protesters.\nHe also wants the court to also compel the CBN never to lend beyond the prescribed 5% of the previous year’s revenues.\nSaharaReporters gathered that Aondoakaa was briefed by the CBN to represent the apex bank in the matter.\n“Former AG Aondoakaa SAN, and the legal team, entered appearance as defence counsel to CBN and Emefiele, and have filed their defence."
  },
  {
    "headline": "#EndSARS: Nigeria’s Central Bank, Governor Emefiele Retain Ex-Attorney-General, Aondoakaa, Others In Suit Over Harassment Of Protesters, Incompetence In Office",
    "summarized_story": "The Central Bank of Nigeria (CBN) and its governor, Godwin Emefiele, have retained a former Attorney-Attorney-General of the Federation, Mike Aondoakaa (SAN) to lead the legal team of Senior Advocates of Nigeria (SAN) in the defence of the suit against him and the bank.\nThe suit borders on Emefiele’s incompetence in office, and harassment of the #EndSARS protesters.\nHe also wants the court to also compel the CBN never to lend beyond the prescribed 5% of the previous year’s revenues.\nSaharaReporters gathered that Aondoakaa was briefed by the CBN to represent the apex bank in the matter.\n“Former AG Aondoakaa SAN, and the legal team, entered appearance as defence counsel to CBN and Emefiele, and have filed their defence."
  },
  {
    "headline": "EXCLUSIVE: How Ex-Nigerian Navy Director On Wanted List For Corruption Illegally Renewed International Passport, Sneaked Into Nigeria",
    "summarized_story": "), on the wanted list of the Economic and Financial Crimes Commission (EFCC) has sneaked back into the country using an illegally obtained international passport, SaharaReporters has gathered.\nHe went to the Nigerian Embassy in Abu Dhabi, UAE and wanted to bribe his way to getting his passport renewed.\nBut all passports renewed in Abu Dhabi carry only one passport number.\nAnd last two months, the new passport number was checked and it wasn't on the data base of the immigration.\n“In Abu Dhabi, once you show your old passport and they confirm it, they issue you with a new one and only your new passport number will be on the passport, unlike his that carries old passport number and new passport number."
  },
  {
    "headline": "EXCLUSIVE: How Ex-Nigerian Navy Director On Wanted List For Corruption Illegally Renewed International Passport, Sneaked Into Nigeria",
    "summarized_story": "), on the wanted list of the Economic and Financial Crimes Commission (EFCC) has sneaked back into the country using an illegally obtained international passport, SaharaReporters has gathered.\nHe went to the Nigerian Embassy in Abu Dhabi, UAE and wanted to bribe his way to getting his passport renewed.\nBut all passports renewed in Abu Dhabi carry only one passport number.\nAnd last two months, the new passport number was checked and it wasn't on the data base of the immigration.\n“In Abu Dhabi, once you show your old passport and they confirm it, they issue you with a new one and only your new passport number will be on the passport, unlike his that carries old passport number and new passport number."
  },
  {
    "headline": "FG releases names, pictures of escaped inmates from Oyo prison",
    "summarized_story": "The ministry of interior has released names and photographs of inmates who escaped from the Abolongo medium custodial centre in Oyo state.\nAdvertisementOn October 22, gunmen had attacked the correctional facility in Abolongo, Oyo town, freeing several inmates.\nAccording to Rauf Aregbesola, minister of interior, 907 inmates escaped, and some of them have been re-arrested.\nSpeaking on efforts to find the escaped inmates, Aregbesola had also said the details would be forwarded to Interpol and border posts all over the work.\n“Names and faces of wanted persons who escaped from the Oyo Custodial Centre on Friday, October 22, 2021,” the post reads."
  },
  {
    "headline": "FG releases names, pictures of escaped inmates from Oyo prison",
    "summarized_story": "The ministry of interior has released names and photographs of inmates who escaped from the Abolongo medium custodial centre in Oyo state.\nAdvertisementOn October 22, gunmen had attacked the correctional facility in Abolongo, Oyo town, freeing several inmates.\nAccording to Rauf Aregbesola, minister of interior, 907 inmates escaped, and some of them have been re-arrested.\nSpeaking on efforts to find the escaped inmates, Aregbesola had also said the details would be forwarded to Interpol and border posts all over the work.\n“Names and faces of wanted persons who escaped from the Oyo Custodial Centre on Friday, October 22, 2021,” the post reads."
  },
  {
    "headline": "The naira and its many enemies",
    "summarized_story": "While the trouble went on, exchange rate remained at roughly 60 kobo/$ while our reserves were getting depleted to keep the naira alive.\nThe naira will continue to be severely challenged as long as the relationship between forex outflows and forex inflows is unhealthy.\nWhat I have observed is that per time, there are many enemies fighting the naira.\nTake away the fuel import component of forex demand today and there would be a huge relief for the naira.\nThe forex demand for these two items puts significant and avoidable pressure on our forex reserves and humiliates the naira."
  },
  {
    "headline": "The naira and its many enemies",
    "summarized_story": "While the trouble went on, exchange rate remained at roughly 60 kobo/$ while our reserves were getting depleted to keep the naira alive.\nThe naira will continue to be severely challenged as long as the relationship between forex outflows and forex inflows is unhealthy.\nWhat I have observed is that per time, there are many enemies fighting the naira.\nTake away the fuel import component of forex demand today and there would be a huge relief for the naira.\nThe forex demand for these two items puts significant and avoidable pressure on our forex reserves and humiliates the naira."
  },
  {
    "headline": "G20 leaders agree on 15% global minimum corporate tax",
    "summarized_story": "Leaders of the world’s 20 major economies have approved a global minimum corporate tax rate of at least 15 percent, which will come into force in 2023.\nAdvertisementThe tax is aimed at preventing multinational companies from taking advantage of complacent tax regimes and not paying taxes where they operate.\n“Today, every G20 head of state endorsed an historic agreement on new international tax rules, including a global minimum tax that will end the damaging race to the bottom on corporate taxation,” said Yellen.\nAdvertisement“It’s a critical moment for the US and the global economy.”She offered congratulations to US President Joe Biden for the “achievement”.\nHe described the tax deal as “a historic agreement for a fairer and more effective international tax system”."
  },
  {
    "headline": "Facebook changes company name to Meta, reflecting its ambitions beyond social media",
    "summarized_story": "Facebook on Thursday, October 28 announced that it has changed its company name to Meta.\nThis change of name was announced by Facebook CEO Mark Zuckerberg at Facebook’s annual Connect augmented and virtual reality conference.\nThe company said it chose the name “Meta” to serve as a reminder that there is always more to build.\nFacebook said its corporate structure is not changing, however, how the company reports its financials will.\nIn addition, Facebook assured users that the announcement does not affect how the company uses or shares data."
  },
  {
    "headline": "Beyond investing in African startups, Kepple Africa Ventures is creating new industries",
    "summarized_story": "Afterwards, he returned to Africa as a general partner at Kepple Africa Ventures.\nI knew I had to be a part of it.”Daniel Adeyemi: How did Kepple Africa Ventures start?\nThis provided Kepple with access to a network of investors to raise $18 million for Kepple Africa Ventures.\nRyosuke Yamawaki handles investing in East and Southern African startups while I focus on investing in West and North African startups.\nDA: Talking about Japanese investors, are there any other Japanese investors in Africa?"
  },
  {
    "headline": "eNaira: How to use Nigeria’s central bank digital currency",
    "summarized_story": "Nigeria became the first country in Africa to launch a central bank digital currency (CBDC) this week after President Muhammadu Buhari unveiled the eNaira at the State House in Abuja, the nation’s capital.\nIssued by the Central Bank of Nigeria (CBN), the digital currency is built on a private blockchain technology developed by Bitt Inc and has the same value as the fiat or physical currency.\nThe new currency can be accessed and used via the eNaira wallet (named “Speed”), a digital storage held and managed on a distributed ledger.\neNaira use casesFinancial institutions are responsible for onboarding their customers and integrating the eNaira wallet feature into their digital banking channels.\nThe digital currency could also bring a significant majority of Nigerians without bank accounts into the formal financial economy."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Bolt’s EV option, aYo Holdings’ new business model, Facebook’s new name, Namibia’s crime-busting plans",
    "summarized_story": "The company plans to drive greater scale, better customer experience, and faster access to markets across the African continent in the coming years.\n50 countries in Africa have introduced mandatory SIM card registration laws.\nUa-Ndjarakana said that the SIM card registration process would be done to protect consumers’ privacy.\nDo you think SIM card registration combats crime or increases surveillance in Africa?\nVictoria Fakiya for Techpoint Africa."
  },
  {
    "headline": "Early Access: Interview with ReelFruit founder, Affiong Williams",
    "summarized_story": "But then, it took her five years to build her first factory, and nine years in total to the Series A.Affiong Williams, founder and CEO, ReelFruit.\nThese and many more I sought to find out during a recent interview with Affiong Williams at the ReelFruit HQ in Lagos, Nigeria.\nIn this inspiring interview, Affiong Williams shares her motivations, inspirations, ambitions, entrepreneurial lessons, and tips on how to achieve a work-life balance while running a global company.\nWatch full interview or continue below for summarised text versionThe full interview will go live on Tuesday November 2, 2021 at noon.\nWatch it today on Early Access by joining our membership programme Join now Already a member?"
  },
  {
    "headline": "Stitch’s Nigeria expansion, Africa’s military coups, RecoMed’s $1.5m funding, and Union45’s $3m seed",
    "summarized_story": "Source: Supplied,South African API fintech startup, Stitch has today announced its expansion into Nigeria and a $2M seed extension, with investment from Future Africa and Norrsken Foundation, among others.\nStitch announced an initial $4 million seed in February when it came out of stealth.\nThe startup launched officially in February 2021 with an API that provides software companies with identity verification tools and access to users’ financial data.\nWhile fintech startups still get a significant chunk of African funding, healthtech startups seem to be attracting some serious cash.\nApply hereCall for climate-focused startups: Africa ClimAccelerator Applications open."
  },
  {
    "headline": "DSS Played Major Role In Foiling Benin Jailbreak – Commissioner – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State Commissioner for Communication and Orientation Andrew Emwanta has commended Edo State Command of the Department of State Security for their role in foiling attempted Jailbreak in Benin City, Edo State.\nThe commissioner gave the commendation during a courtesy visit to the office of the Director State Security Service (DSS) Edo State Command.\nNothing was said about the role your organisation played in securing the medium custodian center during an attempted jailbreak in Benin”.\nHe said EDSG has design proper mode of passing information to the public using the Edo Communication Organisation.\n” We will be organising a stakeholders engagement meeting with security agencies in December."
  },
  {
    "headline": "Obaseki urges end to multiple exchange rates to grow nation’s economy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has called for an end to multiple exchange rates to achieve sustainable economic growth and development in the country.\nThe governor reiterated the need for the government to relax capital control measures and promote exchange rate uniformity to create more incentives for investors in the domestic market.\nObaseki said while multiple exchange rates could hinder capital inflows into the country, a stable rate would boost domestic production and attract more investment.\nAccording to him, countries like the U.S., Europe and Asia have exchange rate stability, necessitating free movement of capital and developed capital markets.\nWe need a well-developed capital market so that we can attract long-term development and achieve financing development."
  },
  {
    "headline": "Delta Communities Land Dispute Leaves Four People Dead – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – No fewer than four persons have been reportedly killed during a gun duel between Okwagbe and Owahwa communities in Ughelli South Local Government Area of Delta State over an age-long land dispute.\nNigerian Observer gathered that while three persons were feared dead on the side of Okwagbe, one death was recorded in Owahwa.\nA local source said, that: “Yes, three were killed at Okwagbe, one killed at Okwakwa community over an age-long land dispute.\nPolice deployed to the area.”Okwagbe is a village in the Ughelli South Local Government Area located along the Forçados River and shares boundaries with the Oginibo, Okuemor, Otegbo, Owahwa, Egbo-Ide, and Okreka (Ofonibaya) communities, among others.\nWhen contacted, olice Public Relations Officer (PPRO), Delta Police Command, DSP Bright Edafe, confirmed the incident but did not give details of the number of casualties."
  },
  {
    "headline": "Tennis: Deputy Gov Congratulates Dr Tandoh on appointment To ATTF Post – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Deputy Governor of Edo state, Rt.\nComrade Philip Shaibu, has congratulated former chairman, Legos state Sports Commission, Dr Kweku Adedayo Tandoh on his recent appointment as Chairman, Youth Committee of the African Table Tennis Federation (ATTF).\nThe sports loving Deputy Governor said he was happy with the appointment of Dr Tandoh just as he expressed confidence in the ability of the sports consultant to deliver on his new post and take African tennis to the next level.\nThis appointment is not just a reward for Dr Tandoh but also a huge responsibility that will spur him to do more at the Continental level, ” Shaibu said.\nDr Tandoh’s appointment was recently announced following a letter signed by the ATTF president, Khaled El-Salhy, which reads in parts, this appointment is due to your remarkable achievements within the African Table Tennis Federation."
  },
  {
    "headline": "Secondus condemns invasion of Mary Odili’s home",
    "summarized_story": "The suspended National Chairman of the People’s Democratic Party (PDP), Uche Secondus, has described the ‘invasion’ of the home of Supreme Court Justice, Mary Odilli, as a huge embarrassment.\nMr Secondus, who made this known in a statement sent to PREMIUM TIMES by his media aide, Ike Abonyi, also said the incident is an insult on the judiciary.\nMedia reports on Friday indicated that Mrs Odili’s Maitama, Abuja residence, was raided by armed operatives of the Economic and Financial Crimes Commission (EFCC).\nThe NIS in its defence had informed the presiding judge that it seized Mr Odili’s travelling documents based on a request by the EFCC.\nBut reacting to the invasion, Mr Secondus said that nothing could explain the embarrassing act of the security operatives on a woman who has put in much in the service of her fatherland."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "NBA, Secondus fume over invasion of Justice Mary Odili’s house by security agencies",
    "summarized_story": "The Nigerian Bar Association (NBA) and suspended National Chairman of the People’s Democratic Party (PDP), Prince Uche Secondus, have joined other well meaning Nigerians and organisations to condemn the invasion of the residence of Justice Mary Odili, a Supreme Court judge, by security operatives on Friday night.\n“I have spoken with My Lord, Peter-Odili JSC and I am happy to report that she is alive and well.\nThereafter, the NBA will ensure that all those responsible for this unfortunate incident are brought to book.\n“He said that relevant authorities should come clean on what informed such ignoble and dishonourable behavior and render unreserved apology to the Justice and the Judiciary.\n“Prince Secondus also noted that the development calls for more diligence on the part of judicial officers in responding to search warrant requests from overzealous officials of the executive.”Facebook Notice for EU!"
  },
  {
    "headline": "IPOB’s violent attacks in S/E have unmasked their heinous, directionless agenda for Ndigbo – Army",
    "summarized_story": "General Onyema Nwachukwu, that the suggestion was baseless, unfounded and could be absolutely described as a hoax.\nThe army suggested that following a backlash from the people over attacks by the group, its propagandists are trying to blame soldiers for the attacks.\n“For the records, the proscribed organization has in recent times foisted a sit-at-home order to show sympathy for their self acclaimed leader.\n“Realising the futility, hollowness and public rejection of their violent agitation, they resorted to twisting the narrative in the region to galvanize local support.\nWe encourage members of the public to provide actionable information to security agencies as the Exercises progress.”Facebook Notice for EU!"
  },
  {
    "headline": "Pensioners Decry Non- Compliance of Southwest Governors To 2019 Consequential Adjustment of Pension Increase",
    "summarized_story": "Sunday Oguntuyi, OshogboThe pensioners in the Southwestern part of Nigerian have decried the non- compliance of some governors in the zone to the consequential adjustment of pension increase, with particular reference to section 210 (3) and 173 (3) of the Constitution of the federal republic of Nigeria, 1999 as amended.\nThe concerned Governors are: Dr. John Kayode Fayemi of Ekiti State, Prince Dapo Abiodun of Ogun State, Engr.\nSeyi Makinde of Oyo State and Alhaji Adegboyega Oyetola of Osun State.\nRising from their Southwest meeting held in Ado Ekiti recently, the pensioners urged the Southwest governors with exception of Lagos and Ondo which had implemented the 33.4 percent increase of the year 2010 to comply with this constitutional provision.\nThe union said up till now no state governors in the zone have implemented the 2019 consequential adjustment of the salaries and wages that have increased from N18,000 to N30, 000 which ought to have been implemented since April, 2019."
  },
  {
    "headline": "Army says it killed four IPOB members in Anambra",
    "summarized_story": "Nigerian Army has said troops of the 82 Division currently conducting a special operation in the South-east, Exercise Golden Dawn, have killed four members of the Eastern Security Network (ESN), a militant wing of the Indigenous People of Biafra (IPOB) during an exchange of gunfire in Anambra State.\n“In a separate operation, troops have foiled another attack by IPOB/ESN gunmen at Umunze Checkpoint, in Orumba South Local Government Area.\n“The Nigerian Army notes that the recent attacks are part of proscribed IPOB/ESN plan to instil fear into the public and sabotage forthcoming Anambra State Governorship Election.\nMembers of the public are reassured that the Nigerian Army, sister services and other security agencies will not relent in resolutely confronting all criminals intents against the citizenry and national interest.\nThey are also encouraged to report any unusual activity observed across Anambra State to the nearest security post.”"
  },
  {
    "headline": "Obaseki Leads Edo Delegation To PDP Convention, Gets Rousing Welcome",
    "summarized_story": "Edo State governor, Godwin Obaseki, on Saturday, led the Edo State Peoples Democratic Party (PDP) delegation to the national convention holding at Eagles Square, Abuja.\nThe governor, who was warmly received by other delegates upon his arrival at the venue, exchanged pleasantries with leaders of the party and thanked the delegates for making the trip to the convention despite the inconveniences.\nLEADERSHIP reports that 95 delegates in total voted from Edo State.\nNational leaders, serving and former governors, Senators, House of Representatives members were seen exchanging pleasantries with Obaseki, a reflection of the unity in the party.\n“This oneness was once again displayed today at the convention ground with the kind of camaraderie that exist between the governor and party delegates.”"
  },
  {
    "headline": "Obaseki Leads Edo Delegation To PDP Convention, Gets Rousing Welcome",
    "summarized_story": "Edo State governor, Godwin Obaseki, on Saturday, led the Edo State Peoples Democratic Party (PDP) delegation to the national convention holding at Eagles Square, Abuja.\nThe governor, who was warmly received by other delegates upon his arrival at the venue, exchanged pleasantries with leaders of the party and thanked the delegates for making the trip to the convention despite the inconveniences.\nLEADERSHIP reports that 95 delegates in total voted from Edo State.\nNational leaders, serving and former governors, Senators, House of Representatives members were seen exchanging pleasantries with Obaseki, a reflection of the unity in the party.\n“This oneness was once again displayed today at the convention ground with the kind of camaraderie that exist between the governor and party delegates.”"
  },
  {
    "headline": "NIN-SIM Linkage: Again, Federal Govt Extends Deadline To December",
    "summarized_story": "The federal government has extended the deadline for the National Identity Number (NIN)-Subscriber Identity Module (SIM) data verification and linkage to the end of the year.\nThe minister of communications and digital economy, Prof. Isa Ali Ibrahim who conveyed the government’s approval, urged citizens and legal residents to complete the process before the end of the year 2021.\nA joint statement signed by director, public affairs, Nigerian Communications Commission (NCC),Dr. Ikechukwu Adinde, and head, corporate communications of National Identity Management Commission (NIMC),nMr.\nKayode Adegoke stated that the review of the progress of the exercise indicated that over 66 million unique National Identity Numbers (NIN) have been issued- an indication of progress achieved in the ongoing NIN-SIM linkage.\nAccording to the two agencies, as of October 30, 2021, there were over 9,500 enrolment systems and over 8,000 NIN enrolment centres within and outside the country- this has significantly eased the NIN enrolment process and subsequent linkage of NIN to SIM."
  },
  {
    "headline": "NIN-SIM Linkage: Again, Federal Govt Extends Deadline To December",
    "summarized_story": "The federal government has extended the deadline for the National Identity Number (NIN)-Subscriber Identity Module (SIM) data verification and linkage to the end of the year.\nThe minister of communications and digital economy, Prof. Isa Ali Ibrahim who conveyed the government’s approval, urged citizens and legal residents to complete the process before the end of the year 2021.\nA joint statement signed by director, public affairs, Nigerian Communications Commission (NCC),Dr. Ikechukwu Adinde, and head, corporate communications of National Identity Management Commission (NIMC),nMr.\nKayode Adegoke stated that the review of the progress of the exercise indicated that over 66 million unique National Identity Numbers (NIN) have been issued- an indication of progress achieved in the ongoing NIN-SIM linkage.\nAccording to the two agencies, as of October 30, 2021, there were over 9,500 enrolment systems and over 8,000 NIN enrolment centres within and outside the country- this has significantly eased the NIN enrolment process and subsequent linkage of NIN to SIM."
  },
  {
    "headline": "PDP Govs, Party Leaders Arrive Convention Venue",
    "summarized_story": "Governors of the Peoples Democratic Party (PDP) as well as leaders of the party have arrived Eagle Square, Abuja venue of the national convention of the PDP, which has has been agog with activities.\nWhile routes leading to the venue were cordoned off for security reasons, petty traders have been making brisk businesses selling their wares.\nThe event, however, formally started at 1:05pm, after the national anthem.\nGovernor of Benue State, Samuel Ortom and the Kano State chairman of PDP, Shehu Wada, gave the Christian and Muslim opening prayers respectively.\nTraditional dancers from different parts of the country displayed their craft at the venue while supporters of aspirants of political officers in 2023 were seen displaying their banners."
  },
  {
    "headline": "VIDEO: PATIENCE OZOKWO BEGS SCAMMERS: PLEASE, STOP USING MY NAME FOR FRAUDULENT ACTIVITIES",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, DAYLIGHT will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: PATIENCE OZOKWO BEGS SCAMMERS: PLEASE, STOP USING MY NAME FOR FRAUDULENT ACTIVITIES",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, DAYLIGHT will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: ANOTHER BBNAIJA STAR, LIQUOROSE LANDS IN BIG TROUBLE OVER SEMI-NUDE DRESS",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, DAYLIGHT will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "VIDEO: ANOTHER BBNAIJA STAR, LIQUOROSE LANDS IN BIG TROUBLE OVER SEMI-NUDE DRESS",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, DAYLIGHT will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "How I gave one million dollars offering to God",
    "summarized_story": "Prosperity preacher, Pastor David Ibiyeomie has narrated how he gave one million dollars offering to God in one single service.\nHe said the time he gave the one million dollars offering was in 2012.\nIn his words: “One day, in 2010 I said I was going to give one million dollars as offering which today is about five hundred and sixty five million naira.\n“I said that 2010 and by 2012, in one service, I gave one million dollars as offering which is five hundred and sixty three million naira in one Sunday service without preaching prosperity.\nFive hundred and fifty six million, which house will I not but anywhere in the world?”"
  },
  {
    "headline": "Buhari sad as his trusted, reliable friend, Capt Din, dies",
    "summarized_story": "By Ismaila ChafePresident Muhammadu Buhari has expressed sadness at the passing away of a friend and political ally, retired Capt.\nThe president, who made his feelings known in a condolence message released by his Senior Special Assistant on Media and Publicity, Malam Garba Shehu, on Saturday in Abuja, said: “the late Captain Din was a trusted and very reliable friend.\n”He was a broad-minded patriot whose approach to national issues was most practical and worthy of emulation.\nHe was equally a peace-loving man.”President Buhari commiserated with the Plateau State Government and the All Progressives Congress (APC) family in the State on the demise of the Chairman of the party’s Elders Advisory Council.\nHe particularly condoled with the widow, Mrs Christiana Din, and members of the family, urging them to take solace in the good works that the late Captain left behind and remain strong even as they continue to mourn him."
  },
  {
    "headline": "BREAKING: Boat Capsizes In Lagos, 17 Rescued",
    "summarized_story": "17 passengers have been rescued as a boat named GT Water Line 4 capsized in Lagos State on Saturday, News Direct can report.\nIt was gathered that the boat capsized 20 minutes after taking off from Ebute-Ero en route to the Ikorodu terminal.\nThe Lagos State Waterways Authority (LASWA), in a statement signed by its General Manager, Damilola Emmanuel, on Saturday night said all 17 passengers were rescued safely since they were all on life jackets.\nAccording to the statement: “The boat was said to have left the Ebute-Ero at about 5.15pm with 17 passengers onboard.\n“LASWA patrol team and some other boat operators were swift to respond to the distress call from the boat, thereby rescuing all 17 passengers onboard alive which included two minors."
  },
  {
    "headline": "Federal Government Announces New Deadline For NIN-SIM Verification.",
    "summarized_story": "Prof. Isa Ali Pantami, the Honourable Minister of Communications and Digital Economy, has received consent from the Federal Government to extend the deadline for data verification of the National Identity Number (NIN)-Subscriber Identity Module (SIM).\nCitizens and legal residents are being urged by the federal government to finish the process by the end of 2021.\n“As of October 30, 2021, there were over 9,500 enrolment systems and over 8,000 NIN enrolment centres within and outside the country- this has significantly eased the NIN enrolment process and subsequent linkage of NIN to SIM,” it added.\nThe NIN-SIM verification process is supporting the Government’s drive to develop Nigeria’s digital economy, strengthen its ability to protect cyberspace and support the security agencies.\nAliyu A. Aziz, urge citizens and legal residents to take advantage of the window to complete the process of enrolment and verification before the end of the year 2021,” the statement added."
  },
  {
    "headline": "BREAKING: Ex-Oyo Cmmissioner,Omodewu Emerges As APC Chairman",
    "summarized_story": "Mr. Ajiboye Omodewu, a former Commissioner for Lands and Housing in Oyo State, has been elected Chairman of the All Progressives Congress (APC) in the state.\nThe congress was supervised by the Secretary of the APC state congress committee, Abdullahi Bello.\nBello, who is the APC chairman in Kogi State, maintained that a consensus agreement was reached to conduct the congress.\nThe names of all the executive members were read by the committee and were affirmed by the party members who were present.\nOther executive members of the party who emerged at the congress included Alhaji Laide Abass, who emerged as Deputy Chairman; Mojeed Olaoya who emerged as Oyo South Senatorial Chairman; Joshua Oyebamiji who emerged as Oyo Central senatorial chairman; and Tunde Oloyede who emerged as Oyo North senatorial chairman."
  },
  {
    "headline": "BREAKING: Nigerian Army Troops Neutralize 4 IPOB/ ESN Gunmen [PHOTOS]",
    "summarized_story": "…Recover AK-47 Rifles, vehicles, ammunitionTroops of 82 Division Nigerian Army conducting Exercise GOLDEN DAWN have neutralised four gunmen of the proscribed Indigenous Peoples of Biafra/ Eastern Security Network (IPOB/ESN) in a fierce encounter at Nnobi Junction, Idemili South Local Government Area on Friday 29 October 2021.\nTroops made contact with the fleeing gunmen and engaged them in a fire fight, neutralizing four of the criminals.\nThe gallant troops also recovered two AK-47 Rifles, one GALIL Ace 5.56 x 45 Iwi Gun, one Avofeng Hand held radio and one Black Highlander jeep.\nSadly, a personnel of one of the security agencies paid the supreme price.\nIn a separate operation, troops have foiled another attack by IPOB/ ESN gunmen at Umunze Checkpoint, in Orumba South Local Government Area."
  },
  {
    "headline": "Breaking: Crystal Palace shock Manchester City, Chelsea blow Newcastle away, Liverpool drop Premier League points",
    "summarized_story": "Wilfried Zaha became the first player to score 50 top-flight goals for Crystal Palace as 10-man Manchester City suffered a shock defeat at Etihad Stadium.\nZaha struck after just six minutes when Conor Gallagher robbed Aymeric Laporte inside his own half before Gallagher wrapped up the points when he fired home two minutes from time.\nLaporte was red-carded by referee Andre Marriner in first-half stoppage time when he committed a professional foul by bringing down Zaha 35 yards from the City goal.\nBut Palace were a danger on the break, with Jordan Ayew and Gallagher both wasting decent chances before Gallagher finished Michael Olise’s lay-off to give Patrick Vieira’s men victory and end a frustrating run of four consecutive Premier League draws.\nSimilarly, Chelsea lashed Newcastle 3-0 while Liverpool were held to 2-2 draw by Brighton."
  },
  {
    "headline": "Breaking: EFCC opens up as security operatives invade Mary Odili’s residence",
    "summarized_story": "The residence of a Supreme Court Justice, Mary Odili, on Friday suffered invasion by suspected armed Police and Soldiers.\nThis is as the Economic and Financial Crimes Commission (EFCC) has swiftly denied being involved in the reported raid.\nReports earlier suggested that the security operatives arrived at Justice Odili’s Abuja residence and made immediate attempt to break in, but the wife of former Rivers State Governor, Peter Odili, fervently resisted the attempts to raid her residence by the operatives, telling the operatives that she had no business with them.\nHer husband has been facing corruption charges raised by the Economic and Financial Crimes Commission (EFCC).\nDetails loading…"
  },
  {
    "headline": "Tension as PDP holds ‘consensus national convention’",
    "summarized_story": "Like Ogbeh, another Obasanjo’s friend, Ahmadu Ali, was made the party’s national chairman.\nConsequently, Vincent Ogbulafor was elected the new chairman at the party’s national convention of 2008.\nThis has led to mass defections of party members from state to national levels, and this has affected their performances in many elections.\nThe conventionOf all the positions, only those of the national auditor, national youth leader and deputy national chairman (South) would be contested out at the convention ground as the others have already been concluded on a consensus arrangement.\nThe Enugu state governor, Ifeanyi Ugwuanyi, introduced the Abia state governor, Okezie Victor Ikpeazu."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Kalu urges FG to probe invasion of Justice Odili’s residence by police -NigPilot",
    "summarized_story": "Chief Whip of the Senate, Senator Orji Uzor Kalu has called on the federal government to commence a full-scale investigation into the invasion of the Abuja residence of a Justice of the Supreme Court, JSC, Mary Odili by men of the Nigeria Police.\nSenator Kalu specifically called on the federal government to bring the perpetrators of the evil act to book, adding that unlawful invasion of a citizen’s residence is against the constitution of Nigeria and tenets of democracy.\nHe said: “The invasion of the residence of Justice Mary Odili of the Supreme Court in a gestapo manner is totally condemnable and unacceptable in a democratic dispensation.\n“The country’s democracy is gradually growing and as such, acts that are not in tandem with the constitution of Nigeria and democratic process must not tolerated.\nKalu called on the federal government and the citizenry to embrace the tenets of democracy in all pursuits, adding that no country can progress in an atmosphere of lawlessness.”"
  },
  {
    "headline": "The Birth of a new economic dawn -NigPilot",
    "summarized_story": "Olamilekan Adegbite in his keynote address said the launch of the Nigerian Barite was a culmination of several efforts and collaboration with critical stakeholders in the sector.\nOthers he mentioned were; Job creation along the Barite value chain and Local Content promotion in line with federal government policy.\nAdegbite added that the launch of Nigerian Barite was poised to save the country millions of dollars spent importing barite.\nHe disclosed that an open market place Portal that would connect all stakeholders along the Barite value chain would soon be commissioned.\nHe said the launch of Nigerian Barite is an attestation that the Ministry’s investment in exploration activities and capacity building targeted at sustainable production of Nigerian processed Barite has finally paid off."
  },
  {
    "headline": "2023: Utomi, Jega, Agbakoba to launch ‘Third Force’ mega party in Nov – Yunusa -NigPilot",
    "summarized_story": "Top political gladiators in the country are set to launch an alternative mega party in November to challenge the ruling All Progressives Congress, APC, and the major opposition, Peoples Democratic Party, PDP, in the 2023 general elections.\noised to deliver Nigeria from her present crises of collapse foisted by failed political leadership and system.\nThese leaders of conscience who are under the auspices of the National Consultative Front, NCFront , said they are pIn a press statement released Friday by the Head , Public Affairs Bureau of NCFront, Dr Tanko Yunusa, the group said apart from the major political parties, which are set to work together to form the nucleus of the new credible alternative platform, the process should also seeks to explore electoral alliance with other political parties with similar ideological values, in building a major groundswell of formidable solidarity for the new Mega Party.\nDr. Yunusa noted that the National Secretariat of the NCFront has already mobilised relevant stakeholders to work out the modalities of ensuring equal benefits and responsibilities for partners and stakeholders fusing into the new alternative political platform.\nHe said, “However, the latest people’s centred working together is being facilitated by the leadership of the NCFront is being built on the three layers of key like minded Ideological political parties, which are to form the nucleus of the ‘Third Force’ Mega Party, other political parties, who are interested in undertaking electoral alliance with the nucleus of the New Mega Party and finally political associations, interest and stakeholders’ Groups and civil society leaders and allies who are committed to fuse into the the grand political coalition in bringing about a credible alternative mass political platform to save Nigeria from the disastrous grip of failed political leadership and the heightening constitutional crisis and agitations rocking the country, which are currently doing great damage to the economic prosperity of Nigerians."
  },
  {
    "headline": "Alleged EFCC invasion of Justice Mary Odili’s private residence barbaric, reprehensible – CUPP",
    "summarized_story": "The Coalition of United Political Parties, CUPP, has condemned in strong terms, the alleged invasion of the private residence of a renowned Justice of the Supreme Court of Nigeria, Justice Mary Odili, by officers suspected to be operatives of the Economic and Financial Crimes Commission, EFCC, working in collaboration with Officers and men of the Nigeria Police Force, describing it as unjustified and Illegal.\nThough the EFCC, through its Chairman, Abdulrasheed Bawa, has denied any involvement of the anti-graft agency in the operation, the CUPP asserted that Intimidation and harassment of Judicial Officers by the administration of President Muhammadu Buhari led APC Government is an act of terror.\n“As long as we profess to be be in a democracy, it is incumbent on all elected and appointed Officials to act within the confines of the Law.\n“With the worsening security and economic situations in Nigeria occasioned by unprecedented ineptitude on the part of Mohamadu Buhari led APC Government, it has become clear that the current administration has wilfully and consciously chosen to derail our nascent democracy and lead Nigeria to a part of no return.\n“We therefore demand an immediate withdrawal of security operatives from the private residence of Justice Mary Odili and an unreserved apology from the Nigerian government in this regards and further call on all Nigerians to stand up and defend our democracy which this administration is bent on derailing.”"
  },
  {
    "headline": "BREAKING: Channels Television Wins TV Station Of The Year For The 14th Time",
    "summarized_story": "Extending its record in the category, the award-winning station claimed the prize on Saturday at an event held in Lokoja, the Kogi State capital.\nChannels Television’s Controller of Programmes, Mr Ambrose Okoh, and some senior staff members received the award on behalf of the organisation.\nOrganisers handed out awards in more than 51 categories to various winners, with a majority in the print category.\nPrior to the award bagged on Saturday, Channels Television last won the Best Station of the Year in 2019.\nThe number of entries received for the year 2021, according to them, is one of the highest figures ever since the inauguration of the award in the early 90s."
  },
  {
    "headline": "Again, FG Extends NIN-SIM Verification Deadline",
    "summarized_story": "The Federal Government has again extended the deadline for the National Identity Number (NIN)-Subscriber Identity Module (SIM) data verification.\nMinister of Communications and Digital Economy, Isa Pantami, who announced this, urged Nigerians and legal residents to complete the process before the end of the year 2021.\nBoth men had in a statement in June announced October 31 as the deadline for the linkage of SIM and NIN.\n“As of October 30, 2021, there were over 9,500 enrolment systems and over 8,000 NIN enrolment centres within and outside the country – this has significantly eased the NIN enrolment process and subsequent linkage of NIN to SIM,” the statement added.\n“The NIN-SIM verification process is supporting the government’s drive to develop Nigeria’s digital economy, strengthen our ability to protect our cyberspace, and support the security agencies."
  },
  {
    "headline": "PDP Convention: Members, Delegates, Gather To Elect New Officials",
    "summarized_story": "﻿Members and delegates of the leading opposition party Peoples Democratic Party (PDP) have converged at Eagles Square, Abuja to hold their national convention and elect new officials.\nNational party officials, governors, ex-governors, and other bigwigs of the party are currently at Eagle’s Square in preparation.\nChairman of the organising committee of the convention, Governor Ahmadu Fintiri had earlier on Friday said efforts are on to reconcile most of the contestants.\nBut on Friday, the Appeal Court in Port Harcourt, Rivers State granted the party the right to hold the convention in a suit brought by Secondus.\n“So, if there is anybody or group who are being used to derail us, PDP will not take it lightly."
  },
  {
    "headline": "Siege On S/Court Judge’s Home Designed To Embarrass Odilis – Ozekhome",
    "summarized_story": "﻿A Senior Advocate of Nigeria, Mike Ozekhome has described the siege on the home of a Supreme Court Justice, Mary Odili, as a ploy to embarrass her family.\nIt didn’t say Justice Mary Peter Odili.\nIt didn’t say the husband, Dr Peter Odili.\nIt just said, number 9, Imo Street,” Ozekhome said.\n“Meanwhile, the very address of Justice Odili is not number 9, Imo street."
  },
  {
    "headline": "NBA To Meet With Malami, Others Over Raid On Justice Odili’s Residence",
    "summarized_story": "The Nigerian Bar Association (NBA) has condemned the raid on the residence of a justice of the Supreme Court, Justice Mary Peter-Odili, by a group of yet-to-be-identified security operatives.\nIn a statement on Saturday, NBA President Olumide Akpata listed some of the actions to be taken by the legal body to ensure the perpetrators were brought to justice.\n“Thereafter, the NBA will ensure that all those responsible for this unfortunate incident are brought to book.\nWe must do all that is required to safeguard the independence of our judiciary and indeed protect our hard-won democracy.”Ridicule The Judiciary?\nThe NBA president stressed that this was far from reports that the invasion was pursuant to a search warrant issued by a Magistrate Court in Abuja, which has now been revoked."
  },
  {
    "headline": "PDP Convention: Screening of Delegates ongoing at Old Parade Ground -",
    "summarized_story": "The screening of delegates is currently underway at the Old Parade Ground ahead if the elective and non-elective national convention of the People’s Democratic Party.\nRecent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided.\nArchives Archives Select Month October 2021 (483) September 2021 (546) August 2021 (544) July 2021 (519) June 2021 (603) May 2021 (614) April 2021 (693) March 2021 (769) February 2021 (685) January 2021 (770) December 2020 (677) November 2020 (609) October 2020 (507) September 2020 (780) August 2020 (768) July 2020 (735) June 2020 (682) May 2020 (532) April 2020 (530) March 2020 (456) February 2020 (486) January 2020 (656) December 2019 (705) November 2019 (650) October 2019 (607) September 2019 (574) August 2019 (631) July 2019 (719) June 2019 (747) May 2019 (908) April 2019 (620) March 2019 (516) February 2019 (528) January 2019 (561) December 2018 (492) November 2018 (583) October 2018 (616) September 2018 (568) August 2018 (585) July 2018 (500) June 2018 (437) May 2018 (408) April 2018 (430) March 2018 (510) February 2018 (547) January 2018 (550) December 2017 (291) November 2017 (498) October 2017 (715) September 2017 (675) August 2017 (689) July 2017 (671) June 2017 (679) May 2017 (987) April 2017 (1042) March 2017 (1141) February 2017 (676) January 2017 (612) December 2016 (596) November 2016 (571) October 2016 (639) September 2016 (162) March 2016 (39) May 2015 (1)Categories Categories Select Category #AnambraVotes (15) #Ekiti2018 (25) #EkitiVotes (14) #LagosBuildingCollapse (2) #LiberiaRunOff (6) #OsunDebate (5) #OsunVotes (29) America (554) Asia (279) Athletics (113) Basketball (44) Boxing (69) Breaking News (118) Business News (5,406) Central Africa (85) East Africa (179) Election 2019 (26) Entertainment News (703) Europe (405) Events (16) Fashion (5) fashion & style (15) Featured (533) Football (1,584) Formula 1 (19) Golf (15) Health News (2,202) inside lagos (1) International (7,169) Kogi Election (10) labour lens (5) Lassa Fever & Coronavirus (18) Latest News (25,702) Africa (363) West Africa (184) Livestream (3) Metro (25) Middle East (174) Movies (31) Music (74) Nigeria News (21,353) Nollywood (34) Non classifié(e) (1) North Africa (175) Politics News (5,627) #EdoDecides (22) #LagosCouncilElections (4) #NigeriaVotes (240) #OndoDecides (100) Bayelsa Election (7) nnamdi kalu (9) Presidential Election (45) Science & Technology (8) Shows (2) Southern Africa (173) Sports News (3,413) Table Tennis (20) Tech (22) Tennis (111) the platform (1) Top Stories (38) U-Report (5) Uncategorized (284) VIDEO (1,201) Business Nigeria (3) Business Week (2) Community Forum (11) Crime Watch (102) Fireworks (13) Green Angle (4) Journalists Hangout (106) News at 10 PM (23) Special Reports (112) Sports Debate (32) Sports Desk (3) Standpoint (1) The Big Issue (4) The Sunday Interview (108) This Morning (85) TVC Breakfast (831) TVC Investigates (6) Wildlife (5) World News (2,040)"
  },
  {
    "headline": "We have no link with Biafra National Guard",
    "summarized_story": "The Indigenous People of Biafra (IPOB) says the Biafra National Guard (BNG) is unknown to them and should not be linked to their nefarious activities which does not correspond with IPOB’S fundamental objectives.\nIn a statement by IPOB’S Media and Publicity Secretary, Emma Powerful, the group has observed the unpatriotic and nefarious activities of this BNG and unequivocally dissociate itself from those unpatriotic actions.\nAccording to him, the group has no link whatsoever with IPOB and doesn’t work for IPOB.\nThe outlawed group said it’s mandate is peaceful agitation and anything other than that should not be linked to IPOB.\nThe statement further read that IPOB will deal with anybody or group caught in such barbaric act which runs fool of it’s ideology."
  },
  {
    "headline": "Osinbajo attends Pentecostal Fellowship thanksgiving in Jos",
    "summarized_story": "The Vice president, Professor Yemi Osinbanjo is in Jos, Plateau State capital for a thanksgiving service organized by the Pentecostal fellowship of Nigeria, Plateau State Chapter.\nRecent PostsNews Feed RSS Error: WP HTTP Error: A valid URL was not provided.\nArchives Archives Select Month October 2021 (483) September 2021 (546) August 2021 (544) July 2021 (519) June 2021 (603) May 2021 (614) April 2021 (693) March 2021 (769) February 2021 (685) January 2021 (770) December 2020 (677) November 2020 (609) October 2020 (507) September 2020 (780) August 2020 (768) July 2020 (735) June 2020 (682) May 2020 (532) April 2020 (530) March 2020 (456) February 2020 (486) January 2020 (656) December 2019 (705) November 2019 (650) October 2019 (607) September 2019 (574) August 2019 (631) July 2019 (719) June 2019 (747) May 2019 (908) April 2019 (620) March 2019 (516) February 2019 (528) January 2019 (561) December 2018 (492) November 2018 (583) October 2018 (616) September 2018 (568) August 2018 (585) July 2018 (500) June 2018 (437) May 2018 (408) April 2018 (430) March 2018 (510) February 2018 (547) January 2018 (550) December 2017 (291) November 2017 (498) October 2017 (715) September 2017 (675) August 2017 (689) July 2017 (671) June 2017 (679) May 2017 (987) April 2017 (1042) March 2017 (1141) February 2017 (676) January 2017 (612) December 2016 (596) November 2016 (571) October 2016 (639) September 2016 (162) March 2016 (39) May 2015 (1)Categories Categories Select Category #AnambraVotes (15) #Ekiti2018 (25) #EkitiVotes (14) #LagosBuildingCollapse (2) #LiberiaRunOff (6) #OsunDebate (5) #OsunVotes (29) America (554) Asia (279) Athletics (113) Basketball (44) Boxing (69) Breaking News (118) Business News (5,406) Central Africa (85) East Africa (179) Election 2019 (26) Entertainment News (703) Europe (405) Events (16) Fashion (5) fashion & style (15) Featured (533) Football (1,584) Formula 1 (19) Golf (15) Health News (2,202) inside lagos (1) International (7,169) Kogi Election (10) labour lens (5) Lassa Fever & Coronavirus (18) Latest News (25,702) Africa (363) West Africa (184) Livestream (3) Metro (25) Middle East (174) Movies (31) Music (74) Nigeria News (21,353) Nollywood (34) Non classifié(e) (1) North Africa (175) Politics News (5,627) #EdoDecides (22) #LagosCouncilElections (4) #NigeriaVotes (240) #OndoDecides (100) Bayelsa Election (7) nnamdi kalu (9) Presidential Election (45) Science & Technology (8) Shows (2) Southern Africa (173) Sports News (3,413) Table Tennis (20) Tech (22) Tennis (111) the platform (1) Top Stories (38) U-Report (5) Uncategorized (284) VIDEO (1,201) Business Nigeria (3) Business Week (2) Community Forum (11) Crime Watch (102) Fireworks (13) Green Angle (4) Journalists Hangout (106) News at 10 PM (23) Special Reports (112) Sports Debate (32) Sports Desk (3) Standpoint (1) The Big Issue (4) The Sunday Interview (108) This Morning (85) TVC Breakfast (831) TVC Investigates (6) Wildlife (5) World News (2,040)"
  },
  {
    "headline": "NECO releases 2021 SSCE result, blacklists 20 supervisors",
    "summarized_story": "The National Examinations Council has released the results of the 2021 Senior School Certificate Examinations conducted nation wide in July.\nReleasing the result at the NECO Headquarters in Minna, NECO Registrar, Dantana Wushishi, disclosed that 878,925 candidates representing 71.64 per cent made five credits including Mathematics and English language.\n1,226,796 candidates representing 91.04 per cent of the candidates made five credits and above irrespective of English Language and Mathematics.\nThe registrar stated that out of the 1,233,631 candidates that registered for the Examinations only 1,209,992 sat for the exams.\nHe noted that 20,003 representing 1.63 per cent of candidates were involved in various forms of malpractice ."
  },
  {
    "headline": "Lagos Targets 4m By Year-End with Covid Mass Vaccination Programme",
    "summarized_story": "The Lagos State Governor, Babajide Sanwo-Olu has launched a mass vaccination campaign against COVID-19, as part of strategies to stave off re-emergence of the viral infection.\nThe objective was aimed at vaccinating four million residents in Lagos before the end of the year.\nThe immunisation programme was flagged off at an event held in Lagos.\nThe governor believed the mass vaccination campaign would help bolster the State’s response to the emerging threat posed by the pandemic.\n4 million Lagosians Vaccinated Against COVID-19’ to target the full vaccination of 4 million Lagos residents before the end of December 2021."
  },
  {
    "headline": "US Spy Agencies Say Origins of Covid-19 May Never be Known",
    "summarized_story": "A few countries have begun using other COVID-19 vaccines in children under 12, including China, which just began vaccinations for 3-year-olds.\n“The rationale here is protect your children so that they can get back towards normal life,” said FDA vaccine chief Dr. Peter Marks.\nThe Food and Drug Administration on Friday paved the way for children ages 5 to 11 to get Pfizer’s COVID-19 vaccine.\nBut a recent Kaiser Family Foundation survey suggests most parents won’t rush to get the shots.\nThe similarly made Moderna vaccine also is being studied in young children, and both Pfizer and Moderna also are testing shots for babies and preschoolers."
  },
  {
    "headline": "US, UK, Germany, France Take Up Iran Nuclear Pogram in Rome Talks",
    "summarized_story": "The meeting with the leaders of Germany, France, and Britain — known as the E3 — comes at a pivotal time, as Iran continues to enrich uranium to near-weapons-grade levels.\nBiden is trying to revive the 2015 nuclear deal and bring Iran back into compliance with the pact that would have kept the Islamic republic at least one year away from the potential to field a nuclear weapon.\nPresident Donald Trump withdrew the U.S. from the 2015 nuclear deal and the U.S. has participated indirectly in talks aimed at bringing both Washington and Tehran back into compliance.\nSaturday’s meeting comes days after American officials blamed Iran for a drone attack on a remote U.S. outpost in Syria.\nOfficials said Monday the U.S. believes that Iran resourced and encouraged the attack, but that the drones were not launched from Iran."
  },
  {
    "headline": "Tigrayan Forces Say They Have Seized Strategic Town in Ethiopia’s Amhara Region",
    "summarized_story": "Rebellious Tigrayan forces said on Saturday they had seized the strategic town of Dessie in Ethiopia’s Amhara region where tens of thousands of ethnic Amharas have sought refuge from an escalation in fighting.\nHe said Tigrayan forces had captured numerous Ethiopian soldiers.\nThe capture of Dessie would be a strategic gain for the Tigrayan fighters against the central government forces who are trying to dislodge them from the Amhara region.\nIn mid-October, the Tigrayan forces said the military had launched a ground offensive to push them out of Amhara.\nThe military acknowledged on Thursday there was heavy fighting there, but accused the Tigrayan forces of starting it."
  },
  {
    "headline": "Bawa Says EFCC Not Responsible as Security Agents Search Justice Odili’s House in Abuja",
    "summarized_story": "EFCC, had, Friday night, denied conducting any operation in the home of Justice Odili following reports that raid was an EFCC operation.\nA statement issued by the Spokesman of EFCC, Wilson Uwujaren, denied the involvement of the commission in the execution any search warrant at the residence of Justice Odili.\nHe said Justice Odili was expected to make a formal complaint to clear the air on the matter.\nThe security operatives, who came with a search warrant, said they received information on “illegal activities” going on in the house.\nThe Chief Magistrate, Emmanuel Iyanna, subsequently approved the search warrant on October 29, 2021."
  }
]