[
  {
    "headline": "Reps demand urgent steps to save Lagos riverside from disaster",
    "summarized_story": "The House of Representatives has raised the alarm over a looming natural disaster in communities in the Eti Osa Local Government Area of Lagos State over the encroachment of the lagoon.\nHe noted that Eti Osa LGA lies on the narrow coastal lowland of the south-eastern part of Lagos and situated on about 129.5 square kilometres of landmass, with sandy beaches, swamps, mangroves and creeks.\nAccording to him, the development of official and residential estates along the coastal area of the Atlantic Ocean in Lagos State is a major problem that circumvents basic environmental principles, which should be adopted in planning coastal towns and cities.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Pregnant woman, siblings increase FCT fire’s death toll to 10",
    "summarized_story": "Five more persons have died as a result of the fire outbreak recorded at Kubwa village market in Bwari Area Council of the Federal Capital Territory last Friday, bringing the death toll to 10.\nWhile five persons reportedly died on the day of the incident, five others were said to have died on Saturday at the hospital where they were receiving treatment.\nThe statement listed a pregnant woman and two children of the same family as among the latest casualties, adding that 11 persons are still at the hospital receiving treatment.\n“He revealed that five lives were lost on the day of the fire incident, while five more were lost the following day at the National Hospital, bringing to a total of 10 lives lost.\n“Among those that lost their lives include a pregnant woman, and two children of the same family with 11 still at the hospital."
  },
  {
    "headline": "$78.4m claim: Court stops 2 energy firms from accessing funds, assets worldwide",
    "summarized_story": "The injunction restrained the trio and their proxies in Nigeria, the United States of America, the United Kingdom, the United Arab Emirates, Switzerland, the European Union and any jurisdiction worldwide, pending the hearing and determination of Zenith’s motion on notice.\nREAD ALSONew salary package for Nigerian Police underway ― MinisterSome other respondents in the matter are Zebra Energy Nigeria Ltd; Glencore U.K Ltd; Abbey Court Energy Service Ltd and Neimeth Pharmaceutical International Plc, in addition to 29 financial institutions.\nThe order also restrained persons from receiving and/or otherwise dissipating any dividend or profits held by anyone appointed by him and through any scheme which is under the custody of the 4th to 9th defendants.\nThe interim order of Mareva injunction also barred the 1st, 2nd and 3rd defendants from disposing of any of their assets, money.\nAlternatively, the court directed Zenith Bank to publish all the originating processes and other processes filed in two national dailies and adjourned till November 17, 2021, for the Report of Service."
  },
  {
    "headline": "Gbajabiamila declares Jos North/Bassa Federal Constituency seat vacant as ADP Rep defects to APC",
    "summarized_story": "Haruna Maitala who hitherto represented Jos North/Bassa Federal Constituency of Plateau State, the Speaker of the House of Representatives, Hon.\nThis was as another member from the minority caucus defected to the ruling All Progressives Congress (APC).\nAt the plenary yesterday, the Speaker announced the defection of the member representing Ogbomoso North, Ogbomoso South and Orire Federal Constituency of Oyo State, Hon.\nUntil his defection, Adejumo was a member of the Action Democratic Party (ADP).\nIn his defection letter read by the Speaker, Adejumo who was a former member of APC before defecting to ADP said he was going back home."
  },
  {
    "headline": "Mother of one stabbed to death three years after her only daughter was murdered in Ondo",
    "summarized_story": "By Dayo Johnson – AkureThree years after her only daughter, a model, Oluwaseun Ajila, was gruesomely murdered in cold blood, her 52 year old mother , Yemi Ajayi has equally been murdered in Akure, the Ondo state capital.\nRecall that her daughter, Oluwaseun was stabbed to death by unknown persons at their residence in year 2018.\nVanguard gathered that the mother was also reportedly stabbed to death yesterday at her residence located at Abusoro, in Akure metropolis.\n” The daughter told us that her corpse was wrapped with some of her clothes which the killers took from her wardrobe.\nShe said that the victim was stabbed thrice in the stomach by her killers."
  },
  {
    "headline": "Oluwo, traditionalists tango over sacrilege against Yoruba deities",
    "summarized_story": "By Shina Abubakar, OSOGBOTHE Oluwo of Iwo, Oba Abdulrosheed Akanbi and Traditional Religion Worshippers Association, TRAWSO, yesterday, traded tackles over sacrilege against Yoruba deities.\nThe Oluwo insisted that celebrating deities belittled traditional rulers, saying only God is worthy of worship by monarchs.\nBut the traditional religion adherents in the state threatened to embark on a million-man protest to Oluwo’s palace if Governor Adegboyega Oyetola of Osun State, did not compel the monarch to apologise for his sacrilege against Yoruba deities.\nI can’t be a slave to any deity – OluwoOluwo, while speaking at the maiden edition of God festival held at his palace, Iwo, said: “A king must celebrate the king of all kings.\n“I choose to celebrate that great servant that serves me day and night."
  },
  {
    "headline": "FG moves to rejig internal security framework",
    "summarized_story": "President Muhammadu BuhariBy Omeiza Ajayi – AbujaThe Federal Government has expressed greater commitment to strengthening Nigeria’s security architecture and has consequently inaugurated a 21-member committee to study the recommendations and implementation strategies on strengthening internal security framework and community policing in Nigeria.\nThe committee which is chaired by the Minister of Interior, Ogbeni Rauf Aregbesola has the Minister of Police Affairs, Muhammad Dingyadi as co-Chairman.\nInaugurating the committee Tuesday in Abuja, Mr Aregbesola in his remarks titled; ‘A Quantum Leap on National Security’, said the development was sequel to recommendations by the Senior Executive Course SEC 40, 2018 of the National Institute for Policy and Strategic Studies NIPSS on Strengthening Internal Security Framework and Community Policing in Nigeria.\n“Consequently, the Committee observed that the absence of a National Security Policy and Strategy document as well as a Monitoring and Evaluation Framework on Internal Security has negatively affected the operations of the Internal Security Agencies in the country which therefore necessitated the directive of Mr. President to approve an Inter-Ministerial Committee with all relevant stakeholders on Internal Security” to be put in place”, he stated.\n“Therefore, it calls for all seriousness to provide the needed apparatus and security architecture to fight insecurity in the country”, he added."
  },
  {
    "headline": "Nigeria convenes high-level business summit in Paris",
    "summarized_story": "The federal government is organising the Nigeria International Partnership Forum (NIPF) in Paris, the capital of France.\nThe high-level event on the sidelines of the annual Paris Peace Forum holds from 11th to 13th November.\nThe presidency said Ministers, Heads of MDAs, Nigerian and French private sector operators are also participating.\nAlso expected are Deputy Secretary General, United Nations (UN); Directors General of the World Trade Organisation (WTO), United Nations Industrial Development Organisation (UNIDO) and French Development Agency.\nPresident, Nigeria-France Business Council, Abdulsamad Rabi’u will lead business executives, across financial services, manufacturing, oil and gas."
  },
  {
    "headline": "Nigerian forces neutralize ISWAP terrorists in Borno’s Mafa town",
    "summarized_story": "Nigerian troops on Tuesday took out Islamic State’s West Africa Province (ISWAP) fighters in Borno State.\nThe battle with the sect members happened in Ngwom community under Mafa Local Government Area.\nThe terrorists sneaked into the locality on six gun trucks through a cattle crossing point in Mafa at about 6:50 pm.\nThe military believes ISWAP was on a mission to target its formation within the town.\n“We have counted four corpses of the invaders and still pursuing others using the track of blood in the bush."
  },
  {
    "headline": "Lagos govt reacts to report third mainland bridge shaking",
    "summarized_story": "The Federal Controller of Works in Lagos, Mr Olukayode Popoola, on Monday reassured the public that the Third Mainland Bridge in Lagos is structurally okay and safe for use.\nPopoola, in an interview with the News Agency of Nigeria (NAN) in Lagos, urged Nigerians to disregard rumours that the bridge was shaking, as speculated on social media.\nPopoola said the Third Mainland Bridge is very important to the federal government hence, the extra attention accorded the bridge which links the commercial hub on the Island in the state.\n“I have gone on Third Mainland Bridge today and have gone round the bridge and there is nothing like that bad portion being circulated.\n“I want to assure all residents of Lagos and road users that there is no problem with Third Mainland Bridge, it is safe and still comfortable,” he said."
  },
  {
    "headline": "Again, Pastor Taiwo Odukoya loses wife",
    "summarized_story": "Pastor Nomthi Rosemary Odukoya, wife of the founder of the Fountain of Life Bible Church, Taiwo Odukoya, is dead.\n“With deep regret and gratitude to God, we have to announce the passing of our Senior Pastor’s wife, Pastor Nomthi Odukoya.\nSo for now, till we meet again in glory, Goodbye Pastor Nomthi,” the statement added.\nPastor Taiwo lost his first wife, Pastor Bimbo Odukoya on December 10, 2005, as a result of the Sosoliso plane crash.\nIn 2010, Pastor Odukoya married Rosemary Nomthi, a South African."
  },
  {
    "headline": "Bandits open fire on police team in Zamfara, gun down 7 officers",
    "summarized_story": "Armed men suspected to be bandits have attacked a team of policemen in Zonai village in Magami district, Gusau Local Government Area of Zamfara State, killing at least seven officers.\nThe incident, which occurred on Tuesday, left residents in panic over fear of attack on the community.\nAccording to residents, the officers were returning from duty where they had mounted, a checkpoint near Zonai village along Gusau-Magami-Dansadau following frequent attacks on the community.\nWhen contacted by DAILY POST, the Zamfara State Police Public Relations Officer, SP Muhammad Shehu was unable to speak on the incident, saying “I will call you back later”.\nDAILY POST reports that Zamfara is one of the states in Northern Nigeria that has suffered insecurity in recent times following the activities of the bloodthirsty bandits."
  },
  {
    "headline": "Full list of 18th Abuja International Film Festival winners",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "Reps task security agencies on missing Vanguard reporter, Tordue Salem",
    "summarized_story": "The House of Representatives has urged all security agencies in the country to investigate and find a missing journalist, Mr Todue Salem, a reporter with Vanguard Newspaper, who disappeared on Oct. 13.\nEarlier, Elumelu had mentioned that Tordue, a member of the House of Representatives Press Corps reported for work on the fateful day and was last seen in Garki District before his sudden disappearance.\nThe lawmaker said his disappearance was immediately reported to the security agencies after all efforts by family and friends to find him proved abortive.\n“In spite of official efforts by the leadership of the house to galvanise the security agencies to resolve his disappearance, there has been no headway.\n- Advertisement -“This sudden disappearance is an extension of the deteriorating insecurity in the nation’s capital and again questions the efficiency of the security operatives."
  },
  {
    "headline": "Police place N5m bounty on fleeing kidnapping suspects in Ekiti",
    "summarized_story": "The Ekiti State Police Command has placed N5 million as a reward for genuine information on the whereabouts of four suspects over alleged kidnapping in the state.\nAbutu said the four now at large were mentioned as gang members by other arrested suspects currently in police custody.\nAccording to him, the suspects were involved in the abduction of prominent Ekiti citizens in the last two years.\n- Advertisement -“They also mentioned one Samuel a.k.a Samuel Ebira, Jimoh Dele a.k.a Dele Petim, Dayo a.k.a Dayo Igwe and Johnson a.k.a Yellow Okada who are presently at large as other members of their gang,” he said.\nAccording to him, the arrested suspects had confessed that they had been involved in various kidnappings in the state."
  },
  {
    "headline": "APC members now 305 in House of Reps",
    "summarized_story": "The rank of the All Progressives Congress (APC) in the House of Representatives swelled by one on Tuesday following the defection of Jacob Ajao Adejumo from the Action Democratic Party(ADP).\nSpeaker Femi Gbajabiamila, who read the letter of defection, said the number of members of the party in the House has increased to 305.\nAdejumo said he was defecting to the APC after due consultation with his constituents.\nHe said he left the APC before because he was denied a ticket to contest the elections, adding that he was returning home.\n- Advertisement -There have been several defections from opposition party members in the House to the APC in recent times."
  },
  {
    "headline": "breaking-again-pastor-odukoya-loses-wife",
    "summarized_story": "Nomthi Odukoya, the South African wife of Pastor Taiwo Odukoya has diedPastor Taiwo Odukoya is the senior pastor of The Fountain of Life Church and he announced her death in a post on his Instagram page on Tuesday evening.\nAccording to him, Nomthi “battled cancer for the better part of two years.”Latest Jobs in Nigeria (Graduates/Non-graduates).\nAlso, a member of the Church, who spoke to the media on condition of annonymity, said Nomthi has not been involved in church activities for a while.\nSetup your own platform that allows you to earn a minimum of ₦100,000 daily, payments are in US dollars, 100% legitimate .Click here to start now .\nClick here ."
  },
  {
    "headline": "Breaking: IPOB declares sit-at-home Wednesday",
    "summarized_story": "From Stanley Uzoaru,OwerriThe Indigenous People of Biafra(IPOB) has declared a sit-at-home on Wednesday in solidarity of its leader,Nnamdi Kanu who appears in court same day on his trial on human rights violation.\nIPOB has exempted hospitals and its staff as well as journalists from the order.\n“Our leader Mazi Nnamdi Kanu goes to court tomorrow 10th of November and our people should stay indoors while others move to Abuja in solidarity with our leader Mazi Nnamdi Kanu and we are expecting Nigeria government and DSS to release him unconditionally because he commited no crime to seek his people’s freedom from Nigeria.\n“We hope people will comply to this order and obey our resolve to support our leader Mazi Nnamdi Kanu.\nIPOB must allow our people like doctors, hospitals, nurses, ambulance and journalists to operate during the sit-at-home because we don’t want pregnant women, sick people to have issue or complications because of their health."
  },
  {
    "headline": "Anambra Election: Army refuses APGA chieftain entry into Ihiala headquarters",
    "summarized_story": "A mild drama ensued at the Ihiala Local Government area of Anambra State where a supplementary election is being held to determine the winner of the Anambra governorship election.\nINEC had on Monday morning, November 8 declared the Anambra state governorship election inconclusive due to the inability of INEC officials to conduct elections in Ihiala due to security challenges.\nA supplementary election has been scheduled to hold in the local government today to enable 148,000 eligible voters to cast their votes.\nAs the election commenced, APGA chieftain, Victor Umeh visited the local government headquarters but was turned back by the security agents.\n“You are not supposed to be here,” the GOC screamed at Umeh who insisted that he was there “to ensure things go well”."
  },
  {
    "headline": "We’ve recorded milestone in recovery of looted assets, says Malami",
    "summarized_story": "Minister of Justice, Abubakar Malami, SAN, has said that the ministry has recorded an appreciable milestone in the recovery of looted assets in the country.\nHe said this during the budget defence before the House of Representatives Committee on Justice, yesterday, in Abuja.\nHe stated that the ministry was mandated to embark on the recovery of looted assets, adding that it had recorded an appreciable milestone.\nHe said that the justice sector reforms the ministry is currently undertaking are costly to execute, while calling for support with adequate funding to successfully prosecute them.\nHe said lamentably, however, practically all the parastatals under the purview of the Federal Ministry of Justice are in dire need of funding."
  },
  {
    "headline": "Collapsed building: Lagos Assembly seeks compensation for bereaved families",
    "summarized_story": "Lagos House of Assembly has called on Governor Babajide Sanwo-Olu to compensate families of the victims of the collapsed 21-storey building in Ikoyi.\nThe assembly arrived at the resolution, sequel to a motion moved by Mr Nurein Akinsanya (Mushin I), during plenary on Monday in Lagos.\nDeath toll in the collapsed building has hit 44.\nAkinsanya, who is the Chairman, House Committee on Physical Planning and Urban Development, expressed worries over the incessant collapse of buildings in the state.\n“This house is also worried that over time, the state has recorded series of building collapse, like the five-storey building that collapsed in Lekki in November 2006 and the three-storey building that collapsed in Ita Faaji, Lagos Island in 2016, among others."
  },
  {
    "headline": "Breaking: Soludo Wins Ihiala LGA",
    "summarized_story": "By David-Chyddy Eleke in AwkaThe All Progressives Grand Alliance candidste, Prof Chukwuma Soludo, has won Tuesday’s supplementary governorship election in Ihiala Local Government Area or Anambra StateThe Independent National Electoral Commission, INEC had on Sunday after announcing 20 out of the 21 Local Government Areas of the state scheduled a supplementary election in Ihiala, after being unable to deploy materials to the area on Saturday.\nAnnouncing the result, Dr German Anagbogu of the University of Calabar, who worked as the returning officer for the local government stated that: “12,298 is the total number of accredited voters in the area.”He said, the All Progressives Congress, APC polled, 343 votes, APGA polled, 8,283, the Peoples Democratic Party, PDP polled 2,485, while the Young Progressives Party, YPP got 344 votes.\nThis brings to 19, the number of local government areas won by the APGA in the election.\nAnagbogu however reported that elections were not held in two communities because of resistance.\nHe said: “In the process of the election, we received report that there was resistance in Orsumoghu and Lilu, as INEC deployed to the communities, but could not enter.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: Fountain of Life Pastor, Odukoya, Loses Wife, Nomthi",
    "summarized_story": "Chiemelie EzeobiPastor Rosemary Simangele Nomthi Odukoya, the wife of the Presiding Pastor of The Fountain of Life Church, Pastor Taiwo Odukoya, is dead.\n“She gave me 11 beautiful years of marriage and two wonderful boys, who I know will be very significant in life.\nSo for now, till we meet again in glory, Goodbye Nomthi.”The duo had been married for 11 years and they celebrated their anniversary on January 5 at the Fountain of Life Church, Ilupeju, Lagos.\nThe marriage came four years after his first wife, late Pastor Bimbo Rosemary Odukoya (née Williams), died in the 2005 Sosoliso air crash.\nPrior to her death, she was an associate senior pastor at Fountain of Life Church and chairperson of Fountain Initiative for Social Development and the founder."
  },
  {
    "headline": "Breaking: National Assembly Okays Electronic Transmission of Results, Direct Primary",
    "summarized_story": "Emameh GabrielThe National Assembly has adopted the electronic transmission of election results in line with the position of the Independent National Electoral Commission (INEC).\nSimilarly, the legislative body also resolved that political parties should adopt direct primary as mode of electing their candidates for elective offices.\nThe resolutions were part of the final recommendations of both the Senate and House of Representatives Conference Committee report on a Bill for an Act to repeal the Electoral Act No.6,2010 and enact The Electoral Act 2010.\nThe conference committee considered the differences in 21 clauses (1,5,6,15,16,,17,23,24,31,36,43,49,50,52,63,76,87,97,98,117 and 135) and the Explanatory Memorandum.\nHe expressed joy that the “citizens top priorities” on the Electoral Act Amendment including the use of technology have been addressed by the Electoral Bill, 2021″."
  },
  {
    "headline": "Live Updates: Anambra Governorship Election",
    "summarized_story": "3:17PMSupplementary Poll: Police Deny Alleged Killing by Soldiers By David-Chyddy Eleke in Awka Police in Anambra have denied knowledge of killing of anybody during the Anambra State Governorship Supplementary Election in Ihiala Local Government Area of the state.\nAnambra State must now become a state run on the basis of the will and desire of our people.\nI will vote APGA tomorrow and be assured Ihiala will massively vote APGA tomorrow.”MONDAY, NOVEMBER 8, 202112:50AMBreaking: INEC Declares Anambra Election Inconclusive, Poll Holds in Ihiala TuesdayBy David-Chyddy Eleke in AwkaThe Independent National Electoral Commission, INEC has declared the Anambra governorship election inconclusive.\n(NAN)7:03PMAnambra Election: Counting of Votes Under way Counting of votes has started in some polling units in Awka township after Saturday governorship election in Anambra.\n11:04AMAnambra Guber: Obiano Votes in Aguleri, Urges Voters to Come outDavid-Chyddy Eleke in AwkaThe Governor of Anambra State, Chief Willie Obiano, was among the first voters in the on-going gubernatorial election in Anambra State."
  },
  {
    "headline": "Buhari Arrives France, to Meet President Macron Wednesday",
    "summarized_story": "During the state visit, the President is expected to discuss bilateral relations bordering on security, health and economy between Nigeria and France with President Macron.\nAfter the state visit, the President will also in Paris attend the three-day Paris Peace Forum (PPF), from Thursday, November 11 to Saturday, November 13, 2021.\nOther speakers include President Macron, Vice President Kamala Harris of United States, and Sheikh Hasina, Prime Minister of the People’s Republic of Bangladesh.\nAmong the attendees were Russian President Vladimir Putin, Canadian Prime Minister Justin Trudeau and 2018 Nobel Peace Prize laureate Nadia Murad.\nGerman Chancellor Angela Merkel and UN Secretary-General António Guterres joined President Emmanuel Macron, each making an opening remark at the beginning of the Forum."
  },
  {
    "headline": "Nigeria's Secret Police, DSS Mobilise Thugs To Attack Sowore During Kanu’s Trial On Wednesday",
    "summarized_story": "A source told SaharaReporters that a contingent of the DSS arrived and took over the court premises on Tuesday.\nThe source also revealed that the DSS operatives instructed the thugs to inflict harm should there be any resistance.\nIt took the intervention of journalists to stop the assault on Sowore at the time.\n\"They told them to inflict harm if there is any resistance and promised them that nobody will intervene,\" the source told SaharaReporters on Tuesday.\nRecall that the DSS had made similar arrangements during the last trial held in October, allowing three vehicles packed with thugs to arrive on the court premises to attack Sowore."
  },
  {
    "headline": "Nigeria's Secret Police, DSS Mobilise Thugs To Attack Sowore During Kanu’s Trial On Wednesday",
    "summarized_story": "A source told SaharaReporters that a contingent of the DSS arrived and took over the court premises on Tuesday.\nThe source also revealed that the DSS operatives instructed the thugs to inflict harm should there be any resistance.\nIt took the intervention of journalists to stop the assault on Sowore at the time.\n\"They told them to inflict harm if there is any resistance and promised them that nobody will intervene,\" the source told SaharaReporters on Tuesday.\nRecall that the DSS had made similar arrangements during the last trial held in October, allowing three vehicles packed with thugs to arrive on the court premises to attack Sowore."
  },
  {
    "headline": "Nigeria's Secret Police, DSS Mobilise Thugs To Attack Sowore During Kanu’s Trial On Wednesday",
    "summarized_story": "A source told SaharaReporters that a contingent of the DSS arrived and took over the court premises on Tuesday.\nThe source also revealed that the DSS operatives instructed the thugs to inflict harm should there be any resistance.\nIt took the intervention of journalists to stop the assault on Sowore at the time.\n\"They told them to inflict harm if there is any resistance and promised them that nobody will intervene,\" the source told SaharaReporters on Tuesday.\nRecall that the DSS had made similar arrangements during the last trial held in October, allowing three vehicles packed with thugs to arrive on the court premises to attack Sowore."
  },
  {
    "headline": "BREAKING: Buhari In Paris After ’Secret’ Medical Checkup In London",
    "summarized_story": "President Muhammadu Buhari on Tuesday departed London, United Kingdom, for Paris, France.\nHis presidential aircraft, a Gulfstream Aerospace GV-SP (G550) with registration number 5N-FGW and serial number 5310 (Mode-S 0640F2) left the Glasgow International Airport at 10:14 pm (9:14 UK time) and arrived at Stansted Airport, London at 11:11 pm (10:11 pm UK time).\nHe said, “President Muhammadu Buhari Tuesday afternoon arrived in Paris, French capital, for a one-day official visit as guest of President Emmanuel Macron at Palais de l'Élysée, and will afterwards attend the three-day Paris Peace Forum (PPF), November 11-13, 2021.\nOther speakers include President Macron, Vice President Kamala Harris of United States, and Sheikh Hasina, Prime Minister of the People’s Republic of Bangladesh.\n“Among the attendees were Russian President Vladimir Putin, Canadian Prime Minister Justin Trudeau and 2018 Nobel Peace Prize laureate Nadia Murad."
  },
  {
    "headline": "BREAKING: Buhari In Paris After ’Secret’ Medical Checkup In London",
    "summarized_story": "President Muhammadu Buhari on Tuesday departed London, United Kingdom, for Paris, France.\nHis presidential aircraft, a Gulfstream Aerospace GV-SP (G550) with registration number 5N-FGW and serial number 5310 (Mode-S 0640F2) left the Glasgow International Airport at 10:14 pm (9:14 UK time) and arrived at Stansted Airport, London at 11:11 pm (10:11 pm UK time).\nHe said, “President Muhammadu Buhari Tuesday afternoon arrived in Paris, French capital, for a one-day official visit as guest of President Emmanuel Macron at Palais de l'Élysée, and will afterwards attend the three-day Paris Peace Forum (PPF), November 11-13, 2021.\nOther speakers include President Macron, Vice President Kamala Harris of United States, and Sheikh Hasina, Prime Minister of the People’s Republic of Bangladesh.\n“Among the attendees were Russian President Vladimir Putin, Canadian Prime Minister Justin Trudeau and 2018 Nobel Peace Prize laureate Nadia Murad."
  },
  {
    "headline": "#AnambraDecides: Attack on election officials caused late deployment to Ihiala LGA, says REC",
    "summarized_story": "Nkwachukwu Orji, resident electoral commissioner (REC) in Anambra, says some election officials posted to Ihiala LGA were attacked on their way to the area.\nObi said the decision to suspend the collation of results was to give room for a supplementary election in Ihiala LGA.\nAdvertisementAhmadu Umar, the collation officer for Ihiala LGA, had earlier said there was no election in the entire area.\nAhead of the supplementary election, INEC adjusted the voting time and said election would be conducted from 10am to 4pm.\nI think the security agencies are on to this, but the point is that the attack was a major setback,” he said."
  },
  {
    "headline": "#AnambraDecides: Attack on election officials caused late deployment to Ihiala LGA, says REC",
    "summarized_story": "Nkwachukwu Orji, resident electoral commissioner (REC) in Anambra, says some election officials posted to Ihiala LGA were attacked on their way to the area.\nObi said the decision to suspend the collation of results was to give room for a supplementary election in Ihiala LGA.\nAdvertisementAhmadu Umar, the collation officer for Ihiala LGA, had earlier said there was no election in the entire area.\nAhead of the supplementary election, INEC adjusted the voting time and said election would be conducted from 10am to 4pm.\nI think the security agencies are on to this, but the point is that the attack was a major setback,” he said."
  },
  {
    "headline": "#AnambraDecides: Security operatives clash with gunmen in Ihiala LGA",
    "summarized_story": "A joint team of security operatives, earlier on Tuesday, clashed with gunmen in Ihiala LGA during the supplementary governorship election.\nAdvertisementThe Independent National Electoral Commission (INEC) had suspended the collation of results for the November 6 governorship election, and said a supplementary poll will hold in Ihiala LGA before a winner can be announced.\nElection was unable to hold in the LGA as some election officials deployed to the area on Saturday were attacked.\nAdvertisementSecurity operatives comprising officers of the army, police, immigration, asked journalists to leave the area for their safety.\nMeanwhile, in another development, there were reports of a shooting around the LGA headquarters, said to have led to the death of a resident."
  },
  {
    "headline": "#AnambraDecides: Security operatives clash with gunmen in Ihiala LGA",
    "summarized_story": "A joint team of security operatives, earlier on Tuesday, clashed with gunmen in Ihiala LGA during the supplementary governorship election.\nAdvertisementThe Independent National Electoral Commission (INEC) had suspended the collation of results for the November 6 governorship election, and said a supplementary poll will hold in Ihiala LGA before a winner can be announced.\nElection was unable to hold in the LGA as some election officials deployed to the area on Saturday were attacked.\nAdvertisementSecurity operatives comprising officers of the army, police, immigration, asked journalists to leave the area for their safety.\nMeanwhile, in another development, there were reports of a shooting around the LGA headquarters, said to have led to the death of a resident."
  },
  {
    "headline": "LIVE: Finally, INEC announces results from Ihiala LGA",
    "summarized_story": "Loading, Please Wait!\nThis may take a second or two."
  },
  {
    "headline": "How to secure funding for your early-stage startup in Africa",
    "summarized_story": "Ayobami and Ayobamigbe work with Ingressive Capital, a venture capital firm that writes up to $400K cheques to early-stage startups.\nDisrupt Africa reported a 68.4% jump in the number of investors in 2020 (370 investors) from 2019’s reported number of 261 investors.\nStartup accelerators like Y Combinator and TechStars have become incredible partners to the growth of the African startup ecosystem.\nwith FirstCheck Africa, Let’s Talk with Microtraction), Invest in the Future with Future Africa), and How I Got Funded (Ingressive Capital).\nYour investment pitch deck should address the pivotal questions of the problem, why the problem matters, your solution, and the market opportunity (total addressable market)."
  },
  {
    "headline": "Nestcoin wants to create wealth with crypto beyond trading",
    "summarized_story": "The brainchild of Taiwo Orilogbon and Yele Bademosi, Nestcoin is a parent company that wants to create crypto-native products beyond trading and investments, with a focus on driving the adoption of crypto in Africa.\nIt wants to do this through its media publication, Breach, and other products that use crypto technology—spanning across DeFi, media, digital art and gaming.\nBefore Nestcoin, Bademosi was a former director at Binance’s venture capital programme.\nIncentivising the crypto communityNestcoin wants to create a community of users that understands crypto, as a way to make their lives easier.\nNestcoin will then harness the power of this community to create new products and embark on projects that can generate revenue."
  },
  {
    "headline": "MTN Group to sell $245m-worth shares of Nigerian subsidiary",
    "summarized_story": "South Africa-based MTN Group has announced plans to sell 575 million shares of its most profitable subsidiary MTN Nigeria, which went public in Lagos in 2019.\nThe offer is expected to close in December 2021.”The transaction will see MTN Group rake in proceeds of about ₦101 billion ($245 million), based on MTN Nigeria’s (MTNN) current share price of ₦175.60.\nA Bit of HistoryThe planned sell-off is part of a broader intention, announced by MTN Group earlier, to sell down 14% of its current shareholding in the Nigerian unit.\nLast year, the Johannesburg-based group was unable to repatriate its $280 million dividend from its Nigerian subsidiary due to the challenges of securing foreign currency, amid the country’s forex liquidity crisis.\nDespite the domestic challenges, MTN Nigeria has shown resilience."
  },
  {
    "headline": "Lemonade Finance raises money to ease diaspora remittances",
    "summarized_story": "That’s why Lemonade Finance, a Nigerian startup that wants to ease the payment process for Africans in North America and Europe, was founded.\nLemonade Finance faces regulatory and compliance problems.\nBut Lemonade Finance is dedicated to letting global banks know that lowering financial barriers into Africa is a beneficial and strategic move.\nThey have been able to get some of their partner banks to green-light Nigeria, Kenya, Cameroon and some other West African countries.\nCurrently, Lemonade Finance is only live in Canada, where it has gained thousands of customers already."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "From NFTs to DeFi, Nestcoin wants to simplify all things crypto to boost adoption in Africa",
    "summarized_story": "AdvertisementToday, the company is also launching its first product, a crypto media platform — Breach.\nAccording to Bademosi, Nestcoin is an umbrella company with several blockchain and crypto products.\nHowever, the threat to crypto products or platforms doesn’t end with security concerns; regulations also play an important role in their survival.\nMore Nestcoin products?\nWhile Breach leads the way as the first in several products, Nestcoin will roll out more products with time."
  },
  {
    "headline": "What MTN, Airtel PSB licence approval could mean for financial inclusion in Nigeria",
    "summarized_story": "As expected, the announcements were greeted with support by Nigerians and hailed as an essential step in deepening financial inclusion in the country.\nSo what does this mean for financial inclusion in Nigeria?\nSince 2012, an often-stated goal of the CBN has been to deepen financial inclusion in the country.\nThe World Bank defines financial inclusion as access to valuable and affordable financial products and services delivered responsibly and sustainably.\nThere is no doubt that granting these telcos a PSB licence would boost the CBN’s financial inclusion goals."
  },
  {
    "headline": "Pitchstorm 3.0 is here; apply for a chance to win $10,000 for your startup",
    "summarized_story": "This saw us suspend all Pitchstorm-related activities for Techpoint Africa’s third annual Techpoint Build event, Techpoint Build 2020.\nWith the flagship event here again in 2021, we are happy to announce applications for Pitchstorm, with entries from all African countries.\nTechpoint Africa Pitchstorm is a pan-African startup competition focused on amplifying the work of startups pushing the envelope with world-class solutions.\nWhat to expect at this edition of PitchstormAlignment with Techpoint Build 2021 themeFollowing the theme of Techpoint Build 2021, The next frontier, Pitchstorm 3.0 will aim to identify one startup that best “illustrates” and “executes” on futuristic goals of its industry.\nPrize moneyIn typical fashion, the prize money for Pitchstorm 3.0 is $10,000."
  },
  {
    "headline": "Nigeria, 49 others pledge to end health sector emissions",
    "summarized_story": "Experts say the healthcare industry contributes about 4-5 percent of greenhouse gas emissions globally.\nThese countries have committed to lower their emissions of carbon dioxide, the main greenhouse gas that is warming the world, across their health systems.\nAccording to Levine, as part of COP 26 health programmes, countries were asked to commit to publish a plan sending out how they would develop their health systems, to minimise carbon emissions and air pollution, based on a baseline assessment of the health systems greenhouse gas emissions.\n“Health systems also contribute to air pollution which is a critical driver of premature deaths and hospital emissions,” Levine said.\nCarrying out these commitments will require countries to significantly retool their health systems, to make them more efficient using clean energy."
  },
  {
    "headline": "Electoral Act ready for Buhari’s assent in 7 days – Reps",
    "summarized_story": "The Electoral Amendment Bill will be transmitted to President Muhamadu Buhari for assent in the next seven days, spokesperson of the House of Representatives, Benjamin Kalu, has said.\nKalu stated this while briefing journalists alongside the chairman of the House Conference Committee on the Electoral Act Amendment Bill, Akeem Adeyemi (APC, Oyo) after the parliament adopted the report of the committee.\nRead Also: Okowa commends NASS for passing Electoral Act amendment bill 2021But in the conference committee report, both chambers empowered INEC to determine the best mode to transmit election results, including electronic transfer.\n“This bordered on the issue of transmission of results as well as direct or indirect primary by the political parties.\nSimilarly, the chairman of the Conference Committee, Adeyemi said the National Assembly has finally concluded its own side of the Electoral Act Amendment Bill and the next phase is the presidential assent."
  },
  {
    "headline": "FG to float national housing bond to address housing deficit in Nigeria",
    "summarized_story": "The federal government has disclosed plans to float a National housing bond for real estate developers to address housing deficit in the country.\nBabatunde Raji Fashola, Minister of Works and Housing, commending the efforts of relevant agencies towards addressing the nation’s housing deficit, said that Nigeria currently needs a plan that is workable, accessible and sustainable to finance the housing deficit.\n“Lessons from that endeavour must shop and guide our steps towards a successful outing for the National housing bond,” he said.\n“It is in this regard that the ministry of finance, budget and National planning welcome the idea of national housing bond being proposed.\n“National housing bonds in their various forms have delivered housing finance systems in several countries,” she said."
  },
  {
    "headline": "Edo begins issuance of building plans, conveyance letters processed in 10 days – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government, on Tuesday, flagged off the distribution of building plans and conveyance letters to applicants whose applications were processed within the last 10 days.\nCommissioner for Physical Planning and Urban Development, Isoken Omo said the development is part of Governor Godwin Obaseki-led government’s efforts at embracing e-governance.\nAccording to him, “This new trend of doing things is to introduce us to electronics records; the new plan shows what the master plan is.\nFor us to approve your plan, it means that the land used and the structure is within the master plan.\n“The approved Conveyance Letter stipulates what you should do and not do and consequences against it."
  },
  {
    "headline": "Obaseki receives Okogie in Benin as cardinal blames nation’s woes on poor leadership choices – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, received in audience, the Emeritus Archbishop of the Catholic Archdiocese of Lagos, Cardinal Olubunmi Okogie, who is in Benin for the 90th birthday celebration of Archbishop Patrick Ekpu, the Emeritus Archbishop of Benin.\nReceiving the clergy at the Government House in Benin City, the governor celebrated Cardinal Okogie, describing him as an icon and a father.\nThe governor said, “The Cardinal came to pay me a courtesy visit; you know he is our father.\nHe is here in Benin to celebrate another icon, Archbishop Patrick Ekpu, the Emeritus Archbishop of Benin who will be 90 years tomorrow.\nWe vote for them because of the three or four pence they will give us,” Okogie added."
  },
  {
    "headline": "Female Genital Mutilation still rampant in Nigeria …UNFPA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAlthough certain authorities recently put the practice of Female genital mutilation, FGM, in Nigeria as down to 20%According to the 2018 NDHS, an overall 20 per cent of women aged 15-49 are still required to be circumcised before their marriages.\nThe Nigeria Demographic and Health Survey (NDHS) in 2013 had also reported that the prevalence of FGM was above 20 per cent for women aged 15-49.\nGiving the latest update after a walk against FGM in Abuja, the UNFPA resident representative in Nigeria, Ulla Müller, said the NDHS 2018 survey indicates a downward slope that is doubtful.\nThe official said; “In Nigeria, according to the 2018 NDHS, an overall 20 per cent of women aged 15-49 have been circumcised, down 5 per cent from the 2013 NDHS.\nThe convener of the event and President of WAVE Foundation, Lola Ibrahim, indicated measures that could help to eradicate the harmful practice in Nigeria."
  },
  {
    "headline": "Alaghodaro 2021: Abaribe, Onobun, others to share insights on role of governance, institutions in unlocking devt, attracting investors – Nigerian Observer",
    "summarized_story": "Alaghodaro 2021: Abaribe, Onobun, others to share insights on role of governance, institutions in unlocking devt, attracting investorsShare FacebookTwitterStumbleuponLinkedInPinterest…to brainstorm on perspectives for reinventing governance in EdoBENIN CITY – Senate Minority Leader, Sen. Enyinnaya Abaribe; Speaker, Edo State House of Assembly, Rt.\nMarcus Onobun and Special Adviser to the President on Ease of Doing Business, Dr. Jumoke Oduwole are among guests expected to share insights and perspectives on the bottom-top approach to reinventing governance and highlight strategies to improving the business environment, on a panel session at this year’s Alaghodaro Summit.\nOthers listed for the plenary session include the Executive Director, African Network for Environment and Economic Justice, Rev.\nDavid Ugolor and Edo State Commissioner for Finance, Mr. Joseph Eboigbe, while Regional Director, Africa, BBC Global News, Ms. Yewande Adewusi will serve as moderator.\n“The session will also discuss the primacy of good governance and strong institutions in unlocking development; highlight the role of government in improving the business environment to attract local and foreign investments; emphasize the importance of legislations in underpinning good governance and identify critical responsibilities of citizens as well as strategies for encouraging and mobilizing them.”..."
  },
  {
    "headline": "Pastor Taiwo Odukoya announces death of wife, Nomthi",
    "summarized_story": "Nomthi, the wife of Taiwo Odukoya, the senior pastor of The Fountain of Life Church, is dead.\nLate Nomthi, a South African, died at the age of 47.\nMr Odukoya announced her death in a post on his official Instagram page on Tuesday evening.\n“With deep regret and gratitude to God, I have to announce the passing of my wife, Pastor Nomthi Odukoya,” he wrote.\nMr Odukoya’s first wife, Bimbo, was a popular televangelist who died in the ill-fated Sosoliso crash on December 10, 2005."
  },
  {
    "headline": "Bandits Ambush Police Team In Zamfara, Kill 7 Officers",
    "summarized_story": "Bandits on Monday killed not less than seven policemen in an ambush near Zonai village in Magami district in Gusau Local Government Area of Zamfara State.\nAccording to residents, the policemen were returning from duty where they mounted a check point near Zonai village along Gusau-Magami-Dansadau road when the armed gang opened fire on the vehicle conveying the officers, Daily Trust reported.\nDozens of travellers have been killed or kidnapped along the 50 km Gusau-Magami road.\nIt is really sad and tragic,” a resident simply identified as Halliru told Daily Trust.\nHowever, the Public Relations Officer of the Yariman Bakura Specialist Hospital, Awwal Usman Ruwandoruwa, told Daily Trust that the remains of the slain officers were brought to the hospital around 8am on TuesdayFacebook Notice for EU!"
  },
  {
    "headline": "U.S. Govt To Support Efforts Towards Strengthening Criminal Justice Administration in Ogun State",
    "summarized_story": "Ambassador Mary Beth Leonard, Tuesday, joined Ogun State Governor, Prince Dapo Abiodun, and Chief Judge of Ogun State, Justice Mosunmola Dipeolu, for the launch of an electronic court scheduling and case management system for the state judiciary.\n“The new case management system was developed as a solution to promote efficiency in the allocation of time and resources to court cases.\nChief Judge Dipeolu urged judges, magistrates and other judicial officers in the state to embrace the new electronic system.\nFollowing the U.S. Mission’s initial support, Olaniwun Ajayi Legal Practitioners and Ogun State authorities expanded on the project and digitized the process into a multi-user electronic system.\nINL works with partner governments to help reduce crime, promote public safety, and to ensure that people have access to a functioning justice system that is fair, transparent, and accountable."
  },
  {
    "headline": "Gombe Gov addresses explains rift with Goje",
    "summarized_story": "Gombe State governor, Muhammadu Inuwa Yahaya, has blamed its recent political rift with Senator Danjuma Goje, a former governor of the state on alleged insistence by the latter to control him.\n“Well, the party has its principles and that’s what obtains in every party and that of Gombe cannot be different,” he said.\n“The issue we had before now was caused by a former Governor of the State, Danjuma Goje, a serving Senator, who you all know.\nLet’s wait for the outcome of the investigation but whoever knows the history of Gombe knows who Goje is and they know who Inuwa is.\nBoth I and Goje don’t know if we will see the year 2023."
  },
  {
    "headline": "Gombe Finances: Yahaya administration sets the record straight",
    "summarized_story": "OBINNA EZUGWUThe Governor Muhammadu Inuwa Yahaya administration in Gombe State, has provided detailed breakdown of the state’s finances, providing records of it’s assets and obligations, amid accusations of financial misappropriation by the opposition figures in the state.\nHowever their days of mischief are numbered, and the good people of Gombe State know who they are.\nIt is rather a pity that some faceless groups suddenly sprang up all in the name of attacking the Gombe State Government.\n81.63BNTOTAL MONTHLY900.4MAccording to him, “Cumulatively, the Muhammadu Inuwa Yahaya administration pays N900.4m monthly to service the aforementioned inherited facilities!\n“The desire of the Muhammadu Inuwa Yahaya administration to bequeath a better and more economically viable State brought about the idea to raise the N35bn Sukuk bond."
  },
  {
    "headline": "Again, Pastor Taiwo Odukoya Loses Wife To Cancer",
    "summarized_story": "Pastor Nomthi Odukoya, wife to the senior pastor of the Fountain of Life Church, Pastor Taiwo Odukoya, has passed on.\nThe statement reads: “With deep regret and gratitude to God, we have to announce the passing of our Senior Pastor’s wife, Pastor Nomthi Odukoya.\nSo for now, till we meet again in glory, Goodbye Pastor Nomthi.”Recall that Pastor Odukoya lost his first wife, Pastor Bimbo Odukoya, on December 10, 2005, in a Sosoliso plane crash in Port Harcourt, Rivers State.\nThe late Pastor Bimbo had flew on Sosoliso Airline, from Abuja to Port Harcourt, where the plane crashed on landing due to bad weather.\nIn 2010, her husband, Pastor Taiwo married again to a South African, Nomthi, who passed on Tuesday."
  },
  {
    "headline": "Again, Pastor Taiwo Odukoya Loses Wife To Cancer",
    "summarized_story": "Pastor Nomthi Odukoya, wife to the senior pastor of the Fountain of Life Church, Pastor Taiwo Odukoya, has passed on.\nThe statement reads: “With deep regret and gratitude to God, we have to announce the passing of our Senior Pastor’s wife, Pastor Nomthi Odukoya.\nSo for now, till we meet again in glory, Goodbye Pastor Nomthi.”Recall that Pastor Odukoya lost his first wife, Pastor Bimbo Odukoya, on December 10, 2005, in a Sosoliso plane crash in Port Harcourt, Rivers State.\nThe late Pastor Bimbo had flew on Sosoliso Airline, from Abuja to Port Harcourt, where the plane crashed on landing due to bad weather.\nIn 2010, her husband, Pastor Taiwo married again to a South African, Nomthi, who passed on Tuesday."
  },
  {
    "headline": "2023: Nigeria Needs A Uniter-in-Chief In Saraki – Faringado",
    "summarized_story": "Ahead of the 2023 general elections, a young politician, Umar Faringado Kazaure, has called on a former Senate President, Dr. Bukola Saraki, to throw his hat into the ring and contest for the office of the President as Nigerians would need his qualities as the next President.\nFaringado, who is the national coordinator of Saraki Is Coming Door To Door organisation, said given the current divisions and tensions in the country, only a uniter-in-chief like Saraki would be able to salvage the wcountry.\nIn a statement in Abuja on Tuesday, Faringado said Saraki should heed the calls of millions of Nigerians who are clamouring for his leadership at the nation’s helms of affairs come 2023.\nAbubakar Bukola Saraki’s peaceful, all-embracing and tolerant disposition will engender the much needed type of leadership Nigeria desires presently.\n“Therefore, Dr. Abubakar Bukola Saraki is eminently qualified to assume the mantle of leadership of Nigeria come 2023."
  },
  {
    "headline": "2023: Nigeria Needs A Uniter-in-Chief In Saraki – Faringado",
    "summarized_story": "Ahead of the 2023 general elections, a young politician, Umar Faringado Kazaure, has called on a former Senate President, Dr. Bukola Saraki, to throw his hat into the ring and contest for the office of the President as Nigerians would need his qualities as the next President.\nFaringado, who is the national coordinator of Saraki Is Coming Door To Door organisation, said given the current divisions and tensions in the country, only a uniter-in-chief like Saraki would be able to salvage the wcountry.\nIn a statement in Abuja on Tuesday, Faringado said Saraki should heed the calls of millions of Nigerians who are clamouring for his leadership at the nation’s helms of affairs come 2023.\nAbubakar Bukola Saraki’s peaceful, all-embracing and tolerant disposition will engender the much needed type of leadership Nigeria desires presently.\n“Therefore, Dr. Abubakar Bukola Saraki is eminently qualified to assume the mantle of leadership of Nigeria come 2023."
  },
  {
    "headline": "2023: CSO Begins Campus Engagement On Political Participation",
    "summarized_story": "A leading civil society organisation (CSO), YIAGA Africa, has commenced engagement with students in campuses on political participation ahead of the 2023 general elections.\nThe programme, tagged: “Discussion on Youth Civic Engagement: The Role of Youth in Decision-making and the Prospects of Increased Youth Political Participation,” commenced at the University of Abuja main campus Gwagwalada.\nIn the realisation of the fact that students in campuses form the majority of prospective voters, the students were encourage to register and participate in the polity.\nNdidi, who said the FCT INEC was happy with such engagements, urged the students to speak to them for improved political participation.\nADVERTISEMENTHe said the youths must be registered voters to be part of the political process, adding: “For you to be a voter, you must be registered and the continue voter registration exercise is ongoing."
  },
  {
    "headline": "Qatar 2022: Ndidi, Chukwueze, Iwobi Hit Eagles Camp",
    "summarized_story": "Nine-pointer Nigeria need all three points from the encounter with the Lone Star in order to stay in contention to star in the knockout phase of the World Cup qualifiers, set for March 2022.\nCape Verde’s Blue Sharks, who hosts Central African Republic in Mindelo on Saturday, have seven points and will be hoping the Super Eagles stumble in North Africa.\nFor the 2021 AFCON in Cameroon, the Super Eagles qualified with two matches to spare.\nMeanwhile, the delegation of Liberia’s Lone Star also arrived in Tangier on Monday, and included three goalkeepers, seven defenders, seven midfielders and five forwards.\nBut the Super Eagles have a home game against second –placed Cape Verde in Lagos on Tuesday next week."
  },
  {
    "headline": "Qatar 2022: Ndidi, Chukwueze, Iwobi Hit Eagles Camp",
    "summarized_story": "Nine-pointer Nigeria need all three points from the encounter with the Lone Star in order to stay in contention to star in the knockout phase of the World Cup qualifiers, set for March 2022.\nCape Verde’s Blue Sharks, who hosts Central African Republic in Mindelo on Saturday, have seven points and will be hoping the Super Eagles stumble in North Africa.\nFor the 2021 AFCON in Cameroon, the Super Eagles qualified with two matches to spare.\nMeanwhile, the delegation of Liberia’s Lone Star also arrived in Tangier on Monday, and included three goalkeepers, seven defenders, seven midfielders and five forwards.\nBut the Super Eagles have a home game against second –placed Cape Verde in Lagos on Tuesday next week."
  },
  {
    "headline": "Anambra Election: APGA chieftain Victor Umeh denied access to Ihiala LG HQ",
    "summarized_story": "A chieftain of the All Progressives Grand Alliance, Senator Victor Umeh, was denied access to the Ihiala Local Government headquarters by the Army securing the area as the supplementary election begins in Anambra on Tuesday.\nUmeh, who is the party’s state agent for the governorship election, is said to have arrived at the LG HQ at about 10:30 am accompanied by other party members.\nThe Senator who represents Anambra Central was turned away by a superior army officer despite stating his reason for being in the vicinity.\nAccording to TheCable, the army officer had barked at Umeh to leave the headquarters since he was a party agent and not a Local Government agent.\nThe Independent National Electoral Commission had declared the Anambra governorship election on Sunday after no votes were cast in Ihiala LG, hence the supplementary election."
  },
  {
    "headline": "Anambra Election: APGA chieftain Victor Umeh denied access to Ihiala LG HQ",
    "summarized_story": "A chieftain of the All Progressives Grand Alliance, Senator Victor Umeh, was denied access to the Ihiala Local Government headquarters by the Army securing the area as the supplementary election begins in Anambra on Tuesday.\nUmeh, who is the party’s state agent for the governorship election, is said to have arrived at the LG HQ at about 10:30 am accompanied by other party members.\nThe Senator who represents Anambra Central was turned away by a superior army officer despite stating his reason for being in the vicinity.\nAccording to TheCable, the army officer had barked at Umeh to leave the headquarters since he was a party agent and not a Local Government agent.\nThe Independent National Electoral Commission had declared the Anambra governorship election on Sunday after no votes were cast in Ihiala LG, hence the supplementary election."
  },
  {
    "headline": "Breaking: Pastor Odukoya's second wife, Nomthi is dead",
    "summarized_story": "Pastor Nomthi, the second wife of the General Overseer, Fountain of Life Church, Pastor Taiwo Odukoya is dead.\nShe died of cancer in London after a protracted battle with the disease.\nA statement from the church said Nomthi battled cancer for the better part of two years.\nThe statement read: “With Deep Regret and Gratitude to God, we have to announce the passing of our Senior Pastor’s wife, Pastor Nomthi Odukoya.\nHowever, with the love and support from friends and family, Pastor Taiwo Odukoya remarried a South African, Rosemary Simangele Zulu (Nomthi) on the 5th of January 2010, five years after the passage of Bimbo Odukoya."
  },
  {
    "headline": "#AnambraDecides: Soludo wins Ihiala LG Supplementary election by landslide",
    "summarized_story": "Candidate of the All Progressives Grand Alliance, APGA, Prof. Charles Soludo has won the supplementary governorship election conducted in Ihiala Local Government Area of Anambra State by a landslide.\nThe Independent National Electoral Commission, INEC, had fixed Tuesday for the supplementary election as voting was not held in the area on Saturday.\nSoludo polled 8,283 votes to defeat Valentine Ozigbo of the Peoples Democratic Party, PDP, who scored 2,485.\nAndy Uba of the All Progressives Congress, APC, scored 343 votes while Ifeanyi Ubah got 344 votes.\nWith this, INEC is set to declare the APGA candidate winner of the governorship election in Anambra State at the weekend."
  },
  {
    "headline": "BREAKING: Fountain Of Life Church, Pastor Odukoya’s Wife Dies",
    "summarized_story": "Pastor Nomthi Odukoya, the wife of Pastor Taiwo Odukoya, the Senior Pastor of Fountain of Life Church Lagos, has died.\nIt reads: “With deep regret and gratitude to God, we have to announce the passing of our Senior Pastor’s wife, Pastor Nomthi Odukoya.\n“She battled cancer for the better part of 2 years, she stood on the Word of God, and she fought.\n“We loved her with all our heart, but who are we to fight with the will of God.\nSo for now, till we meet again in glory, Goodbye Pastor Nomthi”."
  },
  {
    "headline": "Federal Government Plans ‘Operation Feed Yourself’ To Counter Malnutrition.",
    "summarized_story": "The Nigerian government is working on a “Operation Feed Yourself” project with the 36 states to stimulate the construction of urban farms and modest home gardens.\nThe VP said the “States and the FGN will promote what has been described as “Operation Feed Yourself”.\nThis is more of the establishment of urban farms and homestead gardens.\nWhat we are recommending is the sort of model that Oyo State has or any of the variety that States have.\nThat sort is obviously recommended because of the way that it is structured and the obviously good result that they have been getting.”"
  },
  {
    "headline": "Gunmen Killed Retired Air Force ,Officer In Kaduna.",
    "summarized_story": "Unidentified gunmen assassinated retired AVM Muhammad Maisaka at his home in Ragasi, Kaduna’s Igabi Local Government Area.\nASP Muhammad Jalige, the Kaduna State Police Public Relations Officer, verified the incident to NAN in Kaduna.\nJalige, who said the incident occurred in the early hours of Tuesday, added that his gateman sustained an injury from the attack.\nHe said when the information was received; the Commissioner of Police, Mr. Mudassiru Abdullah, directed the Divisional Police Officer and the Area Commander to the scene.\n“The corpse has been evacuated to the hospital and the gateman has also been rushed to the hospital for treatment”, he said, “while revealing details of the incident would be made available soon.”Jalige appealed to Kaduna residents to come forward with useful and timely information that could lead to the arrest of the culprits."
  },
  {
    "headline": "LIVE: Results From Ihiala LGA In Anambra Supplementary Election",
    "summarized_story": "The Independent National Electoral Commission (INEC) has commenced the supplementary election in Ihiala local government after declaring the November 6 exercise inconclusive.\nJoin Our Live Update BelowAs of 10pm on Tuesday, INEC officials, the media, party agents, were still waiting for results to come in from Ihiala LGA.\nAs of 9:25pm, Florence Obi, returning officer for the Anambra governorship election, seated alongside other officials, waiting for the result from Ihiala LGA.\nPU: 004 APGA: 13 APC: 4 PDP: 19 Uli Ward 1, PU 14 PU: 014 APGA: 20 PDP: 19.\n11: 30 AM: Preparations For Supplementary Election In Ihiala LG Commences11: 25 AM The distribution of election materials and deployment of INEC officials are in progress at Ihiala LGA HQ."
  },
  {
    "headline": "Breaking: Again, popular Pastor loses wife, becomes widower",
    "summarized_story": "The senior Pastor of The Fountain of Life Church, Taiwo Odukoya, has again lost his wife, Nomthi.\nPastor Odukoya announced her death in a post on his Instagram page on Tuesday evening.\nAccording to the statement posted on the church’s Facebook page, “With deep regret and gratitude to God, we have to announce the passing of our Senior Pastor’s wife, Pastor Nomthi Odukoya.\n“She battled cancer for the better part of 2 years, she stood on the Word of God, and she fought.\nSo for now, till we meet again in glory, Goodbye Pastor Nomthi.”The Pastor had lost his first wife, Bimbo, in a plane crash in 2005."
  },
  {
    "headline": "[Happening now] Anambra supplementary election: Collation begins as voter apathy, heavy security envelope Ihiala, final governorship result beckons",
    "summarized_story": "Collation is about now taking place following supplementary governorship election in Ihiala Local Government Area (LGA) on Tuesday.\nAs at 4.30pm, Independent National Electoral Commission (INEC) officials with election materials had started arriving at Ihiala LGA headquarters, the venue for collation centre amidst tight security.\nThe election was earlier marred by voter aparthy amidst heavy presence of security men across polling units.\nAddressing newsmen at Mbosi, the Deputy Speaker, Anambra State House of Assembly, Hon.\nAccording to Adinuba, Ihiala LGA would present bulk votes to APGA."
  },
  {
    "headline": "[Breaking] Anambra supplementary election: Man shot as many scamper for safety in Ihiala, INEC officials desert polling units",
    "summarized_story": "The supplementary governorship election in Anambra state taking place only in Ihiala local government area triggered panic when security agents shot sporadically in the air.\nThe election is ongoing in the area with 4pm designated time for voting to end.\nSome of the polling units are reportedly without any official of the Independent National Electoral Commission (INEC) as gunmen are also said to be disturbing the area.\nNo official statement from either INEC or security agencies on the latest development.\nThe major highway leading in and out of the area was blocked in a bid to maintain law and order."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Yiage expresses concern over INEC’s framework for doping new electoral technologies: Anambra Decides -NigPilot",
    "summarized_story": "“In 45% of the polling units, the system malfunctioned at some point during the accreditation.\nThe BVAS was replaced in 1% of the polling units and fixed in 39% of the polling units.\nIn 5% of polling units, the BVAS malfunctioned but was not fixed or replaced.\n“Logistics heavily delayed the opening of polling units, despite innovations made in recent times to establish Super Registration Area Centres, RACs, close to the polling units to alleviate logistical problems.\nYiaga Africa also notes that in 26% of polling units observed, there were no female polling officials."
  },
  {
    "headline": "CDD-Anambra Election BVAS Success in many polling units demonstrates utility, reliability -NigPilot",
    "summarized_story": "Election Analyst and Law Lecturer Sam Amadi disclosed this on behalf of the centre during a press briefing held in Abuja.\n“The successful deployment of the device in many polling units demonstrates its utility and reliability.\nFor example, in Ekwusigo LGA, Ward 3, Units 3, 4, 5 and 6, and Ward 5 Units 1 and 2, CDD’s observers reported the seamless deployment of the BVAS.\nAlso speaking on the device’s success, Senior Fellow at CDD Jibrin Ibrahim said it showed the importance of technology in preventing election misconduct.\n“Its successful deployment in many areas demonstrates the lingering benefit of integrating technology to prevent electoral malpractice,” he said."
  },
  {
    "headline": "Amotekun: Arrest, parade of Northerners dangerous to Nigeria’s unity –Group -NigPilot",
    "summarized_story": "A socio-political group, the Northern Conscience for 2023, NCfor2023, has described the arrest and parade of some youths believed to have been Northerners by the South West Security Network code-named Amotekun , as dangerous for the unity of Nigeria.\nThe security outfit had arrested 18 youths accused of hiding under bags of beans in a trailer, who were all paraded yesterday.\n“It is even more disturbing when one considers that he claims to be a Senior Advocate of Nigeria (SAN) who should have sound knowledge of the law and the constitution; and the fact that Ametokun is not recognized by the Constitution as a law enforcement agency with powers to parade suspects,” he added.\nThe group’s leader, who maintained that the North remains committed to the unity of Nigeria and the invisibility of the country, warned of grave consequences if the region retaliates the treatment meted it in recent times, by other parts of the country.\nThe country cannot afford to endure the carnage and lawlessness spreading within its borders like wildfire,” Gololo further cautioned."
  },
  {
    "headline": "Impeachment saga: Civil society condemns attack on Gov Lalong -NigPilot",
    "summarized_story": "*Preaches peace to embattled SpeakerThe coalition of Civil Society for Good Governance, CCSGG, has condemned in strong terms tirades and attacks against the Plateau State governor, Barrister Simon Bako Lalong by the impeached Speaker of the State House of Assembly, Rt.\n“Gentlemen of the press, we are aware that Plateau State House of Assembly was the first out of 36 States of the Federation to enjoy legislative and judicial autonomy, even when Hon.\n“The lawmakers decided to impeach their leader based on reasons best known to them and elected Hon.\nYakubu Sanda as new Speaker, which we consider as democracy in action, hence, peace should be allowed to reign at all cost,” the convener stressed.\nIt, however, commended Governor Lalong for his maturity and leadership that has ensured peace and tranquility as well as socio-economic and infrastructural development of the state, while calling on the citizens, particularly the youths not to allow themselves to be used."
  },
  {
    "headline": "Nigeria Plans ‘Operation Feed Yourself’ To Tackle Malnutrition",
    "summarized_story": "The Federal Government is considering an ‘Operation Feed Yourself’ initiative to encourage the establishment of urban farms and small home gardens across the country.\nThe plan for this initiative is one of three major plans arising from the UN-backed Food Systems Dialogues, to advance the fight against malnutrition, the Vice President stated at a high-level meeting on nutrition on Monday.\n“States and the FGN will promote what the convener has described as ‘Operation Feed Yourself’.\n“What we are recommending is the sort of model that Oyo State has or any of the variety that states have.\nMrs Mohammed, who acknowledged the leadership of Nigeria to the UN agenda 2030 and the Africa Union agenda 2063, believes the solution to many of the challenges associated with malnutrition lie in Nigeria’s recent commitment through the Food Systems Summit process."
  },
  {
    "headline": "Reps Summon FCT Minister Over Decaying Infrastructure, Insecurity",
    "summarized_story": "The House of Representatives has resolved to summon the Minister of the Federal Capital Territory (FCT), Mohammed Bello, over what it describes as the deteriorating state of the nation’s capital.\nThe lawmaker, who insisted that the minister was not doing the job for which he was hired, stressed the urgent need to arrest the decaying infrastructure and general insecurity in the FCT.\nHe was also worried that with the budget released to the FCT, it has no business being in its present state of decay and disrepair.\nOkechukwu, therefore, called on the House Committee on FCT to continue effective oversight on the activities of the FCT Ministry, adding that the House should summon the FCT Minister to update the lawmakers on his activities.\nThereafter, lawmakers present at the plenary voted on the motion and it was adopted."
  },
  {
    "headline": "NASS Passes Electoral Act Amendment Bill, Approves Electronic Transmission Of Results",
    "summarized_story": "The Senate and the House of Representatives have passed the Electoral Act Amendment Bill and approved the electronic transmission of results.\nA seven-man conference committee had been constituted by the Upper chamber to meet with members of the House of Representatives Conference Committee and harmonise the differences in the Senate and House versions of the Electoral Act Amendment Bill.\nOn October 12, the Senate had bowed to pressure and giving the Independent National Electoral Commission (INEC) the sole power to determine the mode of transmission of results.\nUnder a new amendment of Clause 52 (2) of the Electoral Act Amendment Bill, the Senate resolved that “voting at an election and transmission of results under this Bill shall be in accordance with the procedure determined by the Commission, which may include electronic voting”.\nShortly after the Senate’s approval, the House Of Representatives also passed the bill, completing the process of amending the Electoral Act Amendment Bill."
  },
  {
    "headline": "LIVE UPDATES: [Anambra Poll] INEC To Announce Final Results",
    "summarized_story": "The Independent National Electoral Commission (INEC) has commenced the deployment of election materials and Ad-hoc staff from the Ihiala Local Government Secretariat in Anambra State, to the various polling units where a supplementary election is expected to hold today.\nThe decision to have the supplementary election in the local government followed the suspension of collation of results in the governorship election as announced on Monday by the State Collation/Returning Officer.\nWhile results were collated from 20 out of 21 local government areas, the process was suspended as election could not hold in Ihiala LGA due to violence.\nINEC National Commissioner and Chairman, Information and Voter Education Committee, Festus Okoye, had announced on Monday that the supplementary election will hold from 10:00 am to 4:00 pm today.\n10: 17 am: Deployment of Ad-hoc Staff and materials by INEC from the local government to polling units commences amid heavy security presence."
  },
  {
    "headline": "House Passes Bill To Raise Teachers’ Retirement Age, Service Years",
    "summarized_story": "Lawmakers in the House of Representatives have passed a bill for a harmonised retirement age for teachers in the country.\nThey include Orthopaedic Hospital, Dekina, Kogi State (Establishment) Bill, Sickle Cell Disease (Prevention, Control and Management) Bill, Nationwide Emergency Communications Service Bill, and Federal Medical Centre, Owutu Edda (Establishment) Bill.\nOthers are the National Institute for Artificial Intelligence and Robotic Studies, Abak (Establishment) Bill, Fire Service Act (Amendment) Bill, National Institute of Technology (NIT) Abuja, (Establishment) Bill, Port-Area Development Commission (Establishment) Bill, Federal Medical Centre, Gumel, Jigawa State (Establishment) Bill, Counterfeit Medical Products, Fake Drugs and Unwholesome Processed Foods (Prohibition and Control) Bill, and National Health Insurance Scheme Act (Amendment) Bill.\nAlso presented are Compulsory, Free Universal Basic Education Act (Amendment) Bill, Criminal Code Act (Amendment) Bill, Companies and Allied Matters Act (Amendment) Bill, Bureau of Defence Logistics (Establishment) Bill, Federal College of Agriculture, Etim Ekpo, Akwa Ibom State (Establishment) Bill, Constitution of the Federal Republic of Nigeria, 1999 (Alteration) Bill, Veterinary Teaching Hospitals of Universities and Veterinary Specialist Hospitals (Establishment) Bill, and Unified and Special Operations Forces (Establishment) Bill.\nBills also read for the first time are Federal School of Medical Laboratory Technology, Gboko (Establishment) Bill, Constitution of the Federal Republic of Nigeria, 1999 (Alteration) Bill, Nigeria Social Insurance Trust Fund Act (Amendment) Bill, National Archives Act (Amendment) Bill, Human Resource Development Council (Establishment) Bill, Currency Offences Act (Amendment) Bill, and Employees’ Compensation Act (Amendment) Bill, among others."
  },
  {
    "headline": "Senate condemns Justice Odili's home invasion, asks IGP to disclose findings of probe -",
    "summarized_story": "The senate has strongly condemned the invasion of the Abuja home of Mary Odili, a justice of the supreme court.\nThe upper legislative chamber took a stand on the incident after Betty Apiafi, senator representing Rivers west, drew the attention of her colleagues to the now controversial matter.\nWhile moving her motion on the floor of the upper legislative chamber on Tuesday, Senator Apiafi expressed concern that there has been no news on the findings so far made by the police on the invasion.\nThey also demanded that the findings on the invasion made by the police must be made public.\nThereafter, the senate asked Alkali Baba, inspector-general of police (IGP), to disclose findings from the investigation into the incident as soon as possible."
  },
  {
    "headline": "Senate approves conference committee report on electoral bill",
    "summarized_story": "The Nigerian Senate has approved and passed the conference committee report on the electoral act amendment bill.\nThe report was approved after a motion moved by the Senate leader , Yahaya Abdullahi, on Tuesday.\nRecall that the senate and House of representatives passed different versions of the bill which led to the setting up of a conference committee.\nIn the conference committee report, both chambers of the National Assembly empowered the Independent National Electoral Commission (INEC) to determine the best mode to transmit election results.\nOnce the house of representatives approves the report, a clean copy will be produced and sent to the president for assent by the clerk of the national assembly."
  },
  {
    "headline": "Anambra Decides 2021; Voting commences in parts of Ihiala",
    "summarized_story": "The Voting Process of simultaneous Accreditation and Voting has commenced in the supplementary election to conclude the Anambra State Governorship Election in Ihiala Local government in the Anambra State Governorship Election.\nVoting which was scheduled to start at 10am did however not start until over an hour late.\nVoters in the election are expected to be the final arbiter in deciding who emerges as governor of the state."
  },
  {
    "headline": "Usifo Ataga: Trial of Chidinma stalled as defense counsel cries foul over proof of evidence -",
    "summarized_story": "At the last sitting in October, Miss Ojukwu, her co-accused Adebayo Quadri and one Chioma Egbuchu pleaded not guilty to the nine-count charge before Justice Yetunde Adesanya.\nThe case was adjourned to November 9 for the prosecution led by the Director of Public Prosecution from the Lagos State Ministry of Justice, Olayinka Adeyemi to open its case against the accused persons.\nOn Tuesday, Mrs Adeyemi told the judge that two witnesses were present in court.\nThe case was adjourned to Thursday, November 11 to enable the prosecution amend the court processes.\nAccording to the prosecution, the offences are punishable under Sections 222, 233, 280, 329, 365, 370, and 411 of the Criminal Laws of Lagos State, 2015."
  },
  {
    "headline": "Joe Igbokwe Accuses Igbos of Playing Ethnic Politics – Trending With Ojy Okpe",
    "summarized_story": "Reactions are trailing the conviction of Abdulrasheed Maina, a former chairperson of the defunct Pension Reform Task Team, who was sentenced to eight years’ in prison On Monday, for money laundering offences involving N2billion Naira in pension fund.\nJoe Igbokwe a chieftain of the All Progressives Congress, has accused people of the Southeast of playing ethnic politics.\nIn a post on his Facebook page, the Chieftain, who is also an aide to the Governor of lagos state Babajide Sanwo-Olu said people of the southeast should be working towards connecting with the Federal Government politically, otherwise they’ll continue to be onlookers in Nigeria’s political sphereThe story of a three year old who was flogged brutally by her teacher known as Mr. Taiwo, in an elementary school In Ogun State, has caught the attention of the state Governmet.\nA Twitter user who goes by the name Chinaza Egondi raised the alarm and posted a picture of the girl that captured several Cain marks on her legs.. She said the mother of the 3-year-old noticed the cane marks after she returned from school and that the little girl was running a fever.\nThe mother Elizabeth Nwocha Ebere later took to Facebook to call out the school; ADEOYE international SCHOOL, in the Sango Area of Ogun State, after the school sent teachers to resolve the issue; She said the teachers however left her house angrily without taking responsibility."
  },
  {
    "headline": "UN Says Risk of Ethiopia Descending into Civil War ‘Only Too Real’",
    "summarized_story": "UN political chief Rosemary DiCarlo has said the risk of Ethiopia “descending into widening civil war is only too real”, adding that the political repercussions of “intensifying violence in the wider region would be immense, compounding the many crises besetting the Horn of Africa”.\nShe said more than seven million people needed humanitarian assistance in northern Ethiopia alone, with an estimated 400,000 people in Tigray living in famine-like conditions.\nObasanjo, who is currently in Ethiopia, said he has been engaging with all stakeholders, including the prime minister and president of Ethiopia, in an effort to de-escalate the situation.\nHe urged the Council to consider strongly urging and encouraging the Federal Government of Ethiopia and the Tigray rebels to engage in political dialogue without any conditions.\nUS Special Envoy Jeffrey Feltman visited Addis Ababa on Monday as part of diplomatic efforts to end the conflict."
  },
  {
    "headline": "NASA SpaceX Crew Splashes Down in Gulf of Mexico",
    "summarized_story": "Four astronauts strapped inside a SpaceX Crew Dragon capsule splashed down safely in the Gulf of Mexico off the coast of Florida after a six-month scientific mission on the International Space Station (ISS).\nThe Dragon vehicle, dubbed Endeavour, parachuted into the sea as planned just after 10:30pm local time on Monday (03:30GMT on Tuesday), following a fiery re-entry and descent that NASA streamed live.\n“Endeavour, on behalf of SpaceX, welcome home to planet Earth,” flight control told the crew as a safe splashdown was confirmed.\nRecovery vessels were shown headed towards the water-proof Crew Dragon as it bobbed upright in the water.\nThe astronauts and their capsule were expected to be hoisted out of the sea within about an hour, NASA said."
  },
  {
    "headline": "Poland Blocks Hundreds of Migrants, Refugees at Belarus Border",
    "summarized_story": "Warsaw accuses Minsk of trying to trigger a major confrontation along the frontier as months-long border crisis escalates.\nThe Belarusian state border committee confirmed on Monday that many migrants and refugees were moving towards the Polish border.\n“Belarus’ regime escalates the border crisis – migrants are pushed to EU border by armed men,” she tweeted.\nKremlin spokesman Dmitry Peskov on Monday defended Minsk’s handling of the border crisis, saying Belarus was taking all necessary measures to act legally.\nWarsaw has said at least seven people have died in the region since August, when the border crisis erupted."
  },
  {
    "headline": "At Least 26 Children Die as Deadly Fire ‘Decimates’ School in Southern Niger",
    "summarized_story": "At least 26 schoolchildren have been killed when their classrooms made out of straw and wood were engulfed in a blaze in southern Niger a local governor told the AFP news agency.\nHowever, 20 schoolchildren were burned to death in a school fire in a working-class district of Niamey in April.\nIssoufou Arzika, the secretary-general of the Niger Teachers’ Union, told AFP that Monday’s fire had “decimated” the school in Maradi.\nArzika said his union had alerted officials to the danger of the straw and wood classrooms after the Niamey fire.\nThe school fire comes days after at least 18 people died in a collapsed gold mine in Dan-Issa district in the north of the country."
  }
]