[
  {
    "headline": "Doctor advised my mum to ‘kill’ me after I became paralysed at eight –Helen Alonge, polio survivor",
    "summarized_story": "Mrs Helen Alonge survived poliomyelitis as a child but she lost her ability to walk.\nThe following day, which happened to be my birthday, I woke up like any other child and then realised I couldn’t stand up.\nA doctor advised my mum to inject (euthanise) me because raising a child with a physical challenge was a very difficult task.\nI always say God is wonderful because I didn’t experience any challenge in learning.\nI do tell people that for persons with disabilities, discrimination shouldn’t be a problem because it is something we face daily everywhere."
  },
  {
    "headline": "Our husbands serving police in S’East, S’South no longer safe –Wives cry out",
    "summarized_story": "They added that over 127 policemen and other security personnel have been killed during the attacks.\nThe criminal herdsmen’s activities have increased with people being killed, abducted and maimed, farmlands destroyed, women raped and lately attacks on policemen and police facilities.\nThe attack was the ninth of such onslaughts on police and other security agents in the state this year.\nIn February, criminals attacked policemen at Mkpologwu and Omogho communities in the Aguata and Orumba North Local Government Areas, respectively, killing four policemen and setting patrol vehicles ablaze.\nNobody is happy with the security situation in Enugu and the South- East in general."
  },
  {
    "headline": "Trauma from rape made me addicted to alcohol –Kiitan Bukola",
    "summarized_story": "Actress, Oloruntimilehin Bukola, popularly known as Kiitan Bukola, has revealed that her rape ordeal at the age of 10 had a long-term effect on her sexual life.\nIn an interview with Saturday Beats, she said, “I cannot remember what age I started taking alcohol but I started drinking beer in secondary school.\nI find it difficult to make love without getting high, because of my rape ordeal.\nThe incident happened at Oke Bola in Ado Ekiti.\nShe added, “When I told my rape story on social media, I found out that the guy had died."
  },
  {
    "headline": "NDDC audit: FG donates 33 vehicles to forensic auditors",
    "summarized_story": "Kindly Share This Story:The Federal Government said that it had donated 33 utility vehicles to the security committee working with the forensic auditors currently appraising projects executed by the Niger Delta Development Commission (NDDC).\nThe Minister of Niger Delta Affairs, Sen. Godswill Akpabio, delivered the vehicles to the auditors in Port Harcourt, according to a statement by NDDC’s Director of Corporate Affairs, Dr Ibitoye Abosede, on Friday.\n“The over 33 utility vehicles are meant to assist the security personnel working with the 16 field auditors charged with identifying and verifying the projects implemented by the NDDC across the Niger Delta region.\n“We thank President Muhammadu Buhari for approving the forensic audit to be carried out to look at all NDDC’s projects.\nHe said that the ministry was committed to ensuring rapid development of the Niger Delta region by repositioning the NDDC to effectively deliver its mandate to the people."
  },
  {
    "headline": "Hospitality industry recovering from COVID-19 effects ― Lai Mohammed",
    "summarized_story": "Kindly Share This Story:The Minister of Information and Culture, Alhaji Lai Mohammed says the nation’s hospitality industry is beginning to recover from the COVID-19 pandemic that ravaged the world.\nThe minister who said this at the commissioning of Marriot Hotel in Lagos, noted that the creative and hospitality industry were the worst hit by the pandemic.\nThe minister recalled that the hospitality industry in Nigeria and Africa as a whole had grown rapidly in the last 30 years and witnessed dynamism over time.\n“Nigeria was not left out of this hospitality industry boom, placing third in the report behind Egypt (with 52 projects) and Morocco (with 32 projects).\nMohammed said Nigeria’s hospitality industry had witnessed major developments in recent times."
  },
  {
    "headline": "Attahiru’s death: ‘I’m deeply shaken with a sense of great personal loss — El-Rufai",
    "summarized_story": "Kindly Share This Story:By Ibrahim HassanWuyoGovernor Nasir Ahmad El-Rufai of Kaduna state has said that the news of General Attahiru’s death has left him deeply shaken, with a sense of great personal loss, coming so soon after his appointment had brought immense pride and a sense of hope to the people of Kaduna State.\nSamuel Aruwan, Commissioner, Ministry of Internal Security and Home Affairs, Kaduna State, said in a statement on Friday night that the Kaduna State Government received with immense sadness news of the death of the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru and other senior military officers in a plane crash which occurred in Kaduna on Friday evening.\nAlso read:Governor Nasir El-Rufai eulogized Lt. Gen. Attahiru as a shining star whose sudden death has robbed Nigeria of an officer striving to bring the new drive to secure the country against terrorists and other threats to national security.\nHe prayed to Allah to forgive their shortcomings and grant them eternal rest, and comfort their families as the nation, grapples with this colossal and very painful loss.\nVanguard News NigeriaKindly Share This Story:"
  },
  {
    "headline": "Gov Ugwuanyi has shown leadership in health sector — ESUTH Resident Doctors",
    "summarized_story": "Kindly Share This Story:The Enugu State University Teaching Hospital Association of Residents Doctors (ESUTH-ARD) has described Governor Ifeanyi Ugwuanyi of Enugu State as a leader with the hallmarks of leadership.\n“His Excellency, we have enumerated just a few of what your visionary leadership has availed the tertiary health sector of the state.\n“The Association of Resident Doctors, ESUT-TH Parklane will continue to work for and with His Excellency, to ensure quality health care of the Gov.\nUgwuanyi has shown leadership in the health sector – ESUTH Resident DoctorsThe Enugu State University Teaching Hospital Association of Residents Doctors (ESUTH-ARD) has described Governor Ifeanyi Ugwuanyi of Enugu State as a leader with the hallmarks of leadership.\n“His Excellency, we have enumerated just a few of what your visionary leadership has availed the tertiary health sector of the state."
  },
  {
    "headline": "Open Grazing Ban: Attack on Malami ‘ll do nobody any good — Anti-graft group",
    "summarized_story": "The group also insisted that the barrage of criticism against Malami (SAN) on the proposed ban on Open Grazing by the forum of Southern Governors is not necessary.\nAny order that is not passed as a law is certainly unconstitutional and that was what the HAGF was stressing.\nBut identifying the HAGF’s comment with the ethnic and religious garment is mischievous and an ill wind that would blow no one any good.\nMalami, by his conduct and disposition, is very open and accommodating to all, irrespective of one ethnic, religious and social background.\nHe said that Malami is not that too petty to be beclouded with ethnic sentiment at the detriment of what the law stipulates."
  },
  {
    "headline": "Ibrahim Attahiru: Alarm bells as three NAF jets crash within three months",
    "summarized_story": "On Friday night, Nigeria lost its Chief of Army Staff (COAS), Ibrahim Attahiru, in an air crash close to the Kaduna Airport.\nAttahiru and seven others were aboard a NAF Beachcraft 350 aircraft when it crashed and exploded into a ball of fire.\n“An air crash involving a Nigerian Air Force aircraft occurred this evening near the Kaduna International Airport.\nIt is the third time in 2021 alone, that a Nigerian Air Force jet has come down.\nOn Sunday, February 21, 2021, seven NAF officers died aboard a Beechcraft KingAir B350i aircraft when the jet crashed in Abuja."
  },
  {
    "headline": "Lt. Gen Attahiru’s death: AGF Malami shocked, cuts short son’s wedding",
    "summarized_story": "Attorney-General of the Federation and Minister of Justice, Abubakar Malami, has described the military aircraft crash that caused the death of Chief of Army Staff, Lt. General Ibrahim Attahiru as a national tragedy.\nMalami received the news in Kano while attending to guests in preparation for the wedding ceremony of his second son, Abiru Rahman Malami billed for Saturday.\nThe AGF described the Attahiru and members of his team as dedicated patriotic Nigerians whose efforts to improve the security situation of the country was manifest.\nMalami, a Senior Advocate of Nigeria (SAN), prayed Allah to grant eternal salvation for all that lost their lives in the air mishap.\nThe minister also prayed that the family members have the fortitude to bear the lossHe said Attahiru who died in active service to the nation and will always be remembered as a patriotic Nigerian passionate about duty."
  },
  {
    "headline": "Plane crash: Lt. Gen. Ibrahim Attahiru’s death shocking",
    "summarized_story": "President Muhammadu Buhari has expressed sadness over the air crash that claimed the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, and other military officers.\nRecall that Gen. Ibrahim Attahiru, and other military officers died in a crash close to Kaduna International Airport.\nReacting, Buhari in a statement by his Spokesman, Femi Adesina, on Friday, condoled with families of the deceased, the military and Nigerians in general.\nHe described them as “heroes who paid the ultimate price for peace and security in the land.”While praying that God receives the souls of the patriots, Buhari said the crash “is one mortal blow to our underbelly, at a time our armed forces are poised to end the security challenges facing the country.”He, therefore, pledged that the departed would not die in vain."
  },
  {
    "headline": "Deji Adeyanju questions Shekau, Chief of Army Staff, Attahiru’s death within 24 hours",
    "summarized_story": "Deji Adeyanju, an Abuja-based rights activist, has reacted to the death of the Chief of Army Staff, Lt. Gen Ibrahim Attahiru.\nAdeyanju questioned the death of Attahiru 24 hours after dreaded Boko Haram leader, Abubakar Shekau was reported dead.\nOn Thursday, reports emerged that Shekau was fatally injured, after attempting to kill himself to avoid being captured by rival Islamic State-allied fighters.\nHowever, the Nigerian Army said that it was probing the reports indicating that Shekau was “badly injured” or “dead”.\nToday, the Chief of Army Staff died in a plane crash."
  },
  {
    "headline": "Ibrahim Attahiru: Moments Chief of Army Staff’s plane crashed [VIDEO]",
    "summarized_story": "A video has emerged showing the moment the aircraft conveying the Nigerian Chief of Army Staff, Lt. General Ibrahim Attahiru crashed.\nDAILY POST reported earlier that Attahiru died in an air crash on Friday.\nThe top military officer and about seven others were aboard a military aircraft to Kaduna for an official trip.\nAir Commodore Edward Gabkwet, Nigerian Air Force Director of Information confirmed the mishap in a statement“An air crash involving a @NigAirForce aircraft occurred this evening near the Kaduna International Airport.\nAnd a footage showing how the incident occurred has emerged on social media."
  },
  {
    "headline": "Onyeka Onwenu: Mum would have killed me if I’d gone nude",
    "summarized_story": "By Sampson UnamkaACE musician and broadcaster Onyeka Onwenu has said she would have been severely disciplined by her mum if she had given in to the temptation to dress indecently.\nThe 69-year-old Onwenu noted that some artists seemed to have gone too far in how they presented their public image but expressed hope that they would eventually evolve out of it.\nADVERTISEMENT“See, if I came out in anything nude, my mother would have killed me.\nNot because one was not tempted, I remember we wore minis, but you know, they’ve gone too far these days.\nWhen you do music and the music is not lasting, you’ll realise you’re out of the way."
  },
  {
    "headline": "Obaigbo emerges as Mrs Nigeria Beauty Queen",
    "summarized_story": "By Akeem LawalMRS Terere Obaigbo, a beauty queen, representing Edo State, has emerged as the overall winner of the fifth edition of Mrs. Nigeria, a non-bikini beauty queen contest for the most beautiful, innovative, and dynamic women in Nigeria.\nMrs. Benjamin Gloria Gershemwa came second, while Mrs. Tony-Nweze Makuochukwu finished in the third position.\nSpeaking with The Nation, the Mrs. Nigeria Queen said she feels very honoured to be crowned the overall winner of the contest, promising to use her tenure of office to advance the cause of the women folks across the country.\nAccording to her, “I am a professional model and a beauty queen pageant, yea.\n“As a matter of fact, I am making a pledge to optimally utilise my tenure as the 2021 Mrs. Nigeria Queen to propagate the cause of the women across the world.”"
  },
  {
    "headline": "BREAKING: 12 feared dead as Military plane crashes in Kaduna airport",
    "summarized_story": "By AbdulGafar Alabelewe, KadunaA military plane suspected to be that of the Nigerian Air Force (NAF) has crashed around the Kaduna International Airport.\nThe plane, which crashed around 6pm on Friday, according to a source, exploded and got burnt completely.\nA competent source from the Airport told The Nation all the crew members and passengers numbering 12 died in the crash.\nADVERTISEMENTThough, there has not been any official statement from the Armed Forces, eyewitnesses suspected the crew lost control of the aircraft due to sudden change of weather before the evening rain in KadunaDetails shortly…"
  },
  {
    "headline": "BREAKING: 12 feared dead as Military plane crashes in Kaduna airport",
    "summarized_story": "By AbdulGafar Alabelewe, KadunaA military plane suspected to be that of the Nigerian Air Force (NAF) has crashed around the Kaduna International Airport.\nThe plane, which crashed around 6pm on Friday, according to a source, exploded and got burnt completely.\nA competent source from the Airport told The Nation all the crew members and passengers numbering 12 died in the crash.\nADVERTISEMENTThough, there has not been any official statement from the Armed Forces, eyewitnesses suspected the crew lost control of the aircraft due to sudden change of weather before the evening rain in KadunaDetails shortly…"
  },
  {
    "headline": "BREAKING: Army Chief, Attahiru, 7 others die in plane crash in Kaduna",
    "summarized_story": "A military plane transporting the Chief of Army Staff, Lt General Ibrahim Attahiru and some senior military officers from Abuja to Kaduna has crashed in Kaduna.\nThere were indication that the Chief of Army Staff and other military officers travelling with him in the plane have died.\nAir Commodore Edward Gabkwet in a tweet @NigAirForce said: An air crash involving a Nigerian Air Force aircraft occurred this evening near the Kaduna International Airport.\nAn air crash involving a @NigAirForce aircraft occurred this evening near the Kaduna International Airport.\nEdward GabkwetAir CommodoreDirector of Public Relations and Information21/5/21 pic.twitter.com/N01V2M6qUc — Nigerian Air Force (@NigAirForce) May 21, 2021Sunnewsonline.com learnt that the plane had eight people on board and crashed at about 6pm under the rain."
  },
  {
    "headline": "Boko Haram: IGP allays fears over planned attacks on Abuja, Plateau, neighbouring States",
    "summarized_story": "From Molly Kilete, AbujaThe Inspector-General of Police, (IGP), Usman Alkali Baba, Friday said there was no cause for alarm following security report of a possible attack on the Federal Capital Territory (FCT) Abuja, Plateau State and other neighbouring states by the Boko Haram terrorists group.\nAlkali, said the police and the security agencies have put every measure in place to protect residents and urged them to go about their lawful activities.\nThe IGP, gave the assurance in a statement signed by the Force Public Relations Officer, Frank Mba.\nIGP Usman Alkali Baba, psc (+), NPM, fdc has assured citizens of the Federal Capital Territory (FCT), Plateau State and other contiguous States, of safety and security as they go about their lawful day-to-day activities.\nThe alert does not in any way suggest that an attack is imminent in any of the two States."
  },
  {
    "headline": "Catholic priest killed in Katsina, another kidnapped",
    "summarized_story": "From Fred Ezeh, AbujaCatholic Secretariat of Nigeria (CSN), on Friday, confirmed that unknown gunmen killed a Catholic priest, Rev.\nAlphonsus Bello, in Katsina, and also kidnapped another one, Rev.\nFathers Joe Keke and Alphonsus Bello were serving St. Vincent Ferrer Catholic Church Malunfashi, Katsina state, where the incident happened.\nJoe Keke and Alphonsus Bello were kidnapped.\nAlphonsus Bello until his death, was the parish priest of St. Vincent, while Fr."
  },
  {
    "headline": "Loans repayment: Osinbajo wades into governors, CBN dispute",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaVice President Yemi Osinbajo, yesterday, waded into the disagreement between state governors and the Central Bank of Nigeria (CBN) over the repayment of the budget support facility obtained by the states.\nHowever, the CBN governor, Godwin Emefiele, insisted that the states should begin the repayment without future delay especially the monies owed to the banks.\nEkiti State Governor, Dr. Kayode Fayemi, who is also Chairman, Nigeria Governors’ Forum, reported interactions with the Finance Minister and the CBN Governor regarding the matter.\n“The CBN governor, Godwin Emefiele, also emphasised the importance of the timely repayment of loans, especially those owed to commercial banks, indicating the challenges inherent in a further delay in payment, including audit concerns.\nHe said the repayment of the commercial loans should resume this month.”"
  },
  {
    "headline": "Govs rooting for state police inviting anarchy –IGP",
    "summarized_story": "From Isaac Anumihe, AbujaInspector General of Police (IGP) has berated governors who are clamouring for state police saying they are inviting anarchy.\nSpeaking at the Open Government Partnership Week in Abuja, the IGP said those governors asking for state police are doing so for selfish purpose because they want to use the instrument of state police against their political opponents.\nThe IGP, represented by Deputy Inspector General of Police (DIG) Lemu Sanusi, said: “But state police will bring anarchy.\nIf there is an armed robbery case, a governor cannot send state police.\nHe said the government is trying to repair the damaged relationship through the Open Government Partnership."
  },
  {
    "headline": "Defence Headquarters Orders Probe into Air Crash",
    "summarized_story": "*Condoles with families of officers, restates commitment to war against insurgencyKingsley Nwezeh in AbujaThe Defence Headquarters (DHQ) Friday night ordered a probe into the circumstances sorrounding the air crash that killed the Chief of Army Staff, Lt. General Ibrahim Attahiru and 10 officers and crew members.\nA statement issued by the Director, Defence Information (DDI), Brigadier-General Onyema Nwachukwu, said the Chief of Defence Staff, General Lucky Irabor, ordered the constitution of an accident investigation board to probe the air mishap.\n“The Chief of Defence Staff, (CDS) General Lucky Irabor, has therefore directed that an Accident Investigation Board be constituted to unravel the immediate and remote cause(s) of the unfortunate accident”, he said.\nThe Chief of Defence Staff (CDS) General Lucky Irabor has therefore directed that an Accident Investigation Board be constituted to unravel the immediate and remote cause(s) of the unfortunate accident”.\nWe wish to state that the Armed Forces of Nigeria remains resolute in combatting the security challenges bedeviling our nation."
  },
  {
    "headline": "News in Photographs: Defence Minister, CDS Brief Buhari on Air Crash that Claimed Army Chief, 10 Others",
    "summarized_story": "Minister of Defence, Major General Bashir Magashi (rrd), Chief of Defence Staff, General LEO Irabor, and Chief of Air Staff, Air Marshall Oladayo Amao, were at the State House Friday night to brief President Muhammadu Buhari on the plane crash that claimed the Chief of Army Staff, Lt Gen Ibrahim Attahiru, and 10 other military officers and crew members.\nGen Attahiru and some military officers died in the plane that crashed near Kaduna Airport on Friday evening.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Army Confirms Attahiru’s Death, Says10 Officers, Crew Members Died in Air Crash",
    "summarized_story": "Kingsley Nwezeh in AbujaThe Nigerian Army has confirmed the death of the Chief of Army Staff, Lt. General Ibrahim Attahiru in an air crash in Kaduna.\nA statement issued by Army Spokesman, Brigadier-General Mohammed Yerima, said the army chief was enroute Kaduna from Abuja when the tragic crash occured.\n“The Nigerian Army regrets to announce the passing away of its Chief of Army Staff, Lt Gen Ibrahim Attahiru .\nThe Nigerian Army Headquarters said “the COAS was enroute Kaduna from Abuja on Friday, 21 May, 2021 when the unfortunate incident happened”.\nThe the army did not however release thr names of other officers and crew members that died in the ill-fated plane."
  },
  {
    "headline": "Buhari Sad over Death of Army Chief, Other Officers in Plane Crash",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has expresed deep sadness over the air crash that claimed the Chief of Army Staff (COAS), Lt. Gen. Ibrahim Attahiru, and other military officers.\nThe President’s statement is the first offficial confirmation that the Army chief died in the ill-fated flight.\nThe Nigeria Air Force had earlier issued a statement confirming the crash of one of its aircraft near Kaduna on Friday evening.\nThe statement did however not disclose the identities of those onboard.\nThe Nigeria Army had yet to speak on the tragic incident."
  },
  {
    "headline": "(Updated) Army Chief, Ibrahim Attahiru, Feared Dead in Plane Crash",
    "summarized_story": "Though the Nigerian Army has not confirmed the tragic incident, military sources have confirmed the crash.\nThe Nigerian Air Force also confirmed that one of its aircraft was involved in a crash in its twitter handle Friday evening.\n“An air crash involving a @NigAirForce aircraft occurred this evening near the Kaduna International Airport.\nA source at the Kaduna International Airport said the plane crashed near the airport at about 6pm.\nDetails of the tragic incident are still scanty, but sources said all the eight people onboard died in the crash."
  },
  {
    "headline": "REVEALED: Identities Of Officers, 4 Crew Members Killed Along With Chief Of Army Staff In Plane Crash",
    "summarized_story": "Seven officers including the Chief of the Army Staff, Lt Gen Ibrahim Attahiru, along with four crew members were killed in Friday's military plane crash, SaharaReporters has learnt.\nMAJ LA HAYATThe crew members were: FLT LT TO ASANIYI; FLT LT AA OLUFADE; SGT ADESINA; ACM OYEDEPO.\nSee Also Military Nigeria's Chief Of Army Staff, Attahiru Dies In Plane CrashThe Nigerian Air Force has said it has begun an investigation into the cause of the crash of its NAF aircraft in which the Chief of the Army Staff, Lt Gen Ibrahim Attahiru, his aides and others were travelling and killed on Friday.\nHe said, \"An air crash involving a @NigAirForce aircraft occurred this evening near the Kaduna International Airport.\nSee Also Military Nigerian Air Force Investigates Plane Crash Which Killed Chief of Army Staff, 11 Others"
  },
  {
    "headline": "REVEALED: Identities Of Officers, 4 Crew Members Killed Along With Chief Of Army Staff In Plane Crash",
    "summarized_story": "Seven officers including the Chief of the Army Staff, Lt Gen Ibrahim Attahiru, along with four crew members were killed in Friday's military plane crash, SaharaReporters has learnt.\nMAJ LA HAYATThe crew members were: FLT LT TO ASANIYI; FLT LT AA OLUFADE; SGT ADESINA; ACM OYEDEPO.\nSee Also Military Nigeria's Chief Of Army Staff, Attahiru Dies In Plane CrashThe Nigerian Air Force has said it has begun an investigation into the cause of the crash of its NAF aircraft in which the Chief of the Army Staff, Lt Gen Ibrahim Attahiru, his aides and others were travelling and killed on Friday.\nHe said, \"An air crash involving a @NigAirForce aircraft occurred this evening near the Kaduna International Airport.\nSee Also Military Nigerian Air Force Investigates Plane Crash Which Killed Chief of Army Staff, 11 Others"
  },
  {
    "headline": "Nigeria's Chief Of Army Staff, Attahiru Dies In Plane Crash",
    "summarized_story": "General Ibrahim Attahiru, the Chief of Army Staff, has died in a plane crash.\nIbrahim AttahiruBREAKING: Nigeria's Chief of Army Staff, Attahiru and 11 others die in Plane crash in Kaduna — Sahara Reporters (@SaharaReporters) May 21, 2021The Chief of Army Staff (COAS) is the highest ranking military officer of the Nigerian Army.\nThe position is often occupied by the most senior commissioned officer appointed by the President of Nigeria.\nGeneral Attahiru was redeployed to Nigerian Army Headquarters as Deputy Chief of Policy and Plans.\nHe was former General Officer Commanding, 82 Division of the Nigerian Army, Enugu."
  },
  {
    "headline": "Nigeria's Chief Of Army Staff, Attahiru Dies In Plane Crash",
    "summarized_story": "General Ibrahim Attahiru, the Chief of Army Staff, has died in a plane crash.\nIbrahim AttahiruBREAKING: Nigeria's Chief of Army Staff, Attahiru and 11 others die in Plane crash in Kaduna — Sahara Reporters (@SaharaReporters) May 21, 2021The Chief of Army Staff (COAS) is the highest ranking military officer of the Nigerian Army.\nThe position is often occupied by the most senior commissioned officer appointed by the President of Nigeria.\nGeneral Attahiru was redeployed to Nigerian Army Headquarters as Deputy Chief of Policy and Plans.\nHe was former General Officer Commanding, 82 Division of the Nigerian Army, Enugu."
  },
  {
    "headline": "Army Chief, Attahiru's Plane Crash Caused By Bad Weather—Defence Headquarters",
    "summarized_story": "The Defence Headquarters, Abuja, has stated that the crash of the Nigerian Air Force jet which killed the Chief of the Army Staff, Lt Gen Attahiru Ibrahim, and 10 other officers was due to bad weather.\nThe DHQ in a release on Friday night added that the Chief of Defence Staff, Gen Lucky Irabor, has, however, ordered investigation into the incident.\nThe Chief of Defence Staff (CDS) General Lucky Irabor has therefore directed that an Accident Investigation Board be constituted to unravel the immediate and remote cause(s) of the unfortunate accident.\n\"As we pray for the repose of the souls of our gallant and committed Chief of Army Staff and other personnel on board with him, the AFN solicits the support and understanding of all Nigerians in the face of this tragic incident.\nWe wish to state that the Armed Forces of Nigeria remains resolute in combatting the security challenges bedevilling our nation."
  },
  {
    "headline": "DHQ: Bad weather caused military aircraft crash in Kaduna",
    "summarized_story": "The defence headquarters says the air crash which occurred on Friday was caused by bad weather.\nAdvertisementIbrahim Attahiru, chief of army staff, and 10 other military officers died in the incident which took place near Kaduna international airport.\nAdvertisement“The unfortunate incident occurred after landing at the Kaduna International Airport due to inclement weather.\nThe Chief of Defence Staff (CDS) General Lucky Irabor has therefore directed that an Accident Investigation Board be constituted to unravel the immediate and remote cause(s) of the unfortunate accident.\n“We wish to state that the Armed Forces of Nigeria remains resolute in combatting the security challenges bedeviling our nation."
  },
  {
    "headline": "DHQ: Bad weather caused military aircraft crash in Kaduna",
    "summarized_story": "The defence headquarters says the air crash which occurred on Friday was caused by bad weather.\nAdvertisementIbrahim Attahiru, chief of army staff, and 10 other military officers died in the incident which took place near Kaduna international airport.\nAdvertisement“The unfortunate incident occurred after landing at the Kaduna International Airport due to inclement weather.\nThe Chief of Defence Staff (CDS) General Lucky Irabor has therefore directed that an Accident Investigation Board be constituted to unravel the immediate and remote cause(s) of the unfortunate accident.\n“We wish to state that the Armed Forces of Nigeria remains resolute in combatting the security challenges bedeviling our nation."
  },
  {
    "headline": "TIMELINE: Three military aircraft crash in 4 months -- what is going on?",
    "summarized_story": "Friday was winding down without any major security incident, when around 6pm, news broke of a military aircraft crash in Kaduna.\nThe crash makes it the third time a military aircraft will be involved in a fatal accident within the past three months.\nAdvertisementTHE NAF 201 CRASH AFTER ‘ENGINE FAILURE’On February 21, Hadi Sirika, minister of aviation, announced that a military aircraft crashed in Abuja.\n“A military aircraft King Air 350 has just crashed short of our Abuja runway after reporting engine failure en route Minna,” he had tweeted.\nAdvertisementWith the Friday incident, the Nigerian military has lost 20 officers to aircraft crashes within a space of three months."
  },
  {
    "headline": "TIMELINE: Three military aircraft crash in 4 months -- what is going on?",
    "summarized_story": "Friday was winding down without any major security incident, when around 6pm, news broke of a military aircraft crash in Kaduna.\nThe crash makes it the third time a military aircraft will be involved in a fatal accident within the past three months.\nAdvertisementTHE NAF 201 CRASH AFTER ‘ENGINE FAILURE’On February 21, Hadi Sirika, minister of aviation, announced that a military aircraft crashed in Abuja.\n“A military aircraft King Air 350 has just crashed short of our Abuja runway after reporting engine failure en route Minna,” he had tweeted.\nAdvertisementWith the Friday incident, the Nigerian military has lost 20 officers to aircraft crashes within a space of three months."
  },
  {
    "headline": "FULL LIST: All the officers on board crashed military aircraft",
    "summarized_story": "A list of officers who died in the military aircraft crash that occurred in Kaduna on Friday has been released.\nAdvertisementThe crash, which involved a Nigerian Air Force (NAF) aircraft, occurred on Friday evening near the Kaduna international airport.\nThe army had said all the 11 officers aboard the ill-fated aircraft died.\nAdvertisementBashir Ahmad, personal assistant on new media to President Muhammadu Buhari, shared a list of deceased officers on Twitter.\nAmeen 🙏🏿 pic.twitter.com/4ztE5LJLar Advertisement — Bashir Ahmad (@BashirAhmaad) May 21, 2021In a statement by Samuel Aruwan, commissioner for internal security and home affairs, the Kaduna state government expressed shock over the death of the officers."
  },
  {
    "headline": "NCC plans to deploy Device Management System to prevent phone theft",
    "summarized_story": "Two weeks after the Nigerian Communications Commission (NCC) said it had issued 54 million people their national identity numbers, it is in the process of deploying a Device Management System (DMS).\nA Device Management System will take this step even further, allowing the government even more access to what should be private information.\nWhen there’s a central registry for IMEI, the police could identify the owners of lost and stolen phones thousands of times daily.\nA critical part of this paper argues for a central database of mobile phones that law enforcement agencies presumably can access.\n*An earlier version of this report stated that the NCC asked telcos to register the IMEI numbers of their subscribers; the NCC has now clarified its position"
  },
  {
    "headline": "How to build high-performance teams with Chichi Offodile and Seni Sulyman",
    "summarized_story": "In what can be termed a mini-MBA session, Seni Sulyman and Chichi Offodile in an edition of TechCabal Live shared expert advice on how to build high-performance teams.\nTheir Journey at Helium Health and AndelaThe conversation begins with Chichi and Seni talking about their journeys at Helium Health and Andela respectively.\nHer strength lies in figuring out how to build a sustainable company and that’s what she set out to do via a transformation plan.\nBoth Seni and Chichi believe that it starts with hiring people with the potential to be high achievers and then setting a good example as a leader.\nHe ends with a caveat – it’s a little difficult to build a high-performing team without working really hard."
  },
  {
    "headline": "Stax wants you to enjoy USSD with better design, without ever dialling codes again",
    "summarized_story": "—Most people who started using mobile phones in the 2000s became familiar with USSD through loading and checking airtime balance.\nMaking USSD smartStax is a mobile app currently available only to Android users in 10 countries, including Nigeria, Uganda, Kenya and Tanzania.\nWhen a user gives Stax access, the app activates a screen reading functionality and acts as a web browser.\nStax wants the app to be under 10MB so that it will work easily on every (Android) phone.\nWith a large user base, Stax could begin enabling discovery and access to third party services, in what could make Stax a super app of sorts."
  },
  {
    "headline": "Are you ready to Branch in?",
    "summarized_story": "Here are a few more things that sets Branch apart from both your regular banking and other financial apps.\nBonus programs: Most financial apps have some form of bonus program but none of them is like Branch.\nWhereas other financial apps pay one-time bonuses for referrals, Branch pays you N500 when friends you refer pay up their first loan.\nThe money part: Branch gives you up to N500,000 in loans within seconds of applying on the app.\nClearly, Branch offers you more flexibility and a lot more profit than other financial apps."
  },
  {
    "headline": "Founders of TradeDepot selected as Endeavor Entrepreneurs",
    "summarized_story": "Fast-growing retail distribution platform in Africa joins the leading global entrepreneur support organizationLagos, May 20 — Endeavor Nigeria has welcomed three new entrepreneurs into its global network.\nOnyekachi Izukanne, Michael Ukpong, and Ruke Awaritefe, the co-founders of TradeDepot, were selected as Endeavor Entrepreneurs on May 18, 2021, at the 15th Virtual International Selection Panel (v-ISP #15).\nThe Endeavor network includes some of the world’s most exciting scale-up entrepreneurs and most experienced mentors and investors.\nTo date, Endeavor has screened more than 60,000 individuals and selected more than 2,000 founders leading over 1,200 scale-up companies.\nIn Nigeria, we aim to select 4-6 companies a year and today there are 19 Endeavor Entrepreneurs who are leading 11 companies in the portfolio."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "App review – How does Bitnob work?",
    "summarized_story": "At first glance, the Bitnob app feels fantastic, with a simple UI and easy-to-find functions.\nGetting started with BitnobLet’s begin with the onboarding processAdvertisementCreating a new account on BitnobSetting up your Bitnob app begins with installing it from your app store.\nTo protect its users, Bitnob doesn’t let you buy BTC straight from your bank account.\nYou simply paste their address or scan their Bitnob BTC wallet address.\nFinal thoughtsOverall, the Bitnob app delivers an impressive performance."
  },
  {
    "headline": "App review – How does Bitnob work?",
    "summarized_story": "At first glance, the Bitnob app feels fantastic, with a simple UI and easy-to-find functions.\nGetting started with BitnobLet’s begin with the onboarding processAdvertisementCreating a new account on BitnobSetting up your Bitnob app begins with installing it from your app store.\nTo protect its users, Bitnob doesn’t let you buy BTC straight from your bank account.\nYou simply paste their address or scan their Bitnob BTC wallet address.\nFinal thoughtsOverall, the Bitnob app delivers an impressive performance."
  },
  {
    "headline": "Does the Nigerian government want safety or surveillance with its new IMEI policy?",
    "summarized_story": "From July 2021, the Nigerian Communications Commission (NCC) will require Nigerians to submit their IMEI numbers to a Centralised Equipment Identity Register.\nThe International Mobile Equipment Identity (IMEI) is a unique number used to identify a mobile phone.\nWith an IMEI number, a phone can be tracked, but more than that, it can also be used for identity theft and even cloning a phone.\nAdvertisementIf a phone owner possesses their IMEI number, they could provide law enforcement agencies with this information to track these phones if they are stolen.\nAdding IMEI data to this would mean that they can also get real-time location data on anyone."
  },
  {
    "headline": "News",
    "summarized_story": "The past few days have seen the value of cryptocurrencies take a massive dip, which is said to have stemmed from Elon Musk’s tweet.\nWhile this is not the worst crash the market has witnessed, how shou…"
  },
  {
    "headline": "UPDATE 2: Nigeria mourns as chief of army staff, others die in plane crash",
    "summarized_story": "The Chief of Army Staff, Lt General Ibrahim Attahiru has died in an air crash today while on an official trip to Kaduna.\nThe Nigerian Airforce (NAF) had announced that an air crash involving its aircraft occurred on Friday evening near the Kaduna International Airport.\nThe Nigerian Army when contacted said an official statement will be released by the the NAF shortly on the development.\nIbrahim Attahiru was appointed chief of army staff on January 26, succeeding Tukur Buratai.\nUS Mission joins Nigeria in mourningThe United States Diplomatic Mission in Nigeria also joinedin mourning the tragic loss of life from today’s plane crash."
  },
  {
    "headline": "These ten stocks are NSE’s best performers since January",
    "summarized_story": "These ten stocks are NSE’s best performers since JanuaryThe returns of Nigerian stocks have somewhat tailed off since they returned 50 percent last year with a loss of 4.88 percent since the start of 2021, however, some stocks have still rewarded investors amid the downturn.\nIncreased investors’ appetite for returns available in the fixed-income market coupled with the limited rewards from the concluded…"
  },
  {
    "headline": "Sylva, Orji, Idris bag BusinessDay Public Service Excellence Awards",
    "summarized_story": "For their outstanding performance in office, Timipre Sylva, minister of State for Petroleum Resources; Uche Orji, managing director/CEO, Nigeria Sovereign Investment Authority (NSIA); Ahmed Idris, accountant-general of the federation (AGF) and Chiedu Ugbo, managing director, Niger Delta Power Holding Company Ltd; have bagged BusinessDay Excellence in Public Service Awards 2020.\nThe Excellence in Public Service Awards – the fourth in the series is an annual event that celebrates functionaries occupying strategic positions in the federal administration, who in the performance of their responsibilities, embody the best values of responsible policy formulation, operational delivery excellence and broad stakeholder.\nThis is the 4th edition of the prestigious Excellence in Public Service Awards which are open to federal ministers and heads of departments and agencies.\n“The BusinessDay event is an award to deserving public servants.\nIdris disclosed that the Federal Government has introduced measures for greater transparency and accountability in the public financial system:“It has brought about sanity generally in the conduct of public officers particularly in managing public finances."
  },
  {
    "headline": "NAF aircraft crashes with top officers onboard – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – A Nigerian Air Force (NAF) aircraft conveying some top military officers has crashed near Kaduna, NAF Twitter handle @NigAirForce, has confirmed.\nChief of Army Staff, Lt.-Gen. Ibrahim Attahiru, is feared dead in the crash on Friday, unconfirmed reports said.\nA tweet by the Nigerian Air Force confirmed that air crash, involving a @NigAirForce aircraft, occurred t?near the Kaduna International Airport.\nThe Air Force spokesperson, Air Commodore Edward Gabkwet, in the tweet, said that the immediate cause of the crash was still being ascertained.\nHowever, effort to get confirmation from Nigerian Army has been unsuccessful as the spokesperson, Brig.-Gen. Mohammed Yerima, did not respond to calls."
  },
  {
    "headline": "Edo First Lady tasks parents, teachers to support govt efforts in checking drug abuse – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo First Lady, Mrs. Besty Obaseki, has urged parents and teachers to monitor the activities of students, as part of efforts to check drug abuse among school children.\nTherefore, parents, teachers and guardians need to monitor their wards closely and show them love.\nTake your studies seriously so that you can become great men and women in our society in future,” Mrs. Obaseki added.\nThe consequences are too grave for your mental health.”The governor’s wife commended members of Edo State Drug Control Committee for their efforts and urged them not to relent in taking the message to all the nooks and crannies of the state and to all schools.\nHe added that the state Drug Control Committee was set up in 2019, to sensitize the youths and the public against drug abuse and the dangers of drug abuse and its potential to destroy their lives."
  },
  {
    "headline": "COVID-19: Edo immunises over 37,000 persons, extends first phase vaccination exercise – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has announced the extension of the first phase of COVID-19 vaccination across the state’s 18 local councils to enable more people to receive the vaccine and get protected against the deadly virus.\nObi further urged all eligible citizens for the first phase vaccination exercise to leverage the extension to get inoculated at various designated centres across the state.\nAccording to him, “The Edo State Government has continued to intensify the COVID-19 vaccination exercise, as additional AstraZeneca vaccines were received from the Federal Government.\nThese vaccines are meant for mop-up of the first phase of the COVID-19 vaccination, to reach front line workers, strategic leaders, the elderly and other eligible persons.\n“The centres include fixed vaccination posts at the Edo State Ministry of Health Secretariat; Edo State Primary Health Care Development Agency, at Hospitals Management Board Premises; Central Hospital and the University of Benin Teaching Hospital (UBTH)."
  },
  {
    "headline": "Edo places tax certificate as precondition to access public services, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has placed the possession of Tax Clearance Certificate (TCC) as precondition for accessing public services and some commercial transactions in the state.\nIn a statement, the Executive Chairman, Edo State Internal Revenue (EIRS), Igbinidu Inneh, said that the measure is being taken to ensure that taxable citizens meet their civic duties.\nThe statement further added that the demand for TCC, covering three preceding years, is in line with Section 85 of the Personal Income Tax Act (PITA) as amended.\nRecall that the state government embarked on a comprehensive campaign to name-and-shame firms and high-net worth individuals who were defaulting in their tax obligations.\nUp to 150 firms have been distrained since the commencement of the exercise, as officials are visiting more business premises to implement the name-and-shame directive."
  },
  {
    "headline": "JUST IN: Army confirms death of its chief, Presidency mourns",
    "summarized_story": "ADVERTISEMENTThe Nigerian Army has confirmed the death of the Chief of Army staff, Ibrahim Attahiru, in a plane crash on Friday.\n“The Nigerian Army regrets to announce the passing away of its Chief of Army Staff, Lt Gen Ibrahim Attahiru .\n“Details of the sad incident and burial arrangements will be communicated soon,” the Army spokesperson stated.\nMeanwhile, the Presidency has described the late army chief and other military personnel as heroes who paid the ultimate price for peace and security in the land.\nUntil his appointment on January 26, he was the General Officer Commanding 82 Division of the Nigerian Army, Enugu."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Nigerian Military confirms death of its Chief of Army Staff, Attahiru, 10 officers in air crash",
    "summarized_story": "OBINNA EZUGWUThe Nigerian Army has confirmed the passing away of its Chief of Army Staff, Lieutenant General Ibrahim Attahiru, and ten senior officers who died on Friday in a military Plane Crash in Kaduna State.\nMeanwhile, former vice president, Alhaji Atiku Abubakar has described the death as a dark day for the nation.\nThe loss of COAS Major Gen. Ibrahim Attahiru and others today sends a rude shock across Nigeria and our friends worldwide,” he said.\n“I sympathise with the Commander-in-Chief and our armed forces on this sad development.\nMay the Attahiru family and other affected families be comforted, and their memories be a blessing.”"
  },
  {
    "headline": "FG to capture IMEI automatically, denies asking Nigerians to submit phone identity",
    "summarized_story": "The Nigerian Communications Commission (NCC) has denied reports that it asked mobile subscribers to submit the international mobile equipment identity (IMEI) of their phones to it from July, 2021.\nIn a statement on Friday, the Director of public affairs of the NCC, Ikechukwu Adinde, said the commission did not at any time issue a statement regarding the registration of IMEI by subscribers and it has no plans to do so.\n“It is pertinent to state that the Commission is in the process of deploying a Device Management System (DMS).\nThe DMS will essentially protect subscribers against phone theft and will identify and enable the elimination of fake devices from the networks.\nThe system will capture IMEI automatically without any requirement for subscribers to submit same.”Adinde advised the general public to disregard the said publications, which have created the erroneous impression that telephone subscribers will be required to register their IMEI with their networks."
  },
  {
    "headline": "The Osun Progressives says its existence within APC constitutional framework",
    "summarized_story": "Sunday OguntuyiThe Osun Progressives (TOP), a caucus of the All Progressives Congress (APC) in the state, says it wishes to state that its existence and activities are normal, rational and within the framework of our party’s constitution.\n“His inability to demonstrate needed capacity expected of him as the Chairman of the party towards 2018 governorship election nearly caused the party grief.\n“As we speak today, Famodun is at war with his two predecessors, the current Deputy and Secretary, the minister and other notables in the party.\n“May we, at the risk of sounding immodest, note that members of TOP have paid our dues in the party and especially in the progressives political platform that we have reason to say the Osun APC needs reworking, retooling and re-energising.\n“We have witnessed many “ups” and “lows” of the progressives political platform more than many people marauding around as leaders in APC today."
  },
  {
    "headline": "Nigeria’s govt says it’s not in a hurry to increase fuel price to N380 per litre",
    "summarized_story": "Nigeria’s federal government has said it is not in a hurry to increase the pump price of petrol.\nMinister of State for Petroleum Resources, Timipre Sylva, who said this while reacting to the recommendation of the Nigerian Governors’ Forum (NGF) that fuel price should be between N380 and N408.5 per litre, assured Nigerians that there would be no increment in pump price of fuel in June.\nNigerian governors had at a virtual meeting on Wednesday, called for the full deregulation of the downstream sector and the immediate removal of fuel subsidy, saying the current subsidy regime was unsustainable, and only smugglers and illegal marketers benefit from it.\n“The current price of petrol will be retained in the month of June until the ongoing engagement with organized labour is concluded.\nThis clarification becomes necessary in the light of recent reports regarding the resolution of the Nigeria Governors Forum to increase the pump price of petrol."
  },
  {
    "headline": "Gbajabiamila Mourns Army Chief Attahiru, Others",
    "summarized_story": "The Speaker of the House of Representatives, Rep. Femi Gbajabiamila, has described as shocking and sad the death of the Chief of Army Staff, Lieutenant General Ibrahim Attahiru, and seven others in a plane crash on Friday evening in Kaduna.\nGbajabiamila said the death of the Army Chief was unfortunate coming at a time that the Nigerian military was finding solutions to the security challenges in the country.\nGbajabiamila, who said he had a few meetings with Attahiru in search of solutions to the challenges, noted that the late Army Chief came across as a core professional officer.\nHe said the Nigerian military, especially the Nigeria Army, has lost a dedicated and committed senior officer whose services to fatherland will be sorely missed.\nThe Speaker sent his condolences to President Muhammadu Buhari, the Nigerian military, and the Attahiru family over the loss."
  },
  {
    "headline": "Gbajabiamila Mourns Army Chief Attahiru, Others",
    "summarized_story": "The Speaker of the House of Representatives, Rep. Femi Gbajabiamila, has described as shocking and sad the death of the Chief of Army Staff, Lieutenant General Ibrahim Attahiru, and seven others in a plane crash on Friday evening in Kaduna.\nGbajabiamila said the death of the Army Chief was unfortunate coming at a time that the Nigerian military was finding solutions to the security challenges in the country.\nGbajabiamila, who said he had a few meetings with Attahiru in search of solutions to the challenges, noted that the late Army Chief came across as a core professional officer.\nHe said the Nigerian military, especially the Nigeria Army, has lost a dedicated and committed senior officer whose services to fatherland will be sorely missed.\nThe Speaker sent his condolences to President Muhammadu Buhari, the Nigerian military, and the Attahiru family over the loss."
  },
  {
    "headline": "Crash: PDP Shelves Kaduna Rally In Honour Of Late COAS, Others",
    "summarized_story": "The Kaduna State chapter of the Peoples Democratic Party (PDP), said it received with great shock, the sad news of plane crash on Friday near Kaduna International Airport, which claimed the lives of the Chief of Army Staff (COAS), Lt. Gen. Attairu Ibrahim, and other officers on board.\nAccording to PDP in a statement issued and signed by the state chairman, Hon.\n“The PDP in Kaduna state condoles with Mr President, the Kaduna State Government, the Military High Command, his immediate family, colleagues and well wishers over this irreparable loss.\n“The party calls for prayers for the repose of their souls and regrets any inconveniences this cancellation might cause.\n“May God console us all and grant us the fortitude to bear this loss.”READ ALSO:: COAS: Details Of Plane Crash, Burial To Be Out Soon – Army"
  },
  {
    "headline": "Crash: PDP Shelves Kaduna Rally In Honour Of Late COAS, Others",
    "summarized_story": "The Kaduna State chapter of the Peoples Democratic Party (PDP), said it received with great shock, the sad news of plane crash on Friday near Kaduna International Airport, which claimed the lives of the Chief of Army Staff (COAS), Lt. Gen. Attairu Ibrahim, and other officers on board.\nAccording to PDP in a statement issued and signed by the state chairman, Hon.\n“The PDP in Kaduna state condoles with Mr President, the Kaduna State Government, the Military High Command, his immediate family, colleagues and well wishers over this irreparable loss.\n“The party calls for prayers for the repose of their souls and regrets any inconveniences this cancellation might cause.\n“May God console us all and grant us the fortitude to bear this loss.”READ ALSO:: COAS: Details Of Plane Crash, Burial To Be Out Soon – Army"
  },
  {
    "headline": "Crash: Senate President Mourns COAS Attahiru, Other Officers",
    "summarized_story": "The President of the Senate, Ahmad Lawan, has expressed deep sadness over the tragic death of the Chief of Army Staff, Lt. General Ibrahim Attahiru, and other military officers killed in an air crash on Friday while on official trip to Kaduna.\nIn a statement signed by the media adviser to the Senate President, Ola Awoniyi, Lawan described the tragedy as a national disaster of immense proportion that has thrown the entire nation into mourning.\n“I extend my heartfelt condolences to the Chief of Defence Staff and the entire members of the Armed Forces of Nigeria over this tragedy.\n“This incident is saddening, coming at a time there is a fresh momentum in the nation’s war against insurgency, banditry and other violent crimes.\n“I commiserate with the President and Commander-in-Chief of the Armed Forces, Muhammadu Buhari and the families of the deceased over the tragic incident and wish the departed souls eternal peace,” Lawan said."
  },
  {
    "headline": "Fani-Kayode: Chief of Army Staff, Attahiru’s death, monumental tragedy",
    "summarized_story": "Femi Fani-Kayode, former Aviation Minister has reacted to the death of the Chief of Army Staff, General Ibrahim Attahiru.\nFani-Kayode described Attahiru’s death as a monumental tragedy to Nigeria.\nAttahiru died in an air crash on Friday.\nREAD ALSO: BREAKING: Nigerian Army Chief Of Staff, General Ibrahim Attahiru Is DeadDAILY POST gathered that Attahiru died with his aides in a plane crash.\nCommissioner and Chief Executive Officer of the Accident Investigation Bureau, Nigeria, Akin Olateru, confirmed that the eight souls died onboard."
  },
  {
    "headline": "BREAKING: Nigerian Army Chief Of Staff, General Ibrahim Attahiru Is Dead",
    "summarized_story": "Nigerian Army Chief of Staff, General Ibrahim Attahiru is dead.\nThe Chief of Army Staff, Lt General Ibrahim Attahiru died in an air crash on Friday, May 21, 2021.\nThe Nigerian Army Chief of Staff, General Ibrahim Attahiru was aboard a military aircraft to an official trip to Kaduna State.\nThe Nigerian Army Chief of Staff, General Ibrahim Attahiru died with his aides in a plane crash.\nZ. Gambo – Chief of Naval Staff, and Air Marshal I. O. Amao – Chief of Air Staff."
  },
  {
    "headline": "Iyatsere faction in Warri kingship tussle allegedly shuns peace meeting",
    "summarized_story": "And they have so far refused to give reasons why they were not present in the peace meeting, after they had earlier agreed to attend.\nHe then went ahead to question, “why should I be invited to a meeting where the missing Warri crown is to be discussed?\nThe former speaker was said, to have wondered aloud, asking, if the present Olu of Warri is to be crowned, what will the Itsekiri people use to crown him as the Olu of Warri Kingdom?\nPalace Watch contacted Chief Yayah Pessu, to find out how the peace meeting went, and why the iyatsere and his group did not turn up for the meeting.\nHe said, “We have made some significant progress, even though Chief Atserunleghe, the Iyatsere of Warri Kingdom and his group were unable to attend the meeting."
  },
  {
    "headline": "Troops eliminate 40 Boko Haram insurgents in Borno",
    "summarized_story": "By Dilibe MichaelThe Nigerian Army troops has launched a deadly attack on the dreaded Boko Haram terrorists in Dawuri village axis of Borno State, killing no fewer than 40 insurgents, while several others were seriously wounded.\nReliable military sources at the 7 Division Headquarters Nigerian Army Maiduguri, disclosed that the attack was carried out at Konduga LGA of the State.\nAccording to the source, the insurgents were planning on attacking an area in Maiduguri, the capital city of Borno.\n“The military attack left about 40 terrorists and left many with serious injury”, the source revealed .\nGen. Abdulwahab A. Eyitayo, applauded the troops for their display of bravery and military expertise."
  },
  {
    "headline": "Buhari expresses shock, sorrow over death of Attahiru, others",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari is deeply saddened over the air crash that claimed the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, and other military officers.\nThe President condoles with families of the deceased, the military, and Nigerians in general, describing them as “heroes who paid the ultimate price for peace and security in the land.”While praying that God receives the souls of the patriots, the President says the crash “is one mortal blow to our underbelly, at a time our armed forces are poised to end the security challenges facing the country.”The President pledged that the departed would not die in vain.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari expresses shock, sorrow over death of Attahiru, others",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari is deeply saddened over the air crash that claimed the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, and other military officers.\nThe President condoles with families of the deceased, the military, and Nigerians in general, describing them as “heroes who paid the ultimate price for peace and security in the land.”While praying that God receives the souls of the patriots, the President says the crash “is one mortal blow to our underbelly, at a time our armed forces are poised to end the security challenges facing the country.”The President pledged that the departed would not die in vain.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Chief of Army Staff, Ibrahim Attahiru, dies in Kaduna plane crash",
    "summarized_story": "The Chief of Army Staff, Lt General Ibrahim Attahiru, has died in an plane crash with some of his aides.\nNTHis mission to Kaduna was said to be “official.”Details shortly…NationThe PUNCH learnt that the ill-fated aircraft crashed at the airport’s runway about 6 pm.\nCommissioner and Chief Executive Officer of the Accident Investigation Bureau, Nigeria, Akin Olateru, confirmed that the eight souls died onboard.\n“An air crash involving a @NigAirForce aircraft occurred this evening near the Kaduna International Airport.\nOn Sunday, February 21, 2021, seven NAF officers died onboard a Beechcraft KingAir B350i aircraft when the jet crashed in Abuja."
  },
  {
    "headline": "Chief of Army Staff, Ibrahim Attahiru, dies in Kaduna plane crash",
    "summarized_story": "The Chief of Army Staff, Lt General Ibrahim Attahiru, has died in an plane crash with some of his aides.\nNTHis mission to Kaduna was said to be “official.”Details shortly…NationThe PUNCH learnt that the ill-fated aircraft crashed at the airport’s runway about 6 pm.\nCommissioner and Chief Executive Officer of the Accident Investigation Bureau, Nigeria, Akin Olateru, confirmed that the eight souls died onboard.\n“An air crash involving a @NigAirForce aircraft occurred this evening near the Kaduna International Airport.\nOn Sunday, February 21, 2021, seven NAF officers died onboard a Beechcraft KingAir B350i aircraft when the jet crashed in Abuja."
  },
  {
    "headline": "Attahiru: Buhari says plane crash ‘mortal blow to our underbelly’",
    "summarized_story": "By AbankulaPresident Muhammadu Buhari said he is deeply saddened over the air crash that claimed the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, and other military officers.\nThe President condoles with families of the deceased, the military, and Nigerians in general.\nHe described the dead as “heroes who paid the ultimate price for peace and security in the land.”He prayed that God would receive the souls of the patriots.\nAccording to Buhari, the crash “is one mortal blow to our underbelly, at a time our armed forces are poised to end the security challenges facing the country.”The President pledged that the departed would not die in vain."
  },
  {
    "headline": "Death of COAS Attahiru, others dark day for Nigeria",
    "summarized_story": "Kazeem UgbodagaFormer Vice President, Atiku Abubakar has described the death of Chief of Army Staff, Lt General Ibrahim Attahiru and others as a dark day for Nigeria.\nReacting to the sad news, Atiku said it was in deed a dark day, saying that the loss of the COAS and others sent rude shock across Nigeria.\nHe sympathized with President Muhammadu Buhari and the Nigerian Army over the death of the officers.\n“It is a dark day for the nation.\nThe loss of COAS Major Gen. Ibrahim Attahiru and others today sends a rude shock across Nigeria and our friends worldwide."
  },
  {
    "headline": "3 brigadiers, 2 majors in crashed plane, Fati Attahiru alive",
    "summarized_story": "Fati Attahiru, wife of the chief of army staff was not inside the crashed Beechcraft 350 plane, as reported.\nBut six aides of her husband, 54 year-old Lt. General Ibrahim Attahiru, died with him, along with four crew members.\nThe aides were identified as:BRIG GEN MI ABDULKADIR, BRIG GEN OLAYINKA, BRIG GEN KULIYA, MAJ LA HAYAT, MAJ HAMZA and SGT UMAR.\nThe crew members are FLT LT TO ASANIYI, FLT LT AA OLUFADE, SGT ADESINA.\nAttahiru and the aides were going to Kaduna, ostensibly to attend tomorrow’s passing out parade of soldiers from the Nigerian Army Depot in Zaria."
  },
  {
    "headline": "Nigerian Governor, El-Rufai Caught On Tape Speaking On Plans To ‘Kill’ NLC Leaders, Protesters In Kaduna",
    "summarized_story": "El-Rufai and other voices in the tape were caught implying that the NLC leaders first camped in Kano State before they reached Kaduna and were mobilised from there by the Kano State government, making a hidden citation to Governor Abdullahi Ganduje’s officials.\nThey also examined the police personnel whom they accused of giving protection to the NLC protesters and not siding with the state government.\nRotimi Amaechi, as captured in the tape, the governor said, “Oh Amaechi, excellency, how now?\nThey went to Kano.”He also accused an unnamed governor of providing mobilisation funds for the NLC to destabilise the northwestern state.\nIt was trying to play both sides.”It was reported Tuesday that hoodlums reportedly loyal to El-Rufai disturbed the peaceful protest embarked upon by the NLC in Kaduna State."
  },
  {
    "headline": "BREAKING: Nigeria’s Chief Of Army Staff, Ibrahim Attahiru killed in Plane Crash [Video]",
    "summarized_story": "The Nigerian Chief of Army Staff Ibrahim Attahiru has been killed in a plane crash in Kaduna, NewsDirect.ng can reportThe training aircraft crashed at the Kaduna international airport.\nThe Ill-fated aircraft was said to have crashed at the airport’s runwayThe incident was said to have occurred at about 6 pm while it was raining heavily.\nPlane crash in Kaduna.\nBeach 350 pic.twitter.com/mlnRxS9iwY — Lintima (@iiLamar) May 21, 2021The plane was said to have crash-landed on the runway, with the eight people on board feared dead.\nMore to follow…"
  },
  {
    "headline": "BREAKING: Nigerian Communications Commission Denies Asking Subscribers To Submit Phone IMEI Numbers From July",
    "summarized_story": "The Nigerian Communications Commission has refuted reports that mobile subscribers will be required to submit the international mobile equipment identity (IMEI) of their phones to it from July, 2021.\nThe Director of public affairs of the NCC, Ikechukwu Adinde, in a statement on Friday, said the commission did not at any time issue a statement regarding the registration of IMEI by subscribers and it has no plans to do so.\n“It is pertinent to state that the Commission is in the process of deploying a Device Management System (DMS).\nThe DMS will essentially protect subscribers against phone theft and will identify and enable the elimination of fake devices from the networks.\nThe system will capture IMEI automatically without any requirement for subscribers to submit same.”Adinde notified the general public to disregard the said publications, which have established the false impression that telephone subscribers will be required to register their IMEI with their networks."
  },
  {
    "headline": "Revealed! How Chief of Army Staff, Attahiru, others crashed",
    "summarized_story": "The Chief of Army Staff, Lt-Gen. Ibrahim Attahiru has died in an air crash while on an official trip to Kaduna.\nAttahiru died in a military Beachcraft 350 aircraft that crashed at Kaduna International Airport on Friday, claiming all eight souls onboard.\nConfirming the incident in a WhatsApp post, Commissioner and Chief Executive Officer of the Accident Investigation Bureau, Nigeria, Akin Olateru, said the eight souls died onboard.\nGeneral Attahiru with Army Number 8406 was appointed army chief by President Muhammadu Buhari in January 2021.\nBefore his appointment as the Chief of Army Staff, he was the General Officer Commanding 82 Division of the Nigerian Army, Enugu."
  },
  {
    "headline": "VIDEO: Crash site of where Chief of Army Staff, others died revealed",
    "summarized_story": ""
  },
  {
    "headline": "Reducing governance cost: Whither Oronsaye report?",
    "summarized_story": "ELEOJO IDACHABA in this report takes a look at the Steve Oronsaye report and wonders if it could be revisited.\nAlthough the Committee finished the work and submitted its report, 10 years later, the government is still crying foul on account of the high cost of governance.\nThe 800-page document otherwise known as the Oronsaye report contained far-reaching recommendations that, if implemented, would help to address the high cost of governance in the country.\nThe ICIR viewIn its take, the International Centre for Investigative Report (ICIR) noted that, “High cost of governance is forcing the Nigerian government into borrowing money to finance budget deficits and also to fund capital projects.\n“As it is, nothing stops Mr. President from coming up with an Executive Order for implementation of the Oronsaye report."
  },
  {
    "headline": "NASS laments Nigeria’s extremely high mortality indices -NigPilot",
    "summarized_story": "*Calls for prioritization of health securityNational Assembly has decried the extremely high mortality indices in Nigeria, despite huge resources sunk into the health sector over the years by the government at all levels.\nIt therefore called for prioritization of health security in the country on the template of Universal Health Coverage, which it added, cannot be achieved through the exclusive National Health Insurance Scheme being run by the federal government now.\nHe said: “This action by the legislature has become critically necessary as the country’s mortality indices have remained extremely high with minimal improvements, despite the magnitude of resources contributed to improve the statistics.\n“Although the country is making attempts to take giant strides in its pursuit of Universal Health Coverage (UHC); these efforts and whatever achievements have been recorded could be quickly eroded if health security is not prioritized.\nTanko Sununu said there is need for amendment of the existing National Health Insurance Scheme Act for actualisation of the Universal Health Coverage and by extension, health security."
  },
  {
    "headline": "NASS laments Nigeria’s extremely high mortality indices -NigPilot",
    "summarized_story": "*Calls for prioritization of health securityNational Assembly has decried the extremely high mortality indices in Nigeria, despite huge resources sunk into the health sector over the years by the government at all levels.\nIt therefore called for prioritization of health security in the country on the template of Universal Health Coverage, which it added, cannot be achieved through the exclusive National Health Insurance Scheme being run by the federal government now.\nHe said: “This action by the legislature has become critically necessary as the country’s mortality indices have remained extremely high with minimal improvements, despite the magnitude of resources contributed to improve the statistics.\n“Although the country is making attempts to take giant strides in its pursuit of Universal Health Coverage (UHC); these efforts and whatever achievements have been recorded could be quickly eroded if health security is not prioritized.\nTanko Sununu said there is need for amendment of the existing National Health Insurance Scheme Act for actualisation of the Universal Health Coverage and by extension, health security."
  },
  {
    "headline": "PDP to Buhari: Engage Nigerians at home in geo-political zones townhall meetings -NigPilot",
    "summarized_story": "Opposition Peoples Democratic Party, PDP, has charged President Muhammadu Buhari to summon courage and hold sessions with Nigerians via townhall meetings in the six geo-political zones just like the one he had with Nigerian citizens living in France.\nAccording to the PDP Spokesman, Kola Ologbondiyan , President Buhari should be bold to face Nigerians at home and give account of his administration in the last six years.\nThe PDP noted that it was not enough for President Buhari to visit far away France and attempt to use unsuspecting Nigerians living in Paris in a desperate effort to window dress the shambolic economic and security situation foisted on our nation by his failed administration.\nPresident must be reminded that his administration conducted the worst election in our national history as witnessed in the 2019 elections as well as some of the off-season elections.\n“Moreover, our party shudders that Mr. President can assert that he is committed to a multi-party system, in a situation where brazen efforts are being made by his administration to strangulate the main opposition party, with various instruments of suppression including encouraging the EFCC to unconstitutionally harass our party leaders.”The PDP stressed that it was equally jolted by Mr. President’s presentation of imaginary commitment of his administration towards security, economy, agriculture and education."
  },
  {
    "headline": "PDP to Buhari: Engage Nigerians at home in geo-political zones townhall meetings -NigPilot",
    "summarized_story": "Opposition Peoples Democratic Party, PDP, has charged President Muhammadu Buhari to summon courage and hold sessions with Nigerians via townhall meetings in the six geo-political zones just like the one he had with Nigerian citizens living in France.\nAccording to the PDP Spokesman, Kola Ologbondiyan , President Buhari should be bold to face Nigerians at home and give account of his administration in the last six years.\nThe PDP noted that it was not enough for President Buhari to visit far away France and attempt to use unsuspecting Nigerians living in Paris in a desperate effort to window dress the shambolic economic and security situation foisted on our nation by his failed administration.\nPresident must be reminded that his administration conducted the worst election in our national history as witnessed in the 2019 elections as well as some of the off-season elections.\n“Moreover, our party shudders that Mr. President can assert that he is committed to a multi-party system, in a situation where brazen efforts are being made by his administration to strangulate the main opposition party, with various instruments of suppression including encouraging the EFCC to unconstitutionally harass our party leaders.”The PDP stressed that it was equally jolted by Mr. President’s presentation of imaginary commitment of his administration towards security, economy, agriculture and education."
  },
  {
    "headline": "Ayade: PDP urges members in Cross Rivers State to remain united -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Chief Of Army Staff, Others Die In Kaduna Plane Crash",
    "summarized_story": "﻿A military plane crashed in Kaduna State on Friday with the Chief of Army Staff, Lieutenant General Ibrahim Attahiru, along with several other officers, on board.\nHe rose through the rank to become the 21st Chief of Army Staff of the Nigerian Army.\nBefore his appointment as the Chief of Army Staff, he had commanded Operation Lafiya Dole between May 2017 to December 2017.\n“President Muhammadu Buhari is deeply saddened over the air crash that claimed the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, and other military officers,” the statement said.\nPresident Muhammadu Buhari is deeply saddened over the air crash that claimed the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, and other military officers."
  },
  {
    "headline": "Kaduna Crash: Attahiru, Others Paid Ultimate Price For Peace, Security – Buhari",
    "summarized_story": "President Muhammadu Buhari has mourned the Chief of Army Staff, Lieutenant Ibrahim Attahiru and other victims of the military plane crash in Kaduna, saying they paid the ultimate price for peace and security in Nigeria.\nThe late COAS was killed on Friday after a military Beachcraft 350 aircraft crashed at the Kaduna International Airport, claiming all eight souls on-boardPresident Buhari in a statement issued by his spokesman, Femi Adesina, said he is saddened over the loss of the army chief and other military officers.\nHe pledged that their death would not be in vain, condoling with the families of the deceased, the military, and Nigerians in general.\nREAD ALSO: Chief Of Army Staff, Others Die In Kaduna Plane CrashThe statement read, “President Muhammadu Buhari is deeply saddened over the air crash that claimed the Chief of Army Staff, Lt. Gen. Ibrahim Attahiru, and other military officers.\nThe President pledged that the departed would not die in vain.”"
  },
  {
    "headline": "Tributes Pour In For Late COAS Attahiru, Others",
    "summarized_story": "An avalanche of tributes were paid to former Chief of Army Staff, Lieutenant General Ibrahim Attahiru and ten others who died in an air crash in Kaduna on Friday.\nAccording to an army statement confirming the death, the ex-COAS was en-route Kaduna from Abuja when the unfortunate incident happened.\n“The Nigerian Army regrets to announce the passing away of its Chief of Army Staff, Lt Gen Ibrahim Attahiru,” the statement, signed by army spokesman, Brigadier-General Ibrahim Yerima, said.\nGbajabiamila, who said he had a few meetings with Attahiru in search of solutions to the challenges, noted that the late Army Chief came across as a core professional officer.\nThe Governor said the late Chief of Army Staff has, within his short time in the office, demonstrated and showed remarkable commitment and professionalism in the course of discharging his duty."
  },
  {
    "headline": "Bandits Attack Katsina Catholic Church, Kill Reverend Father",
    "summarized_story": "Bandits have attacked St. Vincent Ferrer Catholic Church located in Malumfashi Local Government Area of Katsina State, killing a Reverend father Alphonsus Bello.\nDuring the attack which occurred on Thursday night another priest, Reverend Father Joe Keke was abducted.\nHe said, the deceased reverend father Bello initially resisted attempts by the gunmen to abduct him after which he was overpowered.\nHe said the command is doing all it could to ensure that the abducted Reverend father Keke is rescued alive.\n“As for the other priest Reverend father Bello, our men found the corpse and there were no signs of gunshots on him”."
  },
  {
    "headline": "Nigerians Not Required To Submit IMEIs – NCC",
    "summarized_story": "Nigerians are not required to submit the International Mobile Equipment Identity (IMEI) of their phones from July.\nThis is according to the Nigerian Communications Commission (NCC) which denied media reports suggesting that the masses would have to submit their IMEIs to the Federal Government.\nNCC in a statement issued on Friday by its spokesperson, Ikechukwu Adinde, said the commission is in the process of deploying a Device Management System.\n“At no time did the commission issue a statement regarding the registration of IMEI by subscribers and it has no plans to do so,” he said.\n“The system will capture IMEI automatically without any requirement for subscribers to submit same.”"
  },
  {
    "headline": "Nigerian Army confirms death of COAS, Lieutenant General Ibrahim Attahiru",
    "summarized_story": "The Nigerian Army regrets to announce the passing away of its Chief of Army Staff, Lt Gen Ibrahim Attahiru .\nThe sad event occurred following an air crash in Kaduna which also claimed the lives of 10 other officers including the crew.\nThe COAS was enroute Kaduna from Abuja on Friday, 21 May, 2021 when the unfortunate incident happened.\nDetails of the sad incident and burial arrangements will be communicated soon."
  },
  {
    "headline": "Vice President expresses confidence that a new Nigeria will emerge from current challenges",
    "summarized_story": "Vice-President Yemi Osinbajo says the cloud currently hovering over the country will give way for the emergence of a new Nigeria.\nAccording to a statement by his Senior Special Assistant on Media and Publicity, Laolu Akande, the Vice President spoke on Friday at the national prayer breakfast in Abuja.\nOsinbajo says the need for collective prayers, faith, hope and action, is more important now adding that Nigeria will prevail over the challenges of today.\nReferencing the Bible in 2 Kings 2:19-22, the Vice President said, “we, the salt, are also poured today by prayer and prophecy, to the source of our nation’s problems.\nHe went on to praise the organisers, the Christian Association of Nigeria, and former Head of State, General Yakubu Gowon (retd."
  },
  {
    "headline": "Nigeria: Subscribers’ Phone ID Will Be Captured Automatically, Says Comms Commission",
    "summarized_story": "The Nigerian Communications Commission (NCC) says it’s in the process of deploying the Devise Management System (DMS) which will automatically capture the International Mobile Equipment Identity (IMEI) numbers of Nigerians.\nThere were several media publications to the effect that the commission will require citizens to submit the International Mobile Equipment Identity (IMEI) of their phones to it from July 2021.\nHe continued, “It is pertinent to state that the Commission is in the process of deploying a Devise Management System (DMS).\nThe DMS will essentially protect subscribers against phone theft and will identify and enable the elimination of fake devices from the networks.\n“The system will capture IMEI automatically without any requirement for subscribers to submit same.”By Abel Ejikeme"
  },
  {
    "headline": "Nigeria’s Chief of Army Staff Attahiru Dies in Kaduna Military Plane Crash",
    "summarized_story": "Nigeria’s Chief of Army Staff Lt General Ibrahim Attahiru has died in a plane crash that occured in northwestern Kaduna State.\nThe Military plane was reportedly ferrying the Chief of Army Staff other top military personnel.\nReports however suggest the military plane was carrying the Chief of Army Staff and a few other top military personnel.\nLt General Attahiru was appointed Chief of Army Staff by President Muhammadu Buhari on January 26, 2021.\nProminent among these appointments are Commanding Officer 146 Battalion Nigerian Army (Operation HARMONY IV) in the Bakassi Peninsula, Commander 13 Brigade Nigerian Army (Operation PULO SHIELD), General Officer Commanding 82 Division Nigerian Army."
  },
  {
    "headline": "Israeli Police Clash with Palestinian Protesters at Al-Aqsa Mosque",
    "summarized_story": "Clashes broke out between Palestinian protesters and Israeli police following Friday prayers at the Al-Aqsa Mosque compound.\nPolice fired stun grenades and tear gas, and Palestinians hurled rocks after hundreds took part in a celebratory demonstration in which they waved Palestinian and Hamas flags and cheered the militant group.\nIsraeli police, it adds, subsequently “raided the courtyards and started firing rubber-coated rounds and tear-gas at the worshippers”.\nAt least 15 people were hit by rubber-coated rounds, while many others were affected by tear gas or were beaten by officers, according to Wafa.\nEarlier thousands took to the streets of Gaza as a cease-fire took hold at 2 a.m.Young men waved Palestinian and Hamas flags, passed out sweets, honked horns and set off fireworks."
  },
  {
    "headline": "Japan Expands State of Emergency as Tokyo Olympics Looms",
    "summarized_story": "Japan has expanded a coronavirus state of emergency hours in an effort to contain a worrying surge in infections nine weeks ahead of the opening of the Tokyo Olympics.\nAlthough there’s no forced lockdown, the state of emergency allows prefectural governors to demand that shops and public establishments close or shorten their hours.\nIt has expanded from the hotspots of Osaka and Tokyo in late April to other regions earlier this month, currently covering 42% of Japan’s population.\nMore than half of Japan’s roughly 12,000 COVID-19 deaths have happened since February.\nAstraZeneca’s vaccines will not be distributed to public vaccination sites anytime soon, the health ministry said upon approval."
  },
  {
    "headline": "Blast Kills Several at Pro-Palestine Rally in Southwest Pakistan",
    "summarized_story": "Seven people have died after a powerful roadside bomb went off near a vehicle carrying a local leader of an Islamist political party in southwestern Pakistan.\nLocal police chief Abdul Bashir said the attack took place when Abdul Qadir, a local leader of a faction of the Jamiat Ulema-e-Islam party, was on his way to attend a pro-Palestinian rally.\nAlong with the seven killed, at least 15 people were wounded, he said.\nNo one claimed responsibility for the attack and police said they were still investigating.\nSimilar anti-Israel rallies were also held in other main cities across Pakistan, which is among few countries with no diplomatic ties with Israel."
  }
]