[
  {
    "headline": "‘Dancing can help lower cholesterol, reduce weight in menopausal women’",
    "summarized_story": "Angela OnwuzooA new study by the North American Menopause Society has suggested that dancing could help lower cholesterol levels, improve fitness and self-esteem in postmenopausal women.\nAccording to the study, women often struggle with managing their weight and other health risk factors, such as high cholesterol, once they transition through menopause.\n“As a result of all these changes, postmenopausal women often suffer from decreased self-image and self-esteem, which are directly related to overall mental health.\n“Few studies, however, have investigated the effects of dance on body image, self-esteem, and physical fitness together in postmenopausal women,” the authors said.\n“In addition to these benefits, women also probably enjoyed a sense of comradery from the shared experience of learning something new,” Faubion said."
  },
  {
    "headline": "‘Dancing can help lower cholesterol, reduce weight in menopausal women’",
    "summarized_story": "Angela OnwuzooA new study by the North American Menopause Society has suggested that dancing could help lower cholesterol levels, improve fitness and self-esteem in postmenopausal women.\nAccording to the study, women often struggle with managing their weight and other health risk factors, such as high cholesterol, once they transition through menopause.\n“As a result of all these changes, postmenopausal women often suffer from decreased self-image and self-esteem, which are directly related to overall mental health.\n“Few studies, however, have investigated the effects of dance on body image, self-esteem, and physical fitness together in postmenopausal women,” the authors said.\n“In addition to these benefits, women also probably enjoyed a sense of comradery from the shared experience of learning something new,” Faubion said."
  },
  {
    "headline": "Global COVID-19 cases now over 200m",
    "summarized_story": "The highly contagious Delta variant has driven the virus to return with a vengeance, the number of daily cases recorded worldwide rising by 68 per cent since mid-June.\nThe country’s two largest cities received a double blow in their efforts to retain “Covid Zero” status, with a record number of new cases in Sydney and Melbourne imposing its sixth lockdown.\nThe country also announced 160 deaths in 24 hours, as exhausted morgue workers struggle to cope with the mounting bodies.\nIndonesia’s total Covid death toll passed 100,000 on Wednesday after it recorded 1,739 of the 10,245 fatalities registered worldwide, the global toll rising past 4.25 million.\nJapan’s capital Tokyo had a new record number of daily cases with 5,042, just three days before the end of the Olympics."
  },
  {
    "headline": "Global COVID-19 cases now over 200m",
    "summarized_story": "The highly contagious Delta variant has driven the virus to return with a vengeance, the number of daily cases recorded worldwide rising by 68 per cent since mid-June.\nThe country’s two largest cities received a double blow in their efforts to retain “Covid Zero” status, with a record number of new cases in Sydney and Melbourne imposing its sixth lockdown.\nThe country also announced 160 deaths in 24 hours, as exhausted morgue workers struggle to cope with the mounting bodies.\nIndonesia’s total Covid death toll passed 100,000 on Wednesday after it recorded 1,739 of the 10,245 fatalities registered worldwide, the global toll rising past 4.25 million.\nJapan’s capital Tokyo had a new record number of daily cases with 5,042, just three days before the end of the Olympics."
  },
  {
    "headline": "ABIA: JOHESU suspends strike after meeting with state govt",
    "summarized_story": "Health workers in Abia state under the Joint Health Sector Unions, JOHESU, have suspended their strike in the state after a meeting with the state government and Assembly of Health Professionals, Abia state council on Thursday, 5th of August.\nThis was revealed in a communique issued after the meeting, signed by Comrade Okoro Ogbonnaya, State Chairman for JOHESU, Comrade Aligwe Chidi.\nT, State Secretary, JOHESU, and Prof A.C.B Agbazuere, Chief of Staff to Governor Ikpeazu.\nAt the end of the deliberations, JOHESU and the Assembly of Health Professionals, Abia State Council resolved to suspend the strike action.\nShould government renege on this agreement, JOHESU, Abia State Council shall have no other choice than to resurrect the suspended strike action in accprdance with Labour Laws."
  },
  {
    "headline": "AGEGE LG RUNOFF: LASIEC promises credible election, as PDP, APC beg for security",
    "summarized_story": "LASIEC Chairman, Justice Ayotunde PhilipsBy Olayinka AjayiThe Lagos State Independent Electoral Commission, LASIEC, has reassured Agege residents of a peaceful and credible runoff election in Ward F of Agege Local Government Area.\nSpeaking during a stakeholders’ forum for Ward F, LASIEC Chairman, Justice Ayotunde Philips, represented by the Electoral Commissioner, Dr. Bunmi Omosehinde, explained that the reason for the rerun in the ward was because there was no clear winner.\n“You know we are just coming from an election, so everything is ready and the joy is that the runoff is just between the All Progressive Congress, APC, and the Peoples Democratic Party, PDP.\nResponding, the PDP candidate for Ward F, Agege LG, Mr. Sakiru Akinwande said that he was on ground in all the 43 polling units to win the election.\nIt would be recalled that the last local government election in Agege, ward F was tied between PDP and the APC and LASIEC is empowered by its constitution to conduct a rerun election."
  },
  {
    "headline": "EFCC arraigns BDC operator for alleged N197m fraud in Kano",
    "summarized_story": "By Bashir Bello, KanoThe Kano Zonal Command of the Economic and Financial Crimes Commission, EFCC, has on Wednesday arraigned a Bureau De Change, BDC operator, Yusuf Yakubu before Kano State High Court presided over by Justice Sanusi Ma’aji for a charge bordering on misappropriation.\nCounsel to the defendant, Abdul Adamu informed the court that he had filed a motion challenging the jurisdiction of the court.\nThe presiding Judge, Justice Ma’aji however adjourned the matter till August 18 for argument on the motion.\nJustice Ma’aji granted the defendant bail of N50, 000,000 (Fifty Million Naira) and two sureties in like sum.\nOne of the sureties must be a relative of the defendant and both must also be residents of Kano."
  },
  {
    "headline": "External forces plotting to destabilize APC in Taraba – Chieftain",
    "summarized_story": "A Chieftain of the All Progressives Congress (APC) in Taraba, Mr Ezekiel Afukonyo has alleged that some external forces are trying to destabilize the party in the state to scuttle its plan to take over power from the PDP in 2023.\nHe explained that the battle for the soul of APC in the state has become more intense because the party is now the only hope for the future of Taraba.\nHe accused a serving Senator from the state for infiltrating some APC members and trying to use them to take over the party structure the recent ward congresses.\n“The APC is big enough to accommodate everyone but people must go through the right process be become members.\nMeanwhile, Sen. Yusuf Abubakar took control of the Central Zone, Sabo-Kente and other stakeholders in the Southern Zone."
  },
  {
    "headline": "Oduduwa Republic: Yoruba group petitions UN against Ilana Omo Oodua",
    "summarized_story": "By Omeiza Ajayi, AbujaThe Yoruba Appraisal Forum YAF has petitioned the United Nations, its five permanent members, the European Union EU, the African Union AU and other powerful countries across the world over a plan by the umbrella body of Yoruba self-determination groups, Ilana Omo Oodua, to present a petition against the Nigerian government at the 76th General Assembly of the UN.\nIt accused Ilana Omo Oodua and its allies of stockpiling arms and ammunition for its alleged plan to eventually confront the Federal Government in its bid to achieve its “evil objective” of breaking up the Nigerian state under the guise of fighting for an independent Yoruba Nation.\nThe Prof Banji-Akintoye-led Ilana Omo Oodua had recently announced its plan to attend the 76th UNGA scheduled for September to present a petition to the global organisation over its demand for a separate and independent Yoruba Nation.\nThey are only merely covering up their agenda with the cloak of fighting for Yoruba freedom and self-determination.\nTheir plan now is to take their self-imposed agitation for independence and self-determination to the next level, which would involve outright widespread violence fashioned after what the IPOB/ESN are now doing in the South-East and South-South regions of Nigeria."
  },
  {
    "headline": "Security situation in Nigeria surmountable – Army Chief, Yahaya",
    "summarized_story": "The Chief of Army Staff (COAS), Lt. General Yahaya Faruk, has said that with determination and the right efforts, the Nigeria security challenges are surmountable.\nHe also commended Governor Masari for providing support and logistics to the military formation in the state.\nIn his remark, Governor Masari noted that the banditry situation in the state is quite unpleasant with the daily reported severe attack witnessed in 10 of the most affected local government in the state.\nfor always giving a listening ear to the military formation in the state.\nThe Chief of Army Staff would tomorrow also be paying homage to the Emir of Daura, HRH Umar Farouq Umar while reaching out to other military formation in the state."
  },
  {
    "headline": "NUC approves 19 new programmes for Ignatius Ajuru University of Education",
    "summarized_story": "The National Universities Commission has given accreditation for nineteen undergraduate and post-graduate programmes in the Ignatius Ajuru University of Education in Rivers State.\nThe full accreditation by NUC comes three months after the commission’s accreditation panel visited the institution to ascertain the human and material resources available to run the new programmes.\nThe news of the accreditation was announced in a statements issued by the vice-chancellor of the Institution, Professor Ozo Mekuri Ndimele.\nThe VC in the statement commended staff for the effort toward achieving the feat."
  },
  {
    "headline": "81-year-old fraud victim praises EFCC for retrieving stolen money",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has received encomiums from a senior citizen, John Ederaro.\nThe 81-year-old showered praises after receiving a bank draft for N244,000 from the Benin Zonal Commander, Muhtar Bello.\nEderaro thanked the EFCC for the good work and described the agency as “a father to the fatherless”.\nA few days later, all the money in his account, which belonged to the community, was stolen.\nIn his remarks, Bello assured the commission would continue to discharge its duties diligently and restitute victims of fraud accordingly."
  },
  {
    "headline": "Integrate persons with disabilities to end discrimination, marginalisation – Islamic cleric tells Buhari, others",
    "summarized_story": "An Islamic cleric, Professor Sabit Ariyo Olagoke, has advised the three tiers of government to integrate persons with disabilities in all areas of human endeavours.\nOlagoke, who spoke with journalists in Ibadan on Thursday, noted that the need to integrate them is necessary in order to reduce discrimination, marginalisation and oppression of persons with disabilities (PWDs) across the country.\nDAILY POST recalls that President Muhammadu Buhari had in January 2019, assented to the Discrimination Against Persons with disabilities (Prohibition) Act 2018.\nThe law was aimed to end discrimination against persons with disabilities across the country.\nThe gap between persons with disabilities and other who do not have disabilities is too wide.”"
  },
  {
    "headline": "More Boko Haram members, wives surrender to Nigerian military, submit weapons",
    "summarized_story": "More Boko Haram and Islamic State West Africa Province (ISWAP) members have surrendered to the Nigerian military.\nFive 5 AK 47 rifles, 1 foreign AK 47 rifle with telescopic sight, 1 Fabrique Nationale rifle, 8 AK 47 rifle magazines, 1 FN rifle magazine, 1 Bandolier, 3 rounds of 7.62mm ammunition and N7,700.00 were recovered.\nAlso, a Boko Haram fighter from Abuja Asamau village in Sambisa surrendered to troops.\nHe submitted his AK 47 rifle, 2 magazines, 1 Magazine holder, 1 round of 7.62mm ammunition and N5,000.\nOver 100 Boko Haram and ISWAP members have turned themselves in the last two weeks."
  },
  {
    "headline": "15 things you probably didn’t know about Messi",
    "summarized_story": "Messi has won six Ballon d’Or awards and six European Golden Shoes5.\nMessi holds the records for most goals in La Liga (474), La Liga and European league season (50), most hat-tricks in La Liga (36) and the UEFA Champions League (8), and most assists in La Liga (192), a La Liga and European league season (21)[10] and the Copa América (17).\nMessi became the youngest Argentine to play and score in a FIFA World Cup in 2006.\nAs the squad’s captain from August 2011, he led Argentina to three consecutive finals: the 2014 FIFA World Cup12.\nHe won the 2005 FIFA World Youth Championship, finishing the tournament with both the Golden Ball and Golden Shoe."
  },
  {
    "headline": "Stop breastfeeding your husbands, breast milk is for babies - Commissioner warns women",
    "summarized_story": "Peace Nnaji, has urged mothers to reserve their breastmilk for their babies and not husband.\nSpeaking at the event, Communication Officer, UNICEF Enugu zone, Dr. Ijeoma Onuoha-Ogwe, appealed to media practitioners to help drive the message of exclusive breastfeeding through their various platforms.\nShe described the media as strategic partners in the campaign for exclusive breastfeeding and commended Journalists for their efforts in this direction while urging for more action.\nIn her presentation, UNICEF Nutrition Manager, Enugu zone, Dr. Hanifa Namusoke, insisted that exclusive breastfeeding is cheap and highly rewarding and urged mothers to embrace the practice.\nHe pledged the continued support of the corporation in promoting exclusive breastfeeding through media advocacy."
  },
  {
    "headline": "BREAKING: Heartbreak as Barcelona confim Messi’s exit",
    "summarized_story": "Iconic Barcelona legend Lionel Messi has left the La Liga giants.\nThe club announced the departure of its highest goal scorer in a statement on his website on Thursday evening.\n“As a result of this situation, Messi shall not be staying on at FC Barcelona.\nBoth parties deeply regret that the wishes of the player and the club will ultimately not be fulfilled.\n“FC Barcelona wholeheartedly expresses its gratitude to the player for his contribution to the aggrandisement of the club and wishes him all the very best for the future in his personal and professional life.”"
  },
  {
    "headline": "Kidnappers demand N700m ransom to free Bayelsa SSG’s mum, night club owner",
    "summarized_story": "Kidnappers of 80-year-old Madam Betinah Benson, mother of the Secretary to the Bayelsa State Government, Dr Kombowei Benson, have demanded a ransom of N500m for her release.\nAnother group of kidnappers also demanded N200m for the release of Tari Ajanami, the owner of a popular Club 64.\nWhile both abductions happened few days from the other, the ransom demand also occurred few hours apart.\nBut a member of the family of the abducted club owner, who pleaded anonymity, confirmed the family had been contacted by the kidnappers who demanded a ransom of N200m.\n“I was shocked when they demanded N200m."
  },
  {
    "headline": "BBNaija: Throwback video of Whitemoney working as a plumber surfaces",
    "summarized_story": "An old clip of Big Brother Naija Season 6 housemate, Whitemoney, where he was spotted advertising his business as a plumber has surfaced online.\nThe video captured the moment the reality star and his associate excavated sand from a reservoir tank.\nHe could be heard advertising his streams of business that include water treatment, latrine dredging, and plumbing works which he called his main profession.\nWatch the video below;"
  },
  {
    "headline": "Zulum orders probe into Borno Church demolition shooting",
    "summarized_story": "From Timothy Olanrewaju MaiduguriBorno governor, Babagana Zulum has ordered probe into the shooting and dead of one during the demolition of a church by government officials in Maiduguri Thursday.\nOfficials of the Borno Geographical Information Information Service (BOGIS) had demolished the local church branch of Ekkilisiya Yan’uwa a Nigeria (EYN -Church of the Brethren in Nigeria) at Maduganari, a populated area in Maiduguri on Thursday morning.\nDaily Sun learnt that some residents of the area had made spirited attempts to stop the demolition.\nWhile the demolition was going an, men of the Civilian JTF reportedly opened fire on the residents and workers at the church for allegedly attempting to stop the exercise.\nThe reporter saw the corpse of the deceased and the five injured men at the State Specialists’ Hospital emergency unit."
  },
  {
    "headline": "Yoruba nation agitation: Court stops Igboho’s arrest, bank accounts freezing",
    "summarized_story": "From Oluseye Ojo IbadanAn Oyo State High Court sitting in Ibadan, has restrained the Department of State Services (DSS) and the Attorney General of the Federation/Minister of Justice, Abubakar Malami (SAN), from arresting, intimidating, harassing and freezing the bank accounts of Yoruba nation agitator, Chief Sunday Adeyemo, also known as Sunday Igboho.\nThe injunctions were granted yesterday by Justice Ladiran Akintola, in a case with number M/435/2021, instituted by Igboho against the trio of Attorney-General of the Federation, SSS and Director of SSS in Oyo State.\nIgboho’s lead counsel, Chief Yomi Alliyu (SAN), who moved an exparte motion before the court, yesterday, had on Friday, July 23, 2021, filed a notice of application for the enforcement of Igboho’s fundamental human rights before the OyoState High Court.\nThe litigation was instituted by Igboho, followinga bloody raid on his house in Ibadan, in the early hours of July 1, this year, by the SSS, in collaboration with other security agencies.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "PDP crisis: Secondus fights back",
    "summarized_story": "He spoke amidst an emergency meeting of the National Working Committee (NWC) with aggrieved national officials.\nDaily Sun equally gathered that in the aftermath of the notice of resignation by the seven national officials and call by the national youth leader, Sunday Udeh-Okoye, for the resignation of Secondus, PDP have been making frantic efforts to calm frayed nerves.\nOlogbondiyan said against the backdrop, the NWC urged all PDP members to remain calm.\nHe was reacting to speculations that he was allegedly part of the plot to sack the party chairman.\nDickson stated this when he met with Secondus at the PDP national secretariat."
  },
  {
    "headline": "IPOB declares war on ‘unknown’ gunmen, police",
    "summarized_story": "Powerful, while urging the armed men to desist from the act, also cautioned the police to stop parading them as members of ESN just as it equally warned them to stop harassing innocent Igbo youths.\n“Nigerian Police should stop parading innocent people and tagging them ESN personnel because parading innocent people and tagging them ESN shows that Nigeria police and army have failed.\n“Those people you are parading to the public are not ESN members.\nNigeria must stop ridiculing themselves in the world because everyone is watching their activities.\nThese people they are parading to the public are not ESN members."
  },
  {
    "headline": "FEC approves $1.484bn for rehabilitation of Kaduna, Warri refineries",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Executive Council presided over by Vice President, Yemi Osinbajo has approved the sum of $1.484 billion for the rehabilitation of both Warri and Kaduna refineries.\nAccording to him, $897,678,800 will be spent to repair Warri refinery while Kaduna refinery will gulp $586,902,256.\nHe stressed that the completion of the rehabilitation exercise will be in three phases spread over 77 month period.\nSylva said: “The completion of the rehabilitation of Warri and Kaduna refineries is going to be in three phases.\nFirst phase will be completed within 21 months, in 23 months phase two will be completed and in 33 months, the full rehabilitation will be completed”."
  },
  {
    "headline": "Masari: 10 out of 34 LGs in Katsina are under Persistent Bandits’ Attacks",
    "summarized_story": "By Francis SardaunaThe Katsina State Governor, Aminu Bello Masari, on Thursday, expressed worries over the prevailing security challenges bedevilling the state, noting that 10 out of 34 local government areas of the state are under persistent attacks by bandits and kidnappers.\nHe said: “We here in Katsina, if we say we are very happy, we are not being honest.\nWe are disturbed with this issue of banditry accompanied with kidnapping, raping of innocent women, armed robbery on our highways.\n“10 out of 34 local governments in Katsina State are under severe bandits attacks daily.\nOur phones are permanently on to hear what is happening in local governments."
  },
  {
    "headline": "AU Announces Rollout of 400m Vaccine Doses to Member States",
    "summarized_story": "An initiative by the AU member states to pool their purchasing power, the AVATT had on March 28, 2021 signed a historic agreement for the purchase of 220 million doses of the Johnson & Johnson single-shot COVID-19 vaccine, with the potential to order an additional 180 million doses.\nThe Johnson & Johnson vaccine was selected for this first pooled procurement for three reasons.\nMonthly shipments will continue and be continually ramped up, with a target of delivering almost 50 million vaccines before the end of December.\nIt is significant that these vaccine doses are being produced on the African continent at the Aspen Pharmacare facility in Gqeberha in South Africa.\nAU Special Envoy, Mr Strive Masiyiwa, said: “Delivering our first doses to African Union member states is an unprecedented milestone."
  },
  {
    "headline": "FG Appoints Eight Transaction Advisers for $6.2bn Eurobonds",
    "summarized_story": "Ndubuisi FrancisPreparatory to the issuance of N2.343 trillion ($6.2 billion) Eurobonds in the International Capital Market (ICM) to partly finance its N5.2 trillion 2021 Budget deficit, the federal government has appointed eight international and domestic transaction advisers.\nThe eight transaction advisers include international bookrunners/joint lead managers–JP Morgan, Citigroup Global Markets Limited, Standard Chartered Bank and Goldman Sachs.\nWhite & Case LLP would act as the international Legal Adviser while the firm of Banwo & Ighodalo are the Nigerian Legal Advisers.\nThe Debt Management Office (DMO) announced yesterday that the eight Transaction Advisers emerged following an open competitive bidding process as outlined in the Public Procurement Act, 2007 (as amended).\nWith the approval of the Transaction Advisers by Federal Executive Council (FEC), the DMO said it would accelerate activities towards the issuance of the debt instrument."
  },
  {
    "headline": "FEC Approves $11.174bn For Construction of Lagos-Calabar Coastal Rail",
    "summarized_story": "Minister of State for Petroleum Resources, Chief Timipre Sylva, disclosed these at the end of the monthly FEC meeting in Abuja.\nSylva also announced the federal government’s approval of $1.484 billion for the rehabilitation of both Warri and Kaduna refineries.\nHis words: “This particular route is very important because after the Lagos-Kano route, this Lagos-Calabar coastal route, actually will link all the coastal cities in the country.\nSylva: Rehabilitation of Warri, Kaduna refineries to gulp $1.484bnMeanwhile, Sylva has announced the approval of $1.484 billion for the rehabilitation of Warri and Kaduna refineries.\nIn March, revenue rose to N224.589 billion, while they were N156.366 billion, N320.315 billion and N295, 396 billion respectively in April, May and June."
  },
  {
    "headline": "Breaking: Court Stops DSS from Arresting Igboho",
    "summarized_story": "By Kemi Olaitan in IbadanAn Ibadan High Court presided over by Justice Ladiran Akintola, Wednesday granted an order of interim injunction restraining the Departmen of State Services (DSS) and other security agencies from arresting, detaining, molesting or killing Yoruba Nation activist, Chief Sunday Adeyemo (aka Sunday Igboho).\nThe suit was filed by his counsel, Chief Yomi Aliyu, SAN.\nJustice Akintola while adjourning the case to August 18 for hearing of the originating motion, said the respondents must be served before the date.\nDetails later …Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BUSTED: How Enugu Council Vice-Chairman Hijacked, Shared 1000 Federal Government’s Job Slots To Cronies",
    "summarized_story": "The Vice Chairman, Udenu Local Government Area of Enugu State, Gideon ToChukwu, has been accused of hijacking 1,000 job slots of the Federal Government’s extended Special Public Works meant for the Igbo-Eze South Local Government in the state.\nSaharaReporters learnt that shortly after the take-off of the pilot scheme of the programme in April 2020, over 200 candidates that enrolled for the exercise in the Igbo-Eze South LGA were not people or residents of the communities.\nSome of the beneficiaries confirmed to SaharaReporters that they hailed from Udenu and they secured the forms through ToChukwu.\nSome of the candidates who completed and submitted their forms were shocked to see their names replaced with strange names.\nSome of the aggrieved candidates lamented the injustice and described it as daylight robbery and insult on their sensibility for the leadership of Udenu LGA to encroach into the Igbo-Eze South with impersonators."
  },
  {
    "headline": "BUSTED: How Enugu Council Vice-Chairman Hijacked, Shared 1000 Federal Government’s Job Slots To Cronies",
    "summarized_story": "The Vice Chairman, Udenu Local Government Area of Enugu State, Gideon ToChukwu, has been accused of hijacking 1,000 job slots of the Federal Government’s extended Special Public Works meant for the Igbo-Eze South Local Government in the state.\nSaharaReporters learnt that shortly after the take-off of the pilot scheme of the programme in April 2020, over 200 candidates that enrolled for the exercise in the Igbo-Eze South LGA were not people or residents of the communities.\nSome of the beneficiaries confirmed to SaharaReporters that they hailed from Udenu and they secured the forms through ToChukwu.\nSome of the candidates who completed and submitted their forms were shocked to see their names replaced with strange names.\nSome of the aggrieved candidates lamented the injustice and described it as daylight robbery and insult on their sensibility for the leadership of Udenu LGA to encroach into the Igbo-Eze South with impersonators."
  },
  {
    "headline": "BUSTED: How Enugu Council Vice-Chairman Hijacked, Shared 1000 Federal Government’s Job Slots To Cronies",
    "summarized_story": "The Vice Chairman, Udenu Local Government Area of Enugu State, Gideon ToChukwu, has been accused of hijacking 1,000 job slots of the Federal Government’s extended Special Public Works meant for the Igbo-Eze South Local Government in the state.\nSaharaReporters learnt that shortly after the take-off of the pilot scheme of the programme in April 2020, over 200 candidates that enrolled for the exercise in the Igbo-Eze South LGA were not people or residents of the communities.\nSome of the beneficiaries confirmed to SaharaReporters that they hailed from Udenu and they secured the forms through ToChukwu.\nSome of the candidates who completed and submitted their forms were shocked to see their names replaced with strange names.\nSome of the aggrieved candidates lamented the injustice and described it as daylight robbery and insult on their sensibility for the leadership of Udenu LGA to encroach into the Igbo-Eze South with impersonators."
  },
  {
    "headline": "BREAKING: PUMA To Sue Nigeria Over Breach Of Contract After Terminating Over N1Billion Deal With Country",
    "summarized_story": "German sportswear manufacturing giant, PUMA plans to sue the Athletics Federation of Nigeria (AFN) and the Federal Ministry of Youth and Sports.\nThe deal, signed by the Gusau-led AFN, was due to expire in 2022, Punch reports.\nIn the latest development, PUMA officials have got in touch with officials of Gusau-led AFN informing them of an intention to sue.\nIn the letter, the DSS stated, “This Service (DSS) has thoroughly investigated the matter regarding the Puma deal.\nThe under-listed findings were established:“Athletics Federation of Nigeria entered into a valid contract with Dynamic Sports Solution Nigeria Limited."
  },
  {
    "headline": "BREAKING: PUMA To Sue Nigeria Over Breach Of Contract After Terminating Over N1Billion Deal With Country",
    "summarized_story": "German sportswear manufacturing giant, PUMA plans to sue the Athletics Federation of Nigeria (AFN) and the Federal Ministry of Youth and Sports.\nThe deal, signed by the Gusau-led AFN, was due to expire in 2022, Punch reports.\nIn the latest development, PUMA officials have got in touch with officials of Gusau-led AFN informing them of an intention to sue.\nIn the letter, the DSS stated, “This Service (DSS) has thoroughly investigated the matter regarding the Puma deal.\nThe under-listed findings were established:“Athletics Federation of Nigeria entered into a valid contract with Dynamic Sports Solution Nigeria Limited."
  },
  {
    "headline": "Doctors’ strike: FG promises improved working conditions, but says ‘we can force states’",
    "summarized_story": "The federal government says it will ensure improved working conditions for doctors and other health workers across the country.\nNARD had declared an indefinite strike, which commenced on Monday, over “irregular payment of salaries”, among other issues.\nThe association had alleged that the federal government is yet to fulfill the demands contained in the agreement made with the doctors.\nHe, however, promised that the federal government will improve on efforts to ensure better welfare for doctors.\n“We are also working to make sure that working conditions in Nigeria are favourable."
  },
  {
    "headline": "Doctors’ strike: FG promises improved working conditions, but says ‘we can force states’",
    "summarized_story": "The federal government says it will ensure improved working conditions for doctors and other health workers across the country.\nNARD had declared an indefinite strike, which commenced on Monday, over “irregular payment of salaries”, among other issues.\nThe association had alleged that the federal government is yet to fulfill the demands contained in the agreement made with the doctors.\nHe, however, promised that the federal government will improve on efforts to ensure better welfare for doctors.\n“We are also working to make sure that working conditions in Nigeria are favourable."
  },
  {
    "headline": "Army: 18 more insurgents have surrendered in Borno -- over 100 in two weeks",
    "summarized_story": "The Nigerian Army says 18 more insurgents have surrendered to troops in Borno state.\nAdvertisementOnyema Nwachukwu, army spokesman, who disclosed this in a statement on Thursday, said the suspected insurgents surrendered with their family members.\nAccording to him, more than 100 insurgents have surrendered to the army within the past two weeks.\n“Recently, the terrorist groups have suffered enormous setback and recorded several casualties as a result of ferocious offensives by gallant troops of OPHK.\n“The Chief of Army Staff (COAS), Lt Gen Faruk Yahaya, has lauded the troops for their effort and charged them to remain dedicated and committed in the fight, until the terrorists are completely decimated.”"
  },
  {
    "headline": "Army: 18 more insurgents have surrendered in Borno -- over 100 in two weeks",
    "summarized_story": "The Nigerian Army says 18 more insurgents have surrendered to troops in Borno state.\nAdvertisementOnyema Nwachukwu, army spokesman, who disclosed this in a statement on Thursday, said the suspected insurgents surrendered with their family members.\nAccording to him, more than 100 insurgents have surrendered to the army within the past two weeks.\n“Recently, the terrorist groups have suffered enormous setback and recorded several casualties as a result of ferocious offensives by gallant troops of OPHK.\n“The Chief of Army Staff (COAS), Lt Gen Faruk Yahaya, has lauded the troops for their effort and charged them to remain dedicated and committed in the fight, until the terrorists are completely decimated.”"
  },
  {
    "headline": "Sultan asks governors to prepare for food shortage, says it may worsen insecurity",
    "summarized_story": "Muhammad Sa’ad Abubakar III, the Sultan of Sokoto, has asked governors to ensure there is adequate supply of food for underserved citizens as global food shortage looms.\nThe monarch said the non-availability of food will fuel insecurity in the country.\nIn May, the prices of major food items across the world rose to their highest level in 10 years.\nAdvertisementThe Food and Agriculture Organisation (FAO) had also said food prices are expected to rise in developed and least developed countries this year.\n“Let us not deceive ourselves that things are right; things are not right, we know it and we have seen so much in our lives,” he said."
  },
  {
    "headline": "Olumide Soyombo: The journey from startup founder to investment mogul",
    "summarized_story": "The early daysAt first, being a doctor was all Soyombo wanted to be until he was given a personal computer.\nAfter his first degree, Soyombo went on to get a master’s degree in business and information technology from Aston Business school.\nSo they created Leadpath as an investment vehicle to invest in startups, at first the approach was to invest $25,000 – $100,000 in local tech startups, similar to the Y-combinator accelerator model.\nThe bitter taste of how the founder handled the first company didn’t allow Soyombo to invest in the second company.\nWhen he thinks about the future, Soyombo is excited about the fact that the African tech ecosystem is maturing."
  },
  {
    "headline": "MTN finally repatriates 2020 dividend from Nigeria after forex crisis",
    "summarized_story": "South Africa’s MTN Group has repatriated its last year’s dividend of around $280 million (R4.2 billion) from its local unit in Nigeria.\nRespite in U.S. court caseIn addition to the news from Nigeria, MTN also revealed “positive developments” in a United States court case related to the group and its subsidiaries, MTN Afghanistan and MTN Dubai.\nIn Nigeria, MTN, through its local unit, has earmarked ₦600 billion ($1.5 billion) over the next three years to expand broadband access in Africa’s most populous economy.\nMobile subscribers decline in NigeriaFor MTN Nigeria, results for the past half-year showed that service revenue increased by 24.1% year-on-year, despite the number of its mobile subscribers declining by 7.6 million (nearly 10%).\nMTN Nigeria aims to sustain “double-digit service revenue growth ahead of inflation, driving 4G and rural network expansion,” Toriola said."
  },
  {
    "headline": "Can mobile applications help solve Africa's healthcare access problem?",
    "summarized_story": "Without discovering the mobile app, he could easily have been one of the more than 400,000 Africans malaria killed in 2019.\nZuri Health mobile app.\nArthur Ikechukwu Anoke and Daisy Isiaho, co-founders of the mobile app, Zuri Health.\nGovernmental policies will help hold digital healthcare companies accountable and protect the information and data of citizens that use the technologies.\nYet it’s fundamental if we should achieve the Sustainable Development Goals,” said Daisy Isiaho, Zuri Health Co-founder and Chief Product Officer."
  },
  {
    "headline": "Inconsistent policies are killing African startups",
    "summarized_story": "On 18 December, 2015 the CBK again issued Banking Circular No 14 of 2015, which cautioned, ‘all financial institutions against dealing in virtual currencies or transacting with entities that are engaged in virtual currencies.\nFinancial institutions are expressly advised not to open accounts for any person dealing in virtual currencies such as Bitcoin.\nDigital Tax policies in South Africa, Nigeria, Uganda and KenyaSouth Africa was the first, in 2014, to tax digital services by imposing a 14% value added tax (VAT) on digital imports.\nThis same proposal for digital tax was only shut down by the Benin Government after a peaceful protest was staged by its people.\nThis has not been the case however – digital tax policies and laws have mainly been used to restrict digital activity of citizens, infringing on their digital rights."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Joining the rank of one of the most valuable startups on the continent, South Africa-based fintech startup, Yoco, has..."
  },
  {
    "headline": "MVX, Nigerian digital freight startup, secures $1.3m to tackle ocean freight challenges in Africa",
    "summarized_story": "Share this article:On Thursday, July 5, 2021, Nigeria-based digital freight startup, MVX, announced a $1.3 million seed round to tackle the challenge of financing and booking freight operations in Africa.\nInvestors in this round include Kepple Africa Ventures, Launch Africa Ventures, Founders Factory and some angel investorsThis comes after the startup secured a $100,000 pre-seed investment from Oui Capital in 2019.\nPer TechCrunch, MVX wants to ease trade finance and freight shipping in Africa by making the process available online.\nThese services are now available on one platform — MVX.\nTrade Africa still has a long way to go."
  },
  {
    "headline": "Flutterwave to drive US expansion as it appoints Silicon Valley veteran as head of US growth",
    "summarized_story": "Share this article:African payments startup, Flutterwave, has announced the appointment of Jimmy Ku as the Head of US Growth.\nWith plans to offer payment services to US-based clients, local businesses, and companies, Ku’s appointment strengthens Flutterwave’s vision for the US market.\nFounded in 2016 by Olugbenga Agboola and Iyinoluwa Aboyeji, Flutterwave provides a payment infrastructure for merchants and payment services providers in Africa.\nThe fintech startup claims to simplify payments for limitless possibilities by making it easier for Africans to launch global businesses that can make and receive payments from anywhere in the world.\nRecall that Flutterwave partnered with PayPal, an American online payments system, to allow African merchants to receive payments from PayPal users across the globe."
  },
  {
    "headline": "Journey to the top, tech talents in Africa, and YouTube’s creator payment plan",
    "summarized_story": "Share this article:Hi there,Today I’m discussing:Rachel Akalia’s journeyAlida School and Africa’s tech talentsKoo: Nigeria’s new TwitterYouTube’s payment plan for creatorsPatricia Technologies’ Racheal AkaliaRachael Akalia, Brand Manager, Patricia TechnologiesRachael Akalia is currently Patricia Technologies’ brand manager.\nSource: SuppliedThe issue of small tech talent pools plagues Africa’s tech ecosystem.\nWith tech startups springing up on the continent, finding the right talents in Africa could become increasingly difficult.\nYouTube wants to start paying YouTube Shorts creators $10,000 monthly.\nWhat’s YouTube Shorts?"
  },
  {
    "headline": "Nigeria’s largest FMCGs see profits surge to five-year high",
    "summarized_story": "Nigeria’s largest Fast-Moving Consumer Goods (FMCGs) companies have seen their profits surge to a five-year high and above pre-pandemic levels in the first half of 2021, a sign that an economic recovery is on for Africa’s biggest economy.\nData compiled by BusinessDay show that Nestle Nigeria, Dangote Sugar, Flour Mills, Unilever Nigeria, and Nascon recorded…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "What repairs of Nigerian refineries mean for West African market",
    "summarized_story": "What repairs of Nigerian refineries mean for West African marketAfrica’s biggest oil-producing country is planning to take advantage of a golden opportunity to play regional dominance in the West African refining market following the move by the Federal Executive Council to approve contracts for the rehabilitation of Warri and Kaduna refineries at a cost of $1.4 billion.\nNigeria stands a good chance of benefiting…"
  },
  {
    "headline": "Nigeria’s telcos’ investment declines 55.7% in one year",
    "summarized_story": "Nigeria’s telecom industry in 2019 attracted investment worth over $942.86 million.\nHowever, in 2020, it recorded a decline of 55.7 percent as the industry only attracted investment worth about $417.48 million for the period under review.\nThis was disclosed by the Nigerian Communications Commission (NCC) via its 2020 subscriber/network data report.\nThe report indicates, “Capital Inflow…Don’t miss another story Become a BusinessDay Subscriber today.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Obaseki to engage, train 10,000 local security personnel to combat crime, boost security in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said his government plans to recruit and train over 10, 000 local security personnel in the state to complement the efforts of the federal security agents in tackling insecurity across the state.\nObaseki disclosed this during an inspection of the Police Training Facility at Ogida Police Barracks in Benin City, Edo State.\nAccording to him, “We are collaborating with the Nigerian Police Force to improve the training facilities at the Ogida Police Barrack Training School.\n“The purpose of this collaboration is to train members of our vigilante group with modern policing and intelligence gathering skills.\nAlso, the constabulary corps and our Public Work Volunteer (PUWOV) will be trained at the facility."
  },
  {
    "headline": "Edo govt begins electrification of Orhionmwon, Uhunmwonde communities, installs transformers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government through the Edo State Oil and Gas Producing Areas Development Commission (EDSOGPADEC) has commenced Rural Electrification of Abudu and other communities in Orhionmwon Local Government Area, as well as some communities in Uhunmwonde LGA.\nThe government also installed 2.5MV/3311VA transformers in the communities to boost power supply.\nThe benefitting communities include Abudu Oza – Evbuobanosa Oghada, Itu, Ofien, Idudolor, Ugbeze, Evbuohen, Ago-Ogbeide, Uvbe, Isua Evbosawe, Igbogiri Ugomoson, Ugboayon, Ugoneki, among others.\nInspecting the Installation of the transformers, the Chairman of EDSOGPADEC, Pastor Kennedy Osifo, thanked Governor Godwin Obaseki for giving approval for the people.\nwhile appreciating Governor Obaseki said that Abudu has benefitted immensely from the present administration in the State since 2016 till date."
  },
  {
    "headline": "Obaseki grants tax credit to Saro Group, urges more firms, investors to embrace scheme – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Tuesday, granted tax credit to Saro Group of Companies, as part of efforts by the government to fast-track development across the state.\nObaseki said, “Executive Order number 1 of 2021 is the legal basis and framework on which this scheme was designed.\nWe encourage them to utilize the tax credit in the area they are making money rather than taking it somewhere else.\n“We want to encourage more Investors to invest in Edo State as the government has put all measures on ground to protect investors coming into the state, as we would not allow those that want to discourage investors in the state.\n“Today is historic because the state is doing something that has not been done before except by the federal government."
  },
  {
    "headline": "Alleged High-handedness: NBA Benin Branch Boycott Court – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- Arising from her alleged highhandedness, disrespectful and insubordination, members of the Nigerian Bar Association (NBA), Benin Branch, have commenced indefinite boycotting of Edo State High Court 6, Benin City, Presided over by Honourable Justice Helen Adesuwa Courage-Ogbebor.\nThis was contained in a statement signed by the Branch’s chairman, Pius Oiwoh and secretary Andrew Lawani and made available to newsmen in the state capital recently.\nThe statement informed that the decision to boycott Justice Courage Ogbebor’s Court was taken on Monday evening at the monthly meeting of the Benin NBA, held at the Bar House Complex, Benin City.\nThis development brings to the second time the NBA Benin branch is boycotting Court in Benin City.\nIt will be recall that NBA Benin earlier boycotted Honourable Justice Oni-Okpako’s Court over alleged humiliation melted on a counsel."
  },
  {
    "headline": "Why we intervened in PDP leadership crisis – BoT Chairman",
    "summarized_story": "The Peoples Democratic Party (PDP) Board of Trustees (BoT) met on Thursday to resolve the leadership and other internal crises rocking the party.\n“We must sit with the national chairman and the NWC, to come out with decisions that will make our party strongest.\nIn his remarks, the PDP National Chairman, Uche Secondus, said the meeting was critical, not only for members of the NWC, but the entire PDP.\n“I believe that in every human endeavour where there are issues, the issues must be tabled, discussed and solutions proffered.\nThe News Agency of Nigeria (NAN) reports that the meeting had Governor Nyesom Wike of Rivers, PDP National Secretary, Umar Tsauri, Deputy National Chairman, North, Suleiman Nazif and immediate past president of the senate, Bukola Saraki, in attendance."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Lagos Assembly cuts Tinubu, Fashola, other ex-governors’ pensions by 50%",
    "summarized_story": "The Lagos State House of Assembly has approved the reduction of former governors of the state by 50 per cent.\nThe committee also removed the provision of houses in Abuja and Lagos for ex-governors as stipulated in an earlier law operated by the state.\nThe report further showed a reduction in the number of vehicles to be made available to former governors and their deputies.\nThe Speaker of the House, Mudashiru Obasa, suggested that former governors should get two vehicles (a car and a van) instead of three as recommended by the committee.\nHe also suggested that the amended bill should provide that the cars be changed every four years instead."
  },
  {
    "headline": "Wike leaves with long face as PDP drafts governors, ex-ministers to resolve internal crisis",
    "summarized_story": "Mark said the committee, which is expected to meet within the next 72 hours, will include governors, members of the BoT, members of the national assembly, members of the national working committee (NWC), former governors, and former ministers of the party.\n“We resolved in the meeting to set up a committee to look at the situation.\nIn his remarks after the meeting, former senate president, Abubakar Bukola Saraki, expressed confidence that the crisis would be resolved as soon as the committee meets.\nWe all came together and we have agreed to set up this committee.\nWe know the importance of this party to the nation in addressing the challenges ahead of us.”"
  },
  {
    "headline": "Osun 2022: Olabode Divine rallies support for Oyetola’s second term",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe erstwhile chairmanship aspirant for Odo-Otin North LCDA, Osun state, Hon.\nOluwatobi Olabode on Wednesday declared support for governor Adegboyega Oyetola’s second term bid, just as he dissociated himself from a splinter group within All progressives Congress, The Osun Progressives.\nAccording to him, what should be paramount in the heart of all progressives in the state is how Governor Oyetola would triumph in the 2022 governorship election.\nOlabode said, “We’re here to declare our support for the second term aspiration of Governor Oyetola.\nHe described Olabode as a man of the people, who believes in the progressive ideas spearheaded by Governor Oyetola."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "16 Killed In Cameroon Traffic Accident",
    "summarized_story": "At least 16 people have been killed on Thursday morning in an accident on a highway in Awae, a locality of Cameroon’s Central region.\nThe police gave the confirmation of the deaths and said the accident occurred when a 70-seater passenger bus collided with a truck loaded with logs on the Yaounde-Bertoua highway.\nWitnesses told Xinhua that children and women were among the dead.\nADVERTISEMENTAt least 30 people who were injured in the accident were rushed to a local hospital, local authorities said.\n(Xinhua/NAN)"
  },
  {
    "headline": "16 Killed In Cameroon Traffic Accident",
    "summarized_story": "At least 16 people have been killed on Thursday morning in an accident on a highway in Awae, a locality of Cameroon’s Central region.\nThe police gave the confirmation of the deaths and said the accident occurred when a 70-seater passenger bus collided with a truck loaded with logs on the Yaounde-Bertoua highway.\nWitnesses told Xinhua that children and women were among the dead.\nADVERTISEMENTAt least 30 people who were injured in the accident were rushed to a local hospital, local authorities said.\n(Xinhua/NAN)"
  },
  {
    "headline": "Surprise As Wike Attends PDP BoT Meeting",
    "summarized_story": "Rivers State governor, Barrister Nyesom Wike, made an unexpected entrance into the venue of the ongoing meeting of the Board of Trustees (BoT) of the Peoples Democratic Party (PDP) on Thursday at the party national headquarters in Abuja.\nThe governor has been at loggerheads with PDP national chairman, Prince Uche Secondus.\nIt was, however, learnt that he was invited to the meeting over the leadership tussle rocking the opposition party.\nThe BoT had called the meeting as part of efforts to manage the crisis ahead of the national elective convention slated for December.\nPresent at meeting are BoT chairman, Senator Walid Jibrin, immediate past Senate President, Dr. Bukola Saraki, former Foreign Affairs Minister, Chief Tom Ikimi, former Minister of Special Duties and Intergovernmental Affairs, Tanimu Turaki, ex-Osun state governor, Prince Olagunsoye Oyinlola, amongst others."
  },
  {
    "headline": "Surprise As Wike Attends PDP BoT Meeting",
    "summarized_story": "Rivers State governor, Barrister Nyesom Wike, made an unexpected entrance into the venue of the ongoing meeting of the Board of Trustees (BoT) of the Peoples Democratic Party (PDP) on Thursday at the party national headquarters in Abuja.\nThe governor has been at loggerheads with PDP national chairman, Prince Uche Secondus.\nIt was, however, learnt that he was invited to the meeting over the leadership tussle rocking the opposition party.\nThe BoT had called the meeting as part of efforts to manage the crisis ahead of the national elective convention slated for December.\nPresent at meeting are BoT chairman, Senator Walid Jibrin, immediate past Senate President, Dr. Bukola Saraki, former Foreign Affairs Minister, Chief Tom Ikimi, former Minister of Special Duties and Intergovernmental Affairs, Tanimu Turaki, ex-Osun state governor, Prince Olagunsoye Oyinlola, amongst others."
  },
  {
    "headline": "Supreme Court Affirmed Legality Of Buni-led Caretaker C’ttee, Says APC",
    "summarized_story": "Recall there were calls for the dissolution of the caretaker committee following the Supreme Court judgement on the election of Governor Rotimi Akeredolu of Ondo State.\nThe party, it was gathered late Wednesday night, obtained a certified true copy of the judgement of the apex court.\n“That there is no provision in the Electoral Act prescribing any form for forwarding or submission of the sponsored candidate of a political party in an election.\nSections 177 and 182 of the 1999 Constitution which make provisions for qualifications and disqualification of candidates for governorship election are exhaustive and leave no room for any addition.\n“That no other law/act can be relied upon to disqualify a candidate in an election save for the provisions of Section 182 of the 1999 Constitution."
  },
  {
    "headline": "Panic as bandits kidnap father of Zamfara Speaker, seven others",
    "summarized_story": "Panic as bandits kidnap father of Zamfara Speaker, seven othersPanic as bandits kidnap father of Zamfara Speaker, seven othersEight persons have been abducted by gunmen suspected to bandits in Magarya village in the Zurmi Local Government Area of Zamfara State.\nAmong them is the biological father of the Speaker Zamfara state House of Assembly, Nasiru Mu’azu Magarya, according to multiple media platforms including TVC and Daily Trust.\nThey were abducted Wednesday night when the heavily armed men invaded the communitySpokesperson of the Zamfara State Police Command Superintendent Shehu Mohammed reportedly confirmed the incident.\nHe said the command has deployed additional troops to the affected area to ensure the safe return of the victims.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Panic as bandits kidnap father of Zamfara Speaker, seven others",
    "summarized_story": "Panic as bandits kidnap father of Zamfara Speaker, seven othersPanic as bandits kidnap father of Zamfara Speaker, seven othersEight persons have been abducted by gunmen suspected to bandits in Magarya village in the Zurmi Local Government Area of Zamfara State.\nAmong them is the biological father of the Speaker Zamfara state House of Assembly, Nasiru Mu’azu Magarya, according to multiple media platforms including TVC and Daily Trust.\nThey were abducted Wednesday night when the heavily armed men invaded the communitySpokesperson of the Zamfara State Police Command Superintendent Shehu Mohammed reportedly confirmed the incident.\nHe said the command has deployed additional troops to the affected area to ensure the safe return of the victims.\nPunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Two Internet Fraudsters Bag Jail Terms In Oyo",
    "summarized_story": "By JUMOKE SANNIThe Economic and Financial Crimes Commission, EFCC, Ibadan Command, on Wednesday August 4, 2021 secured the conviction of two fraudsters, Adisa Adebayo Adegboyega and Ganiyu Sodiq Olalekan before Justice Iyabo Yerima of the Oyo State High Court sitting in Ibadan for internet-related fraud.\nAdisa, 23, who claimed to be an Ordinary National Diploma (OND) holder from Oke Ogun Polytechnic Saki, Oyo state, was sentenced to six months community service; while Ganiyu,18 year-old artisan, bagged three months community service.\nThe offense is contrary to Section 419 of the Criminal Code, Cap.C38, Laws of Oyo State of Nigeria, 2000charges.\nGaniyu was ordered to restitute the sum of $250USD (Two Hundred and Fifty United States Dollars) to his victim; David Govann through the EFCC and forfeits an Iphone 6x mobile phone to the Federal Government of Nigeria.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Two Internet Fraudsters Bag Jail Terms In Oyo",
    "summarized_story": "By JUMOKE SANNIThe Economic and Financial Crimes Commission, EFCC, Ibadan Command, on Wednesday August 4, 2021 secured the conviction of two fraudsters, Adisa Adebayo Adegboyega and Ganiyu Sodiq Olalekan before Justice Iyabo Yerima of the Oyo State High Court sitting in Ibadan for internet-related fraud.\nAdisa, 23, who claimed to be an Ordinary National Diploma (OND) holder from Oke Ogun Polytechnic Saki, Oyo state, was sentenced to six months community service; while Ganiyu,18 year-old artisan, bagged three months community service.\nThe offense is contrary to Section 419 of the Criminal Code, Cap.C38, Laws of Oyo State of Nigeria, 2000charges.\nGaniyu was ordered to restitute the sum of $250USD (Two Hundred and Fifty United States Dollars) to his victim; David Govann through the EFCC and forfeits an Iphone 6x mobile phone to the Federal Government of Nigeria.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Breaking: Aminu Yar'Adua, late President Umaru Yar'Adua's son sent to Yola prison",
    "summarized_story": "By Muhammad Adam/YolaA Magistrate’s Court in Yola on Thursday remanded Aminu Yar’Adua, the son of late former President Umaru Yar’Adua, in prison for allegedly killing four people in an auto crash in Yola.\nYar’Adua, a 36 year-old student of the American University of Nigeria (AUN) Yola, was charged to court for allegedly causing death by dangerous driving on 23 June 2021.\nThe prosecuting officer told the court that the relatives of late Aisha Umar, Suleiman Abubakar and Jummai Abubakar had demanded the sum of N15 million from the defendant as compensation.\nHe then ordered that Aminu Yar’Adua be remanded in prison custody until then.\nThe prompt intervention of policemen at the scene of the accident, saved Yar’adua, said to be an off-campus student of American University of Nigeria (AUN)."
  },
  {
    "headline": "Why I chose to be a DJ",
    "summarized_story": "Nigerian disc jockey Nonso Temisan Ajufo popularly known as DJ Big N has revealed that he forfeited an 8-figure job to be a DJ.\nThe Mavin Records in-house DJ made this known while answering questions from fans via his Instagram page on Thursday, August 5, 2021.\nI chose to go this route.\nHe has released several Mavin-themed mixtapes, including the “Mavin All Stars” mixtape, the ‘Surulere Mixtape Volume 1’, and the “ENERGY Mixtape”, among others.\nHe holds a first degree in Psychology from the University of Lagos and an MBA from Coventry University in England."
  },
  {
    "headline": "18 More Boko Haram Terrorists Surrender In Borno — Nigerian Army",
    "summarized_story": "In Borno state, the Nigerian Army says 18 additional terrorists have surrendered to troops.\nThe suspected terrorists surrendered alongside their family members, according to army spokesman Onyema Nwachukwu, who announced this in a statement on Thursday.\nMore than 100 insurgents have surrendered to the army in the last two weeks, he said.\n“More Boko Haram (BHT)/Islamic State West African Province (ISWAP) terrorists are surrendering as troops of Operations Hadin Kai (OPHK), conducting counter terrorism and counter insurgency operations in north east Nigeria escalate ground and air offensive operations against the terrorists,” the statement reads.\n“Recently, the terrorist groups have suffered enormous setback and recorded several casualties as a result of ferocious offensives by gallant troops of OPHK."
  },
  {
    "headline": "Uche Secondus: Details Of What PDP BoT Discussed Emerges",
    "summarized_story": "The Board of Trustees (BoT) of the Peoples Democratic Party (PDP) has disclosed measures put in place to address the internal crisis rocking the party.\nThe representatives of the BoT spoke to newsmen in Abuja on Thursday after the crucial meeting held behind closed doors by the party leaders.\nThe meeting was summoned in the wake of defections from the party as well as the recent leadership crisis touching on the National Chairman position occupied by Prince Uche Secondus.\nAtiku spoke against the backdrop of the recent crisis rocking the party, particularly, the calls for the removal of Prince Uche Secondus as the national chairman of the party.\nHe said the PDP must not allow the dreams of the ruling All Progressives Congress (APC) to have a one-party state to come to fulfillment."
  },
  {
    "headline": "BREAKING: Zulum Orders Investigation As BOGIS Task Force Demolish EYN Church In Borno",
    "summarized_story": "Professor Babagana Umara Zulum, the governor of Borno, has ordered the Borno police command to examine a violent collision between a joint security task force working with the Borno Geographical Information System and several congregants at an EYN Church branch in Maduganari, Maiduguri.\nDuring an encounter on Thursday, the Governor strongly denounced the discharge of firearms by a member of the security task force, as well as some individuals who threw stones at the task force.\nZulum expressed his condolences to the families of those who had died and those who had been injured.\nZulum has also called the CAN leadership to a meeting at Government House in Maiduguri today at 5:30 p.m.\nOn Thursday, authorities from BOGIS and a joint security task force went to church to discuss land administration and urban development measures, some of which have impacted worship centers (mosques and churches) that were established without following the rules."
  },
  {
    "headline": "One Killed, Many Injured As BOGIS Officials, Civilian JTF Evict Worshippers At Local Church In Borno",
    "summarized_story": "A young boy named Ezekiel, 27, has been killed while five others have sustained several gunshot injuries when the Borno Geographic Information Service (BOGIS) destroyed a church located at Moduganari area of Maiduguri, Borno state.\nBOGIS is a state-run body founded by Governor Babagana Umara Zulum’s current administration and responsible with managing land issues in the state.\nSources said the demolished church is a local church branch of the EYN Maduganari covered with canopies.\n“Canopies were used to cover the site for worshippers, the local church council at Maduganari decided to erect a building to replace the canopies.\nMeanwhile, the Police Public Relations Officer, PPRO Borno State Police Command, SP Edet Okon when contacted said, the command was not aware of the development as they were yet to be briefed on the matter."
  },
  {
    "headline": "Breaking: At last, Lionel Messi quits Barcelona",
    "summarized_story": "Legend Lionel Messi has finally quit his childhood club Barcelona.\nThis was confirmed in a statement by the club on Thursday evening.\nFaced with this situation, Lionel Messi will not continue to be linked to Barcelona.\nThe two parties deeply regret that the wishes of both the player and the Club cannot finally be fulfilled.\nBarça wants to thank with all the heart the player’s contribution to the aggrandizement of the institution and wishes him the best in his personal and professional life”."
  },
  {
    "headline": "Breaking: Lagos lawmakers cut down Tinubu, other ex-governors’ pension benefits",
    "summarized_story": "The Lagos State House of Assembly on Thursday approved the report of its committee on establishment which recommended the reduction of pensions to former governors and other affected officials by 50 percent.\nThe committee also expunged the provision of houses in Abuja and Lagos for former governors as stipulated in an earlier law operated by the state.\nThe report further showed a reduction in the number of vehicles to be made available to former governors and their deputies.\n(Dr) Mudashiru Obasa, suggested that former governors should get two vehicles (a car and a van) instead of three as recommended by the committee.\nHowever, Obasa argued that it should be left at 50 percent, especially as the report had recommended the removal of houses and reduced other benefits."
  },
  {
    "headline": "Breaking: Dominic Oneya, ex-NFF President is dead",
    "summarized_story": "The death of Oneya was disclosed by Abubakar Aminu Ibrahim, Senior Special Assistant (SSA) to the Kano state governor on social media.\nOneya, who was the military Governor of Kano State during the military regime of General Sani Abacha.\nOneya was military Governor of Kano from August 1996 to August 1998 during the military regime of General Abacha.\nOneya was Governor of Kano State when the present Governor HE Dr. Abdullahi Umar Ganduje was Commissioner of Works and Senator Malam Ibrahim Shekarau was Permanent Secretary (AGS) at that time.\nHe attended the Command and Staff College, Jaji, Kaduna (1983–1984) and the Canadian Land Force Command and Staff College, Kingston, Ontario, Canada (1987–1988)."
  },
  {
    "headline": "National Unity: Ganduje urges secession agitators to embrace dialogue -NigPilot",
    "summarized_story": "Kano state governor, Dr. Abdullahi Umar Ganduje, has urged secession agitators in the country to embrace dialogue as an option in the interest of national unity, adding thatThe Kano State governor also warned that the continent of Africa will lose its respect in the committee of nations in the world if Nigeria ceases to exist as a Nation.\nThe Kano governor said the advocates of secession should have a change of heart and recommended dialogue as a crucial option for addressing their problems.\nAnd that demand is even louder and the debate is on and no one is troubling agitators for agitating for restructuring of the federation.\nThere should be no secession distraction at this time.”According to Ganduje, there is a National Assembly where some of the grievances can be addressed.\n“Similarly, what do we do with the likes of Rochas Okorocha, former Imo state governor and now Senator representing Imo West Senatorial District in the South East."
  },
  {
    "headline": "SSCE: Echono bemoans deplorable state of exam facilities -NigPilot",
    "summarized_story": "As students sit for the Senior School Certificate Examination of the National Examination Council, NECO, nationwide, the Permanent Secretary, Federal Ministry of Education, Arc.\nSonny Echono has expressed dissatisfaction over the poor examination facilities in most Nigerian Schools.\nSpeaking on the security situation of schools, Echono said the Nigerian government has put all the necessary security measures to ensure that schools are safe.\nHe said the report of the Sub Committee on the provision of security for schools will soon be submitted.\nEchono also revealed that the government is involving Police and vigilante groups to ensure schools are safe."
  },
  {
    "headline": "Photo Op of FEC meeting, yesterday -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "APC govs laud Supreme court judgement legalizing Buni caretaker committee -NigPilot",
    "summarized_story": "Governors of the ruling All Progressives Congress, APC, have welcomed the Supreme court written judgment that has put paid to speculations about the legality of the governor Mai Mala Buni-led national caretaker of the party.\nAccording to the governors, the early release of the written judgement had availed the public with the judgement of the court, which settled issues conclusively.\nParts of the statement reads, “We thank the Supreme Court for this landmark judgement, which among others have dealt conclusively with legality of the APC Caretaker and Extraordinary Convention Planning Committee, its composition and all its decisions.\nAccording to the Supreme Court “by not appealing against this holding, the parties herein accept it as correct, conclusive and binding upon them.”“The judgement has also settled the legality of the National Caretaker and Extraordinary Convention Planning Committee.\nThe court has correctly ruled that in line with section 13.3 of the APC Constitution, the National Caretaker and Extraordinary Convention Planning Committee was constituted by the National Executive Council of the APC to act as the National Working Committee."
  },
  {
    "headline": "FG Not The Best Manager Of Refineries – Petroleum Minister",
    "summarized_story": "By Akinola AjibolaThe Federal Government has admitted that it is not in the best position to manage the nation’s refineries.\nMinister of State for Petroleum Resources, Timipre Sylva, stated this during his appearance on Thursday’s edition of Politics Today.\nDespite the submission, the minister believes it will not be out of place if the government gets the refineries working before taking appropriate decisions.\n“We want to sell live refineries; refineries that are working and I think that is the fairest thing for the government to do and that is why we have decided to get all our refineries working.\n“We want to prove to you that we can get these refineries working,” he said."
  },
  {
    "headline": "End Of An Era: Barcelona Announce Lionel Messi’s Departure",
    "summarized_story": "Argentine superstar Lionel Messi will not sign a new deal with Barcelona, ending his two-decade stay at the Nou Camp, the Spanish giants have said.\n“As a result of this situation, Messi shall not be staying on at FC Barcelona.\nMessi played 778 games for Barcelona and scored 672 goals.\nBut earlier in the day, reports emerged of a breakdown in talks between the club and the player’s representatives.\nThe 2008 Olympic gold medalist was expected to take a huge pay cut to stay at Barcelona under the new salary cap imposed by La Liga."
  },
  {
    "headline": "WHO Gifts Nigeria 26 Ventilators, Other Items To Fight COVID-19",
    "summarized_story": "﻿The fight against COVID-19 in Nigeria has received a boost, as the country received 26 ventilators and other equipment from the World Health Organisation.\nMinister of Health Dr Osagie Ehanire received the donated items on behalf of the Federal Government on Thursday in Abuja.\nNigeria recorded 747 COVID-19 infections in 13 states and the Federal Capital Territory (FCT) on Wednesday.\nThe country has received donations from some global bodies and countries in its fight against the pandemic – from vaccines to ventilators.\nDr Ehanire promised that the Federal Government would keep an inventory of the ventilators and assured Nigerians that the items donated will be properly utilised."
  },
  {
    "headline": "FG Asks Resident Doctors To Resume Work, Says States Are Responsible For Most Of Their Demands",
    "summarized_story": "The Federal Government has asked striking resident doctors to resume work as most of the issues they have raised are state affairs.\nConsequently, he expects the resident doctors to resume work on Friday and take up these issues with the state governments rather than embark on the nationwide strike as they had done.\nResident doctors cannot hold the Federal Government to ransom on issues related to states governments, he said.\nREAD ALSO: Resident Doctors To Begin Nationwide Strike On MondayAs far as the minister is concerned, resident doctors employed by the Federal Government had no basis for joining the strike in the first case.\nThe resident doctors had gone on strike earlier this year, suspending the action after 10 days on April 10."
  },
  {
    "headline": "No Set Date For Removal Of Subsidy – Petroleum Ministry",
    "summarized_story": "The Minister of State for Petroleum, Timipre Sylva, has said that there is currently no set date for petrol subsidy removal.\nMr Sylva said this on Thursday, adding that the government is being considerate of citizens.\nBut the Vice President is actually leading the efforts and very soon, we will tell Nigerians what date the removal of subsidy will kick in,” said the minister who was a guest on Channels Television’s Politics Today.\nHe said the government is also making efforts to put structures in place to cushion the effect of the eventual subsidy removal.\nSo, what we are saying is that before doing this, we need to put some structures in place so that the impact on the people can be minimized."
  },
  {
    "headline": "Lionel Messi to leave Barcelona after club fail to fulfil new contract agreement",
    "summarized_story": "Barcelona Football Club has said Argentina forward, Lionel Messi will leave the club this Summer.\nThe decision was reached after the La Liga club were unable to fulfil a new contract that had been agreed with the player due to “financial and structural obstacles”.\nThe six-time Ballon d’Or winner has officially been a free agent since July 1 after he failed to agree terms over a renewal before his previous Barcelona contract expired on June 30.\nHowever, the 34-year-old had been expected to sign a new five-year contract with the Catalan club, which would have seen his salary reduced by 50 per cent.\nAdvertisement— FC Barcelona (@FCBarcelona) August 5, 2021A club statement said: “Despite FC Barcelona and Lionel Messi having reached an agreement and the clear intention of both parties to sign a new contract today, this cannot happen because of financial and structural obstacles (Spanish Liga regulations)."
  },
  {
    "headline": "Zamfara Assembly condemns kidnap of Speaker’s father, Step Mother, Others",
    "summarized_story": "The Zamfara State House of Assembly has described as unfortunate and callous the kidnap of the father, step mother and six other family members of the speaker of the Zamfara state Assembly, Nasiru Mu’azu Magarya.\nThey were abducted Wednesday evening when gunmen numbering over hundred attacked the palace of the village head of Magarya in Zurmi local government areaMu’azu Abubakar father of the speaker is the village Head of the communityA statement signed by the Spokesperson of the Zamfara state House of Assembly Mustapha Kaura said the Bandits invaded the chiefs palace Wednesday evening.\nHe added that the bandits stormed the community between five and six o’clock in the evening.\nAdvertisement“The ugly incident happened around five to six o’clock Wednesdays evening, the locals noticed the terrorist numbering a hundred carrying sophisticated firearms and surrounded the Palace of the District Head firing sporadically on the air”” They later gained access into the Palace and whisked the traditional ruler away along side his wife and six others that are with him in the Palace”Mustapha Kaura said no live was lost in the incident, but the entire House was damaged in the course of gaining entrance into the PalaceThe locals were highly terrified by the incident that forced them to flee for safety which also pave way for the terrorists to have a field day.\nThis is the third time in the three months bandits are attacking the area unleashing mayhem on the locals, killing innocent citizens, burning foodstuffs and carted away unspecified number of cattle."
  },
  {
    "headline": "BREAKING: Ondo PDP Reps candidate slumps, dies",
    "summarized_story": "The 2019 candidate of the People’s Democratic Party, PDP for the House of Representatives election in Akoko Northeast/Northwest federal constituency of Ondo State, Olawale Ogunleye is dead.\nHe reportedly attended a social event in Ikare Akoko area of the state and later slumped at his lkare residence over the night.\nIt was gathered from a family member that he was thereafter rushed to a private hospital in Ikare where he died.\nThe PDP in a statement to mourn him described him as “one of the pillars of the Peoples Democratic Party, (PDP) in Akoko North East.\nHe said p till yesterday evening the late Pdp chieftain was full of life and gave no sign of any ailment."
  },
  {
    "headline": "Radical Turnaround in Messi Case: Renewal is Almost Impossible",
    "summarized_story": "There has been a radical turnaround in the case of Lionel Messi’s renewal with Barcelona, with recent information being that the deal was close to being announced, yet a blockbuster revelation has suggested that Barcelona will now not be able to re-sign the Argentine.\nJoan Laporta is aware of the situation and the fact that Messi is further from renewing with the Catalan club from every before.\nThe reality is that several levels of the club are aware of the situation and are exploring how best to communicate the result of conversations held on Thursday.\nAs soon as this decision is officially made, Barcelona’s outlook changes radically with the urgency to reduce their salary bill somewhat lower.\nBeing able to plan for the 2022/23 season becomes child-play compared to dealing with the fallout of potentially losing Messi, especially after Laporta essentially ran for election on a platform of keeping the club icon in Barcelona."
  },
  {
    "headline": "Trending: Biden Calls On Cuomo To Resign Over Sexual Harassment",
    "summarized_story": "US President Joe Biden has called on New York Governor Andrew Cuomo to resign, following an explosive official report that said Cuomo sexually harassed 11 women.\nMeanwhile, the Nigerian Governor’s Forum led by Ekiti Governor, Kayode Fayemi, said the reason for the drop in performance of governors is as a result of shortfall in allocation from the federation account."
  },
  {
    "headline": "US Consul General Hosts Conversation on Nigerian Press Freedom in Lagos",
    "summarized_story": "Nigeria’s press freedom ranking has long been a cause for concern.\nAnd there are fears it could get worse.\nAt the US Consul General resident in Lagos, a conversation on Press Freedom, Freedom of Expression and Civic Space in Nigeria was met with opposing views on who is to blame and what needs to be done to improve it.\nARISE Correspondent Adefemi Akinsanya was at the event where she sent this report…"
  },
  {
    "headline": "Nigeria Customs Seizes Illegal Wildlife Products Worth $53m",
    "summarized_story": "Through a joint operation with the Wildlife Justice Commission, the Nigeria Customs Service on Wednesday 28 July, intercepted 196 sacks of illegal wildlife products worth over N22 billion (about $53 million)!\nin Lagos State.\nThe official statement released after the briefing confirmed that this included 7,137kg of pangolin scales, 4.6kg of pangolin claws and 846.34kg of ivory.\nAddressing the press on Wednesday August 4, the Comptroller General of Customs, Colonel Hammed Ibrahim Ali (Rtd), called for nationalism and patriotism in tackling the illegal wildlife trade.\nARISE Correspondent, Laila Johnson-Salami, attended the briefing and sends this report."
  },
  {
    "headline": "PDP Scribe Ologbodiyan on Party’s Crisis and President Buhari’s ‘Arm Twisting Tactics’ To Woo Opposition Governors – Arise News",
    "summarized_story": "The crisis that is rocking Nigeria’s opposition People’s Democratic Party (PDP) is normal as can be seen in every family, Kola Ologbodiyan, the National Publicity Secretary of the party has said.\nMr Ologbodiyan stated this on Thursday when he featured on an ARISE News programme, The Morning Show.\nHe said that a number of the deputy national officers of the party who recently tendered their resignation are rethinking their position and will be returning soon.\nThe party scribe also told ARISE News that the PDP is confident of victory against Zamfara State Governor Bello Metawalle and the state’s federal lawmakers over their defection to the ruling All Progressives Congress (APC).\nMr Ologbodiyan also spoke on how Nigerian President Muhammadu Buhari uses the anti-corruption agency EFCC to harass governors of the PDP."
  }
]