[
  {
    "headline": "Why no right-thinking Nigerian'll support Igbo presidential candidate",
    "summarized_story": "A former Special Assistant to the President, Major General Muhammadu Buhari (retd), on Assembly Matters, Abdurrahman Sumaila, says right-thinking Nigerians won’t endanger their lives to support the candidature of any South-East politician vying for presidency in 2023.\nREAD ALSO: We know those behind killings but haven’t labelled them terrorists – KukahSumaila made this known in a statement he issued to newsmen in Kano on Thursday.\n“With these atrocities committed by the South-East people on record, how can Nigerians entrust them to govern us?\nI am sure not a single right-thinking Nigerian will endanger his life to support the candidature of any South-East politician contesting for presidency come 2023 general elections,” he said.\nHe, therefore, urged elders in the South-East to publicly denounce the ongoing attacks by suspected members of the Indigenous People of Biafra or be considered complicit in the dastardly act."
  },
  {
    "headline": "We’ll join Tompolo to crumble Nigeria’s economy—NDVGG",
    "summarized_story": "Adeyinka Adedipe, BeninA group known as Niger Delta Volunteers for Good Governance has vowed to join forces with ex-militant leader in the oil-rich region, Government Ekpemupolo, aka Tompolo, to crumble the nation’s economy should the government fail to accede to the demand of the region.\nTompolo, it would be recalled, had last Sunday, issued a seven-day ultimatum to the Federal Government to inaugurate a substantive Board for the NDDC, vowing that failure to do so, would lead to the nation’s economy, particularly in the Niger Delta, being crumbled.\n“We have vowed to shut down all facilities which will crumble the economy of the nation unless the Federal Government does the needful by correcting the injustice meted on the people of the Niger Delta.\n“We are demanding that a substantive board for the NDDC be inaugurated immediately else, the government will see our other side.\nImmediately after the seven-day ultimatum elapses, we are going to strike,” he stressed."
  },
  {
    "headline": "Banditry, terrorism war’ll be won by armed forces cooperation -Yahaya",
    "summarized_story": "The new Chief of Army Staff, Major General Farouk Yahaya, on Wednesday said the war against banditry and terrorism cannot be won alone except with the cooperation of other arms of the Armed Forces of Nigeria.\nHe added that the earlier this is recognised, the better for the armed forces and the nation to surmount the current security challenges.\nHe was also quoted as saying that NAF was crucial to the success of the ongoing fight against insurgency, armed banditry and other forms of criminality in the country.\n“Major General Yahaya went on to state that the war against insurgency and armed banditry cannot be won by a single service but rather, through a synergistic approach where all services work in unison.\n“The earlier we all recognise that no service can do it alone, the better for us as armed forces and a nation to surmount the current security challenges.”"
  },
  {
    "headline": "Lagos Assembly to strengthen healthcare sector through training",
    "summarized_story": "By Ebunoluwa SessouLagos State House of Assembly has moved to expand the provision of training and retraining facilities for health workers with the amendment of the Healthcare Bill.\n“We all know that healthcare is an expensive venture so we need to put everything in place for that.\nAlso speaking, the Deputy Provost of the institution, Mrs. Rotimi Ayodele said that there ought to be provisions for emoluments of the staff of the institution, staff welfare and student union government.\nShe however commended the Assembly for coming with the amendment of the Bill that established the institution in 1920.\nHe also observed that the Lagos State University College of Medicine (LASUCOM) is the apex Healthcare training institution in the state and that such should not be ascribed to the college."
  },
  {
    "headline": "Appointment, promotion and remuneration of judges in Nigeria: The need for a change",
    "summarized_story": "The Appointment of Judicial OfficersIn the sixties when I began the practice of Law, appointment to the Bench was strictly on merit.\nAside from sound knowledge of the law, integrity and honour marked out and propelled many Judges appointed in those days to the Bench.\nThis system effectively obviated a recourse to political affiliation, nepotism or favouritism in the appointment of judges which, no doubt, has characterised the appointment mechanism today.\nUndoubtedly, the provision of the 1999 Constitution as to the appointment of Judges and Justices deeply encourages the politicisation of this hallowed position.\nIn addition, there needs to be a review of the process of appointing High Court Judges from the magistracy."
  },
  {
    "headline": "A look at Buhari’s hailers and his haters",
    "summarized_story": "At this point of his presidency, Buhari has spent more than two-thirds of his presidential terms.\nThe important thing to note here about the hailers and haters of Buhari is that they all operate in absolute terms.\nWhile for the hailers it is all rankadede, as with them Buhari cannot set a foot wrong, for the haters, it is mostly bamuso, nothing Buhari does, no matter how useful, can be good.\nIndeed, a full account of the Buhari administration will only be possible after the administration has taken its exit.\nNo government before this present one practiced nepotism to the level the Buhari administration has now taken it."
  },
  {
    "headline": "AU suspends Mali with immediate effect following second coup",
    "summarized_story": "The African Union (AU) has suspended Mali from the continental body with immediate effect until normal constitutional order is restored in the country.\nThis follows the evolving situation in the West African country in which the civilian interim president Bah N’Daw and Prime Minister Moctar Ouane were ousted in a second coup.\nThe communique said the AU strongly urged the Malian military to “urgently and unconditionally return to the barracks, and to refrain from further interference in the political processes in Mali”.\nFollowing an uncompromising position of ECOWAS, the military agreed to an 18-month transition to constitutional rule with interim civilian president and prime minister.\nThe two men resigned and Goïta was confirmed interim president by the Constitutional Court."
  },
  {
    "headline": "1st human case of bird flu reported in China",
    "summarized_story": "By Sola OgundipeChinese authorities have appealed for calm as the first-ever human infection with the H10N3 strain of bird flu was reported in the country’s eastern Jiangsu province.\nChina’s National Health Commission announced on Tuesday that the virus was detected in a 41-year-old man from Zhenjiang city.\nHe was reportedly diagnosed as having the H10N3 avian influenza virus on May 28, but details of his infection were not given.\nThere have been no significant numbers of human infections with bird flu since the H7N9 strain killed around 300 people during 2016-2017.\nNo other cases of human infection with H10N3 have previously been reported globally."
  },
  {
    "headline": "Southeast crisis: Onion marketers suspend supply",
    "summarized_story": "The Onion Producers and Marketers Association of Nigeria (OPMAN) has said it has concluded plan to halt the supply of Onion to the Southeast following the current unrest ravaging the region.\nAccording to him, the traders have suffered several attacks by the unknown gunmen in the region, hence the decision to suspend supplies until normalcy returns.\nNLC strike halts economic activities in KadunaHe claimed that two trucks loaded with the produce were recently hijacked by gunmen suspected to be members of the proscribed Indigenous People of Biafra, IPOB.\nSome people believed to be IPOB members intercepted a truckload of Onion last week and reportedly distributed the produce to the public.\nBut the IPOB leader, Nnamdi Kanu has insisted that the group was not responsible for any act of violence in the region."
  },
  {
    "headline": "Abuja residents groan under AEDC’s prepaid meters fraud, auto reclosure on 33KVA",
    "summarized_story": "Consumers who spoke with DAILY POST expressed disappointment with the programme.\nA resident at Asokoro Extension in Abuja said staff of the AEDC are committing fraud.\nDAILY POST recalls that the government is against placing auto reclosure on transmission lines and regards such act as illegal.\nIn this case, the essence is to delay in order to minimize cost of maintenance as well as running cost, DAILY POST gathered.\nA source told DAILY POST that it is difficult to understand why AEDC that is interested in generating funds be auto reclosing a 33KVA power line."
  },
  {
    "headline": "Buhari's statement on Southeast laughable",
    "summarized_story": "Valentine Ayika, a former member of the House of Representatives from Anambra State has said that President Muhammadu Buhari’s statement threatening Southeast people was laughable and insensitive.\nRecall that the president while reacting to the agitation in the region threatened that the region will soon have what they are calling for.\nAccording to the former lawmaker, “First of all, the statement for me is laughable, it doesn’t smack of what is expected of a president of a country.\n“It is not all about talking and talking, we have had so much talk but no action.\n“I have seen cases where you will have to park your vehicle and hands up to walk across the checkpoints."
  },
  {
    "headline": "IPOB secessionists gathering in Edo",
    "summarized_story": "The Deputy Inspector General of Police, in charge of Operation Restore Peace in the South-South region, DIG Moses Jitoboh, on Wednesday, raised the alarm over the gathering of some members of the Indigenous People of Biafra (IPOB) in Edo State with the intent of spreading secessionist messages across the state.\nHe listed the areas they are currently holding their secret meetings in the State as Igbanke, Ubiaja, Iguelaba, Igueben, Okhiahe and Ologbo.\nJitoboh disclosed this during a stakeholders meeting and the launching of Operation Restore Peace in the South-South region held in Benin City.\nDIG Jitoboh said Edo and Bayelsa are the states currently enjoying relative peace in the country and that they must not allow anybody to come in and scuttle it with secessionist messages.\nHe said his mission in the region was to restore peace, noting that President Muhammadu Buhari inaugurated what is called Operation Restore Peace in the troubled region (South-South and South-East) and that he is in charge of the South-South region."
  },
  {
    "headline": "SPN condemns, calls for arrest of cop who allegedly shot Sowore",
    "summarized_story": "Socialist Party of Nigeria (SPN) has called for the arrest of the police officer who allegedly shot Omoyele Sowore.\nSowore is the publisher of SaharaReporters and former presidential candidate during the 2019 elections.\nDAILY POST recalls that the activist on Monday claimed he was shot by a police officer during a protest against insecurity in Abuja.\nBuhari must go – Sowore reacts to assassination attempt on OrtomThe party alleged that violence was so brutal that Sowore was shot.\nThe party then demands immediate arrest and prosecution of ACP Hyelhira Altine Daniel."
  },
  {
    "headline": "Boat mishap: Badaru donates N25m to bereaved families, survivors",
    "summarized_story": "By Khadijat Saidu, Birnin KebbiJigawa Governor Badaru Abubakar has donated N25m to bereaved families and survivors of the boat mishap at Warrah, in Kebbi State.\nBadaru announced the gesture at Government House, Birnin Kebbi when he paid a condolence visit to Kebbi Governor.\nHe said: “This is indeed a very sad moment to all of us after losing such a large number of people.\nWe can do nothing but to pray for the repose of the souls of the departed as well as for the speedy recovery of the injured ones.”Badaru extended the heartfelt condolences of the people and Government of Jigawa State to Kebbi State.\nADVERTISEMENTBagudu lauded Badaru for the invaluable gesture and noted the Jigawa Governor was from time to time receiving briefings on the mishap, even though he was out of the country when the tragedy struck."
  },
  {
    "headline": "Niger announces total ban of commercial motorcycles",
    "summarized_story": "By Justina Asishana – MinnaNiger has announced total ban of commercial motorcycles to curb insecurity in the State.\nDeputy Governor, Alhaji Ahmed Mohammed Ketso announced this on Wednesday.\nThe Deputy Governor said the Okada Riders Association has been informed, vowing the new ban will be implemented to the latter.\nKetso also called on Emirs, District Heads and village heads to begin profiling new residents in their communities.\nOn the Tegina Islamiyya Children, the Deputy Governor said they are still negotiating with the bandits but refused to state the level of negotiation."
  },
  {
    "headline": "Umahi suspends another coordinator over communal conflict",
    "summarized_story": "By Ogochukwu Anioke, AbakalikiEbonyi State Governor David Umahi has suspended the Coordinator of Ikwo East Development Centre, Mr. Emmanuel Ekuma.\nÊkwÍ East Development Centre is in Ikwo Local Government.\nUgbala said: “Governor Umahi has approved the indefinite suspension of Mr. Ekuma as the coordinator of Ikwo East Development Centre for negligence and dereliction of duty, with immediate effect.\nThe Enyibichiri/Enyingba communal crisis has been on for years, with intermittent clashes between the two communities leading to loss of lives.\nA statement yesterday by the institution urged members of the university community to avoid the road while going to school."
  },
  {
    "headline": "Fayose mocks Buhari over ‘treat them in the language they understand’ tweet",
    "summarized_story": "By Alao AbiodunFormer Ekiti Governor Ayodele Fayose has mocked President Muhammadu Buhari over his ‘treat them in the language they understand’ tweet, which has now been deleted by Twitter.\nThe Nation reports many Nigerians had tackled Buhari over the statement, citing his reference to the civil war as a threat to commit human rights violations.\nFayose, while reacting to the now-deleted tweet, alleged Buhari threatened genocide amid the rising tension across the country.\n“Now that Twitter has dealt with our almighty President Buhari, won’t he “deal” with Twitter too?\n“When is Mr President Buhari using his power as Commander-in-chief to “show Twitter pepper” for deleting his tweets?"
  },
  {
    "headline": "Christians have right to defend themselves against attack with equal force –Martins",
    "summarized_story": "By Philip NwosuCatholic Archbishop of Lagos, Alfred Adewale Martins, has said on Tuesday that Nigerians and particularly Christians being attacked and killed in the northern part of the country have right to defend themselves against incessant attacks on their communities by invaders, tagged: herders.\nMartins, who spoke during the celebration of its 62nd birthday anniversary, said one of the moral principles in life is that, “if a person is under attack, he has the right to defend himself with equal force that he is being attack.\nSo, in principle, every human being has the right to defend himself or herself.\n“Regrettably, those salient conventions have taken flight from our polity and thereby paved the way for mistrust, corruption and banditry.\n“From the North to the South, every part of the country is witnessing one form of brigandage or the other,” he said."
  },
  {
    "headline": "Igbo abroad insist on restructuring, fiscal federation",
    "summarized_story": "By Zika BobbyDiaspora Igbo group, the Igbo World Assembly (IWA), has said there was need to restructure Nigeria to ensure true federalism as it was in the 1963 Constitution based on regions.\nIt condemned Federal Government’s shoot-on-sight position, noting that such could be termed an act of ethnic cleaning.\nRestructuring of Nigeria, according to him, should be a means of tackling the worsening security situation and the agitation for secession.\n“We need a Nigerian political structure that is based on equity, fairplay, balance and equal access to political power for the good of all Nigerians.\nIWA states only restructuring can prevent Nigeria from disintegration.”Speaking on the Fulani herdsmen, he said Ndigbo will no longer tolerate the attack by herdsmen."
  },
  {
    "headline": "Tension as gunmen kill Ortom’s aide",
    "summarized_story": "Reacting to the incident, governor Ortom described the Dega’s murder as a huge blow to his administration and the entire state.\n“Retired AIG Dega served with me here and this is someone who has retired, but is not tired, and was very active.\nSo, for him to have been murdered in the manner they did, a retired AIG gunned down, is very sad,” Ortom stated.\nHe decried the increasing spate of insecurity that has bedevilled the North East, North West and North Central, South South, South East, South West, and called on security agencies to find the killers of his aide.\nMeanwhile, the Plateau state police command said it has arrested some suspected killers of Dega."
  },
  {
    "headline": "COVID-19: FEC approves N5.6bn for 37 oxygen plans across Nigeria",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Federal Executive Council (FEC) presided over by President Muhammadu Buhari has approved the establishment of oxygen production plant in each of the 36 states of the country.\nThe minister added that council also approved the sum of N1.\nEnvironment Minister, Mahammad Mahmud, said council approved the revised national policy on climate change.\n“We all know climate change is our topic of today, it has serious implications on economy, livelihoods.\nThis revised one has also put into consideration the national policy on gender and climate change to include women in almost every aspect of climate projects executions.”"
  },
  {
    "headline": "FG fumes as Twitter pulls down Buhari’s civil war tweet",
    "summarized_story": "From Magnus Eze, Enugu, Juliana Taiwo-Obalonye, Okwe Obi, Abuja Abuja and Chukwudi NwejeApplause and condemnations, yesterday, trailed Twitters decision to delete President Muhammadu Buhari’s civil war tweet.\nIf Mr. President, anywhere in the world feels very bad and concern about a situation, he is free to express such views.\nNow that Twitter has dealt with our almighty President Buhari, won’t he “deal” with Twitter too?\n!”Notwithstanding the trenchant criticisms, a group, Vanguard for Peace and National Development, backed President Buhari’s vow to crush separatist groups.\nWhat President Buhari does not understand is that if a referendum is conducted those opposed to IPOB/ESN may be more."
  },
  {
    "headline": "FG Protests Deletion of Tweet, Says Twitter Can’t Gag Buhari",
    "summarized_story": "The accusation followed the decision of Twitter to delete a controversial post by Buhari on the Nigerian civil war.\nThe same Twitter during the ENDSARS protests promoted tweets trying to raise funds for the ENDSARS protesters.\nIf Mr. President, anywhere in the world feels very bad and concerned about a situation, he is free to express such views.\nBy whatever name, you can’t justify giving orders to kill policemen or to kill anybody you do not agree with.\nHe said: “There are so many people who have been spewing hate against Mr. President, against this governments."
  },
  {
    "headline": "Ezeife: South-east Violence, Plot to Undermine Clamour for Igbo Presidency",
    "summarized_story": "Ezeife described the insurrection in the South-east as an attempt to provoke indigenes of the South-east.\n“Now we know that more than 80 per cent of the people caught by the CCTV are not from the South-east.\nHe stated that a South-east governor who had earlier accused IPOB and ESN of executing the attacks had since exonerated the secessionist group.\nDuring the ENDSARS protests, people attributed what was happening in Lagos to some Igbo people and it was later discovered to be untrue.\nThe guild thanked Ganduje and members of the state Executive Council for providing the enabling environment for the national convention to hold."
  },
  {
    "headline": "$40bn Investments Needed for Nigeria’s Gas Plan, Says NNPC",
    "summarized_story": "He added that the figure on the quantum of funds needed is based on the submissions NNPC has received from potential investors.\nIn addition, he stated that about 39 thermal power plants were being targeted as opposed to the current 33.\nHe said: “In terms of benefits, we will generate 45,000 megawatts of power in terms of gas use, creating massive employment and import substitution.\n“There are changes we need to look at to actualise the decade of gas.\nHe stated that if Nigeria will achieve the decade of gas, it must transit to a willing-buyer willing-seller market."
  },
  {
    "headline": "‘Retired AIG Gunned down! This is Very Sad,’ Ortom Reacts to Aide’s Murder",
    "summarized_story": "The governor, while speaking to journalists Wednesday at Benue Peoples House, Makurdi, lamented that the retired AIG was very active even in retirement, saying it was painful that he was gunned down in such a gruesome manner.\n“Retired AIG Dega served with me here and this is someone who has retired but is not tired and was very active.\nSo for him to have been murdered in the manner they did, a retired AIG gunned down.\nThe governor, who stressed that insecurity had bedevilled the entire country, called on security agencies to find killers of his aide.\nGovernor Ortom sympathized with the family, friends and former colleagues of the deceased and prayed God to grant him eternal rest."
  },
  {
    "headline": "Breaking: Twitter Deletes Buhari’s Tweet Threatening to Deal With Secessionists ‘in the Language They Understand’",
    "summarized_story": "Twitter has deleted President Muhammadu Buhari’s tweet posted Tuesday where he threatened to deal with secessionists “in the language they understand”.\nThe social media giant said, “This Tweet violated the Twitter Rules.\nHe also threatened to deal with “those misbehaving today” “in the language they understand.”Though the President tweeted five tweets on his meeting with Prof. Yakubu, it was the last tweet that Twitter said violated its rules and was deleted, while the remaining four tweets were retained.\nThose of us in the fields for 30 months, who went through the war, will treat them in the language they understand.”The state House has yet to react to Twitter’s action.\nSee the thread of the original tweets below."
  },
  {
    "headline": "BREAKING: Twitter Deletes Buhari’s ‘Genocidal Tweet’ After Condemnation By Nigerians",
    "summarized_story": "Microblogging platform, Twitter has deleted President Muhammadu Buhari’s tweet where he threatened to treat Nigerians “misbehaving” in “the language they understand”.\nThe president said the sponsors and orchestrators of insecurity in the country are doing so because they want his administration to fail.\nWhoever wants the destruction of the system will soon have the shock of their lives.\nTrump's Twitter account was \"permanently suspended... due to the risk of further incitement of violence,\" Twitter had said.\nFollowing widespread condemnation of the tweet, Twitter deleted the message on Wednesday."
  },
  {
    "headline": "BREAKING: Twitter Deletes Buhari’s ‘Genocidal Tweet’ After Condemnation By Nigerians",
    "summarized_story": "Microblogging platform, Twitter has deleted President Muhammadu Buhari’s tweet where he threatened to treat Nigerians “misbehaving” in “the language they understand”.\nThe president said the sponsors and orchestrators of insecurity in the country are doing so because they want his administration to fail.\nWhoever wants the destruction of the system will soon have the shock of their lives.\nTrump's Twitter account was \"permanently suspended... due to the risk of further incitement of violence,\" Twitter had said.\nFollowing widespread condemnation of the tweet, Twitter deleted the message on Wednesday."
  },
  {
    "headline": "BREAKING: Twitter Deletes Buhari’s ‘Genocidal Tweet’ After Condemnation By Nigerians",
    "summarized_story": "Microblogging platform, Twitter has deleted President Muhammadu Buhari’s tweet where he threatened to treat Nigerians “misbehaving” in “the language they understand”.\nThe president said the sponsors and orchestrators of insecurity in the country are doing so because they want his administration to fail.\nWhoever wants the destruction of the system will soon have the shock of their lives.\nTrump's Twitter account was \"permanently suspended... due to the risk of further incitement of violence,\" Twitter had said.\nFollowing widespread condemnation of the tweet, Twitter deleted the message on Wednesday."
  },
  {
    "headline": "How Registrar Of Nigeria's Exam Body, NECO Died Before Chance To Expose Culprits In N6.5billion Contract Scam",
    "summarized_story": "Only a week ago, the Senate Committee on Public Accounts said it was going to look into how N6.5 billion contracts were awarded without due process in 2017.\nBut the council and the Niger State Police Command claimed the NECO registrar died after a brief illness.\nSee Also Corruption EXPOSED: Former Acting NECO Registrar, Gana, In N548m Contract Duplication Scandal“We request that you kindly notify the Board, Management and the entire staff of the Council of this development,” it read.\nThe police command also stated that Obioma died of natural causes with no mention of any investigation opened into the incident.\nAt another session two weeks ago, the upper legislative chamber confronted the NECO Registrar, Obioma, with another damning report of alleged N6.5billion contracts award without due process."
  },
  {
    "headline": "How Registrar Of Nigeria's Exam Body, NECO Died Before Chance To Expose Culprits In N6.5billion Contract Scam",
    "summarized_story": "Only a week ago, the Senate Committee on Public Accounts said it was going to look into how N6.5 billion contracts were awarded without due process in 2017.\nBut the council and the Niger State Police Command claimed the NECO registrar died after a brief illness.\nSee Also Corruption EXPOSED: Former Acting NECO Registrar, Gana, In N548m Contract Duplication Scandal“We request that you kindly notify the Board, Management and the entire staff of the Council of this development,” it read.\nThe police command also stated that Obioma died of natural causes with no mention of any investigation opened into the incident.\nAt another session two weeks ago, the upper legislative chamber confronted the NECO Registrar, Obioma, with another damning report of alleged N6.5billion contracts award without due process."
  },
  {
    "headline": "Newspaper Headlines: FG kicks as Twitter deletes Buhari's post on civil war",
    "summarized_story": "The reactions to President Muhammadu Buhari’s threat against agitators with reference to the civil war and the deletion of the post by Twitter dominated the headlines of Nigerian newspapers.\nAdvertisement"
  },
  {
    "headline": "Newspaper Headlines: FG kicks as Twitter deletes Buhari's post on civil war",
    "summarized_story": "The reactions to President Muhammadu Buhari’s threat against agitators with reference to the civil war and the deletion of the post by Twitter dominated the headlines of Nigerian newspapers.\nAdvertisement"
  },
  {
    "headline": "Daily COVID Tracker: NCDC records 25 infections, and 10,000 Nigerians report vaccine side effects",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) on Wednesday recorded 25 cases of COVID-19.\nOver 10,000 Nigerians report side effects after COVID vaccinationFaisal Shuaib, executive director, National Primary Health Care Development Agency (NPHCDA), says 10,027 people reported side effects after they received their first doses of the COVID vaccine.\nOnline summit secures 1.8 billion vaccine doses for poor countries Advertisement About $2.4 billion was raised on Wednesday in an online summit for the purchase of 1.8 billion COVID vaccines for poor countries.\n🔴 WATCH LIVE: The Gavi #COVAX AMC Summit is set to secure funding to accelerate access to 1.8 billion #COVID19 vaccine doses for lower-income economies via the Gavi COVAX Advance Market Commitment.\nNigeria records 25 infectionsThe NCDC confirmed 25 COVID-19 infections across five states of the federation on Wednesday."
  },
  {
    "headline": "Daily COVID Tracker: NCDC records 25 infections, and 10,000 Nigerians report vaccine side effects",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) on Wednesday recorded 25 cases of COVID-19.\nOver 10,000 Nigerians report side effects after COVID vaccinationFaisal Shuaib, executive director, National Primary Health Care Development Agency (NPHCDA), says 10,027 people reported side effects after they received their first doses of the COVID vaccine.\nOnline summit secures 1.8 billion vaccine doses for poor countries Advertisement About $2.4 billion was raised on Wednesday in an online summit for the purchase of 1.8 billion COVID vaccines for poor countries.\n🔴 WATCH LIVE: The Gavi #COVAX AMC Summit is set to secure funding to accelerate access to 1.8 billion #COVID19 vaccine doses for lower-income economies via the Gavi COVAX Advance Market Commitment.\nNigeria records 25 infectionsThe NCDC confirmed 25 COVID-19 infections across five states of the federation on Wednesday."
  },
  {
    "headline": "Ezeife: Attacks in south-east designed to provoke Igbo -- IPOB not involved",
    "summarized_story": "Chukwuemeka Ezeife, former governor of Anambra state, says the Indigenous People of Biafra (IPOB) and the Eastern Security Network (ESN) are not behind the violent attacks in the south-east.\nAdvertisementThere have been several attacks on police stations, prisons and the offices of the Independent National Electoral Commission (INEC) in the south-east.\nSpeaking when he featured on Arise TV on Wednesday, Ezeife said investigation carried out by elders in the south-east revealed that such attacks are designed to provoke Igbo people.\nThere is the impression that some people, maybe even in the government, are guilty of organising such things and blaming it on IPOB and ESN.\nEfforts have been made by our elders of our people to find out the truth and the hands of IPOB and ESN are not there,” he said."
  },
  {
    "headline": "After Buhari’s “civil war” tweet is deleted, Nigerian minister accuses Twitter of suspicious agenda",
    "summarized_story": "Buhari’s deleted tweet was widely criticised as summoning the ghosts of the Nigeria civil war, a deadly three-year combat between the Nigerian government and a government in southeast Nigeria, which had seceded from the republic.\n“Many of those misbehaving today are too young to be aware of the destruction and loss of lives that occurred during the Nigerian Civil War,” the tweet read.\nTwitter had never deleted tweets by the Nigerian president before.\n“Has Twitter deleted the violent tweets that Nnamdi Kanu has been sending?\nWhat is their agenda?”Last October, Twitter became the platform where the world learned much about END SARS protests in Nigeria."
  },
  {
    "headline": "Banks don’t fund African renewable energy startups. So where can founders find money?",
    "summarized_story": "Michael Famoroti, chief economist at Stears gave two reasons during a recent TechCabal Live event on financing renewable energy companies in Africa.\nLike renewable energy for example.\nWiebe Boer, All On’s managing director, empathizes with founders who need funding but have little sources to reach out to.\nFrom there, it might be possible to access funding from All On’s initiatives for projects at the ideation stage.\nBut he hopes they persevere because “ultimately, there is a big market to serve.”Watch the full video of the TechCabal Live event on financing an African renewable energy company here."
  },
  {
    "headline": "Sawari Ventures is leading investments in North Africa",
    "summarized_story": "In today’s edition of Ask an Investor I talk to one of the oldest venture capital firms in the Middle East and North Africa – Sawari Ventures.\nFikry pointed out that Sawari Ventures helped Almentor in three critical areas: Governance, networking with the ecosystem and technical support.\nI talk to Tamer Azer, a principal at Sawari Ventures; he joined the firm in 2019.\nDaniel Adeyemi: Tell me about Sawari VenturesTamer Azer: Sawari ventures has been around since 2010.\nWhen Sawari Ventures raised its North Africa fund, we invested in Flat6Labs Cairo and Flat6Labs Tunis."
  },
  {
    "headline": "Infinix Launches Award-Winning NOTE 10 Pro Series. Powerful Performance. Iconic Design",
    "summarized_story": "Lagos, Nigeria – June 1, 2021 – Infinix launched the all-new NOTE 10 series, a new portfolio of premium smartphones including the NOTE 10, NOTE 10 Pro, and NOTE 10 Pro near-field communication (NFC).\nThe design is available in four colors: 95° Black, 7° Purple, Emerald Green (exclusive to NOTE 10) and Nordic Secret (exclusive to NOTE 10 Pro).\nThe NOTE 10 series delivers stunning professional-quality images and beautiful nightscape imagery, both in daylight and at night.\nPacked with Power & PerformanceFor super-fast data processing and response times, the NOTE 10 Pro and NOTE 10 Pro NFC are powered by the award-winning MediaTek Helio G95 processor.\nYou can preorder the device for just N2500 or N2000 for Note 10 Pro and Note 10 respectively."
  },
  {
    "headline": "Binance To Offer $30,000+ in Prizes To Hackathon Participants in Africa",
    "summarized_story": "Binance, the world’s leading blockchain ecosystem and cryptocurrency infrastructure provider will hold a DeFi & NFT hackathon for African blockchain enthusiasts from June 7 to June 28, 2021.\nIn line with the company’s commitment to Africa and the growth of the blockchain ecosystem, Binance continues to empower blockchain engineers.\nParticipants will also have the opportunity to win limited edition NFTs and Binance Swags during the Hackathon period.\nRegister for the opening ceremony of the Binance Hackathon HEREWho can participate: All developers, builders, and creators from Africa (hackathon is open to both beginners and non-beginners)How to participate in the hackathon: Join the Telegram group here and sign up through the Hackerlink special landing page where all hackathon projects will be submitted.\nWhat to expect: All DeFi and NFT projects will be built on the Binance Smart Chain and made completely open source."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Airtel Africa sells its Tanzanian towers for $175m in a play to reduce its debts",
    "summarized_story": "Airtel Africa has announced the sale of its Tanzanian tower portfolio for $175 million.\nAccording to the company, the sale to SBA Communications Corporation and Paradigm Infrastructure Limited would allow it to prioritise its core subscription services.\nAirtel Africa will receive approximately $157.5 million of the total amount in the first instalment, which is expected to take place in the second half of the group’s financial year.\nIn 2020, Airtel Africa CEO, Raghunath Mandava, outlined plans to sell approximately 4,500 towers in five countries: Chad, Gabon, Madagascar, Malawi, and Tanzania.\nIt appears that Airtel is choosing to go this route as it aims to reduce its debt and increase competitiveness."
  },
  {
    "headline": "How Releaf and OnePipe plan to help farmers in Southern Nigeria have access to digital financial services",
    "summarized_story": "Following a partnership between Releaf — an agritech startup — and fintech startup, OnePipe, farmers in Cross River and Akwa Ibom states can now easily access digital financial services.\nWhile fintech startups have sprung up trying to increase the number of Nigerians connected to financial services, they have mostly solved the problems associated using existing financial services.\nMost of the farmers who work with Releaf are smallholder farmers who live in rural areas.\nBy providing them with an opportunity to access financial services through digital channels, they can create a digital footprint enabling them to access more financial services, thus accelerating their financial inclusion.\nThrough this partnership with OnePipe, it is expected that smallholder farmers in Nigeria, most of whom lack access to financial services, can now access financial services and, in the process, drive Nigeria’s financial inclusion goals."
  },
  {
    "headline": "Nourishing dairy with tech, a path to Nigeria’s economic growth?",
    "summarized_story": "Sadly, two decades later, Nigeria’s milk production pales in comparison to its potential.\nAdvertisementThe Commonwealth Scientific Industrial Research Organisation (CSIRO) reports that pastoral systems, which yield meagre output, produce 90% of Nigeria’s milk.\nDeveloped countries have employed scientific and technological innovations in the dairy sector.\nAccording to him, companies in milk-producing countries would be hesitant to develop Nigeria’s dairy industry.\nWhile these numbers nullify Abubakar’s claims, they do not reduce the viability of the dairy sector as a major source of revenue."
  },
  {
    "headline": "Nigeria’s weak growth trails already low IMF forecast",
    "summarized_story": "For Africa’s biggest oil producer to attain the 2.5 percent gross domestic product (GDP) forecast by the International Monetary Fund (IMF) for 2021, it would need to grow by an average of 3.15 percent over the next three quarters after a tepid 0.51 percent expansion in the first quarter.\nAttaining the IMF forecast in itself…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Shoprite investors cheer sale of troubled Nigerian unit",
    "summarized_story": "Shares of the South African retail giant Shoprite traded almost 4 percent higher Wednesday, the day the company announced it had received 70 percent of proceeds from the sale of its troubled Nigerian unit.\nShoprite, one of the first South African companies to expand into Nigeria in the early 1990s, recently completed the sale of its supermarket business in Africa’s largest economy.\nThe sale is to a subsidiary of Nigerian property group, Persianas Investments.\nThe company said the Nigerian business environment had become unfavourable for its operations and it would be closing down as a result.\nIt also includes an agreement that provides for administration and technical support from the Shoprite Group for an initial period of five years."
  },
  {
    "headline": "Lagos moves to boost confidence in its major asset",
    "summarized_story": "In a bid to boost confidence in its major asset, which is land, Lagos State government has reduced time for registering property and also for obtaining construction permit.\nGovernor Babajide Sanwo-Olu had, shortly after assuming office in 2019, reversed the Land Use Charge, which raised enormous dust when it was reviewed upwards, to pre-2018 levels.\nThe implication of these moves is not only that they enhance ease of doing business in the state, which is an otherwise difficult business environment, but also to boost investors’ confidence and raise public trust in real estate and land-related business in the state.\nThis has come down from 72 to 61 days, according Hakeem Okunola, the state’s Head of Service (HoS).\nThese steps are of tremendous assistance to investors who, before now, have been finding it difficult getting property registration and construction permit."
  },
  {
    "headline": "Obaseki: Court ‘ll decide fate of 14 run-away Assembly members-elect – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has asserted that the fate of the 14 members-elect of the state’s House of Assembly, whose seats were declared vacant, rests with the Court.\nThe seats of the 14 members-elect were in December 2019 declared vacant by the House led by former speaker, Rt.\nAccording to him, “Some characters said they sent congratulatory letters to me and put it in all kinds of conditions.\n“How can you tell me to forgive those 14 lawmakers-elect who are responsible for sedition and treason in Nigeria?\nOsanyande said that the e-revenue collection system would further increase the state government Internally Generated Revenue (IGR)."
  },
  {
    "headline": "Obaseki meets Edo youths, says Nigeria in dire need of strong institutions not strongmen – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has identified weak institutions as a bane of Nigeria’s underdevelopment, hinting on the need for leaders across the country to build strong institutions to achieve sustainable development.\nObaseki made the call while addressing youths in the state during a stakeholders’ engagement of the Edo State Transition Committee with youths and student groups at the New Festival Hall, Government House, Benin City.\nAccording to Obaseki, “Let us hold our political leaders to account; people will come and go, but institutions will remain.\nThe only way this will happen is when we realize that the government is about you and when you participate in governance.\nYou need to participate – not just sit down and participate on social media – in your community; speak up,” the governor charged."
  },
  {
    "headline": "Obaseki appoints Osaigbovo Iyoha as Chief of Staff – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has appointed Hon.\nIyoha Osaigbovo Toni, as his Chief of Staff.\nIyoha Osaigbovo Toni, born on 6th of July 1973, holds a Bachelors’ degree in Mechanical Engineering from Ambrose Alli University, (formerly Edo State University) and a Masters of Engineering degree in Industrial Engineering from the University of Benin (UNIBEN).\n“He is presently concluding a Ph.D in Industrial Engineering from UNIBEN.\nHis experience spans across Construction, Legislation, Public Service and Industrial Engineering."
  },
  {
    "headline": "Senate move to End Discrimination Against HND Holders – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestTHE Senate, on Wednesday, passed a bill seeking to end the discrimination against holders of Higher National Diploma, (HND)certificate in the country.\nThis was contained in a Bill sponsored by Senator Ayo Akinyelure, which passed the third reading on the floor of the Senate at plenary.\nAccording to the Chairman of the Senate Committee on tertiary institutions and TETFUND, Senator Ahmad Kaita, presented his report and all the amended six clauses were approved by the Senate.\nThe Senate President, Ahmad Lawan, in his remarks after the bill was passed, emphasised that the passage of the bill would serve as motivation for polytechnic graduates.\nLawan noted that, “This particular issue has been in the front burner for a long time."
  },
  {
    "headline": "Arrest killers of Benue governor’s aide, Atiku urges FG",
    "summarized_story": "ADVERTISEMENTNigeria’s former Vice President, Atiku Abubakar, says the security operatives, should apprehend the killers of the Benue Governor’s security aide and a retired Assistant Inspector General of Police (AIG), Christopher Dega.\nBefore his retirement from the police, Mr Dega had served as commissioner of police in Borno and Edo states.\nMr Ortom, in his reaction, has described the assassination of Mr Dega as a huge blow to his administration and the entire state.\n“Retired AIG Dega served with me here and this is someone who has retired but is not tired and was very active.\nSo for him to have been murdered in the manner they did, a retired AIG gunned down."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun APC Chairmanship Aspirant, Divine drums support for Oyetola’s re-election",
    "summarized_story": "By Sunday Oguntuyi, OsoogboA chairmanship aspirant for Odo Otin North LCDA under the platform of All progressives Congress (APC) in Osun State, Hon.\nOluwatobi Olabode (Divine), has called on the people in the local government and the state at large to rally support for the re-election of Governor Adegboyega Oyetola for the good work he embarked on to continue.\nOlabode said continuity of the present administration in the state will lead to developmental programmes that will enhance living standard of people in the state.\nAccording to him, considering the various developmental projects going on simultaneously in the state without borrowing and owing workers salaries and pension arrears, governor Oyetola deserve second term.\nDivine” said he is jostling for chairmanship position of his local council to further add glamour to the development in the area."
  },
  {
    "headline": "Osun: Oyetola launches Osun Youth Policy Document, reiterates commitment to youth development",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun state Governor, Adegboyega Oyetola, on Wednesday said his government is committed to youth development.\nThe governor spoke at the launch of Osun Youth Policy Document to develop and empower young people in the state and put them at the centre of development.\nHe noted that the Osun Youth Policy contains commitment by government, the youth of the state and the society in pursuance of youth development and growth.\n“As captured in the Policy, youth development is holistic and integrated, requiring the support and active involvement of all relevant Ministries, Departments, and Agencies (MDAs), Youth Organisations, Non Governmental Organisations and the Public Sector, Private Sector and Philanthropists,” he said.\n“The unveiling of the Osun Youth Policy Document today is to further demonstrate our Administration’s commitment to youth development."
  },
  {
    "headline": "Military invasion of South East will lead to chaos – Uko warns",
    "summarized_story": "OBINNA EZUGWUFounder, Igbo Youth Movement (IYM), Evangelist Elliot Ugochukwu-Uko, has advised President Muhammadu Buhari against ordering military invasion of Nigeria’s South East region, as according to him, such move would lead to chaos and an unprecedented meltdown of the country.\nIn a statement on Wednesday, Uko who is also the secretary of Eastern Consultative Assembly (ECA), warned that military invasion rather than resolve the security situation in the zone, will make things much worse, even as it could lead to anarchy.\n“Rumours of proclamation of a state of emergency and the invasion of South East Nigeria by contingents and battalions of Nigerian military any time now, should not be true,” Uko said.\n“This planned and ill-advised military campaign to the South East, will only confirm and affirm the rhetorics of the agitators, that the South East is deliberately hated and unwanted in the land.\n“Heavily indebted, with a steady inflation figures, unrest in all the regions, weak economy and agitation for seccesion thriving in the South East and South West, military action in the East will ensure the utter destruction of the road to peace."
  },
  {
    "headline": "FG kicks as Twitter deletes Buhari’s tweet threatening violence against ‘Igbo’ agitators",
    "summarized_story": "Nigeria’s Federal Government has reacted angrily as social media giant, Twitter deletes President Muhammadu Buhari’s tweet threatening violence against pro Biafra agitators in the country’s Igbo dominated Southeast region.\nFollowing several complaints, Twitter deleted the tweet, stating: “This Tweet violated the Twitter Rules”.\nHe argued that the social media giant has conveniently ignored inciting tweets by Nnamdi Kanu, the leader of the proscribed Indigenous People of Biafra (IPOB) and his cohorts.\nIf an organisation is proscribed, it is different from any other which is not proscribed,” he said.\nIPOB has, however, denied being violent in its separatist campaign, but it has also said it assembles arms and ammunition locally."
  },
  {
    "headline": "FIFA President Restates Commitment To Good Governance",
    "summarized_story": "FIFA President Gianni Infantino has reinforced the importance of protecting the integrity of sport, while speaking at a special United Nations General Assembly event, highlighting the dangers of corruption.\nAddressing UN delegation and stakeholder chiefs, President Infantino reiterated how good governance is critical to building sustainable, clean football for the whole world to enjoy.\nPresident Infantino reflected on FIFA’s partnership with the United Nations Office on Drugs and Crime (UNODC), and their shared zero-tolerance approach to corruption.\n“We must have bidding processes that are fully transparent, have clear evaluation criteria and abide by ethical principles, as well as the allocation of FIFA World Cup and FIFA Women’s World Cup hosts voted on by the FIFA Congress,” President Infantino said.\n“This has already been the case for the FIFA World Cup in 2026 in the United States, Canada and Mexico, and will be the process followed for the first time in the selection of the hosts for the next FIFA Women’s World Cup.”"
  },
  {
    "headline": "Sports Minister To Declare 2021 Emerging Leaders Conference Open",
    "summarized_story": "The minister of youth and sports development, Chief Sunday Akin Dare, is expected to spearhead efforts by stakeholders to mentor and empower aspiring young leaders to pursue excellence, integrity and consistency while presenting them with invaluable networking opportunities and platforms.\nThe 2021 Emerging Leaders Conference, which will attract eminent Nigerian leaders, the international community, young aspiring leaders across all facets, the corporate, professionals and the political sphere and, will be declared open by the Minister on Thursday, June 17 at the Merit House, Maitama, Abuja.\nThe event which is being packaged and managed by Rest Logic Nigeria is aiming to address the leadership, governance, development and innovation needs of the youths.\nThe statement added that the conference will also among other things, inspire and create leadership awareness amongst the youths and help them channel the awareness positively for the growth and good of their immediate community, breaking ethno-religious divide, sponsoring synergy for leadership growth of the Nigeria nation.\nThe highlight of the conference is the African Leadership Award seeks to recognize and award persons and groups for their exceptional and outstanding strength in the fight for democracy, courage to defend democratic practice, rule of law, human rights, non-discrimination, gender equality and their exceptional, excellent, exemplary leadership."
  },
  {
    "headline": "NFF Worries Over Misinformation On Its Activities",
    "summarized_story": "The Nigeria Football Federation has charged its Media and Publicity Committee to confront the menace of misinformation on the organization’s activities and promote and project the countless positive developments in Nigeria Football on a daily basis.\n“You are all veterans in the profession and we believe you have the capacity to tackle the demon of misinformation and project the many positives of the NFF and the National Teams, and Nigeria Football at large.\nI promise that the NFF will support you in coming up with feasible plans and programmes to achieve your mission,” Gusau said.\nWe will promote and project the NFF and the National Teams.\nOther members of the Committee are Chief Felix Anyansi-Agwu (Vice Chairman); Mr Tony Ubani (Member); Alhaji Shuaibu Mungadi (Member); Mr Gowon Akpodonor (Member) and Alhaji Nasiru Zaharadeen (Member"
  },
  {
    "headline": "Presidential Committee, Juvenile Homes Reform And Matters Arising",
    "summarized_story": "After the visit to correctional centres, the committee has started the second phase of the juvenile decongestion programme.\nJustice Bello(Rtd), while addressing stakeholders during the visit, described the occasion as significant because it will afford the Nigeria Correctional SERVICE opportunity for good service delivery.\nWe found that these institutes were grossly inadequate, and over-crowded which has resulted in the ugly practice of sending juveniles to adult correctional centres.\n“This is to avoid and tackle the ongoing problem of remanding juveniles in correctional facilities established for adult offenders.\nthe federal ministry of justice and the Buniyadi Foundation will take up the surgery bills of 2 boys at the Oregun centre."
  },
  {
    "headline": "Messi Agrees New 2 Year Barcelona Contract",
    "summarized_story": "Barcelona have reportedly set to end the year-long speculation surrounding Lionel Messi’s future by penning a new two-year deal with Barcelona.\nThe six-time Ballon d’Or winner’s future has been the talk of the transfer market since he tried to force a move away from a club last summer, but a dispute over his release clause ultimately led to him staying.\nHowever, reports in Spain have claimed that Messi has decided to continue at Barcelona and will soon sign a new deal with the club until the summer of 2023.\nMessi is therefore set to ply his trade alongside compatriot Sergio Aguero at Camp Nou for the 2021-22 season, with the former Man City striker joining as a free agent on a two-year deal.\nMessi – who will turn 34 later this month – enjoyed another stellar campaign in Catalonia last term, chalking up 38 goals and 14 assists in 47 appearances across all competitions."
  },
  {
    "headline": "CAN: Urges reps fix 18 years for marriage — Daily Times Nigeria",
    "summarized_story": "The Christian Association of Nigeria (CAN) has urged lawmakers to include an 18-year-old minimum age for female citizens to marry in the country’s constitution.\nJohn Oladapo on Wednesday when presenting the CAN stance to the Constitution Review Committee for the South-West Zone.\nHe noted that most of the issues raised at the hearing such as devolution of power, gender equity, among others, if eventually implemented, would put the nation on the right footing.\nAddressing newsmen af­ter the hearing, Chairman of the South-West Constitu­tion Review Centre for Ondo, Osun and Ekiti states,.\nPeter Akpatason, promised that all submissions would be relayed to House of Representatives."
  },
  {
    "headline": "Updated: Assassins kill Ortom's security adviser — Daily Times Nigeria",
    "summarized_story": "According to reports, the retired AIG was shot in the chest several times and bled to death.\nThe gruesome murder was confirmed by the Imo State PDP youth Leader, Greg Nwadike.\n“Retired AIG Dega served with me here and this is someone who has retired but is not tired and was very active.\nSo for him to have been murdered in the manner they did, a retired AIG gunned down.\nGovernor Ortom sympathized with the family, friends and former colleagues of the deceased and prayed God to grant him eternal rest."
  },
  {
    "headline": "Buhari, Lawan, Atiku laud editors guild for successful convention —",
    "summarized_story": "*Osoba, Ganduje canvass new orientation for leadersTunde Opalana, AbujaPresident Muhammadu Buhari and others have commended the Nigerian Guild of Editors (NGE) for holding a hitch-free conventionin Kano.\nBuhari also congratulated members of the new executives re-elected and the ones who won fresh seats.\nIn calling for partnership between the two, the President says the media and the government working together, “can, and will build a strong, safe, secure and inclusive Nigeria,” he said.\nAlso reacting to the NGE Convention, the President of the Senate, Ahmad Lawan, congratulated Mustapha Isah on his election as President of NGE.\nLawan also congratulated other members of the Executive of the guild who were newly elected or re-elected on Tuesday by their fellow editors."
  },
  {
    "headline": "Updated: Twitter removes Buhari’s tweet referencing Nigeria’s civil war...",
    "summarized_story": "Following outcry from those who complained it violated principle of glorifying violence, Twitter has deleted a tweet made by President Muhammadu Buhari threatening to deal with ‘people’ who didn’t learn from the Nigerian Civil War.\nMany condemned the tone of the message which referenced the 1967 civil war, in which millions of lives were lost.\n“When we determine that a Tweet violated the Twitter Rules, we require the violator to remove it before they can Tweet again.\nReacting to Twitter’s deletion of Buhari’s tweet, Fayose mocked: “When is Mr President Buhari using his power as Commander-in-chief to “show Twitter pepper” for deleting his tweets?\n“Now that Twitter has dealt with our almighty President Buhari, won’t he “deal” with Twitter too?"
  },
  {
    "headline": "Gunmen allegedly kill three, burn houses, vehicles in Imo",
    "summarized_story": "Some gunmen have killed three persons, including a youth leader of the Peoples Democratic Party, PDP, Kenneth Amukaamara on Monday night in Awonmama, Oru East Local Government Area of Imo state, .\nA family source to one of the victims who pleaded for anonymity told Vanguard in Owerri, that he pleaded with the security agencies to help in uncovering the perpetrators of the wicked act.\nThe matter is that they were murdered and we cannot say those who carried out this wicked act.\nHowever, it is the duty of the security agencies to find those responsible.\nThis is what I can say, for now, the security agencies will need to unravel those behind it.”“We are pleading that the security agencies will be fast enough to bring those behind this act to face the law."
  },
  {
    "headline": "Gunmen allegedly kill three, burn houses, vehicles in Imo",
    "summarized_story": "Some gunmen have killed three persons, including a youth leader of the Peoples Democratic Party, PDP, Kenneth Amukaamara on Monday night in Awonmama, Oru East Local Government Area of Imo state, .\nA family source to one of the victims who pleaded for anonymity told Vanguard in Owerri, that he pleaded with the security agencies to help in uncovering the perpetrators of the wicked act.\nThe matter is that they were murdered and we cannot say those who carried out this wicked act.\nHowever, it is the duty of the security agencies to find those responsible.\nThis is what I can say, for now, the security agencies will need to unravel those behind it.”“We are pleading that the security agencies will be fast enough to bring those behind this act to face the law."
  },
  {
    "headline": "More condemnation trails assassination of Ortom’s security aide in Pateau",
    "summarized_story": "The Plateau State Police Command has confirmed the killing of a Senior Special Assistant to Governor Samuel Ortom on Security, AIG Christopher Dega (retd.\nThe governor’s aide was shot in the chest several times by the gunmen on Tuesday.\nAlso, the minority caucus in the House of Representatives condemned the murder.\nThe Minority Leader of the House, Ndudi Elumelu, in a statement issued on Wednesday and titled, ‘Reps Minority Caucus Condemns Killing of Gov.\nOrtom’s Security Adviser’, charged security agencies to go after his killers and ensure that they were prosecuted."
  },
  {
    "headline": "More condemnation trails assassination of Ortom’s security aide in Pateau",
    "summarized_story": "The Plateau State Police Command has confirmed the killing of a Senior Special Assistant to Governor Samuel Ortom on Security, AIG Christopher Dega (retd.\nThe governor’s aide was shot in the chest several times by the gunmen on Tuesday.\nAlso, the minority caucus in the House of Representatives condemned the murder.\nThe Minority Leader of the House, Ndudi Elumelu, in a statement issued on Wednesday and titled, ‘Reps Minority Caucus Condemns Killing of Gov.\nOrtom’s Security Adviser’, charged security agencies to go after his killers and ensure that they were prosecuted."
  },
  {
    "headline": "Declare kidnappers, a terrorist group – Kukah tells Buhari",
    "summarized_story": "By Nimot SulaimonBishop Matthew Kukah has faulted President Muhammadu Buhari for his refusal to declare bandits as a terrorist group.\nAccording to Kukah, the presidency, as well as the citizens, know who the terrorists are, and what needs to be done.\nAlso, that the Federal government’s refusal to name them (bandits/kidnappers) terrorists shows that they ”have no blood in their hearts”.\n“Those who govern us are allowing this killing of citizens in their innocency because they have no blood in their hearts,” Kukah said.\nThe government has never declared the kidnappers to be terrorist group."
  },
  {
    "headline": "DIG Jitoboh raises alarm: IPOB members gathering in Edo",
    "summarized_story": "By Jethro Ibileke/BeninThe Deputy Inspector General of Police, in charge of Operation Restore Peace in South-South region, DIG Moses Jitoboh, has raised the alarmed over alleged gathering of members of Indigenous People of Biafra (IPOB), in Edo State with the intent of spreading secessionist messages across the state.\nHe disclosed this on Wednesday in Benin, Edo State, during a stakeholders meeting and the launching of Operation Restore Peace in the south-south region.\nHe listed the areas they are currently holding secret meetings in the state to include Igbanke, Ubiaja, Iguelaba, Igueben, Okhiahe and Ologbo.\nJitoboh, who noted that Edo and Balyesa are the states currently enjoying relative peace in the country, however cautioned that they must not allow anybody to come in and scuttle it with secessionist messages.\nThe police boss said that President Muhammadu Buhari’s inaugurated what is called Operation Restore Peace in the troubled regions of the south-south and south-east and that he is in charge of the South-South region."
  },
  {
    "headline": "Troops neutralise over 50 ISWAP terrorists in Damboa",
    "summarized_story": "The Nigerian Army said troops of Operation Hadin Kai, inflicted heavy losses on Islamic State West Africa Province (ISWAP) terrorists.\nThe army said that more than 50 of the terrorists died in the encounter in Damboa, Borno.\nHe said the troops successfully defeated the attack, destroyed the locally fabricated armoured-plated vehicles and neutralised more than 50 ISWAP terrorists.\nHe said that the surviving terrorists were forced to run in disarray under heavy gun fire from the resilient troops and Nigerian Air Force attack platforms.\n“The COAS restated the commitment of the Nigerian Army in his leadership to ending terrorism and other violent crimes in the North East and the rest of the country."
  },
  {
    "headline": "If you want another war, Nigerian Govt is ready – Northern Senator warns Southeast",
    "summarized_story": "“I don’t even believe in zoning.\nI believe the right candidates should be fielded by all the parties and then let Nigerians choose from the best among them.\nUnless you don’t want that which is against the norms of democracy, then, I don’t know, you can devise your own means.\n“I don’t believe zoning is democratic.\nI don’t believe zoning will produce the best president for this country.”"
  },
  {
    "headline": "Wike To Rivers Residents: Don’t Let IPOB Scare You With Juju; It Doesn’t Work",
    "summarized_story": "Nyesom Wike, the Governor of Rivers State, has warned locals not to be afraid of members of the Indigenous People of Biafra, or IPOB.\nThis was said by the firey leader on Tuesday while speaking to teenagers in the Ahoada district of the state.\nSecurity agents are still neutralizing IPOB members, he claims, despite all the “juju” they carry.\nAs he puts it:“When people say IPOB, they are carrying Juju, no problem!\nif you don’t repent, the period has come, you will die."
  },
  {
    "headline": "Malami Cries Out, Says He Didn’t Tell Buhari To Suspend Constitution",
    "summarized_story": "The Attorney-General of the Federation and Minister of Justice, Abubakar Malami, has denied advising President Muhammadu Buhari to suspend the Nigerian constitution to be able to tackle the escalating insecurity in the country more effectively.\nAccording to the newspaper, Mr Malami specifically urged the president to suspend the fundamental rights of all Nigerians as guaranteed under Chapter IV of the Constitution.\nMr Malami, according to the report, said the president should issue instruments of emergency and publish them in the federal gazette.\nMr Buhari himself led the country between 1984 and 1985 as a military dictator during which the constitution was put on suspension.\n*Dr. Umar Jibrilu Gwandu*(Special Assistant on Media and Public Relations, Office of the Attorney-General of the Federation and Minister of Justice)"
  },
  {
    "headline": "BREAKING: Many Feared Dead As Robbers Invade Banks, Police Station In Osun",
    "summarized_story": "On Wednesday evening, thieves attacked two new generation banks and a police station in Apomu, the headquarters of Isokan Local Government Area, and Ikire, the headquarters of Irewole Local Government Area.\nThe robbers stormed the two neighborhoods around 6 p.m., shooting intermittently, according to the Nation.\nA resident of Ikire, who simply identified himself as Sola, said: “The robbers came into the community around 5:55pm and were shooting.\n“The robbers attacked two banks and they killed some people.\nThey attacked a police station during the operation.”More details later…"
  },
  {
    "headline": "Insecurity: Wike’s comments spark fresh PDP, APC brawl",
    "summarized_story": "The ruling All Progressives Congress (APC) and the opposition Peoples Democratic Party (PDP) are at ‘war’ over a recent statement credited to Rivers state Governor Nyesom Wike.\nGovernor Wike had berated the APC-led government for poor handling of the escalating violence, killing and other acts of terrorism across the country.\nIn a statement Wednesday in Abuja by the secretary to the APC national caretaker committee, Senator John James Akpanudoedehe, the party insisted the seeds of the insecurity which the APC administration was containing were sown by the PDP administration when it handled the Boko Haram insurgency.\nNigerians cannot risk the country’s future in the hands of the same political party that brought the rot the APC administration is clearing,” Akpanudoedehe stated.\n“As such, any attack on Governor Wike, on this score, is a direct assault on the generality of Nigerians."
  },
  {
    "headline": "Breaking: Gunmen strike Osun communities, attack banks, Police stations",
    "summarized_story": "have confirmed that attacks on two commercial banks and police stations were carried out by some suspected armed robbers in Apomu and Ikire town in Osun State.\nThe spokesperson of Osun Police Command, Yemisi Opalola, further said commercial bank in Apomu, a police station in Ikire, as well as Ikire Area Command of the police were touched by the robbers.\nAccording to reports, the robbers were said to have entered Apomu and Ikire through Ikoyi town and divided themselves into different groups before they launched attack on the police stations and the affected banks.\nAccording to another resident of Ikire, simply identified as Oloruntoyin, the robbers attacked a bank near Akire’s palace, as well as Ayedaade Police Station.\nHe said the robbers later left the town and fled after some local hunters and police operatives engaged them in a gunfight."
  },
  {
    "headline": "Breaking: Senate passes Bill to end HND/BSc dichotomy",
    "summarized_story": "The Senate has passed a bill that prohibits employers in the country from discriminating between first degree and Higher National Diploma (HND) holders.\nThe passage of the bill followed the consideration of a report by the Joint Committee on Establishment and Public Service Matters; and Tertiary Institutions and TETFUND.\nThe Senate President, Ahmad Lawan, in his remarks after the bill was passed, emphasised that the passage of the bill would serve as motivation for polytechnic graduates.\nHe, therefore, called on the public and private sectors to ensure the implementation of the bill’s provisions as soon as it is signed into law by President Muhammadu Buhari.\nI recall that in the House of Representatives between 2003 and 2007, this was one bill that was so important, and is one way of encouraging our Polytechnic graduates."
  },
  {
    "headline": "Air power is a game changer in modern warfare – COAS -NigPilot",
    "summarized_story": "The Chief of Army Staff (COAS), Major General Farouk Yahaya has said that the employment of airpower in modern warfare is the game-changer.\nDirector of Public Relations and Information, Nigerian Air Force, Air Commodore Edward Gabkwet in a statement said that the new Army Chief said this when he paid a courtesy visit to the Chief of Air Staff (CAS), Air Marshal Oladayo Amao at the Headquarters, Nigerian Air Force (HQ NAF), Abuja.\n“The earlier we all recognize that no Service can do it alone, the better for us as an armed force and a nation to surmount the current security challenges,” he said.\nThe COAS also thanked Air Marshal Amao for his continuous support to the Nigerian Army and urged him not to relent.\nThe highlight of the visit was the laying of a wreath by the COAS at the NAF memorial arcade."
  },
  {
    "headline": "Anambra guber: I’ll declare emergency on roads, free education if elected – Orajiaka -NigPilot",
    "summarized_story": "Orajiaka, who stated this Wednesday during an interactive session with journalists at the national headquarters of APC, also promised to declare free education from primary to secondary school levels.\n“First, education from Primary to Secondary level must be qualitative and free.\nI will establish an expanded state security council to which all heads of security agencies including local vigilante groups must belong and hold regular meetings to assess the security situation in the state.\n“Thirdly, I will initiate a health insurance scheme that will cover all indigenes of the state.\nAll over the world, health insurance has become a key driver of the health sector."
  },
  {
    "headline": "PDP condemns killing of Ortom’s Security Adviser -NigPilot",
    "summarized_story": "The national leadership of the Peoples Democratic Party, PDP, has condemned, in very strong terms, the murder of Senior Special Adviser on Security to Benue State Governor, AIG Christopher Dega (rtd), describing it as barbaric.\nThe PDP charged the police to immediately go into action and follow the leads to apprehend and bring the assailants and their backers to justice.\n“As such, any attack on Governor Wike, on this score, is a direct assault on the generality of Nigerians.\nThat also explains why the APC always attack well-meaning Nigerians who seek to unveil their plots.\n“Our party wants the APC to know that while they may gag their own members, they cannot stop other well-meaning Nigerians like Governor Wike from exposing the atrocities and failures of the APC."
  },
  {
    "headline": "Bayelsa Police Command urges criminals to clear -NigPilot",
    "summarized_story": "The Bayelsa State Police Command yesterday cautioned criminals in the State to stay clear of the region or face arrest and prosecution.\nThe Commissioner of police, Mike Okoli in a chat with newsmen at the headquarters, Yenagoa, urged criminals to relocate or turn a new leaf and explore the opportunities that abounds.\nCP Okoli noted that the police under his command have recorded massive achievements through synergy with other security agenciesHe stated that, the Command would continue to carry out its mandate of protecting lives and property through adequate information from the Communities.\nHe said, “Criminals should know that Bayelsa state is not comfortable for them, they should relocate or turn a new leaf, they have opportunities and find something meaningful to do and stay away from crime and criminality."
  },
  {
    "headline": "Twitter’s Mission In Nigeria Is Suspicious, Says Lai Mohammed",
    "summarized_story": "﻿The Minister of Information and Culture, Lai Mohammed has taken a swipe at the US media giant, Twitter, saying its mission in Nigeria is suspicious.\nTwitter’s mission in Nigeria is very suspect, they have an agenda,” he said.\n“The mission of Twitter in Nigeria is very suspicious.\n“And you see when people were burning police stations and killing policemen in Nigeria during ENDSARS, for Twitter, it was about the right to protest.\n“If an organisation is proscribed, it is different from any other which is not proscribed."
  },
  {
    "headline": "Twitter Deletes Buhari’s ‘In The Language They Understand’ Tweet",
    "summarized_story": "Twitter has deleted President Muhammadu Buhari’s tweet where he threatened to treat Nigerians “misbehaving” in “the language they understand”.\nTwitter deleted the message on Wednesday, following widespread condemnation.\n“This Tweet violated the Twitter Rules,” the microblogging site said in place of the deleted tweet.\n“I think (your) language matters when you are a leader and when you are facing many crises because that language can be interpreted in many ways,” Moghalu said during a television interview.\nLai Mohammed Questions TwitterThe Minister of Information, Lai Mohammed in reaction to this questioned Twitter’s rules."
  },
  {
    "headline": "Senate Passes Bill Prohibiting Discrimination Between BSc/HND Holders",
    "summarized_story": "The Senate has passed a bill seeking to prohibit discrimination between the university degree and the Higher National Diploma (HND) certificate holders in the country.\nThe bill was sponsored by Senator Ayo Akinyelure and passed the third reading during Wednesday’s plenary session.\nThe motion was seconded by Senator Sadiq Umar and Senate dissolved into Committee of the Whole to consider the report.\nThe Senate in the Committee of the Whole and Plenary then considered and approved Clauses 1-6 of the bill.\nSenate President Ahmed Lawan while congratulating the House said the bill has been in the process for a long time."
  },
  {
    "headline": "Police Parade 81 Suspected Bandits, Kidnappers Others",
    "summarized_story": "﻿The Nigeria Police Force on Wednesday paraded 81 suspects arrested between April and May 2021.\nAccording to the force spokesman, some of the items recovered from the suspects include 45 assorted riffles, including 17 AK-47, 20 locally made AK-47, and one GPLG.\nMr. Mba assured that the current security challenges facing the country will bring out the best in the force.\nThe mass abduction of students, mostly in the northern part of Nigeria, has also gained traction in the nation.\n“Whoever wants the destruction of the system will soon have the shock of their lives."
  },
  {
    "headline": "Troops Kill Three Suspected Gunrunners, Recover Weapons In Sokoto",
    "summarized_story": "Three suspected gunrunners have been killed with their weapons recovered in a border town in Sokoto State.\nThe operation followed credible information of gunrunners moving weapons on foot from the Niger Republic into Nigeria around 11 pm.\n“The highly vigilant troops mounted a successful ambush along the suspected route close to Garin Naimaimai Village and neutralised the three gunrunners,” the statement partly read.\nItems recovered include RPG bombs and RPG chargers, machine gun, AK-47 assault rifles and other accessories as well as the different caliber of assorted ammunition.\nHe also asked them to “sustain operational in dominating all the illegal routes around the border areas with the Niger Republic to frustrate any movement of weapons and ammunition into the country.”"
  },
  {
    "headline": "Army Chief Harps on Air Power, Synergy for Success of Counter-Insurgency campaign",
    "summarized_story": "The newly appointed Chief of Army Staff (COAS), Major General Farouk Yahaya has reiterated the centrality of air power to the success of the ongoing fight against insurgency, armed banditry and other forms of criminality in the Country.\nHe made this assertion when he paid a courtesy visit to the Chief of Air Staff (CAS), Air Marshal Oladayo Amao at the Headquarters, Nigerian Air Force (HQ NAF), Abuja.\nThe COAS stated that he has always been an advocate of air power employment as a critical requirement of a fighting force having witnessed its formidable influence in various theatres of operations.\nWhile welcoming him to HQ NAF, Air Marshal Amao congratulated the COAS for his appointment and urged him to sustain synergy of efforts by the Nigerian Army and the NAF, in conjunction with other security agencies to rid the Country of all criminal activities.\nHighlight of the visit was the laying of wreath by the COAS at the NAF memorial arcade."
  },
  {
    "headline": "JTF Nabs 10 Suspected Killers Of Security Personnel In Akwa Ibom",
    "summarized_story": "The Joint Task Force(JTF) has arrested 10 persons in connection with the recent killings of security personnel in Essien Udim, Obot Akara, and Ikot Ekpene local government areas of Akwa Ibom state.\nThe arrest followed series of coordinated raids by the JTF including the army, the police, the Department of State Security Services(DSS), and the Nigeria Security and Civil Defence Corps(NSCDC) on locations of criminal elements in the areas.\n”This unacceptable trend of events necessitated the formation of a Joint Task Force (JTF), comprising of the Nigerian Army, the Nigeria Police Force, the DSS and NSCDC.\nHis words: ”Let me sincerely appreciate the immense contribution of the Nigerian Army and other sister Security Agencies.\nOur warm gratitude is also to the Government and good people of Akwa Ibom State”"
  },
  {
    "headline": "Nigerian Military Repels Boko Haram Attack on Damboa, Destroys 6 Gun Trucks",
    "summarized_story": "A fair number of Boko Haram terrorists on Wednesday afternoon were killed by troops of the Nigerian military in Borno State, after a heavy gun fire with Nigerian troops in Damboa town.\nA credible security source disclosed that some of the Boko Haram fighters after the gun fire fled with gun shot injuries.\nAccording to the source, the terrorists invaded Damboa in a convoy of 11 gun trucks and one Armoured Personnel Carrier But their attempt to attack a military formation and civilian population after infiltrating the town was foiled by the military forces.\nAdvertisementAt the moment Normalcy is restored in the area."
  },
  {
    "headline": "Nigeria Government Protests Deletion of Buhari’s Tweet, Says Twitter Can’t Gag President",
    "summarized_story": "Nigeria’s federal government on Wednesday accused the social media giant, Twitter, of double standards in its treatment of issues affecting Nigeria.\nIf Mr. President, anywhere in the world feels very bad and concerned about a situation, he is free to express such views.\nBy whatever name, you can’t justify giving orders to kill policemen or to kill anybody you do not agree with.\n“But I’m saying that you cannot compare anybody with Kanu who boldly say, go and kill policemen.\nHe said: “There are so many people who have been spewing hate against Mr. President, against this governments."
  },
  {
    "headline": "NNPC: $40bn Investments Needed for Nigeria’s Gas Plan",
    "summarized_story": "He added that the figure on the quantum of funds needed is based on the submissions NNPC has received from potential investors.\nIn addition, he stated that about 39 thermal power plants were being targeted as opposed to the current 33.\nHe said: “In terms of benefits, we will generate 45,000 megawatts of power in terms of gas use, creating massive employment and import substitution.\n“There are changes we need to look at to actualise the decade of gas.\nHe stated that if Nigeria will achieve the decade of gas, it must transit to a willing-buyer willing-seller market."
  },
  {
    "headline": "Saka’s First International Goal Secures England Win Over Austria",
    "summarized_story": "England’s countdown to the Euros continued with a narrow win over Austria at Riverside Stadium – but they suffered an injury setback as Liverpool defender Trent Alexander-Arnold limped off late on.\nManager Gareth Southgate saw his experimental side secure victory when Arsenal teenager Bukayo Saka crowned a fine move with an angled finish for his first international goal after 56 minutes.\nAnd as Alexander-Arnold walked gingerly around the pitch with the England medical staff, debutant Ben White cleared off the line from Alessandro Schopf after Pickford’s punch fell to him in the area.\nThe victory means England have won their past seven friendly matches, their best run in friendlies since winning seven in a row under Sir Bobby Robson between June 1985 and May 1986.\nIt was fitting that Saka scored his first international goal, illustrating his value to England, while Jack Grealish produced a man-of-the-match performance that fully deserved the ovation he received when he came off."
  },
  {
    "headline": "“We Cannot Postpone Again,” Says Tokyo 2020 Chief Amid Pandemic Fears",
    "summarized_story": "The president of the Tokyo 2020 organising committee ruled out a cancellation or further postponement of the Olympics as doubts swirled among city governments and medical professionals whether the event can be held safely amid the pandemic.\nA majority of the Tokyo Metropolitan Assembly feel the same way, the Tokyo Shimbun newspaper reported on Thursday.\n“We cannot postpone again,” athlete-turned-politician and organising committee president Seiko Hashimoto said an interview published on Thursday by the Nikkan Sports newspaper.\nTowns and cities set to host Olympic training or events have increasingly expressed misgivings, amid concern visitors will spread variant strains of the virus and drain medical resources.\nAnd in Taiwan, the Chinese Taipei Baseball Association said it was pulling out of Olympic qualifier games in Mexico amid infection concerns."
  },
  {
    "headline": "NASA Plans Two New Missions to Venus, the First in Decades",
    "summarized_story": "NASA on Wednesday announced plans to launch two new scientific missions to Venus between 2028 and 2030 — its first in decades — to study the atmosphere and geologic features of Earth’s so-called sister planet.\nVenus has lately received less scientific attention than Mars, Earth’s next-closest planetary next-door neighbour, and other solar system destinations.\n“We’re revving up our planetary science program with intense exploration of a world that NASA hasn’t visited in over 30 years,” Thomas Zurbuchen, NASA’s associated administrator for science, said in a statement announcing the missions.\nNASA’s Magellan spacecraft, which reached Venus in 1990, made the first global map of the Venusian surface as well as global maps of the planet’s gravity field.\nIn 1994, the Magellan spacecraft was sent to plunge into the surface of Venus to gather data on its atmosphere before it ceased operations."
  }
]