[
  {
    "headline": "South-East govs, leaders meet Buhari’s envoys, list grievances",
    "summarized_story": "A delegation from the Federal Government and leaders from the South-East, on Friday, met behind closed doors to discuss insecurity and other issues affecting the region.\nThe meeting comes less than 24 hours after the President, Major General Muhammdu Buhari (retd.\nIn the meeting that lasted several hours at the Enugu State Government House, the South-East leaders aired several grievances affecting the region, including marginalisation and attacks by herders.\nThe Federal Government’s delegation was led by the Defence Minister, Major General Bashir Magashi (retd).\nWe also informed this delegation that each of the states of South-East has laws in this respect."
  },
  {
    "headline": "Abacha’s regime offered mum so much but she chose the right path for her country –Jamiu, MKO Abiola’s son",
    "summarized_story": "The Kudirat Abiola Sabon Gari Peace Foundation is being established at a time when Nigeria needs peace more than anything else.\nConsidering her fight for democracy during one of the most difficult times in Nigeria’s history, what are some lessons the country can learn today?\nThe Abacha government offered her so much but she chose the right path for her country and herself in the hereafter.\nWhat are your thoughts on the state of democracy in Nigeria with regard to the calls for restructuring?\nThe Lagos State Government has approached the Supreme Court to overturn the Appeal Court verdict on your mother’s death."
  },
  {
    "headline": "How fiancé killed NSCDC officer for ritual, offered N5m –Herbalist",
    "summarized_story": "A native doctor, Rafiu Afolabi, has narrated how Christopher Akpan, the fiancé of an officer of the Nigeria Security and Civil Defence Corps, Josephine Onche, allegedly killed the woman for money ritual.\nAfolabi said he met Akpan when he went to Onche’s house sometime in 2019 to give her some concoctions to avoid late pregnancy after her marriage to Akpan.\nAfolabi said, “In 2019, the late Josephine came to my shrine in company with one man.\n“He (Akpan) later came to my shrine and said that he wanted to use her (Josephine) for money ritual.\nHe came to my house later that night and gave me only N50,000."
  },
  {
    "headline": "DPR shuts alleged adulterated kerosene outlet in Calabar",
    "summarized_story": "The Department of Petroleum Resources (DPR) in Cross River has sealed a retail outlet, Chizioba Ventures, for allegedly selling adulterated kerosene.\nThe outlet, which was shut down by the DPR, is located at number 65, Edgerdley Road in Calabar South.\nA statement on Friday in Calabar signed by the Operations Controller of DPR in the state, Mr George Ene-Ita, warned customers who bought kerosene from the outlet against using it.\nThe release stated that a case of fire explosion was traced to the use of adulterated kerosene which occurred in Calabar South recently.\nREAD ALSO: DPR to establish micro gas distribution centres across Nigeria“The public should take note that the outlet is not registered by DPR, therefore they are operating illegally."
  },
  {
    "headline": "Judiciary: More reactions trail JUSUN strike suspension",
    "summarized_story": "The suspension of the 64-day-old nationwide strike embarked upon by the Judiciary Staff Union of Nigeria, JUSUN, has been received with mixed feelings in Abuja.\nHowever, Chudi Ojuwku, who spent over two decades teaching at the Nigerian Law School shared a different opinion on the benefits of the JUSUN strike.\n“The truth of the matter is that at the end of the day, they have not exactly got the financial autonomy they are demanding.\n“That is what the JUSUN strike has drawn attention to.\nKayode Fayemi of Ekiti, gave this assurance in an interview with journalists after meeting with “stakeholders” from the state judiciary and legislature at the Presidential Villa in Abuja."
  },
  {
    "headline": "Viral Video: We’ll be hard on those spreading falsehood — Niger govt",
    "summarized_story": "The Niger state government has warned those spreading ‘false’ videos of refugees fleeing a camp in Niger state to desist or face the state governent’s wrath.\nHe said, “Our attention has been drawn to a video of a number of fleeing people believed to be refugees purported to be fleeing from Rijau.\nWe investigated the origin of the video and discovered that it is not from Nigeria.\n“As Niger state, and the entire country is experiencing a security challenge, some unscrupulous characters have decided to chance upon the situation as an opportunity for mischief and political profit.” He said.\n“To the characters responsible, know that, firstly, God is in the know of your machinations and would judge you accordingly."
  },
  {
    "headline": "JUNE 12: We’re not aware of planned protest in Lagos — Police",
    "summarized_story": "The Police Command in Lagos State says it is not aware of any planned protests by any group/groups on June 12 Democracy Day.\nThe command has also assured residents of safety during the June 12 celebrations.\nThe News Agency of Nigeria (NAN) recalls that controversy trailed the planned nationwide protests called by some activists in the country over challenges in the nation.\nNAN, however, recalls that the National Association of Nigeria Students (NANS) on Wednesday, announced the withdrawal of participation from the planned protests, citing security reasons for it.\nOdumosu said that the public should disregard such directives by organisers of the alleged protest for people to stay at home during the protest."
  },
  {
    "headline": "Passage of High Chief Joshua Makanjuola Babalola, The Olotuare Of Iju Kingdom",
    "summarized_story": "High Chief Joshua Gbadurabi Makanjuola Modurotoluwa Babalola, more popularly known and called Chief Joshua Makanjuola Babalola was born on Friday.\n12th February, 1932, at Iju in the present day Akure North Local Government Area of Ondo State to Pa. Michael Alayun- Babalola and Madam Leah Mojotade Babalola, both of blessed memory.\nChief Babalola started his working career as a Sales Clerk at the CMS Bookstores, Lagos from 1952 to 1954.\nHe was at one time the President of IJU Youth Movement and later, IJU Progressive Union (IPU ).\nIn 1989, he was appointed by His Royal Majesty – OBA Amos Farunkanmi, The Okiti of IJU as OLOTUARE OF IJU – Head of the IARE group of Chiefs in IJU."
  },
  {
    "headline": "June 12: Don’t protest – Gov Abiodun begs Ogun residents as protesters begin mobilization",
    "summarized_story": "As the nation celebrates June 12 as Democracy Day, Governor Dapo Abiodun has urged residents of Ogun State not to join any protest.\nGov Abiodun feared that resorting to protest could breed violence, saying such protests could be hijacked by those he called hoodlums and enemies of democracy, harbouring ulterior motives.\nIn a statement made available to DAILY POST by his new media aide, Emmanuel Ojo, the governor charged Ogun people to celebrate June 12 peacefully.\nThis, he said, became necessary to avoid any act that could threaten the security of the State and the nation at large.\nOur correspondent gathered that the protesters from the three senatorial districts of Ogun State have agreed to converge on the NUJ Secretariat, Iwe-Iroyin, Abeokuta by 7am."
  },
  {
    "headline": "Twitter ban: Malami makes u-turn on threat to prosecute violators",
    "summarized_story": "The Attorney-General of the Federation and Minister of Justice, Abubakar Malami, has now made a u-turn, insisting the Federal Government will not prosecute Nigerians using Twitter.\nInstead, it will go after those who are helping Nigerians circumvent the ban on the micro-blogging site.\nMalami had purportedly directed the Director of Public Prosecution (DPP), to begin the process of prosecuting those still tweeting.\nHowever, the AGF has now told Vanguard, that Nigerians have a right to tweet from anywhere in the world.\nHe said: “It is within their guaranteed fundamental right to tweet from anywhere in the world."
  },
  {
    "headline": "Anger as Buhari sees ”all Igbo as IPOB,” vows to unleash army, police on Southeast",
    "summarized_story": "A section of Nigerians have expressed their anger over President Muhammadu Buhari’s recent comments concerning the South East region.\nThe President’s comments, as DAILY POST observed, has increased fear, tension and uncertainty in the South East region.\nAnd responding to the briefing, President Buhari made some vows and also reminded the Igbo of the ugly stories of the 1967-1970 civil war.\n“Put differently, Buhari referred to the entire South East as IPOB.\nSee, the truth is, this presidency is not friendly with the South East."
  },
  {
    "headline": "Democracy Day: Buhari govt ‘clueless’",
    "summarized_story": "You may begin a fight, but you can’t determine how it would end because you are not God.\n“ If you can’t say a thief is a thief and stand by it, then we are only deceiving ourselves because we are as bad the people we are talking about.\nThat is why I keep saying, ‘our mumu never do, but ‘e be like say for many people, na follow come.\nWe have people with no pedigree, people from the gutter, and you can’t give leadership to those kinds of people.\nWe need a lot of serious thinking.”Imo police foils alleged plot to raze Charlyboy’s father’s house"
  },
  {
    "headline": "Tension as herdsmen allegedly target more local govts in Oyo",
    "summarized_story": "Police said that the officers were deployed due to alleged invasion of some areas by suspected herdsmen.\nOur correspondent gathered that some residents of Ibadan had been in panic over alleged invasion of some local government areas by suspected Fulani herdsmen since Monday.\n“We saw some Fulani herdsmen with dangerous weapons around Asejire River around 12pm yesterday (Monday).\n“It was glaring that the herdsmen were being pursued by some people and the herdsmen were ready to attack anyone on sight.”He said that the Fulani herdsmen were more than twenty (20).\n“Consequent upon this, Oyo State Police Command wishes to refute these unfounded tales, aimed at promoting panic, apprehension and instigating violence in the state."
  },
  {
    "headline": "Euro 2020: Italy dominate Turkey 3-0",
    "summarized_story": "ITALY could not have asked for a stronger start to Euro 2020, dominating Turkey for a 3-0 victory with a Merih Demiral own goal, Ciro Immobile and Lorenzo Insigne.\nThis was not just the opening game for the Azzurri, but also for Euro 2020, preceded by an opening ceremony that included Nessun Dorma sung by Andrea Bocelli.\nADVERTISEMENTMarco Verratti was out with a knee problem, after Stefano Sensi and Lorenzo Pellegrini pulled out of the competition with muscular issues.\nLorenzo Insigne curled wide, then Ciro Immobile had his shot charged down by a hand, but it was in a natural position.\nImmobile aimed a header just wide of the back post, with Immobile and Leonardo Bonucci attempts, then the Lazio striker’s shot was straight at the goalkeeper."
  },
  {
    "headline": "Adekuoroye wins gold at Poland Open",
    "summarized_story": "By Olalekan OKUSANODUNAYO Adekuoroye showed the world what she aims to achieve at next month’s Tokyo 2020 Olympic Games after she claimed gold medal in the women’s 57kg at the Poland Open Ranking Series in Warsaw.\nAfter edging out some of the finest wrestlers in the world, Adekuoroye was awarded the gold after her Belarusian opponent Iryna Kuraurachkina forfeited the final match following injury she sustained during her semifinal fight.\nIn the quarter final match against world and Olympic champion American Helen Maroulis, the Nigeria champion avenged her two previous losses as she chalked out a shutout 13-0 win over Maroulis.\nAdekuoroye dominated the bout beating her opponent with a minute and 32 seconds remaining.\nUnfazed by her opponent’s stardom, Adekuoroye paced the bout and both wrestlers waited for an opening for the first two minutes of the bout."
  },
  {
    "headline": "57 killed, many injured in fresh bandits' attack in Zamfara",
    "summarized_story": "By Sani Muhammad Sani, GusauNot fewer than 57 persons were killed in a fresh attack unleashed by cattle rustlers on residents of Magarya ward, Kadawa community, Zurmi Local Government Area, Zamfara State between Thursday evening and the early hours of Friday.\nA resident of the community disclosed that the cattle rustlers killed only men with no intention to hurt women and children.\nAfter the attack in Kadawa, the rustlers went through a number of villages including Jinkirawa, rustling cows without killing anyone.\nThe Public Relations Officer of Zamfara State Police Command, Muhammad Shehu, a Superintendent of Police, could not be reached for comments as several calls made to his phone went unanswered.\nIn similar vein, the Zamfara State governor, Bello Muhammad Matawalle, has called on the people of the state not to fold their arms and watch their loved ones killed but find ways to defend themselves."
  },
  {
    "headline": "We will deal with terror financers — Buhari",
    "summarized_story": "By Alao AbiodunPresident Muhammadu Buhari has stated that anybody caught financing terrorism will be dealt with by his administration.\nHe stated those sponsoring terrorism use their resources gathered over the years to disturb his administration.\nBuhari spoke in an exclusive interview with NTA News on Friday monitored by The Nation.\nLet them speak to the governors, political leaders, traditional leaders and very importantly let them speak to the youths,” he said.\nBuhari stated that it is in the interest of youths to make Nigeria secure because burning institutions, factories won’t provide them job and investors won’t approach the country."
  },
  {
    "headline": "Court sacks PDP EXCO in Anambra",
    "summarized_story": "By Eric Ikhilae, AbujaA High Court of the Federal Capital Territory (FCT) in Maitama, Abuja, has sacked the state and local government executive councils (EXCOs) of the Peoples Democratic Party (PDP) in Anambra State.\nAdeniyi gave the order sacking the EXCOs in a judgment on a suit marked: HC/CV/774/2021 filed by Samuel Anyakolah (for himself and all local government chairmen and ward executives that emerged from the Anambra PDP congress conducted on November 28 and December 1, 2017 under the supervision of Sir Chukwudi Umeaba, as Acting Chairman State Caretaker Committee).\nListed as defendants in the suit are the PDP, Chief Ndubisi Nwobu and Barr.\nAnyakolah claimed that the PDP arbitrarily imposed state chairmen, Exco members and local government chairmen and national delegates on members in its Southeast zonal congress of March March 6, 2021.\nHe contended that the congress was held in disregard of an extant list of already inaugurated party officers and delegates that emerged from the Anambra PDP congresses conducted on November 28, 2017 and December 1, 2017 validated by Senator France Bent Ward Congress Appeal Panel report and Barrister Ukpai Ukairo Local Government Appeal Panel report."
  },
  {
    "headline": "I’m lazy in bed –Eka Duke",
    "summarized_story": "For Nollywood actress, Eka Duke, being good in bed is a natural gift; it has nothing to do with where you come from.\nAs a matter of fact, Duke is against the notion that Calabar girls like her have special prowess in sex matters.\nAccording to the microbiology graduate, being good in bed is nothing but a gift; it has nothing to do with being Calabar girl.\n“It is generally assumed that Calabar girls are very good in bed and also good at taking care of their men.\nAs for me, I’m very lazy in bed."
  },
  {
    "headline": "June 12: Embrace democratic virtues, Kalu tells political class",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has called on the political class to demonstrate and uphold the tenets of democracy in all endeavours.\nCommending the President Muhammadu Buhari-led Federal Government for its concerted efforts in repositioning the country, Kalu stressed that the President has built critical infrastructure across the nation.\nIn a goodwill message in commemoration of this year’s democracy day, Kalu commended Nigerians for embracing democracy, adding that the country has benefited from the dividends of democracy.\n“The political class, regardless of party affiliations, should support the president’s agenda of building a prosperous Nigeria.\n“The political class should emulate the qualities of the late Chief M.K.O Abiola, who was a widely accepted business mogul and political leader beyond the shores of Africa."
  },
  {
    "headline": "Igangan massacre: Yoruba elders, groups blast Buhari for keeping mute",
    "summarized_story": "Secretary-General of YCE, Dr. Kunle Olajide, told Saturday Sun: “The two projects that President Buhari came for in Lagos on Thursday were worth it.\nComing to Lagos, he should have made comments on the Igangan massacre.\nPresident Buhari should have made comments on the Igangan massacre, especially when he was in Lagos on Thursday.\nThis is an affirmation that President Buhari is president of the North.\nAdegoke, in a separate interview, said: “It was expected that the President would commiserate with the victims of violence in different parts of Nigeria, Igangan inclusive."
  },
  {
    "headline": "Military action in South East: We’ll fish out, arrest, jail troublemakers – Buhari",
    "summarized_story": "President Muhammadu Buhari last night reiterated his government commitment to hunt down perpetrators of crimes and acts of violence in the South East states.\n“They should go to Sokoto, Zamfara, and Katsina and find out from the police and the military how they operate.\nThose who are going about in this country know that this administration has tried in terms of rehabilitating the roads, railway and power.\nThose who are critiquing this administration should do that objectively.”On why he came out so early to declare that he wouldn’t spend a day longer after the termination of his administration, President Buhari said: “I hate fraud in any form.\n“The second term, I went to every state in 2019 and I made a remarkable observation."
  },
  {
    "headline": "National democracy day broadcast: I’m committed to free, fair election –Buhari",
    "summarized_story": "The President who gave this assurance in a Democracy Day broadcast to mark six years of his administration reeled out his achievements with a promise to do more.\n“I join you all today to commemorate and celebrate our Democracy Day,” he said, in the nationwide broadcast relayed to Nigerians through national radio and TV stations.\n“It is a celebration of freedom and a victory for one people, one country and one Nigeria.\nI also share the pains of families and direct victims of ransom-seeking, kidnaped victims who went through unimaginable trauma in the course of their forced imprisonment.\nI thank you for your patience and attention and more importantly your resolve to join hands in making Nigeria the country of our dream.”"
  },
  {
    "headline": "Insecurity: In Search of Solution, FG Delegation Parleys South-east Govs",
    "summarized_story": "The Defence Minister, Magashi, disclosed that the delegation would relay the commitment reached at the parley and other outcomes of the consultation to President Muhammadu Buhari.\nHe added that the meeting agreed that there were fundamental issues that needed to be addressed in the South-east region.\n“Those who dish out hate speeches from our region, threat of violence or secession do not speak for South East.\nI repeat, we the South-east people are not for secession, we don’t support it; we don’t call for it.\n“We condemn the killings of security men and innocent people in the South-east and the governors are doing everything possible to ensure the safety of our people."
  },
  {
    "headline": "Senate President: Nigeria Needs Twitter Just as Twitter Needs Nigeria",
    "summarized_story": "Our belief is that Nigeria needs Twitter just as much as Twitter needs Nigeria.\n“We believe that the matter between Twitter and the federal government of Nigeria will be resolved.\nExplaining why the National Assembly shouldn’t be described as rubber stamp, Lawan said: “This is a regular music.\nBy the grace of God, I am 22 years in the National Assembly.\n“The National Assembly passed the state assemblies’ autonomy but what happened?"
  },
  {
    "headline": "There is Need for Special Court to Try Corruption Cases, Says Buhari",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has stressed the need for the establishment of special courts to try corruption cases in Nigeria.\nThe President who spoke while answering questions from the Nigerian Television Authority (NTA) reporter on Friday night said it was high time special courts were established in the country especially to try several corruption cases currently in conventional courts.\nHis words: “You have instances of cases lasting for as long as 10 years before they are determined and in some cases judges handling the cases may die.\nBut if there are special courts, there will be a time frame to conclude the corruption cases and not dragging on unnecessarily”.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Denies Pampering Bandits",
    "summarized_story": "Udora Orizu in AbujaPresident Muhammadu Buhari on Friday faulted the insinuations in some quarters that he was pampering bandits and terrorists while dealing with agitators ruthlessly.\nBuhari stated this while responding to a question during an exclusive interview with NTA, monitored by THISDAY.\nWhile describing the accusation as unfair, the President said he was also treating bandits and insurgents in the “language they understand.”Details later…..Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Delay in Delivery of Aircraft, Tanks Hampering Fight against Insecurity",
    "summarized_story": "Udora Orizu in AbujaPresident Muhammadu Buhari on Friday, said the delay in the delivery of aircraft, tanks and other military hardware ordered from foreign countries by the federal government, was hampering the administration efforts to address insecurity and insurgency.\nBuhari stated this while responding to a questions during an exclusive interview with NTA, monitored by THISDAY.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Nigerians Are Forgetful, Says Buhari",
    "summarized_story": "President Muhammadu Buhari has described some Nigerians as ungrateful for failing to appreciate that his administration is doing so much with little resources.\nBuhari disclosed this on Friday evening during an interview aired on NTA.\nPresident BuhariThe President slammed Nigerians, saying they are very forgetful of the achievements of his regime in the last six years.\nHe said, “Nigerians, I think, are very forgetful.\nI am very pleased that the majority of Nigerians think that this administration, under the circumstances, are doing their best but people who misappropriated funds are elected members, either at state or federal level."
  },
  {
    "headline": "BREAKING: Nigerians Are Forgetful, Says Buhari",
    "summarized_story": "President Muhammadu Buhari has described some Nigerians as ungrateful for failing to appreciate that his administration is doing so much with little resources.\nBuhari disclosed this on Friday evening during an interview aired on NTA.\nPresident BuhariThe President slammed Nigerians, saying they are very forgetful of the achievements of his regime in the last six years.\nHe said, “Nigerians, I think, are very forgetful.\nI am very pleased that the majority of Nigerians think that this administration, under the circumstances, are doing their best but people who misappropriated funds are elected members, either at state or federal level."
  },
  {
    "headline": "EXCLUSIVE: Buhari-led Government To Pay Nigerian Students' Leader, Asefon N40million To Mobilise Thugs, Disrupt June 12 Protests",
    "summarized_story": "The Muhammadu Buhari-led government has concluded plans to pay the President of the National Association of Nigerian Students (NANS), Sunday Asefon N40 million to mobilise thugs in major cities and disrupt the planned June 12 Democracy Day nationwide protest, SaharaReporters has gathered.\n“Asefon then told him he is the original President with the structure of the students’ body.\nHe said they will initially join the rally and later disrupt it,” a source had told SaharaReporters.\nCivil society organisations and human rights activists have called for a nationwide protest on June 12 against the Muhammadu Buhari-led administration.\n“The money was to compensate him for calling off his planned protest and also mobilise thugs in major cities with police cover to unleash terror on genuine protesters tomorrow."
  },
  {
    "headline": "EXCLUSIVE: Buhari-led Government To Pay Nigerian Students' Leader, Asefon N40million To Mobilise Thugs, Disrupt June 12 Protests",
    "summarized_story": "The Muhammadu Buhari-led government has concluded plans to pay the President of the National Association of Nigerian Students (NANS), Sunday Asefon N40 million to mobilise thugs in major cities and disrupt the planned June 12 Democracy Day nationwide protest, SaharaReporters has gathered.\n“Asefon then told him he is the original President with the structure of the students’ body.\nHe said they will initially join the rally and later disrupt it,” a source had told SaharaReporters.\nCivil society organisations and human rights activists have called for a nationwide protest on June 12 against the Muhammadu Buhari-led administration.\n“The money was to compensate him for calling off his planned protest and also mobilise thugs in major cities with police cover to unleash terror on genuine protesters tomorrow."
  },
  {
    "headline": "There Is Nothing Good To Learn From June 12, 1993 Elections—Tanko Yakasai",
    "summarized_story": "Yakasai noted that despite the huge national resources committed to that election, it was surprising that the election was annulled.\nIn an interview with SaharaReporters, Yakasai said, “In my honest opinion, June 12 has nothing to do with democracy.\nSo, there is no lesson to learn except that from that time on, we have been experiencing inconclusive elections in the country.\"\nWhen asked about President Muhammadu Buhari declaring June 12 as the democracy day, Yakasai said, “He is the President.\nHe can take whatever decision he wishes to take but I do not see the relevance of June 12 (an inconclusive election) to democracy."
  },
  {
    "headline": "Buhari: After buses were burnt during #EndSARS, I told Sanwo-Olu to tell Lagosians to walk",
    "summarized_story": "President Muhammadu Buhari says he told Babajide Sanwo-Olu, governor of Lagos, to tell residents of the state to “walk” after buses were burnt during the #EndSARS protest.\nFollowing the incident, Sanwo-Olu had paid a visit to Buhari with a photo album of the destruction recorded in the state during the protests.\nSpeaking in an interview with the Nigerian Television Authority (NTA) on Friday, Buhari said he told the Lagos governor that the federal government didn’t have the funds to replace the burnt buses.\nThe previous governor of Lagos state bought 200 buses to complement the transportation in Lagos.\nI took the album, put it in my archives and I told him to tell the Lagosians to walk, because we don’t have the money."
  },
  {
    "headline": "Buhari: After buses were burnt during #EndSARS, I told Sanwo-Olu to tell Lagosians to walk",
    "summarized_story": "President Muhammadu Buhari says he told Babajide Sanwo-Olu, governor of Lagos, to tell residents of the state to “walk” after buses were burnt during the #EndSARS protest.\nFollowing the incident, Sanwo-Olu had paid a visit to Buhari with a photo album of the destruction recorded in the state during the protests.\nSpeaking in an interview with the Nigerian Television Authority (NTA) on Friday, Buhari said he told the Lagos governor that the federal government didn’t have the funds to replace the burnt buses.\nThe previous governor of Lagos state bought 200 buses to complement the transportation in Lagos.\nI took the album, put it in my archives and I told him to tell the Lagosians to walk, because we don’t have the money."
  },
  {
    "headline": "Buhari: Nigerians are very forgetful -- those accused of corruption still win elections",
    "summarized_story": "President Muhammadu Buhari says Nigerians are forgetful, considering that persons accused of corrupt practices still win elections.\n“Nigerians, I think, are very forgetful.\nI’m very pleased that the majority of Nigerians think that this administration, under the circumstances, are doing their best.\nBut people who misappropriated funds, a lot of them were elected members whether at the state or federal level.\nReally, if you try to work out their legitimate salaries, vis-à-vis their expenditure, you will be embarrassed.”"
  },
  {
    "headline": "Buhari: Nigerians are very forgetful -- those accused of corruption still win elections",
    "summarized_story": "President Muhammadu Buhari says Nigerians are forgetful, considering that persons accused of corrupt practices still win elections.\n“Nigerians, I think, are very forgetful.\nI’m very pleased that the majority of Nigerians think that this administration, under the circumstances, are doing their best.\nBut people who misappropriated funds, a lot of them were elected members whether at the state or federal level.\nReally, if you try to work out their legitimate salaries, vis-à-vis their expenditure, you will be embarrassed.”"
  },
  {
    "headline": "My administration hasn't done very badly, says Buhari",
    "summarized_story": "President Muhammadu Buhari says his administration has “not done very badly”, since it came in 2015.\nThe president asked Nigerians to be fair to his administration in making judgement, adding that people should consider what was being produced in terms of crude before his administration came into power.\n“I want Nigerians to be fair to this administration.\nThe previous administration before we came was producing 2.1 million per day at 100 American dollars per barrel.\n“I will like Nigerians to reflect on these in terms of resources and time, and I believe that we have not done very badly.”"
  },
  {
    "headline": "MultiChoice is increasing its stake in BetKing for $281.5 million",
    "summarized_story": "Seven months after taking up an initial 20% stake in BetKing, South African pay TV operator MultiChoice plans to increase its shareholding in the online gambling company to 49% in a $281.5 million deal.\nBetKing is the trading name of Blue Lake Ventures Limited, a pan-African sports betting and entertainment business with major operations in Nigeria.\nThe value of MultiChoice’s initial investment in BetKing was said to be worth more than $100 million.\nBetKing’s annual statement for the financial year ended December 2020 shows a growth in revenue to $77.9 million, from $54.7 million in the previous year.\nYet, Africa accounts for only 2% of global sports betting revenue."
  },
  {
    "headline": "Nigeria’s Central Bank to launch digital currency before 2022",
    "summarized_story": "Nigeria may pilot an official digital currency in 2021, going by the words of Rakiyat Mohammed, a Central Bank Director in charge of the Information Technology Department, who revealed on Thursday that the banking regulator will soon launch a digital currency.\nA Central Bank Digital Currency (CBDC) represents a country’s official currency in digital form.\nAccording to the CBN director, about 80% of central banks in the world are currently exploring the possibility of issuing central bank digital currency and Nigeria could not be left behind.\nLast year, the Bahamas launched the world’s first central bank digital currency.\nWhen it eventually becomes operational, the digital currency will complement the existing forms of currency in the country and could help reduce the high cost of managing and transferring cash."
  },
  {
    "headline": "What is a VPN and how does it work in Nigeria?",
    "summarized_story": "On the internet, different computers send and receive information between Internet Protocol (IP) addresses.\nBefore turning on my VPN, my device was in Lagos, NigeriaAfter turning on my VPN, my device is in Santo Domingo, Dominican RepublicThe images above show how my location changed from Nigeria to Dominican Republic after turning on my VPN.\nNo monitoring: As we mentioned earlier, your internet service provider (ISP) can see your internet traffic and probably log your browsing history.\nWhat is the difference between a VPN app, a VPN plugin, and a VPN browser?\nAlso, some sites and services look at VPN traffic as suspicious and won’t let you connect."
  },
  {
    "headline": "TECNO CAMON 17 Pro: A Creative Nod to the Selfie and the Selfie Culture",
    "summarized_story": "A few weeks back, TECNO launched the TECNO CAMON 17 Pro smartphone, focusing on the selfie with a 48MP AI selfie camera and 90 Hz super-high refreshing rate at 6.8-inch FHD Screen.\nSo, today, I am going to be sharing the things I love about the Camon 17 Pro.\nThe selfie camera of the Camon 17 Pro is one of the highlights of the phone.\nCamera LAB – The TAIVOS™ Imaging LaboratoryThe TECNO CAMON 17 Pro comes with trademarked TAIVOS technology.\nFurthermore, the TECNO CAMON 17 Pro comes with fast charging so, the TECNO CAMON 17 Pro will be ready to leave when you are."
  },
  {
    "headline": "Fostering Gender Inclusion in Technology with the Bolt Drive4WITech Initiative",
    "summarized_story": "The journey into tech for women in Africa is an ongoing discussion largely influenced by cultural norms and societal expectations concerning gender.\nBolt, an inclusive mobility company, recognises this and as part of efforts to drive participation and inclusion for women in technology, launched the #Drive4WITech (Drive for Women in Tech) initiative to support young women in Africa.\nQ: Among the many applications received, you were selected to intern with Bolt in the #Drive4WITech initiative.\nOluwakorede: I supported the marketing team at Bolt Nigeria.\nI am more equipped to confidently make significant contributions to my future work team."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Increase in fintech app installations, Apple Health new features, Plentywaka partners with GUO",
    "summarized_story": "Today, I’m discussingIncrease in fintech app installationsApple Health features for the elderlyPlentywaka partners with GUOIncrease in fintech app installations in Nigeria, South Africa, and KenyaThe global fintech industry recorded impressive growth in 2020.\nThe report reveals that beyond funding, fintech app installations grew by160% in the last quarter of 2020.\nSimilarly, Kenya saw 100% growth, and South Africa 52% growth, in fintech app installations.\nThe economic effects of COVID-19 led to the rise in fintech app installations.\nSource: PlentyWaka TwitterPlentywaka, a Nigerian bus-hailing tech company, has announced its partnership with interstate bus company, GUO Transport, to expand its reach."
  },
  {
    "headline": "An insight into how Texas-based VC, Sputnik ATX, invests in African startups",
    "summarized_story": "In May 2021, CribMD, a Nigerian healthtech startup, closed a $2.6 million seed round led by US-based venture capital firm, Sputnik ATX.\nTell us how Sputnik ATX came aboutMy business partner, Oksana Malysheva, and I founded ATX in 2017 after we had managed a fund together.\nWe founded Sputnik ATX so that we could do that.\nWhat does VC investment mean to Sputnik ATX?\nTell us what market(s) Sputnik ATX is interested in and why?"
  },
  {
    "headline": "#TechpointDigest 100th edition, More on #TwitterBan, iOS, Android’s new features",
    "summarized_story": "Good day,Today marks the 100th edition of Techpoint Digest, Techpoint Africa‘s daily newsletter.\nMention two.”On a non-Twitter related note, Apple has announced the new features coming to its new iOS 15.\nThe event, dedicated to software, is held annually to showcase new features coming to operating systems across Apple’s ecosystem.\nAnother interesting feature coming to the new iOS is Live Text.\nWhat else I’m readingHow to install the developer beta of iOS 15."
  },
  {
    "headline": "President Buhari’s imposition of bans and effects on Nigerian economy",
    "summarized_story": "The current administration led by President Muhammadu Buhari was six years in office as of May 29 2021.\nFrom inception to date, there have been a number of policies implemented by President Buhari which deserve to be appraised from the angle of the cost-benefits analysis.\nOne of these policies is the current administration’s preference for…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Young Nigerians are losing their voice in a tainted democracy",
    "summarized_story": "I was carrying out a test of what democracy meant to young Nigerians and there I got my answer.\nAcross the world, the pandemic led governments to take away their citizens’ freedoms and suspend civil liberties.\nThe unprecedented suspension of individual freedoms, at least in countries where liberty prevailed before the pandemic, accounts for the sharp democratic regression recorded in the 2020 Democracy Index.\nNigeria’s democracy suffers under BuhariNigeria’s democracy index score declined to 4.10 in 2020 from 4.12 in 2019.\nThe deafening silence of Nigerians amid the country’s economic realities should be an indictment of its democracy, but it doesn’t seem to be, at least not yet."
  },
  {
    "headline": "Parents’ retirement plan in jeopardy as youth unemployment worsens",
    "summarized_story": "Four in every 10 Nigerian parents depend on their children to meet their needs when they are old and cannot work.\nThe problem with that is that their retirement plan may be in jeopardy as unemployment in Africa’s most populous nation rose to its highest in at least 13 years and the world’s second-highest in…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Why Ibori Loot may not be returned to Delta",
    "summarized_story": "The controversy over the ownership of the £4.2 million Ibori loot lingers as the federal government insists the recovered money will be used for specific projects and will not be returned to Delta State from where the money was stolen.\n“It was one particular fund that came in the course of investigation by federal authorities then… about $15 million in 2012,” he said, insisting that Delta State never denied this money (Ibori loot) was missing from its purse.\nMr Ibori was governor of oil-producing Delta State from 1999 to 2007.\nADVERTISEMENTEFCC Vs IboriThe EFCC instituted a 170-count charge of money laundering against Mr Ibori, which was struck out by Justice Marcel Awokulehin.\nDuring the hearing of the case, the Delta State Government asked that the $15 million bribe be returned to the state."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Ban: Twitter expresses readiness to open discussions with Nigerian govt",
    "summarized_story": "OBINNA EZUGWUSocial media platform, Twitter, has said it informed the Nigerian government that it’s ready for an open discussion to address mutual concerns and see the microblogging service restored.\nThe comments of the American company comes two days after information minister Lai Mohammed said Twitter had reached out to discuss the possibilities of lifting the ban, without giving further details..“Today marks it one week sine Twitter was blocked in Nigeria, We have informed the Nigerian government that we are ready to meet for an open discussion to address mutual concerns and see the service restored,” Twitter Public Policy said in a statement.\nIt added further that, “we remain advocates for the free and #OpenInternet everywhere"
  },
  {
    "headline": "We’re committed to one Nigeria where there is justice, equity, equality – Igbo leaders",
    "summarized_story": "OBINNA EZUGWUThe leaders of the South East geopolitical zone have reaffirmed their commitment to the sustenance of a united Nigeria where there is justice, equity and equality of all Nigerians.\nThe leaders stated this today after their meeting with representatives of the Federal Government held at the Government House, Enugu.\nSpeaking through the Chairman of the South East Governors’ Forum, Governor Dave Umahi of Ebonyi State, the South East leaders stated clearly that the people of the South East are not disposed to secession from Nigeria because no other tribe has demonstrated belief and commitment to the unity of the country more than our people.\nThe leaders also condemned the unjustified attacks on security formations in the region and assured that another meeting of the leaders will hold later this month after which the leadership of Ndigbo will meet with the President.\nAll the Governors of the South East were present, except for Anambra State which was represented by the Deputy Governor."
  },
  {
    "headline": "Osun Civil Societies Coalition to Celebrate June 12",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun Civil Societies Coalition in Osun State will tomorrow celebrate June 12 as Nigeria Democracy Day.\nThe Chairman of the occasion, according to the statement, is Comrade Hassan Sunmonu, former Chairman of the Nigeria Labour Congress (NLC).\nThe Civil Societies Coalition will also use this year’s June 12 celebration to renew the call for true Federalism and provision of adequate security for lives and property of the entire citizens of the country.\n“We believe that only true federalism which is coming in the name of Restructuring can address the challenges facing Nigeria as a country.\nThe current government structure is responsible for the myriad of problems which is choking the country’s development,” the statement said."
  },
  {
    "headline": "June 12: US asks citizens in Nigeria to avoid protest grounds",
    "summarized_story": "The United States embassy in Nigeria has advised its citizens to avoid the protest grounds across major cities in the country ahead of the planned protest by different groups on Saturday, June 12.\n“Several groups have announced their intentions to protest nationwide on June 12, Democracy Day,” the embassy said.\nIn Lagos, the likely locations for protests will be Lekki Toll Gate and Gani Fawehinmi Park.\nCalls for the protests suggest they may begin as early as 07:00 a.m.”Advising on actions to take by its citizens in the country over the planned nationwide protest, the US said, “Avoid the areas of the demonstrations.\nKeep a low profile.”In case of any emergency, the statement added that the citizens could contact their offices in Lagos and Abuja, the nation’s capital."
  },
  {
    "headline": "Hukumar Samar Da Ayyuka Ta Kasa Ta Horas Da Matasa 50 A Bauchi Sana’o’in Dogaro Da Kai",
    "summarized_story": ""
  },
  {
    "headline": "Mun Gamsu Da Ayyukan Gwamnatin Jihar Legas – Imam Akurede Fulawa",
    "summarized_story": ""
  },
  {
    "headline": "Gwamnan Zamfara Ya Ba Al’ummar Umarnin Kare Kasu Daga Harin “Yan Ta’adda",
    "summarized_story": ""
  },
  {
    "headline": "Sarakuna Na Da Gagarumin Rawar Takawa Wurin Kawo Gyara Kan Tabarbarewar Tsaro",
    "summarized_story": ""
  },
  {
    "headline": "Al’ummar Karamar Hukumar Sabon Gari Sun Yaba Da Ayyukan Hon. Garba Datti Babawo",
    "summarized_story": ""
  },
  {
    "headline": "NSCDC CG pledges commitment to enhance security in North East —",
    "summarized_story": "The Commandant General (CG), Nigeria Security and Civil Defence Corps (NSCDC), Ahmed Abubakar, has reiterated the commitment of the corps to enhancing security in the North East.\nAbubakar stated this on Friday, in Maiduguri, at the opening ceremony of the first security empowerment workshop for personnel of the corps.\nAbubakar said the workshop, which has as its theme: “Boosting the morale and capacity of NSCDC officers for improved performance’’, was inaugurated in the north east for strategic reasons due to the security situation in the zone.\n“That we are inaugurating this workshop in the Northeast region, is strategic, considering the prevailing security situation in this region.\nHe lauded Zulum for his sustained support to the corps, particularly in the provision of vehicles, security equipment and office accommodation."
  },
  {
    "headline": "Creative industry will continue to get attention of Lagos Govt...",
    "summarized_story": "The Lagos State Commissioner for Tourism, Art and Culture, Mrs Uzamat Akinbile-Yussuf, on Friday restated the commitment of the Lagos Government toward ensuring an enabling environment for the creative industry.\nShe said for the creative industry to thrive, it would be given the due attention needed.\nAkinbile-Yussuf said this at the graduation ceremony of the state’s sponsored trainees under the Lagos State Government partnerships with Ebony Life Creative Academy based in Lagos.\n“We believe that there is need to change the narrative in the creative industry generally, having observed that there are quite a number of talented individuals in the industry who have impressive storylines and creative ideas that would impact the general society.”Akinbile-Yussuf, however, said that government was fully aware of the challenges posed by the COVID-19 pandemic to the creative industry, hence it had been lending necessary support.\n“Apart from this, the Lagos State Governor in demonstration of his love for this industry recently approved a special fund for film makers."
  },
  {
    "headline": "Gov. Udom scores administration high on 6-year performance —",
    "summarized_story": "Udom Emmanuel of Akwa Ibom says his administration has performed above 85 per cent in the last six years.\nEmmanuel said that there had been improvement in the area of road infrastructure, education, agriculture, rural development, aviation and healthcare delivery in the state.\nHe, however, said that there were certain economic indices that could not be controlled by anyone, that affected the performance of his administration.\n“Apart from economic and security challenges, the COVID-19 pandemic that is ravaging the whole world has affected our performance.\nThe governor urged the media to support in the development of the state irrespective of the person in power."
  },
  {
    "headline": "NiMet predicts 3 days of sunshine, thunderstorms from Saturday —",
    "summarized_story": "“Later in the day, there are chances of isolated thunderstorms over parts of Plateau, Benue, Nasarawa and Kogi state.\nNiMet predicted chances of isolated thunderstorms over parts of Edo, Ondo, Oyo, Enugu and Imo states during the afternoon and evening hours.\n“There are chances of isolated thunderstorms over Plateau, Niger and the FCT during the afternoon and evening hours.\nAccording to it, cloudy skies with intervals of sunshine are expected over the North central region during the morning hours.\nIt anticipated isolated thunderstorms over parts of the Kwara, Benue, Kogi, Plateau and the FCT later in the day."
  },
  {
    "headline": "Poor welfare: Ondo doctors begin two-week strike",
    "summarized_story": "DOCTORS in Ondo State under the auspices of the National Association of Government General Medical and Dental Practitioners have embarked on a two-week warning strike, alleging that the state government is not taking their welfare seriously.\nSpecifically, the doctors accused the government of failing to pay their salary arrears for some months, failed to resolve the issue of exodus of doctors and other health workers among other matters, hence their service was withdrawn.\nThe association stated this in a letter sent to Governor Rotimi Akeredolu.\nIt read, “With due respect to your office, we write to notify your office of the immediate withdrawal of service by our members working under Ondo State Government Civil Service.\nGovernor which is contained in the letter written to the Nigerian Medical Association Ondo State in March, 2021, among others."
  },
  {
    "headline": "Poor welfare: Ondo doctors begin two-week strike",
    "summarized_story": "DOCTORS in Ondo State under the auspices of the National Association of Government General Medical and Dental Practitioners have embarked on a two-week warning strike, alleging that the state government is not taking their welfare seriously.\nSpecifically, the doctors accused the government of failing to pay their salary arrears for some months, failed to resolve the issue of exodus of doctors and other health workers among other matters, hence their service was withdrawn.\nThe association stated this in a letter sent to Governor Rotimi Akeredolu.\nIt read, “With due respect to your office, we write to notify your office of the immediate withdrawal of service by our members working under Ondo State Government Civil Service.\nGovernor which is contained in the letter written to the Nigerian Medical Association Ondo State in March, 2021, among others."
  },
  {
    "headline": "Tears, tension as suspected herders ambush farmers in Benue, kill 11",
    "summarized_story": "SUSPECTED Fulani herdsmen again struck in Benue State, killing 11 persons in some communities in two local government areas of the state.\nAccording to locals, the suspected herders attacked Anyom community of Mbatyula council ward in Katsina-Ala on Wednesday, while some herdsmen also invaded Zongo-Akiki village in Mbalagh council ward in Makurdi Local Government Areas.\nOne of the locals in Makurdi LGA said that the suspected herdsmen stormed Zongo-Akiki community in the early hours of Thursday where they killed five persons.\nThe Chairman of Makurdi LGA, Anthony Dyegeh, who confirmed the killing of the persons, said the youths were still searching for the missing persons.\nAccording to the media aide to the chairman of Katsina Ala LGA, Tertsea Benga, six persons were reportedly killed."
  },
  {
    "headline": "Tears, tension as suspected herders ambush farmers in Benue, kill 11",
    "summarized_story": "SUSPECTED Fulani herdsmen again struck in Benue State, killing 11 persons in some communities in two local government areas of the state.\nAccording to locals, the suspected herders attacked Anyom community of Mbatyula council ward in Katsina-Ala on Wednesday, while some herdsmen also invaded Zongo-Akiki village in Mbalagh council ward in Makurdi Local Government Areas.\nOne of the locals in Makurdi LGA said that the suspected herdsmen stormed Zongo-Akiki community in the early hours of Thursday where they killed five persons.\nThe Chairman of Makurdi LGA, Anthony Dyegeh, who confirmed the killing of the persons, said the youths were still searching for the missing persons.\nAccording to the media aide to the chairman of Katsina Ala LGA, Tertsea Benga, six persons were reportedly killed."
  },
  {
    "headline": "#EndSARS: No money for Lagos, I put Sanwo-Olu’s album in my archive – Buhari",
    "summarized_story": "By Kazeem UgbodagaPresident Muhammadu Buhari on Friday night said he told Governor Babajide Sanwo-Olu of Lagos that he has no money to give the State in view of last year’s #EndSARS devastation.\nHe said he simply put Sanwo-Olu’s album in his archive and told him the federal government has no money to give Lagos.\nProperty worth over N500 billion were destroyed by rampaging youths in Lagos.\nBut Buhari, in an interview with the Nigerian Television Authority, NTA, said before the EndSARS incident, the previous governor of Lagos State bought 200 buses to complement the transportation in Lagos, as well as built a complex involving railways but that the youths during EndSARS went and burnt them.\n“All they need is confusion and no government can allow confusion,” he stated."
  },
  {
    "headline": "Wike talks tough, orders destruction of criminal hideouts in Rivers",
    "summarized_story": "By Okafor Ofiebor/Port HarcourtAs part of strategy to preempt criminal attacks on Rivers State, Governor Nyesom Wike has ordered the destruction of all criminal hideouts in Ahoada, Elele, Eleme and Onne to prevent attempt to undermine security of the State.\nThe governor said criminals are already coming to terms with the reality that Rivers State is too hot for them to invade at will and detonate their foolish attack on targeted security posts and personnel.\nGovernor Wike, who made this assertion in a state broadcast on Friday, disclosed that the State government has identified the hideouts, safe houses and secret places that provide both cover and comfort for the hoodlums to plan, execute and return to after operations.\n“We have equally decided to destroy all the shanties, illegal shops and mechanic sheds along the Eleme to Onne stretch of the East-West road having discovered these places also as hideouts and operational bases for criminals and criminal activities in the State.\nHe explained that the existing curfew in Rivers state will not last one day beyond necessary and plead with all residents to endure the temporary inconveniences in the interest of the State and collective wellbeing of all."
  },
  {
    "headline": "Performance of Nigeria’s economy unsatisfactory – Buhari",
    "summarized_story": "By Kazeem UgbodagaPresident Muhammadu Buhari on Friday said he was not satisfied with the performance of the nation’s economy despite exiting a second recession.\nBuhari said this in an interview with the Nigerian Television Authority (NTA) on Friday night.\nOn corruption, Buhari said his administration was doing its best even though Nigerians were very ungrateful despite his successes in that area.\nIn the area of security, Buhari emphasised the need to secure the country in a bid to attract foreign investments.\nBuhari also said he felt no side effect after taking the second dose of AstraZeneca vaccine in Abuja recently."
  },
  {
    "headline": "Buhari To Address Nigerians On June 12 At 7 Am",
    "summarized_story": "On Saturday, June 12, 2021, at 7 a.m., President Muhammadu Buhari will deliver a speech to the country to honor Nigeria’s Democracy Day.\nOn Friday, Femi Adesina, Special Adviser to the President on Media and Publicity, released a statement directing television, radio stations, and other electronic media outlets to connect to the Nigerian Television Authority and Radio Nigeria’s network services for the broadcast."
  },
  {
    "headline": "June 12: We Are Not Aware Of Any Planned Protest In Lagos – Police",
    "summarized_story": "The Lagos State Police Command wishes to state clearly that it is not aware of any planned protest in Lagos State to commemorate the 2021 Democracy Day on Saturday, 12th June, 2021.\nIn another development, the Commissioner of Police has formed special Squads to go after traffic robbers who have been terrorising innocent Lagosians and get the state rid of such miscreants.\nThe police boss formed the Squads today Friday 11th June, 2021, at the Command Headquarters.\nCP Hakeem Odumosu equally released some crime fighting equipment and modern communication gadgets to the Squads for efficiency and better service delivery as some of the identified areas like Eko Bridge, Apongbon, Cele, Ijora, Ojota/7up, Mike 12, Surulere etc, must be cleared of miscreants and traffic robbers with immediate effect.\nWhile assuring the general public of adequate security of lives and property in Lagos State, the Commissioner of Police, reiterated that police personnel in the command will religiously discharge their duties within the ambit of the law."
  },
  {
    "headline": "Nigeria Needs Twitter – Senate President, Lawan",
    "summarized_story": "According to Senate President Ahmad Lawan, requires Twitter just as much as it requires the country.\nHe stated that the Senate was confident that the Federal Government and Twitter would work out their differences in the end.\n“In our opinion, Nigeria requires Twitter just as much as Twitter requires Nigeria.\n“Our belief is that Nigeria needs Twitter just as much as Twitter needs Nigeria.\n“We believe that the matter between Twitter and the Federal Government of Nigeria will be resolved."
  },
  {
    "headline": "June 12: Be Fair To All Nigerians – CAN Tells FG",
    "summarized_story": "Nigerians should continue to pray for peace for the country’s well-being, according to the Christian Association of Nigeria (CAN).\nAyokunle, who was represented by the Director of Planning and Social Welfare, Bishop Stephen Adegbite urged the government to be fair to all Nigerians.\nHe reiterated that cattle rearing was a private business, insisting that nobody should destroy the business of another while carrying its own business.\nAyokunle noted that the decision would help to check those hiding under cattle grazing to unleash terror on the residents of the region.\nMeanwhile, the newly elected Chairman of CAN, Southeast zone, Very Rev."
  },
  {
    "headline": "Updated: APC affirms suspension of caretaker chairman",
    "summarized_story": "The National caretaker committee of the All Progressives Congress (APC), has affirmed suspension of Mr. Letep Danbang from being its Plateau state chairman.\nIn a correspondence, dated 11/06/2021, signed by national secretary of the party’s caretaker committee, Sen. John Akpanudoedehe, communicated to Mr. Dabang.\nIt reads: “The Party in receipt of a correspondence suspending you from office as the State Caretaker Chairman of Plateau State Chapter of our Party, over anti-party activities.\nMai Mala Buni, has authorised the constitution of a three-man-act Finding Committee to look into the allegations as averred, with a view to determine the veracity or otherwise of the claims.\n“In the circumstance, you are to step aside from your position as state caretaker chairman, while the Deputy State Caretaker Chairman will act in your stead, pending the conclusion of the findings of the committee,” it said."
  },
  {
    "headline": "Breaking: Euro 2020 kicks off, Italy overpower Turkey in opener",
    "summarized_story": "Euro 2020 opened in spectacular fashion as Italy got their campaign off to an impressive start in front of their own fans with a comfortable victory against Turkey.\nIn the first game of the rescheduled tournament, played at at Rome’s Stadio Olimpico, an own goal by Merih Demiral and strikes by Ciro Immobile and Lorenzo Insigne settled a one-sided Group A contest.\nThe Azzurri dominated the first half but could not find the net, Giorgio Chiellini going closest with a header from a corner which brought a fine save from Ugurcan Çakir.\nThey broke the deadlock when Demiral turned the ball past his own keeper trying to cut out Domenico Berardi’s second-half cross before Lazio’s Immobile, playing on his home ground, pounced after Leonardo Spinazzola’s shot was blocked by the keeper.\nItaly wrapped up a satisfying win though Insigne’s powerful finish, after he was teed up by the impressive Immobile."
  },
  {
    "headline": "Breaking: Again, Buhari addresses Nigerians ahead June 12",
    "summarized_story": "President Muhammadu Buhari will again on Friday evening feature in an exclusive interview on the Nigerian Television Authority (NTA).\nThe session will be played barely 48 hours after he spoke to Nigerians via Arise Arise TV.\nA statement by Special Adviser to Buhari, Mr. Femi Adesina, said the interview session, is expected to be on air from about 8:30pm.\nDetails loading…"
  },
  {
    "headline": "President Buhari Appoints Ilelah as NBC Director-General -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Army redeploys 11 Generals, 3 colonels in latest shake up -NigPilot",
    "summarized_story": "The Hierarchy of the Nigerian Army , last night redeployed eleven Generals, 3 Colonels in the latest shakeup.\nThe outgone Director Army Public Relations, Brigadier General Mohammed Yerima announced the redeployment in a statement in Abuja.\nAccording the statement, “Nigerian Army (NA) has released posting and appointments of senior officers.\nThis is in line with the Chief of Army Staff vision to have a professional Nigerian Army ready to accomplish assigned missions within a Joint Environment in Defence of Nigeria.\nThe Chief of Army Staff, Major General Faruk Yahaya urged all the affected senior officers to justify the confidence reposed on them."
  },
  {
    "headline": "Buhari flags-off Commercial operation of Lagos-lbadan Train service -NigPilot",
    "summarized_story": "President Muhammadu Buhari has officially flagged off commercial operations of the Lagos-Ibadan standard gauge railway project yesterday.\n” This is already yielding the desired result as construction activities on the railway segment, Kaduna – Kano has commenced with back-end engineering activities.\nRotimi Amaechi earlier in his remarks expressed gratitude to President Muhammadu Buhari for summoning the courage to take the loan from China Exim bank to execute the rail project.\nThanking President Buhari for his support in ensuring the project is a success, he stressed that the occasion is the third time of the President commissioning railway project completed during his tenure.\nHe equally thanked the Minister for being the chief pilot of the project in which the project wouldnt have been successful without his tenacity."
  },
  {
    "headline": "UNODC trains Migration, NAPTIP on data collection on human trafficking -NigPilot",
    "summarized_story": "United Nations Office on Drugs and Crime, UNODC, with funding from the Government of Canada, organized a four-day long training of trainers on data collection and analysis on trafficking in persons and smuggling of migrants, TIP and SOM for officers of Nigeria Immigration Service, NIS, National Agency for the Prohibition of Trafficking in Persons, NAPTIP.\nUNODC said the training would equip officers from the Nigeria Immigration Service, NIS, and the National Agency for the Prohibition of Trafficking in Persons, NAPTIP, with the necessary tools when working with data, but also to train data providers at federal and state levels to improve the overall national reporting on TIP and SOM in Nigeria.\nAccording to the agency, it further engaged in the upcoming months with trained NAPTIP and NIS officers to conduct step-down trainings for NAPTIP and NIS zonal commands, recently established State Task Forces and other data providers.\n“Strengthening evidence-based response to trafficking in persons and smuggling of migrants in Nigeria, project funded by Canada, UNODC is currently conducting a threat assessment of trafficking in persons and related organized crime in Nigeria that will support NAPTIP and NIS in developing evidence-based policies and law enforcement strategies,” said UNODC.\nAlso, NIS Deputy Comptroller General, Ms. Anthonia Ifeoma Opara, said in her opening remarks that “this training of trainers is a commendable attempt by UNODC to strengthen the capacity of relevant agencies to generate and process data on trafficking in persons and smuggling of migrants.”Speaking also, NAPTIP’s Director of Research and Programme Development, Mr. OlusayoOlubiyi, added that “UNODC’s training will go a long way in enriching the knowledge and skills necessary to ensure our data is accurate and precise.”"
  },
  {
    "headline": "LIVE: President Muhammadu Buhari Addresses Nation On June 12",
    "summarized_story": "President Muhammadu Buhari is currently addressing the nation on June 12, which has been designated as Democracy Day.\nWatch above."
  },
  {
    "headline": "I Hope To Hand Over A Secure, Prosperous Nigeria In 2023 – Buhari",
    "summarized_story": "Solomon Elusoji, LagosPresident Muhammadu Buhari has said he hopes Nigeria will be secure, prosperous and confident by the time he leaves office in 2023.\nAccording to the President, he is committed to stepping down in 2023 and has no third term agenda, as the constitution allows for only two terms.\nHe added that the success of his administration will depend on the survival of his party, the All Progressives Congress, after 2023.\nThe number one thing is security, the President said, because if you don’t secure Nigeria, people will not invest.\nHe also condemned #EndSARS violence, noting that such actions were bound to drive off prospective investors."
  },
  {
    "headline": "Tension Surrounding June 12 Forced Us To Cancel Protest – Nigerian Students",
    "summarized_story": "The National Association of Nigerian Students on Friday said it has suspended its planned June 12 protest, citing concerns of the safety of the protesters and the fear of a possible hijack by politicians.\nThe President of the association, Mr Sunday Asefon, said while every Nigerian has the right to protest, security agencies have shared credible intelligence report, that the protest would be hijacked.\n“While everyone agreed that the content of the planned protest is genuine, and we reserve the right to protest, the tension surrounding the date has come under a special security.\n“Our planned protest was never part of the Buhari-Must-Go campaign or secession campaign.\nOur planned protest was borne out of our genuine concern for the safety of our students around our campuses."
  },
  {
    "headline": "VIDEO: Eight Students, Two Lecturers Kidnapped As Gunmen Attack Nuhu Bamali Polytechnic",
    "summarized_story": "Eight students and two lecturers have been kidnapped after gunmen invaded Nuhu Bamali Polytechnic in the Zaria Local Government Area of Kaduna State.\nThe bandits attacked the school located along the Kaduna- Zaria road last night, shooting at students and leaving several others injured.\nThe Kaduna State Commissioner for Internal Security and Home Affairs, Samuel Aruwan confirmed this incident to Channels Television early on Friday.\nREAD ALSO: Army Releases New Postings, Appointments Of Senior OfficersAruwan disclosed that one student who was shot died on the spot.\nThe latest incident comes barely three months after bandits attacked the Federal College of Forestry Mechanization Afaka in Igabi local government area of Kaduna state and Greenfield University in Chikun local government areas, where they kidnapped over fifty students and killed five others."
  },
  {
    "headline": "South Africa Expels Malawi Diplomats Over Alcohol Scandal",
    "summarized_story": "Malawi said Friday that several of its diplomats had been expelled from South Africa, which said they had been found guilty of peddling duty-free alcohol.\nMalawi’s foreign affairs ministry in Lilongwe said South Africa had given the diplomats and their families 72 hours to leave the country.\nSeveral diplomats of Lesotho were expelled from South Africa on Thursday on similar grounds.\nSouth African media have reported that cash-strapped Lesotho diplomats have been bringing alcohol into the country without paying duty and then re-selling it in bars and restaurants.\nMalawi’s foreign ministry expressed “regret” that “Malawian diplomats…have been declared persona non grata” by South Africa."
  },
  {
    "headline": "June 12, Democracy Day: AIG Zone 10 Assures of Hitch Free Celebration",
    "summarized_story": "Assistant Inspector General of Police in charge of Zone 10, comprising of Sokoto, Kebbi and Zamfara states Ali Aji Janga has assured residents in the zone of a hitch free Democracy Day celebration.\nMr. Janga in a statement signed by the zonal Police Public Relations Officer, Assistant Supritendent of Police, Adamu Abbas says the zone has deployed all legal means to protect lives and properties of citizens,before, during and after the June 12 Democracy Day celebrations.\nThe AIG noted that,though the country is in turmoil as a result of the various reactions, agitations and criminal activities going on in some parts,but assured that all security mechanisms has been put in place to ensure peace and tranquility in the zone is not jeopardized.\nMr. Janga says movement is not restricted, and that all law abiding citizens are free to move about peacefully to carry out their legitimate transactions and livelihood.\nHe call on residents to respect the rights of other citizens, and warned that trouble makers to stay away from the zone and not test the collective will of the zone, as doing so will attract severe consequences for any persons or groups of persons coming out to cause break down of law and order throughout the period and beyondAdvertisementHe advised Religious leaders, traditional rulers and all Social Organization to monitor the activities of their wards and members to ensure peaceful celebrations and not to engage in nefarious activities and make themselves available to be used by unscrupulous elements planning to cause mayhem in the country."
  },
  {
    "headline": "Twitter expresses willingness to meet FG",
    "summarized_story": "Micro blogging and social network service platform Twitter stated that it has informed the Federal Government of its willingness to meet over the suspension of its operations in Nigeria.\nThe Federal Government last Friday suspended Twitter’s operation in Nigeria on the basis accusing the social media giant of allowing its platform to be used to threaten the country’s cooperate existence.\nMinister of Information and Culture, Lai Mohammed told reporters on Wednesday that Twitter’s management is seeking a “high-level discussion” to resolve the issue that led to the suspension.\nConfirming the Minister’s comment, Twitter said on Friday: “Today marks one week since Twitter was blocked in Nigeria.\nWe have informed the Nigerian government that we are ready to meet for an open discussion to address mutual concerns and see the service restored."
  },
  {
    "headline": "Gov. Matawalle orders Residents To Protect Self Against Bandits Attack",
    "summarized_story": "Zamfara state Governor Bello Matawalle has directed residents of troubled areas to defend their communities against bandits attacksBut, warns against witchhunting innocent citizensThis directives is coming on the heels of the upsurge of attack on communities by gunmen despite the peace and dialogue initiative with the criminals to cease fireHe stated this in Gusau the state Capital during special prayer against insecurity as part of Activities Marking his two years in officeGovernor Bello Matawalle says it has become necessary for every well meaning citizen to seek divine intervention over the spate of Insecurity across the countryAdvertisementThe governor said and I quote..“The insecurity situation has defied solution, as such people should defend themselves against attacks by bandits ”“My government has approved that whenever bandits attack your community , do not wait for the security personnel to come to your rescue.\nYou should rise up and protect yourselves”He further says, screening of volunteer vigilante group to Mann communities and complement the efforts of security agencies will soon commence from village to state levelAdvertisementSecurity agencies according to him will be part of the screening excercise to avoid recruiting criminals that will add to the problem instead of the solution“Arrangement has been concluded to recruit locals from each community who will be in charge of monitoring their villages to ensure that bandits do not lauch attack”“I am calling on the traditional rulers and community leaders to make sure that only people of proven integrity are screened and recruited”The Zamfara State Governor also expressed worry over the lack of enough security personnel to protect communitiesAdvertisementHe says, efforts to get more troops from the Federal government is still hanging despite assurances from the presidency.\nHe enjoin citizens to intensify prayers for a lasting peace in Zamfara and other parts of the countryCommunities in Zamfara has in the last few days suffered attacks leading to the death of many and abduction of persons by armed Bandits."
  },
  {
    "headline": "Italy Open 2020 Euro With Emphatic Win over Turkey",
    "summarized_story": "Italy rode three second-half goals to a 3-0 win over Turkey in Group A of the opening match of the 2020 European Championship in Rome on Friday.\nRoberto Mancini’s Italy came into the match on a 27-match unbeaten run and their fine form showed early on as the Azzurri dominated possession and went close with a pair of headers from corner kicks just past the 20-minute mark.\nThe pressure on the Turkish defence finally told when Merih Demiral inadvertently chested the ball into his own net from a Domenico Berardi cross and Italy took the lead shortly after the restart.\nLorenzo Insigne put the game away for Italy in the 79th minute, curling home a beautiful first-time shot after Turkey’s Cakir hooked a goal kick right to the opposing side and Italy pounced for their third.\nTurkey will face Wales next in Group A action, while Italy play Switzerland, with both games played on Wednesday, June 16."
  },
  {
    "headline": "Twitter Says it’s Ready For Open Discussions With Nigeria",
    "summarized_story": "Twitter says it’s informed the Nigerian government that it’s ready for an open discussion to address mutual concerns and see the microblogging service restored.\nThe comments of the American company comes two days after information minister Lai Mohammed said Twitter had reached out to discuss the possibilities of lifting the ban, without giving further details..“Today marks it one week sine Twitter was blocked in Nigeria, We have informed the Nigerian government that we are ready to meet for an open discussion to address mutual concerns and see the service restored,” Twitter Public Policy said in a statement.\nIt added further that, “we remain advocates for the free and #OpenInternet everywhere.”"
  },
  {
    "headline": "Nigeria: President Buhari Dismisses Idachaba as Broadcasting Commission DG, Appoints Balarabe Ilelah",
    "summarized_story": "President Muhammadu Buhari has sacked Armstrong Idachaba as the Director-General of Nigeria’s National Broadcasting Commission (NBC).\nMr Armstrong’s dismissal comes amidst the frenzy that’s enveloped the ban on Twitter and plots to regulate social media.\nNBC, in a newspaper advertorial on Thursday, asked all social media platforms and online broadcasting service providers in Nigeria to apply for broadcast licences.\nThe Nigerian Minister of Information and Culture, Lai Mohammed, announced the appointment in a statement issued in Abuja on Friday and also announced the appointment of Balarabe Shehu Ilelah, a broadcaster, as the new Director-General of the NBC.\nMr Idachaba was appointed acting Director-General of the commission replacing Modibbo Kawu who was suspended for alleged financial impropriety in February 2020."
  },
  {
    "headline": "Buhari’s Narrative On Terrorists: ‘Treat Them In The Language They Understand’ -Trending With Ojy Okpe",
    "summarized_story": "Nigerians have reacted to the exclusive interview President, Muhammadu Buhari granted to Arise TV, many Nigerians shared mixed reactions on social media as the interview was granted at a time the country yarned for the presidents comment amid wide spread agitations across the country.\nThe Nigerian presidency says a documentary titled Nigeria: Consolidating Democracy and National Unity’ in recognition of Moshood Kashimawo Abiola, as winner of the 1993 presidential election, will premiere tomorrow, June 12th .\nThe federal government of Nigeria has opened an official account on the Indian micro blogging platform Koo.\nIn the meantime, the Attorney General of the Federation and Minister of justice Abubakar Malami has denied asking the Directorate of Public Prosecutions to file charges against Nigerians who were using Twitter to express their views, but to prosecute those who aid and abet the micro blogging platform to circumvent the controversial ban."
  },
  {
    "headline": "Twitter Ban: Nigeria Government Accounts Migrate to Indian Microblogging Platform Koo",
    "summarized_story": "The suspension of Twitter by the Nigerian government has forced the federal government and some agencies of government to move to Koo, an Indian microblogging platform, to keep in touch with the public.\nBarely a week after banning the tech giant over the deletion of a tweet on President Muhammadu Buhari’s account, the federal government has joined the Indian microblogging site.\nIt has already opened an official account on the platform with the handle @nigeriagov and had above 10,000 followers as at Thursday night.\nKoo co-Founder Aprameya Radhakrishna, who confirmed that the platform is now available in Nigeria, said they are working on adding Nigeria’s local languages.\nWe are thinking of enabling the local language there as well."
  }
]