[
  {
    "headline": "Protest in Kwara community as gunmen kill pregnant woman, kidnap husband",
    "summarized_story": "Gunmen on Saturday killed a pregnant woman, Hawawu, and kidnapped her husband, Lukman Ibrahim, on Ojoku Road, Offa, in the Offa Local Government Area of Kwara State.\nThe couple were said to be on their way home when they were accosted by the hoodlums.\nThe state Police Public Relations Officer, SP Ajayi Okasanmi, who confirmed the incident, said he could not give details of the kidnap.\n“As Lukman was being dragged by the assailants, the wife was shouting for help.\nIt was gathered that the entrepreneur’s car was taken to the police station on Ojoku Road, Offa, while Hawawu’s corpse was taken to the morgue of the General Hospital, Offa."
  },
  {
    "headline": "Many traumatised by Nigeria’s situation, Jonathan laments",
    "summarized_story": "EX-President Goodluck Jonathan has expressed concern over the increasing crime wave in the country but concluded that most of them were caused by consumption of drugs.\nAccording to him, most areas of the health system needed to be revamped to meet international standards.\nHe said with all the issues bedeviling Nigeria, incidents of mental health had suddenly become a challenge as most Nigerians were currently traumatised by the happenings in the society.\nWe need to also look into issues of mental health.\nThis is sad.”Earlier, Epelle appreciated Jonathan for being the first President to pay the bills of persons with albinism to secure treatment."
  },
  {
    "headline": "Twitter Ban: Social media, most potent weapon for good, evil; must be regulated — Gbaja",
    "summarized_story": "He said the National Assembly would have long enacted a law for the regulation of the social media but for the opposition that had always greeted the move by Nigerians.\nHe said: “The social media is the most potent weapon for good and for evil.\n“Most democracies in the world today are making efforts to regulate the social media and the National Assembly has been considering regulating the social media for long.\n“We agree that there is freedom of speech but the government is saying that freedom is not absolute.\nAccording to him, the public x-rays the members of the National Assembly in the light of executive functions which included projects execution, whereas their primary responsibility was lawmaking and representation."
  },
  {
    "headline": "Yahaya Bello tasks African leaders on youth entrepreneurship",
    "summarized_story": "Yahaya Bello of Kogi has called on African leaders to devote sufficient resources to raising outstanding business leaders in youths as a means of bringing more innovation to the society.\nBello made the call on Saturday in Lagos while receiving the Hive Africa Inclusion Award 2021 for his unwavering support towards women development in Africa.\nThe governor stated that entrepreneurship gives young people opportunities for excellence and success as business owners and managers.\nBello, who represented by Suleiman, acknowledged that the role of entrepreneurship in building global economies for sustainable development could not be overemphasized.\nHe disclosed the efforts of his administration in strengthening entrepreneurship among women and youth of Kogi, saying it was aggressively focusing on the advancement of modern technological knowledge."
  },
  {
    "headline": "Fuel: Subsidy must go to move economy ahead — FG",
    "summarized_story": "He said: “I will say that my stand on fuel subsidy and deregulation is well-known.\nIt will be recalled that the Nigerian National Petroleum Corporation, NNPC, had on April 6, signed the EPC contract with Maire Tecnimont SPA, an Italian company, for rehabilitation of PHRC.\n‘PIB’ll be passed soon’On the Petroleum Industry Bill, PIB, the minister assured that it would be passed in the next few weeks.\n‘’The expected kick-off of a privately-owned refinery is being touted as Nigeria’s passport to end products’ importation, reducing foreign exchange demand for fuel imports, while serving as a shortcut for the wider oil sector reforms.\n“There have also been calls made to insert certain clauses in the petroleum reform bill— Petroleum Industry Bill—mandating the grant of import licenses to only companies with active refining licenses."
  },
  {
    "headline": "Lagos PDP Chairmanship Judgment: Let’s close ranks, Owokoniran appeals to members",
    "summarized_story": "Rahman OwokoniranBy Agbonkhese ObohThe General Secretary, Peoples Democratic Party, PDP, South-West region, Rahman Owokoniran, has appealed to party members to respect institutional mechanisms to address issues, close ranks and share the party’s vision of liberating Nigerians from misgovernance.\nRecall that on Tuesday, June 22, Justice Oyekan Abdullahi of the Lagos High Court removed Dr. Doherty as the Chairman of the Lagos PDP and reinstated former Chairman, Dr. Dominic Adegbola.\nOwokoniran, in his reconciliatory message to members on Sunday, said: “The councillorship (election) is at hand and our resolve is to win at the polls.\n“Therefore, we need not dissipate our energy on issues that distracts us from our focus, especially when there are institutional mechanisms in place to address these issues.\nMoreover, Owokoniran added, there can be no vacuum in dispensing duties and obligations in government, public or private institutions."
  },
  {
    "headline": "Super TV CEO’s Murder: We suspect conspiracy — Ataga’s family -",
    "summarized_story": "Elder brother to the deceased, Dr. Isi Ataga, in a statement entitled: Who will speak for Usifo Ataga?’, also confirmed these findings.\nOne person could never have carried these out.”Go beyond Chidimma’s arrestSimilarly, the Ataga family has urged the Police to go beyond the arrest of the suspect.\nThe activities lined up for the convocation ceremony will kick off on Wednesday with a press briefing by the Vice-Chancellor, Prof. Oluwatoyin Ogundipe.\nBut the Senate of the university will meet and decide her case before we start activities for our convocation ceremony.\nThe convocation ceremony would have held early last year but for what happened then."
  },
  {
    "headline": "Insecurity: Ibadan Polytechnic begins resumption of social activities",
    "summarized_story": "The management of The Polytechnic, Ibadan, has announced the resumption of normal social activities in line with existing laid down procedures.\nThe Registrar of the institution, Mrs Modupe Fawale, announced this in a statement made available to the newsmen in Ibadan on Sunday, NAN reports.\nCOVID-19: University of Ibadan announces resumption of physical lectures“With this, all planned activities within the institution are to continue with strict adherence to the best practices that will promote continued peace on campus,” the statement read.\nRecall that the school management earlier suspended all social activities within the institution.\nThe Registrar of the institution, Theresa Fawale in the statement, had noted that the decision was necessary in view of the security situation on the campus."
  },
  {
    "headline": "Osun: One dead, children, others injured as masquerades attack Muslims",
    "summarized_story": "At least, one person has been confirmed dead while about 12 persons, including children sustained gunshot injuries in a clash that ensued between masquerade worshipers in Osogbo and some Muslims on Sunday.\nDAILY POST gathered that the masquerade worshipers opened gunfire at the Muslims at their worship centre, Kamorudeen Central Mosque, located at Oluode Aranyin in Osogbo around 2:30 pm on Sunday while performing a special prayer for Nigeria.\nSome of the children who were shot are under 17 years and are undergoing treatment at different hospitals.\nHe said that the masquerade and their worshipers under the protection of the police walked past the mosque before they returned and descended on them with stones.\n“Some of our members, about 12 who sustained bullet injuries have been taken to Osun State General Hospital, Asubiaro; Osogbo central hospital and UNIOSUN central hospital while the corpse has been deposited at UNIOSUN teaching hospital mortuary,” he added."
  },
  {
    "headline": "Plastic surgery, drugs: World'll become Sodom, Gomorrah in five years",
    "summarized_story": "Pastor Giwa said the world might become “Sodom and Gomorrah” in the next five years if care was not taken.\nIllicit sex, drug addiction and immoral behaviors have become the order of the day among young and old people today.\n“In the next five years, the world might turn to Sodom and Gomorrah where women and men might be walking naked on the streets.\n“In Nigeria today, plastic surgery doctors have become billionaires through breast, buttocks and body enhancements.\nDrama as Nina undergoes plastic surgery after deal with body enhancement brand“The world, generally, is falling apart, and that is a sign that our Lord Jesus Christ is coming soon."
  },
  {
    "headline": "Yobe govt moves to clamp down on private school operating without licence, standards",
    "summarized_story": "Worried by the proliferation of private schools, the Yobe State Government through the Ministry for Basic and Secondary Education has set up a Special Committee to check irregularities in private schools across the state.\nThis is with a view to clampdown on erring operators who turned the important sector into a money-making venture without regard to qualitative education.\nDr. Idriss said any private school operating in the state must follow standard procedures of operation including regards for people’s religion, culture and tradition.\nAccording to the commissioner, his ministry won’t hesitate to shutdown any private school that failed to abide by the established conditions.\nThe governor also appreciated the efforts of those ‘serious private’ school operators in providing sound education to learners in the state."
  },
  {
    "headline": "Biafra, Oduduwa: Yahaya Bello suggests solution to agitations",
    "summarized_story": "Governor Yahaya Bello of Kogi State, has advocated dialogue as a tool in resolving the agitations for Nigeria’s break up.\nBello made the remark emphasizing on the need for Nigeria’s unity.\nHe also called for dialogue as a way to resolving all forms of agitations.\nBello expressed hope that Nigeria will never break up irrespective of ploys by some people to stir problems using religious and ethnic divides.\n“We can have differences, skirmishes here and there which by the grace of God, we shall overcome them and Nigeria will remain together,” Bello said."
  },
  {
    "headline": "Anambra Guber: Ngige calls for cancellation of APC primary",
    "summarized_story": "From Obinna Odogwu and Mokwugwo SolomonFormer Anambra South Senator, Andy Uba, has been declared winner of the governorship primary election of the All Progressives Congress (APC) in Anambra State.\nUbah emerged winner in the primary election contested by 13 other aspirants.\nHe added that the minor delay was not the fault of the committee or that of the party members, but that of logistics.\nMeanwhile, confusion is trailing the outcome as some of the party members and stakeholders have rejected the process leading to the congress.\nReacting to the declaration of Uba, State Publicity Secretary of the party, Okelo Madukaife, rejected the result, describing it as fake."
  },
  {
    "headline": "Buhari replies Niger Delta Avengers, says threat unnecessary",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has replied the Niger Delta Avengers, a militant group in the oil-producing Delta region threatening to resume attacks amid rising insecurity and disagreements over the share of oil wealth communities should get.\nThe president said it was curious that the threat was coming less than 48 hours after he met with the leadership of the Niger Delta and Ijaw National Congress (INC), at the Presidential Villa, where he responded to the germane issues raised, especially call for restructuring of the Federation, and the inauguration of a Board for the Niger Delta Development Commission (NDDC).\nAccording to a statement by Special Adviser to the President on Media and Publicity, Femi Adesina, he said threat was unnecessary.\n“Similarly, the National Oil Spill Detection and Response Agency, under the same ministry of Environment is working to make sure that oil spills are reduced and new ones prevented.\n“God Bless the Federal Republic of Nigeria.”Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Constitution review: Speakers root for state police",
    "summarized_story": "From Paul Osuyi, AsabaSpeakers of the 36 states Houses of Assembly have made a case for the establishment of state police to tackle insecurity in the country.\nThey want the ongoing review of the 1999 Constitution to accommodate the concept of state police and community policing.\nThis was contained in a communiqué issued at the end of the second quarter general meeting of the Conference of Speakers of State Legislatures of Nigeria held in Asaba, Delta State.\nSigned by the chairman of the conference and Speaker of Bauchi State House of Assembly, Abubakar Suleiman, the communiqué commended the Federal Government’s in fighting insecurity.\nHe stated that there was need for dialogue on how to ensure fairness and equity in the governance of the country."
  },
  {
    "headline": "40 oil firms in possession of dormant refinery licenses",
    "summarized_story": "By Adewale SanyaoluEarly hopes of Nigeria’s refining capacity growing by 1,862,000 million barrels per day (bpd) has further been dashed as 40 firms are currently in possession of dormant refinery license, a Department of Petroleum Resources (DPR) refinery status report has revealed.\nThe DPR refinery license status report indicated that as at May 2021, a total of 68 refineries license and approval had been granted, out of which 40 are inactive.\nOthers are; American Exploration Company Nigeria Limited, Epic Refinery and Petrochemical Industries Limited, Masters Energy Oil and Gas Limited, Grifon Energy Limited, Sifax Oil and Gas Company Limited, Capital Oil and Gas Industries Limited, Green Energy International Limited, Fresh Energy Limited, Chyzob Oil and Gas Limited, Ibafon Oil and Gas FZE Refinery Limited, Owena Oil and Gas Limited, Tonwei Refinery, NSP Refineries and Oil Services, Rehoboth Natural Resources Dev.\nThe rest include; Niger Delta Petroleum Resources and Petrochemical Limited, RG Shinjin Petrochemicals Limited, Jil-Amber Consortium PHRC, Dee Jones, Hi-Rev Oil Limited, Starex Petroleum Refinery Limited, Eko Petrochem & Refining Company Limited, Petrolex Oil & Gas Limited, Ikwe-Onna Refinery Limited, Clean Waters Refinery, Southwest Refineries and Petrochemicals Company Limited, Obat Refinery Limited, Antonio Oil Company Limited.\nIn 2019, Kaduna Refining and Petrochemical Company Limited only processed crude in one month (June); Port Harcourt Refining Company Limited in two months (February and March); and Warri Refining and Petrochemical Company Limited in four months (January, February, March and May)."
  },
  {
    "headline": "Obasanjo raises the alarm over population explosion",
    "summarized_story": "From Laide Raheem, AbeokutaFormer president Olusegun Obasanjo has called for proper population management, expressing the fear that the geometric population explosion without a corresponding socio-economic development, may spell doom for the country.\nObasanjo, who spoke at a mentoring session for students of some selected schools across the country, organised by Students for the Advancement of Global Entrepreneurship (STAGE), said Nigeria’s increasing population must be properly managed to engender national development.\nWhile calling for more actions in population management, Obasanjo charged the young students to uphold the virtues of integrity, honesty and good moral standing, to take them to their respective chosen careers in life.\n“Mentorship and motivation of this nature may just be the tonic that will fire the necessary patriotism for national development in these budding leaders of tomorrow,” Obasanjo said.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Why Grazing Routes Are Difficult to Recover",
    "summarized_story": "However, THISDAY’s investigation has revealed that the grazing routes have been taken over, over the years, by modern facilities built for the public good.\nIn Kano State, the state government has acknowledged that the grazing routes have been taken over by public infrastructure, including schools.\nAlthough Niger State has 11 grazing routes, covering about 1,865 kilometres, 1,368 kilometres of these routes are primary routes while the remaining 496 kilometres are secondary routes.\nHe explained: “The committees are working with already list of encroachers on the grazing reserves and discussions are in top gear to reclaim these grazing reserves.\nThe Special Adviser on Media and Public Enlightenment to the Governor, Mr. Zalaini Bappa, said even some former governors who trespassed on the grazing reserves returned the land."
  },
  {
    "headline": "Petrol Subsidy Bites Harder, NNPC Proposes N114.3bn Deduction in June",
    "summarized_story": "These implied that the deduction by the NNPC more than quadrupled from the N25.374 billion in February to N114 billion in June.\nAdded to export crude oil, the revenue generated was $616.037 million.\nAll the transactions were hinged on N382.80 to one dollar exchange rate as advised by the Central Bank of Nigeria (CBN), according to the national oil company.\n“Crude oil export revenue received in May 2021 amounted to $167.72 million, equivalent to N64.2 billion.\nBesides, the corporation said it expended N5 billion on export financing, N8.3 billion on the non-functional refineries and N83.3 billion on the ongoing Nigeria/Morocco pipeline."
  },
  {
    "headline": "Buhari: Drug Trafficking, Abuse Pose More Threat than Insurgency, Banditry",
    "summarized_story": "•Says drug abuse already stretches across three generationsDeji Elumoye in Abuja and Laleye Dipo in MinnaPresident Muhammadu Buhari, yesterday, identified drug trafficking and abuse as more threatening to the stability of the nation than banditry and insurgency that are prevalent in some parts of Nigeria.\nThe enormity of the danger of drug abuse calls for an urgent need to nip the problem in the bud.\n“Today, it is a glaring fact that Nigerian youths are involved in drug abuse.\nHe said: “And in this campaign, we are tackling the scourge of drug abuse and trafficking on all fronts.\nIn addition to the arrest and prosecution of drug offenders, we have worked out intensive drug abuse awareness and sensitisation programmes targeting different groups, with an emphasis on youths."
  },
  {
    "headline": "Army Chief Orders Destruction of All Boko Haram, ISWAP Enclaves in North-east",
    "summarized_story": "The army chief also declared that traditional institutions were critical to bringing the insurgency war to an end.\nA statement issued by the Nigerian Army Headquarters said the army chief ordered troops of Sector 2 Joint Task Force North-east Operation Hadin Kai to destroy all Boko Haram and Islamic State West Africa Province (ISWAP) enclaves in their various locations.\nAmong the dignitaries, who accompanied the COAS were the Chief of Operations (Army) Major General Ibrahim Yusuf and the Theatre Commander Operation Hadin Kai, Major General Christopher Musa.\nMeanwhile, the army chief said traditional institutions were critical to the success of ongoing operation to end Boko Haram insurgency and terrorism in the North-east.\nMeanwhile, the Nigerian Air Force yesterday denied that the Nigerian Air Force Base, Kaduna, was attacked by Boko Haram."
  },
  {
    "headline": "NEITI: $584m Oil, Gas Deals Sealed in Asset Ownership Changes in 2019",
    "summarized_story": "Besides, Nigerian Petroleum Development Company (NPDC) acquired OML 11, formerly operated by Shell Petroleum Development Company (SPDC), in a contract totalling $456.03 million.\nDuring the year under review, seismic data acquisition was up by 348 per cent, field development plans 65 per cent, well activities 45 per cent, while gas development plan was down by 75 per cent, with six approved for 2019, as opposed to 24 in 2018.\nSeplat was next with 7 million barrels, followed by SNEPCo, with 3.8 million barrels.\nIn addition, NPDC and Neconde suffered losses and subsequent deferment of 3.7 million barrels, Newcross’ was 3.2 million barrels, Aiteo deferred 2.84 million barrels, Energia’s share of deferment was 1.7 million barrels, while APDNL’s loss was 733,000 barrels during the year.\nAll deferred production amounted to 55.2 million barrels while there were 1,387 pipeline breaks, with Mosimi recording the highest with 637 breaks, followed by Port Harcourt, 536, and Warri with 96 breaks."
  },
  {
    "headline": "EXCLUSIVE: Aisha Buhari, Children Move To London Ahead Of Nigerian President’s 2nd Medical Trip In 2021",
    "summarized_story": "Ahead of President Muhammadu Buhari's medical trip to London, United Kingdom, his wife, his children have left Nigeria for the European country.\nFile Photo“All President Muhammadu Buhari’s children have moved to London in advance of his medical trip.\nThe Presidency had earlier announced the postponement of Buhari’s medical trip to London, earlier scheduled for Friday.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa."
  },
  {
    "headline": "EXCLUSIVE: Aisha Buhari, Children Move To London Ahead Of Nigerian President’s 2nd Medical Trip In 2021",
    "summarized_story": "Ahead of President Muhammadu Buhari's medical trip to London, United Kingdom, his wife, his children have left Nigeria for the European country.\nFile Photo“All President Muhammadu Buhari’s children have moved to London in advance of his medical trip.\nThe Presidency had earlier announced the postponement of Buhari’s medical trip to London, earlier scheduled for Friday.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa."
  },
  {
    "headline": "EXCLUSIVE: Aisha Buhari, Children Move To London Ahead Of Nigerian President’s 2nd Medical Trip In 2021",
    "summarized_story": "Ahead of President Muhammadu Buhari's medical trip to London, United Kingdom, his wife, his children have left Nigeria for the European country.\nFile Photo“All President Muhammadu Buhari’s children have moved to London in advance of his medical trip.\nThe Presidency had earlier announced the postponement of Buhari’s medical trip to London, earlier scheduled for Friday.\nBetween June 6 and 19, 2016, Buhari went on a 10-day medical trip to England for an ear infection surgery.\nLater on March 10, 2017, Buhari returned to Nigeria but didn't resume work immediately at Aso Villa."
  },
  {
    "headline": "EXCLUSIVE: Senate President, Lawan Gifts Newly Wedded Wife N100m As National Assembly Building Deteriorates",
    "summarized_story": "SaharaReporters had reported how Lawan secretly married Zainab at a very private ceremony in Borno State on Friday.\nSee Also Exclusive EXCLUSIVE: Nigeria's Senate President, Ahmed Lawan Marries Young Shuwa-Arab Girl In Secret WeddingA mini party was also held at the bride's family residence in Gwange 1 Ward, Malut Shuwa Street, Maiduguri.\nA source close to Zainab told SaharaReporters on Saturday that the Senate President gifted her N100 million a few days after they were introduced to each other.\nEXCLUSIVE: Nigeria's Senate President, @DrAhmadLawan Marries Young Shuwa-Arab Girl In Secret Wedding | Sahara Reporters https://t.co/awX606hJ4Q pic.twitter.com/RE1BohBpMu — Sahara Reporters (@SaharaReporters) June 26, 2021\"Lawan personally gave her N100 million days after he saw her pictures.\nSaharaReporters had reported how leaks from the roof of the National Assembly building disrupted the plenary session on Tuesday."
  },
  {
    "headline": "EXCLUSIVE: Senate President, Lawan Gifts Newly Wedded Wife N100m As National Assembly Building Deteriorates",
    "summarized_story": "SaharaReporters had reported how Lawan secretly married Zainab at a very private ceremony in Borno State on Friday.\nSee Also Exclusive EXCLUSIVE: Nigeria's Senate President, Ahmed Lawan Marries Young Shuwa-Arab Girl In Secret WeddingA mini party was also held at the bride's family residence in Gwange 1 Ward, Malut Shuwa Street, Maiduguri.\nA source close to Zainab told SaharaReporters on Saturday that the Senate President gifted her N100 million a few days after they were introduced to each other.\nEXCLUSIVE: Nigeria's Senate President, @DrAhmadLawan Marries Young Shuwa-Arab Girl In Secret Wedding | Sahara Reporters https://t.co/awX606hJ4Q pic.twitter.com/RE1BohBpMu — Sahara Reporters (@SaharaReporters) June 26, 2021\"Lawan personally gave her N100 million days after he saw her pictures.\nSaharaReporters had reported how leaks from the roof of the National Assembly building disrupted the plenary session on Tuesday."
  },
  {
    "headline": "Obasanjo: Nigeria's population will become liability by 2050 if we don't manage it well",
    "summarized_story": "Former President Olusegun Obasanjo says Nigeria’s population growth could become a problem if it is not well managed.\nEarlier this month, United Nations released a report which estimated that Nigeria’s population had risen to 211 million.\nReacting, Obasanjo predicted that if the population explosion is not curbed, Nigeria will become the third-largest country in the world in 2050.\nAdvertisement“If we don’t start getting it right now, we will not get it right by 2050.\nBut if we don’t do what we have to do – which we are not doing now – the population will become a liability."
  },
  {
    "headline": "Obasanjo: Nigeria's population will become liability by 2050 if we don't manage it well",
    "summarized_story": "Former President Olusegun Obasanjo says Nigeria’s population growth could become a problem if it is not well managed.\nEarlier this month, United Nations released a report which estimated that Nigeria’s population had risen to 211 million.\nReacting, Obasanjo predicted that if the population explosion is not curbed, Nigeria will become the third-largest country in the world in 2050.\nAdvertisement“If we don’t start getting it right now, we will not get it right by 2050.\nBut if we don’t do what we have to do – which we are not doing now – the population will become a liability."
  },
  {
    "headline": "Fuel scarcity looms as IPMAN threatens to cease operations over 'police harassment'",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) has threatened to shut down fuel stations across the country.\nAdvertisementSpeaking with reporters on Sunday in Jos, Plateau state capital, Yakubu Suleiman, IPMAN spokesperson, said the association has instructed its members to shut down operations over alleged harassment by the police.\nHe noted that the some police officers had invaded the association’s national secretariat on Friday over leadership issues among members.\nSC15/2015, and ordered that Mr Chinedu Okoronkwo, is our President and Alhaji Danladi Garba Pasali, as National secretary,” he said.\n“The implications would be there will be a shortage or fuel scarcity in the country."
  },
  {
    "headline": "Fuel scarcity looms as IPMAN threatens to cease operations over 'police harassment'",
    "summarized_story": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) has threatened to shut down fuel stations across the country.\nAdvertisementSpeaking with reporters on Sunday in Jos, Plateau state capital, Yakubu Suleiman, IPMAN spokesperson, said the association has instructed its members to shut down operations over alleged harassment by the police.\nHe noted that the some police officers had invaded the association’s national secretariat on Friday over leadership issues among members.\nSC15/2015, and ordered that Mr Chinedu Okoronkwo, is our President and Alhaji Danladi Garba Pasali, as National secretary,” he said.\n“The implications would be there will be a shortage or fuel scarcity in the country."
  },
  {
    "headline": "'We must strike a balance' — Gbaja advocates social media regulation",
    "summarized_story": "Femi Gbajabiamila, speaker of the house of representatives, says social media must be regulated to protect every citizen of the country against its negative sides.\nThe speaker noted that freedom of speech is not absolute, stressing that there must a balance in the regulation of social media so that the rights of individuals are not infringed upon.\nThat is my position about social media regulation.\nAdvertisement“Many more countries, democracies that we all look up to are already in the mood of regulating social media.\nYou heard of cyberbullying, children nagging themselves, killing themselves because of what is on social media."
  },
  {
    "headline": "Nigerian businesses face an avalanche of losses as the Twitter ban continues",
    "summarized_story": "The ban happened a day after the Nigerian government announced an indefinite Twitter suspension.\nFeranmi Ajetomobi, the founder of Nifries, explained that the Twitter ban has affected anon (short for anonymous) sales which drive about 20% of sales at Nifries.\nFor Habib who runs Smiley Socks, a clothing company that also thrives on the ‘anon sales’ phenomenon, sales via Twitter have been affected.\nCompared to other advertising channels, Twitter is a cheaper and less stressful channel.\nLet’s put it across all the businesses in that range and you see that the number is massive.”With the Twitter ban, Nigerian businesses that have previously relied on the massive reach of the platform now face an avalanche of losses if the decision is not reversed soon."
  },
  {
    "headline": "Google earmarks $6 million to support African tech startups and women-led businesses",
    "summarized_story": "Google, this week, announced the launch of two new initiatives to support African-founded startups and women-led businesses in underserved communities on the continent.\nThe programs include a $3 million Black Founders Fund for African startups and a $3 million Google.org grant to help women in low-income communities develop entrepreneurial skills and access funding.\nThrough the latter, Google is looking to support access to economic opportunity for women in sub-Saharan Africa with a $3 million grant to the Tony Elumelu Foundation (TEF).\nBlack Founders Fund debuts in AfricaThe Google for Startups Black Founders Fund provides grants and technical assistance to early-stage startups led by black and diverse teams, with a goal of advancing the black community.\nAccording to Bosun Tijani, CEO of Co-Creation Hub (CcHub), which is partnering with Google on the Black Founders Fund Africa, the shortage of funding for African startups is driven by several factors."
  },
  {
    "headline": "Jesse Forrester started an e-mobility company in Kenya after deciding against going to university",
    "summarized_story": "After ALA, Jesse took up a fellowship.\nToday, his company Mazi Mobility is backed by global venture builder, Satgana, and is aiming at implementing an electric vehicle ecosystem in Africa.\nHe started his company without a university degree and he is now preparing himself to dominate the African e-mobility space.\nThe journey to Mazi by way of ALA‘Mazi’ was not always ‘Mazi Mobility’.\nAt ALA, Jesse was a part of the team behind “The Living Machine” a water treatment system that won them the $100,000 Zayed Sustainability Prize in 2019."
  },
  {
    "headline": "SEC approves Chaka as first licensed stock trading app in Nigeria",
    "summarized_story": "Chaka becomes the first to acquire the digital sub-broker license introduced by SEC in April of this year.\nAs part of a major amendment to its Consolidated Rules and Regulations, SEC recognised sub-brokers who use digital platforms to serve multiple brokers.\nOn the 19th of December 2020, the SEC published a statement that effectively barred Chaka from offering its services in Nigeria.\nThat December warning enabled Chaka to take the lead and open talks with the SEC.\nHe said the license also means Chaka could now enable other stockbroking firms who want to have a digital presence."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Policies, technology and Nigerian MSMEs’ battle for survival in a pandemic",
    "summarized_story": "The arrival of the pandemic seems to have changed the perspective of some small business owners.\nPer academic researchers Roberto Dell’Anno and Omobola Adu, Nigeria’s employment uncertainties and rapid urban migration are responsible for the rise of informal businesses.\nHowever, the arrival of the pandemic created a lot more problems for MSMEs across the globe, and Nigerian business owners faced problems born from systemic and infrastructural challenges.\nWith government incentives treated with deep scepticism, some Nigerian businesses had to find ways to survive.\nPeter’s scope expanded to running ad campaigns on Google and Facebook and getting a feel of other established businesses running his line of work."
  },
  {
    "headline": "How technology is helping this AC technician scale his business",
    "summarized_story": "AdvertisementIt’s why when we were asked to pitch possible stories for an article, the event “World Refrigeration Day” caught my attention.\nWorld Refrigeration DaySince 2019, World Refrigeration Day is celebrated every June 26.\nIt is an international awareness campaign established by the World Refrigeration Day Secretariat to raise the profile of the refrigeration, air-conditioning, and heat-pump sector.\nAfter watching several hours of AC installation and work tools videos on YouTube myself, I am inclined to agree.\nA vacuum pump is an essential tool used to repair cooling units to clean the compressor by removing unwanted air and water vapour."
  },
  {
    "headline": "Malawi’s 3D-printed school, learning disabilities and technology, Chrome’s third-party cookies",
    "summarized_story": "Good day,Today, I’m discussing:The world’s first 3D-printed school opening in MalawiLearning disabilities and assistive technologyGoogle’s delay in blocking third-party cookies in ChromeWorld’s first 3D-printed school opens in MalawiPhoto credit: NairametricsWhat happened?\nLearning disabilities (LDs) and assistive technology (AT)Photo by Wulan Sari on UnsplashJust two questions before you proceed: What are learning disabilities?\nAlthough there is no cure for LDs, technology has made learning easier for people with learning disabilities.\nGoogle delays plan to block third-party cookies in ChromePhoto by Brett Jordan on UnsplashAnother announcement?\nGoogle has said that it will delay its plans to block third-party cookies in the Chrome browser until 2023, a year later than planned."
  },
  {
    "headline": "Edo First Lady hosts reception for couple left stranded by Marriage Court Registrar – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State First Lady, Mrs. Betsy Obaseki, at the weekend, organised a wedding reception for Mr. and Mrs. Abel Eromosele Ugiagbe, the couple whose marriage ceremony was disrupted by the absence of the Registrar of the Federal Marriage Registry, in Benin City, Edo State.\nMrs. Obaseki said her decision to host the reception for the couple was to ease the pain they went through following the disappointment on their wedding day, adding that the compassionate nature of Mr. Abel Eromosele Ugiagbe who felt bad that the registrar lost his job drew her closer to the couple.\nShe noted, “After I confirmed the report as true, I called my friend and wife of the Minister for Interior, Mrs. Aregbesola who briefed her husband about the development.\nThe Minister apologized to the couple.\nOsaigbovo Iyoha, congratulated the couple on the success of their wedding despite the disappointment they experienced over the failure of the Registrar of the Federal Marriage to show up for the marriage."
  },
  {
    "headline": "God will heal our land – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has dedicated his administration to God Almighty, declaring that God will heal Nigeria and Edo State from all forms of social vices and political backwardness that hinder development.\nCiting the book of Timothy 2:1-2, Obaseki said, “I have the privilege and grace of God to offer prayers and declarations over the sphere of politics and government in Edo State.\nHe declared, “God will heal our land through Godly leaders who make Godly policies and lead with the fear of God.\n“I declare that Jesus Christ is Lord over politics and government in Edo State.\nI declare that the sphere politics in our state is blessed because of our prayers to the Lord."
  },
  {
    "headline": "Ogirrua of Irrua celebrates 50th coronation anniversary – Nigerian Observer",
    "summarized_story": "Chief, Martin Uhumoibhi, immediate past Vice Chancellor of Ambrose Alli University, Prof. Ignatius Onimawo, Dr. Igene Christopher, among others.\nAwards of honour were presented to some personalities such as, current senator representing Edo Central, Senator (Engr) Clifford Odia, Chief Medical Director of Irrua Specialist Teaching Hospital, Prof. Sylvernus Okoigbenin, Promoter of Mudiame University, Irrua, Edo State, Prof.\nHe appreciated the efforts of the government and people of Edo State in ensuring that peace prevail in the land, and thanked guests and all that contributed to the success of his 50th Coronation Anniversary.\nOthers in their remarks, including Chief Medical Director of Irrua Specialist Teaching Hospital, Prof. Sylvernus Okoigbenin, Promoter of Mudiame University, Irrua, Edo State, Prof.\nHighpoint of the one week celebration was the cutting of the 50th Coronation Anniversary cake by the celebrant, Ogirrua of Irrua and Okaijesan of Esanland, HRH William Momodu amidst cheers."
  },
  {
    "headline": "Edo Modular Refinery ready to begin operations – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, on Friday, said the Edo Modular Refinery being developed by Edo Refinery and Petrochemical Company Limited (ERPC) with support from the Edo State Government, in Ologbo, Ikpoba – Okha Local Government Area of the state, is ready to commence operations.\n“The plant is ready; it’s ready to receive crude oil; it’s ready to process and it’s ready to deliver products.\nThe governor has this project dear to his heart; not only this project, the power plant is also situated in Ologbo.\nIn his response, the Managing Director of the Edo Modular Refinery, Tim Tian, commended the governor for his contribution in the actualization of the project.\nTian, who attributed the outbreak of the COVID-19 pandemic as a major challenge which affected the project, said the refinery is ready to produce crude oil products."
  },
  {
    "headline": "INTERVIEW: I’ll shift APC from ruling party to governing party if elected – Chairmanship Aspirant",
    "summarized_story": "Excerpts:PT: We learnt that you are vying for the seat of APC National Chairman; what is your mission?\nBaba: My mission is to reposition the party from a ruling party to a governing party to achieve the manifesto we presented to the people in 2015.\nPT: You made mention of shifting the party from ruling to governing as your mission.\nAnswer: You see, selecting candidates for party primaries is the key and the most important aspect of any political party.\nAnswer: Sometimes people will say it without meaning it, that is why I said we want to be a governing party, not ruling."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "MINILS Partners China To Train Nigerian Youths",
    "summarized_story": "Michael lmoudu National Institute of Labour Studies (MlNlLS), llorin, Kwara State has announced its resolve to collaborate with China in organising training programmes that will create employment opportunities for Nigerian youths.\nAdvertisementsThe institute’s director general, Comrade lssa Aremu, announced this during a meeting with the Ambassador of the People’s Republic of China to Nigeria, Mr Cun Jianchun.\nAremu expressed the readiness of MINIL to deepen cooperation with China in critical areas of training, capacity building and skills acquisition that would ensure the employability of the Nigerian youths.\nHe said such collaboration would also improve Nigeria’s economy and create more job opportunities for the youths.\nAremu’s meeting with the Chinese envoy focused oAn collaboration and partnership between MINILS and Chinese embassy in the areas of institution building, peoples -to- peoples contact and technical assistance on vocational training."
  },
  {
    "headline": "MINILS Partners China To Train Nigerian Youths",
    "summarized_story": "Michael lmoudu National Institute of Labour Studies (MlNlLS), llorin, Kwara State has announced its resolve to collaborate with China in organising training programmes that will create employment opportunities for Nigerian youths.\nAdvertisementsThe institute’s director general, Comrade lssa Aremu, announced this during a meeting with the Ambassador of the People’s Republic of China to Nigeria, Mr Cun Jianchun.\nAremu expressed the readiness of MINIL to deepen cooperation with China in critical areas of training, capacity building and skills acquisition that would ensure the employability of the Nigerian youths.\nHe said such collaboration would also improve Nigeria’s economy and create more job opportunities for the youths.\nAremu’s meeting with the Chinese envoy focused oAn collaboration and partnership between MINILS and Chinese embassy in the areas of institution building, peoples -to- peoples contact and technical assistance on vocational training."
  },
  {
    "headline": "AGF Idris Tasks MDAs On Dwindling Revenue, Leakages",
    "summarized_story": "The Accountant General of the Federation (AGF), Ahmed Idris, has emphasised that in order to enhance the dwindling finances of the government, revenue generating agencies should be alive to their responsibility and plug loopholes observed in the system.\nAdvertisementsHe stated this when the leadership of the Fiscal Responsibility Commission (FRC), led by its executive chairman, Victor Muruako Esq, visited him at the Treasury House in Abuja.\nThe AGF assured the management of the Commission that the Federal Treasury will give it the needed support in order to achieve its mandate and will make positive inputs to the amendment of the Fiscal Responsibility Act.\nADVERTISEMENTSpeaking earlier, the chairman of FRC, Muruako, noted that the agency could only achieve its mandate when the Fiscal Responsibility Act is successfully amended to reflect current realities.\nHe solicited the support of the Accountant General of the Federation in the proposed amendment of the law."
  },
  {
    "headline": "AGF Idris Tasks MDAs On Dwindling Revenue, Leakages",
    "summarized_story": "The Accountant General of the Federation (AGF), Ahmed Idris, has emphasised that in order to enhance the dwindling finances of the government, revenue generating agencies should be alive to their responsibility and plug loopholes observed in the system.\nAdvertisementsHe stated this when the leadership of the Fiscal Responsibility Commission (FRC), led by its executive chairman, Victor Muruako Esq, visited him at the Treasury House in Abuja.\nThe AGF assured the management of the Commission that the Federal Treasury will give it the needed support in order to achieve its mandate and will make positive inputs to the amendment of the Fiscal Responsibility Act.\nADVERTISEMENTSpeaking earlier, the chairman of FRC, Muruako, noted that the agency could only achieve its mandate when the Fiscal Responsibility Act is successfully amended to reflect current realities.\nHe solicited the support of the Accountant General of the Federation in the proposed amendment of the law."
  },
  {
    "headline": "Nasarawa To Use Attendance Register For June Salary",
    "summarized_story": "Nasarawa State government said it would pay this month’s salary based on the attendance register of workers who did not participate in the ongoing workers strike in the state.\nAdvertisementsThis was contained in a statement after an emergency expanded executive council meeting presided over by the state governor, Engr Abdullahi Sule, at the weekend.\nIt would be recalled that the organised labour in Nasarawa went on strike two weeks ago, specifically on June 15, 2021, to press home their demands for outstanding promotions and other issues.\nThe resolution, which was read by the state chairman, civil service commission, Musa Dangana said, “The government maintains its stand on the ‘no work no pay’ order”.\nThe statement signed by the chairman civil service commission, Alhaji Musa Dangana, said the state government is open to discussion with labour."
  },
  {
    "headline": "Dangote Makes Nigeria Third-Highest Country in Terms of Urea Capacity Additions",
    "summarized_story": "The 3.0 million metric tonnes of Dangote Fertiliser plant and around 88 planned and announced plants are scheduled to come online, predominantly in Asia and Africa, over the next five years.\nGlobalData, which made this announcement in its Global Urea Capacity Additions by 2030, released recently, hinted that the completion of Dangote Fertiliser has made Nigeria the third-highest country in terms of capacity additions, with a capacity of 11.58 million tpy by 2030.\n“Major capacity additions will be from two planned plants Dangote Group Lekki Urea Plant 1 and Dangote Group Lekki Urea Plant 2 with a capacity of 1.50 million tpy each by 2030,” it added.\nDangote Fertiliser plant has however placed Nigeria in the third position among other countries, like Iran and India that will lead in global urea capacity growth by 2030.\nThe Dangote Fertiliser complex consists of Ammonia and Urea plants."
  },
  {
    "headline": "Dangote Makes Nigeria Third-Highest Country in Terms of Urea Capacity Additions",
    "summarized_story": "The 3.0 million metric tonnes of Dangote Fertiliser plant and around 88 planned and announced plants are scheduled to come online, predominantly in Asia and Africa, over the next five years.\nGlobalData, which made this announcement in its Global Urea Capacity Additions by 2030, released recently, hinted that the completion of Dangote Fertiliser has made Nigeria the third-highest country in terms of capacity additions, with a capacity of 11.58 million tpy by 2030.\n“Major capacity additions will be from two planned plants Dangote Group Lekki Urea Plant 1 and Dangote Group Lekki Urea Plant 2 with a capacity of 1.50 million tpy each by 2030,” it added.\nDangote Fertiliser plant has however placed Nigeria in the third position among other countries, like Iran and India that will lead in global urea capacity growth by 2030.\nThe Dangote Fertiliser complex consists of Ammonia and Urea plants."
  },
  {
    "headline": "Host communities allege marginalisation, threaten Agip’s operations",
    "summarized_story": "SWAMP and Land Areas Landlords of Nigerian Agip Oil Company have threatened to shut down the operations of the firm over what they termed continuous marginalisation of the landlords.\nThe landlords, in a statement made available to newsmen in Port Harcourt, decried the persistent and continuous marginalisation of people from the swamp and land areas of the company’s operations in its managerial cadre.\nThe statement signed by Onisoya Odum, Chairman, and Temple Sambo, Secretary of the landlords, called on the attention of governors of the NAOC operation areas to the treatment of the people.\nIt added, “The question therefore is; are there no other persons from the swamp and land areas operation of NAOC who is qualified to fill positions of a Divisional Manager?\n“We hereby put all landlords of both swamp and land areas operation to be at alert; there will be a directive to shut down all NAOC operations within our communities until all issues are resolved,” the statement added."
  },
  {
    "headline": "Host communities allege marginalisation, threaten Agip’s operations",
    "summarized_story": "SWAMP and Land Areas Landlords of Nigerian Agip Oil Company have threatened to shut down the operations of the firm over what they termed continuous marginalisation of the landlords.\nThe landlords, in a statement made available to newsmen in Port Harcourt, decried the persistent and continuous marginalisation of people from the swamp and land areas of the company’s operations in its managerial cadre.\nThe statement signed by Onisoya Odum, Chairman, and Temple Sambo, Secretary of the landlords, called on the attention of governors of the NAOC operation areas to the treatment of the people.\nIt added, “The question therefore is; are there no other persons from the swamp and land areas operation of NAOC who is qualified to fill positions of a Divisional Manager?\n“We hereby put all landlords of both swamp and land areas operation to be at alert; there will be a directive to shut down all NAOC operations within our communities until all issues are resolved,” the statement added."
  },
  {
    "headline": "18 APC governors to welcome Matawalle into party",
    "summarized_story": "By Abankula with reports by Abubakar Ahmed/GusauEighteen APC governors, led by Yobe Governor Mai Mala Buni, are expected in Gusau tomorrow to formally receive Governor Bello Matawalle into their fold.\nIdris said:“All is now set for our governor to move from the PDP to the APC.\nThe media aide said the governor’s planned defection to APC would further strengthen the party in the state.\n“Let me emphasise to you that Zamfara politicians have always been a single family and even as a PDP governor, my principal, Gov Bello Matawalle has always related very well with those in the opposition parties.\nWith Matawalle’s defection the number of PDP governors has shrunk from 16 to 13."
  },
  {
    "headline": "One dead, others injured as masqueraders attack Muslims in Osun",
    "summarized_story": "No fewer than 12 persons sustained various gunshot wounds in a clash between masquerade worshipers and some Muslims in Osogbo, Osun State capital, on Sunday.\nThe incident left at least one person dead with about 12 others including children, sustaining varying degrees of gunshot injuries.\nSome of the children shot in the attack were said to be under 17 years and are undergoing treatment at different hospitals.\nIn the course of the attack, a Toyota Camry car and the mosque windows were vandalized.\n“Some of our members, about 12 who sustained bullet injuries have been taken to Osun State General Hospital, Asubiaro; Osogbo central hospital and UNIOSUN central hospital while the corpse has been deposited at UNIOSUN teaching hospital mortuary,” he added."
  },
  {
    "headline": "Oyedepo: I spent seven hours with cobra in a room unhurt",
    "summarized_story": "Presiding Bishop, Living Faith Church Worldwide, David Oyedepo has recounted how he spent seven hours with a cobra in the same room unhurt.\nAccording to him, God knew he loved him, and that all the devils knew he love God and that God proved perpetually and unending that he truly loved him.\n“I was in my office and a cobra was found in my wardrobe, the third floor of the building and I worked in that floor seven hours in the previous night and the morning when they were cleaning, there was a cobra and it stood up.\nOyedepo said when one becomes a lover of God, the enemy would leave him alone, because every attempt on one’s life would bounce back on him.\nSo, to bring the hand of God to bear on your finances, whatever God says to you to do regarding your finances, do it.”"
  },
  {
    "headline": "Military Bombs Boko Haram, ISWAP Commanders During Meeting",
    "summarized_story": "During a conference around the Lake Chad axis, the Nigerian military bombed Boko Haram and Islamic State West African Province (ISWAP) commanders and leaders.\nBoko Haram and ISWAP camps were hit by Nigerian Air Force jets in Sabon Tumbu, Jibularam, and Kwalaram, according to news reports.\n“Their leaders, including Ali Chakkar and other top ISWAP commanders, were holding a meeting when the attacks were launched.\n“The precision-guided airstrikes coordinated by the Air Task Force Command resulted in the killing of very large numbers of ISWAP and Boko Haram terrorists,” the source said.\n“We don’t differentiate between Boko Haram and ISWAP terrorists as we successfully launched the devastating intelligence-led aerial attacks targeting the terrorists in those locations”, he said."
  },
  {
    "headline": "Aisha Buhari, Children Move To London Ahead Of Buhari’s Medical Trip",
    "summarized_story": "Prior to President Buhari’s medical vacation, Aisha Buhari is anticipated to go out of Nigeria to London, United Kingdom.\nAisha Buhari is expected to join some of her children who have fled Nigeria, according to SaharaReporters.\nPresident Buhari is expected to travel to London with his wife and children on an unspecified date.\n“All President Muhammadu Buhari’s children have moved to London in advance of his medical trip.\nBuhari had previously indicated that his medical trip to London, which had been scheduled for Friday, would be postponed."
  },
  {
    "headline": "What Yorubas, Hausas, Igbos Did When Abuja-Kaduna Train Broke Down – Shehu Sani",
    "summarized_story": "Former federal lawmaker Shehu Sani has described what happened on Saturday when the Abuja-Kaduna train broke down on the way.\nThe train broke down Friday night at Jere village, according to the former lawmaker who represented Kaduna Central Senatorial District.\nAccording to him, the heinous occurrence brought the Igbos, Yorubas, and Hausas together as brothers and sisters, forgetting their differences.\n“Yesterday, our Kaduna-Abuja train broke down at night for many hours near Jere village.\nSani recently chastised Northern organizations for putting a bounty on the head of the Indigenous People of Biafra, Nnamdi Kanu (IPOB)."
  },
  {
    "headline": "BREAKING: Governors, Ministers, Others Storm Emir Of Kano’s Palace For Buhari Son’s Wedding",
    "summarized_story": "Some governors and ministers, as well as other key political figures, are currently meeting at the Emir of Kano’s palace to finalize plans for President Muhammadu Buhari’s son Yusuf’s wedding.\nThe president’s son is marrying Zara Nasir Ado Bayero, the Emir of Bichi’s daughter.\nThe Jigawa State Governor, Abubakar Badaru of Jigawa, led the group to the palace.\nThe present Emir of Kano, who is the older brother of the potential bride’s father, the Emir of Bichi, is hosting them.\nHer father is the fourth child of the late Emir of Kano, Alhaji Ado Bayero."
  },
  {
    "headline": "Matawalle set to join Ayade, Umahi in APC …Senators, 6 Reps, ex-deputy gov Wakkala, Yuguda follow gov",
    "summarized_story": "Strong indication emerged Sunday that Zamfara state Governor Bello Matawalle will defect from Peoples Democratic Party ( PDP) to the ruling All Progressives Congress (APC).\nEbonyi state Governor Dave Umahi left the party last year while a PDP lawmaker, Senator Peter Nwaoboshi also joined the APC last week.\nTsafe, an APC chieftain in the state, was the first to call on Matawalle to join APC March last year.\nTsafe said he was condemned and called names by PDP chieftains when he first called on the governor to join APC.\n“All arrangements have been concluded for the governor to join APC."
  },
  {
    "headline": "Insecurity in FCT: UniAbuja, Veritas varsity, COED Zuba, 5 others on red alert",
    "summarized_story": "“As you can see in the school, students are going about their normal businesses without tension, there is calm because there is reasonable security.\nVeritas UniversityAt Veritas University, a privately owned institution, the institution scaled down academic activities, including vacating the students on campus.\nBut the situation at the College of Education, Zuba is almost similar to the UniAbuja as the school’s permanent site is entirely without front and back perimeter fence.\n“We have perimeter fence around the temporary site and also around the permanent site,” a senior staff insisted.\nFrom behind it shares a boundary with the thick bush adjacent to the CCECC, International Cancer Centre along the Lugbe Expressway but with a near nonexistent perimeter fence."
  },
  {
    "headline": "Pictures: Pandomonium as hoodlums attack Enyimba players in Jos after Aba-based club picked point vs Plateau United",
    "summarized_story": "NextInvestors participation in stock market drops in May"
  },
  {
    "headline": "Okowa tasks States’ legislatures on constitutional amendment -NigPilot",
    "summarized_story": "Governor Ifeanyi Okowa of Delta has called on the States’ House of Assembly to ensure that the Constitutional Amendment Bill is passed when passed to them by the National Assembly.\nOkowa made the call on Friday when he received the Conference of Speakers of States’ Legislatures in Nigeria led by its Chairman and Speaker of Bauchi State House of Assembly, Rt.\nHe stated that as states’ legislatures, the onus was on them to pass the Constitutional amendments in the interest of the nation.\n“The fear of legislative autonomy is unfounded because our state House of Assembly has been operating in autonomy since 2019,” he said.\nSpeaker of Delta House of Assembly and Deputy Chairman of the Conference of Speakers, Rt Hon."
  },
  {
    "headline": "Okowa tasks States’ legislatures on constitutional amendment -NigPilot",
    "summarized_story": "Governor Ifeanyi Okowa of Delta has called on the States’ House of Assembly to ensure that the Constitutional Amendment Bill is passed when passed to them by the National Assembly.\nOkowa made the call on Friday when he received the Conference of Speakers of States’ Legislatures in Nigeria led by its Chairman and Speaker of Bauchi State House of Assembly, Rt.\nHe stated that as states’ legislatures, the onus was on them to pass the Constitutional amendments in the interest of the nation.\n“The fear of legislative autonomy is unfounded because our state House of Assembly has been operating in autonomy since 2019,” he said.\nSpeaker of Delta House of Assembly and Deputy Chairman of the Conference of Speakers, Rt Hon."
  },
  {
    "headline": "NAF base was not attacked by terrorists in Kaduna -NigPilot",
    "summarized_story": "The Nigerian Air Force (NAF) on Saturday denied a trending report that its Base in Kaduna was attacked by terrorists.\nAccording to the statement, “Merchants of fake news are at it again.\nThis time around, their focus is on the premier Nigerian Air Force Base at Kaduna , which they claimed came under terrorist attack in the early hours of today, 26 June 2021.\n“Members of the public should please disregard the news as it is entirely false”.\nAir Commodore Edward Gabkwet concluded thatthere was nothing of such as the inhabitants of the entire Base are going about their normal activities and duties without any threat whatsoever."
  },
  {
    "headline": "NAF base was not attacked by terrorists in Kaduna -NigPilot",
    "summarized_story": "The Nigerian Air Force (NAF) on Saturday denied a trending report that its Base in Kaduna was attacked by terrorists.\nAccording to the statement, “Merchants of fake news are at it again.\nThis time around, their focus is on the premier Nigerian Air Force Base at Kaduna , which they claimed came under terrorist attack in the early hours of today, 26 June 2021.\n“Members of the public should please disregard the news as it is entirely false”.\nAir Commodore Edward Gabkwet concluded thatthere was nothing of such as the inhabitants of the entire Base are going about their normal activities and duties without any threat whatsoever."
  },
  {
    "headline": "Troops kill scores of bandits in Zamfara State -NigPilot",
    "summarized_story": "The troops of the 8 Division Nigerian Army (NA) , killed scores of bandits while on a fighting patrol, along with Mayanchi-Dogo Karfe and Fagantama villages in Talata Marafa LGA of Zamfara State.\nHe said that in the fierce encounter that ensued, the bandits were overwhelmed by the superior firepower of the troops.\nIn a related development, the Army Spokesperson said that troops again killed five bandits in another encounter at Bingi village, in Bungudu LGA of Zamfara.\nThe gallant troops recovered one AK-47 rifle, one Motorcycle, and three mobile phones from the routed criminals,” he said.\nHe also tasked communities in the North West to support the troops with useful information at all times to enhance anti-banditry operations."
  },
  {
    "headline": "Population Explosion: If We Don’t Get It Right Now, We Won’t By 2050 – Obasanjo",
    "summarized_story": "Chief Olusegun Obasanjo has asked Nigerian leaders to begin at this moment in the nation’s history, to prepare for and against population explosion.\nSpeaking further about the situation which he says has slowed down national development, Obasanjo expressed worry over the management of the population of the nation.\n“What are we going to do to handle that, how are we going to handle that population?\n“What we need to do is education about population management.\nSome people don’t like saying family planning, but whatever you do, you must manage your population to the benefit of all that is living within your nation,” Obasanjo stated."
  },
  {
    "headline": "Niger Delta Avengers’ Sabre-Rattling Rather Unnecessary, Says Buhari",
    "summarized_story": "President Muhammadu Buhari has said that the threat issued by the Niger Delta Avengers on Saturday is rather unnecessary.\nMr. Adesina said when the Niger Delta and Ijaw National Congress visited the president, issues such as the call for restructuring and the inauguration of a board for the Niger Delta Development Commission (NDDC) were addressed.\nThey said the south-south remains the most underdeveloped region in the country, with their needs and interests “undermined by the failed Nigerian State”.\nHowever, as you know, the process of granting licenses is guided by laid-down rules and regulations, most of which even favour local content and local contractors.\nHowever, I would like to implore you that the Ijaw National Congress should play a more active role in making sure that the mismanagement that occurred in the past is not repeated."
  },
  {
    "headline": "How FG Will Tax Profits Made By Global Tech Giants In Nigeria – Osinbajo",
    "summarized_story": "Nigeria is set to utilise its legal provisions that empower the Federal Government to collect taxes on profits made in the country by global technology and digital firms not based in the country, but with a significant economic presence here.\n“I think the most important thing is that we must widen our tax net so that more people who are eligible to pay tax are paying.\n“The Finance Act has shown that we are very prepared to ensure that these big technology companies do not escape without paying their fair share of taxation in Nigeria.\nMany of them do incredible volumes here in Nigeria and in several other parts of the region.\nAlso CIT for companies with revenues between N25 and N100m (described in the Act as “medium-sized” companies) has been reduced from 30% to 20%."
  },
  {
    "headline": "SERAP Asks African Commission To Order FG, NASS To Withdraw Bills To Gag Media",
    "summarized_story": "The bills are reportedly sponsored by Chairman, House Committee on Information, Mr Segun Odebunmi (PDP, Oyo State).\nThere are no effective or sufficient local remedies available to the Complainant.”“Nigerian courts do not entertain cases on the legality of anti-media and anti-human rights bills.\nAlso, one of the lawmakers pushing the bills Mr Odebunmi Olusegun has reportedly boasted that ‘No court will stop us from passing the bills.\nThe Nigerian authorities should also give assurances that they will fully implement the resolutions and declarations on freedom of expression, access to information and media freedom in the country.\n4.Undertake a prompt review of Nigerian legal framework and administrative practices on freedom of expression, access to information, and media freedom to ensure their consistency and compatibility with the African Charter, and resolutions and declarations by the African Commission."
  },
  {
    "headline": "NPFL 21: Katsina Utd End Akwa Utd Unbeaten Run, Dakkada Record 3rd Away Win",
    "summarized_story": "Before the matchday 29 fixture at the Muhammadu Dikko Stadium in Katsina, Akwa United were unbeaten in 18 league matches.\nUnbeaten run over for Akwa United but coach Kennedy Boboye’s team still maintained the top position in the league.\nGoing against an unpredictable FC Ifeanyi Ubah team, Coach Ibrahim Musa’s team erased all forms of complacency to get the job done.\nDakkada FC recorded their third away win of the season with a 1-0 victory over Abia Warriors at the Okigwe Township Stadium.\nCoach Imama Amapakabo’s team have now lost 10 times this season while Dakkada FC recorded their 12th win of the season."
  },
  {
    "headline": "UK Health Secretary Matt Hancock resigns over alleged affair with Senior aide",
    "summarized_story": "UK Health Secretary Matt Hancock, has resigned following reports of a secret romance with a Senior aide Gina Coladangelo.\nThe Sun UK published a photo of Hancock purportedly “kissing and embracing Gina Coladangelo” at the Department of Health’s London headquarters.\nHe also admitted that he broke covid-19 guidelines as such, he had to take the lead and stay away from his office.\n“I am writing to resign as Secretary of State for Health and Social Care.\nBBC reports that UK Prime Minister, Boris Johnson felt “sorry” upon receiving Hancock’s resignation letter."
  },
  {
    "headline": "Synagogue Church releases funeral details of T.B Joshua",
    "summarized_story": "The funeral details for Prophet T.B.\nJoshua, the founder of the Synagogue Church of All Nations, who died on June 5 have been released.\nThe Church had announced that the funeral would be completed in a week from July 5 to 11.\nThe church had previously stated that Joshua would be buried at the church, despite the requests of the traditional authorities in Arigidi Akoko, Ondo, where the prophet was born.\nAdvertisementIt also assured its members that worship will not stop at the church following shutdown since Joshua’s demise."
  },
  {
    "headline": "Buhari reacts to demands by Niger Delta Avengers, says sabre-rattling rather unnecessary",
    "summarized_story": "President Muhammadu Buhari has reacted to the Niger Delta Avengers, who recently emerged and threatened to blow critical oil and gas installations in the region unless specific demands were met.\nThe statement reads: “The media was Sunday awash with threats and demands by a group, Niger Delta Avengers, to embark on economic sabotage through bombing of critical oil and gas installations unless certain demands, including development of the Niger Delta, and restructuring of the Federation, were met.\nI thank you for paying this courtesy visit not too long after your election in April, and swearing-in last May.\nAdvertisement“Similarly, the National Oil Spill Detection and Response Agency, under the same ministry of Environment is working to make sure that oil spills are reduced and new ones prevented.\nHowever, I would like to implore you that the Ijaw National Congress should play a more active role in making sure that the mismanagement that occurred in the past is not repeated."
  },
  {
    "headline": "Czechs Stun 10-man Netherlands 2-0, Breeze Into Euro 2020 Quarterfinals",
    "summarized_story": "Czech Republic produced an impressive 2-0 victory over Netherlands to make the Euro 2020 quarterfinals on Sunday.\nTomas Holes and Patrik Schick scored in the second half to set up a clash with Denmark in Baku next Saturday for a place in the semifinals.\nNetherlands faced an uphill battle after Matthijs de Ligt was shown a straight red card early in the second half for denying a goalscoring opportunity.\nThe Czechs progress into the last eight of the competition for the first time since Euro 2012.\nWith 10 minutes remaining, the Czechs produced a counter attack and Holes set up Schick to convert from inside the box."
  },
  {
    "headline": "UK Bans Binance in Latest Cryptocurrency Crackdown",
    "summarized_story": "Britain’s financial regulator has ordered Binance, one of the world’s largest cryptocurrency exchanges, to stop all regulated activity and issued a warning to consumers about the platform which is coming under growing scrutiny globally.\nWhile trading of cryptocurrencies is not directly regulated in Britain, offering services such as trading in cryptocurrency derivatives does require authorisation.\nThe FCA has told Binance that by June 30 it must display a notice stating “BINANCE MARKETS LIMITED IS NOT PERMITTED TO UNDERTAKE ANY REGULATED ACTIVITY IN THE UK” on its website and social media channels.\nJapan’s regulator said on June 25 that Binance was operating in the country illegally, a notice posted on Japan’s Financial Services Agency website showed.\nIn April, Germany’s financial regulator BaFin warned the exchange risked being fined for offering digital tokens without an investor prospectus."
  },
  {
    "headline": "Euro 2020: Lukaku vs Ronaldo as Belgium Face Portugal in Spain for Quarter-final Spot",
    "summarized_story": "The world’s number-one ranked side Belgium take on holders Portugal in a standout Euro 2020 tie in Spain for a place in the quarter-finals.\nAll eyes will be on Belgium forward Romelu Lukaku and Portugal captain Cristiano Ronaldo, who have scored eight goals between them at Euro 2020.\nDespite being top of Fifa’s world rankings, Belgium have yet to win a major tournament.\nEuro 2016 winners Portugal made it through to the last 16 as one of the best four third-placed teams.\nPortugal have conceded six goals in three games at Euro 2020 so far, already one more than they did at Euro 2016 when they went on to lift the trophy."
  },
  {
    "headline": "Trump Returns to Rally Stage in Ohio, Urges Votes for Republicans",
    "summarized_story": "Trump has pledged to back those who challenge the 10 legislators in the upcoming Republican primaries.\nSo far, nine of the 10 House Republicans who voted for Trump’s impeachment have drawn primary challengers.\nWe won that election in a landslide.”The crowd chanted “Trump won” and “four more years!\nThe former president also used the Ohio rally to lambast Biden, calling him a “catastrophe” and focusing on the rising number of immigrants crossing over the US southern border – an issue Republicans have zeroed in on to rally their voters.\nRepublican strategist Matt Dole said both Trump and those vying to stay close to him benefited from the public bonhomie on display at the Ohio event."
  },
  {
    "headline": "Covid: Several Countries Reintroduce Restrictions Amid Struggle to Contain Delta Variant",
    "summarized_story": "“There is currently a lot of concern about the Delta variant,” World Health Organization (WHO) chief Tedros Adhanom Ghebreyesus told a Friday news briefing.\nMeanwhile, Russia’s Euro 2020 host Saint Petersburg on Saturday reported the country’s highest daily COVID-19 death toll for a city since the start of the pandemic.\nThis came as Russia has seen an explosion of new cases since mid-June, driven by the Delta variant.\nIn neighbouring Finland, health officials said they had detected a spike in coronavirus infections that was traced to football fans returning from Saint Petersburg.\nIn South Africa, the continent’s worst-hit country, scientists said on Saturday the Delta variant appeared to be dominating new infections."
  }
]