[
  {
    "headline": "I was misquoted about resignation, says Ebonyi SSG",
    "summarized_story": "The Secretary to the Ebonyi State Government and Coordinating Commissioner, Dr Kenneth Ugbala, has denied that he has resigned from office.\nUgbala said the publication quoting him to have said he resigned from office was false, adding that he remained the SSG.\nHe said the authors of the publication completely misquoted what he told journalists who interviewed him on Thursday.\n“I told them that the office of the Secretary to the State Government is known for confidentiality and that I’m not the one to announce my resignation.\nThe SSG explained that he came to consult the party leaders over his senatorial ambition and to seek their approval and support."
  },
  {
    "headline": "Delta hotel manager, workers arrested as lady’s corpse recovered",
    "summarized_story": "Operatives of the Delta State Police Command have recovered the corpse of a society lady from a hotel room in the Ozoro community, Isoko Local Government Area of the state.\nOur correspondent gathered that the deceased society lady, identified as Miss Adegor Rukewe Sophia, was found dead inside a room at the Palms Hotel Resorts, Ozoro, on Tuesday.\nSources said when her corpse was discovered, the management of the hotel reported the incident to the police.\nHowever, the hotel manager, who reported the incident alongside the workers on duty, were said to have been arrested and detained by the police.\nThe corpse was said to have been removed and deposited in the morgue of an undisclosed hospital in the area."
  },
  {
    "headline": "When Nigeria’s best solution hides in plain sight",
    "summarized_story": "Just like ‘The Prof’ in the viral Spanish series, Money Heist, Prof. Kingsley Moghalu understands that strategy- not brawn – wins wars.\nTalking about the subject, it occurred to me that Kingsley Moghalu had always been given assignments that centred on bringing peace to war-ravaged countries.\nProfessor Moghalu knows more mobile apps than I do!\nNigeria is Africa’s biggest potential in that sector and a president like Kingsley Moghalu will create the best possible environment for young tech founders to thrive.\nIn Prof. Kingsley, Moghalu Nigeria’s entertainment industry has found its most genuine partner."
  },
  {
    "headline": "Jang excited over pardon for Dariye, Nyame",
    "summarized_story": "Jonah jangBy Marie-Therese NanlongJos – Former Governor of Plateau State, Senator Jonah Jang has said that the pardon and release of former Governors Joshua Dariye of Plateau State and Jolly Nyame of Taraba State is something to cheer about.\nSenator Jang who expressed gratitude for the development and urged the two former Governors to put behind their ordeals and concentrate on the task of making the nation a better place.\nThis shows that the pardon of the former Governors is indeed the wishes of the people .\n“We express our gratitude to the President for heeding the calls by many including Senator Jonah David Jang who in 2021 made a passionate appeal to Mr. President for the pardon and release of Senator Dariye and former Governor Jolly Nyame to enable them contribute their quota to the development of the nation.\nWe also urge both leaders to put behind their ordeals and concentrate on the onerous task of making the nation a better place.”"
  },
  {
    "headline": "Lekki-Ikoyi link bridge: Lagos suspends planned collection of tolling indefinitely",
    "summarized_story": "Governor Babajide Sanwo-Olu of Lagos StateBy Olasunkanmi AkoniLagos State Government, in collaboration with Lekki Concession Company Limited, LCC, has suspended resumption date of toll collection at the Ikoyi Link Bridge Toll Plaza indefinitely.\nMeanwhile, after several engagements with critical stakeholders, LCC decided to shift the resumption date of toll collection at the Ikoyi Link Bridge Toll Plaza, till further notice.\nRecall that Governor, Babajide Sanwo-Olu had conceded to make some concessions over the planned resumption of tolling to the Ikoyi Link Bridge, and Lekki-Epe Expressway areas of the state.\nPersonalities at the meeting, included: leaders of the Lekki Residents Association, LERA, Lekki Residents and Stakeholders Association,LERSA.\nThe letter read: “We recall that the Federal High Court in Lagos had in the recent past effectively declared the tolling of the Lekki-Ikoyi Link Bridge as illegal and unconstitutional."
  },
  {
    "headline": "Chidi Ikediashi foundation offers free medical outreach in Delta",
    "summarized_story": "Chidi Ikediashi Foundation on Friday administered free healthcare services to indigenes of Obulu Okiti, a community in Aniocha South local government area of Delta state.\nHowever, this foundation’s service will cut across all the local government areas in Delta state.\nChairman of Aniocha South local government council, Jude Chukwuweike, commended Ikediashi for carrying out the laudable healthcare service to his people.\nHe said this venture is what the state has been praying for, that is individuals who will complement and support the programmes of the Delta state government.\nYou cannot preach the gospel of stronger Delta or Think Delta First without the people being healthy.”"
  },
  {
    "headline": "Recruitment: Police Command invites applicants for CBT",
    "summarized_story": "The Police Command in Lagos State has asked applicants that had been screened for recruitment into the force to come for its Computer Base Test (CBT) on Wednesday, April 20, 2022, at 8.\nThe Command’s spokesperson, SP Benjamin Hundeyin, stated this in a statement on Friday.\n“The Command invites the public, particularly indigenes of Lagos State , who had been screened for the 2021 Nigeria Police Force recruitment exercise that preparation into the next phase of the exercise has commenced.\nREAD ALSO:“Successful applicants who had been notified about their status are advised to proceed to West Africa Examination Council (WAEC) Testing and Training Centre, Ogba, Lagos State, with their CBT examination slips for the exercise.”He said that the Commissioner of Police, Lagos State, CP Abiodun Alabi, had extended his best wishes to all the prospective candidates and urged them to conduct themselves appropriately before, during and after the exercise.\nHundeyin said that prospective candidates should call: 08100004507 for further enquiries on the exercise."
  },
  {
    "headline": "We must discuss issues dividing Nigeria now – Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo said there is a need for frank discussions among Nigerians on issues that cause division.\nOsinbajo believes this would find lasting solutions and also chart the way forward towards building a better and more united nation.\nOn the significance of the book and the lessons, Osinbajo noted that citizens need to talk “more to ourselves not at ourselves”.\n“We need frank discussions on the issues that divide us, we need openness about our fears and prejudices.\nOthers were former Secretary General of the Commonwealth, Chief Emeka Anyaoku; Prof. Femi Osofisan, who reviewed the book."
  },
  {
    "headline": "Easter: Ortom calls for peaceful coexistence among Nigerians",
    "summarized_story": "Benue State Governor, Samuel Ortom, has called for peaceful coexistence among Nigerians as the needed elixir for development to take place.\nGovernor Ortom said an atmosphere of peace and cooperation between the government and the governed was the needed ingredient for any development or progress in any nation.\nIn his goodwill message to Nigerians to commemorate this year’s Easter celebration, the Governor also canvassed for religious tolerance among different religious adherents.\nWe must therefore address these perceived injustices for our nation to begin to enjoy the harmony,” he stated.\nGovernor Ortom prayed that the joy of the season would permeate and be sustained in every part of the country even in the face of the daunting challenges the country is facing."
  },
  {
    "headline": "Tuberculosis: Don’t sleep in same room with others – Expert to patients",
    "summarized_story": "Dr Rasheed Odunola, Director of Health Services, University of Ilorin Teaching Hospital (UITH), has advised people with Tuberculosis (TB) to avoid sleeping in the same room as others.\nThe expert stressed the importance of ventilating patients’ rooms and the use of tissue to cover the mouth anytime they sneeze or cough.\nOdunola stated that early diagnosis and treatment are the most potent way to curb the spread of TB.\nThe expert said a person may develop the disease after inhaling Mycobacterium tuberculosis usually spread through air droplets.\nThe director counselled smokers to quit, adding that cigarettes and the likes increase the risk of developing TB and make treatment harder."
  },
  {
    "headline": "South Africa flood: Buhari seeks collective response by African countries in tackling natural disasters",
    "summarized_story": "President Muhammadu Buhari has described the flood that claimed over 300 lives in South Africa as saddening and highly devastating.\nIn a message of sympathy to the South African Government, Buhari said the wave of human and natural disasters, including climate change, should call for a collective approach to tackling them.\nHe took to a statement by his media aide, Garba Shehu to express his sympathy.\nRecall that a flood occurred in Kwazulu Natal Province of South Africa which has so far claimed 341 lives.\nReacting to the calamity on Friday in Abuja, the President said, “I’m greatly shocked by this large-scale natural disaster which has caused widespread sufferings and fatalities in our sister country.”He explained that “the disruption of water and electricity supply, as well as the destruction of homes, makes this natural disaster one of the worst in our recent memory.”While extending his sympathy to the government and people of South Africa, Buhari suggested that other African leaders should “work together towards developing common and effective strategies for improving our emergency management response systems that will help us significantly reduce the human and economic impacts of natural disasters and impending climate change.”"
  },
  {
    "headline": "No one should remain in abusive marriage – Bishop Onyia",
    "summarized_story": "The religious leader, in his Easter message signed by spokesman Chiwuike Uba, stated that “no one should remain in an abusive marriage”.\nHe urged Nigerians to reflect on the resurrection of Jesus Christ, and rededicate themselves to living in peace, oneness and love of God.\nThe Bishop said despite the insecurity across the federation, Nigerians should not lose trust in God but live in peace and unity.\nOnyia appealed to citizens not to allow ethnicity, religious beliefs or places of origin to continue to divide Nigeria.\nThe Bishop declared that violence against women “is both a sin and a crime” and “is never justified.”“No one should remain in an abusive marriage."
  },
  {
    "headline": "Imo attack: INEC makes contact with two missing staff",
    "summarized_story": "The Independent National Electoral Commission (INEC) has established contact with two of its staff missing after yesterday’s attack by gunmen in Ihitte Uboma Local Government Area of Imo State.\nIt would be recalled that the gunmen who stormed the commission’s registration centre in the local government area shot dead a staff of the commission.\n“The Commission has now established contact with two of our staff missing after yesterday’s attack in Ihitte Uboma.\nThe statement reads in part, “We strongly condemn the attack on INEC staff at Ihite Uboma LGA of Imo State.\n“We want to make it publicly known that IPOB and its security units did not attack INEC officers in Imo State."
  },
  {
    "headline": "Insecurity: Get ruthless with bandits, NGF tells FG",
    "summarized_story": "THE Nigeria Governors’ Forum (NGF) has asked the Federal Government to be ruthless with bandits and other criminals behind the nation’s heightening security challenges.\nNGF Chairman and Governor of Ekiti State, Kayode Fayemi, spoke for the group during a visit to his Kaduna State counterpart, Nasir el-Rufai, over the recent train attack in the state.\nHe disclosed that there were 61 Kaduna indigenes still recuperating from the train attack, including a top government official and his eight-month pregnant wife.\nHe thanked the NGF delegation, which included Governor Muhammadu Badaru of Jigawa State, for its efforts and the donation.\nEarlier, Kaduna State Deputy Governor, Dr Hadiza Balarabe, had called the train attack a demoralising experience which she prayed the state would never witness again."
  },
  {
    "headline": "FG begins talks with terrorists who bombed Abuja-Kaduna train",
    "summarized_story": "Jimoh also warned the Nigerian Railway Corporation (NRC) against the proposed resumption of train services without first rescuing the kidnapped victims.\nHer words: “The NRC mooting the idea of resuming train services’ is inhuman.\n“The authorities need to sit down and think of how to rescue those in captivity and not the resumption of train services.\n“What are train services compared to human lives?\n“Let us warn the NRC not to contemplate or attempt to resume train services without rescuing our loved ones in the den of the bandits."
  },
  {
    "headline": "FG begins talks with terrorists who bombed Abuja-Kaduna train",
    "summarized_story": "The Federal Government has begun talks with terrorists who killed nine passengers and abducted about 70 others during an attack on Abuja-Kaduna train.\nRelatives of the kidnapped victims disclosed this on Friday.\nThey however asked the government to hasten negotiation with the terrorists and shelve the idea of resuming the train services while their loved ones remain in captivity.\nThe families, who addressed a press conference in Kaduna on Friday, lambasted the Minister of Transportation, Rotimi Amaechi for declaring his presidential ambition few days after the train attack.\nThey described the Amaechi’s declaration as most uncharitable, saying he ought to have resigned rather than celebrating as the train attack happened under his nose."
  },
  {
    "headline": "Umar to FG: forget census, secure Nigeria",
    "summarized_story": "A former Military Governor of Kaduna State, Col. Abubakar Dangiwa Umar has said the Federal Government should secure the country instead of conducting census.\nHe said at this point, census is not a priority for the country.\nUmar, who is also the chairman of the Movement for Unity and Progress, made his position known in a, statement in Abuja.\n“A country that is facing existential challenges such as unprecedented level of insecurity, collapsing economy cannot have as one of its priorities the conduct of a National census.\n“A National census at this point is certainly not a priority assuming that its conduct is possible.”"
  },
  {
    "headline": "Tanko Yakasai: How Buhari’s govt can stop insecurity",
    "summarized_story": "To solve the problem of insecurity in Nigeria, you have to tackle the problem of unemployment in the country and then, poverty.\nBut honestly speaking do you think President Buhari and his security apparatus in Nigeria can tackle the problem of insecurity in the country?\nAnd seven years is gone, the problem of insecurity in Nigeria has not been tackled or addressed.\nIt has gone worse from where we areHow do you say that a retired General cannot tackle insecurity?\nThere are many Bardes who are making their own money under the guise of fighting insecurity and insurgency in the country."
  },
  {
    "headline": "Insecurity: Defend your territories against invaders, MBF tells residents",
    "summarized_story": "“ It is instructive that as the 2023 campaigns gather momentum, the intensity of these attacks is set to increase, with the sole purpose of annihilating communities of the Middle Belt by the invaders.\n“The Middle Belt Forum completely condemns this gradual return to the bloody days of horrifying assaults that are presently assuming a genocidal level.\nNo nation can survive this level of crippling insecurity that has rendered life short and brutish for many communities in the Middle Belt Region.\n“We call on the international community to beam its searchlight on the horrendous massacres of the Middle Belt peoples being carried out under the watch of President Buhari.\n“The Middle Belt Region has lost faith in the capacity of President Buhari to secure the lives and property of Nigerians."
  },
  {
    "headline": "Anambra: Gunmen invade Soludo’s hometown, injure policemen",
    "summarized_story": "From Obinna Odogwu, AwkaThree policemen sustained gunshot injuries when gunmen attacked their security post in Isuofia community, Aguata Local Government Area of Anambra State.\nIsuofia is the hometown of the state governor, Prof. Chukwuma Soludo.\nHe said that the gunmen did not attack the community but that they were passing along the road connecting Isuofia and Ekwulobia.\nWe created observation points where we monitor the activities of criminals.\nSo, what happened was that one of our observation points along Ekwulobia Road came under attack by hoodlums."
  },
  {
    "headline": "Kalu, an asset to Nigeria –Senate President",
    "summarized_story": "From Okey Sampson, Umuahia and Kenneth UdehSenate President, Dr Ahmad Lawan has described the Chief Whip of the Senate, Dr Orji Uzor Kalu as an asset not only to Abia North Senatorial District and the South-East, but to the entire Nigeria.\nThe Senate President praised the people of Abia North for voting in a worthy representative in Kalu who he said has been able to utilise his three years in the Senate to achieve what others before him could not do in the past 20 years.\nThe Senate President stressed that he is willing to work with Kalu more for the betterment of Abia North and the entire country.\nHe said that the commissioning of the projects which attracted the presence of the Senate President was in fulfilment of those promises made three years ago.\nKalu said that the completion of the projects was made possible through the rural transformation programmes of President Muhammadu Buhari and the Senate President."
  },
  {
    "headline": "Easter: Kalu, Wike, Sanwo-Olu, Tinubu, others urge Christians to emulate Christ",
    "summarized_story": "Chief Whip of the Senate, Dr. Orji Uzor Kalu, urged Nigerians to use the Easter season for sober reflection as individuals and as a nation.\nAccording to him, Christians must emulate the exemplary life of Jesus Christ in order to build a decent society.\nDescribing Easter as a special celebration in commemoration of the resurrection of Jesus Christ, Kalu called on Christians to pray for the nation and leaders at all levels.\nRivers State governor, Nyesom Ezenwo Wike, also felicitated Christians on the celebration of Easter, urging them to emulate Jesus Christ by making sacrifices that will advance the course of development.\nLagos State governor, Mr. Babajide Sanwo-Olu congratulated Lagosians, especially Christians in the state on the commemoration of the death and resurrection of Jesus Christ."
  },
  {
    "headline": "Gunmen Invade Soludo’s Community, Kill One Policeman",
    "summarized_story": "David-Chyddy Eleke in AwkaGunmen on Friday invaded Isuofia Community, Aguata Local Government Area, where Anambra State governor, Prof Charles Soludo, hails from.\nTHISDAY gathered one police man was killed in the process, and that the incident happened at a junction leading to the governor’s house.\nA source said the gunmen stormed the junction, where security operatives were stationed, attacking the operatives.\nThe source said the gunmen were angered by the idea of stationing a security post in the area.\n“One police man was however killed in the process,” the source said."
  },
  {
    "headline": "Breaking: Orlando Julius Dies at 79",
    "summarized_story": "Vanessa ObiohaOne of Nigeria’s most decorated highlife musicians, Orlando Julius Ekemode has died.\nBefore then, he had been tutored by Highlife musician Jazz Romero.\nWith Okonta’s band, Julius performed in many gigs and opened for the American trumpeter and vocalist Louis Armstrong.\nJulius also opened for the iconic American musician James Brown.\nJulius formed the Ashiko movement and taught people his style of music although he did not stay in this position for long."
  },
  {
    "headline": "Council of State Meets, Receives Briefing on Insecurity, Dariye, Nyame, 157 Others Pardoned",
    "summarized_story": "The two former governors were among 159 convicts pardoned by the council at the meeting held at the Council Chambers of the State House, Abuja.\nBuhari would follow up the discussions at the NCS gathering with a meeting of the National Security Council (NSC) to review the current security situation in the country.\nThe security council comprises Chief of Defence Staff (CDS), the three service chiefs, Inspector General of Police, and others from the military brass.\nThe National Council of State is an organ of the federal government saddled with the responsibility of advising the executive on policy-making matters.\nState governors in attendance included Hope Uzodinma (Imo), Kayode Fayemi (Ekiti), Atiku Bagudu(Kebbi), Bello Matawalle (Zamfara), and Nasir El Rufai (Kaduna)."
  },
  {
    "headline": "Senate Sets Up 13-man Panel to Investigate Crude Oil Theft",
    "summarized_story": "Also yesterday, the Senate approved a revised budget of N17,319,704,091,019 trillion for the 2022 fiscal year.\nAlso, the Senate approved the total sum of N4 trillion for petrol subsidy in 2022.\nThe figure represented an increase of N192.5 billion from the N17.1 trillion approved and assented to last December.\nThe red chamber, in the MTEF/FSP approved oil benchmark $73 per barrel as proposed by President Muhammadu Buhari.\nIt also approved oil production volume of 1.600m per day."
  },
  {
    "headline": "US Report: Nigerian Judicial Officers Demand Bribe for Favourable Rulings",
    "summarized_story": "“Many citizens encountered long delays and reported receiving requests from judicial officials for bribes to expedite cases or obtain favourable rulings,” the report stated.\nIt listed understaffing, inefficiency, and corruption as factors preventing the judiciary from functioning adequately.\n“Federal and state governments, however, often undermined the judiciary by withholding funding and manipulating appointments,” the US report noted.\nThe US document stated: “The ICPC holds broad authority to prosecute most forms of corruption.\nThe law provides for recognition and enforcement of damages awarded to plaintiffs, but it was unclear whether this happened,” the report stated."
  },
  {
    "headline": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
    "summarized_story": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19."
  },
  {
    "headline": "President Donald J. Trump’s Concession Speech, By Rudolf Okonkwo",
    "summarized_story": "The first time I ran for office, I ran for president.\nI have shown you that everything is possible if you have the right man to do the right job.\nThanks to me, they will grow up knowing that ours is a Christian nation where it is allowed to say Merry Christmas.\nTell those terrible lowlifes that they have proved themselves unworthy of Donald Trump’s genius and have opted to reduce America to a Second Class nation in the world.\nYours truly,President Donald J. TrumpThe 45th President of the United States."
  },
  {
    "headline": "Bandits Free Niger State Monarch After 45 Days In Captivity, N10million Ransom",
    "summarized_story": "The Dodo of Wawa community, Niger State, Dr Mahmoud Ahmed Aliyu, has been freed by his abductors after spending 45 days in their captivity.\nHe was said to have been released at about 7:30pm on Tuesday after the payment of N10million ransom to the bandits.\nThe Wazirin Wawa, Alhaji Ja’afar Ibrahim Bio, confirmed the release of the traditional ruler to Daily Trust, on the telephone but declined comment on how much was paid to secure his release.\nIn a video shared by his family, the traditional ruler was seen in a white turban being welcomed by his family and members of the palace.\nAliyu was abducted in his palace by heavily armed men around 9pm on September 4."
  },
  {
    "headline": "The Teflon President With Nine Lives Is On His Way Out By Dr. Wumi Akintide",
    "summarized_story": "The Teflon President with nine lives I have in mind is nobody else but Donald J. Trump.\nIn cahoots with Trump, Republicans have not ended their campaign of calumny to humiliate, blackmail and delegitimize Barack Obama, the first black President.\nThe one-term young Senator from Illinois was elected President in 2008 and re-elected again in 2012 with a wider margin.\nThe voters concluded he had told a lie even though he was one of the most honorable and dependable men of honor ever to serve as American President.\nThe list goes on and on without end but Donald Trump is still there despite an abysmal approval opinion of only 33 percent or less."
  },
  {
    "headline": "Abuja-Kaduna rail operations mustn't resume until captives are rescued, families warn FG",
    "summarized_story": "Relatives of passengers abducted during an attack on an Abuja-Kaduna train have warned the federal government against resuming operations along that route until their loved ones have been rescued.\nThe families of the abducted train passengers had, on Monday, given the federal government a 72-hour ultimatum to rescue the captives.\nAdvertisementSpeaking at a media briefing in Kaduna on Friday, Abdulfatai Jimoh, on behalf of the families, said the authorities should not be speaking about resuming train services until their loved ones have been rescued.\n“The first thing should be to get the captives out and then, they can put adequate measures in place and resume services so that this does not happen again in future.\nAdvertisement“We want to believe that they will not do it [resume rail operations], because if they do, we will not take it lightly with them."
  },
  {
    "headline": "Abuja-Kaduna rail operations mustn't resume until captives are rescued, families warn FG",
    "summarized_story": "Relatives of passengers abducted during an attack on an Abuja-Kaduna train have warned the federal government against resuming operations along that route until their loved ones have been rescued.\nThe families of the abducted train passengers had, on Monday, given the federal government a 72-hour ultimatum to rescue the captives.\nAdvertisementSpeaking at a media briefing in Kaduna on Friday, Abdulfatai Jimoh, on behalf of the families, said the authorities should not be speaking about resuming train services until their loved ones have been rescued.\n“The first thing should be to get the captives out and then, they can put adequate measures in place and resume services so that this does not happen again in future.\nAdvertisement“We want to believe that they will not do it [resume rail operations], because if they do, we will not take it lightly with them."
  },
  {
    "headline": "Twitter adopts 'poison pill' to prevent Elon Musk from increasing stake",
    "summarized_story": "Twitter says it has adopted a limited duration shareholder rights plan, known as a “poison pill”.\nIn a statement on Friday, the company said its board of directors voted unanimously to adopt the strategy.\nThe poison pill is often used to intercept hostile corporate bids by diluting the stake of the entity eyeing the takeover.\n“The Board adopted the Rights Plan following an unsolicited, non-binding proposal to acquire Twitter,” the statement reads.\nAdvertisement“The Rights Plan is intended to enable all shareholders to realize the full value of their investment in Twitter."
  },
  {
    "headline": "Twitter adopts 'poison pill' to prevent Elon Musk from increasing stake",
    "summarized_story": "Twitter says it has adopted a limited duration shareholder rights plan, known as a “poison pill”.\nIn a statement on Friday, the company said its board of directors voted unanimously to adopt the strategy.\nThe poison pill is often used to intercept hostile corporate bids by diluting the stake of the entity eyeing the takeover.\n“The Board adopted the Rights Plan following an unsolicited, non-binding proposal to acquire Twitter,” the statement reads.\nAdvertisement“The Rights Plan is intended to enable all shareholders to realize the full value of their investment in Twitter."
  },
  {
    "headline": "LCC postpones resumption of tolling at Lekki-Ikoyi link bridge",
    "summarized_story": "The Lekki Concession Company (LCC) has announced the postponement of toll collection at the Lekki-Ikoyi link bridge.\nIn a statement on Friday by Yomi Omomuwasan, managing director of LCC, the company said a new date would be announced soon.\nToll collection was due to resume on April 17, following the reopening of the toll plaza on April 1 — despite controversy over the resumption of tolling operations.\nAdvertisementHowever, LCC said the decision to suspend tolling was taken to give residents more time to register for electronic toll devices.\n“The preparatory operations to resume tolling on the Bridge have been smooth so far, and we are grateful to all the key stakeholders for their cooperation."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Digital Nomads: Julian Owusu’s journey from football to fintech",
    "summarized_story": "Even though football held a promising future for Julian, it was only one of his dreams.\n“I grew up playing football,” he says, “But I’ve always been interested in tech, even long before I started playing professionally.”At the beginning of his football career, Julian knew he wanted to tell a different story with his journey.\nI wanted to be different.”He started his professional journey at 16 when he joined Eleven Wise—a Division One football league club based in Ghana—as a striker.\nWhen football players on defining paths, such as Julian, retire, it’s often because of injury.\n“It was difficult at the beginning, but all the skills I’d learnt playing football were transferrable."
  },
  {
    "headline": "MTN Nigeria secures approval to operate Mobile Money Bank",
    "summarized_story": "MTN Nigeria, the Nigerian arm of Africa’s largest telecom, today received final approval from the Central Bank of Nigeria to run a payment service bank.\nWith this approval, MTN Nigeria can provide virtually all the services offered by conventional commercial banks with the exception of granting credit and processing foreign exchange transactions.\nThis announcement follows a previous approval in principle granted in November 2021, to Airtel Africa Plc and MTN Nigeria Communications Plc to operate a payment service bank in the country.\nIn January, MTN revealed that MTN Nigeria’s mobile money service had attracted 9.4 million active users since launching in August 2019.\nThis approval is expected to spur the adoption of mobile money in Nigeria as the use cases increase."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there!\nInteresting times.\nThey say, “if you want something done right, do it yourself.” This is the closest..."
  },
  {
    "headline": "Uber doesn’t want to Friyay",
    "summarized_story": "Uber Tanzania suspends operationsYesterday, Thursday, April 14, 2022, ride-hailing company, Uber, suspended operations in Tanzania until further notice after six years in the country.\nIn Nigeria, Uber increased rates on its UberX platform by 13% in Lagos and 20% in Nigeria’s capital, Abuja.\nSince then, 95 companies have participated as of the Winter 2022 launch, about half of which are financial services providers, and 51 are from Nigeria.\nIt means that OPay cards will be linked to OPay’s mobile app, allowing users to request the issuance or cancellation of prepaid cards.\nThe prepaid cards will be distributed in collaboration with Egyptian Cards Company, the largest card distributor in the local and regional markets."
  },
  {
    "headline": "Can embedded finance drive financial inclusion in Nigeria?",
    "summarized_story": "An embedded finance play involves a company, usually not a financial institution, offering a financial service in addition to its existing offers.\nWhichever way you look at it, embedded finance seems like a good deal for everyone involved, so how does that affect financial inclusion in Nigeria?\nAccording to the World Bank, financial inclusion means that businesses and individuals have access to financial products and services that meet their needs responsibly and sustainably.\nHowever, considering financial inclusion can be achieved in other ways besides using a bank account, this may not be an accurate representation of financial inclusion in Nigeria.\nAdvertisementBy integrating financial services into non-financial solutions, more Nigerians can be integrated into the financial system without requiring a bank account."
  },
  {
    "headline": "Is Flutterwave’s CEO guilty of insider trading or not?",
    "summarized_story": "Anyway, today, I’ll be discussing:Flutterwave CEO’s insider trading allegationHow VC firm, Katapult, investsUmba’s $15 million Series AIs Flutterwave’s CEO guilty of insider trading or not?\nSince then, the phrase “insider trading” has topped my Twitter trend tables.\nIf Chimgozirim’s informant uses this insider information to profit in the stock market, all three involved are guilty and can be prosecuted.\nWhat does the law say about insider trading?\nInsider trading laws apply to private and public companies and transactions involving employees, employee stock plans, and third-party shareholders."
  },
  {
    "headline": "Nigerian banks hit by ‘Great Resignation’ of top tech talent",
    "summarized_story": "Nigerian banks have been hit by an exodus of tech talent, chief executives of the nation’s lenders say.\nHe referred to it as a “great resignation.”The meeting came as traditional lenders in Africa’s largest economy face stiff competition for talent from technology startups attracting increased funding from international investors and offering better working conditions, in and outside the country.\nRead also: More Nigerian tech developers set sights on jobs abroadAfrica-focused startups raised a record $5 billion last year, with those specializing in digital and mobile payments and lending soaking up most of the funding.\nTwo economic contractions in the last five years have also forced some Nigerians with globally marketable skills to leave the country, with the U.S., Canada and U.K. being preferred destinations.\nThe digital currency app has more than 756,000 downloads since its launch in October, she said, adding that the consumer wallet has 165,000 downloads and the merchant wallet 2,800."
  },
  {
    "headline": "Nigerians spent N2.3 billion on action movies in 2021",
    "summarized_story": "According to the most recent statistics, Nigerian moviegoers paid more for action films in 2021.\nAccording to Insightful cinema, the genre grossed over N2.3 billion in Nigerian cinemas in 2021, making it the highest-earning movie genre, with Hollywood accounting for 67 percent (36) of all action movies exhibited.\nWith a combined gross of N95.2 million, Nollywood action films such as ‘Devil in Agbada’, ‘Mamba’s Diamond’, and ‘The Cleanser’ were the highest-grossing Nollywood action films.\nIn 2021, the drama genre accounted for little under 80 percent of the 124 Nollywood films that were released in theaters.\nThere were 23 Nollywood movies in the Comedy category, accounting for barely 19 percent of all films in the industry."
  },
  {
    "headline": "Nigeria’s inflation hits 15.92% as energy, food prices soar",
    "summarized_story": "Nigeria’s headline inflation rate witnessed yet another significant uptick in the month of March as it increased by 15.92 percent on the back of soaring food and energy prices.\nNigeria’s consumer price growth surpassed 15 per cent in March, its fastest pace since last year following a surge in the cost of energy and food, maintaining pressure on the CBN to take decisive actions to tackle inflation.\nHeadline inflation increased by about 0.22 percent higher than the 15.70 percent witnessed in February inflation report.\nRead also: Nigeria’s inflation rises in February amid fuel shortagesFood inflation increased to 17.20% in February as against 17.11% the previous month.\nThe rise in food index was caused by increases in prices of bread and cereals, food products n.e.c., potatoes, yam and other tubers, oils and fatsCore inflation, which excludes the prices of volatile agricultural produce stood at 13.91 percent month-on-month, down 0.1 percent compared to 14.01 percent in February 2021."
  },
  {
    "headline": "Edo rallies stakeholders, assures programmes to preserve, promote cultural heritage – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has urged for the collaboration of all stakeholders to preserve and promote the state’s rich cultural heritage, reassuring that the government will sustain efforts at preserving the state’s cultural assets and drive growth in the arts, culture and tourism sector.\nThe Edo State Commissioner for Arts, Culture and Diaspora Affairs, Hon.\nBamidele Obaitan, made the call during a meeting with stakeholders in the arts and culture sector, in Benin City, the Edo State capital.\nHe, however, advised heads of social and cultural departments in the local councils to collate the data of all cultural and tourism sites as well as a compendium of all festivals at the grassroots for effective documentation.\nHe further revealed the government’s plan to assist self-employed youths with grants through the African Development Bank (AfDB)."
  },
  {
    "headline": "Good Friday: Obaseki tasks Christians on love, tolerance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Governor, Mr. Godwin Obaseki, has enjoined Christians across the country to emulate the virtues of tolerance, love and selflessness as espoused by Jesus Christ in commemoration of Good Friday.\nObaseki gave the charge in a message to mark Good Friday, a Christian holiday in preparation for the Easter celebration.\nThe governor noted, “As the Christian faithful celebrate the sacrifice of Jesus Christ on Calvary, I urge everyone to take this opportunity to reflect on the significance of this day which embodies Christ’s love for mankind by imbibing the virtues of love, tolerance and selflessness.\n“It is only when we are able to tolerate and accommodate others; love one another irrespective of religious, political, ethnic, or ideological differences, and live selflessly as Jesus Christ did by sacrificing his life on the cross, that we will be able to tackle the many challenges facing us as a country and people.”Obaseki noted, “As we celebrate Good Friday, I urge all to be our brother’s keeper, uphold the spirit of togetherness and remain resolute on our love for God and our nation.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Buhari, Obaseki unveil 68 housing units in Edo, seek stakeholders’ support to tackle deficit – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestPresident Muhammadu Buhari and the Edo State Governor, Mr. Godwin Obaseki, on Thursday, commissioned 68 housing units, under the National Housing Programme (NHP) Phase 1, in Uhunmwonde Local Government Area of Edo State.\nObaseki, at the unveiling of the units, called for increased collaboration between the state and federal governments, as well as other stakeholders to address the housing deficit in the country.\nThe governor said, “As the National Bureau of Statistics has shown, we have over twenty million housing deficit in Nigeria, which means that very many Nigerians are living without proper shelter.\n“For us in Edo, we are very committed to housing projects.\nThis is one of the first phases of the several phases of the Federal Government Housing projects since 2016.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Senate approves revised 2022 fiscal framework …Approves N4tn for Petrol Subsidy – Nigerian Observer",
    "summarized_story": "Others are Basic Health Care Fund, by N11.58 billion from N56.14 billion to N44.56 billion; and NASENI, by N11.58 billion from N56.14 billion to N44.56 billion.\nLawmakers, who made contributions on the report for the review of the 2022 fiscal framework, attributed the Nigeria’s economic downturn to crude oil theft.\nHe expressed concern over rising cases of oil theft despite huge resources allocated to the military, police and other security agencies.\n“This (crude theft) is not something to play politics with, and I don’t think the answers are going to be easy to come by.\n“So, we need to continue to support the security agencies in whatever way possible so that they are able to deal with this."
  },
  {
    "headline": "NGX launches West Africa’s first exchange traded derivatives market",
    "summarized_story": "Nigerian Exchange Limited (NGX) has announced the launch of West Africa’s first Exchange Traded Derivatives (ETD) Market with Equity Index Futures Contracts on 14 April, 2022.\nTo promote clearing efficiency, stability, and confidence, the Exchange has collaborated with a premier Central Counterparty (CCP) in Nigeria, NG Clearing Limited, to provide the clearing infrastructure for NGX Derivatives Market and its clearing members – Access Bank and Zenith Bank.\nThe ETDs Market will commence with trading activities by the first three Trading License Holders – Cardinal Stone Securities Limited, Meristem Securities Limited and APT Securities and Funds Limited – who have been cleared by NGX Regulation Limited to facilitate transactions on behalf of investors on NGX Derivatives Market.\nETDs are standardised, highly regulated, and transparent financial contracts listed and traded on a securities exchange, and guaranteed against default through the clearing house of the derivatives exchange.\nNGX ETDs market will complement existing asset classes, provide investors and other market players with the necessary tools for tactical asset allocation, as well as improve risk and cost management for effective portfolio management."
  },
  {
    "headline": "Provision of good welfare for security personnel will enhance robust productivity – Oluga",
    "summarized_story": "Taiwo Oluga, the lawmaker representing Ayedaade/Irewole/Isokan constituency at the house of representatives has said security personnel will be more effective if they are provided with adequate welfare.\nOluga emphasised the need for stakeholders to be concerned about the welfare of security personnel as a way of addressing rise of crime and criminality in the country.\n“If we truly want effective security, we have to be concerned about the welfare of our security personnel.\n“We have passes a number of bills at the House of Representatives to take care of their welfare and outfit.\nOluga proceeded to Gbongan High School, Gbongan – Ayedaade local government headquarters, where the State Governor inaugurated a block of classrooms and the Nigeria Digital Center she facilitated."
  },
  {
    "headline": "Osun: Oyetola’s govt will continue to ensure peaceful coexistence – Finance Commissioner",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun Finance Commissioner, Mr Bola Oyebamiji has assured all residents of the state that governor Adegboyega Oyetola’s administration would continue to create enabling environment for peace to reign irrespective of religion differences.\nThe Commissioner stated this while playing host to the Nasrul Lahi l Fatih Society of Nigeria (NASFAT) on a Ramadan Lecture to enlighten Muslims and discuss issues affecting Islam in the country.\nWhile acknowledging ulammas for their contribution in the propagation of Islam, Oyebamiji said Governor Oyetola is still very determined and resolute in his desire to place the State on a higher pedestal of development.\nHe assured residents of the state of a peaceful, free and fair gubernatorial elections come July of this year, while urging them to vote for a continuous growth and development of the state which Governor Oyetola has promised.\nGuests who thronged the resident of the Commissioner from within and outside the State also observed Iftaar with different food items which was made available."
  },
  {
    "headline": "Zenith Bank appoints Nwapa, Akindele, others as directors",
    "summarized_story": "Zenith Bank Plc, Nigeria’s top lender, has appointed Mrs. Adobi Stella Nwapa and Mr. Anthony Akindele as Executive Directors of the company, just as it named Mr. Peter Olatunde Bamkole and Mr. Chuks Emma Okoh, as Independent Non-Executive Director and Non-Executive Director, respectively.\nMr. Anthony Akindele Ogunranti:Mr. Anthony Akindele Ogunranti is a consummate professional banker with over 30 years’ experience in the Banking Industry.\nMr. Ogunranti joined Zenith Bank Plc in 2004 as a Senior Manager and has held various leadership positions in the bank.\nPrior to his appointment as Executive Director, he served as the MD/CEO, Zenith Bank Ghana Limited, where he led the Bank to achieve exceptional performance.\nMr. Chuks Emma Okoh:Mr. Chuks Emma Okoh joins the board of Zenith Bank Plc as a Non-Executive Director with over thirty (30) years of cognate experience in the Banking industry & Telecommunications sector."
  },
  {
    "headline": "Easter: Presidential Aspirant, Ajadi, Urges Nigerians To Be Steadfast, Hopeful",
    "summarized_story": "Presidential aspirant, Olufemi Ajadi, has felicitated with Nigerians at Easter, urging Christians to remain steadfast and hopeful for a better Nigeria, just as the death and resurrection of Jesus Christ ushered in a new dawn for Christian faithful.\nAjadi who is working diligently to succeed President Muhammad Buhari by the 2023 said Nigerians should be hopeful that the lost glory of the nation would be regained soon.\n“In this season of rebirth, may you feel your faith renewed and your heart made new with the hope Easter brings.\nI am praying your Easter will be bright with the hope and joy of our risen Saviour.\nI wish you and your family the happiest Easter,” he said."
  },
  {
    "headline": "JUST-IN: Nigeria Gets US Nod For Another 12 Fighter Jets",
    "summarized_story": "The United States has approved the sale of 12 AH-1Z Cobra attack helicopters to Nigeria worth about $1bn.\nThe development followed the delivery of 12 Super Tucano attack aircraft last year despite concerns of rights violations.\nThe Defense Security Cooperation Agency on Thursday announced the sale of the helicopters and related defence systems to the Nigerian military.\nForeign Policy had reported in July 2021 that the top Democrat and Republican on the Senate Foreign Relations Committee delayed the sale amid concerns Nigerian President Muhammadu Buhari was drifting toward authoritarianism.\n“This sale will be a major contribution to US and Nigerian security goals,” it addedThe development appears to open a new chapter in US-Nigeria relations."
  },
  {
    "headline": "JUST-IN: Nigeria Gets US Nod For Another 12 Fighter Jets",
    "summarized_story": "The United States has approved the sale of 12 AH-1Z Cobra attack helicopters to Nigeria worth about $1bn.\nThe development followed the delivery of 12 Super Tucano attack aircraft last year despite concerns of rights violations.\nThe Defense Security Cooperation Agency on Thursday announced the sale of the helicopters and related defence systems to the Nigerian military.\nForeign Policy had reported in July 2021 that the top Democrat and Republican on the Senate Foreign Relations Committee delayed the sale amid concerns Nigerian President Muhammadu Buhari was drifting toward authoritarianism.\n“This sale will be a major contribution to US and Nigerian security goals,” it addedThe development appears to open a new chapter in US-Nigeria relations."
  },
  {
    "headline": "MNJTF Airstrikes Kill Another Top ISWAP Commander, Abu-Fatima, 15 Fighters",
    "summarized_story": "The troops of the Multinational Joint Task Force (MNJTF), have eliminated a top Boko Haram/Islamic State West Africa Province (ISWAP) Commander, Abu Fatima and 15 other fighters in a massive joint air strikes jointly conducted in the fringes of the LakeChad.\nIt was gathered after a ground assessment that Abu-Fatima, a high ranking ISWAP Commander of Rijal Amne (Special Forces), who took over from Bakura RPG and Adam Kaiga after they were killed in the previous military Airstrikes, was nutrialised in the attack.\nHe said the deadly ISWAP Commander who has about 500 fighting militant troops under his special forces command had his jurisdiction in the entire southern islands, including Kirta Wulgo, Sabon Tumbu, and Kwaleram, Sigir and Jibularam, Abbaganaram and Yarwa Kura.\nADVERTISEMENTThe source said that the Commander had previously led his fighters to many attacks against the Nigerian Military formations in Kukawa, Abadam, Malam Fatori and Marte local government areas.\n“The intensified intelligence-led COIN ground and aerial offensives have pushed the Boko Haram/ISWAP terrorists to seek refuge around the riverbanks between Nigeria and Niger Republic."
  },
  {
    "headline": "MNJTF Airstrikes Kill Another Top ISWAP Commander, Abu-Fatima, 15 Fighters",
    "summarized_story": "The troops of the Multinational Joint Task Force (MNJTF), have eliminated a top Boko Haram/Islamic State West Africa Province (ISWAP) Commander, Abu Fatima and 15 other fighters in a massive joint air strikes jointly conducted in the fringes of the LakeChad.\nIt was gathered after a ground assessment that Abu-Fatima, a high ranking ISWAP Commander of Rijal Amne (Special Forces), who took over from Bakura RPG and Adam Kaiga after they were killed in the previous military Airstrikes, was nutrialised in the attack.\nHe said the deadly ISWAP Commander who has about 500 fighting militant troops under his special forces command had his jurisdiction in the entire southern islands, including Kirta Wulgo, Sabon Tumbu, and Kwaleram, Sigir and Jibularam, Abbaganaram and Yarwa Kura.\nADVERTISEMENTThe source said that the Commander had previously led his fighters to many attacks against the Nigerian Military formations in Kukawa, Abadam, Malam Fatori and Marte local government areas.\n“The intensified intelligence-led COIN ground and aerial offensives have pushed the Boko Haram/ISWAP terrorists to seek refuge around the riverbanks between Nigeria and Niger Republic."
  },
  {
    "headline": "Loss of 341 lives: I am unspeakably devastated",
    "summarized_story": "President Muhammadu Buhari has said he was “saddened and unspeakably devastated” by the flood disasters in Kwazulu Natal Province of South Africa that has so far claimed 341 lives.\nReacting to the calamity on Friday in Abuja, the President said, “I’m greatly shocked by this large-scale natural disaster which has caused widespread sufferings and fatalities in our sister country.”He explained that “the disruption of water and electricity supply, as well as the destruction of homes, makes this natural disaster one of the worst in our recent memory.”While extending his sympathy to the government and people of South Africa, Buhari urged other African leaders “to work together towards developing common and effective strategies for improving our emergency management response systems that will help us significantly reduce the human and economic impacts of natural disasters and impending climate change.”"
  },
  {
    "headline": "2 arrested over stoning of Justice Aganaba in Bayelsa",
    "summarized_story": "The Command confirmed the arrest in a press statement signed by the Spokesman of the Command, Asinim Butswat on Saturday.\nWe will not condone any form of insecurity or breakdown of law and order in Bayelsa,” Asinim said.\nBayelsa State Police Command in a press statement said:”The Bayelsa State Police Command has remanded two suspects in prison custody for their involvement in the Bayelsa State High court invasion and attack on High court judge.\nThe case before the Court presided over by Justice Nayai Aganaba was the disputed ward, local government and State congresses of the All Progressive Congress (APC) held last year in Bayelsa State.\nThe claimant, Alex Blackson and his brother, Osom Blackson, were reportedly injured during the fracas, leading to a stampede in the court room, while the presiding Judge, Justice Nayai Aganaba, was pelted with stones."
  },
  {
    "headline": "Buhari under fire for pardoning jailed corrupt ex-Govs, Dariye, Nyame",
    "summarized_story": "President Muhammadu Buhari has come under fire over what has been described as his unnecessary, politically motivated, ill-advised and hasty decision to grant pardon to two former Governors jailed for corrupt practices.\nSenator Joshua Dariye of Plateau State and Mr Jolly Nyame of Taraba State, who were convicted for corruption, were recently pardoned on health and age grounds when they still have several years to complete their jail terms.\nHURIWA recalled that the National Council of State had granted state pardon to Dariye and Nyame of Plateau and Taraba States respectively.\nHURIWA recalled that Mr Nyame, who is 66, governor of Taraba State from 1999 to 2007, was serving a 12-year jail term at the Kuje prison for misappropriation of funds while he was in office.\nRelatedly, Mr Dariye who later got elected as Senator, who is 64, and governed Plateau between 1999 and 2007, was jailed for stealing N2 billion of public funds during his time as Plateau State governor between 1999 and 2007."
  },
  {
    "headline": "2023: Posters Depicting Vice-President Osinbajo As Betrayer Surface In Abuja",
    "summarized_story": "Posters describing the Vice-President of Nigeria, Prof Yemi Osinbajo, as a betrayer, was on Friday sighted in some parts of the Federal Capital Territory, Abuja.\nThis may not be unconnected to the Vice President’s recent declaration to contest the 2023 presidential election.\nTinubu, as Lagos governor, had in 1999 appointed Osinbajo as Commissioner for Justice and Attorney-General of the state, a position the law professor held till 2007.\nOsinbajo was a chieftain of the Lagos APC with his polling unit at Code 33, Unit 2 Victoria Garden City, Lagos.\nMeanwhile, Osinbajo’s Chief Media Aide, Laolu Akande, announced that his principal is no longer a member of the All Progressives Congress, APC in Lagos State."
  },
  {
    "headline": "Osinachi: Ex-Minister, Fani-Kayode’s Estranged Wife, Precious Chikwendu Lambasts Critics Of Late Gospel Singer, Shows ‘Physical Abuse Marks’",
    "summarized_story": "Precious Chikwendu, a former beauty queen has lambasted those blaming the late gospel singer, Osinachi Nwachukwu, for not speaking up despite being a victim of domestic violence.\nReacting, Chikwendu, the estranged wife of a former aviation minister, Femi Fani-Kayode said if Osinachi had spoken up, society would have blamed her.\nChikwendu, who said she was also a victim of domestic violence, released photos showing her bloodied nose, legs and other parts of her body as evidence.\nShe wrote, “I’ve been silently reading so much of the blames people are heaping on Osinachi for not speaking up.\nOsinachi would have walked away if she had just a bit of her self-esteem intact, she let go cos (because) she felt worthless.”"
  },
  {
    "headline": "Veteran Saxophonist, Orlando Julius dies at 79",
    "summarized_story": "Popular Nigerian Saxophonist, Orlando Julius has died at the age of 79.\nHis wife, Latoya Ekemode, confirmed his death to the News Agency of Nigeria, NAN, on Friday in Lagos.\nShe said that Orlando Julius passed out in his sleep on Thursday night.\nNAN reports that Orlando Julius, was a saxophonist, singer, band leader, and songwriter closely associated with afrobeat music.\nSome of his musical albums were: Disco Hi-Life, Ololufe, Love, Peace and Happiness; Dance Afrobeat and more."
  },
  {
    "headline": "Easter: Christians brace up for another ‘gloomy’ celebration",
    "summarized_story": "In years past, the Easter season was usually evoked a time of celebration for both Christian and non-Christians as they scheduled events for the holiday.\nSo, you can see why I said the Easter will come and go like any other day.”For Mrs Blessing Benjamin, she was is yet to feel that a major celebration like Easter was coming up.\nAccording to Blessing, who manages a poultry farm, it seemed as if people would not celebrate Easter this year.\nThe activities for the celebration usually commence from the Palm Sunday, which we marked a few days ago as Catholics.\nEaster and all forms of religious celebration are no longer enjoyed because of rising cost of living."
  },
  {
    "headline": "Batch C employment: Npower begins payment of 3-month stipends",
    "summarized_story": "The Federal Ministry of Humanitarian Affairs, Disaster Management and Social Development (FMHDSD) has approved the payment of three months’ backlogs of stipends for Npower non-graduate beneficiaries.\nThis was made public via the official Facebook handle of the National Social Investment Management System (NASIMS).\nBlueprint confirms that the payment will not be for “all non-graduate beneficiaries, but only for those who had undergone and successfully completed their training since the last year 2021”.\nThe announcement added that all Npower non-graduate trainees currently receiving training at different camps are apparently excluded from the batch that will be getting their backlogs payment any time soon."
  },
  {
    "headline": "NASS passes N17.319trn revised 2022 Budget, okays N4trn petrol subsidy, adjourns plenary",
    "summarized_story": "The National Assembly Thursday approved a revised budget of N17, 319,704,091,019 trillion for the 2022 fiscal year.\nThe revised N17.319trillion 2022 budget is predicated on parameters of $73 per barrel oil price benchmark, 1.600million barrels oil production per day and N410 to $1 exchange rate.\nThe National Assembly had in December, 2021, passed a budget of N17, 126,873,917,692 trillion which was also assented to by President Buhari.\nThe revised sum of N17.3 trillion, in contrast to the 2022 budget of 17.13 trillion passed last year, represents a N192.\nBuhari, however, anchored his fresh request on the fact that PMS subsidy was not duly appropriated for in the national budget beyond June."
  },
  {
    "headline": "Bashir Nura Alkali resumes Office as New Permanent Secretary for Works Ministry – NigPilot",
    "summarized_story": "Newly appointed Permanent Secretary of the Federal Ministry of Works and Housing, Mr. Bashir Nura Alkali has resumed duty following the recent approval and redeployment of Permanent Secretaries in the Federal Civil Service by His Excellency, President Muhammadu Buhari.\nEarlier in his remarks, Director Overseeing the Office of the Permanent Secretary, Engr.\nThat tells you the kind of person the new Permanent Secretary is.\nBut it is a gain to us in the Federal Ministry of Works and Housing,’’ Uzo said.\nUzo handed over two sets of handover notes, that of the former Permanent Secretary and that of when he acted as the Director Overseeing the Permanent Secretary’s Office."
  },
  {
    "headline": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE – NigPilot",
    "summarized_story": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE, CALLS BOOT PARTY AN APPENDAGE OF THE ALL PROGRESSIVE CONGRESS (APC)The Alliance of Collaborating Political Parties (ACPP) has condemned the felonious court case instituted against the People’s Democratic Party Governorship Candidate in Osun State by the Governorship Candidate of the Boot Party, Adesoji Adeleke.\nIn a statement issued by a Chieftain of the Alliance, Wole Adedoyin who was also the 2018 Governorship Candidate of the Hope Democratic Party (HDP) said the case is baseless, mischievous and full of contradictions to ridicule Senator Demola Adeleke and the People’s Democratic Party (PDP).\nACPP said the suit against Senator Demola Adeleke was in bad faith and targeted by undemocratic elements to undermine democracy and good governance in Osun State.\nAdedoyin said: The Boot Party has become an appendage of the All Progressive Congress (APC) in Osun State.\nThe party is not serious about winning the forthcoming Osun Governorship Election."
  },
  {
    "headline": "Soludo sets up 15 man peace Committee on insecurity in South East",
    "summarized_story": "Anambra state government has set up a truth, justice and peace Committee which is comprised of 15 members drawn from different fringes of the South Eastern region.\nThe members of the committee are Prof.Chidi Odinkalu as the Chairman, Amb.\nMrs. Bianca Ojukwu, Secretary, Dr. Joe Nworgu,Dr. Udenta Udenta, Mr. Charles Oputa(Charly Boy), Ms. Onyeka Onyenu.\n” To identify the remote and immediate causes of the agitations, restiveness, violence, and armed struggle in the South East since 1999.\nIt was gathered the committee would be inaugurated on a date to be communicated to its members."
  },
  {
    "headline": "Lalong salutes elder statesman Amb Yahaya Kwande @ 93",
    "summarized_story": "Plateau State Governor Simon Bako Lalong has sent warm felicitations to elder statesman Ambassador Yahaya Kwande on the occasion of his 93rd birthday.\nGovernor Lalong in a message signed by Macham Makut the director of press and public affairs to Governor Lalong congratulated the seasoned Administrator, Politician, Diplomat and philanthropist for his selfless service to Nigeria, Plateau State and humanity at large.\nHe described him as an accomplished personality who has made huge impact in the lives of the people at various times when he occupied various offices in the country.\nThe Governor said Ambassador Kwande has mentored many in public service, politics and humanitarian activities by his record of performance over the years where he has freely offered counsel, support and goodwill to those in power and others.\nAccording to Governor Lalong, Ambassador Yahaya is one of the few elders that have demonstrated sufficient interest in the peace, progress and prosperity of Plateau State and Nigeria over the years, hence his willingness to advise and share his wealth of experience with the Government on key issues."
  },
  {
    "headline": "Edo LG Poll: EDSIEC extends date for conduct of primaries, insists on April 19 for election",
    "summarized_story": "The Edo State Independent Electoral Commission (EDSIEC) has extended the date for the conduct of party primaries for the local government elections by two days.\nThe Commission, however, said the extension will not affect the April 19 date earlier scheduled for the council polls.\nThe statement reads: “It is hereby announced for the information of the general public, particularly Registered Political Parties in the state that the Edo State Independent Electoral Commission has extended the date for the conduct of primaries by two (2) days.\n“This is in view of the number of Registered Political Parties that have scheduled their primaries on the 6th of April, 2022 which is the last day for the conduct of the primaries.\nThe last date for the primaries is Friday, April 8, 2022.”“The shift of date for the primaries has nothing to do with the date of the election, as other dates remain fixed and firm,” Ojo added."
  },
  {
    "headline": "Kaduna Train Attack: Families Warn NRC Against Resumption Of Services",
    "summarized_story": "﻿Relatives of the abducted persons in the Kaduna train attack have warned the Nigerian Railway Corporation not to resume services on the Abuja-Kaduna route until their loved ones abducted by bandits are released.\nChairman of the Concerned Relatives of Abducted Persons, Dr Abdulfatai Jimoh, said it is inhumane for the NRC to resume operations while the kidnapped victims are still languishing in the forest.\nREAD ALSO: [Kaduna Train Attack] Kidnapped BOA MD Regains FreedomThe angry relatives vowed to disrupt train services on the Abuja-Kaduna route if the victims are not rescued before the resumption of train services.\nThe train attack occurred on March 28, leaving at least seven people dead and over 100 unaccounted for.\nThe bandits have released footages of the abducted persons who called for the government to help rescue them."
  },
  {
    "headline": "Nigeria’s Inflation Rate Hits 15.92% As Food, Gas Prices Rise",
    "summarized_story": "It explained that the percentage reported was 2.25 per cent points lower compared to the 18.17 per cent rate recorded in March last year.\n“The Urban Inflation rate increased to 16.44 per cent year-on-year in March 2022, showing a decline of 2.32 per cent points from the rate recorded in March 2021 (18.76 per cent).\nSimilarly, the composite food index rose to 17.20 per cent in March 2022 compared to 22.95 per cent recorded in March the previous year.\nThe agency blamed the rise in the food index on increases in prices of bread and cereals, food products, potatoes, yam and other tubers, fish, meat, oil and fat.\n“On month-on-month basis, the food sub-index increased to 1.99 per cent in March 2022 – this was up by 0.12 per cent points from 1.87 per cent points recorded in February 2022."
  },
  {
    "headline": "US Approves Sale Of $997m Attack Helicopters To Nigeria",
    "summarized_story": "“Implementation of this proposed sale will require the assignment of U.S. Government or contractor representatives to Nigeria for mobile training teams and contract logistics support.\n“There will be no adverse impact on U.S. defense readiness as a result of this proposed sale.\n“The proposed sale of this equipment will not alter the basic military balance in the region.\n“Implementation of this proposed sale will require the assignment of U.S. Government or contractor representatives to Nigeria for mobile training teams and contract logistics support.\n“There will be no adverse impact on U.S. defense readiness as a result of this proposed sale."
  },
  {
    "headline": "Christians Mark Good Friday, Prelude To Easter Celebrations",
    "summarized_story": "Christian faithful in Nigeria and across the world are making Good Friday, the prelude to the Easter celebrations.\nThe day, which is part of the Holy Week, is observed by Christians across the world to mark the death of Jesus Christ.\nIn Nigeria, several churches are expected to hold services to observe Good Friday which is the first of the last three days of Jesus’ time on earth.\nNigeria’s umbrella Christian body had in its Easter message expressed confidence that the country would overcome its challenges.\n“As we approach another season of electioneering, let the security and unity of the nation guide our actions and utterances,” Buhari said."
  },
  {
    "headline": "2023: PDP Adjusts Timetable, Extends Sales of Nomination Forms",
    "summarized_story": "The Peoples Democratic Party (PDP) on Friday said it has adjusted its timetable and schedule of activities to extend the closing dates for the purchase and submission of Expression of Interest and Nomination Forms for the 2023 general elections.\nThis is to enable the Party to make up for the two days public holidays as announced by the Federal Government, a statement signed by the party’s National Publicity Secretary, Debo Ologunagba, said.\nUnder the new Timetable, the last day for the purchase of all Forms has been extended to April 19 while the last day for the submission of already completed Forms has also been extended to April 20.\nAll other dates as earlier published remain unchanged, the party said.\nIt added that all duly completed State Assembly Forms are to be submitted at the various States Secretariat of the Party."
  },
  {
    "headline": "2023 Presidency: Gov Yahaya Bello is APC’s best bet",
    "summarized_story": "The Yahaya Bello Presidential Campaign Organisation says the governor Yahaya Bello possesses all the attributes that can retain the presidency for the ruling All Progressives Congress in 2023.\nOf the pool of aspirants, as the country stands today, even across party lines, Governor Yahaya Bello is the best bet for the younger generation if this dream must be actualized.\nBeing the strongest contender from the region places Governor Bello in a vantage position to clinch the presidential ticket.\nTherefore, in terms of the main issues confronting the nation, Governor Yahaya Bello has excelled remarkably in Kogi State.\nThey will rally round Governor Yahaya Bello and retain the presidency with a wide margin come 2023.”"
  },
  {
    "headline": "APC Holds Maiden Post-Convention NEC Meeting on April 20, 2022 -",
    "summarized_story": "The All Progressives Congress (APC) National Working Committee (NWC) has called the maiden post-National Convention meeting of the National Executive Committee (NEC) to be held on Wednesday, 20th April, 2022.\nThe emergency NEC meeting which will take place at the Congress Hall of Transcorp Hilton Hotel in Abuja will commence at 10am.\n“Pursuant to Article 25.2.ii of the Constitution of the All Progressives Congress (APC), the National Working Committee (NWC) hereby invites members of the National Executive Committee (NEC) of our great Party to a meeting to consider the Party’s Timetable/Schedule of Activities for Primaries for the nomination of candidates for the 2023 General Elections and other relevant business of the Party.\n“All members of the NEC are by this invitation to take notice of the meeting in accordance with Article 12.3 of the APC Constitution, please,” the official notice/invitation for the NEC meeting stated."
  },
  {
    "headline": "APC holds Maiden post-convention NEC meeting April 20",
    "summarized_story": "The All Progressives Congress (APC) National Working Committee (NWC) has called the maiden post-National Convention meeting of the National Executive Committee (NEC) to be held on Wednesday, 20th April.The emergency NEC meeting which will take place at the Congress Hall of Transcorp Hilton Hotel in Abuja will commence at 10am.\nThis is contained in a statement issued on Friday by the party’s Publicity Secretary.\n“Pursuant to Article 25.2.ii of the Constitution of the All Progressives Congress (APC), the National Working Committee (NWC) hereby invites members of the National Executive Committee (NEC) of our great Party to a meeting to consider the Party’s Timetable/Schedule of Activities for Primaries for the nomination of candidates for the 2023 General Elections and other relevant business of the Party.\n“All members of the NEC are by this invitation to take notice of the meeting in accordance with Article 12.3 of the APC Constitution, please,” the official notice/invitation for the NEC meeting stated."
  },
  {
    "headline": "INEC suspends CVR exercise in Ihitte Uboma LGA, Imo over killings -",
    "summarized_story": "The Independent National Electoral Commission (INEC) has suspended the Continuous Voter Registration Exercise (CVR) exercise in Ihitte Uboma Local Government Area of Imo State.\nThe REC further reported that the State Office is making efforts to locate the whereabouts of the two remaining staff involved in the registration exercise.\nThe Commission extends its condolences to the family of Nwokorie Anthony and prays that God will grant them the fortitude to bear the loss.\nThe incident has been reported to security agencies to unravel the circumstances that led to this unfortunate incident and bring the culprits to justice.\nINEC enjoins the President General of the various Town Unions in Imo State as well as all the critical stakeholders to protect staff of the Commission engaged in national assignment."
  },
  {
    "headline": "Prosecutors Demand Maradona’s Doctors Be Placed on Trial for ‘Negligent Homicide’",
    "summarized_story": "Prosecutors investigating the 2020 death of Argentine soccer legend Diego Maradona have asked that the medical staff who treated him be tried for negligent homicide.\nThe prosecution accuses them of “simple homicide with dolus eventualis,” an offence in which a person is negligent while knowing their negligence can cause someone’s death.\nAccording to the prosecutors, the defendants “were the protagonists of an unprecedented, totally deficient and reckless hospitalisation at home”, and allegedly committed a “series of improvisations, mismanagement and shortcomings”.\nThe defence must now present its arguments and may ask for the case to be dismissed.\nMaradona is widely considered one of the greatest footballers in history and led Argentina to victory in the 1986 World Cup."
  },
  {
    "headline": "After Losing Warship, Russia Says It Will Increase Attacks on Kyiv",
    "summarized_story": "Authorities in another border region of Russia also reported Ukrainian shelling Thursday.\nLife in Kyiv has been gradually returning to some normalcy after Russia failed to capture the capital and withdrew its troops in northern Ukraine to focus on a concentrated assault in the country’s east.\nThe threat of intensified attacks on Kyiv came after Russian authorities accused Ukraine of launching airstrikes on residential buildings in Bryansk, a region that borders Ukraine, and wounding seven people.\nAuthorities in another border region of Russia also reported Ukrainian shelling Thursday.\nA renewed bombardment could return the city’s residents to sheltering in subway stations and the steady wail of air raid sirens."
  },
  {
    "headline": "Palestinians Clash with Israeli Police at Jerusalem Holy Site, More Than 150 Hurt",
    "summarized_story": "Israeli security forces have been on high alert after a series of deadly Arab street attacks throughout the country over the past two weeks, and confrontations at the sacred Jerusalem site carry the risk of sparking a slide back into wider conflict between Israelis and Palestinians.\nPolice entered the Al-Aqsa compound to “disperse and push back (the crowd and) enable the rest of the worshippers to leave the place safely”, it said, adding that three officers were injured in the clashes.\nPalestinian injuries were mainly from rubber bullets, beatings, rubber bullets and stun grenades, according to the Palestine Red Crescent.\nPolice detained hundreds of Palestinians, a spokesman for Israeli Prime Minister Naftali Bennett said in a tweet.\nAlongside that, we are preparing for any scenario and the security forces are ready for any task,” Bennett said."
  },
  {
    "headline": "US Report: Nigerian Judicial Officers Demand Bribe for Favourable Rulings",
    "summarized_story": "“Many citizens encountered long delays and reported receiving requests from judicial officials for bribes to expedite cases or obtain favourable rulings,” the report stated.\nIt listed understaffing, inefficiency, and corruption as factors preventing the judiciary from functioning adequately.\n“Federal and state governments, however, often undermined the judiciary by withholding funding and manipulating appointments,” the US report noted.\nThe US document stated: “The ICPC holds broad authority to prosecute most forms of corruption.\nThe law provides for recognition and enforcement of damages awarded to plaintiffs, but it was unclear whether this happened,” the report stated."
  },
  {
    "headline": "Nigerian Senate Sets Up 13-man Panel to Investigate Crude Oil Theft, Approves N4trn Subsidy",
    "summarized_story": "Also yesterday, the Senate approved a revised budget of N17,319,704,091,019 trillion for the 2022 fiscal year.\nAlso, the Senate approved the total sum of N4 trillion for petrol subsidy in 2022.\nThe figure represented an increase of N192.5 billion from the N17.1 trillion approved and assented to last December.\nThe red chamber, in the MTEF/FSP approved oil benchmark $73 per barrel as proposed by President Muhammadu Buhari.\nIt also approved oil production volume of 1.600m per day."
  }
]