[
  {
    "headline": "BUK Centre engages religious leaders to propagate anti-corruption messages",
    "summarized_story": "“We strongly believe that government alone cannot succeed in the fight against corruption without the inputs of religious leaders who command the respect and obedience of their followers across large segments of the citizenry.\n“Evidently, in Nigeria, religious leaders have their inherent advantages in their routine activities for ordinary citizens.\n“Consequently, as respected community influencers, religious leaders should take the risk to face all the consequences of fighting corruption.\nThe religious leaders can effectively make their followers shun corruption, as they have unhindered access to and responsibility to educate a broad spectrum of the public.\nHence, both the FBOs and religious leaders are stronger together, to amplify anti-corruption messaging and galvanize community action to hold public officers accountable."
  },
  {
    "headline": "Attack on Obiozor’s house evil ― IPOB Leader, Nnamdi Kanu",
    "summarized_story": "By Chinonso AlozieThe detained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, has described as an evil act the last Saturday attack by unknown gunmen on the house of the President of Ohanaeze Ndigbo Worldwide, Professor George Obiozor, at Awo-Omamma in Oru East Local Government Area of Imo state.\nKanu said this to newsmen in Owerri, on Tuesday through his lead counsel, Ifeanyi Ejiofor, after their visit to the DSS, facility in Abuja, where Kanu condemned the attack on Obiozor’s house in Oru East LGA.\nAccording to the IPOB leader, “We visited Onyendu who is in the custody of the Department of Security Services, Abuja.\nOur discussion centred on two main things, namely, the frivolous criminal proceedings pending against him at the Federal High Court, Abuja, and the criminal destruction of the country home of Prof George Obiozor.\n“This socio-cultural group has steadfastly and consistently made a legal representation in the criminal proceedings pending against Onyendu at the Federal High Court Abuja."
  },
  {
    "headline": "2022 World Water Day: WaterAid, Britain survey reveals enough groundwater in Africa",
    "summarized_story": "This means groundwater could provide a buffer against climate change for many years to come, even in the unlikely event that it doesn’t rain.\n“Groundwater: The world’s neglected defence against climate change is released by WaterAid and BGS today as Heads of State meet at the World Water Forum in Senegal, West Africa.\nBut the tragedy is that millions of people on the continent still do not have enough clean water to drink.\nMeanwhile, BGS Groundwater Resilience Lead, Professor Alan MacDonald, said: “Groundwater is nature’s water reservoir, and a key resource to help the world adapt to climate change.\nThe report also explains that while groundwater in sub-Saharan Africa is largely underused, in other parts of the world – mainly in south Asia – overuse is rife."
  },
  {
    "headline": "Why NOUN lecturers are not part of ASUU strike, VC explains",
    "summarized_story": "Olufemi Peters,has explained that academic staff of the university were not part of the ongoing strike by Academic Staff Union of Universities, ASUU because of the university’s structure.\nPeters,who also said over 1, 500 graduates of NOUN have enrolled into the Nigerian Law School, added that products of the university were doing well at the Law School.\nAçcording to him, all the institution’s programmes, including the law programme have been fully accredited by National Universities Commission,NUC.\n“We have about 1500 students who are graduates of our institution currently in the law school.\nWe have about the same numbers that are yet to be enrolled in the law school."
  },
  {
    "headline": "No election ‘ll hold in Warri, since INEC refuses to obey court judgment – INYC",
    "summarized_story": "The Itsekiri National Youth Council, INYC has said that since the Independent National Electoral Commission, INEC, has failed to honour the court judgment delivered in Benin, Edo State, they will disrupt the 2023 election in Warri South Local Government Area of the State.\nAgbateyiniro revealed that they went to court against INEC and others where the judgment was in their favour, but INEC refused to honour the judgement delivered since the 19th of May 2006 before the Honourable Justice P.F.\nOlayiwola of the Federal High Court, Benin Judicial Division.\n“This Council shall resist any attempt to use illegal wards to conduct elections in Warri South Local Government Area”.\ngoing on at INEC office in Warri adding that they were in Abuja to register their protest at the Unity Fountain instead INEC premises because of security issues”."
  },
  {
    "headline": "Buhari directs concessioning of Abuja, Lagos, Kano, Port Harcourt airports",
    "summarized_story": "President Muhammadu Buhari has directed Aviation Minister Hadi Sirika to fast-track the concessioning of the four major airports in Nigeria.\nBuhari gave the order on Tuesday at the Murtala Muhammed International Airport (MMIA) in Lagos, during the launch of the new terminal.\nThe President also directed Finance Minister Zainab Ahmed to raise funds for the construction of a second runway at the Nnamdi Azikiwe International Airport (NAIA) Abuja.\nHe said concessioning of Lagos, Kano, Port Harcourt and Abuja terminals would further boost development to the sector and grow the economy.\n”We have designated Lagos, Abuja, Port Harcourt and Kano airports as free trade zones, while we have also removed Valued Added Tax (VAT) from air transport”, he added."
  },
  {
    "headline": "Buhari impressed with Dangote’s $2.5bn fertiliser plant, says Nigeria set to witness agric boom",
    "summarized_story": "A visibly excited President Buhari said the coming on stream of the plant would create huge opportunities in the areas of employment, trade, warehousing, transport and logistics.\nHe said, “In the agricultural sector, another focal point of our economic policy, we expect a boom as fertiliser is now readily available.\nHe added that already, Dangote fertiliser has reached the markets in the USA, Brazil and Mexico.\nDangote stated that the fertiliser plant is rolling out with innovations that would transform the agricultural sector in the form of extension services for small and medium scale farmers.\n“Then President Buhari inaugurated the Presidential Fertiliser Initiative and charged them with resolving this problem."
  },
  {
    "headline": "2023: Nigerians in diaspora write Atiku, make demands",
    "summarized_story": "Ahead of the 2023 general elections, the Nigerian business community in the diaspora has written former Vice President, Atiku Abubakar.\nAs a former Vice President of Nigeria, you played a significant role in the implementation of the policy objectives of the Obasanjo administration.\nThe administration of which you served as vice president was able to achieve an $18 billion debt relief in 2006.\nYour business experience will stand you in good stead managing and growing the economy.\nWe, Nigerians in the Diaspora recognize that you are pro business and in tune with modern business skills."
  },
  {
    "headline": "OAU: Oyetola begs Ife indigenes protesting choice of new VC",
    "summarized_story": "Osun State Governor, Gboyega Oyetola, has appealed to citizens of Ile-Ife who are protesting the choice of the new Vice-Chancellor for the Obafemi Awolowo University to give peace a chance and stop the protest forthwith.\nSome Ife indigenes invaded the varsity’s campus with charms and other fetish objects on Monday protesting the announcement of Prof. Adebayo Bamire as the 12th substantive Vice-Chancellor of OAU.\nThe closed the institution’s gates to prevent staff, students, and other stakeholders from either going into or leaving the University.\nTo this end, he urged all protesting citizens to exercise restraint and allow peace to reign.\nLast Thursday, Pro-Chancellor and Chairman of Council, Owelle Oscar Idoko, announced Professor of Agricultural Economics, Prof Banire, as its substantive new Vice-Chancellor."
  },
  {
    "headline": "Terrorists, bandits now fourth tier of Nigerian govt – Shehu Sani",
    "summarized_story": "Shehu Sani, a former Kaduna Central Senator, on Tuesday, said bandits have become the fourth tier of government in Nigeria.\nSani noted the series of attacks by bandits show that Nigerians need no additional proof that bandits have become the fourth tier of government.\nThe socio-political activist was reacting to a comment by Governor Abubakar Sani Bello of Niger State that bandits occupied 12 of the 25 Local Government Areas in the state.\nReacting, Sani noted that Niger State is a neighbour to the Federal Capital Territory, FCT, yet bandits are occupying its local governments.\nWhat additional proof is needed that bandits have become the fourth tier of Government?”"
  },
  {
    "headline": "FAAC shares N590.546bn to FG, States and LGAs",
    "summarized_story": "The Federation Accounts Allocation Committee (FAAC) has shared N590.546 billion February 2022 Federation Account Revenue to the Federal Government, States and Local Government Councils.\nThe N590.546 billion total distributable revenue comprised distributable statutory revenue of N337.432 billion; distributable Value Added Tax (VAT) revenue of N165.635 billion and Excess Bank Charges of N7.479 billion and Non-Mineral Revenue of N80.000 billion.\nFrom this, the Federal Government received N165.248 billion, the State Governments received N83.816 billion and the Local Government Councils received N64.618 billion.\nThe sum of N5.123 billion allocation to NEDC and N7.115 billion cost of collection were deducted from the N177.873 billion gross Value Added Tax (VAT) revenue, resulting in the distributable Value Added Tax (VAT) revenue of N165.635 billion.\nImport and Excise Duties, Companies Income Tax (CIT), and Value Added Tax (VAT) recorded considerable decrease."
  },
  {
    "headline": "FAAC shares N590.546bn to FG, States and LGAs",
    "summarized_story": "The Federation Accounts Allocation Committee (FAAC) has shared N590.546 billion February 2022 Federation Account Revenue to the Federal Government, States and Local Government Councils.\nThe N590.546 billion total distributable revenue comprised distributable statutory revenue of N337.432 billion; distributable Value Added Tax (VAT) revenue of N165.635 billion and Excess Bank Charges of N7.479 billion and Non-Mineral Revenue of N80.000 billion.\nFrom this, the Federal Government received N165.248 billion, the State Governments received N83.816 billion and the Local Government Councils received N64.618 billion.\nThe sum of N5.123 billion allocation to NEDC and N7.115 billion cost of collection were deducted from the N177.873 billion gross Value Added Tax (VAT) revenue, resulting in the distributable Value Added Tax (VAT) revenue of N165.635 billion.\nImport and Excise Duties, Companies Income Tax (CIT), and Value Added Tax (VAT) recorded considerable decrease."
  },
  {
    "headline": "Mother sets 10-year-old daughter ablaze over handset",
    "summarized_story": "A mother of five, Aisha Tijani, has been arrested for pouring petrol on her 10-year- old daughter and setting her ablaze.\nTijani was arrested after one Moroof Ayinde reported the incident at Mowe Divisional Headquarters.\nAyinde told the police the suspect, who lives in the same house with him, poured petrol on her daughter and set her ablaze.\nRead Also: Student docked for allegedly threatening to kill neighboursThe Divisional Police Officer of Mowe Folashade Tanaruno and some detectives stormed the scene and arrested the suspect.\nOgun Police Commissioner, Lanre Bankole, ordered the immediate transfer of the suspect to State Criminal Investigation and Intelligence Department for further investigation."
  },
  {
    "headline": "Buhari directs Amaechi to draw up plans to link Lekki Deep Seaport to rail",
    "summarized_story": "Buhari directs Amaechi to draw up plans to link Lekki Deep Seaport to railPresident Muhammadu Buhari has directed Minister of Transportation, Chibuike Rotimi Amaechi, to consult and submit a memorandum to the Federal Executive Council (FEC) to link the Lekki Deep Sea Port with the railway network.\nThe President gave the directive after inspecting the deep seaport project, during his working visit to Lagos State, praising the Minister’s efforts at making the project a reality.\nThe President’s directive was contained in a statement by his Senior Special Assistant on Media and Publicity, Mallam Garba Shehu.\nAs part of his engagements in Lagos, the President inspected the rate of work done at the first Deep Sea Port in Nigeria located in Lagos Free Zone, 65Km east of Lagos.\nIn the course of the inspection, the President received firm assurances that the port, which has a concession period of 45 years and sits in a land area of 90 hectares, will be completed on schedule by September."
  },
  {
    "headline": "UPDATED: Court ruling on Electoral Act divides Senators",
    "summarized_story": "Senators were apparently divided on Tuesday over a call for the Senate to debate a Federal High Court ruling that declared Section 84(12) of the Electoral Act as illegal.\n“Section 228 gives us also the power to make certain laws to guard the Independent National Electoral Commission to effectively discharge its functions.\n“We felt that Section 84(12) as enshrined in the Electoral Act assented to, is for the interest of the people and country.\n“If you think it is faulty, you either take us to court and make us part of that case.\nHe noted that moving the debate to Wednesday would enable more Senators to make their contribution and also enjoy the presence of the Senate President Ahmad Lawan."
  },
  {
    "headline": "Mother of five sets 10-year-old daughter on fire in Ogun",
    "summarized_story": "From Laide Raheem, AbeokutaA mother of five has been arrested by men of the Ogun State Police Command for allegedly setting her 10-year-old daughter on fire.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nClick here to see how you too can get paid .\nUpon the report, the DPO in charge of Mowe Division, CSP Folashade Tanaruno, quickly moved to the scene with the detectives and got the suspect arrested.\nSmall Manhood & P.E 7days Solution... Click Here For Details ."
  },
  {
    "headline": "BREAKING! Police take over Cross River Assembly",
    "summarized_story": "Armed policemen on Tuesday morning took over the Cross River State House of Assembly.\nThe policemen drawn from the anti-kidnapping squad and regular policemen were also seen around the routes leading to the House of Assembly.\nMovement into the Assembly complex on Diamond Hill was restricted.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nTheir presence followed the High Court ruling on Monday sacking 20 lawmakers in the state for defecting from the Peoples Democratic Party to the All Progressives Congress."
  },
  {
    "headline": "Convention: APC rolls out stringent criteria, orders disqualification of aspirants with baggage",
    "summarized_story": "From Romanus Ugwu, AbujaAll Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC) has rolled out stringent criteria for aspirants jostling for various positions in the zonal and national leadership of the party.\nIn a document given to the screening committee, it insisted on zero tolerance for corrupt individuals and directed the disqualification of any aspirants with questionable character.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\n“An aspirant must not be under a sentence of death imposed on him by any court of law, tribunal in Nigeria or a sentence of imprisonment or fine for an offence involving dishonesty or fraud.\nHe had, on arrival at exactly 2.50pm, thrown the entire secretariat into a frenzy, with the staff and drummers dancing and singing his praises."
  },
  {
    "headline": "Court sacks Cross River speaker, 19 others over defection",
    "summarized_story": "“The defendants court documents were contrived and filed with loopholes.\nThe Independent National Electoral Commission (INEC), Speaker of the House of Representatives, National Assembly, Clerk of the National Assembly, Cross River State House of Assembly, Clerk of the state House of Assembly and the APC were also joined as defendants in the suit.\n“Where there is more than one defendant, the suit can be established anywhere, subject to the discretion of the court.\nIn its argument before the court, the APC had submitted that the lawmakers are not registered members of the party.\nHailing the judgment, the Cross River PDP chairman, Venatius Ikem, said: “It was a heart-warning judgement and a victory for Cross Riverians who voted for PDP in 2019 general election."
  },
  {
    "headline": "Insecurity: Buhari approves more personnel for Imo",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has ordered the deployment of more security personnel from the police, Department of Security Service (DSS) and Nigeria Security and Civil Defence Corps as well as additional arms and ammunitions to boost security in Imo State.\nThis followed the resurgence of insecurity in the state, culminating in the attack on the home of Prof. George Obiozor, president-general of Ohaneze Ndigbo and some police assets.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe president had summoned Governor Hope Uzodimma to a meeting in Abuja, yesterday, to apprise him of the security situation in the state.\n“Since January 2020, when I came to office, one of the things I initiated was quarterly stakeholders meeting."
  },
  {
    "headline": "Buhari Commissions $2.5bn Dangote Fertiliser Plant, Says It Will Boost Forex Earnings, Economic Growth",
    "summarized_story": "President Muhammadu Buhari says the 2.5 billion dollar Dangote Fertiliser Plant in Ibeju Lekki, Lagos, will boost Nigeria’s foreign exchange earnings and accelerate economic growth.\nHe said: “This fertiliser plant is further expected to enhance our administration’s drive towards achieving self-sufficiency in food production in the country.\n“I commend the Chairman, Board and Management of Dangote Industries Ltd., for their business initiative in establishing this plant.\nHe said the free trade zone today was host to Dangote Fertiliser Plant, which was the largest fertiliser plant in Africa and the second largest in the world.\nEarlier, Alhaji Aliko Dangote, President, Dangote Industries Ltd., said the fertiliser plant would drastically reduce the level of unemployment and youth restiveness through generation of direct and indirect employments."
  },
  {
    "headline": "Emefiele: Unprecedented Oil Theft Affecting Economy",
    "summarized_story": "Emefiele said this while briefing journalists at the end of the Monetary Policy Committee (MPC) meeting in Abuja.\nThe company sated, “AEEPCO remains gravely concerned about the persistent heightened attack on our production facilities and the NCTL.\nMPR is the rate at which the CBN lends to commercial banks and it often determines the cost of borrowing in the economy.\nEmefiele, who read the committee’s communiqué, however expressed worry that whereas global oil prices had gone up, this had been compounded by shortage of supply of petroleum products.\nMembers noted that the on-going war and the resultant sanctions against Russia will continue to have a considerable impact on the global supply chain as both countries are major players in the global commodities market."
  },
  {
    "headline": "Four Days to APC Convention, Buni Harmonises Sub-committees, Screening Starts Today",
    "summarized_story": "In a related development, Imo State Governor, Senator Hope Uzodinma, yesterday, declared that nothing would stop the national convention from holding this weekend.\nA party source, who pleaded anonymity, confirmed that the committees had been harmonised and the screening would commence today.\nThree senators – Abdullahi Adamu, Sani Musa, and Tanko Al-Makura – are contesting the position of APC national chairman at the party’s convention.\n“We would be very happy if any of them emerge as the APC national chairman on Saturday.\nAnother party source, who equally pleaded anonymity, said some of the governors came to beg on behalf of the secretary."
  },
  {
    "headline": "Defection: Again, Court Sacks Two Reps, 18 Cross River Assembly Members",
    "summarized_story": "Another judge of the Federal High Court, Justice Inyang Ekwo, had on March 8, sacked 15 lawmakers of the Ebonyi State House of Assembly as well as Governor Dave Umahi and his deputy for defection.\nMembers of the State House of assembly who decamped from the PDP to the AP) alongside Gov.\nCross River Govt Appeals, Files Motion for State of ExecutionMeanwhile, in a statement late yesterday night, the Cross River State government, through the Special Adviser, Media and Publicity to the Governor, Mr Christian Ita, announced that it had filed an appeal against the judgement and a motion to stay the execution of the judgement.\nThe reads; “This is to inform All Progressives Congress (APC) members of the National Assembly from members of the Cross River State House of Assembly and the general public that an appeal against the judgement of the Federal High Court, Abuja has been filed at the Court of Appeal, Abuja.\nConsequently, the APC members in both the National Assembly and the Cross River State House of Assembly should go about their duties freely.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Court Dismisses Another Suit Seeking Sack of Buni-led CECPC",
    "summarized_story": "He said if the question was answered in the negative, whether their appointment was not a gross violation of the constitution.\nAmong the declarations Bolarinwa sought from the court was that Buni and the other serving governors’ presence in CECPC was illegal and unconstitutional with regard to Sections 183 and 223 of the constitution.\nThe court explained that all the allegations were denied by the defendants, thereby putting the claimant to the strictest proof of the same.\nThe entire suit having regards to the facts and circumstances of the same, constitute an abuse of judicial process and liable to be dismissed.\n“I shall dismiss the said suit by consigning the same to a forlorn of judicial debris."
  },
  {
    "headline": "2023: Delta Governor, Okowa Asked PDP Not To Sell Forms To Aspirants Without His Clearance – Sources",
    "summarized_story": "Ahead of the 2023 general elections, PDP had last week announced the sales of forms for aspirants vying for elective positions.\nThe victim added that the party was obeying Governor Okowa's instructions not sell forms to any aspirants from the state without his clearance.\nThey said that there’s a standing order that aspirants without the governor's clearance should be denied the forms.\nWhen contacted as at the time of filling this report, Governor Ifeanyi Okowa's Chief Press Secretary, (CPS), Olise Ifeajika, denied that the governor gave such orders.\n“The Party is supreme; Governor Ifeanyi Okowa I know cannot give such instructions."
  },
  {
    "headline": "2023: Delta Governor, Okowa Asked PDP Not To Sell Forms To Aspirants Without His Clearance – Sources",
    "summarized_story": "Ahead of the 2023 general elections, PDP had last week announced the sales of forms for aspirants vying for elective positions.\nThe victim added that the party was obeying Governor Okowa's instructions not sell forms to any aspirants from the state without his clearance.\nThey said that there’s a standing order that aspirants without the governor's clearance should be denied the forms.\nWhen contacted as at the time of filling this report, Governor Ifeanyi Okowa's Chief Press Secretary, (CPS), Olise Ifeajika, denied that the governor gave such orders.\n“The Party is supreme; Governor Ifeanyi Okowa I know cannot give such instructions."
  },
  {
    "headline": "2023: Delta Governor, Okowa Asked PDP Not To Sell Forms To Aspirants Without His Clearance – Sources",
    "summarized_story": "Ahead of the 2023 general elections, PDP had last week announced the sales of forms for aspirants vying for elective positions.\nThe victim added that the party was obeying Governor Okowa's instructions not sell forms to any aspirants from the state without his clearance.\nThey said that there’s a standing order that aspirants without the governor's clearance should be denied the forms.\nWhen contacted as at the time of filling this report, Governor Ifeanyi Okowa's Chief Press Secretary, (CPS), Olise Ifeajika, denied that the governor gave such orders.\n“The Party is supreme; Governor Ifeanyi Okowa I know cannot give such instructions."
  },
  {
    "headline": "Nigeria's Broadcasting Commission, NBC Workers Accuse Buhari's Minister, Lai Mohammed Of Fraudulent Award Of 30 Radio Licences To Cronies",
    "summarized_story": "Nigeria's Minister of Information and Culture, Alhaji Lai Mohammed, has been accused of securing presidential approval for radio licences for 30 unvetted and unprocessed companies.\nThe allegation was made by some staff members of the National Broadcasting Commission (NBC) who identified themselves as Concerned NBC staff.\nThe NBC workers made the allegation in a petition dated March 19 and addressed to President Muhammadu Buhari.\nThey were procured through the backdoor; they flouted the normal procedure and they breached Nigeria’s national security.\nPlease, call Alhaji Lai Mohammed to order."
  },
  {
    "headline": "Nigeria's Broadcasting Commission, NBC Workers Accuse Buhari's Minister, Lai Mohammed Of Fraudulent Award Of 30 Radio Licences To Cronies",
    "summarized_story": "Nigeria's Minister of Information and Culture, Alhaji Lai Mohammed, has been accused of securing presidential approval for radio licences for 30 unvetted and unprocessed companies.\nThe allegation was made by some staff members of the National Broadcasting Commission (NBC) who identified themselves as Concerned NBC staff.\nThe NBC workers made the allegation in a petition dated March 19 and addressed to President Muhammadu Buhari.\nThey were procured through the backdoor; they flouted the normal procedure and they breached Nigeria’s national security.\nPlease, call Alhaji Lai Mohammed to order."
  },
  {
    "headline": "Tambuwal: We'll approach Atiku on possibility of consensus presidential candidate for PDP",
    "summarized_story": "Aminu Tambuwal, governor of Sokoto and presidential hopeful, says he will discuss with former Vice-President Atiku Abubakar on the possibility of presenting a consensus candidate for the Peoples Democratic Party (PDP).\nThe development comes days after Tambuwal, former Senate President Bukola Saraki, and Bala Mohammed, governor of Bauchi, agreed to support a consensus candidate for the party.\nSpeaking on Tuesday, the Sokoto governor, however, said he has what it takes to win the presidency in 2023.\nAdvertisementDescribing Atiku as his “uncle”, Tambuwal said “I have a lot of respect for him”.\nI possess the qualities, particularly when you are talking about Nigeria of today, that can deliver the votes for PDP.”"
  },
  {
    "headline": "Tambuwal: We'll approach Atiku on possibility of consensus presidential candidate for PDP",
    "summarized_story": "Aminu Tambuwal, governor of Sokoto and presidential hopeful, says he will discuss with former Vice-President Atiku Abubakar on the possibility of presenting a consensus candidate for the Peoples Democratic Party (PDP).\nThe development comes days after Tambuwal, former Senate President Bukola Saraki, and Bala Mohammed, governor of Bauchi, agreed to support a consensus candidate for the party.\nSpeaking on Tuesday, the Sokoto governor, however, said he has what it takes to win the presidency in 2023.\nAdvertisementDescribing Atiku as his “uncle”, Tambuwal said “I have a lot of respect for him”.\nI possess the qualities, particularly when you are talking about Nigeria of today, that can deliver the votes for PDP.”"
  },
  {
    "headline": "Edo offers striking example of how Nigeria can fix electricity problem, says Obaseki",
    "summarized_story": "Godwin Obaseki, governor of Edo, says the federal government can learn from the state on how to fix the problem of power supply in the country.\nObaseki, whose comments come amid complaints of epileptic power supply across the country, said Edo has stable electricity in its public facilities.\n“Edo presents a very striking example of how Nigeria can fix its intractable electricity problem, which has plagued the country since independence,” he said.\n“Edo state reversed the political norm in Nigeria.\nVoter results were transmitted directly from the polling units to a central portal and the results matched those we were collating in our situation room."
  },
  {
    "headline": "Edo offers striking example of how Nigeria can fix electricity problem, says Obaseki",
    "summarized_story": "Godwin Obaseki, governor of Edo, says the federal government can learn from the state on how to fix the problem of power supply in the country.\nObaseki, whose comments come amid complaints of epileptic power supply across the country, said Edo has stable electricity in its public facilities.\n“Edo presents a very striking example of how Nigeria can fix its intractable electricity problem, which has plagued the country since independence,” he said.\n“Edo state reversed the political norm in Nigeria.\nVoter results were transmitted directly from the polling units to a central portal and the results matched those we were collating in our situation room."
  },
  {
    "headline": "'Nigerians want electricity, NOT explanations' — reps tackle power minister",
    "summarized_story": "Some members of the house of representatives on Tuesday tackled Abubakar Aliyu, minister of power, over the electricity situation in the country.\nThe lawmakers expressed reservations over the erratic power supply experienced across the country in recent weeks.\nAdvertisementMuraina Ajibola, a lawmaker from Oyo state, said the government is not prepared to provide constant power supply to citizens.\nAdvertisement“The permanent secretary said until the end of next year.\n“I have the utmost respect for the permanent secretary but they have written this for him to present to us."
  },
  {
    "headline": "Tyranny in the workplace: The chaotic culture of Bento Africa",
    "summarized_story": "Ebun Okubanjo announcing on the company’s slack after firing Kunle“Leave Ebun, that man can literally kill you and brag about it.\nOn November 22, when Okunbanjo fired Kunle for the second and final time, he refused to pay his November salary and severance pay.\nFor Johnson, joining Bento Africa was “a bad idea” and leaving “the best thing he’d ever done for himself”.\nBento is still toxicThree current Bento employees contacted by TechCabal were diplomatic about their responses, but they agreed that everything this publication has unearthed about Bento Africa’s work culture “is not false”.\nEbun Okubanjo posted our email request on Twitter, he has since deleted the tweet."
  },
  {
    "headline": "Google’s Africa internet cable to first arrive in Togo",
    "summarized_story": "Google has announced that Equiano, a subsea internet cable running through Portugal to South Africa, will first land in Togo.\nThis announcement marks a milestone in Google’s plan to provide affordable internet access in Africa by building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nLast October, Google CEO Sundar Pichai announced a plan to invest $1billion over 5 years to support digital transformation in Africa, of which project Equiano is part of.\nNitin Gajria, Managing Director of Google Sub-Saharan Africa commented, “The landing of Equiano affirms Google’s commitment to the African continent, to support Africa’s digital transformation.\nThe shutdown of Google’s Project Loon brought up questions about the fate of Google’s other internet projects targeted at Africa."
  },
  {
    "headline": "Big Cabal Media raises $2.3m to expand its compelling line of digital products",
    "summarized_story": "In 2021, venture capital invested $115 million in digital media globally, a tenth of the $1.1billion it funded in 2015, but not much came to Africa.\nToday, one of such exceptions, Big Cabal Media (BCM), a leading African digital media company, has announced a $2.3 million Seed funding round, emphasising its commitment to keep building exciting and authoritative media products and brands.\nBCM’s progress over the years and recent fundraise is a noteworthy example of the possibilities and opportunities in Africa’s digital media sector.\nOf the reported $4.3–$5 billion raised by African startups in 2021 whereby fintech received 53–63% of the volume, digital media companies are one of many sectors that have traditionally been overlooked in the conversation of tangible ventures.\n“Investing in Africa’s booming digital media sector aligns perfectly with MaC’s mission of supporting exceptional entrepreneurs building valuable technology companies that leverage shifts in cultural trends and behaviours."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ever heard of the term, Hope as a Service?\nWell, me neither.\nAt least until last Wednesday when we recorded..."
  },
  {
    "headline": "Speaking against toxic work cultures",
    "summarized_story": "Eventually, some ex-staff and current workers at the startup contributed to the piece either anonymously or with full disclosure.\nFor a moment, it appears we’re moving away from the reality that protecting employee interest in the Nigerian tech space is harder than it looks.\nSo far, the founder claims that Lendsqr already has over 100 lenders offering credit to almost half a million users.\nMonths before that, five other eCommerce startups have raised $275m combined in VC fund and debt financing.\nWith this raise, Apollo plans to spread its tentacles into West Africa and other parts of East Africa."
  },
  {
    "headline": "Lendsqr is building the Shopify for lending in Africa",
    "summarized_story": "Tying into his ambition to democratise banking in Nigeria, he is currently building Lendsqr, a startup that would create large-scale lending infrastructure in Africa.\nAdedeji OloweOlowe, who is on the boards of Sparkle and Paystack, has been neck-deep in Nigeria’s financial space, having previously been the chairman of TeamApt.\nHowever, building any lending solution is tough, but what the fintech mogul has planned with Lendsqr is a different beast entirely.\nLendsqr has painstakingly assembled a team of engineers and data experts with experience in Nigeria’s credit and tech space.\nConsidering this, any keen observer can guess Lendsqr will earnestly chase growth and try to corner the lending market."
  },
  {
    "headline": "Nerves and laughter as Techpoint Pitch Friday returns",
    "summarized_story": "Share this article:On Friday, March 11, 2022, we hosted the first Techpoint Pitch Friday of 2022.\nHarmony plans to play in the increasingly competitive buy now, pay later industry.\nHis startup, Siara, plans to provide emergency response and security services for Nigerians using a community model.\nFeedback and networkingProviding feedback to entrepreneurs is an integral part of Pitch Friday.\nApril’s edition of Pitch Friday will be held on Friday, April 8, 2022, and you can register to pitch your startup or join the audience."
  },
  {
    "headline": "Buhari orders fast track of Abuja second runway construction, airport concession",
    "summarized_story": "President Muhammadu Buhari says he has directed Hadi Sirika, the minister for aviation to fast track the construction of the second runway at Nnamdi Azikiwe International Airport, Abuja and the concession of the five international airports.\nThe president disclosed this at the commissioning of the new terminal at the Murtala Muhammed International Airport, (MMIA).\nRead also: Relief for Lagos airport users as Buhari commissions ultra-modern MMIA terminalThe MMIA, Nnamdi Azikiwe International Airport, Abuja; Aminu Kano International Airport; Akanu Ibiam International Airport, Enugu and Port Harcourt International Airport are the airport terminals funded from the China Exim bank facility to the Nigerian government.\nThe main engineering content include: Four story main terminal building, three-story finger building, two-story cargo terminal building, apron, external works such as bridge/roads and other ancillary works.\nIt is a multi-functional modern international airport including hotels, restaurants and leisure."
  },
  {
    "headline": "Lekki Port to receive first commercial vessel September – NPA MDMS",
    "summarized_story": "Mohammed Bello-Koko, managing director of the Nigerian Ports Authority (NPA), has said that the Lekki Deep Seaport, which has been under construction for years, would be ready for test run in September this year after which the first commercial visit can be received at the port.\nBello-Koko, who noted that the commencement of Lekki Port will reduce the rate of traffic at Apapa and Tin-Can Island Ports, said there will be Ship-to-Shore (STS) cranes that will enable faster processing of goods.\nRead also: Technology will drive efficient cargo processing at Lekki Port – Ruogang“Some of the businesses we have loss to other neighbouring West African countries due to draught limitation will be regained.\nIt will create competition and compel other terminal operators to up their games to reduce cargo dwell time at their terminals.\nApapa and Tin-Can Island Ports have been operating far beyond their capacity which means that the excess cargoes that have been going there would be diverted to Lekki Port,” he explained."
  },
  {
    "headline": "Police, NYSC strengthen ties in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Police Command and the National Youth Service Corps (NYSC) have again strengthened existing relationship towards improved security of corps members and their property in Edo State.\nThis came to the fore when the Edo State Coordinator of NYSC Mrs Abiodun Olubukola visited the police command headquarters, GRA, Benin City, yesterday.\nShe also lauded efforts of men and officers of the command at providing the needed protection for corps members in Edo.\nResponding, the acting Commissioner of Police in Edo State DCP Miller Dantawaye assured the Edo State Coordinator of NYSC of police continued support at all times.\nDCP Miller who is also incharge of operations at the command thanked the NYSC state coordinator for finding time to appreciate police efforts."
  },
  {
    "headline": "Obaseki: Edo deepening investment in tech, infrastructure, culture, people to withstand future pandemics – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said that the state is deepening investment in technology, healthcare, infrastructure, culture and the people to withstand the shocks of future pandemics.\nObaseki said this during a virtual session at the 2022 Smart Cities Mayor’s Summit held in Taipei, the capital of Taiwan.\nMost of our strategy in terms of thinking of our future has been drastically changed as a result of the pandemic.\n“Our aspiration is to plan our cities and take the opportunity of the post-COVID-19 era to build infrastructure.\nThe Summit, which is the world’s largest networking platform among smart city governments, provides a high-level dialogue platform for global mayors and city leaders to exchange innovative strategies and visions on future city developments."
  },
  {
    "headline": "Nigeria can adopt solutions from Edo govt’s interventions to stem the slide – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… chides political elite for failing to engender devt… Edo attracts $500m investment into agric sectorBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said Nigeria can adopt the novel interventions and radical changes implemented in Edo State in tackling the myriad of challenges and stem the country’s current slide to economic and socio-political crisis.\n“In Edo, we had to take deliberate and intentional steps to retool our politics to engender development.\nThis has led to the introduction of people-centric policies and programmes which have won our administration significant public trust,” he said.\nCurrently, there is stable electricity to power public institutions and infrastructure in metropolitan Benin City.\n“In agriculture, we have attracted almost $500 million investment into palm oil cultivation, having allocated the first phase of 60,000 hectares of land under the Edo State Oil Palm Production Program (ESOPP)."
  },
  {
    "headline": "Edo restates commitment to improving business environment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has reaffirmed its commitment to providing an enabling environment for businesses to thrive, assuring local and foreign investors of the safety and security of their investments in the state.\nThe Commissioner for Public Security and Safety, Omololu Ojehomon gave the assurance during a technical session on ease of doing business in Edo State, held at the Government House, Benin City.\nOjehomon, who noted that the Governor Godwin Obaseki-led administration has pursued policies and programmes to improve the business environment in the state, reassured that the government will sustain efforts to ensure a peaceful atmosphere for businesses to thrive.\nAccording to her, “It’s the government’s business to provide an enabling environment for businesses to thrive as the government really has no business doing business.”Hailing the government for the Power Purchase Agreement (PPA) with Ossiomo Power Company to provide stable power and drive the state’s industrial sector, she added, “Edo State has everything and it’s the gateway to Nigeria.\nHe noted that Governor Obaseki has ensured a stable electricity supply through Ossiomo Power and an improved land administration system, among others to ensure a friendly business environment and encourage investors."
  },
  {
    "headline": "Prince Emeka Obasi: Family announces final burial rites",
    "summarized_story": "The family of Prince Emeka Obasi has announced the final funeral rites of Abia’s illustrious son, Ezenwata, Ibeku Kingdom, who passed on, Tuesday March 15, 2022 at a Lagos hospital.\nThe programme which will be conducted in Lagos and his home town Umuahia, is detailed below:Facebook Notice for EU!\nYou need to login to view and post FB Comments!"
  },
  {
    "headline": "Osun govt engages over 50 SMEs to drive food support scheme",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun state government on Tuesday, disclosed that over 50 small and medium-scale enterprises (SMEs) have been fully engaged since the introduction of its food support scheme one year ago.\nThe government noted that the impact of the scheme which was introduced to provide food support to vulnerable residents, has been very holistic and greatly felt in different sectors of the state’s economy.\nThe Governor said: “Exactly a year ago when we launched the monthly Food Support Scheme, a lot of people were skeptical about its sustenance and doubt that the programme would last for three months.\n“Consequently, we decided to distribute gari as we did last month to boost local production and encourage our local entrepreneurs.\nWe are happy to have made this feat within one year particularly on gari production, because we have been able to show that consistently, our local entrepreneurs can produce the product."
  },
  {
    "headline": "Over 200, 000 have benefited from of Osun health insurance scheme – Adelakun",
    "summarized_story": "By Sunday Oguntuyi, OsogboThe Chairman, governing council of Osun Health Insurance Scheme, Hon.\nAdeoye Adelakun, on Tuesday, disclosed that over two hundred thousand citizens of the state are benefiting from the health insurance scheme initiated by the current administration.\n“We have engaged in training of health workers on quality improvement planning and operationaliation of the health insurance scheme,” he said.\nIt was followed by state equity grant of N477.9m for the vulnerable in September 2019.\nHe said Governor Oyetola createdo enabling environment for the successful implementation of the scheme through the establishment of the governing board."
  },
  {
    "headline": "Osun Debt Portfolio and Wale Bolorunduro’s unending display of arrogance and ignorance, By Tunde Adejumo",
    "summarized_story": "First, as the current head of the State’s Debt management office (DMO), i wish to maintain that the Debt portfolio passed by the last administration to the current administration in the State is in excess of =N=200billion.\nSecond, on the issue of disclosure of necessary details on the State’s Debt portfolio, I wonder the level of disclosure expected from the State’s DMO by Wale.\nAside from fulfilling the routine reporting obligations on the State’s debts to the Federal DMO, our office has since 2020 been publishing comprehensive annual report on the State’s Debt Sustainability Analysis (DSA) and Debt management Strategy (DMS) on the State’s official website.\nThis is contrary to Wale’s claim, and in fulfilment of additional reporting requirements aimed at ensuring transparency on sub-nationals’ financial management.\nI am certain Wale’s level of ignorance about the State’s financial affairs, full knowledge of which he was always arrogantly claiming will be fully revealed."
  },
  {
    "headline": "After 2 Months Of Scarcity, CBN Wades Into Fuel Crisis",
    "summarized_story": "The CBN bank governor, Godwin Emefiele, who revealed this move yesterday at the month’s meeting of the Monetary Policy Committee of the CBN, said the bank would take measures to mitigate the impact of the fuel crisis on the Nigerian economy by engaging with key government agencies.\nThis is coming two months after the importation of the off-spec petrol which plunged the country into fuel scarcity of massive proportions.\nADVERTISEMENTThe CBN governor further stated that product scarcity was responsible for the arbitrary increase in the prices of diesel and petrol across the country.\n“We will be engaging with the power minister, NBET and NERC to see whatever we can do to support them,” the CBN governor stated.\nADVERTISEMENTAccording to him, the CBN had disbursed over N1.3 trillion in the last five years to support both the power generating and distribution companies."
  },
  {
    "headline": "Convention: APC Begins Screening Of Aspirants",
    "summarized_story": "After keeping members and aspirants in suspense throughout the weekend, the All Progressives Congress (APC) has finally announced that the screening of its aspirants will commence today.\nADVERTISEMENTA statement signed by secretary of the screening committee, Barr Emmanuel Chukwuemeka Otagburuagu, noted that the chairman of the party’s national convention screening sub-committee, Governor Masari, has invited aspirants for the exercise billed to hold in two batches between today and Wednesday.\nDimeji Bankole, CFR, the Co-Chairman of the APC 2022 National Convention Screening Committee, hereby invites all the Aspirants to the Screening Exercise,” Otagburuagu stated.\nADVERTISEMENTAccording to him, the screening of national chairmanship aspirants and other NWC positions will take place today at a time to be communicated to the aspirants, Wednesday, screening of aspirants into the zonal offices will be held tomorrow from 10am.\nThe media committee has broken “into sub-committees that have speedily moved on their various assignments aimed at delivering a successful Convention six days from today,” a statement by secretary of the media committee, Garba Shehu, stated."
  },
  {
    "headline": "2023: Niger Governor Directs Aides With Ambition To Resign",
    "summarized_story": "Amid controversy on whether political appointees are to vacate their offices before contesting or not in primaries of the political parties, Niger State government has ordered political office holders aspiring to contest for elective political offices in 2023 to tender their resignation letter.\nThe government in a circular obtained by LEADERSHIP dated 21/3/2022 and signed by the secretary to the state government Ahmed Ibrahim Matane gave all political aspirants who are appointees up to the end of March to tender their resignation.\nMeanwhile, LEADERSHIP has gathered that seven commissioners have notified the government that they were resigning their appointments to contest for political offices.\nIt was learnt that most of them would be contesting for the state House of Assembly and House of Representatives’ seats.\nSupport is reportedly being mobilized for one of the commissioners to become the next governor of the state."
  },
  {
    "headline": "2023: Niger Governor Directs Aides With Ambition To Resign",
    "summarized_story": "Amid controversy on whether political appointees are to vacate their offices before contesting or not in primaries of the political parties, Niger State government has ordered political office holders aspiring to contest for elective political offices in 2023 to tender their resignation letter.\nThe government in a circular obtained by LEADERSHIP dated 21/3/2022 and signed by the secretary to the state government Ahmed Ibrahim Matane gave all political aspirants who are appointees up to the end of March to tender their resignation.\nMeanwhile, LEADERSHIP has gathered that seven commissioners have notified the government that they were resigning their appointments to contest for political offices.\nIt was learnt that most of them would be contesting for the state House of Assembly and House of Representatives’ seats.\nSupport is reportedly being mobilized for one of the commissioners to become the next governor of the state."
  },
  {
    "headline": "Nigeria, UK Launch Device To Tackle Climate Change Registration March 26",
    "summarized_story": "Energy Commission of Nigeria (ECN), the Federal Ministry of Environment and the British High Commission have jointly launched an updated version of the Nigeria Energy Calculator 2050 (NECAL 2050) to tackle climate change.\nJidere Bala, the director-general/ CEO Energy Commission of Nigeria, and various stakeholders.\nAt the event minister of science, technology and innovation, Dr Ogbonnaya Onu, said, “This is an energy planning tool that enables choices in energy development pathway to be examined, along with its environmental consequences.\nThis will be used in planning energy needs for Nigeria’s Vision 2050 and beyond.\nThe British high commissioner to Nigeria, Catriona Laing in her remarks said, “The launch of the Nigeria Energy Calculator 2050 further strengthens bilateral collaboration between the UK and Nigeria on the clean energy transition."
  },
  {
    "headline": "Buhari inaugurates terminal with 66 check-in counters for MMIA in Lagos",
    "summarized_story": "President Muhammadu Buhari has inaugurated the new Terminal Building of the Murtala Muhammed International Airport, Lagos.\nThe terminal has sixty-six check-in-counters, sixteen Immigration desks at arrival, twenty-eight Immigration desks at departure, and eight security screening points, among others.\n‘‘Similar projects at both the Nnamdi Azikiwe International Airport and Port Harcourt International Airport were completed and commissioned by this administration and our people have since been benefiting from the positive economic impacts of those magnificent terminals.\nThe Governor of Lagos State Babajide Sanwo-Olu said it was instructive that Lagos State in one day had witnessed the evolution of three major infrastructure development projects that will change the Nigerian landscape while commending President Buhari for the infrastructural renewal and redevelopment necessary for a city like Lagos.\nThe signing of the agreement for the partnership was later done by the officials of the Lagos State Government and FAAN."
  },
  {
    "headline": "Elon Musk opens Tesla’s gigafactory in Germany",
    "summarized_story": "Elon Musk was cheered as he oversaw the handover of Tesla’s first German-made cars at its Gruenheide plant on Tuesday.\nThe opening marked the start of the U.S. automaker’s inaugural European hub just two years after it was first announced.\n“This is a great day for the factory,” Musk said, describing it as “another step in the direction of a sustainable future”.\nMusk said that Tesla is likely to launch a test version of its new “Full Self-Driving” software in Europe, possibly next year depending on regulatory approval.\nGerman Chancellor Olaf Scholz, who also attended the event, lauded the gigafactory as the future of the car industry."
  },
  {
    "headline": "FAAC distributes N695 billion to FG, states, LGAs",
    "summarized_story": "By Kadiri AbdulrahmanThe Federation Accounts Allocation Committee (FAAC), has distributed N695.033 billion among the three tiers of government for February.\n“The states received N190.007 billion, the Local Government Councils (LGs) got N140.612 billion, while the oil producing states received N23.750 billion as derivation (13 per cent of Mineral Revenue), ” he said.\n“The states received N82.818 billion, Local Governments got N57.972 billion, while Cost of Collection to Federal Inland Revenue Service (FIRS) and Nigeria Custom Service got N7.115 billion, and allocation to NEDC project received N5.123 billion, ” he said.\nOshundun explained that the distributed Statutory Revenue of N429.681 billion, received for February was higher by N33.29 billion than the N396.432 billion received in January.\n“However, Import and Excise Duties, Companies Income Tax (CIT) and Value Added Tax (VAT) all recorded considerable decrease, ” he said"
  },
  {
    "headline": "OAU VC: Give Peace A Chance, Oyetola Appeals To Protesting Ife Citizens",
    "summarized_story": "Governor Adegboyega Oyetola of Osun has appealed to citizens of Ile-Ife who are protesting the choice of the new Vice Chancellor for the Obafemi Awolowo University to give peace a chance and stop the protest forthwith.\nTo this end, he urged all protesting citizens to exercise restraint and allow peace to reign.\n“By their nature and functionality, universities are rules- and convention-based conservative institutions premised on academic and governance autonomy.\n“If we have any reason to believe that these rules are circumvented, there are laid-down procedures to remedy such situations rather than resorting to self-help.\nWe must therefore not do anything to tarnish that enviable reputation, “ Oyetola added."
  },
  {
    "headline": "Why I Will Not Have Problems With Obiano – Governor Soludo",
    "summarized_story": "Prof Chukwuma Soludo, the governor of Anambra State, has stated that he is confident that he will not have any issues with his predecessor, Willie Obiano.\nOn Tuesday, Soludo said there was no place for such in his government on AriseTV’s morning show.\n“But Chief Willie Obiano is not that kind of man.\nI mentioned him even in my inaugural speech, he is a man who stands by his words,” Soludo said.\nThere have been insinuations that the governor, Prof. Soludo may have already fallen apart with his predecessor but Soludo in the programme rather praised Obiano for his forthrightness, and unwavering tenacity in standing by him, after they both accepted to work together, during Obiano’s reelection bid, while also working for his (Soludo’s) election last year."
  },
  {
    "headline": "BREAKING: MultiChoice Increases Prices Of GOtv, DStv Packages",
    "summarized_story": "The prices of MultiChoice Nigeria’s DStv and GOtv packages have gone up.\nMultiChoice Nigeria is a subsidiary of MultiChoice Africa, the owner of DStv and GOtv in Nigeria.\n“In light of the rising costs of inflation and business operations, we have had to review the price of our packages to keep delighting our customers with great entertainment, anytime and anywhere,” the statement reads.\nTherefore, from April 1, 2022, a new pricing regime for both our DStv and GOtv packages will be in effect.”"
  },
  {
    "headline": "BREAKING: Terrorists Attack Community In Buhari’s Home State, Kill Residents, Abduct Many Others",
    "summarized_story": "BREAKING: Terrorists Attack Community In Buhari’s Home State, Kill Residents, Abduct Many OthersGunmen suspected of being bandits killed at least two people in Mai Bakko village, Sabuwa Local Government Area, Katsina State.\nResidents informed SaharaReporters that the terrorists, known locally as bandits, raided the community Tuesday morning as people were getting ready for prayer and stayed for several hours.\n“The attackers started firing indiscriminately, resulting in the death of the victims,” it was learned when they arrived in the area on motorcycles.\nDespite being President Muhammadu Buhari’s home state, Katsina has seen intermittent attacks by bandits and kidnappers that have taken many lives.\nOn the same day, 84 Islamiyya students from Hizburrahim Islamiyya in Mahuta village, Dandume Local Government Area, were kidnapped but later rescued."
  },
  {
    "headline": "FG, States, LGs share N695.033bn for Feb 2022",
    "summarized_story": "The Federation Accounts Allocation Committee (FAAC), has shared a total sum of N695.033 billion to the three tiers of government for the month of February, 2022.\nAt its virtual meeting held Tuesday, the federal government received N236.177 billion, the States got N190.007 billion, and the Local Government Councils took home N140.612 billion.\nThe oil producing states received N23.750 billion as their share of 13 per cent derivation the sum of N23.989 billion was spent as Cost of Collection, just as N80.498 billion went to Transfers/Refunds.\nFederal government got N24.845 billion, States received N82.818 billion, Local Government Councils got N57.972 billion, while Cost of Collection to FIRS and NCS got N7.115 billion and Allocation to NEDC project received N5.123 billion.\nHowever, Import and Excise Duties, Companies Income Tax (CIT) and Value Added Tax (VAT) recorded considerable decreases."
  },
  {
    "headline": "[Breaking] Electoral Act: Senators divided, debates Court ruling Wednesday",
    "summarized_story": "The Senate Tuesday resolved to debate ruling of a Federal High Court in Umuahia, Abia state last week which nullified provisions of section 84(12) of the 2022 Electoral Act.\nJustice Evelyn Anyadike of the Federal High Court had in her ruling last week Friday, ordered the Attorney – General of the Federation to expunge the section from the Electoral Act.\nShe said the section contravenes provisions of the 1999 Constitution which allows appointive political office holders contesting for any election to remain in office 30 days to the election.\nNeed for debate on the court ruling was moved by Senator George Sekibo (PDP Rivers East) and seconded by Senator Chukwuka Utazi (PDP Enugu North).\nDetails loading…"
  },
  {
    "headline": "VIDEO: Petrol, diesel storage tanks explode in Niger",
    "summarized_story": "A fire outbreak on Monday engulfed a building in Javino, an area of Gauraka in Tafa Local Government Area of Niger.\nWith fuel scarcity in the country, the owner of the goods was said to also store diesel in tanks for sale to customers as ‘black market’.\nThe fire rose to consume other tanks containing fuel and diesel, a few shops around and the roof of a building under construction.\nLinda Albert, one of the eyewitnesses, wants the dealers of such goods taken away from residential area.\nThis is a residential area and imagine if this fire incident started in the night, lives would have been lost,” Albert said."
  },
  {
    "headline": "Buhari Commissions $2.5bn Dangote Fertiliser Plant In Lagos",
    "summarized_story": "﻿President Muhammadu Buhari has commissioned the Dangote Fertiliser Plant in the Ibeju-Lekki area of Lagos.\nPresident Buhari inaugurated the facility as part of activities lined up for his working visit to Lagos.\nThe Dangote Fertiliser Plant is Africa’s largest granulated urea fertiliser complex.\nIt is expected to help Nigeria retain $125 million in import substitution and provide $625 million from exports of products from the fertiliser plant.\nRise Of AgropreneursNigeria, President Buhari stated, also stands to gain extensively in earnings of foreign exchange from the excess production and export from the plant."
  },
  {
    "headline": "President Buhari Commissions New Airport Terminal In Lagos",
    "summarized_story": "﻿President Muhammadu Buhari on Tuesday commissioned a new terminal at the Murtala Muhammed International Airport in Lagos.\nIt comprises of a four-storey Main Terminal Building, three-storey Finger Building, two-storey Cargo Terminal Building, 82,925sqm apron, and external and ancillary works.\n‘World class infrastructure’“It is with great pleasure that I am here today to perform the official commissioning of the newly constructed terminal building at the Murtala Muhammed International Airport Lagos,” the President said at the terminal commissioning on Tuesday.\nSimilar projects at both Nnamdi Azikiwe International Airport and Port Harcourt International Airport were completed and commissioned by this administration and our people have since been benefitting from the positive economic impact of these magnificent terminals.\nI therefore congratulate all Nigerians on the successful completion and commissioning of the terminal building of the Murtala Muhammed International Airport Lagos, our premier airport.”"
  },
  {
    "headline": "I Will Ensure State Police As President – Tambuwal",
    "summarized_story": "﻿Sokoto State Governor on Tuesday said state policing is essential to solving Nigeria’s insecurity problems.\nSpeaking on Channels Television’s Politics Today, Tambuwal said he will ensure the implementation of state policing across the country if elected President of Nigeria in 2023.\nWe must go and address the issue of state policing and get security closer to the people.”READ ALSO: President Buhari Doesn’t Understand Nigeria – TambuwalWhen asked if he will present a state policing bill to the National Assembly as President, Mr Tambuwal answered in the affirmative.\n“If it means me Aminu Tambuwal as the President of Nigeria taking the bill personally to President of the Senate and the Speaker of the House of Reps, I will do so,” he said.\nThe Governor also acknowledged that he was in talks with other presidential aspirants in the PDP with the hopes of reaching a consensus."
  },
  {
    "headline": "Bamise’s Murder: Lagos Govt Arraigns BRT Driver, Court Fixes May 9 For Trial",
    "summarized_story": "The Lagos State Government has arraigned the driver of the Bus Rapid Transport (BRT), Andrew Nice Omininikoron, before the State High Court sitting at Tafawa Balewa Square, TBS.\nHe was arraigned on a 4 count bordering on rape, conspiracy and murder of his passenger, Oluwabamise Ayanwola.\nAccording to the prosecutor, the offences committed is contrary to and punishable under Sections 411, 223, 260 and 165 of the Criminal Laws of Lagos State, 2015.\nFollowing his plea, the DPP asked the court to order a further remand of the defendant at the Ikoyi prison.\nJustice Sonaike subsequently adjourned the case to May 9, 10 and 11, 2022 for commencement of trial."
  },
  {
    "headline": "FAAC: FG, States, LG Share N695bn For February",
    "summarized_story": "The FAAC Director Information, Mr. Olajide Oshundun, disclosed this in a communique on Tuesday, after a Virtual Conference.\nThe distribution is as follows; Federal Government got N24.845 billion, the states received N82.818 billion, Local Government Councils got N57.972 billion, while Cost of Collection to FIRS and NCS got N7.115 billion and Allocation to NEDC project received N5.123 billion.\nIt also revealed that Petroleum Profit Tax (PPT) increased significantly, while Oil and Gas Royalties increased marginally.\nHowever, Import and Excise Duties, Companies Income Tax (CIT) and Value Added Tax (VAT) recorded considerable decreases.\nIt was further disclosed that total revenue distributable for the current month was drawn from Statutory Revenue of N429.641billion, Value Added Tax (VAT) of N177.873 billion, Excess Bank Charges Recovered of N7.479 and Non-Mineral Revenues of N80.000billion."
  },
  {
    "headline": "SouthWest PDP Leaders insist on Southern Presidency -",
    "summarized_story": "Some Southwest leaders of the People’s Democratic Party says it is in support of the southern governor’s forum agreement that the next Nigerian President should come from the south.\nThe PDP stakeholders made this known through a communique read at the end of a meeting held by the Extended Zonal caucus of the party in Ibadan.\nThe communique which was read by the Southwest Vice Chairman of the People’s Democratic Party Soji Adagunodo also reaffirmed the position of the leaders in the unity of Nigeria.\nAccording to him, the Southwest Zone is in support of the Southern Governors’ Forum that the next President of the federal Republic of Nigeria should come from the south.\nPresent at the stakeholders meeting were the former governor of Ekiti state Ayodele Fayose, former Ondo state governor, Olusegun Mimiko, a Chieftain of the Party, Bode George and other big wigs of the party."
  },
  {
    "headline": "House to revisit rejected bills within seven legislative days",
    "summarized_story": "The House of Representatives on Tuesday promised to revisit the gender bills earlier rejected.\nHouse Leader, Alhassan Ado-Doguwa, made the promise while addressing protesting women at the National Assembly.\nThe Speaker’s delegation appealed to the women groups to sheathed their sword and stop the daily protest.\nThe women agreed to suspend their daily protest to allow the two chambers fulfil their promise of revisiting the bills in the next two weeks."
  },
  {
    "headline": "Electoral Act: Senate set to debate court ruling on contentious clause 84 (12) -",
    "summarized_story": "The Nigerian Senate will deliberate on a recent High Court Judgment in Abia State that granted an order for the Contentious clause 84(12) to be removed from the 2022 Electoral Act.\nSenator Sekibo came under orders 10 & 11 urging the Parliament to treat the matter with a sense of urgency and debate it immediately.\nBut the Deputy Senate President, Senator Omo Agege who presided over Tuesday’s Plenary suggested that lawmaker delay the debate until the next legislative sitting.\nHe said this is to allow the Senate President preside over the matter and also give an opportunity to other senators to participate.\nAfter listening to the Contributions of other lawmakers, the Senate agreed to suspend the debate until it’s next Plenary Sitting on Wednesday."
  },
  {
    "headline": "Youth group protests, demands extension of registration for PVC in Ekiti -",
    "summarized_story": "A concerned Youth Group under the umbrella of the Ekiti Freedom Movement has Staged a walk to the Office of the Independent National Electoral Commission (INEC) in Ado-Ekiti for extension of time for Registration and Collection of Permanent Voters card in the State.\nThe deadline for the collection of voters card elapsed on the14th of March and they are pleading that since the state is having it’s Gubernatorial Election in June, there will be a good number of citizens who will be DisenfranchisedThey argued that Most people who had their data captured online could not collect their PVC before the date elapsed.\nSimilarly, because of the large number of residents who wants to register, most of them were not attended to at the INEC officeThe Legal officer of INEC told the Protesting Youths that it is less likely that their request of registering for PVC will be granted especially with the Governorship Election to hold less than 90 days time"
  },
  {
    "headline": "‘I Want to Build a Stronger Economy By Leveraging on Resourcefulness and Enterprise’- Charles Soludo",
    "summarized_story": "After his recent inauguration as Governor of Anambra State, Charles Chukwuma Soludo, sits exclusively with ARISE News to share his ideas and hopes for Anambra State in his upcoming term.\nHe discusses his agenda in economic reform, reductions of crime rates and unemployment rates."
  },
  {
    "headline": "Nasir El-Rufai Under Fire Over Terrorist Attack In Kaduna – Trending With Ojy Okpe",
    "summarized_story": "More than 23 people have been reportedly killed by gunmen in three communities in the Kaduna State.\nSeveral people were also said to have been injured and about 70 houses burnt down by the terrorists.\nIn the meantime, the Kaduna state government has declared a 24-hour curfew in Jema’a and Kaura Local government areas of the state.\nA video showing some indigenes of Ile Ife in Osun state occupying the Obafemi Awolowo University in protest over the appointment of a new vice-chancellor of the institution is making the rounds on social media..\nFinally, a video showing an unlatched container conveyed by a truck with missing wheels has gone viral."
  },
  {
    "headline": "‘Our Products Have Already Reached The US, Brazil, India and Mexico’- Aliko Dangote",
    "summarized_story": "Aliko Dangote, at the commissioning of the Dangote Fertilizer Plant says “The fertilizer plant will reduce import dependency and improve on exports to drive a sustainable economy”,and “Low fertilizer, common reason for low production in the country “"
  },
  {
    "headline": "Buhari Arrives Dangote Fertilizer Plant for Commissioning",
    "summarized_story": "Share on TwitterShare on Facebook1 of 3 - +President Buhari arrives Dangote Fertilizer plant in Ibeju Lekki, to commission the 3 metric tons expandable fertilizing plant."
  },
  {
    "headline": "Russia-Ukraine War: Civilians Fleeing Mariupol Describe Street-to-Street Battles",
    "summarized_story": "Civilians making the dangerous escape from Ukraine’s embattled southern port hub of Mariupol described fleeing through street-to-street gun battles and past unburied corpses as a steady Russian bombardment tried to pound the city into submission.\nThe regained territory allowed Ukrainian forces to retake control of a key highway to the west and block Russian troops from surrounding Kyiv from the northwest.\nRussian President Vladimir Putin’s forces are increasingly concentrating their air power and artillery on Ukraine’s cities and the civilians living there, killing uncounted numbers and sending millions fleeing.\nOlga Nikitina, who fled Mariupol for the western Ukrainian city of Lviv, where she arrived Sunday, said gunfire blew out her windows, and her apartment dropped below freezing.\nTalks between Russia and Ukraine have continued by video but failed to bridge the chasm between the two sides."
  }
]