[
  {
    "headline": "Despite deaths, resignations, MDA’s bills keep rising – ICPC",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offices Commission has said it uncovered fresh 3,309 employment in 26 ministries, departments and agencies.\nThe commission added that the recruitments were uncovered amidst denials by the respective MDAs.\nThe ICPC stated that it uncovered the state of employment when it sent an inquiry to the Office of the Head of Service of the Federation, Dr Folashade Yemi-Esan, on October 8, 2021.\nThe commission disclosed this in its ethics and integrity scorecard which it made available to our correspondent in Abuja.\nHowever in this survey, all MDAs assessed denied employing staff during the period under review."
  },
  {
    "headline": "Couple caught with fresh human parts in Ogun",
    "summarized_story": "Operatives of the Ogun State Police Command have arrested 43-year-old Kehinde Oladimeji and his 35-year-old wife, Adejumoke Raji for being in possession of fresh human parts.\nThe suspects, who are residents of 72, MKO Abiola way, Leme, Abeokuta were reportedly arrested after different fresh human parts such as hands, breasts and other parts were found in their house.\nOyeyemi said the couple claimed to be herbalists who got the human parts from one Michael who resides in Adatan area of Abeokuta.\n“On searching the room, a plastic bowl containing fresh different parts of human being was discovered in the room, and the couple were promptly arrested.\n“On interrogation, the suspects confessed they were herbalists and that the human parts comprise hands, breasts and other parts were given to them by one Michael who they claimed resided in Adatan area of Abeokuta."
  },
  {
    "headline": "Ghana detains activist over ‘coup’ comments on Facebook",
    "summarized_story": "A popular Ghanaian social activist who has led protests against President Nana Akufo-Addo’s government has been arrested after making comments on social media about plotting a coup, the police said on Saturday.\nBarker-Vormawor posted on social media that he will stage a coup if Parliament passes a controversial bill, popularly known as E-Levy.\nUseless Army!” Barker-Vormawor said in a series of posts on Facebook.\nA police spokesman said the activist was being questioned to decide the formal charges that he will face in court.\nThe #FixTheCountry hashtag that became a popular social media protest on Twitter in Ghana later expanded into a pressure group supported by the main opposition National Democratic Congress to stage protests on the streets."
  },
  {
    "headline": "Oyo APC crisis deepens as sports minister, national assembly members, others vow to challenge imposition in court",
    "summarized_story": "By Adeola BadruThe crisis in the All Progressives Congress (APC), Oyo State took a turn for the worse on Wednesday, as major stakeholders unanimously rejected Isaac Omodewu as Chairman of the party in the state.\nThe two zones with a voting strength of about 57 percent are the most populous zones in Oyo State.\nEarlier in the week, other major stakeholders of the party had also condemned the inauguration of Omodewu.\n“It will only lead the party to electoral disaster in Oyo State,” they warned.\n“The detail of what transpired on the purported State Congress of the party in Oyo State is an open book."
  },
  {
    "headline": "Government urged to curb youth restiveness, rituals",
    "summarized_story": "By Adeola BadruA former Commissioner for Finance in Oyo State and a stalwart of the All Progressives Congress, APC, Mr Bimbo Adekanbi, yesterday called on government at various levels to address social ills and end youth restiveness and money rituals rampant among them.\nHe called on government at all levels to address the social problems, which bedevil the country, most importantly unemployment.\nThen you begin to think is it that we have no youth in Nigeria that is worthy of being celebrated.\nSo we take up that and decide to start a bursary scheme for youths.”“This bursary scheme isn’t just an ordinary scheme but we said we want to celebrate the best of the best among the youth.\nAll we ask is are you excellent, have you scored 3.5 and above then you’re qualified for this benefits of this scheme,” he saidVanguard News Nigeria"
  },
  {
    "headline": "FCT Polls: INEC commended for functional BVAS machines",
    "summarized_story": "By Gabriel Ewepu – AbujaAs the much anticipated Area Council elections in the Federal Capital Territory, FCT, holds today (Saturday), the Independent National Electoral Commission, INEC, has been commended by party agents for functional BVAS machines.\nREAD ALSO: Low turnout mars FCT polls in Municipal Area Council“The security agencies are really on ground and are doing their job unhindered as you can see.\n“We commend INEC for functional BVAS machines deployed here because there is no delay since accreditation started.\nHe added that the security agents are doing their job for a peaceful and credible electoral process.\nHowever, women voters were seen sharing N100 each in groups from the proceeds of vote-buying by party agents."
  },
  {
    "headline": "Constitution Review: Local Govt autonomy, legislature, judicial reform, state creation, state police, devolution of powers, others top agenda",
    "summarized_story": "Of the 62 bills, eight (8) bills were rejected, twenty-five (25) Bills were retained with modifications and the consideration of 3 bills were deferred.\nWhatever we have done will still go through the State Houses of Assembly for their own input and vote.\nGoing forward, after the passage of the proposals by the National Assembly in a fortnight, you will be the pillar on which this work will be anchored.\nOn his part, the Speaker of the Bauchi State House of Assembly and Chairman Conference of Speakers of State Legislatures of Nigeria, Rt.\nAbubakar Suleiman called on the 36 State Houses of Assembly to support the identified amendments in the constitution."
  },
  {
    "headline": "APWEN calls for collective efforts to solve water-related challenges",
    "summarized_story": "… highlights role of women and girls in scienceBy Ebunoluwa SessouAs the world marks International Day for Women and Girls in Science, the Association of Professional Women Engineers of Nigeria, APWEN, has called for collective efforts to highlight the role of women in science and technology in solving water-related challenges.\nOver the past thirty-nine years, APWEN has made significant strides in encouraging and engaging women and young girls in science.\n“Water, Sanitation, Hygiene, WASH, and Ocean issues are at the core of sustainable development because they are closely connected to several key global challenges such as energy, food security, biodiversity, health, climate change, among others.\n“The COVID-19 pandemic has shown the importance of sanitation, hygiene and adequate access to clean water in order to prevent diseases.\nYet billions of people still lack safe water sanitation, coupled with inadequate funding for water”, she said."
  },
  {
    "headline": "FCT voters angry over malfunctioning BVAS",
    "summarized_story": "Angry voters on Saturday were outraged by the delay in identifying them by the Bimodal Voter Accreditation System (BVAS) device in the Federal Capital Territory (FCT) Council elections.\nThe Independent National Electoral Commission (INEC) presiding officers attributed the poor performance of the BVAS to network failure.\nThe situation caused some arguments between officials conducting the elections and the voters at polling unit 018, Central Post Office area.\n- Advertisement -Voting was supposed to commence officially by 8:30 am but as 10:30 am INEC staff and voters were yet to arrive at many polling units.\nThere was also a poor turnout of voters, which was attributed to the fuel scarcity that made movement difficult."
  },
  {
    "headline": "PHOTOS: FCT council poll kicks off",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "FCT council poll: Residents hit streets despite restriction",
    "summarized_story": "Many residents of the Federal Capital Territory (FCT) Abuja on Saturday morning went about their businesses despite restriction of movement over the council poll.\nVoting has started in most polling units in Kuje Area Council and some parts of Garki, Wuse.\nAlso, unlike in the 36 States where State electoral commissions conduct the council elections, INEC conducts the poll in Abuja.\nPolice officers are all over the city and rural areas manning polling units across FCT.\nFourteen political parties are competing for 62 councillors and six chairmanship seats in the FCT Area Council election."
  },
  {
    "headline": "Shake up in presidency as Buhari sacks First Lady’s aide",
    "summarized_story": "President Muhammadu Buhari has approved reorganisation of the workforce in the Office of the First Lady, leading to the sack of a political appointee, redeployment of three and appointment of a new one.\nBuhari appointed renowned journalist and former member of the House of Representatives, Muhammad Sani Zorro, as his new Senior Special Assistant on Public Affairs and Strategy deployed in the Office of the First Lady.\nThe statement also said the President has approved the immediate disengagement of his Special Assistant on Domestic and Social Events in the Office of the First Lady, Zainab Kazeem.\n“President Muhammadu Buhari has approved the appointment of Muhammad Sani Zorro, journalist, politician and former lawmaker, as the Senior Special Assistant to the President on Public Affairs and Strategy, Office of the First Lady.\n“He was at various times President, Nigeria Union of Journalists, NUJ, West African Journalists Association (WAJA) and the Federation of African Journalists, FAJ."
  },
  {
    "headline": "Apathy, late arrival of INEC staff, materials as FCT council poll begin",
    "summarized_story": "The Federal Capital Territory (FCT) Area Council Elections may be marred by voter apathy and late arrival of Independent National Electoral Commission (INEC) workets and electoral materials.\nAs at 8:30 on Saturday, most of the polling units visited by The Nation were empty, except for security personnel.\nAt Karu Ward, in Abuja Municipal Area Council, polling units 11, 12 and 120 were deserted when our correspondent visited.\nThe few policemen on duty said they were yet to see the INEC staff.\nBut there were skeletal movements within the metropolis by commuters."
  },
  {
    "headline": "FCT council poll: One feared dead",
    "summarized_story": "From Fred Itua, AbujaA woman has been feared killed after a reckless supporter of one of the major political parties, riding a motorbike, knocked her down.\nNigerians can now work and earn dollars DAILY from home.\nRegular individuals can earn as low as $300 daily Find out how it works.\nThe rider who carried the flag of one of the political parties rode in a frenzy as if he was under the influence of drugs or alcohol.\nVoters in the area immediately apprehended the motorcyclist and handed him over to security operatives deployed for the election."
  },
  {
    "headline": "Area council polls; FCT police makes u-turn, orders restriction of movement from 8am to 3pm over insecurity",
    "summarized_story": "Regular individuals can earn as low as $300 daily Find out how it works.\nFollowing security reports about perceived violence for Saturday’s area council elections, the Federal Capital Territory(FCT), police command has ordered the restrictions of movement from 8am to 3pm to restore law and order.\nThe command which had earlier relaxed the restriction order beginning from 12 midnight Friday to 4pm, Saturday, said the restriction became necessary from credible intelligence at its disposal.\nPolice public relations officer made this known in a statement issued late Friday night in Abuja.\nThe statement reads; “Base on credible intelligence at the disposal of the FCT Police Command and in the best security interest of the territory, the Fct police command has deemed it fit to restore the earlier pronounced restrictions of movement."
  },
  {
    "headline": "2023: APC, PDP in zoning dilemma",
    "summarized_story": "But unlike the PDP, APC initially hinted at zoning its presidential ticket to the South even though it did not state which part of the geopolitical zone will be favoured to produce the party’s flag-bearer.\nAt the moment, certain variables seem to be thawing the earlier position of the APC to go down South.\nSo, in the APC and PDP, there is an impasse over which zone should produce President Buhari’s successor when he leaves office in 2023.\nBoth parties are battling to wriggle through the zoning conundrum at a minimal cost to their political fortunes in 2023.\nFollowing that, there are indications that the APC is currently in a dilemma over the zoning of the 2023 presidency."
  },
  {
    "headline": "I wish to get married this year –Princess Salt",
    "summarized_story": "Pretty actress, Princess Chidimma Agunobi fondly called Princess Salt, has revealed reasons she turned down many marriage proposals.\nAccording to the thespian, she decided to reject some suitors because of their pride and self-aggrandisement.\n“Yes, I have turned down marriage proposals from suitors because they had too much pride in them and it’s so distasteful.\nWhen asked by Saturday Sun if she has had encounter with lesbians in Nollywood, Princess Salt, who is100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nI wish to get married this year if it’s God’s will for me,” the screen diva noted."
  },
  {
    "headline": "Fresh strike: Fate of varsity students hang in the balance",
    "summarized_story": "By Gabriel DikeA crucial National Executive Council (NEC) of Academic Staff Union of Universities (ASUU) will begin today at the University of Lagos (UNILAG) Akoka.\nAs at Friday, principal officers of ASUU as well as branch chairmen were already in UNILAG for the make or mar meeting.\nIn the last one month, ASUU national officers, zones and branches mobilized members for the impending strike.\nWhen Saturday Sun visited UNILAG on Friday, principal officers of ASUU were in a meeting.\n“Saturday (today) will make or mar the university system."
  },
  {
    "headline": "BREAKING: Ex-Zamfara State Governor, Yari, Flown To United Kingdom In Wheelchair For Medical Treatment",
    "summarized_story": "A former governor of Zamfara State, Abdul'aziz Yari, has been flown to the United Kingdom in a wheelchair.\n“Yari is flying to UK on British Airways flight for a medical trip.\nHe was even brought in a wheelchair,” a source at the airport confirmed to SaharaReporters on Saturday morning.\nThe 54-year-old politician was governor of Zamfara State from May 2011 to May 2019.\nIn April 2021, Yari was detained by the Economic and Financial Crimes Commission over alleged illegal financial dealings and misappropriation of funds."
  },
  {
    "headline": "BREAKING: Ex-Zamfara State Governor, Yari, Flown To United Kingdom In Wheelchair For Medical Treatment",
    "summarized_story": "A former governor of Zamfara State, Abdul'aziz Yari, has been flown to the United Kingdom in a wheelchair.\n“Yari is flying to UK on British Airways flight for a medical trip.\nHe was even brought in a wheelchair,” a source at the airport confirmed to SaharaReporters on Saturday morning.\nThe 54-year-old politician was governor of Zamfara State from May 2011 to May 2019.\nIn April 2021, Yari was detained by the Economic and Financial Crimes Commission over alleged illegal financial dealings and misappropriation of funds."
  },
  {
    "headline": "EXCLUSIVE: Community Residents In South-East Nigeria, Others Desert Homes Over Rise In Ritual Killings",
    "summarized_story": "\"I moved away from the community more than one week ago over the rise in mysterious deaths and mutilated bodies.\n\"Ritual killings subsided here a bit some time ago but it appears the evil has returned.\nA community leader in the area, Ezekiel Mba, told SaharaReporters that they were worried about the situation, adding that ritual killers were wreaking havoc around Isiala-Ngwa.\nThe son named Afeez Olalere disclosed that his mother encouraged him to kill his younger sibling for a money ritual.\nOn Wednesday, the House of Representatives called for the declaration of a national emergency of the rising cases of ritual killings across Nigeria."
  },
  {
    "headline": "EXCLUSIVE: Community Residents In South-East Nigeria, Others Desert Homes Over Rise In Ritual Killings",
    "summarized_story": "\"I moved away from the community more than one week ago over the rise in mysterious deaths and mutilated bodies.\n\"Ritual killings subsided here a bit some time ago but it appears the evil has returned.\nA community leader in the area, Ezekiel Mba, told SaharaReporters that they were worried about the situation, adding that ritual killers were wreaking havoc around Isiala-Ngwa.\nThe son named Afeez Olalere disclosed that his mother encouraged him to kill his younger sibling for a money ritual.\nOn Wednesday, the House of Representatives called for the declaration of a national emergency of the rising cases of ritual killings across Nigeria."
  },
  {
    "headline": "Russian President Set To Meet Biden, Macron After Warning By United States Over Invasion Of Ukraine",
    "summarized_story": "Vladimir Putin, Russian President, will on Saturday meet with the United States President, Joe Biden, and his French counterpart, Emmanuel Macron, after the United States warned that Moscow could invade Ukraine in days.\nOn Friday, the United States said a Russian invasion to Ukraine starting with civilians caught under aerial bombing could begin in days as it warned US citizens to leave within 48 hours, AFP reports.\nIn a diplomatic flurry to head off a possible invasion, Putin will speak with Biden and Macron on Saturday.\n“I’ll be asking Mr Lavrov if we can anticipate a response in the coming days, to see if we can carry the dialogue forward.”Blinken declined to confirm whether the United States would be evacuating its embassy staff from Kyiv.\nA US official said Biden would speak with Putin on Saturday, while Paris said Macron would also be calling the Russian leader on Saturday."
  },
  {
    "headline": "Buhari appoints Sani Zorro, former NUJ president, as aide of First Lady",
    "summarized_story": "President Muhammadu Buhari has appointed Muhammad Sani Zorro, former lawmaker, as senior special assistant to the president on public affairs and strategy in the office of the First Lady.\nZorro is a veteran journalist, who was president of the Nigeria Union of Journalists (NUJ), West African Journalists Association (WAJA) and the Federation of African Journalists (FAJ).\nHe was also in the house of representatives where he chaired the committee on internally-displaced persons (IDPs), refugees and initiatives on north-east.\nAdvertisementShehu also said the president approved the immediate redeployment of Mohammed Kamal Abdulrahman, senior special assistant to the president on health and development partners and personal physician to the First Lady; Hadi Uba, special assistant to the president on administration, and Wole Aboderin, special assistant to the president on non-governmental organisations.\nHe said the president approved the disengagement of Zainab Kazeem, special assistant to the president on domestic and social events in office of the First Lady."
  },
  {
    "headline": "Buhari appoints Sani Zorro, former NUJ president, as aide of First Lady",
    "summarized_story": "President Muhammadu Buhari has appointed Muhammad Sani Zorro, former lawmaker, as senior special assistant to the president on public affairs and strategy in the office of the First Lady.\nZorro is a veteran journalist, who was president of the Nigeria Union of Journalists (NUJ), West African Journalists Association (WAJA) and the Federation of African Journalists (FAJ).\nHe was also in the house of representatives where he chaired the committee on internally-displaced persons (IDPs), refugees and initiatives on north-east.\nAdvertisementShehu also said the president approved the immediate redeployment of Mohammed Kamal Abdulrahman, senior special assistant to the president on health and development partners and personal physician to the First Lady; Hadi Uba, special assistant to the president on administration, and Wole Aboderin, special assistant to the president on non-governmental organisations.\nHe said the president approved the disengagement of Zainab Kazeem, special assistant to the president on domestic and social events in office of the First Lady."
  },
  {
    "headline": "PHOTOS: Election begins in Abuja area councils",
    "summarized_story": "The election for chairmanship and councillorship kicked off in the six area councils of the federal capital territory (FCT) on Saturday.\nThey include Action Democratic Party (ADP), All Progressives Congress (APC), Peoples Democratic Party (PDP), Social Democratic Party (SDP), All Progressives Grand Alliance (APGA), Peoples Redemption Party (PRP), Allied Peoples Movement (APM), African Action Congress (AAC) and Labour Party (LP).\nThe election is being held in the 68 wards spread across Bwari, Abaji, Gwagwalada, Kuje, Kwali and Abuja Municipal Council (AMAC) area councils of the FCT.\nINEC had previously disclosed that there are 1,373,492 registered voters expected to participate in the election in 2,229 polling units.\nVoting in most polling units started later than 9am contrary to the 8:30am stipulated time."
  },
  {
    "headline": "PHOTOS: Election begins in Abuja area councils",
    "summarized_story": "The election for chairmanship and councillorship kicked off in the six area councils of the federal capital territory (FCT) on Saturday.\nThey include Action Democratic Party (ADP), All Progressives Congress (APC), Peoples Democratic Party (PDP), Social Democratic Party (SDP), All Progressives Grand Alliance (APGA), Peoples Redemption Party (PRP), Allied Peoples Movement (APM), African Action Congress (AAC) and Labour Party (LP).\nThe election is being held in the 68 wards spread across Bwari, Abaji, Gwagwalada, Kuje, Kwali and Abuja Municipal Council (AMAC) area councils of the FCT.\nINEC had previously disclosed that there are 1,373,492 registered voters expected to participate in the election in 2,229 polling units.\nVoting in most polling units started later than 9am contrary to the 8:30am stipulated time."
  },
  {
    "headline": "Atiku: There's no zoning in the constitution -- anyone can run for president",
    "summarized_story": "Atiku Abubakar, former vice-president, says there is no provision for zoning political offices in Nigeria’s constitution.\nThe chieftain of the Peoples Democratic Party (PDP) spoke at a meeting with a group calling on him to run for president in 2023.\nAtiku who is yet to officially join the 2023 presidential race, said the country’s challenges makes him “wonder if to go for it (contest) or not”.\nThere is no zoning in the constitution; there is none.\n“I was a member of the constituent assembly that drafted the current constitution and there was nothing like that.”"
  },
  {
    "headline": "11 African startups to watch out for in 2022",
    "summarized_story": "About 20 startups are currently listed on its platform and over $400,000 has been invested on the platform.\nThe startup creates a reliable portal to guide African students in their tertiary education, course selection, and career decisions.\nThe startup handles everything it takes for a business to launch in a new African country.\nWe think this startup is building a game-changing product; something that will have a significant impact on the growth of African startups.\nWe know you have some startups you are rooting for this year that we might have missed."
  },
  {
    "headline": "Nigerian bourse wants to attract tech IPOs with new listing rules",
    "summarized_story": "Nigeria has set in motion what could herald a new dawn for African tech startups as it moots the adoption of new listing rules to encourage tech companies to go public.\nOlumide Bolumole, division head of stock exchange listing activities at NXG revealed that the bourse will make sweeping changes to make listing attractive to tech companies.\nNGX consists of a holding company and three subsidiaries that cover the operations of the Nigerian Stock Exchange (NSE), its regulation, and its real estate.\nThis structure is similar to those of other international market groups such as the London, New York, and Johannesburg stock exchange groups.\nIn recent decades, Nigeria’s stock market capitalisation has fallen well below potential."
  },
  {
    "headline": "TechCabal’s Valentine’s Gift Guide",
    "summarized_story": "Price range: > $99We’ve labelled this a Series C-type gift because it’s a long-term investment beneficial to all involved.\nPrice range: $2 – $4 (for Individual plans)We’re labelling this a seed-type gift because, any way you dice it, you’re sowing seeds.\nWell, here’s how you can someday build up to that: get them video streaming subscriptions for Valentine’s Day.\nLog on to your MTN, Safaricom, Airtel, or Ethio Telecom services and gift your loved one gigabytes of data.\nFor Valentine’s, add to your loved one’s crypto stash and help them build their way into digital wealth."
  },
  {
    "headline": "This developer transitioned to blockchain development in order to solve Web2 problems",
    "summarized_story": "Akinyemi Akindele, 27, studied computer science at the University of Ibadan, where he trained as a Web2 software developer.\nEventually, he got to build a blockchain supply chain solution with his team, the first of its kind in the country, he said.\nAfter two years at Binance, Akindele joined EMTECH, a US blockchain company that builds digital currency for central banks across the world.\nBreaking into blockchain developmentAnother idea that endeared Akindele to blockchain engineering was that the blockchain was a melting point for a lot of things.\nHe also advised them to contribute to open source blockchain projects and look for ways to solve the problems that exist today in Web2 with Web3."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Is it possible to reduce or eradicate fraud in Africa?",
    "summarized_story": "To fight this, the company which claims to specialise in fighting fraud in Africa has recently raised a €20 million (~$23m) Series A to help them improve their game in fighting fraud.\nYes, you read that correctly; over $12 million will be invested in combating mobile fraud in Africa.\nWhile I’m interested in how the company intends to accomplish this, there’s also an indigenous company in Nigeria, Stellas digital bank planning to combat fraud.\nSide bar: Is it possible that the rise of startups focused on combating fraud will help achieve its purpose in Africa?\nTo know how, please, read: Stellas digital bank launches, plans to fix major loophole for fintech fraud in Nigeria."
  },
  {
    "headline": "Stellas digital bank launches with ‘Ghost Mode’ to fix major fintech fraud loophole in Nigeria",
    "summarized_story": "However, fraud remains the bane of both digital banks, and traditional banks alike.\nFor the newly launched Stellas digital bank, it plans to guard against one major loophole.\nToday, the company is launching a digital bank to “offer banking services with ease”.\nBasically, Stellas plans to protect user identities when making transactions, to guard against identity theft and ensure privacy and security.\nIn a space graced by the likes of Kuda, Sparkle, Fairmoney, and Carbon, Nigeria’s digital banking space look set to be exciting."
  },
  {
    "headline": "Rising to the challenge with the all-new Redmi Note 11 series",
    "summarized_story": "Xiaomi launched the Redmi Note 11 series for Nigerian markets on Wednesday, February 9th, 2022, carrying on the legacy of the Redmi Note series with three all-new devices – Redmi Note 11 Pro, Redmi Note 11S, and Redmi Note 11.\nMoreover, the Redmi Note 11 Pro, Redmi Note 11S, and Redmi Note 11’s 2MP depth camera allows you to create a natural bokeh effect for your portrait shots.\nAdvertisementThe Redmi Note 11 Pro and Redmi Note 11S rise to the challenge with an advanced octa-core MediaTek Helio G96 processor and up to 8GB of RAM.\nMarket availabilityThe Redmi Note 11 Pro and Redmi Note 11S are available in three configurations: 6GB+64GB, 6GB+128GB, and 8GB+128GB.\nMoreover, the Redmi Note 11 Pro will be available in early March, 2022, while the Redmi Note 11S and Redmi Note 11 are now available."
  },
  {
    "headline": "Voter apathy, late arrival of INEC officials, materials hallmark FCT council polls",
    "summarized_story": "The Federal Capital Territory Area Council polls got off to a slow start Saturday morning amidst several challenges, as election did not start until about 10am.\nMany people are however going about their activities, following the decision by the FCT Police to relax movement restrictions.\nBusinessDay checks revealed that election materials and polling officials of the Independent National Electoral Commission INEC did not get to the polling units until at about 9.30am, at Kuje, the capital if Kuje Area Council.\nThis is despite the fact that voters had turned out as early as 7.30am at the various polling units waiting for officials of INEC at the units.\nVoting however, took off at the Agwan tiv and Agwan Egan and Agwan Kaduna polling units at about 10am"
  },
  {
    "headline": "FCT Area Council Polls: Ad-hoc staff protest non payment, replacement",
    "summarized_story": "The Federal Capital Territory (FCT) Area Councils election could not start well over one hour after the Polling Units (PUs) were to open for accreditation and voting.\nAccreditation and voting at the election is scheduled to start at least 8:30 but that was no so at most of the polling units monitored by our Correspondent so far.\nThe reason for the delay was later arrival of materials and poll officials at most of the polling units visited.\nThis delayed the movement of materials and the staff from the Collation Centres/Registration Areas (Ward Centres) to the polling Units.\nThere were conflicting reports about the restriction of movement by theFCT Command of the Nigeria Police, one allowing movement and the other restricting movement"
  },
  {
    "headline": "Insuring your art collection",
    "summarized_story": "Whether you are a newbie or a seasoned collector, your enviable art collection when uninsured hedges a lot of risk.\nThis digest will arm you with everything you need to get started on the process of insuring your art pieces.\nWorking with a fine art insurance company ensures that your artwork or collection is covered to its most recent appraised value.\nSuchdocumentation includes but is not limited to proof of ownership, bill of sale, photographs, and the most recent appraisal on the art piece(s) or collection.\nContributor’s BioColumn Title: Art Index AfricaAbout Art Index AfricaArt Index Africa is Africa’s first art repository mirroring Africa’s real-time art exchange."
  },
  {
    "headline": "Edo begins asphalting of 105.6km Benin-Abraka Road – Nigerian Observer",
    "summarized_story": "The governor gave the assurance when he inspected the laying of asphalt on the ongoing reconstruction of the 105.6km Benin-Abraka Road.\nThe road stretches from Ikpoba-Okha Local Government Area of the state through Orhionmwon LGA, Edo State and terminates at Abraka in Delta State.\nThe road was jointly awarded by the Edo State Government and the Edo State Oil and Gas Producing Areas Development Commission (EDSOGPADEC), to Raycon Construction Company Nigeria Ltd in 2021, with the mandate to complete the road project within a specified period of four years.\nEnabulele Ferguson, while speaking to journalists during the inspection of the asphalting of 5km road, for the first phase of the total of 105.6km Benin-Abraka Road, expressed satisfaction with the progress of work on the road.\nHe, however, noted that despite being a federal road, the project will be completed and delivered to the people at the stipulated time, pledging to ensure its completion before 2025."
  },
  {
    "headline": "National Sports Festival: Redeem N500m pledge, Obaseki urges FG – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has called on the Federal Government to redeem the outstanding N500 million which it pledged to pay as contribution for the hosting of the last edition of the National Sports Festival (NSF), tagged Edo 2020.\nObaseki made the appeal when he received the Edo 2020 Report from the Local Organising Committee, headed by his deputy, Rt.\nThe governor, who noted that the national sports competition has ignited the spirit of sportsmanship amongst young people, said the state set a new record in the hosting of the games.\nAccording to him, “I will talk on the issue of the outstanding N500 million that the Federal Government promised to contribute to the games.\nI want to thank the team for the discipline in procurement, management of finances and accountability."
  },
  {
    "headline": "10 percent of Edo population now PDP members, says Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said about 10 percent of the state’s entire population are now members of the Peoples Democratic Party (PDP) in Edo State.\nObaseki, who disclosed this to journalists in Benin City, noted that about 500,000 persons have been registered as members of the PDP in the ongoing electronic registration and revalidation exercise across the state.\nThe 500,000 persons registered by the party represent 10 percent of the state’s entire estimated population of five million.\nWith the development, 10 percent of Edo population are now members of PDP.\nThe e-registration and revalidation exercise is aimed at migrating the party’s membership database from analogue to digital, building a durable and comprehensive database of party members."
  },
  {
    "headline": "Obaseki mourns passing of Comrade Ogbeide – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of Comrade Osarunmwense Ogbeide, who passed on January 25, 2022.\n“A kind, compassionate and loving gentleman, he was a good father, who loved deeply and warmed the hearts of friends and family around him.\n“Osarunmwense was good-natured and made sacrifices for the benefit of others, a trait which endeared him to all.\n“He will be remembered for his large heart, affable nature and commitment to his family.\n“I commiserate with the Ogbeide family, friends and associates of the deceased and pray that God will grant all the fortitude to bear this irreparable loss.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Buhari appoints Sani Zorro SSA to First Lady, redeploys Kamal Abdulrahman, Hadi Uba, Wole Aboderin, sacks Zainab Kazeem",
    "summarized_story": "Those affected by the redeployment are: Dr. Mohammed Kamal Abdulrahman, Senior Special Assistant to the President on Health and Development Partners and Personal Physician to the First Lady; Hadi Uba, Special Assistant to the President on Administration and Wole Aboderin, Special Assistant to the President on Non-Governmental Organisations, NGOs.\nAlso approved with effect from 11th February is the disengagement of Zainab Kazeem, the Special Assistant to the President on Domestic and Social Events, Office of the First Lady.\nZorro, a famous journalist brings to the new job decades-long experience in media practice, publishing and unionist leadership.\nHe was at various times President, Nigeria Union of Journalists, NUJ, West African Journalists Association (WAJA) and the Federation of African Journalists, FAJ.\nHe was in the House of Representatives where he chaired the committee on Internally Displaced Persons (IDPs), Refugees and Initiatives on North East."
  },
  {
    "headline": "Climate change threat to food security in Nigeria – Dare",
    "summarized_story": "Nigeria’s minister of youth sports, Mr. Sunday Dare, has called on Nigerians to take issues of climate change seriously to tackle food insecurity and imbalances in the planet’s ecosystem.\nHe noted that climate change represents a threat to food security in the country.\n“Nigeria is not immune from the adverse effects of climate change.\nClimate change is increasingly threatening Nigeria’s ecosystem, with increasing desertification in the north, erosion in the east, ocean surge in places like Lagos, among others.\nA Nigerian born, British activist, Emeka Obasi Jnr, is leading an awareness campaign in this regard, through his NGO, Our Tomorrow."
  },
  {
    "headline": "Bamidele Adeleke Felicitates Timi Of Ede on Birthday",
    "summarized_story": "By Sunday Oguntuyi, OsogboA People’s Democratic Party, PDP, aspirant in the coming 2022 governorship election in Osun state, Mr. Bamidele David Adeleke has joined millions of the well wishers in felicitating with Timi of Ede, Oba Munirudeen Adesola Lawal (Laminisa 1) on the occasion of his Birthday.\nMr. Bamidele Adeleke, in a statement issued on Friday described the monarch as an embodiment of royalty and objectivity, full of wisdom and a renowned custodian of the traditional institution.\nHe said: “Having the privilege of being alive and well to celebrate another year of God’s faithfulness is not an easy feat especially in this clime where life expectancy is reducing almost daily, but God in His infinite mercies have kept you to this day.\n“Baba as you celebrate, it is my fervent prayer that God Almighty would continue to bestow on you long life and wisdom to serve the people of Ede land in particular, Osun State and indeed Nigerians at large.”"
  },
  {
    "headline": "Atiku will soon declare for president – Adviser",
    "summarized_story": "Nigeria’s former vice president, Atiku Abubakar, will present himself for consideration as president in the 2023 election, the Director General of the Amalgamated Atiku Support Groups (AASG), Hon Oladimeji Fabiyi has said.\n“I would like to make it abundantly clear that the AASG which has the records of hundreds of credible and authenticated Atiku support groups nationwide and in the Diaspora does not know of such amorphous groups.\nFor the avoidance of doubt, Atiku Abubakar is eminently qualified under the constitution of Nigeria to contest for any office in the land.\nAlready our intelligence has exposed the plot of these enemies of democracy to malign and discredit Atiku Abubakar in order to advance their narrow interests.\nFor Atiku and his supporters it’s about the real issues, it’s about discourse on how to move Nigeria forward not about their shenanigans and inordinate ambition."
  },
  {
    "headline": "FCT Elections: Voters Lament Malfunctioning Of BVVAS In Abaji",
    "summarized_story": "Voters at Anguwar Manko polling unit 002 of Abaji Area Council, on Saturday, complained of a slow voting process due to the malfunctioning of the Bimodal Voters Verification Accreditation System (BVVAS) deployed by the Independent National Electoral Commission (INEC).\nThe voters, who spoke with our correspondent, complained that the device was taking between 10 to 15 minutes to capture fingerprints of a single voter.\nHanatu Shehu, one of the voters, complained that she had been waiting for more than 30 minutes, as the BVVAS has failed to capture her fingerprints despite repeated trials.\nA councillorship candidate in the area, Abdulrahman Saidu, also complained over the slow pace of capturing voters’ fingerprints by BVVAS, while calling on INEC to urgently provide the polling unit with another device.\nADVERTISEMENTMost of the voters at Anguwar Liman polling unit 009 in the area, also complained of malfunctioning of BVVAS."
  },
  {
    "headline": "FCT Polls: Abaji Witnesses Large Voter Turnout",
    "summarized_story": "Polling units in Abaji Area Council witnessed a large turnout of voters in the ongoing Area Council elections in the Federal Capital Territory (FCT) on Saturday.\nIn the Alhassan Wanzan polling unit in Abaji, accreditation of voters started as early as 8am, as they turned out in large numbers.\nThe chairman of the Area Council, Alhaji Abdulrahman Ajiha, commended the large turnout of voters and the peaceful conduct of the electorate.\nAlso, polling unit 009 and Yaba polling unit recorded a large turnout of voters.\nAccreditation started at about 9am, while voting started at about 10.35am the units."
  },
  {
    "headline": "Tackling Menace Of Out-of-school Children, IDPs Via Educational Support",
    "summarized_story": "Truth be told, the current challenges affecting the educational system in the country have left much to be desired.\nAccording to a survey conducted by the United Nations Children’s Fund (UNICEF) indicates that the population of out-of-school children in Nigeria has risen from 10.5 million to 13.2 million, the highest in the world.\nSome state governments in Nigeria in tackling the menace have introduced free education in both primary and secondary schools to encourage more pupils and students to access basic education.\nADVERTISEMENTFor other children, it is extreme poverty and lack of institutional support from stakeholders which has over time denied them of achieving basic education.\nQuoting the 2018 UNICEF survey she said the survey showed that the population of out-of-school children in Nigeria had risen from 10.5 million to 13.2 million, a figure she described as alarming."
  },
  {
    "headline": "Why We Reject Zoning Of APC Chairmanship Seat – Tsafe",
    "summarized_story": "What is the selling unique point of Yari going into this contest?\nBut that expression about Yari came because of the way he led the governors of 36 states.\nYari led them well such that he became the longest serving chairman of the governors’ forum.\nAs far as I’m concern Yari, is a good party manager.\nSo, as far as I’m concerned, he is a very good party manager because we won all our elections."
  },
  {
    "headline": "FCT Elections: 2 Hours After, No Single Voter In Kubwa Polling Unit",
    "summarized_story": "Two hours after the commencement of voting at the Liberty Junction polling unit in Kubwa, Bwari Area Council, no single voter has shown up for the exercise.\nAccording to one of the presiding officers at the polling unit, they have been around since 8am and no voter has turned up.\nLEADERSHIP observes that residents in the area were seen going about their normal business.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Nigerian Military Kills 20 Terrorists Planning To Attack Defence Academy",
    "summarized_story": "The personnel of Operation Thunder Strike, a Nigerian Air Force organization, have killed no less than 20 terrorists.\nFollowing a tip that the terrorists planned to target the Nigerian Defence Academy in Kaduna, Afaka, security forces started an offensive against them.\nIn August 2021, militants attacked the Nigerian Defence Academy’s Afaka Barracks in Kaduna State, killing a navy officer.\nA part of the report said, “On sighting the aircraft, the bandits started fleeing into the fringes of the forest.\n“Also, their plans of harassing and shaming the Nigerian Defence Academy and the Government of the day was effectively thwarted.”"
  },
  {
    "headline": "Strike: ASUU Commences Two-day Meeting, Takes Final Decision On Sunday",
    "summarized_story": "The Academic Staff Union of Universities’ National Executive Committee will meet for two days at the University of Lagos, Akoka, on Saturday to finalize the union’s decision on an upcoming strike.\nAccording to PUNCH, members of the ASUU NEC will make the ultimate decision on the strike – which will be reached by voting – at the end of the meeting on Sunday.\nOn November 15, 2021, ASUU issued a three-week ultimatum to the Federal Government for failure to meet the demands.\nThe ASUU NEC will convene at UNILAG from February 12 (today) to February 13 to make a final decision on the approaching strike.\nHaruna made this appeal in a statement on Friday, following recent threats of a fresh strike by many branches of ASUU."
  },
  {
    "headline": "How Uduak Akpan Violated, Murdered Akwa Ibom Jobseeker, Iniubong Umoren — DSS",
    "summarized_story": "Ama Okeke, an official with the Akwa Ibom State Command of the Department of Security Services (DSS), testified before the State High Court in Uyo about the murder of Iniubong Umoren, a job seeker.\nThe 10th Prosecution Witness (PW10), a DSS officer, said in court that the first accused, Uduak Akpan, stuffed the deceased’s mouth with black material to keep her from screaming.\nHe testified that the first accused person (Uduak-Abasi Akpan) had a communication with the late Iniubong Umoren throughout the course of their investigation.\nHe told the court, “My Lord, the first accused person (Uduak-Abasi Akpan) told our investigation team that Iniubong Umoren refused to have sex with him and struggled with him.\nHe also told us that even when he overpowered the deceased, she told him that she will allow him only if he used a condom."
  },
  {
    "headline": "Hushppupi: Police Ordered To Conclude Investigation On Abba Kyari In Two Weeks",
    "summarized_story": "“Kyari had earlier been indicted by a Report of the Federal Bureau of Investigation (FBI) of the United States and was also investigated by a special Panel set up by the Inspector General of Police.\n“The Report had earlier been forwarded to the Attorney General of the Federation and Minister of Justice for legal advice by the Inspector General of Police.\n“The Commission also directed that further necessary investigation should take half the time it took the Police to conduct the original investigation and that the investigation should be carried out by a different panel.\n“The Commission at the Plenary Meeting also considered 20 Pending Disciplinary Matters and five appeals and petitions from the Inspector General of Police and aggrieved serving and ex-Police Officers.\nIt directed the Inspector General of Police to implement its decision as its affects the Officer without delay…”"
  },
  {
    "headline": "PICTURES: Incumbent AMAC chairman, Candido, votes, tells residents what to do in FCT council election",
    "summarized_story": "Abdullahi Adamu Candido, Saturday, at polling unit 002, Jiwa Ward, voted for the All Progressives Congress (APC) in the FCT council election.\nCandido, who lamented the supreme court ruling that affected his preferred candidate, Alhassan Suleiman Gwagwa (Gwagwa), advised voters at the ward to vote for their preferred candidates.\n“I advise voters to be calm and vote for their preferred candidates or party of their choices, according to their consciences.\nVote for your preferred candidates for true service to be consolidated so that people can take up from where we stopped.\nThough the supreme court ruling affected many things, we are consoled by the fact that APC has what it takes to win the election."
  },
  {
    "headline": "#Live VIDEO: Follow latest updates on FCT council election as many voters hit polling units in Karshi, Gwagwalada",
    "summarized_story": "11.10amIn Kashi, a suburb of the Federal Capital Territory (FCT), hundreds of voters have trooped out to vote with officials of the Independent National Electoral Commission (INEC) experiencing busy time at various polling units.\nAccreditation and voting have commenced.\nPU 008, 018, 040, 041, 042 Kantangura Housing Estate, Gwagwalada….\nMassive turnout of voters @ 10:51am"
  },
  {
    "headline": "Breaking: Again, Nigerian fails to win Lagos city marathon",
    "summarized_story": "The much-talked about 2022 Lagos City Marathon has ended with an Ethiopian, Geleta Deresa Ulfata, emerging victorious.\nGeleta finished the race in 2 hours 11 minutes and 54 seconds.\nThe Ethiopian will smile home with $30,000 prize money.\nDetails loading…"
  },
  {
    "headline": "Area Council Elections Hold In FCT",
    "summarized_story": "Area councils where the exercise is taking place are Abaji, Bwari, Gwagwalada, Kuje, Kwali, and Abuja Municipal Area Council (AMAC).\nIt is the only council poll conducted by the electoral umpire and 473 candidates from 14 political parties are expected to contest in the polls.\nElections In Kuje, BwariIn Kuje Area Council, the Channels Television crew covering the exercise observed that voters arrived early at most of the polling units.\nJust like the situation in Kuje, residents in Bwari Area Council turned out to vote for candidates of their choice as the exercise continued.\nINEC ReadyDays before the elections, INEC Chairman, Professor Mahmood Yakubu, told stakeholders at a meeting that the electoral umpire was prepared to conduct the exercise."
  },
  {
    "headline": "‘Russia Could Invade Ukraine Any Day,’ US Warns",
    "summarized_story": "Russian President Vladimir Putin is set to speak with his US and French counterparts on Saturday after the United States warned that Moscow could invade Ukraine in days.\nIn a diplomatic flurry to head off a possible invasion, Putin will speak with Joe Biden and Emmanuel Macron on Saturday.\n“If Russia is genuinely interested in resolving this crisis of its own making through diplomacy and dialogue, we’re prepared to do that,” he said.\nA US official said Biden would speak with Putin on Saturday, while Paris said Macron would also be calling the Russian leader on Saturday.\nUnderlining the bleak outlook, a string of countries joined the exodus of diplomats and citizens from Ukraine, while oil prices surged and US equities tumbled."
  },
  {
    "headline": "Residents Flee As Terrorists Attack Zamfara Community, Kill Six",
    "summarized_story": "Six persons have been reportedly killed following a fresh attack by suspected terrorists at Rogoji community in Bakura Local Government Area of Zamfara State.\nRogoji community is about two kilometers to Bakura town, headquarters of Bakura Local Government.\n“They invaded the Rogoji community about 11pm on Thursday, they came to the community on motorcycles in large numbers with sophisticated weapons, shooting to scare the people away,” the witness said.\nThe eyewitness further stated that the suspected terrorists have displaced many within Bakura town where individuals are currently seeking refuge and might not return to their community soon for fear that the terrorists might return to launch another attack.\nAbdullahi said the military responded promptly to repel the attack though when they got into the community the terrorists had already left."
  },
  {
    "headline": "Abba Kyari: PSC Postpones Decision, Insists On New Panel To Conduct Fresh Investigation",
    "summarized_story": "The PSC is also insisting that a new panel be set up to conduct a fresh investigation into the matter.\nREAD ALSO: Nigeria Collaborating With US, Extradition Of Abba Kyari Considered – AGFThe decision of the Commission comes two weeks after it rejected the report of the panel set up by the Inspector-General of Police, Usman Baba Alkali to investigate the alleged connection between Abba Kyari and Hushpuppi for lacking depth.\n“The Commission also directed that further necessary investigation should take half the time it took the Police to conduct the original investigation and that the investigation should be carried out by a different panel,” the statement said.\nMr Kyari was suspended for alleged involvement in a $1.1 million internet fraud allegedly perpetrated by Hushpuppi and four others – Abdulrahman Juma, Vincent Chibuzo, Rukayat Fashola, and Bolatito Agbabiaka.\nThe Federal Bureau of Investigation had alleged that Hushpuppi paid $20,600 to two bank accounts allegedly provided by Kyari on January 20, 2020."
  },
  {
    "headline": "Buhari Appoints Sani Zorro As Aisha’s Aide, Redeploys, Sacks Others",
    "summarized_story": "President Muhammadu Buhari has approved the appointment of Muhammad Sani Zorro, journalist, politician, and former lawmaker as the Senior Special Assistant to the President on Public Affairs and Strategy, Office of the First Lady.\nThe President also redeployed some other aides attached to the office of the First Lady with one other person sacked.\nThis was disclosed in a statement signed on Saturday by the Senior Special Assistant to the President on Media and Publicity, Garba Shehu.\nAccording to the statement, Zorro, a famous journalist brings to the new job decades-long experience in media practice, publishing, and unionist leadership.\nHe was at various times President, Nigeria Union of Journalists, NUJ, West African Journalists Association (WAJA), and the Federation of African Journalists, FAJ."
  },
  {
    "headline": "APC CECPC Notifies National Convention of Proposed Amendments to Constitution -",
    "summarized_story": "In accordance with Article 30 (iii) of the All Progressives Congress (APC) Constititution, the Governor Mai Mala Buni-chaired Caretaker/Extraordinary Convention Planning Committee (CECPC) has served a notice of proposed amendments to the Party’s Constitution on members of the National Convention.\nArticle 30 (iii) stipulates that the notice is served at least fourteen (14) days before the date of the National Convention at which the proposed amendments is to be considered.\nAdvertisementAPC Constitution 2014 has been in effect for almost eight years and together with judgments from Courts of competent jurisdiction, administrative experiences have revealed flaws in the Constitution.\nIt became imperative to conduct a review of the Party’s Constitution.\nThe Caretaker/Extraordinary Convention Planning Committee established a Constitution Review Committee under the chairmanship of Prof. Tahir Mamman OON, SAN to thoroughly review the Constitution in accordance with Article 30 which provides for Constitutional amendments."
  },
  {
    "headline": "FCT Council Polls: Ortom vows to resist any form of rigging",
    "summarized_story": "The Benue State Governor Samuel Ortom has vowed to resist any form of rigging or manipulation in Saturday’s Abuja territory elections.\nAdvertisementLast minute preparation for Saturday’s Abuja territory elections necessitated this gathering of critical stakeholders of the country’s main opposition party at the instance of the campaign council Chairman.\nHe quickly goes into the business of the day by setting the tone for the closed door session.\nAdvertisementAccording to him the ruling party has made their job pretty simple by its abysmal performance.\nThe meeting was attended by Governor’s of Benue ,Oyo, Bauchi and Rivers State as well as Senators, former Governor’s, former Senators and other party leaders."
  },
  {
    "headline": "Zamfara Assembly orders Chief judge to set up panel to investigate deputy Gov. -",
    "summarized_story": "The Zamfara State House of Assembly has directed the state Chief Justice to set up investigative panel on the alleged gross misconduct leveled against the state Deputy Governor Mahdi Aliyu Gusau.\nThe House during it’s 120 Plenary unanimously agreed that the Deputy Governor be investigated for breaching Sections 190 and 193 (1), (2) (a)(b)(c) of the Constitution of the Federal Republic of Nigeria.\nAdvertisementThis Development is coming barely twenty four hours after the House served all members with Notice of Impeachment of the Deputy GovernorEighteen out of the twenty two members of the House voted for in favour of the motionAdvertisementThe only PDP Lawmaker representing Zurmi East Salihu Usman was also not present at the plenaryThe Zamfara assembly is accusing the deputy of abuse of office, saying he has breached sections 190 and 193 (1), (2) (a)(b)(c) of the ConstitutionAdvertisementThe Zamfara State House of Assembly had on Monday through the Secretary to the state government served the deputy Governor an impeachment noticeA federal high court in Abuja had in November last year restrained the Zamfara Assembly from any move to impeach the deputy GovernorAdvertisementThe crisis between the Zamfara Assembly and deputy Governor started a few weeks after the formal Defection of Governor Bello Matawalle from the People’s Democratic Party to the ruling APC.\nAdvertisement"
  },
  {
    "headline": "Bagudu swears-in 21 LG chairmen, asks them to develop grassroot potential -",
    "summarized_story": "The newly elected chairmen and vice chairmen of the twenty one local government areas of Kebbi state have been advised to pay attention to the economic potential and other opportunities in their various domain.\nKebbi state governor, Atiku Bagudu gave the advised shortly after the elected council officials took their oath of office at a ceremony held at Birnin Kebbi.\nAdvertisementHe says the council executives should also be interested in how those economic potential can be developed and explore for the benefit of the nation and their immediate environment.\nThe governor said, with the oath of office administered on them, partisanship should be kept aside and work for the entirety of the people of the local government irrespective of political party affiliation.\nAdvertisementThe twenty one council chairmen and their vice chairmen are all of the All Progressives Congress APC and sixteen of the twenty and fifty five councillors elected across the twenty one.local government, sixteen of them are women."
  },
  {
    "headline": "Canadian Judge Orders an End to Blockade at Border Bridge",
    "summarized_story": "A judge on Friday ordered protesters at the Ambassador Bridge over the U.S.-Canadian border to end the 5-day-old blockade that has disrupted the flow of goods between the two countries and forced the auto industry on both sides to roll back production.\nWindsor police immediately warned that anyone blocking the streets could be subject to arrest and their vehicles may be seized.\nSince Monday, drivers mostly in pickup trucks have bottled up the bridge connecting Windsor to Detroit.\n“This unlawful activity has to end and it will end,” Trudeau warned just hours earlier.\n“We discussed the American and indeed global influences on the protest,” Trudeau said."
  },
  {
    "headline": "US: In Reversal, FDA Puts Brakes on Covid shots for Kids under 5",
    "summarized_story": "“I think they made the right decision to be careful and wait for the third-dose data,” said Dr. Jesse Goodman of Georgetown University, a former FDA vaccine chief.\nPreliminary study results showed two shots were safe and strong enough to give good protection to babies as young as 6 months.\nSo it was a surprise when a few weeks ago, FDA urged Pfizer and its partner BioNTech to go ahead and apply.\nFriday, the FDA abruptly canceled that meeting, promising to hold it once Pfizer submits the third-dose evidence.\nHow long to wait for new vaccine data — and how much to require — is a difficult balancing act for the FDA."
  },
  {
    "headline": "US to Evacuate Ukraine Embassy Amid Russian Invasion Fears",
    "summarized_story": "The United States is set to evacuate its embassy in Kyiv as Western intelligence officials warn that a Russian invasion of Ukraine is increasingly imminent.\nU.S. officials said the State Department plans to announce early Saturday that virtually all American staff at the Kyiv embassy will be required to leave ahead of a feared Russian invasion.\nThe new move comes as Washington has ratcheted up its warnings about a possible Russian invasion of Ukraine.\nSullivan said Russian President Vladimir Putin could give the order to launch an invasion of Ukraine any day now.\nThe American troops are to train with host-nation forces but not enter Ukraine for any purpose."
  },
  {
    "headline": "Hushpuppi: Police Commission Gives 2-Week Ultimatum for Fresh Probe of Suspended Cop Abba Kyari – Arise News",
    "summarized_story": "The commission also ordered the Inspector-General of Police, Usman Baba, to constitute a new panel to undertake the probe and submit the report in two weeks.\nKyari was indicted by the Federal Bureau of Investigation (FBI) of the United States for alleged involvement with an internet fraudster, Ramon Olorunwa Abbas, popularly known as Hussipuppi.\nA statement by the commission on Friday said it deferred decision on the case involving Kyari, pending the new probe.\nA US District Court had, following an FBI investigation, indicted Kyari and six others.\nThe Police Service Commission suspended Kyari as a result of the allegations."
  },
  {
    "headline": "Nigeria: APC to Determine Presidential Candidate By Consensus, Says Borno Governor Zulum",
    "summarized_story": "He emphasised that Borno State will work with the party’s hierarchy, members of the National Assembly, and leaders at ward and state levels to ensure actualisation of decisions to be made by Buhari who is the party’s leader.\n“Individual aspirations may have to be downplayed because we all have to concur with the decision of the leader of our party.\nZulum emphasised his humble beginnings as a village boy, adding that his major priority is seeing how the people of Borno State would do well within a flourishing economic climate that is achievable in Nigeria.\nSome of those on the PCG entourage to Borno State were its Deputy Chairman (North), Mr. Musa Liman Kwande; its Deputy Chairman (South), Dr. Ebenezer Faji; and former Managing Director of African Petroleum Plc, Shettima Abba-Gana who was a former commissioner in Borno State.\nOthers were the PCG Women Leader, Hajia Rabi Dauda; Barrister Emmanuel Pippa (Publicity Secretary); and Mr. Jeff O. Ozomegwa, the Deputy Secretary-General."
  }
]