[
  {
    "headline": "Kano govt to review teachers’ retirement age",
    "summarized_story": "Kano State Executive Council has approved plans for review and harmonisation of retirement age for teachers effective January 2022 with a committee to draft the documents for actualisation of the exercise.\nThis is contained in a statement signed by the State Commissioner for Information, Mr Muhammed Garba, and made available on Sunday.\nThe statement explained that the exercise would require an increase in salaries and other emoluments of teachers not provided for in the 2021 budget.\nAccording to him, the committee will also review the scheme and condition of service of teachers to accommodate the new retirement age.\nWith the new proposal, teachers’ retirement age will increase from 35 service years and 60 years of age to 40 years of service and 65 years of age respectively."
  },
  {
    "headline": "INEC trains 1322 ad-hoc staff for FCT council poll",
    "summarized_story": "The Independent National Electoral Commission says a total of 1322 ad-hoc staff have been trained in readiness for elections in the Kuje Council of the Federal Capital Territory.\nThe INEC Electoral Officer, Mrs Zainab Gbefwi, disclosed this in an interview with NAN in Kuje, after the training exercise that lasted for three days in the area.\nGbefwi said the exercise was without any challenge, adding that the commission was prepared for the February 12 elections in the six area councils of the FCT.\nThe electoral officers said participants in the exercise included presiding officers, assistant presiding officers, and corps members.\nHowever, she urged all candidates, supporters, and electorate to ensure they observed COVID-19 safety protocols at polling units at the elections."
  },
  {
    "headline": "FPSO Explosion: 3 rescued alive, 1 unidentified body found ― Official",
    "summarized_story": "The management also said that a dead body was recovered from the vicinity, although the identity is yet to be established.\nSEPCOL gave the update in a statement signed by its Chief Executive Officer, Mr. Ikemefuna Okafor, and made available to newsmen on Sunday.\n“We can confirm that three (3) crew members have been found alive in the community and our priority is to ensure that they receive the appropriate medical attention they need.\nFurthermore, in the early hours of Sunday 6th February 2022, one dead body was discovered in the vicinity of the FPSO.\n“A Joint Investigation Visit (JIV) with the relevant authorities, stakeholders, and expert organisations took place on Saturday, 5th February 2022."
  },
  {
    "headline": "Breaking: FPSO Explosion: 3 rescued alive, 1 unidentified body found – Official",
    "summarized_story": "The management also said that a dead body was recovered from the vicinity, although the identity is yet to be established.\nSEPCOL gave the update in a statement signed by its Chief Executive Officer, Mr. Ikemefuna Okafor, and made available to newsmen on Sunday.\n“We can confirm that three (3) crew members have been found alive in the community and our priority is to ensure that they receive the appropriate medical attention they need.\nFurthermore, in the early hours of Sunday 6th February 2022, one dead body was discovered in the vicinity of the FPSO.\n“A Joint Investigation Visit (JIV) with the relevant authorities, stakeholders, and expert organisations took place on Saturday, 5th February 2022."
  },
  {
    "headline": "SERAP to Buhari: Rescind NIN-SIM access to subscribers’ details approval",
    "summarized_story": "By Olasunkanmi AkoniSocio-Economic Rights and Accountability Project, SERAP, has urged President Muhammadu Buhari to urgently review and rescind his reported approval for security agencies to access subscribers’ personal details via NIN-SIM linkage without due process of law.\nSERAP made the request in a letter to President Buhari, dated February 5, 2022, by SERAP Deputy Director, Kolawole Oluwadare and made available to Vanguard on Sunday.\nAlso Read:SERAP’s letter followed reports that some security agencies have received presidential approval to access people’s personal details via the database of the National Identity Management Commission in the course of carrying out their duties.\n“The interference entailed by unlawfully or arbitrarily accessing people’s personal details is far-reaching and must be considered to be particularly serious.\n“According to reports, some security agencies have received your approval to access people’s personal details via the database of the National Identity Management Commission in the course of carrying out their duties."
  },
  {
    "headline": "Group Flay’s Femi Adesina’s commentary on Buhari and NDDC",
    "summarized_story": "The audit was done, and a report submitted.”The truth is that nobody was against the conduct of a forensic audit in the NDDC.\nThe issue was that everybody agreed that the NDDC Act should be complied with in the Governance of the Commission during the period of the forensic audit.\nHowever the President is yet to fulfil his promise – the NDDC Board is yet to be inaugurated.\nInauguration of the NDDC Governing Board in line with the NDDC Act to represent the nine constituent states.\nChief Tonye Ogbogbula, National President, Niger Delta Elders’ Forum"
  },
  {
    "headline": "Breaking: Emir of Jama’are dies, leaves behind two wives, 35 children",
    "summarized_story": "By Charly Agwam – BauchiThe Emir of Jama’are Alhaji Ahmad Muhammadu Wabi III has died after a brief illness, Vanguard has learned.\nThe Emir was said to have died at about 12 midnight on Sunday after 50 years of reign, leaving behind two wives and 35 children.\nDisclosing the death of the Emir, Gadodamasun Jama’are, Alhaji Salleh Malla said the late ruler will be sorely missed.\nBauchi State Government is expected to announce the details of the burial arrangement."
  },
  {
    "headline": "Insecurity: 82 Division GOC, Lagbaja charges troops on loyalty, vigilance",
    "summarized_story": "The General Officer Commanding (GOC) 82 Division of Nigerian Army, Major General T.A.\nThe GOC also emphasized the need for Nigerian soldiers to be loyal to the Federal Government, warning seriously against any act of indiscipline.\n“I urge you strongly to be vigilant against elements out to destabilize the barracks and the country.\nI commend NAOWA for keeping the home fronts while our troops engage in different theatres of conflicts in parts of the country,” he stated.\nDuring the WASA events, personnel from different units of the Brigade adjudged to have performed exceptionally were recognised and appreciated."
  },
  {
    "headline": "Real reason I turbaned Amaechi – Emir of Daura",
    "summarized_story": "Alhaji Faruk Umar, Emir of Daura, on Saturday, said he appointed Rotimi Amaechi, the Minister of Transportation, as Dan Amanar Daura (Trusted son of Daura) in his palace for his “dedication to the development of his emirate and Nigeria”.\nFaruk said he did not turban Amaechi “because the minister gave him money but to reciprocate the minister’s gesture to the emirate.”The Emir said people like Amaechi deserved a traditional title in the Emirate “because they have proven reliable”.\n“We are Muslims and our religion allows us to respect those who respect us.\n“You are living witnesses that we have turbaned a lot of people in this country and even beyond.\nYou know that we don’t do what we do for monetary gain,” the monarch said while conferring on Amechi, Dan Amanar Daura, in his palace at Daura, Katsina State on Saturday."
  },
  {
    "headline": "Emir of Jama’are, Muhammadu Wabi is dead",
    "summarized_story": "The Emir of Jama’are in Bauchi State, Alhaji Muhammadu Wabi III is dead.\nThe Chairman, Jama’are Local Government Council, Alhaji Sama’ila Yusuf-Jarma, confirmed Wabi’s death to NAN on Sunday in Bauchi.\nYusuf-Jarma said that Wabi died at the age of 92, at about 12:15 a.m. on Sunday morning at Aminu Kano Teaching Hospital after a ‘protracted illness.’Wabi was installed emir in 1970 following the death of his father Muhammadu Wabi II.\nThe late emir is survived by four wives, 35 children and many grandchildren.\nThe remains of Wabi would be laid to rest today at 2:00 p.m. in Jama’are town."
  },
  {
    "headline": "Almost all miracles by men of God on TV, crusades are staged, manipulated – Catholic Priest",
    "summarized_story": "A Nigerian Catholic Priest, Kelvin Ugwu, has faulted most miracles performed on television and during crusades by men of God.\nUgwu said men of God stage almost all the miracles on television and crusades.\nThe Malawian-based Nigerian Priest accused men of God of psychologically manipulating the people.\nIn a Facebook post, the Priest urged people to always subject miracles to a third-person investigation.\n“Almost all the so-called miracles you see on TV or crusades are staged."
  },
  {
    "headline": "Ex-Rector, Federal Polytechnic Ede sues successor over assassination allegations",
    "summarized_story": "A former Rector of the Federal Polytechnic, Ede, Osun State, Builder Patrick Hussain has dragged his successor, Dr John Taiwo Adekolawole to court over alleged false and malicious accusation.\nCrisis erupted between the two academics when Dr John Taiwo Adekolawole, the Rector of the Federal Polytechnic, Ede alleged that the former Rector, Builder Patrick Hussain supplied guns in the assassination attempt on three officers of the institution.\nThe former Rector, in a Writ of Summon, number HED/05/2022 also claimed the sum of twenty six million and five hundred thousand Naira as special and general damage against Dr John Taiwo Adekolawole.\nHe also averred that the current Rector had constantly subjected his person to ridicule and public odium.\nReacting, the Rector, Adekolawole stated that he and Hussain have been friends for long and that there was no dispute between them."
  },
  {
    "headline": "FPSO fire: Three crew members alive, seven missing – SEPCOL",
    "summarized_story": "Three crew members on board the Trinity Spirit Floating Production, Storage and Offloading vessel gutted by fire at the Ukpokiti Terminal last Wednesday have been confirmed alive.\nThough a yet-to-be identified body was discovered close to the offshore facility in the wee hours of Sunday, the seven others remain missing.\nThe management of Shebah Exploration & Production Company Limited (SEPCOL) (in receivership) confirmed the development in a statement on Sunday.\n“Furthermore, in the early hours of Sunday 6th February 2022, one dead body was discovered in the vicinity of the FPSO.\n“The focus of our joint efforts is to prioritise investigations towards establishing the whereabouts, safety, and security of the 7 crew members still missing, clean up and limit damage to the environment, and establish the cause of the explosion."
  },
  {
    "headline": "Akeredolu calls for partnership in education development",
    "summarized_story": "Akeredolu said this while speaking at the 60th Anniversary of Akoko Anglican Grammar School (AKOGRAMS), Arigidi Akoko, in Akoko North East Local Government Area (LGA) of the state on Saturday.\nAccording to him, partnership for educational development is crucial because government alone cannot fund and develop the sector effectively.\nHe urged the old students to continue to contribute immensely to their alma mater in the area of Infrastructural development.\n- Advertisement -Akeredolu added that his administration deeply appreciates massive interventions of philanthropists, old students as well as non-governmental organizations in the development of schools across the 18 council areas of the state.\nAkeredolu said his administration is fully committed to tackling infrastructural deficit in the state, adding that the education sector requires huge financial obligations before any significant impact could be felt."
  },
  {
    "headline": "Constitution amendment: NASS splits Minister of Justice from AGF",
    "summarized_story": "The Nation learnt on good authority in Abuja yesterday that the joint committee similarly proposed that independent candidates be allowed to contest elective posts.\nA source, who was privy to the deliberation at the session, said: “The National Assembly Constitution Review Committee opted to separate the Office of the Minister of Justice from the Attorney-General of the Federation because the present structure is being politicised.\nA member of the House of Representatives Committee on Constitution Review said: “All these are proposals by the Joint Committee.\nThe two chambers would have to ratify before we pass the amendments to the State Houses of Assembly.\n“Going by Section 9(2 and 3) of the 1999 Constitution, the Joint Committee, the National Assembly cannot alter the 1999 Constitution without the backing of the State Houses of Assembly."
  },
  {
    "headline": "Kanu told me he didn’t issue Monday sit-at-home order —Abaribe",
    "summarized_story": "We don’t know who is enforcing it neither does it seem like we have a way to solve it.\n“I went with Ike Ekweremadu and two bishops to the DSS to see Nnamdi Kanu and he told us ‘I have never said people should sit at home’.\nHe said, “We want to turn the Southeast into the Catalonia of Spain, the biggest industrial area in that country.\nThey still become the industrial hub of that place so that at the end, even if you are going anywhere, you are going to become a viable country.\nBavaria is the industrial hub of Germany today."
  },
  {
    "headline": "APC: Fresh dust in Enugu, Rivers, Ogun, Abia, others over inauguration of state chairmen",
    "summarized_story": "An example is Enugu State where Dr. Ben Nwoye is laying claim to the position of state chairman against Chief Ugochukwu Agballah who returned to a tumultuous reception in Enugu from Abuja.\nSince there was no ward congress in Rivers, there can’t be a valid state congress for the state.\nThe situation in Abia State has taken a turn for the worse following the recognition of Dr. Kingsley Ononogbu as state chairman.\nHowever, speaking with journalists in Enugu, Nwoye dismissed the claim made by Agballah, insisting that nobody was sworn in on Thursday in Abuja as Enugu State Chairman.\nI can tell you that within the next 10 days, the oath of office will be administered on the state chairmen."
  },
  {
    "headline": "Commandant applauds Army for EXERCISE STILL WATERS",
    "summarized_story": "The Commandant of the Nigeria Armed Forces Resettlement Centre (NAFRC), AVM Idi Lubo, has commended the Nigerian Army in Lagos on the conduct of ‘Exercise STILL WATERS, explaining that the military maneuver has contributed immensely towards curtailing of criminality and other heinous activities in Lagos State in 2021.\nThe NAFRC Commandant spoke on Saturday at the 81 Division’s West Africa Social Activities (WASA) in Bonny Cantonment, in Lagos, saying that the Nigerian Army had been actively involved in the fight against all forms of insecurity.\nAir Vice Marshal Lubo said: “The climax of the successes recorded include EXERCISE STILL WATER which was conducted in Lagos State and Ogun simultaneously.\n“This is in line with the vision of the Chief of Army Staff (COAS), Lt.-Gen. Faruk Yahaya, which is to have “A Professional Nigerian Army ready to accomplish assigned missions within a joint environment in the defence of Nigeria.\n“I thank the COAS for his continued efforts in repositioning the Nigerian Army through his vision,” Fejokwu said."
  },
  {
    "headline": "2023 presidency: APC plots to dump S’East, S’West",
    "summarized_story": "From Romanus Ugwu, AbujaThere are strong indications that the All Progressives Congress (APC) may have concluded arrangements to micro-zone its 2023 presidential ticket to the South-south geopolitical zone, thereby foreclosing the possibility of the Southeast zone getting the ticket.\nThe source revealed that going by the current dynamics in the party, the South-south will likely get the ticket.\nReacting to the zoning arrangement the ruling party may opt for, the source said: “The possibility of zoning the APC presidential ticket to the Southeast is almost a forgone conclusion.\nThey also know that diminishing returns can set in if they continue to hang on to power more than necessary.\nMeanwhile, the choice of the former Nasarawa governor as the consensus candidate for the national chairmanship position ahead of other aspirants for the post has continued to generate tension and acrimony."
  },
  {
    "headline": "2023 presidency: Anxiety in PDP as Atiku, Anyim, others await zoning formula",
    "summarized_story": "From Ndubuisi Orji, AbujaAt the moment, there is unease in the Peoples Democratic Party (PDP) over the zoning of the opposition party’s 2023 presidential ticket.\nHowever, the PDP national leadership is yet to take a decision on the issue.\nNevertheless, party leaders had at different fora given conflicting opinions over the zoning of the opposition’s party presidential ticket for the next general election.\nSunday Sun gathered that the issue of zoning of the 2023 PDP presidential ticket is likely to dominate discourse at the party’s NEC, which sources said might hold within the next three weeks.\nI am sure the zoning of the presidential ticket will part of the major agenda."
  },
  {
    "headline": "PDP won’t support candidate without interest of Nigerians –Wike",
    "summarized_story": "From Tony John, Port HarcourtRivers State governor, Nyesom Wike, has said the People’s Democratic Party (PDP) will not give its presidential ticket to any candidate who will serve only the interest of the wealthy few in the country.\nThe governor said some desperate politicians were already scheming for a candidate who will not serve the interest of the many, rather the interest of just those of the wealthy few.\nAnabraba noted that Governor Wike has systematically fulfilled all promises made to them including those of development projects and appointment of Kalabari people into his administration.\nOn his part, Dumo Lulu-Briggs said the Kalabari people were expecting Governor Wike to also ensure that Kalabari people are brought out from the political wilderness in 2023.\nA human rights activist, AnnKio Briggs, noted that Rivers State, though a complex place to govern, does not mean that the people do not love each other."
  },
  {
    "headline": "Whenever I sleep, I see people screaming my name –Marytonette Okudare, singer",
    "summarized_story": "By Damilola FatunmiseFast rising star, Marytonette Awhobiwom Okudare aka Biwom is a singer cum songwriter, who hails from Calabar, Cross River State.\nBut then, I discovered music when my mom sent me away from home to go stay with my aunt.\nAny time I sleep I see people screaming my name.\nIn fact, I always wanted to do music but my parents didn’t want that for me because I was the first child.\nTeni is also one artiste I look up to because people didn’t expect her to blow the way she did."
  },
  {
    "headline": "Despite Inauguration of New APC Chairmen, Crises Persist in 13 States",
    "summarized_story": "THISDAY gathered that Wamakko has six National Assembly members, a senator, and 13 members of the state House of Assembly in his faction.\nA faction of the APC in Anambra State led by the Minister of Labour and Employment, Dr Chris Ngige, has also rejected the inauguration of Mr Basil Ejidike as the state chairman.\nThe APC had sworn in Chief Yemi Sanusi, Chairman of a faction loyal to the state Governor, Prince Dapo Abiodun.\nDeputy Chairman of the faction led by the Minister of Information and Culture, Alhaji Lai Mohammed, in Kwara State, Hon.\n“The development shows that the national leadership of APC is unserious one and when the time comes, all of them will see it."
  },
  {
    "headline": "Buhari: Nigeria will Continue to Pursue Peace, Progress Globally",
    "summarized_story": "Chinese President, Xi Jinping has also reiterated his commitment to working with African leaders towards the development of Africa.\nBuhari promised the Palestinian leader that Nigeria would be “consistent” in pushing for peace and progress while upholding the tenets of justice.\nMeanwhile, Chinese President Xi Jinping has reiterated his commitment to working with African leaders towards the development of Africa.\nHe however noted that the Eighth Ministerial Conference of the Forum on China-Africa Cooperation (FOCAC) was successfully held in November last year.\nHe recalled that he announced during the conference nine programmes for cooperation with Africa in the next three years."
  },
  {
    "headline": "Osinbajo: Shonekan Was a Man of Destiny Chosen for His Time",
    "summarized_story": "); former President Goodluck Jonathan; Secretary to the Government of the Federation, Boss Mustapha; Lagos State Governor, Babajide Sanwo-Olu; Ogun State Governor, Prince Dapo Abiodun; and Edo State Governor, Godwin Obaseki.\nBuhari said: “Chief Shonekan was a man I respect so much because of his passion for the development of Nigeria.\nNo man will offer himself as a sacrificial lamb in the manner of Chief Shonekan.\n“As a member of the Council of State, Chief Shonekan attended all meetings until his demise because of his passion to see Nigeria grow.\nHis brother, Chief Tunji Shonekan, described the deceased as a peacemaker, a family man and a core Egba man."
  },
  {
    "headline": "Power Generation Crashes By Alarming 630MW as Fire Outbreak Forces Lagos Egbin Plant to Suspend Operation",
    "summarized_story": "Peter UzohoNigeria’s daily power generation has fallen by an alarming 630 megawatts (MW) since Wednesday following a fire outbreak at Egbin Power Plant in Ikorodu, Lagos State and the resultant shut down of generation by the company.\nEgbin Power had, in a statement issued to its stakeholders and the general public yesterday, reported the fire incident at its power plant on Wednesday, February 2, 2022, at about 4.20pm, leading to blackout in Lagos State.\nEKEDC had also attributed the reduction in supply to the drop in power generation from an average of 3,700MW to 2,000MW.\nThe Disco said this was caused by gas limitations arising from vandalism and more recently an issue affecting the TCN line from the Egbin Power Plant.\n“As the foremost power plant in the nation, Egbin remains committed to providing power innovatively and responsibly in compliance with good health, safety and environmental standards,” she added."
  },
  {
    "headline": "US Identifies Bad Governance, Corruption as Motivations for Coups in Africa",
    "summarized_story": "This was disclosed by the Commander of the United States Africa Command, AFRICOM, General Stephen Townsend who while expressing surprise at the recent upsurge in spate of military coups in Africa, opined that bad governance and corruption may have been responsible for the putsches.\n“So I don’t know why all that is, but my guess is that it has to do with insufficient governance, a lack of good governance, and corruption.\nBut I think that corruption and a lack of good governance is probably behind much of that,” he explained.\nI don’t think they’re doing that, furthering that or promoting those.\nBut they also have a view to expand into Africa, particularly into West Africa and the Gulf of Guinea."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "EXCLUSIVE: Ex-Naval Director On Wanted List For N2billion Fraud, Tahir Yusuf Planning To ‘Sneak Out’ Of Nigeria Through Chad Republic",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC), is planning to flee the country, sources close to the retired military officer told SaharaReporters.\nThe anti-graft agency had accused Yusuf of stealing N2 billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nFollowing the forfeiture, SaharaReporters gathered that Yusuf fled Nigeria to Dubai, United Arab Emirate.\nHowever, Yusuf sneaked back to the country in October 2021 after he illegally obtained an international passport with the help of some corrupt government officials through the Niger Republic, a source had told SaharaReporters."
  },
  {
    "headline": "EXCLUSIVE: Ex-Naval Director On Wanted List For N2billion Fraud, Tahir Yusuf Planning To ‘Sneak Out’ Of Nigeria Through Chad Republic",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC), is planning to flee the country, sources close to the retired military officer told SaharaReporters.\nThe anti-graft agency had accused Yusuf of stealing N2 billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nFollowing the forfeiture, SaharaReporters gathered that Yusuf fled Nigeria to Dubai, United Arab Emirate.\nHowever, Yusuf sneaked back to the country in October 2021 after he illegally obtained an international passport with the help of some corrupt government officials through the Niger Republic, a source had told SaharaReporters."
  },
  {
    "headline": "Three crew members found alive after oil vessel fire incident, says SEPCOL",
    "summarized_story": "Shebah Exploration & Production Company Limited (SEPCOL) says three out of the ten crew members on board the oil vessel that exploded and sunk have been found alive.\nThe company had said ten crew members were onboard the facility when the incident occurred.\n“We can confirm that three (3) crew members have been found alive in the community and our priority is to ensure that they receive the appropriate medical attention they need.\nFurthermore, in the early hours of Sunday 6th February 2022, one dead body was discovered in the vicinity of the FPSO.\nThe oil vessel was holding about 50-60 thousand barrels of crude oil at the time of the incident, Sharon Ikeazor, minister of state for environment, had said."
  },
  {
    "headline": "Three crew members found alive after oil vessel fire incident, says SEPCOL",
    "summarized_story": "Shebah Exploration & Production Company Limited (SEPCOL) says three out of the ten crew members on board the oil vessel that exploded and sunk have been found alive.\nThe company had said ten crew members were onboard the facility when the incident occurred.\n“We can confirm that three (3) crew members have been found alive in the community and our priority is to ensure that they receive the appropriate medical attention they need.\nFurthermore, in the early hours of Sunday 6th February 2022, one dead body was discovered in the vicinity of the FPSO.\nThe oil vessel was holding about 50-60 thousand barrels of crude oil at the time of the incident, Sharon Ikeazor, minister of state for environment, had said."
  },
  {
    "headline": "EXPOSED: Inside Facebook groups offering tips on ‘yahoo yahoo’, money ritual",
    "summarized_story": "During interrogation at the Ogun state police command headquarters, Balogun said they got tips on money ritual from a Facebook group.\nAdvertisementHe said he typed ‘how to make money ritual’ on Facebook, and the result of his search instructed him to behead and burn a female skull in a local pot.\nUsing the same keywords as the suspect, TheCable found several public Facebook groups — with thousands of followers — offering tips on cybercrime and money ritual.\nThe Ifa priest said the idea of using human parts for money ritual is alien to Yoruba tradition.\nFACEBOOK ‘URGENTLY INVESTIGATING’ THE GROUPSOn February 3, 2022, TheCable reached out to Facebook to ascertain efforts taken to de-platform groups offering charms and money ritual services."
  },
  {
    "headline": "EXPOSED: Inside Facebook groups offering tips on ‘yahoo yahoo’, money ritual",
    "summarized_story": "During interrogation at the Ogun state police command headquarters, Balogun said they got tips on money ritual from a Facebook group.\nAdvertisementHe said he typed ‘how to make money ritual’ on Facebook, and the result of his search instructed him to behead and burn a female skull in a local pot.\nUsing the same keywords as the suspect, TheCable found several public Facebook groups — with thousands of followers — offering tips on cybercrime and money ritual.\nThe Ifa priest said the idea of using human parts for money ritual is alien to Yoruba tradition.\nFACEBOOK ‘URGENTLY INVESTIGATING’ THE GROUPSOn February 3, 2022, TheCable reached out to Facebook to ascertain efforts taken to de-platform groups offering charms and money ritual services."
  },
  {
    "headline": "AFCON PREVIEW: Senegal hungry for first title as Egypt seek to extend continental record",
    "summarized_story": "This is what to expect on Sunday evening as the 2021 Africa Cup of Nations (AFCON) comes down to the last two teams in Yaounde, Cameroon.\nThey are expected to make an impact at the international level — and winning their first AFCON title is the start.\nTHE LIONS’ JOURNEY TO THE FINALThe Teranga Lions had to pick a hard-earned 1-0 victory over a determined Zimbabwe side in their opening game on January 10, with Mane opening his account with a last-gasp penalty.\nFor the people of Senegal and Egypt, it will definitely be a tense day and a nerve-wracking 90 minutes.\nAt the final whistle, a winner will be crowned — but will it be the best team or that which desires it more?"
  },
  {
    "headline": "Saudi Arabia: A new home for Nigerian startups?",
    "summarized_story": "The Startup Passport initiative, which will ultimately be between the 8-member DCO countries, rolled out initially in Saudi Arabia and Nigeria.\nThis announcement implies that Nigerian startups building products that primarily serve the Middle East and North Africa (MENA) region are invited to build their companies from Saudi Arabia with support from the government.\nFaris AlSaqabi, Saudi Deputy Minister for Future Jobs and Capabilities, explained that the bond between Saudi Arabia and Nigeria is fueled by the country’s movement to a digital economy.\nNigerian Minister of Communications and Digital Economy, Isa Ali Pantami in conversation with a representative of the Digital Cooperation Organization.\nThis new program is expected to transform Saudi Arabia into a leading digital entertainment and media production hub."
  },
  {
    "headline": "TechCabal is surging ahead in 2022 and beyond 🚀",
    "summarized_story": "This year, we are hyper-focused on fine-tuning our editorial standards and establishing TechCabal as one of Africa’s most reputable technology and media publication.\nHe was a senior staff writer at TechCabal for 1 year and 8 months.\nHe was a staff writer at TechCabal for almost 2 years.\nMLIT is a flagship launched by Kay Uguwede, a former TechCabal staff writer.\nDigital Nomads was launched and exclusively written by Olumuyiwa, a former senior staff writer at TechCabal."
  },
  {
    "headline": "Detty December: New data identifies Lekki Phase 1 as Lagos’s COVID-19 hotspot",
    "summarized_story": "Adaobi* is a 24-year-old software engineer living with her 49-year-old mother Oge* at Lekki Phase 1, in Lagos, Nigeria.\nWe noticed that customers in Lekki Phase 1 that would normally order 20 packs of antimalarial drugs for sale within 3–4 days were now ordering 60–70 packs every 1–2 days,” said Okwuada.\nA sore throat is not indicative of malaria but it is one of the major symptoms of COVID-19.\nAnother resident of Lekki Phase 1 jokingly said he suspects everybody in Lekki has the virus already.\nAccording to a Reuter data, COVID-19 infections are decreasing in Nigeria, with 94 new infections reported on average each day."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "Afrobeats: “There are global moments, but the biggest opportunity is Nigeria.” — Obi Asika",
    "summarized_story": "Obi Asika, Founder of Storm 360 Records and Co-founder of Social Media Week LagosThere is no doubt that African music, especially Afrobeats — the melting pot of West African music styles blended with American Jazz — has gone global.\nThis was then fused with Western influences to create Afrobeats.\nBy the late 2000s, we had Myspace, then Facebook, followed by YouTube,” Asika noted.\nWhile Asika believes that several platforms played a significant role in making Afrobeats go global, the talents that create the music play the biggest part.\n“Once we see the Internet no longer becoming a barrier, we’re truly going to see how African music will blow up."
  },
  {
    "headline": "How changing customer attitudes will affect fintech business models in Africa",
    "summarized_story": "Nigeria alone has 144 fintech startups, per Statista.\nAn underdeveloped financial system, difficulty accessing credit, and a growing number of smartphone users present a huge opportunity for new and existing fintech players in Africa.\nAdvertisementPreparing for competitionOluwatobi Boshoro, CEO of Infinitetiks, believes that fintech startups can expect to see competition from startups on the fringes of the financial services sector.\nCurrently, most fintech startups in Africa are focused on one financial service.\nSo what does this mean for fintech startups?"
  },
  {
    "headline": "Building a sense of trust and providing insurance for more Africans",
    "summarized_story": "Today, I’m discussing:GIG Logistics’ crypto integrationLAMI’s acquisition to drive expansion in AfricaGIG Logistics’ crypto integrationRecently, the only constant for Bitcoin has been a downward spiral.\nThose who do not have an XPAD wallet can create one on GIGGO.\nDue to the traditional distribution of insurance policies by individual insurance agents, Africa has low insurance coverage.\nTo make insurance coverage available to more people in Africa on a larger scale, the company has acquired Bluewave Insurance Agency for an undisclosed sum.\nAdelaide Odhiambo, who now works as the head of commercial partnerships at Lami, founded Bluewave Insurance, another Kenyan startup."
  },
  {
    "headline": "Rising global interest rates signal costly debt for Nigeria",
    "summarized_story": "Nigeria in its proposed budget intends to borrow N2.57 trillion from international sources but the cost of the debt may be a major source of concern, considering that global interest rates are likely to rise.\nFor instance, the Bank of England last Thursday imposed back-to-back interest rate hikes for the first time since 2004, and began the process of quantitative tightening.\nFour members voted to increase rates by 50 basis points to 0.75% percent.\nThe rise in global interest rates, which may however elude the Eurozone, means Nigeria with debt service to revenue ratio of 70 percent last year would have to pay more on borrowing.\n“If global rates are rising then we must brace for higher debt service costs,” said Bismarck Rewane, an economist and CEO of Financial Derivatives Company (FDC)."
  },
  {
    "headline": "New payment system to allow naira across Africa",
    "summarized_story": "Nigerians can now use naira to buy goods and services from other African countries without the hurdle of converting to the dollar, thanks to the new African payment system – Pan-African Payment and Settlement System (PAPSS).\nThe new African payment system was officially launched on January 13, 2022, in Accra, Ghana.\nAccording to Afreximbank, PAPSS provides the solution to the disconnected and fragmented nature of payment and settlement systems that have long impeded intra-African trade.\nPrior to the introduction of the new African payment system, over 80 percent of African cross-border payment transactions originating from African banks had to be routed offshore for clearing and settlement using international banking relationships.\nThat posed multiple challenges, ranging from payment delays to operational inefficiencies and compliance concerns for the disparate regional payment systems."
  },
  {
    "headline": "Anger swirls around Buhari over Electoral Bill",
    "summarized_story": "A few days ago, opposition federal lawmakers asked President Buhari to assent to the reworked Electoral Act Amendment Bill 2022 without delay.\nBuhari refused to sign the electoral bill into law for the fifth time in December 2021.\nThe most recent transmission of the electoral bill to Buhari marks the sixth time he (Buhari) will be tasked with signing legislation aimed at reforming the country’s electoral system.\nThe amended electoral bill included strict guidelines for implementing the various primary election models.\nThe presidency issued a statement on January 31 titled ‘Transmission of the Electoral Bill 2022’ to acknowledge the transmission of the electoral bill to Buhari."
  },
  {
    "headline": "Former Edo youth rep, Uwadia, gets AU appointment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – A former member of the National Youth Parliament, Hon.\nIn a statement announcing the appointment, the Youth Envoy, AU ECOSOCC – Nigeria, Ahmed Buhari, said the appointment was based on his knowledge and wealth of experience in handling youth activities.\nHe said, “I am pleased to inform you of your appointment as the Director of Youth Affairs to the office of the Ambassador & AU Agenda 2063 Youth Envoy.\nThe appointment is based on your knowledge, wealth of experience in handling youth activities and personal qualities of hard work, honesty and absolute loyalty.\nThis appointment takes immediate effect, please.”Uwadia served as a member of the National Youth Movement representing Edo State and served as Minority Leader of the Parliament."
  },
  {
    "headline": "Voters registration: INEC meets Edo stakeholders, urges turnout for ongoing CVR exercise – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Independent National Electoral Commission (INEC) has met with stakeholders in Oredo Local Government Area of Edo State, urging eligible persons to turn out en-masse and participate in the ongoing Continuous Voters Registration (CVR) exercise.\nOsaigbovo Iyoha, who led stakeholders to the meeting, reassured the government’s support for the CVR exercise, charging INEC to increase awareness for the exercise so as to increase registration at the grassroots.\nAccording to him, “We called for this stakeholders’ meeting to discuss some challenges and also to help us serve you better and deliver quality services to the people of Oredo.\n“In the first quarter, we registered a total of 3,103 and 1,014 in the second quarter.\nTell them to register in the new polling units created by INEC so that electoral materials will be sent to such units,” he charged."
  },
  {
    "headline": "OLAYIWOLA AFOLABI UPLIFTS THE LEGAL PROFESSION – Nigerian Observer",
    "summarized_story": "For instance, he has an award scheme for honouring honest, disciplined and diligent junior staff of Edo State judiciary.\nIcons of the bench and bar have equally been honoured by Olayiwola Afolabi in one way or the other.\nIn 2018, Olayiwola Afolabi hosted the new executive members of NBA, Edo State Chapter to a dinner.\nIn 2020, Olayiwola Afolabi officially institutionalized this mentoring process with the establishment of AFOLABI ANNUAL LEGAL CLINIC AND COACHING LECTURE SERIES.\nAlso in line with his tradition of honouring icons in the judiciary, Olayiwola Afolabi has instituted Stephen Omonuwa Transparency Award."
  },
  {
    "headline": "Digital Broadcasting: Ministry of Communication and Orientation to Partner Edo State University, Uzairue – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestUZAIRUE- – Edo State Ministry of Communication and Orientation will partner with Edo State University Uzairue in raising a new set of professionals that will drive the progress that Nigeria needs in the Broadcasting industry, just as the Ministry work towards having a new digital broadcasting sector.\nAndrew Adaze Emwanta during a facility tour of the Edo state University Uzairue, Etsako West Local Government area of Edo State.\nHe disclosed that the Ministry of Communication and Orientation is working towards having a new digital broadcasting sector to be controlled by the state.\nAccording to him, “Broadcasting has gone beyond analogue and the Ministry is working towards having a new digital broadcasting sector that we as a state can control.\n“The Nigeria University Commission, NUC ranking has placed Edo University 10th best in Nigeria, 2nd best in the state and the best in the South South region."
  },
  {
    "headline": "Amaechi Turbaned as Dan Amanar Daura in Katsina",
    "summarized_story": "Mr. Rotimi Amaechi, Minister of Transportation, was on Saturday officially turbaned as the Dan Amanar Daura (the trusted one of Daura) at a ceremony held at the palace of the Emir of Daura, Umar Farouq Umar on Saturday.\nThe Daura Emir, prayed for Amaechi, whom he described as a an extraordinary individual destined to attain higher office.\nTherefore, It is binding on the Daura traditional emirate to acknowledge the kind gesture.\nAlso turbaned by Emir Faruk along with Amechi is another chieftain of the All Progressives Congress (APC), Nasiru Haladu Danu, a reputable businessman and two-time director general of his election campaigns.\nDanu was conferred with the title of “Tafida Baba” by the Daura Emir."
  },
  {
    "headline": "Ekiti 2022: Oni Not Going To APGA, Says Campaign DG",
    "summarized_story": "The former governor of Ekiti State, Chief Segun Oni has again left the opposition People’s Democratic Party (PDP).\nOni was one of the frontline PDP governorship aspirants who participated in the party’s governorship primary on January 26, 2022, but he however denied dumping the party for the All Progressives Grand Alliance (APGA).\nThere have been rumours that Oni, who is one of the aggrieved PDP aspirants, has concluded plans to dump PDP for APGA to contest for the June 18 governorship poll.\nArokodare said, “Chief Oni has left the PDP but he is not going for APGA.\nIn the next one week, we shall reveal our new platform to contest the election”."
  },
  {
    "headline": "APC Women Urge Resolution Of Crises In States",
    "summarized_story": "The Coalition of All Progressives Congress (APC) Women Groups has urged the leadership of the party to resolve lingering crises in state chapters of the party before going for its national convention, warning that it portends great danger if aggrieved members were ignored.\nThe women advised President Muhammadu Buhari to postpone the national convention of the party slated for February 26.\nThe statement came even after the leadership of party officially informed INEC about its decision to conduct its national convention.\nADVERTISEMENT“The party is yet to recover from the attendant losses from elections that were ordinarily guaranteed in Rivers and Zamfara states during the 2019 general elections.\n“As it was with Rivers and Zamfara states, there are legal implications for how the party is progressing with going into a national convention with all the issues surrounding the party."
  },
  {
    "headline": "Assets Recovery: Misrepresenting AGF Malami’s Efforts Unacceptable – CSO",
    "summarized_story": "A civil society group, the Coalition for Human Rights and Rule of Law (CHRRL) has condemned attacks on the attorney general of the federation and minister of justice, Abubakar Malami, over assetsrecovery in the country.\nThe group in a press statement signed by its president, Gabriel Agibi in Abuja said the “campaign of calumny” was ostensibly launched by agents of corruption to misrepresent Malami.\n“As stakeholders in the justice sector, we are tempted to believe that the stance of the AGF with regard to assets recovery has not gone down well with some individuals, hence the puerile attempt at blackmail and intimidation.\nADVERTISEMENT“It is an unfortunate episode in the annals of the country as to why some individuals who, for reasons best known to them, have arrogated certain powers and privileges.\nAs such, they have carried on like mini gods by blackmailing those who have put the country’s interest first."
  },
  {
    "headline": "Assets Recovery: Misrepresenting AGF Malami’s Efforts Unacceptable – CSO",
    "summarized_story": "A civil society group, the Coalition for Human Rights and Rule of Law (CHRRL) has condemned attacks on the attorney general of the federation and minister of justice, Abubakar Malami, over assetsrecovery in the country.\nThe group in a press statement signed by its president, Gabriel Agibi in Abuja said the “campaign of calumny” was ostensibly launched by agents of corruption to misrepresent Malami.\n“As stakeholders in the justice sector, we are tempted to believe that the stance of the AGF with regard to assets recovery has not gone down well with some individuals, hence the puerile attempt at blackmail and intimidation.\nADVERTISEMENT“It is an unfortunate episode in the annals of the country as to why some individuals who, for reasons best known to them, have arrogated certain powers and privileges.\nAs such, they have carried on like mini gods by blackmailing those who have put the country’s interest first."
  },
  {
    "headline": "2023: APM Passes No Confidence Vote On BoT",
    "summarized_story": "The National Executive Committee of the Allied Peoples Movement (APM) has passed a vote of no confidence on its Board of Trustees (BoT).\nThe party after its NEC meeting, presided over by the national chairman, Yusuf Manman Dantalle at the national secretariat in Abuja yesterday accused the BoT of deficiency.\nThe party also passed a vote of confidence on the national chairman, Yusuf Manman Dantalle to lead the party’s NWC.\nBanna said he remained the BoT chairman despite the vote of no confidence passed on him, adding that he could not be removed by Dantalle whom he brought to the party.\nHe said, “I am not suspended because I am a stakeholder of this party and no one can suspend me, I brought the national chairman."
  },
  {
    "headline": "IPOB alleges: Army planning to secretly execute detained Obigbo youths",
    "summarized_story": "The group said the over 500 Obigbo youths had been held in different detention facilities under inhuman conditions since two years when they were unlawfully arrested during the infamous Obigbo massacre in 2020.\nThe group, therefore, cautioned the Army and other federal agencies against secretly executing the innocent youths.\n“We, therefore, want to place the world on notice over this wicked plot by the Nigeria Army and its plots to silence these innocent Biafrans without trace.\n“It is only the authorities of the Nigeria Army that knows what that order and instruction meant, but any attempt to execute or extra-judicially kill them, they will regret their actions.\nShould anything untoward happen to these innocent Biafrans, those behind their fate will not escape judgement!"
  },
  {
    "headline": "IPOB alleges: Army planning to secretly execute detained Obigbo youths",
    "summarized_story": "The group said the over 500 Obigbo youths had been held in different detention facilities under inhuman conditions since two years when they were unlawfully arrested during the infamous Obigbo massacre in 2020.\nThe group, therefore, cautioned the Army and other federal agencies against secretly executing the innocent youths.\n“We, therefore, want to place the world on notice over this wicked plot by the Nigeria Army and its plots to silence these innocent Biafrans without trace.\n“It is only the authorities of the Nigeria Army that knows what that order and instruction meant, but any attempt to execute or extra-judicially kill them, they will regret their actions.\nShould anything untoward happen to these innocent Biafrans, those behind their fate will not escape judgement!"
  },
  {
    "headline": "Anambra: Three feared dead as two-storey building collapses in Onitsha",
    "summarized_story": "Three persons were feared dead in a building collapse in Ochanja Central Market, Onitsha, Anambra State.\nThe structure, a two-storey building, reportedly collapsed at about 5:45pm on Saturday.\nEye witnesses blamed the incident on erection of additional structure on the already weak structure, without the necessary reinforcement.\nThe traders who took their protest to Awka the State capital, appealed to Governor Willie Obiano to prevail on the market leadership to forestall any calamity.\nOne of the traders who preferred anonymity, said the yet to be identified deceased were working at the site when the incident happened."
  },
  {
    "headline": "Anambra: Three feared dead as two-storey building collapses in Onitsha",
    "summarized_story": "Three persons were feared dead in a building collapse in Ochanja Central Market, Onitsha, Anambra State.\nThe structure, a two-storey building, reportedly collapsed at about 5:45pm on Saturday.\nEye witnesses blamed the incident on erection of additional structure on the already weak structure, without the necessary reinforcement.\nThe traders who took their protest to Awka the State capital, appealed to Governor Willie Obiano to prevail on the market leadership to forestall any calamity.\nOne of the traders who preferred anonymity, said the yet to be identified deceased were working at the site when the incident happened."
  },
  {
    "headline": "Emir of Jama'are, Alhaji Muhammadu Wabi III is dead",
    "summarized_story": "By Auwalu Birnin KuduThe Emir of Jama’are in Bauchi State, Alhaji Muhammadu Wabi III has passed away after battling a protracted illness.\nAlhaji Sama’ila Yusuf-Jarma, the Chairman, of Jama’are Local Government Council, confirmed the emir’s demise on Sunday.\nAged 92, Wabi died at about 12:15 am at Aminu Kano Teaching Hospital.\nWabi was installed emir in 1970 after the death of his father Muhammadu Wabi II.\nThe remains of the late emir would be laid to rest today at 2:00 p.m. in Jama’are town."
  },
  {
    "headline": "Kano reviews teachers' retirement age",
    "summarized_story": "By Aisha AhmedKano State Executive Council has approved plans for review and harmonisation of the retirement age for teachers effective January 2022 with a committee to draft the documents for the actualisation of the exercise.\nThis is contained in a statement signed by Mr Muhammed Garba, the State Commissioner for Information, and made available on Sunday.\nThe statement explained that the exercise would require an increase in salaries and other emoluments of teachers not provided for in the 2021 budget.\nAccording to him, the committee will also review the scheme and condition of service of teachers to accommodate the new retirement age.\nWith the new proposal, teachers’ retirement age will increase from 35 service years and 60 years of age to 40 years of service and 65 years of age respectively."
  },
  {
    "headline": "BREAKING: Emir Of Jama’are Dies, Leaves Behind Two Wives, 35 Children",
    "summarized_story": "BREAKING: Emir Of Jama’are Dies, Leaves Behind Two Wives, 35 ChildrenThe Emir of Jama’are Alhaji Ahmad Muhammadu Wabi III has died after a brief illness, Vanguard has learned.\nThe Emir was said to have died at about 12 midnight on Sunday after 50 years of reign, leaving behind two wives and 35 children.\nDisclosing the death of the Emir, Gadodamasun Jama’are, Alhaji Salleh Malla said the late ruler will be sorely missed.\nBauchi State Government is expected to announce the details of the burial arrangement any moment from now.\nMore details shortly…"
  },
  {
    "headline": "2023 Election: I See Bomb Blasts, Coup – Primate Ayodele Releases Fresh Prophecies",
    "summarized_story": "In a statement signed by his media aide, Osho Oluwatosin, Primate Ayodele gave spiritual warnings to these African countries.\nStarting with South Sudan, Primate Ayodele revealed that he foresees another coup in Africa if the country’s government doesn’t take the right step now.\nIn Somalia, Primate Ayodele revealed that he foresees an attack on the government house and that the coming election will cause rancour and instability in the country.\nFor Sudan, Primate Ayodele revealed that there will be a change of government which will ‘shock’ the present administration.\nIn Libya, Primate Ayodele prophesied that Gadaffi’s son, Saadi, would win the election without the international community’s interference."
  },
  {
    "headline": "“Abba Kyari Showed me Hell’ – Evans Denies Kidnapping Businessman, Collecting $420,000 Ransom",
    "summarized_story": "Chukwudimeme Onwuamadike, alias Evans, the alleged kidnap kingpin, has stated that he witnessed hell in the hands of DCP Abba Kyari, the suspended Head of the Intelligence Response Team.\nEvans said this at an Ikeja Special Offences Court, while denying kidnapping a businessman, Sylvanus Ahamonu, and collecting a 420,000 dollar ransom from his family.\nNAN reports that Evans is standing trial alongside an ex-soldier, Victor Aduba, on a four-count charge of kidnapping and unlawful possession of firearms.\nEvans told the court that he was born on April 22, 1980, and hailed from Nnewi, Anambra State.\nWhen Sule noted that Ahamonu had identified him when he testified virtually (via the Zoom app) in court, Evans said he was easily identifiable."
  },
  {
    "headline": "Bethel Pupil Rejected Freedom, Ransom Bearer Abducted — CAN Chairman",
    "summarized_story": "Hayab, who is also the Vice Chairman of CAN in the northern states and Abuja, reportedly revealed that the remaining pupil, who is said to be the youngest of the abductees, turned down the militants’ offer of freedom.\nThe CAN leader, who spoke to Saturday PUNCH in Kaduna on Thursday, said, “Only one pupil of the Bethel Baptist High School is remaining with the terrorists.\nBut we also made findings and we don’t want to expose his parents to any noise but that is what he (the pupil) said.\nBut last week, they (terrorists) asked us to bring some money (ransom) to come and take him.\nThe man who has been helping us to deliver the money (ransom) all this while went to deliver the money to free this boy they were confusing and they kidnapped him."
  },
  {
    "headline": "Uncertainty as AFCON final pitches Mane against Salah as Senegal face Egypt",
    "summarized_story": "Senegal and Egypt meet in the Africa Cup of Nations final on Sunday, pitting two Liverpool stars up against one another.\nMohamed Salah is looking to lead the North Africans to a record-extending eighth continental triumph, while Reds team-mate Sadio Mane hopes to play a part in Senegal’s first ever Nations Cup victory.\nEgypt and Senegal had already been drawn to face each other in March in a two-legged play-off for a spot at the World Cup in Qatar, but continental silverware is at stake first.\nMane has scored three goals and set up another two in Senegal’s run despite suffering a concussion in a last-16 match with Cape Verde, while Salah has two goals and one assist.\n“It’s great to play against Senegal as a team and also against Sadio,” Salah said."
  },
  {
    "headline": "Ekiti 2022: Segun Oni abandons PDP, few days after losing governorship ticket",
    "summarized_story": "Few days after losing out on governorship ticket of the Peoples Democratic Party (PDP), former Governor of Ekiti State, Mr. Olusegun Oni, has left the opposition party.\nAccording to feelers, Oni, who is aspiring to govern the state for a second time, is apparently displeased with the outcome of the recent PDP governorship primary which left him in second place behind the flag bearer of the party, Mr. Bisi Kolawole.\nBlueprint gathered on Saturday that he will officially announce his next destination in the coming days.\nOni had joined PDP from All Progressives Congress (APC) after he couldn’t realise his governorship reelection quest about three years ago.\nBoth PDP and APC are currently experiencing turbulence shortly after their primary elections about a week ago, a situation that has left aggrieved aspirants seeking for alternatives."
  },
  {
    "headline": "Pictures: Minister Dare attends Daura emirate football tourney, bags award",
    "summarized_story": "The Minister of Youth and Sports Development, Sunday Dare, Friday, attended the grand finale of the Daura Emirate football competition held in honour of Emir of Daura, Alhaji Farouk Umar, in Daura, Katsina state.\nThe final which was played on the rehabilitated Daura township stadium featured Hadi Sirika FC and Gakuwa Pillars which ended in a penalty shoot-out, 5-4 in favour of Hadi Sirika FC.\nIn recognition of the efforts of the Minister to rehabilitate the Daura stadium, the Daura Emirate Soccer Coaching Society presented an Award of Excellence to Dare, lauding his commitment to sports development in the country.\nThe Daura stadium was rehabilitated under the Adopt-a-Pitch Public Private Partnership (PPP) initiative of the Minister.\nDignitaries that graced the Football competition finale include Emir of Daura, Alhaji Farouk Umar, Yusuf Muhammadu Buhari, son of President Muhammadu Buhari, Alhaji Nasiru Danu among others."
  },
  {
    "headline": "Delta Oil Vessel Explosion: Three Crew Members Alive, One Dead Body Found",
    "summarized_story": "Three crew members from the oil vessel that exploded in Delta State have been found alive.\n“We can confirm that three (3) crew members have been found alive in the community and our priority is to ensure that they receive the appropriate medical attention they need,” the company’s Chief Executive Officer, Ikemefuna Okafor, said.\nRead Also: Oil Vessel With 10 Persons On Board Explodes Off Delta StateHowever, Okafor noted that one dead body was discovered in the vicinity of the FPSO but the identity is yet to be ascertained.\n“As earlier confirmed, the fire burnt out completely as of Thursday afternoon, 3rd Feb. 2022, thus enabling closer inspection of the vessel.\n“The focus of our joint efforts is to prioritise investigations towards establishing the whereabouts, safety, and security of the 7 crew members still missing, clean up and limit damage to the environment, and establish the cause of the explosion."
  },
  {
    "headline": "NIN-SIM Linkage: SERAP Writes Buhari Over ‘Unlawful Access To Subscribers’ Details’",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has urged President Muhammadu Buhari to use his good offices and leadership position to urgently review and rescind the reported approval for security agencies to access people’s personal details via NIN-SIM linkage without due process of law.\nThe appeal was contained in a letter dated February 5, 2022, and signed by the SERAP Deputy Director Kolawole Oluwadare.\nSERAP believes that the reported approval to allow security agencies to access people’s personal details via NIN-SIM linkage without due process of law directly interferes with the privacy, dignity and liberty of individuals.\n“According to reports, some security agencies have received your approval to access people’s personal details via the database of the National Identity Management Commission in the course of carrying out their duties.\nThese requirements are included in the Nigerian Constitution and the human rights treaties to which Nigeria is a state party."
  },
  {
    "headline": "At Least 27 Killed In Zamfara Communities",
    "summarized_story": "At least 27 people have been killed by suspected terrorists in separate attacks on two communities in Zamfara State.\nThe attacked communities are Nasarawar Mai Fara in Tsafe local government area and Yar Katsina in Bungudu local government AreaNasarawar Mai Fara community was attacked on Thursday leaving 17 persons dead while 10 persons were killed in Yar Katsina communityREAD ALSO: 150 Suspected Terrorists, Kidnappers, Robbers Arrested In Imo – CPThe State Police Public Relations Officer , SP Muhammed Shehu confirmed the incidents to Channels Television via telephone conversation on Saturday“One village was attacked in Tsafe and one in Yar Katsina, Yar Katsina was attacked yesterday and the area is being manned by the military,” Shehu added.\n“Brigade Commander and the commissioner for Security Mamman Tsafe visited the village yesterday and accessed the existing security arrangement in the community and to build the confidence of the locals.”Sources told Channels Television that the attack on Nasarawar Mai Fara in Tsafe local government was due to the failure of the residents to pay a N40 million levy imposed by the bandits.\nThe levy was imposed by Ado Aleru, a notorious banditry kingpin operating in the area and the Faskari part of Katsina State.\nThe Police spokesperson said the command is not aware of any levy imposed on the community by bandits."
  },
  {
    "headline": "We Will Continue To Stand, Fight For Justice, Buhari Says At AU",
    "summarized_story": "President Muhammadu Buhari Saturday in Addis Ababa, Ethiopia, said Nigeria will continue to pursue peace and progress in Africa, and other parts of the world, by consistently pushing for justice, fairness, and inclusiveness in global affairs.\nThis was disclosed in a statement signed by his Special Adviser on Media and Publicity, Femi Adesina.\nThe President assured the Palestinian leader that Nigeria will be “consistent” in pushing for peace and progress, while upholding the tenets of justice.\nShtayyeh thanked President Buhari for his leadership role in the continent.\nPlease continue to stay well and healthy, because we need your wisdom,” he said."
  },
  {
    "headline": "Minors Still Detained In Syria Prison Attacked by IS, Says UN",
    "summarized_story": "The United Nations said on Sunday that minors were still being detained in a northeast Syria prison attacked last month by the Islamic State group, calling their conditions “precarious”.\nInternational rights groups, including Save the Children and Human Rights Watch have previously said that 700 boys had been in the Ghwayran jail before the January 20 operation.\n“UNICEF met with some of the children still detained in the Ghwayran detention centre,” the UN’s child agency said in a statement.\n“Despite some of the basic services now in place, the situation of these children is incredibly precarious,” it added, without specifying how many minors were still detained.\nKurdish authorities have repeatedly blamed the international community for failing to support efforts to rehabilitate and repatriate jihadist children."
  },
  {
    "headline": "Nigeria will continue to pursue peace, progress in Africa, World",
    "summarized_story": "Nigeria will continue to pursue peace and progress in Africa and the world at large by consistently seeking for justice, fairness and inclusiveness in global affairs.President Muhammadu Buhari stated this today at the ongoing African Union meetings in Addis Ababa, Ethiopia.\nAdvertisementHe assured the Palestinian leader that Nigeria will be “consistent” in pushing for peace and progress, while upholding the tenets of justice.\nThe Heads of State and Government of the African Union have elected President of the Republic of Senegal, Macky Sall, as the new Chairperson of the African Union for the year 2022.\nAdvertisementThe event took place during the ongoing thirty-Fifth Ordinary Session of the Assembly of the Union, holding at the AU Headquarters in Addis Ababa.\nAdvertisementIn his inaugural speech, President Sall said Africa is beset by a multitude of problems despite its commendable progress over the past few decades."
  },
  {
    "headline": "Proposed NSCDC bill misunderstood, says sponsor",
    "summarized_story": "The sponsor of the bill to absorb the Nigeria Security and Defence Corps, Shina Peller, from Oyo state says the proposed bill was misconstrued and misrepresented to Nigerians.\nAdvertisementHe said: “I shall weigh in and make certain clarifications about the proposed bill.\n“On Tuesday, the 1st of February 2022, the Nigeria Security and Civil Defence Corps (Repeal and Enactment) Bill that I sponsored was read for the first time in the House of Representatives.\nAdvertisement“The bill does not in any way seek to render people jobless rather the bill proposes the transfer of assets and personnel of the NSCDC to the Nigera Police.\nAdvertisementRecall that the bill generated a lot of controversies and also led to the withdrawal of NSCDC officials attached to the lawmaker which were later restored."
  },
  {
    "headline": "Zamfara speaker receives impeachment notice against deputy governor -",
    "summarized_story": "The Zamfara State House of Assembly has Commenced impeachment process against the state Deputy Governor, Mahdi Aliyu GusauRecall that the assembly had in November last year summoned the deputy governor for questioning over alleged gross misconductAdvertisementThe deputy speaker of the Zamfara State House of Assembly who doubles as the Chairman House committee on Public Accounts, Musa Bawa said the committee has concluded it’s investigation on the matterMusa Bawa submitted the notice of Impeachment of the State deputy Governor Mahadi Gusau to the speaker of the HouseAdvertisementReceiving the notice, the speaker of the House Nasiru Magarya commended the Committee for a job well-done and assures the Committee that the document will be treated according to the provisions of the constitution of the federal Republic of Nigeria 1999 as amended.\nThe Zamfara State House of Assembly is accusing the state deputy governor of breach of constitution, abuse of office, financial misconduct among other thingsAdvertisementThe House is expected to study the document after which the content would be made publicA Federal High Court in Abuja had on July 19 last year restrained the Zamfara State House of Assembly from taking steps to impeachment the state Deputy Governor Mahdi Aliyu Gusau.\nAdvertisement"
  },
  {
    "headline": "APC inaugurates 34 State chairmen amid unresolved factional crisis",
    "summarized_story": "The All Progressives Congress has inaugurated elected state chairmen in the 34 states of the country and the federal capital territory, Abuja.\nHowever, Kano and Sokoto states chairmen were not inaugurated.\nAdvertisementThis is coming on the heels of preparation for the national convention which has been fixed for February 26th, even as the party has confirmed the convention date to the Independent National Electoral Commission (INEC).\nMaking the announcement during inauguration, the secretary of the Caretaker Committee, James Akpanudoedehe said he has been directed to hand over their certificate of return to them"
  },
  {
    "headline": "Shehu Sani: Governors Can Do More Than Talking About Insecurity",
    "summarized_story": "Former national lawmaker, Senator Shehu Sani, speaks about what government at state and federal levels can do to secure the lives of Nigerians."
  },
  {
    "headline": "Nigeria: At Amaechi’s Turbaning, Daura Emir Says Emirate Doesn’t Give Chieftaincy Titles for Money",
    "summarized_story": "Speaking while conferring the chieftaincy title of Dan Amanar Daura (the Trusted Son of Daura) on the Minister of Transportation, Mr Chibuike Rotimi Amaechi in the ancient city of Daura, the emir said he had no regret conferring the chieftaincy title on the minister.\n“Nigerians should not insinuate that the emirate is looking for money or has no money.\nI want to announce to all Nigerians and everybody here that this emirate doesn’t give chieftaincy titles because of money or any position.\n“I had never given chieftaincy titles because of money, fear of somebody or position.\nWe give chieftaincy titles based on merit and to help our masses who God will ask us hereafter,” the monarch explained."
  },
  {
    "headline": "Emirates Resumes in Nigeria as Flights Land in Abuja, Lagos",
    "summarized_story": "After a long break due to a frosty relationship between the United Arab Emirates (UAE) and Nigeria, the Emirates Airline on Saturday resumed operations in Nigeria with its Flight EK783 landing at the Murtala Muhammed International Airport (MMIA) in Lagos.\nAnother Flight EK785, arrived in Abuja after departing Dubai at 1100hours, landing at the Federal Capital Territory (FCT) at 03.20 pm.\nEmirates reiterated that all passengers travelling from Nigeria with Dubai as their final destination would require a 48-hour PCR test.\nUpon arrival in Dubai, passengers will undergo an additional Covid-19 PCR test and remain in self-quarantine until the results of the test are received.\n“Passengers travelling from Nigeria and transiting in Dubai are required to follow the rules and requirements of their final destination,” the airline also said."
  },
  {
    "headline": "Oil Prices Head for $100 as Bonny Light Sells for $95",
    "summarized_story": "Oil prices continued their surge on Saturday, sending one of Nigeria’s most valued grades, Bonny Light to $95 and Algeria’s Sahara Blend to $97.48, in an obvious push towards the $100 mark.\nNigeria was unable to meet its oil production allocation by OPEC in January, as it was only able to pump 1.46 million barrels per day of the expected 1.683 million bpd for the month.\nHis promise of a 1.8 million barrels target by December 2021 had earlier faltered.\nThe budget was based on the production of 1.8 million barrels per day, including about 400,000 barrels of condensate that Nigeria produces daily.\n“The commission will commence JIV with relevant stakeholders immediately in line with our regulatory oversight function for upstream operations."
  },
  {
    "headline": "Nigeria will Shake When South Takes Position on 2023 Elections, Says Rivers Governor Wike",
    "summarized_story": "Rivers State Governor, Nyesom Wike, has said the stakeholders in the southern region would soon take a position concerning the 2023 presidential election.Wike spoke on Saturday at a reception organised in his honour by the Kalabari people.“The day the South will speak, Nigeria will shake,” the governor said.“We believe in the unity of this country, but nobody can threaten us.\nThe Zamfara State House of Assembly had on Friday served the deputy governor of notice of impeachment from office, accusing him of corruption and disobedience to constituted authority.\nPDP further stated that Matawalle should note that the people of Zamfara State are solid with his deputy as the custodian of the PDP mandate after Matawalle’s infamous defection to the APC.\n“As such, any action against the deputy governor amounts to a direct assault on the will of the people which they will firmly resist.\n“Governor Matawalle must know that the people of Zamfara State cannot allow his frustration and ego to be exchanged for their mandate which is now embodied in the deputy governor,” the statement added."
  }
]