[
  {
    "headline": "NDLEA intercepts 16.85kg cocaine, heroin consignments at Lagos seaport, airport",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency have intercepted consignments of cocaine and heroin with a combined weight of 16.85 kilograms worth over N4.9 billion in street value at the Apapa seaport and Murtala Muhammed International Airport in Lagos.\nThe Director, Media and Advocacy, NDLEA Headquarters, Abuja, Femi Babafemi disclosed this in a statement on Sunday.\nA swift follow-up operation the same day led to the arrest of one Ude Onyeka Victor, at Mafoluku area of Oshodi, Lagos.\nHe also confessed that he was contracted by one Oseki Chinedu, who is based in South Africa to travel to Lagos to collect the bag and bring it to Agbor junction, Delta State.\n“Not less than four suspects were arrested and different quantities of cocaine, cannabis, tramadol and Methamphetamine seized from them during weekend raids at Rumuokoro, Elelenwo and Omagwa/Elele communities in Rivers State."
  },
  {
    "headline": "UK’s Queen Elizabeth suffers ‘sprained back’ -Palace",
    "summarized_story": "Queen Elizabeth II has a “sprained back” and will miss Sunday’s Remembrance service — her first planned public appearance since resting on medical advice, Buckingham Palace said.\n“The Queen, having sprained her back, has decided this morning with great regret that she will not be able to attend today’s Remembrance Sunday Service at the Cenotaph,” a palace statement said.\n“Her Majesty is disappointed that she will miss the service.”Her son Prince Charles will lay a wreath on her behalf, as in previous years.\nCharles and his son Prince William represented the family in Glasgow, making a series of speeches.\nThe palace has previously said it was her “firm intention” to attend Sunday’s Remembrance event, which brings together veterans, their families and political leaders."
  },
  {
    "headline": "How climate change affects our 2021 harvest – Nigerian farmers",
    "summarized_story": "Atondu said that before the bumper harvest, a 28 – kilogramme bag of soybean was sold for N35,000 but now it is N28,000.\n“Most farmers in the state will have bumper harvest because most of them applied the ”Good Agronomic Practices,” he said.\nAt about this time last year, we were selling 10 tubers of yam for less than N3,000 because of the bumper harvest.\nBlessing Wuni, a beans and water melon farmer, said the irregular rainfall affected her yields this harvest season.\nShe however, said that farmers in the area were expecting bumper harvest of crops such as guinea corn and millet."
  },
  {
    "headline": "Kwara to issue riders’ uniform to motorcycle operators, others",
    "summarized_story": "Kwara Government is set to issue ‘Riders Uniform’ to all commercial drivers, beginning with motorcyclists popularly called Okada riders, in the state.\nThis is contained in a statement by Mr Suleiman Iliasu, Commissioner for Works and Chairman, Kwara Transport Sanitisation Committee on Sunday in Ilorin.\nHe said the decision to register and give uniforms to all commercial operators was to curb crimes and strengthen security of lives and property.\nIliasu noted that many suspected criminals had been found to often use motorcycles to carry out their dastardly acts.\nHe added that the government always worked with the police command in the state and other security agencies to protect lives and property of people of the state."
  },
  {
    "headline": "Chinese investors acquire 120 hectares of land in Akwa Ibom for Hendai city",
    "summarized_story": "**Project to generate 80,000 direct jobs-EssienBy Harris EmanuelA multibillion dollars modern city development project promoted by the Chinese investors , Hendai Investment Limited, is coming to oil rich Akwa Ibom state, it was gathered.\nEssien, looking upbeat, said interests from investors have already been flooding in , stating that the choice of Akwa Ibom for the project was due to its peaceful ambience.\nThis is one project that his Excellency does not want to leave Akwa Ibom state because the project is going to generate massive employment.\nSo, Hendai city residential township is meant to generate affordable houses for Akwa Ibom people and environs.\n‘’Akwa Ibom was choosing because of its peaceful nature."
  },
  {
    "headline": "Head of service calls for strategic approach to civil service operations for growth",
    "summarized_story": "The Head of the Civil Service of the Federation, Folashade Yemi-Esan, has called for a strategic approach to civil service operations, to ensure sustainable growth in Nigeria.\nShe described the book as inspirational, saying that to elicit change effectively in Nigeria was a peculiar task, but one that compatriots must do, because the civil service was the nation’s engine room.\nAccording to her, the civil service in Nigeria occupied a strategic position and ”if we cannot get it right in the civil service, then I do not know how Nigeria would survive”.\nShe reiterated the need for a strategic approach in the civil service, while urging Nigerians to draw lessons from the book as agents of change, to promote national growth.\n“People have to be in charge, even when we do not have what it takes to be in charge."
  },
  {
    "headline": "Your allegation of terrorism sponsorship disgusting distraction – FG replies GATE",
    "summarized_story": "Lai MohammedThe Federal Government has described the allegation byGlobal Advocates for Terrorism Eradication (GATE) that its officials are sponsors of terrorism, as a disgusting distraction.\n”This organisation called GATE is not even worth the ink with which its name is written.\n“How can a serious organisation accuse agovernment that is tackling the twin evil of terrorism and banditry with uncommon determination of sponsoring terrorism?\n”In the fight against terrorism, Nigeria has availed itself creditably by tackling home-grown terrorists with links to globalterrorist organizations.\nFittingly, Nigeria’s efforts at tackling terrorism have been hailed globally."
  },
  {
    "headline": "Come up with effective, efficient ways for quick dispensation of justice – Gov Buni tasks judiciary",
    "summarized_story": "Yobe State Governor and Chairman APC Caretaker Extraordinary Convention Planning Committee, Mai Mala Buni has tasked the judiciary to come up with effective and efficient ways for quick dispensation of justice in the state.\nBuni gave the charge during the swearing in of the newly appointed Grand Khadi.\nBabagana Mahadi is known as a thoroughbred professional, a fearless, selfless and impartial judicial officer of the fear of God.\nBabagana Mahadi will add value to the development of the Judiciary for efficient dispensation of justice in Yobe State to justify his appointment”, Buni stated.\nThe newly appointed Grand Khadi was born on 10th December, 1959 in Damaturu, joined the services of the former Borno State Judiciary and was appointed as Area Court Judge II in 1988."
  },
  {
    "headline": "Nigerian youths charged to embrace agriculture",
    "summarized_story": "The Executive Director, Foundation for peace, Hope and Conflict Management, Rev.\nProfessor Anthony Bature, hassaid that agriculture remains a veritable means of eradicating poverty and ending food insufficiency in any nation.\nCharging Nigerian youths to take advantage of the modern agricultural practices to improve their livelihood, unemployment, he believed would not only be reduced but will also boost wealth creation.\nBature who made this known at a workshop organized by the Foundation on how the youths who are going about seeking for white collar jobs can take advantage of modern agricultural technologies, also beckoned at youths to desist from shifting blames by making use of the available God’s gift which he identified as land to better their lives.\nBature went further to list low economic growth performance, crime and violence, weak governance, ill health among others as factors presently posing threats to young men and women in the country, stating that taking advantage of modern agriculture would help to address the vices presently confronting the nation."
  },
  {
    "headline": "Anambra election prophecies: Primate Ayodele denies chiding Fr Mbaka, Odumeje",
    "summarized_story": "Primate Elijah Ayodele, Leader Of INRI Evangelical Spiritual Church, has disassociated himself from a report making rounds that he verbally attacked Rev Fr Mbaka and Prophet Odumeje on their prophecies concerning the recently concluded Anambra governorship election.\nThis is coming after some national publications had shared the reports with the headline ‘Primate Ayodele Chides Mbaka, Odumeje Over Failed Predictions On Anambra Election’.\nHe said, “There is a publication making rounds that I verbally attacked Rev Fr Mbaka and Prophet Odumeje for a failed prediction on Anambra Election.\n“I have no business with any other Prophets on their Prophecies, God talks to everyone differently.\n“I urge the public to ignore and thrash any statement that says I verbally attacked some prophets for their prophecies, It never came from me."
  },
  {
    "headline": "NCC 2021 BMR: Akande, Danbatta commit to next phase of industry growth",
    "summarized_story": "The Chairman promised that the Board will work on issues that will help strengthen the regulator to deliver more effectively on its mandates.\nAccording to Danbatta, “I must commend the Board of Commissioners under the chairmanship of Prof. Adeolu Akande for their support.\nTherefore, I commend the Board for providing the necessary policy directions required to drive management’s daily activities,” Danbatta said.\nThe retreat follows the unveiling of two key documents – the Strategic Management Plan (SMP), 2020-2024, and the Strategic Vision Plan (SVP), 2021-2025.\nThe objective of the SVP is to enhance regulatory focus and efficiency in the delivery of NCC’s mandate."
  },
  {
    "headline": "Shekarau, Ganduje reunite at Deputy Governor’s daughter’s wedding",
    "summarized_story": "It was a memorable meeting of Northern political giants at the wedding ceremony of the daughter of deputy Governor of Kano State, Nasiru Yusuf Gawuna.\nBesides, the wedding fathia reunited Governor Abdullahi Umar Ganduje and Senator representing Kano Central, Mal.\nIbrahim Shekarau who met for the first time since after the crisis that rocked the state Congress of the All Progressives Congress (APC) in Kano.\nAbdullahi Karaye (Karaya), parted ways with Ganduje after kicking against the consensus arrangement for APC state leadership.\nWhile Ganduje anointed Prince Abdullahi Abbas as party Chairman, the Shekarau’s group fronted a parallel congress that produced Ahmadu Haruna Danzago as party Chairman, a raging political crisis yet to be laid to rest."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "2023: Why PDP must give presidential ticket to Northern Nigeria – Chieftain",
    "summarized_story": "Alhaji Lawal Usman, a Chieftain of the Peoples Democratic Party (PDP) says the party must zone its presidential ticket to the North for 2023 general elections for strategic reasons.\n“For the strategic interest of the party and the nation, the PDP must zone its presidential ticket to the North in 2023,” he said.\n“The entre North consisting of North Central, North East and North West only ruled for two years under late President Umar Yar’adua,” he said.\nREAD ALSO: Six in race for PDP vice chairman“The population of the PDP supporters in the North West, North East and North Central is enormous and should be considered in zoning the presidential ticket.\n“Strategically, for PDP to survive, we must win the presidential election in 2023 and this can only be done if we give the North the ticket."
  },
  {
    "headline": "How climate change affects our 2021 harvest – Nigerian farmers",
    "summarized_story": "Atondu said that before the bumper harvest, a 28 – kilogramme bag of soybean was sold for N35,000 but now it is N28,000.\n“Most farmers in the state will have bumper harvest because most of them applied the ”Good Agronomic Practices,” he said.\nHe said that the unusual situation had adversely affected harvest which in turn had a negative impact on food security.\nAt about this time last year, we were selling 10 tubers of yam for less than N3,000 because of the bumper harvest.\nShe, however, said that farmers in the area were expecting a bumper harvest of crops such as guinea corn and millet."
  },
  {
    "headline": "Buhari has done more for Benue than any administration – APC chieftain",
    "summarized_story": "Buhari has done more for Benue than any administration – APC chieftainAn All Progress Congress (APC) chieftain in Benue State, Abua Yaji, popularly called ‘Crucial’ has said the administration of President Muhammadu Buhari has done more development projects in the state than any other administration since the country’s return to democracy.\nSpeaking at an APC rally in Gboko, he dismissed the impression that Buhari, being Fulani, hates Benue people, describing it as the handiwork of mischievous politicians.\nDuring the campaign, Abua visited an APC governorship aspirant Tersoo Mark Hanmation, who formally declared his 2023 governorship ambition before Jemgbah Youths.\n- Advertisement -Hon Abua said that come 2023, APC would take over Benue State and urged the youths to remain resolute in their support for the party.\nHe said the APC had learned from its mistake in 2019 when it lost power to the PDP in Benue."
  },
  {
    "headline": "Political solution option: Afenifere hits Malami over Igboho, Kanu",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“To us in Afenifere, and indeed, to many who believe in orderliness and rule of law, Sunday Adeyemo, popularly known as Sunday Igboho, committed no offence.\nSo, the question of he, or anyone on his behalf, making a case for a political solution does not arise.\n“The same government has been making a lot of efforts to get him extradited from the Republic of Benin to Nigeria.\nBut because the man is not a criminal, it has been difficult to build a case to nail him."
  },
  {
    "headline": "Leaders planned meeting with President: Outcome of talks with",
    "summarized_story": "So, one of the driving forces is to rewrite the history of Ebonyi State.\nThe important thing is that we have that infrastructure which nobody will take away from Ebonyi State.\nIt was actually supposed to be a campus of Ebonyi State University for Medicine only.\nWe’ve paid 100 per cent for the dialyzer plant, so we are going to have the plant in Ebonyi State.\nWe have the patent; so, anywhere that the plant would be built again in Africa, Ebonyi State is going to be a beneficiary."
  },
  {
    "headline": "It’s nobody’s business what I do with my boobs –BBNaija star, Angel",
    "summarized_story": "By Funsho ArogundadeFor Big Brother Naija star, Angel Agnes Smith, has said that whatever she does with her boobs is nobody’s business.\n“Honestly, it’s not anybody’s business what I do with my boobs.\nI will rather insure my eyes because I have an intense eyes alongside my most prized possession which is my mind,” she said.\nMy most prized possession is my mind, as it has always put me in many beautiful positions.\nWhile admitting that she has a notorious mood swing, Angel, whom many perceive as flirty, described herself as naturally reclusive."
  },
  {
    "headline": "2023: It’s time for Nigerian youths to produce president – Shettima, AYCF president",
    "summarized_story": "To the President of Arewa Youth Consultative Forum (AYCF), Yerima Shettima, the region was not ready to champion the affairs of the country based on his view as captured in this interview.\nSo, what are those qualities Nigerians should look forward to as they decide their next president after the expiration of the tenure of President Buhari in 2023?\nLet’s talk a bit about the tenure of Buhari which is about six and half years now.\nWhat specific message do you have for your constituents, I mean young people ahead of the 2023 elections?\nWe should be very focused, determined and take our destiny into our hands to ensure one of our own becomes the president."
  },
  {
    "headline": "Electoral Act: APC govs, others under fire for kicking against direct primaries",
    "summarized_story": "“We felt that we should let you know that we are done with the Electoral Act Amendment Bill.\nOn the flipside, the Parliament is pushing for the Electoral Act Amendment Bill to be signed immediately by the President.\nThe PDP National Publicity Secretary, Kola Ologbondiyan, in the party’s reaction to the passage of the Electoral Act Amendment Bill, said making direct primaries compulsory was unacceptable.\n“I support direct primaries because it is more democratic and more inclusive than indirect primaries.\nHowever, a renowned union activist, Chief Frank Kokori, expressing a different view, argued that direct primaries would be more expensive in actual practice than the indirect primaries."
  },
  {
    "headline": "Buhari, Zulum Mourn as ISWAP Fighters Ambush General, Three Soldiers in Borno",
    "summarized_story": "I salute the sacrifices of some officers and men we lost today and share the grieves of the immediate families and the Nigerian military.\nThis has placed added responsibility on the border security agencies.\nMonguno said the move was aimed at strengthening border security.\n“It is necessary to observe that both strategies place a premium on employing technology to complement other existing physical border security arrangements.\nWe are also exploring the feasibility of setting up a border security force in the foreseeable future to secure Nigeria’s border areas”, he said."
  },
  {
    "headline": "INEC: Monitoring Direct Primaries Has Financial, Security Implications",
    "summarized_story": "The commission further explained that monitoring the direct primaries of the 18 political parties registered so far would involve much staff.\nHowever, the state governors, who are opposed to direct primaries, had expressed fear over the logistical problems it would create for the commission.\nSpeaking to THISDAY last night, INEC’s National Commissioner in charge of Voter Education and Information, Mr. Festus Okoye, acknowledged that the monitoring of the direct primaries of the 18 registered political parties has security and financial implications.\n“The monitoring of direct primaries has financial and national security implications.\nOkoye further noted that INEC will aggregate the figures and design a continuity framework and matrix for monitoring of direct primaries."
  },
  {
    "headline": "18 Days after Launch, CBN’s eNaira Registers 488,000 Subscribers in 160 Countries",
    "summarized_story": "•Records 17,000 transactionsJames Emejo in AbujaBarely 18 days after its launch, 488,000 consumer wallets have been on-boarded to Nigeria’s Central Bank Digital Currency (CBDC) platform known as the eNaira from over 160 countries through Google Playstore and Apple Store as of Friday.\nThis is an indication of growing enthusiasm for the central bank’s digital currency, which has been described as a game-changer.\nThe digital platform had recorded about 200,000 wallets downloads in less than one day that the portal came alive.\nNigeria is the first country in Africa and one of the first in the world to introduce digital currency.\nHe added: “Therefore, the eNaira is Nigeria’s CBDC and it is the digital equivalent of the physical Naira."
  },
  {
    "headline": "$40bn Deals: Buhari Leaves Paris for IATF in S’Africa",
    "summarized_story": "Deji Elumoye in Paris, FrancePresident Muhammadu Buhari yesterday left Paris, the French capital, to join other African leaders in South Africa for the opening ceremony of the second Intra-African Trade Fair (IATF) 2021, which is expected to attract $40 billion investments to the continent.\nAccording to a statement issued by his Special Adviser on Media and Publicity, Mr. Femi Adesina, the president, is attending the event on the special invitation of South African President, Mr. Cyril Ramaphosa.\nAdesina stated that global businesses, including non-African international brands are expected to key into opportunities generated by the fair, thereby attracting for the continent trade and investment deals worth $40billion.\nThe theme of the Fair, ‘Building Bridges for a Successful AfCFTA’, aims at boosting trade and investment across the African continent.\n“President Buhari is expected back in Nigeria on Tuesday, November 16,” the statement added."
  },
  {
    "headline": "Osinbajo: Strategic Leadership Helped Nigeria Tackle COVID-19",
    "summarized_story": "Osinbajo who stated this at the public presentation of the book, ‘Winning Leadership’ authored by Major-General Pat Akem-Vingir (retired) noted that the step was a good example of strategic leadership in a crisis.\nHe said Nigeria’s COVID-19 response had been celebrated locally and internationally as a result of such strategic leadership.\nIn other words, effective strategic leadership purposefully provides direction and inspires.\n“Whereas countries with more modest economic profiles, quickly deployed a public health framework that was responsive and effective.\nOsinbajo described the book as an essential contribution to the existing body of knowledge on the subject of strategic leadership."
  },
  {
    "headline": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
    "summarized_story": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19."
  },
  {
    "headline": "President Donald J. Trump’s Concession Speech, By Rudolf Okonkwo",
    "summarized_story": "The first time I ran for office, I ran for president.\nI have shown you that everything is possible if you have the right man to do the right job.\nThanks to me, they will grow up knowing that ours is a Christian nation where it is allowed to say Merry Christmas.\nTell those terrible lowlifes that they have proved themselves unworthy of Donald Trump’s genius and have opted to reduce America to a Second Class nation in the world.\nYours truly,President Donald J. TrumpThe 45th President of the United States."
  },
  {
    "headline": "Bandits Free Niger State Monarch After 45 Days In Captivity, N10million Ransom",
    "summarized_story": "The Dodo of Wawa community, Niger State, Dr Mahmoud Ahmed Aliyu, has been freed by his abductors after spending 45 days in their captivity.\nHe was said to have been released at about 7:30pm on Tuesday after the payment of N10million ransom to the bandits.\nThe Wazirin Wawa, Alhaji Ja’afar Ibrahim Bio, confirmed the release of the traditional ruler to Daily Trust, on the telephone but declined comment on how much was paid to secure his release.\nIn a video shared by his family, the traditional ruler was seen in a white turban being welcomed by his family and members of the palace.\nAliyu was abducted in his palace by heavily armed men around 9pm on September 4."
  },
  {
    "headline": "The Teflon President With Nine Lives Is On His Way Out By Dr. Wumi Akintide",
    "summarized_story": "The Teflon President with nine lives I have in mind is nobody else but Donald J. Trump.\nIn cahoots with Trump, Republicans have not ended their campaign of calumny to humiliate, blackmail and delegitimize Barack Obama, the first black President.\nThe one-term young Senator from Illinois was elected President in 2008 and re-elected again in 2012 with a wider margin.\nThe voters concluded he had told a lie even though he was one of the most honorable and dependable men of honor ever to serve as American President.\nThe list goes on and on without end but Donald Trump is still there despite an abysmal approval opinion of only 33 percent or less."
  },
  {
    "headline": "'Some insurgents hell-bent we don't regain peace' -- Zulum speaks on ISWAP attack",
    "summarized_story": "Babagana Zulum, governor of Borno, has commiserated with the military over the death of some officers and soldiers killed in the state.\nThe commander was said to be on his way to the town for reinforcement when he ran into an ambush.\nAdvertisementBabagana, in a statement issued by Isa Gusau, his spokesperson, said Borno is grateful for the sacrifices of the troops.\nWe must always affirm our fates in our armed forces, while the armed forces must remain up and doing.\nI salute troops who mobilized to provide reinforcement."
  },
  {
    "headline": "'Some insurgents hell-bent we don't regain peace' -- Zulum speaks on ISWAP attack",
    "summarized_story": "Babagana Zulum, governor of Borno, has commiserated with the military over the death of some officers and soldiers killed in the state.\nThe commander was said to be on his way to the town for reinforcement when he ran into an ambush.\nAdvertisementBabagana, in a statement issued by Isa Gusau, his spokesperson, said Borno is grateful for the sacrifices of the troops.\nWe must always affirm our fates in our armed forces, while the armed forces must remain up and doing.\nI salute troops who mobilized to provide reinforcement."
  },
  {
    "headline": "PDP chieftain: Why 2023 presidential ticket must be zoned to north",
    "summarized_story": "Lawal Usman, a chieftain of the Peoples Democratic Party (PDP), says the 2023 presidential ticket of the party must be zoned to the north.\n“For the strategic interest of the party and the nation, the PDP must zone its presidential ticket to the north in 2023,” he said.\nAdvertisement“For justice and equity, the north should be allowed to produce the president in 2023 under the PDP.\n“The population of the PDP supporters in the north-west, north-east and north-central is enormous and should be considered in zoning the presidential ticket,” he said.\n“Strategically, for PDP to survive, we must win the presidential election in 2023 and this can only be done if we give the north the ticket."
  },
  {
    "headline": "PDP chieftain: Why 2023 presidential ticket must be zoned to north",
    "summarized_story": "Lawal Usman, a chieftain of the Peoples Democratic Party (PDP), says the 2023 presidential ticket of the party must be zoned to the north.\n“For the strategic interest of the party and the nation, the PDP must zone its presidential ticket to the north in 2023,” he said.\nAdvertisement“For justice and equity, the north should be allowed to produce the president in 2023 under the PDP.\n“The population of the PDP supporters in the north-west, north-east and north-central is enormous and should be considered in zoning the presidential ticket,” he said.\n“Strategically, for PDP to survive, we must win the presidential election in 2023 and this can only be done if we give the north the ticket."
  },
  {
    "headline": "INSIGHT: With over 90% of Nigerians at risk, will malaria vaccine be the game changer?",
    "summarized_story": "Children under five are the most vulnerable group, while according to statistics, over 90% of Nigerians are at risk.\nIt was, therefore, welcome news when the WHO, on October 6, endorsed the widespread use of the RTS,S/AS01 (RTS,S) malaria vaccine.\nThere’s more on the malaria vaccine here.\n“Due to constant exposure to mosquito bites and getting malaria infection, overtime, we develop partial immunity to malaria.\nOur goal is to reduce malaria deaths to zero."
  },
  {
    "headline": "Where is Africa’s digital media landscape headed?",
    "summarized_story": "Digital media in Africa is growing fast: traditional media organisations are finding their way to the internet while digital-only media organisations are taking firm root.\nMore Africans are online, they are spending more time on the internet and relying more on digital media more than ever.\nHow can digital media in Africa create a profitable business model?\nWhile it is normal to get excited about the different innovative news products in the continent’s digital media landscape, Abiru explains that more media houses need to produce more information that helps people understand what is going on around them.\nShe believes African journalists can do amazing work, but their budget is way smaller than that of global publications."
  },
  {
    "headline": "Is Flutterwave’s acquisition of Disha a win for the creator economy?",
    "summarized_story": "Credit: Disha (Medium)The product was an instant hit and got considerable adoption among creators and gig workers.\nThe move by the payments giant, which earlier this year became a unicorn, is surprising as both companies operate in different spaces—Flutterwave in payments and Disha in the creator industry.\nDespite the acquisition, however, Disha will remain an independent company.\n“Before now, when users created a Disha page and linked to a Flutterwave payment link, they got taken off the Disha site.\nNow, with the acquisition, users can create and accept their payments, all in one place.”Flutterwave has always played in the creator space, having supported arts events like ArtX Lagos."
  },
  {
    "headline": "Exclusive: Meta’s VP MEA and Turkey on Facebook’s transition into the metaverse",
    "summarized_story": "Leading that work in Africa is Derya Matras, Vice President (VP), Middle East, Africa (MEA) and Turkey, Meta.\nPrior to her appointment as VP in August, Matras was the Managing Director for the MEA and Turkey region.\nIt’s the next evolution in a long line of social technologies, and it’s ushering in a new chapter for our company.\nWhy should Facebook build this?\nBut it’s important to reiterate that Meta is neither going to build, own, or run the metaverse on its own."
  },
  {
    "headline": "MFS Africa raises $100m to continue expanding its digital payments network",
    "summarized_story": "MFS Africa, Africa’s largest digital payments network, has raised a $100 million Series C funding, an investment divided into two commitments: $70 million for equity and $30 million for debt financing.\nThe announcement came a few weeks after the company extended its footprint into the Nigeria market by acquiring Baxi, one of Nigeria’s largest digital solutions and distribution companies, from Capricorn Digital.\nFounded by Dare Okoudjou in 2009, MFS connects more than 320 million mobile money wallets across over 35 African countries.\nThe company plans to use the new investment to hire more global talent, power its Governance, Risks and Compliance (GRC) functions, and ramp up its expansion efforts.\nWe are excited to join MFS Africa’s world-class management team on its mission and to support its growth journey.”Share this article"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Technext to host Coinference 2021: Africa’s biggest cryptocurrency gathering!",
    "summarized_story": "Share this article:Tech media organisation, Technext has announced its maiden event, Technext Coinference 2021.\nThe maiden event is billed to hold on Thursday, December 9, 2021, at the Pistis conference centre in Lagos.\nRegistered delegates will anticipate discussions on the impact of regulation on the crypto space.\nIt will also provide an exciting opportunity for crypto enthusiasts to meet other enthusiasts, develop ideas and positions for future gain.\nTechnext Website Technext.ng is the go-to site for Tech News, Reviews and Insightful Analysis in Nigeria."
  },
  {
    "headline": "Helium Health acquires Qatar’s Meddy in expansion play",
    "summarized_story": "Share this article:Nigerian healthtech startup, Helium Health has announced its acquisition of Meddy, a doctor booking platform in Qatar.\nAs part of the deal, Meddy’s CEO Haris Aghadi and COO Abed Alkarim Khattab will join Helium Health’s leadership team.\nHowever, Adegoke Olubusi, Helium Health’s CEO reveals that the cultural similarity of the two teams was key in the deal.\nFounded by Olubusi, Dimeji Sofowora, and Tito Ovia, Helium Health provides a suite of services for its healthcare clients.\nThis year, Helium Health has already expanded to Kenya."
  },
  {
    "headline": "Nigerian drones and smart glasses, Rabbit’s $11m pre-seed, MFS Africa’s $100m Series C, and Flutterwave’s Disha acquisition",
    "summarized_story": "AdvertisementLendable, a UK-based debt financing company, typically gives startups between $5 million and $10 million in debt financing.\nYou can read all about it here: How UK-based debt financing company, Lendable, is providing equity-free financing for African startups.\nMFS Africa raises $100m Series CDare Okoudjou (Founder and CEO, MFS Africa).\nSource: Reloadly blogPan-African cross-border payments gateway, MFS Africa, has closed a $100 million Series C round, comprising $70 million equity and $30 million debt.\nFounded in 2009, MFS Africa connects mobile money systems to banks and other financial institutions."
  },
  {
    "headline": "COP26 keeps 1.5C hanging by a thread – experts",
    "summarized_story": "Negotiators agreed that urgent action was needed in accelerating climate action but this didn’t fully reflect in their commitments.\n“However, the rules agreed at COP26 are far from perfect with some major loopholes on timeframes for countries’ climate targets and especially for carbon markets.\nEvans said that governments must avoid this temptation, uphold strict standards, and stay faithful to the ambition of the Glasgow Climate Pact which gives us the hope of keeping 1.5C alive.\nBut work done by independent experts Climate Action Tracker shows that with full implementation of the fresh collective commitments could hold temperature rise to 1.8C.\nAfter the collective dedication which has delivered the Glasgow Climate Pact, our work here cannot be wasted,” Sharma said."
  },
  {
    "headline": "What Ikoyi building collapse means for housing stakeholders",
    "summarized_story": "Beyond the pain of loss inflicted on people whose loved ones were killed, the Gerard Road Ikoyi building collapse in Lagos means so much for critical stakeholders in Nigeria’s housing sector, experts say.\n“The Ikoyi building collapse means the government and its agencies are not doing enough.\nThe collapse of Ikoyi building, also known as 360 Towers, has implications for project financiers too.\nAll these define the collapsed Ikoyi building.\nToo many experts in the built environment, the collapsed Ikoyi building was a disaster waiting to happen."
  },
  {
    "headline": "2023: Might, not fairness, to determine parties’ presidential tickets",
    "summarized_story": "Mamman Mohammed, director-general, Media to Governor Mai Mala Buni, chairman, of the All Progressive Congress APC Caretaker Committee, said the APC has not determined where its presidential ticket will be zoned to.\nMbawuike also said that the provision in the 1999 Constitution of the Federal Republic of Nigeria as amended was the basis for zoning of the presidential tickets by political parties.\nSam Ajanaku Onikoyi, a Nigerian historian and Commonwealth researcher based in Brussels, Belgium, is seeing selfishness and greed playing out in the 2023 presidential ticket across the two major parties.\nWith the many agitations, allegations of marginalization, and intimidation, the political class should make the 2023 presidential ticket available to people from places the foul cries are echoing louder”, Umelahi said.\nHowever, Onikoyi draws from his experience in Belgium, noting that the people can still make the 2023 presidential ticket and election to count if they unite to fight their common enemy – selfish politicians."
  },
  {
    "headline": "Viral video: Edo govt condemns assault on elderly man, youths, vows to prosecute perpetrators with VAP law – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe attention of the Edo State Government has been drawn to a social media video in which some young men wielding machetes and cudgels were recorded assaulting an elderly man and some young people within the state.\nThe state government strongly condemns the reprehensible act and vows to bring the perpetrators to justice.\nPreliminary investigations reveal that the incident appeared to have occurred in Edo State, as the persons in the video spoke in a language indigenous to the state.\nWith its uncompromising commitment to maintaining law and order, the government frowns at all forms of violence and is particularly appalled with the contents of the video.\nOsaigbovo IyohaChief of Staff to the Edo State Governor..."
  },
  {
    "headline": "Alaghodaro 2021: Obaseki, Shaibu tee-off Governor’s Cup Golf tourney – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Governor, Mr. Godwin Obaseki and his deputy, Rt.\nPhilip Shaibu, at the weekend in Benin City, teed-off the Governor’s Cup Golf Tournament, which is part of activities lined up for the annual Alaghodaro Summit.\nSome of our guests play golf and even those that don’t play golf, stay around, spend the weekend and unwind after a very tough summit.\n“As you can see, golf is one of the sports that is closely followed globally.\nHe noted that when followed to the latter, the plan would help Edo become strong as a sub-national."
  },
  {
    "headline": "UROMI-UBIAJA ROAD WEARS NEW LOOK AFTER PALLIATIVE REPAIRS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAUTHORITIES of Esan South East Local Government Council, Edo State, have intervened to effect repairs on the deplorable Uromi-Ubiaja Road, though a federal road.\nWhen The SUNDAY OBSERVER visited the road, it observed council officials from the works department putting Hardcore (big stones) and Stone Base on the failed portions of of the road.\n“We know it’s a Trunk ‘A’ road, but the road is mostly used by people of Esan South East, and by transporters/travellers.\nSo within the available resources in the council, we decided against all odds, to rehabilitate the failed portions on this road.\nThe Director of Works, Esan South East Local Government, Engr."
  },
  {
    "headline": "I’ve no plans to switch parties, says Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said he has no plans to join another political party, reassuring that his party affiliation will not alter development plans for the state.\nObaseki, who spoke during a Banquet in Benin City, as part of activities for this year’s Alaghodaro Summit, said his government is committed to ensuring a progressive and prosperous Edo State where all citizens will live life to the fullest.\nThe governor said, “No matter the persuasion to join any political party, I will not.\nWe don’t need to join another political party to develop Edo State to become a home for all.\n“In the last five years, we have been in the foundation laying stage for the development of Edo State."
  },
  {
    "headline": "Boko Haram: Buhari mourns slain general, three others",
    "summarized_story": "President Muhammadu Buhari has expressed sadness over the demise of a brigadier-general, Dzarma Zirkusu, and three soldiers who paid ”the supreme sacrifice while fighting terrorists in the Northeast zone of the country”.\nHe said: “Nigeria has lost brave soldiers.\nGen. Zirkusu leaves us sad and devastated.\n”The soldier in him will remain immortal.”The president urged the Chief of Army Staff, Faruk Yahaya, to accept his heartfelt condolences and that of the nation, and conveyed same to the families of those martyred.\n“I pray to the Almighty to give you and the bereaved families the strength and courage to bear this irreparable loss,” the president added."
  },
  {
    "headline": "First Bank Reiterates Commitment to Youth Empowerment, Celebrates Youth Week",
    "summarized_story": "From showcasing of talents, to the art of fashion design, identifying youths in the food business and lots more, First Bank of Nigeria Limited has reiterated its commitment to Youth Empowerment and Entrepreneurship through the celebration of its ongoing 2021 Youth Week.\nThe Youth Week, themed “The Future is Now, Let’s Takeover” started on Monday, 8 November 2021.\nSpeaking on the Youth week celebration, Dr. Adesola Adeduntan, Chief Executive Officer of FirstBank said ‘’we remain committed to recognizing the enormous opportunities that can empower the Nigerian youth.\nTherefore, the Youth Week presents a unique platform to strengthen the Banks commitment to the younger population, who have become the powerhouse driving all facets of digitization and innovation in our world today’’.\nFor more information and participation in the Youth Week, kindly visit the bank’s verified social media platforms; Instagram: @firstbanknigeria, Facebook: First Bank of Nigeria Limited."
  },
  {
    "headline": "Terrorists retaliate military bombardment in Borno, kill Nigerian Army general, destroy telecom facilities",
    "summarized_story": "The attack on the Nigerian troops in Askira Uba, Mulai, Ngamdu and Buniyadi in the North-East at the weekend came hours after top commanders of ISWAP were killed in military airstrikes.\nPRNigeria quoted an intelligence officer to have that the terrorists also destroyed telecommunication masts.\n“The ISWAP terrorists who invaded the Askira Uba town destroyed telecommunication masts with guns and other firearms in their possession, forcing residents to flee,” the source was quoted as saying.\n“A military commander was killed in an ambush while leading troops on reinforcement operation.\n“The Chief of Army Staff Lt Gen Faruk Yahaya deeply commiserates with the families and relations of the fallen heroes."
  },
  {
    "headline": "Enugu govt promises support for woman whose husband killed son for ritual",
    "summarized_story": "Governor of Enugu State, Ifeanyi Ugwuanyi, has assured Mrs. Augustina Ifebuche Eze, whose seven-year-old son was allegedly killed by her husband, Chidi Onyishi, for money ritual that the state government will support her and her children.\nSpecial Adviser to the Governor on Information, Steve Oruruo who led a delegation from Ugwuanyi to commiserate with Mrs. Eze, said the state government will stand behind her family.\nEverything that needs to be done will be done by Enugu State Government to ensure that you find justice and overcome this challenge.\nSo he has sent us to come and commiserate with you and reassure you that you will not stand alone.\nGovernment will be with you and will give you support as we pray that God will give you stronger reason to find comfort."
  },
  {
    "headline": "Ebonyi PDP rejects ‘plan to auction state liaison offices in Abuja, Lagos, Enugu to Umahi family’",
    "summarized_story": "OBINNA EZUGWUThe Ebonyi State chapter of the People’s Democratic Party (PDP), has rejected what it described as a plan by the state government, working in connivance with the state house of assembly, to auction the state’s liaison offices in Abuja, Lagos, Enugu and Aba to the family of Governor David Umahi.\n“The attention of the People’s Democratic Party (PDP) in Ebonyi State has been drawn to the plan by the Ebonyi State Government in connivance with the House of Assembly to cede Ebonyi State liaison office buildings in Aba, Lagos, Abuja and Enugu to the Governor David Umahi’s family.\n“Why are the Ebonyi offices in Aba and Enugu auctioned outright?\nUmahi has concluded plans to acquire the property using cronies and which the leadership of the state assembly is aware of.\nWe wish also to remind the Ebonyi State House of Assembly that it’s not an appendage of the executive arm of the Ebonyi State Government, that they should at all times be doing the bidding of the executive without following due legislative process."
  },
  {
    "headline": "Commit More To Climate Financing, Emission Cuts, Jonathan Tells World Leaders",
    "summarized_story": "Former President Dr. Goodluck Jonathan has tasked world leaders to be more committed to climate financing and reduction of greenhouse gas emissions in order to arrest the damaging effect of climate change.\nCommending the World Leaders for some of the decisions reached at the just-ended Conference Of The Parties (COP26) on climate change in Glasgow, Scotland, Jonathan urged leaders of developed countries to endeavor to meet their commitments in funding climate change control efforts.\n“It will only be meaningful and beneficial to developing nations, if world leaders show more commitment in walking the talk in climate financing.\n“This view was echoed by many leaders of developing nations at the COP26 Summit, particularly our President who presented a case for sustained technical and financial support to developing countries to enhance the attainment of national and global climate change goals.\nThe fight against climate change is therefore a cause that requires a concerted global approach."
  },
  {
    "headline": "Commit More To Climate Financing, Emission Cuts, Jonathan Tells World Leaders",
    "summarized_story": "Former President Dr. Goodluck Jonathan has tasked world leaders to be more committed to climate financing and reduction of greenhouse gas emissions in order to arrest the damaging effect of climate change.\nCommending the World Leaders for some of the decisions reached at the just-ended Conference Of The Parties (COP26) on climate change in Glasgow, Scotland, Jonathan urged leaders of developed countries to endeavor to meet their commitments in funding climate change control efforts.\n“It will only be meaningful and beneficial to developing nations, if world leaders show more commitment in walking the talk in climate financing.\n“This view was echoed by many leaders of developing nations at the COP26 Summit, particularly our President who presented a case for sustained technical and financial support to developing countries to enhance the attainment of national and global climate change goals.\nThe fight against climate change is therefore a cause that requires a concerted global approach."
  },
  {
    "headline": "Communities Laud $65m RAIN Rural Water Programme",
    "summarized_story": "Floated by The Coca-Cola Foundation, RAIN was created to improve access to clean water across Africa and to have a positive and measurable impact on the lives of those living in targeted communities.\nThere was no water borehole system.\nADVERTISEMENT“Before Coca-Cola drilled this tube well for us, we suffered a lot to get drinking water in our community.\nAs it is designed to be measurable, RAIN addresses specific community needs, with specific emphasis on water, sanitation and hygiene (WASH) alongside other water-based areas of focus.\nThe second priority of RAIN is to promote the productive use of water and minimise wastage and inefficient use."
  },
  {
    "headline": "Communities Laud $65m RAIN Rural Water Programme",
    "summarized_story": "Floated by The Coca-Cola Foundation, RAIN was created to improve access to clean water across Africa and to have a positive and measurable impact on the lives of those living in targeted communities.\nThere was no water borehole system.\nADVERTISEMENT“Before Coca-Cola drilled this tube well for us, we suffered a lot to get drinking water in our community.\nAs it is designed to be measurable, RAIN addresses specific community needs, with specific emphasis on water, sanitation and hygiene (WASH) alongside other water-based areas of focus.\nThe second priority of RAIN is to promote the productive use of water and minimise wastage and inefficient use."
  },
  {
    "headline": "Aliyu, Nyako Seek Policy On Agric Extension",
    "summarized_story": "Experts including former governors of Niger and Adamawa states, Babangida Aliyu and Murtala Nyako respectively at the Sir Ahmadu Bello Memorial Foundation (SABMF) have called for the formulation of a holistic and enduring national policy on agricultural extension policy to tackle food insecurity in Nigeria.\nSpeaking in Abuja at an “Expert’s Roundtable on Perspectives of Extension in Agriculture Value Chain: Driving Policy Development and Climate Smart Adaptation” organised by the foundation, earlier, the managing director/CEO of SABMF, Engr Abubakar Gambo, said there are challenges in the nation’s agriculture extension value chain.\nThe chairman, SABMF Board of Trustees (BoT) and former Niger State governor, Mu’azu Babangida Aliyu, stressed the importance of standardising agricultural extension policies in the country to boost the agricultural value chain production and ensure food security.\nFor the former Adamawa State governor Murtala Nyako, there should be entrenchment of modern facilities and mode of agriculture in the country to boost food production and generate employment.\nADVERTISEMENTAlso, advisory council member of the SABMF and professor of agricultural extension at the University of Ibadan (U.I), Mohammed Kuta Yahaya, said agricultural extension policy is like a catalyst of bedrock to agricultural development."
  },
  {
    "headline": "10 FASCINATING FACTS ABOUT NOLLYWOOD BEAUTY, LILIAN BACH",
    "summarized_story": "By AZUH AMATUS1 Name: Lilian Bola Bach.\n3 The very talented entertainer was born at Island Maternity, Lagos Island to a Yoruba mum and Polish dad.\n6 Beautiful Bach was also a former face of Delta medicated soap and helped popularise the product with her pretty and famous face.\n7 Bach whose debut effort was titled Native, breezed into Nollywood in September 1997.\n10 The screen dazzler is the founder of Lilian Bach Foundation, which caters for people with physical disabilities, especially lepers."
  },
  {
    "headline": "10 FASCINATING FACTS ABOUT NOLLYWOOD BEAUTY, LILIAN BACH",
    "summarized_story": "By AZUH AMATUS1 Name: Lilian Bola Bach.\n3 The very talented entertainer was born at Island Maternity, Lagos Island to a Yoruba mum and Polish dad.\n6 Beautiful Bach was also a former face of Delta medicated soap and helped popularise the product with her pretty and famous face.\n7 Bach whose debut effort was titled Native, breezed into Nollywood in September 1997.\n10 The screen dazzler is the founder of Lilian Bach Foundation, which caters for people with physical disabilities, especially lepers."
  },
  {
    "headline": "FG Slams US Non-Profit Organization Over Terrorism Sponsorship Allegation",
    "summarized_story": "FG Slams US Non-Profit Organization Over Terrorism Sponsorship AllegationFG Slams US Non-Profit Organization Over Terrorism Sponsorship AllegationBy TANKO ALIThe Federal Government has described the allegation by a US-basednon-profit organization, that the Nigerian government is a sponsor ofterrorism, as a disgusting distraction orchestrated by those seekingto weaken the ongoing massive onslaught against terrorism andbanditry.\n”This organization called GATE is not even worth the ink with whichits name is written.\nHow can a serious organization accuse agovernment that is tackling the twin evil of terrorism and banditrywith uncommon determination of sponsoring terrorism?\n”In the fight against terrorism, Nigeria has availed itselfcreditably by tackling home-grown terrorists with links to globalterrorist organizations.\nFittingly,Nigeria’s efforts at tackling terrorism have been hailed globally."
  },
  {
    "headline": "FG Slams US Non-Profit Organization Over Terrorism Sponsorship Allegation",
    "summarized_story": "FG Slams US Non-Profit Organization Over Terrorism Sponsorship AllegationFG Slams US Non-Profit Organization Over Terrorism Sponsorship AllegationBy TANKO ALIThe Federal Government has described the allegation by a US-basednon-profit organization, that the Nigerian government is a sponsor ofterrorism, as a disgusting distraction orchestrated by those seekingto weaken the ongoing massive onslaught against terrorism andbanditry.\n”This organization called GATE is not even worth the ink with whichits name is written.\nHow can a serious organization accuse agovernment that is tackling the twin evil of terrorism and banditrywith uncommon determination of sponsoring terrorism?\n”In the fight against terrorism, Nigeria has availed itselfcreditably by tackling home-grown terrorists with links to globalterrorist organizations.\nFittingly,Nigeria’s efforts at tackling terrorism have been hailed globally."
  },
  {
    "headline": "Queen Elizabeth sprains back, withdraws from Remembrance Service",
    "summarized_story": "Queen Elizabeth has sprained her back and will not show up at the Remembrance Service at the London cenotaph for the war dead today.\n“Her Majesty is ‘disappointed’ to miss the event”, Buckingham Palace said.\nThe service would have been the queen’s first in-person public engagement since she was advised to rest following a night in hospital last month.\nShe was also absent at a festival to remember the nation’s war dead on Saturday evening.\nElizabeth is queen of 15 other realms including Australia, Canada and New Zealand."
  },
  {
    "headline": "Edo reveals new 11 COVID-19 deaths, worst death ratio",
    "summarized_story": "After it reported a backlog of eight and 10 COVID-19 deaths in succession, Edo has reported yet another 11 deaths, raising Nigeria’s death toll to 2,960.\nIts death toll is now 272 out of 6,598 confirmed cases, a ratio of one death to 24 cases, Nigeria’s worst.\nLagos has 732 deaths out of 77,945 cases, a ratio of one death to 104 cases.\nAbuja FCT, with the third highest death toll of 223 has, like Lagos, a ratio of one death to 104 cases.\nLagos registered 11 cases, but five of them were recorded on 11 November and six on 13 November."
  },
  {
    "headline": "FG to boost innovations through collaborations - Ogbonnaya Onu",
    "summarized_story": "By Sylvester ThompsonMinister of Science, Technology and Innovation, Dr Ogbonnaya Onu, has said the federal government will engage venture capitalists, stakeholders and entrepreneurs to boost innovations in the country.\nAccording to Jesephine Ademu, Head, Press and Public Relations of the ministry, Onu said this at the commemoration of the 2021 World Science Day for Peace and Development in Lagos on Saturday.\n“As a nation, we must change our orientation and pay more attention to science for rapid development of our country.\n“By doing this, Nigeria will become self-reliant and be respected by other nations all over the world,” Onu said.\nThe minister highlighted policies being developed at different stages of implementation to include, the National Science, Technology and Innovation 2017-2030."
  },
  {
    "headline": "Disgusting distraction: Nigeria replies GATE on terrorism sponsors",
    "summarized_story": "The Federal Government said the allegation by Global Advocates for Terrorism Eradication (GATE) that its officials are sponsors of terrorism, was a disgusting distraction.\n”This organisation called GATE is not even worth the ink with which its name is written.\nHow can a serious organisation accuse a government that is tackling the twin evil of terrorism and banditry with the uncommon determination of sponsoring terrorism?\n”In the fight against terrorism, Nigeria has availed itself creditably by tackling home-grown terrorists with links to global terrorist organizations.\nFittingly, Nigeria’s efforts at tackling terrorism have been hailed globally."
  },
  {
    "headline": "Anambra Election Prophecies: Primate Ayodele Denies Chiding Fr Mbaka, Odumeje",
    "summarized_story": "Primate Elijah Ayodele, the leader of the INRI Evangelical Spiritual Church, has denied a claim that he aggressively abused Rev Fr Mbaka and Prophet Odumeje over their predictions about the just ended Anambra governorship race.\nThe reports were disseminated with the heading ‘Primate Ayodele Chides Mbaka, Odumeje Over Failed Predictions On Anambra Election’ by some national websites.\nHe said, “There is a publication making rounds that I verbally attacked Rev Fr Mbaka and Prophet Odumeje for a failed prediction on Anambra Election.\n“I have no business with any other Prophets on their Prophecies, God talks to everyone differently.\n“I urge the public to ignore and thrash any statement that says I verbally attacked some prophets for their prophecies, It never came from me."
  },
  {
    "headline": "Nigerian Soldiers Needs No Warning Against Overthrowing Buhari Government – DHQ",
    "summarized_story": "“Defense Headquarters advises soldiers against subverting Buhari’s regime,” according to a rumor circulating on social media.\nThe viral publication claiming the “Defence Headquarters has criticized a demand for the military to take over the reins of power” was replete with flagrant lies and fabrications, according to a statement signed by Brig Gen Onyema Nwachukwu.\nNwachukwu mentioned that the Army Spokesman in no time made such a statement and does not speak for the Defence Headquarters as claimed by the report.\nPart of the statement read: “However, for the sake of clarity and to keep the records straight, we wish to state that at no time did the Director, Army Public Relations, Brig Gen Onyema Nwachukwu issue any statement on the subject matter.\n“It’s therefore a figment of their imagination, which did not in anyway emanate from Brig Gen Nwachukwu."
  },
  {
    "headline": "ISWAP Attack: I’m So Sad – President Buhari Reacts To Klling Of Brig General Zirkusu, Others",
    "summarized_story": "President Muhammadu Buhari has expressed sorrow over the deaths of Brigadier General Dzarma Zirkusu and three other troops in Borno State following a fight with militants of the Islamic State of West Africa Province (ISWAP).\nThey were attacked while on their way to Askira town in the Askira Uba Local Government Area of Borno State, where the military and the ISWAP were exchanging gunfire.\nThe President in a statement shared on his Facebook page, hailed the fallen soldiers for their courage, describing their sacrifice as very rare display of gallantry for the nation.\nBuhari sent his condolences to the Chief of Staff and families of the deceased military officers.\nGeneral Zirkusu leaves us sad and devastated."
  },
  {
    "headline": "BREAKING: Islamic State, ISWAP Fighters Currently Attacking Nigerian Army Base, Borno Community",
    "summarized_story": "At a military post in Borno State’s Askira/Uba Local Government Area, suspected Islamic State of West Africa Province (ISWAP) fighters are now engaged in a gunfight with forces.\nEarly this morning, some locals stated they saw ISWAP fighters in a big convoy of gun trucks traveling along the Ngude axis towards Askira.\n“Yes, ISWAP is currently attacking Askira town.\n“My people told me that the insurgents came with about 16 gun trucks and there is confusion in the whole town now,” Engr.\nWe are outnumbered; we only have five gun trucks with us.” Yakubu said."
  },
  {
    "headline": "Breaking: Victor Osimhen, Ahmed Musa score as Super Eagles overpower Liberia in World Cup qualifier",
    "summarized_story": "Napoli striker Victor Osimhen and captain Ahmed Musa were on scoresheet as Nigeria’s Super Eagles beat Lone star of Liberia 2-0 in a World Cup qualifying match.\nThe game was decided in Tangier Morocco.\nSuper Eagles next match will be against Cape Verde that also won their encounter versus Central African Republic 2-1.\nDetails loading…"
  },
  {
    "headline": "LIVE: Ighalo dropped, Ekong captains as Rohr rolls out Super Eagles squad vs Liberia in World Cup qualifier",
    "summarized_story": "Odion Ighalo will not taste action when Super Eagles of Nigeria clash versus the Lone star of Liberia in faraway Morocco.\nDetails on the list is captured in the pictorial presentation above."
  },
  {
    "headline": "Pictures: Police dominate medal table as curtains fall on IGP Open Weightlifting Championship",
    "summarized_story": "Kogi state’s Elizabeth Ada Ayimba won gold in the 49kg women category while Uyai Aniefiok from Akwa Ibom Police Command won silver.\nIn the 55kg for women, Marvelous Ibe from FCT won gold; Olajimoke Oribamise from Ekiti State Police Command won silver while Glory Iheacho from Rivers State Police Command won bronze.\nThe gold medal in 76kg for women went to Chinonso Aniebunwa from Lagos State Command while another police lifter, Abibatu Yusuf, from Rivers State Command won the silver.\nLagos Command won gold in 81kg women category with Ifeanyi John who was the only lifter in that category.\n87kg women category gold went to Rivers State Command with Lilian Anaele whereas Ruth Galadima from Kebbi state Command won silver."
  },
  {
    "headline": "Borno Attack: Buhari Mourns Slain General, Three Other Soldiers",
    "summarized_story": "President Muhammadu Buhari has mourned the senior officer and three other soldiers that were killed in a fierce encounter with ISWAP terrorists in Borno.\nBarely 24 hours after the incident, President Buhari hailed the gallantry of the victims, saying they paid the supreme price in the insurgency war.\nGeneral Zirkusu leaves us sad and devastated.\nThe soldier in him will remain immortal.”The President also commiserated with the Chief of Army Staff, Lieutenant-General Faruk Yahaya and the Nigerian Army on the unfortunate incident.\n“I pray to the Almighty to give you and the bereaved families the strength and courage to bear this irreparable loss,” the President added."
  },
  {
    "headline": "Climate Change: COP26 Deal Clinched As Nations Rally To Compromise",
    "summarized_story": "Rich countries stood accused of failing at the COP26 summit in Glasgow to deliver much-needed finance to vulnerable states that are at risk of drought, rising seas, fire and storms.\nAs the final deal was clinched, a tearful Sharma said “I apologise for the way this process has unfolded.\nSurvivalThe final text urged nations to accelerate efforts to “phase down” unfiltered coal and “phase out” inefficient fossil fuel subsidies.\nLarge emitters China and India had opposed the mention of the polluting fuels, and the language in the final text was significantly more nuanced than earlier drafts.\nTeresa Anderson, climate policy coordinator at ActionAid International, said COP26 was “an insult to the millions of people whose lives are being torn apart by the climate crisis.”AFP"
  },
  {
    "headline": "Brigadier-General, Three Soldiers Killed As Military Battles ISWAP Terrorists In Borno",
    "summarized_story": "A senior officer and three soldiers have been killed in a fierce encounter with ISWAP terrorists in Borno, the Nigerian Army said on Saturday.\nAccording to a statement signed by army spokesperson Brigadier-General Nwachukwu, the encounter took place in Askira Uba Local Government Area of Borno State.\n“The Chief of Army Staff Lt Gen Faruk Yahaya deeply commiserates with the families and relations of the fallen heroes.\n“We thank these fallen heroes for their supreme sacrifices to the Nigerian Nation.\nThe people of Borno will remain forever grateful to them and all fallen heroes, and will remain fully supported of gallant troops currently operating in front lines.”"
  },
  {
    "headline": "Bandits Attack Zamfara Community, Kill Nine, Rustle Livestock",
    "summarized_story": "At least nine persons have been killed by bandits in Tungar Ruwa Village located in Anka Local Government Area of Zamfara State.\nThe incident was confirmed on Friday night by the spokesperson of the Zamfara State Police Command, Mohammed Shehu.\nZamfara State is notorious for bandit attacks.\nOn Sunday, gunmen suspected to be bandits attacked Rijiya village in Gusau Local Government Area of the state, killing six people and abducting several others.\nThe bandits were said to have ambushed the police operatives, killing seven of them and setting ablaze their operational vehicle."
  },
  {
    "headline": "SERAP Petitions UN Over ‘Vicious Assault On Justice Mary Odili’",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has petitioned the United Nations over what it describes as a vicious assault on Justice Mary Odili.\nThe outcome of the investigation must be made public, and the suspected perpetrators and their sponsors brought to justice.”SERAP’s petition followed the recent invasion of Justice Odili’s Maitama, Abuja residence by armed personnel.\nThese attacks are putting Nigerians’ freedoms at risk.”According to SERAP, “The current investigation by the Nigerian police fails to meet international standards, as it is neither independent nor effective.\nThere have been several violations of judicial independence and the rule of law in the country.\nThe principles of independence are the hallmarks of the rationale and the legitimacy of the judicial function in every State."
  },
  {
    "headline": "Sen. Marafa's Faction Holds APC Congress In Zamfara",
    "summarized_story": "The Zamfara State chapter of All Progressives Congress loyal to Senator Kabiru Marafa has elected it’s officers that would steer the ship of the party in the state at the ward level for the next four yearsThe Marafa’s faction conducted its congress across all the wards in the stateTVC News monitored the Congress in Tudun Wada ward in Gusau Local government area of the stateThe Congress which took place at the filin Jirgi ground was conducted in a Peaceful mannerAddressing the gathering, Engr.\nBello Ibrahim a stakeholder in the party says all aspirants for different elective positions of the party were duly screened on FridayHe adds that Marafa’s faction had it’s stakeholders meeting earlier before the commencement of the congressThough with low turnout, the party members conducted their self and elected their leaders through concensusSenator Kabiru Marafa had on Friday Condemned the move by the APC National Headquarters to conduct Ward congresses in zamfara and vow to challenge the process in court."
  },
  {
    "headline": "Gov. Matawalle's Faction Holds APC Congress Across 147 Wards in Zamfara -",
    "summarized_story": "The Zamfara State chapter of All Progressives Congress has elected officers that would steer the ship of the party in the state at the ward level for the next four yearsThe mainstream of the party which had the Governor of the State, Bello Matawalle as leader of the party conducted its congress across all the one hundred and forty seven wards in the stateThe state governor represented by the speaker of the Zamfara State House of Assembly Nasiru Mu’azu Magarya says his windows are open to any Politician willing to join in making the party great in the stateGovernor Matawalle at a brief stakeholders meeting in Government House Gusau shortly before the commencement of the ward congress said he has personally done everything humanly possible to bring all aggrieved member on board so as to move the party ahead, but all efforts yielded no resultsHe appeal to all members loyal to his faction to be calm, remain peaceful and conduct their self in an orderly manner during and after the ward congressEarlier, the APC National Headquarters Committee on party Registration, Revalidation and Congress led by Ibrahim Masari says any member of the party who did not register under it’s committee and did not participate in today’s congress under the supervision of the Committee should not consider it self as member of the ruling All Progressive Party APC in ZamfaraHe adds that the all progressive Congress is Committed to free ,fair and credible Ward Congress which will also determine how successful that of the local government and state chapter will be conductedTVC News monitored the Congress in Some wards in Tatala Mafara, Kaura Namoda, Tsafe and Gusau local government areasThe Congresses were conducted in a peaceful manner and majority of the party officials were elected through concensus by all aspirants and was accepted by all members of the party through raising up their hands."
  },
  {
    "headline": "Nigeria defeats Liberia in Tangier, stay top of Group C",
    "summarized_story": "Nigeria will meet Cape Verde on Tuesday in what will be the decider of Group C in the qualifiers for the Qatar 2022 FIFA World Cup after both emerge victorious on Saturday.\nWhile Nigeria beat Liberia 2-0 to remain top of the group with 12 points, Cape Verde came from a goal down to defeat the Central Africa Republic 2-1 to remain second with 10 points.\nOsimhen broke the deadlock in the 15th minute when he converted from the spot and Nigeria controlled the game and guarded the 1-0 lead.\nIn Praia, the hosts were stunned early when Isaac Ngoma gave the Central Africans an 11th minute lead, but responded after going into halftime a goal down.\nThey kept the push and got the winner with a quarter of an hour left after Ianique dos Santos Tavares netted the second."
  },
  {
    "headline": "Kogi Gov Condoles family of Vanguard Reporter, NUJ",
    "summarized_story": "Kogi State Governor, Alhaji Yahaya Bello has expressed sadness over the unfortunate death of Vanguard Reporter, Henry Tordue Salem who has been missing since October 13.\nThe body of Tordue, who has been missing since the night of October 13 was found at a morgue in Wuse General Hospital on Thursday.\nThe governor while expressing concerns over the circumstances surrounding the death of the Vanguard Reporter, called on the security agencies, especially the police to launch further full scale investigation into the unfortunate incident to unravel the unfortunate incident.\nHe prayed God to grant the deceased eternal rest and fortitude for the family and the NUJ family to bear the sad loss.\nThe governor urged the security agencies to intensify efforts in providing adequate security for citizens of the country."
  },
  {
    "headline": "Nigeria Under-Produced Crude Oil by 72.6m Barrels in 10 Months",
    "summarized_story": "Though 2020 was a tumultuous year for the global oil and gas industry, Nigeria produced more crude oil last year than the corresponding period of 2021.\nThe NURPC figures showed that while total crude oil and condensate of 65.9 million barrels were produced in January last year, it declined to 53 million barrels during the same period this year, a difference of a whopping 12.9 million barrels.\nFurthermore, 62.4 million barrels of both crude oil and condensates were produced in February 2020; 65.8 million barrels in March; 62.9 million barrels in April; 55.3 million barrels in May; 51.4 million barrels in June; 52.7 million barrels in July; 52.8 million barrels in August; 50 million barrels in September and 52.3 million barrels of both condensates and crude oil in October.\nIn contrast, in February this year, 49.3 million barrels of both liquid types were pumped; 54.2 million barrels in March; 50.6 million barrels in April, 51.4 million barrels in May; 49.1 million barrels in June; 50.8 million barrels in July; 47.4 million barrels in August; 45.9 million barrels in September and 47.2 million barrels in October.\nThe data showed that Nigeria’s crude oil production declined from 55.1 million barrels in January 2020 to 42.1 million barrels in 2021 and from 52.1 million barrels in February 2020 to 39.8 million barrels in February 2021."
  },
  {
    "headline": "18 Days after Launch, CBN’s eNaira Registers 488,000 Subscribers in 160 Countries",
    "summarized_story": "Barely 18 days after its launch, 488,000 consumer wallets have been on-boarded to Nigeria’s Central Bank Digital Currency (CBDC) platform known as the eNaira from over 160 countries through Google Playstore and Apple Store as of Friday.\nThis is an indication of growing enthusiasm for the central bank’s digital currency, which has been described as a game-changer.\nThe digital platform had recorded about 200,000 wallets downloads in less than one day that the portal came alive.\nNigeria is the first country in Africa and one of the first in the world to introduce digital currency.\nHe added: “Therefore, the eNaira is Nigeria’s CBDC and it is the digital equivalent of the physical Naira."
  },
  {
    "headline": "Nigeria: Monitoring Direct Primaries Has Financial, Security Implications, INEC Says",
    "summarized_story": "The commission further explained that monitoring the direct primaries of the 18 political parties registered so far would involve much staff.\nHowever, the state governors, who are opposed to direct primaries, had expressed fear over the logistical problems it would create for the commission.\nSpeaking to THISDAY on Saturday night, INEC’s National Commissioner in charge of Voter Education and Information, Mr. Festus Okoye, acknowledged that the monitoring of the direct primaries of the 18 registered political parties has security and financial implications.\n“The monitoring of direct primaries has financial and national security implications.\nOkoye further noted that INEC will aggregate the figures and design a continuity framework and matrix for monitoring of direct primaries."
  },
  {
    "headline": "12 Dockworkers in NDLEA Net for Alleged Link to N9.5bn Seized Cocaine at Lagos Port",
    "summarized_story": "The National Drug Law Enforcement Agency, NDLEA on Saturday said it is holding 12 dockworkers at the Apapa seaport in Lagos for an alleged link to the importation of 32.9 kilogrammes of cocaine worth over N9.5 billion in street value.\nA thorough search of the ship led to the recovery of 30 parcels containing cocaine, which weighed 32.9kg.\nIn line with the intelligence available to the Agency, there is a syndicate of dockworkers, crew members with apparent international conspirators who work in synergy to traffic in the illicit substances.\nWhile the substances are concealed in the shipment from the originating Port, the dockworkers assist to pick up the illicit consignment for onward delivery to the Nigerian drug barons.\nAlready, two dockworkers are now on the run, after absconding from their place of work, since the beginning of the investigation."
  },
  {
    "headline": "Super Eagles Shoot Down Liberia’s Lone Star, Set Sights on Cape Verde’s Sharks",
    "summarized_story": "Both teams spent much of the time sizing each other up, with the Super Eagles failing to seize on the momentum offered by the first goal to dominate and out-muscle the ‘hosts’ in front of an empty arena.\nThe Lone Star showed some sparkle and got behind the Eagles rearguard on two occasions only to be denied by an alert Maduka Okoye.\nWorkhorse Moses Simon toiled at the fore and at the rear throughout to keep the right side of the Super Eagles going.\nIn the 28th minute, the Super Eagles thought they had scored a second when defender Jamilu Collins strung the ball past de Souza, only to be ruled off-side by Tunisian referee Youssef Essrayri.\nOsimhen, energetic and vibrant, should have made it two for Nigeria minutes later, but shot into the sky with only de Souza to beat."
  }
]