[
  {
    "headline": "How we ended up with foot drops after injection nerve injury –Victims",
    "summarized_story": "Angela OnwuzooFoot drop also called drop foot entails having difficulty in lifting the front part of the foot.\nExperts say serious sciatic nerve injury or injection nerve palsy can result from improperly performed injections into the buttocks and cause foot drop, adding that the most common scenario for nerve damage is improper needle placement.\n“According to her, when she took me there, a private hospital, a nurse gave me an injection on my buttock.\n“My mum was told that my nerve was injured by the injection needle which they blamed on the nurse that gave me the injection.\nIn a 2016 report published in British Medical Journal titled, “Case report: An unfortunate injection,” the authors said though intramuscular injection has been used to administer medications for more than a hundred years, preventable complications such as injection nerve palsies are still prevalent in developing countries."
  },
  {
    "headline": "How we ended up with foot drops after injection nerve injury –Victims",
    "summarized_story": "Angela OnwuzooFoot drop also called drop foot entails having difficulty in lifting the front part of the foot.\nExperts say serious sciatic nerve injury or injection nerve palsy can result from improperly performed injections into the buttocks and cause foot drop, adding that the most common scenario for nerve damage is improper needle placement.\n“According to her, when she took me there, a private hospital, a nurse gave me an injection on my buttock.\n“My mum was told that my nerve was injured by the injection needle which they blamed on the nurse that gave me the injection.\nIn a 2016 report published in British Medical Journal titled, “Case report: An unfortunate injection,” the authors said though intramuscular injection has been used to administer medications for more than a hundred years, preventable complications such as injection nerve palsies are still prevalent in developing countries."
  },
  {
    "headline": "On spiritualist’s instructions, I drank urine twice daily for six months as purported cure for strange ailment –Delta lady",
    "summarized_story": "I told my mum and she said, perhaps, I was about to see my menses.\nTests and scans were done but the doctor did not seem to detect anything from the medical examination.\nOne day, while I was home alone, after much praying, I felt a sharp pain in my stomach.\nWhen I told my mum, she laughed it off because I had done over a hundred different scans but nothing was seen.\nI got some money from someone and went to the hospital and told the doctor on duty I wanted to do a scan."
  },
  {
    "headline": "On spiritualist’s instructions, I drank urine twice daily for six months as purported cure for strange ailment –Delta lady",
    "summarized_story": "I told my mum and she said, perhaps, I was about to see my menses.\nTests and scans were done but the doctor did not seem to detect anything from the medical examination.\nOne day, while I was home alone, after much praying, I felt a sharp pain in my stomach.\nWhen I told my mum, she laughed it off because I had done over a hundred different scans but nothing was seen.\nI got some money from someone and went to the hospital and told the doctor on duty I wanted to do a scan."
  },
  {
    "headline": "EXPORT PROMOTION: MAN urges FG to resume implementation of Export Expansion Grant",
    "summarized_story": "According to MAN there’s an urgent need to create plausible incentives for investment in the development of raw materials locally through the backward integration and resource based industrialization initiates.\nHe said, “We recognize an urgent need for investment and production of Active Pharmaceutical Ingredients (API) in the country; this should be adequately incentivized to encourage significant private investments.\nAhmed further recommended infrastructure development by way of ensuring commitment to increase the electricity supply from the current 10,000mw.\nFurthermore, MAN urged the government to rehabilitate existing major road corridors and construct new ones for seamless movement of raw materials to factories and finished goods to the markets.\nThe MAN review also asked the Federal Government to resuscitate the existing national refineries to produce fuels locally."
  },
  {
    "headline": "Father’s Day: Cleric urges fathers not to leave children’s training to mothers alone",
    "summarized_story": "As Nigerians mark Father’s Day, an Anglican Cleric, Ven.\nWole Ogunseyinde, has urged fathers not to leave the training of children to mothers alone.\n“In 1909, Sonora Smart Dodd, while attending a Mother’s Day celebration, felt fathers ought to be celebrated as well.\nAlso, Bishop Daniel Oluwajimade, the General Steward, Emmanuel The Saint Sabba Evangelical Mission, Ibadan, says fathers’ day recognises how important fathers are in both home and nation building.\n“There should be seminar, symposia of different levels to really eschew fathers day beyond ordinary,” he said."
  },
  {
    "headline": "2023: Adamawa PDP distributes certificate of returns to National/State House of Assembly candidates",
    "summarized_story": "By Umar Yusuf, YolaAll the 20 elected National Assembly candidates of the People’s Democratic Party (PDP) for the 2023 elections have been presented with their certificate of returns.\nSpeaking at a brief ceremony in Yola Friday, the State Chairman of the party, Barrister Shehu Tahir told the candidates to go back to their Constituencies and reconcile with their co-aspirants in the primaries.\nTahir told the candidates that unless they reconcile with their opponents in the primary election, the unity of purpose needed to win the election might be jeopardized.\nThe State PDP Chairman told the candidates that more task lies ahead of them moreso that the State has produced the presidential candidate of the party for the 2023 elections.\nShehu Tahir described Atiku Abubakar as the best of all presidential candidates and was optimistic that he will win the election."
  },
  {
    "headline": "Owo Church Attack: Group, police seek parents collaboration to forestall recurrence",
    "summarized_story": "By Miftaudeen RajiA real estate firm and pro-Yoruba group, Ojulowo Omoluabi Empire Holdings Limited and the police in Ogun State have formalized a collaboration on devising mechanisms and approach that could help avoid a repeat of the attack on the Catholic Church in Owo, Ondo State.\nThe police and the group are also seeking parents support to actualize their plan.\nDuring the visit, Mark emphasised the need for parents to be more concerned about the belief system of their children.\nMark, who condemned the attack on the worshippers at Owo in Ondo state, however stressed that the killers are enemies to the entire human race.\nHe said, “Whatever their names are, the people who killed worshippers in Owo Ondo state are not only our enemies as Yorubas but to the entire human race."
  },
  {
    "headline": "HEDA RESEARCH FINDINGS: 61% of Lagosians ignorant of state budget",
    "summarized_story": "According to him, the main purpose of the inquiry was to find out residents’ level of budget awareness in the state.\nSuraju explained that the investigation showed that 61% of the respondents were ignorant of the state’s budget and that only 5% were satisfied with its implementation.\nIt also showed that 40% of them were of the view that the state government needs to improve its performances.\nOn education, the HEDA boss said the report indicated that only 15% described the sector as effective while 43% expressed the need for improvement.\nThe investigation, according to the HEDA boss further identified employment, road network, health, education and security as priority areas."
  },
  {
    "headline": "Militants reportedly attack oil vessel, kill sailor",
    "summarized_story": "A foreign speed boat believed to be conveying oil equipment was reportedly attacked Sunday morning near Bakassi waters, controlled by Cameroon forces.\nThe militants are suspected to be armed loyalists of the Biafra Nations League, BNL which operates mostly around the Bakassi maritime creeks.\nThe foreign boat was said to be heading towards the maritime border area with Nigeria.\nNigeria and Cameroon are jointly exploring oil at the maritime borders of the Bakassi Peninsula in accordance with the Green Tree Agreements which ceded part of the Peninsula to Cameroon.\nReacting on his Facebook page, the leader of BNL, Princewill Richards said he met with leaders in Bakassi Peninsula and called for collaboration between stakeholders to stem the rising insecurity in the region."
  },
  {
    "headline": "World Father’s Day: Osinbajo celebrates Nigerian men",
    "summarized_story": "The Vice President, Professor Yemi Osinbajo has felicitated all Nigerian men on the occasion of the 2022 World Father’s Day.\nOsinbajo in a post on his social media handles on Sunday, wished all Dads, father figures and Dads-to-be a happy Father’s Day.\nThe former presidential aspirant said fathers occupy a critical position in the family as their actions and inactions affect society.\n“To the great Dads, father figures, Dads-to-be and those doubling as mentors to many out there, I wish you all a Happy Father’s Day.\nDAILY POST reports that Father’s Day was founded in the United States of America, at the Spokane in Washington YMCA, in 1910 by Sonora Smart Dodd and celebrated every June 19."
  },
  {
    "headline": "Ekiti election: APC, PDP, SDP bought votes – SERAP writes INEC",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has asked the Independent National Electoral Commission (INEC) to probe financial inducements during the Ekiti election.\nThe organization, in a letter, issued a one-week ultimatum to the INEC Chairman, Professor Mahmood Yakubu to commence the probe.\nSERAP highlighted the Ekiti election reports of negotiations for prices for votes and payments as well as bags of foodstuff shared after votes were cast.\n“Agents of the All Progressives Congress (APC), Peoples Democratic Party (PDP) and Social Democratic Party (SDP) were reportedly involved in buying votes across the state.\nThe letter, which demanded that INEC take measures within seven days, threatened to take legal action if nothing is done."
  },
  {
    "headline": "APC: Replacing Bashir Machina’s name with Ahmad Lawan’s, unconstitutional, fraudulent – Human rights lawyer",
    "summarized_story": "Pelumi Olajengbesi, an Abuja-based human rights lawyer, has described the replacement of the name of Bashir Machina, the Yobe North Senatorial candidate of the All Progressive Congress (APC) with that of the Senate President, Ahmed Lawan, as unconstitutional and fraudulent.\nMachina, who was declared the APC candidate at the Yobe North senatorial primary election, had stated emphatically that he would not step down for the Senate President in 2023 general elections.\nMachina’s name, however, was replaced by Lawan’s on the list of Yobe senatorial candidates sent from the APC to the Independent National Electoral Commission.\nAccording to the statement, the APC has disgraced and embarrassed itself as a shameless party with no respect for constitutional democracy which President Muhammadu Buhari preaches.\nThe human rights lawyer expressed worry that it is this sit-tight syndrome that has destroyed democracy in Nigeria and Africa as a whole."
  },
  {
    "headline": "Justify govt’s investment in your employment training – NDE to C’River youths",
    "summarized_story": "The federal government has charged youths in Cross River State to do all they can to justify the huge expenses on their training.\nOver the weekend, 540 unemployed youths across the 18 LGAs of the state were selected for various vocational skills training by the National Directorate for Employment (NDE).\nRepresented by the State Coordinator of NDE, Udam Gabriel Ugbashi, the Director-General asked the youths to take their training seriously.\n“It is meant for 360 unemployed youths who will participate in Basic Vocational skills training and 180 participants on Advanced Vocational Skills training across the 18 Local Government Areas of the State.\n“The skills include Domestic Skills like Fashion Design, Hair Dressing, and makeup while the technical skills include plumbing, television/radio repairs, GSM and Electrical installation.”"
  },
  {
    "headline": "Buhari congratulates Ekiti Gov-elect Oyebanji The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari has congratulated the winner of Saturday’s Ekiti governorship election and flag bearer of the ruling All Progressives Congress (APC), Biodun Oyebanji, for emerging victorious.\nHe urged him to be magnanimous in victory in the interest of the people of the State.\nBuhari also rejoices with the APC chairman, Abdulahi Adamu, and the National Working Committee for the victory, the first under the tenure of the newly elected executives of the party.\nThe victory of our party in Ekiti is an indication of the confidence of Nigerians in the ability of our great party to deliver quality governance to all,” the President said.\nBuhari also felicitates with the people of Ekiti State for the smooth conduct of the election, affirming hey are the real victors as they have been able to freely choose their leader for the next four years."
  },
  {
    "headline": "INEC declares Oyebanji Ekiti Gov-elect The Nation Newspaper",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Congress (APC) Mr. Biodun Oyebanji winner of Ekiti governorship poll.\nOyetola polled 187,058 votes to emerge the winner while the standard bearer of the Social Democratic Party (SDP) Engr.\nWhile Oyebanji secured landslide victory in 15 local areas, Kolawole won Efon local government where he hails from.\nOthers are Ekiti Southwest, Oye, Emure, Ise/Orun and Ekiti East local government areas.\nAnnouncing the results at the early hours of Sunday, the Returning Officer, Prof. Kayode Adebowale, said the APC candidate ,Oyebanji, scored the highest number of votes to win the election."
  },
  {
    "headline": "Ekiti 2022: Olujimi loses polling unit to APC The Nation Newspaper",
    "summarized_story": "Senator Biodun Olujimi (Ekiti South) on Saturday lost at her ward 07, unit 07, Wesley United Primary School in Ekiti East council area.\nAccording to the Presiding Officer, the All Progressive Congress(APC) polled 141 votes while the People Democratic Party(PDP) and Social Democratic Party(SDP) garnered 110 and 46 votes respectively.\nAt unit 32, Ward 09, Olorunsogo Area, Ado-Ekiti, SDP scored 105 votes while APC, PDP ADP, ADC, APP, YPP garnered 56, 13, 5, 1, 3 and 1 respectively."
  },
  {
    "headline": "APC wins in SDP Deputy Gov candidate's unit The Nation Newspaper",
    "summarized_story": "The All Progressives Congress (APC) has defeated the Social Democratic Party (SDP) in Deputy Governor candidate’s Adebisi Egbeyemi’s Unit 014 in L.A Primary School, Akomolede, Ado-Ekiti.\nThe APC polled 109 votes; the SDP scored 86.\nThe PDP came third with 14 votes.\nIn Unit 007, Ward 10 in Okesa, Ado-Ekiti, the APC scored 135 votes.\nThe SDP got 59 votes while the PDP scored 24."
  },
  {
    "headline": "BREAKING: Gov Fayemi wins polling unit for APC The Nation Newspaper",
    "summarized_story": "Ekiti Governor Kayode Fayemi won his polling unit, unit 09, Ogilolo ward in Isan-Ekiti, Oye local government areas of for the ruling All Progressive Congress (APC) candidate, Biodun Oyebanji.\nThe APC garnered 154 while the SDP and PDP candidates scored 3 and 4 votes respectively.\nThe ADP got one vote while 6 votes were voided."
  },
  {
    "headline": "Many feared dead as 3-storey building collapses in Abia",
    "summarized_story": "From Okey Sampson, UmuahiaMany people feared dead in Umuahia, the Abia State capital following the collapse of an uncompleted 3-storey building in the area Sunday morning.\nThe building located at Ahiaeke, along Ikot Ekpene road by Ahiaeke Community Market, Umuahia, collapsed, reportedly trapping many construction workers, some of whom are feared dead.\nA community leader who spoke with journalists over the incident revealed that the building has been under construction since the 90’s.\nPartner with me, let's get you making N500K to N500K a month!\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "Exploit “our NPF rescue me app”, says Anambra Police Command",
    "summarized_story": "(NAN)The Anambra Police Command has reiterated its commitment to secure the lives and property of Anambra residents, and urged the public to make maximum use of the “NPF rescue me app”.\nThe state command’s Public Relations Officer, DSP Tochukwu Ikenga, made the disclosure in an interview with The News Agency of Nigeria (NAN) in Awka on Saturday.\nIkenga urged the public to make use of the free download of the “NPF rescue me app” which is available both on Android and Apple IOS, for Android and iPhone users respectively.\nHe said that the command could also be reached on 07039194332 for prompt responses irrespective of the time of call.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "Buhari congratulates Ekiti governor-elect Oyebanji",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has congratulated Biodun Oyebanji, the candidate of the All Progressives Congress (APC), declared governor-elect in Saturday’s Ekiti State Gubernatorial election.\nPresident Buhari said he also rejoices with the APC chairman, Abdullahi Adamu, and the National Working Committee for the victory, the first under the tenure of the newly elected executives of the party.\nThe victory of our party in Ekiti is an indication of the confidence of Nigerians in the ability of our great party to deliver quality governance to all,” he said.\nPresident Buhari also felicitated with the people of Ekiti State for the smooth conduct of the election, affirming that they are the real victors as they have been able to freely choose their leader for the next four years.\nPartner with me, let's get you making N500K to N500K a month!"
  },
  {
    "headline": "2023: Military to sustain peace North East-Gen Irabor",
    "summarized_story": "General Irabor spoke to Defence Correspondents in Lagos during the passing out ceremony of discharging Trainees of the Nigerian Armed Forces Resettlement Centre (NAFRC) Course 1, 2022 Stream 2.\nSo, as you retire into the larger society, please beware of subversive elements within your environment and do not associate with them in any form.\n“As our ambassadors, always remember that the Armed Forces of Nigeria remains your primary constituency.\n“Your training has exposed you to several vocational opportunities, entrepreneurship procedures and general managerial skills to alleviate the above mentioned pitfalls for a meaningful life in retirement.\nIrabor encouraged them to justify the magnanimity of President Muhammadu Buhari who had continued to support the armed forces, most especially, the retiring members as seen in the enhanced welfare packages."
  },
  {
    "headline": "BREAKING: INEC declares Oyebanji winner of Ekiti governorship election",
    "summarized_story": "The Independent National Electoral Commission has declared the candidate of the All Progressives Congress, Biodun Oyebanji, the winner of the Ekiti State governorship election.\nDo not miss the Vital Information, it goes off in 2 days!\nOut of the 360,753 votes cast, the total valid votes in the election were 351,865.\nMore details soon…Partner with me, let's get you making N500K to N500K a month!\nSkills open the doors to financial opportunities Click here to learn it ."
  },
  {
    "headline": "In Landslide Victory, APC Wins Ekiti Governorship Election as Vote-buying Mars Poll",
    "summarized_story": "The governorship election, which was held under a calm and peaceful atmosphere, also recorded a large turnout of voters.\nThe winner of the governorship election, Oyebanji, is a former Secretary to the State Government (SSG), to Governor Kayode Fayemi.\nEFCC Arrests Vote Buyers, Election Calm, PeacefulFollowing the widespread vote-buying, which characterised the governorship election, the operatives of the Economic and Financial Crimes Commission (EFCC) arrested persons suspected to be engaged in vote-buying in the poll.\nSituation Room noted that the election was generally peaceful, with voters civilly conducting themselves in most of the polling units.\nMeanwhile, the Socio-Economic Rights and Accountability Project (SERAP) has asked INEC to prosecute all those involved in vote-buying in the governorship election."
  },
  {
    "headline": "Breaking: APC’s Oyebanji Wins Ekiti Guber Election",
    "summarized_story": "All Progressives Congress Governorship candidate, Biodun Abayomi Oyebanji, has won the Ekiti Governorship Election.\nHe polled 187,057 votes.Oyebanji won in 14 of the 16 local government areas in the election conducted on Saturday.\nHis closest rival, Segun Adebayo Oni of the Social Democratic Party, polled 82,211 votes.\nOni won in Moba local government area.Mr.\nBisi Kolawole of the Peoples Democratic Party scored 67,457 votes to emerge third in the race."
  },
  {
    "headline": "Peter Obi and the Last ‘Big Men’",
    "summarized_story": "Mr. Peter Obi has emerged as both a generational shift and a redefinition of both political message and medium.\nAs a rule, civilian political Big Men and Big Generals do not sleep on the same bed.\nThe real unexpected tale from our season of presidential nomination primaries is the emergence of Mr. Peter Obi.\nThe Peter Obi phenomenon is a timely reversal of the old African Big Man narrative.\nMr. Peter Obi has come to serve notice on our behalf: Bola Tinubu and Atiku Abubakar (whoever wins in 2023) are perhaps the last Big Men that will rule Nigeria."
  },
  {
    "headline": "EKITI GOVERNORSHIP ELECTION RESULTS 2022 (As announced by INEC)",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Live Updates: Ekiti Governorship Election 2022",
    "summarized_story": "The minister said that he would not have lost the 2003 election, if the election had been credible like the ongoing governorship election in the state.\nOyebanji spoke in Ikogosi Ekiti, Ekiti West Local Government Area of Ekiti State after voting at Okelele ward 06 unit 003 in the town.\n*At Ward 13, unit 01, Itanla beside delight hotel, Ilawe road, Ado Ekiti there is confusion as to whether their polling unit has been moved.\nIn some units in Ado Ekiti, Ilawe, Igede and Iyin Ekiti, voters were being accredited with the aide of Bimodal Voter Authentication System(BVAS) and given the ballots to vote.\nThe influence of Segun Oni’s Deputy, Ladi Owolabi in Ado Ekiti is also enormous."
  },
  {
    "headline": "#EkitiDecides: Abiodun Oyebanji Of APC Wins Ekiti Governorship Election",
    "summarized_story": "Abiodun Oyebanji, candidate of the All Progressives Congress, has emerged the winner of the 2022 Ekiti governorship election.\nOyebanji was announced as the winner by Kayode Adebowale, returning officer for the election, after amassing a total of 187,057 votes.\n“Oyebanji, having scored the highest number of votes is hereby declared the winner and returned elected as the governor-elect of Ekiti State,\" the returning officer said.\nSee Also Elections Highest Bidder: How Rampant Vote-buying Marred Ekiti Governorship ElectionThe election also saw widespread of vote-buying especially by the APC.\nSee Also Breaking News LIVE UPDATE: Ekiti State Governorship Election"
  },
  {
    "headline": "#EkitiDecides: Abiodun Oyebanji Of APC Wins Ekiti Governorship Election",
    "summarized_story": "Abiodun Oyebanji, candidate of the All Progressives Congress, has emerged the winner of the 2022 Ekiti governorship election.\nOyebanji was announced as the winner by Kayode Adebowale, returning officer for the election, after amassing a total of 187,057 votes.\n“Oyebanji, having scored the highest number of votes is hereby declared the winner and returned elected as the governor-elect of Ekiti State,\" the returning officer said.\nSee Also Elections Highest Bidder: How Rampant Vote-buying Marred Ekiti Governorship ElectionThe election also saw widespread of vote-buying especially by the APC.\nSee Also Breaking News LIVE UPDATE: Ekiti State Governorship Election"
  },
  {
    "headline": "LIVE UPDATE: Ekiti State Governorship Election",
    "summarized_story": "LIVE UPDATE: Ekiti State Governorship ElectionHere, we'll give you a blow-by-blow account of how proceedings are unfolding in all 2,445 polling units where voting will take place."
  },
  {
    "headline": "LIVE UPDATE: Ekiti State Governorship Election",
    "summarized_story": "LIVE UPDATE: Ekiti State Governorship ElectionHere, we'll give you a blow-by-blow account of how proceedings are unfolding in all 2,445 polling units where voting will take place."
  },
  {
    "headline": "Nigerian American Student Gets Accepted Into 15 Schools Including Harvard, Yale, Receives $2M In Scholarship Offers",
    "summarized_story": "A Nigerian American student, Rotimi Kukoyi, has been accepted into 15 universities including Harvard University, Yale University, and Stanford University.\n\"A lot of them are older and they're like seniors or juniors that applied to many prestigious schools (and) a lot of them are attending prestigious universities now.\nCOVID-19 is what inspired Kukoyi to study public health and he said he wants to evoke change on both small-scale and large-scale levels.\n\"COVID really sparked (my interest in public health) because that was the first time that I really saw how clear the health inequities were,\" Kukoyi told ABC news.\nI suppose a lot of people in the pursuit of their own goals can kind of forget what it's all about.\""
  },
  {
    "headline": "Ekiti election: Official results reflect votes cast at polling units, says YIAGA",
    "summarized_story": "YIAGA Africa, a civil society organisation (CSO), says the official results released by the Independent National Electoral Commission (INEC) for the Ekiti governorship election, reflect the votes cast at the polling units.\n“Had the official results been changed at the ward, LGA or state collation centres, the official results would not have fallen within the Yiaga Africa WTV estimated ranges.\nBecause the official results fall within the estimated ranges, candidates, parties, and voters should have confidence the official results for the Ekiti 2022 gubernatorial election reflect the ballots cast at polling units on Saturday, June 18,” the report reads.\n“Yiaga Africa is able to estimate that turnout is between 35.7% and 38.7% (37.2% ± 1.5%), while INEC’s official result is 36.47%.\nIn addition, Yiaga Africa calls on INEC to audit the newly created polling units and ensure equitable distribution of voters to the polling units."
  },
  {
    "headline": "Ekiti election: Official results reflect votes cast at polling units, says YIAGA",
    "summarized_story": "YIAGA Africa, a civil society organisation (CSO), says the official results released by the Independent National Electoral Commission (INEC) for the Ekiti governorship election, reflect the votes cast at the polling units.\n“Had the official results been changed at the ward, LGA or state collation centres, the official results would not have fallen within the Yiaga Africa WTV estimated ranges.\nBecause the official results fall within the estimated ranges, candidates, parties, and voters should have confidence the official results for the Ekiti 2022 gubernatorial election reflect the ballots cast at polling units on Saturday, June 18,” the report reads.\n“Yiaga Africa is able to estimate that turnout is between 35.7% and 38.7% (37.2% ± 1.5%), while INEC’s official result is 36.47%.\nIn addition, Yiaga Africa calls on INEC to audit the newly created polling units and ensure equitable distribution of voters to the polling units."
  },
  {
    "headline": "Lawyer: Removal of Machina's name for Lawan's shows APC supports illegality",
    "summarized_story": "Pelumi Olajengbesi, human rights lawyer, says the submission of Ahmad Lawan’s name as the candidate of the All Progressives Congress (APC) for Yobe north senatorial district shows the party has no “respect for constitutional democracy”.\nTheCable had reported that Lawan, senate president, was listed as the APC senatorial candidate for Yobe north, without participating in the senatorial primary election.\nBashir Machina, who won the APC primary election for the district, insisted that he would not step down for the senate president.\nLawan had contested for the APC presidential ticket, but lost to Bola Tinubu who secured 1,271 votes to clinch the party’s presidential ticket.\n“Recall that similar cases have been recorded with the likes of other APC presidential aspirants including Godswill Akpabio, Dave Umahi, and Ibikunle Amosun."
  },
  {
    "headline": "Lawyer: Removal of Machina's name for Lawan's shows APC supports illegality",
    "summarized_story": "Pelumi Olajengbesi, human rights lawyer, says the submission of Ahmad Lawan’s name as the candidate of the All Progressives Congress (APC) for Yobe north senatorial district shows the party has no “respect for constitutional democracy”.\nTheCable had reported that Lawan, senate president, was listed as the APC senatorial candidate for Yobe north, without participating in the senatorial primary election.\nBashir Machina, who won the APC primary election for the district, insisted that he would not step down for the senate president.\nLawan had contested for the APC presidential ticket, but lost to Bola Tinubu who secured 1,271 votes to clinch the party’s presidential ticket.\n“Recall that similar cases have been recorded with the likes of other APC presidential aspirants including Godswill Akpabio, Dave Umahi, and Ibikunle Amosun."
  },
  {
    "headline": "Buhari: Oyebanji's victory good omen for APC in 2023 elections",
    "summarized_story": "President Muhammadu Buhari says Biodun Oyebanji’s victory in the Ekiti governorship election is a good omen for the APC in the 2023 elections.\nAdvertisementBuhari said Oyebanji’s victory is a well-deserved “considering his contributions to the development of Ekiti State and the APC, over the years”.\n“I urge him to be magnanimous in victory, in the interest of the people of Ekiti State.\nThe victory of our party in Ekiti is an indication of the confidence of Nigerians in the ability of our great party to deliver quality governance to all.\nAdvertisement“All APC members across and outside the country should see this victory as a good omen for the 2023 general elections, and work assiduously to ensure the party’s victory, continuing the trend with Osun State next month."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "Abena, a voice assistant wants to preserve African languages",
    "summarized_story": "But these voice technologies support only Western languages and are unavailable in African languages because of the low-revenue opportunities in African markets.\n“Working on voice tech for African languages has been a completely different ball game.\nHe spent 6 years building Abena AI, and released it in the Google Play Store this April as a Mobobi product.\nAbena AI works with smart lights, smart plugs, and other smart home devices.\n“The feedback from a few people who tried Abena AI out before it was released kept us going."
  },
  {
    "headline": "Meet 11 female founders making strides in Africa",
    "summarized_story": "This article aims to recognize some African female founders making great strides across various industries and sectors on the continent.\nMeet 11 African female founders we are rooting:Sethebe Manake – Botswana 🇧🇼Image source: Sethebe ManakeMy name is Sethebe Manake (she/her) and I am a real-estate expert turned tech entrepreneur who enjoys dancing and game nights.\nLinkedIn: Neema IyerTao Laine Boyle – South Africa 🇿🇦Image source: Tao BoyleMy name is Tao Boyle (she/her).\nThato Schermer – South Africa 🇿🇦Image source: Thato SchermerMy Name is Thato Schermer (she/her) and I’m the Founder of Zoie Health Technologies.\nI graduated from the University of Cape Town (South Africa) and the University of California (Los Angeles) with a triple major in computer science, genetics, and biochemistry."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "2023: Five lessons from Ekiti governoship polls",
    "summarized_story": "Following the conclusion of the 2022 gubernatorial election of Ekiti State, the following four points stand out as lessons for the conduct of elections in the country.\nLow voter turnoutTurnout was low despite the noise about voter anger.\nElectronic results transmission is effectiveINEC was fast in vote tallying and subsequent declaration of a governorship election.\nThere was desperation to openly buy votes as other routes of election manipulation especially in votes transmission by INEC appear blocked by e-transmission.\nBallot box snatching reducedFinally no rampant capture of voter ballot boxes and result sheets as this will be useless given e-transmission of results."
  },
  {
    "headline": "Guess work as Fayemi prepares exit note: What future?",
    "summarized_story": "Observers say that the only hope for him to remain politically relevant could be if his party wins the presidential election in which case he could be given a ministerial slot.\nFayemi was minister of Solid Mineral Development before he stepped back to Ekiti to contest the 2018 gubernatorial election and won.\nHaving nursed and helped Oyebanji to win a resounding victory at the election, Fayemi must however, avoid the mistake of his colleagues who failed to realise that yesterday is no longer today.\nAfter his service year, he served as a Research Officer at Development & Management Consultants in Ikeja between 1987-1989.\nNow, with a robust international exposure, would Fayemi return to his forte in the academia of continue to loiter on the corridors of power."
  },
  {
    "headline": "Life as the art of deal-making; the life and times of Arthur Nzeribe (1938-2022)",
    "summarized_story": "Nigeria as a nation, and Nigerians as a people, are not good at stock-taking.\nIt includes military coups, and IPOB and herdsmen, and warped events that have led the country to its present sad pass.\nThe Nigerian nation itself, it seems, is founded on a fragile lie, and if the roots of the structure are scrutinised too closely, there is a realistic fear that the whole superstructure could crumble.\nArthur, who was always smartly dressed and perfectly groomed, wormed his way into the affections of some African leaders.\nHis lasting impact on Nigerian history was to set up a shadowy, quaintly named organisation known as the Association for Better Nigeria (ABN)."
  },
  {
    "headline": "Chronic Kidney Diseases: Expert tasks Nigerians on healthy life style – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAlhaji Ibrahim Abdullahi, a human resource expert has called on Nigerians to live a healthy life to prevent chronic kidney diseases.\nAbdullahi made the call at an event organised by Nigerian Association of Nephrologist, to mark the World Kidney Day on Saturday in Ilorin, Kwara.\nAccording to Abdullahi, who is also a fellow of Chartered Institute of Personnel Management of Nigeria, kidney disease is rated as 5th source of death the world over.\nHe, however, called on federal, states and local governments in the country to redesign the nation’s healthcare system with a view to carrying out effective implementation.]\nAccording to him, these are responsible for the brain-drain, where better Nigerian health professionals are seeking better environment in other parts of the world."
  },
  {
    "headline": "NCoS tasks officers on securing custodial centres – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Controller General (CG), Nigerian Correctional Service (NCoS), Mr Haliru Nababa, has urged newly-decorated senior officers of the service to intensify operations to curb security challenges facing the custodial centres.\nAt the decoration of promoted senior officers of the service on Friday in Abuja, Nababa said that much is expected from those to whom much is given.\nIn his remark, the Minister of interior, Rauf Aregbesola, congratulated the newly-decorated senior officers on their new ranks.\nOne of the newly promoted senior officers, Assistant Controller General, Noel Alewon, on behalf of the decorated officers, assured the Controller General that the promotion would spur them to do more.\nHe assured that the promoted officers would do their best to ensure that the highest security is provided for the custodial centres."
  },
  {
    "headline": "NPA targets ISO certification with procurement management system implementation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestDr Ibby Iyama, the Country Director, Renner and Renner Consulting Ltd., has tasked the Nigerian Ports Authority (NPA) on Procurement Management System (PMS) for International Organisation for Standardisation (ISO) certification.\nIyama made this known at the NPA Procurement Strategic Retreat on Saturday in Lagos.\n“Part of the reasons why we have embarked on this retreat is to implement the PMS at the procurement department of NPA.\nIyama said that the Procurement Act was the Bible of all procurement departments in government agencies.\nShe said that it was critical for all the staff to be up to date with the Procurement Act."
  },
  {
    "headline": "APC candidate, Oyebanji, wins Ekiti Governorship election – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestMr Biodun Oyebanji, the candidate of the All Progressives Congress (APC), has been declared the winner of the Saturday’s Ekiti Governorship election.\nDeclaring the winner, Prof. Oyebode Adebowale, the Independent National Electoral Commission (INEC) Returning Officer, said Oyebanji polled a total of 187, 057 to win the election.\n“That I, Prof. Oyebode Adebowale, hereby certify that I am the Returning Officer of the Ekiti 2022 Governorship Election held on June 18.\n“That Biodun Oyebanji, the candidate of APC, having certified the requirements of the law, is hereby declared winner and returned,” Adebowale declared.\nThe rest were, Young Progressives Party (YPP)-618; All Peoples Party (APP) polled 1,980 and Zenith Labour Party,(ZLP) polled 282; Peoples Redemption Party (PRP) polled 856."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Ekiti gov poll: PDP candidate concedes defeat, congratulates Oyebanji",
    "summarized_story": "The candidate of the Peoples Democratic Party (PDP) in Saturday governorship election in Ekiti State, Otunba Olabisi Kolawole, has congratulated his All Progressives Congress (APC) counterpart, Biodun Oyebanji on his victory at the poll.\nKolawole in a congratulatory letter he personally signed, was addressed to the APC candidate and made available to newsmen in Efon-Alaaye on Sunday.\n“Following the announcement of your victory in the June 18 Ekiti Governorship Election by the Independent National Electoral Commission (INEC), I hereby write to congratulate you accordingly.\n“These were the motivation for my own ambition in the governorship of Ekiti State which I feel strongly to reiterate here in view of the precarious situations of our people at the moment.\nOyebanji had won Saturday’s election with 187, 057 vote, while the candidate of the SDP, Segun Oni came second with 82, 211 votes and PDP’s Kolawole third with 67,457 votes."
  },
  {
    "headline": "Inflation will push another 15m Nigerians into poverty – World Bank",
    "summarized_story": "The World Bank has said that inflation shock is projected to push about 15 million more Nigerians into poverty between 2020 and 2022.\nAlthough the World Bank says inflation in 2022 is projected to be 15.5 per cent, Nigeria’s inflation as of May this year is 17.71 per cent, which is higher than the World Bank’s projection.\nWorld Bank economists, Jonathan Lain and Jakob Engel, have said that rising inflation, persistent population growth, the COVID-19 pandemic, and the war in Ukraine are threatening Nigeria’s poverty reduction aspiration.\nIn its ‘A Better Future for All Nigerians: 2022 Nigeria Poverty Assessment’ report, the World Bank said that poverty reduction stagnated since 2015, with more Nigerians falling below the poverty line over the years.\nThe World Bank also warned that many non-poor Nigerians were only one small shock away from falling into poverty."
  },
  {
    "headline": "How Ekiti governorship election was fought, won and lost",
    "summarized_story": "Olusesan LaoyeAt last the Ekiti governorship election has been held and a winner has emerged.\nIt was a history making election, which saw a political party taking over from itself, which has never happened before in the history of the state.\nThis means that the incumbent governor Kayode Fayemi would hand over to his anointed political son in the same political party, which is historical in the politics of Ekiti State.\nAnother big wig in Ekiti politics who would be seriously battered with the result of the election is former Governor Ayodele Fayose.\nThe governorship candidate of the SDP, Oni had said the same thing on Friday afternoon claiming that his members were being arrested and taken to an unknown destination."
  },
  {
    "headline": "Telcos lose 12.33m internet subscribers to NIN-SIM linkage in 2021",
    "summarized_story": "The report read in part, “As at December, 2021, the total active Internet subscriptions decreased from 154,289,727 subscriptions as at December 2020 to 141,959,496 subscriptions.\nThis indicates a (eight per cent) decline in Total Active Internet Subscriptions Year on Year”.\nMTN Nigeria Plc recorded the biggest loss of Internet subscribers (6,546,878) in 2021.\nAirtel lost 3,761,109 Internet subscribers, as the number of Internet subscribers dropped to 37,526,624 at the end of the year from 41,287,733 recorded in the previous year.\nGlobacom lost 581,390 Internet subscribers, as the number of its Internet subscribers fell to 39,525,269 at the end of the year from 40,106,659."
  },
  {
    "headline": "APC declared winner of Ekiti governorship election",
    "summarized_story": "…wins 15 out of 16 LGAs, PDP 1, SDP 0The All Progressives Congress (APC) candidate in Saturday’s governorship election in Ekiti State, Biodun Oyebanji, has been declared winner of the Ekiti governorship election.\nThe returning officer for the election, Prof. Kayode Oyebode, announced the result in the early hours of Sunday.\nOyebanji won 15 out of the 16 LGAs in the state, while the PDP candidate, Kolawole, won the remaining 1.\nEKITI WEST LGAPC-15,322PDP -3386SDP-38637.\nEKITI EAST LGAAPC 12, 099PDP 5, 230SDP."
  },
  {
    "headline": "Nigeria, China Strengthen Film Industry To Fight Poverty",
    "summarized_story": "The People’s Republic of China and Nigeria have mapped out ways to strengthen the movie industries of both countries as collaborative means of poverty alleviation in Nigeria.\nXuda said “As we know, both China and Nigeria are large countries with developed film and television industries.\nIn 2021, China’s movie industry produced over 700 movies.\n“China and Nigeria have huge potential for cooperation in the film industry.\nNigeria film production ranks among the best in the world and China is the world’s film industry market and so we can see the collaboration,” she said, adding that the Nigeria-China collaboration in the industry has a brighter future."
  },
  {
    "headline": "Nigeria, China Strengthen Film Industry To Fight Poverty",
    "summarized_story": "The People’s Republic of China and Nigeria have mapped out ways to strengthen the movie industries of both countries as collaborative means of poverty alleviation in Nigeria.\nXuda said “As we know, both China and Nigeria are large countries with developed film and television industries.\nIn 2021, China’s movie industry produced over 700 movies.\n“China and Nigeria have huge potential for cooperation in the film industry.\nNigeria film production ranks among the best in the world and China is the world’s film industry market and so we can see the collaboration,” she said, adding that the Nigeria-China collaboration in the industry has a brighter future."
  },
  {
    "headline": "Closure Of National Industrial Court And Impending Justice Delay",
    "summarized_story": "ADVERTISEMENTFollowing the attack on the staff of the NICN, the president of the National Industrial Court of Nigeria had issued a directive shutting down the Owerri division of the National Industrial Court till further notice for the safety of the lives of his staff.\npresident of the National Industrial Court of Nigeria, Hon Justice B B Kanyip, PhD, to inform you that the Owerri Judicial Division of the Court has been closed down till further notice.\nA former deputy governor of the state, Prince Eze Madumere had secured an absolute garnishee Order from the National Industrial Court in Owerri against the bank in a suit.\nThough the banks have been unsealed, activities are yet to return to normalcy at the National Industrial Court as the place is still under lock and key while lawyers scramble for new hearing dates.\nChinedu Agu, the NBA scribe had said “rather than challenge the same judgment in the Court of Appeal, the Imo State Government, obtained a Court Order from a High Court sitting in Owerri (a court of coordinate jurisdiction) restraining Zenith Bank Plc from obeying the judgment of the National Industrial Court, Owerri."
  },
  {
    "headline": "Closure Of National Industrial Court And Impending Justice Delay",
    "summarized_story": "ADVERTISEMENTFollowing the attack on the staff of the NICN, the president of the National Industrial Court of Nigeria had issued a directive shutting down the Owerri division of the National Industrial Court till further notice for the safety of the lives of his staff.\npresident of the National Industrial Court of Nigeria, Hon Justice B B Kanyip, PhD, to inform you that the Owerri Judicial Division of the Court has been closed down till further notice.\nA former deputy governor of the state, Prince Eze Madumere had secured an absolute garnishee Order from the National Industrial Court in Owerri against the bank in a suit.\nThough the banks have been unsealed, activities are yet to return to normalcy at the National Industrial Court as the place is still under lock and key while lawyers scramble for new hearing dates.\nChinedu Agu, the NBA scribe had said “rather than challenge the same judgment in the Court of Appeal, the Imo State Government, obtained a Court Order from a High Court sitting in Owerri (a court of coordinate jurisdiction) restraining Zenith Bank Plc from obeying the judgment of the National Industrial Court, Owerri."
  },
  {
    "headline": "Ekiti governor elect Oyebanji thanks voters in few words",
    "summarized_story": "Biodun Oyebanji the governor-elect of Ekiti state has thanked the voters who gave him a resounding victory on Saturday.\nIn a post on Facebook, Oyebanji was taciturn in his appreciation.\nHe simply wrote: “Thank You Ekiti Kete”.\nIn addition, he posted his photo at Tuesday’s campaign rally in Ado-Ekiti, holding the broom.\nOyebanji, the anointed candidate of the outgoing governor, Kayode Fayemi, polled 187,057 votes to defeat his closest rival, Segun Oni of the Social Democratic Party, who polled 82,211 votes."
  },
  {
    "headline": "17-year-old released from prison two days ago rearrested (video)",
    "summarized_story": "A 17-year-old who was released from prison two days ago has been arrested again by men of the Lagos state police command.\nThe boy was rearrested after he broke into someone’s house to steal.\nPosting videos of the suspect on Twitter, the spokesperson of the command, SP Benjamin Hundeyin, wrote”This 17-year-old was released from prison two days ago after doing two years for cultism.\nNB: His lips…he had scuffles with neighbors who apprehended him, not the Police.”This 17 year old was released from prison two days ago after doing two years for cultism.\n1/2 pic.twitter.com/Grqd4gdBQV — SP Benjamin Hundeyin (@BenHundeyin) June 19, 2022However, the report did not sit well with Nigerians."
  },
  {
    "headline": "PDP's Bisi Kolawole congratulates governor-elect Oyebanji",
    "summarized_story": "The Peoples Democratic Party’s candidate in the Saturday governorship election in Ekiti state, Otunba Olabisi Kolawole, has congratulated the All Progressives Congress (APC) candidate, Mr. Biodun Oyebanji on his victory at the poll.\nKolawole sent his congratulations via a letter he personally signed on Sunday.\nHe said: “Following the announcement of your victory in the June 18 Ekiti Governorship Election by the Independent National Electoral Commission (INEC), I hereby write to congratulate you accordingly.\n“These were the motivation for my own ambition in the governorship of Ekiti State which I feel strongly to reiterate here in view of the precarious situations of our people at the moment.\nOyebanji won Saturday’s election with 187, 057 votes, while the candidate of the Social Democratic Party (SDP), Chief Segun Oni got 82, 211 votes, and Kolawole came third with 67,457 votes."
  },
  {
    "headline": "Buhari to Oyebanji: Be magnanimous in victory",
    "summarized_story": "By Ismaila ChafePresident Muhammadu Buhari has congratulated Biodun Oyebanji of the All Progressives Congress (APC) for his electoral victory in Saturday’s Ekiti State governorship election.\nAccording to the President, the victory is well deserved considering Oyebanji’s contributions to the development of the state and the party, before his nomination as the standard-bearer.\nHe urged Oyebanji to be magnanimous in victory in the interest of the people of the state.\nBuhari also rejoiced with the APC Chairman, Sen.Abdulahi Adamu, and the National Working Committee for the victory, the first under the tenure of the newly elected executives of the party.\nOyebanji polled 187, 057 votes to win the election and was declared the winner by Prof. Oyebode Adebowale, the INEC Returning Officer for the Ekiti State Governorship election."
  },
  {
    "headline": "Former NFF Secretary-General Sani Toro kidnapped",
    "summarized_story": "The former Secretary-General of the Nigeria Football Federation (NFF), Sani Toro, has been kidnapped.\nThe former NFF scribe was kidnapped on his way from Abuja to Bauchi after reportedly attending the wedding ceremony of the son of former NFF President Aminu Maigari.\nMr Toro was reportedly kidnapped alongside a former Assistant Coach of the Super Eagles, Garba Yila.\nThe identities of the kidnappers have not been ascertained and they have yet to communicate with the family for ransom, PREMIUM TIMES learnt.\nKidnap for ransom is rampant in many states in Nigeria and is carried out by various armed groups."
  },
  {
    "headline": "INEC Declares Oyebanji Ekiti Gov-elect",
    "summarized_story": "Mr. Biodun Oyebanji, a candidate of the All Progressives Congress (APC), has been proclaimed the winner of the Ekiti governorship election by the Independent National Electoral Commission (INEC).\nOyetola won the election with 187,058 votes, while the Social Democratic Party’s (SDP) standard bearer, Engr.\nWhile Oyebanji won by a landslide in 15 local government areas, Kolawole won the Efon local government, where he was born.\nAdo, Ekiti west, Gbonyin, Ijero, Ikole, Ikere, Ado, Irepodun/Ifelodun, Ilejemeje, Ido/Osi, and Moba were all cleared by the APC.\nThe local government areas of Ekiti Southwest, Oye, Emure, Ise/Orun, and Ekiti East are among the others."
  },
  {
    "headline": "Zamfara Govt Declares Work-free Week For PVC Registration",
    "summarized_story": "Zamfara Governor Bello Matawalle has given a week off for public and civil personnel to register and receive permanent voter cards.\nIbrahim Dosara, the state’s Commissioner for Information, made the announcement on Saturday in Gusau.\n“This is to inform the general public that His Excellency, the Executive Governor of Zamfara State, Bello Matawalle has declared next week, Monday to Friday June 20 to 24, as work-free week.\n“This is to enable the state public and civil servants to go to their respective localities to register and obtain their Permanent Voter Cards (PVCs).\nCommunity leaders, he said, are responsible for ensuring that eligible voters in their wards and local government regions register and obtain PVCs."
  },
  {
    "headline": "BREAKING: Peter Obi Returns To Nigeria After 3-day Visit To Egypt",
    "summarized_story": "Peter Obi, the Labour Party’s presidential candidate, returned to Nigeria on Saturday following a three-day vacation to Egypt.\nRecall that Obi declared on his verified Twitter handle in the early hours of Tuesday that he was leaving for Egypt on a three-day visit to see, among other things, the Egyptian Power Sector, Education, Planning, and Finance Sectors.\nMore details later…"
  },
  {
    "headline": "Breaking: Ex-NFF top official kidnapped",
    "summarized_story": "Unknown gunmen on Saturday night struck and kidnapped former General Secretary of the Nigeria Football Federation (NFF) Sani Ahmed Toro.\nI got across to one of his sons, who told me he was abducted around Akwanga road in Nasarawa while returning from Abuja.\nOther details when I get them will be communicated to you,” Mr Wakili was quoted by Premium Times.\nMr Toro and Mr Yila were kidnapped on their way from Abuja to Bauchi after attending the wedding ceremony of the son of Former NFF President, Aminu Maigari.\nOne of the sons of the victims Nasiru Sani Toro confirmed that his father along two others were kidnapped while returning from Abuja around 7-8pm."
  },
  {
    "headline": "Breaking: INEC declares APC’s Oyebanji winner of Ekiti governorship election *See full results, other details",
    "summarized_story": "Mr. Biodun Oyebanji of the All Progressives Congress has been declared winner of the 2022 Ekiti governorship election by the Independent National Electoral Commission (INEC)Mr Oyebanji polled a total of 187,057 votes to defeat his two closest challengers – Segun Oni of the Social Democratic Party (SDP) and Bisi Kolawole of the People’s Democratic Party.\nThe SDP emerged in second place with total votes of 82,211 while the PDP was third with 67,457 votes.\nMr Oyebanji is now set to replace incumbent Kayode Fayemi in October.\nThe results as announced by INEC:Ekiti East LGAAPC – 12,099PDP – 5,230SDP – 4,982Gbonyin LGAAPC – 11,247PDP – 3,947SDP – 4,059Ikole LGAAPC -16,417PDP – 6,266SDP – 5,736Ado-Ekiti LGAAPC – 23,831PDP – 7,575SDP – 15,214Ise/Orun LGAAPC – 8,074PDP – 2,588SDP – 5,909Emure LGAAPC – 7,728PDP – 2,610SDP – 3,445Ido/Osi LGAAPC – 10,321PDP – 2,871SDP – 9,489Oye LGAAPC – 13,396PDP – 4,122SDP – 3,591Moba LGAAPC – 11,609PDP – 3,530SDP – 4,904Ekiti South-West LGAAPC – 9,679PDP – 4,474SDP – 4,577Ilejemeje LGAAPC – 4,357PDP – 1,157SDP – 2,344Ikere-Ekiti LGAAPC – 12,086PDP – 3,789SDP – 1,943Irepodun Ifelodun LGAAPC – 13,125PDP – 4,712SDP – 5,010Ekti West LGAAPC – 15,322PDP – 3,386SDP – 3,863Ijero LGAAPC – 13,754PDP – 4,897SDP – 5,006Efon Alaaye LGAAPC – 4,012PDP – 6,303SDP – 339.\nNumber of votes according to political partiesA: 166AAC: 409ADC: 5,997ADP: 3,495APC: 187,057APGA: 376APM – 290LP: 195PRP: 1,980NNPN: 529PDP: 67457SDP: 82,211YPP: 618ZLP: 282Registered voters: 989,224Accredited voters: 365,438Valid votes: 351,865Rejected votes: 8888Total votes cast: 360753."
  },
  {
    "headline": "#Live #EkitiDecides2022: INEC announces results in Ekiti *See full declaration",
    "summarized_story": "So far, the Independent National Electoral Commission (INEC) has declared the results from 10 out of 16 local government area after over 700, 000 voters trooped out and exercised their rights on Saturday June 18, 2022.\nAlready, the All Progressive Congress (APC) candidate, Biodun Oyebanji is comfortably leading and will mostly going to be declared winnerOyebanji is ahead in the race among the three leading candidates, who included PDP’s Bisi Kolawole and SDP’s Engineer Olusegun Oni, a former governor.\nWith Oyebanji scoring 107,913 aggregate votes, Oni so far garnered 42,122 votes while Kolawole of the PDP has 40,838.\nSee results declared so far with top three candidatesIkole LGAAPC – 16, 417PDP – 6,266SDP – 5,736Orun LGAAPC – 8,074PDP – 2,588SDP – 5,909Osi LGAAPC – 10,321PDP – 2,871SDP – 9, 489Oye LGAAPC – 13, 396PDP – 4,122SDP – 5,391Irepodun Ifelodun LGAAPC – 13,125PDP – 4,712SDP – 5,010Moba LGAAPC – 11609PDP – 3530SDP – 4904Ilejemeje LGAAPC – 4357PDP -1157SDP – 2344Efon LGAAPC- 4,012PDP-6,303SDP-3,39Ikere LGAAPC – 12,086PDP- 3,789SDP – 1, 943Ekiti South-West LGAAPC – 9,679PDP – 4,474SDP -4,577Share this: TwitterFacebook"
  },
  {
    "headline": "ACCI Appoints Former NNPC, DPR Executive, Chairperson Women-in-Business Trade Group",
    "summarized_story": "Abuja Chamber of Commerce and Industry (ACCI) has appointed former Nigerian National Petroleum Corporation (NNPC) and the Department of Petroleum Resources (DPR) Executive, Mrs Chioma Nonyerem Njoku, as the Chairperson of the Women-in-Business Trade Group of the Chamber.\nIn a letter signed by the Director General ACCI, Victoria Akai on Tuesday, the DG stated that the Trade Group is one of the working organs of the Chamber and its roles include promoting activities of Women in Business by providing necessary support, activities and opportunities for members in the Trade Group to succeed in their ventures.\nMrs Njoku, an oil industry expert who would bring to bear over 40 years of experience of working in the oil sector to the Women – in – Business Trade Group, before this appointment has held several positions at the NNPC and DPR, including as Acting Director of Petroleum Resources.\nShe had served as the Senior Special Assistant/Adviser on Petroleum, to the Imo State Governor and as the Secretary of the Bureau of Oil and Gas Matters.\nFurthermore, she attended various Executive Management Courses including the prestigious Harvard Business School program for Leadership and General Management."
  },
  {
    "headline": "NIHOTOUR to unveil mobile training kitchens",
    "summarized_story": "… As key players gear up for 2022 Sustainable Gastronomy Day CelebrationBy Palma IleyeNational Institute for Hospitality and Tourism, NIHOTOUR, has stated that it was set to unveil mobile training kitchens at the 2022 World Sustainable Gastronomy Day Celebration which is expected to attract high level attendance by critical stakeholders of the industry at the event which opens on Saturday, 18th June 2022 at the International Conference Centre, Abuja.\nDisclosing this to newsmen at the headquarters of the Institute in Abuja, Director General and Chief Executive Officer of NIHOTOUR, Nura Sani Kangiwa, said the institute has acquired the mobile kitchens in order to up its skill acquisition and training outreach programs to Nigerian youths in the nooks and crannies of the country.\nKangiwa noted that the Sustainable Gastronomy Day celebration for this year recognizes the practices and principles associated with sustainable food consumption combined with the art of collecting, preparing and consuming the food we eat, stating further that the observances of the day acknowledges the social, cultural and artistic expression related to gastronomy that defines the three dimensions of sustainable development which are; people, planet and profit (benefits).\nHe noted that gastronomy was a cultural expression of nations through their food choices, sources of ingredients and types of cuisines which thrives in culturally rich destinations and Nigeria being one of the most competitive Gastronomy tourist destination in Africa because of its corresponding unique foods culture and enticing cuisines of international repute.\nThe NIHOTUR boss also noted that the occasion will also feature the presentation of a paper to mark the observance Day to be delivered by Olufemi Falebita titled ‘Marketing Nigerian Foods Abroad’The United Nations General Assembly proclaimed World Sustainable Gastronomy Day in December, 2016 and first celebrated it in 2017."
  },
  {
    "headline": "PenCom says only five states, Kaduna, Lagos, Delta 2 others pay pensions",
    "summarized_story": "It has been reported that only five states are paying pensions under the Contributory Pension Scheme as more workers retired by the end of the first quarter of 2022, findings have revealed.\nPenCom listed the states that were funding the accrued rights of the retirees and paying pensions under the CPS to be Lagos, FCT, Osun, Kaduna and Delta.\nData obtained from PenCom on ‘Status of implementation of the CPS by states’ showed that 25 states had enacted laws on the CPS and that out of them, 15 had pension bureaux and boards in line with the CPS.\nThe data revealed that the 25 states are Lagos, FCT, Osun, Kaduna, Delta, Ekiti, Ondo, Edo, Benue, Kebbi, Niger, Rivers, Ogun, Bayelsa, Kogi, Anambra, Abia, Taraba, Imo, Sokoto, Adamawa, Ebonyi, Nasarawa, Enugu and Oyo.\nPenCom data showed that states with other pension schemes were Jigawa, Kano, Gombe and Zanfara."
  },
  {
    "headline": "Adegbite woos investors with huge gold, lead-zinc, iron-ore deposits",
    "summarized_story": "By Palma IleyeIn continued efforts to grow the economy through the mining sector, the Minister of Mines and Steel Development, Arc Olamilekan Adegbite, Thursday, has wooed investors abroad with huge gold, lead-zinc, iron-ore and barite deposits in Nigeria.\n“Target minerals under the first phase include Gold, Lead-Zinc, Iron Ore, and the Battery Minerals, among others.\n“These include Thor Exploration Limited’s Segilola Gold Mine Project, in Osun State, which has an initial production capacity of 80,000 ounces of gold annually, representing the first large-scale Gold Mine in Nigeria.In June last year, we commissioned the Dukia Gold & Precious Metals Refinery, DGPMR, Project.\nIts potential impact on the gold sector is nothing short of revolutionary.\n“From the revenue drive perspective, the Nigerian Mining Sector has demonstrated a marked improvement despite the challenges of the pandemic."
  },
  {
    "headline": "Safety Engineers call for establishment of Safety Commission",
    "summarized_story": "Emeka Samuel,UYOThe National Chairman of the Nigerian Institution of Safety Engineers (NISafetyE), Engr.\nAkaninyene Ekong has called on the States’ Houses of Assembly to enact a law for the establishment of Safety Commissions across all states in Nigeria.\nEkong made this call yesterday during the 2022 Annual Public Lecture on “Advancing Safety Engineering for Sustainable Development” organized for the Investiture of Engr.\nThe chairman tasked Safety practitioners and professional bodies to woo and lobby the political class in order to engender a robust and better safety culture in Nigeria through legislation in line wiith ILO guidelines.\nThe chairman called for synergy with the practitioners and developers in the building and environment industry, the political class and particularly, the legislators for the rebirth of a serene safety culture in Nigeria through the use of qualified Engineers in projects and the establishment of a safety regulatory agency, otherwise known as Safety Commission."
  },
  {
    "headline": "APC’s Oyebanji Declared Winner Of Ekiti Governorship Election",
    "summarized_story": "﻿The Independent National Electoral Commission (INEC) has declared Biodun Oyebanji of the All Progressives Congress winner of the 2022 Ekiti governorship election.\nThe SDP emerged in second place with total votes of 82,211 while the PDP was third with 67,457 votes.\nREAD ALSO: We Are In Talks With Peter Obi, Says KwankwasoMr Oyebanji is now set to replace incumbent Kayode Fayemi in October.\n“No society can grow greater than the vision and dream of its leader,” Oyebanji said during last week’s Ekiti governorship debate, one of his final public appeals to voters.\n“I’ve received reports of vote-buying in Ado and Oye,” Oni, the SDP candidate, said."
  },
  {
    "headline": "Ekiti Election: Prosecute Vote-Buyers Or Face Legal Action, SERAP Tells INEC",
    "summarized_story": "Socio-Economic Rights and Accountability Project (SERAP) has given Professor Mahmood Yakubu, Chairman of the Independent National Electoral Commission (INEC) seven days to “gather information about reports of vote-buying, undue influence, intimidation, ballot box snatching, and other electoral offences by the three leading political parties in the just concluded Ekiti State governorship election.”SERAP also urged INEC to “promptly and effectively prosecute those arrested, and bring to justice anyone who sponsored, aided and abetted them.”In the letter dated 18 June 2022 and signed by SERAP deputy director Kolawole Oluwadare, the organisation said: “Corruption of the ballot box intrudes on the freedom of Nigerian voters to make up their own minds.\nVote buying and other forms of electoral corruption freeze out the less wealthy candidates and parties.”SERAP said, “Wealthy candidates and their sponsors ought not to be allowed to profit from their crimes.\nVote buying amounts to undue influence and improper electoral influence.”“By engaging in vote buying and electoral bribery in so blatant a fashion, the politicians involved and their sponsors have clearly influenced voters to vote for him, contrary to the Electoral Act, thus raising serious questions about the legitimacy and validity of the election.”“A corruption-free electoral process is essential for building public confidence in the electoral process, and the credibility and legitimacy of the 2023 elections.”“One of the people’s most sacred rights is the right to vote.\nAccording to reports, agents of the three parties in Ward 007, PU 001, Ado LGA offered voters as high as N10,000 in exchange for their votes.”“There are also several reports of ballot box snatching including in polling units with codes 13/05/06/005 and 007 in Ilawe Ward IV, near St. Patrick’s School.\nIf we have not heard from you by then, SERAP shall consider appropriate legal actions to compel INEC to comply with our request in the public interest.”"
  },
  {
    "headline": "You Truly Belong To Everybody And Nobody, Tinubu Tells Buhari",
    "summarized_story": "He congratulated the president for the successful conclusion of the convention and assured him of an issue focused campaign leading to the 2023 general elections.\nI have met most of them in the past few days and will continue these engagements as we plan for the general elections.\nMr. President, APC is united and will remain united as we move towards the general elections.\nI have taken note of the message you sent to all Presidential Candidates in your Democracy Day speech to the nation on the 12th June, 2022.\nAsiwaju Ahmed Bola TinubuAPC Presidential Candidate"
  },
  {
    "headline": "We Are In Talks With Peter Obi, Says Kwankwaso",
    "summarized_story": "The presidential aspirant of the New Nigeria Peoples Party, Rabiu Kwankwaso, has revealed that his camp is in talks with Peter Obi and members of the Labour Party over a possible alliance.\nThere have been speculations of a “third force” to challenge the APC-PDP duopoly and Kwankwaso and Obi are reportedly exploring the possibility of creating an alliance in the 2023 elections.\n“We are really talking to Peter Obi, or at least saying that the committee is working to look into the matter (and cooperate with him), and friends and family are coming to talk to us about it, ” he said.\n“We wish to inform Nigerians that, our discussions with Peter Obi and the Labour Party are still ongoing.\n“We hope for good results that will give Nigeria a chance to be alive, once again.”"
  },
  {
    "headline": "BREAKING: APC wins Ekiti Governorship election with audacious margin -",
    "summarized_story": "The governorship candidate of the All Progressives Congress in Ekiti State, Biodun Abayomi Oyebanjo, has been declared the winner of the Saturday governorship election.\nThe People’s Democratic Party came third with 67,457 votes.\nThe APC governorship candidate won 15 out of the 16 local governments in the state to emerge victory at the poll.\nBelow is the breakdown of the results as released by the electoral umpire.\nAdo-Ekiti LGARegistration Area – 13Registered – 179,088Accredited – 50,596APC – 23,831PDP – 7,575SDP – 15,214================================Ikere LGARegistration Areas – 11Registered voters – 65,661Accredited voters – 24,109ADC – 3,763APC – 12,086SDP – 1, 946PDP – 3,789=============================Oye LGARegistration Areas – 12Registered Voters – 65,170Accredited Voters -24,925APC – 13,396PDP – 4,122SDP – 5,391================================Gbonyin LGARegistration Areas – 10Registered Voters – 53,788Accredited Voters – 20,308APC – 11,247PDP – 3,947SDP – 4,059==============================Efon LGARegistration Area – 10Registered Voters –Accredited Voters 11046APC – 4,012PDP – 6,303SDP – 339=============================Ekiti East LGRegistration Areas – 12Registered Voters – 61,360Accredited Voters – 24024APC – 12,099PDP – 5,230SDP – 4,982=============================Ekiti South-West LGAAPC – 9,679PDP – 4,474SDP – 4,577=============================Ekiti West LGARegistration Areas – 11Registered Voters – 59,270Accredited Voters – 23,750APC – 15,322PDP – 3,386SDP – 3,863============================Emure LGAAPC – 7,728PDP – 2,610SDP – 3,445=====================================Ido-Osi LGARegistration Area – 11Registered Voters – 57,780Accredited Voters – 23,848APC – 10,321PDP – 2,871SDP – 9,489=====================================Ijero LGA12 Registration AreasRegistered voters- 65,328Accredited voters- 25,103ADC- 96ADP-201APC – 13,754PDP – 4,897SDP – 5006=============================Ikole LGARegistration Areas – 10Registered Voters – 71,690Accredited Voters – 30,403APC – 16,417PDP – 6,266SDP – 5,736==============================Ilejemeje LGARegistered Voters -18791Accredited Voters – 8439APC – 4357PDP – 1,157SDP – 2,344=============================Irepodun/Ifelodun LGARegistration Areas – 11Registered Voters – 70,467Accredited Voters – 24,123APC – 13,125PDP – 4,712SDP – 5,010==============================Ise/Orun LGARegistration Area – 10Registered voters – 46,712Accredited voters – 17,534APC – 8,074PDP – 2,588SDP – 5,909=========================Moba LGARegistration – 11Registered Voters – 53,527Accredited Voters – 20,743APC -11,069PDP – 3,530SDP – 4,904Final ResultsAccredited Voters – 363,468A – 166AAC – 409ADC – 5,597ADP – 3,495APC – 187,057APGA – 376APM – 290APP – 1,980LP – 195NNPP – 529NRM – 347PDP – 67,457PRP – 856SDP – 82,211YPP – 618ZLP – 282Total Vote Cast – 360,753"
  },
  {
    "headline": "Ekiti Governorship Election: Live Collation of Final Results -",
    "summarized_story": "The collation and announcement of results from the sixteen local government areas has commenced at the State Collation Centre in Ado-Ekiti.\n=================================================================Ado-Ekiti LGARegistration Area – 13Registered – 179,088Accredited – 50,596APC – 23,831PDP – 7,575SDP – 15,214================================Ikere LGARegistration Areas – 11Registered voters – 65,661Accredited voters – 24,109ADC – 3,763APC – 12,086SDP – 1, 946PDP – 3,789=============================Oye LGARegistration Areas – 12Registered Voters – 65,170Accredited Voters -24,925APC – 13,396PDP – 4,122SDP – 5,391================================Gbonyin LGARegistration Areas – 10Registered Voters – 53,788Accredited Voters – 20,308APC – 11,247PDP – 3,947SDP – 4,059==============================Efon LGARegistration Area – 10Registered Voters –Accredited Voters 11046APC – 4,012PDP – 6,303SDP – 339=============================Ekiti East LGRegistration Areas – 12Registered Voters – 61,360Accredited Voters – 24024APC – 12,099PDP – 5,230SDP – 4,982=============================Ekiti South-West LGAAPC – 9,679PDP – 4,474SDP – 4,577=============================Ekiti West LGARegistration Areas – 11Registered Voters – 59,270Accredited Voters – 23,750APC – 15,322PDP – 3,386SDP – 3,863============================Emure LGAAPC – 7,728PDP – 2,610SDP – 3,445=====================================Ido-Osi LGARegistration Area – 11Registered Voters – 57,780Accredited Voters – 23,848APC – 10,321PDP – 2,871SDP – 9,489=====================================Ijero LGA12 Registration AreasRegistered voters- 65,328Accredited voters- 25,103ADC- 96ADP-201APC – 13,754PDP – 4,897SDP – 5006=============================Ikole LGARegistration Areas – 10Registered Voters – 71,690Accredited Voters – 30,403APC – 16,417PDP – 6,266SDP – 5,736==============================Ilejemeje LGARegistered Voters -18791Accredited Voters – 8439APC – 4357PDP – 1,157SDP – 2,344=============================Irepodun/Ifelodun LGARegistration Areas – 11Registered Voters – 70,467Accredited Voters – 24,123APC – 13,125PDP – 4,712SDP – 5,010==============================Ise/Orun LGARegistration Area – 10Registered voters – 46,712Accredited voters – 17,534APC – 8,074PDP – 2,588SDP – 5,909=========================Moba LGARegistration – 11Registered Voters – 53,527Accredited Voters – 20,743APC -11,069PDP – 3,530SDP – 4,904=================================================================Final ResultsA – 166AAC – 409ADC – 5,597ADP – 3,495APC – 187,057APGA – 376APP – 1,980LP – 195NNPP – 529NRM – 347PDP – 67,457PRP – 856SDP – 82,211YPP – 618ZLP – 282Total Vote Cast – 360,753"
  },
  {
    "headline": "Zamfara declares one week public holiday for civil servants to obtain PVC -",
    "summarized_story": "Zamfara State Government has declared Monday to Friday next week 20th – 21st June, as work free week to allow civil servants travel to their localities and register in the ongoing permanent voter card registration.\nThe state Commissioner for Information, Ibrahim Dosara in press state made available to Newsmen in Gusau, Confirmed the developmentHe says, Commissioners, Special advisers, Tradition rulers and other Political Party Officials are expected to monitor the exercise in their respective areas.\n“By this announcement, all Commissioners, Special Advisers, Permanent Secretaries, other public office holders, party officials and traditional rulers are here by directed to monitor and supervise the on going Voter Registration exercise to ensure that all eligible voters within their wards and local governments register and obtain their Permanent Voter Cards to enable them exercise their fundamental rights and civic responsibilities in the Coming Elections” The statement read."
  },
  {
    "headline": "Saraki's ex-aide, Makanjuola emerges Kwara PDP deputy guber candidate -",
    "summarized_story": "A former member of the house of representatives, Mr Gbenga Makanjuola has been picked as the deputy governorship candidate of the People’s Democratic Party in Kwara state for 2023 election.\nMr Makanjuola also served as one of the aides of Senator Bukola Saraki when he was the senate president.\nThe governorship candidate, Shuaib Yahman Abdullahi while unveiling his running mate assure that the party is prepared to clinch power next year.\nThe PDP gubernatorial candidate called on members to unite and collectively win the APC across the states and at the federal level come 2023."
  },
  {
    "headline": "Macron Faces Tough Battle for Control of Parliament as France Votes",
    "summarized_story": "France votes on Sunday in a high-stakes parliamentary election that could deprive centrist President Emmanuel Macron of the absolute majority he needs to govern with a free hand.\nPollsters predict Macron’s camp will end up with the biggest number of seats, but say it is in no way guaranteed to reach the 289 threshold for an absolute majority.\nAfter electing a president, French voters have traditionally used legislative polls that follow a few weeks later to hand him a comfortable parliamentary majority – with Francois Mitterand in 1988 a rare exception.\nIf Macron and his allies miss an absolute majority by just a few seats, they may be tempted to poach MPs from the centre-right or conservatives, officials in those parties said.\nSo after five years of undisputed control, Macron, known for his top-down approach to power, is looking at a new mandate where he will need to strike more compromises."
  },
  {
    "headline": "Ukraine War: Zelensky Visits Frontline Cities of Mykolaiv and Odesa",
    "summarized_story": "Visiting the hold-out city of Mykolaiv, he inspected damaged buildings and met soldiers, officials and health workers.\nThe Ukrainian leader also visited the western city of Odesa, which has been subjected to periodic Russian shelling since the war began.\nBut he has also defied Russian troops by going to areas where fighting has been raging, and in recent weeks has visited other front-line cities, including Kharkiv in the east.\nThe city has long been a key target for Russian forces and has been subject to heavy rocket and artillery bombardments.\nPreviously Ukrainian officials have spoken of up to 100 deaths a day."
  },
  {
    "headline": "‘Leader, Brother, Friend’: You Truly Belong to Everybody and Nobody, Tinubu Tells Buhari",
    "summarized_story": "The presidential candidate of the All Progressives Congress (APC), Senator Bola Tinubu, has hailed Nigeria President Muhammadu Buhari for what he described as his “neutral stance” during the party’s recent presidential primary, which he won.\nAccording to a statement issued Saturday by the presidential spokesman, Mr Femi Adesina, the former Lagos State governor gave the commendation in a letter addressed to Buhari.\nIn the letter, as reproduced by Adesina, Tinubu described Buhari as a “true leader, brother and friend”, and also commended him for his maturity, which contributed significantly to the success of the presidential primary.\nUp until the 6th of June, 2022, the day of the APC presidential primaries, the whole of Nigeria, including myself, was waiting for you to announce your preferred candidate.\nYou belonged to everybody in the party and you belonged to none of the individual candidates of the party – a true leader, brother and friend."
  },
  {
    "headline": "Nigeria: NNPP’s Kwankwaso Confirms Possibility of Collaboration with Obi’s Labour Party – Arise News",
    "summarized_story": "The presidential candidate of the New Nigeria Peoples Party (NNPP), Senator Rabiu Kwankwaso, on Saturday confirmed ongoing talks for a possible alliance between his party and Mr Peter Obi’s Labour Party (LP).\nThis is coming as NNPP has announced the choice of Mr Ladipo Johnson as the running mate to its presidential candidate, Kwankwaso.\nKwankwaso argued that this was especially important as the All Progressives Congress (APC) and the Peoples Democratic Party (PDP) had not fielded a Southeast vice-presidential candidate.\nLP has announced a placeholder for the position of its vice-presidential candidate in the person of Dr Doyin Okupe,.\nNNPP announced through its official Twitter handle, @nnpphqabuja1, which has also been confirmed by the National Publicity Secretary of the party, Major Agbor."
  },
  {
    "headline": "Nigeria: Retail Price of Petrol Rose to N173 in May as Diesel Jumps 181% in One Year",
    "summarized_story": "Nigeria’s National Bureau of Statistics (NBS) has said the average retail price paid by consumers for petrol increased to N173.08 in May.\n“On the other hand, the lowest average retail price for petrol was recorded in Ogun State with N165.00, followed by Yobe and Benue states with N165.36 and N165.50, respectively.”The report showed that the highest average retail price was recorded in the South-east zone with N186.24, while the North-central had the least with N168.20.\nThe NBS revealed in its Automotive Gas Oil (diesel) Price Watch Report for May 2022 that the average retail price of diesel paid by consumers increased by 181.00 per cent from N238.82 in May 2021 to N671.08 recorded in May 2022.\nOn the other hand, it said the state with the lowest average retail price was Yobe with N560.00, followed by Bauchi and Delta with N570.00 and N624.44, respectively.\nThe report said the zone analysis showed that the average price of diesel was highest in the South-West with N705.60, while the North-east had the lowest price with N639.00."
  }
]