[
  {
    "headline": "NAFDAC set to register, certify premises of chemical manufacturers",
    "summarized_story": "The National Agency for Food and Drug Administration and Control has declared that it is set to register and certify premises of chemical manufacturers in order to boost the nation’s economy.\nA statement signed on Sunday by the Agency’s resident media consultant, Mr Olusayo Akintola, stated that the NAFDAC Director-General, Prof. Mojisola Adeyeye, disclosed this during a virtual stakeholders’ meeting with chemical manufacturers.\nShe said, “Chemicals no doubt play a pivotal role in the economic development of any country, Nigeria as an economy in transition has many needs of chemicals for her numerous industries.\n“Some of these chemicals are now manufactured in the country and this creates an environment of heightened concern that NAFDAC is expected to play a leading role in strengthening chemical safety and security.\n“The NAFDAC Act empowers the agency to undertake appropriate investigations into production premises and raw materials for food, drugs, cosmetics, medical devices, bottled water and chemicals."
  },
  {
    "headline": "10,000 fans to attend Olympics amid COVID-19 surge",
    "summarized_story": "Organisers have said that up to 10,000 fans will be allowed at the Tokyo Olympic events, as they warned that the competition could move behind closed doors if infections surge.\nThis declaration on Monday, just weeks before the opening ceremony, has ended months of speculation about whether domestic spectators would be able to attend the pandemic-postponed games as overseas fans were banned in March.\n“In light of the government’s restrictions on public events, the spectator limit for the Olympic Games will be set at 50 percent of venue capacity, up to a maximum of 10,000 people in all venues,” organisers said in a statement.\nThey fear crowds of fans could fuel a new surge in infections in a country still racing to vaccinate its residents.\nOrganisers said it was unlikely that negative virus tests would be required to attend."
  },
  {
    "headline": "Why A’Ibom govt is creating primary healthcare development agency — Commissioner",
    "summarized_story": "By Harris Emanuel, UyoAkwa Ibom government has given reasons for the creation of a primary healthcare development agency in the state, saying that the agency was aimed at strengthening healthcare delivery at the grassroots and ensuring efficient management and supervision.\nCommissioner for Health, Professor Augustine Umoh, who dropped the hints, said the agency would also enable primary healthcare services to be brought under one roof.\nUnder the primary health development agency which would mean that everything about primary healthcare will be under the agency.\n“This could have been done long before now, as you would remember the EndSars protests of last year in which the office of the primary healthcare development agency was vandalised.\n“We are conducting training for the primary healthcare workers to bring them at par with their counterparts in other parts of the country."
  },
  {
    "headline": "VIDEO: Happy Father’s Day: Under the sun or in the rain",
    "summarized_story": "VIDEO: Happy Father’s Day: Under the sun or in the rain"
  },
  {
    "headline": "NAFDAC to register, certify premises of chemical manufacturers",
    "summarized_story": "The National Agency for Food and Drug Administration and Control (NAFDAC) is set to register, certify premises of chemical manufacturers in order to boost the nation’s economy.\nIt has also agreed with manufacturers of chemical products in Nigeria to explore the international market with chemical products to enhance the nation’s foreign exchange earnings.\nA statement signed on Sunday by the agency’s resident media consultant, Mr Olusayo Akintola, stated that NAFDAC Director General, Prof. Mojisola Adeyeye, disclosed this during a virtual stakeholders’ meeting with chemical manufacturers.\nAdeyeye disclosed that the directorate has put in place effective regulations and guidelines for sound chemical management in Nigeria.\nAccording to De-Konnick, NAFDAC’s involvement in regulating the chemical manufacturing sector will bring it to limelight and reposition Nigeria chemical industry for economic growth."
  },
  {
    "headline": "ACCESSPRENUER CHALLENGE: Access Bank rewards NYSC members with N15m",
    "summarized_story": "By Nkiruka NnoromAccess Bank Plc has rewarded serving members of the Nigeria Youth Service Corps (NYSC) with over N15 million in its third edition of Access Bank Plc’s youth business challenge competition, Accessprenuer, which was held across five states of Nigeria recently.\nREAD ALSORethinking NYSC at 48The challenge took place simultaneously across five NYSC camps in Abuja, Osun, Enugu, Nassarawa and Rivers States.\nSpeaking on the initiative, Victor Etuokwu, Executive Director, Retail Banking, Access Bank Plc, said: “The challenge is aimed at promoting entrepreneurial aspirations among talented corp members.\nSo far, the competition has proved to have a great impact on youth empowerment in the country as we received more entries during the current challenge.\nIt is a way to support the young men and women who are just graduating from university to grow.”"
  },
  {
    "headline": "How to invest in capital market, by First Bank Holdings’ CFO",
    "summarized_story": "He stated these at the Capital Market Correspondents Association of Nigeria, CAMCAN’s knowledge sharing session at a webinar.\nREAD ALSOSEC bars unregistered operators from capital market after May 31Ariyibi said financial advisers would guide investors on fundamental stocks to invest in to maximise returns on investment.\n“As an investor, investing in financial market is not gamble or betting, you need financial adviser for investment decisions.\n“You should invest money you don’t have need for immediate use, invest for medium and long-term, also invest in stocks that have good fundamentals for capital gains,” Ariyibi said.\nSpeaking on the theme: “Understanding Financial Statement for Business Reporting,” he raised an awareness on the value derived from financial statement of a company."
  },
  {
    "headline": "Immigration officers collecting bribes from criminals",
    "summarized_story": "The Comptroller General of the Nigeria Immigration Service (NIS), Muhammad Babandede, has warned officers and men of the service against compromising Nigeria’s security through bribe taking.\n“We are aware that some of you have been collecting bribes from criminals.\nI am warning you to stop such because it is a threat to the country’s security.\n“We cannot tolerate such an attitude because by doing that, you are compromising the country’s security and the country will not move forward,’’ Babandede said.\nHe said, “I have received reports that some of you collect bribes at several checkpoints."
  },
  {
    "headline": "Oyetola too withdrawn",
    "summarized_story": "Bamidele Salam, member representing Ede North, Ede South, Egbedore and Ejigbo Federal Constituency in the House of Representatives, has revealed that there is no working relationship between the Osun State Governor and members of the opposition party, especially those in the National Assembly.\nHe also accused Governor Adegboyega Oyetola of being withdrawn and reticent, a development which according to him has made Osun to lose out on many occasions.\n“I had at a time reached out to the governor towards funding for the proposed Ido Osun airport which falls under my constituency.\n“When the time comes, we will go into the fields and everybody is going to give accounts of their stewardship to the people,” he added.\nHouse of Reps member calls out Presidential spokesmen over Pantami"
  },
  {
    "headline": "Court orders NNPC, Mobil to pay Akwa Ibom communities N90bn over oil spillage",
    "summarized_story": "A Federal High Court in Abuja has ordered the Nigeria National Petroleum Corporation (NNPC) and Mobil Oil Company to pay a sum of N90 billion in damages to Ibeno oil communities of Akwa Ibom State for economic losses suffered from oil spillages.\nThe oil spills were said to have occurred between 2000 and 2010 during which rivers and lands were polluted leading to loss of animals and plants.\nDelivering judgement in a joint suit by the Ibeno villages, Justice Taiwo Oladipupo Taiwo held that both NNPC and Mobil oil were liable for oil spillages over the years during explorations.\nJustice Taiwo rejected the evidence of the witnesses called by Mobil adding that the oral and documentary evidence were unreliable and questionable.\nIn all, Justice Taiiwo ordered the two defendants to pay the oil spill victims N90 billion as damages for their losses."
  },
  {
    "headline": "Kebbi attack: Government shuts down seven schools over safety concerns",
    "summarized_story": "The Government of Kebbi State has closed seven schools following the recent abduction of students and teachers of Federal Government College(FGC) Birnin Yauri by bandits.\nRecall that armed men, suspected to be bandits, had abducted students and teachers of the college, on Thursday in the state.\nOne of the students abducted from the school was shot dead during a gun duel between soldiers and the abductors.\nFollowing the development, the Nigerian Army earlier confirmed that five of the abducted students and two teachers were rescued.\nHe further revealed that the bandits have contacted parents and families of the abducted students but no ransom has been demanded."
  },
  {
    "headline": "Nigerian youths are their own worst enemies",
    "summarized_story": "Former Aviation Minister, Femi Fani-Kayode has claimed that Nigerian youths are the architects of their own problems, citing unemployment and other crises facing them.\nThe human rights lawyer lamented lack of unity and contentment amongst the youths stating that they need to “spend their resources in trying to come together”.\nHuman rights activists launch movement against insecurity, kidnapping [PHOTOS]He narrated how some youths went diabolical when he was trying to help them secure employment.\nThe tweet reads, “I am convinced that this generation of Nigerian youths are their own worst enemies.\n“We had slots for three jobs for youths."
  },
  {
    "headline": "James Currey Prize for Literature longlist out",
    "summarized_story": "Our ReporterThe judges for the 2021 James Currey Prize for Literature have released the long list.\nSarah Inya Lawal, Chair of Jury, in her statement said: “It is my pleasure to announce the longlist of the 2021 James Currey Prize for African Literature.\nWinner will be announced on 3rd September 2021, which is James Currey’s birthday/ Prize giving event in Oxford, United Kingdom.\nThe James Currey Prize for African Literature was instituted by Nigerian writer, filmmaker and publisher, Onyeka Nwelue.\nCurrey, the co-founder of James Currey Publishers, which was established in 1984, has been called “The Godfather of African Literature”."
  },
  {
    "headline": "Hotelier solicits 5 years tax holiday for hotels",
    "summarized_story": "Agency ReporterMr Adeniyi Ogunsanya, a hotelier, has appealed to the Lagos state government to grant five years tax holiday to hoteliers in the rural communities.\nThe hotelier said this would serve as the state government support to help in growing the sector.\nHe said that it has not been encouraging running hotel business in the rural area because of the high cost of maintenance.\n“Therefore, the government needs to give five years tax holiday to hoteliers at the grassroots to support the business to grow,” he said.\n“The employment opportunities, support for socio-economic growth of the community among other development the investors brings into the community, necessitated the call for a tax holiday."
  },
  {
    "headline": "Millions gone as angry indigenes raze 27 houses in Delta",
    "summarized_story": "Oputu Awhotu, confirmed all 27 houses burnt are in Obubu community, adding the community is still under threat of attack in a conversation with The Nation.\n“The place they took the bulldozer to has never been in dispute between Obubu and Oleri communities.\n“Nobody in Obubu had dispute with Oleri community, so they just attacked, shooting anyhow and burning houses.\n“Yesterday, Obubu community went to the king but we did not meet him.\nEfforts to speak with an indigene of Oleri community, Moses Segba (Esq."
  },
  {
    "headline": "‘How Sanwo-Olu can keep June 12 flag flying’",
    "summarized_story": "By Chimaobim Ihedi-obiLagos State Governor can sustain the spirit of June 12 by continuing to deliver the dividends of democracy, National Convener Women for Change Initiatives (WCI), Eyitope Success-Adekunle, has said.\nShe praised the genuine effort of the state government to improve the living conditions of Lagos residents.\nThe activist-lawyer, who spoke in Lagos at an event to mark June 12, said except for a few people like Sanwo-Olu, there had been an unrelenting effort by the elite and military men in civilian uniform to wish away the gains of June 12.\nShe said the governor and others like him stood behind the June 12 flag bearers to make sure that the struggle for the historic event continues to be recognised.\nADVERTISEMENTShe urged the governor to do more in human capital development and infrastructure."
  },
  {
    "headline": "Buhari meets Ngige, Gambari over insecurity in South East",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari at the weekend met with Minister of Labour and Employment, Chris Ngige, and his Chief of Staff, Ibrahim Gambari at Aso Rock over the escalating insecurity in the South East.\nBriefing State House Correspondents at the end of the meeting, Ngige said they both briefed the president and made proposals to him on how to end the crisis.\nAnd we are following up with dialogue, which at the end of the day is what will happen.\n“I have to see him to appraise him with labour industrial milieu, especially when you know that the judiciary and parliamentary workers JUSUN and PASAN respectively had been been on strike that lasted for two months.\nWe achieved a truce, through up an agreement and we have to today summit his own copies of the agreement to him."
  },
  {
    "headline": "Father’s Day: Kalu tasks fathers on nation building",
    "summarized_story": "Kalu tasked the nation’s fathers to rise to the occasion of defending the Church and the nation at large.\nThe ambience of the church was lightened up as Kalu donated over N2 million to the Catholic Men Organisation (CMO), Catholic Women Organisation and officiating Catholic priests.\nFather Charles congratulated fathers and acknowledged that the roles of fathers in nation building cannot be over-emphasised.\nThe Catholic cleric also urged fathers to register with CMO and lamented the refusal of some fathers in the church to join the organisation.\nHe outlined the numerous benefits of aligning with the forum, while urging unregistered fathers to join the association."
  },
  {
    "headline": "NDLEA nabs law enforcement officer, 6 others for dealing in cocaine",
    "summarized_story": "From Godwin Tsa, AbujaThe National Drug Law Enforcement Agency (NDLEA) has arrested a serving officer of a law enforcement agency, Popoola Abayomi for selling assorted illicit drugs to students of a Federal university and cultists in Ogun state.\nBefore he was finally arrested, Abayomi, had been on the watch list of the agency in connection with drug related offences.\nAfter the arrest of the two suspects, some student union officials of the institution blocked the NDLEA team with their official vehicle.\nThe following day, two ladies; Mary Peter, 40, and Mercy Oladele, 39, were arrested at Total Garden, Ibadan when NDLEA operatives acting on a tip-off, intercepted their commercial micra car.\nThe suspect had arrived the ‘D’ arrival hall of the airport on 14th June on Turkish airline flight from Pakistan with the illicit drug inserted in his anus."
  },
  {
    "headline": "Security beefed up as Olu of Warri burial rites begin",
    "summarized_story": "From Ben Dunno, WarriOde-Itsekiri, the traditional ancestral home of Itsekiri nation, is witnessing heavy presence of armed security personnels as burial rites commences for the late Olu of Warri, Ogiame Ikenwoli.\nThe vigil was part of the activities lined-up as 14 days traditional funeral rites for the repose of the soul of the royal father and was witnessed by dignitaries from all walks of life, both at home and in the diaspora.\nHowever, Saturday’s all-night traditional funeral rites was hitch-free with Ogele Ukpukpe, Ibiogbe and Uku-Umalikun Ola-Aja dancers from various Itsekiri communities showcasing their rich cultural heritage to the delight of those in attendance, including non-indigenes.\nThe traditional funeral rites was presided over by the Regent of Warri Kingdom, Prince Emmanuel Okotie-Eboh and coordinated by lawmaker representing Warri Federal Constituency at the House of Representatives, Thomas Ereyitomi.\nA commendable service was held in the Church of the Palace of Olu of Warri last Thursday, as part of the 14 days burial rites for the late monarch."
  },
  {
    "headline": "FG, Lai sued over directive to broadcasters to stop using Twitter",
    "summarized_story": "Socio–Economic Rights and Accountability Project (SERAP) has filed a lawsuit asking the Federal High Court in Abuja to stop the Federal Government and Minister of Information and Culture, Mr. Lai Muhammed from using the unlawful directive to TV and radio stations not to use Twitter and to delete their accounts, as a pretext to harass, intimidate, suspend or impose criminal punishment on journalists and broadcast stations.\nThe suit followed the order by the National Broadcasting Commission (NBC) asking TV and radio stations to “suspend the patronage of Twitter immediately”, and telling them to delete ‘unpatriotic’ Twitter, after the social media giant was banned in the country for deleting President Muhammadu Buhari’s tweet.\nIn the suit number FHC/ABJ/CS/496/2021 filed last Friday, SERAP is seeking “an order of perpetual injunction restraining the government of President Buhari, NBC, and Mr Lai Muhammed and any other persons from censoring, regulating, licensing and controlling the social media operations and contents by broadcast stations, and activities of social media service providers in Nigeria.”SERAP is also seeking an order setting aside the directive by NBC and Muhammed that broadcast stations stop using Twitter, as it is unconstitutional, unlawful, inconsistent and incompatible with the Nigerian Constitution of 1999 (as amended) and the country’s obligations under the African Charter on Human and Peoples’ Rights and the International Covenant on Civil and Political Rights.”“The government of President Buhari, NBC and Mr Lai Muhammed have consistently made policies and given directives to crackdown on media freedom, and the rights of Nigerians to freedom of expression and access to information, and to impose crippling fines and other sanctions on broadcast stations without any legal basis whatsoever.\nThe court has an important role to play in the protection and preservation of the rule of law to ensure that persons and institutions operate within the defined ambit of constitutional and statutory limitations.”No date has been fixed for the hearing of the suit."
  },
  {
    "headline": "NDLEA Arrests Law Enforcement Officer, Six Others for Dealing in Cocaine, Others",
    "summarized_story": "* Uncovers heroin in Pakistan-returnee’s anus at Lagos airportA serving officer of a law enforcement agency, Popoola Abayomi has been arrested for selling assorted illicit drugs to students of a federal university and cultists in Ogun State.\nAfter the arrest of the two suspects, some student union officials of the institution blocked the NDLEA team with their official vehicle.\nThe following day, two ladies; Mary Peter, 40, and Mercy Oladele, 39, were arrested at Total Garden, Ibadan when NDLEA operatives acting on a tip-off, intercepted their commercial micra car.\nThe suspect had arrived the ‘D’ arrival hall of the airport on 14th June on Turkish airline flight from Pakistan with the illicit drug inserted in his anus.\nGen. Buba Marwa (rtd) warned that the NDLEA will not spare any law enforcement agent hiding under the privilege of his uniform to engage in narcotic criminal business."
  },
  {
    "headline": "NADECO Writes Buhari on Insecurity, Insists on Abrogation of 1999 Constitution",
    "summarized_story": "The letter, dated June 15, 2021, and obtained by THISDAY, was signed by its General-Secretary, Mr. Ayo Opadokun.\nNADECO, in the letter to the president, accused him of fuelling secessionist agitations through the “Fulanisation” policy of his administration and its disregard for the constitution.\nNADECO argued that the growing secessionist tendencies in the country were fueled by what it called the obvious policy of Fulanisation and the president’s refusal to discontinue the operation of the 1999 Constitution as altered.\nIt added that the North-west receives 21 per cent from the oil revenue and contributes 0.00 per cent.\nAccording to it, the South-west receives 16 per cent, contributes 6.36 per cent, while South-east receives 11.00 per cent; contributes 3.12 per cent and South-South receives 16.00 per cent and contributes 70.64 per cent."
  },
  {
    "headline": "Courts, Assemblies Move to Relist Cases, Bills Stalled by Workers’ Strike",
    "summarized_story": "The strike also stopped the passage of 49 important bills in six states, while debates on many other legislative bills were halted.\nAlso, proceedings in 880 court cases were halted in Ekiti; over 100 cases in Sokoto; and over 100,000 cases in Katsina, mostly in sharia and magistrate’s courts.\nIn Edo State, the Speaker of the state House of Assembly.\nMarcus Onobu, told THISDAY that about five bills critical to good governance could not be passed due to the strike embarked by the legislative workers.\nIn Lagos State, the strike had minimal effect on the workings of the state House of Assembly as it carried on its business normally."
  },
  {
    "headline": "Govt, Operators Move to End $2bn Aircraft Maintenance Capital Flight",
    "summarized_story": "•Initiative to help Nigeria conserve forexChinedu EzeAs part of efforts to end the huge capital flight spent on maintenance of aircraft overseas put at $2 billion annually, some operators in the aviation industry and the Akwa Ibom State government have taken steps towards developing maintenance facilities in Nigeria.\nThe maintenance facilities would, in turn, be a source of forex earner for the country as airlines and aircraft owners in Africa and beyond could maintain their equipment in Nigeria.\nIt makes me happy that the owners of these maintenance facilities have a good purpose.\n“What makes me happy is that there is a huge market for these maintenance facilities.\nHe also spoke about the cost of taking aircraft overseas for maintenance, saying: “I think there are so many disadvantages to taking your aircraft out of the country for maintenance."
  },
  {
    "headline": "Policeman Goes Berserk, Kills Five Persons, Injures Four in Enugu",
    "summarized_story": "The Governor of Enugu State, Hon.\nIfeanyi Ugwuanyi has also visited the victims at the hospital and promised to pay all the hospital bills.\nThe incident, according to the statement, occurred yesterday at about 0930hrs in the Golf Estate area of Enugu.\nUgwuanyi was received at the hospital by the Commissioner of Police, Enugu State Command, Mohammed Ndatsu Aliyu and the Chief Medical Director, Prof. Hyacinth Onah.\nAccording to a statement by the State Commissioner for Information, Mr. Chidi Aroh, the governor expressed shock over the dastardly act."
  },
  {
    "headline": "EXCLUSIVE: Medical Tourism: One Of Buhari’s Ministers Has Been Away For Months, Undergoing Treatment Abroad",
    "summarized_story": "The Minister of Education, Adamu Adamu, is currently battling an undisclosed ailment in Germany and has been away from the country for months.\nOn May 27, the Federal Ministry of Education inaugurated a “Safe to School, Be Seen, Be Safe” initiative to ensure the children’s safety in and out of school.\nAdamu was represented at the occasion by the Minister of State for Education, Chukwuemeka Nwajiuba.\nAdamu was represented by the Permanent Secretary, Echono.\nAdamu was again represented by the Permanent Secretary in the ministry, Echono."
  },
  {
    "headline": "EXCLUSIVE: Medical Tourism: One Of Buhari’s Ministers Has Been Away For Months, Undergoing Treatment Abroad",
    "summarized_story": "The Minister of Education, Adamu Adamu, is currently battling an undisclosed ailment in Germany and has been away from the country for months.\nOn May 27, the Federal Ministry of Education inaugurated a “Safe to School, Be Seen, Be Safe” initiative to ensure the children’s safety in and out of school.\nAdamu was represented at the occasion by the Minister of State for Education, Chukwuemeka Nwajiuba.\nAdamu was represented by the Permanent Secretary, Echono.\nAdamu was again represented by the Permanent Secretary in the ministry, Echono."
  },
  {
    "headline": "EXCLUSIVE: Medical Tourism: One Of Buhari’s Ministers Has Been Away For Months, Undergoing Treatment Abroad",
    "summarized_story": "The Minister of Education, Adamu Adamu, is currently battling an undisclosed ailment in Germany and has been away from the country for months.\nOn May 27, the Federal Ministry of Education inaugurated a “Safe to School, Be Seen, Be Safe” initiative to ensure the children’s safety in and out of school.\nAdamu was represented at the occasion by the Minister of State for Education, Chukwuemeka Nwajiuba.\nAdamu was represented by the Permanent Secretary, Echono.\nAdamu was again represented by the Permanent Secretary in the ministry, Echono."
  },
  {
    "headline": "EXCLUSIVE: Ex-Nigeria's Police IG, Idris, Linked To N250million Unapproved Contracts At Police Academy",
    "summarized_story": "Idris served as the Inspector General between June 2016 and January 2019, and he is being asked to account for financial misappropriations at the police academy.\nThis query was contained in the annual report of the Auditor-General of the Federation for 2018, a copy of which was obtained by SaharaReporters.\nThe report alleged non-remittance of revenue, awards of unauthorised contracts as well as other financial infractions.\nThe funds were received in cash and the Academy was not on the Treasury Single Account (TSA) system at the time.\n“Furthermore, the project was abandoned, the stage of work and the details of payment made before abandonment was not disclosed."
  },
  {
    "headline": "EXCLUSIVE: Ex-Nigeria's Police IG, Idris, Linked To N250million Unapproved Contracts At Police Academy",
    "summarized_story": "Idris served as the Inspector General between June 2016 and January 2019, and he is being asked to account for financial misappropriations at the police academy.\nThis query was contained in the annual report of the Auditor-General of the Federation for 2018, a copy of which was obtained by SaharaReporters.\nThe report alleged non-remittance of revenue, awards of unauthorised contracts as well as other financial infractions.\nThe funds were received in cash and the Academy was not on the Treasury Single Account (TSA) system at the time.\n“Furthermore, the project was abandoned, the stage of work and the details of payment made before abandonment was not disclosed."
  },
  {
    "headline": "UK court jails Nigerian-born man for raping 13-year-old girl",
    "summarized_story": "The Croydon Crown court, England, has sentenced Adeyinka Ajose, a 64-year-old Nigerian-born manm to 18 years in prison for sexually assaulting a teenager.\nAdvertisementAjose was handed down the sentence on Thursday after admitting to multiple sexual offences committed against the victim.\nThe offences committed by Ajose are truly shocking and the sentence he has received reflects this,” Matthew Amos, the investigating officer, said.\nAdvertisement“If the victim had not had the courage to come forward, Ajose’s campaign of abuse may well have continued.\nI urge anyone who has been a victim of sexual abuse or who knows anything about it, to come forward to police."
  },
  {
    "headline": "UK court jails Nigerian-born man for raping 13-year-old girl",
    "summarized_story": "The Croydon Crown court, England, has sentenced Adeyinka Ajose, a 64-year-old Nigerian-born manm to 18 years in prison for sexually assaulting a teenager.\nAdvertisementAjose was handed down the sentence on Thursday after admitting to multiple sexual offences committed against the victim.\nThe offences committed by Ajose are truly shocking and the sentence he has received reflects this,” Matthew Amos, the investigating officer, said.\nAdvertisement“If the victim had not had the courage to come forward, Ajose’s campaign of abuse may well have continued.\nI urge anyone who has been a victim of sexual abuse or who knows anything about it, to come forward to police."
  },
  {
    "headline": "#BuhariMustGo protesters block Abuja airport road, set bonfire",
    "summarized_story": "#RevolutionNow protesters held a demonstration in the early hours of Monday along the highway leading to Nnamdi Azikiwe International Airport in the federal capital territory (FCT).\nAdvertisementThe protesters, seen in a video posted by Omoyele Sowore, convener of #RevolutionNow, on Twitter, microblogging platform, were chanting “Buhari must go”.\nIn the post accompanying the video, Sowore wrote: “#BuhariMustGo protest[ers] on the highway to the airport in Abuja this morning!\n#RevolutionNow.”Advertisement#BuhariMustGo protest on the highway to the airport in Abuja this morning!\nBoth of them were eventually released and Sowore was confined to Abuja by the court as part of his bail condition."
  },
  {
    "headline": "#BuhariMustGo protesters block Abuja airport road, set bonfire",
    "summarized_story": "#RevolutionNow protesters held a demonstration in the early hours of Monday along the highway leading to Nnamdi Azikiwe International Airport in the federal capital territory (FCT).\nAdvertisementThe protesters, seen in a video posted by Omoyele Sowore, convener of #RevolutionNow, on Twitter, microblogging platform, were chanting “Buhari must go”.\nIn the post accompanying the video, Sowore wrote: “#BuhariMustGo protest[ers] on the highway to the airport in Abuja this morning!\n#RevolutionNow.”Advertisement#BuhariMustGo protest on the highway to the airport in Abuja this morning!\nBoth of them were eventually released and Sowore was confined to Abuja by the court as part of his bail condition."
  },
  {
    "headline": "Know Your Rights: It's illegal for police to arrest you in place of another person",
    "summarized_story": "AdvertisementThe law also states that those arrested must be accorded humane treatment and that the officer(s) should have regard for the fundamental human rights of the arrested person.\nOne of such abuses of power is the arrest of someone in place of another person, which is known as ‘arrest by proxy‘ or ‘arrest in lieu‘.\nSection 7 of ACJA 2015 states “a person shall not be arrested in a place of a suspect”.\nThis implies that it is illegal for the police to arrest a father in the place of his son or a mother in the place of the father, especially in criminal cases.\nAdvertisementThe court had ruled on several cases that a person cannot be arrested in lieu of another person."
  },
  {
    "headline": "How to avoid investment scams in Nigeria",
    "summarized_story": "Over the past few weeks, two different scams have been uncovered in Nigeria.\nIt’s safe to say that many more investment scams will continue to spring up.\nOfficial website: https://t.co/HMfsRY9aCspic.twitter.com/i0gqGXYzjJ — Instablog9ja (@instablog9ja) May 28, 2021In it, the actor claimed that the company, Millionaires Club Investment, would give you 50% ROI (Return on Investment) in 3 days.\nLegitimate investment platforms are usually keen to inform you of the risks involved when you’re putting your money with them.\n“And you are licensed by…?”This is probably one of the most essential checks you must perform before you hand over funds to an investment company."
  },
  {
    "headline": "The Next Wave: $1.3 billion is not healthy enough",
    "summarized_story": "Between 2015 and 2020, 97 private equity and venture capital fund investments worth $1.3bn were made in health care in Africa.\nBetween 2015 and 2020, AVCA estimates that healthtech accounted for 35% of health care investments in Africa.\nIn 2020 alone, healthtech was the bright star too – gulping 45% of health care investments.\nBoluwatife Sanwo/TC InsightsAs with mPharma, new innovative health startups are relying on VC funding to rise to popular consciousness.\nCOVID-19, while an unfortunate pandemic, has spurred a welcome boost in visibility for healthcare startups."
  },
  {
    "headline": "After suspending Twitter, Nigerian government intensifies bid to control online media",
    "summarized_story": "The Buhari administration has stepped up efforts to regulate the online media in Nigeria in what is seen by many as attempts to further stifle the civic space in the country.\nMany have taken to Twitter to express criticism over the proposed regulation of online media.\nBREAKING: NBC Amendment Bill Is Social Media Bill Through The Backdoor — SERAP (@SERAPNigeria) June 17, 2021Amendment of the NBC act;grafting the shoot of autocracy.\n— #OurFavOnlineDoc 🩺🇳🇬🇬🇧💎 (@DrOlufunmilayo) June 17, 2021NBC Amendment Bill = Social Media Bill + Hate Speech Bill in disguise.\nThe government responded by suspending Twitter two days later and directed the NBC to immediately begin the process of licensing all over-the-top (OTT) media service and social media operations in Nigeria."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Google plans to support African founders and entrepreneurs with new $6m funding options",
    "summarized_story": "Google has announced opening up three new programmes targeted at supporting African entrepreneurs — the 6th cohort of Google for Startups Accelerator (GFSA) Africa, $3 million Black Founders Fund (BFF) Africa, and Google.org-backed $3 million grants for female entrepreneurs.\nNotably, the first virtual class of Google for Startups Accelerator Africa was launched last year due to the COVID-19 pandemic.\nAdvertisementBlack Founders Fund (BFF) AfricaSimultaneously, applications will be opened for the $3 million Black Founders Fund for African startups in their early stage.\nThe programme will have 50 African startups, led by Black founders, receive cheques between $50k and $100k.\nThis will also include seed capital in the form of cash grants and Google product support for 500 aspiring female entrepreneurs."
  },
  {
    "headline": "Nigeria’s intellectual property policy, sexual violence and tech, 5G deployment in Nigeria",
    "summarized_story": "Today, I’m discussing:A possible policy on intellectual property in NigeriaSexual violence and techThe latest news on 5G deployment in NigeriaNigeria’s intellectual property policyNigeria may get an intellectual property (IP) policy soon.\nThe COVID-19 pandemic, sexual violence, and techIn recent times, sexual violence cases seem to be on the rise.\nAccording to the United Nations, COVID-19-induced lockdowns exposed vulnerable people to more risk of sexual violence in 2020.\nAdvertisementOluwanifemi did a deep dive into the issue, highlighting the various ways tech and social media have helped combat sexual violence in Nigeria.\nRead: How tech tools create a safe space for sexual violence survivors in NigeriaMore on 5G deployment in NigeriaPhoto Credit: <a href=”https://www.flickr.com/photos/[email protected]/49713123696/”>Ivan Radic</a> Flickr via <a href=”http://compfight.com”>Compfight</a> <a href=”https://creativecommons.org/licenses/by/2.0/”>cc</a>It appears 5G deployment in Nigeria is gaining even more traction."
  },
  {
    "headline": "Again, Emirates bans Nigeria flights, extends South Africa route suspension",
    "summarized_story": "Dubai’s Emirates airline said passenger flights to and from Nigeria (Lagos and Abuja) are suspended with effect from June 21 until further notice.\n“We regret the inconvenience caused, and affected customers should contact their booking agent or Emirates call centre for rebooking,” said the airline.\nDaily passenger flights to Johannesburg will operate as EK763, but outbound passenger services on EK 764 remain suspended.\nCustomers who have been to or connected through South Africa in the last 14 days will not be permitted on any Emirates flights bound for Dubai.\nThe airline had on Saturday announced that it would be resuming flight operations in Nigeria from June 23rd."
  },
  {
    "headline": "What Abuja Land Swap initiative means for real estate sector, investors",
    "summarized_story": "Once again, investors and the federal capital territory administration (FCTA) Abuja are back to the table following approval for resumption of the ambitious Land Swap Initiative by the federal executive council (FEC) early last week.\nThe Abuja Land Swap initiated by the Bala Mohammed administration was valued then at N1 trillion.\nIt is the short form of the ‘FCT Land Infrastructure Swap Initiative’ designed to address the infrastructure deficit in the FCT.\nIn simple terms, the initiative means engaging the private sector to provide infrastructure in exchange for land.\nThey are given a certain percentage of the land developable within that district, while the FCT administration will take a certain percent too."
  },
  {
    "headline": "How Nigeria’s manufacturing sector can enjoy effective AfCFTA participation",
    "summarized_story": "The development and strategic positioning of Nigeria’s manufacturing sector is necessary for the country to enjoy the benefits that the Africa Continental Free Trade Area (AfCFTA) has to offer.\nAlthough many of them are being propelled by available resources and infrastructure to carry out the provisions of the pact.\nSimilarly, Similarly, Muda Yusuf, director-general, LCCI, said participation in the trade agreement will be challenging for local manufacturers, due to the different challenges bedevilling the sector, adding that the government is in a better position to help manufacturers by providing an enabling environment to make Nigerian manufacturing sector competitive.\nThe Manufacturers CEOs Confidence Index (MCCI) for Q4 2020 compiled by the Manufacturers Association of Nigeria (MAN) highlighted five major challenges hurting manufacturer’s performance.\nIn the CEO survey mentioned earlier, 92 percent of the respondents agreed that over-regulation by agencies of government restricts activities and hurt productivity in the manufacturing sector."
  },
  {
    "headline": "Court adjourns hearing on illegal acquisition of lands By Chinese companies until September 2021 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITTY- The hearing and resolution on the case of the 15 hectares of land own by a London-based business man, and illegally encroached and acquired by a Chinese company in Utesi Community in lkpoba Okha Local Government Area of Edo State has been fixed for September 21, 2021.\nIn her ruling, during the court proceedings, the presiding judge in Benin City high court, haven listened to the pleas of the counsel to the Chinese companies to give them time to explore avenues to settle with the claimant, Mr lbosa Osodin, adjourn hearing on the case, with suit number B/2452020, to 21st of September 2021.\nThe barrister, while frowning at the illegality perpetuated by the Chinese companies said, “We are not happy that our client, Mr Ibosa who is an investor will be treated in this manner” by foreigners whose companies have deliberately disregarded their corporate social responsibilities to the Utesi community by constant pollution and environmental degradation to the inhabitants of the community.\nBarrister Osula said further that, the case in point is a novel one, and certain that justice will not only be done, but will be seen to be done.\nHe said further that the Chinese companies cannot get away with their illegality, because “We are a firm believer of the legal philosophy that the court is the last hope of the common man”."
  },
  {
    "headline": "Edo begins use of revenue scratch cards in move to expand tax net – Nigerian Observer",
    "summarized_story": "Edo begins use of revenue scratch cards in move to expand tax netShare FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Internal Revenue Service, (EIRS) has introduced the use of Revenue Scratch Cards to simplify tax payment for businesses owners, particularly those in the informal sector.\nIn a statement, Head, Corporate Communications, EIRS, Courage Eboigbe, said: “The Revenue Scratch Card is part of the Edo Revenue Administration System (ERAS) mobile payment solution, which caters for individual businesses and ensures financial inclusion of the informal sector by recognizing each taxpayer who cannot obtain a tax clearance documentation.\n“With the use of the revenue scratch cards, taxpayers get instant notifications and receipts on transactions made.\nIt further enables taxpayers make payments from the comfort of their business premises, which eliminates waste of time and unnecessary bank queues.”He added that “Individual taxpayers are expected to purchase the face value of the Revenue Scratch Cards from EIRS licensed and approved dealers and their vendors.”The statement further enjoined taxpayers to always ensure purchased cards are processed and receipted by approved and designated Revenue Collectors (RCs) with a unique Point of Sale (PoS) device."
  },
  {
    "headline": "Omega Ministry church pastor beat wife to death in Akwa Ibom – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestA 49-year old Pastor, Ukachukwu Christopher, the General Overseer of Omega World Global Ministry (Fellowship Church) beat wife, Patience, 40, to death and secretly buried her corpse in a shallow grave in his compound.\nThe incident was learnt to have happened at Ikot Abia village in Eket Local Government area, Akwa Ibom State, where his Church is located.\nThe Police Public Relation Officer, Akwa Ibom command, SP Odiko Macdon who confirmed the incident disclosed that Police operatives from the State have arrested Christopher, detained him and he is undergoing interrogation over the alleged murder.\nIn other to cover his tracks, he dug a shallow grave in his compound and buried her.\nThe Commissioner of Police Akwa Ibom State, Andrew Amiengheme, has ordered the Deputy Commissioner of Police in-charge of the State Investigation and Intelligence Department to take over the matter for discreet investigation and assured that the suspect will be charge."
  },
  {
    "headline": "Obaseki reforms: Air Peace expands operations to Benin-Port Harcourt route – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWith the upgrade of facilities at the Benin Airport, supported by the Governor Godwin Obaseki-led administration, Nigeria’s biggest domestic carrier, Air Peace, has commenced operations on the Benin-Port Harcourt route.\nThe development is sequel to the expansion of airline operations at the airport, with Azman Air and Max Air commencing operations, in addition to the presence of Air Peace, Aero Contractors and Arik Air.\nAn official at the Benin Airport, who requested anonymity because he was not authorized to speak to the press, said the new route is strategic as it would provide a lifeline to people who would have been stuck on the deplorable East-West Road to Benin.\n“The new route is strategic and a welcome development.\nThe Governor Obaseki-led administration was instrumental to the upgrade of the airport, with support to install instrument landing and night landing equipment at the facility."
  },
  {
    "headline": "Delisted Centres: JAMB advises affected candidates to print new notification slips",
    "summarized_story": "ADVERTISEMENTThe Joint Admissions and Matriculation Board (JAMB) has advised candidates affected by the deletion some computer-based test centres from the list of approved centres taking part in the ongoing unified tertiary matriculation examination (UTME) to print new slips containing the details of their rescheduled examinations.\nA statement announcing the body’s regret on the inclusion of the university’s centre was shared with PREMIUM TIMES by Mr Benjamin.\nThe inclusion of Plateau State University, Bokkos, is regrettable.”The affected 24 centres are scattered across 11 states of the federation and the federal capital territory, FCT, Abuja.\nThe affected centres include Ihechukwu Madubuike Institution of Technology, Abia State; Keme Gold Nigeria Limited, Akwa Ibom State; Bishop Evans Ibeagha Juniorate CBT Centre, Anambra State; Bauchi Institute for Arabic and Islamic Studies, Bauchi State, among others.\n“You will recall that 24 centres were delisted for performing below the tolerable limit of the Board while over 40 others were put on the watch list,” Mr Fabian wrote in a statement."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Troops Kill 20 Terrorists In Borno Forest, Capture Weapons",
    "summarized_story": "The Nigerian Army has said troops of Sector 2 Joint Task Force North-East, Operation HADIN KAI, in conjunction with the Air Task Force overran Boko Haram Terrorists/Islamic State West Africa Province (BHT/ISWAP) camp in Lamboa forest killing over 20 fighters.\nAdvertisementsThe director, Army Public Relations, Brig-Gen. Onyema Nwachukwu, said the feat was achievedon Sunday, June 20, 2021 around Wartek in the general area of Lamboa forest.\nHe said the troops with close air support from the Nigerian Air Task Force component acting on credible intelligence swiftly carried out a simultaneous land and air offensive, penetrating deep into Lamboa forest in Borno state.\n“The gallant troops over ran the position of the terrorists with heavy volume of fire from both land and air, killing over 20 insurgents,” he saidThe troops also captured heavy fire weapons and arms, including three Anti Aircraft Guns, three AK 47 Rifles and two Gun Trucks, aside two other Gun Trucks that were destroyed by the troops.\nAdvertisementsThe COAS reiterated the commitment of the Nigerian Army under his leadership to bring terrorism and insurgency to an end in the North-East region."
  },
  {
    "headline": "Troops Kill 20 Terrorists In Borno Forest, Capture Weapons",
    "summarized_story": "The Nigerian Army has said troops of Sector 2 Joint Task Force North-East, Operation HADIN KAI, in conjunction with the Air Task Force overran Boko Haram Terrorists/Islamic State West Africa Province (BHT/ISWAP) camp in Lamboa forest killing over 20 fighters.\nAdvertisementsThe director, Army Public Relations, Brig-Gen. Onyema Nwachukwu, said the feat was achievedon Sunday, June 20, 2021 around Wartek in the general area of Lamboa forest.\nHe said the troops with close air support from the Nigerian Air Task Force component acting on credible intelligence swiftly carried out a simultaneous land and air offensive, penetrating deep into Lamboa forest in Borno state.\n“The gallant troops over ran the position of the terrorists with heavy volume of fire from both land and air, killing over 20 insurgents,” he saidThe troops also captured heavy fire weapons and arms, including three Anti Aircraft Guns, three AK 47 Rifles and two Gun Trucks, aside two other Gun Trucks that were destroyed by the troops.\nAdvertisementsThe COAS reiterated the commitment of the Nigerian Army under his leadership to bring terrorism and insurgency to an end in the North-East region."
  },
  {
    "headline": "UN-POLAC Appoints St. James Peace Advocate",
    "summarized_story": "The United Nations Positive Livelihood Award Centre (UN-POLAC), has appointed the group head of Commercial Services, Notore Chemical Industries Plc, Mr Tijjani St. James, as International Peace Advocate.\nUN-POLAC also focuses on the maintenance of peace and security and the restoration of human dignity.\nThe award letter reads: “In line with the UN General Assembly’s declaration, POLAC collaborates with UNESCO to commemorate the “International Day of Peace” (World Peace Day) 2021.\n“This appointment comes with the following benefit: UN-POLAC Certificate of Appointment; UN-POLAC International Identity Card; Investiture Apparel; UN-POLAC Flag of Authority to be hoisted at any place of your choice and UN-POLAC Special Vehicle Plate Number in collaboration with the FRSC.\n“As an International Peace Advocate, you can be called upon for peace making, conflict resolution and other activities that encourage peace and positive living in line with the best international practices."
  },
  {
    "headline": "UN-POLAC Appoints St. James Peace Advocate",
    "summarized_story": "The United Nations Positive Livelihood Award Centre (UN-POLAC), has appointed the group head of Commercial Services, Notore Chemical Industries Plc, Mr Tijjani St. James, as International Peace Advocate.\nUN-POLAC also focuses on the maintenance of peace and security and the restoration of human dignity.\nThe award letter reads: “In line with the UN General Assembly’s declaration, POLAC collaborates with UNESCO to commemorate the “International Day of Peace” (World Peace Day) 2021.\n“This appointment comes with the following benefit: UN-POLAC Certificate of Appointment; UN-POLAC International Identity Card; Investiture Apparel; UN-POLAC Flag of Authority to be hoisted at any place of your choice and UN-POLAC Special Vehicle Plate Number in collaboration with the FRSC.\n“As an International Peace Advocate, you can be called upon for peace making, conflict resolution and other activities that encourage peace and positive living in line with the best international practices."
  },
  {
    "headline": "Zulum Moves To Reopen Farms In Borno Communities",
    "summarized_story": "Borno State governor, Babagana Umara Zulum, yesterday visited Mulai and Dalwa communities and also met with security operatives to begin modalities for reopening of farmlands along that axis, so as to avoid livelihoods crisis.\nAdvertisementsZulum’s decision was in compliance with Thursday’s directive to the Nigerian military and other security agencies by President Buhari to work with Borno State Government and come with modalities that would allow people have access to their farmlands.\nHe assessed farmlands and interacted with the security operatives ahead of the resumption of farming activities.\nZulum has always held view that keeping resettled communities out of agricultural activities could lead to serious food crisis in the state arguing that food aid from foreign and local donors was unsustainable.\nI will also establish a personal farmland along this axis which i will visit on work free days,” Zulum said."
  },
  {
    "headline": "NAFDAC to register, certify premises of chemical manufacturers — Daily Times Nigeria",
    "summarized_story": "The National Agency for Food and Drug Administration and Control (NAFDAC) is set to register, certify premises of chemical manufacturers in order to boost the nation’s economy.\nIt has also agreed with manufacturers of chemical products in Nigeria to explore the international market with chemical products to enhance the nation’s foreign exchange earnings.\nAdeyeye disclosed that the directorate has put in place effective regulations and guidelines for sound chemical management in Nigeria.\nShe further said that chemical products manufactured in Nigeria would enjoy wider acceptability and high competitiveness with the NAFDAC registration identity.\nAccording to De-Konnick, NAFDAC’s involvement in regulating the chemical manufacturing sector will bring it to limelight and reposition Nigeria chemical industry for economic growth."
  },
  {
    "headline": "Abduction: Kebbi schools shut down indefinitely — Daily Times Nigeria",
    "summarized_story": "Following the abduction of students and staff from the Federal Government College in Birnin Yauri by bandits, seven schools in Kebbi have been closed indefinitely.\nAccording to Isah Arzika, Chairman of the Nigeria Union of Teachers, the schools that have been closed indefinitely are in locations prone to bandit assaults.\n“Government has given us an order and option to take any necessary action as far as our schools are concerned.\nThat we can close those schools which we think are not safe and prone to attacks in the areas close to the forest,” he stated.\n“I am not talking about only boarding schools, any school that is on the front line, and it is not safe."
  },
  {
    "headline": "JAMB blames NIN as revenue falls to N5.8bn —",
    "summarized_story": "It claimed that the NIN requirement made it impossible for some potential candidates to register, resulting in a decrease in the number of candidates registered and the proceeds received from form sales.\nAccording to the PUNCH, the sale of forms for the 2021 UTME/DE produced N5,887,628,900 for JAMB.\nThe amount is less than the N6,563,086,710 generated by the board from forms in 2020.\nWe know that things like the addition of the NIN to the registration procedure had a negative impact.\nThe estimates are based on a total of over two million candidates who have registered for the 2020 election."
  },
  {
    "headline": "Court remands 3 men for allegedly stealing 7 refrigerators — Daily Times Nigeria",
    "summarized_story": "An Ikeja Chief Magistrates’ Court on Monday ordered that three men who allegedly stole seven refrigerators worth N1.4million at gun point, be remanded in a correctional centre.\nAriyo, who did not take the plea of the suspects, ordered that they should be kept in Kirikiri Correctional Centre, Lagos.\nAriyo ordered the police to return the case file to the Lagos State Director of Public prosecutions for legal advice.\nALSO READ: For DSO, a little consideration for the ordinary NigerianJohn said the suspects, armed with sticks, cutlasses, gun and other offensive weapons, robbed Mr Cyril Chukwu of seven refrigerators worth N1.4 million, property of SIMS Nig.\nThe offence, he said, contravened the provisions of sections 297(1)(2)(a)(b) and 299 of the Criminal Laws of Lagos State, 2015 (NAN)."
  },
  {
    "headline": "JAMB delists 25 CBT centres for not conducting exam",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) has delisted 25 Computer-Based Testing (CBT) Centres that failed to conduct examinations on Saturday – the first day of the 2021 Unified Tertiary Matriculation Examination (UTME).\nSix of those centres were canceled in Lagos – the highest in the country.\nA statement by JAMB’s head of media, Dr. Fabian Benjamin directed the candidates scheduled to write their examination in the affected centres to check for new instructions on their new centres and dates on their profile, phones or emails.\nThe statement reads: “The following centres who failed during the conduct of the 2021 UTME on Saturday, June 19, 2021, are hereby delisted.\nCandidates posted to any of these centres are required to await further directives by checking their profile, email addresses and SMS on their registered phone for a new date.” NationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "JAMB delists 25 CBT centres for not conducting exam",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) has delisted 25 Computer-Based Testing (CBT) Centres that failed to conduct examinations on Saturday – the first day of the 2021 Unified Tertiary Matriculation Examination (UTME).\nSix of those centres were canceled in Lagos – the highest in the country.\nA statement by JAMB’s head of media, Dr. Fabian Benjamin directed the candidates scheduled to write their examination in the affected centres to check for new instructions on their new centres and dates on their profile, phones or emails.\nThe statement reads: “The following centres who failed during the conduct of the 2021 UTME on Saturday, June 19, 2021, are hereby delisted.\nCandidates posted to any of these centres are required to await further directives by checking their profile, email addresses and SMS on their registered phone for a new date.” NationShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Ohanaeze warns: Jihad won’t work in South- East",
    "summarized_story": "It said that such an attempt would be resisted with everything available to Ndigbo.\nThe National Publicity Secretary of Ohanaeze Ndigbo, Chief Alex Ogbonnia, who stated this in an exclusive interview with The PUNCH, noted that what had succeeded 200 years ago in form of a jihad would no longer succeed now.\nOgbonnia cautioned that if that was the reason the regime of the President, Major General Muhammadu Buhari (retd.\nThe kind of operation that succeeded 200 years ago cannot succeed now.\nEven if they’re contemplating jihadism, it cannot walk.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Ohanaeze warns: Jihad won’t work in South- East",
    "summarized_story": "It said that such an attempt would be resisted with everything available to Ndigbo.\nThe National Publicity Secretary of Ohanaeze Ndigbo, Chief Alex Ogbonnia, who stated this in an exclusive interview with The PUNCH, noted that what had succeeded 200 years ago in form of a jihad would no longer succeed now.\nOgbonnia cautioned that if that was the reason the regime of the President, Major General Muhammadu Buhari (retd.\nThe kind of operation that succeeded 200 years ago cannot succeed now.\nEven if they’re contemplating jihadism, it cannot walk.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Arewa: Nigeria will burn if Northerners retaliate attacks",
    "summarized_story": "The Arewa Consultative Forum (ACF), has said that Nigeria will be in flames if Northerners retaliate the attacks on them in other regions.\nEmmanuel Yawe, ACF’s spokesman, said this while cautioning Northern youths against retaliation in the face of all forms of provocations.\nYawe begged Northern youths to remain calm and not set Nigeria ablaze by avenging attacks.\nYawe in a statement recalled how the 1960’s retaliatory killings set the country in flames.\n“So we will continue to advise northern youths not to take the law into their hands, they should remain calm and not set the country ablaze,” he said."
  },
  {
    "headline": "NGX suspends trading in Guaranty Trust Bank shares",
    "summarized_story": "The Nigerian Exchange Limited (NGX) has announced the full suspension of trading in the shares of Guaranty Trust Bank Plc.\nAccording to the bulletin, the suspension is in preparation for the eventual delisting of the bank from the Daily Official List of the Nigerian Exchange Limited (NGX).\nIt will then be listed as Guaranty Trust Holding Company Plc on NGX”Outside Nigeria, the bank has 10 banking subsidiaries in nine other African countries and the United Kingdom.\nThe countries are Ivory Coast, Gambia, Ghana, Kenya, Liberia, Rwanda, Sierra Leone, Tanzania and Uganda."
  },
  {
    "headline": "Kumuyi breaks silence on youths obstructing service to celebrate his 80th birthday",
    "summarized_story": "General Superintendent, Deeper Christian Life Ministry, Pastor William Kumuyi has lifted punishment meted out to some youths of the church who obstructed a Sunday worship service to celebrate his 80th birthday.\nService was temporary obstructed as they were overjoyed, singing and blowing the trumpets and other musical instruments.\nThis was the first time such a thing has occurred in the history of Deeper Life, a conservative holiness church.\nWhile some were happy, others felt the youths have compromised the standard of the church.\nKumuyi thanked the youths for honouring him with their musical instruments."
  },
  {
    "headline": "Nigerian Youths Are Their Own Worst Enemies—- Fani-Kayode",
    "summarized_story": "Femi Fani-Kayode, the former Minister of Aviation, has argued that Nigerian youngsters are the creators of their own issues, citing unemployment and other crises.\nThe human rights lawyer bemoaned the kids’ lack of togetherness and contentment, advising them to “use their resources in attempting to come together.”In a verified Twitter account, Fani-Kayode made the statement on Monday.\nHe described how some young people turned nefarious when he tried to assist them in finding work.\nThe tweet reads, “I am convinced that this generation of Nigerian youths are their own worst enemies.\n“We had slots for three jobs for youths."
  },
  {
    "headline": "Nobody Can Stop Yoruba Nation Rally In Lagos — Sunday Igboho",
    "summarized_story": "Sunday Adeyemo, also known as Sunday Igboho, a Yoruba activist, has claimed that nothing will stop the scheduled Yoruba Nation protest in Lagos.\nNEWS DIRECT reported that Sunday Igboho is expected to storm Lagos on July 3, 2021 at the Ojota park for a Yoruba Nation rally.\nIt will be remembered that similar rallies were staged in the states of Osun, Ogun, Ekiti, and Ondo.\nSunday Igboho, speaking through his spokeswoman, Olayomi Koiki, during a live video conference, insisted that the Yoruba Nation peaceful march would not be called off.\n“We have gone to Ogun, Ondo, Osun, Ekiti and we had peaceful rallies, so nobody can stop us from not coming to Lagos,” he said."
  },
  {
    "headline": "PHOTOS: Protesters Block Highways In Abuja, Demand Buhari’s Removal",
    "summarized_story": "Some protesters have stormed several highways in Abuja, demanding the removal of Buhari over his ‘poor performance’ as President.\nThe protesters burnt tyres and halted vehicular movement on the highway.\nThe protesters were also seen holding cardboards and placards, chanting #BuhariMustGo and anti-government slogans.\nSee photos below:Details later…"
  },
  {
    "headline": "Buhari Ready To Talk With South-East Over Agitations — Ngige",
    "summarized_story": "President Muhammadu Buhari has endorsed the adoption of dialogue to address agitations in the South-East, according to Minister of Labour Chris Ngige.\nNgige made the revelation to State House media on Sunday after meeting with Buhari in Abuja.\nParts of the south-east have been calling for secession, with the outlawed Indigenous People of Biafra (IPOB) at the forefront of the battle.\nNgige said: “We are following up with dialogue, which at the end of the day, is what will happen.\n“We briefed him and he accepted that dialogue is the way to go in all this.”"
  },
  {
    "headline": "Pictures: Flood takes over Ijebu Ode in Ogun",
    "summarized_story": "PreviousAPC needs Al-Makura to win in 2023"
  },
  {
    "headline": "VIDEO: Elizabeth Anyanacho gets gold, reacts thereafter at Beirut Open",
    "summarized_story": ""
  },
  {
    "headline": "29 bandits killed in Benue, Niger gunfire, NAF shells terrorists, neutralise scores in Borno",
    "summarized_story": "Fourteen bandits were Sunday morning gunned down during an attack on Police Station in Katsina-Ala, Benue state.\nShe said: “It is no longer news that series of operations are going on in Kastina-Ala Local Government Area of Benue State.\nNAF shells terroristsAlso in yet another victory over the criminal elements, the fighter aircraft of the Nigerian Air Force (NAF) Sunday eliminated scores of ISWAP-Boko Haram terrorists, including their commanders in Lamboa in Kaga local government area of Borno state.\nBut the terrorists were swiftly engaged by ground and air troops, who foiled their missions after the NAF reconnaissance platform had earlier hovered over the location before the airstrikes.\n“Currently, the ground troops of the Nigerian Army and our air elements are mopping up the area and assessing the situation."
  },
  {
    "headline": "APC Convention: Serving Niger Senator tipped to emerge Chairman -NigPilot",
    "summarized_story": "As preparation for the National Convention of the All Progressives Congress , APC, gears up, a chieftain of the party has revealed that a dark horse might emerge as the National Chairman of the party.\nThe chieftain who craved anonymity said that the dark horse is a serving Senator from Niger State.\nAccording to him, two aspirants have indicated interest from Niger State, a former Minister and Serving Senator but the lot favors the serving Senator.\nThey are all seeing to carry one baggage or the other that may affect the fortunes of the party come 2023.\nHowever, the APC Caretaker/Extraordinary Convention Planning Committee has not concluded the date for the National Convention as the proposed time table for the congresses is before the President, Muhammadu Buhari awaiting approval."
  },
  {
    "headline": "Troops kill 20 terrorists in Lamboa forest -NigPilot",
    "summarized_story": "Director Army Public Relations, Brigadier General Onyema Nwachukwu made the disclosure in a statement.\nThe Army Spokesperson said, “Acting on credible intelligence, the troops with close air support from the Air Task Force component swiftly carried out a simultaneous land and air offensive, penetrating deep into Lamboa forest in Borno state.\nThe gallant troops over ran the position of the terrorists with heavy volume of fire from both land and air, killing over 20 insurgents.\nHe added that the Chief of Army Staff (COAS) Major General Faruk Yahaya has since congratulated the troops for the successful conduct of the operation.\nHe also enjoined the troops to sustain the ongoing offensive under Operation Hadin Kai, until the insurgents are completely surmounted."
  },
  {
    "headline": "Soldiers kill six terrorists in latest attack at Kumshe town -NigPilot",
    "summarized_story": "The Nigerian Army said that troops of Operation Hadin Kai killed six Boko Haram terrorists in a repel attack at Kumshe town.\nDirector Army Public Relations, Brigadier General Onyema Nwachukwu in a statement said the terrorists mounted on four Gun Trucks and several motorcycles attempted to infiltrate and attack the camp through the northern part of the troops’ deployment.\n“The terrorists mounted on 4 Gun Trucks and several motorcycles attempted to infiltrate and attack the camp through the northern part of the troops’ deployment, but were met with the fierce fire of the highly alert troops, resulting in the instant killing of 6 BHTs.\nHe said that the Chief of Army Staff, Major General Faruk Yahaya has lauded the troops’ high level of alertness and fighting spirit.\nThe COAS also urged them to sustain the momentum and ensure that the remnants of terrorists hibernating in the area are completely cleared."
  },
  {
    "headline": "FGC abduction: Troops rescue another teacher, students -NigPilot",
    "summarized_story": "The Nigerian Army said that troops of Operation Hadarin Daji in collaboration with Nigerian Air Force have rescued more abductees of the FGC Birnin Yawuri.\nDirector Army Public Relations, Brigadier General Onyema Nwachukwu in a statement said thatone teacher and three students were rescued on Saturday at Makuku, in the ongoing search and rescue operations.\n“The troops also killed one bandit and recovered nine motorcycles and four handsets from the fleeing bandits.\nAdditional troops have also been deployed to dominate the forest and deny the bandits freedom of action,” the statement further disclosed.\nThe Army spokesperson recalled that two teachers and five students were earlier on Friday 18 June 2021 rescued by the gallant troops in a coordinated fire fight with the kidnappers."
  },
  {
    "headline": "Troops Kill Over 20 Boko Haram/ISWAP Terrorists In Lambom Forest",
    "summarized_story": "Nigerian Army troops of Sector 2 Joint Task Force North East Operation HADIN KAI in conjunction with the Air Task Force on Sunday 20 June 2021 inflicted heavy casualty on Boko Haram and Islamic State West Africa Province (ISWAP) Terrorist groups who were camping around Wartek in the general area of Lambom Forest.\nActing on credible intelligence, the troops with close air support from the Nigerian Air Task Force component swiftly carried out a simultaneous land and air offensive, penetrating deep into Lambom forest in Borno state.\nGeneral Nwachukwu disclosed that the Chief of Army Staff (COAS) Major General Faruk Yahaya has congratulated the troops for the successful conduct of the operation.\nThe COAS enjoined the troops to sustain the ongoing offensive under Operation HADIN KAI, until the insurgents are completely surmounted.\nDuring his visit to the hospitals, he assured troops of adequate medicare and support in the ongoing counter-insurgency operations."
  },
  {
    "headline": "Senator Blames Poor Security Arrangement For Kebbi School Abduction",
    "summarized_story": "﻿The Senator Representing Kebbi North, Yahaya Abdullahi, has blamed what he describes as a poor security arrangement in the country for the Kebbi School abduction.\n“If there were enough men on the ground like about 100 well-armed policemen, this kind of thing would not be happening”.\n“These things have their roots in the very serious security architecture that we inherited over a long period of time.We have to look at these issues from a historical perspective,” he added.\nRead Also: Kebbi School Abduction: Troops Rescue Another Teacher, Three StudentsSenator Abdullahi, however, noted that while the issue did not start with the All Progressives Congress (APC), hopefully, it will end with the party.\nThe incident is the latest in a series of increasing school abductions across the country."
  },
  {
    "headline": "President Buhari Initiating Dialogue With South-East Leaders – Ngige",
    "summarized_story": "﻿President Muhammadu Buhari has affirmed that dialogue is the way to go to resolve the security situation in the south-east.\nThis is according to the Minister of Labour and Employment, Senator Chris Ngige, after a meeting with President Muhammadu Buhari on Sunday, alongside the President’s Chief Of Staff, Prof. Ibrahim Gambari.\nAddressing state house correspondents after the meeting, Senator Ngige said the President has also enabled series of dialogues to be held with leaders in the region.\nMeanwhile, members of the South East Governors’ Forum have condemned the activities of secessionist groups in the region and other parts of the country.\nIn a bid to tackle the security challenges and restore peace in the region, the governors went beyond their political differences and met on Saturday in Enugu State."
  },
  {
    "headline": "Kebbi School Abduction: Troops Rescue Another Teacher, Three Students",
    "summarized_story": "A statement signed on Sunday by the Director Army Public Relations, Brigadier General Onyema Nwachukwu, disclosed that one teacher and three students were rescued on Saturday at Makuku in the ongoing search and rescue operations.\nAccording to the statement, the troops also killed one bandit, recovered nine motorcycles and four phones from the fleeing bandits.\nTwo teachers and five students had been rescued on Friday by the gallant troops in a coordinated firefight with the kidnappers.\nBandits had attacked the school in the early hours of Thursday, whisking away a yet to be confirmed number of students and teachers.\n“In the early hours of this morning, we have come across the kidnappers."
  },
  {
    "headline": "Armenia PM party Wins Majority In Snap Polls",
    "summarized_story": "Armenian Prime Minister Nikol Pashinyan’s party won 53.9 percent of the vote in snap parliamentary polls called in an effort to defuse a political crisis after a war with Azerbaijan, official results showed Monday.\nPashinyan hours earlier claimed victory based on early results, but Kocharyan’s grouping swiftly contested the vote and alleged election fraud.\n“The people of Armenia gave our Civil Contract party a mandate to lead the country and personally me to lead the country as prime minister,” Pashinyan announced in the small hours of Monday.\nVoter Anahit Sargsyan said the prime minister, who spearheaded peaceful protests against corrupt elites in 2018, deserved another chance.\nPashinyan brandished a hammer at rallies, while Kocharyan said he would be ready to fight the prime minister in a duel."
  },
  {
    "headline": "Bill to legalise assisted dying to be introduced to Scottish Parliament",
    "summarized_story": "In Scotland, a third attempt is being made to enact legislation legalizing assisted dying.\nLiam McArthur, a Liberal Democrat MSP, has proposed a Members Bill at Holyrood that, if passed, would allow assisted dying for terminally ill persons who are mentally competent.\nMr McArthur’s effort to “create safe and humane assisted dying laws in Scotland” has already received support from a cross-party group of a dozen MSPs.\nMr McArthur’s proposed Assisted Dying Scotland Bill, which is being supported by Dignity In Dying Scotland, Friends At The End and the Humanist Society Scotland, is being lodged at Holyrood on Monday.\nIt seeks to legalise assisted dying as a choice for adults who are both terminally ill and mentally competent, with a consultation planned for the autumn."
  },
  {
    "headline": "Police inspector kills five, left many wounded in Enugu",
    "summarized_story": "A trigger-happy police officer attached to RC Lotto Company Enugu, allegedly shot five persons to death in Enugu.\nThe incident, which left Governor Ifeanyi Ugwuanyi terribly shocked, also saw four others hospitalised.\nMr Ugwuanyi, who visited the injured victims at Enugu State University of Technology (ESUT) Teaching Hospital Parklane, Enugu expressed shock over the incident.\nThe Governor, who was received at the hospital by Enugu Commissioner of Police, Enugu State Command, Mohammed Ndatsu Aliyu and the Chief Medical Director, Prof. Hyacinth Onah, condoled with families of the deceased.\nAdvertisementThe Governor equally charged the hospital management to ensure the victims receive adequate medical attention."
  },
  {
    "headline": "Kebbi State government closes 7 schools over fear of bandits",
    "summarized_story": "Kebbi State government has closed seven schools considered unsafe following the recent abduction of students and teachers of Federal Government College(FGC) Birnin Yauri by bandits.\nChairman Kebbi chapter of the National Union of Teachers (NUT), Isah Arzika stated this.\nArzika said the shut schools are in vulnerable areas of the state believed to be soft targets for bandits.\nArzika said the state government had directed all principals to close any school considered not safe.\nThat we can close those schools which we think are not safe and prone to attacks in the areas close to the forest."
  },
  {
    "headline": "Iran’s Hard-line President-elect Raisi Says He Won’t Meet with Biden",
    "summarized_story": "Iran’s president-elect said Monday he wouldn’t meet with President Joe Biden nor negotiate over Tehran’s ballistic missile program and its support of regional militias, sticking to a hard-line position following his landslide victory in last week’s election.\nJudiciary chief Ebrahim Raisi also described himself as a “defender of human rights” when asked about his involvement in the 1988 mass execution of some 5,000 people.\nThe victory of Raisi, the protege of Iran’s supreme leader sanctioned by the U.S. in part over his involvement in the mass executions, came amid the lowest turnout in the Islamic Republic’s history.\nIn official results, Raisi won 17.9 million votes overall, nearly 62% of the total 28.9 million cast.\nRepresentatives of the world powers party to the deal returned to their capitals for consultations following the latest round of negotiations on Sunday."
  },
  {
    "headline": "Tokyo Olympics to Allow Limit of 10,000 Local Fans in Venues",
    "summarized_story": "The Tokyo Olympics will allow some local fans to attend when the games open in just over a month, organizing committee officials and the IOC said on Monday.\nOrganizers set a limit of 50% of capacity up to a maximum of 10,000 fans for all Olympic venues.\nThe Tokyo Games are set to open on July 23.\nOfficials say local fans will be under strict rules.\nTokyo Governor Yuriko Koike also said before the the talks that fans may need to be banned if conditions changes."
  },
  {
    "headline": "Nigeria: Government, Operators Move to End $2bn Aircraft Maintenance Capital Flight",
    "summarized_story": "As part of efforts to end the huge capital flight spent on maintenance of aircraft overseas put at $2 billion annually, some operators in the aviation industry and the Akwa Ibom State government have taken steps towards developing maintenance facilities in Nigeria.\nThe maintenance facilities would, in turn, be a source of forex earner for the country as airlines and aircraft owners in Africa and beyond could maintain their equipment in Nigeria.\nIt makes me happy that the owners of these maintenance facilities have a good purpose.\n“What makes me happy is that there is a huge market for these maintenance facilities.\nHe also spoke about the cost of taking aircraft overseas for maintenance, saying: “I think there are so many disadvantages to taking your aircraft out of the country for maintenance."
  },
  {
    "headline": "Nigeria: Niger Delta Elders Urge President to Inaugurate Development Commission Board Now",
    "summarized_story": "In a letter to the president, the Niger-Delta chiefs described the Interim Management team set up by the Minister of Niger Delta, Senator Godswill Akpabio, as illegal and unacceptable, saying it negates the Act that establishes the commission.\nThey argued that the Act establishing the NDDC does not contemplate interim management to take over the management of the commission.\n“We make bold to say that the interim caretaker committee set up by the Minister of Niger Delta Affairs is not a legal entity as same is not recognized by law.\nTherefore, there is no confusion in the NDDC that will warrant the setting up of an interim management committee.\n“We, therefore, demand the immediate dissolution of the interim caretaker committee in the interest of peace and development of the Niger Delta Area, which we stand for as your Excellency may have been ill-advised by some self-seeking persons contrary to the spirit and the intendment of the Act setting up the Niger Delta Development Commission,” the Niger Delta’s leaders added."
  },
  {
    "headline": "Apple Daily Could Shut ‘in Days’ after Hong Kong Asset Freeze",
    "summarized_story": "“We thought we’d be able to make it to the end of the month,” Simon told the news agency.\n“Certainly these are dark days for the journalistic community in Hong Kong,” Al Jazeera’s Adrian Brown said from outside the Apple Daily.\nLai, 73, is now jailed and facing trial under the national security law.\nThree companies related to Apple Daily are also being prosecuted for “collusion” with foreign powers and authorities have frozen 18 million Hong Kong dollars ($2.3 million) of their assets.\n“These are all orders from basically the Secretary of Security, we are facing a security agency we are not facing courts,” Simon told CNN."
  }
]