[
  {
    "headline": "Afenifere, Ohanaeze, South-South demand new constitution before 2023",
    "summarized_story": "Major socio-political organisations in Nigeria have demanded what they described as a “new people-oriented federal constitution” before the 2023 general elections, saying the 1999 constitution does not represent the interest of the masses.\nThey also unanimously agreed that the new constitution should provide for a “true federalism that heralds a restructured Nigeria,” while the 2023 Presidency should be zoned to the South.\nThe communique reads, “The meeting asserts that Nigeria needs a ‘new people-oriented federal constitution’ before the 2023 general elections given that the current 1999 constitution does not represent the interests of the people.\n“The meeting demands the convening of an emergency ‘national conference ’ to take place in the Year 2022 to fashion out a new federal constitution on the way forward for the federating regions.\nThe meeting agrees that the ‘2023 Presidency’ should be zoned to the South."
  },
  {
    "headline": "Reps screen Yahaya for confirmation as Army chief today",
    "summarized_story": "The House of Representatives will on Tuesday screen Major General Farouk Yahaya for confirmation as Chief of Army Staff, The PUNCH has learnt.\nThe President, Major General Muhammadu Buhari (retd.\nUntil his appointment, Yahaya was the Theatre Commander, Operation Hadin Kai, responsible for counter-terrorism and counter-insurgency operations in the North-East.\nWhen his appointment is confirmed, Yahaya is expected to be elevated to the rank of Lieutenant General, leaving the Chief of Defence Staff, General Leo Irabor, as the most senior in the Armed Forces.\nBuhari had skipped 29 Major Generals and appointed Yahaya, who is a member of Regular Course 37, as Army chief, a move that has been generating controversy in the last two weeks."
  },
  {
    "headline": "Ned Nwoko blames insecurity on collapse of LG system",
    "summarized_story": "Ned Nwoko, has blamed the worsening insecurity in the country, on lack of functional local government system.\nThe Founder of Ned Nwoko Foundation , gave this opinion in Abuja when he delivered a Democracy Day lecture titled ” Getting It Right Ahead of 2023″ organised by the Nigeria Union of Journalists (NUJ) FCT Correspondent Chapel.\n“All the chairmen I have spoken with, are eager to ensure that they have independence.”Besides, the Independent National Electoral Commission (INEC) is not operating as an independent body and according to its mandate.\nHe explained that only a true independent electoral body woold guarantee the free and fair of election in 2023.\nWhile speaking on the rift between Twitter and the Federal government, Hon Nwoko, commended the decision of the government on the suspension of Twitter operation in Nigeria."
  },
  {
    "headline": "Nigeria needs unifying, proactive leaders — Osinbajo",
    "summarized_story": "Yemi OsinbajoVice President Yemi Osinbajo says the current challenges affecting the country require proactive leaders who are prepared to bring Nigerians together.\nOsinbajo’s spokesman, Laolu Akande, in a statement on Monday in Abuja, said the vice president expressed this view in Lagos during a courtesy visit to the palace of Oniru of Iruland, Oba Abdulwasiu Lawal.\nOsinbajo commended Lawal for being a leader to people of diverse socio-ethnic backgrounds“Our country needs all the leaders, the best leaders, the most proactive leaders, leaders prepared to bring the country together.\nEarlier in his remarks, Lawal thanked the vice president for his leadership and commitment to the progress of the country.\n“The relationship between the vice president and I had been very cordial."
  },
  {
    "headline": "Robbers escape with wounds as Kaduna Police foils robbery attack",
    "summarized_story": "By Ibrahim WuyoOperatives of the Kaduna Police Command have foiled a robbery attack in the Tudun Wada area and recovered ammunition and an operational vehicle.\nHe said in view of the report, the Police patrol team were immediately dispatched to the area.\nAlso Read: Cross River gov, Ben Ayade, defects to APC“The hoodlums on sighting the Police patrol vehicle, started shooting berserkly.\nThe Officers involved were very tactical in response and their operational sagacity succeeded in repelling the attack.\nThe Command therefore, requested for information about any person(s) found with bullet wound(s) ,adding that such should be reported to the Police for immediate action."
  },
  {
    "headline": "Abducted UN staff regains freedom",
    "summarized_story": "By Ndahi Marama – MaiduguriThe Islamic State of West African Province, ISWAP, has released a senior Protection Assistant with the United Nation High Commission for Refugees, UNHCR, Abubakar Garba-Idris Alooma, who was abducted on Maiduguri/Damaturu highway.\nAlooma was abducted precisely at about 4pm on 2nd January 2021, while on his way to Maiduguri, where he is based.\nALSO READ:The source also revealed that a businessman, Muazu Bawa, who was also kidnapped on that same day was also released along eight other captives all undergoing debriefing by the military.\n“I was together with someone who called a family member of Alooma and he has confirmed the release of his brother.\nThis is encouraging news and we pray that more captives should be released soon,” Mr Shehu said."
  },
  {
    "headline": "2023: I have no annointed candidate, delegates will decide my successor — Ganduje",
    "summarized_story": "Ganduje also said he is not tired neither is he retiring from active politics after his tenure as Governor by 2023.\nIf God wants us all to be of one tribe, all of us will be of one tribe.\nOf God wants us to be of one religion, all of us will be of one religion.\nIn fact if God wants us created as birds flying all over the place, all of us would have been flying all over the place.\nThat is my dream about Nigeria,” Governor Ganduje however stated."
  },
  {
    "headline": "Nigerians need leaders that can unite the country",
    "summarized_story": "Nigeria’s Vice-President, Yemi Osinbajo, has said only proactive leaders can solve the challenges affecting the country.\nOsinbajo made these remarkes on Monday, when he paid a courtesy visit to Abdulwasiu Lawal, Oniru of Iruland, in Lagos.\n“Our country needs all the leaders — the best leaders, the most proactive leaders, leaders prepared to bring the country together,” he said.\nConstitution Review: Nigeria needs proactive restructuring for peaceful coexistence – Osun Speaker“Lagos is a microcosm of Nigeria.\nIf things work out well here, things will be okay in the country."
  },
  {
    "headline": "Buni reacts as fire razes down Fika Emir palace",
    "summarized_story": "Yobe State Governor, Mai Mala Buni has commiserated with the Emir of Fika and Chairman Yobe state Council of chiefs, Alhaji Muhammadu Abali Ibn Muhammadu Idrisa, over unfortunate fire incident at the Palace on Monday.\nGovernor Buni who reacted in a statement released by his spokesman, Mamman Mohammed, described the fire inferno that consumed a chamber at the Palace as a great loss to the emir, the Emirate and the state.\n“l am deeply saddened by the sad news of the fire incident today at the palace of His Highness, the Emir of Fika.\n“However, we are all consoled and give thanks to Almighty Allah that no life was lost nor injuries recorded”, Buni said.\nThe governor asked the Emir to have faith that this was destined to happen at this moment and prayed that it never happen again, while praying to God to replenish assets lost to the inferno."
  },
  {
    "headline": "Fani-Kayode reacts as Nigerian Army begs Boko Haram, ISWAP for reconciliation",
    "summarized_story": "Femi Fani-Kayode, a former Minister of Aviation, says he’s still in shock by the Nigerian Army’s decision to demand reconciliation with members of Boko Haram/ISWAP terrorists.\nThe call for reconciliation was made by the General Officer Commanding (GOC), 7 Division, Nigerian Army, Brigadier General Abdulwahad Eyitayo at a party organised for journalists by the Army in Maiduguri, the Borno State capital on Sunday.\nAnd reacting, the Peoples Democratic Party, PDP, chieftain wonders when the army began begging terrorists for reconciliation.\n“Nigerian Army BEGS Boko Haram, ISWAP terrorists for reconciliation.\n“Since when has the Nigerian Army resorted to begging murderers, killers and terrorists?"
  },
  {
    "headline": "Southeast leaders, FG criticized for alleged exclusion of agitators in security meeting",
    "summarized_story": "Okechukwu Isiguzoro, the Secretary-General of the apex Igbo socio-cultural organization, Ohanaeze Ndigbo, has berated the recent security meeting of southeast leaders with representatives of the federal government held in Enugu during the weekend.\nThe meeting was held inside Enugu Government House with the southeast leaders reaffirming their commitment to the sustenance of a united Nigeria where there is justice, equity and equality of all Nigerians.\nHe regretted that the security parley excluded critical stakeholders and the agitators, declaring that with the alleged exclusion, all resolutions adopted in the purported southeast security meeting is null and void.\nIsiguzoro opined, “southeast leaders are playing to the gallery.\nDoyin Okupe warned against incisive comments against Igbo nation“The southeast leaders should as a matter of urgency, consult with the leadership of Ohanaeze Ndigbo ably led by Engr."
  },
  {
    "headline": "Herdsmen: IPOB, Oduduwa Volunteer Force form alliance, train security personnel",
    "summarized_story": "The Indigenous People of Biafra, IPOB, has formed an alliance with the Oduduwa Volunteer Force, OVF.\nThe alliance, according to the Media and Publicity Secretary of IPOB, Emma Powerful, carried out a joint training session of personnel.\nIPOB clears air on killing 128 security personnel in ImoThe statement reads: “Biafra and Oduduwa Volunteer Force for the liberation of Southern Nigeria.\n“This is to put the Nigeria Government and her security agencies in Nigeria on notice that Biafra and Oduduwa has further strengthened their bond as one people, following the joint training of personnel from both sides.\nThe Killings made IPOB establish the Eastern Security Network, ESN, a few months ago."
  },
  {
    "headline": "LAGFERRY to reward customers with car, gifts",
    "summarized_story": "By Tajudeen AdebanjoThe Lagos State Ferry Service Company (LAGFERRY) has flagged off a promo tagged “Sailin ‘N’ Smilin” Raffle Draw.\nLAGFERRY said it was meant to encourage water transportation and also reward customers.\nBalogun said since its February 6 inauguration by Governor Babajide Sanwo-Olu, LAGFERRY has moved 502,000 people on the Lagos waterways.\nEmmanuel applauded LAGFERRY for the initiative and commended the support of other agencies for making the promo possible.\nBabarinde said that the promo would give opportunities to Lagos residents to become car owners, courtesy of LAGFERRY."
  },
  {
    "headline": "Search for Nigeria’s child heroes begins",
    "summarized_story": "By Oyebola OwolabiThe search has begun for children to be recognised as child heroes in the 2021 Indomie Independence Day Awards (IIDA).\nThe IIDA award, in its 13th year, is a Corporate Social Responsibility (CSR) initiative of Dufil Prima Foods Plc., makers of Indomie Noodles, to honour heroic Nigerian children.\nIt identifies, celebrates, and rewards the exemplary accomplishments of children who have shown uncommon courage and determination in precarious situations.\nADVERTISEMENTShe said: “This initiative is a reflection of the importance and belief of our company in the extraordinary qualities of the Nigerian child which must never be ignored, but rather celebrated.\nThis, according to the Group Corporate Communications and Events Manager, Tope Ashiwaju, is to allow more heroes to be recognised because certain stories would not fit into the three recognised categories but must be recognised."
  },
  {
    "headline": "Toyin Abraham reconcile Mercy Aigbe, Iyabo Ojo at Toyin Lawani’s wedding",
    "summarized_story": "By Ekaete BasseyNollywood actresses, Iyabo Ojo and Mercy Aigbe have sheathed their swords and embraced peace.\nBoth movie stars were guests at Toyin Lawani’s wedding ceremony on Saturday, June 12 and showed up in stunning outfits.\nRecall that last year, a popular Instagram blog revealed there was a silent beef between Mercy and Iyabo Ojo.\nIt was reported Mercy got angry because Iyabo didn’t acknowledge her when she posted the photo of her late mother.\nREAD ALSO: Toyin Abraham weighs in on bad friendsHowever, that has been quelled now with the recent photo they shared."
  },
  {
    "headline": "Toyin Lawani ties the knot in star-studded event",
    "summarized_story": "By Ekaete BasseyCelebrity fashion designer and entrepreneur Toyin Lawani got married to Segun Wealth, her partner over the weekend.\nOn Valentine’s Day, February 14, 2021, Toyin shared the happy news of her engagement via her Instagram page.\nIt was indeed a celebrity-studded wedding as every celebrity and social media influencer in Lagos was in attendance and the event was titled: “The Artist and His Muse 2021.”ADVERTISEMENTThe celebrity wedding took place at the exclusive Monarch Event Centre, Lekki, Lagos.\nREAD ALSO: Toyin Lawani remains unperturbedAmong those who graced the occasion were music icon Sir Shina Peters, Bovi, Mercy Aigbe, Iyabo Ojo, IK Ogbonna, Alexx Ekubo, Susan Peters, Bovi, Anita Joseph and her husband MC Fish and several other celebrities.\nOne of the few highlights of the wedding was the grand entrance of popular socialite Pretty Mike, with six ladies who were seen pushing strollers with their babies in each of them as they marched in a straight line into the event with the baby mamas wearing the same black matching outfits and silver fascinators."
  },
  {
    "headline": "Uproar over plan to reopen grazing route",
    "summarized_story": "As far as the Northern Elders Forum (NEF) is concerned, reactivating open grazing routes may cause legal and security problems.\n“The reactivation of open grazing routes in southern part or any other parts of the country is problematic both in legal terms and security.\nThe Federal Government can actually sue governors that ban open grazing and the court will rule whether they are right or wrong.\nAt what time in our history did our founding fathers gather to designate specific routes from the north to the south as ‘grazing routes’?\nSince most governors in the country have outlawed open grazing in their respective states, on which land does the Federal Government want to ‘open’ or ‘re-open’ its vaunted grazing routes?"
  },
  {
    "headline": "Insecurity: Don’t abdicate your responsibility, Masari tells Buhari",
    "summarized_story": "From Agaju Madugba, KatsinaKatsina Governor, Aminu Bello Masari, has faulted President Muhammadu Buhari on reasons for worsening insecurity in the country.\nBut citing Constitutional provisions, Masari said it was wrong for anybody to blame states and local governments.\nWhen you look at the Constitution of the Federal Republic of Nigeria, the issue of security is under the Exclusive List.\n“From the local governments, we assist the police, the DSS, the NSDC.\nIf you devolve, states and local governments will have more financial independence."
  },
  {
    "headline": "Buhari, APC must address separatist agitations, not use of military –Odigie-Oyegun",
    "summarized_story": "From Romanus Ugwu, AbujaFormer national chairman of the All Progressives Congress (APC), Chief John Odigie-Oyegun, has asked President Muhammadu Buhari and the ruling party to address the separatist agitations in the country through democratic means instead of deployment of military.\nHe said the fact that things are bad and people hungry and angry was not questionable, saying that these were worldwide phenomenon.\nHowever, Odigie-Oyegun decried the current security challenge in the country.\n“It is my hope that we will begin to get control of the security of this nation,” he said.\nThe executive of the party, the NWC, the Caucus, the NEC which is the highest organ of the party."
  },
  {
    "headline": "NRC begins Lagos-Ibadan service tomorrow",
    "summarized_story": "Nigerian Railway Corporation (NRC) says it will begin full operation of the standard gauge railway service from Lagos to Ibadan tomorrow.\nThe company stated this, yesterday, in a statement by its Lagos District Manager, Mr Jerry Oche, assuring that as from Tuesday (tomorrow) morning the Lagos – Ibadan train services will be available to the public.\n“Lagos to Ibadan takes off at 8am from Mobolaji Johnson Station at Alogomegi, Ebute Meta Lagos, while the train will depart Ibadan to Lagos at 8am from Obafemi Awolowo Station at Moniya.\nLagos to Ibadan ia at 4pm from Mobolaji Johnson Station Alagomji, while from Ibadan to Lagos is by 4pm from Obafemi Awolowo Station at Moniya.\nHe said the Alagomeji, Abeokuta, and Moniya remained the stop stations of the Lagos Ibadan train services."
  },
  {
    "headline": "Twitter ban: Govt officials, others switch to Indian app, Koo",
    "summarized_story": "By Lukman OlabiyiFollowing the ban on US microblogging platform, Twitter, the Federal Government, President Muhammadu Buhari, Vice President Yemi Osinbajo, and public office holders have switched to Indian App, Koo.\nApart from Federal Government officials that are already active on the new platform, some state governments officials have also discarded their Twitter accounts and switched to Koo.\nThe verified account of the Federal Government on the app is @Nigeriagov, and it has over 20 posts.\nPresident Buhari who also joined the new app in June already has 7, 374 followers and following none.\nAhmad, the president’s aide on new media, was already getting closer to hitting 10, 000 followers."
  },
  {
    "headline": "Amaechi: Buhari’s Visit Has Shown Apapa Port’s Problem is Inefficiency",
    "summarized_story": "He also said that terminal operators must contribute to the total reconstruction and reorganisation of the Apapa Seaport.\nHe said: “What I’ve done, was to have a meeting with the terminal operators, and I told them that they have to contribute to the reconstruction of the Apapa Seaport.\nHe stressed that, “before we came, various contractors were contracted to provide security for oil companies in the water.\nSo, we are able to provide security in the coastal region, both on land and on the sea.\nThat’s the impact it will have when it comes to the Deep Blue project."
  },
  {
    "headline": "States Unveil Plans to Implement Financial Autonomy for Legislature, Judiciary",
    "summarized_story": "Our ReportersStates have unveiled strategies to implement the Memorandum of Action (MoA) to ensure financial autonomy for the legislature and judiciary, THISDAY has learnt.\nEbonyi State Chairman of PASAN, Mrs. Uche Edene, told THISDAY that the state had gradually started the implementation of the financial autonomy even before the strike started.\nShe stated that the state had enacted Fund Management Law in 2016 which gave birth to the State House of Assembly Commission.\nAminu Masari, said the state government had concluded plans to inaugurate SAAC and State Assembly Service Commission in order to enable the two arms of government to receive their statutory allocations directly from the federal government.\nSpokesman of the Speaker of the Kaduna State House of Assembly, Mr. Ibrahim Danfulani, said the lawmakers would debate the issue this week."
  },
  {
    "headline": "N’Assembly to Conclude Constitution Review by July",
    "summarized_story": "Deji Elumoye in AbujaThe two chambers of the National Assembly are poised to pass the bill for the alteration of 1999 Constitution as altered before proceeding on annual break in July.\nTowards the early passage of the bill, the National Assembly committees working on the bill will conclude their assignments and present the bill for clause-by-clause consideration before the lawmakers proceed on annual recess in July.\nAlready, the constitution review committees of both the Senate and House of Representatives are collating reports from the zonal public hearings held last month across the six geo-political zones.\nThe Senate Ad-hoc Committee on Constitution Review, headed by the Deputy President of the Senate, Senator Ovie Omo-Agege, and that of the House of Representatives, headed by Deputy Speaker, Hon.\nIdris Wase, had in May held public hearings in 12 cities, at the rate of two per each of the six geo-political zones."
  },
  {
    "headline": "Report: $15bn Investments Lost Annually to Non-passage of PIB",
    "summarized_story": "“Its delay has sparked a great deal of uncertainty and led to an estimated loss of over $15 billion annually in lost investments to Nigeria’s oil and gas industry.\nOPEC: Nigeria’s Oil Production Hit Record Low in MayMeanwhile, Nigeria’s crude oil production output hit record low levels in May, the June Monthly Oil Market Report (MOMR) of the Organisation of Petroleum Exporting Countries (OPEC), has shown.\nThe monthly report indicated that in the first quarter of 2021, Nigeria’s average production was 1.410 million barrels per day.\nThe country’s average crude oil production based on secondary sources was 1.78 Mbpd in 2019 and 1.57mbpd in 2020, while total OPEC 13-member crude oil production averaged 25.46 mb/d during May.\nThe OPEC report showed that Africa’s demand for crude oil was 3.43 million bpd in 2019, which fell to a 4.37million bpd in Q1, 2020."
  },
  {
    "headline": "Oyegun: FG Must Prioritise Restructuring for Nigeria’s Survival",
    "summarized_story": "The former Edo State governor said it was vital that these issues should be addressed as the country cannot continue to allow the subject to become a recurring threat.\nAlso, National Leader of APC, Senator Bola Tinubu, said the public perception of President Muhammadu Buhari had changed after his interview with ARISE NEWS Channel.\nHe added that the face-off between Odigie-Oyegun’s successor, Mr. Adams Oshiomhole, and Edo State Governor, Mr. Godwin Obaseki, was a collateral damage for the party.\nAccording to him, the forces of economics have made things, not quite the way the party wanted them to be.\nIt must be mandatory in the interest of the survival of our nation, that these issues be addressed."
  },
  {
    "headline": "Police Authorities Keeping Entitlements Of Our Late Husbands— Widows Of Cops Killed During EndSARS Protest",
    "summarized_story": "Wives of police officers killed during the 2020 #EndSARS protest in Oyo state on Monday asked the police authorities to release cheques of the entitlement of their husbands to them.\nThey also demanded the remains of their husbands from the federal government and police authorities as evidence for their children in the future.\nSaharaReporters reports that five police officers were killed while many sustained varying degrees of injury in Oyo state during the October 2020 #EndSARS nationwide protest.\n\"We heard they have sent cheques for entitlements of our husbands but the insurance company handling it has yet to release them for us.\nWe want the federal government, state government, well-to-do persons in Nigeria and human rights activists to intervene in our matter,\" she said."
  },
  {
    "headline": "Police Authorities Keeping Entitlements Of Our Late Husbands— Widows Of Cops Killed During EndSARS Protest",
    "summarized_story": "Wives of police officers killed during the 2020 #EndSARS protest in Oyo state on Monday asked the police authorities to release cheques of the entitlement of their husbands to them.\nThey also demanded the remains of their husbands from the federal government and police authorities as evidence for their children in the future.\nSaharaReporters reports that five police officers were killed while many sustained varying degrees of injury in Oyo state during the October 2020 #EndSARS nationwide protest.\n\"We heard they have sent cheques for entitlements of our husbands but the insurance company handling it has yet to release them for us.\nWe want the federal government, state government, well-to-do persons in Nigeria and human rights activists to intervene in our matter,\" she said."
  },
  {
    "headline": "Police Authorities Keeping Entitlements Of Our Late Husbands— Widows Of Cops Killed During EndSARS Protest",
    "summarized_story": "Wives of police officers killed during the 2020 #EndSARS protest in Oyo state on Monday asked the police authorities to release cheques of the entitlement of their husbands to them.\nThey also demanded the remains of their husbands from the federal government and police authorities as evidence for their children in the future.\nSaharaReporters reports that five police officers were killed while many sustained varying degrees of injury in Oyo state during the October 2020 #EndSARS nationwide protest.\n\"We heard they have sent cheques for entitlements of our husbands but the insurance company handling it has yet to release them for us.\nWe want the federal government, state government, well-to-do persons in Nigeria and human rights activists to intervene in our matter,\" she said."
  },
  {
    "headline": "All Progressives Congress Party Supporters Publicly Display Guns, Cutlasses Ahead Of Saturday’s Bye–Election In Jigawa",
    "summarized_story": "Some supporters of the All Progressives Congress (APC) in Jigawa state have vowed to attack members of the opposition ahead of Saturday’s bye-election for the Gwaram Federal Constituency of state.\nIn a video seen by SaharaReporters, the members, chanting the name of the APC candidate, Yusuf Galambi were seen with guns, cutlasses and other different weapons.\nThe Independent National Electoral Commission (INEC) had fixed June 19 for the poll.\n“Consequently, the commission has fixed Saturday, 19th June, 2021 for the conduct of bye-election to fill the vacant seat for the said constituency in the House of Representatives,” INEC had said in a statement.\n“The official notification for the election will be published on 17th May 2021."
  },
  {
    "headline": "All Progressives Congress Party Supporters Publicly Display Guns, Cutlasses Ahead Of Saturday’s Bye–Election In Jigawa",
    "summarized_story": "Some supporters of the All Progressives Congress (APC) in Jigawa state have vowed to attack members of the opposition ahead of Saturday’s bye-election for the Gwaram Federal Constituency of state.\nIn a video seen by SaharaReporters, the members, chanting the name of the APC candidate, Yusuf Galambi were seen with guns, cutlasses and other different weapons.\nThe Independent National Electoral Commission (INEC) had fixed June 19 for the poll.\n“Consequently, the commission has fixed Saturday, 19th June, 2021 for the conduct of bye-election to fill the vacant seat for the said constituency in the House of Representatives,” INEC had said in a statement.\n“The official notification for the election will be published on 17th May 2021."
  },
  {
    "headline": "Umahi on restructuring: Let's have six vice-presidents -- one from each region",
    "summarized_story": "AdvertisementSpeaking in an interview with Channels TV, on Monday, Umahi said the adoption of six vice-presidents will be a major step towards restructuring the country.\nRecently, the concept of restructuring has dominated the Nigerian political space with many stakeholders coming out to offer their views about the concept.\nMy position about restructuring — for example: there are certain valid suggestions that have been made, to have six vice-presidents in the country,” he said.\nThis is very important.”He also advocated for what he described as “administrative restructuring”, in which more powers and responsibilities will be devolved to sub-national governments.\nAdvertisement“Now, I will recommend administrative restructuring, which is making sub-national governments to be strengthened — devolving power and responsibilities to sub-national governments; abolishing the local governments,” he added."
  },
  {
    "headline": "Umahi on restructuring: Let's have six vice-presidents -- one from each region",
    "summarized_story": "AdvertisementSpeaking in an interview with Channels TV, on Monday, Umahi said the adoption of six vice-presidents will be a major step towards restructuring the country.\nRecently, the concept of restructuring has dominated the Nigerian political space with many stakeholders coming out to offer their views about the concept.\nMy position about restructuring — for example: there are certain valid suggestions that have been made, to have six vice-presidents in the country,” he said.\nThis is very important.”He also advocated for what he described as “administrative restructuring”, in which more powers and responsibilities will be devolved to sub-national governments.\nAdvertisement“Now, I will recommend administrative restructuring, which is making sub-national governments to be strengthened — devolving power and responsibilities to sub-national governments; abolishing the local governments,” he added."
  },
  {
    "headline": "Christiane Amanpour, CNN TV host, diagnosed with ovarian cancer",
    "summarized_story": "Christiane Amanpour, anchor of Amanpour, a global affairs interview programme on CNN International, says she has been diagnosed with ovarian cancer.\nAdvertisementAmanpour disclosed this during a live broadcast on Monday.\nAccording to her, she was absent from the programme for the past four weeks due to the diagnosis, adding that she is now undergoing chemotherapy.\nAdvertisement“I have had successful major surgery to remove it, and I’m now undergoing several months of chemotherapy for the very best possible long-term prognosis and I am confident.\nAmanpour is an international journalist known for war and conflict reporting."
  },
  {
    "headline": "Christiane Amanpour, CNN TV host, diagnosed with ovarian cancer",
    "summarized_story": "Christiane Amanpour, anchor of Amanpour, a global affairs interview programme on CNN International, says she has been diagnosed with ovarian cancer.\nAdvertisementAmanpour disclosed this during a live broadcast on Monday.\nAccording to her, she was absent from the programme for the past four weeks due to the diagnosis, adding that she is now undergoing chemotherapy.\nAdvertisement“I have had successful major surgery to remove it, and I’m now undergoing several months of chemotherapy for the very best possible long-term prognosis and I am confident.\nAmanpour is an international journalist known for war and conflict reporting."
  },
  {
    "headline": "Ita Enang: Hoarding of LG funds by state governors, cause of insecurity in Nigeria",
    "summarized_story": "Ita Enang, senior special assistant to the president on Niger Delta affairs, says the failure of governors to release funds to local governments is the cause of security challenges in the country.\nAccording to him, the efforts of President Muhammadu Buhari to tackle insecurity have been frustrated by governors, who are spending funds that should be allocated to their local governments.\nThe governors have interfered and kidnapped the funds of the local governments through what is called the state/local government joint account,” he said.\nWhat happens today is that chairmen of local governments and local government officers only go to work when there is allocation.\n“If governors would take the monies of local governments, and when they face insecurity, they say ‘President Buhari’."
  },
  {
    "headline": "Ethiopia opens process to sell 40% stake in Ethio Telecom",
    "summarized_story": "Ethiopia has announced a tender process for the sale of a 40% stake in state-owned telecommunications company, Ethio Telecom.\nThis is the first stage in a lengthy process that will lead to the selection of a successful bidder.\nIn May, the government awarded one of the two available private operating licences to break up Ethio Telecom’s monopoly on the sector.\nAccording to Brook Taye, a senior advisor at the finance ministry, the 40% in Ethio Telecom will be sold as a single stake to a single investor.\nFounded in November 2010, Ethio Telecom currently has around 53 million subscribers and has since December generated a revenue of around $600 million."
  },
  {
    "headline": "Here are ten VPNs you can use in Nigeria",
    "summarized_story": "Virtual private networks (VPNs) have been around for a long time but have become more popular recently.\nExpress VPNExpressVPN is rated highly because of its very fast speeds across over 3,000 remote servers in 160 locations and 94 countries.\nUnlike NordVPN and ExpressVPN, the first subscription tier of ProtonVPN is its free VPN offering, which includes just three VPN server locations (Japan, Netherlands, and the US).\nWindscribe VPNJust like TunnelBear, Windscribe VPN has a free version and it gives 10GB free every month.\nWhich other VPNs do you use and what do you like or don’t like about them?"
  },
  {
    "headline": "Product policy managers are at the centre of Big Tech companies",
    "summarized_story": "The app is perfect for hyper-creative content creators who know their way around editing tools and special effects.\nHe uses animated videos to address sensitive topics and create content that is easy to digest and understand.\nPearlé: Watching TikTok videos inspires me to keep going and encourages me to do more at work.\nPearlé: For us, as product policy managers, we are at the centre of every company.\nBig tech companies still have a long way to go where product policy is concerned."
  },
  {
    "headline": "Top Three Nigerian Stocks for Sustainable Investors",
    "summarized_story": "They choose stocks of corporations known for fair and sustainable practices.\nSo, which stocks are sustainable?\nSterling BankThe sustainable policies of Sterling Bank allow it to prevent credit fraud and reduce its own carbon footprint.\nThese include The Nigerian Sustainable Banking Principles (NSBP), Equator Principles and theInternational Finance Corporations (IFC) Performance Standards.\nSustainable Investment in NigeriaThese are three examples of sustainable stocks in Nigeria."
  },
  {
    "headline": "Catalyst to Breakthrough: How Wema Bank Boosts Startups with Digital Innovations",
    "summarized_story": "Nigeria’s leading innovative and digital financial institution, Wema Bank, has become a main attraction for these categories of Nigerians due to its provision of accessible, seamless, timely and flexible digital services.\nResolved to become Nigeria’s financial institution of choice, Wema Bank has built several digital products and offerings like ALAT, Sara, Gender Loan Offering, Hackaholics, SME solutions and lots more.\nALAT by Wema, for instance, is Nigeria’s first digital bank that blazed the trail for others in the sector.\nIts Hackaholics, an initiative for tech startups is also a trailblazer by organizing trainings for businesses to solve societal challenges.\nThe Bank recently presented N2,187,500.00 to four startups for emerging as the winners during the Hackaholics Bootcamp 2.0."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "#WorldBloodDonorDay: 5 startups improving access to safe blood in Africa",
    "summarized_story": "AdvertisementThis is not sustainable as family and friends of accident victims, for example, may not be readily available to donate blood.\nIn 2016, Bime started Infiuss, a blood bank management system that connects hospitals with blood banks with hospitals without a blood bank.\nIt connects hospitals with blood banks or donors and assists in screening, tracking, storage, distribution, preparation of blood products, and inventory management.\nIt only provides information on which blood banks have the blood that is needed.\nWe can’t all build startups that save lives, but we can donate blood regularly and save lives in our little way."
  },
  {
    "headline": "5 online platforms to get collateral-free loans for your small business in Nigeria",
    "summarized_story": "As a small business owner, growing your business and meeting your customers’ needs should be your top priorities.\nI hear you, and I’ve received mail from small business owners with the same needs.\nCarbon’s SME loansCarbon’s SME loans is a product that allows you to “grow your small business with affordable, collateral-free loans.” SMEs can access up to ₦1,000,000 without collateral, guarantors, or paperwork.\nFastCreditFastCredit offers business loans to micro, small, and medium enterprises to support business growth.\nLearn more about how to launch, market and grow your business at SME Clinic 2021Are you a small business owner?"
  },
  {
    "headline": "South Africa regulating cryptocurrency, Nigeria’s new International Termination Rates, Toptal sues Andela",
    "summarized_story": "Good day,Today I’m discussing,South Africa regulating cryptocurrencyNigeria’s new International Termination RatesToptal suing AndelaSouth Africa inching closer to regulating cryptocurrencySouth Africa’s Intergovernmental Fintech Working Group (IFWG) has released a position paper calling for the regulation of the country’s cryptocurrency ecosystem.\nSeveral African countries — Nigeria, Ghana, Mauritius, Kenya and South Africa — have been known to take a critical stance in the cryptocurrency arena.\nFor a more in-depth read, Check out South Africa Working Group Releases New Position Paper Calling for Regulation of Crypto Asset ProvidersNigeria’s new International Termination RatesThe Nigerian Communication Commission (NCC) has concluded plans to roll out a new Mobile International Termination Rate (ITR).\nThe Commission has finalised the process of determining the cost-based price of ITR to ensure healthy competition on traffic handling for voice services between local and international operators in Nigeria.\nThey are charges paid to local operators by international operators to terminate calls in Nigeria."
  },
  {
    "headline": "Edo Museum: US to return two Bronze pieces – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Metropolitan Museum of Art in New York City, United States, has said it will return two Benin Bronze from its collection to its place of origin, further boosting the prospects of American museums to repatriate looted art pieces to the Governor Godwin Obaseki-backed Edo Museum of West African Art (EMOWAA).\nThe two works to be returned are “Warrior Chief” and “Junior Court Official,” a pair of 16th-century brass plaques from the Oba Palace in Benin City.\nThe museum project is part of Governor Obaseki’s legacy for the state’s burgeoning arts and tourism space.\nDirector at the Met Museum, Max Hollein, in a statement, said “The retention of these works within Nigeria’s National Collections is critical to the well-being of the museum community and to fostering ongoing cooperation and dialogue between The Met and our Nigerian counterparts.”He added that the Museum was in support of the forthcoming Edo Museum of West African Art.\nErin L. Thompson, a professor of art crime at John Jay College, said “The Metropolitan is repatriating two artifacts stolen from Nigeria in the 20th century, but not the many other artifacts stolen from that territory in the 19th century in its collections.”“These artifacts — key parts of the sacred and political workings of the Kingdom of Benin — were taken during an orgy of violence intended to steal not just the kingdom’s treasures, but the kingdom itself,” She added."
  },
  {
    "headline": "2021 WNT Summer Series : Three takeaways from Nigeria’s thrilling 3-3 draw with Portugal – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Super Falcons drew against Portugal in their second game of the 2021 WNT Summer Series in Houston, Texas, USA in the early hours of Monday morning in Nigeria.\nThe Super Falcons improved in the second halfThe performance of the Super Falcons massively improved in the second half as they noticeably harried the Europeans into making mistakes.\nThe captain of the team Asisat Oshoala only joined the team on the morning of the game but still had a good game.\nUnited Falcons, Good Signs For The New GirlsThe way the Super Falcons celebrated their third goal against Portugal was great to witness.\nThis sends positive vibes to other players of Nigerian descent in diaspora who may have been contemplating whether to represent Nigeria or not."
  },
  {
    "headline": "World Donor Day: Obaseki hails donors, urges increased awareness to ensure stable supply of safe blood – Nigerian Observer",
    "summarized_story": "Obaseki gave the commendation in commemoration of this year’s World Blood Donor Day, with the theme; “Give blood and keep the world beating”, marked by the World Health Organisation (WHO), every June 14, across the globe.\nAccording to the WHO, “World Blood Donor Day aims to raise global awareness of the need for safe blood and blood products for transfusion and of the critical contribution voluntary, unpaid blood donors make to national health systems.\n“Safe blood and blood products and their transfusion are a critical aspect of care and public health.\n“To ensure that everyone who needs safe blood has access to it, all countries need voluntary, unpaid donors who give blood regularly.\nThroughout the COVID-19 pandemic, despite limited mobility and other challenges, blood donors in many countries have continued to donate blood and plasma to patients who need transfusion.”..."
  },
  {
    "headline": "ISIBOR EWUARE Install Pa. Obazee As Odionwere Amid Wide Jubilations – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEGOR – It was pomp and ceremony recently in Isibor Ewuare Village, Egor Local Government Area of Edo State as sons and daughters of the Village, both at home and in diaspora joined the elders of the town to install Pa. Imafodon Okhionkpamwonyi Obazee as Odionwere of Isibor Ewuare.\nThe installation event which was held under the cordiality of friendly atmosphere at the village witnessed wide jubilations amongst the people as they danced and sang praises of Pa. Obazee.\nWe are very ready to join hands with our new Odionwere to push for a better, purposeful and globally cherished Isibor Ewuare Village.\nOther top executive members of the village who reacted include Pa. Felix Igbinosun (Ozukpogieha); Pa. Ogieriakhi Okpugie ( Ozukpogieha); Pa. Anthony Aimufua (Ozukpogiene) and Mr. Stanley .O.\nHigh point of the ceremony was the commissioning of bohole donated to the people by Pa. Obazee."
  },
  {
    "headline": "UPDATED: Crisis deepens in Nigerian athletics as two factional leaders emerge",
    "summarized_story": "Two parallel elections were held in Kebbi and Abuja on Monday to elect leaders for the Athletics Federation of Nigeria (AFN).\nOne of the elections produced Ibrahim Gusau as president while the other produced Tonobok Okowa as AFN president.\nMr Gusau was re-elected as AFN President at the 2021 Elective Congress of his faction in Birnin Kebbi, Kebbi State, on Monday, June 14.\nMr George complained about the guidelines for the Abuja election; alleging it was doctored to favour the anointed candidate of the sports ministry.\nI am with you all the way,” Mr George was quoted as saying in the statement by the Gusau-led AFN."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "‘You can’t ban Twitter to satisfy your ego’ – PDP govs tell Buhari",
    "summarized_story": "Governors of Nigeria’s main opposition party, the Peoples Democratic Party (PDP), have kicked against the decision of President Muhammadu Buhari administration to indefinitely suspend Twitter in Nigeria.\nThe governors who registered their displeasure with ban in a communique issued after their meeting in Akwa Ibom on Monday, said the ban was only to satisfy the president’s ego, and will worsen the country’s unemployment crisis.\nIn the communique read by chairman of the PDP governors forum and Sokoto State governor, Aminu Tambuwal, the governors maintained that the ban was not in the interest of Nigeria.\n“The meeting examined the suspension of Twitter from operating in Nigeria, and condemned the personalised reasons given for the action,” the communique read.\n“Nigerian youths do not have adequate access to employment and a lot of Nigerians rely on Twitter for their livelihood, businesses and self-employment."
  },
  {
    "headline": "Gov Okowa hails Okonjo-Iweala at 67",
    "summarized_story": "Delta State governor, Dr. Ifeanyi Okowa, has hailed the director-general of World Trade Organisation (WTO), Dr Ngozi Okonjo-Iweala on the occasion of her 67th birthday, describing her as a brilliant, competent, world-class economist and international development expert.\nIn a statement by his chief press secretary, Mr Olisa Ifeajika, in Asaba, the governor congratulated her as she clocks 67 years, stating that her works over the years had distinguished her internationally.\nOkonjo-Iweala, an illustrious Deltan from Ogwashi-Uku, is the first female director-general and first African to lead the global trade body in its 25-year history.\n“Proudly, your rich profile has continued to soar, and I recall that you were named ‘Euro-money Global Finance Minister’ in 2005 after you led Nigeria’s economy to exit foreign debt obligations during your first term under President Obasanjo.\nThese feats remain largely unprecedented till date,” he said"
  },
  {
    "headline": "Nigeria paid $642.43m foreign debt in Q1 2021 – DMO",
    "summarized_story": "Hence, external debt service payments fell to N126.02 billion (or $332.07 million) in the first quarter (Q1) 2021 from N170.60 billion (or $472.57 million) printed in Q1 2020.\nAccording to DMO, bilateral loan accounted for 12.73 per cent ($4.18 billion) of which loan from China (Exim Bank of China) was $3.40 billion and loan from France was $0.49 billion in Q1 2021.\nLocal debt stock increased by 10.71 per cent to N20.64 trillion in Q1 2021 (from N18.64 trillion in Q1 2020).\nFurther breakdown of the domestic debt figure showed that federal government (FG’s) domestic debt stock rose to N16.51 trillion in Q1 2021 (from N14.53 trillion in Q1 2020).\nDespite the significant rise in FG’s domestic loan, local debt service payment increased marginally by 0.59 per cent to N612 billion in Q1 2021 from N609.13 billion recorded in Q1 2020 amid a relatively low rate."
  },
  {
    "headline": "Access Bank plots N200bn digital loan growth with DBA Lite launch",
    "summarized_story": "Access Bank Plc., says it is planning to double the size of its digital loans to N200 billion at the end of the year with the launch of DBA Lite, a business solution targeted at youth entrepreneurs.\nThe Executive Director, Retail Banking of the bank, Mr. Victor Etuokwu, disclosed this at a press conference to announce the launch of the product.\nMore so, they stand a chance of enjoying access to information and training as well as business registration for intending young business owners among other value propositions.\n“Access Bank has always pride itself on being a facilitator of economic growth in the nation.\nAyodele Olojode, Group Head, Emerging Businesses, Access Bank, speaking, said: “What we are trying to do is to help the young entrepreneurs to leverage the digital skills that they have."
  },
  {
    "headline": "JUST-IN: CNN’s Anchor, Christiane Amanpour, Diagnosed With Ovarian Cancer",
    "summarized_story": "AdvertisementsCNN chief international anchor, Christiane Amanpour, has said that she has been diagnosed with ovarian cancer.\nAccording to the 63-year-old television hostess, though she has had a successful surgery to remove it, she is, however, going through therapy.\nADVERTISEMENTAmanpour has been a long time news figure at CNN, almost from its launch in the early 1980s.\nShe worked there from 1983 to 2010, then left for a brief stint at ABC News, where she anchored ‘This Week’.\nBianna Golodryga stood in for Amanpour on her ‘CNN International’ show as she went through surgery and treatments."
  },
  {
    "headline": "JUST-IN: CNN’s Anchor, Christiane Amanpour, Diagnosed With Ovarian Cancer",
    "summarized_story": "AdvertisementsCNN chief international anchor, Christiane Amanpour, has said that she has been diagnosed with ovarian cancer.\nAccording to the 63-year-old television hostess, though she has had a successful surgery to remove it, she is, however, going through therapy.\nADVERTISEMENTAmanpour has been a long time news figure at CNN, almost from its launch in the early 1980s.\nShe worked there from 1983 to 2010, then left for a brief stint at ABC News, where she anchored ‘This Week’.\nBianna Golodryga stood in for Amanpour on her ‘CNN International’ show as she went through surgery and treatments."
  },
  {
    "headline": "Despite Ondo Monarch’s Plea, TB Joshua For Burial In Lagos July",
    "summarized_story": "LEADERSHIP reports that TB Joshua had died at the age of 57 on Saturday, June 5, just a week to his 58th birthday anniversary on June 12, 2021.\nThe statement titled, ‘Special Announcement’ reads in part: “We know you are aware that our father in the Lord, Prophet TB Joshua, has been taken home to be with the Lord.\nProphet TB Joshua may be absent in the body but he is present in the spirit (Colossians 2:5).\n“We are currently preparing for the week-long service from Monday 5th to Sunday 11th July 2021 in honour of Prophet TB Joshua’s life and legacy.\n“As our father in the Lord, Prophet TB Joshua says, ‘When we close our eyes to all things in this world, we shall open them in a world of glory."
  },
  {
    "headline": "Despite Ondo Monarch’s Plea, TB Joshua For Burial In Lagos July",
    "summarized_story": "LEADERSHIP reports that TB Joshua had died at the age of 57 on Saturday, June 5, just a week to his 58th birthday anniversary on June 12, 2021.\nThe statement titled, ‘Special Announcement’ reads in part: “We know you are aware that our father in the Lord, Prophet TB Joshua, has been taken home to be with the Lord.\nProphet TB Joshua may be absent in the body but he is present in the spirit (Colossians 2:5).\n“We are currently preparing for the week-long service from Monday 5th to Sunday 11th July 2021 in honour of Prophet TB Joshua’s life and legacy.\n“As our father in the Lord, Prophet TB Joshua says, ‘When we close our eyes to all things in this world, we shall open them in a world of glory."
  },
  {
    "headline": "Open Grazing Ban: Fulani Leaders ln Delta Condemn Threat Letter To Okowa",
    "summarized_story": "The elders and leaders of the Hausa/Fulani community in Delta State have condemned the threat letter addressed to Governor Ifeanyi Okowa over the ban on open grazing by the Southern Governors Forum.\nThey pledge unalloyed loyalty to the ‘Stronger Delta’ mantra and commended Governor Okowa for his giant strides over the years.\n“We are not responsible for the threat letter.\nLEADERSHIP recall that a group of unidentified persons on Sunday threatened to attack Asaba and Agbor in Delta State should Governor Okowa fail to withdraw his support for the ban on open grazing within 72 hours.\nADVERTISEMENTThe letter titled, ‘Fulani jihadist warning: An open message to Delta State’, was dated June 13, 2021."
  },
  {
    "headline": "Lalong condemns killings in Plateau, urges residents to increase...",
    "summarized_story": "Simon Lalong of Plateau has condemned the killing of 12 people at Kashe (Sabon Layi) community in Kuru District of Jos South Local Government of the state.\nHe said that the governor, represented by the Secretary to the State Government (SSG)Prof. Danladi Atu, urged communities to increase surveillance and intelligence gathering.\nThe governor also called on the people to collaborate with the security toward ending the circle of violence in the state.\nLalong, who said that he was distressed by the killing of the 12 innocent citizens and five severely injured in the community, appealed to citizens to increase surveillance and intelligence gathering.\nLalong further called on the people of the community to be law abiding at all times and desist from reprisals."
  },
  {
    "headline": "NNPC, Egbin collaborate to boost gas-to-power programme —",
    "summarized_story": "The Nigerian National Petroleum Corporation (NNPC) and the Egbin Power Plc have pledged to deepen collaboration to ensure the success of the Federal Government’s gas-to-power programme.\nThe Chief Operating Officer, Gas, NNPC, Mr Yusuf Usman and Chairman, Board of Directors, Egbin Power Plc, Mr Temitope Sonubi, made the pledge during a facility visit of the NNPC team to the power plant on Monday in Lagos.\nHe said there was need to ensure undisrupted supply of gas to Egbin Power Plant, which was the biggest in Sub Saharan Africa.\nWe are going to support you to make sure that the power supply is steady.\nSonubi appealed to the NNPC to sustain effort towards gas development and supply of the product to keep turbines at Egbin working productively at optimal capacity."
  },
  {
    "headline": "Insecurity: Bandits, Boko Haram abducts about 1000 school students in Nigeria",
    "summarized_story": "A report has revealed that the dreaded Boko Haram group and bandits have kidnapped almost a thousand school students in Nigeria between December last year and June 5, 2021.\nAbductions were recorded in Ohordua, Edo State; Effurun, Delta State; Kankara, Kaduna State; and Mahuta village, Katsina within the speculated period.\nOther places where cases of abduction were recorded are Kagara, Niger State; Jangebe, Zamfara State; and Afaka, Kaduna State, among others.\n“Two of my children were kidnapped; I will not allow them to go back unless something tangible is done,” she reiterated.\nMeanwhile, the presidency has warned Nigerians to stop rejoicing when cases of insecurity such as kidnappings and killings happen in the country."
  },
  {
    "headline": "World Blood Donor Day: NMA canvasses more funding for NBTS centres",
    "summarized_story": "The Nigeria Medical Association (NMA) has called for more funding of the National Blood Transfusion Services (NBTS) centres across the country.\nAccording to him, state NBTS centres were worst hit since the withdrawal of donor funds by implementing partners, as state governments were yet to take full ownership of such centres in their domains.\nUjah stressed that improved budgeting and release of funds to the NBTS centres across Nigeria would give room for effectiveness and efficiency in service delivery.\nHe cited some of the challenges of the sector to include, low level of eligible adult blood donor population, low level voluntary blood donation, high level commercial blood donation, high rate of transmission of transfusion transmissible infection among blood recipients from commercial donors, among others.\n“The NMA stands in full support of the NBTS and joins all voices of good reason to create sustained advocacy for a comprehensive improvement in blood transfusion services in Nigeria”, he said."
  },
  {
    "headline": "Two killed as ‘hoodlums’ hijack masquerade festival in Oyo",
    "summarized_story": "The National President of Soludero Hunters Association, Oba Nureni Ajijola Anabi has said “hoodlums” at Oja Igbo area of Ibadan have hijacked the ongoing masquerade festival killing and maiming innocent people.\n“When the Egungun festival began, these hoodlums killed one man at Oja Igbo and Ita Ege areas of Ibadan.\n“They killed a man four days ago.\nThe man challenged them why they wanted to set his family house on fire.\n“The deceased said he wasn’t the one with the masquerade and that it was his brother."
  },
  {
    "headline": "Two killed as ‘hoodlums’ hijack masquerade festival in Oyo",
    "summarized_story": "The National President of Soludero Hunters Association, Oba Nureni Ajijola Anabi has said “hoodlums” at Oja Igbo area of Ibadan have hijacked the ongoing masquerade festival killing and maiming innocent people.\n“When the Egungun festival began, these hoodlums killed one man at Oja Igbo and Ita Ege areas of Ibadan.\n“They killed a man four days ago.\nThe man challenged them why they wanted to set his family house on fire.\n“The deceased said he wasn’t the one with the masquerade and that it was his brother."
  },
  {
    "headline": "Falana: Old grazing reserves law applied only to northern states",
    "summarized_story": "Human rights lawyer, Mr. Femi Falana (SAN), says the Grazing Reserves Act of 1964 which President, Major General Muhammadu Buhari (retd.\nThe senior advocate said this in a statement on Sunday titled, ‘President Buhari Should Embrace Ranching’.\nThe activist stated that in 2016, the Federal Government announced that it had acquired 55,000 hectares of land in 11 states for grazing of cattle.\nBut due to the opposition which greeted the concept of cattle colony in many quarters the Federal Government jettisoned the policy and adopted the Livestock Transformation Policy including ranching in 2018,” Falana recalled.\nLalong was quoted as saying that some states had begun processes to end open grazing in their states."
  },
  {
    "headline": "Falana: Old grazing reserves law applied only to northern states",
    "summarized_story": "Human rights lawyer, Mr. Femi Falana (SAN), says the Grazing Reserves Act of 1964 which President, Major General Muhammadu Buhari (retd.\nThe senior advocate said this in a statement on Sunday titled, ‘President Buhari Should Embrace Ranching’.\nThe activist stated that in 2016, the Federal Government announced that it had acquired 55,000 hectares of land in 11 states for grazing of cattle.\nBut due to the opposition which greeted the concept of cattle colony in many quarters the Federal Government jettisoned the policy and adopted the Livestock Transformation Policy including ranching in 2018,” Falana recalled.\nLalong was quoted as saying that some states had begun processes to end open grazing in their states."
  },
  {
    "headline": "U.S. COVID-19 death toll surpasses 600,000",
    "summarized_story": "The U.S. has now lost over 600,000 people to COVID-19, about 15% of the world’s total fatalities of around 4 million.\nThe country reached the milestone, though cases and deaths have dropped dramatically as more Americans have become vaccinated.\nAs at Monday afternoon, it has recorded 34,322,696 cases and 615,000 deaths, data by worldometers.info showed.\nOn Sunday, only 5,285 cases and 100 deaths were logged, out of the global daily figures of 303,598 cases and 6,803 fatalities.\nBrazil, with 17.4 million COVID-19 cases, has recorded a death toll of 487,476."
  },
  {
    "headline": "Fire guts Emir of Fika’s palace",
    "summarized_story": "Fire gutted part of the palace of Emir of Fika and Chairman of the state Council of Chiefs, Alh.\nThe fire destroyed expensive furnishings in one of the palace chambers and also the library.\nGov Mai Mala-Buni of Yobe, who learnt about the incident commiserated with the emir.\n“l am deeply saddened by the sad news of the fire incident today at the palace of His Highness, the Emir of Fika.\nAlso on Monday, Dr Mohammed Goje, the Executive Secretary of Yobe State Emergency Management Authority(SEMA) led a team the palace to commiserate with the monarch and assess the extent of damage."
  },
  {
    "headline": "Oshiomhole breaks silence on not completing his tenure as APC National Chairman",
    "summarized_story": "By Jethro Ibileke/BeninThe immediate past governor of Edo State, Comrade Adams Oshiomhole, has said that it did not matter that he did not complete his tenure as national chairman of the All Progressives Congress (APC).\nHe stated this on Monday during the party’s enlarged leaders’ meeting across Edo North Senatorial District of the state, held in Auchi.\nOshiomhole had to step aside as national chairman of the party, following a law suit that affirmed his removal as a member of the party in his ward.\nHe, however, said that what mattered was that he occupied the office of the national chairman of the party, for which he said he remained thankful to God for.\n“I also was privileged to become the national chairman of our party and it does not matter even if I had spent just two days in that office."
  },
  {
    "headline": "Why I Told Google To Take Down My Crowwe App — Adamu Garba",
    "summarized_story": "Adamu Garba, the CEO of IPI Group, claims he asked Google to remove his social media platform, Crowwe App, from the Google Playstore because he wanted to update the code.\nGarba, a senior member of the All Progressives Congress, revealed as much in an interview with The PUNCH on Monday.\nAs a result, Garba revealed that he asked Google to remove the app in order to make some modifications.\nGarba added, “We took down Crowwe App because we are trying to update the codes and then put it back up.\n“The app being installed has nothing to do with the user but has everything to do with the app itself."
  },
  {
    "headline": "Ahead Of Saturday’s Bye–Election In Jigawa, APC Party Supporters Publicly Display Guns, Cutlasses",
    "summarized_story": "Some supporters of the All Progressives Congress (APC) in Jigawa state have threatened to attack members of the opposition ahead of the state’s Gwaram Federal Constituency bye-election on Saturday.\nThe members were seen with rifles, cutlasses, and other weapons in a video seen by NewsDirect, chanting the name of the APC candidate, Yusuf Galambi.\nThe poll was set for June 19 by the Independent National Electoral Commission (INEC).\nFollowing the death of Yuguda Hassan Kila, the last holder of the position, on March 4, the Speaker of the House of Representatives, Femi Gbajabiamila, declared the seat vacant.\n“Political parties shall conduct their primaries between 18th and 24th May, 2021."
  },
  {
    "headline": "Activist Refuses After Channels TV Asked Him To Remove #BuhariMustGo Shirt Before Going On Air",
    "summarized_story": "Adeyeye Olorunfemi, an anti-President Muhammadu Buhari activist, walked out of a Channels Television show on Monday after refusing to take off his #BuhariMustGo T-shirt.\n“There is no small oppression.\n”The civil rights movement in America has a history and the ‘small’ defiant role of Rosa Parks cannot be discarded.\n”Should we say it wouldn’t have mattered if Rosa Parks had allowed the white man sitting in the bus?\n”The right for blacks to sit in a bus at that time was not recognised anyway, but it was fought for, due to Rosa Parks’ intolerable attitude towards ‘small oppression’."
  },
  {
    "headline": "Buhari Now More Determined To Tackle Division — Garba Shehu",
    "summarized_story": "Mr Shehu, appearing on state-run broadcaster NTA, believes that the regime’s adversary is the outlawed microblogging site Twitter, which is used to spew hate messages and endanger Nigeria’s business survival.\n“I think in the last few days, we are seeing a firmer determination by the administration of President Muhammadu Buhari to tackle artificial divisions that are standing in the way of national cohesion and progress of the country,” Mr Shehu said.\nMany citizens accused the president of infringing on citizens’ right to free speech and depriving them of their primary source of income.\nBut, in justifying the ban, Mr Shehu claimed that it was the proper method in ensuring that the country’s “rising heat” was put to an end.\nMeanwhile, the Buhari dictatorship has been extensively chastised for gross human rights violations, increasing insecurity and the economy, corruption, and nepotism, among other things."
  },
  {
    "headline": "Breaking: ISWAP frees UN aid worker, others 5 months after",
    "summarized_story": "Islamic State West Africa Province (ISWAP) has released several humanitarian workers and civilians abducted during attacks in Northeast Nigeria.\nAccording to reports, the aid workers were freed by the group on Monday alongside other civilian captives, after negotiations.\nAmong those released is a staff of the United Nations High Commission for Refugees abducted along the Damaturu-Maiduguri road in Jan Idris Alooma.\nThe United Nations suspended operations in response to the attacks on humanitarian operations in Dikwa and Damasak, affecting humanitarian assets and personnel.\nThe aid workers and the other freed persons are receiving medical support."
  },
  {
    "headline": "2021: JAMB makes fresh pronouncement on UTME registration, tells candidates what to do",
    "summarized_story": "The registration for 2021/2022 Unified Tertiary Matriculations Examination (UTME) has been extended to June 15 by Joint Admissions and Matriculations Board (JAMB) for candidates who have not completed their registration to visit special centres to finish the processJAMB’s head of media, Fabian Benjamin, who revealed this said the extension was for only those who could not complete their registration during the earlier scheduled registration period.\nBenjamin said only candidates whose names were compiled after giving reasons for the incomplete registration process and had been contacted “are expected to visit the centres.”"
  },
  {
    "headline": "Pictures: PDP governors meet in Uyo over National issues",
    "summarized_story": "PreviousNo rift between Wike and I – Secondus"
  },
  {
    "headline": "Chief Tompolo did not demand inauguration of new NDDC Board- VATLAD -NigPilot",
    "summarized_story": "High Chief Tompolo has not compromised his demands of the Constitution and inauguration of the substantive board of NDDC as contained in the 7-day Ultimatum he issued on May 31, 2021, after the Minister of Niger Delta Affairs visited his Gbaramatu Kingdom in Warri, Delta State.\n“Instead, in his May 31, 2021 Statement giving 7-Day Ultimatum and his June 3, 2021, 30-Day Extension, he deliberately and consistently demanded, on behalf of the nine Oil-Producing States of NDDC, the immediate: “constitution of THE SUBSTANTIVE BOARD OF NDDC”.\nHe did not demand the constitution and inauguration of A BOARD of NDDC.\n“It will be against his commitment to restoring Peace, Order and Security in our Oil Producing South-South Region if he allows himself to be misled to further delay the inauguration of this substantive Board of NDDC.\n“As High Chief Tompolo rightly stated in his Statement, the renewed demand for the inauguration of the substantive Board of NDDC is for the Love of our Region and Country, Nigeria."
  },
  {
    "headline": "NAF college of Nursing gets accreditation -NigPilot",
    "summarized_story": "The National Board for Technical Education (NBTE) has granted approval for the commencement of National Diploma (ND) in Nursing Training at the Nigerian Air Force College of Nursing (NAFCON) Kaduna with effect from January 2021, the Nigeria Air Force has said in a statement.\nThe statement noted that the approval implies that NAFCON will terminate the three years nursing training and switch to ND in General Nursing.\nDirector of Public Relations and InformationNigerian Air Force, Air Commodore Edward Gabkwet in a statement explained that the Joint Admission and Matriculation Board (JAMB) has included NAFCON in its year 2022 brochure for candidates.\nThe service recalled that the Nigerian Air Force (NAF), in October 2019, commissioned the NAF School of Medical Sciences and Aviation Medicine (NAFSMSAM) at the NAF Base, Kaduna.\nThe School also organizes upgrading and refresher courses for various categories of NAF Medical Services personnel aimed at exposing them to global best practices in aviation medicine,” the statement concluded."
  },
  {
    "headline": "Re: 1,500 Christian Killed in 6 Months in Nigeria -NigPilot",
    "summarized_story": "He stated that at least 1,500 Christians have been killed in Nigeria in the last six months.\nYes, there are several issues of insecurity rocking the nation, but it is not nearly as bad as Mike Pompeo paints it to be.\nIslamic State West Africa Province, ISWAP, is all over African countries and has registered their presence through different attacks.\nThe Vienna Police Department confirmed that the attacker was an Islamic State sympathiser, and that the attack was motivated by Islamic extremism.\nIslamic State of Iraq and the Levant targeted Shia Muslims on 21 January 2021 in a clothing market in Tayaran Square, Baghdad."
  },
  {
    "headline": "African Centre for Supply Chain honours NITT chairman -NigPilot",
    "summarized_story": "Chairman, Governing Council of the Nigerian Institute of Transport Technology, NITT, Zaria in Kaduna State, Olorogun John Ejovwoke Onojeharho has been conferred with the Fellowship of the African Centre for Supply Chain, ACSC.\nThe Centre is an umbrella networking body of logistics and supply chain professionals across Africa established with the prime objective to provide a platform for in-depth research, education and training for the logistics and supply chain industry.\nIn his acceptance speech at the occasion, the NITT chairman expressed joy that his modest contributions to the transport and logistics industry had been recognized and thanked the ACSC Governing Council for the honour done to him.\n“I feel highly elated not just because I was offered the fellowship, but beyond the recognition, supply chain management is an emerging area in our economy and to be a pioneer fellow of a centre that is working assiduously to push that frontier of our economy is a great honour.\nHe attended many senior management courses both in Nigeria and outside the country including the EP Leadership Programmes for high flyers."
  },
  {
    "headline": "VIDEO: My People Say They Have No Land For Ranching – Umahi",
    "summarized_story": "Ebonyi State Governor, Dave Umahi, says his people have no land to give out for cattle ranching.\nGovernor Umahi stated this on Monday evening while appearing as a guest on Channels Television’s ‘Politics Today’.\nSo, the land is a different ball game altogether,” Umahi stated when asked whether he would provide land for ranching as a governor.\nREAD ALSO: Herders’ Threat: What Is Going On In Nigeria Is Unconstitutional, Clark Tells BuhariSpeaking further Umahi noted that his people have “said they have no land for ranching.\nIf I have one acre of land and I am talking about giving land for ranching, I should be talking about that particular land."
  },
  {
    "headline": "Unchecked Borrowing May Force Nigeria Into Avoidable Bankruptcy – PDP Governors",
    "summarized_story": "This formed part of the resolutions reached at the end of the meeting of the PDP Governors’ Forum held in Uyo, the Akwa Ibom State capital.\nThe borrowing spree of the APC administration if unchecked will certainly lead Nigeria into avoidable bankruptcy,” a communique issued at the end of the meeting read in part.\nThe governors decried that the debt profile of Nigeria with over 80 per cent of normal appropriation spent on debt servicing was rising and becoming uncontrollable.\nThe governors decried that President Muhammadu Buhari seemed not to be aware that the coercive instruments of state security were firmly within his hands and not the governors, considering his recent media interview on the subject.\nThey stated that despite being on the Exclusive List, the states spend huge sums of money to support the police and other security agencies to carry out their duties."
  },
  {
    "headline": "Gunmen Kill 12, Injure Five Locals In Plateau Attack",
    "summarized_story": "Gunmen suspected to be herdsmen have killed 12 people in an attack on Kuru community in Jos South Local Government Area of Plateau State.\nNo fewer than five other locals were injured during the incident, eyewitnesses told Channels Television on Monday morning during a visit to the scene of the attack.\nThey said following the attack, the injured victims were taken to a primary healthcare facility within the community for medical attention.\nMr Musa Bagos, the lawmaker representing Jos South/ Jos East Federal Constituency in the House of Representatives, was among those who visited the community where residents narrated their ordeal in the unprovoked attack.\nThe Management Committee Chairman of Jos South LGA, Gideon Davou, who was also at the scene, appealed to the residents to allow the security agencies to carry out a proper investigation into the incident."
  },
  {
    "headline": "70 Civil Groups Ask FG To Reverse Twitter Ban, Withdraw Prosecution Threat",
    "summarized_story": "Civil society organisations numbering 70 have called on the Federal Government to reverse the ban placed on Twitter and withdraw the threat to prosecute anyone using the app in the country.\n“We strongly condemn the arbitrary and unlawful suspension of Twitter in Nigeria, by the authorities, and the resulting restrictions on the human rights of people, as well as the threat to prosecute anyone using Twitter in Nigeria.\nThe groups also condemn the “directive” issued by the Nigerian Broadcasting Commission (NBC) for all broadcast stations to deactivate their Twitter accounts.\nAccording to the groups, Social media platforms have helped Nigerians to receive information, impart the same, hold useful conversations, and hold the Nigerian authorities to account.\nA clear example is how social media was used to drive police accountability in the #EndSARs protests last year."
  },
  {
    "headline": "Buhari Is A Willing Horse Nigerians Want To Ride To Death – Ngige",
    "summarized_story": "﻿Minister of Labour and Employment Dr Chris Ngige says President Muhammadu Buhari has tolerated a lot from critics, reiterating that many Nigerians want to stretch him (Buhari) beyond reasonable limits.\nSo, this president (Buhari) is a willing horse and you people (Nigerians) want to ride him to death,” Ngige said during the show.\nCalls for the presidential seat to be zoned to the southeast region have gathered momentum and sharply divided opinion in Africa’s most populous nation.\nBut Ngige has concurred with those who see the 2023 election as a time for the Igbos to get the seat.\nREAD ALSO: Open Grazing: Buhari Threatening To Override State Is Unacceptable – ClarkA Marginalized Region?"
  },
  {
    "headline": "Christine Amanpour announces cancer diagnosis, treatment course to viewers",
    "summarized_story": "CNN’s chief international anchor Christiane Amanpour told viewers Monday that she has been diagnosed with ovarian cancer.\nAmanpour, 63, is one of the best-known journalists in the world, in part due to her fearless coverage of international conflicts.\n“I want to applaud Christiane Amanpour for her candor, bravery and always working towards the greater good,” he said in a statement.\n“As a cancer survivor, I too encourage people to listen to their bodies and get all early cancer screenings available to them.\n“Thank you for being open” about the diagnosis, NBC’s chief foreign affairs correspondent and anchor Andrea Mitchell wrote to Amanpour on Twitter."
  },
  {
    "headline": "ISWAP releases UN staff, 9 Other captives",
    "summarized_story": "The sources also revealed that a businessman, Muazu Bawa, who was also kidnapped on that same day was also released along eight other captives all undergoing debriefing by the military.\nExecutive Director of Yobe State Network of Civil Society, Abubakar Baba Shehu, who also confirmed the release, prayed for more captives to be freed.\n“I was together with someone who called a family member of Alooma and he has confirmed the release of his brother.\nThis is encouraging news and we pray that more captives should be released soon,” Baba Shehu said.\nAdvertisementMeanwhile, friends of the freed captives have taken to facebook and other social media platforms to celebrate the release of their friends from Boko haram captivity."
  },
  {
    "headline": "Naftali Bennett succeeds Netanyahu as Israel’s Prime Minister",
    "summarized_story": "Israel’s parliament has narrowly voted in favor of a new coalition government, putting an end to Prime Minister Benjamin Netanyahu’s unprecedented 12-year rule.\nNaftali Bennett, a former Netanyahu ally turned bitter rival, took over as Prime Minister, presiding over a diverse and fragile coalition of eight parties with profound ideological differences.\nNetanyahu will continue to lead the Likud party and will serve as opposition leader.\nDuring the vote, Netanyahu remained silent.\nA dejected Netanyahu then sat in the opposition leader’s chair, wearing a black medical mask."
  },
  {
    "headline": "UK PM Johnson Delays Lockdown Easing for England by 4 Weeks",
    "summarized_story": "Under the government’s plan for coming out of lockdown, all restrictions on social contact were set to be lifted next Monday.\nThe delta variant first found in India is estimated by scientists advising the government to be between 40% and 80% more transmissible than the previous dominant strain.\nAcross Europe, many countries, including France, have tightened restrictions for British travelers to prevent the delta variant from spreading.\nDespite concerns about the delta variant, the U.K.’s vaccine rollout has won plaudits as one of the world’s speediest and most coherent.\nThe rapid rollout of vaccines and a strict months-long lockdown helped drive down the number of virus-related deaths in the U.K. in recent months."
  },
  {
    "headline": "NATO Leaders Declare China a Global Security Challenge",
    "summarized_story": "NATO leaders on Monday declared China a constant security challenge and said the Chinese are working to undermine global order, a message in sync with President Joe Biden’s efforts to get allies to speak out with a more unified voice against China’s trade, military and human rights practices.\nThe president said he was satisfied with the communique, although differences remain among the allies about how forcefully to criticize Beijing.\nChina is Germany’s top trading partner and is heavily dependent on Russia in fulfilling the country’s energy needs.\nBelgium Prime Minister Alexander de Croo said Biden’s presence “emphasizes the renewal of the transatlantic partnership.” De Croo said NATO allies were looking to get beyond four stormy years under the Trump administration and infighting among member countries.\nBiden’s itinerary in Europe has been shaped so that he would first gather with G-7 leaders and then with NATO allies in Brussels before his much-anticipated meeting with Putin in Geneva on Wednesday."
  },
  {
    "headline": "Bobi Wine Supporters Released After Six Months in Detention",
    "summarized_story": "Eighteen supporters of Uganda’s opposition politician Robert Kyagulanyi have been released by the military court in Kampala has released on bail.\nThe supporters of Mr Kyagulanyi, also known as Bobi Wine were arrested at an election campaign rally in December 2020.\nThey include Bobi Wine’s personal bodyguard Edward Sebuwufu, Eddie Mutwe, and his musician colleague Bukeni Ali known as Nubian Li.\nThey had been arrested in the Lake Victoria island district of Kalangala, during a rally at which Bobi Wine was also picked up and flown against his will to his home in Kampala in a military helicopter.\nDuring the election campaign season and the months following the January polls, Uganda witnessed a wave of arrests and alleged kidnaps of what are believed to be hundreds of opposition supporters."
  },
  {
    "headline": "Wole Soyinka Speaks on Open Grazing, Democracy Day and 2023 Elections",
    "summarized_story": "Nobel laureate Wole Soyinka was a guest on ARISE News on Monday to speak on burning national issues.\nHe reacted to a recent exclusive interview on ARISE NEWS by President Muhammadu Buhari.\nAccording to Soyinka, the President is not listening.\nSoyinka also said Nigeria may not celebrate another Democracy Day, while he also shared his thoughts on the forthcoming 2023 elections.\nWatch the engaging in interview…"
  },
  {
    "headline": "‘Buhari Isn’t Listening’: Soyinka Criticises President on Grazing Routes, Says Nigeria on a Nosedive",
    "summarized_story": "Nigeria’s President Muhammadu Buhari has displayed his inability to listen to citizens and respect the decisions of the southern governors when he directed the Attorney General of the Federation, Abubakar Malami to produce a gazette, which drafted grazing routes in all parts of the country in the First Republic, that’s according to noble laureate Wole Soyinka.\nIn an appearance on ARISE News on Monday, Professor Soyinka faulted President Buhari’s stance on digging up a colonial law he says is meant to recover lands on behalf of certain private businesses.\nHe says the language of the President is disturbing because he may have felt that through his utterances he was on a roll while in actuality the nation is on a nosedive.\nWatch the interview."
  }
]