[
  {
    "headline": "Petroleum Industry Act: States tackle FG today as FAAC meets, NBA advises governors",
    "summarized_story": "Ahead of the FAAC meeting, the Nigerian Bar Association advised the state governors to challenge the Act in court.\nIt meets monthly to share revenues among the federal, state and local governments.\nObviously, the law will top the agenda of the FAAC meeting on Thursday (today).\nOlofu, who is Benue State’s Commissioner for Finance, who spoke to one of our correspondents in Makurdi on the phone, confirmed that the FAAC meeting would be held today (Thursday).\n“If the governors believe that some parts of the Act are unconstitutional, then by all means, let them approach the courts."
  },
  {
    "headline": "PIA full implementation in 2022, Nigeria loses $50bn investments",
    "summarized_story": "), on Wednesday, approved a steering committee to supervise the implementation of the newly signed Petroleum Industry Act.\nThe Special Adviser to the President on Media and Publicity, Femi Adesina, disclosed this in a statement titled, ‘President Buhari Approves Steering Committee on Petroleum Industry Act’.\nAdesina disclosed this in a statement titled, ‘Nigeria Lost Estimated $50bn Worth of Investments in 10 years due to Stagnation, Uncertainty over Petroleum Industry, says President Buhari’.\nIn the past 10 years, Nigeria lost an estimated $50bn worth of investments due to uncertainty created by the non-passage of the PIB.\n“This administration believes that the timely passage of the Petroleum Industry Bill will help our country attract investments across the oil and gas value chain."
  },
  {
    "headline": "Just In: Gunmen kill 4, kidnap 11 Islamiyya school pupils, teacher in Katsina",
    "summarized_story": "By Bashir BelloGunmen suspected to be bandits have killed four persons and kidnapped 11 Islamiyya school pupils and a teacher in an attack launched on two villages in Katsina State.\nSP Isah said, “the bandits swooped on Tsayau village late Monday night where they carried out the dastardly act.\n“The bandits kidnapped six people during the operation , revealing that efforts were on by security operatives to rescue them.\n“Similarly, the bandits on Tuesday evening initially kidnapped 11 pupils but two escaped from the kidnappers’ den.\n“A combined team of security personnel is currently combing the area in search of the pupils,” SP Isah however said."
  },
  {
    "headline": "NPA commences review of terminal concession agreements",
    "summarized_story": "There are 26 private terminal concessionaires currently operating across the country out of which five of are due for renewal of the concession license.\nThe affected concessionaires, are Ports & Cargo Terminal Ltd, operators of Terminal ‘C’ at the Tin-Can Island Port, Tin-Can Island Container Terminal, TCIP; ENL Consortium, Terminal C, Lagos Port Complex, LPC; ENL Consortium, Terminal D, LPC Josephdam Terminal and AMS Terminal, Delta Port.\nENL Consortium, Terminal C,LPC 3.\nENL Consortium, Terminal D,LPC 4.\n“To address the issue of skewed concession agreements, we have undertaken a review of the Lekki Deep Sea Port Concession Agreement, and have been able to secure an upward review of not just the commencement fee, but also for the royalty payable to the Authority."
  },
  {
    "headline": "Apapa Gridlock: Customs agents commends NPA’s management for effective control of traffic",
    "summarized_story": "Aduwa also said that the NPA management has assisted port users by ensuring some level of sanity at the port corridor and keeping the vehicles away from the roads.\nHe words, “NPA has been doing well since the deployment of the new Port Manager.\n“Before now it used to be hectic before we can access Tin Can Island Port Complex before we can do our jobs.\nSpeaking in similar vein, Engr Ibrahim Yinusa, Port Manager, Tin-Can Island Port disclosed that on assumption of office, he was able to engage several stakeholders to ensure congestion on the roads are addressed.\nThe Port Manager maintained that the fruitful engagement with the road contractors also contributed to the sanity faced at TCIPC."
  },
  {
    "headline": "PIB: PGF reassures commitment to democratic process",
    "summarized_story": "The Progressives Governors Forum (PGF), says it is committed to a democratic process of negotiating reform of the country, to make it more responsive to the needs of Nigerians.\n“We remain committed to a democratic process of negotiating the reform of our republic to make it more responsive to the needs of Nigerians.\n“We join all Nigerians to celebrate this important achievement in the operations and management of Nigerian oil and gas sector.\n“We also want to use this opportunity to congratulate members of the two chambers of the national assembly for the successful passage of the PIB.\nBagudu said the new Act, presented a convincing credential of the commitment of the APC, to restructure Nigerian economy through democratic process in line with provisions of the 1999 Constitution as amended."
  },
  {
    "headline": "PIA: Lawan hints on amendment of new law",
    "summarized_story": "Senate President, Ahmad LawanBy Johnbosco AgbakwuruABUJA–PRESIDENT of the Senate, Dr. Ahmad Lawan yesterday said if there are identified areas in the newly signed Petroleum Industry Act, PIA, that require amendment, they should be brought to the National Assembly for legislative action.\nHe said it is when implementation starts, that’s when people will start to see where and where amendment is needed.\nSo when we are able to see issues, the National Assembly is there.\nThe host communities have suffered enough, even when NDDC was established, I’m sure it was established because of the host communities’ issues and yet the host communities did not get much attention.\n“This time, the host communities have been specifically mentioned and these funds should go there."
  },
  {
    "headline": "Taliban: Bandits can take over Nigerian government – Bamgbose warns",
    "summarized_story": "Olusegun Bamgbose, Esq., National Coordinator, Concerned Advocates for Good Governance, has warned that bandits in Nigeria, could as well achieve what Taliban perfected in Afghanistan recently.\nBamgbose noted that the whole scenario began with a steady trickle of military defeats; first, the Afghan government was ceded to the Taliban in provincial towns and cities.\n“The truth is that bandits in Nigeria, could as well achieve the same feat in Nigeria,” he told DAILY POST.\nThe Taliban take over could equally motivate the bandits to one-day attempt to take over Aso Rock.\nThe best thing to do in the circumstances will be to root out the bandits before they will turn out to be another Taliban in Nigeria."
  },
  {
    "headline": "Plateau crisis: ‘You’re a very weak leader’ – HURIWA blasts Gov Lalong",
    "summarized_story": "Following the renewed killings in Plateau State by suspected Fulani herdsmen, the Human Rights Writers Association of Nigeria, HURIWA, has described the state governor, Simon Lalong, as a very weak leader.\nThe group said that the governor has indeed proven time without number to be a very weak leader to his people.\nHURIWA condemned the Plateau State governor for standing by and watching in an unbelievable way as Plateau State Christians were killed.\nThe rights group wondered how the suspected armed Fulani herdsmen beat the military curfew in the state in the last twenty-four hours and killed many people.\nHURIWA is therefore charging the Plateau State governor to stand up, speak out and take concrete action to stop the attacks on Christians by armed Fulani herdsmen and indeed stop all attacks on citizens irrespective of their ethno-religious affiliation."
  },
  {
    "headline": "Mixed reactions trail demolition of roundabouts in Imo",
    "summarized_story": "The recent demolition of some major roundabouts in Owerri, the Imo State capital, on the order of the state Governor, Hope Uzodinma, has been generating much reactions from people in the state.\nFirst to be affected was the Ware House Roundabout roundabout situated in front of the Imo International Conference Centre IICC, followed by the Emmanuel College roundabout by Wetheral Road.\nOther roundabouts destroyed include the Fire Service roundabout situated along Mbaise road, Poly junction by Naze., Aba road among others.\nThe pulling down of these roundabouts, described as landmark structures by the Rescue Mission Government, has raised some concerns from stakeholders who have questioned the rationale behind the demolition.\n“Imo is the only state where the government demolished a roundabout and rebuilt it,” he said."
  },
  {
    "headline": "Maritime varsity Rector, Effedua warns cadets against cultism",
    "summarized_story": "The Rector of the Maritime Academy of Nigeria Oron, Commodore Duja Effedua (retd), has advised the Nigeria Maritime University (NMU) cadets to shun acts of cultism and other vices that would jeopardize their studies and future by extension.\nOn the achievements recorded, the Rector said he was able to add value to the Academy through funds gotten from blocked financial loopholes in the system.\nHe also attributed the achievements to the cooperation exhibited by members of staff and management.\nHe said “I visited the Academy a few years ago and it is nothing compared to what I have seen today, the transformation is massive.\n“In Nigeria, people crave for second term even when they did not achieve much in their first tenure, I am of the opinion that the second term should be considered on the strength of one’s performance during the first term, I want to add that from all indications you deserve a second term,” he added."
  },
  {
    "headline": "Election tribunal dismisses suit seeking to sack LG Chairman in Rivers",
    "summarized_story": "The Rivers State Local Government Election Petitions Tribunal sitting in Port Harcourt has dismissed a petition by the chairmanship candidate of Advance Democratic Congress, Bright Abali, seeking to sack Vincent Nwaobakata-Job as the Chairman of Ogba Egbema Ndoni Local area of the state.\nNwaobakata-Job was declared the winner of the April 17 local government chairmanship election for Ogba Egbema Ndoni Local Government Area of the state by Rivers State Independent Electoral Commission, RISIEC.\nAccording to the panel, the petitioner was four days late in filing suit.\nOn the substantive matter, the tribunal held that the petitioner failed to prove his case and dismissed it for “incompetence”.\nThe panel also awarded the sum of N100, 000 against the petitioner in favour of the respondents."
  },
  {
    "headline": "Nigeria: Tragedies of double neo-colonialism",
    "summarized_story": "The West and parts of Asia like China and Japan continue to rule Nigeria and by extension, the entirety of the African world.\nIt is a great pity that almost 61 years after independence, Nigeria remains a stunted baby who is unable to crawl let alone walk.\nThis African political giant knew the workings of the West especially its power of diplomatic manoeuvres.\nThe second level of neo-colonialism results from the selfish style of the Nigerian political class.\nNigerian political rulers must do away with relics of stone age impulses that are holding us down as a country."
  },
  {
    "headline": "Of IBB, Okupe and 2023 presidency",
    "summarized_story": "You can also trust Okupe, a core Yoruba political conservative, to follow his core conscience, even if his fellow conservatives falter.\nWith IBB, therefore, Okupe would appear to have come a long way.\nIn a rush, Okupe has claimed IBB had him in mind, when he told Arise TV that he had pencilled down at least three suitable candidates, in their 60s, who would succeed President Muhammadu Buhari.\nIBB, visioner-in-chief, in the powerful IBB Selectorate 2023, had roared on Arise TV: “I have started visualising a good Nigerian leader.\nBelieve IBB and you can believe Shakespeare’s Macbeth’s three witches!"
  },
  {
    "headline": "Buhari for son’s wedding in Kano on Friday",
    "summarized_story": "President Muhammadu Buhari is expected to attend the wedding Fatiha of his son, Yusuf and his bride, Zahra Bayero on Friday in Bichi, Kano State, Chairman, organising committee for the wedding, Shehu Ahmed, announced on Wednesday.\nFielding questions from reporters on activities marking the event, Ahmed said the wedding Fatiha, will hold by 1:30 pm after the Friday prayer.\nADVERTISEMENT“President Muhammadu Buhari is expected to grace the wedding Fatiha of his son and the daughter of the Emir of Bichi in Bichi town on Friday.\n“Adequate arrangements had also been put in place by the various subcommittees to ensure the success of the two events.”Security was tightened in Kano State, particularly in Bichi on Wednesday ahead of Buhari son’s wedding and coronation of the bride’s father.\nHeavily armed operatives landed at the Aminu Kano Airport and headed to Bichi."
  },
  {
    "headline": "JUST IN: Lalong relaxes curfew in Plateau councils",
    "summarized_story": "Plateau Governor Simon Lalong has relaxed the 24-hour curfew imposed on Jos North Local Government on Sunday.\nUnder the new arrangement, the curfew will be observed from 6pm to 6am daily from Thursday August 19, 2021.\nADVERTISEMENTIn relaxing the curfew Lalong warned trouble makers to desist from threatening or be ready for a showdown with security forces who have been directed to be tough with anyone causing breach of the peace.\nHe regretted there were isolated attacks in some areas of Jos North and Bassa LGAs during the curfew.\nWhile the curfew is relaxed in Jos North, security agencies will mount permanent checkpoints in high vulnerable areas."
  },
  {
    "headline": "Arewa, Yoruba, Igbo, M’Belt elders support Masari’s self-defence call",
    "summarized_story": "They agree that the security situation has reached a point where Nigerians must take their destiny in their own hands.\nBut for the spokesman, Arewa Consultative Forum (ACF), Emmanuel Yawe, governor as chief security officer has the constitutional powers to put in place security measures that would safeguard his state.\n“Governor of Katsina, as provided in the 1999 Constitution, is the chief security officer of his state.\nHe is, therefore, permitted by the constitution to introduce security measures within the boundaries of his state and his state alone.\n“That also confirms what people have always said, that the security situation in the country is terrible and there doesn’t seem to be any capacity from the government to defeat it."
  },
  {
    "headline": "Death of 7 family members: Osun orders full investigation",
    "summarized_story": "From Lateef Dada, OsogboOsun State Government has ordered immediate investigation into the circumstances surrounding the death of seven members of a family found dead in their rooms at Apomu, Isokan Local Government Area of state.\nThe Osun State Police Command had confirmed the report of the death of the family members.\nOpalola said poison of carbon monoxide (generator fume) is suspected to be the cause, but the result of autopsy would confirm the cause of death.\n“The remains of the other dead members of the family had also been taken to Obafemi Awolowo University (OAU) Teaching Hospital, in Ile-Ife, where autopsy will be carried out on them to ascertain the cause of their death.\nTheir bodies were reportedly taken to a private hospital in the community by sympathisers, but were rejected, before they were taken to OAU Teaching Hospital morgue."
  },
  {
    "headline": "Lagos gets special team to stop street begging, hawking",
    "summarized_story": "By Lukman OlabiyiLagos government has set up a special team to stop street begging and hawking in the state.\nDawodu said curbing street begging was necessary to sanitise the society and restore dignity for those sent on the streets for alms begging and hawking.\n“The special team will tackle the menace frontally and would commence operation in the next few days,” he said.\nThe commissioner said the task of the team was not only to sanitise the society, but also restore the dignity of hawkers and beggars.\nHe said street begging was a social vice that government cannot afford to watch attain uncontrollable level in order not to affect the good plans and programmes to transform the state."
  },
  {
    "headline": "Igboho: Court extends restraining order on AGF, DSS",
    "summarized_story": "The court had on Wednesday August 4, this year, granted a restraining order against the DSS and AGF, from arresting, intimidating, harassing and freezing the bank accounts of Igboho.\nThe case with number M/435/2021, instituted by Igboho, against the trio of AGF as first respondent, DSS as second respondent, and Director of DSS in Oyo State as third respondent.\nBut counsel to the first respondent, Abubakar prayed the court for an extension of time for AGF to file his response to the processes filed by Igboho.\nBut Abubakar and Nurudeen filed an application on their preliminary objections to the case, asking the court to vacate the restraining order, and strike out or dismiss the suit.\nThe court, however, adjourned the case to Monday August 30, this year, for decision on the application."
  },
  {
    "headline": "Nigeria lost $50bn investments in10 years due to non-passage of PIB –Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has disclosed that Nigeria lost an estimated $50 billion worth of investments in 10 years due to non-passage of the Petroleum Industry Bill (PIB), lack of progress and stagnation in the petroleum industry.\nThe President stated this in his remarks at a ceremony on the Petroleum Industry Act (PIA), which preceded the Federal Executive Council (FEC) meeting, yesterday.\nAccording to a statement by Special Adviser on Media and Publicity, Femi Adesina, Buhari said assent to the PIB on August 16 marked the end of decades of uncertainty and under-investment in the petroleum industry.\nIn the past 10 years, Nigeria has lost an estimated $50 billion worth of investments due to uncertainty created by the non-passage of the PIB.\nHe said the signing of the bill was part of the administration’s commitment to building a competitive and resilient petroleum industry that would attract investment, improve revenue base, create jobs and support economic diversification agenda."
  },
  {
    "headline": "APC to Hold LG Congress Sept. 4",
    "summarized_story": "By Adedayo AkinwaleThe All Progressives Congress (APC) has fixed Saturday, September 4, 2021 for the conduct of the Local Government Area Congresses.\nThe National Secretary of Caretaker/Extraordinary Convention Planning Committee of the party, Sen. John Akpanudoedehe, in a statement issued Wednesday said the sale of forms for various party positions had commenced.\nHe said: “APC Schedules Local Government Area Congresses for Saturday, 4th September, 2021; begins sale of forms.”However, the party has not fixed any date for the State Congresses.\nRecall that the Ward Congresses conducted by the party which held on July 31 was rancorous in some states, while it was hitch free in others.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Despite Curfew, Suspected Fulani Herders Kill Six in Fresh Plateau Attacks",
    "summarized_story": "By Seriki AdinoyiGunmen suspected to be Fulani herders have again attacked Bassa Local Government Area of Plateau State, killing five persons, despite the curfew.\nPlateau state government had imposed curfew on Jos North, Jos South and Bassa LGAs.\nBut the assailants attacked Tafi-Gana village on Tuesday night where they killed their victims while asleep.\nIn another attack in Dong village, the gunmen killed a resident, a leader of the community, Danjuma Auta, confirmed this to THISDAY.\nThe Military Information Officer of the Special Task Force (STF), Major Ishaku Takwa, could not be reached to respond to the recent killings."
  },
  {
    "headline": "Breaking: Buhari Appoints Sylva as Head of 9-man Steering Committee for Implementation of Petroleum Act",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari on Wednesday named the Minister of State for Petroleum Resources, Timipre Sylva, to head the steering committee to oversee the implementation of the new Petroleum Industry Act.\nThis is just as the President who returned last Friday from an 18-day visit to the United Kingdom presided over the weekly virtual Federal Executive Council (FEC) meeting at the State House, Abuja.\nThe primary responsibility of the steering committee shall be to guide the effective and timely implementation of the PIA in the course of transition to the petroleum industry envisaged in the reform programme, and ensure that the new institutions created have the full capability to deliver on their mandate under the new legislation.\nThough the committee has 12 months duration for the assignment, periodic updates will be given to Mr President.\nMeanwhile, the Federal Executive Council (FEC) meeting is underway at the Conference room of the First Lady’s office with President Buhari presiding."
  },
  {
    "headline": "Buhari Set to Announce PIA Implementation Committee Today",
    "summarized_story": "The PIA which was birthed on Monday, would serve as framework for the operations in the oil and gas industry.\nThe PIA provides legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters.\nOn the host communities’ fund, the minister explained that it was better to have three per cent of what the communities are sure of.\nSo, we must come together as a country, frontier and host communities,” he advised.\nIt is a good way to start, after decades of groping in the dark in the oil industry."
  },
  {
    "headline": "AFGHANISTAN: THE FUTILITY OF UNILATERAL USE OF FORCE",
    "summarized_story": "The rest were unilateral show of force and military prowess which it often dubs as rescue missions.\nBut the moves are better known in international law as humanitarian interventions which actually centre on the threat and use of military force by a state on another state to enforce an intended action.\nThe swiftness of the Talibans in retaking Afghanistan after 20 years of U.S military occupation seems to prove wrong the unilateral use of force by any single nation.\nAfghanistan military offered no semblance of resistance while Taliban amassed forces.\nMany U.S citizens had over the years questioned the continued stay of the country’s military in Afghanistan at huge costs to the country."
  },
  {
    "headline": "Plateau Residents Defy Curfew, Troop Out In Search Of Food",
    "summarized_story": "Residents of Jos North, Plateau State, on Wednesday defied the curfew placed on the local government area by Governor Simon Lalong and trooped out en masse to search for food.\nGovernor Lalong had on August 15 declared a 24-hour curfew in the LGA following the massacre of about 22 travelers on Saturday by hoodlums.\nThe 24-hour curfew followed the earlier dusk-to-dawn curfew imposed on three local government areas in the state (Bassa, Jos South, and Jos North) due to security threats and tension witnessed by residents in some parts of the state.\nSaharaReporters learnt that some residents thought the state government would relax the curfew after 24 hours in other to enable them to buy food items.\n“Our hope was dashed as Governor Lalong and his security team refused to relax the curfew because of the fear of the unknown,” a resident said."
  },
  {
    "headline": "Plateau Residents Defy Curfew, Troop Out In Search Of Food",
    "summarized_story": "Residents of Jos North, Plateau State, on Wednesday defied the curfew placed on the local government area by Governor Simon Lalong and trooped out en masse to search for food.\nGovernor Lalong had on August 15 declared a 24-hour curfew in the LGA following the massacre of about 22 travelers on Saturday by hoodlums.\nThe 24-hour curfew followed the earlier dusk-to-dawn curfew imposed on three local government areas in the state (Bassa, Jos South, and Jos North) due to security threats and tension witnessed by residents in some parts of the state.\nSaharaReporters learnt that some residents thought the state government would relax the curfew after 24 hours in other to enable them to buy food items.\n“Our hope was dashed as Governor Lalong and his security team refused to relax the curfew because of the fear of the unknown,” a resident said."
  },
  {
    "headline": "EXPOSED: How Terrorists-linked, Pantami’s ICT Bill Favours Jigawa, Home State Of Infotech Agency's Director-General",
    "summarized_story": "The current Director-General of the National Information Technology Development Agency (NITDA, Inuwa Kashifu Abdullahi, is from Jigawa State, and the provision hence means he or one of the cronies will sit on the management of the new company.\nThe new bill for which Pantami is lobbying officials is targeted at repealing the National Information Technology Development Agency Act, no 28 2007.\nSee Also Scandal Terror-linked Buhari's Minister, Pantami Bribes Information Tech Agency Board Members With Foreign Trip To Support ICT—Killer Bill“Establishment of a Digital Infrastructure and Service Provision Company.\nThe Company shall engage the services of individuals as staff on such terms and conditions that may be approved by its Board from time to time.\nOne of the sources said, “Pantami tries to destroy technology sector and systematically encroach on works of other agency."
  },
  {
    "headline": "EXPOSED: How Terrorists-linked, Pantami’s ICT Bill Favours Jigawa, Home State Of Infotech Agency's Director-General",
    "summarized_story": "The current Director-General of the National Information Technology Development Agency (NITDA, Inuwa Kashifu Abdullahi, is from Jigawa State, and the provision hence means he or one of the cronies will sit on the management of the new company.\nThe new bill for which Pantami is lobbying officials is targeted at repealing the National Information Technology Development Agency Act, no 28 2007.\nSee Also Scandal Terror-linked Buhari's Minister, Pantami Bribes Information Tech Agency Board Members With Foreign Trip To Support ICT—Killer Bill“Establishment of a Digital Infrastructure and Service Provision Company.\nThe Company shall engage the services of individuals as staff on such terms and conditions that may be approved by its Board from time to time.\nOne of the sources said, “Pantami tries to destroy technology sector and systematically encroach on works of other agency."
  },
  {
    "headline": "EXPOSED: How Terrorists-linked, Pantami’s ICT Bill Favours Jigawa, Home State Of Infotech Agency's Director-General",
    "summarized_story": "The current Director-General of the National Information Technology Development Agency (NITDA, Inuwa Kashifu Abdullahi, is from Jigawa State, and the provision hence means he or one of the cronies will sit on the management of the new company.\nThe new bill for which Pantami is lobbying officials is targeted at repealing the National Information Technology Development Agency Act, no 28 2007.\nSee Also Scandal Terror-linked Buhari's Minister, Pantami Bribes Information Tech Agency Board Members With Foreign Trip To Support ICT—Killer Bill“Establishment of a Digital Infrastructure and Service Provision Company.\nThe Company shall engage the services of individuals as staff on such terms and conditions that may be approved by its Board from time to time.\nOne of the sources said, “Pantami tries to destroy technology sector and systematically encroach on works of other agency."
  },
  {
    "headline": "Lai: We won't rest until social media is regulated",
    "summarized_story": "Lai Mohammed, minister of information and culture, says the federal government will not rest until social media platforms are regulated.\nAdvertisementThe minister, in an interview with NAN in Washington, on Wednesday, said the dangers of fake news on social media must be taken seriously.\nMohammed also explained that the online media report that he “sneaked out of Nigeria to meet with Twitter executives’’ in the US is fake.\nI can assure you that we will not rest until we regulate the social media.\nAdvertisementRecently, the federal government said it is in talks with the microblogging platform, adding that the suspension will be lifted soon."
  },
  {
    "headline": "Lai: We won't rest until social media is regulated",
    "summarized_story": "Lai Mohammed, minister of information and culture, says the federal government will not rest until social media platforms are regulated.\nAdvertisementThe minister, in an interview with NAN in Washington, on Wednesday, said the dangers of fake news on social media must be taken seriously.\nMohammed also explained that the online media report that he “sneaked out of Nigeria to meet with Twitter executives’’ in the US is fake.\nI can assure you that we will not rest until we regulate the social media.\nAdvertisementRecently, the federal government said it is in talks with the microblogging platform, adding that the suspension will be lifted soon."
  },
  {
    "headline": "Nine students kidnapped as gunmen attack Katsina community",
    "summarized_story": "Nine students have been kidnapped in Sakkai area of Katsina state, following an attack on the community.\nThe students were said to be returning from the Islamiyya school in the area, when they ran into the gunmen who were attacking the residents of the area.\nThe nine students, all boys, were said to have been taken away by the gunmen, who drove away on motorcycles.\nAdvertisement“The bandits were seen going into the Sakkai village and abducted nine male students from the school.\nAdvertisementMasari had also, on Tuesday, urged residents of the state to rise above meekness and defend themselves against attacks by gunmen."
  },
  {
    "headline": "Nine students kidnapped as gunmen attack Katsina community",
    "summarized_story": "Nine students have been kidnapped in Sakkai area of Katsina state, following an attack on the community.\nThe students were said to be returning from the Islamiyya school in the area, when they ran into the gunmen who were attacking the residents of the area.\nThe nine students, all boys, were said to have been taken away by the gunmen, who drove away on motorcycles.\nAdvertisement“The bandits were seen going into the Sakkai village and abducted nine male students from the school.\nAdvertisementMasari had also, on Tuesday, urged residents of the state to rise above meekness and defend themselves against attacks by gunmen."
  },
  {
    "headline": "Falana: Petrol smuggling has official backing -- NNPC must build filling stations in neighbouring countries",
    "summarized_story": "Femi Falana, a senior advocate of Nigeria (SAN), says the smuggling of petrol to neighbouring countries is “officially carried out”.\nAdvertisementOn Monday, Hameed Ali, the comptroller-general of customs, had asked the Nigerian National Petroleum Corporation (NNPC) to set up filling stations in neighbouring countries to curb smuggling.\nAnd now to stop this nefarious crime, I have pleaded with the government; let NNPC build mega stations in the neighbouring countries, Cameroon, Togo, Benin up to Ghana,” he said.\nA few months later, NNPC claimed that the figure had jumped to 102 million litres.\nFalana said the NNPC, using the Economic Community of West African States (ECOWAS) building-up model, could set up mega stations in neighbouring countries."
  },
  {
    "headline": "Meet Regina Honu, a Ghanaian software developer teaching thousands of girls to code",
    "summarized_story": "Failure is not finalIn her first year in senior secondary school, Honu had her first taste of failure during an Inter-school quiz competition.\nConversation between Regina Honu and students of Ashesi University during a visit.\nSame experience at another bank and turning away from a job at MicrosoftShe eventually left Zenith bank for Fidelity bank, a Ghanaian Bank.\nResigning from her JobThe morning of the day Honu resigned from her job, she didn’t know it would happen.\n10 years and countingIt’s been almost 10 years since Honu started Soronko Academy, for her there’s still so much more to do."
  },
  {
    "headline": "Nigeria’s Central Bank freezes bank accounts of fintech platforms Risevest, Bamboo, Trove and Chaka",
    "summarized_story": "The Central Bank of Nigeria has just frozen the bank accounts of Nigerian fintech platforms Risevest, Bamboo, Trove and Chaka for the next six months.\nNotably, all four companies affected by this action have gotten licenses from Nigeria’s Securities and Exchange Commission (SEC) to operate as digital platforms for buying and selling stocks.\n— Bamboo (@investbamboo) August 17, 2021So far none of the affected companies has come out to refute this claim.\nAccording to a source from one of the affected companies, they lost a lot of users and deposits after the April announcement.\nTechCabal has reached out to the affected fintech companies and is awaiting their comments."
  },
  {
    "headline": "Nigerian startup checks out of Afghanistan post Taliban takeover",
    "summarized_story": "The central government was disbanded; Ashraf Ghani, the president of Afghanistan fled the scene unannounced, leaving what remained of his administration in the mercy of the Taliban.\nMore recently, Chekkit, a Nigerian authentication and product tracking startup, expanded to Afghanistan after landing a partnership with the Afghanistan Ministry of Health to help in combating the endemic counterfeit medicine products in the country.\nTheir exit wasn’t much of a decision as all their partners have been forced to exit the country.\nObservers predict that with the Taliban in control, international trade will come to a standstill, leading to a surge in smuggling.\nThough after the capital takeover, the Taliban announced that the war is now over, can the dust settle that easily?"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "A Federal High Court sitting in Abuja has granted the Central Bank of Nigeria an order to freeze the accounts of..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "Lagos power market holds gains for Nigeria if FG allows",
    "summarized_story": "If Lagos State were a country, it would be Africa’s fifth largest economy.\nEven with the smallest landmass, Lagos contributes at least 70 percent of taxable income to the Federal purse and its own power market could double this contribution if only the Federal Government backs the plan.\nThe Lagos State government led by Babajide…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Host communities get fair deal in new oil law",
    "summarized_story": "If the new oil sector law was passed last year, host communities in the Niger Delta would have got $500 million for the development of their region this year.\nThis is in addition to the existing contribution of 3 percent oil companies already contribute to the Niger Delta Development Commission (NDDC) for the oil host…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Green Africa may not be Nigeria’s cheapest airline",
    "summarized_story": "Unless passengers plan to travel without luggage on Green Africa, they may be paying just as much as others pay for other airlines in Nigeria or even more.\nAgainst assumptions that Green Africa is the cheapest domestic carrier in Nigeria, there are indications that the airline is introducing certain strategies to cushion effects of cost…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Herdsmen’s Renewed Attacks on Plateau State: Lalong a weak leader – HURIWA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestHUMAN RIGHTS WRITERS ASSOCIATION OF NIGERIA (HURIWA) has condemned the Plateau State governor for standing by and watching in an unbelievable way as Plateau State Christians are killed, stating that, this shows weakness on the part of the state governor, Simon Lalong.\n“The Plateau State governor Mr. Simon Lalong has indeed proven time without number to be a very weak leader of his people who have consistently come under persistent and vicious attacks against Plateau Christian native communities by armed Fulani herdsmen.\nAccording to HURIWA, despite the dusk-to-dawn curfew imposed on Bassa and other two Local Government Areas, suspected herdsmen on Tuesday night killed five persons in Chando-Zrrechi (Tafi-Gana) of Miango District in Bassa Plateau State.\nHURIWA therefore, is charging the Plateau State governor to stand up, speak out and take concrete action to stop the attacks on Christians by armed Fulani herdsmen and indeed stop all attacks on citizens irrespective of their Ethno-Religious affiliation.\n“Plateau State governor by his lacklustre approach to the genocides in Plateau State since 2015 is showing that he is a failed Chief executive of Plateau State and history and posterity will judge him harshly”."
  },
  {
    "headline": "No plan to increase taxes in Edo, Obaseki assures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has assured that his administration has no plan to increase taxes in the state, noting that the state seeks inclusiveness and participation from citizens in revenue generation and administration.\nThe governor gave the assurance after a closed-door meeting with stakeholders in tax administration at the Edo State Internal Revenue Service (EIRS) head office in Benin City.\nObaseki’s visit to EIRS office follows the expiration of the tenure of the board, led by Igbinidu Inneh.\nHe said the state’s revenue service needs to be re-energized before the appointment of a new board.\nThe governor said the ratio of people who pay taxes compared to the taxable population in the state is very small, noting, “There is no need to increase taxes."
  },
  {
    "headline": "Erosion control project: Edo diverts traffic, closes sections of Murtala Mohammed Way for four weeks – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo Nigerian Erosion and Watershed Management Project (NEWMAP) has announced the temporary closure of sections of the Murtala Mohammed Way, Benin City, to facilitate ongoing construction of the flood erosion alleviation work in the Ogiso/Osunde catchment areas of the city.\nIn a statement, Communications Officer, Edo NEWMAP, Ivy Adodo, said the roads will be closed for four weeks commencing from Thursday, August 19, 2021.\nAdodo, while assuring the timely execution of the project, appealed for the patience and understanding of the general public, particularly those in the affected areas.\nThe statement reads: “This is to inform the general public that the Edo Nigerian Erosion and Watershed Management Project (NEWMAP) is currently executing the flood erosion alleviation work in the Ogiso/Osunde catchment areas in Benin City.\n“To enable the construction of two culverts along Murtala Mohammed Way in Benin City to effectively drain and transport runoff within the catchment, the section between Osemwende Street and Agbonmwoba streets on Murtala Mohammed Way will be closed to Traffic for Four weeks commencing from Thursday 19th August, 2021.”Adodo further stated: “During this period, traffic moving toward Ikpoba Slope will detour using either of Osemwende street, a Nekpenepken and Ozolua Streets, through 2nd East Circular and continue down to Akpakpava road or can rejoin Murtala Mohammed Way again using either of Agbonmwoba Street, Igun Street, St. Stephen Street and Imuetinyan Street."
  },
  {
    "headline": "COVID-19: Religious bodies to set up COVID-19 vaccination centres in Edo, as govt intensifies vaccine rollout – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestReligious leaders in Edo State have urged residents to get vaccinated against the deadly coronavirus (COVID-19), to complement the government’s efforts at containing the pandemic.\nThis is so that people in various churches can be vaccinated.\nThe vaccine will not kill you; it will rather save and protect you.\n“We are in full support that the vaccination should be done in our various churches.\nChairman, Organization of African Instituted Churches (OAIC), Edo State, Apostle-General Dr."
  },
  {
    "headline": "Police inspector, six others killed in deadly attack in Imo",
    "summarized_story": "ADVERTISEMENTSeven people were killed in Imo State, Nigeria’s South-east, on Monday, when some gunmen ambushed a convoy transporting workers to a facility belonging to the Shell Petroleum Development Company of Nigeria.\nSix of the victims were working with a services company, Lee Engineering Company, which has a contract with Shell, the police spokesperson in Imo State, Mike Abattam, told PREMIUM TIMES, Wednesday.\nThe pro-Biafra group, IPOB, has been most active in Imo State.\nTwo police officers were killed about five days ago during a gun attack on a police facility in Imo, for instance.\nThe country home of the Imo State Governor, Hope Uzodinma, was attacked and part of it set ablaze by gunmen in April."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Enjoying banking convenience with First Bank FirstMobile",
    "summarized_story": "The efforts in this regard include building and constantly improving on its product offerings like the FirstMobile, its industry-leading mobile banking app; FirstOnline, the internet banking portal and many other platforms provided by the Bank to ensure banking operations are performed with ease and convenience without having to be physically present at the bank.\nFirstMobile is the official mobile banking application from FirstBank and it provides convenient access to both financial and non-financial transactions by FirstBank account holders via their mobile devices.\nIt is also poised to offer a more reliable and more convenient overall digital banking experience.\nOther features of the FirstMobile App include frequent transactions; dashboard flexibility and personalisation.\nTo set up the FirstMobile App, customers with android phones should visit the Google Play store to download and install the FirstMobile app."
  },
  {
    "headline": "Giving.ng partners Run Club Abuja to support NFI school",
    "summarized_story": "Giving.ng, Africa’s free crowdfunding platform has partnered with the Run Club Abuja (RCA) on a charity run to raise funds for The Not Forgotten Initiative School (NFI), a not-for- profit school based in Abuja, Nigeria.\nRun Club Abuja, a fitness & lifestyle club organized the ‘Charity Half Marathon’, preceded by a crowdfunding campaign to raise fund for the school designed to support less privileged children.\nThe President of Run Club Abuja, Mr. Henry Okelue thanked Giving.ng for their partnership.\nAlso, expressing her appreciation, the founder of the school, Mrs. Tosin Adeniyi who was at the half marathon, said: “We at NFI are exceedingly grateful to Run Club Abuja for organising this run.\nThe highlight of the charity event was the presentation of N2.02 million raised, via the giving.ng platform, to NFI School."
  },
  {
    "headline": "Earth Networks, NiMet partner to provide weather services",
    "summarized_story": "Earth Networks, a global provider of weather intelligence, has announced formation of partnership with the Nigerian Meteorological Agency (NiMet).\nUnder the agreement, Earth Networks and NiMet will deploy and operate a comprehensive early warning lightning detection network in Nigeria and jointly co-market new sources of weather and lightning data to public and private industries in Nigeria.\nPrecision weather stations and lightning sensors will be hosted at NiMet locations and maintained by NiMet staff.\nIn addition to the network equipment, Earth Networks will also provide training and development for NiMet staff regarding use of comprehensive weather data, including real-time and historical lightning data, weather observations, sensor forecasts and live storm-tracking and alerting.\nThis new agreement with NiMet supports Earth Networks’ commitment to build sustainable public-private weather information services partnerships with countries around the globe."
  },
  {
    "headline": "Again, bandits abduct pupils in Katsina school",
    "summarized_story": "Bandits have abducted pupils of Islamiyya school and one teacher in Sakkai village, Faskari Local Government Area of Katsina State.\nThe victims were abducted while attending evening lesson within the school premises, Daily Trust reported.\nMeanwhile, three persons were killed when bandits attacked Batsari town, headquarters of Batsari Local Government Area of Katsina.\n“By the time the bandits came to Batsari, we learnt that the security men were at Dankar village which was surrounded by bandits,” he said.\nHe added that eight persons were abducted by the gunmen during the attack."
  },
  {
    "headline": "Bandits Kill 11, Abduct 40 In Zamfara",
    "summarized_story": "Gunmen suspected to be bandits have attacked Randa village in Dansadau Emirate of Maru Local Government Area of Zamfara State, killing 11 and abducting over 40 people.\nAn eyewitness from Dansadau town told Channels Television that the bandits stormed the village in their large numbers on Tuesday at about 11:00 pm and started shooting sporadically forcing residents to scamper for safety.\nAccording to the eyewitness, the local vigilante known as “Yansakai” confronted the bandits and got into a fire exchange but were overpowered by them.\nADVERTISEMENTThe latest attack came a few days after bandits kidnapped a total of 20 people comprising 15 students, four staff, and a driver at the College of Agriculture and Animal Sciences, Bakura in Zamfara.\nDuring the attack on Sunday, two watchmen and a police officer were killed."
  },
  {
    "headline": "Bandits Kill 11, Abduct 40 In Zamfara",
    "summarized_story": "Gunmen suspected to be bandits have attacked Randa village in Dansadau Emirate of Maru Local Government Area of Zamfara State, killing 11 and abducting over 40 people.\nAn eyewitness from Dansadau town told Channels Television that the bandits stormed the village in their large numbers on Tuesday at about 11:00 pm and started shooting sporadically forcing residents to scamper for safety.\nAccording to the eyewitness, the local vigilante known as “Yansakai” confronted the bandits and got into a fire exchange but were overpowered by them.\nADVERTISEMENTThe latest attack came a few days after bandits kidnapped a total of 20 people comprising 15 students, four staff, and a driver at the College of Agriculture and Animal Sciences, Bakura in Zamfara.\nDuring the attack on Sunday, two watchmen and a police officer were killed."
  },
  {
    "headline": "Peterborough Records Spike In COVID-19 Cases",
    "summarized_story": "Figures for Peterborough in Cambridgeshire reveal the city has the fourth highest number of COVID-19 cases in England.\nUp until 13 August there were 519 cases per 100,000 population; an 18% increase on the same time the previous week.\nAcross the East of England there were 266 cases per 100,000 people, equalling a 2% increase in infections.\nLatest NHS data revealed 37 COVID-19 patients were currently in North West Anglia NHS Foundation Trust (NWAFT) hospitals, with six on ventilators.\nOf these, 228 deaths were at Hinchingbrooke Hospital and 479 at Peterborough City Hospital."
  },
  {
    "headline": "Peterborough Records Spike In COVID-19 Cases",
    "summarized_story": "Figures for Peterborough in Cambridgeshire reveal the city has the fourth highest number of COVID-19 cases in England.\nUp until 13 August there were 519 cases per 100,000 population; an 18% increase on the same time the previous week.\nAcross the East of England there were 266 cases per 100,000 people, equalling a 2% increase in infections.\nLatest NHS data revealed 37 COVID-19 patients were currently in North West Anglia NHS Foundation Trust (NWAFT) hospitals, with six on ventilators.\nOf these, 228 deaths were at Hinchingbrooke Hospital and 479 at Peterborough City Hospital."
  },
  {
    "headline": "Assault On Nigerian Diplomat In Indonesia Contravenes Vienna Convention",
    "summarized_story": "The outpouring of disgust that trailed the assault on a Nigerian diplomat serving in Jakarta, Indonesia, has again raised questions about Nigeria’s diplomatic engagements with the rest of the world.\nNigerian diplomat, Abdul Ibrahim was seen on a viral video almost being strangled by Indonesian immigration officials for allegedly moving in the streets without identification.\nHowever, experts have said that Nigeria needs to take more drastic action because the assault contravened the Vienna Convention.\nHe however, denounced the mistreatment of the Nigerian diplomat, adding that Indonesia failed to abide by the Vienna Convention on diplomatic and consular relations, which the two countries are signatory to.\nHe said that if the Indonesian authorities do not provide satisfactory answers to this assault, Nigeria must apply the same measures to Indonesia."
  },
  {
    "headline": "Opinion: This Ebolarised generation – By GABRIEL AKINADEWO",
    "summarized_story": "Last Monday, President Goodluck Jonathan described the late Patrick Sawyer, who brought the Ebola Virus Disease (EVD) or Ebola Hemorrhagic Fever (EHF) to Nigeria, as a mad man.\nBecause its lethality is swift, we must commend the Federal Government and the Lagos State Government for the way they have contained it so far.\nBut one thing is sure, Nigerians’ eternal resilience will stop the spread of this deadly Ebola virus.\nIs this per-second killing of Nigerians by Nigerians not worse than the Ebola disease?\nFor PhD holders to apply to be sweeping streets, which Ebola disease could be more lethal than this?"
  },
  {
    "headline": "Opinion: This Ebolarised generation – By GABRIEL AKINADEWO",
    "summarized_story": "Last Monday, President Goodluck Jonathan described the late Patrick Sawyer, who brought the Ebola Virus Disease (EVD) or Ebola Hemorrhagic Fever (EHF) to Nigeria, as a mad man.\nBecause its lethality is swift, we must commend the Federal Government and the Lagos State Government for the way they have contained it so far.\nBut one thing is sure, Nigerians’ eternal resilience will stop the spread of this deadly Ebola virus.\nIs this per-second killing of Nigerians by Nigerians not worse than the Ebola disease?\nFor PhD holders to apply to be sweeping streets, which Ebola disease could be more lethal than this?"
  },
  {
    "headline": "Anglican Church Sacks Priest For Kissing Female College Students",
    "summarized_story": "The Anglican Church of Ghana has sacked one of its priests, Balthazar Obeng Larbi, who was captured kissing female students of the St Monica’s College of Education in Asante Mampong.\nThe development comes after an emergency meeting between school authorities and the Anglican Church was held in Asante Mampong after a viral video.\nThe resolution was to relieve Larbi of his duties as a priest and also as a lawyer for the Ghana Education Service in the Ashanti region.\nThe Anglican Church of Ghana had earlier condemned the act and promised an internal investigation on the priest.\nIn a viral video, Obeng Larbi was seen kissing female students from the St Monica’s College of Education in Asante Mampong."
  },
  {
    "headline": "Anglican Church Sacks Priest For Kissing Female College Students",
    "summarized_story": "The Anglican Church of Ghana has sacked one of its priests, Balthazar Obeng Larbi, who was captured kissing female students of the St Monica’s College of Education in Asante Mampong.\nThe development comes after an emergency meeting between school authorities and the Anglican Church was held in Asante Mampong after a viral video.\nThe resolution was to relieve Larbi of his duties as a priest and also as a lawyer for the Ghana Education Service in the Ashanti region.\nThe Anglican Church of Ghana had earlier condemned the act and promised an internal investigation on the priest.\nIn a viral video, Obeng Larbi was seen kissing female students from the St Monica’s College of Education in Asante Mampong."
  },
  {
    "headline": "Outrage over plans for \"Sultan of Shuwa Arabs of Edo state\"",
    "summarized_story": "By Jethro Ibileke/BeninPlans by some Shuwa Arabs, an ethnic group from Borno, to crown Idris Adanno as the Sultan of Shuwa Arab of Edo State, is generating palpable tension across Benin Kingdom.\nInvitation card to the coronation ceremony, sighted on Facebook, has triggered some outrage.\n“This will never happen in Benin Kingdom, we are Benin,” Ugbo added.\nWe should now have OBA and Sultan in Edo state ?\nThat some Shuwa Arabs are staging another show, less than three weeks after, is indicative of a division amidst the Shuwa Arabs living in Edo State."
  },
  {
    "headline": "U.S. troops stay in Kabul extended: Biden",
    "summarized_story": "U.S. troops may stay in Afghanistan past a 31 August deadline to evacuate Americans, President Joe Biden said on Wednesday.\nI don’t have the capability to go out and extend operations currently into Kabul,” U.S. Defense Secretary Lloyd Austin told reporters at the Pentagon.\nA top U.S. diplomat separately said on Wednesday the United States expects the Taliban to allow Afghans who wish to leave Afghanistan to depart safely.\nread moreAustin said the United States was not satisfied with how many people were being evacuated.\n“It’s obvious we’re not close to where we want to be in terms of getting the numbers through,” he said."
  },
  {
    "headline": "Lai Mohammed Denies Sneaking Out Of Nigeria To Meet Twitter Executives In U.S",
    "summarized_story": "Alhaji Lai Mohammed, the Minister of Information and Culture, has denied an online media claim that he “sneaked out of Nigeria to meet with a Twitter executive” in the United States.\nMohammed said he was in the United States to speak with international media organizations and think tanks about President Muhammadu Buhari’s administration’s accomplishments and efforts to date in combating insurgency, banditry, and all forms of criminality.\nHe claimed that the internet article exemplified the dangers that fake news and unregulated social media pose to the country.\n“I can assure you that we will not rest until we regulate the social media, otherwise, nobody will survive it,’’ he said.\nThe conversation between Twitter and the Federal Government on how to fix the ban problem had progressed, according to Mohammed."
  },
  {
    "headline": "US Freezes Afghanistan Central Bank’s Assets Of $9.5billion, Blocks Taliban’s Access To Cash",
    "summarized_story": "An administration official said Tuesday that the US froze roughly $9.5 billion in assets belonging to the Afghan central bank and halted cash shipments to the country in an effort to prevent a Taliban-led government from receiving the funds.\n“Any Central Bank assets the Afghan government has in the United States would not be made available to the Taliban,” an administration official said in a statement.\nAccording to the International Monetary Fund, Afghanistan’s central bank had $9.4 billion in reserve assets as of April.\nAmong them, the United States holds billions of dollars, albeit the exact quantity is unknown.\nA spokesperson with the Federal Reserve Bank of New York, which is said to be holding bulk of the money, likewise declined to comment."
  },
  {
    "headline": "Bandits Kill Woman, New-born Baby, 11 Others, Kidnap Many In Fresh Zamfara Attack",
    "summarized_story": "In Randa, Dansadau area of Maru Local Government Area in Zamfara State, gunmen suspected of being bandits massacred 13 people, including a woman and her baby.\nHundreds of additional people, including women and children, were injured in the incident, according to SaharaReporters.\nA source told SaharaReporters that the gunmen kidnapped approximately 40 men and women.\n“Yesterday, in Randa, over 13 persons, including a woman and her newborn baby, were killed.\nA few weeks ago, gunmen raided the College of Agriculture and Animal Sciences in the Bakura Local Government Area of the state, abducting 19 students and employees."
  },
  {
    "headline": "BREAKING: Gunmen Kidnap Islamiyya Students, Teacher In Katsina",
    "summarized_story": "Eight students from an Islamiyya school in Sakkai village, Faskari Local Government Area, Katsina State, have been kidnapped by gunmen suspected of being bandits.\nOne of their professors was also kidnapped, according to The PUNCH on Wednesday.\nThe gunmen arrived at the school on motorbikes just as the students were preparing to leave for the day, according to residents.\nThe gunmen allegedly began firing indiscriminately, causing a ruckus on the school grounds and in the surrounding towns.\nSP Gambo Isah, the Katsina police spokesman, has yet to respond to a text message given to him."
  },
  {
    "headline": "Taliban takeover: At last, Afghan President, Ghani, opens up",
    "summarized_story": "Afghan President Ashraf Ghani, speaking from exile in the United Arab Emirates, said on Wednesday that he had left Kabul to prevent bloodshed and denied reports he took large sums of money with him as he departed the presidential palace.\nAnti-Taliban protests in the eastern city of Jalalabad over the removal of the Afghan flag have now spread elsewhere in Afghanistan.\nIn Jalalabad, at least three people have been reportedly killed and a dozen others wounded after shots fired at protest against removal of Afghan flag by Taliban.\nMeanwhile, planes carrying hundreds of evacuees from Kabul have arrived in the United Kingdom and Germany as Western nations stepped up evacuation efforts.\n(Aljazeera)"
  },
  {
    "headline": "N4.973trn balances in 2019 Audit Report unsubstantiated – AGF",
    "summarized_story": "Auditor General of the Federation Adolphus Aghughu has said unsubstantiated balances amounting to N4.973 trillion was observed by his office in the audit carried out on consolidated financial statement of the federal government of Nigeria in 2019.\nHe spoke Wednesday in Abuja while submitting the 2019 Audit Report to Clerk of the National Assembly (CNA) Ojo Amos Olatunde.\nThe auditor general said: “From the audit carried out on the 2019 Federal Government Consolidated Financial Statement, unsubstantiated balances amounting to N4.973 trillion were observed.\n“Just five months after, we are here again to make submission of the 2019 Audit Report,” Aghughu also said.\n“One of such problems is the absence of Federal Audit Service Law which is a big challenge as far as effective and efficient public sector auditing is concerned."
  },
  {
    "headline": "Nigeria lost $50bn investments to delayed PIB passage – Buhari",
    "summarized_story": "Following the uncertainty that for long surrounded the Petroleum Industry Bill (PIB) and the consequent lack of progress and stagnation in the industry, Nigeria lost an estimated $50 billion worth of investments in 10 years, President Muhammadu Buhari has said.\nWith the Act, Buhari said, the decades of uncertainty and under-investment in the petroleum industry were gone.\nIn the past ten years, Nigeria has lost an estimated US$50 billion worth of investments due to uncertainty created by the non-passage of the PIB.\n“This administration believes that the timely passage of the Petroleum Industry Bill will help our country attract investments across the oil and gas value chain.\n“The 3 percent will be paid directly to the host communities to manage."
  },
  {
    "headline": "Poor leadership limiting impact of trade unions- Sirika -NigPilot",
    "summarized_story": "Minister of Aviation, Hadi Sirika, has highlighted that like in other sectors, the challenge of poor and non-proactive leadership has reduced the impact of Trade Unions across sectors in the country.\nThis, he said has contributed to a lack of trust by members and wrong strategies by union leaders in addressing the myriads of issues that regularly call for attention.\n“On our part, we will continue to support the involvement of union leaders and workers in our policy and decision-making processes.\n“In the Nigerian aviation sector, I dare say that the various labour unions have tried to play this role effectively.\nThis role enables labour unions to ensure that cordial and good understanding between employers and employees could be established in the workplace and leads to a harmonious and conducive working environment."
  },
  {
    "headline": "Nuhu Yahaya: Adamu sets up Committee to probe cause of death -NigPilot",
    "summarized_story": "Following the recent news of the death of a JSS II student of Federal Government College, Kwali, Abuja, Nuhu Yahaya, the Minister of Education, Malam Adamu Adamu has set up a Committee to investigate the circumstances of his death.\nAdamu who confirmed the death of the student in the press statement issued to journalists by the Ministry’s Director, Press and Public relations, Mr. Ben Bem Goong, said the Ministry has dispatched a condolence letter to the family of the boy and has equally paid a visit to the family.\nThe rumor of the death of the 13 years Yahaha has been making the rounds on social media since two weeks ago, alleging that his female teacher was responsible for his death.\nIt was alleged that Nuhu Yahaya who died on the 9th of August was beaten to death by his female teacher.\nMeanwhile, the Education Minister has dismissed this speculation, advising the members of the public, even the media, to shun such rumors on the death of Nuhu until the committee comes up with its findings."
  },
  {
    "headline": "Nigeria mulls synergy with S/Leone to secure West Africa -NigPilot",
    "summarized_story": "Dingyadi who spoke during a courtesy call by the Sierra Leone delegate led by the Minister of Interior, David Maurice Panda-Noah, and the Inspector General of Police, IGP Ambrose Sovula at the ministry’s headquarters in Abuja, noted that such synergy between Nigeria and Sierra Leone would enhance the efficiency of rank and files of Police to secure West African region.\nHe said, “in addition to the National Institute of Police Studies, we have other police colleges around the country that can train intermediate officers.\nPanda-Noah stressed the urgent need for African countries to unite, synergize and collaborate in order to combat transnational challenges.\nHe said: “Africa has their own unique problems which only Africans can solve.\nSupporting one another is key to tackling the challenges which have bedeviled Africa and the world at large."
  },
  {
    "headline": "APC to conduct LG Congresses Sept 4 despite controversiesw -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Nigeria Lost $50bn In 10 Years Due To Uncertainty Over Petroleum Industry – Buhari",
    "summarized_story": "President Muhammadu Buhari on Wednesday in Abuja said Nigeria lost an estimated $50billion worth of investments in 10 years.\nThis, according to him, was a result of the uncertainty of the non-passage of the Petroleum Industry Bill (PIB), lack of progress and stagnation in the petroleum industry.\nPresident Buhari said assent of the Petroleum Industry Bill on August 16, 2021, marked the end of decades of uncertainty and under-investment in the petroleum industry.\n“This administration believes that the timely passage of the Petroleum Industry Bill will help our country attract investments across the oil and gas value chain.\nPresident Buhari said the administration believes that the timely passage of the Petroleum Industry Bill will help the country attract investments across the oil and gas value chain."
  },
  {
    "headline": "PIA: We Discussed With Labour Extensively, No Job Will Be Lost – Sylva",
    "summarized_story": "The Minister of State for Petroleum Resources, Mr Timipre Sylva has assured that no job will be lost in the nation’s petroleum sector following the signing of the Petroleum Industry Bill into law.\n“So, no job will be lost as a result of the Petroleum Industry Act.\nAll jobs in the petroleum industry will be intact.\nWhile noting that the commercialisation of the Nigerian National Petroleum Corporation (NNPC) will be beneficial to the workers, Sylva explained that the move would not create any problem at all.\nTwo days after the bill was signed, the President approved a committee to immediately commence the implementation of the Petroleum Industry Act (PIA)."
  },
  {
    "headline": "VIDEO: Abducted Zamfara Students Beg Govt To Pay Ransom In 24 Hours",
    "summarized_story": "﻿The abducted students of the College of Agriculture and Animal Sciences, Bakura in Zamfara State have appealed to Governor Bello Matawalle and the government to pay the ransom demanded by their abductors within 24 hours.\n“We are the students of the College of Agriculture and Animal Science, Bakura that were abducted by the bandits,” said one of the students who spokes in Hausa.\nThey are threatening to kill us if the government does not produce the ransom in 24 hours.\nA total of 20 people comprising 15 students, four staff, and a driver were abducted on Sunday night when bandits stormed the school.\nTwo days after the incident, the abductors demanded a ransom of N350 million before they would release their victims."
  },
  {
    "headline": "Taliban Pledge No Revenge Against Opponents, To Respect Women’s Rights",
    "summarized_story": "The Taliban have offered a pledge of reconciliation, vowing no revenge against opponents and to respect women’s rights in a “different” rule of Afghanistan from two decades ago.\n“All those in the opposite side are pardoned from A to Z,” Taliban spokesman Zabihullah Mujahid told foreign and local reporters, revealing his identity for the first time.\nDesperationNevertheless, Afghans and foreigners continued to flee the country, with the United States and other nations stepping up evacuation airlifts from Kabul.\nThe United Nations Human Rights Council announced on Tuesday it would hold a special session on Afghanistan next week to address the “serious human rights concerns” under the Taliban.\nHe arrived from Qatar, where he has spent months leading talks with the United States and then Afghan peace negotiators."
  },
  {
    "headline": "Reps Committee Asks FIRS To Produce Receipts Of Tax Payments By MTN",
    "summarized_story": "The House of Representatives Committee on Finance has asked the Federal Inland Revenue Service (FIRS) to submit receipts of the tax payments made by MTN to the agency for 2007 and between 2010 and 2017.\nThe request comes as the committee observed during its interaction with the agency on Wednesday that MTN is indebted to the tune of ₦451 billion.\nThe FIRS chairman, Mr Muhammed Nami, however, told the committee that MTN is already paying the taxes owed government in instalments.\n“On the issue of a digital economy, the FIRS has a department called International Tax Department which is handling such cases,” he said.\nThat is why in our revenue projections, we are raising it from N5 trillion in 2021 to N10 trillion in 2022."
  },
  {
    "headline": "Deal with abductors of innocent School girls, Christian group tells FG",
    "summarized_story": "Recall that the school was invaded on April 14, 2014, by Boko Haram Terrorists and 276 girls were taken away.\nTVC NEWS reports that both girls were found with children from their abductors.\nAdvertisementThe Christian organisation stated that, “our concern stems from the fundamental human rights of these girls that were willfully violated.\nThey were forcefully abducted from their school when they were preparing to write an exam.\n“They have suffered unimaginable violations of their rights for seven years with debilitating impact on their future."
  },
  {
    "headline": "Police secure release of 12 Kidnap victim in Zamfara",
    "summarized_story": "Police in Zamfara have again secured the release of eleven kidnap victims without ransom.The victims who had been in captivity for six days were abducted at Yarkofoji village in Bakura local government area of Zamfara stateAmong them is the chief Security Officer of the College of Health Technology, Tsafe who was whisked away at his residence when the armed men invaded his houseThe victims are made up of eight men, three women.\nA press statement signed by the Spokesperson of the Zamfara state Police Command, Superintendent Shehu Mohammed says they were rescued without ransom through the effort of troops.\nThe statement added that the search and rescue strategies employed by the Commissioner of Police, Ayuba Elkana led to the successful rescue of the abducted victimsAdvertisementThe police further assured residents of the command’s effort to rescue other kidnap victims currently in captivity and that lives and Properties will be adequately protected.\nThe rescued victims according to the police have been medically checked, debriefed and reunited with their familiesThe Commissioner of Police congratulated the victims for regaining their freedom and urged them to be security conscious and report any suspicious person to the Police or any nearest security outfit for prompt response.\nThe rescue of the eleven kidnap victims is coming hours after abductors of the Bakura students and staff of college of Agriculture and Animal Science release a video of threat to kill them if ransom is not paid within twenty four hoursYarkofoji is the village that abductors of the students and staff of college of Agriculture Bakura showed the kidnapped students corpses of their victims who were killed as a result of the inability of their relations to pay their ransom"
  },
  {
    "headline": "UNIOSUN: NMA condemns exclusion of members from Vice Chancellorship",
    "summarized_story": "The Nigerian Medical Association, Osun state chapter says it will not accept deliberate attempt to disenfranchise qualified medical lecturers from the vice chancellorship contest in the state.\nThe Association made this known in Osogbo in reaction to a recent advertisement requesting applications for the post of Vice-Chancellor by the management of the state University.\nThe NMA said its members with postgraduate Fellowship which is the highest academic and professional qualification of the medical profession should not be excluded from contesting the vice chancellorship seat of the Institution.\nTo drive home their stand, the body cited holders of Medical Fellowships without PhD who are currently or have previously served as Vice Chancellors in first and newer generation Nigerian Universities as against the requirements in the advertisement by the University.\nIt also described press statement released during the weekend by the University’s PRO over the requirements for the post as unfortunate and not in the interest of government and the good people of the state."
  },
  {
    "headline": "Burkina Faso: Those Accused of Killing Thomas Sankara To Be Tried October 11 in Ouagadougou",
    "summarized_story": "The trial will be relocated “in the banquet hall of Ouaga 2000” and will be “public”, the text said.\nIn addition to Compaoré, 12 other defendants will be tried for “attack on state security,” “complicity in assassinations,” and “complicity in receiving corpses.\nGeneral Diendéré is currently serving a 20-year prison sentence in Burkina Faso for a 2015 coup attempt.\nMore people were initially implicated, but “many of the defendants have died,” according to lawyers for the prosecution.\nBlaise Compaoré lives in Côte d’Ivoire, Burkina Faso’s neighbouring country, where he fled after his fall and of which he obtained the nationality."
  },
  {
    "headline": "Richard Mofe-Damijo: Nigerian Actors Constantly Shortchanged Through Piracy",
    "summarized_story": "Top Nigerian actor Richard Mofe Damijo says Nigerian performers are constantly shortchanged through acts of piracy that ensures they don’t get what’s due them.\nHe stated this on Wednesday when he featured on an ARISE News programme, The ARISE Interview, and noted that the ikpressive global reach of Nollywood movies does not translate to the expected income.\nMr Damijo, a former Commissioner for Culture and Tourism in Nigeria’s southern Delta State also told ARISE News how proud his mother has been seeing him perform several movie roles on television.\nWatch the interview for more…"
  },
  {
    "headline": "Tiwa Savage’s New EP ‘Water & Garri’ Featurez Nas and Brandy",
    "summarized_story": "Nigerian musician Tiwa Savage has announced Friday, August 20, as the drop date for her highly anticipated EP Water & Garri, with the official track list featuring Brandy, Nas, and Tay Iwar as well as Ghanaian-American singer Amaarae.\nMeanwhile, with the Star Wars trilogy in his rear-view mirror, John Boyega says he can go back to exercising the versatility that earned him the role of Finn in the first place in new movie, Naked Singularity.\nFinally, Spain’s leading group of women filmmakers have condemned the San Sebastian film festival’s decision to award Johnny Depp its highest honour as the group says it will be giving the international event a bad name after a British judge ruled last year that allegations of domestic violence against the actor were “substantially correct”."
  },
  {
    "headline": "Mali Coup Leader Goita Justifies Coup He Led Mali One Year Ago",
    "summarized_story": "Mali’s leader Col Assimi Goïta gave a short address Wednesday to the nation justifying the coup he led a year ago.\nHe said the army could not just stand by and watch the growing political crisis – and breakdown of governance under President Ibrahim Boubacar Keïta.\n“Men and women came together to express their desire for change.\nCol Goïta led a second coup in May, declaring himself president.\nHe pledged then that he would return the country to full civilian rule as planned early next year."
  },
  {
    "headline": "US Sends Nearly 500 000 Covid Vaccine Doses to Rwanda",
    "summarized_story": "The United States is sending nearly half a million doses of the Pfizer Covid-19 vaccine to Rwanda, including the first doses from the Biden administration’s 500 million global pledge earlier this summer, the White House said on Tuesday.\n“Today, we are shipping over 488 000 doses of Pfizer to Rwanda, including the first 100 000 doses from ⁦@POTUS⁩’ 500 million shots pledged and purchased this summer.\nUS President Joe Biden in June said the United States would donate 500 million doses of Pfizer’s shot, made with partner BioNTech SE, and officials have said they would start shipping out in late August.\nIn Rwanda, COVID-19 infections are decreasing with 584 average daily reported cases, 42% of its peak caseload reported on July 22.\nBiden administration health officials have said efforts to quell the novel coronavirus outbreak worldwide are key to ending the pandemic and preventing future problematic COVID strains, in addition to ongoing efforts to vaccinate people in the United States."
  }
]