[
  {
    "headline": "Odegbami, Anibeze to speak at SMED launch",
    "summarized_story": "Former Super Eagles captain Segun Odegbami will deliver papers at the launch of Sport and Media Development Network.\nThe SMED Network is a Non-Governmental Organisation set up to help youths, media practitioners, and athletes to boost their respective careers.\nSaturday Editor, Vanguard Newspapers, Onochie Anibeze, and former Ogun State Commissioner for Sports, Bukola Olopade, are also expected to deliver papers at the event.\nAccording to the Chairman, Board of Trustees, SMED, Gboyega Okegbenro, the experience of the resource persons will be useful for the youths in the country and beyond.\n“Odegbami played football to the highest level, winning the Nations Cup for Nigeria in 1980, while someone like Anibeze, a former Sports Editor of Vanguard, covered most of the world’s sporting competitions like the World Cup, Olympic Games, Commonwealth Games, African Games, amongst several others."
  },
  {
    "headline": "Rivers boss burns nine-year-old housemaid with iron over alleged stubbornness",
    "summarized_story": "The family of a nine-year-old girl, Favour Anigbogu, has demanded justice after she was allegedly brutalised by her boss, Ginika Nebafe, who reportedly used a hot iron to inflict injuries on her head.\nGinika, while accusing the victim of stubbornness, allegedly used a hot iron to hit her in the head.\nThe girl’s mother, Chindima Anigbogu, said when she called Ginika to ask about the welfare of her child, the suspect lied that Favour had an accident and was being treated.\nBut the one that pained me most was this recent one that she used a hot iron to beat my daughter in her head, pulling her hair and flesh off.\nThe suspect, however, denied torturing Favour with a hot iron, saying she was only involved in a domestic accident."
  },
  {
    "headline": "UFC: Covington vows to beat Usman",
    "summarized_story": "UFC welterweight No.1 title contender Colby Covington says he is confident of beating champion Kamaru Usman in their rematch at UFC 268 at the Madison Square Garden on November 7.\nCovington has maintained that the fight was called too early for the ‘Nigerian Nightmare’ also rubbishing reports that his jaw was broken in the fight.\n“I think the fans will be in for a treat and I think it’s going to be the biggest fight in the history of the UFC.\nI am hungrier than ever, I wake up every morning with revenge on my mind and I’m going to serve him the revenge cold next week.\n“I’m confident that next weekend, I’m going to get my hands raised and I’m sure there’s no man alive that can stop me."
  },
  {
    "headline": "Firm expresses readiness to support NDLEA on reducing substance abuse among youths",
    "summarized_story": "Wants other corporate organizations to join handsBy Gabriel Ewepu – AbujaAs insecurity turns out to be nightmare in the country, an agricultural firm, SWEER Global Farms, Thursday, expressed readiness to support National Drug Law Enforcement Agency, NDLEA, on reducing substance abuse among young people in the country.\nHe also explained why his company is out to collaborate and support effort of the Chairman/Chief Executive Officer of the National Drug Law Enforcement Agency, NDLEA, Gen. Muhammad Buba Marwa (Retd), which he acknowledged his impact and proactive approach to tackle the monster called drug abuse.\nSWEER Global Farms is currently investing millions of Naira in the agricultural sector, and are based in Amassoma, Southern Ijaw, Bayelsa State.\n“I want to use this opportunity to call on other corporate organizations across the country to join hands with the government through the NDLEA to fight the menace of drug abuse in this country.\nEnough resources should be put in to ensure the youths of this country are rescued from the jaws of drug abuse."
  },
  {
    "headline": "Onions producers canvass for increased production to meet local demand",
    "summarized_story": "He said that the 1.4 million metric tonnes of onions currently being produced in the country annually was not enough to meet the demands of Nigerians, hence the call for increased production to meet the 2.5 metric tonnes required for local consumption.\n“We are producing 1.4 metric tonnes, but what we need is 2.5 metric tonnes.\n“So, we need support and empowerment from government because we need to step up our production to meet the demands,” he said.\nMaitasamu-Isah explained that the association chose Nasarawa state for the inauguration, because of the efforts made by the Gov.\nHe called on farmers to take the advantage of the knowledge that would be shared with them on onions production to increase their production."
  },
  {
    "headline": "ICPC recovers 301 houses from 2 public servants",
    "summarized_story": "By Levinus Nwabughiogu, ABUJAThe Independent Corrupt Practices and Other Related Offences Commission, ICPC, has said that 301 houses were recovered from two public officers, adding that real estate aids illicit financial flows, IFF.\nThe agency said “the real estate sector is globally recognised as attractive to IFF largely because it is partially informal, not properly regulated and so easily open to abuse.\nICPC made the revelations at an investigative hearing of the House on corruption in real estate sector, where the ICPC and the Economic and Financial Crimes Commission, EFCC, fingered some officials of government as culprits.\nIn his presentation, the ICPC Chairman, Professor Owasanonye said: “Public officers acquire estates in pseudonyms to conceal the illegal origin of funds.\n“The commission has, for example, a case in which recovered 241 houses from a public officer and another one in which we recovered 60 buildings on a large expanse of land from public officer.”Vanguard News Nigeria"
  },
  {
    "headline": "Nigeria needs N6trn to bridge housing deficit — Gbajabiamila",
    "summarized_story": "*…as ICPC, EFCC finger FCDA, NSCDC officials in FCT real estate scamBy Levinus Nwabughiogu ABUJASpeaker, House of Representatives, Femi Gbajabiamila, Thursday, said that Nigeria housing deficit rate was alarming.\nHe said the deficit is currently estimated to be between 17 and 20 million housing units.\nAlhassan Ado Doguwa, Gbajabiamila bemoaned lack of legal framework to properly monitor the activities of estate developers.\n“With the current housing deficit in Nigeria, which is estimated to be between 17 and 20 million housing units and also said to be increasing annually by 900,000 units, the potential cost of overcoming this deficit is about N6 trillion.\n“This highlights the huge opportunity that exists in the real estate sector."
  },
  {
    "headline": "5 students die in Kano auto crash, 13 hospitalised",
    "summarized_story": "By Abdulmumin Murtala, KANOGovernor Abdullahi Ganduje of Kano state has commiserated with the families of five students who died in an auto crash along Kano-Katsina Road, leaving 13 others hospitalised.\nIn a statement issued by the Chief Press Secretary, Abba Anwar Thursday night the governor expressed shock over the untimely death of the students, describing it as tormenting.\n“We were shocked over the death of our children; the five students who died in auto crash on their way to Katsina state for Zonal students meeting.\nREAD ALSO: HIGHWAYS OF DEATH: 41,257 killed in road accidents in 97 months“While the first four are from Sa’adatu Rimi College of Education, Kumbotso, the last person is from Federal College of Education, Kano,” he stated.\n“We received the news of the demise of five our students from Kano axis of NANS, majority of who are students of Sa’adatu Rimi College of Education, Kumbotso, following a ghastly motor accident while on their way to Katsina to attend a function."
  },
  {
    "headline": "Nigerian soldiers arrest TASUED Students Union President, others in Ogun",
    "summarized_story": "Troops of the Nigerian Army have arrested Sodiq Ridwan, Students Union President (SUP) of Tai Solarin University of Education (TASUED), Ijagun in Ijebu Ode, Ogun State.\nA student said the students were moving in different cars when Army personnel stopped them around Conoil Filling Station.\n“They stopped students’ cars, ordered them to step out and were checking their phones.\nMany other students were taken too.”Another source stated that the students got unruly as they moved in a convoy in continuation of final year examination celebration.\nTASUED Vice Chancellor, Prof. Wole Banjo confirmed to DAILY POST that the military arrested the students."
  },
  {
    "headline": "Hushpuppi: I’ve not received FBI’s extradition request for Abba Kyari – IGP, Usman Baba",
    "summarized_story": "The Inspector-General of Police, Usman Baba, has said he is yet to receive a formal extradition request from the Federal Bureau of Investigations (FBI) for Abba Kyari, Deputy Commissioner of Police, following his indictment by a US court.\nKyari has been accused of being a conspirator in a $1.1m fraud deal involving Instagram celebrity, Ramon Abbas aka Hushpuppi.\nBaba confirmed that the panel constituted to investigate the case had submitted its report to the Secretary-General of the Federation (SGF), Boss Mustapha.\n“I have not received any extradition request formally.\nBut I have read from other places that there was an extradition request."
  },
  {
    "headline": "Senate demands improved funding of Niger Delta Ministry",
    "summarized_story": "Given the strategic nature of the Minister Niger Delta Affairs, to the sustainability of peace and security in the oil rich region, the Senate has called for better funding of the Ministry.\nThe upper Chamber made their position known at the budget defence of the agency on Thursday when the Minister of Niger Delta Affairs, Senator Godswill Akpabio appeared before the Senate Committee on Niger Delta Affairs.\nA member of the Committee, Senator James Manager while reacting to the budget performance of the Ministry for 2021 remarked that the budget for 2021 and 2023 for the Niger Delta Ministry was too meagre to achieve anything meaningful in the region.\n“The ministry’s budget is too small to sustain the current peace we are enjoying in the region.\nThe impact of COVID-19 Pandemic has further necessitated the intervention of the Ministry to ameliorate the infrastructure and Human Capital Development of the people of the region.”"
  },
  {
    "headline": "Strike: Labour’s industrial action politically motivated – Cross River govt",
    "summarized_story": "The Cross River State Government has described the ongoing industrial action by organized labour in the state as politically motivated.\nRecall that the Cross River government had earlier this month faulted organized labour’s insistence on industrial action despite meeting their demands.\nHe regretted labour’s rigid stand and accused it of deliberately misinforming the public as to what transpired in the last negotiation meeting both parties held.\n“Labour’s conduct and utterances further give a flip to the insinuation that the industrial action it embarked upon has political undertone.\n“They failed to accept the fact that during negotiation, every action must be suspended to give room for normal ground."
  },
  {
    "headline": "Abolongo jailbreak: Makinde visits family of slain military officer",
    "summarized_story": "Governor Seyi Makinde of Oyo State has visited the family of one of the security agents that were killed during an attack on the Abolongo correctional centre.\nOur correspondent gathered that two security agents died as a result of the incident.\nThey included a soldier and an operative of Oyo State Security Network also known as Amotekun.\nMakinde has, however, on Thursday visited the family of the military officer, Ekaile Emmanuel.\nHe described the officer as an incredibly brave military officer."
  },
  {
    "headline": "Forex Trading – A Quick Review of Forex Trading Platforms and Brokers",
    "summarized_story": "In response, the Forex companies worldwide cut back on their activities in the US stock market in response to limited foreign market opportunities.\nThe de-listing resulted in an even tougher competition among Forex brokers and traders trying to make regular investments in the forex market in the US.\nYou need to check out forex brokers and go towards the best one.\nFor example, because there was a lack of access to profitable trading opportunities, many forex investors lost confidence in forex trading and forex brokers.\nMany of these US investors had invested money in forex brokers and trading services which they had previously relied on for reliable and reasonable trading signals."
  },
  {
    "headline": "Top Tips on How to Save Money During a Business Expansion",
    "summarized_story": "Thankfully, there are ways in which to nimbly avoid the many potential pitfalls when it comes to a business expansion, so in order to make sure you get the possible start with your new venture, here are some tips worth considering.\nDo Your Own Digital Marketing- Advertisement -By brushing up on your writing skills and sharpening your SEO abilities, you can potentially make huge savings on the marketing aspect of your business expansion.\nIf you are able to support a remote workforce, but you would like to save money on expanding to a new premises, why not try adopting a hybrid approach to the office?\nBy having some of your workers attend the office in person, and another portion of them work from home, you may be able to save money on having to purchase a larger premises when you make the expansion.\nMoreover, this can help you save money on the cost of utilities and allow those who feel uncomfortable returning to the office the chance to complete their duties remotely."
  },
  {
    "headline": "HOW I WAS ABLE TO FIGHT HEPATITIS B AND FATTY LIVER DISEASE DESPITE MY NEGLIGENCE AND IGNORANCE IN LESS THAN 2 MONTHS",
    "summarized_story": "HOW I WAS ABLE TO FIGHT HEPATITIS B AND FATTY LIVER DISEASE DESPITE MY NEGLIGENCE AND IGNORANCE IN LESS THAN 2 MONTHSGOOD NEWS; Hepatitis B Virus Has A Permanent Cure Now, If You Don’t See The Result In 3 Months , Your Money will Be Refunded Within 24 HoursAre you afflicted with any form of hepatitis?\nBelow is how i was able to fight Hepatitis B despite my negligence and ignorance.\n- Advertisement -100% Guaranteed Natural Herbal Cure For Hepatitis B AND Any Liver Problem (i.e Fatty Liver, Liver Cancer, Liver Cirrhosis etc.)\nThree key constituents of Norland Healthway Herbal Capsules are L-cys teine, Soy Iecithin and Pue raria Iobata Extract among others.\nSuch as vitamin B2, vitamin B6, foIic acid, vitamin B1, vitamin C, vitamin B12, vitamin E, vitamin K and so on."
  },
  {
    "headline": "6 documentaries on Showmax that are making headlines",
    "summarized_story": "- Advertisement -So, in the spirit of exploring new worlds (Silicon Valley, anyone?\n), examining our humanity, and solving decades-old crimes, we’ve rounded up six conversation-starting documentaries on Showmax that you won’t be able to stop talking about!\nThe Inventor: Out for Blood in Silicon Valley- Advertisement -How did the world’s youngest billionaire go from hero to zero in just two years?\nWatch it now »Subscribe to Showmax and save 50%Save up to 50% when you buy a Showmax 3, 6 or 12-month subscription.\nShowmax Mobile starts from NGN 2,499 for three months, and a standard Showmax subscription starts at NGN 5,999 for three months of streaming entertainment."
  },
  {
    "headline": "Anambra 2021: IGP says massive security deployment can affect turnout but is necessary",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaThe Inspector General of Police (IGP), Usman Alkali Baba, admitted on Thursday that the mass deployment of security personnel for the November 6 Anambra State governorship election may depress voter turnout, adding that the security measure was however necessary to forestall election interference and violence.\n‘While we are asking people to come out and vote, another group or other subversive elements are saying “don’t come.\nEnhancing intelligence sharing through strengthening inter-agency collaboration with the military and other security agencies is also an aspect that is being pursued.\n‘We have 1,845 armed robbery suspects arrested, 1,445 for crimes related to cultism, we have 1,183 murder suspects, for cybercrimes, we have also arrested 1,110 suspects.\n‘We have received interventions from the Central Bank of Nigeria (CBN), the Nigeria National Petroleum Corporation, (NNPC) and the Police Trust Fund (PTF)."
  },
  {
    "headline": "Anambra guber: 34,000 personnel, other necessary assets now in town – CP Echeng",
    "summarized_story": "From Obinna Odogwu, Awka and Aloysius Attah, OnitshaCommissioner of Police in Anambra State, CP Echeng Echeng, on Thursday, disclosed that 34,000 personnel and other necessary assets needed for the November 6 governorship poll in the state have arrived.\nEcheng, at a press briefing at the police command headquarters in Amawbia, said that all the necessary security gadgets from the IGP had arrived in the state.\nHe said that in the coming days, their presence would be felt in all the nooks and crannies of the state.\n“Assets and boots have been deployed to the state by the IGP.\n“We intend to dominate everywhere in this state and the dominance is to reassure the good people of Anambra that they’re secured."
  },
  {
    "headline": "BREAKING; Army Council meet to approve promotions of Colonels, others… to meet next week for one star generals",
    "summarized_story": "Molly Kilete, AbujaThe Army Council is currently meeting in Abuja to approve the promotion of officers in the ranks of Major, Lieutenant Colonels and Colonels in the Nigerian Army to their new ranks Daily Sun has gathered.\nIt was gathered that the the council is meeting after the successful completion of the interview board set up to interview the officers due for promotion presented the names of officers to be promoted to the Arjun authorities.\nMeanwhile officers in the ranks of Colonels and Brigadier Generals due for their promotion would end their interview with the promotion board today.\nOver one hundred officers due to be promoted to one and two stars generals have so far appeared before the board which began sitting nearby this week.\nThis is just as the Nigerian Navy and the Nigerian Air Force have concluded their promotion board interview for officers in the ranks of Captains Commodores, Group Captain and Air Commodores respectively."
  },
  {
    "headline": "BREAKING: Court of Appeal defers judgment on Uche Secondus vs PDP",
    "summarized_story": "The Court of Appeal, sitting in Port-Harcourt, the Rivers State capital, has deferred to Friday, judgement on Uche Secondus’ suit seeking the stoppage of the national convention of the Peoples Democratic Party, PDP.\nIt was learnt that the suspended National Chairman of the party, Prince Uche Secondus, is seeking the stoppage of the national convention scheduled for 30-31 October, 2021.\n100% Natural Herbs to Finally End Premature Ejaculation and Weak Erection.\nClick here ."
  },
  {
    "headline": "Breaking: Security takes over Plateau Assembly as 8 APC lawmakers plot to impeach Speaker",
    "summarized_story": "From Gyang Bere, JosTension mount at the Plateau State House of Assembly as six Lawmakers the under the All Progressives Congress (APC) out of the 24 members of the House make move to impeach the Speaker, Rt.\nThe security stormed the Assembly Complex as early as 5am on Thursday and block entrance into the House after APC members led by the Majority Leader, Daniel Nanlong and the Deputy Speaker, Saleh Yipmong into the Assembly complex.\nDaily Sun gathered that the six members who attempted to impeach the Speaker on Wednesday night were allegedly recruited more members with the aid of security operatives to carry out their mission.\nDalyop Fom said there is no how 8 out of the 24 members of the House can impeach Speaker of the House.\nHe noted that 8 members of the House storm the House of Assembly as early as 5am with the aid of security personnel with the aim of impeaching the Speaker, Hon."
  },
  {
    "headline": "Facebook Rebrands, Changes Name to Meta",
    "summarized_story": "The Mark Zuckerberg company will now be known as Meta, a nod to its future digital frontier Metaverse, a fusion of different digital worlds.\nLast year, Facebook rolled out two of its metaverse projects in beta: Horizon World, which allows users to invite friends into their digital world, and Horizon Workrooms, which does the same in professional settings.\nDuring a presentation from his home, the Facebook founder shared his vision which includes a digital world in which users will feel they are with one another even though they may be apart.\nWith the rebranding, Meta comes with a new logo designed like an infinity-shaped symbol.\nOther platforms of the company such as Instagram and WhatsApp will retain their names but will now come under the Meta brand."
  },
  {
    "headline": "Okonkwo Now FBN Holdings’ GMD as Eke Retires",
    "summarized_story": "FBN Holdings Plc has announced the appointment of Mr. Nnamdi Okonkwo as its Group Managing Director.\nThis followed the retirement of Mr. Urum Eke from the position, after a successful completion of his two-term tenure.\nA statement signed by the Company Secretary, Seye Kosoko, disclosed that Okonkwo, a former Managing Director of Fidelity Bank Plc, is to take over from Eke at the end of the current financial year, December 31, 2021.\nThe statement explained that: “Eke’s retirement follows from a 35 years’ career in financial services, strategy, auditing, consulting, taxation, process reengineering and capital market operations.”Details later….\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "P&ID Scam: Court Issues Arrest Warrant against Irish Man",
    "summarized_story": "A Federal High Court (FHC), Abuja, on Thursday, issued a warrant for the arrest of an Irish, Neil Murray, over his involvement in the alleged Process and Industrial Development Limited (P&ID) scandal.\nNAN also reported that Murray, an employee of P&ID, is also a director of Lurgi Consult Ltd, an associate company of P&ID.\nSanga, therefore, prayed the court for an order of warrant for the arrest of Murray for him to be brought before the court and face trial on the aforementioned criminal charge.\nThe EFCC lawyer also prayed the court to issue an arrest warrant against Nolan, following his absence in court.\nJustice Mohammed, who granted the prayer for issuance of arrest warrant on Murray, adjourned the matter until January 25, 2022, for trial continuation."
  },
  {
    "headline": "124 Years after, Cambridge University Hands over Benin Bronze Cockerel to Nigeria",
    "summarized_story": "London-based Daily Mail reported that the sculpture of a cockerel was one of hundreds of Benin Bronzes pillaged from the Kingdom of Benin, in Nigeria.\nThe college’s Legacy of Slavery Working Party concluded in 2019 that the cockerel “belongs with the current Oba at the Court of Benin”.\n“For the cockerel, I must give credit to our young students at Cambridge University.\nThe British Museum had spoken about “opportunities for sharing and displaying” items from its collection in Nigeria, but had never said it would transfer ownership.\nThe Oba of Benin is head of the historic Eweka dynasty of the Benin Empire based in Benin City in modern-day Nigeria."
  },
  {
    "headline": "NNPC to Reconstruct 21 Critical Federal Roads, Projects to Gulp N621.2bn",
    "summarized_story": "This is just as the NNPC has said deregulation of petroleum sector would enable the country save the N12 trillion being spent on subsidy payment in the next four years.\nAccording to him, the intervention by the NNPC was a strategic move under the federal government’s Road Infrastructure and Refreshment Tax Credit Scheme.\nFashola further explained that the second memorandum had to do with the road infrastructure tax credit scheme.\nSo NNPC has identified 21 roads that it wants to deploy.\nAccording to him, the “NNPC sought and council has approved today that NNPC deployed tax resources to 21 roads covering the total distance of 1,804.6 kilometers across the six geopolitical zones."
  },
  {
    "headline": "EXCLUSIVE: Buhari Escapes Air Crash As Presidential Jet Develops Fault, Aircraft Taken To Germany For Repairs At N2.4Million Per Night For Parking",
    "summarized_story": "President Muhammadu Buhari and the delegation that recently travelled with him to the United States escaped an air mishap after the presidential jet marked 5N-FGT suddenly developed a fault while they were returning to Nigeria, SaharaReporters has gathered.\nFrom Santa Maria, it flew to Nigeria and landed at the Nnamdi Azikiwe International Airport, Abuja on Sunday, September 26 at 5:01 am.\nIt left MMIA at 7.58 pm and was later seen near Minna, Niger State at 8.32 pm.\nThen, it was seen near Media at 11.00 pm +03 and later at King Abdulaziz International Airport in Jeddah at 11.47 pm +03.\nIn 2017, the cost of maintenance of the presidential aircraft rose to N4.37 billion (19.6 per cent)."
  },
  {
    "headline": "EXCLUSIVE: Buhari Escapes Air Crash As Presidential Jet Develops Fault, Aircraft Taken To Germany For Repairs At N2.4Million Per Night For Parking",
    "summarized_story": "President Muhammadu Buhari and the delegation that recently travelled with him to the United States escaped an air mishap after the presidential jet marked 5N-FGT suddenly developed a fault while they were returning to Nigeria, SaharaReporters has gathered.\nFrom Santa Maria, it flew to Nigeria and landed at the Nnamdi Azikiwe International Airport, Abuja on Sunday, September 26 at 5:01 am.\nIt left MMIA at 7.58 pm and was later seen near Minna, Niger State at 8.32 pm.\nThen, it was seen near Media at 11.00 pm +03 and later at King Abdulaziz International Airport in Jeddah at 11.47 pm +03.\nIn 2017, the cost of maintenance of the presidential aircraft rose to N4.37 billion (19.6 per cent)."
  },
  {
    "headline": "Dunamis Church Guard Stabbed By Hoodlums Dies After Failed Surgery, Church Denies Report",
    "summarized_story": "A security guard with Dunamis International Gospel Centre in Bwari, Abuja who was stabbed in the stomach by armed robbers has died from serious complications.\nThe victim, John Yahaya was said to be on duty when about 10 armed robbers invaded the church on Monday, October 4 and while resisting them, he was stabbed in the stomach.\nOn the day he was stabbed, he was to collect the invitation cards for his wedding from the printer.\nIf our security guard could be stabbed and no arrest made, then, who is safe?\nMeanwhile, the Founder of Dunamis Church, Paul Enenche, in a live telecast debunked the claim there was an attack on the church."
  },
  {
    "headline": "Dunamis Church Guard Stabbed By Hoodlums Dies After Failed Surgery, Church Denies Report",
    "summarized_story": "A security guard with Dunamis International Gospel Centre in Bwari, Abuja who was stabbed in the stomach by armed robbers has died from serious complications.\nThe victim, John Yahaya was said to be on duty when about 10 armed robbers invaded the church on Monday, October 4 and while resisting them, he was stabbed in the stomach.\nOn the day he was stabbed, he was to collect the invitation cards for his wedding from the printer.\nIf our security guard could be stabbed and no arrest made, then, who is safe?\nMeanwhile, the Founder of Dunamis Church, Paul Enenche, in a live telecast debunked the claim there was an attack on the church."
  },
  {
    "headline": "BREAKING: Facebook Founder Announces Change Of Company's Name To Meta",
    "summarized_story": "Facebook founder, Mark Zuckerberg has announced a change in the parent company’s name to “Meta” to represent a future beyond just its troubled social network.\nHe, however, stated that Facebook, Instagram and WhatsApp will keep their names under the rebranding.\n“The next platform will be even more immersive — an embodied internet where you’re in the experience, not just looking at it.\n“Think about how many physical things you have today that could just be holograms in the future.\nWe believe the metaverse can enable better social experiences than anything that exists today, and we will dedicate our energy to helping achieve its potential."
  },
  {
    "headline": "I haven't received formal request for extradition of DCP Kyari, says IGP",
    "summarized_story": "Usman Baba, inspector-general of police (IGP), says the police is yet to receive a formal request for the extradition of Abba Kyari, suspended deputy commissioner of police.\nAdvertisementSpeaking at a media briefing on Thursday, Baba said the police has, however, received feedback on the legal advice requested from Abubakar Malami, attorney-general of the federation.\nIn September, Muhammad Dingyadi, minister of police affairs, had said the panel report on Kyari had been submitted to Malami.\nSpeaking on the development, Baba said the police had received the AGF’s legal advice, adding that he hasn’t received any formal request for Kyari’s extradition to the US over the allegations.\nAdvertisement“I have read it from the social media that there was an extradition request."
  },
  {
    "headline": "I haven't received formal request for extradition of DCP Kyari, says IGP",
    "summarized_story": "Usman Baba, inspector-general of police (IGP), says the police is yet to receive a formal request for the extradition of Abba Kyari, suspended deputy commissioner of police.\nAdvertisementSpeaking at a media briefing on Thursday, Baba said the police has, however, received feedback on the legal advice requested from Abubakar Malami, attorney-general of the federation.\nIn September, Muhammad Dingyadi, minister of police affairs, had said the panel report on Kyari had been submitted to Malami.\nSpeaking on the development, Baba said the police had received the AGF’s legal advice, adding that he hasn’t received any formal request for Kyari’s extradition to the US over the allegations.\nAdvertisement“I have read it from the social media that there was an extradition request."
  },
  {
    "headline": "Soyinka: Nigeria is in a mess... it's disintegrating before our very eyes",
    "summarized_story": "Wole Soyinka, Nobel laureate, says Nigeria is “in a mess”.\nSoyinka, who said the present administration doesn’t appear to have a grasp of solutions to the country’s challenges, said Nigerians need to embrace unity to foster true development.\nDoctors, workers, students, market people and the last time, the oil workers, they’ve all got up and said ‘no’.\nFrom time to time, we have a section of the nation come together and say ‘enough; we’re human beings; we will not be treated like beasts’.\nIs it really about COVID prevention or is it to gather information on Nigerians in a covert way utilising the COVID requirements?” he asked“It’s unnecessary."
  },
  {
    "headline": "Soyinka: Nigeria is in a mess... it's disintegrating before our very eyes",
    "summarized_story": "Wole Soyinka, Nobel laureate, says Nigeria is “in a mess”.\nSoyinka, who said the present administration doesn’t appear to have a grasp of solutions to the country’s challenges, said Nigerians need to embrace unity to foster true development.\nDoctors, workers, students, market people and the last time, the oil workers, they’ve all got up and said ‘no’.\nFrom time to time, we have a section of the nation come together and say ‘enough; we’re human beings; we will not be treated like beasts’.\nIs it really about COVID prevention or is it to gather information on Nigerians in a covert way utilising the COVID requirements?” he asked“It’s unnecessary."
  },
  {
    "headline": "ICPC: How we recovered 301 houses from two public officials in Abuja",
    "summarized_story": "The Independent Corrupt Practices and Other Related Offences Commission (ICPC) says it recovered 301 “illegally acquired” houses from two public officials in the federal capital territory (FCT).\nAdvertisementBolaji Owasanoye, ICPC chairman, disclosed this on Thursday at an investigative hearing organised by the house of representatives ad hoc committee on the operations of real estate developers in the federal capital territory (FCT).\nSpeaking at the event, Owasanoye said the commission has received several petitions on sharp practices in the industry.\n“Corrupt public officers use real estate investment as a vehicle for hiding ill-gotten wealth and money laundering.\nAdvertisement“The commission has, for example, a case in which 241 houses were recovered from a public officer and another one in which we recovered 60 buildings on a large expanse of land from a public officer”."
  },
  {
    "headline": "Beyond investing in African startups, Kepple Africa Ventures is creating new industries",
    "summarized_story": "Afterwards, he returned to Africa as a general partner at Kepple Africa Ventures.\nI knew I had to be a part of it.”Daniel Adeyemi: How did Kepple Africa Ventures start?\nThis provided Kepple with access to a network of investors to raise $18 million for Kepple Africa Ventures.\nRyosuke Yamawaki handles investing in East and Southern African startups while I focus on investing in West and North African startups.\nDA: Talking about Japanese investors, are there any other Japanese investors in Africa?"
  },
  {
    "headline": "eNaira: How to use Nigeria’s central bank digital currency",
    "summarized_story": "Nigeria became the first country in Africa to launch a central bank digital currency (CBDC) this week after President Muhammadu Buhari unveiled the eNaira at the State House in Abuja, the nation’s capital.\nIssued by the Central Bank of Nigeria (CBN), the digital currency is built on a private blockchain technology developed by Bitt Inc and has the same value as the fiat or physical currency.\nThe new currency can be accessed and used via the eNaira wallet (named “Speed”), a digital storage held and managed on a distributed ledger.\neNaira use casesFinancial institutions are responsible for onboarding their customers and integrating the eNaira wallet feature into their digital banking channels.\nThe digital currency could also bring a significant majority of Nigerians without bank accounts into the formal financial economy."
  },
  {
    "headline": "Building a food supply operating system: the Vendease story",
    "summarized_story": "There are a lot of fragmented moving parts in running procurement for businesses in Africa, especially small food businesses.\nFood businesses are mostly vulnerable to substandard goods, fluctuating pricing system, expensive middlemen, wastage of productive time while restocking, and unreliable logistics.\nThey all vented and, as usual, discussed the problem for a while, asking what if they could do something to help small food businesses like this to scale.\nPivoting into a more sustainable systemThe initial idea was simple: enable food businesses to get their regular supply at the quality and price they wanted.\nVendease doesn’t just allow food businesses place orders for food supplies and track them; they can also manage inventory, track expenses and gain access to credit facilities."
  },
  {
    "headline": "Africa eShop, DHL’s online retail service, is shutting down this month",
    "summarized_story": "After two years of operation, DHL Africa is shutting down its pan-African online retail platform, e-Shop, at the end of the month.\nSorry for any inconvenience this may have caused,” a message on the Africa eShop website reads.\nTechCabal reached out to DHL Africa for answers but has yet to receive a response at the time of publication.\n— DHL Africa (@DHLAfrica) October 21, 2021A white-labeled productWhile the Africa eShop appears to be a standalone e-commerce platform owned by DHL, that isn’t the case.\nBeing a white-labeled product, DHL’s Africa eShop website and offerings are very similar to that of MallforAfrica."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Techpoint Africa is now over six years old, and it has witnessed and documented major events in Africa’s startup..."
  },
  {
    "headline": "Early Access: Interview with ReelFruit founder, Affiong Williams",
    "summarized_story": "But then, it took her five years to build her first factory, and nine years in total to the Series A.Affiong Williams, founder and CEO, ReelFruit.\nThese and many more I sought to find out during a recent interview with Affiong Williams at the ReelFruit HQ in Lagos, Nigeria.\nIn this inspiring interview, Affiong Williams shares her motivations, inspirations, ambitions, entrepreneurial lessons, and tips on how to achieve a work-life balance while running a global company.\nWatch full interview or continue below for summarised text versionThe full interview will go live on Tuesday November 2, 2021 at noon.\nWatch it today on Early Access by joining our membership programme Join now Already a member?"
  },
  {
    "headline": "Stitch’s Nigeria expansion, Africa’s military coups, RecoMed’s $1.5m funding, and Union45’s $3m seed",
    "summarized_story": "Source: Supplied,South African API fintech startup, Stitch has today announced its expansion into Nigeria and a $2M seed extension, with investment from Future Africa and Norrsken Foundation, among others.\nStitch announced an initial $4 million seed in February when it came out of stealth.\nThe startup launched officially in February 2021 with an API that provides software companies with identity verification tools and access to users’ financial data.\nWhile fintech startups still get a significant chunk of African funding, healthtech startups seem to be attracting some serious cash.\nApply hereCall for climate-focused startups: Africa ClimAccelerator Applications open."
  },
  {
    "headline": "Naira’s digitisation via the eNaira: Beyond financial inclusion",
    "summarized_story": "Share this article:Introduction: Naira’s digitisation (the eNaira)A very recent accomplishment of the Central Bank of Nigeria (CBN) is the issuance of the new Central Bank Digital Currency (CBDC), the eNaira.\nConsequently, financial institutions have the responsibility to onboard their customers and integrate the eNaira wallet feature into their digital banking channels.\nIt is hoped that the design model behind the eNaira can permit coordination amongst peers once mCBDCs models become operational.\nAs already stated, the DLT solution for cross-border and FX funds transfer has huge potentials for simplifying cross-border payment with great savings on time and money.\nConclusionNigeria has taken another bold step towards trade finance digitisation by introducing the eNaira; however, the journey has just begun."
  },
  {
    "headline": "No FX for barite as FG to ban import",
    "summarized_story": "The Federal Government will soon place a ban on further importation of barite, a move that would save $300 million every year in foreign exchange (FX).\nThis is as 12 barite processors have been found worthy to produce world-class barite that meets American Petroleum Institute’s (API) standards.\nHe said the FG would slam the ban in 2022, but he did not mention the specific date.\nHe said Nigerian barite hub is being created for easy coordination with what he called Open Market System.\nHe said, “Soon, importation of Barite into Nigeria will stop because the processes that lead to such a policy are in progress.”"
  },
  {
    "headline": "Hassan-Odukale built First Bank majority stake in less than a year",
    "summarized_story": "Tunde Hassan-Odukale, through direct and indirect shares, built a majority shareholding in FBN Holdings plc (FBNH), to gain controlling stake in the financial holding company this year, according to data analysed by BusinessDay.\nAn analysis of First Bank’s annual report shows that Hassan-Odukale’s direct stake in FBN Holdings was 8,854,003 units while his indirect stake was 360,961,091 units as at the end of 2020.\nData gleaned from the letter show that the direct and indirect shares of Hassan-Odukale in the bank now total 1.9 billion units.\nHis indirect holding through Haskal Holdings Limited is 13,229,148 units or 0.04percent; while his indirect holding through Leadway Capital &Trust Limited is 1,004,528 units.\nGTI has set a target price (TP) of N15.20 for FBN Holdings, which represents an upside potential of 24.08percent."
  },
  {
    "headline": "Private funds in fresh bid to reverse Nigeria’s $1.5bn medical tourism",
    "summarized_story": "Investors are increasingly taking rare bets on Nigeria’s healthcare sector as they eye a slice of the estimated $1.5 billion spent on medical tourism abroad yearly.\nRead Also: A stitch in time for investment in Nigeria’s healthcare sectorNigeria’s healthcare sectorIndia alone accounts for more than half of $1.5 billion that Nigeria loses yearly to purchasing medical services overseas, according to the Nigerian Medical Association (NMA).\nYemi Osinbajo, Nigeria’s vice-president said highly invested hospitals such as Duchess could create an attractive proposition to reverse brain drain based on the opportunities offered.\nThe 110-bed hospital, fully-equipped facility in the Lagos State capital, Ikeja, is arguably Nigeria’s first private multi-specialty hospital on Lagos Mainland.\nDespite a population growth rate of 3.2 percent annually, estimated to reach 400 million by 2050, Nigeria’s healthcare spending hovers around 3.75 percent instead of 15 percent."
  },
  {
    "headline": "Obaseki charges tertiary institutions on alternative sources of funding – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… As Edo First Lady, three others bag honorary fellowshipBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has urged tertiary institutions in the state to explore alternative sources of funding to ensure the viability of the higher institutions and address the issue of paucity of funds.\nObaseki gave the charge while delivering his speech at the 3rd and 4th Convocation Ceremony of the Edo State Polytechnic, held at the school’s main auditorium in Usen, Ovia North East Local Government Area of Edo State.\nThe convocation ceremony also featured the conferment of honourary fellowship awards on four Nigerians, including the Edo State First Lady, Mrs. Betsy Obaseki, for their contribution to the development of the state and the country.\nOur tertiary institutions must promote and encourage scholarship, entrepreneurship and produce skilled manpower relevant to the needs of the labour market.\nThe country needs Edo State for its development.”In his convocation speech, the rector of the polytechnic, Prof. Abiodun Falodun commended the governor for his commitment, focus and determination in repositioning the institution."
  },
  {
    "headline": "Troops deactivate 27 illegal refining sites in Niger Delta – DHQ – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestTroops of Operation Delta Safe have deactivated a total of 27 illegal refining sites across Niger Delta region, in the last two weeks.\nOnyeuko said the illegal refining sites had 57 ovens, 17 cooking pots/boilers, two cooling systems, 37 reservoirs, nine large dugout pits and 27 storage tanks, drums and sacks laden with illegally refined oil products.\nHe added that nine suspects were arrested while one dane gun, among other items were recovered in the course of the operations.\n“Also, five criminals associated with pipeline vandalism, piracy, illegal oil bunkering and armed robbery were arrested within the period.\n“Troops of Operation Delta Safe have remained steadfast in the execution of land, maritime and air operations in the South-South Zone, to forestall activities of economic saboteurs and other criminal elements,” he said."
  },
  {
    "headline": "FG spends N4.5bn to feed 228,646 Gombe pupils in 5 yrs – NSIP – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestGOMBE – The Federal Government has spent N4.5 billion to feed 228,646 pupils in Gombe State since the school feeding programme started in 2016.\nDr Umar Bandir, National Coordinator of the National Social Investment Programme (NSIP), made the declaration in Gombe on Thursday while donating 225,000 branded plates to Gombe State government for the programme.\nBandir said 1,234 schools in Gombe State had benefitted since the programme began.\nThe NSIP coordinator reiterated that while the Federal Government provided funds for the programme, state governments had the responsibility of ensuring its smooth implementation.\nResponding, Secretary to Gombe State government, Abubakar Njodi, assured that the donation would be used judiciously."
  },
  {
    "headline": "ASUU presents N100,000 to best indigent student – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBAUCHI – The Academic Staff Union of Universities (ASUU) has presented N100,000 to the best indigent student of Abubakar Tafawa Balewa University (ATBU), Bauchi on Thursday.\nThe News Agency of Nigeria (NAN) reports that the student, Miss Iqmat Popoola, is a 300-level student of Agricultural Economics.\n“The Academic Staff Union of Universities about three years ago introduced indigent scholarship where N100,000 is given to such a student and we pick one student from each of the universities that are members of ASUU.\nIn his address, ASUU Bauchi Zonal Coordinator, Prof. Lawan Abubakar, explained that the national secretariat of ASUU is sponsoring an indigent student from each of six universities that make up the Bauchi zone.\nHe further explained that ATBU, Bauchi, is sponsoring three other indigent students with the same amount, University of Jos is sponsoring five students."
  },
  {
    "headline": "PDP governors woo Mimiko back to party",
    "summarized_story": "The Chairman, Peoples Democratic Party (PDP) Governor’s Forum, Aminu Tambuwal, said he, along with three other governors, were in Ondo State to woo Olusegun Mimiko, a former governor of the state, back to the party.\nMr Tambuwal, the Sokoto State Governor led Governors Nyesom Wike (Rivers), Seyi Makinde (Oyo) and Okezie Ikpeazu (Abia) on the visit to meet Mr Mimiko.\nAccording to him, the visit is on the directive of the party to embark on a trip to historic town of Ondo to woo Mr Mimiko back to his family.\n“The essence is for rebuilding the party toward ensuring that PDP is back to power in 2023,” Mr Tambuwal said.\nMr Mimiko had been a member of the Alliance for Democracy, PDP, Labour Party and Zenith Labour Party."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Former Ondo governor, Olusegun Mimiko rejoins PDP",
    "summarized_story": "Dr Olusegun Mimiko, former Ondo State governor, has rejoined the Peoples Democratic Party (PDP).\nHe made the decision following a visit to him by PDP governors, including Sokoto State governor, Aminu Tanbuwal; Oyo state governor, Seyi Makinde; Rivers State governor, Nyesom Wike and Abia State governor, Okezie Ikpeazu on Wednesday.\n“The stakeholders meeting was called to discuss the meeting with the PDP governors and intimate members with the outcomes of series of interactions with PDP leaders on the invitation extended to him.\nEarlier, after about an hour closed door meeting with Mimiko, governor Tambuwal said “we are here in the beautiful of Ondo Town, in Ondo state the home of our leader, and brother, Dr Olusegun Mimiko, former governor of Ondo state to re-invite him back to his family, his political family, PDP and work towards rescuing Nigeria.\nAccording to him “We have listened to them and going to have our stakeholders meeting and ultimately it’s the people, the stakeholders that will decide."
  },
  {
    "headline": "Facebook rebrands, names itself Meta to emphasize ‘metaverse’ vision NEW",
    "summarized_story": "Facebook CEO, Mark Zuckerberg, has said his company is rebranding itself as Meta.\nThe move comes as an effort to encompass its virtual-reality vision for the future.\nExperts point out that it also appears to be an attempt to change the subject from the Facebook Papers, a document trove that has revealed the ways Facebook ignored internal reports and warnings of the harms its social network created or magnified across the world."
  },
  {
    "headline": "Union Bank’s Q3’21 gross earnings hit N121.8bn",
    "summarized_story": "BY EMEKA EJEREUnion Bank Plc, has reported N121.8bn gross earnings for the third quarter ended 30th September, 2021, representing 3% increase from N118.8bn recorded in the same period of 2020.\nAccording to its unaudited financial statements filed at the Nigerian Exchange Limited (NGX) on Thursday, the lender’s non-interest income rose by 26% to N42bn from N33.4bn in the corresponding period last year.\nProfit before tax (PAT) was, however, relatively flat at N16bn compared to 15.9bn it was in 2020, even as net operating income after impairments increased by 3% to N71.2bn from 69.3bn, driven by stronger non-interest income.\n“Consequently, our deposit base is up 14% to ₦1.3 trillion, and our loan book has expanded by 16% to ₦855.7 billion driven by our compelling campaigns, new product offerings and effective sales channels.\n“During the period, non-interest income increased by 26% to ₦42 billion, driven by stronger net fee and commissions which gained 44% to ₦10.3 billion from ₦7.2 billion and recoveries which grew by 163% to ₦13 billion from ₦4.9 billion."
  },
  {
    "headline": "FBN Holdings names Nnamdi Okonkwo, ex Fidelity Bank boss as GMD, to replace UK Eke",
    "summarized_story": "OBINNA EZUGWUThe board of FBN Holdings Plc, has approved the appointment of Mr. Nnamdi Okonkwo, as its new Group Managing Director, with effect from January 1, 2022.\nOkonkwo was the immediate past Managing Director of Fidelity Bank Plc, and replaces UK Eke, who completes his two-year tenure on December 31, 2021.\nIt also approved the appointment of Mrs Tope Omage, as non-Executive Director in First Bank of Nigeria Ltd., subject to the approval of the CBN.\nThe board approved the renewal of the appointments of Dr Adesola Adeduntan and Mr Gbenga Shobo as the Managing Director and Deputy Managing Director of First Bank of Nigeria Ltd., for another term.\n“The board approved the renewal of the appointments of Mr Kayode Akinkugbe and Mr Taiwo Okeowo as the Managing Director and Deputy Managing Director of FBNQuest Merchant Bank Ltd respectively, for another term,” the statement said."
  },
  {
    "headline": "Facebook Rebrands, Changes Name To ‘Meta’",
    "summarized_story": "Facebook has changed its name to “Meta” in a shift away from social media and towards developing “the metaverse,” a digital world that could be the next generation of the internet.\nSocial media giant Facebook is changing its name to “Meta” as part of a rebrand meant to highlight the company’s new focus on developing “the metaverse.”“From now on, we’re going to be metaverse first, not Facebook first,” CEO Mark Zuckerberg said Thursday.\nHe has said he expects people will one day know Facebook as a “metaverse company” more than a social network.\nSocial media giant Facebook is changing its name to “Meta” as part of a rebrand meant to highlight the company’s new focus on developing “the metaverse.”“From now on, we’re going to be metaverse first, not Facebook first,” CEO Mark Zuckerberg said Thursday.\nHe has said he expects people will one day know Facebook as a “metaverse company” more than a social network."
  },
  {
    "headline": "Facebook Rebrands, Changes Name To ‘Meta’",
    "summarized_story": "Facebook has changed its name to “Meta” in a shift away from social media and towards developing “the metaverse,” a digital world that could be the next generation of the internet.\nSocial media giant Facebook is changing its name to “Meta” as part of a rebrand meant to highlight the company’s new focus on developing “the metaverse.”“From now on, we’re going to be metaverse first, not Facebook first,” CEO Mark Zuckerberg said Thursday.\nHe has said he expects people will one day know Facebook as a “metaverse company” more than a social network.\nSocial media giant Facebook is changing its name to “Meta” as part of a rebrand meant to highlight the company’s new focus on developing “the metaverse.”“From now on, we’re going to be metaverse first, not Facebook first,” CEO Mark Zuckerberg said Thursday.\nHe has said he expects people will one day know Facebook as a “metaverse company” more than a social network."
  },
  {
    "headline": "Ex-Transportation Minister, Bio, Dumps APC, Rejoins PDP",
    "summarized_story": "Ibrahim Isa Bio, has defected from the ruling All Progressives Congress (APC) and rejoined the Peoples Democratic Party (PDP).\nBio, a former member of the House of Representatives and ex-Speaker of Kwara State House of Assembly, formally joined the PDP on Thursday.\nThe news of Bio’s decampment to the PDP was received with excitement by the party members and leaders in the state.\nAshaolu thanked Bio “for taking the bold and timely decision to join the party.”ADVERTISEMENTHe added: “We are pleased to welcome former Minister Ibrahim Isa Bio and his followers into the Kwara PDP family.\n“The repositioned Kwara PDP is poised to reclaim power from the APC and deliver good governance to the people of Kwara."
  },
  {
    "headline": "Ex-Transportation Minister, Bio, Dumps APC, Rejoins PDP",
    "summarized_story": "Ibrahim Isa Bio, has defected from the ruling All Progressives Congress (APC) and rejoined the Peoples Democratic Party (PDP).\nBio, a former member of the House of Representatives and ex-Speaker of Kwara State House of Assembly, formally joined the PDP on Thursday.\nThe news of Bio’s decampment to the PDP was received with excitement by the party members and leaders in the state.\nAshaolu thanked Bio “for taking the bold and timely decision to join the party.”ADVERTISEMENTHe added: “We are pleased to welcome former Minister Ibrahim Isa Bio and his followers into the Kwara PDP family.\n“The repositioned Kwara PDP is poised to reclaim power from the APC and deliver good governance to the people of Kwara."
  },
  {
    "headline": "Ibrahim Assumes Duty As Customs Zone C FOU Boss",
    "summarized_story": "Ali Ibrahim has assumed duty as new comptroller of the Nigeria Customs Service (NCS), Federal Operations Unit, Zone ‘C’ (FOUC) Owerri, Imo State, covering parts of the South East and South South zones.\nSpeaking while addressing his principal Officers in Owerri, Ibrahim, who congratulated his predecessor, Yusuf Lawal, on his successful retirement prayed God’s blessings in his future endeavours.\nHe urged his officers to maintain status quo by making sure they record monumental seizures and raise maximum DN.\nHe called on officers and men of FOUC to fully cooperate for best results while, assuring of commitment to their welfare.\nThe event was attended by men and officers in attendance from various units and outstations under the zone."
  },
  {
    "headline": "BAKARE, OLOKETUYI, OBEY, KSA, MOMODU, ADESINA, ABATI, OKOROJI, OTHERS HEADLINE FAJ@60 CELEBRATION",
    "summarized_story": "By FOLA ADEMOSUPastor (Dr.) Tunde Bakare (formerly of the Latter Rain Assembly); Mr. Segun Oloketuyi (former bank MD); Ovation International publisher, Aare Dele Momodu; presidential adviser, Mr. Femi Adesina; and veteran journalist, Dr. Reuben Abati are among dignitaries invited to the October 30th Diamond birthday celebration of Mr. Femi Akintunde-Johnson (also known as FAJ).\nThe event will be chaired by Mr. Segun Oloketuyi (the immediate past Managing Director/CEO of Wema Bank, who led its successful restructuring between 2009 and 2018).\nAmong the special guests of honour are Presidential media adviser, Mr. Femi Adesina; federal lawmaker, Hon.\nThe event takes place on Zoom (Online ‘Event Centre’), at 4.30pm prompt, and it is strictly by invitation, via one-touch registration.\nMoreover, FAJ masterminded the establishment of four of Nigeria’s most celebrated awards: FAME Music Awards (FMA), The Movie Awards (THEMA), The Reel Awards, and Awards For Musical Excellence in Nigeria, (AMEN)."
  },
  {
    "headline": "BAKARE, OLOKETUYI, OBEY, KSA, MOMODU, ADESINA, ABATI, OKOROJI, OTHERS HEADLINE FAJ@60 CELEBRATION",
    "summarized_story": "By FOLA ADEMOSUPastor (Dr.) Tunde Bakare (formerly of the Latter Rain Assembly); Mr. Segun Oloketuyi (former bank MD); Ovation International publisher, Aare Dele Momodu; presidential adviser, Mr. Femi Adesina; and veteran journalist, Dr. Reuben Abati are among dignitaries invited to the October 30th Diamond birthday celebration of Mr. Femi Akintunde-Johnson (also known as FAJ).\nThe event will be chaired by Mr. Segun Oloketuyi (the immediate past Managing Director/CEO of Wema Bank, who led its successful restructuring between 2009 and 2018).\nAmong the special guests of honour are Presidential media adviser, Mr. Femi Adesina; federal lawmaker, Hon.\nThe event takes place on Zoom (Online ‘Event Centre’), at 4.30pm prompt, and it is strictly by invitation, via one-touch registration.\nMoreover, FAJ masterminded the establishment of four of Nigeria’s most celebrated awards: FAME Music Awards (FMA), The Movie Awards (THEMA), The Reel Awards, and Awards For Musical Excellence in Nigeria, (AMEN)."
  },
  {
    "headline": "Facebook changes parent company name to ‘Meta’",
    "summarized_story": "Facebook chief Mark Zuckerberg on Thursday announced the parent company’s name is being changed to “Meta” to represent a future beyond just its troubled social network.\n“I am proud to announce that starting today, our company is now Meta.\nFacebook critics pounced last week on a report that leaked the rebranding plans, arguing the company was aiming to distract from recent scandals and controversy.\nFacebook has just announced plans to hire 10,000 people in the European Union to build the “metaverse,” with Zuckerberg emerging as a leading promoter of the concept.\nFacebook has been hit by major crises previously, but the current view behind the curtain of the insular company has fueled a frenzy of scathing reports and scrutiny from US regulators."
  },
  {
    "headline": "Facebook changes parent company name to ‘Meta’",
    "summarized_story": "Facebook chief Mark Zuckerberg on Thursday announced the parent company’s name is being changed to “Meta” to represent a future beyond just its troubled social network.\n“I am proud to announce that starting today, our company is now Meta.\nFacebook critics pounced last week on a report that leaked the rebranding plans, arguing the company was aiming to distract from recent scandals and controversy.\nFacebook has just announced plans to hire 10,000 people in the European Union to build the “metaverse,” with Zuckerberg emerging as a leading promoter of the concept.\nFacebook has been hit by major crises previously, but the current view behind the curtain of the insular company has fueled a frenzy of scathing reports and scrutiny from US regulators."
  },
  {
    "headline": "Zuckerberg rebrands Facebook Inc. as Meta",
    "summarized_story": "Facebook Inc CEO Mark Zuckerberg said on Thursday that the company has been rebranded as Meta, a name change that comes as it battles criticisms from lawmakers and regulators.\nZuckerberg has increasingly been promoting the idea of Facebook, which has invested heavily in augmented and virtual reality, as a “metaverse” company rather than a social media one.\nFacebook also said it would introduce a way for Oculus Quest users to use different 2D apps like Slack, Dropbox and Facebook while in this “Horizon Home” VR space.\nFacebook also said it would run a $150 million education program aimed at helping AR and VR creators and developers.\nIn the latest controversy, whistleblower and former Facebook employee Frances Haugen leaked documents which she said showed the company chose profit over user safety."
  },
  {
    "headline": "Five Kano students die in road crash, Ganduje mourns",
    "summarized_story": "Abdullahi Ganduje of Kano State has expressed shock over the death of five students in a ghastly auto accident on Kano-Katsina road.\nGanduje, who spoke through his Chief Press Secretary, Mr Abba Anwar, in a statement on Thursday, in Kano, said:“We were shocked over the death of our children, the five students who died in an auto crash on their way to Katsina state for zonal students’ meeting.\n“The first four were from Sa’adatu Rimi College of Education, Kumbotso, while the fifth person was from the Federal College of Education, Kano,” he said.\nAnwar quoted Ganduje as saying: “This is a tragedy for the state and the nation in general.\nGanduje condoled with their families, the Sa’adatu Rimi College of Education, Kumbotso, the Federal College of Education, Kano, and all students, over the tragic incident."
  },
  {
    "headline": "BREAKING: Unknown Gunmen In Military Uniforms Reportedly Storm TASUED, Kidnap SU President, Others",
    "summarized_story": "There is currently tension in the Ijebu-Ode are of Ogun State as students of Tai Solarin University of Education (TASUED), have taken to the streets to protest.\nIt was gathered that the cause of the protest is as a result of an invasion by unknown gunmen in military uniforms who allegedly stormed the school premises this evening and abducted students including the Students’ Union President (SUP).\nAccording to a source, “We don’t know who these people are but they wore military uniforms.\nThey stormed the school and abducted students.\nWe don’t know where they took them to."
  },
  {
    "headline": "BREAKING: Facebook Changes Name To Meta",
    "summarized_story": "Facebook chief Mark Zuckerberg on Thursday announced the parent company’s name is being changed to “Meta” to represent a future beyond just its troubled social network.\n“We’ve learned a lot from struggling with social issues and living under closed platforms, and now it is time to take everything that we’ve learned and help build the next chapter,” Zuckerberg said during an annual developers conference.\n“Our apps and their brands, they are not changing,” he added.\nDetails later…"
  },
  {
    "headline": "Buhari Government Approves N21billion Budget For 14-Bed Presidential Clinic",
    "summarized_story": "President Muhammadu Buhari ordered the construction and outfitting of a 14-bed Presidential Clinic at a cost of N21 billion, according to the Permanent Secretary of the State House, Umar Tijjani.\nHe explained that the VIP clinic was built by Messrs Julius Berger Nigeria, a construction company.\nHe stated that actual construction will begin on November 1, 2021, and the building would be completed on December 31, 2022.\nThe Presidential Clinic, according to the Permanent Secretary, would have 14 beds and a total size of 2,700 square meters.\nHe went on to say that the clinic would have a laboratory, healing garden, pharmacy, and X-ray facility."
  },
  {
    "headline": "BREAKING: CAN Opposes Christian-Christian, Muslim-Muslim Presidential Ticket In 2023",
    "summarized_story": "In 2023, the Christian Association of Nigeria (CAN) has warned political parties to abandon any notion of Christian/Christian or Muslim/Muslim presidential tickets.\nWhen CAN leadership met with Deputy Senate President Ovie Omo-Agege in the National Assembly on Thursday, President Samson Ayokunle addressed.\nAs election season approaches, Ayokunle advised politicians not to inflame the public with their statements.\nAyokunle asked them to keep in mind that there is already a lot of anxiety in Nigeria owing to insecurity.\nWe don’t want Christian/Christian ticket nor Muslim/Muslim ticket”, he said."
  },
  {
    "headline": "Happening now: Tambuwal, Wike, other PDP governors meet Mimiko in Ondo",
    "summarized_story": "Some governors elected on the platform of Peoples Democratic Party (PDP) are currently meeting with a former governor of Ondo state Olusegun Mimiko.\nThe meeting is taking place at the country home of Mimiko in Ondo state.\nThe governors at the meeting include Seyi Makinde, Nyesom Wike, Aminu Tambuwal and Onyechi Ikpeazu of Oyo, Rivers Sokoto, Abia states respectively.\nMimiko who is expected to return to PDP with other political bigwigs from his state, will officially announce his intention after the meeting.\nDetails loading…"
  },
  {
    "headline": "Breaking: Plateau assembly impeaches speaker, Sanda takes over",
    "summarized_story": "The Plateau State House of Assemby Speaker, Abok Nuhu Ayuba, has been impeached in the early hours of Thursday.\nThe house immediately elected Hon.\nYakubu Sanda as the new speaker.\nDetails loading…"
  },
  {
    "headline": "Amidst outcry, FEC okays N621bn NNPC fund to fix 21 roads, Niger tops with 9 projects",
    "summarized_story": "007 of 2019 cited as the Companies Income Tax (Road Infrastructure Development and Refurbishment Investment Tax Credit Scheme) Order, 2019.\nSo NNPC has identified 21 roads that it wants to deploy.\n“So, NNPC has sought and council has approved today that NNPC deployed tax resources to 21 roads covering the total distance of 1,804.6 kilometers across the six geopolitical zones.\n“Out of those 21 roads, nine are in North-central, particularly Niger state.\n“So, as I said, it is a total of 21 roads."
  },
  {
    "headline": "The Nigerian Pilot News",
    "summarized_story": "Sign inWelcome!\nLog into your accountyour username"
  },
  {
    "headline": "Defence Minister promises improved welfare for ex- servicemen, dependants of fallen heros, widows -NigPilot",
    "summarized_story": "Minister of Defence, Retired Major General, Bashir Magashi has promised to improve welfare needs of the ex-servicemen, widows, and dependants of the Nigerian Armed Forces Fallen Heroes.\nMagashi made this known during the Nigerian Legion Humanitarian Day Celebration line up with the activities of the Armed Forces Remembrance Day Celebration 2022, at the Legion Headquarters in Abuja.\nWhile appreciating the Nigerian Legion for their efforts towards sustaining the organisational mandate, General Magashi assured ministry of defence commitment to provide succour to the veterans, widows and orphans of fallen heroes.\nMeanwhile, some of the beneficiaries expressed gratitude to the minister of defence, Nigerian legion and other partners organisation for their selfless service to the humanity.\nHighpoint of the event, were the medical treatment to the ex-servicemen and widows, distribution of palliatives items, cash money, scholarship to the children of the fallen heroes amongst others."
  },
  {
    "headline": "Osinbajo advocates sustainable procurement,environmental, social safeguards to achieve ERGP in Nigeria -NigPilot",
    "summarized_story": "Vice President of Nigeria, Prof. Yemi Osinbajo has said that if Nigeria must achieve the objectives of the Economic Recovery Growth Plan ERGP, and the Sustainable Development Goals SDGs, the country must get it right in procurement, environmental and social safeguards.\nOsinbajo made this revelation while officially launching the Sustainable Procurement, Environmental and Social Standards Enhancement Project, SPESSE in Abuja on Thursday.\nProf. Osinbajo noted that to achieve this, there is a need to build the adequate technical capacity required for efficient and effective procurement, environmental and social safeguard systems.\n“The SPESSE Project is Nigeria’s first attempt at institutionalising sustainable capacity building in the fields of Procurement, Environmental, and Social Standards, by offering professionalisation and academic programmes in a custom-made, fit-for-purpose and sustainable manner, through the Centres of Excellence.\nThe Sustainable Procurement, Environmental and Social Standards Enhancement Project centres, SPESSE, are domiciled in six universities across the 6geo-political zones of Nigeria."
  },
  {
    "headline": "DHQ to unveil Exercise SKY LOCK on Nov 1 -NigPilot",
    "summarized_story": "The Headquarters (DHQ), on Thursday, announced its plan to unveil a new military exercise code named Exercise SKY LOCK for participants ofhe war colleges of the three service on November first.\nAccording to the statement, “The Defence Headquarters (DHQ) Abuja, is scheduled to conduct a Joint Operations Planning Exercise (JOPEX) for the participants of the Army War College Nigeria (AWCN), Naval War College Nigeria (NWCN) and Air Force War College Nigeria (AWCN) from 1 – 7 November, 2021 at the Army War College, Nigeria premises located at WU Bassey Barracks, Asokoro, Abuja.\n“The exercise nicknamed Exercise SKY LOCK is the maiden edition to be organized by the DHQ for the 3 Services War Colleges at the instance of the Chief of Defence Staff, General Lucky Irabor.\nThe key objective of the training is to enable participants effectively respond to contemporary security challenges bedeviling Nigeria using a joint and multi-agency approach”.\nThe one-week exercise will draw umpires, observers, and visitors from the Armed Forces of Nigeria , Paramilitary, and international military assistance partners, among others."
  },
  {
    "headline": "NCPWD boss pledges support for people with disabilities in FCT -NigPilot",
    "summarized_story": "Executive Secretary, National Commission for Persons with Disabilities, Mr. James David Lalu, has pledged his willingness to support Persons with Disabilities by providing good health care services and quality education within the six area councils of the Federal Capital Territory.\nLalu made this known recently in Abuja during a visit by the traditional ruler of Karamagiji, a Disability Colony in FCT, Alhaji Ibrahim Kazeem.\nThe visit was partly to seek collaboration with the Commission and largely to discuss issues bordering on education, health care facilities and essentially getting the PWDs off the streets of Federal Capital Territory.\nThe executive secretary also disclosed that the Commission will collaborate with the Social Development Secretariat in F.C.T in creating intervention programmes and Healthcare services to help increase the living standard of Persons with Disabilities within FCT.\nHe therefore, called on the Commission to look critically into the levels of discrimination against PWDs in public places and pleaded for the intervention of the Commission in order to stop the shameful act."
  },
  {
    "headline": "Residents Flee As Suspected Boko Haram Terrorists Attack Borno Community",
    "summarized_story": "Suspected Boko Haram terrorists on Thursday launched a surprise attack on Damboa Local Government Area of Borno State.\nEarly reports indicate that the insurgents stormed the local government headquarters where most of the villagers live, shooting heavy artillery.\nThe situation forced people to scamper for safety and remain indoors as the shooting continued, according to an official.\nIt is not clear if there are any casualties but villagers believe the attack targeted a mobile police base in the town.\nToday’s attack is the second in two weeks, according to villagers."
  },
  {
    "headline": "Wole Soyinka Critcises ‘Special Permission’ Required To Enter Nigeria",
    "summarized_story": "﻿Nobel laureate Wole Soyinka on Thursday decried the immigration processes required to enter Nigeria from Europe.\nREAD ALSO: Nigeria Records 166 New COVID-19 Cases, Two DeathsHe was also asked to fill a questionnaire which he said bore little relation to COVID-19.\nSoyinka said the tedious process had led to many Nigerians “lying in couches” at the airport, unable to proceed with their journey into Nigeria.\n“I don’t believe that I should require – or any Nigerian should require – a special permission to enter his or her own country,” he said.\n“It is not a pleasant sight to see your fellow Nigerians lying on couches – they can’t go in, they can’t go out; they are trapped in limbo."
  },
  {
    "headline": "Appeal Court To Decide Fate Of PDP Convention On Friday",
    "summarized_story": "The Appeal Court in Port Harcourt, Rivers State will on Friday decide whether or not the Peoples Democratic Party will go ahead with the conduct of its National Convention this weekend.\nAccording to him, “the balance of convenience in the matter is in not granting the application” to stop the convention.\nAlso, Donald Dee-Nwigwe (SAN), representing the ninth and 10th respondents, picked holes in the argument by Tayo Oyetibo (SAN) that the conduct of the National Convention by the PDP will be a denial of Uche Secondus right to preside over the convention.\nOther counsels, including Godwin Obla (SAN), Sebastine Horns, who represented other respondents like the National Vice Chairman, South-South of the PDP, Dan Obih, also opposed the application to stop the PDP convention.\nHe also submitted that the application before the court is not to “prohibit the convention of the party, but to suspend the convention pending the determination of the rights of the parties”."
  },
  {
    "headline": "FBI Indictment: No Formal Extradition Request For Abba Kyari, Says IGP",
    "summarized_story": "The Inspector General of Police (IGP), Usman Alkali Baba, says he is yet to see or receive a formal extradition request for Deputy Commissioner of Police (DCP), Mr Abba Kyari following his indictment by a US Court.\nGiving an update on the case, IGP Alkali Baba disclosed on Thursday that he had only heard it on social media, stressing that there was no extradition request as some have reported.\n[READ ALSO]FBI Indictment: Police Commission Suspends Abba KyariCoalition Of Northern Groups Demand Review Of Kyari’s SuspensionCourt Rejects Group’s Petition To Stop Extradition Of Abba KyariFashion funds?\nReacting to the allegations against him, Abba Kyari denied the claims, saying that he collected money to help Hushpuppi sew some clothes.\nKyari later stated that he acted as a debt collector for Hushpuppi in a Facebook post which has since been deleted."
  },
  {
    "headline": "PDP Crisis Being Propelled By APC – Dino Melaye",
    "summarized_story": "﻿A member of the Peoples Democratic Party, Senator Dino Melaye, on Thursday said the All Progressives Congress was behind his party’s recent travails.\nSenator Melaye made the remark during his appearance on Channels Television’s Politics Today.\nREAD ALSO: Appeal Court To Decide Fate Of PDP Convention On FridayThe Court of Appeal is set to give a verdict on whether the Convention will hold on Friday.\nBut Senator Melaye insisted that the verdict will go the way of the PDP and the Convention will hold as scheduled.\nSo I pass through Egypt, and that is APC; but I am in Canaan and I am comfortable and enjoying my stay.”"
  },
  {
    "headline": "eNaira app removed from Google Play Store after bad reviews",
    "summarized_story": "The eNaira application, which was designed by the Central Bank of Nigeria (CBN) and launched in Abuja by President Muhammadu Buhari, has been removed from the Google Play Store.\nThe eNaira has two applications — eNaira speed wallet and eNaira speed merchant wallet.\nNigerians were dissatisfied with the process of registering for the app as required by the CBN, according to Business Post, and the app, dubbed eNaira Speed Wallet on the Google Play Store for Android phone users, was receiving negative reviews on Wednesday.\nMany users had issues after downloading the app from the Google Play store.\nIn fact, it should not be concerned with performing as a citizens’ bank, but rather with remaining as the government’s bank”."
  },
  {
    "headline": "UN asks Sudan's coup leaders to release political detainees",
    "summarized_story": "Pro-democracy demonstrations in Khartoum, the country’s capital, continued one day after the army dissolved the transitional government and detained civilian Prime Minister Abdalla Hamdok and his cabinet.\n“I once again strongly condemn the forceful military takeover of power in Sudan,” Guterres said while responding to a journalist’s question at a press conference at the UN Headquarters.\nMeanwhile, the UN continues to work with partners to provide life-saving aid to nine million Sudanese people.\nHumanitarians have requested $1.9 billion for Sudan this year, but only 30% of their request has been funded.\nFrom January to June, aid organizations in the country provided protection and humanitarian assistance to 7.4 million people."
  },
  {
    "headline": "Drama as impeached Plateau Assembly speaker suspends six lawmakers",
    "summarized_story": "The impeached Speaker of the Plateau State House of Assembly, Nuhu Abok has suspended six lawmakers who allegedly took part in his impeachment earlier in the day.\nThe suspension was announced during a plenary held outside Assembly complex and presided over by the impeached speaker.\nEarlier in the day, majority leader of the House in an interview with Journalist says 16 out of the 24 State lawmakers unanimously signed the impeachment of the Speaker.\nThe Former Speaker is accused of gross incompetence, financial Misappropriation and abuse of office.\nMr Yakubu Sanda the State law maker representing Pengana Constituency of Bassa Council area is now the new Speaker."
  },
  {
    "headline": "Insecurity: C&S Church asks FG to seek foreign assistance",
    "summarized_story": "Concerned about the country’s deteriorating security situation, the Cherubim and Seraphim movement church worldwide has asked the federal government to seek foreign assistance.\nAddressing a press conference at the church’s headquarters in Orile Igbon, Oyo state, the spiritual father of the church, Prophet Samuel Abidoye says the continuous bloodshed in some states is worrisome.\nHe emphasized that there is nothing shameful about seeking foreign assistance and collaboration for the safety of Nigerians.\nTo him, the time for dialogue is over; it is now time to track down the criminal elements, arrest them, and prosecute them in order to serve as a deterrent to others.\nOn the economic front, the church wants the federal government to drop any policy that negates the good standard of living of Nigerians."
  },
  {
    "headline": "Facebook to Be Called Meta in Nod to Its ‘Metaverse’ Vision",
    "summarized_story": "Facebook Inc (FB.O) is now called Meta, the company said on Thursday, in a rebrand that focuses on its ambitions building the “metaverse,” a shared virtual environment that it bets will be the next big computing platform.\nThe company, which has invested heavily in augmented and virtual reality, said the change would bring together its different apps and technologies under one new brand.\nIn the latest controversy, whistleblower and former Facebook employee Frances Haugen leaked documents which she said showed the company chose profit over user safety.\nThe unit will now be called Reality Labs, its head Andrew “Boz” Bosworth tweeted on Thursday.\nZuckerberg said the new name also reflects that over time, users will not need to use Facebook to use the company’s other services."
  },
  {
    "headline": "FBN Holdings Appoints Nnamdi Okonkwo As New Group MD",
    "summarized_story": "FBN Holdings Plc, the holding company of First Bank of Nigeria has announced Nnamdi Okonkwo as its new Group Managing Director.\nThis comes after the board of directors accepted the voluntary retirement of Group Managing Director Mr. U.K.\nAccording to a notification Thursday, on the Nigerian stock exchange, the newly appointed MD, Okonkwo previously served as the Executive Director for Southern Nigeria in Fidelity Bank.\nHe has worked meritoriously on an international level in his capacity as the Managing Director of UBA Ghana; Director, UBA Liberia and a Director of the Ghana National Banking College.\nHe has served in various leadership positions across other financial institutions including Broad Bank of Nigeria Ltd; Citizens International Bank, Nigeria; FSB International Bank Plc, Nigeria; Guaranty Trust Bank Plc, Nigeria; and Merchant Bank of Africa, Nigeria."
  },
  {
    "headline": "IPOB Sit-at-Home Order + CBN Debunks eNaira Twitter Handle – Trending With Ojy Okpe",
    "summarized_story": "Barely 48 hours after the launch of eNaira, Nigeria’s digital currency, the Central Bank of Nigeria raised the alarm that impostors are already defrauding people using fake social media handles.\nIn another development, social media was abuzz on Wednesday, following reports that the eNaira speed wallet disappeared from Google Play Store after 100,00 downloads.\nThe CBN claimed that the speed wallet disappeared because an upgrade was needed and disclosed that they won’t bear the liability for losses caused by the eNaira website.\nOhanaeze Ndigbo, appealed to the group on Wednesday to rescind the threat to enable the governorship election for Anambra State scheduled for November 6th to hold.\nMeanwhile, the Biafra Customary Government, headed by Asari Dokubo, says any boycott of the elections will be fruitless and counterproductive"
  },
  {
    "headline": "France Seizes British Trawler in Post-Brexit Row Over Fishing Rights",
    "summarized_story": "France seized a British trawler fishing in its territorial waters without a licence on Thursday and issued a warning to a second vessel in a dispute over access to fishing grounds after Brexit.\nMARITIME GENDARMESFrench maritime gendarmes made multiple checks on fishing vessels off the northern French port of Le Havre overnight, the Maritime Ministry said, as France steps up surveillance during negotiations.\nThe Marine Traffic app showed a British fishing vessel named Cornelis Gert Jan tied up in the port of Le Havre.\nThe French maritime patrol vessel Atos was moored behind it.\nBoth vessels set course for Le Havre at around 2000 CET (1800 GMT)."
  },
  {
    "headline": "Top US General Confirms ‘Very Concerning’ Chinese Hypersonic Weapons Test",
    "summarized_story": "The Pentagon has been at pains to avoid direct confirmation of the Chinese test this summer, first reported by the Financial Times, even as President Joe Biden and other officials have expressed general concerns about Chinese hypersonic weapons development.\n“What we saw was a very significant event of a test of a hypersonic weapon system.\nNuclear arms experts say China’s weapons test appeared to be designed to evade U.S. defenses in two ways.\nChina’s foreign ministry denied a weapons test.\nThe United States and Russia have both tested hypersonic weapons."
  }
]