[
  {
    "headline": "Diabetes medication may prevent glaucoma, study suggests",
    "summarized_story": "Amarachi OkehA new study has suggested that some diabetes medications may also protect diabetic patients from glaucoma.\nThe medications, GLP-1R agonists (Trulicity and Rybelsus) have been found by American researchers to protect diabetic patients from glaucoma.\nThe study published in the British Journal of Ophthalmology and reported in the peer-reviewed journal, Eurekalert was conducted by researchers in the Scheie Eye Institute at the University of Pennsylvania’s Perelman School of Medicine.\nThe researchers looked at the retrospective data of 1,961 diabetic patients who were new users of the drugs and compared them to 4,371 unexposed control subjects.\n“The findings suggest that GLP-1 receptor agonists may decrease a diabetic patient’s risk of developing glaucoma by half,” the site said."
  },
  {
    "headline": "Diabetes medication may prevent glaucoma, study suggests",
    "summarized_story": "Amarachi OkehA new study has suggested that some diabetes medications may also protect diabetic patients from glaucoma.\nThe medications, GLP-1R agonists (Trulicity and Rybelsus) have been found by American researchers to protect diabetic patients from glaucoma.\nThe study published in the British Journal of Ophthalmology and reported in the peer-reviewed journal, Eurekalert was conducted by researchers in the Scheie Eye Institute at the University of Pennsylvania’s Perelman School of Medicine.\nThe researchers looked at the retrospective data of 1,961 diabetic patients who were new users of the drugs and compared them to 4,371 unexposed control subjects.\n“The findings suggest that GLP-1 receptor agonists may decrease a diabetic patient’s risk of developing glaucoma by half,” the site said."
  },
  {
    "headline": "Imo commissioner dismisses rumour of 37 COVID-19 deaths in LG area",
    "summarized_story": "Imo Commissioner for Health, Dr. Bartholomew Okorochukwu, on Wednesday, dismissed rumours that 37 persons died of COVID-19 in Mbitolu Local Government Area of the state.\nHe said that an investigation by a health surveillance team led by a director of public health, who visited the area, indicated that there were no such deaths.\n“One of the key things our health team noticed on arrival was that people went about their normal businesses with no form of pandemonium anywhere,’’ he noted.\nThe commissioner also told newsmen that three persons died between June and September from COVID-19 infection, noting that their cases would have been better managed if they were vaccinated.\nOkorochukwu said that most of the isolation centres in the state had between 22 and 24 persons undergoing COVID-19 treatment."
  },
  {
    "headline": "Imo commissioner dismisses rumour of 37 COVID-19 deaths in LG area",
    "summarized_story": "Imo Commissioner for Health, Dr. Bartholomew Okorochukwu, on Wednesday, dismissed rumours that 37 persons died of COVID-19 in Mbitolu Local Government Area of the state.\nHe said that an investigation by a health surveillance team led by a director of public health, who visited the area, indicated that there were no such deaths.\n“One of the key things our health team noticed on arrival was that people went about their normal businesses with no form of pandemonium anywhere,’’ he noted.\nThe commissioner also told newsmen that three persons died between June and September from COVID-19 infection, noting that their cases would have been better managed if they were vaccinated.\nOkorochukwu said that most of the isolation centres in the state had between 22 and 24 persons undergoing COVID-19 treatment."
  },
  {
    "headline": "Femi Kuti: Global Citizen Ambassador Against Poverty",
    "summarized_story": "They have soldiers on the ground, who is who that is working for them that you don’t know except they tell you.\nWe don’t need dictators as this present system shows oppression and dictatorship-minded people who lie and rule for selfish reasons.\nGlobal Citizen has set a target for 2030, to end poverty in the World.\nThe message I have is that they need to believe in themselves, they need to believe in Pan-Africanism, we need to look inwards.\nI don’t know when God will call me, but even if God gives me many more years, the strength I had years ago, I don’t have it now."
  },
  {
    "headline": "Femi Kuti: Global Citizen Ambassador Against Poverty",
    "summarized_story": "They have soldiers on the ground, who is who that is working for them that you don’t know except they tell you.\nWe don’t need dictators as this present system shows oppression and dictatorship-minded people who lie and rule for selfish reasons.\nGlobal Citizen has set a target for 2030, to end poverty in the World.\nThe message I have is that they need to believe in themselves, they need to believe in Pan-Africanism, we need to look inwards.\nI don’t know when God will call me, but even if God gives me many more years, the strength I had years ago, I don’t have it now."
  },
  {
    "headline": "GreenField Leadership Awards and Gala Night 2021",
    "summarized_story": "Greenfield Estate, arguably one of the biggest community development associations in Lagos state held their inaugural leadership awards and gala night on Sunday 12th September 2021 at the prestigious envogue center, Ago Place Way, Lagos.\nSpeaking at the event, Chief Monday Akunna, Executive Chairman GFE CDA said “I want to set the record straight.\nThe fundamental essence of this award is to unite and further the restored peace amongst us.\nThus, it is safe for anyone to code name this event a peace and unity gala-night.\nThe event all the trappings of an A-List event with important dignitaries turning out to add color to the gala night."
  },
  {
    "headline": "GreenField Leadership Awards and Gala Night 2021",
    "summarized_story": "Greenfield Estate, arguably one of the biggest community development associations in Lagos state held their inaugural leadership awards and gala night on Sunday 12th September 2021 at the prestigious envogue center, Ago Place Way, Lagos.\nSpeaking at the event, Chief Monday Akunna, Executive Chairman GFE CDA said “I want to set the record straight.\nThe fundamental essence of this award is to unite and further the restored peace amongst us.\nThus, it is safe for anyone to code name this event a peace and unity gala-night.\nThe event all the trappings of an A-List event with important dignitaries turning out to add color to the gala night."
  },
  {
    "headline": "Runwaytrybe 2021 @ Oriental Hotel",
    "summarized_story": "Runwaytrybe a Pan-Africa fashion that promotes styles, garments, and designers from within and outside Africa, recently held their 2021 edition of Runwaytrybe fashion show at Oriental hotel, Lekki.\nSpeaking at the event, Opeyemi Akinade Bonaparte, the convener said ” one of the main purposes of Runwaytrybe is to be a social impact organization.\nWe strive to be the go-to platform for fashion enthusiasts and designers alike for the latest African fashion collection and innovative styles.\n“We cater towards a niche audience who hold enthusiasm for Afro-centric and innovative apparel.\nWe showcase only the latest collections from the finest designers and fashion houses whether they be up and coming or well known."
  },
  {
    "headline": "2023: Heaven will fall if another northerner succeeds Buhari – Joe Igbokwe replies Northern elders",
    "summarized_story": "Joe Igbokwe, a chieftain of the All Progressives Congress, APC, has reacted to the remark by the Northern Elders Forum, NEF, on President Muhammadu Buhari’s successor.\nIgbokwe warned that heaven would fall if another Northerner is elected after Buhari.\nBaba-Ahmed had said anyone against a Northern president should leave Nigeria if one emerges in 2023.\nHowever, Igbokwe, on his Facebook page wrote: “Heaven won’t fall if another Northerner is elected president – Hakeem Baba-Ahmad.\nAgainst this backdrop, the Southeast has been clamouring to produce Nigeria’s next president."
  },
  {
    "headline": "UNGA: Nigeria battling species extinction, plans 10 new national parks – Buhari",
    "summarized_story": "President Muhammadu Buhari assured the United Nations General Assembly (UNGA) that Nigeria is working to reverse the severe trend of biodiversity loss.\nBuhari listed expansion of protected areas, including the establishment of 10 new National Parks across Nigeria; and creation of Marine Protected Areas pursuant to the 30X30 Agenda of the Convention on Biodiversity (CBD).\nHe mentioned the domestication of relevant international agreements, and laws/policies for the protection and conservation of biodiversity.\nBuhari thanked President of Costa Rica, Carlos Alvarado Quesada whose country currently chairs the High Ambition Coalition for Nature & People (HAC).\nUNGA: Buhari’ll teach world leaders how to manage economy during pandemic – Presidency"
  },
  {
    "headline": "Why Buhari govt will not reveal Boko Haram sponsors – Malami",
    "summarized_story": "The Attorney General of the Federation (AGF), Abubakar Malami, has again reiterated that the Muhammadu Buhari administration will not name sponsors of terrorism at the moment.\nThe AGF stated this while speaking to journalists in New York, according to a statement by his spokesperson, Umar Gwandu, on Wednesday.\nThe Federal Government has faced a lot of criticisms lately for not naming terror sponsors despite the help offered to Nigeria by the United Arab Emirates (UAE) and other countries.\nHowever, Malami insisted they are working hard to ensure financiers of insurgency in the country are prosecuted.\nFor the purpose of investigation, I would not like to be pre-emptive in terms of making disclosures that will have effect of undermining the successes we are recording.”US set to help Nigeria identify Boko Haram sponsors"
  },
  {
    "headline": "Makinde sends names of 10 Commissioner-nominees to Oyo Assembly",
    "summarized_story": "Governor Seyi Makinde of Oyo State has forwarded names of ten more people who are to serve as his Commissioners to Oyo State House of Assembly.\nTheir names were contained in a letter forwarded to the Oyo State House of Assembly by the Governor for consideration and approval.\nThe five returning former Commissioners are Mr Seun Fakorede, Mr Adeniyi Adebisi, Mr Olasunkanmi Olaleye, Mr Wasiu Olatunbosun and Mr Abdulrahman Abdulrahim.\nOur correspondent recalls that Makinde had earlier appointed seven Commissioners.\nMakinde swears-in seven commissioners in Oyo"
  },
  {
    "headline": "Tinubu condoles with King Sunny Ade over wife’s death",
    "summarized_story": "Bola Tinubu, National Leader of All Progressives Congress and former Lagos State Governor, has commisserated with Juju singer, King Sunny Ade, on the death of his wife, Risikat Adegeye.\nDAILY POST reported that the 62-year-old died on Tuesday during a brief illness.\nReacting, in a condolence message signed by his media aide, Mr Tunde Rahman, on Wednesday, Tinubu expressed sadness at the death of the lawmaker.\nAdegeye was a prominent grassroots politician in Lagos who worked fervently for her Amuwo-Odofin Constituency.\nBuhari sympathizes with King Sunny Ade over wife’s death"
  },
  {
    "headline": "Corruption is Nigeria’s major headache, says British envoy",
    "summarized_story": "By Elo Edremoda, Warri- Advertisement -The British High Commissioner in Nigeria, Catriona Laing, has said Nigeria’s major problem is corruption.\nShe said the country is blessed with the human and material resources needed for its desired development but was being tied down by pervasive corrupt practices.\nLaing spoke yesterday when she visited the country home of former House of Representatives member, Prince Ned Nwoko, at his country home in Idumuje-Ugboko, Aniocha North Local Government area of Delta State.\nThe high commissioner said Nigeria has sufficient resources that should be harnessed for its future advancement in different areas of endeavours.\nNwoko restated his commitment to contribute to Nigeria’s development, saying restructuring remained important in the efforts to tackle the current challenges rocking the nation."
  },
  {
    "headline": "No deal until our demands are met, say striking doctors",
    "summarized_story": "By Moses Emorinken, Abuja- Advertisement -The Nigerian Association of Resident Doctors (NARD) has insisted that before it considers ending the ongoing strike, the Federal Government should meet its minimum terms of settlement.\nLast Friday, the planned negotiation between the Federal Ministry of Labour and the striking doctors collapsed as both parties could not accept either of their terms of settlement.\nThe National Industrial Court of Nigeria (NICN) in Abuja had ruled that the doctors should return to work, and the doctors filed an appeal.\nYet, the minister is urging us to call off the strike when he himself is wicked to his people.\nIf it was something that was doable, the NARD would have called off the strike.”"
  },
  {
    "headline": "VP to law officers: speed up cases",
    "summarized_story": "Osinbajo urged the states’ chief law officers to leverage their network and individual positions to make the desired changes in the Justice sector.\nThey said many of the reforms were inspired by the successes recorded during his (Osinbajo’s) stint as Lagos State Attorney-General.\nThe justice commissioners’ presentations also included social protection objectives and improving the legal framework for enhancing the business environment in their states.\nThe statement said the visiting justice commissioners were led by the Ekiti State Attorney-General, Mr. Olawale Fapohunda.\nOthers were Lagos State Attorney-General, Mr. Moyosore Onigbanjo (SAN); Ondo State Attorney-General, Sir Charles Titiloye; Oyo State Attorney-General, Prof. Oyelowo Oyewo; Ogun State Attorney-General, Mr. Akingbolahan Adeniran; and his Osun State counterpart, Mr. Olufemi Akande."
  },
  {
    "headline": "BREAKING: Tanker fire causes panic in Oke Afa",
    "summarized_story": "Pandemonium enveloped the residents of Oke Afa in the Isolo area of Lagos as a tanker laden with petroleum product erupted in flames near a fuel station, burning controllably.\nWitnesses said the fire started at about 10.20pm just as residents of the area were about retiring to their beds.\nThe incident caused a huge explosion, throwing ball of fire mid air and sparking off panic among residents who throng the streets in deep apprehension and confusion.\nDetails soon…Get paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars.\nClick here to apply today."
  },
  {
    "headline": "BREAKING: Gunmen attack police checkpoint in Enugu, kill 2 cops",
    "summarized_story": "From Geoffrey Anyanwu, EnuguThe Enugu State Police Command has suffered another loss in the hands of unknown gunmen as it lost two policemen to bullets of the hoodlums.\nThe two policemen were said to be on duty at a checkpoint at Nachi in Oji River local government of the state with the colleagues when the gunmen unexpectedly attacked and shot them.\nWhen contacted, the State Police Public Relations Officer, Daniel Ndukwe said the Command had commenced action to track down the killers of the cops.\nHe said: “Full-scale investigation that will lead to fishing out of the assailants has commenced.\nFurther development will be communicated, please.”Get paid up to N850,000 weekly, step by step guide on how to work from home and get paid in US Dollars."
  },
  {
    "headline": "2023: Northern, southern leaders join forces to fight PDP, APC",
    "summarized_story": "In his welcome address, Bugaje identified poor leadership recruitment process at the heart of the problems confronting the country.\nIn other words when you reduce the problems of this country to what they are, ultimately, it all comes to leadership.\nWe knew we wouldn’t need their agreement before we said that we are not going to have presidency in the North in 2023.\n“It was the support of the south that made President Buhari to win his elections in 2015 and 2019.\nWe are very surprised that Hakeem has suddenly forgotten so soon how President Buhari emerged as president."
  },
  {
    "headline": "The Sun award, call to more duty –Kyari, NNPC GMD",
    "summarized_story": "The Group Managing Director of the Nigerian National Petroleum Corporation (NNPC), Mallam Mele Kyari, has described his nomination for The Sun Man of the Year 2020 Award as a loud call to double his efforts in delivering on his mandate .\nHe stressed that singling him out forcthe award in the midst of millions of illustrious Nigerians would propel him to surpass his current feat.\nThe NNPC boss said: “I wonder if I do deserve this award because I’m just doing what I have to do as NNPC GMD.\n“Last year, NNPC recorded major strides in the gas sector with the commissioning of the Oredo Integrated Gas Handling Facility (IGHF) and the Liquefied Petroleum Gas Storage and Dispensing Unit, constructed to address domestic gas supply challenges.\nOther award winners are Mr. Moses Ekpo, deputy governor of Akwa Ibom State, Chief Olabode George, Prof George Obiozor, President-General of Ohanaeze Ndigbo Worldwide and Amb."
  },
  {
    "headline": "Buhari returns petroleum industry law to NASS for amendments",
    "summarized_story": "From Fred Itua, AbujaThe Senate, yesterday, received a request from President Muhammadu Buhari, to amend the Petroleum Industry Act (PIA) 2021 passed by the National Assembly over two months ago.\nThe request was contained in a letter dated September 16, 2021, and read during plenary on Tuesday by Senate President, Ahmad Lawan.\nPresident Buhari in the letter explained that the appointment of two non-executive members as provided for by the Act to the board of the Nigerian Midstream and Downstream Petroleum Regulatory Authority (NPRA) and Upstream Regulatory Commission (URC) did not reflect balanced geopolitical representation.\nIn addition, the president proposed a deletion of Sections 11(2)(f), 11(2)(g), 34(2)(f) and 34(2)(g) from the Petroleum Industry Act, which would see to the removal of the Ministries of Petroleum and Finance form the Board of the Nigerian Petroleum Regulatory Authority and Upstream Regulatory Commission.\n“This will ensure effective management of the regulatory institutions through uniform implementation of public service rules for employees of the Authority."
  },
  {
    "headline": "Senate Passes 2022-2024 MTEF/FSP",
    "summarized_story": "The Joint Committee report was presented by the Chairman of the Senare Finance Committee, Senator Solomon Olamilekan Adeola.\nSenators took turns to debate the MTEF/FSP document which was submitted to the legislative arm for approval last month by President Muhammadu Buhari.\nContributing to the debate, former Governor of Benue state and Chairman of the Senate Committee on Power, Senator Gabriel Suswam, lamented that government’s borrowing had been increasing yearly, wondering when it is going to stop.\nLast year it was above the threshold, this year, it is above by six per cent.\n“In managing an economy, we need to combine fiscal policies with monetary policies."
  },
  {
    "headline": "Buhari Proposes New Amendments to PIA, Nominates Regulatory Boards",
    "summarized_story": "Buhari, in a letter read yesterday on the floor of the senate, also sought an increase in the membership of the board of the Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA).\nBuhari explained that the appointment of two non-executive members to the board of the midstream, downstream and upstream commissions, as provided for by the Act, did not reflect balanced geopolitical representation.\nFor the upstream, the president nominated Isa Ibrahim Modibbo as Chairman, while Mr. Gbenga Komolafe was selected as Chief Executive Officer.\nThis saved Nigeria monies that had perennially been expended on national downstream petroleum assets maintenance, operations and security.\nHe was also General Manager, Operations, Petroleum Equalisation Fund (PEF); and General Manager, Operations, Petroleum Products Pricing Regulatory Agency (PPPRA), among several other positions."
  },
  {
    "headline": "Banditry Has Transformed into Insurgency, Time to Eliminate Them, Masari Warns",
    "summarized_story": "He said: “From experiences of other countries, you need to liquidate banditry and insurgency completely.\nI said it before let me repeat it again, the issue of banditry in Katsina, Zamfara, Sokoto, Kebbi, part of Niger and Kaduna States has no religious problem and tribal.\nEarlier, the Minister, Mohammed said the security measures adopted by the Masari-led government in combating banditry were yielding positive results.\nAccording to him, “From experiences of other countries, you need to liquidate banditry and insurgency completely.\nMohammed, who spoke earlier, said the security measures adopted by the Masari-led government in combating banditry were yielding positive results."
  },
  {
    "headline": "In Show of Strength, Nigeria Raises $4bn through Eurobonds",
    "summarized_story": "Ndubuisi FrancisNigeria has raised $4 billion through Eurobonds, which was a reflection of investors’ confidence in the economy.\nAccording to the DMO, bids for the Eurobonds were received from investors in Europe and America, as well as Asia.\nAccording to the statement, the size of the Order Book and the quality of investors demonstrates confidence in Nigeria.\nIt further explained that when Nigeria raised funds externally through Eurobonds, it freed up space in the domestic market for private sector and sub-national borrowers.\nThe issuance of Eurobonds by Nigeria has opened up opportunities for Nigeria’s corporate sector, notably banks, to issue Eurobonds to raise capital in the ICM.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Senate Gives Committee One Week to Consider Buhari’s $4.05bn, €710m Loan Request",
    "summarized_story": "Deji Elumoye in AbujaPresident of the Senate, Dr Ahmad Lawan, has referred the request of President Muhammadu Buhari, seeking to borrow $4.054bn, €710m, $125m external loans to the Senate Committee on Foreign and Local Debts for further legislative action.\nLawan at Tuesday’s plenary asked the Committee, chaired by Senator Clifford Ordia, to work on the Buhari’s request and submit its report next Tuesday.\nThis directive was sequel to a motion to that effect moved by the Senate Leader, Senator Yahaya Abdullahi, and seconded by the Minority Leader, Senator Enyinnaya Abaribe.\nThe Senate had upon resumption from two-month annual recess last week received a formal request from President Buhari to consider and approve an external loan to fund projects captured under the 2018-2021 borrowing plan.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: Ten Killed In Katsina Community By Bandits Residents Vow Were Dropped By Army Green Helicopter",
    "summarized_story": "No fewer than 10 people have reportedly been killed by bandits who were allegedly dropped by a helicopter in Gurbi village in Katsina state.\nGurbi village is in the Kurfi local government area of the state.\nImrana disclosed that an army green coloured helicopter dropped the bandits who wreaked havoc on the village.\n“A green helicopter dropped the attackers and in less than five minutes after their arrival, they went on a house-to-house rampage.\n\"They either killed or carted away all the cattle in Gurbi village and set about ten cars ablaze."
  },
  {
    "headline": "EXCLUSIVE: Ten Killed In Katsina Community By Bandits Residents Vow Were Dropped By Army Green Helicopter",
    "summarized_story": "No fewer than 10 people have reportedly been killed by bandits who were allegedly dropped by a helicopter in Gurbi village in Katsina state.\nGurbi village is in the Kurfi local government area of the state.\nImrana disclosed that an army green coloured helicopter dropped the bandits who wreaked havoc on the village.\n“A green helicopter dropped the attackers and in less than five minutes after their arrival, they went on a house-to-house rampage.\n\"They either killed or carted away all the cattle in Gurbi village and set about ten cars ablaze."
  },
  {
    "headline": "2023: Five Northern Ex-Governors Jostle To Become Chairman Of Ruling Party, APC",
    "summarized_story": "It was followed up by the local government congress while the state congress is slated for October 2.\nFrom growing indications, the APC national chairmanship aspirants, who are mostly from the North, include; one; Abdulaziz Yari; a two-term former governor of Zamfara State.\nAnother aspirant is Isa Yuguda; former Bauchi State governor and former Minister of Aviation.\nFour, there is Kashim Shettima; he is former Borno State governor and a lawmaker in the National Assembly.\nFormer Nasarawa State governor, Tanko Al-Makura, is another contender for the national chairmanship position."
  },
  {
    "headline": "2023: Five Northern Ex-Governors Jostle To Become Chairman Of Ruling Party, APC",
    "summarized_story": "It was followed up by the local government congress while the state congress is slated for October 2.\nFrom growing indications, the APC national chairmanship aspirants, who are mostly from the North, include; one; Abdulaziz Yari; a two-term former governor of Zamfara State.\nAnother aspirant is Isa Yuguda; former Bauchi State governor and former Minister of Aviation.\nFour, there is Kashim Shettima; he is former Borno State governor and a lawmaker in the National Assembly.\nFormer Nasarawa State governor, Tanko Al-Makura, is another contender for the national chairmanship position."
  },
  {
    "headline": "Nollywood Actress, Tonto Dikeh's Ex-Lover Drags Film Star, Secret Police To Court, Seeks N10billion Compensation",
    "summarized_story": "Prince Joseph Kpokpogri, estranged lover of controversial Nollywood actress, Tonto Dikeh, has dragged the actress and the Department of State Services (DSS) before a Federal High Court in Abuja to seek the enforcement of his fundamental rights.\n''That the 2nd Respondent has continuously issued oral threats against me that she is going to use all her connections and contacts to bring me down to nothing simply because I separated from her.\n''That I thereafter became worried that the 2nd Respondent could execute her threats, considering her wide popularity and connection in the Nigerian film industry.\n''That the 2nd Respondent is hell bent on using men and officers of the 1st Respondent to invite, pester, harass and intimidate me because she is a popular film actress and social media influencer with lots of connections, contacts and followership within and outside Nigeria.\n''That it is based on this that I have come before this Honourable Court to seek reprieve, refuge and enforcement of my fundamental rights."
  },
  {
    "headline": "Reps stranded in Kano airport as airline reschedules flight 'four times'",
    "summarized_story": "Some members of the house of representatives are currently stranded in the Aminu Kano international airport, Kano state.\nAdvertisementThe lawmakers were said to have arrived the airport to board an Azman airline flight, scheduled for 12:30pm on Wednesday, en route Abuja.\nThe lawmakers — members of the committee on petroleum upstream and petroleum technology development fund (PTDF) — visited Kano state for an oversight assignment.\nThe flight was reportedly delayed from 12:30pm till 2:30pm, then till 6pm.\nOfficials of the airline are said to have failed to address the passengers on the cause of the delay."
  },
  {
    "headline": "Reps stranded in Kano airport as airline reschedules flight 'four times'",
    "summarized_story": "Some members of the house of representatives are currently stranded in the Aminu Kano international airport, Kano state.\nAdvertisementThe lawmakers were said to have arrived the airport to board an Azman airline flight, scheduled for 12:30pm on Wednesday, en route Abuja.\nThe lawmakers — members of the committee on petroleum upstream and petroleum technology development fund (PTDF) — visited Kano state for an oversight assignment.\nThe flight was reportedly delayed from 12:30pm till 2:30pm, then till 6pm.\nOfficials of the airline are said to have failed to address the passengers on the cause of the delay."
  },
  {
    "headline": "Border closure helped Nigeria tremendously, Buhari tells Queen of Netherlands",
    "summarized_story": "President Muhammadu Buhari says the closure of the country’s borders for over one year helped Nigeria “tremendously”.\nAdvertisementThe federal government had, in August 2019, ordered a closure of the country’s land borders over illegal importation of drugs, arms and agricultural products into Nigeria from neighbouring West African countries.\nIn December 2020, Buhari ordered the reopening of four land borders.\nMonths after the reopening, the president had expressed concern that the closure of the borders failed to stop arms smuggling into Nigeria.\nThe president, who is currently in New York for the 76th United Nations general assembly, held a meeting with Maxima Zorreguieta, Queen of the Netherlands, on Wednesday."
  },
  {
    "headline": "Border closure helped Nigeria tremendously, Buhari tells Queen of Netherlands",
    "summarized_story": "President Muhammadu Buhari says the closure of the country’s borders for over one year helped Nigeria “tremendously”.\nAdvertisementThe federal government had, in August 2019, ordered a closure of the country’s land borders over illegal importation of drugs, arms and agricultural products into Nigeria from neighbouring West African countries.\nIn December 2020, Buhari ordered the reopening of four land borders.\nMonths after the reopening, the president had expressed concern that the closure of the borders failed to stop arms smuggling into Nigeria.\nThe president, who is currently in New York for the 76th United Nations general assembly, held a meeting with Maxima Zorreguieta, Queen of the Netherlands, on Wednesday."
  },
  {
    "headline": "Senate spokesman: Rescue Nigeria Project an assemblage of failed politicians",
    "summarized_story": "Ajibola Basiru, spokesperson of the senate, says the newly formed political group — Rescue Nigeria Project (RNP) — is an “assemblage of failed politicians”.\nThe other people that you said ‘third force’, there was a time some people named their own political party Mega Political Party.\n“By the end of the day, the Mega Political Party never had a councilor, not to talk of an LG chairman.\nAdvertisement“I look at the dramatis personae that they were at the so-called Rescue Nigeria Project today.\nAn assemblage of failed politicians, either elected or appointed, can’t say that want third force movement for the country.”"
  },
  {
    "headline": "ARM collaborates with TechCabal on the Future of Commerce partnership pitch session",
    "summarized_story": "As part of the sessions, TechCabal will organize two strategic workshops – a partnership pitch session where growth-stage startups can pitch to corporate organizations for potential partnerships, and an investment pitch session where early-stage startups can pitch to potential investors.\nAsset & Resource Management Holding Company Limited (ARM), a provider of global asset management services across a wide range of traditional and alternative investment options, has partnered with TechCabal on the partnership pitch session.\nIna Alogwu, Group Director of Digital Transformation at ARM Group will be speaking at the session.\nAt ARM, he oversees the execution of the Group’s digital transformation strategy, helping the seven subsidiary companies in the Group drive their digital initiatives.\nSpeaking about the event, Olanrewaju Odunowo, Head of TechCabal Insights said, “The COVID-19 pandemic has changed the face of commerce."
  },
  {
    "headline": "Ventures Park launches larger hub in Abuja for its expanding user base",
    "summarized_story": "Image credit: Supplied by Ventures Park.\nA shared workspace at the new Ventures Park campus in Abuja.\nThe new Ventures Park campus in Abuja.\nAfter launching its second innovation hub, Ventures Platform is considering partnerships that could see it expand across Africa, according to Oguchi.\n“The work we do at Ventures Platform is pan-African, and the work that Ventures Park does as a part of that vision is really important,” she said."
  },
  {
    "headline": "A backstory to the tussle between CBN and popular website abokiFX",
    "summarized_story": "abokiFX, a popular mobile and web-based platform that collates the black market foreign exchange rates in Nigeria, on Friday announced it will temporarily suspend the publishing of rates on all its platforms, hours after receiving threats from the Central Bank of Nigeria (CBN).\nWhy Nigeria has different exchange ratesNigeria is Africa’s largest producer of oil, a commodity that brings in more than 90% of the country’s foreign exchange earnings.\nBut rather than an outright devaluation of the naira, the CBN adopted a multiple exchange-rate regime.\nThat left Nigeria with only two rates – the NAFEX rate and the parallel market rate – from almost five different rates as of early 2020.\n“All allegations against our director are yet to be confirmed but we at abokiFX DO NOT trade FX nor do we manipulate parallel market rates,” the statement reads."
  },
  {
    "headline": "iPhone 13 series price in Nigeria, Kenya, and South Africa",
    "summarized_story": "During a virtual event on Tuesday, Apple announced that the iPhone 13 will come in four new models: the iPhone 13, 13 Mini, 13 Pro and 13 Pro Max.\nThe iPhone 13 starts at $829 for 128GB, which is twice the storage the iPhone 12 started with; while the iPhone 13 Mini starts at $729 for 128GB of storage.\nThe iPhone 13 Pro and 13 Pro Max start at $999 and $1,099 respectively, for 128GB storage.\nIPHONE 13 SERIES US PRICES AND STORAGEPhone 128GB storage 256GB storage 512GB storage 1TB storage iPhone 13 Mini $729 $829 $1,029 NA iPhone 13 $829 $929 $1,129 NA iPhone 13 Pro $999 $1,099 $1,299 $1,499 iPhone 13 Pro Max $1,099 $1,199 $1,399 $1,599Why the iPhone 13 series are more expensive in African countriesOver the years, there’s been a noticeable price difference for Apple products in African countries.\nAlthough the store hasn’t revealed the prices, the iPhone 13 Pro 128GB is expected to go for around R23,499 ($1,640), while the iPhone 13 Pro Max 128GB could retail for around R25,999 ($1,815)."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Good day, Joy couldn’t be here so I’m filling in for her.\nAlso, apologies for not delivering the NFT article as..."
  },
  {
    "headline": "AfCFTA and Nigeria’s Intellectual Property (IP) market",
    "summarized_story": "Notably, trading under the AfCFTA Agreement officially commenced on January 1, 2021, subject to negotiations on protocols and instruments of trade.\nThe Agreement has three layers comprising the AfCFTA Agreement itself which serves as a framework agreement, the Protocols and the Annexes, Guidelines, and Schedules to the Protocols.\nUnder Phase I negotiations, the Protocols on Trade in Goods, Trade in Services, and Dispute Settlement entered into force concurrently with the AfCFTA Agreement.\nThe Protocol on Intellectual Property Rights (“IPR Protocol”) which will be negotiated during Phase II of AfCFTA has vast possibilities for IP which must be explored.\nIn conclusion, AfCFTA is a laudable initiative that can potentially expand Africa’s fiscal opportunities and significantly improve the economy of African countries."
  },
  {
    "headline": "Techpoint Build 2021!!! Free Netflix for Kenyans, CBN on the eNaira, Cartona’s series A",
    "summarized_story": "Share this article:Good day,Today I’m discussing:Techpoint Build 2021Netflix’s free plan in KenyaMore on Nigeria’s CBDCCartona’s Series ATechpoint Build is coming!!!\nKenyans can now watch Netflix for free and without AdsPhoto Credit: NetflixYes, you read right.\nUS-based movie streaming platform, Netflix, announced on Monday that it had begun the rollout of a free Netflix plan for Kenyans.\nHowever, Conk hinted at the most likely reason for this offering: free subscribers can upgrade to a paid subscription to access the platform’s full catalogue of movies and shows.\nRecall that in July, it was announced that the eNaira is set to launch on October 1, 2021."
  },
  {
    "headline": "Tesla-backed ZOLA Electric is solving Africa’s energy shortage by digitising energy",
    "summarized_story": "As Africa’s population and need for economic growth increase, the need for a reliable and sustainable energy source also rises.\nZOLA Electric has a product called Infinity that takes power from solar panels, power grids, and other power sources.\nIt then uses an installed software to switch to the most readily available energy source while simultaneously storing energy.\nZOLA Electric sells its products through its partners, who, while serving as distributors, interact directly with customers.\nWhile Lenihan claims ZOLA Electric creates primary energy solutions, they still depend on other energy sources."
  },
  {
    "headline": "JP Morgan sees Nigeria’s economic recovery slower than expected in 2021",
    "summarized_story": "Nigeria’s economic recovery from last year’s coronavirus pandemic-induced contraction could be slower than previously expected, according to American bank, JP Morgan.\nNigeria’s economy is likely to expand by just 1.5 percent in 2021, JPMorgan Chase Bank NA analysts including Gbolahan Taiwo and Ayomide Mejabi said in an emailed note.\nA “continued lack of foreign-exchange liquidity, underlying economic weakness, an emerging third wave of Covid-19 infections and a slow rollout of vaccines will likely slow the recovery process,” JPMorgan said.\nRead Also: Nigeria’s economic recovery threatened by slow pace of reforms, World Bank saysNigeria’s economic recoveryThe government however just successfully raised $4 billion in Eurobonds Tuesday which analysts say will help improve the foreign exchange scarcity.\nAnalysts say restoring foreign investor confidence in the economy will go a long way in increasing much needed dollar inflows to the economy."
  },
  {
    "headline": "COVID-19 vaccines import raises cargo insurers’ premium",
    "summarized_story": "Insurers globally, including Nigeria, are seeing uptake in marine cargo business on the back of increased demand by pharmaceutical companies and institutions involved in importation of COVID-19 vaccines.\nMarine cargo insurance covers the risks of loss, damage, expense and liability of goods during transportation from one place to the other, either by air, water or land.\nNigeria in March received nearly 4 million doses of the COVID-19 vaccine (AstraZeneca), shipped via the COVAX Facility, a partnership between CEPI, Gavi, UNICEF and WHO.\nSupo Sogelola, executive director, Law Union & Rock Insurance plc, now Tangerine Insurance, confirmed in a telephone interview that Nigerian insurers had been involved in providing marine cargo insurance for import of COVID-19 vaccines into the country.\n“So, we have been part of the importation of COVID-19 vaccines, and this is expected to rise as states begin to place orders for the vaccines for their citizens."
  },
  {
    "headline": "After Eurobond glow, Nigeria missing in top 10 countries to invest in Africa ranking",
    "summarized_story": "Nigeria must have its rather successful Eurobond sale of Tuesday to thank for partly overshadowing its woeful performance in the 2021 “where to invest in Africa” report where the continent’s biggest economy did not qualify to be listed in the ranking of the top 10 countries.\nIn the ‘Where to invest in Africa’ ranking, Egypt was placed first and followed by Morocco and South Africa in the second and third place, respectively.\nHe is worried that investors in Nigeria find it difficult to repatriate their investment returns.\nInvestment inflows into Nigeria have dwindled since the economic recession in 2016, a sign of the country’s weakening allure to foreign investors.\nHowever, it did raise a $4 billion Eurobond on Tuesday that was oversubscribed four times as bids totalled $12 billion compared with the $3 billion that was initially planned."
  },
  {
    "headline": "2021 World Peace Day : CEPEJ Celebrates Olu of Warri As Patron – Nigerian Observer",
    "summarized_story": "Chief Mulade, who is the first Ijaw leader to take peace advocacy to the Olu of Warri, used the occasion to celebrate the Monarch on his coronation, and inducted him as CEPEJ’s Royal Peace Ambassador and Patron.\nDuring the visit, CEPEJ advocated for a society characterized by equity, justice, fair play and inclusiveness.\nAccording to Comrade Mulade, peace begins with the inner mind, to the heart and to the people.\nResponding, the Olu of Warri, Ogiame Atuwatse III thanked the CEPEJ team for the visit, and commended Comrade Mulade for taking his peace crusade to all corners of Nigeria and Africa.\nThe Warri Monarch stressed the need for sustainable peace and development based on the truth and resolution of underlining wrongs and injustices in the land."
  },
  {
    "headline": "Edo govt partners firm on construction of Benin Mall – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, on Tuesday, entered an agreement with Persianas Nigeria Limited for the development and construction of a modern shopping centre in Benin City, the Edo State capital.\nThe Edo State Governor, Mr. Godwin Obaseki, while addressing journalists after signing the partnership agreement for the Benin mall project, said the project is coming after twelve years of failed attempts.\nObaseki said the goal of his administration is to ensure that Benin City has all the features of a modern smart city while stimulating the economy.\nAccording to him, “Our struggle to bring Shoprite or a major mall experience to Edo State has been on for more than a decade.\nOnce the mall is built, the government intends to sell its own interests to Edo people who are interested in being part-owners."
  },
  {
    "headline": "Senate approves establishment of nationwide emergency communications service – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Senate on Tuesday passed a bill seeking to establish the Nationwide Emergency Communications Service.\nIt also approved 112 as the toll-free number for emergencies.\nThe approval followed the consideration of the report of Senate Committee on Communication on Nationwide Toll-Free Emergency Number (Establishment) Bill, 2021, at plenary.\nThe report was presented by Sen. Biodun Olujimi(PDP-Ekiti) on behalf of the Chairman of the Committee, Sen Oluremi Tinubu (APC-Lagos).\nOlujimi explained that Clause 11 of the bill prohibited use of telephone and mobile telecommunications services to place a false, frivolous or vexatious calls to the emergency number 112."
  },
  {
    "headline": "Edo urges patience, assures of completion of Ekehuan Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has called for patience and collaboration of residents of Ekehuan Road axis of Benin City, reassuring that the government is committed to the completion of the ongoing reconstruction and dualisation of the road and other projects in the state.\nPermanent Secretary, Edo State Ministry of Infrastructure, Engr.\nFerguson Enabulele gave the assurance in Benin City, during an inspection visit to the area to assess the level of work done on the road.\nHe however appealed to the residents to be patient with the government, noting that work on the project would resume after the rains.\nOn their part, the youths expressed satisfaction with the state of work done on the project, lauding the developmental strides of the Governor Godwin Obaseki-led administration across the state."
  },
  {
    "headline": "Nigerian govt says it could borrow more through Eurobonds, gives conditions",
    "summarized_story": "ADVERTISEMENTNigerian could look the way of Eurobonds to tap new debt the government needs to bridge a gap in its spending plan for 2021.\nOffers for a similar issuance on Tuesday were way higher than what was put out, demand dwarfing the debt size four times over, an outcome the debt office designated “one of the biggest financial trades to come out of Africa in 2021.”The $4 billion sourced abroad after the interest from investors there surpassed the $3 billion originally intended is causing government to bet the international sovereign bond market would be healthy for its borrowing ambition this year.\n“We will monitor the markets while still exploring other sources,” Patience Oniha, the Debt Management Office (DMO) chief told Bloomberg via email, noting the entirety of the $6.1 billion the government wants to borrow this year could be in the mould of Eurobonds “if tenors and pricing are good.”Tuesday marked the first time since 2018 Africa’s biggest economy would be raising debt overseas, easing the way for the Central Bank of Nigeria to shore up supply of the greenback, which it has been rationing to keep pressure off its reserves.\nNigeria had refrained from the international debt market for three years following an oil price slide that contracted earnings and ramped up the measure of revenue it must earmark for debt servicing to over 90 per cent."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Ogun pensioners protest, shut governor’s office gate against workers",
    "summarized_story": "Idowu Olakunle, AbeokutaPensioners in Ogun State today, demonstrated against the state government’s non payment of their outstanding gratuity.\nThe aggrieved pensioners during protest, locked the two gates to the Governor’s Office secretariat, preventing the Secretary to the State Government (SSG), Mr. Tokunbo Talabi and other civil servants from entering the governor’s, for over four hours.\nThe pensioners carried placards with inscriptions such as: “gratuities are on sales to pensioners”, “Governor Dapo Abiodun honour your father and treat Pensioners well” and “Governor Abiodun Abiodun, we don’t deserve this worst humiliation”, among others .\nThey accused the state governor, Dapo Abiodun of failing to keep his promises to the pensioners, just as the State Chairman of LOGPAN, Sikiru Ayilara lamented that some of them still earn paltry sum of N3,000 as monthly pension.\nWe had informed all security apparatus in the state: DSS, Commissioner of police, Commandant of NSCDC, SSA on security matters to the Governor."
  },
  {
    "headline": "AMCON takes over former governor Ahmed’s mansion over N5bn debt",
    "summarized_story": "The Asset Management Corporation of Nigeria (AMCON) on Wednesday took over the palatial mansion of Abdulfatah Ahmed, the former governor of Kwara State, over an alleged staggering indebtedness of nearly N5 billion.\nAMCON said in a statement Wednesday that the action followed the order of Justice A.M. Liman of the Federal High Court, Lagos Division.\nJude Nwauzor, Head, Corporate Communications Department of the government debt recovery agency, described the enforcement as successful.\n“All efforts to peacefully resolve the loan had been frustrated by the former Governor who remained recalcitrant, which left AMCON no other choice than to seek justice in court.\n9 Wharf, Apapa, Lagos; Plot 3632, Cadastral Zone E27 of Apo, Abuja; Plot 4115, Cadastral Zone F14 of Bazango, Abuja; Plot 8502, Cadastral Zone E31 of Carraway Dallas, Abuja; Plot 494, Cadastral Zone E31 of Carraway Dallas, Abuja; Plot 719, Cadastral Zone E23 of Kyami, Abuja; and any other landed property in any place that may be found within the Federal Republic of Nigeria"
  },
  {
    "headline": "Nigeria’s imports increased by 1.07% in Q2 2021 – NBS",
    "summarized_story": "Latest report from the National Bureau of Statistics (NBS) shows that Nigeria’s all-commodity group import index grew marginally by 1.07 per cent in the second quarter (Q2) of 2021.\n“This was offset by a decrease in the prices of live animals, animal products (-0.17 per cent), animal and vegetable fats and oils and cleavage (-0.23 per cent) and mineral products (-0.27 per cent),” the report said.\nOthers are plastic rubber and articles (0.85 per cent) and mineral products (0.74 per cent).\nThe NBS explained that the Terms of Trade (TOT) represents the ratio between a country’s export prices and its import prices.\n“The ratio is calculated by dividing the price of the exports by the price of the imports, usually in percentage terms."
  },
  {
    "headline": "IPOB threatens one month sit-at-home protest in Southeast",
    "summarized_story": "Separatist group, the Indigenous People of Biafra (IPOB) has threatened a one-month sit-at-home protest in Southeast if its leader, Nnamdi Kanu, is not brought to court on October 21.\nAccording to him, IPOB got from a reliable source that the Department of State Services would not bring Kanu to court on October 21 as a ploy to continue to incarcerate him.\n“The Federal Government of Nigeria has again perfected plans not to bring him to court on that day.\nIf by October 21, Kanu is not brought to court, Nigeria will know that Kanu commands the unflinching loyalty of over 60 million Biafrans home and in Diaspora.\n“Their plan is to silence agitations for freedom as championed by Nnamdi Kanu and Sunday Ighoho so that the Fulani from across Africa will overrun Nigeria."
  },
  {
    "headline": "Lagos Senator Blames Nigeria’s Debt Burden On Past Military, PDP Govts",
    "summarized_story": "It is not a borrowing of this administration alone, it is a borrowing that stems from the days of the military to the days when the Democratic dispensation started.\n“It is an accumulated loan, it is not a loan that says that it is the current administration of President Buhari that has borrowed.\n“It is a loan that has been borrowed by the previous administration – the Obasanjo, the Jonathan, the Yar’Adua of this world.\nAnd that is where we are.”The Senate President, Ahmad Lawan, in his concluding remarks blamed Nigeria’s economic predicament on the failure of past governments to prioritize the provision of critical infrastructure.\n“[And] that is why we have more resources today, more revenues or funds in the Independent Revenue Contribution."
  },
  {
    "headline": "Lagos Senator Blames Nigeria’s Debt Burden On Past Military, PDP Govts",
    "summarized_story": "It is not a borrowing of this administration alone, it is a borrowing that stems from the days of the military to the days when the Democratic dispensation started.\n“It is an accumulated loan, it is not a loan that says that it is the current administration of President Buhari that has borrowed.\n“It is a loan that has been borrowed by the previous administration – the Obasanjo, the Jonathan, the Yar’Adua of this world.\nAnd that is where we are.”The Senate President, Ahmad Lawan, in his concluding remarks blamed Nigeria’s economic predicament on the failure of past governments to prioritize the provision of critical infrastructure.\n“[And] that is why we have more resources today, more revenues or funds in the Independent Revenue Contribution."
  },
  {
    "headline": "#EndSARS: Senate Expresses Shock At Level Of Destruction In Cross River",
    "summarized_story": "Led by its chairman, Senator Ibrahim Gobir, the committee expressed shock and sadness at the level of destruction of both public and private properties in the state.\nHe said, “We have people on video while destroying saying: ‘Let’s see how Cross River will be boasting about their Tinapa, let’s see how they will be talking of this Industrial park’.\nTruly, the highest destruction in the whole country was in Cross River, as most of our assets including our piles and pylon factory which you could not go because it is in far away Akamkpa were destroyed.\n“What happened in Cross River State during the #EndSARS was something I will say was not natural because when the protest started across the country, Calabar and indeed, Cross River was totally at peace.”The governor continued: “I therefore, took proactive steps by putting out a broadcast offering scholarships to all indigenes of the state in the Cross River State University of Technology, including announcing massive programs of incentives.\nI spoke to the youths, encouraged them to be cautious that Cross River State was the state with the least federal allocation."
  },
  {
    "headline": "#EndSARS: Senate Expresses Shock At Level Of Destruction In Cross River",
    "summarized_story": "Led by its chairman, Senator Ibrahim Gobir, the committee expressed shock and sadness at the level of destruction of both public and private properties in the state.\nHe said, “We have people on video while destroying saying: ‘Let’s see how Cross River will be boasting about their Tinapa, let’s see how they will be talking of this Industrial park’.\nTruly, the highest destruction in the whole country was in Cross River, as most of our assets including our piles and pylon factory which you could not go because it is in far away Akamkpa were destroyed.\n“What happened in Cross River State during the #EndSARS was something I will say was not natural because when the protest started across the country, Calabar and indeed, Cross River was totally at peace.”The governor continued: “I therefore, took proactive steps by putting out a broadcast offering scholarships to all indigenes of the state in the Cross River State University of Technology, including announcing massive programs of incentives.\nI spoke to the youths, encouraged them to be cautious that Cross River State was the state with the least federal allocation."
  },
  {
    "headline": "Senate Okays 2022-2024 MTEF/FSP, N13.98trn Budget Projection For 2022",
    "summarized_story": "The Senate has passed the 2022-2024 Medium Term Expenditure Framework and Fiscal Strategy Paper (MTEF/FSP) ahead of the expected presentation of the 2022 Appropriations bill to the National Assembly by President Muhammadu Buhari.\nThe Joint Committee report was presented by Senator Solomon Olamilekan Adeola (APC, Lagos West), who chairs the Finance Committee.\nThe chamber during consideration of the report gave its nod to the Federal Government’s revenue projection of N8.36 trillion; and proposed expenditure of N13.98 trillion.\nIn addition, the chamber approved fiscal deficit of N5.62 trillion; new borrowings of N4.89 trillion – an amount which includes Foreign and Domestic borrowing – subject to the provision of details of the borrowing plan to the National Assembly.\nIt also recommended that the Federal Government budget be reviewed and purged of some agencies with demonstrated capacity to stand on their own without any recourse to Federal Government of Nigeria budget."
  },
  {
    "headline": "Alleged N5bn debt: AMCON seizes mansion of ex-Kwara Governor, Ahmed",
    "summarized_story": "The Asset Management Corporation of Nigeria says it has seized a mansion in Ilorin belonging to the immediate past Governor of Kwara State, Abdulfatah Ahmed, over his alleged indebtedness to the tune of N5bn.\n9 Wharf, Apapa, Lagos; Plot 3632, Cadastral Zone E27 of Apo, Abuja; Plot 4115, Cadastral Zone F14 of Bazango, Abuja; Plot 8502, Cadastral Zone E31 of Carraway Dallas, Abuja; and Plot 494, Cadastral Zone E31 of Carraway Dallas, Abuja.\nAMCON said this in a statement on Wednesday titled, ‘N5bn Debt: AMCON Takes over Mansion of Governor, Abdulfatah Ahmed’ which was signed by its Head, Corporate Communications Department, Jude Nwauzor.\nThe agency said the seizure was sequel to an order by Justice A.M Liman of the Federal High Court, Lagos.\nThe statement read in part, “AMCON on Wednesday, September 22, 2021, in Ilorin, the Kwara State, capital took over the palatial mansion of Alhaji Abdulfatah Ahmed, the former two-time governor of Kwara State over a staggering indebtedness of nearly N5bn."
  },
  {
    "headline": "Alleged N5bn debt: AMCON seizes mansion of ex-Kwara Governor, Ahmed",
    "summarized_story": "The Asset Management Corporation of Nigeria says it has seized a mansion in Ilorin belonging to the immediate past Governor of Kwara State, Abdulfatah Ahmed, over his alleged indebtedness to the tune of N5bn.\n9 Wharf, Apapa, Lagos; Plot 3632, Cadastral Zone E27 of Apo, Abuja; Plot 4115, Cadastral Zone F14 of Bazango, Abuja; Plot 8502, Cadastral Zone E31 of Carraway Dallas, Abuja; and Plot 494, Cadastral Zone E31 of Carraway Dallas, Abuja.\nAMCON said this in a statement on Wednesday titled, ‘N5bn Debt: AMCON Takes over Mansion of Governor, Abdulfatah Ahmed’ which was signed by its Head, Corporate Communications Department, Jude Nwauzor.\nThe agency said the seizure was sequel to an order by Justice A.M Liman of the Federal High Court, Lagos.\nThe statement read in part, “AMCON on Wednesday, September 22, 2021, in Ilorin, the Kwara State, capital took over the palatial mansion of Alhaji Abdulfatah Ahmed, the former two-time governor of Kwara State over a staggering indebtedness of nearly N5bn."
  },
  {
    "headline": "Research reveals 90,000 Anambra children out of school",
    "summarized_story": "A RESEARCH conducted by Evidence and Collaboration for Inclusive Development, ECID, a nongovernmental organization, has revealed that no fewer than 90,000 children are out of school in Anambra State.\nECID, which is funded by the UKaid from the United Kingdom government and implemented by the Christian Aid, has been operating in Kaduna and Anambra State since September 2018.\nAccording to him, although there is free education policy in Anambra State, many parents claimed they were paying fees for their wards, especially at the secondary school level.\nNwosu said: “It is quite worrisome because based on official statistics Anambra is one of the educationally advantaged states in the country.\nIt is more worrying when you go into the field and see the wide gap existing between the rural and urban locations."
  },
  {
    "headline": "Research reveals 90,000 Anambra children out of school",
    "summarized_story": "A RESEARCH conducted by Evidence and Collaboration for Inclusive Development, ECID, a nongovernmental organization, has revealed that no fewer than 90,000 children are out of school in Anambra State.\nECID, which is funded by the UKaid from the United Kingdom government and implemented by the Christian Aid, has been operating in Kaduna and Anambra State since September 2018.\nAccording to him, although there is free education policy in Anambra State, many parents claimed they were paying fees for their wards, especially at the secondary school level.\nNwosu said: “It is quite worrisome because based on official statistics Anambra is one of the educationally advantaged states in the country.\nIt is more worrying when you go into the field and see the wide gap existing between the rural and urban locations."
  },
  {
    "headline": "REVEALED: Five Houses In Abuja, Two In Lagos… Abdulfatah’s Other Properties Marked For Seizure",
    "summarized_story": "On Wednesday, the Assets Management Corporation of Nigeria (AMCON) seized some houses belonging to former Governor Abdulfattah Ahmed of Kwara State over a N5 billion debt.\nThere are several houses in the property located at No.\nHe said all efforts to recover the debt from the former governor proved abortive until the corporation got justice in court.\nJustice A.M. Liman ordered the freezing of the bank accounts of the former governor and his two companies including Trans Properties and Investment Limited and Trans It Consulting Limited in Suit No: FHC/L/AMC/01/2021.\nBelow are other properties listed for seizure:LAGOSNo 13, Alhaji Masha Road, SurulereABUJAPlot 3632, Cadastral Zone E27 of ApoPlot 4115, Cadastral Zone F14 of BazangoPlot 8502, Cadastral Zone E31 of Carraway DallasPlot 494, Cadastral Zone E31 of Carraway DallasPlot 719, Cadastral Zone E23 of Kyami, Abuja"
  },
  {
    "headline": "Reps To Probe Alleged Exclusion Of Rivers State From Loan Projects",
    "summarized_story": "The House of Representatives has decided to look into the purported exclusion of Rivers State from the pool of states eligible for international bank loans.\nThe governor also claimed that River State was left out of the initial list of states set to benefit.\nSolomon Bob of Rivers State moved a motion for a probe into the claim at Wednesday’s plenary session.\nPresident Muhammadu Buhari has submitted a loan request to the National Assembly for approval of a $4 billion and €710 million external loan.\nThe legislator from Rivers, however, refused to withdraw his support, instead amending the request to declare that if Rivers State is the sole state exempted, it should be added."
  },
  {
    "headline": "Nigeria Scraps DPR, PPPRA, Names New Oil Regulators, Mgt, Boards",
    "summarized_story": "The President signed the Act into law last month, creating the Nigerian Upstream Regulatory Commission (NURC), which will take over most of the upstream regulatory functions of the Department of Petroleum Resources, so replacing DPR as a primary regulator.\nThe PIA also calls for the establishment of the Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA), which will be in charge of overseeing the country’s midstream and downstream petroleum operations.\nThe PIA also provides for the establishment of the Commission to oversee the regulation of upstream petroleum operations in the country.\nThe Commission will also take over the current functions of the Department for Petroleum Resources (DPR), with respect to the regulation of technical, operational, commercial and environmental activities associated with upstream petroleum operations.\nFor the Authority, the PIA provides that it would regulate the midstream and downstream petroleum operations in the country."
  },
  {
    "headline": "Electoral Amendment Bill: Lawan Constitutes Conference Committee",
    "summarized_story": "Dr. Ahmad Ibrahim Lawan, Senate President, has formed a Conference Committee for the 2021 Electoral Act Amendment Bill, which was signed into law a few weeks before MPs left for their two-month annual recess.\nThe bill’s upper and lower legislative chambers passed distinct versions, necessitating a harmonisation before it could be delivered to President Buhari for signature.\nSenator Abdulahi Yahaya, the Senate leader, is the Chairman of the Committee, which was formed on Wednesday.\nThe Senate approved the bill into law on July 15 despite controversy about section 52 of the bill, according to the DAILY POST.\nThe modified article 52(3), which needs the Nigeria Communications Commission’s approval on the adequacy of the network to determine electronic voting, has sparked debate in both the upper and lower legislative chambers."
  },
  {
    "headline": "Breaking: DSS raids, arrests railway vandals, thieves in Jos (Pictures)",
    "summarized_story": "The Plateau state command of the Department of Security Services (DSS) on Wednesday raided vandals and thieves of railway property.\nThe DSS according to its deputy director operations Garba Audu, a retired police inspector, was first arrested Tuesday night driving a vehicle with items and further investigation led to raiding of their stores at Bukuru in Jos South local government area of Plateau state.\nHe said items recovered were six trucks of railways, 18 roles of electrical cables.\n“The retired police inspector Garba Audu, and five others have been arrested.\nThe unit manager of the Bukuru railway station was also arrested,” he said."
  },
  {
    "headline": "Breaking: Uneasy calm as fire guts Nigeria Port Authority headquarters",
    "summarized_story": "Fire on Wednesday morning threatened the activities of the Nigerian Ports Authority (NPA) headquarters at a wing of its operational base located at Marina office in Lagos state.\n“Operatives of the NPA Fire Service Department immediately mobilised to the scene and promptly contained the fire.\n“In line with safety protocols, the affected floor has since been cordoned off and investigations are ongoing to ascertain the actual cause of the fire.\n“The fire affected one office where two desk tops, tables, chairs and other furniture were lost.\nTwo other adjoining offices were affected by smoke.”"
  },
  {
    "headline": "Breaking: Newly appointed Emir is dead",
    "summarized_story": "The emir of Gaya, Alhaji Ibrahim Abdulkadir, has died at the age of 93 after a protracted illnessBlueprint findings revealed that the monarch has been indisposed since his appointment as the new emir of Gaya following the creation of four additional emirates in Kano dtate by governor Abdullahi Umar Ganduje.\nThe late Abdulkadir remained out of sight for the last few months, as he always sent a representative to hold brief for him at every function where the presence of emirs were needed.\nAs at the time of filing this report, his remains were yet to be committed to mother earth as people were left anxious waiting at his palace in Gaya to catch a glimpse of his corpse and the eventual performance of the funeral rites.\nA serving presidential aide Bashir Ahmad has also confirmed his demise via his Facebook page on Wednesday."
  },
  {
    "headline": "How Felistas Foundation supports indigent students -NigPilot",
    "summarized_story": "According to sociological findings, society is divided into three groupings, vis vis “Upper class”, “Middle class,” and “Lower class”.\nThe upper class according to scholars is divided into, upper and upper-lower while the lower class also has upper lower and lower-lower.\nHowever, while the super-rich are now enjoying the status hitherto enjoyed by the only middle class, the lower class still maintain its original stratification of uper lower and lower lower, while the middle class has fizzled away.\nIt is nonetheless, instructive to explain the sociological concept uper lower and lower lower.\nUnfortunately, those that fall within the lower lower strata are more or less confined to the circle of poverty as the status of poverty is automatic to them by birth."
  },
  {
    "headline": "2023: We want sovereignity not Igbo President- MASSOB -NigPilot",
    "summarized_story": "The Chief Ralph Uwazuruike-led Movement for Actualization of Sovereign State of Biafra (MASSOB), has said that the interest of Ndigbo, for now, is how to actualize a sovereign state of Biafra and not 2023 Igbo PresidentThe Anambra East MASSOB leader, Elder Nwaorah Dennis, while fielding questions from newsmen on Igbo Presidency.\nAccording to him, “it is Biafran sovereignity that we want to actualize through non violence approach and not 2023 Igbo Presidency for Ndigbo.\nHe said the non violent approach was worthy ofemulation instead of use of violence in actualizing a sovereign state.\nIf we now agree to have the 2023 presidential slot the North will object.\nHe concluded that Ndigbo aspiring to be the president of Nigeria in 2023 are just wasting their time."
  },
  {
    "headline": "How selfishness, solidarity breed coup in W/Africa -NigPilot",
    "summarized_story": "The Economic Community of West African States (ECOWAS), has been playing outreach with its double standard on the issue under scrutiny.\nThe Authority said that consolidation of democracy and good governance is crucial for the development, peace and stability of the ECOWAS region.\nIt further expressed greatconcern about its consequences on the deterioration of the security situation inMali and the region as a whole.\nThe Authority reiterates its unreserved condemnation of the coup of 5September 2021 and reaffirms its demand for the immediate and unconditionalrelease of President Alpha Conde.\nIssuing of threats and sanctions on military junta by the regional and sub regional bodies are mere rain that washes the stone."
  },
  {
    "headline": "World Peace Day: stakeholders calls for strategies to resolve conflict -NigPilot",
    "summarized_story": "As the world celebrates International Peace Day 2021 , stakeholders in the peacebuilding environment have called for workable strategies that would help resolve violent conflict in the country.\nInternational Day of Peace is observed across the world on September 21 every year.\nThe UN General Assembly declared this as a day devoted to making the ideals of peace robust.\nThe DG also explained that the international day of peace is the United Nations UN day declared all over the world, that this particular day is a day of the ceasefire, where ever there is conflict, where ever there is war.\nHe concluded that the High Command of the Nigerian Army is prioritizing the welfare of troops."
  },
  {
    "headline": "FEC Approves ₦836m For COVID-19 Oxygen Plants Nationwide",
    "summarized_story": "﻿The Federal Executive Council (FEC) has approved ₦836 million for the establishment of oxygen production plants for COVID-19 pandemic intervention across the country.\nBriefing State House reporters after the weekly FEC meeting on Wednesday, the Minister of Information and Culture, Lai Mohammed, said the approval of the upward review followed a memo presented by the Minister of Health, Dr Osagie Ehanire to the council.\n“The Minister of Health also presented a memo seeking for an upward review for the emergency supply, installation and maintenance of the 38 oxygen plants all over the country,” Mohammed said.\n“You will remember in June, the Federal Executive Council, actually approved the sum of ₦5.615 billion to four major contractors for the emergency supply, installation and maintenance of 38 oxygen plants in various parts of the country.\nHe added, “The Bagwai Water Dam Irrigation project in Bagwai Local Government Area of Kano State was commenced; the initial contract was awarded in 2005."
  },
  {
    "headline": "Mob Razes Sokoto Commissioner’s Home, Destroys District Head’s Properties",
    "summarized_story": "A mob has razed the residence of the Sokoto State Commissioner of Career and Security Affairs, Colonel Garba Moyi.\nThe house, located in Isa Local Government Area of the North West State, was burned down on Tuesday.\nSokoto Police Command Public Relations Officer Sanusi Abubakar confirmed the attack on Wednesday, explaining that arrests have also been made following the incident.\nMeanwhile, the Sokoto State Commissioner of Police Kamaludeen Okunola has ordered a full scale investigation to ensure those involved are prosecuted.\nHe also warned residents of the state against taking laws into their hands."
  },
  {
    "headline": "Stolen Funds: FG Moves To Recover £200m Stashed In The United States",
    "summarized_story": "﻿The Federal Government has said it would recover 200 million pounds stashed in the United States, as it embarks on a massive recovery of assets belonging to the country.\nThis is according to the Attorney-General of the Federation, Abubakar Malami who was speaking on the sidelines of the United Nations General Assembly in New York.\nREAD ALSO: Buhari Asks Senate To Amend PIA Over ‘Unbalanced Geographical Representation’, Others“We are pursuing a lot of assets across the globe and then we intend to coordinate further meetings relating to recovery in the United Kingdom which is associated with certain personalities”.\nThe AGF said he would not like to further disclose the strategy the federal government will use in making the recovery, but noted that the “government is trying to gather international momentum associated with the processes and procedures, in terms of making things easier for countries to recover assets with ease”.\nHe added that the government is fully committed to its anti-corruption campaign and by extension spreading its dragnet to those who are in the custody of laundered or stolen funds."
  },
  {
    "headline": "Electronic Transmission Of Results: Senate Sets Up Conference Committee On Electoral District",
    "summarized_story": "The Senate on Wednesday set up a 7-member conference committee during plenary, with intent to harmonise positions between it and the House of Representatives on Electronic Transmission of election results.\nEarlier in the year, both chambers passed the bill for third readings, however, the 2010 Electoral Act [Amendment] Bill 2021, differed on provisions of clause 52[3] which deals with electronic transmission of election results.\nREAD ALSO: Wike Slams Critics Over VAT Collection DisputeWith this discrepancy in focus, the Senate President, Ahmad Lawan, in line with legislative practices and procedures announced the 7-man conference committee before the commencement of plenary on Wednesday.\nLegislators selected include:Senator Yahaya Abdullahi ( APC Kebbi North); Kabiru Gaya (APC Kano South); Ajibola Basiru (APC Osun Central); Danjuma Goje (APC Gombe Central).\nOthers are, Uche Ekwunife (PDP Anambra Central); Sani Musa (APC Niger East); and Mathew Urhoghide (PDP Edo South)."
  },
  {
    "headline": "Man Utd Crash Out Of League Cup, Spurs, Chelsea And Arsenal Advance",
    "summarized_story": "But David Moyes’ men got a measure of revenge three days later as Manuel Lanzini’s first half goal dumped United out in the third round.\nRyan Fredericks ghosted past Alex Telles and cut back for Lanzini to sweep past United goalkeeper Dean Henderson in the ninth minute.\nDaniel Podence levelled 13 minutes into the second half from Dendoncker’s pass.\nEmile Smith-Rowe doubled the lead in the 77th minute and Eddie Nketiah’s impudent flick wrapped up the win three minutes later.\nLookman, making his maiden Leicester start following his loan move from RB Leipzig, netted five minutes into the second half with a cool strike after Kelechi Iheanacho’s effort was saved by George Long."
  },
  {
    "headline": "Governor Umahi inaugurates new leadership of S/east traditional rulers",
    "summarized_story": "Governor of Ebonyi State and Chairman, South East Governors’ Forum David Nweze Umahi has inaugurated new Leadership of the South East Council of the Traditional Rulers.\nGovernor Umahi congratulated the Chairman of the South East Traditional Rulers Council and other Council members.\nGovernor Umahi also urged the incoming Chairman of the South East Traditional Rulers Council, Eze Charles Mkpuma, to continue to serve Ndigbo with humility and patriotism.\nHe expressed hope that with the ingenuity of the new Chairman of the South East Council of Traditional Rulers Council, Eze Charles Mkpuma, the South East would be coasting to enduring peace.\nThe inauguration was attended by Traditional Rulers from the five States of South East and other Stakeholders of Ndigbo."
  },
  {
    "headline": "Senate sets up conference committee on amendment of electoral act",
    "summarized_story": "The Senate has formed a Conference Committee to harmonise positions on the Electoral Act Amendment Bill and to reach a consensus.\nPresident of the Senate, Senator Ahmad Lawan made the announcement at Wednesday’s plenary.\nSenator Lawan stated that the Conference Committee will work with the House of Representatives to ensure that everyone is on the same page regarding the Independent National Electoral Commission’s (INEC) electronic transmission of results.\nThe Senate Leader, Senator Yahaya Abdullahi representing Kebbi North will lead the team.\nOther members are Senators Kabiru Gaya, APC, Kano South to represent North West; Danjuma Goje, APC, Gombe Central for North East; Uche Ekwunife, PDP, Anambra Central for South East; Sani Mohammed Musa, APC, Niger East for North Central; Ajibola Basiru, APC, Osun Central for South West and Matthew Urhoghide, PDP, Edo South."
  },
  {
    "headline": "IBBU tuition fees hike: Students protest, barricade entrance of Niger State House of Assembly",
    "summarized_story": "Students of the Ibrahim Badamasi Babangida University, Lapai, have barricaded the entrance to the Niger state House of Assembly in protest of a recent increase in their tuition fees.\nThe school has commenced a new session, however due to the increase, the majority of students are unable to register.\nBefore the increment, returning students of Niger state origin paid N27,800 while new students paid N52,500.\nStudents from other states, on the other hand, paid 55,000 as returning students and new students paid N93,000.\nHowever, new students from Niger state will pay 95,000 naira, while returning students will pay 50,000 naira, as a result of the latest hike."
  },
  {
    "headline": "Alleged N1.4bn oil subsidy fraud: EFCC's chairman, Abdulrasheed Bawa testifies in court",
    "summarized_story": "The resumed trial of Abubakar Ali Peters and his company, Nadabo Energy Limited, over an alleged N1.4 billion oil fraud, is underway before Justice Sedoton Ogunsanya of the Lagos State High Court, Ikeja.\nMr. Bawa told the court that the team found that the defendant falsified the volume of petrol that he imported into the country, using forged documents.\n“He claimed to have imported about 12,000 metric tonnes of PMS, while our investigation revealed that he imported about 6,000 metric tonnes of PMS.\nWe wrote to the Petroleum Products Price and Regulatory Agency (PPPRA), asking them to re-compute the actual payment to the defendant.\nThe judge overruled his objections, ruling that the documents were properly obtained during the course of its investigation."
  },
  {
    "headline": "France’s Envoy to Return to US after Talks Between Macron and Biden",
    "summarized_story": "Macron and Biden will meet at the end of October in Europe, the statement said.\nIn an unprecedented move, France recalled its ambassador after the U.S., Australia and Britain announced a new Indo-Pacific defense deal last week.\nThe French ambassador will “have intensive work with senior U.S. officials” after his return to the United States, the statement said.\nEarlier Wednesday, Macron’s office said the French president was expecting “clarifications and clear commitments” from Biden, who had requested the call.\nFrench officials described as a “crisis of trust” last week’s announcement of the Indo-Pacific deal, with Macron being formally informed only a few hours beforehand."
  },
  {
    "headline": "Pat Utomi: Nigeria Runs the Risk of Another Debt Trap if It Doesn’t Stop Borrowing",
    "summarized_story": "Prof Pat Utomi, a political economist, academician and former presidential candidate joined the Morning Show on Wednesday to discuss the structural adjustments Nigeria’s fiscal and monetary authorities will have to make to revive the economy and address the foreign exchange crisis it finds itself in.\nWatch the interview for more…"
  },
  {
    "headline": "APC Not for All Comers, Igbokwe Says in Reaction to Fani-Kayode’s Defection",
    "summarized_story": "Joe Igbokwe, a member of the All Progressives Congress, has not hidden his distaste for Femi Fani-Kayode, a former member of the Peoples Democratic Party and former aviation minister, who decamped to the APC last week.\nReacting to the defection, Igbokwe faulted his party for accepting Fani-Kayode into its fold, saying that the former minister had no electoral value and was politically unstable.\nIgbokwe further elaborated on his position while on the Morning Show on Wednesday.\nWatch the interview for more…"
  },
  {
    "headline": "Sanusi Says Nigerians Should Stop Insulting Their Leaders – Trending with Ojy Okpe",
    "summarized_story": "Former Emir of Kano and leader of Tijjaniyya Movement in Nigeria, Lamido Sanusi, has asked Nigerians to stop insulting their leaders over the hardship faced in the country.\nMeanwhile, Minister of State for Mines and Steel Development, Uche Ogah, has accused the elite of undermining the country’s tottering economy by aiding and abetting gold smuggling and illegal mining to the tune of $9bn yearly.\nIn Nairobi Kenya, a slum named Korogocho, where women aged 60 to well over 90, meet every Thursday afternoon to practice taekwondo, in a bid to protect themselves against sexual assault, has made the rounds.\nAccording to lead trainer of the group, Jane Waithageni Kimaru, the class is so serious that late arrivals are ordered to do sit-ups and jumping jacks as punishment."
  },
  {
    "headline": "Usyk Could Be Joshua’s Toughest Test, Ex-World Champion Groves Says",
    "summarized_story": "Britain’s Anthony Joshua could face his toughest test yet when he fights Oleksandr Usyk in London on Saturday, says ex-world champion George Groves.\nJoshua, 31, puts his WBA, WBO, IBF and IBO world heavyweight titles on the line against Usyk, a former undisputed cruiserweight world champion.\n“He showed that in unifying the cruiserweight division in great fights and I believe he could be Joshua’s toughest test to date.\n“Usyk will start fast and Joshua should be cagey as Usyk is a bit lighter.\nHearn said: “I’m always nervous for an Anthony Joshua fight, especially when you’re fighting someone that really believes he is going to win."
  }
]