[
  {
    "headline": "Neurologist warns against indiscriminate use of sleeping pills",
    "summarized_story": "-Says self-medication no solution to sleeping disordersAmarachi OkehA neurologist, Prof. Ikenna Onwuekwe, has warned persons suffering from sleep disorders against the indiscriminate use of sleeping pills.\nAccording to Onwuekwe, engaging in self-medication by indiscriminately taking sleeping pills is not only a wrong way to treat sleep disorders, it could also be dangerous.\nSome sleep disorders, he said, cannot be treated with sleeping pills.\nThe neurologist explained that there are different types of sleep disorders, adding that insomnia is not a single issue because it has different facets.\nOnwuekwe advised that people who suffer from sleep disorders should see a neurologist to get optimal analyses and treatment."
  },
  {
    "headline": "Neurologist warns against indiscriminate use of sleeping pills",
    "summarized_story": "-Says self-medication no solution to sleeping disordersAmarachi OkehA neurologist, Prof. Ikenna Onwuekwe, has warned persons suffering from sleep disorders against the indiscriminate use of sleeping pills.\nAccording to Onwuekwe, engaging in self-medication by indiscriminately taking sleeping pills is not only a wrong way to treat sleep disorders, it could also be dangerous.\nSome sleep disorders, he said, cannot be treated with sleeping pills.\nThe neurologist explained that there are different types of sleep disorders, adding that insomnia is not a single issue because it has different facets.\nOnwuekwe advised that people who suffer from sleep disorders should see a neurologist to get optimal analyses and treatment."
  },
  {
    "headline": "‘People working night shift more at risk of heart problems’",
    "summarized_story": "Angela OnwuzooA study by the European Society of Cardiology has found that people who work the night shift are at increased risk of developing heart problems.\nThe study revealed that people who work the night shift are at increased risk of developing irregular and often abnormally fast heart rhythm called atrial fibrillation.\n“Among participants currently working night shifts, or working night shifts for 10 or more years, or working a lifetime of three to eight night shifts a month, the risk of coronary heart disease increased by 22 per cent, 37 percent and 35 per cent respectively compared to daytime workers,” the researchers noted.\n“Thus, women and less physically active people may benefit particularly from a reduction in night shift work”, Prof. Qi said.\nAn earlier 2021 study by Washington State University gave insight into the risk of night shift work, revealing that night shift workers are at increased risk of developing certain types of cancer compared to those who work regular daytime hours."
  },
  {
    "headline": "‘People working night shift more at risk of heart problems’",
    "summarized_story": "Angela OnwuzooA study by the European Society of Cardiology has found that people who work the night shift are at increased risk of developing heart problems.\nThe study revealed that people who work the night shift are at increased risk of developing irregular and often abnormally fast heart rhythm called atrial fibrillation.\n“Among participants currently working night shifts, or working night shifts for 10 or more years, or working a lifetime of three to eight night shifts a month, the risk of coronary heart disease increased by 22 per cent, 37 percent and 35 per cent respectively compared to daytime workers,” the researchers noted.\n“Thus, women and less physically active people may benefit particularly from a reduction in night shift work”, Prof. Qi said.\nAn earlier 2021 study by Washington State University gave insight into the risk of night shift work, revealing that night shift workers are at increased risk of developing certain types of cancer compared to those who work regular daytime hours."
  },
  {
    "headline": "PIA: Buhari appoints Sylva to head implementation committee",
    "summarized_story": "President Muhammadu BuhariBy Johnbosco AgbakwuruPresident Muhammadu Buhari on Wednesday, approved implementation committee headed by the Minister of state on petroleum, Chief Timipre Sylva, to immediately commence implementation of the Petroleum Industry Act in 12 months.\nHe charged other ministries and departments of agencies to work with the minister of state for petroleum towards successful completion of the implementation process.\nHe said the new act will coordinate the activities of the NNPC and reposition it for further progress.\nThe President of the Senate said he was equally confident that the PIA will further incentivize greater investment in the sector.\nRecall that the Minister of state for petroleum had earlier reiterated that the country’s oil reserves in the last 10 years has remained at 37 million barrels."
  },
  {
    "headline": "FCT Police denies alleged Kidnap incident along Zuba-Deidei axis",
    "summarized_story": "**Enjoins residents to shun fake newsBy: Kingsley Omonobi- Abuja.\nOn Wednesday, the Police Command of the Federal Capital Territory debunked a viral message in some sections of the social media purporting that ” a Community Chief got kidnapped close to Mopol 45 along Dei-Dei/Zuba axis”.\nA statement by ASP Yusuf Mariam, Public Relations Officer said, “The Command wants to state categorically that there is no record of such incident as at 22.30hrs (8.30 pm) of Tuesday 17th August 2021 in the FCT.\n“However, the Command enjoins members of the public to cooperate with the Police and other security agencies by providing prompt and useful information rather than circulate fake news capable of causing undue panic amongst the well-spirited residents of the FCT“On this note, we wish to reaffirm our resolve towards the provision of adequate security within the Federal Capital Territory.\n“The Command further implores residents to report all suspicious movements, emergency or distress, through these numbers: 08032003913, 08061581938, 07057337653,08028940883 and to report the conduct of Police Officers, call the Public Complaint Bureau (PCB) number: 09022222352”Vanguard News Nigeria"
  },
  {
    "headline": "Petroleum Industry Act: Buhari appoints Sylva to head implementation steering C’ttee",
    "summarized_story": "By Johnbosco AgbakwuruPRESIDENT Muhammadu Buhari has approved a steering committee to oversee the commencement of implementation of the newly signed Petroleum Industry Act, PIA.\nThe steering committee is headed by the Minister of State, Petroleum Resources, Chief Timipre Sylva.\nThis was contained in a statement issued on Wednesday by the Special Adviser to the President on Media and Publicity, Chief Femi Adesina.\nRecall that President Buhari had on Monday signed the Petroleum Industry Bill, PIB, into law.\nVanguard News Nigeria"
  },
  {
    "headline": "We’re not safe again, Oyo female farmers cry out over rape of aged women by herdsmen",
    "summarized_story": "By Adeola Badru – IbadanFemale farmers in Oyo State who are members of the All Farmers Association of Nigeria, AFAN, have cried out over the alleged rape of aged female farmers by some herdsmen in the state.\nWhile speaking with Vanguard on Wednesday morning, one of the female farmers in Iseyin Local Government Area of the state, Kadijat Odunola, warned the suspected Fulani herders to stop sexually molesting their female farmers.\nShe said: “Our people have spoken but I want to talk about rape of older women by young suspected Fulani herders.\nSome of them would meet female farmers in the bush and rape them.\nHe said everything must be done to ensure peaceful coexistence between farmers and herders because both were into food production."
  },
  {
    "headline": "Angry youths protest killing of 17-yr-old boy by Amotekun Corps in Ibadan",
    "summarized_story": "Barricade state SecretariatBy Adeola Badru – IbadanScene of protest in Ibadan after Amotekun Corp reportedly killed teenagerAggrieved youths in their hundreds on Wednesday morning, protested in front of the state secretariat, Agodi, over the alleged killing of a 17- year-old boy named Opeyemi by an Amotekun corp at Mokola area in Ibadan.\nThe aggrieved youths blocked all the linking roads around the secretariat main gate thereby disrupting human and vehicular movements.\nThe youths were seen carrying the corpse of the victim on the roof of a tricycle and calling on Governor Seyi Makinde to fish out the killer Amotekun corp.\nAccording to an interview with one of the protesters, the said boy was mistaken for an armed robber when he was shot.\nAll the gates leading into the state secretariat are under lock as the protest still continues as of the time of filing this report."
  },
  {
    "headline": "Taliban takeover: Manchester, Liverpool to welcome Afghanistan refugees",
    "summarized_story": "The mayors of Greater Manchester, Andy Burnham; and the Liverpool City region, Steve Rotheram, have said they will welcome refugees from Afghanistan but that those fleeing persecution must be fairly distributed around the country.\nRecall that Afghanistan was plunged into turmoil after the Taliban took over the country, invaded Kabul, the nation’s capital and occupied the Presidency.\nThis happened after the United States of America pulled out its military after spending about two decades in the war ravaged country.\nReacting to the development, Burnham told Radio 4’s Today programme on Wednesday: “We of course – as always – stand ready to help and to welcome people here who need our help, but it does need to be fair to places like Greater Manchester.\n“Ultimately, the decision rests at a national level with Boris Johnson and Priti Patel who must provide support, but my message is clear: refugees are welcome in our city region.”"
  },
  {
    "headline": "Buhari approves steering committee on Petroleum Industry Act",
    "summarized_story": "President Muhammadu Buhari has approved a steering committee to oversee the process of the newly signed Petroleum Industry Act (PIA).\nThe development was disclosed in a statement issued on Wednesday by the Special Adviser to the President on Media and Publicity, Femi Adesina.\nAccording to the statement, the steering committee is headed by Timipre Sylva, Minister of State, Petroleum Resources.\nAdesina revealed that the primary responsibility of the approved committee would be to ensure the effective and timely implementation of the PIA which was signed into law on Monday.\nAdesina noted that the committee has been given a 12 months duration for the assignment, stating that periodic updates will be given by the president."
  },
  {
    "headline": "Flood displaces 2000 people in Adamawa – SEMA",
    "summarized_story": "The Adamawa State Emergency Management Agency (ADSEMA) has said that about 2000 people have been affected by floods in the state within just a week.\nAccording to him, the people were displaced by heavy downpour on Tuesday, which caused serious damages to farmlands and houses in the affected communities.\n“In less than a week, the agency has recorded two heavy floods where about 227 houses, 300 farmlands and over 2,000 people were affected in the state,” he said.\nHe stated that the agency and other sister organisations were working to offer assistance to the affected communities.\n7 persons dead, 5,000 displaced after Boko Haram attack on Adamawa community – ADSEMA"
  },
  {
    "headline": "Iniubong Umoren: Court adjourns case for accelerated hearing",
    "summarized_story": "The Akwa Ibom State High Court sitting in Uyo has adjourned the case of Uduak Akpan, the suspected murderer of Iniubong Umoren, for accelerated hearing from November, 1,2, 4,10, 11, 15, 16 and five days in December.\nThe presiding judge, Justice Bennett Illamoh, also struck out the application for bail for the second accused, Frank Akpan, who is the father of Uduak Akpan, the first accused, saying that the application came on summon rather than motion.\nDetails later…"
  },
  {
    "headline": "Nigeria excluded as UAE approves 70 countries for visa-on-arrival",
    "summarized_story": "Nigeria has been excluded from a list of countries whose citizens are eligible to obtain visa-on-arrival in the United Arab Emirates, UAE.\nEtihad Airways on Wednesday released a list of countries whose travellers landing at Abu Dhabi airport can receive visas from its immigration desks.\nCountries such as the U.S., China, Maldives, France, and Russia made the top of the list.\nAfrican countries like Seychelles and Mauritius were equally included in the list while Nigeria and South Africa were excludedIt also stated that visitors who had been in Nigeria or South Africa in the preceding 14 days before travel will not be allowed to enter the UAE.\nRecall that the UAE had earlier announced an indefinite suspension of flights from Nigeria to Dubai."
  },
  {
    "headline": "Suspected herdsmen allegedly kill five in fresh Plateau clash",
    "summarized_story": "Despite the dusk-to-dawn curfew imposed on Bassa and other two Local Government Areas, suspected herdsmen on Tuesday night killed five persons in Chando-Zrrechi (Tafi-Gana) of Miango District in Bassa Plateau State.\nConfirming the incident to reporters in Jos, Danjuma Auta Dicson, Secretary General of the Irigwe Development Association said: “Last night 17th August 2021, one of our villages, Chando-Zrrechi (Tafi-Gana) was attacked last night by herdsmen.\n” Five people confirmed dead so far at Tafi Gana village of Miango District Irigwe Chiefdom.”ADVERTISEMENTHe added the deceased were aside from another son of Irigwe killed at Dong village on August 16, 2021.\nThe community leader called on security operatives and government to put a stop to the killings.\nHe warned the people will consider the killings “as ethnic cleansing.”Calls by The Nation to Plateau Police spokesman ASP."
  },
  {
    "headline": "BREAKING: UNILAG resumes for physical exams",
    "summarized_story": "The University of Lagos (UNILAG) has recalled students to take their second semester examinations between August 26 and September 26, 2021.\nThe institution has made a staggered arrangement for students with registered bed spaces to resume in the hostels from August 9, 2021.\nParts of the statement read:”The University has also approved the commencement of the second semester examinations to hold physically from Thursday, 26th August, 2021.\n“500 level Faculty of Law Students with allocated bed spaces should move into their hostels on Saturday, 28th August 2021 and depart on Sunday, 5th September 2021.\n(minimum of 500ml).present at least 10 face masks.wear face mask into and out of the hostels at all times.use their allocated bed spaces."
  },
  {
    "headline": "Federal Poly Nasarawa expels 51 students",
    "summarized_story": "The Federal Polytechnic Nasarawa in Nasarawa State has expelled 51 students for examination malpractice during the 2019/2020 academic session.\nMana said that the affected students were expelled following approval by the academic board of the institution.\nREAD ALSO: Shock in Nasarawa community as car dealer commits suicide“The affected students were expelled on the ground of various offences of examination misconduct that involved both full time and part time students.\nADVERTISEMENT“The students expelled are from the Higher National Diploma and National Diploma in Engineering courses, Accounting, Science Lab Tech, Library and Information Science, Mass Communication among others,” he said.\nThe rector enjoined all students of the polytechnic to shun examination malpractice and other social vices, to strengthen the growth and development of the institution."
  },
  {
    "headline": "Criminals in Italy, Germany increasingly using cryptocurrencies",
    "summarized_story": "Criminals in Italy and Germany are increasingly making use of cryptocurrencies, according to the customs directorate in Bonn.\n“The use of cryptocurrencies for online payment in the context of criminal offences is clearly on the rise,’’ the directorate said in a statement.\nCryptocurrency is a digital payment system that doesn’t rely on banks to verify transactions.\nADVERTISEMENTCryptocurrencies were used in the context of criminal offenses to completely anonymise ordering and shipping procedures for illicit products or services.\nIn Italy, organised crime had also discovered cryptocurrencies in recent years."
  },
  {
    "headline": "BREAKING: Buhari approves committee on implementation of PIA",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari on Wednesday approved a steering committee to oversee the process of the implementation of the newly signed Petroleum Industry Act (PIA).\nThe committee headed by the Minister of State, Petroleum Resources, Timipre Sylva, has 12 months to complete its assignment.\nHe further noted that the lack of political will has hampered the growth of the industry.\nHe equally expressed confidence that the PIA will further incentivize greater investment in the sector.\nIt would be recalled that the Minister of state for petroleum had earlier reiterated that the country’s oil reserves in the last 10 years has remained at 37 million barrels."
  },
  {
    "headline": "Herdsmen kill six in Plateau villages",
    "summarized_story": "From Gyang Bere, JosSix people were reportedly killed when Fulani herdsmen unleashed terror on Chando-Zrrechi (Tafi-Gana) in Miango District of Bassa Local Government Area of Plateau State.\nSecretary General of Irigwe Development Association Danjuma Auta confirmed the incident and said it is unfortunate that the killing is coming when Plateau people are earnestly working for peace.\n‘As the Irigwe nation has continued to receive attacks from left right and centre over the unfortunate incidence of the Rukuba road attack on innocent commuters which the Irigwe nation knows nothing about, last night, 17th August 2021, one of our villages, Chando-Zrrechi (Tafi-Gana) was attacked by Fulani herdsmen.\nFive people [have been] confirmed dead so far at Tafi Gana village of Miango District Irigwe Chiefdom and one person was killed at Dong village,’ he said.\n‘We are calling on the authorities to put a stop to the evil act and If nothing is done to avert this ugly trend, Irigwe people will be wiped out.’"
  },
  {
    "headline": "Take up arms, defend yourselves against bandits –Gov Masari",
    "summarized_story": "Governor Aminu Masari has urged Katsina State citizens resident in areas prone to activities of bandits to acquire weapons and defend themselves.\nAccording to him, security is everybody’s business, pointing out that it is not the responsibility of the government alone.\n“It is the people’s meek submission that emboldens the bandits to continue with their heinous activities with murderous frequency.\n“People must divorce their minds from the mistaken notion that security is government’s sole responsibility alone,” Masari said.\nMeanwhile, the Special Task Force charged with maintaining peace in Plateau and environs has warned against any protest over the attacks on commuters in Jos on Saturday."
  },
  {
    "headline": "Poverty, inequality, mutual suspicion, endemic insecurity, disunity ravaging North –Leaders",
    "summarized_story": "From Fred Itua, AbujaLeading leaders from the three geopolitical zones in the North, yesterday, listed key challenges bedeviling the 19 northern states and the Federal Capital Territory (FCT).\nThese have manifested in the collapse of institutions and services, widespread poverty and inequality, mutual suspicion, endemic insecurity, disunity, despair and dearth of hope across the region.\n“We have no difficulty admitting all is not well with Northern Nigeria and taking primary or vicarious responsibility for the current state of affairs.\nRecent consultations with eminent political, traditional and religious leaders across the North are encouraging.\n“To bring the state of insecurity in Northern Nigeria under control, more and better collaboration among the states across the region and between the states and federal authorities is required."
  },
  {
    "headline": "Petrol price hike not automatic –Sylva",
    "summarized_story": "From Uche Usim, AbujaThe Minister of State Petroleum Resources, Mr Timipre Sylva, on Tuesday calmed frayed nerves with assurances that the signing of the Petroleum Industry Bill (PIB) by President Muhammadu Buhari, Monday, may not automatically translate to a hike in pump price of petrol (premium motor spirit).\nDaily Sun had on Tuesday reported that the signing of the PIB would translate to higher petrol price of about N270/litre, as Sylva had repeatedly said that the new law has no provision for subsidy currently being borne by the Nigerian National Petroleum Corporation (NNPC).\nThe Minister, however, revealed that the national oil company would be unbundled in the next six months as stipulated in the new law.\nHe said, “Well as you know, the Act has actually deregulated the sector but that doesn’t mean that there will be an immediate implementation of the deregulation.\nSo, we will keep it within that band (N162 – N165 per litre) for the time being”."
  },
  {
    "headline": "Breaking: Buhari Appoints Sylva as Head of 9-man Steering Committee for Implementation of Petroleum Act",
    "summarized_story": "By Deji ElumoyePresident Muhammadu Buhari on Wednesday named the Minister of State for Petroleum Resources, Timipre Sylva, to head the steering committee to oversee the implementation of the new Petroleum Industry Act.\nThis is just as the President who returned last Friday from an 18-day visit to the United Kingdom presided over the weekly virtual Federal Executive Council (FEC) meeting at the State House, Abuja.\nThe primary responsibility of the steering committee shall be to guide the effective and timely implementation of the PIA in the course of transition to the petroleum industry envisaged in the reform programme, and ensure that the new institutions created have the full capability to deliver on their mandate under the new legislation.\nThough the committee has 12 months duration for the assignment, periodic updates will be given to Mr President.\nMeanwhile, the Federal Executive Council (FEC) meeting is underway at the Conference room of the First Lady’s office with President Buhari presiding."
  },
  {
    "headline": "Buhari Set to Announce PIA Implementation Committee Today",
    "summarized_story": "The PIA which was birthed on Monday, would serve as framework for the operations in the oil and gas industry.\nThe PIA provides legal, governance, regulatory and fiscal framework for the Nigerian petroleum industry, the development of host communities, and related matters.\nOn the host communities’ fund, the minister explained that it was better to have three per cent of what the communities are sure of.\nSo, we must come together as a country, frontier and host communities,” he advised.\nIt is a good way to start, after decades of groping in the dark in the oil industry."
  },
  {
    "headline": "Like NNPC in Dangote, Saudi’s Aramco Dangles $25Bn for 20% Stake in Reliance",
    "summarized_story": "Dangote Petroleum Refinery is a 650,000 barrels per day (BPD) integrated refinery project under construction in the Lekki Free Zone near Lagos, Nigeria.\nIt is expected to be Africa’s biggest oil refinery and the world’s biggest single-train facility.\nThe Pipeline Infrastructure at the Dangote Petroleum Refinery is the largest anywhere in the world, with 1,100 kilometers to handle 3 Billion Standard Cubic Foot of gas per day.\nAramco said last week due diligence on a deal with Reliance was underway.\nBased on Aramco’s market valuation of about $1.9 trillion, a transaction would give Reliance a stake of around one per cent."
  },
  {
    "headline": "Banditry: Masari Officially Sanctions Self-help in Katsina",
    "summarized_story": "•Asks citizens to acquire weapons to defend themselves •Says security isn’t govt’s sole responsibilityFrancis SardaunaFrustrated by the unceasing reign of terror and banditry in his state, the Katsina State Governor, Aminu Bello Masari, has officially approved a resort to self-help and asked his people to acquire weapons in defence against terror and banditry.\nThe governor said it was morally wrong for people to submit meekly to the bandits without any attempt to defend themselves, noting that security was everybody’s business.\nHe added that legal experts had already been consulted to advise on the way forward in order to ensure speedy (legal) resolution of the matter.\nDo not succumb to any covert enticement from the customs service, no matter what they offer or promise to do for you.\nMasari, who hinted at this while receiving Yahaya at the Government House, Katsina, said both residents and security agencies must work together to up the ante in the war against bandits, kidnapping and other criminal activities in the state."
  },
  {
    "headline": "Breaking: Bring Repentant Boko Haram Insurgents to Justice, ACF Tells FG",
    "summarized_story": "By John ShiklamThe Arewa Consultative Forum (ACF) has asked the federal government to bring repentant Boko Haram terrorists to justice or release the rest of them still in custody.\nOgbe said, “We are currently witnessing large scale surrender of large numbers of Boko Haram insurgents, among whom are bomb makers, commanders, arsorrists, rapists, and child snatchers.\nIs “I am sorry” enough to bring relief to Nigerians and the thousands of dead and maimed?” he asked.\nThe statement noted the massive destruction of property by the insurgents who have rendered many people homeless.\nWe seriously doubt.”Ogbe, expressed support to similar concerns raised by the Shehu of Borno, the Borno state governor and other concerned Nigerians."
  },
  {
    "headline": "BUSTED: Buhari's Minister, Lai Mohammed Sneaks Out Of Nigeria To Meet With Top Twitter Executives In US Over Ban",
    "summarized_story": "Nigeria's Minister of Information and Culture, Lai Mohammed has travelled to the US to meet with top executives of popular microblogging site, Twitter.\nHis comments referenced the Nigeria Civil War (1967-1970) in which an estimated 2 million South-Easterners died of starvation.\nHowever, the Nigerian government claimed the ban was ultimately based on \"a litany of problems with the social media platform in Nigeria, where misinformation and fake news spread through it have had real world violent consequences\".\nIn the video obtained by SaharaReporters, Mohammed is seen trying to disguise with a baseball cap.\nSee Also Free Speech ‘Most Conditions Have Been Accepted’—Buhari Government Hints On Lifting Twitter SuspensionThe ban was condemned by Amnesty International, Swedish Embassy and the British and Canadian missions in Nigeria."
  },
  {
    "headline": "BUSTED: Buhari's Minister, Lai Mohammed Sneaks Out Of Nigeria To Meet With Top Twitter Executives In US Over Ban",
    "summarized_story": "Nigeria's Minister of Information and Culture, Lai Mohammed has travelled to the US to meet with top executives of popular microblogging site, Twitter.\nHis comments referenced the Nigeria Civil War (1967-1970) in which an estimated 2 million South-Easterners died of starvation.\nHowever, the Nigerian government claimed the ban was ultimately based on \"a litany of problems with the social media platform in Nigeria, where misinformation and fake news spread through it have had real world violent consequences\".\nIn the video obtained by SaharaReporters, Mohammed is seen trying to disguise with a baseball cap.\nSee Also Free Speech ‘Most Conditions Have Been Accepted’—Buhari Government Hints On Lifting Twitter SuspensionThe ban was condemned by Amnesty International, Swedish Embassy and the British and Canadian missions in Nigeria."
  },
  {
    "headline": "Terror-linked Buhari's Minister, Pantami Bribes Information Tech Agency Board Members With Foreign Trip To Support ICT—Killer Bill",
    "summarized_story": "Sources in the National Information Technology Development Agency (NITDA) have revealed how the Federal Minister of Communications and Digital Economy of Nigeria, Isa Ali Pantami, bribed officials within the agency to enforce a bill targeted at destroying ICT startups in the country.\nSources who spoke with SaharaReporters, stated that the minister has been putting in effort to destroy the technology sector and impose his fundamentalist ideals on the works of other agencies.\nOne of the sources said, “Pantami tries to destroy technology sector and systematically encroach on works of other agency.\nThe new bill for which Pantami is lobbying officials is targeted at repealing the National Information Technology Development Agency Act, no 28 2007.\nSaharaReporters obtained a copy of the bill titled ‘A bill for an Act to repeal the National Information Technology Development Agency Act, no 28 2007 and enact the National Information Technology Development Agency Act to provide for the administration, implementation, regulation of information technology systems and practices as well as digital economy in Nigeria and for related matters’."
  },
  {
    "headline": "Terror-linked Buhari's Minister, Pantami Bribes Information Tech Agency Board Members With Foreign Trip To Support ICT—Killer Bill",
    "summarized_story": "Sources in the National Information Technology Development Agency (NITDA) have revealed how the Federal Minister of Communications and Digital Economy of Nigeria, Isa Ali Pantami, bribed officials within the agency to enforce a bill targeted at destroying ICT startups in the country.\nSources who spoke with SaharaReporters, stated that the minister has been putting in effort to destroy the technology sector and impose his fundamentalist ideals on the works of other agencies.\nOne of the sources said, “Pantami tries to destroy technology sector and systematically encroach on works of other agency.\nThe new bill for which Pantami is lobbying officials is targeted at repealing the National Information Technology Development Agency Act, no 28 2007.\nSaharaReporters obtained a copy of the bill titled ‘A bill for an Act to repeal the National Information Technology Development Agency Act, no 28 2007 and enact the National Information Technology Development Agency Act to provide for the administration, implementation, regulation of information technology systems and practices as well as digital economy in Nigeria and for related matters’."
  },
  {
    "headline": "Americans Kick As Twitter Keeps Taliban Accounts While Trump Remains Banned",
    "summarized_story": "Twitter defended its decision to allow Taliban-related accounts to remain active, saying that people in Afghanistan are using the platform to seek help and refuge.\nFacebook, which also has muzzled Trump, has had its ban on the Taliban in place for years because it considers it a 'dangerous group.'\nThe two Taliban spokesmen, Suhail Shaehee and Zabihullah Mujahid have more than 351,000 and 310,000 Twitter followers, respectively.\n“Why does Twitter allow two Taliban spokesmen to have a platform but restricts the First Amendment Rights of former President Trump?\nMeanwhile, President Trump is banned from the platform,” tweeted Rep. Claudia Tenney, a New York Republican."
  },
  {
    "headline": "Buhari to host communities: Petroleum Industry Act will bring real, lasting benefits",
    "summarized_story": "President Muhammadu Buhari has asked host communities to accept the provisions of the Petroleum Industry Act (PIA).\nA contentious issue in the bill is the allocation of 3 percent oil companies’ operating expenses for host communities — a percentage tagged as insufficient by some stakeholders.\nThe Pan Niger Delta Forum (PANDEF) also described the signing of the PIB into law by Buhari as a “callous act”.\nBut in his speech, Buhari said the PIA will bring “real and lasting benefits” to the host communities.\n“The Act also provides for a direct benefit framework that will enable sustainable development of Host Communities."
  },
  {
    "headline": "Buhari to host communities: Petroleum Industry Act will bring real, lasting benefits",
    "summarized_story": "President Muhammadu Buhari has asked host communities to accept the provisions of the Petroleum Industry Act (PIA).\nA contentious issue in the bill is the allocation of 3 percent oil companies’ operating expenses for host communities — a percentage tagged as insufficient by some stakeholders.\nThe Pan Niger Delta Forum (PANDEF) also described the signing of the PIB into law by Buhari as a “callous act”.\nBut in his speech, Buhari said the PIA will bring “real and lasting benefits” to the host communities.\n“The Act also provides for a direct benefit framework that will enable sustainable development of Host Communities."
  },
  {
    "headline": "Buhari appoints Sylva to lead committee on Petroleum Industry Act implementation",
    "summarized_story": "President Muhammadu Buhari has approved a nine-member steering committee to ensure the implementation of the Petroleum Industry Act (PIA).\nAdvertisementFemi Adesina, special adviser to the president on media and publicity, made the announcement in a statement on Wednesday.\nOn Monday, President Muhammadu Buhari signed the petroleum industry bill into law.\nThe law which mandates the deregulation of the petroleum sector, provides for the establishment of a new national oil company and the removal of petrol subsidy.\nAdvertisementAccording to the statement, Buhari appointed Timipre Sylva, minister of state for petroleum resources, as head of the steering committee."
  },
  {
    "headline": "Buhari appoints Sylva to lead committee on Petroleum Industry Act implementation",
    "summarized_story": "President Muhammadu Buhari has approved a nine-member steering committee to ensure the implementation of the Petroleum Industry Act (PIA).\nAdvertisementFemi Adesina, special adviser to the president on media and publicity, made the announcement in a statement on Wednesday.\nOn Monday, President Muhammadu Buhari signed the petroleum industry bill into law.\nThe law which mandates the deregulation of the petroleum sector, provides for the establishment of a new national oil company and the removal of petrol subsidy.\nAdvertisementAccording to the statement, Buhari appointed Timipre Sylva, minister of state for petroleum resources, as head of the steering committee."
  },
  {
    "headline": "'5 killed' in fresh attack on Plateau community",
    "summarized_story": "At least five people were reportedly killed on Tuesday at Chando-Zrrechi village, Miango district of Bassa LGA of Plateau state.\nAdvertisementDavidson Malison, national publicity secretary of Iregwe development association (IDA) in Jos, the state capital, disclosed this in a post on his Facebook page.\nThe development comes weeks after seven persons were killed and over 250 razed houses in some communities in Miango chiefdom of the LGA.\nAdvertisementThere has been tension in Plateau after 22 travellers returning to Ondo state from Bauchi were killed and another 14 injured along Rukuba highway in Jos North LGA of the state.\nSimon Lalong, the state governor, had declared a 24-hour curfew in Jos North and dusk-to-dawn restriction in Jos South and Bassa LGAs."
  },
  {
    "headline": "Nigeria’s Central Bank freezes bank accounts of fintech platforms Risevest, Bamboo, Trove and Chaka",
    "summarized_story": "The Central Bank of Nigeria has just frozen the bank accounts of Nigerian fintech platforms Risevest, Bamboo, Trove and Chaka for the next six months.\nNotably, all four companies affected by this action have gotten licenses from Nigeria’s Securities and Exchange Commission (SEC) to operate as digital platforms for buying and selling stocks.\n— Bamboo (@investbamboo) August 17, 2021So far none of the affected companies has come out to refute this claim.\nAccording to a source from one of the affected companies, they lost a lot of users and deposits after the April announcement.\nTechCabal has reached out to the affected fintech companies and is awaiting their comments."
  },
  {
    "headline": "Nigerian startup checks out of Afghanistan post Taliban takeover",
    "summarized_story": "The central government was disbanded; Ashraf Ghani, the president of Afghanistan fled the scene unannounced, leaving what remained of his administration in the mercy of the Taliban.\nMore recently, Chekkit, a Nigerian authentication and product tracking startup, expanded to Afghanistan after landing a partnership with the Afghanistan Ministry of Health to help in combating the endemic counterfeit medicine products in the country.\nTheir exit wasn’t much of a decision as all their partners have been forced to exit the country.\nObservers predict that with the Taliban in control, international trade will come to a standstill, leading to a surge in smuggling.\nThough after the capital takeover, the Taliban announced that the war is now over, can the dust settle that easily?"
  },
  {
    "headline": "Iyin Aboyeji, Caleb Zipperstein, on why Future Africa is opening an office in Israel",
    "summarized_story": "Last week, a former associate director with leading Isreali VC OurCrowd Caleb Zipperstein, announced his appointment as a venture partner with Future Africa, and the launch of their Israeli office.\nSo we sat down with Future Africa co-founder Iyin Aboyeji and Caleb to get some insight behind the move.\nAdegoke: What does the current state of ecosystem relationship between Africa and Israel look like and where will Future Africa take that relationship to?\nAdegoke: How would you characterize the Israeli ecosystem in terms of the size of investments, the biggest startups, or entrepreneurs?\nCaleb: Israel is not a B2C market."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "A Federal High Court sitting in Abuja has granted the Central Bank of Nigeria an order to freeze the accounts of..."
  },
  {
    "headline": "Angel investing for women, African startup funding so far, Zoom’s Focus mode",
    "summarized_story": "Share this article:Hi there,What we’re discussing today:Yemi Keri and more women becoming angel investorsFundraising in Africa so farZoom’s plan to curb distraction for online classesYemi Keri on building a female-focused angel networkYemi Keri.\nYemi Keri is one such woman, working hard to include more women in Africa’s startup space.\nAdvertisementIntroduced to angel investing through the Lagos Angel Network in 2014/2015, Keri began her investment journey with Cafe Neo and Big Cabal.\nBeing an angel investor, Keri saw more men pitching businesses and getting more attention than women; this was the reality that birthed Rising Tide, a female-focused angel network.\nAccording to Techpoint Africa’s Nigerian Startup Funding Report, 71.2% of funding in 2020 came from foreigners."
  },
  {
    "headline": "It’s 9 days to SME Clinic 2021. Are you excited?",
    "summarized_story": "You can find out what to expect here and check out 3 reasons not to miss SME Clinic 2021.\nAt this point, I’ll let you read the testimonials of three participants from SME Clinic 2020.\nJoin us at SME Clinic 2021 to learn more about how to market and grow your business onlineEarly Bird Offer!\nGet your ticket for SME Clinic 2021 at discounted rates now.\nRegister for SME Clinic 2021 and gain skills to grow your business."
  },
  {
    "headline": "I want more women to become angel investors — Yemi Keri on angel investing and building Rising Tide",
    "summarized_story": "This is a problem Yemi Keri, one of a handful of women investing in African startups, is passionate about solving.\nAfter getting a taste of angel investing with the Lagos Angel Network and seeing how hard it was for women to get funded, she co-founded Rising Tide Africa to get more women involved in angel investing.\nI got into angel investing by referral with the Lagos Angel Network.\nI made two investments — in Cafe Neo and Big Cabal — with Lagos Angel Network, and that’s how I came into angel investment.\nWe believe that with more female angel investors, we can reduce the gender funding gap for female entrepreneurs."
  },
  {
    "headline": "IOM facilitates voluntary return of 17,359 Nigerian migrants – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The International Organisation for Migration (IOM) facilitated the voluntary return of 17,358 Nigerian migrants from 22 countries under the EU-IOM joint Initiative for Migrants Protection and Reintegration Programme from April 2017 to January 2021.\nThis was contained in the Statistical summary of returned Nigerian migrants since inception of the project which is being funded by the European Union and implemented by IOM.\nThe figure including 17,352 from 18 Africa countries and seven from four European countries of France, Ireland, Poland and Austria is made up of 10141 males and 7218 females, with ages ranging from 0 – 66 years.\nThe highest figure of 4,291 voluntary returnee migrants was recorded in the last quarter of 2017, followed by the last quarter of 2018 with 1,593, while the lowest figures of two and 24 were recorded in the second quarter of 2020 and first quarter of 2017 respectively.\nAccording to the statistics, the returnees were provided with immidiate assistance, such as onward transportation, medical support and counseling."
  },
  {
    "headline": "Investment: Stakeholders task govt on enabling environment – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Stakeholders irregular migration and trafficking in persons have tasked government at all levels to create an investment friendly environment as a means to discouraging irregular migration.\nAt a video contents screening session organised in Benin City by the International Organisation for Migration (IOM), the stakeholders also tasked the affluents in the society to channel their resources towards what will impact the society positively.\nIt was meant to access the impact of audio-visual messaging contents as an awareness raising approach on issues of irregular migration and trafficking in persons.\nIt was in response to finding home grown solutions to address the scourge of irregular migration, trafficking in persons and smuggling of migrants.\nWhile calling on returned migrants to acquire skills, the stakeholders also tasked them to invest their little fund in businesses that can add value to their lives."
  },
  {
    "headline": "New petroleum law, injustice to South-South – Orbih – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin – The Peoples Democratic Party (PDP) in the South South has said that the the Petroleum Industry law recently signed by President Muhammadu Buhari has not addressed the injustice done oil-bearing Niger Delta communities.\nThis is contained in a statement by Chief Dan Orbih, National Vice Chairman, South South of Nigeria’s main opposition party on Tuesday.\nThe News Agency of Nigeria (NAN) reports that Buhari had signed the PIB into law on Monday in Abuja to further address challenges of development in the Niger Delta region.\nOrbi, however, in the statement which he personally signed, described the law as not only insensitive but a brazen act of injustice.\n“Embrace PDP as it holds the best promise of a better and progressive Niger Delta built on honour, justice and equity,” he said."
  },
  {
    "headline": "SWAN President’s death huge loss to sports development in Nigeria, official says – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The death of Ahmed Aigbona, the President of Sports Writers Association of Nigeria (SWAN), is a huge loss to sports development in Nigeria, the Association’s Secretary-General, Mike Oboh, says.\nOboh told sports journalists in Abuja on Tuesday that Aigbona’s death was not just a loss to his family or National SWAN but the Nigerian sports family as a whole.\nBut it goes beyond SWAN, it affects the whole Nigerian sports family.\nHe said the SWAN NEC would soon come up with some announcement on crucial issues regarding the Association.\nAigbona, a former Chairman of Edo SWAN and former member of the Edo Football Association, was elected SWAN National President on Oct. 7 in 2019 in Abuja."
  },
  {
    "headline": "UNILAG dares COVID-19, reopens hostels for second semester examination",
    "summarized_story": "This announcement is coming exactly six weeks after the university abruptly shut down its hostels over rising cases of the pandemic among students on the campus.\nThe timetable also noted that the 400 and other 500 level students from other departments and faculties are scheduled to move into the hostels on September 18 and vacate on September 26.\nThis is as students are warned to steer clear of the hostels if they are not legal occupants.\nHe said all the eligible hostel occupants are also expected to abide by the guidelines for admittance into the hostels.\n“In order to ensure the safety of staff and students during this period, the University will adhere strictly to all COVID-19 protocols."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Osun Amotekun Board denies embezzlement allegation, appeals to hunters to rescind decision",
    "summarized_story": "Chairman, Governing Board, Osun State Amotekun Corps, Brigadier General Isah Aderibigbe (Rtd) made the appeal while fielding questions from journalists shortly after the board meeting held in Osogbo, Osun State capital.\nThe hunters led by their state Coordinator, Nurein Hammed Soladoye, said they were short-changed to the sum of N29 million by Osun Amotekun leadership during and after last year lockdown in the state.\nit was covid19 that brought in ad-hoc Amotekun and worked with the hunters and other security agencies before we were inaugurated in August last year.\n“The allegation as nothing to do with the current leadership of Amotekun.\nWe spoke with the leader of the hunters group in Osun state , in person of Mr Nurein Hammed, popularly called AK leader."
  },
  {
    "headline": "Buhari appoints Timipre Sylva to head implementation c’ttee for Petroleum Industry Act",
    "summarized_story": "Nigeria’s president, Muhammadu Buhari has approved a steering committee to oversee the commencement of implementation of the newly signed Petroleum Industry Act (PIA), a statement by the Special Adviser to the President on Media and Publicity, Chief Femi Adesina has said.\nThe steering committee is headed by the Minister of State, Petroleum Resources, Chief Timipre Sylva.\nThe statement said said other members are: Permanent Secretary, Ministry of Petroleum Resources, Group Managing Director, NNPC, Executive Chairman, FIRS, Representative of the Ministry of Justice, Representative of the Ministry of Finance, Budget and National Planning, Senior Special Assistant to the President on Natural Resources, Barrister Olufemi Lijadu as External Legal Adviser, while the Executive Secretary, Petroleum Technology Development Fund, will serve as Head of the Coordinating Secretariat and the Implementation Working Group.\nThe statement explained that “The primary responsibility of the steering committee shall be to guide the effective and timely implementation of the PIA in the course of transition to the petroleum industry envisaged in the reform program, and ensure that the new institutions created have the full capability to deliver on their mandate under the new legislation.”It further stated that the committee has 12 months duration for the assignment and that periodic updates will be given to Mr President"
  },
  {
    "headline": "UAE snubs Nigeria, approves 70 countries for visa-on-arrival",
    "summarized_story": "The United Arab Emirates (UAE) has excluded Nigeria from a list of countries whose citizens are eligible to apply for visa-on-arrival.\nEtihad Airways released a list of countries whose travellers landing at Abu Dhabi airport can receive visas from its immigration desks.\nEmirati authorities also prohibited their nationals from visiting Nigeria and some other countries as the country controls exposure to COVID-19, Gazette reported.\nSince late last year, Nigeria and the UAE have been in a diplomatic spat over fraudulent activity in Abu Dhabi and Dubai.\nAnalysis by Henley and Partners revealed that Nigeria’s passport ranks 101 out of 199 countries, allowing its passport holders to just 46 countries visa-free."
  },
  {
    "headline": "Nigeria’s July inflation down to 17.38% from 17.75% YoY",
    "summarized_story": "Nigeria’s Consumer Price Index, (CPI) which measures inflation dropped to 17.38 per cent (year-on-year) in July, compared to 17.75 per cent in the preceding month, according to the National Bureau of Statistics (NBS).\nCore inflation, which excludes the prices of volatile agricultural produce, however increased to 13.72 per cent, up by 0.63 per cent when compared with 13.09 per cent recorded in June.\nOn month-on-month basis, the headline index rose by 0.93% in July 2021, which was 0.13 percentage points lower than the rate recorded in June 2021 (1.06) percent.\nThe urban inflation rate increased by 18.01 percent (year-on-year) in July 2021 from 18.35 percent recorded in June 2021, while the rural inflation rate increased by 16.75 percent in July 2021 from 17.16 percent in June 2021.\nThis is higher than 16.51 percent reported in July 2021,Meanwhile, the corresponding rural inflation rate in July 2021 was 15.73 percent compared to 15.36 percent recorded in June 2021."
  },
  {
    "headline": "An Sake Dage Shari’ar Shekih Abduljabbar A Kano",
    "summarized_story": ""
  },
  {
    "headline": "Masari Ga Katsinawa: Ku Kare Kanku Daga ‘Yan Bindiga",
    "summarized_story": ""
  },
  {
    "headline": "Mutum Miliyan 2.4 Ke Neman Rajistar Zabe Ta Intanet Zuwa Yanzu -INEC",
    "summarized_story": ""
  },
  {
    "headline": "Ministan Harkokin Wajen Sin Ya Yi Hira Da Takwaransa Na Amurka",
    "summarized_story": ""
  },
  {
    "headline": "Hua Chunying: Sin Da Sauran Masu Ruwa Da Tsaki Za Su Ci Gaba Da Zantawa Da Nufin Dakile Komawa Yaki A Afghanistan",
    "summarized_story": ""
  },
  {
    "headline": "Why Pantami should condemn events unfolding in Afghanistan –Group",
    "summarized_story": "Civil rights advocacy group, Human Rights Writers Association of Nigeria, has urged the Minister of Communications and Digital Economy, Isa Pantami, to condemn the takeover of Afghanistan by an Islamic militant group known as the Taliban or the Mujahedeen.\nHURIWA, in a statement on Tuesday by its National Coordinator, Emmanuel Onwubiko, said the minister should condemn the Taliban takeover in Afghanistan to show that he has indeed renounced his extremist views.\nThe statement was titled, ‘Minister of Telecommunications and Digital Economy should denounce Taliban in Afghanistan to show he has truly renounced his previous media reports of endorsement-: says HURIWA’.\nAfghanistan civilian President Ashraf Ghani subsequently fled the landlocked Asian country on Sunday, abandoning the presidential palace to Taliban fighters.\nMany Nigerians and other persons across the world have condemned the unfolding events in Afghanistan but the minister of communications and digital economy has been mum on the development."
  },
  {
    "headline": "Why Pantami should condemn events unfolding in Afghanistan –Group",
    "summarized_story": "Civil rights advocacy group, Human Rights Writers Association of Nigeria, has urged the Minister of Communications and Digital Economy, Isa Pantami, to condemn the takeover of Afghanistan by an Islamic militant group known as the Taliban or the Mujahedeen.\nHURIWA, in a statement on Tuesday by its National Coordinator, Emmanuel Onwubiko, said the minister should condemn the Taliban takeover in Afghanistan to show that he has indeed renounced his extremist views.\nThe statement was titled, ‘Minister of Telecommunications and Digital Economy should denounce Taliban in Afghanistan to show he has truly renounced his previous media reports of endorsement-: says HURIWA’.\nAfghanistan civilian President Ashraf Ghani subsequently fled the landlocked Asian country on Sunday, abandoning the presidential palace to Taliban fighters.\nMany Nigerians and other persons across the world have condemned the unfolding events in Afghanistan but the minister of communications and digital economy has been mum on the development."
  },
  {
    "headline": "AFCON 2021: Eagles draw Egypt, Sudan, Guinea Bissau in Group D",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "AFCON 2021: Eagles draw Egypt, Sudan, Guinea Bissau in Group D",
    "summarized_story": "In our quest to continue telling the truth at all times, we sincerely implore you to keep supporting the work we do daily in the pursuit of truth, fairness, accountability and good governance in our society.\nWith your kind support, we will at all times provide you with an elevated service, as a professional media organisation.\nPlease enter an amount to make a donation."
  },
  {
    "headline": "ICYMI: Nigerian governors sue Buhari, FG over N2.28T loot",
    "summarized_story": "Nigeria’s 36 governors have taken the Federal Government to the Supreme Court over the status of an estimated N2.28 trillion recovered loot.\nThey contended that by establishing the Asset Recovery Account and Interim Forfeiture Recovery Account, into which revenue from recovered assets is to be paid, “the Asset Recovery Regulation contradicts the provisions of the constitution.\n“Revenue Mobilization and Fisical Commission Act has nothing specific on funds recovered from indicted public officers.\nIt merely mentions accruals and disbursement of revenue from the Federation Account.\nOne cannot situate rights and entitlements on looted funds and recovered assets with myopic and narrow understating of concepts of the application of local legislations."
  },
  {
    "headline": "Taiwo Uko secures divorce from incurable womanising hubby",
    "summarized_story": "By Deborah AkpedeA 40-year-old Lagos fashion designer, Taiwo Uko on Wednesday got Igando Customary Court to dissolve her 13-year-old marriage to husband, Nkem, on grounds that he is an unrepentant womaniser and an adulterer.\nUko, in her petition, alleged that Nkem’s womanising was ”incurable”.\nThe mother of three boys pleaded with the court to terminate the marriage and grant her custody of their children.\n“Throughout the duration of this case, the respondent did not honour the court’s invitation to defend the allegations against him.\n“The court hereby pronounces the marriage between Taiwo and Nkem Uko dissolved today."
  },
  {
    "headline": "Iniubong Umoren: Court Adjourns Case For Accelerated Hearing",
    "summarized_story": "The case of Uduak Akpan, the suspected killer of Iniubong Umoren, has been adjourned for accelerated hearing from November 1, 2, 4, 10, 11, 15, 16, and five days in December by the Akwa Ibom State High Court in Uyo.\nThe plea for bail for the second accused, Frank Akpan, who is the father of Uduak Akpan, the first accused, was similarly dismissed by the presiding judge, Justice Bennett Illamoh, because it was made on summons rather than motion.\nDetails will be provided later…"
  },
  {
    "headline": "BREAKING: Buhari Approves Committee On Petroleum Industry Act",
    "summarized_story": "The President, Major General Muhamamdu Buhari (retd.\n), has approved a steering committee to monitor the implementation of the newly enacted Petroleum Industry Act.\nThe steering group will be led by Timipre Sylva, Minister of State for Petroleum Resources, according to a statement released on Wednesday by Femi Adesina, Special Adviser to the President on Media and Publicity.\nAccording to the statement, “The primary responsibility of the steering committee shall be to guide the effective and timely implementation of the PIA in the course of transition to the petroleum industry envisaged in the reform program, and ensure that the new institutions created have the full capability to deliver on their mandate under the new legislation.\n“The committee has 12 months duration for the assignment, and periodic updates will be given to Mr President.”"
  },
  {
    "headline": "Abba Kyari: Nigerian Police Provides Update On Status Of Investigation.",
    "summarized_story": "On Tuesday, the Nigerian Police Force denied rumors that the investigative panel against DCP Abba Kyari had filed its findings.\nRecall that speculations and reports had it that the investigation panel on Abba Kyari had submitted its report to the Inspector General of Police.\nReacting on Tuesday, DCP Frank Mba, Force Public Relations Officer in a statement, dismissed the speculations, including that of online reports.\nNigeria Police IG suspends Abba Kyari, panel begins probeAccording to the statement, “The Nigeria Police Force wishes to inform the general public that the probe into the alleged indictment of DCP Abba Kyari by the FBI, being conducted by the NPF Special Investigation Panel (SIP), is still ongoing.”The Force PRO told members of the public that, the panel has not submitted its report to the Inspector General of Police, as being wrongly reported in some news outlet and online platforms.\n“The Force hereby reassures the public that the outcome of investigations by the probe panel would be communicated accordingly upon conclusion of the investigations,” The statement further said."
  },
  {
    "headline": "Pre-Wedding Photos Of Yusuf Buhari, Zahra Bayero [PHOTOS]",
    "summarized_story": "Yusuf Buhari, the son of President Muhammadu Buhari, is slated to marry Zahra Bayero.\nZahra is the daughter of the Emir of Bichi, Nasir Ado Bayero.\nZahra not above the law – Hisbah slams Yusuf Buhari fiancee’s bridal gownSome governors earlier visited the monarch’s elder brother and the Emir of Kano, Aminu Ado Bayero to formalize plans.\nBayero, however, wished Yusuf and Zahra a successful married life.\nThe pre-wedding photos of Yusuf Buhari, Zahra Bayero:Here are the photos below:"
  },
  {
    "headline": "Pictures: President Muhammadu Buhari presides over FEC meeting",
    "summarized_story": "PreviousFG to extend 774,000 jobs beyond 2022 says Keyamo"
  },
  {
    "headline": "Buhari, Lawan, Atiku, others mourn as ex-DSP Mantu dies at 74",
    "summarized_story": "A family source said Senator Mantu died in the early hours of Tuesday.\nBuhari mournsMeanwhile, President Buhari has joined the government and people of Plateau state in mourning the passing of the renowned politician.\n“He said that Nigeria will miss Senator Mantu ‘s political experiences which spanned over four decades.\nAbove all, Senator Mantu was a good man, a God-fearing soul, who spared nothing in ensuring the wellbeing of others above personal pursuits.\n“Our party commiserates with the Mantu family, the PDP fold in Plateau state, the people of Plateau central as well as the entire state."
  },
  {
    "headline": "N1.8trn recovered loot, N450bn assets: 36 states drag FG to Supreme Court, allege diversion",
    "summarized_story": "The governors also accused the federal government of diverting another N450 billion worth of non-cash assets recovered proceeds of crime since 2015.\nThey are therefore asking for the remittance of N1.8 trillion (cash) and N450billion (non-cash) in recovered loot since 2015 into the federation account.\n“By establishing the Asset Recovery Account and interim Forfeiture Recovery Account into which revenue from recovered assets is to be paid, the Asset Recovery Regulation contradicts the provisions of the Constitution.\nHe said: “They represent Nigerians and Nigerians deserve to know because they have been clamouring for the assets recovery, transparency and monitoring value amongst others.\nNigerians have been rooting for accountability and transparency as regards assets recovery."
  },
  {
    "headline": "Anambra govt commends Air Peace -NigPilot",
    "summarized_story": "Anambra State Government has praised one of Nigeria’s leading carriers, Air Peace, for its no-city-left-behind strategy which has seen it open operations in different parts of the country in the last few months.\nIt added that while some airlines are acquiring refurbished aircraft, Air Peace “has been purchasing a large number of brand new state-of-the-art equipment and deploying them on Nigerian domestic routes for the safety and comfort of our people”.\n“The use of Embraer 195, known for an excellent safety record, is most welcome.\n“What is more, we are delighted to hear from people like Governor Seyi Makinde of Oyo State that the Air Peace operation in Ibadan has resulted in the crash of air tariffs in certain places, which is pleasant news to Nigerian travelers,” the statement added.\n“Governor Obiano has also thanked the Air Peace Chairman for his support for working closely with the Anambra State Government to build a hangar at the state airport for the repair and maintenance of aircraft,” Adinuba stated, revealing that the airport will be commissioned soon."
  },
  {
    "headline": "Photo Op of FCT Minister’s visit to the IGP -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "NSOANP, Smile Train, Move to Stop Preventable Deaths -NigPilot",
    "summarized_story": "Worried about the occurrence of preventable deaths in Nigeria, the National Surgical, Obstetric, Anaesthesia and Nursing Plan (NSOANP), in collaboration with Smile Train, has embarked on capacity building for nurses in the country.\nConsequently, the duo organized a five-day training on ‘Nursing Care Saves Lives,’ with participants drawn from the nursing profession across the country in Abuja.\nSpeaking at the opening of the training, Smile Train Programme Manager, West Africa, Victoria Awazie stressed that the training was critical to ensure that nurses were abreast with global best practices in providing care to patients.\nOlubunmi who doubles as a member NSOANP committee maintained that there could never be successful surgical intervention care without quality nursing care, as nurses were always available even when other health care professionals, especially doctors, were not.\n“If medications or equipment are not available, there is little or more the nurses can do within their capacity."
  },
  {
    "headline": "Christian pilgrims pray for Nigerian security, economic prosperity at Mount Nebo -NigPilot",
    "summarized_story": "Nigerian Pilgrims in Jordan have taken the nation’s security challenges and economic prosperity of the nation to God at Mount Nebo.\nThe Nigerians on Pilgrimage to Jordan yesterday prayed fervently for God’s divine intervention on the prevailing security challenges in different parts of the country.\nWhile praying against the spirit of anger, destruction and disobedience, the Christian Pilgrims noted that life without God is meaningless.\nThe pilgrims who were divided into various groups prayed for economic prosperity of the nation, youth development and peaceful co-existence in the country.\nA tour guard, Mueen Akroush, who led the pilgrims round Mount Nebo and other Holy sites, gave an insight into the Biblical history of the sites and their imperatives to the present day."
  },
  {
    "headline": "UPDATED: Buhari Approves Committee To Implement Petroleum Industry Act Immediately",
    "summarized_story": "President Muhammadu Buhari has approved a committee to immediately commence the implementation of the Petroleum Industry Act (PIA).\nThe steering committee, which has 12 months duration for the assignment, is headed by the Minister of State for Petroleum Resources, Timipre Sylva.\nPresident Buhari gave the approval on Wednesday while giving a remark on the Act which he assented to two days ago.\nHowever, President Buhari is hopeful that the new Act will coordinate the activities of the Nigerian National Petroleum Corporation (NNPC) and reposition it for further progress.\nFollowing the meeting with the lawmakers, the President went on to preside over the Federal Executive Council (FEC) meeting."
  },
  {
    "headline": "NCDC Confirms 357 COVID-19 Cases As Nigeria Receives Vaccine Boost",
    "summarized_story": "Nigeria has confirmed 357 new cases of COVID-19 in 11 states and the Federal Capital Territory Abuja, according to the Nigeria Centre for Disease Control (NCDC).\nOf the confirmed cases, 167,459 people have been discharged and 2,229 deaths have been recorded in all 36 states and the FCT.\nAmid the third wave of the COVID-19 pandemic, authorities have continued to raise concerns over non-compliance with the measures put in place to curb the spread of the disease.\n“We have consistently pushed for a global effort that helps every country receive the vaccine against COVID-19.\nI am so pleased to see Nigeria receive 699,760 doses donated by the UK, in their second batch of the vaccine through COVAX.”See the breakdown of cases according to states below:"
  },
  {
    "headline": "Taliban Pledge No Revenge Against Opponents, To Respect Women’s Rights",
    "summarized_story": "The Taliban have offered a pledge of reconciliation, vowing no revenge against opponents and to respect women’s rights in a “different” rule of Afghanistan from two decades ago.\n“All those in the opposite side are pardoned from A to Z,” Taliban spokesman Zabihullah Mujahid told foreign and local reporters, revealing his identity for the first time.\nDesperationNevertheless, Afghans and foreigners continued to flee the country, with the United States and other nations stepping up evacuation airlifts from Kabul.\nThe United Nations Human Rights Council announced on Tuesday it would hold a special session on Afghanistan next week to address the “serious human rights concerns” under the Taliban.\nHe arrived from Qatar, where he has spent months leading talks with the United States and then Afghan peace negotiators."
  },
  {
    "headline": "NNPC Limited To Kick Off In Six Months – Sylva",
    "summarized_story": "﻿The Nigerian National Petroleum Corporation (NNPC) will become a commercial company within six months, the Minister of State for Petroleum Resources, Timipre Sylva said on Tuesday.\nThis follows the signing of the Petroleum Industry Bill into law by President Muhammadu Buhari on Monday.\nMr Sylva, who was speaking at a press conference in Abuja, said a transitional committee is already in place to incorporate NNPC Limited.\nREAD ALSO: President Buhari Signs Petroleum Industry Bill Into LawAll shares in NNPC Limited are expected to be vested in the government at incorporation and held by the Ministry of Finance.\nMr Sylva noted that although the new petroleum act has deregulated the oil sector, subsidy policies will remain in place till further notice."
  },
  {
    "headline": "Blaise Compaore’s Trial For Murder Of Thomas Sankara To Start In October",
    "summarized_story": "Burkina Faso’s exiled former president Blaise Compaore will be tried from October 11 for the murder of Thomas Sankara, the man he ousted in a 1987 coup, military prosecutors announced Tuesday.\nCompaore and 13 others have been charged by a military tribunal over the death of the cult figure, who some referred to as the African Che Guevara.\nTuesday’s announcement came in a statement from prosecutors at the military tribunal in capital Ouagadougou.\nThe case file arrived on the desk of the city’s military prosecutors in April.\nCompaore and 12 others face charges of harming state security, complicity in murder, and complicity in the concealment of corpses."
  },
  {
    "headline": "Tambuwal, Sultan, fmr Governors convene stakeholders security meeting in Sokoto",
    "summarized_story": "Following the escalating occurrences of banditry attacks and other security breaches in Sokoto state, a stakeholders security meeting has been convened.\nPolitical leaders, traditional and religious authorities, heads of security agencies, and other important stakeholders were invited to the conference, hosted by state governor Aminu Tambuwal.\nFormer governors and their deputies, as well as members of the national and state legislatures, are all part of the meeting.\nAdvertisementIn his address to the gathering, Sokoto state governor Aminu Tambuwal urged all attendees to make meaningful contributions and divulge to the gathering any information at their disposal to assist in finding a long-term solution to the state’s security concerns.\nIn attendance at the meeting is the Sultan of Sokoto, Muhammad Sa’ad Abubakar and the eighty six districts head in SokotoFormer Sokoto state governors Attahiru Dalhatu Bafarawa and Aliyu Magatakar Wamakko were also present at the meeting, as was former Deputy governor of the state Ahmad Muhammad Gusau."
  },
  {
    "headline": "NBC meet with CEOs of media houses, enjoins all to use medium in fight against insecurity",
    "summarized_story": "The National Broadcasting Commission, NBC has charged broadcasters and media owners with using their platforms to help the country win the war on insecurity.\nThis request was made during a meeting with the CEOs of media houses in South West, Nigeria.\nBalarabe shehu illela, the commission’s new Director General, charged everyone with ensuring that the content does not jeopardize national security.\nAdvertisementSpeaking on the impact of broadcast coverage on national security, Ek Gabkwet, the director of public relations for the Nigerian Air Force, requested the media’s assistance in safeguarding the nation’s security."
  },
  {
    "headline": "Arm yourselves against bandits, Governor Masari tells Katsina residents",
    "summarized_story": "Governor Aminu Masari has advised Katsina State residents living in areas prone to bandit activity to acquire weapons and protect themselves.\nAdvertisement“People must divorce their minds from the mistaken notion that security is government’s sole responsibility alone,” Masari said.\nMeanwhile, the governor assured that those killed by the customs operatives would not die in vain.\nThe governor cautioned the families of the victims not to succumb to any covert enticement from the NSC.\n“What customs operatives are doing in the state is wrong, and unacceptable."
  },
  {
    "headline": "Trending: Anglican Priest Sacked After Kissing Female Students in Ghana – Arise News",
    "summarized_story": "A video of a priest identified as Father Balthazar Obeng kissing at least three female students of Saint Monica College of Education in Ghana has gone viral.\nFollowing this, the Anglican Communion in Ghana has sacked Fr Obeng following the now viral video.\nMeanwhile, a Kenyan pastor and founder of Bishop Climate Ministries in Camberwell District, South London, United Kingdom, Climate Irungu Wiseman, has appeared in court after being accused of selling “plague protection kits” for £91 as a cure for COVID-19."
  },
  {
    "headline": "UK to Welcome 20,000 Afghans Amid Taliban Takeover",
    "summarized_story": "Thousands of Afghan refugees will be resettled in the UK after the Taliban seized control of Kabul, the UK government has promised.\nThe new scheme will see up to 20,000 Afghans offered a route to set up home in the UK in the coming years.\nThe new plan is on top of the existing scheme for interpreters and other staff who worked for the UK.\nSome 5,000 Afghans and family members are expected to benefit from that policy.\nSome 5,000 staff – including interpreters – and their families will come to the UK via that scheme this year."
  },
  {
    "headline": "Uganda Scraps Controversial Anti-pornography Law Which Bans Wearing Miniskirts in Public",
    "summarized_story": "Uganda’s constitutional court is scrapping a controversial anti-pornography law whose provisions included a ban on wearing miniskirts in public, in a decision hailed by women’s rights campaigners.\nThe legislation criminalised any activity deemed pornographic, from wearing short skirts to writing risque songs, and led to increased public harassment of women who wore clothing considered too revealing.\nWomen’s rights activists welcomed the verdict, which followed street protests by campaigners calling for the legislation to be dropped.\nThe petitioners said the legislation encouraged the harassment and mistreatment of women in public and denied them control over their bodies, as well as access to public spaces.\nLocal media reported that he also confronted Proscovia Alengot Oromait, then Uganda’s youngest member of parliament, when she wore a short skirt in parliament."
  },
  {
    "headline": "Afreximbank to Deliver 40m J&J Covid Vaccines to Nigeria",
    "summarized_story": "President of African Export-Import Bank (Afreximbank), Prof. Benedict Oramah, has disclosed that the bank will supply a total of 40 million doses of Johnson and Johnson COVID-19 vaccine to Nigeria between now and 2022.\nThis is just as about 699,760 COVID-19 vaccine doses donated by the United Kingdom (UK) have been received at the Nnamdi Azikiwe International Airport, Abuja.\nHe declared that there is an arrangement under the Afreximbank facility to deliver 40 million doses of the Johnson & Johnson COVID-19 vaccines to Nigeria before the end of 2022.\nAlso, about 699,760 COVID-19 vaccine doses donated by the UK have been received at the Nnamdi Azikiwe International Airport, Abuja.\n“We have AstraZeneca vaccines more than enough coming in the pipeline."
  },
  {
    "headline": "New Petroleum Act: Rivers Governor Wike says 3% Allocation to Niger Delta Communities Meagre",
    "summarized_story": "Rivers State Governor Nyesom Wike has described the three per cent allocation for host communities in the Niger Delta region as contained in the Act as meagre.\nThe governor of the South-South Nigeria state who commended the passage of the law, stated that the stipulated allocation for the host communities of oil exploitation was unacceptable.\nHe expressed concern that the international oil companies would take advantage of this, to continually instigate crisis in oil producing communities in order not to pay the three per cent due the host communities.\n“The confidence people have today is that the amendment of the constitution will get to the states.\nThere are issues that you may not like, but these are done on clause by clause basis.”Blessing Ibunge in Port Harcourt"
  }
]