[
  {
    "headline": "Soludo sworn in as Anambra governor, retains Obiano’s SSG",
    "summarized_story": "There was a mild drama at the Government House, Awka, on Thursday, as Prof Chukwuma Soludo took his oath of office as the sixth governor of Anambra State.\nHowever, the former deputy governor of the state, Prof Nkem Okeke, who had earlier defected to the All Progressives Congress, was not at the ceremony.\nAs soon as the event restarted, Soludo took the oath of office and effectively became the governor of the state.\nThe letter read in part, “Governor Chukwuma Soludo hereby apologises to all Anambra people, friends and guests, who attended his inauguration this morning as the Anambra State governor, for the breach of protocol.\nThe governor, while promising to flush out the touts, announced a one month tax holiday for residents of the state."
  },
  {
    "headline": "APC in race to hold March 26 convention, battles injunction",
    "summarized_story": "At least six politicians seeking to emerge as the National Chairman of the All Progressives Congress on March 26, 2022, have purchased the form sold for N20m each.\nA former Federal Capital Territory Chairman of the defunct Action Congress of Nigeria, Sunny Moniedafe, also picked the N10m form for the deputy national chairman ditto for Nworgu Boms.\nAl-Makura said if he becomes the national chairman of the APC, he would ensure that members of the National Assembly get another term in the federal parliament.\nMeanwhile, barely nine days to the convention, the party has yet to vacate a court injunction barring it from holding the event.\n“We are now at the finishing line in the preparations for our national convention, which is at hand."
  },
  {
    "headline": "Emefiele moves to get more women into banks’ top management",
    "summarized_story": "Godwin EmefieleBy Emma Ujah, Abuja Bureau ChiefThe Central Bank of Nigeria, CBN, has issued gender-mandated regulations to pave the way for more women at the top management levels in the banking industry.\nThis, he said, was similar to the National Financial Inclusion Strategy recommending increasing female staff of microfinance banks to 30 per cent.\nHe said CBN had since surpassed affirmative action, with 32 per cent of the total workforce being female.\nSpecifically, he said that out of N134.67 billion disbursed to 37,273 AGSMEIS beneficiaries, as of January 2022, 33 per cent (N44.1 billion) went to 12,511 female beneficiaries.\nFurthermore, he said out of the 211,306 financial statements currently registered in the collateral registry, 92,091, representing 43.6 per cent were female borrowers."
  },
  {
    "headline": "Police arraign 2 men for allegedly assaulting EKEDC staff in Badagry",
    "summarized_story": "The Police in Lagos on Thursday arraigned two men at a Badagry Chief Magistrates’ Court for allegedly assaulting and attacking staff of Eko Electricity Distribution Company (EKEDC).\nThe defendants, Taiwo Nupo, 25, and Balogun Olatunji, 36, whose addresses are unknown, are standing trial on a count charge of assault.\nOkuoimose said the defendants allegedly assaulting the two staff of EKEDC by beating and seizing their electrical wire from them.\nThe prosecutor said the offence contravened Sections 173 of the criminal law of Lagos state, 2015.\nThe Chief Magistrate, Mr Fadaunsi Adefioye, granted the defendants bail in the sum of N50, 000, each with one surety in like sum."
  },
  {
    "headline": "Anambra Senator, Stella Oduah, condemns fracas between Obiano’s wife and Bianca Ojukwu",
    "summarized_story": "By David RoyalThe Senator representing Anambra North, Senator Stella Oduah has condemned in strong terms, the conduct of the wife of the ex-governor and former first lady of Anambra State, Mrs Ebelechukwu Obiano, who according to her threw decorum away and attacked Her Excellency, Ambassador Bianca Ojukwu at Charles Soludo’s inauguration ceremony.\nThe senator in a statement on Thursday said “In strong terms, this unwarranted attack against the wife of an illustrious son and our very own Ikemba.\n“More condemnable is even the gutter and vulgar language used by Mrs Obiano to describe her fellow woman, who is even a widow.\nI have always held the view that it is only weak minds that label hardworking women like Bianca with nasty names.\n“And it is more unfortunate when a woman, especially one that has been around the corridors of power, is the one hurling such baseless and regretful invectives against her fellow woman."
  },
  {
    "headline": "Expert harps on third party parenting, adoption in Nigeria",
    "summarized_story": "Dr. Oluyemisi Adeyemi-BenroDirector of a Lagos based fertility clinic Alpha Assisted Reproductive Klinic, The ARK, Dr. Oluyemisi Adeyemi-Benro has called on the need for Nigerians to receive third party parenting and adoption with an open mind.\nFielding questions from newsmen at the 10th anniversary of the ARK, Dr. Adeyemi-Benro decried the need for the government to do more awareness on third party parenting to erase undue stigmatisation as perceived by some people.\nAccording to her: ” In third party parenting, everybody should have an open mind.\nThere is also a need for the government to create more awareness on third party parenting in Nigeria.\nWe should also consider things like adoption as an alternative to parenting even if it’s a stop gap."
  },
  {
    "headline": "2023: Umahi’s hometown backs his administration, presidential ambition",
    "summarized_story": "Peter Okutu, AbakalikiThe home town (Uburu Community) of Governor David Umahi of Ebonyi State, Thursday held a solidarity rally in support of his administration and presidential ambition come 2023.\n“We are here to declare total support for the presidential ambition of our son and leader, Engr David Umahi, come 2023.\nHis presidential ambition will be fruitful and we are here to tell Nigerians that we are fully in support.\n“The essence of this rally is to pledge our solidarity that is unshakable, immovable to our dear great son David Umahi.\nThe people, therefore, called on Nigerians to rally around Umahi as his ambition will unite and integrate the Nation more strongly."
  },
  {
    "headline": "Fuel scarcity: We’ll deal with depot owners selling beyond approved price – FG",
    "summarized_story": "The Federal Government says it will deal decisively and sanction any Depot Owner caught selling petroleum products beyond the approved Ex-Depot price in the country.\n“It been a difficult few weeks; a few weeks ago, we had the issue of petroleum product shortage.\n“Nigerians are suffering because of the high diesel prices, including everywhere else globally.\nAs a result, the minister said the trucks that could move petroleum products that ran on diesel were impacted and could not really cope with the high diesel prices.\n“If any deport owner increases price or any fuel station tries to take advantage of the situation, the public should report immediately."
  },
  {
    "headline": "5 commissioners to leave as Gov Emmanuel submits new nominees to state assembly for screening",
    "summarized_story": "Five commissioners in the state cabinet will be relieved of their appointments any moment from now as Governor Udom Emmanuel of Akwa Ibom has submitted list of new nominees to the state House of Assembly.\nThis was disclosed in a statement issued by the Commissioner for Information and Strategy at the end of state Executive Council meeting held on Thursday, March 17, 2022.\nIn attendance at the meeting were, Secretary to the State Government, Head of the Civil Service, Honourable Commissioners and Special Adviser.\n“The Chairman-in-Council announced that there executive Council will be reshuffled and that five Commissioners will be eased out.\nA meeting with the Leadership of the Union is ongoing at the moment."
  },
  {
    "headline": "Jonathan warns Bayelsa youths against hostilities",
    "summarized_story": "Former President, Goodluck Jonathan, has urged youths in Bayelsa State communities to shun hostile activities that will scare away investors, if the state must be develop.\nJonathan advised them to always work in collaboration with the traditional institutions of their various communities, rather than become obstacles to the develop brought to them by investors.\n“I knew that one day, they will come and invest to open up the state, and that is what we are witnessing today.\n“The in-country blending capacity has remained constant at about 150 million liters showing a shortage of about 100million liters.\nThis shortfall is met by importation of finished lube oil products with the attendant loss of revenue and job opportunities.”"
  },
  {
    "headline": "Stakeholders back proposed NATFORCE bill amid Custom’s opposition",
    "summarized_story": "The support followed the presentation of memoranda at a one day public hearing of the Senate Committee on National Security and Intelligence.\nStakeholders maintained that the proliferation of small arms and light weapons has been the major challenge confronting the nation and triggering insecurity, adding that establishing a Commission to coordinate arms mop-up was ideal now.\nStating its own position on the bill, the Office of the National Security Adviser (NSA) and the Nigeria Customs Service however differed on the proposed legislation.\nConsequently, Lawan noted this has precipitated the gathering of stakeholders on National Security and intelligence.\nDr. Yakubu Dadu, head of ECOWAS National office at the Ministry of Foreign Affairs, said “we are in support of the bill”."
  },
  {
    "headline": "JAMB UTME results should be valid for 3 years – Lawmaker",
    "summarized_story": "Rep. Tolulope Akande-Sadipe has proposed a longer validity period for results of the Unified Tertiary Matriculation Examination (UTME) conducted by the Joint Admissions and Matriculations Board (JAMB).\nThe lawmaker (APC – Oluyole) is the Chairman, House of Representatives Committee on Diaspora Matters.\nThe bill was sponsored on the floor of the House to amend the law establishing JAMB.\nAkande-Sadipe said the law should be amended to increase the validity of UTME to three years.\nAkande-Sadipe added that the amendment would minimise the cost of running the examination, allow candidates to plan, project and decide their choices."
  },
  {
    "headline": "BREAKING: EFCC arrests Obiano at Lagos airport",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has arrested immediate past Anambra Governor Willie Obiano at the Murtala Muhammed International Airport (MMIA), Lagos.\nObiano was reportedly arrested around 8.30pm on Thursday.\nRead Also: VIDEO: Obiano’s wife, Bianca Ojukwu in free-for-all at Soludo’s inaugurationIt was gathered the former Governor was on his way to Houston, Texas in the United States.\nHe was arrested hours after he handed over to Prof Charles Chukwuma Soludo.\nEFCC spokesman Wilson Uwujaren confirmed the arrest."
  },
  {
    "headline": "Bandits reportedly abduct 48 in Southern Kaduna community",
    "summarized_story": "No fewer than 48 persons have been reportedly kidnapped in Agunu Dutse, Agunu ward of Kachia Local Government Area of Kaduna state.\nKachia local government is in the southern part of Kaduna State.\nA traditional title holder from the community, Maurice Tanko confirmed this to journalists on Thursday evening.\nHe said the kidnappers stormed the area around 12:30am on Thursday.\nAnother resident, Philip John, said the terrorists invaded the community on foot in the early hours of Thursday at about 1 am."
  },
  {
    "headline": "Court orders Ex-Chief of Air Staff to refund N57m or lose Abuja home",
    "summarized_story": "The Federal High Court sitting in Abuja has ordered a former Chief of Air Staff, Air Marshal Mohammed Umar Dikko (Rtd), to refund N57million to the Federal Government within seven days or lose his house in Abuja.\n“In the event of failure by the Defendant to comply with the above orders of the Court, the Defendant’s property known as House No.\nDikko, who piloted the affairs of the Nigerian Air, NAF, between September 2010 and October 2012, was arraigned before the court on January 25, 2017 by the Economic and Financial Crimes Commission (EFCC).\nFollowing a directive of the court, the Defendant, opened his defence by appearing as his own witness in the matter.\n“The Court must invoke its special powers and take such measures as the justice of the case dictates."
  },
  {
    "headline": "Gunmen kill community leader, three others in Imo",
    "summarized_story": "Gunmen kill community leader, three others in ImoGunmen on rampage have killed a community leader in Ihube in Okigwe Local Government Area of Imo State and three others.\nBut Imo Police spokesman, CSP Michael Abattam, said he was not aware of the incident which took place on Wednesday.\nA source said the killing of the community leader, said to be a traditional title holder in the area, triggered other killings.\nRead Also: Gunmen kill two prison officials in ImoIt was gathered the two policemen reportedly killed ran into the gunmen.\nThe incident caused panic in the entire community as most of the residents, according to sources, have deserted their homes."
  },
  {
    "headline": "UPDATED: OAU appoints Prof Bamire as new Vice-Chancellor",
    "summarized_story": "The management of Obafemi Awolowo University(OAU), Ile-Ife on Thursday announced Professor Adebayo Bamire of Agricultural Economics, Faculty of Agriculture of the institution, as the 12th Vice-Chancellor.\nHe said Bamire defeated 19 other applicants to emerge the 12th Vice-Chancellor of the university.\n“The interaction with the candidates began on Monday, 14th March 2022 and ended on Wednesday, 16th March 2022.\nAll the sixteen candidates appeared before the Joint Council and Senate Selection Board, with fifteen of them present physically and one, at his request, virtually.\nThe Selection Board painstakingly examined the Curriculum Vitae and interacted with each candidate, and scored them accordingly to stipulated criteria."
  },
  {
    "headline": "BREAKING! EFCC arrests Obiano in Lagos",
    "summarized_story": "The Economic and Financial Crimes Commission on Thursday arrested former Anambra State Governor, Willie Obiano at the Murtala Muhammad International Airport, Lagos.\nObiano, who has been on the Commission’s watchlist for months, was arrested at about 8.30pm.\nHe was reportedly on his way out of the country to Houston, Texas in the United States after handing over to his successor, Governor Charles Soludo.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nIt is, however, not yet clear why the anti-graft agency placed the governor on a watchlist."
  },
  {
    "headline": "Igbo youths declare war on Obiano’s wife for assaulting Bianca",
    "summarized_story": "Condemning her action in a statement released to newsmen in Owerri by the President General of the Igbo group, Goodluck Ibem, it further described her attitude towards Ojukwu’s wife as despicable and disrespectful.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\n‘It is the height of insult on the entire Igbo nation for Mrs Obiano to slap the wife of our revered and great Igbo Leader and Icon Dim Chukwuemeka Odimegwu Ojukwu.\nMrs Obiano has exposed to the entire world that she is an untrained and uncouth low life,’ the group said."
  },
  {
    "headline": "BREAKING: Govs Buni, Bello, other CECPC members in close door meeting",
    "summarized_story": "From Romanus Ugwu, AbujaThere is light at the end of the tunnel over the leadership crisis rocking the All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC) as the gladiators are currently in a close door meeting at the Yobe State Governor’s Lodge, Abuja.\nThe meeting which started around 5.00pm, had in attendance all the members of both factions of the Caretaker Committee including the duo of Governors Mai Mala Buni and his Niger State counterpart, Governor Sani Bello, without embattled CECPC Secretary, Senator John James Akpanudoedehe.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nA source at the meeting told Daily Sun that the meeting has become absolutely necessary 5o enable them iron out teething areas of difference and bridge the gap the leadership crisis which started last week has created."
  },
  {
    "headline": "(UPDATED)Drama as Obiano’s wife attacks Bianca at Soludo’s inauguration",
    "summarized_story": "Ebelechukwu is the wife of the immediate past governor, Chief Willie Obiano, while Bianca is the wife of the later Igbo leader, Dim Chukwuemeka Odumegwu Ojukwu.\nAfter exchanging pleasantries with a few of her friends in attendance, Mrs Obiano walked straight to were Mrs Ojukwu was seating and assaulted her.\nDignitaries who attended the inauguration of the new Anambra State Governor, Professor Charles Soludo were shocked when the wife of the former governor Mrs Ebelechukwu Obiano engaged in a fight with Ambassador Bianca Ojukwu.\nHowever, it was gathered that Mrs Obiano, prior to the fight, was angered by other activities at the event.\nThe action drew the attention of security agents and some personalities who pulled Mrs Obiano off the hold of Mrs Ojukwu who was visibly shocked at the action."
  },
  {
    "headline": "breaking-soludo-sworn-in-as-governor-of-anambra-state",
    "summarized_story": "From Obinna Odogwu, AwkaChief Judge of Anambra State, Justice Onochie Anyachebelu, on Thursday morning, administered the oath of office on Prof. Chukwuma Soludo as the new governor of the state.\nSoludo, former Central Bank of Nigeria (CBN) governor, won the November 6, 2021 governorship election on the platform of the All Progressives Grand Alliance (APGA).\nHe took the oath of office at about 9:50am.\nBefore he was sworn in, his deputy, Dr Onyeka Ibezim, took his oath of office.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly."
  },
  {
    "headline": "Breaking: EFCC Arrests Obiano at Lagos Airport",
    "summarized_story": "The Economic and Financial Crimes Commission has arrested the immediate past Governor of Anambra State, Willie Obiano, at the Murtala Muhammed International Airport, Lagos.\nSources said he was arrested at about 8pm o Thursday, while trying to board a flight to the United States, hours after he attended the inauguration of his successor Prof Chukwuma Soludo.\nObiano had been on the watch list of the EFCC following the commission’s letter to the Comptroller General of the Nigeria Immigration Service on November 15, 2021, requesting immigration to place Obiano on a watch list and inform it anytime he is travelling out of the country from any of the International airports and other points of entry and exit.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Just In: Buni Overrules Akpanudoedehe, Says Bello’s Convention Subcommittees’ Stand",
    "summarized_story": "Adedayo Akinwale in AbujaThe Chairman of the Caretaker/Extraordinary Convention Planning Committee (CECPC) and the Governor of Yobe state has denied disbanding the convention sub-committees inaugurated by the Governor of Niger state, Abubakar Bello, while acting as the chairman of the party.\nMai Mala Bum, please find below the list of Chairmen, Deputy Chairmen and Secretaries of the various sub-committees for the 2022 APC National Convention (as earlier published),” Akpanudoedehe had said.\nBut Buni in a statement issued hours later titled, “Refutal” noted that the media report about the dissolution of the committees was not true.\nHe said, “Therefore, all actions and measures taken by the Committee under his leadership as Acting Chairman, remain effective.\nThe party calls for support and understanding to move the Party forward to a successful Convention slated for March 26th, 2022.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Updated: Drama, as Obiano’s Wife, Bianca Ojukwu Fight at Soludo’s Inauguration",
    "summarized_story": "*Soludo apologises, says fight caused by protocol breachBy David-Chyddy Eleke in AwkaWife of former governor of Anambra State, Mrs Ebelechukwu Obiano, on Thursday engaged in a fight with Ambassador Bianca Ojukwu.\nMrs Ojukwu is the wife of Chief Emeka Odumegwu Ojukwu, the late leader of the All Progressives Grand Alliance, APGA.\nThe fight started when Mrs Obiano walked up to Mrs Ojukwu where she was seated close to former governor Willie Obiano.\nIn a trending video on social media, Mrs Obiano was seen talking to Mrs Ojukwu.\nEarlier, THISDAY witnessed the arrival of Mrs Obiano as she was stopped at the gate, when her convoy attempted to use the main gate."
  },
  {
    "headline": "Breaking: Soludo Sworn in as Anambra Governor",
    "summarized_story": "David-Chyddy Eleke in AwkaProf Chukwuma Soludo has been sworn in as the Governor of Anambra State.\nHe was sworn in by the state Chief judge, Justice Onochie Anyachebelu at exactly 9:45am, at the Anambra State Government House.\nThe event was witnessed by several dignitaries, including the immediate past governor, Chief Willie Obiano and his wife, Mrs Ebelechukwu, and all the 30 members of the Anambra State House of Assembly.\nAs at the time of filling this report, the new governor was already inspecting the guard of honour, his first task as governor of the state.\nThe governor had earlier stated that immediately after being sworn in, he would proceed to Okpoko, a sprawling slum, near Onitsha, where he would spend eight hours, working to provide a better living for the people."
  },
  {
    "headline": "Breaking: Buni Disbands Bello’s Convention Subcommittees",
    "summarized_story": "Adedayo Akinwale in AbujaThe Chairman of the Caretaker/Extraordinary Convention Planning Committee (CECPC) of the All Progressives Congress (APC) and the Governor of Yobe state, Mai Mala Buni has disbanded the convention subcommittees for the March 26 national convention put in place by Niger state Governor, Abubakar Bello.\nBuni in a statement issued Thursday reassured members and stakeholders of the party, as well as Nigerians in general, that the governing party was crisis-free.\nIn the disbanded subconmittees constituted by Bello when he acted as chairman last week, Buni and Akpanudoedehe’s names were conspicuously missing.\nWith the latest development, the subcommittees earlier constituted by Buni will now take charge of preparations for the convention.\nDapo Abiodun of Ogun state as the Elections/Planning Committee Chairman, while the Elections Appeal Committee is chaired by Katsina state Governor, Aminu Masari."
  },
  {
    "headline": "How I Turned Down Tinubu’s Request To Be My Vice Presidential Candidate In 2007 – Atiku Abubakar",
    "summarized_story": "Former Vice President Atiku Abubakar has narrated how he turned down the offer made by former Lagos State Governor, Bola Tinubu, in 2007.\nDuring the running battle with Obasanjo, Atiku defected from the PDP and clinched the AC presidential ticket.\nI said no, ‘I’m not going to make you Vice President,’ instead, I took Senator Ben Obi,” Atiku said.\nTinubu is currently one of the presidential aspirants of the ruling APC, while Atiku is one of the major contenders for the PDP presidential ticket.\nAtiku added that when he got the ticket again in 2019 to run, he took another Obi coincidentally."
  },
  {
    "headline": "How I Turned Down Tinubu’s Request To Be My Vice Presidential Candidate In 2007 – Atiku Abubakar",
    "summarized_story": "Former Vice President Atiku Abubakar has narrated how he turned down the offer made by former Lagos State Governor, Bola Tinubu, in 2007.\nDuring the running battle with Obasanjo, Atiku defected from the PDP and clinched the AC presidential ticket.\nI said no, ‘I’m not going to make you Vice President,’ instead, I took Senator Ben Obi,” Atiku said.\nTinubu is currently one of the presidential aspirants of the ruling APC, while Atiku is one of the major contenders for the PDP presidential ticket.\nAtiku added that when he got the ticket again in 2019 to run, he took another Obi coincidentally."
  },
  {
    "headline": "How I Turned Down Tinubu’s Request To Be My Vice Presidential Candidate In 2007 – Atiku Abubakar",
    "summarized_story": "Former Vice President Atiku Abubakar has narrated how he turned down the offer made by former Lagos State Governor, Bola Tinubu, in 2007.\nDuring the running battle with Obasanjo, Atiku defected from the PDP and clinched the AC presidential ticket.\nI said no, ‘I’m not going to make you Vice President,’ instead, I took Senator Ben Obi,” Atiku said.\nTinubu is currently one of the presidential aspirants of the ruling APC, while Atiku is one of the major contenders for the PDP presidential ticket.\nAtiku added that when he got the ticket again in 2019 to run, he took another Obi coincidentally."
  },
  {
    "headline": "2023: Desperate To Install A Stooge As Governor, Enugu Government Cabal Bribes Lawmakers With N5m Each To Endorse Zoning",
    "summarized_story": "“Besides, I don’t want to be a zonal governor, but the governor of the entire people of Enugu State,” he said.\nOne of the sources, a member of the State House of Assembly from Enugu North revealed: \"We were summoned up today (Monday) at the Majority Leader's (Hon.\nIkechukwu Ezeugwu's) house to sign a document prepared for House Members and LGA Council Chairmen of our (Enugu North) zone to the effect that there is zoning.\nAnother lawmaker who confirmed the situation said, \"Unfortunately, we thought by now all aspirants should be encouraged to table their programmes on how to end insecurity in Enugu State.\nIt was learnt that Ekweremadu is a dominant force in Enugu West and some prominent people in government, including the state governor, Ifeanyi Ugwuanyi."
  },
  {
    "headline": "2023: Desperate To Install A Stooge As Governor, Enugu Government Cabal Bribes Lawmakers With N5m Each To Endorse Zoning",
    "summarized_story": "“Besides, I don’t want to be a zonal governor, but the governor of the entire people of Enugu State,” he said.\nOne of the sources, a member of the State House of Assembly from Enugu North revealed: \"We were summoned up today (Monday) at the Majority Leader's (Hon.\nIkechukwu Ezeugwu's) house to sign a document prepared for House Members and LGA Council Chairmen of our (Enugu North) zone to the effect that there is zoning.\nAnother lawmaker who confirmed the situation said, \"Unfortunately, we thought by now all aspirants should be encouraged to table their programmes on how to end insecurity in Enugu State.\nIt was learnt that Ekweremadu is a dominant force in Enugu West and some prominent people in government, including the state governor, Ifeanyi Ugwuanyi."
  },
  {
    "headline": "Obiano in EFCC custody -- hours after leaving office as Anambra governor",
    "summarized_story": "Willie Obiano, immediate past governor of Anambra, is currently in the custody of the Economic and Financial Crimes Commission (EFCC).\nWilson Uwujaren, spokesman of the anti-graft agency, confirmed the development to TheCable on Thursday night.\nObiano, who ended his tenure on Wednesday, was taken into custody hours after he attended the inauguration of Chukuwuma Soludo as governor of Anambra.\nAdvertisementThe development comes months after the former governor was placed on the EFCC watch list.\nBasil Ejidike, Anambra APC chairman, had alleged that Obiano was “fraudulently” using the state’s security vote."
  },
  {
    "headline": "Obiano in EFCC custody -- hours after leaving office as Anambra governor",
    "summarized_story": "Willie Obiano, immediate past governor of Anambra, is currently in the custody of the Economic and Financial Crimes Commission (EFCC).\nWilson Uwujaren, spokesman of the anti-graft agency, confirmed the development to TheCable on Thursday night.\nObiano, who ended his tenure on Wednesday, was taken into custody hours after he attended the inauguration of Chukuwuma Soludo as governor of Anambra.\nAdvertisementThe development comes months after the former governor was placed on the EFCC watch list.\nBasil Ejidike, Anambra APC chairman, had alleged that Obiano was “fraudulently” using the state’s security vote."
  },
  {
    "headline": "FAKE NEWS ALERT: Hushpuppi didn't commit fraud in prison, says US",
    "summarized_story": "The justice department in the United States has denied reports that Hushpuppi, the embattled socialite, pulled off a $400,000 fraud from inside prison.\nAdvertisementReports had earlier claimed that US prosecutors indicted Hushpuppi for fresh fraud and money laundering.\n“Knowing that Hushpuppi was arrested for internet-related crimes, they obtained a warrant to record Hushpuppi’s activities.\nThe socialite would later plead guilty to money laundering, putting him at the risk of 20 years imprisonment.\nAdvertisementAlthough Kyari dismissed the allegation, a probe by the FBI claimed the detective indeed collaborated with Hushpuppi."
  },
  {
    "headline": "FAKE NEWS ALERT: Hushpuppi didn't commit fraud in prison, says US",
    "summarized_story": "The justice department in the United States has denied reports that Hushpuppi, the embattled socialite, pulled off a $400,000 fraud from inside prison.\nAdvertisementReports had earlier claimed that US prosecutors indicted Hushpuppi for fresh fraud and money laundering.\n“Knowing that Hushpuppi was arrested for internet-related crimes, they obtained a warrant to record Hushpuppi’s activities.\nThe socialite would later plead guilty to money laundering, putting him at the risk of 20 years imprisonment.\nAdvertisementAlthough Kyari dismissed the allegation, a probe by the FBI claimed the detective indeed collaborated with Hushpuppi."
  },
  {
    "headline": "Buni returns from medical trip, takes charge of APC",
    "summarized_story": "Mai Mala Buni, governor of Yobe and chairman of the All Progressives Congress (APC) caretaker committee, has returned to Nigeria following a medical trip abroad.\nAdvertisement“Put the recent events in the party behind you and work towards a successful convention,” Buni was quoted as saying.\n“As we head towards the national convention, the party needs the support of every stakeholder and member to succeed.\nSubsequently, reports emanated that the Buni-led caretaker committee was working to scuttle the APC national convention.\nOn Wednesday, President Muhammadu Buhari asked APC governors to allow Buni to plan the national convention."
  },
  {
    "headline": "Big Cabal Media raises $2.3m to expand its compelling line of digital products",
    "summarized_story": "In 2021, venture capital invested $115 million in digital media globally, a tenth of the $1.1billion it funded in 2015, but not much came to Africa.\nToday, one of such exceptions, Big Cabal Media (BCM), a leading African digital media company, has announced a $2.3 million Seed funding round, emphasising its commitment to keep building exciting and authoritative media products and brands.\nBCM’s progress over the years and recent fundraise is a noteworthy example of the possibilities and opportunities in Africa’s digital media sector.\nOf the reported $4.3–$5 billion raised by African startups in 2021 whereby fintech received 53–63% of the volume, digital media companies are one of many sectors that have traditionally been overlooked in the conversation of tangible ventures.\n“Investing in Africa’s booming digital media sector aligns perfectly with MaC’s mission of supporting exceptional entrepreneurs building valuable technology companies that leverage shifts in cultural trends and behaviours."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal is set to launch a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Sokowatch launches in Senegal and Côte d’Ivoire after $125m round",
    "summarized_story": "Sokowatch, an e-commerce company offering tech-enabled supply chain solutions to Africa’s informal retailers, on Wednesday said it has closed a $125 million Series B equity round at a valuation of $625 million, per TechCrunch.\nInitially launched in Kenya by founder and CEO Daniel Yu in 2015, Sokowatch scaled into neighboring East African markets Tanzania, Rwanda, and Uganda in 2018.\nThrough Wasoko’s platform, informal retailers are able to order products at any time via SMS or mobile app for free same-day delivery to their stores.\n“If you look at the past 10 years, both Senegal and Cote d’Ivoire have experienced solid year-on-year GDP growth,” the CEO said.\nThe new capital will enable Wasoko to drive further geographic expansion and product growth across the continent, according to the company."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Did you miss Apple’s first event of the year?\nI did, but I saw a recap and the best way to describe my reaction is..."
  },
  {
    "headline": "Inside Dream VC’s plan to build a pipeline for African VC talent",
    "summarized_story": "However, very few understand or are even aware of the venture capital space, but Mark Kleyner and Cindy Ai want to demystify the space with Dream VC.\nInterestingly, VC funding only became common in the past decade, and so there is a gaping talent hole, which Dream VC was launched to fill.\nThe goal was to help them break into the VC space,” he added.\nHaving tested their hypothesis, Dream VC would be launching two programmes: the Launch into VC Program and the Investor Accelerator Program.\nLaunch into VC is a fully remote 13-week programme targeted at early-stage professionals looking to break into the VC space."
  },
  {
    "headline": "African B2B eCommerce on growth streak",
    "summarized_story": "The eCommerce startup also got a makeover, changing its name from Sokowatch to Wasoko, meaning people of the market.\nThe B2B model: Like TradeDepot, Alerzo and other eCommerce startups that have raised funds from 2021, B2B is the dominant model.\nAs B2B continues to be the go-to model for eCommerce in Africa, only time will tell how sustainable it is.\n4G Capital’s $18m fundingKenyan fintech startup, 4G Capital, has raised $18 million in a Series C round led by Lightrock.\nA touch of eCommerce: 4G Capital plans to roll out new products, including an app, later this year."
  },
  {
    "headline": "On a real estate pre-seed, Jumia’s falling stocks, and regulatory competition",
    "summarized_story": "But sometimes, we have to ask, how much of Africa’s big picture narratives affect our everyday lives?\nThe big picture: A financing solution only addresses part of the problems mentioned above.\nFacebook’s parent company, Meta, could face prosecution from the South African Competition Commission for placing restrictions on the government-owned platform, GovChat.\nThe big picture: Like I pointed out earlier big tech companies might be expecting antitrust allegations every day of the week.\nRead more: Meta faces prosecution in South Africa for alleged antitrust breachInterested in diving deeper into this issue, especially as it relates to Africans?"
  },
  {
    "headline": "Cash-strapped Nigeria’s desperation shows with $1.25bn Eurobond sale",
    "summarized_story": "Nigeria’s urgent need of cash was evident Thursday as Africa’s top oil producer sidestepped rising global interest rates to sell dollar bonds of $1.25 billion.\nThe timing of the deal also coincides with rising yields worldwide as global central banks raise interest rates to pre-pandemic levels to tame rising inflation.\n“It was unexpected,” Tatonga Rusike, the London-based sub-Saharan Africa economist at Bank of America Corp, said of Nigeria’s Eurobond sale.\nThe World Bank estimates Nigeria’s subsidy bill will top N4 trillion ($9.6 billion) this year.\n“It’s shocking the pain we are willing to go through to keep the costly petrol subsidy in place,” the banker said."
  },
  {
    "headline": "PHOTO: Gas tanker explosion at Ijora, Lagos",
    "summarized_story": "Get real time updates directly on you device, subscribe now."
  },
  {
    "headline": "Nigeria’s struggling economy in 7 charts",
    "summarized_story": "Nigeria’s economy has continued to struggle to keep up to its title ‘Africa’s largest economy’ with its dwindling oil production, low standard of living, and the rising cost of goods and services.\nThis however isn’t the case for Nigeria, Africa’s biggest economy, which has seen a decline in oil production over the past months.\nNigeria, Africa’s largest oil producer has continued to see instability with its oil production.\nRead also: Nigeria’s economy unravels at worst time ahead electionsThe latest oil production is a decline from the 1.39 million barrels of oil produced in January 2022.\nWhile the oil cartel indicated that the increasing oil price might have provided ample support for the Nigerian economy."
  },
  {
    "headline": "Obaseki disclaims social media statements by mischief makers – Nigerian Observer",
    "summarized_story": "There has been a flurry of statements and comments on social media by mischief makers who are hiding under the pretext of the ongoing conversation between leaders within the Peoples Democratic Party (PDP) to stir crisis and cause disaffection.\nThese statements and irresponsible behaviour are outrightly condemned.\nWe hereby distance ourselves from the actions of these detractors.\nThe National leadership of the party is already dealing with the issues and we are open to the harmonious resolution of whatever concerns that may arise.\nH. EGodwin Obaseki"
  },
  {
    "headline": "Edo commits to pensioners’ welfare, assures on clearing issues with gratuities, harmonized pay – Nigerian Observer",
    "summarized_story": "Comrade Philip Shaibu, disclosed this while addressing pensioners in the Ring Road area of Benin City.\nShaibu noted, “We have addressed the issue of pensions.\nWe have been having issues on how to resolve the challenge with the payment of gratuities.\nWe have agreed that the Head of Service Committee will continue with the discussion on how to resolve the issue.\nHe added: “Just like we addressed the issue of pension, which we have resolved, we will also resolve this issue."
  },
  {
    "headline": "CVR: INEC registers 103,101 in Edo – REC – Nigerian Observer",
    "summarized_story": "Mr Johnson Alalibo, the State Resident Electoral Commissioner (REC), made this known at a stakeholders meeting on Continuous Voter Registration (CVR), in Benin.\nAlalibo, who noted that the figure was not encouraging, appealed to stakeholders to mobilise their people for the ongoing registration, especially in the newly created polling units.\n“In June 2021, the continuous voter registration commenced online, but restricted to the local and state government offices of the commission.\nHe, however, warned against double registration, adding that anyone caught to have engaged in double registration risked the total loss of his or her registration.\nThe REC further explained that due to the limited available number of INEC Voter Enrolment Devices (IVED), the voter registration exercise would be rotational as more devices were being expected."
  },
  {
    "headline": "ROK Studios shooting 50 films in Edo, partners govt’s creative hub initiative – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… trains youths on scriptwriting, cinematography, sound engineeringBENIN CITY – The Edo State Government, through the Victor Uwaifo Creative Studio and Sound Stage (VUHSS) has partnered ROK Studios on the production of 50 films in the state for distribution across its network.\nThe partnership has birthed training programmes for creatives and other youths in the state on scriptwriting, cinematography, and sound engineering.\nThe Victor Uwaifo Creative Studio and Sound Stage is part of efforts by the Governor Godwin Obaseki-led state government to up-skill content creators in Edo State with the sole vision of building Edo State into a hub for Nigeria’s creative industries.\nAccording to the Managing Director of Edo State Skills Development Agency, Mrs. Ukinebo Dare, “A wonderful opportunity we have in Edo today is the ongoing partnership between the Victor Uwaifo Creative Studio and Sound Stage (VUHSS) and ROK STUDIOS.\n“The partnership between VUHSS and ROK Studio began in January, and since then, it has boosted the visibility of the hub and made it a beehive of buzz and activity."
  },
  {
    "headline": "BREAKING: EFCC arrests Willie Obiano, ex Anambra governor at Lagos airport",
    "summarized_story": "Former Anambra State governor, Willie Obiano, has been arrested by the Economic and Financial Crimes Commission (EFCC).\nObiano who handed over to Charles Soludo on Thursday, was reportedly arrested on at the Murtala Muhammad International Airport, Lagos.\nObiano, who has been on the Commission’s watchlist, was arrested at about 8.30pm.\nHe was on his way out of the country to Houston, Texas in the United States, Channels TV reported."
  },
  {
    "headline": "Emeka Obasi, I was at your house, the oxygen cylinders are no more [1]",
    "summarized_story": "That brings me to the oxygen cylinders.\nYou only called your boy, Micah, to come and fix it, and only became agitated when he couldn’t come on time.\nSo, when I heard about the so called passing of yours, I knew that they didn’t know what they were saying.\nWell, I came to your house as usual, but strangely, the oxygen cylinders were gone and the tube was nowhere to be found.\nEvidently, you had gotten rid of the oxygen cylinders as you said you would do soon."
  },
  {
    "headline": "NERC to hike electricity tariff every six months over falling value of naira",
    "summarized_story": "The Nigerian Electricity Regulatory Commission (NERC) has said electricity tariffs will now be increased every six months to adjust to foreign exchange and inflation requirements.\nThe NERC boss said the policy decision to stop the electricity subsidy is as announced by the Minister of Finance.\nThe NERC boss admitted that there was an adjustment in tariff in February this year following some economic fundamentals considered by the commission.\n“We had a meeting two days ago to see how NNPC and shell can expedite the repair of the gas plant so that it can ramp up to cover generation.\n“We also have the Niger Delta power plant and the Federal Government has invested in 10 new plants out of which eight are operational."
  },
  {
    "headline": "Prince Emeka Obasi, an outstanding journalist – Ibori",
    "summarized_story": "Chief James Onanefe Ibori, former Delta State Governor, has described the death of Prince Emeka Obasi who died Tuesday 15th March as a great loss to the nation.\nHe said that Emeka Obasi was not only a journalist but a man of many parts; an excellent and fearless reporter and uncommon essayist who spiced his columns with little known facts, histrionics and captivating drama.\nIbori said that Emeka Obasi had candor, confidence, fearlessness and panache.\nHe said that Nigerian journalism will greatly miss him as the vacuum his death has caused will be difficult to fill.\nAs Ibori consoled his family, he prayed that God would grant his soul eternal rest."
  },
  {
    "headline": "2023: Buhari Should Endorse Emefiele For Presidency – Group",
    "summarized_story": "The Save Nigeria Project has endorsed the Central Bank of Nigeria Governor, Godwin Emefiele for Presidency of the country come 2023 urging President Muhammadu Buhari to accept, anoint and project him to the Nigerian people as his choice.\nConvener of the group, Peter Abang said Emefiele has shown unprecedented sagacity as Governor of the country’s central bank stating that his initiatives for small, medium, and large scale enterprises have been extraordinary and exceptional.\nADVERTISEMENTThe group stated other qualities that informed their choice to include that the candidature of Emefiele will continue, consolidate and expand the visions and landmark legacies of President Buhari.\n“He is a patriot who has been part of the success recorded and ready to sustain them.\nHe is not a controversial person and is very accommodating of our country’s diversities” he added."
  },
  {
    "headline": "Customs Intercepts Trucks Of Foreign Rice, N37.8m Second-hand Shoes",
    "summarized_story": "The Nigeria Customs Service (NCS), on Thursday, disclosed that Chinese nationals smuggled into the country, N37.8million used shoes, already declared as contrabands.\nThe NCS unit also intercepted eight trucks of foreign parboiled rice smuggled into the country from the neighbouring Benin Republic.\nMeanwhile, the unit also intercepted eight trucks of foreign parboiled rice smuggled into the country from Benin Republic.\nYusuf said the smuggled rice and other contraband were intercepted along the nation’s borders and warehouses across the state.\nADVERTISEMENTOthers were 663 sacks of used shoes worth N37.8million, 44 sacks of donkey skin, N2.42million and 137.3kg of Canabis Sativa worth, N13million."
  },
  {
    "headline": "Buhari Mourns Hallmark Newspaper Publisher, Obasi",
    "summarized_story": "President Muhammadu Buhari has joined the Obasi family, Nigerian Union of Journalists (NUJ) and Nigeria Guild of Editors (NGE) in mourning the passing of the publisher of Hallmark Newspapers, Prince Emeka Obasi.\nThe President in a statement by his media aide, Femi Adesina, also commiserated with friends and professional colleagues, especially members of the Newspaper Proprietors Association of Nigeria (NPAN) over the sad loss of the veteran journalist and administrator, who served as Commissioner of Information in Abia State.\nPresident Buhari affirmed that Prince Obasi lived a patriotic life, contributing to the growth of the nation and welfare of citizens, setting up legacies like the Public Policy Research and Analysis Centre (PPRAC), which organises the annual Zik Prize in Leadership Awards.\nPresident Buhari, therefore, prayed that God will accept the soul of the departed, and comfort all those who mourn him.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Buni Denies Disbanding Bello-constituted Convention C’ttees",
    "summarized_story": "The Chairman of the Caretaker/Extraordinary Convention Planning Committee (CECPC) of the All Progressives Congress (APC) and the Governor of Yobe state, Mai Mala Buni has refuted media reports suggesting that he has disbanded the convention subcommittees for the March 26 national convention comstituted by Niger State governor, Abubakar Bello.\nIn a statement he personally signed today, Buni who had been out of the country on medical vacation said all activities carried out in his absence remain valid and binding.\n“It could be recalled that I had duly transmitted power to His Excellency, the Niger State Governor, H.E.\nTherefore, all actions and measures taken by the Committee under his leadership as Acting Chairman, remain effective.\n“The Party calls for support and understanding to move the Party forward to a successful Convention slated for March 26th, 2022.”ADVERTISEMENT"
  },
  {
    "headline": "A’Ibom 2023: Onofiok Declares For Guber Race, Promises To Build The People",
    "summarized_story": "A former p Speaker of the Akwa Ibom State House of Assembly and chairman, House of Representatives Committee on Federal Judiciary, Onofiok Akpan Luke, has declared his intention to succeed Governor Udom Emmanuel in 2023.\nLuke, who also marked his 44th birthday anniversary at Ibom Hall in Uyo, said he remains the best among the crop of governorship aspirants in the State.\nAccording to the federal lawmaker, human capital development and empowerment of the masses, will form the thrust of his administration when elected into office as governor next year.\nHe listed education, healthcare, empowerment, investment drive, infrastructure, among others, as critical sectors he will focus on as governor of the oil-rich State.\nADVERTISEMENT“I represent the bridge between the past, the present and future, I represent the young and the old, the analog and the digital generation, the rich and the poor, the haves and the have-nots."
  },
  {
    "headline": "Anambra: Real Cause Of Fight Between Obiano’s Wife, Bianca Ojukwu Revealed",
    "summarized_story": "Facts about the fight that ensued between the wife of former governor of Anambra State, Ebelechukwu Obiano and Bianca, the widow of late Chief Emeka Ojukwu, have emerged.\nAccording to Vanguard, the fight began when the former governor’s wife, who was said to have had issues with Bianca, called her a witch.\nShe was said to have walked up to Bianca and engaged her in a conversation which led to the fight.\nYou said we will never win the governorship and here you are.\nYou are a witch” Ebelchukwu Obiano told Bianca Ojukwu."
  },
  {
    "headline": "Soludo Inauguration: Anambra Police Speaks On Arresting Bianca Ojukwu And Ebelechukwu Obiano",
    "summarized_story": "The Anambra police command has laid to rest claims of possibly arresting wife of outgoing Governor of Anambra State, Ebelechukwu Obiano; and widow of the late Chukwuemeka Odumegwu-Ojukwu, Bianca, over their fight at the swearing-in ceremony of Charles Soludo as Governor of Anambra state today March 17.\nThe Police Command noted that it saw no need to arrest the two women for breach of public peace, as the event went on after security personnel de-escalated the tension.\nThe command however stated that if there’s any need to interface between the two, they will do so.\nThe police said in a statement;"
  },
  {
    "headline": "Akpanudoedehe Absent As Buni, Sani Bello, CECPC Members Meet – Details",
    "summarized_story": "The Chairman of the Caretaker/Extraordinary Convention Planning Committee (CECPC) of the ruling All Progressives Congress (APC), Governor Mai Mala Buni on Thursday met with the Sani Bello-led committee who stood in while he was on medical vacation.\nThe meeting, which took place at Yobe State Governors’ Lodge in Asokoro, attracted all members of the caretaker except the Secretary, Senator John James Akpanudoedehe.\nIt was gathered the Yobe Governor met with chairman of the Progressive Governors Forum (PGF) Governor Abubakar Atiku Bagudu where he was briefed on the outcome of the forum’s meeting on Wednesday night.\nSources close to the CECPC said the Sani Bello-led team met at the Niger Governor’s Lodge, which is a stone throw to Yobe’s before proceeding to Yobe Lodge with other members of the committee.\nSani Bello acted as the chairman when Buni was away."
  },
  {
    "headline": "JUST IN: Fuel Tanker Explodes In Lagos",
    "summarized_story": "JUST IN: Fuel Tanker Explodes In LagosOn Thursday, a gasoline-laden truck exploded beside the Lagos State Homes Estate at Ijora Palette Junction in Ijora Badiya, Lagos State.\nThe truck was leaking, according to a witness, and some passers-by alerted the driver to the problem.\nAccording to the witness, the driver got down and attempted to put out the flames with a fire extinguisher before the truck burst.\nTo protect lives and property, firefighters and a squad from the Ijora Badiya Police Division were on the scene.\nAccording to a police officer who requested anonymity, officers responded quickly to the incident and alerted the fire department, which also arrived quickly."
  },
  {
    "headline": "Breaking: EFCC arrests ‘fleeing’ Willie Obiano at Lagos airport",
    "summarized_story": "Hours after handing over to Prof. Chukwuma Soludo as governor on Thursday, the Economic and Financial Crimes Commission (EFCC) has arrested former Anambra State Governor, Willie Obiano, at the Murtala Muhammad International Airport, Lagos.\nObiano, who has been on the Commission’s watchlist for months, was arrested at about 8.30pm, Blueprint gathered.\nThe former governor was reportedly on his way out of the country to Houston, Texas in the United States.\nDetails loading…"
  },
  {
    "headline": "Expectations as Soludo kicks off tenure as Anambra governor, promises conduct of LG poll, other talking points *Read his full inaugral speech",
    "summarized_story": "Today, I stand up for the millions of Ndi Anambra for whom this mandate means everything.\nIn some years, we will seek not only to export palm produce but also fresh palm wine from Anambra State.\nUmunne m Ndi Anambra, this agenda is premised upon your irrepressible and communal spirit.\nNdi Anambra outside Anambra must creatively pay their taxes in their primary residence—Anambra.\nSeize this moment Ndi Anambra, and together, let us make it count."
  },
  {
    "headline": "Breaking: Obiano’s wife, Bianca Ojukwu fight at Soludo’s inauguration",
    "summarized_story": "The wife of immediate past governor of Anambra state, Ebelechukwu Obiano, and Bianca, wife of late Odumegwu Ojukwu fought each other while the inauguration of new governor Prof. Charles Soludo was ongoing.\nThe ugly scenario was said to have played out when an oral exchange ensued between them.\nEbelechukwu has been reportedly involved in similar acts in the past with many accusing her of always wielding certain influence on her husband while he was the state governor.\nDetails loading…"
  },
  {
    "headline": "EFCC Arrests Willie Obiano At Lagos Airport",
    "summarized_story": "The Economic and Financial Crimes Commission on Thursday arrested former Anambra State Governor, Willie Obiano at the Murtala Muhammad International Airport, Lagos.\nHe was reportedly on his way out of the country to Houston, Texas in the United States after handing over to his successor, Governor Charles Soludo.\nFormer Anambra State Commissioner for Information, Don Adinuba, had, at the time, condemned the EFCC watchlist reports, claiming that they were politically motivated.\n“Governor Obiano has a whole four months to remain in office as the Anambra State chief executive,” Adinuba said.\n“The EFCC went too far to announce in November that it is observing him."
  },
  {
    "headline": "Buni Meets With Bello In Abuja, Backs Party’s Actions In His Absence",
    "summarized_story": "Both governors met at the Yobe Governor’s Logde in Abuja on Thursday after Governor Buni returned to the country from a medical trip, amid reports of a leadership tussle in the party.\nGovernor Buni, however, insisted that the actions of the party, led by Governor Bello, stood, reiterating an earlier statement he issued clarifying that no decision taken in his absence has been overturned.\nGovernor Bello on his part said that while he was acting national chairman of the party, a lot of progressive was made towards holding the national convention.\nThere had been speculations that Governor Buni was planning to postpone the APC convention for the umpteenth time.\nAmid heavy security at the APC secretariat in Abuja, Bello swiftly swore in the party’s 36 State Chairmen, part of activities scheduled before the convention."
  },
  {
    "headline": "Soludo Sworn In As Anambra Governor In Low-Key Event",
    "summarized_story": "﻿Charles Soludo has been sworn in as the fifth governor of Anambra State in a modest event that took place at the Government House on Thursday.\n‘God Ordained This Moment’He also thanked stakeholders, his supporters, Federal Government agencies like the police, and the people of Anambra State for their roles in his election last November.\nA circular by the state government showed that about 50 persons were invited for the ceremony as Soludo said he wanted a low-profile event.\nRELATEDCharles Soludo Wins Anambra Governorship ElectionWhy Obiano Supported Me To Become Anambra Governor – SoludoAnambra Election: I Knew Soludo Would One Day Be Governor, Says NgigeCourt Dismisses Suit Challenging Soludo’s ElectionThursday’s swearing-in is the culmination of a series of events leading to the programme.\nThe suit sought to nullify his win on allegations that Soludo provided false information to the Independent National Electoral Commission (INEC)."
  },
  {
    "headline": "Drama At Soludo’s Inauguration As Obiano’s Wife And Bianca Ojukwu Clash",
    "summarized_story": "There was drama on Thursday during the inauguration of Charles Soludo as Anambra State governor when Ebelechukwu, wife of ex-Governor Willie Obiano, and Bianca Ojukwu engaged in a clash.\nThe altercation reportedly occurred when Mrs Obiano went over to where Mrs Ojukuwu was sitting.\nREAD ALSO: Soludo Sworn In As Anambra Governor In Low-Key EventWhile some reports said Mrs Obiano started the clash by slapping Mrs Ojukwu, some other reports indicate that it was Mrs Ojukwu, angered by what was said to her that slapped Mrs Obiano first.\nSoludo reactsThe newly sworn-in Anambra State Governor has apologized for the clash between the two parties.\n“Anambra State has over the years been known for a huge stock of social harmony, and the stock will increase substantially in the years ahead as part of the concerted effort to accelerate the state’s development.”"
  },
  {
    "headline": "NERC Confirms Removal Of Electricity Subsidy",
    "summarized_story": "The Nigerian Electricity Regulatory Commission has confirmed the removal of electricity subsidies by the Federal Government.\nAddressing a news conference in Abuja, the Chairman of the Commission, Mr Sanusi Garba, said the review was conducted in line with multi-year tariff order that mandates that electricity tariff be reviewed every six months.\nNERC’s confirmation comes as the nation continues to confront an energy crisis amid petrol queues, rising diesel costs and national grid collapses.\nREAD ALSO: We Have Recovered The National Grid – Power MinisterMr Garba said it is the duty of electricity distribution companies to inform their customers of tariff review outcomes and cost of power.\nHe blamed the poor state of electricity supply and grid collapses on vandalism of gas pipelines to power plants, plants maintenance and a trip on the 330KV line from Ughelli power plant."
  },
  {
    "headline": "Preparations on course for March 26th APC Convention, Buni declares -",
    "summarized_story": "Speaking to journalists at the Yobe Government lodge in Abuja, Governor Buni applauded the CECPC members on the level of preparations towards the National Convention.\nWe are now at the finishing line in the preparations for our National Convention which is at hand on March 26.\nI want to emphasise that the March 26 National Convention is sacrosanct.\nGovernor Buni clarified that the visit was not a formal meeting of the CECPC.\nI can tell you for free that in the last one week, we have ensured that we are good to go for the National Convention.”"
  },
  {
    "headline": "Buni presides over APC Caretaker committee's meeting in Abuja -",
    "summarized_story": "Governor of Yobe State and Caretaker Extra-Ordinary Convention Planning Committee (CECPC) of the All Progressives Congress (APC), Mai Mala Buni on Thursday presided over a meeting with the members of the committee at the Yobe Government Lodge, Asokoro, Abuja.\nNiger State Governor, Abubakar Sani Bello member of the committee representing North Central who had acted as acting chairman of the committee for the past one week is also present along with members.\nJournalists are waiting to hear the outcome of the meeting to know if they have resolved their internal crisis as the 26th March 2020 is fast approaching for their convention."
  },
  {
    "headline": "2023: I’m joining the race to fix insecurity, economy says presidential aspirant -",
    "summarized_story": "A presidential aspirant, Nicolas Felix has disclosed that he will unveil innovative policies that will reduce the crime rate in the country.\nSpeaking at a media parley in Lagos, on Wednesday, Dr Felix said he has decided to join the 2023 race to reduce the negative perception about Nigeria across the globe.\n“Politics was never in my blood, but I realised I have to join the race to stop the complaints about Nigeria.\nIf you expect those that got the place filthy to clean it up, then you are making a big mistake.\nAs of today in Nigeria, security is a mess."
  },
  {
    "headline": "President Buhari Recognises Governor Buni as head of APC CECPC",
    "summarized_story": "President Muhammadu Buhari has written an official letter recognising Chairman of the Caretaker Extraordinary Convention Planning Committee (CECPC) of the ruling All Progressives Congress (APC) Governor Mai Mala Buni, even as he ordered a status quo ante in the party’s leadership change.\nIn a letter President Muhammadu Buhari personally signed Wed, He also ordered all members of the Progressive Governors Forum and their followers to desist from any behaviour or utterances that will lead to disunity in the ranks of the party.\nThe President copied the letter to the APC acting Chairman Governor Sani-Bello,the Inspector General of Police, Director General of Department Of State Services, Secretary to the Government of Federation, among others."
  },
  {
    "headline": "Swearing-in Ceremony of Charles Soludo As Anambra Governor – ARISE Special Report",
    "summarized_story": "1 of 6 - +Former Governor of the Central Bank of Nigeria, Charles Soludo inauguration as the Governor of Anambra State takes place at the governor house in Agu-Awka today.\nSome notable figures in attendance include the immediate past governor of Anambra, Willie Obiano, his wife; and wife of late Dim Odumegwu Ojukwu, Bianca."
  },
  {
    "headline": "Russia Accused of Bombing Theatre Sheltering Civilians, Biden Calls Putin a War Criminal",
    "summarized_story": "Moscow has yet to capture any of Ukraine’s biggest cities despite the largest assault on a European state since World War Two.\nMoscow denies targeting civilians and Russia’s defense ministry said its forces had not struck the building, RIA news agency said.\nThe U.S. Embassy in Kyiv said Russian forces had shot dead 10 people waiting in line for bread in Chernihiv, northeast of Kyiv.\n“Neutral status is now being seriously discussed along, of course, with security guarantees,” Russian Foreign Minister Sergei Lavrov said.\nPresident Volodymyr Zelensky has said Ukraine could accept international security guarantees that stopped short of its longstanding aim to join NATO."
  },
  {
    "headline": "Chris Cuomo Wants $125 Million for ‘Unlawful’ CNN Firing",
    "summarized_story": "Chris Cuomo wants an arbitrator to award him $125 million for his firing from CNN, alleging his bosses knew full well how he advised his brother, former New York Gov.\nHis filing seeking arbitration on Wednesday exposed more ugliness at the network, where Cuomo, CNN chief Jeff Zucker and his top deputy, Allison Gollust, have all been ousted in the past three months.\n“It should be obvious by now that Chris Cuomo did not lie to CNN about helping his brother,” said his lawyer, Bryan Freedman.\nDuring the height of the COVID-19 pandemic in 2020, Chris Cuomo interviewed his big brother on CNN nine times — a temporary lift of the network’s policy that Chris Cuomo not participate in stories concerning the governor.\nIn his filing Wednesday, Chris Cuomo said CNN leadership demanded the interviews even though he and his brother had expressed reservations about them."
  },
  {
    "headline": "UK: Met Police Officers Who Strip Searched Black Schoolgirl Under Investigation",
    "summarized_story": "“The horrific strip search of a Black girl at school is a clear example of why police should not be in places of education.\nAbolition makes the case for itself.”Ebinehita Iyere, founder of Milk Honey Bees, told The Independent: “From a structural level, Black girls are being let down.\nThey are criminalised through the British education system and the case of Child Q has further amplified that reality.\n“Many Black girls will read, hear or have experienced things similar to her case.\n“Society must listen to and protect Black girls."
  },
  {
    "headline": "Liverpool Beat Arsenal to Cut Man City’s Premier League Lead to One Point",
    "summarized_story": "A clinical Liverpool beat Arsenal 2-0 to cut Manchester City’s once double-digit lead at the top of the Premier League table to a single point on Wednesday, leaving the title race wide open.\nBut the game tipped decisively early in a frenetic second period as Liverpool extended their own relentless run to nine consecutive league wins.\nLiverpool’s title destiny is now very much in their own hands as they still have to visit City in April.\n“They really raised the level today but unfortunately games are won in the boxes,” he said of his side.\nA misplaced backpass by Thiago let in Martin Odegaard who looked poised to score but Alisson made a superb save."
  }
]