[
  {
    "headline": "Nine missing policemen return to camp after ISWAP attack",
    "summarized_story": "NINE police instructors reported missing after scores of Islamic State West Africa Province fighters attacked the Police Mobile Force Training College, Limankara, Gwoza, Borno State, have returned to their camp.\nThe insurgents had launched a ferocious attack on the police college on Thursday, with many Rocket-Propelled Guns for almost two hours before they overwhelmed the beleaguered policemen inside the school.\nHowever, reliable police sources explained that nine out of the 21 instructors in the school were reported missing after the insurgents broke into the college when the policemen ran out of ammunition.\n‘’The instructors ran out of ammo and the insurgents were using RPGs and the policemen did not have any RPG.\nNobody came to the rescue of the men from 8pm when the attack started till around 10pm.’’Copyright PUNCH."
  },
  {
    "headline": "Buhari presides over Armed Forces Remembrance Day in Abuja",
    "summarized_story": "The President, Major General Muhammadu Buhari (retd.\n), on Saturday presided over the 2022 Armed Forces Remembrance Day in Abuja.\nThe ceremony is the finale of activities which began on October 28, 2021 when Buhari launched the remembrance emblem at the presidential villa, Abuja.\nOthers are the Chief of Defense Staff, Gen. Lucky Irabor, service chiefs, the Nigerian Legion, among others.\nThree volleys of 21 gun salute were fired at the event followed by the signing of the Remembrance Day anniversary register by the president accompanied by heads of the other branches of government, military chiefs and other top officials of government."
  },
  {
    "headline": "Anenih, others call for Nigerian Female President",
    "summarized_story": "By Yemisi SuleimanIn a bid to attain the nation’s first female president, a former Minister of Women Affairs, Iyom Josephine Anenih called on more Nigerian women to come out and be actively involved in partisan politics, noting that more female state governors should also emerge.\nShe asserted that Nigeria wouldn’t attain the transformational changes desired by patriots until a female president emerges.\n“It is Kingsley’s dream and I am sure I am right, to have a female President.\n“I’m looking forward to the day Nigeria will have a female president.\nIf we create an enabling environment for a Nigerian female president, we would be amazed at the wonders God will do with them.”“Women are being celebrated today because they are achievers and we expect that this celebration will spur them to do better."
  },
  {
    "headline": "Anenih, others call for Nigerian Female President",
    "summarized_story": "By Yemisi SuleimanIn a bid to attain the nation’s first female president, a former Minister of Women Affairs, Iyom Josephine Anenih called on more Nigerian women to come out and be actively involved in partisan politics, noting that more female state governors should also emerge.\nShe asserted that Nigeria wouldn’t attain the transformational changes desired by patriots until a female president emerges.\n“It is Kingsley’s dream and I am sure I am right, to have a female President.\n“I’m looking forward to the day Nigeria will have a female president.\nIf we create an enabling environment for a Nigerian female president, we would be amazed at the wonders God will do with them.”“Women are being celebrated today because they are achievers and we expect that this celebration will spur them to do better."
  },
  {
    "headline": "The Rave On Fire",
    "summarized_story": "The singer and songwriter, who has a song for every feeling from love, breakup, happiness to travel, says the song ‘Peru’ basically recounts his journey and holiday fun in San Francisco.\nYou are headlining your first concert ever in Lagos “The Fire Concert” How does that make you feel?\nMy debut was simply an introduction to my sound so I decided to make the next one a bit more personal and introspective.\nI had just landed in San Francisco to pay a courtesy visit to my empire team in the studio.\nI’m big on mutual respect and organic energy when it comes to collaborations, so I waited patiently till it came."
  },
  {
    "headline": "The Rave On Fire",
    "summarized_story": "The singer and songwriter, who has a song for every feeling from love, breakup, happiness to travel, says the song ‘Peru’ basically recounts his journey and holiday fun in San Francisco.\nYou are headlining your first concert ever in Lagos “The Fire Concert” How does that make you feel?\nMy debut was simply an introduction to my sound so I decided to make the next one a bit more personal and introspective.\nI had just landed in San Francisco to pay a courtesy visit to my empire team in the studio.\nI’m big on mutual respect and organic energy when it comes to collaborations, so I waited patiently till it came."
  },
  {
    "headline": "Abba Kabir Dankaura Weds Hadiza Bashir Jamoh",
    "summarized_story": "By Emeka AnaetoThe Director-General of the Nigerian Maritime Administration and Safety Agency (NIMASA) Dr. Bashir Jamoh, gave out his daughter, Hadiza, in marriage to Abba Kabir Dankaura at a wedding Fatiha which took place in Kaduna on Friday, December 24, 2021.\nThe serene city of Kaduna played host to dignitaries across the country with Katsina State Governor, Aminu Masari and his Borno counterpart, Prof. Babagana Zulum, playing leading role at the Fatiha which took place at the Sultan Bello Mosque.\nThe reception took place at the Yar’Ádua Center, Murtala Square, Kaduna.\nHere are some of the pictures highlighting the event."
  },
  {
    "headline": "Armed Forces Remembrance Day: Buhari, Osinbajo, Lawan, CJN, others lay wreath",
    "summarized_story": "In keeping with the tradition of the Armed Forces Remembrance Day, President Muhammadu Buhari, his Vice, Yemi Osinbajo, Senate President, Ahmed Lawan, Speaker of the House of Representatives, Femi Gbajabiamila and the Chief Justice of Nigeria, Ibrahim Tanko Mohammed laid wreath in honour of the fallen heroes.\nThe colourful ceremony, which is observed every January 15, usually holds at the National Arcade, opposite the Eagle Square, Abuja.\nThe 2022 edition featured parade by the Nigerian Armed Forces.\nRecall that the Armed Forces Remembrance Day is observed on January 15 to commemorate the servicemen of the Nigerian Armed Forces, veterans of world war 1 and 2, as well as the Nigerian civil war.\nHigh point of the event was the release of white pigeons symbolising freedom and peace of the nation."
  },
  {
    "headline": "Anambra govt inaugurates c’ttee to rehabilitate mkpurummiri consumers",
    "summarized_story": "Anambra State Government says it has inaugurated a committee that will work to rehabilitate youths in various communities in the State, who are addicts of methamphetamine, popularly known as mkpurummiri in the South east.\nCommissioner for Health, Dr. Vincent Okpala disclosed this during a meeting with traditional rulers at the Government House, Awka.\nThe Commissioner said: “The State government has inaugurated a committee that will see to the rehabilitation of those who abuse crystal Methamphetamine across the state.\nSome youths who were meted such treatment were reported to have died after they were flogged for consuming the substance.\nThe health commissioner, however, said that rehabilitation by the committee would be a professional thing, and would not involve merciless flogging of the abusers of the substance."
  },
  {
    "headline": "Banditry: Gov. Matawalle reopens more markets, shops in Zamfara",
    "summarized_story": "The Executive Governor of Zamfara State, Hon.\nBello Mohammed Matawalle has approved the immediate resumption of business activities in some shops in the State capital and weekly markets.\nThis was contained in a press statement signed by the Secretary to the State Government (SSG), Alhaji Kabiru Balarebe.\nHe said the markets include Lalan shops, Garejin Mailena shops and Hanya shops.\n“The Task Force on Security will be monitoring the areas to ensure full and proper compliance.”He explained that Badarawa – Jangebe junction, Colony Junction, Shinkafi – Zurmi junction, Tashar Maduwa, among other markers would also be reopened on same condition."
  },
  {
    "headline": "Nnamdi Kanu: IPOB announces no sit-at-home as court delivers judgment",
    "summarized_story": "The Indigenous People of Biafra, IPOB, has said there will be no sit-at-home across the Southeast on Wednesday and Thursday next week.\nIPOB relaxed the sit-at-home due to the scheduled judgment of the High Court sitting in Abia State.\nHowever, IPOB’s spokesman, Emma Powerful, however, limited the sit-at-home order to Tuesday, when Kanu will appear before Justice Binta Nyako of an Abuja Federal High Court.\nIn a statement he issued on Saturday, Powerful said: “We are the Indigenous People of Biafra IPOB under the command of our indefatigable Leader, Mazi Nnamdi Kanu.\nThe Directorate of State (DOS) under the command of our leader, Mazi Nnamdi Kanu, is in charge of the global movement of IPOB."
  },
  {
    "headline": "Buhari govt vs Nnamdi Kanu: IPOB leader tells supporters how to behave in court",
    "summarized_story": "The leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, has urged his followers to be civil during his trials.\nKanu appealed to his supporters who will appear at the Federal High Court in Abuja to conduct themselves with decorum.\nThe IPOB leader also admonished his supporters to shun violence during all his trials, going forward.\nA statement issued by Ejiofor reads partly: “Onyendu utilised the opportunity afforded by our visit to mandate us to admonish his teeming supporters and followers.\nThe IPOB leader known for agitation for Biafra was rearrested in June 2021 in Kenya, and repatriated to Nigeria."
  },
  {
    "headline": "BREAKING: Makinde, Balogun, Ladoja, Olubadan-in-Council in closed door meeting",
    "summarized_story": "Oyo Governor Seyi Makinde has entered a closed-door meeting with members of the Olubadan-in-council.\nAccording to sources, the nominated Olubadan of Ibadan Senator Lekan Balogun; Ex-Governor Rashidi Ladoja and other members of the Council, numbering about 10, are attending the meeting.\nThe meeting started shortly after the Governor attended the Armed Forces Remembrance Day event at the Remembrance Archade, opposite the Government House, Agodi Ibadan.\nREAD ALSO: Understanding Olubadan succession rowBarring last-minute change, the Governor, to be accompanied by the members of the Olubadan-in-Council are expected to brief the press.\nIt was gathered that, if things go well at the meeting, the Governor may appoint and or confirm the nomination of Balogun to ascend the Olubadan stool."
  },
  {
    "headline": "Viral video: Lagos hawker receives over N300,000 for gesture to inmates",
    "summarized_story": "A hawker, Ekuma Jeremiah, who sells bottled water in Ajah area of Lagos state, has explained why he gave out money to some inmates stuck in traffic.\nDuring the week, the now-viral video wherein Jeremiah could be seen giving money to some inmates inside a van of the Nigerian Correctional Service (NCS) surfaced online emerged.\nIn the seven-second video, the hawker is seen carrying a crate of bottled water on his head while giving out some of the money he had made.\n- Advertisement -In an interview obtained by The Nation, Jeremiah said he was motivated by pity to give the inmates money.\nI gave the inmates money out of pity."
  },
  {
    "headline": "Buhari honours fallen heroes at Armed Forces Remembrance Day celebration",
    "summarized_story": "President Muhammadu Buhari on Saturday led Nigerians in honouring the memory of fallen heroes during the 2022 Armed Forces Remembrance Day in Abuja.\nThe activities started October 28, 2021, when the President launched the remembrance emblem at the presidential villa, Abuja.\nOthers who laid wreaths were Vice President Yemi Osinbajo; Senate President Ahmad Lawan and Speaker Femi Gbajabiamila.\nOthers were the Chief of Defence Staff, Gen. Lucky Irabor, Service Chiefs and the Nigerian Legion, among others.\nPresident Buhari thereafter released white pigeons to indicate the harmony at the venue and the nation."
  },
  {
    "headline": "Inspector killed as gunmen attack Imo station",
    "summarized_story": "An Inspector of Police was on Friday shot dead in a gun duel between Imo Police Command tactical teams and armed hoodlums that attacked Mgbidi Police Station in Oru West Local Government.\nThe hoodlums, who stormed the police station around 9.45 pm in a white Hilux vehicle, shot sporadically in an attempt to gain entrance into the station.\nBut they were repelled by the Command’s tactical teams and Police operatives of the division who engaged them in a gun battle.\nThe Command’s spokesman’s CSP Michael Abattam said on Saturday that the hoodlums were repelled before they could gain entry into the station but an inspector died in the process.\nHowever, in the course of the attack, a police Inspector lost his life, while another, sustained minor bullet injury on his hand.”"
  },
  {
    "headline": "Aggrieved youths attack Irigwe paramount ruler’s palace",
    "summarized_story": "Irate youths on Friday attacked the palace of Mbra Ngwe Irigwe, the paramount ruler of Irigwe land in Bassa local government area of Plateau State.\nIt was rumoured the attack was carried out by aggrieved Irigwe youths.\n- Advertisement -Chairman of Bassa Local Government Council Engineer Stephen Igmala condemned the attack on the palace of the Bra Ngwe Irigwe Ronku Aka.\nREAD ALSO: Delta youths attack lawmakerHe described the incident as a sacrilege, unacceptable and disrespectful to the traditional stool of their forefathers.\nHe acknowledged the efforts of the administration of Governor Simon Lalong to curtail the frequency of attacks on Innocent citizens in Bassa council."
  },
  {
    "headline": "Breaking: IPOB declares sit-at-home on Kanu's eve of judgment – The Sun Nigeria",
    "summarized_story": "However,the group has insisted that there would not be any sit-at-home on January, 19 the scheduled date for the ruling proper.\nBiafrans and residents of Biafra are free to go about their businesses without molestations on 19th and 20th January.\nAnybody found enforcing non-existent Monday sit-at-home on 17th, 19th and 20th is criminal and must treat as such, IPOB leadership have given order and that order is what signed.\nIPOB never declared sit at home on 19th and 20th of January 2022.\nIPOB remains unshakeable, built and rooted on the rock and will remain so until the freedom for Biafra is fully achieved.” Powerful stated."
  },
  {
    "headline": "APC fixes National Convention for February 26, 27",
    "summarized_story": "From Romanus Ugwu, AbujaThe All Progressives Congress (APC) has finally settled for February 26 and 27 as tentative dates for the conduct of the much-awaited party’s National Convention.\nOur source further confirmed that the convention will hold at the Eagle Square, Federal Capital Territory (FCT) Abuja on the proposed dates.\nWhile some stakeholders are favourably disposed to the conversation holding in February, the party’s Caretaker/Extraordinary Convention Planning Committee has emphasised that it was more interested in resolving the various crisis rocking the party at both the States and national levels before the national convention.\n“I can confirm to you that our National Convention will now hold end of next month, precisely on February 26 and 27.\nThe good thing is that the picking of date for the convention will douse tension and mistrust within the party,” our source noted."
  },
  {
    "headline": "2023: Yoruba spilt over 2023 presidency",
    "summarized_story": "The groups include Afenifere, Yoruba Council of Elders (YCE), Oodua People’s Congress (OPC), the Agbekoya Farmers Society (AFS), and the apex Yoruba self-determination organisation, Ilana Omo Oodua (IOO).\nSo, if eventually Osinbajo gets to make public his own declaration, which of them, will the Yoruba as represented by these groups support?\nNational Publicity Secretary of Afenifere, Mr. Jare Ajayi, said: “For now, Afenifere does not have a position on any presidential aspirant.\nOur position is that the 2023 presidency must come to the southern part of Nigeria.\nBut he was quick to add that the organisation has nothing personal against Tinubu or any other person who wants to contest the 2023 presidential poll."
  },
  {
    "headline": "I want to get married –Olive Utalor",
    "summarized_story": "One of them is that of fast-rising actress, Olive Isioma Utalor, who has vowed to settle down in 2022.\nIn an encounter with Saturday Sun, the Ebonyi State University graduate of History and International Relations insisted, “Definitely marriage is part of my plans for 2022.”On the expectations from her future husband, Utalor says it’s nothing but love.\n“My expectation from any man who wants to settle down with me is love.\nOn her New Year resolution, the Delta State-born script interpreter enumerated some areas in her life she would love to make amends.\nBut this year, I want to be more thoughtful of others and show love to them."
  },
  {
    "headline": "2023: Why South East must produce president – Asari Dokubo",
    "summarized_story": "Alhaji Mujadid Asari – Dokubo, an Ijaw nation freedom fighter, is a staunch supporter of former President Goodluck Jonathan.\nAsari- Dokubo who insisted that the South- East is the most qualified region to produce the Presidency in 2023, said the South- West has no right to contest after former President Olusegun Obasanjo, who he described as a mischief maker, had done eight years.\nBut there are arguments in some quarters that the South- South did not complete its mandatory eight year tenure?\nThere have been insinuations that Goodluck Jonathan is being pressured to defect to the APC to run again for president.\nWhat is your relationship with Former President Jonathan?"
  },
  {
    "headline": "News in Photographs: Buhari, Osinbajo, Others Lay Wreaths in honour of Fallen Heroes",
    "summarized_story": "President Muhammadu Buhari and Vice President Yemi Osinbajo Saturday laid wreaths at the National Arcade to honour fallen heroes.\nThe President and his deputy attended the 2022 Armed Forces Remembrance Day Parade at the FCT Arcade where the Senate President Ahmad Lawan and service chiefs also laid wreaths to honour fallen heroes.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "South, Middle Belt Leaders Urge Parties to Zone Presidency to South",
    "summarized_story": "“Arising therefrom, the meeting resolved as follows: That the extant Constitution and Structure of Nigeria are grossly flawed and lopsided.\n“That any political party that does not zone its presidential ticket to the South should not expect support from the four regions.\n“Therefore, unequivocally, and in full resolve, call on all political parties in the country to zone their presidential tickets to the South.\nAlso in attendance at the meeting were delegations from the four regional socio-cultural organisations – Afenifere for the South-west; Ohanaeze Ndigbo for the South-east; Pan Niger Delta Forum (PANDEF) for the South-south; and the Middle Belt Forum (MBF) for the Middle Belt.\nThe delegations were led by Chief Ayo Adebanjo, leader of Afenifere; Professor George Obiozor, President-General of Ohanaeze Ndigbo; Dr. Pogu Bitrus, President of the Middle Belt Forum and Senator Emmanuel Ibok Essien, National Chairman of Pan Niger Delta Forum, PANDEF."
  },
  {
    "headline": "Irabor: Military Remains Loyal to Democratic Rule",
    "summarized_story": "*Declares army now well-focused on performing its constitutional rolesOur CorrespondentsThe Chief of Defence Staff, General Lucky Irabor, yesterday pledged the loyalty of the military leadership to democratic rule in the country.\nIrabor, who was speaking on a television programme, ahead of the Armed Forces Remembrance Day, also stated that the military was now well-focused on performing its constitutional roles.\nHe declared: “Today, I believe that Nigerians are no longer in doubt as to the subordination of the military to civil rule; I believe that no one is in doubt that democracy has come to stay.\n“Going forward, I believe that some of these misperceptions that some Nigerians have had with respect to military engagement will begin to change.\nSpeaking on the crackdown on the use of military gear by civilians, the CDS stated that the present security situation “does not allow the use of military gear by people who are not personnel of the Defence Headquarters (DHQ).”He said: “The criminals among us have had to take advantage of the military, police, and other security agencies’ gear to perpetrate crime."
  },
  {
    "headline": "Buhari Hosts Grand Khalifa of Tijjaniyya Islamic Movement",
    "summarized_story": "According to him, the visit of the Grand Khalifa had also rekindled the old ties between the Tijjaniya and the many cultural and educational institutions in Nigeria.\nWhy Kano State Invited ArabiCommenting on the reason the Kano State Government invited the Grand Khalifa, Ganduje said it was aimed at developing a good relationship between Algeria and the city of Kano.\n“So, the invitation to the world leader of Tijanniyya Islamic Movement is a welcome development for the people of Kano State and for the people of Nigeria.\n“Also in Kano State, we constituted a committee with his team in order to look into issues of education, commerce, and agriculture.\nSo, we have developed a very well-coordinated synergy in order to improve the quality of life of the people of Kano State."
  },
  {
    "headline": "Group Faults Gov Yahaya’s Silence on Killings in Southern Gombe",
    "summarized_story": "SaMBA therefore appealed to the conscience of members of the security agencies to fish out these killer-herdsmen in Southern Gombe.\nThe statement read in part: “Our attention has been drawn to the killings in Southern Gombe by suspected Fulani herdsmen these past three weeks and the deafening silence from the Executive Governor of the state, Inuwa Yahaya.\n“Against this backdrop SaMBA is gravely concerned regarding the silence, the inaction and nonchalance of the Executive Governor of Gombe State to the killings going on in Billiri Local Government Area.\nThe governor should be called to order; his attitude is not in sync with conduct expected of anyone occupying the highest office of Gombe State.\nHe is making the situation worse by failing to condole with the family of the victims and people of Gombe State, the least expected of the occupier of the highest office in the State."
  },
  {
    "headline": "EXCLUSIVE: How Ex-Governor, Bafarawa’s Nephew Sold Military Gun Trucks To Bandits, Terrorised Sokoto, Zamfara, Niger states – Police Sources",
    "summarized_story": "The Nigeria Police Force is currently investigating grave allegations against a nephew of Alhaji Attahiru Bafarawa, former governor of Sokoto State who was arrested for supplying arms, ammunition, and military kits to bandits.\nPolice sources told SaharaReporters that investigations showed that the suspect, identified as Musa Mohammed Kamarawa, bought and sold military gun trucks to bandits as well as AK-47 and AK-49 rifles.\nThe police further claimed his gang engaged in kidnapping and burning of houses in Sokoto, Zamfara, Kebbi and Niger states.\nSources had told SaharaReporters that Bafarawa, who has been uneasy with the arrest of his relation, has been putting pressure for Kamarawa’s release.\nAfterward I got admitted to study for my degree at Usman Danfodiyyo University, Sokoto State.”"
  },
  {
    "headline": "EXCLUSIVE: How Ex-Governor, Bafarawa’s Nephew Sold Military Gun Trucks To Bandits, Terrorised Sokoto, Zamfara, Niger states – Police Sources",
    "summarized_story": "The Nigeria Police Force is currently investigating grave allegations against a nephew of Alhaji Attahiru Bafarawa, former governor of Sokoto State who was arrested for supplying arms, ammunition, and military kits to bandits.\nPolice sources told SaharaReporters that investigations showed that the suspect, identified as Musa Mohammed Kamarawa, bought and sold military gun trucks to bandits as well as AK-47 and AK-49 rifles.\nThe police further claimed his gang engaged in kidnapping and burning of houses in Sokoto, Zamfara, Kebbi and Niger states.\nSources had told SaharaReporters that Bafarawa, who has been uneasy with the arrest of his relation, has been putting pressure for Kamarawa’s release.\nAfterward I got admitted to study for my degree at Usman Danfodiyyo University, Sokoto State.”"
  },
  {
    "headline": "EXCLUSIVE: How Ex-Governor, Bafarawa’s Nephew Sold Military Gun Trucks To Bandits, Terrorised Sokoto, Zamfara, Niger states – Police Sources",
    "summarized_story": "The Nigeria Police Force is currently investigating grave allegations against a nephew of Alhaji Attahiru Bafarawa, former governor of Sokoto State who was arrested for supplying arms, ammunition, and military kits to bandits.\nPolice sources told SaharaReporters that investigations showed that the suspect, identified as Musa Mohammed Kamarawa, bought and sold military gun trucks to bandits as well as AK-47 and AK-49 rifles.\nThe police further claimed his gang engaged in kidnapping and burning of houses in Sokoto, Zamfara, Kebbi and Niger states.\nSources had told SaharaReporters that Bafarawa, who has been uneasy with the arrest of his relation, has been putting pressure for Kamarawa’s release.\nAfterward I got admitted to study for my degree at Usman Danfodiyyo University, Sokoto State.”"
  },
  {
    "headline": "ALERT: Lagos Policemen Now Abducting, Detaining Residents Illegally Without Knowledge Of Families, Judiciary",
    "summarized_story": "Policemen in Lagos have been accused of kidnapping citizens and detaining them in cells without the knowledge of their families and judiciary arm of government.\nSome lawyers, who volunteered under the Duty Solicitors Network disclosed, this in a statement by their leader, Bayo Akinlade.\n\"Policemen across Lagos are now kidnapping citizens and detaining them in police stations without the knowledge of their families and judiciary.\n“After waiting indefinitely for the police records of release which were not forthcoming, our suspicions were raised as to the truth of the suspects’ release.\n\"Several other suspects were also discovered, having been transferred from Ikorodu, and still being held beyond time."
  },
  {
    "headline": "ALERT: Lagos Policemen Now Abducting, Detaining Residents Illegally Without Knowledge Of Families, Judiciary",
    "summarized_story": "Policemen in Lagos have been accused of kidnapping citizens and detaining them in cells without the knowledge of their families and judiciary arm of government.\nSome lawyers, who volunteered under the Duty Solicitors Network disclosed, this in a statement by their leader, Bayo Akinlade.\n\"Policemen across Lagos are now kidnapping citizens and detaining them in police stations without the knowledge of their families and judiciary.\n“After waiting indefinitely for the police records of release which were not forthcoming, our suspicions were raised as to the truth of the suspects’ release.\n\"Several other suspects were also discovered, having been transferred from Ikorodu, and still being held beyond time."
  },
  {
    "headline": "Buni-led panel to meet on Tuesday over APC convention",
    "summarized_story": "The national caretaker committee of the All Progressives Congress (APC) will meet on Tuesday to discuss the convention of the party.\nTheCable learnt that the decision of the caretaker committee to meet is coming on the heels of a meeting of the Progressive Governors Forum (PGF).\n“Following Sunday’s scheduled meeting of the Progressives Governors’ Forum, the party’s caretaker committee will meet on Tuesday, 18th January, 2022 on the convention,” a source said.\n“We said we are going to do a convention in February and we are still working for the convention.\nAdvertisementIn November, Atiku Bagudu, chairman of the Progressives Governors Forum (PGF), said President Muhammadu Buhari endorsed February 2022 for the APC to hold its convention."
  },
  {
    "headline": "Buni-led panel to meet on Tuesday over APC convention",
    "summarized_story": "The national caretaker committee of the All Progressives Congress (APC) will meet on Tuesday to discuss the convention of the party.\nTheCable learnt that the decision of the caretaker committee to meet is coming on the heels of a meeting of the Progressive Governors Forum (PGF).\n“Following Sunday’s scheduled meeting of the Progressives Governors’ Forum, the party’s caretaker committee will meet on Tuesday, 18th January, 2022 on the convention,” a source said.\n“We said we are going to do a convention in February and we are still working for the convention.\nAdvertisementIn November, Atiku Bagudu, chairman of the Progressives Governors Forum (PGF), said President Muhammadu Buhari endorsed February 2022 for the APC to hold its convention."
  },
  {
    "headline": "IPOB: There will be sit-at-home in south-east on Tuesday",
    "summarized_story": "The Indigenous People of Biafra (IPOB) says there will be a sit-at-home protest in the south-east on January 18.\nIPOB had suspended its sit-at-home directive in the region, including the days when Nnamdi Kanu, its leader, appears in court.\nHowever, in a statement issued on Saturday, Emma Powerful, IPOB spokesperson, said Kanu is billed to appear in court on January 18, 19 and 20 for the continuation of his trial and there will be a sit-at-home protest on January 18.\n“We are the Indigenous People of Biafra IPOB under the command of our indefatigable Leader, Mazi Nnamdi Kanu.\nAnybody found enforcing non-existent Monday sit-at-home on 17th, 19th and 20th is criminal and must treat as such, IPOB leadership have given order and that order is what signed."
  },
  {
    "headline": "IPOB: There will be sit-at-home in south-east on Tuesday",
    "summarized_story": "The Indigenous People of Biafra (IPOB) says there will be a sit-at-home protest in the south-east on January 18.\nIPOB had suspended its sit-at-home directive in the region, including the days when Nnamdi Kanu, its leader, appears in court.\nHowever, in a statement issued on Saturday, Emma Powerful, IPOB spokesperson, said Kanu is billed to appear in court on January 18, 19 and 20 for the continuation of his trial and there will be a sit-at-home protest on January 18.\n“We are the Indigenous People of Biafra IPOB under the command of our indefatigable Leader, Mazi Nnamdi Kanu.\nAnybody found enforcing non-existent Monday sit-at-home on 17th, 19th and 20th is criminal and must treat as such, IPOB leadership have given order and that order is what signed."
  },
  {
    "headline": "Officer killed as gunmen attack police station in Imo",
    "summarized_story": "A police officer was killed on Friday following an attack by gunmen on Mgbidi divisional police station in Orsu West LGA of Imo state.\nAnother officer sustained an injury in the attack.\nMichael Abattem, police public relations officer (PPRO) in Imo, confirmed the attack in a statement on Saturday.\nThe police spokesperson said the attackers attempted to invade the police station but were repelled by officers.\nGunmen have been targeting residents in recent months, not sparing security operatives."
  },
  {
    "headline": "A year to Nigeria’s 2023 elections, its government lifts Twitter ban",
    "summarized_story": "After 6 months, the Nigerian government has lifted the suspension of Twitter operations in the country following approval by President Muhammadu Buhari.\nRecall that the Nigerian government suspended Twitter’s operation on June 4, 2021, following the platform’s decision to remove a controversial tweet by the Nigerian President, which it said breached the site’s rules.\nThe Nigerian government has insisted the suspension is a matter of national security and not related to the president’s tweet.\nThe government’s decision to ban Twitter triggered widespread criticism as online-based businesses recorded huge losses; lawsuits filed against the Nigerian government; and national assembly hearings held to probe the circumstances leading to the ban.\nIn wake of removal of the suspension, Nigerians have come online to celebrate the end of an era of using VPNs to access Twitter."
  },
  {
    "headline": "Tarneem Saeed: The entrepreneur at the forefront of Sudan’s economic renaissance",
    "summarized_story": "alsoug, founded in 2016 by Tarneem Saeed, is reportedly the biggest tech startup in the country; the funding round speaks to this fact.\nWhat is surprising, however, is that, in a conservative and conflict-torn nation like Sudan, a woman-led company is at the forefront of bringing Sudan’s economy back to health.\nGet the best African tech newsletters in your inboxTarneem Saeed and founding alsougSaeed left Sudan for the first time when she was 14.\nAccording to Saeed, the company has managed to capture the biggest market share because of their operational strategy.\nThe Sudan market is tough, and what helped alsoug was building light as they grew; they didn’t try to overweigh the market all at once."
  },
  {
    "headline": "ThankUCash targets the BNPL opportunity in Africa after raising $5.3m seed",
    "summarized_story": "In Africa, where most people are credit-averse, BNPL activity is just beginning to pick up.\nLast September, Australian company Zip acquired South Africa-based BNPL player Payflex, a deal that indicates Africa may be ripe for buy-now-pay-later services.\nA number of companies—including neobanks, payment service providers, and traditional banks—have already launched or are looking to roll out BNPL services in Africa.\nIn Nigeria, the majority of existing BNPL services are manual, provided by asset financing companies and sometimes merchants themselves.\nUltimately, the customer is buying straight from the merchants,” Ononobi explained in a statement."
  },
  {
    "headline": "Nigeria’s problem is more about revenue management than managing it – Rewane",
    "summarized_story": "Chief Executive Officer (CEO) of the Financial Derivatives Company, Bismarck Rewane has differed with comments made by the Minister of Finance, Budget and National Planning, Zainab Ahmed that Nigeria has a revenue problem and not an expenditure problem.\nNotwithstanding a 97.5 percent increase in the actual oil price to $79.31 per barrel recorded at the end of 2021 from a $40 oil price benchmark in appropriated 2021 budget, oil revenue fell 47.4 percent from that expected at the start of the year.\nThis accounted for the bulk of the 74 percent decrease in expected Federal Government of Nigeria’s Aggregate revenue which was N5.51 trillion as of November 2021.\nThe federal government’s share of this revenue source totalled N1.62 trillion representing a 118.8 percent over and above target.\nRewane, therefore, finds it ironical that the federal government will have a revenue generation problem only."
  },
  {
    "headline": "How government policies push Nigeria’s 1.8m MSMEs to the brink",
    "summarized_story": "nano, micro, small and medium enterprises – MSMEs) and aims to generate up to date data on MSMEs with a view to determining the effect of the recent socio-economic development as well as global occurrences like Covid 19 pandemic.\nDetails of the report obtained by BusinessDay shows that the total number of MSMEs as at December, 2020 stood at 39,654,385, with total assets valued at N8.41 trillion.\nSimilarly, a breakdown of the total number of MSMEs showed that micro enterprises were 38, 413,420, while small and medium enterprises were 1,240,965.\nAlso identified as a problem was the financial challenges faced by MSMEs, which was reported to be workers’ wages and social security charges and rent.\nStates with the highest distribution of business enterprises in Nigeria are Lagos State (91,097 entities), Rivers State (84,613 entities) and Kano State (79,328 entities), while, states with the least number of enterprises were Bayelsa State (15,758 entities) and Kebbi State (17,305 entities)."
  },
  {
    "headline": "Why UK Scholarships to Nigerians is rising",
    "summarized_story": "Likewise in terms of visas issued to the UK, Nigeria recorded a rise of 234.7 percent to 18,580 in the first nine months of 2021 from 5,551 in the same period of 2019.\nLikewise, in the literary field, 10-year-old Nigerian twins made waves in the UK United Kingdom.\nIts working population is also estimated to be more than double, while other developed countries would have reduced their working population.\nHigh Diaspora RemittanceThe Nigerian diaspora community acts as an important asset in bilateral relations and development efforts.\n“This figure alone illustrates the economic weight the UK-based Nigerian diaspora holds both in the UK and in Nigeria,” the World Bank states."
  },
  {
    "headline": "BEDC to restore service to Uvbe, Evbuobanosa, Abudu, others soon – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOGHADA – Expectations are high in some communities in Orhionmwon and parts of Uhunmwode local government areas of Edo State, as maintenance work on broken down electricity cables, poles and transformers in the area is expected to commence soon.\nThe communities which include Abudu, Evbuobanosa, Iguomoson, Uvbe, Igbogiri, Iru, Ofien, Idudolor, Evbuohen, Evbosawe, Ugboayon, Oza, Ugbeze, Oghada, among others have been without electricity for more than five years.\nAccording to a youth leader in the area, Saturday Irabor, the Agbor business unit of Benin Electricity Distribution Company (BEDC) notified the communities of arrangements to reconnect them back to the national grid.\nThe official was however silent about the electricity debt owed by the communities, which BEDC earlier said prompted it to suspend service to the area.\nHowever, barely two months after the installation, vandals struck and went away with the armoured cables in the transformers which they later abandoned inside a bush where the community recovered them."
  },
  {
    "headline": "Delta Police Arrests Suspected Internet Fraudsters, Recovery Arms, Ammunitions – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWARRI – The Delta State Police Command says that two suspected internet fraudsters are currently cooling their feet in police custody following his arrest on the 8/01/2022 .\nABH 911 GW with two male occupants namely Daniel Anikpe “M” age 27Yrs and Chikeluba James Ani “M” age 27Yrs both residing at Ulo line shop off Asaba –Ibusa road.\n“After a painstaking search was conducted on the suspects and the vehicle, one locally made double barrel pistol, three live cartridges, one jack knife, two wraps of substances suspected to be Indian hemp.\n“He also stated that he bought the gun at a cost of twenty-five thousand naira(#25,000).\nInvestigation is ongoing.” The statement said."
  },
  {
    "headline": "Edo community vs abattoir operator: Absence of defendant lawyer stall case in court – Nigerian Observer",
    "summarized_story": "The community also asked for N5 million damages from the defendant for the nuisance she has alleged been and still constituting in the area.\nAt the hearing yesterday, counsel to the defendant pleaded for adjournment on the ground that his principal, Dr. Osagie Obayuwana, was at the Supreme Court, in Abuja and would wanted to personally handle the case.\nHe told the court that Dr. Obayuwana would appear before the court on the next adjourned date.\nHe however urged the court to fine the defense counsel N50,000, so that they would be deligent in the case next time.\nChief Magistrate Prince Mutairu Oarhe, having listern to both counsels argument and counter argument adjourned the case to February 16, 2022 for continuation of hearing."
  },
  {
    "headline": "Obaseki mourns death of former Interim Head of Govt, Ernest Shonekan – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestI am saddened by the passing of Nigeria’s former Interim Head of National Government, Chief Ernest Shonekan, at the age of 85.\nShonekan was an unassuming leader and a cerebral lawyer, who helped to steady our nation during the turbulent years of Nigeria’s Third Republic.\nAs the founder of the Nigeria Economic Summit Group, his commitment to private and free enterprise remains indelible in the annals of our history.\nIt is heartbreaking that Chief Shonekan will not be available to offer his priceless advice and guidance as we approach another election season.\nHe will be remembered for his fortitude while he was on the saddle as Interim Head of National Government as well as the genuine effort made to guide Nigeria back to democratic rule."
  },
  {
    "headline": "Nigeria’s financial services sector to grow by 8.32% in 2022 – Rewane",
    "summarized_story": "Managing Director/Chief Executive Officer, Financial Derivatives Company, Mr Bismarck Rewane has projected Nigeria’s financial services industry to grow by 8.32 per cent in 2022, going by the increased partnership and collaborations by Fintechs in promoting financial inclusion.\nRewane said the manufacturing sector would likely grow by 4.70 per cent in 2022, while predicting that improved foreign exchange liquidity and increased product innovation would boost the sector’s growth.\nTop players (Nestle Nigeria and Unilever) will report profit growth of 20 per cent in 2022,” he said.\n“Agriculture sector is likely to grow by 1.6 per cent in 2022, an efficient rail system will ease logistics constraints and boost productivity.\nRewane added that the ICT industry would likely to grow by 9.72 per cent in 2022 with telephone penetration on the rise."
  },
  {
    "headline": "Sterling Bank partners LASG, FG on free Wi-Fi at MMIA",
    "summarized_story": "Divisional Head, Health and Education sectors of Sterling Bank, Mr. Obinna Ukachukwu said in a statement issued by the bank in Lagos at the weekend that, “The installations are to welcome arriving travelers comfortably and allow passengers easily book the necessary COVID-19 tests on arrival from the comfort of their devices.\nAccording to him, health is the first of the five sectors where the bank is presently concentrating investments under its HEART’s of Sterling programme since 2018.\nThe other sectors are education, agriculture, renewable energy and transportation.\nThe bank is also active in supporting the tourism sector of the country.\nHe called on other private sector operators to collaborate with the federal and state governments in a bid to effectively tame the Covid-19 pandemic."
  },
  {
    "headline": "FG assures Nigerians of adequate provision of ICT equipment for students, citizens",
    "summarized_story": "“To him, the welfare of Nigerians, especially our teaming youths remains a top priority for this administration.\nThe continuous benefits the country has been deriving from effectively leveraging ICT to run governance more efficiently has been phenomenal,” the Minister remarked.\n“In this context, developing capacities for anticipating the changing needs for digital skills for work and life is crucial for all countries and that should be of interest to all of us,” he said.\nThe Digital Nigeria Centre (DNC) is a project facilitated through the Universal Service Provision Fund of the Nigerian Communications Commission (NCC) under the Ministry of Communications and Digital Economy.\nIn attendance at the event were, the Senator Representing Osun West, Sen. Adelere Oriolowo; Speaker of the State of Osun House of Assembly, Represented by Hon."
  },
  {
    "headline": "Buhari hails Ahmad Lawan-led 9th N’Assembly as Senate President urges consensus on critical issues",
    "summarized_story": "President Muhammadu Buhari has applauded the current National Assembly and particularly the leadership style of it’s chairman, the Senate President, Ahmad Lawan.\nProfessor Gambari said the President sent him to deliver a congratulatory message and express his admiration about Lawan’s personal achievements.\nSpeaking at the occasion, the Senate President passionately appealed to politicians irrespective of their political affiliations to work towards building consensus on critical national issues.\n“In the Senate, we have been able to achieve some kind of formidable unity and consensus on what we must do for our country.\n“Regardless of our political affiliations, in the ninth Senate, we have always approached issues mainly in national interest,” Lawan said."
  },
  {
    "headline": "JUST-IN: Gunmen Kidnap 4 Varsity Students In Nasarawa",
    "summarized_story": "Four students of Federal University of Lafia (FULafia), Nasarawa State, have been kidnapped by yet-to-be-identified gunmen on Thursday.\nThe Public Relations Officer (PRO) of the institution, Mr. Abubakar Ibrahim, confirmed the abduction of the students in a statement on Friday in Lafia, the state capital.\nExpressing his deep sympathy to the families of the abducted studentsa and ssuring them that serious efforts were being made to ensure quick release of the kidnapped students.\n“The vice-chancellor, who has since visited the area where the students were kidnapped, visited the Nasarawa Police command where he formally notified the commissioner of Police about the abduction of the students,” the statement added.\nADVERTISEMENTThe VC had equally contacted other security operatives, appealing to them to work tirelessly for the safe and quick return of the kidnapped students."
  },
  {
    "headline": "ISWAP Releases Video Of Attack On Buratai War Institute",
    "summarized_story": "A video of the last attack on Tukur Buratai Institute for War and Peace In Borno State last Monday where two civilian staff were killed and four vehicles were burnt down, has surfaced.\nIn the 27-second video obtained by our correspondent in Maiduguri on Friday, the terrorists were seen in commando-style shooting heavily and moving freely without resistance inside the premises of the war institution.\nThey were also seen pulling down and burning both Nigeria and Army flags at the institution.\nThe institute sited in Buratai, the country home of a former chief of Army Staff, Lt. Gen. Tukur Yusuf Buratai (rtd ), after which it was named, was commissioned by Borno State governor, Professor Babagana Umara Zulum, in August 2020.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "Kwara NSCDC Nabs Serial PoS Fraudster",
    "summarized_story": "Operatives of the Kwara State Command of the Nigeria Security and Civil Defence Corps (NSCDC) have arrested a 24-year-old serial PoS fraudster and fake alert scammer, Victor Adebayo, in Ilorin, the state capital.\nLEADERSHIP gathered that Adebayo was picked up by men of the intelligence unit of the NSCDC after he had defrauded many unsuspecting people of more than N700,000.\nConfirming the arrest of the suspect, the spokesman of the NSCDC in the state, Babawale Afolabi, said Adebayo usually send fake credit alerts to unsuspecting PoS operators and will now collect cash from them and disappear into thin air.\n“On the 13th January 2022, operatives of the NSCDC intelligence and investigations department picked up a suspected serial fraudster who has been going around defrauding people of their hard – earned money.\nADVERTISEMENT“The suspect usually go around in his Toyota Corolla car and very neat appearance and would meet POS operators to give him cash and he will now make a fake transfer which he has programmed on his phone,” Babawale stated."
  },
  {
    "headline": "Kwara NSCDC Nabs Serial PoS Fraudster",
    "summarized_story": "Operatives of the Kwara State Command of the Nigeria Security and Civil Defence Corps (NSCDC) have arrested a 24-year-old serial PoS fraudster and fake alert scammer, Victor Adebayo, in Ilorin, the state capital.\nLEADERSHIP gathered that Adebayo was picked up by men of the intelligence unit of the NSCDC after he had defrauded many unsuspecting people of more than N700,000.\nConfirming the arrest of the suspect, the spokesman of the NSCDC in the state, Babawale Afolabi, said Adebayo usually send fake credit alerts to unsuspecting PoS operators and will now collect cash from them and disappear into thin air.\n“On the 13th January 2022, operatives of the NSCDC intelligence and investigations department picked up a suspected serial fraudster who has been going around defrauding people of their hard – earned money.\nADVERTISEMENT“The suspect usually go around in his Toyota Corolla car and very neat appearance and would meet POS operators to give him cash and he will now make a fake transfer which he has programmed on his phone,” Babawale stated."
  },
  {
    "headline": "Borno Police Admits Terrorist Attack On Training School, Denies Abduction",
    "summarized_story": "The Borno State Police Command, on Friday, said suspected Islamic State of West Africa Province (ISWAP) terrorists attacked its training base at Limankara in Gwoza local government area of Borno State but were successfully repelled without any casualty on the side of the police.\nThis is even as the Command refuted reports from some section of the media that some mobile police personnel were abducted by the insurgents during the attack.\nThe Commissioner of Police, Mr Abdu Umar, disclosed this while updating journalists on the attack at the headquarters of the Command in Maiduguri.\n“The attention of the Borno State Police Command has been drawn to a news making round on social media, alleging that undisclosed number of Police Mobile Force personnel were abducted at the Police Mobile Training College, Gwoza.\n“The police did not record a single casuality nor loss of fire arms and no casuality on the part of the Police was recorded."
  },
  {
    "headline": "Nigeria vs Sudan: Eagles push for round of 16 ticket",
    "summarized_story": "The Super Eagles got their 19th AFCON campaign off to a fine start with a 1-0 victory over Egypt in their Group D curtain-raiser on Tuesday.\nSpeaking at a press conference ahead of the game, interim Eagles coach, Austin Eguavoen, said his side would approach the game against Sudan with all seriousness.\n“We are going to approach the Sudan game with all seriousness and a lot of respect as well.\n“We have prepared ourselves well to face Nigeria and I have great confidence in the players,” Tia said during the match press conference.\nSudan head into Saturday’s game on an 11-game winless streak, losing seven and claiming four draws."
  },
  {
    "headline": "Nigeria vs Sudan: Eagles push for round of 16 ticket",
    "summarized_story": "The Super Eagles got their 19th AFCON campaign off to a fine start with a 1-0 victory over Egypt in their Group D curtain-raiser on Tuesday.\nSpeaking at a press conference ahead of the game, interim Eagles coach, Austin Eguavoen, said his side would approach the game against Sudan with all seriousness.\n“We are going to approach the Sudan game with all seriousness and a lot of respect as well.\n“We have prepared ourselves well to face Nigeria and I have great confidence in the players,” Tia said during the match press conference.\nSudan head into Saturday’s game on an 11-game winless streak, losing seven and claiming four draws."
  },
  {
    "headline": "I regret it, every time I go out – BBNaija Angel",
    "summarized_story": "I regret it, every time I go out – BBNaija AngelI regret it, every time I go out – BBNaija AngelReality TV star, Angel Smith, on Saturday revealed that she has regrets whenever she went on outings.\nThe former Big Brother Naija Shine Ya Eye finalist made this known on her Instagram story in the early hours of Saturday.\nShe had earlier shared pictures of herself all dressed up in a revealing black dress.\nAngel then shared a picture of herself in her Range Rover as she wrote, “Everytime I go out, I regret it.\nAccording to her, she had to go outside again so that her makeup would not “waste.”She wrote, “I’m outside again because my makeup cannot waste(sic).” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "I regret it, every time I go out – BBNaija Angel",
    "summarized_story": "I regret it, every time I go out – BBNaija AngelI regret it, every time I go out – BBNaija AngelReality TV star, Angel Smith, on Saturday revealed that she has regrets whenever she went on outings.\nThe former Big Brother Naija Shine Ya Eye finalist made this known on her Instagram story in the early hours of Saturday.\nShe had earlier shared pictures of herself all dressed up in a revealing black dress.\nAngel then shared a picture of herself in her Range Rover as she wrote, “Everytime I go out, I regret it.\nAccording to her, she had to go outside again so that her makeup would not “waste.”She wrote, “I’m outside again because my makeup cannot waste(sic).” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "AFCON: No escape for Sudan, Eagles set to soar",
    "summarized_story": "Current form, history and everything favour the Eagles to win today.\nThe last time Nigeria and Sudan played was in African Nations Cup in 2018, which the Eagles won 1-0.\nBut today, there is no escape for the Falcons of Sudan as the Eagles set to to soar over them and qualify for the knockout stage.\nHe will be up against talented Sudanese stopper Ali Abdallah Abu-Eshrein, who kept a clean sheet on his AFCON group stage debut.\nHot stat: Nigeria have kept a first-half clean sheet in 23 of their last 25 AFCON group phase matches."
  },
  {
    "headline": "Lalong urges Nigerians to honor fallen heroes by embracing peace",
    "summarized_story": "Governor Simon Bako Lalong of Plateau State has paid tribute to Nigerian fallen heroes who have made sacrifices for the unity, peace, and stability of Nigeria.\nThe governor, however, urged all citizens to honour their courage by living in peace with one another and exposing criminals.\nLalong who spoke with journalists after the event said Nigerian Armed Forces and other security agencies have made sacrifices to not only keep Nigeria one but also ensure that its territorial integrity is kept intact.\nLalong said the security agencies have continued to do their best to confront the challenges and must be supported by all Nigerians in order to motivate them to put in their best to make further sacrifices.\nHe also appealed to Nigerians to be generous towards the families of fallen heroes as well as retired soldiers who are battling with many health challenges and carrying the responsibilities of dependants."
  },
  {
    "headline": "IPOB Declares Sit-at-home On Tuesday As Nnamdi Kanu Appears In Court",
    "summarized_story": "The Indigenous People of Biafra has asked its members and supporters in the South-East to boycott social and economic activities on Tuesday in solidarity with their detained leader, Nnamdi Kanu.\nThe statement reads, “We are the Indigenous People of Biafra IPOB under the command of our indefatigable leader, Mazi Nnamdi Kanu.\n“Anybody issuing order for sit at home on 19th and 20th of January is not a member of IPOB.\nThe Directorate of State under the command of our leader, Mazi Nnamdi Kanu, is in charge of the global movement of IPOB.\nIPOB remains unshakeable, built and rooted on the rock and will remain so until the freedom for Biafra is fully achieved.”"
  },
  {
    "headline": "Zamfara Attacks: Boko Haram, Bandits Will Be Destroyed, Tinubu Vows",
    "summarized_story": "Bola Tinubu, the national leader of the All Progressives Congress (APC), has promised that the federal government will wipe out Boko Haram insurgents and bandits terrorizing the country, while also announcing a N50 million payment to Zamfara villages recently ravaged by bandits.\nAfter commiserating with Governor Bello Matawalle in Gusau, Zamfara, Mr Tinubu announced the donation.\nThe APC national leader pleaded for continued prayers to help the state overcome its insecurity.\nMr Matawalle, who received the APC leader, said his visit would further console the bereaved communities.\nConsidering the reality that the conflict is tied to ethnic fault lines, I initiated a dialogue and reconciliation programme, which leaders of thought overwhelmingly accepted all over the state,” the Zamfara governor explained."
  },
  {
    "headline": "BREAKING: Gunmen Attack Imo Police Division, Kill Inspector",
    "summarized_story": "A police inspector was killed and another cop was injured in an attack at the Mgbidi Divisional Police Headquarters in Imo State.\nAccording to our source, the invaders started fire upon arrival, but were repelled by the on-duty police officers.\n“One police Inspector was killed during the incident,” according to a source who asked not to be identified.\nHe did reveal, however, that one inspector was killed and another was injured in the incident.\n“However, in the course of the attack, a police Inspector lost his life, while another sustained minor bullet injury on his hand."
  },
  {
    "headline": "Three Killed, Houses Burnt In Fresh Boko Haram Attack",
    "summarized_story": "Suspected bandits raided Chibok hamlet in Borno State on Friday evening, killing three civilians and setting fire to many homes.\nAccording to NEWS DIRECT, bandits first raided the Chibok village in April 2014, kidnapping around 200 Chibok girls from a boarding school and razing many homes.\n“The insurgents stormed the Chibok community with five utility vehicles, mounted with anti-aircraft guns and moved without any resistance; they started shooting sporadically.\nHe claimed the insurgents assaulted Kautikari village near Chibok town around 4 p.m., firing indiscriminately and torching many homes.\nThey spent around two hours in the village, according to him, wandering from house to house."
  },
  {
    "headline": "Imo: Gunmen attack another Police station, kill Inspector, injure another",
    "summarized_story": "The operatives of the Imo state Police Command has repelled attack by hoodlums at Mgbidi Police station, located in Oru West local government area of Imo state.\n“The officers later engaged the hoodlums in a gun duel.\nIn the process, the attackers were suppressed almost immediately, having suffered a huge defeat, with a number of them sustaining varrying degrees of bullet wounds, they retreated and escaped in the Toyota Hilux vehicle they came with.\nAnd were given a hot chase by the police operatives.”He informed that a vigorous and aggressive manhunt of the hoodlums had been embarked upon, with the sole aim of tracking and arresting the fleeing hoodlums.\nHe however, said that in the course of the attack, a police Inspector lost his life, while another cop sustained minor bullet injury on his hand."
  },
  {
    "headline": "Revealed! How much Nigerian businesses lost to Twitter ban",
    "summarized_story": "The Lagos Chamber of Commerce & Industry (LCCI) has revealed that Nigerian businesses lost up to N10.72 trillion ($26.1billion) between June 5, 2021 and January 13, 2022.\nThe ban lifted on the Twitter ban means the seven-month shutdown of its operations in Nigeria was over.\nDirector-general of LCCI, Dr. Chinyere Almona, however appealed to the federal government to create an enabling regulatory environment that supports global technology companies in achieving their potentials and are sustainably profitable, saying, “when this happens, Nigeria’s Gross Domestic Product (GDP) and revenue mobilisation will receive a boost through tax revenues from these companies.\n“Currently, the ICT sector is one of the growth drivers in the economy and we see additional activities of the digital platforms as adding more potentials to this sector.”She commended the efforts of the federal ministers, agencies, and committees that have pulled the negotiations and gotten approval for the lifting of the suspension, requesting that all relevant institutions work towards enhancing digital infrastructure to adequately and sustainably support innovation in almost all sectors of the economy, especially, healthcare delivery, agric-technology, learning, e-governance, and fintech."
  },
  {
    "headline": "Sofiyat: Raising the bar of military traditions",
    "summarized_story": "Immigration officers tooSimilarly, three female officers of the Nigeria Immigration Service (NIS) were in 2020 queried for partaking in Bopdaddychallenge (a trending dance competition on social media).\n“The institution implicated here is the Nigerian military authority.\nIs Nigeria now the Banana Republic?”Omokri’s takeLikewise, a Nigerian socio-political activist, Reno Omokri, lambasted the Nigerian Army for poor handling of the Sofiyat case.\nHe said, “The Nigerian Army, which is currently rehabilitating Boko Haram, is penalising Private Hannah Sofiyat for accepting a proposal from a corps member; is that not madness?\n“The Nigerian Army should have promoted the love story as a recruitment tool."
  },
  {
    "headline": "Armed Forces Remembrance Day: Nigeria Honours Fallen Heroes",
    "summarized_story": "Today is Armed Forces Remembrance Day in Nigeria, an annual event commemorated to celebrate the nation’s servicemen and fallen heroes.\nThe event, celebrated on January 15 each year, also honours veterans of World War I and II, as well as the Nigerian Civil War.\nIt is a day set aside for sober reflections on the significance of the armed forces to the country.\nWhile the Armed Forces Remembrance Day is celebrated on November 11 every year globally, it is known as the armistice day, commemorating the end of the first World War.\nIn the course of the celebration, ceremonies are scheduled to hold across various states of the federation during which governors are expected to pay tributes to the nation’s fallen heroes."
  },
  {
    "headline": "PHOTOS: Buhari, Osinbajo, Others Honour Nigeria’s Fallen Heroes",
    "summarized_story": "President Muhammadu Buhari on Saturday led a wreath-laying event to commemorate the 2022 Armed Forces Remembrance Day.\nHe was joined by the Vice President, Professor Yemi Osinbajo; the Senate President, Ahmad Lawan; and the Speaker of the House of Representatives, Femi Gbajabiamila.\nThereafter, Professor Osinbajo and others took turns to pay respect to the soldiers who paid the supreme price while protecting the nation’s territorial integrity.\nIt is a day set aside for sober reflections on the significance of the armed forces to the country.\nWhile the Armed Forces Remembrance Day is celebrated on November 11 every year globally, it is known as the armistice day, commemorating the end of the first World War."
  },
  {
    "headline": "Gunmen Attack Police Station In Imo, Kill Inspector",
    "summarized_story": "Gunmen have attacked a police station in Mgbidi, the headquarters of Oru West Local Government Area of Imo State.\nThe Police Public Relations Officer in Imo, Michael Abattam, confirmed the attack on the security facility in a statement on Saturday.\nAlthough he said the police personnel on duty repelled the attack by the assailants, a police inspector was killed, and another policeman was injured.\nREAD ALSO: Nigeria Honours Fallen Heroes On Armed Forces Remembrance DayNarrating how the incident occurred, Abattam, a Chief Superintendent of Police, explained that the station came under attack on Friday night.\nBut the security operatives on duty, the command’s spokesman said, stood their ground and positioned themselves professionally to repel the gunmen."
  },
  {
    "headline": "AFCON Match Preview: Nigeria Eye Knockout Spot Against Sudan",
    "summarized_story": "The Super Eagles of Nigeria face Sudan in their second Group D match at the 2021 Africa Cup of Nations (AFCON) on Saturday, eyeing a berth at the knockout stage of the biennial soccer competition.\nREAD ALSO: [Egypt, Sudan, And Guinea-Bissau] How Tough Is Nigeria’s AFCON Group?\nNigeria Key Men And Team NewsEguaveon’s side have an abundance of attacking options to do the damage against Sudan.\nWhile Nigeria is a tougher opponent, the Falcons are hoping to give Nigeria a run for their money on Saturday.\nNigeria Vs Sudan Match TimeThe game between Nigeria and Sudan at the 2021 Africa Cup of Nation (AFCON) will start at 5:00 pm (WAT)."
  },
  {
    "headline": "Armed Forces Remembrance Day Celebration In Abuja",
    "summarized_story": ""
  },
  {
    "headline": "Updated: Tinubu visits Zamfara, appeals for continued prayer for peace",
    "summarized_story": "The National Leader of the APC, Asiwaju Bola Tinubu has visited Zamfara to commiserate with Governor Bello Matawalle and residents of the State over the incessant killings by bandits.\nOla Awakan reports that the incessant killings by bandits in Zamfara has become a course of worry to Nigerians.\nWithin the first two weeks of January 2022 hundreds of people are reported to have been killed in Zamfara.\nNational leader of the APC, Asiwaju Bola Tinubu was received in the Government house as he condemned the killings by bandits.\nGovernor Bello Matawalle responded by thanking Bola Tinubu for his show of life."
  },
  {
    "headline": "Ezekwesili heads 80-man transition committee in Anambra",
    "summarized_story": "Anambra State government has announced an 80-man transition committee to ensure a seamless transition from the Governor Willie Obiano’s administration to a Chukwuma Charles Soludo-led administration as from 17th March, 2022.\nThis was disclosed a statement issued on Thursday by Joe Anatune, Media Assistant to the Anambra State Governor-Elect, Chukwuma Soludo Secretariat.\nThe members include:1) Mrs Oby Ezekwesili — Chairperson2) Prof. Benedict Okey Oramah3) Rt.\nIfeanyi Okeoma68) Amb Uche Ajulu-Okeke69) Chief Pat Ubajaka70) Prof. Okey Ikeanyibe71) Comrade Charles Onyeagba72) Prof.\nAu Nnonyelu73) Dr. Forster E. Ihejiofor74) Mr. Odera Ozoka75) Mr. ThankGod Ibeh76) Prof. Sylvia Chika Ifemeje77) Mr. Kanayo Nwafor78) Comrade Churchill Okonkwo79) Sir Damian Okolo80) Dr. Chinedu Onyeizugbe"
  },
  {
    "headline": "February APC National Convention requires no consultation",
    "summarized_story": "The Director General Of the Progressives Governors Forum, Salihu Lukman, has said that the February date for the National Convention of the National Convention requires nor consultation.\nMr Lukman said the more the party continue to allow the leadership of the Caretaker Extraordinary Convention Planning Committee to refuse to commence the process of organising the February APC National Convention, the more party leaders would have supported the CECPC in weakening the electoral prospect of the APC.\nPresident Muhammadu Buhari had agreed to February for the party’s national convention, but the body language of the Caretaker Committee suggest otherwise.\nMr Lukman suggest that the APC must not make the mistake of orientating it’s internal party mobilisation for the emergence of candidates for 2023 elections, especially Presidential Candidate only based on personality contest.\nHe appeal to party stakeholder, as the first challenge is to ensure that the CECPC has no option but to organise the APC National Convention in February as decided based on all the consultations that has taken place, and failure to do otherwise will mean going against president Muhammadu Buhari’s order."
  },
  {
    "headline": "Tinubu visits Zamfara, commiserates Gov Matawalle over killings -",
    "summarized_story": "Former Lagos state Governor and National leader of the All Progressive Congress, Asiwaju Bola Ahmed Tinubu has arrived Zamfara State Government House Gusau.\nThe APC National leader is in Gusau to Commiserate With Governor Bello Matawalle and the people of the state over the recent killings in Anka and Bukuyyum Local Government Areas.\nMr. Tinubu and his entourage were recieved by Zamfara State Governor Bello Matawalle and other top government functionariesHe is currently in a closed door meeting with Governor Bello Matawalle."
  },
  {
    "headline": "Djokovic Detained Ahead of Deportation Appeal",
    "summarized_story": "Novak Djokovic has been detained in Australia ahead of a court hearing that will determine whether the unvaccinated tennis star can stay in the country.\nIf he were to win the tournament, he would become the most successful men’s tennis player in the history of the sport with 21 major titles.\nIf he loses the appeal, the world’s top-ranked men’s tennis player faces deportation and a three-year visa ban.\nOn Saturday, shortly after an online pre-trial hearing, Djokovic returned to the immigration detention hotel where he was held earlier this week.\nMost people I’ve spoken to are pretty outraged that an unvaccinated player was ever allowed here in the first place."
  },
  {
    "headline": "Nigeria: Terrorists Attack Mobile Police College, Army Institute in Borno",
    "summarized_story": "Boko Haram fighters late on Thursday attacked the Mobile Police Training School in limankara, Gwoza Local Government Area of Borno State, but the police authorities denied reports that 13 trainers were abducted by the terrorists during the attack.\nSources said Boko Haram attacked the Gwoza Mobile Police Training School with gun trucks and shot sporadically into the air before allegedly kidnapping the instructors.\n“The terrorists overpowered the policemen guarding the school with ease, some instructors were abducted,” said the source.\nThe Borno State Commissioner of Police, Abdul Umar, yesterday confirmed the attack at the training school, but said nobody was abducted by the terrorists.\nThe army institute is located in the hometown of the immediate past Chief of Army Staff and current Nigerian Ambassador to the Republic of Benin, Tukur Buratai."
  },
  {
    "headline": "Military Remains Loyal to Democratic Rule in Nigeria, Defence Chief Irabor Assures",
    "summarized_story": "The Chief of Defence Staff, General Lucky Irabor, on Friday pledged the loyalty of the military leadership to democratic rule in the country.\nIrabor, who was speaking on a television programme, ahead of the Armed Forces Remembrance Day, also stated that the military was now well-focused on performing its constitutional roles.\n“Going forward, I believe that some of these misperceptions that some Nigerians have had with respect to military engagement will begin to change.\nSpeaking on the crackdown on the use of military gear by civilians, the CDS stated that the present security situation “does not allow the use of military gear by people who are not personnel of the Defence Headquarters (DHQ).”He said: “The criminals among us have had to take advantage of the military, police, and other security agencies’ gear to perpetrate crime.\n“Ordinarily, we will be glad to see that our symbol (gears) is being used for good causes."
  },
  {
    "headline": "Nigeria: South, Middle Belt Leaders Urge Parties to Zone Presidency to South",
    "summarized_story": "The Southern and Middle Belt Leaders Forum (SMBLF) has met in Abuja and once again demanded the return of power to the South in 2023, while also reaffirming its stance on restructuring.\n“Arising therefrom, the meeting resolved as follows: That the extant Constitution and Structure of Nigeria are grossly flawed and lopsided.\n“That any political party that does not zone its presidential ticket to the South should not expect support from the four regions.\n“Therefore, unequivocally, and in full resolve, call on all political parties in the country to zone their presidential tickets to the South.\nAlso in attendance at the meeting were delegations from the four regional socio-cultural organisations – Afenifere for the South-west; Ohanaeze Ndigbo for the South-east; Pan Niger Delta Forum (PANDEF) for the South-south; and the Middle Belt Forum (MBF) for the Middle Belt."
  },
  {
    "headline": "AFCON: Super Eagles Target Second Round Ticket against Sudan’s Falcons on Saturday",
    "summarized_story": "Nigeria’s Super Eagles know they will have both legs firmly in the tournament’s Round of 16 if they scoop all three points against Sudan in their second match of Group B at the 33rd Africa Cup of Nations in Cameroon on Saturday evening.\nThe enthusiasm is palpable.\nAccording to Eguavoen, “We saw the game between Sudan and Guinea Bissau on Tuesday and what I can assure you is that we will not be under-rating them.\nWe are taking it one match at a time and will approach this game differently from how we set up against Egypt.\nWe will throw in our very best.”Victory will not only assure the Eagles of a place in the Round of 16, but also brings closer the possibility of topping the group and therefore retaining the familiar surroundings of Garoua as venue."
  }
]