[
  {
    "headline": "40 Owo massacre victims get mass burial Friday",
    "summarized_story": "The Catholic Diocese of Ondo has fixed Friday, June 17, 2022 for the mass burial of those who lost their lives in the terrorists attack on St. Francis Catholic Church, Owo , Ondo State last week Sunday.\nAugustine Ikwu, confirmed the date of the mass burial to our correspondent on Monday.\nAccording Ikwu, the mass burial would take place at the church’s new cemetery at Emure Road, Owo.\n“The mass burial would take place at the new cemetery of the church on Friday in Owo,” he said.\nThe action is for three days to mourn the victims of the St. Francis Catholic Church, Owo, Ondo State, terrorist attack."
  },
  {
    "headline": "APC: Tinubu to announce running mate on Thursday, as party settles for Muslim/Muslim ticket",
    "summarized_story": "By Omeiza Ajayi, AbujaBarring at last minute change of plans, Presidential Candidate of the ruling All Progressives Congress APC, Asiwaju Bola Ahmed Tinubu will today announce his running mate as the deadline given by the Independent National Electoral Commission draws to a close.\nThere were indications within party circles that the party may have settled for a Muslim/Muslim ticket.\nSome of those currently in contention are Kano state Governor, Abdullahi Umar Ganduje, a kinsman of the president, Alhaji Kabir Ibrahim Masari from Katsina state, former Secretary of the Buhari Support Group (BSG) and ally of the President Muhammadu Buhari from the days of All Nigerian People’s Party (ANPP) and Congress for Progressive Change ( CPC), Dr. Ibrahim Bello Dauda as well as a former Governor of Borno state, Kashim Shettima.\nDauda, a management consultant from Borno State is said to have the support of party chieftains, especially the CPC bloc since the New PDP and the ACN have taken the National Chairman and Presidential ticket respectively."
  },
  {
    "headline": "2023: I am Ebonyi’s next Governor, Ebonyi Speaker declares",
    "summarized_story": "By Peter Okutu, AbakalikiThe All Progressive Congress, APC, Governorship candidate for the 2023 general election and Speaker of Ebonyi State House of Assembly, Rt.\nFrancis Nwifuru, yesterday declared that he would be sworn-in as the next Governor of Ebonyi State after the 2023 general election in the State.\n“There was nothing like parrallel Congresses in Ebonyi APC.\nThere was no petition from Ebonyi State.\nAnd by the grace of God , I will be sworn in on May 29th, 2023."
  },
  {
    "headline": "2023: Umahi suspends Ebonyi Commissioner for Finance indefinitely",
    "summarized_story": "By Peter Okutu, AbakalikiGovernor David Umahi of Ebonyi State, Wednesday suspended the State Commissioner for Finance and Economic Development, Hon.\nOkechukwu Orlando Nweze indefinitely.\nThe suspended Commissioner has been directed to handover all government property in his possession to Permanent Secretary of his Ministry.\nChief David Nweze Umahi, FNSE, FNATE, has directed indefinite suspension of Commissioner for Finance and Economic Development, Hon.\nOkechukwu Orlando Nweze with effect from June 15th 2022, for his inability to discharge his duty effectively."
  },
  {
    "headline": "Medical Association cries for Justice over gruesome murder of colleague in Ebonyi",
    "summarized_story": "…he left his wife, four kids behindBy Peter Okutu, AbakalikiThe Association of Medical Laboratory Scientists of Nigeria, Ebonyi State Chapter, Tuesday, cried out for justice over the gruesome murder of one of its members, Mr. Casmir Afamefuna Ani in the State.\nThis development has affected night outting within the metropolis as residents are often seen around 7pm, making efforts to get to their various destinations without delay.\nUntil his death, Mr. Ani was the former Vice Chairman, Federal Teaching Hospital, Abakaliki, FETHA, Welfare Association and Current Chairman, Enugu Welfare Association, FETHA.\nVanguard investigation revealed that the deceased may have lost his life, following his intention to retain hs position as Chairman, Enugu Welfare Association.\n“Deployment of adequate manpower and logistics that would lead to the prompt track down and arrest of the perpetrators of this dastardly act, their collaborators and possibly, sponsors."
  },
  {
    "headline": "Owo church attack: Do more to secure lives, property of Nigerians, Kwankwaso urges FG",
    "summarized_story": "Kwankwaso…pays condolence visit to Ogunoye, Olowo of OwoBy Levinus Nwabughiogu-AbujaThe NNPP Presidential Candidate, Senator Rabiu Musa Kwankwaso has called on the federal government to do more in ensuring security of lives and properties of Nigerian citizens and other residents in the country.\nHe made the appeal, Wednesday, when he paid a condolence visit to Prince Ajibade Gbadegesin Ogunoye, the Olowo of Owo as well as the Ojomo of Ijebu Palace, Owo in Ondo State over the recent Church attack which killed and injured many people.\nA statement made available to Vanguard by his media aide, Saifullahi Hassan in Abuja last night added that the former Minister of Defence who also visited the scene of the unfortunate attack in Owo, commended Ondo State Governor, Rotimi Akeredolu for his resolve on improving the security of the state."
  },
  {
    "headline": "Defection: List of 24 lawmakers who initiated impeachment process against Oyo deputy gov, Olaniyan [FULL LIST]",
    "summarized_story": "DAILY POST had earlier reported that no fewer than 24 members of the assembly has initiated impeachment process against the deputy governor.\nOlaniyan and governor Seyi Makinde were elected as deputy governor and governor on the platform of PDP in 2019.\nTwenty-four members out of the 32 members of the assembly have however initiated impeachment process against the deputy governor.\nOthers are Kehinde Olatunde (Akinyele 2), Olajide Akintunde (Lagelu), Mustapha Akeem (Kajola), Popoola Ademola (Ibadan South East 2), Owolabi Olusola (Ibadan North East 2), Olagoke Olamide (Ibadan North East 1), Olayanju Kazeem (Irepo/Olorunsogo), Ojedokun Peter (Ibarapa North/Centre).\nThe rest are; Gbadamosi Saminu (Saki East/Atisbo), Mabaje Adekunle (Iddo), Oluwafowokanmi Oluwafemi (Ibadan South West 2), Akeem Adedibu (Iwajowa), Fatokun Ayo (Akinyele 1), Rasak Ademola (Ibadan South East 1), Obadara Akeem (Ibadan North West), Oyekunle Fola (Ibadan North 1) and Adetunji Francis (Oluyole)."
  },
  {
    "headline": "Owo massacre: Ondo community invokes ‘god of iron’ on attackers",
    "summarized_story": "Following the tragic attack on Saint Francis Catholic Church in Owo on June 5, worshipers of the ‘god of iron’ in the town have vowed to perform open rituals against the gunmen behind the dastardly act.\nThe rites would performed in order to invoke the deity to punish the terrorists who carried out the attack.\nHowever, the Olowo of Owo, Oba Ajibade Gbadegesin Ogunoye, the town’s ruler, has stated that there will be no restrictions on movement during the rites.\n“However, because there will be no limits on human or vehicular mobility, this scheduled ceremonial step for tomorrow will not disrupt the normal daily routine of residents and visitors alike in the ancient town.\n“Please note that even the specified areas where the individuals in charge of the invocation will execute the requisite rites are free for movement, but stringent traffic control will be in place.”"
  },
  {
    "headline": "Ekiti election: NSCDC deploys 9,747 personnel, warns against compromise",
    "summarized_story": "The Commandant General, Nigeria Security and Civil Defence Corps (NSCDC), Ahmed Abubakar Audi, on Wednesday, charged all the personnel deployed to Ekiti gubernatorial election slated for June 18, 2022 election to be professional in their conducts by allowing the Standard Operating Procedure (SOP) of the Corps to guide their performances.\nIn a statement by DCC Olusola Odumos, Director, Public Relations, NSCDC National Headquarters,Abuja, said the CG who has approved the deployment of 9,747 officers and men, noted that the service must remain apolitical and neutral to avoid any form of compromise during the election.\n“The composition of the deployment for Ekiti election includes personnel from the Arms Squad, Chemical, Biological Radiological and Explosives Unit (CBRNE) Special Weapon and Tactics (SWAT), Kennel Unit, Counter-Terrorism Unit, Rapid Response Squad (RRS), Special Female Squad, Ops Special Squad and CG’s Special Monitoring team,” he said.\nHe, however, assured the people of Ekiti State of a hitch-free election process as the corps will be working in synergy with other security agencies involved in the conduct of the exercise to protect the electorate and arrest any criminal trying to destabilize the state.\nAccording to him, the Assistant Commandant General (ACG) Special Duties, Haruna Lawal Muhammed, who will be assisted by the Zonal Commander (Zone J) and other Senior Officers in the zone has been deployed to head and coordinate the election operations in the state."
  },
  {
    "headline": "I will still run for presidency – Gov Yahaya Bello",
    "summarized_story": "Kogi State Governor, Yahaya Bello has said he went into the race for the presidency in 2023 under the All Progressives Congress, APC, just to hone his skills as a politician.\n“I came today to see Mr. President to express my appreciation for allowing me to participate in the just concluded national special convention that elected our standard bearer.\nAnd Mr. President was pleased.\n“They’re not selected based on region, they are selected based on competence, capacity to be able to protect this villa.\nSo we need those who will be able to solve all of these challenges that are confronting us today in Nigeria”."
  },
  {
    "headline": "ASUU strike: A lot is going on behind the scenes – FG",
    "summarized_story": "The Federal Government has claimed “a lot is happening behind the scenes” as it seeks to resolve the ongoing strike by the Academic Staff Union of Universities (ASUU).\nASUU embarked on strike since February 14 and since then, all the public universities have been shut down.\n“I wish that the ASUU issue is as simple as many of us think it is.\nBut I want to assure you that a lot is going on behind the scenes.\n“We’re worried, we’re concerned, and we’ll continue to work towards finding an early resolution of the problem,” Mohammed said."
  },
  {
    "headline": "Ekiti 2022: PSC warns officers against partisanship The Nation Newspaper",
    "summarized_story": "Chairman of the Police Service Commission (PSC) Musiliu Smith has warned police officers deployed for Saturday’s election not to compromise their rules of engagement and refrain from being partisan.\nAccording to Smith, a team of senior members of staff of the commission have been deployed to monitor police officers on election duty.\nThe commission has also designed appropriate guidelines for all police officers deployed in Ekiti State on electoral duties.\n“Chairman of the Commission and National Coordinator for the exercise, Alhaji Musiliu Smith, urges the commission’s delegation to ensure professionalism in their conduct.\n“He warned that any staff caught undermining the efforts of the commission to ensure orderly and peaceful elections will be disciplined in line with extant laws.”"
  },
  {
    "headline": "Ekiti 2022: NSCDC deploys 9,747 personnel for election The Nation Newspaper",
    "summarized_story": "The Nigeria Security and Civil Defence Corps (NSCDC) has deployed 9,747 officers for Saturday’s election.\nCommandant-General Abubakar Audi urged the personnel to be professional in their conduct by allowing the Standard Operating Procedure (SOP) of the Corps to guide their performances.\nThe Federal Road Safety Corps (FRSC) has also deployed 1,500 personnel to help enforce traffic rules and regulations during the election.\nAlso deployed are operational vehicles, including tow trucks and ambulances, to strengthen the enforcement of movement restrictions.\nA statement yesterday by the Corps Public Education Officer, ACM Bisi Kazeem, described the measures as part of the corps’ support toward ensuring smooth election."
  },
  {
    "headline": "Oni: I have no deal with Tinubu on poll The Nation Newspaper",
    "summarized_story": "Governorship candidate of the Social Democratic Party (SDP) Chief Segun Oni has denied striking any deal with the All Progressive Congress (APC) presidential candidate, Asiwaju Bola Tinubu, on the governorship election.\nOni, who was reacting to speculations that he has entered into a deal with Tinubu to step down for the APC candidate, Biodun Oyebanji, said his ambition to govern the state was intact and non-negotiable.\nThe candidate said he still has a cordial relationship with Tinubu, but insisted that the former governor’s emergence as the APC presidential candidate won’t sway him to shelve his governorship aspiration or compromise it.\nI have not seen Asiwaju Bola Tinubu for over a year now.\nWe have seen a situation whereby minority was lorded over the majority, but it won’t happen again in Ekiti."
  },
  {
    "headline": "PDP, five other parties shun peace accord The Nation Newspaper",
    "summarized_story": "Six candidates for Saturday’s governorship elections in Ekiti State shunned the peace agreement signing meeting called by the National Peace Commission (NPC).\nThose present were Biodun Oyebanji (All Progressive Congress); Segun Oni (Social Democratic Party); Wole Oluyede (African Democratic Party), Modupe Olatawura (Action People’s Party) and Oladosu Fatomilola (New Nigerian People’s Party).\nOthers are Kemi Halle-Elebute of the African Democratic Party (ADP), Kolade Akinyemi (Zenith Labour Party), Olufemi Obidoyin (All Progressives Grand Alliance) and Olaniyi Agboola (People’s Redemption Party).\nRead Also: Quick facts about Ekiti 2022 electionChairman of National Peace Commission (NPC) Gen. Abdulsalam Abubakar (rtd) said the initiative was to commit the political parties and their candidates to a peaceful election.\n“We again appeal to all political parties and their candidates to ensure that they do not see the signing of this Peace Accord as a mere formality and a photo opportunity."
  },
  {
    "headline": "Last-minute intrigues in PDP over Atiku’s running mate The Nation Newspaper",
    "summarized_story": "Yesterday’s decision by the party to raise a team led by Chief Tom Ikimi to screen Rivers State Governor Nyesom Wike created more confusion.\nObservers were wondering why the need to screen Wike again, having been screened by the David Mark-led presidential screening panel.\nThe Rivers State governor came second in the PDP presidential primary.\nOther members of the Ikimi panel expected to screen Wike today, according to PDP spokesman, Debo Ologunagba, are: Dr Akilu Indabawa, Capt.\nVice Presidential and deputy governorship candidates) without which the nomination would be invalid."
  },
  {
    "headline": "VP slot: Suspense persists in APC",
    "summarized_story": "By Wilfred Eya and Ndubuisi OrjiTwenty fours hours to the deadline by the Independent National Electoral Commission (INEC) for political parties to submit names of their vice presidential candidates, suspense has persisted in the All Progressives Congress (APC) over choice of running mate.\nThe development came just as the main opposition party, Peoples Democratic Party (PDP), will today screen its vice presidential aspirants.\nA top member of the APC told Daily Sun that the tension in the camps of various interest groups scrambling for the vice presidential candidate slot is boiling over.\nAlso, the main opposition party would today screen its aspirants for the vice presidential slot.\nHowever, the party is yet to make a formal announcement on the choice of Wike as its 2023 vice presidential candidate."
  },
  {
    "headline": "Reps seek override of President’s veto on Amended Electoral Act",
    "summarized_story": "From Ndubuisi Orji, AbujaSome members of the House of Representatives, yesterday, charged the parliament to override President Muhammadu Buhari’s veto on the amendment the Section 84 (8) of the Electoral Act.\nThe House while on recess convened an emergency session to amend Section 84 (8) of the Electoral Act 2022.\nThis was not unconnected with the president’s refusal to sign the amended 2022 Electoral Act.\nThe Continuous Voter Registration (CVR) exercise is scheduled to end on June 30.\nHe expressed concern due to reports of shortages of voter registration machines, inadequate manpower and personnel at registration centres."
  },
  {
    "headline": "Ekiti 2022: I didn’t meet Tinubu to compromise my candidacy, Oni clarifies – The Sun Nigeria",
    "summarized_story": "“Let me say that this is a lie, I have not seen Tinubu for over a year now.\nI am here for Ekiti people and I will not compromise the interest of Ekiti people for anything.\nI am a contented person and I am not a person that can be bought with money, I can’t be purchased.\nOni also lambasted politicians planning to buy the conscience of the people in the election, describing votes-buying as an unpardonable criminal offence in the face of the law.\nWe have seen a situation whereby minority was lorded over the majority, but it won’t happen again in Ekiti."
  },
  {
    "headline": "Akwa Ibom: Igini calls Akpabio’s primary victory Nollywood fantasy",
    "summarized_story": "Ekpodum dismissed the primary as sham, saying the earlier version conducted on May 27, where he won was the authentic primary and he remains the bona fide candidate for Akwa Ibom North West (Ikot Ekpene) senatorial district.\nThe REC who spoke on a radio programme in the state said the senatorial primary for Akwa Ibom North West Senatorial District was neither canceled, nullified nor inconclusive as mischievously reported.\n“The law is saying that those who have emerged at all levels up to the presidential level, you can decide that you are no longer interested.\nYou can write an application signed by yourself, delivered to your party who will now deliver it to INEC.\nBut nobody can shave the political head of another person in his or her absence.”Igini said the report of the Akwa Ibom North West Senatorial District APC primary as submitted to INEC headquarters in Abuja is final."
  },
  {
    "headline": "2023: I’ll work for APC, Tinubu’s victory –Kalu – The Sun Nigeria",
    "summarized_story": "From Kenneth Udeh, AbujaChief Whip of the Senate, Dr. Orji Uzor Kalu, yesterday, pledged to work towards the success of the All Progressive’s Congress (APC) presidential candidate, Senator Ahmed Bola Tinubu, in the 2023 elections.\nPrior to Tinubu’s emergence, Kalu led a sturdy campaign for Lawan to emerge as the party’s flag bearer via consensus.\nSo, I’m very happy that at the end APC won.\n“The next is to work for the APC and to work for the APC candidate.\nWhile applauding President Muhammadu Buhari for not endorsing any presidential candidate, the former governor expressed optimism that South East would vote APC in 2023."
  },
  {
    "headline": "After Members’ Poor Performance in Primaries, Lawmakers Set to Override Buhari’s Veto on Statutory Delegates",
    "summarized_story": "He therefore urged his colleagues to rise up, take the pen, collect signatures and override Mr. President and give Nigerians the enabling electoral law.\nAnd by 12th, this amendment was transmitted to Mr. President.\nMr. President did not just ignore, he traveled out of the country on a condolence visit to Dubai and that created a lot of problem for the country.\nI think we are beginning with the good work you are doing Mr. Speaker.\nToby Okechukwu, had said that the electoral act had been weaponized, calling for activation of relevant Constitutional powers to address the lacuna."
  },
  {
    "headline": "House Urges INEC to Extend Voters Registration Deadline by 60 Days",
    "summarized_story": "Juliet Akoje in AbujaThe House of representatives has urged the Independent National Electoral Commission (INEC) to extend the voters registration deadline by an extra 60 (sixty) days from June 30, 2022, to enable Nigerians register.\nThese resolutions followed the adoption of a motion on the need for the Independent National Electoral Commission (INEC) to Extend the Deadline of Continuous Voters Registration, Deploy additional Staff and Voters Registration Machines Across the Country moved by Hon.\nHe added that the decision to suspend the voters’ registration was in line with the provisions of the Electoral Act, 2022 which requires INEC to suspend voters’ registration at least 60 days before an election.\nHe expressed concerns over calls from concerned Citizens and Civil Societies urging INEC to extend the voters’ registration deadline to accommodate eligible voters desiring to register for their Permanent Voters Cards.\n“If nothing is done to improve the shortage of voter registration equipment and extend the deadline for voters registration, millions of Nigerians will be disenfranchised, thus jeopardizing the integrity of the 2023 General Elections,” he said."
  },
  {
    "headline": "PDP NWC Meets Today over Committees’ Recommendations on Vice Presidential Candidate",
    "summarized_story": "Following the meetings of the various elders and consultative committees of the Peoples Democratic Party, PDP, on the choice of a vice presidential candidate for the main opposition party, the National Working Committee, NWC, of the PDP will be meeting this afternoon to decide on the recommendations made by the various committees.Subsequently, sources close to the party informed THISDAY that the NWC will submit the names of three vice presidential nominees to the presidential candidate of the PDP, Alhaji Atiku Abubakar, for his consideration.\nThe three nominees are of South South and South East origin.The PDP, based on the timetable by the Independent National Electoral Commission, INEC, is expected to submit the name of its presidential candidate and his running mate on or before Friday, June 17, 2022.\nMore details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "PDP Constitutes Committee to Screen Vice Presidential Candidates, Screening Holds Thursday",
    "summarized_story": "Chuks Okocha in AbujaThe Peoples Democratic Party (PDP) has constituted a 12- man committee led by Tom Ikimi to Chair the Vice Presidential candidates screening exercise.\nA statement by the National Publicity Secretary of the party, Hon.\nDebo Ologunagba, named Dr. Akilu Indabawa as the Committee Secretary just as Mr. Sunday Omobo was announced as Administrative Secretary.\nAlso on the committee are Prof. Aisha Madawaki – Member, Mrs. Ayotunde George-Ologun – Member, Chief Mrs. Chidiebelu Mofus – Member and H.E.\nFidelis Tapgun – MemberThe party said that the screening exercise will hold at the National Working Committee (NWC) Hall, PDP National Secretariat, Wadata Plaza, Abuja on Thursday, June 16, 2022. at 10am."
  },
  {
    "headline": "Presidency: No Cabal Influences Buhari’s Decisions",
    "summarized_story": "Senior Special Assistant to the President on Media and Publicity, Malam Garba Shehu, stated this yesterday in a release.\nShehu made reference to the recent presidential primary of the ruling All Progressives Congress (APC), stressing that Buhari refused to act as a dictator; instead, he ensured a level playing field for all participants.\nShehu stated, “No intrigue, no division, no disagreement, no defeated candidates rejecting the result, no splits, no third-party runs.\nOnly determination to rally around the chosen flag-bearer to deliver victory and an APC third term in February 2023.\nHe said that candidate was whoever was chosen by the APC in a democratic primary to lead the party at the election.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "EXCLUSIVE: How Lopsided Promotion Of Officers By Nigeria’s Anti-Narcotics Agency, NDLEA Favours Candidates Of Political Office Holders, Denies Others For About 20 Years",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), through its harmonisation exercise, has allegedly denied some officers promotion for about 20 years, while some of their colleagues recruited much later after have been promoted up to two times.\nThe sources said that their promotions have been cumulatively stagnated for about 10 to 20 years which translates to a loss of three to six ranks.\nAccording to him, all CNAs with earlier or 2004 effective dates were made to go through conversion course 1/2008 with no cognizance of the fact that some older NA courses 7/94 and 8/96 were on re-sit.\nThe imposition of the conversion course on these unprepared sets of officers made them unsuccessful in conversion course 1, it was learnt.\nThough the effective dates of promotion of successful candidates of CNA conversion course 1 were backdated appropriately, that of CNA course 2/2013 converted officers were not backdated,” the source continued."
  },
  {
    "headline": "EXCLUSIVE: How Lopsided Promotion Of Officers By Nigeria’s Anti-Narcotics Agency, NDLEA Favours Candidates Of Political Office Holders, Denies Others For About 20 Years",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), through its harmonisation exercise, has allegedly denied some officers promotion for about 20 years, while some of their colleagues recruited much later after have been promoted up to two times.\nThe sources said that their promotions have been cumulatively stagnated for about 10 to 20 years which translates to a loss of three to six ranks.\nAccording to him, all CNAs with earlier or 2004 effective dates were made to go through conversion course 1/2008 with no cognizance of the fact that some older NA courses 7/94 and 8/96 were on re-sit.\nThe imposition of the conversion course on these unprepared sets of officers made them unsuccessful in conversion course 1, it was learnt.\nThough the effective dates of promotion of successful candidates of CNA conversion course 1 were backdated appropriately, that of CNA course 2/2013 converted officers were not backdated,” the source continued."
  },
  {
    "headline": "EXCLUSIVE: How Lopsided Promotion Of Officers By Nigeria’s Anti-Narcotics Agency, NDLEA Favours Candidates Of Political Office Holders, Denies Others For About 20 Years",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA), through its harmonisation exercise, has allegedly denied some officers promotion for about 20 years, while some of their colleagues recruited much later after have been promoted up to two times.\nThe sources said that their promotions have been cumulatively stagnated for about 10 to 20 years which translates to a loss of three to six ranks.\nAccording to him, all CNAs with earlier or 2004 effective dates were made to go through conversion course 1/2008 with no cognizance of the fact that some older NA courses 7/94 and 8/96 were on re-sit.\nThe imposition of the conversion course on these unprepared sets of officers made them unsuccessful in conversion course 1, it was learnt.\nThough the effective dates of promotion of successful candidates of CNA conversion course 1 were backdated appropriately, that of CNA course 2/2013 converted officers were not backdated,” the source continued."
  },
  {
    "headline": "Oyo State Lawmakers Start Impeachment Process Against Deputy Governor, Olaniyan",
    "summarized_story": "The Oyo State House of Assembly has commenced the process to impeach the deputy governor of the state, Mr Rauf Olaniyan.\nHence, The Speaker instructed the Clerk of the House, Mrs Yetunde Awe to write the deputy governor mandating him to respond to the allegations within seven days.\nThe impeachment process followed the recent defection of the state deputy governor from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC).\nIn 2021, SaharaReporters had reported that Oyo State would soon be embroiled in legal turmoil as a plot to impeach Olaniyan had been hatched.\nMakinde and Olaniyan have been at loggerheads shortly after their election in 2019, with supporters of Olaniyan accusing Makinde of relegating his deputy governor to the background."
  },
  {
    "headline": "Oyo State Lawmakers Start Impeachment Process Against Deputy Governor, Olaniyan",
    "summarized_story": "The Oyo State House of Assembly has commenced the process to impeach the deputy governor of the state, Mr Rauf Olaniyan.\nHence, The Speaker instructed the Clerk of the House, Mrs Yetunde Awe to write the deputy governor mandating him to respond to the allegations within seven days.\nThe impeachment process followed the recent defection of the state deputy governor from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC).\nIn 2021, SaharaReporters had reported that Oyo State would soon be embroiled in legal turmoil as a plot to impeach Olaniyan had been hatched.\nMakinde and Olaniyan have been at loggerheads shortly after their election in 2019, with supporters of Olaniyan accusing Makinde of relegating his deputy governor to the background."
  },
  {
    "headline": "EXTRA: My next attempt at presidency will be supersonic, says Yahaya Bello",
    "summarized_story": "Yahaya Bello, governor of Kogi state, says he will still contest the presidency in the near future.\nBello spoke on Wednesday, while fielding questions from state house correspondents in Abuja after visiting President Muhammadu Buhari.\nThe governor paid a visit to Buhari to thank him for his support on participating in the APC presidential primary election.\nBola Tinubu, former governor of Lagos, won the ticket after securing 1,271 votes, while the Kogi governor polled 47 votes.\nAdvertisementBello said what he did with the APC presidential race was to “test the mic”, adding that his next attempt will be “supersonic”."
  },
  {
    "headline": "EXTRA: My next attempt at presidency will be supersonic, says Yahaya Bello",
    "summarized_story": "Yahaya Bello, governor of Kogi state, says he will still contest the presidency in the near future.\nBello spoke on Wednesday, while fielding questions from state house correspondents in Abuja after visiting President Muhammadu Buhari.\nThe governor paid a visit to Buhari to thank him for his support on participating in the APC presidential primary election.\nBola Tinubu, former governor of Lagos, won the ticket after securing 1,271 votes, while the Kogi governor polled 47 votes.\nAdvertisementBello said what he did with the APC presidential race was to “test the mic”, adding that his next attempt will be “supersonic”."
  },
  {
    "headline": "PDP sets up committee to screen Atiku’s running mate on Thursday",
    "summarized_story": "The national working committee (NWC) of the Peoples Democratic Party (PDP) has set up a committee to screen the vice-presidential candidate of the party for the 2023 elections.\nTom Ikimi, former minister of foreign affairs, is the chairman of the committee, while Akilu Indabawa, will serve as the secretary.\nAdvertisementThe committee members also include Ayotunde George-Ologun, Chidiebelu Mofus and Fidelis Tapgun.\nTheCable had reported how sources within the party said a PDP committee endorsed Nyesom Wike, governor of Rivers, as the vice-presidential candidate of the party for the 2023 elections.\nThe NWC members subsequently communicated their decision to Atiku Abubakar, the presidential candidate of the party."
  },
  {
    "headline": "PDP sets up committee to screen Atiku’s running mate on Thursday",
    "summarized_story": "The national working committee (NWC) of the Peoples Democratic Party (PDP) has set up a committee to screen the vice-presidential candidate of the party for the 2023 elections.\nTom Ikimi, former minister of foreign affairs, is the chairman of the committee, while Akilu Indabawa, will serve as the secretary.\nAdvertisementThe committee members also include Ayotunde George-Ologun, Chidiebelu Mofus and Fidelis Tapgun.\nTheCable had reported how sources within the party said a PDP committee endorsed Nyesom Wike, governor of Rivers, as the vice-presidential candidate of the party for the 2023 elections.\nThe NWC members subsequently communicated their decision to Atiku Abubakar, the presidential candidate of the party."
  },
  {
    "headline": "Sources: PDP NWC endorses Wike to be Atiku’s running mate",
    "summarized_story": "The national working committee (NWC) of the Peoples Democratic Party (PDP) has endorsed Nyesom Wike, governor of Rivers state, as the vice-presidential candidate of the party for the 2023 elections.\nTheCable understands that the NWC members voted 13-3 to endorse the report of the panel which had earlier nominated Wike for the VP ticket.\nThe NWC members subsequently communicated their decision to Atiku Abubakar, the presidential candidate of the party.\nThe panel — chaired by Umar Damagum, PDP deputy national chairman (north) — comprises former and serving governors, NWC members, and members of the board of trustees (BoT).\nIyorchia Ayu, national chairman of the PDP, had said the party will announce Atiku’s running mate within 48 hours."
  },
  {
    "headline": "The leading African tech moves from May",
    "summarized_story": "In May, African startups raised $437,100,000 across 49 fully disclosed* deals as fintech startups retook the lead.\nFintech startups raised $195,900,000 (44.82%), AI/deeptech startups raised $47,000,000 (10.75%), and mobility/logistics startups raised $45,700,00 (10.46%).\nNorth African startups are second with $122,700,000 (28.07%), while East African startups raised $64,400,000 (14.73%).\nImage credits: Timi Odueso/TechCabalThe top 5 disclosed deals of May are:Note: This data is inclusive only of funding deals announced in May 2022.\nSpeaking of streaming in South Africa, the US-streaming platform Disney+ launched in South Africa, in May."
  },
  {
    "headline": "What does Gozem and IFC partnership mean?",
    "summarized_story": "That’s the estimated number of motor vehicle drivers that Gozem, a Francophone Africa-focused super app, says operate in informal markets across West and Central Africa.\nIFC has dedicated a $10 million investment into Gozem’s vehicle financing project.\nThis investment will enable Gozem to provide access to affordable vehicle financing in Togo and Benin, its operating markets.\nGet the best African tech newsletters in your inboxThis deal comes about 6 months after Gozem closed a $5 million funding and 14 months after it started its vehicle financing program.\nHe added that this partnership also factors in electric vehicles (EV)."
  },
  {
    "headline": "NITDA's Code of Practice to help Nigeria regulate social media",
    "summarized_story": "Months after it lifted its 7-month ban on Twitter, the Nigerian government has set out to regulate social media platforms with a new Code of Practice.\nWhile this includes US-based social media platforms, it also includes indigenous sites like Nairaland, blogs like Linda Ikeji, and newsletter platforms like Substack with over 100,000 users.\nNigeria’s poor regulatory historyThere are few provisions within the draft Code that fulfills NITDA’s aim of “protecting the fundamental human rights of Nigerians”.\nThere was the social media bill of 2019, and the hate speech bill which proscribed death as the penalty for hate speech.\nIn 2021, there was also an attempt to modify the National Broadcasting Commission (NBC) Act to cover social media platforms."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Federal University of Education (Technical), Bichi Est. Bill, 2022 Passes 2nd reading – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Federal University of Education (Technical) Bichi establishment Bill 2022 has passed second reading on the floor of the Senate.\nAccording to the lawmaker, for any country to achieve meaningful development, the socio economic and political system must be enhanced.\nThis is why successive Nigerian governments placed much emphases on the development of the individual as a means to national development.\nTo act as agents and catalysts for effective Educational system, through post graduate training, research and innovation, for effective economic utilization and conservation of the country’s human and material resources.\nTo bring quality change in Technical Education by focusing on teacher Education, through teaching and learning innovations."
  },
  {
    "headline": "How Edo emerged as World Bank’s best-performing state, by Edo NEWMAP Coordinator – Nigerian Observer",
    "summarized_story": "The World Bank, last weekend, at the closing/valedictory session for the NEWMAP project in Abuja, named Edo State as the best-performing state since the inception of the project in 2012.\nEdo State also came out tops in two other categories, including Best in Disbursement/Engineering/Civil Works/Bio-Engineering and Best in Counterpart Funding.\n“Edo State came out tops in three (3) categories, which is the highest winning by any state out of the 23 NEWMAP participating states.\nThe categories are best overall performing state; best in Disbursement/Engineering/Civil Works/Bio-Engineering, and best in Counterpart Funding.\nThese are in addition to coming as runner up in several other categories.”Obaseki further noted, “It is on record that Edo State NEWMAP accounted for about 17 percent of the overall success of NEWMAP in Nigeria."
  },
  {
    "headline": "Edo eyes N2bn investment in tourism, others, as U.S trade mission arrives Benin – Nigerian Observer",
    "summarized_story": "The Commissioner for Industry, Trade and Co-operatives, Hon.\nAfie Braimoh, who disclosed this to journalists in Benin City, said the trade mission delegation is expected to be in Benin City, the Edo State capital, between June 18 and 19, 2022.\nShe noted that the County Director has facilitated several annual trade missions across Africa and other continents for years.\nBraimoh said the team has a special interest in investment in Africa’s tourism, maritime, and aviation sectors, which are in line with the Obaseki’s Making Edo Great Again (MEGA) Agenda to make Edo State a tourist destination.\nOther areas of possible collaboration, according to the commissioner, include maritime services with opportunities to export ‘Made in Edo’ products via Miami International Port."
  },
  {
    "headline": "Miami Trade Mission to visit Benin- Braimoh – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe efforts of the Edo State government to make the State a tourism and investment hub have begun to yield fruit, with the scheduled visit of a trade mission from the Miami- Dade County, Florida, United States of America.\nThe trade mission delegations are expected to be in Benin between June 18 to 19.\nThe American Trade Mission visit to Benin is the brainchild of Hon.\nShe also led the Edo State team which made its debut appearance at the 6th NASSI business trade fair held in Lagos in May 2022.\nThe trade mission plans to visit the FCT Abuja and Lagos for similar bilateral discussions on trade and tourism before they depart for other African countries by June 22."
  },
  {
    "headline": "AUN/PREMIUM TIMES DATA HUB",
    "summarized_story": "The past five years have shown us how fragile democracy can be, not only in Nigeria but around the world.\nDemocratic norms are faltering as autocratic leaders and politicians with subversive intentions have found ways to use mainstream and social media to control cognitive outcomes through disinformation and manipulation.\nThe AUN-Premium Times Data Hub is is a unique collaboration between higher education and media to inject more data-driven analysis into civic discussions and journalism.\nThe Development Hub will use data and analysis to build an evidence base for change.\nOn each platform, the best available data on Nigeria’s current status will be presented and analysed and solutions to specific problems will be proposed."
  },
  {
    "headline": "Expect improved power supply from July 1, FG assures Nigerians",
    "summarized_story": "The Chairman, Nigerian Electricity Regulatory Commission (NERC), Mr Sanusi Garba, has assured that Nigerians will witness improved power supply from July 1 following renewed efforts by industry stakeholders.\nGarba gave the assurance at an interactive session with newsmen after the Second Nigerian Electricity Supply Industry (NESI) meeting on Wednesday in Lagos.\nThe meeting was attended by top officials of NERC, Transmission Company of Nigeria (TCN), Generation Companies as well electricity Distribution Companies.\n“We might not have 24/7 power supply from July 1 but Nigerians will see the trajectory because the target is to have an average of 5,000MW daily for transmission and distribution,” said Garba.\nHe also blamed the recent collapse of the national grid on inadequate gas supply, maintenance of some thermal stations as well as vandalism of power infrastructure and gas pipelines."
  },
  {
    "headline": "Osun 2022: Ex- Aregbesola’s aide defects to PDP, backs Senator Adeleke",
    "summarized_story": "Kolapo Alimi, on Wednesday, defected to People’s Democratic Party, PDP, saying governor Adegboyega Oyetola has divided the ruling APC.\nAlimi who is currently one of the legislative aide to Speaker of House of Representatives, Rt.\nHon Femi Gbajabiamila said APC under Oyetola has been sharply divided due to his self- centred policy.\nThe official defection that took place at the state party secretariat, Biket Junction, along Osogbo/ Ikirun road on Wednesday.\n“It’s not by force to rule, people have to decide who they want and I believe it is me, Senator Ademola Nurudeen Adeleke” he concluded."
  },
  {
    "headline": "Petrol to sell N180 per litre in S/West as marketers set to increase pump price",
    "summarized_story": "Tajudeen explained that the Federal Government’s depots at Mosimi in Sagamu, Ogun State, Ibadan, Lagos, Ore in Ondo State as well as the one in Ilorin, Kwara State capital had all refused to load any of the independent marketers.\nThe development, he said compelled his members to start making purchases from the private depot owners since January, 2022.\n“So, by the time we add the cost of transportation to the purchasing amount, we will be arriving at a sum above N165, which is the government approved pump dispensing price”.\n“But sad enough, the regulatory agency appeared incapacitated to control and compel these private depot owners to sell at government’s approved price for us”.\n“As at today, the purchasing price of diesel has increased by 400%."
  },
  {
    "headline": "Electoral Act: You can not steal my votes again, Adeleke taunts APC",
    "summarized_story": "The governorship candidate of the Peoples Democratic Party (PDP) in Osun State, Senator Ademola Adeleke, has disclosed that the amended electoral law has made it impossible for anybody to steal his votes in the coming July 16 poll in the state.\nAdeleke said the electoral act signed into law by President Muhammadu Buhari has made rigging of election impossible, assuring his supporters of victory in the forthcoming election.\nAccording to him, the poll in July will be a straight victory for the PDP, unlike in 2018.\n“Well I commend President Muhammadu Buhari for signing the amended electoral act into law, the act has already made rigging almost impossible.\n“The masses are more wise, they are ready to defend their votes so I don’t believe it going to be possible for anyone steal our votes again like in 2018."
  },
  {
    "headline": "I don’t rate Messi among football’s greatest players – Van Basten",
    "summarized_story": "Marco van Basten, Dutch football legend, has that Argentina star, Lionel Messi is not in the top three of his all time greatest football players.\nThe former AC Milan striker said Messi who has won a record seven Ballon d’Ors, is not the game’s greatest.\nHe rated Pele, Diego Maradona and Johan Cruyff among the greatest.\nSpeaking to France Football, he said, “Pele, [Diego] Maradona and [Johan] Cruyff are for me the three greatest players in history.\n“Messi is also a great player, but Maradona always had more personality in a team."
  },
  {
    "headline": "Kwara Approves 4 Promotion Arrears For Teachers",
    "summarized_story": "Kwara State Governor AbdulRahaman AbdulRazaq has approved four promotion arrears for teaching and non-teaching staff of secondary schools in the state.\nConsequently, Kwara State Teaching Service Commission (TESCOM) has fixed dates for the conduct of examinations and interviews for its teaching and non-teaching staff due for promotion for years 2018, 2019, 2020 and 2021.\nThe executive chairman of the Commission, Malam Bello Abubakar, disclosed that the dates for the promotion examinations and interview were sequel to the approval of the conduct of the promotion exercise by Governor AbdulRazaq.\nHe added that officers on GL07-10 and GL14-16 in schools located in Kwara South and Kwara North will have their promotion interview on Saturday 18th June, 2022 TESCOM headquarters in Ilorin.\nOfficers on grade levels 10-14 from schools located in Kwara Central will have their interview scheduled for Tuesday, 28th June, 2022, at the same venue, among others."
  },
  {
    "headline": "Kwara Approves 4 Promotion Arrears For Teachers",
    "summarized_story": "Kwara State Governor AbdulRahaman AbdulRazaq has approved four promotion arrears for teaching and non-teaching staff of secondary schools in the state.\nConsequently, Kwara State Teaching Service Commission (TESCOM) has fixed dates for the conduct of examinations and interviews for its teaching and non-teaching staff due for promotion for years 2018, 2019, 2020 and 2021.\nThe executive chairman of the Commission, Malam Bello Abubakar, disclosed that the dates for the promotion examinations and interview were sequel to the approval of the conduct of the promotion exercise by Governor AbdulRazaq.\nHe added that officers on GL07-10 and GL14-16 in schools located in Kwara South and Kwara North will have their promotion interview on Saturday 18th June, 2022 TESCOM headquarters in Ilorin.\nOfficers on grade levels 10-14 from schools located in Kwara Central will have their interview scheduled for Tuesday, 28th June, 2022, at the same venue, among others."
  },
  {
    "headline": "47 Boko Haram Terrorists, 2 Civilian JTF Killed In Crossfire",
    "summarized_story": "Troops of Operation Hadin Kai (OPHK) in conjunction with the Civilian Joint Task Force have killed 47 terrorists including top commanders of the Jamā’at Ahl as-Sunnah lid-Da’wah wa’l-Jihād, Boko Haram faction.\nADVERTISEMENTAccording to impeccable sources, two members of the Civilian Joint Task Force were killed during the encounter.\nThe troops destroyed over 700 makeshift houses and shelters of the terrorists and recovered several motorcycles and weapons from them.\nThe sources explained that the unrelenting troops pursuit them to their hideouts and apprehended two other Terrorists alive.\nThe terrorists from this camp had coordinated many attacks in Banki, Konduga, and Maiduguri to Monguno road."
  },
  {
    "headline": "47 Boko Haram Terrorists, 2 Civilian JTF Killed In Crossfire",
    "summarized_story": "Troops of Operation Hadin Kai (OPHK) in conjunction with the Civilian Joint Task Force have killed 47 terrorists including top commanders of the Jamā’at Ahl as-Sunnah lid-Da’wah wa’l-Jihād, Boko Haram faction.\nADVERTISEMENTAccording to impeccable sources, two members of the Civilian Joint Task Force were killed during the encounter.\nThe troops destroyed over 700 makeshift houses and shelters of the terrorists and recovered several motorcycles and weapons from them.\nThe sources explained that the unrelenting troops pursuit them to their hideouts and apprehended two other Terrorists alive.\nThe terrorists from this camp had coordinated many attacks in Banki, Konduga, and Maiduguri to Monguno road."
  },
  {
    "headline": "I Will Make Nigeria Work For Everyone As President, Says Kachikwu",
    "summarized_story": "“As the president of Nigeria, you will have a country that works for everyone.\nAs history beckons on us, we must accept the call and work towards a great Nigeria,” he said.\nThe media must therefore rise to change this negative narration.”He said, “I am running a rescue mission race.\nTell the people that there is a change agent and a tiger in the presidential race, who can and will make things happen.\nBefore the primaries, I engaged the delegates and told them what I will do for Nigeria as the country’s president."
  },
  {
    "headline": "Mbaka drops bombshell: Peter Obi is a stingy man, he won't be Nigeria's President",
    "summarized_story": "Ejike Mbaka has dropped a bombshell, saying Dr. Peter Obi is a stingy man and cannot be Nigeria’s President.\nMbaka said Obi was a man without a generous spirit, adding that “a gum-holder would not be accepted a Nigerian leader”.\n“Peter Obi has a mouthful, he has nowhere to go unless he kneels down on the Adoration altar.” Mbaka said in a report by BBC Igbo Services.\nHe added that Obi had had insulted the Holy Spirit, saying that he helped Obi to become governor in Anambra and that he never returned to thank God.\n“If Igbo people are looking for a representative in Nigeria, they are not the kind of person Peter Obi is."
  },
  {
    "headline": "Kogi: Residents of Kabba-Bunu LGA fast, pray over insecurity today",
    "summarized_story": "By Thompson YamputThe people of Kabba-Bunu Local Government of Kogi will on Thursday embarked on fasting and prayers to seek God’s intervention over recent security breaches in the area.\nMr Moses Olorunleke, Chairman, Kabba-Bunu Local Government of Kogi, declared the fasting and prayers following two recent deadly explosions in the area area.\nIn a statement issued on Wednesday in Kabba, the chairman said that the Obaro of Kabba, Oba Solomon Dele-Owoniyi, had approved the declaration.\nAccording to the chairman, all shops and offices are to remain closed throughout the day for the fasting and prayers.\nHe said that the fasting and prayers became imperative in view of the insecurity in the area in recent times."
  },
  {
    "headline": "Reactions trail allegation Peter Obi’s 3-day Egypt trip not to understudy power, education",
    "summarized_story": "Peter Obi tweeted yesterday, “I just departed for Egypt on a 3-day visit as part of my detailed study of comparable countries to Nigeria.\nIn Egypt, I am expected to understudy, among others, the Egyptian Power Sector, Education, Planning and Finance Sectors.\n–PO.”Countering his tweet today, Jackson Ude @jacksonpbn tweeted, “BUSTED: Peter Obi is attending the Annual General Meeting, AGM of Afreximbank in Cairo, Egypt and not to understudy Egypt’s Education, Power and Finance Sector.\nAFEXIMBANK has contributed immensely in several developmental project in Egypt’s power sector, they’ve also invested in SE region of Nigeria.\nThe theme of the AGM is “Realising the AfCFTA Potential in the post COVID-19 Era—Leveraging the power of the youth.”"
  },
  {
    "headline": "Atiku’s running mate: South East in final push, as PDP moves to screen Wike, others",
    "summarized_story": "In a last-ditch effort to push for a Vice Presidential candidate from the South East, some supporters of the Peoples Democratic Party, have begun a subtle campaign to sway the party’s presidential candidate, Atiku Abubakar, to pick a South easterner.\nNews Direct gathered in Abuja, on Wednesday, that the Sen. Iyiochia Ayu-led PDP National Working Committee, approved the recommendations of its panel saddled with the responsibility of assisting the party’s candidate to choose a running mate.\nYes, he reached out to the party to make recommendations but the final decision is his to make.”In a related development, PDP NWC on Wednesday set up a panel to screen nominees for the Vice Presidential slot.\nThis was contained in a statement signed by the PDP National Publicity Secretary Debo Ologunagba.\nHe said the NWC set up the panel pursuant to part V1, paragraph 14 of the Electoral Guidelines of the Party."
  },
  {
    "headline": "I’ll contest president again, says Yahaya Bello",
    "summarized_story": "The Kogi State Governor and presidential aspirant in the just concluded presidential primary of the All Progressives Congress, Yahaya Bello, Wednesday, said he would run for the top office in a subsequent election.\nThis was as he noted that his shot at the 2023 presidency was only “testing the microphone.”Bello, who garnered 47 votes in last week’s elections disclosed this to the State House Correspondents shortly after meeting the President, Major General Muhammadu Buhari (retd.).\nAccording to him, he came to see the president on a thank-you visit for letting him participate in the highly contested exercise.\nHe said the Muslim-Muslim or Christian-Christian ticket, the major consideration for selection should be deliverability.\nTo his supporters, Bello appealed for continued assurance in his presidential bid saying “sometimes you win some and sometimes you lose.”He urged them to support the current flag bearer in next year’s elections."
  },
  {
    "headline": "Oyo State Lawmakers Start Impeachment Process Against Deputy Governor, Olaniyan",
    "summarized_story": "The Oyo State House of Assembly has commenced the process to impeach the deputy governor of the state, Mr Rauf Olaniyan.\nHence, The Speaker instructed the Clerk of the House, Mrs Yetunde Awe to write the deputy governor mandating him to respond to the allegations within seven days.\nThe impeachment process followed the recent defection of the state deputy governor from the Peoples Democratic Party (PDP) to the All Progressives Congress (APC).\nIn 2021, News Direct had reported that Oyo State would soon be embroiled in legal turmoil as a plot to impeach Olaniyan had been hatched.\nMakinde and Olaniyan have been at loggerheads shortly after their election in 2019, with supporters of Olaniyan accusing Makinde of relegating his deputy governor to the background."
  },
  {
    "headline": "Nigerian Army set to begin screening of new intake, announces date *See link to check",
    "summarized_story": "The Nigerian Army has disclosed the dates for the recruitment screening exercise for applicants of the 83 Regular Intake 2022 for Non-Tradesmen and Women.\n“The Nigerian Army wishes to inform the general public & all applicants that applied for 83 Regular Recruits Intake 2022 for Non-Tradesmen & Women to visit the Nigerian Army Recruitment Portal https://recruitment.army.mil.ng to check the list of shortlisted candidates.\n“The state recruitment screening exercise is scheduled to commence from 28 June – 11 July 2022 in all the 36 states and Federal Capital Territory Abuja.\n“A high standard of discipline is expected from all candidates.\nCandidates who violate any instruction during the Recruitment Screening Exercise would be disqualified,” the tweet stated."
  },
  {
    "headline": "FirstBank: Supporting the oil and gas financing for efficiency",
    "summarized_story": "AMAKA IFEAKANDU looks at efforts by the First Bank of Nigeria efforts to the nation’s oil and gas sector financing.\nThe Nigerian economy is largely dependent on its oil sector for supplies of about 93 percent of its foreign exchange earnings.\nSupport for the oil & gas financingDespite all the challenges in the sector, FirstBank has been at the forefront of assisting indigenous firms to take full advantage of the opportunities in the oil and gas industry in line with the Nigerian Local Content Act, by providing requisite financing.\nOn the First Bank oil and gas finance product Adeduntan said, accelerating development needs infrastructure finance, adding that attracting long-term investment to the oil and gas sector needs establishment of appropriate regulatory environment.\nAccording to him, First Bank’s oil industry contract finance product was designed to meet the funding requirements of indigenous oil and gas companies who were either customers or prospects of the bank."
  },
  {
    "headline": "Extend continuous voter registration by 60 days, Reps tell INEC",
    "summarized_story": "The House of Representatives has urged the Independent National Electoral Commission (INEC), to extend the ongoing Continuous Voter Registration (CVR) by a minimum of 60 days.\nThe resolution came following concerns expressed by spokesman of the House, Hon.\nMembers who spoke on the matter also urged INEC to deploy additional staff and Voters Registration Machines across the country in order to capture qualified Nigerians who were yet to be registered.\n“The House is concerned about reports of shortages of voter registration machines, inadequate manpower and personnel at registration centres which may lead to frustrations among prospective registrants and in some cases, unrest at some registration centres”, he observed.\nHe further buttressed his demand on the calls from concerned Citizens and Civil Societies urging, INEC to extend the voters’ registration deadline to accommodate eligible voters desiring to register for their Permanent Voters Cards."
  },
  {
    "headline": "NIHOTOUR, Chinese, Spanish, Ethiopian embassies, others, partner to host 2022 Sustainable Gastronomy Day",
    "summarized_story": "By Palma IleyeNational Institute for Hospitality and Tourism, NIHOTOUR, has concluded arrangements for the hosting of the 2022 World Sustainable Gastronomy Day on Saturday, 18th June 2022 at the International Conference Centre, Abuja.\nRevealing highlights of the event in his office, Nura Sani Kangiwa, Director General and Chief Executive Officer of NIHOTOUR said the event will feature exhibition of indigenous cuisines by exhibitors prominent among which are, the National Institute for Hospitality and Tourism, NIHOTOUR, that will be showcasing indigenous Nigerian cuisines from the six-geopolitical zones of the country.\n“To bring greater benefits of this year’s celebration to youths undergoing training and Course Programs in Tourism, Catering and Hospitality related fields.\n“Cooking and Essay Writing Competitions were embedded, organized and conducted by NIHOTOUR in the build-up to the celebration day with winners, who have already emerged, to be awarded with certificates and other forms of prizes on the D-Day.\n“Gastronomy is a cultural expression of nations through their food choices, sources of ingredients and types of cuisines which thrives in culturally rich destinations,” he added."
  },
  {
    "headline": "First Bank secures $150 mln facility from African Export-Import Bank",
    "summarized_story": "Kehinde Ibrahim, LagosFIRST Bank of Nigeria Ltd., has secured $150 million facility from African Export-Import Bank (Afreximbank) under it’s Pandemic Trade Impact Mitigation Facility (PATIMFA).\nGroup Head, Marketing and Corporate Communications, FirstBank, Folake Ani-Mumuney, said this in a statement on Monday in Lagos.\n“As a bank that has been woven into the fabric of our society for over 128 years.\nIt will also be accessible to organisations with initiatives to rehabilitate hospitals and strengthen diagnostic and testing capacity.\nIt added that the proceeds of the facility would help beneficiary businesses manage the impacts of the Ukraine crisis."
  },
  {
    "headline": "Dana Air partners FAAN National Aviation Conference",
    "summarized_story": "Naomi DouglasFederal Airports Authority of Nigeria on the maiden edition of the FAAN National Aviation Conference FNAC scheduled to hold from 14th to 17th of June, at the international conference center Abuja.\nAs a partner of the conference with the theme : Advancing the frontiers of Possibilities for Safe, Secure, and Profitable Air Transport, Dana Air is providing discounted air fares to the organisers, participants, delegates and partners to the conference.\nOnly 10,541 firms have pension, insurance cover for workers –PenComBy Kehinde Ibrahim, LagosONLY 10,541 firms have complied with the country’s statutory laws on compliance with pension and insurance covers and have been cleared to do business with the government.\nIt stated that, “The commission received 11,200 applications from private sector organisations for the issuance of Pension Clearance Certificates.\nAs a result, the regulatory agency said the commission had issued annual Pension Clearance Certificates to eligible organisations."
  },
  {
    "headline": "ABCON seeks CBN, BDCs collaboration to support naira",
    "summarized_story": "Onu OkorieThe Association of Bureaux De Change Operators of Nigeria (ABCON) and the Central Bank of Nigeria (CBN) need to collaborate to achieve exchange rate stability, ABCON President, Aminu Gwadabe has said.\nGwadabe has therefore called for collaboration between the BDCs and the CBN in the implementation of market-friendly policies that will make the BDCs impact more positively in the market and promoting exchange rate stability in the economy.\nHe therefore called for the reintegration of the BDCs into the forex market ecosystem to sustain their roles in the economy.\nGwadabe said the BDCs have for years remained effective and creative in contributing to the forex market.\nHe said ABCON digitized BDCs operations with the official launch and take off of the ABCON Live Run Automation Portal in Lagos, which has the backing of the CBN."
  },
  {
    "headline": "NAICOM, NCDMB release guidelines on submission of insurance programme in oil & gas industry",
    "summarized_story": "Kehinde Ibrahim, LagosTHE National Insurance Commission (NAICOM) in partnership with the Nigerian Content Development and Monitoring Board (NCDMB) has jointly released the guidelines on the submission of insurance programme by operators, project promoters, alliance partners, and Nigerian indigenous companies in the Nigerian oil and gas industry.\nThis is in compliance with Sections 49 and 50 of the Nigerian Oil and Gas Industry Content Development (NOGICD) Act 2010 in relation to insurance transactions.\nThe guidelines for the oil & gas insurance business was issued in 2010 which stipulate the roles and responsibilities of insurance institutions in ensuring compliance with local content law.\nThis was done with the primary consideration of ensuring that available In-Country Insurance Capacity is fully filled before any foreign consideration.\nIn his speech, the Executive Secretary, NCDMB, Engr Simbi Kesiye Wabote, said the release of the Guidelines addresses loopholes that have been identified by the Board in implementing the provisions of the NOGICD Act, particularly sections 49 and 50."
  },
  {
    "headline": "Ekiti Guber Candidates Sign Peace Accord Ahead Of Poll",
    "summarized_story": "Candidates in the Ekiti State governorship election on Wednesday signed a Peace Accord ahead of the poll billed for Saturday.\nelection in November 2021, political parties & candidates have signed the Peace Accord under the auspices of the National Peace Committee,” he said in a statement.\n“The intervention of the Peace Committee no doubt contributed in no small way to the peaceful conduct of previous Governorship elections.\n“The truth is that the Peace Accord is not an automated, self-actualising process.\n“The success of the Peace Accord rests on three pedestals: the political actors, INEC, and security agencies."
  },
  {
    "headline": "Electoral Act: Reps Consider Overriding President Buhari On Statutory Delegates",
    "summarized_story": "The House of Representatives is likely to commence the process of overriding President Muhammadu Buhari on the amended Electoral Act.\nA member of the House, Ben Ipkapa, had asked the lawmakers to gather signatures and override the President on the amendment made to the Electoral Act.\nStatutory delegates include the President, Vice President, members of the National Assembly, governors and their deputies, members of the State Houses of Assembly, chairmen of councils, councillors, and national working committee of political parties, amongst others.\nAccording to the Constitution, the President has 30 days to decide whether to sign or withhold assent to a bill passed by the National Assembly.\nBesides the debate over statutory delegates, Gbajabiamila had questioned the primaries of political parties held across the country when the House resumed plenary on Tuesday."
  },
  {
    "headline": "Police Burst Baby Factory In Anambra, Rescue 35 Girls",
    "summarized_story": "Police operatives in Anambra have rescued 35 girls from a baby factory in the Nkpor area of the southeast state.\nA statement by the spokesman of the Anambra Police Command Ikenga Tochukwu said the girls were rescued during a raid in a hotel.\n“The operatives rescued, 35 girls and four of them are pregnant.\nThe police also arrested three persons namely: Mrs Ifeoma Uzo age ‘F’ 35yrs, Chidiebere Alaka ‘M’ 28years, and Nweke Chidiebere.\nWe recovered three pump action guns, seven cartridges, and a cash sum of Eight hundred and seventy-seven thousand, five hundred naira (#877,500)."
  },
  {
    "headline": "Without Muslim-Muslim Presidential Ticket, APC May Not Win In 2023, Says Orji Kalu",
    "summarized_story": "The Chief Whip of the Senate, Senator Orji Kalu, has proposed a Muslim-Muslim ticket as a critical factor for the All Progressives Congress (APC) to win the presidential election in 2023.\nREAD ALSO: Choice Of Running Mate Lies With Tinubu, Not APC Governors – Uzodimma“If we don’t play Muslim-Muslim (ticket), we are in trouble,” he stated.\n“It will be difficult to win the election because the only thing left for Ahmed Tinubu today is to play Muslim-Muslim.\nThe lawmaker stressed that there was nothing wrong if the APC decides to field a Muslim-Muslim ticket for the election.\nHe argued that it was impossible for a southern minority Muslim and a northern minority Christian to win a presidential election in Nigeria."
  },
  {
    "headline": "Ignore Manipulated Video, I Will Never Leave PDP – Wike",
    "summarized_story": "Governor Nyesom Wike of Rivers State has urged Nigerians to ignore the ‘manipulated video’ suggesting that he is on his way out of the Peoples Democratic Party (PDP).\n“The intent of the video being circulated is to mislead the unsuspecting public, particularly members of the PDP,” the governor explained.\nHe urged the public to disregard the manipulated video.\nThe governor again urged the public to ignore the distorted video, adding that those behind it are desperately wicked and intend to mislead the public.\nWike assured all Nigerians that he remains a faithful, committed member of the PDP and will never leave it for ‘cancerous’ APC."
  },
  {
    "headline": "Oyo Assembly files impeachment notice against Deputy Governor -",
    "summarized_story": "The Oyo State House Assembly has filed an impeachment notice against the Deputy Governor of Oyo State, Rauf Olaniyan.\nTVC News gathered that the process may be concluded at their next sitting which may result in the impeachment of the deputy governor.\nThe Oyo state Deputy Governor had few weeks ago defected from the Peoples’Democratic Party to the All Progressives CongressThe petition reads,PETITION AND NOTICE OF ALLEGATION OF THE DEPUTY GOVERNOR OF OYO STATE, HIS EXCELLENCY ENGINEER RAUF OLANIYANRT.HON.\nSPEAKER SIR,Consequent upon listed below, we the under listed elected Honourable members of the 9th assembly hereby allege the Deputy Governor of Oyo State, His Excellency Eng.\nThere has been no love lost between the Governor Seyi Makinde and his Deputy Engineer Rauf Aderemi Olaniyan since the electiobn that brought the duo in as Governor and Deputy in 2019 with rumours of Impeachment moves against the deputy Governor by loyalists of the Governor rife especially during the lockdown ocassioned by the Covid-19 Pandemic."
  },
  {
    "headline": "House Moves to override President on Section (4) of Electoral Act -",
    "summarized_story": "The House of Representatives has commnced moves to override President Muhammadu Buhari on the amended Section 84 (4) of the Electoral Act on statutory delegates.\nHe rises to express his heartfelt sadness over the developmentAlso rising on a point of order, Delta State lawmaker, Ben Igbakpa, says the 30-day window for the President to sign the latest amendment to the Electoral Act has lapsed.\nIt will be recalled that the President, Muhammadu Buhari, had refused assent to an amended version of the Electoral Act a few days to the Start of Party Primaries.\nDespite pressure and against the e3xpectation of many, the President refused assent.\nThe primaries at all levels by political parties led to the loss of so many heavyweights especially within the National Assembly."
  },
  {
    "headline": "Abducted Kwara Bishop, wife, driver regain freedom",
    "summarized_story": "Oyo state Police Command has confirmed the release of the abducted Bishop of Jebba Anglican Diocese, Bishop Rev.\nAderogba Adeyinka who was allegedly abducted with his wife and his driver while traveling along the New Oyo/Ogbomosho Expressway.\nA press statement issued by the Oyo state Police command Spokesperson, Wale Osifeso revealed that the Cleric regained freedom alongside his wife and his driver.\nAccording to him, the Abducted Bishop Rt.\nRev Aderogba Adeyinka of Jebba Anglican Diocese regained his freedom unhurt alongside his wife and driver around 1820HRS today, Tuesday 14/06/2022."
  },
  {
    "headline": "INEC extends PVC collection in Ekiti, deploys four national commissioners, 8 RECs -",
    "summarized_story": "The Independent National Electoral Commission has extended Collection of Permanent Voters Card to Thursday 16th of June in Ekiti to enable residents meet up with the Gubernatorial Election Slated for Saturday 18th of June.\nINEC Chairman, Mahmood Yakubu Made this declaration at the Stakeholders Meeting with all Candidates of Political Parties held in Ado Ekiti, Ekiti State.\nHe also Disclosed that Four National Commissioners, Eight Resident Electoral Commissioners have been redeployed to ensure a hitch-free Process as Sensitive Materials will arrive Ekiti later TodaySpeaking at the meeting, the Inspector General of Police, Usman Alkali Baba Says Arrangements has been Put in place to Mitigate Distress before, during and after the election as 17,317 Police Personnel has been deployed for the ExerciseHe warned Political thugs to steer clear of the Polling units as no one is allowed to roam from one Polling unit to another except accredited Personnel.\nHe revealed that the Presence of Security operatives is not meant to intimidate voters but to ensure a seamless ProcessPresent at the meeting are Candidates of 12 out of the 18 Political Parties which includes APC, PDP and SDP."
  },
  {
    "headline": "I’ll Never Leave PDP, Rivers Governor Wike Insists as Manipulated Video Goes Viral",
    "summarized_story": "Reacting to this in a statement by his Special Assistant Media, Kelvin Ebiri, Governor Wike insisted that he would never abandoned his party over circumstances.\n“Our attention has been drawn to a manipulated video circulating on Social Media, purporting that the Governor of Rivers State, Nyesom Ezenwo Wike intends to defect from the Peoples Democratic Party (PDP).\n“It will be recalled that in June 2021, Governor Wike was interviewed on ARISE Television, following the defection of Ebonyi State governor, Dave Umahi from the PDP to the All Progressives Congress.\n“During the interview, Governor Wike while reacting to reasons given by Ebonyi State governor for his defection, dismissed it as untenable.\nGovernor Wike remains a faithful, committed member of the PDP and will never leave it for cancerous APC.”"
  },
  {
    "headline": "Nigeria ‘Studying’ UK Court Judgement That Cleared JP Morgan of Fraud in Malabu Oil Deal",
    "summarized_story": "Nigeria’s Federal Government Wednesday reacted to the United Kingdom commercial court judgement that ruled that there is no evidence of fraud in the OPL 245 transaction between Nigeria and JP Morgan Chase Bank saying it was studying the judgement.\nAn Italian court in 2021 also dismissed all corruption charges in the OPL 245 deal, discharging and acquitting all the defendants.\nThe Nigerian government in the judgement lost $1.7 billion claims against JP Morgan Chase Bank over the transfer of proceeds from the sale of OPL 245 in 2011.\nCommenting on the Court judgement, Mohammed said: “The last question is about Malabu Oil.\nMalabu oil and I think strangely enough, the judge said we were not able to establish that we lost $1.7 billion."
  },
  {
    "headline": "University Lecturers’ Strike More Complicated Than Nigerians Think, Says FG",
    "summarized_story": "ASUU had embarked on strike on 14th February, over unresolved issues with the federal government and since then, all the public universities have been shut down.\nAccording to him, government was worried over the long closure of the public universities and was making frantic efforts to ensure that all the contentious issues are resolved.\n“And I think probably the Minister of Education will be better positioned to give the details.\nI think if I remember this e-learning, I think has to do more with primary schools and not universities.\n“And I don’t think because we’re having challenges with the university lectures, we should stop primary school students in continuing with their education”."
  },
  {
    "headline": "Saudi Arabia to Launch Giant Investment Initiative in Africa",
    "summarized_story": "The Kingdom of Saudi Arabia has said that it was prepared to launch giant investment initiatives in Nigeria and many other African countries.\nThe initiative is part of the $1 billion development investment package pledged during the Paris Conference 2021.\nAbdul-Aziz Kattan who was received by the president of the ECOWAS Commission, Jean Claude Kassi-Brou, said his country’s area of interest include education.\nOn the other hand, the Kingdom’s positions assure the importance of development in the African continent, according to the United Nations General Assembly Resolution No.\nHe noted that of particular interest is the help the region will be receiving from Saudi Arabia in the fight against terrorism which is fast becoming a major challenge in the area."
  },
  {
    "headline": "Nigeria Police to Have a State-of-the-Art Evidence Storage Facility Soon",
    "summarized_story": "The statement said: “The initial focus of this project is on Federal Capital Territory and four states in the Northeast region, but it will soon also be extended to additional states in the North West and North Central regions.\n“The project is being delivered by both Nigerian and international experts from UNODC, the UN’s lead agency on supporting law enforcement activity.\nThe goal is to strengthen police efforts to apprehend terrorists, kidnappers, and other violent criminals, and ultimately to secure convictions within a rule of law framework.\nIn addition to refurbishing several NPF evidence storage facilities, the project team will also work with Nigerian police investigators and crime scene specialists to build their capacity to collect and analyze evidence such as fingerprints, tool marks, digital data, ballistics, and biological material.”In her remarks at the occasion, United States Ambassador to the Federal Republic of Nigeria, Mary Beth Leonard highlighted the importance of successfully prosecuting serious criminal offences, noting: “Evidence is key to the success of any investigation; Improper handling of evidence can have detrimental effects on establishing rule of law.\nThe statement said: “UNODC’s Strategic Vision for Nigeria takes our partnership with the government of Nigeria to a new level in our shared mission to tackle crime, drugs, terrorism and corruption and their effects on the economy, environment, and people.”Michael Olugbode in Abuja"
  }
]