[
  {
    "headline": "Only female gov can deliver Abia, aspirant says",
    "summarized_story": "The first Abia female governorship candidate from the Youth Party, Chief Oluchi Ogwo, has emerged with a strong conviction that only a female governor will deliver the state from bad governance.\nShe added, “I will go, I will do it.\nIt is time for men to stand down for a woman like me and should work with me to move the state forward.”“Abia is tired of men.\nA chance must be given for a woman to rule Abia State.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "Russia-Ukraine war: Nine latest updates as Russia bans entry to Japan’s PM, officials",
    "summarized_story": "Russia said Wednesday it has banned entry to several dozen Japanese officials, including Prime Minister Fumio Kishida, after Tokyo joined international sanctions against Moscow over its military campaign in Ukraine.\nHere are other latest developments in the war in Ukraine:– New EU sanctions, oil ban take shape –EU chief Ursula von der Leyen says the bloc will impose a gradual Russian oil ban, as part of new sanctions to punish Russia for invading Ukraine.\nIn a document seen by AFP, von der Leyen’s proposal asks that Hungary and Slovakia, both hugely dependent on Russian oil, be given more time to meet the ban.\nAzov rose to prominence in 2014, when its far-right activists took up arms to fight pro-Russian separatists in Ukraine’s eastern Donbas region, but have since fallen under the command of Ukraine’s military.\n– EU to support Moldova –European Council President Charles Michel pledges to increase EU military aid to Moldova, Ukraine’s neighbour that has seen a series of attacks in a pro-Moscow separatist region."
  },
  {
    "headline": "BREAKING: Fayemi officially declares for presidency",
    "summarized_story": "Governor Kayode Fayemi of Ekiti State has formally declared his intention to contest for president in 2023 on the platform of the ruling All Progressives Congress.\nHe made the declaration on Wednesday in Abuja.\nFayemi promised to ensure youth empowerment when he becomes the president.\nHe also pledged to “retool the Armed Forces and security agencies”.\nHe also promised decentralisation for the government to be brought closer to the people."
  },
  {
    "headline": "I’ve not yet donated vehicle to any APC delegate, says Malami",
    "summarized_story": "The Attorney-General of the Federation and Minister of Justice, Mr Abubakar Malami, has refuted the allegation of distributing expensive vehicles to officials of the All Progressives Congress (APC) in Kebbi.\nMalami explained that it was his friends and associates who donated and distributed vehicles to long-term workers in the Khadimiyya Foundation.\n“None of the APC stakeholders or delegates in Kebbi State was given any vehicle by me, and I have not yet donated any vehicle to any delegate.\n“The mischief-makers can contact the National Secretariat of the APC, get the lists of all the APC stakeholders and delegates in Kebbi State.\n“There is no connection between the names of APC stakeholders and the beneficiaries of the vehicles and are not connected whatsoever,” the minister pointed out."
  },
  {
    "headline": "Twitter banters, Instagram gist, Gov Uzodimma interacts with Social Media users, thrilled by suggestions, opinions",
    "summarized_story": "By Idowu BankoleHope Uzodimma, Governor of Imo state, has spent the holiday interacting with social media users, especially those from Imo state.\n“My DM on all the platforms were filled with messages and I was elated reading directly, pure expressions from Imolites and well-wishers.\nThese are expressions of genuine concerns by patriotic citizens and I shall continue to entertain as much that comes through.\n“Rest assured that I am appreciative of your continued support and the desire of an Imo State we will truly be proud of.\n“Having digested your opinions and suggestions, I shall process applicable ones for integration into our series of programs and policies geared towards a greater Imo State."
  },
  {
    "headline": "CBN approves N2bn for artisans in Imo",
    "summarized_story": "By Chinonso Alozie, OwerriThe Central Bank of Nigeria, CBN, has approved the sum of N2 billion to the Imo State government for the empowerment of artisans in the state.\nThe Commissioner for Labour and Productivity, Ford Ozumba, disclosed this to newsmen on Tuesday in Owerri, while announcing the Imo 2022 Entrepreneurial Product Expo in partnership with CBN.\nHe said the Imo State government approached the CBN and was considered qualified to get the approval for the CBN loan.\n“The money is in partnership with CBN, the CBN has approved N2billion for Imo State.\nThe artisans have associations we are working with So, as part of the activities for this project, we have a project starting on the 10th of May 2022, a weekly event, the first Imo State innovation and entrepreneurial exhibition in Owerri."
  },
  {
    "headline": "Boko Haram kills 9 villagers in Chibok attack, destroy houses",
    "summarized_story": "File imageBy Ndahi Marama, MaiduguriSuspected members of Boko Haram terrorists have killed eight villagers in Kautikari village with another one woman (Names withheld) killed near Kwada village in Chibok Local Government Area of Borno state.\nVanguard learnt that the armed insurgents invaded Kautikari village which is about 13km drive from Chibok Council/Headquarters and started shooting sporadically, setting ablaze residential houses, after looting foodstuff and livestock.\nRecalled that early this year, Kautikari village which shares border with Sambisa Forest was attacked, living seven people dead, after setting ablaze a local church and residential buildings without confrontation.\nHe said, eight dead bodies were recovered in Kautikari as at Wednesday morning, while the other one dead body of an old woman recovered in Kwada nearby village.\nAlthough, he couldn’t ascertain the number of those who sustained injuries in the attack, Ndirmbita said, many people sustained various degree of injuries during the attack."
  },
  {
    "headline": "60, 000 people killed in northern Nigeria due to insecurity, – CDD",
    "summarized_story": "In the South-South region of the country, sea piracy and robbery remained key concerns as illegal bunkering, political violence, herders/farmer clashes, oil spill, cultism, marginalisation, human trafficking, ritual killing are said to be fueling violence and insecurity.\nIn 2019 the figure stood at 114; 110 in 2020 and; settled at 647 in 2021.\nTo address the prevailing situation, CDD said local, and national stakeholders would need to be willing to try new approaches to curtailing insecurity, stressing that the kinetic approaches favoured by the federal government may remain a mirage.\n“Peace building interventions are urgently needed in most if not all geopolitical zones to improve community cohesion in conflict-affected areas,” the report stated.\n“Similarly, the relationship between narcotics production, consumption, and trafficking on the one hand and insecurity on the other remains largely subject to speculation."
  },
  {
    "headline": "NCC Issues final letters of licence awards to 5G spectrum winners",
    "summarized_story": "The Nigerian Communications Commission (NCC) has confirmed the issuance of the final letters of award of the Fifth Generation (5G) Spectrum Licences to MTN and Mafab Communications, winners of the 3.5GHz spectrum auction conducted by the Commission on Monday, December 13, 2021.\nIn line with the terms and conditions of the 5G license, the licensees are expected to commence rolling out 5G services effective from August 24, 2022.\nThe 5G network, when deployed, will bring a lot of benefits and opportunities that will engender accelerated growth and smart living in the country.\nThe technology is also expected to bring substantial network improvements, including higher connection speed, mobility and capacity, as well as low-latency capabilities.\nSubsequently, the Commission, on February 24, 2022, confirmed the full payment of $273.6 million each by the two spectrum winners, in addition to the spectrum assignment fee paid by MTN, for the 5G spectrum licence."
  },
  {
    "headline": "Kwara FRSC gets new sector Commander, Fredrick Ade Ogidan",
    "summarized_story": "Fredrick Ade Ogidan, has assumed duty as the new Sector Commander of the Federal Road Safety Commission, FRSC, in Kwara State.\nThis followed the promotion and subsequent posting of the former Sector Commander, Jonathan Owoade, to Zone 6, Port Harcourt, Rivers State.\nUntil his new appointment, Fredrick Ogidan, was the Kaduna state Sector’s Head of Operations.\nAt his maiden meeting with staff of the Kwara Sector, Fredrick promised to work with the entire staff in creating a safe motoring environment in the state.\nSimilarly, he will soon embark on familiarisation visits to sister agencies and critical stakeholders after the Eidel-Fitr celebrations, according to a statement by the Chief Route Commander, Special Patrol Operations, Dapo James, in Ilorin on Wednesday."
  },
  {
    "headline": "2023 presidency: Ndume gives reason northerners should support southerners to produce Buhari’s successor",
    "summarized_story": "Ndume said if the President comes from the southern region of Nigeria, the northerners will benefit more, citing an example during former President Goodluck Jonathan’s administration.\nNdume said, “Personally, I feel we will be better off with the President coming from the South.\n“The current President comes from the North and if you look at it analytically, the South benefitted more.\n“If the President comes from the South, we’ll benefit more – just as we did previously during (former President Goodluck) Jonathan’s (administration).\n“It pays the South when there is a northern President.”"
  },
  {
    "headline": "War: Don’t transform yourself to Putin’s altar boy – Pope Francis warns pro-war Russian patriarch",
    "summarized_story": "His Holiness, Pope Francis, has warned Patriarch Kirill, the leader of the Russian Orthodox Church, not to transform himself to be Russian President Vladimir Putin’s altar boy amid the ongoing war between Russia and Ukraine.\nThe Pope also slammed Kirill for endorsing Russia’s stated reasons for invading Ukraine.\n“I spoke to him [Patriarch Kirill] for 40 minutes via Zoom,” the Pope told Italian daily Corriere della Sera.\n“The Patriarch cannot transform himself into Putin’s altar boy,” he said.\nBoth Russia and Ukraine have been fighting for over two months and many casualties have already been recorded as of today."
  },
  {
    "headline": "Insecurity: Youths demand Southern Kaduna Development Commission",
    "summarized_story": "The Southern Kaduna Peoples Union (SOKAPU) youth wing, has urged President Muhammadu Buhari to establish a Southern Kaduna Development Commission, SKDC, in the State.\nThe state youth wing asked Buharito reconstruct about two hundred (200) communities, including schools, hospitals, and markets destroyed by killer herdsmen.\nComrade John Isaac, the National Youth Leader of SOKAPU, said this in a statement made available to DAILY POST.\n“Therefore, a Southern Kaduna Development Commission is of paramount importance and should be supported by every well-meaning and peace-loving Nigerian.\n“We also want to categorically emphasise that more needs to be done in the areas of rehabilitation and reconstruction of sacked communities in Southern Kaduna as the people are passing through untold hardship.”"
  },
  {
    "headline": "I’m the aspirant to beat in Ogun West, says Akinlade",
    "summarized_story": "I’m the aspirant to beat in Ogun West, says AkinladeFormer House of Representatives member Abiodun Akinlade yesterday described himself as the senatorial aspirant to beat in Ogun West District.\nThe All Progressives Congress (APC) chieftain called for an issue-based campaign, instead of focusing on the financial muscles of contenders.\nAkinlade said: “When I was in the House of Representatives, I discovered that my people in Ogun West lacked many amenities.\nExuding confidence, Akinlade said he was ready for any form of primary, whether consensus, direct or indirect mode.\nWe are not poor in Ogun West."
  },
  {
    "headline": "Ogun PDP members protest imposition of delegates",
    "summarized_story": "Members of the Ogun State chapter of the Peoples Democratic Party (PDP) yesterday protested alleged imposition of ward ad-hoc delegates by the state Executive Committee (Exco) of the party.\nThe protesters, who carried placards, besieged the party’s secretariat located at Magbon, Abeokuta stretch of the IBB Presidential Boulevard, chanting protest songs to buttress their arguments against the party’s governorship hopeful, Ladi Adebutu and some executive leaders.\nSome of the inscriptions on their placards read: “Iyochia Ayu, Save Ogun PDP from autocracy”, “Election rigging is worst than armed robbery”, “Recognised elections monitored by INEC’, No INEC, no Election’, ‘Ogun PDP position not for questionable characters’, ‘Enough of Ladi Adebutu imposition in Ogun PDP’, and ‘Ogun PDP, not an arm of Baba Ijebu’.\n“On Saturday, delegates’ elections were held in all the 20 local governments of Ogun State, but the National Working Committee from Abuja accepted the results of the local governments, whose chairmen are loyal to Ladi Adebutu and disregarded the remaining.\n“The implication is that Ladi Adebutu is trying to impose an unpopular delegate over a popular delegate."
  },
  {
    "headline": "IPC raises concerns over press freedom violation",
    "summarized_story": "The International Press Centre (IPC), Lagos-Nigeria, on the occasion of this year’s World Press Freedom Day (WPFD), has joined the global community to raise concerns about press freedom violations.\nThe statement said: “The International day is a day to reflect on issues of press freedom and professional ethics as well as to support journalists and other media professionals, who are often the targets of attacks on press freedom.\n“Taking into account the theme of this year’s World Press Freedom Day: ‘Journalism Under Digital Siege’, the Executive Director of IPC, Mr. Lanre Arogundade, remarked that the prevalence of press freedom infractions in the country indicates that there is now an urgent need for media stakeholders to jointly identify and develop sustainable solutions, including raising the standard of safety of journalists and media freedom in Nigeria.\n“The reality is there is little or no justice or even compensation for the victims, while the perpetrators go scot-free.\nWe must, therefore, work together to fortify the safety of journalists and media professionals.”Arogundade said in order to promote the conversation, IPC would on May 11 launch two documentaries, which would highlight IPC’s interviews with journalists and other media professionals, who were victims of brutal press freedom violations during the 2020 COVID-19 pandemic-induced lockdown and the #ENDSARS protests.”"
  },
  {
    "headline": "2023: Southwest leaders to meet Tinubu, Osinbajo, others Friday",
    "summarized_story": "Southwest leaders in the All Progressives Congress (APC) have scheduled a meeting with presidential aspirants from the zone.\nThe party’s founding Chairman Chief Bisi Akande and former Ogun State Governor Chief Olusegun Osoba, and other stakeholders are the conveners of the parley billed for Lagos State Government House in Marina, on Friday.\nExpected to attend are: APC stalwart Asiwaju Bola Tinubu, Vice President Yemi Osinbajo, Ekiti State Governor Kayode Fayemi and Senator Ibikunle Amosun.\nThe declaration is the height of Fayemi’s consultation after making his intention known to President Muhammadu Buhari last month.\nLast Wednesday, former Ogun State Governor Amosun notified the Senate of his intention to publicly declare to run tomorrow."
  },
  {
    "headline": "Let’s end zoning suspense, Akeredolu tells APC leaders",
    "summarized_story": "He said the adoption of a power shift would make the APC avoid self-inflicted crises ahead of next year’s election.\nThe senator, who said the principle of zoning was part of the federal character, added that zoning was adhered to during the election of party executives.\n“In 2015, based on the principle of zoning, it was agreed that the presidency should be zoned to the north.\n“Presidency North, chairman South and thereafter, Presidency South, chairman North.\n“Luckily, a lot of members of the working committee were members when we formed the legacy party called APC."
  },
  {
    "headline": "Breaking: Nigeria sanctions gas as transition fuel to bridge energy gap",
    "summarized_story": "From Adewale Sanyaolu, Houston, TexasThe Nigerian National Petroleum Corporation Limited (NNPC) says the Federal Government has chosen gas as the transition fuel in order to bridge the energy gap to create economic development.\nNNPC Board Chairman, Mrs Margrey Chuba- Okadigbo stated this in her remarks at the Offshore Technology Conference (OTC) Petroleum Technology Association of Nigeria (PETAN) organized session on Nigerian Energy and Supportive Industries in Houston, Texas.\nTherefore it is expected that much more significant change in overall capital allocation would be required to accelerate energy transition, especially in getting some key capital intensives, clean energy technologies to reach maturity’’.\nEarlier in his remarks, Chairman of PETAN, Mr. Nicholas Odinuwe, said the theme of the workshop ‘’Energy Transition and the Future of Africa’’ with Africa said to the the last energy frontier and global hub is apt as there is a global energy revolution and the quest for alternative and cleaner sources of energy.\nAccording to him, energy access is critical, so is funding and so, to fulfill the needs of this industry and secure future investment and energy security in Africa, our emphasis should be on collaboration, entrepreneurship, innovation, and funding."
  },
  {
    "headline": "2023: South should produce president –Akeredolu",
    "summarized_story": "From Bamigbola Gbolagunte, AkureOndo State Governor, Rotimi Akeredolu, yesterday, declared that it was the turn of the South to produce president in 2023 and so would be disingenuous for anyone to oppose power shift to the region.\nAkeredolu, chairman, South West Governors Forum, stated this in a statement tagged: ‘Our party, APC, must tread the path of equity’ urged leaders of the All Progressives Congress (APC) to make public the zoning arrangement.\nPart of the statement read: “It is the turn of the southern part of the country to produce the next President.\nThe party leadership should have no difficulty in making pronouncement on this very important issue, just as it has fixed various fees for the purchase of forms.\nThe Ondo governor said the current democratic dispensation is anchored on the unwritten convention driven by a principle of equity."
  },
  {
    "headline": "Okoro, Madubuko rejoice over The Sun awards",
    "summarized_story": "chairman and Chief Executive Officer of Corinthia Villa Hotel, Abuja, Chief Augustine Okoro and Chairman, De Chico Group, Chief Benson Madubuko, have described The Sun as a unique brand whose annual awards are recognition for hard work.\nSpeaking separately when the Managing Director/Editor-in-Chief, The Sun Publishing Limited, Onuoha Ukeh, led Management teams to present letters announcing their selection for the awards, Okoro and Madubuko said The Sun awards are credible.\nOkoro said the recognition will spur him to work harder to create more job opportunities for Nigerians.\nHe said: “For me, I’m really not crazy about awards but The Sun award is different and I believe I merit this award.\nOn why Okoro was chosen, he said: “We recognise your investments in the hospitality industry."
  },
  {
    "headline": "Why terrorism is worsening –Kaduna gov",
    "summarized_story": "From Noah Ebije, Kaduna and Tunde Omolehin, SokotoKaduna State Governor, Nasir El-Rufai has said terrorism would not have festered if security agencies had sustained the measures he adopted to tackle insecurity when he assumed office in 2015.\n“We created a specialised Ministry of Internal Security, and we continue to support the federal security agencies with logistics and other resources.\nHe said the traditional institutions should mobilise their networks to expose them and support the security forces with local intelligence.\n“The Kaduna State Government will continue to do everything it can to mobilise and support the federal security agencies to defeat terrorists and criminals that menace our people,’’ he said.\nMeanwhile, Sultan of Sokoto, Sa’ad Abubakar, has advised leadership of the Nigerian Army to re-strategise their tactics in the ongoing war against terrorism."
  },
  {
    "headline": "Akande, Osoba convene S’ West APC presidential aspirants meeting",
    "summarized_story": "Others are Speaker Femi Gbajabiamila, deputy senate leader, Ajayi Boroffice, APC governors from the South West and other stakeholders.\nOsoba confirmed the meeting in Paris, France yesterday, saying it was meant to bring peace in the South West.\nIt was, however, learnt that the essence of the Lagos meeting is to bring all the candidates to a round table to ensure the South West does not lose out in the contest for the APC presidential ticket.\nThe thinking of conveners of the meeting is that the South West sacrificed most for the emergence of President Muhammadu Buhari and should be rewarded with the presidential ticket.\nThere is also the fear that if the South West fails to put its house in order, it may lose the ticket to the South South or the South East."
  },
  {
    "headline": "How Nigerian Famous Cleric, Pastor Bakare Sold $1.4million US Mansion Below Market Value In 2017, Losing $370,000",
    "summarized_story": "The founder of Citadel Global Community Church (formerly Latter Rain Assembly), Pastor Tunde Bakare (Babatunde Gbolahan Bakare) in 2017 sold one of his properties in the United States of America below market value, SaharaReporters has gathered.\nThe property which was bought by the lawyer turned pastor in June 2006 for $1,400,000 was sold to one Peter Lu (Peter & Minsu Lu) 11 years later for $1,030,000, at a loss of $370,000.\nIt was bought in July 2017 by Peter & Minsu Lu, according to documents obtained by SaharaReporters.\nDocuments say the current owner is Peter Lu.\nAccording to Redfin Real Estate, the mansion is currently worth $1,673,830, $273,830 more than Bakare bought it and $643,830 more than the cleric sold it."
  },
  {
    "headline": "How Nigerian Famous Cleric, Pastor Bakare Sold $1.4million US Mansion Below Market Value In 2017, Losing $370,000",
    "summarized_story": "The founder of Citadel Global Community Church (formerly Latter Rain Assembly), Pastor Tunde Bakare (Babatunde Gbolahan Bakare) in 2017 sold one of his properties in the United States of America below market value, SaharaReporters has gathered.\nThe property which was bought by the lawyer turned pastor in June 2006 for $1,400,000 was sold to one Peter Lu (Peter & Minsu Lu) 11 years later for $1,030,000, at a loss of $370,000.\nIt was bought in July 2017 by Peter & Minsu Lu, according to documents obtained by SaharaReporters.\nDocuments say the current owner is Peter Lu.\nAccording to Redfin Real Estate, the mansion is currently worth $1,673,830, $273,830 more than Bakare bought it and $643,830 more than the cleric sold it."
  },
  {
    "headline": "Africa's Richest Man, Dangote May Forfeit Refinery Project To Nigerian Debt Recovery Agency Over Rising Debts, Long Delay",
    "summarized_story": "Dangote Refinery is an oil refinery owned by the Dangote Group that is under construction in Lekki, Nigeria.\nHowever, analysts have pointed out that NNPC’s 20% equity at $3.8 billion makes the Dangote refinery overvalued at $19 billion.\nUsing the $16 billion value, 20 percent should be $3.2 billion and analysts have expressed dissatisfaction at the disparity in the project’s value and NNPC’s funding.\n“I don’t see the banks being unable to meet their liquidity because of the monies tied down in the Dangote refinery.\nI don’t envisage any bank having a liquidity challenge as a result of investing in Dangote refinery."
  },
  {
    "headline": "Africa's Richest Man, Dangote May Forfeit Refinery Project To Nigerian Debt Recovery Agency Over Rising Debts, Long Delay",
    "summarized_story": "Dangote Refinery is an oil refinery owned by the Dangote Group that is under construction in Lekki, Nigeria.\nHowever, analysts have pointed out that NNPC’s 20% equity at $3.8 billion makes the Dangote refinery overvalued at $19 billion.\nUsing the $16 billion value, 20 percent should be $3.2 billion and analysts have expressed dissatisfaction at the disparity in the project’s value and NNPC’s funding.\n“I don’t see the banks being unable to meet their liquidity because of the monies tied down in the Dangote refinery.\nI don’t envisage any bank having a liquidity challenge as a result of investing in Dangote refinery."
  },
  {
    "headline": "Foreign Airlines To Begin Sale Of Tickets In US Dollars April 19",
    "summarized_story": "The sale of tickets in US dollars will begin with effect from April 19, 2022, some foreign airlines operating in Nigeria disclosed on Thursday.\nThis was contained in an announcement made by APG in an advisory to its travel partners, titled: “APG IET: Restrictions of Sales in US dollars”.\nThank you for understanding.”Airlines on the APG IET platform include South African Airways, Fly Dubai, Kenya Airways, Middle East Airlines, Royal Air Maroc, Rwandair, Thai Airways, Turkish Airlines, FrenchBee, EgyptAir, ASKY, Air Seychelles, Air Algerie and Air Namibia.\nAir Panama, Air Burkina, Avianca, Bangkok Airways, Cabo Verde Airlines, Fiji Airways, Hong Kong Airlines, Malaysian Air, alongside other carriers, also use the platform.\nSome of these airlines which fly directly into Nigeria are South Africa Airways, Turkish Airlines, Asky Airlines, Egypt Air, Royal Air Maroc, Middle East Airlines, Rwanda Air and Kenya Airways."
  },
  {
    "headline": "Fayemi declares presidential bid, says it wasn't an easy decision",
    "summarized_story": "Kayode Fayemi, governor of Ekiti and chairman of the Nigeria Governors Forum (NGF), has declared his intention to run for president of Nigeria on the platform of the All Progressives Congress (APC).\nFayemi declared his bid at an event in Abuja on Wednesday.\nThe governor said he did not arrive at the decision to become president easily.\nThe presidential hopeful said he consulted with Nigerians at different strata of society before declaring his bid.\n“I embarked on these outreach visits without any prior assumptions of what they will yield nor with any sense of personal entitlements.”"
  },
  {
    "headline": "Fayemi declares presidential bid, says it wasn't an easy decision",
    "summarized_story": "Kayode Fayemi, governor of Ekiti and chairman of the Nigeria Governors Forum (NGF), has declared his intention to run for president of Nigeria on the platform of the All Progressives Congress (APC).\nFayemi declared his bid at an event in Abuja on Wednesday.\nThe governor said he did not arrive at the decision to become president easily.\nThe presidential hopeful said he consulted with Nigerians at different strata of society before declaring his bid.\n“I embarked on these outreach visits without any prior assumptions of what they will yield nor with any sense of personal entitlements.”"
  },
  {
    "headline": "Oil price tops $108 a barrel ahead of OPEC+ meeting",
    "summarized_story": "Oil prices rose on Wednesday ahead of the periodic meeting of the Organisation of Petroleum Exporting Countries (OPEC) and its allies.\nBrent crude futures, the global oil benchmark, climbed 3.35 per cent to $108.25 a barrel at 10.20 GMT+1 — the first time since April 29.\nAdvertisementOn Wednesday, Ursula von der Leyen, president of the European Commission, announced that European Union countries would stop importing Russian oil in the next six months.\nAdvertisementThe ban on Russian oil is expected to have a ripple effect on the EU’s energy supply chain.\nAlready, the United States placed a ban on Russian oil imports, and the UK said it would follow suit by the end of the year."
  },
  {
    "headline": "Oil price tops $108 a barrel ahead of OPEC+ meeting",
    "summarized_story": "Oil prices rose on Wednesday ahead of the periodic meeting of the Organisation of Petroleum Exporting Countries (OPEC) and its allies.\nBrent crude futures, the global oil benchmark, climbed 3.35 per cent to $108.25 a barrel at 10.20 GMT+1 — the first time since April 29.\nAdvertisementOn Wednesday, Ursula von der Leyen, president of the European Commission, announced that European Union countries would stop importing Russian oil in the next six months.\nAdvertisementThe ban on Russian oil is expected to have a ripple effect on the EU’s energy supply chain.\nAlready, the United States placed a ban on Russian oil imports, and the UK said it would follow suit by the end of the year."
  },
  {
    "headline": "Data, call costs to go up as telecoms union proposes 40% tariff hike",
    "summarized_story": "Telecommunication companies under the Association of Licensed Telecom Operators of Nigeria (ALTON) have asked for upward reviews in voice calls, short message services (SMS) and data costs.\nDetails are hereunder:Advertisement“Upward review of the price determination for voice and data and SMS.\n“With respect to voice and SMS cost, ALTON respectfully requests the commission to consider a mark-up approach to address the upward price adjustment desirable for the industry.\n“For large operators, a new interim MTR of N5.46 from N3.90 reflecting 40 per cent increase in the cost of business,” ALTON said.\n“For small operators, the new interim MTR of N6.58 from N4.70 reflects a 40 per cent increase in the cost of business.”"
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "Don’t miss the May edition of Techpoint Africa Pitch Friday",
    "summarized_story": "Share this article:For the third straight month, Techpoint Africa will be hosting entrepreneurs and startup enthusiasts at Techpoint Pitch Friday.\nIf you didn’t know what Pitch Friday is, here’s a reminder: Techpoint Pitch Friday provides early-stage founders and aspiring entrepreneurs with a platform to share their business ideas or businesses.\nPitch Friday holds once a month, and admission is free.\nFor the May edition, the date is Friday, May 13, 2022, by 5 pm.\nI’m confident this is an event you would not want to miss, so register here."
  },
  {
    "headline": "Report: The impact of Y Combinator in Africa over the years",
    "summarized_story": "The California-based startup accelerator founded in 2005 has become a prominent force in the global startup ecosystem.\nIt won’t be an overstatement to consider it the mecca for African startups.\nIntelligence by Techpoint, the data and research arm of Techpoint Africa, partnered with YC to give an account of YC’s activities in Africa since 2009.\nThis collaboration has produced Y Combinator in Africa: A report about African startups that have gone through Y Combinator’s Accelerator Programme.\nThe report examines the distribution of YC-backed African startups using various criteria."
  },
  {
    "headline": "Meta needs to get over TikTok",
    "summarized_story": "AdvertisementI understand that this may be a source of frustration for the Meta team, but wasn’t it just last month that Instagram said it would stop recommending TikTok videos to the users?\nWell, today, I’ll be discussing:Twitter is testing Twitter CircleFacebook to shut down its podcast platformTwitter is testing Twitter CirclePhoto by Claudio Schwarz | @purzlbaum on UnsplashYesterday, Tuesday, May 3, 2022, Twitter announced a limited test for Twitter Circle.\nWhat’s Twitter Circle?\nEven though Communities also hide tweets — an attempt to prevent “context collapse” —Twitter Circle differs because Communities are tied to specific discussions.\n😂😂 And even if you can’t create a Twitter Circle, you can see tweets from users who can, as long as you’re in their Circle."
  },
  {
    "headline": "Five ways Mushe is transforming the Digital Banking space",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTo promote your brand via Brand Press, please email business@techpoint.africaShare this article:Offering real-world applications, financial education and a strong community, Mushe is the one-stop-shop for cypto.\nXMU is interoperable across fiat and crypto, the Mushe Wallet is seamlessly integrated, and users can trade and transfer with Mushe Swap.\nLearn more about Mushe (XMU)Official Website: https://www.mushe.world/Presale Registration : https://portal.mushe.world/sign-upTelegram: https://t.me/MusheWorldXMUTwitter: https://twitter.com/Mushe_WorldInstagram: https://www.instagram.com/mushe_world/Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Five Cryptocurrencies That Everyone Should Have In Their Portfolio",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:According to data from Coingecko, there are over 16,000 cryptocurrencies in circulation.\nThe five cryptos are:Ethereum (ETH) XRP (XRP) Gala Games (GALA) Chiliz (CHZ) FIREPIN Token (FRPN)Let’s take a look at why we think these five cryptos will be good additions to your portfolio.\nAs the Metaverse gains traction, expect to see the early adoption tokens such as Gala Games (GALA) see significant price increases.\nFind Out More Here:Join Presale: https://presale.firepin.io/registerWebsite: https://firepin.io/Telegram: https://t.me/FIREPINOFFICIALTwitter: https://twitter.com/FIREPIN_ioBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Obaseki moves to end street begging, urges stakeholders’ support – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has affirmed the government’s zero tolerance for street begging, noting that the state will begin the arrest and prosecution of parents of out-of-school children, as part of efforts to tackle the menace of street begging in the state.\nThe governor said, “We believe that basic education is the right for every Edo child; it’s their right and it’s free and compulsory.\nWe will link education with street begging and street children.\n“In the next few weeks or months, we will not allow street begging in Edo anymore.\nWe will make sure those hard-to-reach areas in the riverine communities will have teachers to teach the children."
  },
  {
    "headline": "Obaseki, Ehanire seek increased private partnership to improve healthcare system – Nigerian Observer",
    "summarized_story": "The duo made the call during a dinner organized for members of the Association of Nigeria Physicians in the Americas (ANPA) who are in Edo State on a one-week medical mission, providing specialised healthcare services to the people of Edo State.\nDuring the medical mission, over 5,000 Edo residents benefitted from the free surgical intervention and treatments for heart, kidney, eye and other ailments.\nHailing the association for the free medical outreach, Obaseki said the mission has provided better healthcare for Edo people.\nHe said, “We have received the fundamental benefit of hope to Edo people as you gave renewed life to Edo people.\nYou also engaged in capacity building as you interchanged skills and made your colleagues here locally improve their knowledge."
  },
  {
    "headline": "Obaseki inspects progress of work on Labour House, to finalises on construction of 7.2km Temboga Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said the government is commencing the construction the 7.2km Temboga Road in Ikpoba-Okha Local Government Area (LGA) of the state to decongest traffic around Ramat and its environs within the Benin metropolis.\nObaseki disclosed this when he was led on an inspection of ongoing construction of the Edo Labour House Complex, in Benin City, by the state chairman of the Nigeria Labour Congress (NLC), Mr. Odion Olaye.\nThe governor said, “We are finalising the design of Temboga Road; it’s about 7.2km to the end.\nOnce they finalize with the design in the next few weeks, we will award the contract.\nIt has a multipurpose hall which can be put into commercial use to generate income."
  },
  {
    "headline": "PHOTOS: Workers’ Day Celebration In Edo – Nigerian Observer",
    "summarized_story": "Check AlsoThe Governor of Edo State, Mr. Godwin Obaseki, has congratulated Muslims in the state as …"
  },
  {
    "headline": "Number of people facing acute hunger rise to 193 million – UN",
    "summarized_story": "The UN’s Food and Agriculture Organisation (FAO) said Wednesday that the number of people facing hunger rose to 193 million in 2021 as conflict, climate change and economic crises ravaged people’s livelihoods.\nWhile experts have warned that Russia’s war in Ukraine could cause famine, the FAO said in an annual report that nearly 40 million more people were pushed into “acute food insecurity” in 2021.\nThe United Nations defines “acute food insecurity” as when a person’s inability to consume adequate food puts their lives or livelihoods in immediate danger.\nIn 2021, conflict and insecurity was the main driver of acute hunger in 24 countries, affecting 139 million people.\nExtreme weather was the main driver of acute food insecurity for 23.5 million people in eight African countries."
  },
  {
    "headline": "Osun pensioners protest, demand immediate payment of entitlements from Oyetola",
    "summarized_story": "“The governor should apply the same method he used to build Olaiya Iconic Flyover bridge where over 2billion naira was expended to pay the entitlement of Pensioners.\nHe, however, appealed to the state government to issue the contributory pensioners, letters of promotions that they were due for, while in the service of the state.\nHe was on the opinion that the pension of this relevant law, grossly inadequate and intermittent remittances of Government counterpart funds have deprived the contributory pensioners, covered by the dates.\nIt should be noted that fundings were made in 2018 and 2019 for retired contributory pensioners from 2016 to 2022, Six years after retirement.\nMany of our children have been rusticated from Osun State University UNIOSUN because we could not pay their school fees."
  },
  {
    "headline": "Shareholders of Nigerian Breweries approve N12.92bn total dividends",
    "summarized_story": "Shareholders of Nigerian Breweries Plc (NB) have approved a total dividend of N12.92 billion for the 2021 financial year.\nHans Essaadi, Managing Director of the company who addressed shareholders at the meeting, said the company is committed to delivering higher returns to shareholders in a consistent manner.\nAgbebaku affirmed that the company’s management remains committed to consistently delivering superior value to shareholders and taking decisions in their best interest.\nThe shareholders who spoke at the meeting described the total dividend payout to shareholders as a step in the right direction following an impressive financial performance recorded by the company in the 2021 financial year.\nAccording to the 2021 financial year result, marketing, distribution, and administrative expenses rose from N89.66billion in the 2020 financial year to N123.14billion in the 2021 financial year, representing a 37.3 per cent increase."
  },
  {
    "headline": "Terrorism: 60, 000 people killed in 10 years northern Nigeria – CDD",
    "summarized_story": "The Centre for Democracy and Development (CDD) has disclosed in a report that at least 60,000 people have been killed in Nigeria’s 18 northern states in the last 10 years due to insecurity.\nIn the report titled, “Multiple Nodes, Common Cause: National Stocktake of Contemporary Insecurity and State Responses in Nigeria,” the CDD said in the Northwestern states of Jigawa; Kaduna, Kano, Kebbi, Sokoto and, Zamfara about 14, 000 people lost their lives between 2011 and 2021.\nTo address the prevailing situation, CDD said local, and national stakeholders would need to be willing to try new approaches to curtailing insecurity, stressing that the kinetic approaches favoured by the federal government may remain a mirage.\n“Peace building interventions are urgently needed in most if not all geopolitical zones to improve community cohesion in conflict-affected areas,” the report stated.\n“Similarly, the relationship between narcotics production, consumption, and trafficking on the one hand and insecurity on the other remains largely subject to speculation."
  },
  {
    "headline": "Edo PDP Appeals Panel Begins Sitting, Urges Aggrieved Members To Submit Petitions",
    "summarized_story": "The state chapter of the party also received members of the PDP National Assembly Appeal Screening Committee, headed by Mr. Emuobohwo Odje, and members of the State House of Assembly Appeal Screening Committee, headed by Mr. Beye Kingsley.\nAddressing party members at the PDP Secretariat in Benin City, Chairman of the Edo PDP Ward Congresses Electoral Appeal Panel, Sen. Chukwuka Utazi, said the committee has commenced work, promising to ensure justice for all aggrieved parties.\nUtazi said, “I am here this morning with other members of the Ward Congresses Electoral Appeal Panel of PDP for Edo State to interact with any aggrieved individual following the adhoc delegates election conducted on Saturday.\nWe urge party members with issues of any sort and complaints as a consequence of that election to approach this panel to look into the matter.\n“We hope that by the time we are through, the party here in Edo will remain united, solid and indivisible.”"
  },
  {
    "headline": "Right To Health: Group Urges Collaboration For Full Realisation",
    "summarized_story": "Right group, Center for social Justice (CSJ), has called for collaboration among relevant stakeholders for full realisation of Right To Health in Nigeria.\nIn his presentation, the lead director, CSJ, Eze Onyekpere, noted that the right to health is an empowering right that greatly facilitates the realisation and enjoyment of other rights.\nHe also said that for the realisation of Universal Health Coverage, any proposed review of the law should make health insurance compulsory for all Nigerians,saying “If government has made vehicle insurance compulsory, then health insurance cannot be optional unless we value cars more than humans.\n“Advocacy for ensuring that a Budget Call Circular takes specific cognisance of the right to health is imperative for the formulation of health responsive and transformative estimates.\nIt is a part of the most fundamental of the fundamental rights which is the right to life as it supports the fulcrum upon which other rights rotate,“"
  },
  {
    "headline": "Why We Must End Female Genital Mutilation",
    "summarized_story": "Female Genital Mutilation (FGM) is a traditional practice inflicted on girls and women.\nThe procedure involves the partial or total removal of the external female genital causing injury to the female genital organs.\nSpeaking on the urgent need to put an end to this practice, the ministry of women affairs, Dame Pauline Tallen,said the procedure of FGM has no health benefit for girls and women.\n„The continuous practice of FGM denies girls and women the right to quality education, opportunities for decent work and their health particularly sexual and reproductive are threatened.\nIt recommends that “… a person who performs female circumcision or genital mutilation or engages another to carry out such, commits an offence punishable by 4 years imprisonment or to a fine of N200,000 or both,“ she stressed."
  },
  {
    "headline": "Why We Must End Female Genital Mutilation",
    "summarized_story": "Female Genital Mutilation (FGM) is a traditional practice inflicted on girls and women.\nThe procedure involves the partial or total removal of the external female genital causing injury to the female genital organs.\nSpeaking on the urgent need to put an end to this practice, the ministry of women affairs, Dame Pauline Tallen,said the procedure of FGM has no health benefit for girls and women.\n„The continuous practice of FGM denies girls and women the right to quality education, opportunities for decent work and their health particularly sexual and reproductive are threatened.\nIt recommends that “… a person who performs female circumcision or genital mutilation or engages another to carry out such, commits an offence punishable by 4 years imprisonment or to a fine of N200,000 or both,“ she stressed."
  },
  {
    "headline": "Sallah: Kannywood Boycotts Zuma Film Festival 2022",
    "summarized_story": "Heads of the coalition, the national president of MOPPAN, Dr. Ahmad Muhammad Sarari and the national president of AFMAN, Alhaji Sani Sule Katsina, made their stance known in an open letter to the minister of information and culture, Alhaji Lai Mohammed.\nThe associations said the Eid celebration precludes all Muslims from participating and benefitting from the festival.\n“So, we doubt if any government agency can organise such a national event on Christmas or New Year festive days.\nThe coalition of the northern movie practitioners pray that the minister should intervene and address the matter accordingly,” the statement said.\n“Kannywood is the Northern axis of the Nigerian movie/Music industry, which is based in Kano State."
  },
  {
    "headline": "Abidemi Rufai ex-Ogun official admits serial U.S. fraud, pleads guilty",
    "summarized_story": "Ijebu-Ode born Abidemi Rufai and former aide of Governor Dapo Abiodun of Ogun state has pleaded guilty to a series of fraud cases against him in federal court in Tacoma, Washington state, prosecutors said.\nThe largest amount of fraud was committed against the Washington State Employment Security Department, which paid out $350,763 in fraudulent pandemic unemployment claims to accounts controlled by Rufai.\nRufai also submitted fraudulent pandemic unemployment claims in at least 17 other states.\nRufai’s efforts to enrich himself with false disaster claims did not start with COVID-19.\nThe Washington Employment Security Department is cooperating in the investigation."
  },
  {
    "headline": "Nollywood actress Remi Surutu loses mother",
    "summarized_story": "Famous Nollywood actress and entrepreneur, Remi Oshodi, popularly known as Remi Surutu is in a state of mourning over her mother’s death.\nThe multi-talented screen diva took to social media to announce the passing away of her mum aged 101.\nYou lived a fulfilled life @therealremisurutu you did everything humanly possible but God knows best grandma, may your soul rest in perfect peace.\n@therealremisurutu e ku atemora ma”Sola Kosoko wrote “May her gentle soul rest in perfect peace.\nWooooow aunty mi… may her soul rest in peace”Surutu in 2017 lost her first daughter, Ayomikun, to sickle cell disease."
  },
  {
    "headline": "JUST IN: UNIBEN Students Protest ASUU Strike",
    "summarized_story": "On Wednesday, hundreds of students from the University of Benin in Edo State marched out in protest of the Academic Staff Union of Universities’ ongoing strike.\nIt should be remembered that, according to NEWD DIRECT, students protested around the University of Ibadan in Oyo State on Tuesday, calling for the prompt reopening of all public universities in Nigeria.\nStudents at UNIBEN, who had protested around the university’s gate and environs, had declared ‘UNISTREET,’ which meant that Nigerian students would now be giving lectures on the streets, with some of them acting as lecturers, all in an attempt to protest school closure.\nProtest was foiled at the University of Lagos on Tuesday as heavily armed security officials, including the men of the Nigeria Police Force, were stationed at the gate of the school.\nThe strike action of the lecturers which is entering its fourth month has left public universities shut since its inception following the lecture’s demands, which the Federal Government had, allegedly, not met."
  },
  {
    "headline": "BREAKING: Fayemi declares for 2023 presidential race",
    "summarized_story": "Ekiti Governor Kayode Fayemi has joined the 2023 presidential race for the ticket of the ruling All Progressives Congress(APC).\nHe made the declaration at the Hilton Hotel, Abuja in company of his wife Erelu Bisi Fayemi, APC Governorship aspirant, Biodun Oyebanji, members of the Assembly and traditional rulers.\nDetails Shortly…"
  },
  {
    "headline": "Nigeria’s Attorney-General, Malami Opens Multi-billion Naira Hotel Few Days After Distributing Exotic Vehicles To APC Supporters",
    "summarized_story": "Abubakar Malami, Nigeria’s Minister of Justice and Attorney-General of the Federation (AGF), has opened “The Azbir,” a new hotel in Birnin Kebbi, Kebbi State.\nThis is coming a few days after the minister distributed over 100 exotic cars to ruling All Progressives Congress members ahead of the party’s governorship primary in Kebbi State.\nMalami had last Thursday declared interest in the Kebbi State governorship race.\nMalami also built a N3billion multipurpose event centre in Kebbi State named Azbir Arena for his son in Kebbi.\nThis is apart from Rayhaan Hotel located on Zaria Road, opposite Aminu Kano Teaching Hospital, which the AGF massively upgraded using proceeds of corruption."
  },
  {
    "headline": "2023 APC Ticket: Fayemi Visits Ganduje, Sule, Akume",
    "summarized_story": "As he prepares to run for President of Nigeria in 2023, Ekiti Governor Kayode Fayemi is continuing his visits to APC leaders.\nIn a Facebook post on Wednesday, the governor provided an update.\nOn Tuesday, Fayemi met with Kano Governor Abdullahi Ganduje and Nasarawa Governor Abdullahi Sule, according to his announcement.\nSenator George Akume, former Governor of Benue and Minister of Special Duties and Inter-Governmental Affairs, was also introduced to Fayemi.\nFayemi added that they also discussed ways to re-engineer Nigeria’s governance system and its responsive capacity to issues of national co-existence."
  },
  {
    "headline": "Akeredolu, Opeyemi to APC: Return presidency to South, douse raging restiveness",
    "summarized_story": "Ondo state Governor Oluwarotimi Akeredolu has called on the leadership of the All Progressives Congress (APC) to zone the presidential position to the southern part of the country.\n“The leadership of the party ensured that the principle of rotational representation guided its decision at the just-concluded convention,” he said.\nHe said the party executive committee had fixed a fee for the purchase of the nomination form for the office.\n“The party leadership should have no difficulty in making pronouncement on this very important issue, just as it has fixed various fees for the purchase of forms.\n“We must not keep our party men and women guessing on the position of the leadership of the party."
  },
  {
    "headline": "Network of informants assist terrorists attacking Kaduna communities – El-Rufai",
    "summarized_story": "Kaduna state Governor Nasir El-Rufai has said gunmen terrorising the state are being assisted by scores of informants in many communities.\nEl-Rufai said the Kaduna state government, however, remains convinced that comprehensive, simultaneous military and security operation in the state and other states would help stop the terrorists.\nThe governor said this while speaking at the Hawan Bariki with members of the Zazzau Emirate Council in Zaria, Kaduna state on Tuesday.\n“We call on the traditional institution to mobilise their networks to expose these informants and support the security forces with local intelligence,” El-Rufai stated.\nHe thanked President Muhammadu Buhari and Sokoto state Governor Aminu Waziri Tambuwal for providing the enabling support."
  },
  {
    "headline": "[Breaking] UEFA Champions League: Liverpool survive Villarreal scare, zoom into final",
    "summarized_story": "Liverpool survived a scare against Villarreal to move into the Champions League final – and keep their hopes of winning an unprecedented quadruple alive.\nSadio Mane secured Liverpool’s place in their third Champions League final in five seasons with a third goal after taking the ball around Rulli.\nVillarreal ended the game with 10 men with Capoue sent off late on for two bookable offences.\nThe Reds will play either Manchester City or Real Madrid at the Stade de France in Paris on Saturday, 28 May.\nNo English side has ever won the Champions League, Premier League, FA Cup and League Cup all in the same season, with Liverpool aiming to create history."
  },
  {
    "headline": "Edo State NLC tasks FG on improving job creation",
    "summarized_story": "He made the call yesterday during the 2022 Workers’ Day in Benin City, Edo State.\nMeanwhile, the Edo State Governor, Godwin Obaseki, has approved N40,000 as new minimum wage for workers in the state, in commemoration of this year’s Workers’ Day.\nIt will be immoral and mindless of us to continue to pretend we do not know our workers are suffering.\n“The government of Edo has now decided to review the minimum wage for Edo workers from N30,000 to N40,000.\nUndoubtedly, Edo is the first state since the current outbreak of coronavirus to take this initiative."
  },
  {
    "headline": "2021: FCMB records N1.57trn deposit",
    "summarized_story": "By Onu OkorieFirst City Monument Bank FCMB Group Plc has recorded a Total deposit increase by 1.21 per cent to N1.57 trillion from N1.1.55 trillion in the previous year.\nis on the path of growth overcoming two economic recession as the lender’s profit hit a seven year high and an inch to equaling 2015 highs.\nThe uptick in profit was buoyed by an improvement in interest income as FCMB created risk assets and loans while a benign yield environment strengthened income from treasury yields.\nInterest income on loans and advances increased by 39.87 percent to N46.69 billion in March 2022.\nNet interest income, the difference between the revenue generated from a bank’s interest-bearing assets and the expenses associated with paying its interest-bearing liabilities, was up 52.59 percent to N18.54 billion as at March 2021."
  },
  {
    "headline": "Ogbeifun seeks financial support for seafarers to build capacity for employment",
    "summarized_story": "By Naomi DourglasChairman of Startz Investment Company and former president of Ship Owners Association of Nigeria (SOAN) Engr.\nGreg Ogbeifun has tasked the Federal Government to help Nigerian ship owners with necessary financial support to enable them to build the capacity for seafarers through employment.\n‘He also explained that, the Secretary-General of MOWCA had confirmed to him that the Managing Director of the RMDB has been appointed.\nSo, hopefully, in two or three months, we will have a functional maritime bank with some funds that operators begin to look forward to”.\nOgbeifun stated that the RMDB will serve as a succor to ship owners who find it difficult to access the Cabotage Vessel Financing Fund (CVFF)."
  },
  {
    "headline": "2021: MTN Nigeria Plc rewards shareholders with N13.12bn as dividends",
    "summarized_story": "Also Board representatives re-elected are Mr Rhidwaan Gasant and Mrs lfueko Omoigui-Okauru.\nAs at the end of March 2022, we had approximately 10.7 million active users and 166k active MoMo agents,” MTN Nigeria CEO, Karl Toriola, said.\nMTN Nigeria was recently granted final approval for a Payment Service Bank (PSB) by the Central Bank of Nigeria (CBN).\n“Having established a significant foundation of registered agent network, we are now focusing on scaling the active base.\nWe have expanded our agent services to include card withdrawal services by deploying point of sales (POS) terminals to the agent network."
  },
  {
    "headline": "P+ Measurement wins awards in PR, industry influencer relations",
    "summarized_story": "By Kehinde Ibrahim LagosP+ MEASUREMENT Services, Nigeria’s foremost Independent Public Relations measurement and evaluation agency have attained double laurels at this year’s Industry Awards where it clinched the Leader in PR Measurement & Industry Influencer Awards (Public Relations), for its quality offerings that surpass clients’ expectations and leading position in the sector.\nThe awards come on the heels of the company’s rebranding business strategy with a new logo, website, and office to deepen penetration and maintain its dominant position in the industry it operates, with over 47 brands and 17 Public Relations agencies in Africa’s largest economy.\nAccording to him, the award-winning and innovative organisation, with cutting-edge solutions has dictated the pace of the Public Relations measurement and evaluation services with its distinctive approach to ensuring that clients’ objectives are achieved.\nIts measurement and evaluation report are in-depth, robust, and flexible to accommodate valid metrics that brands desire to see reflected in their customised reports, and also based on the AMEC Standard by the Barcelona Principle 3.0.\nAlso, as part of its efficient services, the measurement and evaluation company introduced “Get-Reports,” a novel product that allows the purchase of PR performance audit reports in key sectors including the 22 Commercial Nigerian Banks PR Performance Audit Report, Top Nigerian Insurance PR Performance Audit Report, Top Nigerian Digital Banks PR Performance Audit Report, and Top Online Streaming Services PR Performance Audit Report."
  },
  {
    "headline": "UN Chief Visits Borno IDPs, Says Reintegrating Repentant Terrorists Critical For Peace",
    "summarized_story": "The United Nations Secretary-General, Antonio Guterres, has proposed the reintegration of repentant terrorists to ensure the absolute return of peace in Nigeria’s north-east region.\nBorno is now a place of hope – showing that the way to fight terrorism effectively is to invest in livelihoods, reintegration and people’s futures.\n“The Borno I found today (Tuesday) is a Borno of hope, it’s a Borno with future,” he said.\n“The way to address terrorism effectively is to provide not only hope but a future of reality.\nWhen I went around with the thousands and thousands of people that were there, I saw smiles, I saw enthusiasm, I saw hope, and this is where we must invest.”"
  },
  {
    "headline": "Antonio Guterres Visits UN House In Abuja",
    "summarized_story": "The United Nations Secretary-General, Antonio Guterres, is currently at the UN House in Abuja, the nation’s capital.\nHis visit to the UN House comes a day after the UN scribe arrived in Nigeria on a two-day official visit – the first since he assumed office.\nREAD ALSO: UN Chief Visits Borno IDPs, Says Reintegrating Repentant Terrorists Critical For PeaceShortly after his arrival, he met with top officials of the organisation in Nigeria.\nWhile at the UN House, he will also meet with young people’s delegates, women, religious leaders, diplomatic communities, and journalists.\nFrom there, he is scheduled to head to Abuja to meet with President Muhammadu Buhari and the Vice President, Professor Yemi Osibanjo, and other top government officials."
  },
  {
    "headline": "Fayemi Officially Joins 2023 Presidential Race",
    "summarized_story": "The Governor of Ekiti State and former Minister of Mines and Steel, Kayode Fayemi has declared his intention to run for the seat of the President of the Federal Republic of Nigeria.\nThis governor stated this on Wednesday unveiling his agenda for the country.\nHe said, after consideration of where the nation is, he believes his entry into the race will rebirth a new Nigeria.\n‘After careful consideration of where we are as a nation…I believe that my entry into the race will offer Nigerians the opportunity to examine competing visions for national rebirth,” Fayemi said.\nThe former Minister said the decision to run was not one he took lightly but had made several consultations before arriving making his intentions known."
  },
  {
    "headline": "Ogun Governor’s Aide, Abidemi Rufai Pleads Guilty To COVID-19 Fraud In U.S.",
    "summarized_story": "Days after the report of his arrest emerged, Governor Abiodun suspended Rufai from office to answer for the charges against him.\n“Rufai also submitted fraudulent pandemic unemployment claims in at least 17 other states.\n“Rufai also defrauded the Small Business Administration (SBA) by attempting to obtain Economic Injury Disaster Loans (EIDL) tied to the COVID-19 pandemic.\nIt added that the defendant’s efforts to enrich himself with false disaster claims did not start with COVID-19 as he had submitted 49 disaster relief claims connected to Hurricane Harvey and Hurricane Irma in September and October 2017.\nRufai was also said to have filed $24,500 in false claims and was paid on 13 claims, totalling $6,500."
  },
  {
    "headline": "EU Eyes Russian Oil Import Ban As Moscow Strikes Western Ukraine",
    "summarized_story": "The European Commission proposed a gradual ban on Russian oil imports Wednesday to punish Moscow for its invasion of Ukraine, as Russian forces pounded sites to the east of the country and hit targets in the far west near the EU border.\nHungary and Slovakia, both hugely dependent on Russian oil, would be given more time to meet the ban under the proposed plan, which will need unanimous approval before going into effect.\n– Solidarity for Moldova –Western allies continue to provide Kyiv with cash and weapons in a bid to force Russian President Vladimir Putin to pull back, alongside unprecedented sanctions.\nBut more than two months after the February 24 invasion, Russian forces continue to batter the south and east, where 21 civilians were killed and 28 wounded in a series of assaults in Donetsk on Tuesday.\nBoth sides on Wednesday also reported Russian strikes on key transport infrastructure around the western city of Lviv, near Poland, and Transcarpathia, a region bordering Hungary."
  },
  {
    "headline": "Kanye West sued for allegedly using Pastor's sermon without permission -",
    "summarized_story": "Kanye West is facing a lawsuit after a Texas pastor sued the rapper for sampling his sermon on “Come to Life,” a standout track from Ye’s 2021 album Donda.\nAccording to TMZ Bishop David Paul Moten has filed a lawsuit against Kanye, UMG Recordings, Def Jam Recordings, and G.O.O.D Music, claiming that Ye sampled audio of his sermon without getting permission.\nAccording to Moten, Kanye used his sermon for “ 70 seconds of the 5-minute, 10-second track … which is more than 20 percent of the song”.\nDonda’s performed better commercially than Ye’s previous albums, Jesus Is King and Ye, with those two project moving 264,000 and 208,000 album equivalent units, respectively.\nHe was also reported to have paid to retrieve the Sex Tape of his former Wife, Kim Kardshian, from her former boyfriend."
  },
  {
    "headline": "House of Reps resumes plenary to deliberate on 3 Critical Bills -",
    "summarized_story": "The House of Representatives is set for a plenary to facilitate the passage of three crucial bills.\nThe bills are the Proceeds of Crime Bill, the Money Laundering Prohibition Act Amendment Bill and the Terrorism Prevention Act Amendment Bill.\nThe passage of the three bills is to enable Nigeria meet some international deadlines and obligations.\nAlready, the Senate has passed the bills waiting for concurrence from the House ahead their transmission to the President for assent.\nThe bills are aimed at strengthening Nigeria’s fight against terrorism, crimes and money laundering"
  },
  {
    "headline": "UN Secratary General arrives UN House Abuja, honours Bombing Victims",
    "summarized_story": "Boko Haram Terrorists had attacked the UN House Abuja on the 26th of August 2011 in what was a first suicide attack by the group anywhere in the country.\n23 People died in the attack while several others were injured.\nIt took the Federal Government a few years after the attack to rebuild the UN House.\nThe United Nations ahs since returned its operations to the house and the visit of Mr Guteres is an indication of the confidence of the global body in the current efforts by the government to return peace to all parts of the country.\nHe will also lay a wreath at the memorial erected to commemorate the attack and the victims both dead and injured in the attack."
  },
  {
    "headline": "Gruesome Murder of two Soldiers by IPOB/ESN, Callous, despicable -Army -",
    "summarized_story": "Apparently, the soldiers had embarked on the trip to fulfill the traditional rites of conjugating their matrimony, as the very well respected and cherished Igbo tradition demands.\nIronically, the fact that one of the soldiers, Pte Gloria Matthew who hails from Nkwerre LGA of Imo state, has an ethnic affiliation with the good people of South East Nigeria did not prevail on the sensibility of the dissidents.\nThis gruesome murder, in which they did not spare even their own child, clearly depicts callousness, impenitence and is indisputably, a brazen act of terrorism perpetrated by IPOB/ESN.\nWhile we deeply condole with the families, relations and close associates of the victims, the NA has commenced investigation to unmask and bring the criminals to book.\nMembers of the public are please enjoined to oblige security agencies actionable information that will lead to the arrest of these criminals."
  },
  {
    "headline": "EU Targets Russian Oil, Banks as Moscow’s Ally Belarus Stages Army Drills",
    "summarized_story": "The EU has yet to target Russian natural gas, used to heat homes and generate electricity across the bloc.\nHis comments came after the ministry said it had disabled six railway stations in Ukraine used to supply Ukrainian forces with Western-made arms in the country’s east.\nThe ministry also said it had hit 40 Ukrainian military targets, including four depots storing ammunition and artillery weapons.\nRussian forces turned their heaviest firepower on Ukraine’s east and south after failing to take Kyiv, the capital, in the opening weeks of the war.\nThe governor of the eastern Luhansk region, Serhiy Haidai, said two civilians had been killed and two wounded in the past 24 hours, adding that Russian forces had shelled residential areas 34 times."
  },
  {
    "headline": "North Korea Launches Ballistic Missile in 14th Test This Year",
    "summarized_story": "North Korea fired a ballistic missile Wednesday, Seoul said, a week after Kim Jong Un vowed to boost Pyongyang’s nuclear arsenal and just days before the South inaugurates a new, hawkish president.\nNorth Korea fired the ballistic missile at 12:03 pm (0303 GMT), Seoul’s Joint Chiefs of Staff said, likely from the Sunan Airfield near Pyongyang, the site of previous recent ICBM tests.\nRepeated negotiations aimed at convincing Kim to give up his nuclear weapons have come to nothing.\nUS President Joe Biden is due to visit South Korea later this month to meet with Yoon.\nIt is “virtually impossible” for the Security Council to sanction North Korea — which has supported Russia’s attack on Ukraine — due to Moscow’s veto power, said Cheong Seong-chang of the Center for North Korea Studies at the Sejong Institute."
  },
  {
    "headline": "Social Conflicts Threatening ECOWAS’ Integration Objectives, Says Buhari",
    "summarized_story": "President Muhammadu Buhari has said the persisting social conflicts in most countries of West Africa are negatively affecting the sub-region’s capacity to achieve integration which he said was the major goal of forming the Economic Community of West African States (ECOWAS).\n“Internal crisis and social conflicts around borders have created a situation where today in our region we will say is passing a season of considerable political, economic and social turmoil.\nHe also stated that, “peace cannot reign in our region if it does not first reign in countries and communities.\nIn all of these, the ideal of an integrated, peaceful and prosperous sub-region remains almost impossible,” he said.\nHe said the federal government was committed to collaborating with the Church and all well-meaning actors in promoting peace and security."
  },
  {
    "headline": "UK Firm Targets 70 Million Nigerians in $500m Medical, Hospitality Investment",
    "summarized_story": "A United Kingdom (UK) based firm, HP Kapital Limited and the FHT Ventures Plc on Tuesday in Abuja, unveiled a multi-billion-naira development-driven intervention plans.\nThe firms said their target was to empower 70 million youths in Nigeria and put an end to medical tourism by wealthy Nigerians.\nRelatedStories No Content AvailableThe Chairman of HP Kapital UK, Mr. Nandishwar Kaushal, disclosed this at a news conference in Abuja.\n“About 10 million youths will become entrepreneurs while 60 million others would be gainfully engaged.\nThe President of Youth Coalition in Nigeria, Ambassador Abdulmumini Ibrahim was at the World press conference on behalf of 70 million Nigerian Youth ."
  },
  {
    "headline": "Nigeria’s Private Refineries’ Operators Groan Under Weight of Crude Scarcity as NNPC Focuses on Export",
    "summarized_story": "As it is, it was learnt that the affected local private companies are currently buying crude from private clusters , which are rarely enough for the required demand.\n“The major challenge here is that the NNPC has chosen to sell crude to foreign refineries and export rather than even giving concession to refineries in the country,” a source told THISDAY.\nIn addition, it was learnt that the local refineries have been engaging the federal government through the NNPC for years which although has pledged support for local refineries, has done it in the breach.\n“What is the justification for supplying foreign refineries when local refineries that require very insignificant quantity are side-lined?” a frustrated operator queried.\nThe local refinery owners are therefore requesting urgent government intervention not to allow the installed facility and investment go to waste."
  }
]