[
  {
    "headline": "Medical experts hail FG’s proposed ban on importation of syringes",
    "summarized_story": "Medical practitioners in the country have commended the proposed move by the federal government to ban the importation of syringes and needles into the country.\nThe Minister of health, Dr. Osagie Ehanire, had said that his ministry is working on a policy that would mandate government-owned health institutions to procure and use syringes manufactured in Nigeria.\nThe Chief Medical director of the Federal Medical Centre, Keffi in Nasarawa State, Dr. Adamu Yahaya, said the ban on importation of syringes into the country will improve Nigeria’s capacity as a nation.\nSpeaking in the same vein, the Head of Clinical Services Federal Medical Centre Abeokuta, Ogun State, Dr. Fedelis Ojeblenu, hailed the proposed policy saying it’s a nice decision by the federal government.\nNigeria has the capacity to manufacture high quality Syringes and Needles for local consumption."
  },
  {
    "headline": "Eight killed in Gombe land tussle, says LG boss",
    "summarized_story": "The Chairman of Shongom Local Government Area in Gombe State, Yohanna Nahari, has said eight persons were killed in a land tussle in the area.\nNahari made this revelation during the weekend, in an interview with our correspondent shortly after a peace parley organised by the Federal Lawmaker, representing Kaltungo/Shongom constituency in the House of Representatives, Simon Karu.\nThe council boss, while appealing to residents to ensure that the land tussle is not revisited, commended the concern of the federal lawmaker in mitigating possible reoccurrence of the violence, adding that justice is a panacea.\nRecall that crisis erupted in some parts of the local government where 50 houses and a woman were burnt due to a land tussle.\nRead AlsoWhen asked the number of people killed during the crisis, Nahari said, “There are casualties, I know those that sustained gunshot injuries."
  },
  {
    "headline": "Buhari’s Speech: We’re concerned with realities on ground, not rhetorics — CAN",
    "summarized_story": "By Luminous Jannamike, ABUJAThe Christian Association of Nigeria, CAN, on Sunday, said it was focused on assessing realities on the ground concerning the living conditions of citizens across the country rather than whether President Muhammadu Buhari’s Democracy Day Speech was either good or bad.\nCAN’s Vice Chairman (Northern Region), Reverend John Hayab, disclosed this in an interview with Our Correspondent in Abuja.\nHayab, who described President Buhari’s Democracy Day address as another effort by his scriptwriters to showcase his score card, maintained that a good speech without concrete actions would not end the insecurity, the sufferings, and the dwindling national cohesion and integration in the land.\nAlso Read: 2023: Tinubu’s posters flood AbujaHe said, “The Democracy day speech of Mr. President was another effort by his scriptwriters to give out to Nigerians his score card.\n“A good speech without concrete action cannot stop the bandits from killing and kidnapping citizens for ransom."
  },
  {
    "headline": "2023: Tinubu’s posters flood Abuja",
    "summarized_story": "A group known as the Disciples of Jagaban (DOJ) which is a merger of 12 political and socio cultural groups working towards the actualization of Tinubu’s presidency come 2023, had recently threatened to sue the APC national leader if he fails to declare and contest the 2023 presidential election.\nNational president of the group, Comrade Abdulhakeem Adegoke Alawuje, described Tinubu as the most qualified politician to vie for the presidency.\nAlawuje described Tinubu as the only trusted politician capable of building on the legacies of President Muhammadu Buhari.\nHe added, “We are supporting Tinubu and calling on him, begging him, inviting him to contest the 2023 presidential election for the benefit of Nigeria and Nigerians.\n“We are out for the Tinubu 2023 project because we love Nigeria and we believe in the progress of this country."
  },
  {
    "headline": "Bandits abduct over 10 people in Kaduna Community",
    "summarized_story": "By Ibrahim wuyoAgain, bandits on Saturday night struck at the residential area of Kofar Gayan -kofar kona in Zaria ,Kaduna state,where they adducted over 10 residents.\nAlthough the Police Public Relations Officer in Kaduna ,Mr.Mohammed Jalige confirmed the latest kidnap incident but said they were still waiting for a comprehensive report, journalists were told that the bandits invaded the community at midnight, forcing their way into people’s houses and threatened them with guns and machetes.\nAn eye witness who said she was allowed by the bandits to stay back and take care of younger children, said about 7 bandits raided their compound speaking in Fulani.\n” We also, saw the bandits bringing out people from neighbouring houses.\nThey took my parents,sisters and brothers but allowed me and my step mother to stay and take care of the children."
  },
  {
    "headline": "Examine yourselves if you are truly honest, faithful — Okowa tells Nigerian leaders",
    "summarized_story": "“As leaders we must truly examine ourselves to be sure that we are truly faithful, loyal and honest and to be sure that we are not serving ourselves by serving some sections and personal interests.\nIt is my prayer that God will give you the strength and wisdom to continue in your service to the people”.\nSpeaker of the Delta State House of Assembly, Chief Sheriff Oborevwori took the Bible reading from Psalm 92:1-10.\nOborevwori who spoke to newsmen moments after the service, assured Deltans of good laws that would promote their well-being.\n“Thanksgiving multiplies our blessings, it preserves and perfects God’s blessings upon our lives and facilitates answers to our prayers.”Vanguard News Nigeria"
  },
  {
    "headline": "Why there is trouble in South- East — Ngige",
    "summarized_story": "Also Read: Democracy Day: Protests sponsored, uncalled for — IdahosaAddressing the participants, Ngige said Buhari has shown friendship to Ndigbo, maintaining that the South East has gotten a fair share of what is due to the zone, especially infrastructure wise.\nSo, the South East is effectively represented to ensure justice is done to our people.\nIt is a work in progress.”The Minister recalled that the Buhari government had paid off all the gratuity and pensions of all the police pensioners in the South East that were neglected since after the war, which no government did before.\nAccording to him, the Governors in the South-East zone received the support even though at the time, the zone was a PDP zone.\n“Infrastructure wise, if you go to the South East, from Enugu-Okigwe and Umuahia-Aba-Port Harcourt expressways, three companies, the Chinese Company, the Arab Contractors and RCC are there."
  },
  {
    "headline": "Biafra: Akwa Ibom monarchs lament alleged intimidation of indigenes by security operatives",
    "summarized_story": "In a press briefing on Sunday, the spokesman of the community, Mr. Victor Udom, expressed worry that security Operatives draw intelligence from a ” biased, mischievous and politically-influenced source adding that such biased intelligence has made the sanitation exercise unsuccessful, leading to arrest and intimidation of innocent people while the real hoodlums are let free.\nHowever, when the Public Relations Officer of the state police Command, SP Odiko Macdon, was contacted, he said the allegation is false and should be ignored.\nHe said ” How is that true?\nOf course, this is totally false.\nThese people (security agents) just arrived there a few days ago and who is giving that kind of report?”"
  },
  {
    "headline": "Invincible hands plotting evil against Zamfara people – Gov Matawalle raises alarm",
    "summarized_story": "Zamfara State Governor, Bello Matawalle, on Saturday, raised the alarm over the increasing insecurity in his State.\nMatawalle said the State of insecurity in Zamfara is worsening at an alarming rate, adding that It was clear that some invincible hands are plotting evil against his people.\nThe governor disclosed this after confirming the bandit attack on Kadawa village, Zurmi Local Government Area, in a special broadcast on Democracy Day [Saturday].\n“Unfortunately, things suddenly took a dramatic turn, and things are getting worse by the day.\nIt’s clear that some invincible hands are plotting evil against our people with the goal of making our State as terrifying as it was in the years gone by."
  },
  {
    "headline": "Buhari govt must arrest killers of Abacha, Abiola",
    "summarized_story": "Femi Fani-Kayode, a former Minister of Aviation, has called on the President Muhammadu Buhari administration to unmask those that were involved in the death of former Head of State, Gen. Sani Abacha and M.K.O Abiola.\nThe Peoples Democratic Party, PDP chieftain also said that such individuals, no matter how highly placed, must be brought to book.\nAccording to Fani-Kayode, as Nigerians are celebrating the immortalisation of M.K.O Abiola, the adjudged winner of the June 12, 1993 presidential election, they should also be demanding arrest and prosecution of his killers.\n“We are celebrating & immortalising MKO Abiola but we are not demanding for the unmasking, arrest & prosecution of those who murdered him,” the politician tweeted.\n“I hereby call on the Buhari administration to open a formal investigation into the murder of MKO Abiola &, no matter how highly placed, to prosecute & bring to justice ANYONE that was involved."
  },
  {
    "headline": "Buhari greets Abubakar at 79",
    "summarized_story": "President Muhammadu Buhari has congratulated former Head of State, retired Gen. Abdulsalami Abubakar, on his 79th birthday.\nHe congratulated the General for another age, appreciating his patriotism and visionary leadership style of always advocating unity, projecting maturity and wisdom on national discourse, and providing a rallying point for the future of the country.\nThe president noted the goodwill that the former Head of State had continued to attract to the country, both at national and international levels.\nHe particularly lauded him for sacrificing his time and resources to reach out to individuals and institutions on the need to work for the growth of the country.\nBuhari prayed for longlife and increase in wisdom, strength for the former military leader whom midwifed return of democracy to the country in 1999."
  },
  {
    "headline": "Herdsmen vs farmers: How FG allowed crisis worsen",
    "summarized_story": "Former President Olusegun Obasanjo has highlighted how the Federal Government paved the way for the crisis between farmers and herders in the country.\nIn the letter, Obasanjo lamented that the crisis which has escalated into criminality has been linked to the Fulani tribe.\nStates like Benue, Nassarawa, Taraba, Ebonyi, Enugu and Oyo States have been the most affected by this crisis.\nJust yesterday, the Benue State Governor, Samuel Ortom, vowed to take actions against killer herders invading the State.\nOrtom had said the time of crying in the State was over because he would take action against the killers."
  },
  {
    "headline": "Ortom to Buhari: No grazing routes in Benue",
    "summarized_story": "By Uja Emmanuel, MakurdiBenue Governor Samuel Ortom has vowed the State will never cede a piece of land as grazing routes.\nHe said the directive by President Muhammadu Buhari that all grazing be open will not stand in Benue.\nWhile speaking in Lagos at the handling over of vehicles to security agencies, President Buhari said grazing across the will open.\nHe said the anti-open grazing law in Benue state is in force and anyone who contravenes it would be arrested and prosecuted.\nHe described the Late Pa Akange as a committed Christian who brought up all his children in a godly way."
  },
  {
    "headline": "Gunmen invade church, kidnap woman Rev Sister in Imo",
    "summarized_story": "By Chris Njoku, OwerriTwo women, including a Reverend sister, were kidnapped at various points in Imo State on Sunday morning.\nIn the first incident, a reverend sister was abducted at Dim na Nume, Isu in Nwangele Council Area of the state few minutes after a kidnap incident took place at Ohii.\nIt was gathered the Reverend Sister, whose identity is not known, was driving when the kidnappers crossed and forced her to stop.\nAn eyewitness said the kidnappers forced her into their get-away car while one entered and drove her car behind.\nSources in the family told our correspondent more than 48 hours after the incident, the kidnappers are yet to make contacts with the family."
  },
  {
    "headline": "Abductors of Ekiti farmer demand N30m",
    "summarized_story": "By Rasaq Ibrahim, Ado EkitiThe kidnappers of a successful farmer at Iyemero Ekiti in Ikole Local Government Area of Ekiti State, Alhaji Jimoh Olodan, have demanded N30 million ransom for his release.\nA community source, who confided in newsmen, on Sunday disclosed the dare-devil kidnappers had contacted the Olodan’s family and demanded N30m as his release clause.\n“They were asking for a sum of N30m, which the family found to be too outrageous and they were not comfortable with such demand.\n“They are running around to be able to raise sum money so that the man can be freed.\nWhen contacted, the Ekiti Police Public Relations Officer, Sunday Abutu, said the Command was not aware of the latest development."
  },
  {
    "headline": "Outcry over Niger Gov wife’s alleged involvement in selling water to residents",
    "summarized_story": "By Justina Asishana, MinnaWife of Niger Governor Dr Amina Abubakar- Bello has drawn the ire of Minna residents over her alleged involvement in selling borehole water to them.\nIt was learnt the Governor’s wife allegedly got N100 million from partners to drill the borehole and get tankers for water supply to prospective customers.\nThe residents alleged while populace is suffering from acute water supply, the Governor’s wife is selling water, which her husband should provide for free.\n“It is Raise foundation project and it has nothing to do with the First Lady.\nIt is just like other interventions that Raise Foundation has been doing like the cancer treatment and VVF."
  },
  {
    "headline": "Money, not sex, freaks me –Angel Emeka, actress",
    "summarized_story": "In this exclusive interview, the single mother of two talked about her career, love, sex and marriage.\nBut Madam Joyce Kanu noticed it was my first time and she consoled me and gave me the courage never to be scared.\nHe needed someone big that can fight Joyce Kanu and I fitted into the character.\nI am not a sex freak; the only thing that freaks me is money.\nThey should be focused and consistent because acting needs a lot of time if you really want to make it in the movie business."
  },
  {
    "headline": "NDDC board: What Niger Delta people want Buhari to do to Akpabio —Comrade Joseph Evah",
    "summarized_story": "Excerpt:Let’s know the latest happening on the Niger Delta Development Commission (NDDC)?\nThe Niger Delta Ministry Minister, Godswill Akpabio is simply exhibiting madness, so we are following him up.\nSo, when he looks at the Niger Delta people he feels and thinks that he can put us in his pocket?\nWe expect President Buhari to sack Akpabio quickly, if Akpabio will not face his Ministry of Niger Delta where there is no money to spend.\nThe Ministry of Niger Delta is dead under Akpabio’s watch, and he is not doing anything about it in Abuja."
  },
  {
    "headline": "Anxiety as Nigeria’s debt burden hits N32.9 trillion",
    "summarized_story": "The figure, released by the Debt Management Office (DMO), includes local and external debt of the federal, state governments and the Federal Capital Territory.\nBetween July 2015 when President Muhammadu and December 2020, Nigeria’s debt rose by approximately N20.8 trillion, according to the DMO.\nThe country’s increasing debt profile is also reflected in the growing cost of debt servicing which has further depleted the nation’s dwindling revenues in recent years.\nWithin the period of 66 months under review, the country spent N10.26 trillion on debt servicing.\nThe huge cost of servicing external debt is also a drain on external reserves."
  },
  {
    "headline": "COVID-19 2nd jab: Fear as first batch of AstraZeneca vaccine expires in few weeks",
    "summarized_story": "At about 11:05 a.m, Dr. Cyprian Ngong, a family physician, Senior Registrar at National Hospital, Abuja, was administered the first dose of the AstraZeneca COVID-19 vaccine in Nigeria, marking the historic commencement of COVID-19 vaccination in Nigeria.\nMeanwhile, a credible source at the PSC hinted that procurement of another batch of AstraZeneca COVID-19 vaccine is not in the plan of the Federal Government, rather the government is considering Johnson and Johnson (J&J) vaccine because of cost, storage facilities and other unique features.\nRecall that NAFDAC, few weeks ago, confirmed J&J COVID-19 vaccine safe for use in Nigeria, after a report by its vaccine committee confirmed that data on the vaccine were robust and met criteria for efficacy, safety and quality.\nMany of them did not know if they were given J&J COVID-19 vaccine or placebo.\nMeanwhile, Dr. Ngong, who was the first to take AstraZeneca COVID-19 vaccine said that he took the second dose of the vaccine after 10 weeks, and he had no reaction."
  },
  {
    "headline": "Armed bandits abduct farmer in Ekiti",
    "summarized_story": "From Priscilla Ediare, Ado-EkitiA farmer, Alhaji Jimoh Olodan, has been abducted by armed men suspected to be bandits in Iyemero Ekiti, Ikole Local Government Area of Ekiti State.\nThe abduction came two months and some days after a farmer, Mr. Isaac Agbanigo, was abducted from a farmstead in Ikere Ekiti, Ikere council of the state.\nAccording to the witness, the kidnappers shot sporadically into the air before taking the farmer to an unknown destination.\nWhen contacted, the Police Public Relations Officer, Ekiti State command, ASP Sunday Abutu, said the police were not aware of the incident.\nAlso, the commandant, Ekiti State Security Network Amotekun, Brig Gen. Joe Komolafe (retd), stated that the corps had not been informed about the incident."
  },
  {
    "headline": "Nigerian Minister, Northern Governor Visit Egypt To Aquire Security Platform For Monitoring People's Calls",
    "summarized_story": "A Nigerian minister and a governor of a northern state recently visited Egypt to get security platforms to monitor people's calls, text messages and other forms of communication.\nThe governor and the minister are both controversial and have also been in the news lately for the wrong reasons.\n\"A minister and a governor went to Egypt this week to get a security platform for monitoring calls of citizens.\nThe internet firewall is a way of having a separate network for the Nigerian Internet that will give the government control over social media platforms such as Twitter and Facebook.\nThe Nigerian government seeks to establish the Nigerian Internet, which it will also control likewise."
  },
  {
    "headline": "Nigerian Minister, Northern Governor Visit Egypt To Aquire Security Platform For Monitoring People's Calls",
    "summarized_story": "A Nigerian minister and a governor of a northern state recently visited Egypt to get security platforms to monitor people's calls, text messages and other forms of communication.\nThe governor and the minister are both controversial and have also been in the news lately for the wrong reasons.\n\"A minister and a governor went to Egypt this week to get a security platform for monitoring calls of citizens.\nThe internet firewall is a way of having a separate network for the Nigerian Internet that will give the government control over social media platforms such as Twitter and Facebook.\nThe Nigerian government seeks to establish the Nigerian Internet, which it will also control likewise."
  },
  {
    "headline": "BREAKING: June 12 Protesters Intercept Busload Of Northerners Going To Lagos, Recover Guns",
    "summarized_story": "A bus conveying some northerners from Gombe State to Lagos has been intercepted in Akure, the Ondo State capital, by the June 12 protesters.\nLocally made guns were found in the bus.\nPHOTONEWS: #June12thProtest Protesters In Ondo Arrest Northerners Traveling From Gombe To Lagos With Locally Made Guns, Hand Them Over To Amotekun Corps pic.twitter.com/fATpQ4XAv1 — Sahara Reporters (@SaharaReporters) June 12, 2021The protesters handed the suspects to the operatives of the security outfit, Amotekun.\nThe suspects are being interrogated."
  },
  {
    "headline": "BREAKING: June 12 Protesters Intercept Busload Of Northerners Going To Lagos, Recover Guns",
    "summarized_story": "A bus conveying some northerners from Gombe State to Lagos has been intercepted in Akure, the Ondo State capital, by the June 12 protesters.\nLocally made guns were found in the bus.\nPHOTONEWS: #June12thProtest Protesters In Ondo Arrest Northerners Traveling From Gombe To Lagos With Locally Made Guns, Hand Them Over To Amotekun Corps pic.twitter.com/fATpQ4XAv1 — Sahara Reporters (@SaharaReporters) June 12, 2021The protesters handed the suspects to the operatives of the security outfit, Amotekun.\nThe suspects are being interrogated."
  },
  {
    "headline": "Ghanaian Man Strangles 25-year-old Nigerian Ex-Girlfriend To Death With Her Braids In Italy",
    "summarized_story": "The police in Milan, Italy have arrested a Ghanaian, George Kyeremeh, for allegedly killing his Nigerian ex-girlfriend identified as Blessing Tunde.\nThe 34-year-old suspect was arrested in the early hours of Friday, by the homicide team of Carabinieri police.\nIt was gathered Blessing in mid-April had broken up with the suspect after a year-long romantic relationship.\nFriends and roommates described the Ghanaian as a jealous lover and both constantly quarrelled over other men in her life.\nMilan Carabinieri police have placed the man in preventive custody at the order of preliminary investigations judge (GIP), Angela Laura Minerva."
  },
  {
    "headline": "Policeman shot dead as gunmen attack Akwa Ibom station",
    "summarized_story": "A police officer was killed on Sunday during an attack by gunmen on Ini divisional police station in Odoro Ikpe, Akwa Ibom state.\nAdvertisementThe gunmen were said to have attacked the police station in the early hours of Sunday.\nOdiko Macdon, spokesman of the Akwa Ibom police command who confirmed the incident, said the security agency arrested one of the gunmen.\nAdvertisementMacdon said the officer killed was confirmed dead at the hospital where he was taken to after being shot.\nUsman Baba, the inspector-general of police (IGP), had launched the ‘Operation Restore Peace’ as part of efforts to end the violence."
  },
  {
    "headline": "Policeman shot dead as gunmen attack Akwa Ibom station",
    "summarized_story": "A police officer was killed on Sunday during an attack by gunmen on Ini divisional police station in Odoro Ikpe, Akwa Ibom state.\nAdvertisementThe gunmen were said to have attacked the police station in the early hours of Sunday.\nOdiko Macdon, spokesman of the Akwa Ibom police command who confirmed the incident, said the security agency arrested one of the gunmen.\nAdvertisementMacdon said the officer killed was confirmed dead at the hospital where he was taken to after being shot.\nUsman Baba, the inspector-general of police (IGP), had launched the ‘Operation Restore Peace’ as part of efforts to end the violence."
  },
  {
    "headline": "We didn't bomb wedding in Niger, says air force",
    "summarized_story": "The Nigerian Air Force (NAF) has denied bombing a wedding in Genu, a town in Rijau LGA of Niger state.\nAdvertisementThere had been reports of an air force jet killing some wedding guests while targeting bandits in Genu.\nBut Edward Gabkwet, NAF spokesperson, told TheCable that the security agency has no record of unintended casualties apart from the bandits.\nHe said the air force got credible information about the location of the bandits and was able to kill them.\n“We found out it was very credible information, so our aircraft were dispatched to the area."
  },
  {
    "headline": "We didn't bomb wedding in Niger, says air force",
    "summarized_story": "The Nigerian Air Force (NAF) has denied bombing a wedding in Genu, a town in Rijau LGA of Niger state.\nAdvertisementThere had been reports of an air force jet killing some wedding guests while targeting bandits in Genu.\nBut Edward Gabkwet, NAF spokesperson, told TheCable that the security agency has no record of unintended casualties apart from the bandits.\nHe said the air force got credible information about the location of the bandits and was able to kill them.\n“We found out it was very credible information, so our aircraft were dispatched to the area."
  },
  {
    "headline": "Family of 8 abducted in fresh attack on Kaduna community",
    "summarized_story": "Gunmen have abducted a family of eight alongside some other residents of Kofar Gayan area of Zaria.\nAdvertisementThe attack comes two days after eight students and two lecturers were abducted at the Nuhu Bamalli Polytechnic, Zaria.\nAccording to NAN, the incident occurred at about 12am on Saturday night around Government Girls Secondary School, Kofar Gayan area of the state.\nNAN quoted Abdullahi Mohammed, a resident of the area, as saying no fewer than 12 people were abducted during the attack.\nKusfa, however, said her parents, as well as some of the kidnapped victims, were later released through the efforts of security men who intercepted the hoodlums."
  },
  {
    "headline": "MultiChoice is increasing its stake in BetKing for $281.5 million",
    "summarized_story": "Seven months after taking up an initial 20% stake in BetKing, South African pay TV operator MultiChoice plans to increase its shareholding in the online gambling company to 49% in a $281.5 million deal.\nBetKing is the trading name of Blue Lake Ventures Limited, a pan-African sports betting and entertainment business with major operations in Nigeria.\nThe value of MultiChoice’s initial investment in BetKing was said to be worth more than $100 million.\nBetKing’s annual statement for the financial year ended December 2020 shows a growth in revenue to $77.9 million, from $54.7 million in the previous year.\nYet, Africa accounts for only 2% of global sports betting revenue."
  },
  {
    "headline": "Nigeria’s Central Bank to launch digital currency before 2022",
    "summarized_story": "Nigeria may pilot an official digital currency in 2021, going by the words of Rakiyat Mohammed, a Central Bank Director in charge of the Information Technology Department, who revealed on Thursday that the banking regulator will soon launch a digital currency.\nA Central Bank Digital Currency (CBDC) represents a country’s official currency in digital form.\nAccording to the CBN director, about 80% of central banks in the world are currently exploring the possibility of issuing central bank digital currency and Nigeria could not be left behind.\nLast year, the Bahamas launched the world’s first central bank digital currency.\nWhen it eventually becomes operational, the digital currency will complement the existing forms of currency in the country and could help reduce the high cost of managing and transferring cash."
  },
  {
    "headline": "What is a VPN and how does it work in Nigeria?",
    "summarized_story": "On the internet, different computers send and receive information between Internet Protocol (IP) addresses.\nBefore turning on my VPN, my device was in Lagos, NigeriaAfter turning on my VPN, my device is in Santo Domingo, Dominican RepublicThe images above show how my location changed from Nigeria to Dominican Republic after turning on my VPN.\nNo monitoring: As we mentioned earlier, your internet service provider (ISP) can see your internet traffic and probably log your browsing history.\nWhat is the difference between a VPN app, a VPN plugin, and a VPN browser?\nAlso, some sites and services look at VPN traffic as suspicious and won’t let you connect."
  },
  {
    "headline": "TECNO CAMON 17 Pro: A Creative Nod to the Selfie and the Selfie Culture",
    "summarized_story": "A few weeks back, TECNO launched the TECNO CAMON 17 Pro smartphone, focusing on the selfie with a 48MP AI selfie camera and 90 Hz super-high refreshing rate at 6.8-inch FHD Screen.\nSo, today, I am going to be sharing the things I love about the Camon 17 Pro.\nThe selfie camera of the Camon 17 Pro is one of the highlights of the phone.\nCamera LAB – The TAIVOS™ Imaging LaboratoryThe TECNO CAMON 17 Pro comes with trademarked TAIVOS technology.\nFurthermore, the TECNO CAMON 17 Pro comes with fast charging so, the TECNO CAMON 17 Pro will be ready to leave when you are."
  },
  {
    "headline": "Fostering Gender Inclusion in Technology with the Bolt Drive4WITech Initiative",
    "summarized_story": "The journey into tech for women in Africa is an ongoing discussion largely influenced by cultural norms and societal expectations concerning gender.\nBolt, an inclusive mobility company, recognises this and as part of efforts to drive participation and inclusion for women in technology, launched the #Drive4WITech (Drive for Women in Tech) initiative to support young women in Africa.\nQ: Among the many applications received, you were selected to intern with Bolt in the #Drive4WITech initiative.\nOluwakorede: I supported the marketing team at Bolt Nigeria.\nI am more equipped to confidently make significant contributions to my future work team."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "From ballot paper to blockchain ledger, can the tech behind Bitcoin heal Nigeria’s democracy?",
    "summarized_story": "Blockchain technology is often tied to the flagship cryptocurrency — Bitcoin.\nIn a Forbes article, Frank Palermo advocated blockchain voting in the US after an alleged hack of the current voting system in 2016.\nIn May 2018, according to NBC News, West Virginians living abroad were able to send their votes in for a primary election with a blockchain voting system.\ni-Elect is a blockchain voting platform with a use case in Nigeria created by blockchain developer and designer Jerry Ojumah.\nIt also says the growing proposals for blockchain elections is borne out of the enthusiasm to improve and modernise elections."
  },
  {
    "headline": "Global Wellness Day: Protecting mental health with technology",
    "summarized_story": "In Africa, mental health resources are scarce, reflecting the weakness of mental health services on the continent.\nA World Health Organization (WHO) fact sheet reveals that mental health disorders, otherwise known as mental health illnesses, vary and come with different presentations.\nNonetheless, a mental health concern becomes a mental health disorder when signs and symptoms cause recurring stress and affect the ability to function.\nProtecting your mental health with technologyImage by Firmbee from PixabayThere are effective strategies to prevent and alleviate the suffering caused by mental health disorders, and technology is one of them.\nMANI attempts to fight stigma, improve mental health literacy, and drive policies that benefit mental health service users and those at risk."
  },
  {
    "headline": "Increase in fintech app installations, Apple Health new features, Plentywaka partners with GUO",
    "summarized_story": "Today, I’m discussingIncrease in fintech app installationsApple Health features for the elderlyPlentywaka partners with GUOIncrease in fintech app installations in Nigeria, South Africa, and KenyaThe global fintech industry recorded impressive growth in 2020.\nThe report reveals that beyond funding, fintech app installations grew by160% in the last quarter of 2020.\nSimilarly, Kenya saw 100% growth, and South Africa 52% growth, in fintech app installations.\nThe economic effects of COVID-19 led to the rise in fintech app installations.\nSource: PlentyWaka TwitterPlentywaka, a Nigerian bus-hailing tech company, has announced its partnership with interstate bus company, GUO Transport, to expand its reach."
  },
  {
    "headline": "World Day Against Child Labour: Obaseki seeks legislation, global action to end menace – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for legislative and decisive actions, as well as increased collaboration among global stakeholders to prevent, prohibit and eradicate child labour in its entirety.\nObaseki made the call in commemoration of the 2021 World Day Against Child Labour, with the theme, “Act now: end child labour!” marked every June 12, by the International Labour Organisation (ILO), and observed across the globe.\nThe governor noted that there is an urgent need for stakeholders to improve efforts in the global fight against child labour in order to save the nine million additional children at risk of being pushed into child labour by the end of 2022 as a result of the coronavirus pandemic, according to a new report by the ILO and United Nations International Children’s Emergency Fund (UNICEF).\nObaseki said his government has strengthened institutions in the state to enforce the Child Rights Law, and ensure that children are protected from abuses, especially child labour, which robs them of their childhood and deprives them of the opportunity to live their lives to the fullest.\n“In sub-Saharan Africa, population growth, recurrent crises, extreme poverty, and inadequate social protection measures have led to an additional 16.6 million children in child labour over the past four years.”..."
  },
  {
    "headline": "We must all work together to sustain democracy, says Edo. Dep Gov – Nigerian Observer",
    "summarized_story": "We must all work together to sustain democracy, says Edo.\nShaibu stated this while addressing a cross section of protesters who were in a peaceful protest to Edo Government House, Benin City.\nHe said that the governor should issue a second proclamation letter which is against the law.\n“After 22 years of democracy, Nigerians are still suffering as the standard of living has gone from bad to worse in the country.\nWe enjoy freedom of speech but not freedom after speech."
  },
  {
    "headline": "Obaseki salutes Nigerians on Democracy Day, urges eternal vigilance to consolidate ideals – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, felicitates with Nigerians, as the country marks this year’s Democracy Day.\nThe people and the government hold the key to the solution of our problems and we must work together to make our country truly great.\nWe have a ready example in Edo State, which today is a beacon of hope for democracy.\nIt takes eternal vigilance to keep our country one and prosperous.\nHappy Democracy DayLong live the Federal Republic of NigeriaGodwin N. ObasekiGovernor, Edo State."
  },
  {
    "headline": "Obaseki congratulates Osikhekha, Ibrahim, others on Guild of Editors roles – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has felicitated with the reelected President of the Nigerian Guild of Editors (NGE), Mr. Mustapha Isah Osikhekha, on retaining the highly exalted position in the Guild at the recent NGE convention in Kano.\nThe governor also congratulated two other Edo-born editors, Mr. Iyobosa Uwugiaren, who was returned as General Secretary of the Guild and Mr. Umoru Ibrahim, a member of the Guild’s Standing Committee representing the North.\n“As a worthy son of Edo State, we celebrate his new feat and encourage him to keep the spirit of excellence alive.\nAt a time that Edo youths are seeking for mentors and sources of inspiration, the feat singles Osikhekha out as someone worth emulating.\nUmoru Ibrahim, also from Edo State, is a member of the Guild’s Standing Committee representing the North."
  },
  {
    "headline": "JUNE 12: Late Head of State Murtala’s son joins APC four years after quitting politics",
    "summarized_story": "ADVERTISEMENTA son of a former Nigerian Head of State, Murtala Muhammad, Abba Risqua, on Saturday, joined the ruling All Progressive Congress (APC) at an occasion to mark the Democracy Day in Kano.\nMr Risqua joined the ruling party alongside former governorship candidates of the People Redemption Party (PRP) and Green Party of Nigeria (GNP), Salisu Sagir and Andulsalam Zaura, respectively.\nThe defection ceremony , which took place at Kano Pillars Stadium, Sabon-Gari, was hosted by Governor Abdullahi Ganduje.\nOther defectors include a former federal lawmaker, Aliyu Datti, who represented Kiru/Bebeji federal constituency.\nMr Ganduje and the acting APC national chairperson, Mai Mala Buni, represented by Farouk Aliyu, received the defectors."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Herders killings: Ortom says time for crying is over, vows to take action",
    "summarized_story": "Governor of Benue State, Samuel Ortom, has said the time has come for his people to stop crying and take action against killer herders in the state.\nHundreds of people have been killed in Benue the by suspected Fulani herdsmen in the past few days alone, while thousands have been displaced.\n“A few weeks ago, Benue stakeholders met and gave this administration the mandate to activate and implement the Community Volunteer Guards Law enacted in 2000,” he said.\n“We have already commenced the process of recruiting responsible people of 50 years and below into the Volunteer Guards.\n“This law has come to stay and no amount of intimidation can make us repeal it."
  },
  {
    "headline": "NDLEA intercepts 100,000 bottles of Codeine Syrup at Onne Port",
    "summarized_story": "National Drug Law Enforcement Agency, NDLEA, at the Onne seaport, Port Harcourt, Rivers State, has seized about 100,000 bottles of codeine syrup with a total weight of 15,325kilograms.\nGeneral Mohamed Buba Marwa (Retd) has however hailed the synergy among the various government agencies at the Onne port and charged them not to rest on their oars as they daily work hard to keep Nigeria safe.\nHe particularly commended the Commander, officers and men of the Port Harcourt Port Command and their Abuja airport Command counterparts for their vigilance and commitment to the task of ridding Nigeria of illicit drugs.\n“The damage 100,000 bottles of codeine would have done to our youths if they had slipped through the port to our villages, towns and cities is unimaginable.\n146.95 kilograms of khat could have done the same damage if allowed to go into our streets."
  },
  {
    "headline": "Buhari’s anti-corruption failure fuelling insecurity, undermining democracy – Report",
    "summarized_story": "It then gave an outline, including improved financial centralisation, referring to TSA and IPPIS; and higher conviction rates by anti-corruption agencies.\nCorruption and insecuritySince Mr Buhari came to power in 2015, insecurity has intensified and spread, affecting virtually all parts of the country.\nYet President Buhari has done little to change their calculus, hold them accountable or exert strong oversight over their activities.”“Under President Buhari, security sector corruption has become both a cause and a consequence of rising insecurity across the country.\n“90% of Nigeria’s 360-plus progovernment NGOs have started operating since President Buhari took office, a correlation that suggests many enjoy high-level political support,” CDD claimed.\nIt also called on Nigeria’s international partners to prioritise anti-corruption in their engagements and assistance toward the African nation."
  },
  {
    "headline": "National Assembly shouldn’t be afraid of referendum – Ozekhome",
    "summarized_story": "BY EMEKA EJEREConstitutional lawyer and human right activist, Mike Ozekhome on Saturday wondered why the National Assembly was wary of ideas like ‘referendum’ and ‘a people’s constitution’.\nHowever, the Buhari administration has maintained that the ongoing constitutional review being undertaken by the National Assembly will be enough to align the 1999 constitution with people’s expectation, a notion rejected by critics like Ozekhome.\nAnd I have never underrated the role of the National Assembly.\nBut the National Assembly itself, on the other hand, does not seem to understand what it ought to do,” the Senior Advocate of Nigeria said.\nI don’t know why they are afraid of a referendum or a people’s constitution."
  },
  {
    "headline": "Why Amotekun Will Transform Into State Police – Akeredolu",
    "summarized_story": "Governor Oluwarotimi Akeredolu of Ondo State on Saturday said that the State Security Network codenamed Amotekun Corps would eventually transform into a State Police overtime.\nSpeaking at the 2021 Democracy Day lecture held in Akure, the state capital, the governor also said that he does not believe in secession.\nAt the event held at the International Event Centre (DOME), Akeredolu said the local government could not be absolutely autonomous and that the Federal Government should have no control, whatsoever, over how a local government is run in a state of the Federation.\nHe said, “Let every state determine the number of local governments it wishes to have for effective administration.\nIt does not make any economic sense to create as many local governments as the politics of revenue sharing will permit."
  },
  {
    "headline": "Why Amotekun Will Transform Into State Police – Akeredolu",
    "summarized_story": "Governor Oluwarotimi Akeredolu of Ondo State on Saturday said that the State Security Network codenamed Amotekun Corps would eventually transform into a State Police overtime.\nSpeaking at the 2021 Democracy Day lecture held in Akure, the state capital, the governor also said that he does not believe in secession.\nAt the event held at the International Event Centre (DOME), Akeredolu said the local government could not be absolutely autonomous and that the Federal Government should have no control, whatsoever, over how a local government is run in a state of the Federation.\nHe said, “Let every state determine the number of local governments it wishes to have for effective administration.\nIt does not make any economic sense to create as many local governments as the politics of revenue sharing will permit."
  },
  {
    "headline": "Emaimo Bags ‘Most Outstanding Rector’ Award",
    "summarized_story": "Rector of the Federal College of Dental Technology and Therapy, Enugu (FEDCODTTEN), Dr. John Emaimo, was on Thursday conferred with the 2020/2021 Most Outstanding Rector of the Year Award in Nigeria by the Association of Southern Nigeria Students (ASONIS)AdvertisementsConferring the award on the rector, in the college premises, the group said the selection of the rector for the award followed a painstaking examination of activities and profiles of various rectors that it received.\nSo many names were forwarded but Dr. Emaimo represents a father, a mentor and a great administrator because he has done so much for the Dental College.\nReceiving the award, Dr. Emaimo said he was short of words, noting that he did not know that people were watching and taking note of the trends in the college under his watch.\nADVERTISEMENTAccording to Dr. Emaimo, the college dedicates time to mentoring students and development of manpower for the health sector.\nThis is the first federal degree awarding institution in Enugu State and in the future, it becomes only a degree awarding institution and the college is focusing on critical areas of need,” Emaimo said."
  },
  {
    "headline": "Emaimo Bags ‘Most Outstanding Rector’ Award",
    "summarized_story": "Rector of the Federal College of Dental Technology and Therapy, Enugu (FEDCODTTEN), Dr. John Emaimo, was on Thursday conferred with the 2020/2021 Most Outstanding Rector of the Year Award in Nigeria by the Association of Southern Nigeria Students (ASONIS)AdvertisementsConferring the award on the rector, in the college premises, the group said the selection of the rector for the award followed a painstaking examination of activities and profiles of various rectors that it received.\nSo many names were forwarded but Dr. Emaimo represents a father, a mentor and a great administrator because he has done so much for the Dental College.\nReceiving the award, Dr. Emaimo said he was short of words, noting that he did not know that people were watching and taking note of the trends in the college under his watch.\nADVERTISEMENTAccording to Dr. Emaimo, the college dedicates time to mentoring students and development of manpower for the health sector.\nThis is the first federal degree awarding institution in Enugu State and in the future, it becomes only a degree awarding institution and the college is focusing on critical areas of need,” Emaimo said."
  },
  {
    "headline": "Atiku Group Warns APC Against Crippling Nigeria’s Democracy",
    "summarized_story": "A political group loyal to former Vice President Atiku Abubakar, Atiku Support Organisation (ASO) has warned the ruling All Progressives Congress (APC) as well as National Assembly leaders not to destroy Nigeria’s hard-fought democracy.\nAdvertisementsThe group said this on Saturday in a statement signed by its national publicity secretary, Dr El Mo Victor, a copy of which was sent to LEADERSHIP.\nThe group asked Senate President, Ahmad Lawan, and Speaker of House of Representatives, Femi Gbajabiamila, to pass the amended Electoral Act into law without further delay.\nADVERTISEMENT“Therefore, we demand the immediate passage of the amended electoral act by @DrAhmadLawan and @Femgbaja-led Assembly to strengthen democracy in Nigeria and return the power of the ballots to the people of Nigeria.\nNigeria cannot afford another bloodbath during elections.”The group added, “We wish to also call on the APC and Buhari-led government to desist from crippling and sabotaging democracy in Nigeria for selfish reasons."
  },
  {
    "headline": "Police confirm gunmen attack Zaria again, abduct some residents —",
    "summarized_story": "Barely two days after an attack on Bamalli Polytechnic, Zaria, Kaduna state, unknown gunmen have again attacked Kofar Gayan and Kofar Kona areas of Zaria and abducted some residents.\nASP Mohammed Jalige, Police Public Relations Officer, Kaduna State Command, who confirmed the incidence, said he was trying to gather details to update the press.\nHowever, an official of Kaduna State Vigilance Service (KadVS), who spoke to the News Agency of Nigeria (NAN) on condition of anonymity Sunday in Zaria, said the incident occurred between 12.01 and 1.00am on Saturday night.\nThe official, who did not give details on the exact number of people abducted by the kidnappers, said the incident occurred around Government Girls Secondary School, Kofar Gayan.\nThe attacked is coming barely two days after similar incident at Nuhu Bamalli Polytechnic, Zaria, where one student was killed, while two lecturers and eight students were abducted."
  },
  {
    "headline": "Gov. Obaseki seeks legislation, global action against child labour —",
    "summarized_story": "Godwin Obaseki of Edo has called for legislation, as well as increased collaboration among global stakeholders, to prevent, prohibit and eradicate child labour in its entirety.\nObaseki made the call in commemoration of the 2021 World Day Against Child Labour, with the theme, “Act now: end child labour!” marked every June 12, by the International Labour Organisation (ILO) and observed across the globe.\n“As the World commemorates the International Day Against Child Labour, it is imperative to reiterate the need for legislation and collaborative efforts among global stakeholders.\n“This includes civil society groups, international organisations, organised private sector and governments at all levels, to bring an end to the global menace of child labour, which currently affects over 160 million children worldwide”, Obaseki said.\n“In sub-Saharan Africa, population growth, recurrent crises, extreme poverty, and inadequate social protection measures have led to an additional 16.6 million children in child labour over the past four years”, the two organisations said."
  },
  {
    "headline": "NRC begins Lagos-Ibadan service Tuesday — Daily Times Nigeria",
    "summarized_story": "The Nigerian Railway Corporation (NRC) says it will begin full operation of the standard gauge railway service from Lagos to Ibadan on Tuesday.\nAccording to him, the Lagos Ibadan Train Services will now be available in the mornings from Tuesday.\n“The updated time table for Tuesday to Friday is as follows: Lagos to Ibadan: 8:00 a:m from Mobolaji Johnson Station at Alogo megi Ebute – Meta Lagos.\nAlso the train will take off from Ibadan to Lagos: 8:00 am from Obafemi Awolowo Station at Moniya.\nHe said that the Alagomeji, Abeokuta, and Moniya were still the stop stations of the Lagos Ibadan Train Services."
  },
  {
    "headline": "Bauchi Governor offers reason few days after dissolving cabinet — Daily Times Nigeria",
    "summarized_story": "By Samuel Luka, BauchiGovernor Bala Mohammed of Bauchi state has given reasons regarding the recent dissolution of 21 Commissioners, including his Chief of Staff and the Secretary to the State Government (SSG).\nRecalled that the Governor had earlier in the week dissolved 21 Commissioners including his Chief of Staff, Secretary to the State Government (SSG) and others, sparing only few aides without attaching any reason to the action.\nThe Governor however, noted that some of the dissolved cabinet members, though very educated but were politically inexperienced, most especially bearing in mind that 2023 election is nearing.\n“We dissolved them to enable us watch our back and to restrategize, because we are about to enter politicking after two years.\nThe Governor who recalled that, as an opposition party then, the Peoples Democratic Party (PDP) won the governorship election in Bauchi, said they a lot of challenges because they met the state in shambles."
  },
  {
    "headline": "June 12: Fani-Kayode hails Buhari for immortalising MKO Abiola",
    "summarized_story": "A former Aviation Minister and foremost PDP chieftain, Chief Femi Fani-Kayode has praised President Muhammadu Buhari for immortalising the late winner of the 1993 presidential elections, Chief Moshood Kashimawo Abiola, MKO, by renaming June 12 as Nigeria’s democracy day.\nBuhari had in a nationwide broadcast last year renamed June 12 a National democracy day.\nJune 12 used to be a special day to commemorate MKO Abiola in Lagos and in some southwestern states in Nigeria until it was renamed by President Buhari.\nJune 12 became significant in the political history of Nigeria after the one and only former military president of Nigeria, General Ibrahim Badamosi Babangida Rtd.\nNo matter what u say or think about Buhari, he did well on this one!” He noted."
  },
  {
    "headline": "June 12: Fani-Kayode hails Buhari for immortalising MKO Abiola",
    "summarized_story": "A former Aviation Minister and foremost PDP chieftain, Chief Femi Fani-Kayode has praised President Muhammadu Buhari for immortalising the late winner of the 1993 presidential elections, Chief Moshood Kashimawo Abiola, MKO, by renaming June 12 as Nigeria’s democracy day.\nBuhari had in a nationwide broadcast last year renamed June 12 a National democracy day.\nJune 12 used to be a special day to commemorate MKO Abiola in Lagos and in some southwestern states in Nigeria until it was renamed by President Buhari.\nJune 12 became significant in the political history of Nigeria after the one and only former military president of Nigeria, General Ibrahim Badamosi Babangida Rtd.\nNo matter what u say or think about Buhari, he did well on this one!” He noted."
  },
  {
    "headline": "Six killed, 10 injured in Bauchi-Kano Highway crashes",
    "summarized_story": "Ten other people were said to have sustained varying degrees of injuries in the crash that involved 16 people.\nThe crash happened at Gumero Village about 15 kilometres to Kafin Madaki, Ganjuwa Local Government Area, along Bauchi – Kano Highway in Bauchi State.\nThe 16 people comprise five male adults, seven female adults, three male children and one female child.\n“Those who lost their lives include six people made up of four male adults, one female adult and one male child.\nThey comprise of one male adult, six female adults, two male children and one female child.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Six killed, 10 injured in Bauchi-Kano Highway crashes",
    "summarized_story": "Ten other people were said to have sustained varying degrees of injuries in the crash that involved 16 people.\nThe crash happened at Gumero Village about 15 kilometres to Kafin Madaki, Ganjuwa Local Government Area, along Bauchi – Kano Highway in Bauchi State.\nThe 16 people comprise five male adults, seven female adults, three male children and one female child.\n“Those who lost their lives include six people made up of four male adults, one female adult and one male child.\nThey comprise of one male adult, six female adults, two male children and one female child.” PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Djokovic clinches French Open title, 19th Grand Slam",
    "summarized_story": "By AbankulaWorld number Novak Djokovic clawed its way back from the dead to beat Greek star Stefanos Tsitsipas to win the French Open title on Sunday.\nIt was his second title in Paris and his 19th Grand Slam, one short of the record equalling 20 titles held by Roger Federer and Rafa Nadal.\nDjokovic was almost written for dead in the finals, when Tsitsipas won the first two sets, one by tie- break, the second by humbling the Serbian 6-2.\nBut Djokovic stepped up his act and really dug deep to clinch the third set and the other two sets.\nAs a commentator remarked, when it comes to strong mentality and saving energy for latter sets, there’s no competition for Novak Djokovic."
  },
  {
    "headline": "Mikel Obi endorses Yahaya Bello",
    "summarized_story": "By Lizzy OkojiNigerian Footballer, Mikel Obi, has pledged support for Yahaya Bello’s political aspirations as he visited the Kogi governor on Sunday in Abuja.\nObi said he was hopeful that Yahaya and himself could work together as a team to achieve success.\nResponding, Bello thanked Obi for the visit and his pledge to support the course for youth leadership.\nThe governor noted that when there was political stability in a country, economic prosperity and development would be achieved.\n“In the western world, because they have political stability that is why there is safety and security,” the governor said."
  },
  {
    "headline": "Breaking: Lagos-Ibadan train service begins Tuesday",
    "summarized_story": "By Aisha Cole/LagosScheduled train service between Lagos and Ibadan will begin on Tuesday, twice a day, the Nigerian Railway Corporation (NRC) said.\nThe service will mark the full operation of the standard gauge service since the formal commissioning by President Buhari last week.\nAccording to him, the Lagos Ibadan Train Services will now be available in the mornings from Tuesday.\n“Also the train will take off from Ibadan to Lagos: 8:00 am from Obafemi Awolowo Station at Moniya.\nHe said that the Alagomeji, Abeokuta, and Moniya are the stop stations of the Lagos Ibadan Train Service"
  },
  {
    "headline": "Yet Again! Obasanjo Writes Letter To Buhari, Lists 4 Avoidable Calamities",
    "summarized_story": "Former Nigerian President Olusegun Obasanjo has sent another open letter to President Muhammadu Buhari regarding the country’s current predicament.\nFull letter to President BuhariDear President and General Buhari,I am constrained to write to you this open letter.\nBut the issue I am addressing here is very serious; it is the issue of life and death for all of us and for our dear country, Nigeria.\nFor over ten years, for four of which you have been the captain of the ship, Boko Haram has menacingly ravaged the land and in spite of government’s claim of victory over Boko Haram, the potency and the activities of Boko Haram, where they are active, remain undiminished, putting lie to government’s claim.\nAnd Boko Haram will not go away on the basis of sticks alone, carrots must overweigh sticks."
  },
  {
    "headline": "Your Hatred For Biafra Irrelevant, Referendum Must Take Place – Kanu Tells Leaders",
    "summarized_story": "Mazi Nnamdi Kanu, the leader of the outlawed Indigenous People of Biafra (IPOB), has said that some leaders in the South-East and South-enmity South’s for Biafra’s reality is meaningless.\nAccording to him, the only thing that matters is a referendum in which Biafra agitators can choose whether to remain part of Nigeria or form their own country.\nMembers of the National Assembly, according to Nnamdi Kanu, are terrified of allowing a referendum because they fear actualization of the agitated Biafra nation.\nThe tweet reads, “The narrative that Leaders of the so-called SouthSouth & Southeast or even those in the National Assembly are against #Biafra is irrelevant.\n“What’s relevant is the POPULAR WILL of the people, which can be determined only through a REFERENDUM."
  },
  {
    "headline": "June 12: Why We’re Not Happy With FG, MKO Abiola’s Family",
    "summarized_story": "MKO Abiola’s family members have expressed their dissatisfaction with the federal government.\nAccording to NewsDirect, the family’s representative, Rahaman Abiola, stated this position on Saturday, June 12 in Ogun state, saying the government had failed to uphold commitments made years ago.\nOn Saturday, Abiola alleged that the family has yet to benefit anything from the government in Abeokuta, the capital of Ogun state.\nSo far so good, we have not benefitted anything from the federal government.”Abiola said: “Ogun state government will always come with all the machinery to mark the day.\nGovernor comes here always to pay solitary to the house and empower us to make sure June 12 is celebrated all the time.”"
  },
  {
    "headline": "How Buhari Plans To Secretly Visit Maiduguri To Avoid Imminent Protest, Boos Over His Poor Performance",
    "summarized_story": "Nigeria’s President Muhammadu Buhari is planning a secret visit to Maiduguri, the capital of Borno, this week, according to NewsDirect.NG.\nAccording to a source in the Presidency, the planned visit is being kept a secret since the President is expected to elicit protests in the volatile country.\nBuhari promised to defeat Boko Haram before his victory in 2015, but that promise has yet to be fulfilled six years later.\n“Buhari has a hidden plan to visit Maiduguri this week,” the source claimed, “but they don’t want to broadcast it to avoid a situation where Maiduguri protesters disgrace him.”When Buhari visited Maiduguri in February 2020 to “sympathize” with the city’s population following recent Boko Haram attacks, protesters booed him.\nAnd on Friday, he gave another interview to NTA, making contentious statements in both interviews, as is his custom."
  },
  {
    "headline": "Breaking: Again, Nigeria’s Adesanya down Italian opponent, retains UFC middleweight title",
    "summarized_story": "UFC middleweight champion Israel Adesanya cruised to victory over Marvin Vettori as he retained his undisputed 185-pound title in the main event of UFC 263 in Glendale, Arizona.\nThe pair had previously met, when Adesanya claimed a split-decision victory over Vettori in April 2018 in the Nigerian-born Kiwi’s second UFC bout.\nBut in Saturday night’s rematch Adesanya, 31, showed his class with a virtuoso performance as he picked apart the Italian over the full five-round championship duration at the Gila River Arena.\nAfter the result was officially announced, Adesanya dedicated his victory to his teammate Fau Vake, a promising up-and-coming fighter who died in May from injuries sustained in an alleged attack in Auckland, New Zealand.\n“I just want to say Fau Vake, Fau Vake, Fau Vake, I love you, man… This fight I dedicate to you, Fau,” he said."
  },
  {
    "headline": "Breaking: Eriksen wakes up after slumping on the pitch, Denmark vs Finland Euro 2020 game continues",
    "summarized_story": "English referee Anthony Taylor called medics on to the pitch and Eriksen underwent prolonged treatment, including CPR.\nTeam-mates formed a shield around the former Tottenham player, while fans inside the stadium were clearly stunned by the incident, with some pictured in tears.\n“Eriksen is awake and his condition remains stable,” the Danish FA later said.\nA statement read: “Following the request made by players of both teams, UEFA has agreed to restart the match between Denmark and Finland tonight at 20:30 CET.\nEriksen’s club, Inter, tweeted: “Forza Chris, all of our thoughts are with you.”Former team Tottenham said: “Get well soon, Christian."
  },
  {
    "headline": "Pictures: Mr Macaroni joins #June12thProtest in Lagos",
    "summarized_story": "PreviousSadiya Umar Farouq: On the podium of honour"
  },
  {
    "headline": "Oyegun to Buhari: Don’t wait till agitations for restructuring becomes threat to national unity -NigPilot",
    "summarized_story": "Former governor of Edo State and One-time National Chairman of the All Progressives Congress, APC, John Odigie Oyegun, has warned President Muhammadu Buhari and the leadership of the ruling party not to wait till agitations from different sections of the country on restructuring snowball into a threat to national unity before addressing them.\n“It is vital that it is in fact, mandatory in the interest of the survival of our nation, that these issues be addressed.\nLukman, said APC leaders have been working to address some of the foundational issues of democracy and that the book “is a contribution to support initiatives of our leaders.\nLike President Muhammadu Buhari himself has acknowledged, there are no doubt challenges facing the country, but no administration since 1999 has succeeded in completing projects, whether initiated by previous or current governments.\n“Just on Thursday, June 10, 2021, President Buhari commissioned the Lagos – Ibadan railway, a project started and completed by his administration."
  },
  {
    "headline": "STAKEHOLDERS CANVASS FOR MORE PARTICIPATION OF DIASPORANS IN DEMOCRATIC PROCESS -NigPilot",
    "summarized_story": "A cross-section of stakeholders across the globe has canvassed for more inclusion and participation of Nigerians in the Diaspora in the democratic process in Nigeria.\nArkwright, who was one of the panelists, however, listed four areas of improvement to include an increase in representation of women and youth in the democratic process in Nigeria., reduction in take-home pay of National Assembly and Political office holders, reduction in the influence of money in Politics and adequate representation of all ethnic groups, especially the minority groups in the electoral and democratic process.\nCommending the role of NIDCOM so far, the envoy emphasised the role of the Nigerians in the Diaspora and their contributions to national development, stresing that they must be involved in the democratic process.\nShe echoed the need for diaspora voting, adding that the issue was exhaustively tabled at the recent Public hearing on Constitutional amendment.\nMr Bayo Adedosu, a resident in Canada, stressed the need for Nigerians to show patriotism, while calling on leaders to be accountable."
  },
  {
    "headline": "N’Assembly won’t hesitate to demand arrest of govt. officials that fail to account for public funds – Lawan -NigPilot",
    "summarized_story": "The report was laid on Tuesday this week by the Public Accounts Committee Chairman, Matthew Urhoghide (PDP, Edo South) during plenary.\nLawan said, “The Public Accounts Committee normally works with the report of the Auditor-General for the Federation.\nThe Public Accounts Committee is supposed to invite the agency to come and explain what the Auditor-General is reporting.\n“[And] I’m sure that our public accounts committee has been doing its best.\nIn fact, in the constitution, the first arm of government mentioned is the legislature before the executive arm, then the judiciary."
  },
  {
    "headline": "AESID condemns renewed Izzi/Ikwo communal hostility in Ebonyi -NigPilot",
    "summarized_story": "Association of Ebonyi State Indigenes in the Diaspora (AESID) has condemned the renewed communal clashes between the people of Enyibichiri, Izzi in Abakaliki Local Government Area and Echialike, Ikwo, Ikwo Local Government Area of Ebonyi state over a lingered land dispute, demanding an end to the hostility.\nThe Ebonyi indigenes also condemned in totality the abduction of some Izzi children by fighters alleged to be from the Echi-Alike area.\n“Though we had condemned this renewed hostilities, we find this latest news of abduction of under-aged children most perturbing.\nWhen will Umahi return our beloved state to the peaceful path he met it and end these persistent bloodsheds?\nThis, AESID believes is the best way to go for any meaningful development to be initiated and sustained in their local communities.”"
  },
  {
    "headline": "Banditry: Things Are Getting Worse By The Day In Zamfara – Gov Matawalle",
    "summarized_story": "Zamfara State Governor Bello Matawalle on Saturday said the state of insecurity in the state is worsening at an alarming rate.\nHe made the remark after confirming the bandit attack on Kadawa village, Zurmi Local Government Area in a special broadcast on Democracy Day.\nAccording to the Governor, the bandits killed “many innocent people.”Locals told Channels Television the toll had risen as high as 70 as of Saturday afternoon.\n“Unfortunately, things suddenly took a dramatic turn, and things are getting worse by the day.\n“My administration has resolved to begin implementing the recommendations of the MD Abubakar-led Committee on Finding Solutions to Banditry in Zamfara State as a next step in addressing this vexing problem."
  },
  {
    "headline": "Uber Driver, Two Traffickers Arrested With Cocaine At Lagos Airport",
    "summarized_story": "An Uber driver and two other traffickers have been arrested by operatives of the National Drug Law Enforcement Agency (NDLEA), with different quantities of cocaine at the Murtala Muhammed International Airport, MMIA, Lagos.\nThis was disclosed in a statement issued on Sunday by the Director, Media & Advocacy, NDLEA Headquarters, Femi Babafemi.\nWhen the package was searched, 150grams of cocaine concealed inside two pieces of air freshener were discovered.\nAlso on Friday, June 11, a male passenger, Udogwu James Johnson on Qatar Airlines from GRU in Brazil was arrested at D-arrival hall, MMIA, Lagos with nine wraps of cocaine that weighed 300grams in his underwear.\nGen. Mohamed Buba Marwa (Retd) has commended the MMIA and Lagos state Commands of the agency for the feats while charging the officers and men of the two Commands not to rest on their oars."
  },
  {
    "headline": "Adesanya Back To His Best In UFC 263 Win Over Vettori",
    "summarized_story": "Nigerian-born Israel Adesanya was back to his brilliant best Saturday, defeating challenger Marvin Vettori with a show of superior striking and defending his middleweight title at UFC 263 in Glendale, Arizona.\n“I didn’t feel any threat at all,” said Adesanya, 31, after getting a comfortable unanimous decision.\nAdesanya suffered the first loss of his MMA career in March after moving up a division and finding himself outmuscled.\nAdesanya dedicated the fight to his friend and laid his belt down in the middle of the cage in tribute.\nThe UFC described the Arizona event as a sellout, much like the open-to-the-public events in Jacksonville, Florida, and Houston, Texas."
  },
  {
    "headline": "Democracy Day: Use Of Teargas Was In Line With Global Standards – Police",
    "summarized_story": "The Nigerian police on Saturday justified its use of tear gas on protesters who took to the streets to mark Democracy Day by voicing their grievances against the government of the day.\nAccording to police spokesman, Mr Frank Mba, the actions of officers were in line with international best practices of dispersing violent protests.\nThe police shot teargas at protesters in Lagos and Abuja.\n‘An isolated case’According to Mr Mba, the use of teargas was an isolated case in Abuja where protesters turned violent.\n“We had an isolated case in Abuja where some of the protesters became unruly and in line with international best practices, police fired teargas at them,” he said."
  },
  {
    "headline": "Brazil President Bolsonaro Fined For Violating COVID-19 Rules",
    "summarized_story": "Brazilian President Jair Bolsonaro was fined $100 Saturday for violating Covid-19 containment measures in Sao Paulo state by failing to wear a face mask and provoking huge crowds at a motorcycle rally for supporters.\nBolsonaro has repeatedly clashed with Doria and other governors over measures against Covid-19, which has claimed nearly 485,000 lives in Brazil, second only to the United States.\nThe president regularly criticizes stay-at-home measures and face masks, instead touting medications such as chloroquine and hydroxychloroquine despite studies showing they are ineffective against Covid-19.\nAddressing a giant crowd of flag-waving supporters, Bolsonaro renewed his comments against face masks, saying he planned to order mask requirements be lifted for people who have been vaccinated against Covid-19.\nState officials said they had fined Bolsonaro, his congressman son, Eduardo, and Infrastructure Minister Tarcisio Gomes for failing to wear masks and observe social distancing measures at the rally."
  },
  {
    "headline": "Police Repell Robbery Attack, Kill Unspecified Number of bandits In Bakura LGA, Zamfara",
    "summarized_story": "Police in Zamfara have neutralised Unspecified number of armed robbers suspected to be bandits in Bakura local government area of the stateThe criminals were killed near Dogon Karfe village when they blocked the ever busy Sokoto – Gusau road with the intention to robb innocent commuters of their valuablesThe bandits numbering over two hundred blocked the road Sunday afternoon with sophisticated weaponsA press statement by the police says troops of the Police Tactical operatives deployed to safeguard the road against any invasion by criminal elements foiled the attackThe statement adds that at the end of the gun battle that lasted for hours, many bandits were fatally injured as many escaped to the forest with gun wounds.\nAdvertisementThe bandits according to the police managed to evacuate the corpses due to their large number that was believed to be over two hundredThe road has been cleared for motorists and other road users with rigorous confidence building patrol being intensfied by troops to avert further road blockage or any related crime.\nAuthorities of the police However says, bush combing of the sarrounding forest is being conducted by combined Police Tactical operatives including Special Forces to arrest the perpetrators.\nThis incident is coming less than twenty four hours after the state Governor Bello Matawalle confirmed the killing of forty five persons by armed Bandits in Zurmi Local government Leading to the indefinite suspension of the paramount ruler of the area allegedly to be involved in banditry activities"
  },
  {
    "headline": "National trials, invitational relays to hold between June 16th and June 21st-AFN",
    "summarized_story": "According to the Athletics Federation of Nigeria, the AFN 2021 National Championships and Invitational Relays will be held in the Yaba College of Technology Sports venue in Yaba, Lagos, between Wednesday June 16 and Monday June 21, 2021.\nThis year’s National Championships, according to AFN Secretary General Prince Adeniyi Adisa Beyioku, would be utilized as selection trials to choose Nigeria’s delegation for the postponed XXXII Olympic Games in Tokyo, which will take place from July 23 to August 8, 2021.\nThe AFN also disclosed that invited athletes and others who meet the competition’s entry requirements would arrive on Wednesday, June 16 at specified hotels, with the competition proper beginning on Thursday, June 17 and lasting four days.\n‘The invitational relays have become very important as it, for now, remains the only window left for Nigeria to secure qualifications for the relay events of the Olympics.\n‘Apart from the relays, the championships is also the final window for our athletes to qualify for their individual events."
  },
  {
    "headline": "Governor Lalong commissions multi billion naira hotel facility in Plateau",
    "summarized_story": "Governor Simon Lalong has commissioned a new multi-billion naira hotel complex in Plateau State in a move to encourage both local and foreign investment.\nPlateau State north central Nigeria has had its own fair share of violent clashes that have led to the loss of many lives and properties in the past few years.\nGovernor Simon Lalong on assuming office in 2015 promised that his administration would welcome and create an enabling environment for any one wishing to invest in the state.\nThe governor commended the CEO of the hospitality outfit for taking advantage of the improved business environment in the State.\nThe Governor said this development is an evidence that peace has returned back to Plateau State."
  },
  {
    "headline": "UFC 263: Israel Adesanya Retains Title With Decisive Performance Against Marvin Vettori",
    "summarized_story": "Israel Adesanya got back to his winning ways on Sunday with an outstanding five-round showing in the UFC 263 main eventMarvin Vettori believed he won his 2018 clash with Adesanya and never stopped calling for a rematch with the man who would go on to become UFC middleweight champion.\nVettori got his rematch on Saturday night in the main event of UFC 263 and came up empty, with Adesanya taking a clear decision victory at Gila River Arena in Glendale, Arizona.\nOutside of those fleeting moments for Vettori, the fight was all Adesanya as he worked Vettori over with a steady diet of leg kicks.\nIn the end, Adesanya took every round on all three official scorecards, winning by scores of 50-45 across the board.\nAfter his victory, Adesanya called for a rematch with Robert Whittaker, the man he defeated to become champion."
  },
  {
    "headline": "Despite Cryptocurrency Ban, Twitter CEO Dorsey Says Nigerians Will Lead Bitcoin Charge",
    "summarized_story": "Twitter CEO and billionaire co-founder Jack Dorsey, is extremely bullish on the future of bitcoin in Nigeria.\nI write to urge the Nigerian government to pursue economic independence and financial sovereignty by pursuing a national Bitcoin standard.\n“It is no secret that the current global economic environment is worrisome and unsustainable.\nSadly, the fate of the Nigerian economy is in the hands of global central bankers who do not represent the best interests of the Nigerian people.\nWe offer our full support, a willingness to voluntarily consult and commitment to activate every resource available to us in order to see Nigeria pursue a Bitcoin standard."
  },
  {
    "headline": "Nigerian CSOs Ask African Commission to Invalidate Twitter Ban",
    "summarized_story": "Two civil society organisations – Global Rights and Tap Initiative for Citizens Development have applied to the African Commission on Human and People’s Rights in Banjul, the Gambia to invalidate the Twitter ban by the Nigerian government and any measures or steps taken to implement the ban.\nFurther, they asked the commission to hold that Nigeria, by imposing a ban on the use of Twitter has violated Nigerians’ right to freedom of expression as provided for by the African Charter on Human and Peoples’ Rights.\nThe Charter is also part of Nigeria’s law having been domesticated by the African Charter (Ratification and Enforcement) Act of 1983.\nThey also asked the commission to refer the complaint against Nigeria to the African Court on Humanand Peoples’ Rights for determination.\nNigeria deposited with the Commission of the African Union its instrument of ratification of the Protocol to the African Charter on Human and Peoples’ Rights on the Establishment of the African Court on Human and Peoples’ Rights on 9 June, 2004 (hereafter called “the African Court Protocol”."
  },
  {
    "headline": "Nigeria Drug Agency Intercepts 100,000 Bottles of Codeine Syrup at Onne Port",
    "summarized_story": "About 100,000 bottles of codeine syrup with a total weight of 15,325kilograms were at the weekend intercepted and seized by the National Drug Law Enforcement Agency, NDLEA, at the Onne seaport, Port Harcourt, Rivers State.\nThe consignment packaged as dried green tea was shipped from Addis Ababa, Ethiopia, on board Ethiopian airline flight ET911.\nGeneral Mohamed Buba Marwa (Retd) has however hailed the synergy among the various government agencies at the Onne port and charged them not to rest on their oars as they daily work hard to keep Nigeria safe.\nHe particularly commended the Commander, officers and men of the Port Harcourt Port Command and their Abuja airport Command counterparts for their vigilance and commitment to the task of ridding Nigeria of illicit drugs.\n“The damage 100,000 bottles of codeine would have done to our youths if they had slipped through the port to our villages, towns and cities is unimaginable."
  },
  {
    "headline": "Nigeria Cannot Afford Funds to Revive Education, Buhari Says",
    "summarized_story": "President Muhammadu Buhari has said the Nigerian government cannot afford the amount of funding needed to revive the country’s educational system.\nBuhari also said the competition for funds had become keener because of the recent increase in the number of tertiary institutions in Nigeria.\nThe president spoke on Saturday at the 49th convocation ceremony of the University of Nigeria, Nsukka.\nBuhari, who was represented at the ceremony by the Minister of State for Education, Emeka Nwajiuba, however, said his administration was committed to addressing the needs of tertiary institutions through budgetary allocations to the Tertiary Education Trust Fund (TETFUND).\nBuhari advised academic institutions across the country to embark on the kind of innovative research that could help boost production and diversify the economy."
  }
]