[
  {
    "headline": "We’re not in a hurry to transmit PIB to Buhari, says N’Assembly",
    "summarized_story": "The Director of Information in the National Assembly, Mr Rawlings Agada, has explained that the federal parliament will not transmit the recently passed Petroleum Industry Bill in a hurry to the President, Major General Muhammadu Buhari (retd.).\nAgada gave the explanation on Tuesday while reacting to our correspondent’s enquiry on when the Clerk to the National Assembly, Mr Olatunde Ojo, would transmit the document to Buhari for assent.\nAgada stated, “There is more to the process of cleaning up a bill before the final transmission.\n“The President cannot assent to it (PIB) without the authentication process.\nSo, it is better that the legal department ensures that it is a clean copy that will be presented to the CNA."
  },
  {
    "headline": "Prayers against insecurity dominate Sallah as Nigerians celebrate Kabir",
    "summarized_story": "on Tuesday joined his kinsmen in Daura, Katsina State to observe the Eid-El- Kabir prayers.\nThe Emir of Daura, Alhaji Umar Faruq who had earlier arrived at the prayer ground, offered prayers for the President and for Nigeria.\nMeanwhile, Governor Aminu Masari and the Emir of Katsina, Dr Abdulmumin Kabir also observed Sallah prayers in Katsina, the state capital on Tuesday.\nYahaya, Goje preach sacrifice, unityMeanwhile, the Gombe State Governor, Muhammadu Yahaya, on Tuesday observed the two Raka’at Eid prayer at the central Eid praying ground in Gombe.\nIn his message to mark the religious festival, the Emir of Gombe called for sustained prayers for the nation and its leaders."
  },
  {
    "headline": "Lagos Assembly proposes two years imprisonment for assault on firefighters",
    "summarized_story": "By Ebunoluwa SessouLagos House of Assembly has proposed two years imprisonment for a person or persons obstructing fire fighting or assaulting firefighters.\nThe assembly made the recommendation in its proposed state fire service bill.\nThe Bill tagged, “A Bill for a law to establish the Lagos State Fire And Rescue Service and for Connected Purposes”, passed through a public hearing at the premises of the Lagos State House Assembly.\nAdeseye added that the establishment of a fire academy will also help in Lagos State, which she said is available in other climes.\nShe stated that it is an institution that is needed in Lagos State to help educate firefighters, not only government workers, but private firefighters."
  },
  {
    "headline": "Eid-el-Kabir: 10 die in lone crash in Kwara",
    "summarized_story": "The Kwara Command of the Federal Road Safety Corps (FRSC) have confirmed the death of 10 persons in a lone crash in the state.\nThe FRSC Sector Commander, Mr Jonathan Owoade, confirmed the incident to the News Agency of Nigeria (NAN) in Ilorin on Tuesday.\n“The crash was alone fatal one involving a black commercial Toyota Hiace bus with vehicle registration number LND 742XK.\nOwoade warned motorists against violating road safety guidelines, adding that the resultant effect of over speeding was road traffic crash.\n“May we not die untimely by our own hands,” the sector commander said."
  },
  {
    "headline": "Sallah: Buhari donates N1m, cows, rice to NYSC members in Daura",
    "summarized_story": "PHOTO: NANPresident Muhammad Buhari, on Tuesday, in Daura donated N1million, two cows and 20 bags of rice to National Youth Service Corps (NYSC) members serving in Daura Local Government Area of Katsina State.\n“It was another joyous Sallah day for the corps members serving in Daura, the country home of Mr President, as he was at home for the 2021 Sallah celebration.\n“Usually, when Mr President is at home for Sallah celebration, corps members go to his house to welcome him and wish him ‘Happy Sallah’.\nALSO READ: Eid-el-Kabir: Taraba NUJ, SWAN felicitate with Muslim ummah“They were given two cows, 20 bags of rice and N1 million,” the NYSC spokesperson disclosed.\nHe said that the President commended the NYSC members and urged them to be good ambassadors of their country and committed towards the development of Nigeria."
  },
  {
    "headline": "COAS, CAS in Maiduguri; celebrate Sallah with Air Component personnel of Operation Hadin Kai",
    "summarized_story": "By: Kingsley Omonobi – AbujaThe Chief of Army Staff (COAS), Lt Gen Faruk Yahaya and Chief of Air Staff (CAS), Air Marshal Oladayo Amao both demonstrated jointness at the highest echelon of the armed forces when both Service Chiefs feted personnel of the Air Component of Operation Hadin Kai (OPHK) to a buffet lunch at Maiduguri in Tuesday, 29 July 2021.\nSpeaking during the dinner, the COAS, Lt Gen Yahaya commended the personnel for their dedication and commitment to counterinsurgency operations under OPHK.\nHe also went down memory lane to recall his days as the Theatre Commander of OPHK where he enjoyed unfettered access to all the platforms and facilities under the Air Component Commander, while expressing gladness that the cooperation between the Land and Air Component have continued even after his tenure.\nHe went on to commend the Air Component Commander and his staff for their commitment and contributions towards ensuring that peace and stability is restored to all parts of the Northeast.\nOthers are Chief of Air Intelligence, AVM Ibukun Ojeyemi, Air Officer Commanding Tactical Air Command, AVM Gamsu Lubo and Ag Chief of Military Intelligence, Brig Gen Danladi Salihu."
  },
  {
    "headline": "Eid-el-Kabir: Taraba NUJ, SWAN felicitate with Muslim ummah",
    "summarized_story": "By Femi Bolaji – JalingoThe Nigeria Union of Journalists (NUJ), Taraba State Council has called on Muslim ummah to be wary of the third wave of Covid-19 as they mark Eid-el-Kabir with other faithful across the globe.\nState Chairman of the Union, David Nyah, in a statement Tuesday, congratulated them for witnessing another Sallah.\nHe charged them to continually emulate the virtues of the prophet by interceding for the state and nation during supplication.\nHe also encouraged them to maintain faith in the present administration of Governor Darius Ishaku, who according to him is poised to make life better for citizens of the state.\nHe also urged them to remain steadfast in their good deeds and solicited support for the administration of governor Darius Ishaku."
  },
  {
    "headline": "Sallah: Gov Ganduje releases 136 inmates from Correctional Centres in Kano",
    "summarized_story": "In the spirit of Eid-Kabir celebration, Governor Abdullahi Umar Ganduje of Kano State has released 136 inmates from Kano Correctional Centres.\nWhile effecting their release from detentions, Governor Ganduje, urged them to be people of sound character when they are finally being integrated into the society.\nHe made the statement when he visited Gorondutse Medium Correctional Centre as part of his Sallah visits during Sallah period, Tuesday.\nAccording to him, “His Excellency Governor Abdullahi Umar Ganduje of Kano State was here during the Eid-Fitr period, just in the last 70 days, and he released some inmates.\nThey are 136.”Sulaiman appreciated governor Ganduje’s magnanimous intervention, to make Sallah celebration most joyful among the inmates, when he provided the Correctional Centres with cattle and rams for the inmates."
  },
  {
    "headline": "Sunday Igboho: Buhari govt silent over arrest of Oduduwa Republic agitator in Cotonou",
    "summarized_story": "The President Muhammadu Buhari-led Federal Government has remained silent over the arrest of Oduduwa Republic agitator, Sunday Adeyemo also known as Igboho.\nIgboho was widely reported to have been arrested in Cotonou, Benin Republic by security operatives on Monday night.\nAlso, popular activist, Omoyele Sowore had claimed that Buhari was responsible for the arrest of Igboho.\nAccording to Sowore: “#FreesundayIgboho: The arrest of Sunday Igboho in Cotonou by the Beninoise authorities was orchestrated by tyrant Muhammadu Buhari.\n#BuhariMustGo #RevolutionNow.”Similarly, Deji Adeyanju of Concerned Nigerian rebuked Buhari for arresting Igboho while failing to do same to bandits and terrorists in the North."
  },
  {
    "headline": "‘There’s no crime asking for self-determination’ – Activists, agitators, groups condem arrest of Igboho, Kanu",
    "summarized_story": "A cross section of well meaning Nigerians, groups and activists have slammed the Buhari-led administration for arresting Yoruba activist, Sunday Igboho.\nThe development has continued to stir divergent reactions on social media with Nigerians likening Igboho’s arrest to that of Nnamdi Kanu in Kenya.\nSome Nigerians wondered how the Buhari-led government has failed to arrest bandits causing insecurity in most parts of the nation but employs all tactics to arrest activists.\nFG created Sunday Igboho, Nnamdi Kanu – Ex- Oyo Governor, LadojaSome also noted that Igboho’s arrest is a clear indication that this government wants war.\nA government that pampers bandits and terrorists!”FG pampering Boko Haram, bandits – Ohanaeze demands release of Sunday Igboho, Nnamdi Kanu"
  },
  {
    "headline": "Insecurity: COAS warns troops against indiscipline, indolence",
    "summarized_story": "Chief of Army Staff, Lieutenant General Faruk Yahaya, has warned officers and soldiers against indiscipline, indolence, negligence and all untoward acts.\nThe Army Boss gave the warning on Tuesday at a special luncheon to mark Eid-El-Kabir Sallah celebrations organised for troops under Sector 2 Operation Hadin Kai in Yobe State.\n“It was in that spirit that I conferred the COAS Commendation Awards to some deserving officers and soldiers on Tuesday 6th July, 2021 during the NADCEL 2021.\n“I will also see to our return to the cherished customs, ethics and traditions of the Nigerian Army.\nFor Those wounded in action, General Yahaya assured that they would be adequately treated and their requirements such as wheelchairs, prosthesis and other special vocational training will be provided."
  },
  {
    "headline": "Arrest of Sunday Igboho: Expose sponsors, agenda – Northern group tells FG",
    "summarized_story": "The Coalition of Northern Groups (CNG), has expressed hope that the federal government will go beyond prosecution to digging up and exposing the sponsors and the agenda behind the arrest of Nnamdi Kanu and Sunday Igboho.\nFrom records of history, it is only northern Nigeria that has not called for the breakup of the country at the slightest of pretence.\n“With the arrest of Kanu and now Igboho, we are hoping that the government would go beyond prosecution to digging up and exposing their sponsors and the agenda behind them,” the statement explained.\nThe group said unfortunately they (Yoruba leaders and government) took it too far by arming Igboho and setting him against law abiding citizens from other regions particularly the North.\nThe statement observed that the two arrests also attest to the level of cross regional cooperation that is working across Africa."
  },
  {
    "headline": "Pilot jumps to safety after bandits bring down NAF jet",
    "summarized_story": "By Okodili Ndidi, Abuja, Sani Muhammad Sani, Gusau, and Precious IgbonwelunduBuhari asks Northwest governors to end banditryCDS meets with ex-military officersAn Air Force fighter pilot jumped to safety on Sunday after bandits shot down a Nigerian Air Force (NAF) Alpha jet in Zamfara State.\nFlight Lieutenant Abayomi Dairo, according to the NAF, was returning from a mission against the bandits when his jet was brought down.\n“Luckily, the gallant pilot of the aircraft, Flight Lieutenant Abayomi Dairo, successfully ejected from the aircraft.\nADVERTISEMENT“Using his survival instincts, the pilot, who came under intense ground fire from the bandits was able to evade them and sought refuge in nearby settlements awaiting sunset.\nOn May 24, a NAF jet crashed in Kaduna State, killing Chief of Army Staff (COAS) Lt.-Gen. Ibrahim Attahiru and 10 other officers."
  },
  {
    "headline": "VIDEO: Buhari walks home after Eid prayer",
    "summarized_story": "Patricia Technologies Limited is proud to announce that we have moved our operations to the Republic of Estonia, with our..."
  },
  {
    "headline": "Ohanaeze to FG: No peace without justice over Kanu, Igboho",
    "summarized_story": "It also expressed surprise at the efficiency with which security operatives arrested Kanu and Igboho without applying similar zeal in treating Boko Haram kingpins, herdsmen and bandits in the North West among other criminal elements.\nAccording to Ohanaeze, Kanu and Igboho who wittingly or unwittingly are seen as heroes by their people were products of unjust society.\nThe statement reads: “Nigeria security operatives have in recent time shown that they have teeth and can bite.\nThe foregoing selective efficiency of the security operatives elicits the reason for the making of Mazi Nnamdi Kanu and Chief Sunday Adeyemo aka Sunday Igboho.\nADVERTISEMENT“Measures should rather be taken to address the causes of the agitations and only then can Nigeria have peace and sustainable economic growth."
  },
  {
    "headline": "UPDATED: How INTERPOL arrested Sunday Igboho",
    "summarized_story": "By Alao AbiodunMore facts have emerged on how INTERPOL operatives on Monday evening arrested Yoruba Nation agitator Sunday Adeyemo aka Sunday Igboho.\nLeader of the umbrella body of Yoruba self-determination groups, Ilana Omo Oodua (IOO), Banji Akintoye, who confirmed the arrest of Igboho, said he and other Yoruba leaders are “currently working to provide assistance” to prevent his extradition from Benin Republic.\nADVERTISEMENTIgboho, a campaigner for Yoruba Nation, was arrested in neighbouring Cotonou, Benin Republic, while trying to travel to Germany.\nA local newspaper in the neighbouring country, Banouto, said Beninese authorities nabbed Igboho at the Cardinal Bernardin International Airport in Cotonou.\nThere are arguments on strong grounds that Igboho will not get justice if extradited to Nigeria."
  },
  {
    "headline": "One killed as building collapses in Ikorodu",
    "summarized_story": "BY PHILIP NWOSUOne person was confirmed dead on Tuesday as a two storey building under construction collapsed at 77, Tapa Road, OkeOjo Isawo in the Ikorodu area of Lagos.\nHe said the Police have taken the body to the morgue of the General Hospital, Ikorodu, adding that the collapsed building was an attachment to the main building in front of the collapsed structure.\nAccording to a neighbour Construction works were suspended today due to the Eid El Kabir celebration.\nWorkers were at work yesterday till late evening.\nNEMA quoting witnesses attributed cause of collapse to inadequate time line to allow sand filled land to compact properly before commencement of construction and poor building materials."
  },
  {
    "headline": "How Sunday Igboho, wife was arrested -Lawyer",
    "summarized_story": "Molly kilete, AbujaThe lead counsel to Sunday Adeyemo, Yomi Alliyu (SAN), has told of how men of the International Criminal Police Organisation(INTERPOL), arrested the Yoruba Nation agitator, in Cotonou, Benin Republic.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today.\nAliyu, said Sunday Adeyemo also known as Sunday Igboho, was arrested alongside his wife, Ropo, a a German citizen while trying to board a flight to Germany.\nThis much was contained in a statement by Aliyu, who said INTERPOL working on the directives of the federal government arrested Adeyemo on Monday night at the airport in Benin Republic.\nIn the statement sighted by Daily Sun, Aliyu, condemned the arrest of the leader of the Yoruba nation which he described as impunity and called on the government of Germany, Benin Republic and the international community “to rise up and curb the impunity of the Nigerian Government by refusing any application for extradition of our Client who already has application before the International Criminal Court duly acknowledged”."
  },
  {
    "headline": "BREAKING: Tokyo 2020: CAS rejects Nigeria’s appeal for Ogwumike, Williams",
    "summarized_story": "By Joe ApuThe Court of Arbitration for Sports today ruled against Nigeria’s appeal to field Nneka Ogwumike and Elizabeth Olatayo Williams for the Tokyo 2020 Olympic Games.\nThe decision is a big setback to the Nigeria Basketball Federation (NBBF) which hoped to add the two players to better the country’s chances of a podium finish in Tokyo.\nFIBA had earlier ruled that both players were not eligible to play for Nigeria but the two players had requested that the CAS provisionally accepts the change of their national status from USA to Nigeria.\nThe list of players for the Tokyo 2020 Olympic Games submitted by the Nigeria Basketball Federation to the Nigeria Olympic Committee and to FIBA does not include these two players.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "JUST IN: Sunday Igboho may be paraded today",
    "summarized_story": "From Molly Kilete, AbujaThe agitator and leader of the Yoruba Nation, Sunday Adeyemo, commonly called Sunday Igboho, who was arrested late Monday night may be paraded by the Department of State Services (DSS), before the media today in Abuja.\nDaily Sun, reliably gathered that Igboho, who was arrested in Cotonou, Benin Republic, on his way to Germany, would be moved to the DSS headquarters upon his arrival to Nigeria.\nIt was gathered that the DSS may likely parade him before the media today or Thursday after the Sallah break.\nThe DSS is yet to issues a statement to confirm the arrest Sunday Igboho at the time of filing this report.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Zamfara: Court stops lawmakers from impeaching deputy gov",
    "summarized_story": "From Godwin Tsa, AbujaA Federal High Court in Abuja, yesterday, stopped the speaker of the Zamfara State House of Assembly and two others from proceedings with its planned impeachment of Deputy Governor, Mahdi Aliyu Gusau.\nAlso restrained by the interim order are the governor and the chief judge.\nJustice Obiora Egwuatu issued the order after listening to James Onoja, who moved an ex parte application filed by the Peoples Democratic Party (PDP).\nAccordingly, the judge ordered parties to maintain status quo ante bellum pending the hearing of a motion filed by the plaintiff.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "THISDAY Group Announces New Executive Appointments",
    "summarized_story": "Also, the Deputy Editor of THISDAY, Mr. Davidson Iriekpen, has been appointed Editor of THISDAY, the Sunday Newspaper, while the Editor of the Saturday Newspaper, Mr. Yemi Adebowale was reappointed on same position by the board.\nSimilarly, Mr. Olawale Olaleye, who was the Deputy Editor of the Sunday Newspaper was promoted to the position of Deputy Editor of THISDAY, just as the Group Business Editor, Mr. Obinna Chima was also promoted to the position of the Deputy Editor of THISDAY.\nThe Capital Market Editor, Mr. Goddy Egene was also promoted to the position of Group News Editor, while the Maritime Editor, Mr. Eromosele Abiodun is the new Group Business Editor.\nChima joined THISDAY in 2010 as a Business Correspondent and was appointed Group Business Editor in 2018.\nHe had held the positions of Judicial Editor, Editor, House of Representatives as well as covered the Presidential Villa, Abuja from where he was posted to the Saturday Desk as News Editor, before the current promotion."
  },
  {
    "headline": "Irabor Hails Pilot of Downed Fighter Plane for His Bravery, Gallantry",
    "summarized_story": "Irabor, who met the pilot in company with the Chief of the Air Staff, Air Marshal Oladayo Amao, before proceeding to a meeting with military veterans in the North-west, commended the pilot for the gallantry and bravery he demonstrated in the fight against banditry.\nEarlier, the NAF had announced the crashing of a fighter jet in Zamfara State while returning from an interdiction mission.\nLuckily, the gallant pilot of the aircraft, Flight Lieutenant Abayomi Dairo, successfully ejected from the aircraft.\n“Before proceeding for the security parley, the CDS, Gen Irabor, in company of the Chief of the Air Staff, Air Marshal Oladayo Amao, met with Flight Lieutenant Abayomi Dairo, the NAF Alpha jet pilot, who survived the air crash yesterday.\n“The CDS commended the fighter pilot for his gallantry and bravery, which he demonstrated in the fight against banditry."
  },
  {
    "headline": "NAF Fighter Jet Crashes in Zamfara, Pilot Survives",
    "summarized_story": "Kingsley Nwezeh in AbujaA Nigerian Air Force fighter jet crashed on Sunday in Zamfara State while returning from an interdiction mission.\nA statement issued by the Spokesman of the Nigerian Air Force, Air Commodore Edward Gabkwet, said the aircraft came under enemy fire, forcing the pilot, Flt.\nIt said the crash occured on July 18, 2021 at 12.45pm while the Alpha Jet Aircraft was returning from a successful air interdiction mission between the boundaries of Zamfara and Kaduna State.\nLuckily, the gallant pilot of the aircraft, Flight Lieutenant Abayomi Dairo, successfully ejected from the aircraft.\n“Accordingly, NAF Intelligence Surveillance Reconnaissance 0(ISR) platforms and helicopter gunships provided close air support to NAF."
  },
  {
    "headline": "OPEC+ Resolves Impasse, to Boost Production by 400,000bpd",
    "summarized_story": "OPEC welcomed the positive performance of participating countries in the Declaration of Cooperation (DoC), especially their overall conformity to the production adjustments which was out 113 per cent in June.\nAlso, Saudi Arabia’s baseline was raised from 11 million bpd to 11.\n5 million bpd, UAE had theirs raised from 3.168 million bpd to 3.5 million bpd and Russia’s was put at 11.5 million bpd from 11 million bpd.\nHe added: “Many countries, like Nigeria, would not have been able to develop their oil industry due to stiff competition.\nHowever, the good collaboration between OPEC member countries has made it possible to accommodate both the weak and strong players in the oil production industry."
  },
  {
    "headline": "PDP Asks Supreme Court to Sack Matawalle, Defected Zamfara Lawmakers",
    "summarized_story": "The new suit, filed solely by the PDP as the petitioner/plaintiff, is different from the one filed at the Federal High Court in Abuja by members of the PDP in Zamfara State, seeking to the removal of the governor.\nFemi Gbajabiamila; the Chief Judge of Zamfara State and the Speaker of the Zamfara State House of Assembly, as defendants.\nThe speaker of the state House of Assembly, Matawalle and the state chief judge are the fifth to seventh defendants respectively.\nIn the suit, the PDP asks the Supreme Court to declare vacant the seats of all its members in the National Assembly and Zamfara State House of Assembly that defected to the APC.\nIn court documents obtained by THISDAY at the weekend, the PDP is seeking a declaration that “sequel to the decision of the Supreme Court in SC."
  },
  {
    "headline": "Nigeria's National Female Football Team In Faraway Austria Preparing For Wasteful Self-serving Aisha Buhari Tournament",
    "summarized_story": "Nigeria's national female football team, Super Falcons are on a wasteful trip to Vienna, Austria to train for a self-serving tournament to honour the African country's first lady, Aisha Buhari.\nThe team is in Austria for an 8-day training camp as part of preparations for some upcoming games, most notably the Aisha Buhari Invitational Women’s Football Tournament.\nAfrica’s powerhouses in women's football, namely Cameroon, Ghana, South Africa, Mali, and Morocco have confirmed their participation in the maiden invitational football festival said to be aimed at uplifting the cause of the girl-child in the continent.\nThe six-nation football tournament is billed to hold in Lagos from September 14 to 20, 2021, when some kidnapped schoolgirls are still likely to be in the den of bandits and insurgents.\nOrganisers of the Aisha Buhari Invitational Women’s Football Tournament have also confirmed that FIFA President, Gianni Infantino; CAF President, Dr. Patrice Motsepe; FIFA General-Secretary, Fatma Samoura, and other world football dignitaries will be in Lagos for the tournament."
  },
  {
    "headline": "Nigeria's National Female Football Team In Faraway Austria Preparing For Wasteful Self-serving Aisha Buhari Tournament",
    "summarized_story": "Nigeria's national female football team, Super Falcons are on a wasteful trip to Vienna, Austria to train for a self-serving tournament to honour the African country's first lady, Aisha Buhari.\nThe team is in Austria for an 8-day training camp as part of preparations for some upcoming games, most notably the Aisha Buhari Invitational Women’s Football Tournament.\nAfrica’s powerhouses in women's football, namely Cameroon, Ghana, South Africa, Mali, and Morocco have confirmed their participation in the maiden invitational football festival said to be aimed at uplifting the cause of the girl-child in the continent.\nThe six-nation football tournament is billed to hold in Lagos from September 14 to 20, 2021, when some kidnapped schoolgirls are still likely to be in the den of bandits and insurgents.\nOrganisers of the Aisha Buhari Invitational Women’s Football Tournament have also confirmed that FIFA President, Gianni Infantino; CAF President, Dr. Patrice Motsepe; FIFA General-Secretary, Fatma Samoura, and other world football dignitaries will be in Lagos for the tournament."
  },
  {
    "headline": "How INTERPOL Arrested Sunday Igboho, Wife In Benin Republic – Lawyer",
    "summarized_story": "Yomi Alliyu, the lead counsel to the Yoruba Nation activist, Sunday Adeyemo, otherwise known as Sunday Igboho, has said that it was the International Criminal Police Organisation which arrested Igboho alongside his wife, Ropo, in Cotonou, Benin Republic.\nSunday IgbohoAccording to him, the Federal Government of Nigeria through INTERPOL got Adeyemo aka Sunday Igboho, who is a German citizen, and his wife arrested on Monday night at an airport in Benin Republic, one of Nigeria’s neighbouring countries in the West African sub-region.\nIgboho was arrested while he tried to catch a flight to Germany with his wife.\nA source privy to his departure from Nigeria on Monday had told SaharaReporters that Igboho tried to leave Nigeria through Cotonou and was heading to Germany.\nSee Also Politics Steps Ongoing To Prevent Benin Republic’s Extradition Of Igboho To Nigeria – AkintoyeSpeaking with SaharaReporters, a source privy to the incident, had said, \"Sunday Igboho has been arrested in Cotonou."
  },
  {
    "headline": "How INTERPOL Arrested Sunday Igboho, Wife In Benin Republic – Lawyer",
    "summarized_story": "Yomi Alliyu, the lead counsel to the Yoruba Nation activist, Sunday Adeyemo, otherwise known as Sunday Igboho, has said that it was the International Criminal Police Organisation which arrested Igboho alongside his wife, Ropo, in Cotonou, Benin Republic.\nSunday IgbohoAccording to him, the Federal Government of Nigeria through INTERPOL got Adeyemo aka Sunday Igboho, who is a German citizen, and his wife arrested on Monday night at an airport in Benin Republic, one of Nigeria’s neighbouring countries in the West African sub-region.\nIgboho was arrested while he tried to catch a flight to Germany with his wife.\nA source privy to his departure from Nigeria on Monday had told SaharaReporters that Igboho tried to leave Nigeria through Cotonou and was heading to Germany.\nSee Also Politics Steps Ongoing To Prevent Benin Republic’s Extradition Of Igboho To Nigeria – AkintoyeSpeaking with SaharaReporters, a source privy to the incident, had said, \"Sunday Igboho has been arrested in Cotonou."
  },
  {
    "headline": "How INTERPOL Arrested Sunday Igboho, Wife In Benin Republic – Lawyer",
    "summarized_story": "Yomi Alliyu, the lead counsel to the Yoruba Nation activist, Sunday Adeyemo, otherwise known as Sunday Igboho, has said that it was the International Criminal Police Organisation which arrested Igboho alongside his wife, Ropo, in Cotonou, Benin Republic.\nSunday IgbohoAccording to him, the Federal Government of Nigeria through INTERPOL got Adeyemo aka Sunday Igboho, who is a German citizen, and his wife arrested on Monday night at an airport in Benin Republic, one of Nigeria’s neighbouring countries in the West African sub-region.\nIgboho was arrested while he tried to catch a flight to Germany with his wife.\nA source privy to his departure from Nigeria on Monday had told SaharaReporters that Igboho tried to leave Nigeria through Cotonou and was heading to Germany.\nSee Also Politics Steps Ongoing To Prevent Benin Republic’s Extradition Of Igboho To Nigeria – AkintoyeSpeaking with SaharaReporters, a source privy to the incident, had said, \"Sunday Igboho has been arrested in Cotonou."
  },
  {
    "headline": "Ohanaeze to FG: Targeting Igboho without addressing cause of agitation is futile effort",
    "summarized_story": "Ohanaeze Ndigbo, apex Igbo socio-cultural organisation, has asked the federal government to address the cause of agitations by Sunday Adeyemo, a youth leader better known as Sunday Igboho.\nAdvertisementIgboho was said to have been arrested by security operatives in Benin Republic on Monday, while on his way to Germany.\nAdvertisement“The Nigeria security operatives have in recent time shown that they have teeth and can bite.\nThe foregoing selective efficiency of the security operatives elicits the reason for the making of Mazi Nnamdi Kanu and Chief Sunday Adeyemo a.k.a.\nTherefore, a concerted effort in search of the Kanus and the Igbohos without addressing the basis of the agitation is an effort in futility."
  },
  {
    "headline": "Ohanaeze to FG: Targeting Igboho without addressing cause of agitation is futile effort",
    "summarized_story": "Ohanaeze Ndigbo, apex Igbo socio-cultural organisation, has asked the federal government to address the cause of agitations by Sunday Adeyemo, a youth leader better known as Sunday Igboho.\nAdvertisementIgboho was said to have been arrested by security operatives in Benin Republic on Monday, while on his way to Germany.\nAdvertisement“The Nigeria security operatives have in recent time shown that they have teeth and can bite.\nThe foregoing selective efficiency of the security operatives elicits the reason for the making of Mazi Nnamdi Kanu and Chief Sunday Adeyemo a.k.a.\nTherefore, a concerted effort in search of the Kanus and the Igbohos without addressing the basis of the agitation is an effort in futility."
  },
  {
    "headline": "Police: 100 kidnapped victims rescued in Zamfara -- after 42 days in captivity",
    "summarized_story": "The police command in Zamfara says security operatives have rescued 100 abducted persons from bandits at Kabaro forest in Maru LGA of the state.\nAdvertisementMuhammad Shehu, Zamfara police spokesman, disclosed this in a statement in Gusau, the state capital, on Tuesday.\nShehu said the rescue was done in collaboration with the state ministry of security and home affairs, adding that the victims had spent 42 days with the abductors before they were rescued.\nAdvertisement“It could be recalled that on 8th June, 2021, some recalcitrant bandits stormed Manawa village, and abducted 100 villagers, including nursing mothers, males and children.\n“The Commissioner of Police, Mr Hussaini Rabiu, warned the recalcitrant bandits to renounce criminalities and embrace peace or face the full wrath of the law."
  },
  {
    "headline": "Police: 100 kidnapped victims rescued in Zamfara -- after 42 days in captivity",
    "summarized_story": "The police command in Zamfara says security operatives have rescued 100 abducted persons from bandits at Kabaro forest in Maru LGA of the state.\nAdvertisementMuhammad Shehu, Zamfara police spokesman, disclosed this in a statement in Gusau, the state capital, on Tuesday.\nShehu said the rescue was done in collaboration with the state ministry of security and home affairs, adding that the victims had spent 42 days with the abductors before they were rescued.\nAdvertisement“It could be recalled that on 8th June, 2021, some recalcitrant bandits stormed Manawa village, and abducted 100 villagers, including nursing mothers, males and children.\n“The Commissioner of Police, Mr Hussaini Rabiu, warned the recalcitrant bandits to renounce criminalities and embrace peace or face the full wrath of the law."
  },
  {
    "headline": "AMAC asks bakers to pay N100k for 'gaseous emission permit'",
    "summarized_story": "The Abuja Municipal Area Council (AMAC) has asked bakery operators within the area to pay N100,000 for “gaseous emission permit”.\nAdvertisementIn a letter to bakery owners seen by TheCable, Ahmed Haruna, director of public health, AMAC, said the levy is for discharge of “harmful hazardous substances” into the air, water and land.\nAccording to him, failure to comply with the directive is a “punishable offence”, and could lead to the arrest of the operator and suspension of the bakery’s activities.\n“The management of Abuja Municipal Area Council Environment Services Department (ESD) Bodies, wishes to notify you of levy/fees due to Abuja Area Council for Gaseous Emission Permit Limit,” the letter reads.\nSo they can invite the partner for negotiation so it may be lesser than that."
  },
  {
    "headline": "Senegal to produce rapid Covid tests in tech deal with major biotech companies",
    "summarized_story": "The Pasteur Institute in Senegal will produce rapid antigen tests for diagnosing the coronavirus disease from early 2022 with the help of a new tech transfer agreement.\nAn antigen test is regarded as a suitable ‘first line of defense’ against the coronavirus disease for individuals who have symptoms.\nIt plans to make 2.5 million tests per month in 2022, according to the statement.\nHowever, the rapid antigen test deal involving the Pasteur Institute comes at a time when Senegal is grappling with soaring coronavirus cases.\nAccording to health ministry spokesman Mamadou Ndiaye, the West African nation was seeing an “unprecedented” surge in Covid infections."
  },
  {
    "headline": "Hundreds of MTN, Vodacom towers damaged in South Africa unrest",
    "summarized_story": "Telecommunications infrastructure owned by several mobile network operators was severely damaged in the rampant looting and destruction of property that rocked South Africa last week.\nThe Independent Communications Authority of South Africa (ICASA) revealed on Tuesday, July 13, that the vandalism included more than 100 mobile network towers in some parts of the country.\nVirtually all network providers operating in South Africa reported disruption to service delivery.\nChildren are evacuated from a burning building in downtown Durban, South Africa.\nJust one of its network towers was vandalised within the Durban area but it did not affect service delivery to consumers."
  },
  {
    "headline": "The Next Wave: What’s happening in francophone Africa?",
    "summarized_story": "Unique and untappedFrancophone Africa is home to an island country where many African startups register their headquarters.\nBetween 2015 and 2019, startups and SMEs in francophone Africa received $417.9 million, according to Briter Bridges, a research firm.\nGozem, a ride-hailing company which also offers ecommerce services, launched in Gabon, its third francophone country, this year with eyes on Cameroon and Dr Congo.\nFrancophone Africa is dogged by lack of clarity around regulations, language barriers and limited networking opportunities, per Briter Bridges report.\nThese concerns will take some time to quell, so maybe unicorn bells won’t ring in francophone Africa anytime soon."
  },
  {
    "headline": "Why food-on-demand can be Gokada’s ticket to super app stardom",
    "summarized_story": "But in its boldest step since it was founded in January 2018 by Fahim Saleh, Gokada now identifies as a super app.\nGokada’s super app is entering the market at a time when Lagos residents are consuming ₦5 trillion ($12 billion) worth of food annually.\nSo why a super app?\nLike Grab in Singapor and Gozem in francophone Africa, Gokada’s super app journey started with transportation | Graphic by Boluwatife Sanso/TC InsightsBut as Yinka Adegoke explained in this insightful piece, apps become super by offering essential services within large markets.\nPerfecting this cycle also means paying attention to renowned global food delivery services like Doordash, Grubhub, UberEats and Deliveroo."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "After its seed round of $350,000 and $150,000 cheque from Y Combinator as part of the accelerator’s Summer 2020 batch,..."
  },
  {
    "headline": "How Agritech startup, Releaf, wants to change the face of food processing in Africa",
    "summarized_story": "Share this article:The dominance of Nigeria’s palm oil industry during the 1960s is often repeated when tales of the country’s glory days are told.\nIn 1965, several countries in Africa, Southeast Asia, and Latin America received nearly $2 billion from the World Bank for the oil palm industry.\nIt is in this market that agritech startup, Releaf, is looking to make its mark.\nWhile doing this, the founders realised that food factories could not get enough high-quality raw materials to operate their factories at maximum capacity.\nWith the help of Kraken, Releaf is gunning for a portion of the global $61 billion palm oil market."
  },
  {
    "headline": "Chaka’s $1.5m pre-seed, Internet speed in Nigeria, Nigeria’s Mobile Money Regulations",
    "summarized_story": "Share this article:Good day,Today, I’m discussing:Chaka’s pre-seed roundInternet speed in NigeriaMobile Money RegulationsChaka secures $1.5 million in pre-seed fundingWhat happened?\nThere are also times that I have been shocked by someone praising the Internet speed of a network that I’ve found to be really slow.\nFactors ranging from power disruption at Internet infrastructure sites to the cost of operating a telecommunications licence contribute to the unstable Internet quality in most parts of the nation.\nQuite recently, it was the turn of Mobile Money Operators.\nRestrictions, restrictions, and more restrictions: Raise your hand if CBN stopping Mobile Money Operators from lending or giving insurance comes as a shock to you?"
  },
  {
    "headline": "Why Nigerian SMEs, fintechs should be bothered about the new Mobile Money Regulations",
    "summarized_story": "Share this article:On July 9, 2021, the Central Bank of Nigeria (CBN) released its Framework and Guidelines on Mobile Money services in Nigeria (PDF).\nIt also revealed a drastic shift in favour of mobile money and agent banking.\nInterestingly, CBN last updated the mobile money regulations in 2015.\nFor fintechs in the Mobile Money space, such as Paga and Opay, they can now offer savings wallets that accrue interest.\nFor telcos, CBN’s continuous insistence on excluding them from the mobile money space is an interesting move."
  },
  {
    "headline": "Explainer: What OPEC’s new agreement means for Nigeria",
    "summarized_story": "Explainer: What OPEC’s new agreement means for NigeriaThe world’s biggest oil producing group has agreed to increase oil production in the coming months, a decision that comes with huge implication for Africa’s biggest oil producer.\nThe group, the Organisation of Oil Exporting Countries (OPEC) and its allies like Russia, agreed to add another 400,000 barrels per day (bpd) on a monthly basis…"
  },
  {
    "headline": "US forces almost accidentally invaded Nigeria under Trump, book claims",
    "summarized_story": "In the ensuing confusion, Patel reportedly “assured” senior officials involved in the process that Nigeria’s government had been notified.\nAmerican forces had come very close to a technical invasion of a foreign country,” wrote the authors.\nI Alone Can Fix It: Donald J. Trump’s Catastrophic Final Year was released on July 20, published by Bloomsbury.\nThe 31 Oct. mission was successful, leading to the deaths of numerous militants, according to the book, while Walton’s rescue was reported by news outlets last year.\n“Big win for our very elite U.S. Special Forces today,” Trump tweeted at the time of Walton’s rescue last year."
  },
  {
    "headline": "How brands kept share of consumers’ mind, pockets in the pandemic",
    "summarized_story": "How brands kept share of consumers’ mind, pockets in the pandemicWhen the federal government of Nigeria declared a lockdown in March 2020 at the onset of the pandemic, retailers like Chuks Ogadinma had a premonition that it could be the last time his shop would be opening for business.\nHow would he feed his young family of four if there was no one coming to…"
  },
  {
    "headline": "Electoral Reform Bill: When Posterity Will Judge – Nigerian Observer",
    "summarized_story": "But some senators notably those of the People’s Democratic Party (PDP) disagreed, throwing the Senate into a rowdy session.\nRecall also that ballot snatching has been a worrisome phenomenon to electoral process in Nigeria for as long election itself.\nThough one wonders why the president himself has three times declined to assent the electoral reform bill which among others will render ballot box snatchers incapacitated to a very great extent.\nThis becomes a matter of grave concern as the hope of a credible elections lies in the independence of the unbiased electoral umpire.\nBut it is rather paradoxical that the party which promised Nigerians change is in practice, curiosily averse to progressive change."
  },
  {
    "headline": "Eid-el-Kabir: Edo govt urges caution, compliance to protocols amid third wave of COVID-19 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has urged residents to celebrate the Eid-el-Kabir festivities with caution and adhere to preventive protocols against the spread of coronavirus (COVID-19), in the wake of the third wave of COVID-19 infections across the country.\nThe Edo State Deputy Governor and Chairman, Technical Committee on COVID-19, Rt.\nShaibu, represented by the Permanent Secretary, Edo State Ministry of Health, Dr. Osamwonyi Irowa, urged residents to be cautious amid the festivities to prevent the highly transmissible Delta variant of COVID-19 from gaining entrance into the state.\nThe Deputy Governor noted: “On behalf of the Edo State Government, I want to once more congratulate our Muslim brothers and sisters on this auspicious occasion of the Eid-el-Kabir celebration.\n“As we go about with the celebrations, we must bear in mind that the COVID-19 pandemic is not yet over."
  },
  {
    "headline": "Eid-el-Kabir: Obaseki felicitates with Muslim faithful, charges on unity, tolerance – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has felicitated with Muslim faithful on the Eid-el-Kabir celebration, urging them to continue to imbibe the spirit of love, tolerance and sacrifice as exemplified by the Holy Prophet Muhammad.\nThe governor, in a statement, charged Muslims to use the period to deepen their relationship with Allah and pray for unity, peace and development of the state and Nigeria.\nObaseki noted: “On behalf of the Government and people of Edo State, I felicitate with Muslim faithful on the occasion of Eid-el-Kabir.\n“This year’s Eid-el-Kabir presents yet another opportunity for our Muslim brothers and sisters to deepen their relationship with Allah.\n“As we celebrate this auspicious occasion, I call for dedication to the virtues of love, oneness, patriotism, tolerance and unity for the desired development in the state and Nigeria.”..."
  },
  {
    "headline": "Edo residents applaud Vigilante network on improved security – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Residents in Edo have commended the Edo State Vigilante and Security Network for working assiduously to provide security across the state in collaboration with other security agencies in the state.\nA cross-section of residents across the state, who spoke to journalists, said the formation and deployment of the vigilante teams across communities in the state have improved surveillance and intelligence gathering in the state.\nAccording to him, “A unique feature of the vigilante network is the fact that members of the community are co-opted into the scheme and made responsible to work with other agencies to secure their neighborhood.\nHe said: “A lot of people are now more interested in what happens around them because they are co-opted into the vigilante network.\nThis generally improves the security in the area.”The Obaseki-led administration set up the security network in the aftermath of the #ENDSARS protest last year to boost security and community policing in the state."
  },
  {
    "headline": "Israeli Spy Tech Used Against Daughter of Man Who Inspired “Hotel Rwanda”",
    "summarized_story": "It flew him not to Burundi, as he believed, but to Rwanda, where he faced charges of financing terrorist activities.\nDr. Vincent Biruta, Rwanda’s Minister of Foreign Affairs and International Cooperation, said Rwanda does not use or have access to Pegasus.\nRusesabagina fled Rwanda in 1996, ending up in the U.S. where he was eventually granted the Presidential Medal of Freedom by President George W. Bush.\nHis daughter, Kanimba, told Pegasus Project reporters that the charges are groundless and that Kagame is jealous of Rusesabagina.\nHimbara told the Guardian, a participant in The Pegasus Project, that he believes Kagame poses a threat to his life."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Buhari plotting to remain in power beyond 2023 – PDP alleges",
    "summarized_story": "Nigeria’s main opposition party, the Peoples Democratic Party (PDP), has accused President Muhammadu Buhari of trying to remain in power beyond 2023.\nThe party in a statement by its spokesman, Kola Ologbondiyan on Tuesday, said the assertion by the Buhari Presidency that Nigerians will be waiting for President Muhammadu Buhari “to show the way in 2023” has further heightened public apprehensions of self-succession plot by the cabal in the Presidency.\n“Our party and indeed the majority of Nigerian across board and even across party lines caution President Buhari’s handlers to note that such plots cannot stand as it will be firmly resisted by the people.\n“Shehu Garba should be bold enough to announce that President Buhari will be on the ballot for another term in 2023 and watch how Nigerians will respond.\n“The 1999 Constitution (as amended) is clear on the tenure of office of the President and such cannot be extended under any guise or conditions whatsoever."
  },
  {
    "headline": "Igboho, wife arrested by Interpol in Benin Republic – Lawyer",
    "summarized_story": "Mr. Yomi Alliyu (SAN), who is the counsel to Yoruba nation agitator, Sunday Adeyemo, alias Sunday Igboho, has said his client and his wife were arrested in Benin Republic by the International Criminal Police Organisation.\nAlliyu who made the disclosure in a statement on Tuesday, called on the government of Germany and Benin Republic to prevent the extradition of Igboho to Nigeria.\nIgboho and his wife were said to be in Benin Republic preparing to travel to Germany when they were arrested.\nThe statement reads: “I received last night the troubling information that Chief Sunday Adeyemo fondly called Igboho had been arrested at the Cotonou Airport.\n“Fortunately, Benin Republic is reliably a land of law where the authorities responsibly obey the law."
  },
  {
    "headline": "BREAKING: Armed men attack Mali interim president, Goita",
    "summarized_story": "Two armed men, including one who wielded a knife, attacked Mali’s interim president Assimi Goita on Tuesday in the great mosque in the capital Bamako, an AFP journalist saw.\nReligious Affairs Minister Mamadou Kone told AFP that a man had “tried to kill the president with a knife” but was apprehended.\nLatus Toure, the director of the Great Mosque, said an attacker had lunged for the president but wounded someone else.\nColonel Goita led a coup last August, ousting elected president Ibrahim Boubacar Keita after weeks of mass protests over corruption and the long-running jihadist conflict.\nHe was then named transitional president, but has pledged to keep to the goal for returning to civilian government."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Sallah: Senator Kwari Greets Constituents, Urges Prayer Against Insecurity",
    "summarized_story": "The Senator representing Kaduna North senatorial district, Suleiman Abdu Kwari, has urged the people of his constituency to use the occasion of Eid-el-Kabir in praying fervently for peace, security and national economic development.\n“We should also not relent in our prayers for peace, security and economy of our country,” he said.\n“I felicitate with my constituents on this auspicious occasion of Eid-el-Kabir.\n“I urge you to reflect and imbibe the virtues of prophet Muhammad (SAW) on love, patience and sacrifice,” he stressed.\nSenator Kwari then prayed that the Almighty Allah to grant “everyone of us the blessings attached to Eid-el-Kabir.”"
  },
  {
    "headline": "Sallah: Senator Kwari Greets Constituents, Urges Prayer Against Insecurity",
    "summarized_story": "The Senator representing Kaduna North senatorial district, Suleiman Abdu Kwari, has urged the people of his constituency to use the occasion of Eid-el-Kabir in praying fervently for peace, security and national economic development.\n“We should also not relent in our prayers for peace, security and economy of our country,” he said.\n“I felicitate with my constituents on this auspicious occasion of Eid-el-Kabir.\n“I urge you to reflect and imbibe the virtues of prophet Muhammad (SAW) on love, patience and sacrifice,” he stressed.\nSenator Kwari then prayed that the Almighty Allah to grant “everyone of us the blessings attached to Eid-el-Kabir.”"
  },
  {
    "headline": "NALDA Integrated Farm Estate In Katsina To Generate N1.7bn – Ikonne",
    "summarized_story": "The National Agricultural Land Developement Authority (NALDA), has said that the newly established Integrated Farm Estate in Katsina State, is expected to generate N1.7billion in the first one year.\nExecutive secretary/chief executive officer (CEO) of NALDA, Prince Paul Ikonne, disclosed this on Monday during the commissioning of the farm estate in Suduje, Katsina State, by President Muhammadu Buhari.\n“The entire farm has the capacity to generate over N1.7b in the first year,” he said.\nIdentifying sustainable development as the only way to promote rational utilisation of resources and environmental protection, Ikonne said the Integrated Farming System (IFS)holds a special position as nothing is wasted since the by-product of one system becomes the input for another.\nHe noted that the NALDA Integrated Farm is deliberately designed to accommodate, empower and position a new set of 1,500 agro entrepreneurs every year from this category."
  },
  {
    "headline": "NALDA Integrated Farm Estate In Katsina To Generate N1.7bn – Ikonne",
    "summarized_story": "The National Agricultural Land Developement Authority (NALDA), has said that the newly established Integrated Farm Estate in Katsina State, is expected to generate N1.7billion in the first one year.\nExecutive secretary/chief executive officer (CEO) of NALDA, Prince Paul Ikonne, disclosed this on Monday during the commissioning of the farm estate in Suduje, Katsina State, by President Muhammadu Buhari.\n“The entire farm has the capacity to generate over N1.7b in the first year,” he said.\nIdentifying sustainable development as the only way to promote rational utilisation of resources and environmental protection, Ikonne said the Integrated Farming System (IFS)holds a special position as nothing is wasted since the by-product of one system becomes the input for another.\nHe noted that the NALDA Integrated Farm is deliberately designed to accommodate, empower and position a new set of 1,500 agro entrepreneurs every year from this category."
  },
  {
    "headline": "10 Die In Auto Crash Along Ilorin-Jebba Road",
    "summarized_story": "An auto crash along Ilorin- Jebba highway on sallah day claimed the lives of 10 persons.\nThe lone auto crash which involved an 18-seater commercial Hiace bus occurred at a location called Iyemoja along Olooru-Okolowo area of the expressway in the Moro local government area of Kwara state.\nThe sector commander of the Federal Road Safety Corps (FRSC) in the state, Jonathan Owoade, confirmed the incident.\nHe gave the registration number of the commercial vehicle as LND 742XK, saying that the rescue team took the injured people to Ayo hospital, Okolowo and the state General Hospital, Ilorin for medical attention.\nADVERTISEMENTOwoade added that the corpses of the victims had been deposited at the morgue of the General Hospital, Ilorin."
  },
  {
    "headline": "10 killed in Ilorin-Jebba Expressway accident",
    "summarized_story": "A lone auto crash on the Ilorin-Jebba Expressway which occurred on Sallah Day had reportedly claimed the lives of 10 people.\nThe crash involving an 18-seater commercial Hiace Bus, according to the Federal Road Safety Corps on Tuesday, occurred at a location called Iyemoja along Olooru-Oko Olowo Area of the Ilorin-Jebba Expressway in the Moro Local Government Area of Kwara State.\nThe crash, which was reportedly caused by speed violation, occurred at about 4.00pm.\nThe state sector commander of the Federal Road Safety Corps, Jonathan Owoade, who confirmed the incident, said that other victims of the crash suffered varying degrees of fracture injuries.\nThe FRSC boss also said that the corpses had been deposited at the morgue of General Hospital, Ilorin."
  },
  {
    "headline": "10 killed in Ilorin-Jebba Expressway accident",
    "summarized_story": "A lone auto crash on the Ilorin-Jebba Expressway which occurred on Sallah Day had reportedly claimed the lives of 10 people.\nThe crash involving an 18-seater commercial Hiace Bus, according to the Federal Road Safety Corps on Tuesday, occurred at a location called Iyemoja along Olooru-Oko Olowo Area of the Ilorin-Jebba Expressway in the Moro Local Government Area of Kwara State.\nThe crash, which was reportedly caused by speed violation, occurred at about 4.00pm.\nThe state sector commander of the Federal Road Safety Corps, Jonathan Owoade, who confirmed the incident, said that other victims of the crash suffered varying degrees of fracture injuries.\nThe FRSC boss also said that the corpses had been deposited at the morgue of General Hospital, Ilorin."
  },
  {
    "headline": "Serial Fraudster Bags 15 Years for N4m Fraud",
    "summarized_story": "By JUMOKE SANNIJustice Umaru Fadawu of the Borno State High Court sitting in Maiduguri, on July 16, 2021 sentenced a serial fraudster, Alen Abel to fifteen years imprisonment for obtaining N4, 065, 000.00 (Four Million, Sixty-five Thousand Naira), under false pretence.\nThe offence is contrary to Section 1 (1) (a) of the Advance Fee Fraud and Other Related Offences Act, 2006 and punishable under Section 1 (3) of the same Act.\nThe convict was arraigned on July 14, 2021 by the EFCC on two separate one count charge.\nUpon his plea, the prosecution counsel, Mukhtar Ali Ahmed, through Buba Abdul, an operative of the EFCC, reviewed the facts of the case and prayed the court to convict and sentence Abel as charged.\nJustice Fadawu, after listening to the prayer of the prosecution, convicted the defendant and sentenced him to eight and seven years imprisonment on the respective charge."
  },
  {
    "headline": "Serial Fraudster Bags 15 Years for N4m Fraud",
    "summarized_story": "By JUMOKE SANNIJustice Umaru Fadawu of the Borno State High Court sitting in Maiduguri, on July 16, 2021 sentenced a serial fraudster, Alen Abel to fifteen years imprisonment for obtaining N4, 065, 000.00 (Four Million, Sixty-five Thousand Naira), under false pretence.\nThe offence is contrary to Section 1 (1) (a) of the Advance Fee Fraud and Other Related Offences Act, 2006 and punishable under Section 1 (3) of the same Act.\nThe convict was arraigned on July 14, 2021 by the EFCC on two separate one count charge.\nUpon his plea, the prosecution counsel, Mukhtar Ali Ahmed, through Buba Abdul, an operative of the EFCC, reviewed the facts of the case and prayed the court to convict and sentence Abel as charged.\nJustice Fadawu, after listening to the prayer of the prosecution, convicted the defendant and sentenced him to eight and seven years imprisonment on the respective charge."
  },
  {
    "headline": "ICYMI: Britain queries Buhari’s govt on Nnamdi Kanu’s abduction",
    "summarized_story": "By Agency ReportBritain has asked Nigeria to explain where and how its citizen, Nnamdi Kanu, leader of the Indigenous People of Biafra was kidnapped.\nThe diplomatic query followed the statement by Kanu’s lawyer that the IPOB leader was detained and mistreated in Kenya before being sent back to Nigeria.\n“We are seeking clarification from the Nigerian government about the circumstances of the arrest and detention of Nnamdi Kanu,” said Tariq Ahmad, a junior minister at Britain’s Foreign Office.\nKanu was said to be travelling on UK passport when he was abducted in Kenya and tortured for eight days.\nThe Nigerian authorities have refused to say where Kanu was arrested, while Kenya’s ambassador to Nigeria has denied his country was involved."
  },
  {
    "headline": "The Voice Nigeria show enters final stage",
    "summarized_story": "By Kazeem AkandeThe Voice Nigeria musical contest, a TV reality show, has entered its final stage with the top six talents seeking viewers and fans’ votes to win the contest.\nThe six talents will slug it out among themselves to determine who will scale through to the next stage that will lead to the final.\nNancy Isime, the show’s host, said that all the six talents were in need of the viewers’ votes to increase their chances of climbing to the final stage.\nEach talent needs more votes from their fans to enable them reach the next stage of performance as the contest gets tougher toward the final stage.\nMrs Folake Ani-Mumuney, Group Head, Marketing and Corporate Communications, First Bank Nigeria Ltd, the lead sponsor, said in a statement that, ”The Voice Nigeria 3” was a reality TV show designed to discover and promote talented singers in the country."
  },
  {
    "headline": "How Interpol arrested Igboho on his way to Germany",
    "summarized_story": "Yoruba Nation agitator, Sunday Adeyemo, popularly known as Sunday Igboho was about to board a plane from Cotonou, Benin Republic to Germany when he was arrested by Interpol.\nHe said Igboho was about to board a plane to Germany with his wife, Ropo who is a citizen of Germany when he was arrested by the Interpol.\nAlliyu said the arrest of Igboho was shocking and appealed to the Benin Republic government and the German government to help curb the excesses of Nigerian government.\nHe urged the Benin Republic government to reject any application from Nigeria for Igboho’s extradition.\nThe DSS killed two of his men, arrested some others and declared Igboho wanted."
  },
  {
    "headline": "NCDC Confirms 15 Monkeypox Cases In Nigeria",
    "summarized_story": "In Nigeria, the Nigeria Centre for Disease Control (NCDC) has recorded 59 suspected monkeypox cases.\nHowever, Ihekweazu told NAN that an outbreak would be notified if there was a big cluster of monkeypox cases that constituted an emergency, similar to how the agency responded to other epidemic-prone diseases in the country.\n“We have been working closely with state health ministries to strengthen monkeypox disease surveillance and response in the country.\n“We work with Enhanced Monkeypox Surveillance Project where we have been training health workers across states to rapidly detect and manage cases.\n“We will continue working with all states to strengthen monkeypox prevention, detection and control in Nigeria,” he explained."
  },
  {
    "headline": "Ex President, Abdulsalami Begs Nigerian Criminals To Repent",
    "summarized_story": "Former Head of State General Abdulsalami Abubakar has urged criminal elements in Nigeria to reconsider their actions and repent for the sake of Nigeria’s peace, growth, and stability.\nAbdulsalami made the statement after seeing the two rakaats Eid-el Kabir prayers at the Minna prayer venue.\nHe also prayed that Allah would move their hearts to condemn deeds like banditry, cattle rustling, and other criminal activities.\nIn his speech, Niger State Governor Abubakar Sani Bello urged Nigerians of all ethnic and religious backgrounds to pray fervently for the country’s security institutions.\nHe asked authorities at all levels to devise thoughtful strategies aimed at alleviating the current hardships that Nigerians are facing."
  },
  {
    "headline": "‘Sunday Igboho’s Juju Has Failed’ – Joe Igbokwe Mocks Agitator",
    "summarized_story": "Joe Igbokwe, an APC chieftain, has insulted Oduduwa agitator Sunday Adeyemo, commonly known as Igboho, over his incarceration.\nIgbokwe believes Igboho’s detention proves that “Juju” does not function.\nThe lawmaker added, “Juju” failed in the Southeast and has also failed in the Southwest, while posting a photo of Igboho wearing charms on his Facebook page.\nThe aide to Governor Babajide Sanwo-Olu of Lagos State wrote: “Juju no de work again ooo.\nIt failed in Igbo land and it failed too in Yoruba land.”Igboho had been at the vanguard of the Oduduwa Republic movement."
  },
  {
    "headline": "BREAKING: Interpol Arrested Igboho And His Wife In Benin Republic — Lawyer",
    "summarized_story": "Sunday Adeyemo, a Yoruba Nation agitator, and his wife, Ropo, were detained by the International Criminal Police Organization in Cotonou, Benin Republic, according to the activist’s primary attorney, Yomi Alliyu (SAN).\nIn a statement acquired by The PUNCH on Tuesday, Alliyu disclosed this.\nAccording to him, Adeyemo aka Sunday Igboho and his wife, a German citizen, were apprehended by the Federal Government of Nigeria through INTERPOL on Monday night at an airport in Benin Republic, one of Nigeria’s West African sub-regional neighbors.\nWhile attempting to board a trip to Germany with his wife, Igboho was apprehended.\nThe Nigerian Federal Government has put the Nigeria Immigration Service and the Nigeria Customs Service on high alert to prevent Igbos from fleeing the nation."
  },
  {
    "headline": "Pictures: Taekwondo athlete, Elizabeth Anyanacho, in first training session at Kisarazu Japan days to Olympics battle",
    "summarized_story": ""
  },
  {
    "headline": "VIDEO: In Tokyo, Elizabeth Anyanacho, officials receive Taekwondo brand new gears, kits for Olympics",
    "summarized_story": "Taekwondo star Elizabeth Anyanacho alongside Olympian Chika Chukwumerije and Secretary General Kabir Yusuf on Friday recieved and unveiled brand new gears and kits from South Korea.\nBranded by Motor company, Olympian to be Anyanacho currently at her training camp in Japan later wore and displayed the wears.\nAn excited Anyanacho while expressing her feeling said, “Yea, it looks good.\nI can’t wait to train and get ready for the contest.”"
  },
  {
    "headline": "Subsidy saga: Govt’s stance, citizens’ dilemma",
    "summarized_story": "Alas, it was not too long before the government reverted to status quo with the NNPC once again funding subsidy.\nThe actual consumption of petroleum products in Nigeria is also not ascertained to determine the amount of subsidy the Nigeria government pays to importers.\n“The NNPC refineries have been running below capacity for over 20 years and the government has not done anything about it.\n“The petroleum products directly impact the daily living of Nigerians and removal of subsidy without commensurate cushion will increase the hardship in the country,” he said.\nRegrettably, the Nigerian State is complicit and remains the number one stumbling block to finding solutions to the subsidy saga."
  },
  {
    "headline": "FG flags off construction of Kaduna Kano segment of Lagos-Kano Railway -NigPilot",
    "summarized_story": "Federal Government has flagged off the construction of the Kaduna-Kano segment of the Lagos-Kano railway modernization project.\nHe said, “This project is crucial to the establishment of a supply chain in railway transport within its corridor, Kano – Kaduna – Abuja, as it links the major commercial cities of Kano and Kaduna to the Federal Capital Territory, Abuja”.\nHe said “The scope of the railway project involves a 203km double track standard gauge railway from Kano to Kaduna.\nThis railway line will present an opportunity for Nigerians to traverse between Abuja and Kano via Kaduna with relative ease”.\nThe Kaduna – Kano railway project is to link the Lagos – Ibadan Railway project via Abuja, Minna, Ilorin, Oshogbo, Ibadan to Lagos on one end, and Maradi, Niger Republic on the other."
  },
  {
    "headline": "SOCIAL PLUS AFRICA BOSS TURN 40 -NigPilot",
    "summarized_story": "A man of good repute, God-fearing, kind, compassionate, peace-loving, hardworking, fearless… All these and many more will be identified with the man JAMES MOMOH JIMOHHe always wears a smile.\nBorn on July 19th, 1981, Mr. JAMES is from Okene, Kogi State and is of ebira descent,Though from a humble background, he never believes in limitations and thinking small.\nHis life is one shining example to young people (especially young boys) who see their backgrounds as a limitation.\nIf there is a force to reckon with, James Momoh is one of such individuals.\n@ 40, MR JAMES MOMOH is the CEO of Social Plus Africa Communications Ltd and Chairman, Jovial Global Services Ltd respectively."
  },
  {
    "headline": "NSIP: FG distributes engagement letters, devices to independent monitors in Beune",
    "summarized_story": "Federal government through the Federal Ministry of Humanitarian Affairs, Disaster Management and Social Development has distributed engagement letters and tablets to trained independent monitors to track the various packages of the National Social Investment Programme, NSIP, in Benue State.\nA statement signed by Grace Osuji said the ministry is repositioning the NSIP in line with the federal government’s commitment to lifting 100 million Nigerians out of poverty.\nShe said the programmes include the job creation programme – N-POWER, National Home Grown School Feeding Programme, NHGSFP, Conditional Cash Transfer Programme, CCT, and the Government Enterprise and Empowerment Programme, GEEP.\n‘’We flagged-off the training of 5,000 independent monitors for the National Social Investment Programme in Abuja on Thursday, February 4.\nThe training was carried out across the country from February to April.”Each independent monitor is expected to monitor a designated number of beneficiaries of the National Social Investment Programme."
  },
  {
    "headline": "Minister of State for Transportation, Gbemisola Saraki",
    "summarized_story": "National Assembly has directed the Federal Ministry of Transportation to check the arbitrary hike on transportation fares, especially during festive periods.\nA statement signed by Eric Ojiekwe, Director of Press to the Minister of State for Transportation, Gbemisola Saraki, who made this known during a meeting with stakeholders in the road transport sub-sector in Abuja, said the meeting was at the instance of the House of Representatives, following deliberations on the arbitrary increase in transport fares during festive periods, particularly for land transport.\nAt the end of the deliberation, stakeholders called on the federal government to prioritize road construction and maintenance to reduce the damage to vehicles.\nThey equally called on the government to reduce park duties while also enacting traffic laws backed up with technology.\nFurthermore, they also advised that the activities of unions be monitored and regulated to reduce the hardship on passengers."
  },
  {
    "headline": "Eid-El-Kabir: Muslims Observe Rakat Prayers At Eid Grounds",
    "summarized_story": "In the nation’s capital, Muslims converged on the Abuja National Eid Ground to observe the three Rak’at.\nBefore going into the Eid ground, worshippers lined up to have their temperatures checked as health workers are also on the ground to administer hand sanitizers on the hands of the worshippers.\nAmong the personalities who observed prayer at the National, Eid ground is the FCT Minister, Mohammed Bello.\nPresident Buhari and other dignitaries observed prayers were at the Kofar Arewa Eid Prayer Ground.\nSanusi Leads Prayers In KadunaIn Kaduna, former Emir of Kano, Muhammadu Sanusi led the Eid prayer at the Murtala Mohammed prayer ground in the Kaduna metropolis."
  },
  {
    "headline": "Sunday Igboho Arrested In Benin Republic",
    "summarized_story": "Yoruba Nation agitator, Sunday Adeyemo, also known as Sunday Igboho, has been arrested in Cotonou, Benin Republic.\n“I received last night the troubling information that Chief Sunday Adeyemo fondly called Igboho had been arrested at the Cotonou Airport,” Akintoye said.\nAccording to The Punch, Igboho was arrested at an airport in Cotonou on Monday night by the security forces in Benin Republic while trying to flee to Germany.\n“He was arrested in Cotonou while he tried to travel out on Monday night.\nThe security forces in Benin Republic should repatriate him to Nigeria on Tuesday,” the source said."
  },
  {
    "headline": "Eid-El-Kabir: Demonstrate Good Virtues Of Islam, Buhari Tells Muslims",
    "summarized_story": "President Muhammadu Buhari in his Eid greetings on the occasion of Eid El-Adha called on Muslims in the country to demonstrate the good virtues of Islam.\nThis was disclosed in a statement signed on Monday by the Senior Special Assistant to the President on Media and Publicity, Garba Shehu.\nSpeaking on the significance of the Eid El-Kabir celebration, the President appealed to Muslims “to demonstrate the good virtues of Islam through personal examples and practices.”He added that “Taking advantage of the celebration to exploit fellow citizens through outrageous prices of food and rams is inconsistent with fine virtues of Islam.\nRemember that Islam is a religion of charity that urges us to love our neighbour as we love ourselves.\n“I urge all Muslims to continue to live in peace and harmony with their fellow Nigerians of other faiths in the spirit of peaceful coexistence."
  },
  {
    "headline": "Akintoye Confirms Arrest Of Sunday Igboho In Benin Republic",
    "summarized_story": "A renowned historian and leader of the Umbrella Body of Yoruba Self-Determination Groups, Emeritus Professor Banji Akintoye, has confirmed the arrest of Yoruba Nation Agitator, Sunday Adeyemo, popularly called Sunday Igboho in Benin Republic.\nAkintoye, however, said he, alongside others are currently working to provide legal assistance for Ighoho to prevent his extradition into Nigeria, saying “Benin Republic is a land that respect the rules of law.”This was disclosed in a statement signed on Tuesday by Akintoye.\n“I received last night the troubling information that Chief Sunday Adeyemo fondly called Igboho had been arrested at the Cotonou Airport.\n“Fortunately, Benin Republic is reliably a land of law where the authorities responsibly obey the law,” the statement read in part.\nThe popular historian called on all Yoruba citizens within and beyond the shores of Nigeria to ensure that their ancestral land is not defeated by invaders."
  },
  {
    "headline": "Buhari Gifts Katsina Corps Members Two Cows, 20 Bags Of Rice, N1m",
    "summarized_story": "President Muhammadu Buhari on Tuesday gave members of the National Youth Service Corps (NYSC) in Katsina State two cows, 20 bags of rice and N1 million to mark the Eid El-Kabir celebrations.\nBuhari also commended former Head of State, Gen. Yakubu Gowon for the NYSC initiative, which he said had created more opportunities for uniting the country.\nREAD ALSO: President Buhari Urges More Nigerians To Embrace Farming“Every time I meet with former Head of State, Gen. Yakubu Gowon, like recently, I still commend him for the initiative of the NYSC.\nHe said the Emir of Daura, Alhaji Faruk Umar Faruk, had shown a lot of kindness and warmth to corps members as well in his domain, appreciating the community for always supporting them.\nBabayo assured the President of prayers for a successful time in office, and God’s providence in decision making that will move the country forward."
  },
  {
    "headline": "Police rescue one hundred kidnapped victims without ransom in Zamfara",
    "summarized_story": "Police in Zamfara have rescued one hundred kidnapped victims without ransom.\nThey were rescued by troops of the Nigerian Police in Dajin Kabaro Forest in Zamfara state after forty two days in captivity.\nAddressing newsmen in Gusau on the successes, the spokesperson of the state Police Command Superintendent Shehu Mohammed said the victims were abducted in Mutunji and Dan- Sadau communities in Maru local government area of Zamfara state while on their way to Gusau the state CapitalThey are mostly women, young men and children.\nAdvertisementTwenty out of the one hundred victims were reunited with their families due to their ill health.\nThe Zamfara State Police Command assured it will continue to protect citizens in all nooks and crannies of the stateThe release of the one hundred kidnap victims after forty two days in captivity is coming few days after thirteen Police Personnel were killed by armed Bandits in Zamfara."
  },
  {
    "headline": "DPR clarifies issue on subsidy removal",
    "summarized_story": "The Department of Petroleum Resources (DPR) says the misinterpretation of comments about subsidy elimination has caught its attention.\nThis follows an online publication claiming that without alternative energy, the price of PMS could rise to N1,000/litre if the subsidy is removed.\nA statement issued by the Head, Public Affairs DPR, Paul Osu stated that the publication’s headline is misleading, since the Director/CEO DPR’s words were plainly taken out of context.\nThe Director also emphasized that the government’s strategy for alternative energy sources is a key program, which has resulted in the declaration of the Decade of Gas (DoG), with the goal of transitioning the Nigerian economy to a gas-based economy by 2030.\nAdvertisementThe Department reiterated its commitment to enabling businesses and creating opportunities through a downstream focus on Quality, Quantity, Integrity, and Safety (QQIS)."
  },
  {
    "headline": "Mali’s interim president Goita survives attempted knife attack during Eid prayers in Bamako",
    "summarized_story": "Two armed men, including one who wielded a knife, on Tuesday attacked Mali’s interim President Assimi Goita during Muslim Eid Mubarak festival payers in the nation’s capital Bamako, official sources confirmed.\nIn August 2020, Col. Goita led a coup against President Ibrahim Boubacar Keita’s government, and in May of last year, he led a coup against a transition government in which he served as Vice President.\nHowever, Goita has consistently pledged to adhere to the political transition timetable, which includes holding a referendum in October and general elections in February 2022 to return the country to civilian rule.\nNigeria’s former President Goodluck Jonathan, the ECOWAS chief mediator on the Mali crisis, has undertaken several peace missions to Bamako.\nThe knife attack in Mali on Tuesday highlights the country’s precarious political and security situation."
  },
  {
    "headline": "Trump Inaugural Committee Head Arrested, Accused of Being UAE Agent",
    "summarized_story": "Besides conspiracy, Barrack was charged with obstruction of justice and making multiple false statements during a June 2019 interview with federal agents.\nAlso charged in a seven-count indictment were Matthew Grimes, 27, of Aspen, Colorado, and Rashid al Malik, 43, of the United Arab Emirates.\nAuthorities said Barrack served as an informal adviser to Trump’s campaign from April 2016 to November 2016 and chair of the Presidential Inaugural Committee from November 2016 to January 2017.\nBeginning in January 2017, he informally advised senior U.S. government officials on Middle East foreign policy, they added.\nThey said that after one appearance in which Barrack repeatedly praised the United Arab Emirates, Barrack emailed al Malik, saying: “I nailed it."
  },
  {
    "headline": "Nigeria’s DPR Says Petrol Could Climb To N1,000 Post-Subsidy",
    "summarized_story": "Joshua Odebisi, Analyst with Vetiva Capital, spoke to the Global Business Report about Nigeria’s Department of Petroleum Resources saying post-subsidy petrol could climb to N1,000 per litre if alternative fuel isn’t a likely option for Nigerians.\nHe also spoke about Energy company Oando and the Nigerian Securities and Exchange Commission (SEC) settling their 4-year dispute and Kenya writing crowdfunding legislation.\nWatch the video for more…"
  },
  {
    "headline": "World’s Richest Man Bezos Completes Successful First Space Jaunt",
    "summarized_story": "“Best day ever,” Bezos said after the space capsule touched down, kicking up a cloud of dust on the desert floor.\nAfter landing and exiting the space capsule, Bezos and the other crew members exchanged hugs and popped champagne, spraying each other.\nHe stepped out to cheers from family members and Blue Origin employees and gave high-fives to some of the roughly two dozen people on hand.\nOn Twitter, Musk wished the Blue Origin crew “best of luck” hours before the launch.\nBlue Origin aims for the first of two more passenger flights this year to happen in September or October."
  },
  {
    "headline": "Yoruba Nation Agitator Sunday Igboho Arrested in Cotonou: Reports",
    "summarized_story": "Yoruba Nation agitator, Sunday Adeyemo also known as Sunday Igboho, has reportedly been arrested in Cotonou, Benin Republic, according to local sources.\nHe was arrested at an airport in Cotonou on Monday night, a top source familiar with the matter told local media.\nIgboho was arrested by the security forces in Benin Republic about three weeks after the Department of State Services declared him wanted for allegedly stockpiling arms, an allegation he has since denied.\n“He was arrested in Cotonou while he tried to travel out on Monday night.\nThe security forces in Benin Republic should repatriate him to Nigeria on Tuesday,” the source said."
  },
  {
    "headline": "Research: India’s Deaths During Pandemic 10 Times Official Toll",
    "summarized_story": "India’s excess deaths during the pandemic could be a staggering 10 times the official Covid-19 toll, likely making it modern India’s worst human tragedy, according to the most comprehensive research yet on the ravages of the virus in the south Asian country.\nMost experts believe India’s official toll of more than 414,000 dead is a vast undercount, but the government has dismissed those concerns as exaggerated and misleading.\n“True deaths are likely to be in the several millions not hundreds of thousands, making this arguably India’s worst human tragedy since Partition and independence,” the report said.\n“This analysis reiterates the observations of other fearless investigative journalists that have highlighted the massive undercounting of deaths,” Jacob said.\nMurad Banaji, who studies mathematics at Middlesex University and has been looking at India’s COVID-19 mortality figures, said the recent data has confirmed some of the suspicions about undercounting."
  }
]