[
  {
    "headline": "Fake customs officer bags 20-year imprisonment for job fraud",
    "summarized_story": "• Court jails two fraudsters in EdoA Kwara State High Court sitting in Ilorin, Kwara State, on Thursday, sentenced a 34-year-old man, Yakubu Afolayan, to 20 years’ imprisonment for impersonation and job scam.\nThe convict, who hailed from Share, in the Ifelodun Local Government Area of Kwara State, was arraigned on March 14, 2019.\nThe prosecution told the court that Afolayan, between November 2018 and January 2019 in Ilorin fraudulently obtained the sum of N267,000 only from one Usman Opeyemi.\n“I hereby sentence you, Yakubu Azeez Afolayan to seven years’ imprisonment on count one; seven years’ imprisonment on count two; three years’ imprisonment on count three and three years’ imprisonment on count four, to run concurrently.\nJustice Ikponmwonba convicted and sentenced Omoregbe to two years’ imprisonment with an option of fine of N200,000 , while Efewengbe was sentenced to six months’ imprisonment with an option of N200,000 fine."
  },
  {
    "headline": "Decomposing female body found in Delta drainage",
    "summarized_story": "The Delta State Police Command has confirmed the discovery of the decomposing body of an unidentified lady around the Federal University Junction of the East-West Road in the state.\nPUNCH Metro learnt that the corpse was discovered on Wednesday by passersby.\nThe corpse was reportedly discovered lying face down inside a drainage system connected to the Agbarho River.\nThe victim, according to witnesses, appeared to have been killed before she was dumped in the drain.\n“The corpse is already decomposing."
  },
  {
    "headline": "Cultists attack Ogun APC campaign, kill two",
    "summarized_story": "Pandemonium broke out on Thursday during the local government campaign of the All Progressives Congress in the Odeda Local government Area of Ogun State when cultists clashed, leaving two persons dead .\nThe state governor, Dapo Abiodun was hurriedly whisked away by the security operatives during the gun duel.\nOur correspondent gathered that two cults in the council engaged in a supremacy battle shortly after the governor arrived the campaign venue.\nA source told our correspondent that one of the cultists shot a member of another group in the head in the head.\nThis development prompted the people to take to their heels while the suspected killer was reportedly shot dead in a reprisal."
  },
  {
    "headline": "Insurance: Dark days are over — NSITF Chairman",
    "summarized_story": "…tasks Business owners in Delta on Employees Compensation schemeBy Festus Ahon, AsabaCHAIRMAN of the Nigeria Social Insurance Trust Fund Management Board, NSITF, Prince Austin Enajemo-Isire, has said the dark days and days of negative stories about funds were now in the past with the recent repositioning of the new Managers, both at executive and Board level as recently inaugurated by the Federal Government.\nHe urged Business Community Leaders, Corporate business owners and other stakeholders in Asaba and Warri, Delta State to enrol their staff for the Social insurance cover provided by the fund in line with the provisions of the Employees Compensation Act 2010.\nSaying that NSITF has been repositioned with the newly inaugurated Executives and reinvigorated Management Board, he said the new team was poised to deliver on the mandate of the fund.\nEnajemo-Isire who is a financial expert and insurance guru of over 32 years in the risk management industry, spoke about the origin of NSITF which began with its establishment in 1961 as Nigerian Provident Fund, NPF, until 1993 when a new law was enacted that transformed it into NSITF.\nThe NSITF chairman who also visited the Warri branch office, charged the staff to purge themselves of all old habits, which, according to him, had done the Fund no good."
  },
  {
    "headline": "National Library boss highlights gains of ISBN online registration",
    "summarized_story": "The Chief Executive Officer, National Library of Nigeria (NLN), Prof. Lenrie Aina, has advised publishers to embrace online registration of the International Standard Book Number (ISBN).\nHe said the two-day workshop was designed to train and guide publishers on how to obtain ISBN online.\nNebo said the workshop had been rewarding since it was introduced in Enugu in 2017, considering the increase in ISBN registration.\nShe said the 2021 NLN workshop, which started in Katsina State, had taken place in six zones with their catchment states.\nIn a goodwill message, the National President, Nigeria Publishers Association, Mr Uchenna Anioke, advised that the registration be made both manual and online."
  },
  {
    "headline": "IPMAN says tanker drivers’ strike can cause petrol scarcity in Rivers",
    "summarized_story": "Joseph Ebele, Chairman, Independent Petroleum Marketers Association of Nigeria (IPMAN), Rivers chapter has said that the ongoing Petroleum Tanker Drivers Union (PTD) strike can lead to fuel scarcity.\nHe said that the strike was caused by a misunderstanding that ensued when the content of two fully-loaded trucks of petroleum products impounded by the security operatives got missing.\n“I want to state that about two months ago, two trucks suspected to have been loaded with adulterated petroleum products were impounded by security operatives.\n“PTD has declared that no truck is permitted to load or convey petroleum products in any depot within the state pending replacement of the alleged missing products,” he said.\nEbele said that at present, IPMAN was dispensing reserved products to fuel stations and might run short of products if the situation lingered."
  },
  {
    "headline": "Nigerians should copy the spirit of the Igbo man ― Ikpeazu",
    "summarized_story": "By Ugochukwu Alaribe – UmuahiaAbia State Governor, Dr Okezie Ikpeazu, has called on other Nigerians to copy the spirit of the Igbo man to enhance national cohesion and development.\nIkpeazu who stated this in an interview in Aba, explained that the Igbo man is the only real Nigeria who can find investment everywhere across the federation.\nIn his words; “Nigerians should copy the spirit of the Igbo.\nThey should copy the outlook of the Igbo man.\n“The Igbo man doesn’t just see Sambisa as a forest, but as an investment opportunity."
  },
  {
    "headline": "COAS names office complex after Attahiru",
    "summarized_story": "The Chief of Army Staff (COAS), Lt.-Gen. Faruk Yahaya, has opened a new office complex built and named after the late COAS, Lt.-Gen. Ibrahim Attahiru.\nThe office accommodation is located at the Headquarters of Joint Task Force, North East, Operation Hadin Kai (OPHK) in Maimalari Cantonment, Maiduguri.\nThe Director, Army Public Relations, Brig.-Gen. Onyema Nwachukwu, made this known in a statement on Thursday in Abuja.\nYahaya said that the gesture was to honour Attahiru for his contributions and sacrifice towards uplifting the Nigerian Army.\nThe COAS also said that the facility would provide environment conducive for the staff officers and administrative staff to perform their duties."
  },
  {
    "headline": "Shun mischief, make suggestions when necessary – Abia Speaker, Orji urges constituents",
    "summarized_story": "The Speaker of Abia State House of Assembly, Rt Hon Chinedum Enyinnaya Orji, has admonished the people to shun jealousy, backbiting, malice, mischief and falsehood whether in their personal relationships or in politics.\nThe lawmaker said he was always open to constructive criticisms and looked forward to advice and suggestions that could make him perform even better and deliver greater democracy dividends to the people.\n“In whatever area you feel I need to improve, kindly feel very free to tell me.\nI am ready to take your advice and see how I can implement your suggestions as possible as I can because democracy is all about the people”, Orji said.\nThey further lauded the numerous projects he has attracted to the constituency and even beyond, and those he has embarked upon directly by himself, describing his scorecard as “the incontrovertible evidence of dividends of democracy to the people”."
  },
  {
    "headline": "Nigerian Army honours late chief, Ibrahim Attahiru",
    "summarized_story": "The Nigerian Army has honoured the late chief, Lieutenant General Ibrahim Attahiru.\nNew Army Chief, Yahaya pays last respect to predecessor, AttahiruThe COAS hailed Attahiru for his contribution and sacrifice towards the upliftment of the Army.\nThe accommodation comprises six medium-sized en-suite offices, two executive-sized en-suite offices, two Personal Assistants’ offices, and two offices for administrative staff.\nIn attendance were Chief of Army Operations, Major General Olufemi Akinjobi; Theatre Commander OPHK, Major General Christopher Musa; Provost Marshal Army, Major General Olumuyiwa Aiyenigba.\nOthers included Chief of Military Intelligence (Army) Brigadier General Danladi Salihu; Acting GOC 7 Division/Commander Sector 1 OPHK, Brigadier General Abdulwahab Eyitayo; OPHK Commanders and Principal Staff Officers."
  },
  {
    "headline": "BREAKING: Igboho remains in Cotonou cell as court adjourns hearing",
    "summarized_story": "The embattled Yoruba Nation freedom fighter, Sunday Adeyemo, popularly known as Sunday Igboho, has been returned to cell in Benin Republic.\nThe development followed the decision of the Court D’Appeal in Cotouno to adjourn the hearing on his extradition to Friday, July 23, 2021.\nIgboho’s wife, a German who was arrested alongside her husband at an airport in Cotonou, Benin Republic was however released.\nDAILY POST reports that there was uncertainty on Thursday evening when the hearing began at the Cour De’appal De Cotonou.\nIgboho arrived the court at about 5pm on Thursday evening."
  },
  {
    "headline": "China explains Nigeria loans, rejects ‘plot to hijack sovereignty’",
    "summarized_story": "The Peoples Republic of China on Thursday said the country’s loans to Nigeria are of mutual benefit.\nCui Jianchun, Chinese ambassador to Nigeria spoke to reporters at a seminar, “Learning from the Chinese Communist Party’s history and creating a brighter future”, which took place at the University of Abuja.\nJianchun explained that Nigeria and China had a history of good friendship and bilateral relations.\nThe official said China is working with Nigeria on rail because money is now a big constraint, just like in 1978 when his country had no money.\nThe ruling party currently has more than 95 million members in a country of 1.4 billion people, making it the largest governing party in the world."
  },
  {
    "headline": "Our investments in infrastructure, security yielding fruits in Abia – Ikpeazu",
    "summarized_story": "Governor Okezie Ikpeazu of Abia State has expressed joy that the renewal of infrastructure embarked upon by his administration and the subsequent measures taken to ensure adequate security in the state are yielding positive results through the influx of investors to the state.\nIn his speech, the member representing Aba South and Aba North Federal Constituency, Hon.\nChimaobi Ebisike thanked Governor Ikpeazu for placing Abia on the world map of progress through his infrastructural revolution which has been attracting investors and hoped that more will come to invest in the state.\nThe clinic is located at Aba Owerri Road off Eziukwu Road, just after the Railway Crossing, Aba.\nMeanwhile, Governor Okezie Ikpeazu has said despite the economic challenges confronting the nation, his decision to harness the ingenuity and creativity of Abians is gradually paying off as the God’s Own State remains the SMEs capital of the nation."
  },
  {
    "headline": "Wike threatens to seal shop premises littered with refuse",
    "summarized_story": "By Mike Odiegwu, Port HarcourtRivers State Governor Nyesom Wike has threatened to seal shops and business areas, whose premises are littered with wastes.\nThe governor, who on Thursday spoke during an unscheduled inspection of four ongoing flyover projects in Port Harcourt and Obio-Akpor local governments, said he took the decision following the carefree attitude of the public towards sanitation.\n”The flyover projects inspected by the governor are the Rumuola, GRA junction, Orochiri/Wurukwo and Oru-Abali flyovers.The governor frowned on the operation of illegal parks and other illegal trading activities around the ongoing flyover projects.\nWike restated the commitment of his administration to work in advancing the state and improving the quality of living of Rivers people.\nThe governor said his administration would honour the social contract reached with Rivers people since 2015 to provide them good governance and quality infrastructure."
  },
  {
    "headline": "‘No fake forms in Abia APC’",
    "summarized_story": "Our ReporterThe All Progressives Congress (APC) in Abia State has said there are no fake ward congress nomination forms in circulation.\nThe party, in a statement by its Chairman, Enyinnaya Harbour and Secretary, Chidi Avajah, urged interested members to pick up the forms after payment to designated banks.\nAny information with regards to the ongoing sale of forms for congresses should be directed to the national headquarters of the APC.\n“Interested party faithful should ignore distractions, particularly from a sinking ship and approach designated banks to pay for their forms.\nSoon, Abia shall be free.”"
  },
  {
    "headline": "Four policemen, others feared killed as gunmen attack checkpoint in Enugu",
    "summarized_story": "By Damian Duruiheoma, OwerriNo fewer than four policemen were feared killed when gunmen attacked a checkpoint in Obeagu-Amechi community in Enugu South local government on Wednesday night.\nThough the casualty figure remains unclear, residents told The Nation they counted four bodies of slain policemen after the attack.\nEnugu Police Command confirmed the attack but said it would present the casualty figure later.\nA police patrol van was set ablaze by the gunmen during the attack.\n“The shooting lasted about 30 minutes."
  },
  {
    "headline": "Much ado about electronic transmission of election results",
    "summarized_story": "Beyond stealing the country blind in the first 15 years of the fourth republic, the political elite did very little to enhance the course of democracy.\nIt was similarly used to justify the 1979 inconclusive election eventually validated by the courts using Richard Akinjide’s twelve-two-third formula.\nThis type of mindset and northern leaders feeling of invincibility anchored on questionable numerical strength, if you ask me, poses a greater threat to our budding democracy than manual or electronically transfer of election results.\nAfter all, a critical analysis of our election outcomes especially at the local council levels since the beginning of the fourth republic will show that there is honour among thieves.\nOur political leaders hardly lose elections in their strongholds."
  },
  {
    "headline": "Igboho: Cotouno court shifts extradition trial to Friday",
    "summarized_story": "From Godwin Tsa, AbujaHearing in the extradition trial of detained Yoruba Nation agitator, Sunday Adeyemo, also known as Igboho has been shifted to Friday by Court D’Appeal in Cotouno, Republic of Benin.\nThe development came as the Federal Ministry of Justice on Thursday said it has no information about the planned arraignment and trial.\nIt was reported that Igboho, who was arrested alongside his German wife, Ropo, where taken to court for a scheduled extradition trial.\nIgboho was arrested in Cotonou with his German wife, Ropo, while trying to travel out of the country.\nHowever, according to agency report, the Igboho’s who were taken to court earlier today, were however returned to to cell in Benin Republic, after court proceedings were adjourned to Friday, July 23."
  },
  {
    "headline": "Igboho: Move to fasttrack his extradition suffers set back?",
    "summarized_story": "From Oluseye Ojo, IbadanThe efforts by the Federal Government of Nigeria to fast track the extradition of Yoruba nation activist, Chief Sunday Adeyemo, fondly called Sunday Igboho, may have suffered a setback.\nThis came as indications have emerged that the government of Benin Republic has resolved to in the first instance try Igboho in court allegedly obtaining a fake Beninoise international passport in Cotonou.\nReports from Benin Republic said Igboho and his wife, who were arrested on Monday night on their way to Germany at Cadjèhoun Airport, Cotonou, were taken to court on Thursday.\nSources said the the Beninoise government said it would not handle a request for Igboho’s extradition, until he has been tried for the local offense he was arrested for on the Beninoise international passport.\nA Beninoise lawyer, identified as Rafael Huvehnou, was said to have been hired to defend Igboho in the court."
  },
  {
    "headline": "BREAKING: First batch of Super Tucano aircraft arrives",
    "summarized_story": "The first batch of A-29 Super Tucano aircraft has arrived in Kano, sunnewsonline.com can report authoritatively.\nThe aircraft arrived Nigerian Air Force base in Kano on Thursday July 22, 2021 at about 12.34 pm.\nAir Commodore Edward Gabkwet, NAF Director of Public Relations and Information confirmed the arrival of the fighter aircraft in a statement.\nMinister of Defence, Major General Bashir Magashi (Rtd), Chief of Army Staff, Lieutenant General Faruk Yahaya and Chief of Air Staff, Air Marshal Oladayo Amao”, he said.\nDetails shortly…Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "BREAKING: Igboho arrives court in Cotonou",
    "summarized_story": ""
  },
  {
    "headline": "9 die, 16 injured on Lagos-Ibadan expressway accident",
    "summarized_story": "Federal Road Safety Corps (FRSC) in Ogun State has confirmed the death of nine people in an accident involving two vehicles on the Lagos-Ibadan expressway, yesterday.\nFRSC Sector Commander in the state, Ahmed Umar, said 16 other persons sustained varying degrees of injuries.\nThe sector commander further said the accident involved 25 persons, with nine killed and 16 injured.\nUmar said the cause of the accident could be traced to speed violation and overloading on the part of the commercial bus driver.\nHe said the commercial bus lost control due to excessive speeding and rammed into the truck."
  },
  {
    "headline": "A-29 Super Tucano Fighter Planes Arrive Nigeria",
    "summarized_story": "By Kingsley NwezehThe Nigerian Air Force Thursday announced the arrival of A29 Super Tucano fighter planes from the United States.\nThe fighter jets were received by the Minister of Defence, Maj. Gen.Bashir Magashi (rtd) and the service chiefs.\n“The first batch of A-29 Super Tucano aircraft have arrived Kano, today, (Thursday) July 22, 2021 at about 12.34pm.\n“On hand to receive the aircraft were the Honourable Minister of Defence, Major General Bashir Magashi (rtd), Chief of Army Staff, Lieutenant General Faruk Yahaya and Chief of Air Staff, Air Marshal Oladayo Amao,”it said.\nThe aircraft flew through five countries, notably Canada, Spain, Greenland, Iceland and Algeria before arriving Nigeria."
  },
  {
    "headline": "Igboho Arrives Beninese Court Ahead of Trial",
    "summarized_story": "By Sunday EhigiatorEmbattled Yoruba Nation Activist, Sunday Adeyemo, popularly known as Sunday Igboho earlier today, arrived at the Court De’appal De Cotonou, ahead of his arraignment by the authorities of Benin Republic for immigration-related offences.\nHe was then arrested at Cardinal Bernardin International Airport, Cotonou, Republic of Benin, with his wife on their way to Germany on Monday night.\nAn inside source had on Wednesday night hinted that Igboho might be charged for passport-related reasons.\nThe source said, “Igboho may be arraigned for passport-related offences in Benin Republic tomorrow.\nYoruba leaders in the Benin Republic have been supportive as well.”It was gathered that some Yoruba living in and around Cotonou on Thursday thronged the court awaiting the commencement of the trial."
  },
  {
    "headline": "FCT Cholera Death Toll Hits 60",
    "summarized_story": "By Olawale AjimotokanThe Federal Capital Territory Administration has said that 60 persons have died as a result of the current Cholera outbreak in the FCT.\nThe minister, who was represented by the Acting Executive Secretary of FCT Primary Health Care Board, Dr. Iwot Ndaeyo, also revealed that suspected cases had risen from 604 to 698 within last 72 hours, while the death toll had also climbed from 54 to 60.\nShe noted that Abaji area council recorded three suspected cases and no death, while Abuja Municipal Area Council (AMAC), 281 had suspected cases with 22 deaths.\nAlso Bwari Area Council recorded 134 suspected cases with 22 deaths.\nOthers were Gwagwalada area council with 220 suspected cases and nine deaths, Kuje area council, 23 suspected cases with four deaths and Kwali area council, which recorded 37 suspected cases with three deaths."
  },
  {
    "headline": "EIU Report: FG May Raise VAT to 15% Before 2025",
    "summarized_story": "The report titled, “Country Report Nigeria,” stated that the anticipated increase in VAT was inevitable given the rising public debt burden and the likelihood that the Petroleum Industry Bill (PIB) might not be able to deliver considerable increase in government’s revenue.\nIt also stated that the predicted VAT increase would be implemented instalmentally in 2022, 2024 and 2025.\nThe report from the research arm of The Economist magazine explained: “We expect three equal VAT rate increases, taking the rate to 15 per cent by 2025.\nIt added that the percentage of public debt to the GDP would stand at 35.4 per cent of the GDP in 2025.\nWe expect public debt to reach only 35.4 per cent of the GDP in 2025,” the report added."
  },
  {
    "headline": "NNPC Records 63% FAAC Remittance Shortfall in Five Months",
    "summarized_story": "The documents obtained from one of the federal ministries showed that N387.982 billion remained unpaid during the period under consideration, representing about 63.21 per cent actual budgetary forecast.\nAccording to the NNPC/ FAAC data, while the corporation was expected to pay a net amount of N122.767 billion monthly into the federation account, it was only able to remit N90.860 billion in January, N64.161 billion in February and N41.184 billion in March.\nBut as it earlier announced, the national oil company was unable to make any payment into the federation account in April, while a paltry N29.647 billion was remitted in May.\nIn March, also, N224.589 billion was distributed, while in April and May, N156.366 billion and N320 billion were disbursed respectively.\nHe said the NNPC could no longer afford to bear the cost, saying Nigerians would have to pay the actual cost sooner or later."
  },
  {
    "headline": "EXPOSED: Nigeria’s Attorney General Malami Mounts Pressure On Sowore’s Sureties In Order To Revoke Bail, Re-Arrest Activist",
    "summarized_story": "See Also ACTIVISM Human Rights Activist, Sowore’s Treason Trial Starts Afresh As Judge Abandons Case Over ‘Nigerian Government Trouble’\"They’re scared!\nJustice Ojukwu subsequently ordered that Sowore and Bakare be released on bail but the DSS disobeyed the order for several weeks.\nA court official said the judge picked a few cases and returned some others to the CJ, including Sowore’s case.\nHowever, it was learnt that two other judges in the Federal High Court had refused to take over Sowore’s case.\nNo judge is willing to sit on Sowore’s case."
  },
  {
    "headline": "EXPOSED: Nigeria’s Attorney General Malami Mounts Pressure On Sowore’s Sureties In Order To Revoke Bail, Re-Arrest Activist",
    "summarized_story": "See Also ACTIVISM Human Rights Activist, Sowore’s Treason Trial Starts Afresh As Judge Abandons Case Over ‘Nigerian Government Trouble’\"They’re scared!\nJustice Ojukwu subsequently ordered that Sowore and Bakare be released on bail but the DSS disobeyed the order for several weeks.\nA court official said the judge picked a few cases and returned some others to the CJ, including Sowore’s case.\nHowever, it was learnt that two other judges in the Federal High Court had refused to take over Sowore’s case.\nNo judge is willing to sit on Sowore’s case."
  },
  {
    "headline": "EXPOSED: Nigeria’s Attorney General Malami Mounts Pressure On Sowore’s Sureties In Order To Revoke Bail, Re-Arrest Activist",
    "summarized_story": "See Also ACTIVISM Human Rights Activist, Sowore’s Treason Trial Starts Afresh As Judge Abandons Case Over ‘Nigerian Government Trouble’\"They’re scared!\nJustice Ojukwu subsequently ordered that Sowore and Bakare be released on bail but the DSS disobeyed the order for several weeks.\nA court official said the judge picked a few cases and returned some others to the CJ, including Sowore’s case.\nHowever, it was learnt that two other judges in the Federal High Court had refused to take over Sowore’s case.\nNo judge is willing to sit on Sowore’s case."
  },
  {
    "headline": "BREAKING: Beninese Court Releases Sunday Igboho’s Wife, Orders Igboho To Remain In Custody",
    "summarized_story": "The Cour De’appal De Cotonou, Benin Republic, where Yoruba Nation agitator, Sunday Adeyemo (Igboho) and his wife, were arraigned on Thursday has ordered the wife to be released this evening.\nSaharaReporters learnt from court officials that the court ruled that Igboho should be returned to custody.\nThe wife is to be released this night and Sunday is to remain in custody.\nSaharaReporters had reported that Sunday Igboho was awaiting his fate at the Cour De’appal De Cotonou, Benin Republic, following his arraignment by the authorities of the country for immigration-related offences.\nSaharaReporters had reported how Benin Republic police on Monday night arrested Igboho at Cardinal Bernardin International Airport in Cotonou, while trying to fly from the country to Germany."
  },
  {
    "headline": "BREAKING: Beninese Court Releases Sunday Igboho’s Wife, Orders Igboho To Remain In Custody",
    "summarized_story": "The Cour De’appal De Cotonou, Benin Republic, where Yoruba Nation agitator, Sunday Adeyemo (Igboho) and his wife, were arraigned on Thursday has ordered the wife to be released this evening.\nSaharaReporters learnt from court officials that the court ruled that Igboho should be returned to custody.\nThe wife is to be released this night and Sunday is to remain in custody.\nSaharaReporters had reported that Sunday Igboho was awaiting his fate at the Cour De’appal De Cotonou, Benin Republic, following his arraignment by the authorities of the country for immigration-related offences.\nSaharaReporters had reported how Benin Republic police on Monday night arrested Igboho at Cardinal Bernardin International Airport in Cotonou, while trying to fly from the country to Germany."
  },
  {
    "headline": "Israel to rejoin African Union as observer -- 19 years after loss of status",
    "summarized_story": "Israel has submitted a letter of credence to rejoin the African Union as an observer — 19 years after the country lost the status.\nAdvertisementThe western Asian country was an observer member of the Organization of African Unity until it was dissolved and replaced by the African Union in 2002According to reports, The state of Israel lost the status following pressure from Muammar Gaddafi, late ex-Libyan leader.\nIn 2016, The Jerusalem Post had reported that Israel looked to regain the status in the AU, after the Palestinian Authority were granted this status in 2013.\nBuilding on this foundation, Aleleign Admasu, Israel’s ambassador to Addis Ababa, submitted letter of credence as observer to the African Union to Félix Tshisekedi, Chairperson of the 55-member continental organization.\n“This corrects the anomaly that existed for almost two decades,” Lapid continued, “and is an important part of strengthening of fabric of Israel’s foreign relations."
  },
  {
    "headline": "Israel to rejoin African Union as observer -- 19 years after loss of status",
    "summarized_story": "Israel has submitted a letter of credence to rejoin the African Union as an observer — 19 years after the country lost the status.\nAdvertisementThe western Asian country was an observer member of the Organization of African Unity until it was dissolved and replaced by the African Union in 2002According to reports, The state of Israel lost the status following pressure from Muammar Gaddafi, late ex-Libyan leader.\nIn 2016, The Jerusalem Post had reported that Israel looked to regain the status in the AU, after the Palestinian Authority were granted this status in 2013.\nBuilding on this foundation, Aleleign Admasu, Israel’s ambassador to Addis Ababa, submitted letter of credence as observer to the African Union to Félix Tshisekedi, Chairperson of the 55-member continental organization.\n“This corrects the anomaly that existed for almost two decades,” Lapid continued, “and is an important part of strengthening of fabric of Israel’s foreign relations."
  },
  {
    "headline": "Falana to FG: Igboho's extradition must follow due process -- he can't be deported",
    "summarized_story": "Femi Falana, a senior advocate of Nigeria (SAN), says the federal government cannot extradite Sunday Adeyemo, a Yoruba youth better know as Sunday Igboho, from Benin Republic without due process.\nIn a statement on Thursday, Falana said the request by Nigeria to extradite Igboho must be supported by a statement of offences.\n“It is pertinent to note that the 1994 ECOWAS Convention has superseded the 1984 Extradition Treaty between Nigeria, Togo, Benin and Ghana pursuant to Article 32 of the ECOWAS Convention on Extradition.\nBenin Republic.\n“With respect, the request cannot be granted as it has to comply with Article 18 of the Extradition Convention."
  },
  {
    "headline": "Falana to FG: Igboho's extradition must follow due process -- he can't be deported",
    "summarized_story": "Femi Falana, a senior advocate of Nigeria (SAN), says the federal government cannot extradite Sunday Adeyemo, a Yoruba youth better know as Sunday Igboho, from Benin Republic without due process.\nIn a statement on Thursday, Falana said the request by Nigeria to extradite Igboho must be supported by a statement of offences.\n“It is pertinent to note that the 1994 ECOWAS Convention has superseded the 1984 Extradition Treaty between Nigeria, Togo, Benin and Ghana pursuant to Article 32 of the ECOWAS Convention on Extradition.\nBenin Republic.\n“With respect, the request cannot be granted as it has to comply with Article 18 of the Extradition Convention."
  },
  {
    "headline": "Igboho to remain in custody as Beninese court adjourns till Friday",
    "summarized_story": "AdvertisementThe Cour De’appal De Cotonou in Benin Republic adjourned hearing till Friday, July 23.\nAfter the adjournment, neither Igboho’s lawyers nor the Beninese counsel spoke on what transpired in the court, BBC Yoruba reports.\nOlayomi Koiki, media aide to Igboho, had earlier said the outcome of the court hearing will be favourable.\nWe all know that Igboho is not a criminal or terrorist,” he had said.\nWhatever happens will be in our favour.”While the hearing lasted, Igboho’s supporters milled around the court premises awaiting the outcome."
  },
  {
    "headline": "This app wants to simplify Twitter giveaways, without bank accounts",
    "summarized_story": "Let’s say I wanted to send a surprise ‘happy birthday’ cash gift to a friend; my first thought would be to ask for their bank account number.\nI would do this for people I know very well but also for someone I only know on social media.\n“Like sending money through email addresses using PayPal, Vendly hopes to replicate that using social media handles,” he said.\nLong-term, Vendly will help social media users monetize their social media presence, the CEO said.\nThe message states the amount sent; recipient inputs the bank account where they want the cash to go."
  },
  {
    "headline": "Hundreds of MTN, Vodacom towers damaged in South Africa unrest",
    "summarized_story": "Telecommunications infrastructure owned by several mobile network operators was severely damaged in the rampant looting and destruction of property that rocked South Africa last week.\nThe Independent Communications Authority of South Africa (ICASA) revealed on Tuesday, July 13, that the vandalism included more than 100 mobile network towers in some parts of the country.\nVirtually all network providers operating in South Africa reported disruption to service delivery.\nChildren are evacuated from a burning building in downtown Durban, South Africa.\nJust one of its network towers was vandalised within the Durban area but it did not affect service delivery to consumers."
  },
  {
    "headline": "Senegal to produce rapid Covid tests in tech deal with major biotech companies",
    "summarized_story": "The Pasteur Institute in Senegal will produce rapid antigen tests for diagnosing the coronavirus disease from early 2022 with the help of a new tech transfer agreement.\nAn antigen test is regarded as a suitable ‘first line of defense’ against the coronavirus disease for individuals who have symptoms.\nIt plans to make 2.5 million tests per month in 2022, according to the statement.\nHowever, the rapid antigen test deal involving the Pasteur Institute comes at a time when Senegal is grappling with soaring coronavirus cases.\nAccording to health ministry spokesman Mamadou Ndiaye, the West African nation was seeing an “unprecedented” surge in Covid infections."
  },
  {
    "headline": "The Next Wave: What’s happening in francophone Africa?",
    "summarized_story": "Unique and untappedFrancophone Africa is home to an island country where many African startups register their headquarters.\nBetween 2015 and 2019, startups and SMEs in francophone Africa received $417.9 million, according to Briter Bridges, a research firm.\nGozem, a ride-hailing company which also offers ecommerce services, launched in Gabon, its third francophone country, this year with eyes on Cameroon and Dr Congo.\nFrancophone Africa is dogged by lack of clarity around regulations, language barriers and limited networking opportunities, per Briter Bridges report.\nThese concerns will take some time to quell, so maybe unicorn bells won’t ring in francophone Africa anytime soon."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "After its seed round of $350,000 and $150,000 cheque from Y Combinator as part of the accelerator’s Summer 2020 batch,..."
  },
  {
    "headline": "Google x Maliyo Games, Instagram and YouTube’s new features, and Clubhouse leaves beta",
    "summarized_story": "Mobile gaming: Per Business Wire, the mobile gaming market was worth $98 billion globally in 2020 and is expected to grow to $272 billion by 2030.\nAccording to Kevuru games, 59.9% of games were played on mobile in 2020, while 28.70% and 16.11% were played on PC and console, respectively.\nOn July 20, 2021, the company announced in a blog post that it was launching Sensitive Content Control.\nAccording to Instagram, sensitive content isn’t content that breaks the rules but could upset some users.\nOn July 20, 2021, YouTube announced it is rolling out a beta version of its new feature, Super Thanks."
  },
  {
    "headline": "Google partners Maliyo Games to train 500 African mobile game developers",
    "summarized_story": "Share this article:As Google’s interest in Africa’s tech talent pool deepens, the tech giant has partnered with Nigerian-founded game development studio, Maliyo Games, to open applications for a mobile game developer training program.\nAccording to the founder, this is one of the qualities that attracted Google to the project, aside from the fact that Maliyo Games has published some Africa-themed games on the Google Play Store.\nIn addition to that, Google will also provide support for app store success, which includes successful publishing of content on Google Play Store.\nMaliyo Games’ fitAs is typical of content from many indigenous companies, Maliyo Games studio ensures that its content reflects the African scene.\nIn his opinion, in the past 9 years of running Maliyo Games, opportunities that exist now are thinning out the effects of these challenges."
  },
  {
    "headline": "Nigeria’s Startup Bill, Kenya’s Zoom tax, Zimbabwe’s securities law",
    "summarized_story": "Share this article:Good day,What’s on the menu:Updates on Nigeria’s Startup BillKenya’s Zoom taxZimbabwe’s securities lawThe latest on Nigeria’s Startup BillIn May, we brought you news about a Startup Bill for Nigeria.\nSince the 90s, when the first tech companies were founded, Nigeria’s tech ecosystem has progressed.\nEvents like this have made it important for founders to interact with the government, hence, the Startup Bill.\nShould plans for the bill go as planned, it could unlock a lot of value for Nigeria’s tech ecosystem.\nKenyans to pay VAT for using Zoom<em>Photo Credit: <a href=”https://www.linkedin.com/in/morgan-mbabazi-001a331a/” target=”_blank” rel=”noopener”>Morgan Mbabazi</a> (National Media Group).</em>Starting August 2021, Kenyans will begin paying Value Added Tax (VAT) for using video conferencing platform, Zoom."
  },
  {
    "headline": "Oil gains as markets tighten on robust global demand",
    "summarized_story": "There is yet brighter prospects for Nigeria’s fiscal position as oil closed higher Thursday amid expectations that recovering demand from the U.S. to India and Europe will further tighten global crude markets.\nIn London Brent rose to $73.75 a barrel while futures in New York climbed as much as 1.9% on Thursday after posting the…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Lagos Agberos collect more cash than IGR of 35 states",
    "summarized_story": "Lagos Agberos collect more cash than IGR of 35 statesAs many states struggle to generate revenue, Agberos in Lagos state generate N123 billion yearly in Nigeria, more cash than 35 states in Nigeria generate yearly, according to a research by International Centre for Investigative Reporting (ICIR).\nExcluding Lagos which generated N418.9 billion in 2020, this amount is bigger than the Internally Generated Revenue (IGR)…"
  },
  {
    "headline": "Airfares rise for summer travellers on N460/$ exchange rate",
    "summarized_story": "Passengers travelling for summer are currently paying more as airfares, as ticket prices to various destinations, have surged as a result of increase in naira-to-dollar exchange rate.\nThe International Air Transport Association (IATA) exchange rates moved speedily from N412 to N420 and now N460 to the dollar, forcing passengers to pay more for tickets, even…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Obaseki pledges increased support, partnership with security agencies to combat crime in Edo – Nigerian Observer",
    "summarized_story": "Obaseki gave the assurance when he received the Edo State Commandant of NSCDC, Mr. Aniekan Udoeyup, who was on a courtesy visit at the Government House, Benin City.\n“I want to assure you that we will continue to work with your command.\nI still have to pay salaries, so it will be very challenging for us to bear the burden of other federal security agencies in totality,” Obaseki added.\nEarlier, Udoeyup commended the governor for his support towards the command, adding that they would continue to provide security for all in the state.\nThe commandant, however, appealed to the governor to support the command with logistics to enable them to combat crimes on the highway."
  },
  {
    "headline": "Shaibu hails Edo Beads as state’s basketball team qualifies for national league after 23 years – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Deputy Governor, Rt.\nPhilip Shaibu, has congratulated the state’s basketball team, the Edo Beads, for the team’s qualification for the National Premier League after 23 years.\nShaibu, who received the team led by its coach, Victor Umoru, at the Government House in Benin City, saluted the Edo Beads for making the state proud.\nThe Deputy Governor further reassured the commitment of the state government towards the development of sports, noting that the state is determined to reclaim its lost glory in sports in the country.\nNarrating the team’s success story, the coach noted that for the past 23 years the basketball team has not been in any of the national leagues."
  },
  {
    "headline": "Eid-El-Kabir: Edo govt hails residents on peaceful celebration – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has commended residents, especially Muslims, on the peaceful Eid-El-Kabir celebration across the state.\nChief of Staff to Edo State Governor, Hon.\nOsaigbovo Iyoha, said the peaceful celebration of Eid-El-Kabir across the state reaffirms the peaceful disposition of Edo people, noting that Governor Godwin Obaseki-led administration will continue to implement policies that foster religious harmony among members of different religious groups.\nHe noted that Muslims in Edo State constitute major stakeholders for sustainable peace and progress in their different endeavours, adding, “Muslims in Edo State have always upheld the import of the Prophet’s teachings.\nIyoha expressed appreciation to Muslims for supporting the Obaseki-led administration MEGA agenda, adding, “The spirit of the Eid-El-Kabir celebration should guide us to live in peace and accommodate one another in building strong coalitions that will entrench development and progress in our state.”..."
  },
  {
    "headline": "Mischief makers pass off 2015 A’Ibom PDP Pry election video as Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe desperation of detractors of Edo State Governor, Mr. Godwin Obaseki, is manifest, yet again, with the circulation of an old video of a primary election in Akwa Ibom State and mischievously captioning and passing it off as an altercation involving the governor.\nIt must be stated that the intent of the purveyors of the video is patently malicious as it is obvious that the man who is wrongly identified as Governor Obaseki in the said video bears no resemblance with the governor.\nFindings have revealed that the video captured two prominent members of the Peoples Democratic Party (PDP) in a hot exchange at the Godswill Akpabio Stadium during the PDP Primary Election in 2015.\nThis development once again points to the grave consequences of fake news and alternative facts, which mischief makers exploit to cause misinformation and public apathy.\nOsaigbovo IyohaChief of Staff to Edo State Governor..."
  },
  {
    "headline": "Excitement as Ilorin emirate holds Durbar despite ban (PHOTOS)",
    "summarized_story": "ADVERTISEMENTIn spite of the ban on the annual Durbar festival in Ilorin, Kwara State, the organisers still found a way to actualise some of their programmes.\nThe state government had earlier prohibited the cultural event slated for the second day of Sallah, citing security concerns.\nSo, rather than jettison the whole Durbar festival, the organisers, on the approval of the Emir, incorporated some Durbar programmes as an extension of Bareke.\nThe Emir of Ilorin, Ibrahim Sulu Gambari, visited the Government House in Ilorin on Thursday, two days after the Eid-el-Kabir celebration.\nIt also featured a glamorous display of decorated horses and music performances from Indigenous artistes, the major highlights of the Durbar."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Going hard on Kanu, Igboho will provoke their followers to carry bombs – Akinterinwa warns",
    "summarized_story": "Akinterinwa who spoke in an interview with PUNCH, emphasized that violence is not the solution to their agitations, but dialogue.\nI think it is Shakespeare that said in Macbeth that there is no art of finding the human construction from the face.\nThe terrorists fighting on the battlefield are different from the terrorists that are funding them or that are outside.\n“Arrest all of them, extradite all of them but that won’t stop the agitation for Yoruba Republic and it won’t stop agitation for Biafra Republic.\nBiafra Republic came into being as far back as 1962; it was discussed in their palace."
  },
  {
    "headline": "Zamfara, Kebbi, Niger worst hit as gunmen kill 1,031 abduct 390 in one month – Report",
    "summarized_story": "According to report, Zamfara, Kebbi, and Niger were worst hit as a total of 275 persons were killed in Zamfara State, 93 in Kebbi State, and 91 in Niger State during the month under review.\nThe report titled: “Nigeria Security Report” obtained recorded various cases of insecurity in June; from armed attacks, armed clashes, mob violence, social disruptions, to other violent crimes.\nKaduna State recorded 26 deaths with 157 abductions, while Katsina State recorded six deaths with three abductions.\nSokoto State had 15 fatalities with zero abduction, Kano and Jigawa states recorded one death each with no abductions.\nKwara State recorded 11 deaths with no abduction, while Kogi and the Federal Capital Territory (FCT) recorded three deaths and 10 abductions respectively."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "Nigerian editors reject media bills seeking to gag media",
    "summarized_story": "Nigerian Guild of Editors (NGE), the umbrella union of all editors in Nigeria, has has kicked against what it called “draconian” attempts to gag the media, noting that the media industry is not a political opponent or enemy of the Federal Government.\n“While we are not opposed to an Act that will promote media stakeholders-driven regulatory council, the many draconian provisions in the Odebunmi Olusegun-sponsored Bills are actually aimed at criminalising media practice in Nigeria.\nWhile the intention of the sponsor of the bills is suspicious, the Bills negate all known features of media regulatory bodies in the world,” the NGE said.\nThe guild alluded to the NPC Act, CAP N128, Laws of the Federation of Nigeria 1992, created by the military dictatorship.\nThe NGE added that the two Bills, if passed, would compound the nation’s negative image in the global community."
  },
  {
    "headline": "PIB: 3% Stake For Host Communities Threat To Investment In N’Delta",
    "summarized_story": "“By this development, this country is not helping itself and it is also not helping investors.\nThis country is not helping the host communities and it is not creating the enabling environment for investments to thrive.\n“However, I want to state that if the host communities are not happy, the investors will not come.\nAs it is, host communities do not have a stake in oil exploration and exploitation activities.\n“It is not a wise decision to go against the wishes of the host communities because they are in their thousands,” Dickson said."
  },
  {
    "headline": "PIB: 3% Stake For Host Communities Threat To Investment In N’Delta",
    "summarized_story": "“By this development, this country is not helping itself and it is also not helping investors.\nThis country is not helping the host communities and it is not creating the enabling environment for investments to thrive.\n“However, I want to state that if the host communities are not happy, the investors will not come.\nAs it is, host communities do not have a stake in oil exploration and exploitation activities.\n“It is not a wise decision to go against the wishes of the host communities because they are in their thousands,” Dickson said."
  },
  {
    "headline": "Excitement As Ilorin Emir Names Kwara Gov’s Brother Mutawalle Ilorin",
    "summarized_story": "Alimi is the older brother of Kwara State governor, AbdulRahaman AbdulRazaq, and the first child of the late first northern Nigerian lawyer, Late Alh AGF AbdulRazaq.\nAGF AbdulRazaq held the title of Mutawalle of Ilorin until his demise early 2020.\nADVERTISEMENTHe equally expressed his gratitude to the Emir of Ilorin, Alh.\nHe is a graduate of Law from Ahmadu Bello University, Zaria, Nigeria and holds an LLM and Ph.D degrees from the University of Hull, UK.\nHe has served the nation in several capacities as Commissioner, Legal Licensing and Enforcement with the Nigerian Electricity Regulatory Commission (NERC); chairman, National Iron Ore Mining Company , Itakpe and member, National Council on Privatization."
  },
  {
    "headline": "Excitement As Ilorin Emir Names Kwara Gov’s Brother Mutawalle Ilorin",
    "summarized_story": "Alimi is the older brother of Kwara State governor, AbdulRahaman AbdulRazaq, and the first child of the late first northern Nigerian lawyer, Late Alh AGF AbdulRazaq.\nAGF AbdulRazaq held the title of Mutawalle of Ilorin until his demise early 2020.\nADVERTISEMENTHe equally expressed his gratitude to the Emir of Ilorin, Alh.\nHe is a graduate of Law from Ahmadu Bello University, Zaria, Nigeria and holds an LLM and Ph.D degrees from the University of Hull, UK.\nHe has served the nation in several capacities as Commissioner, Legal Licensing and Enforcement with the Nigerian Electricity Regulatory Commission (NERC); chairman, National Iron Ore Mining Company , Itakpe and member, National Council on Privatization."
  },
  {
    "headline": "Federal Govt Warns NEITI Board Members Against Partisanship",
    "summarized_story": "The secretary to the government of the federation, Boss Mustapha, has warned board members of the Nigeria Extractive Industries Transparency Initiative (NEITI) against partisanship.\nHe gave the warning on Thursday during the inauguration of the national stakeholders working group (the board) of NEITI in Abuja.\nAccording to him, the present administration is passionate about the EITI process because it serves two key agendas of the administration.\nADVERTISEMENTHe said, “as members of this board, you must ensure that NEITI contnues to preserve these virtues for the benefit of all of us present here today and for future generations.\n“Your mandate as the Board of this organization is to ensure effective EITI implementation in Nigeria by providing policy and strategic direction, guidance, monitoring and oversight to EITI process in Nigeria."
  },
  {
    "headline": "Buhari felicitates with publisher of Third Eye, Akanni Aluko at 78",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari felicitates with Chief Akanni Aluko, Publisher of defunct Third Eye Newspaper, as he turns 78 on July 23, 2021.\nThe President joins family, friends and associates in honouring Chief Aluko, who has not allowed other challenges to affect his passion for humanitarian causes, supporting the less privileged and vulnerable in the society.\nThe President recognises Chief Aluko’s extensive experience in the business world and the media, as well as his contributions to human capital development in the country, which has earned him the respect of his peers and colleagues.\nAs the celebrant counts the blessings of another birthday, the President assures him of his good wishes and best of the years ahead.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Buhari felicitates with publisher of Third Eye, Akanni Aluko at 78",
    "summarized_story": "By GBENGA ADEOLAPresident Muhammadu Buhari felicitates with Chief Akanni Aluko, Publisher of defunct Third Eye Newspaper, as he turns 78 on July 23, 2021.\nThe President joins family, friends and associates in honouring Chief Aluko, who has not allowed other challenges to affect his passion for humanitarian causes, supporting the less privileged and vulnerable in the society.\nThe President recognises Chief Aluko’s extensive experience in the business world and the media, as well as his contributions to human capital development in the country, which has earned him the respect of his peers and colleagues.\nAs the celebrant counts the blessings of another birthday, the President assures him of his good wishes and best of the years ahead.\nShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Oyedepo: Pastors sacked by Winners’ Chapel ‘unfruitful, blatant failure",
    "summarized_story": "Bishop David Oyedepo of the Living Faith Church International aka Winners’ Chapel has said the pastors recently sacked by the church were unfruitful.\nOne Pastor Peter Godwin had claimed that the church sacked the pastors in Ekiti State for having a church growth index that falls below expectations.\nThe pastor had said, “I was told by the management that the church doesn’t operate at a loss.\nAddressing the issue while speaking to his congregation, Oyedepo wondered why there was no buzz on social media when 7,000 people were employed by the church.\n“When we employed 7,000 people at a time, social media was dead."
  },
  {
    "headline": "Oyedepo: Pastors sacked by Winners’ Chapel ‘unfruitful, blatant failure",
    "summarized_story": "Bishop David Oyedepo of the Living Faith Church International aka Winners’ Chapel has said the pastors recently sacked by the church were unfruitful.\nOne Pastor Peter Godwin had claimed that the church sacked the pastors in Ekiti State for having a church growth index that falls below expectations.\nThe pastor had said, “I was told by the management that the church doesn’t operate at a loss.\nAddressing the issue while speaking to his congregation, Oyedepo wondered why there was no buzz on social media when 7,000 people were employed by the church.\n“When we employed 7,000 people at a time, social media was dead."
  },
  {
    "headline": "Benin Republic court orders Igboho’s wife released, case adjourned",
    "summarized_story": "Ropo Adeyemo, wife of Sunday Igboho has been set free by the Cour De’appal De Cotonou, Benin Republic, which is hearing her husband’s case.\nThe court has also been adjourned till tomorrow, with Igboho ordered to be remanded in custody of Brigade Criminelle in Cotonou.\nÌgbòho’s lawyer, however, explained that “this is not the best time to say anything on the case”.\nBoth husband and wife were brought to court today.\nLawyers to Igboho are yet to respond to P.M.News request for the full proceeding in the court."
  },
  {
    "headline": "Erica discloses battling anxiety after BBNaija",
    "summarized_story": "By Taiwo OkanlawonControversial ex-housemate of the Big Brother Naija reality TV, Erica Nlewedim, has disclosed that she had full-blown anxiety after her stint on the show came to an end.\nErica revealed this while narrating her experience dealing with the fame that came her way after BBNaija on the latest episode of ‘Inside Life with Erica’, her reality show on MTV Base.\nDuring the show, Erica told Don Jazzy, Nigerian record producer, that she initially struggled to strike a balance between her celebrity status and mental health.\nErica said she strove to fulfill her lifelong dream of impacting the younger generation while managing the highs and lows that accompany celebrity life.\nThe reality TV star added that the narrative is gradually changing as she has learned how to handle the situation better."
  },
  {
    "headline": "APC governors pay Sallah homage to Buhari in Daura (Photos)",
    "summarized_story": "Some governors of the All Progressives Congress (APC) on Thursday paid Sallah homage to President Muhammadu Buhari in his hometown of Daura, Katsina State.\n\">Governors present are Babajide Sanwo-Olu of Lagos, Ben Ayade of Cross Rivers, Dr. Kayode Fayemi of Ekiti, Gboyega Oyetola of Osun, Governor Dave Umahi of Ebonyi State, Governor Aminu Masari of Katsina, Governor Bello Matawalle of Zamfara, among others.\nThe president had gone to Daura for the Eid-el-Kabir celebration with his extended family.\nDuring the celebration, he received some members of the National Youth Service Corps (NYSC)"
  },
  {
    "headline": "Benin Republic Court To Consider Sunday Igboho’s Bail Application On Friday",
    "summarized_story": "Sunday Adeyemo, also known as Sunday Igboho, a Yoruba Nation activist, was ordered detained by a Benin Republic court in Cotonou on Thursday.\nAccording to SaharaReporters, the Cour De’appal De Cotonou will consider Igboho’s bail application by the same Friday.\nThe court ordered Igboho’s wife to be released on Thursday, according to NEWS DIRECT.\nAccording to court officials, the court ordered that Yoruba activist, Igboho should be sent to detention."
  },
  {
    "headline": "BREAKING: Sunday Igboho Returned To Cell As Beninese Court Releases His Wife",
    "summarized_story": "The wife of Yoruba Nation agitator Sunday Adeyemo (Igboho) was ordered to be released this evening by the Cour De’appal De Cotonou, Benin Republic, where they were charged on Thursday.\nAccording to court officials, Igboho should be returned to detention, NEWS DIRECT reports.\nThe wife is to be released this night and Sunday is to remain in custody.\nFollowing his arraignment by the country’s authorities for immigration-related offenses, Sunday Igboho was awaiting his fate at the Cour De’appal De Cotonou, Benin Republic, according to NEWS DIRECT.\nTwo days prior to the raid, Igboho had organized a “Yoruba Nation Rally” in Lagos."
  },
  {
    "headline": "3 Out Of 156 Pupils Kidnapped From Niger Islamiyya School Die In Bandits’ Den",
    "summarized_story": "Three of the 156 girls kidnapped from the Salihu Tanko Islamiyya School in Tegina, Niger State’s Rafi Local Government Area, are said to have died in the kidnappers’ den.\nMany of the remaining students were said to be very ill as a result of starvation, cold, and shock.\nIn a recent development, the bandits notified some of the parents over the phone that three students had died, however they (the bandits) did not reveal the students’ identities.\nNo one is showing any interest in getting our children released from the den of the bandits,” one of the parents was quoted as saying.\nWe have a policy not to pay ransom; we still stand by that policy."
  },
  {
    "headline": "BREAKING: First Batch Of Super Tucano Aircraft Arrives Nigeria",
    "summarized_story": "On Thursday, July 22, 2021, at approximately 12.34 p.m., the first batch of A-29 Super Tucano aircraft arrived in Kano.\nIn a statement, Air Commodore Edward Gabkwet, NAF Director of Public Relations and Information, acknowledged the fighter planes’ arrival.\n“On hand to receive the aircraft were the Hon.\nMinister of Defence, Major General Bashir Magashi (Rtd), Chief of Army Staff, Lieutenant General Faruk Yahaya and Chief of Air Staff, Air Marshal Oladayo Amao”, he said."
  },
  {
    "headline": "Pictures: 8 things to know about first Nigerian Olympic Gymnast Uche Eke",
    "summarized_story": "Nigeria will for the first time participate in gymnastics at the Olympics this July and her winning ticket to the games is Uche Devon Eke.\nBelow are eight things you should know about him:He was born to a Nigerian father, Daniel Eke.\nBefore then, he graduated from Michigan in May 2019 with a Bachelor’s degree in Computer Science Engineering.\nAccording to reports, Uche has been practising gymnastics since the age of three His dream when done with gymnastics is to become a Chief Information Officer or Chief Technology Officer.\nUche Eke competed for Nigeria at the 2019 African Games in Rabat, Morocco where he won gold and bronze medals."
  },
  {
    "headline": "Pictures: President Muhammadu Buhari receives Mai Buni, Sanwo-Olu, other APC govs on sallah homage in Daura",
    "summarized_story": "PreviousITF and how not to reward a patriot"
  },
  {
    "headline": "Breaking: 3 dead as new Delta COVID-19 variant hits Akwa Ibom hard",
    "summarized_story": "Three out of 156 persons have lost their lives as a result new Delta COVID-19 cases recorded in Akwa Ibom state.\nThe Secretary to the State Government (SSG) and chairman, Akwa Ibom state COVID-19 Committee, Dr Emmanuel Ekuwem, who spoke on Thursday called on all citizens of the state to obey all COVID-19 guidelines and protocols earlier announced.\nHe declared that all COVID-19 monitoring mechanisms have been reactivated to ensure strict compliance with guidelines and protocols, to assist the state government combat the new wave.\nDetails loading…"
  },
  {
    "headline": "NASS insensitive to concerned Nigerians on PIB, Electoral Act – Senator Dickson -NigPilot",
    "summarized_story": "Senator representing Bayelsa West District in the National Assembly, Seriake Dickson, has described the recently passed Petroleum Industry Bill, PIB , and the Electoral Act (Amendment) Bill, 2021 by the parliament as offensive and insensitive to concerned Nigerians.\nDickson, who addressed journalists yesterday in Abuja over the perceived shortcomings in the two bills, however, warned that the approved three percent Host Communities Trust Fund in the PIB may lead to unrest in the Niger Delta region.\n“Might and majority do not build a diversified nation like Nigeria, but presence of justice, fairness.\nHe therefore appealed to President Muhammadu Buhari not to assent to the bill, but send it back for more consultation and required Inclusiveness in its proposals.\n“Fortunately a window of striking out that amendment is already provided by the House of Representatives which adopted the clause as originally proposed."
  },
  {
    "headline": "Finally, Nigeria takes delivery of six Super Tucano aircraft -NigPilot",
    "summarized_story": "The statement added that top government functionaries and Service Chiefs received the modern platforms from the manufacturer.\nRecall that the Nigerian Air Force (NAF) on 15, July 2021, in a statement announced that the first batch of six A-29 Super Tucano aircraft departed the United States of America on Wednesday, 14 July 2021 enroute Nigeria.\nThe second batch of the remaining six aircraft brand would be delivered towards the end of the year.\nMilitary experts believe that the arrival of the six A-29 Super Tucano aircraft would change the paradigm in the war against insurgency and anti banditry operations.\n“With the delivery of the modern aircraft to government today, there is end in sight in the over one decade war against insurgency and terrorism,” they said."
  },
  {
    "headline": "Governor Zulum seeks collaboration with military to end terrorism -NigPiot",
    "summarized_story": "The Governor of Borno State , Professor Babagana Umara Zulum has called on the military leadership to sustain its collaboration with Borno State Government, so as to fast track the end of terrorism and insurgency in the North East.\nHe also lauded troops of Operation Hadin Kai (OPHK) for their sacrifices and commitment in the war against terrorism and insurgency in the North East theatre.\nHe charged them to operate in synergy with the sister services, as well as other security agencies and stakeholders.\nThe COAS also expressed appreciation to the Government and people of Borno State for all their support to the troops of OPHK.\nHe reiterated the unalloyed loyalty of officers and soldiers of the NA to the Constitution and Government of the Federal Republic of Nigeria."
  },
  {
    "headline": "Food security: FCT trains 200 farmers, agric officers on organic fertilizers utilisation -NigPilot",
    "summarized_story": "Chukwuemeka, noted that the issue of capacity building especially for Extension Agents and Field Officers has been a priority for the Secretariat, because they are closest to the rural farmers, who due to lack of knowledge of efficient farming techniques have suffered a great loses.\nHe explained it is pertinent to note that the use of organic fertilizers Granular and Liquid , is a new innovation that is practiced globally as it helps to promote rapid nutrient absorption by plants, and also improve soil fertility and plant growth leading to bumper harvest.\nWhile calling on FCT farmers to embrace the new approach, ARDS boss assured them that the FCT Administration will not relent in its effort to find lasting solutions to the problem of crop failure experienced by farmers.\nAccording to him; ” On inception into office, the present FCT leadership under the Hon.\nof State, Dr. Ramatu Aliyu made their intention clear to pursue the implementation of grassroot oriented programme that will have direct bearing on the lives of FCT residents."
  },
  {
    "headline": "Nigeria Receives First Batch Of A-29 Super Tucano Aircraft",
    "summarized_story": "Nigeria has received the first batch of A-29 Super Tucano aircraft procured from the United States of America.\nThe aircraft arrived in Kano State on Thursday afternoon, the Nigerian Air Force said.\nGabkwet said the second batch of the A-29 Super Tucano is expected to arrive in the country before the end of the year.\n“For example, we recently sold Nigeria 12 US A-29 Super Tucano aircraft, great aircraft, in the first-ever sale of American military equipment to Nigeria.\n“On the A-29 Super Tucano aircraft, the CAS stated that about 60 NAF personnel, comprising pilots, engineers, technicians, and other specialists, have completed their training on the aircraft in the USA,” Gabkwet said following the winging ceremony of six new helicopter pilots who recently completed their basic flying training at Draken Helicopter Academy in the United Kingdom."
  },
  {
    "headline": "Cholera Outbreak: At Least 33 Persons Killed In Yobe, Jigawa",
    "summarized_story": "The outbreak of Cholera has claimed no fewer than 33 persons in both Yobe and Jigawa states.\nThis comes less than three days after 30 persons were reported killed in Jigawa State following the outbreak of Cholera across nine local government areas of the state.\nThe Executive Secretary, Yobe State Primary Health Care Management Agency, Babagana Kundi Machina told Channels Television on Thursday that the index case in Yobe came from neighbouring state Jigawa.\nJakusko local government area in Yobe State shares border with Jigawa and Bauchi states which have recently witnessed the outbreak.\nEarlier in May, at least 20 persons died in a cholera outbreak in Bauchi."
  },
  {
    "headline": "Gunmen Kill Five In Attack On Nasarawa Community",
    "summarized_story": "Armed men have killed five persons in Gidan Sule village along Lafia-Makurdi Road in Nasarawa State on Wednesday.\nPolice authorities who confirmed the incident noted that they were informed about the attack late in the day, and explained that the gunmen shot sporadically in the community.\nIn late April, eleven farmers were killed in Ajimaka village, a Tiv settlement of Ekye Development Area in Doma council area.\nDespite the rise in attacks, Governor Abdullahi Sule insists communities in the state are giving criminals a run for their money.\nThe communities rise up to the occasion and also the communities fight them."
  },
  {
    "headline": "Nigeria Records Spike In COVID-19 Infections With Two Deaths, 238 New Cases",
    "summarized_story": "Nigeria has recorded a fresh spike of COVID-19 cases.\nThe Nigeria Centre for Disease Control (NCDC) in its report on Wednesday night disclosed that the country has recorded two deaths and 238 new cases.\nLagos State, which still remains the epicenter of the virus in Nigeria, recorded 181 new cases, while Akwa Ibom recorded 45, Oyo 8, and Ogun 2.\nThis now brings the total number of confirmed cases in the country to 170,122.\nThe day’s report includes 0 cases from Rivers, Osun, Ondo, Sokoto, Kaduna, Kano, and the Nasarawa StatesThe report also disclosed that the multi-sectoral national emergency operations center (EOC), activated at Level 2 and has continued to coordinate the national response activities."
  },
  {
    "headline": "US Sanctions Cuba For Repressing Protests, Biden Warns More To Come",
    "summarized_story": "The United States imposed sanctions on Cuba’s defense minister and a special forces unit Thursday for repressing peaceful protests, a step President Joe Biden warned is “just the beginning” of punitive measures against Havana.\n“This is just the beginning — the United States will continue to sanction individuals responsible for oppression of the Cuban people,” Biden said in a statement.\n“As we hold the Cuban regime accountable, our support for the Cuban people is unwavering,” Biden said.\nCuba pushed back swiftly, calling the sanctions “slanderous” and saying the United States should focus more on repression and police brutality on its own soil.\nBiden as president had exhibited a go-slow approach to Cuba, but the unrest has thrust the relationship into a spotlight."
  },
  {
    "headline": "Police kill notorious armed bandits leader, rescue 12 kidnap victims in Zamfara",
    "summarized_story": "Police in Zamfara have again killed a notorious armed bandits leader and rescue twelve kidnap victimsThe notorious bandit and his grang had on Wednesday blocked the ever busy Gusau – Sokoto Road and abduct twelve travellersThe Criminals blocked the highway along Dogon Karfe community in Bakura local government area with the aim of terrorising commutersPolice in Zamfara says operatives on patrol along the highway mobilised to the area but were engaged in a gun duel by the bandits after abducting twelve travellers.\nA press statement signed by the command public Relations officer Shehu Mohammed says the troops gallantly repelled the kidnap and stop the hoodlums from further onslaught on the commutersAdvertisementThe Zamfara Police image maker says: “Yesterday at about 1300hrs, large number of armed bandits blocked Gusau – Sokoto Road at Dogon Karfe axis scaring commuters to scamper for safety”” Police Tactical operatives on patrol along the road quickly mobilzed to the location.\nOn arrival at the scene, they were heavily engaged in a gun duel by bandits who already abducted innocent commuters and were about to take them to the forest, but our troops gallantly repelled them, deterring the hoodlums from further onslaught on the commuters” Shehu SaidThe statement adds that during the encounter, one of the bandits was fatally injured and victim was taken to the forest by the banditsThe Zamfara State Police Command says it has intensified search and rescue strategies to safely rescue the remaining other victim who was taken to the forest before Police arrival.\nAll the rescued victims were reunited with their families.\nAdvertisementThis is the second time in forty eight hours that police in Zamfara is rescuing kidnap victims."
  },
  {
    "headline": "Document us properly for posterity, elections, Buhari urges historians, intellectuals",
    "summarized_story": "President Muhammadu Buhari Thursday in Daura, Katsina State, implored historians and intellectuals to be factual in keeping the records of the administration, especially in guiding electorate to make right choices of leadership for the country.\nThe President told the governors to remain steadfast on delivering their promises to the people.\n“I had to change the security chiefs and we had to get down to the fundamentals of providing security.\n“I drove from Kebbi State to Daura, and stopped to pick the Governor of Zamfara State, Bello Matawalle, and realized that for the eight hours of coming here, we didn’t see more than 10km of land that was not cultivated.\nIn six weeks, Your Excellency, you have commissioned projects in Lagos, Kano, Katsina and Borno States, and also launched some projects virtually."
  },
  {
    "headline": "3% Equity stake for host community is unacceptable – Dickson",
    "summarized_story": "The Senator representing Bayelsa West, Seriake Dickson has condemned the 3% equity stake for host community in the recently passed Petroleum Industry Bill.\nSpeaking at a Press briefing in Abuja on Thursday, the former governor of Bayelsa state the PIP had already been badly managed at the executive level.\nHe said the original five percent proposed by President Buhari should have been left to ensure peaceful co-existence in host community."
  },
  {
    "headline": "Adebanjo: Igboho’s Agitation Due to Buhari’s Failure on Security",
    "summarized_story": "Elder statesman and acting leader of pan-Yoruba socio-cultural group Afenifere, Chief Ayo Adebanjo, joined the Morning Show on Thursday to discuss the circumstances leading to the seccesion agitator Sunday Igboho’s arrest and the moves by Nigerian authorities to extradite him.\nChief Adebanjo says Igboho’s emergence is in reaction to President Muhammadu Buhari’s inability to protect lives and property from Fulani marauders in parts of Southwest Nigeria.\nWatch the video for more…"
  },
  {
    "headline": "Igboho: DSS Acting Like It’s Working for a Dictatorship, Says Afenifere Leader Adebanjo",
    "summarized_story": "Elder statesman and acting leader of pan-Yoruba socio-cultural group Afenifere, Chief Ayo Adebanjo, joined the Morning Show on Thursday to discuss the circumstances leading to secession agitator Sunday Igboho’s arrest and the moves by Nigerian authorities to extradite him.\nAdebanjo said Nigeria’s secret police, the Department of State Services is acting like it’s working for a dictatorship.\nWatch the video for more…"
  },
  {
    "headline": "Afenifere Leader Adebanjo Speaks on Sunday Igboho’s Arrest and Extradition Battle",
    "summarized_story": "Since news broke of the arrest of Yoruba separatist agitator Chief Sunday Adeyemo also known as Sunday Igboho in the Republic of Benin, reactions have been mixed over his arrest and planned extradition to Nigeria.\nWhile some have lauded his arrest, as he was considered a threat to national security and the nation’s unity, others have called out the Nigerian government for being soft on terrorist groups engaged in violent attacks in the north of the country and for violating Adeyemo’s rights to demand for self-determination.\nElder statesman and acting leader of pan-Yoruba socio-cultural group Afenifere, Chief Ayo Adebanjo, joined the Morning Show on Thursday to discuss the circumstances leading to Igboho’s arrest and the moves by Nigerian authorities to extradite him.\nWatch the interview for more…"
  },
  {
    "headline": "Two Pfizer, AstraZeneca Doses Work Against Delta Variant: Study",
    "summarized_story": "Two doses of Pfizer or AstraZeneca’s COVID-19 vaccine are nearly as effective against the highly transmissible Delta coronavirus variant as they are against the previously dominant Alpha variant, according to a new study.\nWednesday’s study found that Pfizer was 88 percent effective at preventing symptomatic disease from the Delta variant with both doses, compared with 93.7 percent against the Alpha variant, broadly the same as previously reported.\n“Only modest differences in vaccine effectiveness were noted with the Delta variant as compared with the Alpha variant after the receipt of two vaccine doses,” Public Health England researchers wrote.\nIn June, makers of Russia’s Sputnik vaccine also said that it was about 90 percent effective against the highly contagious Delta variant.\nThe Sputnik vaccine, however, has raised some controversy as it was introduced to the public even before a full trial was completed."
  },
  {
    "headline": "Death Rates Soar in Southeast Asia as Virus Wave Spreads",
    "summarized_story": "Indonesia has converted nearly its entire oxygen production to medical use just to meet the demand from COVID-19 patients struggling to breathe.\nBut he lost his father and brother-in-law to the virus, and another brother remains on a ventilator in the ICU.\nWith India’s massive population of nearly 1.4 billion people, its total number of COVID-19 fatalities remains higher than the countries in Southeast Asia.\nBut India’s 7-day rolling average of COVID-19 deaths per million peaked at 3.04 in May, according to the online scientific publication Our World in Data, and continues to decline.\nOnly in recent weeks, as testing and reporting of COVID-19 cases has started recovering, has it become clear that a new wave of the virus beginning in mid-May is pushing cases and deaths rapidly higher."
  }
]