[
  {
    "headline": "How to have safe sex during pregnancy –Gynaecologist",
    "summarized_story": "Lara AdejoroA professor of Gynaecology and Obstetrics, Oluwarotimi Akinola, says it is safe to have sex at various periods during pregnancy.\nProf. Akinola, however, said a woman who is at risk of miscarriage should likely avoid sex during pregnancy because the orgasm can make the uterus contract and that might lead to expulsion.\n“It’s been thoroughly investigated and found that at various periods in pregnancy, there’s no problem with having sex; it’s not contraindicated.\n“A woman can have sex at any time in pregnancy but you avoid the period when labour is due because of the risk of introducing infection.\n“Also, avoid sex immediately after delivery until you heal properly,” the gynaecologist said."
  },
  {
    "headline": "How to have safe sex during pregnancy –Gynaecologist",
    "summarized_story": "Lara AdejoroA professor of Gynaecology and Obstetrics, Oluwarotimi Akinola, says it is safe to have sex at various periods during pregnancy.\nProf. Akinola, however, said a woman who is at risk of miscarriage should likely avoid sex during pregnancy because the orgasm can make the uterus contract and that might lead to expulsion.\n“It’s been thoroughly investigated and found that at various periods in pregnancy, there’s no problem with having sex; it’s not contraindicated.\n“A woman can have sex at any time in pregnancy but you avoid the period when labour is due because of the risk of introducing infection.\n“Also, avoid sex immediately after delivery until you heal properly,” the gynaecologist said."
  },
  {
    "headline": "Cancer no respecter of persons, age, sex –Expert",
    "summarized_story": "Lara AdejoroThe Permanent Secretary, Lagos State Ministry of Health, Dr. Olusegun Ogboye says cancer is not a respecter of persons, age, sex, religion, residence, or wealth.\nThe state government also disclosed its plans to screen 100,000 women for breast and cervical cancer annually free of charge.\n“Cancer is no respecter of persons, age, sex, religion, residence or wealth.\nHe explained that the Lagos State Cervical Control entails awareness creation, sensitization, health education and promotion, and free screening for breast, cervical and prostate cancer for citizens.\n“Since the launch of the cervical cancer program in 2019, CHAI through the support of the Lagos State Ministry of Health, Health Service Commission and the State Primary Health Care Board has been able to create cervical cancer service demand generation and increase access to cervical cancer services,” she noted."
  },
  {
    "headline": "Cancer no respecter of persons, age, sex –Expert",
    "summarized_story": "Lara AdejoroThe Permanent Secretary, Lagos State Ministry of Health, Dr. Olusegun Ogboye says cancer is not a respecter of persons, age, sex, religion, residence, or wealth.\nThe state government also disclosed its plans to screen 100,000 women for breast and cervical cancer annually free of charge.\n“Cancer is no respecter of persons, age, sex, religion, residence or wealth.\nHe explained that the Lagos State Cervical Control entails awareness creation, sensitization, health education and promotion, and free screening for breast, cervical and prostate cancer for citizens.\n“Since the launch of the cervical cancer program in 2019, CHAI through the support of the Lagos State Ministry of Health, Health Service Commission and the State Primary Health Care Board has been able to create cervical cancer service demand generation and increase access to cervical cancer services,” she noted."
  },
  {
    "headline": "DELTA 2023:It’s Omo-Agege vs Omo-Agege in APC",
    "summarized_story": "Presently, Senator Omo-Agege is 90 per cent in control of the structure of APC at ward, local and state levels in Delta state.\nA controlling organizer, who knew where he was going, he singlehandedly installed the state APC leadership with veteran politician, Engr.\nNwaoboshi is complementing Omo-Agege in a power game that has narrowed both of them as the two musketeers of Delta APC.\n”The APC in Delta State is now a one -man affair that brooks no alternative opinion.\nQuit notice to PDP, OkowaSenator Omo-Agege, son of a former Chief Judge of Delta state, October, last year, boasted that the reign of the ruling PDP in Delta state would end in 2023."
  },
  {
    "headline": "Breaking: Nigeria’s Bonny Light hits $95 per barrel",
    "summarized_story": "Heading towards $100 – analysts.\nAs OPEC moves to meet quotaBy Udeme AkpanFor the first time in seven years, the price of Bonny Light, Nigeria’s premium oil grade, has risen to $95 per barrel, indicating $33 in excess of the $62 per barrel 2022 budget benchmark.\nThe budget was also based on the production of 1.8 million barrels per day, bpd, including about 400,000 barrels of Condensate that Nigeria produces daily.\nDetails later"
  },
  {
    "headline": "Sen Soji Akanbi congratulates Rotimi Amaechi on Royal Turban Ceremony",
    "summarized_story": "Frontline Oyo State Senator Rilwan Adesoji Akanbi has extended his hearty and cheerful congratulations to his buddy friend, co party stalwart and associate, Honorable Minister Rotimi Chibuke Amaechi.\nTomorrow Saturday, February 5, 2022, the Honourable Minister of Transportation, Rotimi Chibuke Amaechi will step out in a royal turbanning ceremony as the Dan Amana of Daura by His Royal Highness, Alhaji Faruk Umar Faruk, the Emir of Daura, as all roads leads to the ancient, historic city of Daura in the North West, Nigeria.\n“I celebrate with you for your doggedness, your amiable love for friends, your innate love for the nation, your desire to see a better Nigeria, and i rejoice with you because you deserve this honour that has come your way at this particular time,” said Senator Adesoji Akanbi, the Okanlomo of Ibadan, in his congratulatory goodwil message to the honourable minister today.\n“Indeed, the title, which is also in recognition of your contributions to Nigeria’s development, especially for your effort in bringing to life the rail sector that has been moribund for over three decades, is heart warming, having personally witnessed you at work during some of those hectic moments, at those various projects,” Akanbi added."
  },
  {
    "headline": "NNPC has potentials of transforming economy – Arewa Youth tell Mele Kyari",
    "summarized_story": "By Ibrahim Hassan-WuyoThe Arewa Youth Assembly has said that a reinvigorated Nigeria National Petroleum Company ( NNPC) under Mele Kolo Kyari has the potential of transforming the Nigerian economy.\nThe youth group congratulated the CEO/GMD of NNPC Ltd; Mallam Mele Kolo Kyari for the conferment of a Honorary Doctorate Degree of Engineering (Honoris Causa) by Federal University of Technology Minna in recognition of his enormous contributions to national development.\nHe said Mallam Kyari took over control of the NNPC after his predecessor’s era came to a halt making him the 19th GMD of the Corporation.\n“‘Mallam Mele Kolo Kyari on his assumption to office launched the TAPE (Transparency, Accountability, Performance and Excellence).\n“Mallam Kyari has also ensured the creation of jobs through drilling of oil wells that constituted the Kolomani river II well among others, recruitment of graduate trainees and consequently highest oil output."
  },
  {
    "headline": "BPE lists ALSCON, Olorunsogo Power Plant among 2022 transactions",
    "summarized_story": "Emma Ujah, Abuja Bureau ChiefThe Bureau of Public Enterprises (BPE) has listed the Aluminium Smelter Company of Nigeria (ALSCON) and Olorunsogo II Power Plant among 42 transactions to be undertaken this year.\nThe detailed consists of lorunsogo II Power Plant (NIPP); Calabar II power plant (NIPP); Benin (Ihovbor) II Power Plant (NIPP); Omotosho II Power Plant (NIPP); Geregu II Power Plant (NIPP); Afam Power And Afam Three Fast Power LtdYola Electricity Distribution Company and Zungeru Hydro Power were equally captured in the 2022 Work Plan.\nThe federal government planned to recapitalise Bank of Agriculture (BOA); while pursuing the reform of the Health .and Education Sector.\nNEW PROJECTSNew projects would include: Gimi Earth Hydro Power Plant; Lower Usuma Hydro Power Plant; Oyan Hydro Power Plant; Sale of the remaining non-core assets of NCC.\nBPE and also planned to Concession some Groups of Hydro Power Plants such as Oguma Hydro Power Plant (700mw); Onitsha Hydro Power Plant (441mw); Dasin Hausa Hydro Power Plant (138mw); Katsina Ala Hydro Power Plant (109mw); Garin Dalli Hydro Power Plant (92mw); Kiri Hydro Power Plant (36mw) and Assets Optmisation – Creation Of A National Asset Register."
  },
  {
    "headline": "25 ISWAP fighters drown in Marte as military bombard Lake Chad hideouts",
    "summarized_story": "At least 25 terrorists fleeing Nigerian military airstrikes drowned in a river within the Marte axis in Lake Chad.\nNigerian Air Force (NAF) fighter jets, including Super Tucano, shelled a number of Islamic State of West African Province (ISWAP) camps.\nAreas including Bukar Mairam and Jubularam, Abbaganaram and Chikul Gudu were bombarded.\n“Those who survived the blast at Bukar Mairam and Jubularam attempted to cross a river within Lake Chad.\nOperation Hadin Kai is sustaining air offensives as part of the strategy to foil ISWAP attacks on military formations in the North-East."
  },
  {
    "headline": "Impeachment moves against Deputy Governor, recipe for crisis – PDP cautions Matawalle",
    "summarized_story": "The Peoples Democratic Party (PDP) has cautioned the Zamfara State Governor, Bello Matawalle over the alleged undemocratic process of impeachment against the Deputy Governor of the state, Mahdi Aliyu Mohammed Gusau by the State House of Assembly.\n“Governor Matawalle should note that the people of Zamfara State are solidly behind the Deputy Governor, who enjoys large political following in the State as the custodian of the PDP mandate after Matawalle’s infamous defection to the APC.\nAs such, any action against the Deputy Governor amounts to a direct assault on the will of the people which they will firmly resist, it added.\nIt alerted Nigerians of how Governor Matawalle has allegedly been hounding members of the Zamfara State Working Committee of the PDP particularly, our State Deputy Chairman, Prof. Kabiru Jabaka, who has been forced to relocate out of the State over threats to his life.\nPDP urged President Muhammadu Buhari and the APC to immediately call Governor Matawalle to order."
  },
  {
    "headline": "Strike: ASUP Osun Poly gives govt 7 days ultimatum",
    "summarized_story": "The Academic Staff Union of Polytechnic (ASUP) Osun State Polytechnic, Iree, has issued a 7-day ultimatum to Osun Government to address the demands of the union.\nThe union made the decision after its Congress at its secretariat, Iree, Boripe Local Government area of Osun State, on Wednesday.\nThe union asked the state government to scale up Tertiary Institutions’ Salary Table to 100% just like it did for the health sector which was addressed in 2020.\n; 65 Years Retirement Age, Year 2019, 2020, and 2021 Promotion Exercise.\nhe addedRecall that the 7 days ultimatum follows the 21-day notice to the Osun state government on 17th December 2021, which elapsed in January 2022."
  },
  {
    "headline": "Prof Olanipekun lauds appointment of EKSU alumnus as NDPB CEO",
    "summarized_story": "The Vice-Chancellor, Ekiti State University, Ado-Ekiti, Professor Edward Olanipekun has congratulated an alumnus of the university, Dr Vincent Olatunji on his appointment as the National Commissioner and Chief Executive Officer of the Nigeria Data Protection Bureau by President Muhammadu Buhari.\nPresident Buhari recently approved the appointment of Dr. Olatunji as the CEO of the Bureau.\nProfessor Olanipekun said he received the news of the award with joy and described Dr Olatunji as a worthy ambassador of Ekiti State University, Ado Ekiti.\nHe thanked President Buhari for considering Dr Olatunji worthy of the appointment.\nDr Olatunji, an alumnus and Honorary Awardee of Ekiti State University, was until the appointment, the Director, eGovernment Development and Regulations of the National Information Technology Development Agency (NITDA)."
  },
  {
    "headline": "Lack of parental guidance fueling ritual killings, misbehaviour among youths – Aregbesola",
    "summarized_story": "Minister of Interior, Rauf Aregbesola, has said the recent increase of youths’ involvement in social vices and misbehaviours is the result of a lack of parental guidance.\nAregbesola said the get rich quick syndrome among youths who get involved in ritual killings for money can be traced to inadequate parenting.\nThe obvious flaw is a lack of parental guidance.\nParents, teachers, other influencers like old students’ associations, non-governmental organisations will go a long way to take our children and youth out of vices and wrong behaviours.\nSpeaking on his alma mater, Aregbesola said, “I’m joining the other old students to see how we can assist, develop, fund the government’s attempt to make our Alma-mater functioning for the present students."
  },
  {
    "headline": "BREAKING: Tuchel tests positive for COVID-19",
    "summarized_story": "Chelsea FC manager Thomas Tuchel has tested positive for COVID-19.\nA statement on the club’s website confirmed he is already in self-isolation.\nREAD ALSO: Tuchel hits Lukaku after defeat to Man CityThe statement reads: “The Chelsea head coach will now follow necessary self-isolation protocols and hopes to join up with the team in Abu Dhabi later next week.\n“The team fly out for the Club World Cup following this afternoon’s FA Cup clash with Plymouth Argyle.”- Advertisement -Details Shortly…"
  },
  {
    "headline": "Daura comes alive as Amaechi is turbaned Dan Amanar",
    "summarized_story": "The ancient town of Daura in Katsina State has become a beehive of activities as dignitaries besieged the town for the turbanning of Transportation Minister, Romimi Amaechi as the Dan Amanar Daura by the Emir of Katsina, Alhaji Umar Farouk Umar.\nThe Nation gathered that the decision to honour the Minister was taken in appreciation for his contribution to the siting of Federal projects in Daura Emirate of Katsina state.\nA source close to the Emir’s palace told The Nation that among federal projects influenced by the Minister to Daura are the University of Transportation, Federal Polytechnic, Daura and the Kano to Niger rail line which will pass through Daura.\nBut Amaechi influenced it’s passing through Daura without the knowledge of Buhari.\n- Advertisement -“Amaechi has influenced a lot of federal projects to Daura to the extent that the city has benefited more from this government than other parts of Katsina state."
  },
  {
    "headline": "APC Govs extol Abdulrazaq at 62",
    "summarized_story": "Governors of the ruling All Progressives Congress (APC) on the platform of the Progressive Governors Forum (PGF) have lauded the visionary credentials and leadership virtues of Kwara Governor Abdulrahman Abdulrazaq.\nBagudu acknowledged and commended Abdulrazaq’s leadership, vision and commitment to a united prosperous Nigeria, under the leadership of APC.\nAbdulrahman Abdulrazaq, Governor of Kwara State to celebrate his 62nd birthday.\nAlong with the people of Kwara State, and other well-meaning Nigerians, we celebrate this special occasion with you and your family.\nAbdulrahman Abdulrazaq.”"
  },
  {
    "headline": "I yielded to pressure from friends to form robbery gang – Suspect",
    "summarized_story": "Anene also revealed that he and his gang members were buying stolen goods from burglars and armed robbers.\n- Advertisement -Narrating how he began the venture into armed robbery, Anene, a father of two, said: “I live in a one-room apartment at No.\n“My problem started when one Tunbu and one Prince became my friends and lured me into forming a three-man robbery gang to make bigger money.\n“He told me that we should start lifting and selling Big Daddy (Toyota) cars and fairly used tricycles to make more money.\n“Stealing and armed robbery have only two bus stops: prison and graveyard.”"
  },
  {
    "headline": "Confusion as Agballah, Nwoye claim Enugu APC chairmanship",
    "summarized_story": "While Chief Agballah returned to a tumultuous reception by members of the party in the State, Dr Nwoye told reporters he remains in charge of Enugu APC.\nHowever, speaking with journalists in Enugu at the weekend, Nwoye dismissed the claim by the Agballah, insisting that nobody was sworn in in Abuja as Enugu State Chairman.\nNwoye commended the national leadership of the party for refusing to recognise Agballah as chairman, insisting that he did not participate in any congress.\nI call on our members to be calm and watch the national Secretariat take a decision on Enugu State.\n” For now am still in charge as power abhors vacuum so, I remain the caretaker committee chairman of Enugu APC,” he stated."
  },
  {
    "headline": "FG under fire over terrorism sponsors",
    "summarized_story": "He had also said government had identified 26 bandits and seven co-conspirators linked to financing of terrorism in Nigeria, among others.\nGovt not showing sincerity – AfeniferePan Yoruba socio-political organisation, Afenifere, said the government has not shown adequate concern and sincerity in prosecuting the war against terrorism.\n“YCE backs FG over non-release of namesBut in a marked departure from positions held by others, the Yoruba Council of Elders (YCE) asked Nigerians not to criticise the Federal Government over the non-release of names of alleged sponsors.\nHe noted that the statement made by the Minister of Information, Alhaji Lai Mohammed, would have unsettled the sponsors, even without mentioning their names, adding that the FG must have been done further investigation on the matter.\nHe urged Nigerians to be patient with the government in its campaign against crimes, especially insurgency and terrorism."
  },
  {
    "headline": "I can never act nude for money –Caroline Igben",
    "summarized_story": "For black and beautiful Nollywood actress, Caroline Igben, there are certain roles she would not be caught playing irrespective of the amount of money involved.\nThe movie star in a recent encounter with Saturday Sun stated that her voice is her unique selling point aside from her knack for role interpretation.\n“My voice and the way I speak are my unique selling points, and I can never take a role on nudity regardless the pay.\nThe curvaceous Igben, who boasts of right curves in the right places, sees nothing wrong with her colleagues going under the knife to have her kind of body.\n“I know liposuction is the new trend, but I am never going to have my body done to look perfect."
  },
  {
    "headline": "Blackout looms in Lagos as fire guts Egbin Power Plant",
    "summarized_story": "By Adewale SanyaoluThe poor state of power supply is set to take a turn for the worse within Lagos and its environs, as the one of the largest power-generating plants in Sub-Saharan Africa, Egbin Power Plc, has been gutted by fire.\nEgbin is one of the operating entities of Sahara Power Group, which is an affiliate of Sahara Group.\nThe incident occurred at its power plant on Wednesday, February 2, at 4.20pm.\n“Egbin is also working with the Federal Fire Service, the Federal Ministry of Power and other stakeholders to review the incident.\n“As the foremost power plant in the nation, Egbin remains committed to providing power innovatively and responsibly in compliance with good health, safety and environmental standards,” the statement noted."
  },
  {
    "headline": "2023: Nigeria’s enemies against Igbo President –Ohanaeze",
    "summarized_story": "From Magnus Eze, EnuguThe most topical and popular issue in South East today is the actualization of a Nigerian President from the region.\nThough some people believe that restructuring of the federation is what the Igbo needs at the moment, there are those clamouring for Nigerian President of Igbo extraction.\nThe Ohanaeze leader declared that anybody working against the emergence of Igbo president does not wish Nigeria well because, according to him, only the Igbo can save the country at this critical period.\nWe don’t know why that conscience takes a flight when it comes to the South East.\nAccording to President General, Coalition of South East Youth Leaders (COSEYL), Goodluck Ibem, the zone will not accept the position of vice president."
  },
  {
    "headline": "Osinbajo, Jonathan, Gowon, Sanwo-Olu, others bid Shonekan farewell",
    "summarized_story": "By Lukman OlabiyiVice President Yemi Osinbajo, former President Goodluck Jonathan, and former Military Head of State, Gen Yakubu Gowon (retd) on Friday in Lagos attended a state funeral service for Chief Ernest Shonekan.\nGowon was accompanied by his wife, Victoria, to the service held at the Cathedral Church of Christ, Marina, Lagos.\n“If ever a man could be said to have lived a life of two equally consequential halves, and in service, that man would be Shonekan.\nIt was an assignment to which he applied his customary dedication and diligence.’’Osinbajo said that in the latter chapter of his life, Shonekan seamlessly assumed the mantle of an elder statesman.\nHe urged those left behind by Shonekan not to grieve endlessly like those hopeless, who had no Christ."
  },
  {
    "headline": "Osinbajo: Shonekan Was a Man of Destiny Chosen for His Time",
    "summarized_story": "); former President Goodluck Jonathan; Secretary to the Government of the Federation, Boss Mustapha; Lagos State Governor, Babajide Sanwo-Olu; Ogun State Governor, Prince Dapo Abiodun; and Edo State Governor, Godwin Obaseki.\nBuhari said: “Chief Shonekan was a man I respect so much because of his passion for the development of Nigeria.\nNo man will offer himself as a sacrificial lamb in the manner of Chief Shonekan.\n“As a member of the Council of State, Chief Shonekan attended all meetings until his demise because of his passion to see Nigeria grow.\nHis brother, Chief Tunji Shonekan, described the deceased as a peacemaker, a family man and a core Egba man."
  },
  {
    "headline": "Power Generation Crashes By Alarming 630MW as Fire Outbreak Forces Lagos Egbin Plant to Suspend Operation",
    "summarized_story": "Peter UzohoNigeria’s daily power generation has fallen by an alarming 630 megawatts (MW) since Wednesday following a fire outbreak at Egbin Power Plant in Ikorodu, Lagos State and the resultant shut down of generation by the company.\nEgbin Power had, in a statement issued to its stakeholders and the general public yesterday, reported the fire incident at its power plant on Wednesday, February 2, 2022, at about 4.20pm, leading to blackout in Lagos State.\nEKEDC had also attributed the reduction in supply to the drop in power generation from an average of 3,700MW to 2,000MW.\nThe Disco said this was caused by gas limitations arising from vandalism and more recently an issue affecting the TCN line from the Egbin Power Plant.\n“As the foremost power plant in the nation, Egbin remains committed to providing power innovatively and responsibly in compliance with good health, safety and environmental standards,” she added."
  },
  {
    "headline": "US Identifies Bad Governance, Corruption as Motivations for Coups in Africa",
    "summarized_story": "This was disclosed by the Commander of the United States Africa Command, AFRICOM, General Stephen Townsend who while expressing surprise at the recent upsurge in spate of military coups in Africa, opined that bad governance and corruption may have been responsible for the putsches.\n“So I don’t know why all that is, but my guess is that it has to do with insufficient governance, a lack of good governance, and corruption.\nBut I think that corruption and a lack of good governance is probably behind much of that,” he explained.\nI don’t think they’re doing that, furthering that or promoting those.\nBut they also have a view to expand into Africa, particularly into West Africa and the Gulf of Guinea."
  },
  {
    "headline": "Buhari at AU Summit, Reiterates Commitment to Poverty Alleviation, Access to Education",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari has given an assurance that his administration remains committed to lifting the poor and vulnerable Nigerians from poverty.\n“Today, the forum has presented its second peer review report on Nigeria.\nThis Second Peer Review of Nigeria came at a critical time in the history of the country.\nHe said: “Let me use this opportunity to commend the President of South Africa for his dedication to the Forum since his election as the Chairperson of the African Peer Review Forum.\n“I also recognise the distinguished Panel of Eminent Persons for their continued good work in steering the African Peer Review Mechanism process in all member countries."
  },
  {
    "headline": "Zamfara Lawmakers Move to Impeach Deputy Governor Over Alleged Corruption",
    "summarized_story": ""
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "EXCLUSIVE: Ex-Naval Director On Wanted List For N2billion Fraud, Tahir Yusuf Planning To ‘Sneak Out’ Of Nigeria Through Chad Republic",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC), is planning to flee the country, sources close to the retired military officer told SaharaReporters.\nThe anti-graft agency had accused Yusuf of stealing N2 billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nFollowing the forfeiture, SaharaReporters gathered that Yusuf fled Nigeria to Dubai, United Arab Emirate.\nHowever, Yusuf sneaked back to the country in October 2021 after he illegally obtained an international passport with the help of some corrupt government officials through the Niger Republic, a source had told SaharaReporters."
  },
  {
    "headline": "EXCLUSIVE: Ex-Naval Director On Wanted List For N2billion Fraud, Tahir Yusuf Planning To ‘Sneak Out’ Of Nigeria Through Chad Republic",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC), is planning to flee the country, sources close to the retired military officer told SaharaReporters.\nThe anti-graft agency had accused Yusuf of stealing N2 billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nFollowing the forfeiture, SaharaReporters gathered that Yusuf fled Nigeria to Dubai, United Arab Emirate.\nHowever, Yusuf sneaked back to the country in October 2021 after he illegally obtained an international passport with the help of some corrupt government officials through the Niger Republic, a source had told SaharaReporters."
  },
  {
    "headline": "‘N1.3bn fraud’: EFCC confirms release of VON DG",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) says it has released Osita Okechukwu, director-general, Voice of Nigeria (VON), who was detained over fraud allegations.\nOkechukwu arrived at the EFCC headquarters in Abuja on January 29 around 1:30 pm following an invitation regarding a case bordering on alleged conspiracy, abuse of office, and misappropriation of public funds.\nOn Saturday, Wilson Uwujaren, EFCC spokesperson, told TheCable that Okechukwu has been released.\nAdvertisement“He was released on Monday,” Uwujaren said, adding that investigations continue.\nThe VON DG has been relatively outspoken about national issues in recent months."
  },
  {
    "headline": "‘N1.3bn fraud’: EFCC confirms release of VON DG",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) says it has released Osita Okechukwu, director-general, Voice of Nigeria (VON), who was detained over fraud allegations.\nOkechukwu arrived at the EFCC headquarters in Abuja on January 29 around 1:30 pm following an invitation regarding a case bordering on alleged conspiracy, abuse of office, and misappropriation of public funds.\nOn Saturday, Wilson Uwujaren, EFCC spokesperson, told TheCable that Okechukwu has been released.\nAdvertisement“He was released on Monday,” Uwujaren said, adding that investigations continue.\nThe VON DG has been relatively outspoken about national issues in recent months."
  },
  {
    "headline": "Power generation drops by 630mw at Egbin Power Plant after fire outbreak",
    "summarized_story": "Power generation dropped by 630 megawatts (MW) following a fire outbreak at the Egbin Power Plant in Ikorodu, Lagos state.\nIn a statement issued by Egbin Power Plc on Friday, the fire incident had occurred at its power plant on Wednesday at about 4.20 pm, leading to a blackout in Lagos state.\nAccording to Egbin, the thermal plant has an installed capacity of 1,320MW consisting of six units of 220MW each, while its actual average generating capacity is about 800MW.\nAdvertisementThe management said the fire outbreak was successfully contained by a team of firefighters in collaboration with firefighters from the Nigeria Gas Company (NGC) in Egbin.\n“We know that there was a fire outbreak and the total generation of 630MW was removed from the grid because of that,” Mba said."
  },
  {
    "headline": "Power generation drops by 630mw at Egbin Power Plant after fire outbreak",
    "summarized_story": "Power generation dropped by 630 megawatts (MW) following a fire outbreak at the Egbin Power Plant in Ikorodu, Lagos state.\nIn a statement issued by Egbin Power Plc on Friday, the fire incident had occurred at its power plant on Wednesday at about 4.20 pm, leading to a blackout in Lagos state.\nAccording to Egbin, the thermal plant has an installed capacity of 1,320MW consisting of six units of 220MW each, while its actual average generating capacity is about 800MW.\nAdvertisementThe management said the fire outbreak was successfully contained by a team of firefighters in collaboration with firefighters from the Nigeria Gas Company (NGC) in Egbin.\n“We know that there was a fire outbreak and the total generation of 630MW was removed from the grid because of that,” Mba said."
  },
  {
    "headline": "US couple sues fertility clinic after DNA test reveals 'mix-up' -- nearly 30 years later",
    "summarized_story": "A US couple has instituted a lawsuit against a fertility clinic after discovering their daughter is not biologically related to the man who raised her.\nMike and Jeanine Harvey, the couple, said they realised the error after purchasing a DNA kit for their daughter, Jessica, before she travelled to Italy.\nAdvertisement“The test comes back, I’m sitting at my desk at work, actually, I opened up and see some English.\nThe couple said they underwent the fertility procedure, known as intrauterine insemination (IUI), at a hospital in Ohio in 1991 and their daughter was born the following year.\nIn a statement, Summa Health System said: “We take this allegation seriously and understand the impact this has on the family."
  },
  {
    "headline": "Saudi Arabia: A new home for Nigerian startups?",
    "summarized_story": "The Startup Passport initiative, which will ultimately be between the 8-member DCO countries, rolled out initially in Saudi Arabia and Nigeria.\nThis announcement implies that Nigerian startups building products that primarily serve the Middle East and North Africa (MENA) region are invited to build their companies from Saudi Arabia with support from the government.\nFaris AlSaqabi, Saudi Deputy Minister for Future Jobs and Capabilities, explained that the bond between Saudi Arabia and Nigeria is fueled by the country’s movement to a digital economy.\nNigerian Minister of Communications and Digital Economy, Isa Ali Pantami in conversation with a representative of the Digital Cooperation Organization.\nThis new program is expected to transform Saudi Arabia into a leading digital entertainment and media production hub."
  },
  {
    "headline": "TechCabal is surging ahead in 2022 and beyond 🚀",
    "summarized_story": "This year, we are hyper-focused on fine-tuning our editorial standards and establishing TechCabal as one of Africa’s most reputable technology and media publication.\nHe was a senior staff writer at TechCabal for 1 year and 8 months.\nHe was a staff writer at TechCabal for almost 2 years.\nMLIT is a flagship launched by Kay Uguwede, a former TechCabal staff writer.\nDigital Nomads was launched and exclusively written by Olumuyiwa, a former senior staff writer at TechCabal."
  },
  {
    "headline": "Detty December: New data identifies Lekki Phase 1 as Lagos’s COVID-19 hotspot",
    "summarized_story": "Adaobi* is a 24-year-old software engineer living with her 49-year-old mother Oge* at Lekki Phase 1, in Lagos, Nigeria.\nWe noticed that customers in Lekki Phase 1 that would normally order 20 packs of antimalarial drugs for sale within 3–4 days were now ordering 60–70 packs every 1–2 days,” said Okwuada.\nA sore throat is not indicative of malaria but it is one of the major symptoms of COVID-19.\nAnother resident of Lekki Phase 1 jokingly said he suspects everybody in Lekki has the virus already.\nAccording to a Reuter data, COVID-19 infections are decreasing in Nigeria, with 94 new infections reported on average each day."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "Afrobeats: “There are global moments, but the biggest opportunity is Nigeria.” — Obi Asika",
    "summarized_story": "Obi Asika, Founder of Storm 360 Records and Co-founder of Social Media Week LagosThere is no doubt that African music, especially Afrobeats — the melting pot of West African music styles blended with American Jazz — has gone global.\nThis was then fused with Western influences to create Afrobeats.\nBy the late 2000s, we had Myspace, then Facebook, followed by YouTube,” Asika noted.\nWhile Asika believes that several platforms played a significant role in making Afrobeats go global, the talents that create the music play the biggest part.\n“Once we see the Internet no longer becoming a barrier, we’re truly going to see how African music will blow up."
  },
  {
    "headline": "How changing customer attitudes will affect fintech business models in Africa",
    "summarized_story": "Nigeria alone has 144 fintech startups, per Statista.\nAn underdeveloped financial system, difficulty accessing credit, and a growing number of smartphone users present a huge opportunity for new and existing fintech players in Africa.\nAdvertisementPreparing for competitionOluwatobi Boshoro, CEO of Infinitetiks, believes that fintech startups can expect to see competition from startups on the fringes of the financial services sector.\nCurrently, most fintech startups in Africa are focused on one financial service.\nSo what does this mean for fintech startups?"
  },
  {
    "headline": "Building a sense of trust and providing insurance for more Africans",
    "summarized_story": "Today, I’m discussing:GIG Logistics’ crypto integrationLAMI’s acquisition to drive expansion in AfricaGIG Logistics’ crypto integrationRecently, the only constant for Bitcoin has been a downward spiral.\nThose who do not have an XPAD wallet can create one on GIGGO.\nDue to the traditional distribution of insurance policies by individual insurance agents, Africa has low insurance coverage.\nTo make insurance coverage available to more people in Africa on a larger scale, the company has acquired Bluewave Insurance Agency for an undisclosed sum.\nAdelaide Odhiambo, who now works as the head of commercial partnerships at Lami, founded Bluewave Insurance, another Kenyan startup."
  },
  {
    "headline": "Real estate trends to watch as sector recovers",
    "summarized_story": "Regulatory and compliance intensity, heightened risk of title uncertainty in high profile locations, resolute enforcement of city master plans, and innovative financing strategies top experts’ list of trends to watch in the real estate sector in 2022.\nThe experts, who spoke at an event hosted by the Nigerian-British Chamber of Commerce (NBCC) with the theme, ‘Nigerian economic outlook 2022: Intersection with the real estate sector –Top real estate trends to watch’ noted that despite the obvious effect of inflation, foreign exchange challenges, insecurity, and high unemployment rates, Nigeria’s economic fundamentals remain strong.\n“This year is going to be different as Lagos is going to tackle fraudulent activities in the real estate sector this year.\nAlso, Bisi Adeyemi, NBCC president and chairman of the council, observed that the real estate sector had become a major contributor to the country’s economic growth this year.\n“The major objective of this event is to examine the opportunities, challenges, and, indeed, the threats in the real estate sector in 2022."
  },
  {
    "headline": "How Nigerian music will beat 2021 records",
    "summarized_story": "Here we look at 2022, focusing on the Nigerian music industry and projections for the year.\nA retrospect of the Nigerian music industry in 2021Wizkid’s commercial success with “Made in Lagos” spilled over into 2021, setting new records for an afrobeat artiste.\nThe Nigerian music industry is shaping up against a healthy outlook for music sales globally.\nMore revenue on international performances:International concerts and music festivals will produce more revenue for the Nigerian music business than ever before.\nMore global award category recognition/nomination:Africa is dominating the Grammys’ Global Music category, with Wizkid, Tems, Burna Boy, Femi Kuti, and Made Kuti all receiving nominations."
  },
  {
    "headline": "Oil crosses $92, its highest level in over seven years",
    "summarized_story": "Oil crosses $92, its highest level in over seven yearsOil prices reached seven-year highs on Friday as geopolitical tensions and a winter storm in the US fuelled concerns over supply disruptions.\nRead also: OPEC+ to raise oil production by 400,000 in MarchOil markets have also gained support from tensions surrounding the Ukraine crisis, which have heightened concerns over oil supplies that are already tight.\n“The late-session recovery in oil prices was also aided by fresh evidence of OPEC’s struggle to raise output,” said Stephen Brennock of oil Broker PVM.\nIraq, Opec’s second-largest oil producer, pumped well below its Opec+ quota in January, data from state-owned marketer Somo showed on Thursday.\nCommerzbank has raised its oil price forecast for the first quarter of 2022 to $90 a barrel, up from $80 previously."
  },
  {
    "headline": "OLAYIWOLA AFOLABI UPLIFTS THE LEGAL PROFESSION – Nigerian Observer",
    "summarized_story": "For instance, he has an award scheme for honouring honest, disciplined and diligent junior staff of Edo State judiciary.\nIcons of the bench and bar have equally been honoured by Olayiwola Afolabi in one way or the other.\nIn 2018, Olayiwola Afolabi hosted the new executive members of NBA, Edo State Chapter to a dinner.\nIn 2020, Olayiwola Afolabi officially institutionalized this mentoring process with the establishment of AFOLABI ANNUAL LEGAL CLINIC AND COACHING LECTURE SERIES.\nAlso in line with his tradition of honouring icons in the judiciary, Olayiwola Afolabi has instituted Stephen Omonuwa Transparency Award."
  },
  {
    "headline": "Digital Broadcasting: Ministry of Communication and Orientation to Partner Edo State University, Uzairue – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestUZAIRUE- – Edo State Ministry of Communication and Orientation will partner with Edo State University Uzairue in raising a new set of professionals that will drive the progress that Nigeria needs in the Broadcasting industry, just as the Ministry work towards having a new digital broadcasting sector.\nAndrew Adaze Emwanta during a facility tour of the Edo state University Uzairue, Etsako West Local Government area of Edo State.\nHe disclosed that the Ministry of Communication and Orientation is working towards having a new digital broadcasting sector to be controlled by the state.\nAccording to him, “Broadcasting has gone beyond analogue and the Ministry is working towards having a new digital broadcasting sector that we as a state can control.\n“The Nigeria University Commission, NUC ranking has placed Edo University 10th best in Nigeria, 2nd best in the state and the best in the South South region."
  },
  {
    "headline": "Edo Cricket Teams Win PWC National U-17 South-South Qualifiers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State male and female U-17 cricket teams, emerged champions respectively, at the PWC national cricket under 17 South-South zonal qualifiers, which took place in Benin City.\nIn the male category of the qualifiers, that took place at the Edo boys high school Cricket pitch, in Benin City, the Edo State defeated Akwa Ibom by 10 wickets.\nIn the first innings, the Edo State team had chased down their 51 runs target in the 15th over having run the Akwa Ibom team out for 50.\nEarlier in the qualifiers, the Edo State team defeated Delta state by 2 wickets in the preliminary round (Super Knockout) that took place yesterday.\nAt the Iyoba girls college where the female qualifiers took place, the Edo State team led by Coach Guobadia Esewi Peter also became champions."
  },
  {
    "headline": "NBBF: Kida vows to build solid,sustainable Domestic leagues – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – After a successful elective Congress of the Nigeria Basketball Federation (NBBF) in Benin City, the leadership of the NBBF board led by Engr Musa Kida has expressed its determination to build a domestic league structure that will reflect the immense potentials that abound in Nigeria.\nThe reelected NBBF President Musa Kida gave the assurance while entertaining questions from Journalists in Benin.\nEngr Musa Kida who was unanimously returned as the NBBF’s president said the symbolic election heralds a new dawn with the domestic league at the front burner of the board’s plan.\n“We are hoping that all these stakeholders will come on board so that together we have a verile and enviable domestic league”.\nNigeria basketball election into its federation was conducted in the most democratic way with 27 states out of the 36 and the Federal Capital Territory present”."
  },
  {
    "headline": "Despite Clampdown, Illegal Oil Refining Thrives In Rivers",
    "summarized_story": "Despite the clampdown by the Rivers State government and the 23 local government areas of the state, illegal refining and bunkering are going on in the state.\nIt was further observed that those involved in the illegal business work in connivance with security operatives who provide cover for them.\nHe said the state government would not hesitate to depose the King of Akpor kingdom if illegal oil bunkering continues in Rumuokparali and Ogbogoro communities.\nThe governor also frowned at the king of Omerelu community in Ikwerre local government area where illegal oil bunkering activities are thriving.\nThe governor said the state had also recovered government properties fraudulently acquired by retired civil servants."
  },
  {
    "headline": "APC Faction Seeks Redeployment Of CP Over Alleged Incompetence",
    "summarized_story": "Factional All Progressives Congress (APC) under the chairmanship of Hon.\nRasaq Salinsile has called on the Inspector General of Police, Usman Baba Alkali to urgently deploy Osun State Commissioner of Police Wale Olokode over alleged incompetence.\nAddressing newsmen over the Thursday attack on Oranmiyan House, Aregbesola’s campaign office in Osogbo on Friday, the Chairman, Hon.\nRasaq Salinsile catalogued reported attacks on his members with CP Olokode looking the other way.\nThe chairman who did not rule out reconciliation with the other faction of the party said they belong to APC and will definitely not want anything that will adversely affect it."
  },
  {
    "headline": "LG Demonstrates Futuristic Innovations At CES 2022",
    "summarized_story": "LG Electronics has reinstated its drive of continuous integration of technology and art elements to create a new experience that will engage more people across the world.\nAccording to the general manager, Home Appliances Division at LG Electronics West Africa, Mr. Jiung Park, LG is focused on delivering customer-centric solutions that will better the life of everyone.\nLG’s recently introduced Objet TV is a lifestyle product that aims to capture a slice of the luxury TV market.\nThe LG Objet TV has a changeable cloth cover that looks like a canvas and blends well with any room’s simple decor.\nLG’s gentle use of neutral hues is reflected in the Objet TV, which offers sophistication, visual harmony, and an engaging indoor watching experience."
  },
  {
    "headline": "LG Demonstrates Futuristic Innovations At CES 2022",
    "summarized_story": "LG Electronics has reinstated its drive of continuous integration of technology and art elements to create a new experience that will engage more people across the world.\nAccording to the general manager, Home Appliances Division at LG Electronics West Africa, Mr. Jiung Park, LG is focused on delivering customer-centric solutions that will better the life of everyone.\nLG’s recently introduced Objet TV is a lifestyle product that aims to capture a slice of the luxury TV market.\nThe LG Objet TV has a changeable cloth cover that looks like a canvas and blends well with any room’s simple decor.\nLG’s gentle use of neutral hues is reflected in the Objet TV, which offers sophistication, visual harmony, and an engaging indoor watching experience."
  },
  {
    "headline": "Judge Adjourns Fani-Kayode’s Forgery Trial, Warns Against Delay",
    "summarized_story": "The anti-graft agency had arraigned Fani-Kayode before the court on a 12-count charge of procurement of a “fabricated” medical report and use of the false document.\nADVERTISEMENTAccording to the EFCC, Femi Fani-Kayode on October 11, 2021, in Kubwa, Abuja, fraud connived with one Dr Ogieva Oziegbe to execute a document titled: Medical Report Olufemi Fani Kayode 60 YEARS/MALE/HOSP.\nAt the resumed hearing of the matter on Friday, the judge asked the EFCC counsel, Bilikisu Buhari about the update on the amended charge she promised to file.\nSubsequently, the judge also asked defence counsel, Wale Balogun if they have applied to obtain the proof of evidence.\nThe court adjourned to February 23 for commencement of trial."
  },
  {
    "headline": "10 FASCINATING FACTS ABOUT NOLLYWOOD STAR, JUDE ORHORHA",
    "summarized_story": "2 The Nollywood star and movie producer was born on February 5, 1970.\n3 Orhorha began his professional acting career in 1987, at the Centre for Cultural Studies, University of Lagos.\n5 Interestingly, Orhorha spent almost a decade as a cast member, until Checkmate was finally rested between 1999/2010.\n8 Fun-loving Orhorha was among the few Nollywood stars that acted in the film adaption of Chimamanda Adichie’s Half of a Yellow Sun, in 2012.\nTansi, the venerated Catholic priest in the acclaimed movie, Fr."
  },
  {
    "headline": "10 FASCINATING FACTS ABOUT NOLLYWOOD STAR, JUDE ORHORHA",
    "summarized_story": "2 The Nollywood star and movie producer was born on February 5, 1970.\n3 Orhorha began his professional acting career in 1987, at the Centre for Cultural Studies, University of Lagos.\n5 Interestingly, Orhorha spent almost a decade as a cast member, until Checkmate was finally rested between 1999/2010.\n8 Fun-loving Orhorha was among the few Nollywood stars that acted in the film adaption of Chimamanda Adichie’s Half of a Yellow Sun, in 2012.\nTansi, the venerated Catholic priest in the acclaimed movie, Fr."
  },
  {
    "headline": "10 QUICK FACTS ABOUT THE WAVE-MAKING STAGE PLAY, ‘PHILOMENA’",
    "summarized_story": "By AZUH AMATUS1 Philomena is a high-end cum high-octane stage play.\n2 It parades an array of Nollywood super stars such as Monalisa Chinda, Ejike Asiegbu, Charles Inojie, Francis Duru, Tammy Abusi and Don Kester.\n4 Veteran actor and theatre guru, Bimbo Manuel is the writer and director of Philomena.\n5 Interestingly, Nollywood super star, Monalisa Chinda, aside acting equally doubles as the executive producer of Philomena.\n8 Bimbo Manuel also doubles as the co-executive producer of Philomena."
  },
  {
    "headline": "10 QUICK FACTS ABOUT THE WAVE-MAKING STAGE PLAY, ‘PHILOMENA’",
    "summarized_story": "By AZUH AMATUS1 Philomena is a high-end cum high-octane stage play.\n2 It parades an array of Nollywood super stars such as Monalisa Chinda, Ejike Asiegbu, Charles Inojie, Francis Duru, Tammy Abusi and Don Kester.\n4 Veteran actor and theatre guru, Bimbo Manuel is the writer and director of Philomena.\n5 Interestingly, Nollywood super star, Monalisa Chinda, aside acting equally doubles as the executive producer of Philomena.\n8 Bimbo Manuel also doubles as the co-executive producer of Philomena."
  },
  {
    "headline": "Nigerians are doomed if PDP loses 2023 election",
    "summarized_story": "A former governor of Ekiti State, Ayodele Fayose, said Nigerians are doomed if the People’s Democratic Party PDP does not win the 2023 elections.\nFayose added that Nigerians will remain in poverty if they fail to vote PDP into power in 2023.\nHe said: “If the PDP does not win the 2023 election, then Nigerians are doomed.\nThe cost of diesel today is about N400 per liter; during President Goodluck Jonathan’s (PDP) time, it was N140, N145.\nFayose said, “I have said it over and over, Asiwaju remains a Yoruba leader; I remain a Yoruba leader."
  },
  {
    "headline": "Breaking: Tuchel tests positive for Covid-19",
    "summarized_story": "The Chelsea head coach Thomas Tuchel has tested positive for Covid-19.\nThe club confirmed Tuchel’s status on Saturday.\nAccording to Chelsea, Tuchel will now follow necessary self-isolation protocols and hopes to join up with the team in Abu Dhabi later next week.\nThe team fly out for the Club World Cup following this afternoon’s FA Cup clash with Plymouth Argyle."
  },
  {
    "headline": "14 Govs Backing Tinubu’s Presidential Bid-Jibrin",
    "summarized_story": "No fewer than 14 Governors are passionately supporting the presidential bid of the All Progressives Congress (APC) National Leader Asiwaju Bola Ahmed Tinubu, a former member of the House of Representatives Abdulmumin Jibrin has stated.\nFour additional Governors, he stated, are also in talks to join the presidential train.\nJibrin, who is the Director-General of the Bola Tinubu Support Group Council, further said 26 APC chairmen across the Federation have also confirmed their support for Asiwaju.\nHe tweeted: “14 Governors in and 4 in talks.\n“We are exercising our right of choice by promoting Alhaji Asiwaju Bola Ahmed Tinubu."
  },
  {
    "headline": "Video: Lying-in-state of former head of Interim Govt, Ernest Shonekan",
    "summarized_story": "Video: Lying-in-state of former head of Interim Govt, Ernest ShonekanThe lying in state for the former head of interim national government, Ernest Shonekan was held at his residence in the Ikoyi area of Lagos.\nThe well-attended event had in attendance top government officials, business leaders and members of the diplomatic corps.\nChief Shonekan died on January 11th, 2022 after a brief illness and has since been buried at Ebony Vaults in Ikoyi, Lagos after a funeral service held at the Cathedral Church of Christ.\nOsinbajo, who led the Federal Government delegation, described the late Shonekan as a man of integrity, saying he steadied Nigeria’s ship at a turbulent time.\nWatch the lying in state below;"
  },
  {
    "headline": "Big Brother Mzansi Housemates Display Beautiful Bodies During Shower Hour",
    "summarized_story": "This year’s Big Brother Mzansi is turning out to be one that the fans will live to remember especially due to the banging beautiful body of housemates always on display during their shower hour.\nHere we serve you another dose of naked bodies on display during the latest shower hour as the housemates chatted, laughed as the cameras caught their banging naked bodies.\nIf you missed this part during Shower Hour with beautiful bodies on display, see videos below"
  },
  {
    "headline": "BIG BROTHER MZANSI CONTESTANTS GO WILD AGAIN (VIDEO)",
    "summarized_story": "The new season of Big Brother Mzansi has left fans with so much to savour especially during the shower hour and the contestants served another dose of banging body and moves during their latest shower hourIn case you missed this part of ‘Shower Hour’.\nThe housemates really took it to another level full of fun Face and excitement with dance moves under the shower.\nWhich housemate can you see there??"
  },
  {
    "headline": "Breaking: Thomas Tuchel test positive for COVID-19, to miss FA Cup clash vs Plymouth",
    "summarized_story": "Chelsea head coach Thomas Tuchel has tested positive for Covid-19 and will not be in the dugout for this afternoon’s FA Cup fourth-round tie against Plymouth Argyle.\nThere are now doubts as to whether Tuchel will be able to travel to the Club World Cup in Abu Dhabi.\nA statement on the Chelsea website read: “Thomas Tuchel has tested positive for Covid-19.\nThe Chelsea head coach will now follow necessary self-isolation protocols and hopes to join up with the team in Abu Dhabi later next week.\n“The team fly out for the Club World Cup following this afternoon’s FA Cup clash with Plymouth Argyle.”Chelsea have confirmed that Tuchel’s long-time assistant, Arno Michels, will take charge for today’s FA Cup tie against the League One side."
  },
  {
    "headline": "Volleyball: Transfer of Nigeria U-19 players excites NVBF (PICTURES)",
    "summarized_story": "The Nigeria Volleyball Federation (NVBF) has expressed delight over the successful transfer of two Nigeria U19 players, Izuchukwu Nwachukwu and Pascal Ozokoye.\nNimrod said the signing of both players will open more doors for young volleyball players in Europe and other top leagues in the world.\n“Few years ago, Fernabache signed Arinze Nwanchukwu (Former Nigeria U19 player) and today, Partizani SC is signing two Nigeria U19 players; this means the future of the senior national team is bright.”Nimrod urged players playing in the country’s leagues to remain determined and focused in the 2022 Nigeria Volleyball Season.\nThe Secretary General of Confederation of Africa Volleyball (CAVB) Zone 3 said, “Nwanchukwu and Ozokoye both played at the 2021 Nigeria Volleyball Premier League and were noticed by various foreign clubs.\n“This will also help us build formidable National team in the future because those plying their trades outside have access to standard facilities and equipment.”"
  },
  {
    "headline": "VIDEO: Zamfara deputy speaker submits impeachment letter as lawmakers plot deputy governor’s ouster in fresh move",
    "summarized_story": "The Zamfara state House of Assembly has begun a fresh attempt to impeach the state deputy governor Barr.\nMahadi Aliyu Muhammad Gusau.\nBlueprint reports that already, the impeachment letter has been submitted to the speaker of the state assembly Hon.\nNasiru Muazu Magarya in the early hours of Friday for final decision.\nThe accompanying video clip shows the house speaker receiving impeachment Letter from the deputy speaker."
  },
  {
    "headline": "Nigeria Records More Lassa Fever Deaths As Toll Rises To 40",
    "summarized_story": "Nigeria’s death toll from Lassa fever has risen to 40 after more infected patients lost the battle to the disease.\nOf all confirmed cases, 82 per cent are from Ondo (30 per cent), Edo (27 per cent), and Bauchi (25 per cent) States.\nThe male to female ratio for confirmed cases is 1:0.8.\nIt explained that it has also sent Lassa fever alert letters to states, in addition to carrying out preparedness assessment for the 36 states and the Federal Capital Territory (FCT).\nAccording to the agency, the seven Lassa fever molecular laboratories in its network are working full capacity to ensure all samples are tested, and results are provided within the shortest turnaround time."
  },
  {
    "headline": "Why Every Politician, Civil Servant Should Go To Prison – Orji Kalu",
    "summarized_story": "Former Abia State Governor, Orji Uzor Kalu, believes it is necessary for politicians and civil servants in Nigeria to go to prison.\nKalu, a presidential aspirant and lawmaker representing Abia-North senatorial district, described the prison as a learning facility.\n“They put me in prison to the glory of God and Nigerian people should thank them because I am better off today being there.\n“The average Nigerian knows that I have committed no offence,” said Kalu who insisted that he is not corrupt.\n“It was a glorious thing; that is the best thing God has ever done to me, to be able to put me in the lowest end of the world."
  },
  {
    "headline": "10 Million People Died Of Cancer In 2021 – WHO",
    "summarized_story": "No fewer than 10 million people died of cancer across the world in 2021, the World Health Organisation (WHO) has said.\n“In 2021, the world crossed a sobering new threshold – an estimated 20 million people were diagnosed with cancer, and 10 million died,” said the statement.\n‘For all of these reasons, the theme for this year’s World Cancer Day is “closing the care gap,” the statement explained.\n“And fortunately, much is being done to bring quality cancer care to countries for which, up until now, it has been out of reach.\n“WHO’s efforts are focused on breast cancer – now the most common cancer; cervical cancer – that can be eliminated; and childhood cancer."
  },
  {
    "headline": "150 Suspected Terrorists, Kidnappers, Robbers Arrested In Imo – CP",
    "summarized_story": "﻿A total of 150 suspects have been arrested in connection with terrorism, kidnapping, and armed robbery in Imo State, the police have said.\nHe made the disclosure on Friday while briefing the state governor, Hope Uzodimma, who visited the Police Command Headquarters in Owerri, the state capital.\nGiving a breakdown of the figure, Hussaini explained that 105 of those apprehended were suspected kidnappers and the remaining 45 were suspected terrorists.\nYour Excellency, the Executive Governor of Imo State, Distinguished Senator, Hope Uzodinma (ONWA IMO), Deputy Governor of Imo State, Senior Government Officials, Senior Police Officers, Gentlemen of the Press, Distinguished Ladies and Gentlemen.\nYour Excellency, I assumed duty as the Commissioner of Police, Imo Command on the 11th of August 2021."
  },
  {
    "headline": "Hayatou Wins CAS Appeal Over FIFA One-Year Ban",
    "summarized_story": "Former African football boss Issa Hayatou has won his appeal over a one-year ban imposed for a breach of FIFA’s code of ethics.\nHayatou’s ban was lifted on the eve of the Africa Cup of Nations final staged in his native Cameroon.\nThe deal, signed in 2015, gave exclusive rights to Lagardere of CAF-run competitions for 12 years from 2017 to 2028.\nHayatou was president of the Confederation of African Football for 29 years before being ousted by Ahmad Ahmad in a 2017 election.\nThe deal with Lagardere was scrapped once his near three-decade spell running football in Africa came to an end."
  },
  {
    "headline": "Proposed NSCDC bill misunderstood, says sponsor",
    "summarized_story": "The sponsor of the bill to absorb the Nigeria Security and Defence Corps, Shina Peller, from Oyo state says the proposed bill was misconstrued and misrepresented to Nigerians.\nAdvertisementHe said: “I shall weigh in and make certain clarifications about the proposed bill.\n“On Tuesday, the 1st of February 2022, the Nigeria Security and Civil Defence Corps (Repeal and Enactment) Bill that I sponsored was read for the first time in the House of Representatives.\nAdvertisement“The bill does not in any way seek to render people jobless rather the bill proposes the transfer of assets and personnel of the NSCDC to the Nigera Police.\nAdvertisementRecall that the bill generated a lot of controversies and also led to the withdrawal of NSCDC officials attached to the lawmaker which were later restored."
  },
  {
    "headline": "Zamfara speaker receives impeachment notice against deputy governor -",
    "summarized_story": "The Zamfara State House of Assembly has Commenced impeachment process against the state Deputy Governor, Mahdi Aliyu GusauRecall that the assembly had in November last year summoned the deputy governor for questioning over alleged gross misconductAdvertisementThe deputy speaker of the Zamfara State House of Assembly who doubles as the Chairman House committee on Public Accounts, Musa Bawa said the committee has concluded it’s investigation on the matterMusa Bawa submitted the notice of Impeachment of the State deputy Governor Mahadi Gusau to the speaker of the HouseAdvertisementReceiving the notice, the speaker of the House Nasiru Magarya commended the Committee for a job well-done and assures the Committee that the document will be treated according to the provisions of the constitution of the federal Republic of Nigeria 1999 as amended.\nThe Zamfara State House of Assembly is accusing the state deputy governor of breach of constitution, abuse of office, financial misconduct among other thingsAdvertisementThe House is expected to study the document after which the content would be made publicA Federal High Court in Abuja had on July 19 last year restrained the Zamfara State House of Assembly from taking steps to impeachment the state Deputy Governor Mahdi Aliyu Gusau.\nAdvertisement"
  },
  {
    "headline": "APC inaugurates 34 State chairmen amid unresolved factional crisis",
    "summarized_story": "The All Progressives Congress has inaugurated elected state chairmen in the 34 states of the country and the federal capital territory, Abuja.\nHowever, Kano and Sokoto states chairmen were not inaugurated.\nAdvertisementThis is coming on the heels of preparation for the national convention which has been fixed for February 26th, even as the party has confirmed the convention date to the Independent National Electoral Commission (INEC).\nMaking the announcement during inauguration, the secretary of the Caretaker Committee, James Akpanudoedehe said he has been directed to hand over their certificate of return to them"
  },
  {
    "headline": "APC CECPC approves schedule of activities for 2022 National Convention -",
    "summarized_story": "The All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC) has adopted the timetable/schedule of activities for the 26th February, 2022 APC National Convention.\nThe adoption was taken at its 19th regular meeting on Wednesday 19th January, 2022 at the Party’s National Secretariat (Buhari House)AdvertisementThe approved schedule of activities is as follow***Receiving of the Interim Report of the National Reconciliation Committee – 31/01/2022Advertisement***Consideration and adoption of Reports of State Congresses – 02/02/2022***Inauguration of the State Executives – 03/02/2022Advertisement***Sales of Forms to all aspirants vying for National Offices (APC National Secretariat) – 14/02/2022***Submission of completed forms and accompanying documents (APC National Secretariat) – On or before 19/02/2022Advertisement***Publication of Sub-Committees – 19/02/2022***Screening of all aspirants vying for National Offices – 20th – 22nd of February.\n2022Advertisement***Screening Appeals to hear and resolve complaints arising from the screening exercise – 23/02/2022***Accreditation of all statutory and elected delegates to the National Convention – 24th – 25th of February 2022Advertisement***National Convention to elect National Officers to the National Executive Committee (NEC) – 26/02/2022***National Convention Appeal to hear and resolve complaints arising from the National Convention – 28/02/2022Advertisement"
  },
  {
    "headline": "Amazon Gains Record $190bn in Value, One Day after Meta’s Record Plunge",
    "summarized_story": "A day after Facebook owner Meta Platforms (msuffered the deepest loss of stock market value in history for a U.S. company, Amazon logged the greatest ever one-day increase in value.\nThat beat Apple Inc’s record $181 billion one-day gain in stock market value on Jan. 28 following the iPhone maker’s own blockbuster quarterly report, according to Refinitiv data.\nWith Meta Platforms’ stock slipping 0.3% on Friday, its value stood at about $660 billion.\nThe size of the increase in Amazon’s value eclipsed the market capitalizations of companies including AT&T Inc, Morgan Stanley and Netflix Inc .\nAmazon’s stock price remains down around 15% from its record high close of $3,731.41 in July."
  },
  {
    "headline": "US Identifies Bad Governance, Corruption as Motivations for Coups in Africa",
    "summarized_story": "This was disclosed by the Commander of the United States Africa Command, AFRICOM, General Stephen Townsend who while expressing surprise at the recent upsurge in spate of military coups in Africa, opined that bad governance and corruption may have been responsible for the putsches.\n“So I don’t know why all that is, but my guess is that it has to do with insufficient governance, a lack of good governance, and corruption.\nBut I think that corruption and a lack of good governance is probably behind much of that,” he explained.\nI don’t think they’re doing that, furthering that or promoting those.\nBut they also have a view to expand into Africa, particularly into West Africa and the Gulf of Guinea."
  },
  {
    "headline": "Buhari Restates Commitment to Poverty Reduction, Access to Education at AU Summit",
    "summarized_story": "Nigeria President Muhammadu Buhari has given the assurance that his administration remains committed to lifting the poor and vulnerable Nigerians from poverty.\n“Today, the forum has presented its second peer review report on Nigeria.\nThis Second Peer Review of Nigeria came at a critical time in the history of the country.\nHe said: “Let me use this opportunity to commend the President of South Africa for his dedication to the Forum since his election as the Chairperson of the African Peer Review Forum.\n“I also recognise the distinguished Panel of Eminent Persons for their continued good work in steering the African Peer Review Mechanism process in all member countries."
  },
  {
    "headline": "Nigeria: Power Generation Plunges By 630MW as Fire Forces Lagos Plant to Suspend Operation",
    "summarized_story": "Nigeria’s daily power generation has fallen by an alarming 630 megawatts (MW) since Wednesday following a fire outbreak at Egbin Power Plant in Ikorodu, Lagos State and the resultant shut down of generation by the company.\nEgbin Power had, in a statement issued to its stakeholders and the general public friday, reported the fire incident at its power plant on Wednesday, February 2, 2022, at about 4.20pm, leading to blackout in Lagos State.\nEKEDC had also attributed the reduction in supply to the drop in power generation from an average of 3,700MW to 2,000MW.\nThe Disco said this was caused by gas limitations arising from vandalism and more recently an issue affecting the TCN line from the Egbin Power Plant.\n“As the foremost power plant in the nation, Egbin remains committed to providing power innovatively and responsibly in compliance with good health, safety and environmental standards,” she added."
  },
  {
    "headline": "Former Heads-of-State Present as VP Osinbajo Eulogises Ex-Nigeria Leader Shonekan at Funeral – Arise News",
    "summarized_story": "); former President Goodluck Jonathan; Secretary to the Government of the Federation, Boss Mustapha; Lagos State Governor, Babajide Sanwo-Olu; Ogun State Governor, Prince Dapo Abiodun; and Edo State Governor, Godwin Obaseki.\nBuhari said: “Chief Shonekan was a man I respect so much because of his passion for the development of Nigeria.\nNo man will offer himself as a sacrificial lamb in the manner of Chief Shonekan.\n“As a member of the Council of State, Chief Shonekan attended all meetings until his demise because of his passion to see Nigeria grow.\nWe will continue to cherish his memory.”Also, the Ogun State Governor, Mr. Dapo Abiodun, said Shonekan lived a life of humility."
  }
]