[
  {
    "headline": "Why antidepressants may not be best treatment option for depression –Physician",
    "summarized_story": "Lara AdejoroA resident mental health physician at the LiveWell Initiative, Dr. Motolani Oyerinde says antidepressants may not be the best solution for depression.\n“Depression is an illness; it can be attributed to when the mood is persistently low for two weeks.\n“Depression is very common in our environment and there are so many triggers to make people tilt towards having an emotional breakdown.\n“The first step towards having a very good emotional wellbeing is to understand and recognise your emotions.\n“Counselling, talking to the right people often, companionship, great support even in the place of work can help people out of depression."
  },
  {
    "headline": "Why antidepressants may not be best treatment option for depression –Physician",
    "summarized_story": "Lara AdejoroA resident mental health physician at the LiveWell Initiative, Dr. Motolani Oyerinde says antidepressants may not be the best solution for depression.\n“Depression is an illness; it can be attributed to when the mood is persistently low for two weeks.\n“Depression is very common in our environment and there are so many triggers to make people tilt towards having an emotional breakdown.\n“The first step towards having a very good emotional wellbeing is to understand and recognise your emotions.\n“Counselling, talking to the right people often, companionship, great support even in the place of work can help people out of depression."
  },
  {
    "headline": "Child marriage kills over 60 girls daily –Save the Children Int’l",
    "summarized_story": "Friday OlokorA human right organisation, Save the Children International, has said that child marriage kills over 60 girls daily.\n“More than an estimated 22,000 girls die per year from pregnancy and childbirth resulting from child marriage, new analysis from Save the Children released on International Day of the Girl reveals.\n“With the highest rate of child marriage in the world, West and Central Africa account for nearly half (9,600) of all estimated child marriage-related deaths globally, or 26 deaths a day.\n“Although nearly 80 million child marriages globally have been prevented in the last 25 years, progress had stalled even before the COVID-19 pandemic—which has only worsened inequalities that drive child marriage.\n“Child marriage is one of the worst and deadliest forms of sexual and gender-based violence against girls."
  },
  {
    "headline": "Child marriage kills over 60 girls daily –Save the Children Int’l",
    "summarized_story": "Friday OlokorA human right organisation, Save the Children International, has said that child marriage kills over 60 girls daily.\n“More than an estimated 22,000 girls die per year from pregnancy and childbirth resulting from child marriage, new analysis from Save the Children released on International Day of the Girl reveals.\n“With the highest rate of child marriage in the world, West and Central Africa account for nearly half (9,600) of all estimated child marriage-related deaths globally, or 26 deaths a day.\n“Although nearly 80 million child marriages globally have been prevented in the last 25 years, progress had stalled even before the COVID-19 pandemic—which has only worsened inequalities that drive child marriage.\n“Child marriage is one of the worst and deadliest forms of sexual and gender-based violence against girls."
  },
  {
    "headline": "Where Nigeria went wrong — ASIODU (2)",
    "summarized_story": "They should be united for 2023 election and agree to four or five-year plans to transform Nigeria to 1st World status and global significance.\nThe plan has to be respected, and followed, and they should utilize remaining institutional memory as much as possible.\nWhen we were planning whatwould have become the Fifth National Development Plan in 1975, the people (India) who helped us set up our Planning Commission were completing their 11th Five-year Plan.\nLook at the Fourth Development Plan, 1970-75, and see the various projects in various states and in all sectors with detailed descriptions, costs, locations, etc.\nIt is not possible to divide Nigeria neatly into a given number of successor countries."
  },
  {
    "headline": "Violence worsens with killings in Imo, Enugu; panic in Umuahia",
    "summarized_story": "Pandemonium broke out at the Police Divisional Headquarters, Umulokpa, in Uzo-Uwani Local Government Area of Enugu State following an attack by yet-to-be-identified gunmen on Saturday.\nSimilarly, a lifeless body of a young man identified as Stephen Ajah, was yesterday, discovered along Ozalla/Agbani Road in Nkanu West Local Government Area of Enugu State.\nAlso yesterday, the Imo State government said one of the two military officers killed in last Friday’s clash in Izombe community between members of the gang of the deceased Obele and the military officers was an indigene of Imo State.\nEqually, there was tension in Umuahia, the Abia State capital following invasion by suspected hoodlums enforcing the sit -at -home order yesterday.\nIt is so unfortunate one of the military guys that was killed was an indigene of Imo State."
  },
  {
    "headline": "Ndubuisi Kanu: Court orders Navy, Imo, Abia govts to conduct burial, changes interment date",
    "summarized_story": "An Ikeja High Court, on Monday, ordered the Nigerian Navy to convey the body of the late retired Rear Admiral Ndubuisi Kanu from Lagos to Imo and hand over to the state government prior to the burial.\nThe late Kanu, a former Military Administrator of Lagos and Imo states, died in Lagos on January 13 at the age of 77 as a result of COVID-19 complications.\nThe respondents to the suit are Kelly Kanu, the Nigerian Navy, Simone Abiona (Nee Kanu), Andrey Joe- Ezigbo (nee Kanu), Paul Ndidiamaka Kanu and Karen Johnson (Nee Kanu).\nOthers are Jeffery Kanu, Laura Kanu, Stephen Kanu and Josephine Ndubuisi-Kanu (wife).\n“The Nigerian Navy is to ensure that the corpse of the late Rear Admiral is secured and protected prior to the burial and during the burial."
  },
  {
    "headline": "NMA to FG: Sit up, we’re tired of strikes, brain drain",
    "summarized_story": "Professor Innocent UjahBy Harris Emanuel, UYOThe Nigerian Medical Association, NMA, has called on the Federal Government to put its acts together and address the twin problems of incessant industrial actions and brain drain in the health sector.\nThe President, flanked by his executive committee members, expressed concerns about the ‘hostile’ working environment coupled with poor remuneration, which he stressed were responsible for the incessant strikes and mobility of labour.\nHe urged the government to put in place proactive measures to stem the ugly trends as, according to him, Nigerian doctors should be reckoned with as they have the expertise to excel and do the nation proud.\nREAD ALSO: Buhari meets with NMA membersUjah said: “The doctors are leaving because the working environment is hostile and the remuneration is poor.\n“Incentivisation of health care workers will motivate them to work harder and give their best as health, it is said, is wealth."
  },
  {
    "headline": "Lagos govt arraigns Chidinma, two others over alleged murder of Ataga",
    "summarized_story": "By Onozure DaniaThe Lagos State Government yesterday arraigned Chidinma Ojukwu and Adedapo Quadri, who are the two key murder suspects of the Chief Executive Officer of Super TV, Micheal Usifo Ataga, before a Lagos High Court sitting at Tafawa Balewa Square.\nThe two defendants are facing an eight count charge before bordering on conspiracy, murder, stabbing, forgery, making of bank statements and stealing preferred against them by the Lagos State Government.\nAccording to the prosecution the offences committed is punishable under Sections 411, 233, 365 (2) b, 280, 329, of the criminal laws of Lagos State 2015.\nOjukwu, 21, was alleged to have murdered Ataga, in a Service apartment in Lekki area of Lagos State.\nThe defendant was consequently arrested on June 23 in her father’s house in Yaba and paraded at the Lagos State Police Command headquarters in Ikeja."
  },
  {
    "headline": "BREAKING: Senate adopts electronic transmission of election results",
    "summarized_story": "The Nigerian Senate on Tuesday adopted electronic transmission of election results, a position that was contained in the Conference Committee report submitted to the chamber.\nSenator Smart Adeyemi representing Kogi West opposed the amendment on clause 87 which deals with direct primaries of political parties.\nHe maintained: “I agree with amendment of clause 87 which has to do with political party primaries.\nWhen the chamber resorted to the committee of the whole, the electronic means of transmitting election results was passed, while political parties are to determine how their primaries are conducted.\nElectoral Amendment Act: Chaos in Senate over electronic transmission of result clause"
  },
  {
    "headline": "Usifo Ataga: Suspected killer, Chidinma pleads not guilty",
    "summarized_story": "Chidinma Ojukwu, a 300-level Mass Communication student of the University of Lagos, has pleaded not guilty to the murder of Super Tv CEO, Usifo Ataga.\nRecall that Lagos State Commissioner of Police, Hakeem Odumosu, in July said the slain Ataga was said to be drugged before he was killed.\nThe 22-year-old appeared in court on Tuesday before Justice Yetunde Adesanya of the Lagos State High Court sitting at the Tafawa Balewa Square.\nChioma, however, pleaded not guilty to the 9th count of being in possession of the stolen property.\nUsifo Ataga: Chidinma arraigned over alleged murder of Super TV boss"
  },
  {
    "headline": "Why we invest in technical, vocational training Institutions – NCDMB",
    "summarized_story": "The management of the Nigerian Content Development and Monitoring Board (NCDMB) has said the reason it is investing massively in the rehabilitation of Technical and Vocational Education and Training Institutions (TVETs) is that they provide platforms for job creation and self-empowerment.\nHe made the remark at the weekend during the handing over of ultra-modern woodwork and carpentry workshops it renovated and upgraded at the Government Technical College (GTC) Abak, Akwa Ibom State.\nA statement, issued to DAILY POST, by the General Manager, Corporate Communications/Zonal Coordination, NCDMB, Engr.\nGinah O. Ginah, stressed the need for the provision of high-quality manpower training and development of skills for the teeming youths in the country.\nThe facility was commissioned by the Governor of Akwa Ibom State, Mr. Udom Gabriel Emmanuel, represented by the Secretary to the State Government, Dr. Emmanuel Ekuwem, and the Executive Secretary of NCDMB, Engr."
  },
  {
    "headline": "Police arrest three suspected killers of Chef Emeka in Abuja",
    "summarized_story": "Operatives of the Federal Capital Territory, FCT, Police Command have arrested three suspects in connection with the death of a popular Abuja Chef, Mr Vincent Eluagu Chukwuemeka, popularly known as Chef Emeka.\nDAILY POST recalls that Eluagu’s body was found in his apartment on August 2, 2021, in the nation’s capital.\nThe FCT Police Command subsequently commenced discreet investigations into the murder to unravel the circumstances surrounding the death.\nThe PPRO stated that the investigation revealed that Mr Vincent Eluagu was gruesomely murdered.\n“Investigations by the homicide section of the Command Criminal Investigations Department (CID) clearly revealed how the suspects gruesomely murdered the victim in cold blood."
  },
  {
    "headline": "Oluwo of Iwo condemns idol-worshipping, ascribes kingship to God",
    "summarized_story": "Oba Akanbi, who challenged the infiltration of idolatry to subdue the sacred symbol of God on earth, stated that the foundation of every crown is God.\nSpeaking through a statement made available by his Press Secretary, Alli Ibraheem, the Oluwo affirmed that idolatry was alien to kingship, noting that crowns are sacred, authoritative and the exclusive property of God.\nAccording to the monarch, “God is the king, that means the palace where the king lives should be the house of God.\nThat is what the kings in Yorubaland are doing to God.\nOluwo explained that there is a need to illuminate all the monarchs in Yorubaland on their superiority over deities."
  },
  {
    "headline": "Star singer, KCee, Koffi Tha Guru to thrill at The Sun Awards",
    "summarized_story": "Star singer, songwriter and performer, KCee (Kingsley Chinweike Okonkwo) and Koffi Ayinde Idowu-Nuel, popularly known as Koffi Tha Guru, entertainer, comedian, writer, singer and actor, will thrill audience at The Sun Awards 2020.\nBefore hitting stardom, this star singer played for 12 years with his friend, Hajie, who he met in a church choir.\nThe elder brother of Emeka Okonkwo (aka E-Money), multi-billionaire founder of Five Star Group and Emy Cargo, KCee is known for his scintillating stage performance and powerful voice.\nIdowu-Nuel, professionally known as Koffi Tha Guru, was born to a Togolese mother and Ibeju-Lekki, Lagos father.\nBabagana Kingibe, former SGF (Lifetime Achievement); Chief Frank Okafor, chairman of Marco Polo Group Limited and Prince Chris Igwe, chairman, Mainland Oil Limited (Investor of the Year)."
  },
  {
    "headline": "Seplat Energy name change to provide solution to Africa’s energy challenge",
    "summarized_story": "Seplat Energy Plc, Nigeria’s foremost indigenous energy company, has disclosed its readiness to champion the quest to improve Africa’s energy access by repurposing its operations with a focus on cleaner energy.\nVice-president Yemi Osinbajo, stated this at the 2nd Seplat Energy Summit in Abuja, where the company transitioned from an oil & gas company to an energy company, with renewables and cleaner energy as the priority.\nRepresented by the Minister of State for Environment, Sharon Ikeazor, Osinbajo said Nigeria’s energy transition would not be limited to incremental steps but transformational steps.\n“Nigeria needs a broader set of policies that must align with energy security, which must foster a smooth energy transition across various levels of energy demands.\nAnd gas will continue to play a critical role in Nigeria’s energy transition which will create lots of opportunities in Nigeria’s energy value chain."
  },
  {
    "headline": "2nd Niger bridge, Lagos-Ibadan expressway, others to be completed 2023 –Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, yesterday, assured Nigerians that the 11.9kilometre Second Niger Bridge, 120 kilometre Lagos-Ibadan Expressway and other key projects under the Presidential Infrastructure Development Fund (PIDF) would be completed within the second term of this administration.\nThe PIDF projects are also advancing remarkably.\nThese include the 11.9km Second Niger Bridge, 120 km Lagos-Ibadan Expressway, 375 km Abuja – Kaduna – Zaria – Kano Expressway and the East West Road.\nMost of these projects are expected to be completed within this 2nd term of our Administration,’’ he said.\n“The Itakpe-Ajaokuta rail line has finally been completed and commissioned after 30 years of its conception."
  },
  {
    "headline": "3 pupils, siblings, feared killed by commercial vehicle",
    "summarized_story": "Three school pupils, siblings, were feared killed when a commercial vehicle ran over them on Kajola/Igbominasi Highway in Ilesa, Osun State, yesterday.\nThe siblings met their deaths on their way to school.\nAn eyewitness said that the bus ran over the pupils while on their way to school and they were rushed to a hospital before the police arrived.\n“The police also towed the commercial bus away,’’ he said.\nPolice spokesperson in Osun State, SP Yemisi Opalola, confirmed the incident and said that the police were on top of the situation to restore normalcy in the area."
  },
  {
    "headline": "Why we’re implementing asset declaration for bank executives —EFCC",
    "summarized_story": "The EFCC had, in March, directed all bank executives to declare their assets latest by June 1.\n(Declaration of Assets) Act 1986, enacted to ensure adequate measures in sanitising the nation’s financial system.\nHe, however, reiterated the agency’s commitment to ridding the banking sector of the malpractices.\nHe explained that the situation had prompted the EFCC, under his watch, to intensify engagement with bank executives, more than ever before.\nHe assured that the anti-graft agency, through its Bank Fraud Section, would continue to prevent fraudulent practices in the banking sector and prosecute perpetrators of such fraud."
  },
  {
    "headline": "Seplat’s Energy Transition Plan for National Growth Gets FG’s Endorsement",
    "summarized_story": "Represented by the Minister of State for Environment, Sharon Ikeazor, Osinbajo said Nigeria’s energy transition cannot be limited to incremental steps but transformational ones.\n“Nigeria needs a broader set of policies that must align with energy security, which must foster a smooth energy transition across various levels of energy demands, and gas will continue to play a critical role in Nigeria’s energy transition which will create lots of opportunities in Nigeria’s energy value chain.\nThe Minister of State Petroleum Resources, Timipre Sylva, in his comments, said the ministry endorsed Seplat Energy as the flagship company to drive Nigeria’s energy transition.\nHe called for multiple pathways to energy transition to ensure that no country is left in the process of achieving net-zero emission by 2050.\nAt the first panel session during the summit, Mike Sangster, the CEO of TotalEnergies Nigeria, raised concern about the capital cost of renewable energy which he claimed is much higher than the capital cost of traditional energy, although the recurrent cost of renewable energy is cheaper."
  },
  {
    "headline": "In Break with Buhari, Osinbajo Wants Naira Devalued to Market Rates",
    "summarized_story": "Osinbajo said the naira exchange rate was artificially low.\nHe stated, “As for the exchange rate, I think we need to move our rates to be as reflective of the market as possible.\n“We cannot get new dollars into the system, where the exchange rate is artificially low.\nOne thing must be clear, an overvalued exchange rate is not a good thing for a country.\nSo, the most important thing is that an overvalued exchange rate does more harm to the economy."
  },
  {
    "headline": "Nigeria to Commence Local Production of Weapons, Says President",
    "summarized_story": "The project, he explained, was being implemented under the Defense Industries Corporation of Nigeria (DICON), a military department responsible for arms manufacture.\nThis is being implemented under the Defence Industries Corporation of Nigeria (DICON), a military department responsible for arms manufacture”.\nPresident Buhari expressed delight that over the past two years, Ministers have rendered reports to the Federal Executive Council on their activities related to the achievement of their Ministerial Mandates.\nIn addition, we have launched the Nigeria Innovation Fund by the Nigerian Sovereign Investment Authority (NSIA).\nCommenting on the power sector, President Buhari noted that the implementation of a ‘Willing Buyer-Willing Seller’ Policy has opened up opportunities for increased delivery of electricity to underserved homes and industries."
  },
  {
    "headline": "Midterm Ministerial Performance Review Retreat in Photographs",
    "summarized_story": "Privacy & Cookies: This site uses cookies.\nBy continuing to use this website, you agree to their use.To find out more, including how to control cookies, see here: Cookie Policy"
  },
  {
    "headline": "Osinbajo: Buhari is Nigeria’s Most Popular, Only Credible Leader Ever",
    "summarized_story": "Osinbajo stressed the need for Nigeria to remain an indivisible country, assuring that its challenges would soon be overcome.\nThe vice president spoke during an interactive session with top officials of the Nigerian High Commission in London.\nHe declared, “If you look at all of us sitting here, we represent all the geopolitical zones.\n“We need that level of credibility to be able to solve problems in our country.\n“Let us not be discouraged, let us be very confident, because our country will come out of all these problems and emerge stronger."
  },
  {
    "headline": "BREAKING: Bandits Attack Catholic Seminary In Kaduna, Kidnap Students",
    "summarized_story": "Gunmen have attacked St. Albert the Great Institute of Philosophy, a Catholic-run major seminary situated in Fayit community in Kagoma Chiefdom in the Jama’a Local Government Area of Kaduna State.\nAccording to NewsWireNGR, the bandits attacked the seminary on Monday night.\nThe criminals invaded the school at about 8pm and began shooting sporadically, causing a pandemonium in the area.\nA source who stays close to the school stated that the operation lasted for over an hour before local hunters and vigilante intervened and “chased the terrorists away.”It was also learnt that some students were abducted by the terrorists while others were injured.\nThe number of students abducted could not be ascertained as at the time of filing this report as efforts to speak to authorities in the school for comments proved abortive."
  },
  {
    "headline": "BREAKING: Bandits Attack Catholic Seminary In Kaduna, Kidnap Students",
    "summarized_story": "Gunmen have attacked St. Albert the Great Institute of Philosophy, a Catholic-run major seminary situated in Fayit community in Kagoma Chiefdom in the Jama’a Local Government Area of Kaduna State.\nAccording to NewsWireNGR, the bandits attacked the seminary on Monday night.\nThe criminals invaded the school at about 8pm and began shooting sporadically, causing a pandemonium in the area.\nA source who stays close to the school stated that the operation lasted for over an hour before local hunters and vigilante intervened and “chased the terrorists away.”It was also learnt that some students were abducted by the terrorists while others were injured.\nThe number of students abducted could not be ascertained as at the time of filing this report as efforts to speak to authorities in the school for comments proved abortive."
  },
  {
    "headline": "EXPOSED: How Nigerian Officials Diverted $100,000 Meant For Women Basketball Team, D'Tigress, Owe Each Player $4,900 Allowances",
    "summarized_story": "Speaking with SaharaReporters, a member of the senior women basketball team, D’Tigress, revealed that their allowances, bonuses, training grant worth $4,900 had also not been paid.\nShe added that none of the D’Tigress team members would show up in camp in preparation for the February 2022 FIBA World Cup if the Nigerian government failed to pay them.\nDonations made by banks for players, officials, volunteer stipends etc.\n“They forget we all have a relationship and do communicate; $500 each 2018 FIBA World Cup for players and officials; $1,000 each for finishing final 8 in FIBA World Cup; $1,000 each bonus for winning AfroBasket in Senegal for 2019 players and officials.\nThe $100,000 donated by three Nigerian banks to all the players and officials that made D’Tigress Olympics qualification possible final roster."
  },
  {
    "headline": "EXPOSED: How Nigerian Officials Diverted $100,000 Meant For Women Basketball Team, D'Tigress, Owe Each Player $4,900 Allowances",
    "summarized_story": "Speaking with SaharaReporters, a member of the senior women basketball team, D’Tigress, revealed that their allowances, bonuses, training grant worth $4,900 had also not been paid.\nShe added that none of the D’Tigress team members would show up in camp in preparation for the February 2022 FIBA World Cup if the Nigerian government failed to pay them.\nDonations made by banks for players, officials, volunteer stipends etc.\n“They forget we all have a relationship and do communicate; $500 each 2018 FIBA World Cup for players and officials; $1,000 each for finishing final 8 in FIBA World Cup; $1,000 each bonus for winning AfroBasket in Senegal for 2019 players and officials.\nThe $100,000 donated by three Nigerian banks to all the players and officials that made D’Tigress Olympics qualification possible final roster."
  },
  {
    "headline": "Applicants Kick As Nigerian Police College Hides Admission List, Admits 600 After Selling Over 10,000 Forms",
    "summarized_story": "File PhotoAccording to the applicants, they were asked to resume without the list being released as is the usual practice of the Nigerian Police Academy.\nOne of them told SaharaReporters, “The Nigeria Police Academy kept her applicants waiting for admission since 2020 and in June 2021, they called applicants for screening which made some applicants miss the 2021 Unified Tertiary Matriculation Examination.\nUnfortunately for them, a few were admitted and the academy still didn't release an official list on the website.\n“Later, by rumours the candidates got to know that they could check admission via Jamb Caps.\n“Aspirants should get answers to the following questions: 1.Why was the list not published through the usual channel?"
  },
  {
    "headline": "Senate bows to pressure, empowers INEC to determine e-transmission of election results",
    "summarized_story": "The senate has reconsidered its stance on the electoral act amendment bill and has empowered the Independent National Electoral Commission (INEC) to determine the best mode to transmit election results.\nAdvertisementThe electoral commission will now have to decide how to transmit election results — either electronically or manually.\nThe upper legislative chamber also approved that all political parties must use the direct primary mode in picking candidates.\nAdvertisementIn July, the senate empowered the Nigerian Communications Commission (NCC) to determine the electronic transmission of election results.\n“With respect to conduct of primaries, this is to ensure that every party member participates in the process,” Bamidele said."
  },
  {
    "headline": "Senate bows to pressure, empowers INEC to determine e-transmission of election results",
    "summarized_story": "The senate has reconsidered its stance on the electoral act amendment bill and has empowered the Independent National Electoral Commission (INEC) to determine the best mode to transmit election results.\nAdvertisementThe electoral commission will now have to decide how to transmit election results — either electronically or manually.\nThe upper legislative chamber also approved that all political parties must use the direct primary mode in picking candidates.\nAdvertisementIn July, the senate empowered the Nigerian Communications Commission (NCC) to determine the electronic transmission of election results.\n“With respect to conduct of primaries, this is to ensure that every party member participates in the process,” Bamidele said."
  },
  {
    "headline": "Chidinma pleads not guilty to murder of Super TV CEO",
    "summarized_story": "Chidinma Ojukwu, the embattled student of the University of Lagos (UNILAG), has pleaded not guilty to the murder of Usifo Ataga, the late CEO of Super TV.\nBoth were arraigned on eight counts bordering on the offences of murder, forgery, and stealing.\nBut during the court session, presided over by Yetunde Adesanya, the judge, they pleaded not guilty to the charges.\nAdvertisementEgbuchu Chioma, Chidinma’s sister, who was also arraigned for alleged possession of Ataga’s phone, pleaded not guilty to the theft charge.\nBut in a dramatic twist, Chidinma denied her initial confession that she killed the Super TV CEO."
  },
  {
    "headline": "Chidinma pleads not guilty to murder of Super TV CEO",
    "summarized_story": "Chidinma Ojukwu, the embattled student of the University of Lagos (UNILAG), has pleaded not guilty to the murder of Usifo Ataga, the late CEO of Super TV.\nBoth were arraigned on eight counts bordering on the offences of murder, forgery, and stealing.\nBut during the court session, presided over by Yetunde Adesanya, the judge, they pleaded not guilty to the charges.\nAdvertisementEgbuchu Chioma, Chidinma’s sister, who was also arraigned for alleged possession of Ataga’s phone, pleaded not guilty to the theft charge.\nBut in a dramatic twist, Chidinma denied her initial confession that she killed the Super TV CEO."
  },
  {
    "headline": "Nigeria’s oil production rises by 0.8% to 1.25m b/d in September",
    "summarized_story": "Nigeria’s oil production increased marginally in September to an average of 1.25 million barrels per day from 1.24 million the previous month.\nAlthough much lower than projected revenue in the budget due to problems in oil production,” Osinbajo said.\nAccording to the S&P Global Platts survey, Nigeria’s low oil production was caused by damages along key crude grades.\nIn August, Shell Petroleum Development Company (SPDC) declared force majeure on Forcados crude oil — one of Nigeria’s main crude oil terminals, exporting an average of 240,000 barrels of crude oil daily.\nOn Tuesday, Brent crude oil futures, global oil benchmark, rose 0.17 percent to $83.82 a barrel, while U.S. West Texas Intermediate (WTI) crude oil futures increased 0.08 percent to $80.60 a barrel."
  },
  {
    "headline": "China’s growing influence is transforming African tech",
    "summarized_story": "The African market offers Chinese companies and investors a growing young population expected to reach 1.7 billion by 2030.\nThese Chinese tech companies decided to establish a stronger presence in Africa despite the political and economic instability.\n“Until African countries manufacture their own equipment, they’ll always be susceptible to international organisations having access to their data,” Tugendhat said.\nDespite the immense contribution of Chinese tech to the African fintech space, there’s still room for growth.\nHaving a strong Chinese presence in African tech has clearly been very beneficial; a monopolistic dominance is what’s worrying."
  },
  {
    "headline": "From hawking dry fish to coding at Bloomberg: the story of a Nigerian first class graduate",
    "summarized_story": "She decided, then, to take a break from applying for international jobs and focus on her current job at the time.\nKemi was the first child of her family, born in 1995, in the Akowonjo area of Lagos, Nigeria.\nTwo years after secondary school, Kemi was admitted into the Faculty of Engineering at the Obafemi Awolowo University (OAU), Ife.\nAt OAU, it was easy to get into coding as there were always coding camps going on, on the campus.\n“I like to say I officially became a software engineer during my internship at a leading e-commerce company,” Kemi said."
  },
  {
    "headline": "Google to invest $1 billion in Africa over the next 5 years",
    "summarized_story": "At the first virtual Google for Africa event today, Sundar Pichai, CEO of Google and Alphabet, announced a plan to invest $1billion over 5 years to support digital transformation in Africa.\nTo provide affordable internet access in Africa, Google is building global infrastructure to help bring faster internet to more people and lower connectivity costs.\nAs part of Google’s commitment to supporting Black-led startups in Africa, the company announced the launch of an Africa Investment Fund.\nIn the last year we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Africa said.\nGoogle has also supported more than 50 nonprofits across Africa with over $16 million of grants and enabled 100 million more Africans to access internet services for the first time through Android."
  },
  {
    "headline": "Google launches $50m equity-based investment fund for African startups",
    "summarized_story": "At the first-ever Google for Africa event, held virtually on Wednesday, Google announced the launch of a 50 million-dollar Africa Investment Fund, through which it plans to invest in African startups.\nSelected companies will be provided with access to Google’s employees, network and technologies, to help them build products.\nTargeted at early- to growth-stage startups, the new investment fund is equity-based, marking a significant shift in Google’s approach to investing in African startups.\nMeanwhile, the Google Black Founders Fund will invest in black-led startups in Africa by providing cash awards and hands-on support.\nGet the best African tech newsletters in your inbox“In the last year, we have seen more investment rounds into tech startups than ever before,” Nitin Gajria, Managing Director for Google in Sub-Saharan Africa, said in an official statement."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Update [ October 1, 2021 at 8:14 am.\nWAT] The eNaira website is now up The Central Bank of Nigeria (CBN) has postponed..."
  },
  {
    "headline": "From death to life: how a loved one’s demise spurred the idea for Healthtracka",
    "summarized_story": "“At the point of my father’s death, I knew I needed to do something about this non/late diagnosis of health issues in Africa.\nMost people still wait for an emergency before going in for any health tests.\nFor some, it feels like a lot of stress to take a pause in their lives to go seek health testing.\n“Our primary mission at Healthtracka is to make health testing accessible to Africans.\n“The health tech industry in Africa is ripe for disruption and radical innovation."
  },
  {
    "headline": "Mono’s Series A, the digital gender gap, Airtel Money’s pay later service",
    "summarized_story": "On Monday, October 11, 2021, African fintech startup, Mono, announced a $15m Series A.\nThis article provides some much-needed context on Mono and the growing sub-sector it’s playing in: Why API-led fintech startups are becoming a big deal in NigeriaCountries lose $1 trillion from the digital gender gap in over a decadeWomen in tech.\nAdvertisementBye-bye money: On Monday, October 11, 2021, the World Wide Web Foundation and Alliance for Affordable Internet(A4AI) released a report on the Economic Consequences of the Digital Gender Gap, and it was found that lower-middle-income countries have lost an estimated $1 trillion in GDP due to digital gender gap in over a decade.\nWhat is the digital gender gap?\nTanzanian Airtel Money users get extra spending powerAirtel Money users in Tanzania can now spend and pay laterWhat’s the news?"
  },
  {
    "headline": "A Journey Through The Lives Of 4 Women Doing Big Things In African Tech • Techpoint Africa",
    "summarized_story": "Share this article:The underrepresentation of women in the tech space continues to be a prevalent phenomenon in most parts of the world.\nIn Yanmo Omorogbe’s — Co-Founder, Bamboo — opinion, seeing more women do things in tech might encourage more women to come in.\nAdvertisementAs male-dominated as the tech space is, however, some women are making their mark, serving as a source of encouragement for more women to dive in.\nTo celebrate this year’s International Day for the Girl Child, Techpoint Africa spoke to four tech women about their work, life and how they’re navigating a male-dominated ecosystem.\nAnd it has grown over the years, and I hope it’ll continue to grow.”Through the scholarship, she has seen females enter the tech space."
  },
  {
    "headline": "Anti-open grazing law: Obaseki engages stakeholders, urges citizens’ support to end insecurity – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBenin City – The Edo State Governor, Mr. Godwin Obaseki, on Monday met with relevant stakeholders to review the government’s strategies at improving security and stemming herders-farmers crisis in the state.\nStakeholders at the event were drawn from different walks of life, including traditional rulers, youth groups, religious bodies and Civil Society Organisations (CSOs), among others.\n“The best way of enforcing a law is to bring everybody together to be part of that law.\nOriakhi Davies, said cattle rearing is a private business and anybody interested in the business should acquire land for such business.\nChairman, Cattle Dealers Association, Edo State, Alhaji Saad Ahmed, said about forty-five percent of cows consumed in Benin comes directly from the North."
  },
  {
    "headline": "Edo to immortalise late Prof. Victor Uwaifo, as family rolls out burial plans – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has disclosed plans to immortalise late music maestro, Prof. Victor Uwaifo, for his contributions to the development of Edo State and the country.\nChief of Staff to the Governor, Osaigbovo Iyoha, disclosed this on Monday while briefing journalists at the Government House in Benin City.\nThis will be followed by Requiem Mass, as well as interment on the same day between1 and 3 pm.\nDay three, which is Saturday 16th, October 2021, there will be social activities at Garrick Playground, Ekenwan Road, Benin City, by 12 noon.\nThe four-day programme will end on Sunday 17th October 2021, with a Thanksgivings Service at Holy Cross Catholic Cathedral, Mission Road Benin City, from 11 am prompt."
  },
  {
    "headline": "NSCDC boss dismisses fraud, corruption allegations – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – Dr Ahmed Audi, Commandant-General of the Nigeria Security and Civil Defence Corps (NSCDC), on Monday in Abuja dismissed fraud and corruption allegations levelled against him on some social media websites.\nThe NSCDC management also frowned at the allegation in a statement issued by the Corps’ Public Relations Officer, Mr Olusola Odumosu.\nOdumosu said that the attention of the Corps management was drawn to a spurious allegation of fraud and massive corruption against Dr Audi.\n“While the Corps does not wish to join issues with anyone on the matter, the commandant-general and the management team wish to assure the public of its sincerity.\n“Sincerity to rejig, reform and restructure the Corps in line with clear ministerial directive to nip current security challenges in the bud,’’ he stated."
  },
  {
    "headline": "Edo govt does not owe monthly pension – Commissioner – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said it pays pension to pensioners on or before 26 of every month and does not owe any pension to date.\nAndrew Emwanta JP, said the state government will continue to show commitment towards the welfare and wellbeing of pensioners in the state.\nHe said, “Edo State Government does not owe any pensioner their monthly pension.\nPensioners in Edo State get their monthly entitlement on or before 26 of every month.\nWhile some members of the Union are in support of the statutory deduction, others are against it.”He said the state government does not owe pensioners any debt whatsoever, as far as the issue of pension is concerned."
  },
  {
    "headline": "Kaspersky blocks over 30,000 mobile malware attacks in Nigeria, Kenya, South Africa in six months",
    "summarized_story": "Out of the more than 206,000 mobile malware attacks blocked by Kaspersky solutions for the Middle East, Turkey and Africa (META) region in just six months measured between January and June 2021, over 30,000 of these attacks combined originated from Nigeria (14,071), Kenya (10,697), and South Africa (5,499).\nIn fact, Kaspersky’s latest research shows that when looking at the top ten countries by share of users attacked by mobile malware Nigeria places eighth (at 11.76 per cent).\nEven though Kenya and South Africa might not feature as prominently, the mobile malware threat is still a concern, along with the shift to more targeted based attacks these countries are seeing.\nThe top three most prevalent malware behaviours that Kaspersky has seen in Kenya and Nigeria are Trojans, Trojan-Downloaders; and Trojan-Droppers.\nMobile malware uses text messages, so users should never respond to requests for credit card details or other private information."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "AfDB to design bonds to tackle Nigeria’s security crisis",
    "summarized_story": "The African Development Bank (AfDB) has said it is ready to assist Nigeria in designing and implementing ‘Security-Indexed Investment Bonds’ to raise more resources to tackle its security challenges.\nPresident of the AfDB, Akinwumi Adesina, said this on Monday at the Mid-Term Ministerial Performance Review Retreat in Abuja.\nWe must recognise the strong linkages between security, investment, growth, and development,” said Mr Adesina.\nThey are for facilitating business and exports, and stimulating industrial manufacturing, and competitiveness of local businesses and exports,” he noted.\n“We should not be decongesting the ports in Nigeria; we should be transforming the ports."
  },
  {
    "headline": "At last, Senate empowers INEC to determine transmission of election results",
    "summarized_story": "The Nigerian Senate on Tuesday, reconsidered the electoral act amendment bill and has empowered the Independent National Electoral Commission (INEC) to determine the best mode to transmission of election results.\nBy the amendment, INEC will now have to decide how to transmit election results, whether electronically or manually, depending practicality.\nThe senate also approved that all political parties must use the direct primary mode in picking candidates.\nMore subsequently…"
  },
  {
    "headline": "Supreme Court reserves judgment in N66bn suit by governors against FG",
    "summarized_story": "Nigeria’s Supreme Court on Monday reserved judgment in a suit filed by the 36 state governors seeking order to compel the Federal Government to take up funding of capital projects for states High Courts, Sharia Courts of Appeal and Customary Courts of Appeal.\nThe governors in the suit also applied for an order of the apex court to compel the Federal Government to pay them N66bn, being an amount spent on capital projects for the three courts in their respective suits, PUNCH reported.\nAccording to him, the Section should be invoked to place the responsibility of funding their capital projects at the door steps of the Federal Government.\nGazali stated that since the states have been responsible for the funding of capital projects for the Courts since 1999, the position should be maintained.\nHe faulted Executive Order 10 and prayed the Court to grant only relief 9 and dismiss reliefs 1 to 8."
  },
  {
    "headline": "NPA’s Gamboro Umar elected acting president of Apapa Club",
    "summarized_story": "The General Manager, Board Secretary/Legal Adviser of Nigerian Ports Authority (NPA), Innocent Gamboro Umar, has taken over as the Acting President of the prestigious Apapa Club.\nUmar emerged as acting president of the club after his election as Vice President on October 1, 2021.\nOther newly elected officers include Emeka Ebinum (General Secretary); Ishola Olalekan (House Secretary); Seyi Akinboboye (Membership Secretary) and Abibo Georgewill (Maintenance Secretary).\nUmar thanked members for the mandate given to his team, asking all members to rededicate themselves to the service of the Club.\n“We are indeed very lucky to serve in a period when the traffic gridlock in Apapa has eased off."
  },
  {
    "headline": "An Gama Wasan Gwaji Na Farko Na Gasar Wasannin Olympics Ta Lokacin Hunturu Ta Beijing",
    "summarized_story": ""
  },
  {
    "headline": "Sin Ta Kasance A Matsayi Na Gaba Kan Nazarin Nau’o’in Halittu A Fannoni Da Dama",
    "summarized_story": ""
  },
  {
    "headline": "An Bude Taron COP15 A Birnin Kunming",
    "summarized_story": ""
  },
  {
    "headline": "Sin Na Fatan Amurka Za Ta Cika Alkawarin Da Ta Dauka Na Gaggauta Samar Da Tallafin Alluran Rigakafin Cutar COVID-19",
    "summarized_story": ""
  },
  {
    "headline": "Majalisar Malaman Kano Ta Sauke Sheikh Khalil A Shugabancinta",
    "summarized_story": ""
  },
  {
    "headline": "Child marriage kills over 60 girls daily – Group",
    "summarized_story": "A human right organisation, Save the Children International, has said that child marriage kills over 60 girls daily.\nThe organisation quoting a report said it had been estimated that 44 per cent of girls in Nigeria get married before their 18th birthday, one of the highest rate of child marriage globally.\n“With the highest rate of child marriage in the world, West and Central Africa accounts for nearly half (9,600) of all estimated child marriage-related deaths globally, or 26 deaths a day.\n“Although nearly 80 million child marriages globally have been prevented in the last 25 years, progress had stalled even before the COVID-19 pandemic—which has only worsened inequalities that drive child marriage.\n“Child marriage is one of the worst and deadliest forms of sexual and gender-based violence against girls."
  },
  {
    "headline": "Child marriage kills over 60 girls daily – Group",
    "summarized_story": "A human right organisation, Save the Children International, has said that child marriage kills over 60 girls daily.\nThe organisation quoting a report said it had been estimated that 44 per cent of girls in Nigeria get married before their 18th birthday, one of the highest rate of child marriage globally.\n“With the highest rate of child marriage in the world, West and Central Africa accounts for nearly half (9,600) of all estimated child marriage-related deaths globally, or 26 deaths a day.\n“Although nearly 80 million child marriages globally have been prevented in the last 25 years, progress had stalled even before the COVID-19 pandemic—which has only worsened inequalities that drive child marriage.\n“Child marriage is one of the worst and deadliest forms of sexual and gender-based violence against girls."
  },
  {
    "headline": "PDP: Southern governors tip Southeast for National Secretary",
    "summarized_story": "Peoples Democratic Party (PDP) governors from the South have resolved to micro-zone the party’s National Secretary to the Southeast, it was learnt yesterday.\nSources hinted yesterday that the Southern Governors will meet in Benin City, Edo State capital today to harmonise their positions on the matter.\nThe fee for the position of Deputy Chairman is N3 million while National Secretary aspirants and others are required to pay N2 million.\nIn addition to the National Secretary, other key positions zoned to the South include the National Publicity Secretary, National Woman Leader, Financial Secretary and National Auditor among others.\nIt was gathered that the decision to cede the National Secretary to the Southeast was informed by the sharp division among party leaders in the Southwest zone."
  },
  {
    "headline": "PDP: Southern governors tip Southeast for National Secretary",
    "summarized_story": "Peoples Democratic Party (PDP) governors from the South have resolved to micro-zone the party’s National Secretary to the Southeast, it was learnt yesterday.\nSources hinted yesterday that the Southern Governors will meet in Benin City, Edo State capital today to harmonise their positions on the matter.\nThe fee for the position of Deputy Chairman is N3 million while National Secretary aspirants and others are required to pay N2 million.\nIn addition to the National Secretary, other key positions zoned to the South include the National Publicity Secretary, National Woman Leader, Financial Secretary and National Auditor among others.\nIt was gathered that the decision to cede the National Secretary to the Southeast was informed by the sharp division among party leaders in the Southwest zone."
  },
  {
    "headline": "Bandits kidnap scores in Catholic seminary in Kaduna",
    "summarized_story": "Kaduna bandits have attacked a Catholic seminary in Fayit community, Kogoma Kingdom in Jama’a LGA of Kaduna state.\nMultiple reports said the attack on the degree awarding institution, named St. Albert the Great Institute of Higher Education was carried out on Monday night.\nInformation is scanty, but it is believed the bandits made away with scores of students of the institution.\nThere has been no official statement from the school, or the Catholic authorities in Kafanchan, the owners of the school.\nThe Kaduna state government has also not reacted to the latest mass abduction in the state."
  },
  {
    "headline": "I am not guilty",
    "summarized_story": "Chidinma Ojukwu has pleaded not guilty to the murder of the Super TV Chief Executive Officer, Usifo Ataga.\nChidinma, a 300-level Mass Communication student of the University of Lagos, who is the prime suspect, made the plea on Tuesday.\nThe 22-year-old was arraigned before Justice Yetunde Adesanya of the Lagos State High Court sitting at the Tafawa Balewa Square.\nShe was arraigned alongside one Adedapo Quadri on eight counts bordering on the offences of murder, forgery and stealing.\nChioma, however, pleaded not guilty to the 9th count of being in possession of the stolen property."
  },
  {
    "headline": "Crisis Hits Ekiti APC As Governor Fayemi’s Wife ‘Plots To Impose Governorship Candidate’",
    "summarized_story": "The ruling All Progressives Congress (APC) in Ekiti State is involved in a conflict over Bisi Fayemi, Governor Kayode Fayemi’s wife, imposing a candidate for the 2022 governorship race.\nMrs Fayemi, according to several party members who spoke to SaharaReporters, was supporting the Secretary to the State Government, Biodun Oyebanji, despite the Governor’s wishes.\nThey advised the First Lady not to impose Oyebanji on the party, saying her husband was willing to embrace equality by selecting someone from the Ekiti-South Senatorial District for the governorship ticket.\n“The First Lady may end up losing her respect should she work against attempt by APC to zone the governorship ticket to Ekiti South.\n“The party leadership at the national under Governor Mai Mala Buni, is aware of the fact that the next governor in Ekiti should emerge via zoning modality."
  },
  {
    "headline": "Gunmen Kidnap Two Final-Year University Of Calabar Students",
    "summarized_story": "Two students from the University of Calabar in Cross Rivers State have been kidnapped by gunmen suspected of being kidnappers.\nAccording to Cross River Watch, the victims were a final-year radiography student named John Edet and a final-year female marketing student named Joy.\nDuring the incident, a female naval rating reportedly evaded being taken.\nThe gunmen, however, took her bag, which included her identity card and other valuables.\nThe university has not yet responded to the event."
  },
  {
    "headline": "BREAKING: Bandits Attack Catholic Seminary In Kaduna, Kidnap Students",
    "summarized_story": "St. Albert the Great Institute of Philosophy, a Catholic-run major seminary in Fayit, Kagoma Chiefdom, Jama’a Local Government Area, Kaduna State, has been attacked by gunmen.\nThe bandits stormed the seminary on Monday night, according to NewsWireNGR.\nAt around 8 p.m., the bandits broke inside the school and began firing indiscriminately, causing chaos in the vicinity.\nThe operation lasted nearly an hour, according to a source close to the school, when local hunters and vigilantes interfered and “chased the terrorists away.”Terrorists kidnapped some students, while others were injured, according to reports.\nThe number of pupils abducted could not be determined at the time of filing this article because attempts to speak with school officials for comment were unsuccessful."
  },
  {
    "headline": "Pay Repentant Boko Haram Terrorists, Bandits N25,000 Monthly Stipend — Methodist Prelate To Buhari",
    "summarized_story": "His Eminence, Dr. Samuel Chukwuemeka Kanu-Uche, the Prelate of the Methodist Church in Nigeria, has requested President Muhammadu Buhari to give repentant Boko Haram members and bandits N25,000 monthly stipends.\nHunger and poverty, according to Kanu-Uche, drove Northerners to embrace terrorism and banditry.\nGumi’s access to bandits in the North, according to Kanu-Uche, may be utilized to beat them into submission.\nHowever, the Methodist Prelate said: “Who are those collecting ransom for bandits?\n“If you engage them and be paying them N25,000 monthly, they will not kidnap."
  },
  {
    "headline": "Breaking: Senate bows, rescinds decision on electronic transmission of results",
    "summarized_story": "After months of bashings from the public over resolution against unfettered electronic transmission of election results by the Independent National Electoral Commission (INEC) where and when practicable, the Senate is set to rescind its unpopular decision.\nThe Senate had in July during consideration of report on 2010 Electoral Act (Amendment ) Bill 2021 submitted by its Commitee on INEC, amended clause 52(3) as recommended.\nWhile the clause as presented by the committee in the report, said INEC can transmit election results electronically where and when practicable, the Senate passed the amended version which said, “INEC can transmit election results electronically subject to confirmation of Nigerian Communication Commission (NCC) of adequacy and security of National Network .\nThe House of Representatives at the time, adopted the clause as originally recommended by committees of both Chambers on INEC.\nConsequently since, the Senate has been in the eye of the storm which made it to make U- turn by listing its intension to rescind the decision on the Order Paper during Tuesday plenary ."
  },
  {
    "headline": "Doctors said I won’t live beyond 35, but here I am healthy at 70 – Dokpesi",
    "summarized_story": "The media owner who couldn’t speak in the early years of his life was already ‘sentenced’ to death by doctors who declared he won’t make it beyond 35 years.\nAt that time, I felt highly discriminated against, I felt I was likely to be denied the opportunity to live.\nThe people just came up to say I had been poisoned and people that committed the atrocity were there present.\nPossibly, that 35 years was why God so ordered my life as smooth sailing as it was up to that 35 years.\nPresident Jonathan is a younger person, he is able to represent Nigeria, promote Nigeria, attract friends and investors to Nigeria."
  },
  {
    "headline": "Osinbajo: How Buhari’s post-COVID-19 stimulus rescued economy",
    "summarized_story": "Despite the challenges of funding and other issues, the implementation of the N2.3 trillion Economic Sustainability Plan (ESP) has made significant impact across different sectors.\nAnd Mr. President asked me to chair the Committee to draw up the plan and later to implement it.\nFor instance, Prof. Osinbajo noted that the ESP MSMEs Survival Fund designed to create jobs and safeguard existing ones, supported 1.1 million Nigerians and businesses nationwide.\n“A subsidy of N5.1billion was paid to over one million farmers under the Fertilizer Subsidy Programme, which is a critical part of the Food for Jobs programme.\n“Sometimes you will get people who are benefiting more than once because we simply have no line of sight on what is going on, on one side.”He stated that there should be one-clear economic plan, not two, saying “we cannot have a CBN-led economic plan and a government led plan."
  },
  {
    "headline": "Poultry farmers lament high cost of eggs’ production -NigPilot",
    "summarized_story": "Poultry Farmers Association of Nigeria, PFAN in Kwara State has raised the alarm that the high cost of eggs production, particularly the raising of chicken, has discouraged a lot of poultry farmers from being in the business.\nSpeaking at an event to mark World Egg Day and the 20th anniversary of the global event, the state chairman of PFAN, Mr. Ojo Akinwumi Richard lamented that poultry farmers are presently running at loss.\nHe, therefore, appealed to the federal government to allow the importation of poultry feeds into the country, noting that Nigerian farmers cannot produce enough grains to meet poultry feeds production.\nThe chairman, however, assured at this year’s event, tagged: “Eat your egg today and every day” that the association would continue to do its best in making eggs available for Nigerians.\nSola-Ojo said: “Egg is highly nutritious with about 13 vitamins, except Vitamin C. It has Omega 3 Fatty Acids and all the essential Amino Acids."
  },
  {
    "headline": "2023: Adamu heads APC reconciliation cmttee, vows to excel where Tinubu, Akande failed -NigPilot",
    "summarized_story": "Ahead of the 2023 general elections, leadership of the ruling All Progressives Congress, APC, has inaugurated a national reconciliation committee to mend fences among different warring gladiators in the party.\nSpeaking Monday at the national secretariat of the APC after another National Reconciliation Committee was inaugurated, Senator Adamu, who was appointed to lead the new panel promised a great deal.\nWhen asked about what his committee can achieve compare to the two previous reconciliation panels, the former governor said: “Somehow, all the members of the National Reconciliation Committee that I have seen are positive.\n“Consult with larty leaders and concerned members as the committee deems necessary with a view to achieving peace therein.\n“Your report on resolution of these discrepancies would indicate our readiness as a united and strong family for the national convention."
  },
  {
    "headline": "2021 Girl Child Day: Group advocates increased access to digital literacy for girls -NigPilot",
    "summarized_story": "The need to open more access to digital literacy for girls so that they can compete favorably with their male counterparts has been emphasized.\nThe group also organized a digital Training session for girls at Govt Junior secondary school Damagasa in Lokogoma Abuja.\nOur Generation.” emphasizes the imperativeness of digital literacy and inclusivity for the Girl Child.\nThe implication of this is that girls are also less likely than boys to use and own devices, and gain access to tech-related skills and jobs.\nEmpower Her 4 Africa, therefore, called on government and relevant authorities to increase access to digital education and devices for girls, while also demanding that all schools be equipped with functional state-of-the-art digital laboratories to boost access to digital literacy for girls."
  },
  {
    "headline": "NCR launches “Project Zero Hunger” for refugees, IDPs, others -NigPilot",
    "summarized_story": "National Commission for Refugees, Migrants and Internally Displaced Persons NCFRMI, in collaboration with Defence and Police Officers’ Wives Association DEPOWA, has launched the “Project Zero Hunger” programme aimed at catering for refugees, IDPs and other vulnerable groups in states across the federation.\nThe Project Zero Hunger Initiative will fight food insecurity and stem the threat of famine in our land.\nThe Project will additionally assuage the growing burden of hunger amongst persons of concern.\nI see that much has been done through partnerships with critical stakeholders for appropriate support to mobilize and deploy resources to provide a pedestal of success for the Project Zero Hunger Initiative.\n“On behalf of our persons of concern, I hereby launch Project Zero Hunger and pray that it positively impacts on the lives of the intended beneficiaries.”"
  },
  {
    "headline": "BREAKING: Chidinma Pleads Not Guilty To Murder Of Late Usifo Ataga",
    "summarized_story": "﻿Chidinma Ojukwu has pleaded not guilty to the murder of Super TV CEO, Usifo Ataga.\nBoth suspects pleaded not guilty to eight counts bordering on the offences of murder, forgery and stealing.\nChioma, however, pleaded not guilty to the 9th count of being in possession of the stolen property.\nI don’t know who must have come into the apartment.\nI don’t know what happened when I left to buy food,” she said."
  },
  {
    "headline": "Bandits Attack Catholic Seminary In Kaduna, Kidnap Students",
    "summarized_story": "Gunmen have attacked the Saint Albert the Great Institute of Philosophy, a Catholic church-owned seminary in Fayit community in Kagoma Chiefdom of Jama’a Local Government Area of Kaduna State.\nThey were said to have invaded the school on Monday night and started shooting sporadically, thereby, creating fear among the students and staff of the school.\nIt was gathered that the gunmen later took some unconfirmed number of students away to an unknown destination before the arrival of local vigilantes who were able to prevent them from taking more students.\nRead Also: Six Women, Nine Children Escape From Boko Haram CaptivitySpokesman of the Kaduna Police Command, Mohammed Jalige, who confirmed the incident, said the police tactical team is currently at the school to confirm the number of those kidnapped and how the incident happened."
  },
  {
    "headline": "Six Women, Nine Children Escape From Boko Haram Captivity",
    "summarized_story": "Six women and nine children kidnapped in the North-East have escaped their captors, walking for six days through the bush to freedom, an official said Monday.\nChibok was the scene of the 2014 abduction of more than 200 schoolgirls by Boko Haram which earned the jihadist group global notoriety.\nIt was not clear who kidnapped the women and children, but Buni Yadi is a known enclave for the IS-linked Islamic State West Africa Province (ISWAP), which split from Boko Haram in 2016 to become a dominant force in the region.\nZulum expressed delight receiving the hostages after they “fell prey to Boko Haram terrorists,” a name officials use for both groups.\nBoko Haram and rival ISWAP are notorious for kidnapping women."
  },
  {
    "headline": "Buhari Approves N13.3bn For Take-Off Of Community Policing Initiative",
    "summarized_story": "﻿President Muhammadu Buhari on Monday approved N13.3 billion for the take-off of the Community Policing initiative as part of efforts to boost security nationwide.\nBuhari disclosed this in Abuja at the opening of a two-day Mid-Term Ministerial Performance Review Retreat to assess progress made towards the achievement of the nine key priorities of his administration.\n“We have also approved the sum of N13.3 billion for the take-off of the Community Policing initiative across the country, as part of measures adopted to consolidate efforts aimed at enhancing security nationwide,” he said.\nOn other efforts to strengthen national security, Buhari said it was gratifying to note that Nigeria had received six A-29 Super Tucano aircraft.\nHe said the propeller-driven aircraft are being used for training, surveillance and attack by the military."
  },
  {
    "headline": "‘No Time to Die’ Wastes No Time Topping US Box Office",
    "summarized_story": "“No Time to Die,” the latest installment in the James Bond movie franchise, shot straight to number one in North America’s box office on its opening weekend, netting $55.5 million, according to industry watcher Exhibitor Relations.\nLast week’s leader “Venom: Let there Be Carnage,” was knocked down to second place with a haul of $31.7 million, making a total of $141 million for its first two weeks.\nThe Sony film stars Tom Hardy as investigative journalist Eddie Brock whose symbiotic bond with an alien named Venom gives him superpowers.\nThe animated feature by United Artists follows the iconically creepy, kooky, mysterious and spooky family as they go on vacation.\nThe film stars Chinese-Canadian actor Simu Liu, Disney’s first Asian lead, as a former assassin in the shadow of an evil father (Hong Kong legend Tony Leung)."
  },
  {
    "headline": "Father of flogged Kwara Madrassah student backs school's action -",
    "summarized_story": "The father to the female student who was among those brutally flogged in Kwara state, North Central Nigeria, Yunus Olarenwaju says he is fully in support of the school’s action.\nIn the viral video, some students reported to be seniors are seen flogging a female student brutally.\nThe seniors also flogged three boys for attending a birthday party in a bar which the madrasah said is against its rules and regulations.\nMeanwhile, the state government had suspended the head of the school and set up an investigative committee to probe the incident.\n“I informed the school about the incident and I personally requested that they should give her the appropriate punishment."
  },
  {
    "headline": "Lagos court makes Order on conduct of funeral rites of Ndubuisi Kanu -",
    "summarized_story": "One of the two wives of the deceased, Gladys, had dragged other members of the Kanu family and the Nigerian Navy to court over how his funeral rites should be conducted.\nKanu died in Lagos on January 13 at the age of 77 as a result of COVID-19 complications.\nThe respondents to the suit are; Kelly Kanu, the Nigerian Navy, Simone Abiona(Nee Kanu), Andrey Joe- Ezigbo (nee Kanu), Paul Ndidiamaka Kanu and Karen Johnson (Nee Kanu).\nOthers are Jeffery Kanu, Laura Kanu, Stephen Kanu and Josephine Ndubuisi-Kanu (wife).\nJustice Balogun said the body will then be moved to Abia for a full state burial."
  },
  {
    "headline": "Reps set to begin debate on general principles of 2022 Appropriation bill -",
    "summarized_story": "The House of Representatives is set to commence debates on the general principles of the 16.39 trillion Naira 2022 Appropriation Bill.\nPresident Muhammadu Buhari last Thursday laid the budget estimates before a joint sitting of the two chambers of the National Assembly last Thursday.\nDebate on the spending plan is seen in the Notice Paper released by the House on Monday.\nLawmakers are expected to critique the financial document after which it is sent to the Appropriation committee with other relevant committees for further legislative action.\nOther committees of the House will interface with MDAs under their purview as sub committees and will turn in their reports to the Appropriation committee as sub committees."
  },
  {
    "headline": "Six girls escape from terrorists’ camp with nine children, one pregnant -",
    "summarized_story": "Borno state governor Babagana Zulum on has received nine girls with one of them pregnant of about 8 months after they were abducted on 3rd of October 2020 at various locations by suspected Boko Haram terrorists.\nPresenting the escaped girls who were aged between 20 and 25 years old, the Commissioner for Women Affairs Zuwaira Gambo told the governor that the girls ran away from Boko Haram custody at Buni Yadi axis of Yobe state and trekked through the sambisa forest for about six hours before they were rescued by security operatives.\nThree among the girls who were abducted at Takulashu village of Chibok are Maryam Ishaya with one child, Racheal Simon with two children and Esther Ayuba with two children, while Alheri Ezekiel has two children, Victoria Andrew and Victoria James also with two children were abducted from Cofure village, Hong town in Adamawa state.\nGovernor Babagana Zulum on his part notes that government is doing everything possible to ensure speedy reconstruction and reintegration of all victims of Boko Haram terrorists into the society."
  },
  {
    "headline": "Report: Damning Discoveries in Peju Ugboma Hearing",
    "summarized_story": "The Coroner’s Inquest into the death of 41-year-old pastry chef Peju Ugboma has continued in Lagos with damning discoveries.\nFor the first time, the pathologist who conducted her post mortem has testified- calling certain findings during the examination of the deceased, abnormal and preventable.\nWith an update, Arise Correspondent Adefemi Akinsanya reports."
  },
  {
    "headline": "Cornered by African Youth, Macron Intends to Repair FrancAfrique",
    "summarized_story": "Cheikh Fall did not hold back last week when he saw French President Emmanuel Macron during a plenary session of a France-Africa conference.\nCornered by candid criticism, Macron promised an honest assessment of the colonial past.\nAs long as those remain the pillars of France’s African policy, then nothing else matters very much,” Powell said.\nFrance is inventing its African civil society and co-opting its own African intellectuals in order to give the illusion of change,” Sylla told Al Jazeera.\nNonetheless, Fall is hopeful the event will help forge healthier relations between France and African countries."
  },
  {
    "headline": "North Korea’s Kim Says US, South Korea Threaten Peace with Arms Buildup",
    "summarized_story": "North Korean leader Kim Jong Un has said his country’s weapons development is necessary in the face of ‘hostile’ policies from the United States and a military buildup in South Korea that is destabilising the peninsula, state media reported.\nSouth Korea recently test fired its first submarine-launched ballistic missile, and plans to build major new weapons include aircraft carriers.\nNorth Korea has pushed ahead with its missile programme, and analysts say it has begun a major expansion of its main nuclear reactor, used to produce fuel for nuclear bombs.\n“The United States’ assertion that it holds no hostile feelings towards North Korea are hard to believe in the face of its continued “wrong judgements and actions,” Kim said, without elaborating.\n“Under the absurd pretext of suppressing our threats, South Korea has openly expressed its desire to gain an edge over us in military power on various occasions.”"
  },
  {
    "headline": "‘Unprecedented’ Hunger in Lebanon as Fuel Crisis Hikes Food Costs",
    "summarized_story": "Things have become much worse with the fuel crisis over the summer.”The small shop is located in the heart of Beirut’s semi-industrial Karantina neighbourhood, a stone’s throw away from the destroyed port.\nHe says customers visit less often and buy less than they once did, because food has become expensive [Kareem Chehayeb/Al Jazeera]Lebanon’s food crisis is not a recent development.\nHowever, the food crisis has significantly worsened in recent months amid fuel shortages and price rises.\n“Fuel and gasoline prices are continuing to increase, so we anticipate that food prices will continue to go up,” World Food Programme spokesperson Rasha Abou Dargham told Al Jazeera.\nAfter the fuel crisis worsened, they now support one in every four people in Lebanon."
  },
  {
    "headline": "Ethiopia Army Launches Major Attack on Tigray, Rebels Say",
    "summarized_story": "Ethiopia’s national army launched a ground offensive against forces from the northern region of Tigray on Monday, the war-torn region’s governing Tigray People’s Liberation Front (TPLF) said.\nTPLF spokesperson Getachew Reda said the army – alongside allied forces from the northern Amhara region – began the attack to push Tigrayan forces out of Amhara in the morning.\n“The government of Ethiopia will continue to counter the TPLF’s destruction, violence and killings in the Amhara region and elsewhere,” she added, without elaborating.\nAmhara and Tigray have a decades-long dispute over territory after Tigray enlarged its borders a quarter of a century ago to include fertile farmlands also claimed by the Amhara region.\nIn June, Tigrayan forces took back control of most of Tigray, forcing the national military to withdraw."
  }
]