[
  {
    "headline": "Electoral bill bars INEC from registering new parties for 2023 polls",
    "summarized_story": "), assent to the reworked Electoral Act 2010 (Amendment) Bill presently on his table, the Independent National Electoral Commission will be barred from receiving applications for registration of more political parties to participate in the 2023 general elections.\nThe number of political parties in the country dropped to 18 when INEC deregistered the political parties.\nCurrently, there are 18 political parties in the country.\nINEC had on February 6, 2020, deregistered 74 political parties due to their poor performance in the 2019 general elections and the re-run elections that followed.\nDuring the 2019 general elections, 91 political parties participated in the exercise, while an additional party, Boot Party, was registered based on the order of a court after the election."
  },
  {
    "headline": "Katsina police kill five terrorists, say hoodlums using new tactics",
    "summarized_story": "The Katsina Police Command on Friday raised the alarm that terrorists operating in the state were now using vehicles for operation as against their former style of using motorcycles.\nHe said the terrorists had around 1am of the same day attacked the two villages where they rustled 81 cows, 54 sheep and one donkey.\nThe operatives also recovered a white Golf ‘3’ car with registration number: Katsina: BKR 367 XA from the terrorists.\nThe recovered vehicle was displayed during the parade of the suspects at the Katsina police headquarters on Friday.\nIsah declare, “From our recent encounters with terrorists, we discovered that they (the terrorists) have changed their modus operandi."
  },
  {
    "headline": "Corps members to enjoy insurance cover as NYSC unveils NHIS",
    "summarized_story": "The National Youth Service Corps on Friday unveiled the enrolment of corps members into the National Health Insurance Scheme under the NYSC Group Individual Family Social Health Insurance Programme.\nThe organisation said the health initiative had been designed as a holistic health insurance scheme, covering the periods of pre-orientation.\nThe NYSC said six Health Maintenance Organisations had been selected from each of the six geopolitical zones to drive the process and ensure effective implementation of the NHIS.\nThe NYSC urged corps members to register under Health Care Practitioners in their localities.\nHe said the loss of any corps member provoked sadness in the NYSC, saying it leaves the scheme “highly diminished.”Copyright PUNCH."
  },
  {
    "headline": "2023 presidency: Group drums support for Adesina",
    "summarized_story": "“The group stressed further that Adesina “Will manage Nigeria’s multi-lingual, cultural and religious diversity very well.\nUnder his leadership, the African Development Bank was ranked in 2021 as the 4th most transparent institution in the world.\n“Also, under his leadership, the African Development Bank was ranked in 2021 as the Best Multilateral Financial Institution in the world.\nAfrica and the world trust Dr. Adesina.\n“Dr. Adesina the group noted speaks French fluently and has worked for decades in French-speaking countries, which will greatly enhance regional cooperation, integration, peace and security in Africa."
  },
  {
    "headline": "FCT Elections: CSOs urge EFCC, ICPC to arrest vote buyers",
    "summarized_story": "“Situation Room also expects a much improvement on the logistics for this election considering this is a smaller terrain and population.\nThe CSOs urge all security agencies deployed on election duty to adhere to abide by the code of conduct and rules of engagement for security personnel on election day.\nMeanwhile, the group said it was concerned about the poor level of inclusion of women in the elections.\n“In general, of the 475 candidates nominated by the 14 political parties participating in the 2022 FCT Area Council Elections, just 41 candidates comprised of three Chairmanship candidates, 8 Vice Chairmanship candidates and 30 Councillorship candidates are female.\n“Situation Room notes that there is a Person With Disability, PWD, Councillorship candidate in Karu Ward of AMAC."
  },
  {
    "headline": "CSO commends Nigerian army, says decisive offensives against terrorists yielding results",
    "summarized_story": "In Niger state, NAF airstrikes and military gunships destroyed bandits’ camps, eliminating over 37 bandits including their leaders.\nThe Northern Youth Network profoundly appreciates the Nigerian military and particularly the Chief of Air Staff, Marshal, Isiaka Oladayo Amao.\nWe celebrate the soldiers for taking the war to the enclaves of the terrorists”, the statement noted.\n“We rise to commend the Nigerian military.\nWe deeply commend the Nigerian Army and the Airforce for such proactive and result oriented tactics to the war against insurgency and banditry”, the statement added."
  },
  {
    "headline": "Bishop Onuoha seeks common ground between FG, ASUU to avert strike",
    "summarized_story": "By Luminous Jannamike, ABUJAThe Co-chair, Interfaith Dialogue Forum for Peace, IDPF, Bishop Dr. Sunday Ndukwo Onuoha, on Thursday called on the Federal Government and the Academic Staff Union of Nigerian Universities, ASUU, to avert an impending industrial action by arriving at a common ground in the interest of students avert industrial action.\nOnuoha said another strike coming on the heels of the year 2020 paralysis of the country’s universities owing to an impasse in negotiations would leave behind dire consequences for the students and also not augur well for education in the country.\nASUU had threatened to resume the industrial action it suspended 13 months ago over the Federal Government’s alleged failure to honour many of the agreements it signed with the lecturers.\nAlso Read:ASUU sensitises students on planned strikeThe Methodist Bishop, in a terse statement titled, ‘For the Sake of Posterity and our Children, Please Avert ASUU Strike,’ said: “Embarking on another strike at this point, is an ill-wind that will not blow the Nigerian children, their parents and guardians any good.\n“The interest of the teeming students about to graduate and those waiting to gain admission should take pre-eminence in their quests to resolve all contentious issues,” he added."
  },
  {
    "headline": "Fuel scarcity: NYCN commends NNPC for proactive measures to mitigate challenge",
    "summarized_story": "…Urges Compensation for Damaged CarsThe National Youth Council of Nigeria (NYCN) has commended the Nigerian National Petroleum Company (NNPC) on its handling of the scarcity of the petrol motor spirit (PMS) experienced across Nigeria in recent times.\nThe NNPC had revealed that the scarcity was occasioned by the importation of adulterated fuel by suppliers.\n“In particular, we commend the transparency and full disclosure adopted by Nigerian National Petroleum Company Ltd. under the leadership of Mallam Mele Kyari in getting to the root of the problem.\n“Without doubt, the decision of NNPC to order the quarantine of all unevacuated volumes of the contaminated fuel saved the nation from a monumental scandal.\n“We hereby call on the government to compensate Nigerians whose vehicle engines were damaged by the methanol blended fuel."
  },
  {
    "headline": "Imo College of Education workers protest, demand removal of provost",
    "summarized_story": "Academic and Non-Academic staff of the Imo State College of Education, Ihitte Uboma Local Government Area of Imo State, have staged a peaceful protest, demanding the removal of the College Provost, Boniface Ashiegbu.\nThe protesters, who displayed placards with various inscriptions, stormed the state secretariat office of the Imo State Commissioner for Education, in Owerri, to register their grievances.\nSpeaking with journalists, the Public Relations Officer (PRO) of the College Kingsley Anyiam, who led the protest, said their demand for the removal of Ashiegbu was informed by his lack of requisite qualifications to be the provost.\nAccording to him, “One of the reasons the school has not been accredited since inception, having churned out graduates, who left the school without authentic certificates, is because he lacks requisite qualifications to be the provost.\nHe also said that there is light and water in the students’ hostel."
  },
  {
    "headline": "Police recover 200 cows, 70 sheep, motorcycle from bandits in Katsina",
    "summarized_story": "The police in Katsina State said they rescued over 200 cows, 70 sheep and ceased a motorcycle from terrorists, who attacked Nasarawa-Bugaje community of the state, Friday evening.\nThis was disclosed in a statement forwarded to DAILY POST by the Police Public Relations Officer in the state, SP Gambo Isah.\nAccording to SP Gambo, the terrorists who were well armed with sophisticated weapons, stormed the community in large number, shooting sporadically into the air and rustled their domestic animals in the process.\nOn receiving the report of the attack, SP Gambo said “the command quickly dispatched police patrol teams to the scene who engaged the hoodlums in a fierce gun duel.”He further stated that “the recovered 200 rustled cows and 70 sheep was due to the operational strategy and skills adopted by the gallant policemen that made them to over power the terrorists.”Gambo also revealed that “many of the terrorists escaped the scene with gun wounds and abandoned one of their operational motorcycle.”“The police patrol teams are presently scanning the scene with a view to arresting the fleeing terrorists and recover their operational weapons,” SP Gambo said."
  },
  {
    "headline": "Biafra: DSS violating court order, refuses Nnamdi Kanu from changing clothes – Lawyer",
    "summarized_story": "Ifeanyi Ejiofor, counsel to Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, on Friday, alleged that the Department of State Services, DSS, has refused the Biafra agitator from changing his clothes.\nEjiofor alleged that DSS refused Kanu from changing his clothes despite a court order to that effect.\nHe insisted that the DSS refusal was a violation of the subsisting court order.\nRecall that Justice Binta Nyako of an Abuja Federal High Court had ordered the secret police to allow Kanu to change his clothes.\nThe judge had said she was tired of seeing the IPOB leader in the same clothes during court proceedings."
  },
  {
    "headline": "Only God gives genuine wealth – Christian leaders caution youths",
    "summarized_story": "The Christian Association of Nigeria (CAN) has urged Nigerian youths to focus on hard work and creativity.\nAbraham Nwali, spoke at an event organized by the Youth Wing Christian Association of Nigeria (YOWICAN).\nMwali told them to exercise patience, work hard and put God first in all they do.\nThe cleric added that in the fullness of time, God rewards hard work, innovation and perseverance.\n“All tiers of government should prioritize employment and skill acquisition provisions for youths,” Nwali added."
  },
  {
    "headline": "Bullion van attack: Review security apparatus in Oyo – Muslim students tell Makinde",
    "summarized_story": "The Muslim Students’ Society of Nigeria (MSSN) has advised Governor Seyi Makinde of Oyo State, to as a matter of urgency, review the security apparatus of the state.\nMSSN Oyo State area unit, while reacting, advised Makinde to immediately review the security apparatus of the state.\nAl’yakeen then urged Makinde to immediately review the security apparatus of the state to forestall future occurrences.\nHe said, “We urge the government to review the security apparatus of the state to forestall future occurrences.\nforgive Mubarak Sulaiman and count him among the inmates of paradise.”"
  },
  {
    "headline": "Why we are constructing flyovers, by Wike",
    "summarized_story": "Rivers Governor Nyesom Wike has explained the construction of 10 flyovers in Port Harcourt and Obio-Akpor local government areas by his administration is aimed at addressing the chaotic traffic situation experienced in the state capital.\nWike spoke shortly after inspecting the progress of work on the Oroabali flyover in Port Harcourt on Friday.\nHe said his administration decided to adopt construction of flyovers as traffic congestion reduction mechanism following the adverse effect of traffic on economic activities.\nLook at how it (Oroabali flyover) has transformed the entire area.\nWike disclosed that Julius Berger, which is constructing the flyovers, had promised to deliver the projects to the state government by the end of this month."
  },
  {
    "headline": "Why I took Kaduna-Abuja train back home, by Aisha Buhari",
    "summarized_story": "The First Lady Hajia Aisha Buhari has explained why she decided to travel back to Abuja on Thursday by train rather than following the routine flight back.\nRead Also: Aisha Buhari visits Ganduje, Hanifa’s parents in Kano- Advertisement -“Actually, it’s to appreciate the beautiful works the President and this administration has done, in terms of infrastructure, so she decided to take advantage of the Kaduna-Abuja rail.\n“The idea is to depict to the public that train is safe and efficient mode of transportation, because if the First Lady can ride it, it means it is safe for anybody.\n“Besides that, it is meant show that she’s proud of what the administration is doing, proud of her husband’s achievements in the area of infrastructure.\n“The whole idea was just to experience the trip on the train, interact with ordinary Nigerians who would not have had access to her on a normal day, encourage them, a form of inspiring the people,” Abdullahi said."
  },
  {
    "headline": "UPDATED: Supreme Court declares Executive Order 10 unconstitutional",
    "summarized_story": "The Supreme Court has declared as unlawful and unconstitutional the Executive Order 10 (EO10) issued by President Muhammadu Buhari on the funding of State Judiciary and Legislature.\nIn a split decision on Friday, majority of the Court’s seven-member panel agreed that the President exceeded his constitutional powers in issuing the EO10.\n“The President has overstepped the limit of his constitutional powers by issuing the Executive Order 10.\nThe apex court said the plaintiffs failed to prove their entitlement to the refund they claimed.\nJustice Muhammad’s judgment was read by Justice Nweze, while Justice Agim read the judgment by Justice Eko."
  },
  {
    "headline": "Rivers receives N2bn from CBN’s investment funds",
    "summarized_story": "The Rivers State Government has received N2bn from the healthcare Intervention Funds of the Central Bank of Nigeria (CBN).\nHe said: “Council was briefed on the earlier approved CBN Healthcare Intervention Fund wherein approval was granted that the Rivers State Government access the CBN N2.5bn Healthcare Intervention Fund to the effect that the amount actually released by CBN is N2bn not N2.5bn as requested.\n“And so, council had approved that all those undeveloped plots and uncompleted buildings in Old GRA and New GRA be acquired.\nNwobueze said the council also approved that the acquired plots should be reallocated to indigenes of Rivers State and other residents capable of developing them within a timeline of 12 months.\nAnd that the funds invested by the Rivers State Government in reconstructing this 7 floors building can be recouped from the sale of this property."
  },
  {
    "headline": "DCP Abba Kyari: PSC puts verdict on hold, orders further investigation",
    "summarized_story": "The Police Service Commission (PSC) has postponed the verdict on the case involving suspended Deputy Commissioner of Police (DCP) Abba Kyari, who was in charge of the Inspector General of Police Intelligence Response Team (IRT).\nThe Report had been forwarded to the Attorney General of the Federation and Minister of Justice for legal advice by the Inspector General of Police.\nNot satisfied by the earlier report, PSC also directed that further necessary investigation should: “take half the time it took the Police to conduct the original investigation”, and that the investigation should be carried out by a different panel.\n- Advertisement -PSC also considered 20 Pending Disciplinary Matters and five appeals and petitions from the Inspector General of Police as well as aggrieved serving and ex-Police Officers.\nIt directed the Inspector General of Police to implement its decision as it affects the Officer without delay."
  },
  {
    "headline": "Abba Kyari: PSC gives police 2 weeks to conclude investigation",
    "summarized_story": "Molly Kilete, AbujaThe Police Service Commission(PSC), has given the Nigerian police force two weeks to conclude its investigation on the case involving the former commander of the Intelligence Response Team, Deputy Commissioner of Police, Abba Kyari.\nThe commission has also directed that the investigation should be carried out by a different panel and that it should take half the time it took the Police to conduct the original investigation.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nA report by the Federal Bureau of Investigation of the United States of America had indicted the erstwhile super cop in the case of fraud involving Instagram celebrity, Ramon Abbas, also known as Hushpuppi.\nThe report was investigated by a special panel set up by the IGP Usman Alkali, who also forwarded it to the Attorney General of the Federation and Minister of Justice, Abubakar Malami, for legal advice."
  },
  {
    "headline": "Breaking: Judicial Autonomy: Supreme Court declares Buhari’s Executive Order 10 unconstitutional",
    "summarized_story": "From Godwin Tsa, AbujaThe Supreme Court in a split decision of six out of seven Justices, declared as unlawful and unconstitutional the Executive Order 10 (EO10) issued by President Muhammadu Buhari on the funding of State Judiciary and Legislature.\nThe majority judgment declared that the President exceeded his constitutional powers in issuing the EO10.\nAccording to the seven members of the panel, it was not the responsibility of the Federal Government to fund the capital and recurrent expenditures of the superior courts created for States under Section six of the Constitution.\nMeanwhile, all the seven members agreed that the States were not entitled to be refunded all they have spent before now to maintain those courts.\nThe judgment was on the suit filed by the 36 States against the FG on the funding of the Judiciary and the constitutionality of the EO10"
  },
  {
    "headline": "Electoral bill: Buhari in dilemma, consults Malami, others",
    "summarized_story": "Meanwhile, the Transition Monitoring Group, (TMG), National Consultative Front (NCFront) and Middle Belt Forum (MBF), yesterday, expressed worry over President Buhari’s delay to assent to the Electoral Act Amendment Bill.\nHe said: “President Buhari is just telling us that he doesn’t care about the country and doesn’t care about anybody.\nAlso, the House of Representatives has said that there was no selfish interest in the Electoral Act Amendment Bill passed by the National Assembly, recently.\nHe said the National Assembly will not lobby the Presidency to assent to the electoral act amendment bill, as that would amount to interfering with the function of the executive.\nThat they want the electoral act amendment bill, as submitted, having incorporated the direct, indirect and consensus."
  },
  {
    "headline": "Importers of bad fuel must face the law – Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari, yesterday, ordered that those responsible for the importation and distribution of the off-spec petrol into the country must be held accountable.\nThe president stated this in a statement by his Senior Special Assistant on Media and Publicity, Garba Shehu.\nHe said those involved must “be held accountable for substandard services and or products sold by them.”100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nClick Here Now .\n“The president directed that in line with the law, service providers must make full disclosure of relevant information with respect to the consumption of their products and that dissatisfied consumers are entitled to a proper redress of their complaints.”"
  },
  {
    "headline": "2023: Northerners want presidency zoned to South, says Middle Belt Forum",
    "summarized_story": "By Chinelo ObogoMiddle Belt Forum (MBF) has claimed that despite opposition from prominent groups like the Arewa Consultative Forum (ACF) and Northern Elders’ Forum (NEF), many northerners are in support of zoning the presidency to the South in 2023.\nSpeaking on Arise TV, MBF National President, Bitrus Pogu, said despite eight years of northern presidency, insecurity persists and bandits are still unleashing mayhem on many states.\nThose of us in the Middle Belt see the northern presidency now as one which is full of sentiments and nepotism and with people who call the insurgents, ‘our boys’, rather than regard them as a menace.\n“Those of us who are advocating the presidency to move to the South feel we have had eight years of northern presidency and it has not augured well for Nigeria.\nWe need a southern president who will deal with the bandit problem as a Nigerian problem and not as ‘our boys’ problem,” he said."
  },
  {
    "headline": "Buhari Talks Tough, Says Suppliers of Substandard Fuel would be Held Accountable",
    "summarized_story": "The withdrawal of the fuel is behind the recent petrol scarcity that has caused long fuel queues in some towns and cities across Nigeria.\nIn a statement by his spokesman, Mallam Garba Shehu, Buhari said the protection of consumer interests was the priority of his administration.\nThe consortium stated that NNPC was aware of the refusal of Brittania-U to cooperate with other members by way of making information available when needed.\nFurther, the consortium stated that Brittania-U vehemently refused to execute the Consortium Agreement with the other consortium members – Emadeb/Hyde/Ay Maikifi- saying it became surprising and frustrating to everyone.\n“Based on the substantial evidence provided to NNPC and several declarations by Brittania-U to NNPC, Brittania-U is therefore solely liable for the supply of the PMS via MT Torm Hilde."
  },
  {
    "headline": "IMF: Nigeria’s Debt Sustainability at Risk, Cause for Concern",
    "summarized_story": "Nume EkegheThe International Monetary Fund (IMF) has said Nigeria’s debt sustainability is at risk and causes a great deal of concern and unease in the long-term.\nRahman noted that the increase in public debt had grown rapidly in 10 years and was approaching a time when the country would spend all its income on servicing debts.\nRahman explained, “But what we should remember here and the things that make Nigeria’s debt sustainability at risk are the following: we have seen a rapid rise in public debt in the last 10 years or so and this is being driven by fiscal deficits.\nAnd there are a couple of other points that we should remember; which is that Nigeria’s debt carrying capacity is very low.\nSo that makes Nigeria quite vulnerable.”Rahman said going forward, IMF projected for Nigeria a continuous increase in public debt."
  },
  {
    "headline": "CBN Eyes $200bn from Fresh Non-oil Export Initiative",
    "summarized_story": "He added that the initiative was a product of consultation with the banking community.\nHe, however, explained that the new non-oil export initiative would have five key anchors namely value-adding exports facility; Non-oil commodities’ expansion facility; Non-oil FX rebate scheme; Dedicated non-oil export terminal as well as Biannual non-oil export summit.\n“Fund people who want to generate export proceeds, when those export proceeds come, we would fund them at five per cent for you and they would earn rebate and that’s how we can help you.\n“Then, when these proceeds come, sell them to your customers that want $100 million or $200 million.\nThat you will continue to come to central bank to give you dollar, we would stop it."
  },
  {
    "headline": "2022 Committee Mobilising Nigerians for Quality Leadership",
    "summarized_story": "•Building consensus for country’s rebirthEmmanuel AddehThe 2022 Committee has resolved to mobilise Nigerians across party lines and social strata for quality leadership of the country at all levels as the elections to choose new leaders in 2023 draw near.\nThe meeting, which held from February 4 to 6 under the aegis of “The 2022 Committee”, the conveners pointed out, remained non- partisan.\nThey said the retreat to chart a new consensus for national rebirth was attended by 14 incumbent governors, 13 former governors, and three former senate presidents.\n“The 2022 Committee” conveners stated, “Whilst the 2022 committee is interested in the quality of leadership that will emerge in Nigeria at all levels, we consider attempts to link the committee with candidates or political parties for the 2023 elections as an unwarranted and unnecessary distraction.\nBut the coordinators of the meeting stated that although all the 100 leading lights of the 2022 committee had the capacity for national leadership, it should not be linked to the politics of 2023."
  },
  {
    "headline": "Adulterated Fuel: Kyari Names MRS, Emadeb-consortium, Oando, Duke Oil as Culprits",
    "summarized_story": "But the NNPC GMD’s explanation ran contrary to an earlier press statement released by MRS, where the company denied culpability.\nThe petroleum products delivered are usually equivalent in value to the crude oil received from NNPC subject to the general terms and conditions as advised.\nAccording to him, as soon as the vessels complete discharging and start pushing products to oil marketers, the fuel queues in Lagos should fully disappear by Friday.\nOther attendees at the meeting included top officials of NNPC, Major Oil Marketers Association of Nigeria (MOMAN), and members of the Depots and Petroleum Products Marketers Association of Nigeria (DAPPMAN).\nNARTO had threatened to stop haulage of petroleum products across the country over the hike in the price of diesel to N430 per litre and other operational challenges."
  },
  {
    "headline": "EXCLUSIVE: Community Residents In South-East Nigeria, Others Desert Homes Over Rise In Ritual Killings",
    "summarized_story": "\"I moved away from the community more than one week ago over the rise in mysterious deaths and mutilated bodies.\n\"Ritual killings subsided here a bit some time ago but it appears the evil has returned.\nA community leader in the area, Ezekiel Mba, told SaharaReporters that they were worried about the situation, adding that ritual killers were wreaking havoc around Isiala-Ngwa.\nThe son named Afeez Olalere disclosed that his mother encouraged him to kill his younger sibling for a money ritual.\nOn Wednesday, the House of Representatives called for the declaration of a national emergency of the rising cases of ritual killings across Nigeria."
  },
  {
    "headline": "EXCLUSIVE: Community Residents In South-East Nigeria, Others Desert Homes Over Rise In Ritual Killings",
    "summarized_story": "\"I moved away from the community more than one week ago over the rise in mysterious deaths and mutilated bodies.\n\"Ritual killings subsided here a bit some time ago but it appears the evil has returned.\nA community leader in the area, Ezekiel Mba, told SaharaReporters that they were worried about the situation, adding that ritual killers were wreaking havoc around Isiala-Ngwa.\nThe son named Afeez Olalere disclosed that his mother encouraged him to kill his younger sibling for a money ritual.\nOn Wednesday, the House of Representatives called for the declaration of a national emergency of the rising cases of ritual killings across Nigeria."
  },
  {
    "headline": "Bandits Ask Katsina Community To Contribute N30 Million As Compensation Over Death Of Leader Killed By Military Jet",
    "summarized_story": "Residents of Tashar Biri Village in Yatumaki of Dan Musa Local Government Area have been asked by bandits to pay N30 million or risk ferocious attacks.\nAirstrikes executed recently by the Nigerian Air Force (NAF) aircraft in Katsina State killed Dankarami.\nIt was gathered that he met his waterloo when he visited one Sabira, a teenage girl he had forcibly married in Tashar Biri village.\nFollowing his death, his boys demanded that the community must provide Sabira and her mother and pay N30 million, or risk being attacked.\nMost residents have fled the village after they got a hint that the leader of the bandits, one Mai Lore, would raid the community and kill everyone."
  },
  {
    "headline": "Bandits Ask Katsina Community To Contribute N30 Million As Compensation Over Death Of Leader Killed By Military Jet",
    "summarized_story": "Residents of Tashar Biri Village in Yatumaki of Dan Musa Local Government Area have been asked by bandits to pay N30 million or risk ferocious attacks.\nAirstrikes executed recently by the Nigerian Air Force (NAF) aircraft in Katsina State killed Dankarami.\nIt was gathered that he met his waterloo when he visited one Sabira, a teenage girl he had forcibly married in Tashar Biri village.\nFollowing his death, his boys demanded that the community must provide Sabira and her mother and pay N30 million, or risk being attacked.\nMost residents have fled the village after they got a hint that the leader of the bandits, one Mai Lore, would raid the community and kill everyone."
  },
  {
    "headline": "Trump, flushed presidential papers and Maggie. By Chido Nwangwu",
    "summarized_story": "The United States of America and many other intelligent and properly focused countries keep and learn from the presidential records of those who led the country.\nIn fact, there is a law, the Presidential Records Act, which assigned an independent agency the task of keeping these documents.\nIt is called the National Archives and Records Administration.\nThe Republican Ronald Reagan presidency (1981 to 1989) became the first presidency to deal with the protocols, requests and transmission of such information to the National Archives.\nIn January 2022, the National Archives and Records Administration retrieved 15 boxes of documents and relevant items from Trump’s Mar-a-Lago home."
  },
  {
    "headline": "Oil price rises to $95 a barrel amid Russia-Ukraine tensions",
    "summarized_story": "Brent crude oil rose to $95 a barrel for the first time since October 2014 amid rising tensions between Russia and Ukraine.\nBrent crude futures, the global oil benchmark, climbed 3.9 percent to $95.1 a barrel, while West Texas Intermediate (WTI) crude futures increased 4.4 percent to $93.79.\nThe US and the United Kingdom have urged their citizens to leave Ukraine over Russian invasion fears.\nAdvertisementThe rise in global crude oil prices should portend an upturn for Nigeria’s revenue — but subsidy payments shortchanged the government.\nIn December 2021, subsidy payment gulped N270 billion, amounting to N1.43 trillion in annual expense, shrinking revenue accrued to the federation account."
  },
  {
    "headline": "Oil price rises to $95 a barrel amid Russia-Ukraine tensions",
    "summarized_story": "Brent crude oil rose to $95 a barrel for the first time since October 2014 amid rising tensions between Russia and Ukraine.\nBrent crude futures, the global oil benchmark, climbed 3.9 percent to $95.1 a barrel, while West Texas Intermediate (WTI) crude futures increased 4.4 percent to $93.79.\nThe US and the United Kingdom have urged their citizens to leave Ukraine over Russian invasion fears.\nAdvertisementThe rise in global crude oil prices should portend an upturn for Nigeria’s revenue — but subsidy payments shortchanged the government.\nIn December 2021, subsidy payment gulped N270 billion, amounting to N1.43 trillion in annual expense, shrinking revenue accrued to the federation account."
  },
  {
    "headline": "D’Tigress beat France to keep World Cup qualifying hopes alive",
    "summarized_story": "Nigeria’s D’Tigress came from behind to beat France 67-65 in their second game at the FIBA Women’s World Cup qualifiers in Belgrade, Serbia, on Friday.\nThe Nigerians suffered early jitters against the team ranked the fifth-best in the world, as they lost the first quarter by 28-11.\nD’Tigress, however, woke up from the slumber with the realisation that another loss will further complicate their fight for a place in the World Cup.\nThe comeback was completed in the final quarter as the D’Tigress won the game with a two-point margin.\nAdvertisementThe victory means the Nigerian team now has one foot at the World Cup in Australia."
  },
  {
    "headline": "D’Tigress beat France to keep World Cup qualifying hopes alive",
    "summarized_story": "Nigeria’s D’Tigress came from behind to beat France 67-65 in their second game at the FIBA Women’s World Cup qualifiers in Belgrade, Serbia, on Friday.\nThe Nigerians suffered early jitters against the team ranked the fifth-best in the world, as they lost the first quarter by 28-11.\nD’Tigress, however, woke up from the slumber with the realisation that another loss will further complicate their fight for a place in the World Cup.\nThe comeback was completed in the final quarter as the D’Tigress won the game with a two-point margin.\nAdvertisementThe victory means the Nigerian team now has one foot at the World Cup in Australia."
  },
  {
    "headline": "Lagos probes teacher for ‘brutalising 2-year-old pupil who couldn’t recite English alphabet’",
    "summarized_story": "The Lagos state government says it has commenced investigation into the case of a two-year-old pupil allegedly brutalised by her teacher.\nThe fashion designer claimed when his sister — who is the mother of the pupil — confronted the teacher, she was told that her daughter was not the only one given such treatment.\nAdvertisementAccording to him, the teacher told his sister that other pupils were also given 24 strokes of cane each.\n“This is my two-year-old niece that was flogged mercilessly because she couldn’t recite the English alphabet,” he wrote in the post accompanied by a photo of his niece.\n“My sister also told me that one of her child came back the other day bleeding from the nose."
  },
  {
    "headline": "11 African startups to watch out for in 2022",
    "summarized_story": "About 20 startups are currently listed on its platform and over $400,000 has been invested on the platform.\nThe startup creates a reliable portal to guide African students in their tertiary education, course selection, and career decisions.\nThe startup handles everything it takes for a business to launch in a new African country.\nWe think this startup is building a game-changing product; something that will have a significant impact on the growth of African startups.\nWe know you have some startups you are rooting for this year that we might have missed."
  },
  {
    "headline": "Nigerian bourse wants to attract tech IPOs with new listing rules",
    "summarized_story": "Nigeria has set in motion what could herald a new dawn for African tech startups as it moots the adoption of new listing rules to encourage tech companies to go public.\nOlumide Bolumole, division head of stock exchange listing activities at NXG revealed that the bourse will make sweeping changes to make listing attractive to tech companies.\nNGX consists of a holding company and three subsidiaries that cover the operations of the Nigerian Stock Exchange (NSE), its regulation, and its real estate.\nThis structure is similar to those of other international market groups such as the London, New York, and Johannesburg stock exchange groups.\nIn recent decades, Nigeria’s stock market capitalisation has fallen well below potential."
  },
  {
    "headline": "TechCabal’s Valentine’s Gift Guide",
    "summarized_story": "Price range: > $99We’ve labelled this a Series C-type gift because it’s a long-term investment beneficial to all involved.\nPrice range: $2 – $4 (for Individual plans)We’re labelling this a seed-type gift because, any way you dice it, you’re sowing seeds.\nWell, here’s how you can someday build up to that: get them video streaming subscriptions for Valentine’s Day.\nLog on to your MTN, Safaricom, Airtel, or Ethio Telecom services and gift your loved one gigabytes of data.\nFor Valentine’s, add to your loved one’s crypto stash and help them build their way into digital wealth."
  },
  {
    "headline": "This developer transitioned to blockchain development in order to solve Web2 problems",
    "summarized_story": "Akinyemi Akindele, 27, studied computer science at the University of Ibadan, where he trained as a Web2 software developer.\nEventually, he got to build a blockchain supply chain solution with his team, the first of its kind in the country, he said.\nAfter two years at Binance, Akindele joined EMTECH, a US blockchain company that builds digital currency for central banks across the world.\nBreaking into blockchain developmentAnother idea that endeared Akindele to blockchain engineering was that the blockchain was a melting point for a lot of things.\nHe also advised them to contribute to open source blockchain projects and look for ways to solve the problems that exist today in Web2 with Web3."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Today does not seem to be that day of the week where many African startups take over the news with several huge..."
  },
  {
    "headline": "Is it possible to reduce or eradicate fraud in Africa?",
    "summarized_story": "To fight this, the company which claims to specialise in fighting fraud in Africa has recently raised a €20 million (~$23m) Series A to help them improve their game in fighting fraud.\nYes, you read that correctly; over $12 million will be invested in combating mobile fraud in Africa.\nWhile I’m interested in how the company intends to accomplish this, there’s also an indigenous company in Nigeria, Stellas digital bank planning to combat fraud.\nSide bar: Is it possible that the rise of startups focused on combating fraud will help achieve its purpose in Africa?\nTo know how, please, read: Stellas digital bank launches, plans to fix major loophole for fintech fraud in Nigeria."
  },
  {
    "headline": "Stellas digital bank launches with ‘Ghost Mode’ to fix major fintech fraud loophole in Nigeria",
    "summarized_story": "However, fraud remains the bane of both digital banks, and traditional banks alike.\nFor the newly launched Stellas digital bank, it plans to guard against one major loophole.\nToday, the company is launching a digital bank to “offer banking services with ease”.\nBasically, Stellas plans to protect user identities when making transactions, to guard against identity theft and ensure privacy and security.\nIn a space graced by the likes of Kuda, Sparkle, Fairmoney, and Carbon, Nigeria’s digital banking space look set to be exciting."
  },
  {
    "headline": "Rising to the challenge with the all-new Redmi Note 11 series",
    "summarized_story": "Xiaomi launched the Redmi Note 11 series for Nigerian markets on Wednesday, February 9th, 2022, carrying on the legacy of the Redmi Note series with three all-new devices – Redmi Note 11 Pro, Redmi Note 11S, and Redmi Note 11.\nMoreover, the Redmi Note 11 Pro, Redmi Note 11S, and Redmi Note 11’s 2MP depth camera allows you to create a natural bokeh effect for your portrait shots.\nAdvertisementThe Redmi Note 11 Pro and Redmi Note 11S rise to the challenge with an advanced octa-core MediaTek Helio G96 processor and up to 8GB of RAM.\nMarket availabilityThe Redmi Note 11 Pro and Redmi Note 11S are available in three configurations: 6GB+64GB, 6GB+128GB, and 8GB+128GB.\nMoreover, the Redmi Note 11 Pro will be available in early March, 2022, while the Redmi Note 11S and Redmi Note 11 are now available."
  },
  {
    "headline": "Dirty petrol saga: Middlemen explore fresh tricks in Nigeria’s opaque oil contracts",
    "summarized_story": "The controversy concerning dirty petrol has exposed more rot in Nigeria’s opaque oil contracts as latest findings reveal middlemen involved in crude oil swap are exploring the system to short-change the Nigerian National Petroleum Corporation (NNPC) and ensure Nigerians remain hooked on cheap fuel.\n“Under the DSDP contract, NNPC sells its crude oil to selected middlemen for refined petroleum products.\nThese trading companies buy the oil from the NNPC but do not refine it themselves.\nInstead, they sell it, through intermediaries, to other companies, who refine it, a development that is a distinctive feature of Nigeria’s oil industry.\nAccording to sources, each consortium would receive 20,000 barrels per day of crude oil in exchange for products, making the combined total 320,000 barrels per day of Nigeria’s output."
  },
  {
    "headline": "Supreme Court declares Executive Order 10 unconstitutional",
    "summarized_story": "The Supreme Court has declared as unlawful and unconstitutional the Executive Order 10 (EO10) issued by President Muhammadu Buhari on the funding of State Judiciary and Legislature.\nIn a split decision on Friday, the majority of the court’s seven-member panel agreed that the President exceeded his constitutional powers in issuing the EO10.\nSix out of the seven members of the panel proceeded to void and set aside the EO10.\nAll the seven members agreed that the States were not entitled to be refunded all they have spent before now to maintain those courts.\nRead also: Teachers to wait longer as Buhari’s promises dragPresident Buhari signed into law, Executive Order No 10 of 2020, as “the implementation of financial autonomy for state legislature and judiciary Order, 2020.”A key provision of the said Executive Order seeks to enforce the financial autonomy of the legislature and judiciary of the states."
  },
  {
    "headline": "What Abuja council elections mean for APC, PDP",
    "summarized_story": "Basically, the exercise is to elect chairmen into the six Area Councils of Abaji, Abuja Municipal Area Council (AMAC), Bwari, Gwagwalada, Kuje, and Kwali, and councillors for the 62 wards that made up the territory.\nThus, for either the APC or PDP to win or lose the Saturday’s area councils election may imply acceptability or rejection of each of the parties.\nBut for the FCT Area Council polls, APC took the day having won five out of the six chairmanship with many councillor-ship seats while the PDP got one chairmanship (Kuje Council) and a handful of councillors.\nRead also: APC, PDP, others sign peace accord for FCT area council electionBoth the governors-dominated APC and PDP campaign councils are already in Abuja, perfecting plans and campaigning for the victory of their parties on Saturday.\nAdaji said the opposition PDP was only shedding tears of defeat ahead of the Saturday council election, adding that the PDP was always known for raising false alarms."
  },
  {
    "headline": "Edo begins asphalting of 105.6km Benin-Abraka Road – Nigerian Observer",
    "summarized_story": "The governor gave the assurance when he inspected the laying of asphalt on the ongoing reconstruction of the 105.6km Benin-Abraka Road.\nThe road stretches from Ikpoba-Okha Local Government Area of the state through Orhionmwon LGA, Edo State and terminates at Abraka in Delta State.\nThe road was jointly awarded by the Edo State Government and the Edo State Oil and Gas Producing Areas Development Commission (EDSOGPADEC), to Raycon Construction Company Nigeria Ltd in 2021, with the mandate to complete the road project within a specified period of four years.\nEnabulele Ferguson, while speaking to journalists during the inspection of the asphalting of 5km road, for the first phase of the total of 105.6km Benin-Abraka Road, expressed satisfaction with the progress of work on the road.\nHe, however, noted that despite being a federal road, the project will be completed and delivered to the people at the stipulated time, pledging to ensure its completion before 2025."
  },
  {
    "headline": "National Sports Festival: Redeem N500m pledge, Obaseki urges FG – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has called on the Federal Government to redeem the outstanding N500 million which it pledged to pay as contribution for the hosting of the last edition of the National Sports Festival (NSF), tagged Edo 2020.\nObaseki made the appeal when he received the Edo 2020 Report from the Local Organising Committee, headed by his deputy, Rt.\nThe governor, who noted that the national sports competition has ignited the spirit of sportsmanship amongst young people, said the state set a new record in the hosting of the games.\nAccording to him, “I will talk on the issue of the outstanding N500 million that the Federal Government promised to contribute to the games.\nI want to thank the team for the discipline in procurement, management of finances and accountability."
  },
  {
    "headline": "10 percent of Edo population now PDP members, says Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has said about 10 percent of the state’s entire population are now members of the Peoples Democratic Party (PDP) in Edo State.\nObaseki, who disclosed this to journalists in Benin City, noted that about 500,000 persons have been registered as members of the PDP in the ongoing electronic registration and revalidation exercise across the state.\nThe 500,000 persons registered by the party represent 10 percent of the state’s entire estimated population of five million.\nWith the development, 10 percent of Edo population are now members of PDP.\nThe e-registration and revalidation exercise is aimed at migrating the party’s membership database from analogue to digital, building a durable and comprehensive database of party members."
  },
  {
    "headline": "Obaseki mourns passing of Comrade Ogbeide – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has mourned the passing of Comrade Osarunmwense Ogbeide, who passed on January 25, 2022.\n“A kind, compassionate and loving gentleman, he was a good father, who loved deeply and warmed the hearts of friends and family around him.\n“Osarunmwense was good-natured and made sacrifices for the benefit of others, a trait which endeared him to all.\n“He will be remembered for his large heart, affable nature and commitment to his family.\n“I commiserate with the Ogbeide family, friends and associates of the deceased and pray that God will grant all the fortitude to bear this irreparable loss.”Share this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Climate change threat to food security in Nigeria – Dare",
    "summarized_story": "Nigeria’s minister of youth sports, Mr. Sunday Dare, has called on Nigerians to take issues of climate change seriously to tackle food insecurity and imbalances in the planet’s ecosystem.\nHe noted that climate change represents a threat to food security in the country.\n“Nigeria is not immune from the adverse effects of climate change.\nClimate change is increasingly threatening Nigeria’s ecosystem, with increasing desertification in the north, erosion in the east, ocean surge in places like Lagos, among others.\nA Nigerian born, British activist, Emeka Obasi Jnr, is leading an awareness campaign in this regard, through his NGO, Our Tomorrow."
  },
  {
    "headline": "Bamidele Adeleke Felicitates Timi Of Ede on Birthday",
    "summarized_story": "By Sunday Oguntuyi, OsogboA People’s Democratic Party, PDP, aspirant in the coming 2022 governorship election in Osun state, Mr. Bamidele David Adeleke has joined millions of the well wishers in felicitating with Timi of Ede, Oba Munirudeen Adesola Lawal (Laminisa 1) on the occasion of his Birthday.\nMr. Bamidele Adeleke, in a statement issued on Friday described the monarch as an embodiment of royalty and objectivity, full of wisdom and a renowned custodian of the traditional institution.\nHe said: “Having the privilege of being alive and well to celebrate another year of God’s faithfulness is not an easy feat especially in this clime where life expectancy is reducing almost daily, but God in His infinite mercies have kept you to this day.\n“Baba as you celebrate, it is my fervent prayer that God Almighty would continue to bestow on you long life and wisdom to serve the people of Ede land in particular, Osun State and indeed Nigerians at large.”"
  },
  {
    "headline": "Atiku will soon declare for president – Adviser",
    "summarized_story": "Nigeria’s former vice president, Atiku Abubakar, will present himself for consideration as president in the 2023 election, the Director General of the Amalgamated Atiku Support Groups (AASG), Hon Oladimeji Fabiyi has said.\n“I would like to make it abundantly clear that the AASG which has the records of hundreds of credible and authenticated Atiku support groups nationwide and in the Diaspora does not know of such amorphous groups.\nFor the avoidance of doubt, Atiku Abubakar is eminently qualified under the constitution of Nigeria to contest for any office in the land.\nAlready our intelligence has exposed the plot of these enemies of democracy to malign and discredit Atiku Abubakar in order to advance their narrow interests.\nFor Atiku and his supporters it’s about the real issues, it’s about discourse on how to move Nigeria forward not about their shenanigans and inordinate ambition."
  },
  {
    "headline": "Veritas Kapital appointments Paul Oki Independent Non-Executive Director",
    "summarized_story": "Veritas Kapital Assurance Plc, has appointed Mr. Paul Oki as an Independent Non-Executive Director of the company.\nThe appointment was announced in a notice by company secretary, Saratu Umar Garba, to the Nigerian Exchange Limited (NGX).\nAccording to the disclosure, the appointment of Mr. Oki has been approved by the National Insurance Commission, as required.\nHe is also the former Legal Adviser of the Nigerian Gas Association (NGA) and a former Director and Company Secretary of the Nigerian Airspace Management Agency (NAMA).\nConclusively, the company’s disclosure states that Mr. Oki has distinguished himself in various high-level advisory roles for the Federal and State government(s) of Nigeria; serving diligently as a member on several ministerial committees"
  },
  {
    "headline": "BREAKING: Military Copters Kill 20 Bandits Advancing Towards NDA",
    "summarized_story": "Air Troops of Operation Thunder Strike have eliminated no fewer than 20 armed bandits at the general area of the Nigerian Defence Academy (NDA) in Kaduna.\nCredible intelligence sources told PRNigeria that bandits, riding on about 50 motorcycles, were seen on Thursday evening, advancing towards the military institution.\nRecall that gunmen, suspected to be armed bandits, invaded NDA in June, 2021.\nThe bandits, in their numbers, were sighted in makeshift tents and motorcycles amounting up to about 50.\n“Moreso as it is customary, feedback received on Friday after the operation from both the ground forces and local sources, revealed that the bandits were effectively disoriented and suffered a loss of about 20 bandits."
  },
  {
    "headline": "Ensure Skilled Young Nigerians Get Board Appointments, Buhari Tells SGF, CoS",
    "summarized_story": "The President, who gave the directive while receiving members of the All Progressives Congress (APC) National Youth Lobby Group, said young people’s inclusion in governance would encourage learning and mentoring in government and politics.\nHe further directed Prof Ibrahim Gambari, Chief of Staff, and the SGF to ensure monthly engagements with the APC Youth Lobby group for better synergy and cross pollination of ideas and opportunities.\nPresident Buhari told the APC Youth Lobby Group led by Barrister Ismaeel Ahmed that the leadership of the party would ensure full participation of young people at all levels.\n”Mr President, young people in Nigeria believe in your capacity and the history of your public service.\n”You joined politics at the age of 60 and was elected President at the age of 72."
  },
  {
    "headline": "FCT Elections: Police Relax Movement Restrictions",
    "summarized_story": "Ahead of the Saturday, February 12 area council elections in Abuja, the Nigeria police force has relaxed the earlier restriction on vehicular and human movement.\nMeanwhile, the Nigeria police force has released emergency contact numbers for public use during the election.\nThe various sectors and their corresponding contacts include: Karshi/Karu: 07031288054, 09051515353; Abaji/ Robochi: 07039025916; Zuba/Deidei: 07069432758; Kwali: 07084460616; Gwagwalada: 08039671340; Kuje: 08099904277, 08060505350; Kabusa: 08034528322; Bwari: 08033543835; HQ Response team: 08061336830.\nFCT police PRO, DSP Josephine Adeh said this is in absolute readiness for the forthcoming elections as the police has put in place the creation of a “9 sector re-enforcement team “ comprising of the police and other sister agencies.\nADVERTISEMENTThe PPRO also said: “the sectored re-enforcement team is independent of, and shouldn’t be confused with the standard deployment of two unarmed police personnel at each polling unit across the state as required by standard best practices."
  },
  {
    "headline": "Oando Denies NNPC Claim On Imported Off Spec Petrol",
    "summarized_story": "Oando Plc, has denied importing adulterated and substandard petrol into the country, as claimed by the Nigerian National Petroleum Corporation, NNPC, Limited.\nThe Corporation had in a statement named four oil companies involved in the importation of offspec petrol in the country, including Oando.\nHe explained that NNPC investigation revealed the presence of Methanol in four PMS cargoes imported by MRS, Emadeb/Hyde/AY Maikifi/Brittania-U Consortium, Oando and Duke Oil under the Direct-Sale-Direct-Purchase (DSDP).\n“The NNPC quality inspectors including GMO, SGS, GeoChem and G&G conducted tests before discharge also showed that the gasoline met Nigerian specification,’’ he said.\nNNPC Ltd. is intensifying efforts to increase supply of its petrol imports, urging some trading houses to urgently secure prompt supplies, they said."
  },
  {
    "headline": "Senator Bwacha Defected To APC For Cover Against Prosecution — Constituents",
    "summarized_story": "Some Constitutents of Taraba South Senatorial District has said that the senator representing them in the National Assembly, Emmanuel Bwacha defected to the All Progressives Congress (APC) to seek immunity against prosecution over alleged corruption cases.\nBwacha had dumped the Peoples Democratic Party (PDP) over “division” in Taraba State chapter of the opposition party and that he was deliberately isolated by its leadership in the state.\nBwacha said he joined the APC to breath fresh air, and because of the visible presence of the ruling party in his Senatorial District.\nHe also said his constituents were happy about his defection because of what they have seen on ground in Taraba South Senatorial District.\nADVERTISEMENTBut the Coordinator of the Concerned Constitutents of Taraba South Senatorial District, Daniel Likam, countered the senator’s claim, saying the lawmaker joined APC to shield himself from being investigated by the Economic and Financial Crimes Commission (EFCC)."
  },
  {
    "headline": "Hushpuppi: PSC confirms fresh probe of Abba Kyari’s FBI indictment",
    "summarized_story": "By Monday IjehThe Police Service Commission (PSC) has ordered a fresh probe into the FBI indictment of suspended DCP Abba Kyari in the scam case involving Ramon Abbas Olorunwa a.k.a Hushpuppi.\nAni stated also that the commission has consequently deferred a decision on Kyari’s case who until his suspension was the Officer-in-Charge of the Intelligence Response Team of the Nigeria Police.\nHe said the PSC took the decision at the continuation of its 14th Plenary Meeting chaired by Alhaji Musiliu Smith, its Chairman.\n“The I-G had earlier forwarded the FBI report to the Attorney-General of the Federation and Minister of Justice for legal advice,’’ Ani added.\nHe stated also that the PSC reaffirmed its earlier decision to exonerate SP Shaaba Gboyako, former Chief Security Officer to a former I-G of the unwholesome act."
  },
  {
    "headline": "Why I'm determined to end illegal oil refining, bunkering in Rivers",
    "summarized_story": "Okafor Ofiebor /Port HarcourtGovernor Nyesom Ezenwo Wike has said the war against illegal refining and bunkering is not about political party, but about Nigeria, her survival and the health of the people of Rivers state.\n“The mere fact that I am in opposition does not mean that I have to sabotage the economy of the nation.\nAccording to him, the prospective members are drawn from councils areas where their chairmen have shown commitment to the fight.\nHe added that he has approved the money that was pledged to councils that have identified and destroyed sites used for illegal crude oil refining.\nSo, it is only those that have shown commitment that I have approved the money for.”Our Correspondent reports that the Governor had promised to grant N20 million each to the 23 local government Council Chairmen to fight the illegal oil bunkering."
  },
  {
    "headline": "How Uduak Akpan Violated, Murdered Akwa Ibom Jobseeker, Iniubong Umoren — DSS",
    "summarized_story": "Ama Okeke, an official with the Akwa Ibom State Command of the Department of Security Services (DSS), testified before the State High Court in Uyo about the murder of Iniubong Umoren, a job seeker.\nThe 10th Prosecution Witness (PW10), a DSS officer, said in court that the first accused, Uduak Akpan, stuffed the deceased’s mouth with black material to keep her from screaming.\nHe testified that the first accused person (Uduak-Abasi Akpan) had a communication with the late Iniubong Umoren throughout the course of their investigation.\nHe told the court, “My Lord, the first accused person (Uduak-Abasi Akpan) told our investigation team that Iniubong Umoren refused to have sex with him and struggled with him.\nHe also told us that even when he overpowered the deceased, she told him that she will allow him only if he used a condom."
  },
  {
    "headline": "Hushppupi: Police Ordered To Conclude Investigation On Abba Kyari In Two Weeks",
    "summarized_story": "“Kyari had earlier been indicted by a Report of the Federal Bureau of Investigation (FBI) of the United States and was also investigated by a special Panel set up by the Inspector General of Police.\n“The Report had earlier been forwarded to the Attorney General of the Federation and Minister of Justice for legal advice by the Inspector General of Police.\n“The Commission also directed that further necessary investigation should take half the time it took the Police to conduct the original investigation and that the investigation should be carried out by a different panel.\n“The Commission at the Plenary Meeting also considered 20 Pending Disciplinary Matters and five appeals and petitions from the Inspector General of Police and aggrieved serving and ex-Police Officers.\nIt directed the Inspector General of Police to implement its decision as its affects the Officer without delay…”"
  },
  {
    "headline": "2023: Prophet Olujobi Releases Fresh Prophecies About Tinubu, Yahaya Bello, Okorocha, Others",
    "summarized_story": "Prophet Bisi Olujobi, the General Overseer of Wisdom Church International in Ketu, Lagos State, has revealed lots of new new predictions about the 2023 general elections, including ones involving Bola Tinubu, Yahaya Bello, and Rochas Okorocha.\n“This is time for revenge against Tinubu,” he said, adding that Kogi State Governor, Yahaya Bello will be a force to reckon with in the forthcoming polls.\nHe said Tinubu would be seriously bedridden, according to him, “as a result of God’s vengeance”.\n“Tinubu will be seriously ill to the extent that all his political cronies will abandon him.\n“Bello should seek wise counsel, humble himself and hold on to see what God wants’ to do."
  },
  {
    "headline": "BREAKING: Gunmen Kill KADGIS Director In Kaduna",
    "summarized_story": "About five gunmen in the early hours of Friday morning assassinated the Director of Operations, Kaduna Geographic Information Service (KADGIS), Malam Dauda.\nSources disclosed that the killers breached the security of the victim’s house located in Barakallahu community in Igabi Local Government Area of the state, went inside the room and shot him dead.\nIt was also revealed that the killers only killed the director and left immediately without touching any valuables like cars and other valuables.\nThe killers also attacked a nearby community, though no death or injury was recorded during the attack.\nPolice Public Relations Officer, ASP Muhammad Jalige, did not respond to text messages and calls to his phone as at the time of filling this report."
  },
  {
    "headline": "Breaking: Nigeria’s D’Tigress shock France, edge closer to 2022 FIBA Women’s basketball World Cup",
    "summarized_story": "Nigeria’s D’Tigress kept their 2022 Fiba Women’s Basketball World Cup hopes alive after the team surprisingly defeated 5th globally-placed French side 67-65 at the ongoing qualifiers in Belgrade, the capital of Serbia.\nD’Tigress, Nigeria’s female team are currently ranked 15th in the dworld and number one in Africa.\nThey will battle Mali in their game in the qualifier series.\nThe Nigerian side are now second behind China.\nDetails loading…"
  },
  {
    "headline": "2023: Have APC, PDP jettisoned zoning?",
    "summarized_story": "As the countdown to the 2023 presidential election continues, aspirants from the major political parties, APC and PDP, continue to strategise and oil their structures towards occupying Aso Rock.\n“So, because it is not binding on political parties to zone presidential tickets between the North and South, the APC and PDP may throw their 2023 tickets open.\nSpeaking with Blueprint Weekend, Mohammed said, “There are many reasons the APC and PDP may throw open the race for its 2023 presidential tickets.\n“Zoning the 2023 presidential ticket is a banana peel that APC and PDP are trying to avoid.\nSo, this should be the major concern of political parties across the country, including the PDP."
  },
  {
    "headline": "NYCN hails NNPC for proactive measures in tackling contaminated fuel, scarcity",
    "summarized_story": "The National Youth Council of Nigeria (NYCN) has commended the Nigerian National Petroleum Company (NNPC) on its handling of the contaminated Petrol Motor Spirit (PMS), and scarcity of the product experienced across Nigeria in recent times.\nThe NNPC had revealed that the scarcity was occasioned by the importation of adulterated fuel by suppliers.\n“These remedial actions aimed at arresting the use of the contaminated fuel inadvertently disrupted the country’s fuel supply chain and led to the damage of several cars.\nWithout doubt, the decision of NNPC to order the quarantine of all unevacuated volumes of the contaminated fuel saved the nation from a monumental scandal.\n“Without doubt, the decision of NNPC to order the quarantine of all unevacuated volumes of the contaminated fuel saved the nation from a monumental scandal."
  },
  {
    "headline": "FCT Elections: Police Reinstate Curfew From 8am To 3pm",
    "summarized_story": "The FCT Police Command has announced the imposition of a curfew from 8am to 3pm on Saturday for safe conduct of the area council elections.\nThe police had earlier relaxed restrictions earlier on Friday but said it had received more intelligence that some elements were planning to disrupt the electoral process.\nREAD ALSO: Residents Flee As Terrorists Attack Zamfara Community, Kill Six“Accordingly FCT police found it necessary to restrict all movement from 8am to 3pm tomorrow Saturday, 12th February 2022.\n“Only those on essential services would be allowed.”473 candidates, 14 partiesThe FCT area council election is the only council poll conducted by Independent National Electoral Commission.\nAccording to the INEC Chairman, Mahmood Yakubu, there will be no voting in 593 polling units on Saturday."
  },
  {
    "headline": "Residents Flee As Terrorists Attack Zamfara Community, Kill Six",
    "summarized_story": "Six persons have been reportedly killed following a fresh attack by suspected terrorists at Rogoji community in Bakura Local Government Area of Zamfara State.\nRogoji community is about two kilometers to Bakura town, headquarters of Bakura Local Government.\n“They invaded the Rogoji community about 11pm on Thursday, they came to the community on motorcycles in large numbers with sophisticated weapons, shooting to scare the people away,” the witness said.\nThe eyewitness further stated that the suspected terrorists have displaced many within Bakura town where individuals are currently seeking refuge and might not return to their community soon for fear that the terrorists might return to launch another attack.\nAbdullahi said the military responded promptly to repel the attack though when they got into the community the terrorists had already left."
  },
  {
    "headline": "Abba Kyari: PSC Postpones Decision, Insists On New Panel To Conduct Fresh Investigation",
    "summarized_story": "The PSC is also insisting that a new panel be set up to conduct a fresh investigation into the matter.\nREAD ALSO: Nigeria Collaborating With US, Extradition Of Abba Kyari Considered – AGFThe decision of the Commission comes two weeks after it rejected the report of the panel set up by the Inspector-General of Police, Usman Baba Alkali to investigate the alleged connection between Abba Kyari and Hushpuppi for lacking depth.\n“The Commission also directed that further necessary investigation should take half the time it took the Police to conduct the original investigation and that the investigation should be carried out by a different panel,” the statement said.\nMr Kyari was suspended for alleged involvement in a $1.1 million internet fraud allegedly perpetrated by Hushpuppi and four others – Abdulrahman Juma, Vincent Chibuzo, Rukayat Fashola, and Bolatito Agbabiaka.\nThe Federal Bureau of Investigation had alleged that Hushpuppi paid $20,600 to two bank accounts allegedly provided by Kyari on January 20, 2020."
  },
  {
    "headline": "UPDATED: Supreme Court Declares Executive Order 10 Unlawful, Dismisses Governors’ N66bn Suit",
    "summarized_story": "﻿The Supreme Court has declared as unlawful and unconstitutional, Executive Order 10 (EO10) on the funding of State Judiciary and Legislature.\nSix of the seven members of the panel proceeded to void and set aside the EO10 issued by President Muhammadu Buhari.\nThe apex court also dismissed the N66 billion suit filed by the state governors against the Federal Government.\nThe 36 states governors had in the suit sought an order of the court to compel the Federal Government to take up funding of capital projects for State High Courts, Sharia Court of Appeal, and Customary Court of Appeal.\nThis move was, however, rejected by the state governors who demanded the immediate dissolution of the Presidential Implementation Committee and challenged the EO10 at the apex court."
  },
  {
    "headline": "Five Internet Fraudsters Convicted in Ogun, Osun",
    "summarized_story": "The Ibadan Zonal Command of the Economic and Financial Crimes Commission (EFCC), on Thursday, secured five convictions before Justice Nathaniel Ayo-Emmanuel of the Federal High Court, Osogbo, Osun State, and Justice Oluremi Oguntoyinbo of the Federal High Court, Abeokuta, Ogun State respectively, for their involvement in internet fraud.\nThe convicts are Sulaimon Ayub Damilare, Mujeeb Lawal Alabi, Timilehin Paul Ogunleye, Osoko Adesola David, and Akinwunmi Emmanuel.\nREAD ALSO: [Alleged N2.9bn Fraud] Call EFCC To Order, Okorocha Urges BuhariJustice Nathaniel Ayo-Emmanuel convicted and sentenced Osoko Adesola David to five months’ imprisonment, Timilehin Paul Ogunleye, four months’ imprisonment while Akunwunmi Emmanuel bagged three months’ jail term.\nSimilarly, Justice Oguntoyinbo convicted and sentenced Mujeeb Lawal Alabi to three months’ imprisonment while Sulaimon Ayub Damilare bagged four months.\nThe convicts are to restitute their victims and forfeit recovered items to the Federal Government."
  },
  {
    "headline": "APC CECPC Notifies National Convention of Proposed Amendments to Constitution -",
    "summarized_story": "In accordance with Article 30 (iii) of the All Progressives Congress (APC) Constititution, the Governor Mai Mala Buni-chaired Caretaker/Extraordinary Convention Planning Committee (CECPC) has served a notice of proposed amendments to the Party’s Constitution on members of the National Convention.\nArticle 30 (iii) stipulates that the notice is served at least fourteen (14) days before the date of the National Convention at which the proposed amendments is to be considered.\nAdvertisementAPC Constitution 2014 has been in effect for almost eight years and together with judgments from Courts of competent jurisdiction, administrative experiences have revealed flaws in the Constitution.\nIt became imperative to conduct a review of the Party’s Constitution.\nThe Caretaker/Extraordinary Convention Planning Committee established a Constitution Review Committee under the chairmanship of Prof. Tahir Mamman OON, SAN to thoroughly review the Constitution in accordance with Article 30 which provides for Constitutional amendments."
  },
  {
    "headline": "FCT Council Polls: Ortom vows to resist any form of rigging",
    "summarized_story": "The Benue State Governor Samuel Ortom has vowed to resist any form of rigging or manipulation in Saturday’s Abuja territory elections.\nAdvertisementLast minute preparation for Saturday’s Abuja territory elections necessitated this gathering of critical stakeholders of the country’s main opposition party at the instance of the campaign council Chairman.\nHe quickly goes into the business of the day by setting the tone for the closed door session.\nAdvertisementAccording to him the ruling party has made their job pretty simple by its abysmal performance.\nThe meeting was attended by Governor’s of Benue ,Oyo, Bauchi and Rivers State as well as Senators, former Governor’s, former Senators and other party leaders."
  },
  {
    "headline": "Zamfara Assembly orders Chief judge to set up panel to investigate deputy Gov. -",
    "summarized_story": "The Zamfara State House of Assembly has directed the state Chief Justice to set up investigative panel on the alleged gross misconduct leveled against the state Deputy Governor Mahdi Aliyu Gusau.\nThe House during it’s 120 Plenary unanimously agreed that the Deputy Governor be investigated for breaching Sections 190 and 193 (1), (2) (a)(b)(c) of the Constitution of the Federal Republic of Nigeria.\nAdvertisementThis Development is coming barely twenty four hours after the House served all members with Notice of Impeachment of the Deputy GovernorEighteen out of the twenty two members of the House voted for in favour of the motionAdvertisementThe only PDP Lawmaker representing Zurmi East Salihu Usman was also not present at the plenaryThe Zamfara assembly is accusing the deputy of abuse of office, saying he has breached sections 190 and 193 (1), (2) (a)(b)(c) of the ConstitutionAdvertisementThe Zamfara State House of Assembly had on Monday through the Secretary to the state government served the deputy Governor an impeachment noticeA federal high court in Abuja had in November last year restrained the Zamfara Assembly from any move to impeach the deputy GovernorAdvertisementThe crisis between the Zamfara Assembly and deputy Governor started a few weeks after the formal Defection of Governor Bello Matawalle from the People’s Democratic Party to the ruling APC.\nAdvertisement"
  },
  {
    "headline": "Bagudu swears-in 21 LG chairmen, asks them to develop grassroot potential -",
    "summarized_story": "The newly elected chairmen and vice chairmen of the twenty one local government areas of Kebbi state have been advised to pay attention to the economic potential and other opportunities in their various domain.\nKebbi state governor, Atiku Bagudu gave the advised shortly after the elected council officials took their oath of office at a ceremony held at Birnin Kebbi.\nAdvertisementHe says the council executives should also be interested in how those economic potential can be developed and explore for the benefit of the nation and their immediate environment.\nThe governor said, with the oath of office administered on them, partisanship should be kept aside and work for the entirety of the people of the local government irrespective of political party affiliation.\nAdvertisementThe twenty one council chairmen and their vice chairmen are all of the All Progressives Congress APC and sixteen of the twenty and fifty five councillors elected across the twenty one.local government, sixteen of them are women."
  },
  {
    "headline": "Ahead of 2023 Elections, Buhari Warns Foreign Diplomats About Meddling in Nigeria’s Internal Politics",
    "summarized_story": "For the umpteenth time, President Muhammadu Buhari has warned foreign diplomats against meddling in the internal politics of Nigeria as the nation prepares for the 2023 general elections.\nThis was the second time in five months that the president would be asking diplomats to steer clear of nation’s local politics.\nBuhari urged the Ambassadors to build lasting friendships in the course of performing their duties that will go beyond assignments in Nigeria.\nBuhari assured of partnership and mutual cooperation in canvassing more Foreign Direct Investments (FDI) in healthcare system, education, infrastructure, local manufacturing, pharmaceuticals, agribusiness and transportation.\nKrejc said the envoys would work for the development of Nigeria, through strengthening of mutual and beneficial relations with their countries."
  },
  {
    "headline": "Buhari Still Consulting on Electoral Bill, Aide Says",
    "summarized_story": "The Senior Special Assistant to President Muhammadu Buhari, on National Assembly Matters (Senate), Senator Babajide Omoworare, on Thursday said his principal had yet to sign the 2010 Electoral Act (Amendment) Bill 2022 because he was still consulting with stakeholders and legal experts on the issue.\nThey spoke at a Policy Dialogue programme, organised by the National Institute for Legislative and Democratic Studies (NILDS).\nHe said, “A very crucial consultation is going on between Mr. President, the Attorney General and other critical stakeholders on content of the bill for the required assent.\nMalami had during an interview on Channels Television hinted that President Muhammadu Buhari may withhold assent, if the bill was considered to have proposals based on personal interests.\nHe added that if the nation was serious about advancing democracy, then people should stop playing to the gallery and do what the public interest says."
  },
  {
    "headline": "Nigeria’s Oil Production Rises by 202,000bpd",
    "summarized_story": "According to the OPEC’s Monthly Oil Market Report (MOMR) for January released on Thursday, the country struggled to pump 1.399 million bpd out of the total allocation, quoting primary sources.\nRelatedStories No Content AvailableThis was in contrast to December 2021, when it pumped 1.197 million barrels per day and November when it was only able to produce 1.275 million bpd.\nEven top producer, Saudi Arabia, failed to deliver its 110,000 bpd monthly increase, raising its oil production in January by 54,000 bpd to 9.999 million, below its 10.122 million bpd quota for January per the OPEC+ deal.\nDespite tightening oil market, OPEC and its allies, OPEC+ has continued to add a measured 400,000 barrels per day increase in production to the market.\nIt left its demand outlook for global oil demand growth unchanged, while signalling optimism about prospective increases in transport fuel consumption."
  },
  {
    "headline": "CBN Eyes $200bn from Fresh Non-Oil Exports",
    "summarized_story": "The Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, on Thursday announced a new programme to stimulate the country’s non-oil exports and achieve $200 billion repatriation of proceeds between three to five years.\nEmefiele said the scheme, code-named, “Race to $200 billion in FX Repatriation (RT200 FX Programme),” which takes immediate effect, consists of a set of policies, plans and programmes for non-oil exports which would help the country attain its goal of $200 billion in FX repatriation, exclusively from non-oil exports transactions over the next three to five years.\nHe, however, explained that the new non-oil export initiative would have five key anchors namely value-adding exports facility; Non-oil commodities’ expansion facility; Non-oil FX rebate scheme; Dedicated non-oil export terminal as well as Biannual non-oil export summit.\n“Fund people who want to generate export proceeds, when those export proceeds come, we would fund them at five per cent for you and they would earn rebate and that’s how we can help you.\nThat you will continue to come to central bank to give you dollar, we would stop it."
  },
  {
    "headline": "Nigeria’s Debt Sustainability at Risk, Cause for Concern, IMF Says",
    "summarized_story": "The International Monetary Fund (IMF) has said Nigeria’s debt sustainability is at risk and causes a great deal of concern and unease in the long-term.\nRahman noted that the increase in public debt had grown rapidly in 10 years and was approaching a time when the country would spend all its income on servicing debts.\nRahman explained, “But what we should remember here and the things that make Nigeria’s debt sustainability at risk are the following: we have seen a rapid rise in public debt in the last 10 years or so and this is being driven by fiscal deficits.\nAnd there are a couple of other points that we should remember; which is that Nigeria’s debt carrying capacity is very low.\nSo that makes Nigeria quite vulnerable.”Rahman said going forward, IMF projected for Nigeria a continuous increase in public debt."
  }
]