[
  {
    "headline": "BREAKING: Four more Zamfara Reps dump PDP for APC",
    "summarized_story": "Four members of the House of Representatives from Zamfara State have defected from the Peoples Democratic Party to the All Progressives Congress.\nGovernor Bello Matawalle of Zamfara State had formally announced his defection to the PDP to the APC in Gusau, the state capital, on Tuesday last week, along with members of the federal and state legislatures.\nAll the 24 members of the state House of Assembly, all the three senators and six out of the seven members of the House had followed the governor to the ruling party.\nHowever, the Deputy Governor, Aliyu Gusau; and a member of the House representing Anka/Talata-Mafara Federal Constituency, Kabiru Mafara, have remained in the PDP.\nThe lawmaker representing Zamfara Central Senatorial District, Senator Hassan Gusau, had on Tuesday last week announced his resignation from the PDP in plenary."
  },
  {
    "headline": "Electoral Act amendment proposes oath-taking for INEC officials, security agents",
    "summarized_story": "The Act also proposed oath-taking for INEC officials and security agents.\nThese are contained in the report on the Electoral Act 2010 (Amendment) Bill billed for consideration and adoption by the Senate and House of Representatives.\nAn analysis of the amounts proposed as the ceiling for respective posts showed that the National Assembly raised some of them by 200 per cent.\nLawan stated this while inauguration of the reconstituted Public Complaints Commission by the National Assembly, led by the Chief Commissioner, Abimbola Ayo-Yusuf.\nHe said, “The National Assembly is embarking on the amendment of the Electoral Act."
  },
  {
    "headline": "Parents of abducted Kaduna students threaten to burn school",
    "summarized_story": "Parents of the students abducted by bandits from Bethel Baptist High School in Kaduna State have threatened to burn down the school if nothing is done to rescue their wards.\nA statement issued by the state government revealed that the bandits, on Monday, shot sporadically as they advanced to the school’s hostels and abducted an unspecified number of students.\nOne Caroline Emmanuel whose younger brother was taken away by the bandits said she was displeased on receiving the news.\n“According to reports received from security agencies, twenty-eight students were accounted for while an unspecified number were abducted by the bandits.\n“Security agencies have assured the Kaduna State Government of vigorous search and rescue efforts to locate and secure the unspecified number of abducted students."
  },
  {
    "headline": "36 investors express interests to buy FG’s power plants",
    "summarized_story": "By Emma Ujah, Abuja Bureau ChiefThirty-six power sector investors have submitted Expressions of Interest (EoIs) for the five National Integrated Power Plants (NIPPs) put up for sale by the federal government.\nThe affected plants are: Benin Generation Company Limited at Ihovba, Edo State; Calabar Generation Company Limited, Cross River State; Geregu Generation Company Limited, Kogi State; Olorunsogo Generation Company Limited, Ogun State; and Omotosho Generation Company Limited, Ondo State.\nHe added that the Evaluation Committee constituted by the Bureau, which also included nominees of the Niger Delta Power Holding Company (NDPHC) has commenced work on the EoIs.\nThe initial process was for the ten NIPP plants to be privatized.\nHowever, he noted that the transaction was eventually stalled largely due to the liquidity challenges in the power sector, amongst other factors."
  },
  {
    "headline": "Buhari to security agencies: Act swiftly to rescue kidnapped students",
    "summarized_story": "By Johnbosco Agbakwuru – AbujaPresident Muhammadu Buhari last night directed the military, police, and intelligence agencies to ensure the safe and early release of all kidnapped victims.\nPresident Buhari in a statement issued by his Senior Special Assistant on Media and Publicity, Mallam Garba Shehu in Abuja, expressed concern over attacks on Kaduna and Niger States, largely targeted at students.\nWhile noting ongoing deployment of additional security personnel to all troubled areas, the President urged security outfits to “act swiftly” to rescue all school boys and girls in the affected states and ensure safe return.\nThe President called on state governments to ensure compliance with UN-supported Safe Schools Programme, which he said the administration had adopted.\nPresident Buhari described kidnapping as cowardly and despicable, condemning it as an assault on affected families and the nation."
  },
  {
    "headline": "Letshego launches digital platform to celebrate the spirit of Africa",
    "summarized_story": "By Moses NosikeLetshego Group, a leading retail finance organisation in Africa, launched its ‘LetsGo digital’ campaign through its digital financial technology platform.\nLetshego Group has its footprint in 11 African markets with a-22-year history of improving lives through inclusive financial solutions in Africa.\nLetsGo solutions enable Letshego customers to achieve their aspirations, empowering a progressive generation of cultural change in this new normal.\nLetsGo gives customers Digital Power through an omni-channel digital experience with Letshego continuing its journey in evolving its LetsGo platform and products to further catalyse its Strategic Transformation.\nTolu Opayinka, Letshego Nigeria CEO added, “We continue to expand our reach by diversifying our product offering, enhancing access via our digital platforms and leveraging strategic partnerships."
  },
  {
    "headline": "Buhari’s relationship with Govs, cordial, says APC think-tank",
    "summarized_story": "It noted that the old tense relations between Federal and State Governments is now history.\n“The splitting of the Nigeria Governors Forum, following the 2013 Chairmanship elections that threw up a winner who was not the favoured candidate of the powers-that-be.\n“The President has approved trillions of Naira in vital Refunds to State Governments, since 2015.\nThat these actions can now be taken for granted demonstrate just how much President Buhari has done to restore normalcy to the dealings between the tiers of Government.\n“There is no doubt that President Buhari has set a new standard for national-subnational government relations."
  },
  {
    "headline": "Africa and the challenge of development",
    "summarized_story": "There exists also new awareness that this challenge is by no means unique to Nigeria as a country but cuts across Africa.\nThis is further exacerbated by the fact that out of over 51 countries in Africa, only South Africa qualified as a member of BRICS, an acronym coined for an association of five major emerging national economies: Brazil, Russia, India, China and South Africa.\nThis worrying concern about how off-track Africa has gone in all facets of technological development and advancement recently came flooding during a conversation with C.N.\nFor a better understanding of this piece, let’s take a look at the Chinese development aid to Africa.\nGoing by reports, Chinese development aid to Africa comes to 47 per cent of its total foreign assistance in 2009 alone, and from 2000 to 2012 it funded 1,666 official assistance projects in 51 African countries."
  },
  {
    "headline": "Outbreak of new polio type 2 threatens Nigeria's free status",
    "summarized_story": "The Federal Government has raised concerns over the recent outbreak of vaccine-derived poliovirus type 2 (cVDPV2) in some parts of the country, just 11 months after being declared free of Wild Polio Virus (WPV) by the Africa Regional Certification Commission for polio eradication (ARCC).\nThe National Primary Health Care Development Agency, NPHCDA revealed this during a review meeting of the Northern Traditional Leaders Committee on Primary Health Care.\nDr Faisal said the outbreak could have been the result of the large number of children missed during the COVID-19 outbreak response.\nHe asked the traditional leaders to join the call for improved funding of Polio Outbreak Response Campaigns, stressing that donor support in that regard has continued to dwindle.\nWe will therefore be relying on your influence in advocating to Political leaders on the need to continue to fund Polio Outbreak Response campaigns."
  },
  {
    "headline": "Why we’ve not arrested ex-South African President, Zuma – Police",
    "summarized_story": "South Africa’s police have revealed why it is yet to make any move to arrest ex-president Jacob Zuma, who has been handed a 15-month jail term for contempt.\nDAILY POST had reported that Zuma was on Tuesday sentenced to 15 months in prison for contempt of court.\nFollowing the development, Zuma mounted a two-pronged last-ditch attempt to avoid the jail term given to him by the Constitutional Court, the country’s top judicial authority.\nHowever, the police, while giving reasons why the former President is yet to be arrested in a statement said they will pause on the order to arrest Zuma until he has fully exhausted his legal options.\nFormer South African President, Jacob Zuma reacts to 15-month jail term, blasts judge"
  },
  {
    "headline": "Kaduna sets up commission of inquiry over NLC strike",
    "summarized_story": "The Kaduna State Government on Tuesday established a Judicial Commission of Inquiry into the Nigerian Labour Congress (NLC) strike of May 2021, with Justice Ishaq Bello, a retired judge, as chairman.\nMr Muyiwa Adekeye, Special Adviser on Media and Communication to Governor Nasir El-Rufai, in a statement on Tuesday named Attorney-General of Cross River State, Eyo Ekpo, and Mrs Joan Jatau-Kadiya, ex-Attorney General of Kaduna State as members.\nAlso named is former Assistant General of NLC and Deputy National Secretary of the Nigerian Union of Journalists (NUJ), Chom Bagu.\nThe statement listed other members as: AVM Rabiu Dabo, Dr Nasirudeen Usman and Malam Mohammed Isah Aliyu.\nDetails later…Buhari suspends Hadiza Usman, approves panel to probe Nigerian Ports Authority"
  },
  {
    "headline": "BREAKING: ECOWAS Court fixes date to consolidate suits on Twitter ban in Nigeria",
    "summarized_story": "The Court of the Economic Community of West African States has fixed Friday, July 9, 2021, to consolidate suits against the Federal Government on the suspension of the microblogging platform, Twitter.\nThe date was fixed on Tuesday during a virtual sitting via zoom.\nTwo major applications were brought before the court after the suspension challenging the FG on violating the rights of Twitter users in Nigeria.\nAbdullahi Abubakar, a lawyer representing the Federal Government during the sitting, prayed for the leave of the court to consolidate the hearing of the applications.\nCourt sets date to deliver judgment in suit seeking to stop appointment of judges"
  },
  {
    "headline": "Proliferation of cooking gas dispense shops worries Akwa Ibom residents",
    "summarized_story": "Residents of Uyo, the Akwa Ibom State capital, have expressed concerns over the indiscriminate floating of cooking gas dispense shops in every nook and cranny of the metropolis and its environs.\nThe residents, who lamented that they are sitting on a keg of gunpowder, called on the state government and relevant agencies to closely monitor the activities of the gas vendors.\nHe said the call for clampdown was necessary given the inflammatory nature of gas especially in residential areas.\nAlso, one Unyime Akpan said, “we are gradually moving away from fossil fuel but my worry is the proliferation of these gas vendors in resident areas.\n“We have discovered in the course of our regular inspections that there could be a food outlet where open flame is used and beside it is a gas dispense shop."
  },
  {
    "headline": "PHOTOS: Tight security as synagogue holds tribute service for TB Joshua",
    "summarized_story": "Many studies have established that at least 1 out of 4 couples today struggle with one infertility problem or another,..."
  },
  {
    "headline": "BREAKING: Senate to pass N895bn supplementary budget Wednesday",
    "summarized_story": "By Sanni Onogu, AbujaThe Senate will Wednesday consider and pass the Federal Government’s N895.842billion supplementary budget, it was learnt on Tuesday.\nSenate President Ahmad Lawan, gave this indication during plenary after the Senate Committee on Appropriation laid its report on the Supplementary Appropriation Bill, 2021.\nThe consideration of the request from the Executive by the Senate is an indication that the supplementary budget would be passed tomorrow.\nSenator Barau in keeping with his request for time extension finally laid the report on the Supplementary Appropriation Bill, 2021, before the upper chamber during plenary on Tuesday.\nPresident Buhari had about two weeks ago transmitted a Supplementary Appropriation Bill for N895.842, 465,917 billion to the National Assembly for consideration and approval."
  },
  {
    "headline": "Rest in peace 44, Davido breaks silence seven days after aide’s death",
    "summarized_story": "By Gbenga BadaDavid ‘Davido’ Adeleke has broken his silence on the death of one of his aides, Habeeb Uthman aka Obama DMW.\nDavido broke his silence seven days in faraway Atlanta after the death of Obama DMW, where he has been with other members of the 30BG and DMW.\nADVERTISEMENTDavido, in a short video stepping out in Atlanta, said “R.I.P 44.”The Nation had reported that Obama DMW died of suspected heart failure on Tuesday, June 29, 2021, after he complained of breathing issues.\nMembers of the DMW and 30BG have been left in shambles over the death of Obama.\nReigning acts like Tiwa Savage have also been mourning the death of the late Obama."
  },
  {
    "headline": "Things you probably didn't know about RMD at 60",
    "summarized_story": "By Samuel OamenActor Richard Eyimofe Evans Mofe-Damijo popularly known as RMD, clocks 60 today.\nHere are things you should know about RMD at 60.\nMofe-Damijo was born in Aladja community of Udu Kingdom, near Warri, Delta State.\nHe attended Midwest College, Warri and Anglican Grammar School and was a member of the Drama Club.\nIn 1997 Mofe-Damijo enrolled to study law at the University of Lagos and graduated in 2004."
  },
  {
    "headline": "Anambra guber: Okonkwo asks supporters to await next line of action",
    "summarized_story": "First runner up at the primary election of the Peoples Democratic Party (PDP) held in Awka, Dr Obiora Okonkwo, has expressed his reservations about the poll.\nHe asked his teaming supporters to wait for the next line of action which would be disclosed to them soonest.\n“Obviously, there were a number of serious issues and irregularities regarding the primary election.\nEven with that, the list of the super delegates kept changing such that voting was unduly delayed after the first round of accreditation where 179 super delegates had been accredited.\n“The second round of accreditation, done after the list had been changed again and many super delegates removed from the initial list, and many new ones added, turned in 218 super delegates."
  },
  {
    "headline": "Passed PIB satanic, unjust, embarrassing -Clark",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaLeader of Pan-Niger Delta Forum (PANDEF), Chief Edwin Clark, has described the newly passed Petroleum Industry Bill (PIB) as satanic, unjust, embarrassing and dashing the hopes of Niger Delta people.\nThe two chambers of the National Assembly last week Thursday passed the PIB which seeks to introduce far-reaching reforms in the oil and gas industry, after about 13 years of legislative fireworks.\nThe bill was first sent to the National Assembly in 2008 by President Umaru Yar’Adua, now deceased, without translating into an Act.\nClark demanded that the bill as passed be reversed else the Niger Delta would take their destinies in their hands and deny International Oil Companies (IOCs) operations into the region.\n“We want to warn seriously, that the people of the Niger Delta have had enough of this colonial and oppressive mentality of our Northern brothers and friends."
  },
  {
    "headline": "Obasanjo denies forming new party ahead 2023",
    "summarized_story": "From Laide Raheem, AbeokutaFormer President Olusegun Obasanjo has denied the report that he was planning to form a new political party ahead of the 2023 general elections.\nThe statement indicated that Obasanjo was in Kabul, Afghanistan when the event attributed to him was reported.\nThe one who reported that may need to visit Yaba Left.\n“If anything, Chief Obasanjo’s political party today is the party of Nigerians facing insecurity, unemployment, hunger, poverty, and various other challenging issues.\nIt is the party of Nigeria that must be saved, kept wholesomely united in peace, security, equity, development and progress."
  },
  {
    "headline": "Ugwuanyi promotes sports development in rural areas",
    "summarized_story": "Ugwuanyi, represented by his Special Adviser on Project Development and Implementation (PDI), Engr.\nGovernor Ugwuanyi commended his Special Adviser on PDI, Engr.\nHe equally thanked the Chairman of Igbo-Eze North LGA, Engr.\nIn his speech, the Chairman of Igbo-Eze North LGA, Engr.\nItodo who reeled out the socio-economic and health benefits of the facility to the people of Igbo-Eze North LGA, stressed that governor’s decision to promote sporting activities in the rural areas is a welcome development."
  },
  {
    "headline": "Apply same speed used in arresting Kanu to end banditry, other crimes, Soyinka tells FG",
    "summarized_story": "Literary icon, Prof. Wole Soyinka, has said there would be an uproar in the country if the truth of how Indigenous People of Biafra (IPOB) leader, Nnamdi Kanu, was arrested was revealed.\nHe also challenged government to apply the swiftness and eagerness with which it arrested Kanu to go after bandits and insurgents.\n“The second issue, however, has to do with Kanu’s conduct outside the nation.\nHate rhetoric is an issue that can only be judged by the laws of any nation.\n“Was it right ‘to have been kidnapped?’ You can say intercepted as much as you want but I think Kanu was kidnapped."
  },
  {
    "headline": "CSOs Protest at N’Assembly, Demand INEC Independence, Inclusion of E-voting in Electoral Act",
    "summarized_story": "By Udora OrizuA Coalition of CSOs under the aegis of Alliance of Civil Society Organizations for Expression of Electoral and Democratic Space, has stormed the National Assembly, protesting exclusion of some provisions, such as electronic voting, financial autonomy for INEC, and protection of people with disabilities, in the new Electoral Act.\nThe aggrieved protesters were armed with placards, with inscriptions such as, “SaveOurElections #NigeriansDeserveFreeAndFairElection and so on.\nThe concerns raised by the CSOs followed the sudden emergence of a strange Section 50(2) in the new draft of the Bill, which completely outlaws transmission of votes by electronic means.\nThe Bill is expected to be passed this week by both Chambers of the National Assembly.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Afenifere, Ohanaeze, PANDEF Back Southern Govs’ Demand for Presidency",
    "summarized_story": "Rising from its second meeting held yesterday at the Lagos State Government House in Ikeja, the southern governors resolved that the next President of Nigeria should come from the southern region.\nThe southern governors also kicked against the proposed 30 per cent share of profit for the exploration of oil and gas in the basins.\nMeanwhile, the Yoruba Ronu Leadership Forum has thrown its weight behind yesterday’s resolutions of the southern governors.\nAfenifere, Ohanaeze Back Govs’ DemandsReacting to the governors’ demands, Afenifere, yesterday said since the North would have ruled consecutively for eight years by 2023, the next president would come from the South.\nKen Robinson, in a reaction, expressed happiness that the Southern governors met again, less than two months, after their historic Asaba meeting, to further accentuate the wishes and aspirations of the people of Southern Nigeria."
  },
  {
    "headline": "Emefiele Seeks Varsities’ Partnership to Develop Entrepreneurship",
    "summarized_story": "According to him, since the introduction of the Youth Entrepreneurship Development Fund (YEDP), one of the bank’s development finance initiatives, there has been limited access by fresh school leavers.\n“Given population growth and the increasing number of graduates, we need to begin to see how SMEs can be incorporated and supported.\n“Closing from this lecture today, we would be writing to all universities, to begin to conduct some kind of entrepreneurship development competition programme.\nEmefiele urged governments at all levels and the private sector to provide more support in addressing the challenges of SMEs.\n“We cannot always build the future for our youths, but we can build our youths for the future,” he said."
  },
  {
    "headline": "Southern Govs Say Next President Must Come from South, Reject 3% Allocated to Host Communities in PIB",
    "summarized_story": "By Vanessa ObiohaFor the first time, Southern Nigerian governors have demanded that the next president should come from the South.\nArising from the meeting of their Forum in Lagos, the governors reiterated their commitment to the unity of Nigeria on the pillars of equity, fairness, justice, progress, and peaceful coexistence between and amongst its people.\nThe Forum also rejects the proposed 30% share of profit for the exploration of oil and gas in the basins,” as well as the ownership structure of the proposed Nigeria National Petroleum Company Limited (NNPC).\nOf the 17 southern governors, only Cross River and Anambra State governors were absent.\nThe governors also agreed that Lagos State will be its permanent secretariat."
  },
  {
    "headline": "Breaking: Southern Govs Say South Must Produce Next President",
    "summarized_story": "Southern Governors rose from their meeting held at the Lagos House, Ikeja Monday and resolved that the next president of Nigeria must come from the southern part of the country.\nThey also insisted that all southern states must promulgate anti-open grazing law by September 1, 2021.\nThey rejected the 3 percent proposed by the Petroleum Industry Bill and approved by the National Assembly for host communities, and asked that it should be increased to at least 5 percent.\nWhile reiterating their call for the creation of states, the governors said that when security agents come for any high profile operation in any state, the chief security officer must be informed.\nMore details later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "BREAKING: Bandits Attack Secondary School In Kaduna, Abduct Many Students",
    "summarized_story": "Gunmen suspected to be bandits have abducted many students of Bethel Baptist School located in Maraban Rido, Chikun Local Government Area of Kaduna state.\nThe development comes just hours after bandits abducted babies, female nurses and security guards from the residential quarters of the National Tuberculosis and Leprosy Centre (NTLC) in Zaria, Kaduna State on Sunday.\nSaharaReporters gathered that the bandits invaded the school at about 2am on Monday shooting sporadically into the air before kidnapping the students.\nOn March 12, bandits also abducted 39 students of the Federal College of Forestry Mechanization, Afaka in Igabi Local Government Area of Kaduna State.\nIn February 2021, gunmen struck the Government Secondary School in Kagara, Niger State, abducting school pupils, teachers and workers."
  },
  {
    "headline": "BREAKING: Bandits Attack Secondary School In Kaduna, Abduct Many Students",
    "summarized_story": "Gunmen suspected to be bandits have abducted many students of Bethel Baptist School located in Maraban Rido, Chikun Local Government Area of Kaduna state.\nThe development comes just hours after bandits abducted babies, female nurses and security guards from the residential quarters of the National Tuberculosis and Leprosy Centre (NTLC) in Zaria, Kaduna State on Sunday.\nSaharaReporters gathered that the bandits invaded the school at about 2am on Monday shooting sporadically into the air before kidnapping the students.\nOn March 12, bandits also abducted 39 students of the Federal College of Forestry Mechanization, Afaka in Igabi Local Government Area of Kaduna State.\nIn February 2021, gunmen struck the Government Secondary School in Kagara, Niger State, abducting school pupils, teachers and workers."
  },
  {
    "headline": "Alleged Defamatory Publication: US Court Sanctions Mountain Of Fire Founder, Daniel Olukoya For Misleading Court, Orders Him To Pay $7,320 To Sowore's Legal Counsel",
    "summarized_story": "SaharaReporters had earlier reported how the UK Charity Commission appointed an interim manager for the MFM in August 2019.\nThe UK charity regulator claimed it had serious concerns over MFM Chair of Trustees, Dr Daniel Olukoya, and his handling of serious incidents.\nAdmit that no member of the Mountain of Fire and Miracles church resigned from the Mountain of Fire and Miracles church due to the publication of the Challenged Statements.\nAdmit that Mountain of Fire and Miracles Ministries maintains a website that provides information about its ministry to the public.\nAdmit that Mountain of Fire and Miracles Ministries maintains a YouTube page that airs Plaintiff Daniel Olukoya’s sermons."
  },
  {
    "headline": "Alleged Defamatory Publication: US Court Sanctions Mountain Of Fire Founder, Daniel Olukoya For Misleading Court, Orders Him To Pay $7,320 To Sowore's Legal Counsel",
    "summarized_story": "SaharaReporters had earlier reported how the UK Charity Commission appointed an interim manager for the MFM in August 2019.\nThe UK charity regulator claimed it had serious concerns over MFM Chair of Trustees, Dr Daniel Olukoya, and his handling of serious incidents.\nAdmit that no member of the Mountain of Fire and Miracles church resigned from the Mountain of Fire and Miracles church due to the publication of the Challenged Statements.\nAdmit that Mountain of Fire and Miracles Ministries maintains a website that provides information about its ministry to the public.\nAdmit that Mountain of Fire and Miracles Ministries maintains a YouTube page that airs Plaintiff Daniel Olukoya’s sermons."
  },
  {
    "headline": "Activists Storm National Assembly, Resist Proposed Plan To Ban Electronic Transmission Of Election Results",
    "summarized_story": "Some Nigerians, on Tuesday, have rejected attempts to surreptitiously remove electronic transmission of results in the draft of the Electoral Act (Amendment) Bill 2021 by the Senate Committee on Independent National Electoral Commission (INEC).\n“Lawan and Gbajabiamila, you are the heads of the National Assembly, be heads, stop being tails, the legislative arm of government is an arm on its own, there is separation of powers, there is independence, stop doing 'boy boy'.\n“At the end of the day, this country belongs to all of us, and no Nigerian is more Nigerian than any Nigerian, no matter whether you are the executive, legislature or in the judiciary.\nOn Sunday, the National Assembly reportedly blocked the proposed electronic transmission of election results in Nigeria.\nThe lawmakers are set to pass the electoral act amendment bill, but the amendment dashes the hopes of key reforms that would come with the proposed law, according to a copy of the final bill."
  },
  {
    "headline": "PIB: Senate constitutes conference committee",
    "summarized_story": "Senate President Ahmad Lawan has named a seven-member committee to harmonise the different versions of the Petroleum Industry Bill (PIB) passed by the national assembly last week.\nThe committee will be chaired by Yahaya Abdullahi, senate majority leader, other members are Mohammed Sabo, Albert Bassey Akpan, Danjuma Goje, Opeyemi Bamidele, Stella Oduah Gabriel Suswam.\nLawan asked the committee to meet with their counterparts in the house of representatives to have the final documentation of the bill for the president’s assent.\nAdvertisement“The conference committee will meet with our counterparts in the House, the House will also announce the composition of the conference committee, and we hope that they will swing into action immediately, so that we are able to have the final document of the PIB which we will transmit for the presidential assent,” he said.\n“So, we expect our delegation here under the leadership of the Senate Leader to engage with our colleagues in the House of Representatives.”"
  },
  {
    "headline": "PIB: Senate constitutes conference committee",
    "summarized_story": "Senate President Ahmad Lawan has named a seven-member committee to harmonise the different versions of the Petroleum Industry Bill (PIB) passed by the national assembly last week.\nThe committee will be chaired by Yahaya Abdullahi, senate majority leader, other members are Mohammed Sabo, Albert Bassey Akpan, Danjuma Goje, Opeyemi Bamidele, Stella Oduah Gabriel Suswam.\nLawan asked the committee to meet with their counterparts in the house of representatives to have the final documentation of the bill for the president’s assent.\nAdvertisement“The conference committee will meet with our counterparts in the House, the House will also announce the composition of the conference committee, and we hope that they will swing into action immediately, so that we are able to have the final document of the PIB which we will transmit for the presidential assent,” he said.\n“So, we expect our delegation here under the leadership of the Senate Leader to engage with our colleagues in the House of Representatives.”"
  },
  {
    "headline": "Court remands Ojerinde, ex-JAMB registrar, in prison over ‘N900m fraud’",
    "summarized_story": "A federal high court in Abuja has ordered the remand of Adedibu Ojerinde, former registrar of the Joint Admission and Matriculation Board (JAMB), in prison custody.\nAdvertisementThe Independent Corrupt Practices and Other Related Offences Commission (ICPC) arraigned Ojerinde on Tuesday in a suit marked: FHC/ABJ/CR/97/2021, on an 18-count charge bordering on misappropriation of funds to the tune of N900 million.\nThe commission alleged that the former registrar committed multiple frauds while heading JAMB and the National Examination Council (NECO).\nAdvertisementPeter Olorunnishola, defendant counsel, subsequently informed the court about a bail application he filed and served on the prosecution.\nAdvertisementIn a ruling, Obiora Egwuatu, the judge, ordered that Ojerinde be kept in a correctional facility pending the hearing of his bail application, scheduled for Thursday."
  },
  {
    "headline": "Court remands Ojerinde, ex-JAMB registrar, in prison over ‘N900m fraud’",
    "summarized_story": "A federal high court in Abuja has ordered the remand of Adedibu Ojerinde, former registrar of the Joint Admission and Matriculation Board (JAMB), in prison custody.\nAdvertisementThe Independent Corrupt Practices and Other Related Offences Commission (ICPC) arraigned Ojerinde on Tuesday in a suit marked: FHC/ABJ/CR/97/2021, on an 18-count charge bordering on misappropriation of funds to the tune of N900 million.\nThe commission alleged that the former registrar committed multiple frauds while heading JAMB and the National Examination Council (NECO).\nAdvertisementPeter Olorunnishola, defendant counsel, subsequently informed the court about a bail application he filed and served on the prosecution.\nAdvertisementIn a ruling, Obiora Egwuatu, the judge, ordered that Ojerinde be kept in a correctional facility pending the hearing of his bail application, scheduled for Thursday."
  },
  {
    "headline": "Oil inches towards $80 after OPEC+ calls off output talks",
    "summarized_story": "Oil prices continued an upward trend after talks collapsed among ministers from OPEC+ — consisting of the Organisation of the Petroleum Exporting Countries and allies.\nAdvertisementThe OPEC+ talks were abandoned with no new date fixed for the meeting.\nThe rise in crude oil price will result in increased revenue for Nigeria which depends largely on earnings from oil to to finance its budget.\nThe N13.588 trillion 2021 budget signed into law by President Muhammadu Buhari on December 31, 2020, has a benchmark oil price of $40 per barrel.\nGoldman Sachs, a US investment bank and financial services company, had earlier projected that oil prices will rebound to $75 by the third quarter of 2021."
  },
  {
    "headline": "What telcos and banks look for in fintech partnerships",
    "summarized_story": "Fintech is growing in Africa thanks to strategic partnerships between startups, banks and diverse categories of global companies.\nIn a distribution model, a digital-only bank (say Kuda) partners with traditional banks to offer in-branch deposits, ATM withdrawals and card issuance.\nBut partnerships don’t automatically work just because two parties have good intentions or similar ambitions.\nAs CEO of Sterling Bank, Suleiman receives partnership offers regularly and believes himself open to having many conversations.\nAnd so he wishes to encourage an approach that frames partnerships in terms of capabilities, not institutions."
  },
  {
    "headline": "Tolu Michaels on how digital entrepreneurs create and sell intangible products online",
    "summarized_story": "Your business can either deal with offering physical products for sale online or providing a service online.\nI didn’t have the capital to sell physical products so I needed something I could provide people in whatever location I am,” she tells me on our Google Meet call.\nLeveraging knowledge commerceDigital products are basically online products that can’t be held, touched, or tasted.\nThis will allow the right people and the right opportunities to be attracted to you.”In the initial stage of her digital career, Michaels picked up new skills including a degree on Disruptive Strategy from Harvard Business school.\nOne would think LinkedIn could have been at the forefront of this process but, she says, in selling digital products, entrepreneurs should have their profiles on all social media platforms and utilise each platform fully."
  },
  {
    "headline": "Product partnership managers are obsessed with a product’s life cycle",
    "summarized_story": "While product managers are responsible for hand holding a product from conception to maturity, product and partnership managers go a step further by exposing the product to valuable collaborations.\nIn your years of experience working as a product partnership manager, have you ever experienced the death of a product?\nProdpad is a great resource for aspiring product partnership managers — they have a great blog and also offer online courses.\nProduct partnership managers have to be extremely patient people.\nWhat are some of the challenges product partnership managers face on the job?"
  },
  {
    "headline": "The Next Wave: Elsa Majimbo, cut soap for us",
    "summarized_story": "This edition of Next Wave will explore the current state of Africa’s creator economy and speak into the future of video-creating and sharing platforms on the continent.\nPARTNER MESSAGEThe Flutterwave Mobile app, the app that turns any smartphone into a mobile POS is now redefining commerce.\nLike most startups with an eye for the creator economy, Minly launched late last year during the thick of the COVID pandemic.\nFollow TechCabal on Twitter, Instagram, Facebook, and LinkedIn to stay engaged in our real-time conversations on tech and innovation in Africa.\n– Koromone Koroye, Managing Editor, TechCabal Share this newsletter Share Share Sign up for The Next Waveby TechCabal Sign me up"
  },
  {
    "headline": "9 trends to watch as aircraft return to the skies after COVID-19",
    "summarized_story": "9 trends to watch as aircraft return to the skies after COVID-19As more aircraft return to the skies post COVID-19, there are unique challenges airlines and airports face as they restart operations – ranging from “rusty” pilots to insect infestations.\nA new report from aviation insurer, Allianz Global Corporate & Specialty (AGCS), identifies a number of ways in which COVID-19 is reshaping the aviation sector, driving…"
  },
  {
    "headline": "Kuwait’s $700bn future generation fund mocks Nigeria’s bleak plan",
    "summarized_story": "In Kuwait, the government is toiling endlessly to protect its unborn generation by either maximising potentials in the oil sector or reducing aggregate risk to the oil price.\nBut Nigeria is yet to come to terms with the reality of a post-oil economy as she lives as though the demand for black gold will be…Don’t miss another story Become a BusinessDay Subscriber today.\nFor insights, facts, figures, and access to opportunities.\nOptions starting from N1000 Monthly Subscribe Now Already a subsriber?"
  },
  {
    "headline": "Market dynamics change demand for luxury residential real estate",
    "summarized_story": "For developers of luxury residential real estate, good times are underway as market dynamics have changed demand in that sub-market with growing investment interest coming from ultra-high net worth individuals (UHNWIs).\nResidential real estate investment is establishing itself as a global real estate asset class, according to this year’s Attitudes Survey conducted by Knight Frank.\nRead Also: Residential real estate offers investment opportunities amid weak Q2’21 outlookThis is coming as an aftermath of the COVID-19 pandemic, which has had significant lifestyle changes in work, home and play.\n“The high-end luxury property market in Nigeria has, however, experienced a glut, with vacancy rate averaging 40 percent at highbrow locations in Lagos and Abuja.\nThese became major occupiers of luxury market in the country, but economic sentiment and unfavourable policies have largely affected that market in recent times."
  },
  {
    "headline": "Edo Refinery: Plant to source crude from Escravos line – Obaseki – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has said the Edo Modular Refinery being developed by Edo Refinery and Petrochemical Company Limited (ERPC) with support from the state government, in Ologbo, Ikpoba – Okha Local Government Area, will source crude for processing from the Escravos Line.\nThe governor, who spoke during a recent inspection of the facility, said the crude sales agreement is being finalized in readiness for production, which is scheduled to begin in August this year.\n“What we have left now is to finalise the crude oil sales contract; these facilities have to get a certain type of crude from the Escravos line and that is being finalized.\nThe 6000bpd Edo Modular refinery is an initiative of the Governor Godwin Obaseki-led administration, which was facilitated with the release of N700 million as renewable preference shares in the Edo Refinery and Petrochemical Company.\nThe major products to be sold are Diesel, Naphtha and Low Pour Fuel Oil (LPFO) and work is ongoing to expand the plant to refine 20,000bpd."
  },
  {
    "headline": "IGR: Edo govt tasks MDAs on automation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has tasked Ministries, Departments and Agencies (MDAs) to key into the automated Internally Generated Revenue (IGR) system now operational in the state.\nThe charge was given by the Head of Service, Anthony Okungbowa Esq, at a two-day training workshop on Electronic Treasury Receipt and MDA Certificate Approval, organized by the Edo State Internal Revenue Service (EIRS) for Permanent Secretaries, Directors and Heads of Revenue drawn from various MDAs in Edo State.\nExecutive Chairman Edo State Internal Revenue Service, (EIRS), Igbinidu Inneh said the system was conceived to enable government to electronically track transactions with individuals and organizations, particularly as it relates to government applications and approvals.\nHe noted that this was to ensure that officials of government comply with the relevant tax laws to avoid being sanctioned.\nOther benefits of the electronic treasury receipts and MDA certificate approvals include the issuance of verifiable electronic documents, as well as realtime reporting of all MDA transactions, amongst others."
  },
  {
    "headline": "Gun men kill Police Escort, Driver Of APC Chieftain In Delta – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – A gang of yet to be identified gunmen on Sunday morning, killed a mobile police escort and driver of All Progressive Congress (APC), Chief Michael Johnny at the ever busy Airport Junction in Uvwie Local Government Area of Delta state.\nThe deceased mobile police identified as Inspector Samuel Arigbanmigha and the deceased driver Stephen Okhea were said be on official duty to escort their boss’s wife, Mrs. Johnny to church when the incident occurred.\nNigerian Observer, gathered that , they had dropped Mrs. Johnny off at the church and were on their way to run another errand when they were accosted at about 11;12am by their assailants who trailed after them in a yellow Lexus Jeep.\nThe deceased policeman and driver according witnesses at the crime scene , were accosted and reportedly shot at a close range on the head and stomach , killing the duo instantly.\nDivisional Police Officer (DPO), Enerhen Division, CSP Mukhtari Bello, led his men to the conduct preliminary investigations on the incident."
  },
  {
    "headline": "Acquire skills and attitudes, EdoJobs MD admonishes youths – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Managing Director of Edo State Skills Development Agency also known as EdoJobs, Hon.\nMrs. Ukinebo Dare has admonished youths seeking employment to discard the notion that their educational qualifications alone will give them employment in the job market.\nShe also used the occasion to tell the youths and job seekers in Edo state about EdoJobs which specializes in job opportunities, trainings, career development among others.\nDare urged the youths to maximize the opportunities the Agency provides as they are: “the ones to transform their circumstances”.\nShe noted that the opportunities provided by EdoJobs can be assessed by everybody resident in Edo State."
  },
  {
    "headline": "Alleged N900m Fraud: Court denies ex-JAMB registrar, Ojerinde, bail",
    "summarized_story": "The trial judge, Obiora Egwuatu, turned down the oral application for bail by defence counsel, P.O Olorunishola, a Senior Advocate of Nigeria.\nThe former chief executive officer of JAMB is the sole defendant in the suit marked: FHC/ABJ/CR/97/21 bordering on alleged misappropriation of about N900 million.\nArrestPREMIUM TIMES reported in March how the ICPC arrested Mr Ojerinde.\nA statement posted on the commission’s website said then that Mr Ojerinde was arrested and being held on a remand warrant for allegedly misappropriating N900 million.\nIt added that Mr Ojerinde allegedly perpetrated the fraud as JAMB registrar from April 10, 2012 to August 1, 2016, and the Registrar of the National Examination Council (NECO) between 1999 and 2007."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Troops Capture 2 Terrorists’ Logistics Suppliers",
    "summarized_story": "The Nigerian Army troops operating in the North-East theatre captured two Boko Haram Terrorists’ logistics suppliers in Borno State and recovered petroleum products and sex enhancement drugs from them.\n“The troops equally recovered large quantity of psychedelic and sex enhancement drugs, pesticides and insecticides, as well as foodstuff, amongst others,” he added.\nHe said the troops combed the entire area, destroying several identified terrorist camps.\nThe Army spokesman said during the operation, troops also intercepted terrorists at Labe village.\nThe Chief of Army Staff, Major General Faruk Yahaya, who commended the alertness of the troops, further urged them to sustain the aggressive posture of the operation, to ensure they clear terrorists’ enclaves and dominate the general area."
  },
  {
    "headline": "Troops Capture 2 Terrorists’ Logistics Suppliers",
    "summarized_story": "The Nigerian Army troops operating in the North-East theatre captured two Boko Haram Terrorists’ logistics suppliers in Borno State and recovered petroleum products and sex enhancement drugs from them.\n“The troops equally recovered large quantity of psychedelic and sex enhancement drugs, pesticides and insecticides, as well as foodstuff, amongst others,” he added.\nHe said the troops combed the entire area, destroying several identified terrorist camps.\nThe Army spokesman said during the operation, troops also intercepted terrorists at Labe village.\nThe Chief of Army Staff, Major General Faruk Yahaya, who commended the alertness of the troops, further urged them to sustain the aggressive posture of the operation, to ensure they clear terrorists’ enclaves and dominate the general area."
  },
  {
    "headline": "Green Energy Expands CSR, Signs New MoU With Host Community",
    "summarized_story": "Green Energy International Limited (GEIL), a leading oil and gas development company and the operator of the Otakikpo marginal field has successfully negotiated and signed a new ‘’Memorandum of Understanding’’ (MoU) with one of its host community; The Ikuru Town Community.\nThe MOU signing ceremony which took place on July 1, 2021 was witnessed and endorsed by the Rivers State Government representatives, from the Ministry of Chieftaincy Affairs and Community Development.\nThe MoU encompasses improved governance and administrative components that would support the delivery of development outcomes in target communities, reduce youth restiveness and promote inclusion of women and vulnerable groups.\nThe 5-year MoU covers a comprehensive operational structure that identifies key stakeholders who will act as sustainability drivers that would support Ikuru Town community to plan and undertake implementation of projects based on their development priorities and agenda; an approach that is yielding noticeable improvement in the social performance indices.\nAdegbulugbe added that the Company’s future expansion programs are anchored on sustaining a conducive and mutually beneficial relationship with its host community."
  },
  {
    "headline": "Green Energy Expands CSR, Signs New MoU With Host Community",
    "summarized_story": "Green Energy International Limited (GEIL), a leading oil and gas development company and the operator of the Otakikpo marginal field has successfully negotiated and signed a new ‘’Memorandum of Understanding’’ (MoU) with one of its host community; The Ikuru Town Community.\nThe MOU signing ceremony which took place on July 1, 2021 was witnessed and endorsed by the Rivers State Government representatives, from the Ministry of Chieftaincy Affairs and Community Development.\nThe MoU encompasses improved governance and administrative components that would support the delivery of development outcomes in target communities, reduce youth restiveness and promote inclusion of women and vulnerable groups.\nThe 5-year MoU covers a comprehensive operational structure that identifies key stakeholders who will act as sustainability drivers that would support Ikuru Town community to plan and undertake implementation of projects based on their development priorities and agenda; an approach that is yielding noticeable improvement in the social performance indices.\nAdegbulugbe added that the Company’s future expansion programs are anchored on sustaining a conducive and mutually beneficial relationship with its host community."
  },
  {
    "headline": "Senate To Consider 2021 Supplementary Budget Wednesday",
    "summarized_story": "President of the Senate, Ahmad Lawan, has said that the upper chamber will tomorrow Wednesday consider President Muhammadu Buhari’s N895.842 billion supplementary budget request.\nLawan made the disclosure on Tuesday during plenary after the Senate received the report of the Committee on Appropriation on the Supplementary Appropriation Bill, 2021.\nThe consideration of the request from the Executive by the Senate is an indication that the supplementary budget would be passed tomorrow.\nSenator Jibrin in keeping with his request for time extension, finally laid the report on the supplementary Appropriation Bill, 2021, before the upper chamber during plenary on Tuesday.\nPresident Buhari about two weeks ago transmitted a supplementary Appropriation Bill for N895.842,465,917 billion naira to the National Assembly for consideration and approval."
  },
  {
    "headline": "Twitter ban: ECOWAS Court fixes July 9 to consolidate suits",
    "summarized_story": "The Community Court of the Economic Community of West African States has fixed July 9, 2021, to decide on the consolidation of all applications before the court on the Twitter ban by the Federal Government of Nigeria.\nThe ECOWAS Court stated this in a virtual court sitting held via zoom on Tuesday.\nOn the cause list for the day, were two applications against the Federal Government over the Twitter ban.\nThe lawyer representing the Federal Government, Abdullahi Abubakar, informed the court that he has a motion to consolidate all the four applications before the court on the Twitter ban issue.\nThe ECOWAS Court stated that the parties of the other two cases, which were marked as ECW/CCJ/APP/24/21 and ECW/CCJ/APP/26/21, and sought to be consolidated were not in court."
  },
  {
    "headline": "Twitter ban: ECOWAS Court fixes July 9 to consolidate suits",
    "summarized_story": "The Community Court of the Economic Community of West African States has fixed July 9, 2021, to decide on the consolidation of all applications before the court on the Twitter ban by the Federal Government of Nigeria.\nThe ECOWAS Court stated this in a virtual court sitting held via zoom on Tuesday.\nOn the cause list for the day, were two applications against the Federal Government over the Twitter ban.\nThe lawyer representing the Federal Government, Abdullahi Abubakar, informed the court that he has a motion to consolidate all the four applications before the court on the Twitter ban issue.\nThe ECOWAS Court stated that the parties of the other two cases, which were marked as ECW/CCJ/APP/24/21 and ECW/CCJ/APP/26/21, and sought to be consolidated were not in court."
  },
  {
    "headline": "‘Oko Iyabo’ movie: Iyabo Ojo, Tonto Dikeh berate Yomi Fabiyi",
    "summarized_story": "Nollywood actresses, Iyabo Ojo and Tonto Dikeh, have slammed Yomi Fabiyi on his new movie, ‘Oko Iyabo’.\nThe minor in the case is the foster daughter of comedienne, Princess, and actresses like Iyabo Ojo and Nkechi Blessing had spoken in support of the minor.\nHowever, Yomi Fabiyi took sides with Baba Ijesha during the case and released the movie a few days after Baba Ijesha was released on bail.\nNigerians on social media had slammed Fabiyi for creating such a movie and for using the names ‘Princess’ and ‘Iyabo’ to depict the real-life situation.\n“It is no longer news that Yomi Fabiyi just released a movie, titled, ‘Oko Iyabo’ that portrayed a young girl with the mischievous career goal to be a prostitute."
  },
  {
    "headline": "‘Oko Iyabo’ movie: Iyabo Ojo, Tonto Dikeh berate Yomi Fabiyi",
    "summarized_story": "Nollywood actresses, Iyabo Ojo and Tonto Dikeh, have slammed Yomi Fabiyi on his new movie, ‘Oko Iyabo’.\nThe minor in the case is the foster daughter of comedienne, Princess, and actresses like Iyabo Ojo and Nkechi Blessing had spoken in support of the minor.\nHowever, Yomi Fabiyi took sides with Baba Ijesha during the case and released the movie a few days after Baba Ijesha was released on bail.\nNigerians on social media had slammed Fabiyi for creating such a movie and for using the names ‘Princess’ and ‘Iyabo’ to depict the real-life situation.\n“It is no longer news that Yomi Fabiyi just released a movie, titled, ‘Oko Iyabo’ that portrayed a young girl with the mischievous career goal to be a prostitute."
  },
  {
    "headline": "Updated: Synagogue Church speaks on fire incident",
    "summarized_story": "By AbankulaThe fire that engulfed part of the Synagogue Church of All Nations Monday night was caused by an electrical spark.\nA statement issued by the Church today said the fire occurred at a store within the complex.\nThe fire occurred during a candlelight procession that kicked off the weeklong funeral rites for the founder of the church, Prophet TB Joshua.\n“In the late evening of Monday 5th July 2021, there was a minor electrical fire incident at a store house within The Synagogue, Church Of All Nations (SCOAN) complex.\nOver 5,000 followers of TB Joshua from all over the world took part in the candlelight procession."
  },
  {
    "headline": "Senate to consider Buhari’s N895.8bn supplementary budget request Wednesday",
    "summarized_story": "President of the Senate, Ahmad Lawan, has said that the upper chamber will tomorrow consider President Muhammadu Buhari’s N895.842 billion supplementary budget request.\nLawan made the disclosure on Tuesday during plenary after the Senate received the report of the Committee on Appropriation on the Supplementary Appropriation Bill, 2021.\nThe consideration of the request from the Executive by the Senate is an indication that the supplementary budget would be passed tomorrow.\nSenator Jibrin in keeping with his request for time extension, finally laid the report on the supplementary Appropriation Bill, 2021, before the upper chamber during plenary on Tuesday.\nPresident Buhari about two weeks ago transmitted a supplementary Appropriation Bill for N895.842,465,917 billion naira to the National Assembly for consideration and approval."
  },
  {
    "headline": "Nigeria loses N4.5T to oil thieves, suffers 4,919 oil spills",
    "summarized_story": "Nigeria recorded 4,919 oil spills between 2015 to March 2021 and lost N4.5 trillion to oil theft in four years, Minister of environment, Dr Mohammad Abubakar said.\n“According to the National Oil Spill Detection Agency (NOSDRA) data, the total number of oil spills recorded from 2015 to March 2021 was 4,919, the number of oil spills cost by collation is 308.\n“The operational maintenance is 106, while sabotage is 3,628 and yet to be determined 70, giving the total number of oil spills on the environment to 235,206 barrels of oil.\n“Several statistics have emphasised Nigeria as the most notorious country in the world for oil spills, losing roughly 400,000 barrels per day.\nHe, therefore, recommended increasing awareness creation on the negative consequences of vandalism of oil facilities and other illegal activities."
  },
  {
    "headline": "Bandits Kill Nigerian Army Commanding Officer On Highway While Returning To Family",
    "summarized_story": "On Saturday, bandits killed Major MS Samaila, a soldier traveling on the Kano-Maiduguri Road.\nBefore his death, Samaila was the AG Commanding Officer of the 196 Amphibious Battalion in Abia State’s Isiala Ngwa area.\nAccording to reports, the deceased was returning home to his family from his station in Abia state when the terrible tragedy occurred.\n“This is Major Samaila of the 145 billion OC in Isialagwa Abia state,” he stated.\nBefore he died, his unit was Abia State."
  },
  {
    "headline": "BREAKING: Former JAMB Registrar, Ojerinde Remanded In Prison Over N5.2b Fraud",
    "summarized_story": "Professor Adedibu Ojerinde, the former Registrar of the Joint Admission and Matriculation Board (JAMB), has been remanded in custody by a Federal High Court in Abuja for suspected N5.2 billion fraud.\nIn a judgement issued on Tuesday, Justice Obiora Egwuatu ordered that Ojerinde be held in a detention facility until his bail application is heard on July 8.\nAccording to the prosecuting body, the Independent Corrupt Practices and Other Related Offenses Commission (ICPC), Ojerinde committed the alleged offenses between 2003 to 2021 while serving as the Registrar of the National Examination Council (NECO).\nFollowing that, his lawyer, Peter Olorunnishola (SAN), notified the court of a bail application he had submitted and served on the prosecution.\nOlorunnishola, on the other hand, requested more time to respond to the counter-affidavit filed by the prosecution’s counsel, Ebenezer Shogunle, which the defence lawyer said was delivered late."
  },
  {
    "headline": "TB Joshua’s Funeral To Hold Despite Church’s Fire Outbreak — Synagogue",
    "summarized_story": "Despite a fire incident at the Synagogue Church of All Nations on Monday, the funeral of its later founder, Prophet Temitope Joshua, also known as T.B.\nA fire gutted a storehouse on the church’s premises around 11 p.m. on Monday, according to NEWS DIRECT.\nThe fire broke out on the night of the candle procession in honor of the Church’s late founder, Prophet Temitope Joshua, also known as T.B.\nIn a statement release, the church stated that there was no need for concern and that TB Joshua’s funeral will go as planned.\nWe assure the general public that there is no cause for alarm and the services celebrating the life and legacy of Prophet TB Joshua will continue as scheduled.”"
  },
  {
    "headline": "Nigerian Pastor Releases ‘Shocking’ Prophecies About Nnamdi Kanu, IPOB",
    "summarized_story": "On Tuesday, Olatobiloba Peters, Senior Pastor of Divine Mercy Church, urged Nigerians should pray for Nnamdi Kanu, the leader of the Indigenous People of Biafra, IPOB.\nPastor Peters stated that the IPOB leader may not make it out of his current dilemma alive because “I see Kanu in a coffin.”If Kanu dies while in captivity, Kanu’s gang and followers, according to the cleric, will declare war on the president.\nI envision Nnamdi Kanu in a casket, and I believe he will not survive his current situation.\nSpeaking with DAILY POST, he said: “I see his followers declaring war on the president and Nigerians as vengeance.\nThe IPOB leader was re-arrested before the Federal High Court in Abuja, presided by Justice Binta Nyako, to continue his trial."
  },
  {
    "headline": "Sojoji sun kama kayayyakin Boko Haram a Barno",
    "summarized_story": ""
  },
  {
    "headline": "Za a yi wa Magu ƙarin girma duk da mummunan rahoton da kwamitin Salami ya shirya a kansa",
    "summarized_story": ""
  },
  {
    "headline": "Gwamnati za ta shigar da ƙarin yara miliyan 5 a shirin ciyar da ‘yan makaranta kafin 2023, inji Minista",
    "summarized_story": ""
  },
  {
    "headline": "Waiwaye: Allah Ya kama ni idan na koma APC, cewar Matawalle a 2019",
    "summarized_story": ""
  },
  {
    "headline": "GOC 7 Division commends troops’ fighting spirit, resilience, gallantry -NigPilot",
    "summarized_story": "Gen Eyitayo lauded the troops during a maiden operational tour of 24 Task Force Brigades, Dikwa, and Special Intervention Battalion IV, as well as Mobile Strike Team 16 collocated in New Marte.\nHe commended troops’ high level of alertness and undampened fighting spirit in recent encounters with elements of Boko Haram terrorists (BHTs) and Islamic State West Africa Province (ISWAP).\nThe GOC urged the troops to sustain the momentum and ensure that remnant of the terrorists is completely neutralized.\nGeneral Eyitayo told the troops, that his visit was necessitated by the need to evaluate and address security and operational challenges, as well as issues bordering on the welfare of the troops.\nDuring the visit, the GOC inspected a large cache of arms, ammunition, and Gun trucks captured from neutralized terrorists."
  },
  {
    "headline": "MHWUN passes vote of confidence on HRM Biobelemoye -NigPilot",
    "summarized_story": "Josiah challenged staff not to hoard any information from the incoming acting Secretary-General, to enable him quickly understand the workings of his new office.\nThe Royal Father also reminded the administrative staff to render the same support extended to Late Silas Adamu to the new Acting Secretary-General, to perform his duties optimally.\nHe recalled the relentless commitment of the Late MHWU Secretary-General, Silas Adamu, and charged the new Acting Secretary-General to ensure bureaucracy is seemless in memory of his predecessor.\nAuwolu Kiawa’s Appointment, Follows the Sudden Demise of MHWUN Secretary-General, Mr. Silas Adamu, in a ghastly autocrash along Abuja- Kaduna Expressway, on 8th of March 2021.\nLate silas Adamu who died along with his wife and daughter has since been buried."
  },
  {
    "headline": "Lock-up Capital in Land breeds huge economic loss – SGoF -NigPilot",
    "summarized_story": "The Surveyor General of the Federation (SGoF), Surv Samuel Adeniran Taiwo said that Nigeria has suffered huge economic loss because of lock-up capital in land resulting from ineffective land administration, improper land use, and property management.\nHe noted that the theme of the conference, “Unlocking Real Estate Potentials for Economic Development” was timely and inspiring.\nHe added that there was no gainsaying the fact that land remained a major resource of any type of physical development, impacting heavily on national economic architecture.\nHe reiterated that land remained a major factor of production and “it is key for all purposes of socioeconomic development”.\nHead of Press and Public Relations, Office of the Surveyor General of the Federation Abu, Michael in a statement said that Surv."
  },
  {
    "headline": "Nigeria trade relation with Qatar is very low – Nigerian Envoy",
    "summarized_story": "The Ambassador Extraordinary and Plenipotentiary of the Federal Republic of Nigeria to the State of Qatar, Ambassador Yakubu Abdullahi has said that Nigeria’s trade relation with Qatar is very low.\nAmbassador Abdullahi said this while presenting his Letters of Credence to the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al-Thani.\nAmbassador Ahmed expressed gratitude to President Muhammadu Buhari for finding him worthy of appointment as his Principal Envoy to the State of Qatar.\nThe Emir of Qatar in his response assured the Nigerian Envoy of his support to succeed in the discharge of his mandates.\nThe credential’s presentation ceremony was preceded by the inspection of the Guard of Honour by the Nigerian Ambassador, who until his appointment as Ambassador to the State of Qatar was the Director of Protocol, State House."
  },
  {
    "headline": "Olympics: Team Nigeria’s First Batch Departs For Tokyo",
    "summarized_story": "The first batch contingent of Team Nigeria today, July 6 left for the Tokyo 2020 Olympics.\nThe team members departed through the Nnamdi Azikiwe International Airport.\nNigeria will be competing in nine sports at the rescheduled Tokyo Olympics which runs from July 23rd- August 8th.\n“In continuation of his grandiose support to the sports sector, President Muhammdu Buhari has committed enormous resources in the preparation and participation of Team Nigeria for the Tokyo 2020 Olympic and Paralympic Games.\nThe Nigeria contingent to Games is scheduled to move to Tokyo in four batches as follows:Batch 1: July 6, 2021Canoe SprintRowingTable TennisBatch 2: July 13, 2021AthleticsTaekwondoWrestlingBatch 3: July 17, 2021GymnasticsBadmintonBatch 4: July 19, 2021Basketball"
  },
  {
    "headline": "Kaduna NLC Strike: Govt Sets Up Commission Of Inquiry Into Actions Of Labour Leaders",
    "summarized_story": "The Kaduna State Government has established a Judicial Commission of Inquiry into the Nigerian Labour Congress (NLC) strike of May 2021, with Justice Ishaq Bello, a retired Judge as chairman.\nHe explained that the former Attorney-General of Cross River State, Eyo Ekpo and ex-Attorney General of Kaduna State, Joan Jatau-Kadiya, are members of the Judicial Commission of Inquiry.\nAccording to the statement, the Judicial Commission of Inquiry is constituted based on the 1999 Constitution and the Commissions of Inquiry Law CAP 34, Laws of Kaduna State 1991.\nThe Inquiry has 14 terms of reference which include ascertaining the legality of the warning strike, the actions of various persons and organisations.\nThe statement pointed out that “Section 7 of the Commissions of Inquiry Law grants the Judicial Commission of Inquiry the power to summon any person in Nigeria to give evidence and to issue a warrant to compel the attendance of anyone so summoned.’’"
  },
  {
    "headline": "Kaduna Govt Orders Immediate Closure Of 13 Schools Over Insecurity",
    "summarized_story": "The Kaduna State Government has ordered the immediate closure of 13 schools located in areas that have been identified as vulnerable to attacks by bandits.\nThis followed Monday’s bandits’ attack on Bethel Baptist school in Chikun Local Government Area of Kaduna State, where an unspecified number of students were kidnapped.\nOthers are, St. Peters Minor Seminary, Katari, Prelude Secondary School, Kujama, Ibiso Secondary School, Tashar Iche, Tulip International (Boys) School and Tulip international (Girls) School.\nAlso on the list are, Goodnews Secondary School, St. Augustine, Kujama, Comprehensive Development Institution (CDI), Tudun Mare and Adventist College, Kujama.\nMonday’s attack was the fourth mass school kidnap in Kaduna state since December."
  },
  {
    "headline": "Nigeria’s Next President Should Emerge From The South – Southern Governors",
    "summarized_story": "Southern governors have jointly agreed that Nigeria’s next president should emerge from the southern region.\nChairman of the Southern Governors’ Forum, Rotimi Akeredolu, said this on Monday while reading from a communique jointly signed by the governors after a closed-door meeting in Alausa, Lagos State.\nSee the FULL communique by the governors below:COMMUNIQUÉ ISSUED AT THE CONCLUSION OF THE MEETING OF THE GOVERNORS OF SOUTHERN NIGERIA AT THE LAGOS STATE GOVERNMENT HOUSE, IKEJA, LAGOS STATE, ON MONDAY, 5TH JULY, 2021 NIGERIA.\nthe Forum rejects the proposed 3% and support the 5% share of the oil revenue to the host community as recommended by the House of Representatives; iii.\nArakunrin Oluwarotimi Odunayo Akeredolu SAN Governor, Ondo State, and Chairman, Southern Governors’ Forum"
  },
  {
    "headline": "UK Court Quashes 1972 Robbery Convictions Of Three Black Men",
    "summarized_story": "Appeal court judges in London on Tuesday overturned the convictions of three black men for attempting to rob a corrupt police officer nearly half a century ago.\nThe Court of Appeal cleared the trio following a referral by a criminal cases review commission, and comes just over a year after the acquittals of four men in a similar case.\nThe latest ruling is the third time convictions have been overturned based on the tarnished evidence of discredited British Transport Police officer Detective Sergeant Derek Ridgewell.\nOne of the three, Cleveland Davidson, said outside court the decision was a “vindication”, and the original conviction had blighted his life for 50 years.\nIn December 2019, three members of the “Oval Four” — who were arrested at Oval underground station in 1972 and accused of stealing handbags — had their convictions overturned."
  },
  {
    "headline": "Gbajabiamila announces 7-man committee to harmonise PIB report with Senate",
    "summarized_story": "Speaker of the House of Representatives, Femi Gbajabiamila, on Tuesday announced a seven-man committee to harmonise the report on Petroleum Industry Bill with that of the Senate.\nAnnouncing the committee, Mr Gbajabiamila said the members will help address the grey areas of the bill.\nAdvertisementUgonna Ozirigbo said his privileged had breached as he sought explanations on the state of the Committee’s report.\nResponding, Speaker Femi Gbajabiamila, said the report has yet to be laid and wonders where what is being circulated emanated from.\nThe Speaker said the House will soon received the report of the Committee and will pass it clause by clause before it goes on recess next week."
  },
  {
    "headline": "BREAKING: Four PDP Reps from Zamfara dump PDP for APC",
    "summarized_story": "Four members of the People’s Democratic Party, PDP, in the House House of Representatives from Zamfara State have defected to the All Progressives Congress.\nSpeaker of the House of Representatives, Femi Gbajabiamila, read the letter on the floor of the House of Representatives on Tuesday.\nMeanwhile, the House of Representatives says the parliament is unaware of circulating report on electoral amendment bill, saing it remains in the realm of speculation."
  },
  {
    "headline": "ECOWAS may consider adoption of Cryptocurrency to facilitate trade",
    "summarized_story": "© 2020 TVC NewsFirst with Breaking NewsAll Rights Reserved"
  },
  {
    "headline": "PIB: 30% Frontier Share to Be Gotten From Federation Funds, Says Musa Adar",
    "summarized_story": "Nigeria’s House of Representatives has provided further clarification to the recently passed Petroleum Industry Bill.\nMusa Adar, the Chairman, House Committee on Petroleum Upstream told ARISE News on Tuesday that the proposed 30 per cent share of profit for the exploration of oil and gas in the frontier basins will be gotten from the federation funds.\nAccording to the ranking lawmaker, the provisions for the host communities will be coming from annual funds of oil stakeholders in the Niger Delta region.\nHe says the funds expended by the over eighteen oil companies annually are more than Nigeria’s entire budget, with host communities expected to get an expected $2.5 billion.\nWatch the interview for more."
  },
  {
    "headline": "Neymar Would Rather Brazil Play Argentina in Copa America Final",
    "summarized_story": "Brazil forward Neymar says he hopes Argentina will be their opponents in the Copa America final and has no doubts that the hosts would come out on top against their fierce rivals.\n“I have friends there and in the final Brazil will win.”The last time the two sides met in a Copa America final was in 2007, when Brazil won 3-0 in Venezuela, and a title match between the arch rivals would be a treat for the neutrals.\nBrazil are reigning champions and have home advantage at a tournament that was supposed to be co-hosted by Argentina and Colombia.\nNeymar missed Brazil’s Copa America triumph on home soil two years ago but inspired them to the 2013 Confederations Cup as well as Olympic gold in Rio de Janeiro in 2016.\nMessi, meanwhile, has won everything with his club Barcelona but no senior title with Argentina, who are aiming to win a first major trophy since the 1993 Copa America."
  },
  {
    "headline": "Passenger Plane with At Least 28 Goes Missing in Russia’s Far East",
    "summarized_story": "A Russian AN-26 aeroplane with at least 28 people on board has gone missing in the Kamchatka Peninsula in Russia’s far east, news agencies cited regional authorities as saying.\nThe plane lost contact with air traffic control while attempting to land, TASS separately cited a source as saying.\nA search had been launched involving at least two helicopters and rescue workers were on standby, the reports said.\nRussia, once notorious for plane accidents, has improved its air traffic safety record in recent years.\nBut poor aircraft maintenance and lax safety standards still persist, and the country has seen several deadly air accidents in recent years."
  },
  {
    "headline": "Soyinka Tells Nigeria Government to Stop Pursuing Wanted Yoruba Separatist Igboho and Apologise to Him",
    "summarized_story": "Nobel Laureate, Prof. Wole Soyinka, has urged Nigeria’s federal government to apologise to Yoruba activist, Chief Sunday Adeyemo (Igboho), as it is not criminal or illegal for anyone to express intention to leave any federation.\nSoyinka, who spoke during an interview with BBC News Pidgin on Monday, urged the government to stop pursuing the self-determination agitator.\nSoyinka said: “More important for me is the position of the government, saying that the ‘existence of these weapons’ proved that he (Igboho) was planning war against the state.\nHe advised the federal government to stop pursuing Igboho as a criminal and also accused the government of acting in a criminal fashion against him.\n“If and when Igboho comes to trial, I guarantee you the government will be very embarrassed,” he warned."
  },
  {
    "headline": "Nigeria Says 400,000 Barrels of Oil Lost Daily to Theft",
    "summarized_story": "About 400,000 barrels of crude oil is lost daily to theft, according to data from the federal government.\nHe considered sustained oil pipeline vandalism as one of the major problems that has contributed to environmental degradation in the Niger Delta.\nThis equates to the federal government having lost approximately three per cent of its revenue to oil theft.\n“The several statistics emphasised that Nigeria is the most notorious country in the world for oil theft lost roughly 400,000 barrels per day dwarfing the second country, Mexico reported only 5,000-10,000 barrels per day.\nHe said though sometimes the youths were blamed for pipeline vandalism, they did not have the facilities to carry out offshore vandalism."
  }
]