[
  {
    "headline": "Help save my life, 58-year-old lawyer with stage five kidney disease who needs transplant cries out",
    "summarized_story": "But, his legal practice and PhD dream are all on hold as he battles chronic kidney disease.\nHis doctors have told him that he would need a kidney transplant to increase his chances of living a longer, healthier life.\n“By the time I was referred to a nephrologist, the first test showed that I had stage three chronic kidney disease.\nChronic Kidney Disease is a condition characterised by a gradual loss of kidney function over time and it can lead to kidney failure.\nThe 58-year-old lawyer is billed to continue his dialysis until he can go for a kidney transplant."
  },
  {
    "headline": "Help save my life, 58-year-old lawyer with stage five kidney disease who needs transplant cries out",
    "summarized_story": "But, his legal practice and PhD dream are all on hold as he battles chronic kidney disease.\nHis doctors have told him that he would need a kidney transplant to increase his chances of living a longer, healthier life.\n“By the time I was referred to a nephrologist, the first test showed that I had stage three chronic kidney disease.\nChronic Kidney Disease is a condition characterised by a gradual loss of kidney function over time and it can lead to kidney failure.\nThe 58-year-old lawyer is billed to continue his dialysis until he can go for a kidney transplant."
  },
  {
    "headline": "Bedwetting treatable, can be hereditary –Paediatrician",
    "summarized_story": "Toluwalope KareemA consultant pediatrician/pediatric nephrologist with Zenith Medical and Kidney Centre Abuja, Dr. Chukwunonso Epundu, discusses bedwetting or enuresis, in this interview with TOLUWALOPE KAREEMWhat is bedwetting?\nPrimary bedwetting is when a child has never attained continence at any point in time since he or she was born.\nSecondary bedwetting is when a child may have attained continence, stopped bedwetting at night for at least about six months and then suddenly starts bedwetting again.\nFor adults, most of the time you already know that it is an organic problem, so you find the root of the problem and solve it.\nIf the right thing is done, and the right approach is taken, the child will eventually stop bedwetting."
  },
  {
    "headline": "Bedwetting treatable, can be hereditary –Paediatrician",
    "summarized_story": "Toluwalope KareemA consultant pediatrician/pediatric nephrologist with Zenith Medical and Kidney Centre Abuja, Dr. Chukwunonso Epundu, discusses bedwetting or enuresis, in this interview with TOLUWALOPE KAREEMWhat is bedwetting?\nPrimary bedwetting is when a child has never attained continence at any point in time since he or she was born.\nSecondary bedwetting is when a child may have attained continence, stopped bedwetting at night for at least about six months and then suddenly starts bedwetting again.\nFor adults, most of the time you already know that it is an organic problem, so you find the root of the problem and solve it.\nIf the right thing is done, and the right approach is taken, the child will eventually stop bedwetting."
  },
  {
    "headline": "Breaking: EFCC flags Northern Gov for N60b cash withdrawal",
    "summarized_story": "By Soni DanielThe Economic and Financial Crimes Commission has flagged a Northern Governor for personally withdrawing cash of N60 billion from his state treasury.\nThe EFCC, which broke the story today in its latest EFCC Alert, said the governor is from the North Central part of the country but didn’t give his name.\nThe EFCC Chairman, Abdulrasheed Bawa, who spoke in the latest edition of the magazine said: “I can tell you for free that the new Department of Intelligence that we have created is working wonders.\n“They have come up with a lot of intelligence.\nIn one of them, a governor in a North-Central state within the last six years (one individual) has withdrawn over N60 billion in cash."
  },
  {
    "headline": "NDLEA nabs Ghanaian, 2 Nigerians at Enugu, Abuja airports with 9.9kg Cocaine, Meth",
    "summarized_story": "By Kingsley OmonobiA Ghanaian and two Nigerians have been arrested at the Nnamdi Azikiwe International Airport, Abuja and Akanu Ibiam international Airport, Enugu respectively for trafficking a total of 9.953kilograms of Cocaine and Methamphetamine.\nIn the same vein, another trafficker, 53-year-old Udeh Charley was arrested at the Enugu airport for ingesting 72 wraps of Cocaine weighing 1.253kilograms.\nHe was arrested on Friday 3rd Dec. during outward screening of Ethiopian Airlines passengers going to Rome, Italy via Addis Ababa.\nOn Friday 3rd Dec, NDLEA operatives intercepted a truck at the Onitsha head bridge heading to Delta State.\nUpon search, various quantities of Codeine, Tramadol, Diazepam, and Rohypnol were recovered from the vehicle and its driver, Obinna Obinwa, arrested."
  },
  {
    "headline": "Insecurity: NSCDC tasks private guards on intelligence gathering",
    "summarized_story": "Omeiza Ajayi, AbujaThe Nigeria Security and Civil Defence Corps NSCDC has charged private guard companies in the country to use their closeness to the people to assist in gathering intelligence for security agencies in order to resolve the various security challenges militating against the country.\nThe personnel were trained in basic security operations and intelligence gathering.\nRepresented by his second in command, DCC Felix Ikwuegbu, the NSCDC boss urged them to put into practice all that they learned during the training.\nWe are all part of the structure to provide Nigeria with security.\nAnother responsibility is to provide intelligence to the ministry, to the police and other security arms."
  },
  {
    "headline": "FG urged to visit matters of NDDC board",
    "summarized_story": "“I am not sure they are Niger Delta youths.\nAt a time the region is bitter over delay in constituting aboard for the NDDC some youths could come out to shower praises.\nBut for now, these youths that came up with the statement under the name Niger Delta Progressives Movement, NDPM, should bury their heads in shame.\n“It is high time federal government visited recommendations on redressing challenges in the Niger Delta.\nThere are the recommendations of the Niger Delta Environmental Survey and many others."
  },
  {
    "headline": "Oil & Gas: Why coys must deepen local content devt in operations – Schneider Electric",
    "summarized_story": "By Prince OkaforEnergy Management and Automation firm, Schneider Electric has harped on the need for oil and gas companies across the country, to deepen local content in their operations.\n“The pandemic afforded Schneider Electric the opportunity to upskill local engineers.\n“And for the part of our business that covers oil and gas, we are domesticating key skills in Nigeria to support the whole of Africa.\nAkindele also called for collaboration between the oil and gas industry, the government, and the academia to deepen Research and Development in Nigeria.\n“When a country invests in R&D, that country is able to innovate, leap-frogging other countries, which makes the country richer."
  },
  {
    "headline": "Buhari reacts to death of Soun of Ogbomoso",
    "summarized_story": "President Muhammadu Buhari has reacted to the death of Soun of Ogbomoso, Oba Jimoh Oyewumi Ajagungbade III.\nBuhari in a statement signed by Femi Adesina condoled with the family of His Royal Highness, the Soun of Ogbomoso land, Oba Oladunni Oyewumi, Ajagungbade III, CFR, on his death.\nPart of the statement reads: “The President commiserates with the Government and people of Oyo State and especially the indigenes of Ogbomosoland on the demise of the frontline traditional ruler whose reign of 48 years reinforced the town as a land of peace, accommodating and a bastion of history and tradition.\n“President Buhari also joins the Oyo State Council of Obas in mourning the First Class Traditional ruler, who will forever be remembered for his counsel and commitment to the unity and harmony within their ranks.”Buhari urged the sons and daughters of Ogbomoso land to be consoled with the fact that Oba Oyewumi accentuated his reign with the development and progress of the community through enduring peace and extension of hands of fellowship to peoples of other communities."
  },
  {
    "headline": "There is ‘cold war’ going on in Nigeria – Reverend Ayuba",
    "summarized_story": "The General Overseer, Light of God Church, Angwa Gimbia Sabo Tasha, Chikun Local Government Area of Kaduna State, Reverend Jonathan Ayuba has urged Christians to embark on serious prayers, saying there is a ‘cold war’ going on in Nigeria.\nReverend Ayuba while speaking during the Annual Thanksgiving with the theme; “Only the living can praise God,” noted that the killings, kidnapping and various crimes going on in Nigeria showed that there is war being engineered by some people, with the reason best known to them.\nHe said, whether their aim is to eliminate Christians or Muslims so that Nigeria could practice one religion, or one religion dominates one or the other, it’s certain that ‘no matter the killings, kidnapping, all the religion must coexist.\nAyuba further noted that ” it’s true that in every twelve, there must be a Judas, so also it’s in Nigeria.\nAccording to him, there is no level of killings that will stop Christians or Muslims from serving their living God."
  },
  {
    "headline": "Yuletide: Ban on fireworks, other explosives still in force – Imo police",
    "summarized_story": "The Imo State Police Command has warned members of the public against the sales, use of fireworks and other explosives in the state.\nThis was announced on Sunday in a statement signed by the police spokesman, Michael Abattam on behalf of the Commissioner of Police, Imo State Command, CP Rabiu Hussaini.\nThe CP said, “The Imo State Police Command has observed with utmost dismay the indiscriminate use of fireworks and other explosives in the state and hereby warn the general public that, the ban on the use of fireworks and other explosives is still very much in force and the command will enforce all the extant laws prohibiting the use of ‘ KNOCKOUTS, ‘ BANGER ‘ etc.. especially this yuletide season.\n“It is common knowledge that hoodlums use such fireworks and explosives to cause distraction, panic and consequently pandemonium and in the process rob /kidnap unsuspecting victims.\nThe police commissioner said that the Wholesalers / Retailers of such items are equally warned to stop distribution/ sales of fireworks in the state as anyone found complicit will be arrested, the fireworks or explosives confiscated and such person(s) prosecuted forthwith."
  },
  {
    "headline": "20 bandits, 7 villagers killed as military engage bandits in Zamfara village",
    "summarized_story": "A number of bandits have been reportedly killed as they unleashed terror on Karakkai village, in Nahuche district of Bungudu Local Government Area of Zamfara state on Saturday.\nThey were also said to have killed seven indigenes.\nSome of the villagers revealed that over twenty bandits were neutralized by join task force between Nigerian Army and Civilian (JTF) and scores of arms were recovered, which include motorcycles, guns and ammunition.\nAccording to the sources, many of the bandits were arrested by the security operatives.\nDAILY POST learnt that a number of local food stores were burnt by the bandits."
  },
  {
    "headline": "Passage of Soun signals end of a glorious era in Ogbomoso – Oyo Speaker",
    "summarized_story": "The Speaker, Oyo State House of Assembly, Adebo Ogundoyin has said that the passage of Soun of Ogbomoso, Oba Jimoh Oyewumi Ajagungbade 111, signals the end of a glorious era in Ogbomosoland.\nOgundoyin, while reacting, explained that the death of the traditional ruler signaled the end of a glorious era in Ogbomosoland and indeed Yorubaland.\nThe speaker added that Ogbomosoland has lost a quintessential Oba who distinguished himself as a true heir to the throne of his ancestors.\nHe said, “The death of Soun signals the end of a glorious era in Ogbomosoland and indeed Yorubaland.\n“It is so sad that we lost Oba Ajagungbade at the auspicious age of 95 when his abundant elderly, native and ancestral experience is required by all and sundry."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "NSITF settles 11,000 claims with N1bn in 2021, says Board",
    "summarized_story": "The Nigeria Social Insurance Trust Fund (NSITF), has settled over 11,000 claims with over N1billion this year, it was learnt at the weekend.\nThe Chairman, Board of NSIT, Prince Austin Enajemo-Isire, disclosed this during a session with reporters in Abuja.\nHe said: “Today, NSITF is currently undergoing a transformation and repositioning to deliver on its core mandate in line with the vision of the fund.\n“This is one of the key promises made by the management board to change the narrative during their inauguration with a view to enthroning sound policies, accountability and probity.\nAccording to him, the Employee Compensation Act (ECA), guiding the operations of NSITF, was a fall out of the employee compensation scheme, introduced and powered by an Act of parliament, known as ECA in 2010."
  },
  {
    "headline": "Buhari hosts ECOWAS leaders in crucial meeting over Mali, Guinea Conakry crises",
    "summarized_story": "ECOWAS leaders began deliberations on Sunday on crucial sub-regional and continental matters including reports on political crises in Mali and Guinea Conakry.\nThe News Agency of Nigeria (NAN) reports that the meeting, hosted by President Muhammadu Buhari, has President of Ghana and Chairman of ECOWAS Authority, Nana Akufo-Addo in attendance.\nAlso in attendance are President Macky Sall of Senegal, President Umaro Sissoco Embaló of Guinea Bissau, President Julius Bio of Sierra Leone and President Jose Maria Neves of Cape Verde.\nThe meeting will also consider the appointment of an ECOWAS Champion for the return of cultural artefacts, and the report on the ECOWAS Single Currency Programme by Ken Ofori-Affa.\nNAN reports that winners of the ECOWAS Prize for Excellence are also expected to receive their various prizes at the event."
  },
  {
    "headline": "APC Governors commend Uzodinma’s insightful inputs to governance at 63",
    "summarized_story": "The Progressive Governors Forum (PGF) has commended Gov.\nHope Uzodinma of Imo for his insightful and resolute inputs to the processes of managing governance at both state and national levels.\nThe forum, for governors elected on the platform of the All Progressives Congress (APC), gave the commendation in a statement issued by its Chairman, Gov.\n“We wish to acknowledge and commend your leadership, vision and commitment to a united, prosperous Nigeria, under the leadership of our party, APC.\nRead Also: Uzodinma updates Buhari on security challenges in Imo- Advertisement -“We also acknowledge your contributions to our team of Progressive Governors through your insightful and resolute inputs to the processes of managing governance in Imo as well as at the national level."
  },
  {
    "headline": "Police foil bandits attack in Kaduna",
    "summarized_story": "The Police Command in Kaduna State, says its operatives foiled bandits attack in Sabon Tasha in Chikun Local Government Area (LGA) of the state, in the early hours of Saturday, Dec. 11.\nThe Command’s Public Relations Officer, ASP Mohammed Jalige, made the disclosure in a statement issued on Saturday in Kaduna.\n“On receiving the distress call, operatives were immediately mobilized with the support of other security agents to the scene with a view to thwarting the intention of the bandits.\n- Advertisement -“The criminals, on sensing the presence of security agents, started shooting indiscriminately.\nThe criminals, frustrated by the Police and other security agents, set the residence on fire and fled."
  },
  {
    "headline": "Soun of Ogbomoso dies at 95",
    "summarized_story": "From Oluseye Ojo, IbadanThe Soun of Ogbomoso in Oyo State, Oba Jimoh Oladunni Oyewumi, Ajagungbade III, is dead.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nIn 1938, he attended the Ogbomoso People’s Institute, which was later transformed into Ogbomoso Grammar School.\nPrince Oyewumi, as he was popularly known, made his inaugural business trip abroad in 1958.\nThe trip took him to Hamburg and Bremen in then West Germany; Paris and Marseille in France and London, United Kingdom."
  },
  {
    "headline": "Col. Abubakar Dangiwa Umar exclusive: Why Nigeria cannot win banditry, Boko Haram war",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nFixed wing aircraft are not ideal weapons of choice in the fight against banditry and kidnappings,” Umar explained.\nPeople give up most of their rights to the state with the hope that their security will be guaranteed.\nKaduna which you once governed has been very hostile security-wise, with bandits packing students from time to time.\nIt was made to pay war reparations which resulted in the crippling of its economy and massive pauperisation of its people."
  },
  {
    "headline": "Imo Governor at 63: Unknown gunmen, Okorocha, Imo governorship election and I – Uzodimma",
    "summarized_story": "Governor of Imo State, Senator Hope Uzodimma, is 63 years old today.\nThese things don’t encourage sane minds.\nI’m the governor of Imo State and I took an oath to protect the people.\nYou’ll see all the things I’ve done.\nOur people don’t think."
  },
  {
    "headline": "2023: Don’t beg Yoruba to support any aspirant, Obasanjo warns Ooni",
    "summarized_story": "From Lateef Dada, OsogboFormer President Olusegun Obasanjo has warned the Ooni of Ife, Oba Adeyeye Ogunwusi, not to direct Yoruba people to support any candidate as politicians may demand.\nSpeaking in Yoruba language with Ooni, Obasanjo said: “The matter now becomes between us as brothers; kingship role in Yoruba land should not be muddled with politics.\n“All sons and daughters of Yoruba land, no matter where they are or their standpoint, they will be coming to meet you.\nYoruba people don’t usually go to the same direction which is part of our strength in Yoruba land.\nPlease don’t let the politician add to your burden."
  },
  {
    "headline": "Most FG budgetary allocations promote corruption – Wike",
    "summarized_story": "Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHe said such practice encourages variation of the value of the projects, elongates the time specified to complete such projects and most often, leads to abandonment.\nGovernor Wike explained that in such situations, the contract value becomes affected by inflation and there is a likelihood of adjustment of the items, which eventually breeds corruption.\nGovernor Wike stated that days were gone when politicians gave excuses to cover up their lack of leadership capacity.\nPerforming the project inauguration, Ozekhome said Governor Wike had through the execution of numerous infrastructural projects, demonstrated transparency and accountability in the management of the resources of Rivers State."
  },
  {
    "headline": "EXCLUSIVE: Head Of Service Warns Ministries, Agencies Over Rising Lawsuits From Workers Against Buhari Government",
    "summarized_story": "The Office of the Head of Civil Service of the Federation has warned permanent secretaries and chief executive officers in the country over rising litigation cases consuming the limited resources of the Nigerian government.\n“In the light of the above development, all MDAs are strongly advised to follow due process in handling staff matters, especially disciplinary cases.\nSpecifically, public service rules issued by the OHSCF and guidelines on appointments, promotion and disciplines issued by the Federal Civil service Commission.\n“Henceforth, permanent secretaries and chief executive officers whose poor handling of disciplinary matters leading to avoidable court cases, consequential financial implications and embarrassment to government shall be held liable.\nHenceforth, the commission shall direct all pending matters, litigations in court to the MDAs concerned to defend themselves on their merit."
  },
  {
    "headline": "EXCLUSIVE: Head Of Service Warns Ministries, Agencies Over Rising Lawsuits From Workers Against Buhari Government",
    "summarized_story": "The Office of the Head of Civil Service of the Federation has warned permanent secretaries and chief executive officers in the country over rising litigation cases consuming the limited resources of the Nigerian government.\n“In the light of the above development, all MDAs are strongly advised to follow due process in handling staff matters, especially disciplinary cases.\nSpecifically, public service rules issued by the OHSCF and guidelines on appointments, promotion and disciplines issued by the Federal Civil service Commission.\n“Henceforth, permanent secretaries and chief executive officers whose poor handling of disciplinary matters leading to avoidable court cases, consequential financial implications and embarrassment to government shall be held liable.\nHenceforth, the commission shall direct all pending matters, litigations in court to the MDAs concerned to defend themselves on their merit."
  },
  {
    "headline": "How Ex-Vice President, Atiku Rejected Tinubu As Running Mate For 2007 Presidential Election—Former APC Chairman, Akande",
    "summarized_story": "A former Interim Chairman of the All Progressives Congress (APC), Chief Bisi Akande, has said that ex-Vice-President Atiku Abubakar rejected the party's National Leader, Bola Tinubu, as his running mate in the 2007 presidential election.\nWe agreed that Atiku should be our presidential candidate and we had the understanding that he would run with Bola Tinubu.\nKaita begged me and said it was Ben Obi whom Atiku had chosen as his running mate behind our back.\nSo, I signed the form because I believed as the candidate, Atiku had the right to choose his running mate.\n“We proposed that Tinubu should be the running mate, though Tinubu was not at the meeting."
  },
  {
    "headline": "How Ex-Vice President, Atiku Rejected Tinubu As Running Mate For 2007 Presidential Election—Former APC Chairman, Akande",
    "summarized_story": "A former Interim Chairman of the All Progressives Congress (APC), Chief Bisi Akande, has said that ex-Vice-President Atiku Abubakar rejected the party's National Leader, Bola Tinubu, as his running mate in the 2007 presidential election.\nWe agreed that Atiku should be our presidential candidate and we had the understanding that he would run with Bola Tinubu.\nKaita begged me and said it was Ben Obi whom Atiku had chosen as his running mate behind our back.\nSo, I signed the form because I believed as the candidate, Atiku had the right to choose his running mate.\n“We proposed that Tinubu should be the running mate, though Tinubu was not at the meeting."
  },
  {
    "headline": "BREAKING: Hausa Group Calls For Buhari's Resignation, Says President Spares Fulani Bandits But After Kanu, Igboho",
    "summarized_story": "The association noted that the “Hausas regret supporting and voting\" for Buhari massively.\nOn so many occasions, you have bragged to crush the bandits and proclaimed to take necessary action but all in vain.\n“The bandits are now matured to dictate to our collective population because of your empty threat.\nThe answer is one, because they are not a threat to this administration while those that seem to be a threat are already in jail; Nnamdi Kanu and Sunday Igboho.\n“That's why a whole Minister of Information named them just an ordinary criminal but called Nnamdi Kanu a terrorist."
  },
  {
    "headline": "‘We never left Sharjah Airport’ -- Air Peace denies UAE's claim",
    "summarized_story": "On Saturday, TheCable reported how the UAE’s General Civil Aviation Authority blamed Air Peace for pulling out of Sharjah Airport and “so should not expect to retain its flight frequency there”.\nAdvertisementEarlier, the federal government had cut Emirate’s slots from 21 to one in retaliation to the UAE’s treatment of Air Peace.\nWe are the ones being wronged, and now we are being attacked from a quarter we least expected,” Air Peace said.\n“Air Peace has only operated flights into Sharjah Airport alone.\nSo, we never left Sharjah Airport nor did we at any time ‘shifted’ and operated out of DXB (Dubai Airport)."
  },
  {
    "headline": "‘We never left Sharjah Airport’ -- Air Peace denies UAE's claim",
    "summarized_story": "On Saturday, TheCable reported how the UAE’s General Civil Aviation Authority blamed Air Peace for pulling out of Sharjah Airport and “so should not expect to retain its flight frequency there”.\nAdvertisementEarlier, the federal government had cut Emirate’s slots from 21 to one in retaliation to the UAE’s treatment of Air Peace.\nWe are the ones being wronged, and now we are being attacked from a quarter we least expected,” Air Peace said.\n“Air Peace has only operated flights into Sharjah Airport alone.\nSo, we never left Sharjah Airport nor did we at any time ‘shifted’ and operated out of DXB (Dubai Airport)."
  },
  {
    "headline": "Oyewumi Ajagungbade, Soun of Ogbomoso, dies at 95",
    "summarized_story": "Oba Oladunni Oyewumi Ajagungbade, the Soun of Ogbomoso in Oyo state, has died after 48 years on the throne.\nHe was born to Oba Bello Afolabi Oyewumi Ajagungbade II and Ayaba Seliat Olatundun Oyewumi and ascended the throne on October 24, 1973.\nHe also attended Ogbomoso People’s Institute, which was later changed to Ogbomoso Grammar School.\nAdvertisementBefore ascending the throne, Ajagungbade made fortune from the textile business and a chain of other business initiatives.\nHe also established Terminus Hotel and El-Duniya Hotel in Jos."
  },
  {
    "headline": "Oyewumi Ajagungbade, Soun of Ogbomoso, dies at 95",
    "summarized_story": "Oba Oladunni Oyewumi Ajagungbade, the Soun of Ogbomoso in Oyo state, has died after 48 years on the throne.\nHe was born to Oba Bello Afolabi Oyewumi Ajagungbade II and Ayaba Seliat Olatundun Oyewumi and ascended the throne on October 24, 1973.\nHe also attended Ogbomoso People’s Institute, which was later changed to Ogbomoso Grammar School.\nAdvertisementBefore ascending the throne, Ajagungbade made fortune from the textile business and a chain of other business initiatives.\nHe also established Terminus Hotel and El-Duniya Hotel in Jos."
  },
  {
    "headline": "FG to restrict airlines from UK, Saudi Arabia in response to Omicron travel ban",
    "summarized_story": "The federal government says it will restrict airlines coming from Canada, United Kingdom, and Saudi Arabia into Nigeria from Tuesday, December 14.\nAdvertisementHadi Sirika, minister of aviation, who disclosed this on Sunday in Lagos, explained that it was to reciprocate the travel ban placed on Nigeria over the new COVID-19 variant, Omicron.\nSirika said President Muhammadu Buhari’s administration would also place the United Kingdom, Canada, and Saudi Arabia on a red list over the outbreak and spread of the Omicron variant.\nAdvertisementSaudi Arabia had also imposed a temporary ban on flights from Nigeria over the increasing number of omicron variant cases.\nAdvertisement“There is also the case of Saudi Arabia that put Nigeria on the ban list."
  },
  {
    "headline": "This may be African languages’ best bet against extinction",
    "summarized_story": "How can this be avoided, especially for African languages?\nGet the best African tech newsletters in your inboxMandla, a Zulu and Xhosa word that means power, is an innovative e-learning language app created for those who seek to strengthen their connection with their African roots.\nA diverse team building a diverse productAs the duo built, they realised they needed more diverse hands.\nThe third Apiou raised is about niche: their product focuses on Africa and African languages and culture.\nUnlike other language learning apps that are including African languages just to check a diversity-and-inclusion box, Mandla’s mission is deeper than educational or entertainment purposes; it’s really about cultural preservation."
  },
  {
    "headline": "Could Africa ditch cash?",
    "summarized_story": "The era of cash could be drawing to an end as central bank-backed digital currencies (CBDC”s) takes root in Africa.\nSo far, it’s only Nigeria that has launched an official, state-backed digital currency – christened the eNaira – on the continent as more countries continue to express interest.\nThe Baobab Network has traced at least 60 cryptocurrency companies in Africa, with the majority (43 percent) of them headquartered in Nigeria, followed by South Africa (18 percent) and Kenya (11 percent).\nThis is affirmed by another comparative study by GSMA published in March 2021 showing more than half of 310 live mobile money services in 2020 across the globe were found in Africa.\nWith over 55 percent of the world’s mobile money services recorded in Africa and a significant population turning to e-wallets and cryptocurrency, the question now becomes whether the continent might ditch paper money altogether."
  },
  {
    "headline": "CinetPay gets $2.4m seed to digitise payments in francophone Africa",
    "summarized_story": "CinetPay, an Ivory Coast-based startup that enables merchants in francophone Africa to accept and make electronic payments online or via mobile Point of Sale (PoS) devices, on Wednesday said it has raised $2.4 million seed funding.\nOn CinetPay’s mobile and web-based platform, businesses can sign up to process payments from over 130 different payment operators—including MTN mobile money, M-Pesa, Orange Money, Visa, Mastercard, etc—via a single interface.\nCinetPay thus simplifies the process of accepting payments, eliminating the need for merchants to integrate with different systems for managing sales and revenues.\nSimilarly, up to 80% of the population in the French-speaking African region have a mobile money account and less than 20% bank accounts.\nWalter Baddoo, co-founder and General Partner at 4DX Ventures reveals that the VC firm has been “tracking the francophone Africa market” for some time now and is impressed by CinetPay’s ambitious goal to digitise payments across the region."
  },
  {
    "headline": "Equinix in talks to acquire West African digital infrastructure firm MainOne",
    "summarized_story": "The company owns and operates an extensive submarine network extending 7,000 kilometers from Portugal to Lagos, Accra, and along the West African coast, with landing stations in Nigeria, Ghana, and Côte d’Ivoire.\nThese provide connectivity to and from Europe, West African countries, and the major business communities in Nigeria.\nMainOne also owns digital infrastructure assets that include three operational data centers, with an additional facility under construction expected to open in Q1 2022.\nGiven the huge supply gap in digital infrastructure in sub-Saharan Africa, Ayobami Omole, a Lagos-based telecom analyst at Tellimer, expects more of such transactions in the coming years.\nWhen completed, the acquisition will extend Platform Equinix into West Africa."
  },
  {
    "headline": "Omicron: Nigeria reciprocates, to ban flights from Saudi Arabia, UK, Canada",
    "summarized_story": "The federal government has disclosed plans to add the United Kingdom (UK), Canada, Saudi Arabia and Argentina to its red list of travel ban reciprocating to a similar decision taken by these countries amid concerns of the Omicron variant.\nRead also: Omicron: UK adds Nigeria to its travel red listThe UK had on November 4, added Nigeria to its red list and imposed a travel ban, citing the Omicron variant.\nBritish health minister Sajid Javid, who announced the development, had said Nigeria was second only to South Africa in terms of Omicron cases linked to travel.\nCanada and Saudi Arabia had also banned flights and Nigerians from coming into their countries.\nAccording to Sirika, Nigeria can no longer fold her hands to overlook the sovereignty of over 200 million of her citizens being taken for granted."
  },
  {
    "headline": "Why Nigerians must vote in 2023",
    "summarized_story": "For those who encourage the youths to vote in the 2023 elections, there are many reasons not to step out as Nigerian unemployment ranks among the highest in the world at 33.3 percent.\nIt is not enough to register and collect a Permanent Voter’s Card (PVC) as many Nigerians do today, but they really do not vote on Election Day.\n2023 is approaching and presents another opportunity for Nigerians to vote in those they believe have the capacity to turn things around positively,” Tony Uwa, a political scientist, said.\nSo, there are too many reasons for every Nigerian to go vote in 2023.\n“Nigerians must come to vote, because when you don’t vote, don’t complain when someone who is not fit is elected."
  },
  {
    "headline": "More pain for Nigerian states as FAAC shrinks by N68bn in November",
    "summarized_story": "More pain for Nigerian states as FAAC shrinks by N68bn in NovemberThe ability of Nigerian states and other tiers of government to meet their various obligations is under more risk as gross monthly distribution by the Federation Account Allocation Committee (FAAC) to the three tiers of government dropped by N68billion in November.\nThe continuous decline in Nigeria’s FAAC allocation to the three tiers of government is also due to the subsidy payment, according to market analysts.\nThe Nigerian National Petroleum Corporation (NNPC) has been deducting from its remittance to FAAC, a threat to the ability of many Nigerian states and other tiers of government to meet their financial obligations.\n“Since June ’21, the corporation has deducted a total of N939bn from its FAAC remittance.\n“Incessant payment of subsidy on refined petroleum products would narrow FAAC allocations and widen the country’s budget deficit."
  },
  {
    "headline": "EdoGIS employs 50 new staff to improve efficiency, optimal service delivery – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government through the state’s skills development agency, Edojobs has recruited over 50 new personnel into the Edo State Geographical Information Service (EDOGIS), in a new drive to ensure efficiency and optimal service delivery at the service.\nThe recruitment process commenced in February 2021, with over 2000 applicants vying to fill the various positions.\nThe applicants were screened through different stages, involving both oral and written assessment and interviews.\nThe new staff include customer service representatives, geometricians, estate surveyors, GIS analysts, land administrators, facility manager, drivers, administrative assistants, legal assistants and accountants, among others.\n“In years past, before Governor Godwin Obaseki’s administration in Edo State, there was a massive job deficit in the state, which had cascading effects on society."
  },
  {
    "headline": "Obaseki gifts house, N1m to outstanding Edo teacher – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Wednesday, announced the gift of a house and the sum of N1 million to an outstanding Biology Teacher in the state, Mrs. Benedicta Idele, who emerged as the first runner-up in the 2020 Maltina Teacher of the Year Award.\nObaseki made the announcement when he received the teacher who was on a courtesy visit at the Government House in Benin City.\nAccording to him, “We cherish what you have done; we admire you and as a state, your efforts will not go unrecognized.\nA couple of years ago, another teacher won a similar award and as a government, we gifted her a house; that tradition has been established and you will also get one.\nEarlier, the awardee, a biology teacher in Asoro Grammar School, Egor Local Government Area of the state, attributed her success to the recent training she undertook which was organized by Edo State Government."
  },
  {
    "headline": "Obaseki swears in five SSAs, 12 SAs in Orhionmwon LGA – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has sworn in five Senior Special Assistants (SSAs) and 12 Special Assistants (SAs), following harmonization by leaders and members of the Peoples Democratic Party (PDP) in Orhionmwon Local Government Area (LGA).\nObaseki, who performed the inauguration ceremony in Abudu, the headquarters of Orhionmwon LGA, reiterated the need to encourage women participation in politics.\nI said for SSAs, they should give me five nominations and two of these people should be women.\nThey mobilized for us and now it’s time for them to get an appointment, but they were not nominated.\nWhen I came to campaign, we made promises and I am not the kind of leader that doesn’t fulfill promises."
  },
  {
    "headline": "Obaseki, Ibori, Kwankwaso, others pay last respects to Lucky Igbinedion’s mother, Maria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Friday, joined other eminent Nigerians to pay last tribute to late Mrs. Maria Oredola Igbinedion, mother of former Edo State Governor, Chief Lucky Igbinedion.\nGuests at the funeral mass held at St. Austin Catholic Church, Benin City include former Military Governor of Bendel State, Sen. Tunde Ogbeha; former Governor of Delta State, Chief James Ibori and former Governor of Kano State, Sen. Rabiu Kwankwaso.\nOthers are former Senate President, Pius Ayim Pius; former Imo State Governor, Achike Udenwa; former Edo State Deputy Governor, Mike Oghiadomhe and Sen. Matthew Urhoghide, among others.\nObaseki, who commiserated with the former governor, extolled the exemplary life of late Mrs. Maria Oredola Igbinedion, noting that she lived a fulfilled life, in service to God and humanity.\nMoses said late Maria Igbinedion exuded uncommon love and impacted positively on those who crossed her path while she was alive."
  },
  {
    "headline": "Airline row: Air Peace accuses UAE of spreading falsehood in letter to Nigerian govt",
    "summarized_story": "So, we never left Sharjah Airport nor did we at any time “shifted” and operated out of DXB (Dubai Airport).\nThe letter deliberately painted us as unserious while at the same time, suggesting that we look for other airports in the country to operate from,” Air Peace said.\nThey were later told that Air Peace would only be accepted if only it brought a small aircraft.\n(Air Peace initially operated at Sharjah Airport, shifted to Dubai Airport and then returned to Sharjah airport.\n“Finally, we suggest that Air Peace should consider flying their two other flights to any UAE airport at which there are available slots."
  },
  {
    "headline": "Football legend, Samuel Eto’o elected Cameroon FA president",
    "summarized_story": "Samuel Eto’o, former Cameroonian international football player, has been elected president of the country’s football association, and will run football in the country for the next four years.\nThe four-time African Footballer of the Year defeated rival Seidou Mbombo Njoya, the fourth vice-president at the Confederation of African Football.\nI’m deeply grateful for to be elected as the new president of @FecafootOfficie,” Eto’o said in a tweet on Saturday.\n“I’ve spoken to the business community and we’re certain we’ll get the right investors who can accompany us in fulfilling our goals,” Eto’o had said prior to the polls.\nHe signed a permanent deal with Mallorca in 2000, scoring 54 goals in 133 outings to establish himself as the team’s all-time leading scorer."
  },
  {
    "headline": "UAE minister justifies reduction of Air Peace slots as row with Nigeria escalates",
    "summarized_story": "(Air Peace initially operated at Sharjah Airport, shifted to Dubai Airport and then returned to Sharjah airport.\n“Finally, we suggest that Air Peace should consider flying their two other flights to any UAE airport at which there are available slots.\nAs expected, the GCAA will support Air Peace in this activity, where required.\n“Your Excellency, your kind support is anticipated so that the NCAA reviews their decision and restores the approval of the Emirates Airline Winter Schedule, as filed.\nWhile only one Nigerian airline operates internationally, one or two others operate on regional routes."
  },
  {
    "headline": "Alleged take over of Abuja Electricity: Court orders parties to maintain status quo",
    "summarized_story": "A Federal High Court sitting in Abuja, on Friday, ordered parties in a suit filed over the controversy on the alleged takeover of the Abuja Electricity Distribution Company (AEDC) to maintain status quo pending the next date of hearing.\nThe plaintiffs; CEC Africa Investments Limited and KANN Utility Company Limited, in a suit marked: FHC/ABJ/CS/1557/2021, had sued the Attorney General of the Federation (AGF) and Central Bank of Nigeria (CBN) as 1st and 2nd defendants, NAN reported.\nThe plaintiffs had sought an order restraining the AGF, CBN, BPE and Ministry of Finance from interfering with the operations and management of AEDC .\nAfter hearing the motion, Justice Ekwo ordered the parties to maintain status quo ante bellum pending the next date of hearing.\nHe adjourned the case until December 20 for hearing of the motion on notice."
  },
  {
    "headline": "BREAKING: Soun Of Ogbomoso Land Is Dead",
    "summarized_story": "The Soun Of Ogbomoso Land, His Imperial Majesty, Oba Jimoh Oladunni Oyewumi, JP, CON, CFR, Ajagungbade III, is dead.\nA palace source confirmed his demise to LEADERSHIP on Sunday morning.\nThe Soun passed on in the early hours of Sunday, December 12, 2021 at the age of 95.\nADVERTISEMENTAs the news of the foremost traditional ruler filtered out, shop owners hurriedly closed their shops as a mark of respect while residents troop to the Soun’s Palace in droves in order to confirm the development."
  },
  {
    "headline": "BREAKING: Soun Of Ogbomoso Land Is Dead",
    "summarized_story": "The Soun Of Ogbomoso Land, His Imperial Majesty, Oba Jimoh Oladunni Oyewumi, JP, CON, CFR, Ajagungbade III, is dead.\nA palace source confirmed his demise to LEADERSHIP on Sunday morning.\nThe Soun passed on in the early hours of Sunday, December 12, 2021 at the age of 95.\nADVERTISEMENTAs the news of the foremost traditional ruler filtered out, shop owners hurriedly closed their shops as a mark of respect while residents troop to the Soun’s Palace in droves in order to confirm the development."
  },
  {
    "headline": "Amnesty Office Faults Senate’s Query On N187m Stationery, Consultancy Fee",
    "summarized_story": "The Presidential Amnesty Office has faulted the senate on its query on a fake supply of stationery and consultancy services worth N187million that took place under the watch of Col. Milland Dixon Dikio as interim administrator of the scheme.\nAccording to the Amnesty Office, the purported reports suggesting that the transactions were done within Dikio’s tenure were the latest work of mischief makers, desperately seeking to discredit the interim administrator.\nHe said the amnesty office at no time received series of invitations from the senate as claimed by the reports.\nThe said incident for the supply of stationery and consultancy services for end of year, happened way back in 2017.\nADVERTISEMENT“It was therefore surprising that for obvious monetary gains, mischief and deliberate action to discredit the interim administrator, the authors of the story couldn’t verify from the office."
  },
  {
    "headline": "Amnesty Office Faults Senate’s Query On N187m Stationery, Consultancy Fee",
    "summarized_story": "The Presidential Amnesty Office has faulted the senate on its query on a fake supply of stationery and consultancy services worth N187million that took place under the watch of Col. Milland Dixon Dikio as interim administrator of the scheme.\nAccording to the Amnesty Office, the purported reports suggesting that the transactions were done within Dikio’s tenure were the latest work of mischief makers, desperately seeking to discredit the interim administrator.\nHe said the amnesty office at no time received series of invitations from the senate as claimed by the reports.\nThe said incident for the supply of stationery and consultancy services for end of year, happened way back in 2017.\nADVERTISEMENT“It was therefore surprising that for obvious monetary gains, mischief and deliberate action to discredit the interim administrator, the authors of the story couldn’t verify from the office."
  },
  {
    "headline": "Kaduna SUBEB Coercing Teachers To Write Competency Test – NUT",
    "summarized_story": "The Kaduna State chapter of the Nigeria Union of Teachers (NUT) has accused the Kaduna State Universal Basic Education Board of coercing its members to write the competency test it organised for public primary school teachers.\n“This is because whether we write the test or not, SUBEB is determined to disengage some of us by all means,” he said.\n“Prior to the test which began on Dec. 7, we collected commitment forms, duly signed by teachers indicating their resolve not to write the test.\nADVERTISEMENT“But to our surprise, Kaduna SUBEB hired some persons to pose as teachers to write the examination which they use to intimidate some of our members to write the examination,” he said.\nWhen contacted, the Director, Human Resource, Kaduna SUBEB, Mr Ahmed Sani, described the allegations as “baseless”."
  },
  {
    "headline": "N187m end-of-year spending: Senate summons amnesty office",
    "summarized_story": "The Senate Public Accounts Committee has summoned the management of the Presidential Amnesty Programme for allegedly paying N187m to organise end-of-the-year activities.\nThe money was meant for the supply of stationeries, consultancy services for an end-of-the-year meeting and vocational training.\nThe report indicted the Presidential Amnesty Programme for alleged financial mismanagement.\nReacting, however, the Presidential Amnesty Programme denied the allegation, insisting that reports suggesting that the transactions were done within the tenure of the Interim Administrator, Col. Milland Dikio, were the handiwork of persons desperately seeking to discredit him.\nThe SPAC at its sitting on Thursday noted with concern that a series of invitations had earlier been extended to the Presidential Amnesty Programme but that none of its representatives appeared."
  },
  {
    "headline": "N187m end-of-year spending: Senate summons amnesty office",
    "summarized_story": "The Senate Public Accounts Committee has summoned the management of the Presidential Amnesty Programme for allegedly paying N187m to organise end-of-the-year activities.\nThe money was meant for the supply of stationeries, consultancy services for an end-of-the-year meeting and vocational training.\nThe report indicted the Presidential Amnesty Programme for alleged financial mismanagement.\nReacting, however, the Presidential Amnesty Programme denied the allegation, insisting that reports suggesting that the transactions were done within the tenure of the Interim Administrator, Col. Milland Dikio, were the handiwork of persons desperately seeking to discredit him.\nThe SPAC at its sitting on Thursday noted with concern that a series of invitations had earlier been extended to the Presidential Amnesty Programme but that none of its representatives appeared."
  },
  {
    "headline": "Finance bill: TIN doesn’t compel everyone to pay tax, experts tell FG",
    "summarized_story": "Former President, Olusegun Obasanjo, has warned traditional rulers in Yoruba land against an open endorsement of any political office seeker, saying their role should end in offering prayers for whoever visit them to discuss politics.\nHe also told Ooni of Ife, Oba Adeyeye Ogunwusi, not to direct Yoruba people to support any aspirant for political position, because the race was not known for following a single political party.\nExplaining that it was not out of place for Ooni to forgive some individuals for the roles they played during the struggle to fill the throne, Obasanjo, however said the monarch should be careful with political office seekers.\nReferring to Ooni, Obasanjo further said, “I like your spirit.\nThose coming to meet you now, if God had permitted them, you would not be in this position and you know that."
  },
  {
    "headline": "Finance bill: TIN doesn’t compel everyone to pay tax, experts tell FG",
    "summarized_story": "Former President, Olusegun Obasanjo, has warned traditional rulers in Yoruba land against an open endorsement of any political office seeker, saying their role should end in offering prayers for whoever visit them to discuss politics.\nHe also told Ooni of Ife, Oba Adeyeye Ogunwusi, not to direct Yoruba people to support any aspirant for political position, because the race was not known for following a single political party.\nExplaining that it was not out of place for Ooni to forgive some individuals for the roles they played during the struggle to fill the throne, Obasanjo, however said the monarch should be careful with political office seekers.\nReferring to Ooni, Obasanjo further said, “I like your spirit.\nThose coming to meet you now, if God had permitted them, you would not be in this position and you know that."
  },
  {
    "headline": "How Andy Uba wants to overturn Soludo’s victory",
    "summarized_story": "Sylvester Ezeokenwa, one of the lawyers of Anambra governor elect, Charles Soludo has alleged that Andy Uba candidate of the All Progressives Party (APC) in the November election is hoping that a judge can be compromised to upturn Soludo’s victory.\nHe said this after revealing that Soludo team had reached out to Uba, and there is no hope the aggrieved APC candidate would withdraw his petition.\nEzeokenwa said, “Uba’s hope is solely hinged on the belief that that the judges can be compromised.\nAnatune said the APGA’s victory would be upheld by the court because the election was the peaceful, free, and fair.\nAnatune revealed that all the stakeholders in Anambra have urged Uba to accept defeat and congratulate Soludo, but “he has made up his mind to go to court and there is nothing anybody can do.”"
  },
  {
    "headline": "DSS calls more synergy among security agencies",
    "summarized_story": "By Sumaila OgbajeDirector-General, Department of State Services (DSS), Mr Yusuf Bichi, has called for more collaboration among the law enforcement agencies to end security challenges facing the nation.\nThe DSS DG made the call during the Annual Lecture and Fourth Investiture of the Institute of Security and Strategic Studies (ISSS) on Saturday in Abuja.\nRepresented by the DSS Spokesman, Dr Peter Afunanya, Bichi said that security could only be enhanced or achieved through collaborative efforts among all the security agencies.\nNAN reports that the institute also honoured the governors of Borno, Nasarawa and Zamfara States as fellows for their outstanding contributions to national security.\nThe Chairman, Governing Council of ISSS, retired Maj.-Gen. Garba Audu, said the investiture and awards were in recognition their contributions to national security."
  },
  {
    "headline": "BREAKING: Hausa Group Calls For Buhari’s Resignation, Says President Spares Fulani Bandits But After Kanu, Igboho",
    "summarized_story": "The Hausa Association of Nigeria (Kungiyar Hausawan Nijeriya or KUNHAN) has called on President Muhammadu Buhari to resign as a result of his administration’s apparent failings.\nThe association noted that the “Hausas regret supporting and voting” for Buhari massively.\nOn so many occasions, you have bragged to crush the bandits and proclaimed to take necessary action but all in vain.\nThe answer is one, because they are not a threat to this administration while those that seem to be a threat are already in jail; Nnamdi Kanu and Sunday Igboho.\n“That’s why a whole Minister of Information named them just an ordinary criminal but called Nnamdi Kanu a terrorist."
  },
  {
    "headline": "BREAKING: Soun Of Ogbomosho, Oba Ajagungbade, Is Dead",
    "summarized_story": "Soun of Ogbomosoland, Oba Oladunni Oyewumi Ajagungbade III is dead.\nIt was gathered that the monarch died early Sunday morning at the age of 95 after spending 47 years on the throne.\nPalace sources confirmed his death to Vanguard but stated that his death has not been officially announced.\nHe ascended the throne on October 24, 1973.\nHe was born on May 27, 1926, in Ogbomoso to Oba Bello Afolabi Oyewumi Ajagungbade II and Ayaba Seliat Olatundun Oyewumi."
  },
  {
    "headline": "BREAKING: Popular Yoruba King Is Dead",
    "summarized_story": "His Imperial Majesty, Oba Jimoh Oladunni Oyewumi JP CON, CFR, Ajagungbade III, the Soun Of Ogbomoso Land, has died..A family member confirmed his demise to Tribune Online.\nThe Soun passed on in the early on Sunday, December 12, 2021.\nOba Oyewumi was born on May 27, 1926 in Ogbomoso to Oba Bello Afolabi Oyewumi Ajagungbade II and he ascended the throne of his father on October 24, 1973.\nThe monarch lost one of his sons, Pastor Olumide Oyewumi in December 2020.\nThe death of Olumide, who was a Chief Accountant at the Ladoke Akintola University of Technology, Ogbomoso was said to have shaken the monarch."
  },
  {
    "headline": "Stop Open Support For Political Office Seekers, Obasanjo Tells Ooni Of Ife And Others",
    "summarized_story": "Former President Olusegun Obasanjo has urged Yoruba traditional rulers against openly endorsing any political candidate, saying their role should be limited to providing prayers to those who come to them to talk politics.\nHe also told Ooni of Ife, Oba Adeyeye Ogunwusi, not to direct Yoruba people to support any aspirant for political position, because the race was not known for following a single political party.\nExplaining that it was not out of place for Ooni to forgive some individuals for the roles they played during the struggle to fill the throne, Obasanjo, however said the monarch should be careful with political office seekers.\nReferring to Ooni, Obasanjo further said, “I like your spirit.\nThose coming to meet you now, if God had permitted them, you would not be in this position and you know that."
  },
  {
    "headline": "After collecting ransom, terrorists kill Pastor",
    "summarized_story": "Thirty days after in captivity, a Pastor of the Evangelical Church Winning All in Nariya, Igabi Local Government Area of Kaduna State, Rev.\nThis was revealed by the Chairman of the Christian Association of Nigeria in Kaduna State, Rev.\nThe pastor was said to have been killed after his wife delivered part of the N5 million ransom demanded.\nPastor Bature was abducted on his farm on November 8, 2021, with his abductors demanding N5 million as ransom.\nHis wife was reported to have gone to deliver part of the ransom when she too was kidnapped."
  },
  {
    "headline": "7 years after, Big Brother Africa returns",
    "summarized_story": "Seven years after, a reality television show Big Brother Africa is staging a comeback.\nThis was disclosed by the organisers, MultiChoice’ South African TV network, Mzansi Magic, with assurance that the show is expected to be launched in 2022.\nAlready, casting has begun in earnest for the show, tagged ‘Big Brother Mzansi’, and produced by Randburg-based Red Pepper, according to the organisers.\nTalking about the forthcoming show, M-Net’s Executive Head of Programming, Nomsa Philiso, said: “This year marks 20 years since the very first Big Brother on MultiChoice’s M-Net and we are excited to celebrate this milestone by commissioning a new Big Brother season, which will be housed under our Mzansi Magic stable.\n⁣“This is a show that has always delivered top ratings and entertainment value, and our viewer and advertising partners can look forward to a stellar season of Big Brother.”⁣The last season of the show was aired in 2015 with Ace Khumalo and Ntombi Tshabalala emerging winners.⁣⁣"
  },
  {
    "headline": "Breaking: Tragedy hits US as 70 die in worst Kentucky’s tornadoes",
    "summarized_story": "The governor of the US state of Kentucky has said that more than 70 people were killed by tornadoes on Friday night.\nAndy Beshear said the figure could rise to more than 100 in what he called the worst tornadoes in the state’s history.\nAt least five people died as tornadoes wreaked havoc in other states, including one in an Amazon warehouse in Illinois.\nMore than 100 people were inside the Mayfield factory when the tornado hit, he said.\nThe Amazon warehouse in Edwardsville in southern Illinois was damaged during a tornado on Friday night, the authorities said."
  },
  {
    "headline": "SERAP Asks Lawan, Gbajabiamila To Probe ‘Missing N10bn NASS Funds In 2019’",
    "summarized_story": "The Socio-Economic Rights and Accountability Project (SERAP) has urged the Senate President, Ahmad Lawan, and Speaker of House of Representatives Mr Femi Gbajabiamila to investigate the N10 billion funds budgeted to the National Assembly said to be missing.\nSERAP added, “As part of its legislative and oversight functions, the National Assembly has a key role to play in the fight against corruption in the country.\nBut the National Assembly can only effectively perform its anti-corruption role if it can demonstrate exemplary leadership to probe the allegations of corruption and mismanagement involving the legislative body.\nThe National Assembly, therefore, has a responsibility to curb it.\n“The National Assembly Service Commission reportedly paid N31,927,760 as cash advances to 59 staff but failed to account for the money."
  },
  {
    "headline": "Young Graduates Can Solve Nigeria’s Biggest Problems, Says Osinbajo",
    "summarized_story": "Vice President Yemi Osinbajo on Saturday expressed optimism that young Nigerian graduates can provide solutions to the biggest challenges confronting the nation.\nHe made the remark while speaking at the 60th anniversary of the Obafemi Awolowo University (OAU), Ile-Ife, in Osun State, according to a statement signed by presidential spokesperson, Laolu Akande.\nYou will have to confront the problems of climate change and a world moving away from fossil fuels, and you will usher in the age of renewable energy and green solutions,” the Vice President said.\nHe added that this generation of young Nigerians are equipped and could proffer solutions in the areas of education, agriculture, health care and security.\nAt the end of the Convocation, the Vice Chancellor of the University, Prof. Eyitayo Ogunbodede, conducted the VP and other dignitaries around an arts exhibition to commemorate the event."
  },
  {
    "headline": "Bandits Kill Pastor, Abduct Woman And Four Children In Kaduna",
    "summarized_story": "Bandits have killed one Pastor Dauda Bature who was in charge of the Evangelical Church Winning All (ECWA) parish in the Narayi area of Chikun Local Government Area (LGA) of Kaduna State.\nThe source who does not want his identity disclosed explained that the bandits kidnapped Bature on November 8 while he was working on his farm.\nREAD ALSO: Army Chief Warns Of Possible Increase In Activities Of Bandits, Terrorists By 2022In a related development, bandits invaded Oil village in Chikun LGA where they forcefully took away a woman and her four children to an unknown location.\nThe command’s spokesman explained that the criminals, who were frustrated by the police and other security operatives, set the residence ablaze and fled into the bush.\nAccording to Jalige, the police have launched investigations into the two incidents and effort is ongoing to rescue the abducted victims."
  },
  {
    "headline": "Army Chief Warns Of Possible Increase In Activities Of Bandits, Terrorists By 2022",
    "summarized_story": "The Chief of Army Staff (COAS), Lieutenant General Farouk Yahaya, has called on commanders of various theatres of operation to prepare for a possible increase in attacks by bandits and terrorists among other criminal elements disturbing the peace of the nation.\nHe made the call on Friday in Abuja while addressing senior officers at the closing ceremony of the COAS Annual Conference 2021.\n“We must take the fight to the adversary in order to neutralise and defeat them,” the army chief said in his charge to officers and soldiers fighting insecurity in various parts of the country.\n“Commanders are also urged to develop contingency plans to ensure our forces always retain the initiative in all our theatres of operation.\nAccording to the army chief, participants also deliberated the various security issues plaguing the nation, including the activities of bandits, terrorists, and secessionists among others."
  },
  {
    "headline": "NDLEA Arrests Ghanaian, Two Others With 9.9kg Cocaine, Meth",
    "summarized_story": "A Ghanaian and two Nigerians have been arrested for allegedly trafficking a total of 9.953 kilograms of Cocaine and Methamphetamine.\nThe National Drug Law Enforcement Agency which disclosed this via a statement on Sunday said the suspects were apprehended at the Nnamdi Azikiwe International Airport, Abuja and Akanu Ibiam International Airport, Enugu respectively.\nREAD ALSO: Police Arrest Pastor, Wife For Allegedly Conniving To Rape Teenage ChoristerSimilarly, another trafficker, Udeh Charley was arrested at the Enugu airport for ingesting 72 wraps of Cocaine weighing 1.253kilograms.\nA search of his bag showed that the drug was concealed in a false bottom of his checked-in luggage.\nGen. Mohamed Buba Marwa (rtd) commended the officers and men of Enugu, Abuja airports commands and their counterparts for the arrests and seizures in the past week."
  },
  {
    "headline": "ECOWAS council considers two-term limits for presidents in the region",
    "summarized_story": "ECOWAS council considers two-term limits for presidents in the region"
  },
  {
    "headline": "Akeredolu's aide accuses Federal Fire Service of damaging his vehicle -",
    "summarized_story": "A Special Assistant to the Ondo state Governor, Oluwarotimi Akeredolu on Multimedia, Olugbenga Asade, has accused the Federal Fire Service Corps (Ondo State) of damaging his vehicle.\nHe noted that two months after damaging his vehicle, nothing has been done to fix it by the fire fighters.\nThey declined my request to see the driver that crashed my vehicle.\nHe therefore requested, that the Federal Fire Service Corps should provide the truck driver that crashed his vehicle with an apology for absconding and as well, take responsibility of fixing his damaged vehicle.\nAccording to him, the Federal Fire service in the state has continued to turn deaf ears to his plea."
  },
  {
    "headline": "[WATCH] Bisi Akande unveils Autobiography entitled 'My Participations'",
    "summarized_story": ""
  },
  {
    "headline": "Updated: 28-year-old female lawyer nominated commissioner in Nasarawa -",
    "summarized_story": "A 28 year old female lawyer, Hannah Bala, has been nominated as a Commissioner by the Nasarawa State Governor, Abdullahi Sule.\nThe nomination of the female lawyer was announced at the state House of Assembly by the Speaker, Ibrahim Balarabe.\nThis follows the presentation of fifteen commissioner nominees to the assembly for consideration.\nSpeaking on her nomination, the Nasarawa State governor, Abdullahi Sule through his Chief Press Secretary, said the decision is to encourage and ensure active participation of the youths in governance.\nHannah graduated from the Nasarawa State University Keffi in 2016 and proceeded to the Nigerian law school where she graduated in 2018."
  },
  {
    "headline": "South African Doctors See Signs Omicron is Milder Than Delta",
    "summarized_story": "As the omicron variant sweeps through South Africa, Dr. Unben Pillay is seeing dozens of sick patients a day.\nThat’s one of the reasons why he, along with other doctors and medical experts, suspect that the omicron version really is causing milder COVID-19 than delta, even if it seems to be spreading faster.\nWhile delta is still the dominant coronavirus strain worldwide, omicron cases are popping up in dozens of countries, with South Africa the epicenter.\nPillay says his COVID-19 patients during the last delta wave “had trouble breathing and lower oxygen levels.\nPillay is a director of an association representing some 5,000 general practitioners across South Africa, and his colleagues have documented similar observations about omicron."
  },
  {
    "headline": "Crews Search for the Missing after Devastating Tornadoes Hit Central US",
    "summarized_story": "Andy Beshear said, as crews sifted through the wreckage of the candle factory in Mayfield, where 110 people were working overnight Friday when the storm hit.\nThe storm was all the more remarkable because it came in December, when normally colder weather limits tornadoes, he said.\nKentucky State Trooper Sarah Burgess said rescue crews were using heavy equipment to move rubble at the candle factory.\nRescue efforts were complicated because Mayfield’s main fire station and emergency services hub were also hit by the tornado, Creason said.\nIt’s a total destruction.”Four storm-related deaths were confirmed in northwestern Tennessee, the Tennessee Emergency Management Agency said."
  },
  {
    "headline": "Cameroon Legend Samuel Eto’o Elected President of His Country’s Football Federation",
    "summarized_story": "Four-time African Footballer of the Year Samuel Eto’o was elected president of the Cameroon Football Federation (FECAFOOT) on Saturday, deposing the incumbent after a disputed campaign a month before the country hosts the African Cup of Nations.\nThe former Cameroon striker, who lifted the Champions League with Barcelona and Inter Milan, won the election with 43 votes from members of FECAFOOT’s general assembly.\nOutgoing president Seidou Mbombo Njoya, who is also a Confederation of African Football vice president, got 31 votes.\nEto’o, 40, will take over an organisation long tainted by infighting, mismanagement and allegations of corruption.\nHe received widespread support from many former team mates in a high profile campaign during which he pledged to rid the game in Cameroon of corruption."
  },
  {
    "headline": "Nigeria: Don’t Direct Yoruba to Support Any Aspirant in 2023, Obasanjo Tells Ooni",
    "summarized_story": "Former President Olusegun Obasanjo on Saturday urged the Ooni of Ife, Oba Adeyeye Ogunwusi, not to direct the Yoruba people to support any aspirant in the 2023 general election.\n“Don’t direct Yoruba people to support any aspirant, as we don’t all go in the same direction, which is part of our strength in Yoruba land,” he said.\nHe advised the monarch to strike a balance between his role as a royal father and politics in Yoruba land.\n“All the sons and daughters of Yoruba land, no matter where they are or their standpoint, will come to meet you.\n“Don’t direct Yoruba people to support any aspirant, as we don’t all go in the same direction, which is part of our strength in Yoruba land,” Obasanjo said."
  },
  {
    "headline": "Sokoto Governor Tambuwal Says Defective Military Operations in Zamfara Made His State Vulnerable to Attacks",
    "summarized_story": "Sokoto State Governor, Hon.\nThis is coming as the pastor of the Evangelical Church Winning All (ECWA), Nariya, Igabi Local Government Area of Kaduna State, Rev.\n“Operation Hadarin Daji, the precursor of the escalation of tension and crisis in Sokoto State was carried out without any blocking force around the neighbouring states, particularly Sokoto State,” he said.\n“It does appear as if those bandits pursued from Zamfara State have relocated to Sokoto State.\nThe hoodlums were said to have invaded Sabon Tasha GRA and Anguwan Bulus simultaneously in the early hours of Saturday."
  }
]