[
  {
    "headline": "Gov Ayade’s wife kicks off health insurance scheme",
    "summarized_story": "The wife of the Cross River State Governor, Dr Linda Ayade, has kicked off the health insurance scheme also known as Ayade Care.\nThe event took place on Tuesday at the Primary Health Care facility at Big Qua in Calabar.\nWe will continue to deliver the best of health care for the people of Cross River State.”According to her, ill-health happens suddenly, adding “it is not something we prepare for.\n'”She urged the people of Cross River to key into the scheme to take advantage of the many benefits.\nAlso speaking, the Director-General of state Primary Health Care Development Agency, Janet Ekpenyong said, “Health insurance is the most sustainable way of funding health."
  },
  {
    "headline": "Bandits kill lawmaker, kidnap others along Kaduna-Zaria highway",
    "summarized_story": "Bandits have killed a member of the Kaduna State House of Assembly, Rilwanu Gadagau, and abducted many others along the Kaduna-Zaria highway.\nThe Clerk, Kaduna State House of Assembly, Bello Zubairu, confirmed the incident to newsmen in Kaduna on Wednesday.\nMeanwhile, the Speaker of the State House Assembly, Yusuf Zailani has described as devastating, the death of the lawmaker.\nThe statement noted that the remains of the lawmaker were discovered in a morgue on Wednesday, among those killed by bandits on Monday night along Kaduna-Zaria Highway.\nThe speaker prayed for Almighty Allah to grant the state, assembly, and his family the fortitude to bear the loss."
  },
  {
    "headline": "Lai: No administration has tackled insecurity than Buhari",
    "summarized_story": "By Soni DanielMinister of Information, Alhaji Lai Mohamed boasted on Wednesday that without President Muhammadu Buhari Nigeria’s security situation would have been worse.\nAt a news conference in Abuja, Mohammed said that Buhari had made the issue of security a major plank of his administration.\n“Buhari has provided quality leadership to motivate security agencies to tackle insecurity,” the minister boasted.\n“No other administration has tackled insecurity than Buhari,” Mohammed added.\nVanguard News Nigeria"
  },
  {
    "headline": "Ore-Ondo road now a death trap; haven for kidnappers, armed robbers — Ondo Rep member",
    "summarized_story": "Hon Makinde calls for immediate dualization of Ore-Ondo road…Dayo Johnson AkureThe member representing Ondo West and Ondo East federal constituency in the House of Representatives, Hon.\nAbiola Peter Makinde has called for the immediate dualization of the Ore–Ondo Federal road, in Ondo state.\nMakinde moved the motion at the green chamber following the sorry state of the road and the delay in its dualization by the Federal Ministry of Works and Housing.\nThe Rep member who doubles as the Deputy Chairman, House Committee on Federal Character said that the Ore-Ondo city federal road is connected to over five Federal Constituencies and many other towns in Ondo, Edo, and Osun States.\nAccording to him” the road has been earmarked for dualisation by the Federal Ministry of Works and Housing some years ago."
  },
  {
    "headline": "Suspected bandits kill Kaduna lawmaker",
    "summarized_story": "By Ibrahim Hassan-WuyoHon Rilwanu Aminu GadagauA member of the Kaduna State House of Assembly, Hon Rilwanu Aminu Gadagau, has been killed allegedly by bandits.\nGadagau was Chairman, Committee on Local Government and Rural Development, in the State House of Assembly.\nThe report of his death was heard in Kaduna on Wednesday morning.\nAn official of the Kaduna State House of Assembly confirmed the development on phone, even as journalists await the details from concerned authorities.\nOn a visit to the Assembly complex, few people were seen discussing the incident, even as stern-looking security men were positioned at the main entrance keeping vigil."
  },
  {
    "headline": "Breaking: CNG, security agents clash in Kano",
    "summarized_story": "Members of Coalition of Northern Groups, CNG, who converged on Kano for a press briefing have been dismissed by security agents.\nVanguard learned that CNG members had converged on Farm Centre to brief the press on security and planned fuel hike among other issues.\nThe venue of the event has been sealed as of press time.\nMeanwhile, there is heavy security in strategic places in Kano metropolis.\nDetails later…"
  },
  {
    "headline": "Aiteo’s spill impacted our fishing, farming, say Bayelsa-Rivers communities",
    "summarized_story": "Daniel said that the massive leak did not only affect Nembe communities but also his communities criss-crossing the two neighbouring council areas in both states.\nAlso at the event are some paramount rulers of Abureni communities, including Chief Inatimi Okiori, Chief Milton Eghoi-Ikoni, Chief James Ewa-Adisa, Chief Simeon Opuso and Chief Michael Edighotu.\nDaniel listed some of the impacted communities to include, Idema, Eboh, Obeduma, Iduma, Emago-Kugbo, Akani (Oghan), Amorokeni, Amuruto I and II, Oruan (Atubo I), Emalo and Abu.\n“Justice should be done to all host, affected and impacted communities and individuals, including non-indigenes doing businesses on our land.” Collins said.\nThe management of Aiteo had in two separate occasions within the past one month sent trucks of food items, medical supplies and cash donations to the impacted communities."
  },
  {
    "headline": "Senate refers Buhari’s INEC nominees to committee",
    "summarized_story": "The Senate on Wednesday referred President Muhammadu Buhari’s nominees to serve as Resident Electoral Commissioners of the Independent National Electoral Commission (INEC) to the Committee on INEC.\nThe referral followed the receipt of executive communication which was read on the floor of the Red Chamber by the Senate President, Dr Ahmad Ibrahim Lawan, on Tuesday.\nMohammed Haruna – National Commissioner (North Central)2.\nUkeagu Kenneth Nnamdi – National Commissioner (South East)4.\nMr Sam Olumekun – National Commissioner (South West)7."
  },
  {
    "headline": "You’re torturing Nnamdi Kanu psychologically, mentally – Lawyer replies DSS",
    "summarized_story": "Ifeanyi Ejiofor, lead counsel of Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has accused the Department of State Services, DSS, of torturing the pro-Biafra agitator psychologically and mentally in detention.\nEjiofor made the remark while accusing DSS spokesman, Peter Afunaya, of deliberately feeding the Public with the falsehood that Kanu lives a luxurious life in detention.\nIn a statement, the counsel said the secret police placed the IPOB leader on 23-hour solitary confinement.\n“Our Client, Nnamdi Kanu need not be subjected to daily beatings and flogging by the personnel of the DSS before he can be qualified as being tortured – No!\nHe insisted that DSS lied over claims that Kanu is allowed to change his clothes in detention."
  },
  {
    "headline": "Ohanaeze lauds release of N3.2bn for payment of salary, pension arrears for Abia workers",
    "summarized_story": "The Pan-Igbo socio-cultural organization, Ohanaeze Ndigbo, has applauded Governor Okezie Ikpeazu of Abia State for the release of over N3.2 billion for payment of salary and pension arrears to workers in the state.\nMazi Okechukwu Isiguzoro, the Secretary-General of the group, made the commendation in a statement on Wednesday, reaffirming the confidence in Ikpeazu and other performing governors in the southeast.\nIsiguzoro further opined that the governor has set the pace for the steady growth of the state and also posited that Ikpeazu has remained undeterred and resolute on his administration’s policies and programmes teethed to enhancing the welfare of the people.\nThe Secretary-General commended the members of the Abia State House of Assembly for their unshaken support to the executive arm in Abia, urging them to continue to sustain the healthy and harmonious relationship with Ikpeazu to enable him to bring more dividends of democracy to the doorsteps of the people.\nThe Ohanaeze chieftain, however, urged the people of Abia state to sustain their supports and cooperation with the Okezie Ikpeazu-led government as it is committed to bequeathing an infrastructurally and economically stable Abia before he leaves office."
  },
  {
    "headline": "Shun fake news, promote peaceful coexistence – DSS to media",
    "summarized_story": "The Department of State Services, DSS, has called on the media to be mindful of its duty in national security.\nA statement from Peter Afunanya, Public Relations Officer of the DSS, on Tuesday said as influencers, media practitioners should use their platforms to pursue peaceful coexistence.\n“They must commit themselves to the unity of the country and shun misinformation, fake news, hate speech and such other misleading narratives.\nThe service also advised citizens and residents to cooperate with security and law enforcement agencies for lasting peace in the country.\nThe Director-General, management and staff of the DSS appreciated Nigerians for their support in ensuring peace and security in the country."
  },
  {
    "headline": "Olowu: Akinlade, Aderinokun mourn Oba Dosunmu",
    "summarized_story": "A former governorship candidate in Ogun State, Hon.\nAdekunle Akinlade, has expressed sadness over the demise of the Olowu of Owu Kingdom, Oba Adegboyega Dosunmu, who passed on Sunday after a brief illness.\nThe former lawmaker noted that Owu will forever miss the monarch’s sincere counsel, fatherly and royal mentorship.\nHe said, “Kabiyesi was kind with a sharp and dauntless wit as he took bold steps in advancing several initiatives, which will naturally outlive him.\nWhile appreciating God for the fulfilled and good life of the first-class King, Aderinokun prayed that the Lord grant the family, the people of Owu and Ogun State the fortitude to bear the loss."
  },
  {
    "headline": "‘My wife’s death left me emotionally empty’",
    "summarized_story": "Former All Progressives Congress (APC) National Chairman Chief Bisi Akande has said the death of his wife, Mowumi, left him emotionally empty.\nIn his book, ‘My Participations’, he said despite the care from his children and friends, he has not been able to get over his wife’s death.\n“Sometimes I move round my room in lonely soliloquy with the imaginary sentiment that my wife would suddenly answer me.\nHe added that the way his children celebrate their mother makes death inviting to him.\n“And I have been praying to die such a painless death and for my funeral to be as glorious as that of my wife,” he wrote."
  },
  {
    "headline": "‘Friends used my home for romantic escapades’",
    "summarized_story": "As a young man, friends used the home of former All Progressives Congress (APC) National Chairman Chief Bisi Akande for romantic escapades.\nHe said though he was earning a good salary at the British Petroleum Marketing Company in Lagos, he was always broke because he roamed about, drank with friends and spent beyond his means.\nIt took his marriage to Mowumi on December 26, 1966 for his life to change.\nHe met Mowumi in Ila-Orangun on a day a policeman was threatening to pounce on her.\n- Advertisement -“It appeared to me however that marriage made me so responsible that friends who used to use my apartment for their romantic escapades stopped and began to treat our home with respect."
  },
  {
    "headline": "'Soyinka told me to prepare for war on my autobiography'",
    "summarized_story": "Nobel Laureate Prof. Wole Soyinka foretold the controversies being generated by ‘My Participation’, the autobiography of ex-Osun State Governor Chief Bisi Akande.\nHe also said President Muhammadu Buhari reneged on his promise to make Tinubu his running mate in 2015.\nThey told us they needed to hold a meeting and take a decision.\n“Nyako of Adamawa told us at a stage that he would leave them behind and join us on his own.\n“When we got to Kano House, the New-PDP leaders had prepared a document listing conditions under which they would accept to join us."
  },
  {
    "headline": "APC miracle would have been difficult without Tinubu, says Akande",
    "summarized_story": "Ex-All Progressives Congress (APC) National Chairman Chief Bisi Akande has said the feats achieved by the party in the 2015 polls would have been difficult or impossible without ex-Lagos State Governor Asiwaju Bola Tinubu.\n- Advertisement -He added that Buhari offered Tinubu the running mate slot in 2014 even when he had not secured the party’s ticket.\n‘How could he be talking of a running mate when he had not secured the ticket?’ I mused.\nHe said Tinubu became angry with Buhari and refused to join a discussion on the running mate initiated by Senator Ibikunle Amosun.\nSo, let him choose on his own,” Akande quoted Tinubu to have said."
  },
  {
    "headline": "APC didn’t have ‘restructuring’ in its 2015 manifesto, says Akande",
    "summarized_story": "*’Jonathan not sincere with National Conference’*’Adebanjo knows he lacks what it takes to aspire for high political positions’Ex-All Progressives Congress (APC) National Chairman Chief Bisi Akande has said the party did not have ‘restructuring’ in its 2015 manifesto.\nHe said the Goodluck Jonathan administration was not sincere with the National Conference.\n“Therefore, as the interim National Chairman of APC, I knew that I should quickly place the invitation on the Jonathan Conference before my party’s interim National Executive Committee.\nPresident Jonathan truly and deliberately did not place the Conference’s report and resolutions before the National Assembly throughout his years in power.\nHe went on: “APC did not have ‘Restructuring’ in its manifesto for the 2015 elections but promised to support devolution of power from the centre to the states."
  },
  {
    "headline": "BREAKING: Insecurity: Buhari has done better than you, FG fires back at Obasanjo, critics",
    "summarized_story": "From Adetutu Folasade-Koyi, AbujaThe Federal Government has faulted former president Olusegun’s assertion that President Muhammadu Buhari has nothing more to offer Nigerians.\nThe federal government boasted that Nigeria is safer today than it was in 2015.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nGovernment, through the Minister of Information and Culture, Alhaji Lai Mohammed, at a press conference in Abuja, yes, insisted that Buhari has done better than his predecessors in tackling insecurity, amidst very difficult economic and social conditions.\nClick Here to Apply ."
  },
  {
    "headline": "Chinese COVID-19 vaccines to be produced in Nigeria",
    "summarized_story": "The Ambassador of the People’s Republic of China to Nigeria, Cui Jianchun, has said China and Nigeria are in the process of ensuring the production of COVID-19 vaccines in the country.\nThew envoy said both countries had no problem in cooperating in the donation of Chinese vaccines, saying that the second issue on the table between the two countries was how to build production line in Nigeria.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\n“I think that in the coming months, you will know the exact news, the information on how can the two countries work together,” Cui added.\nEarlier, the Chinese Ambassador noted that donation of vaccines was very important to Nigeria because vaccines cannot be produced in the country."
  },
  {
    "headline": "Omicron: UK bows, removes Nigeria from red list",
    "summarized_story": "The UK, while bowing to pressure also expunged 10 other African countries from its red list.\nAlso, in a statement, British High Commissioner to Nigeria, Catriona Laing CB said: “On Tuesday 14th December, UK Ministers made the decision – based on scientific and public health data – to remove Nigeria from the UK’s travel red list.\nNow that there are high levels of community transmission, it is right to remove the red list and focus on our national effort to tackle Omicron.\nCurrently, all UK arrivals from red list countries must pay for and self-isolate in a pre-booked, government-approved hotel for 10 days.\nMinister of aviation, Hadi Sirika, said it was to reciprocate the travel ban placed on Nigeria over the new COVID-19 variant, Omicron."
  },
  {
    "headline": "2023: Muslim/Muslim presidential ticket plot satanic –PFN",
    "summarized_story": "From Oluseye Ojo, IbadanThe Pentecostal Fellowship of Nigeria (PFN) claimed it has discovered plans by some political parties to foist Muslim/Muslim ticket on the nation.\nIt warned that any political arrangement short of producing a Christian president in 2023 would be unacceptable.\n“Anyone flying a Muslim/Muslim presidential ticket is satanic and from the pit of hell.The Lord, God of hosts, will crush that satanic agenda.\nAny party that flies a Muslim/Muslim presidential ticket has failed completely.\nWhat we want is a Christian President."
  },
  {
    "headline": "Nigeria’s debt hits N38.005trn –DMO",
    "summarized_story": "From Uche Usim, AbujaNigeria’s sovereign debt stock, as at September 30 stood at N38.005 trillion or $92.626 billion, the Debt Management Office (DMO) has said.\nThe debt comprises total external and domestic loans of the Federal Government, 36 states and the FCT.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nHowever, the Minister of Finance, Budget and National Planning, Mrs Zainab Ahmed, has severally insisted that Nigeria does not have a debt problem.\nCommenting on Nigeria’s ballooning debt profile, a former Imo State Finance Commissioner, Prof Uche Uwaleke, explained that the crash in revenue generation always leads the Nigerian government to borrow."
  },
  {
    "headline": "News in Photographs: Buhari Presides over Virtual FEC Meeting",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari on Wednesday presided over the weekly virtual meeting of the Federal Executive Council (FEC) at the State House, Abuja.\nThose personally attending the meeting include Vice President Yemi Osinbajo; Chief of Staff to the President, Prof Ibrahim Gambari and Secretary to the Government of the Federation, Boss Mustapha.\nMinisters in attendance include that of Works and Housing, Babatunde Fashola; Communications and Digital Economy, Dr Isa Pantami; Power, Abdullahi Aliyu as well as the Head of Service of the Federation, Dr Folashade Yemi-Esan.\nOther Ministers are attending the meeting virtually from their various offices in Abuja.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Obaigbena Advocates Security Tax to Effectively Fund Police, Others",
    "summarized_story": "Urges Buhari to sign Electoral Act Amendment BillThe Chairman of THISDAY Group and ARISE News Channel, Prince Nduka Obaigbena, has advised the federal government to introduce security tax in order to effectively fund security agencies and curb the rising cases of insecurity in the country.\nKuru, in his tribute during the lecture to honour Sam Nda-Isaiah, said he had never come across such a passionate person like Sam.\nThe late Sam Nda-Isaiah will be happy that he is remembered by those he called friends.\n“We converge here to remember Sam who left us a year ago.\n“Over the course of his life, Sam ventured into diverse fields for as wide as his imaginations could take him."
  },
  {
    "headline": "Tinubu: I Won’t Decline Calls to Contest for Presidency",
    "summarized_story": "By this statement, Tinubu has made it clear that his resolve to contest the 2023 presidential election was no longer in the realm of speculation, but when to officially declare, after he might have consulted widely and effectively as he had stated explicitly yesterday.\nTinubu, who hinted at this in Abuja after a closed-door meeting with leaders of the Northern Alliance Committee (NAC), however, insisted he would still consult widely before finally declaring his intention for the 2023 presidential poll.\nHis words: “I am not going to turn them down but I will still effectively and widely consult, particularly brainstorm with my friends and find a date to come out openly and tell Nigerians.\nI don’t want to distract him from all the challenges he might face today.\nThe Lagos State Governor, Mr. Babajide Sanwo-Olu, had in October inaugurated the South West Agenda 2023 (SWAGA ’23), a political movement that has been mobilising support for Tinubu to throw his hat in the 2023 presidential ring."
  },
  {
    "headline": "Nigeria’s Public Debt Rises by N2.5trn to N38trn",
    "summarized_story": "Statistics released by the Debt Management Office (DMO) indicated that the debt comprised total external and domestic debts of the federal government, 36 state governments, and the Federal Capital Territory (FCT).\nShe said the share of treasury bills currently in the local debt basket was around 21 per cent.\nWe actually came down to 21 per cent from that in terms of total domestic debt because we wanted to reduce the re-financing risk.\n“Even with the increase we are still below 25 per cent maximum in terms of total domestic debt.\n“Unless we double or triple those revenue in the budget that is the only condition in which we won’t borrow."
  },
  {
    "headline": "UK Bows to Diplomacy, Scraps Controversial Red List",
    "summarized_story": "The UK diplomatic mission said all 11 countries, including Nigeria, were removed from the COVID-19 red list from today.\nThe scrapping of the red list was disclosed in a statement signed by the High Commission.\n“Now that there are high levels of community transmission, it is right to remove the red list and focus on our national effort to tackle Omicron.\nIt is testing that is the deterrent to travel, not the relatively limited red list.\nJustin Welby, condemned UK’s inclusion of Nigeria in its COVID-19 red list without justification, calling it “travel apartheid”, and suing for its cancellation."
  },
  {
    "headline": "EXCLUSIVE: ISWAP Fighters Send Letters To Adamawa Communities Threatening Christmas Season Attacks",
    "summarized_story": "The Islamic State of West African Province (ISWAP) faction of the Boko Haram terrorists has sent threat letters to attack some communities in Adamawa State during the Christmas season.\nResidents of Bazza in the Michika in the Michika Local Government Area, told SaharaReporters that the letters were dropped in public places around the communities, warning the residents of an impending strike.\nISWAP SoldiersShehu Kambile, who hails from Michika, told SaharaReporters that \"yes, threat letters were dropped in Bazza and Michika towns.\nThe issue of threat letters has now become a routine, let them come and see if they will go back\", he said.\nMichika has been an epicenter of terrorists’ attacks in Adamawa State."
  },
  {
    "headline": "EXCLUSIVE: ISWAP Fighters Send Letters To Adamawa Communities Threatening Christmas Season Attacks",
    "summarized_story": "The Islamic State of West African Province (ISWAP) faction of the Boko Haram terrorists has sent threat letters to attack some communities in Adamawa State during the Christmas season.\nResidents of Bazza in the Michika in the Michika Local Government Area, told SaharaReporters that the letters were dropped in public places around the communities, warning the residents of an impending strike.\nISWAP SoldiersShehu Kambile, who hails from Michika, told SaharaReporters that \"yes, threat letters were dropped in Bazza and Michika towns.\nThe issue of threat letters has now become a routine, let them come and see if they will go back\", he said.\nMichika has been an epicenter of terrorists’ attacks in Adamawa State."
  },
  {
    "headline": "BREAKING: #NorthIsBleeding Protest: Police Arrest Two Protesters, Two Journalists In Abuja",
    "summarized_story": "The Nigerian police have arrested two protesters and two journalists with Roots TV in Abuja in the ongoing #NorthIsBleeding protest.\nHuman rights’ activist, Omoyele Sowore, had also joined the protest in solidarity while addressing the protesters to reject and cry out against the killings.\nBut the police violently disrupted the peaceful rally as protesters were about to terminate the protest under the Area 1 bridge.\nAlso the crew from Roots TV including a cameraman, Tosin, and a reporter, Precious and the driver were arrested while covering the protest.\nSaharaReporters earlier reported that the #NorthIsBleeding protest had also hit the Federal Capital Territory, Abuja."
  },
  {
    "headline": "BREAKING: #NorthIsBleeding Protest: Police Arrest Two Protesters, Two Journalists In Abuja",
    "summarized_story": "The Nigerian police have arrested two protesters and two journalists with Roots TV in Abuja in the ongoing #NorthIsBleeding protest.\nHuman rights’ activist, Omoyele Sowore, had also joined the protest in solidarity while addressing the protesters to reject and cry out against the killings.\nBut the police violently disrupted the peaceful rally as protesters were about to terminate the protest under the Area 1 bridge.\nAlso the crew from Roots TV including a cameraman, Tosin, and a reporter, Precious and the driver were arrested while covering the protest.\nSaharaReporters earlier reported that the #NorthIsBleeding protest had also hit the Federal Capital Territory, Abuja."
  },
  {
    "headline": "South African Court Orders Ex-President Zuma Back To Prison",
    "summarized_story": "South Africa's High Court has ordered former president Jacob Zuma to return to jail after setting aside the decision to release him on medical parole.\nA court judgement revealed this on Wednesday, France 24 reports.\nJacob ZumaThe 79-year-old Zuma began medical parole in September, and is serving a 15-month sentence for contempt of court, after he ignored instructions to participate in a corruption inquiry.\nIn the same month, South Africa's top court dismissed a bid by him to overturn the sentence.\nZuma handed himself in on July 7 to begin his prison sentence, triggering the worst violence South Africa had seen in years, as angry Zuma supporters took to the streets."
  },
  {
    "headline": "NUC names UI as Nigeria's best varsity in 2021",
    "summarized_story": "The National Universities Commission (NUC) has named the University of Ibadan (UI) as the best federal institution in the country for 2021.\nSpeaking at the event, Peter Okebukola, NUC’s former executive secretary, said this year’s ranking involved 113 universities and was done using 12 indicators.\nAdvertisementOther criteria, according to him, include the percentage of international staff, the percentage of programmes with full-time accreditation, and all citations per capital.\nOkebukola disclosed that the Federal University of Technology Akure (FUTA) came second on the list.\nAdvertisement“For this 2021 edition, based on the 12 indicators that we have developed, University of Ibadan is the first followed by Federal University of Technology Akure,” he said."
  },
  {
    "headline": "UNILORIN students’ body honours Seun Awogbenle for ‘promoting youth inclusion’",
    "summarized_story": "The University of Ilorin (UNILORIN) students’ union senate council has honoured Seun Awogbenle, the youth advocate and author.\nAdvertisementThe union presented the excellence award to the author during the students’ parliamentary summit held at the UNILORIN main auditorium on Monday.\nAdvertisementThe youth advocator also expressed his gratitude to the union for finding him worthy of recognition.\nThe author said the youth can birth new dawn in Nigeria if given the opportunity to occupy leadership positions.\nThe youth advocate is the author of ‘The Urgency of Now: Why Nigeria Needs A vision of Prosperity, Protection and Liberty’."
  },
  {
    "headline": "UNIOSUN final-year student set ablaze for ‘refusing to join cult’",
    "summarized_story": "Victor Oke, a student of the Osun State University (UNIOSUN) in Osogbo, has been attacked by suspected cultists over his alleged refusal to join them.\nAdvertisementAdemola Adesoji, the varsity’s spokesman, who spoke about the incident on Monday, said Oke is a part-time final-year political science student of the institution.\nAdesoji said the student was attacked at the Akede area of Osogbo, the state capital.\nAdvertisementHe quoted eyewitnesses as saying the student was attacked with cutlasses, stones and thereafter set ablaze by the assailants before residents came to his rescue.\nThe institution said it is working with the police and relevant agencies to ensure those who attacked the student are brought to book."
  },
  {
    "headline": "Amid backlash, Osun school denies vote buying marred prefectship election",
    "summarized_story": "Treasure Trove Montessori School in Osun state has denied claims that vote buying marred its recently concluded prefectship election.\nThe user’s story — said to have happened in 2021 — appeared to have been misconstrued, causing backlash at Treasure Trove.\nIn a statement, the proprietress at Treasure Trove clarified the situation while denying insinuations of vote buying.\nAdvertisement“Our own pupil’s name is Jedidiah Ojo-Kayode (surname is Ojo-Kayode), and the incident did not happen in Osun state, let alone at Treasure Trove Montessori School.\nAnd we hope the general public will stop affiliating Treasure Trove Montessori School to that very unfortunate incident.”Copyright 2021 TheCable."
  },
  {
    "headline": "Billie Eilish: I started watching porn at 11… it destroyed my brain",
    "summarized_story": "During the show, the ‘Bad Guy’ crooner said she started watching porn at the age of 11 and later became addicted to it.\n“As a woman, I think porn is a disgrace.\nI started watching porn when I was like 11.\nI think it really destroyed my brain and I feel incredibly devastated that I was exposed to so much porn,” she said.\nAdvertisement“The way that vaginas look in porn is fucking crazy."
  },
  {
    "headline": "1da Banton’s “No Wahala” blew up on Tik Tok. Now he knows its power",
    "summarized_story": "“When I recorded ‘No Wahala’, that was how I was feeling, so I put it into music.\nSo, I’m glad we achieved that.”Born and raised in Port-Harcourt, 1da Banton, dropped his debut single in 2015.\n“My TikTok video on the ‘No Wahala’ challenge gave me my highest views and engagement on TikTok.\nI didn’t expect it,” said Yewande Daranijo, an aspiring actress whose first viral TikTok video has over 300,000 views through this challenge.\n1da Banton recalled that at the time his song was blowing up in France, he wasn’t a regular user of Tik Tok and was still finding his way around the app."
  },
  {
    "headline": "Can Kenya get out of the supply chain crisis?",
    "summarized_story": "A global meltdownOn a global level, the supply chain meltdown began with a container shortage that cropped up at the end of 2020, with freight rates rising higher than 264%, compared to previous years.\nAt this point, global supply chains were already out of balance, and demand for exports exceeded the supply of shipping containers.\nWhile the flower industry is rebounding and trucks are moving more freely, the temporary dismemberment of the supply chain industry may continue to have knock-on effects on businesses in the East African economy.\nReliability is keyKenya’s potential supply chain crisis and its impact can be mitigated.\nWithout it, it may be years before we see supply chain issues corrected and an environment for freer trade realised."
  },
  {
    "headline": "How African startups can build multi-million dollar deals",
    "summarized_story": "One of the biggest acquisition deals of 2021 is MFS Africa’s deal with Capricorn.\nWhile the amount is undisclosed, both parties confirmed that the deal is Nigeria’s “second-largest” fintech acquisition deal, second only to Paystack’s $200 million acquisition deal with Stripe.\nBig deals start out smallFor Dare Okoudjou—who has led MFS Africa’s growth in 35 African countries—big deals and acquisitions don’t always start out as big deals.\nPrior to Capricorn, MFS Africa had acquired two other companies.\nIn 2016, MFS Africa acquired Sochitel—a company that specialised in international airtime transfers into Africa—and the acquisition, according to MFS Africa, helped create the largest transfer payment network which focuses on Africa."
  },
  {
    "headline": "Kwara raises a $4m seed to build Africa’s first credit union-powered neobank",
    "summarized_story": "The company is reportedly growing its credit union customer base by 40% month-on-month, and the listed credit unions are growing their membership by 19% and their loan base by 46%, annually.\nThough it’s reported to be courting some credit union clients in South Africa and the Philippines, which, according to the CEO, validates their solution across multiple markets.\nDue to that, it’s launching a new bank that will be powered by its existing credit unions.\nAlso, any unbanked individual can easily join a credit union and then enjoy the whole banking benefits.\n“Kwara’s unique approach is a catalyst for a new way of retail banking through digital-first credit unions."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "In most stories, there are almost always two sides of the coin.\nWhen it comes to fundraising, for some, it could be as..."
  },
  {
    "headline": "Nestcoin’s new product, Metaverse Magna, wants to help Africans earn by playing games in the metaverse",
    "summarized_story": "On November 29, 2021, BusinessToday.in reported that Canadian investment firm, Tokens.com, spent $2.5 million on a virtual land in the metaverse.\nNestcoin’s new product, Metaverse Magna (MVM) is creating a path for Africans that’ll ease them into the metaverse through games.\nBut in the metaverse, gaming is done a bit differently.\nAxie Infinity is, to date, the most established metaverse gaming platform.\nUnlike regular games, Axie Infinity exists on a blockchain which means you buy and sell characters, upgrades, and power-ups with cryptocurrencies."
  },
  {
    "headline": "IP valuation in IP-based financing",
    "summarized_story": "Share this article:Financial institutions use different approaches to IP valuation as part of their financing process.\nBecause the enterprise’s technology is new and unproven, and the enterprise lacks an established market, IP valuation may not work for startups.\nLiens, warrants, and debentures on IP assets, as well as numbers relating to IP capitalized on the balance sheet, may be examined – but only as risk factors, not as part of a formal IP valuation.\nThis reluctance in the IP valuation market may be attributed to information asymmetry, regulatory lapses and market immaturity.\nThere is a clear need to increase market actors’ confidence and certainty in IP valuation methods in order to stimulate IP transactions, support IP-based financing, and provide companies with tools to provide information about their intellectual property."
  },
  {
    "headline": "DrugStoc’s supply chain solution, 7RiverLabs by 54gene, Nigeria’s 5G auction",
    "summarized_story": "Share this article:Hi there,Today we’re discussing:DrugStoc’s supply chain solution54gene’s 7RiverLabsNigeria’s 5G auctionDrugStoc’s supply chain solutionThe DrugStoc teamAs the Director-General of the National Agency for Food and Drug Administration and Control (NAFDAC), Dora Akunyili was constantly fighting against fake drugs.\nIn addition to being ineffective in treatment, fake drugs could also endanger the lives or well-being of patients.\nAdvertisementWhile there is the risk of getting fake drugs, there is also the possibility of not getting medications when you need them.\nWhile NAFDAC appears to have intensified its fight against fake drugs, the issue of access remains.\nWith the range of tests 7RiverLabs offers, millions of Africans can begin to take greater control of their health.”AdvertisementBeing able to diagnose a medical condition properly is crucial in treating diseases."
  },
  {
    "headline": "Nigeria’s Plans for Additional Eurobond Sale Off on Omicron",
    "summarized_story": "Nigeria suspended plans to sell additional Eurobond this year after the outbreak of the omicron variant, according to the head of the debt management office.\n“Omicron came and markets are not exactly good to go back now,” Patience Oniha, director-general for the Debt Management Office said at a conference on Tuesday.\n“I can say for this year we are not approaching the market,” Oniha said.\nRead also:Covid-19: Omicron pushes Nigeria’s average cases up 451%Africa’s biggest economy and crude producer planned to raise $2.2 billion in additional debt this year to complete a $6.18 billion external borrowing approved in the nation’s 2021 budget after successfully raising $4 billion in September.\nOmicron poses risks to the global economy, especially frontier and emerging market as investors weigh the impact of the coronavirus variant on economic recovery."
  },
  {
    "headline": "Nigeria Air has no structure four months to kick off",
    "summarized_story": "Four months to the announced date by the Federal Government that a national carrier, Nigeria Air, would commence operations, BusinessDay’s checks show that there are no personnel, investor and physical or technical structure on ground currently to make this a reality.\nThree weeks ago, the Federal Executive Council (FEC) approved April 2022 as the take-off date of Air Nigeria, the proposed new national carrier.\nOjikutu says any attempt to set up or continue with the planned national carrier will lead Nigeria to a government carrier that will end up the way of the Nigeria Airways.\n“There is nothing on ground to show that Nigeria Air can take off and land by April 2022,” Ibrahim Mshelia, owner, West Link Airlines Nigeria and Mish Aviation Flying School, notes.\nMshelia says whether Nigeria will use leverage or get incentives, the time is too short and it is unrealistic for the national carrier to commence operations in four months."
  },
  {
    "headline": "How targeted, low-cost financing can tackle housing deficit",
    "summarized_story": "At various intervention levels, the housing deficit in Nigeria has seen different approaches to tackling it with little or no results.\nIndeed, the pan-African housing finance institution has a clear mission – to increase access to quality, low-cost housing across Africa.\n“Shelter Afrique is committed to supporting large scale, affordable housing schemes in Nigeria through the issuance of a N250 billion bond.\nThis is planned to provide affordable housing and homeownership to low and medium income home buyers, consequently improving their standard of living,” he assured.\nRecently, the pan-African housing finance organization partnered REDAN to finance 12,000 affordable housing units in Nigeria."
  },
  {
    "headline": "Obaseki tasks on production, urges efforts to reduce wastes on importation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has called for concerted efforts among stakeholders to address critical issues in the manufacturing sector, ensuring that the country is able to produce what it consumes so as to reduce excess wastes on importation.\nObaseki gave the charge while declaring open a workshop organised by Manufacturing Africa and Edo State Investment Promotion Office, at the Government House in Benin City.\nAccording to him, “The situation that we are in Nigeria today is so critical; critical not only because we are a poor country, but because the bulk of what we consume is imported.\nReiterating the need to strengthen the manufacturing sector, Obaseki noted: “Why are we not manufacturing today?\nWe have not had an investment culture for a long time.”The governor continued: “We are not welcoming investors, particularly in the manufacturing investment area."
  },
  {
    "headline": "UK Removes Nigeria, Others from Travel Ban List, Shelves Hotel Quarantine – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The UK government has today announced that all countries, including Nigeria, will be removed from its international travel red list from 4am tomorrow because Omicron is already running rampant in the UK.\nThe red list was reintroduced last month following the emergence of Omicron in order to prevent importing cases into the UK.\nDespite the change on the red list, tougher travel testing rules introduced in response to the variant will remain in place.\nPeople arriving in the UK from red list countries must currently spend 11 nights in a quarantine hotel at a cost of £2,285 for solo travellers.\nRemoving all 11 countries from the list will mean that ministers will once again mothball the hotel quarantine system."
  },
  {
    "headline": "Edo sensitises motorists, others, insists on compliance with traffic signs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government, through the state’s Public Works Volunteers (PUWOV) on Tuesday, embarked on massive sensitization across the Benin metropolis, to enlighten motorists and other road users on the need to ensure compliance with traffic signs.\nThe PUWOV team also intensified the placement of caution signs in strategic locations in the Benin metropolis, in line with the directive of the Edo State Governor, Mr. Godwin Obaseki, to ensure sanity across the state.\nThe caution signs had various inscriptions including ‘No Packing’, ‘No Picking of Passengers’, ‘No U-Turn’ and ‘No Dropping of Passengers’, among others.\nThe caution signs were placed in strategic locations in Benin City, including New Benin, 3rd East Circular, Aduwawa, Ramat, Agip, Oliha, Uselu, Egor, and Oluku, among others.\nHowever, after placing these signs in these areas, we discover that touts and hoodlums remove these signs from the roads."
  },
  {
    "headline": "Controversial Femi Fani-Kayode Finally Docked By EFCC For Forgery – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Economic and Financial Crimes Commission, EFCC, has finally dragged a former Minister of Aviation, Femi Fani-Kayode to court for alleged forgery.\nSpecifically, the EFCC claims that the former Minister procured one Dr. Ogiewu Ozeigbe to procure the fake medical report.\nMr. Rotimi Oyedepo at the proceeding urged the court to take the plea of the defendant over the allegation.\nFani-Kayode counsel told the court that the various authorities cited by the prosecution counsel to back up his claims are wrongly interpreted.\nFani-Kayode counsel urged the court to entertain the application and rule on it before the plea can be taken."
  },
  {
    "headline": "Remains of Michael Okpara’s wife, Lady Adanma for burial Saturday",
    "summarized_story": "The remains of Lady Adanma Okpara, wife of Dr M.l Okpara, the Premier of the defunct Eastern Region of Nigeria, will be committed to mother earth on Saturday, December 18, 2021.\nMrs. Okpara who passed away on August 22, 2021 at the age of 99 years, will be laid to rest next to her beloved husband in the mausoleum in their compound after a burial service which will start by 10.00am at Williams Memorial Secondary School, Afugiri, Ohuhu, Umuahia North Local Government Area of Abia State, according to a communication from the Central Burial Committee.\nThe late Mrs. Okpara was a strong pillar behind her husband during the political days of the 1950s and 1960s."
  },
  {
    "headline": "Emefiele warns banks to be prepared for hurtful policies amid renewed Covid-19 threat",
    "summarized_story": "Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, has said banks should be prepared for policies that could negatively impact on profit margins in the wake of renewed threat posed by Covid-19 pandemic.\nThis comes amid global concerns about the emergence of more transmissible Omicron variant of the virus first detected in South Africa last month.\nEmefiele thanked members of the Bankers’ Committee, noting that they stood strong to help the country to cope with the impact of Covid-19.\nThe initiative will also support firms producing goods for the export market.\nWith the growing pace of digitalisation globally, we will continue to leverage digital channels in fulfilling this objective."
  },
  {
    "headline": "Nigeria’s public debt increases by N2.5tn to N38tn",
    "summarized_story": "Nigeria’s public debt has added N2.54 trillion to stand at N38.005 trillion ($92.626 billion) in the third quarter of 202, ending September 30, from from N35.465 trillion in the second quarter (June 30), according to figures from the Debt Management Office (DMO).\nStatistics from the agency indicate that the debt comprises total external and domestic debts of the Federal Government of Nigeria (FGN), 36 state governments and the Federal Capital Territory (FCT).\nAccording to the DMO, the increase of N2.540 trillion, when compared to the corresponding figure of N35.465 trillion at the end of Q2 2021 was largely accounted for by the $4 billion Eurobonds issued by the FGN in September 2021.\nThe agency noted that the issuance of the $4 billion Eurobonds had brought significant benefits to the economy by increasing the level of Nigeria’s external reserves, thereby supporting the exchange rate of the naira, and providing necessary capital to enable the federal government finance various projects in the budget.\nThe triple tranche of $4 billion Eurobond, issued in September 2021, was for the implementation of the new external borrowing of $6.18 billion in the 2021 Appropriation Act"
  },
  {
    "headline": "Obasanjo’s royal father joins his ancestors",
    "summarized_story": "Idowu Olakunle, AbeokutaThe traditional ruler of Owu, the kingdom where former President Olusegun Obasanjo hails from, Oba Adegboyega Dosunmu, has joined his ancestors.\nThe commissioner expressed his condolences to Chiefs and people of Owu over the demise of the traditional ruler who passed on Sunday, December 12 after a brief illness.\nAbiodun described late Oba Dosunmu as a man of peace and a passionate supporters.\nThe governor said they should take solace in the lasting impact he had on his domain.\nHe prayed that “God Almighty grants Kabiyesi’s soul eternal repose and the people he left behind the fortitude to bear this loss.”"
  },
  {
    "headline": "Heart problem: Sergio Aguero weeps as he retires from football",
    "summarized_story": "Barcelona and Argentina striker Sergio Aguero on Wednesday announced his retirement from football at a tearful press conference, just over a month after the 33-year-old was diagnosed with a heart problem.\n“I have decided to stop playing professional football.\nIt is a very hard moment but I am happy with my decision.\nMy health comes first,” said Aguero, who enjoyed 10 highly successful years at Manchester City before leaving at the end of last season.\nDetails later… PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Heart problem: Sergio Aguero weeps as he retires from football",
    "summarized_story": "Barcelona and Argentina striker Sergio Aguero on Wednesday announced his retirement from football at a tearful press conference, just over a month after the 33-year-old was diagnosed with a heart problem.\n“I have decided to stop playing professional football.\nIt is a very hard moment but I am happy with my decision.\nMy health comes first,” said Aguero, who enjoyed 10 highly successful years at Manchester City before leaving at the end of last season.\nDetails later… PunchShare this: TwitterFacebookLike this: Like Loading..."
  },
  {
    "headline": "Heartless: Ogun 18-year-old student arrested for poisoning female benefactor",
    "summarized_story": "Operatives of the Ogun State Police Command have arrested an 18-year-old Senior Secondary School Student, Tope Fasanya, for allegedly poisoning the food of her guardian, Mrs Esther Bada.\nThe state Police Public Relations Officer, DSP Abimbola Oyeyemi, in a statement on Tuesday, said the suspect was arrested following a complaint by the victim.\nHe said, “When the pain was becoming severe, she called the maid to come and eat the remaining food, but she refused.\n“On interrogation, the suspect initially denied and was transferred to the Homicide Section of the State Criminal Investigation and Intelligence Department.\n“On getting there, she made a confessional statement that she actually added rat poison to the victim’s food."
  },
  {
    "headline": "Heartless: Ogun 18-year-old student arrested for poisoning female benefactor",
    "summarized_story": "Operatives of the Ogun State Police Command have arrested an 18-year-old Senior Secondary School Student, Tope Fasanya, for allegedly poisoning the food of her guardian, Mrs Esther Bada.\nThe state Police Public Relations Officer, DSP Abimbola Oyeyemi, in a statement on Tuesday, said the suspect was arrested following a complaint by the victim.\nHe said, “When the pain was becoming severe, she called the maid to come and eat the remaining food, but she refused.\n“On interrogation, the suspect initially denied and was transferred to the Homicide Section of the State Criminal Investigation and Intelligence Department.\n“On getting there, she made a confessional statement that she actually added rat poison to the victim’s food."
  },
  {
    "headline": "Jacob Zuma goes back to prison",
    "summarized_story": "By Agency ReportSouth Africa’s High Court ordered former President Jacob Zuma to return to jail after setting aside the decision to release him on medical parole, a court judgement showed on Wednesday.\nThe 79-year old began medical parole in September, and is serving a 15-month sentence for contempt of court.\nZuma handed himself in on July 7 to begin his prison sentence.\nThe High Court in Pretoria ordered that Zuma, 79, “be returned to the custody of the Department of Correctional Services” to serve out the remainder of his 15-month sentence.\nZuma, who was convicted of contempt of court earlier this year, was granted medical parole after serving less than two months in jail."
  },
  {
    "headline": "All hail Sir Lewis Hamilton",
    "summarized_story": "Lewis Hamilton, Formula One multiple record holder has been knighted at the Windsor Castle, days after he narrowly missed a record eighth world title.\nHamilton, who will now be addressed as Sir Lewis Hamilton, was officially knighted by Prince of Wales, Prince Charles).\nThe 36 year-old was honoured for his services to motorsports,He becomes the fourth F1 heroes to be knighted.\nSir Jackie Stewart was knighted in 2001, Sir Stirling Moss 2000 and Sir Jack Brabham 1979."
  },
  {
    "headline": "Red list: Diplomatic row averted as UK delists Nigeria, others, UAE makes u-turn, gives Air Piece 7 slots",
    "summarized_story": "UAE on Air PeaceIn a related development, the United Arab Emirates (UAE) Tuesday granted Air Peace seven slots at Dubai Airport after a brewing diplomatic hassle occasioned by Omicron.\nThis was after UAE authorities had refused Air Peace the three slots requested by the Nigeria airline in Sharjah Airport.\n“The Dubai Civil Aviation Authority presents the compliments to the Honourable Management of Air Peace Nigeria.\n“Slots available and blocked for Air Peace are the following: All days.\n“We look forward for Air Peace to operate with utmost confidence to/from DXB at the soonest."
  },
  {
    "headline": "Lawmakers, politicians now kidnappers, assassins’ targets – DSS",
    "summarized_story": "The Department of State Services (DSS) Tuesday raised the alarm to the effect that some groups and individuals were planning to cause a breakdown of law and order in the country.\nHis legal team had in an interview with journalists claimed Kanu was being maltreated in the DSS’ custody.\n“Overall, citizens and residents are advised to cooperate with security and law enforcement agencies for lasting peace in the country.\nThe bandits have also asked for a N20 million ransom and a Smartphone to release the corpses and the remaining victim in their captivity.\nOn Tuesday, an official of a road transport union in the town, Bello Muhammad, said the community contributed N8 million ransom to secure the release of the abducted persons."
  },
  {
    "headline": "Breaking: Armed robbers raid banks in Kogi community",
    "summarized_story": "Armed robbers armed with sophisticated weapons on Tuesday afternoon raided banks in Odo Ere, headquarters of Yagba West local government area of Kogi state.\nThe robbers, said to be about 13 in number, stormed the community and killed several passerby while the banks were painted with bullets.\nBlueprint learnt that the criminals operated for about two hours, going from bank to bank, before they eventually escaped.\nPolice are yet to confirm the incident as at the time of filling this report."
  },
  {
    "headline": "UPDATED: Bandits Kill Kaduna Lawmaker, Abduct Travellers On Kaduna-Zaria Highway",
    "summarized_story": "Bandits have killed a member of the Kaduna State House of Assembly, Rilwanu Gadagau, along the Kaduna-Zaria Highway.\nHe was reported to have been killed on Monday night by bandits who attacked travellers along the road.\nHe revealed that Gadagau’s body was found near Mawai, a village just about 13 kilometres from the Kaduna State capital.\nHe was said to be among over 30 travellers abducted by the bandits who laid a siege on the road.\nConfirming the incident, the Speaker of the Assembly, Yusuf Zailani, described the death of the lawmaker as devastating."
  },
  {
    "headline": "Sultan Warns Against Politicising Insecurity, Says Hunger Knows No Religion",
    "summarized_story": "The Sultan of Sokoto, Sa’ad Abubakar, has warned political and religious leaders as well as all Nigerians against politicising insecurity in the country.\n“We must not politicise insecurity because hunger does not know politics, religion.\nEverybody has been complaining of hunger in the land and it is true,” the Sultan said.\nIt is important for us, whenever we meet as religious, political leaders, we must always look at one thing.\nAs a way forward, the Sultan called for cooperation among all Nigerians regardless of their political, religious or ethnic differences."
  },
  {
    "headline": "North East Governors Seek Sustainable Programme For Repentant Terrorists",
    "summarized_story": "Members of the North East Governors’ Forum have called for the establishment of a sustainable programme for repentant terrorists in the region.\nThey made the call at the sixth meeting of the forum held on Tuesday in Damaturu, the Yobe State capital.\nAt the meeting, the governors discussed the issues of terrorism, kidnapping, and farmers-herders clashes, among other challenges facing the North East.\n“However, the Forum urged for the establishment of a sustainable programme for the handling of the repentant terrorists.\nIn an appeal, they advised the Federal Government to increase its investments in the North East to guarantee peace and economic prosperity."
  },
  {
    "headline": "UAE Concedes Seven Flight Slots To Nigeria",
    "summarized_story": "The Federal Government has confirmed that the United Arab Emirates has conceded seven flight slots to Nigeria’s carrier, Air Peace.\nThe UAE had earlier denied Air Peace flights from operating to Sharjah, near Dubai, three times a week.\nIt also joined the United Kingdom, Canada, and Argentina in adding Nigeria on its travel red list over cases of the omicron variant of COVID-19.\nRELATEDEmirates To Suspend Nigeria Flights From December 13Why We Withdrew Frequencies Approval For Emirates Airlines – NCAAWhile the UK has cleared Nigeria and 10 other countries from its red list, the UAE has still maintained the travel restrictions.\nThe Speaker said both Nigeria and UAE had good diplomatic relations and that they would not allow the current row to mar the long-standing friendship."
  },
  {
    "headline": "Insecurity: Buhari Has Done His Best, Expecting More From Him Is Like Kicking A Dead Horse – Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo says President Muhammadu Buhari has done his best in tackling insecurity and expecting more from him is like beating a dead horse.\n“President Buhari has done his best, that is what he can do, if you expect anything more than what he has done or what he is doing, you are kicking a dead horse.\nFor the country to successfully tackle the Boko Haram insurgency, Obasanjo said the carrot and stick approach needs to be adopted.\nThe Sultan of Sokoto, Sa’ad Abubakar, who was also at the event assessed the insecurity in the country.\nHe warned political and religious leaders and all Nigerians against politicising insecurity in the country."
  },
  {
    "headline": "Gov. Dapo Abiodun mourns Olowu of Owu, Olusanya Dosunmu -",
    "summarized_story": "Ogun State Governor, Dapo Abiodun, has expressed shock at the transition of the Olowu of Owu Kingdom, Oba Olusanya Dosunmu, Amororo II.\nIn a condolence message issued on by his behalf on Tuesday by his Chief Press Secretary, Kunle Somorin in Abeokuta, Gov.\nAbiodun described the Oba Dosunmu as “a quintessential monarch, a man of peace and a passionate supporter of development.”While condoling with the monarch’s immediate family and the people of Owu, the governor said they should take solace in the lasting impact he had on his domain.\nHe prayed that “God Almighty grants Kabiyesi’s soul eternal repose and the people he left behind the fortitude to bear this loss”, the statement surmised."
  },
  {
    "headline": "Tinubu speaks on 2023 presidential ambition, promises not to turn down offer to contest",
    "summarized_story": "Tinubu speaks on 2023 presidential ambition, promises not to turn down offer to contest"
  },
  {
    "headline": "2022 Budget: Assembly passes N188.4bn for Sokoto State",
    "summarized_story": "The Sokoto State House of Assembly has passed the the state 2022 budget of N188.4 billion following the adoption of the report of the House Committee on Finance and Appropriation at the plenary sitting of the Assembly.\nThe budget, tagged, “Budget of accomplishments and sustainable development”, is lower than the 2021 budget of N205,016,512,295.41 by N16,587,016,447.78, consisting both the Recurrent and Capital Expenditures approved by the Assembly.\nPresenting the report, Chairman of the Committee Malami Basakkwace (PDP- Sokoto South II) explained that the committee did not add or subtract from the figures presented by the governor.\nHe said, based on genuine request by sub-committees, the committee moved resources inwards to accommodate some important demands and interest of our the people of the state.\nMr. Basakkwace said the committee recommended that all sources of funding identified in the budget should be maintained and their conditions adhere to."
  },
  {
    "headline": "Electoral Amendment: A look at the Journey to credible elections in Nigeria",
    "summarized_story": "Electoral Amendment: A look at the Journey to credible elections in Nigeria"
  },
  {
    "headline": "Guardiola Sets New Record in Man City’s 7-0 Victory over Leeds",
    "summarized_story": "Pep Guardiola became the quickest manager to reach 500 goals in Premier League in Manchester City’s 7-0 victory over Leeds United on Tuesday night.\nKevin de Bruyne, who made his first Premier League start since November grabbed a brace with Riyad Mahrez, Nathan Ake and Jone Stones each grabbing a goal as City run riot.\nSince Guardiola took over in the summer of 2016, City have now scored 500 goals coming from just 207 matches, an average of 2.4 goals per game.\nThe new record now sees Liverpool’s Jurgen Klopp drop to second having reached the 500-goal mark in 243 matches.\nHere is the list of the quickest managers to 500 Premier League goals;Pep Guardiola: 207Jurgen Klopp: 234Alex Ferguson: 265Arsene Wenger: 271Jose Mourinho: 289Rafa Benitez: 329"
  },
  {
    "headline": "OJ Simpson a ‘Completely Free Man’ after Parole Ends in Nevada",
    "summarized_story": "“Mr Simpson is a completely free man now,” said Malcolm LaVergne, Simpson’s lawyer in Las Vegas.\nSimpson declined an immediate interview, his attorney said, and LaVergne declined to talk about Simpson’s future plans, including whether he intends to remain in Nevada.\nHe told parole officials before his release from prison on 1 October 2017, that he planned to move to Florida.\nHe instead moved to a gated community in Las Vegas where he plays golf and frequently takes to Twitter to offer opinions about college and pro sports, especially football.\nHe had been scheduled for discharge from parole on 9 February, but the parole board granted him about three months of good time credits."
  },
  {
    "headline": "AfDB Offers Nigeria $210m Loan for Special Agro-Industrial Processing Zone",
    "summarized_story": "The African Development Bank’s (AfDB) board has offered Nigeria a $210 million facility to co-finance Phase 1 of the Nigeria Special Agro-Industrial Processing Zone Program (SPAIZ).\nThe initiative is expected to unlock Nigeria’s agriculture sector potential and promote industrialisation through the development of strategic crops and livestock.\nThe bank said that it planned to establish these zones in 18 African countries, including Nigeria.\nIt was expected to bring economic infrastructure to rural areas of high agricultural potential and attract private agro-industrialist and entrepreneur investment, contribute to Nigeria’s economic and social development and stem rural-to-urban migration.\nThe gender action plan will help ensure that there’s facilitation of broader lending to women.”Dike Onwuamaeze"
  },
  {
    "headline": "Tinubu: I Won’t Decline Calls to Contest for Nigeria’s Presidency",
    "summarized_story": "With deft political subtlety, a former governor of Lagos State and one of the national leaders of the All Progressives Congress (APC), Asiwaju Bola Tinubu, on Tuesday, cleverly declared his decision to take his chances in the 2023 presidential election, saying he would not decline the many calls by supporters and admirers for him to contest.\nBy this statement, Tinubu has made it clear that his resolve to contest the 2023 presidential election was no longer in the realm of speculation, but when to officially declare, after he might have consulted widely and effectively as he stated explicitly.\nTinubu, who hinted at this in Abuja after a closed-door meeting with leaders of the Northern Alliance Committee (NAC), however, insisted he would still consult widely before finally declaring his intention for the 2023 presidential poll.\nI don’t want to distract him from all the challenges he might face today.\nThe Lagos State Governor, Mr. Babajide Sanwo-Olu, had in October inaugurated the South West Agenda 2023 (SWAGA ’23), a political movement that has been mobilising support for Tinubu to throw his hat in the 2023 presidential ring."
  },
  {
    "headline": "Analysis: Why Buhari Will Sign Amended Electoral Bill Before Dec. 19",
    "summarized_story": "Although under intense pressure from different quarters, particularly governors elected on the platform of the ruling All Progressives Congress (APC), President Muhammadu Buhari, might have resolved to sign the amended Electoral Bill, forwarded to him by the National Assembly on November 19.\nThe source explained, “It belies logic that the president would write to the National Assembly after they had proceeded on recess.\nHowever, despite our democratic achievements, Nigeria continues to face the challenge of insecurity, which poses a threat to our democracy.\nWhichever way this is programmed to swing, analysts have contended that the credibility and legacy of the president are at stake.\nHe would, therefore, have to choose between his own legacy and the need to please some vested interests."
  }
]