[
  {
    "headline": "I was into haulage business, not kidnapping, Evans tells court",
    "summarized_story": "When Sule noted that Ahamonu had identified him when he testified virtually (via the Zoom app) in court, Evans said he was easily identifiable.\nSonuga, Evans said, “I do not know Slyvanus Ahamonu, I only met him at the IG Guest House in Falomo.\n“One day at the IG Guest House, the police brought some documents and asked me to sign.\n“When I refused, Inspector Philip asked them to take me to the back of the guest house.\nI only met him at the IG Guest House; I had no prior contact with him.”Justice Oluwatoyin Taiwo adjourned till March 11 for continuation of trial."
  },
  {
    "headline": "FG behind delay in Ondo seaport project take-off, says Akeredolu",
    "summarized_story": "THE Ondo State Governor, Rotimi Akeredolu, on Friday declared that there would be no going back on the actualisation of the Ondo Deep Seaport Project embarked upon by his administration.\nThe governor, however, noted that though arrangements had been concluded on the project, the approval and declaration from Federal Government was causing the delay in the take off of the project.\nWe have a system where there must be a port declaration by the federal executive council before you proceed.\nWe found out that we have the deepest draft in Ondo State.\nOur dream for this port in Ondo State is to serve as a conduit for our goods, agricultural produce and very soon, our bitumen."
  },
  {
    "headline": "2023: My development plan for Delta South — Onoyona, Senatorial aspirant",
    "summarized_story": "The challenges of our people in all areas of life, with a special interest in economic development and security.\nWhat are those things in Delta State socio-political and economic development that you think would bring total change?\nThe good people of Delta state deserve good governance that will provide economic development, attract investors to the state, create jobs and provide basic amenities and security.\nHe has taken representation beyond his primary constituency for the time in the political socio-economic life of Delta state.\nThe people of Delta state are tired of PDP leadership of underdevelopment and are ready for APC leadership."
  },
  {
    "headline": "ENVIRONMENTAL DEGRADATION: UNN community files locus in quo interlocutory application",
    "summarized_story": "Odo argued that visiting the scene of the alleged environmental degradation would validate the claims made by the plaintiff against the defendants.\nNnaemeka Aleke, on behalf of Obukpa community against the University of Nigeria, challenging the nuisance created by the University of Nigeria in the community.\nPrior to now, the activities of the university in the indiscriminate building of structures is threatening the existence of Obukpa community.\n“Part of the locus in quo interlocutory application we filed is to enable the court visit the the scene of incident to see what is actually happening there.\nHe also said that the matter has been adjourned to April 7, 2022 for ruling on the interlocutory application."
  },
  {
    "headline": "Industrialisation: Nigeria has a lot to learn from China- PDP",
    "summarized_story": "The National Chairman of the People’s Democratic Party (PDP), Dr Iyorchia Ayu, says Nigeria can learn much from China, especially its model of industrialisation.\nBaocai and Ineijian are representatives of the Communist Party of China (CPC) in the Chinese Embassy in Abuja.\nRecalling that the history of mutual cooperation between Nigeria and China dated back to decades, the PDP national chairman said the cooperation would be broadened and strengthened when PDP returns to power in 2023.\n“There is much that Nigeria can learn from China, especially its model of industrialisation.\nAt the meeting were other members of the PDP National Working Committee."
  },
  {
    "headline": "Alleged forgery: Judge expresses displeasure over delay in Fani-Kayode’s trial",
    "summarized_story": "Justice Olubunmi Abike-Fadipe of an Ikeja Special Offences Court has expressed displeasure over the delay in the trial of former Minister of Aviation, Femi Fani-Kayode for allegedly forgery.\nOn investigation by the EFCC, the anti-graft agency found the medical reports allegedly obtained by the former minister from several government hospitals to be fake.\nAbike – Fadipe frowned at the prosecution and the defence counsel for wasting the time of the court as the trial could not commence.\nBuhari, in her response, said that the EFCC had not taken any action on the amended charge.\nThe judge adjourned the case until Feb. 23 for commencement of trial."
  },
  {
    "headline": "Aregbesola blames social vices surge on lack of parental guide",
    "summarized_story": "The Minister of Interior, Ogbeni Rauf Aregbesola, has attributed the current social vices bedeviling the society to lack of parental guide.\nThe minister said that parents should be encouraged to properly groom their children and correct their malpractices.\nAccording to him, parents should be sensitive to what their children do, watch and read.\nAregbesola noted that the reunion was a good factor to influence good ideas in motivating and mentoring children.\nAnd of course, we cannot but fear God because He is the only one that can make our ways meaningful,” he said."
  },
  {
    "headline": "No money rituals, Yahoo Yahoo in our time – Aregbesola",
    "summarized_story": "Minister of Interior, Rauf Aregbesola, has advised youths to shun crimes and other self-defeating activities like advance fee fraud, ritual killings and drug use.\nHe spoke at a programme part of the 60th anniversary of Akoko Anglican Grammar School, Arigidi Akoko (AKOGRAMS) in Ondo State.\nAregbesola said the influence of the school contributed to his achievements as a professional and politician.\nAKOGRAMS moulded and formed me,” Aregbesola stated.\nThe Minister also attributed his successes as a Governor and Minister to prayers, self-belief, total trust in God Almighty and focus on programmes aimed at transforming lives."
  },
  {
    "headline": "Buhari sends messages to Ameachi, Danu",
    "summarized_story": "President Muhammadu Buhari, on Friday, sent messages of congratulations to two chieftains of the All Progressives Congress (APC) Rotimi Amaechi, the Minister of Transportation, and a reputable businessman, Alhaji Nasiru Haladu Danu, on the conferment of chieftaincy titles on them tomorrow, Saturday by the Daura Emirate Council.\nBuhari said the conferment of the title of “Dan Amana,” (the trusted one) to Amaechi is a clear commitment to the melodious relationship between the nation’s diverse cultures.\nDanu is being turbaned as Tafida Babba of Daura.\nThis was disclosed in a statement by the Senior Special Assistant (Media and Publicity), Garba Shehu.\nThe President commended Ameachi “for working with enormous energy to make the CHANGE we promised Nigerians a reality,” noting that “the change we are witnessing in the transport sector is an extraordinary legacy.”Buhari will not be at the event on Saturday but has designated a delegation of three, made up of the Ministers of Aviation, Senator Hadi Sirika, Water Resources, Eng Sulaiman Adamu, and Shehu to represent him."
  },
  {
    "headline": "Ex-Rivers Gov, King Diete-Spiff sign Niger Delta charter on resource control, self-determination",
    "summarized_story": "Chairman, Bayelsa State Council of Traditional Rulers, HRM King Alfred Papapreye Diete-Spiff, has signed the Niger Delta Peoples Charter.\nThe document seeks resource control, political and economic autonomy, as well as self determination of the Niger Delta people.\nThe respected traditional leader endorsed the charter as a representative of Nembe/Brass ethnic nationalities in Bayelsa.\nDiete-Spiff was Military Governor of Rivers State after it was created from the old Eastern Region.\nOlu Andah Wai-Ogosu, another Rivers representative, signed the charter."
  },
  {
    "headline": "NURC explains reason for crash in price of cooking gas",
    "summarized_story": "The Nigerian Upstream Regulatory Commission (NURC) has explained the reason for the reduction in the price of cooking gas.\nDAILY POST gathered that cooking gas which was sold for as much as N800 in some parts of the country a few months ago now sells for about N600 per kilogram.\nSpeaking on the latest development, the Port Harcourt Zonal Director of NURC, Professor Godday Ineh said the latest ” strategy “by the Nigeria Liquefied Natural Gas NLNG to increase by 100% the supply of gas to the local market helped to crash the price.\nProfessor Ineh explained that the move is designed to increase LPG availability in Nigeria, diversify its use and support the federal government’s Decade of Gas initiativeIneh, who is also the zonal controller of the Nigerian Upstream Regulatory Commission said “Nigeria is becoming self-sufficient in the LPG supply chain”.\nHe said, “it Is the strategy of NLNG to target the domestic market by supplying LPG, because if there’s availability, the prices will now become affordable”."
  },
  {
    "headline": "Cross River immunises over 1000 children against killer diseases",
    "summarized_story": "As many as 1000 children in Odukpani and Calabar South LGAs of Cross River State have so far been inoculated in the ongoing National Immunization Plus Days (NIPD,) a periodic health intervention scheme.\nShe said the NIPD was created to ensure total vaccination of children within the ages of 0-59 months against Polio and some childhood killer diseases.\nShe disclosed that health workers were mobilised to designated centres spreading across markets, schools, churches and other strategic locations in two councils.\nEkpenyong emphasised that the agency seeks to actualize the ‘Zero missed child’ target in the ongoing National Immunization Plus Days Exercise.\nShe said there is no form of discrimination in any community irrespective of topographic challenges as health interventions are enjoyed by all."
  },
  {
    "headline": "PIA: Reps move to transfer assets of defunct NNPC",
    "summarized_story": "The House of Representatives has started moves to transfer assets of the defunct Nigeria National Petroleum Corporation (NNPC) to NNPC Limited.\nChima said the Ad-hoc Committee had resolved to request for detailed information on NNPC assets, interests, liabilities and up-to-date audited reports from the CEO of NNPC Limited.\nIt is also hinged on the provisions of Section 54 of the recently signed Petroleum Industry Act 2021.\nIf the determination and transfer is not done within the stipulated 18 months, the assets, interests, and liabilities are deemed transferred to NNPC Limited,” the chairman stated.\n“Chapter 2 details the general administration of the oil and gas industry and other related matters."
  },
  {
    "headline": "Small Arms: Youths seek immediate passage of Bill",
    "summarized_story": "The Coalition of Nigerian Youths on Safety and Security Affairs (CONYSSA) are seeking the passage and signing into law of the Bill of Nigeria National Commission against the Proliferation of Small Arms, Ammunition and Light Weapons.\nThe President and National Coordinator, CONYSSA, Ademario Emmanuel, said the Bill is important to Nigerians and shouldn’t be treated with any form of disinterest by the leadership of the National Assembly.\nMaking the call at a press conference in Abuja, he described the delay in the passage of the Bill as inconsistent with the good track record of the 9th National Assembly.\nHe added that if nothing is done about the Bill, the youths will embark on a nationwide protest.\nAccording to him, “It will be recalled that this Bill has already passed the Second Reading in the Senate, but has not been treated further since then."
  },
  {
    "headline": "ASUU to embark on indefinite strike – UNIJOS chairman",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) is set to embark on an indefinite strike action due to the failure of the Federal Government to implement the existing agreements with the body.\nAccording to him, “We are resolved to proceed on an indefinite and comprehensive strike until fidelity returns to our relationship with the government and our demands are met.\nMaigoro, who described the federal government as an “unfaithful spouse”, said the union would not relent until the standard of education is uplifted in the country.\nLike an unfaithful spouse, they are unable to match their words with action which is affecting the education sector negatively,” he said.\nWe are determined to end the dubious pronouncements by a government claiming commitment to sound university education and fidelity to the collective agreement."
  },
  {
    "headline": "For Chief Charles Amilo (1945-2021)",
    "summarized_story": "One of the shining lights of that House, Amilo was to distinguish himself across party and legislative lines that he was gifted with another term.\nI will always remember my first meeting with Chief Amilo in Awka,circa 2009.\nAmilo candidly listened to my request to join the Chris Ngige Media Machinery that was been set up for the 2010 polls, that was after he had read some of my articles then in the dailies.\nI recall the day, he and ECJ Nwosu had a fierce but yet friendly and enlightening argument on who won the 1983 guber elections in old Anambra.\nOne key trait of Amilo was his loyalty to causes he believed in."
  },
  {
    "headline": "14 Govs backing Tinubu’s presidential bid – Jibrin",
    "summarized_story": "No fewer than 14 Governors are passionately supporting the presidential bid of the All Progressives Congress (APC) National Leader Asiwaju Bola Ahmed Tinubu, a former member of the House of Representatives Abdulmumin Jibrin has stated.\nFour additional Governors, he stated, are also in talks to join the presidential train.\nJibrin, who is the Director-General of the Bola Tinubu Support Group Council, further said 26 APC chairmen across the Federation have also confirmed their support for former Lagos Governor.\nRead Also: Let Tinubu beHe tweeted: “14 Governors in and 4 in talks.\n- Advertisement -“We are exercising our right of choice by promoting Alhaji Asiwaju Bola Ahmed Tinubu."
  },
  {
    "headline": "Blackout as fire destroys 1,320MW Egbin Power Plant",
    "summarized_story": "By Adewale SanyaoluThe poor state of power supply is set to take a turn for the worse within Lagos and environs as the one of the largest power generating plant in Sub-Saharan Africa, Egbin Power Plc, has been engulfed in a fire outbreak.\nThe incident occurred at its power plant on Wednesday, February 2, 2022, at around 4.20pm.\nThe statement reads, ‘’The management of Egbin Power Plc, wishes to inform its stakeholders and the public of a fire incident that occurred at the power plant on Wednesday, February 2nd 2022 at around 4.20pm.\n‘’The incident was successfully controlled by a team of Egbin firefighters working in collaboration with firefighters from the Nigeria Gas Company in Egbin.\n‘’As the foremost power plant in the nation, Egbin remains committed to providing power innovatively and responsibly in compliance with good health, safety and environmental standards.’’"
  },
  {
    "headline": "Breaking: Gunmen Invade Allawa, Mariga, Kill Soldiers, Burn down Military Camp",
    "summarized_story": "From John Adams, MinnaFor second time, gunmen have attacked the military camp in Allawa in Rafi local government area of Niger state burnt down their camp and carted away weapons.\nThe gunmen were also said to have gone away with a Hilux van belonging to the military.\nThe gunmen numbering about 200 invaded Allawa town about 10;00pm on Thursday and made their straight to the Military camp and engaged the soldiers in a fierce gun battle which lasted for several hours.\nAccording to a source close to Allawa town, there were casualties on both sides but details of the actual casualties was still sketchy as the time of filing this report as nobody could go inn or out of Allawa town.\nRecalled that in April last year, the gunmen invaded the same military camp in Allawa, killing five soldiers and an Inspector of Police."
  },
  {
    "headline": "FG uncovers 123 companies, 33 BDCs, 424 associates linked to terrorism financing",
    "summarized_story": "From Adetutu Folasade-Koyi, AbujaThe Federal Government has identified 96 financiers of terrorism, involving about 123 companies, including 33 bureaux de change.\nAlso, 424 associates of the terrorism were identified, with 45 suspects arrested and to be prosecuted.\nHowever, Mohammed neither revealed the names of the terrorism financiers nor those holding onto the N7.674 trillion owed the Federal Government.\nNevertheless, at the media parley, yesterday, the Information Minister added that government has, so far, recovered N700 billion through its whistleblower policy.\nHe said:”It is common knowledge that one of the most difficult tasks for any government is to fight corruption, because when you fight corruption, corruption will fight you back!"
  },
  {
    "headline": "2023: Igbo president’ll save Nigeria –Ohanaeze",
    "summarized_story": "From Magnus Eze, EnuguOhanaeze Ndigbo Worldwide has said Nigeria is facing a synchronised national crisis which could lead to its eventual collapse or dismemberment.\nThe group, howeever, said Igbo president in 2023 will save the country from the crisis.\nIt warned against the continued disregard to the negotiated agreements on sensitive issues of power-sharing and balancing of power regardless of any other conditions.\nHow did we get to NADECO (Abiola crisis) and even South South Avengers?\n“Nigeria was a country negotiated and amalgamated under some agreements that balanced sensitive issues of power-sharing and balancing of power regardless of any other conditions."
  },
  {
    "headline": "ISWAP must not be allowed to fester, else Boko Haram’ll be child’s play – Zulum",
    "summarized_story": "“And then whether we like it or not a few days ago, I’ have said something about two local governments still not occupied by human population.\nSome say that two local governments are under the control of Boko Haram, no.\nTwo local governments are not occupied by human population.\nBut whether we like it or not, if two local governments are not occupied, what does it mean?\nIt means the capacity is not there to protect this human population to go to this local government areas."
  },
  {
    "headline": "Ernest Shonekan’s Funeral in Photographs",
    "summarized_story": "Former Head of the Interim National Government, Chief Ernest Shonekan’s funeral service was held Friday at the All Saints Cathedral Marina, Lagos State.\nHere are images of the funeral service, which was attended by Vice President Yemi Osinbajo and former Head of State, General Yakubu Gowon.\nShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Zulum: We Must Defeat ISWAP at All Cost Else B’Haram will Be Child’s Play",
    "summarized_story": "One, I said it before, a growing number of ISWAP in some parts of the state is a matter of great concern to everybody.\nAnd we should do everything possible to defeat ISWAP; otherwise, what Boko Haram did will be a child’s play.\nISWAP will be a threat to the entire nation, because of the proximity of Sub-Saharan Africa.\n“On terrorism financing, NFIU had intelligence exchanges on Boko Haram, ISWAP, banditry, kidnapping and others with 19 countries.\nThe minister said, “It is common knowledge that one of the most difficult tasks for any government is to fight corruption, because when you fight corruption, corruption will fight you back!"
  },
  {
    "headline": "APC Formally Informs INEC of Feb. 26 Convention Date",
    "summarized_story": "Adedayo Akinwale in AbujaThe All Progressives Congress (APC) has written to the Independent National Electoral Commission (INEC) to officially communicate its plan to hold a national convention on February 26.\nThe letter read, “Follow up to our letter referenced APC/NHDQ/INEC/19/021/40 dated 11 July, 2021, on the notice for the conduct of national convention.\nThis is to inform the commission that our great party has scheduled to hold its National Convention on Saturday, 26 February 2022.\n“This serves as a formal notification pursuant to the provisions of Section 85 of the Electoral Act (2010), as amended.\nWith this formal notification to INEC, it appears all is now set for the convention to hold."
  },
  {
    "headline": "ECOWAS to Deploy Stabilisation Force in Countries Under Threat of Military Takeover",
    "summarized_story": "A communiqué at the end of the meeting strongly condemned the attempted coup d’état in Guinea Bissau and expressed solidarity with President Umaro Sissoco Embalo and the people of Guinea Bissau.\nSuzi Carla BARBOSA, Senior Minister of Foreign Affairs, International Cooperation and the Diaspora of Guinea Bissau, on the circumstances surrounding the attempted coup d’état in Guinea Bissau on 1st February 2022.\n“The Authority firmly condemned the attempted coup d’état in Guinea Bissau and expressed solidarity with President Umaro Sissoco Embalo and the people of Guinea Bissau.\n“In view of these recent developments, the Authority decides to deploy a force with a view to supporting the stabilisation of the country.\nIt called on the military authorities in Guinea Bissau to establish the transition institutions, adopt a transition calendar, and facilitate the return to constitutional order within the shortest time possible."
  },
  {
    "headline": "PIA: House Moves to Transfer Defunct National Oil Corporation’s Assets to NNPC Limited",
    "summarized_story": "Udora Orizu in AbujaThe House of Representatives has begun moves to transfer assets belonging to the defunct Nigerian National Petroleum Corporation (NNPC) to the newly established Nigerian National Petroleum Company Limited, in line with the Petroleum Industry Act (PIA).\nKingsley Uju Chima, who presided over a meeting of the panel, said there were plans to meet with Chief Executive Officer of NNPC Limited, Mele Kyari, soon.\nIt is also hinged on the provisions of Section 54 of the recently signed Petroleum Industry Act.\n“The Minister of Finance and Attorney General of the Federation shall develop a framework for payment of liabilities not transferred to the NNPC Limited.\nIf the determination and transfer is not done within the stipulated 18 months, the assets, interests and liabilities are deemed transferred to NNPC Limited.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "How Multi-billion Naira Cancer Centre Former Nigerian First Lady, Turai Yar’Adua Raised Billions Of Naira For Remains Abandoned In Abuja After 12 Years",
    "summarized_story": "An Abuja multi-billion-naira International Cancer Centre (ICC) is yet to take off 12 years after the project was established.\nMrs Turai Yar’Adua, the wife of the late former president, Umaru Yar’Adua, was the brains behind the establishment of the centre that is located on Nnamdi Azikiwe Airport Road in the Federal Capital Territory (FCT).\nIt was said that her aim was to build a cancer centre in the nation’s capital that would cater for people, especially the poor.\nTwelve years after, the centre has been abandoned, with the multi-billion-naira equipment and mini-buses already procured for the project rusting away, The Guardian reports.\nBut we have finished the first phase of the hospital, it’s a very big project.”According to Turai Yar’Adua, the first phase consists of about 200 rooms, four theatres and other administration offices."
  },
  {
    "headline": "EXCLUSIVE: Ex-Naval Director On Wanted List For N2billion Fraud, Tahir Yusuf Planning To ‘Sneak Out’ Of Nigeria Through Chad Republic",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC), is planning to flee the country, sources close to the retired military officer told SaharaReporters.\nThe anti-graft agency had accused Yusuf of stealing N2 billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nFollowing the forfeiture, SaharaReporters gathered that Yusuf fled Nigeria to Dubai, United Arab Emirate.\nHowever, Yusuf sneaked back to the country in October 2021 after he illegally obtained an international passport with the help of some corrupt government officials through the Niger Republic, a source had told SaharaReporters."
  },
  {
    "headline": "EXCLUSIVE: Ex-Naval Director On Wanted List For N2billion Fraud, Tahir Yusuf Planning To ‘Sneak Out’ Of Nigeria Through Chad Republic",
    "summarized_story": "A former Director of Nigerian Navy Accounts, Rear Admiral Tahir Yusuf (retd.\n), on the wanted list of the Economic and Financial Crimes Commission (EFCC), is planning to flee the country, sources close to the retired military officer told SaharaReporters.\nThe anti-graft agency had accused Yusuf of stealing N2 billion belonging to the Nigerian government while serving as Director of Nigerian Navy Accounts.\nFollowing the forfeiture, SaharaReporters gathered that Yusuf fled Nigeria to Dubai, United Arab Emirate.\nHowever, Yusuf sneaked back to the country in October 2021 after he illegally obtained an international passport with the help of some corrupt government officials through the Niger Republic, a source had told SaharaReporters."
  },
  {
    "headline": "EXTRA: I can rebrand Nigeria as I did with Enyimba FC, says Orji Kalu",
    "summarized_story": "Orji Kalu, chief whip of the senate, says if elected president, he will make Nigeria a “big player” in world affairs just like what he did with Enyimba FC.\nEnyimba FC, an Aba-based football club was taken over by the Abia government after the state was created in 1991.\nSpeaking on Friday during an interview on Channels Television on what he will offer Nigeria if elected president, the former Abia governor said Nigeria is like a football team which he can effectively manage.\nAdvertisement“Nigeria to me is like a football team and I have done it in the past with the Enyimba football team and I can do it in the future because what every aspect of this country needs is just motivation.\nI do not think they can speak to anybody in Nigeria or in the world I can’t speak to."
  },
  {
    "headline": "EXTRA: I can rebrand Nigeria as I did with Enyimba FC, says Orji Kalu",
    "summarized_story": "Orji Kalu, chief whip of the senate, says if elected president, he will make Nigeria a “big player” in world affairs just like what he did with Enyimba FC.\nEnyimba FC, an Aba-based football club was taken over by the Abia government after the state was created in 1991.\nSpeaking on Friday during an interview on Channels Television on what he will offer Nigeria if elected president, the former Abia governor said Nigeria is like a football team which he can effectively manage.\nAdvertisement“Nigeria to me is like a football team and I have done it in the past with the Enyimba football team and I can do it in the future because what every aspect of this country needs is just motivation.\nI do not think they can speak to anybody in Nigeria or in the world I can’t speak to."
  },
  {
    "headline": "Scientists discover new 'highly transmissible' HIV variant in Netherlands",
    "summarized_story": "Scientists have announced the discovery of a new “highly virulent” strain of the Human Immunodeficiency Virus (HIV) in the Netherlands.\nThe variant, referred to as the subtype-B HIV-1 and dubbed the VB variant, is said to produce higher levels of viral load in infected patients than those affected with other variants.\nWe found 109 individuals with the variant (VB individuals) whose age, sex, suspected mode of transmission, and region of birth are all typical for people living with HIV in the Netherlands,” the study reads.\n“Advanced HIV is reached even more quickly in older age groups, and there is considerable variation between individuals around these expected values.\n“Our discovery of a highly virulent and transmissible viral variant therefore emphasizes the importance of access to frequent testing for at-risk individuals and of adherence to recommendations for immediate treatment initiation for every person living with HIV (www.who.int/hiv/pub/arv/),” they added."
  },
  {
    "headline": "Scientists discover new 'highly transmissible' HIV variant in Netherlands",
    "summarized_story": "Scientists have announced the discovery of a new “highly virulent” strain of the Human Immunodeficiency Virus (HIV) in the Netherlands.\nThe variant, referred to as the subtype-B HIV-1 and dubbed the VB variant, is said to produce higher levels of viral load in infected patients than those affected with other variants.\nWe found 109 individuals with the variant (VB individuals) whose age, sex, suspected mode of transmission, and region of birth are all typical for people living with HIV in the Netherlands,” the study reads.\n“Advanced HIV is reached even more quickly in older age groups, and there is considerable variation between individuals around these expected values.\n“Our discovery of a highly virulent and transmissible viral variant therefore emphasizes the importance of access to frequent testing for at-risk individuals and of adherence to recommendations for immediate treatment initiation for every person living with HIV (www.who.int/hiv/pub/arv/),” they added."
  },
  {
    "headline": "Amaechi: Chinese no longer funding us like before... work may slow down on Kano-Kaduna rail project",
    "summarized_story": "Rotimi Amaechi, minister of transportation, says lack of adequate funding may slow down the pace of work and completion of the Kano-Kaduna railway project.\nThe minister made this known while inspecting work on the project in Kano on Friday.\n“I have never denied that we are having financial challenges, and that is because of economic downturn,” Amaechi said.\nAmaechi restated the importance of utilising local materials and manpower in the construction of the rail project.\nOn equipment, he said it was agreed that the Chinese should bring in 2,000 pieces of equipment for the construction of the project."
  },
  {
    "headline": "Saudi Arabia: A new home for Nigerian startups?",
    "summarized_story": "The Startup Passport initiative, which will ultimately be between the 8-member DCO countries, rolled out initially in Saudi Arabia and Nigeria.\nThis announcement implies that Nigerian startups building products that primarily serve the Middle East and North Africa (MENA) region are invited to build their companies from Saudi Arabia with support from the government.\nFaris AlSaqabi, Saudi Deputy Minister for Future Jobs and Capabilities, explained that the bond between Saudi Arabia and Nigeria is fueled by the country’s movement to a digital economy.\nNigerian Minister of Communications and Digital Economy, Isa Ali Pantami in conversation with a representative of the Digital Cooperation Organization.\nThis new program is expected to transform Saudi Arabia into a leading digital entertainment and media production hub."
  },
  {
    "headline": "TechCabal is surging ahead in 2022 and beyond 🚀",
    "summarized_story": "This year, we are hyper-focused on fine-tuning our editorial standards and establishing TechCabal as one of Africa’s most reputable technology and media publication.\nHe was a senior staff writer at TechCabal for 1 year and 8 months.\nHe was a staff writer at TechCabal for almost 2 years.\nMLIT is a flagship launched by Kay Uguwede, a former TechCabal staff writer.\nDigital Nomads was launched and exclusively written by Olumuyiwa, a former senior staff writer at TechCabal."
  },
  {
    "headline": "Detty December: New data identifies Lekki Phase 1 as Lagos’s COVID-19 hotspot",
    "summarized_story": "Adaobi* is a 24-year-old software engineer living with her 49-year-old mother Oge* at Lekki Phase 1, in Lagos, Nigeria.\nWe noticed that customers in Lekki Phase 1 that would normally order 20 packs of antimalarial drugs for sale within 3–4 days were now ordering 60–70 packs every 1–2 days,” said Okwuada.\nA sore throat is not indicative of malaria but it is one of the major symptoms of COVID-19.\nAnother resident of Lekki Phase 1 jokingly said he suspects everybody in Lekki has the virus already.\nAccording to a Reuter data, COVID-19 infections are decreasing in Nigeria, with 94 new infections reported on average each day."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, This Saturday was Techpoint Build 2021, and it was the thing!!!!!\nFrom the Speaker line-up, which in our..."
  },
  {
    "headline": "Afrobeats: “There are global moments, but the biggest opportunity is Nigeria.” — Obi Asika",
    "summarized_story": "Obi Asika, Founder of Storm 360 Records and Co-founder of Social Media Week LagosThere is no doubt that African music, especially Afrobeats — the melting pot of West African music styles blended with American Jazz — has gone global.\nThis was then fused with Western influences to create Afrobeats.\nBy the late 2000s, we had Myspace, then Facebook, followed by YouTube,” Asika noted.\nWhile Asika believes that several platforms played a significant role in making Afrobeats go global, the talents that create the music play the biggest part.\n“Once we see the Internet no longer becoming a barrier, we’re truly going to see how African music will blow up."
  },
  {
    "headline": "How changing customer attitudes will affect fintech business models in Africa",
    "summarized_story": "Nigeria alone has 144 fintech startups, per Statista.\nAn underdeveloped financial system, difficulty accessing credit, and a growing number of smartphone users present a huge opportunity for new and existing fintech players in Africa.\nAdvertisementPreparing for competitionOluwatobi Boshoro, CEO of Infinitetiks, believes that fintech startups can expect to see competition from startups on the fringes of the financial services sector.\nCurrently, most fintech startups in Africa are focused on one financial service.\nSo what does this mean for fintech startups?"
  },
  {
    "headline": "Building a sense of trust and providing insurance for more Africans",
    "summarized_story": "Today, I’m discussing:GIG Logistics’ crypto integrationLAMI’s acquisition to drive expansion in AfricaGIG Logistics’ crypto integrationRecently, the only constant for Bitcoin has been a downward spiral.\nThose who do not have an XPAD wallet can create one on GIGGO.\nDue to the traditional distribution of insurance policies by individual insurance agents, Africa has low insurance coverage.\nTo make insurance coverage available to more people in Africa on a larger scale, the company has acquired Bluewave Insurance Agency for an undisclosed sum.\nAdelaide Odhiambo, who now works as the head of commercial partnerships at Lami, founded Bluewave Insurance, another Kenyan startup."
  },
  {
    "headline": "Oil crosses $92, its highest level in over seven years",
    "summarized_story": "Oil crosses $92, its highest level in over seven yearsOil prices reached seven-year highs on Friday as geopolitical tensions and a winter storm in the US fuelled concerns over supply disruptions.\nRead also: OPEC+ to raise oil production by 400,000 in MarchOil markets have also gained support from tensions surrounding the Ukraine crisis, which have heightened concerns over oil supplies that are already tight.\n“The late-session recovery in oil prices was also aided by fresh evidence of OPEC’s struggle to raise output,” said Stephen Brennock of oil Broker PVM.\nIraq, Opec’s second-largest oil producer, pumped well below its Opec+ quota in January, data from state-owned marketer Somo showed on Thursday.\nCommerzbank has raised its oil price forecast for the first quarter of 2022 to $90 a barrel, up from $80 previously."
  },
  {
    "headline": "Escravos explosion: Setback for local content drive",
    "summarized_story": "“These recent incidents will raise questions and scepticism about the technical know-how of the local operators going forward, a development that is bad for Nigeria’s Local Content Act,” an investor exposed to Nigeria’s oil and gas sector says.\n“No operation in the energy sector must compromise on safety to accommodate local content,” Nwakwue states.\nIn 2017, the NCDMB launched the $200 million NCI Fund, which is funded from the Nigerian Content Development Fund established by the Local Content Act, helping to fund asset acquisition and assisting in loan refinancing.\nBy 2027, the NCDMB says it intends to increase local content to 70 percent, which will see the retention of as much as $14 billion within the country, annually.\nBut the inability of local oil firms to rise up to recent oil spills and handle re-mediation works in case of emergency calls for concern, experts say."
  },
  {
    "headline": "APC side-steps crisis, set for convention",
    "summarized_story": "The ruling All Progressives Congress (APC) has shown serious signs of going ahead with February 26, 2022, the date for the National Convention of the party, despite internal wrangling and negative permutations.\n“There must be issues in a political party.\n“We cannot sit down and say until all issues are settled before we can hold a convention.\nIf APC fails to conduct the convention as already fixed, the party will lose credibility,” he said.\n“I do not see any sense in the argument that why the National Convention would not hold is because the Abdullahi Adamu-led committee is still busy with its reconciliation drive."
  },
  {
    "headline": "OLAYIWOLA AFOLABI UPLIFTS THE LEGAL PROFESSION – Nigerian Observer",
    "summarized_story": "For instance, he has an award scheme for honouring honest, disciplined and diligent junior staff of Edo State judiciary.\nIcons of the bench and bar have equally been honoured by Olayiwola Afolabi in one way or the other.\nIn 2018, Olayiwola Afolabi hosted the new executive members of NBA, Edo State Chapter to a dinner.\nIn 2020, Olayiwola Afolabi officially institutionalized this mentoring process with the establishment of AFOLABI ANNUAL LEGAL CLINIC AND COACHING LECTURE SERIES.\nAlso in line with his tradition of honouring icons in the judiciary, Olayiwola Afolabi has instituted Stephen Omonuwa Transparency Award."
  },
  {
    "headline": "Digital Broadcasting: Ministry of Communication and Orientation to Partner Edo State University, Uzairue – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestUZAIRUE- – Edo State Ministry of Communication and Orientation will partner with Edo State University Uzairue in raising a new set of professionals that will drive the progress that Nigeria needs in the Broadcasting industry, just as the Ministry work towards having a new digital broadcasting sector.\nAndrew Adaze Emwanta during a facility tour of the Edo state University Uzairue, Etsako West Local Government area of Edo State.\nHe disclosed that the Ministry of Communication and Orientation is working towards having a new digital broadcasting sector to be controlled by the state.\nAccording to him, “Broadcasting has gone beyond analogue and the Ministry is working towards having a new digital broadcasting sector that we as a state can control.\n“The Nigeria University Commission, NUC ranking has placed Edo University 10th best in Nigeria, 2nd best in the state and the best in the South South region."
  },
  {
    "headline": "Edo Cricket Teams Win PWC National U-17 South-South Qualifiers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State male and female U-17 cricket teams, emerged champions respectively, at the PWC national cricket under 17 South-South zonal qualifiers, which took place in Benin City.\nIn the male category of the qualifiers, that took place at the Edo boys high school Cricket pitch, in Benin City, the Edo State defeated Akwa Ibom by 10 wickets.\nIn the first innings, the Edo State team had chased down their 51 runs target in the 15th over having run the Akwa Ibom team out for 50.\nEarlier in the qualifiers, the Edo State team defeated Delta state by 2 wickets in the preliminary round (Super Knockout) that took place yesterday.\nAt the Iyoba girls college where the female qualifiers took place, the Edo State team led by Coach Guobadia Esewi Peter also became champions."
  },
  {
    "headline": "NBBF: Kida vows to build solid,sustainable Domestic leagues – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – After a successful elective Congress of the Nigeria Basketball Federation (NBBF) in Benin City, the leadership of the NBBF board led by Engr Musa Kida has expressed its determination to build a domestic league structure that will reflect the immense potentials that abound in Nigeria.\nThe reelected NBBF President Musa Kida gave the assurance while entertaining questions from Journalists in Benin.\nEngr Musa Kida who was unanimously returned as the NBBF’s president said the symbolic election heralds a new dawn with the domestic league at the front burner of the board’s plan.\n“We are hoping that all these stakeholders will come on board so that together we have a verile and enviable domestic league”.\nNigeria basketball election into its federation was conducted in the most democratic way with 27 states out of the 36 and the Federal Capital Territory present”."
  },
  {
    "headline": "Inauguration: Osun West Senatorial District Rejoices with Famoodun",
    "summarized_story": "Leaders and all the political office holders in Osun West Senatorial District have rejoiced with the state chairman of the All Progressive Congress, Prince Gboyega Famoodun, on his inauguration.\nThe senatorial district in a congratulatory message issued and signed by the district chairman-elect, Hon.\nOmolaoye Akintola and made available to newsmen in Osogbo on Thursday, expressed their joy over the successful Congress that produced Prince Famoodun.\n“The entire APC members including leaders, all political office holders–elected and appointed – in Osun West Senatorial District are rejoicing with the newly sworn -in State Party Chairman in Osun State, Prince FAMODUN, Adegboyega Philips.\n“We expressly share in the inestimable joy the ceremony showered upon our great Party, His Excellency, Alh Isiaka Adegboyega Oyetola and the Deputy Governor."
  },
  {
    "headline": "4.16m Girls, Women At Risk Of Genital Mutilation – UNICEF",
    "summarized_story": "The United Nations Children’s Fund, (UNICEF), on Friday, said that about 4.16 million girls and women are at the risk of genital mutilation even as two million cases of female genital mutilation (FGM) would be recorded by 2030 as a result of COVID-19 disruptions globally.\nThe theme of the zonal dialogue was ‘Accelerated Investment to End Female Genital Mutilation’.\n“The practice of FGM not only has no health benefits, it is deeply harmful to girls and women, both physically and psychologically.\nMrs. Okolo also noted that FGM is recognised internationally as a violation of the human rights of girls and women.\n“It reflects deep-rooted inequality between the sexes and is an extreme form of discrimination against girls and women,” she said."
  },
  {
    "headline": "Zulum, Shettima To Grace Hadizatu Mustapha’s Biography Presentation",
    "summarized_story": "The biography of the immediate-past Chief Registrar of the Supreme Court of Nigeria, Hajiya Hadizatu Uwani Mustapha, has been slated for public presentation on Saturday, February 5, 2022 at the International Conference Centre, Abuja.\nThe book, titled ‘Hadizatu U. Mustapha: From Head Girl to Supreme Court’, was written by Dotun Adekanmbi, an accomplished media relations practitioner and former Editor of Business Times, with Sa’adatu Lawal-Ahmed, an upcoming author and lawyer with the Supreme Court of Nigeria.\nGovernor of Borno State, Prof Babagana Umara Zulum is the Chief Host at the event, while the former Governor of Borno State, Senator Kashim Shettima, will be the Chief Presenter of the book.\nAs Chief Registrar, Hajiya Mustapha, was instrumental to the transformation of the Supreme Court’s archive to achieve workplace efficiency through seamless records management.\nThat project involved proper handling of the huge volume of the Court’s physical records."
  },
  {
    "headline": "Poor, Vulnerable Nigerians Remain My Top Priority – Buhari",
    "summarized_story": "The President reiterated that Nigeria had remained a committed and dedicated member of the African Peer Review family, after acceding to the Mechanism in 2003.\n“Today, the forum has presented its second peer review report on Nigeria.\n“This Second Peer Review of Nigeria came at a critical time in the history of the country.\n“Let me use this opportunity to commend the President of South Africa for his dedication to the Forum since his election as the Chairperson of the African Peer Review Forum.\n“I also recognize the distinguished Panel of Eminent Persons for their continued good work in steering the African Peer Review Mechanism process in all member countries."
  },
  {
    "headline": "Poor, Vulnerable Nigerians Remain My Top Priority – Buhari",
    "summarized_story": "The President reiterated that Nigeria had remained a committed and dedicated member of the African Peer Review family, after acceding to the Mechanism in 2003.\n“Today, the forum has presented its second peer review report on Nigeria.\n“This Second Peer Review of Nigeria came at a critical time in the history of the country.\n“Let me use this opportunity to commend the President of South Africa for his dedication to the Forum since his election as the Chairperson of the African Peer Review Forum.\n“I also recognize the distinguished Panel of Eminent Persons for their continued good work in steering the African Peer Review Mechanism process in all member countries."
  },
  {
    "headline": "Hijab Crisis: Kwara Muslims Ask Govt To Set Up Commission Of Inquiry",
    "summarized_story": "Kwara State Muslim stakeholders, on Friday, urged the state government to enforce its policy on wearing of hijab by Muslim schoolgirls in all government grant-aided secondary schools.\nThe people, who called for immediate closure of the school and relocation of the students to other schools pending the resolution of the crisis, urged the state government to set up a commission of inquiry to unravel the brains behind the alleged killings and maiming of innocent Muslim parents in Ijagbo.\nADVERTISEMENTLEADERSHIP reports that one person was feared killed in the Thursday violence at the Oyun Baptist High School, Ijagbo.\nThe group also called on the Police to investigate the circumstatnces surrounding the crisis with a view to bringing the perpetrators to book.\nHe said that as at Thursday, there was no case instituted at the Supreme Court by CAN on the earlier judgements delivered by a Kwara State High Court and the Court of Appeal."
  },
  {
    "headline": "Nigerian doctor suspended for hugging colleague in Canada",
    "summarized_story": "The College of Physicians and Surgeons of Alberta Tribunal has suspended a Canada-based Nigerian doctor for getting intimate with his colleague at work.\nIt was learnt that the medical doctor identified as Efe Ovueni was suspended for three months over unprofessional conduct by hugging and blowing a kiss at her co-worker without her consent.\nThe doctor was also fined $3,000 and is liable for the undisclosed cost of the hearing and investigation.\nWith the fine and suspension which takes immediate effect, Ovueni has been banned from medical practice for over 90 days.\nThe doctor admitted his unprofessional conduct during the tribunal hearing, promising to turn a new leaf."
  },
  {
    "headline": "Nigerian doctor suspended for hugging colleague in Canada",
    "summarized_story": "The College of Physicians and Surgeons of Alberta Tribunal has suspended a Canada-based Nigerian doctor for getting intimate with his colleague at work.\nIt was learnt that the medical doctor identified as Efe Ovueni was suspended for three months over unprofessional conduct by hugging and blowing a kiss at her co-worker without her consent.\nThe doctor was also fined $3,000 and is liable for the undisclosed cost of the hearing and investigation.\nWith the fine and suspension which takes immediate effect, Ovueni has been banned from medical practice for over 90 days.\nThe doctor admitted his unprofessional conduct during the tribunal hearing, promising to turn a new leaf."
  },
  {
    "headline": "Five reasons to watch Glo Battle of the Year Nigeria reality TV show",
    "summarized_story": "By NUELLA ELLAMSNigerians are set for 13 weeks of excitement and drama as telecom powerhouse, Globacom, premieres its Glo Battle of the Year Nigeria reality tv show on GloTV, the company’s mobile streaming app as well as on cable and terrestrial channels.\nThe winners will go home with mega millions while the overall winner will, apart from his cash prize, represent Nigeria at the international Battle of the Year competition in JapanAs the 13 episode reality tv show premieres on Saturday February 5, 2022, here are 5 reasons why you don’t want to miss any episode.\nJust watch this show for the back stories of the contestants and the grass to grace story that is about to happen.\nYup and you can check out this list from Glo Naija Sings, Dance with Peter, Glo X-factor as well as flagship shows like Glo Laffta Fest, Glo Campus Storm and Glo Music Fiesta.\nGlo Battle of the Year Nigeria reality tv show is set to extend the run and provide viewers with something super exciting for the whole family."
  },
  {
    "headline": "Five reasons to watch Glo Battle of the Year Nigeria reality TV show",
    "summarized_story": "By NUELLA ELLAMSNigerians are set for 13 weeks of excitement and drama as telecom powerhouse, Globacom, premieres its Glo Battle of the Year Nigeria reality tv show on GloTV, the company’s mobile streaming app as well as on cable and terrestrial channels.\nThe winners will go home with mega millions while the overall winner will, apart from his cash prize, represent Nigeria at the international Battle of the Year competition in JapanAs the 13 episode reality tv show premieres on Saturday February 5, 2022, here are 5 reasons why you don’t want to miss any episode.\nJust watch this show for the back stories of the contestants and the grass to grace story that is about to happen.\nYup and you can check out this list from Glo Naija Sings, Dance with Peter, Glo X-factor as well as flagship shows like Glo Laffta Fest, Glo Campus Storm and Glo Music Fiesta.\nGlo Battle of the Year Nigeria reality tv show is set to extend the run and provide viewers with something super exciting for the whole family."
  },
  {
    "headline": "900,000 Americans die of COVID-19 in new grim milestone",
    "summarized_story": "U.S. death toll from COVID-19 hit 900,000 on Friday, less than two months after eclipsing 800,000, figures by John Hopkins University showed.\nThe heavy death toll recorded in two years is greater than the population of Indianapolis, San Francisco, or Charlotte, North Carolina.\nExperts said COVID-19 is not finished with the U.S. yet as the country may hit one million deaths by April.\nSo far, the U.S. has recorded over 77 million cases and over 900,000 deaths.\nIndia is second with 42 million cases, but third in death toll of over 500,000."
  },
  {
    "headline": "American University Yola enrols 1,232 out-of-school children",
    "summarized_story": "By Ibrahim Kado/YolaThe American University of Nigeria (AUN) in Yola, Adamawa, has enrolled no fewer than 1,232 out-of-school children under its feed and read programme.\nNkem Uzowulu, Principal of AUN School, disclosed this at the enrolment of 100 out-of-school children from the host community, Yola on Friday.\nUzowulu said the programme is aimed at reducing the number of children roaming the streets without any form of formal education.\nHe said focusing on the host community is very important as what affects the community affects the AUN and what affects AUN will affect the community.\n“AUN is development university, we see and know that what affects the community affects us we are an extension of the community, ” he said"
  },
  {
    "headline": "14 Govs Backing Tinubu’s Presidential Bid-Jibrin",
    "summarized_story": "No fewer than 14 Governors are passionately supporting the presidential bid of the All Progressives Congress (APC) National Leader Asiwaju Bola Ahmed Tinubu, a former member of the House of Representatives Abdulmumin Jibrin has stated.\nFour additional Governors, he stated, are also in talks to join the presidential train.\nJibrin, who is the Director-General of the Bola Tinubu Support Group Council, further said 26 APC chairmen across the Federation have also confirmed their support for Asiwaju.\nHe tweeted: “14 Governors in and 4 in talks.\n“We are exercising our right of choice by promoting Alhaji Asiwaju Bola Ahmed Tinubu."
  },
  {
    "headline": "Video: Lying-in-state of former head of Interim Govt, Ernest Shonekan",
    "summarized_story": "Video: Lying-in-state of former head of Interim Govt, Ernest ShonekanThe lying in state for the former head of interim national government, Ernest Shonekan was held at his residence in the Ikoyi area of Lagos.\nThe well-attended event had in attendance top government officials, business leaders and members of the diplomatic corps.\nChief Shonekan died on January 11th, 2022 after a brief illness and has since been buried at Ebony Vaults in Ikoyi, Lagos after a funeral service held at the Cathedral Church of Christ.\nOsinbajo, who led the Federal Government delegation, described the late Shonekan as a man of integrity, saying he steadied Nigeria’s ship at a turbulent time.\nWatch the lying in state below;"
  },
  {
    "headline": "Declare State Of Emergency On School Infrastructure, Reps Tell Federal Government",
    "summarized_story": "Stakeholders debated the decision of state governments to abdicate their responsibilities for investing in basic education in their domains during the National Education Summit, which closed on Friday in Abuja.\nThe summit organised by Human Development Initiatives had as its theme: ‘Building qualitative, inclusive and adaptive education system: Meeting modern day education challenges in Nigeria.”The chairman, House of Representatives Committee on Basic Education, Julius Ihonvbere, demanded the declaration of state of emergency in school infrastructure.\nThe stakeholders said a good number of states do not appear enthusiastic about funding basic education as they do not access funds in the Universal Basic Education Commission.\nWhile expressing concerns over state governments’ refusal to access their matching grants from UBEC, he said that many state governments which had collected counterpart funding for education do not use it judiciously.\nWe don’t need development partners to tell us what to do right.We are not lacking in policy."
  },
  {
    "headline": "Heavy Security Presence In Lagos As Former Interim Head Of State, Ernest Shonekan Is Laid To Rest",
    "summarized_story": "Heavy Security Presence In Lagos As Former Interim Head Of State, Ernest Shonekan Is Laid To RestOn Friday, the funeral service of former Nigerian leader Chief Ernest Shonekan was held at the Cathedral Church Of Christ, Marina in Lagos, which was heavily guarded.\nThe 81 Division of the Nigerian Army was also planned to give a 21-artillery cannon salute in Shonekan’s honor as part of the state funeral ritual.\nBefore being proclaimed dead by medical professionals in January, the deceased legal practitioner was the Abese of Egbaland.\nHe was born in Lagos on May 9, 1936, into the family of a public servant from Abeokuta.\nThe Lagos State Government had already announced that all bordering and feeder roads leading to Marina would be closed to facilitate easy access for guests attending the late Shonekan’s funeral service."
  },
  {
    "headline": "VIDEO: Zamfara deputy speaker submits impeachment letter as lawmakers plot deputy governor’s ouster in fresh move",
    "summarized_story": "The Zamfara state House of Assembly has begun a fresh attempt to impeach the state deputy governor Barr.\nMahadi Aliyu Muhammad Gusau.\nBlueprint reports that already, the impeachment letter has been submitted to the speaker of the state assembly Hon.\nNasiru Muazu Magarya in the early hours of Friday for final decision.\nThe accompanying video clip shows the house speaker receiving impeachment Letter from the deputy speaker."
  },
  {
    "headline": "Ritual killings: Horror as pupils now endangered species",
    "summarized_story": "Unarguably, this category of school children has become an endangered species as they are abducted, raped and even murdered either in their homes or schools.\n“During investigation, Mohammed-Tanko confessed that the victim, Hanifa, was his student at a private school in Kwanar Dakata, Nassarawa, Kano state.\nHe kidnapped her and took her to his house where he contacted her relatives and demanded a ransom of N6 million.\nOn December 18, 2021, having realised that the victim recognised him, he claimed to have poisoned her to death.\n“In January alone, the commission received so many complaints of heinous acts of human rights abuse meted on women and children across the country."
  },
  {
    "headline": "Pictures: Heavy security as late Shonekan’s burial kicks off",
    "summarized_story": "Heavy security abound as the funeral service of former Head of Interim Government, Chief Ernest Shonekan, has kicked off at the Cathedral Church Of Christ, Marina in Lagos.\nThe late Chief Shonekan served as the head of Interim national government between August and November 1993, died on January 11, 2022 at the age of 85."
  },
  {
    "headline": "Shonekan Buried In Lagos Amid Tributes",
    "summarized_story": "The former Head of Interim National Government (ING), Ernest Shonekan, has been buried, ending a four-day funeral rite that began on Monday.\nShonekan was buried at Ebony Vaults in Ikoyi, Lagos on Friday after a funeral service held at the Cathedral Church of Christ.\n“We must not be too much in a hurry,” the former governor told reporters after the funeral service.\nEarlier, a service of songs and a Christian wake keep/night of tributes were held for Shonekan in Lagos.\n“Chief Shonekan was Nigeria’s interim President, he was an astute lawyer, an elder statesman, a doting father, and the dear husband of Mama Margaret Shonekan,” the governor noted."
  },
  {
    "headline": "‘He Was A Man Of High Values’; Osinbajo Extols Shonekan",
    "summarized_story": "Vice President Yemi Osinbajo has rained encomiums on the late Ernest Shonekan, describing him as a man of high value that will be greatly missed for his contributions to national development.\nBut perhaps what deserves greater attention is the way he carried himself through life and the high values he exemplified,” the Vice President said.\nThe Lagos State government had announced a 13-hour closure of roads leading to Marina where the funeral is taking place.\nSince then, Shonekan went on to feature prominently as an elder statesman.\nAt the time of his death, he was the third oldest surviving Nigerian Head of State after Queen Elizabeth II and General Yakubu Gowon."
  },
  {
    "headline": "Amaechi, Malami Sued Over Alleged Unlawful Award Of N91.7bn Rail Line Contract",
    "summarized_story": "The Minister of Transportation, Rotimi Amaechi and the Attorney General of the Federation (AGF), Abubakar Malami (SAN) have been dragged before a Federal High Court in Abuja over an alleged unlawful award of 190 km rail line construction to a Chinese firm without due process of law.\nThey were sued along with the Federal Ministry of Transportation and the benefitting firm, China Civil Engineering Construction Company (CCECC).\nPlaintiffs in the suit marked FHC/ABJ/CS/1426/2021 Duluidas Nigeria Limited, Duliz Dredging and Construction Limited and Consortium of Duluidas Nigeria Limited, Duliz dredging and Construction Limited/Hebbelyixin Fastener Company Limited, China.\nPlaintiffs applied for order of injunction against the minister, his ministry and the CCECC from continuing with the award of the contract and execution of same on the basis of a flawed process.\nMeanwhile, a hearing in the matter has been fixed for February 17, 2022, by Justice Ahmed Ramat Mohammed."
  },
  {
    "headline": "Father, Three Children Found Dead At Poultry Farm In Abuja – Police",
    "summarized_story": "A young man and his three children have been found dead at a poultry farm in Abuja, the nation’s capital.\nThe farm is located at the Abaji Area Council of Abuja, the police said on Friday.\nThey identified the man as Dominic Adigezi aged 29, and his children as Victoria Adigezi (age not available), Peter Adigezi (three years), and Judith Adigezi (aged three months).\nAlthough the cause of the death of the victims has yet to be ascertained, the wife of the young man, Laraba Adigezi was said to have survived, but unconscious.\nShe has been taken to the Abaji Comprehensive Health Care Centre in the area for medical attention."
  },
  {
    "headline": "Evans Denies Kidnapping Businessman, Collecting $420,000 Ransom",
    "summarized_story": "Suspected kidnap kingpin, Chukwudumeme Onwuamadike, popularly known as Evans, has denied kidnapping a businessman, Sylvanus Ahamonu, and collecting a $420,000 ransom from his family.\nAt the proceedings on Friday, Evans, a native of Nnewi in Anambra State, told the court that he was born on April 22, 1980.\n“I do not know Slyvanus Ahamonu, I only met him in the IG’s (Inspector-General of Police) Guest House at Falomo,” the defendant stated.\nWhen I refused, Inspector Philip asked them to take me to the back of the guest house.\nI only met him at the IG’s guest house, I had not had any prior contact with him."
  },
  {
    "headline": "Zamfara speaker receives impeachment notice against deputy governor -",
    "summarized_story": "The Zamfara State House of Assembly has Commenced impeachment process against the state Deputy Governor, Mahdi Aliyu GusauRecall that the assembly had in November last year summoned the deputy governor for questioning over alleged gross misconductAdvertisementThe deputy speaker of the Zamfara State House of Assembly who doubles as the Chairman House committee on Public Accounts, Musa Bawa said the committee has concluded it’s investigation on the matterMusa Bawa submitted the notice of Impeachment of the State deputy Governor Mahadi Gusau to the speaker of the HouseAdvertisementReceiving the notice, the speaker of the House Nasiru Magarya commended the Committee for a job well-done and assures the Committee that the document will be treated according to the provisions of the constitution of the federal Republic of Nigeria 1999 as amended.\nThe Zamfara State House of Assembly is accusing the state deputy governor of breach of constitution, abuse of office, financial misconduct among other thingsAdvertisementThe House is expected to study the document after which the content would be made publicA Federal High Court in Abuja had on July 19 last year restrained the Zamfara State House of Assembly from taking steps to impeachment the state Deputy Governor Mahdi Aliyu Gusau.\nAdvertisement"
  },
  {
    "headline": "APC inaugurates 34 State chairmen amid unresolved factional crisis",
    "summarized_story": "The All Progressives Congress has inaugurated elected state chairmen in the 34 states of the country and the federal capital territory, Abuja.\nHowever, Kano and Sokoto states chairmen were not inaugurated.\nAdvertisementThis is coming on the heels of preparation for the national convention which has been fixed for February 26th, even as the party has confirmed the convention date to the Independent National Electoral Commission (INEC).\nMaking the announcement during inauguration, the secretary of the Caretaker Committee, James Akpanudoedehe said he has been directed to hand over their certificate of return to them"
  },
  {
    "headline": "APC CECPC approves schedule of activities for 2022 National Convention -",
    "summarized_story": "The All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC) has adopted the timetable/schedule of activities for the 26th February, 2022 APC National Convention.\nThe adoption was taken at its 19th regular meeting on Wednesday 19th January, 2022 at the Party’s National Secretariat (Buhari House)AdvertisementThe approved schedule of activities is as follow***Receiving of the Interim Report of the National Reconciliation Committee – 31/01/2022Advertisement***Consideration and adoption of Reports of State Congresses – 02/02/2022***Inauguration of the State Executives – 03/02/2022Advertisement***Sales of Forms to all aspirants vying for National Offices (APC National Secretariat) – 14/02/2022***Submission of completed forms and accompanying documents (APC National Secretariat) – On or before 19/02/2022Advertisement***Publication of Sub-Committees – 19/02/2022***Screening of all aspirants vying for National Offices – 20th – 22nd of February.\n2022Advertisement***Screening Appeals to hear and resolve complaints arising from the screening exercise – 23/02/2022***Accreditation of all statutory and elected delegates to the National Convention – 24th – 25th of February 2022Advertisement***National Convention to elect National Officers to the National Executive Committee (NEC) – 26/02/2022***National Convention Appeal to hear and resolve complaints arising from the National Convention – 28/02/2022Advertisement"
  },
  {
    "headline": "Party supporters troop to APC secretariat as State chairmen inaugurated -",
    "summarized_story": "Party supporters on Thursday trooped to the All Progressives Congress secretariat for the inauguration of the states chairmen.\nThe supporters of the various state’s chairmen across the state made it difficult for members of Caretaker/Extra-ordinary Convention Planning Committee(CECPC) of the All Progressives Congress(APC) as well as the elected chairmen get access to the secretariat.\nAdvertisementHowever, the intervention of security returned normalcy shortly after.\nThe committee members are currently having a close door meeting before commencement of the inauguration"
  },
  {
    "headline": "Najatu Muhammad: My Loyalty is to Nigeria and Not to Buhari",
    "summarized_story": "As Nigeria’s political parties prepare to do battle in the 2023 elections, there are growing concerns over the quality of aspirants that have indicated interest in competing for the Presidency and Governorship positions.\nFor many Nigerians, the current crop of Presidential and Governorship hopefuls – comprising mostly the old guard – do not inspire hope or confidence among the electorate.\nCritics are of view that if the political parties present them as candidates in the next general election, voter turnout could decline to a record low due to voter apathy.\nTo this effect, Najatu Muhammad, a Civil Rights Activist and member of the ruling All Progressives Congress in an interview with ARISE, speaks to the growing concerns of Nigerians, on the need to get the must qualified candidate, and not vote on the must wealthy, but a candidate with a masterplan to effect change."
  },
  {
    "headline": "Money Ritual Suspects Perform Rituals Through Facebook Page – What’s Trending",
    "summarized_story": "Sequel to the death of 17 year old Sofiat: 2 alledged suspects give details of how they carried out the vicious murder.\nAccording to them, they cut off the victims head to satisfy thier get-rich-quick syndrome by engaging in money rituals which they learnt through a Facebook page with over 27,000 followers.\nThree suspected kidnappers operating along the Benin-Auchi expressway were neutralized by security operatives of the Nigerian Army.\nCommuters were held to a standstill on the ever busy road in awe as they witnessed the exchange between the Nigerian Army and armed suspected kidnappers.\nGovernor Sanwo-Olu on an official assignment in Anthony, spotted 2 girls who where on homestead errands during the school period, and pledged to sponsor their education and personal welfare."
  },
  {
    "headline": "Nigerian Senator Okorocha Seeks Buhari’s Intervention in N2.9bn Fraud Case – Arise News",
    "summarized_story": "“The court ordered the EFCC to release my international passport, the EFCC has refused to obey.\nThat’s not the issue; that there’s judgment on the ground.\nThere’s judgment and there’s order of court that I’m asking Mr. President, who appointed the EFCC to recall that there was the law that established the EFCC.\n“And if that law is good to make somebody EFCC, that law should be obeyed, too.\nSo, I’m not asking Mr. President, to speak on matter,” he said."
  },
  {
    "headline": "Nigeria: Shell Defers Expansion Work on 225,000bpd Bonga Oilfield By Two Years",
    "summarized_story": "In a big hindrance to Nigeria’s hope of raising its poor daily oil production, Shell has said it would delay expansion work at its Nigerian offshore Bonga field by another two years.\n“There has been a delay in progressing with the tendering process for the Bonga Southwest field.\nA spokesman for the Shell Petroleum Development Company (SPDC), Nigeria, confirmed that the contract award for the construction of the 150,000 bpd Bonga Southwest FPSO had been put on hold.\n“The Bonga Southwest has been deferred,” he said, declining to offer further details.\nShell had previously said it would develop the Bonga South-west project in three phases, with a total potential yield of 3.2 billion barrels."
  },
  {
    "headline": "WHO: Africa Records 1.1 Million New Cancer Cases, 700,000 Deaths Annually",
    "summarized_story": "The World Health Organisation (WHO) on Thursday said Africa records about 1.1 million new cases of cancer every year resulting in 700,000 deaths.\n“Every year, Africa records around 1.1 million new cases of cancer, resulting in up to 700 000 deaths.\nNational screening programmes are now operational in 72 per cent countries, 11 of which offer high-performance screening.\nNational screening programmes are now operational in 72 per cent countries, 11 of which offer high-performance screening.\nHe disclosed that Senegal was in the process of including childhood cancers in its new National Cancer Control Plan."
  }
]