[
  {
    "headline": "Imo govt accuses PDP of fueling insecurity",
    "summarized_story": "24 hours after the Imo State chapter of the Peoples Democratic Party asked the state governor, Hope Uzodinma, to resign over rising insecurity in the state, the state government had said that the main opposition had indicted itself over the security situation of the state.\nThe state Commissioner for Information and Strategy, Declan Emelumba, said that the statement credited to PDP was a self-indictment on their part.\nEmelumba said that by that utterance, PDP had admitted responsibility for insecurity challenges in the state.\nThe PDP has been on a mission to actualising it evidenced by the organised protests they staged in the early stages of the Uzodimma administration.\nRead Also“The PDP never condemned the attacks on the correctional centre, the burnings of police stations and killings in the state, showing that they condoned the attacks."
  },
  {
    "headline": "BREAKING: Prophet TB Joshua dies at 57",
    "summarized_story": "The pastor of Synagogue Church of All Nations in Lagos, Prophet TB Joshua has died at the age of 57.\nThis was announced in a statement titled, ‘Prophet TB Joshua – June 12th 1963 to June 5th 2021,’ issued on the verified Facebook page of his ministries on Sunday.\n“On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: “Time for everything – time to come here for prayer and time to return home after the service.”“God has taken His servant Prophet TB Joshua home – as it should be by divine will.\n“As Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\n“Prophet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn."
  },
  {
    "headline": "Monarch, kinsman confirm TB Joshua’s death",
    "summarized_story": "Dayo Johnson AkureRenowned Pastor and televangelist, Temitope Balogun Joshua is dead according to the monarch of his home town in Ondo state.\nVanguard confirmed this from the traditional ruler of Arigidi Akoko, in Ondo Oba Yisa Olanipekun.\n” Yes its true l have been informed by his people in Lagos.\nHe described the death of the TB Joshua as a rude shock.\nReports also had it that the chief Imam of Arigidi Akoko, Alhaji Salisu Musa who happens to be T.B Joshua’s uncle has equally confirmed the news of his demiseAlahaji Musa said that his death was too sudden."
  },
  {
    "headline": "TB Joshua’s Death: I’m in pains — Fani-Kayode weeps",
    "summarized_story": "By Idowu BankoleA former aviation minister, Chief Femi Fani-Kayode has expressed shock and sadness over the death of prophet TB JoshuaProphet TB Joshua died shortly after a church programme he led yesterday, He was aged 57.\nThe former aviation minister, Fani-Kayode has described the late televangelist as a God’s general whose death saddens him.\nFani-Kayode who expressed his shock in a tweet stated that he had called one of his daughters who confirmed the story.\nAlso Read: BREAKING: TB Joshua is dead“The passing of my brother TB Joshua saddens me deeply.\nProphet TB Joshua is a renowned televangelist who is known for his fiery prophecies and philanthropic gesture around the world."
  },
  {
    "headline": "BREAKING: TB Joshua is deadBREAKING: TB Joshua is dead",
    "summarized_story": "TB JoshuaMr. Temitope Balogun Joshua, commonly referred to as T. B. Joshua, is dead.\nTB Joshua is the Leader and Founder of The Synagogue Church of All Nations, SCOAN.\nReports by an online medium and a tweet by former Minister of Aviation made additional reports to that effect.\nShe said: “The death occurred when the cleric left ‘the mountain’ to minister to the people, which was televised live on Saturday.”However, she said a few minutes later, TB Joshua left.\nThey were then told “the man of God said he can no longer attend to us.”Probably that was when it happened."
  },
  {
    "headline": "Nigeria’s total trade increases by 6.99% in Q1 – NBS",
    "summarized_story": "It said the 6.99 per cent was an increase over the value recorded in Q4, 2020 and by 14.13 per cent compared to the value recorded in Q1, 2020.\nGiving a breakdown, the NBS said the value of total imports rose by 15.61 per cent in Q1 compared to Q4, 2020 and 54.30 per cent compared to Q1, 2020.\n“The value of raw material imports fell by 6.50 per cent in Q1 compared to Q4, 2020 but increased by 109.29 per cent compared to Q1, 2020.\nIt said the value of agricultural exports increased by 128 per cent in Q1, compared to Q4, 2020 and 0.1 per cent compared to Q1, 2020.\nIt also said the export value of other oil products increased by 25.5. per cent in Q1 compared to Q4, 2020, and rose marginally 0.1 per cent compared to Q1, 2020."
  },
  {
    "headline": "Our plans for South-East, South-South — Wabali, SESSPN Vice President",
    "summarized_story": "By Kennedy MbeleVice President of South-East South-South Professionals of Nigeria, SESSPN, Mr. Andy Wabali, in this interview, explains the association’s determination to make both regions an economic hub irrespective of emerging security challenges.\nEver since the South-East South-South Professionals of Nigeria, SESSPN, came up with Development Agenda 2035, DASESS, nothing has been heard about it.\nIn the light of current security challenges in both regions, is it right for SESSPN to be talking of the development agenda?\nAs the Vice President of SESSPN, to what extent has the group been involved in the search for solutions to the emerging security challenges in the zones?\nI am very optimistic that we will begin to see the multiplier effects of revitalised ports in the South-East and South-South regions."
  },
  {
    "headline": "SCOAN Church confirms TB Joshua’s death, last words",
    "summarized_story": "The Synagogue, Church Of All Nations (SCOAN) has confirmed the last words of its founder, Temitope Balogun Joshua, AKA T.B Joshua.\nConfirming the death on his Facebook page, T.B Joshua’s Ministries said he died on Saturday, June 5th 2021.\n”As Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\nJune 12: Prophet TB Joshua declares fasting, prayer for Nigeria”Prophet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn.”It further revealed that Prophet TB Joshua’s in his last words urged Christians to watch and pray.\n”Here are Prophet TB Joshua’s last words: “Watch and pray.””One life for Christ is all we have; one life for Christ is so dear.”Nigeria’ll not break up – Prophet TB Joshua responds to Kanu, Igboho’s secession calls"
  },
  {
    "headline": "How T.B Joshua prophesied own death",
    "summarized_story": "The Synagogue Church of All Nations (SCOAN) has claimed their late founder, Prophet Temitope Balogun, prophesied his own death.\nFollowing the shock death of the 57-year-old six days to his birthday, SCOAN released a statement via their Facebook page.\nJoshua had earlier in the day participated in a church programme before his shocking death.\nThe cause of his death is not yet official, but his remains have been deposited in the morgue.\nIt then added that: “On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: “Time for everything – time to come here for prayer and time to return home after the service.”“God has taken His servant Prophet TB Joshua home – as it should be by divine will."
  },
  {
    "headline": "T.B Joshua confirmed dead",
    "summarized_story": "A former Aviation Minister, Femi Fani-Kayode has confirmed the death of Temitope Balogun Joshua, founder of The Synagogue, Church Of All Nations (SCOAN).\nBut Fani- Kayode, a friend of the preacher who had earlier said the report of the Prophet’s death was fake news confirmed the death in a follow-up tweet.\nProphet TB Joshua rumoured deadThe Peoples Democratic Party, PDP, Chieftain said TB Joshua’s daughter confirmed the death to him, adding that he is in pain.\nHe wrote, ”The passing of my brother TB Joshua saddens me deeply.\nRest in Peace.”Nigeria’ll not break up – Prophet TB Joshua responds to Kanu, Igboho’s secession calls"
  },
  {
    "headline": "Nigerian economy suffers major setback over Twitter ban",
    "summarized_story": "Following the suspension of the microblogging platform, Twitter by the Federal Government on Friday, experts have revealed that the already ‘dangling’ economy of the Federal Republic of Nigeria will suffer more setbacks.\nA user, Margret Femi who spoke with our correspondent in Abuja, said she used the medium (Twitter) to market her fashion, a petty business she established to make ends meet.\n“Many businesses in the country have been promoted via a social medium like the suspended Twitter.\nSo the importance of the medium to the Nigerian economy cannot be overemphasised considering the numerous benefits it has on individuals.\n“The temporary suspension of Twitter is not just a response to the removal of the President’s post."
  },
  {
    "headline": "Prophet TB Joshua rumoured dead",
    "summarized_story": "Temitope Balogun Joshua, founder of The Synagogue, Church Of All Nations (SCOAN) is rumoured dead.\nThe renowned gospel preacher known globally for his prophecies and healing of the sick as well as casting out of demons is rumoured dead at the age of 57.\n“The story that is being peddled around by some fake news merchants that my dearest friend and brother, Prophet T.B.\nAt the moment, it is not clear if the prophet is dead or alive.\nJune 12: Prophet TB Joshua declares fasting, prayer for Nigeria"
  },
  {
    "headline": "#EndSARS: Three out of 99 corpses were from Lekki Tollgate – Pathologist",
    "summarized_story": "By Robert EgbeLagos State University Teaching Hospital (LASUTH) Chief pathologist, Dr John Obafunwa, on Saturday told the Lagos State Judicial Panel probing police brutality that it received three corpses said to be from the Lekki Tollgate incident of October 20, 2020.\nHe presented the autopsy reports and pictures of three bodies from Lekki to the panel, showing different degrees of injuries.\nBut Obafunwa explained that the bodies were deposited by the Lagos State Environmental Health Monitoring Unit (SEHMU), an agency in charge of recovering dead bodies.\nThe Chief Pathologist said according to their records, the bodies were recovered from different parts of Lagos including Ikorodu, Lagos Mainland, Yaba, Mushin and others.\nGranting his request, Justice Okuwobi ruled that the chief pathologist should produce the records at the next adjourned date."
  },
  {
    "headline": "Father Mbaka holds First Adoration Service Sunday",
    "summarized_story": "By Sunny Nwankwo, AbaThe Spiritual Director of Adoration Ministry Enugu Nigeria (AMEN), Rev.\nFather Ejike Mbaka will on Sunday June 6, celebrate his first Mass at the Emene Adoration Ground after serving out the compulsory 30-day suspension by leadership of Catholic Church, Diocese of Enugu.\nAccording to information, the time for the Mass at the Adoration Ministry Ground will be 10 am.\nThe statement on the official facebook handle of the Adoration Ministry reads: “ADORATION; THE HOLY SPIRIT IS OUR POWER.\n“It shall be a Mass of thanksgiving and blessings tomorrow at our adoration ground (Umuchigbo Iji Nike)."
  },
  {
    "headline": "Baby needs N1.5m for surgery",
    "summarized_story": "By Alao AbiodunA-year-old baby, Adeife Timileyin currently hospitalised, needs N1.5million for surgery.\nUnlike many babies of his age, Timileyin, is having great difficulties, he is battling with a medical condition known as “bilateral hydrocele”.\nThe medical report states that after scanning both scrotal sacs, there is a sort of excessive bilateral hydrocele with dilatation of the left inguinal canal by the fluid.\n“The baby finds it hard to walk and urinate, and always in pain.\nADVERTISEMENTThe account details are as follows; Name — Adeife Timileyin, 2202076218, UBA."
  },
  {
    "headline": "BREAKING: Popular cleric T.B. Joshua dies at 57",
    "summarized_story": "By Robert Egbe and Alao AbiodunThe Synagogue Church of All Nations (SCOAN) has confirmed death of its founder and General Overseer Prophet TB Joshua.\nADVERTISEMENTThe church made the announcement in a post on the TB Joshua Ministries official Facebook handle.\n‘’God has taken His servant Prophet TB Joshua home – as it should be by divine will.\n‘’As Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\n‘’Prophet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn."
  },
  {
    "headline": "Lagos PPP office refreshes for greater impact",
    "summarized_story": "He added that it was also designed to prepare them adequately for greater impact in the discharge of the PPP’s strategic mandate, stressing that the PPP Office is pivotal and very crucial to the accomplishment of the goals of the T.H.E.M.E.S.\nChairman, House Committee on PPP, Lagos State House of Assembly, Hon.\nHe went further to emphasize that it is imperative to review the Lagos State PPP Law (2011) to properly create a more robust and enabling legal and regulatory framework for viable and bankable projects.\nMr. Gbeleyi, who is also a former Lagos State Commissioner for Finance and former Special Adviser to the Governor on PPP, further noted that a well-motivated workforce is imperative to deliver good results on PPP projects.\nHe stated: ‘‘There is a need to go back to the basics, social re-engineering, showcase the resilience in the people of Lagos, about greater Lagos and harness the potentials in the youth."
  },
  {
    "headline": "US, UK, EU, others express disappointment over Nigeria’s ban on Twitter operations",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe United States (US), the United Kingdom (UK), the European Union (EU), the Canadian Government, the Kingdom of Norway and the Republic of Ireland have expressed disappointment over the ban on Twitter operations in Nigeria.\n‘We strongly support the fundamental human right of free expression and access to information as a pillar of democracy in Nigeria as around the world and these rights apply online as well as offline.\nBanning systems of expression is not the answer.\nThe US, UK, EU, the Canadian Government, the Kingdom of Norway and the Republic of Ireland further said the path to a more secured Nigeria lied in more, not less, communication to accompany the concerted efforts of Nigeria’s citizens in fulsome dialogue toward unity, peace and prosperity.\n‘As Nigeria’s partners, we stand ready to assist in achieving these goals,’ the statement added."
  },
  {
    "headline": "I’m old for marriage, but my mind tells me I’m broke –Ahneeka, ex-BBNaija housemate",
    "summarized_story": "I am the host of Jollof TV show produced by Zikel Cosmetics.\nAs much as everyone is telling me how old I am (for marriage), my thought is telling me how broke I am.\nAs much as the government and other people owe you things, don’t bank on that.\nAs a young person, half of what you see on social media is fake.\nIf you are a person of faith, don’t forget that and when you get there, don’t forget that faith too."
  },
  {
    "headline": "Unknown gunmen: Blood flows in Southeast",
    "summarized_story": "The current clampdown on pro-Biafra groups and suspected ‘unknown gunmen’ has practically crippled economic activities and movements in these areas.\nThe deceased eldest brother and spokesperson for the family, Tobechi Chigbu, told our correspondent that the soldiers at Amakohia flyover in Owerri killed his younger brother around 10:p.m on that fateful Friday.\nBattle against gunmen not yielding result in AbiaThe battle against the purported unknown gunmen is yielding little or no fruit in Abia State.\nOn May 29, the state CID building was completely razed by gunmen, who also killed two Inspectors of Police.\nReprieve for 6 wrongly labelled “unknown gunmen”Meanwhile, some six innocent citizens of Imo State who were wrongly arrested and falsely labelled by the State Police Command have been released."
  },
  {
    "headline": "2nd year anniversary: Sanwo-Olu vows to do more for Lagosians",
    "summarized_story": "Lagos State governor, Mr Babajide Sanwo-Olu yesterday thanked all the religious leaders, especially Imams, for their co-operation during the peak of COVID-19 pandemic, saying that their co-operation over the protocols and guidelines helped in the successful management of the pandemic.\nSpeaking at a special Jumaat prayer to commemorate his second anniversary in office, Governor Sanwo-Olu specifically lauded the religious leaders in the state for complying with the all the COVID-19 guidelines.\nHe said that the success recorded by the state wouldn’t have been possible, if the religious leaders had not shown understandings on some of the regulations and policies made when cases were rising in the state.\nHe said that it was disheartening that most husbands have abandoned their wives and children without taking responsibility of them.\nHe said that it was time parent took responsibilities of their children in order to build a peaceful society."
  },
  {
    "headline": "Oduduwa Republic: Igboho storms Ekiti, insists 2023 election won’t hold in S’West",
    "summarized_story": "From Priscilla Ediare, Ado-EkitiAs the agitation for the creation of Oduduwa Republic hots up, Chief Sunday Adeyemo also known as Sunday Igboho, has said that the 2023 election will not hold in states in the Southwest unless the Oduduwa Republic is created.\nHe made the declaration yesterday in Ado-Ekiti, the Ekiti State capital, in continuation of the rally for the creation of Yoruba nation.\nIgboho who arrived Ado-Ekiti metropolis around 5:02p.m was received by thousands of residents and agitators who had gathered for the event since 8:00a.m.\nHe called on all stakeholders across the region to support him and other leaders in achieving it.\nAlso speaking, the media Communication Secretary of Ilana Omo Oodua group, Maxwell Adeleye, said that the rally was aimed at sensitising the people of Ekiti on the need for the creation of Oduduwa nation."
  },
  {
    "headline": "Breaking: T.B. Joshua is Dead",
    "summarized_story": "By Vanessa ObiohaThe founder of Synagogue Church of All Nations (SCOAN), Temitope Balogun Joshua popularly known as T.B.\nJoshua has died.\nThe post read: God has taken His servant Prophet TB Joshua home – as it should be by divine will.\nThis is what he was born for, lived for and died for.”The statement also disclosed that the prophet spoke to partners on Saturday before his death.\n“On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: “Time for everything – time to come here for prayer and time to return home after the service.”His last words according to the church was ‘Watch and Pray’."
  },
  {
    "headline": "Twitter Ban: The World Reacts as Presidency Justifies Suspension",
    "summarized_story": "On the contrary, the All Progressives Congress (APC) has called on Nigerians to defend the country’s sovereignty by supporting the federal government’s Twitter suspension, saying it was in national interest.\nHe said: “The temporary suspension of Twitter is not just a response to the removal of the President’s post.\nThe opposition stated that the APC-led federal government should also realise that the suspension of Twitter, in addition to its unconstitutionality, only suspended Twitter operations and not the use of Twitter by Nigerians.\nTwitter Suspension Is an Overreaction, Says NPANThe Newspaper Proprietors’ Association of Nigeria (NPAN) has condemned the suspension of the operation of microblogging and social networking service, Twitter, in the country, describing it as “wrong and an overreaction”.\nTwitter made the vow in reaction to the indefinite suspension slammed on it by the Nigerian Government."
  },
  {
    "headline": "2023: Why Matawalle May Not Defect to APC for Now",
    "summarized_story": "The state was considered an APC state and it was therefore to ensure his reelection in 2023 that Matawelle was being poached to defect to the APC.\nWill he subdue his ambition that caused his initial political feud with former governor Yari or will he go back to the senate?\nIf he decides to go to the Senate, what will happen to the current senator that is from the PDP?”, the PDP source stated.\nYari, Zamfara’s immediate past governor is plotting to become the national chairman of the APC, and has been at daggers-drawn with Matawalle, who became an unexpected beneficiary of the APC crisis in the 2019 primaries in the state.\n“This is part of the reasons APC is delaying their convocation of the national convention of the APC."
  },
  {
    "headline": "Makinde: I Won’t Comply With S’Court Judgement on Sacked LG Chairs",
    "summarized_story": "The Supreme Court, last month, overturned Makinde’s sack of the council chairpersons in the state.\nThe officials, drawn from the 33 local government areas (LGAs) and 35 local council development areas (LCDAs) and their councillors, were members of the ruling All Progressives Congress (APC).\nBut the court appeared to favour Makinde by noting that the tenures of the sacked council chairmen and councilors had expired.\nSpeaking to THISDAY at the Government House, Ibadan, Makinde said, “The Constitution of Nigeria recognises 33 local government areas and 351 wards in Oyo State.\nThe previous administration created local development areas and increased the number to 68."
  },
  {
    "headline": "Twitter Ban Regressive, Overreaction, Says NPAN",
    "summarized_story": "Olawale Ajimotokan in AbujaThe Newspaper Proprietors’ Association of Nigeria (NPAN) has condemned the suspension of the operation microblogging and social networking service, Twitter, in the country by the Federal Government as “wrong and an overreaction”.\nNPAN made the denunciation Saturday in a statement signed by its President Kabiru A. Yusuf.\nThe statement warned that the action by the federal government after Twitter deleted a tweet by President Muhammadu Buhari to separatist agitators, would not win Nigeria friends.\n“Twitter is a global platform for public communication that has expanded the frontiers of Free Speech and Press Freedom.\nBanning Twitter is regressive and should be rescinded in favour of dialogue.” NPAN warned."
  },
  {
    "headline": "How Popular Nigerian Televangelist TB Joshua Died",
    "summarized_story": "The Founder of the Synagogue Church of All Nations, Temitope Joshua, better known as Prophet TB Joshua, died on the way to the hospital, SaharaReporters has gathered.\nHe died on the way to the hospital,\" a source told Saharareporters.\nTB Joshua's megachurch runs the popular Emmanuel TV television station from Lagos, followed by many Christians worldwide.\nHis YouTube channel, Emmanuel TV, had over 1,000,000 subscribers and was the world's most viewed Christian ministry on the platform before it was suspended.\nTB JOSHUA AT 58: Important Birthday Message!"
  },
  {
    "headline": "How Popular Nigerian Televangelist TB Joshua Died",
    "summarized_story": "The Founder of the Synagogue Church of All Nations, Temitope Joshua, better known as Prophet TB Joshua, died on the way to the hospital, SaharaReporters has gathered.\nHe died on the way to the hospital,\" a source told Saharareporters.\nTB Joshua's megachurch runs the popular Emmanuel TV television station from Lagos, followed by many Christians worldwide.\nHis YouTube channel, Emmanuel TV, had over 1,000,000 subscribers and was the world's most viewed Christian ministry on the platform before it was suspended.\nTB JOSHUA AT 58: Important Birthday Message!"
  },
  {
    "headline": "Popular Nigerian Televangelist Pastor TB Joshua Is Dead",
    "summarized_story": "The Founder of the Synagogue, Church of All Nations, Temitope Joshua, better known as Prophet TB Joshua, is dead.\nJoshua reportedly died on Saturday night in Lagos after concluding a programme at his church.\nThe cause of his death was not immediately disclosed, but sources told Saharareporters he fell ill two days ago.\nTB Joshua's megachurch runs the popular Emmanuel TV television station from Lagos, followed by many Christians worldwide.\nHis YouTube channel, Emmanuel TV, had over 1,000,000 subscribers and was the world's most viewed Christian ministry on the platform before it was suspended."
  },
  {
    "headline": "Popular Nigerian Televangelist Pastor TB Joshua Is Dead",
    "summarized_story": "The Founder of the Synagogue, Church of All Nations, Temitope Joshua, better known as Prophet TB Joshua, is dead.\nJoshua reportedly died on Saturday night in Lagos after concluding a programme at his church.\nThe cause of his death was not immediately disclosed, but sources told Saharareporters he fell ill two days ago.\nTB Joshua's megachurch runs the popular Emmanuel TV television station from Lagos, followed by many Christians worldwide.\nHis YouTube channel, Emmanuel TV, had over 1,000,000 subscribers and was the world's most viewed Christian ministry on the platform before it was suspended."
  },
  {
    "headline": "\"His Last Moments\"—Synagogue Church of All Nations Confirms Death Of Popular Nigerian Televangelist, TB Joshua",
    "summarized_story": "The Synagogue Church of All Nations on Sunday morning confirmed the death of its founder, Temitope Joshua, better known as Prophet TB Joshua.\nSee Also Christianity How Popular Nigerian Televangelist TB Joshua DiedA statement from the church's Facebook page reads, \"PROPHET TB JOSHUA – JUNE 12 1963 to JUNE 5 2021.\n\"God has taken His servant Prophet TB Joshua home – as it should be by divine will.\n\"As Prophet TB Joshua says, 'The greatest way to use life is to spend it on something that will outlive it.'\nProphet TB Joshua leaves a legacy of service and sacrifice to God's Kingdom, living for generations yet unborn."
  },
  {
    "headline": "'Banning not the answer' -- UK, Canada, EU tackle FG over Twitter suspension",
    "summarized_story": "More countries, including the United Kingdom and Canada, have expressed disappointment over the suspension of Twitter’s operations in Nigeria.\nAdvertisementOn Friday, Lai Mohammed, minister of information, announced the indefinite suspension of Twitter in Nigeria.\nIn a joint statement issued on Saturday, Canada, Republic of Ireland, Norway, the European Union and the US expressed disappointment over the federal government’s announcement.\nThe foreign missions in Nigeria said the suspension of Twitter will hinder access to information and hamper businesses.\nAdvertisementThey also noted that the country will be more secure through information sharing, adding that banning systems of expression is not the way to go."
  },
  {
    "headline": "'Banning not the answer' -- UK, Canada, EU tackle FG over Twitter suspension",
    "summarized_story": "More countries, including the United Kingdom and Canada, have expressed disappointment over the suspension of Twitter’s operations in Nigeria.\nAdvertisementOn Friday, Lai Mohammed, minister of information, announced the indefinite suspension of Twitter in Nigeria.\nIn a joint statement issued on Saturday, Canada, Republic of Ireland, Norway, the European Union and the US expressed disappointment over the federal government’s announcement.\nThe foreign missions in Nigeria said the suspension of Twitter will hinder access to information and hamper businesses.\nAdvertisementThey also noted that the country will be more secure through information sharing, adding that banning systems of expression is not the way to go."
  },
  {
    "headline": "Report: Nigeria will lose N2.18bn daily to Twitter suspension",
    "summarized_story": "Nigeria will lose N2.18 billion per day for blocking the operations of Twitter, a micro-blogging and social networking platform, in the country, an estimation by NetBlocks has shown.\nAdvertisementNetBlocks, a data-driven online service, estimated the economic cost of internet disruptions on its cost of shutdown tool (COST) platform.\nAdvertisementOn Saturday morning, network access to the Twitter platform and backend servers were blocked by MTN, Globacom, Airtel, 9mobile, and other networks — the development made Nigerians move to alternative means of accessing the micro-blogging site.\nAccording to the data, if Nigeria shuts down WhatsApp, Facebook, Instagram, YouTube and Twitter, it will lose N10.9 billion daily.\nMeanwhile, the United States mission in Nigeria, as well as other local and foreign organisations have cautioned the federal government on the suspension."
  },
  {
    "headline": "Report: Nigeria will lose N2.18bn daily to Twitter suspension",
    "summarized_story": "Nigeria will lose N2.18 billion per day for blocking the operations of Twitter, a micro-blogging and social networking platform, in the country, an estimation by NetBlocks has shown.\nAdvertisementNetBlocks, a data-driven online service, estimated the economic cost of internet disruptions on its cost of shutdown tool (COST) platform.\nAdvertisementOn Saturday morning, network access to the Twitter platform and backend servers were blocked by MTN, Globacom, Airtel, 9mobile, and other networks — the development made Nigerians move to alternative means of accessing the micro-blogging site.\nAccording to the data, if Nigeria shuts down WhatsApp, Facebook, Instagram, YouTube and Twitter, it will lose N10.9 billion daily.\nMeanwhile, the United States mission in Nigeria, as well as other local and foreign organisations have cautioned the federal government on the suspension."
  },
  {
    "headline": "Twitter deletes Nnamdi Kanu's post for 'violating rules'",
    "summarized_story": "A post on Twitter by Nnamdu Kanu, leader of the proscribed Indigenous People of Biafra (IPOB), has been deleted by the social networking service.\nAdvertisementThe post, which was made on Kanu’s Twitter handle on June 2, was no longer available as of Saturday evening.\nIn the post, Kanu had threatened government officials and said “any army they send to #Biafraland will die there.\nAdvertisementThe deletion of the tweet came hours after the federal government suspended the operations of Twitter in Nigeria.\nThe federal government’s suspension also came days after Twitter deleted a post by President Muhammadu Buhari on the Civil War experience."
  },
  {
    "headline": "Twitter ban rewinds Nigeria to pre-internet darkness and reign of fear",
    "summarized_story": "An infamous banAs of the morning of Saturday June 5, most people living in Nigeria could no longer access Twitter.\nSome users say they still have access from some internet service providers, but VPNs have become the primary medium to stay on Twitter for most people.\nALTON confirms telcos have shut down Twitter in NigeriaBut of course the whole responsibility for Nigeria’s Twitter darkness lies at the top.\nBasically, any media and communication service that uses data provided by internet service providers.\nBy suspending Twitter, Nigeria has stepped into the internet control realm currently championed by China, Iran and India, a fellow country under democracy."
  },
  {
    "headline": "Twitter is ‘deeply concerned’ by Nigerian government’s suspension",
    "summarized_story": "Twitter has reacted to the indefinite suspension of the social media site by the Nigerian government, expressing concern.\nA statement by a Twitter spokesperson to TechCabal said:“The announcement made by the Nigerian Government that they have suspended Twitter’s operations in Nigeria is deeply concerning.\nIt started when Twitter deleted a tweet by President Muhammadu Buhari for violating its rules.\nIt remains to be seen when the suspension takes effect and what actions Twitter takes.\nUpdate: Twitter has now been shutdown in Nigeria."
  },
  {
    "headline": "Nigeria suspends Twitter indefinitely",
    "summarized_story": "The Federal Government has indefinitely suspended the operations of Twitter in Nigeria.\nIt was widely criticised as summoning the ghosts of the Nigeria civil war, a deadly three-year combat between the Nigerian government and a government in southeast Nigeria, which had seceded from the republic.\nImplications of the Twitter BanThe indefinite suspension of Twitter would mean that Internet Service Providers (ISP) in Nigeria like MTN and Airtel will be mandated to not give users access to Twitter.\nThe ISPs will block twitter’s IP addresses from all its users, or delete the sites from their DNS servers.\nIt remains to be seen whether the ISPs will implement such an order and how they will communicate it to their users."
  },
  {
    "headline": "5 Reasons Why You Should Consider A Loan from Page Financials",
    "summarized_story": "If you are still thinking about whether or not to consider a personal loan, we have highlighted 5 reasons why customers usually resort to getting a personal loan.\nDebt ConsolidationOne of the popular reasons to get a personal loan from Page is for debt consolidation.\nWhat To Consider When Considering A Personal LoanApplying for a Page Loan is super easy, everything happens online and you don’t need to visit their office.\nConsider avoiding a personal loan if:You can’t afford it.\nIf you can’t afford monthly payments for your new personal loan, consider skipping it."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "4 ways Nigeria’s Twitter ban could affect businesses",
    "summarized_story": "He also disclosed the government’s directive to the National Broadcasting Commission (NBC) to start licensing all over-the-top (OTT) and social media operations.\nThe Twitter ban could also affect the country’s economy.\nThese are all activities that a social media ban would hinder.\n— Mazi Juls (@AAjulibe) June 5, 2021While these businesses would find ways to innovate around the ban, their users may not.\nThere are no assurances that a ban on other social media platforms would not follow."
  },
  {
    "headline": "Nigerian government suspends access to Twitter indefinitely, Facebook, others could be next",
    "summarized_story": "The Nigerian Federal Government has announced that it will be indefinitely blocking access to microblogging and social media platform, Twitter, in Nigeria.\nOn Friday, June 4, 2021, Nigeria’s Federal Ministry of Information and Culture made this move known on its Twitter and Facebook handles.\nOver the years, Twitter has become an important social media platform for Nigerians.\nNigeria’s latest suspension means that it could order telecom companies to block access to Twitter if this move is not fought against.\nAdvertisementHowever, all signs point to the fact that the Social Media Bill could be very much alive."
  },
  {
    "headline": "Using WhatsApp On Multiple Devices, Building Africa's Tesla, Twitter Activates Subscription Service • Techpoint Africa",
    "summarized_story": "Today, I’m discussing:WhatsApp’s multi-device supportBuilding Africa’s TeslaTwitter launching Twitter BlueOne WhatsApp account, multiple devicesInstant messaging app, WhatsApp, will soon allow users to simultaneously open one account across several devices.\nWhen are these features coming?\nThough there is no launch date for these features, Zuckerberg hints at some time within the next two months.\nAdvertisementTwitter launches premium subscription serviceTwitter launched its premium subscription service, Twitter Blue, on June 3, 2021.\nWhile Twitter didn’t mention a cost, my story about the coming of Twitter Blue might give you an idea."
  },
  {
    "headline": "No plan to retrench, sack workers in Edo, Obaseki reassures – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has asserted that there are no plans to either sack or retrench workers in the state, noting that ongoing reforms in the state’s civil and public service are aimed at improving productivity and service delivery to Edo people.\n“We are not going to retrench workers or sack anyone, but you must follow the new trends and conform to the new rules and if you can’t cope, you should move out from the service yourself.\nAnyone who flaunts the rule will get an automatic query and after three queries such a person leaves the system.\nAs the governor of the state, no file stays in my office beyond 48 hours,” Obaseki noted.\nOn his part, Edo State Head of Service and Chairman, Transition Committee Chairman, Barr."
  },
  {
    "headline": "We’ll enact laws to improve economy – Obaseki – Nigerian Observer",
    "summarized_story": "Godwin Obaseki of Edo has expressed his administration’s readiness to enact laws and strengthen existing ones to improve the state’s economy.\nObaseki said this while addressing participants at the Edo State Transition Committee’s engagement with artisans on Friday in Benin.\nObaseki assured the artisans that his administration was open and accountable to the people of the state including tax payers.\nHe said his government had been working to eliminate cash payment for tax across the state to minimise corruption.\n“We are simplifying the tax system in the state to encourage more people to key into the tax system."
  },
  {
    "headline": "FG suspends Twitter’s operations in Nigeria – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAbuja – The Federal Government has suspended indefinitely, the operations of the microblogging and social networking service, Twitter in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed, announced the suspension in a statement in Abuja on Friday.\nThe minister cited the persistent use of the platform for activities capable of undermining Nigeria’s corporate existence.\nHe said the Federal Government had also directed the National Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in the country.\nThe statement was released by Mr Segun Adeyemi, Special Assistant to the President (Media), office of the Minister."
  },
  {
    "headline": "World Environment Day: Obaseki reiterates commitment to restoring forest reserves – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has reiterated his administration’s commitment to collaborate with environmentalists, community leaders and other stakeholders to restore forest reserves in the state.\nObaseki made the call in commemoration of the World Environment Day, marked on June 5 each year, by the United Nations and its partners.\nGlobal greenhouse gas emissions have grown for three consecutive years and the planet is one pace for potentially catastrophic climate change.\n“The emergence of COVID-19 has also shown just how disastrous the consequences of ecosystem loss can be.\nBy shrinking the area of natural habitat for animals, we have created ideal conditions for pathogens – including coronaviruses – to spread.”..."
  },
  {
    "headline": "#EndSARS: 99 bodies deposited at Lagos morgue, three from Lekki tollgate – Pathologist",
    "summarized_story": "At least 99 people were killed in Lagos during the #EndSARS protest and had their bodies deposited at a morgue in the state, an official has said.\nHe said autopsies were done on the 99 dead bodies which were brought to the morgues between October 19 and 24, 2020.\nHe presented the pictures of three bodies from Lekki to the panel, showing different degrees of injuries.\nMr Obafunwa explained that the bodies were deposited by the Lagos State Environmental Health Monitoring Unit (SEHMU), an agency in charge of recovering dead bodies.\n“I don’t go about scavenging for dead bodies."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Prophet T.B. Joshua dies, aged 57",
    "summarized_story": "OBINNA EZUGWUProphet Temitope Balogun Joshua, founder of the Synagogue Church of All Nations, is dead, aged 57.\n“On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: “Time for everything – time to come here for prayer and time to return home after the service.\n“God has taken His servant Prophet TB Joshua home – as it should be by divine will.\n“As Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\n“Prophet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn.”"
  },
  {
    "headline": "Twitter ban: US, UK, EU, Canada, Norway, Ireland others knock Buhari",
    "summarized_story": "The United States (US), the United Kingdom (UK), the European Union (EU), the Canada, Republic of Ireland and Norway have expressed disappointment over the decision of Nigerian government to ban Twitter operations in the country.\nRecall that the President Muhammadu Buhari led government, through the Ministry of Information, had on Friday, slammed an indefinite suspension on Twitter after the platform yanked off a tweet by the president making reference to the civil war.\nAmid the outrage, however, the presidency on Saturday said the ban was temporary.\n“Banning systems of expression is not the answer.\n“As Nigeria’s partners, we stand ready to assist in achieving these goals,” they said."
  },
  {
    "headline": "Presidency justifies ‘Temporary suspension’ of Twitter, says it’s to limit violent consequences of fake news",
    "summarized_story": "The presidency has justified what it called a temporary suspension of Twitter’s operations in Nigeria, noting that it is part of efforts to prevent the violent consequences usually linked to the spread of fake news and misinformation.\nLai Mohammed, minister of information, had announced the “indefinite” suspension of Twitter’s operations in Nigeria on Friday, sparking angry reactions.\nHowever, in a statement on Saturday, Garba Shehu, presidential spokesman, said the suspension of Twitter in Nigeria is not only because Buhari’s post was deleted, even as he hinted that the ban was temporary.\n“The temporary suspension of Twitter is not just a response to the removal of the President’s post.\nThere has been a litany of problems with the social media platform in Nigeria, where misinformation and fake news spread through it have had real world violent consequences."
  },
  {
    "headline": "Ikire/Apomu robbery: Oyebamiji, visits damaged police station, donates half a million for it’s renovation",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun Commissioner For Finance, Mr Bola Oyebamiji on Friday, paid a condolence/inspection visit to the Ayedaade Divisional Police Headquarters, Ikire, which was attacked by dare devil armed robbers last Wednesday.\nOyebamiji who was accompanied on the visit by his wife, Chief Dr Mrs Shekinat Oyebamiji and some chieftains of the All Progressives Congress (APC) in Ayedaade/Irewole/Isokan Federal Constituency, donated the sum N500,000 for immediate renovation of the police station.\nOyebamiji who also paid a condolence visit to the families of civilians whose lives were cut short during the attack, described the robbery attack and the gruesome murder of innocent citizens as barbaric.\n“This sight is shocking and very sad to behold, I can’t imagine why people will be so cruel to attack unsuspecting police officers at the police station.\nIt’s a sad day indeed for residents of Ikire and Apomu, the entire federal constituency is in a mourning mood,” he said."
  },
  {
    "headline": "TB Joshua’s Last Moments, By Church",
    "summarized_story": "The Synagogue Church Of All Nations (SCOAN) has formally confirmed the death of its founder and televangelist, Prophet Temitope Balogun Joshua, popularly known as TB Joshua.\nA former Minister and a friend of TB Joshua later confided in our reporter that the latter was briefly indisposed before he eventually passed on.\n“As Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\n“Prophet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn.\nIt added that the late Prophet TB Joshua’s last words were “Watch and pray.”"
  },
  {
    "headline": "TB Joshua’s Last Moments, By Church",
    "summarized_story": "The Synagogue Church Of All Nations (SCOAN) has formally confirmed the death of its founder and televangelist, Prophet Temitope Balogun Joshua, popularly known as TB Joshua.\nA former Minister and a friend of TB Joshua later confided in our reporter that the latter was briefly indisposed before he eventually passed on.\n“As Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\n“Prophet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn.\nIt added that the late Prophet TB Joshua’s last words were “Watch and pray.”"
  },
  {
    "headline": "India, UK Move To Combat Climate Change By 2030",
    "summarized_story": "India and the United Kingdom (UK) have agreed on a joint roadmap including plans to combat climate change by 2030.\nIt includes new collaboration on clean energy transition and protecting forests, and joint leadership to develop resilient infrastructure in climate vulnerable countries.\nThe roadmap will support global efforts to limit global temperature rises and achieve an ambitious outcome at COP26.\nADVERTISEMENTIt also mentioned positioning the UK and India as global leaders on biodiversity through strengthening collaboration to protect and restore nature, including through a new joint partnership on forests.\nIt added a new phase of collaboration on the India Energy Security Scenarios Calculator initiative, to support climate policy and planning."
  },
  {
    "headline": "India, UK Move To Combat Climate Change By 2030",
    "summarized_story": "India and the United Kingdom (UK) have agreed on a joint roadmap including plans to combat climate change by 2030.\nIt includes new collaboration on clean energy transition and protecting forests, and joint leadership to develop resilient infrastructure in climate vulnerable countries.\nThe roadmap will support global efforts to limit global temperature rises and achieve an ambitious outcome at COP26.\nADVERTISEMENTIt also mentioned positioning the UK and India as global leaders on biodiversity through strengthening collaboration to protect and restore nature, including through a new joint partnership on forests.\nIt added a new phase of collaboration on the India Energy Security Scenarios Calculator initiative, to support climate policy and planning."
  },
  {
    "headline": "What Can Parliament Do About Nigeria’s Security Conundrum?",
    "summarized_story": "The disturbing security situation in Nigeria was presented to the ECOWAS Parliament on Thursday by the Nigerian Delegation to the regional parliament led by Linda Chuba Ikpeazu, while delivering Nigeria’s Country Report.\nThe Delegation presented the horrible security situation of the country to the regional legislature and the attendant devastations on the country at the ongoing 2021 First Ordinary Session of the ECOWAS Parliament, taking place in Abuja.\nThe nine-page report was replete with political, security, human rights, health situations and the status of implementation of the ECOWAS texts.\nBut in specific terms, what would the regional parliament and other institutions of ECOWAS do to forestall the Nigerian grim situation?\nBut how far can resolutions go in resolving the Nigerian security crisis when there has been a plethora of previous resolutions that may not have been implemented?"
  },
  {
    "headline": "BREAKING: Prophet T.B. Joshua is dead, Church says",
    "summarized_story": "The Synagogue Church Of All Nations (SCOAN) has issued the statement below to confirm the passage of its founder, the popular Prophet T.B.\nPROPHET TB JOSHUA – JUNE 12th 1963 to JUNE 5th 2021“Surely the Sovereign LORD does nothing without revealing his plan to his servants the prophets.” – Amos 3:7On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: “Time for everything – time to come here for prayer and time to return home after the service.”God has taken His servant Prophet TB Joshua home – as it should be by divine will.\nAs Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\nProphet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn.\nHere are Prophet TB Joshua’s last words: “Watch and pray.”One life for Christ is all we have; one life for Christ is so dear."
  },
  {
    "headline": "Twitter Row: UK, EU, others call for dialogue — Daily Times Nigeria",
    "summarized_story": "Governments of the United Kingdom (UK), Canada, Republic of Ireland, Norway and those of the European Union (EU) have called for dialogue in resolving the Nigeria-Twitter faceoff.\nThe countries made the call in a joint statement made available to journalists on Saturday in Abuja.\nThese measures inhibit access to information and commerce at precisely the moment when Nigeria needs to foster inclusive dialogue and expression of opinions,” they said.\nThe News Agency of Nigeria (NAN) reports that the Federal Government suspended indefinitely the operations of the microblogging and social networking service, Twitter, in Nigeria.\n“The mission of Twitter in Nigeria is very, very suspect,” the Minister said."
  },
  {
    "headline": "PDP satires Malami, Buhari govt for ordering arrest of Nigerians still using Twitter",
    "summarized_story": "The Peoples Democratic Party, PDP, has declared Attorney-General of the Federation, AGF, and Minister of Justice, Abubakar Malami’s order to arrest and prosecute Nigerians using Twitter as illegal, null and void.\nBut the PDP said that nothing in the country’s extant laws, “not even the suspension of @Twitter in Nigeria, constitutionally criminalized the use of Twitter by Nigerians or empowers the Federal Governments to arrest and prosecute any Nigerians for using @Twitter.\n“Moreover, they should also realize that the suspension of @Twitter by the @OfficialAPCNg Federal Government, in addition to its unconstitutionality, only suspended @Twitter operations and not the use of @Twitter by Nigerians.\nPDP described the AGF’s directive to arrest and prosecute those using the social media platform as an attempt to suspend the 1999 Constitution.\nTwitter was suspended in Nigeria on Friday after the social media platform deleted President Buhari’s tweet a few days earlier."
  },
  {
    "headline": "Just In: US kicks against ban on Twitter by Buhari govt",
    "summarized_story": "The United State Government has kicked against President Muhammadu Buhari government’s decision to ban Twitter in the country.\nThe US condemned the ban and described it as a poor message to citizens and investors.\nThe US Mission in Nigeria in a statement on Saturday said the Nigerian constitution provides for freedom of information.\nIn a statement, the US Mission said, “Nigeria’s Constitution provides for freedom of Information.\n“Banning social media and curbing every citizen’s ability to seek, receive, and impart information undermines fundamental freedom."
  },
  {
    "headline": "Prophet T.B. Joshua is dead + Full statement from church",
    "summarized_story": "The Synagogue Church Of All Nations (SCOAN) has issued the statement below to confirm the passage of its founder, the popular Prophet T.B.\nREAD THE FULL STATEMENT BELOW.\nPROPHET TB JOSHUA – JUNE 12th 1963 to JUNE 5th 2021“Surely the Sovereign LORD does nothing without revealing his plan to his servants the prophets.” – Amos 3:7On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: “Time for everything – time to come here for prayer and time to return home after the service.”God has taken His servant Prophet TB Joshua home – as it should be by divine will.\nAs Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\nProphet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn."
  },
  {
    "headline": "Prophet T.B. Joshua is dead + Full statement from church",
    "summarized_story": "The Synagogue Church Of All Nations (SCOAN) has issued the statement below to confirm the passage of its founder, the popular Prophet T.B.\nREAD THE FULL STATEMENT BELOW.\nPROPHET TB JOSHUA – JUNE 12th 1963 to JUNE 5th 2021“Surely the Sovereign LORD does nothing without revealing his plan to his servants the prophets.” – Amos 3:7On Saturday 5th June 2021, Prophet TB Joshua spoke during the Emmanuel TV Partners Meeting: “Time for everything – time to come here for prayer and time to return home after the service.”God has taken His servant Prophet TB Joshua home – as it should be by divine will.\nAs Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\nProphet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn."
  },
  {
    "headline": "Twitter Suspension: Malami’s prosecution order is illegal – PDP",
    "summarized_story": "The People’s Democratic Party has faulted the order by the Attorney-General of the Federation/Minister of Justice, Abubakar Malami, to arrest Nigerian Twitter users.\nMalami had earlier instructed the Director of Public Prosecution of the Federation to begin immediate prosecution of those who violate the Federal Government’s order suspending Twitter operations in Nigeria.\nThe PDP, in a statement on Saturday, described the decision as null and void.\nThe statement, which was titled ‘Twitter Suspension: Malami’s prosecution order is illegal, null and void – PDP’, was signed by the party’s Publicity Secretary, Kola Ologbondiyan.\n“The PDP states that nothing in our extant laws, not even the suspension of Twitter in Nigeria, constitutionally criminalises the use of Twitter by Nigerians or empowers the Federal Government to arrest and prosecute any Nigerian for using Twitter.”The PDP also asserted that the order had no legal backing."
  },
  {
    "headline": "IPOB: Twitter deletes Nnamdi Kanu’s ‘Biafra’ post for violating rules",
    "summarized_story": "Social media giant Twitter has wielded its big stick on the leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu, as the microblogging platform deleted a ‘Biafra’ post by the self-acclaimed IPOB leader for violating its rules.\nTwitter had come under fire for deleting a civil war post by the Nigerian President, Major General Muhammadu Buhari (retd.).\n“Many of those misbehaving today are too young to be aware of the destruction and loss of lives that occurred during the Nigerian Civil War.\nThe President’s tweet rattled some persons who felt he was insensitive to have made an analogy of the civil war.\nHis critics subsequently reported the tweet to Twitter and the microblogging site later deleted the post with a comment, “This Tweet violated the Twitter Rules”."
  },
  {
    "headline": "Updated: Prophet T.B. Joshua is dead",
    "summarized_story": "The statement titled, “PROPHET TB JOSHUA – JUNE 12th 1963 to JUNE 5th 2021” said the televangelist died after meeting with his church’s TV partners.\nAs Prophet TB Joshua says, “The greatest way to use life is to spend it on something that will outlive it”.\nProphet TB Joshua leaves a legacy of service and sacrifice to God’s Kingdom that is living for generations yet unborn.\nHere are Prophet TB Joshua’s last words: “Watch and pray.\nHappy Birthday!” – TB Joshua"
  },
  {
    "headline": "Breaking: Prophet TB Joshua alive or dead?",
    "summarized_story": "Joshua alive or dead?\n“The story that is being peddled around by some fake news merchants that my dearest friend and brother, Prophet T.B.\nOn 3 June in a Facebook post on his TB Joshua Ministries account, he told his followers he would not be able to mark his 58th birthday.\nHappy Birthday!” – TB JoshuaUpdated: Prophet T.B.\nJoshua is dead"
  },
  {
    "headline": "Nigeria overwhelmed by crises – Obasanjo",
    "summarized_story": "Former President, Chief Olusegun Obasanjo says the crises rocking the nation seemed to have overwhelmed her, saying Nigerians must call on God to salvage the situation.\nObasanjo spoke Saturday in Abeokuta, Ogun State, during the 16th edition of Prayer Breakfast organised in his honour by the Christian Association of Nigeria (CAN), Ogun State chapter.\nAccording to him, Nigerians seemed to have been overwhelmed with the crises in our land.\nHe said the crises were beyond what the people could handle, saying that Nigeria needed to be healed.\nAccording to Obasanjo, God could not be overwhelmed."
  },
  {
    "headline": "REVEALED: How Prophet T.B Joshua Died On His Way To Hospital",
    "summarized_story": "According to NEWS DIRECT, the Founder of the Synagogue Church of All Nations, Temitope Joshua, also known as Prophet TB Joshua, died on his way to the hospital.\nOn his way to the hospital, he passed away “NEWS DIRECT was told by a source.\nHis 58th birthday, which is six days away, was being planned.\nAlthough the cause of his death was not immediately revealed, insiders told NEWS DIRECT that he had been sick for two days.\nHis body is thought to have been deposited in the Lagos General Hospital in Isolo."
  },
  {
    "headline": "10 Things About The Life Of Late Prophet T.B Joshua",
    "summarized_story": "It’s a sad day in Nigeria since the country has recently lost T.B Joshua, a charismatic Nigerian pastor, televangelist, and philanthropist.\nT.B Joshua was the founder and leader of The Synagogue, Church of All Nations, a Christian megachurch that operates the Emmanuel TV television station from Lagos throughout his lifetime.\nIn this post, NewsDirect looks at the ten important things about his life before he passed away.\nEvelyn Joshua, his wife, is his life partner.\nAccording to a Forbes blogger, TB Joshua has spent around $20 million on charitable efforts."
  },
  {
    "headline": "“I’m Deeply Saddened” – Femi Fani-Kayode Confirms TB Joshua’s Death",
    "summarized_story": "T.B Joshua, a popular preacher, has died, according to Femi Fani-Kayode, an ex-aviation minister.\nJoshua’s death came as a shock to many, according to NEWS DIRECT, and his remains have already been put in a mortuary.\n“The passing of my brother TB Joshua saddens me deeply.\nAt 3.00am this morning I was told by one of his daughters that this was fake news & I tweeted as much.”“Sadly I was misled.\n@GazetteNGR was right & I am in pain.”The cause of death is currently unknown but an autopsy has since been scheduled."
  },
  {
    "headline": "Nigerians React As Prophet T.B. Joshua Dies At 57",
    "summarized_story": "Nigerians have taken to social media to react as founder of The Synagogue, Church of All Nations, T.B.\n@DrOlufunmilayo wrote: “TB Joshua was someone who actually touched the lives of many poor people.\n”It’s so sad to read TB Joshua is dead.\nHe was only 57.”@Officialregha wrote: “TB Joshua has helped communities, sponsored education, and provided free health care facilities more than the Nigeria Government has done for its citizens.”@crazy_munach wrote: “He knew he was going to leave before his birthday.\nHe wished himself happy birthday and said this words… keep resting TB JOSHUA.”@BenopaOnxy1 wrote: “TB Joshua said he wouldn’t be celebrating his birthday days agoIt’s like he might’ve seen something coming.”"
  },
  {
    "headline": "Breaking: FG suspends Twitter indefinitely in Nigeria",
    "summarized_story": "The Federal Government has suspended, indefinitely, the operations ofthe microblogging and social networking service, Twitter, in Nigeria.\nThe Minister of Information and Culture, Alhaji Lai Mohammed,announced the suspension in a statement issued in Abuja on Friday, citing the persistent use of the platform for activities that are capable of undermining Nigeria’s corporate existence.\nThe Minister said the Federal Government has also directed theNational Broadcasting Commission (NBC) to immediately commence the process of licensing all OTT and social media operations in Nigeria.\nDetails loading…"
  },
  {
    "headline": "Arms proliferation: Nigerians alarmed as insecurity heightens",
    "summarized_story": "The Chief of Defence Staff (CDS), Gen. Lucky Irabor, recently decried the proliferation of illegal arms in Nigeria, saying it was a threat to the country’s corporate existence.\nA security expert, Dr. Don Belema, in his view, blamed it on the lack of harmonious relationships among security agencies in arms proliferation and poor border management.\nWe need to look at it and see how to move regulations that could control small arms in the country.\n“There is a committee of federal government bodies that are in charge of small arms proliferation and prevention.\n“They should work and share intelligence not only with relevant national security agencies, but also neighbouring countries and regional organs like ECOWAS."
  },
  {
    "headline": "Breaking: Tuchel strikes fresh Chelsea deal",
    "summarized_story": "Chelsea manager Thomas Tuchel has signed a contract extension until the summer of 2024.\nTuchel, 47, signed an initial 18-month deal when he replaced Frank Lampard as Blues boss in January.\nHe led the club to victory in the Champions League final and a fourth-placed finish in the Premier League.\nChelsea were ninth in the Premier League and without a win in five games when Tuchel was appointed at the start of the year.\nThe London club also reached the FA Cup final, where they were beaten 1-0 by Leicester at Wembley."
  },
  {
    "headline": "Digital Economy: IT, Key To The Future, Says Westgate Boss -NigPilot",
    "summarized_story": "Despite the economic downturn occasioned by the COVID-19 outbreak and against the backdrop of the emerging digital economy, the information technology sector remains the key to the future.\nThis was disclosed by the managing director of Westgate Technologies, Mrs Ijeoma Ezeudu, on Thursday during the opening of a Westgate retail store in Abuja.\n“We’ve have been in this Abuja for the past 10 years but as a company, Westgate has been in existence for the past 16 years, we have that vision to take IT to the highest level.\nSo, despite the pandemic, it is quite challenging but we have to keep pushing,” she said.\nOn the impact of the COVID-19 pandemic on the company, Ezeudu said: “We can’t really quantify but all we know is all the SMEs have been affected."
  },
  {
    "headline": "Nigeria now has capacity to produce SIM cards, smartphones for Africa – Pantami -NigPilot",
    "summarized_story": "Nigeria has developed capacity to produce SIM cards and smartphones not only for the use of Nigerians alone but for the entire continent of Africa, Minister of Communications and Digital Economy, Ali Isa Pantami, has disclosed.\nSpeaking at the event organized by a support group known as APC Professionals Forum, Pantami said Nigeria has capacity to produce a minimum of 200 million SIMS annually.\n“When this administration came on board, even SIM cards were imported to Nigeria but as it is today, the federal government has provided an enabling environment for the private sector and as it is today, we have the capacity to produce SIM cards not only for our consumption but for the entire African continent.\n“We have the capacity to produce a minimum of 200 million SIMS annually.\nToday in Nigeria, we are producing smartphones.”"
  },
  {
    "headline": "Improve on Attahiru’s legacy, CNS tasks COAS -NigPilot",
    "summarized_story": "Chief of the Naval Staff (CNS), Vice Admiral Awwal Gambo has charged the newly appointed Chief of Army Staff (COAS), Major General Farouk Yahaya to improve on the legacy of his predecessor, late Lt. Gen. Ibrahim Attahiru.\nVice Admiral Gambo gave this charge when the new Chief of Army Staff (COAS) , Major General Faruk Yahaya paid him a courtesy visit at the Naval Headquarters.\nYou should equally pick up from where the late COAS, Lieutenant General Ibrahim Attahiru left from and improve upon those ideas”.\nEarlier, the Chief of Army Staff, Major General Faruk Yahaya said he was in the Naval Headquarters to formally inform the CNS that he had reported and taken over duty following his appointment as the 22nd COAS.\nMajor General Yahaya promised to ensure cooperation with other security agencies and stakeholders as the challenges confronting the security agencies are multi-faceted and would require a multi-faceted approach."
  },
  {
    "headline": "Accurate data for Persons with Disabilities ready soon- Lalu",
    "summarized_story": "The Executive Secretary Ncpwd Mr. James Lalu has pledged his support to the National Population Commission to ensure that disability data is not taken for laxity.\nIn his welcoming address the Executive Secretary National Commission for Persons with Disabilities Mr. James Lalu thanked the Coalition for putting together such initiatives.\nHowever, at the Global Disability Summit, disability data was on the front burner and so he will ensure that accurate data of persons with Disabilities in the upcoming 2022 Census are taken seriously.\nDr. Irene also urged the disability community to take ownership of the project and drive it to success.\nThe Executive Director of DINABI, Olajide Funso who spoke on Disability Data/Statistics in Nigeria according to him, unreliable, non-disaggregated, estimation-based and completely under-represented the disability community."
  },
  {
    "headline": "FG Didn’t ‘Temporarily’ Ban Twitter Just For Deleting Buhari’s Tweets – Presidency",
    "summarized_story": "The Presidency on Saturday said its decision to “temporarily” ban Twitter wasn’t a “knee-jerk reaction” to the social media network’s deletion of President Muhammadu Buhari’s tweets.\n“There has been a litany of problems with the social media platform in Nigeria, where misinformation and fake news spread through it have had real world violent consequences.\nThis could tear some countries apart.”The Federal Government announced an “indefinite suspension” of Twitter operations in Nigeria on Friday.\nThe decision to suspend Twitter has been criticised by many, but the Presidency in its Saturday statement insisted it was a justified move“.\n“Twitter does not seem to appreciate the national trauma of our country’s civil war."
  },
  {
    "headline": "Top Diplomatic Missions ‘Disappointed’ With FG’s Twitter Ban",
    "summarized_story": "Prominent diplomatic missions to Nigeria, including Canada, the US, the UK and the EU, on Saturday said they were let down by the decision to suspend Twitter operations in Nigeria.\nThe Federal Government suspended the social network’s operations on Friday after Twitter deleted tweets from the official account of President Muhammadu Buhari.\nThe tweets, which Twitter said ran afoul of its policies, had referenced the country’s infamous civil war.\n“The path to a more secure Nigeria lies in more, not less, communication to accompany the concerted efforts of Nigeria’s citizens in fulsome dialogue toward unity, peace and prosperity.\n“Banning social media and curbing every citizen’s ability to seek, receive, and impart information undermines fundamental freedoms."
  },
  {
    "headline": "#TwitterBan: Malami Orders Prosecution Of Offenders",
    "summarized_story": "Attorney General of the Federation and Minister of Justice, Abubakar Malami has directed the immediate prosecution of offenders of the Federal Government’s ban on Twitter operations in Nigeria.\nThis was announced in a statement issued by the Office of the Attorney General of the Federation and Minister of Justice on Saturday.\nSpokesperson of the Ministry, Umar Jibrilu Gwandu said the AGF has directed DPPF to swing into immediate action and commence prosecution of the violators of the ban.\n“Malami directed the DPPF to liase with the Ministry of Communication and Digital Economy, National Communication Communication (NCC) and other relevant government agencies to ensure the speedy prosecution of offenders without any further delay,” the statement read in part.\nThe Federal Government of Nigeria on Friday announced the indefinite suspension of Twitter in the country."
  },
  {
    "headline": "At Least 66 Killed In Kebbi After Gunmen Attacks",
    "summarized_story": "At least 66 people are said to have been killed in attacks launched by gunmen on several communities in Danko-Wasagu local government area of Kebbi State.\nKebbi is in the northwest where bandits have been active in recent times.\nMeanwhile, bandits have attacked communities in Igabi and Chikun Local Government Areas of Kaduna State killing five persons and leaving two others injured.\nA church building belonging to the Assemblies of God church and one house was burnt by the attackers during the operation.\nGovernor Nasir El-Rufai in reaction condoled families of the deceased and prayed that God grants them eternal rest."
  },
  {
    "headline": "#EndSARS: Autopsy Conducted On 99 bodies, Three From Lekki Toll Gate – Pathologist",
    "summarized_story": "The pathologist, who was involved in coroner services through the office of the Chief Medical Examiner of Lagos State, said the 99 bodies were picked up from different locations by officers of the Lagos State Environmental Health Monitoring Unit, LASEHMU.\nOf these 99 bodies, the pathologist said that only three were identified as victims of the Lekki shootings.\n“X-ray conducted prior to touching the body showed no bullet or pellets in the body,” the witness said.\nCounsel to the Lagos State Government, Olukayode Enitan objected to the granting of the application.\nThe panel then ordered the pathologist, Prof Obafunwa to produce the records and autopsy reports of the remaining 96 bodies."
  },
  {
    "headline": "Develop alternative, competitive social media applications, APC challenges talented Nigerians",
    "summarized_story": "The All Progressives Congress (APC) has urged Nigerians talented in the development of social media/software applications to seize the opportunity of the suspension of Twitter operations in the country to develop homegrown applications that can rival existing social media platforms and meet the need of Nigerians.\nRussia has VKontakte (VK), China has Weibo, among several homegrown social media platforms.\nAccording to the party, Nigeria has the potential and talents that can develop alternative and competitive applications to existing platforms in the world.\nIt further stated that twitter’s suspension will undoubtedly serve as a positive trigger to unleash the creative potentials of Nigerians in the global digital space.\nRecall that the APC had earlier released a statement asking Twitter and other operators of social media pages to use their platforms to check divisive and inciting rhetoric, particularly in Nigeria."
  },
  {
    "headline": "Twitter Ban: Malami orders prosecution of offenders",
    "summarized_story": "The Attorney General of the Federation, Abubakar Malami has ordered the prosecution of offenders of the Federal Government ban on Twitter operations in Nigeria.\nThe AGF directed the Director of Public Prosecution of the Federation (DPPF) at his office to swing into action and commence in earnest the process of prosecution of violators of the Federal Government De-activation of operations of Twitter in Nigeria.\nThe DPPF is to liase with the Ministry of Communication and Digital Economy, National Communication Communication (NCC) and other relevant government agencies to ensure the speedy prosecution of offenders without any further delay."
  },
  {
    "headline": "Bandits Attack: Kebbi Governor Visits Danko/Wassagu, commiserates with",
    "summarized_story": "Kebbi state governor, Atiku Bagudu has visited Danko/Wassagu local government area where suspected bandits killed over eighty persons.\nBagudu was in the local government in company of some of his cabinet members to commiserate and condole the people over the attack.\nThe governor pleaded with the people to remain calm as government is doing all within it’s powers to restore normalcy in the area.\nThe youth are calling on the authority to redouble effort in finding a lasting solution to the deteriorating security challenges.\nAdvertisementA reliable source in the village says the number of casualty figures have risen to ninety two persons while several others have sustained injuries."
  },
  {
    "headline": "We’ll Work to Restore Access, Twitter Reassures Nigerians",
    "summarized_story": "American microblogging and social networking service, Twitter says it’s working to restore access for all Nigerians who rely on social media site to communicate and connect with the world.\nThe Nigerian government on Friday indefinitely suspended Twitter operations in the country, accusing the microblogging platform of undermining Nigeria’s existence.\nThe company said, “We are deeply concerned by the blocking of Twitter in Nigeria.\nAccess to the free and #OpenInternet is an essential human right in modern society.\nWe will work to restore access for all those in Nigeria who rely on Twitter to communicate and connect with the world.”By Abel Ejikeme"
  },
  {
    "headline": "Nigeria to Prosecute Citizens Who Disregard Twitter Ban – Arise News",
    "summarized_story": "The Nigerian government has ordered the prosecution of citizens who bypass the country’s firewall and continue the use of Twitter despite the ban in the country.\nThe West African country’s Minister of Justice and Attorney General of the Federation, Abubakar Malami gave the order on Saturday in a statement where he directed the Director of Public Prosecution of the Federation (DPPF) to prosecute offenders of the Federal Government ban on Twitter operations in Nigeria.\n“The AGF directed the Director of Public Prosecution of the Federation (DPPF) at his office to swing into action and commence in earnest the process of prosecution of violators of the Federal Government de-activation of operations of Twitter in Nigeria,” the statement signed by Umar Gwandu, a special assistant to the minister read.\n“The DPPF is to liase with the Ministry of Communication and Digital Economy, National Communication Communication (NCC) and other relevant government agencies to ensure the speedy prosecution of offenders without any further delay.”"
  },
  {
    "headline": "Twitter Ban Projects Nigeria as a Dictatorship: Editors",
    "summarized_story": "Editors in Nigeria have called on the federal government to immediately reconsider the suspension of operations of Twitter as the move projects the Nigerian government as a dictatorship.\n‘’The Guild sees the federal government’s action as an overreaction to Twitter’s decision to delete President Muhammadu Buhari’s tweet early this week.\n‘’If the federal government finds Twitter’s action against the President objectionable, Nigerians should not be made to suffer the collateral damage of denying them their right to freely discourse on Twitter’’, the Guild added.\n‘’Certainly, the federal government has the responsibility to safeguard the unity, peace and stability of Nigeria and any person or group that threatens this must draw its ire.\n‘’The Guild is aware of the democratizing influence of social media platforms, including Twitter, in helping to check dictatorship and promote democracy worldwide."
  },
  {
    "headline": "G7 Nations Strike Deal to Tax Big Companies and Squeeze Havens",
    "summarized_story": "“G7 finance ministers have reached a historic agreement to reform the global tax system to make it fit for the global digital age,” British finance minister Rishi Sunak said after chairing a two-day meeting in London.\nU.S. President Joe Biden’s administration gave the stalled talks fresh impetus by proposing a minimum global corporation tax rate of 15%, above the level in countries such as Ireland but below the lowest level in the G7.\nGerman finance minister Olaf Scholz said the deal was “bad news for tax havens around the world”.\n“Companies will no longer be in a position to dodge their tax obligations by booking their profits in the lowest-tax countries,” he added.\nIrish finance minister Paschal Donohoe, whose country is potentially a big loser with its 12.5% tax rate, said any global deal also needed to take account of smaller nations."
  },
  {
    "headline": "Nigeria: It Will Affect Investors Confidence, Oyo Governor Makinde Asks FG to Reverse Twitter Ban",
    "summarized_story": "Governor of Nigeria’s southwestern Oyo State, Seyi Makinde says the federal government’s decision to ban Twitter operations in the country will affect investor’s confidence and called on the Nigerian leader to reverse the decision.\n“Twitter has become the platform for young people and indeed all Nigerians to exercise their fundamental right to express and publish an opinion.\n“We should also remember that Twitter has gone beyond a source of communication for many of our hardworking youths in Nigeria.\n“Furthermore, I believe the Federal Government should be actively interested in how certain policies and action will affect investor confidence.\nI, therefore, use this medium to appeal to the Federal Government to reverse this suspension for the greater good of Nigerians.”By Abel Ejikeme"
  }
]