[
  {
    "headline": "BREAKING: Suspended Accountant-General released from EFCC custody",
    "summarized_story": "The suspended Accountant-General of the Federation, Ahmed Idris, has been released by the Economic and Financial Crimes Commission after he was arrested for his alleged involvement in a N174 billion fraud, The PUNCH can confirm.\nIdris was released on bail from the custody of the anti-graft agency on Wednesday night in Abuja and has since been reunited with his family.\nThe EFCC spokesperson, Wilson Uwujaren, confirmed this to our correspondent on Thursday morning.\nThree days after his arrest, Idris was suspended by the Minister of Finance, Budget and National Planning, Zainab Ahmed, to enable him to face his probe.\nSources within the EFCC also mentioned to our correspondent that the acting-AGF, Anamekwe Nwabuoku, who was appointed after Ahmed Idris’ suspension is also under surveillance concerning accusations of financial impropriety."
  },
  {
    "headline": "Kaduna: Group urges PDP gov candidate to pick lawmaker as running mate",
    "summarized_story": "The Southern Kaduna Concern Youth Group has called on the Peoples Democratic Party governorship flag bearer in Kaduna State to pick the incumbent lawmaker representing Kaduna South Senatorial District, Sen. Danjuma La’ah, as his running mate.\nChairman of the Group, Mr. Samuel Adamu, in a statement issued in Kaduna on Thursday, said his selection will guarantee the victory of the party at the general election.\nHe explained that Senator La’ah who has the support of the grassroots in Southern Kaduna, will in no small way boost the chances of the party winning the election in Kaduna State.\nAdamu expressed optimism that Senator La’ah has been a loyal party man, having served at the senate as the only PDP Senator in the Northwest Zone of the country, but has refused to decamp to the ruling All Progressives Congress despite intimidation.\nHe, however, called on the party faithful to continue to rally around and campaign for all the candidates of the party across the board for success."
  },
  {
    "headline": "Kalu recommends consensus presidential candidate for Buhari",
    "summarized_story": "), to choose the Senate President, Ahmad Lawan, as the consensus presidential candidate of the All Progressive Congress.\nKalu, in a statement on Thursday, insisted it is only cohesion and consensus among the regions that can produce a president for Nigeria.\nIf money can buy the president, former President Goodluck Jonathan could have bought the presidential seat in 2015.\n“I strongly believe that the fairness Nigerians need is to produce a president from the South East of Nigeria.\nIn the absence of the South East, it is the North East."
  },
  {
    "headline": "Timeline of Queen Elizabeth’s 70 years on British throne",
    "summarized_story": "Photo: Chris Jackson/PA Wire/dpaBritain is celebrating Queen Elizabeth II’s Platinum Jubilee, her 70th year on the throne, with a huge dollop of pomp and pageantry.\nThey had four children: Prince Charles (born in 1948), Princess Anne,(1950), Prince Andrew (1960) and Prince Edward (1964).\nJune 2, 1953 – Queen Elizabeth is crowned at Westminster Abbey in the first televised coronation service.\n1981 – Prince Charles marries Lady Diana Spencer in a glittering ceremony.\nMarch 30 – Queen Elizabeth, the Queen Mother, dies at Windsor Castle aged 101."
  },
  {
    "headline": "Stop fossil fuels exploration, Nigerian CSOs tell Shell",
    "summarized_story": "By Emma Amaize, Regional Editor, South-South, ASABACIVIL Society Organisations, CSOs, led by African Network for Environmental and Economic Justice, ANEEJ, have called on multinational oil giant, Shell Petroleum Development Company, SPDC, to directly commence a process of winding down further exploration of fossil fuels in Nigeria.\nThey also called on Shell to cut down carbon emission at source rather than targeting nature-based solutions.\nThey called on Shell to urgently revise its 2021 energy transition strategy to align with Paris Agreement, of limiting the increase in the average global temperature to 1.5 degrees Celsius above pre-industrial levels.\nIt targets increase in its gas production significantly, to reach over half of its business by 2030.\n“Shell’s excuse that Nigeria is an oil-dependent nation hence the increase in investments in oil and gas beyond global targets to end fossil fuel extraction is unacceptable.”"
  },
  {
    "headline": "Africa needs to join world’s shift from fossil fuel to renewable energy sources — Buhari",
    "summarized_story": "As Nigeria hosts maiden ‘Nigeria-Africa Natural Resources and Energy Investment Summit’Nigeria still spends $3.3 billion on steel imports annually — GuptaBy Gabriel Ewepu – AbujaAs Nigeria hosts maiden ‘Nigeria-Africa Natural Resources and Energy Investment Summit’, President Muhammadu Buhari, Wednesday, said Africa needs to join world’s shift from fossil fuel to renewable energy sources.\nAfrica requires a huge amount of energy generation to drive its development, even as the world shifts away from fossil fuel to clean and renewable energy sources, in the fight against climate change.\nIn the midst of this energy transition lies many challenges and opportunities for a continent yearning for development.\n“Our meeting today provides the opportunity to share views on natural resources and energy market developments.\nWith focusing on steel Nigeria can reduce dependency on imports and the economy would become a major player in global markets."
  },
  {
    "headline": "Okowa, best man as Atiku’s running mate — N-Delta Assembly",
    "summarized_story": "Niger Delta Rights Assembly, NDRA, has made a case for Governor Ifeanyi Okowa of Delta State to be nominated as running mate to the Presidential standard bearer of the Peoples Democratic Party, PDP, Alhaji Atiku Abubakar.\nAtiku was elected the PDP Presidential candidate at the recently-concluded PDP primary but the issue of his running mate is yet to be resolved with Okowa, among others featuring prominently on the list of candidates being considered for the position.\nNDRA said: “Among those being considered for the position of running mate to Atiku, we consider Governor Okowa as the most qualified for the position of running mate and ultimately the vice president of Nigeria.\nOkowa has also played critical roles for the PDP at different times by delivering credible, rancor-free conventions.\n“We want to use this opportunity to caution all those scheming against and blackmailing Okowa to desist from their evil shenanigans as this will not in any way diminish the rising profile of Governor Okowa as a performing governor, a refined democrat and an icon of good governance,” the group said."
  },
  {
    "headline": "Beheading of Anambra Lawmaker: Why we commended DSS arrest of suspects – Inter-Society",
    "summarized_story": "By Chinonso AlozieThe International Society for Civil Liberties and Rule of Law, on Wednesday, said it commended the Director of State Services, DSS, over the arrest of the suspects who were allegedly involved in the kidnapping and beheading of a current lawmaker of Aguata state constituency in Anambra state last month, because “it was fastest arrests in recent times in connection with violent crimes.”The intersociety group led by Emeka Umeagbalasi, alongside Barr Obianuju Igboeli, and Barr Chidimma Udegbunam, stated this in a statement issued to newsmen in Owerri.\nAccording to Intersociety, alleged that “An Unubi High Chief and malevolent herbalist, Chief Chukwujekwu Onuorah, alias “Egbe-Ejiejeogu” has been arrested by the operatives of Anambra State DSS Directorate.\nHis arrest is one of the high profile and intelligence and technology-powered and fastest arrests in recent times in connection with violent crimes.\nHis arrest was in connection with the abduction, disappearance, beheading and decapitation of Hon Okechukwu Okoye, an Isuofia Aguata born Anambra State Assembly lawmaker who was abducted on 15th May 2022.”Also, they recalled that “Intersociety had in its statement of 26th May 2022 (Killing of Northern Muslim Mother and her Children in Anambra) independently disclosed the arrest of “some soft targets” (an Okada rider and an automobile mechanic) over the dastardly act and named Unubi as the location of the scene of the heinous crime(s).\n“Intersociety which has been following the development behind the scene through its undercover agents also disclosed in its statement the arrest of the leader (“Omereora” from Nani) of the street criminal gang whose members went on a killing spree two days later, targeting defenseless civilians and their properties including the slain Northern Muslim mother and her children.”"
  },
  {
    "headline": "Treat Fulani herders like Niger Delta militants, create Ministry of Normadic Affairs – Gumi to Buhari",
    "summarized_story": "Controversial Islamic scholar, Sheikh Ahmad Gumi has called on the Federal Government to treat Fulani herders like Niger Delta militants.\nGumi made the call while noting that Fulani herders are aggrieved.\nSpeaking at the ‘Pastoralists and Fulbe Security Conference’ yesterday in Abuja, the Islamic scholar said the Federal Government should establish the Ministry of Nomadic Affairs to address the issues of herders.\n“What I expect from the government is nothing less than what it did when the Niger Delta youths were vandalising the economy.\nThe least they need is the ministry of nomadic affairs that will look into their affairs.”"
  },
  {
    "headline": "Political elites positioning themselves to corner resources beyond 2023 – ASUU tells Nigerians",
    "summarized_story": "The Academic Staff Union of Universities (ASUU) has declared that Nigerian political elites are more interested in positioning themselves ahead of the 2023 general elections.\nASUU explained that the political elites are not interested in fixing the problems in the education sector of the country, but are only interested in positioning themselves beyond 2023.\nChairman, University of Ibadan chapter of ASUU, Professor Ayo Akinwole made these disclosures on Thursday in Ibadan, the Oyo State capital.\nHe noted that only a virile public education system will give children of the masses a future in Nigeria.\nAkinwole who spoke further insisted that the union has been justified in rejecting the IPPIS."
  },
  {
    "headline": "2023: MKO Abiola would’ve been president if money could buy presidency – Orji Uzor Kalu",
    "summarized_story": "The Senate Chief Whip, Senator Orji Uzor Kalu, has said a Nigerian president can only be produced through consensus and not money.\nKalu said the late MKO Abiola would have become Nigeria’s president if money could purchase the highest political seat in the country.\nHe noted that delegates would collect money from politicians and still vote for their conscience.\n“If money can buy the office of the president of Nigeria, Late MKO Abiola could have bought it with extra change.\n“If money can buy the president, former President Goodluck Jonathan could have bought the presidential seat in 2015.”"
  },
  {
    "headline": "Court gives Abba Kyari nod to file more evidence against FG’s extradition suit",
    "summarized_story": "Justice Inyang Ekwo granted Kyari’s request made through his lead counsel Nureni Jimoh, SAN in a motion on notice.\nMeanwhile, Justice Ekwo has fixed June 3 for a definite hearing in the extradition suit instituted by the Attorney General of the Federation (AGF) on behalf of the Federal Government against Kyari.\nThe Federal Government had sought Kyari’s extradition to the United States to answer a case over his alleged link with Hushpuppi.\nThe suit, titled: “Application for the Extradition of Abba Kyari to the U.S.,” was dated and filed on March 2.\nThe application was filed under the Extradition Act, as part of the Nigerian government’s approval of the request by the US for Kyari’s extradition."
  },
  {
    "headline": "War: Russian forces sustain losses in battle with Ukraine – UK Defence Ministry",
    "summarized_story": "Russian forces have sustained losses after taking control of most of Severodonetsk amid the ongoing war against Ukraine.\nThe UK Defence Ministry stated this in a series of tweets on its Twitter account on Thursday morning while providing the latest update on the situation in Ukraine.\nThe main road into the Severodonetsk pocket likely remains under Ukrainian control but Russia continues to make steady local gains, enabled by a heavy concentration of artillery.\nThis has not been without cost, and Russian forces have sustained losses in the process.\nRussia President, President Vladimir Putin, had in February ordered the invasion of Ukraine due to some political differences between both neighbouring nations."
  },
  {
    "headline": "2023: I will beat Atiku as APC candidate",
    "summarized_story": "Former Imo Governor Senator Rochas Okorocha has assured he will defeat the People’s Democratic Party (PDP) candidate, Atiku Abubakar if given the All Progressives Congress (APC) presidential ticket.\nHe noted that his popularity and goodwill in the North, considered the PDP candidate’s stronghold, puts him at advantage over other APC aspirants.\nAdvising the APC on how to arrive at the choice of it’s presidential candidate, Okorocha urged the party to consider a person that can poll substantial votes in the North.\nAccording to him: “The APC has smartly waited until the PDP produced its candidate, now what should preoccupy the mind of the APC is who can defeat the PDP presidential candidate.\n“The PDP candidate, Atiku Abubakar, is someone that had contested election with our President and was an APC member and he polled substantial votes."
  },
  {
    "headline": "I’m not holding Yobe senatorial ticket for Lawan, says APC candidate",
    "summarized_story": "The All Progressives Congress (APC) senatorial candidate for Zone C, Bashir Machina, has denied holding the ticket for Senate President Ahmed Lawan.\nThere had been speculations Lawan, who is a presidential candidate, is still interested in the ticket won by Machina, a close friend of Gov.\nMachina, it was speculated, would withdraw for Lawn if he fails in his bid to win the APC presidential ticket.\n“As you are aware, Yobe is one of Nigeria’s frontline desert states.\nAs a resident of the state’s desert region, I will work to ensure that sound laws are enacted to transform the desert into a source of income for my people."
  },
  {
    "headline": "Allow aspirants test their popularity, ex-ACF scribe tells Buhari, APC",
    "summarized_story": "Former Secretary General of the pan northern socio-political organisation, Arewa Consultative Forum (ACF), Anthony Sani, has asked the governing All Progressives Congress (APC) and other political parties to allow aspirants test their popularity before delegates at a proper convention.\nSani said the use of consensus to pick the party flag bearers will stifle internal democracy, leading to avalanche of aggression, agitations, mistrust and suspicion in the polity.\nHe criticised President Muhammadu Buhari’s request for APC Governors to allow him to choose his successor, a move he said would amount to adopting the consensus option.\nHe warned if the ruling party is unable to consciously entrench internal democracy, it would be hard to convince Nigerians that it can entrench democracy in the country.\nLet the party convention allow all aspirants already reeling from high cost of nomination fees test their popularity as antidote to aggressions, agitations and suspicions as aftermath of convention by consensus”."
  },
  {
    "headline": "JUST IN: Court to hear Abba Kyari’s extradition case Friday",
    "summarized_story": "A Federal High Court in Abuja has scheduled hearing for Friday in the extradition proceedings initiated against suspended Assistant Commissioner of Police (ACP) Abba Kyari by the Federal Government.\nJustice Inyang Ekwo chose the date on Thursday to enable the Attorney General of the Federation (AGF) file a formal response to Kyari’s notice of primary objection challenging the competence of the extradition application filed by the AGF.\nThe AGF applied to the court for permission to surrender Kyari to authorities of the United States in relation to his alleged link with international fraud suspect, Abbas Ramon (aka Hushpuppi).\nDetails Shortly…"
  },
  {
    "headline": "Nigeria, Spain advocate global action to avert looming food crisis",
    "summarized_story": "Nigeria and Spain have canvassed a global action to avert looming food crisis especially in wheat production occasioned by the ongoing war in Ukraine.\nPresident Muhammadu Buhari and His Royal Majesty, King Felipe VI of Spain made the call when the two leaders met at the Royal Palace in Madrid, Spain, on Wednesday.\nThe Nigerian leader specifically stressed the need for world leaders to come together and strategise on ways to avert the looming food crisis around the world.\nBuhari was at the Royal Palace in continuation of his tree-day State Visit to Spain.\nThe two leaders urged world leaders to take concrete actions to avert the food crisis."
  },
  {
    "headline": "Presidential primary: Buhari’s stance on successor splits APC",
    "summarized_story": "This comes as a meeting of the APC governors held in Abuja, yesterday, to deliberate on who to support as the party’s presidential aspirant ended without any resolution.\nHowever, multiple sources told Daily Sun that the president’s stance has thrown the camps of most of presidential aspirants into confusion and also split the party.\nIn an open letter to the president titled: ‘Succession and 2023 APC presidential candidate’, Lukman enumerated the dangers and implications of taking such unilateral decision on the party.\nWith all the limitation imposed by the current Electoral Act, the delegates at the APC Convention who will be electing our Presidential candidate will not be less than 4,000.\nIn a letter addressed to APC delegates, yesterday, he said they should put the country first in their choice."
  },
  {
    "headline": "Army denies involvement in Methodist Primate’s kidnap",
    "summarized_story": "From Molly Kilete, AbujaThe Nigerian Army has faulted claims by the Prelate, Methodist Church Nigeria, Samuel Kanu Uche, alleging the complicity of its troops in his recent kidnap incident in Abia state, where the church paid a whooping N100 million to regain his freedom.\nThe army has also faulted claims by the prelate that soldiers of Fulani extraction allegedly carried out the act, saying troops deployment in the army is not done with considerations to ethnic affiliation.\nNwachukwu, while noting that the incident was never reported to the nearest army unit in the area when it occurred, said that the Methodist Church did not take the army into confidence while negotiating the ransom with the kidnappers.\nDid the Methodist Church take the NA into confidence while negotiating the ransom with the kidnappers?\n“Moreover, the NA unit has not received any debrief from the Prelate or the Methodist Church."
  },
  {
    "headline": "FEC okays NNPC, ECOWAS deal on Nigeria-Morocco gas pipeline – The Sun Nigeria",
    "summarized_story": "The Federal Executive Council (FEC) has given approval for the NNPC to enter into agreement with ECOWAS for the construction of the Nigeria-Morocco Gas Pipeline.\nThe pipeline would traverse 15 West African countries to Morocco and Spain.\n“The first memo, Council approved for the NNPC Ltd to execute MoU with ECOWAS for the construction of the Nigeria-Morocco Gas Pipeline.\n“This gas pipeline is to take gas to 15 West African countries and to Morocco and through Morocco to Spain and Europe,’’ he said.\nHe said that the park was to support local manufacturing of components for the oil and gas industry."
  },
  {
    "headline": "Lagos, Argentine Chambers sign MoU to increase bilateral trade volume",
    "summarized_story": "The Lagos Chamber of Commerce and Industry (LCCI) and the Argentine Chamber of Commerce and Services have signed a Memorandum of Understanding (MoU) to improve bilateral trade volumes between Nigeria and Argentina.\nSpeaking at the virtual MoU ceremony, yesterday, Dr Chinyere Almona, Director-General, LCCI, said the partnership would also promote international relationship between both countries.\nShe stated that presently, the major areas of bilateral trade between Nigerian and Argentine investments were in food, Information and Communication Technology (ICT) and construction.\nMr Marcelo Elizondo, President, Argentine Chamber of Commerce and Services, stated that the ceremony was to formalise and start a prosperous journey between both countries.\nElizondo said that Non Governmental Organizations such as these remained as relevant factor due to its key role in supporting companies wanting to activate international trade and relationship."
  },
  {
    "headline": "Lawan, North East should be grateful to Kalu –Lamido",
    "summarized_story": "Director General of Arewa Summit International, Dr. Bashir Lamido, has commended Senator Orji Uzor Kalu’s support for Senate President, Ahmad Lawan ahead of the 2023 presidential election.\nLamido, in a statement, yesterday, urged Lawan and leaders of the North East geo-political zone to continue appreciating Kalu’s support for the zone to clinch the 2023 presidency.\n“Leaders of the North East geo-political zone including the Senate president should appreciate Kalu for being bold enough to champion the course of the zone.\nThe entire North and North East in particularly will never forget the high wired support gotten from the South East through Kalu.”Kalu, Chief Whip of the Senate withdrew from the 2023 presidential race.\nIt further means that the justice is on its way to the South East."
  },
  {
    "headline": "FG: Disagreements Among Concessioners Delaying Take-off of $3.1bn e-Customs Project",
    "summarized_story": "According to the minister: “The e-Customs project was approved by Council.\nAnd there were some challenges that had to do with disagreements among the concession partners.\nAli reportedly said the e-Customs concession project would ease the cost of doing business, boost revenue, enhance productivity and stop every arbitrariness in the service.\nAlso, Ahmed disclosed plan by the federal government to address rising cost food prices across the country as it plans to convene a meeting of the National Food Security Council shortly.\n“There is also the supply of drugs and medical equipment for police hospitals across the country at the cost of N2 billion."
  },
  {
    "headline": "Presidency: APC Still Divided on Zoning, Mulls Options to Face Atiku",
    "summarized_story": "Interestingly, the development, has pushed the party leadership to consider the reopening of sales of Expression of Interest and Nomination forms to more members by way of broadening its choices for a suitable presidential candidate, that would secure the confidence of the people and lead the party to victory.\nThe APC was first thrown into confusion, when Atiku emerged candidate of the PDP at a keenly contested presidential primaries in Abuja, a situation, which completely unsettled the thinking and extrapolations in the ruling party.\nUnfortunately, the confusion was further accentuated on Monday, when President Muhammadu Buhari, at a meeting with the 22 governors of the party and Adamu, pleaded with the stakeholders to let him choose his successor as a sign of reciprocity.\nHe, therefore, enjoined them all to let him too enjoy same privileges through “reciprocity” of similar action, to choose his successor at the proposed June 6 presidential primaries.\nBut since this new thinking was thrown into the mix by the president, the leadership of the party, including the governors, as major stakeholders, had started pondering the options opened to them and particularly, lead them to victory."
  },
  {
    "headline": "Atiku Receives Certificate of Return, Says There is Much to Be Done",
    "summarized_story": "According to Atiku who spoke on his victory at the convention, “we should not take that or their defeat for granted.\nThe main contest is the one to win the presidency of our country for our party.\n“It will require the entire PDP family and other supporters and sympathisers.\n“Rather within the PDP family, we had a minor contest, a small contest within the family.\nThe visit was barely 24 hours that Atiku visited Wike in company of some PDP officials."
  },
  {
    "headline": "News in Photographs: Osinbajo Presides over FEC Meeting",
    "summarized_story": "Vice President Yemi Osinbajo Wednesday presided over the weekly Federal Executive Council meeting.\nThe meeting held at the Council Chamber was attended by some cabibet members while others joined the meeting virtually from the various offices.President Muhammadu Buhari is currently on a visit to Spain.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Anxiety in Labour Party, as Court Okays Factional Leader’s Fresh Suit",
    "summarized_story": "The judge, Inyang Ekwo, made the order on Monday after hearing an ex parte application filed by a former Deputy national chairman of the party, Calistus Okafor.\nThe committee members are Salisu Mohammed, Lawson Osagie, Isa Aremu, Baba Aye, Ikpe Ektokudo, Sylvester Ejiofor, and Lucy Offiong.\nHe explained that he got the post by virtue of his position as Deputy National Chairman of the party when the late national chairman, Abdulsalam, was in office.\nHe said the LP constitution stipulated that the deputy national chairman should act and/or replace the chairman in the event of death or resignation.\nHe said, “The NLC and the TUC actually registered the Labour Party in 2006, but they were not the ones administering it."
  },
  {
    "headline": "Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of Law, Clampdown On Free Speech In Nigeria",
    "summarized_story": "WATCH VIDEO: Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of Law, Clampdown On Free Speech In NigeriaVideo of Sowore’s #RevolutionNow Trial: Buhari’s Regime Continues Undermining Rule Of LawYou may also like"
  },
  {
    "headline": "FIBA replaces D'Tigress with Mali for 2022 World Cup, may sanction Nigeria",
    "summarized_story": "The International Basketball Federation (FIBA) has confirmed that Nigeria will not participate in the 2022 Women’s World Cup billed for Sydney, Australia, later in the year.\nThe world basketball governing body announced the decision in a statement on Thursday morning.\nIn the statement, FIBA said the NBBF “is unable to confirm its participation in the FIBA Women’s Basketball World Cup 2022.”Consequently, it said D’Tigress would be replaced by Mali at the competition.\nAdvertisement“Nigeria’s withdrawal from the FIBA Women’s Basketball World Cup 2022 is confirmed.\n“Mali, as the next ranked team from Group B of the FIBA Women’s Basketball World Cup 2022 Qualifying Tournament in Belgrade, is invited to participate in the FIBA Women’s Basketball World Cup 2022“FIBA will announce whether there will be any other decisions related to the NBBF’s participation in other FIBA competitions and any potential disciplinary measures in due course.”Members of the D’Tigress had earlier called on the government to allow them to participate in the FIBA Women’s World Cup competition for which the team had qualified."
  },
  {
    "headline": "FIBA replaces D'Tigress with Mali for 2022 World Cup, may sanction Nigeria",
    "summarized_story": "The International Basketball Federation (FIBA) has confirmed that Nigeria will not participate in the 2022 Women’s World Cup billed for Sydney, Australia, later in the year.\nThe world basketball governing body announced the decision in a statement on Thursday morning.\nIn the statement, FIBA said the NBBF “is unable to confirm its participation in the FIBA Women’s Basketball World Cup 2022.”Consequently, it said D’Tigress would be replaced by Mali at the competition.\nAdvertisement“Nigeria’s withdrawal from the FIBA Women’s Basketball World Cup 2022 is confirmed.\n“Mali, as the next ranked team from Group B of the FIBA Women’s Basketball World Cup 2022 Qualifying Tournament in Belgrade, is invited to participate in the FIBA Women’s Basketball World Cup 2022“FIBA will announce whether there will be any other decisions related to the NBBF’s participation in other FIBA competitions and any potential disciplinary measures in due course.”Members of the D’Tigress had earlier called on the government to allow them to participate in the FIBA Women’s World Cup competition for which the team had qualified."
  },
  {
    "headline": "IED 'planted' by IPOB blows up members in Imo",
    "summarized_story": "The Nigerian Army says an improvised-explosive device (IED) allegedly planted by the Indigenous People of Biafra (IPOB) has exploded, inflicting injuries on the militants.\nAccording to the army, the explosion caused severe injuries to two members of the proscribed group.\nHe alleged that members of the group had, on several occasions, planted IEDs along patrol routes in a bid to harm troops.\nAdvertisementHe said the IPOB members were injured while they were trying to evade the army’s offensive in the Orlu area.\n“The outlawed group has severally planted IEDs along troops’ patrol routes in a failed effort to bring harm to the troops."
  },
  {
    "headline": "IED 'planted' by IPOB blows up members in Imo",
    "summarized_story": "The Nigerian Army says an improvised-explosive device (IED) allegedly planted by the Indigenous People of Biafra (IPOB) has exploded, inflicting injuries on the militants.\nAccording to the army, the explosion caused severe injuries to two members of the proscribed group.\nHe alleged that members of the group had, on several occasions, planted IEDs along patrol routes in a bid to harm troops.\nAdvertisementHe said the IPOB members were injured while they were trying to evade the army’s offensive in the Orlu area.\n“The outlawed group has severally planted IEDs along troops’ patrol routes in a failed effort to bring harm to the troops."
  },
  {
    "headline": "FULL LIST: Sanwo-Olu, Buni, Malami --- APC sub-committee heads for presidential primary",
    "summarized_story": "The All Progressives Congress (APC) has released the names of chairpersons of sub-committees for the special convention to elect the party’s presidential candidate.\nThe APC presidential primary election is scheduled for June 6.\nFelix Morka, APC spokesperson, in a statement on Thursday, announced the heads of sub-committees, which include 17 governors, and four ministers.\nHere is the full list:AdvertisementBudget sub-committeeChair: Muhammad Yahaya, governor of GombeCo-chair: Zainab Ahmed, minister of financeFinance and logistics sub-committeeAdvertisementChair: Babajide Sanwo-Olu, governor of LagosAccreditation and decoration sub-committeeChair: Dapo Abiodun, governor of OgunSecurity and compliance sub-committeeAdvertisementChair: Rotimi Akeredolu, governor of OndoCo-chair: Abdulrahman Dambazau, former minister of interiorElection planning sub-committeeChair: Abubakar Bagudu, governor of KebbiAdvertisementCo-chair: Hope Uzodimma, governor of ImoTransportation sub-committeeAdvertisementChair: Abdullahi Ganduje, governor of KanoDeputy: Ramatu Tijani Aliyu, minister of state for the federal capital territoryAdvertisementAccommodation sub-committeeChair: Babagana Zulum, governor of BornoCo-chair: Gboyega Oyetola, governor of OsunMedia and publicity sub-committeeChair: Abdullahi Sule, governor of NasarawaMedicals sub-committeeChair: Chris Ngige, minister of labour and employmentCo-chair: Isaac Adewole, former minister of healthLegal sub-committeeAbubakar Malami, attorney-general of the federation and minister of justiceVenue and site servicing sub–committeeChair: Bello Matawalle, governor of ZamfaraCo-chair: Mohammed Musa Bello, minister of the federal capital territoryElection appeal committeeChair: Mai Mala Buni, governor of YobeHospitality and welfare sub-committeeChair: Simon Lalong, governor of PlateauCo-chair: Hajiya Sadiya Umar Farouq, minister of humanitarian affairs, disaster management and social developmentProtocol sub-committeeChair: Aminu Masari, governor of KatsinaDigital communications sub-committeeChair: AbdulRahman AbdulRazaq, governor of KwaraPre-convention/management/ rapporteur committeeChair: Nasir el-Rufai, governor of KadunaDeputy: Dame Pauline Tallen, minister of women affairsPresidential screening appeal sub-committeeChair: Abubakar Sani Bello, governor of NigerCo-chair: Ahmed Idris Wase, deputy speaker of the house of representativesAccreditation of diplomats sub-committeeChair: Ovie Omo-Agege, deputy president of the senateCo-chair: Geoffrey Onyeama, minister for foreign affairs"
  },
  {
    "headline": "The biggest African tech moves from April",
    "summarized_story": "From MTN’s PSB license approval and Airtel’s super-agent license in Nigeria, to Sun King’s $260 million raise in Kenya, and CAR’s crypto adoption, here are the top 10 biggest tech moves in April.\nWest Africa comes in second with $90.5 million announced across 18 funding deals.\nThis month, a slew of good news came for the mobile money sector in anglophone and francophone West Africa.\nIn April, the Central African Republic (CAR) became the first African country to adopt bitcoin—and all other forms of cryptocurrency—as legal tender.\nA year after launching operations in South Africa, Chinese ride-hailing giant, Didi Chixung, ended its operations in South Africa."
  },
  {
    "headline": "Appetito buys Lamma to expand into Tunisia, Morocco, and West Africa",
    "summarized_story": "We’re 12 months ahead of our plan to expand in Africa,” Mokhtar said in the statement.\nBoth companies have already begun to train staff together, Lamma co-founder and CEO Yassir El Ismaili El Idrissi told TechCabal on a call.\nAppetito co-founders and Lamma co-founder, Yassir El Ismaili El Idrissi.\nWith the addition of Rabat and the Greater Tunis area, it appears that the new Appetito already has its hands full.\nEl Idrissi, the Lamma co-founder who will be joining Appetito to lead its growth and expansion, says the firm will focus on consolidating in the markets it is already operating in."
  },
  {
    "headline": "Patricia’s CEO on taking risks and building for impact",
    "summarized_story": "He’d received a gift card worth ₦30,000 (~$73), in 2015, from his uncle in the US, in lieu of a monthly allowance.\nNeeding to exchange the gift card for cash, he went online to transact with a gift card exchange, only to fall victim to a scam.\nGift card scams are commonplace: users are asked to disclose the card’s number, unwittingly granting the scammer access to its funds.\nFor the next 2 years, from 2017 through 2018, Patricia would operate as a gift card exchange.\nIn 2019, Fejiro transitioned Patricia from gift card exchanging to a line that he found to be blossoming in popularity and demand: crypto trading."
  },
  {
    "headline": "Even after a $10,000 loss, this crypto trader found a gem in the crypto space, and she’s never letting go",
    "summarized_story": "This is what an expert crypto trader who identifies simply as Ademi asks anyone who wants to make money from crypto.\nEven after losing $10,000, she still sticks to crypto trading as a career.\nStarting with the 2017 bull marketPhoto by CardMapr.nl on UnsplashA crypto bull market is a time when the value of crypto assets keeps rising.\nHowever, a bear market — what comes at the end of a bull market — is what separates the newbies from the experts.\nHowever, just as Bitcoin reached the $20,000 limelight, it was followed by a 30% drop that bloodied the entire crypto market."
  },
  {
    "headline": "Talk360’s $4 million seed",
    "summarized_story": "Today, I’ll be discussing:How Victoria Fabunmi helps founders get capitalTalk360’s $4 million seedAppetito’s acquisitionHow Victoria Fabunmi helps founders get capitalVictoria Fabunmi.\nIf you want to understand how the Venture Capital market works, look for his story every Wednesday at 12 p.m. WAT!\nPerhaps you’re wondering how to get started in venture capital; wonder no more!\nCheck them out here: How Victoria Fabunmi helps startup founders get capital to drive growthTalk360’s $4 million seedTalk360, South Africa’s international calling platform, had announced a $4 million seed round.\nThe company wants to use some of its funding to build its own payment platform to make payment and checkout easier for its African users."
  },
  {
    "headline": "[PODCAST] An NFT marketplace for creatives",
    "summarized_story": "Techpoint Africa is too.\nAyoken is an NFT marketplace for creatives to increase their earnings.\nHenry-Coco Bassey feels such a product is great for creatives as they could make more money from their art.\nProdigeezy, who helps BNXN manage his NFT collection, shares the same opinion but points out that it is not yet mainstream, potentially impacting income for creatives.\nFor more on these stories, tune in to the Techpoint Africa Podcast on Spotify, Google Podcast, Apple Podcast, and any podcast platform you use."
  },
  {
    "headline": "Vault Hill debuts its NFT marketplace with the public sale of metaverse land",
    "summarized_story": "To promote your brand via Brand Press, please email business@techpoint.africaShare this article:Blockchain-based company, Vault Hill, has launched its NFT marketplace with the public sale of land in its human-centric metaverse, Vault Hill City (VHC).\nAs part of the land sale, a free HTC VIVE Flow VR glasses will be given per parcel of land bought.\nThe VHC land parcels are Non-Fungible Tokens (NFTs) built on the Ethereum blockchain (ERC-721) which are unique and distinct.\nIt is also the first virtual world with urban planning and development benefits to ensure users build on their virtual land respectfully.\nFurther information regarding the land sale can be found here and the metaverse development timeline can be viewed in the whitepaper."
  },
  {
    "headline": "Adaverse Backs Cassava Network With A Seed Investment To Empower African Content Creators",
    "summarized_story": "Brand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\n“EMURGO Africa is excited to support the development of Cassava Network’s innovative content rewards ecosystem.\nTo apply for funding at Adaverse, visit www.adaverse.coBrand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "Nigeria faces three-horse race in 2023",
    "summarized_story": "He founded one of the best higher institutions in the country – American University of Nigeria (AUN) in Yola, his native home.\nBut with Buhari not going to be on the ballot in 2023, pundits say his chances are brighter this time around.\nHe also showed interest in the contest for the gubernatorial seat of Adamawa State under the United Nigeria Congress Party.\n“I therefore, thank all of you and call for your sustained support towards returning Nigeria to Nigerians from forces of bad leadership and retrogression.\nIn 1980, Peter proceeded to University of Nigeria, Nsukka where he graduated with a B.A (Hons) in Philosophy in 1984."
  },
  {
    "headline": "APC’s electricity promise falls short",
    "summarized_story": "Just like his predecessors, President Buhari won the 2015 presidential election, with a promise to boost power supply in the country.\nAt first glance, the Federal Government’s reforms to improve cash flow and market discipline in the power sector seem to bear tangible fruits.\nSouth Africa, Africa’s second-biggest economy, has an electricity generation capacity of 58,000MW.\nIn Ghana, between 2000 and 2020, electricity generation capacity increased at a rate of 6.4 percent a year from 1,358MW to 4,695MW, according to data from the country’s energy agency.\nThe International Monetary Fund estimates that Nigeria’s economy loses about $29 billion a year because of electricity supply problems."
  },
  {
    "headline": "How presidential ticket split APC northern, southern governors – Sources",
    "summarized_story": "The discussion over presidential candidacy on Tuesday divided northern All Progressives Congress (APC) governors and their southern counterparts, sources told BusinessDay.\nWhile President Muhammadu Buhari had asked the governors to let him choose his successor, the governors are scheming to have one of their own get the party’s presidential ticket.\nIt was gathered that at the first meeting, which ended in deadlock, the governors were divided on their choice of a presidential candidate.\nHowever, the sources said many northern governors argued that no southern governor could defeat Atiku Abubakar, the presidential candidate of the main opposition Peoples Democratic Party, and the North should be given preference.\nThey said his decision to choose the party presidential candidate unilaterally was undemocratic, and an abuse of party supremacy which could lead to implosion in the party ahead of the 2023 general elections."
  },
  {
    "headline": "Edo ex-commissioner secures freedom for eight inmates – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe former Edo Commissioner for Arts, Culture, Tourism and Diaspora Affairs, Osaze Osemwengie-Ero, with the support of the Edo State Government has secured the release of eight inmates from the Oko correctional facility in Benin City.\nThe ex-commissioner hosted the freed inmates who were jailed for petty offenses such as fighting, stealing and malicious damage on Wednesday, to celebrate the one-year anniversary of his freedom from unlawful detention in Italian prisons.\n“You can imagine keeping somebody in prison for two years just because of N100, 000.\nWhen the person comes back out of that prison how is he going to fit into the system?\n“So, we decided to reach out to friends to raise N2 million and secure the freedom of eight prisoners and for other logistics."
  },
  {
    "headline": "CRICKET: Edo Boys High School Emerges Champions of Templars Schools Competition – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo Boys High School Cricket team, Benin City on Friday shown class and style in this year’s male final of the Templars Secondary Schools Boys Competition as they defeated the stubbornly Ohonre Grammar School, Benin by 6 wickets.\nThe second innings didn’t take much time as Edo boys high school only had a target of 31 runs to win.\nIt took them just 6.5 overs to surpass the target and emerge champions.\nHowever, the third place match that took place earlier wasn’t short of the thrill and fun as Government Science and Technical College (GSTC) Benin edged out Christlike Secondary School (IDP Camp).\nAs regards the team’s victory, the coach of Edo boys High School, Mr Theophilus Ibodeme Adophus expressed joy over his team’s victory."
  },
  {
    "headline": "Obaseki seeks doctors’ support to rejig Edo health system, tackle brain drain – Nigerian Observer",
    "summarized_story": "He said, “We need more doctors, particularly with the way the doctors are traveling out for greener pastures.\nWhat we need is to strengthen the institutions that produce doctors.\nThe lesson is that we must fix our healthcare system.\n“We have insisted on healthcare reforms.\n“My focus is on how to produce more doctors by strengthening the basic education system and giving quality education to produce more doctors for the state."
  },
  {
    "headline": "Amstel Malta Ultra Refreshes Okpekpe Race Participants – Nigerian Observer",
    "summarized_story": "The premium beverage brand’s sponsorship of the thrilling road race is part of its commitment to initiating quality interactions and inspiring healthier communities through sporting activities in Nigeria.\nDuring the event, Amstel Malta Ultra, presented as the official malt drink of the race, provided much-needed vitality and motivation for scores of athletes from across the Africa continent who competed to earn a share in the N60million cash reward for top performers.\nSince its launch in 2020, Amstel Malta Ultra has achieved acclaimed recognition among consumers as a drink for health-conscious individuals and fitness enthusiasts.\nThe beverage brand’s ‘no added sugar’ feature makes it the choice drink for athletes and people in the sports industry.\nWith its sponsorship of the 8thOkpekpe International 10km Road Race and its previous editions, Amstel Malta Ultra reiterates its commitment to reviving healthy lifestyle activities, uniting Nigerians through sports, and empowering athletes with premium vitality."
  },
  {
    "headline": "Spain, Nigeria partner to develop sports",
    "summarized_story": "Nigeria and Spain through their respective ministries of sports have signed a memorandum of understanding (MoU) to promote relationships, cooperation, and collaboration in sports.\nThe partnership which was signed in Madrid, the capital of Spain, on Wednesday, is a sequel to the bilateral agreements reached by Spain and Nigeria during the current state visit of President Muhammadu Buhari to the European country.\nThe MoU which was signed by Sunday Dare, minister of youth and sports development, and Miquel Octavi Iceta Lloren, Spain’s minister of culture and sports, are to initiate and build collaboration in sports as well as strengthen the bilateral exchange between both countries on the basis of reciprocity according to their competencies and mutual benefits in sports.\nSome of the specific areas of cooperation include the following among others; “building, development and management of sports relations and institutions, exchange of knowledge in sports science, technology, medicine, and the fight against doping.”Others are “sports sponsorship, patronage, and organising of sports events, initiating programmes to support and promote sports for special athletes, protection of young athletes and sportswomen.”Provision of sports facilities and training centres, organization of friendly and major International competitions among the national teams and clubs of both countries in different sports and the arrangement of joint training sessions were also listed among the areas of cooperation."
  },
  {
    "headline": "2023: Money cannot buy presidency, otherwise Abiola would have bought it – Orji Kalu",
    "summarized_story": "Kalu, a former governor of Abia State who is backing Ahmad Lawan for president, noted that if money could buy power, MKO Abiola would have bought it with change.\n“The earliest Nigerians and presidential aspirants understand that no amount of money can buy the president of the country , the better for everyone,” Kalu wrote.\n“If money can buy the office of the president of Nigeria, Late MKO Abiola could have bought it with extra change.\nIf money can buy the president, former President Goodluck Jonathan could have bought the presidential seat in 2015.\nIn the absence of the South East , it is the North East ."
  },
  {
    "headline": "UAC raises N18.7bn through Commercial Paper",
    "summarized_story": "UAC of Nigeria has raised N18.7 billion from the country’s investing public through a Commercial Paper issuance in the Nigerian debt market.\nThe fund was raised in a Series 1 and 2 of the N45 billion Commercial Paper Programme of UAC Nigeria.\nThe raise, which would add to the company’s debt, will be used by its subsidiaries to meet short-term working capital needs.\nThe commercial paper issuance comprised two tenors – a 90-day Series 1 issuance which priced at 8.00% yield, and a 181-day Series 2 issuance which priced at 8.25% yield.\nAccording to Group Finance Director of UAC, Funke Ijaiya-Oladipo, who commented on the commercial paper issuance, said “We are delighted to have successfully completed our first CP Issuance in the Nigerian debt market."
  },
  {
    "headline": "Imo govt dismisses Uzodinma’s stroke rumours",
    "summarized_story": "The Imo State government has dismissed rumours making the rounds that the state governor, Hope Uzodinma was hit by a stroke and had been flown to India for emergency medical attention.\nDeclan Emelumba, the Commissioner for Information and Strategy, in a statement in Owerri, the state capital on Wednesday said that the governor was hale and hearty.\nAccording to Emelumba, the governor was currently in Abuja partaking in the activities leading to the forthcoming presidential primary of the All Progressives Congress.\n“He said those behind the satanic rumours are descendants of Lucifer who are vainly wishing evil on the governor.\n“The Commissioner warned the purveyors of the rumours to desist forthwith before they suffer unmitigated disaster."
  },
  {
    "headline": "JUST IN: FIBA replaces D’Tigress with Mali for 2022 Basketball World Cup",
    "summarized_story": "The International Basketball Federation (FIBA) has disclosed that Nigeria’s D’Tigress will not participate in the 2022 Women’s World Cup billed for Sydney, Australia, later in the year.\nThe move came amid the ongoing power tussle within the Nigeria Basketball Federation (NBBF).\nIn the statement, FIBA said the Nigerian Basketball Federation (NBBF) “is unable to confirm its participation in the FIBA Women’s Basketball World Cup 2022.”Consequently, it said D’Tigress would be replaced by Mali at the competition.\n“Nigeria’s withdrawal from the FIBA Women’s Basketball World Cup 2022 is confirmed.\n“Mali, as the next ranked team from Group B of the FIBA Women’s Basketball World Cup 2022 Qualifying Tournament in Belgrade, is invited to participate in the FIBA Women’s Basketball World Cup 2022“FIBA will announce whether there will be any other decisions related to the NBBF’s participation in other FIBA competitions and any potential disciplinary measures in due course.”"
  },
  {
    "headline": "Nigerian Student Faces Deportation From Russia Over Alleged Corruption In Scholarship Board",
    "summarized_story": "A Nigerian final year medical student at Irkutsk State Medical University (ISMU) in Russia, Usman Yahaya, will be deported to Nigeria any moment from now.\nAccording to PRNigeria, Yahaya, a Sokoto State-born medical student has been in detention in Russia, for over a month.\nHe was, thereafter, detained at a Russian immigration camp at Angarsk Irkutsk, by authorities of the European nation’s Immigration due to alleged corrupt practices at Sokoto State Scholarship Board.\nYahaya’s travail was allegedly orchestrated by the Director of Foreign Students at the Sokoto State Scholarship Board, Kabiru Labaran, who had been ‘pilfering’ substantial amounts from Yahaya’s foreign bursary approved yearly by the Sokoto State Government, since 2016.\nHe urged anti-corruption agencies to probe the allegation of bribery and corrupt practices at the Sokoto Scholarship Board."
  },
  {
    "headline": "Nigerian Student Faces Deportation From Russia Over Alleged Corruption In Scholarship Board",
    "summarized_story": "A Nigerian final year medical student at Irkutsk State Medical University (ISMU) in Russia, Usman Yahaya, will be deported to Nigeria any moment from now.\nAccording to PRNigeria, Yahaya, a Sokoto State-born medical student has been in detention in Russia, for over a month.\nHe was, thereafter, detained at a Russian immigration camp at Angarsk Irkutsk, by authorities of the European nation’s Immigration due to alleged corrupt practices at Sokoto State Scholarship Board.\nYahaya’s travail was allegedly orchestrated by the Director of Foreign Students at the Sokoto State Scholarship Board, Kabiru Labaran, who had been ‘pilfering’ substantial amounts from Yahaya’s foreign bursary approved yearly by the Sokoto State Government, since 2016.\nHe urged anti-corruption agencies to probe the allegation of bribery and corrupt practices at the Sokoto Scholarship Board."
  },
  {
    "headline": "JUST-IN: Police Seal Zenith Banks In Imo Over Madumere’s Benefits",
    "summarized_story": "All branches of Zenith Bank in Owerri, the Imo State capital, were on Thursday, sealed off by policemen over payment of benefits to a former deputy governor of the State, Prince Eze Madumere.\nA bank staff, who pleaded anonymity, told LEADERSHIP that the erstwhile deputy governor secured an absolute Garnishee Order from the National Industrial Court in Owerri against the bank in a suit.\nThe staff said, “The order is for N1.9bn entitlements claim and the policemen from Zone 9 have come to enforce the court order.\nMadumere had secured a court order restraining the then Governor Rochas Okorocha from swearing-in another deputy governor as a replacement for him.\nIt could also be recalled that Madumere secured another court verdict in his favour, which quashed his impeachment by the Imo State House Assembly."
  },
  {
    "headline": "JUST-IN: Police Seal Zenith Banks In Imo Over Madumere’s Benefits",
    "summarized_story": "All branches of Zenith Bank in Owerri, the Imo State capital, were on Thursday, sealed off by policemen over payment of benefits to a former deputy governor of the State, Prince Eze Madumere.\nA bank staff, who pleaded anonymity, told LEADERSHIP that the erstwhile deputy governor secured an absolute Garnishee Order from the National Industrial Court in Owerri against the bank in a suit.\nThe staff said, “The order is for N1.9bn entitlements claim and the policemen from Zone 9 have come to enforce the court order.\nMadumere had secured a court order restraining the then Governor Rochas Okorocha from swearing-in another deputy governor as a replacement for him.\nIt could also be recalled that Madumere secured another court verdict in his favour, which quashed his impeachment by the Imo State House Assembly."
  },
  {
    "headline": "AFD Offers Scholarship To Vulnerable Children",
    "summarized_story": "As part of efforts to help Nigeria realise its Sustainable Development Goal on education, the French Development Agency (AFD) in collaboration with the Urunwa Art, is set to offer scholarship to out of school children in vulnerable communities.\nThroughout the programme, 30 children, of whom 20 are girls are beneficiaries of the workshops aimed at introducing the children to drawing, painting and collage.\nThe idea is to go to the communities, get to the vulnerable ones and provide them with some scholarships.\n“The essence is to see how the country can meet the Sustainable Development Goals (SDGs).\n“The money realised from the art works will go into their education by providing them with scholarships,” he explained."
  },
  {
    "headline": "BREAKING: Court To Hear Abba Kyari’s Extradition Case Friday",
    "summarized_story": "Justice Inyang Ekwo chose the date on Thursday to enable the Attorney General of the Federation (AGF) to file a formal response to Kyari’s notice of primary objection challenging the competence of the extradition application filed by the AGF.\nThe AGF applied to the court for permission to surrender Kyari to authorities of the United States in relation to his alleged link with international fraud suspect, Abbas Ramon (aka Hushpuppi).\nDetails Shortly…"
  },
  {
    "headline": "Hijab Crisis: Kwara Reopens Baptist School After Four-Month Closure, Says Islamic Headcoverings Allowed",
    "summarized_story": "After a four-month closure due to female Muslim students wearing hijab, the Kwara State Government has announced the reopening of Oyun Baptist High School in Ijagbo for students.\nThe government said it would not “hesitate to shut the school again, among other things, if anything threatens the safety of the little children”.\nThe statement read, “The Ministry’s decision to reopen the school is one of the government’s multi-prong approaches to return normalcy to the school.\n“Unfortunately, around 6:30 am, without any provocation, the jihadist started shouting ‘No Hijab, no school’ as they marched in batches to the school.\nWhen did Islamic clerics become law enforcement agents in Kwara State?"
  },
  {
    "headline": "IPOB Has Buried Explosive Devices Along South-East Routes, 2 Secessionists Wounded By Own Bomb — Nigerian Army",
    "summarized_story": "IPOB Has Buried Explosive Devices Along South-East Routes, 2 Secessionists Wounded By Own Bomb — Nigerian ArmyTwo members of the Indigenous People of Biafra (IPOB) and its militant arm, the Eastern Security Network (ESN), were injured by an explosive device left on the road, according to the Nigerian Army.\nBrig.-Gen. Onyema Nwachukwu, Director of Army Public Relations, said on Thursday that IPOB/ESN members had buried explosive devices along various routes in the troubled South-East region.\nHe claimed that this was done in order to hurt Nigerian troops.\nThe group seeks the breakaway of the South-East region, and possibly the South-South which is to be known as the Biafra Republic.\n“The outlawed group has severally planted IEDs along troops’ patrol routes in a failed effort to bring harm to the troops."
  },
  {
    "headline": "BREAKING: APC govs’ meeting deadlocked as search for consensus candidate begins",
    "summarized_story": "Governors elected on the platform of the All Progressives Congress (APC) have begun the search for a consensus presidential candidate, The PUNCH has learnt.\nA source privy to the first meeting of the governors told Punch correspondent that the meeting ended in a deadlock.\nAsked what transpired during the meeting, the politician said, “The governors are still divided on the matter.\n), had asked the Progressive Governors to search for the right successor at a meeting in Aso Rock on Tuesday.\nThey also include Pastor Tunde Bakare, the Cross River State Governor, Prof Ben Ayade; his Ekiti State counterpart, Dr Kayode Fayemi, an ex-Minister of State, Education, Emeka Nwajiuba, former President of the Senate, Senator Ken Nnamani; Kogi State Governor, Yahaya Bello; Jigawa State governor, Mohammed Badaru and former Zamfara State governor, Senator Ahmed Yerima."
  },
  {
    "headline": "Lukman, APC stakeholders to Buhari: Choose presidential candidate, risk your integrity",
    "summarized_story": "What Buhari saidBuhari, had during a meeting with the APC governors Tuesday, begged that he be allowed the privilege of choosing his successor like the governors did in their various states.\nLukman, who is the APC national vice chairman (North-west), gave the advice Wednesday in an open letter to President Buhari in Abuja.\n“Your Excellency, since the period of negotiating the merger that produced our party APC, I have been a proponent of ensuring that our party takes every step to preserve our leaders who could exercise moral authority.\nThe president said the governors of APC should support him to choose his successor.\nHe spoke when he hosted APC national leader and presidential aspirant, Asiwaju Bola Tinubu, in Calabar."
  },
  {
    "headline": "2023: Ayu talks tough as Atiku receives PDP certificate of return, pledges inclusiveness",
    "summarized_story": "The Peoples Democratic Party (PDP) 2023 presidential candidate and former Vice President Atiku Abubakar said his emergence is a victory for the party and Nigerians.\nAtiku said: “I am honoured and humbled to receive this certificate of Return having emerged as our party’s candidate in our just concluded special convention.\nThe former vice president also thanked the National Working Committee (NWC) for providing the right leadership provided the party.\nIt will require the entire PDP family and other supporters and sympathisers.\nHe said: “Within the PDP family, we had a minor contest, a small contest within the family."
  },
  {
    "headline": "FirstBank: Supporting Agribusiness financing with range of products",
    "summarized_story": "First Bank of Nigeria Limited offers different range of products to support the agric business in its efforts to grow the nation’s economy.\nGlobally, the agricultural sector plays a pivotal role in the development of the economy of every country.\nThe Nigeria agricultural policy provides among others, the adequate financing of agriculture.\nThe bank’s products targeted at developing agriculture sector and other agric schemes introduced by federal government.\nSome of the products nclude; Maize Aggregation Scheme (MAS), Non-Oil Export Stimulation Facility (NESF), Commercial Agriculture Credit Scheme, Export Facilitation Initiative (EFI) among others."
  },
  {
    "headline": "Why we reversed $3.1bn e-customs project – FG",
    "summarized_story": "By Mathew Dadiya, AbujaFederal Government has explained the reasons why the $3.1 billion contract for ‘complete automation’ of the Nigerian Custom Service, approved by the Federal Executive Council (FEC), in 2020 was reversed.\nIt clarified that disagreements between partners that formed a consortium for the project, delayed its takeoff despite efforts by the government through the office of the Attorney General of the Federation to mediate.\nAsked to explain the rationale behind a new e-Customs concession agreement between the NCS, Africa Finance Corporation (AFC) and China’s Huawei Technologies Limited, Ahmed said: “The E-customs project was approved by Council.\nAnd there were some challenges that had to do with disagreements between the concession partners.\nAnd at the end of the day, I think one of the partners in the concession did not agree with the arrangements”, she stated."
  },
  {
    "headline": "Oil price nears $125 a barrel amid EU ban on 90% Russian oil imports",
    "summarized_story": "Agency reportOil prices jumped on Tuesday after the European Commission (EU) leaders reached an agreement on Monday to ban 90 percent of Russian oil imports by the end of 2022.\nThe EU announced on Monday its agreement to ban 90 percent of Russian oil imports by the end of the year as part of sanctions against Moscow for invading Ukraine.\nIn a tweet on Monday, Charles Michel, president of the European Council, said the move would immediately halt 75 percent of Russian oil imports.\n“The sanctions will immediately impact 75 percent of Russian oil imports.\n“We have covered overall 90 percent of Russian oil being winded down during this time frame."
  },
  {
    "headline": "New Materials Nigeria Company to save $100m forex for Nigeria annually",
    "summarized_story": "By our correspondentNew Materials Nigeria Company, a building material company recently commissioned in the Kuje area of Abuja will save Nigeria a whopping sum of $100m in foreign exchange annually when fully operational, its Managing Director, Mr. Jackie Dai Hui has said.\nSpeaking further, the Managing Director said that so far, over $50 million has been invested in the New Materials Nigeria Company explaining that in no distant time, it will grow its investment in Nigeria by establishing a branch in Lagos.\nAccording to him, the establishment of the New Materials Nigeria Company has gone a long way to provide employment to 150 Nigerians both at senior and junior levels who he said are also being trained in various skills.\nWe train Nigerians to run the company; we are transferring technology to those who are brilliant.\n“We can increase our company’s presence in Nigeria because we can source all our raw materials in Nigeria."
  },
  {
    "headline": "NAICOM Inaugurates 15-Man Insurance Industry Committee on AfCFTA",
    "summarized_story": "BY KEHINDE IBRAHIM, LAGOSTHE National Insurance Commission (NAICOM) has inaugurated a fifteen-man Insurance industry committee on African Continental FreeTrade Area (AfCFTA).\nIkechukwu Udobi (ILAN); Chief Lebi Omoboyowa (ILAN); Mr. Usman Jankara (NAICOM); Mr. Taiwo Adeoye (NAICOM) and Mr. Ahmed Metteden (NAICOM) are also members of the committee.\nSpeaking at the inauguration, the Commissioner for Insurance and Chief Executive Officer, National Insurance Commission (NAICOM), Mr. Olorundare Sunday Thomas, the setting up of the committee is part of the Commission’s efforts to effectively exploit the benefits of AfCFTA.\nHe said the Commission has already informed the National Action Committee on AfCFTA of the constitution of the committee including the membership and terms of reference of the Committee.\n‘’We have also enjoined the National Action Committee on AfCFTA to collaborate with the Committee on matters relating to the implementation of the AfCFTA Agreement in order to ensure that it is done in the overall interest of the Nigerian insurance industry.’’ Thomas said."
  },
  {
    "headline": "AIB-N Releases 3 Final Accident Reports",
    "summarized_story": "BY NAOMI DOUGLASAccident Investigation Bureau AIB-N, Nigeria in Abuja released three final accident reports to the public.\nAIB-N Commissioner, Mr Akin Olateru said the reports were essential to the fulfilment of the Bureau’s mandate of investigating aircraft accidents and serious incident with aim of enhancing safety.\nAccording to him, the enhancing safety is actualised through safety recommendations issued toward assuring safe skies in Nigeria and globally.\nAccording to him, the investigation identified causal factor to be excessive rudder and aileron inputs at short finals phase of the approach.\n“Another contributing factor is non-implementation of the Flight Data Monitoring programme in accordance with 2.2.5.1 of Azman Air Safety Management System Manual."
  },
  {
    "headline": "‘Sanwo-Olu, Buni, Ngige’ – APC Sets Up Committees For Special Convention",
    "summarized_story": "The All Progressives Congress has released a list of Sub-Committees chairpersons for its imminent convention where it is expected to elect a 2023 presidential candidate.\nThe list was released on Wednesday by the APC National Publicity Secretary, Felix Morka.\nIt is expected to hold a convention between June 6 and 8 where the presidential candidate is to emerge from about 23 aspirants.\nREAD ALSO: Choose Nigeria First, Not Leaders Who Will Buy Your Votes – Lawan Tells APC DelegatesMeanwhile, President Muhammadu Buhari on Tuesday disclosed his criteria for the ideal presidential candidate of the APC in the 2023 elections.\nThe President made the disclosure while meeting with APC Governors in Abuja, sparking discussions over whether a consensus candidate is in the offing."
  },
  {
    "headline": "Mali Replaces D’Tigress At FIBA World Cup After FG’s Withdrawal",
    "summarized_story": "The world governing body for basketball, FIBA, has replaced Nigeria’s female basketball team, the D’Tigress, with Mali for the FIBA Women’s Basketball World Cup 2022 in Belgrade.\nNigeria was disqualified after President Muhammadu Buhari suspended the country from participating in all international basketball competitions and activities for a period of two years.\n“In subsequent communications with the NBBF, and despite FIBA’s request, it has become clear that against the circumstances created by the government’s decision, the NBBF is unable to confirm its participation in the FIBA Women’s Basketball World Cup 2022.\nand to protect the integrity of the competition, the FIBA Executive Committee has decided as follows:“Nigeria’s withdrawal from the FIBA Women’s Basketball World Cup 2022 is confirmed.\nMali, as the next ranked team from Group B of the FIBA Women’s Basketball World Cup 2022 Qualifying Tournament in Belgrade, is invited to participate in the FIBA Women’s Basketball World Cup 2022“FIBA will announce whether there will be any other decisions related to the NBBF’s participation in other FIBA competitions and any potential disciplinary measures in due course.”"
  },
  {
    "headline": "Atiku Gets Certificate Of Return, Says PDP Will Rescue Nigeria From APC ‘Misrule’",
    "summarized_story": "Atiku Abubakar has received his certificate of return as the presidential candidate of the Peoples Democratic Party (PDP), calling on party members to work together in their mission to rescue Nigeria from the “misrule” of the All Progressives Congress (APC).\nThe former vice president said this on Wednesday at the headquarters of the PDP in Abuja, stating that the party must begin work without delay.\n“The callous and dangerous APC misrule over the past seven years is there for everyone to see.\nI commend our party’s National Executive Committee for putting our party and our country first in its deliberations and decision-making.\nIn his victory speech, Atiku promised to unite Nigerians and give every part of the country a sense of belonging."
  },
  {
    "headline": "Ex-Chief Judge Peter Umeadi Wins APGA Presidential Ticket",
    "summarized_story": "A former Chief Judge of Anambra State, Retired Justice Peter Umeadi, has emerged as the presidential candidate of the All Progressives Grand Alliance (APGA).\nJustice Umeadi who is the sole presidential aspirant of APGA was declared the winner of the primary election of the party on Wednesday.\nThe former chief judge has always canvassed that a Nigerian from the South East be given the opportunity to be the next president.\nUmeadi later met with APGA leadership where he formally declared his intention to contest the 2023 presidential election on the platform of the party.\nWhile seeking the blessing of the party leaders, he stressed that only good leadership could bring a much-needed change in Nigeria."
  },
  {
    "headline": "Rudiger Completes Move To Real Madrid From Chelsea",
    "summarized_story": "German international defender Antonio Rudiger has joined Spanish and European champions Real Madrid from Chelsea, the two clubs confirmed on Thursday.\nThe 29-year-old centre-back, who was out of contract at Chelsea, has signed a four-year deal in the Spanish capital, Real announced.\nIn a statement on their official website, Madrid said Rudiger would be unveiled at a press conference at the club’s training ground on June 20.\nHe then helped Thomas Tuchel’s side to win the Champions League last year.\nRudiger joins a Real side who are fresh from winning the Champions League by beating Liverpool 1-0 in last weekend’s final in Paris."
  },
  {
    "headline": "Rotate power to the South to retain presidency, Akeredolu tells APC",
    "summarized_story": "The Chairman of the Southern Nigeria Governors’ Forum and Ondo State Governor, Oluwarotimi Akeredolu, has charged the party to work hard to retain power by rotating the Presidency to the South.\nIn a short message via his personal Facebook page on Thursday, the Governor re-echoed the position of his colleagues in the Southern Nigeria Governors’ Forum that power should be rotated to the South.\nGovernor Akeredolu noted that the APC must be ready to rotate power so as to retain power, adding that to retain power, the party must rotate to the South.\n“APC must work to retain power.\nWe must rotate power to retain retain power !!!"
  },
  {
    "headline": "APC constitutes 18 sub-committees ahead Presidential primary",
    "summarized_story": "The All Progressives Congress (APC) has formed 18 sub-committees in preparation for the party’s special convention/presidential primary holding June 6th and 8th.\nMuhammad Inuwa Yahaya, Governor of Gombe StateCo-Chair: Minister of Finance, Hajiya Zainab Shamsuna Ahmed2.\n(Dr.) Abdullahi Umar Ganduje, Governor of Kano StateDeputy: Dr. Ramatu Tijani Aliyu, Minister of State for the Federal Capital Territory7.\nBello Muhammad Matawalle, Governor of Zamfara StateCo-Chair: Mohammed Musa Bello, Minister of the Federal Capital Territory12.\nAbubakar Sani Bello, Governor of Niger StateCo-Chair: Rt."
  },
  {
    "headline": "Taraba CAN wants FG to warn clerics over inciting statements",
    "summarized_story": "Taraba State chapter of Christian Association of Nigeria (CAN) has called on the federal government and relevant security agencies to arrest and prosecute clerics involved in the video on viral demanding for sharia law in the state.\nThe video clip attributed to some Islamic clerics advocating for Sharia government in the state shortly after the winner of APC gubernatorial candidate was declared.\nAlthough, All Progressives Congress primaries have been trailed with reactions from the party members in Taraba State.\nThe leadership of TEKAN ECWA Church Blog of CAN, has expressed dismay over a video clip advocating for Sharia government in the state following the emergence of a Christian Guber candidate for the All Progressives Congress.\nThe CAN called on Taraba residents to live as brothers by tolerating one another irrespective of religion affiliations."
  },
  {
    "headline": "Court sentences man to 56 years imprisonment for fraud in Ekiti -",
    "summarized_story": "A 35-year old man, Daramola Oyindamola, has been sentenced to 56 years imprisonment by an Ekiti State High Court over charges of fraud, forgery impersonation and other related offences.\nOyindamola was charged and arraigned on a six-count charge of obtaining money under false pretence, stealing, procuring the execution of documents by false and making documents without authority.\nThe prosecutor, Akinola Abon, Esq called three witnesses to prove his case.\nDelivering his judgment, in Ado-Ekiti, on Tuesday, Justice Olusegun Ogunyemi sentenced Oyindamola on six counts from the uncontroverted evidence adduced by the prosecution before the court.\nOyindamola was convicted and sentenced accordingly by Justice Ogunyemi; on count one, 7 years imprisonment, on count two, he is not guilty, on count three, 14 years imprisonment, on count four, 14 years imprisonment, on count five, 14 years imprisonment and on count six, 7 years imprisonment."
  },
  {
    "headline": "‘Fuel on Fire’: US and Germany Agree to Supply Advanced Weapons to Ukraine",
    "summarized_story": "Andriy Yermak, the head of the Ukrainian president’s office, hailed the new Western weapons.\nAs the new weapons shipments were announced, a Russian missile hit rail lines in the western Lviv region, a key conduit for supplies of Western weapons and other supplies, officials said.\nGermany’s promise of IRIS-T air defense systems would mark the first delivery of long-range air defense weapons to Ukraine since the start of the war.\nGerman Chancellor Olaf Scholz told lawmakers that the IRIS-T’s surface-to-air missiles are the most modern air defense system the country has.\n“With this, we will enable Ukraine to defend an entire city from Russian air attacks,” he said."
  },
  {
    "headline": "Messi Pulls Strings as Argentina Outclass Italy 3-0 in COMMEBOL-UEFA Cup of Champions Match at Wembley",
    "summarized_story": "Argentina marked the revival of the Cup of Champions in style as they outclassed Italy 3-0 in a heavyweight clash billed as the “Finalissima” at a raucous Wembley Stadium on Wednesday.\nWe knew it was going to be an attractive game and a nice setting to be champion,” Messi said after the match.\nArgentina could have scored plenty more after the break with Messi pulling the strings and Italy keeper Gianluigi Donnarumma sparing his side a drubbing.\nThe Finalissima is the revival of the CONMEBOL-UEFA Cup of Champions that has been played only twice before, in 1985 and 1993.\n“Everything changed since we won the Copa America,” Di Maria said."
  },
  {
    "headline": "Gunman Kills Four in Oklahoma Medical Centre",
    "summarized_story": "Armed police then ran towards the medical centre.\nPolice arrived at the medical center three minutes after receiving a call about the shooting on Wednesday afternoon.\nI was very happy with what we know so far regarding the response of our officers,” Dalgleish said.\nTwo weeks before the Uvalde shooting, a white gunman killed 10 people at a supermarket in a Black neighborhood in Buffalo, New York.\nThe Natalie Building contains doctors’ offices including an orthopedic center, Dalgleish said, adding he believed the victims included employees and patients."
  },
  {
    "headline": "Queen Thanks Nation for Its Goodwill as Jubilee Celebrations Begin",
    "summarized_story": "An official photograph of the Queen has been released ahead of celebrations to mark her Platinum Jubilee.\nIn her Jubilee message the monarch thanked people for organising events to celebrate her milestone, saying “many happy memories” would be created.\nThere are also a series of official events starting with Thursday’s Trooping the Colour parade and ending on Sunday with a Jubilee Pageant through London.\nThe monarch is to lead the lighting of the principal Jubilee beacon in a special ceremony at Windsor Castle, Buckingham Palace said.\nAhead of the celebrations, the Queen took a short break at Balmoral Castle, in Aberdeenshire, but returned to Windsor on Tuesday."
  },
  {
    "headline": "Nigeria: Labour Party Crisis Worsens as Court Okays Factional Leader’s Fresh Suit",
    "summarized_story": "The Federal High Court in Abuja has ordered that the Labour Party and some of its officials be served with a fresh suit pertaining to its leadership crisis through a substituted means.\nThe committee members are Salisu Mohammed, Lawson Osagie, Isa Aremu, Baba Aye, Ikpe Ektokudo, Sylvester Ejiofor, and Lucy Offiong.\nHe had explained that he got the post by virtue of his position as Deputy National Chairman of the party when the late National Chairman, Abdulsalam, was in office.\nOkafor had further claimed that Abure announced himself as National Chairman without recourse to the provisions of the party’s constitution, following Abdulsalam’s demise.\nHe had said the LP constitution stipulated that the Deputy National Chairman should act and/or replace the chairman in the event of death or resignation."
  }
]