[
  {
    "headline": "ASUU shuns renegotiation panel inauguration, report ready June",
    "summarized_story": "Our correspondent, who was at the inauguration held at the Federal Ministry of Education, Abuja, on Monday, observed that no ASUU official was present.\nAdamu gave the committee a three-month timeframe to renegotiate all the previous agreements the Federal Government entered into with ASUU, especially the 2009 pact.\nASUU had said it would not be part of any fresh negotiation of the agreements, especially when the previous ones had not been fulfilled.\nAdamu, however, said, “There is no gain saying that the earnest desire of every stakeholder in the Nigerian university system and, indeed, the nation at large is to conclude this re-negotiation within the shortest possible period.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH."
  },
  {
    "headline": "N’Assembly may suspend Electoral Act amendment sought by Buhari",
    "summarized_story": "The National Assembly may suspend the ongoing amendment to the Electoral Act, 2022 based on the request by the President, Major General Muhammadu Buhari (retd.\n), who asked the federal parliament to delete Section 84(14) of the new electoral law, The PUNCH learnt on Monday.\nBuhari had last week conveyed his reservation about the Electoral Act, 2022 to the National Assembly.\nJustice Ekwo restrained the defendants in the suit from removing Section 84 (12) of the Electoral Act or preventing it from being implemented for the purpose of the 2023 general elections.\nThe PDP had dragged Buhari before the court challenging a fresh move to tamper with the newly amended Electoral Act."
  },
  {
    "headline": "Russia Vs Ukraine: World powers should quickly intervene to avert 3rd world war, says Amb Nurudeen Muhammed",
    "summarized_story": "Nigeria’s former Ambassador to Malaysia and Brunei, Alhaji Nurudeen Muhammed has urged the world powers to do everything within their means to quickly restore peace in the ongoing war between Ukraine and Russia, in other to avert a third world war.\nAmbassador Nurudeen Mohammed spoke in an interview with journalists in Ilorin on Sunday on the state of the nation.\n“And then, we may say Kwara North has never had it in recent time, let us move to Kwara North, after that, we sit down again and say Kwara South, this is a completely new system.\nSo he might want to go for the second term, and definitely, we will support him as a party.\nIt’s voters that will take a final decision on who they want, whether they want us to remain or another party."
  },
  {
    "headline": "International Women’s Day: Group celebrates Osinbajo on 65th birthday",
    "summarized_story": "… Calls on Women-friendly VP to declare for PresidencyThe Vice President of the Federal Republic of Nigeria, Professor Yemi Osinbajo is 65-year-old today, on a day the world is celebrating women; the 2022 International Women’s Day with the theme, #BreakTheBias.\n“This is a clear indication that God reigns in the affairs of Yemi Osinbajo, whom many believe is divinely connected.\n“Osinbajo did not only disburse the funds with unrivalled passion, he encouraged market women to see it as an opportunity for them to escape from poverty and move to the next level.\n“This group appreciates the role of Professor Yemi Osinbajo, we recall how he supported the wife of the President, Aisha Buhari, and his own wife, Dolapo, in taking up the issue of gender bills recently, at the National Assembly.\n“We believe strongly in the candidature of Professor Yemi Osinbajo, he is people-focused, he is a leader with the right acumen, and he has the intellectual capacity and the experience that qualifies him to take Nigeria beyond the next level”, the statement reads."
  },
  {
    "headline": "PHOTOS: Sunday Igboho freed from detention",
    "summarized_story": "Yoruba activist, Sunday Igboho was yesterday, released to the leader of Ilana Omo Oodua Worldwide, Professor Banji Akintoye and a French Language Expert, Professor Wale Adeniran.\nAkintoye, in a statement by the Communications Secretary to Ilana Omo Oodua Worldwide, Mr Maxwell Adeleye, described the release of Ighoho as a “triumph of truth over darkness in Yoruba Land.”Also Read:Benin Republic ‘releases’ Sunday Igboho.\nVanguard News Nigeria"
  },
  {
    "headline": "Women’s Day: Don’t forget those in distress – Jaiyesinmi",
    "summarized_story": "As the world celebrates International Women’s Day 2022, the founder of Women Foundation for Nation Building, WINBAFRICA, Dr Bukola Bello Jaiyesimi, has called on government and non-governmental organisations around the world to remember women that are internally displaced, women caught up in wars around the world, girls in the orphanages and destitute and all those who also are in need one way or the other.\nShe stated this in her message to the womenfolk on the celebration of International Women’s Day.\nShe noted that the great potentials locked in these women and girls should not be allowed to die.\nwith a passion for protecting women’s issues.\nIt has the mandate to transform the African society by supporting women to play significant roles in nation-building as well as creating avenues for identifying, raising and supporting women leaders to come together to brainstorm on issues affecting their well-being and generating practical and achievable solutions."
  },
  {
    "headline": "2023: We’re yet to decide on zoning — Abia PDP",
    "summarized_story": "By Steve OkoThe ruling Peoples Democratic Party, PDP in Abia State, has flatly debunked insinuations in some quarters that it had zoned its governorship ticket ahead of the 2023 poll, explaining that the party is yet to take a position on that.\nIn a communique jointly signed by the state Chairman of the party, Rt.\nThe party explained that contrary to the “fabricated propaganda, PDP is still consulting on the matter”.\n“As soon as the party concludes the consultation, it will take vital decisions for the progress of the party”, the communique added.\nThe party said that it has implicit confidence in the maturity of the PDP stakeholders in handling political matters."
  },
  {
    "headline": "Photos of Sunday Igboho after release from prison in Benin",
    "summarized_story": "His lawyer, Yomi Alliyu, confirmed that Igboho was allowed to go for medical checks.\nThe Senior Advocate of Nigeria (SAN) said the agitator entered an agreement not to leave Benin Republic “for any reason”.\nAlliyu credited his freedom to prominent Yoruba personalities Prof Wole Soyinka and Prof Banji Akintoye.\nPhotos of Igboho after his freedom was circulated Monday night by Maxwell Adeleye, Ilana Omo Oodua (IOO) spokesman.\nHe is pictured with Akintoye, his lawyer in Benin, Prof Malik Falola, and IOO Deputy Leader, Prof Wale Adeniran."
  },
  {
    "headline": "Governing council appoints new VC for First Technical University",
    "summarized_story": "The Governing Council of First Technical University, Ibadan, has appointed Professor Adesola Ajayi as Vice-Chancellor of the university.\nThe council made this announcement in a statement made available to DAILY POST by Professor Olanike Adeyemo, Protem Council Chairman.\nThe statement added that Ajayi will succeed the pioneer Vice-Chancellor of the university, Professor Ayobami Salami.\nin Plant Science (First Class Honours) with the best overall result in the Faculty of Agriculture, Obafemi Awolowo University, Ile-Ife in 1991.\n(Plant Science) degree with specialization in Plant Breeding/Seed Production in 1997."
  },
  {
    "headline": "IPOB leader is next – Nnamdi Kanu’s disciple reacts to Sunday Igboho’s release",
    "summarized_story": "Simon Ekpa, a self-acclaimed disciple of Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, has reacted to the release of Yoruba Nation agitator, Sunday Igboho.\nIn a tweet, Ekpa commended the President of Benin Republic for ensuring the release of Igboho.\nFreedom!”Igboho regained freedom on Monday in Cotonou, Benin Republic.\nThe pioneer of Oduduwa Republic was released by the Government of Republic of Benin on Monday.\nThe spokesman said the Government of Benin Republic handed over Igboho IOO leader, Prof. Banji Akintoye."
  },
  {
    "headline": "Sunday Ighoho released, will remain in Benin – Lawyer praises Akintoye, Soyinka",
    "summarized_story": "Yomi Alliyu, the counsel to Sunday Adeyemo, a.k.a Igboho, has confirmed his release from prison.\nIn a statement on Monday, Alliyu said Igboho entered an agreement not to leave the medical centre or Cotonou “for any reason”.\n“Praises should be given to two prominent Yoruba personalities to wit: Prof. Wole Soyinka and Prof. Akintoye for this turn around in our client’s matter”, he noted.\nIgboho and wife, Ropo, fled Nigeria after the authorities declared him wanted for treasonable charges.\nThe incarceration of the activist, still in court in Benin, had been extended by six months after spending the initial six months in prison."
  },
  {
    "headline": "Yoruba Nation: Afenifere reacts to Sunday Igboho’s release",
    "summarized_story": "The Yoruba socio-political organization, Afenifere, has reacted to the release of Sunday Igboho.\nAfenifere’s National Publicity Secretary, Jared Ajayi, described Igboho’s release as a victory for self-determination.\nHe noted that the socio-political body and people of the Southwest are happy over the agitator’s release.\nThe development was disclosed in a statement issued by the umbrella body of Yoruba Self-determination Groups, Ilana Omo Oodua Worldwide.\nThe spokesman said the Government of Benin Republic handed over Igboho IOO leader, Prof. Banji Akintoye."
  },
  {
    "headline": "WAEC: digital certificate to help those with missing documents",
    "summarized_story": "WAEC: digital certificate to help those with missing documentsThe West African Examinations Council (WAEC) has announced plans to launch digital versions of the West African Senior School Certificate (WASSC) from a certain year for those who have lost their originals.\nJust use your phone to access our website and your digital certificate will be there.”Areghan said the digital certificate was one of many initiatives WAEC Nigeria introduced for improved operations of the Council in the last 70 years.\nThe HNO also spoke on digital examination centre locator; digitalising access to WAEC statistics, among others.\n“During the formal opening ceremony, awards will be presented to the winners of the International Excellence and National Distinction awards.\n“Also, the investiture of the vice chairman of Council will take place during the opening ceremony,” he said."
  },
  {
    "headline": "No going back on power rotation, say Christian elders",
    "summarized_story": "No going back on power rotation, say Christian eldersSouthern Nigeria Christian elders yesterday backed calls for North-South power rotation.\nThe elders also urged Southern governors to back a candidate from the Southeast for president.\nIn a communique issued in Enugu after a meeting of the Southern Nigeria Christian Vanguard, the elders said zoning the presidency seat to the South would foster peace and unity.\n“We are also calling on all the killer herdsmen, bandits and unknown gunmen to leave Southern Nigeria in peace.\n“Presidential aspirants who lack what it takes to turn around the fortunes of this country should give way,” the Christian group said."
  },
  {
    "headline": "JAMB probes six centres for alleged exploitation, warns vendors",
    "summarized_story": "The Joint Admissions and Matriculation Board (JAMB) has said it is investigating six accredited Computer-Based Tests (CBT) centres for alleged exploitation of candidates in its ongoing registration.\nJAMB listed the affected centres to include Covenant Polytechnic, Centre 2, opposite Naval Base, Aba, Abia State and XYZ Technologies, New Secretariat, Umuahia, Abia State.\nOthers are: Rollings King Info Tech and Management Technology, Ikot Ikpene, Akwa Ibom State; Alsauda Global Investment Limited, Kawaji, Kano, and Success CBT Centre, College Road, Success Bus Stop, Lisaluwa, Ondo State.\nJAMB also listed College of Education on Sokoto Road, Maru, Zamfara State, among the centres under watch.\nThe board warned all its e-PIN vendors to monitor the activities of their agents, saying the board would not tolerate any fraudulent act."
  },
  {
    "headline": "NEITI: 51 oil, gas firms owe Fed Govt N1.32tr",
    "summarized_story": "Exactly 51 oil and gas companies owe the Federal Government N1.32 trillion, the Nigerian Extractive Industries Transparency Initiative (NEITI) stated in its 2020 report.\nThe NEITI 2020 oil and gas industry report was unveiled in Abuja yesterday.\nThe organisation said the total subsidy claim was N133.7 billion with a balance of N26.74billion.\nIn the period under review, the report said the country lost $44.73million (N15.71billion) to crude oil and product theft.\nNEITI also said oil and gas contribution to government revenue was N4.7 trillion while total revenue was N9.3 trillion."
  },
  {
    "headline": "Court bars National Assembly from amending Electoral Act",
    "summarized_story": "The Federal High Court in Abuja yesterday restrained the Federal Government from refusing to implement the Electoral Act 2022 as it is.\nIt ordered President Muhamadu Buhari, the Attorney-General of the Federation (AGF), the Independent National Electoral Commission (INEC), the Senate President, House of Representatives Speaker to implement the law without any immediate alteration to it as suggested by the President.\nJustice Inyang Ekwo restrained the Senate President, the Speaker, INEC and seven others from acceding to President Buhari’s request that the National Assembly reworks the new Electoral Act by deleting Section 84(12).\nThe ruling was on a motion ex-parte for interim injunctions, marked: FHC/ABJ/CS/247/2022 filed by the Peoples Democratic Party (PDP).\nJustice Ekwo, after listening to the PDP’s counsel, James Onoja (SAN), who argued the motion, issued an order of interim injunction restraining the defendants and their agents."
  },
  {
    "headline": "Body of missing Bamise found dead on Lagos bridge",
    "summarized_story": "By Christopher OjiThe body of Bamise who went missing on a Bus Rapid Transit vehicle (BRR)being managed by the Lagos Bus Service Limited, has been found on bridge of Ebute- Ero, Lagos Island on Sunday.\nAlso, the guarantor of the BRT driver has been arrested by the Police.\nThe victim’s mother has urged the government and the police to track down the fleeing bus driver.\nIt was when they contacted one of her colleagues that we were informed that she went missing in a BRT bus she boarded.\n“The last time she heard from her was when she boarded the BRT bus."
  },
  {
    "headline": "Body of missing Bamise found dead on Lagos bridge",
    "summarized_story": "By Christopher OjiThe body of Bamise who went missing on a Bus Rapid Transit vehicle (BRR)being managed by the Lagos Bus Service Limited, has been found on bridge of Ebute- Ero, Lagos Island on Sunday.\nAlso, the guarantor of the BRT driver has been arrested by the Police.\nThe victim’s mother has urged the government and the police to track down the fleeing bus driver.\nIt was when they contacted one of her colleagues that we were informed that she went missing in a BRT bus she boarded.\n“The last time she heard from her was when she boarded the BRT bus."
  },
  {
    "headline": "FG warns against recruitment of Nigerians to fight in Ukraine",
    "summarized_story": "From Aidoghie Paulinus, AbujaThe Federal Government, has warned against the recruitment of Nigerians as mercenaries to fight on the side of Ukraine in the ongoing Russia-Ukraine conflict.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nThe warning by the government is sequel to recent reports in the media that over 100 Nigerians have signified interest at the Ukrainian Embassy, Abuja, to be enlisted as volunteers to strengthen the Ukraine forces.\nThe Ukrainian Embassy was also reported to have told the would-be fighters to provide $1,000 for ticket and visa, even as it assured them of the same emoluments as Ukrainian soldiers.\nThe Federal Government further said it will continue to engage with the Embassy of Ukraine in Nigeria and other relevant authorities to prevent the possibility of the recruitment."
  },
  {
    "headline": "BREAKING: Niger Gov, Bello-led CECPC takes over APC Hqts",
    "summarized_story": "From Romanus Ugwu, AbujaThe All Progressive Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC) faction led by the Governor of Niger State, Sani Bello, actualized their threat to sack the Governor Mai Mala Buni-led faction, when it stormed the national secretariat of the party and took over the party structure.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nClick here to see how you too can get paid .\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nInterestingly, despite dismissing the purported change in leadership, the Secretary Caretaker Committee was equally in attendance at the meeting currently going on at the secretariat with Governor Bello presiding."
  },
  {
    "headline": "BREAKING: Concaine Saga: Two plead guilty in charges against DCP Kyari",
    "summarized_story": "From Godwin Tsa, AbujaTwo suspects in the drug charge against the suspended Deputy Commissioner of Police (DCP), Abba Kyari, Chibunna Patrick Umeibe and Emeka Alfonsus Ezenwanne have pleaded guilty to three charges against them.\nIt was however a different plea for DCP Kyari, ACP Sunday Ubia; ASP James Bawa, Inspector Simon Agirigba and Inspector John Nuhu who all pleaded not guilty to the charges against them.\nBecome a partner with USA companies, promote their offers and get paid in US Dollars weekly, Nigerians are earning about $465 weekly.\nOkeyni all appeared for ASP James Bawa, Inspector Simon Agirigba ; Inspector John Nuhu; Chibunna Patrick Umeibe and Emeka Alfonsus Ezenwanne respectively.\nThey are expected to be arraigned before Justice Emeka Nwite of the Abuja division of the Federal High Court (FHC)."
  },
  {
    "headline": "Beninese Govt Releases Sunday Ighoho from Custody",
    "summarized_story": "Segun JamesEight months after he was arrested in the Republic of Benin while trying to board a flight to Germany, Yoruba Nation Activist, Chief Sunday Adeyemi, popularly known as Sunday Igboho, has been released by the Beninese government.\nA press statement Monday by the Leader of the Yoruba Self-determination group, Ilana Omo Oodua Worldwide, Professor Banji Akintoye, and a French Language Expert/Deputy Alana of Ilana Omo Oodua Worldwide, Professor Wale Adeniran, said Igboho was released on Monday.\nIn the statement by the Communications Secretary to Ilana Omo Oodua Worldwide, Mr. Maxwell Adeleye, Akintoye described the release of Ighoho as a triumph of truth over darkness in Yoruba land.\nAlthough it could not be immediately confirmed why the release was hurriedly done given the fact he still has case before Beninese court, Igboho was said to be down with kidney and lung diseases contracted during his incarceration.\nHis lawyer, Yomi Alliyu said he was in hospital most of the time as he battled the ailments."
  },
  {
    "headline": "Breaking: Niger Gov Bello Arrives APC Secretariat, Meets Caretaker Committee Members",
    "summarized_story": "Adedayo Akinwale in AbujaThe Governor of Niger state, Abubakar Bello has arrived the national secretariat of the All Progressives Congress (APC) and already meeting with the members of the Caretaker/Extraordinary Convention Planning Committee (CECPC) of the partyThe meeting has nine out of the twelve members of the Caretaker Committee of the party in attendance.\nThe secretary of the party, Sen. John Akpanudoedehe, who had earlier denied a leadership change in the party is also at the meeting.\nTHISDAY had exclusively reported that President Muhammadu Buhari had approved the removal of the Yobe State Governor, Mai Mala Buni, as Chairman, Caretaker/Extraordinary Convention Planning Committee (CECPC) of the party and in his stead, appointed his Niger State counterpart, Abubakar Sani Bello.\nBello has taken over the affairs of the party as the ‘sole administrator’ of the party, it was gathered.\nHe said: “Our attention has been drawn to sponsored media reports on an imaginary leadership change in the All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC)."
  },
  {
    "headline": "UBA Posts N153bn Profit, Records 11% Balance Sheet Growth",
    "summarized_story": "Similarly, its net loans grew by 7.7 per cent to N2.8 trillion, whilst customer deposits rose by 12.2 per cent to N6.4 trillion, compared to N5.7 trillion in the corresponding period of 2020.\n“This will ensure the bank continues to achieve respectable top and bottom-line growth through the medium to long term,” the GMD stated.\nUBA’s Group Chief Financial Official, Ugo Nwaghodoh, who corroborated the GMD’s comments, said, once again, the bank has shown resilience.\nIt achieved sizeable growth and strengthened its balance sheet despite the slow pace of economic recovery that characterised the year 2021.\n“The Group’s non-performing loan ratio improved further to 3.6 per cent from 4.7 per cent at the end of 2020."
  },
  {
    "headline": "In Dramatic Move, Buhari Orders Buni’s Removal as Malami, SGF, Urge Caution",
    "summarized_story": "The meeting will be chaired by the Niger State governor, because Buni is out of town.\nHis words: “I am using this medium to call on our leaders across the states to caution Governor Sani Bello of Niger State.\nGovernor Bello should not destroy the ruling APC, because of his personal political ambition of becoming Vice President or whatever in 2023,” he added.\nProviding an insight into the work that was done by the committee, the source revealed that they agreed to zone the National Chairman to the north-central; the Deputy National Chairman (north) to the north-east; the Secretary to the south-west and Deputy National Chairman (south) to the south-east.\n“These prophets of doom have continued to render false prophecies and tales on the forthcoming APC national convention."
  },
  {
    "headline": "Agriculture Remains Backbone of Nigeria’s Economy, Says CBN",
    "summarized_story": "James Emejo in Abuja*Hails strides in maize, cassava productionGovernor of Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, says agriculture remains a strong pillar and saving grace for the Nigerian economy.\nEmefiele said this at the weekend while addressing journalists during an inspection tour of a palm plantation at Odighi Village in Ovia North East Local Government Area of Edo State.\nThe CBN governor expressed satisfaction with the level of interest shown in agriculture and the tremendous impact the sector had had in the last six years.\nHe acknowledged the significant role played by Edo State Government, under the leadership of Governor Godwin Obaseki, who he said had matched words with action by making sure that arable land was made available to those genuinely interested in agriculture.\nHe appealed to other state governors to emulate Edo State, which had so far made available about 70 per cent of the promised arable land."
  },
  {
    "headline": "BREAKING: Sunday Igboho Released From Detention In Benin Republic",
    "summarized_story": "Yoruba Nation agitator, Sunday Adeyemo, otherwise known as Sunday Igboho, has been released from the detention of the Benin Republic government.\nThe umbrella body of Yoruba self-determination groups, Ilana Omo Oodua, confirmed this in a press release on Monday.\nSunday IgbohoIgboho was released to renowned Yoruba historian, Prof Banji Akintoye, the statement said.\nMore details later"
  },
  {
    "headline": "BREAKING: Sunday Igboho Released From Detention In Benin Republic",
    "summarized_story": "Yoruba Nation agitator, Sunday Adeyemo, otherwise known as Sunday Igboho, has been released from the detention of the Benin Republic government.\nThe umbrella body of Yoruba self-determination groups, Ilana Omo Oodua, confirmed this in a press release on Monday.\nSunday IgbohoIgboho was released to renowned Yoruba historian, Prof Banji Akintoye, the statement said.\nMore details later"
  },
  {
    "headline": "BREAKING: Disgraced 'Supercop' Abba Kyari, Six Others Arrive In Abuja Court Over Alleged Drug Trafficking",
    "summarized_story": "The suspended Deputy Commissioner of Police, DCP, Abba Kyari and six others have arrived at a Federal High Court in Abuja.\nThe Nigerian government had said it would arraign Kyari on eight counts bordering on drug trafficking on Monday.\nKyari, alongside six others, will be arraigned by the National Drug Law Enforcement Agency (NDLEA) before Justice Emeka Nwite of a Federal High Court (FHC), Abuja.\nMeanwhile, a human rights lawyer, Inibehe Effiong had urged the agency to stay action on filing charges against the disgraced police chief, Kyari.\nThe NDLEA on Monday however said it had filed charges against Kyari and others since February 28."
  },
  {
    "headline": "BREAKING: Disgraced 'Supercop' Abba Kyari, Six Others Arrive In Abuja Court Over Alleged Drug Trafficking",
    "summarized_story": "The suspended Deputy Commissioner of Police, DCP, Abba Kyari and six others have arrived at a Federal High Court in Abuja.\nThe Nigerian government had said it would arraign Kyari on eight counts bordering on drug trafficking on Monday.\nKyari, alongside six others, will be arraigned by the National Drug Law Enforcement Agency (NDLEA) before Justice Emeka Nwite of a Federal High Court (FHC), Abuja.\nMeanwhile, a human rights lawyer, Inibehe Effiong had urged the agency to stay action on filing charges against the disgraced police chief, Kyari.\nThe NDLEA on Monday however said it had filed charges against Kyari and others since February 28."
  },
  {
    "headline": "Yoruba Nation Leader, Akintoye, Sunday Igboho, Others Pictured In High Spirits After Agitator Regained Freedom",
    "summarized_story": "Ilana Omo Oodua Worldwide, a Yoruba self-determination group, has released photographs showing Sunday Adeyemo, Yoruba Nation activist, more commonly known as Sunday Igboho, after his release from detention and handing over to Prof Banji Akintoye, the leader of the Yoruba Nation groups.\nThe photographs from the group confirmed Igboho's release as the agitator was pictured among the Ilana Omo Oodua leaders, Prof Banji Akintoye; Prof Wale Adeniran and his Benin Republic based lawyer, Prof Malik Falola.\nIgboho was also flanked by his wife among other supporters who were at his Benin Republic residence on Monday.\nIgboho had been detained in a prison facility in the Republic of Benin, after he was arrested with Ropo, his wife, at Cardinal Bernardin International Airport, Cotonou, while on his way to Germany in July 2021.\nMaxwell Adeleye, spokesperson for the Ilana Omo Oodua group wrote, ”Renowned Historian and Leader of Ilana Omo Oodua Worldwide, Professor Banji Akintoye, Yoruba Nation Activist, Chief Sunday Adeyemo Igboho, Igboho's Lawyer in Benin Republic, Professor Malik Falola, Deputy Leader of Ilana Omo Oodua Worldwide, Professor Wale Adeniran, Igboho's wife, Ropo, in a group photograph at Igboho's Residence in Cotonou, Benin Republic today Monday 7th March, 2022.\""
  },
  {
    "headline": "BRT driver: Gunmen attacked us, dragged Bamise down from moving bus",
    "summarized_story": "Andrew Nice, the driver of the Bus Rapid Transit (BRT) vehicle which was boarded by Oluwabamise Ayanwola, the late 22-year-old fashion designer, says they were attacked by gunmen during the trip.\nBamise went missing after she boarded a BRT vehicle from Chevron bus-stop, Ajah, to Oshodi around 7pm on February 26.\nThe police, on Monday, said Bamise’s corpse was found on Carter bridge at Ogogoro cvommunity, Lagos Island.\nSpeaking with TVC when he was paraded by the police, the driver claimed that three men bearing arms boarded the BRT bus alongside Bamise during the trip.\nThe driver said the three gunmen ordered him to stop at Carter bridge, after which they dragged Bamise out of the bus."
  },
  {
    "headline": "BRT driver: Gunmen attacked us, dragged Bamise down from moving bus",
    "summarized_story": "Andrew Nice, the driver of the Bus Rapid Transit (BRT) vehicle which was boarded by Oluwabamise Ayanwola, the late 22-year-old fashion designer, says they were attacked by gunmen during the trip.\nBamise went missing after she boarded a BRT vehicle from Chevron bus-stop, Ajah, to Oshodi around 7pm on February 26.\nThe police, on Monday, said Bamise’s corpse was found on Carter bridge at Ogogoro cvommunity, Lagos Island.\nSpeaking with TVC when he was paraded by the police, the driver claimed that three men bearing arms boarded the BRT bus alongside Bamise during the trip.\nThe driver said the three gunmen ordered him to stop at Carter bridge, after which they dragged Bamise out of the bus."
  },
  {
    "headline": "Edo deputy governor: Why Obaseki's supporters don't feel welcome in PDP",
    "summarized_story": "Philip Shaibu, deputy governor of Edo, has asked the national leadership of the Peoples Democratic Party (PDP) to “integrate” supporters of Godwin Obaseki, governor of the state, into the party.\nAdvertisementReacting to the speculation, the Edo governor, over the weekend, said he will not leave the PDP, and asked members who are uncomfortable with his leadership of the party to leave.\nSpeaking on the issues in Edo PDP in an interview on Channels Television on Monday, Shaibu said Obaseki’s supporters who left the APC for the PDP do not feel like they have been accepted into the party.\nFor Philip Shaibu, his followers, and the followers of Obaseki that left APC to PDP, they plan to leave PDP but to where?\n“We left APC because of the oppression by APC national chairman meted on the governor."
  },
  {
    "headline": "Edo deputy governor: Why Obaseki's supporters don't feel welcome in PDP",
    "summarized_story": "Philip Shaibu, deputy governor of Edo, has asked the national leadership of the Peoples Democratic Party (PDP) to “integrate” supporters of Godwin Obaseki, governor of the state, into the party.\nAdvertisementReacting to the speculation, the Edo governor, over the weekend, said he will not leave the PDP, and asked members who are uncomfortable with his leadership of the party to leave.\nSpeaking on the issues in Edo PDP in an interview on Channels Television on Monday, Shaibu said Obaseki’s supporters who left the APC for the PDP do not feel like they have been accepted into the party.\nFor Philip Shaibu, his followers, and the followers of Obaseki that left APC to PDP, they plan to leave PDP but to where?\n“We left APC because of the oppression by APC national chairman meted on the governor."
  },
  {
    "headline": "Ex-SSG, ‘dancing senator’ and his nephew -- top contenders for Osun PDP guber primary",
    "summarized_story": "“My ambition to govern Osun state is people-driven.\nWe are not afraid to face the delegates at the primary and the people of Osun state at the general election,” he had said.\nAt the 2018 PDP primary, Adeleke won by a close margin, securing 1569 votes while Akin Ogunbiyi, his closest contender, had 1562.\nIt’s barely 24 hours to the primary election, and spectators are wondering if the former banker and his uncle would attempt a compromise.\nAkin OgunbiyiAkin Ogunbiyi has been a major player in Osun PDP for some time, in fact, he placed a very close second in the 2018 primary election of the party."
  },
  {
    "headline": "Togolese inventor builds $12,000 mini tractors for the West African market",
    "summarized_story": "It’s a step out of the kitchen and into the field for this award-winning Togolese inventor.\nBetter known in Togo and the region as the “father of Foufoumix” Logou requires little introduction to those who keep an eye on the world of African invention.\nLogou tries to provide local solutions to local problems.\nThe prototype for the tractor, which retails for the local equivalent of $12,000, was built using salvaged parts, with the idea that doing so would help buyers easily access spare parts.\n“I can’t stay in recovery or recycling anymore and I am now manufacturing some of the spare parts of this machinery myself,” he explained."
  },
  {
    "headline": "Vault Hill is building a human-centric metaverse. What about it?",
    "summarized_story": "To differentiate itself from other virtual spaces and metaverse, Vault Hill City (Vault Hill’s Metaverse) has four different islands and each island has 7 human-themed districts: Play, Romance, Curiosity, Community, Idealism, Vitality, and Imagination.\nVault Hill is also partnering with Ready Player Me to build out avatars and incorporate digital wearables and limited-edition accessories.\nThat is, using one avatar across multiple metaverses instead of having to create one for Vault Hill, and another for Decentraland,” Vault Hill said.\nVault Hill Part is also partnering with Lingua54 to use machine learning to translate the speeches of avatars across different languages in real time.\nThe first glance of Vault Hill City will be up by Q2 2022 and by the end of the year, it will be fully running."
  },
  {
    "headline": "Two years and 3 million rides later, can SafeBoda keep its lead in Nigeria?",
    "summarized_story": "On Wednesday, Ibadan-based Ugandan bike hailing startup SafeBoda clocked two years of operating in the Nigerian market.\nAnd by the end of the year, while it was pausing its Kenyan operation, it celebrated half a million rides in Nigeria.\nFast forward to today, SafeBoda claims to have recorded over 3 million rides, more than 10,000 riders, over 100,000 users, and completed 50,000 deliveries.\nThe startup currently offers 3 services in Nigeria: rides, deliveries, and airtime purchase.\nSafeBoda riders are highly regarded and respected, not just because of the colour but because of their conduct,” said Clement Obaro, Growth Manager at SafeBoda."
  },
  {
    "headline": "Facebook content moderators in Kenya to receive 30-50% pay raise, following complaints",
    "summarized_story": "Facebook content moderators in Kenya will receive a 30-50% pay rise.\nAlthough the pay raise is welcomed by many of the content moderators, some still say it’s not enough.\nWhile the lowest starting salary of a Facebook content moderator at Sama is $2.20 per hour, outsourced content moderators for Facebook in the U.S. are paid a typical starting salary of $18 per hour.\nMeta, Facebook’s parent company also declined to comment on the announcement of the pay raise.\nThe announcement of the pay raise is seen as a win for the content moderators and validation of the power in employees speaking up."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, What comes to mind when you hear the term \"financial inclusion\"?\nI asked because it has become a..."
  },
  {
    "headline": "How Nigerian startups raised over $1 billion in 2021",
    "summarized_story": "Share this article:The fourth annual edition of the Nigerian Startup Funding Report was released last week.\nThe Report was started to curate, break down, and analyse the funding activities of Nigerian tech startups; so far, 12 editions have been released.\nIn fulfilling our promise to provide insightful data about the Nigerian technology startup space, we present the Nigerian Startup Funding Report 2021.\nIn January 2021, we started a monthly newsletter featuring analyses of Africa’s tech startup scene.\nSubscribers to the Intelligence by Techpoint newsletter had access to this report last week."
  },
  {
    "headline": "Did you read your employee contract? Truly?",
    "summarized_story": "Although the ban was eventually lifted, as a Twitter poll conducted by Techpoint Africa suggests, Nigerians consider a similar occurrence highly likely.\nOne thing is sure; there’s quite a lot to unpack in the governance and policy aisle of the Nigeria tech scene.\nLast week, technology policy and advisory and research firm, Tech Hive Advisory, in partnership with Ikigai innovation Initiative, a tech policy-focused NGO, released the State of Tech Policy in Nigeria 2022.\nAdvertisementFor context, the Nigeria Data Protection Regulation was released in 2019, and a Data Protection Bill was proposed in 2020.\nDid you read your employee contract?"
  },
  {
    "headline": "S2PAfrica holds its 2022 Regional Engineering Design Competition(EDC) Awards Ceremony",
    "summarized_story": "Share this article:S2PAfrica, a non-profit organisation aiming to groom professional engineers in Sub-saharan Africa, held its annual regional engineering design competition(EDC) awards ceremony on February 26, 2022.\nDr Nadu Denloye, current Chair, ICT committee, the Nigerian Academy of Engineering (NAE), served as the chair for the Engineering design competition.\nTeam EASS won the Energy efficiency category prize of $500, while Team Capture won the Harnessing Ignored Energy category prize of $500.\nThe S2PAfrica regional engineering design awards were announced, starting with the second runner-up award, which Team Improved Charcoal Stove won.\nTeam Koye was announced the winner of the 2022 S2PAfrica regional engineering design competition."
  },
  {
    "headline": "ASUU Industrial Action and Public Education In Nigeria – Nigerian Observer",
    "summarized_story": "ASUU has further blamed the Federal Government of levity in handing education, rather than entrenching policy system that can prioritise all critical sectors in the country.\nLooking through the positions of both ASUU and the Federal Government, they appeared determined and positive towards the betterment of the Education system and resolving the present challenge in the country.\nGood Education system anywhere in the world is a knowledge fountain.\nThe roads, bridges, technology, interpersonal relations, science researches and methods of achieving designed objectives are all derivable from a well co-ordinated knowledge driven education system.\nIn the case of Nigeria we are always overwhelmed by lack of funds and lack of motivation as a result of rambling education and a pitiful policy system."
  },
  {
    "headline": "Vice President Yemi Osinbajo Seeks Constitutional Roles For Traditional Rulers – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestWarri – In the face of rising insecurity across the country, Vice President Professor Yemi Osinbajo has called for constitutional roles for traditional rulers across the country in order to stem the ugly tide.\n“About three or four years ago, I and the Deputy Governor of Delta State, have been working assiduously in bringing down the insecurity we faced in the past.\nOsinbajo emphasized that, the nation’s desire was to see that security challenges in Delta State were brought to an end in most of the oil-producing communities.\n“We recognize, especially with security that very few administrations had been confronted with this plethora of security challenges that we have been confronted with.\nThe Vice President was in Delta State for the Thanksgiving ceremony of late Chief Patrick Ideh, aged 95, a nationalist lawyer since 1961."
  },
  {
    "headline": "Osinbajo now in charge – Buhari – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe President of the Federal Republic of Nigeria, Major General Muhammadu Buhari (retd.\nBuhari stated this when he fielded questions from State House correspondents shortly before departing the Presidential Wing of the Nnamdi Azikiwe International Airport, Abuja, for London on Sunday.\nAccording to the presidential aide, Femi Adesina, Buhari is expected to be in London for two weeks.\nThe Presidency had on Friday in Abuja said the President’s return to Abuja from Nairobi does not abort his earlier scheduled trip to the United Kingdom for a routine medical checkup.\nOn the London trip, Buhari said,”Well, I cannot claim to be doing the work alone."
  },
  {
    "headline": "I’m not leaving PDP for anyone; accept my leadership or leave – Obaseki to detractors – Nigerian Observer",
    "summarized_story": "I’m not leaving PDP for anyone; accept my leadership or leave – Obaseki to detractorsShare FacebookTwitterStumbleuponLinkedInPinterest… Edo sets for council polls, as PDP registers over 539,000 membersThe Edo State Governor, Mr. Godwin Obaseki, at the weekend, said he has no plan of defecting from the Peoples Democratic Party (PDP), urging anyone who is uncomfortable with his leadership of the party to leave.\nHe noted, “There is no division in Edo PDP.\n“I heard that Chief Dan Orbih went around, saying there is no harmonization in Edo PDP.\nThe Chairman PDP Edo State, Anthony Aziegbemi, noted that “Edo State is the only state in the nation that has surpassed the 500,000 thresholds for e-registration of the party.”Others at the meeting include the Deputy Governor of Edo State, Rt.\nComrade Philip Shaibu; Speaker of Edo State House of Assembly (EDHA), Hon."
  },
  {
    "headline": "Hope rises for Naira as CBN moves to weaken parallel market",
    "summarized_story": "The CBN had last week released implementation guidelines for its newly created RT200 Non-oil Export Proceeds Repatriation Rebate Scheme, highlighting its exporters responsibilities and benefits.\nEmefiele had said, The RT200 FX Programme is a set of policies, plans and programmes for non-oil exports that will enable us attain our lofty yet attainable goal of US$200 billion in FX repatriation, exclusively from non-oil exports, over the next 3-5 years.\nThe RT200 initiative is anchored on five key areas which are; value-adding export facility, non-oil commodity expansion facility, non-oil export rebate scheme, non-oil export terminal financing and bi-annual non-oil export summit.\n“The reality is that supply-side policies are even more critical and impactful than demand management interventions in the foreign exchange market.\nOver the last couple of years, the CBN has been fixated on managing the demand side of the foreign exchange market and the outcomes have been suboptimal,” he said."
  },
  {
    "headline": "Russia vs Ukraine: Time ticks for WW III",
    "summarized_story": "But World War III has never been closer.\nAnything that we do that results in killing Russians puts us into World War III.\nBut let me be clear: Our forces are not engaged and will not engage in the conflict with Russian forces in Ukraine.\nThe official said the war in Ukraine was far more dangerous than anything Europe has seen since the end of World War II, including the Balkan wars of the 1990s.\nAs horrible as that was, the official said, this is worse, with the potential of getting a real European war, or a world war very quickly."
  },
  {
    "headline": "2023: Emefiele’s alleged ambition rattles political parties",
    "summarized_story": "Indeed, only few individuals could have contemplated a possible power bid by the cool headed governor of the Central Bank of Nigeria (CBN) who has practically no experience in party politics.\n“The idea is that he (Emefiele) as president is unlikely to distort the order Buhari has established in the polity,” a source who preferred anonymity said.\nGroups Drum SupportMeanwhile, a number of groups have come out to demand that the CBN governor throws his hat in the ring.\nThis forum has come together to plead and beg Dr. Godwin Emefiele to run as president of Nigeria in 2023, Fapounda said.\nI can assure you that it’s not for nothing that top businesses owners like Dangote are part of the Emefiele presidential project,” he said."
  },
  {
    "headline": "Osun PDP Primary: Dele Adeleke withdraws from the race",
    "summarized_story": "By Sunday Oguntuyi, OsogboDele Adeleke, one of the aspirants for the governorship ticket of the People’s Democratic Party in Osun State, has quit the race.\nAdeleke whose intention to run for governor put him in a collision course with his uncle, Ademola Adeleke, noted in a letter announcing his decision to quit, that his passion for the state remained intact.\nAdeleke in a withdrawal letter titled “MY CONVICTION REMAINS, REBUILDING OSUN IS A TASK WE MUST UNDERTAKE,” stated that, he remained resolute in working interdem with the resolution of the party elders in the state.\nThe statement reads, “My journey in the past few months was one of conviction; conviction rooted in my strong belief that Osun deserves to get a more visionary and positively impactful leadership, headed by a young, virile and result-oriented person.\nI respect this decision and believe in their capacity to lead us to victory”“In the light of this, I have, having adequately briefed my Coordinators and supporters, taken the very difficult decision to withdraw from the PDP Governorship race."
  },
  {
    "headline": "JUST-IN: Security Personnel Take Over APC Secretariat",
    "summarized_story": "Security operatives have cordoned the national secretariat of the All Progressives Congress (APC) in Abuja, preventing staff and party members from entering and going out of the place.\nAlso, the road leading to the secretariat has be bclised, making it impossible for motorists to access the road.\nAccording the reports, Niger State governor, Sani Bello, had been asked to take over party affair in the interim.\nHowever, secretary of the national caretaker committee, Senator John James Akpanudoedehe, denied any change of leadership in the party, describing it as fake news.\nThe APC is a progressive political party guided by rules."
  },
  {
    "headline": "Gov Diri, Dickson Bag Chieftaincy Titles",
    "summarized_story": "The former Bayelsa State Governor and Senator representing Bayelsa West Senatorial District in the 9th Senate of the Federal Republic of Nigeria, Senator Henry Seriake Dickson has been conferred with the Chieftaincy title of Utoron (1) of Ataba Kingdom, Andoni, Rivers State.\nHe was conferred with the title on Saturday, alongside the Bayelsa State Governor, Senator Douye Diri, who was conferred with the title of Oroata (1) of Ataba Kingdom.\nADVERTISEMENT“My brother, the Governor of Bayelsa State, HE Senator Douye Diri was equally conferred the title, Oroata (i) of Ataba Kingdom, which means, one who does good”.\nResponding after the conferment of the chieftaincy titles on them, Senator Dickson, speaking on behalf of Governor Diri, thanked H.R.H, King Benson Mgbowaji Egwenre, JP.\nSenator Dickson further narrated how their son, Mr. Erasmus Patrick has been a Bayelsan friend, a colleague and a stalwart of the INC."
  },
  {
    "headline": "BREAKING: NDLEA Arraigns Abba Kyari, Others In Court",
    "summarized_story": "The suspended Deputy Commissioner of Police, Abba Kyari, has been arraigned before a Federal High Court in Abuja on Monday.\nHe was arraigned alongside six others before the court on eight-count charges bordering on conspiracy, obstruction, and dealing in cocaine, and other related offences.\nDetails Later…ADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "2023: Northern APC Youths To Buy Umahi’s Presidential Forms",
    "summarized_story": "The Concerned Northern APC Youth Forum yesterday said it concluded arrangements to buy the APC presidential forms of intent for Ebonyi State governor, David Umahi.\nThe group stated this while reiterating commitment to the candidature of His Excellency, Engr.\nDavid Umahi to be the President of the Federal Republic of Nigeria, come 2023.\nSuleiman Liba, in a statement, pleaded with all stakeholders and intending presidential aspirants, especially those from the South East to form a consensus and support the candidature of Engr.\nUmahi has enjoyed across board, all over the country in recent years.”They also said plans in full gear to stage a million man march across the entire Northern states of Nigeria in solidarity with Engr."
  },
  {
    "headline": "‘Patronising Locally Made Products Will Boost Economy, Strengthen Forex’",
    "summarized_story": "Stakeholders have advocated Nigerians’ patronage of locally made products to boost the economy and strengthen forex reserves.\nNigerians have continued to spend the nation’s foreign reserves in the importation of finished consumer products that could be sourced locally.\nShe however urged Nigerians and Africans to patronise locally made goods, adding that “We are Nigerians!\neverything that we need and will ever need have been provided for us in Nigeria and Africa at large.\nThe products on the online platform have been tested and they are of good quality.”She however assured that the ChildAfrique online market will boost Nigeria economy and that of Africa, create more jobs for Africans and strengthen Africa’s forex reserves, while urging Africans to patronise locally made products."
  },
  {
    "headline": "Updated: Igboho can’t go home yet, lawyer reveals Soyinka’s role",
    "summarized_story": "Yoruba Nation agitator Sunday Adeyemo a.k.a Sunday Igboho, cannot leave Cotonou, Benin Republic, though he is out of prison.\nHis lawyer Yomi Aliyyu, a Senior Advocate of Nigeria (SAN), said Igboho was only released from jail for medical reasons.\nHe also revealed the role played by Professor Wole Soyinka and leader of Ilana Yoruba, Professor Banji Akintoye.\n“Praises should be given to two prominent Yoruba personalities to wit Prof Wole Soyinka and Prof Akintoye for this turn around in our client’s matter”.\nEarlier reports had screamed that Igboho had been freed after spending over 231 days in Benin Republic prison."
  },
  {
    "headline": "Court jails 5 Yahoo Boys in Ilorin",
    "summarized_story": "By Mujidat OyewoleThe Federal High Court in Ilorin on Monday sentenced five Yahoo boys to various jail terms, for offences bordering on cybercrimes and other internet related fraud.\nDelivering judgment, Justice Muhammed Sani, pronounced the defendants guilty, having found merit in the prosecutors’ case.\nThe court ordered that the Apple iPhone 6, used as instrument of the crime, be forfeited to the Federal Government.\nFollowing their guilt pleas, the prosecutors; Aliyu Adebayo, Andrew Akoja and Rasheedat Alao, informed the court of the plea bargain agreements, entered by the defendants with the EFCC.\nThey urged the court to pronounce the defendants guilty as charged and sentence them in line with the plea bargain agreements."
  },
  {
    "headline": "BREAKING: Sunday Igboho Released By Benin Republic Govt",
    "summarized_story": "The Government of the Republic of Benin has released Yoruba Nation Activist Chief Sunday Adeyemo, also known as Sunday Ighoho.\nProfessor Banji Akintoye, a Yoruba Leader and Leader of Ilana Omo Oodua Worldwide’s Umbrella Body of Yoruba Self-determination Groups, and Professor Wale Adeniran, a French Language Expert/Deputy Alana of Ilana Omo Oodua Worldwide, were given the Activist on Monday.\nMr. Maxwell Adeleye, the Communications Secretary to Ilana Omo Oodua Worldwide, praised the release of Ighoho as a Triumph of Truth over Darkness in Yoruba Land in a statement.\nDetails later…"
  },
  {
    "headline": "Russia vs Ukraine War: My January Prophecy Has Come To Pass – Pastor Adeboye",
    "summarized_story": "General Overseer of the Redeemed Christian Church of God, RCCG, Pastor E. A. Adeboye says he had predicted the humanitarian crisis currently rocking some European countries following the invasion of Ukraine by the Russian forces.\nThe clergy revealed that members of the church who reside in the warring country, Ukraine are all safe.\nHe said, “All our members in Ukraine are safe.\nThe Nigerian members have already left Ukraine, those who are natives from the report I got some hours ago are all safe and secure.\nAt that time nobody knew that Russia would attack Ukraine, that it was the Europeans who would be running away from their homes."
  },
  {
    "headline": "JUST IN: APC Denies Reports Of Buni’s Sack As Gov Sani Bello Presides Over CECPC Meeting",
    "summarized_story": "JUST IN: APC Denies Reports Of Buni’s Sack As Gov Sani Bello Presides Over CECPC MeetingThe ruling All Progressives Congress (APC) has dismissed reports of the removal of Yobe State Governor, Mala Buni, as its interim national chairman.\nThere were reports that Mr Buni was sacked with the approval of President Muhammadu Buhari who then appointed Niger State governor, Abubakar Bello, as a replacement.\nBello is currently presiding over a meeting of the APC Caretaker/Extraordinary Convention Planning Committee (CECPC) and State chairmen of the party.\nBello shared photos of him seated in what appears to be the position meant for the Chairman of the APC-CECPC, Governor Mai Bala Muni of Yobe State.\nHe captioned the photos: “I am currently presiding over the Caretaker/Extra-ordinary Convention Planning Committee of the APC at the National Secretariat of the Party.”"
  },
  {
    "headline": "BREAKING: I’ve Been Acting Chairman Of APC For A While, Says Niger governor",
    "summarized_story": "BREAKING: I’ve Been Acting Chairman Of APC For A While, Says Niger governorGovernor of Niger state Abubakar Sani Bello says he has been functioning as national chairman of the All Progressives Congress (APC) caretaker committee “for a long now.”Bello made the remarks on Monday at the APC national secretariat in Abuja, after presiding over a meeting of the party’s national caretaker committee.\n“Acting chairman, I have been acting for a while since the chairman travelled,” he said when asked if he has taken charge of the party.\nWhen he was pressed further, he said: “No comment.”"
  },
  {
    "headline": "Lassa fever kills 98 in 2 months",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has said in its latest epidemiological report that Lassa fever has killed 98 Nigerians in 15 states in the last two months.\nThe report, which was obtained by NAN, revealed that since the beginning of the year, l40 confirmed cases of Lassa fever were reported from 21 states and 79 local government areas.\nThe states are Ondo, Edo, Bauchi, Benue, Taraba, Oyo, Ebonyi, Enugu, Kogi, Nasarawa, Plateau, Delta, Kaduna, Adamawa, Niger, Anambra, Katsina, FCT and Cross River.\nThese were reported from Ondo, Edo, Bauchi, Gombe, Kogi, Ebonyi, Taraba, Enugu, Oyo, Benue, Plateau States and the FCT.\n“In total for 2022, 21 States have recorded at least one confirmed case across 79 Local Government Areas."
  },
  {
    "headline": "Ceasefire: Russia tables conditions for Ukraine",
    "summarized_story": "A Russian spokesman spoke about a possible ceasefire on Monday, stating that Russia told Ukraine it is prepared to halt its military operations “in a moment” if Kyiv fulfills several conditions.\nMonday’s statement was the clearest Russian proposal so far regarding the terms for calling off its invasion of Ukraine, now in its twelfth day.\nLaunched on Feb. 24, the Russian invasion has provoked almost universal outrage across the world, and led to punishing sanctions on Moscow.\nBut the main thing is that Ukraine ceases its military action.\nThey should stop their military action and then no one will shoot,” Peskov said in Russia’s announcement of ceasefire conditions."
  },
  {
    "headline": "Ease at sight as NNPC names 48 filling stations to give 24-hour fuel supply *See full list – Blueprint Newspapers Limited",
    "summarized_story": "According to the NNPC, the stations are: NNPC Mega Station Zone 1 Abuja, Total Filling station near Police Headquarters, Conoil Petrol Station opposite Abuja Towers, and Oando Petrol station located in Zone 1 Abuja.\nOthers according to the Group General Manager are ADROVA Petrol Station at Transcorp, ADROVA Petrol Station at IBB way, ADROVA Petrol Station at Zone 1, ADROVA Petrol Station at LifeCamp, ADROVA Petrol Station at Apo and ADROVA Petrol Station at Gwagwalada.\nA.A Rano at Katampe, AYM SHAFA at Katampe and AFDIM Oil at Katampe all in Abuja.\nSherma Oil is also among the list of petrol stations located at CBN Karu, A.A rano located at International Market, Nyanya and the A.A Rano Oil located at Nyanya.\nThe NNPC spokesman assured motorists in the FCT it is working round the clock to restore normalcy to fuel supply nationwide."
  },
  {
    "headline": "Sunday Igboho Released From Custody In Benin Republic",
    "summarized_story": "The embattled Yoruba Nation activist, Mr.Sunday Adeyemo, has been released by the Benin Republic Government.\nThe activist, who is fondly called Sunday Ighoho, was released on Monday to the leader of the umbrella body of Yoruba Self-determination Groups, Ilana Omo Oodua Worldwide, Professor Banji Akintoye, and his deputy, a French Language Expert and Chieftain of Ilana Omo Oodua Worldwide, Professor Wale Adeniran.\nREAD ALSO: Abba Kyari Remanded In NDLEA Custody As Judge Postpones Bail HearingIn a statement issued by the Communications Secretary to Ilana Omo Oodua Worldwide, Mr. Maxwell Adeleye, Akintoye described Igboho’s release as a “Triumph of Truth over Darkness in Yoruba Land”.\nIgboho was arrested in the Benin Republic on his way to Germany alongside his wife who was released shortly after.\nThey left Nigeria after operatives of the Department of State Services (DSS) raided their Ibadan residence on July 1, 2021."
  },
  {
    "headline": "Abba Kyari Remanded In NDLEA Custody As Judge Postpones Bail Hearing",
    "summarized_story": "Justice Emeka Nwite of the Federal High Court, Abuja on Monday adjourned the trial of Abba Kyari and six others till March 14.\nMr Kyari is expected to remain in the custody of the National Drug Law Enforcement Agency until he reappears in court at the adjourned date for his bail hearing.\nREAD ALSO: Abba Kyari Pleads ‘Not Guilty’ To Drug Trafficking ChargesIn court on Monday Mr Kyari pleaded ‘not guilty’ to the eight drug trafficking-related counts brought against him by the NDLEA.\nWhile the other four senior police officers also pleaded ‘not guilty’, the two civilians in the trial – Chibuinna Patrick Umeibe and Emeka Alphonsus Ezenwanne – pleaded guilty to counts five, six and seven.\nHe noted that both Umeibe and Ezenwanne were also mentioned in some counts in the charge that involved Kyari and the others."
  },
  {
    "headline": "Bamise’s Death: DSS Arrests BRT Driver, Two Others",
    "summarized_story": "The driver of a Bus Rapid Transit, which was boarded by the murdered 22-year-old fashion designer, Oluwabamise Ayanwole, has been arrested in Ogun State.\nThe Lagos State Police Public Relations Officer, Adekunle Ajisebutu, had told Channels Television that the police also arrested two persons linked to the driver.\n“In the course of ongoing investigation, two suspects have been arrested and are currently helping in our investigation.\nThis is even as he stated that efforts are ongoing by the Lagos State Police Command to take over the suspect from the DSS.\nShe boarded a BRT bus with number 240257 going to Oshodi at about 7 p.m. at Chevron Bus-Stop."
  },
  {
    "headline": "Nigeria Air: FG Opens Bid To Private Partners",
    "summarized_story": "The Federal Government has issued the request for proposal to intending private investors on National Carrier.\nThe statement also added that the private sector partners are expected to comprise – Nigerian Financial and Institutional Investors (min.\nREAD ALSO: Nigeria Air To Take Off By April 2022, Says Aviation MinisterThis comes less than one week after the minister of aviation, Hadi Sirika announced that the Federal Government will issue requests-for-proposal for the establishment of Nigeria Air.\nThe private sector partners/ consortia are expected to comprise of on international Airline {max.\non the 10th of May 2022 or the address below: The Permanent Secretary Federal Ministry of Aviation Federal Secretariat Complex Shehu Shagari Way, Abuja, NigeriaAttention: Director, Planning Research and Statistics"
  },
  {
    "headline": "Let Bygones Be Bygones, Acting APC Chairman Charges Party Leaders",
    "summarized_story": "The governor, who on Monday declared himself the acting National Chairman of the APC, stated this at a meeting where he addressed state chairmen of the ruling party.\n“By the time you get back, you will unite the party in your various states,” Governor Bello said.\nEarlier on, Governor Bello presided over a meeting of the Caretaker/Extra-ordinary Convention Planning Committee at the APC National Secretariat in Abuja.\nSo, today, we had a major event because all the chairmen came with their supporters and there were too many people,” governor Bello said.\nAccording to him, he has the backing of President Muhammadu Buhari and other leaders of the party."
  },
  {
    "headline": "Why I pulled out of Osun PDP Governorship Primary",
    "summarized_story": "One of the Governorship aspirants of the People’s Democratic Party in Osun state has withdrawn from the race.\nThe primary election of the party is slated for tomorrow at the Osogbo City stadium.\nThe party now has five Governorship aspirants in the race.\nMr Ogunbiyi added that the leadership of the PDP at the centre has decided to cede the governorship ticket to Senator Adeleke.\nThe Governorship election is slated for the 16th of July, 2022."
  },
  {
    "headline": "Invasion: Ghanaians urged to emulate Ukrainians' Patriotism",
    "summarized_story": "Ghanaians have been challenged to put patriotism first as Ukrainians have done in the face of the ongoing attacks by Russia.\nBishop of Lagos Central, the Methodist Church of Nigeria, Rt Reverend Samuel Nortey, stated this at the nation’s Independence service held in Lagos."
  },
  {
    "headline": "No Leadership Change in APC CECPC, its Fake News",
    "summarized_story": "The APC CECPC has described as sponsored media reports on an imaginary leadership change in the All Progressives Congress (APC) Caretaker/Extraordinary Convention Planning Committee (CECPC).\nThe media report is fake news and should be disregarded by all sundry.\nThe party according to Statement by its CECPC Secretary, Senator James Akpanudohedehe, is a progressive political party guided by rules and its Leadership changes are not announced by ‘sources’ through name dropping in the media.\nThe party urged its teeming supporters, members and indeed the general public to remain calm and support the Governor Mai Mala Buni-led APC CECPC to conduct a rancour-free and credible National Convention deserving of its status as a progressive Party."
  },
  {
    "headline": "APC crisis: Heavy security men deploy to national secretariat",
    "summarized_story": "Security operatives have taken over the national secretariat of the All Progressives Congress (APC) located at Blantyre street at Wuse 2, in Abuja.\nAlthough TVC News cannot independently ascertain reason for the deployment, there are reports that President Muhammadu Buhari has sacked Yobe State Governor, Mai Mala Buni, as Chairman of the APC Caretaker/Extraordinary Convention Planning Committee.\nIt was reported that the Niger state governor, Sani Bello, would take over the affairs of the party.\nThe governing party is billed to hold its national convention March 26."
  },
  {
    "headline": "OBJ Accuses Presidential Aspirants Of Corruption, Says They Should be Jailed – Trending With Ojy Okpe",
    "summarized_story": "Former President Olusegun Obasanjo, made a declaration over the weekend saying that most of the politicians aspiring to be Nigeria’s president in 2023 ought to be jailed for corrupt practices.\nA video showing liters of premium motor spirit Petrol being distributed in Jerry cans as souvenirs at a party has caused outrage on social mediaMeanwhile, Nollywood actress Kate Henshaw has expressing her angst over the worsening scarcity of fuel in the country."
  },
  {
    "headline": "Safiya Ahmad Nuhu: Every Nigerian Student from Ukraine Will Be Assisted",
    "summarized_story": "Sunday, stranded Nigerian students of Semy State University in northeast Ukraine must have heaved a sigh of relief, following the announcement by Nigeria’s Foreign Affairs Minister, Geoffrey Onyeama, that their evacuation to Central Europe will commence today.\nOnyeama said this via Twitter after extracting a promise from his Ukrainian counterpart, Dmtyro Kuleba, that the Ukrainian government will establish a humanitarian corridor and authorise the evacuation of Nigerian students from Sumy.\nSumy is the capital of Sumy Oblast in Ukraine and lies about 48km from the border with Russia.\nIt was one of the first cities to be attacked by Russian forces after President Vladimir Putin ordered the invasion of Ukraine on February 24.\nJoining us from Bucharest to discuss the preparedness of her mission to receive more Nigerians entering Romania from Ukraine, is Safiya Ahmad Nuhu, Nigeria’s Ambassador to Romania."
  },
  {
    "headline": "Nigeria: Niger Governor Bello Resumes as APC Interim Chair after Buhari Orders Buni’s Removal",
    "summarized_story": "Governor of Niger State, Abubakar Musa Bello has arrived the National Headquarters of the All Progressives Congress to take over the running of the party as a sole administrator based on reports that President Muhammadu Buhari has ordered the sack of the Mai Mala Buni-led Caretaker Extraordinary Convention Planning Committee.\nThe Niger Governor also went into a meeting with members of the APC Caretaker Committee and is scheduled to hold another meeting with APC state chairmen who had been waiting inside the party secretariat before his arrival.\nThe APC Secretariat had since 7am been besieged by policemen who barricaded both entrances into the APC National Secretariat with stern looking policemen preventing entrance into the secretariat except for key party officers.\nNo less than 15 patrol vehicles of security operatives cordoned off access roads to the party secretariat with over 70 armed operatives around the Blantyre Street in the Zone 4 District in Wuse Abuja.\nEarlier in the day, the interim secretary of the APC, Senator John Akpanudoedehe had in a statement described as fake news that the Mai Mala Buni-led Caretaker Committee had been sacked."
  },
  {
    "headline": "Nigeria: ‘Super Cop’ Abba Kyari Arraigned, Pleads Not Guilty to Drug Trafficking Charges",
    "summarized_story": "Suspended DCP Abba Kyari on Monday pleaded not guilty to a drug trafficking charge filed against him by the National Drug Law Enforcement Agency (NDLEA).\nKyari told Justice Emeka Nwite of a Federal High Court (FHC), Abuja, on Monday, following his arraignment, alongside six others, on allegations bordering on drug trafficking.\nBut Chibunna Patrick Umeibe and Emeka Alphonsus Ezenwanne, who are 6th and 7th defendants respectively, pleaded guilty to counts five, six and seven preferred against them.\nUmeibe and Ezenwanne are the two alleged drug traffickers that were arrested at the Akanu Ibiam International Airport in Enugu.\nSunday also urged the court to grant a leave to review the charges against Umeibe and Ezenwanne who pleaded guilty for the charges against them."
  },
  {
    "headline": "GAGE Awards Announces Panel of Judges as Nominations Come to a Close",
    "summarized_story": "Months of deliberation has secured a superb lineup of Nigeria’s industry key figures, a fitting panel to consider, discuss and decide the 2022 GAGE Awards winners.\nNominations for the 2022 Gage awards had been open since the 24th of January, and were slated to end on the 20th of February.\n“We are thrilled to announce a new panel of judges for the upcoming awards program running for its third year.\nThey are distinguished leaders across the board who will make up our eminent Judging Panel for the 2022 edition of The GAGE Awards,” he said.\nThe GAGE Awards is a comprehensive celebration of founders, ideas, products, and more."
  }
]