[
  {
    "headline": "Anambra community, monarch disagree with alleged land grabbers",
    "summarized_story": "Residents of the Umugama village, Ukwulu, in the Dunukofia Local Government Area of Anambra State, have called on the security agents and the government to save them from the activities of land grabbers.\nHe alleged that the land grabbers were selling the community’s land at will and daring anybody who challenged them by engaging gunmen to destroy the villagers’ farmlands and crops.\nHe also accused Dilibe of collaborating with others outside the community to sell the community’s land to prospective buyers without the consent and approval of the leaders of the village.\nDilibe accused the monarch of selling off the land and asked him to leave the land for them.\nIgwe Uyanwa, on his part, denied having anything to do with the Umugama village land."
  },
  {
    "headline": "Wike asks women to protest rejection of gender bills",
    "summarized_story": "Rivers State Governor, Nyesom Wike, has urged women to use the 2022 International Women’s Day coming up on Tuesday to protest against the gender policy of the All Progressives Congress controlled Federal Government.\nThe governor said it was an APC controlled National Assembly that actually rejected the five gender bills that would have give women more opportunities in the political landscape.\nWike urged women to keep pace with their demand for legislative rights and used the occasion of the International Women’s Day to further demand for roles they should play in political administration in the country.\nHe stated, “I hear that on Tuesday there will be a celebration of the International Women’s Day.\nAlso speaking, Chibudom Nwuche said the governor was an illustrious son, who puts Rivers State on the national spotlight always with evidence of good governance."
  },
  {
    "headline": "AANI raises alarm over noticeable divisive tendencies threatening Nigeria’s democracy",
    "summarized_story": "**To hold a national dialogue on national unity.\n“Moreover, the recent assent to the Electoral Act by Mr President provides a new opportunity for a free and fair election in Nigeria.\n“We, therefore, urge Nigerians with these qualities including members of the National Institute to participate actively in the political process as part of efforts to rescue Nigeria.\nWe must de-emphasise money politics and come together to sponsor candidates that can pursue an agenda for the common good.\nAbubakar said, “We also serve as a think-tank to all tiers of government on matters of national development, peace, and security."
  },
  {
    "headline": "Ex Security Adviser, LG Chairman, others lead close to 10,000 APC members to PDP in Benue",
    "summarized_story": "By Peter Duru, MakurdiClose to 10,000 members of the All Progressives Congress, APC, and other opposition parties in Kwande Local Government Area, LGA, of Benue state, at the weekend defected to the Peoples Democratic Party, PDP.\nThe defectors were led to the PDP by a former stalwart of the APC, and one time Special Adviser on Security Matters, Colonel Basil Kwembeh (retd), a former Kwande LG Chairman, Terhile Iorchir and a host of other APC and opposition leaders in the area.\nReceiving the defectors in Adikpo the LG Headquarters, Governor Samuel Ortom commended them for joining a party that was on the verge of claiming power at the centre in 2023.\nHe assured the lead defectors and their teeming supporters of equal opportunities in the party assuring that the PDP would always uphold the tenets justice, fairness and equity.\nOther opposition leaders who joined the PDP with their teeming supporters includes Mr. James Vandefan, John Ikyembe, Samuel Uke and Moses Ichor."
  },
  {
    "headline": "Ortom lauds President Buhari for appointing Arch. Echono new TETFUND Executive Secretary",
    "summarized_story": "By Peter Duru, MakurdiGovernor Samuel Ortom of Benue state has lauded President Muhammadu Buhari for appointing a Benue son, Arch.\nSunny Echono as the new Executive Secretary of the Tertiary Education Trust Fund, TETFUND, and also congratulated the appointee for his deserved appointment.\nEchono was the immediate past Permanent Secretary, Federal Ministry of Education, Abuja who recently retired after a meritorious service to the nation.\nEchono’s outstanding performance as the Permanent Secretary in the Federal Ministry of Education earned him the recognition and appointment to higher responsibility.\nArch Echono is a good ambassador of Benue State and distinguished citizen of Nigeria."
  },
  {
    "headline": "Jonathan congratulates Obasanjo at 85",
    "summarized_story": "Former President Dr Goodluck Ebele Jonathan has felicitated Ex-President Chief Olusegun Obasanjo on the occasion of his birthday describing him as a leader with a good reputation in statesmanship.\nIn a message of goodwill he personally signed, Dr Jonathan noted that Chief Obasanjo’s legacies “have continued to endure many years after you left office as President of the Federal Republic of Nigeria.”Dr. Jonathan stated further:“I join your family and friends to celebrate you as you mark your birthday this year.\nYou are an accomplished leader, with a sterling reputation in statesmanship and a peacemaker in Nigeria and across Africa.\n“Your legacies in Nigeria and Africa have continued to endure many years after you left office as President of the Federal Republic of Nigeria.\n“As you celebrate, on behalf of my family and the Goodluck Jonathan Foundation, I wish you more strength, good health and peace in all spheres of life."
  },
  {
    "headline": "Verdict on Umahi’s defection: PDP’s statement irresponsible, mischievous —Ebonyi Govt",
    "summarized_story": "The Commissioner for Information and State Orientation, Ebonyi State, Barr.\n“The verbose and clumsy press release of Ebonyi State PDP Chairman gave indication that his Party, PDP had filed a suit at Federal High Court Abuja to challenge the defection of our dear Governor His Excellency, Engr.\nEric Kelechi Igwe PhD, from Peoples Democratic Party (PDP) to All Progressives Congress (APC), Next Level.\n“PDP has finally sold Mr. Tochukwu Okorie cheap to legal embarrassment.\nThe Ministry of Information and State Orientation therefore views the publication of Mr. Tochukwu Okorie as the last straw that breaks the camel’s back."
  },
  {
    "headline": "Zamfara: I’ll discuss politics when time is right – Yari",
    "summarized_story": "Former Governor Abdulaziz Yari of Zamfara State has declined comments on happenings in the political sphere, saying the time is not ripe for such discussion.\nYari, however, dismissed insinuations that he is afraid of speaking to the press on political issues, saying he would surely make his thoughts known when the time is right.\nAccording to him, he was at his country home to have some discussion with his political associates.\nHe commended the journalists, saying that the correspondents chapel of the Nigeria Union of Journalists (NUJ) state council and his government enjoyed mutual understanding while he was governor.\nI always come to Zamfara State to do all my political activities because Zamfara state has always been my immediate constituency,” he said."
  },
  {
    "headline": "Kwara reads riot act to fish farmers at Asa Dam in Ilorin",
    "summarized_story": "The Kwara State Government has ordered fish farmers within the precincts of the Asa Dam water works to stop the discharge of effluent into the dam immediately.\nThis was contained in a communique issued at the end of stakeholders meeting with the fish farmers at the weekend in Ilorin, the state capital.\nState Commissioner for Water Resources, Wahab Femi Agbaje, also directed that the 250-metre minimum setback stated in the law should be maintained by all the fish farmers operating by the dam side.\n“It is also recommended that the fish farmers operating around the Dam area should be registered with the Ministry of Agriculture,” it added.\n“The discharge of effluent to the dam increases the cost of treatment of water and reduces the quantity of treated water supply to the citizenry."
  },
  {
    "headline": "Hushpuppi: Malami, northern political forces blocking Abba Kyari’s extradition – HURIWA",
    "summarized_story": "Human Rights Writers Association of Nigeria, HURIWA, has claimed that the Attorney General of the Federation, Abubakar Malami, and some other political forces in the north are blocking the extradition of Abba Kyari to the United States.\nHURIWA made this claim in a statement signed by its National Coordinator, Comrade Emmanuel Onwubiko.\nRecall that the US Federal Bureau of Investigation had requested that Kyari, a Deputy Commissioner of Police, DCP, be tried in the United States for his involvement with internet fraudster, Ramon Abbas aka Ray Hushpuppi.\nThe DCP has been kept in NDLEA custody since February 14 when he was arrested for attempting to sell 25kg of cocaine.\n“Malami needs to explain why his office did not ask the NDLEA not to file charges so the extradition application goes first,” it said."
  },
  {
    "headline": "2023: Ortom consults for Benue North-West senatorial seat",
    "summarized_story": "Governor Samuel Ortom has cleared speculations on his rumoured senatorial ambition as he formally sought the blessings of his kinsmen to contest the Benue North-West senatorial seat.\nThe traditional ruler said they were in full support of their son to not only contest and win the senate seat but also conquer higher offices.\nThe Governor thereafter spoke with the Nzorov Council Ward Executive Council of the PDP where he also got their blessings to contest for the Zone B Senate in 2023.\nThe Nzorov Council Ward Chairman of the PDP, Hon Ezekiel Adikpe JP, spoke on behalf of the party from the Governor’s council ward.\nAfter this, leaders from the MINDA political axis will meet with Jemgbagh leaders to seek their blessings and support for the governor ahead of the senatorial election."
  },
  {
    "headline": "Omokri challenges 69-year-old Tinubu to dance, play football like Obasanjo at 85",
    "summarized_story": "Obasanjo was sighted in a video on Saturday dancing and playing football as part of activities to mark his 85th birthday.\nIn a post on his Facebook page, Reno said, “General Obasanjo turned 85 years old today.\nHe played football.\nTinubu is 69 years old.\nCan he do one-quarter of these?”Tinubu’s real age had sparked controversy as some Nigerians said his age is false and only meant to keep him in politics."
  },
  {
    "headline": "‘Pregnancy-related illness kills more than COVID-19’",
    "summarized_story": "She said: “Maternal-related causes kill more than COVID-19.\nBetween 40,000 to 50,000 women die from pregnancy delivery causes yearly.\nHe stated that there exists a huge unmet contraception need among women; 48 per cent for unmarried women, and 19 percent for married women.\nWe are about 200 million now, and it is projected that in 50 years, Nigeria’s population will be over 400 million.\nThe major causes of maternal deaths in the country are preventable through family planning,” he said."
  },
  {
    "headline": "Nigeria’s box office records N4.8bn revenue in 2021",
    "summarized_story": "The Cinema Exhibitors Association of Nigeria (CEAN) has realised N4.8 billion revenue through ticket sales in 2021.\nAccording to him, before the pandemic year, 2019, total cinema ticket sales were N5.9 billion.\nLee attributed improved sales in 2021 to the enhanced quality of locally produced movies in the nation, urging movie producers to keep it up.\nHe commended Nollywood movie producers on the improved quality of locally produced movies.\n“The quality of movies produced between Christmas period and now are generating a lot of interest."
  },
  {
    "headline": "Lagos shuts event centre as police order arrest of socialite who shared petrol as souvenir",
    "summarized_story": "Lagos shuts event centre as police order arrest of socialite who shared petrol as souvenirBy Precious Igbonwelundu, Oyebola Owolabi and Alao AbiodunThe Lagos State Commissioner of Police (CP) Abiodun Alabi yesterday ordered the arrest of a socialite, Dr. Pearl Chindinma Ogbolu, for distributing petrol as souvenirs at a party in Lagos.\nThe state government has also ordered the event centre where the party took place shut.\nReacting to the development, the state government through the Lagos State Safety Commission sealed off the events centre for violating Public Safety Law.\nHe said: “The attention of the Lagos State Government has been drawn to a video showing kegs of petrol being handed out as souvenirs at an event Centre in Lagos.\n“The safety of lives and properties of Lagosians and visitors remains a top priority to the Governor Babajide Sanwo-Olu administration."
  },
  {
    "headline": "Peace returning to troubled parts of Nigeria – CDS",
    "summarized_story": "Nigerians have been assured that the year 2022 will see peace returning to all troubled parts of the country.\nThe Chief of Defence Staff, Gen. Lucky Irabor, gave the assurance on Saturday in Abuja at the 2022 International Military Sports Council’s Day Run for the armed forces and security agencies with the theme: “Running for World Peace’’.\nIrabor said the world needed peace at this time given the tension of monumental proportions on-going between Russia and Ukraine and the various security challenges confronting Nigeria.\nHe noted that peace is returning to various troubled parts of Nigeria and that the security forces have been playing their roles at redressing the challenges.\n“I am hopeful that for us in Nigeria, the peace that we have yearned for all these years will be a turning point this year."
  },
  {
    "headline": "Buhari has laid foundation for new Nigeria – Buratai",
    "summarized_story": "Nigerian Ambassador to Benin Republic, Lt.-Gen. Tukur Buratai (rtd), has said that President Muhammadu Buhari has laid a foundation for a new Nigeria, despite myriads of challenges.\n“President Muhammadu Buhari has laid a foundation for a new Nigeria.\n“The legacies must be protected for a greater Nigeria and formidable future generations.\nHe said that President Buhari had laid a foundation for a new Nigeria, adding that he had kept faith with his vision and principles in spite the myriad of challenges.\n“For instance, the 2022 Electoral Act which the President, Commander-in-Chief, President Muhammadu Buhari just signed into law, is a factor that will undoubtedly improve the transparency and acceptability of the country’s future elections and promote democratic governance."
  },
  {
    "headline": "Rendition: IPOB alerts UN, EU, AU, USA, others",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has raised the alarm that there are plans to abduct and rendition some of its members abroad.\nRegular individuals can earn as low as $300 daily Find out how it works.\nHe specifically said that Mazi Chinasa Nworu is top on the list of those pencilled down for illegal rendition or extradition.\n“We are, therefore, placing countries of the world on notice of this wicked plot against innocent peaceful agitators of Biafra.\nWe alert countries around the world, including Africa Union, Europe Union, USA, United Nations, Asia and Australia to protect Biafrans in their respective countries."
  },
  {
    "headline": "Lagos goes after fashionista, others over petrol souvenir at party",
    "summarized_story": "It said that the actions of the organisers of the party were against the state safety guidelines and that everyone responsible for the actions would be prosecuted as stipulated in the laws.\nIn a statement released on Saturday, the Commissioner, Information and Strategy, Gbenga Omotoso, said that the government has directed the Lagos Safety Commission to investigate the use of fuel as souvenirs at the party.\nThe statement read: “The attention of the Lagos State Government has been drawn to a video showing kegs of petrol being handed out as souvenirs at an Event Centre in Lagos.\n“The Lagos State Government, through the Safety Commission, is investigating this matter and will ensure that all parties to this reprehensible action are made to account for it.\n“The safety of lives and property of Lagosians and visitors remain a top priority to the Governor Babajide Sanwo-Olu administration."
  },
  {
    "headline": "Obasanjo to become honourary member of Ohanaeze",
    "summarized_story": "From Geoffrey Anyanwu, EnuguFormer President of Nigeria, Chief Olusegun Obasanjo, has declared willingness to be inducted as an Honourary Member of Ohanaeze Ndigbo Worldwide.\nOther members of the delegation included the former President General of Ohanaeze Ndigbo, Prince Gary Igariwey, National Publicity Secretary, Alex Ogbonnia; Ohanaeze Chieftain, Nze Ozichukwu Chukwu; Bishop Dr. Sunday N. Onuoha, Founder and President of Vision for Africa and Chief Emeka Udodeme, President, Ohanaeze Ndigbo, Anambra State Chapter, Ambrose Obioha, Admin Manager, Ohanaeze Ndigbo Secretariat and Prince Okey Kanu, a Lagos based business consultant.\nResponding, Obasanjo stated that there were several socio-cultural groups in Nigeria but Ohanaeze Ndigbo Worldwide, with such endearing visit, passion and affection, had shown a remarkable difference in his life.\nHe reiterated that it was the first time, as a private citizen, he was playing host to such well organised socio-cultural body and therefore expressed his enthusiasm to be admitted as an Honourary Member of Ohanaeze Ndigbo Worldwide.\nMeanwhile, the National Publicity Secretary of Ohanaeze, Alex Ogbonnia has disclosed thatthe induction of Obasanjo as an Honourary Member of Ohanaeze Ndigbo would take place at the Headquarters of Ohanaeze Ndigbo in Enugu in no distant time."
  },
  {
    "headline": "The hell we saw in Ukraine – Trapped Nigerians",
    "summarized_story": "By Chika Abanobi, Kate Halim, Chioma Okezie-Okeh, Juliana Taiwo-Obalonye, And Vera Wisdom BasseyNigerians living in Ukraine have described life under the Russian invasion as hellish.\nTheir accounts were corroborated by a Ukrainian as well as Poland-based Nigerian who is helping to take care of his trapped fellow countrymen and women.\nThat’s what we honestly need right now.”Johanna, a 17-year-old Nigerian who also found herself trapped in Ukraine is seriously praying to return to the country alive.\n“I am a Nigerian studying at V.N Karazin National University, Kharkiv, Ukraine,” she told an international electronic medium.\nShe called on the international community, especially the United Nations to tell the truth about what is going on in Ukraine."
  },
  {
    "headline": "Constitution review splits Afenifere, Ohanaeze, MBF",
    "summarized_story": "Afenifere, Ohanaeze Ndigbo, MBF and AYCF hailed some of the amendment bills, including granting autonomy to the 774 local governments councils Nigeria as well as their rejection of life pension for Senate presidents and Speakers of the House of Representatives.\nIt also condemned the attempt to remove the power to conduct local government elections from the State Independent Electoral Commissions (SIEC).\nHe further said: The Kaduna State local government elections conducted by Governor El Rufai can serve as an example of the possibility of having a fair local government election.\nHe noted that the cancellation of state/local government joint account will help the local governments work better as a tier of government.\nHe noted that autonomy for local government councils would allow the ‘commonest’ people be part and parcel of government."
  },
  {
    "headline": "NNPC Seeks to ‘Pre-empt Mobil on Asset Sale to Seplat’",
    "summarized_story": "However, THISDAY learnt from officials NNPC, that the state-owned oil giant has opted to exercise its Right of First Refusal (RFR) on the sale of the assets.\nThe RFR is reportedly contained in the Joint Operating Agreement (JOA) of the Joint Venture (JV), which represents NNPC’s position on the planned sale of the shares to Seplat Energy Plc.\nThe source stressed that NNPC did not have the power to halt the acquisition of the multinational oil company’s shares by Seplat.\nSeplat Energy subsequently put forward a winning bid for the assets and reached an agreement with ExxonMobil.\nAkinosho maintained, “NNPC is in JV with companies that produce at least 45 per cent of our crude."
  },
  {
    "headline": "FG Green-lights DCP Kyari’s Extradition to United States",
    "summarized_story": "Few hours after the extradition process commenced, the National Drug Law Enforcement Agency (NDLEA), which currently has Kyari in its custody following his arrest for alleged illicit drug dealing, also initiated a court process against him.\nNDLEA filed an eight-count criminal charge against the defendants at the Federal High Court, Abuja.\nThe implication of the NDLEA court action against Kyari is that he cannot be extradited to the US, even though the federal government has commenced the extradition process.\nHe noted that there was no criminal proceeding pending against Kyari in Nigeria for the same offence.\nThe charge, filed yesterday and marked FHC/ABJ/CR/57/2022, was signed by NDLEA’s Director, Prosecution and Legal Services, Mr. Joseph Sunday."
  },
  {
    "headline": "INEC: We are Not Registering New Parties Because They Won’t Participate in 2023 Elections",
    "summarized_story": "INEC, which claimed that the reason was because the new Electoral Act barred the registration of new political parties to participate in any general election twelve months before, added also that the same new electoral law, allowed for the merger of political parties, only nine months to the general elections.\nThere are currently 18 registered political parties in the country.\nUnder the new law, the Commission shall issue the Notice of Election not later than 360 days before the date fixed for the conduct of elections.\nAccordingly, he said a good knowledge of the law and its provisions would assist in crafting good editorials and holding the Commission and the Political Parties accountable to their implementation.\n“The Commission has introduced an online nomination portal through which Political Parties upload the list and personal particulars of their nominated candidates."
  },
  {
    "headline": "Evacuation of Nigerians Delayed After Flight Exceeded Allotted Duty Hours",
    "summarized_story": "The flight meant to evacuate stranded Nigerians was cancelled because the aircraft overstayed its allotted duty hours.\nThe crew that operated the Air Peace flight from Nigeria to Poland had spent their allotted hours of duty and, according to international standards, they could not exceed the allotted hours.\nThe Nigerian evacuation flight was shifted to early today morning and it was expected to arrive the Federal Capital Territory, Abuja, later today.\nIt means they have already waited five hours and they are going to have nine hours flight.\n“Our institutions are working together to support Ukraine on the financing and policy fronts and are urgently increasing that support."
  },
  {
    "headline": "NDLEA to Arraign Kyari, 4 IRT Members, Files Drug Charges",
    "summarized_story": "This is following the filing of an eighth count criminal charge against the defendants by the National Drug Law Enforcement Agency (NDLEA) at the Federal High Court Abuja.\nKyari and his co-accussed were arrested by the Police on February 12, 2022 and handed over to the Police for investigation over allegations bordering on drug offences.\nThe charge, filed on Thursday and marked FHC/ABJ/CR/57/2022 was signed by NDLEA’s Director, Prosecution and Legal Services, Mr Joseph Sunday.\nIn count one, Kyari, ACP Ubua, ASP James, Inspector Agirigba, and Inspector Nuhu, all of Intelligence Response Team were said to have between January 19 and 25 dealt in 17.\n55 kilograms of cocaine and committed and offence contrary to and punishable under section 14 (b) of the Natural Drug Law Enforcement Agency Act, CAP 30 Laws of the Federation of Nigeria 2004."
  },
  {
    "headline": "How Over 1,800 Nigerian Students, Teachers Were Victims Of Insurgent Attacks In Less Than 7 Years — Report",
    "summarized_story": "Students Writing WAECSo far, 1, 799 students were attacked while 24 teachers fell victim to the attacks.\n“There are incidents of attack involving students in four geopolitical zones of Northwest, Northeast, Northcentral and Southeast.\n“This is followed by the North East with 386 students, North Central (240) and Southeast.\nOn the other hand, attacks involving teachers were only in the North-west and the Northcentral.\nThe Northwest has the highest number of attacks involving teachers followed by the North Central,\" a part of the report reads."
  },
  {
    "headline": "How Over 1,800 Nigerian Students, Teachers Were Victims Of Insurgent Attacks In Less Than 7 Years — Report",
    "summarized_story": "Students Writing WAECSo far, 1, 799 students were attacked while 24 teachers fell victim to the attacks.\n“There are incidents of attack involving students in four geopolitical zones of Northwest, Northeast, Northcentral and Southeast.\n“This is followed by the North East with 386 students, North Central (240) and Southeast.\nOn the other hand, attacks involving teachers were only in the North-west and the Northcentral.\nThe Northwest has the highest number of attacks involving teachers followed by the North Central,\" a part of the report reads."
  },
  {
    "headline": "How Over 1,800 Nigerian Students, Teachers Were Victims Of Insurgent Attacks In Less Than 7 Years — Report",
    "summarized_story": "Students Writing WAECSo far, 1, 799 students were attacked while 24 teachers fell victim to the attacks.\n“There are incidents of attack involving students in four geopolitical zones of Northwest, Northeast, Northcentral and Southeast.\n“This is followed by the North East with 386 students, North Central (240) and Southeast.\nOn the other hand, attacks involving teachers were only in the North-west and the Northcentral.\nThe Northwest has the highest number of attacks involving teachers followed by the North Central,\" a part of the report reads."
  },
  {
    "headline": "Bandits Ask Katsina Community To Contribute N30 Million As Compensation Over Death Of Leader Killed By Military Jet",
    "summarized_story": "Residents of Tashar Biri Village in Yatumaki of Dan Musa Local Government Area have been asked by bandits to pay N30 million or risk ferocious attacks.\nAirstrikes executed recently by the Nigerian Air Force (NAF) aircraft in Katsina State killed Dankarami.\nIt was gathered that he met his waterloo when he visited one Sabira, a teenage girl he had forcibly married in Tashar Biri village.\nFollowing his death, his boys demanded that the community must provide Sabira and her mother and pay N30 million, or risk being attacked.\nMost residents have fled the village after they got a hint that the leader of the bandits, one Mai Lore, would raid the community and kill everyone."
  },
  {
    "headline": "Bandits Ask Katsina Community To Contribute N30 Million As Compensation Over Death Of Leader Killed By Military Jet",
    "summarized_story": "Residents of Tashar Biri Village in Yatumaki of Dan Musa Local Government Area have been asked by bandits to pay N30 million or risk ferocious attacks.\nAirstrikes executed recently by the Nigerian Air Force (NAF) aircraft in Katsina State killed Dankarami.\nIt was gathered that he met his waterloo when he visited one Sabira, a teenage girl he had forcibly married in Tashar Biri village.\nFollowing his death, his boys demanded that the community must provide Sabira and her mother and pay N30 million, or risk being attacked.\nMost residents have fled the village after they got a hint that the leader of the bandits, one Mai Lore, would raid the community and kill everyone."
  },
  {
    "headline": "Nigerian students stranded in Ukraine stage protest, appeal for 'urgent' evacuation",
    "summarized_story": "Nigerian students stranded in Sumy State University (SumDU), Ukraine have appealed for an immediate evacuation.\n“All we are asking is can we cease-fire and let the students of Sumy leave?\n“Telephoned with Dmytro Kuleba, Minister of Foreign Affairs of Ukraine on modality for the quick evacuation of Nigerian students from Sumy,” he said,“Dmytro Kuleba, Minister of Foreign Affairs of Ukraine indicated the procedure to follow in respect of the evacuation of Nigerian students in Sumy, which has been communicated to our Ambassador to Ukraine for action.\n“The Nigerian Ambassador to Ukraine, Shina Alege, reported on his follow up with the Ukrainian authorities.\nThe Ukrainian Government’s evacuation plan of students in Sumy was explained."
  },
  {
    "headline": "Nigerian students stranded in Ukraine stage protest, appeal for 'urgent' evacuation",
    "summarized_story": "Nigerian students stranded in Sumy State University (SumDU), Ukraine have appealed for an immediate evacuation.\n“All we are asking is can we cease-fire and let the students of Sumy leave?\n“Telephoned with Dmytro Kuleba, Minister of Foreign Affairs of Ukraine on modality for the quick evacuation of Nigerian students from Sumy,” he said,“Dmytro Kuleba, Minister of Foreign Affairs of Ukraine indicated the procedure to follow in respect of the evacuation of Nigerian students in Sumy, which has been communicated to our Ambassador to Ukraine for action.\n“The Nigerian Ambassador to Ukraine, Shina Alege, reported on his follow up with the Ukrainian authorities.\nThe Ukrainian Government’s evacuation plan of students in Sumy was explained."
  },
  {
    "headline": "Saudi Arabia 'lifts ban' on flights from Nigeria",
    "summarized_story": "The kingdom of Saudi Arabia has reportedly lifted the ban on flights from Nigeria.\nAdvertisement“Saudi Arabia has lifted the suspension of direct flights from Nigeria and other 18 countries,” he wrote on Twitter.\nSaudi Arabia has lifted the suspension of direct flights from Nigeria and other 18 countries.\n— Bashir Ahmad (@BashirAhmaad) March 5, 2022 AdvertisementIn the wake of the outbreak of the Omicron COVID variant, Saudi Arabia had, in December 2021, suspended all flights from Nigeria.\n“Nigeria has understood fully the reason for the ban by the kingdom of Saudi Arabia was for the best interest of its citizens,” the minister had said."
  },
  {
    "headline": "Saudi Arabia 'lifts ban' on flights from Nigeria",
    "summarized_story": "The kingdom of Saudi Arabia has reportedly lifted the ban on flights from Nigeria.\nAdvertisement“Saudi Arabia has lifted the suspension of direct flights from Nigeria and other 18 countries,” he wrote on Twitter.\nSaudi Arabia has lifted the suspension of direct flights from Nigeria and other 18 countries.\n— Bashir Ahmad (@BashirAhmaad) March 5, 2022 AdvertisementIn the wake of the outbreak of the Omicron COVID variant, Saudi Arabia had, in December 2021, suspended all flights from Nigeria.\n“Nigeria has understood fully the reason for the ban by the kingdom of Saudi Arabia was for the best interest of its citizens,” the minister had said."
  },
  {
    "headline": "Kukah: Women should benefit from quota system -- but not mistresses of big boys",
    "summarized_story": "Matthew Kukah, Catholic bishop of Sokoto diocese, says women should benefit from quota system in regards to political participation.\nHe however said it is important that the special consideration is not enjoyed by relatives of people in government or “mistresses of big boys”.\nQuota system is designed to give opportunities to the best of under-represented segments of society.\n“Because if it is just the same big boys who are coming with their mistresses and their extra wives, it is not acceptable.\n“So I would suggest, yes grant the quota, but the quota cannot be benefitted… nobody who was already benefiting should benefit from that quota.”"
  },
  {
    "headline": "Vault Hill is building a human-centric metaverse. What about it?",
    "summarized_story": "To differentiate itself from other virtual spaces and metaverse, Vault Hill City (Vault Hill’s Metaverse) has four different islands and each island has 7 human-themed districts: Play, Romance, Curiosity, Community, Idealism, Vitality, and Imagination.\nVault Hill is also partnering with Ready Player Me to build out avatars and incorporate digital wearables and limited-edition accessories.\nThat is, using one avatar across multiple metaverses instead of having to create one for Vault Hill, and another for Decentraland,” Vault Hill said.\nVault Hill Part is also partnering with Lingua54 to use machine learning to translate the speeches of avatars across different languages in real time.\nThe first glance of Vault Hill City will be up by Q2 2022 and by the end of the year, it will be fully running."
  },
  {
    "headline": "Two years and 3 million rides later, can SafeBoda keep its lead in Nigeria?",
    "summarized_story": "On Wednesday, Ibadan-based Ugandan bike hailing startup SafeBoda clocked two years of operating in the Nigerian market.\nAnd by the end of the year, while it was pausing its Kenyan operation, it celebrated half a million rides in Nigeria.\nFast forward to today, SafeBoda claims to have recorded over 3 million rides, more than 10,000 riders, over 100,000 users, and completed 50,000 deliveries.\nThe startup currently offers 3 services in Nigeria: rides, deliveries, and airtime purchase.\nSafeBoda riders are highly regarded and respected, not just because of the colour but because of their conduct,” said Clement Obaro, Growth Manager at SafeBoda."
  },
  {
    "headline": "Facebook content moderators in Kenya to receive 30-50% pay raise, following complaints",
    "summarized_story": "Facebook content moderators in Kenya will receive a 30-50% pay rise.\nAlthough the pay raise is welcomed by many of the content moderators, some still say it’s not enough.\nWhile the lowest starting salary of a Facebook content moderator at Sama is $2.20 per hour, outsourced content moderators for Facebook in the U.S. are paid a typical starting salary of $18 per hour.\nMeta, Facebook’s parent company also declined to comment on the announcement of the pay raise.\nThe announcement of the pay raise is seen as a win for the content moderators and validation of the power in employees speaking up."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, What comes to mind when you hear the term \"financial inclusion\"?\nI asked because it has become a..."
  },
  {
    "headline": "S2PAfrica holds its 2022 Regional Engineering Design Competition(EDC) Awards Ceremony",
    "summarized_story": "Share this article:S2PAfrica, a non-profit organisation aiming to groom professional engineers in Sub-saharan Africa, held its annual regional engineering design competition(EDC) awards ceremony on February 26, 2022.\nDr Nadu Denloye, current Chair, ICT committee, the Nigerian Academy of Engineering (NAE), served as the chair for the Engineering design competition.\nTeam EASS won the Energy efficiency category prize of $500, while Team Capture won the Harnessing Ignored Energy category prize of $500.\nThe S2PAfrica regional engineering design awards were announced, starting with the second runner-up award, which Team Improved Charcoal Stove won.\nTeam Koye was announced the winner of the 2022 S2PAfrica regional engineering design competition."
  },
  {
    "headline": "How to improve customer experience",
    "summarized_story": "Today, I’ll be discussing:How to improve customer experienceMTN in the metaverseSudo Africa’s $3.7 million pre-seedChari’s new acquisitionImproving customer experienceWhat is the most memorable customer service experience you’ve had?\nCustomer experience – the feeling or memory that a customer or prospective customer has whenever they come in contact with a business – is dependent on a company’s customer service.\nSo, how can customer experience be enhanced?\nMyServiceAgent is a technology company offering a variety of tools to businesses to improve the customer experience.\nChimgozirim walks us through what they do and how the company uses AI to help companies to improve their customer experience."
  },
  {
    "headline": "Inside NIPOST’s latest financial inclusion play: Agency banking and fingerprint authentication",
    "summarized_story": "In January 2022, NIPOST unveiled its new agency banking platform at a ceremony in Nigeria’s capital, Abuja.\nAdvertisementAccording to Isa Pantami, Minister of Communications and Digital Economy, the agency banking platform would follow the Universal Postal Union’s (UPU) standards on financial inclusion.\nBy UPU standards, NIPOST’s agency banking platform should provide essential services like savings, payments, money transfers, insurance, and credit.\nVisiting other nationsGlobally, postal services are no strangers to providing financial services.\nBy 2020, the postal agency was to have been unbundled into six subsidiaries: NIPOST Banking and Insurance Company; NIPOST Property and Development Company; NIPOST Transport and Logistics Services Company; NIPOST E-government Services Company; and NIPOST E-commerce Services Company."
  },
  {
    "headline": "Nigeria is tottering says Obasanjo in reflection on nation building",
    "summarized_story": "My thoughts on the establishment of Our Africa Narrative Club or society aggregate around the following six assertions:1.\nWe must continually make ourselves essential contributors to the world civilisation, world ethos, world development and world preservation, sustenance and wholesome world recreation.\nI mean Nigerians in all walks of life – politicians, community leaders, traditional leaders, religious leaders, diplomatic leaders, leaders in the academia, leaders in all aspects of government life, and leaders in other aspects of the civil society.\nThat will be a monumental tragedy for Nigeria, Africa, the black race and humanity.\nMay God bless Africa too and make it a great continent as we continue to stoke the embers of the Africa narrative."
  },
  {
    "headline": "CBN’s Infraco engages governments on Apapa decongestion",
    "summarized_story": "Apapa and Tin can road users will soon breathe in fresh air as the Central Bank of Nigeria (CBN)’s newly established Infraco plans engagement with the Lagos State and the Federal Government about decongesting traffic in the area.\nGodwin Emefiele, governor of the CBN disclosed this at the weekend during an inspection of projects at Lagos free zone.\nWe will be engaging the Lagos State government as well as the Federal Government to see what can be done, not just about evacuating, but evacuation out of Lagos,” Emefiele said.\n“The entire idea is that with this Lagos free zone port, we should be able to see a total decongestion of Apapa and Tin Can port purely from the standpoint that it would take the traffic away from Apapa.\nIf we export, we earn foreign exchange, and I am going to start working with them to ensure that we designate the Lagos Free Zone as an export zone,” Emefiele said."
  },
  {
    "headline": "Russia accused of violating ceasefire as Ukraine halts evacuation",
    "summarized_story": "Ukraine called off its attempt to evacuate civilians from the besieged city of Mariupol after accusing Russia of violating a ceasefire and attacking the escape route for hundreds of thousands of beleaguered civilians.\nThe struggle to enforce the ceasefire however, worsened conditions in the city, which has borne the brunt of Russia’s offensive in Ukraine.\nRead also: UPDATED: Russia declares temporary ceasefire in UkraineThe 10-day war has targeted some of Ukraine’s largest population centres and driven 1.2mn people to flee their homes.\nThe International Committee of the Red Cross said that “safe passage operations from Mariupol and Volnovakha will not start today”.\nIt said it was ready to help facilitate the evacuation of civilians “once the parties have reached an agreement”."
  },
  {
    "headline": "Obaseki to partner FG to revitalize Okomu National Park, sends forestry bill to Edo Assembly – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said his administration will partner the federal government on the management of the Okomu National Park, to revitalize the park and strengthen security in the area.\nObaseki disclosed this on Thursday while addressing the Conservator of the Okomu National Park, Mr. Augustine Obekpa, when he visited the park in Udo Community, Ovia South-West Local Government Area of the state.\nHe noted, “We are going to be sending a forestry bill to the Edo State House of Assembly for consideration next week.\n“We want to collaborate with the National Park Service.\nIn his remarks, the Conservator of the Okomu National Park said the park is home to white-throated monkeys, Buffalo and Elephants, noting that farming, hunting and illegal logging was affecting the natural habitats of the animals."
  },
  {
    "headline": "Edo begins ‘operation show your building plan’ in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has concluded plans to commence a recertification campaign for buildings in the Ugbor, Ogheghe, Amagba communities and environs in the Benin metropolis to guard against building collapse and other hazards.\nCommissioner for Physical Planning, Urban and Regional Development, Isoken Omo, in a statement, urged members of the public to cooperate with officials of the ministry during the clearance and recertification exercise.\n“Staff of the Ministry will be going from property to property demanding evidence of Building Approval.\nThe general public is advised to allow the officers of the Ministry to do their work and cooperate with them to avoid a breach of the peace,” she added.\nShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Obaseki urges increased global action to combat illegal wildlife trade, trafficking – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has called for stronger collaboration among global stakeholders as well as a more stringent legal framework to combat illegal wildlife trade and trafficking so as to conserve the ecosystem and preserve wildlife.\n“Better policies, including a more stringent legal framework to end the global menace of illegal wildlife trade and trafficking, among others must be developed to preserve the world’s diverse flora and fauna.\n“We are in partnership with stakeholders, including the Nigerian Air Force and other security agencies to preserve our forest reserve, particularly the Okomu Forest Area against criminals.\nWe will continue to explore even better channels to protect our endangered wildlife assets,” he added.\nAccording to the UN, “World Wildlife Day is an opportunity to celebrate the many beautiful and varied forms of wild fauna and flora and to raise awareness of the multitude of benefits that their conservation provides to people."
  },
  {
    "headline": "Obaseki flays unconscionable denial of women representation in Nigeria’s democracy – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has slammed the National Assembly for rejecting 5 bills seeking affirmative action and inclusion for women in politics and other spheres of the society.\nThe governor, in a statement, said: “The recent developments at the National Assembly, in which 5 bills seeking affirmative action and inclusion for women were vehemently shut down by members, is most regrettable and unsettling.\n“This is because the legislature is the bastion of democracy and a critical platform for fair representation and inclusion in government.\nThey provide invaluable service to ensure the proper functioning of the engine of government.\nAt the senior cadre of the civil and public service, women make up more than 50 percent of the Permanent Secretaries, which provides them with ample opportunity to serve the people."
  },
  {
    "headline": "‘Financial recklessness’- South, middle belt youths hit FG over $1m donation to Afghanistan",
    "summarized_story": "The assembly, which is the umbrella body of all the youth groups in the South East, South-South, South West, and Middle Belt regions noted that it was unfortunate that the government would make such move at a time the Nigerian economy is in financial comatose.\n“It is common knowledge that Nigeria is currently on financial oxygen to survive and we cannot be pretending about it because the information is already in public domain,” the youths said.\n“The Federal Government openly told Nigerians that there is no money in our purse to fulfill the financial promises it made to Academic Staff Union of Universities, ASUU.\nWe now ask the FG, where did the money donated to Afghanistan emanate from?\n“We then ask the federal government how much has it donated to the Nigerian Internally Displaced Persons in Benue State."
  },
  {
    "headline": "Tinubu reveals what he plans to do after ruling Nigeria for eight years",
    "summarized_story": "Bola Tinubu, former Lagos State governor, has said he will hand over Nigeria to the smartest person with most followers after ruling it for eight years, suggesting that he would replicate what he presumably accomplished in Lagos.\nTinubu, a chieftain of the ruling All Progressives Congress (APC) who has since declared his intention to run for president in 2023, assured that he will rule for eight years when he becomes president in 2023.\n“I am imploring all eligible voters to get their Permanent Voters Card (PVC) revalidated for them to exercise their civic responsibilities.\nI will turn Nigeria around for good.\nAll I seek are your prayers and support for me to become the president."
  },
  {
    "headline": "OSUN 2022: Vote Adeleke to stop Osun resources being sent to Lagos – Group",
    "summarized_story": "The statement was signed by the Chief Coordinator of the group, Hon.\nThe group said it is first concerned with the emergence of Senator Ademola Adeleke in the party’s primaries coming up on Tuesday, 8th of March, 2022.\nDiti Aluko said Adeleke commands deep respect and followership in the state for him to win the primary election and proceed to win the election proper.\nThe group averred that, “Our aims and Objectives are clear, majorly to elect our principal, Senator Nurudeen Ademola Adeleke as the governor of our dear state, Osun State comes July 16, 2022 by God’s grace.\nThis we know will not come so easy because of both intra-party and inter-party politics, but we are more than capable for this task and we believe that Senator Ademola Adeleke will coast to victory sooner or later.”"
  },
  {
    "headline": "Some politicians running for president should be in jail if EFCC did its job well – OBJ",
    "summarized_story": "The former President made the observation today in Abeokuta when he presented a paper at the international symposium marking his 85th birthday anniversary.\nAnd for me, the major issue is how to progress Nigeria from a country to a nation.\n“If in 2015 Nigeria was seventy-five per cent a country and fifty per cent a nation, today, Nigeria will not be more than fifty per cent a country and twenty-five per cent a nation.\nIf EFCC and ICPC will have done their jobs properly and supported adequately by the judiciary, most of them would be in jail.\nFixing Nigeria must begin on the principles of nation building, not necessarily on emotion, sentiments, euphoria, ignorance, incompetence, ethnicity, nepotism, bigotry, sectionalism, regionalism, religion or class."
  },
  {
    "headline": "Lagos Govt Seals Event Centre Where Petrol Was Shared As Souvenir",
    "summarized_story": "The Lagos State government, on Saturday, sealed off Havillah Event Centre in Oniru area of Lagos, where petrol was shared to guests as a souvenir at a party.\nThe event centre was sealed by officials of the Lagos Safety Commission and the Rapid Response Squad (RRS) “for Contravening Public Safety Rules.”In a post titled, “Lagos Seals Event Centre”, the police said, “Rapid Response Squad working in conjunction with Lagos State Safety Commission has sealed Havilah Events Centre, Victoria Island for hosting a party during which litres of premium motor spirit (Petrol) in jerry can were given out as souvenirs.\nADVERTISEMENT“Two officials of the centre were arrested today while Lagos Commissioner of Police, Abiodun Alabi has directed that all those involved be arrested.\nAccording to him, the Lagos State Government, through the Safety Commission will ensure that all parties to “the reprehensible action are made to account for it”.\nMeanwhile, the Erelu Okin of Kemta Kingdom, Pearl Chidinma Ogbolu, has apologised for sharing petrol as a souvenir at her installation party."
  },
  {
    "headline": "2023: Some Aspirants Should Have Been In Jail By Now – Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo, on Saturday, declared that many politicians jostling to hold sensitive elective positions in Nigeria come year 2023 general election are supposed to be serving various jail terms, should the anti-graft agencies in the country had functioned well.\n“I cast a cursory look at some of the people running around and those for whom people are running around.\nIf EFCC and ICPC will have done their jobs properly and supported adequately by the judiciary, most of them would be in jail.\nAs the watchman counts on daybreak, so too do I count on Nigerians and Nigeria to bring forth that person.\n“It is time to reach into the ability of Nigeria to always snatch victory from the jaws of defeat as we start this collective search on how we can climb out of this hole in which we find our country, Nigeria,” Obasanjo explained."
  },
  {
    "headline": "Lagos Socialite Apologises For Sharing Petrol Sourvenir At Installation Party",
    "summarized_story": "The Erelu Okin of Kemta Kingdom, Pearl Chidinma Ogbolu, has apologised for sharing petrol as a souvenir at her installation party.\nThe apology was sequel to the backlash from Nigerians over the viral video where kegs of petrol with stickers “Erelu Okin Foundation Installation Party” were shared at the ceremony.\nThe kegs of petrol were seen handed to guests at the party to celebrate Ogbu’s installation as Erelu Okin of Orile Kemta at the Havillah Event Place, Oniru in Lagos.\n“My intent was just to show appreciation to my guests for turning up at my event at these hard times.\n“I have paused to reflect and truly apologise and I thank you all for your understanding and criticisms.”ADVERTISEMENT"
  },
  {
    "headline": "Lagos Govt To Probe Petrol Souvenir At Party",
    "summarized_story": "The Lagos State government, on Saturday, said it was investigating a viral video on the social media showing gallons of petrol as souvenirs at a social event in Lagos.\n“There is no doubt that this action is dangerous and can lead to loss of lives and property.\n“The Lagos State Government through the Safety Commission is investigating this matter and will ensure that all parties to this reprehensible action are made to account for it.\n“The safety of lives and properties of Lagosians and visitors remains a top priority to the Governor Babajide Sanwo-Olu administration.\nWe, therefore, advise that actions that can lead to loss of lives and properties be avoided,” he added."
  },
  {
    "headline": "London Trip Still On Course As Buhari Returns From Kenya",
    "summarized_story": "President Muhammadu Buhari yesterday returned to Abuja after attending the United Nations Environmental Programme (UNEP) at 50 in Nairobi, Kenya.\nThe president, who initially planned to proceed to London for medical check-up, returned to Abuja yesterday at about 1.p.m.\nOn whether the president had shelved his trip to London, Shehu said, “No, he hasn’t shelved his trip to London.\nThe trip to London is Sunday.”ADVERTISEMENTWhile in Kenya, the president participated in the special session to commemorate the 50th anniversary of the United Nations body.\nDuring the meeting, Buhari directed collaboration between the Ministries of Environment, Water Resources, Agriculture and Rural Development and Power to combat desertification."
  },
  {
    "headline": "BREAKING: Lagos Seals Event Center Where Petrol Was Shared As Souvenir",
    "summarized_story": "BREAKING: Lagos Seals Event Center Where Petrol Was Shared As SouvenirThe Havillah Event Centre in Oniru has been closed by the Lagos state government for violating public safety regulations.\nFollowing a public outcry over the distribution of gasoline-filled jerrycans at an event, the event center was closed.\nOn Saturday, agents from the Lagos Safety Commission and the Rapid Response Squad sealed the facility, according to Jubril Gawat, senior special adviser to the Lagos state governor on new media."
  },
  {
    "headline": "‘I Watched As Six Of My Siblings Were killed’, Turji Justifies Cause",
    "summarized_story": "‘I Watched As Six Of My Siblings Were killed’, Turji Justifies CauseA notorious bandit kingpin, Bello Turji, has recounted some attacks on his family, saying that over 1,000 cattle were stolen from their household and in the process six of his younger siblings were killed that day.\nTurji also accused Yan Sakai volunteers of connivance with security agents to harass and extort the Fulanis.\nThey also connived with Yan Sakai and slaughtered my uncle.\nMy father was involved in a court case for seven years over corn stalks.\nJust for corn stalks!”​"
  },
  {
    "headline": "How I Helped Aregbesola, Fayemi, Mimiko Become Governor – Tinubu",
    "summarized_story": "Asiwaju Bola Tinubu, one of the presidential aspirants and the head of the All Progressives Congress, paid a visit to the traditional rulers in the three senatorial districts of Ondo State on Friday, seeking their support for his presidential bid.\nTinubu highlighted former governors of Osun and Ondo states, Ogbeni Rauf Aregbesola and Dr. Olusegun Mimiko, as beneficiaries of his political generosity.\nHe also mentioned the Governor of Ekiti State, Dr. Kayode Fayemi, and President Muhammadu Buhari.\nTinubu said, “I helped Mimiko get his mandate through court after two years that he was elected.\nI helped Fayemi get his mandate after three years."
  },
  {
    "headline": "How We Escaped Intense Bombings, Death In Ukraine-Russia War – Nigerians",
    "summarized_story": "Nigerians who escaped Russia’s ongoing military offensive in Ukraine arrived in Abuja, the nation’s capital, on Friday, narrating how they escaped the intense bombings and missiles fired by Russia’s military forces.\nSome of the returnees who fled Ukraine to Romania told Saturday PUNCH how they were able to escape the invasion.\n“On Thursday morning, there was a bombing in Kyiv but thankfully I was in Ternopil so I escaped.\nShe added that she would love to return to Ukraine to complete her studies once the war ends.\nAnother returnee, Peter Ajuwon, said the Ukraine war should serve as a lesson to Nigerians on the importance of peace."
  },
  {
    "headline": "Breaking: Police hunt socialite, other party organisers day after sharing petrol as souvenirs",
    "summarized_story": "Moments after Lagos state government sealed a party venue where petrol kegs were shared as souvenirs, Commissioner of Polic, CP Abiodun Alabi, has ordered the arrest of the host of the event.\nThe party took place in the Oniru area of the state.\nA statement by the police spokesman in the state, Adekunle Ajisebutu, on Saturday partly reads, “It’s regrettable that in spite of series of warnings and sensitisations carried out by the Police and other relevant government agencies, some individuals could be handling such combustible substance in a public place in total disregard to safety of lives and properties.\n“Still concerned about the safety, and protection of lives and properties of citizens, the Lagos State Police Command once again appeals to citizens to avoid this kind of condemnable act in the name of generosity.\n“Although the event centre where the distribution of the souvenirs took place has been located and subsequently sealed, the Commissioner of Police, CP Abiodun Alabi, fdc, mnim, has in addition, ordered the arrest of all persons involved in this regrettable and reprehensible act.”"
  },
  {
    "headline": "Pictures: Third batch of Nigerians trapped in Ukraine arrive Abuja",
    "summarized_story": "As Russian troops continue to invade the cities of Ukraine, the third batch of Ukraine-based Nigerians from Hungary have touched down at the Nnamdi Azikiwe International airport, Abuja, Nigeria’s capital.\nNo fewer than 165 Nigerians arrived Friday night at about 11:50 pm local time from Budapest, Hungary."
  },
  {
    "headline": "Breaking: Russia declares partial ceasefire as evacuation begins, Ukraine fires warning shot",
    "summarized_story": "Russia declared a partial ceasefire on Saturday to allow humanitarian corridors out of the Ukrainian cities of Mariupol and Volnovakha, Russia’s defence ministry said.\n“From 1000 am Moscow time (0700 GMT), the Russian side declares a ceasefire and the opening of humanitarian corridors to allow civilians to leave Mariupol and Volnovakha,” Russian news agencies quoted the Russian defence ministry as saying.\nUkraine said it planned to evacuate 200,000 people from Mariupol and 15,000 from Volnovakha, with the Red Cross acting as the guarantor of the ceasefire.\nMeanwhile, Ukraine’s Deputy Prime Minister Iryna Vereshchuk has warned that Russia must not take advantage of an agreed humanitarian corridor to advance its troops.\nShe said her government was “verifying” information that Russian troops were using the ceasefire to move closer to Ukrainian positions in areas along the evacuation routes."
  },
  {
    "headline": "Nigerian Students Trapped In Ukraine Appeal For Urgent Evacuation",
    "summarized_story": "﻿Many Nigerian students trapped in Sumy, Ukraine have called for urgent evacuation back home amid a Russian invasion.\nThe Federal government has evacuated more than 1,000 Nigerians who made it out of Ukraine to neigbouring countries such as Poland and Romania.\nBut the students in Sumy are yet to find a way out of war-torn Ukraine.\n“We are in Sumy and we are stuck in Sumy,” one of the students said during a protest held under snowy conditions.\n“This is Day 10, people don’t have water, people don’t have light in hostels."
  },
  {
    "headline": "Since 2015 Nigeria Has Retrogressed As A Nation – Obasanjo",
    "summarized_story": "﻿Former President Olusegun Obasanjo on Saturday said Nigerian efforts to build a nation has undergone significant decline since 2015.\n“If in 2015, Nigeria was 75 percent a country and 50 percent a nation, today, Nigeria will not be more than 50 percent a country and 25 percent a nation,” Obasanjo said.\nI mean Nigerians in all walks of life: politicians, community leaders, traditional leaders, religious leaders, diplomatic leaders, leaders in the academia, leaders in all aspects of government life, and leaders in other aspects of civil society.\n“We need to be clear about what Nigeria needs today and why Nigeria needs it,” he said.\n“As for me, the major issue for me is how to progress Nigeria from a country to a nation."
  },
  {
    "headline": "‘More Risky’: The Nigerians Who Don’t Want To Return From Ukraine",
    "summarized_story": "﻿As of Saturday morning, the Federal Government had evacuated nearly a thousand Nigerians fleeing Ukraine.\nBut not every Nigerian caught in the ongoing war between Russia and Ukraine wishes to return home.\nSo why should I come home?”Evacuation flightsMore than 700 Nigerians were evacuated from Poland, Hungary and Romania on Friday.\nThe Federal Government on Wednesday said it has approved $8.5m for the evacuation of citizens fleeing Ukraine.\nAlthough some Nigerians are still stuck in Ukraine, many have made it to neigbouring countries where the evacuation flights are taking off from."
  },
  {
    "headline": "Lagos Seals Event Centre Where Petrol Was Shared As Souvenir",
    "summarized_story": "The Lagos State Government on Saturday said it had sealed an event centre where kegs of petrol were reportedly handed out as souvenirs.\n“Lagos State Government through the Lagos Safety Commission and the Rapid Response Squad has sealed Havillah Event Centre, Oniru, for Contravening Public Safety Rules (Fuel Souvenir),” a statement signed by government spokesperson Gbenga Omotosho said.\nA video of the petrol kegs being shared had went viral on social media prompting the government to open an investigation.\n“The Lagos State Government says all those involved in such unlawful act will face the law.\nBelow are photos of the event centre released by the state government:"
  },
  {
    "headline": "Ukraine Steps Up Pleas For Warplanes And Other Military Aid",
    "summarized_story": "Ukraine on Saturday urged the West to amp up military assistance to the besieged country, including warplanes, as Russian President Vladimir Putin escalated warnings against NATO.\nKyiv had asked Israel — which has strong relations with both Russia and Ukraine — to launch a dialogue with Moscow.\nThe siege came as Russian forces inched closer to the capital, Kyiv, in an assault that has become ever more indiscriminate — and deadly.\nCapturing Mariupol, however, would severely limit Ukraine’s maritime access and allow Russian forces to connect by land with troops from annexed Crimea and the Donbas.\nCNN said it would halt broadcasting in Russia, while independent Russian newspaper Novaya Gazeta said it would remove Ukraine content."
  },
  {
    "headline": "Lassa fever: Edo govt confirms 136 persons affected by outbreak",
    "summarized_story": "The Edo state government has expressed concern about the recent increase in the number of confirmed cases of Lassa fever in the state, which has claimed the lives of several persons.\nThe commissioner for health, Obehi Akoria, told journalists after the state executive council meeting on Wednesday that 136 people had been infected, with a fatality rate of 13%.\nThe new outbreak, according to her, is widespread throughout the Etsako West and Esan West local government regions of the state.\nShe further stated that concentrated efforts and steps had been implemented in order to prevent the sickness from spreading further."
  },
  {
    "headline": "Niger Govt signs MoU on Vaccine Initiative GAVI",
    "summarized_story": "Niger State Government has signed a Memorandum of Understanding with Global Alliance on Vaccine Initiative GAVI, Federal Government and the UNICEF with the aim of strengthening the Routine Immunization System.\nThe MoU which has thematic focus on Zero Dose Burden of children under the age of five especially Pentavalent first dose (combination of five different vaccines) given at six weeks of age, was signed at Aso Villa Abuja, the Nation’s Capital.\nHe assured of the government’s readiness to meet up with its responsibilities as outlined in both MOUs.\nNigeria was billed to exit the GAVI MoU in 2021 but has been extended to 2028.\nThe Foreign mission also commended Nigeria government and the states that signed the MoU for their efforts at strengthening the health systems both in the country in their various states even in the face of insecurity in some states"
  },
  {
    "headline": "COVID 19 vaccination: Gavi team reviews Nigeria's immunization cold chain",
    "summarized_story": "A Gavi team is currently at the national strategic cold store in the nation’s capital on an inspection review to assess Nigeria’s immunization cold chain.\nLeading the team the UNICEF director of supply division Etleva Kadilli said the assessment is an opportunity for a review of the country’s comprehensive immunization supply chain strengthening strategy as the country kick starts a new phase of its mass vaccination campaign.\nHealth authorities had recently launched the scales 2.0 strategy which is aimed at improving routine immunization in the countryThe strategy was first introduced last year by the primary heath care development agency to rapidly ramp up COVID-19 vaccine coverage by expanding access to vaccines outside health facilities."
  },
  {
    "headline": "Covid-19: South Africa approves Pfizer vaccine for children aged 5-11 years",
    "summarized_story": "The use of the Pfizer vaccination for children aged 5 to 11 has been approved in South Korea due to the outbreak of the Omicron coronavirus strain.\nChildren would be given two injections with an interval of three weeks.\n“Korean Ministry of Food and Drug Safety approved the use of the imported Pfizer Korea ‘Comirnaty 0.1 mg/ml (for children 5-11 years)’ vaccine for people 5-11 years old,” the ministry said in a statement.\nSince the start of the pandemic, South Korea has seen 2,329,182 COVID-19 cases, with 969,524 recoveries and 7,607 fatalities.\nCOVID-19 has already been immunized against 58.6% of the country’s population with a booster vaccination dose."
  },
  {
    "headline": "War in Ukraine: Zelensky Slams Nato Over Rejection of No-Fly Zone",
    "summarized_story": "Ukraine’s president has attacked Nato leaders in a fiery speech over their refusal to implement a no-fly zone around the country.\nNato has argued that a no-fly zone will result in confrontation with Moscow.\nBut Mr Zelensky said he disagrees that direct action could “provoke Russia’s direct aggression against Nato”.\nOn Friday, Nato’s secretary-general, Jens Stoltenberg, warned that the introduction of a no-fly zone could lead to a “full-fledged war in Europe involving many more countries and causing much more human suffering”.\nUS Secretary of State Antony Blinken also ruled out the introduction of a no-fly zone, but told the BBC he is convinced Ukraine can win its war with Russia."
  },
  {
    "headline": "Russia Announces Ceasefire in Two Besieged Ukrainian Cities",
    "summarized_story": "The Russian military will observe a ceasefire in two areas of Ukraine starting Saturday to allow civilians to evacuate, Russian state media reported, but there was no immediate confirmation from Ukraine.\nIn a bitter and emotional speech late Friday, Zelenskyy criticized NATO over the lack of a no-fly zone, saying it will fully untie Russia’s hands as it escalates its air attack.\nIn a separate video message to antiwar protesters in several European cities, Zelenskyy continued to appeal for help.\nThe U.N. Security Council will hold an open meeting Monday on the worsening humanitarian situation.\nThe U.N. estimates that 12 million people in Ukraine and four million fleeing to neighboring countries in the coming months will need humanitarian aid."
  },
  {
    "headline": "Loads of Goodwill Messages Pour in for Obasanjo at 85",
    "summarized_story": "Saraki said: “Baba, you have continued to bring honour to our country, Nigeria, and her over 200 million citizens.\nFormer Senate President, Senator Anyim Pius Anyim described Obasanjo as a foremost statesman and citizen of the world.\nYou have demonstrated unwavering commitment to the unity, peace and progress of our dear country, Africa and the world at large.\n“Baba, I want to assure you that Nigerians appreciate you and your noble contributions to the peace, unity, progress and development of our dear country.\nMay He continue to uphold you as you continue your worthy service to our dear country, Africa and the world at large.”"
  },
  {
    "headline": "US Senator Urges Russians to Assassinate Putin",
    "summarized_story": "US Senator, Lindsey Graham has called for “somebody in Russia” to assassinate Putin.\nThe Republican Senator called for Julius Caesar-style assassination of the Kremlin strongman, currently leading an invasion of Ukraine, during an appearance on Fox News’ Hannity show and in a series of tweets on Thursday.\nIs there a more successful Colonel Stauffenberg in the Russian military?” he tweeted, referencing the army officer who attempted to kill Adolf Hitler.\n“The only way this ends is for somebody in Russia to take this guy out.\nGraham’s call for Putin to be assassinated comes as the Russian leader continues to indiscriminately bomb cities in Ukraine."
  },
  {
    "headline": "804 Nigerians Fleeing Ukraine Evacuated, Land in Abuja",
    "summarized_story": "Nigeria’s federal government on Friday evacuated 804 Nigerians fleeing the devastation caused by Russia’s invasion of Ukraine.\nPresident Muhammadu Buhari, who condemned the ugly development, said there were about 4,000 Nigerians in Ukraine, mostly students.\nThe scholars also noted that the invasion “will stain” the international reputation of the Russian state for decades to come.\n“The Russian invasion will stain the international reputation of the Russian state for decades to come.\nThe fire was extinguished by the Ukrainian State Emergency Service units,” the State Nuclear Regulatory Inspectorate of Ukraine said in a statement."
  }
]