[
  {
    "headline": "BREAKING: Former Oyo Military Administrator Tunji Olurin is dead",
    "summarized_story": "The former Military Administrator of Oyo State and a close political ally of former President Olusegun Obasanjo, Brig-Gen. Tunji Olurin (rtd.)\nOlurin, who died at the Lagos State University Teaching Hospital in the early hours of Saturday, according to family source, was 77.\nAccording to him, Olurin died after a brief illness.\nRead AlsoOlurin, who was also a former Military Administrator of Ekiti State from October 8, 2006 until April 27, 2007, hailed from Ilaro in Ogun West Senatorial District of Ogun State.\nHe was the Peoples Democratic Party’s governorship candidate in the 2011 general election in Ogun State."
  },
  {
    "headline": "Unizik student commits suicide, allegedly over tuition hike",
    "summarized_story": "A 200-level male student of Nnamdi Azikiwe University Awka, Anambra State has reportedly committed suicide over alleged hike in school fees.\nThe deceased, a native of the Isuikwuato Local Government Area of Abia State, was said to be studying Industrial Physics.\nRead AlsoThe Chief Security Officer of the Institution, Ken Chukwura, said the deceased’s roommates had been invited for questioning while investigation had commenced.\nA combined team of school security, the Nigeria Police Force and top principal officers of the institution were present before the corpse was evacuated to the mortuary.\nThe students of the institution had recently protested for five days over hike in tuition."
  },
  {
    "headline": "[SPONSORED] 62year old Lagos woman Reveals Eye treatment Remedy that Reverses Glaucoma, Cataracts and Improves Vision without surgery or eyedrops",
    "summarized_story": "A pack of eye restore tea contains 20 tea bags, which you use daily, morning and evening.\nHere’s how this special herbal tea works…– When you order for the Eye Restore Tea, each pack contains 20 tea bags.\nLuckily, a friend introduced me to Eye restore tea, so I decided to give it a trial.\nEye restore tea, is like giving you a brand new set of perfect eyeballs faster, more safer, and more easily.\nDrink eye restore tea daily, 1 tea bag morning and evening, send in your testimonials."
  },
  {
    "headline": "BREAKING: Ex-Oyo military administrator Olurin dies at 78",
    "summarized_story": "By Adeola Badru – IbadanAdetunji OlurinThe former military governor of Oyo State, Brigadier General Adetunji Idowu Olurin (retd) is dead.\nOlurin, who served as a military governor in Oyo State between 1985 and 1988 died at the age of 78 years.\nThe septuagenarian who hails from Ilaro in Ogun State, died at the Lagos University Teaching Hospital (LUTH), Vanguard learned.\nDetails of his death were still sketchy as of the time of filing this report but a family source who did not want his name in print confirmed the incident.\nVanguard News Nigeria"
  },
  {
    "headline": "[SPONSORED] Lagos New Town, a new community developed by Mixta Africa",
    "summarized_story": "Nigeria’s largest city, Lagos, is home to more than 22 million people.\nMixta Africa, a leading real estate development company in Africa launched a new community called Lagos New Town on the 28th June 2021.\nLagos New Town is one of the fastest growing areas in Lagos, located in a serene environment far removed from the hustle and bustle of the city.\nIn this new community, there are already several neighbourhoods you might be familiar with such as Lakowe Lakes Golf and Country Estate, Beechwood Estate, Adiva and Townsville.\n“Not many people realize the extent of the challenge we have in the city of Lagos."
  },
  {
    "headline": "Golf: Nigeria Cup to kick-start with qualifiers",
    "summarized_story": "Corporate sponsors of the Nigeria Cup have also been making inquiries with respect to being part of the sponsorship class.\nThe Committee, which has been working to provide the best Nigeria Cup tournament ever, has the responsibility to raise funds and execute plans for the week-long competitions.\nALSO READ: Arsenal complete Martin Odegaard signing from Real MadridThe Nigeria Cup series of golf competitions for six different categories of golfers and is organised annually by the Ikoyi Golf Community Nigeria Association (IGCNA) and hosted by Ikoyi Club 1938.\nSince its debut in 1997, The Nigeria Cup has grown to become the most popular and glamorous amateur golf event in Africa.\nIn consonance with the present community health conditions and objectives of the times, the 2021 Nigeria Cup will be held with the observation of full and strict COVID-19 Protocols."
  },
  {
    "headline": "SEGUN ODEGBAMI: Sports – The universal level playing field for the Black race!",
    "summarized_story": "The Black people of the world need Nigeria to be great, as a source of pride and confidence”.\nBlack people are the only race in the World that do not relate to their history and their roots.\nIf Black African Americans should wake up one day and accept Africa as their home?\nNigeria is the most vilified Black country on earth.\nThe only field where he can do so for now and succeed is on the level playing ground of global sport."
  },
  {
    "headline": "Security agencies need personnel, equipment to combat insurgents – Tambuwal",
    "summarized_story": "Governor Aminu Tambuwal has suggested that equipment, personnel and joint decisive efforts are needed by security forces in order to tackle the security issues in the region.\nHe assured the new GOC of his administration’s sustained and improved collaboration with the Army and other security agencies, explaining that plans are underway to tackle the problem.\nResponding, Gen. Bassey noted that the support of every citizen of the state is required in order to maintain peace.\nHe hailed Governor Tambuwal for convening the security summit held with all stakeholders in the state.\nGov Tambuwal announces recruitment of 1,192 health personnel in Sokoto"
  },
  {
    "headline": "Ikpeazu reiterates commitment to enhance ABSUTH",
    "summarized_story": "Governor Okezie Ikpeazu has assured that his administration is committed to the development of the Abia State University Teaching Hospital (ABSUTH), the Medical Faculty and promotion of the welfare of the staff.\nIkpeazu said his government was committed to the payment of salary to the staff while it expects a little more patriotism, commitment and innovativeness from the management and staff of the organization.\nEarlier in his remarks, Nwana commended the governor for the giant strides recorded in the state especially the ongoing reconstruction of ABSUTH road Aba.\nProfessor Wanah noted that ABSUTH has produced great medical practitioners who are doing well across the world.\nGov Ikpeazu assures NARD of resolution of outstanding issues"
  },
  {
    "headline": "Ahmed Joda: Nigeria’s situation hopeful, many nation builders in the making – Atiku",
    "summarized_story": "Former Vice President, Atiku Abubakar has said Nigeria is a land of hope, with many nation builders coming up.\nAtiku, who spoke in the Adamawa State capital, Yola, while on a condolence visit to the home of the late Ahmed Joda, said specifically that many Ahmed Jodas are being bred.\n“Ahmed Joda spent his life in service to this country.\nThere are many Ahmed Jodas in the making,” Atiku said.\nHow Ahmed Joda, others saved Nigeria – Obasanjo"
  },
  {
    "headline": "Nnamdi Kanu: Former Senator, Anyanwu challenges S/East governors, leaders to unite against injustice",
    "summarized_story": "Former Nigerian Senator, Samuel Anyanwu has challenged governors of Igbo extraction, traditional rulers, religious and political leaders in the South East to unite against injustice meted out on the zone.\nHe said Mazi Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), remains innocent of the whole allegations against him until a competent court of higher jurisdiction proves otherwise.\nHis words, “When the Igbo begin to desert their own to incarcerate in the prison, strangers will seize to accord respect to them.\nAll hands must be on deck irrespective of political affiliations to ensure the speedy release of one of our own.\nImo gains nothing from being only APC state in Southeast – Political analyst"
  },
  {
    "headline": "LASU student activist, Omomeewa shot dead, union, management react",
    "summarized_story": "Yusuf Nurudeen, a.k.a Omomeewa, a student activist at the Lagos State University (LASU), has been shot dead.\nLASU Students’ Union President, Badmus Uthman, and Public Relations Officer, Olusola Kolawole, confirmed his death in a statement.\nNurudeen contested for the post of Students’ Union President in the 29th LASUSU Election but lost, the duo said he remained diligent and never engaged in illegal activities.\nThey noted that on 18th August, 2021, Omomeewa and a LASU staff member, Waheed Majekodunmi, were robbed and shot around 10 pm.\nLASU student sentenced to 21 years’ imprisonment for raping fellow students"
  },
  {
    "headline": "Three storey building collapses on Enugu council chief’s residence",
    "summarized_story": "Ndukwe Okechukwu Bamidele and his family escaped unhurt when a three-storey building under construction collapsed at Nweke Okuzu Street, Ugbene two, Abakpa Nike, Enugu.\nThe building, which is located behind the popular Timber Market, Abakpa Nike Enugu, collapsed on Friday night on the residence of the local government’s chief.\n“As you can see, my parlour and the adjourning rooms were completely shattered by the collapsed building which entered my own compound.\nADVERTISEMENTIt was learnt that almost all the materials needed for the windows and doors of the collapsed building were already inside the building.\nThe building is said to have been abandoned for years following the death of the owner about two years ago."
  },
  {
    "headline": "JUST IN: Ex- MIlitary Governor Olurin dies at 76",
    "summarized_story": "Former Military Governor of old Oyo, General Tunji Olurin, is dead.\nOlurin, who governed Oyo from 1985-1988, was born in Ilaro,Ogun state on December 3,1944.\nThe Nation learnt he passed on Saturday morning at the Lagos University Teaching Hospital(LUTH) after a brief illness.\nADVERTISEMENTGeneral Olurin served as the Field Commander of the ECOMOG Peace keeping Force in Liberia between 1992 to 1993.\nAfter his retirement from the military, he went into farming and later joined the People’s Democratic Party (PDP) on which platform he contested the Ogun governorship election in 2011 but lost to Governor Ibikunle Amosun."
  },
  {
    "headline": "PHOTOS: Itsekiris on a barge heading for Ode-Itsekiri",
    "summarized_story": "BBNaija Shine Ya Eye housemate Maria has said she suspects Liquorose and Emmanuel are using the condom in the house...."
  },
  {
    "headline": "PHOTOS: Itsekiris awaiting arrival of Omoba",
    "summarized_story": "BBNaija Shine Ya Eye housemate Maria has said she suspects Liquorose and Emmanuel are using the condom in the house...."
  },
  {
    "headline": "Masari’s call for self-defence: Groups tackle FG over Igboho, Kanu",
    "summarized_story": "Chief Sunday Adeyemo, also known as Igboho, is a prominent member of the Ilana Omo Oodua, championing self-determination for Yoruba nation.\nSaid he: “The comments by Gen Magashi and Governor Masari are by far more harmful to this nation than what Igboho would do.\nHe said: “This comment coming from Governor Masari is a welcome development and indicate two things.\n“Firstly, that the government of the day cannot defend Nigerians and they should admit that and allow Nigerians to defend themselves and even support and empower Nigerians across the country to defend themselves if they are not part of this problem.\n“Secondly, it shows that Igboho in the South-West and Nnamdi Kanu in the South-East have been vindicated over their agitations."
  },
  {
    "headline": "Malami: I have no hands in Igboho’s travails",
    "summarized_story": "From Oluseye Ojo, IbadanMinister of Justice and Attorney-General of the Federation, Abubakar Malami(SAN) has said he did not have any hand in the raid conducted by the Department of State Services (DSS) in the residence of Yoruba nation activist, Chief Sunday Adeyemo fondly called Sunday Igboho, in the early hours of July 1, 2021, in Ibadan, the Oyo State capital.\nBesides, Malami said the DSS did not inform him before carrying out the raid, adding that he is not a Fulani man as alleged by Igboho.\nThe submissions were contained in an affidavit, deposed to on August 18, 2021 by one Thomas Etah, who is a civil servant at the Federal Ministry of Justice Headquarters, Abuja.\nEtah, in the affidavit, said Malami, who is the first respondent in the case with number M/435/2021, “is conversant with the facts deposed herein.” The case was instituted by Igboho, against the trio of AGF as first respondent, DSS as second respondent, and Director of DSS in Oyo State as third respondent.\nHe stated further that Malami “did not approach any bank or financial institution in Nigeria or anywhere else in the world to block and/or place no debit on the account of the applicant (Igboho).”"
  },
  {
    "headline": "PIA: N’Delta communities may head to court",
    "summarized_story": "He accused them of being insensitive to the plight of the Niger Delta people and threatened that they would be greeted with boos and jeers anytime they come to the Niger Delta region.\nThe governors can collect the money and ensure that not one per cent gets to communities that produce oil but expended on communities without oil,” he said.\nKing Bubaraye Dakolo, Adaga IV, Ibenenaowei of Ekpetiama Kingdom wants Niger Delta lawyers to head to court over the Act.\n“Putting this around the neck of oil communities is stigmatization.\nAccusing the PIA of treating oil producing communities like the subjects of oil companies by empowering these companies to take all decisions about the Host Communities Trust and Fund on behalf of oil producing communities, he urged them to challenge the provisions of the Act in the Supreme Court."
  },
  {
    "headline": "How P-Square’s Paul Okoye’s marriage crashed",
    "summarized_story": "By Christian AgadibeThe marriage between Paul Okoye aka Rude Boy, one half of the defunct music group, P-Square and his entrepreneur wife, Anita Tonye Okoye is over as the latter has filed for divorce.\nThe couple got married in 2014 after dating for 10 years and they both have three beautiful children together.\nThe news of the couple’s impending divorce comes as a rude shock to both of their families and close friends.\nThe source further revealed that both parties will proceed amicably with the legal resolution of the marriage and be the best parents to their children.\nAll efforts to reach Paul Okoye for confirmation have been unsuccessful."
  },
  {
    "headline": "You want to get a visa? These simple steps might lead to success",
    "summarized_story": "There are various categories of visas ranging from; immigrant to non-immigrant visa, work visa, study visa, exchange visitor visa, business/conference visa, and the B1/B2 (visitor visa).\nOthers are; I visa (Journalist and Media), religious worker visa, transit/ship crew visa, domestic employee visa.\nAlso include the evidence of your visa application fee in your application package.\nThe visa official is not interested in losing a day hearing everything about you – unneeded and irrelevant information.\nNine: Avoid disagreeing with the visa officialArguing with the visa official during the interview session is another reason the entire visa interview session might go wrong."
  },
  {
    "headline": "FG: We’re Not Prosecuting Repentant Terrorists in Line with Global Practices",
    "summarized_story": "The Minister of Information and Culture, Alhaji Lai Mohammed stated this yesterday in Washington, U.S.A., during his engagement with global media outlets, think-tanks and influencers.\nMohammed also said government will not recruit the repentant Boko Haram fighters, who have been surrendering to the military, into the Nigerian Army as being rumoured in some quarters.\nNo fewer than 1,000 Boko Haram fighters and their families had handed themselves over to Army units in recent weeks in the southern Borno towns of Konduga, Bama, and Mafa.\nThe Information Minister also disclosed this yesterday during his engagement with global media outlets, think-tanks and influencers.\nHe underscored the need for the developed world to see terrorism as a global threat, saying: “Terrorism is global and has no boundary."
  },
  {
    "headline": "Top Leaders Storm Bichi for Yusuf Buhari and Zahra Bayero’s Wedding",
    "summarized_story": "Ibrahim Shuaibu in KanoYusuf, son of President Muhammadu Buhari, yesterday married Zahra, the daughter of the Emir of Bichi, Alhaji Nasir Ado Bayero, in presence of the President, Vice President Yemi Osibanjo and other dignitaries.\nYusuf, who met his wife Zahra, a graduate of Architecture from Brighton University, in the United Kingdom, paid N500,000 as bride price.\nThe elated groom, Yusuf Buhari, dressed in traditional white attire with a head gear to match, was surrounded by his friends throughout the ceremony.\nTHISDAY gathered that VIPs had since Thursday thronged Kano State, as hotel rooms became scarce as they were all booked to accommodate the guests.\nBichi is a subset of the entire Kano State, look at the economy and the activities that have happened in Bichi today by virtue of Mr. President’s son’s wedding to Sarkin Bichi’s daughter."
  },
  {
    "headline": "Jonathan, Johnson-Sirleaf Move to Foster Peace in W’Africa",
    "summarized_story": "*Fine-tune proposed West Africa Elders ForumBennett OghifoFormer President Goodluck Jonathan and former President of Liberia, Ellen Johnson-Sirleaf, met late into last Thursday night in Abuja to brainstorm on measures that could help foster peace and political stability in West Africa.\nJohnson-Sirleaf said: “The main purpose of this visit, besides re-establishing good contact with him (Jonathan), is to promote the good relationship that we have.\n“It is also to discuss with him, the planned West Africa Elders Forum, an initiative that he (Jonathan) is promoting through his President Goodluck Jonathan Foundation.\nShe said: “I came to let him know that we promote women to ascend higher positions in public service.\n“Whatever he does here with the West Africa Elders Forum is something that will go beyond Nigeria, beyond West Africa.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "NNPC Upbeat as it Regains Ogoni OML 11 from Shell in Court",
    "summarized_story": "OML 11 is in Ogoniland, Rivers State, South-eastern Niger Delta and contains 33 oil and gas fields.\nThe Appeal Court sitting in Abuja had on Monday upturned the August 23, 2019 ruling of the Federal High Court, Abuja which held that the Shell Petroleum Development Company (SPDC) was entitled to the renewal of the lease on OML 11.\n“We now have an opportunity to reconstruct a new beginning on OML 11, driven by global best practices and a social contract that would put the people and environment of the Niger Delta above pecuniary considerations.\n“It is time to roll back the decades of despair and destruction with the emphatic Appeal Court ruling.\nThe NNPC, the NPDC is now set to begin oil production activities at OML 11, after years of dispute over the asset."
  },
  {
    "headline": "News in Photographs: Eminent Nigerians in Kano for Yusuf Buhari’s Wedding",
    "summarized_story": "Vice President Yemi Osinbajo, former President Goodluck Jonathan, former Vice President Atiku Abubakar, state governors, ministers, business leaders, traditional rulers and top government officials were among eminent Nigerians that converged on Kano Friday for the solemnisation of the marriage between President Muhammadu Buhari’s son, Yusuf, and Zahra, daughter of Emir of Bichi, Nasiru Ado Bayero.\nAlso in Kano for the ceremony was the former Niger Republic President Mahamadou Issoufou.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Petroleum Bill: Shameless Nigerian Lawmakers Battle Senate President Lawan, House Speaker Gbajabiamila Over Lopsided Sharing Of Multi-million Dollar Bribe",
    "summarized_story": "A top source told SaharaReporters that other federal lawmakers –senators and House of Representatives' members –also received bribes in dollars to ensure the passage of the bill.\n\"Lawan was paid $2 million (N823 million) while Gbajabiamila was paid $1.5 million (N617 million) as bribes,\" the source said.\n“The Senate President received $2 million and the Speaker received $2 million.\nLawmakers said the cash logistics was coordinated by state petroleum minister Timipre Sylva and Senator Albert Akpan (PDP-Akwa Ibom).\n“A lawmaker protested the sharing formula but no one responded or engaged him in the House' WhatsApp group,” the lawmaker said."
  },
  {
    "headline": "Petroleum Bill: Shameless Nigerian Lawmakers Battle Senate President Lawan, House Speaker Gbajabiamila Over Lopsided Sharing Of Multi-million Dollar Bribe",
    "summarized_story": "A top source told SaharaReporters that other federal lawmakers –senators and House of Representatives' members –also received bribes in dollars to ensure the passage of the bill.\n\"Lawan was paid $2 million (N823 million) while Gbajabiamila was paid $1.5 million (N617 million) as bribes,\" the source said.\n“The Senate President received $2 million and the Speaker received $2 million.\nLawmakers said the cash logistics was coordinated by state petroleum minister Timipre Sylva and Senator Albert Akpan (PDP-Akwa Ibom).\n“A lawmaker protested the sharing formula but no one responded or engaged him in the House' WhatsApp group,” the lawmaker said."
  },
  {
    "headline": "EXPOSED: Dollar Bribes Received By Nigeria's Senate President, Lawan, House Speaker Gbajabiamila, Other Lawmakers To Pass Controversial Petroleum Bill",
    "summarized_story": "Nigeria's Senate President, Ahmad Lawan and the Speaker of the House of Representatives, Femi Gbajabiamila were paid in dollars (millions of naira) to ensure the passage of the controversial Petroleum Industry Bill (PIB) recently signed into law by President Muhammadu Buhari, SaharaReporters has learnt.\n\"Lawan was paid $2 million (N823 million) while Gbajabiamila was paid $1.5 million (N617 million) as bribes,\" the source said.\nThe Nigerian Senate recently passed the Petroleum Industry Bill approving 3 per cent for host communities despite calls from various quarters that the provisions made for host communities should be reviewed upward.\nTheir president, Benjamin Tamanarebi said the PIB passed by NASS was a fruitless exercise and unacceptable to the host communities.\nIn their July 5 meeting, governors of Nigeria’s southern states also rejected the proposed three per cent share to host communities in the Petroleum Industry Bill."
  },
  {
    "headline": "EXPOSED: Dollar Bribes Received By Nigeria's Senate President, Lawan, House Speaker Gbajabiamila, Other Lawmakers To Pass Controversial Petroleum Bill",
    "summarized_story": "Nigeria's Senate President, Ahmad Lawan and the Speaker of the House of Representatives, Femi Gbajabiamila were paid in dollars (millions of naira) to ensure the passage of the controversial Petroleum Industry Bill (PIB) recently signed into law by President Muhammadu Buhari, SaharaReporters has learnt.\n\"Lawan was paid $2 million (N823 million) while Gbajabiamila was paid $1.5 million (N617 million) as bribes,\" the source said.\nThe Nigerian Senate recently passed the Petroleum Industry Bill approving 3 per cent for host communities despite calls from various quarters that the provisions made for host communities should be reviewed upward.\nTheir president, Benjamin Tamanarebi said the PIB passed by NASS was a fruitless exercise and unacceptable to the host communities.\nIn their July 5 meeting, governors of Nigeria’s southern states also rejected the proposed three per cent share to host communities in the Petroleum Industry Bill."
  },
  {
    "headline": "Stop Sending Me Fake Prophecies, Visions On Nnamdi Kanu – Lawyer Warns Clerics",
    "summarized_story": "The lead counsel to Nnamdi Kanu, the leader of the Indigenous People of Biafra, Ifeanyi Ejiofor, has said that he could no longer tolerate the myriads of prophecies and visions sent to his electronic mail daily, while warning that clerics should stop the practice.\nEjiofor added that the array of “fake prophecies” was a distraction to the ongoing legal processes, while asking such prophets and soothsayers to desist from sending items to him.\n“Onyendu Mazi Nnamdi Kanu was visited on Thursday, he is stable and in a wonderful spirit.\nAll legal processes incidental to freeing him soon is efficiently active, but none shall be discussed here any longer,” he noted.\nJustice Nyako had stated that the trial could continue in the absence of the IPOB leader since he was not available to stand his trial."
  },
  {
    "headline": "IDP Chronicles: Niger widows beg to survive after gruesome killing of their husbands",
    "summarized_story": "With little support available, many of the widows now depend on handouts to survive and feed their children.\nHalima, who was heavily pregnant at the time, said her children were shivering with fear while the bandits wreaked havoc and eventually killed her husband.\n“The bandits walked to my husband who was tied to a tree, pointing their monstrous weapon at him,” she recounted.\nLife as a widowAfter the tragedy, Halima took her children to an internally displaced persons (IDP) camp at Central Primary School Erena.\nTo survive and feed her children, Halima says she leaves the house every day to seek handouts and sometimes goes from door to door to beg for food."
  },
  {
    "headline": "IDP Chronicles: Niger widows beg to survive after gruesome killing of their husbands",
    "summarized_story": "With little support available, many of the widows now depend on handouts to survive and feed their children.\nHalima, who was heavily pregnant at the time, said her children were shivering with fear while the bandits wreaked havoc and eventually killed her husband.\n“The bandits walked to my husband who was tied to a tree, pointing their monstrous weapon at him,” she recounted.\nLife as a widowAfter the tragedy, Halima took her children to an internally displaced persons (IDP) camp at Central Primary School Erena.\nTo survive and feed her children, Halima says she leaves the house every day to seek handouts and sometimes goes from door to door to beg for food."
  },
  {
    "headline": "Pantami: Communications ministry generated over N1trn revenue in two years",
    "summarized_story": "The federal ministry of communications and digital economy says it generated N1.054 trillion as revenue for the federal government in two years.\nAdvertisementIsa Pantami, minister of communications and digital economy, spoke during the virtual inauguration of the 12th batch of the digital economy projects at the Digital Economy Complex, Mbora, Abuja.\nAdvertisement“Our activities in the communications and digital economy sector have greatly enhanced the economy of Nigeria.\n“This growth rate was the only double-digit growth rate and it exceeded the aggregate growth rates of all the 2nd to the 7th fastest growing sectors.\nAdvertisementThe digital economy projects inaugurated include the e-Accessibility Centre in Bauchi State Orphans and Vulnerable School, Bauchi; the Digital Economy Centre and e-Learning Facility at Ogba Grammar School, Lagos; the Digital Economy Centre and e-Learning Facility at St Paul Secondary School, Eke, Enugu."
  },
  {
    "headline": "Pantami: Communications ministry generated over N1trn revenue in two years",
    "summarized_story": "The federal ministry of communications and digital economy says it generated N1.054 trillion as revenue for the federal government in two years.\nAdvertisementIsa Pantami, minister of communications and digital economy, spoke during the virtual inauguration of the 12th batch of the digital economy projects at the Digital Economy Complex, Mbora, Abuja.\nAdvertisement“Our activities in the communications and digital economy sector have greatly enhanced the economy of Nigeria.\n“This growth rate was the only double-digit growth rate and it exceeded the aggregate growth rates of all the 2nd to the 7th fastest growing sectors.\nAdvertisementThe digital economy projects inaugurated include the e-Accessibility Centre in Bauchi State Orphans and Vulnerable School, Bauchi; the Digital Economy Centre and e-Learning Facility at Ogba Grammar School, Lagos; the Digital Economy Centre and e-Learning Facility at St Paul Secondary School, Eke, Enugu."
  },
  {
    "headline": "Lai: FG’s decision not to prosecute repentant insurgents in line with global best practice",
    "summarized_story": "Lai Mohammed, minister of information and culture, says the decision by the federal government not to prosecute repentant insurgents is “in line with global best practice”.\nAdvertisementMohammed said this on Friday in Washington DC, United States, during his engagement with global media outlets.\nFollowing the mass surrender of Boko Haram insurgents, some Nigerians have kicked against the de-radicalisation and rehabilitation initiative for the insurgents by the Nigerian army under the Safe Corridor programme.\nBut Mohammed said the call for the prosecution and killing of the repentant insurgents rather than granting them amnesty is against global best practices.\n“You cannot just shoot them because there are international conventions that give rights also to prisoners of war."
  },
  {
    "headline": "Explained: Can the Nigerian government really spy on your WhatsApp messages?",
    "summarized_story": "However, some uncertainty hangs over how Nigerian authorities plan to go about intercepting WhatsApp, particularly because the platform uses end-to-end encryption for its messages.\nStorage loopholesThere are also vulnerabilities with how WhatsApp messages are stored, which could be exploited by hackers.\nWhatsApp chats are saved in four locations, from where data can be retrieved later.\nIt’s unclear how the Nigerian government intends to go about tracking WhatsApp messages after earmarking billions of naira for the said interception solution.\nWith over 90 million Nigerian users per data from Statista, WhatsApp is the most popular social media platform used in the country."
  },
  {
    "headline": "Meet Regina Honu, a Ghanaian software developer teaching thousands of girls to code",
    "summarized_story": "Failure is not finalIn her first year in senior secondary school, Honu had her first taste of failure during an Inter-school quiz competition.\nConversation between Regina Honu and students of Ashesi University during a visit.\nSame experience at another bank and turning away from a job at MicrosoftShe eventually left Zenith bank for Fidelity bank, a Ghanaian Bank.\nResigning from her JobThe morning of the day Honu resigned from her job, she didn’t know it would happen.\n10 years and countingIt’s been almost 10 years since Honu started Soronko Academy, for her there’s still so much more to do."
  },
  {
    "headline": "Nigeria’s Central Bank freezes bank accounts of fintech platforms Risevest, Bamboo, Trove and Chaka",
    "summarized_story": "The Central Bank of Nigeria has just frozen the bank accounts of Nigerian fintech platforms Risevest, Bamboo, Trove and Chaka for the next six months.\nNotably, all four companies affected by this action have gotten licenses from Nigeria’s Securities and Exchange Commission (SEC) to operate as digital platforms for buying and selling stocks.\n— Bamboo (@investbamboo) August 17, 2021So far none of the affected companies has come out to refute this claim.\nAccording to a source from one of the affected companies, they lost a lot of users and deposits after the April announcement.\nTechCabal has reached out to the affected fintech companies and is awaiting their comments."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "A Federal High Court sitting in Abuja has granted the Central Bank of Nigeria an order to freeze the accounts of..."
  },
  {
    "headline": "World Photography Day, Leaked NITDA bill, CashBackApp’s $475k pre-seed",
    "summarized_story": "Share this article:Good day,Today, I’m discussing:World Photography DayMore about the leaked NITDA billCashBackApp’s pre-seed roundWorld Photography DayYesterday was World Photography Day, and we explored the ancient Nigerian city of Ilé-Ifè in the south-western part of the country.\nMore about the leaked NITDA billIt seems like the conversation about the leaked NITDA bill isn’t ending anytime soon.\nCheck it out: 11 critical questions on the leaked NITDA bill; a tussle for more power?\nSneak peek: While the leaked bill suggests an expansion of the penalties in the old bill, it doesn’t require NITDA to collaborate with the Standards Organisation of Nigeria to enforce its regulations.\nCashBackApp’s pre-seed roundKenyan customer loyalty startup, CashBackApp, has raised $475,000 to help scale its service in Kenya and expand to neighbouring countries."
  },
  {
    "headline": "11 critical questions on the leaked NITDA bill; a tussle for more power?",
    "summarized_story": "It finally gained traction when a link to the leaked bill was released, and several screenshots of supposedly alarming provisions began to float all over social media.\nWhat the Agency does have is a host of functions which increase from 14 to 24 in the leaked bill.\nIn a preceding subsection, the leaked bill proposes a fine not exceeding ₦30,000,000 ($72,832.21).\nAfter a more in-depth search, the name Galaxy Information Technology and Telecommunication (GITT) cropped up.\nGalaxy Information Technology and Telecommunications Limited started as a Dutse-based ISP in 2001 and morphed into what is now Galaxy Backbone."
  },
  {
    "headline": "A walk of photographs through nature and culture in the ancient city of Ilé-Ifè",
    "summarized_story": "World Photography Day is celebrated annually on August 19 to commemorate the art, science, and technology behind photography.\nTo celebrate this special global event, we explored the ancient South-Western Nigerian city of Ilé-Ifè from a cultural and natural perspective.\nOur final stop was the Natural History Museum at the Obafemi Awolowo University, Ilé-Ifè, where we took pictures of current and historical records of animals, insects, and plants.\nMuseum of Natural History, Obafemi Awolowo University, Ile-Ife, Osun State.\nIt was a reminder of how much there is to know and understand about our natural world."
  },
  {
    "headline": "Edo First Lady, Betsy advocates investment in sports to tackle illegal migration, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…unveils logo for female football tourneyThe Edo First Lady, Mrs. Besty Obaseki, has unveiled the logo for Betsy Obaseki Women Football Tournament (BOWFT) 2021, with a commitment to harness the sporting talents in the state to empower more youths and tackle the scourge of irregular migration among teenage girls.\nSpeaking at the unveiling ceremony in Government House, Benin City, she said the event is another opportunity to assure young girls in the state that they have all that is required to realize their fullest potentials.\nThe event was attended by the Edo State Deputy Governor, Rt.\nPhilip Shaibu; his wife, Maryann and the Speaker of Edo State House of Assembly, Rt.\nHence, it is very easy to get our youths interested in sports, especially now, with the female football league, which is well known around the world,” she said."
  },
  {
    "headline": "World Bank applauds Obaseki’s deployment of tech to strengthen basic education, boost skills devt – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The World Bank has praised Edo State Governor, Mr. Godwin Obaseki for the deployment of technological innovations to drive reforms in basic education and skills development in the state.\nWorld Bank’s Senior Education and Technology Policy Specialist and Global Lead for Technology and Innovation in Education, Mr. Robert Hawkins, at a MasterCard sponsored programme, ED Tech, commended Governor Obaseki for bringing together stakeholders in the public and private sector to deliver major reforms in basic education and skills development in Edo State.\nAccording to him, effective leadership is necessary for constructive public-private partnerships that can take advantage of the knowledge that those in the private sector have and use it to meet the needs of the public sector.\nIn April 2018, the Obaseki-led administration implemented far-reaching reforms in the basic education sector, deploying technology-based modern methods of teacher training, lessons delivery, pupils’ evaluation and classroom management through the Edo Basic Education Sector Transformation (EdoBEST) programme.\nThe governor has now expanded the EdoBEST programme to capture secondary schools and tertiary institutions in the state."
  },
  {
    "headline": "COVID-19: Edo records 171 cases, three deaths in third wave – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestEdo State has recorded 22 new cases and one more COVID-19 related death, bringing the total number of deaths recorded in the third wave of the pandemic to three.\nThe State COVID-19 Incident Manager, Dr. Andrew Obi, disclosed this after the daily virtual meeting of the State COVID-19 Taskforce, chaired by the state governor, Mr. Godwin Obaseki.\nObi said the 22 new cases, raised the total number of confirmed cases in the state to 171, noting that Edo also recorded two more recoveries from the virus and collected 174 samples for testing.\nHe stated that over 95 percent of the newly confirmed cases are those who were never vaccinated, adding, “This is a clear indication that the vaccines provide significant protection against the virus.\nObi, however, charged residents not to disregard the state’s preventive protocols against the spread of the deadly virus to avoid infection."
  },
  {
    "headline": "Shalom Jare Has No Claim To Parcel Of Land In Okhuoromi – Barr. Peter Uwadiae – Nigerian Observer",
    "summarized_story": "Let me just quickly say this, the hostility between Okhuoromi and Shalom Jare started in 2018.\nIt was the Oba’s representatives that created the boundaries between Aruogba and Okhuoromi and Okhuoromi and Egbirhe.\nI will venture to say that Shalom Jare does not have any claim to that land.\nThe court advised Shalom Jare that look, there is a case pending that is more elaborate, embracing this particular land in another court.\nI watch their protest on Television, and the persons who were even demonstrating are not Shalom Jare Ventures, but representatives of Shalom Jare."
  },
  {
    "headline": "Doctors’ Strike: After Friday meeting deadlocked, Nigerian government resumes negotiations with NARD, others Saturday",
    "summarized_story": "ADVERTISEMENTThe meeting between the striking members of the National Association of Resident Doctors (NARD) and other key parties within the nation’s medical profession, as well as and representatives of the Nigerian government, is to continue on Saturday.\nBut the meeting on Friday was also inconclusive, according to the President of NARD, Uyilawa Okhuaihesuyi.\nHopefully, we will reach a resolution to move the health sector forward,” he said.\nThis newspaper had reported on Friday how the Nigerian Medical Association (NMA), Medical and Dental Consultants Association of Nigeria, and the association of Nigerian doctors in the Academics, and NARD members were being engaged on the doctors’ strike and other issues affecting the nation’s health sector.\nThe minister of labour and empowerment, Chris Ngige, had hinted of the meeting Thursday evening after meeting with President Muhammadu Buhari to brief him on the challenges within the country’s health sector."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "FinTech – Capital market collaboration can build a digital economy – NGX",
    "summarized_story": "Nigerian Exchange Limited (NGX) has said that the collaboration between FinTech and the capital market will effectively create a digital economy as well as increase financial inclusion and cashless payments.\nSpeaking on the theme; Roadmap to a Digital Nigeria: Harnessing Fintech, Cryptocurrencies and Artificial Intelligence to Create Stronger Financial Markets, Chiemeka explained that Fintechs have a huge potential to transform the capital markets and effectively build a digital economy.\nHe added that rather than seeing fintechs as competitors, they are potential partners to incumbent Capital Market Infrastructure Providers like NGX.\nEY estimates that Nigerian FinTech revenues will reach $543 million by 2022, driven by increasing smartphone penetration, unbanked populations and a focused regulatory drive to increase financial inclusion and cashless payments.\nIn line with the evolution of FinTech in other markets, FinTech activity in Nigeria started in payments and moved into other areas."
  },
  {
    "headline": "U.S. Consulate supports capacity building projects for teachers in Oyo State",
    "summarized_story": "Over the next 12 months, the U.S. Consulate General in Lagos is supporting a series of professional development workshops for 100 primary and secondary school teachers drawn from across local communities in Oyo State.\nThe capacity development project tagged “Ibadandun” seeks to introduce the participating teachers to fun, creative and interactive teaching methods that enhance educational outcomes such as improved numeracy, literacy and school attendance.\n“The U.S. Mission is fully committed to supporting a more educated population by increasing and strengthening the capacity of Nigerian teachers,” Acting Consul General Ibelli said.\n“Teachers who use innovative pedagogy and interactive assessment techniques enliven the teaching-learning process for their students.\nGovernment exchange alumni are at the forefront of promoting access to qualitative education, good governance and civic engagement throughout Nigeria."
  },
  {
    "headline": "Ortom lampoons Buhari over plot to create grazing reserves for herdsmen across the country, rejects policy",
    "summarized_story": "Benue State governor, Samuel Ortom, has berated President Muhammadu Buhari over his latest move to create grazing reserves for Fulani herdsmen across the country.\nWhy has the Buhari administration dumped the programme and opted for grazing reserves and cattle routes?\n“Governor Samuel Ortom has repeatedly stated that there is no land for grazing reserves or cattle routes in Benue State.\n“If President Buhari must actualize his cattle agenda in Benue State, he should be ready to kill all of us!\nWe know that grazing reserves and cattle routes are the only project that the President has for Nigeria, but Benue is not interested in such a project.”"
  },
  {
    "headline": "Photos: ex-Niger President, Osinbajo, Jonathan, Atiku, governors join Buhari at son’s wedding in Kano",
    "summarized_story": "Dignitaries, including former president, Goodluck Jonathan; former vice president, Alhaji Atiku Abubakar; current vice president, Prof Yemi Osinbajo, several governors have joined President Muhammadu Buhari in Kano for the solemnisation of holy matrimony of his son, Yusuf and Zahra, daughter of the Emir of Bichi held at Bichi, Kano State.\nAlso at the ceremony holding today, Friday, are former Vice President Atiku Abubakar, former Niger President, Mahamadou Isoufou, former Senate President, Bukola Saraki, governors of Ekiti, Adamawa, Kano, among others.\nA fierce critic of President Buhari and former aviation minister, Chief Femi Fani-Kayode also attended the wedding and was seen posing for pictures with, Isa Pantami, the controversial minister of technology and digital economy accused of supporting terror groups such Al-Qaeda."
  },
  {
    "headline": "Jos Crisis: Kogi To Evacuate Students From UniJos",
    "summarized_story": "Governor Yahaya Bello of Kogi state has moved to evacuate indigenes of the state studying at the University of Jos, Plateau State due to the ongoing mayhem in the city of Jos.\nThe State Commissioner for Information and Communications, Mr. Kingsley Fanwo, disclosed this to LEADERSHIP on Saturday.\nFanwo said the action of the University authorities to suspend the ongoing examinations made it possible and easier to evacuate the students from Jos.\nThe state government further commended authorities of the University of Jos for prioritising student’s safety over the ongoing examinations.\nAlready, an unspecified number of students and staff of the institution have already fallen victim which makes the action of the Kogi State Governor both timely and life-saving."
  },
  {
    "headline": "Jos Crisis: Kogi To Evacuate Students From UniJos",
    "summarized_story": "Governor Yahaya Bello of Kogi state has moved to evacuate indigenes of the state studying at the University of Jos, Plateau State due to the ongoing mayhem in the city of Jos.\nThe State Commissioner for Information and Communications, Mr. Kingsley Fanwo, disclosed this to LEADERSHIP on Saturday.\nFanwo said the action of the University authorities to suspend the ongoing examinations made it possible and easier to evacuate the students from Jos.\nThe state government further commended authorities of the University of Jos for prioritising student’s safety over the ongoing examinations.\nAlready, an unspecified number of students and staff of the institution have already fallen victim which makes the action of the Kogi State Governor both timely and life-saving."
  },
  {
    "headline": "Gov Emmanuel Has Kept His Campaign Promises – Ememobong",
    "summarized_story": "The Commissioner for Information and Strategy, Comrade Ini Ememobong, gave the commedation while addressing journalists in Uyo, the state capital.\nEmemobong, ” In six years, the Governor has done exactly the things he promised.\nHe promised industries and to the Glory of God and to our witness we have strategic industries dotting the landscape of the state.\nWe also have the flour industry, which has greatly contributed to our people, the state and the national economy.\nOn whether Akwa Ibom people were taking full advantage of the laudable initiatives of the Governor Emmanuel administration, Ememobong explained that, “The people are the primary beneficiaries of the policies and programmes of the Emmanuel administration,” stressing that the “dreams of the founding fathers of the state are finding practical manifestation in the governor’s tenure."
  },
  {
    "headline": "Gov Emmanuel Has Kept His Campaign Promises – Ememobong",
    "summarized_story": "The Commissioner for Information and Strategy, Comrade Ini Ememobong, gave the commedation while addressing journalists in Uyo, the state capital.\nEmemobong, ” In six years, the Governor has done exactly the things he promised.\nHe promised industries and to the Glory of God and to our witness we have strategic industries dotting the landscape of the state.\nWe also have the flour industry, which has greatly contributed to our people, the state and the national economy.\nOn whether Akwa Ibom people were taking full advantage of the laudable initiatives of the Governor Emmanuel administration, Ememobong explained that, “The people are the primary beneficiaries of the policies and programmes of the Emmanuel administration,” stressing that the “dreams of the founding fathers of the state are finding practical manifestation in the governor’s tenure."
  },
  {
    "headline": "PIA: N/Delta Militants Fault IYC On Buhari, Sylva",
    "summarized_story": "A coalition of nine militant groups under the aegis of Reformed Niger Delta Avengers (RNDA) has faulted the Ijaw Youths Council (IYC) for declaring President Muhammadu Buhari and minister of state for petroleum, Timipre Sylva, persona non grata in the region.\nWhile declaring their statement as reckless and parochial, RNDA said instead of the unfounded statements, President Buhari and Chief Sylva should be commended for the passage and signing of the Petroleum Industry Bill into law.\n“President Muhammadu Buhari is our hero and father.\nWe will and our generations unborn will remain grateful to him for this historic and memorable signing of the Petroleum Industry Bill into law.\nThis is what our own son and brother former president Goodluck Ebele Jonathan, a son of the region, could not do."
  },
  {
    "headline": "Super TV: IGP Transfers Usifo Ataga’s Murder Case, Suspect Chidinma, To Abuja",
    "summarized_story": "The Inspector-General of Police, Usman Baba, has ordered the transfer of the case of the murdered Super TV Chief Executive Officer, Usifo Ataga, from Lagos to Abuja.\nSaharaReporters learnt that the IGP ordered that the case be taken up by the Force Criminal Investigation Department, while the murder prime suspect, 21-year-old Chidinma Ojukwu, would also be brought to Abuja.\n“IGP has approved the transfer of Usifo Ataga’s murder case to Abuja.\nThey had claimed that Chidinma, the prime suspect in Ataga’s murder, was arraigned in a Yaba Magistrate Court without the family being informed.\nAtaga’s family in a letter to Ozekhome also accused the police of stifling efforts to ensure those behind the Super TV CEO murder were brought to book."
  },
  {
    "headline": "Super TV: IGP Transfers Usifo Ataga’s Murder Case, Suspect Chidinma, To Abuja",
    "summarized_story": "The Inspector-General of Police, Usman Baba, has ordered the transfer of the case of the murdered Super TV Chief Executive Officer, Usifo Ataga, from Lagos to Abuja.\nSaharaReporters learnt that the IGP ordered that the case be taken up by the Force Criminal Investigation Department, while the murder prime suspect, 21-year-old Chidinma Ojukwu, would also be brought to Abuja.\n“IGP has approved the transfer of Usifo Ataga’s murder case to Abuja.\nThey had claimed that Chidinma, the prime suspect in Ataga’s murder, was arraigned in a Yaba Magistrate Court without the family being informed.\nAtaga’s family in a letter to Ozekhome also accused the police of stifling efforts to ensure those behind the Super TV CEO murder were brought to book."
  },
  {
    "headline": "Alleged N3bn graft: EFCC Seals Ex-Governor Kwankwaso’s Property In Kano",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has sealed a property belonging to Senator Rabiu Kwankwaso in Kano State.\nKwankwaso, a former governor of Kano State, represented Kano Central Senatorial District in the National Assembly between 2011 and 2015.\nIt was learnt that the anti-graft agency had been investigating the former governor over an allegation of diversion of local government funds amounting to N3.08 billion.\nSaharaReporters in July reported that a former acting chairman of the EFCC was found to have allegedly suppressed corruption cases of Kwankwaso along with some others.\nKwankwaso has also had a running battle with the current governor of Kano State, Abdullahi Ganduje and known to be a critic of Buhari’s government."
  },
  {
    "headline": "Alleged N3bn graft: EFCC Seals Ex-Governor Kwankwaso’s Property In Kano",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has sealed a property belonging to Senator Rabiu Kwankwaso in Kano State.\nKwankwaso, a former governor of Kano State, represented Kano Central Senatorial District in the National Assembly between 2011 and 2015.\nIt was learnt that the anti-graft agency had been investigating the former governor over an allegation of diversion of local government funds amounting to N3.08 billion.\nSaharaReporters in July reported that a former acting chairman of the EFCC was found to have allegedly suppressed corruption cases of Kwankwaso along with some others.\nKwankwaso has also had a running battle with the current governor of Kano State, Abdullahi Ganduje and known to be a critic of Buhari’s government."
  },
  {
    "headline": "Fani-Kayode replies critics of his 'newly found love' with Pantami",
    "summarized_story": "Former Aviation minister, Femi Fani-Kayode has replied to the people who criticized him after he posted a picture with the Minister of Communications and Digital Economy, Dr. Isa Pantami.\nThe ex-minister has been under fire since Thursday after he called Pantami a friend and brother.\nHowever, Nigerians reminded him that he insulted Pantami three months ago.\nHe was also reminded that 3 months ago, he labelled Pantami an ‘unrepentant jihadist, cold-blooded beast, a psychopathic and clearly insane individual.”According to comments on social media, Nigerians labelled Fani-Kayode a man with no honour and who should not be taken seriously.\nHowever, Fani-Kayode replied to his critics in a Facebook post on Saturday."
  },
  {
    "headline": "It's fake news: Ooni rules out resurgence of Ife-Modakeke war",
    "summarized_story": "The Ooni of Ife, Oba Adeyeye Enitan Ogunwusi has rubbished the reports that farmers killed in Toro village, Modakeke is a renewed crisis between Modakeke and Ife.\nOoni described the killing in Modakeke as sheer criminality.\n”What happened at Toro village was sheer criminality and the long hand of the law would soon catch up with the perpetrators,” Ooni stated.\nThe monarch said the matter has been reported to the appropriate security agencies who have swung into action.\nOoni warned that the Ife-Modakeke crisis has long been resolved and the killings should not be linked to the long resolved crisis."
  },
  {
    "headline": "BREAKING: Former Oyo Military Administrator Tunji Olurin Is Dead",
    "summarized_story": "), the former Military Administrator of Oyo State and a close political ally of former President Olusegun Obasanjo, has died.\nOlurin died after a brief illness, according to him.\nOlurin was born in Ilaro, Ogun West Senatorial District, and served as the Military Administrator of Ekiti State from October 8, 2006 to April 27, 2007.\nIn the 2011 general election in Ogun State, he ran for governor as a candidate for the Peoples Democratic Party.\nDuring the First Liberian Civil War, Olurin served as a Field Commander of the ECOMOG Peacekeeping Force in Liberia from 1992 to 1993."
  },
  {
    "headline": "Sunday Igboho Won’t Return To Nigeria Until Buhari Leaves Office – Lawyer",
    "summarized_story": "Sunday Igboho, a Yoruba nation freedom fighter, has stated that when he is released from prison, he will seek asylum in Benin Republic and France.\nFalola further stated that Igboho will not return to Nigeria until President Muhammadu Buhari’s administration leaves power.\nWhen he leaves prison, he’ll demand asylum from other countries including France, and they will be ready to receive him.\n“So he’ll return back to Nigeria when the administration that is against him leaves office.\nIgboho is currently on trial in Cotonou, but the Nigerian government has yet to file any accusations against him."
  },
  {
    "headline": "Again, Bandits Kidnap Another 60 Persons In Zamfara",
    "summarized_story": "Armed bandits kidnapped another 60 people on Friday in Rimi village, Bakura Local Government Area, just five days after four people were killed and 15 were abducted in Zamfara.\n“This morning, we woke up to hear that bandits invaded Rimi village in Bakura LGA, abducting about 60 people, though it is not really confirmed,” Ibrahim Dosara, Zamfara commissioner for information, told TVC.\nOfficials are seeking to discover the exact number of persons kidnapped, according to Mr Dosara.\n“Bakura LGA, as a whole, is a kind of route for the bandits, leading to Dansadau, Birnin Gwari and other areas of Niger state,” he said.\nAccording to NEWS DIRECT, 15 bandits killed four students and kidnapped 15 others at the College of Agriculture and Animal Health in Bakura, Zamfara."
  },
  {
    "headline": "‘Nigeria Now Cow Republic’ — Ortom Compares Buhari Govt To Afghanistan’s Taliban",
    "summarized_story": "This, he claims, is because Buhari had no rationale for insisting on building cattle reserves and channels, which went against widely established ranching policy.\nOrtom, in the statement, said, “millions of Nigerians have been displaced following attacks by armed herders and are currently suffering in IDP camps.\nOrtom said, “President Buhari has refused to prove wrong, those who accuse him of being a Fulani President.\nBut Buhari is not the first Fulani man to be President of this country.\n“Our country has never been more divided on ethnic lines and sentiments as it is under President Buhari who was thought to be the most prepared to lead the country at this time."
  },
  {
    "headline": "Breaking: Another ex-Military governor is dead",
    "summarized_story": "Former Military Governor of old Oyo, General Tunji Olurin, has passed on.\nOlurin, who governed Oyo from 1985-1988, was born in Ilaro, Ogun state on December 3,1944.\nAccording to the Nation, Olorin passed on Saturday morning at the Lagos University Teaching Hospital(LUTH) after a brief illness.\nOver two weeks ago, a former Kano military Dominic Oneya reportedly died.\nDetails loading…"
  },
  {
    "headline": "In Zamfara, bandits abduct 66, Police confirm",
    "summarized_story": "The Zamfara State Police Command has confirmed the Kidnap of 66 people in Rini town of Bakura local government council of the state.\nThe Public Relations Officer of the command, SP Muhammad Shehu, stated this in a telephone interview with Blueprint on Saturday.\nBlueprint reports that the Bandits numbering up to over 100 stormed the community around 2:30am and began shooting sporadically on air, searching for people house to house.\nShehu further stated that, already search and rescue team have been deployed to the area to restore peace and ensure rescue of the victims.\nThe police image maker urged Zamfara communities to always provide credible information about criminal hideouts to security agencies for prompt response."
  },
  {
    "headline": "In Kaduna, bandit groups turn against each other, kill nine",
    "summarized_story": "Nemesis caught up with two groups of armed bandits in Giwa local government of Kaduna state who in a fratricidal gun duel killed nine of their fellow bandits on Wednesday.\nKaduna state Commissioner for Internal Security and Home Affairs, Mr Samuel Aruwan, who made this known in a statement on Friday, said the bandits’ death has been confirmed through human intelligence and by security agencies.\n“Credible human intelligence networks informed the Kaduna state government of the development, which was further corroborated by security agencies.\n“Intelligence sources had reported that a notorious bandit known as ‘Godon Mota’ stormed Garke village last Wednesday with his gang and clashed with a rival bandit group, leading to the killing of nine members.\n“The cause of the fratricidal face-off is yet unclear, but was said to revolve around a disagreement over sharing of accumulated ransoms, during which one of the groups felt cheated."
  },
  {
    "headline": "Akpabio lists achievements, says govt impacting lives positively through Niger Delta Ministry -NigPilot",
    "summarized_story": "Minister of Niger Delta Affairs, Sen. Godswill Akpabio has listed achievements gained by the ministry, reiterating that relentless efforts have been made by the Federal Government in impacting lives positively in the area of infrastructure development and social amenities’ empowerment in the Niger Delta region.\nI, therefore appeal to the Eleme people, Niger Deltans and Nigerians for their patience and support as we are working hard to salvage the situation,” he added.\nOther projects embarked upon by the ministry cutting across the nine states of the region.\nThey include 13 Inter-State road projects, 109 Intrastate road projects, 9 Jetty design projects that have been completed with 1 being constructed in Nembe, Bayelsa State to improve water transportation, Akpabio revealed.\nHe stressed that despite inadequate funding that is a major challenge in the project implementation, the Ministry would endeavor to actualize its programs to improve the living standard of the people of the Niger Delta region."
  },
  {
    "headline": "Buhari reappoints JAMB, NUC, UBEC CEOs -NigPilot",
    "summarized_story": "President Muhammadu Buhari, has, upon the recommendation of Education Minister, Adamu Adamu, approved the reappointment of the Registrar of the Joint Admissions and Matriculations Board, JAMB, Prof. Ishaq Olanrewaju Oloyede, and the Executive Secretary of the National Universities Commission , NUC, Prof. Abubakar Adamu Rasheed.\nIt stated that the two appointments are for a tenure of 5 years each, with effect from 1st August 2021.\nAlso reappointed is Dr. Hamid Bobboyi as Executive Secretary of the Universal Basic Education Commission, UBEC , for a second and final tenure of 4 years with effect from 1st August 2021.\nTo give further impetus to mathematics education, approval was also granted for the appointment of Prof.\nPromise Mebine as the Director/Chief Executive of the National Mathematical Centre for an initial tenure of 5years with effect from 17th August 2021."
  },
  {
    "headline": "Flag -Off of of Fertizer distributions for the Northwest zone by the Saraki -NigPilot",
    "summarized_story": "FOR INFORMATIONAL PURPOSES ONLY.\nThe content of this Website is made available by the Nigerian Pilot Newspaper Publisher.\nThe “Distributor” of this Information are the Nigerian Pilot Newspaper and Nigerian Pilot Tv brands of Dom Communication, LLC.\nThis Website NigPilot collects information from several Independent Reporters and may contain unauthenticated and/or copyrighted materials the utilization of which has not generally been explicitly approved or authorized by the copyright proprietor.\nFor Nigerian Pilot Newspaper Advert Rates Click Here!"
  },
  {
    "headline": "Sellbeta Shopping launches E-commerce platform in Nigeria -NigPilot",
    "summarized_story": "Indigenous information, communication, and technology company, SellBeta has launched an E-commerce platform with the latest features.\nIn a statement released to the press by the company’s Chief Executive officer Emeafu Elvis Chibuzor, said the E-commerce platform comes with added security which ensures that transactions maintain optimum security.\nThe E-commerce platform is designed to sell a wide variety of products.\nThe business structure will make provision for business to business (B2B), business to consumer (B2C), and consumer to consumer operations (C2C).\nThe upscaling of its former website to a full e-commerce platform is to provide a reliable alternative to the shopping populace, the statement concludes."
  },
  {
    "headline": "LIVE STREAM: Coronation Of Olu Of Warri",
    "summarized_story": "﻿The coronation of the Olu of Warri Designate, Tsola Emiko, as the 21st ruler of the Warri Kingdom has commenced.\nThe event is currently ongoing in the ancient city of Warri in Delta State with many traditional rulers and political leaders in attendance.\nBorn on April 2, 1984, to the then Prince Godwin Toritseju Emiko, who later became 20th Olu of Warri, Ogiame Atuwatse II and Gladys Durorike Emiko in Warri, the new monarch is a descendant of Olu Akengbuwa.\nThe Olu is an avid sportsman, having participated in different sports including swimming, kayaks, basketball, American football, and soccer.\nAs an entrepreneur, he founded the Noble Nigeria Limited and Coral Curator limited."
  },
  {
    "headline": "Nigeria Records 304 More COVID-19 Cases, Three Deaths",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) has confirmed 304 new cases of COVID-19 across 12 states and the Federal Capital Territory (FCT) Abuja.\nIn its latest update on the pandemic, the agency disclosed that three more infected people lost the fight against the disease.\nRivers State recorded 154 more cases – the highest number of daily infections – among the states with new cases – on Friday.\nIt was followed by Ekiti where 33 new infections were reported, while Edo and Abuja recorded 20 and 18 more cases, respectively.\nSince the country recorded its first cases in February 2020, the NCDC has confirmed a total of 185,571 cases from the 2,648,684 tested so far."
  },
  {
    "headline": "‘No Place Like Home’: Hunger And The Burning Desire Of IDPs In Benue",
    "summarized_story": "In terms of health care, the Mbawa IDP camp has a maternal and child health clinic operated by Medecins Sans Frontiers (MSF).\nInterventions by the MSF at the camp also include the provision of emergency primary health care, emergency water and sanitation services, and shelter.\n“We have also recently included programmes of reproductive health, and sexual and gender-based violence response,” says Project Coordinator MSF, Benue State, Prosper Ndumuraro.\nWithin the past decade, hundreds of people have fled from attacks, attributed to armed herdsmen, on n rural farming communities within Benue State and are taking refuge in various official and unofficial camps, many with just mosquito nets as shelter.\nThrough thick and thin, the IDPs of Benue have a burning desire to return home and the big questions is who will make that possible."
  },
  {
    "headline": "Insecurity: UniJos Suspends Academic Activities, Closes Hostels",
    "summarized_story": "The University of Jos on Friday suspended academic activities and closed its hostels.\nThe suspension order was due to the intensified killing of students around the university area shortly after the relaxation of a 24-hour curfew in Jos.\nREAD ALSO: Lalong Condemns Killing Of Travellers In PlateauThe University management also approved the suspension of examinations for the second semester 2019/2020 academic session.\nLast Saturday, travellers along Rukuba road in Jos North Local Government had been attacked, heightening tensions in the state.\nTo curb further attacks, Plateau State Governor, Simon Lalong, had imposed a curfew on Jos North, Bassa and Jos South Local Government Areas."
  },
  {
    "headline": "A Colombian Man’s Life Shattered By Two Land Mine Explosions",
    "summarized_story": "Twice in 10 years, Efrain Soto’s life was shattered in landmine explosions in violence-wracked Colombia.\nThe number of landmine victims is rising in Colombia, as guerrilla violence continues despite a 2016 peace accord meant to end decades of armed conflict.\nSince the explosions, Soto has had a nervous breakdown and seizures.\nThe number of people killed or wounded by mines is increasing, according to the International Committee of the Red Cross.\nSoto says he has lost hope of seeing peace in Colombia."
  },
  {
    "headline": "Kogi State Government Evacuates Stranded Students in Jos",
    "summarized_story": "Kogi State Students studying in the University of Jos and other higher institutions in Plateau State have been successfully evacuated by the state government, the evacuation became necessary following the recent attacks and unrest in Plateau State particularly in Jos North Local Government area and the closing down of the University of Jos by the School management.\nThe students returned in buses with heavy security escorts provided by the State Government on Friday.\nThe evacuation was as a result of the directive of Governor Yahaya Bello mandating that everything necessary must be done to return the students safely back home.\nWhile describing the event on the Plateau as unfortunate, the governor assured the students of their quick return to school, noting that the authority in Plateau State was on top of the situation to restore law and order in the state.\nThe Governor praised the students for their orderly conduct and patience during the unfortunate incident."
  },
  {
    "headline": "IDPs want Govt to equip security operatives with modern equipment",
    "summarized_story": "Internally Displaced Persons in Zamfara State have said ground and air components of the Military saved their community Gulubba in Bungudu local government from total destruction by bandits.\nThe troops were said to have engaged the bandits in a gun duel for more than six hours until reinforcement from two fighter jets showed up."
  },
  {
    "headline": "Nine Bandits killed as rival groups clash in Kaduna",
    "summarized_story": "At least nine bandits have been killed during a face-off between rival groups in Kaduna State.\nThe state government attributed this to credible human intelligence network reports corroborated by security agencies.\nA notorious bandit popularly known as Godon Mota was said to have stormed Garke village in Giwa Local Government Area with members of his gang and clashed with a rival bandit group."
  },
  {
    "headline": "GM Recalls All Chevrolet Bolt Electric Cars Over Fire Risk",
    "summarized_story": "Friday’s recall covers 73,018 Bolts from 2019 to 2022 and extends a previous recall covering 2017-2019 cars.\nGM said battery defects could lead to fires in the subcompact vehicles and urged drivers to limit their charging, avoid overnight charging and park them outside.\n“After further investigation into the manufacturing processes at LG and disassembling battery packs, GM discovered manufacturing defects in certain battery cells produced at LG manufacturing facilities beyond the Ochang, Korea, plant.\nGM and LG are working to rectify the cause of these defects,” GM said.\nThe latest recall will cost the company about $1 billion, bringing the total cost of the Bolt battery recalls to $1.8 billion, the Associated Press reported."
  },
  {
    "headline": "India Gives Emergency Approval for World’s First Covid DNA Jab",
    "summarized_story": "India’s drug regulator has granted emergency use approval for Zydus Cadila’s Covid-19 vaccine, the world’s first DNA shot against the coronavirus, in adults and children aged 12 years and above.\nThe vaccine, ZyCoV-D, uses a section of genetic material from the virus that gives instructions as either DNA or RNA to make the specific protein that the immune system recognises and responds to.\nUnlike most Covid-19 vaccines, which need two doses or even a single dose, ZyCoV-D is administered in three doses.\nZydus Cadila’s vaccine, developed in partnership with the Department of Biotechnology, is the second home-grown shot to get emergency authorisation in India after Bharat Biotech’s Covaxin.\nZydus Cadila had also submitted data evaluating a two-dose regimen for the shot in July and plans to seek regulatory approval for the same."
  },
  {
    "headline": "Tunisia: Former Anti-corruption Chief Placed Under House Arrest",
    "summarized_story": "The former head of Tunisia’s Anti-Corruption Committee was placed under house arrest, hours after security forces took control of the commission’s headquarters.\nChawki Tabib was the head of the independent authority from 2016 until he was dismissed by former Prime Minister Elyes Fakhfakh in 2020.\n“A security patrol stationed in front of my house informed me that a decision was issued to place me under house arrest … in violation of my right guaranteed by law and the constitution,” Tabib said on Facebook on Friday.\nCritics and opposition leaders labelled the president’s moves a “coup”, a characterisation rejected by Saied.\nSecurity forces cordoned off the headquarters of the Anti-Corruption Committee and evacuated its employees on Friday, in what appeared to be an attempt by the authority to protect any corruption files."
  },
  {
    "headline": "Africa’s Jihadists: What Taliban Takeover of Afghanistan Means",
    "summarized_story": "As Afghanistan fell to the Taliban, Islamist groups waging insurgencies in Africa were quick to celebrate.\nThere is concern that Malian troops, who are often poorly trained and ill-equipped, will not be able to contain Islamist groups.\nThere have also been clashes in the capital this year over delayed elections, which saw parts of the security forces turn on each other.\n“Somali security forces have not received 0.005% of what the Afghan security forces have received,” she says.\nWest Africa’s Islamist groups “exist in a climate where the state is weak, but they are weaker than the weak states”, Mr Nasrullah says."
  },
  {
    "headline": "In Kabul, A Fearful Wait for US to Deliver on Evacuation Vow",
    "summarized_story": "He faces growing criticism as videos depict pandemonium and occasional violence outside the airport, and as vulnerable Afghans who fear the Taliban’s retaliation send desperate pleas not to be left behind.\nThe backlog forced flights from the Kabul international airport to stop for several hours.\nThe fall of Kabul marked the final chapter of America’s longest war, which began after the Sept. 11, 2001, terror attacks.\nOfficials also confirmed that U.S. military helicopters flew beyond the Kabul airport to scoop up 169 Americans seeking to evacuate.\nSo far, 13 countries have agreed to host at-risk Afghans at least temporarily, U.S. Secretary of State Antony Blinken said."
  }
]