[
  {
    "headline": "Katsina LG election: Voter apathy, late arrival of materials mar exercise",
    "summarized_story": "The Monday Katsina Local Government election was marred by voter apathy, delay in the arrival of election materials at various polling units as well as complaints by political parties’ agents of non-availability of election results sheets, among others.\nThe story was virtually similar in all the polling units visited in the Katsina, Batagarawa, Kankia and Safana Local Government Areas of the state.\nAccreditation of voters was yet to commence at many polling units visited by 9.30am, despite the fact that the election was slated for 8am to 3pm.\nAttempts to seek the comments of the chairman of the Katsina State Independent Electoral Commission, Ibrahim Bako, were unsuccessful as he was said to have gone out to inspect the election exercise.\nThe exercise was for the election of chairmen for the 34 Local Government Areas of the state and 361 councillors for the councils."
  },
  {
    "headline": "Osinachi: Quit now before death, Olori Naomi tells abused wives",
    "summarized_story": "Evangelist Naomi Silekunola, the estranged wife of the Ooni of Ife, Oba Adeyeye Ogunwusi Ojaja II, has urged abused wives who realise that their marriages can’t work to quit.\nOlori Naomi, in the tribute-like post, also mourned popular gospel artiste, Osinachi Nwachukwu, who reportedly died as a victim of gender-based violence.\nYou can put your hands in the air,Cry for help if you have to;Say no even if the world can’t reason with you.\nAccept that it can’t work, if it won’t work.\nView this post on Instagram A post shared by Naomi Silekunola O (@queen_silekunolanaomi_ogunwusi)Copyright PUNCH."
  },
  {
    "headline": "Osun APC mourns as gunmen kill party chair",
    "summarized_story": "Osun State chapter of the All Progressives Congress has been thrown into mourning following the assassination of the party’s chairman for Atakumosa East Local Council Development Authority, Gbenga Ogbara, by some yet-to-be-identified gunmen.\nMedia Adviser to Osun APC state Chairman, Kola Olabisi, confirmed the incident, saying the party had been thrown into mourning.\nAlso, Osun police Command spokesperson, Yemisi Opalola, said the deceased was killed in his house by some yet-to-be-identified gunmen.\nShe said, “he was killed in his home in the early hours of Monday.\nMore details will be provided later but we have immediately commenced work to unravel the mystery behind the incident.”Details later…Copyright PUNCH."
  },
  {
    "headline": "2023: Why Nigeria needs Saraki- Prof. Hagher",
    "summarized_story": "Having related on a multi-dimensional level over the years with the former Senate President, Professor Hagher told Vanguard that a Saraki-led Presidency would fetch Nigerians result-driven governance she have been yearning for since the attainment of independence in 1960.\n“Senator Bukola Saraki is the end of search for the President of Nigeria come 2023.\n“He is very well educated in Nigeria and abroad with a robust network of associates in high positions across the globe.\n“As Senate President, he excelled as the defender of Nigeria’s democracy by asserting the independence of the legislative arm of government,” he noted.\nSaraki is currently midwifing a consensus dialogue with Atiku, Tambuwal, Bala Mohammed and Muhammed Hayatu-Deen, aimed at presenting a consensus Northern choice at the convention."
  },
  {
    "headline": "InfraCorp begins projects consideration, commences operations",
    "summarized_story": "By Emma UjahAbuja—The N15 trillion Infrastructure of Nigeria Corporation, InfraCorp, has commenced operations, as it initiates priority projects considerations.\nInfraCorp’s core mandate is to tackle Nigeria’s infrastructure deficit and generate a growth multiplier-effect across critical sectors.\nBy supporting project development, financial structuring and private-capital mobilisation, InfraCorp will help to combat issues of underemployment and under-investment in critical nation-building assets.\nInfraCorp will operate from the capital city, Abuja, and Nigeria’s commercial hub, Lagos.\n“I am excited about the opportunity to drive development and innovation in infrastructure solutions for Nigeria."
  },
  {
    "headline": "2023: Arewa group secures N’East support for Emefiele",
    "summarized_story": "By Omeiza AjayiAbuja—A group of northern leaders and politicians under the aegis of Arewa Alliance for the Presidency of Godwin Emefiele, AAPGE, weekend, said it had secured the endorsement of stakeholders in the North East for the Central Bank of Nigeria CBN Governor, Godwin Emefiele, ahead of next year’s presidential election.\nThe group also said it had commenced regional engagements with Northern stakeholders on the pathway to realising a Presidency of Emefiele.\nNational Convener of the group, Dauda KUSHU, said his team had in Yola, Adamawa State convened a zonal endorsement session for Mr Emefiele.\nAccording to him, “The event was well-attended by stakeholders from various industries including businessmen, Agribusiness operators, politicians, civil servants, religious leaders, traditional leaders, women and youths, who all endorsed Mr Godwin Emefiele for President.\n“Putting their approval on the Presidency of Godwin Emefiele at the event were several North-East groups, including the North-East Business Community, North-East APC Youth Leaders, North-East APC Women Leaders and North-East APC Stakeholders."
  },
  {
    "headline": "Former senate president confirms wife’s death",
    "summarized_story": "By Steve OkoFormer Senate President, Senator Adolphus Wabara, has confirmed the death of his wife, Mrs Felicia Wabara.\nThe statement read: “This is to inform the general public of the passing away of Mrs Felicia Wabara, the wife of former Senate President, His Excellency Senator Adolphus Wabara, PhD, after a protracted illness.\n“Late Mrs Felicia Wabara went to the great beyond early hours of today, Sunday 10th April, 2022.\nVanguard checks revealed that Mrs Wabara miraculously surved a brain cancer that almost claimed her life in 2010.\nMrs Wabara had disclosed during a thanksgiving church service at the Living Faith Church, New York, that she could not talk or walk at that time."
  },
  {
    "headline": "Again, Zulum calls on Boko Haram/ISWAP to surrender",
    "summarized_story": "By Ndahi MaramaMaiduguri—Governor Babagana Zulum of Borno State, has again, called on Boko Haram terrorists to lay down their arms and surrender to the military to be reintegrated into communities.\nZulum spoke weekend in Warabe, while resettling 680 IDP returnees’ households into the border community with Cameroon.\nHe informed that over 50,000 repentant Boko Haram terrorists had surrendered to the Army for disarmament, de-radicalization and reintegration, DDR, by the State Government.\nAccording to him, with the surrender of terrorists along with their families, displaced persons from five communities will be returned in two months.\nHe urged the IDP returnees to be resilient and security conscious and report suspicious persons or groups of people to security agencies."
  },
  {
    "headline": "Plateau attacks: Over 90 killed, 70 abducted, scores injured, more than 100 homes burnt",
    "summarized_story": "Following the attack on some communities in Kanam, Bassa and Barkin Ladi LGAs of Plateau State, over 90 people are feared to have been killed, over 70 abducted, scores injured and more than 100 homes set ablaze in a week.\nDAILY POST gathered from locals in the aforementioned council that Kukawa, Gyanbahu, Dungur and Keram villages were the communities attacked, that suspected bandits have killed over 78 people, over 70 abducted and over 100 homes set ablaze, all in Kanam LGA of the state.\n“As we speak, over 78 people were killed, more than 70 others are missing and I can’t really say the number of injured people; however we suspect they may have been abducted.\nMeantime, major routes in Jos, the state capital, leading to head offices of security agencies were on Sunday blocked by security operatives, on rumours of planned attacks on security formations in the state.\nHowever, while security agencies were on alert in the state capital, mayhem was being unleashed on four villages in Kanam LGA of the state."
  },
  {
    "headline": "Abductors of Abuja-Kaduna passengers not just bandits – Shehu Sani reveasls those behind attack",
    "summarized_story": "Former lawmaker, Senator Shehu Sani has alleged that the bloodthirsty armed men, who abducted passengers of the Abuja-Kaduna train, were ‘jihadist’ terrorists.\nRecall that the assailants, who attacked the train on its way to Kaduna State on March 27, killed some passengers, injured scores while over hundred were kidnaped.\nHowever, the Kaduna State governorship aspirant in the forthcoming 2023 general elections said the video shows the criminal elements are not just bandits.\nThe tweet reads, “The video footage of the Train terrorists & their hostages making demands to the Government confirmed the fact that the cruel abductors were not just bandits but ‘Jihadist’ terrorists.\n“Authorities must walk the tight rope of freeing the hostages without bowing to terrorists”."
  },
  {
    "headline": "Miyetti Allah youths lament tenure elongation by officials, call for election",
    "summarized_story": "A group, Concerned MACBAN Youths, has lamented tenure elongation by the national executives of the Miyetti Allah Cattle Breeders Association of Nigeria (MACBAN).\nUmar A. Bonga, National Coordinator of the group, in a statement expressed dismay at the attempts to elongate the tenure of officials of MACBAN.\nAs a result of the provision of the MACBAN’s constitution stipulates four years per term.”The statement observed that incidentally, the national officials have served for two terms of eight years consecutively, saying that the tenure elapsed on 10th April 2022 with no plan to elect new officials.\nIt regretted the unconstitutional posture and abuse of constitutional provision of MACBAN by the expired officials, alleging that the national executives have established alliances with states executives to flout their constitution.\nThe group stressed that only setting up a caretaker committee would bring back the sincerity, patriotism and the much talk about protection of the MACBAN members all over the country."
  },
  {
    "headline": "Four million Nigerians to face severe food insecurity – UN report",
    "summarized_story": "The United Nations Resident and Humanitarian Coordinator in Nigeria, Matthias Schmale, has said that about four million Nigerians will face severe food insecurity in the approaching lean season.\nSpeaking at an advocacy event held in Abuja on food security and nutrition in North-East Nigeria, Schmale explained that a total of 8.4 million Nigerians would need humanitarian support in the North-East, saying that 4.1 million people would face severe pain of food insecurity in the region.\nAccording to him, “Across North-East Nigeria today, 8.4 million people need humanitarian assistance.\nHe opined that unless resources are urgently mobilised, almost three million people in dire need of food and nutrition support will go unassisted.\nHe stated that without food assistance, desperation may compel extremely vulnerable people into transactional sex, child labour, and selling their few possessions."
  },
  {
    "headline": "Osinachi’s death: ‘Pastor Enenche was not aware’ – Daughter reveals next action",
    "summarized_story": "Daughter of Pastor Paul Enenche of Dunamis International Gospel Center, Deborah, has disclosed that her father had no knowledge of the physical abuse of Osinachi Nwachukwu experienced in the hands of her husband, which led to her death.\nIt is spread across the fabric of his ministry the clear fact that he has always ensured the weak are protected.\nBear in mind that there was no knowledge of the physical abuse.\nEnenche assured that there will be many measures taken to protect the children and the family of the late singer.\nI wish I had been aware of all the pain she experienced."
  },
  {
    "headline": "Two feared killed as sit-at-home enforcers attack Enugu park",
    "summarized_story": "Hoodlums enforcing a sit-at-home protest in Enugu, Enugu State capital, on Monday attacked a park where inter-state transport vehicles were loading.\nThe hoodlums shot consistently as they dispersed passengers, burning a Siena vehicle and killing no fewer than two persons in the incident that happened on Monday morning.\nSome passengers and drivers also suffered gunshot injuries as they attempted to run for their dear lives.\nDriver of the burnt Sienna, who escaped being killed, narrated how the hoodlums stormed the park while he was still waiting for passengers to fill the vehicle.\n“I learned about two persons were reported to have been shot dead during the attack which lasted fee minutes”, the man said."
  },
  {
    "headline": "JUST IN: Many feared dead as fire guts Rivers Jetty",
    "summarized_story": "JUST IN: Many feared dead as fire guts Rivers JettySome persons have been feared dead following fire that engulfed the Nembe/Bille Jetty in Port Harcourt, the Rivers State capital.\nIt was gathered the incident that occurred on Monday morning burnt the victims beyond recognition and destroyed fibre and wooden boats at the facility.\nThough no authority has officially spoken on the matter, such inferno has become recurrent decimal in the oil-rich state.\nThe boats were said to be discharging some refined petroleum products at the jetty when the fire started.\nDetails Shortly…"
  },
  {
    "headline": "JUST IN: Police launch manhunt as gunmen kill APC chair in Osun",
    "summarized_story": "JUST IN: Police launch manhunt as gunmen kill APC chair in OsunGunmen on Monday murdered the All Progressives Congress(APC) chairman in Atakunmosa East Local Council Development Area of Osun State, Chief Gbenga Ogbara.\nThe Nation gathered the gunmen invaded his house at Igangan in the midnight and shot him in his sitting room.\nThe incident caused panic in the area as police operatives evacuated his corpse and deposited at Wesley Guild Hospital, Ilesha.\nRead Also: Gunmen attack communities in PlateauOsun Police spokesperson, Yemisi Opalola, confirmed the incident The Nation, noting that operatives have been drafted to the area.\nShe said: “The APC chairman was killed around 12am by some gunmen."
  },
  {
    "headline": "Beneath the NIN-SIM partial deactivation",
    "summarized_story": "But the imperative of SIM registration became apparent when the mobile phone became a facilitator of criminal activities.\nPantami, who issued the directive, said the approval was in line with the Revised National Digital Identity Policy for SIM Card Registration.\nNCC and NIMC were directed to ensure that the provisions of the policy are strictly followed by operators and subscribers.\nIn the event that a data only service is particular to individual use (eg home car tracking, WiFi, MiFi services, etc), the standard NIN registration process will be followed.\nIt is difficult to manage because people have come to capture their NIN, waiting for verification of their NIN."
  },
  {
    "headline": "Defection: Court vacation stalls judgment in suit seeking Dogara’s sack",
    "summarized_story": "The Federal High Court (FHC)’s vacation has stalled the judgment in a suit seeking the declaration of the seat of Rep Yakubu Dogara vacant on account of his defection to the All Progressives Congress (APC).\nThe first suit was marked: FHC/ABJ/CS/883/30 and filed by Incorporated Trustees of United Global Resources for Peace Organisation Vs. Rep Yakubu Dogara and five others was on number one on the cause list.\nHowever, the second suit marked: FHC/ABJ/CS/1060/20 filed by the Peoples Democratic Party (PDP) Vs. Rep Yakubu Dogara and four others, was on number five in today’s cause list.\nWhen NAN visited Court 6 where Justice Okorowo presides, the courtroom was empty with the court registrar and other workers doing their daily activities.\nThe lawmakers comprise two House of Representatives members and 18 state House of Assembly members."
  },
  {
    "headline": "BREAKING: 2023- Osinbajo finally declares, says I’m most qualified to lead",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaVice President Yemi Osinbajo has declared to run for the Presidency come 2023, saying that he is the most qualified, having saved alongside President Muhammadu Buhari, who he describes as a true Nigerian patriot, in the last seven years.\nHe said if given the opportunity to fly the flag of All Progressive Congress (APC), he will complete what the Buhari’s administration has started, one of which is to radically transforming the security and intelligence architecture.\nOsinbajo said, “I believe that the very reason why the Almighty God gave me these experiences, these insights, and these opportunities, is that they must be put to the use of our country and it’s great peoples.\nPremature Ejaculation & \"Small Joystick\" Resolved in 7Days... Click Here For Details .\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood."
  },
  {
    "headline": "2023: Buhari’s ministers under pressure to resign",
    "summarized_story": "Last week, APC national publicity secretary, Felix Morka, urged political appointees to resign before the primaries of the party, despite an Umuahia Federal High Court ruling, striking down Section 84(12).\nPolitical appointees that the provision refers to include the 43 federal ministers, special advisers, senior special assistants, special assistants and heads of government agencies.\nCommissioners and other political appointees at the state level are also affected.\nThere are other aides to the president, vying to various positions, who are also under pressure to resign ahead of the planned primaries of the ruling APC.\nThe proper thing to do would have been to first resign, before declaring his presidential ambition."
  },
  {
    "headline": "2023 presidency: Osinbajo meets APC govs ahead of declaration",
    "summarized_story": "It was learnt that the meeting was to intimate the All Progressives Congress (APC) governors of his plan to officially declare to contest the position.\nJournalists were denied entry into the venue of the meeting, which seemed exclusive to only the invited governors and their aides.\n“He felt the need to inform the governors ahead of a planned public declaration Monday of his decision to contest presidency in 2023 under the APC platform.\nBeing the chairman of NEC in the last seven years, he had an excellent relationship with governors across party lines, ethnicities and religions.\nInvited are both Muslims and non-Muslim governors with sufficient representation from all political zones in the country,” the source said."
  },
  {
    "headline": "Abia Deputy Gov faces impeachment for joining guber race",
    "summarized_story": "By Doris ObinnaAn impeachment plot is being hatched and perfected against Abia State Deputy Governor, Dr. Ude Chukwu, for daring to indicate interest to succeed his boss, Governor Okezie Ikpeazu, Daily Sun has learnt.\nIt was also gathered that in the event that the impeachment plot fails, there is also a plan to disqualify the deputy governor from the guber race.\nSources however revealed that the Deputy Governor is getting sympathy because of his unflinching loyalty to Governor Ikpeazu since he came to office with him in 2015.\nIn seven years, the Deputy Governor, it was revealed, has never had any cause to be disloyal to the governor and has discharged his duties well.\nOwing to his loyalty and competence, the Deputy Governor has attracted sympathy from across the state, including the governor’s clan."
  },
  {
    "headline": "Blood flows in Kaduna, Plateau again",
    "summarized_story": "From Noah Ebije, Kaduna and Gyang Bere, JosA newly installed community leader in Kaduna was killed in the early hours of yesterday by gunmen.\nThe community leader, Isiaku Madaki, was murdered in his residence, at Kakura, in Chikun Local Government Area of Kaduna State.\nHowever, it was gathered that 14 other people were killed following alleged reprisals on the neighbouring settlement by aggrieved natives.\nLater we were told that the gunmen had killed the community leader in the presence of his wife and family.\nBut the PPRO dismissed the insinuation and said the Plateau is peaceful, especially Jos, the state capital."
  },
  {
    "headline": "Tinubu, APC Govs Meet Hours After Osinbajo’s Declaration",
    "summarized_story": "Adedayo AkinwaleMonday’s declaration for President by Vice President Yemi Osibanjo may have forced his political godfather and a national leader of the All Progressives Congress (APC), Asiwaju Bola Tinubu, to meet with some APC governors.\nThe meeting, which is currently going on, is taking place at the Kebbi State Governor’s Lodge, Asokoro, Abuja, and had 12 governors elected on the platform of the party in attendance.\nThough, the agenda of the meeting is not known yet, it may not be unconnected with Tinubu’s ambition and the latest development in the presidential race with the official.declaration of Osinbajo.\nDetails later…Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Breaking: After Osinbajo’s Declaration, Tinubu Meets APC Governors",
    "summarized_story": "Sequel to the formal declaration for a presidential run by Vice President Yemi Osinbajo, earlier today, a frontline presidential hopeful and one of the national leaders of the All Progressives Congress (APC), Asiwaju Bola Tinubu, is billed to meet with governors of the ruling party later tonight in Abuja, the nation’s capital.\nAccording to THISDAY sources, Tinubu had asked to meet with the APC governors last Thursday, but had to shift the meeting, because some of the governors could not honour the invitation at the time following other commitments.\nHe (Tinubu) requested for a meeting last Thursday and it would happen tonight.\nThe same people, who attended Osinbajo’s meeting would attend his own,” a source close to the governors, hinted, when asked if it was true that the governors turned him (Tinubu) down last night after meeting with Osinbajo.\nTinubu’s meeting tonight is, therefore, contrary to speculations that the former Lagos State governor, had requested to meet with the governors immediately after Mr. Babajide Sanwo-Olu, the current governor of the state, allegedly told him they met with Osinbajo last night and they turned him down."
  },
  {
    "headline": "Osinbajo: Why I’m Running for President (Declaration Speech)",
    "summarized_story": "I know their hopes, aspirations and fears; and I believe that in those hopes and aspirations are the seeds for the great Nigeria that we all desire.\nAbove all, front and centre of our efforts will be the provision of jobs and opportunities for our young people.\nWe will, working together, establish by the grace of God, the Nigeria of our dreams in a few short years.\nWhere all are given equal access to the abundant opportunities that God has bestowed on this nation.\n* Being the full text Vice President Yemi Osinbajo’s declaration for President speech on Monday April 11, 2022Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Osinbajo Declares for President, Says He Has Experiences, Insights to Succeed Buhari",
    "summarized_story": "*Describes Buhari as true Nigerian patriotDeji Elumoye in AbujaVice President Yemi Osinbajo has declared that he has garnered enough experience which stands him in good position to succeed President Muhammadu Buhari in 2023.In a short speech to flag off his presidential ambition on Monday morning, Osinbajo who described President Buhari as a true Nigerian patriot said he had served diligently as Vice President in the last seven years during which he had met with different categories of Nigerians.The Vice President stated: “For the past seven years, I have served as Vice President under a true Nigerian patriot, President Muhammadu Buhari.\n“I’ve stood where you stand and sat where you sit.\n“I believe that the very reason why the Almighty God gave me these experiences, these insights, and these opportunities, is that they must be put to the use of our country and its great peoples.\n“This is why today, with utmost humility, I formally declare my intention to run for the office of the President, Federal Republic of Nigeria, on the platform of our great party, the All Progressives Congress.\n“I also most solemnly and respectfully seek your support as fellow Nigerians everywhere in this land and the diaspora, as we embark on this great and exciting journey that lies ahead of us."
  },
  {
    "headline": "Breaking: Osinbajo Declares for President",
    "summarized_story": "Deji Elumoye in AbujaVice President Yemi Osinbajo has formally declared his intention to run for the 2023 Presidency on the platform of the ruling All Progressives Congress (APC).\nHe made the declaration on Monday morning in an address on various various media platforms on why he wanted to take over from President Muhammadu Buhari.\nOsinbajo appealed to the people to consider him for the coveted office of the President based on his wealth of experience and commitment to democratic norms.\nHe said he had come a long way having served as Justice Commissioner and Attorney-General of Lagos State from 1999 to 2007 and currently serving as Vice President since 2015.\nOsinbajo’s declaration came few hours after he met with APC Governors at his official residence at Akinola Aguda House in the State House, Abuja."
  },
  {
    "headline": "BREAKING: Vice President Osinbajo Officially Declares For President",
    "summarized_story": "The Vice-President of Nigeria, Prof Yemi Osinbajo on Monday officially declared to contest the 2023 presidential election.\n“I am today, with utmost humility formally declaring my intention to run for the office of the President of the Federal Republic of Nigeria on the platform of APC,” he said in a post on his official Twitter.\nOsinbajo had hosted All Progressives Congress governors on Sunday in Abuja.\nHe had hosted the governors for the breaking of Ramadan fast (Iftar) and declared his intention to them."
  },
  {
    "headline": "BREAKING: Vice President Osinbajo Officially Declares For President",
    "summarized_story": "The Vice-President of Nigeria, Prof Yemi Osinbajo on Monday officially declared to contest the 2023 presidential election.\n“I am today, with utmost humility formally declaring my intention to run for the office of the President of the Federal Republic of Nigeria on the platform of APC,” he said in a post on his official Twitter.\nOsinbajo had hosted All Progressives Congress governors on Sunday in Abuja.\nHe had hosted the governors for the breaking of Ramadan fast (Iftar) and declared his intention to them."
  },
  {
    "headline": "BREAKING: IPOB Bans Open Grazing Of Cows In South-East Nigeria, Releases Enforcement Date",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has announced that it will commence the enforcement of a ban on open grazing in the South-East region from April 27, 2022.\nHe explained that from the said date, those who are into cow business in the South-East must have a ranch, and properly mark their cows.\n“From April 27, 2022, anybody interested in cow business anywhere in Biafraland, must have a ranch and properly mark the cows.\nWe want to stop the incessant invasion of our communities and raping of our mothers and sisters by Fulani herdsmen.\nWe, therefore, want to stop using our money to finance the genocidal attacks on our people by Fulani herdsmen."
  },
  {
    "headline": "BREAKING: IPOB Bans Open Grazing Of Cows In South-East Nigeria, Releases Enforcement Date",
    "summarized_story": "The Indigenous People of Biafra (IPOB) has announced that it will commence the enforcement of a ban on open grazing in the South-East region from April 27, 2022.\nHe explained that from the said date, those who are into cow business in the South-East must have a ranch, and properly mark their cows.\n“From April 27, 2022, anybody interested in cow business anywhere in Biafraland, must have a ranch and properly mark the cows.\nWe want to stop the incessant invasion of our communities and raping of our mothers and sisters by Fulani herdsmen.\nWe, therefore, want to stop using our money to finance the genocidal attacks on our people by Fulani herdsmen."
  },
  {
    "headline": "BREAKING: Gunmen Burn Homes Of Imo Justice Commissioner And His Aged Father",
    "summarized_story": "Some gunmen have razed the country home of the Imo State Attorney General and Commissioner for Justice, Cyprian Akaolisa.\nThe assailants also burnt the residence of the father of the state justice commissioner located in the Orsu Local Government Area of the state.\nFirstly, last year, these arsonists burnt my country home in Obibi, Awo-Idemili, Orsu LGA of Imo State for no just cause.\nWho will invest in Ala Igbo nay Orsu LGA today under this type of atmosphere?\nEkene Nnodumele, the member representing Orsu State Constituency in the Imo State House of Assembly."
  },
  {
    "headline": "Meet corps member whose photography turned aged Oyo drummer into viral sensation",
    "summarized_story": "When Adisa Olashile, a corps member in Ibadan, Oyo state, noticed the frequent visits of an aged drummer to the venue of his community development service (CDS), many thoughts ran through his mind.\nAdvertisementHere was an old man always beaming with smiles and passionate about entertaining the corps members with his drumming skills each time they gather.\nAdvertisement“I always meet this man at the secretariat where we have our CDS, so I decided to make him smile more with my camera.\nAfter taking his pictures, Olashile realised he could do more for the man than just bring smiles to his face.\nHe decided to mint the man’s photographs as a non-fungible token (NFT) on OpenSea and sold them for 0.3 Ethereum (Eth) each."
  },
  {
    "headline": "Lagos police arrest, query officer for extorting corps member",
    "summarized_story": "An assistant superintendent of police (ASP) named Eyitere Joseph has been arrested for allegedly extorting the sum of N50,000 from a National Youth Service Corps (NYSC) member in Lagos state.\nHow would a father extort a corps member?\n“How would a father extort a corps member?\nThe money has been retrieved and returned to the Corps member.\nhttps://t.co/doLFGHzmIJ pic.twitter.com/p0GjDiFigX — SP Benjamin Hundeyin (@benhundeyin) April 7, 2022Advertisement“The money has been retrieved and returned to the Corps member."
  },
  {
    "headline": "Cannabis sweet tragedy: Mother’s final moments with Nigerian-born student who died in UK",
    "summarized_story": "There is a popular saying: A mother’s love is like an everlasting bed of roses that continues to blossom.\nWhether at the point of death or a stomach-aching laugh during Christmas, the affection between a daughter and her mother is unquantified, seamless and pure.\nAdvertisementWumi Olakanmi, mother of Damilola, the Nigerian-born student who died after she consumed cannabis sweets in the UK, couldn’t leave the bedside of her daughter in her final moments.\nThe 51-year-old was said to have kept vigil by her side until she took her last breath.\nSpeaking on Damilola’s death, Richard Taylor, a justice campaigner and relative of the family, said she was an only child, adding that she was a “promising young woman”."
  },
  {
    "headline": "ASUU strike: OAU extends mid-semester break by 4 weeks",
    "summarized_story": "The management of Obafemi Awolowo University (OAU) in Ile-Ife has extended the insitution’s mid-semester break by four weeks.\nOn March 28, the varsity had announced a two-week mid-semester break for its staff and students.\nAccording to Omosule, the extension of the break was necessary in the wake of ongoing industrial actions embarked upon by various staff unions in the Nigerian university system.\n“Students are therefore directed to continue with the mid-semester break for four (4) weeks beginning from Monday, April 11, 2022.”AdvertisementFor some weeks now, academic activities in several varsities across the country have remained paralysed due to strike by the Academic Staff Union of Universities (ASUU).\nOn March 27, the Senior Staff Association of Nigerian Universities (SSANU) and the Non-Academic Staff Union of Education and Associated Institutions (NASU) also declared two-week warning strike."
  },
  {
    "headline": "I've not heard from Annie Idibia since I apologised, says Wisdom Macaulay",
    "summarized_story": "Wisdom Macaulay, the brother of Nollywood actress Annie Idibia, says he’s yet to hear from his sister ever since he apologised for the allegations he made against her.\nAdvertisementWisdom had expressed remorse for accusing Annie of enslaving him, denying him his “dues”, and introducing him to hard drugs.\n“I want to use this opportunity to apologise to my sister Annie, her husband, and the entire Idibia family.\nWisdom said although his sister is yet to reach out to him, he has decided to move on with his life.\nI want to use this opportunity to thank everyone out there, who reached out to me through DMs and calls."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Can Hytch succeed where GoMyWay failed?",
    "summarized_story": "At the end of October 2018, the Nigerian ride-sharing platform GoMyWay ceased to exist after operating for about 4 years.\nGet the best African tech newsletters in your inboxLike GoMyWay, Hytch has also begun to ramp up users.\nGoMyWay, before it went into oblivion, had said it had over 12,000 users and had completed 106,630 rides across 16 states in Nigeria.\nFor Hytch, the opposite is the case as they want to make money as they go, and are already doing so.\nGoMyWay and others like Ridebliss, another local carpooling service that’ve since failed, are great learning references for Hytch."
  },
  {
    "headline": "Visa opens its first African innovation Studio in Kenya",
    "summarized_story": "Global payments company Visa has opened a new Innovation Studio in Nairobi, Kenya.\nThis facility will serve the sub-Saharan Africa region and joins a network of innovation centers operated by Visa since 2016, in cities including London, Dubai and Singapore.\nAida Diarra, Senior vice president and head of Visa in Sub-Saharan Africa, said the studio will assist in increasing the Visa market in the region by issuing digital and physical Visa to its clients.\nA photo of the corner fabrics section at the Visa Innovation studio in Nairobi“As a brand built on technology, Visa has driven the major technology advancements that make electronic payments what they are today.\nThe launch of Visa’s first African innovation studio and others serves as a boost to the African tech ecosystem as it’ll encourage the creation, development, and implementation of novel ideas."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there!\nInteresting times.\nThey say, “if you want something done right, do it yourself.” This is the closest..."
  },
  {
    "headline": "Don’t wait for ASUU; here are 7 marketable skills you can learn in 30 days",
    "summarized_story": "If you’ve accepted these consistent ASUU strikes and would like something to pass the time, you could consider learning these skills fit for high-ranking roles.\nFortunately, you can learn almost anything online via YouTube channels, remote training institutes, boot camps, and paid or free online learning platforms.\nYou can learn from scratch as long as you have soft skills like creative thinking, teamwork, consistency, and patience.\nGet going with free courses on Udemy or enrol and pay to get certified after course completion.\nBecause content transcends texts, learning content development includes building basics in video content, graphics, animation, content design, surveys, and generating polls."
  },
  {
    "headline": "Web3: Engineering tomorrow’s Internet at the Techpoint Africa Blockchain Summit",
    "summarized_story": "The Techpoint Africa Blockchain Summit themed Web3: Engineering tomorrow’s Internet is here, and we’re bringing together the best and brightest in the Web3 space to make sense of the new Internet era.\nFrom learning the basics of Web3 to discovering how to build a career in Web3 and blockchain, the Techpoint Africa Blockchain Summit is unpacking all there is to know about Web3 in breakout sessions structured to answer specific Web3-related questions.\nWho can attend the Techpoint Africa Blockchain Summit?\nThe Techpoint Africa Blockchain Summit will be held on May 21, 2022, at Four Points by Sheraton, Victoria Island, Lagos.\nHow do I register to attend the Techpoint Africa Blockchain Summit?"
  },
  {
    "headline": "Do you have a digital identity?",
    "summarized_story": "Share this article:Hello there,Today I’m discussing:What’s new in Africa digital identity raceEconet’s Smart Dollar US BundlesWhile you’re here, let’s start the new week with a good deed.\nDigital identity in AfricaIn the past week, news of telcos barring subscribers from making outgoing calls in Nigeria has been the talk of the town.\nIt was initially begun in December 2020 to grow the country’s digital identity database.\nNigeria’s — and indeed Africa’s — struggle with digital identity is not new.\nCertainly, the current digital identification drive is crucial — not to talk of legal — but questions regarding government trust also have to be asked."
  },
  {
    "headline": "NDLEA intercepts 101 parcels of cocaine in children duvets at Lagos Airport …Seizes drugged Milo Beverage in Edo – Nigerian Observer",
    "summarized_story": "The illicit drug was brought into the country by a 52-year-old Brazilian returnee, Akudirinwa Hilary Uchenna who hails from Oru East Local Government area of Imo state.\n“In a related development, big pellets of skunk concealed in detergent containers have been intercepted at the Akanu Ibiam International Airport, AIIA, Enugu.\nEzekwesili is from Awka south local government area of Anambra state.\nSkuchies are usually a mixture of Tramadol, Cannabis sativa, Codeine, Black Currant (popularly called Zobo) and water.\nWhile commending officers and men of the MMIA, AIIA, Edo, Zamfara, Akwa Ibom, Lagos and Ondo state Commands of the Agency for the arrests and seizures, Chairman of NDLEA, Brig."
  },
  {
    "headline": "Statistician-General of the Federation not dead – NBS – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe National Bureau of Statistics (NBS) has dismissed an online media report purporting that the Statistician-General of the Federation, Dr Simon Harry, is dead.\nIn a statement issued on Sunday in Abuja by Ichedi Joel, Director, Communication and Public Relations Department, NBS, said the report was false.\n“The fact of the matter is that the Statistician-General was slightly indisposed on Saturday and following medication is now recuperating.\n“We are well certain that he would, in a matter of a few days, be back to his desk and continue his work in repositioning the NBS as the foremost national statistics agency in Africa and among the best globally.\nThe statement urged the public to completely discountenance the purported death of the Statistician- General."
  },
  {
    "headline": "Edo Govt. Partners MacTay Consulting To Train Heads Of MDAs On Performance Management System – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe commitment of the Governor Godwin Obaseki-led administration to the implementation of the Making Edo Great Again (MEGA) Agenda has brought about a series of notable reforms in the State Civil and Public service.\nIn her opening address, the Managing Director of the Chief John Odigie-Oyegun Public Service Academy, Mrs.\nIn the course of the training, participants were advised to take performance review seriously as targets must be met, and taxpayers’ money must be accounted for.\nThe administration believes that performance is key if they must deliver on the promises made to Edo people.\nPMS is a shift in mindset” said Mr. Ajayi Adeyemi, a Consultant and Facilitator from MacTay Consulting."
  },
  {
    "headline": "ESOPP: Edo targets 1m metric tons of palm oil production by 2030 – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has said it plans to add over one million metric tons to local production of Crude Palm Oil (CPO) by 2030, on the back of investment in the sector by the Governor Godwin Obaseki-led administration.\nThe Edo State Commissioner for Agriculture and Food Security, Mr. Stephen Idehenre, disclosed this to journalists in Benin City.\nHe noted that the government’s investment in palm oil production through the Edo State Oil Palm Programme (ESOPP), among other initiatives, has continued to open up the space for large-scale commercial farming in the state, impacting the lives of thousands of farmers.\nIdehenre said, “We have continued to record a remarkable influx of investors in the agriculture sector with the Edo State Oil Palm Programme (ESOPP), in furtherance of our aim of anchoring our economic growth on commercial agriculture while sustaining food security.\nThe programme is expected to create over 200,000 jobs across the value chain.”“We will add over 1,000,000 metric tons to local production of Crude Palm Oil (CPO) by 2030,” the commissioner added."
  },
  {
    "headline": "‘I want to continue with Buhari’s legacy:’ – Osinbajo’s Declaration Speech",
    "summarized_story": "In a broadcast posted on all his verified social media handles, he promised to build on the legacy of President Muhammadu Buhari, his principal.\nThe Vice-President was appointed Attorney-General of Lagos State in 1999 by then Governor, Bola Tinubu, and held the position till 2007, implementing several judicial reforms.\nHe was nominated as Buhari’s running mate in 2014 and was elected alongside Buhari in 2015.\nI know their hopes, aspirations and fears, and I believe that in those hopes and aspirations are the seeds for the great Nigeria that we all desire.\nWe will, working together, establish by the grace of God, the Nigeria of our dreams in a few short years."
  },
  {
    "headline": "Adebanjo says he’s already gone, expecting his funeral at 94",
    "summarized_story": "Elder statesman and leader of Afenifere, Pa Ayo Adebanjo, has said that at the age of 94, he’s already gone and only expecting his funeral.\nHe noted, however, that he has tried his best and would leave the issues for the younger generation, as according to him, he’s already gone and expecting his funeral.\n“It is left for you younger generation and as I said, I am already gone and I am expecting my funeral.\n“Since when has the governor of Borno State told us Boko Harm has taken so many local governments in his state?\n“Since when has the government of Niger State told us that Boko Haram territories are increasing?You see, they are all living in denial."
  },
  {
    "headline": "2023: I’ve the experience – Osinbajo says as he declares for president",
    "summarized_story": "Nigeria’s vice president, Prof Yemi Osinbajo, has declared his intention to run for president in 2023, noting that he has what it takes to deliver on the job.\nThe vice president in a post via his twitter account on Monday morning, said intends to run for the office on the platform of the All Progressives Congress (APC).\n“I am today, with utmost humility formally declaring my intention to run for the office of the President of the Federal Republic of Nigeria on the platform of APC,” Osinbajo said.\n“At the direction of Mr. President, I have represented our country in several international engagements.\nI have visited our gallant troops in the North-East and our brothers and sisters in the IDP camps."
  },
  {
    "headline": "Police arrest husband of late popular singer, Osinachi Nwachukwu over her death",
    "summarized_story": "Mr. Peter Nwachukwu, the husband of late popular gospel artiste, Osinachi Nwachukwu has been arrested by the police over his wife’s death.\nFollowing her death, many, including gospel artist, Frank Edwards and her other colleagues accused her husband of beating her repeatedly, which according to them led to her death.\nEdwards, in a live Instagram video, alleged that Osinachi’s husband abused her on several occasions.\nThat was when I got a glimpse into what was happening.”Another gospel artiste, Asu Ekiye, called for the arrest of her husband.\n“And we have yet to receive any information from the hospital as to the cause of her death,” he added."
  },
  {
    "headline": "JUST-IN: Unknown Gunmen Kill APC Chairman In Osun",
    "summarized_story": "Suspected gunmen this morning have killed the chairman of the All Progressives Congress (APC) in Atakumosa East Central local government area of Osun State, Chief Gbenga Ogbara.\nLEADERSHIP gathered that Ogbara was shot dead inside his sitting room in Igangan, his hometown at about 12am.\nA source hinted that Ogbara’s remains has been deposited at Wesley Guild Hospital, Ilesa.\nMeanwhile, the Public Relations Officer, Osun State Command, Mrs Yemisi Opalola, confirmed the incident.\nOpalola said: “The APC chairman was killed around 12am by some gunmen."
  },
  {
    "headline": "Osinachi: Police Arrest Husband In Abuja",
    "summarized_story": "The Nigeria Police has arrested Peter Nwachukwu, the husband of the late gospel singer, Osinachi Nwachukwu, of the ‘Ekwueme’ fame.\nGospel Singer, Osinachi, Dies After Brief IllnessThere are allegations, which were later confirmed by late Osinachi’s older sister that the husband actually kicked her in the chest, which led to her being hospitalised.\nThe Police Public Relations Officer, Josephine Adeh, confirmed the arrest of the late singer’s husband to journalists.\nThe gospel singers and ministers across Nigeria have also urged Nigerians to await the outcome of the autopsy on the late gospel artiste, Osinachi Nwachukwu.\nOsinachi, 42, who died on Friday at an Abuja hospital, was a lead singer at the Dunamis International Church."
  },
  {
    "headline": "BREAKING: 5 Killed, 60 Boats Burnt As Fire Guts Jetty In Rivers",
    "summarized_story": "No fewer than five persons, including two pregnant women and a baby were killed on Monday morning following a fire outbreak at Bonny/Nembe/Bille Jetty in Port Harcourt, Rivers State.\nAlso over 60 passenger boats were destroyed in the inferno, which began in the early hours of Monday.\nADVERTISEMENTAlthough the cause of the fire incident, which is the second in less than four month was not known, some residents of the area said it might not be unconnected with a storage of illegally refined petroleum products at the jetty.\nDetails Later…"
  },
  {
    "headline": "BREAKING: 5 Killed, 60 Boats Burnt As Fire Guts Jetty In Rivers",
    "summarized_story": "No fewer than five persons, including two pregnant women and a baby were killed on Monday morning following a fire outbreak at Bonny/Nembe/Bille Jetty in Port Harcourt, Rivers State.\nAlso over 60 passenger boats were destroyed in the inferno, which began in the early hours of Monday.\nADVERTISEMENTAlthough the cause of the fire incident, which is the second in less than four month was not known, some residents of the area said it might not be unconnected with a storage of illegally refined petroleum products at the jetty.\nDetails Later…"
  },
  {
    "headline": "Electoral Act Appeal: A/Court Warns AGF, Others Against Delaying Hearing",
    "summarized_story": "The court granted PDP’s request to file its appeal as an interested person against the decision of the Federal High Court, Umuahia, on the order for removal of the section from the electoral law.\nThe appeal marked CA/OW/87/2022 has Chief Nduka Edede and the AGF as the 1st and 2nd respondents respectively.\n“The matter is adjourned to the 4th of May, 2022, for the hearing of the appeal.\nA Federal High Court, Umuahia division had on March 18, 2022, declared as invalid and unconstitutional section 84 (12) of the amended Electoral Act.\nJustice Evelyn Anyadike in a judgment ordered the AGF to delete the section from the amended Electoral Act."
  },
  {
    "headline": "BREAKING: Tinubu In Crucial Meeting With APC Governors",
    "summarized_story": "The National Leader of the All Progressives Congress, APC, has summoned an urgent meeting with Governors on the Platform of the party.\nTinubu’s move is coming shortly after Vice President, Yemi Osinbajo declared to run for President in 2023.\nEarlier reported that Osinbajo met with APC governors on Sunday night in Abuja before declaring today.\nHe told them of his plans to contest for the presidential ticket of the APC in what will be a direct challenge against Tinubu who declared for the same position weeks ago.\nThis morning’s meeting has been scheduled to begin at 10 a.m Monday at the Kebbi house on Plot 70, Kur Mohammed Way, Off Ahmadu Bello Way, Central Business District, Abuja."
  },
  {
    "headline": "2023: Tinubu And Osinbajo’s Supporters Clash On Twitter",
    "summarized_story": "Minutes after Vice President Yemi Osinbajo declared his intention to run the race for the 2023 presidency, supporters of Asiwaju Bola Tinubu have reacted.\nDifferent reactions have been thrown in, other people have thrown in their takes on this, and a few bants between supporters of Osinbajo and Tinubu could be seen amidst all.\nOne Jagaban Matasa tweeted attaching a picture of Osinbajo to it saying; “Me to my son: look son, don’t be a betrayer like that man.”A fan of Osinbajo definitely replied saying; “Son look at that man he is so humble and loyal he is our next president by the grace of God.”See their exchange below:Here are some more reactions.."
  },
  {
    "headline": "#OsinbajoDeclares: Reactions As Osinbajo Joins 2023 Presidential Race",
    "summarized_story": "The official presidential announcement of Nigeria’s Vice President, Professor Yemi Osinbajo, has elicited a variety of views.\nThe vice president has previously addressed Nigerians about his decision to run for President in 2023, according to Naija News.\nFollowing the news, some Nigerians praised the vice president for entering the presidential contest, while others derided him for being a stooge of President Muhammadu Buhari.\n!”@GhesheS wrote: “Nigeria unifier has spoken!\nWe are with you on these sir.”@Sandra_LOAT wrote: “As the Vice President, you didn’t do anything."
  },
  {
    "headline": "BREAKING: Osinbajo Finally Declares For President",
    "summarized_story": "Vice President Yemi Osinbajo has officially announced his decision to run for president in 2023 on the All Progressives Congress’s (APC) ticket.\nOn Monday morning, Osinbajo revealed this in a video broadcast to his social media channels.\nAccording to him: “For the past seven (7) years, I have served as Vice President under a true Nigerian patriot, President Muhammadu Buhari.\nI know and I understand our hopes, aspirations and fears from a place of relatable proximity; and I believe that in those hopes and aspirations are the seeds for the great Nigeria that we all desire.\nThis is why today, with utmost humility, I formally declare my intention to run for the office of the President, Federal Republic of Nigeria, on the platform of our great party, the All Progressives Congress."
  },
  {
    "headline": "[Breaking] VIDEO: Watch as Vice President, Yemi Osinbajo, declares interest to succeed Buhari",
    "summarized_story": "After a long wait, Vice President, Prof. Yemi Osinbajo, has joined 2023 presidential race.\nAs reported by Blueprint, Prof. Osinbajo made his intention to takeover from President Muhammadu Buhari in 2023 in a video via YouTube on Monday."
  },
  {
    "headline": "[Breaking] French election: Macron wins first round, gears up for presidential runoff",
    "summarized_story": "Emmanuel Macron has won the first round of the French election and for a second time will fight far-right leader Marine Le Pen for the presidency on April 24, 2022.\nMs Le Pen called on every non-Macron voter to join her and “put France back in order”.\nVeteran far-left agitator Jean-Luc Mélenchon finished narrowly behind Marine Le Pen in third and he now has the unlikely role of kingmaker.\n“You must not give a single vote to Marine Le Pen,” he warned his supporters, but unlike other candidates, he did not back the president.\nMarine Le Pen can count on supporters of Eric Zemmour, whose more hardline nationalism gave him fourth place and 7%."
  },
  {
    "headline": "Breaking: Again, hoodlums invade, raze commissioner, father’s house in Imo",
    "summarized_story": "The country home of the Attorney-General and Commissioner for Justice in Imo state, Barr.\nCyprian Akolisa, in Obibi Awo-Idemili in Orsu local government area of Imo state was on Sunday reduced to rubbles.\nSometime last year, his house was also burnt along side that of the lawmaker representing Orsu state constituency in the Imo State House of Assembly, Hon Ekene Nnodimele, when crisis in the local government area reached crescendo.\nThe commissioner who confirmed the incident also said that the hoodlums burnt his father’s house as well, thus making it more difficult to know what actually led to their action.\nAs at the time of filing this report, Imo Police was yet to react on the incident."
  },
  {
    "headline": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE – NigPilot",
    "summarized_story": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE, CALLS BOOT PARTY AN APPENDAGE OF THE ALL PROGRESSIVE CONGRESS (APC)The Alliance of Collaborating Political Parties (ACPP) has condemned the felonious court case instituted against the People’s Democratic Party Governorship Candidate in Osun State by the Governorship Candidate of the Boot Party, Adesoji Adeleke.\nIn a statement issued by a Chieftain of the Alliance, Wole Adedoyin who was also the 2018 Governorship Candidate of the Hope Democratic Party (HDP) said the case is baseless, mischievous and full of contradictions to ridicule Senator Demola Adeleke and the People’s Democratic Party (PDP).\nACPP said the suit against Senator Demola Adeleke was in bad faith and targeted by undemocratic elements to undermine democracy and good governance in Osun State.\nAdedoyin said: The Boot Party has become an appendage of the All Progressive Congress (APC) in Osun State.\nThe party is not serious about winning the forthcoming Osun Governorship Election."
  },
  {
    "headline": "Soludo sets up 15 man peace Committee on insecurity in South East",
    "summarized_story": "Anambra state government has set up a truth, justice and peace Committee which is comprised of 15 members drawn from different fringes of the South Eastern region.\nThe members of the committee are Prof.Chidi Odinkalu as the Chairman, Amb.\nMrs. Bianca Ojukwu, Secretary, Dr. Joe Nworgu,Dr. Udenta Udenta, Mr. Charles Oputa(Charly Boy), Ms. Onyeka Onyenu.\n” To identify the remote and immediate causes of the agitations, restiveness, violence, and armed struggle in the South East since 1999.\nIt was gathered the committee would be inaugurated on a date to be communicated to its members."
  },
  {
    "headline": "Lalong salutes elder statesman Amb Yahaya Kwande @ 93",
    "summarized_story": "Plateau State Governor Simon Bako Lalong has sent warm felicitations to elder statesman Ambassador Yahaya Kwande on the occasion of his 93rd birthday.\nGovernor Lalong in a message signed by Macham Makut the director of press and public affairs to Governor Lalong congratulated the seasoned Administrator, Politician, Diplomat and philanthropist for his selfless service to Nigeria, Plateau State and humanity at large.\nHe described him as an accomplished personality who has made huge impact in the lives of the people at various times when he occupied various offices in the country.\nThe Governor said Ambassador Kwande has mentored many in public service, politics and humanitarian activities by his record of performance over the years where he has freely offered counsel, support and goodwill to those in power and others.\nAccording to Governor Lalong, Ambassador Yahaya is one of the few elders that have demonstrated sufficient interest in the peace, progress and prosperity of Plateau State and Nigeria over the years, hence his willingness to advise and share his wealth of experience with the Government on key issues."
  },
  {
    "headline": "Edo LG Poll: EDSIEC extends date for conduct of primaries, insists on April 19 for election",
    "summarized_story": "The Edo State Independent Electoral Commission (EDSIEC) has extended the date for the conduct of party primaries for the local government elections by two days.\nThe Commission, however, said the extension will not affect the April 19 date earlier scheduled for the council polls.\nThe statement reads: “It is hereby announced for the information of the general public, particularly Registered Political Parties in the state that the Edo State Independent Electoral Commission has extended the date for the conduct of primaries by two (2) days.\n“This is in view of the number of Registered Political Parties that have scheduled their primaries on the 6th of April, 2022 which is the last day for the conduct of the primaries.\nThe last date for the primaries is Friday, April 8, 2022.”“The shift of date for the primaries has nothing to do with the date of the election, as other dates remain fixed and firm,” Ojo added."
  },
  {
    "headline": "Soludo declares Monday, a prayer session to counter IPOB sit-at-home order – NigPilot",
    "summarized_story": "The Anambra State Governor, Prof. Chukwuma Soludo, has urged the people of the state to observe a one-day prayer session on Monday, to curb the activities of the gunmen terrorising the state and the South East region in general.\nThe governor said the prayer session slated to hold on Monday, April 4, 2022, at churches and other religious worshipping centres across the state was necessary to counter the evil attached to the Indigenous People of Biafra, IPOB sit-at-home order.\nHe explained that the prayer session would be against those hiding under the IPOB name to cause havoc in the state.\n“I enjoin you to pause and join in fellowship as we seek the face of God.It is expected that the conclusion of the prayer session shall mark the end of Sit At Home in Anambra State” Soludo declared.\n” We shall empower them to become useful to their families, communities, state, region and the society at large."
  },
  {
    "headline": "Vice President Yemi Osinbajo Declares His Intention To Run For President in 2023",
    "summarized_story": "﻿Vice President Yemi Osinbajo on Monday formally declared his intention to run for President in 2023.\nHis declaration ends months of speculation over his interest in the 2023 presidential race and widens the pool of candidates for the position.\nIt also puts him in direct confrontation with his former boss in Lagos State, Bola Ahmed Tinubu, who signalled his intention earlier in the year.\nIn his declaration speech, Osinbajo said he was committed to continuing President Muhammadu Buhari’s vision for the country.\nIn May 2017, Osinbajo emerged as acting President after Buhari embarked on a medical trip abroad."
  },
  {
    "headline": "Why I Am Running For President – Osinbajo (Full Text)",
    "summarized_story": "Vice President Yemi Osinbajo on Monday declared his intention to run for the presidential seat in the 2023 election, ending months of speculation over his interest in the post.\nOsinbajo joins the increasing number of high-profile Nigerians who have declared their interest in the country’s presidential post under the ruling All Progressives Congress (APC).\nI know their hopes, aspirations and fears; and I believe that in those hopes and aspirations are the seeds for the great Nigeria that we all desire.\nWe will, working together, establish by the grace of God, the Nigeria of our dreams in a few short years.\nProf. Yemi Osinbajo, SANVice President, Federal Republic of NigeriaMonday April 11, 2022"
  },
  {
    "headline": "Pregnant Lady, Others Feared Dead As Fire Guts Jetty In Port Harcourt",
    "summarized_story": "Several persons, including a pregnant woman and a toddler, have been reportedly burnt to death in an early morning fire at the popular Bonny-Bille-Nembe jetty in the Port Harcourt, Rivers State.\nSeveral fibre and wooden boats are also said to be destroyed in the inferno which started at about 2 am on Monday.\nHowever, previous fire outbreaks at the jetty had been attributed to the storage of inflammable substances like petroleum products used in powering the speed boat engines in makeshift buildings within the slump.\nThe jetty is usually a busy transit point for thousands of residents traveling from Port Harcourt by sea to Bonny, Bille, Nembe, and other riverine communities.\nThe effects of these disasters are usually massive due to slow response to emergencies by the authorities or difficulties accessing the scene due to the terrain."
  },
  {
    "headline": "Kaduna Train Attack: Bandits Parade Kidnapped Victims Including Student",
    "summarized_story": "﻿Bandits who attacked the Kaduna-Abuja bound train on March 28 have paraded their victims in an unidentified location suspected to be a forest.\nIn a video obtained by Channels Television, the gunmen were seen putting on military camouflage and uniforms.\nThe bandits made their captives call on the government to come to their rescue.\nOne of the victims is a young lady who identified herself as a student of Kaduna State University.\nThe sophisticated attack saw gunmen blow up the tracks to halt a train from the capital Abuja to Kaduna — Nigeria’s flagship rail service."
  },
  {
    "headline": "MTN Gets CBN Approval To Operate Payment Service Bank",
    "summarized_story": "Telecommunication giant, MTN, has received the final approval to operate as Momo Payment Service Bank Limited (Momo PSB).\nThe approval was granted by the Central Bank of Nigeria (CBN), according to a statement issued on Monday by MTN Secretary, Uro Ukpanah.\n“MTN Nigeria Communications PIc (MN Nigeria) announces the receipt of a letter dated 8 April 2022 from the CBN addressed to Momo PSB conveying final approval to commence operations,” the statement partly read.\nThey are expected to operate in rural regions and areas where Nigerians do not have bank accounts and should have at least 50 percent physical access points in rural areas.\nFollowing the CBN nod, MTN Nigeria will join the likes of Moneymaster PSB, a subsidiary of Glo, and 9PSB, a subsidiary of 9mobile, to operate in the fintech space."
  },
  {
    "headline": "Rotimi Amaechi joins 2023 Presidential race",
    "summarized_story": "The Minister of Transportation, Rotimi Amaechi, has confirmed his candidacy for the 2023 presidential election on the platform of the ruling All Progressives Congress (APC).\nThe former Rivers State governor vowed to end the nation’s persistent problems and bring about prosperity at a thanksgiving event organised by the party’s Rivers State Chapter on Saturday.\nUntil Monday, the minister, who is the sixth APC presidential candidate to officially declare his intention, has consistently denied any involvement in the race.\nThe APC’s South-South leader, stated that he would use his 23 years of government experience, ranging from speaker to governor to minister, to help restore the country.\nThe Plateau State Governor, Simon Lalong, who spoke on behalf of the Northern Governors’ Forum and the Progressive Governors’ Forum, said the media had exaggerated Amaechi’s lack of structure in the state."
  },
  {
    "headline": "Nigeria's challenges can only be solved by group of genuine minded persons",
    "summarized_story": "A Presidential aspirant, Christopher Imumolen has declared that Nigeria’s challenges cannot be solved alone by an individual; but by a group of genuine minded persons.\nHe made this known in a chat with newsmen shortly after a closed door meeting with Nigeria’s former president, Olusegun Obasanjo in Abeokuta the Ogun state capital.\nHe noted that the visit became imperative to tap from the former president’s wealth of experience; with a pledge to help solve Nigeria’s challenges.\nThe Presidential aspirant said he will be bringing his private sector expertise to bear."
  },
  {
    "headline": "2023 Presidency: Group advocates for zoning to South East",
    "summarized_story": "A coalition of South East Renaissance Assembly is requesting that other geopolitical zones should concede the next presidential slot to the South East region.\nThe group made up of former political officers, pressure Groups from the five South East states, made the request at a news conference in Enugu.\nAmong some sections of the polity, the demand that south east geopolitical zone should be preferred for the 2023 presidential ticket, is greatly important.\nThis coalition of Igbo elders group is not different in the quest.\nThey believed that Nigeria’s president of south east extraction, will automatically douse the rising secessionist agitation in the zone."
  },
  {
    "headline": "Edo LG Poll: EDSIEC suspends conduct of elections",
    "summarized_story": "The Edo State Independent Electoral Commission (EDSIEC) has suspended the conduct of the local government elections scheduled for April 19, 2022.\nAccording to a statement signed by Emmanuel Abebe on behalf of the Chairman of EDSIEC, the suspension of the local council elections was due to the restraining order by the Federal High Court, Abuja on the Edo State Independent Electoral Commission.\nThe commission said all processes leading to the conduct of the elections have been suspended, pending the hearing and determination of the Motion on Notice.\nHe said the announcement is for the information of the general public that due to the content of the publication in the Vanguard Newspaper of 7th April, 2022 by which the Federal High Court Abuja restrained the Edo State Independent Electoral Commission from conducting the Local Government Elections in the State scheduled for 19th April 2022, all processes leading to the conduct of the said elections are hereby suspended, pending the hearing and determination of the Motion on Notice.”"
  },
  {
    "headline": "Buhari, Governors Eulogise Business Magnate, Aliko Dangote at 65",
    "summarized_story": "President Muhammadu Buhari, the Northern Governors Forum (NGF) and Lagos State Governor, Mr. Babajide Sanwo-Olu, have congratulated the Chairman and Chief Executive Officer of Dangote Group, Aliko Dangote, as he marked his 65th birthday anniversar on Sunday.\nIn a statement Sunday by his Media Adviser, Femi Adesina, the president joined family members, friends and associates to celebrate the milestone with the business magnate.\nBuhari appreciated the patriotism, simplicity and wisdom that Dangote has consistently displayed, making Nigeria and Nigerians his first priority, while setting example for many that charity truly begins from home.\nOn their part, members of the NGF described Alhaji Aliko Dangote as a pride to the North, Nigeria, and Africa, adding that his business prowess has brought succor to humanity across the globe.\nYou are an employer of labour and a respected business magnate who is contributing positively to the economy of Nigeria."
  },
  {
    "headline": "Elon Musk U-Turns on Joining Twitter Board after Becoming Firm’s Largest Shareholder",
    "summarized_story": "Twitter’s CEO has said it is “for the best” after Elon Musk decided not to join the social media giant’s board, despite becoming the company’s single largest shareholder.\n“I believe this is for the best,” Mr Agrawal said, adding that the company had been “clear about the risks” of Musk joining the board, without giving specific reasons.\nMusk appeared to have been looking forward to joining the board, tweeting on Thursday that its next meeting was “gonna be lit”.\nAfter Donald Trump was barred from Facebook and Twitter, Musk tweeted that many people would be unhappy with US tech companies acting as the “de facto arbiter of free speech”.\n“Elon is our biggest shareholder and we will remain open to his input,” Mr Agrawal added in a tweeted statement."
  },
  {
    "headline": "Macron to Face Le Pen in French Presidential Election Runoff on April 24",
    "summarized_story": "French leader Emmanuel Macron and challenger Marine Le Pen qualified for what promises to be a very tightly fought presidential election runoff on April 24, pitting a pro-European economic liberal against a far-right nationalist.\nWith 96 percent of the votes counted for Sunday’s first round, Macron garnered 27.41 percent of the votes and Le Pen 24.03 percent.\nIfop pollsters predicted a very tight runoff, with 51 percent for Macron and 49 percent for Le Pen.\nBut that was in any case much narrower than in 2017, when Macron beat Le Pen with 66.1 percent of the votes.\nPolitical Commentator Pierre Huski said that Le Pen might be disappointed with the projected results announced."
  },
  {
    "headline": "Nigeria Vice President Yemi Osinbajo Officially Declares Presidential Ambition",
    "summarized_story": "Nigeria’s Vice-President Yemi Osinbajo on Monday officially declared his intention to contest the 2023 presidential election.\nOsinbajo appealed to the people to consider him for the coveted office of the President based on his wealth of experience and commitment to democratic norms.\nOsinbajo, who turned 65 last month, is a senior advocate of Nigeria and a former lecturer at the University of Lagos.\nThe Vice-President was appointed Attorney-General of Lagos State in 1999 by then Governor, Bola Tinubu, and held the position till 2007, implementing several judicial reforms.\nOsinbajo will be contesting the APC Presidential primary against APC National Leader and former Lagos State Governor Bola Tinubu; the Minister of Transportation, Rotimi Amaechi; Ebonyi State Governor, Dave Umahi; and Governor Yahaya Bello of Kogi State."
  },
  {
    "headline": "Bolaji Akinyemi: Projecting Elections in Europe Has Made Fools of Many Political Scientists",
    "summarized_story": "Polls opened across France on Sunday for the first round of the country’s presidential election, where up to 48 million voters seek to elect one of 12 candidates, as President Emmanuel Macron seeks a second five-year term in office.\n#ThisDayLive discusses this and more."
  }
]