[
  {
    "headline": "Fuel subsidy: NEC considers report today, TUC meets, ASCSN threatens showdown",
    "summarized_story": "THE Trade Union Congress will today (Thursday) take a position on the planned removal of the fuel subsidy by the Federal Government.\nSo, you just wake up and say you are removing fuel subsidy.\nWith the recommendations, the committee added that the federal government would save N250 billion per month on petrol subsidy removal.\n“While there are indeed ongoing discussions on the issue of fuel subsidy, at no time has NEC made any such resolution,” Akande said on Twitter.\nHowever, Senate President Ahmad Lawan on Tuesday said the President told him that he did not order anyone to remove fuel subsidy."
  },
  {
    "headline": "Reps order probe of Malami, IG’s involvement in Magodo estate dispute",
    "summarized_story": "The House of Representatives has mandated its Committees on Justice, Public Petition and Police Affairs to “investigate the involvement” of the Minister of Justice and Attorney General of the Federation, Abubakar Malami (SAN), and the Inspector-General of Police, Usman Baba, in the crisis over the ownership of the land in Magodo GRA Phase 2, Lagos State.\n“The judgment that was supposedly being enforced was delivered in 2012 by the Supreme Court in Military Governors of Lagos State & Ors Vs. Adebayo Adeyiga & Ors in Appeal No SC/112/2002, wherein the apex court affirmed the judgment of the Court of Appeal and the High Court delivered on the December 31, 1993 in suit No ID/795/88.\n“The House is worried that the execution being presently executed through the Office of the AGF, with the connivance of the IGP, is illegal as only the Lagos State Deputy Sheriff can execute the same and not thugs aided by policemen.\nThis material, and other digital content on this website, may not be reproduced, published, broadcast, rewritten or redistributed in whole or in part without prior express written permission from PUNCH.\nContact: [email protected]"
  },
  {
    "headline": "Gulf of Guinea records sharp drop in piracy incidents",
    "summarized_story": "The region which hosts Nigeria’s waters, according to global maritime body’s latest report, recorded 34 incidents of maritime piracy and armed robbery in 2021, a sharp drop from 81 in 2020.\nREAD ALSOBreaking: Reps approve direct and indirect primary clauses in electoral billIn the annual piracy report IMB attributed the drop in incidents to increased presence of international naval vessels and cooperation between regional authorities.\n“While kidnappings at sea dropped 55 percent in 2021, the Gulf of Guinea continues to account for all kidnapping incidents globally, with 57 crew taken in seven separate incidents,” said the report.\nThe decline of piracy incidents in the Gulf of Guinea also led to the overall reduction in reported incidents in 2021 globally, said the report, adding in 2021, the IMB piracy reporting center received 132 incidents of piracy and armed robbery against ships across the world, the lowest recorded level since 1994.\nSimilarly, President of the Center for Marine Surveyors, Engr Akin Olaniyan, commended the NIMASA and the Nigerian Navy for the Deep Blue initiative, Nigeria’s major maritime security facility."
  },
  {
    "headline": "Governors in marathon meeting on insecurity, health, food security, others",
    "summarized_story": "15 govs, 10 deputies in attendanceEFCC Chairman, CBN Governor also in attendanceBy Henry UmoruTHE thirty-six state governors under the aegis of Nigeria Governors’ Forums, NGF, are engaged in a marathon meeting to brainstorm on the nation’s security challenges, health, food security, among others.\nSurprisingly, the Chairman of the Economic and Financial Crimes Commission, EFCC, Abdulrasheed Bawa is at the meeting to brief the governors, even as the Governor of Central Bank of Nigeria, EFCC, Godwin Emefiele also attended the meeting.\nOn ground for the meeting are the NGF Chairman and Ekiti State governor, Dr Kayode Fayemi, governors of Kano State; Nasarawa, Kano; Anambra, Oyo, Osun and Imo States.\nAlso present at the meeting are Governors of Edo; Kebbi; Borno; Niger; Kwara; Plateau; Ogun and Bayelsa States.\nAlso at the meeting are Deputy Governors of Gombe; Yobe; Enugu; Bauchi; Lagos; Ondo and Benue."
  },
  {
    "headline": "EKITI GOV: US-based public health practitioner woos Gani Adams for Oyebanji",
    "summarized_story": "Aare Onakakanfo of Yorubaland, Aare Gani AdamsUnited States-based public health practitioner and business mogul, Prince Adeolu Tinubu has urged Iba Gani Adams, the Aare Ona Kakanfo of Yorubaland to support and canvass for Abiodun Oyebanji as the next Governor of Ekiti State among all Yoruba sons and daughters in Nigeria and the Diaspora.\nReacting to this, Otunba Gani Adams lauded the Emure Ekiti-born Prince Adeolu Tinubu for his patriotic efforts towards the fight against insurgency in the country, particularly in Ekiti State through the Biodun Oyebanji’s Community Policing Model.\nEKITI GOV: US-based public health practitioner woos Gani Adams for OyebanjiUnited States-based public health practitioner and business mogul, Prince Adeolu Tinubu has urged Iba Gani Adams, the Aare Ona Kakanfo of Yorubaland to support and canvass for Abiodun Oyebanji as the next Governor of Ekiti State among all Yoruba sons and daughters in Nigeria and the Diaspora.\nReacting to this, Otunba Gani Adams lauded the Emure Ekiti-born Prince Adeolu Tinubu for his patriotic efforts towards the fight against insurgency in the country, particularly in Ekiti State through the Biodun Oyebanji’s Community Policing Model.\nHe, however, noted that even when the leadership of OPC had resolved not to be directly involved in any political activities in the country, he assured Prince Tinubu of the solidarity and support of members in Ekiti State."
  },
  {
    "headline": "Good governance shouldn’t be left for Buhari alone ― Hon Ulafor",
    "summarized_story": "President Muhammadu BuhariBy Ike Uchechukwu – CalabarCross River State Commissioner for Grants, Hon.\nJohn Ulafor, has asserted that achieving good governance and development should not be left to President Muhammadu Buhari alone, but should be seen as a collective responsibility to serve as dividends of democracy to the people.\nUkele must be heard, let me go to Abuja, to do the needful, and ensure that we bring diffidence of Democracy to our state and Ogoja/Yala federal constituency.\nAnd as a commissioner, as DG, as this as that, in Cross River State since 1998 till date,” he said.\nThe lawmaker promised to ensure the availability of social amenities if elected to occupy the Ogoja/Yala federal House of representative seat adding that effective representation will reduce crime."
  },
  {
    "headline": "Why we reverse ourselves after releasing cargos — Customs",
    "summarized_story": "In the counter-check operations Customs operatives gives clean bill and releases cargo only for another set of operatives to interdict and seize same cargo at a different point.\nHe said, “Customs release and customs intercepts; well, all these kinds of issues are as a result of lack of compliance.\nIf we are sure of our compliance customs will not stop what customs has already released.\n“For those complaining about stoppage of goods on the roads, Customs has layers of control, not only at the seaports.\n“If you go to federal operations units and look at the statistics of their performance, you will be surprised.”"
  },
  {
    "headline": "Police refute alleged relocation of bandits kingpin, Bello Turji to Kwara",
    "summarized_story": "The Kwara State Police Command has refuted reports that the fleeing Zamfara State bandits kingpin, Bello Turji, has relocated to an unidentified forest in the state.\n“However, the statement by the lawmaker did not reveal the source or veracity of its assertion,” the police spokesman noted, assuring that “Kwara state is safe and secure.”Okasanmi said “All the boundaries, both local and international within the state have been well and massively policed by both the police and the military.\n“Vigilante and local hunters are working tirelessly with security agents to ensure our forests are well monitored and protected,” he added.\nThe commissioner also advised the public to make information of strange movements and activities around them available to the security agencies at all times.\nDAILY POST recalls that the rumour of the bandits kingpin, Bello Turji and his gang went viral to the effect that he had relocated to Kwara State, following the onslaught by security forces on their hideouts in Zamfara State, recently."
  },
  {
    "headline": "2023 Presidecy: Ohanaeze hails Anyim, Umahi, tasks Ugwuanyi, others",
    "summarized_story": "The Youth wing of the apex Igbo socio-cultural organization, Ohanaeze Ndigbo, has commended some Igbo politicians for stepping out to declare interest for the 2023 Presidential race.\nFormer Secretary to the Government of the Federation, SGF, Senator Anyim Pius Anyim of the Peoples Democratic Party, PDP, has also declared his interest.\n“It is not enough to declare interest; they must follow it up with consultations across the country.\nThe OYC, however, urged Governor Ifeanyi Ugwuanyi to boldly join the presidential race.\nThey said “We see Governor Ifeanyi Ugwuanyi of Enugu State as one of the best hands we have for the presidency in 2023."
  },
  {
    "headline": "2023: APC will not crash after Buhari’s tenure – Gov Badaru",
    "summarized_story": "The Governor of Jigawa State, Muhammad Badaru Abubakar, has said that the All Progressives Congress, APC, will continue to remain united and stronger even after the tenure of President Muhammadu Buhari in 2023.\nThe governor stated this when he featured on Newsnight, a programme on Channels Television monitored by DAILY POST on Sunday.\nThe governor stated this while responding to the opposition’s expectations that the ruling party will crash after President Buhari leaves office in 2023.\n“I know President Buhari today is directing what has to be done, so, Obasanjo was the same in PDP and when he left did it crash?\nSo, if Buhari leaves office, it wouldn’t crash."
  },
  {
    "headline": "FEC: Rail, road infrastructure in FCT to gulp N56bn – Minister",
    "summarized_story": "Efforts to boost public infrastructures in the nation’s capital, Abuja, may have received the blessing of the Federal Executive Council as it got an approval of N56.2billion for construction of a car park for the light rail project as well as access road linking Kuje.\nAt the meeting presided over by Vice President, Yemi Osinbajo, on Wednesday, they deliberated on the memo presented by the FCT Minister, Mohammed Bello, before voting for funds to enable full scope development of Federal Capital Territory Highway 105, Kuje Road, from Airport Expressway to Kuje Junction Stage 1, Abuja at the cost of N54,946,009,160.04.\nIn a similar vein, FEC approved the contract for the construction of an access road and a car park for Abuja Light Rail Stations – situated at Gbazango Station Kubwa, Abuja – Lot 7 at the cost of N1,291,568,845.33, respectively.\nThe Kuje road project was awarded to Messrs Arab Contractors O.\nA. O Nigeria Limited with a completion period of 48 months, while that of rail car park was awarded in favour of Messrs CBC Global Civil and Building Construction Nigeria Limited with a completion period of eight months."
  },
  {
    "headline": "Insecurity: Block escape routes of fleeing terrorists – Senate charges military",
    "summarized_story": "The Nigerian Senate has challenged the military and other security agencies to closely monitor and effectively block the escape routes being used by bandits and fleeing terrorists to forestall their relocation to safe havens in the country.\nAccording to him, “These bandits continuously attacked communities in Mariga LGA leading to massive internal displacement of many communities.\n“The bandits first attacked Tungan-Ruá village in the morning, later moved to Tungan Maje and also rustled cattle.\n“After several operations 17 persons were abducted including two persons delivering ransom.\nThe same day Farin Shinge village a few kilometres away from Kontagora town was also attacked and two persons kidnapped,” he stressed."
  },
  {
    "headline": "AfCON 2021: Keep winning, Buhari tells Super Eagles",
    "summarized_story": "President Muhammadu Buhari has charged the Super Eagles to sustain their winning streak in the ongoing African Cup of Nations (AfCON).\nHe said Nigerians expect them to bring the trophy back home.\n“President Muhammadu Buhari commends the Super Eagles of Nigeria for keeping hope alive in the ongoing Africa Cup of Nations (AFCON) in Cameroon by winning all their group matches and advancing to the second round of the tournament in grand style.\n- Advertisement -“President Buhari trusts that the positive reputation of good sportsmanship the traveling fans, sportswriters and the football team have demonstrated in Cameroon will continue to enliven the importance of sports, particularly football, as an enabler of development, peace, tolerance, friendship and cooperation.\n“The President wishes the Super Eagles the very best, pledging that his administration would continue to support the efforts of international, regional and national football organisations to use the sport as a tool to build a better and peaceful world,”the statement reads."
  },
  {
    "headline": "VIDEO: Kanu kisses a baby in court before trial resumes",
    "summarized_story": "This website uses cookies to improve your experience.\nWe'll assume you're ok with this, but you can opt-out if you wish.\nAccept Read More"
  },
  {
    "headline": "BREAKING: Nigeria beat Guinea Bissau 2-0",
    "summarized_story": "Nigeria defeated Guinea Bissau 2-0 in their Group D encounter at the Africa Cup of Nations on Wednesday in Garoua, Cameroon.\nSadiq Umar scored in the 56th minute with an assist from Kelechi Iheanacho to put Nigeria ahead.\nWilliam Troost-Ekong also scored Nigeria’s second goal against Guinea Bissau after a sensational dribble by Moses Simon.\nWinning today’s game, Nigeria is the only team that qualified to the last 16 round winning all group matches at the 33rd AFCON.\n- Advertisement -Details shortly …"
  },
  {
    "headline": "The Nigerian President of my dream",
    "summarized_story": "We are on the match again, we are looking for Mr President and, throughout this year, it is going to be politics all over.\nAspirants seeking to succeed President Muhammadu Buhari have started coming out, and more will come out as days become months.\nI want a President who will ensure no Nigerian feels left out because of which part of the country he or she comes from.\nI also want a President who will give us a Nigeria where our schools can compete with others in the advanced world.\nI do not want a President like Samusangudu in Adebayo Williams’ The Remains of the Last Emperor’."
  },
  {
    "headline": "BREAKING: Ajayi, Nwakali in vs Guinea Bissau",
    "summarized_story": "Super Eagles coach Augustine Eguaveon has given some starters rest in the last Group D match between the Super Eagles and Guinea Bissau.\nAmong them rested are goalkeeper Maduka Okoye; defender Kenneth Omeruo; winger Moses Simon and striker Taiwo Awoniyi.\nThe Super Eagles have already qualified for the Round of 16 at the ongoing AFCON 2021 in Cameroon.\nHere is the starting eleven vs Guinea Bissau:"
  },
  {
    "headline": "AFCON: Buhari hails emphatic progress of Super Eagles – The Sun Nigeria",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has hailed the Super Eagles of Nigeria for keeping hope alive in the ongoing Africa Cup of Nations (AFCON) in Cameroon by winning all their group matches and advancing to the second round of the tournament in grand style.\nThe President said he trusts that the positive reputation of good sportsmanship the traveling fans, sportswriters and the football team have demonstrated in Cameroon will continue to enliven the importance of sports, particularly football, as an enabler of development, peace, tolerance, friendship and cooperation.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nClick Here Now .\nBuhari wished the Super Eagles the very best, pledging that his administration would continue to support the efforts of international, regional and national football organisations to use the sport as a tool to build a better and peaceful world."
  },
  {
    "headline": "Kanu asks court to quash fresh terrorism charges, pleads not guilty",
    "summarized_story": "While attacking the competent of the charges, Kanu said he was innocent of all the allegations contained in the amended charge.\nHe further added through his lead counsel, Chief Mike Ozekhome (SAN), that some counts in the amended charge were similar.\nThe IPOB leader has consequently asked the court to quash the charges and set him free.\nBefore allowing Kanu to be re-arraigned, Justice Nyako reiterated her demand for Defendant to have a change of clothes.\nAs early as 6:00 am, a detachment of security personnel had been deployed around the court premises."
  },
  {
    "headline": "BREAKING: Court grants Nnamdi Kanu N1 billion damages against FG",
    "summarized_story": "From Okey Sampson, UmuahiaAn Abia High Court sitting in Umuahia and presided by Justice Benson Anya has awarded N1bn to the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, against the Federal Government over the infringement of his Fundamental Human Rights by the military.\nIn a judgment delivered Wednesday morning that last for an hour, Justice Anya said it was wrong for the military to have invaded his home in Afaraukwu, Umuahia on September 10, 2017, which made him flee the country.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nClick Here Now .\nThe court while delivering judgment, urged the Federal Government to apply a political solution to resolve the Nnamdi Kanu and IPOB problem."
  },
  {
    "headline": "Abia Court set to deliver judgment in Nnamdi Kanu vs FG today",
    "summarized_story": "From Okey Sampson, UmuahiaAll is now set for an Abia High Court sitting in Umuahia to deliver judgment in the Fundamental Human Rights suit instituted by the leader of IPOB, Nnamdi Kanu against the FG.\nAs early as 8 am when Daily Sun was at the High Court, all roads leading to the court premises were cordoned off by security operatives.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nSecurity is very tight, only lawyers, judiciary officials and journalists were allowed access to the court premises as vehicles that tried to make use of the High Court Road were diverted to other routes.\nSpecial Counsel to Nnamdi Kanu and the IPOB, Aloy Ejimakor is already in court with other lawyers awaiting the arrival of Justice Benson Anya, the presiding Judge."
  },
  {
    "headline": "Senate, Reps begin fresh work on Electoral Act Bill",
    "summarized_story": "From Fred Itua, Ndubuisi Orji and Juliana Taiwo-Obalonye, AbujaThe Senate and the House of Representatives, are expected to commence fresh work on the Electoral Act Amendment Bill, following its rejection by President Muhammadu Buhari last December.\n“By the grace of God, tomorrow (today), both chambers will pass the bill.\nAnd I hope that before the end of the week, the bill could be brought back to Mr. President for his assent.\n“And for us in the ninth assembly, the Electoral Act amendment bill is one of our major legislative agenda that we wanted to deal with.\nHe also complained about the humongous cost of conducting direct primaries by political parties and the Independent National Electoral Commission (INEC)."
  },
  {
    "headline": "Court Orders FG, Army to Pay N1bn Compensation, Tender Apology to Kanu over Invasion of His Home",
    "summarized_story": "The court also ordered the Federal Government to issue a written apology to the IPOB leader for violating his fundamental human rights and destroying his home during the military operation code named Python Dance II.\nHowever the Court declined jurisdiction over the issue of the abduction and extradition of the IPOB leader from Kenya, saying that such powers resides with the federal high court.\nThe separatist leader also asked the court to make “an order mandating and compelling the respondents to pay the sum of N5 billion to the applicant” as damages.\nBut Justice Anya said that in awarding N1billon to the applicant, the Court took cognisant of the “examplary and compensatory damages” done to the applicant by the respondents.\nCounsel to the Army, Mr. Amos Tori in his reaction to the judgment said that the army authorities would study the court verdict and respond appropriately."
  },
  {
    "headline": "I Will Clarify from Relevant Agencies FG’s Position on Fuel Subsidy Removal, Says Lai Mohammed",
    "summarized_story": "Deji Elumoye in AbujaThe Minister of Information and Culture, Alhaji Lai Mohammed, has said he will need to consult with relevant agencies to know the exact position of government on whether or not fuel subsidy will be stopped this year.\nWhen asked to clarity the issue since the 2022 budget has no subsidy provision beyond June 2022, the minister said he needed to consult with the relevant government agencies to determine the exact position of the subsidy removal question.\nShe had said: “In our 2022 budget, we only factored in subsidy for the first half of the year.\nBut he also conceded that subsidy was a big burden, noting that a solution had to be found to it.\n“Many of us are very concerned with the recent agitations, protests and many citizens were so concerned, our constituents across the country are very concerned that the federal government will remove the petroleum subsidy."
  },
  {
    "headline": "UPDATED: Electoral Bill: Senate Reverses Self, Okays Direct, Indirect, Consensus for Party Primaries",
    "summarized_story": "The red chamber at plenary on Wednesday, bowed to the request of the president and re-amended the Electoral Act (Amendment) Bill, passed on November 18, 2021.\nWhile the Senate approved the direct, indirect and consensus arrangements as the mode of party primaries, the House of Representatives expunged the option of consensus from the version it passed.\nThe Chairman of the Senate Committee on INEC, Senator Kabiru Gaya, told journalists after plenary that the bill would be transmitted to the president next week.\nThe Senate Leader, in his presentation, recalled that President Buhari had signified withholding his assent on the Electoral Act No.\n“The available options we have are: the direct primaries, indirect primaries and consensus candidature."
  },
  {
    "headline": "House Reworks Electoral Bill, Approves Direct, Indirect Primary for Parties",
    "summarized_story": "Udora Orizu in AbujaThe House of Representatives has approved direct and indirect primary clauses as a mode of electing candidates by political parties in elections.\nRecall that President Muhammadu Buhari withheld his assent to the bill transmitted to him by the National Assembly, citing the issues with direct primary provision.\nReconsidering the bill in the Committee of the Whole, the lawmakers unanimously adopted the amendments.\nDetails later…..Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Osinbajo Presides over FEC Meeting, as Cabinet Members Mourn Shonekan",
    "summarized_story": "Deji Elumoye in AbujaThe first meeting of the Federal Executive Council (FEC) in 2022 is about now holding at the State House, Abuja with Vice-President Yemi Osinbajo presiding.\nOsinbajo is standing in for President Muhammadu Buhari who left Abuja earlier today to attend the inauguration of President Adama Barrow in Banjul, the Gambian capital.\nThe FEC members before the commencement of the meeting signed a condolence register opened in honour of the late former Head of Interim National Government (ING), Chief Ernest Shonekan, placed at the entrance of the Banquet Hall, venue of the FEC meeting.\nThose attending the meeting include the Chief of Staff to the President, Prof Ibrahim Gambari and the Secretary to the Government of the Federation (SGF), Mr. Boss Mustapha.\nOther Ministers and the Head of the Civil Service of the Federation, Dr (Mrs) Folasade Esan, are attending the Council meeting virtually from their respective offices in Abuja."
  },
  {
    "headline": "COVID-19 Vaccine: CBN To Fund Nigerian Researchers, Science Institutions",
    "summarized_story": "The Central Bank of Nigeria says it is developing a framework under which grants and long term facilities will be provided to researchers, science institutions and biotechnology firms to develop COVID-19 vaccine.\nThe Governor of CBN, Godwin Emefiele, disclosed this at the unveiling of the THISDAY Dome Testing, Tracing and Treatment Centre, Abuja, on Tuesday.\nEmefiele said if Nigeria was to wait for foreign countries to develop their vaccines, it would be the last in the queue to receive curative remedies for the teeming population.\nHe said, “The CBN today challenges Nigerian scientists at home and in the Diaspora to go back to their laboratories and develop a Nigerian vaccine.\nOnce validated by the Health Authorities, the CBN will step in and do the needful for the sake of over 200 million Nigerians now confronted by COVID-19."
  },
  {
    "headline": "President Donald J. Trump’s Concession Speech, By Rudolf Okonkwo",
    "summarized_story": "The first time I ran for office, I ran for president.\nI have shown you that everything is possible if you have the right man to do the right job.\nThanks to me, they will grow up knowing that ours is a Christian nation where it is allowed to say Merry Christmas.\nTell those terrible lowlifes that they have proved themselves unworthy of Donald Trump’s genius and have opted to reduce America to a Second Class nation in the world.\nYours truly,President Donald J. TrumpThe 45th President of the United States."
  },
  {
    "headline": "Bandits Free Niger State Monarch After 45 Days In Captivity, N10million Ransom",
    "summarized_story": "The Dodo of Wawa community, Niger State, Dr Mahmoud Ahmed Aliyu, has been freed by his abductors after spending 45 days in their captivity.\nHe was said to have been released at about 7:30pm on Tuesday after the payment of N10million ransom to the bandits.\nThe Wazirin Wawa, Alhaji Ja’afar Ibrahim Bio, confirmed the release of the traditional ruler to Daily Trust, on the telephone but declined comment on how much was paid to secure his release.\nIn a video shared by his family, the traditional ruler was seen in a white turban being welcomed by his family and members of the palace.\nAliyu was abducted in his palace by heavily armed men around 9pm on September 4."
  },
  {
    "headline": "The Teflon President With Nine Lives Is On His Way Out By Dr. Wumi Akintide",
    "summarized_story": "The Teflon President with nine lives I have in mind is nobody else but Donald J. Trump.\nIn cahoots with Trump, Republicans have not ended their campaign of calumny to humiliate, blackmail and delegitimize Barack Obama, the first black President.\nThe one-term young Senator from Illinois was elected President in 2008 and re-elected again in 2012 with a wider margin.\nThe voters concluded he had told a lie even though he was one of the most honorable and dependable men of honor ever to serve as American President.\nThe list goes on and on without end but Donald Trump is still there despite an abysmal approval opinion of only 33 percent or less."
  },
  {
    "headline": "2023: I'll run for president if APC finds me fit, says Ayade",
    "summarized_story": "Ben Ayade, governor of Cross River, says he will run for president in 2023 if the All Progressives Congress (APC) considers him (APC).\nWhile responding to a question on whether he will run for president in 2023 on the platform of the APC, the governor said the party should make the decision based on zoning.\nBut when pressed further on the subject, the governor said he will contest if the party finds him “fit and proper”.\nAdvertisement“I think the party should take a decision based on zoning principles which would be resolved as a party,” Ayade said.\nIf the family (APC) finds that I am fit and proper, yes."
  },
  {
    "headline": "2023: I'll run for president if APC finds me fit, says Ayade",
    "summarized_story": "Ben Ayade, governor of Cross River, says he will run for president in 2023 if the All Progressives Congress (APC) considers him (APC).\nWhile responding to a question on whether he will run for president in 2023 on the platform of the APC, the governor said the party should make the decision based on zoning.\nBut when pressed further on the subject, the governor said he will contest if the party finds him “fit and proper”.\nAdvertisement“I think the party should take a decision based on zoning principles which would be resolved as a party,” Ayade said.\nIf the family (APC) finds that I am fit and proper, yes."
  },
  {
    "headline": "AFCON: Super Eagles beat Guinea Bissau to maintain perfect start",
    "summarized_story": "Super Eagles of Nigeria completed their Africa Cup of Nations (AFCON) Group D campaign with a 2-0 win over Guinea Bissau at Ominisports Roumde Adjia Stadium on Wednesday night.\nThe result ensured that the Super Eagles topped the group with nine points from three games.\nAnother foray coordinated by the Super Eagles saw Sadiq Umar setting up Ajayi but Fali Cande made a timely clearance.\nThe Super Eagles grabbed the curtain raiser through Umar after a lovely combination with Kelechi Iheanacho in the 55th minute.\nSuper Eagles top Group D with 9 points while Egypt came second with 6 points after defeating Sudan 1-0."
  },
  {
    "headline": "AFCON: Super Eagles beat Guinea Bissau to maintain perfect start",
    "summarized_story": "Super Eagles of Nigeria completed their Africa Cup of Nations (AFCON) Group D campaign with a 2-0 win over Guinea Bissau at Ominisports Roumde Adjia Stadium on Wednesday night.\nThe result ensured that the Super Eagles topped the group with nine points from three games.\nAnother foray coordinated by the Super Eagles saw Sadiq Umar setting up Ajayi but Fali Cande made a timely clearance.\nThe Super Eagles grabbed the curtain raiser through Umar after a lovely combination with Kelechi Iheanacho in the 55th minute.\nSuper Eagles top Group D with 9 points while Egypt came second with 6 points after defeating Sudan 1-0."
  },
  {
    "headline": "EFCC invites Ahmed Kuru, AMCON MD, over corruption allegations",
    "summarized_story": "The Economic and Financial Crimes Commission (EFCC) has invited Ahmed Kuru, managing director of the Assets Management Corporation of Nigeria (AMCON), for questioning.\nThe newspaper quoted a source at the EFCC to have claimed that Kuru was invited by the commission after confirmation of his selling assets worth billions of naira belonging to Atlantic.\nThe development comes months after Kuru began his second term in office as AMCON MD.\nAdvertisementMeanwhile, in July 2021, while attending the retreat of the senate committee on banking, Kuru had said AMCON recovered N1.48 trillion out of N4.158 trillion from bank debtors.\nHe had also said the agency still has 7,902 outstanding obligors with a total outstanding loan of above N3.1 trillion."
  },
  {
    "headline": "Topship goes from being an Instagram business to a YCombinator company",
    "summarized_story": "That’s an ambitious statement from a company that was operating only on Instagram just 18 months ago.\nBut how did an Instagram business pivot into becoming a tech startup and then get into YC, the world’s biggest accelerator programme with a 1.5% acceptance rate?\nSo, in June 2020, Enenwali started Topship as a one-man shop, opened an Instagram account and started helping people to move parcels locally.\nBut to be Africa’s Flexport, Topship had to be a full technology company, so Enenwali decided to build software that handles the end-to-end process.\nIt’s obvious Topship is really going all-in on its adoption of the Flexport model; it’s already a tech-enabled business and in YC, just like Flexport."
  },
  {
    "headline": "How Moni Africa leverages social trust to finance mobile money agents",
    "summarized_story": "Get the best African tech newsletters in your inboxFollowing a conversation in November 2020 with a cluster of mobile money agents in the Shapati community in Lekki-Ajah, Lagos, one thing was clear to Iromini: liquidity is a major challenge plaguing the mobile money ecosystem.\nThe startup instead leverages an algorithm developed around social trust and social underwriting that’s seen the platform achieve a highly impressive repayment rate.\nMoni Africa claims its revenue has grown 50% month-on-month so far and most of its agents, about 70% of which are women, have grown their businesses by 3x.\nIts 0.1% default rate, according to the CEO, can be attributed to the platform’s community-based model and interest rate which supports the unit economics of a mobile money agent.\nIn the long run, the startup plans to expand its community-finance model beyond mobile money agents to different SMEs across Africa."
  },
  {
    "headline": "What exactly is Web3?",
    "summarized_story": "This was historic as it helped filter out shams and highlight the real success stories, which laid the foundation for subsequent successful internet companies.\nWeb2 companies build sleek and revolutionary apps that become popular quickly, and as the app’s popularity increases, so does its user base.\nSince these web apps are controlled by a single internet company, users can only use them as long as the company wants them to.\n“Web3” was coined in 2014 by Gavin Wood, president and founder of Web3 Foundation, and he said then that it was going to be the next version of the internet.\nThat is why Nigerian crypto entrepreneur, Yele Bademosi, started out his Web3 development plan in Africa with Breach, a platform that uses newsletters, blog posts, quizzes, etc to teach Africans complex Web3 topics."
  },
  {
    "headline": "Nigeria’s new deal with Twitter is not a win for the government or citizens",
    "summarized_story": "Nigeria’s new deal with Twitter is its government’s most recent effort to control social media.\nAccording to Twitter’s Transparency Report—a report that gives insights into information and removal requests from around the world, by country—Nigeria has made zero removal requests and just 7 information requests, at the time of reporting.\nHowever, India has made 12,435 legal removal requests, 67 court orders, and 12,368 other legal demands, representing 6% of global removal requests.\nIn February last year, India’s government enacted a fresh social media rule that made social media companies like Facebook, WhatsApp, Twitter, and others more accountable to legal requests.\nBut Sesan says Nigeria’s internet restriction tactics are miles behind India’s because the latter drew up regulations; Twitter will only respond to legal requests backed by legislation."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there Been a while since I wrote one of these.\nI certainly hope the holidays were as restful for you as it was for..."
  },
  {
    "headline": "Techpoint Build Spotlight: Bitmama wants to help Africans create new meanings from crypto",
    "summarized_story": "This, largely, points to a growing trend of crypto trading in Africa, but crypto and blockchain promise so much more.\nBitmama, one of Africa’s foremost cryptocurrency exchanges, wants to foster a crypto culture in Africa that goes beyond trading.\nAhead of the exciting conversations at Techpoint Build on January 22, 2022, we caught up with Bitmama’s COO for a brief chat.\nWhat makes you excited about Techpoint Build 2021?\nWhat impact do you envisage following Techpoint Build conversations on the next frontier?"
  },
  {
    "headline": "Techpoint Build Spotlight: Tramango is helping Africans explore the world",
    "summarized_story": "Today on Techpoint Build Spotlight, we’re catching up with Akinnuga Ayobami, COO of Tramango, one of Africa’s innovators in the travel space and the official travel partner for Techpoint Build 2021.\nWhat makes Tramango excited about Techpoint Build 2021?\nTechpoint Build is helping African entrepreneurs showcase their ideas to the world and funding opportunities through Pitchstorm, the startup competition.\nAdvertisementWhat impact do you envisage following Techpoint Build conversations on the next frontier?\nGrab your ticket (physical or online) for Techpoint Build now."
  },
  {
    "headline": "Blockchain is hard, but Crevatal wants to make it easy",
    "summarized_story": "Share this article:The complexities that come with using blockchain or crypto platforms is one of the many reasons most people tend to stay away from it.\nOluchi Enebeli and Clement Hugbo, Co-founders of Crevatal, are combining years of experience in the blockchain space to simplify blockchain and foster mainstream adoption.\nThis, however, isn’t a problem for Crevatal as it doesn’t actively recruit ready-made blockchain talents.\nSide note: Web2 talents are tech talents that build Internet-based products for the current Internet iteration.\nCrevatal websiteInterestingly, the absence of Web3 and blockchain talents isn’t the only reason Crevatal has chosen to train its own talents."
  },
  {
    "headline": "Oil racing to $90 a barrel after explosion at crucial Iraqi pipeline",
    "summarized_story": "Oil is racing towards ninety dollars a barrel after extending gains in Asia Wednesday from the highest close since 2014 following an explosion at a key pipeline running from Iraq to Turkey.\nBrent, the internationally traded benchmark crude is at $88.69 after the disruption to the Iraqi oil movement took out crucial supply from an already tight market.\nFutures in New York rallied above $87 a barrel in early trading before paring some gains and is now trading at $86.68.\nThe fire has been brought under control but the cause of the blast remains unknown, pipeline operator Botas said.\nThe global oil market has tightened in recent weeks due to outages in OPEC+ producers including Libya, with buyers in Asia paying sharply higher premiums for spot cargoes."
  },
  {
    "headline": "10 years after protest, over $60bn on subsidy, no change",
    "summarized_story": "Ten years after the #OccupyNigeria protest against petrol subsidy removal, the Nigerian government has only abolished it on paper.\nLast year alone, Nigeria spent $4.5 billion on petrol subsidy, according to the World Bank, and during the subsidy scandal in 2011, Nigeria spent $6.8 billion on subsidy.\nRather than eliminate the subsidy, the government succeeded in increasing the petrol price from N65 to N141 per litre.\nLogic failsAs was true in 2012, petrol subsidy was a drain on the country.\nRead also: Group plans protest against petrol subsidy removal, excise duty on soft drinksNigeria with highly-rated security agencies cannot curtail smuggling, and though petrol is imported, government charges at the port add to the cost per litre."
  },
  {
    "headline": "China, India freight cost declines as container scarcity abates",
    "summarized_story": "Currently, moving a 20-foot and 40-foot container from India to Nigeria now costs between $4,000 and $7,000, down from between $7,500 and $15,000 previously charged by shipping companies in September 2021.\nFrom China, moving a 20-foot and 40-foot container to Nigeria now costs between $7,000 and $11,000 instead of $8,000 and $16,000 that were charged in September 2021, when the cost of freight was at a record high.\nConfirming this, Tony Anakebe, managing director of Gold-Link Investment Limited, states that importers are beginning to see a reduction in the cost of freight from countries like India and China to Nigeria.\nAccording to Anakebe, moving 20-foot and 40-foot containers from India to Nigeria that used to cost between $7,500 and $15,000 now costs a little above $4,000 and $7,000, respectively.\nIt states that the current freight cost in China can be attributed to the COVID-19 variant, the changing purchasing patterns, the Chinese New Year that is around the corner, and the restocking of supplies that followed due to the rising number of COVID-19 cases in China."
  },
  {
    "headline": "Tipper drivers protest killing of colleague by security personnel in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – Angry tipper drivers protested the killing of their colleague by security personnel alleged to be operative of the Department of State Services (DSS) in Benin City.\n“And before a blink of eye, the DSS operatives opened fire which resulted in the death of a tipper driver.\nThe development caused heavy gridlock in the Benin metropolis as other drivers protested the death of their colleague.\nThe source said the hoodlums, upon sighting the DSS operatives, pounced on them with guns and various dangerous weapons.\nThe DSS source said its operatives sustained varying degrees of injuries during the attack while their vehicles were also damaged."
  },
  {
    "headline": "Diaspora group lite up Edo community – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUDU – As part of efforts to contribute to the development of Abudu, a group under the aegis of Abudu in Diaspora Group has commenced installation of about 250 solar streetlights in the community.\n“We (Abudu in diaspora group) are responsible for the Abudu lighting up project; our motive was to help our people back home at Abudu.\n“When we use to stay in Abudu, people come from outside the state to come and stay in Abudu.\nWe have other projects, and we hope at least we should be able to do one project every year in the community.\nthe solar streetlights project is just a starting point for things to come”."
  },
  {
    "headline": "Nation Blue Economy: Vice President Seeks Stakeholders Participation, Inaugurates Expanded Committee – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Vice President, Prof Yemi Osinbajo has sought for wider participation of relevant stakeholders in the blue economy project to deepen participation and benefits of Nigerians from the country’s marine resources.\nOsinbajo made the call at the inaugural meeting of an Expanded Committee on Sustainable Blue Economy in Nigeria in the Presidential Villa recently.\nAccording to him, a viable blue economy project will offer vista of opportunities not only for littoral states where there are bodies of waters but for the entire country.\n“Countries have to define the scope of their blue economy based on their priorities.\nIn his opening remark, Transportation Minister, Rotimi Amaechi said the blue economy is capable of improving government revenue, create employments and grow the gross domestic product of Nigeria."
  },
  {
    "headline": "2023 Presidency: I’m capable but not desperate to lead Nigeria – Orji Kalu – Nigerian Observer",
    "summarized_story": "Kalu stressed that his visit to President Buhari was a usual one adding that their relationship has spanned for years before he became President.\nI have said before that there are only two zones that have not been President : the Southeast and the Northeast.\n“It’s overdue for an Igboman to become a Nigerian President, I believe the Southeast should produce the next President and it’s going to happen ”.\nWhen asked about President Buhari’s body language to the contentious electoral act and 2023 Kalu responded saying “He’s body language is where other Nigerians are .\nThe Governor of Ebonyi State, Dave Umahi had also met with Buhari to declare his ambition to take over from him in 2023."
  },
  {
    "headline": "Good governance key to sustainable development – Oyetola",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State governor, Adegboyega Oyetola, has said that good governance is key to sustainable socioeconomic development in every polity.\nOyetola said this during an engagement programme organised by the State’s Civic Engagement Centre on Wednesday at Eti-Oni Asalu, Oriade South LCDA.\nHe noted that his administration would continue to uphold the pace of good governance in both ideas and principles, especially in the area of infrastructural and human capital development.\nThe governor said that the importance of good governance, consistency of policies, reforms and sustainable economic growth could not be overemphasized in achieving a virile polity to positively impacts the masses.\nHe said, “the current administration has equally recorded a plethora of giant strides and achievements in critical sectors such as infrastructure, health, security, education, social welfarism among others."
  },
  {
    "headline": "Ebonyi guber aspirant, Nwonu promises human capital devt, scholarships, others",
    "summarized_story": "A member of the House of Representatives and a leading aspirant for Ebonyi State governorship ticket on the platform of the People’s Democratic Party, Rt.\nAnayo Edwin Nwonu, has promised to pursue human capital development if he is elected into office as governor in 2023.\nThe lawmaker who spoke to journalists in Abakaliki, the Ebonyi State capital on Tuesday, stated that his developmental priorities would include the restoration of scholarships for Ebonyi Youths, revamping of the Education Sector, improvement in the healthcare delivery system and a full return to a functional and effective local government system in the state.\nOther priorities of his administration, according to him, include the restoration of the statutory rights and benefits of civil servants and local government staff, restoration of civil service ethics, conducive environment for enterpreneurship, mechanized agriculture and mass employment for Ebonyi Youths.\nNwonu expressed confidence that Nigeria will return to the part of progress if his party, the PDP, returns to power at the federal level in 2023, that democracy in the country would experience a major boost when the party takes over the reigns of power in Aso Rock."
  },
  {
    "headline": "Tinubu promises to pay WAEC fee of every student as president",
    "summarized_story": "Former Lagos State governor, Bola Ahmed Tinubu, has promised to pay the West African Senior School Certificate Examination (WAEC) fee for every Nigerian student if he is elected president of the country in 2023.\nTinubu made the statement while receiving well-wishers who paid him courtesy visit as captured in video circulating online.\n“Your children’s West African examination fees will be paid by us, so that no one, no matter how poor, will be left behind,” he said.\nThe symbol of my cap is breaking shackles.\nYou break the shackles of ignorance, poverty, and many things.”"
  },
  {
    "headline": "Out of cash: Nigerian banks borrow N9.17tn from CBN in seven months",
    "summarized_story": "Commercial and merchant banks in Nigeria borrowed the sum of N9.17 trillion from the Central Bank of Nigeria (CBN) through its Standing Lending Facility (SLF) window within a period of seven months.\nLenders also access the CBN’s Standing Deposit Facility window to deposit their excess cash or reserves.\nThe apex bank’s report further showed that banks borrowed N503.69bn in October.\nAccording to the apex bank, lending activity dominated at the standing facility window, reflecting liquidity constraints in the segment in October.\nIt added that in October, “Standing Lending Facility during the month was N503.69bn (comprising N337.78bn direct SLF and N165.92bn Intra-day Lending Facility converted to overnight SLF."
  },
  {
    "headline": "2023 Presidency: Group Dumps Atiku For Saraki",
    "summarized_story": "Atiku Ambassadors, a defunct pro-Atiku Abubakar support group, has pledged its total support for former Senate President, Dr. Bukola Saraki, in the 2023 presidential race.\nLeader of the group, Mufra Jibrin, disclosed this on Tuesday when he led a delegation to the national coordinator of ‘Saraki Is Coming Door To Door’ organisation, Umar Faringado Kazaure, at his residence in Abuja.\nJibrin, a Kafanchan-born businessman, said his former group has now merged with ‘Saraki Is Coming Door To Door’ organisation for the realisation of Dr. Saraki’s presidential ambition in 2023.\nIt’s now the turn of a much younger, energetic and experienced candidate in the person of Saraki, to become Nigeria’s next president in 2023.\nResponding, Faringado welcomed members of the defunct Atiku Ambassadors to the Saraki support group, saying like-minds particularly young Nigerians like them were critical to salvaging the country from its current challenges."
  },
  {
    "headline": "Declare Full Scale War Against Terrorists, Senate Tells Federal Govt",
    "summarized_story": "The Senate has called on the Federal Government to, as a matter of urgency, declare full fledged war against elements involved in terrorist activities in the country.\nAccording to the Senate, doing so would also safeguard the Shiroro Hydro-electric Power Dam, a National Asset located within the area.\nADVERTISEMENTThe motion was sponsored by Senator Mohammed Sani Musa (Niger East) and co-sponsored by Senator Sadiq Suleiman Umar (Kwara North).\nAccording to the lawmaker, on Friday 14th January, 2022, five vigilante members were killed in an attack on a local market and some communities in Shiroro Local Government Area of Niger State.\nThe chamber urged the National Emergency Management Agency (NEMA) to provide relief materials and medical team to the victims immediately."
  },
  {
    "headline": "Visa Brings Digital Payments To AFCON 2021 In Cameroon",
    "summarized_story": "Visa, the exclusive digital payment service provider of the TotalEnergies Africa Cup of Nations (AFCON) 2021, is marking this year’s competition in Cameroon by creating new one-of-a-kind experiences for cardholders and football fans and looking to further help expand access to the financial system in Africa.\n“Visa is committed to enhancing the fan experience at sporting venues around the world and AFCON is no exception,” said Kemi Okusanya, Vice President, Visa West Africa.\nWe are thrilled to offer Nigerians a unique opportunity to enjoy all the excitement of AFCON, and to be the exclusive payments provider at this exciting tournament,” Okusanya further stated.\nVisa began its partnership with the Confédération Africaine de Football (CAF) in 2018 to provide support for the AFCON tournament in 2019 and 2021.\nVisa is the exclusive digital payment provider at all venues during the football tournament and the preferred payment option for tickets bought both in-person and online."
  },
  {
    "headline": "Visa Brings Digital Payments To AFCON 2021 In Cameroon",
    "summarized_story": "Visa, the exclusive digital payment service provider of the TotalEnergies Africa Cup of Nations (AFCON) 2021, is marking this year’s competition in Cameroon by creating new one-of-a-kind experiences for cardholders and football fans and looking to further help expand access to the financial system in Africa.\n“Visa is committed to enhancing the fan experience at sporting venues around the world and AFCON is no exception,” said Kemi Okusanya, Vice President, Visa West Africa.\nWe are thrilled to offer Nigerians a unique opportunity to enjoy all the excitement of AFCON, and to be the exclusive payments provider at this exciting tournament,” Okusanya further stated.\nVisa began its partnership with the Confédération Africaine de Football (CAF) in 2018 to provide support for the AFCON tournament in 2019 and 2021.\nVisa is the exclusive digital payment provider at all venues during the football tournament and the preferred payment option for tickets bought both in-person and online."
  },
  {
    "headline": "Why Many Political Elites Want Buhari’s Tenure To End – Presidency",
    "summarized_story": "The presidency has explained reasons why so many political elites want President Muhammadu Buhari’s second term in office to end.\nPresidential spokesman, Garba Shehu, in a statement on Tuesday, said the elites yearn for a return to the “good old days” of helping themselves to public funds with abandon.\nAccording to him, the last thing they want is another person in the mould of President Buhari.\nHe said, “So many in the political elites of this country cannot wait for the President’s second term in office to end.\nInstead, they have witnessed how, when the state owes to them nothing, it provides for the people,” he added."
  },
  {
    "headline": "Breaking: Dominant Eagles thrash Guinea Bissau to finish group top",
    "summarized_story": "The Super Eagles of Nigeria thrashed Guinea Bissau 2-0 on Wednesday to claim maximum nine points to top Group D at the ongoing AFCON in Cameroon.\nAfter a barren first half, the Eagles opened scoring on 56 minutes through Umar Sadiq .\nIt was a well deserved goal as the Nigerian side had dominated play from the beginning of the match.\nWilliam Troost-Ekong doubled Nigeria’s lead, tapping home from almost on the goal line after a lucky rebound fell at his feet.\nThe Egypt came second with six points after beating Sudan 1-0 in the other game of Group D."
  },
  {
    "headline": "Residents hail Kwara Govt over 33km Ilesha-Baruba road",
    "summarized_story": "Residents and commuters plying the 33km Ilesha Baruba-Gwanara road in Baruten local government area of Kwara State have commended Governor AbdulRahman AbdulRazaq on the ongoing construction of the road.\nHe added: “The experience navigating through this road in the past had been terrible.\n“The road was abandoned and the new government is trying for us and we are praising it for that.\nSo many economic activities will spring once the road is fully done, and we have started seeing that,” he said.\nThis is because the road is good now as a large portion has been tarred while other sections have been cleared."
  },
  {
    "headline": "Nigerians Bash Tinubu For Promising To Pay Students’ WAEC Fees",
    "summarized_story": "Some Nigerians on social media have bashed Bola Ahmed Tinubu, National Leader of the All Progressives Congress (APC), after he was seen in a video promising to pay the West African Examination Council (WAEC) fees of Nigerian students.\nTinubu, who last week revealed his ambition to run for president in the 2023 election, said his party will crush poverty and make lives easier for Nigerians.\nHowever, his promise has sparked outrage among Nigerians who aired their opinion Wednesday on Facebook.\n“In this century a Presidential aspirant talking of paying WAEC fees.\nInsecurities, inflation and nepotism are more important than WAEC fees sir."
  },
  {
    "headline": "2023: I’m Competent But Not Desperate To Lead Nigeria — Orji Kalu",
    "summarized_story": "Senator Orji Uzor Kalu, the Senate’s Chief Whip, has stated that he is capable but not desperate to become President of Nigeria in 2023.\nThis came as he bemoaned the fact that the country’s future president should have come from the country’s South-East area.\nI have said before that there are only two zones that have not been President -the South-East and the North-East.\nIf they zone it to the Southeast, I have all it takes to make a good President,” Kalu said.\nThe Governor of Ebonyi State, Dave Umahi, met with Buhari the next day to launch his candidacy for the presidency."
  },
  {
    "headline": "BREAKING: Court Dismisses Suit Challenging Twitter Operations In Nigeria",
    "summarized_story": "On Wednesday, the Federal High Court in Abuja dismissed a complaint filed by Adamu Garba, a former Presidential candidate, challenging Twitter’s operations in Nigeria.\nThe verdict was handed down by Justice Abubakar, according to the Socio-economic Rights and Accountability Project’s verified Twitter account.\nDuring the #EndSARS protests in 2020, Garba, a businessman and former senator, requested the court to prohibit Twitter from operating in any region of Nigeria.\nIn a tweet on Wednesday, SERAP said, “BREAKING: Following application by SERAP, Justice Abubakar of the Federal High Court (Court 5), Abuja today struck out the suit by Mr Adamu Garba, APC member, seeking to stop Twitter from operating within the Nigerian cyberspace.\n“Mr Adamu filed the suit in 2020.”BREAKING: Following application by SERAP, Justice Abubakar of the Federal High Court (Court 5), Abuja today struck out the suit by Mr Adamu Garba, APC member, seeking to \"stop Twitter from operating within the Nigerian cyberspace.\""
  },
  {
    "headline": "“Pay Nnamdi Kanu N1bn Damages Now,” HURIWA Tells FG",
    "summarized_story": "Human Rights Writers Association of Nigeria, a civil rights advocacy group, demanded on Wednesday that the Federal Government apologize to Nnamdi Kanu and pay him the N1 billion damages ordered to him by an Abia State High Court.\nKanu had gone to court demanding N5 billion for the military’s assault of his father’s residence on September 10, 2017.\nReacting, HURIWA said it “strongly endorses the decision of the Hon judge of the Abia State High Court in Umuahia which today directed the Federal Government to pay a sum of N1bn to Mazi Nnamdi Kanu”.\n“HURIWA supports the order for Government to tender an apology to Nnamdi Kanu.\nBut those who are saying that he should be released, no, we cannot release him (Kanu),” the President had said."
  },
  {
    "headline": "Electoral Act Amendment Bill: CSOs slam Senate’s consensus option, Bill remains in limbo",
    "summarized_story": "Political parties are left with whichever options they prefer according to their realities.\nMany of those in power and can engineer a consensus, want indirect primaries while those out of power or the corridors hope for some luck with direct primaries.\n“I know an ex-governor who favoured indirect primaries while in power, but now campaigns for direct primaries.\nThose who argue that direct primaries would be too expensive have not told Nigerians why and what is considered too expensive.\n“For instance, how much did direct party primaries cost in the Lagos State gubernatorial primaries viz-a-vis indirect primaries in many states?"
  },
  {
    "headline": "We’re deploying drones, other technologies to tackle insecurity – IGP",
    "summarized_story": "Baba said: “Crime and criminality is a dynamic thing; it is not something that is static.\nWe have acquired drones, we have digitalised our crime section, we have involved a lot of technology in our works,” the IGP said.\nIn his remarks, the state Commissioner of Police, Andrew Amiengheme, lauded the IGP for his result-oriented policies which are in line with global best practices.\nAmiengheme commended the collaboration between the Nigeria Police and the support of the state government in fighting crime and prevention in the state.\n“Concerned that these bandits continuously attacked communities in Mariga LGA leading to massive internal displacement of many communities."
  },
  {
    "headline": "[Breaking] AFCON 2021: Sadiq Umar, Troost-Ekong score as Super Eagles blow away Guinea Bissau, top group D",
    "summarized_story": "Striker Sadiq Umar and captain Willian Troost-Ekong scored two goals against Guinea Bissau on Wednesday night to guarantee that Super Eagles won all their group D matches in the ongoing Africa Cup of Nations in Cameroon.\nThe Nigerian team is actually the first to have won all group games in the tournament.\nCoach Austin Eguavoen-tutored side had beaten Egypt and Sudan.\nDetails loading…"
  },
  {
    "headline": "Electoral Act Amendment: NASS Re-Amends Bill, Allows Direct And Indirect Primaries",
    "summarized_story": "The National Assembly has re-amended the Electoral Act Amendment Bill on Wednesday and approved both direct and indirect primaries.\nIn December, President Buhari had written to the National Assembly, informing them of his decision to decline assent to the Electoral Act Amendment Bill.\nIn the letter, the Nigerian leader had cited the direct primaries clause as a major reason for his decision.\nThe Nasarawa State leader told Channels Television Sunday Politics that the governors are not against direct primaries.\n“The Electoral Act is far more than just direct or indirect."
  },
  {
    "headline": "UPDATED: Nigeria Beat Guinea-Bissau, Become First Team To Claim Nine Points",
    "summarized_story": "The Super Eagles continued their winning run at the 2021 Africa Cup of Nations (AFCON) on Wednesday with another victory over Guinea-Bissau.\nJust like the encounter with Egypt and Sudan, Nigeria displayed a brilliant performance to outclass their West African counterparts 2-0 amid excitement and cheers from supporters.\nThey maintained a dominant form to end their group campaign, winning all nine points from three matches – the first team to record such feat in the ongoing tournament.\nAlthough the ball hit the bar, captain William Troost-Ekong proved the ability to lead the team by coming to the Eagles’ rescue.\nBut Nigeria were not sure if they had extended the lead until the Video Assistant Referee confirmed a second goal."
  },
  {
    "headline": "13 Civil Groups Reject Senate’s Inclusion Of Consensus Option In Electoral Bill",
    "summarized_story": "Thirteen Civil Society groups have rejected the introduction of consensus as a mode for the nomination of candidates seeking election into public offices in the Electoral Act Amendment Bill.\nThe groups faulted the action of the Senate in a statement jointly signed by them on Wednesday, hours after the lawmakers modified the proposed amendments to the Electoral Act.\n“We reject the decision of the Senate to introduce a completely new mode of “consensus” as a procedure for candidates’ nomination,” the statement read.\n“The consensus mode is antithetical to democratic principles and will result in the subversion of popular will.\n“At today’s plenary, the Senate and House of Representatives recommitted the Electoral Bill 2021 with the proposed amendment to Clause 84 dealing with the nomination of candidates."
  },
  {
    "headline": "Lagos Govt Acquires Two New High-Speed Trains",
    "summarized_story": "The Lagos State government has acquired two new high-speed trains for its Red Line rail project, as part of efforts to improve traffic management and transportation.\nWe have seen our beautiful white and red trains.\nCoincidentally, the rail line is called Red Line and you can see they have given us the colour.\nThe acting Milwaukee Mayor, Cavalier Johnson, who received Governor Sanwo-Olu in the city, said “It is a little bittersweet.\nGovernor Sanwo-Olu was accompanied by the Lagos State Commissioner for Transportation, Dr Frederic Oladeinde; his Special Adviser on Works, Aramide Adeyoye, and Managing Director of Lagos Metropolitan Area Transport Authority (LAMATA), Abimbola Akinajo."
  },
  {
    "headline": "Buhari Should Waste No Time To Sign Amended Electoral Bill, Says Fayose",
    "summarized_story": "Former Governor of Ekiti State, Ayodele Fayose, has called on President Muhammadu Buhari to swiftly sign the Electoral Act Amendment Bill.\nHe made the call on Wednesday during an interview on Channels Television’s Politics Today, about a month after President Buhari declined assent to the bill over the direct primaries clause.\n“Now that the National Assembly has done the right thing, he (Buhari) should waste no time at assenting to the bill and let the process have enough time to adjust,” the former governor said.\nIn his reaction, Fayose believes President Buhari is fond of giving excuses for refusing to sign bills passed by lawmakers.\nAway from the electoral bill, Fayose also spoke about the 2023 general elections and the preparations of the Peoples Democratic Party (PDP) for the contest."
  },
  {
    "headline": "Asiwaju Tinubu charges Nigerians to collect PVC's",
    "summarized_story": "National leader of the APC, Asiwaju Bola Tinubu received APC women leaders across the country including the Federal Capital territory where he charged them to unite and go all out to collect their PVCs for them to be able to exercise their civic right during the forthcoming election.\nThe women say the visit was to affirm their support for Bola Tinubu’s 2023 Presidential ambition."
  },
  {
    "headline": "APC Sets February 26th for its National Convention -",
    "summarized_story": "Nigeria’s governing party, the All Progressives Congress, has set 26th of February as the date to hold it’s National Convention.\nThe National Chairman of the APC Caretaker Extraordinary Convention Planning Committee, Governor Mai Mala Buni stated this in his speech at the Progressives Women’s Conference holding Abuja, Nigeria."
  },
  {
    "headline": "Wrong version of Electoral Act Amendment bill sent to President Buhari",
    "summarized_story": "The House of Representatives will re-introduce the Electoral Act Amendment Bill at Wednesday plenary.\nSpeaker of the House, Femi Gbajabiamila, made this known as he welcomed his colleagues to 2022 legislative business.\nThe Speaker also expressed concerns about the errors purported to be in the Bill sent to Mr. President for assent, insisting a different version might have been transmitted.\nHe assured Nigerians the Constitution Amendment Bill would be ready for the concurrence of the States Houses of Assembly before end of February."
  },
  {
    "headline": "Aggrieved PDP Governorship aspirants protest in Ado Ekiti -",
    "summarized_story": "PDP Governorship Aspirants,Biodun Olujimi and Segun Oni Leads Protest Against Former Governor Ayodele Fayose Accusing him of Hijacking the Ward Congress Held on Saturday 15th January 2022.\nSome Party Faithfuls Joined the Protest this morning calling for the indefinite Suspension of Fayose from the PDP.\nThe Party Leaders accused Fayose of Sabotaging the Efforts of the Party by collating Ward Excos at a Private Event Center Owned by Him while the real Congress was ongoing in the 177 Wards of the State.\nThey Therefore Urged the National Working Committee to disregard any Purported List sent by Ayodele Fayose to the Party Secretariat in Abuja as they declared that there is no Congress Held in the State."
  },
  {
    "headline": "Kanu Granted Change Of Clothes After Allegedly Denied By DSS – Trending With Ojy Okpe",
    "summarized_story": "Madu, who was appointed a Justice minister in August 2020, was pulled over on March 10th 2021and fined $300 dollars for allegedly flouting the country’s traffic and safety regulations.\nLead counsel to Kanu, Mike Ozekhome objected to his client taking a plea on the amended charge and asked the court for an adjournment.\nThe Ipob leader arrived at the proceeding in the same Fendi outfit he wore when he was rearraigned in October.\nThe judge Binta Nyako again ordered the Department of State Services to allow Kanu a change of clothing.\nPreviously, she had directed the DSS to allow the IPOB leader to have a bath, change his clothes, eat properly and practice his faith."
  },
  {
    "headline": "CBN Spends 1 Trillion Naira On Farmers",
    "summarized_story": "Nigeria will soon commence the export of rice.\nThis was announced at the unveiling of the largest rice pyramids in Nigeria’s history.\nArise Correspondent Amaka Udeh, tells us more."
  },
  {
    "headline": "UK PM Johnson Faces Plot to Trigger Leadership Challenge",
    "summarized_story": "Propelled into the top job to “get Brexit done”, Johnson in 2019 won his party’s biggest majority in more than 30 years but now faces calls to resign after a series of revelations about gatherings in Downing Street during COVID lockdowns.\nTo trigger a leadership challenge, 54 of the 360 Conservative MPs in parliament must write letters of no confidence to the chairman of the party’s 1922 Committee.\nAs many as 20 Conservative lawmakers who won their seats at the last general election in 2019 plan to submit letters of no confidence in Johnson, the Telegraph reported.\n“Group of 2019 MPs to submit letters to try to hit threshold of 54 to trigger a contest,” BBC Political Editor Laura Kuenssberg said.\n“They might hit 54.”An analysis by The Times newspaper showed that 58 Conservative lawmakers had criticised the prime minister."
  },
  {
    "headline": "Airlines Worldwide Rush to Change Flights Over US 5G Dispute",
    "summarized_story": "Airlines across the world, including the long-haul carrier Emirates, rushed Wednesday to cancel or change flights heading into the U.S. over an ongoing dispute about the rollout of 5G mobile phone technology near American airports.\nTwo Japanese airlines directly named the aircraft as being particularly affected by the 5G signals as they announced cancellations and changes to their schedules.\nBut in the U.S., the Federal Aviation Administration worries that the C-Band strand of 5G could interfere with aviation equipment.\nOf particular concern in the 5G rollout appears to be the Boeing 777, a major workhorse for Emirates.\nAir India also announced on Twitter it would cancel flights to Chicago, Newark, New York and San Francisco “due to deployment of the 5G communications” equipment."
  },
  {
    "headline": "New York AG Says Trump’s Company Misled Banks, Tax Officials",
    "summarized_story": "The New York attorney general’s office late Tuesday told a court its investigators had uncovered evidence that former President Donald Trump’s company used “fraudulent or misleading” asset valuations to get loans and tax benefits.\nThe Trump Organization, it said, had overstated the value of land donations made in New York and California on paperwork submitted to the IRS to justify several million dollars in tax deductions.\nOne judge has previously sided with James on an earlier request to question another Trump son, Trump Organization executive Eric Trump, who ultimately sat for a deposition but declined to answer some questions.\nLast year, the Manhattan district attorney brought tax fraud charges against the Trump Organization and Weisselberg, its longtime chief financial officer.\nWeisselberg pleaded not guilty to charges alleging he and the company evaded taxes on lucrative fringe benefits paid to executives."
  }
]