[
  {
    "headline": "Avuru responds to appointment termination at Seplat",
    "summarized_story": "Austin Avuru, the Non-Executive Director of Seplat Energy has advised the public to discredit the alleged termination of his appointment.\nThe Director, External Affairs & Sustainability of Seplat, had earlier in the letter titled “Change on the Board of Seplat Energy” noted had that the company had terminated the appointment of Austin Avuru as a Non-ExecutiveDirector, due to alleged breaches made by Avuru.\nFor Seplat, his actions contravene the company’s”corporate governance policies and fiduciary duties”.The letter also called for Avuru’s resignation as well.\nIn response to the termination letter, Avuru’s legal representative,Perchstone and Graeys, stated in a letter, “Re: Change on the Board of Seplat Energy Plc.\n– Mr. Austin Avuru,” that the decision of the Seplat Board was “ill-advised”, “grossly mischievous” and “fictitious”."
  },
  {
    "headline": "Christmas: Lawan urges Nigerians to show love, pray for peace",
    "summarized_story": "As Christians around the world celebrate Christmas, the President of the Senate, Ahmad Lawan, enjoined Nigerians to reflect on the significance of the season.\nHe said beyond the great merriment and thanksgiving joy associated with the season, Christmas reminds mankind of the humble birth, simple life, teachings and sacrificial love of Jesus Christ.\nThe Senate President urged Nigerians to engage only in activities that enhance peace and harmony in their immediate environment and beyond, in the true spirit of the season.\n“Let us all continue to pray for peace in Nigeria and engage only in things that will make Nigeria the great country that we desire it to be.\n“The current challenges require the continued cooperation, support and understanding of all Nigerians for the government to succeed."
  },
  {
    "headline": "NBTE inspects HIN as NAHCON gets FEC’s nod on PPP",
    "summarized_story": "The exercise was among the processes of granting approval for the licensing of new institutions such as the Hajj Institute of Nigeria (HIN), to be so-called based on the recommendation of the delegation.\nThe most important vision of the HIN, he re-echoed was to educate Hajj managers with rudimentary knowledge to make operations more successful.\nIt was gathered that goodwill messages and accolades from stakeholders across the country greeted the announcement of the approval by the NAHCON chairman.\nWith this approval, NAHCON is on course to develop its properties into money-making ventures, dividends of which will strengthen the commitment to depend less on the federal government for funding.\nThe venture is expected to generate surplus revenue for NAHCON and the federal government as well."
  },
  {
    "headline": "Sanwo-Olu declares free BRT ride on Xmas, New Year days to residents",
    "summarized_story": "By Olasunkanmi AkoniLagos State Governor, Babajide Sanwo-Olu has approved free ride on Bus Rapid Transit, BRT, corridors on Christmas and New Year days to residents.\nFree bus commuter services would be offered to residents on the Ikorodu to TBS, Oshodi to Abule Egba and Lagos Badagry Expressway BRT corridors on both days.\nAbimbola Akinajo, through Assistant Director, Corporate Communication, Kolawole Ojelabi, stated that the free commuter bus services were being offered to residents in the spirit of joy, love and peace which the season of Christmas signifies.\n“The Governor has given his promise for the commencement of passenger operations on the first two phases of the state’s rail lines – Blue and Red line.\nHe has demonstrated this commitment to the completion of both rail lines by sourcing funds for their completion and provision of rolling stock."
  },
  {
    "headline": "Opinion: Treating Christmas with respect",
    "summarized_story": "Muslims have to remember that for practising Christians, Christmas really is about Jesus.\nHe says in the Quran: “And insult not those whom they (disbelievers) worship besides God, lest they insult God wrongfully without knowledge.\nSay: ‘We believe in what has been sent down to us and what has been sent down to you.\nOur God and your God is [the same] One, and we are Muslims before Him’” (Quran, 29:46).\nYou have freedom of religion given by God to believe in what you believe in."
  },
  {
    "headline": "Alimosho: Fire service calls for calm",
    "summarized_story": "Rrescue operation is currently on going to put out the fire resulting from a System 2B pipeline leakage at Peace Estate, Zone 4, Baruwa, Ipaja, Alimosho area of Lagos State.\nThe fire call which was reported at 00:31 hours Christmas Eve, is presently confined to be burning at the source of leakage of the pipeline belonging to the Nigerian National Petroleum Corporation, NNPC.\nThe state fire service boss, Adeseye Margaret, assured the residents of the area that the strategy being deployed to control the burning rage with copious water and chemical foam compound would not allow it to affect any nearby property or life which are over 200 metres away.\nConsequently, members of the public have been advised to go about their legitimate activities without any fear as it will take a while for the remains of the petroleum products to dry up in the pipeline.\nAlthough the cause of the leakage as of press time could not be ascertained, “officials of Lagos State Fire and Rescue Service remain on top of the situation and will provide necessary updates as situation demands, ” Margret assuredVanguard News Nigeria"
  },
  {
    "headline": "Christians warned against influences that undermine Biblical moral standards",
    "summarized_story": "By Sam Eyoboka – WarriActing President of God’s Kingdom Society, GKS, The Church of the Living God, Felix Adedokun, has charged Christians to avoid those elements in science, education and the mass media that do not promote godliness but serve to undermine belief in God and Biblical moral standards and values.\nAccording to the Publicity Secretary, Brother Benedict Hart, the GKS leader reminded his audience that the natural Israelites faced such challenges in time of old and yielded to the low moral standards, debased practices and vain philosophies of rival nations who were worshipping the devil and thereby provoked God to anger.\nStating that everyone on earth today must decide whether he wants to be on the side of God or the devil, Brother Adedokun asserted that those on the Lord’s side should live godly lives and must avoid the sin of covetousness which Apostle Paul says is idolatry – thereby showing themselves to be “a peculiar people, zealous of good works”.\n“As the truth is being preached round the world through various media, those who accept it and support the Kingdom work clearly show themselves as the sheep of God.\n“Those who oppose the truth and refuse to support the saints and their helpers identify themselves as goats” the GKS Acting President said, adding: “In this age of the second presence of Christ each person will be rewarded for what he has done, whether good or bad.”Vanguard News Nigeria"
  },
  {
    "headline": "Fuel subsidy: Cleric warns NLC over planned nationwide protest",
    "summarized_story": "The National Chairman of Jama’atu Izalatil Bidiat Wa-Ikamatis Sunnah (JIBWIS), Sheikh Muhammad Sani Yahya Jingir, has warned that the proposed nationwide protest announced by the Nigeria Labour Congress (NLC) may not be the solution to Nigeria’s problems.\nThis is coming days after the NLC warned the Federal Government against plans to remove the fuel subsidy in 2022, saying the action will be met with nationwide protests from the 27th January to 1st February 2022.\nHe said the proposed nationwide mass protests will only put Nigerians in a difficult situation rather than providing solution to the problem.\nJingir advised that NLC look forward to consultations between the Federal Government, traditional and religious leaders for the solution of the problem.\n“I am not in support of any protest in the country, and I am not supporting the proposed fuel hike by federal government either."
  },
  {
    "headline": "Buhari swears in Sambo as Minister of State, Works and Housing",
    "summarized_story": "President Muhammadu Buhari, on Friday, swore in the newly-appointed Minister of State for Works and Housing, Malam Muazu Sambo.\nThe event was held shortly before the opening of the meeting of the National Security Council in the Presidential Villa in Abuja.\nRecall that Sambo, who replaced Mamman Sale, former Minister of Power, also from Taraba, was posted to the Ministry of Works and Housing as Minister of State, Works and Housing.\nThose in attendance of the security meeting include Vice President Yemi Osinbajo, the Secretary to the Government of the Federation, Boss Mustapha, Ministers of Justice, Defence, Interior, Police Affairs and Foreign Affairs, NAN reports.\nOthers are service chiefs, Inspector-General of Police, Usman Baba, the National Security Adviser to the President rtd Maj. Gen. Babagana Monguno; Director-General of the Department of State Services, Yusuf Bichi as well as the Director-General, NIA, Abubakar Rufa’i."
  },
  {
    "headline": "Kano: Court orders Ganduje to stop construction of shops at congested market",
    "summarized_story": "A High Court sitting in Kano has restrained the state government from constructing shops at the ‘highly-congested’ Kofar Wambai Market.\nAddressing the court, counsel to the traders, Sadiq Abbdullahi, alleged that the government had laid the foundation for the construction of shops in the disputed land.\nThe traders, represented by one, Ibrahim Yakasai, had approached the court on December 22 to stop the government’s plan in the construction of more shops in the congested market.\n“The matter is adjourned to 24/01/2022,” the court order read in parts.\nDAILY POST has reported how the traders protested on Wednesday morning against the construction of more shops by the Kano State Government."
  },
  {
    "headline": "Nigerian Army Training Center graduates 288 officers, charges them on professional conduct",
    "summarized_story": "The Nigerian Army Training Center has graduated 288 officers, charging them to ensure professional conduct in the discharge of their duties.\nThe Commander Corps of Artillery, Major General Tari-Timiye Gagariga, who was at the graduation ceremony in Kontagora tasked fresh graduands to always maintain high professional standards in their conduct during operations.\nZubairu in the release which was made available to DAILY POST said: “The Commander Corps of Artillery (Gagariga) was the Special Guest of Honour at the event was represented by the Chief of Staff, Headquarters Nigerian Army Corps of Artillery, Brigadier General Lebonsina Lebo.\n“The continuous emergence of the asymmetric threats which appears majorly in the form of terrorism and insurgency and being perpetrated by criminals across the country makes this Training more relevant at this time.\nSoyele thanked the Chief of Army Staff, Lieutenant General Faruk Yahaya for the support to the Center, stressing that success in the conduct of the training would not have been possible without his support."
  },
  {
    "headline": "Ohanaeze alleges plot by security agents to maim, slaughter Igbos travelling for Christmas",
    "summarized_story": "Ohanaeze Ndigbo Worldwide has issued a strong warning to the security agents allegedly intimidating motorists and passengers travelling from different parts of the country to their various hometowns in the southern part of the country.\nThe group said by doing this the security agents want to maimed or get the innocent citizens slaughtered in the process.\n“Ndigbo returning home for the Christmas and New Year holidays should be aware of the perilous time and insecurity challenges facing Igbos in the South East.\nOhanaeze Ndigbo further called on the Imo State Government to ensure that peace returns to the state, adding, “We are still taking stock of how deteriorated the insecurity challenges have worsened under the watchful eyes of Imo State Governor, Senator Hope Uzodinma.\n“The government of Imo had failed to improve the security situation in the state, we hope that history will be fair to him to pronounce him the worst Governor that superintendent the carnage of Igbos?”"
  },
  {
    "headline": "11 things you probably didn’t know about Bola Ige",
    "summarized_story": "11 things you probably didn’t know about Bola IgeChief James Ajibola Idowu Ige (SAN) was the Attorney-General and Minister of Justice renowned for his oratorial prowess and advocacy work on civil rights and democracy.\nHere are 11 things you probably did not know about the late Ige1.\nBola Ige was born in Esa Oke, Osun State in September 13, 1930.\nHe was a Nigerian lawyer and politician, who served as Attorney-General and Minister of Justice under former President Olusegun Obasanjo.\nIge established Bola Ige & Co in 1961 and later became a Senior Advocate of Nigeria."
  },
  {
    "headline": "‘I became an orphan again with Ige’s death’",
    "summarized_story": "‘I became an orphan again with Ige’s death’Elder statesman and former Osun State Governor Bisi Akande was on his way to Osogbo after a trip to the United Kingdom when Muyiwa Ige broke the news of his father’s death.\nHe drove in his car with Akinwumi and they headed for Osogbo via the old road from Ibadan, passing Iwo.\nThen, the line went off,” Akande recalled.\nMembers of the team started groaning and moaning and there was general confusion.\n“It was President Obasanjo on the other end,” Akande recalled."
  },
  {
    "headline": "Ige wanted to resign from Obasanjo’s govt before murder, says Akande",
    "summarized_story": "Ige wanted to resign from Obasanjo’s govt before murder, says AkandeChief Bola Ige intended to resign from the government of Chief Olusegun Obasanjo before he was killed on December 23, 2001, former Osun State Governor Chief Bisi Akande has said.\nAkande, in his book, ‘My Participations’, recalled that the late Ige confided in him about his plan to leave as the Attorney-General of the Federation and Minister of Justice.\nHis reason was that the government was not implementing programmes that could benefit the people.\nBefore being posted to the Ministry of Justice, Ige was Minister of Power and had vowed to ensure a stable electricity supply within six months.\n- Advertisement -The author also added that Ige’s former deputy governor, who was then the Minister of Internal Affairs, Chief Sunday Afolabi, chided Chief Ige that he should not forget that he was only invited to ‘come and eat.’"
  },
  {
    "headline": "Akande: How ex-minister Bola Ige was killed",
    "summarized_story": "Elder statesman Chief Bisi Akande has recounted how Chief Bola Ige was killed.\nIge was shot dead in his Ibadan, Oyo State capital, residence on December 23, 2001.\nAkande, who was Osun State governor at the time, recalled in his book ‘My Participations’ the circumstances in which Ige was killed.\n“Instead of going to Esa-Oke, Uncle Bola decided to spend the night in Ibadan.\n“They overpowered the only gateman who had been working with Uncle Bola before he took up the ministerial appointment with Obasanjo and marched him upstairs."
  },
  {
    "headline": "BREAKING: Buhari swears in Sambo as new Works, Housing minister of state",
    "summarized_story": "BREAKING: Buhari swears in Sambo as new Works, Housing minister of statePresident Muhammadu Buhari is currently presiding over a security meeting at the Presidential Villa in Abuja.\nThe meeting, which started at about 10:20am, was preceded by the swearing-in of the newly-appointed Minister of State for Works and Housing, Muazu Sambo, by the President.\nAlthough the agenda of the security meeting was unknown as at the time of filing this report, it will likely revolve around the security situation, threats and plans to get ahead of the situation.\n- Advertisement -Others participating include Minister of Defense, Major General Salihi Magashi (Rtd); Minister of Interior, Ogbeni Rauf Aregbesola; Chief of Defense Staff, General Lucky Irabor; Chief of Army Staff, Lieutenant General Farouk Yahaya; Chief of Naval Staff, Vice Admiral Awwal Gambo; and the Chief of Air Staff, Air Marshal Isiaka Oladayo Amao.\nSambo, a civil engineer, had earlier this week been confirmed as a minister-designate by the Senate."
  },
  {
    "headline": "Happening Now:Buhari’s former ADC decorated one star general",
    "summarized_story": "Former Aide de Camp to President Muhammadu Buhari, Colonel Muhammed Abubakar has been promoted to the rank of Brigadier General.\nThe former ADC was decorated by the General Officer Commanding (GOC) 81 Division Major General Lawrence Fejokwu .\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nClick Here Now .\nGeneral Fejokwu advised the newly Promoted officers to ensure the work in line with the vision of the Chief of Army Staff, Lieutenant General Faruk Yahaya."
  },
  {
    "headline": "Breaking: Buhari, security chiefs in emergency meeting",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari is currently presiding over Emergency Security Council Meeting in the Council Chambers of the State House, Abuja.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nClick Here Now .\nDetails later…"
  },
  {
    "headline": "Apprehension as NIS uncovers foreign terrorists’ plot to attack Abuja",
    "summarized_story": "From Ndubuisi Orji, Fred Itua and Molly Kilete, AbujaThe Nigeria Immigration Service (NIS) has raised the red flag over plots by foreign terrorists to attack the nation’s capital, Abuja.\n“The import is about a looming attack on Nigeria’s Capital City, Abuja between 17th and 31st December 2021.\n“It is painful that there is a threat of imminent terrorists attack in Abuja.\nArmy on red alert, police, FCTA keep mumThe army and the police force have remained mum on the security alert.\nHowever, a top source told Daily Sun the military and security agencies have been on red alert in Abuja to counter any invasion."
  },
  {
    "headline": "Five feared killed as B’Haram fires grenade into Maiduguri",
    "summarized_story": "From Timothy Olanrewaju MaiduguriFive people were feared killed, yesterday, following rocket propelled grenade attack believed to have been fired into Maiduguri, Borno State capital by Boko Haram and its ally ISWAP.\n“Three people hit by the grenade at Gomari Ayafe died,” Ahmed Saje, a resident, said.\nAt least one person was feared killed at Ajilari Cross though some residents said the casualty later rose to two.\nThe president noted that the response exhibited across the theatre had shown extraordinary resilience and steadfastness in the face of adversity.\n“The North East Development Commission continues to make giant strides at improving the economic and social welfare of Nigerians in the region."
  },
  {
    "headline": "Zamfara commissioner resigns, takes appointment as commissioner in Imo",
    "summarized_story": "Zamfara State Commissioner for Women and Children Affairs, Hajiya Rabi Shinkafi, has resigned her appointment to take up another commissionership appointment in Imo State.\n“I resigned my appointment as commissioner in Zamfara to enable me to pick another appointment as commissioner in Imo,’’ Shinkafi told the News Agency of Nigeria (NAN) in Gusau on yesterday.\n“I am immensely grateful to Governor Bello Matawalle and his Wife, Hajiya Aisha Matawalle, for their kindness to me and for giving me the opportunity to serve Zamfara in different capacities.\nI consider them as my family and they were in the picture of my going to Imo.\n“Both Governor Hope Uzodinma of Imo and Matawalle discussed it as fellow All Progressives Congress (APC) governors and as friends too,’’ Shinkafi said."
  },
  {
    "headline": "Buhari in Borno, Promises to Cater for Families of Dead, Wounded Soldiers",
    "summarized_story": "* Says with new hardware, military more prepared to flush out terroristsDeji Elumoye in AbujaPresident Muhammadu Buhari, yesterday, said his administration would support families of dead and wounded soldiers, and help them realise their potential.\nBuhari stated this in Maiduguri, the Borno State capital, when he addressed troops at the Nigerian Air Force Base.\nBuhari assured the families of soldiers, who paid the supreme price for the country, and the injured that the federal government would cater for their needs, in recognition of their sacrifices for all Nigerians.\nI am also happy with the increased level of cooperation between the good people of Borno State, other stakeholders and the security agencies.\nThis intervention will benefit not only students from Borno and the North-east but also students from all parts of Nigeria."
  },
  {
    "headline": "Olori Naomi, Ooni of Ife’s Wife, Announces Divorce from Monarch",
    "summarized_story": "Yinka Kolawole in OsogboWife of the Ooni of Ife, Oba Adeyeye Ogunwusi, Ojaja II, Olori Naomi Silekunola, yesterday, announced her separation from the monarch, citing many personal reasons.\nIn a statement posted on her verified Instagram handle and Facebook account, in the morning, Naomi announced an end to the three-year marriage.\nOoni, on assuming the throne of his fathers, married Olori Wuraola Zaynab Otiti, who left in 2017.\n“Kabiyesi Ooni Adeyeye Enitan Babatunde Ogunwusi, Ojaja II, The Ooni of Ife, is an embodiment of God’s love for humanity.\nWhile the Ooni may not be able to make comments in the media, we will not stand by and allow the office of the Ooni and by extension, the entire Yoruba race to be denigrated.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Seplat Energy Terminates Avuru’s Appointment as Non-executive Director",
    "summarized_story": "Seplat Energy’s Director, External Affairs & Sustainability, Chioma Nwachuku, who made the announcement in a statement posted on the Nigerian Exchange (NGX) website, stated that the termination became effective from December 22, 2021.\nThe letter by Seplat was titled: ‘Change on the Board of Seplat Energy and signed by its Director, Legal/Company Secretary, Edith Onwuchekwa.\nIt stated: “The Board of Seplat Energy announces that it terminated the contract of appointment of Mr. Austin Avuru as a Non-Executive Director on 22nd December 2021, due to breaches of the Company’s corporate governance policies and his fiduciary duties.\nThe Board has called for his resignation as a Director of Seplat Energy.\n“The general public is hereby advised to discountenance Seplat Energy’s publication of December 23, 2021."
  },
  {
    "headline": "2023: IBB Roots for Osinbajo Presidency",
    "summarized_story": "Laleye Dipo in MinnaAhead of the 2023 polls, former Military President, Gen. Ibrahim Badamasi Babangida (rtd), has thrown his weight behind Vice-President Yemi Osinbajo for the presidency, saying: “He (Osinbajo) is a good man.”“I know the professor very well.\nHe is a good man and we need a good man to run us in this country.\nSomebody you can learn from; somebody you share a common conviction with.”“He has the passion for this great country.\nThis is what we need for this country,” Babangida said when the Osinbajo Grassroots Organization (OGO) visited him at his uphill residence in Minna on Thursday.\n“We came to consult the oracle and the oracle has spoken."
  },
  {
    "headline": "Titan Trust Acquires Majority Stake in Union Bank",
    "summarized_story": "‭Nume Ekeghe‬Titan Trust Bank ‬Limited (TTB) ‭has become the majority shareholder in Union Bank of Nigeria Plc.\nThis followed an agreement by ‭Union Global Partners Limited, ‬Atlas Mara Limited ‭and other majority shareholders to‬ divest 88.39 per cent shareholding in Union Bank ‭to‬ TTB.\n“We‭ ‭ ‬are ‭ ‬grateful ‭ to‭ ‭ ‬our ‭ ‬current ‭ ‬investors ‭ ‬whose ‭ ‬significant ‭ ‬and ‭ ‬consequential ‬‬‬investments over the past nine years facilitated the transformation ‭of‬ Union Bank, ‭one‭ ‬‬of‭ ‭Nigeria’s‬ oldest ‬and‭ storied institutions.\nToday, the bank ‭is‬ well-positioned with ‭an‬ ‬innovative product offering, a growing customer base ‭of‭ over six million ‭and‭ consistent ‬‬‬‬ year ‭on‬ year profitability.\n“This ‭is‬ a solid foundation for ‭our‬ incoming investors ‭to‬ buildon‭ ‬as‭ ‭we‬ move into a new era for the bank.‭”‭ ‬‬‬…..more details laterShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Buhari Regime Drags Nigeria Into Controversial Deal With Turkey In Exchange For Military Support",
    "summarized_story": "Nigeria's President, Muhammadu Buhari has entered into a controversial deal with President Recep Tayyip Erdogan of Turkey to keep some Turkey-linked companies in Nigeria under surveillance.\nOn July 28, 2016, the Turkish Ambassador to Nigeria, Hakan Cakil, called on Nigeria to close 17 Turkish schools in the country with ties to the Gulen movement.\nSome of these companies include the Nigerian Turkish International College (NTIC) with branches in Kaduna, Abuja, Kano, Yobe, Ogun and Lagos.\nAlso, the Nigeria Turkish Nile University changed its name to Nile University.\nThe Nigeria Turkish Nizamiye Hospital which was patronised by Nigeria’s elite was simply changed to Nizamiye Hospital."
  },
  {
    "headline": "Buhari Regime Drags Nigeria Into Controversial Deal With Turkey In Exchange For Military Support",
    "summarized_story": "Nigeria's President, Muhammadu Buhari has entered into a controversial deal with President Recep Tayyip Erdogan of Turkey to keep some Turkey-linked companies in Nigeria under surveillance.\nOn July 28, 2016, the Turkish Ambassador to Nigeria, Hakan Cakil, called on Nigeria to close 17 Turkish schools in the country with ties to the Gulen movement.\nSome of these companies include the Nigerian Turkish International College (NTIC) with branches in Kaduna, Abuja, Kano, Yobe, Ogun and Lagos.\nAlso, the Nigeria Turkish Nile University changed its name to Nile University.\nThe Nigeria Turkish Nizamiye Hospital which was patronised by Nigeria’s elite was simply changed to Nizamiye Hospital."
  },
  {
    "headline": "BREAKING: One Dead As Boko Haram Terrorists Fire Rockets Into Borno Airport Area Ahead Of Buhari’s Visit",
    "summarized_story": "One person has been confirmed dead at Ngomari airport general area in Maiduguri, Borno State after Boko Haram fighters fired rockets at the community ahead of the visit of President Muhammadu Buhari.\nOne of the missiles also landed at Ajilari Cross area, near Maiduguri airport where there is a military base.\nSee Also Politics Junketing Nigerian President, Buhari Leaves Abuja For Borno As Security Is Beefed Up In Boko Haram-ravaged StateThe President is visiting Maiduguri to inaugurate multiple projects embarked upon and completed by the Borno State Governor, Professor Babagana Zulum.\nAhead of his election in 2015, Buhari promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit."
  },
  {
    "headline": "BREAKING: One Dead As Boko Haram Terrorists Fire Rockets Into Borno Airport Area Ahead Of Buhari’s Visit",
    "summarized_story": "One person has been confirmed dead at Ngomari airport general area in Maiduguri, Borno State after Boko Haram fighters fired rockets at the community ahead of the visit of President Muhammadu Buhari.\nOne of the missiles also landed at Ajilari Cross area, near Maiduguri airport where there is a military base.\nSee Also Politics Junketing Nigerian President, Buhari Leaves Abuja For Borno As Security Is Beefed Up In Boko Haram-ravaged StateThe President is visiting Maiduguri to inaugurate multiple projects embarked upon and completed by the Borno State Governor, Professor Babagana Zulum.\nAhead of his election in 2015, Buhari promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit."
  },
  {
    "headline": "BREAKING: One Dead As Boko Haram Terrorists Fire Rockets Into Borno Airport Area Ahead Of Buhari’s Visit",
    "summarized_story": "One person has been confirmed dead at Ngomari airport general area in Maiduguri, Borno State after Boko Haram fighters fired rockets at the community ahead of the visit of President Muhammadu Buhari.\nOne of the missiles also landed at Ajilari Cross area, near Maiduguri airport where there is a military base.\nSee Also Politics Junketing Nigerian President, Buhari Leaves Abuja For Borno As Security Is Beefed Up In Boko Haram-ravaged StateThe President is visiting Maiduguri to inaugurate multiple projects embarked upon and completed by the Borno State Governor, Professor Babagana Zulum.\nAhead of his election in 2015, Buhari promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, Borno State, during a condolence visit."
  },
  {
    "headline": "BREAKING: Nigeria has detected 49 Omicron COVID-19 cases, says NCDC",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says Nigeria has recorded a total of 49 cases of the Omicron COVID variant as of December 21.\nAdvertisementThe agency disclosed this during a media briefing on Friday.\nMore to follow…"
  },
  {
    "headline": "BREAKING: Nigeria has detected 49 Omicron COVID-19 cases, says NCDC",
    "summarized_story": "The Nigeria Centre for Disease Control (NCDC) says Nigeria has recorded a total of 49 cases of the Omicron COVID variant as of December 21.\nAdvertisementThe agency disclosed this during a media briefing on Friday.\nMore to follow…"
  },
  {
    "headline": "PHOTOS: Buhari in emergency meeting with service chiefs -- after ISWAP attack in Borno",
    "summarized_story": "President Muhammadu Buhari is currently presiding over an emergency security council meeting.\nAdvertisementThe meeting is taking place in the council chambers of the state house, Abuja.\nOn Thursday, the president said Nigeria was in its final phase in the war against insurgency while addressing troops of the Nigerian Army in Maiduguri, Borno state capital.\nEarlier, the Islamic State in West African Province (ISWAP) had launched multiple rocket attacks on Maiduguri ahead of the president’s visit to the city to inaugurate projects done by the state government.\nAdvertisementMany houses were destroyed by the explosives that landed in several areas including Ngomari, Bulumkutu, Ajilari and Ayafe communities."
  },
  {
    "headline": "PHOTOS: Buhari in emergency meeting with service chiefs -- after ISWAP attack in Borno",
    "summarized_story": "President Muhammadu Buhari is currently presiding over an emergency security council meeting.\nAdvertisementThe meeting is taking place in the council chambers of the state house, Abuja.\nOn Thursday, the president said Nigeria was in its final phase in the war against insurgency while addressing troops of the Nigerian Army in Maiduguri, Borno state capital.\nEarlier, the Islamic State in West African Province (ISWAP) had launched multiple rocket attacks on Maiduguri ahead of the president’s visit to the city to inaugurate projects done by the state government.\nAdvertisementMany houses were destroyed by the explosives that landed in several areas including Ngomari, Bulumkutu, Ajilari and Ayafe communities."
  },
  {
    "headline": "Explosion in Lagos as electricity transmission towers collapse near pipelines",
    "summarized_story": "A pipeline explosion has rocked Alimosho LGA of Lagos state.\nWhen TheCable visited Baruwa, Alimosho LGA of Lagos, Olayiwola Kazeem, a resident, said high tension-cables fell after the pylon transmitting electricity from Egbin Hydro Power Station collapsed.\nAdvertisementHe said upon arrival at the scene, a 330KVA transmission power line collapsed with its power cables spreading across the two lanes of the major road inward and outward Igando-Idimu road.\n“A pipeline explosion also occurred several metres away from the collapsed transmission power line.\n“They were able to determine that the impact from the pipeline explosion affected the Power lines which subsequently led to collapse of the Powerline."
  },
  {
    "headline": "Ghana’s answer to Silicon Valley is inside refurbished government buildings",
    "summarized_story": "This project in the heart of Ghana’s capital city, the Accra Digital Centre, is a symbol of Ghana’s ambition to be the startup capital of Africa.\nAn aerial view of the Accra Digital Centre“Beyond Ghana’s capital city, the government has identified unused government buildings around the country,” said David Ofori, Head of Operations at the Accra Digital Centre.\nFour years later, the Accra Digital Centre is living up to expectation and looks to be a worthy template for other centres across the country.\nAnother early tenant of the Accra Digital Centre is aYo, an affordable insurance product by MTN.\nThe Accra Digital Centre is looking to partner with local or foreign investors and investment companies to expand its reach and impact."
  },
  {
    "headline": "Flutterwave x Wizkid to drive global payments adoption",
    "summarized_story": "While Paystack was more involved with helping startups collect payments, Flutterwave focused on helping anyone send and receive money via its API.\nSince then, the digital payments service has transformed payments in Africa with a number of solutions.\nIt allows African merchants collect payments from their customers anywhere in the world, on web and mobile.\nFlutterwave SendFlutterwave Send dashboardIts latest product, Flutterwave Send, is taking payments to the global level.\nThe Essence of Flutterwave SendAt the helm of Flutterwave Send is Afrobeats artiste, Ayodeji Ibrahim Balogun—popularly known as Wizkid—who was signed on as Flutterwave’s global brand ambassador."
  },
  {
    "headline": "Inside TeamApt: How an upstart overturned competition to dominate agency banking",
    "summarized_story": "After the $5.5 million raise, TeamApt had cash in the bank to place orders for terminals in China and invaded the Nigerian market.\nTo improve the reliability of its product, TeamApt introduced to the market a 24-hour resolution service for false debit card withdrawals.\nTosin Eniolorunda, founder and CEO of TeamApt, champions the thought process and is instilling it into the company culture.\nWith TeamApt seemingly to be crowned with unicorn status, the company now has its eyes on digital banking but with a slant.\nSo, we will be launching a hybrid credit-led banking solution that also caters to the offline market,” Eniolorunda concludes."
  },
  {
    "headline": "Koniku closes Series A round led by Nigeria-based Platform Capital",
    "summarized_story": "Koniku Inc., a Nigerian-founded biotech company that operates out of California, on Friday said it has closed a Series A financing round led by Nigeria-based private equity firm, Platform Capital Investment Partners.\nIn the wake of the fresh investment, four new members will be joining the company’s board of directors, including Akintoye Akindele, Chairman and CEO of Platform Capital.\nThe company’s technology combines traditional computer cells with living biological neurons to give computers power to detect odours.\nBeyond security and healthcare, Konikore has broad applications in industrial monitoring, energy, food and agriculture sectors, and more.\nThe founder is also African, intelligent, passionate, and committed to the Koniku vision,” Dr. Akintoye told TechCabal in an interview, explaining the rationale behind backing Koniku for a second time."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "After 5 reluctant years of bootstrapping, CinetPay is closing in on Francophone Africa dominance",
    "summarized_story": "“We saw that we have a good opportunity with mobile money because many people have mobile money accounts.\nCinetPay has been Flutterwave’s Francophone Africa partner since 2019.\nA little bit more detail about CinetPayCinetPay helps merchants in the Francophone Africa region accept and collect online payments from mobile money wallets in nine countries.\nAccording to the Francophone Africa and the Equality Challenge 2019 Report by the University of Chester Area Studies Research Group, female literacy rates in Francophone Africa have not been growing consistently, with outdated datasets being used for policy making and decision making.\nThe plan for now, though, is to focus on consolidating their hold in Francophone Africa."
  },
  {
    "headline": "Here’s to more stormy years with plenty of wins",
    "summarized_story": "MAX raises $31 million for its electric vehicle subscriptionSource: MAX.ng TwitterNigerian mobility startup, Metro Africa Xpress (MAX) has closed a $31 million Series B funding round.\nThe startup also moved into Nigeria’s capital market after completing the issuance of a ₦400 million ($1 million) bond in September 2020.\nMaxAB’s $55m Series A, MNT-Halan’s $120m, Paymob’s $18m Series A, and Trella’s $42 million Series A made the highlights.\nGenerally, it’s a good year for Africa’s startup funding scene.\nTechpoint Africa Techpoint Africa is a digital media company that amplifies the best innovations out of Africa through its media, data, and events."
  },
  {
    "headline": "Blockchain-powered music and bigger investments: The next frontier for music tech",
    "summarized_story": "But after a closer look and talking to some of the industry’s brightest, the signs are there — the next frontier for music tech may be closer than we imagine.\nUltimately, he believes the music industry is worthy of the same attention investors pay to fintech or healthtech, for example.\nWhile Nigeria cannot boast such levels of investment, the state of the music industry signals that more investments could have a positive impact on the economy.\nIn terms of revenue, the music industry raked in $40 million in 2021.\nAdetunji and Okpala are optimistic about the future of African and Nigerian music, one where tech will definitely determine what the next frontier will be."
  },
  {
    "headline": "Is Flour Mills deal to acquire Honeywell made in heaven?",
    "summarized_story": "The expected combination of Flour Mills Nigeria (FMN) and the flour mills unit of Honeywell Flour Mills plc (HFMP) will form a formidable entity and an unassailable market leader in the agro-allied sector in Nigeria, according to industry players and market analysts.\nLast month, Flour Mills announced it had reached a deal to acquire the flour mills business of Honeywell in an N80 billion deal that will significantly enhance its market leadership.\nIn full year ended March 2021, the turnover for the two was N771.6 billion for Flour Mills and N109.59 billion for Honeywell Flour, and the combination will see FMN emerge as a true continental giant, amassing substantial value for shareholders and huge economic benefit for Nigeria.\nRead Also: Honeywell, Flour Mills N80bn merger to boost Nigeria’s food productionFMN, established in 1960, prides itself of being in the vanguard of feeding the nation for the past 60 years.\nUnder the deal, Honeywell Group will dispose of a 71.69 percent stake in its flour business to FMN based on an enterprise value of N80 billion and subject to approval from the appropriate regulators."
  },
  {
    "headline": "The many legal battles of Ecobank and Honeywell",
    "summarized_story": "On October 16, 2015, Ecobank filed two separate suits before Justice Abang.\nSensing that Ecobank’s lawyers might be attempting to use the administration of justice to blackmail Honeywell into submission, on April 7, 2016, Honeywell petitioned the Legal Practitioners Disciplinary Committee also known as the Body of Benchers.\nHoneywell is also in court pressing damages claim against Ecobank for harm to its interests arising from the ex-parte order granted against it and which has now been made voided by courts including the Supreme Court.\nOn July 13, 2018, justices of the Supreme Court made two rulings, both in favour of Honeywell.\nHoneywell is now asking that the court compel Ecobank to deposit the $28 million proceeds from the share sale into the accounts of the court until the determination of the substantive suit brought by Honeywell."
  },
  {
    "headline": "In Ecobank’s case with Honeywell, bank’s lawyer is biggest victim so far",
    "summarized_story": "On January 11, 2018, the Legal Practitioners Privileges Committee severely sanctioned Ogunba for professional misconduct in relation to his handling of the court cases, withdrawing from him the rank of senior advocate of Nigeria and all other privileges attached to the rank.\nAs set out above, Ogunba on behalf of Ecobank, deliberately instituted a multiplicity of actions on the same dispute, facts, grounds and between the same parties.\nRead Also: Ecobank warns FMN against Honeywell acquisition deal“It is obvious that it is Ecobank’s intention through Ogunba to harass, embarrass and disrupt the business of the Honeywell Group.\nThe damaging effect of Ecobank’s numerous mischievous suits and wrongly obtained orders is enormous and cannot be quantified.\n“Consequently, the legal practitioners’ privileges committee at its 129th plenary meeting have withdrawn the rank of senior advocate of Nigeria from Kunle Ogunba Esq and all other privileges attached to the rank forthwith.”The story has been updated."
  },
  {
    "headline": "Buhari calls for cooperation among elites in tackling Nigeria’s challenges – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – President Muhammadu Buhari says there is need for more cooperation among the elites in the country in resolving the challenges facing the nation.\nThe president’s spokesman, Mr Femi Adesina, in a statement in Abuja, said Buhari made the call when he visited the palace of the Shehu of Borno.\nHe said the elites owe it to the people to inform, guide and shape opinions since they had more access and knowledge on the economy.\n“What our country needs now is the continued cooperation of the elites.\nThe president assured Nigerians that his administration will use the remaining period to consolidate on efforts in restoring peace and improving the economy."
  },
  {
    "headline": "Obaseki rallies stockbrokers, to showcase Edo’s investment opportunities at 2022 conference – Nigerian Observer",
    "summarized_story": "Obaseki gave the assurance when he received the management of Chartered Institute of Stockbrokers, led by its President, Mr. Olatunde Amolegbe, who was on a courtesy visit at the Government House, Benin City.\nReassuring support for the stockbrokers, Obaseki said the state plans to host the institute’s annual conference to showcase investment opportunities in Edo.\nAccording to him, “As you know, I was one of those that founded this institute, and I have no choice but to continue to support the institute.\nThe amount of investment opportunities that we see coming into Edo in terms of agriculture, film, tech, services, and entertainment, among others, is quite impressive,” Obaseki noted.\nEarlier, Amolegbe lauded the governor’s developmental strides across all sectors of the state, adding that the institute is proud of Governor Obaseki."
  },
  {
    "headline": "Yuletide: Edo warns against indiscriminate dumping of refuse, to monitor evacuation of wastes in Benin – Nigerian Observer",
    "summarized_story": "Yuletide: Edo warns against indiscriminate dumping of refuse, to monitor evacuation of wastes in BeninShare FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has mobilized staff of the state’s Ministry of Environment and Sustainability and the Waste Management Board to monitor the evacuation of waste in Benin Metropolis throughout this festive period.\nIn a statement, Permanent Secretary, Edo State Ministry of Environment and Sustainability, Lucky Wasa, warned residents against indiscriminate dumping of waste in public places across the state.\nThe statement reads: “It is hereby announced for the information of the general public that the Ministry of Environment and Sustainability has mobilized staff of the Ministry and Waste Management Board to monitor the evacuation of Waste in Benin Metropolis throughout this festive period.\n“Similarly, Waste Managers have been placed on alert to ensure speedy evacuation of wastes in their various zones.”“The Ministry hereby solicits the cooperation of members of the public to stop indiscriminate dumping of waste in public places both day and night and support Government to actualize the clean-up exercise,” Wasa further charged."
  },
  {
    "headline": "FG destroys over 1m donated doses of expired Astrazeneca vaccines – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestABUJA – The Federal Government on Wednesday destroyed over 1m doses of Astrazeneca vaccines donated to combat COVID-19.\n“As you can see these vaccines have now been deposited by the Abuja Environmental Protection Agency.\n“We have come through in our promise to all Nigerians to be transparent in our delivery of vaccines.\nNAN reports that Malawi was the first country to publicly destroy vaccine doses in May.\nThe African Union’s African Vaccine Acquisition Task Team shipped over 900,000 doses AstraZeneca vaccine to 13 African nations through donations."
  },
  {
    "headline": "FG Declares One-Week Free Train Rides Nationwide",
    "summarized_story": "The Federal Government, on Friday, declared free train services across the country to be enjoyed by Nigerians between December 24 and January 4, 2022.\nSpokesman of the Nigeria Railway Corporation (NRC), Mr. Mahmood Yakub who disclosed this in a statement, said the free service covers all the standard gauge and narrow gauge services of the NRC across its network.\nThese include the Abuja-Kaduna train service, Lagos-Ibadan train service, Warri-Itakpe, Kano-Lagos; Minna-Kaduna and Aba-Port Harcourt.\nThe NRC Managing Director, Engr.\nFidet Okhiria, who also spoke on the development, said, “The decision which was made in collaboration with the Ministry of Transportation, is to ease movement of citizens during the yuletide.”"
  },
  {
    "headline": "Osun 2022: Iwo APC disowns ex-SSG Adeoti, declares support for Oyetola",
    "summarized_story": "The rally had in attendance thousands of supporters of Governor Oyetola and the ruling APC in the constituency.\nSpeaking at the event, the Special Adviser to Governor Oyetola on Political Matters, Alh.\nWe won’t allow it to happen anymore.\nApart from that, our water works was established in 1952.\nWe won’t allow them to spoil Iwoland,” he added."
  },
  {
    "headline": "Ooni’s palace denies knowledge of divorce, says it’s probing possible hacking of Olori Naomi’s Instagram page",
    "summarized_story": "The palace of Ooni of Ife, Oba Adeyeye Ogunwusi, has said it is probing possible hacking of Olori Naomi’s (Naomi Silekunola) Instragam page, while denying knowledge of the report that the marriage between the monarch and his wife had ended.\nBut reacting to the development, the Director of Media and Strategy, Ooni’s palace, Moses Olafare, as of Wednesday evening, Ogunwusi and Naomi went to bed as husband and wife.\nOlafare told PUNCH in an interview that the palace was not aware of the separation.\n“The palace is not aware of such separation because we all went to bed last night (Wednesday) the two being the king and queen.\n“But as of today, this moment, the palace is not aware of the separation."
  },
  {
    "headline": "Titan Trust Bank acquires Union Bank",
    "summarized_story": "Nigeria’s first generation bank, Union Bank Nigeria Plc has announced, in a press release, that it has reached an agreement to sell a majority stake to Titan Trust Bank Ltd, in a deal estimated to be worth about N200 billion, though no purchase consideration was mentioned.\nThe deal will see existing core investors in Union Bank, Union Global Partners Ltd (64.98%), Atlas Mara (25.53%) and other shareholders divest their core holdings totalling 89.39% in Union Bank to Titan Trust Bank.\nTitan Trust Bank, which commenced operations in 2019, is chaired by former Deputy Governor of the CBN and Chairman of Flutterwave, Tunde Lemo.\nThere had been speculations about sale of Union Bank, with the likes of Zenith Bank and Access Bank fingered as potential buyers.\nBut Titan Trust Bank has been confirmed as bank acquiring the 104-year-old bank, in a deal brings back memories of the acquisition of UBA by STB in the landmark deal of 2005."
  },
  {
    "headline": "Ahead Of 2023 Polls, IBB Endorses Osinbajo For President",
    "summarized_story": "Former military president, General Ibrahim Babangida (rtd), has endorsed Vice President Yemi Osinbajo to contest for the office of president come 2023 general elections.\n“I know the vice president very well.\nHe also hailed him for endorsing Osinbajo as president ahead of the 2023 polls.\n“Babangida is a resolute leader and he has given us his word and we should convey his best wishes to the vice president.\n“I am hopeful that the VP will accept to run for 2023 president."
  },
  {
    "headline": "Federal Govt Approves N26bn, $286m, €9m To Boost Power Supply",
    "summarized_story": "In a bid to significantly increase power supply, the federal government has approved all 16 memos on power presented by minister of power, Abubakar Aliyu.\nSome of the projects costs are in both Dollar and Naira, Euro and Naira and Naira only components.\nAt this point, let me say what these approvals will do to the nation’s electricity supply.\n“As we’re all aware, the major problem we’re having in the Electricity Supply Industry is to be able to evacuate sufficient electricity and distribute them.\nThat is to say, we have a very weak transmission grid and distribution segment of the value chain."
  },
  {
    "headline": "5 Die, 12 Injured As ISWAP Terrorists Fire Mortar Bombs On Maiduguri",
    "summarized_story": "At least five mortar bombs were reportedly fired by the terrorists which landed and exploded on six separate houses thus resulting in the deaths and attendant destructions in the areas affected.\nI left my house and few hours after that, I heard an explosion and on returning back I met the shattered body of my daughter.\nADVERTISEMENT“Although, nothing can replace human life, we plead to the government to assist us in rebuilding the destroyed house,” Hassan reiterated.\nThe injured victims were taken to Umara Shehu Ultramodern Hospital while the rest of the victims who died await burial according to Islamic injunction.\nIt could be recalled that the last mortar bomb that was fired by the terrorists in the same area over two weeks ago resulted in the death of a teenager."
  },
  {
    "headline": "5 Die, 12 Injured As ISWAP Terrorists Fire Mortar Bombs On Maiduguri",
    "summarized_story": "At least five mortar bombs were reportedly fired by the terrorists which landed and exploded on six separate houses thus resulting in the deaths and attendant destructions in the areas affected.\nI left my house and few hours after that, I heard an explosion and on returning back I met the shattered body of my daughter.\nADVERTISEMENT“Although, nothing can replace human life, we plead to the government to assist us in rebuilding the destroyed house,” Hassan reiterated.\nThe injured victims were taken to Umara Shehu Ultramodern Hospital while the rest of the victims who died await burial according to Islamic injunction.\nIt could be recalled that the last mortar bomb that was fired by the terrorists in the same area over two weeks ago resulted in the death of a teenager."
  },
  {
    "headline": "Nigeria In Final Phase Of War Against Insecurity – Buhari",
    "summarized_story": "President Muhammadu Buhari Thursday in Maiduguri, Borno State, urged troops of Operation Hadin Kai to remain steadfast as they go into the final phase of the campaign against insurgency and other forms of criminalities.\nAccording to President Buhari, the Government would continue to ensure that the widows and children of fallen heroes were well catered for, to help them fully realise their potentials.\nAccording to President Buhari, similar attention is being given to Intelligence, Surveillance, Target Acquisition and Reconnaissance Assets.\n“I am also happy with the increased level of cooperation between the good people of Borno State, other stakeholders and the security agencies.\nPresident Buhari expressed deep appreciation to the Government of Borno State for its continuous cooperation with the Federal Government in multiple spheres."
  },
  {
    "headline": "Anyim to Nigerians: Let’s Look Forward To 2022 With Renewed Hope, Optimism",
    "summarized_story": "Presidential hopeful, Chief Anyim Pius Anyim, GCON, is wishing all Nigerians a joyful, peaceful and prosperous Christmas and New Year celebration.\nLet us therefore look forward to 2022 with renewed hope, optimism and abiding faith in God.\nI wish Nigerians a joyful Christmas and a peaceful, and prosperous 2022,” he ended.\nAnyim is a staunch member of the Peoples Democratic Party, PDP and on whose platform he hopes to actualise his dream.\nFiercely focused and determined, he has been reaching out and consulting all those that matter in the country."
  },
  {
    "headline": "Anyim to Nigerians: Let’s Look Forward To 2022 With Renewed Hope, Optimism",
    "summarized_story": "Presidential hopeful, Chief Anyim Pius Anyim, GCON, is wishing all Nigerians a joyful, peaceful and prosperous Christmas and New Year celebration.\nLet us therefore look forward to 2022 with renewed hope, optimism and abiding faith in God.\nI wish Nigerians a joyful Christmas and a peaceful, and prosperous 2022,” he ended.\nAnyim is a staunch member of the Peoples Democratic Party, PDP and on whose platform he hopes to actualise his dream.\nFiercely focused and determined, he has been reaching out and consulting all those that matter in the country."
  },
  {
    "headline": "Bandits order seven Zamfara communities: Pay N37m before December 27 or…",
    "summarized_story": "Bandits terriozing residents of Zamfara State has issued a Monday ultimatum to seven communities in Tsafe Local government area of the state to pay a sum of N37 million as ransom or it launch attack in the areas.\nThe communities include Bawagauga, Hayin Uda, Ruguza, Dumuyu, Zigau, Mai-Rerai and Gidan Kado.\nThe source also revealed that the bandit leader identified as Hassan Bamamu has sometimes ago signed a peace pact with the government of Zamfara State and pledged to desist from banditry activities.\nThe source further said that it has already alerted the security authorities about the ultimatum for swift intervention.\nIt was gathered that all the communities are about 25km away from Tsafe Local government headquarters."
  },
  {
    "headline": "Bandits order seven Zamfara communities: Pay N37m before December 27 or…",
    "summarized_story": "Bandits terriozing residents of Zamfara State has issued a Monday ultimatum to seven communities in Tsafe Local government area of the state to pay a sum of N37 million as ransom or it launch attack in the areas.\nThe communities include Bawagauga, Hayin Uda, Ruguza, Dumuyu, Zigau, Mai-Rerai and Gidan Kado.\nThe source also revealed that the bandit leader identified as Hassan Bamamu has sometimes ago signed a peace pact with the government of Zamfara State and pledged to desist from banditry activities.\nThe source further said that it has already alerted the security authorities about the ultimatum for swift intervention.\nIt was gathered that all the communities are about 25km away from Tsafe Local government headquarters."
  },
  {
    "headline": "Buhari presides over emergency Security Council Meeting in Abuja (Photos)",
    "summarized_story": "President Muhammadu Buhari has presided over an emergency Security Council Meeting, the last for 2021 at the State House, Abuja.\nThe president presided over the security council meeting barely a day on arriving from an official visit to Maiduguri, Borno State.\nBorno has been the theatre of Boko Haram insurgents base, where they have displayed millions of residents and killed many."
  },
  {
    "headline": "EPL players need to consider strike action over busy schedule - Guardiola",
    "summarized_story": "Manchester City manager Pep Guardiola has told Premier League players they may need to consider going on strike until their concerns over the hectic schedule are heard.\nTop-flight managers like Guardiola, Jurgen Klopp over the years have continued to speak on dangers (Injuries) that come with busy winter schedule for players.\n“The players and managers all together [need to] make a strike or do something because words alone are not going to be enough,” Guardiola said (via The Times).\n“It is not going to be solved because for UEFA, FIFA, the Premier League, the broadcasters, business is more important than [player] welfare.\nWe talk about [player] welfare, [maybe] the associations of the players [should] say: ‘OK, we don’t play anymore until we solve that situation.’ Maybe then people will pay attention.”"
  },
  {
    "headline": "BREAKING: Buhari Presides Over Security Meeting In Abuja",
    "summarized_story": "At the Presidential Villa in Abuja, President Muhammadu Buhari (retd.)\nis currently presiding over a security meeting.\nThis came after the President swore in Muazu Sambo, the newly appointed Minister of State for Works and Housing.\nThe Senate confirmed the new Minister of State, a building engineer, as a Minister-Designate earlier this week after the upper legislative house screened him.\nVice President Yemi Osinbajo, the Secretary to the Government of the Federation, Mr. Boss Mustapha, and the National Security Adviser, Major General Babagana Monguno, are among those in attendance (retd.)."
  },
  {
    "headline": "2023: Primate Ayodele Gives Revelation On Nigeria’s Next President",
    "summarized_story": "Primate Elijah Ayodele, the leader of INRI Evangelical Spiritual Church, has described how Nigeria’s next president will appear.\nThe future president of Nigeria, according to Primate Ayodele, will not be an old man or a child.\nThe cleric said in a statement signed by his Media Aide, Oluwatosin Osho, that Nigeria’s next president will be one who is devoid of scandal, as God has revealed him.\nThere will be a lot that will surround who will become the next president of Nigeria.\nThe spirit of God says Buhari is ready to handover and will not interfere or dabble into the affairs of who becomes the next President."
  },
  {
    "headline": "BREAKING: Explosion Rocks Lagos As 33Kv Powerline Collapses [PHOTOS]",
    "summarized_story": "A petroleum pipeline has exploded in Isale Odo, LASU Road area of Lagos state.\nThis comes following the collapse of some 330 line high tension poles at Powerline bus stop along LASU/Isheri Road, in Lagos NewsDirect.ng can report.\nMen of NNPC, security, fire fighters and NSCDC are already at scene to salvage the situationon.\nAccording to Ibrahim Farinloye, the Southwest Coordinator of National Emergency Management Agency, NEMA, “the electric cable collapse led to electric sparks all over the area and the sparks got to the spilled content of PMS around the area which led to the pipeline gutting fire and subsequent explosion.”Speaking further, he said, “the pipeline corridor has been known to have spillage often due to activities of vandals stressing that pipeline fire explosion does not pose any threat to human and public lives.”Director, Lagos State Fire and Rescue Service, Mrs Adeseye Margret, who confirmed the incident as of 8.30 am, said, “We are aware and on top of the situation at Baruwa pipeline fire explosion."
  },
  {
    "headline": "N305bn Too Much For 2023 Elections, Sign Electoral Bill Into Law – NANS Tells Buhari",
    "summarized_story": "According to NANS, this is to avoid pointless and ineffective communication between the electoral body and the federal government.\n“Both parties will do themselves a world of good and have more time to serve the good people of Nigeria if this is adopted.\n“It is also expedient that we wade in on the withdrawal of presidential assent to the proposed electoral bill amendment.\nThe President should therefore ignore all dissident and retrogressive exhortations aimed at dissuading him from signing the bill into law.\n“However, we also concur that political parties should be able to unilaterally determine their choice of technique in line with their respective ideologies.”"
  },
  {
    "headline": "Osinbajo is best for Nigeria – IBB",
    "summarized_story": "Nigeria’s former Military President, General Ibrahim Babangida (IBB) has described Vice-president, Professor Yemi Osibanjo, as the best suitable for 2023 presidency.\nHe said Professor Yemi Osibanjo should stay on course, be resilient and contest for Presidency in 2023.\n“I know the Vice President president very well.\nWhile conveying his best wishes to the Vice President, the former President said, “I want you to tell him to stay on course.\nI wish him the best.”Babangida said he accepted to speak to them because of the Vice President president Yemi Osibanjo who he knew has what it takes to be a good leader."
  },
  {
    "headline": "Crossover service: FG restores COVID-19 protocols on religious gatherings, threatens more sanctions over rising cases",
    "summarized_story": "Apparently due to the rising cases of COVID-19 in Nigeria, the federal government Thursday restricted religious gathering to 50 percent with full compliance to public health measures.\nIt also threatened to introduce more restrictions should there be an upsurge in cases of the virus.\nChairman Presidential Steering Committee (PSC) on COVID-19 and Secretary to the Government of the Federation (SGF) Boss Mustapha announced this in a statement in Abuja.\nDue to the number of attendees of such events across the country, the PSC said there has been reduced compliance to public health social measures which has led to increased COVID-19 cases in the country.\n“Ensure that you have taken the full dose of COVID-19 vaccination including the booster dose to reduce your risk of severe infection and death in case of exposure to COVID-19.”"
  },
  {
    "headline": "NIS leaked memo: Algerian national, others planning attack on Abuja",
    "summarized_story": "The Nigeria Immigration Service (NIS) has raised the alarm over a planned attack on Abuja, Nigeria’s nation’s capital by a group of Nigerian terrorists led by an Algerian national.\nOULD ALI, aka Mohammed Ould Sidat, an Algerian national to be assisted by one Zahid Aminon, a Nigerien national.\n“It is further reported that Ali holds Algerian Diplomatic Passport with the name Najim Ould Ibrahim,” the memo read.\nHowever, the attack did not affect the scheduled state visit as President Buhari enlivened the mood of the troops.\nIt said the bandits were arrested in different operations across the North Central."
  },
  {
    "headline": "Pipeline Explodes As Transmission Towers Fall In Lagos State",
    "summarized_story": "A pipeline has exploded in the Egbeda area of Lagos State on Friday morning.\nBut men of the Nigeria National Petroleum Corporation (NNPC), security officials, firefighters, and the Nigeria Security and Civil Defence Corps (NSCDC) were at the scene of the incident.\nThe explosion was due to the collapse of some transmission towers.\nPower service agencies especially the Ikeja Electric Distribution Company (IKEDC) and others are trying to isolate the 330 line for safety reasons, the NEMA boss noted.\nSpillage is a common occurrence in the pipeline corridor due to the activities of vandals."
  },
  {
    "headline": "Foreign Terrorists Planning Attacks In Abuja This December, NIS Warns",
    "summarized_story": "A communique by the Nigeria Immigration Service (NIS) suggests that there may be terrorist attacks in Abuja, the nation’s capital, between the 17th and 31st of December.\nAccording to a statement signed by NIS’ Land Border Patrol Commander, Edirin Okoto, the service said it has received a report from the presidency with regards to attacks to be orchestrated by foreign terrorists.\nThese terrorists, the NIS commander noted, plan to enter Nigeria from Mali using the Niger Republic route.\nThe NIS’s warning comes a few weeks after the Department of State Services (DSS) raised an alarm over plans by terrorists to attack military bases in border towns across the country.\nAccording to the leaked document which was titled, ‘Plans By Insurgents To Launch Attacks On Military Bases In Various Border Communities,’ the planned attacks are to be carried out simultaneously on military posts and bases in various border communities across the nation."
  },
  {
    "headline": "We’ll Keep Doing Our Best Until We Leave In 17 Months, Says Buhari",
    "summarized_story": "President Muhammadu Buhari on Thursday said his administration will keep giving its best for the development of the country until May 2023, reiterating that he will hand over as stipulated by the Constitution.\nHe spoke after the commissioning of Oriental Energies Resource Limited Hanger, Muhammadu Indimi Distance Learning Centre, and an International Conference Centre donated to the University of Maiduguri in Borno State.\n“I know I swore by the Constitution, and I will leave in 17 months,” he was quoted as saying in a statement by his media adviser, Femi Adesina.\n“I pray that the person that will take over from us will also follow the targets of securing the country and building the economy.\nBut we need to develop our resources,” said President Buhari who noted that development would be more sustainable by empowering the people."
  },
  {
    "headline": "FG: Nigerians Suffering Epileptic Power Owing To Years Of Neglect",
    "summarized_story": "The Federal government has pointed at past neglect of the power sector as the major cause of slow development of the power sector and consequently epileptic power supply.\nThe Minister of Power, Abubakar Aliyu who presented 16 memos at the Federal Executive Council meeting chaired by the Vice President, Professor Yemi Osinbajo today, disclosed the present administration has done more than was tenable in previous administrations to bridge the power deficits for improved electricity supply.\nIn affirming the current power generation pegged at 5,000 MW, he described the nation’s transmission grid as weak and unable to evacuate and distribute sufficient electricity, which according to him will constitute a major problem ahead.\nREAD ALSO: Buhari Visits Borno As Multiple Explosions Rock MaiduguriHe however noted that the Federal Government has placed order for new power equipment and assures that Nigerians in no time will see the outcome of the ongoing investments.\nHe further maintained that while there are calls for a reversal, there are also calls for full privatization of the sector, a situation that equally demands the Federal Government go back to the drawing board."
  },
  {
    "headline": "Court Orders NSCDC Commandant To Forfeit 60 Buildings, Land To FG",
    "summarized_story": "A Federal High Court in Abuja has ordered the final forfeiture of 60 buildings illegally acquired by a former Deputy Commandant of the Nigerian Security and Civil Defense Corps (NSCDC), Adenike Ishola Bintu, to the Federal Government of Nigeria.\nThis is according to a statement on Friday by the spokesperson of the Independent Corrupt Practices and Other Related Offences Commission (ICPC), Mrs. Azuka Ogugua.\nA. Egwuata, praying for an order for the final forfeiture of the 60 buildings and a 9.6-hectare plot of land, both located at Sabon-Lugbe South-West Extension, Airport Road, Abuja, alleged to have been acquired by Bintu through corrupt means.\nThe court heard that Bintu claimed that the land, which she used to dupe over 1000 people that subscribed into the estate business, was owned in partnership with NSCDC.\nFurthermore, ICPC proved before the court that Bintu, who had jumped bail and is now a fugitive, did not enter into any partnership with NSCDC to build estates for members of the public."
  },
  {
    "headline": "PDP nat'l chairman, Ayu felicitates with Nigerians at Christmas, charges them to keep hope alive -",
    "summarized_story": "The National Chairman of the People’s Democratic Party, Iyorchia Ayu, has felicitated with Nigerians at Christmas, and charged them to keep hope alive in spite of daunting circumstances.\nAyu said although the Christmas Season symbolizes love, hope, sharing, celebration and thanksgiving, the gloomy economic situation has made such very difficult.\nAyu spoke to Nigerians via his goodwill message to Nigerians, entitled, “Do not lose hope, Nigerians: the good days are coming back.”According to him: “Nigerians love themselves.\nNigerians love life.\nDo not let the sorry state of the nation dampen the Christmas spirit,” he added."
  },
  {
    "headline": "Dowen College: Five students tried over Sylvester oromoni’s death granted bail -",
    "summarized_story": "A Chief Magistrates’ court in the Yaba area of Lagos has granted bail to five students of Dowen College following a charge of conspiracy and homicide made against them by the State Criminal Investigation Department, Panti.\nThe police charged the minors following the alleged murder of their 12-year old schoolmate, Sylvester Oromoni.\nChief magistrate Olatunbosun Adeola, who heard the bail application on Tuesday granted them bail in the sum of N1m each.\nThe magistrate also ordered the defendants to produce two sureties each in like sum.\nMagistrate Adeola said that one of each of the defendants’ sureties must be their parent, and must swear an affidavit of compliance."
  },
  {
    "headline": "FULL TEXT: President Buhari’s letter on withholding assent to electoral bill -",
    "summarized_story": "The President of the Senate, Ahmad Lawan; and Speaker of House of Representatives, Femi Gbajabiamila, on Tuesday, at the opening of plenary read the communication from President Muhammadu Buhari on his rejection of the Electoral Act 2010 (Amendment) Bill.\n“The Electoral Act (Amendment) Bill 2021 seeks to amend certain provisions of the extant Electoral Act 2010.\nPolitical party membership is a voluntary exercise of the constitutional right to freedom of association.\nIt is thus undemocratic to restrict the procedure or means of nomination of candidates by political parties, as it also amounts to undue interference in the affairs of political parties.\n“In the premise of the above, I hereby signify to the National Assembly that I am constrained to withhold assent to the Electoral Act (Amendment) Bill 2021 in line with the provisions of Section 58(1) & (4) of the 1999 Constitution (as amended)."
  },
  {
    "headline": "Just In: Reps raise 2022 budget by N200bn, extend 2021 budget lifespan by 90 days -",
    "summarized_story": "The House of Representatives has extended the lifespan of the 2021 Appropriation act by nine months to enable it run concurrently with the 2022 appropriation.\nMeanwhile, the house of representatives has raised the budget by N200b and passed N17.126 billion as 2022 Spending plan.\nStill in the house of representatives, the lawmakers have approved N215.81b for the Federal Inland Revenue Service in 2022Also, the Senate has approved the nomination of Muazu Sambo as the new minister of Power.\nRecall that President Muhammadu Buhari had few months ago sacked the former minister over failure to improve the sector."
  },
  {
    "headline": "Ooni Of Ife’s Wife Announces Split, Following The Monarch’s Suicidal Story – Trending With Ojy Okpe",
    "summarized_story": "The National Youth Service Corps has reacted to the detention of Sofiyat Akinlabi the female army officer who accepted a marriage proposal from a youth corps member.\nIn a statement the Nigerian army claimed that the female officer was detained for violating the military’s rules of engagement.\nSofiat’s detention has continued to elicit a wave of backlash amongst many Nigerians with over 10,000 signing a petition demanding her release, using the hashtag #FreeSofiyat.\nMeanwhile, the Ooni of Ife, Oba Adeyeye Ogunwusi has narrated how he once attempted to commit suicide but had to change his mind after listening to music.\nHe then began listening to a series of inspirational music which in turn elevated his spirits."
  },
  {
    "headline": "Nigeria Warns of Another Covid Lockdown",
    "summarized_story": "Nigeria’s federal government has warned that it might impose restrictions on gatherings, including curfew if the current surge in the number of COVID-19 cases continues.\nHe also urged Nigerians to celebrate responsibly during the Christmas and New Year holiday seasons and celebrations.\nHe reminded Nigerians that the country was experiencing the fourth wave of the coronavirus as new cases have continued to rise.\n“Avoid non-essential interstate travel at this period as this increases the risk of spreading infection from one place to another.\nPeople who intend to travel are encouraged to take a rapid COVID-19 test to confirm status as many infected persons are asymptomatic."
  },
  {
    "headline": "Nigeria: Government Agencies Blame Bayelsa Wellhead Blowout on Sabotage",
    "summarized_story": "The Nigerian Upstream Petroleum Regulatory Commission (NUPRC) and the National Oil Spills Detection and Response Agency (NOSDRA), two critical federal government agencies investigating the recent oil blowout on an Aiteo facility in Bayelsa, have linked the leak to sabotage.\nDuring a Joint Investigation Visit (JIV) to the Santa Barbara River, Nembe, both organisations agreed that the wind valve may have been tampered with by yet to be identified persons, leading to the spill.\nNOSDRA is the federal government agency responsible for monitoring and responding to oil spills in Nigeria and acts between oil companies and communities at the local and state level.\nWhere the spill came out from is from the wind valve.\n“The wind valve has been replaced now."
  },
  {
    "headline": "Nigerians Face Bleak Holidays as Severe Gas Shortages Hit Power Sector",
    "summarized_story": "The already beleaguered power sector faces even more challenges this yuletide season with severe gas shortages hitting a number of the country’s electricity supply assets, THISDAY learnt Thursday.\nAlready, the Nigeria Gas Company (NGC), has written some industry players intimating them of the dire development and the likely impact it would have on power supply, especially in the western axis.\nTitled: “Re: Notice Of Gas Shortage From Nigeria Gas Company,” the NDPHC noted that it had been notified of the breach of the facility, coupled with other technical issues that were affecting gas supplies in the area.\n“The combined impact of all these issues is a deferment, unavailability to off-takers, of about 250MMscfd of gas from the pipeline network,” the power company noted.\nThe country’s gas reserves exceed its crude oil reserves, although over the years oil has had all the attention, while the gas reserves were left to waste."
  },
  {
    "headline": "Titan Trust Acquires Majority Stake in Union Bank",
    "summarized_story": "Titan Trust Bank Limited (TTB) has become the majority shareholder in Union Bank of Nigeria Plc.\nThis followed an agreement by Union Global Partners Limited, Atlas Mara Limited and other majority shareholders to sell off their 88.39 per cent shareholding in Union Bank to TTB.\nThe Board of Union Bank of Nigeria Plc disclosed this in a notification to the Nigerian Exchange Limited (NGX) and the Securities Exchange Commission.\nUnion Bank explained that the agreement, which is subject to regulatory approvals and other financial conditions, would upon completion transfer 89.39 per cent of Union Bank’s issued share capital to TTB.\nWe look forward to collectively writing the next exciting chapter for Union Bank,” he added."
  }
]