[
  {
    "headline": "Bestiality: STDs contracted from dogs difficult to treat, physicians warn",
    "summarized_story": "Dr. Anyaike, who is a Consultant Public Health Physician, also stressed that some sexually transmitted diseases in animals like dogs can become very difficult to treat when contracted by humans.\nDr. Anyaike, said, “Apart from other transmissible diseases from dogs such as rabies, skin diseases including ringworms (fungal infection) there are three common canine STDs.\nBrucellosis is very difficult to treat successfully.”The physician also identified Canine Herpesvirus as another common STD that humans could get from dogs.\nHe noted that biting, licking and sniffing are additional ways the canine sexually transmitted disease spreads.\n“Chemotherapy for the sexually transmitted disease is the first option, and if that fails to work, radiation will be used,” he said."
  },
  {
    "headline": "Bestiality: STDs contracted from dogs difficult to treat, physicians warn",
    "summarized_story": "Dr. Anyaike, who is a Consultant Public Health Physician, also stressed that some sexually transmitted diseases in animals like dogs can become very difficult to treat when contracted by humans.\nDr. Anyaike, said, “Apart from other transmissible diseases from dogs such as rabies, skin diseases including ringworms (fungal infection) there are three common canine STDs.\nBrucellosis is very difficult to treat successfully.”The physician also identified Canine Herpesvirus as another common STD that humans could get from dogs.\nHe noted that biting, licking and sniffing are additional ways the canine sexually transmitted disease spreads.\n“Chemotherapy for the sexually transmitted disease is the first option, and if that fails to work, radiation will be used,” he said."
  },
  {
    "headline": "UPDATE: Death toll rises to eight in Lagos building collapse",
    "summarized_story": "Deji LamboThe death toll recorded during the building collapse, which happened Sunday, on Ibadan Street, in the Ebute Metta area of Lagos State, has increased to eight.\nOur correspondent also observed as emergency responders put the recovered corpses in body bags.\nThe recovered corpses were deposited in some of the vehicles the emergency responders brought to the scene of the incident.\nHe said, “Another three-storey building, on Lagos Street, about 200 metres away from the current scene has shown signs of distress with part throwing pebbles and falling off.\nHowever, the building has re-sealed and occupants evacuated by officers of Lagos State Buildings Control Agency."
  },
  {
    "headline": "UPDATE: Death toll rises to eight in Lagos building collapse",
    "summarized_story": "Deji LamboThe death toll recorded during the building collapse, which happened Sunday, on Ibadan Street, in the Ebute Metta area of Lagos State, has increased to eight.\nOur correspondent also observed as emergency responders put the recovered corpses in body bags.\nThe recovered corpses were deposited in some of the vehicles the emergency responders brought to the scene of the incident.\nHe said, “Another three-storey building, on Lagos Street, about 200 metres away from the current scene has shown signs of distress with part throwing pebbles and falling off.\nHowever, the building has re-sealed and occupants evacuated by officers of Lagos State Buildings Control Agency."
  },
  {
    "headline": "Eid-el-fitr: God’ll continually help us tackle challenges, answer prayer of all Nigerians — Osinbajo",
    "summarized_story": "“I pray that the almighty God will continually help you and to help our government to tackle every one of the various challenges as we confront them,” he said.\n”The one big advantage of that, Mr President, as you know, is that our FEC meetings were much shorter, and the reason why our FEC meetings were shorter, Mr President, as you know, is that all the trouble-makers who argue too much were all too hungry to make any arguments!\n(General laughter)”So, Mr President, we must continue to pray that future Ramadan will coincide with lent so that, at least, we will have some peace at FEC meetings!\n”I want to just thank the Almighty God, for giving you, Mr President, all that you have required to tackle these challenges and for giving you the life and strength to tackle the challenges and surmount the challenges.\nI pray that the Almighty God will continually help you and help our government to tackle every one of the various challenges as we confront them.”"
  },
  {
    "headline": "Nigeria’s party-political season of ‘philanthropy’ primaries",
    "summarized_story": "In the pantheon of current politicians in Nigeria, the most successful of them all seem to come from generous families with deep pockets and family trust funds.\nNone of that was going to stand in the way of dispensing the generosity authorised by the family trust.\nThe amount of money being dispensed in the name of these unknown family trusts endowed by unknown parents with unknowable wealth is stupefying.\nDespite the less-than-sanguine reputation of its politics, Nigeria’s elected leaders until now have not exactly been famous for the depth of their pockets or their contrived political philanthropy.\nSince then, party politics has established itself as an assured path to quick and stupendous wealth."
  },
  {
    "headline": "There is no reason vaccine coverage should be under 50% in Northern Nigeria – Bill Gates",
    "summarized_story": "BILL GATES: Well, the COVID pandemic has been an incredible tragedy, with the costs, and you have economic damage.\nBILL GATES: Well, a lot of the innovations are achievable without high technology, and some are very high technology.\nWe have a lot of routine vaccines, and of course, the Gates Foundation is the biggest funder of the invention of a malaria vaccine, a TB vaccine and an HIV vaccine.\nAnd it’s very strange how few partners we have in funding malaria vaccine work.\nBILL GATES: Well, the disease modeling work that the Gates Foundation funds started because of our work in malaria and polio."
  },
  {
    "headline": "Delta 2023: Forum PDP chairmen endorses Oborevwori",
    "summarized_story": "By Festus Ahon, ASABAAHEAD of the 2023 general election, the Forum of former PDP Local Government Chairmen (1998 – 2021), Monday, endorsed the Speaker of Delta State House of Assembly, Rt.\nSheriff Oborevwori is its preferred aspirant.\nHon Sheriff Oborevwori is the best among all the aspirants with the requisite experience to take Delta to the next level of infrastructural and human capital development in 2023.\nButressing his reasons for the choice of Rt Hon Sheriff Oborevwori in the motion which was seconded by former PDP Chairman in Aniocha South, Chief Joe Adigwe, Agbajor who was PDP Chairman in Warri South, said the Speaker knows the needs of Deltans.\nThe motion was unanimously adopted by the over 100 members of the forum who were in attendance as there was no countermotion."
  },
  {
    "headline": "Deploy creative measures in stemming tension between herders, locals – Miyetti Allah urges Gov Soludo",
    "summarized_story": "Miyetti Allah Cattle Breeders’ Association of Nigeria, (MACBAN) South-East Zone, has called on Gov.\nHe expressed the commitment of the group to partner with Soludo to ensure farmers and herders had a seamless relationship.\n“The Miyetti Allah Cattle Breeders Association knows fully well that without a safe and secure environment, our business is bound to suffer deplorable losses,’’ he said.\n“As Chairman in the South East Zone, I am deeply worried about the vulnerability of our herders to the brazen rascality of criminal elements in some parts of Anambra State.\n“We plead with the new Anambra administration to deploy more creative measures in stemming the latent tension between herders and the locals in some parts of the state that have been marked as flashpoints,’’ he said."
  },
  {
    "headline": "Boko Haram: Saraki replies BMO on Buhari ‘impeachment plot’ over Tucano jets",
    "summarized_story": "Former Senate President, Bukola Saraki, has responded to the Buhari Media Office (BMO) allegation that he attempted to scuttle Nigeria’s war against Boko Haram.\nBMO accused the 8th National Assembly of frustrating Nigeria’s purchase of Super Tucano fighter jets from the United States in 2017.\nThe group also said Saraki and others planned to impeach President Muhammadu Buhari over the acquisition.\nHe said whatever discussion former US President Donald Trump had with his Nigerian counterpart was not binding on the US Congress..\nOn Buhari’s “impeachment plot” for granting anticipatory approval for the payment of $496,374,470 without legislative consent or budgetary provision, the aide maintained it was a grave violation of the law."
  },
  {
    "headline": "Eid-el-Fitr: Apply lessons of Ramadan – Gov Mohammed to Muslims",
    "summarized_story": "Bauchi State Governor, Bala Abdulkadir Mohammed, has urged Muslims in the country to apply the lessons of Ramadan in solving their personal, communal and national problems.\nThe Governor stated this in his goodwill message to the Muslim Ummah as they joined their counterparts across the world to celebrate this year’s Eid-el-Fitr, marking the end of the month-long Ramadan fasting.\nGovernor Mohammed said this year’s Eid-el-Fitr came after a highly demanding fast, which was observed amidst gruelling and unprecedented socio-economic challenges confronting the country.\n“I wish to congratulate the Muslim Umma on the occasion of this year’s Eid-el-Fitr.\nthat put a wedge between our peoples, deepen mutual suspicion, erode confidence in government and threaten the country’s corporate existence."
  },
  {
    "headline": "Osun 2022: How Ladoja influenced my decision to join Accord Party – Ogunbiyi",
    "summarized_story": "Gubernatorial candidate of Accord Party in the July 16th governorship election in Osun state, Akin Ogunbiyi, has disclosed that it was the former governor of Oyo State, Senator Rasidi Adewolu Ladoja that influenced his decision to join Accord Party.\nOur correspondent gathered that Ogunbiyi, a native of Ile-Ogbo in Aiyedire Local Government Area of the state had, a few weeks ago, dumped the Peoples Democratic Party (PDP) and joined Accord party.\nOgunbiyi has however disclosed that Ladoja played a major role in his movement from PDP to Accord party.\nOgunbiyi said, “My going to the Accord Party, Senator Ladoja is a factor.\n“He is a factor in my movement to the Accord party."
  },
  {
    "headline": "‘I support IPOB’s agitation, Nnamdi Kanu once sang my praise’ – Wike",
    "summarized_story": "Governor Nyesom Wike of Rivers State has said he supports the agitation of the Indigenous People of Biafra, IPOB.\nWike made the remark while recalling that IPOB leader, Nnamdi Kanu once sang his praises.\nAppearing on Channels Television’s Politics Today, Wike said he supports IPOB’s agitation, but frowns against the group’s violent approach.\n“There was a time IPOB was singing praises of Wike, Nnamdi Kanu was singing praises about Wike that he is our son.\n“Whether anybody likes it or not, I support the agitation, I support that we should sit down and discuss the marginalization of the Southeast."
  },
  {
    "headline": "God will help you fight Nigeria’s insecurity – Osinbajo to Buhari",
    "summarized_story": "Vice President Yemi Osinbajo has prayed that God will help President Muhammadu Buhari to fight the insecurity in Nigeria.\nOsinbajo also prayed that God will fulfill the heart desires of all Muslims and every Nigerian.\nThe VP spoke at the Ramadan reception President Muhammadu Buhari hosted on Monday at the Banquet Hall of the State House.\nOsinbajo further thanked God for giving Buhari the life and strength to tackle “the challenges”.\n“Mr President, we really want to thank God for our nation, and I think that this is a perfect opportunity to thank God that our nation is together and united”, he said"
  },
  {
    "headline": "Play politics by its rules, Etsu Nupe advises politicians",
    "summarized_story": "As the 2023 general elections draw nearer, the Etsu Nupe, Alhaji Yahaya Abubakar, has called on politicians to play politics by its rules.\nThe Etsu Nupe, who is the Chairman, the Niger State Council of Traditional Rulers, made the call in Bida yesterday.\nThe Etsu Nupe, however, advised politicians to focus on germane issues rather than dwelling on campaigns of calumny against one another.\nHe urged politicians to be busy showing Nigerians the template of what they have for them in stock instead of politics of rancour and rife.\nSimilarly, he called on Muslims and other Nigerians to pray for the peaceful conduct of the 2023 general elections."
  },
  {
    "headline": "Reports I will join 2023 presidential race speculative",
    "summarized_story": "Senate President Ahmad Lawan has said any possibility of him joining the 2023 presidential race would be determined by God.\nHe described reports of pressure on him to join the race as speculative.\nLawan was speaking on the sidelines of the Sallah homage paid to President Muhammadu Buhari at the Presidential Villa by Abuja residents to mark the Eid-el-Fitr.\nWe passed the budget for 2022, a budget for consolidation of what we have been able to achieve in 2020, when we had an implementation of 100%.\n“2022 has just finished, another 100% implementation of budget and we’re looking forward to ensure that the 2022 budget is also implemented by 100%."
  },
  {
    "headline": "Nigeria’s crude oil output declined by 40,000 in April",
    "summarized_story": "The Organisation of Petroleum Exporting Countries (OPEC) has said Nigeria crude oil output declined by 40,000 barrels per day (bpd) in April 2022.\nNigerian output posted a 40,000 bpd decline, the survey found, with lower exports than in March.\n“OPEC and its allies, known as OPEC+, are slowly relaxing 2020 output cuts as demand recovers from the pandemic.\nNigerian output posted a 40,000 bpd decline, the survey found, with lower exports than in March.\nThe United Arab Emirates followed through on its higher quota and added 40,000 bpd, while Kuwait’s output edged up by 10,000 bpd."
  },
  {
    "headline": "Lovers die during car sex romp",
    "summarized_story": "A man and a woman said to have been making love inside a Sports Utility Vehicle (SUV) have been found dead.\nThey were found on Sunday night at Jakande Estate, Isolo in Lagos by neighbours who got curious because the car’s engine was on from Saturday.\nIt was gathered that the man simply identified as Koyejo, had picked up his unnamed lover at Isolo while he was heading to his family’s house in Jakande Estate, Isolo.\nKoyejo, a married IT engineer, was said to have moved out of Jakande Estate and settled at Isolo and lived with his wife at Surulere.\nHe said it was the car being on and on same spot that raised their suspicion, adding that some people decided to move closer to be sure the car was intact."
  },
  {
    "headline": "Don’t come back if you fail to run, MOSIEND threatens Jonathan",
    "summarized_story": "The Movement for the Survival of Izon Ethnic Nationality in the Niger Delta (MOSIEND) has called on former President Goodluck Jonathan not to return to the Niger Delta if he fails to contest the 2023 presidential election.\nThe National President of MOSIEND, Kennedy Tonjo-West, said all the youth leaders in the region were in agreement that Jonathan must run.\nTonjo-West in a statement in Port Harcourt, Rivers State, on Monday, said Jonathan was known for not being power hungry.\nHe said: “Jonathan’s competence to handle Nigeria problems more effectively and efficiently is not in doubt.\nGod is not finished with Dr Goodluck Ebele Jonathan concerning the leadership of our great country yet."
  },
  {
    "headline": "I’ll hand over to person Nigerians elect -Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has reaffirmed the commitment of his administration to a free, fair and transparent electoral process in 2023.\nAsked who he would hand over to in 2023, Buhari replied: “The person that Nigerians elect.”The president said his administration would continue to work to make the country safe for Nigerians.\n“Heads of the services; Army, Navy, Air Force, the Inspector-General of Police and so on, are very much aware of the situation.\n“This should ease their pain and anxiety as we push the military to finding a safe return to their families.\nThe primary objective of any rescue operation is to free the hostages safely, unharmed and alive.”"
  },
  {
    "headline": "Iwuanyanwu, Mbaka thank The Sun for awards",
    "summarized_story": "Elderstatesman, Chief Emmanuel Iwuanyanwu and Managing Director, Platinum Mortgage Bank, Emmanuel Mbaka, have praised The Sun for the professionalism and impartiality in selecting its award winners.\nWhile expressing happiness for being singled out for honour, Iwuanyanwu and Mbaka, who wo-uld receive Lifetime Achievement award and Banker of the Year award respectively, said The Sun Awards are worthy recognitions.\nThe highly elated Iwuanyanwu said he couldn’t have been happier in his life, being recognised by one of the best newspapers in the country.\nHe said: “I thank you very much for finding me fit to receive this award.\nFor Mbaka, Ukeh said he was chosen as The Sun Banker of the Year Award for 2021, after a painstaking selection process."
  },
  {
    "headline": "World Press Freedom Day: Buhari salutes media’s role in sustaining democracy – The Sun Nigeria",
    "summarized_story": "A statement by Femi Adesina, media adviser, quoted Buhari as stating this on the occasion of the World Press Freedom Day, observed yearly on May 3.\nHe rejoiced with the Nigerian media, and recognised their role in strengthening the country’s democracy.\n“Today is a day globally, to remind governments of the need to respect their commitment to press freedom.\nIt is also a day of reflection among journalists and other media professionals about issues of press freedom and professional ethics.\nGovernments at all levels must take the lead in making sure that their actions do not inspire violations of press freedom."
  },
  {
    "headline": "2023: Race for PDP primary intensifies",
    "summarized_story": "He said the generals are believed to have the magic wand in the PDP unlike the ruling party, All Progressives Congress (APC) where President Muhammadu Buhari holds the aces.\nMeanwhile, Atiku Abubakar who clearly won the primaries of the party in 2019, our source said, is sweating to retain the structure with which he picked the PDP ticket.\nSeveral factors, he said, now work against Atiku unlike in 2019 when he had a smooth ride in several states particularly in the Southern part of the country.\nHe therefore asked the party’s leadership to grant him the right of first refusal for the 2023 ticket.\nAtiku said this to the PDP National Working Committee at the Wadata Plaza national secretariat when he formally acquainted the leadership with his decision to contest for the presidential ticket ahead of the 2023 elections."
  },
  {
    "headline": "Corps member, 9 others die in Lagos collapsed building",
    "summarized_story": "By Job OsazuwaTen people have been confirmed dead as a three-storey building collapsed at 24, Ibadan Street, Off Murtala Mohammed Way, in the Ebute Metta area of Lagos State.\nHe said: “Another three-storey building on Lagos Street, about 200 metres away from the current scene has shown signs of distress with part throwing pebbles and falling off.\nHowever, the building has been re-sealed and occupants evacuated by officers of Lagos State Buildings Control Agency.\n“Ten deaths have been confirmed, six males and four females, including a National Youth Service Corps (NYSC) member.\nHe said: “On arrival at the incident scene, an old three-storey building, comprising rooms and parlour, was discovered to have collapsed."
  },
  {
    "headline": "FIFA Fines Nigeria $.15m, Bars Fans from Moshood Abiola National Stadium Abuja",
    "summarized_story": "Duro IkhazuagbeWorld football governing body, FIFA, has imposed a fine of $150,000 on Nigeria following the disturbances that followed Super Eagles’ 1-1 draw with Ghana in a 2022 World Cup playoff at the Moshood Abiola National Stadium in Abuja.\nThe draw led to the non-qualification of Nigeria for the 2022 World Cup in Qatar.\nIn addition to the fine, fans have been barred from the Moshood Abiola Stadium in Abuja as Nigeria will play host to Sierra Leone in the first qualifying match of the 2023 AFCON next month.\nOver 60,000 fans crammed the stadium in Nigeria’s last game of the qualifiers for the World Cup in Qatar.\nThe fans’ action resulted in speculations in the local media that the stadium may not witness any international game in the foreseeable future."
  },
  {
    "headline": "2023: Two Groups Move to Stop PDP Convention over Power Rotation, Zoning",
    "summarized_story": "The kernel of their cases are that the PDP over the years had a tradition of power rotation and zoning.\nThe PDP had fixed May 28, for the conduct of its presidential primary election and to that effect screened the 17 aspirants who obtained the presidential form to run in the 2023 election.\nAs of last week, it was obvious that the PDP was not considering zoning its Presidential ticket to the south as being clamoured by southern governors and other leaders in the zone.\nThe PDP asked the court to strike out the suit for want of jurisdiction and also dismiss it for being “statute-barred”.\nIt is the ruling party that should be concerned with zoning, but not the PDP."
  },
  {
    "headline": "RenCap: With Oil Prices above $100 Per Barrel, Impact on Budget will Be Negligible",
    "summarized_story": "Emmanuel Addeh in AbujaA new report by Renaissance Capital (RenCap), a frontier market investment company, has stated that despite crude oil prices at over $100 per barrel, the impact on Nigeria’s fiscal position would remain negligible due to petrol subsidy payments and falling oil production by the country.\n“This implies that Nigeria has a $3 billion net benefit for every $10 per barrel change to the oil price (Brent),” it stated.\nRenCap said in the report, “An 80 per cent increase in the oil price, from $41/bbl to $72/bbl, reduced the budget deficit by about 1 ppt only.\nWe attribute the widening of the deficit in 2021, despite the high oil price, to the fall in production that countered the price effect.\n“Below this price,” it stated, “the government’s take of oil proceeds is fully remitted and not undermined by petrol subsidy deductions."
  },
  {
    "headline": "Anyim: South-east’s Most Important Demand is Reintegration",
    "summarized_story": "And I replied, the most important single demand of the south-east from Nigeria is reintegration.\n“Once they feel that they have been fully reintegrated into Nigeria, all agitation will naturally be extinguished.\nAnd eventually, when one of them became the president of the country, that agitation died out.\nIn fact, not when he became president, immediately he became vice president of Nigeria, that agitation died out.\nI believe that if a South-easterner becomes the president of Nigeria, that agitation will die,” he said."
  },
  {
    "headline": "Outrage over APC’s Indecision on Zoning of 2023 Presidency",
    "summarized_story": "Rotimi Amaechi, yesterday said he would support President Muhammadu Buhari and APC’s preferred candidate for the 2023 presidential election.\nIn its reaction to APC’s indecision on zoning, PANDEF described Adamu’s claim as careless and ill-considered.\nAs the leader of the country and the leader of the APC, President Buhari must demonstrate strong courage by ensuring that power is moved to South-east after him,” the organisation noted.\nThe organisation, however, warned that anything outside zoning the presidency to the South-east zone would not only boomerang but threaten the nation’s very existence.\nI will Support Whoever is Buhari, APC’s Choice, Says AmaechiIn another development, the Minister of Transportation, Amaechi, yesterday said he would support President Buhari and APC’s chosen candidate for the 2023 presidential election."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Chief Of Defence Staff, Irabor Laments Increased Cases Of Soldiers Working With Boko Haram, Bandits, Others",
    "summarized_story": "The Chief of Defence Staff (CDS), General Leo Irabor has condemned the increase in cases of military personnel aiding and abetting terrorists and bandits in the country.\n“Recent happenings in various TOOs reveal an increase in cases of aiding and abetting by personnel.\nHe took his life after he was arrested for allegedly conniving with Boko Haram insurgents who attacked Yobe communities recently.\nJibrin, who disappeared from his duty post was said to have been sighted among the Boko Haram terrorists who had earlier attacked Geidam town.\nAlso arrested was another soldier attached to Headquarters 1 Division of the Nigerian Army, PTE Danladi Hadau (20NA/79/4219), along with two vigilantes identified as Mustapha Kasim and Ibrahim Mohammed."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Chief Of Defence Staff, Irabor Laments Increased Cases Of Soldiers Working With Boko Haram, Bandits, Others",
    "summarized_story": "The Chief of Defence Staff (CDS), General Leo Irabor has condemned the increase in cases of military personnel aiding and abetting terrorists and bandits in the country.\n“Recent happenings in various TOOs reveal an increase in cases of aiding and abetting by personnel.\nHe took his life after he was arrested for allegedly conniving with Boko Haram insurgents who attacked Yobe communities recently.\nJibrin, who disappeared from his duty post was said to have been sighted among the Boko Haram terrorists who had earlier attacked Geidam town.\nAlso arrested was another soldier attached to Headquarters 1 Division of the Nigerian Army, PTE Danladi Hadau (20NA/79/4219), along with two vigilantes identified as Mustapha Kasim and Ibrahim Mohammed."
  },
  {
    "headline": "Soyinka Visits Sunday Igboho In Benin Republic, Holds Closed-door Meeting With Agitator, Professors Akintoye, Adeniran",
    "summarized_story": "Nobel laureate, Prof Wole Soyinka, on Sunday visited the Yoruba Nation agitator, Sunday Adeyemo, aka Sunday Igboho, in Cotonou, Benin Republic.\nSoyinka also held a closed-door meeting with the Yoruba Nation Leader and the coordinator of the Ilana Omo Oodua group, Prof Banji Akintoye, as well as his deputy, Prof Wale Adeniran, in the city.\nSoyinka said he had always wanted to see Igboho, to \"sympathise with his predicament\".\nPHOTONEWS: Wole Soyinka, Wale Adeniran and Banji Akintoye after a closed-door meeting with Sunday Ighoho On Sunday In Cotonou, Benin Republic.\nHis response was that he was on a visit to the Yoruba Nation activist, Sunday Igboho to \"break the Muslim fast with him.\""
  },
  {
    "headline": "Soyinka Visits Sunday Igboho In Benin Republic, Holds Closed-door Meeting With Agitator, Professors Akintoye, Adeniran",
    "summarized_story": "Nobel laureate, Prof Wole Soyinka, on Sunday visited the Yoruba Nation agitator, Sunday Adeyemo, aka Sunday Igboho, in Cotonou, Benin Republic.\nSoyinka also held a closed-door meeting with the Yoruba Nation Leader and the coordinator of the Ilana Omo Oodua group, Prof Banji Akintoye, as well as his deputy, Prof Wale Adeniran, in the city.\nSoyinka said he had always wanted to see Igboho, to \"sympathise with his predicament\".\nPHOTONEWS: Wole Soyinka, Wale Adeniran and Banji Akintoye after a closed-door meeting with Sunday Ighoho On Sunday In Cotonou, Benin Republic.\nHis response was that he was on a visit to the Yoruba Nation activist, Sunday Igboho to \"break the Muslim fast with him.\""
  },
  {
    "headline": "Polygamy Versus Monogamy Debate: A Response To Reno Omokri By Aaron Ukodie",
    "summarized_story": "So pervasion of the God order and way of life started seeping into human soul and existence.\nSo, we see a flagrant disrespect of the God order.\nWhen Adam and Eve sinned humanity began to disobey God's order; man became lustful.\nNow, this has nothing to do with traditions of men, which mostly are derived from the fallen state of man’s heart; the state of disobedience to God’s order.\nWe are discussing God’s perfect order; God’s perfect life, which Jesus came to reenact and preach about, which the apostles were devoted to and expanded and gave more light."
  },
  {
    "headline": "Southern, middle belt leaders: Next president must come from south... we won't accept deceit",
    "summarized_story": "The Southern and Middle Belt Leaders Forum (SMBLF) says it will amount to “deceit” if political parties refuse to zone their presidential tickets to the southern region.\nOn Thursday, Ango Abdullahi, the chairman of NEF, had said the next president should emerge through merit and not zoning.\nAdvertisement“SMBLF says it is rather unfortunate and absurd that Ango Abdullahi and his Northern Elders Forum would make such twaddle.\n“A few days ago, this same Ango fumbled with the idea of a so-called consensus arrangement for northern presidential aspirants.\nThey have our absolute support for the Southern and Middle Belt Leaders’ Forum and we stand firmly by them."
  },
  {
    "headline": "Southern, middle belt leaders: Next president must come from south... we won't accept deceit",
    "summarized_story": "The Southern and Middle Belt Leaders Forum (SMBLF) says it will amount to “deceit” if political parties refuse to zone their presidential tickets to the southern region.\nOn Thursday, Ango Abdullahi, the chairman of NEF, had said the next president should emerge through merit and not zoning.\nAdvertisement“SMBLF says it is rather unfortunate and absurd that Ango Abdullahi and his Northern Elders Forum would make such twaddle.\n“A few days ago, this same Ango fumbled with the idea of a so-called consensus arrangement for northern presidential aspirants.\nThey have our absolute support for the Southern and Middle Belt Leaders’ Forum and we stand firmly by them."
  },
  {
    "headline": "Wike: I support IPOB's agitation — but I won't condone violence",
    "summarized_story": "Nyesom Wike, governor of Rivers, says he supports the agitation of the Indigenous People of Biafra (IPOB) but is against the violent activities linked to the group.\nSpeaking on Tuesday in an interview with Channels, the Rivers governor said there was a time Nnamdi Kanu, IPOB’s leader, was singing his praises over his support for the group’s agitation.\n“There came a time that IPOB was singing praises about Wike.\nNnamdi Kanu was singing praises about Wike, saying he is their son,” the Rivers governor said.\nNot only are you burning everywhere, you said we (referring to Rivers state) are part of you."
  },
  {
    "headline": "Wike: I support IPOB's agitation — but I won't condone violence",
    "summarized_story": "Nyesom Wike, governor of Rivers, says he supports the agitation of the Indigenous People of Biafra (IPOB) but is against the violent activities linked to the group.\nSpeaking on Tuesday in an interview with Channels, the Rivers governor said there was a time Nnamdi Kanu, IPOB’s leader, was singing his praises over his support for the group’s agitation.\n“There came a time that IPOB was singing praises about Wike.\nNnamdi Kanu was singing praises about Wike, saying he is their son,” the Rivers governor said.\nNot only are you burning everywhere, you said we (referring to Rivers state) are part of you."
  },
  {
    "headline": "Presidential bid: It's speculative but God will show us the way, says Lawan",
    "summarized_story": "Senate President Ahmad Lawan says the reports on if he will contest the presidency in the 2023 general election are “speculative”.\nReports had surfaced over the weekend that the senate president would soon declare his intention to contest the presidency.\nAdvertisement“The year 2021 has just finished — another 100 percent implementation of budget — and we’re looking forward to ensuring that the 2022 budget is also implemented by 100 percent.\n“If we stabilise our economy, we stabilise our country, then people can contest.\nHow much do we sacrifice for the sake of others in our communities and in our country?"
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "WhatsApp confirms outage, as thousands around the world are unable to send messages",
    "summarized_story": "On Thursday evening, April 28, nearly 10,000 users reported that WhatsApp is not functioning for them, according to data from Down detector.\nIt’s not immediately clear what caused the outage but WhatsApp has confirmed the outage through its official Twitter account.\n“You may be experiencing some issues using WhatsApp at the moment,” the company said.\nWe’ll keep you updated and in the meantime, thanks for your patience.”You may be experiencing some issues using WhatsApp at the moment.\n— WhatsApp (@WhatsApp) April 28, 2022Share this article"
  },
  {
    "headline": "Here are the confirmed speakers for the Techpoint Africa Blockchain Summit",
    "summarized_story": "Share this article:On May 21, 2022, the biggest blockchain and Web3 focused event — Techpoint Africa Blockchain Summit (TABS 2022), will be held at Four Points by Sheraton, Victoria Island Lagos.\nSpeaker at Techpoint Africa Blockchain SummitFisayo Fosudo is a visual storyteller, finance and technology video producer with over 250,000 subscribers.\nSpeaker at The Techpoint Africa Blockchain Summit.\nSpeaker at Techpoint Africa Blockhain Summit.\nSpeaker at Techpoint Africa Blockchain SummitSenator Ihenyen is the current President of Stakeholders in Blockchain Technology Association of Nigeria (SiBAN), a self-regulatory body in Nigeria’s emerging blockchain industry."
  },
  {
    "headline": "Microsoft is putting the edgy in Edge",
    "summarized_story": "Techpoint Africa Blockchain SummitTechpoint Africa Blockchain SummitFrom forging a career in blockchain to learning how to make money with NFTs, the Web3 space can be very tricky.\nLet NFT artists and blockchain devs show you the ropes at the Techpoint Africa Blockchain Summit.\nBesides, keep in mind that as IE’s market share was steadily declining — Google Chrome dominates other browsers with a 69% market share —Microsoft was developing Microsoft Edge to replace Internet Explorer.\nHow to remove personal information from Google SearchOn Wednesday, April 27, 2022, Google announced that it had expanded its policy on Google Search removal requests for some of your personal information.\nAttach a screenshot to your request that shows where your personal information appears on the web page."
  },
  {
    "headline": "A Kenyan Eden",
    "summarized_story": "Remember we had a Twitter Space titled Do startups need financial literacy?\nSince then, 95 companies have participated as of the Winter 2022 launch, about half of which are financial services providers, and 51 are from Nigeria.\nEden Life’s expansion and acquisitionEden Life, a Lagos-based startup, has announced plans to expand into Nairobi, Kenya.\nBuilding on its success in Lagos, Nigeria, Eden says it intends to remove obstacles to discovering dependable household services in Nairobi.\nWhat I’m reading and watchingOpportunitiesThe FT x Cardano Blockchain Challenge is sourcing ventures building or interested in leveraging the Cardano blockchain platform and community."
  },
  {
    "headline": "Community Coins: Dogecoin (DOGE) & Mushe (XMU) rise as Elon Musk buys Twitter",
    "summarized_story": "This article is a Brand Press post.\nBrand Press is a paid service for brands that want to reach Techpoint Africa’s audience directly.\nTechpoint Africa’s editorial team doesn’t write Brand Press content.\nLearn more about Mushe (XMU)Official Website: https://www.mushe.world/Presale Registration: https://portal.mushe.world/sign-upTelegram: https://t.me/MusheWorldXMUTwitter: https://twitter.com/Mushe_WorldInstagram: https://www.instagram.com/mushe_world/Brand Press This Brand Press article wasn’t written by Techpoint Africa’s editorial team.\nTo promote your brand via Brand Press, please email business@techpoint.africa."
  },
  {
    "headline": "DeFi is getting Re-DeFined with Logarithmic Finance (LOG), Ripple (XRP) and Fantom (FTM)",
    "summarized_story": "Logarithmic Finance (LOG)Logarithmic Finance (LOG) comes packed with promise.\nLogarithmic Finance (LOG) is also interoperable and open source, with a public-driven and highly spirited drive towards overall development, the coin has a lot of potential.\nWith all of these promises, it is an absolute steal to have Logarithmic Finance (LOG) at a locked presale of $0.10.\nThe potential truth is that at no other time will the Logarithmic Finance (LOG) cryptocurrency be cheaper than it is today.\nEverything is in place, DeFi is going to see a massive shift and Logarithmic Finance (LOG) looks like it could be the centre of it."
  },
  {
    "headline": "Obaseki moves to end street begging, urges stakeholders’ support – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has affirmed the government’s zero tolerance for street begging, noting that the state will begin the arrest and prosecution of parents of out-of-school children, as part of efforts to tackle the menace of street begging in the state.\nThe governor said, “We believe that basic education is the right for every Edo child; it’s their right and it’s free and compulsory.\nWe will link education with street begging and street children.\n“In the next few weeks or months, we will not allow street begging in Edo anymore.\nWe will make sure those hard-to-reach areas in the riverine communities will have teachers to teach the children."
  },
  {
    "headline": "Obaseki, Ehanire seek increased private partnership to improve healthcare system – Nigerian Observer",
    "summarized_story": "The duo made the call during a dinner organized for members of the Association of Nigeria Physicians in the Americas (ANPA) who are in Edo State on a one-week medical mission, providing specialised healthcare services to the people of Edo State.\nDuring the medical mission, over 5,000 Edo residents benefitted from the free surgical intervention and treatments for heart, kidney, eye and other ailments.\nHailing the association for the free medical outreach, Obaseki said the mission has provided better healthcare for Edo people.\nHe said, “We have received the fundamental benefit of hope to Edo people as you gave renewed life to Edo people.\nYou also engaged in capacity building as you interchanged skills and made your colleagues here locally improve their knowledge."
  },
  {
    "headline": "Obaseki inspects progress of work on Labour House, to finalises on construction of 7.2km Temboga Road – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has said the government is commencing the construction the 7.2km Temboga Road in Ikpoba-Okha Local Government Area (LGA) of the state to decongest traffic around Ramat and its environs within the Benin metropolis.\nObaseki disclosed this when he was led on an inspection of ongoing construction of the Edo Labour House Complex, in Benin City, by the state chairman of the Nigeria Labour Congress (NLC), Mr. Odion Olaye.\nThe governor said, “We are finalising the design of Temboga Road; it’s about 7.2km to the end.\nOnce they finalize with the design in the next few weeks, we will award the contract.\nIt has a multipurpose hall which can be put into commercial use to generate income."
  },
  {
    "headline": "PHOTOS: Workers’ Day Celebration In Edo – Nigerian Observer",
    "summarized_story": "Check AlsoThe Governor of Edo State, Mr. Godwin Obaseki, has congratulated Muslims in the state as …"
  },
  {
    "headline": "Eid-el-Fitr: Senator Oriolowo felicitates Muslims, calls for sustained prayers for peace in Nigeria",
    "summarized_story": "By Sunday Oguntuyi, OsogboSenator Adelere Oriolowo representing Osun West Senatorial District, has congratulated Muslim faithful across Osun State and Nigeria on the successful completion of the 1443 AH (2022) Ramadan fasting and called for sustained prayers for peace in the country on the occasion of the Eid-el-fitr celebration.\nHe furthermore said that “We have just ended a month-long fast thus paving way for the Eid-el-fitr celebrations.\nThese two periods are such times that the Almighty Allah enjoined us to ask for his blessings.\nWe should therefore seize the opportunity to spread love and helping hands to another because Eid-el-fitr is a time of love and goodwill.\nIt gives us a message to love all and hate none”While wishing the Muslim faithful a blessed and peaceful Eid-el-fitr, Senator Oriolowo admonished them not to forget the significance of Ramadan and should carry on with the lessons and virtues the period brought."
  },
  {
    "headline": "Eid-el-fitri: Osun Dep. Governor congratulates Muslim faithful",
    "summarized_story": "By Sunday Oguntuyi, OsogboOsun State Deputy Governor, Benedict Alabi, has felicitated with Muslim Ummah in the state, on the completion of holy month of Ramadan, urging them to sustain the tempo of spiritual purity.\nHe said the holy month of fasting and celebration of the first three days of Shawwal present a precious moment for incessant supplication to God over array of national challenges.\nAlabi, added that the special moment also reminds Muslims and others of the need for self discipline and moderation as a way of strengthening relationship with God and seeking for His favour.\nThis was contained in a statement signed by his spokesperson, Olaniyi Ajibola, in Osogbo, the Osun State capital.\n“I congratulate every Muslim faithful on this special moment”."
  },
  {
    "headline": "UBA ends Q1, 2022 on strong note amid turbulence",
    "summarized_story": "Okey OnyenweakuUBA has once again shown consistency in posting strong performance in its first quarter ended March 2022 outlook.\nIts Net interest income advanced by 14.10% from N74.38 billion to N84.87 billion in the current period.\nDetails show that net income from fees and commission rose 19.30 per cent to N24.30billion from N20.366billion in 2021.\n§ The bank, however, grew its net income from fees and commission rising 19.30% to N24.30 billion year on year.\n§ Trade transactions income for the Q1 2022 period grew by 109.19% from N7.42 billion in the corresponding period of 2021 to N3.55 billion."
  },
  {
    "headline": "Security burden rises; terrorists adopt franchise model",
    "summarized_story": "Buhari had again reiterated the resolve of his administration to deal ruthlessly with criminal elements creating security challenges in the country.\nThe President wrote in the visitors register: My condolences to the Sultanate, the Government, and people of Sokoto State over the recent mindless killings by bandits and terrorists.\nSince he assumed office on May 29, 2015, Buhari has issued scores of condolences in reaction to attacks by terrorists, bandits and other gunmen.\nAccording to the state government, in 2021, bandits killed 1,192 and kidnapped 3,348 people in Kaduna alone.\nIn October, bandits stormed a market in Sokoto State and killed 30 persons."
  },
  {
    "headline": "Soyinka In Benin Republic To Visit Igboho",
    "summarized_story": "Nobel laureate, Prof. Wole Soyinka, has travelled to Cotonou, Benin Republic to visit Yoruba Nation agitator, Sunday Adeyemo, known as Sunday Igboho.\nLEADERSHIP gathered that the literary icon was seen at the Seme border around noon on Sunday, crossing to Cotonou, the capital city of Benin Republic.\nHis response, according to travelers, was that he was on a visit to Sunday Igboho to break the Muslim fast with him.\nIgboho spent eight months in prison before he was released by the Benin Republic government, but he is not allowed to leave the country.\nHe had been at the forefront of agitation for the Yoruba Nation in Nigeria until his house was invaded by the Department of State Services (DSS) in Ibadan."
  },
  {
    "headline": "Ramadan: Tinubu Distributes Bags Of Rice, Sugar To Over 50,000 Families",
    "summarized_story": "Asiwaju Bola Ahmed Tinubu, in the spirit of charitable giving that accompanies the Ramadan season distributed sacks of Rice and Sugar to over 50,000 families across Nigeria.\nThe distribution of these items which began last week, put smiles on the faces of beneficiaries with many expressing thanks through prayers for Asiwaju.\nSpeaking about Ramadan earlier in April, the former Lagos governor emphasised on the need to “contribute to the wellbeing of those around us, give succor to people we find in need and study more how to solve problems instead of creating them,”.\nHe added: “Let us keep in the forefront of our minds that Ramadan also asks of us to show greater compassion, empathy and understanding, and enlightenment in how we treat and relate to one another.”ADVERTISEMENT“Ramadan asks of all of us to embrace acts of kindness, love our neighbors and reach out to the poor, needy and unfortunate among us.”“Our nation is one gifted by Allah with bountiful resources and a good and decent people.”ADVERTISEMENT"
  },
  {
    "headline": "Ramadan: Tinubu Distributes Bags Of Rice, Sugar To Over 50,000 Families",
    "summarized_story": "Asiwaju Bola Ahmed Tinubu, in the spirit of charitable giving that accompanies the Ramadan season distributed sacks of Rice and Sugar to over 50,000 families across Nigeria.\nThe distribution of these items which began last week, put smiles on the faces of beneficiaries with many expressing thanks through prayers for Asiwaju.\nSpeaking about Ramadan earlier in April, the former Lagos governor emphasised on the need to “contribute to the wellbeing of those around us, give succor to people we find in need and study more how to solve problems instead of creating them,”.\nHe added: “Let us keep in the forefront of our minds that Ramadan also asks of us to show greater compassion, empathy and understanding, and enlightenment in how we treat and relate to one another.”ADVERTISEMENT“Ramadan asks of all of us to embrace acts of kindness, love our neighbors and reach out to the poor, needy and unfortunate among us.”“Our nation is one gifted by Allah with bountiful resources and a good and decent people.”ADVERTISEMENT"
  },
  {
    "headline": "Nwajiuba Urges ASUU To Call Off Strike",
    "summarized_story": "Minister of State Education and All Progressives Congress (APC) presidential aspirant Hon.\nChukwuemeka Nwajiuba, yesterday appealed to Academic Staff Union of Universities (ASUU) to call off their strike to enable the students to return to their studies.\nNwajiuba, in a statement felicitating with Nigerian workers on May Day, said the government is ready to dialogue with them towards meeting their demands.\nADVERTISEMENT“The resilience of Nigerian workers is to be admired and encouraged.\nI completely identify with your struggle and wish to encourage our labour and union leaders to show great forbearance in this moment of national transformation."
  },
  {
    "headline": "Nwajiuba Urges ASUU To Call Off Strike",
    "summarized_story": "Minister of State Education and All Progressives Congress (APC) presidential aspirant Hon.\nChukwuemeka Nwajiuba, yesterday appealed to Academic Staff Union of Universities (ASUU) to call off their strike to enable the students to return to their studies.\nNwajiuba, in a statement felicitating with Nigerian workers on May Day, said the government is ready to dialogue with them towards meeting their demands.\nADVERTISEMENT“The resilience of Nigerian workers is to be admired and encouraged.\nI completely identify with your struggle and wish to encourage our labour and union leaders to show great forbearance in this moment of national transformation."
  },
  {
    "headline": "Osinbajo, Lawan, others pay Sallah homage to Buhari (Photos)",
    "summarized_story": "President Muhammadu Buhari on Monday received about 100 visitors who came to pay Sallah homage to him at the State House, Abuja.\nSome of those present were the Vice President, Yemi Osinbajo; Senate President, Ahmad Lawan; Secretary to the Government of the Federation, SGF Boss Mustapha; Onna of Abaji HRM Alhaji Adamu Baba Yunusa and Chief Imam of National Prof Galadanci.\nThere were also the Central Bank of Nigeria, CBN, Governor, Godwin Emefiele; Minister of FCT Mallam Muhammad Musa Bello; Minister of State Hajiya Ramatu Tijjani Umar; HRM Alhaji Adamu Baba Yunusa and the Special Adviser, Media and Publicity, Mr Femi Adesina, among others.\nNote: All photos by Sunday Agbaeze"
  },
  {
    "headline": "Abe insists on primary for selection of Rivers APC governorship candidate",
    "summarized_story": "By Okafor Ofiebor/RiversFormer representative of Rivers South East Senatorial District at the National Assembly, Senator Magnus Abe, has insisted that he will contest for the primary of All Progressives Congress, APC for the selection of the party’s governorship candidate for the state.\nA governor who understands that they are the reason this country was created and the reason why Rivers State exist.\nSenator Abe recalled that since Rivers State was created in 1967, no Ogoni son or daughter has ever been a governor, deputy governor, Speaker of the Rivers State House of Assembly nor the Chief Judge, which according to him could not have been a coincidence.\nHe said, there are three senatorial districts in Rivers State, the Rivers West, Rivers East and Rivers South-East Senatorial Districts.\nBut in all, only the Rivers South-East Senatorial District was yet to produce a governor."
  },
  {
    "headline": "Nigerians Don’t Want Baits, Failed Promises – Redeemed Church, RCCG Speaks On Osinbajo’s 2023 Bid",
    "summarized_story": "The Directorate of Politics and Governance, a political department set up by the Redeemed Christian Church of God (RCCG), has begun canvassing support for Vice President Yemi Osinbajo’s presidential bid.\n“As of today, Pastor Yemi Osinbajo is not just a pastor; he is still a child of God,” he said, according to Peoples Gazette.\nSpeaking to journalists at the inaugural conference of a political movement called New Era Nigeria (NEN), Olaniyan said the country deserved an honest leader.\nWhat we want is not those baits, we want somebody that would make a promise to our children and fulfil it,” he explained.\nWeeks after the department’s creation, the RCCG general overseer, Enoch Adeboye, said he was politically neutral and would not mobilise support for any political party because they are all his “sons.”"
  },
  {
    "headline": "Buhari Shamefully Returns To Twitter, Claims Boko Haram, Bandits, Others Downgraded Despite Continued Killings, Abductions",
    "summarized_story": "President Muhammadu Buhari on Monday tweeted for the first time after Twitter operations were formally restored in Nigeria.\nThe Buhari-led government had on June 4, 2021, announced the suspension of Twitter in Nigeria.\nTelecommunications companies started blocking access to Twitter on June 5, after they received a directive from the Nigerian Communications Commission to block access to Twitter.\nThe suspension by the Nigerian government came days after a post by Buhari on the 1967 civil war was deleted by the microblogging platform.\nThe victim was said to be eight months pregnant in March 2022 when she was abducted alongside others when bandits attacked the train."
  },
  {
    "headline": "PHOTOS: Kemi Adeosun visits Obasanjo in Abeokuta",
    "summarized_story": "Kemi Adeosun, former minister of finance during the first term of President Muhammadu Buhari has visited former President Olusegun Obasanjo in Abeokuta, Ogun state, on Sunday.\nAdeosun was accompanied by Adeseye Senfuye, former accountant-general of Ogun state, and Wale Adeosun, chief executive officer of Kuramo Capital.\nDetails of their meeting was not made public but reports monitored by this news platform revealed it could have to do with a project the former minister is promoting.\nSee pictures below."
  },
  {
    "headline": "GAC’s Endorsement Not An Automatic Ticket For Sanwo-Olu, Others – Lagos APC",
    "summarized_story": "The Lagos Chapter of the All Progressives Congress (APC) has said that the Governor Advisory Council (GAC) endorsement of the second term ambition of the state governor, Babajide Sanwo-Olu, does not foreclose the ambition of anyone aiming to challenge him for the seat since the pronouncement does not translate to an automatic ticket.\nLagos APC’s stance was confirmed by its Acting Publicity Secretary, Yesiru Karamo, through a statement made available to newsmen across the state.\nThe acting publicity secretary stated that while they welcome former members who hitherto for other parties, the Lagos APC would not allow unnecessarily heat the polity with unguided utterances.\n“The process of reconciliation is also especially in Lagos State making steady progress.\n“As a party, we remain proud of the landmark achievements of Lagos State Governor, Babajide Sanwo-Olu."
  },
  {
    "headline": "2023: I will hand over to Nigerians’ elected choice – Buhari",
    "summarized_story": "The president assured of his readiness to hand over to the democratically elected president in 2023.\nResponding to questions after he returned to the Presidential Villa after the prayers, the President said his administration would continue to work to make the country safe for Nigerians.\nOn the 2023 general elections, the President reaffirmed his commitment to free, fair and transparent process.\nSpecial prayers were offered for an end to the various challenges bedeviling the country, peaceful 2023 elections, as well as sustainable national unity, stability and prosperity.\nAbubakar, who said this in his Eid-el-Fitr Sallah message to Nigerians in Sokoto, urged politicians to allow peace to reign in the country."
  },
  {
    "headline": "Breaking: In Zamfara, commissioner quits Matawalle’s cabinet",
    "summarized_story": "Zamfara state commissioner of religious affairs and Chief Imam of Muslim Foundation Juma’at Mosque in Gusau Dr. Sheik Tukur Sani Jangebe has resigned his appointment.\nThis is contained in a letter dated May 1, 2022 which was signed by him and made available to Blueprint in Gusau Monday.\nPart of the letter reads, “His excellency may wish to note that, I Dr. Sheik Tukur Sani Jangebe tender my vuluntary resignation letter as Hon.\nCommissioner for religious affairs today 1st May, 2022.\n“I wish to express my propound gratitude to Governor Bello Mohammed Matawalle for the opportunity accorded to me as commissioner and member of the state executive, and I will continue praying for the success of your administration,” he said."
  },
  {
    "headline": "Again, gunmen go on rampage, kill brothers, 2 others in Anambra communities",
    "summarized_story": "Barely four days after gunmen killed five persons at a drinking joint in Osumenyi and a policewoman in Ukpor, all in Nnewi South Local Government Area (LGA) of Anambra state, another set of hoodlums in the early hours of Monday, killed four more people in different parts of the state.\nSome video clips trending on social media showed that two of the victims were killed in Ukpor, the headquarters of Nnewi South LGA, while two others were murdered along Udorji road, beside St. Mary’s Church, Ozubulu, in Ekwusigo LGA.\nA source claimed that the gunmen first killed Nnajiofor right in their house when they invaded their home in the wee hours of Monday, and later blind-folded and abducted the younger brother, whom they eventually killed close to Utu junction and dumped his corpse at the centre of the road.\nThe Public Relations Officer (PPRO), Anambra State Police Command, DSP Ikenga Tochukwu, was yet to respond to the calls and texts sent for him to confirm the report as it press time.\nShare this: TwitterFacebook"
  },
  {
    "headline": "CBN Director, Dr. Tumala, formally joins Borno Senatorial race",
    "summarized_story": "By Onu OkorieA renowned finance expert and Director of Statistics of the Central Bank of Nigeria (CBN), Dr. Mohammed Musa Tumala, today collected his Nomination Form at the All Progressive Congress (APC) Secretariat in Abuja to formally express his interest in the 2023 Senatorial elections in Borno State.\nMohammed Tumala, is indicating his interest to serve us politically.\nHe was elected before into the House of Representatives and he served us to be best of his ability.\nSo, our joining him to collect his nomination form is to show we are strongly behind him and will cast our votes for him come 2023, insha Allah”, Mustapha assured.\nIt would be recalled that Dr. (Hon) Tumala had earlier been elected into the House of Representatives in 1992 and served until 1994 when the democratic regime was truncated by the military."
  },
  {
    "headline": "Afreximbank’s Awani makes Nigeria Annual’s “100 Leading Women” list",
    "summarized_story": "By Onu OkorieManaging Director of Afreximbank’s Intra-African Trade Initiative Division, Mrs. Kanayo Awani, has been named among the 100 outstanding women leaders in Nigeria, according to the list published in the 2022 edition of Nigeria Women Annual: 100 Leading Women.\nAs Managing Director, Mrs. Awani currently leads the Bank’s efforts in implementing its intra-African trade and industrialisation strategies.\nShe previously led Afreximbank’s Trade Finance and Branches Department from 2009 to 2016, growing it into the Bank’s most profitable department which accounted for over 80 percent of its loan book.\nMrs. Awani is also the Chairperson of the Africa Chapter of Factors Chain International (FCI), a global factoring association.\n“The Nigeria Women Annual: 100 Leading Women” is the premier qualitative profiling of phenomenal women who have contributed to the development of Nigeria and the world."
  },
  {
    "headline": "Firstbank creating sustainable socioeconomic value – Adeduntan",
    "summarized_story": "By Kehinde Ibrahim, LagosTHE chief executive officer of First Bank Nigeria Limited, Dr. Adesola Adeduntan on Friday said the bank, through FirstBank’s Agent banking proposition, is creating sustainable socioeconomic value and empowering rural communities in unique ways.\nHe said, ‘‘First Bank has created over 500,000 direct and indirect jobs to tackle unemployment through the FirstBank’s FirstMonie agent network.\n‘‘Over two million individuals have been economically impacted via the jobs created through the FirstBank’s FirstMonie agent banking proposition.\nOver 35,000 of FirstBank’s FirstMonie agents are women, enabling us to drive gender inclusive growth within rural communities.\nFirstBank recognises the critical role of women (both in rural and urban areas) in driving socio-economic growth."
  },
  {
    "headline": "MCO rated best digital innovation govt Agency",
    "summarized_story": "By Palma IleyeNigeria Mining Cadastre Office, NMCO, has been rated the best “Digital Innovation in the Federal Government” 5th .ng Award category for the year 2022 at an Award Night organized by Nigeria Internet Registration Association, NIRA.\nIn a press release issued yesterday by Head of Press, Mrs Sade Fatoke, the Director General, Mining Cadastre Office, Engr.\nObadiah Simon Nkom who received the award for his Agency stated that the award was a call for Mining Cadastre to always forge ahead and be committed to be able to achieve greater feat like the NIRA Award.\nHe said, “The reward for hard work is always more work, I will say this award is a call for more dedication and committment for MCO to continue until government’s desire for the Agency and the sector is fulfilled”.\nHe further stated “we will remain committed to professionism and we can only improve on this achievement and many more so that MCO can be the gateway to economy diversification as well as boost government’s revenue”."
  },
  {
    "headline": "FBNInsurance pays N16.1bn claims to customers in 2021",
    "summarized_story": "By Kehinde Ibrahim LagosONE of Nigeria’s leading insurance companies and the one adjudged the most profitable life insurance company in Nigeria has revealed that it paid ₦16.1 billion claims to its customers in year end December 31, 2021.\nWhile speaking on the company’s claims profile, the Managing Director/Chief Executive Officer, FBNInsurance Limited, Val Ojumah, disclosed that the company’s commitment to satisfying her clients is non-negotiable.\n“At FBNInsurance Limited, we are in the business of paying genuine claims that are due.\nSpeaking further, Ojumah reiterated that “Customer satisfaction is the fulcrum of insurance business, and this inevitably builds customer loyalty, and we will not fail to ensure this.\nWe believe once FBNInsurance is able to pay customers’ claims as they arise, numerous customers and the general public will have faith to take up more life policies because they are convinced that should a claim/loss arise, FBNInsurance will be able to meet its financial obligations to them”."
  },
  {
    "headline": "2023 Presidency: I’ll Hand Over To Whoever Nigerians Elect, Buhari Vows",
    "summarized_story": "President Muhammadu Buhari has downplayed claims that he has a favoured candidate for the 2023 elections, saying he will hand over to whoever Nigerians elect.\nAccording to Buhari, he has no special candidate to replace him next year.\nHe, instead, said the one who would succeed him is “the person that Nigerians elect”.\nThe Nigerian leader equally urged security agencies to redouble efforts in the fight against insecurity.\n“We’ll continue to make the environment secure, especially when the rainy season is coming so that farmers can go back to their farms and we wouldn’t have problems of food security,” Buhari said."
  },
  {
    "headline": "I Support IPOB’s Agitation But Not The Violence – Wike",
    "summarized_story": "Rivers State Governor, Nyesom Wike, on Monday said he supports the agitation by the proscribed Indigenous People of Biafra (IPOB) but not the violence associated with the group.\nWike, a frontline presidential aspirant of the Peoples Democratic Party (PDP), stated this during an interview on Channels Television’s Politics Today.\n“I support the agitations in the South-East, whether anybody likes it or not, I do,” Wike said.\nThere came a time IPOB was singing praises about Wike.\nThis Nnamdi Kanu was singing praises (that) Wike is our son.”"
  },
  {
    "headline": "Muslims In Nigeria Celebrate Eid-El-Fitr",
    "summarized_story": "Muslims in Nigeria on Monday joined their counterparts around the world to mark the Eid-El-Fitr – signalling the end of the fasting month of Ramadan.\nEid-El-Fitr means “festival of breaking the fast” and celebrations would normally begin, depending on the sighting of the moon.\nBut the Nigerian government declared Monday and Tuesday as public holidays to celebrate Workers’ Day and Eid-El-Fitr.\nHe, however, called on them to imbibe and practice the virtues of kindness, love, tolerance, peace, self-denial, sacrifice, and good neighbourliness, as exemplified by the Holy Prophet Muhammad (Peace be upon Him).\nHe wished all Muslims a happy Eid-el-Fitr celebration and prayed that the peace, blessings, and favours of Allah be with them."
  },
  {
    "headline": "PHOTOS: Muslims In Abuja Flood Praying Ground For Eid-El-Fitr",
    "summarized_story": "Muslims in Nigeria on Monday joined their counterparts around the world to mark the Eid-El-Fitr – signalling the end of the fasting month of Ramadan.\nThe event is quite different this year from those of 2020 and 2021 which were celebrated lowkey amid measures to curb the spread of COVID-19.\nEid-El-Fitr means “festival of breaking the fast” and celebrations would normally begin, depending on the sighting of the moon.\nREAD ALSO: Muslims In Nigeria Celebrate Eid-El-FitrThis year’s celebration coincides with the commemoration of the annual international Workers’ Day, and many would have expected the government to declare three days as public holidays.\nThe photos below capture some of the highlights of the Eid-el-Fitr prayer held at one of the praying grounds in the Federal Capital Territory."
  },
  {
    "headline": "NURTW Crisis: Lagos CP Meets MC Oluomo And Istijabah, Reads Riot Act",
    "summarized_story": "The Commissioner of Police in Lagos State, Abiodun Alabi, has met with two factional transport leaders in the state – Musiliu Akinsanya popularly called MC Oluomo; and Azeez Abiola, aka Istijabah.\nThe meeting was confirmed in a statement issued on Monday by the Police Public Relations Officer in the state, Benjamin Hundeyin.\nHe said the CP warned that anyone person found causing trouble anywhere within the state would be arrested and made to face the law.\nAccording to the police spokesman, Alabi separately met MC Oluomo and Istijabah in his office where “he admonished them to prevail on their teeming followers to act within the confines of the law, is poised to ensure the security currently being enjoyed in Lagos State remains intact”.\nMC Oluomo, formerly Lagos NURTW Chairman, has been in a conflict with Istijabah, the state chairman of the Tricycle Owners and Operators Association of Nigeria, an affiliate union of NURTW."
  },
  {
    "headline": "2023 Presidency: MASSOB leader, Uwazurike leads thousands of youths in solidarity march for Yahaya Bello -",
    "summarized_story": "The youths, who started the procession from the MASSOB leader’s House in Owerri, marched through the streets, carrying different placards, with inscriptions such as “Power to the Youths, Support Yahaya Bello”, “Youths Can Also Lead”, and “Yahaya Bello for the Youths”, among others.\nAccording to them, in this regard, Governor Bello is the right fit for the position of President of the Federal Republic of Nigeria.\n“All Nigerians should rally round the youthful Governor, Yahaya Bello.\nWe are supporting Yahaya Bello for this and no one else.\nWe must give youths a chance, especially one that has demonstrated uncommon capacity, in the person of Yahaya Bello,” he said."
  },
  {
    "headline": "British Member of Parliament to resign for Watching Porn in Parliament",
    "summarized_story": "A Conservative British Member of Parliament, Neil Parish, has announced that he will resign after admitting twice watching pornography in the House of Commons.\nParish told the BBC the first time he viewed the explicit material was an accident after searching online for farm vehicles.\nThe Government of Prime Minister, Boris Johnson, is engulfed in numerous scandals, just days ahead of crucial local elections.\nThe Prime Minister himself has been fined by police for breaching his own Covid rules during the 2020 lockdown, and faces an investigation into whether he misled Parliament about parties in Downing Street.\nWe support his decision to step down as our Member of Parliament.”"
  },
  {
    "headline": "Peterside asks Wike to release detained Farah Dagogo within 48 hours -",
    "summarized_story": "Wike on how he obtained evidence linking the lawmaker to an alleged disruption of proceedings at the Rivers State Secretariat of the Peoples Democratic Party, PDP.\n“Wike had lied at several times such that these days his claims must be subjected to forensic investigation before believed.\nWhile calling on lovers of democracy and free speech to condemn Wike and his fascist style of governance, Peterside reiterated his 48-hour ultimatum to Gov.\n“Wike has 48 hours to ensure that Honourable Farah is set free and allowed to continue to pursue his political aspiration.\nWike cannot be junketing in pursuit of his presidential ambition using Rivers State resources while wickedly gagging another’s on the altar of ego."
  },
  {
    "headline": "Asiwaju Tinubu Receives APC Presidential Nomination Forms -",
    "summarized_story": "The National Leader of the All Progressives Congress and Frontline Presidential Aspirant, Asiwaju Bola Ahmed Tinubu, has received his Expression of Interest and Nomination Forms to enable him participate in the Presidential Primaries of the Party.\nAsiwaju Tinubu who just returned to the Country after performing the lesser Hajj (Umrah) in Mecca received the forms from Lagos State Governor, Babajide Olusola Sanwoolu.\nHis support groups led by former Secretary to the Government of the Federation, Babchir Lawal, and Senator Dayo Adeyeye purchased the forms for him on Friday afternoon.\nThe Party’s Presidential Primaries will hold between the 30th of May and 1st of June.\nThe Party’s Presidential contest has become increassingly crowded in recent days with the declaration of the Vice President Yemi Osinbajo, Governors Yahaya Bello of Kogi State and Kayode Fayemi of Ekiti State, Senators Ibikunle Amosun and Chris Ngige, Minister of Transportation, Rotimi Amaechi, Minister of Education, Chkwuemeka Nwajiuba and Others."
  },
  {
    "headline": "Senator Boasts Of Writing Electoral Act For Self Benefit+Rapture Pastor Revealed- Trending With Ojy Okpe",
    "summarized_story": "A video showing the Deputy Senate President.\nSenator Ovie Omo-Agege admitting publicly that he wrote the Electoral Act of 2022 because of the politics of Delta state has gone viral on social media.\nTrevor Noah mixed pop culture with politics over the weekend as he made a joke about Will Smith’s famous Oscars slap at the White House correspondent dinner.\nNoah ended his remarks with some thoughts on the beauty and benefits of press freedom in America especially during the Russian invasion of Ukraine.\nThe photograph used in our broadcast last week was that of pastor Adetunmbi Taiwo Adewami and not that of pastor Abraham, we apologize for the mix up."
  },
  {
    "headline": "‘Nigeria Has One Major Problem: Insufficient Funds’ – Rochas Okorocha",
    "summarized_story": ""
  },
  {
    "headline": "Chris Ngige: I’m Qualified to Be President, With 42 Years of Experience in The Civil Service",
    "summarized_story": ""
  },
  {
    "headline": "Civilians Evacuated from Ukraine’s Mariupol as Russia Renews Shelling",
    "summarized_story": "But Russian forces resumed shelling the steel works on Sunday as soon as the buses had left the plant, a city official said.\nAround 100 civilians evacuated from the Azovstal steelworks were due to arrive in the Ukrainian-held city of Zaporizhzhia, 230 km northwest of Mariupol, on Monday.\nMore than 50 civilians arrived at a temporary accommodation centre in Russian-controlled territory on Sunday after escaping from Mariupol, a Reuters photographer said.\nUkraine and the West say Russia launched an unprovoked war of aggression that threatens to spiral into a much wider conflict.\nIn Russia, two explosions took place on Monday in Belgorod, a southern region bordering Ukraine, governor Vyacheslav Gladkov said."
  },
  {
    "headline": "Modele Sarafa-Yusuf: I’m Not Ready To Do Politics as Usual, Which Informed My Declaration Venue",
    "summarized_story": "APC Governorship aspirant in Ogun state, Modele Sarafa-Yusuf speaks about her ambition to depose incumbent governor Dapo Abiodun to become the first female elected governor of Ogun State, even as she accused the government of vandalising her campaign posters and billboards.\nRelatedStories No Content Available"
  }
]