[
  {
    "headline": "Suspected kidnappers implicated me for fighting violent crimes – ABU former CSO",
    "summarized_story": "A former chief security officer of the Ahmadu Bello University, Zaria, Kaduna State, Mr Sheu Bello, has accused some suspects arrested in connection with kidnappings in the institution of implicating him.\nHowever, Bello, well known as Danlamin, debunked his involvement in the kidnappings in an interview with our correspondent during the week.\nThat was the post I held until I became the acting Chief Security Officer of the university in 2020.\n“When I was the CSO, I worked with security agencies, including the IRT and Special Tactical Squad.\nHe was acting CSO and was redeployed."
  },
  {
    "headline": "Ogun cargo airport ready for inauguration next year –Abiodun",
    "summarized_story": "Ogun State Governor, Dapo Abiodun, on Saturday, said the ongoing Agro-Allied Cargo Airport located at Ilishan-Remo, Ikenne Local Government Area, would be ready for inauguration by the end of 2022.\nAbiodun and his predecessor, Senator Ibikunle Amosun, had locked horns over the nature and location of the airport project in the state.\nThe governor made a case for an Agro-Allied Cargo airport located at Ilishan-Remo, Ikenne LGA, while Amosun strongly backed a passenger airport located at Wasimi, Ewekoro LGA of the state.\nAddressing party stalwarts and residents of Ikenne LGA, Abiodun said he would not bow to opposition.\nThe governor later led his campaign train to the site of the airport project, with the promise that it would be ready for use next year."
  },
  {
    "headline": "Why logistics will power AfCFTA and Africa’s e-Commerce export potential",
    "summarized_story": "Despite the conflicting outcomes of Covid-19, Africa’s e-Commerce remains on a high innovation, high-growth trajectory, owing to the convergence of key indicators: the continent’s demographics, internet and mobile penetration potentials, digital transformation and ecosystem maturity.\nEvidence of the continent’s digital logistics innovations can be seen broadly across the key e-Commerce markets.\nKenya-based Africa Logistics Properties claims it has developed over 1.5 million square metres of warehousing available for rent in emerging markets over the past 10 years.\nSouth Africa’s ACT Logistics offers multi-modal freight services, pick-and-pack warehousing and export services aggregating transportation, clearing and warehousing as its suite of services.\nThese innovations will democratise access to flexible and effective logistics solutions, building the critical ecosystem required for Africa’s advancement in intra-regional and global export."
  },
  {
    "headline": "Africa House Empowers 10 Startups with $1M Entrepreneurial Support",
    "summarized_story": "Olakunle Soriyan Startup accelerator Africa House, in partnership with the Platform Capital Group, is set to invest in 10 enterprises with an aggregated $1 million in funding, technical and business assistance, and in-kind benefits that will propel them towards entrepreneurial success at the highest level.\nLaunched recently in Plano, Texas and commissioned by the Senior Pastor, Potters House, Dallas, Texas, Bishop TD Jakes, the Platform Capital and Eshirya Africa partnership links investors with and provides a support ecosystem for entrepreneurs and innovators of African descent including African-Americans, to actualize their business ambitions and play their role in the global curating of the Africa of their dreams.\nIts Africa House Fund Pitch Contest is designed to equip startups with global access to offices, networks, mentorship, training, events, funding and resources that will keep them competitive without the usual limiting barriers."
  },
  {
    "headline": "Adeboye on TB Joshua: We shall meet on resurrection day",
    "summarized_story": "The letter was dated June 15, 2021 and signed by the General Overseer òf RCCG and was made known to the media recently.\nIn the letter addressed to Mrs Evelyn Joshua, Adeboye said he joined millions of people worldwide to register the church’s condolence with her on the passing of her husband.\nHe said he believed he would meet Joshua at the feet of the Lord Jesus on the resurrection morning.\n“We take solace in the Lord, believing that we shall meet again at the feet of the Lord Jesus on the resurrection morning.\nAdeboye, General Overseer,” he said."
  },
  {
    "headline": "Police arrest 2 armed robbers in Imo",
    "summarized_story": "By Chinonso AlozieThe Imo State Police Command on Friday, paraded one Darlington Ogubike 36-year-old and Ihuoma Emeriole 25-year-old, males, both from Umuevu, Onitsha in Ezinihitte Mbaise Local Government Area of Imo State, for an alleged series of armed robbery activities in the Ezinihitte area.\nThe State Commissioner of Police, Abutu Yaro, said in Owerri, that the suspects were arrested at their camp in Umuevu in Ezinihitte.\nFurthermore, the Police said from the preliminary investigation conducted on the arrested suspects that useful information had been gathered that would lead to the arrest of other fleeing suspects.\nAccording to the Police,”On 14/7/2021 at about 17:30 hours based on credible information, that a gang of armed robbers that have been terrorising Mbaise and its environs were sighted at Umuevu Onitsha Ezinihitte Mbaise Local Government Area in Imo State.\n“The command tactical teams mobilised and raided the criminal hideout where one Darlington Ogubike age 36 years and Ihuoma Emeriole age 25 years both of Umuevu Onitsha Ezinihitte Mbaise LGA were arrested."
  },
  {
    "headline": "ANAMBRA 2021: APGA, APC, PDP crises deepen",
    "summarized_story": "…As Nwankpo, ADC shineBy Nnamdi OjiegoFOUR months to the November 6, 2021, governorship election in Anambra State, old front runners have given way to new champions.\nPDPPDP conducted a parallel primary election which produced Senator Ugochukwu Uba and Mr. Valentine Ozigbo as winners.\nEver since he emerged as ADC governorship candidate, the party has come alive in Anambra State as the possible alternative to APGA.\nHe left when leaders of the party imposed Mr. Peter Obi as the party’s governorship candidate in 2003.\nWill protest votes and Nwankpo/Ughamadu’s goodwill help ADC supplant APGA and win the Anambra State governorship seat come November 6?"
  },
  {
    "headline": "My family will not appear in court",
    "summarized_story": "The family of Nnamdi Kanu, the Indigenous People of Biafra, IPOB leader has given reason they would be absent in court.\nEmmanuel Kanu, the brother of detained leader of IPOB, said until the family gets authentic information about how Kanu was abducted they are not prepared to go to court.\nHe added that he does not believe in a fair hearing for the Biafran leader as only those from ‘Fulani Extraction’ are given fair hearing in Nigeria.\nEmmanuel, speaking to the Nation, said, “Until there are calcifications concerning his extraordinary rendition, we (immediate family members) are not prepared to come to court.\nMeanwhile, Aloy Ejimakor, lawyer to Nnamdi Kanu, has insisted that there will be no trial for the Biafra agitator."
  },
  {
    "headline": "Ex-JAMB Registrar, Ojerinde released on bail after 10 days in Prison",
    "summarized_story": "The former Registrar of the Joint Admission and Matriculation Board (JAMB), Professor Lawrence Adedibu Ojerinde has at last been released on bail after spending 10 days at the Suleja prison in Niger State.\nDAILY POST learnt authoritatively that the former JAMB Registrar stepped out of the prison in the evening when his bail file approved on Friday by Justice Obiora Egwatu got to the prison authorities.\nOjerinde reportedly joined his family members and friends thereafter when the Suleja prison authorities acted on the endorsement of Egwuatu.\nAlhaji Jamiyu Opeyeru, one of the close associates of former JAMB Registrar confirmed to DAILY POST that his friend has breathed the air of freedom.\n“I can confirm to you that Professor Ojerinde, the Asiwaju, has just been released on bail."
  },
  {
    "headline": "Buhari approves establishment of Agricultural institute in Nasarawa",
    "summarized_story": "President Muhammadu Buhari has approved the establishment of the Agricultural Machinery and Equipment Development Institute in the state.\nSule said the institute would be located in Lafia as a step forward in terms of industrializing the state.\n“In fact I woke up this morning extremely happy because last night I receive the approval from Mr President for the setting up of the Agricultural Machinery and Equipment Development Institute right here in Lafia.\n“I want to use this opportunity to extend my greatest appreciation to President Muhammadu Buhari.\n“I now wrote for the establishment of the institute in the state and just yesterday, Mr President approved it and we are going to establish that institute right here in lafia,” he said."
  },
  {
    "headline": "Suspected kidnapper nabbed over attempt to abduct students in Ondo",
    "summarized_story": "A suspected kidnapper has been arrested for attempting to kidnap some secondary school girls in Ondo State.\nThe suspected kidnapper identified as Gbadamosi Sani was apprehended after forcefully whisking two students of Fiwasaye Girls Grammar School, Akure, the state capital away.\nIt was gathered that the suspect had disguised as a commercial motorcyclist, commonly known as Okada rider waiting for unsuspecting students around the school when the two students unknowningly requested for his service.\nPolice arrest two students for threatening to kidnap principal, studentsSani took the students from Mobil filling station, Oba-Ile/Airport road, opposite their school to Ijoka area in the metropolis.\nThe pastor alerted men of the Olofin Police Division who nabbed him the Okada rider after trailing him."
  },
  {
    "headline": "Adeyanju queries Obi Cubana’s source of wealth",
    "summarized_story": "Deji Adeyanju, popular Nigerian activist has joined those questioning the source of Obi Cubana’s wealth.\nObi Cubana went viral on Friday on social media after he hosted a lavish star-studded burial ceremony for his late mother.\nAdeyanju on his Twitter page called for caution as he opined that richest men don’t throw money the way it ‘rained’ at the burial ceremony at Oba, Anambra state.\n“Even the richest men in the world won’t throw money up and down anyhow.\nMy mum’s burial will make some people hungry to die – Obi Cubana“Don’t allow anyone put you under pressure of any kind."
  },
  {
    "headline": "Insecurity: Nigeria’s UK envoy meets Yoruba, Igbo leaders in London",
    "summarized_story": "Agency ReporterThe Nigerian High Commissioner in London, Mr. Sarafa Isola, met with eminent Yoruba leaders and Ohanaeze Ndigbo in London on Friday to dialogue on current security issues in Nigeria.\nADVERTISEMENTThe Yoruba and Igbo leaders at the meeting reiterated their belief in the unity of Nigeria and the need to preserve it as a corporate entity.\nThe Igbo leaders called for the enthronement of equity, justice and fairness in the country, where the Igbo would be accorded their rightful position in the Nigeria project.\nOn their part, the Yoruba leaders also spoke on the need for Nigeria’s unity, adding that the Yoruba people would continue to remain in Nigeria.\nThe Yoruba representatives were led to the meeting by Chief Adebayo Oladimeji, a Chartered Biologist and Chairman of Nigerian Elders in the UK."
  },
  {
    "headline": "Kano cleric Kabara charged with blasphemy, incitement",
    "summarized_story": "Kano controversial Islamic preacher, Sheikh Abduljabbar Kabara, has appeared before an Upper Sharia Court at Kofar Kudu, Kano, charged with blasphemy, incitement and sundry offences.\nThe Kano State Government, which is prosecuting the accused person, said he made controversial religious commentaries and statements which are regarded as mortifying the companions and the Holy Prophet Muhammad.\nADVERTISEMENTInformation Commissioner Muhammed Garba said in Kano that the decision to take court action followed the receipt of the First Information Report from the police by the Office of the Attorney General and Commissioner for Justice.\nQadi Ibrahim Sarki-Yola adjourned the case to July 28, while the scholar would remain in police custody until Monday July 19 2021, when he would be remanded in prison till the adjourned date."
  },
  {
    "headline": "Defection saga: Don’t dare me, Matawalle warns deputy",
    "summarized_story": "The gulf appears to be widening between Zamfara Governor, Bello Matawalle, and his deputy, Mahdi Aliyu, after the Governor threatened to give the deputy governor “the treatment he deserves” if he dared him.\nADVERTISEMENT“As governor of the state, I promised to work together with the deputy governor irrespective of our political affiliations.\nBut I won’t tolerate a disrespectful attitude from him.”Speaker Nasiru Magarya, had faulted Aliyu for holding the rally.\n“It is wrong for the deputy governor to hold a political rally in this critical time,” he said.\nThe apex court, according to him, awarded the electoral victory in 2019 to the PDP and not just its candidates."
  },
  {
    "headline": "#EndSARS: Lagos panel gets another three-month extension",
    "summarized_story": "The Nation reported on Monday that the three- month extension was likely to enable the panel conclude its mandate.\nThe panel, inaugurated by Governor Babajide Sanwo-Olu on October 27, 2020, has already spent almost nine months, including the first three-month extension it got in March.\nThis fresh extension means the panel will now sit until October 19, a day before the anniversary of the October 20, 2020 shootings at the Lekki tollgate.\nADVERTISEMENTThe initial six months sitting of the panel expired on April 27, 2021, and the panel was granted a three-month tenure extension which is supposed to expire on Monday, July 19.\nAt Friday’s sitting, the panel heard 11 petitions."
  },
  {
    "headline": "42 killed, 338 houses burnt in latest Zango Kataf attacks – Atyap leaders",
    "summarized_story": "From Sola Ojo, KadunaAtyap Community Development Association (ACDA) on Saturday said 42 persons were killed, 7 wounded and 338 houses set ablaze in the latest attacks in several communities in Zangon Kataf local government area of Kaduna State.\nSamuel said, “in all the attacks in the 12 different villages as of July 15, 2021, a total of 42 people were killed and 338 houses burnt with 7 people wounded.\nHe continued, “with all these being said, in concrete terms we can submit that the resolution of our desire for peace is under threat by this Fulani Militia.\nBut as I am talking to you, Fulani Militias still graze in Atyap land with AK47 hung on their shoulders and shot at any sight of a Kataf man.\n“These whole things look like the Fulani Militia wants to grab and occupy our land."
  },
  {
    "headline": "Kalu greets APGA Chairman, Chief Victor Ike Oye at 65",
    "summarized_story": "Former Governor of Abia State and Chief Whip of the Senate, Dr. Orji Kalu has felicitated with National Chairman of All Progressives Grand Alliance (APGA), Chief Victor Ike Oye on the occasion of his 65th birthday anniversary.\nDescribing the celebrant as a seasoned administrator, consummate politician and cerebral academician, Kalu urged Oye to sustain his good deeds in the service of humanity.\nThe former Governor recalled his age-long relationship with the celebrant, who was one-time his close aide, adding that Oye is hardworking, humble and courageous.\nIn a birthday message, Kalu joined family, friends and associates of Oye in celebrating the remarkable accomplishments of the celebrant.\nHe said, “on behalf of the people of Abia North Senatorial district, I congratulate the National Chairman of the All Progressives Grand Alliance (APGA) as he clocks 65."
  },
  {
    "headline": "Tokyo Olympics: Nigerian delegate hospitalised with COVID-19",
    "summarized_story": "A Nigerian Olympic delegate became the first visitor to the Tokyo Games admitted to hospital with COVID-19, broadcaster TV Asahi said on Friday, as Japan battles to stem rising local infections a week before the showpiece event starts.\nThe individual, a non-athlete in their 60s, tested positive on Thursday evening at the airport with mild symptoms but was hospitalised because of age and pre-existing conditions, the broadcaster said, without giving details.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "Are you a landlord or tenant in Lagos? These are things you should know",
    "summarized_story": "For such purpose, the tenancy laws of Lagos State were enacted on August 5, 2011 at the Lagos State House of Assembly and signed by the then governor, Babatunde Fashola on August 24, same year.\n7 Laws of Lagos State 2003 and the newly enacted Tenancy Laws of Lagos State 2011 are the current laws regulating tenancies in Lagos State.\nIt is unlawful for a landlord or his agent to demand or receive from a would-be tenant rent in excess of one year in respect of any.\nThey must know that there must be an agreement between the landlord and tenant on rent increment as opposed to just informing the tenant.\nEviction of a tenantThe first step to evict a tenant in Lagos State is to issue what is referred to as the statutory notices."
  },
  {
    "headline": "Forget it, younger lovers are nightmares – Ruth Eze",
    "summarized_story": "For seasoned Nollywood actress, Ruth Eze who turned a year older yesterday, one of her worse nightmares was dating a younger lover.\nI dread to remain single but I don’t ever want to have anything to do with a younger lover; just forget it!\nI’ll pick money over sex and love because without money, love becomes sour.\nNo sweet love without money.”Ms Eze, however, says she would love to change certain things about herself as she grows older.\nI felt like crying.”Breaking News, Nigerians can now work in Nigeria and get paid in US Dollars, click hereto apply today."
  },
  {
    "headline": "FG Puts FCT, Six States on Red Alert over COVID-19 Third Wave",
    "summarized_story": "Olawale AjimotokanThe Federal Government has put six states and the Federal Capital Territory (FCT) on red alert as part of the preventive measures against a third wave of COVID-19.\nIn addition to the FCT, the six states are Lagos, Oyo, Rivers, Kaduna, Kano and Plateau.\nThe Chairman PSC, who also doubles as the Secretary to the Government of the Federation, Mr Boss Mustapha, signed the statement.\nHe said the steps were critical as there were worrisome early signs of increasing cases in the country.\nIt reminded Nigerians and all residents to ensure they stay safe at all time."
  },
  {
    "headline": "FG to Take Possession of Repatriated Benin Artifacts",
    "summarized_story": "The remarks came on the heels of the controversy between the Oba of Benin, Ewuare II and the Governor of Edo State, Mr Godwin Obaseki over who should take possession of the artefacts.\n“Gentlemen, the Federal Government is aware of the widely-reported controversy on who will take possession of the Benin Bronzes when they are returned from Germany.\nHe said the antiquities consisted of two important Benin Bronzes and an exquisiteIfe Bronze head.\n– In March 2021, the University of Aberdeen in Scotland agreed to return a Benin Bronze from its collections.\n– The University of Cambridge in the United Kingdom has also agreed to return a disputed Benin artefact."
  },
  {
    "headline": "Buhari: Nigeria’s Challenges will Come to an End",
    "summarized_story": "By John ShiklamPresident Muhammadu Buhari has said that he is convinced that the challenges confronting Nigeria will certainly come to an end.\nBuhari stated this Saturday at the wedding of the son of the Taraba State Governor, Mr. Darius Ishaku, at the Anglican Church, Katsina road, Kaduna.\nThe president said: “I am so convinced today that the challenges we face as a nation will certainly come to an end.\n“So what it tells me is that together, we stand united to be able to confront the challenges and of course the enemies of the state.\nThe traditional rulers from Taraba, Gombe States and other states who are all here – senators, members of House of Representatives and members of Taraba State House of Assembly."
  },
  {
    "headline": "House Adopts E-Transmission of Results ‘Where Practicable’, Opposition Walks Out",
    "summarized_story": "Adding his voice, Deputy Minority Leader, Toby Okechuckwu said statistically, according to NCC reports, NCC had coverage for 109,000 polling units out of 119,000 polling units in 2018.\nHe further clarified that the issue of electronic transmission of results has nothing to do with opposition lawmakers because Hon.\nMark Gbillah said that, as an expert in the industry, transmission of results does not have to be by broadband.\nSix months is all it takes to cover 8,000 polling units.\nUbale Maska said Nigeria does not have an adequate network covering the 119,000 polling units across the country to enable the seamless electronic transmission of election results."
  },
  {
    "headline": "FG Approves N6.25bn to Kick start Cattle Ranching in Katsina",
    "summarized_story": "*N5bn already releasedDeji Elumoye in AbujaThe federal government has approved N6.25 billion to kick start cattle ranching in the country with Katsina state serving as the pilot scheme.\nPresidential spokesman, Garba Shehu, in a release on Friday, stated that already, N5 billion has been released to Katsina State government for the take off of the project.\nGovernor Bello Masari of Katsina State, who was quoted to have made this disclosure in Dustin-ma, Katsina State on Friday, said the state will lead the way in setting up ranches in Nigeria.\nHis words: “Mr President has graciously approved the sum of N6.25 billion for ranch development purposes in Katsina State.\nThe governor thanked the President for commissioning the Zobe Regional Water Project, and 50km Dutsinma-Tsaskiya road in Dutsin-ma Council."
  },
  {
    "headline": "CORE Demands Release Of Five #BuhariMustGo Protesters, Nnamdi Kanu",
    "summarized_story": "The Coalition for Revolution (CORE) has asked the Department of State Services (DSS) to release the five youths that were arrested for wearing #BuhariMustGo branded shirts.\nCORE, in a statement on Saturday by Baba Aye and Gbenga Komolafe, Co-conveners of the movement, also condemned the arrest of Indigenous People of Biafra (IPOB) leader, Nnamdi Kanu.\nThe regime's lies about the extent of that dastardly demonstration of state terrorism have been torn aside at the Lagos State panel.\n“Evidence of the killing of at least 98 people has been presented to the Lagos State panel, with autopsy reports backing these.\nConsequently, the Lagos panel intends to wind up proceedings by 19 July, despite tons of unresolved cases before it."
  },
  {
    "headline": "CORE Demands Release Of Five #BuhariMustGo Protesters, Nnamdi Kanu",
    "summarized_story": "The Coalition for Revolution (CORE) has asked the Department of State Services (DSS) to release the five youths that were arrested for wearing #BuhariMustGo branded shirts.\nCORE, in a statement on Saturday by Baba Aye and Gbenga Komolafe, Co-conveners of the movement, also condemned the arrest of Indigenous People of Biafra (IPOB) leader, Nnamdi Kanu.\nThe regime's lies about the extent of that dastardly demonstration of state terrorism have been torn aside at the Lagos State panel.\n“Evidence of the killing of at least 98 people has been presented to the Lagos State panel, with autopsy reports backing these.\nConsequently, the Lagos panel intends to wind up proceedings by 19 July, despite tons of unresolved cases before it."
  },
  {
    "headline": "BREAKING: Suspected Fulani Herdsmen In ‘Custom Uniform’ Currently Attacking Oyo Community, Igangan",
    "summarized_story": "Igangan, a southern Oyo town that shot to prominence amid Yoruba-Fulani tensions early this year, is currently under attack again, SaharaReporters has gathered.\nA source said the gunmen, who disguised in custom uniform, stormed the town on Friday night, shooting sporadically.\n“Igangan is under attack presently, the attackers wore a custom uniform to deceive the villagers,” he said.\nThe latest attack is coming a few weeks after over 20 people were killed when gunmen suspected to be Fulani herders attacked the community.\nSunday Adeyemo, popularly known as Sunday Igboho, had in February issued an eviction notice to herders in the area, after blaming them for insecurity in the area."
  },
  {
    "headline": "BREAKING: Suspected Fulani Herdsmen In ‘Custom Uniform’ Currently Attacking Oyo Community, Igangan",
    "summarized_story": "Igangan, a southern Oyo town that shot to prominence amid Yoruba-Fulani tensions early this year, is currently under attack again, SaharaReporters has gathered.\nA source said the gunmen, who disguised in custom uniform, stormed the town on Friday night, shooting sporadically.\n“Igangan is under attack presently, the attackers wore a custom uniform to deceive the villagers,” he said.\nThe latest attack is coming a few weeks after over 20 people were killed when gunmen suspected to be Fulani herders attacked the community.\nSunday Adeyemo, popularly known as Sunday Igboho, had in February issued an eviction notice to herders in the area, after blaming them for insecurity in the area."
  },
  {
    "headline": "BREAKING: Suspected Fulani Herdsmen In ‘Custom Uniform’ Currently Attacking Oyo Community, Igangan",
    "summarized_story": "Igangan, a southern Oyo town that shot to prominence amid Yoruba-Fulani tensions early this year, is currently under attack again, SaharaReporters has gathered.\nA source said the gunmen, who disguised in custom uniform, stormed the town on Friday night, shooting sporadically.\n“Igangan is under attack presently, the attackers wore a custom uniform to deceive the villagers,” he said.\nThe latest attack is coming a few weeks after over 20 people were killed when gunmen suspected to be Fulani herders attacked the community.\nSunday Adeyemo, popularly known as Sunday Igboho, had in February issued an eviction notice to herders in the area, after blaming them for insecurity in the area."
  },
  {
    "headline": "‘It’d be lawmaking flaw’ -- Omo-Agege explains position on e-transmission of election results",
    "summarized_story": "Ovie Omo-Agege, deputy senate president, has explained his position on the clause relating to electronic transmission of results in the recently-passed electoral act amendment bill.\nOn its part, the lower chamber said INEC can take the decision on electronic transmission “where practicable”.\n“The Distinguished Senator Ovie Omo-Agege did not vote against E-Transmission of election results.\nFor him, all election results must be treated equally under a uniformly applied standard.\n“For him, the message from this data is that if INEC is allowed unfettered E-Transmission power, then there will be unequal treatment of election results and that would be a fundamental lawmaking flaw."
  },
  {
    "headline": "‘It’d be lawmaking flaw’ -- Omo-Agege explains position on e-transmission of election results",
    "summarized_story": "Ovie Omo-Agege, deputy senate president, has explained his position on the clause relating to electronic transmission of results in the recently-passed electoral act amendment bill.\nOn its part, the lower chamber said INEC can take the decision on electronic transmission “where practicable”.\n“The Distinguished Senator Ovie Omo-Agege did not vote against E-Transmission of election results.\nFor him, all election results must be treated equally under a uniformly applied standard.\n“For him, the message from this data is that if INEC is allowed unfettered E-Transmission power, then there will be unequal treatment of election results and that would be a fundamental lawmaking flaw."
  },
  {
    "headline": "Oyo: Customs officers raided our communities -- not gunmen",
    "summarized_story": "The Oyo government says officials of the Nigeria Customs Service (NCS) — not gunmen — raided Igangan, Ayete and Igbo-Ora communities, three agrarian areas in Ibarapa area of the state.\nAdvertisementThree people reportedly lost their lives during the raid on the communities on Friday.\nAdvertisement“The raid left so much turmoil in our communities as the Customs men came, shooting sporadically.\n“We want it stated loud and clear that our communities, Igbo Ora, Igangan and Ayete are not border towns.\nWhy should Customs turn the communities to theatres of bloodshed and war?"
  },
  {
    "headline": "Oyo: Customs officers raided our communities -- not gunmen",
    "summarized_story": "The Oyo government says officials of the Nigeria Customs Service (NCS) — not gunmen — raided Igangan, Ayete and Igbo-Ora communities, three agrarian areas in Ibarapa area of the state.\nAdvertisementThree people reportedly lost their lives during the raid on the communities on Friday.\nAdvertisement“The raid left so much turmoil in our communities as the Customs men came, shooting sporadically.\n“We want it stated loud and clear that our communities, Igbo Ora, Igangan and Ayete are not border towns.\nWhy should Customs turn the communities to theatres of bloodshed and war?"
  },
  {
    "headline": "INEC: We have capacity to transmit results electronically despite conditions in remote areas",
    "summarized_story": "The Independent National Electoral Commission (INEC) says it has the capacity to transmit results electronically, despite the poor conditions in remote areas across the country.\nAfter heated arguments among senators, the bill was finally passed on Thursday at the senate, but with provisions on electronic transmission of results.\nMajority of the senate voted in favour of allowing the Nigerian Communications Commission (NCC) to certify national coverage, followed by an approval by the national assembly before INEC can transmit results electronically.\nThe lower chamber approved that “the commission may transmit results of election through electronic means where and when practicable”.\nAdvertisement“We have uploaded results from very remote areas, even from areas where you have to use human carriers to access."
  },
  {
    "headline": "Apple’s new MagSafe battery pack just made power banks cool again",
    "summarized_story": "Well, I wonder what they’d say when they see Apple’s new MagSafe Battery Pack.\nThe MagSafe Battery pack sports a battery capacity of 1460mAh at 7.62V.\nCompared to other magsafe power banks, like Anker’s PowerCore Magnetic 5K Wireless with its 5000mAh battery, Apple’ new battery pack just doesn’t cut it.\nAccording to Apple Insider, the MagSafe Battery Pack might fully charge an iPhone 12 or iPhone 12 Pro with little issue.\nIf you charge your iPhone and MagSafe Battery Pack at the same time, your iPhone might charge to 80% or higher before your MagSafe Battery Pack begins charging."
  },
  {
    "headline": "Why food-on-demand can be Gokada’s ticket to super app stardom",
    "summarized_story": "But in its boldest step since it was founded in January 2018 by Fahim Saleh, Gokada now identifies as a super app.\nGokada’s super app is entering the market at a time when Lagos residents are consuming ₦5 trillion ($12 billion) worth of food annually.\nSo why a super app?\nLike Grab in Singapor and Gozem in francophone Africa, Gokada’s super app journey started with transportation | Graphic by Boluwatife Sanso/TC InsightsBut as Yinka Adegoke explained in this insightful piece, apps become super by offering essential services within large markets.\nPerfecting this cycle also means paying attention to renowned global food delivery services like Doordash, Grubhub, UberEats and Deliveroo."
  },
  {
    "headline": "Westa.Solar sets its sights on West Africa after debut in Nigeria",
    "summarized_story": "Westa.Solar was recently launched as a joint venture between Oolu Solar, a solar home systems provider and RP Global, a renewable energy investment company.\nThe new company offers solar systems that range from 50kW to 5MW and has commenced operations in Nigeria.\nThe plant at Petrichor represents a perfect start to life for Westa.Solar, a company that has its sights set on the larger West African market.\n“This is the first of what we hope will be many solar power projects for C&I companies,” Akinboye said.\nOver the next five to ten years, the company aims to become the leading commercial and industrial renewable energy provider in the region."
  },
  {
    "headline": "Visa launches first card payment service in Somalia",
    "summarized_story": "Visa has partnered with the International Bank of Somalia (IBS Bank) to launch Somalia’s first Visa card payment service.\n“For Visa to come to Somalia, it means that we are on the right path of growth and progress.\nSomalia, a country that had no formal banking or financial system since the collapse of its government in 1991, has been making serious headways in reawakening the pulse of its financial entities.\nAccording to Somalia’s Central Bank Governor, Abdirahman Mohamed Abdullahi, the Visa partnership will connect Somalia to the global financial system and show the growing confidence in the country’s banking and finance sector.\nThe presence of both Mastercard and Visa in Somalia will help position its market as arable land ready to receive seed and produce a bounty harvest."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "After its seed round of $350,000 and $150,000 cheque from Y Combinator as part of the accelerator’s Summer 2020 batch,..."
  },
  {
    "headline": "Smileys, hearts, sad eyes and the rise of a new digital language",
    "summarized_story": "While technology has reduced physical communication, it has also helped us keep in touch where actual meetings are impossible.\nApparently, World Emoji Day is a big deal.\nInterestingly, World Emoji Day is celebrated on July 17 because Apple’s iOS calendar emoji have the same date.\nInterestingly, the smiling face emoji symbolises dismissiveness to Chinese people rather than happiness.\n“Although we feel the same things, the way we express them may differ across cultures.”This year’s World Emoji Day promises the release of emoji 14.0."
  },
  {
    "headline": "Nigeria’s PayTV antitrust laws, AIfluence’s $1m seed round, PoS business in Nigeria",
    "summarized_story": "Good day,Today, I’m discussing:Proposed antitrust laws for Nigeria’s PayTV servicesAIfluence’s $1m seed roundPoS business in NigeriaProposed antitrust laws for Nigeria’s PayTV servicesDStv dish.\nThe laws will keep PayTV services in check, regulate their prices, and reduce the possibility of any provider monopolising the market.\nAdvertisementIn Nigeria, the satellite TV sector is dominated by MultiChoice — the South African company that owns DStv and GOtv — and Chinese-owned StarTimes.\nRecall last week, we reported that Nigeria’s Federal Inland Revenue Service (FIRS) directed commercial banks to freeze MultiChoice Nigeria Limited and MultiChoice Africa’s accounts to recover ₦1.8 trillion in taxes from the companies.\nAlso, per Statista, the number of PoS payments increased significantly from 34 million in 2015 to 438.6 million in 2019."
  },
  {
    "headline": "Twitter’s disappearing posts feature, Fleets, fails to catch user attention",
    "summarized_story": "Microblogging platform, Twitter, on Wednesday, July 14, 2021, announced that its disappearing posts feature, Fleets, will no longer be available on the platform.\nLaunched on August 17, 2020, Fleet was Twitter’s way of getting those who don’t tweet regularly to do so.\nSocial media and disappearing postsDisappearing posts was first seen on Snapchat with its introduction of Stories in October 2013.\nStatista also reveals that daily WhatsApp status users were up to 500 million in Q1 2019.\nWith no available data on other platforms’ disappearing posts feature usage, could this mean we’ll see more apps scrap it?"
  },
  {
    "headline": "Dollar supply dropped 33.83%, Naira ends week strong",
    "summarized_story": "Nigeria’s currency closed the five trading days strong in spite of the drop in dollar supply as the foreign exchange market turnover declined by 33.83 percent.\nThe naira/dollar exchange rate closed at N411.75k on Tuesday as against N411.50k closed on Monday at the official market.\nOn Thursday Naira closed flat against the dollar at all market segments of the foreign exchange market.\nNaira/dollar exchange rate on Thursday steadied at N411.20k at the official market also known as the Nigerian Autonomous Foreign Exchange Fixing (NAFEX).\nAt the parallel market, Naira weakened by 0.19 percent (N1.00k) to end the week at N506 as against N505 per dollar traded since last week."
  },
  {
    "headline": "Are football bodies doing enough about racism?",
    "summarized_story": "England Football Association, FIFA, London’s Metropolitan Police, Prime Minister Boris Johnson and Prince William have issued solidarity statements and condemned the attacks.\nSuccess would feel like a double victory, but a miss feels like a two-fold failure when it’s compounded with racist abuse.\nRacism in sportsThis is not the first time fans have taken to social media platforms to racially abuse players or sports personalities.\nEnglish prime minister, Boris Johnson, said that the order would be extended to cover online racism.\nWe need to ensure we’re not just talking, which we’ve done many times before about racism in football."
  },
  {
    "headline": "10 Reasons Executive Management Should Leverage Emotional Intelligence",
    "summarized_story": "Emotional intelligence is such a fundamental requirement for executive management such that without it their performance will be greatly stunted.\nAvoidance of AmbiguityOne of the perks of an emotionally intelligent executive management team is the ability to achieve clarity.\nSuch executive management will focus on providing the necessary conditions for productivity instead of unduly wielding the big stick.\nSo emotional intelligence helps executive management contain tension among/within internal or external stakeholders.\nEmotional intelligence could have helps the executive management better manage this conflict."
  },
  {
    "headline": "Edo-GIS has attracted investment in agric, real estate, others – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has said the ease and convenience in processing title documents for landed property has opened the state for economic growth and attracted several investors.\nManaging Director, Edo State Geographic Information Service Agency (EdoGIS), Arch.\nFrank Evbuomwan, disclosed this in a chat with journalists in Benin City, Edo State.\nAccording to Evbuomwan,“For the first time in the history of the State, prospective investors have confidence in land registration in the state.\nFurthermore, several private investors in hospitality and real estate business have come to EdoGIS and found a simplified and faster process of getting government titles for their lands."
  },
  {
    "headline": "Edo reiterates commitment to sports devt, makes case for handball leagues in states – Nigerian Observer",
    "summarized_story": "Philip Shaibu, has advocated for the establishment of state handball leagues across Nigeria in a bid to make handball a major sport in Nigeria.\nAccording to the deputy governor, “We need the Handball Federation to make it mandatory for all states in Nigeria to have handball leagues.\nWe should have a state handball league.\n“In the past, you cannot qualify to play in the National League, until you qualify from the state league.\nOcheho said that the competition has exposed a lot of talents to the Federation, assuring that the future of handball in Nigeria is bright."
  },
  {
    "headline": "Obaseki launches new campaign to improve sanitation, end open defecation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, on Friday in Benin City, launched the “Clean Nigeria: Use the Toilet” campaign to drive sustainable sanitation and end open defecation across the 18 local government areas of the state by 2025.\nObaseki, who was represented by the Edo Head of Service, Mr. Anthony Okungbowa, said the campaign will raise awareness and get more stakeholders involved in ensuring a serene, cleaner and safer Edo.\nIn his remarks, the Minister of Water Resources, Suleiman Adamu, implored the people of Edo to own and drive the campaign in their respective communities to help eradicate open defecation.\nAdamu, who was represented by the Director, Water Quality and Sanitation, Mr. Emmanuel Awe, said the practice of open defecation which has a huge negative impact, especially on women and girls, could be stopped with everyone’s collective efforts.\nEarlier in her welcome address, Mrs. Mercy Omoregie, the General Manager Small Town and Rural Water Supply and Sanitation Agency (STRUWASSA), said it is saddening to see Edo identified among states with the prevalence of open defecation practice in Nigeria."
  },
  {
    "headline": "Edo e-procurement portal goes live, as govt reassures of transparency, accountability in process – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has launched an electronic public procurement system to ensure a transparent and accountable process in its public procurements.\nIdogun noted that Edo State has taken a bold step towards a better, transparent and accountable system in its public procurement process as the launch will guarantee a fair and seamless process.\nEdo is the second State to go live in the Federation as regards leveraging technology in public procurement.\nThis system will help the state have a transparent process without bias and not allowing manipulation due to human interference.\nHe is a dynamic personality; he is not looking at Edo State today but looking at Edo State in the future."
  },
  {
    "headline": "By frustrating electronic transmission of election results, Nigerian lawmakers hinder INEC’s independence, efficiency",
    "summarized_story": "“The commission may consider electronic transmission provided the national network coverage is adjudged to be adequate and secure by the Nigerian Communications Commission and approved by the National Assembly,” his proposition read.\nAs it stands, it effectively means the electoral commission (INEC) has been denied the legal power to transmit results of elections electronically.\nSuch officials seldom go against the wish of the president who can thus decide whether or not Nigerians should experience electronic transmission of election results.\nAnalysts say INEC’s dependence on such agency to take a decision that grossly affects an election undermines the electoral body’s independence.\nAn alternative amendment by James Faleke (APC, Lagos) suggested that the section cater to the two sides of the divide by providing that “election results may be transmitted both electronically and manually.”His suggestion fell flat."
  },
  {
    "headline": "Web Story 19 Jan",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "FG will take possession of repatriated Benin artefacts – Lai Mohammed",
    "summarized_story": "Nigeria’s minister of information and culture, Alhaji Lai Mohammed, has said the federal government will take possession of the repatriated Benin artefacts, but will take into cognizance the culture that produced the art works.\nRecall that the German government said it would return the 1,130 looted Benin bronzes to Nigeria in 2022.\nIn 1897, the Benin kingdom, which was well-known for its rich cultural heritage and artefacts, was invaded by British soldiers, in what is now known as the Benin invasion of 1897.\nSince the process of repatriation began, the Benin palace and the Edo government have been at loggerheads over who will house the historical and precious artefacts.\nAccording to him, the repatriated bronzes are not the property of the Edo state government but that of the Benin kingdom."
  },
  {
    "headline": "Nigeria’s inflation rate down to 17.75% in June – NBS",
    "summarized_story": "Nigeria’s inflation rate fell slightly from 17.93 per cent in May to 17.75 per cent in June, according to latest Consumer Price Index report for June released by the National Bureau of Statistics (NBS).\nThis represents 0.18 per cent fall in the inflation rate.\nPart of the report read, “The consumer price index which measures inflation (rate of change in the increase in prices) increased by 17.75 per cent (year-on-year) in June 2021.\nThe urban inflation rate increased by 18.35 per cent (year-on-year) in June 2021 from 18.51 per cent recorded in May 2021, while the rural inflation rate increased by 17.16 per cent in June 2021 from 17.36 per cent in May 2021.\nThis is higher than 16.09 per cent reported in May 2021, while the corresponding rural inflation rate in June 2021 was 15.36 per cent compared to 14.94 per cent recorded in May 2021"
  },
  {
    "headline": "Nigerian equities market ends week on bearish note as ASI dips 0.12%",
    "summarized_story": "The Nigerian Equities market ended the week on a bearish note.\nThirty-two (32) equities depreciated, which is higher than twenty-two (22) equities in the previous week, while ninety-five (95) equities remained unchanged higher than ninety (90) equities recorded in the previous week.\nThe financial services sector led the activity chart yet again with a total volume of 732.418 million shares valued at N7.21 billion traded in 9,131 deals.\nThe Conglomerates Industry followed with 52.93 million shares worth N170.27 million in 656 deals.\nThe third place was ICT Industry, with a turnover of 52.716 million shares worth N1.806 billion in 701 deals."
  },
  {
    "headline": "Blow a whistle or send us your news tips",
    "summarized_story": "Thank you for your interest in dropping this information.\nPlease endeavour to back your information with facts and proof in the form of scanned documents, images or text.\nOur editors will investigate and take the matter up immediatelyBest Regards,Editor-In-ChiefBusiness Hallmark Newspapers…………………………………………….\n[usp_visitor] [usp-login-form] [/usp_visitor][usp_member] [user-submitted-posts] [/usp_member] [usp_member deny=”Only logged in users can submit posts”][/usp_member]"
  },
  {
    "headline": "VIDEO: Gov Sanwo Olu attends the Y2021 Lagos State Annual Tree Planting Day – Daylight",
    "summarized_story": "You might also like"
  },
  {
    "headline": "VIDEO: Gov Sanwo Olu attends the Y2021 Lagos State Annual Tree Planting Day – Daylight",
    "summarized_story": "You might also like"
  },
  {
    "headline": "Ibarapa attack: We alerted govt but nothing was done -Igangan group",
    "summarized_story": "Ibarapa attack: We alerted govt but nothing was done -Igangan groupIbarapa attack: We alerted govt but nothing was done -Igangan groupThe Igangan Development Advocates has said it received an intelligence report that armed bandits were planning to attack Igangan town before or on the day of Eid-el-Kabir.\nThe President of the group, Wale Oladokun, who said this in a statement on Saturday, said it alerted state offices in charge of security but “nothing was done to prevent the attack”.\nHe, however, stated that there were plans already to twist what happened and blame residents of Ibarapa for attacking Customs officers.\n“Having dressed like Customs officers, the story has been preplanned to be distorted right from the outset by these armed bandits suspected to be Fulani.\n“Government may wake up and claim that Customs officers on official duty have been attacked by residents of Igangan while discharging their duties,” he added."
  },
  {
    "headline": "Ibarapa attack: We alerted govt but nothing was done -Igangan group",
    "summarized_story": "Ibarapa attack: We alerted govt but nothing was done -Igangan groupIbarapa attack: We alerted govt but nothing was done -Igangan groupThe Igangan Development Advocates has said it received an intelligence report that armed bandits were planning to attack Igangan town before or on the day of Eid-el-Kabir.\nThe President of the group, Wale Oladokun, who said this in a statement on Saturday, said it alerted state offices in charge of security but “nothing was done to prevent the attack”.\nHe, however, stated that there were plans already to twist what happened and blame residents of Ibarapa for attacking Customs officers.\n“Having dressed like Customs officers, the story has been preplanned to be distorted right from the outset by these armed bandits suspected to be Fulani.\n“Government may wake up and claim that Customs officers on official duty have been attacked by residents of Igangan while discharging their duties,” he added."
  },
  {
    "headline": "Ortom to Buhari: You give Katsina N6.5b for ranching, Benue wants N100B",
    "summarized_story": "*Accuses Buhari of hypocrisy and deceit on open grazing*Demands apology and same gestureAgency ReportsGovernor Samuel Ortom of Benue state has accused President Buhari of deceit and hypocrisy over his stand on open grazing for cattle.\nOrtom insisted that the Federal Government should apologise to him and extend the same gesture to Benue State by releasing N100billion for the establishment of ranches.\n“So Mr. President approved N6.5billion for ranching in Katsina state.\n“The prohibition of open grazing is the only thing that will help this country including the provision for ranching.\nSo if the president has approved N6.5billion for Katsina state, they should also approve N100billion for Benue state with an apology to me."
  },
  {
    "headline": "Popular Abuja supermarket Ebeano gutted by fire",
    "summarized_story": "Popular retail supermarket in Abuja, Prince Ebeano Supermarket, Lokogoma, Abuja, has been gutted by fire.\nThe amount of damage the fire has caused the supermarket is also yet to be estimated.\nHowever, while the fire was on, scores of Firefighters were at the scene to quell the fire.\nThe FCT Fire Service spokesman, Ibrahim Muhammad, confirmed the incident.\n“Ebeano supermarket is on fire and many FCT fire stations namely Nji, Games Village, Garki and Asokoro are there fighting the fire,” he said."
  },
  {
    "headline": "Benin monarch, Obaseki lose: FG to take possession of looted Benin bronzes",
    "summarized_story": "By Rotimi IjikanmiThe Federal Government says, in line with operative conventions and laws, it will take possession of the 1,130 looted Benin bronzes being expected from Germany.\nMohammed was reacting to the controversy that had trailed who will take the possession of the expected artefact between the Oba of Benin, Oba Ewuare II and Edo state Governor, Godwin Obaseki.\n“The Federal Government is aware of the widely-reported controversy on who will take possession of the Benin Bronzes when they are returned from Germany.\nThe minister said the federal government was not just involved in the repatriation of Benin artefacts.\nMohammed commended the Government of Germany for taking the lead in the global efforts to repatriate all artefacts that were looted from Nigeria and from the African continent."
  },
  {
    "headline": "BREAKING: Fire Guts Ebeano Supermarket In Abuja",
    "summarized_story": "The cause of the fire outbreak could not be immediately ascertained but itwas learnt that many fire fighters are currently battling to put it out.\nThe FCT Fire Service spokesman, Ibrahim Muhammad, confirmed the incident on Saturday night.\nHe stated, “Ebeano supermarket is on fire and many FCT fire stations namely Nji, Games Village, Garki and Asokoro are there fighting the fire.”"
  },
  {
    "headline": "INEC States Position On Electronic Transmission Of Election Results In Nigeria",
    "summarized_story": "The Independent National Electoral Commission (INEC) has insisted it has the capacity to transmit election results electronically from remote areas across Nigeria.\nNEWS DIRECT recalls on Thursday that the House of Representatives was thrown into confusion as members debated section 52(2) of the electoral amendment act bill, which deals with electronic transmission.\nHowever, speaking on Channels Television breakfast show on Saturday, Mr Festus Okoye, INEC’s National Chairman and Commissioner for Information and Voter Education, said the Commission’s position was clear.\nOkoye said, “We have uploaded results from very remote areas, even from areas where you have to use human carriers to access.\n“So, we’ve made our own position very clear, that we have the capacity and we’ve the will to deepen the use of technology in the electoral process."
  },
  {
    "headline": "FG’ll Take Possession Of Looted Benin Artefacts When Returned —Lai Mohammed",
    "summarized_story": "The Federal Government will take possession of 1,130 looted Benin Bronzes when returned by Germany, Minister of Information and Culture, Lai Mohammed, has said.\nThe Benin Palace and the Edo State Government have been at loggerheads over where the artefacts will be housed.\nOba of Benin, Ewuare II insisted that the right and only legitimate destination of the about-to-be-repatriated artefacts was the Benin Royal Museum.\n“Please note that we are not just involved in the repatriation of Benin artefacts.\nWe are also working on repatriating Ife Bronzes and Terracotta, Nok Terracotta, Owo Terracotta, the arts of the Benue River Valley, the Igbo Ukwu, the arts of Bida, the arts of Igala, Jukun etc.”"
  },
  {
    "headline": "Insecurity: Bandits Also Attack Fulanis – Miyetti Allah",
    "summarized_story": "Bandits and livestock rustlers have also targeted the Miyetti Allah Cattle Breeders Association of Nigeria, MACBAN, and the Fulani clan.\nHaruna Usman Tugga, Chairman of MACBAN, made the allegation while revealing that Fulanis had been attacked in the Atyap Chiefdom of Kaduna State’s Zangon Kataf Local Government Area.\nTugga said about 16 Fulanis, mostly women and children, were killed, while over 300 houses were burnt down.\nHe added: “Within a few days, all the houses of the Fulani in the Chiefdom were burnt by mobs in broad daylight.\n“In addition to the burning of settlements, an unconfirmed number of Fulani pastoralists were also killed."
  },
  {
    "headline": "Pictures: Taekwondo athlete, Elizabeth Anyanacho, in first training session at Kisarazu Japan days to Olympics battle",
    "summarized_story": ""
  },
  {
    "headline": "VIDEO: In Tokyo, Elizabeth Anyanacho, officials receive Taekwondo brand new gears, kits for Olympics",
    "summarized_story": "Taekwondo star Elizabeth Anyanacho alongside Olympian Chika Chukwumerije and Secretary General Kabir Yusuf on Friday recieved and unveiled brand new gears and kits from South Korea.\nBranded by Motor company, Olympian to be Anyanacho currently at her training camp in Japan later wore and displayed the wears.\nAn excited Anyanacho while expressing her feeling said, “Yea, it looks good.\nI can’t wait to train and get ready for the contest.”"
  },
  {
    "headline": "Subsidy saga: Govt’s stance, citizens’ dilemma",
    "summarized_story": "Alas, it was not too long before the government reverted to status quo with the NNPC once again funding subsidy.\nThe actual consumption of petroleum products in Nigeria is also not ascertained to determine the amount of subsidy the Nigeria government pays to importers.\n“The NNPC refineries have been running below capacity for over 20 years and the government has not done anything about it.\n“The petroleum products directly impact the daily living of Nigerians and removal of subsidy without commensurate cushion will increase the hardship in the country,” he said.\nRegrettably, the Nigerian State is complicit and remains the number one stumbling block to finding solutions to the subsidy saga."
  },
  {
    "headline": "Gunmen murders former Provost Marshal Nigerian Army -NigPilot",
    "summarized_story": "The former Provost Marshal of the Nigerian Army, Major General Hassan Ahmed, has been murdered by unknown gunmen in Abuja.\nIt was gathered that the gunmen opened fire on his vehicle, murdered him, and whisked away from the wife.\nThe statement said: “With a heavy heart, the Chief of Army Staff, Lt Gen Faruk Yahaya, Officers, and Soldiers of the Nigerian Army regret to announce the passing on of Maj Gen Hassan Ahmed, a former Provost Marshall of the Nigerian Army.\n“The sad incident occurred when the senior officer’s vehicle was attacked by gunmen while transiting along Lokoja – Abuja road yesterday 15 July 2021”.\nHe added that Members of the Nigerian Army Officers’ Wives Association (NAOWA) led by the Deputy National President, Mrs. Stella Omozoje have also visited the family to condole with them."
  },
  {
    "headline": "Electronic Transmission: PDP carpets APC Senators -NigPilot",
    "summarized_story": "Opposition Peoples Democratic Party, PDP, on Thursday said the majority of Nigerians are shocked over the decision of the All Progressives Congress , APC-led Senate to undermine our electoral process by refusing to approve the demand by Nigerians across the board for electronic transmission of election results without conditionalities.\nReacting to the decision of the APC-dominated Senate to halt electronic transmission of votes, the PDP said the action of the APC senators is an atrocious assault on the sensibilities of Nigerians, who looked up to the Senate for improvement in our electoral process in a manner that will engender free, fair and credible process.\n“This action of the APC senators is a direct affront, novel in its recklessness and a defilement of the 1999 Constitution (as amended), which clearly conferred operational independence to INEC to conduct elections, free from interferences and regulations from any other agency of government.\n“The decision of the APC Senators, therefore, amounts to a suspension of the 1999 constitution (as amended) which is a recipe for the crisis that could derail our democracy and destabilize our nation.\n“It is, to say the least, a preparation for mass rigging of elections across Nigeria by the APC, which must be firmly resisted."
  },
  {
    "headline": "Electronic Transmission of votes: Senate decision unconstitutional -Tambuwal -NigPilot",
    "summarized_story": "…Lauds RepsFormer Speaker of the House of Representatives, Hon Aminu Tambuwal on Thursday said the decision of the Senate to subject INECs constitutional power to conduct elections t o the Nigerian Communications Commission (NCC), and National Assembly is patently unconstitutional.\nReacting to the decision of the Senate to stop INEC from the electronic transmission of votes, the Sokoto state governor said the powers of INEC on how to conduct elections are entrenched in the constitution and cannot be subject to anybody.\n“The decision of the Senate to subject INECs constitutional power to conduct elections to the Nigerian Communications Commission (NCC) , and National Assembly is patently unconstitutional.\nThe Senate decision to subject INECs constitutional power to conduct elections to NCC is consequently patently VOID, unconstitutional, and unlawful.\nINEC also has constitutional power backed by the Electoral Act to make rules and guidelines to ensure that every vote is counted and that every vote counts."
  },
  {
    "headline": "Lagos APC members petition national leadership over conduct of LG polls -NigPilot",
    "summarized_story": "Some members of the All Progressives Congress, APC, in Lagos, under the auspices of Concerned APC Progressives, have petitioned the party’s national caretaker committee in Abuja against plans by the state chapter of the party to field candidates for the forthcoming local government elections in 57 local government councils instead of 20.\nSpecifically, they accused the chairman of the state chapter of the party, Alhaji Tunde Balogun, of anti-party activities, subversion of the provision of the constitution, and indulging in actions capable of eroding the core values of the party in the country.\nThey urged the national leadership of the party to prevail on the governor of Lagos State to advise LAISEC to conduct election only in the constitutionally recognized 20 local government councils and desist from conducting elections in the 57 local government councils to avoid national embarrassment for the party.\n“If this is allowed without the party at the National level taking urgent steps to correct the anomaly it might grievously affect and undermine the existence of the political party in the state” they alleged.\nThe APC members noted that if Lagos State Independent Electoral Commission should go-ahead to conduct any local government election as stated on July 24, 2021, it would not only violate the core values of the party but also the section of the provisions of the Constitution which recognizes only 20 local government councils for Lagos State as against the much flaunted 57 local government councils."
  },
  {
    "headline": "We Have Capacity For Electronic Transmission In Remote Areas – INEC",
    "summarized_story": "﻿The Independent National Electoral Commission (INEC) on Saturday suggested it has the capacity to transmit election results electronically from remote areas across the country.\nLawmakers in both chambers of the National Assembly had been at loggerheads over electronic transmission of results earlier in the week.\nThe House was thrown into disarray on Thursday as members debated section 52(2) of the electoral amendment act bill, which deals with electronic transmission.\nAccording to the lawmakers opposed to sacrosanct electronic transmission of results, some parts of the country do not have the required network coverage.\n“We have uploaded results from very remote areas, even from areas where you have to use human carriers to access,” he said."
  },
  {
    "headline": "FG To Take Possession Of Returning Benin Bronzes – Lai Mohammed",
    "summarized_story": "﻿The Minister of Information and Culture, Lai Mohammed, on Saturday said the Federal Government will be responsible for taking possession of the 1,130 Benin bronzes to be returned by Germany.\n“The Federal Government is aware of the widely reported controversy on who will take possession of the Benin bronzes when they are returned from Germany,” Mr Mohammed said on Saturday at a press conference in Lagos.\nThe return of the bronzes, looted by Britain from Benin-city in the 19th century, had recently generated some controversy in Edo State.\n“We agreed to have a definite timeline for the repatriation of the artefacts because Nigeria is tired of an indefinite timeline,” he said.\n“We made our Germany counterparts realise that Nigeria is averse to attaching preconditions to repatriating the Benin bronzes."
  },
  {
    "headline": "Panic As Gunmen Injure Customs Officers, Soldier In Igangan Community",
    "summarized_story": "While residents claim that the attack was carried out by armed herdsmen, the Nigeria Customs in a statement on Saturday said they were smugglers.\nAccording to the Nigeria Customs, three officers and a soldier were injured during the attack carried out which was carried out on Friday night.\n“The injured Customs Officers who are operatives of the Zone A, Federal Operations Unit, sighted eight trucks carrying smuggled foreign parboiled rice whose drivers and armed accompanying passengers launched an attack on the officers.\nThe statement added that an investigation has been launched to arrest and prosecute the attackers and the attacked customs officers and a soldier, including one that was shot in the head, are receiving treatment.\nAt least 11 people were killed after gunmen attacked the community earlier in June."
  },
  {
    "headline": "#EndSARS: Again, Lagos Panel Gets Three-Month Extension",
    "summarized_story": "The tenure of the Lagos State Judicial Panel on Restitution for Victims of SARS Related Abuses and other matters has again been extended for another three months.\nThe Chairman of the panel, Justice Doris Okuwobi stated this while hearing petitions on Friday.\nRecall that the Lagos State judicial panel was inaugurated by Governor Babajide Sanwo-Olu of Lagos State on October 27, 2020.\nThe initial six months sitting of the Lagos panel expired on April 27, 2021, and the panel was granted a three-month tenure extension which is supposed to expire on Monday, July 19 but as of June 29, the panel had sat for 97 days and only heard 126 petitions out of the 235 petitions it received.\nAt Friday’s sitting, the panel heard eleven petitions."
  },
  {
    "headline": "Al Ahly Punish Kaizer Chiefs To Win CAF Champions League For 10th Time",
    "summarized_story": "Egyptian club Al Ahly won a record-extending 10th CAF Champions League title on Saturday with a 3-0 final victory over 10-man South African rivals Kaizer Chiefs in Casablanca.\nA brilliant goal from Mohamed ‘Afsha’ Magdy on 64 minutes left little doubt about the outcome in a disappointing finale to the marquee African club competition.\nIt was a historic victory for Ahly, who became the first club to win the title back-to-back three times.\nSouth Africa-born Ahly coach Pitso Mosimane, who supported Chiefs as a child, became the first African coach to win the competition three times.\nHe succeeded in 2016 with South African club Mamelodi Sundowns, and again with Ahly last season in an all-Egyptian final against fierce rivals Zamalek."
  },
  {
    "headline": "Video: See ram with five horns",
    "summarized_story": "As Muslim faithful go all out to buy Rams for the Eid El Kabir celebration, not many would ever think of coming across a Ram with five horns.\nAt one of the Ram markets very close to under the Otedola Bridge is this five-horn Ram that has become a delight of passersby.\nMany stop to pay a glance at one of the wonders of nature.\nAs some show amazement, others stand to take a snapshot with the Ram.\nWatch this video for more information,"
  },
  {
    "headline": "#EndSARS Lagos inquiry panel gets another three-month extension",
    "summarized_story": "The Lagos state panel of inquiry hearing SARS-related abuses has been given another three months for its work.\nRetired Justice Doris Okuwobi, who chairs the panel, announced the extension during Friday’s sitting.\nWe now have an extension till October 19.\non April 19, the panel was given a three months extension to hear petitions till July 19.\nIn all, there are 235 petitions before the panel and 25 petitioners have been awarded compensations to the tune of N151,250,000 million."
  },
  {
    "headline": "Igangan attack was carried out by smugglers – Nigeria Customs",
    "summarized_story": "The Nigeria Customs Service has said that the recent attack by some gunmen at the Ibarapa axis of Oyo state was carried out by some armed smugglers.\nThe Customs spokesperson, Federal Operations Unit, Theophilus Duniya who made this known in a press statement revealed that three customs officers and a soldier were injured during the attack.\nAccording to the statement, three Customs Officers and a soldier on duty were injured in an unprovoked attack by smugglers in Igbo Ora area of Ibarapa Local Government, Oyo State in the evening hours of Friday.\nHe said the injured Customs Officers who are operatives of the Zone A, Federal Operations Unit, sighted eight trucks carrying smuggled foreign parboiled rice whose drivers and armed accompanying passengers launched attack on the officers.\nWhile condemning that attack, the Acting Controller of the Unit, DC Usman Yahaya, reiterated the effort of the Service to suppress smuggling activities in the country."
  },
  {
    "headline": "Thailand Bans Gatherings as Covid Cases, Deaths Hit New Record",
    "summarized_story": "Thailand has imposed a nationwide ban on public gatherings and is considering more restrictions on movement as authorities reported record numbers of new coronavirus cases and deaths on Saturday, despite partial lockdowns in Bangkok and nine other provinces this week.\nThe country’s COVID-19 task force reported 10,082 new coronavirus cases and 141 new deaths, bringing the total number of infections to 391,989 cases and 3,240 fatalities since the pandemic started.\nDespite the new lockdown and nationwide surge in COVID-19, three more Thai islands were opened to vaccinated foreign tourists in the country.\nThailand launched its “sandbox” scheme on July 1, allowing vaccinated travellers to visit Phuket island.\nTourism Association of Koh Samui President Ratchaporn Poolsawadee described the “Samui Plus” scheme as a soft opening."
  },
  {
    "headline": "Olympic Village Confirms First Covid Case Days Before Tokyo Games",
    "summarized_story": "The Tokyo Olympics has registered its first Covid-19 case in the Olympic Village six days before the Games open, the organisers have said.\nTokyo 2020 CEO Toshiro Muto confirmed on Saturday that a visitor from abroad who is involved in organising the Games had tested positive.\nMasa Takaya, a spokesman for the Tokyo organising committee, told a news conference that the first case in the Village was reported during the screening test.\nThe person has been removed from the Village where thousands of athletes and officials will reside during the Games.\nSeiko Hashimoto, the chief organiser of the Tokyo 2020 Games, added: “We are doing everything to prevent any COVID outbreaks."
  },
  {
    "headline": "US Sanctions Chinese Officials Over Hong Kong Democracy Crackdown",
    "summarized_story": "The United States has imposed sanctions on seven Chinese officials over Beijing’s crackdown on democracy in Hong Kong.\n“In the face of Beijing’s decisions over the past year that have stifled the democratic aspirations of people in Hong Kong, we are taking action.\nHong Kong officials previously called those US sanctions “hostile acts of hegemony”.\nEarlier on Friday, Xia Baolong, the director of China’s Hong Kong and Macau Affairs Office, was quoted by Hong Kong Free Press as saying that sanctions will “only evoke our anger”.\nThe Hong Kong-based news publication quoted former US Consul General in Hong Kong Richard Boucher as saying: “Every time there’s some news of China putting more pressure on Hong Kong, there’s commensurate pressure on the US side to do something."
  },
  {
    "headline": "Europe Floods: With Over 150 Dead, Rescuers Race to Find Survivors as Hundreds Remain Missing",
    "summarized_story": "Rescue crew have been racing to find survivors of floods that have wreaked havoc across western Europe, killing more than 150 people.\nHundreds are still missing after record rainfall triggered severe floods in Germany and Belgium.\nEuropean leaders have blamed the extreme weather on climate change.\nRescue workers from France, Italy and Austria were sent to the city of Liege, where residents were evacuated after flash floods.\nLake Lucerne is flooding into the town and people in Basel have been told to keep well away from the River Rhine."
  },
  {
    "headline": "Biden Says Social Media ‘Killing People’ with Covid Misinformation",
    "summarized_story": "US President Joe Biden has said that social media companies are “killing people” by failing to police misinformation on their platforms about Covid-19 vaccines.\nSpeaking on Thursday, Murthy said misinformation about COVID-19, deemed an “infodemic” by the World Health Organization (WHO), was deadly.\n“Misinformation poses an imminent and insidious threat to our nation’s health,” Murthy said during remarks on Thursday at the White House.\nToo often, he said, the platforms are built in ways that encourage, not counter, the spread of misinformation.\nPsaki said 12 people were responsible for almost 65 percent of anti-vaccine misinformation on social media platforms."
  }
]