[
  {
    "headline": "Wike decries herdsmen’s attacks, prepares anti-open grazing bill",
    "summarized_story": "The Governor of Rivers State, Nyesom Wike, has said he is sending an anti-open grazing bill to the State Assembly to give legal backing to the ban on open grazing in the state and to protect farmers and other residents from marauding herdsmen.\n“You can’t go to the farm anymore; those who rear cattle will not allow your crops to grow.\nLet me say clearly, now that the House of Assembly has come back, we have to submit the bill on anti-open grazing as we agreed in the Southern Governors Forum.\nIf you watch television and read the news in newspapers, you will hear so and so numbers are killed or kidnapped in so and so state,” Wike added.\nHe also stated that the APC-led Federal Government had not done anything in Rivers State."
  },
  {
    "headline": "Amaechi blames N’Assembly for Ibadan-Kano rail project delay",
    "summarized_story": "THE Minister of Transportation, Rotimi Amaechi, has thanked President of the Senate, Ahmad Lawan; and Speaker of the House of Representatives, Femi Gbajabiamila, for stopping an investigation of commercial agreements and external borrowings by the Federal Government.\nAmaechi also blamed the National Assembly for the delay being suffered by the Ibadan-Kano rail line project over the probe by the House.\nThe committee, after grilling Amaechi at its first and second hearings, had invited several other ministers and top officials of the Federal Government to the third hearing on the said date.\nOn Wednesday, Amaechi recalled warning that the probe would discourage the Chinese government from going further to grant the loan.\nWe will commence work by this month end on the Kaduna-Kano rail line."
  },
  {
    "headline": "LIGHT UP YOUR LIVING ROOM WITH INTIMATE LIGHTINGS",
    "summarized_story": "Natural Light: If you’re blessed with a South-facing space, you’re going to need a lot less light for the daytime and perhaps won’t need to consider as much task lighting.\nTo create a more intimate atmosphere, bring lighting to a lower level via table lamps and short floor lamps.\nMood and Task Lighting: Extra task and mood lighting is often where design schemes fall short.\nHomeowners assume that the central light or wall lights are enough at full power, instead of thinking about the layering effect.\nLight Up the Candles: Candles are the last piece of the puzzle when creating a relaxing and intimate atmosphere."
  },
  {
    "headline": "LIGHT UP YOUR LIVING ROOM WITH INTIMATE LIGHTINGS",
    "summarized_story": "Natural Light: If you’re blessed with a South-facing space, you’re going to need a lot less light for the daytime and perhaps won’t need to consider as much task lighting.\nTo create a more intimate atmosphere, bring lighting to a lower level via table lamps and short floor lamps.\nMood and Task Lighting: Extra task and mood lighting is often where design schemes fall short.\nHomeowners assume that the central light or wall lights are enough at full power, instead of thinking about the layering effect.\nLight Up the Candles: Candles are the last piece of the puzzle when creating a relaxing and intimate atmosphere."
  },
  {
    "headline": "Style Stars on Instagram",
    "summarized_story": "By Yemisi SuleimanThe social media, particularly instagram, is the hub for style inspirations these days and style influencers, celebrities and bloggers, go all out to give inspirations to their followers.\nHowever, if you are not sure you are following the right crowd, take a look at our selection of the hottest style stars on Instagram and what makes them tick.\nFolake HuntoonKnown for her signature Afro hairstyle, Folake Huntoon with the brand name ‘Style Pantry’ on Instagram, has successfully earned a huge number of followers for her fashion and effortless style.\nCHIC AMANigerian born fashion blogger Chic Ama, who is based in the United States, is one of the top fashion Instagram influencers today.\nThe fashion consultant cum actor, through his style, encourages his followers to break style rules to find their own contemporary style."
  },
  {
    "headline": "Style Stars on Instagram",
    "summarized_story": "By Yemisi SuleimanThe social media, particularly instagram, is the hub for style inspirations these days and style influencers, celebrities and bloggers, go all out to give inspirations to their followers.\nHowever, if you are not sure you are following the right crowd, take a look at our selection of the hottest style stars on Instagram and what makes them tick.\nFolake HuntoonKnown for her signature Afro hairstyle, Folake Huntoon with the brand name ‘Style Pantry’ on Instagram, has successfully earned a huge number of followers for her fashion and effortless style.\nCHIC AMANigerian born fashion blogger Chic Ama, who is based in the United States, is one of the top fashion Instagram influencers today.\nThe fashion consultant cum actor, through his style, encourages his followers to break style rules to find their own contemporary style."
  },
  {
    "headline": "When journalists gathered to x-ray their role in eliminating violence against women, girls",
    "summarized_story": "This was the submission of participants at a four-day media dialogue and training to improve gender sensitivity in reportage and advocacy, to eliminate violence against women and girls in Lagos.\nAlkasim Abdulkadir, one of the facilitators, while presenting his paper titled: “Etiquette in Reporting Gender” noted that Gender-based violence (GBV) or violence against women and girls (VAWG), is a global pandemic that affects 1 in 3 women in their lifetime.\nOn her part, Aisha Salaudeen, another facilitator, who spoke on “Gender and child-sensitive reporting,” defined gender reporting simply as including all genders in our reporting.\n“Violence is rarely an isolated incident and the majority of children surveyed experienced violence in their home.\nIf we do not end violence against women, we can reduce it to the nearest minimum."
  },
  {
    "headline": "Police arrest Bauchi woman, teenage daughter for maltreating step children",
    "summarized_story": "The police in Bauchi State have arrested a housewife with her 18-year-old daughter as well as husband, for maltreating her step children, including a three-year-old, subjecting them to severe beatings and starvation.\nNarrating her children’s ordeals in the hands of their step mother and sister, their mother, Habiba Sani Khalid, lamented that they were subjected to starvation and torture.\n“Their father later called me on phone and asked me to come and pick my children.\nHe said if I didn’t carry them, he wouldn’t bother about their plights because he has other children he cares for.\nMeanwhile, the Bauchi State Police Command’s Police Public Relations Officer (PPRO), SP Ahmed Mohammed Wakili, confirmed the incident and arrest of the stepmother, her daughter and husband to journalists."
  },
  {
    "headline": "Herdsmen: Forget it, no law backs grazing routes",
    "summarized_story": "The Yoruba socio-political organization, Afenifere, on Wednesday, called on the President Muhammadu Buhari-led Federal Government to jettison the idea of reopening grazing routes in Nigeria.\nGov Akeredolu kicks against Buhari’s move for open grazingIn an interview with Arise Television, the president had expressed the hope of reopening grazing routes across the country.\nThe president had said he would direct the Attorney General of the Federation, Abubakar Malami to dig up the gazette of the First Republic which backed grazing routes.\nHowever, Ajayi said Basiru’s remark was in tandem with the stance of Afenifere which friend against grazing routes in Nigeria.\nFor the senator to tell us that there is no such law, it is in tandem with our position."
  },
  {
    "headline": "Insecurity: Anambra govt clears air on return of Bakassi Boys",
    "summarized_story": "The Anambra State Government has refuted reports of the return of Bakassi Boys security outfit in the state.\nDon Adinuba, the state’s Commissioner for Information and Public Enlightenment, said the state government would not allow Bakassi operate in the state.\nA video had surfaced online of some youths dressed in red wielding weapons with the claim that Bakassi Boys have returned to Awka.\nHowever, the Commissioner said the said video was efforts by youths to rid the state of cultists and not Bakassi Boys.\n“The Bakassi Boys security outfit is not in Anambra State, and will not be used again in the state."
  },
  {
    "headline": "Kwara suspends two officials over alleged financial irregularities",
    "summarized_story": "Two senior officials of the Saving One Million Lives Programme for Result (SOML-PforR) have been suspended by the Kwara State Government for allaged financial irregularities and inconsistencies in the handling of funds.\nThey are the SOML-PforR state Programme Manager, Dr. Ibrahim Omar and the programme accountant, Alabi Rahman Olalekan.\nTheir suspension, according to a statement by the state Ministry of Health, in Ilorin on Wednesday, is connected to alleged mismanagement of some N170m SOML-PforR’s fund.\nThe statement said preliminary probe into the allegations, revealed ” Some inconsistencies and that efforts to get the officials to offer satisfactory explanations and verifications were being deliberately frustrated.”It explained that the officials were suspended from the programme ” To enhance uninterrupted investigation.”The statement urged the officials to co-operate with the inter ministerial investigative committee empanelled to look into the financial transactions of the SOML-PforR, between December 2019 and May 2021.\nSigned by the Press Secretary of the Ministry, Falade Gbenga Tayo, the statement said the steps to sanitize the programme, were in line with the transparency and accountability drive of Governor Abdulrahman Abdulrazaq."
  },
  {
    "headline": "Farming: Ortom declares Thursday, Friday in June, July as work-free day for civil servants",
    "summarized_story": "Governor Samuel Ortom of Benue State has approved Thursday and Friday in the month of June and July 2021 as work-free days to enable civil servants in the state to engage themselves in farming activities.\nAccording to the circular, the decision was to enable the public servants take advantage of state’s Agricultural Value Chain.\nThe circular reads, “In order to create an enabling environment to support Civil Servants in Benue State take advantage of the state’s Agricultural Value Chain, His Excellency, the Executive Governor of Benue State, Samuel Ortom has approved Thursday and Friday in the month of June and July 2021 as work free days to enable Civil Servants engage in farming activities.\n“Accordingly, effects from Thursday 17th June to Friday 30th July 2021, Thursdays and Fridays have been declared as work-free days Civil Servants are therefore advised to take advantage of these days to engage in farming and agricultural related activities”.\nIt, however, stated that those on essential services are exempted from the work-free days."
  },
  {
    "headline": "Premier League releases 2021-22 fixtures",
    "summarized_story": "Agency ReporterMan City can start planning their title defence as Man Utd, Liverpool and Chelsea chase them down, while Brentford make their Premier League bowThe 2021-22 Premier League season will get underway on August 14, with reigning champions Manchester City opening the defence of their title away at Tottenham.\nElsewhere in the first round of fixtures, Arsenal and European champions Chelsea will both take in London derby dates, with the former travelling to Premier League new boys Brentford and the latter hosting Crystal Palace.\nCity have another date with Chelsea on January 15, and the second north London derby of 2021-22 will be undertaken on the same day.\nADVERTISEMENTPremier League 2021-22 opening weekend fixturesDate Time Match14/08/2021 15:00 Brentford v Arsenal14/08/2021 15:00 Burnley v Brighton14/08/2021 15:00 Chelsea v Crystal Palace14/08/2021 15:00 Everton v Southampton14/08/2021 15:00 Leicester City v Wolverhampton14/08/2021 15:00 Manchester United v Leeds United14/08/2021 15:00 Newcastle United v West Ham United14/08/2021 15:00 Norwich City v Liverpool14/08/2021 15:00 Tottenham Hotspur v Manchester City14/08/2021 15:00 Watford v Aston VillaKey Premier League derby dates 2021-22Here is a handy breakdown of the main derby match dates this season.\nMerseyside derbyNovember 30, 2021 – Everton vs LiverpoolApril 23, 2022 – Liverpool vs EvertonManchester derbyNovember 6, 2021 – Man Utd vs Man CityMarch 5, 2022 – Man City vs Man UtdNorth-west derbyOctober 23, 2021 – Man Utd vs LiverpoolMarch 19, 2022 – Liverpool vs Man UtdNorth London derbySeptember 25, 2021 – Arsenal vs TottenhamJanuary 15, 2022 – Tottenham vs Arsenal"
  },
  {
    "headline": "FG: Road accidents claimed more lives in January than COVID-19, malaria",
    "summarized_story": "By Bolaji Ogundele, AbujaThe federal government has expressed worries over the increasing number of car crashes on the nation’s highways, saying road accidents claimed more lives in January 2021, than the combination of COVID-19 and malaria.\nHe said the Lagos-Ibadan Highway, the Abuja-Kano Highway, and Abuja-Keffi-Lafia Highway, have the highest cumulative number of road accidents, saying that for the month of February, more people died of road accidents than COVID-19 and malaria combined.\nFashola said three federal highways including Lagos-Ibadan, Abuja-Keffi-Lafia and Abuja-Kano highways were identified as the ones with the most number of casualties.\nIf we reduce accidents in those three main highways, we would have really dented the number,” he said.\nHe said drivers are responsible for 70 percent of the causes of the road crashes on Nigeria’s highways."
  },
  {
    "headline": "Woman bags 18 months jail term for stealing jewellery, perfume, others in Osun",
    "summarized_story": "By Toba Adedeji, OsogboAn Osun State Magistrate court, Ile-Ife on Wednesday sentenced a 30-year-old woman, named Toyin Akinyemi to 18 months imprisonment for stealing jewellery, perfume and electronics.\nToyin pleaded guilty to the offence of burglary and stealing of the properties of one Abdul Hammed Toheeb.\nThe prosecutor, Insp Sunday Osanyintuyi said on May 28, 2021, around 1:00 pm at Modomo area, Ile-Ife, Toyin broke into the house of one AbdulHammed Toheeb to steal one Hisense plasma TV valued at N72,000; one industrial machine cost N105,000; wristwatch valued at N70,000, a box of jewellery, valued N50,000, small collection perfume valued N4,000; a pair of sandals valued N15,000 and power bank valued N17,000.\nADVERTISEMENTOsanyintuyi noted that the offence contravenes sections 383, 390(9), 411 and 412 of the Criminal Code, Laws of Osun, 2002.\nMagistrate Bose Idowu sentenced Toyin to 18 months imprisonment without an option of fine noting that it would serve as a deterrent to others who would want to engage in such crime."
  },
  {
    "headline": "EFCC, ICPC get 14 days ultimatum to probe A’Ibom govt over council funds",
    "summarized_story": "It, therefore, issued 14 days ultimatum to the Economic and Financial Crimes Commission (EFCC) and the Independent Corrupt Practices and Other Related Offences Commission (ICPC) to begin the investigation.\nIt threatened hostilities and disruption of the activities of government and multinational oil companies in the state should the EFCC and ICPC fail to initiate a probe of how council funds are spent in the state.\nIt accused Governor Udom Emmanuel’s administration of tampering with council allocations totalling N2.23 trillion since taking over in 2015, a situation which has crippled grassroots development.\nBut the State House of Assembly has denied that local government council chairmen were running on zero allocation.\nHe said local government chairmen would be invited to the Assembly to state if they were actually operating on ‘zero’ allocation as alleged in some quarters."
  },
  {
    "headline": "Bandits Kidnap Rivers United Manager, Eguma",
    "summarized_story": "Rivers United FC manager, Stanley Eguma, is reported to have been kidnapped by bandits Tuesday.\nUnconfirmed sources said the kidnappers are demanding N10 million as ransom for his release.\nTop football sources in the Garden City said Eguma is believed to have been abducted around Enugu axis on his way back to Port Harcourt in his official car.\nWe just heard this and we are waiting to hear from the club management,” one source told a Port Harcourt-based football online site Tuesday.\nEguma was said to be travelling with two of his personal assistants and it is not known if they were also abducted alongside with him or have been released."
  },
  {
    "headline": "INEC Creates 56,872 New Polling Units",
    "summarized_story": "By Chuks OkochaThe Independent National Electoral Commission Wednesday announced the creation of additional 56,873 polling units.\nThis brings the number of polling units in the country to 176,846 polling units.\nThis was announced by the INEC chairman, Prof Mahmood Yakubu, in Abuja Wednesday morning.\nINEC also abolished polling units in private residences and palaces as well as hospitals and any other unauthorised places.\nINEC also said it had removed 749 polling units from inappropriate facilities, with nine of them from shrines and several others from religious houses, royal palaces and private property."
  },
  {
    "headline": "W’Bank: Rising Prices Pushed Seven Million Nigerians Below Poverty Line",
    "summarized_story": "Besides, the World Bank also attributed the deteriorating security situation in Nigeria and rising criminality to a lack of economic opportunities in the country.\nFood prices accounted for over 60 per cent of the total increase in inflation.\nLack of Economic Opportunities Fuelling Insecurity, Criminality in Nigeria, Says W’BankWhile speaking on ‘The Arise Xchange,’ a programme of ARISE NEWS Channel, Chaudhuri said lack of economic opportunities was contributing to the rising crime cases and insecurity in Nigeria.\nSimilarly, food inflation was highest in Kogi 32.82 per cent, Kwara 26.02 per cent and Enugu 25.43 per cent.\nAkwa Ibom, at 20.06 per cent; Bauchi, 18.65 per cent and Abuja 16.91 per cent recorded the slowest rise in year-on-year inflation."
  },
  {
    "headline": "CBN Seeks to Slash Importation by 35%",
    "summarized_story": "James EmejoThe Governor of the Central Bank of Nigeria (CBN), Mr. Godwin Emefiele, yesterday said efforts are ongoing to reduce the country’s import bill by about 35 per cent.\nThis, he said would help to reduce importation by about 35 per cent.\n“I got a message that the CBN system had been hacked into and I said the CBN system cannot be hacked into.\nThis followed a request by the CBG for a possible collaboration as it seeks to address acute currency shortages in the country.\nAlready, Emefiele, while receiving a delegation, assured that the CBN has extremely competitive advantage to manage the currency printing job for The Gambia."
  },
  {
    "headline": "Buhari Rallies West African States to Battle Insecurity",
    "summarized_story": "•Army chief says synergy now better among service chiefsDeji Elumoye and Udora Orizu in AbujaPresident Muhammadu Buhari yesterday called for unity among West African States and those in the Sahel to deal with security challenges in their respective nations.\nBuhari had appointed Yahaya to replace former COAS, Lt. Gen. Ibrahim Attahiru, who died in a plane crash in Kaduna.\nAt the army headquarters level here, all the service chiefs now luckily we were all mates in the academy.\n“I believe I have the requisite requirements by the grace of God to now provide my services in this office of the Chief of Army Staff, if confirmed.\n“I, therefore, hope that, if confirmed, the new chief of army staff will do everything possible, working with other service chiefs, to bring this to an end.”Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "UPDATE: Three Soldiers, 7 ISWAP Fighters Killed As Terrorists Invade Borno Military Base Ahead Of Buhari’s Visit",
    "summarized_story": "Militants belonging to the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP) on Tuesday razed a military formation in Kwamdi village, Damboa Local Government Area of Borno state.\nSaharaReporters gathered that three soldiers were killed during the attack while about seven members of factional Boko Haram sect also lost their lives.\nSee Also Breaking News BREAKING: Ahead Buhari’s Visit, Boko Haram Terrorists Set Military Base On Fire In BornoThe fighters were said to have stormed the area in 10 utility vehicles, and burnt down one Ammour Personal Carrier (APC) and a gun truck.\nAccording to a member of the Civilian Joint Task Force (JTF), Hamidu Abu, the deadly group targeted soldiers camp but not residents.\nAhead of his election in 2015, Buhari had promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled."
  },
  {
    "headline": "UPDATE: Three Soldiers, 7 ISWAP Fighters Killed As Terrorists Invade Borno Military Base Ahead Of Buhari’s Visit",
    "summarized_story": "Militants belonging to the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP) on Tuesday razed a military formation in Kwamdi village, Damboa Local Government Area of Borno state.\nSaharaReporters gathered that three soldiers were killed during the attack while about seven members of factional Boko Haram sect also lost their lives.\nSee Also Breaking News BREAKING: Ahead Buhari’s Visit, Boko Haram Terrorists Set Military Base On Fire In BornoThe fighters were said to have stormed the area in 10 utility vehicles, and burnt down one Ammour Personal Carrier (APC) and a gun truck.\nAccording to a member of the Civilian Joint Task Force (JTF), Hamidu Abu, the deadly group targeted soldiers camp but not residents.\nAhead of his election in 2015, Buhari had promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled."
  },
  {
    "headline": "BREAKING: Ahead Buhari’s Visit, Boko Haram Terrorists Set Military Base On Fire In Borno",
    "summarized_story": "Militants belonging to the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP) on Tuesday razed a military formation in Kwamdi village, Damboa Local Government Area of Borno State.\nThe attack comes two days to the planned visit of President Muhammadu Buhari to the State, which is the epicentre of insurgency war in Nigeria.\nAhead of his election in 2015, Buhari had promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, state capital, during a condolence visit.\nAccording to Daily Trust, Boko Haram terrorists overran a military formation in the Southern part of the state on Tuesday evening and carted away weapons belonging to the military during a gun duel."
  },
  {
    "headline": "BREAKING: Ahead Buhari’s Visit, Boko Haram Terrorists Set Military Base On Fire In Borno",
    "summarized_story": "Militants belonging to the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP) on Tuesday razed a military formation in Kwamdi village, Damboa Local Government Area of Borno State.\nThe attack comes two days to the planned visit of President Muhammadu Buhari to the State, which is the epicentre of insurgency war in Nigeria.\nAhead of his election in 2015, Buhari had promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, state capital, during a condolence visit.\nAccording to Daily Trust, Boko Haram terrorists overran a military formation in the Southern part of the state on Tuesday evening and carted away weapons belonging to the military during a gun duel."
  },
  {
    "headline": "BREAKING: Ahead Buhari’s Visit, Boko Haram Terrorists Set Military Base On Fire In Borno",
    "summarized_story": "Militants belonging to the Islamic State-backed faction of Boko Haram, the Islamic State West Africa Province (ISWAP) on Tuesday razed a military formation in Kwamdi village, Damboa Local Government Area of Borno State.\nThe attack comes two days to the planned visit of President Muhammadu Buhari to the State, which is the epicentre of insurgency war in Nigeria.\nAhead of his election in 2015, Buhari had promised to defeat Boko Haram but six years into his government, that promise has not been fulfilled.\nIn February 2020, residents of the state booed the President as his convoy drove in and when it was leaving Maiduguri, state capital, during a condolence visit.\nAccording to Daily Trust, Boko Haram terrorists overran a military formation in the Southern part of the state on Tuesday evening and carted away weapons belonging to the military during a gun duel."
  },
  {
    "headline": "Court jails Atuche, ex-Bank PHB boss, over N25.7bn fraud",
    "summarized_story": "An Ikeja high court has convicted Francis Atuche, a former managing director of the defunct Bank PHB, of N25.7 billion fraud.\n“The first defendant (Atuche) was diversionary and evasive on the witness stand; sometimes confrontational and rude.\nRather, it was the first defendant (Atuche).\nOn account of this, the prosecution failed to prove its case of stealing against the second defendant (Elizabeth),” Okunnu said.\nThe EFCC had later arraigned Atuche, his wife, Elizabeth, and Anyanwu for their involvement in N25.7 billion fraud."
  },
  {
    "headline": "Court jails Atuche, ex-Bank PHB boss, over N25.7bn fraud",
    "summarized_story": "An Ikeja high court has convicted Francis Atuche, a former managing director of the defunct Bank PHB, of N25.7 billion fraud.\n“The first defendant (Atuche) was diversionary and evasive on the witness stand; sometimes confrontational and rude.\nRather, it was the first defendant (Atuche).\nOn account of this, the prosecution failed to prove its case of stealing against the second defendant (Elizabeth),” Okunnu said.\nThe EFCC had later arraigned Atuche, his wife, Elizabeth, and Anyanwu for their involvement in N25.7 billion fraud."
  },
  {
    "headline": "Presidency: Twitter suspension has reduced spread of fake news by PDP governors",
    "summarized_story": "The presidency says governors on the platform of the Peoples Democratic Party (PDP) are sad over the suspension of Twitter in Nigeria, because it has affected the opposition party’s ability to spread “fake news”.\nReacting to the development, the PDP governors’ forum, in a communique on Monday, tackled the President Muhammadu Buhari administration over its decision to indefinitely suspend Twitter in Nigeria.\nWe hope that this is not a harbinger or early warning signs of descent into dictatorship,” the PDP governors had said.\nHowever, according to Shehu, the governors need to look inwards, especially as it relates to local government autonomy and addressing farmer-herder clashes in their domains.\n“Similarly, the governors appeal to each other for more involvement of States in mining and geophysical activities within their States."
  },
  {
    "headline": "Presidency: Twitter suspension has reduced spread of fake news by PDP governors",
    "summarized_story": "The presidency says governors on the platform of the Peoples Democratic Party (PDP) are sad over the suspension of Twitter in Nigeria, because it has affected the opposition party’s ability to spread “fake news”.\nReacting to the development, the PDP governors’ forum, in a communique on Monday, tackled the President Muhammadu Buhari administration over its decision to indefinitely suspend Twitter in Nigeria.\nWe hope that this is not a harbinger or early warning signs of descent into dictatorship,” the PDP governors had said.\nHowever, according to Shehu, the governors need to look inwards, especially as it relates to local government autonomy and addressing farmer-herder clashes in their domains.\n“Similarly, the governors appeal to each other for more involvement of States in mining and geophysical activities within their States."
  },
  {
    "headline": "FG seeks law to regulate social, online media",
    "summarized_story": "The federal government has asked the house of representatives to enact a law to regulate social and online media in Nigeria.\nAdvertisementAt a public hearing organised by the house on Wednesday, Lai Mohammed, minister of information, asked the lawmakers to amend the National Broadcasting Commission (NBC) act to empower the agency to regulate social and online media.\nAkin Akingbulu, executive director of the Institute for Media and Society, said the commission should not receive directives from the minister.\nAlthough no connection has been drawn, the government began moves to license social media companies after Twitter took down a tweet by President Muhammadu Buhari, after stating that the message violates its policy.\nAdvertisementTwo days after the incident, the federal government suspended Twitter in Nigeria and directed NBC to “immediately commence the process of licensing all OTT and social media operations in Nigeria”."
  },
  {
    "headline": "In-house vs. Agency: What tech startups can learn from the biggest question of the corporate world",
    "summarized_story": "While a lot of these ring true, the motivations for internal teams remain strong, and rightly so.\nThey are sometimes unsure how to extend this for external teams.\nA better way to save money is to combine an internal team of a few seasoned experts, some mid-level talents or interns with an experienced team (external) that is tasked with setting the foundation and helping to fully onboard (or sometimes train) the internal team.\nA continuous but cheaper path to continuity may involve the internal team doing the day-to-day work while using the guardianship of the external agency.\nVictor Fatanmi is the Managing Partner at FourthCanvas, a brand strategy and design agency focused on African tech ecosystems."
  },
  {
    "headline": "TechCabal has a new look",
    "summarized_story": "From local startup news to funding rounds across Africa, we’ve kept you up to date with all of it but most importantly, we’ve shown you how technology is positively impacting Africa.\nDark modeLight ModeTC Insights:Our TechCabal Insights team is always bringing you the best in actionable data and research.\nNow you can watch TC Live or Building From Ground Up episodes directly on our new website.\nCentre StageCentre Stage spotlights the people who are working behind-the-scenes in Africa’s tech and business ecosystem.\nThe TC Daily NewsletterWe publish the TC Daily newsletter, the most comprehensive roundup of technology around Africa."
  },
  {
    "headline": "Kenyan-based Mazi Mobility launches electric motorcycle fleet backed by Venture Builder Satgana",
    "summarized_story": "Mazi Mobility, a mobility-as-a-service (Maas) startup founded by Jesse Forrester, recently launched its flagship electric motorcycle fleet in Nairobi, Kenya.\nMazi Mobility is backed by global Venture Builder, Satgana.\n“Mazi is not just an EV company, we are advocates for a sustainable mass mobility change,” says Jesse Forrester, Co-Founder and CEO at Mazi Mobility.\nAs an e-mobility startup, Mazi Mobility fulfils one or more of the UN’s SDGs including SDG#8 (Decent Work and Economic Growth), SDG#11 (Sustainable Cities and Communities) and SDG#13 (Climate Action).\nAs a Venture Builder, we are humbled to be able to support Mazi in its mission to make urban transportation sustainable while empowering low-income drivers.”Share this article"
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Nigeria’s GIGL partners Nigeria’s JET Motor Company to launch the country’s first electric cargo vans",
    "summarized_story": "Nigerian logistics giant, GIG Logistics (GIGL), recently introduced four all-electric cargo vans into its Lagos fleet, in partnership with indigenous automaker, JET Motor Company (JET).\nThe original plan was to launch the ‘JET EV’ cargo line in Q3 2020.\nAdvertisementNigeria is ridden with epileptic power supply and other infrastructural challenges that make electric vehicles basically impractical and, as some would argue, near-pointless in the market.\nMoreover, Cape Verde appears to be the only African country whose government is actively looking (PDF) to phase out electric vehicles within the near future.\nWithin the next five to seven years, GIGL hopes to convert over 60% to 70% of its fleet to fully electric vehicles."
  },
  {
    "headline": "Nigeria’s telco workers strike, Helium Health in Kenya, MarketForce acquires Digiduka",
    "summarized_story": "Good day,Today, I’m discussing:Nigeria’s telecommunications workers to go on strikeHelium Health launches in KenyaMarketForce acquires DigidukaPlanned strike by Nigeria’s telecommunications workers.\nAdvertisementNigerians are no strangers to strike actions, but this would be the first by the country’s telecommunications workers.\nFollowing reports of a planned strike by telecommunications workers last year, the Federal Government stepped in.\nHelium Health launches in KenyaAdegoke Olubisi (CEO), Tito Ovia (Head, Public Growth Sector), Dimeji Sofowora (CFO)After announcing expansion plans last year, Nigerian healthtech startup, Helium Health, has finally launched in Kenya.\nMarketForce acquires DigidukaKenyan startup, MarketForce, has announced the acquisition of Digiduka."
  },
  {
    "headline": "Nigerian telecom workers to kick-off strike today; Data and call services may be disrupted",
    "summarized_story": "Reportedly, users may be unable to conveniently use data and call services during the three days as the strike is likely to disrupt these services.\nMoreover, in March 2021, the telecom association planned to embark on industrial strike action against Huawei Technologies Nigeria Limited, a telecom equipment company.\nHowever, following the Minister of Communications and Digital Economy, Dr Isa Pantami’s intervention, that strike action was suspended.\nWhile the association may be protesting for its rights, the disruptions of data and call services may affect the Nigerian economy.\nIt’s not certain if Pantami will intervene this time, neither is it known if the industrial strike action will aid the association’s demands."
  },
  {
    "headline": "Youth Corpers Disagree With Authorities, Seek National Assembly Intervention – Nigerian Observer",
    "summarized_story": "Authoritative source revealed that the authority of the National Youth Service Corps ( NYSC) have denied applications for redeployment from the north tendered by some southern corps members, mainly doctors, nurses, pharmacists and other healthcare professionals.\nThe medical corps members are worried about their lives due to the insecurity in the northern region where cases of Boko Haram, herdsmen and banditry violence have worsened in recent times.\nHe also noted that there were hardly any provisions made for the corps members in terms of accommodation and security.\nThis is to the Director-General of NYSC; please allow all corps members to relocate or redeploy to their states of choice.\n“The accommodation they give corps members is not befitting."
  },
  {
    "headline": "Orhionmwon NULGE inaugurates new excos – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestORHIONMWON – The newly elected executives of Orhionmwon chapter of National Union of Local Government Employees (NULGE) were on Tuesday inaugurated at the council secretariat, Abudu, Edo State.\nSpeaking after their oath taking, the new Orhionmwon NULGE chairman, Osagie Kingsley called for unity among council staff, adding the time of election was over.\nHe assured the council management of continuous workers support “to build the local government and place it where it ought to be”.\nThe outgone chairman, Mathew Ighodaro spoke with our correspondent immediately after ceremony, wished the newly inaugurated executives well, praying they surpass his achievements.\nThe newly inaugurated excos include the Chairman, Osagie Kingsley, Vice chairman, Osazee Joseph, chairperson, Mrs Alenokhuorie Bridget, Secretary, Omoruyi Kelvin, others are Assistant secretary, James Paul, Treasurer, Mrs Ayeboze Osifo, Auditor, Harrison Onaghise."
  },
  {
    "headline": "Edo State Education Board Commends Philanthropist for School Donation – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – In recognition of the contributions to the development of education in the state and empowerment of students, the Edo State Universal Basic Education Board has commended philanthropist and “entrepreneur” Dennis Ainabel Iseghohimen.\nHe ascribed all the glory to God for his help and pledged to persist in seeking ways to contribute to the socio-economic development of Esan land and Edo State.\nMr. Iseghohimen called on other well-meaning individuals to support the government’s effort to improve the quality of life in communities across not just Esan West but also the whole Edo State.\nThe philanthropist had earlier renovated Eresoyen Primary School in Uhogua, Community in Edo State and is constantly looking for new options to give back to the community.\nDennis Ainabel Iseghohimen is the founder and Director of Nicholas Auto Solution (NAS), www.nicholasautosolution.co.za, Founder, ROTBW Foundation www.rotbwfoundation.com among other businesses."
  },
  {
    "headline": "Aiteo Cup Tourney as EFA,Others Condemn Remo Attack – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The defending champions of Edo State FA/Aiteo Cup Bendel Insurance Football Club of Benin have been nominated to represent the state in this year’s Federation/Aiteo Cup competition.\n“We considered the psychological trauma and other physical injuries Insurance suffered in Remo attack and their capacity to give the rest of us in Edo football family, adequate representation during the competition before arriving at our decision.\nThe visitors who expressed disappointment over the attack, encouraged Insurance to be strong, assuring them of continued support.\n” We are visiting you after a week of the attack on you doesn’t mean we do not care about you.\nThe Barbaric act of Remo is capable of bringing Nigeria’s football to disrepute if not checked.”Abu reacted."
  },
  {
    "headline": "Pastor kills wife, buries corpse in shallow grave",
    "summarized_story": "ADVERTISEMENTA pastor in Akwa Ibom State, Nigeria’s South-south, has been detained by the police for allegedly killing his wife.\nThe pastor has been identified as Chris Enoch, the founder of Omega Word Global Ministries.\nThe youths of the community, led by their president, Mr Johnson, who is also a ‘community police officer’, went to search the pastor’s compound and were shocked to discover the woman’s corpse buried in a shallow grave.\n“I am just coming from the (police) station now, he just opened up that he killed the woman about seven days ago,” Mr Johnson said.\n“On this particular day, the man chased the children away when he and the wife started fighting,” he added."
  },
  {
    "headline": "Business Hallmark",
    "summarized_story": "Night-grazing is banned with immediate effect.\nMovement of cattle within cities and highways is prohibited Under-aged grazing of cattle is outlawed.\nthose who wish to carry on with their cattle-rearing business to register"
  },
  {
    "headline": "Gwamnatin Tarayya Ta Ba Kanawa 320 Aikin Duba Shiri Tare Da Na’urori",
    "summarized_story": ""
  },
  {
    "headline": "Tattalin Arzikin Sin Zai Ci Gaba Da Ingiza Ci Gaban Tattalin Arzikin Duniya",
    "summarized_story": ""
  },
  {
    "headline": "Firaministan Burtaniya: Da Alamun COVID-19 Ba Daga Dakin Binciken Kasar Sin Ta Bulla Ba",
    "summarized_story": ""
  },
  {
    "headline": "Kasar Sin Za Ta Taimakawa Kasashen Musulmi Kara Karfinsu Na Yaki Da COVID-19",
    "summarized_story": ""
  },
  {
    "headline": "Kowa Ya Bar Gida, Gida Ya Bar Shi",
    "summarized_story": ""
  },
  {
    "headline": "Gunmen Behead Imo Lawmaker’s Gateman, Set House Ablaze —",
    "summarized_story": "Unknown gunmen stormed the country home of Ekene Nnodumele, the member of the Imo State House of Assembly representing Orsu State Constituency, in Ebenato, Awo Idemili, on Wednesday, beheading a gateman on duty and setting the house on fire.\nImo state has recently been subjected to a slew of attacks, particularly against security forces.\nArmed men stormed the Imo State Police Command and the Nigerian Correctional Service headquarters in Owerri on April 5, setting fire to the buildings and releasing nearly 1,800 convicts.\nThe state governor’s country residence, Hope Uzodinma’s, in Omuma, Oru East Local Government Area of the state, was invaded by gunmen a few days later.\nThey set fire to part of the structure and torched some vehicles in the property during the attack, killing at least one security official."
  },
  {
    "headline": "ISWAP attack Military base in Borno ahead of Buhari’s visit",
    "summarized_story": "Naija News gathered that ISWAP fighters stormed the military base at Kwamdi village, Damboa local government area in 10 utility vehicles.\nA security source told DailyTrust that the base came under attack from gunmen believed to be ISWAP fighters at about 4 pm and it lasted for about an hour and 30 minutes.\nThe source added that fighters seized the opportunity of the sand storm to penetrate the base.\n“Our base at Kwamdi came under attack but we didn’t lose any of our personnel to the attackers, unfortunately the base suffered some damages,” the security source said.\nSpeaking on Buhari’s visit, Governor Babagana Zulum said the President would be appraising the security situation in the northeast."
  },
  {
    "headline": "Police Nabs Fake medical doctor In Bayelsa — Daily Times Nigeria",
    "summarized_story": "Aherhoke Okioma, YenagoaThe Bayelsa State Police Command has paraded a suspect who has been claiming to be a medical doctor in Bayelsa and Delta states.\nHe said the fake medical doctor had been going round seeking for jobs claiming to be Dr. Charles Umeh a serving medical doctor in Taraba state, meanwhile his real name is Akpoviri Vincent Jimmy.\nThe State Chairman of the Nigerian Medical Association (NMA), Dr. Ngowari Torunana said he got the information on Monday from Tobis Clinic that they had restrained a fake medical doctor.\nDr. Torunana said he told the hospital in Ughelli that he was working as a medical doctor in Tobis Clinic for four months and handles most of their surgeries.\nThe 49 year old suspect, Mr. Akpoviri Vincent Jimmy revealed to newsmen that he is a graduate of Psychology from Delta State University."
  },
  {
    "headline": "Unknown Gunmen Allegedly Killed Informant Behind Capture Of ESN Commander, Ikonso",
    "summarized_story": "Gunmen have killed a middle-aged man suspected of being one of the Nigerian Army’s spies in the death of Ikonso Don, the late commander of the Indigenous People of Biafra’s Eastern Security Network (ESN).\nSaharaReporters were able to capture horrific photographs of the victim’s body, which was shot dead along a rural footpath while the shooters fled the scene.\n“The victim is alleged to be the informant the military and the police used in getting Ikonso’s location and in killing him.\nSome said the informant was also a member of the ESN but others said he was a former IPOB member, renounced them and came to the village to hide.\nOn April 26, SaharaReporters claimed that an operation by the Nigerian Army against the ESN and IPOB in Awomama Village in the Oru East Local Government Area of Imo State resulted in the killing of Ikonso Don, an ESN top commander."
  },
  {
    "headline": "Biden, Putin’s historic handshake kicks off Geneva summit",
    "summarized_story": "Joe Biden and Vladimir Putin kicked off their summit Wednesday with a handshake outside the Geneva villa where the two presidents plan to confront each other over the worst US-Russia tensions in years.\nFollowing an introduction by their host, Swiss President Guy Parmelin, Biden extended his arm for his first handshake with Putin since taking office in January.\nBiden, ending an intensive first foreign trip as president, arrived in Geneva after summits with NATO and the European Union in Brussels, and a G7 summit in Britain.\nAsked if he was ready for Putin, Biden smiled and said: “I’m always ready.”– Optimism?\nBiden’s team likewise expects no “big set of deliverables”, the senior Biden official said."
  },
  {
    "headline": "Biden, Putin’s historic handshake kicks off Geneva summit",
    "summarized_story": "Joe Biden and Vladimir Putin kicked off their summit Wednesday with a handshake outside the Geneva villa where the two presidents plan to confront each other over the worst US-Russia tensions in years.\nFollowing an introduction by their host, Swiss President Guy Parmelin, Biden extended his arm for his first handshake with Putin since taking office in January.\nBiden, ending an intensive first foreign trip as president, arrived in Geneva after summits with NATO and the European Union in Brussels, and a G7 summit in Britain.\nAsked if he was ready for Putin, Biden smiled and said: “I’m always ready.”– Optimism?\nBiden’s team likewise expects no “big set of deliverables”, the senior Biden official said."
  },
  {
    "headline": "PDP to Lawan: Return Onochie’s nomination or face civil action",
    "summarized_story": "The Peoples Democratic Party has threatened civil action against the Senate President, Ahmed Lawan, if he fails to return the nomination of presidential aide, Lauretta Onochie, as a National Commissioner in the Independent National Electoral Commission.\nThe statement read in part, “The PDP charges Senator Gaya to immediately stand down all deliberations that concern Onochie before his committee.\n“Senator Lawan must know that Nigerians are now holding him directly answerable for gross misconduct and impeachable act of perfidy for sending Onochie’s already rejected nomination to the Gaya’s Committee, in utter violation of the provisions of the 1999 Constitution (as amended) and total derision for the sensibility of Nigerians.\n“Our party reminds Senator Lawan that the reasons that forced his hands to stand down Onochie’s faulted nomination eight months ago have neither changed nor abated.\n“Therefore, the PDP directs our members and other democratically minded members of the National Assembly, across party lines, to activate and deploy all legislative instruments at their disposal against Onochie’s confirmation as a National Commissioner of INEC."
  },
  {
    "headline": "PDP to Lawan: Return Onochie’s nomination or face civil action",
    "summarized_story": "The Peoples Democratic Party has threatened civil action against the Senate President, Ahmed Lawan, if he fails to return the nomination of presidential aide, Lauretta Onochie, as a National Commissioner in the Independent National Electoral Commission.\nThe statement read in part, “The PDP charges Senator Gaya to immediately stand down all deliberations that concern Onochie before his committee.\n“Senator Lawan must know that Nigerians are now holding him directly answerable for gross misconduct and impeachable act of perfidy for sending Onochie’s already rejected nomination to the Gaya’s Committee, in utter violation of the provisions of the 1999 Constitution (as amended) and total derision for the sensibility of Nigerians.\n“Our party reminds Senator Lawan that the reasons that forced his hands to stand down Onochie’s faulted nomination eight months ago have neither changed nor abated.\n“Therefore, the PDP directs our members and other democratically minded members of the National Assembly, across party lines, to activate and deploy all legislative instruments at their disposal against Onochie’s confirmation as a National Commissioner of INEC."
  },
  {
    "headline": "Faces of Indianapolis shooter Brandon Scott Hole",
    "summarized_story": "By AbankulaPolice authorities in Indianapolis on Friday released the photo of Brandon Scott Hole, the 19-year-old former FedEx worker, who killed eight people Thursday night.\nThe release of his photo corrected false images of the shooter earlier published in the social media.\nHole went on a shooting spree at the FedEx facility before turning the gun on himself.\nAccording to reports, he last worked for FedEx in 2020.\nCops still don’t know his motive and where he got the rifle he used."
  },
  {
    "headline": "52 Nigerians hit with severe reactions after taking AstraZeneca vaccine",
    "summarized_story": "By Kazeem UgbodagaThe National Primary Health Care Development Agency, NPHCDA, on Friday disclosed that 52 Nigerians have experienced moderate to severe reactions after taking the AstraZeneca vaccine.\nExecutive Director and Chief Executive Officer, NPHCDA, Dr. Faisal Shuaib disclosed this at a news conference in Abuja.\nHe also said 8,439 Nigerians experienced mild Adverse events following immunization (AEFI) after taking the vaccine.\n“Similarly, 52 cases of moderate to severe incidents of AEFI have been reported.\nAccording to Shuaib, as of today, April 16th, 1,071,346, representing 53.2% of the eligible persons targeted with the AstraZeneca vaccine had been administered their first dose in this vaccination phase."
  },
  {
    "headline": "JUST IN: Former Keystone Bank MD, Atuche Sentenced To Six Years’ Imprisonment For N25.7bn Fraud",
    "summarized_story": "Francis Atuche, a former Managing Director of the defunct Bank PHB (now Keystone Bank), was sentenced to six years in prison by an Ikeja High Court for defrauding the bank of N25.7 billion.\nJustice Lateefa Okunnu also sentenced Ugo Anyanwu, the bank’s former Chief Financial Officer, to four years in prison in a 10-hour decision.\nThe judge ruled that the Economic and Financial Crimes Commission had shown the defendants’ guilt beyond a reasonable doubt.\nOkunnu, on the other hand, released Atuche’s wife Elizabeth, who was on trial with the couple.\nDetails later…"
  },
  {
    "headline": "Nigeria Is On Life Support, Nobody Knows What Will Happen Next – Gov Wike",
    "summarized_story": "Nigeria, according to Rivers State Governor Nyesom Wike, is presently on life support.\nOn Wednesday, Wike spoke during the inauguration of the Isaiah Odoli/Omerelu Streets in New GRA Phase 1 in the Obio-Akpor Local Government Area.\n“If you turn on the television or read the newspaper, you’ll hear that so and so many people have been slaughtered or kidnapped in so and so state.\nThe country is running out of oxygen (life support).\nWike stated, “No one knows what will happen next.”He also urged well-intentioned Nigerians to keep praying for the country."
  },
  {
    "headline": "Buhari Should Personally Lead Peace Talks With Us To End Insecurity — Bandit Leader Says [Video]",
    "summarized_story": "We are just being killed,” the leader of the gang said in the video.\nSpeaking, the leader of the marauding gang said President Muhammadu Buhari should head the peace talks if he is serious about ending banditry and insecurity in the country.\nHe does not take these peace talks seriously and every day people are being killed.\nGunmen kill, soldiers kill, vigilantes kill.\nYou will see one person having as much as 1,000 hectares, just because he is rich,” the leader said."
  },
  {
    "headline": "BREAKING: Ahead Buhari’s Visit, Boko Haram Terrorists Set Military Base On Fire In Borno",
    "summarized_story": "The Islamic State-backed Boko Haram group, the Islamic State West Africa Province (ISWAP), razed a military formation in Kwamdi village, Damboa Local Government Area, Borno State, on Tuesday.\nThe incident comes only two days before President Muhammadu Buhari’s planned visit to the state, which is the epicenter of Nigeria’s insurgency fight.\nBuhari promised to defeat Boko Haram before his victory in 2015, but that promise has yet to be fulfilled six years later.\nThe President will visit Borno for the first time since the February 2020 crisis on Thursday.\nAccording to the Daily Trust, Boko Haram militants overran a military formation in the state’s southern region on Tuesday evening and carted away military weaponry after a gunfight."
  },
  {
    "headline": "Ondo poll: Appeal Court throws out Jegede’s petition, PDP heads to Supreme Court",
    "summarized_story": "Jegede Blueprint recalls had approached the appellate Court alleging that Akeredolu’s nomination by his party was unconstitutional.\nIn her judgment, the lead judge, Theresa Orji-Abadua, held that the case filed by the PDP candidate in the election lacked merit.\nMeanwhile, PDP in Ondo state and its candidate at the October 2020 gubernatorial election are set to challenge the Court of Appeal decision at the Supreme Court.\nBut we have sufficient grounds to appeal the decision of the Court.\nWe are confident the Supreme Court which is the highest court in the land will do justice”."
  },
  {
    "headline": "Breaking: Again, APC’s Akerodolu conquers PDP’s Jegede in Ondo",
    "summarized_story": "The Court of Appeal in Akure has dismissed the petition filed by Mr Eyitayo Jegede (SAN), the governorship candidate of the Peoples Democratic Party (PDP) in the October 2020 governorship election of Ondo State against the election of Governor Rotimi Akeredolu of the ruling All Progressive Congress (APC).\nReading the lead judgment virtually, Justice Theresa Ngolika Orji-Abadua, said the case filed by Jegede lacks merit.\nDetails loading…"
  },
  {
    "headline": "VIDEO: Atlast, UFC Champion, Kamaru Usman, returns home state Edo",
    "summarized_story": ""
  },
  {
    "headline": "All online broadcasters, Twitter to be regulated-Lai Mohammed to NASS -NigPilot",
    "summarized_story": "Following the tide of the face-off between the Federal Government and Social Media giant, Twitter, Minister of Information and Culture, Lai Mohammed has urged the House of Representatives to include its regulation in the National Broadcasting Commission Act.\nThe minister made the call at the public hearing on a bill to amend the NBC Act organised by the House Committee on Information.\n“I will want to add that specifically, internet broadcasting and all online media should be included in this because we have responsibility to monitor content; including Twitter,” he said.\nAkingulu also called for the confirmation of the Director-General of the NBC by the National Assembly.\nThe call by Mohammed is coming on the heels of the restriction of Twitter by the federal government."
  },
  {
    "headline": "NLNG Train 7 project will boost Nigeria’s foreign exchange – APC -NigPilot",
    "summarized_story": "All Progressives Congress, APC, has expressed confidence that the newly flagged off construction of $10 billion Nigerian Liquified Natural Gas (NLNG) Train 7 project by President Muhammadu Buhari on Tuesday will not only take Nigeria’s capacity to process its abundant gas deposit to about 30 million metric tones annually but will also boost the country’s foreign exchange earnings, as well as create thousands of jobs.\nAccording to the statement, the Train 7 which is designed to produce 8 million metric tones of Liquified Natural Gas (LNG) and condensates annually promises to lift Nigeria’s LNG production to 30 million metric tones per annum from the current 22 million metric tones.\nThe APC boasted that the project will boost Nigeria’s foreign exchange earning, create thousands of jobs during and after construction, contribute to the country’s industrial development as well as encourage the use of gas as fuel of choice for domestic purposes.\n“Nigeria has embarked on other gas-utilisation projects including the National Gas Expansion Programme, the construction of the 614-km Ajaokuta-Kaduna-Kano (AKK) gas pipeline and the Autogas policy.\n“With these projects coming to fruition, Nigerians would tremendously benefit as more of the 600 trillion Nigeria’s gas endowment is processed and converted into commodity,” the statement reads in parts."
  },
  {
    "headline": "2023: stakeholders drum support for Sen. Laah’s re-election bid -NigPilot",
    "summarized_story": "Former member of the House of Representatives who represented Kachia/Kagarko, Federal Constituency of Kaduna State, at the Green chamber of the 6th Assembly, Hon.\nAdams Jagaba Adams has also indicated interest to slug it out with the incumbent Senator at the PDP Senatorial primary billed for February 2022.\nWhile expressing his support for Senator Danjuma Laah’s aspiration to seek re-election, a three-term member of Kaduna State House of Assembly Hon.\nHe added that Sen. Laah is not only a political heavyweight in the entire Southern Kaduna but also a well-known politician and a businessman from Kaura LGA of Kaduna state.\n“This is a very serious challenge for Southern Kaduna."
  },
  {
    "headline": "Child Labour Day 2021: FG ratifies ILO Conventions – Ngige -NigPilot",
    "summarized_story": "Minister for Labour and Employment, Dr Chris Ngige, has said that the Federal Government has created an enabling environment for the fight against Child Labour through the ratification and adoption of key International Labour Organization, ILO Conventions.\nHe disclosed this to Journalists yesterday, in Abuja, as part of activities lined up for the commemoration of the 2021 World Day against Child Labour.\nNgige noted that Government had also approved a number of policy documents on Child Labour, and ratified and domesticated International Conventions against child labour, as well as adopted other measures.\nCountry Director of the ILO Office for Nigeria, Ghana, Liberia and Sierra Leone, Ms Vanessa Lerato Phala, commended Nigeria for taking committed and conscious steps in working with the global community to fight child labour.\nShe called for collaboration among social partners, with contributions from international agencies and international donor communities, in order to deal with poverty and inequality, which she described as drivers of child labour."
  },
  {
    "headline": "Court Sentences Former Bank PHB Boss, Francis Atuche To Over 6 Years In Prison",
    "summarized_story": "A Lagos High Court sitting in the Ikeja area has sentenced former managing director of defunct Bank PHB, Francis Atuche to over 6 years in prison.\nIn a judgment that lasted over 10 hours, Justice Lateefat Okunnu convicted Atuche alongside a former Chief Financial Officer of the bank, Ugo Anyanwu.\nIn delivering her sentence, Justice Okunnu held that the EFCC successfully proved its case against the convicts beyond a reasonable doubt.\nShe specifically held that Atuche and Anyanwu abused their powers, ignored established rules and regulations thereby putting the bank and depositors’ funds in danger.\nJustice Okunnu held that she had considered the plea of the convicts, but there must be consequences for wrongdoing, adding that sentences are not just for punishment but also for deterrence."
  },
  {
    "headline": "PDP Governors’ Forum Communique Ignores Real Solutions, Says Presidency",
    "summarized_story": "The Presidency has said that the latest Peoples Democratic Party (PDP) Governors’ Forum communiqué is a spectacular demonstration to Nigerians as to why the opposition party and its representatives should not be entrusted with the national leadership of the country at any time soon.\nWhat the governors are asking of NNPC is to “break the bank” for their own profligate political ends”.\nThis would damage exports – including oil revenues on which NNPC depends – as well as damage small businesses and employment.\nBut an appreciated currency would benefit those spending on luxuries from abroad – this, no doubt, being the leading desire of a typical PDP governor.\nAccording to him, such opportunities and states’ powers have been fully available since independence – yet only now do the PDP realise it."
  },
  {
    "headline": "Gunmen Kill One, Abduct Two Chinese In Taraba",
    "summarized_story": "Gunmen suspected to be bandits have killed one person and kidnapped two nationals of the Republic of China in Taraba State.\nMr David Misal, the Police Public Relations Officer in the state, confirmed the incident to Channels Television via a telephone interview on Wednesday.\nThe said community is a boundary town between Benue and Taraba States and has been in the news for attacks arising from mining activities in the area.\nAccording to the Police Public Relations Officer, no contact has been established with the abductors to know what their demands are.\nThis incident comes after weeks of no reported case of kidnap or attack and counter-attack in the area."
  },
  {
    "headline": "Alleged Sexual Assault: Baba Ijesa Pleads Not Guilty, Court Denies Him Bail",
    "summarized_story": "On his part, counsel to the defendant, Kayode Olabiran made a fresh application for bail of Baba Ijesha.\nHe said the matter has been already filed at the High Court, and he urged the court to refuse bail.\nIn his ruling, Magistrate Peter Nwaka refused to vary his bail condition on charges of rape, sexual assault, and abuse of a minor.\nAfter considering all the submissions, Magistrate Nwaka declined to grant the defendant bail on the grounds that he no longer had jurisdiction over the matter.\n“Since there are indications that the matter is before the high court and the defendant will appear before the court, no bail can be given,” the Magistrate said."
  },
  {
    "headline": "LeBron Blasts NBA As Playoff Injuries Mount Security’",
    "summarized_story": "Los Angeles Lakers superstar LeBron James slammed the NBA on Wednesday as Clippers star Kawhi Leonard became the latest player forced out of the playoffs by injury.\n“They all didn’t wanna listen to me about the start of the season,” James tweeted.\nBrooklyn’s Kyrie Irving is set to miss a second straight game of the Nets’ second-round series against Milwaukee after teammate James Harden missed three straight contests.\nThe Philadelphia 76ers have coped with injuries that sidelined Joel Embiid, while Utah has dealt with injuries to Donovan Mitchell and Mike Conley.\n“This is the best time of the year for our league and fans but missing a ton of our fav players,” he tweeted."
  },
  {
    "headline": "Sergio Ramos to leave Real Madrid after 16 years",
    "summarized_story": "Sergio Ramos will leave Real Madrid this summer, the club have confirmed.\nA press conference will be held on Thursday to formally announce the Real captain’s departure after 16 years at the club.\nRamos joined Real from Sevilla in 2005 and has made 671 appearances for La Liga club, winning five league titles, two Copa del Reys, four Champions Leagues and four Club World Cups.\nIt was during his time in the Spanish capital that he also won the 2010 World Cup with Spain along with back-to-back European Championships in 2008 and 2012.\nAdvertisementThe 35-year-old will be a free agent and a host of top clubs are already reported to be interested in signing him."
  },
  {
    "headline": "Update: Court Convicts former Bank PHB MD, Francis Atuche, discharges wife -",
    "summarized_story": "An Ikeja Division of the Lagos State High Court has convicted the former managing director of the defunct Bank PHB Plc, Francis Atuche, and the bank’s former chief financial officer, Ugo Anyanwu.\nThe former bank chief, his wife, and Mr Anyanwu are accused of stealing N25.7 billion belonging to the bank.\nThey were arraigned in 2011 before Justice Lateefat Okunnu of the Ikeja Division of the Lagos State High Court.\nAdvertisementMr Atuche is also standing trial over N125 billion alleged fraud before the Lagos Division of the Federal High Court.\nThe case was subsequently transferred to Justice Ayokunle Faji and the defendants wwere re-arraigned in 2017."
  },
  {
    "headline": "Children in Zamfara celebrate Day of the African child in colourful ceremony",
    "summarized_story": "Children in Zamfara state have joined their counterparts across the globe to celebrate this year’s day of the African child with a call on government to give more attention to children with special needsThey want government at all level to deal decisively with persons stepping on the right of children especially in crisis communitiesSixteen June every year is celebrated as the day of the African child to commemorate the day students in soweto South Africa matched in protest against discrimination in education were brutally murderedThe day of the African child was first celebrated in 1991 as a day to remember those who lost their lives in the struggle for equal access to educationChildren in Zamfara state wants government at all level to redouble its effort in protecting the right of children especially in troubled areasAdvertisementThey also want more attention given to to children with special needs in schools and other public placesThe speaker of the Zamfara children parliament Sa’adutu Lawal and two other members of the parliament Abdulrahaman MuktarAnd Nusaiba Abdulnasir said the increasing rate of child abuse in Nigeria is worrisomeThey add that the right and protection of children should be of priority to any government, adding that children should be given their right as it in the holy booksThe Deputy vice chancellor Federal University Gusau Professor Bilkisu Shinkafi and the permanent secretary, Zamfara State Minnisrty of women affairs Halima Muhammad Permanent Secretary, Ministry Of Women Affairs, Zamfara State appeal to parents to ensure the right of their children is respectedThe duo said as parents they will do everything within their reach to discourage child abuse but encourage girl child EducationAdvertisementThe colorful ceremony which brought children from across the state was organized by the Zamfara state ministry for women affairs and children in collaboration with Save the children InternationalTraditional and religious leaders, heads of government and security agencies, women and children attended the event."
  },
  {
    "headline": "Algeria’s Ruling National Liberation Front Wins Most Parliamentary Seats",
    "summarized_story": "Algeria’s ruling party, the National Liberation Front (FLN), has won most seats in last Saturday’s parliamentary election, which saw a low turnout of 23%.\nThe FLN grabbed 105 out of 407 available seats, followed by an historic win for independent candidates who took 78 seats.\nThe National Democratic Rally (RND), the party that was in power under former President Abdelaziz Bouteflika, won 57 seats, while the largest Islamic party the Movement for the Society of Peace (MSP) won 64.\nOnly 5.6 million voters cast their ballots out of the 24.6 million registered, according to the final results announced by the electoral commission.\nThe election was boycotted by the popular protest movement known as Hirak, along with other political parties."
  },
  {
    "headline": "Namibia Imposes Fresh Coronavirus Prevention Restrictions as Cases Spike",
    "summarized_story": "Public gatherings in Namibia will now be limited to ten people and should last no more than two hours if held indoors.\nThis comes as per Tuesday’s decree in a move to stem the drastic increase in new COVID-19 infections, hospitalizations and deaths in the country.\nThe new sanitary measures and restrictions are to ideally improve the situation in Namibia.\nThe Southern African nation currently sees the highest number of new cases per million people per day after Seychelles — according to the African Centre for Disease Control and Prevention.\nNamibia reports 1,040 deaths and .a total of 67,021 confirmed COVID-19 cases — of which over 1,200 were detected on Tuesday."
  },
  {
    "headline": "Man City Begins Title Defence at Tottenham, Man Utd Host Leeds, Liverpool visit Norwich on 2021/22 Premier League",
    "summarized_story": "Premier League champions Manchester City get their 2021/22 title defence underway at Tottenham Hotspur when the new season kicks off on the weekend of August 14.\nThe fast start to the season continues with Arsenal vs Chelsea the following weekend, August 21, before Arsenal travel to Manchester City and Chelsea face Liverpool at Anfield on August 28.\nMan City visit local rivals Manchester United on November 6, but the return match at the Etihad marks the start of a potentially key run of games for Ole Gunnar Solskjaer’s men.\nLiverpool goes to Old Trafford on October 23, while the north London derby is scheduled for September 25 at Arsenal’s Emirates Stadium and January 15 at Tottenham.\nUnited and Chelsea meet at Old Trafford on the penultimate weekend before the season’s final round of games takes place on May 22."
  },
  {
    "headline": "‘Two Great Powers’: Biden, Putin Plunge into Hours of Talks",
    "summarized_story": "Biden and Putin first held a relatively intimate meeting joined by U.S. Secretary of State Antony Blinken and Russian Foreign Minister Sergey Lavrov.\nBiden and Putin were expected to meet for a total of four to five hours of wide-ranging talks.\nPutin flew into Geneva on Wednesday shortly before the scheduled start of the meeting; Biden — who was already in Europe for meetings with allies — arrived the day before.\nAfter the meeting concludes, Putin is scheduled to hold a solo news conference, with Biden following suit.\nRussia’s ambassador to the U.S., Anatoly Antonov, was recalled from Washington about three months ago after Biden called Putin a killer; U.S."
  },
  {
    "headline": "Nigeria: INEC Announces Ekiti, Osun Off-season Guber Polls",
    "summarized_story": "The Independent National Electoral Commission (INEC) on Wednesday announced dates for conducting the governorship elections in Ekiti and Osun states.\nYakubu says the elections are part of the remaining off-season end of tenure elections ahead of the 2023 General Election.\n“In the sequence of off-season elections, the Ekiti and Osun State Governorship elections are holding next year.\nWe implore political parties and aspirants to ensure rancour-free primaries and thereafter conduct peaceful electioneering campaigns.”INEC also announced the creation of an additional 56, 872 polling units across the country.\nProf. Yakubu said Nigeria now has a total of 176, 846 Polling Units from the initial 119, 973 following the conversion of voting points and voting points settlement to full-fledged Polling Units."
  }
]