[
  {
    "headline": "Troops kill 1,910 bandits, terrorists, others in seven months",
    "summarized_story": "The Defence Headquarters has said troops in various operations across the country have killed no fewer than 1,910 bandits, terrorists, kidnappers, among others, between May 20, 2021, and January 6, 2022.\nOnyeuko said, “In summary, the Armed Forces of Nigeria from 20th May 2021 to 6th January 2022 neutralized 1,910 criminal elements including terrorists, armed bandits, and robbers as well as kidnappers across the country.\n“This is in addition to scores of other terrorists and armed bandits killed during airstrikes within the period.\nTroops also rescued a total of 729 kidnapped victims across the Country.\nHe also said about 38,582 barrels and 6,491,000 litres of stolen crude oil as 11,659,500 litres of illegally refined Premium Motor Spirit were recovered and handed over to appropriate authorities."
  },
  {
    "headline": "Aisha Buhari facilitates employment of two physically challenged ex-corps members",
    "summarized_story": "The First Lady of Nigeria, Aisha Buhari, has facilitated the employment of two physically challenged ex-corps members, Onogberie Efe Lulu and Nuruddeen Tahir, in the federal civil service.\nIbrahim expressed gratitude to the First Lady for her sustained interest in the success of NYSC and the welfare of corps members.\nThe Director-General congratulated the new employees and enjoined them to reciprocate the gesture of the First Lady by being dedicated to their duties.\nResponding, Lulu and Tahir both expressed gratitude to the First Lady for her benevolence and prayed to the Almighty to reward her.\nBoth youths assured that they would utilise the opportunity given to them to render even greater services to the nation."
  },
  {
    "headline": "Polytechnic: Librarian calls for inclusion in Governing Council",
    "summarized_story": "Librarians in polytechnics, have called for the inclusion of their colleagues in Governing Council meetings as Principal Officer, noting that Polytechnic Librarians are critical stakeholders in Polytechnic education and management.\nThe Committee of Monotechnic and Polytechnic Librarians in Nigeria, Made this demand during their 59th regular meeting ,held at the Federal Polytechnic, Ado-Ekiti in 2021.\n“We commend the creation of Centres of Excellence for special funding by TETFund and urged TETFund to sustain this development.\nWe observe with concern the omission of Polytechnic Librarians in payment of responsibility allowance by IPPIS.\n“We also commend the creation of Zonal Offices by NBTE which is aimed at bringing its services closer to the institutions and initiate further advancement of the Polytechnic system”."
  },
  {
    "headline": "NGX facilitates N7trn capital raising in 2021",
    "summarized_story": "•As investors gain N243bnBy Peter EgwuatuThe Nigerian Exchange Limited, NGX, facilitated over N7 trillion worth of capital raises across several asset classes for both public and private corporations in 2021.\nThe Exchange stated this yesterday during the listing of BUA Foods Plc, stressing that as a multi-asset Exchange, NGX is strategically positioned to be the preferred listing and investment destination connecting Nigeria, Africa and the world.\nMeanwhile, stock market on Wednesday consolidated the upsurge recorded on Tuesday as investors gained over N243 billion.\nSpecifically, the NGX market capitalisation rose to N13.426 trillion from N23.183 trillion.\nWema Bank was the most traded stock by volume at 25.01 million units, while Zenith Bank was the most traded stock by value at N275.23 million."
  },
  {
    "headline": "FG rebuffs private sector, imposes N10/litre tax on soft drinks",
    "summarized_story": "By Emma Ujah & Peter EgwuatuThe federal government has in troduced an excise duty of N10 per litre on all non-alcoholic, carbonated and sweetened beverages.\nExcise duty is a form of tax imposed on the locally manufactured goods.\nAhmed said the 2021 Finance Act also raised excise duties and revenues for the health sector.\nThe Minister said the excise duty on soft drinks would discourage excessive consumption of sugar beverages which contributes to diabetes, obesity among others.\nThis is in line with the 2022 budget priorities.”On December 14, 2021, the Organised Private Sector, OPS, notified its rejection of the plans by government to reintroduce excise duty on carbonated drinks."
  },
  {
    "headline": "How to stop hustling and start positioning for wealth",
    "summarized_story": "Choose a proven path to wealthTo create wealth, you must choose a path where wealth is already circulating as not all paths lead to wealth.\nFor example, research shows that 70% of businesses die after the first five years even though they are on a proven wealth path.\nCreate your own wealth gardenTo position and not pursue wealth you must create your own wealth garden.\nA wealth garden is a center of resources that benefits and attracts other people.\nTo create your own wealth garden, you need to do three things."
  },
  {
    "headline": "Rabe Nasir: Masari assigns tentative overseer for science technology ministry",
    "summarized_story": "Ogalah IbrahimGovernor Bello Masari of Katsina StateGovernor Aminu Bello Masari of Katsina State has tentatively assigned the duty of overseeing the Ministry of Science, Technology, and Innovations to Mustapha Muhamoud, the Commissioner currently in charge of the Ministry of Rural Development.\nMahmoud would oversee the affairs of the ministry pending when Governor Masari appoints a new substantive Commissioner that will take full charge of its activities.\nThe development was contained in a statement signed by the Secretary to the Government of the State, Mustapha Muhammad Inuwa on Wednesday.\nThe decision is sequel to the sad death of the erstwhile Commissioner of the Ministry, Late Dr Rabe Nasir who was killed on 9 December 2021 by suspected assassins whom security agents are yet to bring to the book.\nVanguard News Nigeria"
  },
  {
    "headline": "Gunmen storm Rivers police station, release detainees",
    "summarized_story": "The Rivers State Police Command has confirmed a cell break in its division in the Okrika Local Government Area on Tuesday.\nSome gunmen were said to have stormed the division and forcefully opened the back door of the cell, from where all the detainees escaped.\nAccording to a statement issued on Wednesday by the command’s Public Relations Officer, Grace Iringe-Koko, the Commissioner of Police, Friday Eboka, has directed Deputy Commissioner in charge of the State Criminal Investigation Department, Patrick Longe to expedite investigation into the cause of the cell break.\nThe CP directed the DCP to ensure the detention of all officers involved in the incident.\nLonge is also expected to ensure the rearrest of all escapees who should be made to face the full weight of the law."
  },
  {
    "headline": "2023: Matawalle promises peaceful, credible conduct of elections in Zamfara",
    "summarized_story": "Governor Bello Mohammed Matawalle of Zamfara State on Wednesday received the new Resident Electoral Commissioner of the state, Professor Said Babura Ahmed, in his office.\nHe assured peaceful and credible conduct of the 2023 elections in the state.\nThe Governor while welcoming Ahmed said people of the state will continue to support the commission in the conduct of its obligations.\nThe Governor said he was very optimistic that the state government would assist the commission with all necessary logistics and support for a hitch-free, credible and peaceful 2023 general election.\nEarlier, Ahmed said he was at the Governor’s office to familiarize himself and to explore more areas of support and cooperation between the state government and the commission for a hitch-free 2023 general elections."
  },
  {
    "headline": "Bandits attack Katsina community, kill two",
    "summarized_story": "Makurdi, a community in Bakori Local Government Area of Katsina State, was on Tuesday attacked by bandits.\nThe bandits killed two persons and abducted a woman and her two children in the attack that occurred around 10 pm.\nA resident of the community told DAILY POST that “they started their operations in the community from the resident of Alhaji Magaji Mallaha Makurdi, a businessman who specializes in supplying farm products to companies.\n“They later killed him while shooting sporadically inside his compound, before they left with his wife, two children and phone.”The bandits also killed a health worker identified as ‘ZaharaDini’ in the community.\nHe was returning to his Makurdi residence after hanging out at a friend’s barbing salon before he was killed."
  },
  {
    "headline": "State police will come to fruition – Group tells President Buhari",
    "summarized_story": "The Middle Belt Forum, MBF, has noted that agitation for state police across the country will eventually materialise in spite of President Muhammadu Buhari’s recent comment dismissing it.\nDr Bitrus Pogu, the National President of MBF, who was reacting to a clip of the President’s recent television interview explained that there is the need to practice true federalism for the survival of the country.\nAccording to him, “It is unfortunate that President Muhammadu Buhari would say that State Police is not an option.\nHe stated that given what happened in Lagos, Nigerians must insist on state police.\nHe explained that the Governor is the Chief Security Officer of the state and should have authority in his state, saying that no federal institution should impose anything on the Governor."
  },
  {
    "headline": "FG to reduce workforce, gives reason",
    "summarized_story": "Minister of Finance, Budget and National Planning, Mrs Zainab Ahmed, explained that the downsizing is aimed at cutting the cost of the government’s recurrent expenditure yearly.\nAhmed disclosed that the Federal Government is working on an exit package for workers that would be affected.\nIn a statement, the minister said the government has set up a committee to review the collapse of agencies, using the Stephen Oronsaye report.\n“At the end of it what we want to do is to reduce the size of government and also to reduce the size of personnel cost and part of it will be designing the exit packages that are realistic”.\nShe further explained that the planned collapse of agencies is because “we are revenue-challenged”."
  },
  {
    "headline": "64th Grammy Awards postponed over COVID-19",
    "summarized_story": "The Recording Academy have announced the postponement of the 64th edition of the annual Grammy Awards.\n“After careful consideration and analysis with city and state officials, health and safety experts, the artist community and our many partners, the Recording Academy and CBS have postponed the 64th Annual GRAMMY Awards Show,” CBS and the Recording Academy announced in a joint statement.\n“We look forward to celebrating Music’s Biggest Night on a future date, which will be announced soon,” the companies added.\nThe 63rd Grammy Awards was postponed from January to March due to the pandemic and a surge in Covid-19 cases.\nThe show ultimately took place, largely outside, at the Los Angeles Convention Center with a smaller in-person audience."
  },
  {
    "headline": "Issues to tackle in 2022: School abductions, ASUU and bullying",
    "summarized_story": "Schools abductions threatened educationOne of the biggest challenges that the Nigerian education sector faced last year was the abduction of children from schools.\nLast month, the United Nations Children Education Fund (UNICEF) reported that 1,440 children were abducted in 25 attacks on schools by bandits.\nSome states operated partial resumption – closing schools in insecure areas and relocating the children to schools in more secure neighbourhoods.\nLast December, the development Research and Project Centre (dRPC) trained representatives of 36 CSOs across the country to implement the Safe School Declaration.\nThe case also got prominent attention during a training for Civil Society Organisations in Abuja early this month, to implement the Safe School Declaration as bullying was identified as part of violence that makes the school environment unsafe for pupils."
  },
  {
    "headline": "PDP stakeholders in 24 states have endorsed Atiku, says Dokpesi",
    "summarized_story": "PDP stakeholders in 24 states have endorsed Atiku, says DokpesiStakeholders of the Peoples Democratic Party (PDP) in 24 states have endorsed former Vice-President Atiku Abubakar for President in 2023, a committee soliciting support for him said yesterday.\nLeader of the Technical Committee for Atiku, Chief Raymond Dokpesi, spoke during a visit of his committee to Yola, the Adamawa State capital.\nHe said Adamawa was the 24th state his committee was visiting and that all the 24 states showed overwhelming support for Atiku.\nThe governor, who was represented by his deputy, Chief Crowther Seth, urged Nigerians to continue to support Atiku to get to the coveted seat.\nThe state’s PDP Chairman Tahir Shehu expressed the confidence that Atiku would liberate the country from underdevelopment and insecurity."
  },
  {
    "headline": "Things to know about new Olubadan-elect",
    "summarized_story": "Ten of the 11 members of the Olubadan-in-Council on Wednesday endorsed the nomination of Senator Lekan Balogun as the next Olubadan of Ibadanland.\nHere are things to know about the new Olubadan-elect of Ibadanland, the 79-year-old Dr Lekan Balogun· After his primary school education, young Lekan was enrolled at CAC Modern School, Anlugbua.\n· For his undergraduate programme, he enjoyed university scholarship while his post-graduate studies were sponsored by the Social Science Research Council.\n· Senator Lekan Balogun sits on the Board of several companies with interests in Oil and Gas, Distributive Trade, Management Consulting, Mechanized Farming and Export of non-oil items as well as Travels and Tourism.\n· As Senator Lekan Balogun rose in politics, he continued to rise in the traditional hierarchy of Ibadanland, culminating in his present position as the Olubadan elect of Ibadanland."
  },
  {
    "headline": "I can't release Nnamdi Kanu, says Buhari",
    "summarized_story": "President Muhammadu Buhari, on Wednesday night, said detained leader of the Indigenous People of Biafra, Nnamdi Kanu, should answer for his actions.\nThe President, who responded to questions on several national issues on the programme, said: “I wouldn’t dare interfere with the judiciary.\n“There is one institution that I wouldn’t dare interfere with.\n“Let him come here with us and then criticise us here in Nigeria, let him be listened to.\n“But people who are saying he should be released, no, we cannot release him.”"
  },
  {
    "headline": "Oromoni: Family spoils for legal battle, engages Falana",
    "summarized_story": "From Paul Osuyi, AsabaThe family of the late Sylvester Oromoni (Jnr.)\nFather of the deceased student of Dowen College, Mr. Sylvester Oromoni in reaction to the DPP’s advice, said the family would pursue the case legally to a logical conclusion to get justice.\nAs a result, Mr. Oromoni in a statement, said the family has instructed the legal team led by Mr. Femi Falana (SAN) to put machinery in motion.\nThe statement read in parts: “My attention has been drawn to the legal advice, dated January 4, 2022 on the untimely and brutal death of my beloved son, Sylvester Oromoni Jnr.\n“Be that as it may, I am not surprised with the content of the said legal advice."
  },
  {
    "headline": "Orji Kalu remains our leader,father of Abia Politics – Arochukwu leaders",
    "summarized_story": "Chronicling Orji Kalu’s antecedents in the history of Abia Politics the leadership of the local government council affirmed Senate Chief Whip as the father of Abia Politics, stating that all Political leaders in the state passed through his tutelage.\n“Orji Kalu taught us the business of politics and he remains the father of Abia Politics , every Politician in Abia State today started under him directly or indirectly.\nEleanya recalled how Orji Kalu in 1998 single handedly financed the activities of the PDP in the state as well as at the National level.\nWe the entire political bloc in Arochukwu are grateful because all what we are today in Abia State can be traced to you.\nSpeaking on Politics, Kalu stated that Leaders were instituted by God and should be given maximum support by the people."
  },
  {
    "headline": "Insecurity: State police not an option –Buhari",
    "summarized_story": "From Juliana Taiwo-Obalonye, Abuja and Chukwudi NwejePresident Muhammadu Buhari has again rejected the call for state police as solution to the nation’s mounting security challenges.\nThe agitation has led to the setting up of regional security outfits by some state governments.\nBut despite the mounting pressure from several quarters, President Buhari said state police is not an option.\nLet him account for what he has been doing.”Kanu is in the custody of the Department of State Services (DSS).\n“I am not happy with the state of power because no country can develop without infrastructure and infrastructure means road, rail and power."
  },
  {
    "headline": "Oromoni: Lagos clears 5 Dowen College students, staff",
    "summarized_story": "By Gabriel Dike and Lukman OlabiyiThe Lagos State Government has cleared five students and five employees of Dowen College, Lekki, Lagos, accused of complicity in the death of 12-year-old Sylvester Oromoni.\nThe state cleared the students, staff as well as the school based on the legal advice of the Director of Public Prosecution (DPP), Ms. Adetutu Oshinusi.\nThe DPP report also cleared the five students of belonging to unlawful society due to insufficient facts to establish the offence.\nC17, Vol.3, Laws of Lagos State 2015.\nHis death generated ripples prompting the Lagos State Police Command to arrest five students and five staff of the college."
  },
  {
    "headline": "South West governors question IGP over disrespectful act of police officer to Sanwo-Olu",
    "summarized_story": "From Bamigbola Gbolagunte, AkureThe South West Governors’ Forum has called on the Inspector-General of Police, Mr. Usman Alkali Baba, to explain why one of his officers publicly ridiculed Lagos State Governor, Mr. Babajide Sanwo-Olu, as he tried to mediate in a land dispute within his jurisdiction.\nThe six governors of the region, while condemning the disrespectful acts of the officer to Governor Sanwo-Olu at Magodo, Lagos, described the action of the police officer as high-level abuse of office.\nChairman of the forum, Ondo State Governor, Mr. Rotimi Akeredolu, SAN, in a statement he personally signed, said the action of the policeman was unexpected of a public officer.\nWe condemn in very clear terms the role of the Attorney General of the Federation, Mr Abubakar Malami in this act of gross moral turpitude.\n(Continued on www.sunnewsonline.com)“We stand by our brother, the Governor of Lagos State."
  },
  {
    "headline": "Budget Highlights: FG Introduces 6% Tax on Digital Services, Non-resident Companies",
    "summarized_story": "The Minister of Finance, Budget and National Planning, Mrs. Zainab Ahmed, disclosed this during the public presentation and breakdown of the 2022 budget held in Abuja.\nAhmed had in November last year disclosed that the sum of N178.09 billion had been approved for the national population census in the 2022 budget.\n“The 2022 Budget was prepared taking into consideration the policies/strategies contained in the 2022–2024 Medium Term Expenditure Framework and Fiscal Strategy Paper (MTEF/FSP).\nThe 2022 federal government budget is the first key public sector contribution to implementing the plan,” she explained.\nEarly passage of the 2022 Budget for implementation from January 1, will significantly contribute towards achieving government macro-fiscal and sectoral objectives."
  },
  {
    "headline": "2023: Identity of My Successor Remains a Secret, Says Buhari",
    "summarized_story": "On the electoral bill, Buhari maintained that primaries must not be direct, but rather, people should be given options to make their choice.\nBuhari said, “Nigerians know that I don’t interfere with the judiciary.\n“Nigerians should remind President Buhari that people evolve and societies evolve.\nTherefore, being trapped in a time capsule of the past about state police is not an option Nigerians are willing to accept from him.\n“The more Buhari promises to lift Nigerians out of poverty, the poorer Nigerians become."
  },
  {
    "headline": "Ararume Loses Out as Buhari Appoints 9-member NNPC Board",
    "summarized_story": "The president also appointed four Executive Commissioners for the Nigerian Upstream Petroleum Regulatory Commission (NUPRC).\nOther members of the Board are: Dr. Tajudeen Umar (North East), Mrs Lami O. Ahmed (North Central), Mallam Mohammed Lawal (North West), Engr.\nHenry Obih (South East), Barrister Constance Harry Marshal (South South), and Chief Pius Akinyelure(South West).\nThey are to join the Board Chairman, Executive Director, Downstream Systems, Storage and Retailing Infrastructure, the CEO, and Executive Director, Finance and Accounts, who had earlier been appointed by President Buhari.\nNo reason was given for the removal of Ararume from the board."
  },
  {
    "headline": "CBN Deputy Governor, Ahmad Chairs NCX’s Re-constituted Board",
    "summarized_story": "•Sere-Ejembi, Yusuf appointed directorsJames Emejo in Abuja andNume Ekeghe in LagosCentral Bank of Nigeria (CBN) Deputy Governor, Mrs. Aisha Ahmad has been appointed the chairman of the re-constituted Board of the Nigeria Commodity Exchange (NCX) Plc.\nIn addition, three new directors were appointed for the exchange, out of which Ahmad was one of them.\nOthers included CBN Director, Development Finance Department, Mr. Yusuf Yila and Dr. Angela Sere-Ejembi.\nAhmad, was subsequently appointed Chairman of the board at the inaugural board meeting which held same day.\nEmefiele, who chairs the SteerCo, said the federal government’s premier commodity exchange had not been able to catalyse agricultural production due to structural and idiosyncratic challenges."
  },
  {
    "headline": "The Recording Academy Postpones Grammy Awards",
    "summarized_story": "By Vanessa ObiohaFollowing the spike in COVID-19 cases in the United States, the Recording Academy has postponed the 64th Grammy awards earlier scheduled for January 31.\nAccording to a statement by the Recording Academy, “After careful consideration and analysis with city and state officials, health and safety experts, the artist community and our many partners, the Recording Academy® and CBS have postponed the 64th Annual GRAMMY Awards® Show.\nGiven the uncertainty surrounding the Omicron variant, holding the show on January 31 simply contains too many risks.”This year’s Grammy nominations have Nigerian artists nominated in the Global Music Album and Global Music Performance categories.\nBurna Boy and Wizkid who won a Grammy last year are among this year’s nominees.\nHis son Made however shares the spotlight with him in the Global Music Album category."
  },
  {
    "headline": "National Assembly Earmarks N5billion To Build Library, N1billion For Constitution Review Despite Nigeria’s Dwindling Revenue",
    "summarized_story": "In the figures released, N100billion was earmarked for zonal interventions, while National Assembly liabilities to gulp N10billion.\nIn the data, the National Assembly library building will consume N5billion and the lawmakers are billed to spend N1billion on Constitution Review.\nOther projected expenses are National Assembly e-library with N300 million and National Assembly dashboard with N139 million.\nRecall that SaharaReporters had published last week how President Muhammadu Buhari lamented some worrisome changes made by the National Assembly on 2022 Budget he signed into law.\nThe President had said, \"It is in this regard that I must express my reservations about many of the changes that the national assembly has made to the 2022 executive budget proposal."
  },
  {
    "headline": "National Assembly Earmarks N5billion To Build Library, N1billion For Constitution Review Despite Nigeria’s Dwindling Revenue",
    "summarized_story": "In the figures released, N100billion was earmarked for zonal interventions, while National Assembly liabilities to gulp N10billion.\nIn the data, the National Assembly library building will consume N5billion and the lawmakers are billed to spend N1billion on Constitution Review.\nOther projected expenses are National Assembly e-library with N300 million and National Assembly dashboard with N139 million.\nRecall that SaharaReporters had published last week how President Muhammadu Buhari lamented some worrisome changes made by the National Assembly on 2022 Budget he signed into law.\nThe President had said, \"It is in this regard that I must express my reservations about many of the changes that the national assembly has made to the 2022 executive budget proposal."
  },
  {
    "headline": "Exclusive: Pastor In Apostle Suleman's Omega Fire Ministry Allegedly Brutalises Austria-based Nigerian Lady For Asking Repayment Of Five-year-old Loan",
    "summarized_story": "A Nigerian lady based in Vienna, Austria, Susan Edeh, has recounted how a pastor of Omega Fire Ministries, Jesse, brutalised her for asking him to pay back a loan she gave to him to pay church rent.\nThe lady said the pastor had promised to pay back the loan after the church's next service but failed to keep to the promise after five years.\nA relation of the victim, who spoke with SaharaReporters, called on Apostle Suleman to ensure justice was served on the matter.\n\"We want the General Overseer (Apostle Suleman) to investigate this abuse and attempted murder with the intention to cover the debt, while police should prosecute Pastor Jesse and everyone involved,\" he said.\nThis is not the first time Apostle Suleman and his Omega Fire Ministry will be courting controversy and attracting negative headlines -- the latest incident adds to an already swelling list."
  },
  {
    "headline": "Exclusive: Pastor In Apostle Suleman's Omega Fire Ministry Allegedly Brutalises Austria-based Nigerian Lady For Asking Repayment Of Five-year-old Loan",
    "summarized_story": "A Nigerian lady based in Vienna, Austria, Susan Edeh, has recounted how a pastor of Omega Fire Ministries, Jesse, brutalised her for asking him to pay back a loan she gave to him to pay church rent.\nThe lady said the pastor had promised to pay back the loan after the church's next service but failed to keep to the promise after five years.\nA relation of the victim, who spoke with SaharaReporters, called on Apostle Suleman to ensure justice was served on the matter.\n\"We want the General Overseer (Apostle Suleman) to investigate this abuse and attempted murder with the intention to cover the debt, while police should prosecute Pastor Jesse and everyone involved,\" he said.\nThis is not the first time Apostle Suleman and his Omega Fire Ministry will be courting controversy and attracting negative headlines -- the latest incident adds to an already swelling list."
  },
  {
    "headline": "Judiciary Powerless; Your Government Flouts Court Orders – Nigerians React To Buhari’s Statement That Court May Free Nnamdi Kanu",
    "summarized_story": "Buhari had stated this in an interview aired on Channels Television on Wednesday night which was monitored by SaharaReporters.\nMuhammadu BuhariThere have been pressures on Buhari to release Kanu including a recent visit by some Igbo elders led by the Minister of Aviation in the First Republic, Chief Mbazulike Amaechi.\nNigerians know that I don’t interfere with the judiciary, let him be listened to.\nIs like he is already condemned before trial.”Jeff Nicky stated: “Which court?\nFabian Ejikeme wrote, “If you really want him to defend himself in the court stop adjourning the case.\""
  },
  {
    "headline": "Students injured as ‘armed robbers’ invade UI’s off-campus hostel",
    "summarized_story": "Suspected armed robbers have reportedly invaded an off-campus hostel belonging to students of the University of Ibadan (UI).\nAdvertisementAccording to NAN, the alleged robbery took place around Barika area, Agbowo, in the Ibadan north LGA in the early hours of Wednesday.\nIt was gathered that the incident left some of the students injured.\nSpeaking about the incident, Romoke Olukemi, a student of the varsity, said the robbers arrived the area around 2 am and started shooting sporadically.\nAdvertisement“A night watch-man according to eyewitness was allegedly shot but narrowly escaped death,” she said."
  },
  {
    "headline": "‘Help us get justice’ — Oromoni family begs Buhari after Lagos verdict",
    "summarized_story": "The Oromoni family has sought President Muhammadu Buhari’s intervention in its case against Dowen College, Lagos.\nAdvertisementSylvester Oromoni, the late student of the Lekki-based school, died last November after he was allegedly attacked by five of his colleagues.\nAdvertisementHakeem Odumosu, Lagos police commissioner, ordered a probe into the case while the school was sealed off.\nTwo autopsies were done on the deceased, one by the Delta police and the second by the force’s Lagos command.\nThe first autopsy earlier released to the public had revealed that the deceased died of “chemical intoxication”."
  },
  {
    "headline": "VIDEO: Oromoni’s mum bursts into tears after DPP’s acquittal of Dowen College",
    "summarized_story": "The mother of Sylvester Oromoni, the deceased student of Dowen College, is in tears following Lagos state’s acquittal of the accused parties in her son’s case.\nBut Dowen College had dismissed the claim, alleging that the boy sustained injuries while playing football with his colleagues.\nAdvertisementHakeem Odumosu, Lagos police commissioner, ordered a probe into the case while the school was sealed off.\nAdvertisementAfter a police probe, Odumosu said findings had been forwarded to the department of public prosecution (DPP).\nResponding to the development in a video, Oromoni’s mother bursted into tears while cursing those who “murdered” her son."
  },
  {
    "headline": "Classic BlackBerry phones to stop working today",
    "summarized_story": "Blackberry says it will stop offering support for smartphones running its 10, 7.1 OS, and earlier versions from January 4.\nAdvertisementThis means the latest Blackberry devices running on Android software will continue to work for now.\nAdvertisementThe firm, it is understood, will now focus on providing security software and services to enterprises and governments.\nBlackBerry phones then gained support for email, apps, web browsing, and BBM (an encrypted messaging platform that predated WhatsApp).\nIt eventually gave up on its own software, embraced Android, and layered its security software on top."
  },
  {
    "headline": "Osasu, Igbinedion’s daughter, announces engagement to lover",
    "summarized_story": "Osasu, daughter to Lucky Igbinedion, ex-governor of Edo state, has announced her engagement to Nathaniel Ogwuche, her fiance.\nAdvertisementThe media personality took to her Instagram page on Wednesday to share a video of the marriage proposal witnessed by friends.\nIn a post accompanying the clip, the 29-year-old TV host reiterated her love for her man and promised to always support him.\nOsasu also hinted that the marriage would take place this year, using the hashtag #NATSU22.\nAdvertisementThe journalist is the host of ‘The Osasu Show’ and founder of the Osasu Show Foundation."
  },
  {
    "headline": "How mobile phones and digital tools have helped Togo tackle COVID-19",
    "summarized_story": "Globally, the COVID-19 disease has infected more than 290 million people, claimed well over 5 million lives, and plunged millions into extreme poverty.\nMore than 1.6 million Togolese registered for the monetary support through their mobile phones, according to data on the Novissi website.\n“People should not have to choose between death by COVID-19 or by hunger,” President Faure Gnassingbe said on the Novissi programme.\nIn a month, more than 50,000 people registered for COVID-19 vaccination through Togo’s digital platforms.\nAuthorities launched a mobile and web-based service that allows Togolese to register for vaccination using their phones."
  },
  {
    "headline": "Here’s why startup funding in the Maghreb ecosystem is low",
    "summarized_story": "But when you break these numbers down into deals and compare them to Egypt’s over $600 million funding in 2021, the conversation on how disturbingly small the funding is comes up.\nWhat’s the problem of the Maghreb region, and how can the ecosystem rise to its full potential?\nIntra-regional conflictThe Maghreb countries don’t see eye-to-eye; they are archenemies or, as they are popularly called, “enemy brothers”.\nIn Nigeria, for instance, big conventional banks back fintech startups, and FMCGs invest in e-commerce and logistic upstarts.\nLanguage barrierThe Maghreb region speaks French and that makes it a francophone region."
  },
  {
    "headline": "TechCabal Wrapped: Here’s what you enjoyed reading from TechCabal in 2021",
    "summarized_story": "I joined TechCabal in January of this year to help drive TechCabal’s transition from a Nigerian tech publication to a pan-African tech and media publication.\nTechCabal Wrapped is our way of walking you through our most-loved and most-read articles in 2021.\n🥂 Koromone Koroye, Managing EditorHere’s what you enjoyed reading from TechCabal in 2021In 2021, TechCabal published 683 articles, 265 editions of TC Daily—including this one—and 50 editions of Next Wave.\nHow Herconomy raised a $600,000 pre-seed round in 24 hoursIn 2021, Nigerian startups raised about $1.4 billion.\nThe African tech ecosystem mourns the passing of Nnena Nkongho, an African investor who championed diversity and excellence."
  },
  {
    "headline": "21 things that happened for the first time in 2021 in the African tech scene",
    "summarized_story": "2021 has been a noteworthy year that has seen the African tech sector bounce back from the difficulties it faced in 2020.\nHere’s a list of 21 things that happened for the first time in the African tech scene this year.\nThe African startup ecosystem raised a record $4 billion+ in venture capital funding2021 year was a landmark year for the African tech ecosystem, raising over $4 billion via 754 deals in venture capital funding.\nMFS Africa acquired Baxi.\nTwitter opened its first Africa office in GhanaIn April 2021 social media giant Twitter announced Ghana as its choice for an African headquarters."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hi there, Ogheneruemu, Bolu, and Chimgozirim here.\nYou are probably wondering why all three of us are writing this..."
  },
  {
    "headline": "Africa’s $4.9bn funding, crypto predictions for 2022, and mPharma’s $35m Series D",
    "summarized_story": "Fintech still rules: As usual, fintech startups received the lion share, going as high as 62% — $3 billion.\nCrypto price predictions for 2022Photo by CardMapr.nl on UnsplashThe crypto market in 2021 started on a very bullish note.\nBesides Bitcoin, 2021 had interesting tokens such as SHIBA INU that grew by 49,000,000%.\nInvesting $100 in the token in 2020 would have culminated into a whopping $53 million during its 2021 ATH.\nPer TechCrunch, the funding comprises $30 million equity funding and $5 million debt financing by Citibank."
  },
  {
    "headline": "Twitter’s second African office? Gahez’s pre-seed funding, FedaPay secures funding",
    "summarized_story": "Share this article:Hi there,Here’s what we’re discussing today:Twitter’s second African office?\nGahez’s pre-seed fundingFedaPay secures fundingTwitter’s second African officeAfter over six months of accessing Twitter using Virtual Private Networks (VPNs), Nigerians may soon access the social media platform freely.\nAdvertisementAccording to a source quoted by The Nation, Twitter’s hesitance to open an office in Nigeria last year stemmed from it not being part of its 2021 budget.\nThe first is that going by the report, Twitter is being coerced into opening an office in Nigeria.\nGahez raises $2 million in pre-seed fundingEgyptian eCommerce startup, Gahez, has raised $2 million in pre-seed funding."
  },
  {
    "headline": "Not your typical African tech stories",
    "summarized_story": "For the third year running, people are living through different levels of lockdowns and increasing cases of COVID-19 and its variants.\nSome countries are still reconsidering lifting lockdowns, while others have experienced more than three waves of the pandemic already.\nI’m tempted to ask, “when does all this end?” So, this is another reminder for you to stay safe.\nHowever, this does not affect Blackberry devices running on Android OS.\nIt features the lives and exploits of African tech specialists across the world."
  },
  {
    "headline": "Inside Mafab’s plan to become major Nigerian telco",
    "summarized_story": "After emerging as one of the two provisional winners of the 5G spectrum licence, Mafab Communications has set out plans to become a major Nigeria’s telecommunications operator, according to a proposed document seen by BusinessDay.\nTo achieve the targets, it has itemised three strategies – first of which is to secure the licence for 5G.\nHowever, deploying the 5G network without pre-existing 3G or 4G infrastructure will be a tall order for the company.\nWhile 2017 was a big year for MTN and Airtel, it wasn’t for Globacom and 9Mobile, which continued to see declines.\nThe company also holds an operational interest in the banking, banking, insurance, hospitality, and telecom spheres of the Nigerian economy."
  },
  {
    "headline": "How Lagos backlogs led to highest daily COVID-19 cases",
    "summarized_story": "Adetifa Ifedayo, NCDC director-general, in an exclusive interview with BusinessDay, said over 2,000 of those cases accrued from unreported cases in Lagos between December 13 and 19.\nThe centre collates COVID-19 cases based on reports from states across the country daily, and cases reported daily are often an aggregate of positive results of PCR and rapid diagnostic tests done the previous day.\nBut sometimes and maybe slightly more frequently, some states report backlogs of cases that failed to come in before NCDC’s typical reporting.\nThe record-shattering surge of December 22 shifted worries over undercounting of COVID-19 cases to the question of whether the NCDC data now reflect the true scale of coronavirus incidence.\nEven in places that test more, considering that a lot of COVID-19 cases are asymptomatic, they have far more cases than any country is able to actually report,” the director-general said."
  },
  {
    "headline": "Buhari kicks against restructuring, state police",
    "summarized_story": "President Muhammadu Buhari has kicked against agitations for restructuring of the country and state police as a solution to Nigeria’s woes, saying that the agitators are not clear on their demands.\nBuhari stated this during an exclusive pre-recorded interview with Channels Television at the presidential villa, Abuja, aired on Wednesday.\nThe President noted that advocates of restructuring were not clear if they wanted new states to be created.\nWhen asked if there was any chance of a political solution to the issue, the President said such can happen if Kanu had behaved himself.\n“There is a possibility of political solution if people behave themselves, but you cannot do all that; let him account for what he was doing”."
  },
  {
    "headline": "DOCUMENTING EDO STATE GOVERNMENTS – Nigerian Observer",
    "summarized_story": "As a journalist, writer and social scientist I have interacted with hundreds of politicians, public office seekers, academics, civil servants, clerics, critics and scores of other individuals in Edo State.\nFollowing this development, I resolved to start documenting all Edo State Governments in power since 2007 for public consumption beginning with Comrade Adams Aliu Oshiomhole whose administration oversaw the affairs of Edo State from 2007-2016.\nMaterials used for government documentation are from on/offline sources, most especially reports carried in the state-owned Nigerian Observer published by Bendel Newspapers Company Limited with headquarters in Benin City, capital of Edo State.\nGovernor Godwin Nogheghase Obaseki assumed office as Edo State Governor on November 12, 2016.\nRather, the works were put together by a team of researchers who believe passionately in providing resources material with which Edo citizens and other interested persons can get relevant facts about Edo State Government."
  },
  {
    "headline": "With 40MW power plant operational, investors scramble for space in Benin Industrial Park – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest… as Edo govt earmarks 100ha for first phase, assures incentives for investors… Ossiomo Power generation capacity now 95MWBENIN CITY – With the coming on stream of the 40MW Independent Power Plant (IPP) built by Ossiomo Power and dedicated to provide power to the Benin Industrial and Enterprise Park, investors are trooping in to harness the benefit of the 24-hour electricity and other benefits available at the mixed-purpose park.\nOssiomo Power had announced that its new 40MW plant became operational in December 29 and had already connected and powering Ologbo and Obayantor communities in Ikpoba Okha Local Government Area of the State.\nThe new plant increases the generation capacity of Ossiomo Power to 95MW, as a 55MW plant had been operational since 2020.\nManaging Director, Edo State Investment Promotion Office (ESIPO), Kelvin Uwaibi, in a chat with journalists, said the state government has earmarked 100 hectares for the first phase of the mixed-purpose Benin Industrial and Enterprise Park, which measures about 997-hectares.\nAccording to him, “We are being inundated by enquiries from investors and are ready for those who want to set up shop as quick as possible."
  },
  {
    "headline": "Obaseki advances on digital economy, to provide optic fibre connectivity across 18 LGAs – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki, has assured residents that his government will sustain ongoing reforms and programmes aimed at achieving digital economy in the state, promising to provide fibre optic connectivity to all Edo communities to enhance access to the internet and expand the state’s digital economy.\nObaseki, who spoke to journalists in Benin City, said his administration is committed to building physical and digital infrastructure, leveraging technology to drive sustainable growth and development in the state.\nHe stated, “Our operation Light Up Edo is in full gear with the street-lighting project being rolled out in Benin City, Ekpoma and Auchi.\n“As a government, we are recommitting ourselves to deepen growth across all sectors of the state and provide more opportunities for our people to realise their full potential.\nThese we will do by leveraging the innate abilities of our people and providing them with the tools and enablement to dominate and conquer their world.”..."
  },
  {
    "headline": "Obaseki congratulates Prof. Salami on appointment as Chief Economic Adviser – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterest…urges alignment of monetary, fiscal policiesBENIN CITY – The Edo State Governor, Mr. Godwin Obaseki has congratulated Prof. Doyin Salami on his appointment as the Chief Economic Adviser to President Muhammadu Buhari.\nThe governor, in a statement, said: “I hope that Prof. Salami will justify the trust and confidence of Mr President and help to align the nation’s monetary and fiscal policies to enable inclusive growth in these very challenging economic times.”He added: “With this new role, I urge Prof. Salami to provide direction in influencing the fundamentals of the Nigerian economy, which will help to steer the economy back on track.\nSalami’s credentials will boost investor confidence for many who have sought a more coordinated and predictable economic environment that can spur Foreign Direct Investment (FDI) and portfolio investment into the economy.\n“As the current chairman of the Presidential Economic Advisory Council (PEAC) and member of the Monetary Policy Committee of the Central Bank of Nigeria, I expect Prof. Salami to bring his experience to bear in the new assignment and place Nigeria on the path of economic prosperity.”..."
  },
  {
    "headline": "BUA Foods, Airtel lead gainers as stock market advances by 1.05%",
    "summarized_story": "Adebayo ObajemuTransactions on the floor of the Nigerian Exchange on Wednesday ended on a bullish side , fuelled by 10% gain in the share prices of Airtel Africa and BUA Foods respectively.\nThe All Share Index gained by 1.05% to close at 43,476.75 points from the previous close of 43,026.23 points.\nInvestors profited by N243 billion as Market Capitalisation grew by 1.05% to close at N23.427 trillion from the previous close of N23.184 trillion.\nThe Market Breadth closed on a positive note as 22 equities came up as gainers against 17 equities that plummeted in their share prices.\nOando and AIICO Insurance among other gainers also grew their share prices by 9.73% and 8.33% respectively."
  },
  {
    "headline": "First Bank names new executive directors",
    "summarized_story": "Adebayo ObajemuIn the midst of recent controversy around the bank over largest shareholders, the Board of Directors of FBN Holdings Plc, on Wednesday, made public the appointments of three executive directors for its commercial banking arm, First Bank Nigeria Limited.\nThe foremost bank named Olusegun Alebiosu as executive director, risk management and executive compliance officer, while Oluwatosin Adewuyi is named executive director, corporate banking.\nBefore his current position, Alebiosu was a group executive and the chief risk officer of the FirstBank Group, since 2016.\nHe has previously had a stint at the United Bank for Africa Plc, the defunct Omega Bank Plc, Peak Merchant Bank as well as Oceanic Bank Plc.\nMr Adewuyi was group executive, corporate banking at FirstBank, where he was responsible for the bank’s corporate banking business following the exit of the previous executive director."
  },
  {
    "headline": "FG aims at N10.7trn as revenue in 2022",
    "summarized_story": "Adebayo ObajemuZainab Ahmed, Minister of Finance at the public unveiling and breakdown of the highlights of 2022 Appropriation Bill, said the Federal Government has projected a revenue target of N10.7 trillion for the 2022 fiscal year.\nAccording to her, Debt servicing is expected to gulp N3.6 trillion.\nShe further expatiated that the 2022 budget has a deficit of N6.3 trillion, and will be financed from domestic, foreign, multi-lateral loans and proceed from privitisation.\nA total of N2.5 trillion is expected from domestic sources and N2.5 trillion from foreign sources.\nAlso, N1.1 trillion will be from bilateral loans and N90 billion from privatisation proceeds."
  },
  {
    "headline": "FG’s deficit spending up 33% to over N7trn in 11 months",
    "summarized_story": "Nigeria’s Federal Government has recorded a budget deficit of N7.\n052 trillion in the eleven months ending November 2021, representing 33 per cent increase when compared with the N5.32 trillion recorded in the corresponding period of 2020.\nThe minister said that at the end of November, deficit spending had risen to N7.052 trillion, instead of the prorata figure of N 5.911 trillion.\nAhmed said the 2021 budget implementation report was provisional, capturing only the first 11 months, an indication that the deficit figure could be higher when the budget implementation report for the full year is concluded.\nThe minister who gave details of the 2021 budget performance noted that the federal government share of oil revenues was N970.3 billion (representing 53% performance of the prorated sum in the 2021 budget)."
  },
  {
    "headline": "BREAKING: Kanu Can Be Released If He Behaves Himself – Buhari",
    "summarized_story": "President Muhammadu Buhari has hinted on a possibility of releasing the leader of the outlawed Indigenous Peoples of Biafra (IPOB), Nnamdi Kanu, from detention on the condition that the latter conduct himself well.\nBuhari disclosed this on Wednesday night during an exclusive interview with Channels Television monitored by our correspondent in Abuja.\nThe President said the ongoing trial of Kanu by a Federal High Court in Abuja was an opportunity for him to defend himself from the allegations against him, adding that he would never interfere with the operations of the Judicial arm of government.\nHe, however, added that the option of political solution to the matter was possible if Kanu behaves himself well.\nADVERTISEMENTADVERTISEMENT"
  },
  {
    "headline": "BREAKING: Federal Govt Proscribes Banditry, Releases Gazette",
    "summarized_story": "The Federal Government of Nigeria has formally proscribed banditry in Nigeria and consequently designated bandits as terrorists.\nThe development is contained in a statement sent to LEADERSHIP by the Federal Ministry of Justice on Wednesday evening.\nRecall that the Attorney-General of the Federation and Minister of Justice, Abubakar Malami (SAN), disclosed that the Federal Government was planning to officially designate bandits as terrorists.\nHe said his office was in the process of gazetting a court judgement that ordered the government to declare bandits as terrorists, adding that the process would be concluded in a matter of days.\n“With that in mind, Nigeria acted, first by proscribing IPOB, taking into consideration the threats to lives and properties they have caused in the nation."
  },
  {
    "headline": "Uzodimma Cannot Stop My Presidential Quest – Okorocha",
    "summarized_story": "A former governor of Imo State, Senator Rochas Okorocha, has said that Governor Hope Uzodimma cannot stop his ambition of becoming the President of Nigeria even as he called on the Inspector General of Police to unmask those responsible for the invasion of St Peter’s Anglican Church, Nkwerre.\nHe accused Uzodimma as the culprit responsible for the gruesome murder of former presidential adviser, Ahmed Gulak, traditional rulers, and beheading of people in the state.\nOkorocha spoke on Wednesday while reacting to accusations of interference in Imo governance by Governor Uzodimma.\nADVERTISEMENTAccording to him, despite the antics of Uzodimma, the governor lacks the capacity to stop his ambition to succeed President Muhammadu Buhari.\nOn the arrest of his son-in-law, Chief Uche Nwosu, Okorocha called on the IGP not to sweep the incident under the carpet, hence he should unveil the sponsor of the arrest, saying Uzodimma has been boasting that the matter has been settled."
  },
  {
    "headline": "Uzodimma Cannot Stop My Presidential Quest – Okorocha",
    "summarized_story": "A former governor of Imo State, Senator Rochas Okorocha, has said that Governor Hope Uzodimma cannot stop his ambition of becoming the President of Nigeria even as he called on the Inspector General of Police to unmask those responsible for the invasion of St Peter’s Anglican Church, Nkwerre.\nHe accused Uzodimma as the culprit responsible for the gruesome murder of former presidential adviser, Ahmed Gulak, traditional rulers, and beheading of people in the state.\nOkorocha spoke on Wednesday while reacting to accusations of interference in Imo governance by Governor Uzodimma.\nADVERTISEMENTAccording to him, despite the antics of Uzodimma, the governor lacks the capacity to stop his ambition to succeed President Muhammadu Buhari.\nOn the arrest of his son-in-law, Chief Uche Nwosu, Okorocha called on the IGP not to sweep the incident under the carpet, hence he should unveil the sponsor of the arrest, saying Uzodimma has been boasting that the matter has been settled."
  },
  {
    "headline": "Retired Soldiers Besiege Finance Ministry, Demand Pension Arrears Payment",
    "summarized_story": "Some retired military personnel, on Wednesday, stormed the headquarters of the Federal Ministry of Finance in Abuja to demand the immediate payment of their pension arrears.\nMeanwhile, the chairman, Military Pensions Board, Commodore S.A. Lawal, has however assured pensioners that funds for payment of the 24 months minimum wage pension arrears to military pensioners was included in the Board’s year 2022 budget.\nADVERTISEMENTCommodore Lawal assured military retirees, Next of Kins (NOKs) and other well-meaning Nigerians that the Board remains resolute and will sustain the prompt payment of all entitlements due to military retirees or their NOKs.\nCome January 15 we are going to picket the ministry of finance and Defence should our entitlement be delayed further.\nHow can you make minimum wage."
  },
  {
    "headline": "New year gift: Burna Boy acquires Lamborghini 2022 model",
    "summarized_story": "Grammy award-winning Nigerian singer, Damini Ogulu, popularly known as Burna Boy, had acquired a new Lamborghini 2022 model.\nSharing pictures of the new car, Burna Boy said, “Merry Christmas and Happy New Year, Damini.\nGod loves you, your family loves you and I love you.\nNewest member of the Lamborghini family.\n”Sharing a video of himself driving his Ferarri, the singer wrote, “Practicing for my new baby with my 458."
  },
  {
    "headline": "New year gift: Burna Boy acquires Lamborghini 2022 model",
    "summarized_story": "Grammy award-winning Nigerian singer, Damini Ogulu, popularly known as Burna Boy, had acquired a new Lamborghini 2022 model.\nSharing pictures of the new car, Burna Boy said, “Merry Christmas and Happy New Year, Damini.\nGod loves you, your family loves you and I love you.\nNewest member of the Lamborghini family.\n”Sharing a video of himself driving his Ferarri, the singer wrote, “Practicing for my new baby with my 458."
  },
  {
    "headline": "Pandora Papers: Inside the crime-infested life of Diezani’s ally, Walter Wagbatsoma + How he was arrested, convicted in UK",
    "summarized_story": "Pandora Papers: Inside the crime-infested life of Diezani’s ally, Walter Wagbatsoma + How he was arrested, convicted in UKPandora Papers: Inside the crime-infested life of Diezani’s ally, Walter Wagbatsoma + How he was arrested, convicted in UKIn the early hours of Wednesday, January 17, 2018, Nigerian businessman, Walter Wagbatsoma, was jailed and disqualified from being a company director for six years in the United Kingdom.\nAt the time Mr Wagbatsoma was convicted in the United Kingdom, he was on a separate trial in Nigeria over fuel subsidy fraud.\nMr Wagbatsoma and his companiesDocuments seen by PREMIUM TIMES dated November 4, 2010, showed that Mr Wagbatsoma founded and became sole director of Ontario Resources and Trading Limited.\nMr Wagbatsoma and Subsidy FraudOn Wednesday, August 1, 2012, the EFCC arraigned Mr Wagbatsoma and other suspects implicated in the fuel subsidy scam before the Lagos High Court.\nAt the time of that verdict, Mr Wagbatsoma was facing trial over a £12 million National Health Service (NHS) Trust fraud in the United Kingdom."
  },
  {
    "headline": "Pandora Papers: Inside the crime-infested life of Diezani’s ally, Walter Wagbatsoma + How he was arrested, convicted in UK",
    "summarized_story": "Pandora Papers: Inside the crime-infested life of Diezani’s ally, Walter Wagbatsoma + How he was arrested, convicted in UKPandora Papers: Inside the crime-infested life of Diezani’s ally, Walter Wagbatsoma + How he was arrested, convicted in UKIn the early hours of Wednesday, January 17, 2018, Nigerian businessman, Walter Wagbatsoma, was jailed and disqualified from being a company director for six years in the United Kingdom.\nAt the time Mr Wagbatsoma was convicted in the United Kingdom, he was on a separate trial in Nigeria over fuel subsidy fraud.\nMr Wagbatsoma and his companiesDocuments seen by PREMIUM TIMES dated November 4, 2010, showed that Mr Wagbatsoma founded and became sole director of Ontario Resources and Trading Limited.\nMr Wagbatsoma and Subsidy FraudOn Wednesday, August 1, 2012, the EFCC arraigned Mr Wagbatsoma and other suspects implicated in the fuel subsidy scam before the Lagos High Court.\nAt the time of that verdict, Mr Wagbatsoma was facing trial over a £12 million National Health Service (NHS) Trust fraud in the United Kingdom."
  },
  {
    "headline": "EFCC secures record 2,220 convictions in 2021 [Infographics]",
    "summarized_story": "The Economic and Financial Crimes Commission, EFCC, secured an unprecedented 2220 convictions across all its Commands in 2021.\nThe number of convictions secured in 2021 was the highest by the EFCC since inception and erased the 2019 record of 1280 convictions.\nThe 2021 record of 2,220 convictions represent a 127.5 % improvement over the 2019 record.\nInterestingly too, the 2,220 record represents a 98.49% success rate in prosecution as the Commission lost only 34 cases during this period.\nHe assured that the EFCC will continue to motivate all categories of staff for greater efficiency through capacity development and other incentives."
  },
  {
    "headline": "EFCC secures 2,220 convictions in 2021",
    "summarized_story": "The Economic and Financial Crimes Commission, EFCC, secured a total of 2,220 convictions across all its Commands in 2021.\nThe conviction secured by the Commission in 2021 is the highest by the EFCC Since inception.\nBefore 2021, the highest record of conviction by the Commission was secured in 2019 with 1,280 convictions.\nThe 2,220 record of 2021 is a 127.5 % improvement over the 2019 record.\nInterestingly too, the 2,220 record represents a 98.49% success rate in prosecution as the Commission lost only 34 cases during this period."
  },
  {
    "headline": "BREAKING: Federal Government Set To Reduce Workforce.",
    "summarized_story": "The federal government intends to reduce the size of the civil service.\nMrs Zainab Ahmed, Minister of Finance, Budget, and National Planning, indicated that the downsizing is intended at lowering the government’s annual recurrent expenditure costs.\nAhmed disclosed that the Federal Government is working on an exit package for workers that would be affected.\nIn a statement, the minister said the government has set up a committee to review the collapse of agencies, using the Stephen Oronsaye report.\n“At the end of it what we want to do is to reduce the size of government and also to reduce the size of personnel cost and part of it will be designing the exit packages that are realistic”."
  },
  {
    "headline": "Nigerian Army Warns Governors, Others Against Wearing Camouflage Uniform.",
    "summarized_story": "Politicians and others have been cautioned not to wear military uniforms and accoutrements, according to Defence Headquarters (DHQ).\nOn Thursday, Air Commodore Wap Maigida, the Acting Director of Information, issued a statement to that effect.\nThe spokesman decried campaign posters showing some governors dressed in camouflage uniforms.\nPoliticians and civilians were advised to stop wearing “camo” for political events and other engagements henceforth.\n“Please note, anyone found culpable in this regard would be liable to prosecution”, the statement added."
  },
  {
    "headline": "We Cannot Release Nnamdi Kanu — Buhari Vows",
    "summarized_story": "President Muhammadu Buhari has sworn to never release Mazi Nnamdi Kanu, the leader of the Indigenous People of Biafra, IPOB.\nRecall that certain Igbo leaders visited with President to ask for Kanu’s unconditional release.\nBuhari responded by saying that it is a difficult decision to make, but that he will think about it.\nWhen asked if KANU would be released, Mr. President responded, “We cannot free Nnamdi Kanu.” It does not have a political solution.\nIt should be remembered that Kanu, the leader of the Indigenous People of Biafra IPOB, is facing treason accusations brought against him by the federal government."
  },
  {
    "headline": "Lagos Government To Compensate Shangisha Landlords With 549 Plots Over Dispute With Magodo Residents",
    "summarized_story": "To resolve the property issue between Shangisha landlords and the Magodo Residents Association, the Lagos State Government has pledged to provide 549 plots of land as compensation.\nAccording to the Tribune, the parties reached an accord following a meeting presided over by Lagos State Governor Babajide Sanwo-Olu on Wednesday.\n“The State Government representatives will be there, the residents’ association will be there, and the police will also be there.\nSaharaReporters had reported that the CSP, Abimbola Oyewole, on Tuesday openly defied Sanwo-Olu’s order to vacate Magodo Phase 2 Estate.\nSanwo-Olu had led members of his cabinet to visit the residents protesting the continuous presence of armed policemen in the estate."
  },
  {
    "headline": "Miraculous! Veteran actress, Iyabo Oko, resurrects hours after doctor pronounced her dead",
    "summarized_story": "A veteran actress, Sidikat Odukanwi, popularly known as Iyabo Oko on Thursday resurrected hours after she was confirmed dead.\nHer daughter Bisi Aisha had on Wednesday evening revealed via her social media handle that Iyabo Oko passed on, aged 61.\nHowever, Aisha on Thursday morning said, “Wonderful being, she moved her hand after being confirmed dead three hours ago.\nGod, we will forever praise your holy name,” Aisha stated on Thursday morning.\nAisha also confirmed that Iyabo is now at the hospital receiving treatment."
  },
  {
    "headline": "Finally, FG gazettes bandits, kidnappers, cattle rustlers as terrorists",
    "summarized_story": "The federal government Wednesday officially declared bandits as terrorists.\nThe gazette proscribing bandit groups in the North as terrorists was made on November 25, 2021 but was unfolded on Wednesday.\nSigned by the Attorney-General of the Federation and Minister of Justice, Mr. Abubakar Malami (SAN), the gazette said henceforth, bandits will face trial under the Terrorism (Prevention) Act 2011.\nThe gazette reads in part: “Notice is hereby given that by the order of the Federal High Court, Abuja in Suit No.\nFHC/ABJ/CS/1370/2021 dated 25th November, 2021 as per the schedule to this Notice and Activities of Yan Bindiga Group, Yan Ta`addan Group and other similar groups in Nigeria are declared to be terrorists and illegal in any part of Nigeria, especially in the North-West and North-Central regions of Nigeria and are proscribed pursuant to sections 1 and 2 of the same Terrorism (Prevention) Act 2011."
  },
  {
    "headline": "PIA: No more petroleum subsidy by July, FG declares when Nigerians will pay heavily for fuel",
    "summarized_story": "The PIA stipulates that the prices of all petroleum products shall be deregulated.\nMinister explainsAddressing journalists in Abuja, the minister said: “From July to December, there is no provision made for subsidy.\nThe PIA has made a provision that prices of products in the petroleum sector must be deregulated.\nAnd so far, we have been able to deregulate kerosene prices, diesel prices, the only one that is still not deregulated is PMS.\nDebt servicingOn debt servicing, Mrs Ahmed said the federal government is to spend N3.61 trillion to service its debt in 2022 fiscal year."
  },
  {
    "headline": "‘We Cannot Release Him,’ Buhari Says Nnamdi Kanu Should Defend Himself In Court",
    "summarized_story": "President Muhammadu Buhari has ruled out the option of pardoning the leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu.\nFor those who are saying that we should release him, no we cannot release him.\nApart from the trial of the IPOB leader, the President also spoke about a number of burning issues including security, economy, and politics, among others.\nSo, in that respect, we have done something,” President Buhari asserted.\nHe went on to defend his government’s decision to source loans from China, saying anyone willing to help Nigeria’s infrastructure was welcome."
  },
  {
    "headline": "I Will Sign Electoral Bill If NASS Includes Consensus Candidates, Indirect Primaries – Buhari",
    "summarized_story": "﻿President Muhammadu Buhari has stated his readiness to sign the Electoral Act Amendment Bill after the National Assembly makes the necessary adjustments.\nHe, however, said such changes must include the addition of consensus candidates, indirect primary options to the mode of selecting a candidate for an election, as against the initial direct mode as the only option to conduct primaries by political parties.\nWhile the lawmakers have yet to resume from recess or deliberate on the bill, President Buhari said it was wrong to force an option on the people.\n“Personally, I do not support direct primary because I want people to be given a choice,” the President stated.\nNot as a result of direct primary, it is as a result of opposition parties coming together and fighting the PDP."
  },
  {
    "headline": "FG Formally Declares Bandits As Terrorists",
    "summarized_story": "The Federal Government has formally declared bandit groups operating in the country as terrorists.\nThe declaration titled ‘Terrorism (Prevention) Proscription Order Notice, 2021 is contained in Volume 108 of the Federal Republic of Nigeria Official Gazette.\nGovernors, the National Assembly, state legislators, lawyers and several groups were among those who made calls for bandits to be declared as terrorists.\nRuling on the motion in November, Justice Taiwo Taiwo declared bandits as terrorists.\nHe specifically held that activities of Yan Bindiga and Yan Ta’adda bandit groups, constitute acts of terrorism."
  },
  {
    "headline": "Oromoni Sylvester: Family Reacts To Lagos Order On Release Of Suspects",
    "summarized_story": "The father of Sylvester Oromoni (Jnr.\n), the late 12-year-old student of Dowen College, has reacted to the release of the suspects linked to the murder of the teenager.\nTwo months after, the Lagos State Government cleared five students and five employees of Dowen College accused of complicity in the death of 12-year-old Sylvester.\nThey also told me that they are writing to the Attorney General of the state and the Governor to return those boys back.\nWhen did they write to the Attorney General to send those boys back to complete their investigation?"
  },
  {
    "headline": "Serbian President Denounces ‘Political Witch Hunt’ Of Djokovic",
    "summarized_story": "Novak Djokovic is a victim of a ‘political witch hunt’ claimed Serbian president Aleksandar Vucic on Thursday after Australian authorities said he failed to meet stringent pandemic entry requirements.\nThe vaccine-sceptic Djokovic was detained on arrival at Melbourne’s Tullamarine Airport having failed to “provide appropriate evidence” of double vaccination or a medical exemption.\nDjokovic had jetted into Melbourne on Wednesday having been granted a medical exemption by the Australian Open organisers.\nHe was hoping to defend his Australian Open crown and claim an unprecedented 21st Grand Slam title.\n“What is not fair-play is the political witch hunt (being conducted against Novak), by everybody including the Australian Prime Minister pretending that the rules apply to all,” Vucic told the media."
  },
  {
    "headline": "Video: Olubadan in Council announces Senator Lekan Balogun as next monarch -",
    "summarized_story": "Ten out out of the eleven Olubadan-in-Council members, Wednesday, endorsed the nomination of the Otun Olubadan, High Chief Lekan Balogun, as the next heir to the throne of Olubadan, as the Osi Olubadan, High Chief Rashidi Ladoja was absent.\nThe endorsement, followed the ratification by members of the Olubadan-in-Council, during a press conference, held at the ancient Mapo Hall, Ibadan."
  },
  {
    "headline": "APC Reconciles Governor Inuwa Yahaya, Senator Goje -",
    "summarized_story": "The All Progressives Congress (AP C) has recorded a landmark Reconciliation between His Excellency the Executive Governor of Gombe state Alh.\nMohammed Inuwa Yahaya and former Governor of the state Sen. Mohammed Danjuma Goje.\nMai Mala Buni with the party’s National Reconciliation Committee Chairman, Sen. Abdullahi Adamu and member if the Committee, Sen. Kashim Shettima.\nThis Gombe state political gladiators were meeting for the first time after a political clash in the state last year.\nYahaya and Sen. Goje for placing the party interest and that of Gombe state over and above personal interests."
  },
  {
    "headline": "Former Lagos Assembly deputy Speaker, Adetoun Adediran, dies -",
    "summarized_story": "Former Deputy Speaker of the Lagos State House of Assembly, Honourable Adetoun Adediran is dead.\nAccording to thegazellenews.com Adediran died early today, Wednesday, 5 January, 2022 after a brief illness.\nAdediran was the first elected female Deputy Speaker of the Lagos State House of Assembly when she served between 1999 and 2003.\nSince then she has held many political offices including being the Women Leader of the Lagos State chapter of the All Progressives Congress (APC).She was reported to have been sick for just two days before her demise this morning."
  },
  {
    "headline": "APC caretaker committee must ensure National Convention goes beyond just electing NWC",
    "summarized_story": "A chieftain of the All Progressives Congress and Director General Of the Progressives Governors Forum, Salihu Lukman, has appealed to the party’s Caretaker Extraordinary Convention Planning Committee, to ensure that the February 2022 Convention is not just about electing National Working Committee members.\nHe urged party leaders on recommendations from the Convention, which he says should guide the review process of the party’s manifesto and bring out some of the campaign agenda of the APC for the 2023 campaigns.\nSalihu Lukman says It is quite worrisome that speculations about the Convention are allowed to create strong doubts as to when the Convention will hold.\nThe major gap, however, is that no date or details of Committees, their membership and terms of reference, were given,a worrisome situation.\nGiven the roll out of political activities for the year, Mr Lukman advised the Caretaker Committee to set up relevant committee for the party’s national assembly, to rest speculations is some quarters that the convention will not hold in February."
  },
  {
    "headline": "UK to Scrap Pre-Departure Covid Tests for Fully Vaccinated from Friday",
    "summarized_story": "They then have to take another test – which this time must be a PCR test – within the first two days after their arrival in the UK.\n‘I’ll feel unsafe on flights’John Wyndham, who is currently planning a third trip to the US for February, said that scrapping pre-departure tests will make him feel unsafe on flights.\nHe went to the US in December along with three colleagues, who paid £212 each for PCR testing.\nHowever, he said that the eliminating pre-departure testing will only save him around £30 per person and wasn’t worth the added worry about new variants.\n£800 savingHowever, holidaymaker David Hughes welcomed the scrapping of PCR tests before returning to the UK."
  },
  {
    "headline": "Kazakhstan Asks Russia for Help after Dozens Killed in Unrest",
    "summarized_story": "Dozens of protesters were killed in Kazakhstan in attacks on government buildings and at least a dozen officers died, including one who was found beheaded, authorities said Thursday.\nThere were attempts to storm buildings in Almaty overnight and “dozens of attackers were liquidated,” police spokeswoman Saltanat Azirbek said Thursday.\nThe reported attempts to storm the buildings came after widespread unrest in the city on Wednesday, including seizure of the mayor’s building, which was set on fire.\nKazakhstan is experiencing the worst street protests the country has seen since gaining independence three decades ago.\nKazakhstan has been rocked by intensifying protests that began on Sunday over a sharp rise in prices for liquefied petroleum gas fuel."
  },
  {
    "headline": "Grammys Postpone Ceremony, Citing Omicron Variant Risks",
    "summarized_story": "The Recording Academy said it made the decision to postpone the ceremony “after careful consideration and analysis with city and state officials, health and safety experts, the artist community and our many partners.\n“Given the uncertainty surrounding the omicron variant, holding the show on January 31st simply contains too many risks,” the academy said in a statement.\nLast year, like most major awards shows in early 2021, the Grammys were postponed due to coronavirus concerns.\nThe Recording Academy made no mention of a possible venue change in its statement.\nThe Grammys’ move could be the beginning of another round of award-show rescheduling after another winter coronavirus surge, with the Screen Actors Guild Awards planned for February and the Academy Awards for March."
  },
  {
    "headline": "Trump Maintains Grip on Republican Party Despite Violent Insurrection",
    "summarized_story": "Instead, he is the undisputed leader of the Republican Party and a leading contender for the 2024 presidential nomination.\nFederal and state election officials and Trump’s own attorney general have said there is no credible evidence the election was tainted.\nBut Kinzinger, who recently announced his decision not to run for reelection, blamed House Republican leader and Trump ally Kevin McCarthy for proving him wrong.\n“Kevin McCarthy is legitimately, singlehandedly the reason that Donald Trump is still a force in the party,” Kinzinger said.\nMeanwhile, on Capitol Hill, the Jan. 6 committee continues to investigate the Trump White House’s involvement in the deadly insurrection."
  },
  {
    "headline": "North Korea Launches Second Hypersonic Missile in Fiery Test",
    "summarized_story": "North Korea fired a “hypersonic missile” this week that successfully hit a target, state news agency KCNA reported on Thursday, its second such test as the country pursues new military capabilities amid stalled denuclearisation talks.\nThe launch on Wednesday was the first by North Korea since October and was detected by several militaries in the region, drawing criticism from governments in the United States, South Korea, and Japan.\nNorth Korea first tested a hypersonic missile in September, joining a race headed by major military powers to deploy the advanced weapons system.\nHypersonic weapons usually fly towards targets at lower altitudes than ballistic missiles and can achieve more than five times the speed of sound – or about 6,200 km per hour (3,850 mph).\nDespite their name, analysts say the main feature of hypersonic weapons is not speed – which can sometimes be matched or exceeded by traditional ballistic missile warheads – but their manoeuvrability."
  }
]