[
  {
    "headline": "N100m form: Buhari, APC corrupting Nigeria’s democracy, says Ozekhome",
    "summarized_story": "Human Rights lawyer, Mike Ozekhome, has accused the ruling All Progressives Congress and the President, Major General Muhammadu Buhari (retd.\n), of corrupting the nation’s democracy by pegging the party’s presidential nomination form at N100 million.\nThe N100m is also over 100% of the N40 million fixed by the same APC for the 2018, presidential nomination form.\n“President Muhammed Buhari and the APC have, by this singular act, exhibited a very odious and unpleasant example of how not to fight corruption.\n“Nigerians should recall that in the prelude to 2015 the presidential elections, President Buhari had trenchantly criticized the N27.5 million levy imposed on his party aspirants for a presidential nomination form."
  },
  {
    "headline": "NSCDC begins training for Gombe recruits",
    "summarized_story": "No fewer than 100 newly recruited officers into the Nigeria Security and Civil Defence Corps, Gombe State command commenced training on Thursday.\nOur correspondent gathered that the recruits were expected to support the command in serving the needs of residents after their three-month training.\nHe disclosed that the newly recruited officers have been enjoined to uphold the trust reposed in them, adding that they have been asked to discharge their service without fear or favour.\nSaad said, “The Nigeria Security And Civil Defence Corps Gombe State Command has commenced training for its newly recruited personnel of the Corps.\nHe added, “Commandant Goni advised them to remain focused and committed to training so that they will complete the three months training and proceed to NSCDC training school.”Copyright PUNCH."
  },
  {
    "headline": "No more imposition of candidates in Arochukwu — Sen Ohuabunwa",
    "summarized_story": "As PDP stakeholders agree to work together.\nSupports full autonomy for LGAsBy Steve OkoSenator Mao Ohuabunwa has vowed that the imposition of candidates would not be allowed again in the Arochukwu Local Government Area of Abia State.\nOhuabunwa vowed to stop at nothing in ensuring that “PDP recaptures Arochukwu which has been the party’s enclave”.\n” We the ward Chairmen in Arochukwu LGA have decided to de-register any stakeholder that refuses to embrace peace so that Arochukwu PDP can recover its lost grounds”, Peters threatened.\nIn a remark, PDP Vice Chairman, Abia North, Elder Amah Abraham, said the greatest challenge he faced after his election was how to unite the various factions in Arochukwu PDP."
  },
  {
    "headline": "N100m for APC forms reflects its corruption-riddled underbelly, says Lagos PDP",
    "summarized_story": "The cost of All Progressives Congress, APC, expression of interest and nomination forms, put at N100 million is a reflection of the party’s corruption-riddled body, which should interest the country’s anti-corruption agencies.\nLagos State chapter of the opposition People’s Democratic Party, PDP, made the points in a terse statement on Thursday.\nThe statement, signed by Lagos State PDP Publicity Secretary, Hakeem Amode, noted that when a politician pays such an amount, if he wins, recouping his “investments” would be priority.\nThe APC fixed the expression of interest and nomination forms for its presidential ticket at N100 million.\n“Who will ‘invest’ N100 million and not focus on recouping if voted in?"
  },
  {
    "headline": "Delta 2023: Steer clear from partisan politics, APC urges UPU",
    "summarized_story": "Youth Leader of the All Progressives Congress, APC, Delta Central, Famous Oyibo, has urged the Urhobo Progress Union, UPU, to steer clear from partisan politics.\nAccording to Oyibo: “The Urhobo Progress Union, UPU, should completely steer away from partisan politics because a father is expected to do everything possible to unite his children and not to separate them by pitching one against the other.\nThe Urhobos almost did not recover from the consequences of that mistake in history”.\n“If the UPU is adopting David Edevbie of the PDP, what is it talking about other aspirants of Urhobo extraction like Sen. Ovie Omo-Agege of the APC and others who are coming from other parties?\nAre they not sons and daughters under the UPU?”."
  },
  {
    "headline": "2023 Election: Oritsejafor cautions Nigerians against vote-buying",
    "summarized_story": "Oritsejafor who is also the founder of Word of Life Bible Church, Warri in Delta State made the call at the 15th edition of the church’s Micro-Business Empowerment Programme held at the church’s premises in Warri, Delta State.\nNow they want your fake vote, they are still going to rig the election, so they need your fake vote and give you two thousand naira, five thousand naira, one quarter bag of rice, salt and all these nonsense.\n“Our environment will not change until we change this attitude”, he said.\nDirector of Microbusiness Empowerment Programme, Pastor Okeoghene Obiegbedi, said that the programme kicked off in December 2005, with an average cost of N30 million per edition.\nPastor Obiegbedi revealed that the 2021/2022 empowerment Programme, which is the 15th edition targeted to empower 1,100 individuals with N55, 000 each, totalling N60.5 million."
  },
  {
    "headline": "Court frees Imo woman allegedly detained by IRT operatives",
    "summarized_story": "Olajuwon, of the Federal High court in Abuja.\nThe lawyer to the Indigenous People of Biafra, IPOB, Ifeanyi Ejiofor, said this to Vanguard in Owerri.\nHe also told Vanguard that the woman’s freedom came after the legal team of IPOB, applied for the Enforcement of Mrs Maria Ezediaro, Fundamental Human Rights.\n“Recall that following our Application for the Enforcement of Her Fundamental Human Rights filed on her behalf before the Abuja Federal High Court, she was hurriedly charged to court on frivolous and smokescreen charge by the infamous IRT.\nThe Federal High Court seised of the frivolous charge brought against her equally granted her bail on our Application.”“Today, (Thursday) Mrs Ezediaro has finally regained her freedom and presently walking the street a free person."
  },
  {
    "headline": "Insecurity: Buhari lashes Nigerians helping terrorists",
    "summarized_story": "President Muhammadu Buhari on Thursday told Nigerians assisting terrorists that they were only destroying their communities.\nHe also said no responsive government can ignore the role of religious and traditional rulers in tackling insecurity.\nThe President spoke at an Iftar dinner with religious and traditional rulers at the Presidential Villa.\nThe president assured that his administration would continue to count on the advice and guidance of members of the revered institutions towards improving security.\nBuhari reminded traditional and religious leaders that they have a key role to play in terms of improving intelligence gathering."
  },
  {
    "headline": "Killings in Nigeria: ‘If I were Buhari, I would have resigned’ – Wike",
    "summarized_story": "Rivers State Governor, Nyesom Wike, on Thursday, in Jalingo, the capital of Taraba State, said any government that cannot protect the lives and property of its citizens does not deserve to be in power.\nWike, a presidential aspirant on the platform of the Peoples Democratic Party (PDP), stated this while in the state to canvass support of both delegates and party’s stalwarts.\nNot comfortable with the alleged manner the All Progressives Congress (APC), under the leadership of President Muhammadu Buhari, is currently handling the security challenges bedeviling the country, Wike said he would have resigned if he was the president.\nAccording to him, “I would have resigned if I were President Buhari.\nDarius Dickson Ishaku, who has been advocating for state police, said if created, the present security situation of the country would be addressed."
  },
  {
    "headline": "Sexual assault: Prof Opefeyitimi will face disciplinary actions – OAU",
    "summarized_story": "Obafemi Awolowo University (OAU) has announced that Professor Joseph Opefeyitimi will face disciplinary actions.\nThe institution said after a thorough investigation, Professor Opefeyitimi was found prima facie liable.\n“The committee recommended appropriate disciplinary actions against Professor Ayo Opefeyitimi to the University Management.\n“The university administration would have to present its recommendations to the Governing Council which has the final say on the matter”, Olarewaju added.\nThe statement insists OAU does not condone sexual rascality and will protect students “against any sexual predator, no matter how highly placed”."
  },
  {
    "headline": "It’s expensive deploying technology to fight insecurity – NSA",
    "summarized_story": "The National Security Adviser, Babagana Monguno, has said the use of technology in fighting crimes in the country has never been an easy feat because it is expensive in nature.\nAccording to him, it takes time to acquire the necessary technological weapons to fight crimes especially when the country lacks the capacity to mass-produce these weapons.\nHis response, “So, the first question has to do with why is it so difficult to deploy technology.\nTechnology takes time to acquire these things.\nSo, we want to see how we can replicate that type of effort to put in the maritime domain on our land borders."
  },
  {
    "headline": "Gov Buni condemns Geidam attack, calls for more support, prayers",
    "summarized_story": "Yobe State Governor, Mai Mala Buni, has condemned the terrorists’ attack on Geidam community and called for more prayers for a lasting peace in the state and the country at large.\nBuni, in a statement on Thursday through his Spokesman, Mamman Mohammed, described the attack as heinous, especially in this holy month of Ramadan when Muslim faithful seek the mercy of Allah against engaging in obnoxious acts.\nBuni also urged the people in the state to always volunteer useful and timely information to security operatives to enhance proactive measures.\n“We should also use the opportunity provided by the holy month of Ramadan to pray for our state and the country,” the statement added.\nBuni assured the commitment of his administration towards an enduring peace, security and development across the state."
  },
  {
    "headline": "Amotekun nabs woman allegedly trafficking four girls to Ghana",
    "summarized_story": "Operatives of the Ondo State Security Network Agency codenamed Amotekun corps have arrested a 29-year-old woman Titi Happiness for attempting to traffick four girls to Ghana from Abuja.\nThe suspect was arrested when Amotekun operatives were carrying out routine check between the boundaries of Ondo and Kogi States.\nCommander of Ondo Amotekun, Chief Adetunji Adeleye, said investigations showed that the girls were being moved to Ghana for cheap labour.\nShe said: “It was when the security operatives apprehended them that it dawn on us that the madam planned to use us for forced labour or sexual exploitation in Ghana.\nAccording to Adeleye: “We arrested two men who have been impersonating as officials of Amotekun in Ondo, Ondo East local government area of the state."
  },
  {
    "headline": "Fresh recruitment into civil service commences in Edo",
    "summarized_story": "Edo State Government has commenced the recruitment of agricultural superintendents into its civil service commission as part of the ongoing reforms.\nThe Chairman of Edo Civil Service Commission, Princess Ekiuwa Inneh, urged interested and qualified persons to apply through the civil service commission recruitment portal: csc.edostate.gov.ng.\nInneh assured that the recruitment would be free, fair and merit-driven, while stating the applicants were not required to make payment to any person or organisation, in respect of the recruitment.\nShe said: “All applications must be submitted on or before May 27, 2022.\nCandidates must not be more than 35 years of age as at the time of application, and their HND/OND certificates must not be below Lower Credit, while computer/digital literacy will be an added advantage.”The chairman also described Edo government as an equal-opportunity employer, with each applicant to stand the same chance of gaining employment."
  },
  {
    "headline": "Bandits will run if they hear my name",
    "summarized_story": "Rivers Governor Nyesom Wike has told delegates of the Peoples Democratic Party (PDP) in Taraba State that if he secures the party’s ticket and wins the election, he will take the war to bandits.\n“When bandits hear my name they will run because I will take the war to them.\nYou have seen how he has turned Rivers State to a working site.\nSecurity is security.\n“I have been to Rivers State while I was a governor, and have also been to Rivers State while I left as a governor."
  },
  {
    "headline": "Our N100m nomination form to shut out unserious aspirants",
    "summarized_story": "All Progressives Congress (APC) National Women Leader Dr Betta Edu has explained why the party pegged its presidential nomination form at N100m.\nShe said it was to shut out serious aspirants and prevent form syndication.\nThe party at its emergency extraordinary National Executive Committee (NEC) meeting in Abuja on Wednesday announced N100m for the purchase of presidential nomination forms, the governorship form at N50m, Senate N20 million, House of Representatives, N10 million and House of Assembly for N2 million.\nWe are the ruling party, the largest party in Africa, a party where if you pick their nomination form and you are the candidate, the probability of you becoming the elected person for that position is almost hundred percent.\nAccording to her: “For all we care, N1.5 million for a House of Assembly nomination form is fair to the general population."
  },
  {
    "headline": "Why we raided, sealed Abuja hotel, by NDLEA",
    "summarized_story": "The National Drug Law Enforcement Agency (NDLEA) on Thursday said it raided and sealed the Diplomatic Suite Hotel, Asokoro, Abuja in a joint operation with men of the Department of State Services (DSS) to stop a cannabis party and the launch of a suspected new psychoactive drink.\nSpokesman of the agency, Femi Babafemi, said the security operatives raided the hotel on Wednesday where about 200 attendees were arrested.\nThose arrested included three young ladies who organised the hemp party.\nThe statement reads: “The hotel was raided at about 8:18pm on Wednesday 20th April following actionable intelligence that some youths were planning to hold a hemp party at the hotel.\n“Quantities of cannabis sativa were recovered from the pockets and bags of those arrested at the hemp party."
  },
  {
    "headline": "2023: 2 Igbere businessmen set to sign N200m cheque for Lawan, Kalu’s presidential forms",
    "summarized_story": "The businessmen, Ukaegbu James, and Nnanna Kalu, made the announcement on Wednesday in Abuja, noting that both Lawan and Kalu are competent leaders to succeed President Muhammadu Buhari in 2023.\nThe duo noted that APC needed a unifier and committed leader with a good knowledge of Nigeria to succeed President Muhammadu Buhari in 2023.\nThey said: “If we must get it right in 2023, we need a result-oriented leaders, like Kalu and Lawan, to succeed President Buhari in 2023.\nIt is time to present our best hands because there won’t be any room for writing of fake results.\n“We are ready to make N200 million available by weekend to purchase their nomination forms."
  },
  {
    "headline": "PDP extends sale of nomination forms, mocks APC over price",
    "summarized_story": "From Ndubuisi Orji, AbujaPeoples Democratic Party (PDP), yesterday, reopened sales of expression of interest and nomination forms for aspirants seeking to contest the 2023 general election.\nUnder the reviewed timetable, the last day for the submission of already completed forms has been extended to Monday, April 25.”Meawhile, the National Chairman, Iyorchia Ayu, has berated the All Progressives Congress (APC) over the price of its nomination forms.\nThe ruling party had pegged the nomination forms for presidential and governorship aspirants at N100 million and N50 million respectively.\nThe same man, as leader of his party, has now sanctioned the sale of the same forms at N100 million.\nIn fact, all those buying the N100 million and N50 million nomination forms should be investigated for suspected fraud,” he said."
  },
  {
    "headline": "State police panacea to insecurity, say Wike, Ishaku",
    "summarized_story": "From Sylvanus Viashima, JalingoRivers State Governor Nyesom Wike, yesterday, said that he would tackle security challenges confronting the country within six months if elected president in 2023.\nHe said state police would be one enduring approach to addressing the festering insecurity in Nigeria.\nGovernor Wike spoke while wooing delegates of PDP in Jalingo, Taraba State, dismissed the argument against state police.\nYou have seen how he has turned Rivers State to a working site.\nI have been to Rivers State while I was a governor, and have also been to Rivers State while I left as a governor."
  },
  {
    "headline": "Alleged drug trafficking: Nigeria seeks extradition of Colombian citizen to US",
    "summarized_story": "From Godwin Tsa, AbujaThe Nigerian government has commenced extradition proceedings against a Colombian national, Alexander Bedoya-Guevara (aka Hell Boy), who is wanted by the United States of America (USA), for drug related offences.\n715 filed on November 18, 2021, within the jurisdiction of the United States District Court for the Southern District of New York, United States of America.\nThe 32-year-old Colombian is specifically charged with the offence of “Conspiracy to import narcotics in violation of Title 18, United States Code (USC) Sections 963, 952 (a), 960 (a) (1), 959(a), and 960(a) (3)”.\nResponding, Justice Nyako noted that the case was time-bound and threatened to grant the application if the respondent was not ready with his case.\nWhile adjourning the matter to April 28, the judge directed counsel to the respondent to file and serve the necessary processes."
  },
  {
    "headline": "I’ll make Nigeria great again in 4 years – Peter Obi",
    "summarized_story": "He therefore promised to make Nigeria great again under four years if given the opportunity to lead the country.\nObi, who listed his plans for Nigeria, if elected as president, said he was in the race to reset Nigeria and uplift its citizens from poverty and deprivations.\nHe acknowledged that the only hurdle before him is the PDP presidential primary, after which he would defeat the candidates of other political parties.\nHe appealed for the support of Abia State delegates and those from other states on the day of primary.\nChairman of PDP in Abia, Asiforo Okere described Obi as a fine material in whom “Abia, Igboland and Nigeria are proud of.”Okere informed Obi that Abia PDP delegates would take the right decision on the day of the primary polls."
  },
  {
    "headline": "Aisha Buhari Hosts Presidential Aspirants to Ramadan Iftar Saturday",
    "summarized_story": "This is a standard operational protocol in the Villa when you are having either of the three occupants of the Presidency.\n“Whether the president is having an event or the Vice President is having an event or the First Lady is having an event, because outsiders will come.\nThat’s the security and standard protocol.\n“That does not apply to the Vice President.\nHow can you expect that to apply to the Vice President or even to ministers”, he said."
  },
  {
    "headline": "Buhari Presides over Security Council Meeting",
    "summarized_story": "Deji Elumoye in AbujaPresident Muhammadu Buhari is presiding over the National Security Council (NSC) meeting at the State House, Abuja.\nThe meeting, holding at the Council Chambers being attended by heads of security establishments and some Ministers, is sequel to last week’s recommendations by the National Council of State over the security challenges facing the nation.The crucial meeting is also being attended by Vice-President Yemi Osinbajo; Secretary to the Government of the Federation; Boss Mustapha; the Chief of Staff to the President, Professor Ibrahim Gambari; and the National Security Adviser (NSA), Major General Babagana Monguno (rtd.\n).Among the ministers at the meeting are those of Defence, Bashir Magashi; Interior, Rauf Aregbesola; and Foreign Affairs, Geoffrey Onyeama.\nThe Chief of Army Staff, Lieutenant General Farouk Yahaya; Chief of Naval Staff, Vice Admiral Awwal Gambo; and the Chief of Air Staff, Air Marshal Isiaka Oladayo Amao are also in attendance while Chief of Defence Staff, General Lucky Irabor, was represented.\nAlso in attendance are the Inspector-General of Police, Alkali Baba Usman; the Director-General of the Department of State Service (DSS), Yusuf Bichi; and the Director-General of the National Intelligence Agency (NIA), Ahmed Rufai Abubakar."
  },
  {
    "headline": "News in Photographs: National Security Council Meeting Under way",
    "summarized_story": "A meeting of the National Security Council is under way in the Council Chambers at the State House, Abuja.\nIn attendance at the meeting presided over by President Buhari are Vice President Yemi Osinbajo and service chiefs, among others.\nSee photosShare this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Rethink Your Policy on Fuel Subsidy, World Bank Tells Nigeria",
    "summarized_story": "The President, had in a letter to the Legislature dated 10th February, 2022, sought an additional N2.557 trillion to fund subsidy payments from July to December, 2022.\nThe Lead Economist, Nigeria Country office of the World Bank, Marco Antonio Hernandez, had painted a gloomy picture of Nigeria if the country decides to continue with the controversial fuel subsidy.\n“So, we encourage that when there is need for subsidy, either food or for fuel, that it should be carefully targeted at those most in need of it.\nAnd so, we have encouraged Nigeria to rethink its subsidy effort,” he said.\nShe noted: “To address debt, countries need domestic policies that can help bring their budgets back on track, while providing targeted assistance to the most vulnerable."
  },
  {
    "headline": "At Close of Nomination, 17 PDP Presidential Aspirants Beat Deadline",
    "summarized_story": "The party realised N640 million from the 16 male presidential aspirants and N6 million from the only female presidential aspirant, Diana, making the revenue generated N646 million.\nNational Organising Secretary of PDP, Bature Umar, in a statement, said the screening of presidential aspirants would commence April 27, while the governorship aspirants would be screened on April 26.\nAppeals from governorship aspirants would be addressed on April 29, and the presidential appeal committee would hear appeals from dissatisfied presidential aspirants on April 30, the statement said.\nYesterday, also, the Akwa Ibom State governor addressed the party’s NWC on his presidential aspiration, likening the 2023 presidential election to a war, and required an experienced politician to carry the APC presidential ticket.\nAyu advised the PDP presidential aspirants to take their campaigns to the delegates, as their votes would decide the 2023 presidential candidate of the party."
  },
  {
    "headline": "EXPOSED: Multi-billion Naira Properties Located In Ikoyi Owned By Nigeria's Insouciant Labour Minister, Chris Ngige, Amid Education-crunching Strike By Academic Staff Unions",
    "summarized_story": "You may also like"
  },
  {
    "headline": "EXPOSED: Multi-billion Naira Properties Located In Ikoyi Owned By Nigeria's Insouciant Labour Minister, Chris Ngige, Amid Education-crunching Strike By Academic Staff Unions",
    "summarized_story": "You may also like"
  },
  {
    "headline": "Aisha Buhari Invites Osinbajo, Tinubu, Wike, Atiku, Peter Obi, Others For Ramadan Dinner, Warns Them Against Coming With Phones",
    "summarized_story": "The First Lady, Aisha Buhari, has sent out invitations to aspirants gunning for the presidency of the country in the different political parties to show up for a Ramadan dinner with her on Saturday, April 23.\nAccording to the invitation card, the presidential aspirants are expected to present their invitation cards at the gate of the venue otherwise they may be turned back.\nThe presidential aspirants were also instructed to leave their phones behind when coming for the dinner.\nThe ruling All Progressives Congress (APC) currently has about 8 presidential aspirants.\nThe Governor of Ebonyi State, Dave Umahi, followed suit, and in a similar fashion, visited Buhari to inform him of his intention to run for the coveted number one position in the country."
  },
  {
    "headline": "Aisha Buhari Invites Osinbajo, Tinubu, Wike, Atiku, Peter Obi, Others For Ramadan Dinner, Warns Them Against Coming With Phones",
    "summarized_story": "The First Lady, Aisha Buhari, has sent out invitations to aspirants gunning for the presidency of the country in the different political parties to show up for a Ramadan dinner with her on Saturday, April 23.\nAccording to the invitation card, the presidential aspirants are expected to present their invitation cards at the gate of the venue otherwise they may be turned back.\nThe presidential aspirants were also instructed to leave their phones behind when coming for the dinner.\nThe ruling All Progressives Congress (APC) currently has about 8 presidential aspirants.\nThe Governor of Ebonyi State, Dave Umahi, followed suit, and in a similar fashion, visited Buhari to inform him of his intention to run for the coveted number one position in the country."
  },
  {
    "headline": "Nigerian Police Deploy More Assets To South-East, Warn That Attacks On Stations Won’t Be Tolerated",
    "summarized_story": "The Inspector-General of Police (IGP) Usman Baba Alkali, has warned against attacks on police officers and facilities in the country, especially in the South-East region, saying such would no longer be tolerated by the force.\nThe police boss, who lamented the destruction of the facilities, other police operational assets across the country, and the killing of officers, also ordered the deployment of additional assets to support the fight against the criminals.\nWhile gunmen have killed scores of officers in the region, civilians have also died due to the rising level of insecurity in the area.\nAside from police officers, other security operatives have lost their lives while public facilities including that of the Independent National Electoral Commission (INEC) were also targeted.\nSeveral state governments in the region, notably, Anambra, have launched plans to quell the rising insecurity in the South East."
  },
  {
    "headline": "OAU reacts as female student accuses professor of sexual assault",
    "summarized_story": "The management of the Obafemi Awolowo University (OAU) in Ile-Ife has vowed to ensure justice is served in a case of alleged sexual assault involving Joseph Opefeyitimi, a professor at the institution.\nAdvertisementOpefeyitimi is a professor of Yoruba incantations and stylistics in the department of Linguistics and African Languages.\nBoluwatife Bababunmi, a student in the same department, had in a petition addressed to the school, accused the professor of sexually assaulting her in his office.\n“Procedurally, after the receipt of the formal complaints, the first step was that the departmental committee sat on the matter and, after thorough investigation, Professor Opefeyitimi was found prima facie liable.\nThe committee, which also sat and clinically deliberated on this same matter, recommended appropriate disciplinary actions against Professor Ayo Opefeyitimi to the university management."
  },
  {
    "headline": "ASUU strike: UNILAG beats Bowen in ‘Twitter battle’ for Rema",
    "summarized_story": "The University of Lagos (UNILAG) has won the Twitter poll organised by Rema, the Afrobeats singer, on varsity to attend amid the ongoing strike by the Academic Staff Union of Universities.\nReacting to Rema’s Twitter post, Bowen University in Iwo, Osun state had openly invited the singer to enroll in its institution.\nCaught in between the two varsities, the 21-year-old singer on Tuesday put up a Twitter poll to seek the opinions of his fans.\nAfter 24 hours, the Twitter poll accrued 118, 365 votes, and saw UNILAG rake in 63.2% of the votes to Bowen’s 36.8%.\nUNILAG and BOWEN University."
  },
  {
    "headline": "NECO reschedules 2022 NCEE over low registration",
    "summarized_story": "The National Examinations Council (NECO) has rescheduled the 2022 National Common Entrance Examination (NCEE) from April 23 to May 7.\nAccording to Sani, the extension was to give states with low registration of candidates the opportunity to register more people for the exercise.\nAdvertisementHe enjoined candidates, parents, guardians, and relevant stakeholders to take note of the new date for the examination.\nThe NECO spokesman also advised candidates, parents, and guardians to download the new examination timetable from the council’s website — www.neco.gov.ng.\nAdvertisementDantani Wushishi, NECO registrar, had earlier said the registration is only for pupils who would not be less than age 10 by September 2022."
  },
  {
    "headline": "Rivers suspends school teacher over ‘sexual misconduct’",
    "summarized_story": "The Rivers state government has suspended a teacher with Government Girls (Junior) Secondary School in Rumuokuta, Obio/Akpor LGA, over alleged involvement in sexual misconduct.\nAdvertisementThe commissioner also said the state has zero-tolerance for cases of sexual misconduct, adding that anyone found indulging in such would be sanctioned.\n“Gentlemen of the press, you have heard from the FIDA chairperson regarding the information making the rounds that there are about 50 cases of rape in schools in Rivers State.\n“We are serious about discipline in Rivers schools.\nWe have suspended the teacher involved.”Corroborating the commissioner, Bio-Briggs said: “We only have five incidents of schools; two public schools in Rivers State and three private schools that have issues of defilement."
  },
  {
    "headline": "Cute Abiola: I was depressed, so I got a Benz",
    "summarized_story": "Cute Abiola, the Nigerian online skit maker, says he acquired a new Benz because of “depression”.\nAdvertisementIn an Instagram post on Thursday, the entertainer shared a picture of himself sitting on a bicycle while posing beside his newly acquired Mercedes Benz.\nAdvertisement View this post on Instagram A post shared by WORLD BEST 👑 LAWYER KUNLE (@thecuteabiola)AdvertisementThe post by Cute Abiola, whose real name is Abdulgafar Ahmad Oluwatoyin, has continued to stir hilarious reactions among fans.\nThe navy had detained him for allegedly violating its social media policy — a development which had elicited a wave of backlash.\nHe would later be released after serving his punishment and then returned to social media a few days later."
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "Google’s Africa internet cable arrives in Lagos, Nigeria",
    "summarized_story": "Google has announced that earlier today, Equiano, a subsea internet cable running through Portugal to South Africa landed in Lagos, Nigeria.\nThis announcement is coming a month after Equiano first landed on the African continent in Togo.\nThe project, which is named after Nigerian-born writer and abolitionist Olaudah Equiano, is expected to help support further digital transformation in Nigeria, a country with a thriving tech ecosystem.\n“Google is committed to supporting Africa’s digital transformation and we are excited to see the impact of the landing of Equiano in Nigeria,” Juliet Ehimuan, Director, West Africa at Google said.\nLast October, Google CEO Sundar Pichai announced a plan to invest $1billion over 5 years to support digital transformation in Africa, of which project Equiano is part."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there, There are four types of people in this world.\nThe first are those who understand times and seasons, the..."
  },
  {
    "headline": "Google’s Internet cable, Equiano, lands in Nigeria; here’s how it could change your Internet experience",
    "summarized_story": "Share this article:Google has announced the launch of Equiano, a state of the art submarine Internet cable, which is set to land in Lagos, Nigeria.\nThe Internet cable, named after Olaudah Equiano, a historical abolitionist, has a capacity of 144 terabits (18 Terabytes).\nOne of the landmark moments was in 2009, during the launch of the MainOne submarine cable, a private submarine cable that today spans Nigeria, Ghana, and Cote d’Ivoire.\nThere’s a vast submarine cable capacity in Africa that still doesn’t reflect on your download speeds or streaming quality.\nAs of 2020, Africa had a submarine cable capacity of 100 Tbps, but it was only using 10%."
  },
  {
    "headline": "Blockchain-powered insurance: Meet the decentralised insurance protocol, Etherisc, insuring Kenyan farms against bad climate",
    "summarized_story": "Share this article:The concept of decentralised insurance became a theoretical possibility with the emergence of decentralised finance (DeFi).\nWhile DeFi platforms continue to offer borrowing, lending, and staking services, Etherisc, an open-source, decentralised insurance protocol, brings affordable insurance to African farmers away from the complex DeFi protocols.\nFrom traditional insurance to decentralised insuranceEtherisc team with Keyan localsBerende has been in the insurance space since the early 2000s.\nAccording to the Africa Insurance Pulse 2022, insurance penetration in Africa stood at 2.78%, a decline from 2.98% in the previous year.\nHowever, satellite data is not as precise as data obtained from the ground when measuring precipitation."
  },
  {
    "headline": "Concordium Foundation chairman spreads the message of compliance in blockchain technology",
    "summarized_story": "Share this article:Lars Seier Christensen, Chairman, Concordium Foundation and founder of Seier Capital, met with some stakeholders in the blockchain, financial, and tech space in an exclusive event held at Four Points by Sheraton on Thursday, April 14.\nLars Seier Christensen gave a lecture touching on the blockchain, the internet, Concordium blockchain, and investing, among others.\nHis talk stressed that the Concordium blockchain is big on compliance and working with regulators because he believes that blockchain technology regulation is inevitable.\nThe important thing about blockchain is blockchain.\nThe use cases for blockchain are immense, and one of the use cases of a well-built blockchain is the preservation of data."
  },
  {
    "headline": "Peter Obi most preferred presidential candidate – Poll",
    "summarized_story": "Peter Obi, a former governor of Anambra State and a presidential aspirant on the platform of the People’s Democratic Party (PDP), has been tipped as the most preferred candidate in the 2023 among 14 others.\nThey are Peter Obi, Yemi Osinbajo, Bola Ahmed Tinubu, Atiku Abubakar, Musa Rabiu Kwankwaso, Nyesom Wike, Godwin Emefiele, Rotimi Amaechi and Kayode Fayemi.\nThe result revealed that almost half of the respondents (46.04 percent) selected Peter Obi as their most preferred candidate for president in 2023.\nObi, who was a running mate to former Vice President, Atiku Abubakar in 2019 presidential election, is among the leading aspirants for the presidential ticket of the PDP.\nThe poll result stated that for three most preferred vice presidential candidate, the respondents picked Aminu Tambuwal (28.05 percent), Musa Kwankwaso (19.27 percent), and Peter Obi (16.27 percent)."
  },
  {
    "headline": "14.5 million Nigerians facing acute food insecurity – UNICEF",
    "summarized_story": "At least 14.5 million Nigerians are facing acute food insecurity, largely due to persisting insecurity and the devastating impact of the COVID-19 pandemic, the United Nations Children’s Fund (UNICEF) disclosed on Thursday.\nAccording to the 2018 Nigeria Demographic and Health Survey, Nigeria has 35 million children under the age of five.\nOut of which, 14 million are stunted, 3 million are wasted and 24 million are anaemic due to poor nutrition.\nGeoffrey Njoku, communication specialist, UNICEF warned that malnutrition should not be treated as a northern problem.\nAccording to him, doing so could deny children suffering from malnutrition in the south the intervention they need."
  },
  {
    "headline": "Rehabilitation of ‘repentant Boko Haram’ not yielding desired result – NSA",
    "summarized_story": "Babagana Monguno, Nigeria’s national security adviser, has said the surrendering and reintegration of “repentant Boko Haram elements” has not engendered the desired result in stemming insurgency in the country.\nMongonu disclosed this after a meeting the President had with Service Chiefs and other major stakeholders in the country, Thursday.\nThe retired Major General also expressed President Muhammadu Buhari’s grief about the country’s security situation.\nThe NSA noted that the President feels that enough was not being done by the security agencies despite what has been provided.\nThe NSA also spoke on the threats coming from the country’s vast land borders and the need to replicate in them what has been achieved in the maritime borders."
  },
  {
    "headline": "Unicorn Group Announces the Launch of the First Pan-African Incubation Program – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestOn the 19 April 2022, Unicorn Group launched its fourth incubation program for entrepreneurs on the African continent.\nThis incubation program, described as the first ‘truly’ Pan African program will run concurrently across six (6) African countries -Nigeria, Ghana, South Africa, Kenya, Uganda, and Egypt.\nThe Unicorn Group enables Africa’s prosperity through entrenching catalyst tools for regional and national economic development.\nAbout Unicorn GroupUnicorn Group is a pan-African, investment company targeting innovative ideas, start-ups and early stage companies in the technology and technology-enabled sectors across Africa; that have the potential to emerge as unicorns.\nUnicorn provides education, training, mentorship, infrastructure, and long-term capital to entrepreneurs, start-ups and early stage in the technology and technology- enabled sector through its ecosystem strategy."
  },
  {
    "headline": "EIRS Announces Availability of New Number Plates – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY- Edo State Internal Revenue Service (EIRS) has announced the availability of new number plates at its corporate and branch offices.\nIn a press release made available to the Nigerian Observer Newspaper, the EIRS stated, “As part of the mandate to render value added service, we wish to inform the general public that we have received from the Federal Road Safety Corps (FRSC) Number Plates which are presently available at the EIRS Corporate and Branch Offices across the State.”While apologising for any inconveniences caused by the delay in bringing out new number plates largely due to the turnaround maintenance carried out at the Federal Road Safety Corps (FRSC) production plants across the country, EIRS informed all vehicle, tricycle and motorcycle owners to get their expired vehicle documentation or particulars validated as driving with expired vehicle particulars is a contravention of the extant road traffic laws.\nManagement of EIRS called on concerned members of the public to channel their enquiries on number plate applications to 0813 097 0146, 0809 203 8444 or visit www.eirs.gov.ng as well as send e-mail to info@eirs.gov.ngShare this: TweetMoreWhatsApp..."
  },
  {
    "headline": "Edo begins fresh recruitment into civil service – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Government has commenced the process for the recruitment of agricultural superintendents into the Edo State Civil Service Commission, as part of ongoing reforms of the state’s civil service.\nIn a statement, the Chairman of Edo State Civil Service Commission, Princess (Mrs).\nThe statement reads: “Applications are hereby invited from suitably qualified candidates to fill some vacant posts in the Edo State Civil Service.\nMultiple applications will result in disqualification.”“Edo State Government does not require candidates to make any payments to any person or organization in respect of this recruitment exercise.\nThis recruitment shall be free, fair and merit-driven,” the chairman assured."
  },
  {
    "headline": "Dr. Nosa Aigbe Leberty: A Doctor with a Difference – Nigerian Observer",
    "summarized_story": "Hearing Dr Nosa speak about his passion and dreams for the African man especially his place of birth (Edo State), one will begin to wonder.\nDr Nosa has an evidence based holistic approach and training in urgent care, primary care and specialized addiction Medicine.\nThe goal according to Dr. Nosa is to inspire the people.\nAnd the reason according to Dr. Nosa is because of maintenance to keep the place going.\nAnything that will help make Edo State shine out to the world is what brings joy to the governor and people of the state, Edo state is going to be great again."
  },
  {
    "headline": "Yadda Ƴan bindiga suka kashe mutum uku suka yi garkuwa da mutane da dama a jihar Katsina",
    "summarized_story": ""
  },
  {
    "headline": "BAYAN YA SHA MATSIN-LAMBA: Buhari ya bada dalilan sa na yi wa gaggan ɓarayin gwamnati afuwa",
    "summarized_story": ""
  },
  {
    "headline": "IYA RUWA FIDDA KAI: APC ta ce ba za a yi maslaha ba a zaben fidda dan takarar shugaban kasa",
    "summarized_story": ""
  },
  {
    "headline": "TULIN BASHI: Hukumar babbar birnin tarayya ta garƙame ma’aikatar tsaro, da wasu ma’aikatun gwamnati",
    "summarized_story": ""
  },
  {
    "headline": "Kwankwaso ya siya fom ɗin takarar shugaban kasa a jam’iyya mai alamar kayan daɗi, NNPP",
    "summarized_story": ""
  },
  {
    "headline": "Insecurity: Obasanjo calls for state police, says it’s now a better option",
    "summarized_story": "A statement by his Special Assistant on Media, Kehinde Akinyemi, hinted the visit was led by the pioneer National chairman, Hon.\nAyantoye Adekunle (State Chairman, Osun State), Hon Tajudeen Oke (State Chairman, Oyo State), Hon.\nAkinwunmi Sowore (State Chairman, Ondo State), Hon Ogidi Akindele (State Chairman, Ekiti State) and Hon Nicholas Akinbiola (Ondo State).\nAdeniyi Fasanmi (National Asst Fin Secretary), Hon Isikilu Makinde (Ogun State), Hon Gafar Balogun (Ogun State), Hon.\nTajudeen Salako (State Secretary, Ogun State"
  },
  {
    "headline": "Nigerians can now see APC for what it is’ – PDP hits party over ‘exorbitant’ prices of nomination forms",
    "summarized_story": "The People’s Democratic Party (PDP), Nigeria’s main opposition party, has attacked the ruling All Progressive Congress (APC) over the ‘exorbitant’ cost of its expression of interest and nomination forms.\nAyu said with the exorbitant price of the forms, the party was still ready to inflict more pains on Nigerians.\nThe same man, as leader of his party, has now sanctioned the sale of the same forms at N100m!\nIn fact, all those buying the N100m and N50m nomination forms should be investigated for fraud.\n“We, the Peoples Democratic Party (PDP), are different."
  },
  {
    "headline": "ISWAP Terrorists kill 21people in Yobe attack",
    "summarized_story": "Terrorists of the Islamic State’s West Africa Province (ISWAP) on Wednesday night, killed 21 persons in an attack at Gaidam town, Gaidam local government area of Yobe State.\nMallam Idi, a resident of the town told Leadership that the terrorists took them by surprise as they sneaked into the town without firing any shot or using vehicles.\nHe added that the terrorists also burned down the staff quarters of the Government Science and Technical College Geidam.\nAt GSTC, I understand that only one person died,” another resident told Leadership.\nMai Mala Buni, governor of the state, had last month lifted a ban on the use of motorcycles in some parts of the state."
  },
  {
    "headline": "2023: Abia group hails Alex Otti, to raise N50m for governorship form",
    "summarized_story": "The Abia Freedom Alliance (AFA), an association of concerned technocrats, professionals, businessmen and religious leaders from Abia State, has offered to purchase the expression of interest and nomination forms for gubernatorial aspirant, Dr Alex Otti.\nOtti, a chieftain of the All Progressives Congress (APC), on Easter Sunday declared his intention to vie for the governorship seat of Abia State, in the 2023 election.\nAFA said its members will raise the N50 million as approved by the National Executive Committee (NEC) of APC, to buy the form for Otti, who is making a third time bid for the top public service job in Abia State.\n“We congratulate the indefatigable and irrepressible Dr Alex C. Otti OFR, for his tenacity and purposeful commitment towards the liberation of Abia people.\nAccording to AFA, “We believe Otti, when he said during his declaration of interest for the governorship of Abia State, that he will free Abia from their slave Masters."
  },
  {
    "headline": "No-Interview Visa Renewals For Nigerian Students – US",
    "summarized_story": "The United States Embassy in Nigeria has said that Nigerian students currently studying in the US may be eligible to renew their student visa without an interview when they return to Nigeria this summer.\nLagos applicants are advised to go to www.ustraveldocs.com/ng and follow the instructions to make an interview waiver appointment for a student visa.\n“Scheduled applicants who qualify for the student renewal based on the above criteria can cancel their appointments and re-apply on this link .\nDuring the rescheduling process you will be asked questions confirming eligibility for the student renewal program and be provided instructions on how to submit the application through the document delivery center.\n“If you do not qualify for a student renewal, please do not cancel your appointment.”"
  },
  {
    "headline": "Buhari Appoints New Aide On Employment, Job Creation",
    "summarized_story": "President Muhammadu Buhari has approved the appointment of Mrs Matilda Mmegwa as Senior Special Assistant to the President on Employment and Job Creation in the office of the Minister of Labour and Employment.\nThe Senior Special Assistant, who has held a number of posts in the private sector in Canada and international organisations, will work under the leadership of the Minister of Labour and Employment, Dr. Chris Ngige, on issues of job creation.\nAccording to a statement by presidential spokesman, Femi Adesina, Mrs Mmegwa brings to the position over 30 years’ experience in the field of strategic leadership, corporate governance, social inclusion and economic development.\nShe is an internationally decorated Presenter/Keynote Speaker and was the lead discussant at the Commonwealth Association for Public Administration and Management (CAPAM) conference in Tanzania in 2009.\nShe holds a degree in Industrial Chemistry, professional qualifications as Chartered Accountant in both Nigeria and Canada, a Master’s degree in Strategy and Corporate Governance."
  },
  {
    "headline": "NDLEA Raids Abuja Cannabis Party, Arrests 200 Guests",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA), on Wednesday, raided and sealed Diplomatic Suite Hotel, Asokoro, Abuja in a joint operation with men of the Department of State Services (DSS) to stop a cannabis party and the launch of a suspected new psychoactive drink.\nNDLEA spokesperson, Femi Babafemi, said about 200 attendees including three young ladies who organised the hemp party were being profiled and interviewed while bottles of the new drink have been taken for lab analysis.\nBabafemi ina statement on Thursday said, “the hotel was raided at about 8:18pm on Wednesday 20th April following actionable intelligence that some youths were planning to hold a hemp party at the hotel.\n“Quantities of cannabis sativa were recovered from the pockets and bags of those arrested at the hemp party.\n“The audacious party no doubt is part of attempts by some elements to create a drug subculture in the Nigerian social space."
  },
  {
    "headline": "NDLEA Raids Abuja Cannabis Party, Arrests 200 Guests",
    "summarized_story": "Operatives of the National Drug Law Enforcement Agency (NDLEA), on Wednesday, raided and sealed Diplomatic Suite Hotel, Asokoro, Abuja in a joint operation with men of the Department of State Services (DSS) to stop a cannabis party and the launch of a suspected new psychoactive drink.\nNDLEA spokesperson, Femi Babafemi, said about 200 attendees including three young ladies who organised the hemp party were being profiled and interviewed while bottles of the new drink have been taken for lab analysis.\nBabafemi ina statement on Thursday said, “the hotel was raided at about 8:18pm on Wednesday 20th April following actionable intelligence that some youths were planning to hold a hemp party at the hotel.\n“Quantities of cannabis sativa were recovered from the pockets and bags of those arrested at the hemp party.\n“The audacious party no doubt is part of attempts by some elements to create a drug subculture in the Nigerian social space."
  },
  {
    "headline": "Insecurity: Nigeria Needs State Police Not Community Policing – Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo, on Thursday, joined the league of eminent Nigerians calling for the creation of the state police to enable the country effectively overcome the plethora of security challenges currently facing it.\nThe former president, who played host to the leadership of the National Association of Ex-Local Government Chairmen in Nigeria expressly declared that creation of a state police would be a better option to the establishment of community policing recently approved by the federal government.\nAlbert Asipa, body of the former elected Local Government chairmen had paid Obasanjo a courtesy visit at his Abeokuta home in the Ogun State capital.\nIt is from that state police that we can now be talking about community police,” Obasanjo explained.\nADVERTISEMENT“They were working and they were very visible, building and managing roads, looking into education, health, local administration, agriculture, but they were all gone,” Obasanjo said."
  },
  {
    "headline": "Wike: When bandits hear my name they will run",
    "summarized_story": "By Okafor Ofiebor/Port HarcourtRivers State governor and a PDP presidential aspirant, Nyesom Wike, on Thursday said if elected as President, he will take the war to bandits, saying that when they hear his name, they will run away.\nWike, while wooing delegates of PDP in Taraba State when he met with them in Jalingo on Thursday, dismissed the argument against the need for State Police.\nThe Rivers State governor said those opposing state police often argue that if allowed, state governors would use it against their opponents.\n“When bandits hear my name, they will run because I will take the war to them.\nSimilarly, the Taraba State governor, Darius Ishaku also harped on the need for the creation of state police."
  },
  {
    "headline": "Ex-Honduran President Hernandez, handcuffed, extradited to U.S.",
    "summarized_story": "Former Honduran President Juan Orlando Hernandez has been extradited to the United States to face trial for participating in a cocaine-importation conspiracy and related firearms offences.\n“Hernandez abused his position as president of Honduras from 2014 through 2022 to operate the country as a narco-state,” U.S. Attorney General Merrick Garland told reporters in Washington.\nHernandez’s younger brother, Tony Hernandez, a former Honduran congressman, was sentenced to life in prison in the United States in March 2021 after an earlier conviction on drug trafficking charges.\nBut he has pledged to cooperate with authorities and has portrayed himself as a fierce opponent of drug trafficking.\nIn the Honduran capital Tegucigalpa, the handcuffed ex-president was escorted to the airport by a phalanx of security forces."
  },
  {
    "headline": "EXPOSED: Multi-billion Naira Property In Lagos Owned By Nigeria’s Labour Minister, Chris Ngige, Unbothered Amid Ongoing Varsity Lecturers’ Strike",
    "summarized_story": "Chris Ngige, Nigeria’s Minister of Labour and Employment, is the owner of a multi-billion naira property.\nThe vast edifice under construction is located at number 23, Milverton Road, Ikoyi, Lagos State, according to SaharaReporters.\nThe apartments in the ongoing development are being auctioned for $3 million (N1.74 billion at the current exchange rate of N580/$), according to sources.\nHe said his experience in public office over the years gives him the capacity to perform well as president.\nIn properly assessing this government and our programmes, it is important we start from where we met Nigeria in 2015."
  },
  {
    "headline": "Niger State Govt Refutes Claims That Airstrikes Killed ‘Six Children’",
    "summarized_story": "Niger State Govt have reacted to the stories flying around depicting the Nigeria Airforce killed civilians and bombed houses in Kurebe, Shiroro Local Government Area of Niger State.\nThe Niger State Government welcomes the ongoing intensified military operations in neighbouring states and in some local government areas in Niger state which includes Shiroro, Munya and other LGAs which is aimed at neutralising of bandits/terrorist in these environments.\nWhile the State Government appreciates the victories recorded during these operations, it also looks forward to a sustained operations to eradicate bandits from the state.\nThese efforts will no doubt restore confidence in the communities within the area, which will enable them return back to their farms.\nEmmanuel UmarCommisioner for Local Government/Chieftaincy Affairs and Internal Security,Niger state."
  },
  {
    "headline": "Funeral Service Of Train Attack Victim, Chinelo Megafu Begins",
    "summarized_story": "Dr. Chinelo Megafu, 29, was shot in the ill-fated Abuja-Kaduna train attack on March 28.\nHer funeral is being held at Shepherdhill Baptist Church in Obanikoro, Lagos.\nMegafu will be laid to rest today, April 21, at the Ebony Private Cemetery in Ikoyi, Lagos, following a requiem service.\nThe terrorists who assaulted the train shot the dental surgeon.\nBelow are photos from her funeral service taking place at Shepherdhill Baptist Church, Obanikoro, Lagos."
  },
  {
    "headline": "Deputy Governor Resigns Appointment Ahead Of APC Primaries",
    "summarized_story": "The Katsina state deputy governor, QS Mannir Yakubu has resigned his political appointment as Commissioner of Agriculture and Natural Resources in preparation to declare his interest for the state’s governorship position come 2023.\nThe resignation was contained in a press statement issued to Vanguard by Ibrahim Musa kallah, the Chief Press Secretary to the Deputy Governor.\nAccording to the statement, the decision was in compliance with Section 84 (12) of the 2022 electoral act as amended which requires all political appointees and public servants interested in contesting for election to resign their appointment.\nThe Deputy Governor in the statement “thanked the Almighty Allah and Governor Aminu Masari for giving him the opportunity to contribute towards the restoration of agriculture in the state under the Masari’s administration.”Mannir in the statement also “expressed his happiness over the repositioning of the agricultural sector where farmers experienced turn around in agricultural production that guaranteed food security and agro-industrial needs of the state and Nigeria at large.”"
  },
  {
    "headline": "Onu urges Nigerians to embrace the full implementation of the executive order No.5 for the sustainable growth of the country",
    "summarized_story": "By Eunice OrikeMinister of Science Technology and Innovation, Dr Ogbonnaya Onu has called on Nigerians to support and embrace the full implementation of the executive order No 5 for the sustainable growth and development of the country.\nThe Minister who made the call during his keynote address at the sensitization workshop and the launch of the complaints /appeal procedure of the presidential executive order NO.\nThis was to showcase the available research and development results ready for uptake and eventual commercializationI am also happy that already the effect of the Executive Order is being felt in the country.\nThe University of Transportation, Daura, is one of the products of the Executive Order”, he said.\nHe also used the opportunity to applaud the national coordinator of the Strategy Implementation Task Office of the Presidential Executive Order No."
  },
  {
    "headline": "Fashola tasks new Board to reposition FMBN",
    "summarized_story": "By Onu OkorieMinister of Works and Housing Mr Babatunde Fashola has tasked the newly inaugurated Board members of the Federal Mortgage Bank of Nigeria FMBN to re-position it as the pre-eminent Mortgage Bank for Nigeria as envisioned by the founders.\nThis was part of his address after inauguration of the Board yesterday in Abuja.\n“In other words, your tenure of four years on the Board and five years on the Management Committee are not guaranteed but subject to performance.” He said.\nHe also drew the attention of the Board to the completion of the over 2,000 Housing Units at various levels of completion under the Ministerial Pilot Housing Scheme.\n“I expect this to happen through due process, supported by Legal consultations, Board debates and decisions and Ministerial or Presidential approvals as may be necessary.” He stated."
  },
  {
    "headline": "SIFAX group trains 101 staff in Q1",
    "summarized_story": "By Kehinde Ibrahim, LagosIN fulfillment of its human capacity programme, a total of 101 staff from various subsidiaries of SIFAX Group have undergone different trainings in the first quarter of 2022.\nThe trainings focused on bespoke needs of the staff, including leadership competence, operations management, terminal traffic management, health, safety and environment, security, digital marketing and corporate governance.\nSelected traffic managers from Ports and Cargo Handling Services (PCHS) were trained on terminal traffic management.\nDockworkers were trained on industrial health, safety and environmental (HSE) management.\nSecurity staff from different subsidiaries also completed a 3-day basic security course that was designed to provide critical understanding of their roles in achieving the company’s objectives."
  },
  {
    "headline": "DG, stakeholders calls on FG to return SON to seaports",
    "summarized_story": "Salim made the call at a stakeholders sensitisation forum organised by the agency in Apapa, Lagos, with the theme “Standards Save Lives, Grow Economy”.\nHe also flayed unpatriotic importers who out of greed importing substandard products into the country to maximise profits.\nFarinto like other stakeholders, called on the Federal Government and managers of the economy to bring SON back to the nation’s seaports, adding that it is the best and surest way to stop substandard goods from coming into the country.\nHowever, the increase in the imports of sub-standard goods and the effort of some freethinker have shown that there is need to reverse this executive decision inorder to win the war against importation of sub-standard goods in Nigeria.\nDealing in fake and substandard products is a crime to humanity and poses great danger for the nation’s economy, as a result of this, we must collaborate with SON to collectively fight this battle against a substandard goods."
  },
  {
    "headline": "NIMASA committed to Maritime varsity development –Jamoh",
    "summarized_story": "By Kehinde Ibrahim, LagosTHE Director General of the Nigerian Maritime Administration and Safety Agency (NIMASA), Dr. Bashir Jamoh, has restated the Agency’s commitment to development of the Nigerian Maritime University,(NMU) Okerenkoko, Delta State.\nHe stated this when a delegation from the University paid a visit to NIMASA Management in Lagos.\nHe said that despite handing over the university to the National University Commission,(NUC) the agency is committed to supporting NMU by completing projects it initiated in the University.\n“Nigeria Maritime University can conveniently bridge the gap in terms of human capacity deficiency in the Nigerian Maritime sector.\nAll you need to do as management is to seek collaboration with similar specialized institutions and ensure that NMU certificates enjoy global recognition."
  },
  {
    "headline": "Death Toll In Taraba Bomb Blast Rises To Six As ISWAP Takes Responsibility",
    "summarized_story": "The Anti-bomb squad of the Nigeria Police Force were also on ground combing the area for a possible bomb detonation.\nREAD ALSO: Bomb Explosion Rocks Cattle Market In TarabaMeanwhile jihadists affiliated to the Islamic State have claimed responsibility for the attack.\nISWAP has become the dominant threat in the northeast since the death in May 2021 of Abubakar Shekau, the former leader of rival group Boko Haram.\nMore than 40,000 people have died and around two million have fled their homes since the insurgency began in 2009.\nThere has been growing concern about increasing ties between jihadists and bandits who are motivated by financial motives with no ideological leaning."
  },
  {
    "headline": "Terrorists Attack Yobe Community, Kill Nine",
    "summarized_story": "Exactly one year after suspected Boko Haram insurgents displaced residents of Geidam community in Yobe state, the insurgents onWednesday night launched another attack.\nThe locals further explained the attackers took the residents and the military base at Geidam unaware as there was no gun battle.\nAccording to their accounts, the terrorists silently sneaked into the town, executed their mission and left.\nREAD ALSO: Troops Kill Over 27 Boko Haram/ISWAP Terrorists, Rescue Six Female HostagesAlthough the military on receiving the information responded swiftly the attackers had already fled into bush.\nAs at time of filing-in this report, security authorities were yet to confirm the attack."
  },
  {
    "headline": "Insecurity: State Police Now A Better Option – Obasanjo",
    "summarized_story": "Former President Olusegun Obasanjo has disclosed that amid growing insecurity in the country, the creation of state police would be a better option than community policing.\nAyantoye Adekunle ( State Chairman, Osun State), Hon Tajudeen Oke (State Chairman, Oyo State), Hon.\nAkinwunmi Sowore (State Chairman, Ondo State), Hon Ogidi Akindele (State Chairman, Ekiti State) and Hon Nicholas Akinbiola ( Ondo State).\nAdeniyi Fasanmi ( National Asst Fin Secretary), Hon Isikilu Makinde (Ogun State), Hon Gafar Balogun (Ogun State), Hon.\nTajudeen Salako (State Secretary, Ogun State)."
  },
  {
    "headline": "Buhari Orders Security Agencies To Rescue All Captives Across Nigeria",
    "summarized_story": "President Muhammadu Buhari has once again issued fresh directives to security agencies to rescue all those in captivity across the country and advance the acquisition of intelligence.\nThe National Security Adviser, Babagana Munguno disclosed this to State House Correspondents after the National Security Council meeting held on Thursday and chaired by President Buhari.\nHe said the President is not happy with the prevailing security situation.\n﻿READ ALSO: Nobody Will Be Allowed To Destabilise Nigeria, Buhari WarnsAccording to him, the last straw was the recent attack on the Abuja/ Kaduna train leading to the killing of some passengers and kidnapping of scores.\nInsufficient technology and human intelligence particularly from the wider society, according to him, has led to the persistent war and unless this is defeated, the war might become insurmountable."
  },
  {
    "headline": "200 Arrested As NDLEA Seals Off Abuja Hotel Over Cannabis Party",
    "summarized_story": "Over 200 persons have been arrested as the National Drug Law Enforcement Agency (NDLEA) sealed off a hotel in Abuja, the anti-narcotics agency said on Thursday.\nHe said during the raid, illicit drugs were recovered, while organisers of the cannabis party as well as attendees have been arrested and are currently in custody.\n“About 200 attendees, including three young ladies who organised the hemp party, are currently being profiled and interviewed while bottles of the new drink have been taken for lab analysis.\n“The hotel was raided at about 8:18 pm on Wednesday, 20th April, following actionable intelligence that some youths were planning to hold a hemp party at the hotel.\nQuantities of Cannabis Sativa were recovered from the pockets and bags of those arrested at the hemp party."
  },
  {
    "headline": "2023: Yiaga Africa condemns exorbitant fees for party's nomination Forms",
    "summarized_story": "A civil society organisation (CSO), Yiaga Africa, has expressed concern over the exorbitant cost of nomination forms of political parties for the 2023 general elections.\nAccording to Yiaga Africa, the high cost of nomination forms being charged by political parties in preparation for the 2023 general elections was a huge disservice to teeming women, youth and persons with disabilities (PWDs), who nurse the ambition to run for elective offices in next year’s general elections.\nRead the full statement below:Yiaga Africa notes with utmost concern the high cost of nomination forms being charged by political parties in preparation for the 2023 general elections.\nWe note that this is a huge disservice to teeming women, youth and persons with disabilities (PWDs) who nurse the ambition to run for elective office in next year’s general elections.\nWe welcome the concessions made by some political parties to women, youth and PWDs and call for a further downward review of the cost of nomination forms to allow for an inclusive process without discrimination to any group or demography of the society."
  },
  {
    "headline": "Fmr Slovak PM, Róbert Fico, allies charged with organised crime",
    "summarized_story": "Former three-time Prime Minister Róbert Fico and former Interior Minister Róbert Kaliák, who have dominated Slovakian politics for the past 15 years, were on Wednesday charged with organised crime offenses.\nFico, who is still a member of parliament for the opposition Smer party, cannot be arrested without the legislature’s permission.\nFico was accused of being the leader of a “criminal organization” that includes former police director Tibor Gapár and Slovak oligarch Norbert Bodor, according to the indictment.\nHe stood for president in 2014, while serving his second term as Prime Minister of Slovakia, but was defeated by Kiska by nearly 20 percentage points.\nFico accused Kiska of “making his money from usury on impoverished people,” “misusing his charity for political goals,” and having “close ties to Scientology” during an exceptionally acrimonious campaign."
  },
  {
    "headline": "BREAKING: Lagos GAC okays Sanwo-Olu for second term",
    "summarized_story": "Lagos State Governor, Babajide Sanwo-Olu has secured the consent of the Governance Advisory Council (GAC) to run for a second term in office.\nThe GAC, the apex body within the state ruling political class of All Progressives Congress (APC) approved second term for Sanwo-Olu at its meeting this afternoon at State House, Marina.\nWith the APC governorship election primaries slated for May 27, the speculation on whether Sanwo-Olu will get a second term has become rife among the business and political elites in the state, especially members of the APC."
  },
  {
    "headline": "Akeredolu backs wife's senatorial ambition In Imo",
    "summarized_story": "Ondo state governor, Oluwarotimi Akeredolu has declared support for his wife’s Senatorial ambition.\nThe governor’s declaration was contained in a statement he personally signed.\nOndo First Lady, Betty Anyanwu- Akeredolu has shown interest to run for Imo East Senatorial SeatRecall that the state opposition People’s Democratic Party had on Sunday alleged that the governor was using the state fund to sponsor the wife’s Senatorial ambition in Imo state.\nBut in a subtle response, Akeredolu, in the statement, said he believed in the mission of the First Lady to emancipate women from the shackles of all forms of oppression.\nHe described her as a fiercely independent personality who is never afraid to voice her dissent on any issue."
  },
  {
    "headline": "APC Sets Presidential Form At 100M + CAN Calls For Sack Of Bank CEO – Trending With Ojy Okpe",
    "summarized_story": "Reactions have trailed the cost of nomination forms as updated by the All Progressives Congress for its public offices.\nOn Wednesday the party announced that presidential hopefuls are expected to pay N100 million naira for the nomination forms while those vying for governorship will pay N50 million naira.\nIn another development, the Christian Association of Nigeria has called for the immediate removal of Abubakar Suleiman, the chief executive officer of Sterling Bank over the bank’s controversial Easter message where the bank compared the resurrection of Jesus Christ with a loaf of bread.\nFinally, in Rwanda a court sentenced a Chinese National to 20 years in prison for torture after a viral video showed him beating men tied onto a tree."
  },
  {
    "headline": "Betta Edu: APC Expression of Interest Is In The Right Order",
    "summarized_story": "According to the APC National Women Leader, Dr Betta Edu, President Muhammadu Buhari would work in concert with its National Chairman, Senator Abdullahi Adamu, and other organs of the party to come up with acceptable candidates for next year’s general election.\nDr. Edu also stated that the party would not cede its presidential ticket to any aspirant known to be a male chauvinist.\nIn addition, the party fixed the expression of interest and nomination forms for its presidential ticket at N100m.\nWhile female aspirants will get free nomination forms but will have to pay for their expression of interest forms.\nTo discuss the latest developments in the ruling All Progressives Congress – the APC, is the National Women Leader, Dr Betta Edu."
  },
  {
    "headline": "Macron Cements French Presidential Frontrunner Status with Combative Debate Performance",
    "summarized_story": "Still, during the debate Macron failed to dispel an image of haughtiness that has taken root during his presidency.\nHe interrupted his rival repeatedly with lines like “Mrs Le Pen is much more disciplined than five years ago”, and “Stop mixing everything up”.\n“Mr Macron, stop lecturing me,” Le Pen retorted.\n“I am not a climate sceptic, but you’re a bit of a climate hypocrite,” Le Pen quipped.\nAnd Marine Le Pen remains scary for half of them.”Reuters"
  },
  {
    "headline": "Putin Tells Forces Not to Storm Ukraine Holdout in Mariupol",
    "summarized_story": "The findings added to thousands of civilians reported killed by Russian forces, who have been accused of wholesale abuses of Ukrainians.\nOn the battlefield, Ukraine said Moscow continued to mount assaults across the east, probing for weak points in Ukrainian defensive lines.\nDetaching it from the rest of Ukraine would give Putin a badly needed victory two months into the war, after the botched attempt to storm the capital, Kyiv.\nEarlier this week, Ukraine said the Russians dropped heavy bombs to flatten what was left of the Azovstal steel plant .\nIt will “make those who, in the heat of frantic, aggressive rhetoric, try to threaten our country think twice,” Putin said."
  },
  {
    "headline": "Over 15m Passengers Passed Through Nigeria’s Airports in 2021",
    "summarized_story": "The National Bureau of Statistics (NBS) has stated that a total of 15,225,627 travellers passed through Nigeria’s airports in 2021.\nThe details showed that the total number of international passengers who passed through Nigerian airports was 2,219,146, as against 1,408,026 passengers in 2020.\nSimilarly, the total number of international passengers who passed through Nigerian airports were 2,219,146 in 2021 as against 1,408,026 passengers in 2020.\nA total of 4,758,843 passengers passed through the domestic terminal of the Nnamdi Azikiwe International Airport, Abuja, while 4,093,712 passengers passed through the domestic terminals of the Murtala Muhammed Airport, Lagos.\nThe domestic terminals of Port Harcourt International Airport had 900,728 passengers, Mallam Aminu Kano International Airport (545,749) and Akanu Ibiam International Airport (508,513)."
  }
]