[
  {
    "headline": "Ogun workers suspend strike after four days",
    "summarized_story": "The Organised Labour in Ogun State on Friday evening suspended its four-day-old strike with immediate effect.\nThis was made known in a letter signed by the Ogun leadership of the labour unions – the Chairman, Nigerian Labour Congress, Emmanuel Bankole; Chairman, Trade Union Congress, Akeem Lasisi and the Chairman, Joint Negotiating Committee, Isa Olude.\nThe letter read, “Following the Memorandum of Action reached between the Organised Labour and the Ogun State Government after series of meetings, and negotiations, the Organised Labour hereby suspends the ongoing industrial action with immediate effect.\n“All workers are hereby enjoined to resume at their duty posts immediately.”The PUNCH reported that violence broke out on Friday at the NLC’s Secretariat, Abeokuta, the Ogun State capital, as one worker was feared dead while the labour leaders escaped mob attack.\nThe labour unions had begun the strike on Tuesday following the expiration of the seven-day ultimatum issued on June 21 asking the state government to address some welfare-related issues."
  },
  {
    "headline": "Surgery: Buhari wishes Osinbajo speedy, full recovery",
    "summarized_story": "By Johnbosco AgbakwuruPresident Muhammadu Buhari has sent a get well message to Vice President Yemi Osinbajo.\nPresident Buhari via a tweet by his Special Adviser on Media and Publicity, Chief Femi Adesina wished Professor Osinbajo a speedy and full recovery.\nAdesina in his verified twitter [email protected] wrote: “President Buhari sends best wishes to VP Yemi Osinbajo after the latter underwent a surgical procedure on his leg.\n” I wish him speedy and full recovery, the President says.”"
  },
  {
    "headline": "VP Osinbajo’s doctors say surgical procedure successful",
    "summarized_story": "Doctors who performed the surgical operation on Vice President Yemi Osinbajo, SAN, to treat the recurrent pain caused by a fracture in his leg have concluded the procedure and it was successful.\nAlso, the VP is alert and well.\nBelow is the statement released by the Duchess International Hospital, Lagos:“SUCCESSFUL MEDICAL TREATMENT OF THE VICE PRESIDENT“The Vice President of the Federal Republic of Nigeria, His Excellency, Professor Yemi Osinbajo, SAN, GCON, was admitted to the Duchess International Hospital GRA, Ikeja, Lagos, today on account of a fracture of his right femur (thigh bone), possibly related to a longstanding injury associated with a game of squash.\n“He had a surgical operation performed by a team of specialist doctors, including Dr. Wallace Ogufere (Consultant Orthopaedic Surgeon); Dr. Om Lahoti (Consultant Orthopaedic Surgeon); Dr. Babajide Lawson (Consultant Orthopaedic Surgeon); Dr. Ken Adegoke (Consultant in Anaesthesia & Critical Care); Dr. Oladimeji Agbabiaka (Consultant Anaesthetist); and Dr Adedoyin Dosunmu-Ogunbi (Consultant Physician & Medical Director).\n“The operation was successful, and he is expected to be discharged within the next few days."
  },
  {
    "headline": "[Video] Davido, Sen. Adeleke, Saraki, other PDP chieftains jubilate as results trickle in",
    "summarized_story": "Award-winning singer, David Adeleke, aka Davido alongside some bigwigs in the Peoples Democratic Party (PDP) have started jubilating results from the Osun governorship election trickle in.\nA video presently making the rounds on social media shows him hugging his uncle (Sen. Ademola Adeleke) who is the PDP’s governorship candidate.\nAmong the PDP chieftains include, former Senate President, Bukola Saraki; Bayelsa State Governor, Douye Diri; Edo State Governor, Godwin Obaseki among others.\nRecall Voting in Osun governorship election has ended.\nAccording to the Independent National Electoral Commission, INEC, results are expected from 3,763 polling units; 332 ward collation centres, 30 LG collation centres, and to be collated at a State Collation Centre where the final declaration of results will be made."
  },
  {
    "headline": "Don’t set Osun on fire, APC campaign council warns PDP",
    "summarized_story": "In a statement Senator Basiru, who noted that the claim by the PDP was capable of setting Osun on fire, warned the party to desist from making frivolous and unsubstantiated claim about an election.\nHe said: “It has come to our knowledge that the PDP in a statement is already claiming victory for an election whose result is yet to be declared.\n“Going by the result so far declared, there was no way PDP could lay claim to any victory.\nWe appeal to our supporters and sympathisers in Osun and across the country to remain calm in the face of this obvious provocation.\nThe party said: “We want to assert that Ademola Adeleke has won this election overwhelmingly going by results at our disposal."
  },
  {
    "headline": "Tinubu leaves Osun, meets APC speakers in Abuja",
    "summarized_story": "The presidential candidate of the All Progressives Congress (APC), Asiwaju Bola Tinubu has departed Osun State for Abuja, where he met with speakers of his party’s extraction.\nTinubu reportedly left Osun State amidst the collation of the results from the ongoing governorship election in the state.\nAt the meeting with the speakers, Tinubu promised the lawmakers active roles in his campaigns ahead of the 2023 general elections.\nTinubu commended the Speakers for the earlier roles they played ahead of his emergence as the presidential flag bearer of the party.\nThe APC Speakers had visited Tinubu to congratulate him on his victory at the party’s recent special convention where he was elected candidate."
  },
  {
    "headline": "Osun Decides 2022: Live results from Wards",
    "summarized_story": "Results are already currently coming in from Wards in the ongoing governorship election in Osun State.\nINEC officials have concluded announcing results in Polling Units and results are now in Wards Headquarters.\nFrom all indications, the Osun State governorship election was keenly contested between the candidate of the All Progressives Congress, APC, and the Peoples Democratic Party, PDP.\nWard 10, Abiri OguduRegistered voters – 3786Accredited voters – 1418A: 06AAC: 07ADP: 17APC: 945APM: 03APP: 04BP: 0LP: 0NNPP: 0NRM: 01PDP: 409PRP: 04SDP: 0YPP: 03ZLP: 01INEC Office, Ifetedo, Ife-South LGA.\nof Accredited Voters: 1798Total Votes Cast:1797"
  },
  {
    "headline": "Osinbajo undergoes surgery on Saturday",
    "summarized_story": "Vice president, Yemi Osinbajo, has undergone a surgical procedure on his leg.\nThis is due to a recurrent pain in the leg, which is believed to have been sustained from injury while playing squash.\n“VP Osinbajo is in the hospital today for a surgical procedure on account of a recurrent pain in the leg possibly sustained from an injury while playing squash.\nOsinbajo recently denied seeking President Muhammadu Buhari’s permission to dump the All Progressives Congress, APC, over the party’s Muslim-Muslim presidential ticket.\nHe insisted that the memorandum suggesting he asked Buhari for permission to leave APC was not from him."
  },
  {
    "headline": "Police arrest Tinubu convoy attackers in Lagos, identity sponsors",
    "summarized_story": "The police in Lagos have arrested eight members of cult groups over the attack on the convoy of ex-Lagos governor, Bola Tinubu.\n“We were paid to prevent those on the convoy from getting to the palace of the Oba of Lagos and to disperse them”, he revealed.\nThe suspects were arrested from their multiple hideouts on the Lagos Island by detectives attached to Zone 2 Command Headquarters, Onikan, Lagos.\nAssistant Inspector-General of Police, Zone 2 (Lagos and Ogun), Bode Adeleke announced their arrest.\n“They also belong to various cult fraternities."
  },
  {
    "headline": "DSS flouts court order, imposes strict measures on Nnamdi Kanu – IPOB cries out",
    "summarized_story": "The Indigenous People of Biafra, IPOB, on Saturday, accused the Department of State Services, DSS, of placing a strict measure on its leader, Nnamdi Kanu in detention.\nSpokesman of IPOB, Emma Powerful, said DSS has restricted Kanu’s time to receive visitors from two hours to 30 minutes.\nIn a statement he signed, Powerful accused DSS of flouting court orders that allowed Kanu to receive visitors for two hours.\n“The global community should take note of the atrocities being perpetrated against our leader Mazi Nnamdi Kanu by the Nigeria Government and their lawless DSS.\nThis flagrant abuse of Court Orders and dehumanization of our Leader is not acceptable and must be stopped going forward.”"
  },
  {
    "headline": "Osun: Victory is close, we’ll dance in the rain, don’t move – Davido to voters",
    "summarized_story": "Nigerian music star, David Adedeji Adeleke, has expressed optimism that his uncle, Ademola Adeleke of the Peoples Democratic Party, PDP, in the ongoing governorship election in Osun State, would win the race.\nDavido, in a series of tweets, urged voters to remain at the polling unit as counting continues despite heavy downpour.\nAccording to the singer, the stolen mandate of his uncle is being retrieved.\n“Retrieving the Stolen mandate with full force IMOLE Adeleke is coming”!\nDAILY POST recalls that Davido’s uncle, Adeleke had earlier expressed satisfaction in the ongoing exercise after casting his vote."
  },
  {
    "headline": "Revealed: How bandits plotted Kuje prison attack The Nation Newspaper",
    "summarized_story": "The terrorists had converged on a mountain in the area for about two weeks, perfecting their strategy for the attack, security sources said yesterday.\nIt was after the attack that it became clear that the bandits launched the attack from the Karishi Mountain.\n“Some group alleged that the Military withdrew soldiers from their duty post at Kuje to pave the way for the bandits to attack the prison.\nThe Director Defence Information, Major General Jimmy Akpor, said the security agencies would not leave anything to chance.\n“Of all the security agencies, none is sleeping,” he said."
  },
  {
    "headline": "‘Why Nigerians should back APC's presidential ticket’ The Nation Newspaper",
    "summarized_story": "A chieftain of the All Progressives Congress (APC) in Oyo State, Hakeem Alao, has appealed to Nigerians to look beyond religion in the presidential team of the party, saying the Muslim-Muslim ticket should not be seen as anti-Christian.\nAlao while featuring on a radio programme in Ibadan, the Oyo State capital, said in as much as religion matters in the lives of human beings including Nigerians, the time has come for the country to emphasis more on what would bring good governance and development to the country.\nHe maintained that with the country divided into North and South and the presidential candidate is from the South, the choice of vice presidential candidate as made from the North should be accepted in the interest of the country, stating that what should be paramount is the competence of the choice made.\nHe said, “I want to sincerely appeal to Nigerians to take the Muslim-Muslim presidential ticket of our great party, APC, in good faith and not an attempt of been anti-Christian.\nI believe we should focus on the competence of the two men to make Nigeria a country of our dream."
  },
  {
    "headline": "How Tinubu emerged APC presidential candidate, by Buhari The Nation Newspaper",
    "summarized_story": "President Muhammadu Buhari, said yesterday that the emergence of Asiwaju Bola Tinubu as the presidential candidate of the All Progressives Congress (APC) was a true reflection of the will of the members of the party.\nTinubu, the President said, emerged from a purely democratic process.\n“As leaders, we are doing our best, and will keep doing our best to improve the situation.\nThey only want to distract the APC presidential candidate and his running mate.\nThese schools had been taken over by previous administrations in Lagos before Tinubu became governor in 1999."
  },
  {
    "headline": "Osun 2022: INEC sets up room for central collation as results trickle in The Nation Newspaper",
    "summarized_story": "Osun 2022: INEC sets up room for central collation as results trickle inThe Independent National electoral commission (INEC) is currently setting up the central collation centre at the state headquarters for results to be announced.\nThe final collation of result is expected to take place at the State Collation Centre, INEC office situated in Osogbo.\nAs at time of report, The Nation observed different media outlets, journalists were setting up at the centre.\nSecurity operatives comprising police, Nigeria Security and Civil Defence Corps (NSCDC), Nigeria Army have been stationed strategically at both entrances leading to the commission’s office.\nStaff of INEC and agents of political parties are however still busy at various collation centres to get results across various units."
  },
  {
    "headline": "APC defeats PDP at Akande's polling unit The Nation Newspaper",
    "summarized_story": "The All Progressives Congress (APC) has floored the opposition Peoples’ Democratic Party (PDP) at polling unit 12, Ward 4, Isedo I, Ita Atewogbade, Ila-Orangun, where Chief Bisi Akande and his son, Oluwafemi Akande who is the Osun Attorney General and commissioner for Justice voted.\nAt the unit, the APC scored 140 votes to defeat the opposition party which got 117 votes.\nAt the adjacent polling unit 11, ward 4, in Ita Atewogbade, the PDP candidate, Senator Ademola Adeleke won with 75 votes to incumbent Governor Gboyega Oyetola’s (APC) 63.\nAt the nearby Ojude Abalagemo, the APC also triumphed with160 votes.\nIts closest rival, the PDP secured 116 votes at the unit."
  },
  {
    "headline": "ASUU strike: frustration, Anger as September new academic session approaches",
    "summarized_story": "In a phone interview with Sunday Sun, she said: “The ASUU strike does not portend good situation for this country.\nIt is not fair that parents paid school fees, some even paid house rents, and all those resources went into the drains because of ASUU strike,” she said.\nA four-year course is now becoming a seven-year course because of ASUU strike.\nHer words: “Inasmuch as I want a complete end to ASUU strike in Nigeria, I think ASUU’s demand in the agreement should be met.\nThe Federal Government should honour part of the agreement, while ASUU should as well call off the strike for students to resume immediately."
  },
  {
    "headline": "FG has no agreement yet with ASUU – Labour minister – The Sun Nigeria",
    "summarized_story": "The Federal Government has not yet reached any agreement with the Academic Staff Union of Universities (ASUU), contrary to claims by the union.\nThis clarification was made yesterday in a statement released by the Media Office of the Minister of Labour and Employment, Senator Chris Ngige.\nThe statement signed by the Minister’s media aide, Emmanuel Nzomiwu, also debunked the claim by ASUU that the minister was misinforming President Muhammadu Buhari on the ongoing strike.\nThey didn’t get the N220 billion in six years as contained in the agreement with the previous government.\n“The Trade Dispute Act says that if there is any complaint emanating from a Collective Bargaining Agreement (CBA), such should be domiciled in the Federal Ministry of Labour for seven days."
  },
  {
    "headline": "Buhari reveals how Tinubu emerged APC candidate",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammdu Buhari yesterday in Daura, Katsina State, said that the process that led to election of former Lagos State governor, Bola Tinubu, as the presidential candidate of the All Progressives Congress (APC) was purely democratic, and a reflection of the will of the party members.\nThey went and elected Asiwaju Bola Ahmed Tinubu, and he picked his running mate, Senator Kashim Ibrahim.\nSince then, we have been doing our best to tackle the challenges, with God helping us.\n“As leaders, we are doing our best, and will keep doing our best to improve the situation.\nWe are praying that God will give us the advantage of dealing with all those that trouble the country."
  },
  {
    "headline": "Osinbajo hospitalized, undergoes leg surgery in Lagos",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaVice President Yemi Osinbajo has undergone surgical procedure over recurrent pain sustained from an injury while playing squash, the presidency has said.\nHis doctors would give an update of the treatment later today.”In a related development, Medical Director, Duchess International Hospital, Ikeja, Dr Adedoyin Dosunmu-Ogunbi, has said that the procedure was successful.\nIn a statement by the doctor who performed the surgical operation on Osinbajo, to treat the recurrent pain caused by a fracture in his leg, said that the procedure has been concluded and was successful.\n“He had a surgical operation performed by a team of specialist doctors, including Dr. Wallace Ogufere (Consultant Orthopaedic Surgeon); Dr. Om Lahoti (Consultant Orthopaedic Surgeon); Dr. Babajide Lawson (Consultant Orthopaedic Surgeon); Dr. Ken Adegoke (Consultant in Anaesthesia & Critical Care); Dr. Oladimeji Agbabiaka (Consultant Anaesthetist); and Dr Adedoyin Dosunmu-Ogunbi (Consultant Physician & Medical Director).\n“The operation was successful, and he is expected to be discharged within the next few days.”"
  },
  {
    "headline": "2023 presidency: What God told me about Obi, Atiku –Primate Ayodele",
    "summarized_story": "In fact, Obi is going to get the backing of international community, but that won’t secure his victory at the poll.\n“Unless Nigerians shun money for votes in 2023, Nigeria will not get the right president because of the level of poverty.\nTinubu and Atiku cannot take Nigeria to a glorious land as revealed by the spirit of the Lord.”Primate Ayodele also said that neither Atiku nor Tinubu can restructure Nigeria.\n“Let’s rebuke the death of a one time Minister, Vice President, President, Assistant Inspector General of Police, Deputy Inspector General of Police and a Senator.\nLet us pray not to have issues as regards any of our oil storage facilities."
  },
  {
    "headline": "Live Updates: Osun Governorship Election 2022 – THISDAYLIVE",
    "summarized_story": "03:13pmVoting Ends, Collation in ProgressDeji Elumoye in OsogboThe 2023 governorship election in Osun State has ended in most of the 30 local government areas of the State.\nMiss Asogwa Ngozika, the Presiding Officer of the polling unit, said they arrived at the polling unit at 6:30 am.\nBut Olatunji said there was a mixed up in the materials brought to the polling unit as a sticker of another polling unit close to the primary school was pasted on the materials.\n“Your colleagues did it successfully in Ekiti and l believe you will also do us proud here in Osun State.\n“The people of Osun State and Nigerians will understandably hold us to our promise on election day."
  },
  {
    "headline": "INVESTMENT IN HEALTH IS INVESTMENT IN WEALTH – THISDAYLIVE",
    "summarized_story": "“In building wealth, wealth builders must take cognisance of the importance of their health.\nHence, in many cases, fatal health injuries occur due to wealth builders not undergoing regular medical checkups.”FAMILY HEALTH“Being mindful of wealth builders’ family health history is also important.\nIn that wise, wealth builders should find out and be fully aware of their family health histories for good health investment.\nTherefore wealth builders are encouraged to establish health insurance and health gym firms as viable opportunities for building wealth.\nHowever, since the emergence of good health insurance companies in Nigeria, I have stopped procuring foreign health insurance policies for some years."
  },
  {
    "headline": "Osun Decides: INEC Commences Uploading of Polling Unit Results to Portal – THISDAYLIVE",
    "summarized_story": "The Independent National Electoral Commission (INEC) has commenced uploading of results for Saturday’s governorship election in Osun State into the commission’s results viewing portal.\nThe News Agency of Nigeria (NAN) reported that the uploading of election results started shortly after the close of voting and sorting of votes in some polling units across the state.\nAs at 5.35 p.m. on Saturday, results from no fewer than 1,707 units out of the 3,763 polling units across the 30 local government areas in the state had been uploaded on the portal: https://www.inecelectionresults.ng/No fewer than 34 results out of 95 polling units in Isokan Local Government Area had been uploaded on the portal, while 65 out of 100 had also been uploaded for Obokun Local Government Area at the time of filling this report.\nFor Olorunda LG, 74 out of 193 polling units results have been uploaded on the portal as well 72 out of 121 for Odo-Otin Local Government Area.\nFor Iwo LGA, 48 out of 170 polling units results have been uploaded; for Irepodun 52 out of 133 have been uploaded, while 18 out of 62 polling units results for Ola-Oluwa LGA have also been uploaded."
  },
  {
    "headline": "Osinbajo Undergoes Successful Surgery – THISDAYLIVE",
    "summarized_story": "*To be discharged from Lagos hospital in daysDeji ElumoyeVice President Yemi Osinbajo Saturday went through a successful thigh surgical operation carried out by a team of specialist doctors at an Ikeja hospital in Lagos.\nThe media aide to the Vice President, Laolu Akande, in a release issued Saturday evening, disclosed that doctors who performed the surgical operation on Osinbajo to treat the recurrent pain caused by a fracture in his leg have concluded the procedure and it was successful.\nHe added that the Vice President, who is in good condition, alert and well, will be discharged from the hospital in a matter of days.\n“He had a surgical operation performed by a team of specialist doctors, including Dr. Wallace Ogufere (Consultant Orthopaedic Surgeon); Dr. Om Lahoti (Consultant Orthopaedic Surgeon); Dr. Babajide Lawson (Consultant Orthopaedic Surgeon); Dr. Ken Adegoke (Consultant in Anaesthesia & Critical Care); Dr. Oladimeji Agbabiaka (Consultant Anaesthetist); and Dr Adedoyin Dosunmu-Ogunbi (Consultant Physician & Medical Director).\n“The operation was successful, and he is expected to be discharged within the next few days”."
  },
  {
    "headline": "Breaking: Osinbajo in Hospital for Surgery – THISDAYLIVE",
    "summarized_story": "Vice President Yemi Osinbajo ìs in the hospital for a surgical procedure, his spokesman, Laolu Akande, has disclosed.\nIn a statement Saturday evening, Akande said the surgery was “on account of a recurrent pain in the leg possibly sustained from an injury while playing squash.”The vice presudent’s aide said his doctors would give an update of the treatment later on Saturday"
  },
  {
    "headline": "LIVE UPDATE: Osun State Governorship Election",
    "summarized_story": "LIVE UPDATE: Osun State Governorship ElectionDear readers, you're welcome to our coverage of the 2022 Osun State governorship election."
  },
  {
    "headline": "LIVE UPDATE: Osun State Governorship Election",
    "summarized_story": "LIVE UPDATE: Osun State Governorship ElectionDear readers, you're welcome to our coverage of the 2022 Osun State governorship election."
  },
  {
    "headline": "The curious case of northern Christians",
    "summarized_story": "Northern Christians saw Tinubu’s candidacy as a rare opportunity for one of them to be the vice-presidential candidate.\nWhy, then, are northern Christians not using their “majority” to vote Christians as governors if the pastor’s claim is the gospel truth?\nPray, what is wrong with northern Muslims voting for a northern Christian?\nIf Yoruba Muslims willingly vote for Yoruba Christians without frontloading religion, why shouldn’t northern Muslims also back northern Christians and put region above religion?\nIn short, the northern Nigeria of today is not the same northern Nigeria of the 50s, 60s and 70s."
  },
  {
    "headline": "The curious case of northern Christians",
    "summarized_story": "Northern Christians saw Tinubu’s candidacy as a rare opportunity for one of them to be the vice-presidential candidate.\nWhy, then, are northern Christians not using their “majority” to vote Christians as governors if the pastor’s claim is the gospel truth?\nPray, what is wrong with northern Muslims voting for a northern Christian?\nIf Yoruba Muslims willingly vote for Yoruba Christians without frontloading religion, why shouldn’t northern Muslims also back northern Christians and put region above religion?\nIn short, the northern Nigeria of today is not the same northern Nigeria of the 50s, 60s and 70s."
  },
  {
    "headline": "Adeleke takes early lead in Osun guber, wins more LGAs than Oyetola",
    "summarized_story": "Ademola Adeleke, the candidate of the Peoples Democratic Party (PDP) in the Osun governorship election, has taken an early lead.\nTo win Olorunda LGA, Adeleke polled 21, 350 votes while Oyetola was able to secure 18,709 votes.\nOdo Otin LGA also went the way of the PDP as Adeleke got 14,003 votes while Oyetola picked up 13,482.\nAdvertisementTo win Ifelodun LGA, the PDP candidate picked up 17,107 votes while Oyetola placed second with 16,068 votes.\nAdvertisementIn Boripe LGA, Oyetola also emerged victorious, polling 21,205 votes to defeat the PDP candidate who had 7595."
  },
  {
    "headline": "Adeleke takes early lead in Osun guber, wins more LGAs than Oyetola",
    "summarized_story": "Ademola Adeleke, the candidate of the Peoples Democratic Party (PDP) in the Osun governorship election, has taken an early lead.\nTo win Olorunda LGA, Adeleke polled 21, 350 votes while Oyetola was able to secure 18,709 votes.\nOdo Otin LGA also went the way of the PDP as Adeleke got 14,003 votes while Oyetola picked up 13,482.\nAdvertisementTo win Ifelodun LGA, the PDP candidate picked up 17,107 votes while Oyetola placed second with 16,068 votes.\nAdvertisementIn Boripe LGA, Oyetola also emerged victorious, polling 21,205 votes to defeat the PDP candidate who had 7595."
  },
  {
    "headline": "Buhari: Nigerians will be grateful to God if they know what other countries are facing",
    "summarized_story": "President Muhammadu Buhari says Nigerians should be grateful to God, despite the country’s current challenges.\nSince then, we have been doing our best to tackle the challenges, with God helping us.\nIf only we knew what other countries in Africa are passing through, we will be grateful to God, and protect our country.\n“As leaders, we are doing our best, and will keep doing our best to improve the situation.\n“We are praying that God will give us the advantage of dealing with all those that trouble the country."
  },
  {
    "headline": "The leading African tech moves from June 2022",
    "summarized_story": "From MTN’s $53.4 mobile money fraud lawsuit and Kune’s shutdown in Kenya, to big acquisitions across North Africa, here are the top 10 biggest tech moves from June.\nThis means that in the first half of 2022 (H1 2022), African startups raised a whopping $2,787,523,000, a 134.25% increase from the $1.19 billion raised in H1 2021.\nFintech startups raised $305,430,000.\n(71.7%), energytech startups raised $35,700,000 (8.4%), and mobility/logistics startups raised $32,700,000 (7.7%).\nNigeria may have lower mobile money usage compared to Kenya, Uganda or even Ghana, but that may soon change."
  },
  {
    "headline": "Flutterwave, Eversend and other fintech African startups shut down virtual card service",
    "summarized_story": "Earlier on Friday, many African fintech startups offering virtual dollar card services sent emails to their customers stating that their virtual card service will be unavailable indefinitely starting Saturday, July 16, 2022.\nThis announcement by Flutterwave is bound to affect many other startups who use the company’s white-labeled virtual card service to issue virtual cards to their customers.\nOther fintech startups including crypto exchange Busha, Rwanda-headquartered Payday, and Ugandan Eversend also issued similar notices.\nIt’s not clear which “card partner” Flutterwave and the other fintech startups are referring to, but these platforms have issued virtual cards powered by MasterCard and Visa—two leading global card issuers.\n“It affects us in a big way because all our Facebook ads are connected to our Barter virtual card,” Douglas Kenydson CEO Selar said."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "Meet Burna Boy's monitor engineer, Precious Tawo as he takes us on his journey into sound engineering",
    "summarized_story": "Without further ado, let’s meet Precious Tawo, freelance sound engineer and production manager.\nOn the 20th day [of the Calabar festival], we were doing a sound check in the stadium for the band, and my boss was not on the stage.\nPrecious Tawo’s journey into sound engineeringPrecious TawoI didn’t choose the path; the path chose me.\nAnd in 2013, the Calabar Festival was very popular.\nWe tried everything and eventually had to plug my monitors into my boss’ equipment."
  },
  {
    "headline": "2023: Shaibu charges Nigerians to vote for credible, competent leaders – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Acting Governor, Rt.\nComrade Philip Shaibu, has urged Nigerians to ensure that only credible and competent leaders emerge in the forthcoming 2023 general elections.\nShaibu gave the charge during the 17th convocation ceremony of Benson Idahosa University (BIU), in Benin City, Edo State.\nThe acting governor, who was a special guest of honour at the convocation ceremony, urged citizens to pray for the country, noting that only competent leaders can help the nation overcome its many socio-economic challenges.\n“Governor Godwin Obaseki is doing his best to turn Edo State into the economic hub of the nation."
  },
  {
    "headline": "No report of mass violence, vote-buying in Osun guber poll -Police – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBy Kelecho Ogunleye The police say they have yet to receive reports of violence or vote-buying in Saturday’s Osun governorship election.\nMr Johnson Kokumo, the Deputy Inspector-General of Police (DIG) Force Criminal Investigation Department (FCID) said this after a visit to ward 5, unit 5 Salvation Army alekuwodo polling unit in Osogbo.\nThe News Agency of Nigeria (NAN) reports that the police deployed 21,000 personnel to ensure hitch-free conduct of the election.\nHe said that the NSCDC personnel were positioned to observe polling units and make arrests of suspected vote-buyers or persons with intentions to disrupt the election.\nHe expressed satisfaction with the large voter turnout at polling units."
  },
  {
    "headline": "Anti-corruption: Centre unveils whistleblowing platform for citizens’ action – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestAnti-corruption stakeholders at the Launch of the Corruption Anonymous (CORA) whistleblowing platform in AbujaBy Angela AtaboAfrican Centre for Media and Information Literacy (AFRICMIL),with support from other partners on Thursday in Abuja, unveiled a whistleblowing platform to increase citizens’ participation in anti-corruption fight.\nThe coordinator observed that the whistleblowing policy, initially hailed as one of the most effective of all the anti-corruption strategies by the government, was virtually fizzling out.\n“It is against this backdrop that the CORA whistleblowing platform, the civil-society-driven public reporting option that we are launching today, serves as an invaluable tool.\nOnumah said that the CORA platform would complement government’s whistleblowing platform managed by the Presidential Initiative on Continuous Audit (PICA).\n“Legally and morally, we all have roles to play, and this is what the whistleblowing policy seeks to ensure,’’ he said."
  },
  {
    "headline": "Institutionalising apprenticeship panacea for tackling poverty, unemployment— ITF boss – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Director-General of the Industrial Training Fund (ITF), Mr Joseph Ari says institutionalising apprenticeship and traineeship will address the high rate of poverty and unemployment.\nAri said this on Thursday in Abuja at the Second National Skills programme with the theme, “Institutionalising Apprecenticiship and Traineeship for National Development”.\n“England in 2009 made concerted efforts to increase the number of apprenticeships to combat youth unemployment by creating National Apprenticeship Service.\nHe, however, expressed concern that the potential of apprenticeship in tackling unemployment and poverty had not been fully actualised in Nigeria.\n“In addition, it harmonised 444 existing In-company apprenticeship schemes of companies in line with the ITF National Apprenticeship scheme."
  },
  {
    "headline": "#OsunDecides: Adeleke takes early lead over Oyetola as counting continues",
    "summarized_story": "Ademola Adeleke, the governorship candidate of the Peoples Democratic Party (PDP), is taking an early lead in the ongoing Osun gubernatorial election.\nAccording to results posted on the portal of the Independent National Electoral Commission (INEC), Adeleke is leading the incumbent governor, Gboyega Oyetola of the All Progressives Congress (APC), with over 10,000 votes.\nSo far, Adeleke has polled 67,892 votes while Oyetola has 56,915 votes.\nCounting is still ongoing.\nThere are a total of 1,955,657 registered voters in the election which held across 3,763 polling units."
  },
  {
    "headline": "Osinbajo undergoes surgery over recurring leg pain",
    "summarized_story": "Professor Yemi Osinbajo, Nigeria’s vice president of, has undergone a surgical procedure on his leg.\nThe procedure is due to a recurrent pain in the leg, which is believed to have been sustained from injury while playing squash.\nOsinbajo’s spokesman, Laolu Akande, confirmed this in a statement on Saturday.\n“VP Osinbajo is in the hospital today for a surgical procedure on account of a recurrent pain in the leg possibly sustained from an injury while playing squash,” the statement said.\n“His doctors would give an update of the treatment later today."
  },
  {
    "headline": "Successful event planning not for the faint hearted – Omolaraeni Olaosebikan-CEO McEnies Global Events",
    "summarized_story": "From an objective prism, the highly competitive event planning and management business in Nigeria somewhat looks impossible for anyone to stand out from the crowd.\nBut this is certainly not the situation for Omolaraeni Olaosebikan, the Group Chief Executive Officer of McEnies Global Communications.\nOmolaraeni who is an event planning consultant and PR expert for nearly two decades has truly carved a niche for her business in Nigeria’s event industry.\n“The event planning business is probably not for the faint of heart.\n“The second category is McEnies Global Events, it involves Event Planning and Management, Destination event, Hall scouting and negotiation, event consultancy, event productions, security and corporate pickup."
  },
  {
    "headline": "Osun Poll: YIAGA Africa accuses APC, PDP of vote buying",
    "summarized_story": "Addressing the press on the group’s mid-day situational reports on Saturday, Hussain Abdu, the group’s board chairman, alleged that some party agents induced voters with as low as N2,000.\nOlomu Mosque in Osogbo, PDP party agents were allegedly seen handing out between N2000 and N5000 to induce voters.\nHowever, Mr Abdu commended the Independent National Electoral Commission (INEC) for the early arrival of polling officials and materials at polling units.\n“As of 7:30 a.m., Yiaga Africa WTV observers reported that INEC officials had arrived at 78 per cent of polling units.\n“By 8:30 a.m., 41 per cent of polling units had commenced accreditation and voting and by 9:00 a.m. 89 per cent of polling units had commenced accreditation and voting."
  },
  {
    "headline": "UBA Group expands to EMEA, launches banking operations in DIFC, Dubai",
    "summarized_story": "The United Bank for Africa (UBA), Africa’s global bank has been in operation for over seven decades.\nToday, the group is present in 20 African countries, the United Kingdom, the United States of America and France.\nThe bank has extended its operations to the United Arab Emirates with the official launch of its new branch at the Dubai International Financial Centre (DIFC).\nLeveraging the presence of UBA Group in global financial centres, UBA (DFIC) will enhance the ability of the group to facilitate access of Gulf investors and banks to African markets.\nDIFC will continue to seek partnerships that will deliver winning relationships as we have just witnessed with UBA Group."
  },
  {
    "headline": "BREAKING: VP Osinbajo Hospitalised, To Undergo Surgery",
    "summarized_story": "Vice President Yemi Osinbajo has been hospitalised on Saturday, according to his media aide, Laolu Akande.\nOsinbajo’s hospitalisation is coming shortly after celebrating his wife, Mrs Dolapo Osinbajo, who turned 55 on Saturday.\nAkande, who took to his verified Twitter handle Saturday evening, said Osinbajo will undergo a surgical correction on his leg over a recurrent pain possibly sustained from sporting activities by the vice president.\nHe wrote: “VP Osinbajo is in the hospital today for a surgical procedure on account of a recurrent pain in the leg possibly sustained from an injury while playing squash.\n“His doctors would give an update of the treatment later today.”"
  },
  {
    "headline": "BREAKING: VP Osinbajo Hospitalised, To Undergo Surgery",
    "summarized_story": "Vice President Yemi Osinbajo has been hospitalised on Saturday, according to his media aide, Laolu Akande.\nOsinbajo’s hospitalisation is coming shortly after celebrating his wife, Mrs Dolapo Osinbajo, who turned 55 on Saturday.\nAkande, who took to his verified Twitter handle Saturday evening, said Osinbajo will undergo a surgical correction on his leg over a recurrent pain possibly sustained from sporting activities by the vice president.\nHe wrote: “VP Osinbajo is in the hospital today for a surgical procedure on account of a recurrent pain in the leg possibly sustained from an injury while playing squash.\n“His doctors would give an update of the treatment later today.”"
  },
  {
    "headline": "How Tinubu Emerged Our Flagbearer In APC – Buhari",
    "summarized_story": "President Muhammdu Buhari Saturday in Daura, Katsina State, said the process that led to election of former Lagos State governor, Asiwaju Bola Ahmed Tinubu, as the presidential candidate of the All Progressives Congress (APC) was purely democratic, and a reflection of the will of party members.\nSince then, we have been doing our best to tackle the challenges, with God helping us.\n“As leaders, we are doing our best, and will keep doing our best to improve the situation.\n“I have heard all that the governor and emir have to say on what people expect from government.\nPresident Buhari returned appreciation to God that the seasons had been favorable for farming and food production."
  },
  {
    "headline": "How Tinubu Emerged Our Flagbearer In APC – Buhari",
    "summarized_story": "President Muhammdu Buhari Saturday in Daura, Katsina State, said the process that led to election of former Lagos State governor, Asiwaju Bola Ahmed Tinubu, as the presidential candidate of the All Progressives Congress (APC) was purely democratic, and a reflection of the will of party members.\nSince then, we have been doing our best to tackle the challenges, with God helping us.\n“As leaders, we are doing our best, and will keep doing our best to improve the situation.\n“I have heard all that the governor and emir have to say on what people expect from government.\nPresident Buhari returned appreciation to God that the seasons had been favorable for farming and food production."
  },
  {
    "headline": "Osun Gov’ship: Gov Oyetola Wins Polling Unit With 545 Votes",
    "summarized_story": "The candidate of the All Progressives Congress (APC) in the governorship election and incumbent Osun State governor, Gboyega Oyetola, has won his polling unit.\nMeanwhile, the pioneer interim national chairman of the APC, Chief Bisi Akande, won his polling unit for the ruling party.\nIn Akande’s polling unit in ward 04, Isedo, Ila-Orangun LGA, the PDP polled 117 while APC scored 140 votes.\nThe APC also secured victory in the polling unit of the Minister of Interior and estranged political godfather of Governor Oyetola, Ogbeni Rauf Aregbesola.\nAPC’s Oyetola polled 164 votes in the polling unit situated in Isare Ward 8, Ilesha East, to defeat PDP’s Adeleke who secured 134 votes."
  },
  {
    "headline": "JUST IN: Buhari speaks on Osinbajo's successful leg surgery",
    "summarized_story": "President Muhammadu Buhari has wished Vice President ‘Yemi Osinbajo speedy and full recovery, after the latter went through a surgical procedure Saturday.\nOsinbajo fractured his leg while playing squash on Saturday and had to treat recurrent pain caused by a fracture in his leg.\nThe President, in a statement, issued by his spokesman, Femi Adesina, gave glory to God for a successful surgery.\nHe prayed for “speedy and full recovery,” commending the medical team at the Duchess International Hospital, Ikeja, Lagos, for “their competence, and a job well done.”Buhari assured Osinbajo of the prayers of Nigerians, and that of his family."
  },
  {
    "headline": "Ukrainian cargo plane crashes with eight on board",
    "summarized_story": "A cargo plane with eight people on board crashed near the city of Kavala in northern Greece late on Saturday, the fire brigade and state TV said.\nState TV ERT reported that the aircraft was an Antonov An-12 owned by a Ukrainian company, which was flying from Serbia to Jordan.\nThe fire brigade could not confirm the type of aircraft but said there were initial reports that eight people were on board.\nIt was not clear what the aircraft’s cargo was but the special disaster response unit was also investigating the scene.\n“We are treating the cargo as dangerous material,” said a fire brigade official."
  },
  {
    "headline": "JUST IN: Adeleke Clears Osogbo, Takes Early Lead In #OsunDecides2022",
    "summarized_story": "Out of the 54,997 votes cast in the Osogbo LGA, Mr. Adeleke received 30,401 votes, while Mr. Oyetola received 22,952 votes for the governing All Progressives Congress.\nIn Osogbo LGA, 55,942 votes were cast in total during the election on Saturday.\nMr Oyetola also cleared his polling unit in Iragbiji, Boripe LGA, shellacking Mr Adeleke there.\nWhile in PU 003, opposite Olomu Mosque in Osogbo, PDP agents were seen handing out between N2,000 and N5,000 to induce voters.\nEarly results from Ede, Osogbo and other parts of the state show Mr Adeleke leading, although most results are still being expected."
  },
  {
    "headline": "#OsunPoll: Tinubu Departs Osun State As INEC Begins Uploading Election Results",
    "summarized_story": "The presidential candidate of the ruling All Progressives Congress, Bola Tinubu, has left Osun State where a governorship election is holding.\nMeanwhile, the Independent National Electoral Commission, INEC, has commenced uploading of results for the Saturday governorship election into the commission’s results viewing portal.\nThe News Agency of Nigeria reports that the uploading of election results started shortly after the close of voting and sorting of votes in some polling units across the state.\nFor Olorunda LG, 74 out of 193 polling units results have been uploaded on the portal as well 72 out of 121 for Odo-Otin Local Government Area.\nFor Iwo LGA, 48 out of 170 polling units results have been uploaded, for Irepodun 52 out of 133, while 18 out of 62 polling units results for Ola-Oluwa LGA have also been uploaded."
  },
  {
    "headline": "JUST IN: Tinubu Leaves Osun, Meets APC Speakers In Abuja",
    "summarized_story": "According to information obtained by NEWS DIRECT, the APC National Leader met with the party’s House of Assembly Speakers on Saturday in Abuja.\nTinubu offered the speakers active positions in his campaigns leading up to the next election in 2023 during the conference.\nTinubu commended the Speakers for the earlier roles they played ahead of his emergence as the presidential candidate of the party.\nThe APC Speakers had visited Tinubu to congratulate him on his victory at the party’s recent special convention where he was elected candidate.\nWhile appreciating the Speakers, Tinubu, who noted the tasks ahead of 2023, assured them of roles to play in the campaign."
  },
  {
    "headline": "Osun Guber: Group raises alarm over partisanship of NSCDC personnel",
    "summarized_story": "A socio-political group, Osun Shall Rise Again, OSRA, has raised the alarm over the partisanship of the officials and men of the Nigeria Security and Civil Defence Corps, NSCDC in the ongoing Osun Governorship election.\n“It will be recalled that this is not the first time citizens of Osun would be complaining of the unprofessional conduct of the officials and men of the NSCDC in its handling of security issues in the State.\n“While we call for a proper investigation of the highly condemnable act, the National Headquarters of the National Security and Civil Defence Corps must sanction all its officers involved in this open show of partisanship.\n“We are aware of the Interior Minister’s preference in this election, he should however do that without endangering the peace of our dear State.\nHe should also desist from using state apparatus to settle political scores.”"
  },
  {
    "headline": "[Breaking] #OsunDecides2022: PDP’s Adeleke defeats incumbent governor Oyetola inside government house",
    "summarized_story": "Counting of votes has continued after Saturday’s governorship elections in Osun with results oozing out from polling units after voting officially endedAt a polling unit located around government in Osogbo, the candidate of Peoples Democratic Party (PDP) defeated the incumbent Governor of the State, Adegboyega Oyetola of the All Progressives Congress (APC)In the governorship election score sheet for Agowande/Oshogbo GRA/ Governor’s office polling unit in Olorunda Local Government prepared by Assistant Polling Officer (APO1), Nwachukwu Henrietta Chidinma, PDP scored 117 votes while APC got 106 votes.\nCollation of results polling units and wards levels are still ongoing as at the time of filling this report.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "#OsunDecides2022: Nonagenarian defies odds, votes in Osun",
    "summarized_story": "A nonagenarian, Mustapha Olatunji, has casted his vote at the Boripe LG, Ward 1, Unit 002 in the Osun governorship election.\nThe 90-year-old Olatunji revealed that he had been voting since the days of the former Premier of Western Region, Obafemi Awolowo.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "#OsunDecides2022: Free Akara at Aregbesola’s home (PICTURE)",
    "summarized_story": "Free beans cake (akara) is being offered at the home of the Minister of Interior, Rauf Aregbesola, in Ifofin area in Ilesha, Osun state.\nHe is expected to vote in the Osun State governorship election at his house there but has yet to show up.\nShare this:TweetPrintEmailWhatsApp"
  },
  {
    "headline": "Rivers: Nirvana, Access Bank Donate Cartons of Food Items to Sickle Cell Disease Persons",
    "summarized_story": "A non governmental organisation, Nirvana Initiative and Hacey Health Initiative in partnership with Access Bank has lifted the lives of people living with sickle cell disease by donating cartons of food items to them and their relatives in Rivers State.\nNirvana Initiative through Sickle Cell Awareness and Health Foundation, held the sensitisation and food donation event at the University of Port Harcourt Teaching Hospital (UPTH) where many with sickle cell trait and their parents disclosed their challenges.\nA facilitator at the programme, Dabata Omubo-Pepple, Executive Director of Sickle Cell Awareness and Health Foundation, explained that the gesture by the NGO to reach out to people living with the disease was in commemoration the world sickle cell day, earlier celebrated in June.\nA way of reaching out with people living with sickle cell disease with a welfare package which has to do with food, reminding them that food is important in their day to day and also to support them”.\nMy parent realized that I am a sickler when I was about a year old and my mum was already pregnant with my little sister who also had sickle cell”."
  },
  {
    "headline": "X-raying reforms in SEC and uncanny zeal for investment space",
    "summarized_story": "Also, the Yuguda-led executive management team has been implementing capital market development goals set out in the Capital Market Master Plan (CMMP) (2015-2025) and successfully completed the review of CMMP to realign the initiatives/deliverables to prevailing market conditions and keep the document relevant in the dynamic capital market due to issues related to Fintech, sustainability and regional integration.\nThis is even as it processed six Schemes of Merger, seven Acquisitions, 21 Corporate Restructurings, and three Takeovers during the period.\nUnder his leadership, rules for the integrated West African Capital Market were developed and reviewed.\nOn human capital development, the Commission had in 2019 conducted an internal capacity assessment that outlined staffing deficits and needs.\nThe Commission has also secured counterpart funding of $450,000 from AfDB on its Nigeria Securities Market Surveillance System Project to support the deployment of a real-time market surveillance system for the Nigerian capital market."
  },
  {
    "headline": "TAJBank opens new branch to deepen financial inclusion",
    "summarized_story": "…as excited traders jostle to open accountBY Kehinde IbrahimTAJBank Ltd, a leading non-interest hank, has continued its service and financial inclusion drive with the opening of a new, technology-powered branch in Wuse 2, Abuja.\nThe opening of the new branch brings the lender’s growing branch network to 22 within its first two years of operation.\nJoda explained: “The opening of the new branch is to continue with our strategy of ensuring that we take the TAJBank brand to all the nooks and crannies of the Country with the aim of addressing the service needs of our teeming customers.\n“We understand that Customers want to do business and sometimes someone to give them that advisory service they yearn for which in turn will help to address their financial challenges”, he added.\nThe non-interest bank is also set to launch Nigeria’s first private sector Sukuk offering under a N100 billion programme."
  },
  {
    "headline": "NES28 to rally stakeholders for sustainable economic growth",
    "summarized_story": "While welcoming participants to the event, the chairman of the NESG, Mr Asue Ighodalo, said that the annual Nigerian Economic Summits had been sustained as a public-private dialogue platform by the NESG (representing the private sector) and the Federal Ministry of Finance, Budget and National Planning (representing the Federal Government of Nigeria).\nHe noted that the Summit is a foremost platform through which the federal and state governments engage with corporate leaders and discuss Nigeria’s national and sub-national economic realities to co-create reform strategies that are critical for the advancement and reform of the Nigerian economy.\nMr Ighodalo stated that the vision of a secure, developed, prosperous and macro-economically stable country where the rule of law prevails and no one is left oppressed appears dimmed with today’s considerable headwinds, but the current electoral cycle offers a unique opportunity to reflect and reset.\nHe noted that the challenge of non-inclusive economic growth reflects low productivity across employment-elastic sectors, which continues to weaken their capacity to create more job opportunities and decent employment.\n“Government has a pivotal role in jump-starting and addressing with utmost urgency six critical challenges including non-inclusive economic growth, macroeconomic instability, infrastructure deficit, human capital deficit and skills gap, national insecurity and weak economic competitiveness,” he stated."
  },
  {
    "headline": "Danger as Naira hits N620/$ at parallel market",
    "summarized_story": "Naira yesterday fell to N620 per dollar at the parallel market amid the lingering scarcity of the greenback.\nCurrency traders known as Bureaux De Change operators (BDCs) said there was increased demand for the dollar by importers at the street market.\nThe traders put the buying price of the dollar at N614 and the selling price at N620, leaving a profit margin of N6.\nAccording to the Central Bank of Nigeria (CBN), the parallel market is not a true reflection of the country’s exchange rate.\nOn Tuesday, the euro fell to parity against the dollar for the first time in almost 20 years."
  },
  {
    "headline": "LIVE UPDATE: Official Announcement Of Osun Governorship Election Results",
    "summarized_story": "﻿Welcome to our result update page for the Osun State governorship election.\nWelcome to our live page for the Osun State governorship election.\nOsun State Governorship Election 2022.\nHe says Nigeria is in trouble if vote-buying mars the Osun governorship election.\nQuick stories for catch upPolice In Show Of Force Ahead Of Osun Governorship ElectionPersonnel of the Nigeria Police on Friday held a show of force exercise ahead of the Osun State governorship election."
  },
  {
    "headline": "Osinbajo Undergoes Successful Surgery For Fracture",
    "summarized_story": "Doctors who performed the surgical operation on the Vice President, Professor Yemi Osinbajo, to treat the recurrent pain caused by a fracture in his leg have concluded the procedure, and it was successful.\nThe Vice President’s spokesman, Laolu Akande, confirmed this in a statement on Saturday following an earlier announcement that Professor Osinbajo was scheduled to undergo a surgical procedure.\nAccording to him, the Vice President is alert and well after the procedure at the Duchess International Hospital in Lagos.\n“He had a surgical operation performed by a team of specialist doctors, including Dr Wallace Ogufere (Consultant Orthopaedic Surgeon), Dr Om Lahoti (Consultant Orthopaedic Surgeon), Dr Babajide Lawson (Consultant Orthopaedic Surgeon), Dr Ken Adegoke (Consultant in Anaesthesia & Critical Care), Dr Oladimeji Agbabiaka (Consultant Anaesthetist), and Dr Adedoyin Dosunmu-Ogunbi (Consultant Physician & Medical Director).\n“The operation was successful, and he is expected to be discharged within the next few days.”Professor Osinbajo had also announced that he would undergo a surgical procedure via his verified Twitter account."
  },
  {
    "headline": "Osun Election: Adeleke, Oyetola Win Polling Units",
    "summarized_story": "The two leading candidates in the Osun State governorship election, Senator Ademola Adeleke and Governor Adegboyega Oyetola, have won their respective polling units.\nHe had arrived at his polling unit in Abogunde/Sagba at about 8:46am and was accredited shortly after before he proceeded to cast his ballot.\nAt the end of voting at the PDP candidate’s polling unit, the electoral officials deployed to conduct the exercise sorted and counted the ballot cast.\nAs usual, the electoral officials deployed to conduct the exercise at the polling unit sorted and counted the ballots cast at the end of voting.\nThe other nine governorship candidates scored zero votes at the polling unit."
  },
  {
    "headline": "Top Photos From Osun Governorship Election",
    "summarized_story": "Thousands of residents went to the polling units on Saturday to cast their votes in the ongoing Osun State governorship election.\nThe Independent National Electoral Commission (INEC) is conducting the exercise in 3,763 polling units across the 332 registration areas in 30 local government areas of the state.\nChannels Television is monitoring the election in various parts of the state as the poll is said to be peaceful so far.\nBelow are more photos from some of the polling units visited…"
  },
  {
    "headline": "Gunmen Abduct NDDC Official In Imo, Demand N10m Ransom",
    "summarized_story": "Gunmen suspected to be kidnappers have abducted an official of the Niger Delta Development Commission (NDDC) in Imo State, Channels Television has learned.\nThe victim, Kingsley Okorafor, was abducted from his residence at Umuadara Umulogho Autonomous community in Obowo Local Government Area of the state.\nSources in the area explained that the incident which happened in the early hours of Saturday caused panic within the community.\nThey added that the NDDC official was trailed from a burial which he attended and, on his way back to his house, he was abducted while his car was left behind.\nAccording to him, the assailants demanded a sum of N10 million as ransom before their victim would be released from captivity."
  },
  {
    "headline": "Osun Governorship Election will be credible, INEC pledges -",
    "summarized_story": "The Independent National Electoral Commission, INEC, has expressed readiness for the Osun Governorship Election, even as it has strongly cautioned against vote buying.\nINEC Chairman, Professor Mahmood Yakubu, assured the Osun electorate of inclusivity, credibility, and security.\nAdvertisementAdvertisementAdvertisementAdvertisement"
  },
  {
    "headline": "40 lawmakers recognised for exceptional legislative work",
    "summarized_story": "Forty out of the four hundred and sixty nine federal legislators have been recognised for their exceptional legislative work in the first two years of the life of the ninth National Assembly.Less than half of this figure will make it to the induction stage into the Hall of Fame as Most Valuable Parliamentarians by the time the Assembly winds down.\nNational Assembly Correspondent, Joke Adisa, reports thatthe awards come in different categories.\nFrom Bill Productivity Index, Performer on Bills Sponsorship per geographical zone, to Impact of Bills Index among many more.\nAdvertisementAdvertisementSenators Oluremi Tinubu and Solomon Adeola, both from Lagos state, as well as Abia Rep, Benjamin Kalu, Oluwole Oke from Osun and the Deputy Chief Whip of the House, Nkeruika Onyejiocha, lead the pack of Awardees.\nThe organiser said the move is to encourage hardwork while putting the legislators on their toesAdvertisementAdvertisementAdvertisementTo some of the awardees, the recognition, which is the first of the four phases into the induction proper, is tonic for more workAdvertisement"
  },
  {
    "headline": "INEC extends Continuous Voter Registration exercise till July 31st -",
    "summarized_story": "The Independent National Electoral Commission has again extended the continuous voter registration exercise to now end on 31th of July, 2022.\nAdvertisementAdvertisementThe electoral umpire said the exercise has also been extended to eight hours daily — from 9am to 5pm — instead of the current duration of six hours daily.\nAccording to the INEC commissioner for information and voter education, Festus Okoye, the exercise will now include weekends as against only weekdays.\nAdvertisementAdvertisementAdvertisementINEC had earlier fixed June 30 as the deadline for the ongoing CVR ahead of the 2023 elections— but the commission later extended the exercise by two weeks.\nThe electoral umpire is now asking Nigerians to take advantage of the new two-week extension to register for their permanent voter cardsAdvertisementAdvertisement"
  },
  {
    "headline": "Akeredolu donates 50 fitted Patrol Vehicles to security agencies -",
    "summarized_story": "Ondo State Governor, Oluwarotimi Akeredolu, has donated 50 fitted Patrol Vehicles to all the Security Agencies as part of the commitment of his administration to further strengthen the security of lives and property of the people in the State.\nGovernor Akeredolu handed-over the fitted Patrol Vehicles to heads of the Security Agencies in the State including the Nigerian Army; Nigeria Police; Nigeria Security and Civil Defence Corps; Department of State Services and the Amotekun Corps.\nAdvertisementAdvertisementThe Governor noted that the commissioning and handing over of additional 50 Vehicles was a further demonstration of the commitment of his administration towards providing the needed support for all security agencies operating in the State.\n“One of my promises then to the people of Ondo State was to do everything humanly possible to strengthen the capacity of our security agencies to be able to anticipate, prevent and combat a recurrence of such man’s inhumanity to mankind.\nAdvertisementAdvertisementAdvertisement\\“Today, it gives me great delight to commission and hand over additional security equipment particularly fitted Patrol Vehicles, to security agencies operating in the State towards boosting the capacity of our men in the line of duty of crime fighting so that our people can go about their businesses and livelihood without fear of molestation or attack."
  }
]