[
  {
    "headline": "APC should be ashamed of damage done to Nigeria, says Dele Momodu",
    "summarized_story": "A presidential hopeful, Dele Momodu, has said members of the ruling All Progressives Congress should be ashamed of the damage they have done to the country.\nHe said this in a statement issued on Tuesday, titled ‘Dele Momodu Asks APC To Apologise To Nigerians.’The statement read in part, “Nigeria is at crossroads and things can no longer continue as business as usual.\nNigeria deserves massive apologies from the APC apparatchiks who should be ashamed of the magnitude of damage they have wreaked on our long-suffering nation.\n“Becoming President of Nigeria should not be about the promotion and elevation of self as a result of previous lengthy political appointments.\n“What Nigeria needs is a fresh leader, someone shorn of all the baggage, misadventure, mishaps and failures of the past."
  },
  {
    "headline": "Suspended Kano anti-graft boss alleges threat to life",
    "summarized_story": "The suspended Chairman of Kano State Public Complaints and Anti-corruption Commission, Barr.\nMuhuyi Rimingado, has alerted Nigerians to alleged threats to his life and that of his family members.\nThis is as he also sought protection against what he described as “unwarranted persecution and harassment” of his person, family, and associates by the Nigerian Police Force in concert with the Kano State Government.\nThe 23-paged document, including evidential annexures, is entitled: “Complaint against the incessant politically motivated persecutions by the Kano State Police Commissioner at the instigation of Kano State Government to me, my immediate family and associates”.\nSimilarly, a notice of appeal from the Court of Appeal has been served on the police."
  },
  {
    "headline": "FG approves 3 new polytechnics",
    "summarized_story": "By Joseph ErunkeABUJA–THE federal government has approved establishment of three new polytechnics in the country.\nA statement from the Federal Ministry of Education, Wednesday,signed by its Director of Information,Bem Goong,said government’s action was in line with its determination to make tertiary education more accessible.\n“In line with his determination to make tertiary education more accessible, President Muhammadu Buhari has approved the establishment of three New Federal Polytechnics in the country,” the statement read.\nThe polytechnics are to be sited precisely in Umunnoechi in Abia State, Orogun in Delta State and Kabo in Kano State.\n“This brings to 36 the number of federal polytechnics in the country."
  },
  {
    "headline": "Osinbajo invites senators, APC caucus for Iftar",
    "summarized_story": "Professor Yemi OsinbajoBy Henry Umoru, ABUJAThe Vice President, Professor Yemi Osinbajo, has invited senators and the All Progressives Congress, APC, caucus to celebrate Iftar at his official residence today.\nIftar is the meal Muslims eat after sunset during Ramadan to break fasting for the day.\nVice President Osinbajo’s invitation was read at plenary today by the Senate President, Ahmad Lawan.\nLawan announced the Vice President, Yemi Osinbajo’s invitation to members of the Senate and APC caucus to Iftar in the evening at his official residence, Aguda House.\nHe made the announcement after reading the resignation letters of the National chairman of APC, Senator Abdullahi Adamu, and the Deputy National Chairman (North), Senator Abubakar Kyari."
  },
  {
    "headline": "2023: Give me opportunity to govern, Oborevwori begs Deltans",
    "summarized_story": "I will not fail Deltans if elected Governor next year”.\nGive me the opportunity to become the next governor of Delta State.\nI will deliver if given the opportunity to be the Governor in 2023”.\nAt Effurun, he said: “I have the capacity to continue from where our Governor, Senator Ifeanyi Okowa will stop in 2023.\n“The wonderful things that our Governor has done will be continued if I am elected as Governor in 2023."
  },
  {
    "headline": "Victory for Nnamdi Kanu gathering momentum – Legal team",
    "summarized_story": "File image of Nnamdi Kanu (middle) and his lawyers.\nBy Chinonso AlozieOwerri – The detained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu’s legal team on Tuesday said the freedom for Kanu, was already gathering momentum.\nExplaining further, he said: “Our Court-Ordered routine visit to our amiable Client – Onyendu Mazi Nnamdi Kanu was conducted on 11th Day of April 2022.\nOnyendu urged you all, his supporters, followers and all Ezigbo UmuChineke to remain focused as their journey to his freedom is gathering momentum.\nHence, please do not relent nor despair Ezigbo UmuChineke, because it will surely end in victory soon."
  },
  {
    "headline": "8 MONTHS AFTER RITUAL KILLERS SLEW MRS PATIENCE KOMONE: Police obstructing justice, Delta family cries out",
    "summarized_story": "I (IPO) do not have money to charter a vehicle, we are coming from Asaba to Oleh court.\nI expected you to ask how we are going to raise some money now to enable us go to court.\nOkay, no problem, thank you.” From that moment, the IPO stopped giving the family situation reports on the case,” he added.\nAn innocent woman selling pepper to train her only child whose father had earlier passed on, was brutally murdered,” he intoned.\nWe’ve charged case to court – PPROWhen contacted for update on the matter, Police Public Relations Officer, Delta Command, Edafe Bright, simply told NDV: “That matter was charged to court.”"
  },
  {
    "headline": "El-Zakzaky’s Passport Seizure: Health of our principal deteriorating, Shi’ites raise fresh alarm",
    "summarized_story": "The sect has raised an alarm that their leader’s health and that of his wife were deteriorating, alleging that the government was deliberately holding back their travel documents for no justifiable reason.\nThey told Nigerians and the international community to hold President Muhammadu Buhari responsible if anything untoward befalls the couple.\nThe statement read in part ” It is pertinent for the public to note that the freedom of Sheikh El-Zakzaky and his wife is still being denied.\n“After patiently waiting for 9 months, we have no option but to return to the streets of Abuja, to protest this unholy conspiracy.\nMost of their protests were premised on the alleged unlawful detention of their leader, Ibraheem El-Zakzaky and his wife, Zeenah in the correctional facility of government for several months."
  },
  {
    "headline": "Senator Abdullahi Adamu resigns from Senate",
    "summarized_story": "Senator Abdullahi Adamu representing Nasarawa West Senatorial District has resigned from the Senate.\nHe sent in his resignation letter following his election as the National Chairman of the ruling All Progressives Congress (APC) on March 26.\nThe letter was read by the Senate President, Dr Ahmad Ibrahim Lawan on Tuesday during the plenary on Tuesday.\nAdamu in the letter praised the charismatic leadership of the Senate President, saying: “I must commend you for a charismatic leadership in which you treat all Senators equally irrespective of political difference.”Until his resignation, Senator Abdullahi Adamu was a two-term governor of Nasarawa State and a third term Senator in the Senate.\nWith the exit of Senator Adamu, the Independent National Electoral Commission (INEC) was expected to conduct a by-election within a statutory period of three months for a replacement."
  },
  {
    "headline": "2023: South-East youths compile list of corrupt govs, vow to expose them",
    "summarized_story": "The Coalition of South East Youth Leaders, COSEYL, says it is currently compiling a list of governors in the region who embezzled public funds, saying they will not be allowed to occupy any political office in the forthcoming election.\nThe coalition called on all citizens of the region to join hands in ensuring that no corrupt individual occupied any political office in 2023.\n“We are investigating our governors and any of them found wanting will not be elected or permitted to hold any other political office in the coming election.\nNdigbo cannot afford to make another mistake of presenting corrupt persons for any political office again in 2023.\n“We call on our people to rise up and defend our commonwealth from being embezzled and taken away by those we elected to protect our interests."
  },
  {
    "headline": "Evangelical Church Winning All decries state of the nation, accuses FG of inactivity",
    "summarized_story": "The Evangelical Church Winning All (ECWA), has expressed concern over the continued security challenges bedevilling the country.\nA communique issued at the end of its 69th General Church Council meeting, held in Jos, the Plateau State capital, signed by the ECWA President and the General Secretary, Rev Dr. Stephen Baba Panya and Rev.\nDr. Yunusa Sabo Nmadu, respectively, x-rayed the state of the nation.\nThe meeting questioned the conspicuous silence and reluctance of the Federal Government to act decisively on arresting issues bedevilling the country.\nThe meeting sought assistance for the returning farming populace with the necessary farming inputs."
  },
  {
    "headline": "2023: Osinbajo will never be President, powerful forces will implicate him – Primate Ayodele",
    "summarized_story": "The Leader of INRI Evangelical Spiritual Church, Primate Elijah Ayodele, on Tuesday, warned Vice President Yemi Osinbajo over his presidential ambition.\nPrimate Ayodele lauded Osinbajo for declaring his intention, but revealed that he can never become Nigeria’s President.\nIn a statement signed by his Media Aide, Osho Oluwatosin, Primate Ayodele warned that further steps on actualizing the ambition will lead to waste of resources because some forces will fight and implicate him.\n“It’s either he waste his money or decide not to waste money, but he can’t be the next President of Nigeria.\nThey are deceiving him, he won’t go beyond the vice president, he should not waste his money at all.’’"
  },
  {
    "headline": "BREAKING: Gunmen kill 19 in Benue communities",
    "summarized_story": "Gunmen have killed no fewer than 19 persons in Benue communities.\nThe gunmen, in Tyiortyu of Mbakor Tarka local government area, killed 10 persons.\nAngry youths on Tuesday morning blocked the busy Federal highway from Makurdi, the state capital to Gboko to protest the incident.\nTyortyu is a satellite town along the busy Makurdi- Gboko highway in Tarka local government area in Benue state.\nIn Tse-Sumaka village, gunmen killed nine farmers near branch Umenger in Mbadwem council ward in Guma Local Government area on Monday."
  },
  {
    "headline": "BREAKING: Osinbajo meets APC Senators Tuesday",
    "summarized_story": "Vice President Yemi Osinbajo will on Tuesday evening host Senators on the platform of the All Progressives Congress (APC) to Iftar (breaking of fast).\nThis was contained in a letter of invitation read by Senate President Ahmad Lawan at plenary.\nThe letter was signed by the Senate Leader, Yahaya Abdullahi.\nOsinbajo on Sunday evening hosted APC Governors for Iftar where he informed them of his ambition to contest for the office of President in 2023.\nThe VP is also expected to formally inform the APC Senators of his desire to succeed President Muhammadu Buhari, during the Iftar."
  },
  {
    "headline": "BREAKING: Adamu, Kyari resign from Senate",
    "summarized_story": "The National Chairman of the All Progressives Congress (APC) Abdullahi Adamu on Tuesday formally resigned from the Senate.\nSenator Abubakar Kyari representing Borno North also resigned from the Upper Chamber.\nAdamu and Kyari, in separate letters read by Senate President Ahmad Lawan on the floor, said their action became necessary following their emergence as National Chairman and Deputy National Chairman (North) of the APC respectively.\nDetails Shortly.."
  },
  {
    "headline": "BREAKING: Gunmen hijack two passenger buses in Rivers",
    "summarized_story": "Gunmen have reportedly hijacked two commercial buses with passengers in Rivers State.\nThe buses said to heading to Kalabari riverine axis in Degema, Asaritoru and Akukutoru Local Government Councils from Port-Harcourt were allegedly hijacked along Degema/Buguma/Abonnema Road on East/West road.\nRead Also: Gunmen attack communities in PlateauThe incident reportedly occured on Monday evening.\nRivers Police Command was yet to confirm the incident but locals said the development caused tension in the area.\nAs of the time of filing this report, the whereabouts of the passengers and the buses were unknown."
  },
  {
    "headline": "Tinubu rallies governors in mission for APC ticket",
    "summarized_story": "NWC gears up for primaries guidelinesOsinbajo unfolds planThe bid for the All Progressives Congress (APC) presidential ticket got into an upward swing yesterday when leading aspirant Asiwaju Bola Ahmed Tinubu met with the party’s governors to seek their support.\nTinubu, the national leader of the APC, met with the governors at the Kebbi State Governor’s Lodge in Asokoro, Abuja.\nTinubu assured the APC governors of inclusion and accommodation in the presidential project.\nAddressing reporters after yesterday’s meeting with APC governors, Tinubu said he was seeking the governors’ support for his ambition.\nApart from meeting traditional rulers and opinion leaders in the Southwest, he has met members of the APC National Assembly caucus, Northern monarchs and religious leaders."
  },
  {
    "headline": "Buhari approves establishment of 3 new polytechnics",
    "summarized_story": "From Fred Ezeh, AbujaPresident Muhammadu Buhari has approved the establishment of three new federal polytechnics in the country.\nThe new Polytechnics are to be sited in Umunnoechi in Abia State, Orogun in Delta State and Kabo in Kano State.\nThis brings to thirty-six the number of federal polytechnics in the country.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nGoong confirmed that the president has directed that the new Institutions should commence academic activities in October 2022."
  },
  {
    "headline": "BREAKING: APC Chairman resigns from Senate",
    "summarized_story": "The National Chairman of the All Progressive Congress , Alhaji Abdullahi Adamu has resigned from the senate.\nAdamu was elected as APC national chairman at the convention of the party that was held on March 26.\nAbubakar Kyari, the current APC deputy chairman (north), also resigned his membership of the upper legislative chamber.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nTheir resignations were stated in letters read on the floor of the red chamber by Senate President Ahmad Lawan on Tuesday"
  },
  {
    "headline": "2023: I’ve no son old enough to declare for president –Tinubu",
    "summarized_story": "He spoke after a consultative meeting with the APC Progressive Governors Forum (PGF) in Abuja, yesterday, few hours after Osinbajo joined the presidential race.\nIt is widely believed that Tinubu nominated Osinbajo as President Muhammadu Buhari’s running mate in 2015 as part of the political trade-offs that led to the birth of APC.\nHe also said there was nothing wrong in Osinbajo declaring to contest against Tinubu.\nDon’t forget that in the 2015 presidential election primary, President Buhari contested against several others and it was a beautiful contest.\nMembers of the party always want to see consensus if it is possible, but we are a democratic party."
  },
  {
    "headline": "…Osinbajo vows to complete what Buhari started",
    "summarized_story": "Vice President Yemi Osinbajo, yesterday, formally declared his intention to contest the 2023 presidential election.\nIn his declaration made in a video posted on his twitter handle, he said if elected president, he would complete the works started by President Muhammadu Buhari.\n“I have visited our gallant troops in the North East and our brothers and sisters in the IDP camps.\nI know their hopes, aspirations and fears; and I believe that in those hopes and aspirations are the seeds for the great Nigeria that we all desire.\nWhere everywhere, in this land, is home for everyone, where our diversities, tribes and faiths unite, rather than divide us."
  },
  {
    "headline": "Bandits kill 78, burn houses in Plateau",
    "summarized_story": "From Gyang Bere, JosNo fewer than 78 people were killed and several others inflicted gunshot injuries when bandits invaded communities in Kanam and Wase Local Government Areas of Plateau State.\nThe incident, which occurred on Sunday afternoon, lasted for several hours, leaving women, children and the aged displaced from the affected communities.\nHe said members of the communities cried and wailed over the number of the dead as if they were counting votes during the election.\n100% Natural Herbs to Finally End Premature Ejaculation, Weak Erection and Small Manhood.\nPlateau State Governor, Simon Lalong, vowed to make it difficult for terrorists and other criminals to set their bases in any part of the State and use same to launch attacks on innocent citizens."
  },
  {
    "headline": "Breaking: APC National Chairman, Deputy Resign from Senate",
    "summarized_story": "Sunday Aborisade, AbujaThe National Chairman of the All Progressives Congress (APC), Abdullahi Adamu, has resigned from the Senate.\nSimilarly, Senator Abubakar Kyari, representing Borno North Senatorial District, has also resigned from the red chamber.\nAdamu and Kyari announced their resignations in separate letters read by the Senate President, Ahmad Lawan, at plenary Tuesday.\nLawan said the senators explained that their action became necessary following their emergence as National Chairman and Deputy National Chairman (North) of the APC respectively.\nDetails shortly..:Share this: FacebookRedditTwitterPrintPinterestEmailWhatsAppSkypeLinkedInTumblrPocketTelegram"
  },
  {
    "headline": "Lalong Attending Political Meetings as Terrorists Mow down 80, Abduct 70 in Plateau Communities",
    "summarized_story": "•78 given mass burial amid fear of further attacks•Defend yourselves, ECWA charges NigeriansSeriki AdinoyiBloodthirsty terrorists have killed 80 persons and abducted 70 others after an invasion of some communities in Plateau State.\nRegrettably, while terrorists soiled the state in blood and danger, Plateau State Governor, Mr. Simon Lalong, was busy in Abuja holding political meetings with a former Governor of Lagos State, Mr. Bola Tinubu, over the latter’s presidential ambition.\nYunusa Nmadu, at the end of the 69th General Church Council meeting held at the church headquarters in Jos, Plateau State.\nYunusa Nmadu, at the end of the 69th General Church Council meeting held at the church headquarters in Jos, the Plateau State capital.\nOn the unremitting killings and abductions of citizens in Kaduna, Kebbi, Zanfara, Plateau, Niger and other states of the country, ECWA called on government to arrest the situation."
  },
  {
    "headline": "Marginal Fields: Upstream Commission Targets June for Drilling",
    "summarized_story": "The regulator had put up 57 marginal fields spanning land, swamp and offshore for lease, with 161 companies eventually shortlisted to advance to the final stage from 591 entities that applied for pre-qualification.\n“It’s critical because one of our cardinal objectives is to ensure that we increase the national oil production and of course, we realise that the fields will actually help in enhancing that.\nAvuru’s comments came days after a businessman and Chairman Heirs Holdings, Mr. Tony Elumelu, similarly bemoaned the worsening state of the industry, stressing that about 95 per cent of oil production does not get to the terminal.\nContinuing, Komolafe stated that it was not the duty of the commission to secure government oil and gas assets, saying the organisation does not, “regulate” criminal activities.\nBy rough estimates , the NUPRC had said that Nigeria lost more than 115,000 barrels per day (bpd) to oil theft and vandalism between January 2021 and February 2022."
  },
  {
    "headline": "Tinubu Disowns Osinbajo, Says He Has No Son Grown Enough to Declare for President",
    "summarized_story": "Fielding questions from journalists after the meeting, an apparent knee-jerk response to the vice president’s deft pioneering meeting with the APC governors, Tinubu denied Osinbajo outright.\nAsked about the declaration of the vice president, a development many of Tinubu’s loyalists reckoned should not have happened, Tinubu declared, “I don’t have a son grown enough to declare” for the office of president.\nHe said Tinubu told the APC governors about his intention to vie for the presidency in 2023.\nEkiti Group Endorses Osinbajo, Says VP Better Than TinubuA group, Osinbajo Grassroots Organisation, has begun mobilisation in Ekiti State for Vice President Yemi Osinbajo, saying he is better than other contestants vying for the All Progressives Congress (APC) ticket, including Bola Tinubu.\nTinubu had told journalists that his meeting with the governors was to solicit their support for his ambition to be elected Nigeria president in 2023."
  },
  {
    "headline": "Bagudu: What Tinubu Told APC Governors",
    "summarized_story": "* Osinbajo’s declaration a betrayal of trust, says Tinubu support groupAdedayo Akinwale in AbujaFew hours after the declaration by Vice President Yemi Osibanjo for President, national leader of the All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu, met with governors of the ruling party.\nThe meeting held at Kebbi State Governor’s Lodge, Asokoro, Abuja had about 12 governors elected on the platform of the party in attendance.\nWhile fielding questions from journalists after the meeting, Tinubu said he met with the governors to seek their support for his ambition.\nHe said Tinubu acknowledged the role of the Governors in the last convention of the party, where the governors steadied the party and helped produce a leadership that was accepted and widely acknowledged.\nMeanwhile, Tinubu Support Group (TSG) has described the declaration by the Vice President as a betrayal of trust."
  },
  {
    "headline": "EXCLUSIVE: How Attorney-General Malami Manipulated Buhari To Approve Payment Of $350million To Ned Nwoko, Other Paris Club Consultants Despite Fraud Alerts",
    "summarized_story": "“Your Excellency subsequently approved the recommendation for the settlement of this 3rd party via letter dated 29th August, 2018 with Ref.\nMinister of Finance directly instructed CBN to pay the sum of $86,546,526.65 as consultancy fees and N19,439,225,871.11 as legal fees to NGF accounts.\n“I wish to further make references from the Chief of Staff to the President dated 28th June, 2018 with Ref.\n“Yet Malami who knows this is recommending that Ted Edward be paid $159,000,000 as fees from ALGON instead of the actual lawyer.\nYet Malami in the face of this clear case of fraud tricked the President in a memo and said judgement was given against them."
  },
  {
    "headline": "EXCLUSIVE: How Attorney-General Malami Manipulated Buhari To Approve Payment Of $350million To Ned Nwoko, Other Paris Club Consultants Despite Fraud Alerts",
    "summarized_story": "“Your Excellency subsequently approved the recommendation for the settlement of this 3rd party via letter dated 29th August, 2018 with Ref.\nMinister of Finance directly instructed CBN to pay the sum of $86,546,526.65 as consultancy fees and N19,439,225,871.11 as legal fees to NGF accounts.\n“I wish to further make references from the Chief of Staff to the President dated 28th June, 2018 with Ref.\n“Yet Malami who knows this is recommending that Ted Edward be paid $159,000,000 as fees from ALGON instead of the actual lawyer.\nYet Malami in the face of this clear case of fraud tricked the President in a memo and said judgement was given against them."
  },
  {
    "headline": "BREAKING: Vice President Osinbajo Officially Declares For President",
    "summarized_story": "The Vice-President of Nigeria, Prof Yemi Osinbajo on Monday officially declared to contest the 2023 presidential election.\n“I am today, with utmost humility formally declaring my intention to run for the office of the President of the Federal Republic of Nigeria on the platform of APC,” he said in a post on his official Twitter.\nOsinbajo had hosted All Progressives Congress governors on Sunday in Abuja.\nHe had hosted the governors for the breaking of Ramadan fast (Iftar) and declared his intention to them."
  },
  {
    "headline": "BREAKING: Vice President Osinbajo Officially Declares For President",
    "summarized_story": "The Vice-President of Nigeria, Prof Yemi Osinbajo on Monday officially declared to contest the 2023 presidential election.\n“I am today, with utmost humility formally declaring my intention to run for the office of the President of the Federal Republic of Nigeria on the platform of APC,” he said in a post on his official Twitter.\nOsinbajo had hosted All Progressives Congress governors on Sunday in Abuja.\nHe had hosted the governors for the breaking of Ramadan fast (Iftar) and declared his intention to them."
  },
  {
    "headline": "Mubarak Bala’s Jail: Human Rights Lawyer, Obono Petitions National Assembly, Wants Blasphemy Law Amended",
    "summarized_story": "A human rights lawyer, Mbasekei Obono, has asked the National Assembly to remove sections of the states’ criminal and penal codes that outlaw blasphemy.\nObono in a petition to the lawmakers said the growing trend of sentencing young Nigerians under the pretext of blasphemy must be discontinued.\nHe said those sentenced were merely exercising their rights to the freedom of thought and religion.\nThe idea that only a class of people are permitted to express themselves while others cannot austerely impair their rights to human dignity.\nThis is why freedom of thought is protected under international human rights law."
  },
  {
    "headline": "APC wins 31 of 34 seats in Katsina LG poll",
    "summarized_story": "Katsina State Independent Electoral Commission (KTSIEC) has declared the ruling All Progressives Congress (APC) as winner in 31 out of the 34 local government areas of the state.\nThe LG election was held on Saturday.\nLawal Faskari, secretary of the commission, who made the announcement in the early hours of Tuesday in Katsina, said the election was not completed in Daura and Funtua local government areas.\nHe also said the election was cancelled in Dutsin-Ma LGA owing to some challenges, while the exercise was peaceful in all other areas.\n“The commission has so far received complete results from 31 local government areas, 328 wards, awaiting that of Funtua and Daura, while elections in Dutsin-Ma has been cancelled."
  },
  {
    "headline": "APC wins 31 of 34 seats in Katsina LG poll",
    "summarized_story": "Katsina State Independent Electoral Commission (KTSIEC) has declared the ruling All Progressives Congress (APC) as winner in 31 out of the 34 local government areas of the state.\nThe LG election was held on Saturday.\nLawal Faskari, secretary of the commission, who made the announcement in the early hours of Tuesday in Katsina, said the election was not completed in Daura and Funtua local government areas.\nHe also said the election was cancelled in Dutsin-Ma LGA owing to some challenges, while the exercise was peaceful in all other areas.\n“The commission has so far received complete results from 31 local government areas, 328 wards, awaiting that of Funtua and Daura, while elections in Dutsin-Ma has been cancelled."
  },
  {
    "headline": "Osinbajo to meet APC senators today — and reps on Wednesday",
    "summarized_story": "Vice-President Yemi Osinbajo is expected to meet some members of the All Progressives Congress (APC) in the national assembly today.\nAhmad Lawan, senate president, read Osinbajo’s letter of request for a meeting with the APC legislators during a plenary session on Tuesday.\nThe meeting is fixed for April 12, 2022 (today) and it will be held at the state house banquet hall in Abuja.\nAdvertisementThe vice-president will also be meeting members of the party in the house of representatives on Wednesday evening.\nAccording to the letter read by Wase, the meeting is scheduled for 8pm on Tuesday."
  },
  {
    "headline": "Osinbajo to meet APC senators today — and reps on Wednesday",
    "summarized_story": "Vice-President Yemi Osinbajo is expected to meet some members of the All Progressives Congress (APC) in the national assembly today.\nAhmad Lawan, senate president, read Osinbajo’s letter of request for a meeting with the APC legislators during a plenary session on Tuesday.\nThe meeting is fixed for April 12, 2022 (today) and it will be held at the state house banquet hall in Abuja.\nAdvertisementThe vice-president will also be meeting members of the party in the house of representatives on Wednesday evening.\nAccording to the letter read by Wase, the meeting is scheduled for 8pm on Tuesday."
  },
  {
    "headline": "QUESTION: Did FG just launch same Project Lighthouse Kemi Adeosun unveiled in 2017?",
    "summarized_story": "On Monday, Zainab Ahmed, minister of finance, budget and national planning, launched Project Lighthouse, a debt analytics and reporting platform.\nTheCable understands that Project Lighthouse sprouted from efforts to address policy challenges in the ministry through technology.\nWith the launching on Monday, Project Lighthouse could be viewed as a novel project originating from ‘ingenious’ leadership of Ahmed.\nKEMI ADEOSUN’S PROJECT LIGHTHOUSE INITIATIVEThe initiative first came to being during the tenure of Kemi Adeosun, former finance minister.\nWith that said, does it mean that Zainab Ahmed launched (or relaunched) Adeosun’s Project Lighthouse on Monday?"
  },
  {
    "headline": "How much did African startups raise in 2021?",
    "summarized_story": "In 2021, African startups raised over $4 billion across 355 funding deals.\nThere are a few other markers of the maturity of Africa’s tech ecosystem, including a derriere of veteran founders investing in early- and growth-stage startups on the continent.\nFor the first time, TechCabal has released data that documents the state of Africa’s ecosystem in the given year.\nIn our report, we cover the following themes and topics:How much did African startups raise in 2021, and how much did each of the regions raise?\nNote: TechCabal Insights launched DealFlow, a funding tracker dashboard that tracks total VC funding for Africa startups in real-time."
  },
  {
    "headline": "MTN Nigeria secures approval to operate Mobile Money Bank",
    "summarized_story": "MTN Nigeria, the Nigerian arm of Africa’s largest telecom, today received final approval from the Central Bank of Nigeria to run a payment service bank.\nWith this approval, MTN Nigeria can provide virtually all the services offered by conventional commercial banks with the exception of granting credit and processing foreign exchange transactions.\nThis announcement follows a previous approval in principle granted in November 2021, to Airtel Africa Plc and MTN Nigeria Communications Plc to operate a payment service bank in the country.\nIn January, MTN revealed that MTN Nigeria’s mobile money service had attracted 9.4 million active users since launching in August 2019.\nThis approval is expected to spur the adoption of mobile money in Nigeria as the use cases increase."
  },
  {
    "headline": "How to get free (and effective) press for your startup",
    "summarized_story": "At our last edition of Techpoint Startup School, I taught a class on getting free press for your startup.\nLesson 1: Do you even need press?\nYou need marketing in the early stage because you need traction which you can use to get press.\nIf you just changed the logo of your startup, don’t expect the publication to announce that.\nA better approach to get free press is to find a journalist who has shown interest in the intricacies of UI and design."
  },
  {
    "headline": "News • Techpoint Africa",
    "summarized_story": "Hello there!\nInteresting times.\nThey say, “if you want something done right, do it yourself.” This is the closest..."
  },
  {
    "headline": "NFT is the new oil!",
    "summarized_story": "The gist is that the group’s leader, Benjamin Aidoo, recently sold their viral coffin dance – that same video you might have seen countless times – as a non-fungible token (NFT) for 372eth ($1.046 million).\nIsn’t this so-called NFT devoid of integrity?\nIn today’s episode of the Techpoint Africa Podcast, he explains why an NFT can be sold for over a million dollars.\nSneak Peek: What sells in NFT is the metadata, not the image, video, or item.\nThis means that MTN Nigeria will act as a commercial bank like Firstbank, Access Bank, and Zenith Bank."
  },
  {
    "headline": "Here’s the low-down on all that happened at April’s Pitch Friday",
    "summarized_story": "We eventually started at 5:30 p.m. with Victor Momoh, Co-founder and CTO, pitching Credit Sense, a fintech startup.\nCredit SenseVictor Momoh pitching Credit Sense.\nThe startup plans to use blockchain technology and cards to facilitate financial transactions beginning with withdrawals.\nAfiariChigozie Njoku pitching AfiariAfter Momoh was done with his pitch, Chigozie Njoku stepped up to pitch Afiari, an eCommerce startup that helps customers buy foodstuff from major markets close to the customer.\nIn addition to buying from major markets close to the customer, Afiari plans to offer 24-hour delivery and use artificial intelligence to predict customer demands."
  },
  {
    "headline": "‘Twas NFT weekend!",
    "summarized_story": "Share this article:Looking for a quick rundown of what we discussed on today’s Techpoint Africa Podcast?\nFirst things first, in the words of Bolu Abiodun, it was definitely an NFT weekend.\nRegister to attend hereIt wasn’t all NFTs with telcos like MTN and Econet getting some talking time as well.\nOne thing we also found intriguing was the company’s Chinese roots and how it basically chased Uber out of China.\nYou can catch up on everything we discussed on Apple Podcasts, Google Podcasts, Spotify, or wherever you get your podcasts."
  },
  {
    "headline": "Presidency: Osinbajo, Tinubu in fight to the finish",
    "summarized_story": "Both men met on Thursday when Osinbajo told his boss about how he planned to meet governors of the party.\nOsinbajo made a deliberate effort to court and extoll governors of the ruling APC when he hosted them, according to those close to the meeting.\nHe praised Osinbajo for bringing the governors closer over the years by his tact in handling matters at the regular meetings of the National Economic Council (NEC), which Osinbajo chairs.\nIn what some have described as a counter move, Tinubu also held his own meeting on Monday with 12 APC governors at Kebbi State Governor’s Lodge, Asokoro, in Abuja.\nThere is no difference between Buhari, Tinubu and Osinbajo."
  },
  {
    "headline": "Illegal fishing: How Nigeria can stop losing $70m yearly – Experts",
    "summarized_story": "Experts in the Nigerian maritime industry have highlighted what the country needs to do to stop the annual loss of $70 million to illegal fishing.\nThe country has been losing over $70 million yearly to illegal fishing, according to the estimation by the House of Representatives.\nAgbakoba said vessels from China, the European Union, and Belize were notable for illegally exploiting Nigerian waters.\n“The activities of these foreign fish poachers are also impoverishing our fishermen and rendering our youths jobless, thereby increasing insecurity,” Okenwa said.\nAnother critical factor that has been driving illegal fishing in the West African region, particularly Nigerian waters, is that foreign fish poachers usually find a market for the stolen fish."
  },
  {
    "headline": "Inside western countries’ plot to cut oil imports from Nigeria, others",
    "summarized_story": "If this were implemented across Western countries, the IEA estimates that it will avoid around 380,000 bpd of oil use in the short term.\nIt estimates that this measure will cut around 40,000 bpd oil use in the short term.\nCounsel from the IEA are not treated like mere suggestions, they form the fulcrum of Western countries energy policy.\nIn the 1970s, the IEA advised western countries to begin stockpiles of crude oil.\nNigeria currently sells the bulk of its oil to Western countries."
  },
  {
    "headline": "Newly deploy CP assumes duty in Edo – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY-The recently posted commissioner of police to Edo State CP Abutu Yaro has assumed duty in Benin City.\nHe assumed duty on Monday, April 11, 2022 as the 44th commissioner of police in Edo State.\nThe newly deployed CP succeeded CP Philip Ogbadu who retired from the Nigeria Police Force, last month.\nCP Abutu Yaro pledged to discharge his duty in the state with utmost professionalism.\nPrior to his recent deployment to Edo State, he was the CP Provost Marshal, Force Headquarters, Abuja."
  },
  {
    "headline": "Obaseki extols exemplary virtues of late Harry Osarodion – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki has eulogized the virtues of late Dr. Harry Osarodion Nomayo, hailing him for his inspiration and support while he was alive.\nThe governor, who was joined by his wife, Betsy, spoke at a memorial service held at Deaconess Dorcas Erioye Emokpae Chapel in honour of the late Nomayo.\nHe noted, “We are here to express our love to our brother, Harry.\n“That makes him a very special person in our lives because as children, he was our compass.\nBrother Harry has lived and has now gone to be with his maker.”Dr. Harry Osarodion Nomayo died at the age of 77 years."
  },
  {
    "headline": "Edo commiserates with Osagie over wife’s passing – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Commissioner for Information and Orientation, Hon.\nAndrew Adaze Emwanta, on behalf of the government and people of Edo State, commiserates with former member of the Edo State House Assembly and former Minority Whip of the House of Representatives, Hon.\nSamson Osagie, on the tragic passing of his beloved wife, Mrs. Olabisi Osagie.\nLate Mrs. Osagie was a virtuous woman, a dependable wife and a caring mother, whose grace and benevolence was a blessing to friends and family.\nOsagie, as well as the family, friends and associates of the departed, and pray that God grants all the fortitude to bear this irreparable loss."
  },
  {
    "headline": "Recertification exercise: Obaseki urges data-driven planning to facilitate devt in Edo communities – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestThe Edo State Governor, Mr. Godwin Obaseki, has identified data as a necessity in the socio-economic development of any society, noting that his administration will leverage technology to provide the needed data for proper planning and sustainable development of Edo State.\nObaseki stated this while addressing participants during a workshop in Benin City organized by the Edo State Ministry of Physical Planning, Urban and Regional Development, after the recertification exercise, tagged, ‘Operation Show Your Building Plan’ in the Amagba axis of Benin City, the state capital.\nThe programme has the theme, ‘Physical planning for our communities: The Amagba experience,’ and was attended by top government officials as well as heads of Ministries, Departments and Agencies (MDAs) in Edo.\n“We are going to every community in Edo, every local government and every ward.\n“We will need to beef up our planning as we are undertaking data to replan the existing areas."
  },
  {
    "headline": "Abdullahi Adamu, APC chairman, deputy resign from senate",
    "summarized_story": "The national chairman of the All Progressives Congress (APC), Abdullahi Adamu, has resigned from the senate.\nAdamu, who was the senator representing Nasarawa West, was elected as APC national chairman at the convention of the party that was held on March 26.\nThe ruling party’s deputy national chairman, north, Abubakar Kyari, who was representing Borno North, also resigned his membership of the upper legislative chamber.\nTheir resignations were stated in letters read on the floor of the red chamber by Senate President Ahmad Lawan on Tuesday."
  },
  {
    "headline": "Adolphus Wabara, ex-senate president, loses wife",
    "summarized_story": "Adolphus Wabara, Nigeria’s former president of the senate, has lost his wife, Felicia.\nShe died at the age of 69 in the early hours of Sunday, April 10, 2022, after a protracted illness.\nEmmanuel Shebbs, the Secretary of Ukwa East Local Government Area of Abia State announced the development in a statement on Monday.\nFelicia was married to Senator Adolphus Wabara for 40 years.\nWabara became a senator in 1999 and was president of the Senate of Nigeria from 2003 to 2005."
  },
  {
    "headline": "Video of late Osinachi Nwachukwu’s children praying for her on last birthday surfaces",
    "summarized_story": "A video showing the children of Osinachi Nwachukwu, the popular gospel artiste who died on Friday, praying for her on her last birthday, has surfaced online.\nIn the video, the singer’s children and staff could be seen praying for long life and health for the singer who died as a result of domestic violence.\nOsinachi who was a lead singer at the Dunamis International Gospel Centre was reportedly beaten repeatedly by her husband Peter Nwachukwu who has since been arrested by the police."
  },
  {
    "headline": "FG under pressure over worsening economic conditions",
    "summarized_story": "The following day, he was put on suspension by the Mosque Committee, and was subsequently sacked last week.\nPenultimate Sunday, Adeboye noted that he is very concerned about the Kaduna killings, oil theft, Nigerias depressing debt profile and other current national challenge.\nOn the Kaduna train attack, he said, “you cannot go to Kaduna by road, air or train.\nHe said that government has been overwhelmed by the security challenge and questioned government’s willingness to stop the crisis.\nMr Soyinka maintained Nigeria is overqualified for international help and should stop hiding under false pride or national integrity."
  },
  {
    "headline": "Federal Civil Servants Back EFCC Probe, Dismiss Petition",
    "summarized_story": "National president of the Association of Senior Civil Servants of Nigeria, Dr. Tommy Etim Okon, has expressed confidence that the union would be vindicated over the ongoing probe of the union by the Economic and Financial Crimes Commission (EFCC).\nSpeaking with the media in Lagos, Okon said, “When the report is out, it will be very clear to the public.\nWhy the workers decided to defend the union is because they also believe in the activities and programmes which have been a greater benefit to them.\n“You can see from the last publication, the number of workers that went to the site of the building which was allegedly sold and also here now.\nHe tasked the union members on increased productivity and exhibition of requisite outstanding performance through research"
  },
  {
    "headline": "APC Professionals Council Urges Issue-based Campaigns",
    "summarized_story": "All Progressives Congress, (APC) Professionals Council, a popular support group of the ruling party, has called on all members of the party and supporters of the various aspirants seeking to contest the 2023 general election to desist from name-calling and hauling of abusive words.\nThe director-general of APC Professionals Council, Seyi Bamigbade, gave this advice when receiving decamped members of the PDP in Zamfara State on yesterday.\nBamigbade in a statement made available to journalists in Lagos said the era of personal attacks in politics was gone, urging the aspirants to educate their supporters on the need to play issue-based politics rather than resorting to mudslinging.\nADVERTISEMENTAccording to him, those who seek to display their loyalty to their principals by attacking the personality of fellow contestants are not doing their principals any good, urging them to desist from such practice.\nBamigbade, while calling for decorum, decency, civility and respect for one another amongst party members, said such virtues would help the party to remain united even after the 2023 general elections."
  },
  {
    "headline": "Oromoni: Lagos Moves Against Bullying, Accidents In Schools",
    "summarized_story": "Lagos State government has introduced Safe School Lagos (SSLAG), an initiative designed to prevent a repeat of the tragic incident that led to the controversial death of a 12-year-old Dowen College student, Sylvester Oromoni, in schools.\nThe state government said the initiative is a proactive measure to curb bullying, cultism, auto accidents among others in both the public and private schools across the state.\nMojola said, “Safer schools produce safer children and safer children are the bedrock of the future.\n“How can we ensure that teachers teach basic principles of safety and to ensure children interact in a safe environment?\nSafety begins with you and zero accident is possible if we all work together and in a safe environment.”"
  },
  {
    "headline": "Oromoni: Lagos Moves Against Bullying, Accidents In Schools",
    "summarized_story": "Lagos State government has introduced Safe School Lagos (SSLAG), an initiative designed to prevent a repeat of the tragic incident that led to the controversial death of a 12-year-old Dowen College student, Sylvester Oromoni, in schools.\nThe state government said the initiative is a proactive measure to curb bullying, cultism, auto accidents among others in both the public and private schools across the state.\nMojola said, “Safer schools produce safer children and safer children are the bedrock of the future.\n“How can we ensure that teachers teach basic principles of safety and to ensure children interact in a safe environment?\nSafety begins with you and zero accident is possible if we all work together and in a safe environment.”"
  },
  {
    "headline": "2023: Osinbajo, Amaechi, Tinubu told to reveal plans to end insecurity",
    "summarized_story": "Popular media personality, Ebuka Obi-Uchendu has expressed concern over the lingering insecurity as the 2023 election draws near.\nWith aspirants declaring intention to run for the office of the President in 2023, Ebuka has taken to social media demanding their solution to insecurity.\nAccording to him, the likes of Yemi Osinbajo, Rotimi Amaechi, Atiku Abubakar, Peter Obi and all the other 2023 presidential aspirants must tell Nigerians their precise and practicable plan to tackle insecurity.\nHis tweet read: “They’re all going to need to give us a CLEAR AND PRACTICABLE plan to tackle insecurity.”This is coming a few hours after Vice President Yemi Osinbajo declared to succeed President Muhammadu Buhari in 2023.\nPresently, under the All Progressives Congress, APC, Yemi Osinbajo, Rotimi Amaechi, Asiwaju Bola Tinubu, Yahaya Bello, Dave Umahi and Rochas Okorocha have declared to run for the presidency."
  },
  {
    "headline": "2023: Why I Met With APC Govs – Tinubu",
    "summarized_story": "Bola Tinubu, the All Progressives Congress’s National Leader and a presidential candidate, has revealed why he met with members of the Progressive Governors Forum on Monday.\nTinubu met with APC governors at the Kebbi State Governor’s Lodge in Asokoro, Abuja, hours after Vice President Yemi Osinbajo stated his ambition to succeed President Muhammadu Buhari (retd.)\nThe meeting took place less than 24 hours after Osinbajo hosted the governors at his Aguda House house on Sunday evening, where he announced his candidacy for the APC presidential ticket.\nThe former Lagos State Governor, however, told reporters after the meeting that he met with the governors to seek their support for his bid to become Nigeria’s president.\n“He met members of the PGF and stated what he has said publicly, his intention to seek the office of the President come 2023 which he had already announced before now."
  },
  {
    "headline": "BREAKING: Power Sector Guru, Dangote ex-VP, Joe Makoju, is Dead",
    "summarized_story": "Joe Makoju, is dead.\nJoe Makoju, who also doubled as the former top executive at Portland Cement Plc.\n“We mourn the passing on of a patriot, a man described as a walking encyclopedia of the NESI,’ one of the sources said.\n“He was the MD/CEO of PHCN at a very crucial & critical time in the life of the sector.\nMakoju was also the VP of Dangote Group & was also at Portland Cement or so."
  },
  {
    "headline": "NPHCDA receives Italy’s 3m COVID-19 doses donated to Nigeria",
    "summarized_story": "The National Primary Health Care Development Agency (NPHCDA)on Monday in Abuja, Nigeria’s capital, received over 3 million single-shot COVID-19 vaccines donated by Italy.\nThe 20 current million total represents 61 per cent of all donated vaccines received by Nigeria via the COVAX facility.\nItalian Ambassador to Nigeria, Stefano De Leo, stated that Italy remains committed, along with other EU members, to support Nigeria’s vaccine needs to help to expand global vaccine coverage.\nIsopi recalled the Global Health Summit convened in Rome by Italian Prime Minister, Mario Draghi, and EU Commission President, Ursula von der Leyen, on 21 May 2021.\nIsopi affirmed Italy’s pledge of US$470million to the Gavi COVAX Advance Market Commitment (Gavi COVAX AMC) with additional funding and doses to priority nations."
  },
  {
    "headline": "Breaking: APC national chair, deputy quit Senate",
    "summarized_story": "The National Chairman of the All Progressives Congress (APC), Senator Abdullahi Adamu, on Tuesday, resigned as Senator representing Nasarawa West Senatorial District in the 9th Senate.\nThis was even as the newly elected deputy National Chairman (North), Abubakar Kyari, also resigned as lawmaker representing Borno North Senatorial District.\nThe resignation letters of both lawmakers were read by the Senate President, Ahmad Lawan, during plenary.\nSenator Abdullahi Adamu, until his election as National Chairman of the All Progressives Congress (APC), chaired the Committee on Agriculture and Rural Development.\n“As I leave the Senate, I cannot easily forget the change and style of leadership that you brought since becoming the Senate President of the Ninth Senate."
  },
  {
    "headline": "Ukrainian invasion: France expels 6 Russians working as spies",
    "summarized_story": "France is expelling six Russians suspected of working as spies under diplomatic cover after the French intelligence services uncovered a clandestine operation on its territory, the foreign ministry said on Monday.\nIt said the DGSI domestic intelligence service had revealed on April 10 after a long investigation “a clandestine operation carried out by the Russian intelligence services on our territory”.\nIn a tweet, Interior Minister Gerald Darmanin said the DGSI “had thwarted a network of Russian clandestine agents who worked against our interests”.\nIt had at the time described those diplomats as “Russian personnel with diplomatic status stationed in France whose activities are against our security interests”.\nThe French foreign ministry told AFP Monday that the six latest Russians expelled were in addition to the 35 already announced."
  },
  {
    "headline": "Domestic violence: Confusion, rage over Lady Osinachi’s death, husband in Police net",
    "summarized_story": "Minister of Women Affairs Dame Pauline Tallen has vowed to ensure justice is served on the death of popular gospel singer, Osinachi Nwachukwu, allegedly killed by her husband.\nShe said Domestic Violence is a crime under the Violence Against Persons Prohibition Act (2015).\nShe expressed disappointment that advocacies against domestic violence, especially Violence Against Women and Girls, persisted when both the federal and state governments had declared zero tolerance to Gender-Based Violence.\nOsinachi’s husband arrestedAnd in another twist to the incident, the Federal Capital Territory( FCT) Abuja Police Command, has arrested Peter Nwachukwu, husband of the late singer.\nOn Saturday, her colleague, Frank Edwards, alleged the late singer had an abusive husband, who regularly brutalised her before she died."
  },
  {
    "headline": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE – NigPilot",
    "summarized_story": "ACPP CONDEMNS COURT CASE AGAINST SENATOR DEMOLA ADELEKE, CALLS BOOT PARTY AN APPENDAGE OF THE ALL PROGRESSIVE CONGRESS (APC)The Alliance of Collaborating Political Parties (ACPP) has condemned the felonious court case instituted against the People’s Democratic Party Governorship Candidate in Osun State by the Governorship Candidate of the Boot Party, Adesoji Adeleke.\nIn a statement issued by a Chieftain of the Alliance, Wole Adedoyin who was also the 2018 Governorship Candidate of the Hope Democratic Party (HDP) said the case is baseless, mischievous and full of contradictions to ridicule Senator Demola Adeleke and the People’s Democratic Party (PDP).\nACPP said the suit against Senator Demola Adeleke was in bad faith and targeted by undemocratic elements to undermine democracy and good governance in Osun State.\nAdedoyin said: The Boot Party has become an appendage of the All Progressive Congress (APC) in Osun State.\nThe party is not serious about winning the forthcoming Osun Governorship Election."
  },
  {
    "headline": "Soludo sets up 15 man peace Committee on insecurity in South East",
    "summarized_story": "Anambra state government has set up a truth, justice and peace Committee which is comprised of 15 members drawn from different fringes of the South Eastern region.\nThe members of the committee are Prof.Chidi Odinkalu as the Chairman, Amb.\nMrs. Bianca Ojukwu, Secretary, Dr. Joe Nworgu,Dr. Udenta Udenta, Mr. Charles Oputa(Charly Boy), Ms. Onyeka Onyenu.\n” To identify the remote and immediate causes of the agitations, restiveness, violence, and armed struggle in the South East since 1999.\nIt was gathered the committee would be inaugurated on a date to be communicated to its members."
  },
  {
    "headline": "Lalong salutes elder statesman Amb Yahaya Kwande @ 93",
    "summarized_story": "Plateau State Governor Simon Bako Lalong has sent warm felicitations to elder statesman Ambassador Yahaya Kwande on the occasion of his 93rd birthday.\nGovernor Lalong in a message signed by Macham Makut the director of press and public affairs to Governor Lalong congratulated the seasoned Administrator, Politician, Diplomat and philanthropist for his selfless service to Nigeria, Plateau State and humanity at large.\nHe described him as an accomplished personality who has made huge impact in the lives of the people at various times when he occupied various offices in the country.\nThe Governor said Ambassador Kwande has mentored many in public service, politics and humanitarian activities by his record of performance over the years where he has freely offered counsel, support and goodwill to those in power and others.\nAccording to Governor Lalong, Ambassador Yahaya is one of the few elders that have demonstrated sufficient interest in the peace, progress and prosperity of Plateau State and Nigeria over the years, hence his willingness to advise and share his wealth of experience with the Government on key issues."
  },
  {
    "headline": "Edo LG Poll: EDSIEC extends date for conduct of primaries, insists on April 19 for election",
    "summarized_story": "The Edo State Independent Electoral Commission (EDSIEC) has extended the date for the conduct of party primaries for the local government elections by two days.\nThe Commission, however, said the extension will not affect the April 19 date earlier scheduled for the council polls.\nThe statement reads: “It is hereby announced for the information of the general public, particularly Registered Political Parties in the state that the Edo State Independent Electoral Commission has extended the date for the conduct of primaries by two (2) days.\n“This is in view of the number of Registered Political Parties that have scheduled their primaries on the 6th of April, 2022 which is the last day for the conduct of the primaries.\nThe last date for the primaries is Friday, April 8, 2022.”“The shift of date for the primaries has nothing to do with the date of the election, as other dates remain fixed and firm,” Ojo added."
  },
  {
    "headline": "Soludo declares Monday, a prayer session to counter IPOB sit-at-home order – NigPilot",
    "summarized_story": "The Anambra State Governor, Prof. Chukwuma Soludo, has urged the people of the state to observe a one-day prayer session on Monday, to curb the activities of the gunmen terrorising the state and the South East region in general.\nThe governor said the prayer session slated to hold on Monday, April 4, 2022, at churches and other religious worshipping centres across the state was necessary to counter the evil attached to the Indigenous People of Biafra, IPOB sit-at-home order.\nHe explained that the prayer session would be against those hiding under the IPOB name to cause havoc in the state.\n“I enjoin you to pause and join in fellowship as we seek the face of God.It is expected that the conclusion of the prayer session shall mark the end of Sit At Home in Anambra State” Soludo declared.\n” We shall empower them to become useful to their families, communities, state, region and the society at large."
  },
  {
    "headline": "Kaduna Train Attack: Victims Families Issue 72-Hour Ultimatum To FG",
    "summarized_story": "﻿Families of passengers who were abducted in the Abuja-Kaduna train attack have issued a 72-hour ultimatum to the Federal Government to secure their release.\nIt’s been long weeks of torture and agonising moments for the families whose relatives were abducted when bandits attacked the Abuja-Kaduna-bound train weeks ago.\nTwo weeks after the victims went missing, their families are hopeful of freedom from captivity, although they have refused to rule out the option of negotiating with the bandits.\nHe said this was necessary and not out of place since the government seemed incapacitated to protect the people.\nBut it’s now an opportunity and a window for the government to rescue our loved ones by opening channel of communication with them (terrorists)."
  },
  {
    "headline": "ASUU Strike: FG Is Not Opposed To Renegotiations, Says Ngige",
    "summarized_story": "He explained that in the December 2020 agreement, he gave the government side a timeline to return to the university unions who are their employees to sort everything out.\nWhat the Manzali committee came up with is a proposal.\nAt our last meeting in February before ASUU proceeded on strike, we said everyone should go back to his principal,” Ngige stated during the meeting.\nI told ASUU to put up a committee, they said Manzali committee had expired.”“So, I am a parent.\nAccording to him, the Nigerian university system produced him and he remains proud of it."
  },
  {
    "headline": "New APC Chairman Abdullahi Adamu, Deputy Resign From Senate",
    "summarized_story": "The new Chairman of the All Progressives Congress (APC) Senator Abdullahi Adamu, has resigned from his position as the senator representing Nasarawa West in the 9th Assembly.\nHis resignation was contained in a letter sent to the upper chamber and read by Senate President Ahmad Lawan during Tuesday’s legislative proceedings.\nAdamu explained that his resignation follows his recent emergence as the new APC Chairman.\nHis deputy, Senator Abubakar Kyari has also resigned his position as a Senator representing Borno North.\nIn a separate letter sent to the Senate, he said the resignation is on account of his new position of Deputy National Chairman (North) of the APC."
  },
  {
    "headline": "Vice President Yemi Osinbajo Declares His Intention To Run For President In 2023",
    "summarized_story": "﻿Vice President Yemi Osinbajo on Monday formally declared his intention to run for President in 2023.\nHis declaration ends months of speculation over his interest in the 2023 presidential race and widens the pool of candidates for the position.\nRead Also: Why I Am Running For President – Osinbajo (Full Text)It also puts him in direct confrontation with his former boss in Lagos State, Bola Ahmed Tinubu, who signalled his intention earlier in the year.\nIn his declaration speech, Osinbajo said he was committed to continuing President Muhammadu Buhari’s vision for the country.\nIn May 2017, Osinbajo emerged as acting President after Buhari embarked on a medical trip abroad."
  },
  {
    "headline": "Nigeria’s Bid To Expand Maritime Territory Fully On Course – Buhari",
    "summarized_story": "The President assured the Committee, chaired by the Minister of Justice and Attorney-General of the Federation, Abubakar Malami (SAN), of his full support on Nigeria’s submission to the United Nations for additional maritime area, under the recognised international convention.\n“I am, therefore, glad that it is happening within our lifetime.\nThis is one of the many reasons I have been ardently following your progress over time.\n“It is my intention to support the submission to the United Nations for additional maritime area, in accordance with the United Nations Convention on the Law of the Sea (UNCLOS) to claim for Nigeria every bit of space that she deserves under UNCLOS.\nThe Attorney-General of the Federation told the President that “by the grace of God,” the Committee is delivering and gaining more grounds for Nigeria on the project."
  },
  {
    "headline": "Adamu swears-in Leo Ntukekpo as Akwa Ibom APC chairman",
    "summarized_story": "The Akwa Ibom State chairman of the All Progressives Congress, Stephen Leo Ntukekpo has been sworn in by the APC National Chairman, Sen. Abdullahi Adamu.\nThe event was witnessed by other members of the National Working Committee on Monday at the Party’s National Secretariat, Abuja."
  },
  {
    "headline": "Fayemi, Adebayo, Egbeyemi to lead Oyebanji's Governorship Campaign -",
    "summarized_story": "Ekiti State Governor, Kayode Fayemi, former Governor of the State and current Minister of Industry, Trade and Investments, Otunba Niyi Adebayo and the Deputy Governor of the State, Bisi Egbeyemi are to lead the campaign of the All Progressives Congress (APC) Governorship Candidate, Biodun Abayomi Oyebanji in the June 18 governorship election in the State.\nIn a Statement released by the Publicity Secretary of the Party,Segun Dipe,Fayemi is to lead the 20-person Campaign Council as Chairman, while Otunba Egbeyemi will serve as the Vice Chairman.\nOthers in the Campaign Council include two former Deputy Governors of the State, Prof Modupe Adelabu and Abiodun Aluko; Ekiti State First Lady, Erelu Bisi Fayemi; State Chairman of the party,Paul Omotosho and a former State chairman, Jide Awe.\nA renowned grassroots mobiliser, Cyril Fasuyi will serve as the Director General of the Campaign Organisation.\nThey are: Administration and Human Resources; Strategy Research and Planning; Welfare, Protocol and Logistics; Contact and Mobilisation; Women Mobilisation; Youth Mobilisation; Media and Publicity; Security and Intelligence; Campaign Coordination; and Legal Matters."
  },
  {
    "headline": "Many Injured, One Arrested As hoodlums Attack Residence of defected PDP chieftain -",
    "summarized_story": "Hoodlums have reportedly attacked the residence of a former chieftain of the Peoples Democratic Party, Bisi Olopeyan few hours after the politician joined the New Nigeria Peoples Party.\nTVC News learnt that residents thought it was an armed robbery attack as it wasn’t far from the scene of Idi Ape armed robbery incident that happened in February.\nOne of the hoodlums who was caught while trying to flee with his accomplices was found with an identity card belonging to the Park Management System.\nAnother tug was also reportedly killed and whisked away by his fleeing gang members, while the arrested hoodlum has since been handed over to the police"
  },
  {
    "headline": "2023: Twitter users react to Osinbajo's declaration",
    "summarized_story": "The declaration of vice president Yemi Osinbajo for the exalted office of the President of the Federal Republic of Nigeria has set tongues wagging on social media.\nProfessor Osinbajo on Monday morning declared his intention to succeed his boss, President Muhammadu Buhari in 2023.\nApart from reactions on social media, APC national leader and Presidential aspirant, Asiwaju Bola Ahmed Tinubu sarcastically responded to Osinbajo declaration when asked by a Journalist after a closed-door meeting with the APC governors in Abuja on Monday.\nHe said: “I have no son grown enough to declare for president”, apparently referring to Osinbajo’s declaration.\nBelow are some reactions to Osinbajo’s declaration from twitter users."
  },
  {
    "headline": "‘We Need Someone to Get Us Out of This (APC) Mess’- Peter Obi",
    "summarized_story": "The crisis over the zoning of the presidential ticket of the Peoples Democratic Party (PDP) for next year’s election has pitched aspirants from Southeast with two governors from the region.\nFour PDP presidential aspirants from the South East, namely Peter Obi, Pius Anyim, Sam Ohuabunwa and Nwachukwu Anakwenze, complain that Governors Okezie Ikpeazu of Abia state and his Enugu state counterpart, Ifeanyi Ugwuanyi, are working against their aspirations.\nAt a meeting of their own in Abuja, the four PDP presidential aspirants from the South East agreed to work together to ensure that one of them emerges the PDP flag bearer.\nAnyim, who addressed journalists after the meeting, said the four aspirants have been meeting for some time, hinting that more persons might soon join the race.\nOur guest is Peter Obi, former Governor of Anambra state and former running mate to Vice President Atiku Abubakar in the 2019 general election."
  },
  {
    "headline": "WHO: Nigeria, 12 Other African Countries Yet to Surpass 10% Covid Vaccination – Arise News",
    "summarized_story": "Among countries that reported an increase in vaccine uptake in February and March, Mozambique, Ethiopia, Uganda, Kenya and Ghana recorded the highest increase in vaccination coverage.\n“Two countries – Seychelles and Mauritius, surpassed the target of 70 per cent of the population fully vaccinated by the end of December 2021.\nBut the report stressed that the absorption rate of the vaccines received remained at sub-optimal level, with only 54.9 per cent of doses administered of the quantity received.\n“However, only three have continued to record increased vaccine uptake in March 2022 (Ghana, Cameroon and South Sudan) in addition to Mozambique, Mali and Burundi.\nThis shows that it is necessary to keep up the momentum in vaccine uptake between mass vaccination campaigns."
  },
  {
    "headline": "Nigeria: APC May Opt for Consensus Candidate for Presidency, Kebbi Governor Bagudu Says",
    "summarized_story": "RelatedStories No Content AvailableChairman of Nigeria’s Progressives Governors Forum (PGF), and Kebbi State governor, Atiku Bagudu, on Monday said the All Progressive Congress (APC) does not rule out the possibility of a consensus candidate among its Presidential aspirants.\nDon’t forget that in the 2015 presidential election primary, President Buhari contested along with several others and it was a beautiful contest.\nMembers of the party always want to see consensus if it is possible, but we are a democratic party.\nThere is always misrepresentation of consensus as if people are being snowballed into positions they would rather not take.\nBagudu explained that the race for the Presidential ticket among the aspirants is a positive one for the party."
  },
  {
    "headline": "Nigeria: Governor Lalong Attending Political Meetings as Terrorists Kill 80, Abduct 70 in Plateau",
    "summarized_story": "Bloodthirsty terrorists have killed 80 persons and abducted 70 others in Nigeria’s North-Central region after an invasion of some communities in Plateau State .\nRegrettably, while terrorists soiled the state in blood and danger, Plateau State Governor, Mr. Simon Lalong, was busy in Abuja holding political meetings with a former Governor of Lagos State, Mr. Bola Tinubu, over the latter’s presidential ambition.\nYunusa Nmadu, at the end of the 69th General Church Council meeting held at the church headquarters in Jos, Plateau State.\nLalong, it was gathered, was the only governor that attended the presidential declaration by Minister of Transportation, Rt.\nYunusa Nmadu, at the end of the 69th General Church Council meeting held at the church headquarters in Jos, the Plateau State capital."
  },
  {
    "headline": "APC Stalwart Tinubu Disowns VP Osinbajo, Says He Has No Son Grown Enough to Declare for President",
    "summarized_story": "The announcement came as the Tinubu Support Group (TSG) described Osinbajo’s presidential declaration as a betrayal of trust.\nFielding questions from journalists after the meeting, an apparent knee-jerk response to the vice president’s deft pioneering meeting with the APC governors, Tinubu denied Osinbajo outright.\nAsked about the declaration of the vice president, a development many of Tinubu’s loyalists reckoned should not have happened, Tinubu declared, “I don’t have a son grown enough to declare” for the office of president.\nHe said Tinubu told the APC governors about his intention to vie for the presidency in 2023.\nEkiti Group Endorses Osinbajo, Says VP Better Than TinubuA group, Osinbajo Grassroots Organisation, has begun mobilisation in Ekiti State for Vice President Yemi Osinbajo, saying he is better than other contestants vying for the All Progressives Congress (APC) ticket, including Bola Tinubu."
  }
]