[
  {
    "headline": "Nnamdi Kanu: Court grants IPOB leader maximum comfort in detention, change of clothing — Lawyer",
    "summarized_story": "Barrister Aloy Ejimakor, a Special Counsel to the leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu, has given an insight into the recent court hearing of the IPOB leader on Wednesday.\nEjimakor said that the court stated, “That Mazi Kanu be given maximum comfort possible in the detention facility.\nAlso, Ejimakor stated that Mazi Kanu was not in court and there was no officer from the Department of State Service to explain why.\nThe court ruled that it will entertain all outstanding applications at the next hearing date, and proceeded to make the following Orders: That Mazi Kanu be given maximum comfort possible in the detention facility.\nThat he be allowed a change of clothing.”More so, the lawyer noted that the court gave the IPOB leader the nod to practice his Jewish faith."
  },
  {
    "headline": "CSO, monarchs, others brainstorm on communal clash, violence against women in Kaduna",
    "summarized_story": "Mercy Corps, an international human rights organisation, traditional rulers, security operatives, and other stakeholders have converged in Kaduna to brainstorm on ways to curb the troubling communal clash and violence against women in the state.\nUnder its Community Initiatives to Promote Peace Program, the Consultative Forum in the state was to mark the 16 Days of Activism to End Violence Against Women.\nIn attendance were the wife of the Kaduna state Governor, Ummi Nasir El-Rufai; the Commissioner of Internal Security and Home Affairs, Samuel Aruwan; the Executive Vice Chairman of the Kaduna State Peace Commission, Saleh Momale; and a Permanent Commissioner with the Kaduna State Peace Commission, Rebecca Sako- John; among others.\nAccording to CIPP Chief of Party at Mercy Corps, David Gatare, the programme was organised to lend a voice to the global call to End Violence Against Women.\nGatare said that the forum would create a platform for dialogue that seeks to end gender-based violence, promote positive male engagement, and promote peaceful and safe communities in Kaduna state."
  },
  {
    "headline": "Nnamdi Kanu absent as court hears his application to quash charge",
    "summarized_story": "By Ikechukwu NnochiriNnamdi KanuThe detained leader of the Indigenous People of Biafra, IPOB, Nnamdi Kanu, was on Thursday, absent, as the Federal High Court sitting in Abuja, commenced hearing on an application he filed to quash the treasonable felony charge the Federal Government preferred against him.\nKanu, in the application he filed through his team of lawyers led by Mr Ifeanyi Ejiofor, is asking the court to acquit and discharge him of all counts in the charge.\nHe argued that the court lacks the requisite jurisdiction to try him on the basis of a charge he said was grossly incompetent.\nThe embattled IPOB leader contended that there was no proof of evidence attached to the amended charge against him.\n“For today, we are focusing on the application for abridgment of the trial date and for the charge to be quashed."
  },
  {
    "headline": "Nnamdi Kanu’s emergency trial set to begin in a Federal High Court",
    "summarized_story": "The emergency trial of the Leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu is set to begin in a Federal High Court.\nAlthough the matter is yet to begin, Ifeanyi Ejiofor, who led Kanu’s legal team and Shuaibu Labaran who is expected to appear for the Attorney General of the Federation (AGF) are already seated for the proceeding.\nThe IPOB leader, who is facing terrorism charge, is yet to be brought to the court as at 9:54am.\nHowever, members of the media are also on ground for the coverage.\nVanguard News Nigeria"
  },
  {
    "headline": "Expansion in business conditions grow higher in November — Stanbic IBTC PMI",
    "summarized_story": "By Peter EgwuatuExpansion in business conditions were recorded in November this year, according to Stanbic IBTC Purchasing Managers Index, PMI, released yesterday.\nThe report stated that further robust expansions in output and new orders helped drive a pick-up in growth in the Nigerian private sector during the month.\nFirms were nevertheless committed to raising their inventory holdings in a bid to protect against future shortages and price hikes.\n“At 55.0 in November, up from 54.1 in October, the headline PMI signalled a solid expansion in business conditions, bringing the sequence of growth to 17 months.\nHigher sales to both international and domestic markets, as well as greater client requirements underpinned growth.”"
  },
  {
    "headline": "BAT yearly export from Nigeria to 14 Africa countries hit $110mn",
    "summarized_story": "•Launch N200m farmers fundBy Prince OkaforTHE British American Tobacco (BAT) Nigeria yearly export of tobacco from its facilities in the country to about 14 African countries has hit $110 million.\nThis is coming even as the company provided N200 million support to farmers that previously grew tobacco leaves in Oyo State.\nREAD ALSOFidelity Bank boss canvasses enabling environment for FDIsDisclosing these during the visit to the company’s factory in Ibadan by the Governor of Oyo State, Seyi Makinde, BAT’s Operation Director, Waseem Hayat, said, “We started operations with three markets in 2006, and currently we export tobacco to 14 countries in Africa.\n“We generate over $110 million in foreign exchange each year for our export to these countries.\nOur goal is to reduce health impact of business through the elimination of single use plastic and make all plastic packaging recyclable by 2025.”Speaking on the N200 million farmers fund, Yarub Al-Bahrani, the Area Director for BAT in West and Central Africa, stated that the fund was established by BAT as a social impact initiative for the benefit of rural smallholder farmers in the Oke-Ogun Area of Oyo State."
  },
  {
    "headline": "FG puts electricity subsidy cost at N1tn",
    "summarized_story": "Outlines strategy in power sector revampBy Ediri EjohThe Federal Government has hinted that its subsidy on electricity tariff is about N1.0 trillion between 2019 and 2021.\nThe amount represents the gap between the Cost Reflective Tariff (CRT) and Allowable Tariff (AT) which peaked at N28 per unit of electricity supplied to consumers.\nThis, according to the government, was largely responsible for liquidity crunch in the power sector as well as the poor power supply in the country.\nEssentially, after the last MYTO, cost reflective tariff became N55 and defective tariff that the DISCOs are allowed to charge was N49.\n“By January next year, after the review of the MYTO that tariff gap will be eliminated completely."
  },
  {
    "headline": "Osun to release teachers’ recruitment list",
    "summarized_story": "The Osun State Ministry of Education has announced that it is set to make public the list of successful applicants who scored a cumulative of 50 percent and above in the test and proficiency interview conducted for the recruitment of teachers in the state.\nAccording to the statement, “The Ministry of Education informs the general public particularly applicants for the teachers’ recruitment exercise that the list of successful applicants who scored a cumulative of 50% and above in the test and proficiency interview conducted is ready.\n“A total of 11,068 applicants participated in the interview out of which 3,170 applicants scored 50% (cumulative) and above.\nSubsequent batches will follow later.”Meanwhile, the opposition Peoples Democratic Party (PDP) in the state had criticised the state government on several occasions for playing politics with the teachers’ recruitment exercise.\nThe state government commenced the sale of teacher’s recruitment form for interested and qualified candidates in 2019 but the Coronavirus pandemic put a temporary stop to the process which was resuscitated in 2020 after the lockdown and restrictions were lifted."
  },
  {
    "headline": "140m Nigerians lack access to justice – Hague",
    "summarized_story": "About 140 million Nigerians are among the 5.1 billion people in the world that lack access to justice, Country Director, Hague Institute of Innovations of Law (HIIL), Mrs. Ijeoma Nwafor has said.\nShe said this while addressing the Justice Transformation Lab in Kaduna, adding that 11 million residents in Kaduna State also lacked access to justice.\nShe added, “We want to help 150 million Nigerians solve their most pressing justice problems by 2030.\nResponding, the Attorney General of Kaduna State and Commissioner for Justice, Mrs. Aisha Dikko, said that HIIL as an organization focuses on a user-friendly approach to provide access to justice.\nShe opined that the collaboration would support the justice sector in identifying key issues and practical solutions to the administration of justice in Kaduna State."
  },
  {
    "headline": "Job scarcity: Abiodun tells Igbesa poly graduands to think outside box",
    "summarized_story": "Governor Dapo Abiodun has advised the 2,347 graduating students of the Ogun State Institute of Technology (OGITECH), Igbesa, not to add to the growing rate of unemployment in Nigeria, asking them to think outside the box.\nAbiodun said this Wednesday at the polytechnic’s fourth convocation ceremony and conferment of awards for the 2019/2020 academic session.\n“Think outside the box of what you can do to become next employers and not as statistics to the growing rate of unemployment.\nMeanwhile, Gov Abiodun has given automatic employment to the best graduating student, David, in any establishment of his choice in Ogun.\n“The governor gave the best graduating student the opportunity of working in any establishment of his choice."
  },
  {
    "headline": "FCTA vows to pull down all buildings contrary to Abuja Master Plan",
    "summarized_story": "The Federal Capital Territory Administration (FCTA) on Thursday advised residents to build in accordance with the territory’s urban and regional plan to avoid altering the Abuja Master Plan.\n“I am making a fundamental appeal to residents of the Federal Capital Territory to work in accordance with the urban and regional planning act.\n“I have been working since 2019 as Chairman, Traffic Management Team, COVID-19 Enforcement, and Chairman City Sanitation.\nAttah also cautioned the public against building on waterways, flood-prone areas, as well as erecting shanties and illegal structures.\n“Those contravening the master plan by building illegal structures and shanties, we will give them notices, and when they fail to comply within the stipulated time, we will remove it in the interest of the public,” he said."
  },
  {
    "headline": "2023: We’ll teach APC lesson again in Adamawa – Gov Fintiri boasts",
    "summarized_story": "Governor Ahmadu Fintiri of Adamawa State says he and his party will once more teach opposition All Progressives Congress (APC) a lesson by ensuring that it fails badly in the 2023 election.\n“We will teach APC a bad lesson, they will lose all elections from Presidency to councillorship levels,” Fintiri said, adding that in the state, he would work harder to earn the people’s confidence.\nIn a reaction to Fintiri’s boast, the APC says it has learnt from its mistake and will be one united and victorious party in 2023.\nThe state APC Publicity Secretary, Mohammed Abdullahi, said the party had embarked on genuine reconciliation with aggrieved members ahead of its February national convention in the state.\n“By the time we are done with the reconciliation processes, APC will regain its lost glory,” Mohammed Abdullahi said."
  },
  {
    "headline": "INEC declares Soludo Anambra Gov-elect",
    "summarized_story": "The Independent National Electoral Commission (INEC) has declared candidate of the All Progressives Grand Alliance (APGA) Prof Charles Soludo winner of Anambra gubernatorial election.\nVice Chancellor, University of Calabar (UNICAL) and Returning Officer, Anambra governorship election, Prof Florence Obi, announced Soludo as the Governor-Elect at exactly 1:51 am.\nRead Also: BREAKING: Police, IPOB in three-hour gun duel in AnambraThe former Central Bank of Nigeria (CBN) Governor polled 112,229 votes to win the contest.\nValentine Ozigbo of the Peoples Democratic Party (PDP) came second with 53,807 votes.\n- Advertisement -Details shortly…"
  },
  {
    "headline": "NAPTIP received 30 petitions in 12 months in Anambra— commander",
    "summarized_story": "The National Agency for the Prohibition of Trafficking in Persons (NAPTIP) in Anambra said it received over 30 petitions within its 12 months of operation.\nMrs Judith Chukwu, Commander of the agency in the State disclosed this in an interview with newsmen in Awka, as part of the ongoing 16-Day Activism Against Gender-Based Violence.\nChukwu said some of the cases received by the agency included child exploitation; gender-based violence, child sexual exploitation, sale of human beings and babies, and violence against women.\nShe said it also received cases of irregular migration where young men were smuggled out of Nigeria through irregular means.\nThe commander said that NAPTIP was established to fight human trafficking, gender-based violence, and child exploitation with the right policies and strategies for combating the menaces."
  },
  {
    "headline": "274m people will be in need worldwide in 2022 – UN",
    "summarized_story": "274m people will be in need worldwide in 2022 – UNAbout 40 million more people worldwide are likely to be added to the number of those in need of humanitarian assistance or protection in 2022, according to United Nations (UN) estimates.\nThe United Nations is projecting 274 million people in need in 2022, up from 250 million in 2021, the United Nations Office for the Coordination of Humanitarian Affairs (OCHA) reported on Thursday.\nThey need a total of 41 billion dollars (36.3 billion euros), twice as much as four years ago.\nThe UN had asked for 37.7 billion dollars, but 20.5 billion dollars was still missing in mid-November.\nAfghanistan fared best, with 77 per cent of the original need of just under 870 million dollars covered."
  },
  {
    "headline": "I’ll never regret the love I gave anyone – Tonto Dikeh",
    "summarized_story": "Actress Tonto Dikeh has said she’s unrepentant over the love she’s ever given anyone whether or not it was reciprocated.\n“I’ll never regret the love I gave anyone, even if it wasn’t reciprocated.\nLove always comes back full circle, that love is coming back to me in some shape or form,” she said.\nThe mother of one also advised her fans to continue showing love as the universe will reimburse them with interest.\nShe wrote:“Keep putting love into the universe, cause it’s coming back with interest!!"
  },
  {
    "headline": "JUST IN: Former Senate President Wayas dies",
    "summarized_story": "Second Republic Senate President Dr Joseph Wayas is dead.\nDr. Wayas, who has been receiving medical attention for sometime, reportedly died in in a London hospital.\nHe lamented the passing of Wayas, describing his death as a monumental loss to Cross River State in particular and Nigeria as a whole.\nDr Wayas’ demise is indeed a monumental loss to our dear state and Nigeria,” Ayade was quoted as saying in the statement.\nAccording to the Governor: “As Senate President, Dr Wayas contributed to the deepening of Nigeria’s democratic ethos through his robust and vibrant leadership of the upper legislative chamber."
  },
  {
    "headline": "COVID-19: FG confirms Omicron in Nigeria, bars unvaccinated workers",
    "summarized_story": "By Chinelo Obogo, Aidoghie Paulinus, Fred Ezeh and Charity Nwakaudu, AbujaAnxiety has gripped Nigerians following the reported detection of the new COVID-19 variant, Omicron, in the country.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nAt the last count, over 22 countries have reported this variant, so where would the banning end if you start?\n“Twenty four hours before, we said with great confidence that there were no Omicron variant in the country, which was correct because we depended on the state of results at the time.\nHe spoke against the background of the latest mutation (Omicron) of COVID-19, which has triggered a wave of travel bans on some countries in Africa."
  },
  {
    "headline": "Fayemi, Jega decry state of nation",
    "summarized_story": "At a summit on national unity organised in Abuja by National Prosperity Movement, Fayemi said: “To be sure, unity cannot endure where injustice, exclusion, inequity and marginalisation are embedded in the practice of governance.\n“In any case, the attention paid to the question of national unity and integration by successive military regimes has not been matched by successive civilian administrations.\nHe believed that “at the core of national unity are non-discriminatory relations whether at the personal or official levels.\n“But the Nigerian state is not in its most healthy state.\nSomething is wrong with Nigeria,” Kukah also said."
  },
  {
    "headline": "NSA calls for right laws to fight cyber crimes",
    "summarized_story": "The National Security Adviser (NSA), retired Maj.-Gen. Babagana Monguno, yesterday, called on the legislature to enact laws to address cyber threats.\nHe made the call at a two-day “Awareness and Sensitisation Workshop for Judiciary and National Assembly on the implementation of Nigeria’s National Cyber Security Policy and Strategy (NCPS) 2021.\nThe NSA was represented by the Director of Policy and Strategy, Office of the National Security Adviser (ONSA), Amb.\nMonguno said the emergence of cyberspace technology was accompanied by inherent challenges, including threat to national security, cyberspace operations and negative impact on critical infrastructure.\nHe added that the workshop should provide modalities for implementing the action plans by various establishments towards protecting the nation’s infrastructures against cyber attacks."
  },
  {
    "headline": "Buhari to Ramaphosa: Let’s enhance people-to-people relations, avoid unhealthy competition",
    "summarized_story": "From Juliana Taiwo-Obalonye, AbujaPresident Muhammadu Buhari has called for stronger emphasis on people-to-people relations between South Africa and Nigeria to evolve a bond that would be of benefit to both countries and the continent.\nAt the 10th session of Nigeria-South Africa Bi-National Commission (BNC), President Buhari said: “Mr.\nWe need to ensure that our people-to-people relations are enhanced to a point where there would be no need for unhealthy competition.\n“Similarly, our two countries have established high level official communication channels for diplomatic consultations, trade and investment, and will, shortly, inaugurate the Nigeria – South Africa Youth Dialogue.\nThe resulting damage to this travel ban to the economies of the countries affected will be considerable and long lasting."
  },
  {
    "headline": "Court dismisses suit seeking Soludo’s disqualification as Anambra gov-elect",
    "summarized_story": "Abuja division of the Federal High Court has dismissed a suit seeking the disqualification of former governor of the Central Bank of Nigeria, Charles Soludo as the Anambra governor-elect on the platform of All Grand Progressive Alliance (APGA).\nJustice Taiwo Taiwo, in a judgment delivered, yesterday, in a suit filed by two voters in Anambra, Adindu Valentine and Chukwuebuka Egwudike, described the suit as frivolous, irritating, baseless and lacking in merit.\nThe judge accused the two plaintiffs of seeking to use court as a tool to scuttle democracy and awarded a punitive cost of N2 million against them to be paid to Soludo and his deputy, Onyeka Ibezim.\nBreaking News, Nigerians can now work in Nigeria and get paid in US Dollars Click here to apply today .\nDefendants in the suit are INEC, APGA, Soludo and Ibezim."
  },
  {
    "headline": "Buhari Meets Ramaphosa, Calls for End to ‘Rivalry’ Between Nigeria and S’Africa",
    "summarized_story": "During the session at State House, Abuja, Buhari underlined Nigeria’s commitment to a “special relationship” with South Africa.\nSimilarly, our two countries have established high level official communication channels for diplomatic consultations, trade and investment, and will, shortly, inaugurate the Nigeria – South Africa Youth Dialogue.\nHe stated, ”Nigeria and South Africa have a combined population of about 262 million, of which 95 million are youth.\nI equally wish to thank members of the South African delegation and the experts that worked tirelessly during the Senior Officials Meeting.\n“Today, we also jointly launched the Nigeria-South Africa Youth Dialogue, another veritable tool for interaction among our youth with the aim of creating shared values and aspiration."
  },
  {
    "headline": "White Paper Complied with Law on #EndSARS Report, Says Lagos AG",
    "summarized_story": "So, it is not that Lagos State Government just conjured things from the air.\nHis words: “The federal government never put the Lagos State Government under any pressure to discredit the panel or anybody.\n“Even yesterday, in his speech, which he made before the White Paper was released, he thanked them again.\nLagos State Government has fulfilled all its promises to the public.\nWe set up an independent panel, we said we will release a White Paper and we did."
  },
  {
    "headline": "UBA Wins ‘African Bank of the Year’ Award",
    "summarized_story": "Nume EkegheThe United Bank for Africa (UBA) Plc has disclosed that it has been globally recognised as the African Bank of the year 2021 by the Banker Magazine, a leading global finance news publication published by the Financial Times of London.\nIt revealed that UBA Nigeria Plc, UBA Benin, UBA Burkina Faso, UBA Cameroon, UBA Chad, UBA Congo Brazzaville, UBA Cote D’Ivoire, UBA Gabon, UBA Guinea, UBA Liberia, UBA Senegal, UBA Sierra Leone and UBA Zambia all came out top as the best banks in their respective countries.\nIn 2020, six of its subsidiaries in Benin, Cote D’Ivoire, Chad, Liberia, Sierra Leone and Zambia were winners of the Best Bank award.\n“This year, the UBA Group is breaking a record with its exceptional wins as African Bank of the Year and Bank of the year in 13 countries.\n“While several African banks impressed the judges this year, there was no doubt as to the worthiest recipient of the Bank of the Year for Africa – UBA Group – a clear winner across a wide range of criteria."
  },
  {
    "headline": "Onigbanjo: Lagos Will Make Full #EndSARS Panel Report Public",
    "summarized_story": "Moyosore Onigbanjo (SAN) is the Attorney General and Commissioner for Justice in Lagos State.\nOnigbanjo insists that the report of the panel remains inconsistent, saying that to clear all doubts, the government will soon make the full document available to the public.\nThe position of Lagos state government is based entirely on the report submitted by the panel itself.\nIt is the position of the Lagos state government that there was no massacre at the Lekki Tollgate.\nThe position of the Lagos state government is based on the findings of the panel itself."
  },
  {
    "headline": "Breaking: Scores of Workers Shut out as FG Begins Enforcement of Vaccine Mandate",
    "summarized_story": "Olawale Ajimotokan in AbujaMany returning federal civil servants on Grade Level 12 and below were barricaded from entering the Federal Secretariat on Wednesday for failure to present proof of vaccination against COVID-19.\nBut scores of them were shut out for failing to present evidence of COVID-19 vaccination or present negative COVID-19 PCR test result done within 72 hours.\nThe commotion at the secretariat followed the enforcement of new Vaccine Mandate Policy which came into effect Wednesday.\nHowever, union leaders in the Office of the Head of Service went into discussions with the top civil service management on how to allow the workers in.\nThe President Joint Unions Negotiating Team Office of Head of Service, Comrade Uzo Ekediachi addressed the workers Wednesday."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Secret Police, DSS Spends N500million On Each Nnamdi Kanu’s Court Appearance",
    "summarized_story": "Nigeria’s secret police, Department of State Services (DSS), spends a minimum of N500 million each day it brings the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, to court, top sources have told SaharaReporters.\nThe huge amount, it was gathered, goes into providing logistics including adequate security around the movement of the IPOB leader from DSS’ facility to the court and back to the place.\n“The amount spent to bring Kanu to court for each appearance is huge.\nOn Wednesday, SaharaReporters revealed in a report that an emergency hearing that could lead to Kanu’s release on bail had been scheduled for Thursday (today).\nHe was granted bail in April 2017 for health reasons but skipped bail after flouting some of the conditions given to him by the court."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Secret Police, DSS Spends N500million On Each Nnamdi Kanu’s Court Appearance",
    "summarized_story": "Nigeria’s secret police, Department of State Services (DSS), spends a minimum of N500 million each day it brings the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, to court, top sources have told SaharaReporters.\nThe huge amount, it was gathered, goes into providing logistics including adequate security around the movement of the IPOB leader from DSS’ facility to the court and back to the place.\n“The amount spent to bring Kanu to court for each appearance is huge.\nOn Wednesday, SaharaReporters revealed in a report that an emergency hearing that could lead to Kanu’s release on bail had been scheduled for Thursday (today).\nHe was granted bail in April 2017 for health reasons but skipped bail after flouting some of the conditions given to him by the court."
  },
  {
    "headline": "EXCLUSIVE: Nigeria's Secret Police, DSS Spends N500million On Each Nnamdi Kanu’s Court Appearance",
    "summarized_story": "Nigeria’s secret police, Department of State Services (DSS), spends a minimum of N500 million each day it brings the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu, to court, top sources have told SaharaReporters.\nThe huge amount, it was gathered, goes into providing logistics including adequate security around the movement of the IPOB leader from DSS’ facility to the court and back to the place.\n“The amount spent to bring Kanu to court for each appearance is huge.\nOn Wednesday, SaharaReporters revealed in a report that an emergency hearing that could lead to Kanu’s release on bail had been scheduled for Thursday (today).\nHe was granted bail in April 2017 for health reasons but skipped bail after flouting some of the conditions given to him by the court."
  },
  {
    "headline": "We'll Regulate Netflix, Other Streaming Services, They May Cause Chaos—Buhari's Minister, Lai Mohammed",
    "summarized_story": "The Nigerian Government has revealed plans to regulate streaming and content providers such as Netflix, as it argued that they can be exploited to “cause chaos” and undermine Nigeria’s democratic processes.\nIn his opening address, Adedayo Thomas, Executive Director and CEO of the NFVCB, said the conference was to brainstorm on creating policies to regulate streamers and content providers in Nigeria.\nThe NFVCB helmsman said streaming service providers were unable to self-regulate, reason why their operations were now being discussed at the conference with the theme, “Nigeria Digital Content Regulation”.\nParticipants include members of the various Guilds in Nollywood which included the Actors Guild of Nigeria (AGN) and Directors Guild of Nigeria (DGN).\nAlso were representatives of local and international streaming services, Free To Air (FTA), Pay TV operators and other content creators."
  },
  {
    "headline": "We'll Regulate Netflix, Other Streaming Services, They May Cause Chaos—Buhari's Minister, Lai Mohammed",
    "summarized_story": "The Nigerian Government has revealed plans to regulate streaming and content providers such as Netflix, as it argued that they can be exploited to “cause chaos” and undermine Nigeria’s democratic processes.\nIn his opening address, Adedayo Thomas, Executive Director and CEO of the NFVCB, said the conference was to brainstorm on creating policies to regulate streamers and content providers in Nigeria.\nThe NFVCB helmsman said streaming service providers were unable to self-regulate, reason why their operations were now being discussed at the conference with the theme, “Nigeria Digital Content Regulation”.\nParticipants include members of the various Guilds in Nollywood which included the Actors Guild of Nigeria (AGN) and Directors Guild of Nigeria (DGN).\nAlso were representatives of local and international streaming services, Free To Air (FTA), Pay TV operators and other content creators."
  },
  {
    "headline": "'Prison not 5-star hotel' -- judge orders DSS to allow Kanu maximum possible comfort",
    "summarized_story": "A federal high court in Abuja has ordered the Department of States Services (DSS) to allow Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), to have the “maximum possible comfort” in its facility.\nHis lawyers have consistently complained that about the poor conditions the IPOB leader is allegedly being subjected to.\nRuling on the application, Binta Nyako, the presiding judge, said a custodial centre is not a “five-star hotel” where he can receive maximum comfort.\nThe judge however ordered the DSS to provide Kanu with the “maximum possible comfort”.\nThe IPOB leader has pleaded not guilty to all the charges."
  },
  {
    "headline": "'Prison not 5-star hotel' -- judge orders DSS to allow Kanu maximum possible comfort",
    "summarized_story": "A federal high court in Abuja has ordered the Department of States Services (DSS) to allow Nnamdi Kanu, leader of the Indigenous People of Biafra (IPOB), to have the “maximum possible comfort” in its facility.\nHis lawyers have consistently complained that about the poor conditions the IPOB leader is allegedly being subjected to.\nRuling on the application, Binta Nyako, the presiding judge, said a custodial centre is not a “five-star hotel” where he can receive maximum comfort.\nThe judge however ordered the DSS to provide Kanu with the “maximum possible comfort”.\nThe IPOB leader has pleaded not guilty to all the charges."
  },
  {
    "headline": "Joseph Wayas, former senate president, is dead",
    "summarized_story": "Joseph Wayas, a former president of the senate in the Second Republic, has died at the age of 80.\nBen Ayade, Cross River governor, was quoted as saying Wayas’ death is a “monumental loss” to the state and Nigeria.\nAdvertisement“As a state, Cross River is in pains as we mourn the passing of our illustrious son.\n“As Senate President, Dr Wayas contributed to the deepening of Nigeria’s democratic ethos through his robust and vibrant leadership of the upper legislative chamber.\nWayas, born May 21, 1941, served as Nigeria’s senate president between 1979 and 1983."
  },
  {
    "headline": "Joseph Wayas, former senate president, is dead",
    "summarized_story": "Joseph Wayas, a former president of the senate in the Second Republic, has died at the age of 80.\nBen Ayade, Cross River governor, was quoted as saying Wayas’ death is a “monumental loss” to the state and Nigeria.\nAdvertisement“As a state, Cross River is in pains as we mourn the passing of our illustrious son.\n“As Senate President, Dr Wayas contributed to the deepening of Nigeria’s democratic ethos through his robust and vibrant leadership of the upper legislative chamber.\nWayas, born May 21, 1941, served as Nigeria’s senate president between 1979 and 1983."
  },
  {
    "headline": "Kano APC crisis worsens as 'thugs' set ablaze office of Shekarau faction",
    "summarized_story": "The campaign office of Barau Jibrin, a key member of the All Progressives Congress (APC) in Kano state, was razed by thugs in the early hours of Thursday.\nAdvertisementJibril, a senator representing Kano North senatorial district, belongs to the Kano APC faction loyal to Ibrahim Shekarau, a former governor of the state.\nAdvertisementThe arsonists are alleged to be members of the faction loyal to Abdullahi Ganduje, governor of Kano.\nAdvertisementThe Shekarau faction had elected Haruna Danzago as chairman while Ganduje’s camp elected Abdullahi Abbas.\nThe Shekarau faction has since instituted a case in court challenging the decision of the national caretaker committee."
  },
  {
    "headline": "MTN Nigeria issues 575m shares through digital public offer",
    "summarized_story": "Nigeria’s biggest telco, MTN Nigeria, has announced that starting from Wednesday, 1 December 2021, retail investors can purchase up to 575 million shares held in MTN Nigeria at ₦169 per share—lower than its share price on the stock market.\nThis public offer is in line with MTN Group’s commitment to reduce its shareholding in MTN Nigeria from 78.8% to 65% over time.\nNotably, this public offer is primarily digital as the shares can be purchased online.\nBolaji Balogun, CEO of Chapel Hill Denham, an investment banking firm leading the public offering, explained this to TechCabal.\nIn response to this public offering announcement, MTN Nigeria’s share price fell 10% on Wednesday to a five-week low, a logical response as investors rushed to buy the lower-priced MTN public offering shares."
  },
  {
    "headline": "Herconomy raised $600,000 in a day. Here's how they did it",
    "summarized_story": "The book was a culmination of all the opportunities Durosinmi-Etti had been sharing on her personal Instagram profile for months.\n“I just wanted to create a place where women could get access to opportunities, grants and fellowships,” Durosinmi-Etti told TechCabal in an interview.\nThe startup plans to introduce financial services to its community members which it believes will be of great benefit to them.\nWithin a day, as Durosinmi-Etti explains, she got “hundreds of responses” from community members who were interested in investing.\nThey did this because it was extremely important for their community members to be part of this raise."
  },
  {
    "headline": "Nigeria’s Payourse secures $600k pre-seed to accelerate crypto adoption across Africa",
    "summarized_story": "But as good as this may sound, navigating through most of the available crypto products still feels like Chinese arithmetic to many Africans.\nAnd this experience is shutting out a large number of Africans from the crypto economy, thereby hindering even wider adoption.\nOne of them, Payourse, a Lagos-based blockchain startup that builds user-friendly products and tools to accelerate the adoption of crypto in Africa, has secured a $600,000 pre-seed investment to scale its products, hire more talent and expand into new markets.\nBut because of its seamless experience, Coinprofile began to gain traction among crypto users.\nUnlike other companies that charge fees on every transaction, Coinprofile doesn’t charge users on a transaction."
  },
  {
    "headline": "What to know about spectrum auctions as Nigeria plans 5G",
    "summarized_story": "Read also: Techmarket launches digital innovation for better customer communicationA trail of spectrum auctions in NigeriaNigeria has had several spectrum auctions.\nOnly MTN indicated an interest in applying for six lots out of the available 14 slots in the 2.6GHz spectrum licence.\nThe companies that received the licence include XS Broadband Limited, Witel Limited, Rainbownet Limited, Odua Telecoms Limited, Cyberspace Limited, ipNX Nigeria Limited, and Wideaways Nigeria Limited.\nOthers include Hyperia Limited, Mega-Tech Engineering Nigeria Limited, Sirius Wireless Limited, Horizon Broadcasting and Telecommunications Limited, and Swift Networks.\nThe high price may be the reason local telecom operators like 9Mobile and Globacom have yet to submit a bid for the 5G spectrum licence."
  },
  {
    "headline": "Emirates to resume daily flight to Nigeria Dec. 5",
    "summarized_story": "Emirates will resume its passenger operations between Dubai and Nigeria from 5 December 2021, offering customers enhanced connectivity to and through Dubai.\nThe return flight, EK 786 will take off from Abuja at 1900, arriving in Dubai at 0435hrs the next day.\nEmirates flight EK 783 to Lagos will depart Dubai at 1030hrs, arriving in Lagos at 1540hrs.\nThe return flight EK 784 will depart Lagos at 1810hrs, arriving in Dubai at 0415hrs the next day.\n” Travellers coming from Nigeria will also need to take another Covid-19 PCR test on arrival at Dubai International Airport,” the airline stated."
  },
  {
    "headline": "Subsidy removal: Govt, citizens must agree – World Bank",
    "summarized_story": "The Nigerian government and the citizens must agree on the removal of petrol subsidy that will cost Nigeria over N3 trillion by the end of 2021, World Bank Country Director for Nigeria, Shubham Chaudhuri has said.\nRead Also: Nigeria’s N3trn petrol subsidy widens deficit Eurobond can’t fund“People are aware of the social risk of civil unrest attached to the removal of subsidy,” Chaudhuri said.\n“Nigeria’s fiscal position is deteriorating, resulting in higher debt and less space for investments in human capital and infrastructure,” the World Bank said.\nIn 2022, the petrol subsidy could cost N13, 000 per person, the World Bank said in its latest report.\nThe global bank raised concerns that the subsidy mostly benefits the rich and those who smuggle petrol to neighbouring countries."
  },
  {
    "headline": "Coy Mulls Edo Music Legends Estate in Benin – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Lucky Construction and Special House Ltd. Company has concluded plans to facilitate the construction Edo Music Legends Estate in Benin City, Edo State.\nThe estate, the Project Manager, Innocent Ikechukwu quoted Mr Okungbowa Lucky Alfred as saying would create an inspiring legacy towards safeguarding their personal values, when fully implemented.\nAs hope beckons towards finding an enduring solution in this regards, there are just few initiatives that are sending some signals toward expanding their growth and sustaining their resources in the long run.\nIkechukwu said that the Music Legends look forward to a partnership with individuals and cooperate bodies it can ascribe some credits to.\nAccording to him, some brands who have been spearheading the protection of the legacies of Edo Music Legends."
  },
  {
    "headline": "Edo gets N2.5bn grant from ASR Africa for equipping Stella Obasanjo hospital – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Government has received a total of N2.5 billion grant from the Abdul Samad Rabiu Africa Initiative for the Tertiary Health System Support Scheme, which according to Governor Godwin Obaseki, will be used to equip the Stella Obasanjo Hospital, in Benin City.\nWe are determined to make Edo a healthcare hub in Nigeria.\nThe healthcare system is really about the people.\n“I want to thank and appreciate you and the people of Edo will eternally be grateful.\nI want to assure you that this is the beginning of a partnership between ASR and the Edo State Government,” he said."
  },
  {
    "headline": "Digital economy: Edo, Udacity seal deal to train 1,000 youths – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestBENIN CITY – The Edo State Governor, Godwin Obaseki has said the state has entered into a partnership with Udacity Incorporated to train not less than 1,000 youths to exploit opportunities in the digital economy.\nThe governor said this during the formal signing of the deal between the state government and the global in-demand technological learning platform, at the Government House in Benin City, Edo State.\nAccording to Obaseki, “Our emphasis for this first cohort would be 100 percent female participation for rural communities in Edo State.\nDare said the partnership is codenamed EdoWorX and is a component of EdoJobs Supertechies Project, designed to develop the next generation of digital professionals.\nWith this, we have online learning and remote work, which should be encouraged and supported,” Dare added."
  },
  {
    "headline": "COAS approves indigenous production of 10,000 Combat Tactical Vests – Nigerian Observer",
    "summarized_story": "Share FacebookTwitterStumbleuponLinkedInPinterestLAGOS – The Chief of Army Staff (COAS) Lt.-Gen. Faruk Yahaya on Wednesday said that he had approved the production of 10,000 units of RICKSHAW Combat Tactical Vests for effective operations of the Nigerian Army (NA).\nThe conference with theme: ‘Repositioning Nigerian Army Ordnance Corps in Providing Effective Service Delivery Towards Sustaining Nigerian Army Assigned Missions.’ will hold from Dec. 1 to Dec. 2.\n“Therefore, the NAOC has recently been mandated to produce RICKSHAW Combat Tactical Vests through its Kit Factory for the NA.\n“I assure my unwavering support to all ingenious efforts toward providing effective service delivery and logistics to the NA in all its operations,” Yahaya said.\nThe COAS expressed his gratitude to President Muhammadu Buhari for his strategic guidance and unrelenting support to the Nigerian Army."
  },
  {
    "headline": "Joseph Wayas, former senate president, dies at 80",
    "summarized_story": "A former Nigerian Senate President, Joseph Wayas, has died, aged 80.\nWayas who was senate president of the senate in the Second Republic during the tenure of Alhaji Shehu Shagari.\n“As a state, Cross River is in pains as we mourn the passing of our illustrious son.\n“As Senate President, Dr Wayas contributed to the deepening of Nigeria’s democratic ethos through his robust and vibrant leadership of the upper legislative chamber.\nWayas, born May 21, 1941, served as Nigeria’s senate president between 1979 and 1983."
  },
  {
    "headline": "Office of Ibrahim Shekarau’s Kano APC faction set ablaze",
    "summarized_story": "The office of a faction of the All Progressives Congress (APC) loyal to former governor of the state, Ibrahim Shekarau in Kano has been set ablaze by some protesters.\nThe building, located at Tarauni LGA of the state, serves as the meeting point of the State APC faction led by the former governor.\nThe Shekarau faction had elected Haruna Danzago as chairman while Mr Ganduje’s camp elected Abdullahi Abbas.\nOn Tuesday, the Federal High Court in Abuja granted the requests and upheld the congresses conducted by the Shekarau faction.\nThe judge also made an order restraining the Ganduje faction from appointing a new executive."
  },
  {
    "headline": "NGX Celebrates MTN Public Offer, Says It Remains Preferred Listing Destination",
    "summarized_story": "Nigerian Exchange Limited (NGX) says it has continued to be the preferred listing destination for companies seeking to raise capital via corporate bonds, equities and even private companies looking to raise public capital.\nAlso notable is BUA Cement’s debut listing of a N115 billion Bond issue, the largest of many corporate debt issuances in the history of the Nigerian capital market.\nAttention has now shifted to the equities market where MTNN will float the first Public Offer of 2021.\nThe offer commenced by way of a book build to institutional investors (Institutional Offer), and subsequently, a fixed price to retail investors (Retail Offer).\nThe Institutional Offer opened on 23 November 2021 to close on 26 November 26, after which a fixed price will be determined for the Retail Offer."
  },
  {
    "headline": "Glo Battle of the Year Nigeria auditions begin in Abuja on Thursday",
    "summarized_story": "Glo Battle of the Year Nigeria will on Thursday in Abuja begin auditions to select the most talented dancers and dance crews who have what it takes to represent Nigeria on the world stage.\nThe auditions will be held at Hotel Interconnect, Abuja, on Thursday, December 2, and Friday, December 3, for all shortlisted contestants from Kaduna and Abuja respectively.\nAccording to Globacom, the aim of the auditions is to hunt for talented youths from the various zones of the country for the finals of the competition.\nDance is a core passion of many Nigerian youths who are also our customers.\nWinners across seven dance categories in Glo Battle of the Year Nigeria will win mega millions and other mouth-watering prizes, including the opportunity to represent Nigeria at the international Battle of the Year competition."
  },
  {
    "headline": "2nd Republic Senate President, Joseph Wayas, Is Dead",
    "summarized_story": "Senate President in the Second Republic, Dr. Joseph Wayas, has passed away.\nHe died on Thursday morning in London, United Kingdom.Dr Wayas was Senate President from 1979-1983.\nHe was born on May 21, 1941 in Basang Obudu, Cross Rivers State.\nHe was deputy chairman of the 1994 national constitution conference that organised the national conference.\nHe was fluent in Jausa, Igbo and Yoruba languages having married a yoruba woman as first wife."
  },
  {
    "headline": "2nd Republic Senate President, Joseph Wayas, Is Dead",
    "summarized_story": "Senate President in the Second Republic, Dr. Joseph Wayas, has passed away.\nHe died on Thursday morning in London, United Kingdom.Dr Wayas was Senate President from 1979-1983.\nHe was born on May 21, 1941 in Basang Obudu, Cross Rivers State.\nHe was deputy chairman of the 1994 national constitution conference that organised the national conference.\nHe was fluent in Jausa, Igbo and Yoruba languages having married a yoruba woman as first wife."
  },
  {
    "headline": "Kanu To Appear In Court Thursday",
    "summarized_story": "The trial of detained leader of the outlawed Indigenous People of Biafra (IPOB), Nnamdi Kanu, will this Thursday continue before a Federal High Court in Abuja.\nLEADERSHIP learnt of moves to give the IPOB leader a soft landing since after some respected Igbo leaders appealed to President Muhammadu Buhari to release Kanu.\nThe emergency court session billed for this Thursday, LEADERSHIP further gathered, may be part of the moves.\nADVERTISEMENTThe IPOB leader is currently standing trial at the court for terrorism-related charges.\nKanu was arrested in Kenya and was repatriated to Nigeria in June 2021, to continue his trial having jumped bail."
  },
  {
    "headline": "Kanu To Appear In Court Thursday",
    "summarized_story": "The trial of detained leader of the outlawed Indigenous People of Biafra (IPOB), Nnamdi Kanu, will this Thursday continue before a Federal High Court in Abuja.\nLEADERSHIP learnt of moves to give the IPOB leader a soft landing since after some respected Igbo leaders appealed to President Muhammadu Buhari to release Kanu.\nThe emergency court session billed for this Thursday, LEADERSHIP further gathered, may be part of the moves.\nADVERTISEMENTThe IPOB leader is currently standing trial at the court for terrorism-related charges.\nKanu was arrested in Kenya and was repatriated to Nigeria in June 2021, to continue his trial having jumped bail."
  },
  {
    "headline": "CBN battles to save naira, as external reserves lost $610m in Nov",
    "summarized_story": "The nation’s external reserves fell by $610m last month, figures obtained from the Central Bank of Nigeria on Thursday revealed.\nThe reserves dropped to N$41.22bn as of November 29 from $41.83bn on October 29.\nThe CBN also disclosed that at the present level, the external reserves could meet the country’s nine-month import demand.\nFigures obtained from the apex bank showed that the reserves, which had gained $5bn in October, returned to a downward path in November.\nEmefiele said supply was also affected by massive outflow of foreign portfolio investments from emerging and frontier markets, including Nigeria in 2020."
  },
  {
    "headline": "CBN battles to save naira, as external reserves lost $610m in Nov",
    "summarized_story": "The nation’s external reserves fell by $610m last month, figures obtained from the Central Bank of Nigeria on Thursday revealed.\nThe reserves dropped to N$41.22bn as of November 29 from $41.83bn on October 29.\nThe CBN also disclosed that at the present level, the external reserves could meet the country’s nine-month import demand.\nFigures obtained from the apex bank showed that the reserves, which had gained $5bn in October, returned to a downward path in November.\nEmefiele said supply was also affected by massive outflow of foreign portfolio investments from emerging and frontier markets, including Nigeria in 2020."
  },
  {
    "headline": "Kidnappers are now considered terrorists – FG",
    "summarized_story": "The Minister of Justice and Attorney-General of the Federation, Abubakar Malami (SAN), has said kidnappers have also been declared as terrorists.\nHe said the recent court declaration had been gazetted and would soon be published.\nA Federal High Court sitting in Abuja had on Thursday last week declared bandits as terrorists.\nJustice Taiwo Taiwo had, in a ruling, declared activities of Yan Bindiga and Yan Ta’adda bandit groups as acts of terrorism.\nThe minister also noted that he would be guided by public interest in advising the President on the bill."
  },
  {
    "headline": "Kidnappers are now considered terrorists – FG",
    "summarized_story": "The Minister of Justice and Attorney-General of the Federation, Abubakar Malami (SAN), has said kidnappers have also been declared as terrorists.\nHe said the recent court declaration had been gazetted and would soon be published.\nA Federal High Court sitting in Abuja had on Thursday last week declared bandits as terrorists.\nJustice Taiwo Taiwo had, in a ruling, declared activities of Yan Bindiga and Yan Ta’adda bandit groups as acts of terrorism.\nThe minister also noted that he would be guided by public interest in advising the President on the bill."
  },
  {
    "headline": "Joseph Wayas ex-Senate President is dead, Ayade mourns",
    "summarized_story": "Second Republic Senate President in Nigeria, Dr. Joseph Wayas is dead.\nHis death, which happened in London, was confirmed by Governor Ben Ayade of Wayas home state of Cross River.\n“As a state, Cross River is in pains as we mourn the passing of our illustrious son.\n“As Senate President, Dr Wayas contributed to the deepening of Nigeria’s democratic ethos through his robust and vibrant leadership of the upper legislative chamber.\nWayas was born in Basang, Obudu, Cross River State on 21 May 1941 and attended the Dennis Memorial Grammar School, Onitsha."
  },
  {
    "headline": "Pope Francis begins visit to Cyprus, Greece",
    "summarized_story": "Amongst them were some of those who Pope Francis brought back aboard the papal plane after his visit to Lesbos in April 2016.\nPope Francis’ 35th Apostolic journey, December, will see him visit Cyprus and Greece – two countries at the frontline of migratory routes for people fleeing their countries for Europe.\nEcumenical relations with the Orthodox Churches in the two countries will also be a highlight of Pope Francis’ visit.\nOn Saturday, Pope Francis will leave Cyprus for Athens, Greece, for the second leg of his visit which will last till Monday.\nAfter meeting with young people in Athens on Monday morning, Pope Francis is scheduled to return to the Vatican."
  },
  {
    "headline": "INEC Breaks Silence On Buhari’s Letter On Electoral Act",
    "summarized_story": "The Independent National Electoral Commission (INEC) has spoken out after receiving a letter from President Muhammadu Buhari (retd.)\nBut reacting to the President’s letter on Wednesday, INEC National Commissioner and chairman of its Information and Voter Education Committee, Festus Okoye, said its position constitutionally, legally and administratively was that the electoral management body is the end user of the electoral legal framework.\nHe said the regulations and guidelines of the commission are drawn from the Electoral Act and without a new electoral legal framework, the work of the commission will be tentative and that will not be good for the electoral process.\nHe said, “However, it is difficult at this stage to speculate on the cost implications of direct primaries.\n“Moreover, direct primaries have been a feature of our electoral legal framework."
  },
  {
    "headline": "Covid19 Omicron: AU Kicks Against Travel Ban On African Countries.",
    "summarized_story": "Chairperson of the African Union Commission, Moussa Faki Mahamat has said the travel ban on southern African countries due to COVID-19 Omicron variant is a form of stigmatisation against Africa.\nMahamat said this while reacting to the travel ban on the Southern Africa countries at a news conference at the UN headquarters in New York on Wednesday, NAN reports.\nMahamat described the travel ban as stigmatisation which could not be justified scientifically or on the grounds of reason logically.\nMahamat said, “As I was saying to the Secretary-General, we need to be collectively outraged as leaders in the African Union and as the United Nations.\n“That’s the very least we can ask for, namely from our leaders, our political and social leaders,’’ he said."
  },
  {
    "headline": "IPOB:Nnamd Kanu’s Lawyers Storm Abuja Court Ahead Of Today’s Bail Battle",
    "summarized_story": "The attorneys for Nnamdi Kanu, the leader of the Indigenous People of Biafra IPOB, have stormed the Federal High Court in Abuja ahead of the court struggle for bail later today.\nMr Ifeanyi Ejiofor’s legal team appeared at the court as early as 8 a.m., with over 50 others already inside.\nBut for the presence of Kanu’s lawyers, there has been nothing to suggest that the IPOB leader would be brought to court.\nNEWS DIRECT, however, gathered that Kanu’s bail motion would be entertained by Justice Binta Nyako later in the day after attending to regular matters slated for the day.\nOur correspondent also gathered that the Judge has instructed that the court room be cleaned before Kanu’s matter would be called."
  },
  {
    "headline": "Lagos Hoodlums Hack NURTW Boss At Home, Shoot Him Dead In Hospital",
    "summarized_story": "The party held last Saturday on Ijikoyijo Street, Ijeshatedo, where Kunle was the vice-chairman of the NURTW.\nWhile one of the gang members was led by a man identified as My Son, the other gang was led by a transport worker identified as Kolom.\nKehinde said trouble started when one Malik, a member of Kolom’s gang, started misbehaving after drinking to a stupor around 10pm.\nHe claimed that Malik’s action infuriated members of the other gang, which led to a fight between the groups.\n“After the attack at the hospital, my brother’s friends rushed him to the Adetutu Hospital on Kosoko Street in Ijesha."
  },
  {
    "headline": "Breaking: IPOB leader, Nnamdi Kanu, set to appear in court Thursday",
    "summarized_story": "As against the January date slated for continuation of his trial by Justice Binta Nyako of the Federal High Court in Abuja, there are indications that IPOB self acclaimed leader, Mazi Nnamdi Kanu, may appear in court on Thursday December 2, 2021.\n“We wish to inform Biafrans, friends of Biafra and lovers of freedom that our Leader, Mazi Nnamdi Kanu will be in court tomorrow, December 2, 2021 in Abuja.\nBiafrans resident in Biafra land as well as visitors to Biafra land are free to go about their lawful businesses without fear of molestations or intimidation.\nAgain, there will be no lockdown in Biafra land for tomorrow’s court appearance of our Leader.\n“We all know that our Leader, Mazi Nnamdi,lĺ is not being persecuted because of any crime other than his fight for our collective freedom."
  },
  {
    "headline": "As Ramaphosa visits Buhari: Nigeria announces 3 Omicron COVID-19 cases",
    "summarized_story": "President Muhammadu Buhari has described the state visit of President Cryil Ramaphosa of South Africa as successful despite the scare generated by the new Omicron COVID-19 variant.\nAnd while the South African leader was visiting, the Nigerian authority announced three new cases of the variant and 105 COVID-19 cases.\nDespite the scare generated by the new COVID-19 variant, we have been able to hold successful meetings, while observing strict COVID-19 protocols, through fraternal cooperation and understanding.\nI equally wish to thank members of the South African delegation and the experts that worked tirelessly during the Senior Officials Meeting.\nIt listed the states that recorded the new COVID-19 cases to include Lagos (43), Gombe (21), FCT (16), Niger (10), Rivers (6), Plateau (5), Edo (2), Bauchi (1), and Kano (1)."
  },
  {
    "headline": "Ethno-religious elite, parochial leaders behind nation’s crisis – Jega",
    "summarized_story": "…Says challenges undermining national unity can no longer be ignoredThe immediate past chairman of the Independent National Electoral Commission (INEC), Professor Attahiru Jega, has called on elected leaders at all levels to address the smouldering crisis arising from regional agitations across Nigeria to safeguard the unity of the country.\nHe specifically enjoined the leaders to consciously promote and uphold the rule of law in order to engender peace and harmony.\n“There is in present day Nigeria evidence of remarkable erosion of national unity and seeming whittling down if not abandonment of yester-years lofty projects of national integration.\nThe resurgence of, and violent activism by, insurgents and irredentist militants with a clear agenda for dismemberment of Nigeria, is indicative of the sorry state of national unity.\nThose who graced the summit included Ekiti state Governor Dr Kayode Fayemi and General IBM Haruna, who was chairman of the occasion, among several others."
  },
  {
    "headline": "BREAKING: Court Orders DSS To Allow Nnamdi Kanu Maximum Comfort, Practice His Faith In Detention",
    "summarized_story": "The Federal High Court sitting in Abuja has ordered the Department of State Services (DSS) to allow the leader of the proscribed IPOB group, Nnamdi Kanu to have maximum possible comfort while in their custody.\nThe trial judge Justice Binta Nyako who gave the order on Thursday also ordered the DSS to allow Nnamdi Kanu to have a change of clothes, give him medical attention and allow him to practice his faith.\nThe lawyer also said it is not mandatory that Nnamdi Kanu be in court for the hearing.\nEarlier, there were expectations that Nnamdi Kanu would be making an unscheduled appearance in court but eventually, he was absent.\nNnamdi Kanu is facing charges bordering on alleged terrorism and treasonable felony."
  },
  {
    "headline": "Nnamdi Kanu: Idea Of Pardon Is Premature, Says Malami",
    "summarized_story": "The Attorney-General of the Federation (AGF) and Minister of Justice, Abubakar Malami, has said that the issue of pardoning the leader of the proscribed Indigenous People of Biafra, Nnamdi Kanu, is premature.\nMr Malami stated this on Wednesday while appearing as a guest on Channels Television’s Politics Today.\n“Pardon is a function of conviction in the Nigerian context and as far as I know, Nnamdi Kanu has not been convicted yet so the idea of pardoning him is premature,” the AGF asserted.\nButtressing his point, the minister stated that the trials associated with Kanu have not been concluded and as such the pardon option cannot get on the table just yet.\nPresident Buhari further stated that Kanu should go make his case in court instead of giving very negative impressions of the country from outside."
  },
  {
    "headline": "Ramaphosa’s Visit Was Successful Despite Omicron Scare, Says Buhari",
    "summarized_story": "﻿President Muhammadu has described the visit of his South African counterpart, Cyril Ramaphosa, as successful despite the scare of the new COVID-19 omicron variant.\nBuhari made the comment at a joint press conference with Ramaphosa at the State House in Abuja on Wednesday.\nThe President equally expressed optimism that the establishment of the Youth Dialogue initiative would promote peace-building and development that would enable both countries to jointly combat youth restiveness.\nOn his part, the South African leader thanked the Nigerian government for showing solidarity with his country, calling for the lifting of the travel ban imposed on his nation and others over the Omicron COVID-19 variant.\nAccording to him, the move, if not reversed, will severely affect the countries’ economies, describing it as discriminatory."
  },
  {
    "headline": "NCDC Confirms Three Cases Of Omicron Variant In Nigeria",
    "summarized_story": "The total number of the Omicron variant of COVID-19 confirmed in Nigeria is now three, the Nigeria Centre for Disease Control (NCDC) said on Wednesday.\n“This genomic surveillance has now identified and confirmed Nigeria’s first cases of the B.1.1.529 SARS-CoV-2 lineage, now known as the Omicron variant,” the NCDC boss said.\nArrangements are also being made to notify country where travel originated according to the provisions of the International Health Regulations.”[READ ALSO] Omicron Variant: Canada Bans Travellers From Nigeria, Egypt And MalawiAccording to him, the NCDC assumes Omicron is widespread globally given the increasing number of countries reporting the variant.\nThe focus for the agency, he stated, was to complete sequencing of recently accrued samples of SARS-COV-2 positive travellers from all countries, especially those from countries that have reported the Omicron variant already.\nThe NCDC chief revealed that since reports of the emergence of the Omicron variant, the Federal Ministry of Health, through the NCDC, has intensified public health response measures to COVID-19."
  },
  {
    "headline": "Kaduna Govt Sacks 233 Teachers For Presenting Fake Certificates",
    "summarized_story": "The Kaduna State Government has sacked 233 teachers for presenting fake certificates upon the time of their recruitment.\nHe said the teachers were sacked after inquiries from the institutions they claimed to have attended, which showed that they presented fake certificates.\n“The responses from the institutions show that 233 teachers presented fake certificates.\nOne institution disowned 212 of these 233 fake certificates.\n“The Board will dismiss the 233 teachers who presented these fake certificates, while their files will be forwarded to the Ministry of Justice to initiate prosecution for forgery."
  },
  {
    "headline": "Fayemi gives Dec 18 deadline to governorship aspirants to resign position -",
    "summarized_story": "Ekiti State Governor, Kayode Fayemi has directed anyone serving in his government who would like to contest the governorship primaries to tender his or her resignation latest by December 18th.\nThe directive was contained in a statement signed by the Governor’s Chief Press Secretary, Yinka Oyebode, in Ado-Ekiti on Wednesday.\nThe development, according to the statement, became imperative in order to ensure cohesion and excellent service delivery – two major hallmarks of the administration- remain uncompromised.\nIn compliance with directives of the Independent National Electoral Commission (INEC), the ruling All Progressives Congress (APC) in Ekiti State has slated the governorship primaries for January, ahead of the June 2022 governorship election."
  },
  {
    "headline": "Presidents Buhari, Ramaphosa sign new areas of understanding -",
    "summarized_story": "The Presidents of Nigeria Muhammadu Buhari and South Africa Cyril Ramaphosa, have signed crucial Memoranda of Understanding expected to further integrate the economies of the two countries and ensure their prosperityBoth leaders expressed optimism that the agreements would strengthen relations in industry, finance, culture and youth developmentPresident Ramaphosa is particularly pleased at the show of solidarity by leaders of Nigeria, Cote D’Ivoire, Ghana and Senegal for expressing their dissatisfaction with the travel ban imposed on South Africa and sister neighbouring countries in the aftermath of the discovery of the Omicron COVID-19 variant by South African scientistsThe meeting between the two leaders resulted in the signing of new Memoranda of Understanding (MOUs) while existing ones were reviewed for the progress and prosperity of citizens of both countries."
  },
  {
    "headline": "Soludo wins again as high Court dismisses suit seeking his disqualification",
    "summarized_story": "The federal high Court dismisses suit seeking Charles Soludo”s disqualification as Anambra governor-elect.\nA federal high court in Abuja has dismissed a suit seeking disqualification of Charles Soludo as the governor–elect for Anambra state.\nJustice Taiwo Oladipupo Taiwo in a judgment described the suit as frivolous, irritating and lacking in merit.\nThe Judge awarded a punitive cost of N2M against the two plaintiffs to be paid to Mr Soludo and his deputy, Mr Ibezim.\nThe plaintiffs in the suit alleged that the Mr Soludo summited false information to INEC in his form EC9 by not establishing he was contesting for the position in Anambra state."
  },
  {
    "headline": "Ekiti South makes case to produce next governor -",
    "summarized_story": "Major players in the Political Space from the Ekiti South Senatorial District have converged on Ado Ekiti to deliberate on taking their chances at the Next Gubernatorial Election slated for June in Ekiti State.\nIrrespective of political affiliation, aspirants gathered at the Eagle Hall Ado Ekiti with thousands of their supporters to make their resolve on what they describe as the right of the South.\nSince 1999, Ekiti Central has Produced Governor on three occasions, and the North has Produced on three occasions, with the south yet to get the Plum JobThe Meeting is Spearheaded by Ekiti Concerned Group who are insisting that Ekiti South Senatorial District in the State should be given equal opportunity to serve the StateThe Calibre of Aspirants from the All Progressives Congress and the People’s Democratic Party gives a Pointer to the resolve of these Group to ensure the South Produces the next Governor of the StateSome of the Aspirants Present include: Biodun Olujimi (PDP Senator) ;Femi Bamisile,APC House of Reps Member; Bolaji Aluko,DG office of Transformation and Strategy in Ekiti State; Bamidele Faparusi, Commisioner for Infrastructure and Public Utilities,Kayode Adaramodu of the PDP and many others."
  },
  {
    "headline": "WTA Suspends Tournaments in China over Peng Concerns",
    "summarized_story": "The Women’s Tennis Association (WTA) on Wednesday announced the immediate suspension of all tournaments in China due to concerns about the well-being of former doubles world number one Peng Shuai and the safety of other players.\nBut Simon, who said the decision to suspend tournaments in China had the full support of the WTA Board of Directors, said they were not convinced all was well with Peng.\n“This is yet another reason why women’s tennis is the leader in women’s sports.”Martina Navratilova also signalled her support on Twitter, suggesting the IOC “take note”.\nBut Simon, who said the decision to suspend tournaments in China had the full support of the WTA Board of Directors, said they were not convinced all was well with Peng.\n“This is yet another reason why women’s tennis is the leader in women’s sports.”Martina Navratilova also signalled her support on Twitter, suggesting the IOC “take note”."
  },
  {
    "headline": "Omicron: Nigeria to Push for Mass Vaccination, Not Travel Ban – Arise News",
    "summarized_story": "In a related development, NCDC said it had begun contact tracing on three persons who tested positive for the Omicron variant of COVID-19.\nHe explained that regardless of his recommendations from a technical perspective, a ban was not on the cards for the NCDC.\nAccording to him, “We are currently the subject of travel bans ourselves for reasons that are not driven by science.\n“This genomic surveillance has now identified and confirmed Nigeria’s first cases of the B.1.1.529 SARS-CoV-2 lineage, now known as the Omicron variant.\nThe NCDC statement said, “Since reports of the emergence of this Omicron variant, the Federal Ministry of Health, through the NCDC, has intensified public health response measures to COVID-19 in Nigeria."
  },
  {
    "headline": "Japan Retracts New Flight Bookings Ban after Criticisms",
    "summarized_story": "Japan says it has retracted a ban on new incoming international flight bookings to defend against the new variant of the coronavirus only a day after the policy was announced, following criticisms that it was an overreaction.\nThe ministry said Thursday it has retracted the request after receiving criticisms that the ban was too strict and tantamount to abandoning its own people.\nPrime Minister Fumio Kishida said the quick reversal of the policy took into consideration Japanese nationals’ traveling needs.\nHe said the transport ministry has retracted the request for a uniformed stoppage on new bookings.\nNew bookings can be made as long as there is room under this cap, said transport ministry official Hitoshi Inoue."
  },
  {
    "headline": "White Paper Complied with Law on #EndSARS Report, Says Lagos AG",
    "summarized_story": "So, it is not that Lagos State Government just conjured things from the air.\nHis words: “The federal government never put the Lagos State Government under any pressure to discredit the panel or anybody.\n“Even yesterday, in his speech, which he made before the White Paper was released, he thanked them again.\nLagos State Government has fulfilled all its promises to the public.\nWe set up an independent panel, we said we will release a White Paper and we did."
  },
  {
    "headline": "Gov. Diri Visits Spill Site in Nembe",
    "summarized_story": "It appears the people of Nembe will have to wait for another week for AITEO Eastern Exploration And Production Company to stop the oil spill from its wellhead.\nThat was what an official of a company contracted to stop the spill told Governor Douye Diri when he visited the site of the pollution.\nARISE Correspondent, Ovieteme George has the details…"
  }
]